{
  "article_id": "b47c60321a28",
  "url": "https://www.realitytvworld.com/news/the-golden-bachelor-star-mel-owens-talks-about-falling-in-love-with-multiple-women-35516.php",
  "title": "  The Golden Bachelor  star Mel Owens talks about falling in love with multiple women",
  "date": "20251022T234500Z",
  "domain": "realitytvworld.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "The Golden Bachelor star Mel Owens has revealed if he fell in love with multiple bachelorettes while filming Season 2.\nADVERTISEMENT\nRELATED LINK: 'THE BACHELOR' FRANCHISE COUPLES NOW: WHO IS STILL TOGETHER?? (PHOTOS)\n\"No, I'm not going to fall in love twice,\" Mel told the magazine. \"Conflict is good for the show but not good for the heart.\"\nWhen asked if viewers will watch him say \"I love you\" at all on the show, Mel admitted, \"It's got to be a true feeling.\"\nMel continued, \"You just can't say the words because then they'd be hollow. I can say, 'I really like you,' and that's meaningful. To fall in love, it takes some time.\"\nMel insisted that he was able to keep a clear head and remain calm under pressure during his journey, which helped him make logical choices.\n\"In football, they're always trying to trick you. There's a lot of commotion going on, a lot of noise,\" Mel said.\n\"When things are crazy, I get really calm, and you can make decisions better.\"\nOn The Golden Bachelor episode that aired on October 15, Mel determined his Final 3 bachelorettes: Cindy Angelcyk Cullers, a 60-year-old retired biomedical engineer from Austin, TX; Debbie Siebers, a 65-year-old fitness professional from Denver, CO; and Peg Munson, a 62-year-old retired firefighter and bomb tech from Las Vegas, NV.\nCarol Freeman quit the competition and left The Bachelor mansion because Mel had never taken her on a one-on-one date and so she didn't feel ready to introduce him to her family.\nAnd Mel denied roses to Cheryl Steele, a 66-year-old retired IRS employee from Englewood, CO, and Nicolle May, a 64-year-old yoga instructor from Miami Beach, FL, at the Rose Ceremony preceding his Final 3 women's hometown dates.\nRELATED LINK: 'THE BACHELOR' COUPLES NOW: WHO DID 'THE BACHELOR' STARS AND THEIR BACHELORETTE PICKS ACTUALLY END UP MARRYING? (PHOTOS)\nFOLLOW REALITY TV WORLD ON THE ALL-NEW GOOGLE NEWS!\nReality TV World is now available on the all-new Google News app and website. Click here to visit our Google News page, and then click FOLLOW to add us as a news source!\nWhen Mel walked Nicolle out, the bachelorette told Mel to call her when his relationship with his The Golden Bachelor winner \"doesn't work out.\"\nAnd Nicole told the cameras that she was \"surprised\" by the outcome of the Rose Ceremony.\n\"I really thought it was going to be my name [called]. It should've been! But that's okay because it's just the universe's way of saying something is better for me just around the corner,\" Nicolle said.\nCheryl, for her part, was quite torn up about her exit, but she said she had an \"amazing journey\" on the show overall.\n\"My heart is broken. It feels empty right now,\" Cheryl admitted to the cameras in her final words.\n\"I have this love that built up for Mel ever since I met him, and to be going home, you know, without Mel and without him going to my hometown, it hurts. It hurts inside my heart. I can't believe this.\"\nIn a preview of what's to come on The Golden Bachelor's October 22 episode, Mel says he hadn't met a woman's family in over 25 years.\n\"He is everything I've ever wanted and more,\" Debbie tells a loved one.\nADVERTISEMENT\nCindy then cries, \"I might the big 'L' -- love him.\"\nCindy, however, questions if she's \"missing something\" with Mel, who may not love her back.\nAnd it appears Mel isn't \"in love\" with any of the bachelorettes yet.\nRELATED LINK: 'THE BACHELORETTE' COUPLES NOW: WHOM DID 'THE BACHELORETTE' STARS AND THEIR BACHELOR PICKS ULTIMATELY END UP WITH?! (PHOTOS)\nPeg's daughter fears Peg isn't being appreciated \"as much as she deserves.\"\nMel then admits he's feeling \"conflicted\" about his Final 3 women.\n\"It's going to be a really difficult decision,\" Mel concludes.\nInterested in more The Bachelor news? Follow our Bachelor Nation News Page on Facebook or join our The Bachelor Facebook Group!\nAbout The Author: Elizabeth Kwiatkowski",
  "word_count": 671,
  "scraped_at": "2026-02-14T13:43:28.988050"
}