{
  "article_id": "b48173a5a3d6",
  "url": "https://punchng.com/olympics-banyana-coach-expects-hostile-reception-in-abuja/",
  "title": "Olympics : Banyana coach expects hostile reception in Abuja",
  "date": "20240328T010000Z",
  "domain": "punchng.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Banyana Banyana coach Desiree Ellis expects a hostile reception in Abuja when South Africa face Nigeria in the final round of the qualifiers for the women’s football event of the 2024 Paris Olympics, PUNCH Sports Extra reports.\nThe Super Falcons are set to take on the Banyana in a two-match series, with the first encounter slated for April 5 at the Moshood Abiola National Stadium in Abuja and the return leg on April 9 at the Loftus Versfeld Stadium in Pretoria.\nEllis’s women have emerged favourites to pick one of the two tickets from Africa following the recent results between the two countries.\nBanyana have claimed four victories from their last five meetings against the Falcons, with their last encounter at the 2022 Women’s Africa Cup of Nations in Morocco ending 2-1 in favour of the South Africans.\nSpeaking ahead of the highly-anticipated game between the two rivals, Ellis, who welcomed back four of her experienced players, said she was happy to have the players back as their experience would be needed at the anticipated hostile reception in Nigeria.\n“I’m happy we have these players back. That warms my heart and is encouraging because those are our more experienced players and their experience is going to help in this situation,” she said.\n“It might be hostile and we know how passionate the fans of Nigeria are — we need that experience to get over this hurdle.\n“It will be a tough match because they haven’t been in the Olympics since 2008 and their team has changed a bit since we last played them (at the 2022 WAFCON).\n“They’re still one of the best teams on the continent. They’ve been serial winners (Nigeria have won 11 of 14 WAFCON titles) and have been consistent over the past few years. We’re in the same bracket but we’ve got to be consistent.”\nThe winners will join Brazil, Japan and world champions Spain in Group C in the eight-team tournament in Paris in July and August.\nOnly five African countries (Nigeria, Cameroon, South Africa, Zimbabwe and Zambia) have taken part in the women’s Olympic football tournament since its inception in Atlanta in 1996.",
  "word_count": 359,
  "scraped_at": "2026-02-14T12:31:46.637780"
}