{
  "article_id": "b4ae6ed8f514",
  "url": "https://www.etonline.com/chiefs-owners-daughter-gracie-hunt-on-taylor-swift-travis-kelce-love-story-unfolding-217046",
  "title": "Chiefs Owner Daughter Gracie Hunt on Taylor Swift - Travis Kelce  Love Story  Unfolding",
  "date": "20231228T234500Z",
  "domain": "etonline.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Gracie couldn't help but sing the 'Midnights' singer's praises in a recent interview.\nTaylor Swift's relationship with Travis Kelce and her newfound fandom for the Chiefs has been good for Kansas City and women new to the NFL, so says the daughter of Kansas City Chiefs owner Clark Hunt.\nGracie Hunt appeared on Outkick The Morning with Charly Arnolt and the 24-year-old couldn't stop raving about what Swift means to the heart of America. And, just like the rest of America, Gracie's also fully invested in the Midnights singer's relationship with one of the best tight ends in NFL history.\n\"First of all, I think we're all so excited to see two such phenomenal people happy,\" said Gracie when asked about the brighter spotlight Swift has shined on Kansas City amid her budding romance with Kelce. \"It's so easy for us to cheer for -- and for the entire world -- to cheer for because they're so wonderful for each other. And it's just been so fun to watch this love story unfold. That's just been so special to see, how happy they are.\"\nShe added, \"Also, how so many young, especially female fans, watching football, interested in football, maybe considering playing flag football, and also cheering for the Chiefs.\"\nThe \"Anti-Hero\" songstress has almost quite become a permanent fixture at Chiefs games (when her busy schedule allows her to do so) this season. Gracie says since Swift attended her first game this season, she's noticed so many more female fans in the stands.\n\"Whatever reason you're there for, I'm glad you're there and I'm glad you're getting to experience the game that I fell in love with when I was little,\" Gracie said. \"Because as someone who's watched it, there's so many values from football that transfer into life and can have really great takeaways.\"\nBut there's no doubt that Swift's attendance has had a noticeable impact in Kansas City.\n\"She is wonderful, beautiful, brilliant, all the things,\" Gracie said. \"And it's been so much fun to get to have her coming to Chiefs games.\"\nShe added, \"We're so happy and excited for them.\"\nSwift's become such a fixture at Arrowhead Stadium, even the team owners presented her with a sparkly new accessory to celebrate her 34th birthday. It was Gracie who shared on Instagram the contents inside the beautifully wrapped gift box.\n\"Happy birthday to this queen!💖 Bright, beautiful, beyond talented and engaging…easiest decision Time Magazine ever made for Person of the Year. Hope it’s your best & most blessed year yet!\" she wrote. \"Thank you @joshie_82 and @neimanmarcusnorthpark for procuring the perfect @judithleiberny gift!🎤✨\"\nJudith Leiber is known for offering a wide range of jewel-encrusted, novelty designer bags that are made to look like other items. With her use of the microphone emoji, Gracie appears to be referencing one of the Judith Leiber Couture microphone clutches -- each of which retails for $4,995.\nGracie's sister, Ava Hunt, and mom, Tavia Hunt, also posted similar snaps with Swift, all alongside that purple gift box with a tag reading, \"To Taylor, from the Hunt family.\"\nRELATED CONTENT:",
  "word_count": 518,
  "scraped_at": "2026-02-14T13:10:06.624710"
}