{
  "article_id": "b4ae5074a910",
  "url": "https://www.lrb.co.uk/blog/2025/july/something-special",
  "title": "Natasha Chahal | Something Special",
  "date": "20250714T193000Z",
  "domain": "lrb.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Something Special\nNatasha Chahal\nTo cash in on the Women’s Euros, the one-time sportswear giant Admiral has partnered with the Spice Girls to release a limited edition football shirt that promises to spice up your life.\nAt the last final, in 2022, when England beat Germany to win the tournament 2-1, Geri Halliwell, aka Ginger Spice, was photographed celebrating with Nadine Dorries, who captioned her Instagram post: ‘Girl power radiating from Wembley tonight’. Liz Truss was also there and Halliwell apparently encouraged her to ‘go for it’ in the leadership race against Rishi Sunak. Three months later Truss spiced up her life a bit too much and accidentally tanked the economy. Halliwell’s Tory affiliations are long-standing. In 1996 she had told the Spectator that ‘we Spice Girls are true Thatcherites. Thatcher was the first Spice Girl, the pioneer of our ideology.’\nMelanie Chisholm, aka Sporty Spice, was also at the final at Wembley in 2022. ‘I’m from Liverpool,’ she told the Independent later that year, when asked about the Spectator interview. ‘There have been a couple of times in my career when I’ve been nervous about going home, and that was one of them.’ Melanie C was one of the eleven women of Hope FC who sang ‘Call Me a Lioness’ for the 2023 World Cup. (All five Spice Girls had sung on England United’s ‘[How Does It Feel to Be] On Top of the World’, the official song for the 1998 Men’s World Cup.)\nThe game needs more than slogans and anthems, as a series of announcements from clubs last summer made clear. Thornaby FC announced they would be axing their women’s and girls’ teams. (Following protests, the decision was reversed and nine months later Thornaby won the North-East Regional Women’s League.) Reading FC withdrew from the FA Women’s Championship, citing lack of funding. Blackburn Rovers announced that their women players would receive only minimum wage. The Lionesses’ captain, Leah Williamson, who has been with Arsenal since she was nine years old, told the Times she wasn’t ‘earning enough to retire’.\nWhen tickets for Euro 2025 went on sale last year, UEFA made the usual noises about igniting passion, inspiring the next generation and celebrating progress – platitudes that have been repeated in much of the coverage. The tournament slogan is ‘The Summit of Emotions’ but watching the lacklustre if enthusiastic opening ceremony in Basel on 2 July I could only summon the memory of the dance routines my friends and I would perform in the school playground and I now feel deeply sorry for our parents who were made to watch.\nSpain, the current world champions, beat Portugal 5-0 in their opening match, demonstrating why they are favourites to win this tournament too. The first goal came within ninety seconds, with three more before half time. The biggest surprise of the match was that Alexia Putellas scored only once (she later put two away against Belgium).\nThis is the first time that Wales have qualified for a major championship. In 2003 the FAW withdrew the team from the European Championships because travelling to Belarus, Estonia, Israel and Kazakhstan for their qualifying matches was too expensive. Jess Fishlock, who was playing for the Under-19s in 2003, scored Wales’s first goal, in their 4-1 defeat by France. At 38 she is the oldest person to score in the history of the Women’s Euros, which she said after the match she’d take as a compliment at some point.\nEngland’s 2-1 loss to France was a better result than I’d feared. No one was sure if Lauren James would be back from injury and many of the mainstays from previous major tournaments are no longer playing, not least Mary ‘Queen of Stops’ Earps. Fran Kirby has retired from international play because of injury. Millie Bright is also not playing for health reasons.\nEarps’s replacement in goal, Hannah Hampton, used to be a striker, as you could see from the way she helped set up James’s opening goal in England’s 4-0 win against the Netherlands, with a high-powered precision pass to Alessia Russo. (Russo’s brother Giorgio was conveniently dumped from the Love Island villa the next day. He can now at least go to Switzerland to watch England play Sweden in the knockout stage.) But it was a relief to see Hannah Cain smash one past Hampton in the 76th minute of England v. Wales last night, in what would otherwise have been a 6-0 demolition.\nJames’s redemption arc has been satisfying to witness. In 2023 she was sent off towards the end of England’s second-round match against Nigeria for treading on Michelle Alozie. James doesn’t seem to enjoy media attention and, as one of the few Black players in the England squad, arguably has more to deal with than many of her teammates. ‘I think haters always fuel me,’ she has said of the racist abuse she has received. ‘I always just try to let my feet talk.’ And she has the support of other players. Lucy Bronze – the immensely experienced defender and powerhouse of the England team – said recently of James:\nShe’s probably the best player in this entire tournament for being able to create something special. There’s a lot of special players in this tournament, the likes of Putellas and Bonmatí, a huge number of talented players, but LJ’s got that something special. She’s only young, she’s not at 100 per cent yet, so hopefully we get through the tournament and she just keeps getting better and better.\nAn endorsement from Lucy Bronze is more meaningful than a thousand inspirational slogans. But as Thornaby, Reading, Blackburn and Wales will tell you, girls just wanna have funds.",
  "word_count": 948,
  "scraped_at": "2026-02-14T13:01:51.876817"
}