{
  "article_id": "b4afc2830159",
  "url": "https://www.macombdaily.com/2023/04/17/macomb-county-all-academic-honorees/",
  "title": "Macomb County All Academic honorees named",
  "date": "20230417T210000Z",
  "domain": "macombdaily.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Class A\nJACOB TKACZYK\nAnchor Bay High School\nPrincipal: Jeffrey LaPerriere\nParents: Eva Tkaczyk and Arthur Tkaczyk\nA 4.0 student at Anchor Bay, he earned a 1480 on the SAT. Future plans include possibly attending the University of Michigan to major in computer science/engineering.\nJacob is an Athletic Department Digital Media Intern, DECA chapter vice president and captain of the track team. Honors received include AP Scholar with Distinction, valedictorian, DECA State finalist and National Rural and Small Town Scholar.\nHe said his parents, Eva and Arthur Tkaczyk have been influential in his academic career. “They’ve given me everything. I’d like to give it all back tenfold one day”, along with his seventh grade football coaches Doug Zielecki and Tony Hall. “Believed in me to be a starting running back and motivated me to continue to work hard to achieve the things I want.”\nGJONPJER KOLA\nChippewa Valley High School\nPrincipal: Todd Distelrath\nParents: Pjerin and Dila Kola\nA 4.0 student at Chippewa Valley, he earned a 1470 on the SAT. Future plans include attending the University of Michigan’s College of Engineering to major in engineering.\nGjonpjer has been involved as president of the school chess club, as a math tutor for any subject or grade and National Honors Society. Honors received include AP Scholar with Distinction, Summa Cum Laude and class rank 1.\nHe said, “My AP United States and European History teacher, Mr. Brian Eovaldi, has influenced me the most in my academic career. His lectures on Western history taught me to appreciate the beauty of humanistic pursuit and thus pursuing knowledge. This, coupled with his wisdom, led to my developing a philosophy in which academic success is one of its chief virtues.”\nLOGAN LEITCH\nChippewa Valley High School\nPrincipal: Todd Distelrath\nParents: Elizabeth Leitch and Benjamin Leitch\nA 4.0 student at Chippewa Valley, he earned a 1440 on the SAT. Future plans include attending Michigan Tech University to major in cybersecurity.\nLogan has been involved with volunteering with his church and in the Teen Coalition Teen Council. Honors received include Chippewa Valley High School choirs Directors Award, Division 1 State Solo and Ensemble ranking and Honor Roll\nHe said his choir teacher, Mr. James Pecar, has been the most influential in his academic career. “He taught me that school isn’t just work, but an experience to have fun with.”\nSARAH NSEIR\nChippewa Valley High School\nPrincipal: Todd Distelrath\nParents: Shelly Nseir and Sami Nseir\nA 4.0 student at Chippewa Valley, she earned a 1440 on the SAT. Future plans include attending the University of Michigan, Ann Arbor to major in aerospace engineering.\nSarah has been involved with I.AM. Robot and A Beautiful Me STEM Camp, Lego Robot Girl Scouts camp, Macomb Community College FRC Competition set up and tear down. Honors received include the FIRST Dean’s List, Awardee in the Elegoo Robots on the Road Autonomous Robot Challenge, interviewee for Detroit Driven, two year Solo and Ensemble state qualifier and an Honor Roll student.\nSarah said her father, Sami Nseir, has been the most influential in her academic career. “My father immigrated from Lebanon when he was a teenager. With little help (and while working minimum wage jobs), he earned his citizenship, a GED and an associate degree. Then he married my mother, started a family and now works as an automatic systems control designer. Through stories and my own eyes, I have witnessed my dad create a life that he can be proud of — regardless of the obstacles in his way. His actions have taught me that hard work, grit and determination are required for success. This motivates me to excel in academics because the hard work I put in today will grow into a future that will bring me joy.”\nLAUREN BLASE\nCousino High School\nPrincipal: Andre Buford\nParents: Russel and Jennifer Blase\nA 4.8 student at Cousino, she earned a 1440 on the SAT. Future plans include attending Kettering University to major in mechanical engineering.\nLauren has been involved with Relay for Life, I Heart Dogs Rescue Center and the Salvation Army Bed and Bread Club. Honors received include first place in the Detroit Science Fair Physics and Astronomy, second place in the Butcher Science Fair physics and L.I.T.E.S. scholarship recipient.\nShe said her physics teacher, Mr. McMillan has been the most influential in her academic career. “He has encouraged me to have fun learning by basing my research through topics that interest me.”\nNOAH CAFAGNA\nCousino High School\nPrincipal: Andre Buford\nParents: Harmonie Cafagna and Dave Cafagna\nA 4.731 student at Cousino, he earned a 1450 on the SAT. Future plans include attending the University of Michigan to major in mechanical engineering.\nNoah has been involved with Michigan Youth Leadership Conference, National Honors Society and Mission MMSJC. Honors received include National Merit Scholarship Commended Student, 2021 Michigan Statistics Poster Competition Honorable Mention, 2022 Michigan High School Athletic Association baseball All-Academic team, US Metric Association award at SEFMD.\nHe said, “The person who has been most influential in my academic career is my father, Dave Cafagna. He has been a constant positive influence on my work ethic in and out of school. Witnessing his leadership in his work and through coaching has inspired me to work hard and be a strong leader in the classroom and in sports.”\nCHLOE HILGENDORF\nDakota High School\nPrincipal: Kevin Koskos\nParents: Kris and Gina Hilgendorf\nA 4.130 student at Dakota, she earned a 1460 on the SAT. Future plans include attending the University of Michigan or Michigan State University Honors College/Lyman Briggs to major in biology (pre-med).\nChloe has been involved as treasurer of the Senior Class Council, probation officer for the National Honors Society and as a member of the Coalition Teen Council. Honors received include AP Scholar Award from College Board, Honor Roll and Summa Cum Laude.\nShe said, “My parents, Kris and Gina Hilgendorf, influenced me the most in my academic career by always supporting and encouraging me throughout my life. I want to thank them for always believing in me and teaching me I can do anything I set my mind to.”\nSAARIM IGBAL\nDakota High School\nPrincipal: Kevin Koskos\nParents: Shumaila Igbal and Asit Igbal\nA 4.3 student at Dakota, he earned a 1530 on the SAT. Future plans include attending the University of Michigan, Ann Arbor to major in molecular biology.\nSaarim has been involved with the community as a volunteer at the Autism Spectrum Disorder Friendship Club for two years. Honors received include National Merit Finalist, , Class rank 1, state medalist for HOSA and Da Vinci Award for best Science Olympian in the region.\nHe said, “My friend’s parent, Kimberly Popso has influenced me the most because she taught me how to put in effort and dedication despite the obstacles that are in front of you.”\nJOHN PETERS\nDakota High School\nPrincipal: Kevin Koskos\nParents: Janet Peters and Anthony Peters Jr.\nA 4.167 student at Dakota, he earned a 1460 on the SAT. Future plans include attending the University of Michigan, Ann Arbor to major in engineering.\nJohn has been involved with the community as a member of National Honors Society, umpiring Little League baseball and Altar Serving at St. Sharbel Maronite Catholic Church. Honors received include Cougar Academic award for cross country, Math Honors Society, Most Improved Award for cross country, AP Scholar with Distinction, Summa Cum Laude..\nHe said, “My grandmother, Ann Scapini, influenced me greatly during my academic career. The love and support she showed me throughout her life inspired me to persevere towards my goals and make her proud.”\nDANIEL PETKOSKI\nDakota High School\nPrincipal: Kevin Koskos\nParents: Biljana Petkoski and Goran Petkoski\nA 4.153 student at Dakota, he earned a 1470 on the SAT. Future plans include attending college to major in computer science.\nDaniel has been involved with the community with National Honors Society tutoring and as scorekeeper for a martial arts club. Honors received include AP Scholar with Distinction, Mu Alpha Theta member, National Honor Society member and being on the honor roll all four years.\nHe said his mom, Biljana Petkoski has been the most influential in his academic career. “My mom always tried to help me whenever I needed help and supported me as I grew. She also inspired me to do well in my classes.”\nJOSHUA SOSNOSKI\nDakota High School\nPrincipal: Kevin Koskos\nParents: Magda Sosnowski and Ed Sosnowski\nA 4.116 student at Dakota, he earned a 1490 on the SAT. Future plans include attending the University of Michigan to major in aerospace engineering.\nJoshua has been involved with the community with volunteering at Our Lady of Czestochowa Church, coaching ice hockey goalies and as a member of National Honors Society. . Honors received include 2022 You Travel Hockey state champion, 2023 Macomb Area Conference All-Star First Team, 2023 All State Academic Team, and 2023 Chippewa Valley United Team Most Valuable Player.\nHe said his mother, Magda Sosnowski, has been the most influential in his academic career. She immigrated here from Poland in high school and passed English class with prior experience with the language. I have always believed that if she could that than I have excuse for not acing my classes.”\nEVA STEVANOVIC\nDakota High School\nPrincipal: Kevin Koskos\nParents: Dragan Stevanovic and Aorica Markovic\nA 4.139 student at Dakota, she earned a 1440 on the SAT. Future plans include attending the University of Michigan College of Engineering to major in computer science.\nEva has been involved as a member of National Honors Society and Spanish Honors Society. Honors received include first person to be awarded first team All-State for tennis at Dakota, Macomb County Most Valuable Player for tennis, MAC White Most Valuable Player for tennis, AP Scholar Award and Academic All-State for tennis.\nShe said, “Zonica Markovic and Dragan Stevanovic, my parents, have influenced me most in my academic career because they helped me discover my competitiveness and drive for learning at a young age and they have supported me through the arduous parts of my academic career.”\nJACOB GERBINO\nDeLaSalle Collegiate\nPrincipal: Keith Kalinowski\nParents: Thomas Gerbino and Katherine Gerbino\nA 4.169 student at DeLaSalle Collegiate, he earned a 1440 on the SAT. Future plans include attending the University of Michigan to major in aerospace engineering.\nJacob has been a memberthe Mock Trial Team, Lasallian community service and Student Council. Honors received include Academic All-State for varsity football, National Honors Society, Scholastic All-Catholic, College Board AP Scholar with Distinction and NMSQT Letter of Commendation.\nHe said: “Both of my parents have influenced my academic career the most by instilling the value of hard work into me. My work ethic comes from them so I can achieve the best that I can. They have provided me with so many other opportunities to learn new things I can never thank them enough.”\nDIVYA BARTLEY\nEisenhower High School\nPrincipal: Brandon Manzella\nParents: Uday Bartley and James Bartley\nA 3.970 student at Eisenhower, she earned a 1490 on the SAT. Future plans include attending college to major in physics.\nDivya has been involved with Science Olympiad. Honors received include AP Scholar awards, valedictorian and National Honors Society.\nShe said, “My parents have influenced me the most in my academic career by setting high expectations and encouraging me.”\nLOGAN BERGLER\nEisenhower High School\nPrincipal: Brandon Manzella\nParents: Monica Bergler and Ken Bergler\nA 4.0 student at Eisenhower, he earned a 1520 on the SAT. Future plans include attending the University of Michigan or Michigan State University to major in computer science.\nLogan has been involved in the community, as supervisor for an event for Division A Science Olympiad and coach for Division B Science Olympiad. Honors received include AP Scholar with Distinction, National Merit Commended Student, Macomb County second team Division 1 tennis and placed in several events at the state level for Science Olympiad.\nHe said “My mother, Monica Bergler, has influenced me the most throughout my academic career. She has always inspired me to do my best and push myself to levels I did not know I could achieve. She also taught me a great work ethic that helped me always stay on top of things and get things done.”\nLUCAS DESOUSA\nEisenhower High School\nPrincipal: Brandon Manzella\nParents: Marina DeSousa and Joe DeSousa\nA 3.938 student at Eisenhower, he earned a 1470 on the SAT. Future plans include attending the University of Michigan to major in biomedical engineering.\nLucas has been involved in the community, volunteering at Macomb Humane Society as a canine companion, sorting medical supplies for the World Medical Relief and tutoring Utica Community School students. Honors received include varsity cross country, varsity swim, National Honors Society and AP Scholars Award with Distinction.\nHe said that Simarjit Singh has been the most influential in his academic career. “He gave me a competitive environment for me to thrive.”\nTYLER FARMER\nEisenhower High School\nPrincipal: Brandon Manzella\nParent: Jennifer Farmer\nA 4.0 student at Eisenhower, he earned a 1450 on the SAT. Future plans include attending the University of Michigan. He is undecided on a major, but considering mechanical, aerospace and electrical engineering.\nTyler has been involved with the community, having done community service with his dad restoring Edsel Ford’s old farmhouses, working at Mr. C’s car wash vacuuming out people’s cars and helping his grandfather inspect houses for people before they purchased them.\nHonors received include National Junior Honor Society member in ninth grade and received certificate for completing all service hours, Honor Roll every year in high school, chosen for the Macomb All-Academic team and granted the HAIL scholarship at the University of Michigan for free tuition for four years.\nHe said “My parents, Ronald Farmer and Jennifer Farmerwere my greatest influences. They always believed I would be capable of great things and they taught me to believe it too. They and I have been through a lot over the past several years and their continuous strength and perseverance motivates me to work hard and chase my dreams. My parents are my greatest inspiration and everything I do, I do to make them proud.”\nKYLE KIRSCH\nEisenhower High School\nPrincipal: Brandon Manzella\nParents: Stacey Jennifer Kirsch and Matthew Kirsch\nA 3.967 student at Eisenhower, he earned a 1470 on the SAT. Future plans include attending the University of Michigan to major in biology.\nKyle has been involved in the community. Kyle has been a volunteer at the Humane Society of Macomb, National Honors Society and volunteering at Trinity Lutheran Church. Honors received include Cross Country Perseverance award, AAPPL proficient German speaker, AP Scholar and valedictorian.\nHe said his parents, Jennifer and Matthew Kirsch, have been the most influential in his academic career. “They always encouraged me to do well in school academically. They showed me the hard work it would take to be accepted at the University of Michigan.”\nHAILEY NIGHTINGALE\nEisenhower High School\nPrincipal: Brandon Manzella\nParents: Christina Nightingale and Nathan Nightingale\nA 4.0 student at Eisenhower, she earned a 1500 on the SAT. Future plans include attending Oakland University, though yet undecided on a field of study.\nHonors received include National Merit Scholarship finalist and AP Scholar award.\nShe said her parents have been the most influential in her academic career.\nDANIEL PERKOVIC\nEisenhower High School\nPrincipal: Brandon Manzella\nParent: Marina Perkovic\nA 4.0 student at Eisenhower, he earned a 1480 on the SAT. Future plans include attending Oakland University or the University of Michigan, Ann Arbor to major in political science.\nDaniel has been involved with National Honors Society and Youth for Christ. Honors received include AP Scholar with Honor, Silver Medal National Spanish Exam Level 3 and Excellent Monologue acting at Michigan Thespian Festival.\nHe said his mother, Marina Perkovic has been the most influential in his academic career. “Ever since I was a little kid, my mother always told me the necessity and importance of an education. She moved to the United States to provide me with a better life than hers as well as a college education. “As a result, I am grateful for all that she has done for me as well as pushing me on academics.”\nJACOB WALTERS\nEisenhower High School\nPrincipal: Brandon Manzella\nParents: Abra Walters and Jeff Walters\nA 4.0 student at Eisenhower, he earned a 1510 on the SAT. Future plans include attending the University of Michigan to major in nuclear engineering.\nJacob has been involved in the community by helping with the warming center at a homeless shelter, helping at elementary school Science Olympiad and helped clean Switzer Elementary School’s sixth grade graduation. Honors received include AP Scholar with Distinction, valedictorian, academic Scholar Board of Education recognition and HAIL scholarship.\nHe said his parents have been the most influential in his academic career. “They encouraged the best from me and my brothers with positive words and support wherever and whenever I needed it (unconditional love). The thoughts of helping them retire in comfort also heavily influenced my effort in school.”\nPEYTON WERNER\nEisenhower High School\nPrincipal: Brandon Manzella\nParents: Toni Werner and Brad Werner\nA 4.0 student at Eisenhower, she earned a 1450 on the SAT. Future plans include attending Oakland University to major in finance through the Business Honors program.\nPeyton has been involved as the 50th anniversary chairman in Eisenhower’s student council, organizing events to celebrate 50 generations of Eisenhower graduates and recognize the impact they have had on the school, as a part of a district-wide, student-led Instagram page with students from other high schools in the Utica Community Schools district, with the goal of unite the large district and improve communication between the schools and as a member of project unify, volunteering time towards helping and improving the LCCE program. Honors received include valedictorian, Oakland University Platinum Presidential Scholarship recipient and MASC/MAHS Award of Excellence.\nShe said, “My mom has had the greatest impact on me. She hasn’t let challenges or setbacks stop her from achieving great things and becoming successful. She plays a big part in who I am today. In addition to inspiring me to succeed, she has offered me the constant support and reassurance I have needed throughout my academic career.”\nAUSTIN WILLIAMS\nEisenhower High School\nPrincipal: Brandon Manzella\nParents: Kyle Williams and Leah Williams\nA 3.967 student at Eisenhower, he earned a 1470 on the SAT. Future plans include attending Palvis Honors at Michigan Technological University or the University of Michigan to major in engineering.\nAustin has been involved as vice-president of Project Outreach, a community service club, as clarinet co-section leader for Ike Marching Band and as National Honor Society member. Honors received include AP Scholar with Honors,4.08 weighted grade point average, 5 AP’s and varsity band this year, AP scores three fives, one four and German National Honor Society member.\nHe said Ami Agnetti, third grade teacher from Switzer Elementary, has been the most influential in his academic career. “Miss Agnetti has a tremendous effect on me. She took the time to personally know me and tackle my challenges. She retaught me how to write-I did not know how to start letters at the top and made me, a kid who had barely read, grow to love reading. She even helped me foster advanced math skills.”\nLUKAS ZAHURANIC\nEisenhower High School\nPrincipal: Brandon Manzella\nParents: Kristy Zahuranic and Michael Zahuranic\nA 4.0 student at Eisenhower, he earned a 1480 on the SAT. Future plans include attending the University of Michigan College of Engineering to major in mechanical engineering.\nLukas has been involved working various events at church, tutoring elementary, middle school and high school students and as a member of National Honors Society. Honors received include National Merit Finalist, varsity baseball captain, AP Scholar with Honors and All-State first team academics for baseball.\nHe said his dad, Michael Zahuranic has been the most influential in his academic career. “He has influenced me the most because he has always pushed me to do the best possible and inspired me by proving through hard work, I can get the life I want.”\nBUSHRA KHANAM\nFitzgerald High School\nPrincipal: Amanda Clor\nParents: Ayesha Khanam and Mohammad Ebad Khan\nA 4.1 student at Fitzgerald, she earned a 1310 on the SAT. Future plans include attending the University of Michigan, though is undecided on a field of study.\nBushra has been involved with NSCDC, arranged and distributed food to those who needed assistance and through National Honor Society arranged donations for Afghanistani refugees. Honors received include Baurbugh Scholar, earned Honor Roll and earned Principal’s Honor Roll.\nShe said, “My family inspired me to be better and always persevere.”\nJESSICA REINHART\nFraser High School\nPrincipal: Ryan D. Sines\nParents: Jennifer Reinhart and Steven Reinhart\nA 4.0 student at Fraser, she earned a 1450 on the SAT. Future plans include attending Michigan Technological University, though yet undecided on a field of study.\nJessica has been involved with fundraising for Turning Point Macomb, volunteering for the Humane Society of Macomb and local park clean up. Honors received include National Art Honor Society, Excellent Award for the Science and Engineering Fair of Metropolitan Detroit, Commendation for National Merit Scholarship and Quill and Scroll Journalism Honor Society.\nShe said her mother has been the most influential in her academic career. “Jennifer Reinhart, my mother, for all the time and sacrifices she has made for me. She’s always reminded me to enjoy life and take care of myself. Thank you!”\nETHAN AHMED\nHenry Ford II High School\nPrincipal: Lori Singleton\nParents: Kabir Ahmed and Syeda Ahmed\nA 4.24 student at Henry Ford II, he earned a 1480 on the SAT. Future plans include attending the University of Michigan, Ann Arbor to major in biochemistry or microbiology.\nEthan has been involved with volunteering at his mosque and school events. Honors received include AP Scholar with Distinction and Congressional App Challenge winner.\nHe said his dad, Kabir Ahmed, has been the most influential in his academic career. “My dad has always worked hard to make my family happy and continued to support me throughout my academic career. By working hard to support us, he encouraged me to work my hardest and push myself to make my family proud.”\nRACHEL SAMSON\nHenry Ford II High School\nPrincipal: Lori Singleton\nParents: Samson Baby and Bency Samson\nA 4.22 student at Henry Ford II, she earned a 1530 on the SAT. Future plans include attending college to major in biochemistry.\nRachel has been involved as a medical intern at Clinton Women’s Healthcare, HOSA Future Health Professional treasurer and member of the Key Club. Honors received include AP Scholar with Distinction.\nShe said, “Ms. Debra Horger, my biology teacher, has been the most influential in my academic career. Her knowledge and passion for learning has truly inspired me to pursue a career in medicine.”\nDIEGO ALVREZ\nInternational Academy of Macomb\nPrincipal: Dr. Laura Strong\nParents: Jose Alvrez and Esmeralda Rodriguez\nA 4.0 student at the International Academy of Macomb, he earned a 1570 on the SAT. Future plans include attending the Massachusetts Institute of Technology to major in electrical engineering.\nDiego has been leading Girl Scout STEM camps, team 4810 First Robotics, volunteering for summer STEM activities for a variety of age groups. Honors received include AATG National German Exam Finalist Gold Medal, PAD Prize winner program German summer scholarship, NMSQT semifinalist recognition and SAT – National Hispanic recognition program.\nHe said his grandfather, Ruben Rodriquez has been the most influential in his academic career. “He always shared creativity and perseverance in the automotive field and showed me what it really means to try and what an engineer is really all about.”\nNICHOLAS FLESER\nInternational Academy of Macomb\nPrincipal: Dr. Laura Strong\nParents: Octavian and Ruxandra Fleser\nA 4.0 student at the International Academy of Macomb, he earned a 1490 on the SAT. Future plans include attending the Carol Davila University of Medicine and Pharmacy to major in biomedical sciences.\nNicholas has been a board member of SHN, National Honor Society and SNHS. Honors received include National Merit Scholarship and a finalist of National Vivace Honors piano competition.\nVIRAYRE GANDOTRA\nInternational Academy of Macomb\nPrincipal: Dr. Laura Strong\nParents: Sandeep Gandotra and Puneeti Gandotra\nA 4.4 student at the International Academy of Macomb, he earned a 1470 on the SAT. Future plans include attending Oakland University or the University of Michigan to major in biomedical science.\nVirayre has been involved with Link Crew, HOSA and SNHS Honors received include honors from SHNS, National Honors Society and Spanish National Honors Society.\nHe said his grandmother has been the most influential in his academic career as a former gynecologist who emphasized purity and honesty to help others and Dr. Jonathan Swetech, who is his mentor for what it means to be a good doctor and leader.\nJASKARAN RANDHAWA\nInternational Academy of Macomb\nPrincipal: Dr. Laura Strong\nParents: Aneel Randhawa and Jasdeep Randhawa\nA 3.9 student at the International Academy of Macomb, he earned a 1560 on the SAT. Future plans include attending the University of Michigan to major in biomedical engineering.\nJaskaran has been involved as student producer for IAM Theatre, on Dakota’s tennis team and dental terminology competitor for Michigan HOSA. Honors received include Key Club SLC’s Sandy Ninninger Outstanding Key Clubber of the Year, Letter of Commendation from National Merit Scholarship competition.\nHe said his parents and sister have been the most influential in his academic career. “My parents and sister for always supporting me through everything.”\nVALERIIA TEODOROVYCH\nInternational Academy of Macomb\nPrincipal: Dr. Laura Strong\nParents: Olga Levin and Sergei Levin\nA 4.0 student at the International Academy of Macomb, she earned a 1470 on the SAT. Future plans include attending the University of Michigan to major in biopsychology, cognition and neuroscience, though has not yet made a decision on career path.\nValeriia has been involved with the community Ukraine Fundraiser through Global Giving, volunteering for Humane Society of Macomb and organizing a talent show at the school. Honors received include Michigan School Band and Orchestra Association Division I rating, Michigan School Band and Orchestra Association Division II State rating and Risk Taker Award\nShe said her mother Olga Levin has been the most influential in her academic career. “She has always been by my side.”\nOLIVIA TREMBERTH\nInternational Academy of Macomb\nPrincipal: Dr. Laura Strong\nParents: Mark Tremberth and Susan Tremberth\nA 3.9 student at the International Academy of Macomb, she earned a 1510 on the SAT. Future plans include attending the University of Michigan to major in civil engineering.\nOlivia has been involved with the community with a dog toy drive for charity, a Camp Invention counselor and Motor City Mitten Mission homeless shelter mats.\nHonors received include Macomb Area Conference ALL-American award for softball.\nShe said, “My parents, for always encouraging me to be curious.”\nCHRISTINA CANTIN\nLake Shore High School\nPrincipal: Jenelle Bross\nParents: Dawn Cantin and Phil Cantin\nA 3.89 student at Lake Shore, she earned a 1240 on the SAT. Future plans include attending one more year at Early College at Macomb then attend the University of Michigan to major in computer science.\nChristina has been involved with the community, having job shadowed music teachers and helped with children in grades K-8. Honors received include Winter 2022 and Fall 2023 Dean’s List at Macomb Community College, five First Divisions at Michigan School Band and Orchestra Association District 16 Solo and Ensemble competition, two first divisions at Michigan School Band and Orchestra Association State Solo and Ensemble competitions, drum major for two years and National Honor Society member.\nShe said her band director in middle school, Christopher Kauffold, has been the most influential in her academic career. “He made me learn to feel confident in myself and let me express myself through music.”\nAVA COSTALES\nLakeview High School\nPrincipal:Scott Kapla\nParent: Genevieve Taylor\nA 4.0 student at Lakeview, she earned a 1470 on the SAT. Future plans include attending the University of Michigan to major in biological sciences (pre-med).\nAva said the most meaningful community service she has done was the Macomb Feed the Need. Honors received include holding the office of National Honors Society president, first team All State for softball, College Board AP Scholar Award and Frederick G.L. Huetwell scholarship recipient.\nShe said, “My mom instilled work ethic in me from a very young age through both academics and athletics and she has always been my biggest supporter in everything I have worked toward.”\nANGELINA BURSON\nL’Anse Creuse High School\nPrincipal: Dr. Major Mickens\nParents: Rie Burson and Mark Burson\nA 4.0 student at L’Anse Creuse High School, she earned a 1580 on the SAT. Future plans include attending college to major in environmental engineering.\nAngelina has been involved with the community as a two time Wigs for Kids donator, Haven Place Youth Camp and Heart Walk. Honors received include National Merit Finalist, valedictorian, achievement award for a perfect score on the ACT and first place Advanced Digits of Pi contest (1218 digits).\nShe said Chandler Missig, her Honors and AP Biology teacher has been the most influential in her academic career. “Ms. Missing was the first teacher I saw every day in ninth grade and she set the tone for my academic performance throughout the school with her enthusiastic attitude and rigorous coursework that prepared me for advanced-level classes.”\nSAMANTHA DECEUNINCK\nL’Anse Creuse High School\nPrincipal: Dr. Major Mickens\nParents: Marie DeCeuninck and Douglas DeCeuninck\nA 4.0 student at L’Anse Creuse High School, she earned a 1490 on the SAT. Future plans include attending the University of Michigan to major in biology.\nSamantha has been involved as a member of the L’Anse Creuse High School soccer team (varsity 2021-2023), L’Anse Creuse High School bowling team (varsity 2022) and volunteering at the school concession stand. Honors received include Scholastic Achievement Award, AP Scholar Award and Lancer basketball award\nShe said, “The person who influenced my academic career the most is my sister, Maggie DeCeuninck. Whether she knows it or not, she has always been my biggest role model and she has been so supportive of me through all my academic endeavors.”\nBEN PUZZUOLI\nL’Anse Creuse High School\nPrincipal: Dr. Major Mickens\nParents: Amy Puzzuoli and Adam Puzzuoli\nA 4.0 student at L’Anse Creuse High School, he earned a 1510 on the SAT. Future plans include attending the University of Michigan to major in biology.\nBen has been involved in the community with the National Honors Society, MCREST and Mu Alpha Theta tutoring. Honors received include National Honors Society president, salutatorian, cross country state qualifier, DECA state qualifier, and four year MST achievement awards.\nHe said, “My dad has had the greatest influence on my academic career by instilling the values of discipline and work ethic within me from a young age.”\nANNDEE GEDDES\nL’Anse Creuse High School North\nPrincipal: Meredith Beard\nParents: Julie Geddes and Timothy Geddes\nA 4.0 student at L’Anse Creuse High School North, she earned a 1540 on the SAT. Future plans include attending the University of Michigan to major in actuarial science.\nAnnDee has been involved with the community participating in MCREST and helping to prepare meals for the homeless and tutoring for National Honors Society and Mu Alpha Theta. Honors received include salutatorian, commended for PSAT National Merit, cross country/track academic all-state and celebration of excellence (all years).\nShe said Jarrett Geddes, her older brother, has been the most influential in her academic career. “He has always believed in me and pushed me to be my best all throughout high school.”\nMATTHEW KIEWSKI\nL’Anse Creuse High School North\nPrincipal: Meredith Beard\nParents: Karen Kiewski and James Kiewski\nA 3.975 student at L’Anse Creuse High School North, he earned a 1480 on the SAT. Future plans include attending Cornell University to major in biomedical engineering.\nMatthew has been involved with the community creating and coordinating Socktober, a sock drive in October for local warming shelters for two years, tutoring students in math and science and tennis coaching as assistant coach to the L’Anse Creuse Middle School North tennis team. Honors received include MASC/MAHS Student of the Year nominee, AP Scholar with Distinction award, MST achievement award, LCN varsity tennis academic achievement award and Scholastic Achievement award.\nHe said, “Ms. Chandler Missig was my honors and AP Biology teacher, who serves as a mentor to me and encouraged me to step outside of my comfort zone and grow into the leader I am today. Her encouragement has enabled me to achieve my goals.”\nBRIAN MEI\nL’Anse Creuse High School North\nPrincipal: Meredith Beard\nParent: Tony Ip\nA 4.0 student at L’Anse Creuse High School North, he earned a 1440 on the SAT. Future plans include attending college to major in mechanical engineering.\nBrian has been involved with Link Crew, Mu Alpha Theta and donation of supplies to schools and organizations. Honors received include Student of the Month (April 2022), celebration of excellence for three years, Top Scholar Class of 2023.\nHe said, “I don’t really know if there was a person that influenced my academic career the most. There were many people like my teachers and relatives that shaped me into the person I am. I am grateful and would not have been able to do it without them.”\nAUBRIE MCDONALD\nRomeo High School\nPrincipal: Bernie Osebold\nParents: Marcy McDonald and Jason McDonald\nA 4.0 student at Romeo, she earned a 1440 on the SAT. Future plans include attending University of Michigan to major in computer science.\nAubrie has been involved as a volunteer at Camp Invention, a summer camp for K-fifth graders, tutoring underclassmen and captain of the color guard team. Honors received include DAFT film festival best of show and varsity letter.\nHer mother, Marcy McDonald, has been the most influential person in her academic career. “Ever since I was little she always motivated me to focus on my education, whether it was by reading flashcards, helping me with my homework, volunteering at my school or leading by example. She is my biggest inspiration and my greatest supporter.”\nPAIGE TOMALA\nRoseville High School\nPrincipal: Jason Bettin\nParents: Amanda Gagnon and Tony Tomala\nA 3.973 student at Roseville, she earned a 1190 on the SAT. Future plans include attending college to major in theatre.\nPaige is involved with dance for 16 years, National Honors Society and Student Assembly. Honors received include Roseville High School Student of the Year, AP Scholar Award, All A Honor Roll for three years, Top 10 STAR Math and STAR Reading Score in Roseville High School and previously in 99th percentile for STAR Reading Test.\nShe said her mom, Amanda Gagnon has influenced her the most in her academic career. “She is always pushing me to be my very best, acting as my biggest supporter and motivator. She helps me stay determined and continue working hard, and I would not be where I am today without her.”\nSHAAN BASHIR\nSterling Heights High School\nPrincipal: Craig Miller\nParents: Reena Kazmi and Raza Bashir\nA 4.0 student at Sterling Heights, he earned a 1540 on the SAT. Future plans include attending the University of Michigan to major in mechanical engineering.\nShaan has been active in the community as a karate instructor at Sterling Heights Community Center, volunteer and tutor at Margaret Black Elementary and senior service officer in National Honors Society. Honors received include awarded blue ribbon at Detroit Science Fair in Material Science category, Drumline section leader for the Sterling Heights High School Marching Stallions, earned more than 10 Division 1 ratings at both district and state level festivals for Michigan Schools Band and Orchestra Association, Director’s Award for band.\nHe said, “My parents have influenced me most in my academic career. My mother helped and motivated me through school since before I started kindergarten, giving me all the opportunities I have now. My father’s work as an industrial designer in the automotive industry inspired me to pursue a degree in mechanical engineering in which I can combine my interests of physics and machines.”\nVINCENT GIBALA\nSterling Heights High School\nPrincipal: Craig Miller\nParents: Danielle Gibala and Timothy Gibala\nA 4.0 student at Sterling Heights, he earned a 1440 on the SAT. Future plans include attending the University of Michigan, though currently undecided on a course of study, he is considering something in mathematics.\nVincent has been active in the community as a member of National Honors Society, Friends of Foster Kids volunteer and made cards for senior citizens. Honors received include WCS District Writing Celebration Honoree in 2022, MMSTC Senior Science Fair second place winner in biology in 2023 and second team All County tennis in 2022.\nHe said, “My aunt, Kimberly Gibala, has influenced me the most in my academic career. She works as an elementary school teacher, so during the summers when I was younger she would keep my brain fresh for the upcoming school year with assignments in different subjects. She explained to me the importance of doing well in school at a very young age, and without her guidance, I don’t know if I would be where I am intellectually without her.”\nSHAYAN MATIN\nStevenson High School\nPrincipal: Kenneth Cucchi III\nParents: Mohammed Matin and Abida Shultana Matin\nA 4.28 student at Stevenson, he earned 1500 on the SAT. Future plans include attending the University of Michigan to major in cellular biology.\nShayan has been involved with Quiz Bowl, Spanish National Honor Society and tutoring for Sunday school. Honors received include Seal of Biliteracy, valedictorian and AP Scholar with Distinction.\nHe said, “My dad has influenced me the most by striving me to work hard like him.”\nNATHAN BERGER\nUtica High School\nPrincipal: Timothy Youngblood\nParents: Colleen Berger and Brian Berger\nA 4.24 student at Utica, he earned a 1480 on the SAT. Future plans include attending the University of Michigan though currently undecided on course of study.\nNathan has been involved with National Honors Society and Key Club. Honors received include College Board AP Scholar with Distinction and a member of the National Merit Program Commended Student.\nHe said, “My calculus teacher this year, Ms. Melissa Webb has been fantastic. She manages to make a difficult subject enjoyable and has a great classroom environment.”\nCARTER BURTON\nUtica High School\nPrincipal: Timothy Youngblood\nParents: Amy Burton and James Burton\nA 4.21 student at Utica, he earned a 1500 on the SAT. Future plans include attending college to study bio-med, currently considering the University of Michigan and Michigan State University.\nCarter has been involved with the community as an elementary school student mentor, volunteer election worker, National Honor Society member and alumni speaker. Honors include HOSA regional champion in biotechnology event, MST student and Chieftain of the Month, AP Scholar with Distinction and All-Academic athlete in golf and tennis.\nHe said, “Both my AP Gov teacher, Mr. Syler and my Spanish teacher Mrs. Konnie, have been very influential in my academic career. Mrs. Konnie has always encouraged me to do my best and achieve my goals while Mr. Syler brings fun into the classroom and relates to his students very well.”\nSATCHIT KULKARNI\nUtica High School\nPrincipal: Timothy Youngblood\nParents: Prasad Kulkarni and Mrunal Kulkarni\nA 4.25 student at Utica, he earned a 1510 on the SAT. Future plans include attending the University of Michigan to major in computer science/biology (Bioinformatics).\nSatchit has been involved as a member of First Robotics Competition team Crevolution #2851, Utica High School’s Student Mental Health Committee and student mentor for Messmore Elementary’s First Lego Robotics Club. Honors include College Board AP Scholar with Distinction, Congressional App Challenge winner for Michigan District 20, National Merit Commended Scholar, Crevoltions Robotics “Rookie of the Year” for computer/robot programming. .\nHe said, “My high school biology teacher (Grades 10-12), Mrs. Debra Horger at UCMST influenced me the most due to her unique teaching style, her engaging lectures in biology inspired me to pursue a career combining my passion in biology and computer science.”\nASHLEY PITTEL\nUtica High School\nPrincipal: Timothy Youngblood\nParents: Christine Pittel and David Pittel\nA 4.17 student at Utica, she earned a 1520 on the SAT. Future plans include attending the University of Michigan to major in actuarial science.\nAshley has been involved as an altar server at St Lawrence Catholic Church and tutoring through National Honors Society. Honors include National Merit Commended Scholar, AP Scholar with Distinction, Coach’s award for varsity swim team and Macroeconomics Department award.\nShe said, “My mother, Chrsitine Pittel, has supported my academic endeavors my entire life. She encouraged me to take pride in my schoolwork and instilled a passion for learning. Whenever I needed help or guidance, she was always there to help me realize my potential.”\nANTON AKROUSH\nGene L Klida Utica Academy for International Studies\nPrincipal: Shaun Greene-Beebe\nParents: Salem Akroush and Sareen Dababneh\nA 4.0 student at Gene L Klida Utica Academy for International Studies, he earned a 1490 on the SAT. Future plans include attending college to major in electrical engineering.\nAnton has been involved as founder and director of the school supply donations project, election outreach advocate and publicist for Racing Ahead. Honors include fourth place medal MIFA Debate State Finals, varsity Congressional Debate, Princeton Prize in Race relations, certificate of accomplishment, Bill of Rights Institute Student Fellow, finalist in National History Olympiad and Regional champion, HOSA.\nHe said: “My parents, who essentially had to start life over after escaping their home countries. They taught me to approach life with resilience and determination. This has been the greatest influence on my academic career. I have developed a perspective on life and academics similar to the one my parents developed over their lives; one of hard work, respect and reflection.”\nEVAN BARKHO\nGene L Klida Utica Academy for International Studies\nPrincipal: Shaun Greene-Beebe\nParents: Ayad barkho and Sanaa Hanna\nA 4.0 student at Gene L Klida Utica Academy for International Studies, he earned a 1480 on the SAT. Future plans include attending MIT to major in electrical engineering and math.\nEvan has been involved as Key Club Election volunteer and with National Honors Society community events. Honors received include AP Scholar with Honor NMSQTLetter of Commendation, National French contest silver and bronze.\nHe said: “My mom, Sanaa has influenced me the most since she has allowed me to focus on my interests and on academics.”\nMILES GERTSCH\nGene L Klida Utica Academy for International Studies\nPrincipal: Shaun Greene-Beebe\nParents:Brook Gertsch and Jamie Gertsch\nA 4.0 student at Gene L Klida Utica Academy for International Studies, he earned a 1510 on the SAT. Future plans include attending Brigham Young University to major in computer science. Miles has been involved as president of the French club and also as a member of the Recycling Club and National Honors Society. Honors received include AP Scholar with Honor, valedictorian, National Merit Scholar semi-finalist and IB full diploma candidate. .\nHe said “Elise Gertsch, my older sister and eldest sibling. She chose to go to UAIS when it first opened and set a legacy of high academic achievement; seeing the positive effects of those two decisions inspired me to follow in her footsteps.”\nNISHA KOSHY\nGene L Klida Utica Academy for International Studies\nPrincipal: Shaun Greene-Beebe\nParents: Jayan Koshy and Serene Koshy\nA 4.0 student at Gene L Klida Utica Academy for International Studies, she earned a 1550 on the SAT. Future plans include attending the University of Michigan to major in computer science.\nNisha has been involved as St. Lawrence Academic games coach, Girls Who Code co-president and National Honor Society. Honors received include Girls Who Code co-president, National Honor Society, National Merit Scholarship Program finalist and US Presidential Scholars program candidate.\nShe said, “My biggest academic role model is the late Mr. Steven Wright, my Academic Games coach in middle school. He was the most dedicated person I have ever met. He invested his time, energy and talent not only instructing me in academic topics but also teaching me the importance of having a work ethic. HIs passion for teaching, tangible whenever he was present in the room, inspired me to give my all in whatever I do.”\nAVA RAWLEY\nGene L Klida Utica Academy for International Studies\nPrincipal: Shaun Greene-Beebe\nParents: Kimberly Rawley and Craig Rawley\nA 4.0 student at Gene L Klida Utica Academy for International Studies, she earned a 1440 on the SAT. Future plans include attending the University of Michigan to major in biochemistry.\nAva has been involved with the Student Voice Committee, cross country/track and field and National Honors Society. Honors received include Best Teammate award, Outstanding Member Key Club, conference champion for track, versatility award and State Qualifier HOSA Medical\nShe said Kimberly Rawley, her mother, is the most influential person in her academic career. “She always encouraged me to challenge myself and supported me through successes and failures. She also encouraged and developed my interest in medicine and provided me with resources and opportunities to learn. Balancing work and a Master’s degree program she sets a fantastic example and I strive to be as dedicated as she is.”\nDENIS IMSIROVIC\nWarren Mott High School\nPrincipal: Kevin Kittle\nParents: Senka Imsirovic and Asmir Imsirovic\nA 3.90 student at Warren Mott, he earned a 1480 on the SAT. Future plans include attending the University of Michigan, Ann Arbor to major in aerospace engineering.\nDenis has been involved in Warren Mott tutoring. Honors received include Warren Mott Marching Band section leader (2020-22). First place physics MMSTC Science Fair (2023) and Macomb Area Conference All Singles Team Honorable Mention (2021).\nHe said, “My older brother, Dinko Imsirovic, has been a massive role model for me as I have gone through high school. After he graduated from U of M in 2020, he has been able to give me valuable advice on studying, work ethic and having a balanced life with school and activities.”\nNATHAN LE\nWarren Mott High School\nPrincipal:Kevin Kittle\nParents: Dung Le and Hongha Nguyen\nA 3.971 student at Warren Mott, he earned a 1500 on the SAT. Future plans include attending the University of Michigan to major in engineering and project managment.\nNathan has been involved with robotics, reading books to elementary school kids and Elementary School STEM Outreach. Honors received include Robotics captain,Warren Mott High School swim and Dive captain, third place at the Detroit Science Fair in Physics and Astronomy.\nHe said Michael May, Interdisciplinary Studies Teacher and Robotics Coach has been the most influential in his academic career. “In short, whenever I thought I could do something, when I was on the edge of wanting to quit school and all my activities, Mr. May was always there telling me that everything I am doing now is why I am important to others and to the future. He inspired me to keep going.”\nIMTIAZ QURESHI\nWarren Mott High School\nPrincipal: Kevin Kittle\nParents: Sheruz Qureshi and Fazila Choudhury\nA 3.971 student at Warren Mott, he earned a 1460 on the SAT. Future plans include attending the University of Michigan to major in mechanical engineering.\nImtiaz has been involved with outreach events with the robotics team and tutoring underclassmen. Honors received include Catch scholarship nominee (Warren Mott/MMSTC), Quality Award at Macomb Districts (FRC Robotics), academic letter.\nHe said, Joseph Stonchus, cross country coach, has been the most influential in his academic career. “He has helped me grow as a person and as a leader over my years in cross country.”\nDAVID ROUSH\nWarren Mott High School\nPrincipal: Kevin Kittle\nParents: Scott and Mary Roush\nA 4.0 student at Warren Mott, he earned a 1530 on the SAT. Future plans include attending the University of Michigan to major in architecture.\nDavid has been involved as National Honor Society treasurer, outreach through the robotics team and tutoring. Honors received include Academic letter, Stockholm Junior water prize first place in state, quality award at robotic district competition (team award)., academic letter.\nHe said, “Mr. Mike May, my IDS teacher is constantly warm and always is someone I can go to whenever I am feeling stressed or down. He also helped me to see my future in a positive light and not to be worried, but rather excited.”\nGIOVANNI ROSSI\nWarren Woods Tower High School\nPrincipal: Mike Mackenzie\nParents: Lucy Rossi and Robert Rossi\nA 4.424 student at Warren Woods Tower, he earned a 1430 on the SAT. Future plans include attending the University of Michigan to major in information analysis.\nGiovanni has been involved with tutoring and National Honor Society’s Rake and Run, raking leaves for the elderly. Honors received include varsity soccer most valuable player, All Conference soccer, All District soccer, AP Scholar with Honors and Varsity soccer Scholar Athlete.\nHe said, “The person that influenced me most is my mom, Lucy Rossi. She taught me in elementary school and always believed in me throughout my academic career. Her support encouraged and helped me to succeed.”\nClass B\nRILEY ANDREWS\nArmada High School\nPrincipal: Andy Kastl\nParents: Jody and Michael Andews\nA 3.951 student at Armada, he earned a 1340 on the SAT.\nFuture plans include attending Cedarville University to major in computer science.\nRiley has been involved with the National Honors Society, plowing driveways and serving at church. Honors received include Academic All State, National Honors Society member and varsity basketball, cross country and track.\nHe said Jody Andrews, mother/kindergarten teacher, has been the most influential in his academic career. “My mother pushes me every day academically so college is cheaper and she doesn’t have to pay as much for my tuition.”\nKYLE COENEN\nArmada High School\nPrincipal: Andy Kastl\nParents: Kathleen Coenen and the late David Coenen Jr.\nA 4.0 student at Armada, he earned a 1300 on the SAT. Future plans include attending Michigan Technological University to major in audio production/technology.\nKyle has been involved with tornado relief and clean up, Relay for Life, youth sport and academic programs. Honors received include All-State in football, wrestling and track, All-State All-Academic, AP Scholar award, Distinguished Freshman Musician award and All “A” Honor Roll.\nHe said “Mr. Jason Hundley, my high school Humanities teacher for unlocking in me the ability to apply and perceive points of view in which my character has taken its own unique shape.”\nAIDEN LEE\nArmada High School\nPrincipal: Andy Kastl\nParents: Cliff and Misuzu Lee\nA 3.769 student at Armada, he earned a 1460 on the SAT.\nFuture plans include attending Grand Valley State University to major in computer sciences.\nAiden has been involved part of the football team who led clean up efforts in Armada after the tornado, participating in Cyber Patriot with the computer club, and Kroger cart pusher. Honors received include AP Scholar with Distinction, wrestling regional qualifier, Blue Water Area Conference (BWAC) All-Academic award, cross country state qualifier, voted by class as wost case of seniortitis.\nHe said Brian McElheny, his older brother, who is studying at John Hopkins for his masters in cybersecurity, has been the most influential in his academic career. “He inspired me to pursue a field in technology.”\nROBERT LIETZ\nArmada High School\nPrincipal: Andy Kastl\nParents:Karrie Lietz and Jason Lietz\nA 3.921 student at Armada, he earned a 1350 on the SAT.\nFuture plans include attending the Michigan Technological University to major in electrical engineering.\nRobert has been involved as an Armada Wrestling youth coach and 4-H Project Clover donating meat to local soup kitchen. Honors received include Academic All-State Wrestling, Armada HIgh School Athletic Excellence Award Wrestling, All-County Honorable Mention Wrestling and 4-H Senior Hog Showman champion.\nHe said, “My parents, Karri and Jason Lietz, their hard work and family values have constantly pushed me to be the best possible version of myself in all aspects of my life.”\nBRANDON MALBOUEF\nArmada High School\nPrincipal: Andy Kastl\nParents: Julie Malbouef and Keith Malbouef\nA 3.919 student at Armada, he earned a 1390 on the SAT.\nFuture plans include attending Grand Valley State University to major in computer science.\nBrandon has been involved in the community with the Police Athletic League (PAL) Leadership Team and Armada football Honors received include Blue Water Area Conference (BWAC) All-Academic Team, two varsity letters.\nHe said that his dad, Keith Malbouef, has been the most influential in his academic career. “He has taught me to do everything at 100 percent and how to work hard.”\nBROOKLYN PRATT\nArmada High School\nPrincipal: Andy Kastl\nParents: Jason Pratt and Trista Pratt\nA 4.0 student at Armada, she earned a 1350 on the SAT.\nFuture plans include attending Saginaw Valley State University or the University of Michigan to major in biochemistry.\nBrooklyn has been involved in the community in the partnership with Macomb County Health Department’s Medical Reserve Corps (MRC) Team for projects to improve emergency preparedness in the community (Includes making the high school an MI Heart Safe School) and volunteering to pack meals for Meals on Wheels in Port Huron. Honors received include National College Board recognition, All “A”’s, Blue Water Area Conference All-Academic team, president of National Honors Society and 2023 Team Flint award from the Basketball Coaches Association of Michigan (BCAM).\nShe said her parents, Jason and Trista Pratt, have been the most influential in her academic career. “My parents work ethic has inspired me to be the best person I can be. My goal is to excel at everything that I do. If I make a mistake, they have taught me to reflect on it and improve from there.”\nCOLTON SMITH\nArmada High School\nPrincipal: Andy Kastl\nParents: Jillian Smith and Brody Smith\nA 4.0 student at Armada, he earned a 1370 on the SAT.\nFuture plans include attending Grand Valley State University to major in accounting.\nColton has been involved with the community volunteering through National Honor Society and raising money for Paws Awes and Claws (animal rescue). Honors received include Two time tennis regional award runner up and a top eight finisher at states for first doubles, Student-Athlete Excellence Award, Blue Water Area Conference (BWAC) All-Academic team, Macomb Academy of Arts and Sciences STEM designation.\nHe said Jillian Smith, his mother, has been the most influential in his academic career. “My mother has pushed me to do my best and always has my best interests in mind. She has helped me to realize my full potential.”\nGAVIN WEED\nArmada High School\nPrincipal: Andy Kastl\nParents: Emma Romeo and Andrew Weed\nA 4.0 student at Armada, he earned a 1300 on the SAT.\nFuture plans include attending the University of Michigan Ann Arbor or Flint to major in mechanical engineering.\nGavin has been involved with Camp Invention, a week long STEM day camp, Armada Automations elementary school robotics competition and Armada Fair running the robot demonstrations. Honors received include National Honors Society, Robotics Outreach and Sponsorship captain and 2022 Chairman’s winner with First Robotics Competition Team 1718.\nHe said, “Mr. Jason Moore, Armada High School finance teacher, has been the most influential in his academic career. “He is a prime example of how learning can be fun and engaging. Through his use of jokes, he creates a positive, light-hearted environment.”\nPARKER WESTFALL\nArmada High School\nPrincipal: Andy Kastl\nParents: Kam Westfall and Steve Westfall\nA 4.0 student at Armada, he earned a 1410 on the SAT. Future plans include attending college to major in business administration, though still undecided on an institution.\nParker has been involved as leader of the high school’s blood drives, helping to organize Relay for Life cancer research fundraiser and helped collect and transport Project Care food donations for people in need. Honors received include Varsity basketball team captain, varsity tennis team captain and nominated for MyLead Leadership conference.\nHe said his older brother, Brandon Westfall, has been the most influential in his academic career. “Brandon has taught me the importance of giving maximum effort in school. He has served as a role model for what I want to emulate as I continue my education in college.”\nJASMIN PARVIN\nCenter Line High School\nPrincipal: John Kelley\nParents: Mohammed Miah and Kazi Parvin\nA 4.3 student at Center Line, she earned a 1180 on the SAT. Future plans include attending the University of Michigan to major in computer science.\nJasmin has been involved in the community with babysitting at Mifte Institute, assisting at JROTC Drill competition Honors received include Chinese Student of the Year, AP Government Student of the Year, President’s award and Academic Excellence pin.\nShe said, “My dad, Mohammed Miah, has influenced me the most because ever since I was younger he has motivated me to always do my best and go above and beyond.”\nJODAEL MONKOY\nClintondale High School\nPrincipal: Meloney Cargill\nParents: Caddy Monkoy and Chantal Monkoy\nA 4.3690 student at Clintondale, he earned a 1170 on the SAT. Future plans include attending Lawrence Technological University to major in biomedical engineering.\nJodel has been involved with March Careness, Walk-A-Thon and Dragon Pantry. Honors received include MIP for football, Student of the Month all four years, and student council treasurer.\nHe said, “My parents, Caddy and Chantal Monkoy, encouraged me to do my best in school, always. I have goals and ambitions I want to see happen and I never give up.”\nJONAH CRAM\nEastpointe High School\nPrincipal: Asenath Jones\nParent: Gail Cram\nA 3.850 student at Eastpointe, he earned a 950 on the SAT. Future plans include attending Eastern Michigan University to major in engineering.\nJonah has been involved with volunteering at cabbage and soup kitchen and donated blessing baskets to the homeless with Eastpointe schools, fundraised to adopt and support and giraffe with the National Honors Society. Honors include Honor Roll all four years, All-Academic athlete for wrestling, National Honors Society and Junior Drum Major for marching band.\nHe said: “My older brother, Eli Crum, has always inspired me and I have watched him go through life and showed me how to work towards my goals in life.”\nCYNTHIA LOR\nLincoln High School\nPrincipal: Michael Harris\nParent: Bobby Yang\nA 4.0 student at Lincoln, she earned a 1230 on the SAT. Future plans include attending Wayne State University to major in mechanical engineering.\nHonors received include certificate of special senatorial recognition four times, certificate of merit, Macomb Career and Technical Education Administrators Association award and National Honors Society.\nShe said, Michael Zaniea, her Metal and Manufacturing teacher in eighth through tenth grade, has been the most influential in her academic career.\nLANCE CODY\nLutheran High School North\nPrincipal: John Reincke\nParent: Chad Gump\nA 4.0 student at Lutheran North, he earned a 1390 on the SAT. Future plans include attending the University of Michigan, Ann Arbor to major in nuclear engineering.\nLance has been involved with the community as a volunteer at Macomb County Emergency Rotating Shelter Team (MCREST over the holidays and a student mentor in bible study. Honors received include CHSL Scholastic All-Catholic award in eleventh and twelfth grade.\nShe said her eighth grade English teacher, Mr. Kressbach was the most influential in her academic career. “He ignited a passion for learning in me. Before I didn’t care much about school, but he had shown me that learning is enjoyable. Without his guidance I would have given up on school long ago.”\nTYLER DEMPSEY\nLutheran High School North\nPrincipal: John Reincke\nParents: Tom Dempsey and Christie Dempsey\nA 4.0 student at Lutheran North, he earned a 1310 on the SAT. Future plans include attending college to major in business, though yet has not decided on an institution.\nTyler has been involved with the community with Macomb County Emergency Rotating Shelter Team (MCREST) serving the homeless at Trinity Utica Church, with vacation bible school as group leader at St. Peter Macomb Church and ran the Salvation Army bell during the Christmas season. Honors received include National Honors Society, All-Catholic Award for the 2022-2023 Varsity Hockey season, captain of the Bishop Foley United varsity hockey team, All-Academic 2022-2023 varsity hockey season\nHe said, “My parents, Tom and Christie Dempsey, have influenced me the most by always supporting me in school and providing me with a great Christian education. They have given me the opportunities and taught me skills to succeed in life such as hard work, dedication and organizational skills.”\nMADELINE DILELLA\nLutheran High School North\nPrincipal: John Reincke\nParents: Amy DiLella and Peter DiLella\nA 4.0 student at Lutheran North, she earned a 1390 on the SAT. Future plans include attending the University of Michigan to study Biology Health and Society.\nMadeline has been involved with the community as a volunteer with Gifts for All God’s Children, a volunteer basketball coach at an elementary school camp and volunteering at the Macomb Charitable Foundation. Honors received include 2023 girls baskeball All-Catholic award, 2022 girls basketball third team All-Macomb County award and 2023 girls basketball second team All-Macomb County award.\nShe said: “My parents have been my greatest influences during my academic career. They are both very intelligent and driven people and they have taught me to work hard and be responsible.” I can count on them whenever I need help and their constant love and support has greatly contributed to my success.”\nANNEMARIE HALE\nLutheran High School North\nPrincipal: John Reincke\nParents: Kurtis Hale and Margareta Hale\nA 3.971 student at Lutheran North, she earned a 1330 on the SAT. Future plans include attending Auburn University to major in nursing.\nAnnemarie has been involved with cross country and track and field, as chapter president of Health Occupations Students of America (HOSA) and Michigan State University’s Future Docs and PCAA Board member. Honors received include Madame Curie award from the Society of Women Engineers, four year Scholar Athlete, National Honors Society and salutatorian.\nShe said: “The person who influenced me the most in my academic career is my older sister, Elizabeth Hale. She set an example for me by always striving to reach her goals in whatever she was doing and not by being too afraid to try. She has always been my number one supporter in whatever I do and I wouldn’t be the person I am today without her as my role model.”\nJULIA JOSEPH\nLutheran High School North\nPrincipal: John Reincke\nParents: Dianna and Scott Joseph\nA 3.969 student at Lutheran North, she earned a 1420 on the SAT. Future plans include attending the University of Michigan to major in astrophysics.\nJulia has been involved with the community, raising money through Future Health Professionals (HOSA) for the American Heart Association. Honors received include National Honors Society president, AP Scholar with Honor award and two time Scholastic All-Catholic Academic award.\nShe said, “My junior year physics teacher, Mr. Dumar, did a lab with us that made me realize that I wanted to go into astrophysics which allowed me to set a goal for my future. Also my parents have influenced me most by always supporting me.”\nAVA KARDYNAL\nLutheran High School North\nPrincipal: John Reincke\nParents: Douglas and Tracy Kardynal\nA 4.0 student at Lutheran North, she earned a 1390 on the SAT. Future plans include attending college to major in Linguistics, though she has not yet chosen an institution. .\nAva has been involved with her school and community having participated in the theatre program at the high school since her freshman year, volunteered at Vacation Bible School at her grade school and volunteered at Camp Invention, a children’s STEM day camp at her grade school. Honors received include National Honors Society member, first chair clarinet in the school band for three years and student director of the high school musical.\nShe said, “My second and fourth grade teacher, Mrs. Trinklein, influenced me most in my academic career. She always challenged me academically and is just a cool person to be around. She always modeled self-confidence for my class and she made an effort to connect with all of us.”\nANDREW LANSDALE\nLutheran High School North\nPrincipal: John Reincke\nParents: John and LeeAnne Lansdale\nA 4.0 student at Lutheran North, he earned a 1380 on the SAT. Future plans include attending Grand Valley State University to major in environmental and sustainability studies.\nAndrew has been involved with the community with more than 20 hours helping kindergarten kids at Vacation Bible School, leading a small cleanup of trash on the side of public roads and volunteering multiple times at a soup kitchen.\nHe said LeeAnne Lansale, his mom, has been the most influential in his academic career. “She was always the one in my life that pushed me to get good grades and was there for me if I ever needed help. She was the one who started my love of reading. She always read to me as a kid and as I got older took me to the library and encouraged me further. Along with that, she always drove me to school every day until I could drive myself. She was always present in every part of my academic career.”\nANNE MAY\nLutheran High School North\nPrincipal: John Reincke\nParents: Christopher and Katie May\nA 4.0 student at Lutheran North, she earned a 1290 on the SAT. Future plans include attending Oakland University to major in mechanical engineering.\nAnne has been involved with the community having volunteered at Hope for the Hungry food pantry, volunteered at Gifts for All God’s Children and volunteered as Crew Leader for Vacation Bible School at Our Redeemer Lutheran Church. Honors received include Society of Women’s Engineers certificate of merit, All-State Academic award for cross country, Scholastic All-Catholic award and All-District soccer award.\nShe said, “My mom, Katie May, has influenced me the most in my academic career. She has taught me to work hard in everything I do and always give my best effort no matter the circumstances. My mom has continuously encouraged me throughout my academic career.”\nROCCO ROMAN\nLutheran High School North\nPrincipal: John Reincke\nParents: Joe and Jessica Roman\nA 3.842 student at Lutheran North, he earned a 1430 on the SAT. Future plans include attending Xavier University to major in data science.\nRocco has been involved with school and the community with varsity football and National Honor Society. Honors received include Academic All-State for football and National Honor Society.\nHe said his mom, Jessica Roman has influenced him most in his academic career “because she motivates me to reach my full potential.”\nDYLAN TUSZYNSKI\nLutheran High School North\nPrincipal: John Reincke\nParent: Denel Tuszynski\nA 3.971 student at Lutheran North, he earned a 1350 on the SAT. Future plans include attending Missouri University of Science and Technology to major in nuclear engineering.\nDylan has been involved with the community, assisting with Sunday school at his church, assisting with Vacation Bible School at his church and and with Camp Invention at his church. Honors received include member of National Honors Society, five out of five on AP Biology exam and College Board AP Scholar Award.\nHe said Brian Horvath, applied Christianity teacher, has been the most influential in his academic career.\nKAITLYN WEISS\nLutheran High School North\nPrincipal: John Reincke\nParents: Suzanne Weiss and John Weiss\nA 4.0 student at Lutheran North, she earned a 1280 on the SAT. Future plans include attending Oakland University to major in Biochemical Engineering and Law.\nAva has been involved with her community having served as STEM Camp Invention Leadership Intern for the National Inventors Hall of Fame, group community service projects in the Pontiac area with Woodside Bible Church and organized collection of funds to support western Florida after Hurricane Ian. Honors received include National Honors Society Executive Board Service Project Coordinator, Academic All-County award for cross country, varsity letter in cross country, track and field and band and first chair clarinet.\nShe said, “My parents, Suzanne and John Weiss, have been the most influential people of my academic career. They have encouraged me to have a strong faith in God and strive toward academic excellence from first grade to my senior year in high school. Their encouragement to try new activities, pursue my interests with passion and never give, all while keeping an attitude of gratitude, has guided me as I participated in challenging classes and extracurricular activities. They have taught me to ask questions, share, listen to new ideas and to be a lifelong learner.”\nJAYDEN AMPARO\nRegina High School\nPrincipal: Ann Diamond\nParents: Rhodora Amparo and Noel Amparo\nA 4.3 student at Regina, she earned a 1350 on the SAT. Future plans include attending college to major in nursing with the goal of becoming a nurse practitioner.\nJayden has been involved with the community tutoring students in math at her former elementary school, Guardian Angels School. Honors include part of the Archdiocese of Detroit’s Scholastic All-Catholic team throughout high school, member of national honors society and one of three Regina High School valedictorians.\nShe said, “My parents, Noel and Rhodora, are the greatest influence on my academic career. They’ve been encouraging me since day one, providing unwavering support during my proudest moments and my toughest struggles. I cannot thank them enough for the inspiration, prayers and opportunities they gave me. I would not be the model student I am today if it weren’t for their admirable example.’\nADRIANNA LUCIDO\nRegina High School\nPrincipal: Ann Diamond\nParents: Maria Lucido and Tom Lucido\nA 4.3 student at Regina, she earned a 1280 on the SAT. Future plans include attending the University of Michigan or the University of Detroit Mercy to major in health sciences.\nJayden has been involved with the community volunteering at St. Thecla Church and School in various capacities including Children’s Liturgy of the Word, Open Houses and more, helping run Regina Student Council’s annual Thanksgiving Food Drive where enough food and canned goods are collected to give to six different charities. Honors include AP Scholar, National Honors Society, Scholastic All-Catholic award, valedictorian and academic honor roll.\nShe said, “The person who has influenced me the most in my academic career is my grandfather, Peter Lucido. He was one of the greatest and most hardworking people that I had the privilege to be able to know. He always emphasized and encouraged his grandchildren to strive to do their best academically and become successful. I know he would be so proud to see the person I have become today.”\nAVA MARZOLF\nRegina High School\nPrincipal: Ann Diamond\nParents: Mark Marzolf and Cristina Marzolf\nA 4.3 student at Regina, she earned a 1290 on the SAT. Future plans include attending the University of Michigan to major in sports management.\nAva has been involved with the community as a volunteer for Big Family of Michigan and Focus Hope as well as the Regina Thanksgiving Food Drive. Honors received include Field Hockey All League, AP Scholar with Honor, CHSL Scholastic All-Catholic award and class of 2023 co-valedictorian.\nShe said, “My dad, Mark Marzolf, has influenced me the most in my academic career. He’s a high school teacher and had a major impact in teaching me to take my studies seriously. As a University of Michigan alumni, he inspired me to challenge myself and set big goals for my future.”\nALEXANDRA RIHACEK\nRegina High School\nPrincipal: Ann Diamond\nParents: Shaun and Kristen Rihacek\nA 4.27 student at Regina, she earned a 1340 on the SAT. Future plans include attending Purdue University to major in engineering.\nAlexandra has been involved with the community with the St. Isaac Jogues Fish Fry and Motor City Mitten Mission Rotating Homeless Shelter. Honors received include National Honor Society and Academic Honor Roll.\n“The people who influenced me the most in my academic career are my parents, Shaun and Kristen Rihacek. They have always supported my education and encouraged me to work to the best of my ability. They taught me the importance of education and applying yourself to your work.”\nNATHAN PIER\nRichmond High School\nPrincipal: Andrea Szabo\nParents: Michael and Cathy Pier\nA 3.923 student at Richmond, he earned a 1210 on the SAT. Future plans include attending Eastern Michigan University, Lawrence Technological University or Ferris State University to major in Product Design/ Product Design Engineering Technology.\nNathan has been involved with the community volunteering at a Square One underwater robotics event as a judge and played Christmas music with a group of Richmond High School band members at a Richmond town hall Christmas ceremony. Honors received include Richmond High School Band Patrick Gilmore award, Macomb Community College Dean’s List (Early College of Macomb), Honor Roll\nHe said: “I’d say my biggest influence academically was my older sister Madelyn Spreer. She always took school seriously and she got a culinary degree several years ago and continues to use it in her job.”\nSAMUEL PENN\nSouth Lake High School\nPrincipal: Andrew Rousselo\nParents: Robert and Kristie Penn\nA 4.0 student at South Lake, he earned a 1470 on the SAT. Future plans include attending college to major in political science/biochemistry but is currently undecided on an institution though he has been accepted to University of Michigan and Michigan State University.\nSamuel has been involved with school and the community as football equipment manager, summer school tutor and Link Crew leader. Honors include All A Honor Roll, valedictorian and second place at the Detroit Science Fair.\nHe said, “My fourth and fifth grade teacher, Mrs Korchmar (Holly). She pushed me to be my best academically, allowing me to have a self determinist path where I could work through various subjects at different rates that best suited how I learned. Through this I was able to develop a passion for learning that has lasted until now and allowed me to be my best academic self.”\nClass C-D\nELIJAH RAUPP\nArts Academy in the Woods\nPrincipal: Dr. Michael Mitchell\nParents: Melanie Raupp and Matthew Raupp\nA 4.0 student at Arts Academy in the Woods, he earned a 1280 on the SAT. Future plans include attending University of Michigan, Dearborn to major in political science.\nElijah has been involved in the community with student tutoring, student orientation leader and student mentor. Honors received include valedictorian, National Honors Society, Dean’s scholarship and Magna Cum Laude.\nHe said, “Mr. Cory Allen, my instrumental music and jazz teacher, not only showed me my way around music, but he showed me my way around learning. Giving a charismatic and genuine approach to the learning experience, Mr. Allen instilled in me a newfound passion for creating and playing music.”\nSPENCER SCHRAGE\nAustin Catholic High School\nPrincipal: Janel Coppens\nParents: Amber Schrage and Matthew Schrage\nA 3.8 student at Austin Catholic, he earned a 1300 on the SAT. Future plans include attending Western Michigan University to major in aerospace engineering.\nSpencer has been involved with the community, helping with McWarm and helping out at the Miracle League. Honors received include All CHSL Scholastic Athlete, Honors in STEAM and Principal’s list/Honor Roll.\nHe said, “My dad has influenced me the most in my academic career. By seeing how he was able to work where he is now and how he can help people. He pushed me to be the best student and person that I can be.”\nKASSANDRA WALDI\nAustin Catholic High School\nPrincipal: Janel Coppens\nParents: Marie Waldi and Kevin Waldi\nA 4.0 student at Austin Catholic, she earned a 1470 on the SAT. Future plans include attending Michigan Technological University to major in mechanical engineering.\nKassandra has been involved with school and the community with Boy Scouts of America, varsity bowling and Random Acts of Kindness Club. Honors received include Eagle Scout rank with the Boy Scouts of America, with three Eagle palms and became a member of the Inaugural Class of female Eagle Scouts. All-Catholic award in 2022 and 2023 for varsity bowling and All League Award recipient in 2023 for varsity bowling.\nShe said, “My parents, Marie and Kevin Waldi have influenced me the most in my academic career as they have always encouraged me to try my best and pursue classes and extracurriculars that I am passionate about.”\nLAUREN BEHRENDT\nMemphis Junior/Senior High School\nPrincipal: Jesse Szatkowski\nParents: Dan Behrendt and Kari Behrendt\nA 4.0 student at Memphis, she earned a 1260 on the SAT. Future plans include attending Saginaw Valley State University to major in pre-physical therapy.\nSydney has been involved with school and the community, as student representative to the Board of Education, Miss Memphis (2022-2023) and Vacation Bible School and Worship Leader at Mt. Pleasant Bible Church. Honors received include valedictorian, drum major, honor guard, three consecutive first division ratings at Michigan School and Orchestra Association’s States Solo and Ensemble and two consecutive first division ratings at MSVOA (Choir States) solo and ensemble.\nShe said Joshua Eash, music teacher for band and choir, has been the most influential in her academic career. “Mr. Eash has taught me how to work hard and put the best version of myself forward. I may not be a music major, but what I have learned from his classes can be applied to every part of my education and more. He has taught me how to be a leader, a drum major and he has given me the skills to be precise with my work. He is an excellent teacher.”\nMICHAELANN BROYLES\nMerritt Academy\nPrincipal: Nathan Seiferlein\nParents: Michael Broyles and Laura Broyles\nA 4.0 student at Merritt Academy, she earned a 1370 on the SAT. Future plans include attending the University of Michigan, though as of now has not chosen a field of study.\nMichaelann has been involved in the community with National Honors Society and Junior Leadership Macomb. Honors received include Honor Roll, National Honors Society secretary and National Rural and Small Town recognition award\nShe said, “My parents, my sisters and all my teachers I have learned from in the past years of schooling have been the most influential in my academic career.”\nMEGAN KULA\nMerritt Academy\nPrincipal: Nathan Seiferlein\nParents: Leslie Kula and Jason Kula\nA 4.0 student at Merritt Academy, she earned a 1260 on the SAT. Future plans include attending the University of Alabama, to major in business.\nMegan has been involved in the community volunteering with the New Haven Fire Department to help train them in case of an active shooter in school, volunteered at Haven Place camp, doing community outreach and volunteered at Lighthouse Bible Church in Vacation Bible School and nursery. Honors received include Team Most Valuable Player and varsity cheer team, attended myLead Leadership Conference, Student Government and National Recognition Program scholarship recipient.\nShe said, “The people that have influenced me the most are my parents. They have set me up with the resources I need to be successful, both tangible and intangible. They are there for me, every step of the way and never stop pushing me to be the best version of myself. Also my teachers and coaches who taught me I can achieve anything.”\nCHLOE PILGRIM\nMerritt Academy\nPrincipal: Nathan Seiferlein\nParents: Shaualin Murphy and Joshua Murphy\nA 4.0 student at Merritt Academy, she earned a 1190 on the SAT. Future plans include attending Wayne State University, to major in behavioral sciences.\nChloe has been involved in the community at Faith Christian Center, National Honors Society and participant in MyLead Conference. Honors received include National Honors Society vice-president, class officer all four years of high school, first team in soccer, All-Conference in volleyball and All “A”’s honor roll all four years in high school.\nShe said, “My sister, Ariauna Pilgrim has influenced me most in my academic career. Her and I have been through a lot together, so seeing how she accomplished so many amazing things inspired me to do the same.”\nAZALYIAH WALLACE\nMount Clemens High School\nPrincipal: Tina McNeely\nParents: Antoinette Wallace and Maurice Wallace\nA 3.8 student at Mount Clemens. Future plans include attending the University of Kentucky to major in pre-veterinary medicine.\nAzalyiah has been involved with the community, participating in the annual Santa parade and the first Mount Clemens Juneteenth event. Honors received include All-Academic Honor Roll, Dean’s List for academic performance at Macomb Community College for the winter, spring and summer semesters of 2021.\nShe said, “My older sister has inspired me most in my academic career. She has always shown how strongly motivated she was academically and has always strived to keep her grades up. This has inspired me to keep my goals and spirits high throughout my academic career.”\nTAYLOR ANGUS\nNew Haven High School\nPrincipal: William Timmerman\nParents: Vanessa Davis and Jeffrey Davis\nA 3.935 student at New Haven, he earned a 1200 on the SAT. Future plans include attending Northern Michigan University to major in biological sciences.\nTaylor has been involved with the community with Color Run, New Having Community set up course and course timing, flyer administrator, Community River Day clean up, garbage collection. Honors received include section leader in band, Most Valuable Player for cross country, Top 10 of the class of 2023, National Honors Society and Cross Country State finals in 2021.\nHe said, “Vanessa Davis, my parent, has been the most influential person in my academic career. She is an elementary school teacher. My love of learning, growing and most importantly teaching comes from her influence. She strives to help others develop their passions and love for learning.”\nABIGAIL CARD\nNew Haven High School\nPrincipal: William Timmerman\nParents: JEanne Card and Douglas Card\nA 4.0 student at New Haven, she earned a 1280 on the SAT. Future plans include attending college to major in biochemistry though undecided on an institution.\nAbigail has been involved with the community, with the Competitive Dance Team at Main Stage Center for the Arts, National Honor Society and Business Professionals of America. Honors received include soloist in Port Huron Nutcracker, soloist in Blue Water Dance Theatre’s production of ‘Alice in Wonderland’ and honorable mention in Scholastic Art Awards for ceramics.\nShe said, “My older brother, Max Card, influenced me most in my academic career by being an admirable role model. Our competitive relationship has inspired us both to excel in our academics.”\nBAYLEIGH STEWART\nNew Haven High School\nPrincipal: William Timmerman\nParents: Joel Stewart and Rebecca Stewart\nA 3.929 student at New Haven, she earned a 1280 on the SAT. Future plans include attending University of Detroit Mercy to major in pre-pharmacy.\nBayleigh has been involved with the community, wrapping presents for foster kids, donating blood and serving food to the community. Honors received senior class top 10, Top 100 students in the county and Honor Roll.\nShe said, “My mom has influenced me most in my academic career by helping me get through my classes when I was younger and sticking through the school no matter how busy her life was.”\nHENRY WOODS\nNew Haven High School\nPrincipal: William Timmerman\nParents: Brian Woods and Sheila Carrier-Woods\nA 3.862 student at New Haven, he earned a 1470 on the SAT. Future plans include attending Macomb Community College and Wayne State University though yet undecided on a field of study.\nHenry has been involved with the community, volunteering at the Clinton-Macomb Public Library and National Honor Society. Honors received Macomb Career and Technical Education Administrators Association Outstanding CTE student 2022-2023.\nHe said, “Mrs Kristen Janssen influenced me the most because she was always there for me during my exceedingly stressful middle school years. She provided me a safe place to calm down when I was having trouble with stress and self-confidence. She was my school social worker.”\nPHAT HUYNH\nParkway Christian School\nPrincipal: Lila Place\nParent: Huynh Van Loi\nA 3.965 student at Parkway Christian, he earned a 1410 on the SAT. Future plans include attending Oakland Community College to major in nursing.\nPhat has been involved with the community, volunteering in church activities, helping translate for people who are not fluent in English and helping organize events at church. Honors received include being a competitive translator in Vietnam.\nHe said, “The person who influenced me most in my academic career is Chinh Huynh, who is my grandfather. He has always encouraged me to study to have a good future and he has always provided for my education.”\nZION WILLIAMS\nParkway Christian School\nPrincipal: Lila Place\nParents: Carmen Williams and Parnell Williams\nA 4.0 student at Parkway Christian, she earned a 1180 on the SAT. Future plans include attending college to major in political science.\nZion has been involved as vice-president of the Youth Advisory Committee for Southeastern Michigan, vice-president of the Youth Advisory Board for Sterling Heights and founder of the PCS Diversity Advisory Committee. Honors received include Do The Right Thing Award, National African-American Recognition Program and Principal’s List.\nShe said, “My younger brother, Zachariah WIlliams, has influenced me the most because he reminds me to always work for what I want and not to take the easy way out. He also is always supporting me and lifting me up. I am very grateful to have him.”",
  "word_count": 14103,
  "scraped_at": "2026-02-14T12:15:10.259021"
}