{
  "article_id": "b4bf02db31de",
  "url": "https://www.the42.ie/championship-wsl-wrap-6650648-Mar2025/",
  "title": "Sykes on target as Bristol City edge out Norwich to move into Championship play - off places",
  "date": "20250315T004500Z",
  "domain": "the42.ie",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "GOALS FROM MARK Sykes and Nahki Wells took Bristol City into the Championship play-off places with a 2-1 victory over Norwich at Ashton Gate.\nRepublic of Ireland international Sykes fired the home side in front after six minutes with a curling left-footed shot, having cut in from the right to finish a move started by Rob Dickie’s strong run out of defence.\nIt was 2-0 after 23 minutes when Norwich defender Jose Cordoba was caught in possession looking to play out from the back and Joe Williams fed Wells, whose clever turn and low shot from an angle beat goalkeeper George Long.\nBorja Sainz gave Norwich hope with a low, close-range finish from Callum Doyle’s 82nd-minute cross, but despite late pressure they could not force an equaliser.\nIreland goalkeeper Max O’Leary, Jason Knight and Sykes — among four changes after his late equaliser in a 1-1 midweek draw at Sheffield United — started for Bristol City, while recent call-up Sinclair Armstrong was introduced as a second-half substitute.\nWhile O’Leary produced some big saves and Sinclair fired into the side-netting, Shane Duffy played the full game for Norwich.\nSykes, Knight and Armstrong are all in Heimir Hallgrimsson’s squad for next week’s Nations League promotion/relegation play-off with Bulgaria.\nMeanwhile in the Women’s Super League, there were several Irish players in action as Liverpool stunned Manchester United and Arsenal beat Everton. It was another big result for Ireland assistant coach Amber Whiteley, in interim charge of the Reds, as they beat United 3-1 at Anfield.\nArsenal leapfrogged United to second — Chelsea are eight points clear at the top — after their own 3-1 win at Everton combined with the evening’s other result.\nKatie McCabe played the full game for Arsenal, while Courtney Brosnan was in goal for the Toffees. Heather Payne was an unused substitute.\nAlessia Russo bagged a brace for the Gunners; her opener on 24 minutes cancelled out by a Toni Payne goal before half time. A Maren Mjelde own goal put Renée Slegers’ side back in front, before Russo wrapped up the win in the 90th minute.\nOlivia Smith (two) and Luka Nagano powered Liverpool to an impressive victory at Anfield, Maya Le Tissier’s late response for United but a consolation goal.\nAoife Mannion featured for the Red Devils, while Niamh Fahey went unused for Liverpool. Leanne Kiernan is on the comeback trail from a calf injury, but was again absent from the matchday squad.\n- With reporting from Emma Duffy",
  "word_count": 412,
  "scraped_at": "2026-02-14T12:43:02.483948"
}