{
  "article_id": "b4e18a8313c7",
  "url": "https://www.dailymail.co.uk/news/article-13850709/The-battle-Britain-Wily-Salmond-played-Old-Etonian-David-Cameron-like-cheap-fiddle.html",
  "title": "The battle for Britain : Wily Salmond played Old Etonian David Cameron like a cheap fiddle",
  "date": "20240914T201500Z",
  "domain": "dailymail.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "The battle for Britain: Wily Salmond played Old Etonian David Cameron like a cheap fiddle\nWho pretended to be Salmond as Alistair Darling practised for their TV showdown? How did Scotland United become Better Together? And what was Cameron’s naive gift to the SNP? A decade on from the independence referendum, the explosive inside story of the Battle for Britain...\nAlex Salmond was ever the showman. The First Minister could easily have settled for a formal nod from Whitehall that the powers to hold a referendum on Scottish independence were to be transferred, as promised by the Prime Minister, David Cameron, to the Scottish parliament.\nBut receiving an email or letter from a senior civil servant in Downing Street confirming the arrangement was not nearly enough for Salmond. Only a full-blown media event would do to mark the historic occasion.\nEven better – a ceremony in which he played the part of the magnanimous, dutiful host towards Cameron, the visiting supplicant paying homage to his senior statesman.\nAnd on October 15, 2012, the First Minister got his way.\nThe signing of the pompously named Edinburgh Agreement between the UK and Scottish governments was a masterclass in the SNP leader’s ability to generate positive headlines.\nThen PM David Cameron was outmanoeuvred by Alex Salmond over the date of poll\nThousands of pro-independence campaigners attend a rally on Calton Hill on September 21, 2013\nThe once frenzied support was notable by its absence yesterday\nSalmond insisted to his civil servants that an electoral map of Scotland, with a sea of yellow illustrating his party’s landslide triumph in the previous year’s Holyrood elections, should be set up directly behind his own chair, so it would appear prominently in media images of the signing ceremony.\nMeanwhile, in a metaphor for the pro-UK campaign at the time, the ministerial car of the then Scottish Secretary, Michael Moore, broke down on the way to the ceremony and Moore was forced to run the last few hundred yards to St Andrew’s House.\nIt was not the first time that wily Salmond had appeared to run rings round his more politically naive opponents.\nFrom the moment in May 2011 when his party unexpectedly won a majority of Scottish parliament seats, delivering a devastating defeat to his Unionist opponents, Salmond insisted he now had a mandate to deliver his manifesto promise of a referendum on independence.\nHaving been in Downing Street for barely a year, Prime Minister Cameron knew little of Scottish politics and seemed a pushover for the much more experienced Salmond.\nWithin days, the so-called Quad – a star chamber of the four most prominent members of the coalition government, comprising Cameron, Chancellor George Osborne, Liberal Democrat leader and Deputy Prime Minister Nick Clegg and Chief Secretary Danny Alexander – had decided that conceding to Salmond’s demands for a referendum was less risky than blocking such a vote.\nSupport for independence among Scots was around the 30 per cent mark and the four men were confident that the future of the UK was secure.\nIt was such complacency that led to a series of errors that almost resulted in the destruction of the 300-year-old Union.\nWhat followed was an often chaotic process. On the streets of Scotland, regular canvassing by local political activists happened year round.\nScottish First Minister Alex Salmond and Deputy First Minister Nicola Sturgeon present the White Paper for Scottish independence at the Science Museum Glasgow on November 26, 2013\nTime and again, Labour canvassers were reporting a sense of voters’ frustration that the campaign to save the Union had been invisible, while Salmond and his party seemed to be organising fast.\nOne ex-soldier told his Labour MP that he and his family were determined to oppose independence. ‘But where are the posters?\nThe badges? Where are the leaflets explaining why independence would be a terrible idea?’ In response the MP simply asked his constituent to be patient.\nScottish Labour was a demoralised force, having suffered one of the worst defeats in its history. Many members were unhappy about a cross-party alliance that would see them forced to campaign alongside the hated Conservatives.\nFor this reason, Labour United was conceived as a purely Labour campaign that sought to distance itself from the official Better Together effort.\nBut throughout the campaign, most of Labour’s ‘big guns’ and election strategists – Douglas Alexander, Jim Murphy and Frank Roy, the former whip who had masterminded all of the party’s recent by-election successes – remained with the cross-party campaign and proved successful in working with individuals who, in any other context, would have been considered opponents.\nThe first error of the campaign was Cameron’s alone – and came before pen had been put to paper.\nAt a reception at the Whitehall HQ of the Scotland Office on May 15, 2012, to mark the biggest transfer of powers to Holyrood since the Scotland Act in 1998, the Prime Minister, in off-the-cuff remarks, astonished government colleagues as well as the journalists present.\nHe also fatally undermined the government’s hopes of securing a short referendum campaign by announcing he was not ‘too fussy’ about the timing of polling day.\nThis was a gift for Salmond, who knew that the longer the campaign, the better it would be for the chances of a majority Yes vote.\nHe was already hoping that he could persuade the UK Government to concede a date some time in the autumn of 2014 – more than two years away.\nBut it was too late for Cameron to retract his ill-advised words.\nSalmond was given the green light to hold the referendum a few months before the next general election, which was scheduled for May 2015.\nThis tactic would have devastating – if unforeseen – consequences, particularly for the Labour Party.\nThe First Minister got his way in two other crucial areas, and did so by a masterful manipulation of Cameron and his team.\nThey had been led to believe that the SNP leader wanted – needed – a second question on the ballot paper on Full Fiscal Autonomy, in effect the devolution of everything still controlled by Westminster other than foreign affairs and defence.\nThis option would leave Scotland as part of the UK, if only nominally. And in the event of a defeat for independence, it would leave Holyrood with an unprecedented level of powers.\nSalmond reportedly held out for this third option, with voters invited to list their preferences in order: status quo, independence or Full Fiscal Autonomy.\nBut it was no more than a tactic. It gave Salmond something he could ‘reluctantly’ surrender in exchange for Cameron conceding Salmond’s preferred franchise, allowing EU citizens and 16-year-olds a vote, and – most important of all – date of polling.\nThe ruse worked. The Edinburgh Agreement gave Salmond everything he could have wished for. Now all he needed to do was persuade the Scottish people.\nSalmond’s position at the head of the Yes campaign was taken for granted and never challenged, despite misgivings among some nationalists that he was a divisive figure.\nAccording to polls, his appeal to women voters was significantly behind that of men. Still, there were no realistic alternatives to the First Minister.\nBut who would be the public face of the No campaign?\nAmong pro-UK politicians, there was general agreement that while the Conservative Party would supply most of the cash, Labour would provide the activists.\nGiven the political make-up of Scotland, the figurehead of the campaign had to be a Labour politician.\nA number of names were considered, including the former Prime Minister, Gordon Brown, Jim Murphy, the shadow defence secretary, and his colleague, the shadow foreign secretary, Douglas Alexander.\nNeither of the latter was keen to leave the shadow cabinet, however.\nBrown was deemed too difficult to work with by those who had spent time in government with him. In the event, he would make some dazzlingly effective interventions on the Union side as the campaign drew to a close.\nThe obvious choice was Alistair Darling. Having spent three years as Chancellor of the Exchequer during the financial crisis and its aftermath, the Edinburgh MP was an authoritative figure and had credibility among the financial sector whose fears about separation would help define the economic case for a No vote.\nDarling’s calm manner had meant he was one of only three Labour MPs (the other two being Brown and Jack Straw) who had served as a minister throughout Labour’s 13 years in government.\nEven criticisms that he was dull and uninspiring were seen as positive attributes, a healthy antidote to the showmanship of Salmond.\nDarling offered invaluable reassurance to sceptical Scots worried about the future.\nIt was Darling, alongside his friend and former ministerial colleague, Brian Wilson, who came up with the name Better Together, having rejected the alternative title, Scotland United, as sounding too much like a football team – as well as being absurdly inaccurate in the circumstances.\nThe next appointment was that of the campaign’s chief executive. Blair McDougall, who in July this year became Labour MP for East Renfrewshire. He was appointed having worked for a Labour cabinet minister at Westminster and for Tony Blair’s Governance Initiative.\nEven McDougall might admit he wasn’t everyone’s cup of tea.\nOne senior figure who worked closely alongside him during the campaign described him in scathing terms, promising he would never work with him again – or even talk to him, if it could be avoided.\nSuch tensions were no doubt rife in both camps – the Yes campaign went through a series of high-profile directors at an exhausting pace – but they seemed more visible in the No campaign, perhaps partly down to its genuinely cross-party nature.\nMcDougall’s No2, Rob Shorthouse, for example, was hired on a salary of £100,000 – considerably higher than what his boss was being paid – despite grumbling among senior figures that other, better qualified and more connected candidates had been overlooked.\nShorthouse invented the phrase ‘Project Fear’ to describe the No campaign’s dire warnings of life after independence, a phrase\nthat was later weaponised by the Yes campaign to attack their opponents’ negativity.\nInitial opinion polls showing a large majority of Scots in favour of continuing Scotland’s participation in the Union proved to be a double-edged sword for Better Together.\nLarge donors failed to materialise, believing their contributions would not be necessary to inflict defeat on the separatists.\nSo for the early months of the campaign, without funding or even office accommodation, McDougall was forced to use his personal credit card to fund purchases, while using local coffee shops to hold meetings.\nOn May 25, 2012, the Yes campaign was formally launched at an Edinburgh cinema. One of the films showing at the time was The Dictator, an irony the organisers could have done without as Alex Salmond took to the stage to inspire the troops to victory.\nThe following month, it was the turn of the Better Together campaign. Organisers decided to feature ordinary Scots instead of showbiz stars.\nBut the presence of all three leaders of the pro-UK political parties – Johann Lamont of Scottish Labour, Ruth Davidson of the Scottish Conservatives and Scottish Liberal Democrat leader Willie Rennie – attracted much comment, and the co-operation\nof the political rivals was to prove a controversial element of the campaign – and beyond.\nWith the launches out of the way, campaigning was handed over to the troops in the trenches.\nWhile footsoldiers were deployed to hit the streets and phone lines, the rise of social media, particularly Twitter (as it was then called), played a key role in motivating and engaging activists, even though only a small proportion of Scots used the platform.\nThe nature of the online debate quickly deteriorated into insults, slurs and threats of violence defining much of the bitter campaign.\nFormer Labour MP George (now Lord) Foulkes coined the term ‘Cybernats’ to describe the growing army of mostly anonymous Yes campaigners who expressed unalloyed hatred for fellow Scots who dared support a No vote.\nThe police were dragged into disputes, including when one SNP-supporting activist in Glasgow Tweeted his hope that a fellow nationalist might run Jim Murphy over during one of the Labour MP’s night-time jogging exercises.\nThat toxicity bled into the real world. While Yes supporters subsequently boasted about how positive their experiences on the campaign trail were, No campaigners complained about the hostility they received from their opponents.\nLocal campaign headquarters and vehicles displaying Better Together stickers were vandalised, while local squads of No campaigners were routinely abused by passing Yes supporters.\nWhen Jim Murphy got on his Irn-Bru crate to help save the Union, the animosity between the two sides properly crystallised.\nMurphy, the Eastwood Labour MP, hit upon the idea of a ‘100 Towns in 100 Days’ campaign, in which he would seek to duplicate former Prime Minister John Major’s soapbox tactic from the 1992 and 1997 general election campaigns by taking the debate to the people, standing on Irn-Bru crates in various town centres while making the case for the Union.\nThe events quickly became a focus for ill-tempered confrontations between Murphy’s supporters and the mobs of nationalists who organised to try to drown out his message.\nAt one event in Dundee, a snarling nationalist shouted: ‘Go back to London, go back to your nest of paedophiles!’, while a newspaper photographer who happened to have an English accent was threatened with physical violence.\nWhen Murphy was hit by an egg thrown by one enterprising Yes supporter who had gone to a nearby Tesco to buy the projectiles, the speaking tour was suspended.\nHead-to-head debates were an inevitable part of the TV coverage of the campaign. Salmond wanted a debate between himself and Cameron.\nThis was never going to happen; Better Together wanted to avoid such a clash for the same reason that Salmond thirsted after it: it would be presented as a showdown between Conservative England and Socialist Scotland.\nThe reality was this was about a contest between two different versions of Scots championed by Scots themselves.\nThe SNP leader’s victories in the 2007 and 2011 Holyrood elections were considered personal victories for the man himself, rather than his party, and there were few opposition politicians who relished going up against him in open debate. Preparation was everything.\n2014 rally was the peak of independence movement\nModern politicians are used to the head-to-head debate format on live TV but it is still a nerve-shredding experience, especially when the stakes are as high as they were in the run-up to polling day in the referendum.\nBetter Together’s HQ was located in Glasgow’s Sauchiehall Street; debate rehearsals were held at a secret location in the city’s Blythswood Square.\nPaul Sinclair, a former Scottish journalist who had worked at Gordon Brown’s Downing Street and who now worked for Johann Lamont at Holyrood, was invited to take part in the rehearsals playing the role of Salmond.\nTo Sinclair’s friends and critics alike, this was an obvious role for him to play.\nHe had achieved a reputation as a bullish hard-man, not dissimilar to Salmond, who would be the perfect foil to Darling as the preparations for the real debate continued.\nSinclair suggested another key participant for the training sessions. Scott Chisholm, a New Zealander and journalist with whom Sinclair had worked on the campaign to change the electoral system in the failed referendum of 2011, and had helped prepare the Liberal Democrats’ Nick Clegg for the leaders’ debates in the 2010 general election.\nClegg was seen as the beneficiary of those debates and Sinclair reckoned Chisholm could be an asset to the No campaign.\nWith Chisholm on board, the exhausting daily rehearsals began. ‘Those were really intensive sessions.\nWe trained for hours on end,’ said Sinclair. ‘Alistair was intellectually superior to Salmond, but Alex was a bar-room brawler when it came to debates.\nWe were worried that Alistair would let him get away with murder.’\nThe first of two debates was held on August 5, 2014, at Glasgow’s Royal Conservatoire and broadcast by STV. ‘Absolutely no one expected Alistair to win either of the debates,’ said Sinclair.\nThis view was confirmed by Nationalist MP Pete Wishart, who said before the first event: ‘It’ll be a slaughter worse than the Bannockburn re-enactment if they put out the angry, agitated Alistair to debate with the First Minister.’\nBut nationalist pride turned to hubris as Darling took aim at the Yes campaign’s biggest weakness: what currency an independent Scotland would use.\nThe issue had been expected to be addressed in ‘Scotland’s Future’, a publicly funded White Paper published by the Scottish Government a year earlier which purported to provide a template for an independent Scotland.\nYet when it was published, even No campaign staff were amazed it had failed\nto address some of the economic questions the nationalists had evaded so far, including on currency.\nIn 2014, Salmond insisted, despite denials from the Treasury, that Scotland could\nenter a currency union with England to keep using the pound.\nThe whole policy was a mess, especially since the current chancellor, George Osborne, and his shadow, Ed Balls, had explicitly ruled out such an arrangement.\nNow, in the debate, Darling struck with the defining line of the evening, one that Sinclair had crafted for him: ‘Any eight-year-old can tell you the flag of a country, the capital of a country and its currency.\nRonnie Anderson from Edinburgh waves a Saltire flag beside the '18 September 2014' sign outside the Scottish Parliament\nNow, I assume the flag is the Saltire. I assume our capital will still be Edinburgh. But you can’t tell us what currency we will have.\nWhat is an eight-year-old going to make of that?’\nSalmond simply had no answer. The night and the laurels belonged to Darling and the No campaign was jubilant.\nThree weeks later, during the next leg, Darling’s first triumph wasn’t to be repeated. Salmond had learned from his mistakes, and Darling, perhaps too reliant on earlier tactics, failed to capitalise further on the nationalists’ economic difficulties.\nThe No campaign was bereft, especially following the success of Darling’s previous performance.\nBut Sinclair remains a stout defender of the late chancellor’s character and poise during those debates: ‘No one expected Alistair to win either of the debates, and when he won the first one, he simply would not take a word of praise, and instead praised all of us for what we had done in helping him prepare.\n‘And after the second debate, he took us back to his hotel room and repeatedly apologised for letting us down.’\nMost watched News videos\n- Extraordinary moment mass brawl breaks out between Brits on flight\n- Finance expert's TV interview interrupted by adorable granddaughter\n- Moment driver veers to target e-bike riders before killing teen\n- Moment Swiss bar fire owners collapse after being confronted\n- Astonishing moment a street is swallowed by a sinkhole\n- Chilling police interview of ISIS fanatic plotting UK attack\n- Food vlogger dies after 'eating toxic devil crab'\n- Spy cam shows woman on her knees next to Jeffrey Epstein\n- Deepak Chopra confronted over his relationship to Epstein\n- Toddler opens car door in traffic and sends biker flying\n- New video shows man with backpack similar to Guthrie kidnapper\n- Israeli hostage reveals how she survived being tortured",
  "word_count": 3227,
  "scraped_at": "2026-02-14T12:33:29.934348"
}