{
  "article_id": "b4f408832b81",
  "url": "https://cineuropa.org/en/newsdetail/474890/",
  "title": "Marta Díaz de Lope Díaz directing Pioneras : Solo querían jugar",
  "date": "20250312T163000Z",
  "domain": "cineuropa.org",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "PRODUCTION / FUNDING Spain / Portugal\nMarta Díaz de Lope Díaz directing Pioneras: Solo querían jugar\n- Aixa Villagrán and Daniel Ibáñez are among the cast of this film about the first Spanish women footballers, who broke taboos in their quest to enjoy their sporting passion uninhibited\nThe shoot has just begun in Madrid, Tenerife and Guadalajara for Pioneras: Solo querían jugar (lit. “Pioneers: They Only Wanted to Play”), a film penned by duo Marta Díaz de Lope Díaz and Zebina Guerra, and directed by the former. They were both behind the movies Hopelessly Devout [+see also:\ntrailer\nfilm profile] and Good Manners, which were presented at the Málaga Film Festival. Their new feature is described as a tribute to the group of girls who, thanks to their bravery, hard work and perseverance, managed to open up an avenue for women that, until then, had remained closed off: they laid the foundations for future generations of women’s footballers who, 50 years later, would hold aloft the World Cup.\n“Pioneras: Solo querían jugar is not just the story of a sporting feat, but also a social one, which will be aimed at both a broad, family audience and one composed of football fans,” stated director Marta Díaz de Lope Díaz. It is a story of struggles, sacrifice and passion based on real events, which takes place in 1970s Spain, with the Franco regime in full swing, where a handful of belittled, football-obsessed girls and a visionary and daring sports promoter joined forces to start forging what would become the history of women’s football in Spain.\nThese young women who fought for a more egalitarian society will be played by a cast of fresh faces, led by feature-length first-timers Sofía de Iznájar and Bruna Lucadamo (the daughter of actress Aitana Sánchez-Gijón) together with Daniel Ibáñez (Saturn Return [+see also:\nfilm review\ntrailer\ninterview: Isaki Lacuesta\nfilm profile]), nominated for the Goya for Best New Actor. The film will also boast special appearances by Aixa Villagrán (Goya-nominated this year for The Red Virgin [+see also:\nfilm review\ntrailer\nfilm profile]), Elena Irureta (the series Patria [+see also:\nseries review\nseries profile], appearing in this year’s Deaf [+see also:\nfilm review\ntrailer\ninterview: Eva Libertad\nfilm profile]), José Troncoso and Jordi Sánchez.\nThe action kicks off in 1970, with the first women’s football match organised by a young coach (played by Daniel Ibáñez), who is stunned by the talent and passion of a group of girls who, even as everything is stacked against them and they are forced to endure insults and harassment, manage to amaze the people who watch their games. Despite all of the difficulties they will face, these players will pack out fields full of mud and puddles. This group of women will manage to earn the respect of the fans, break down barriers and take the baby steps for Spanish women’s football, even with everything seemingly against them.\nPioneras: Solo querían jugar is a production by Spain’s Cine365 Films, Nadie es Perfecto, Ciudadano Ciskul and Pioneras la Película AIE alongside Portuguese firm Bando à Parte. It has secured funding from RTVE, Movistar Plus+, the ICAA and CREA SGR. Its Spanish distribution will be overseen by Filmax.\n(Translated from Spanish)\nDid you enjoy reading this article? Please subscribe to our newsletter to receive more stories like this directly in your inbox.",
  "word_count": 560,
  "scraped_at": "2026-02-14T12:35:04.613371"
}