{
  "article_id": "b4f56533ec89",
  "url": "https://www.sbs.com.au/news/article/wouldnt-be-where-i-am-without-him-the-moment-clare-wheeler-made-it-to-the-olympics/1apt95opz",
  "title": "  Wouldnt be where I am without him : The moment Clare Wheeler made it to the Olympics",
  "date": "20240707T020000Z",
  "domain": "sbs.com.au",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Representing Australia at the Paris Olympics for the first time is not something Clare Wheeler takes for granted.\nThe Matildas midfielder was selected for the 18-person squad travelling to Paris this July, where it will face tough group stage matches against Germany, the US and Zambia.\nHer star has been rising in the team and she scored her first goal in a friendly against China in June, to rapturous celebration from the team and sold-out stadium.\nWheeler debuted for the Matildas in 2021 during a friendly against the Republic of Ireland, aged 23, and was selected for the 2022 AFC Women's Asian Cup and 2023 World Cup.\nThe footballer, who also plays for Women's Super League club Everton in the UK, spoke to SBS News about her career and the effect of women's football's spike in popularity in recent years.\nWhat was it like finding out you were selected for the Olympics squad?\nSo basically it was in a meeting with (coach) Tony (Gustavsson) and our assistant Jens. And when Tony told me, I asked him back, I was like, \"So I'm going just to confirm,\" because I think my body was like, \"I'm not entirely a hundred per cent sure I heard that right, so let's confirm it again\".\nThe first person I told was my dad and it's becoming more real as we get closer, but I think definitely the first stage I was in a bit of a disbelief.\nWhat does having family support mean to you?\nThere's so much that goes into being a professional athlete and having a key support network is really crucial.\nFor me, I wouldn't be where I am without my dad. Not even in terms of the present, but also in the past, the hours that go into being a parent to take a kid to training, but also financially to support them going to youth tournaments and stuff like that.\nAnd it was never a chore for him. He gladly took me all up and down the coast of New South Wales for soccer. And to be able to share that moment with him, that I'm going to an Olympics, is really special.\nHe'll be over in France and hopefully, at the end of it we can have a photo with a medal together and it'll be really special to share that with him, knowing everything that he's put into this dream of mine.\nThinking back to when you were 16 in Newcastle and joining the W League, how do you think the game has changed since you started?\nHonestly, the development is going in the right direction and it's really great to see, even in my time playing. When I started out, there wasn't an Emerging Jets program (a development pathway for young players) and it was very grey, I didn't have a clear pathway.\nAnd now there's more access to national team kind of environments and better pathways that are clearer. It's good to see and I hope it keeps going. There are more academies and there's more access for girls in regional and remote areas.\nHaving better access to training environments for those girls is really important to stop the drop-off and to keep people playing. And hopefully, with the growth of women's sport, that's going to be a reality.\nWhat do you learn from playing with some of the veterans on the team?\nYou learn the sacrifice in terms of being a professional footballer, their professionalism and just their attitude towards international football and what it means to be a Matilda.\nWhat you see on the field is what you get off the field. They love playing for Australia, they love everything it means, and that never-say-die attitude.\nHow do you manage the mental aspect of going to a tournament but not playing?\nIt's definitely challenging to not take part on the field (at the 2023 Women's World Cup), but at the end of the day, I think I was just in awe of the tournament itself as well as what it meant for football and women's sport in general.\nBeing there on the field and just seeing the support and just being a part of that will always be something that I take with me and something I'm very proud of. But it definitely has added to my fire, my desire to keep going and one day be a part on that field and play a bigger role.\nBut it's something that I don't look back at and have negative feelings [about] at all. I'm just really thankful to be a part of that squad and to be a part of that history in Australia.\nWhat do you think has been one of the biggest takeaways from the World Cup in terms of how it changed things for you?\nSeeing 14 consecutive sellouts for women's football.\nIt just shows that the tournament struck a chord with a lot of Australians and it's bringing more exposure to the women's game. And I think that's really important to be a role model for future generations, to show them what they can do and what football can bring.\nI think in Australia, we're a hardworking nation. We love to battle, we love to try our best in absolutely anything we can. And I hope it not only propels football in a better direction but women's sport in general across Australia.\nBeing a part of that movement has been amazing and it's not lost on us either. When we sell out another game every time it's like, yeah, wow, this is becoming that new norm for Australia.\nIt's great to see, and even girls over here at Everton, they've made mention of it, like, \"Oh, that's so good that your game sold out again\" and stuff like that.\nWe're now creating a bar, an expectation and showing other national teams what we've been able to achieve and it's good to see.\nSo it's not even just within Australia, but pushing the expectations and the norms internationally as well.",
  "word_count": 1009,
  "scraped_at": "2026-02-14T12:42:33.681175"
}