{
  "article_id": "b525ed0fcd50",
  "url": "https://www.rnz.co.nz/international/pacific-news/491833/sports-news-in-brief-for-june-12",
  "title": "Sports news in brief for June 12",
  "date": "20230612T041500Z",
  "domain": "rnz.co.nz",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Solomon Islands recieves $US7 million from Saudi Arabia for Pacific Games\nSaudi Arabia is providing $US7 million in grant assistance to support the Solomon Islands in its preparations for this years' Pacific Games.\nThe agreement was announced by the Saudi Government over the weekend during a vist to the Saudi Kingdom, by Solomon Islands Prime Minister Manasseh Sogavare.\nSogavare met with Saudi Arabia's Foreign Minister Adel Al-jubeir in Riyadh.\nAl-jubeir said in a media statement an agreement had been signed last week and the transfer has been completed.\nAS Academy Féminine wins OFC Women's Champions League\nNew Caledonia's AS Academy Féminine is the inaugural OFC Women's Champions League winner.\nThey claimed the title after defeating Solomon Islands' Koloale FC 4-1 in their final game on Saturday.\nKoloale FC scored the first goal, but AS Academy Feminine dominated the second half with four consecutive goals.\nThe New Caledonian side remained the only undefeated team at the event.\nLocal Papua New Guinea club Hekari United finished second after they accounted for Fiji's Labasa 2-nil in the final game of the event.\nHekari United ended the tournament having scored 17 goals and conceded just two.\nThey will lament their opening day defeat to AS Academy Féminine which proved the difference between winning the title and finishing second.\nFormer Kumul stars punished for assault\nTwo former rugby league players in Papua New Guinea have been punished after assaulting a referee.\nAccording to the PNG National Rugby League Competition, Lae Tigers staff David Loko and Jerry Kutz assaulted the referee following their loss to Enga Mioks.\nAccording to The National, the pair have been banned from attending any Digicel ExxonMobil Cup games for five years, and must not be seen within 100-metres of any venues hosting the competition.\nMultiple players also faced suspensions related to incidents during the game, and incidents in the earlier match of the double header, Goroka Lahanis against Mendi Muruks.\nThe PNG National Rugby League Competition said it does not condone any form of violence in its premier competition and it has previously adopted a zero-tolerance policy.\nKapuls preapare for international friendlies\nThe Papua New Guinea senior men's football team have begun preparations for two international friendlies against Singapore and Malaysia during the Fifa window next week.\nThe National reports the PNG Kapuls are set to face Singapore on June 15th before taking on Malaysia on June 20th.\nCoach Harrison Kamake said the 33-man squad will be trimmed to 23 before they travel.\nThe friendlies are important as they contribute to the team's world ranking.\nNorthern Marianas tennis player wins in US\nNorthern Marianas tennis player Colin Sinclair has won his third ITF Singles Title on the hardcourts at the Rancho Santa Fe Tournament in California.\nSinclair beat the 4th seed, Jaimee Floyd Angel of France 6-3, 6-2 in the final.\nThis adds to his two previous titles in 2021 in Guatemala and in 2019 in Claremont, California.\nHe has also won nine doubles titles, including three this year.\nFor the first time in his career, this will take his World ranking inside the top 400.\nHis doubles ranking is currently 220.\nSamoa rugby club disqualified\nA Samoan rugby sevens club - Tama Uli - has been disqualified from all competitions this year.\nThe steering committee for sevens rugby in Samoa said a Tama Uli player collared an overseas referee while his teammates swore at members of a visiting delegation of match officials.\nThe incident occurred during the 35th Digicel Marist International Sevens Tournament in Apia.\nFiji Development Sevens team won the tournament after defeating Samoa's Vaiala club by 40-7.",
  "word_count": 599,
  "scraped_at": "2026-02-14T12:45:57.554981"
}