{
  "article_id": "b539d3ce8410",
  "url": "https://www.sun-sentinel.com/2024/03/13/big-12-mens-and-womens-tournaments-kansas-city-2031-commissioner-brett-yormark-ucf/",
  "title": "Big 12 men , women tournaments to remain in Kansas City",
  "date": "20240313T210000Z",
  "domain": "sun-sentinel.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "By Dave Skretta\nAssociated Press\nKANSAS CITY, Mo. — The Big 12 men’s and women’s basketball tournaments will remain at T-Mobile Center through 2031, commissioner Brett Yormark said Tuesday night, shortly before Texas and Iowa State played for the women’s title in the building for the first time.\nThe women’s tournament had long been played down the street from the glitzy downtown arena at Municipal Auditorium, which has tremendous history as one of the homes of early NCAA championship games but has grown antiquated over time.\nOne of Yormark’s priorities after taking over leadership of the Big 12 was to raise the profile of the women’s tournament, and that meant moving it to the T-Mobile Center. That also required moving the dates of the championship, with early-round games occurring last week and the title game Tuesday night following the first two games of the men’s tournament.\n“I think I said to many last year, when I came here the first time to the community, met with many of the leaders, it was a real easy decision when I went back to Dallas that we needed to double down on this community,” Yormark said. “It feels like a Super Bowl each time we’re here. The fan support is tremendous. The community is tremendous.”\nThe men’s and women’s tournaments were scheduled to be played in Kansas City through 2027, so the extension amounts to four years. But it also comes as the league expands its footprint west with Arizona, Arizona State, Colorado and Utah replacing Oklahoma and Texas in the league, and that gave the Big 12 other hosting options such as Las Vegas and Phoenix.\nIn fact, the Big 12 will be holding its football media days in Las Vegas later this year.\n“We are a national conference now. We’re in 10 states, four time zones,” Yormark said. “When it comes to men’s and women’s basketball, and women’s soccer, this needed to be our home. We’re going to football media day in Vegas, which we are excited about, and there will be other opportunities to move closer to that footprint, but we needed to be in Kansas City.”\nAlong with the basketball tournaments, Yormark announced that the Big 12 women’s soccer championship was moving to CPKC Stadium. The first stadium facility built for a women’s professional soccer club in the U.S. — in this case, the Kansas City Current of the National Women’s Soccer League — is scheduled to open Saturday when the Current plays Portland.\n“It’s an amazing time to be in Kansas City, and it’s an amazing time to invest in Kansas City,” said Mayor Quinton Lucas, who has been supportive of an April ballot issue to renew a sales tax that would help fund renovations to Arrowhead Stadium, the home of the Super Bowl champion Chiefs, along with a new downtown ballpark for the Royals.\n“The Big 12 Conference is part of Kansas City’s DNA. We all have stories about the Big 12, or if we’re old enough, the Big Eight here in Kansas City,” Lucas said. “We’re excited to continue to share the story in Kansas City.”\nIn other news, Yormark said the lame-duck status of Oklahoma and Texas, which are departing for the SEC after this season, has not created any challenges even as the Big 12 looks toward the future as a revamped 16-team league.\n“Texas and Oklahoma, great contributors to the conference. Been here since Day 1,” Yormark said. “They’re finishing strong, obviously, and when the time comes, we’ll wish them well. But there’s never been a better time to be part of this conference.”\nYormark also indicated that he would be in favor of expanding the NCAA Tournament.\n“I read what you read, and from what I’ve been told, and what I’m reading, there could be modest expansion. I think 76 is the number that has been out there,” he said. “The data shows if you expand to 76, the power-four conferences will benefit mostly, and that includes the Big 12. I’m all about access. We have the deepest conference in America.”",
  "word_count": 679,
  "scraped_at": "2026-02-14T14:09:51.949872"
}