{
  "article_id": "b54ffaae37db",
  "url": "https://www.thenorthernecho.co.uk/news/25470925.queen-ethelburgas-continues-development-educational-excellence/",
  "title": "Queen Ethelburga continues development of educational excellence",
  "date": "20250923T114500Z",
  "domain": "thenorthernecho.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Brought to you by\nQueen Ethelburga's Collegiate\nQueen Ethelburga’s, a highly popular independent school on the outskirts of York, is excited to share its latest school developments, building on its strong foundations for offering an unrivalled educational experience, alongside excellent academic results.\nHot on the heels of 77 per cent of students achieving A*-A grades and 91 per cent securing A*-B grades for their A Levels this year, dynamic changes present a refreshed offer for current and prospective students – including senior school developments, welcoming new Sports Coaches, and a rebrand and refreshed offering within its onsite nursery.\nQueen Ethelburga’s currently comprises the nursery, prep, middle and two senior schools, along with the innovative QE Training Academy for adults. From September 2025, the process has begun to combine the ISA Independent School of the Year (previously known as QE Faculty) and The Times leading school for academic results in the North (QE College), into one exceptional Year 10 to 13 senior school providing an unprecedented range of academic, vocational, sport, performance, creative and co-curricular opportunities, to be named Queen Ethelburga’s College.\nIn addition to school structure changes, over the summer, as part of its commitment to developing its sport and performance pathways, QE has also appointed three new full-time UEFA A licenced lead football coaches: Matt Derbyshire, former England U21 international and ex-professional striker, brings over two decades of playing and coaching expertise to develop students as both players and people; Sam Sharman, with a background at the FA and in para football, focuses on engagement and partnerships; and Ashley Vickers, formerly at Manchester City Women’s Academy, will lead enrichment and inclusion, building pathways for players of all abilities while promoting technical excellence and personal growth.\nThe new coaches will work alongside Paul Bolland, our existing UEFA A licenced coach. Yousif Mohammed, who has a UEFA B licence and who has worked as part of the QE boarding team for the last twelve months, will also join them.\nAlongside the school changes and additions, the onsite nursery at QE, formerly known as Queen’s Kindergarten has rebranded as Explorer’s Nursery at QE, offering childcare from 3 months, 7.30am to 6pm daily, with inclusive provision and a huge number of additional benefits being part of the wider campus for the schools.\nDan Machin, Principal of Queen Ethelburga’s Collegiate, said: “Over the last 12 months, the new political landscape in the UK has brought many changes to the independent school sector. Whilst there has been plenty of discussion regarding this, in the media and amongst all those involved in the UK education community, at QE we have always seen challenges as an opportunity to develop our own practice to ensure that we are at the forefront of educational innovation and quality.\n\"Our determination to continue as an outstanding independent school that gives our valued community an unrivalled educational experience, has led us to continually review our current offering to ensure that it always meets the needs of our QE community and takes full advantage of the opportunities that change presents us with. We are delighted to welcome our new coaches to the team and be a part of this exciting new chapter for Queen Ethelburga’s.”\nThe scale of opportunity is a driving force for innovation at QE. From an activity programme which incorporates over 150 different activities each week on and off campus; to a programme of trips and visits which circle the globe, to an outstanding offering of super-curricular and student leadership programmes preparing tomorrow’s doctors, engineers, athletes, artists, and business owners.\nFacilities including the 312-seat theatre, a world-class gym and free weights area known as The Extra Mile and opened by Kevin Sinfield in November 2024, indoor and outdoor sports facilities including a triple-court sports hall, running track, and over 30 acres of grass and 3G artificial pitches, the 25-metre swimming pool and associated aquatic equipment, specialist-designed and purpose-built classroom provision in all areas, as well as boarding and leisure facilities of the highest possible standard. During the summer, the new outdoor area for QE’s on-site activity centre ‘Muggles’ has been unveiled, which includes an outdoor climbing wall, jungle gym play area, MUGA (multi-use games area), seating area and skating track – as well as being one of the first independent schools in the country to install its own Padel court.\nQE has, and continues to, drive forward new and exciting extra-curricular opportunities for its students: since 2023 it has been the first ever (and to date, only!) school to participate in the BRSCC Nankang Tyre CityCar Cup Championship, a competition of around 40 professional drivers and engineering teams racing at tracks around the UK including Silverstone and Brands Hatch. QE Motorsports also received the Team Development Award from the Student Motorsport Challenge at the end of its first season for the best measurable growth and development of a team.\nQE’s E Sports teams are amongst the best in the UK, competing against not only other schools but professional teams of adults and achieving results that place some of our students in the top 0.1 per cent worldwide. Both senior and junior Minecraft teams are finalists in the Daigon Esports World Championship in Malta this academic year.\nLauren Blakeley, the new Head of QE College, said: “At Queen Ethelburga’s, we offer our students an education with choice – and one which fits around them as a person and their individual aspirations. This change to our school structure is merely the next step in continuing to provide amazing provision for our senior students in their examination years of their school journey. The foundations made by our previous individual school pathways, have allowed us to build something outstanding and we are excited to see the impact of the new developments.\n\"The school day already offers substantial wrap-around care with activities and wellbeing provision both before and after school, and all weekend – now we will have even more opportunities for our students to get involved in.”\nFor more information about studying at QE and to book on to our open day on 15 November 2025, or to arrange a private tour, please visit www.qe.org.",
  "word_count": 1021,
  "scraped_at": "2026-02-14T12:36:33.040980"
}