{
  "article_id": "b58749523188",
  "url": "https://www.gov.za/speeches/statement-cabinet-meeting-01-november-2023-6-nov-2023-0000",
  "title": "Statement on the Cabinet Meeting of 01 November 2023 | South African Government",
  "date": "20231106T144500Z",
  "domain": "gov.za",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "A. Issues in the environment\n1. 2023 Rugby World Cup Champions\n1.1. Cabinet congratulated the Springboks on their 2023 Rugby World Cup victory that made South Africa the only country to win the Rugby World Cup four (4) times and second to win the title back-to-back.\n1.2. In the history of rugby in South Africa, this Springboks team is the most diverse in terms of the demographics representation of South Africa. The composition of such a diverse team was not an act of coincidence, but a deliberate effort by the management and coaching staff of the Springboks to select an inclusive team. That bold decision by then coach Rassie Erasmus and his team continues to demonstrate to South Africans and the rest of the world, that everyone with skill, if given a chance and support, can become great – an affirmation that we are Stronger Together.\n1.3. Most importantly, the resilience and determination of the Springboks in the field of play is an embodiment of a true essence of being South African, that which makes this great nation rise against all odds and adversities to emerge victorious. Some of the best players of this Springboks team have had to overcome personal adversities on their path to greatness.\n1.4. Cabinet expressed its congratulations to Siyamtanda “Siya” Kolisi, the Springboks double World Cup-winning captain for leading the team to the Greatest of All Time (GOAT) status and the celebrations must go-on.\n2. AGOA Forum\n2.1. Cabinet had welcomed the confirmation by both the United States administration and congress on the intention to extend AGOA, which brings certainty to the investment community in the AGOA-eligible countries.\n2.2. Cabinet had also welcomed the hosting of the 2023 AGOA Forum in Johannesburg from the 2nd – 4th November 2023 with participants from 32 Africa countries from government, Business, civil society and organised labour for the first time and representatives of the United States government.\n2.3. Cabinet has always asserted that AGOA provides an opportunity for the United States of America to strengthen its economic relationship with Africa and thus it must be extended for a meaningful period, enhanced to make it impactful and attractive.\n3. BRICS Tourism Ministers’ Meeting\n3.1. Cabinet welcomed the successful conclusion of the 2023 BRICS Tourism Ministers’ Meeting held in Cape Town, which committed member nations to deeper cooperation and to promote intra-BRICS tourism, develop routes for better tourism mobility and connectivity among the member countries.\n3.2. This will further strengthen South Africa’s tourism sector which is already showing signs of recovery. For the first 8 months of 2023, the country saw 5.5 million arrivals which represented a 63.4% increase from the same period in 2022.\n4. Voter Registration\n4.1. The IEC has announced the 18th and 19th of November 2023 as a first voter registration weekend for the 2024 General Elections.\n4.2. Cabinet is calling on all eligible voters to register to vote for the 2024 General Elections at your nearest voting stations.\n4.3. Online voter registration has been opened since February 2023 and citizens are urged to use the facility to register or update their details.\n4.4. South Africans who have applied for their IDs are encouraged to visit their local Home Affairs office to collect them. There are more than 500 000 smart ID cards still to be collected atHome Affairs offices across the country.\n5. Electricity\n5.1. The Minister in the Presidency responsible for Electricity has provided a comprehensive briefing on electricity situation in the country.\n5.2. Cabinet applauded efforts by the Gauteng Provincial Government working with Eskom to restore electricity to areas in Gauteng that have been hit by black-outs due to the theft or damage to transformers.\n5.3. Last night, six new electrical transformers were switched in Kagiso, in the West Rand area after communities were left without power for more than 3 years.\n5.4. Cabinet calls on these communities to protect the critical infrastructure from theft, vandalism and damage that is caused by illegal connections.\n6. Food Poisoning\n6.1. Cabinet is concerned by the spate of food poisoning of children from eating expired and contaminated foodstuff from spaza shops and street vendors.\n6.2. Cabinet is encouraged by the law enforcement efforts to enforce food safety compliance.\n7. International Migration Workshop with Mayors and Traditional leaders\n7.1. Cabinet was briefed about the international migration workshop hosted by the Department of Home Affairs with the participation of the DSBD, COGTA, Human Settlements and traditional leaders and mayors from metro and district municipalities that focused on curbing effects of illegal immigration, including the operations of spaza shops.\n7.2. Key outcomes include the introduction of omnibus by-laws to address challenges relating to the enforcement of business by-laws by municipalities and traditional authorities. There will be immediate joint inspections of businesses, in particular spaza shops by the departments of labour, health, small business development and the Home Affairs immigration inspectorate teams, to enforce compliance with applicable laws\n7.3. An audit of spaza shops in villages and townships, and mechanisms to register them by both traditional leaders and municipalities will be undertaken. There are also efforts to support traditional authorities to keep a record of foreign nationals in their communities.\n7.4. Business licencing legislation is being amended to support all those who wish to trade in the informal sector.\n8. Integrated Crime Fighting\n8.1. Cabinet commends the SAPS for dealing a massive blow to international drug syndicates following the discovery of cocaine valued at R80 million which were seized on 20 October 2023 at a warehouse at the Dube Trade Port within the King Shaka International Airport. Two days prior the seizure, another R70 million worth of cocaine was also seized from a container at the Durban Harbour.\n8.2. Cabinet applauds the SAPS for their work in disrupting and dismantling transnational organised crime that poses a significant threat to our communities and the nation.\n8.3. Operation Safer Festive Season is already yielding results with police arresting over 140 suspects, including an alleged illegal mining kingpin, and seizing unlicensed firearms.\n9. Presidential Oversight Visit\n9.1. Cabinet welcomed the Presidential Oversight Visit to the Emfuleni Municipality, which followed-up on engagements with the community during the District Development Model visit of 2022.\n9.2. The 2022 visit to Emfuleni identified issues of poor infrastructure maintenance by the municipality\n9.3. Through the intervention of the Department of Water and Sanitation, there has been notable progress in addressing water and sanitation infrastructure challenges that had resulted in the collapse of the Vaal Waste Water system.\n9.4. Work has been undertaken to improve water supply, the proper functioning of the waste water infrastructure and thus eliminating the problem of the sewer effluent that run running on the streets and people’s yards.\n9.5. Noted progress during the visit include improvements in critical bulk pipelines and water pump stations, resurfacing and resealing of roads, and a massive rollout of streetlights to improve lighting and safety.\n10. Roadmap for the Freight Logistics System in South Africa\n10.1. The Department of Transport has commenced consultations on the Roadmap for the Freight Logistics System in South Africa, as part of measures to address the challenges facing the freight and logistics sector and the strengthening of South Africa’s economic recovery efforts.\n11. Infrastructure Development and Maintenance\n11.1. Cabinet welcomed the progress being made with infrastructure development and maintenance with the completion of 36 rural bridges under the Welisizwe Rural Bridges, and the construction underway on 20 projects in human settlements, roads, and water.\n12. Relaunch of South African Airways (SAA) international routes\n12.1. Cabinet welcomed the relaunch of SAA international routes with the re-introduction of its intercontinental flight to São Paulo, Brazil, which also marked the return of the long-haul service out of Cape Town and Johannesburg.\n12.2. The return of SAA in the international routes will contribute directly in driving growth in international travel to the country, and growth of the tourism sector after the ravages of the Covid-19 pandemic.\n13. South Africa launches the largest drone in Africa\n13.1. Cabinet congratulated the Defence and aerospace company Milkor on their successful launch of the Milkor 380 unmanned aerial vehicle (UAV), which places South Africa among the countries that continue to make strides in drone technology.\n13.2. The Milkor 380 is the largest drone built in Africa and it will be used by the defence industry for combat, border control, conservation efforts including to combat poaching.\n14. Matric and Year-end schools examinations\n14.1. Cabinet welcomed the smooth start to the 2023 National Senior Certificate (matric) exams, which commenced on 30 October 2023. Parents and guardians are encouraged to continue to support learners during this critical period.\n14.2. Cabinet also sends its well wishes to all the learners who will be sitting for their year-end exams.\nB. Cabinet decisions\n1. The Situation in Palestine\n1.1. Cabinet is disappointed by the refusal of the Israeli government to respect international law and its continued undermining of the United Nations resolutions for the implementation of a ceasefire with impunity.\n1.2. The humanitarian corridors for the people of Palestine remain closed with dire consequences for children, women and innocent civilians.\n1.3. The genocidal airstrikes by the government of Israel on the people of Palestine, continue with rising death toll that include women and children. In the last two days, the world have sat helplessly and watched as intensifying airstrikes on Gaza and the West Bank have destroyed schools, health facilities, ambulances and civilian infrastructure and supposedly safe roads travelling to the South of Gaza.\n1.4. For these, the Cabinet has decided to recall all South African diplomats from Tel Aviv for consultation.\n1.5. Cabinet has also noted with disquiet the continuing disparaging remarks of the Israeli’s ambassador to South Africa, Mr. Eliav Belotsercovsky, against South Africans, the leadership of South Africa both in and outside government including civil society who are speaking against the holocaust being committed by the Israeli government against the Palestinians.\n1.6. The disparaging remarks of Ambassador Belotsercovsky are contrasted by the statements of two former Israeli ambassadors to South Africa (Illan Baruch and Dr. Alon Liel) who have been consistent in describing the actions of their government against Palestinians as Apartheid.\n1.7. The disparaging remarks against those speaking up against the atrocities and the country’s leaders make ambassador Belotsercovsky position more and more untenable. As such Cabinet has directed the Department of International Relations and Cooperation to convey the South African government displeasure with the ambassador formally through diplomatic channels.\n2. Medium Term Budget Policy Statement\n2.1. Cabinet welcomed the 2023 Medium Term Budget Policy Statement (MTBPS), which provided a frank assessment of the current economic climate and demonstrated government’s firm hold on our nation’s finances amid tough revenue constraints.\n2.2. The decisions in the MTBPS improve our fiscal framework; stimulate economic growth while balancing our social commitments that support the vulnerable in our nation.\n2.3. The Economic Reconstruction and Recovery Plan has contributed to many green shoots in our economy.\n3. High Speed Rail Development\n3.1. Cabinet approved the High Speed Rail Development Framework and the financial implications for implementation will be discussed between the Ministers of Transport and Finance\n3.2. Cabinet approved the prioritisation of the Johannesburg to Durban corridor for a detailed feasibility study, and the Johannesburg-Polokwane to Musina, and the Johannesburg to Mbombela will be put to the market.\n4. Draft White Paper on Citizenship, Immigration and Refugee Protection\n4.1. Cabinet approved the publication of the White Paper on Citizenship, Immigration and Refugee Protection for public comments.\n4.2. The draft Policy aims to provide a framework to guide the granting of residency and citizenship to foreign nationals, as well as the protection of refugees and asylum seekers in South Africa, cognisant of the Republic’s national security interests and in compliance with international agreements and protocols on migration that South Africa is party to.\n5. The 6th Annual Progress Report on the implementation of the White Paper on the Rights of People with Disabilities\n5.1. Cabinet has approved for publication in the government gazette the 6th Annual Progress Report on the implementation of the White Paper on the Rights of People with Disabilities.\n5.2. The publication of the progress report will coincide with the international commemoration of the Disability Rights Awareness Month from 3 November to 3 December.\n5.3. The progress report also signals an increase of the minimum employment equity target from 2% to 3% for persons with disabilities as from the 2024/2025 financial year, towards a minimum 7% employment equity target for persons with disabilities by 2030.\nC. Bills\n1. Draft African Renaissance and International Cooperation Fund (ARF) Bill\n1.1 Cabinet approved the submission of the ARF Amendment Bill to Parliament.\n1.2 The Bill seeks to amend the ARF Act (Act 51 of 2000) and establish the South African Development Partnership Agency that will serve as a mechanism to support South Africa’s development and cooperation with sister countries through the promotion of democracy, good governance, the prevention and resolution of conflict, socio-economic development and integration.\nD. Appointments\nAll appointments are subject to the verification of qualifications and relevant clearance.\n1. Appointment of Mr Ebrahim Rasool as Chairperson of the Development Bank of Southern Africa.\n2. Appointment of Ms Margaret Mosibudi Phiri as a member to the National Nuclear Regulator Board\nE. Upcoming Events\n1. Anti-Corruption Dialogue\n1.1 The Anti-Corruption Dialogue will be held on 8 and 9 November 2023 at Birchwood Hotel in Ekurhuleni to mobilise society in the fight against corruption in line with the country’s National Anti-Corruption Strategy\n1.2 Cabinet, in November 2020, approved the National Anti-Corruption Strategy (NACS 2020-2030). This is a country strategy that is aimed at creating a corruption-free society while also encouraging citizens to have zero-tolerance for corruption and abide by the rule of law.\n2. 16 Days of Activism Campaign for No Violence Against Women and Children 2023\n2.1 This year marks the 25th anniversary of South Africa’s participation in the 16 Days of Activism for No Violence against Women and Children Campaign which will be observed under the theme: “Accelerating actions to end Gender-Based Violence and Femicide (GBVF): Leaving no one behind”.\n2.2 This global campaign runs from 25 November, the International Day for the Elimination of Violence against Women to 10 December, International Human Rights Day. It aims to combat violence against women whilst upholding human rights.\n3 14th Policy Dialogue Forum\n3.1 South Africa will co-host the 14th Policy Dialogue Forum in collaboration with the UNESCO International Teacher Task Force for Education (TTF) in January 2024 under the theme “Addressing teacher shortages and making the profession more attractive”.\n3.2 The forum will bring together government officials, NGOs, teachers and education experts to discuss critical issues pertaining to the conditions of service for teachers, issues of teacher autonomy and accountability as well as how to make teaching an attractive profession.\nF. Messages\n1. Congratulations\nCabinet extended its congratulations and well wishes to:\n- The Proteas for securing a place in the semi-finals of the the ICC World Cup 2023 in India. Despite the setback in their match against India yesterday, the country remains firmly behind the team and is confident they will continue to build and make us proud.\n- Moto GP racing star Brad Binder who is now the outright premier class podium record holder for South Africa after his top three finish at the Thailand Grand Prix.\n- South Africa’s first pro-wheelchair bodybuilder Macethandile Kulati for defending his title at the 2023 International Federation of Body Builders and Fitness World Championship in Slovenia.\n- South African Chartered Accountants for earning the top position in the Edelman global professional trust survey.\n- Dr Claude Mashego for winning the inaugural Miss World South Africa and she will now represent South Africa at the Miss World in New Delhi, India in December this year.\n- Advocate Kholeka Gcaleka following her appointment as the new Public Protector for a term of seven years with effect from 1 November 2023.\n2. Condolences\nCabinet expressed condolences to the family and friends of:\n- Paralympic gold medallist Zanele Situ who was the first black South African female athlete to win a gold medal at the Paralympic Games in Sydney in 2000.\n- Former Bafana-Bafana assistant coach and football legend Phil “Mr Jones” Setshedi.\n- Warrant Officer Sthembiso Mazibuko of the National Intervention Unit who was killed during a shootout with criminals in Ntuzuma, KwaZulu-Natal.\nEnquiries:\nMs Nomonde Mnukwa\nActing Government Spokesperson\nCell: 083 653 7485",
  "word_count": 2730,
  "scraped_at": "2026-02-14T12:06:13.737702"
}