{
  "article_id": "b591f01db373",
  "url": "https://www.bbc.co.uk/bitesize/articles/z6vyxg8",
  "title": "Seven stories that made us feel good in 2025",
  "date": "20251228T213000Z",
  "domain": "bbc.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "As we say goodbye to 2025, many of you might have had ups and downs, so BBC Bitesize would like to remind you of seven stories that may have made you smile in ’25.\nTales that helped us wonder in awe at human achievement, resilience and even glow a bit inside. Enjoy.\n1. All 16 and 17 year-olds will be able to vote in the next general election\nThis change will unify the minimum voting age to 16 across the UK for the general election, for Welsh and Northern Irish Assemblies, Scottish Parliament and local councils. Around 1.5 million teenagers will be eligible to vote in the next general election, which must be held by 2029 but could be held earlier.\nThe government said the change will give young people a chance to have a say in how the UK is run. \"At 16, a young person can work, they pay taxes, they can join the Army. So there's no reason why from that age, they shouldn't have a say in who governs our country,\" said Democracy Minister Rushanara Ali.\nThe last time the voting age was lowered to 18 was in 1969, before that you had to be 21 years old to vote. Women only won the same voting rights as men in 1928.\n2. Archaeologists in Peru announced the discovery of an ancient city\nNamed Penico, the city was thought to be around 3,500 years old and could have been an important trading hub that linked people living on the coast with settlements in the Andes mountains or in the jungles of the Amazon basin.\nIt was discovered 200km north of Lima, about 600 metres (1,970 feet) above sea level and it’s believed the city was founded between 1800 and 1500 BC. Around the same time that Middle Eastern and Asian early civilisations were flourishing.\nResearchers hope the discovery will help them learn what became of the Americas' oldest known civilisation, the Caral. As well as unearthing structures that were once homes and temples at the site, they discovered clay sculptures of humans and animals plus necklaces made from beads and seashells.\nThis ancient city, Peñico was found close to where Caral was established 5,000 years ago at around 3000 BC in the Supe valley of Peru.\n3. Lionesses and Red Roses, what a year for women’s sport\n2025 has been a smashing year for sport in general, but two victories have been inspirational for women’s sport in particular: England Football at the Euros and England Rugby at the World Cup.\nIn July, coach Sarina Wiegman and captain Leah Williamson led their team to footballing victory over Spain, 3-1 on penalties. 12.2 million people watched the UEFA Women’s Euro final live on BBC TV to see a first major trophy won on foreign soil and the first time an English senior team retained a title.\nAs Summer ’25 drew to a close, you may also have watched the Red Roses, led by captain Zoe Aldcroft, beat Canada 33-13 to win the Women's Rugby World Cup.\nThe tournament broke all records: the final at Twickenham was the most-watched women's rugby match ever on UK TV, with a peak audience of 5.8 million viewers. The game was played in front of 81,885 fans - a record for a women's rugby match.\nAfter the match, Red Rose Abbie Ward told the BBC; \"We always said we wanted to win a home World Cup, but the other part was what we can create and how we can inspire people… We wear the T-shirts that say 'For the Girls' and it really is.\"\n4. Renewable energy overtook coal as the world’s biggest source of electricity\nIn the first half of 2025, data from global energy think tank refers mainly to organisations that conduct research with a view to causing political policies to change Ember, showed that this was led by renewable energy production mainly in developing countries like China and India.\nUnfortunately, their research does show that richer countries such as the US and in the EU are relying more than before on fossil fuels to make their electricity. Coal remained the largest single source for energy production in 2024, according to the International Energy Agency.\nBut Ember’s report also showed that even despite growing demand for electricity worldwide, growth in solar and wind energy was so strong, it not only met the need for extra electricity, it helped reduce use of gas and coal.\n5. A 10 year-old girl has become the youngest ever to earn the Woman International Master title in chess\nBodhana Sivanandan, from north-west London, will hold this title for life. Its only one level below that of Woman Grandmaster, both granted by the International Chess Federation. She also managed to beat a chess Grandmaster at the 2025 British Chess Championship in August, becoming the youngest female player to do so.\nThe International Chess Federation said: \"Sivanandan's victory at 10 years, five months and three days beats the 2019 record held by American Carissa Yip (10 years, 11 months and 20 days).\"\nBodhana first took up chess during the Covid-19 pandemic and said chess makes her feel \"good\" and helps her with \"lots of other things like maths, how to calculate\". But her dad Siva is stumped as to where her talent has come from, he told the BBC neither he or his wife, both engineering graduates, are any good at chess.\n6. 2025 was quite a year for Taylor Swift, pop superstar\nYou might have thought 2024 was the best year ever for Taylor as she delivered her record breaking Eras world tour, making $2 billion (£1.48 billion) in ticket sales alone.\nBut then along came 2025 and topped it all.\nIn May, Taylor bought back the rights to her first six albums. This marked the end of a bitter dispute that began in 2019 when music manager Scooter Braun bought Taylor’s first record label and with it the master recordings of all her earlier songs.\nA master recording is the original recorded performance of a song, whoever owns it controls all the rights to exploit the music. Taylor, as the writer or co-writer of her music, always maintained her publishing rights, which meant she was able to stop attempts to license songs to other companies. But in 2025, Taylor reclaimed complete ownership of her music.\nIn August, Taylor announced her engagement to partner Travis Kelce in a post on Instagram. She wrote: \"Your English teacher and your gym teacher are getting married.\" The post had more than 18 million likes within four hours, over 37.6 million by the end of the year.\nAnd in October, Taylor released her 12th studio album The Life of a Showgirl. As BBC Music correspondent Mark Savage said; “In 2025, with the world at her feet, Swift can finally say with certainty that her place in pop history is guaranteed. The Life of a Showgirl is her well-earned victory lap.”\n7. Luke Littler, at 17 years-old became the youngest ever PDC World Championship winner\nLuke ‘The Nuke’ Littler has had a tremendous darts-playing year. He began it by beating Dutchman Michael van Gerwen 7-3 to win the World Darts Championship on the Alexandra Palace stage. Just three weeks before his 18th birthday, Luke won the £500,000 prize to take home to Warrington.\nDarts has taken him all over the world since then, as Luke has played in tournaments from Belgium to Australia, Germany to Leicester, winning five major titles this year.\nAnd as 2026 starts, Luke will be back hoping to defend his crown to win back-to-back World Championships and become just the fourth player in history to achieve it. His walk on music is Greenlight by Pitbull and he’s ranked Number One in the world by the PDC (Professional Darts Corporation).\nCommentators credit the Littler effect for boosting the popularity of the game, and possibly reflecting the growing audience numbers, the World Championship 2026 will hand out a £1million prize fund to the winner. The largest ever for a darts tournament. So will Luke Littler achieve another record breaking win?\nStayed tuned for 2026.\nThis article was published in December 2025\nThings to look forward to in 2026\nBBC Bitesize explores some of the sporting events, films, concerts and more heading our way in 2026\nFilms that make us feel festive - but aren't about Christmas\nBBC Bitesize explores the must-see Christmas tradition movies that have nothing at all to do with the festive season\nSeven traditional Christmas foods from around the world\nWhich country eats fried chicken at Christmas? Who hides a prize in their Christmas Eve dessert? We explore tasty festive food facts from around the world",
  "word_count": 1448,
  "scraped_at": "2026-02-14T13:07:16.900837"
}