{
  "article_id": "b596821e6afa",
  "url": "https://www.buccaneers.com/news/antoine-winfield-jr-named-bucs-nominee-wpmoy-2023",
  "title": "Antoine Winfield Jr . Named Buc Nominee for Walter Payton Man of the Year Award",
  "date": "20231205T171500Z",
  "domain": "buccaneers.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "The Buccaneers announced safety Antoine Winfield Jr. as its nominee for the Walter Payton NFL Man of the Year Award Presented by Nationwide. The Walter Payton NFL Man of the Year Award presented by Nationwide is the league's most prestigious honor and acknowledges NFL players who excel on the field and demonstrate a passion for cultivating a positive impact beyond the game in their communities.\nAs a cornerstone defender and tone-setter for the Buccaneers, Winfield Jr. has distinguished himself off the gridiron through a genuine desire to make a lasting impact throughout his community. The Pro Bowl safety has found avenues, both big and small, to affect individuals and foster positive change by utilizing his platform and representing the best of the Buccaneers and the National Football League.\nUpon entering the league in 2020, Winfield Jr. has been intentional on elevating his community efforts year after year, particularly with local foster children. Through his work with two local nonprofits, Heart Gallery of Tampa and A Kid's Place of Tampa Bay, Winfield Jr. has made it his mission that kids in the foster care system are able to have the same experiences as other children their age, planning and funding several outings across Tampa Bay to provide memorable experiences.\nA few examples of such outings include organizing a Halloween celebration with A Kid’s Place, taking 55 children housed at the facility trick-or-treating throughout a neighboring residential area and gifting each with gift cards for food. Along with his fiancé Teesa, the pair have previously taken a group of young women to buy makeup, arranged a spa day and orchestrated an outing at a local trampoline activity park.\nThroughout his tenure, Winfield Jr. has supported numerous Buccaneers team programs in the community, including the team's Youth Leadership Program. Launched in 2020, his player-led program is a comprehensive effort to engage with the local community through unique player and staff mentorships, leadership development, and community outreach opportunities. This past year, Winfield Jr. joined the team's Social Justice Board, part of a group that spearheaded the Youth Leadership Program to double its numbers while engaging in a service project with Habitat for Humanity Hillsborough to fund the cost of two Habitat homes in the Temple Terrace community.\nOn the field, Winfield Jr. has established himself as a catalyst of the Buccaneers defense. Since being selected in the second round of the 2020 NFL Draft (45th overall), he has started all 60 games, including playoffs, of his career. As a rookie he helped lead the Buccaneers to their second Super Bowl title in franchise history, recording an interception off Kansas City's Patrick Mahomes in that matchup to become the seventh rookie or first-year player in NFL history to record an interception in the Super Bowl. This season, he has already set a new career mark in forced fumbles and passes defended, while matching his previous single-season high in fumble recoveries and interceptions.\n\"It means everything to me to be nominated for Walter Payton Man of the Year,\" said Antoine Winfield Jr. \"Every year, the organization has the opportunity to nominate an individual and this was a goal that I set for myself. It's great to not only be nominated, but to have the platform of this great award to now shed light on some of the most pressing issues in our community.\"\nAs a nominee, Winfield will don a Walter Payton NFL Man of the Year helmet decal through the end of the season in recognition of his accomplishments on and off the field.\nAll 32 nominees will be recognized for their achievements during the week leading up to Super Bowl LVIII. The 2023 Walter Payton NFL Man of the Year winner will be announced during NFL Honors, a primetime awards special to air nationally on CBS on Thursday, Feb. 8.\nEach nominee will receive up to a $55,000 donation, and the award winner will receive a $250,000 donation to the charity of his choice. All donations are made possible by the NFL Foundation and Nationwide.\nThis year, fans are once again encouraged to participate in Nationwide's annual Charity Challenge, a social media and online contest that allows fans to show support for their favorite Walter Payton NFL Man of the Year nominee. Fans can vote on X (formerly Twitter) by posting #WPMOYChallenge along with the last name/X handle of their chosen nominee or by voting directly on NFL.com/ManOfTheYear. In cases where multiple nominees share the same last name (i.e. Justin Jones and Jonathan Jones), all valid votes on X must include the #WPMOYChallenge hashtag and the nominee's handle or full name.\nThe nominee who receives the most collective hashtag mentions and votes will win an additional $35,000 donation from Nationwide to the charity of their choice, with the runner-up receiving $10,000 and the third-place winner receiving $5,000. Charity Challenge voting takes place from Dec. 5 to Jan. 8.\nFor more information on the nominees and the award, please visit NFL.com/ManOfTheYear.",
  "word_count": 826,
  "scraped_at": "2026-02-14T12:40:32.129359"
}