{
  "article_id": "b59abae43b8f",
  "url": "https://www.leicestermercury.co.uk/news/celebs-tv/itv-emmerdale-carly-hope-star-10027539",
  "title": "ITV Emmerdale Carly Hope star Gemma Atkinson issues update on soap future",
  "date": "20250315T221500Z",
  "domain": "leicestermercury.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "ITV Emmerdale Carly Hope star Gemma Atkinson issues update on soap future\nGemma Atkinson has spoken about life after Emmerdale and whether or not she would return to the world of soap operas\nActress Gemma Atkinson has updated fans on her future when it comes to soap operas. The star initially rose to fame as Lisa Hunter on Channel 4's Hollyoaks from 2001 to 2005, with a short comeback three years ago.\nFollowing roles in shows like The Bill and Waterloo Road, Gemma, now 40, moved from the North West to West Yorkshire to play Carly Hope in ITV's Emmerdale.\nEight years after leaving Emmerdale, Gemma has candidly shared with the Mirror her reasons for not planning a soap return in the immediate future. \"I would love to go back to acting again, 100%, I would love to do a one off drama where there was a start date and an end date, so I could plan childcare around it,\" she explained.\nGemma, who is supporting Soccer Aid for UNICEF this year, further elaborated: \"My partner Gorka [Marquez], he starts Strictly Come Dancing from July, so from July to Christmas, he's kind of wherever his partner is based, if he has a partner. So it's kind of all up in the air. So to go back to a soap wouldn't really be realistic because the hours are so few and far between, you're either in 12 hours a day or you're in two hours a day, your schedule can change at the drop of a hat,\" reports the Mirror.\nThe actress expressed her fondness for her time on various soaps, attributing her career success to those experiences. However, she noted that her current family commitments with her children would make it difficult to maintain such a demanding role.\n\"I loved my time on all the soaps, its where I am now because of them but I think, now that I've got the children, I just wouldn't be able to commit unfortunately. But I do still watch it [Emmerdale] and I don't want Marlon to be killed off, I want Mark (Charnock) to stay in.\"\nThis year, Gemma is rooting for England in Soccer Aid – featuring stars like Louis Tomlinson, Jill Scott, Tom Grennan, Steph Houghton, Toni Duggan, and Sam Thompson – while her fiancé, Gorka Marquez, will play for the World XI team.\nGemma shared a light-hearted comment about the competitive spirit between her and Gorka: \"There will definitely be a rivalry between me and Gorka,\" she chuckled, then continued: \"He's still rubbing it in about the Spanish game in the Summer. So yeah, he will still be rubbing it in but I'm going to put the kids in England shirts, he's outnumbered.\"\nAs a mother to six-year-old Mia and one year old Thiago, Gemma couldn't be happier about the growing recognition of women's football and the Lionesses. During an event at Manchester's Hotel Football, she commented: \"I think it's great that women's football is finally coming centre stage. My daughter plays football at school.\n\"We never played football, it just wasn't a thing when I was at school, we played rugby but it was tag rugby – we weren't allowed to wrestle, we had to have a little tag on that you pulled off, that in itself is just 'Why? Why can't we do it properly?'\"\nGemma, host of The Overshare podcast, expressed her excitement about Soccer Aid, set to take place at Old Trafford this June. \"It's on my doorstep, Manchester, there's a positivity in the air,\" she said.\nWhen asked why she decided to get involved, Gemma explained: \"As a mum myself, you realise the impact it can have. The thought of my kids needing any help or support from charities is heartbreaking. You just want to provide everything for them. The fact that we've raised over £100 million for children worldwide is just incredible.\"\nEmmerdale is on ITV1 and ITVX. The Soccer Aid match takes place on Sunday, June 15 at Old Trafford, Manchester. Tickets are available now on the Soccer Aid for UNICEF website.",
  "word_count": 680,
  "scraped_at": "2026-02-14T13:05:49.933035"
}