{
  "article_id": "b5dde7c3f14b",
  "url": "https://www.twtd.co.uk/ipswich-town-news/46464/town-confirm-tractor-girls-general-manager-appointment",
  "title": "Town Confirm Tractor Girl General Manager Appointment - Ipswich Town News",
  "date": "20240119T211500Z",
  "domain": "twtd.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Friday, 19th Jan 2024 16:44\nThe Blues have announced the appointment of Rachel Harris as general manager of Ipswich Town Women.\nCEO Mark Ashton revealed that the club had recruited someone for the newly-created role at last month’s PLC AGM.\nTown say Harris, who was with Women’s Championship side London City Lionesses between February and December last year working as their as commercial and marketing manager, “will oversee off-pitch activity, working to grow the women and girls' infrastructure to help drive progress on the pitch”.\n“I’m excited to have joined Ipswich Town and have enjoyed meeting people from across the club, including CEO Mark Ashton, during my early time here,” Harris told the club site.\n“The women’s team at the club already has good foundations in place thanks to the hard work of Joe Sheehan, the staff and the players, and my role is to continue building on the good progress, enabling our future visions to become reality.\n“We have a determined and close-knit group of players and staff who work incredibly hard as individuals but also for each other, so I’m excited to have the opportunity to be able to support them to develop and grow off the pitch.”\nExplaining the appointment at the AGM, Ashton said: “We will be announcing over the next few weeks the appointment of a general manager to the women’s team to take some of the load off [Tractor Girls manager] Joe Sheehan, who has done a wonderful job.\n“We’re developing the training ground. Within that will be facilities made available for the women’s team.\n“We’re looking at where we have our show pitch and hence where in the long, long term we host the women’s games to give them better facilities. But they’re an integral part of our football club.\n“If you speak to Joe, if you speak to the players, if you speak to [striker] Natasha [Thomas], who sits as trustee on our community foundation board, we treat them in an equal manner.\n“The development of the women’s game, for me, is key. If we show a nine-year-old boy a dream and a pathway to play to our first team, we have to show the nine-year-old girl the same pathway to play for Ipswich Town’s Women’s team. And that’s something we’re very, very passionate about.”\nDirector of football operations Gary Probert added: “Rachel’s appointment is an important one for the club, showing our commitment to continually developing the women’s team and building on the progress made over the last few years.\n“She will work closely with Joe, our support staff, and the players, building the women and girls’ infrastructure off the pitch and giving us the best platform possible to be successful on it.\n“Rachel brings a wealth of experience to the role and we are excited to have her with us as the women’s team takes another important step forward.”\nThe Tractor Girls are in action away against the London Bees on Sunday (KO 1.30pm), with the match having moved from the main stadium at Barnet’s Hive to the adjacent artificial pitch.\nPhoto: ITFC\nPlease report offensive, libellous or inappropriate posts by using the links provided.\n- Page:\n- 1\n- Page:\n- 1\nYou need to login in order to post your comments",
  "word_count": 543,
  "scraped_at": "2026-02-14T12:07:49.076101"
}