{
  "article_id": "b5e82dd89d9d",
  "url": "https://www.nytimes.com/athletic/6892060/2025/12/16/nfl-18-game-expansion-injuries-mahomes-parsons/",
  "title": "As NFL stars deal with season - ending injuries , let end the 18 - game season talk",
  "date": "20251216T143000Z",
  "domain": "nytimes.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "As Patrick Mahomes and Micah Parsons hobbled to their respective locker rooms Sunday evening, moments after each tumbled to the turf and writhed in pain while trainers and team doctors rushed to their aid, a sickening feeling settled over all who watched.\nTwo of pro football’s brightest stars, we soon learned, each tore an ACL in an otherwise spectacular day of late-season football. Now, Mahomes and Parsons face surgeries, long recovery roads and uncertainty over when/if they will regain their elite forms. The three-time Super Bowl MVP quarterback and the 2021 NFL Defensive Rookie of the Year joined hundreds of their football brethren who have landed on injured reserve this season. (According to NFLPA figures, 309 players have been placed on IR through 15 weeks of regular-season action, which is slightly down from 319 through 15 weeks in 2024, but up compared to 274 through this point in 2023.)\nAdvertisement\nThe Green Bay Packers’ Super Bowl dreams took a major hit. Also in jeopardy: the Kansas City Chiefs’ chances of quickly rebounding next season from a disappointing 2025.\nThe football gods are cruel. Or, are they trying to tell us something?\nJust last week, the NFL announced a $32 million investment to launch professional women’s and men’s professional flag football leagues in conjunction with the anticipated wave of excitement stemming from the sport’s debut in the 2028 Olympic Games. Also, last week, the NFL announced that it will host games in Munich, Germany, next season and in 2028. The push to globalize America’s most popular sports league remains in full force. NFL officials and team owners envision a day when games rival the Premier League in popularity.\nThe driving force behind that goal: continue driving the annual revenue of this cash cow to $25 billion and beyond.\nAnother leg of those revenue-generating plans involves the eventual expansion from 17 regular-season games to 18. Few fans would argue against such a move. The appetite for football is voracious. However, the sight of Mahomes and Parsons sidelined by injury offered a painful reminder that the altar always demands a sacrifice, and eventually, even the game’s brightest and best fall prey.\nThe adage, “Injuries are part of the game,” is true. Yet, with each torn knee ligament (entering Week 15, 59 players were on IR with such injuries) and popped Achilles tendon (11 seasons have ended in such fashion), it grows harder to grasp the prudence of further expansion of the regular-season schedule.\nMore football is great, but at what cost? Will the unquenchable thirst for more — more money, more games — eventually take its toll and lead to the shortening of careers and the deterioration of the game?\nThe NFL has invested in many technological advances to ensure that players use the top-of-the-line equipment. The league hopes that rigorous testing will soon ensure games take place on only the highest quality of playing surfaces (whether natural or synthetic). Officials implement rule changes every couple of years and declare the game safer than ever. Injuries remain inevitable, however, even in this modern age where athletes are bigger, faster and stronger than ever.\nChanges to the offseason program, training camp, preseason workload and regular-season preparation process may have alleviated some of the pounding those bodies sustain leading up to game days. However, year-round training, which seems like necessary preventative maintenance, replaces some of the wear and tear. And don’t forget that ever-expanding college football seasons mean some athletes come into the NFL with more mileage on them than ever. So, is it any wonder that even the most diligent and dedicated players struggle to make it through a season unscathed?\nAdvertisement\nIt’s still too early to know what kind of long-term impact 17 regular-season games, an expanded postseason and shortened offseason is having on athlete bodies (feels like we know, but the answers aren’t concrete); however, the last thing that any pro football player needs is another 50-plus plays worth of collisions before postseason action even begins.\nAnd yet, NFL owners want more.\nThe NFL has long operated with a “next man up” attitude. If a man goes down, scrape him up, plug another in and the show goes on. It’s what happened when Mahomes, Parsons, Malik Nabers, Nick Bosa, Fred Warner, Tyreek Hill, Michael Penix Jr., Daniel Jones, Najee Harris and others went down with season-ending injuries at various points this season. Indeed, the show will go on. Yet how appealing is a league whose stars only last a portion of the season and second-rate/mistake-prone backups fill their roles?\nIt’s impossible to predict when the injury bug will strike. Any of those players had the same chance of getting hurt in Week 1 as they did in Week 15. However, players feel it is unwise to heighten the risk of injury by expanding their workload with a longer regular-season schedule. Sure, you can trim the preseason further, but most veterans don’t play in those contests anymore anyway. You can implement a second bye week, but the pounding will still pile up.\nFortunately for the players, true negotiations towards such an expansion have yet to take place. The controversy-laden resignations of NFLPA executive director Lloyd Howell and chief strategy officer J.C. Tretter have caused a leadership void, and the ongoing search for replacements has bought them some time. Yet, expansion talks are coming — likely this offseason after the players union elects its next full-time executive director — well before the expiration of the current CBA, which runs through 2030.\nIf NFL team owners are smart, care about the quality of the game and the investments that make the league go (the players), they would abandon thoughts of an 18th game. Yet, we all know where their priorities lie. That’s why the players — once they finally get their leadership structure figured out — should resist at all costs.\nAdvertisement\nYou’re talking about a war, but the best move from the player camp would involve coming to that future negotiation table with the stance of “We want to go back to 16 games, and we want the same economic structure that we have now.” Owners would have a coronary. Even so, with players now coming out of college with the security of NIL money and the added asset of their multi-billion dollar company, OneTeam Partners, players would be better equipped for a lockout.\nThat will never happen, though. It was hard enough for NFLPA leaders to get the player body on the same page for the last two CBA negotiations. Such a bold move — although effective — would scare too many players.\nAnd so, owners will again have the upper hand. They already hate the revenue split they agreed to in the last CBA and how much they’re spending in terms of salary cap and player benefits. So it’s expected that the owners would attempt to keep the current economic structure in place as long as they get an 18th game and recoup some of that. Players — desperate to hold onto what they have — will relent, unwittingly giving the NFL an 18th game basically for free.\nExcept it doesn’t have to be that way. The NFL doesn’t need an 18th game to grow the pie. Operating according to the current playbook of gradually expanding the international slate, and continually auctioning prime games to streaming services (we all grumble about the latter, but keep forking over the bucks), league revenue will still increase by roughly $1 billion a year.\nOpting for quality over quantity would best serve everyone. The players avoid the increased risk of injury and shortened playing careers, and the owners receive a stronger product to dole out to the world.\nInjuries are indeed an unfortunate part of the game, but unnecessarily embracing heightened risk defies logic.",
  "word_count": 1298,
  "scraped_at": "2026-02-14T12:44:07.885905"
}