{
  "article_id": "b605edf472c6",
  "url": "https://www.the42.ie/ireland-wnt-transfers-january-6945291-Feb2026/",
  "title": "Eight big Ireland WNT transfers in January as Katie McCabe looks likely to leave Arsenal",
  "date": "20260204T223000Z",
  "domain": "the42.ie",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "THIS WAS A relatively busy January window for Irish women’s internationals.\nIt is traditionally less so, with most business done in the summer, but several players made moves and others were subjected to rumours and reports with their future in focus.\nDenise O’Sullivan’s switch to Liverpool was the standout transfer, while Katie McCabe is reportedly likely to leave Arsenal this summer. Ireland’s star duo dominate the headlines, but others have found new clubs in recent weeks.\nFollowing the English WSL and WSL 2 window shutting last night, and with deadlines hit elsewhere, here’s a look at the Irish women’s internationals who moved in January — and who may follow this summer.\n*****\n1. Denise O’Sullivan (North Carolina Courage to Liverpool)\nAfter almost a decade in America, the midfield maestro has returned to the WSL with Liverpool. O’Sullivan spent a brief loan spell at Brighton in 2020, and is now looking to steer the Reds clear of relegation.\n“I just had this feeling that I really needed a change,” the 31-year-old told The 42 in an exclusive interview after joining. It seems to be going well so far: O’Sullivan scored six minutes into her debut in the FA Cup and was instrumental in securing their first league win the following week. An interesting challenge for a top player.\n2. Kyra Carusa (Free agent to HB Køge)\nOne of four Irish strikers to move in January, Carusa is returning to the Danish club she represented from 2020 to 2023. The 30-year-old left her hometown side San Diego Wave at the end of her contract in December, and was a free agent before signing for HB Køge.\nCarusa had been training with their sister club, Kansas City Current, and continues to do so. In the latter stages of her time at San Diego, game time was limited; a move to familiar surroundings should see her build back up. Carusa previously scored 30 goals and provided 13 assists in 57 appearances as they won back-to-back Danish Championships and played Champions League football.\n3. Amber Barrett (Standard Liège to Strasbourg)\nAround her 30th birthday, Barrett bid an emotional farewell to Belgian side Standard Liège and made the move to Strasbourg in France. Her first goal was a memorable one, the winner off the bench to secure a first-ever French Women’s Cup quarter-final spot.\nThe Donegal striker had impressed at Liège, scoring 22 goals in 32 games alongside fellow Irish internationals Claire O’Riordan and Aoife Colvill. But this new chapter is an intriguing one: Stephanie Zambra (ASPTT Albi) and Niamh Fahey (Bordeaux) had short stints in France, but Irish involvement there has been quite rare.\n4. Kelly Brady (Free agent to Crystal Palace)\nBrady’s stunning debut season at Athlone Town commanded interest, and after becoming a free agent at the end of the campaign, she was snapped up by Crystal Palace. She joins Abbie Larkin, Hayley Nolan and Ruesha Littlejohn at the WSL 2 club.\nThe transition to a full-time professional set-up will take some time but Brady has many of the attributes to shine. The US-born former Ireland international will hope to make her senior debut soon too, having been involved in Carla Ward’s squads recently.\n5. Ellen Dolan (Peamount United to Hearts)\nOne of the brightest young talents in the Women’s League of Ireland, Dolan is now plying her trade with Scottish side Hearts. She joined former Galway United attacker Jenna Slattery there, having departed Peamount United.\nThe 19-year-old marked her debut with a goal in a 19-0 win (yes, you read that right) over University of Stirling in the Scottish Women’s Cup. Like Brady, Dolan is uncapped at senior level for Ireland but has received call-ups.\n6. Leanne Kiernan (Liverpool to Nottingham Forest – on loan)\nOne of two high-profile Irish loan moves, the Cavan striker will play the remainder of the season in WSL 2 with Nottingham Forest. Kiernan has been plagued by injury, so rebuilding confidence through minutes and goals will be key. She will play alongside Chloe Mustaki and the on-loan Jessie Stapleton at seventh-placed Forest, having signed a new Liverpool deal last August.\n7. Tara O’Hanlon (Manchester City to Celtic – on loan)\nA second loan spell for the promising young talent this season as she continues her return from a string of serious injuries. O’Hanlon spent the first half of the campaign in WSL 2 with Sunderland, making just three appearances, and will hope for more game time at the Hoops, where she will link up with Saoirse Noonan and Claire Walsh.\n8. Lily Agg (Birmingham City to Durham – on loan)\nHaving recently returned to full training at Birmingham after an ACL injury — and subsequent cancer diagnosis of melanoma in situ discovered by her surgeon — Agg made a deadline day loan move to fellow WSL 2 club Durham. The 32-year-old will hope to build up her minutes and fitness alongside fellow midfielder Tyler Toland.\n*****\nKatie McCabe is the main Irish player in focus otherwise. The Guardian reported on Monday that the Irish captain is likely to leave Arsenal when her contract expires this summer, with no new deal on the table after “very respectful discussions”.\nThe European champions are reportedly in talks with Barcelona left-back Ona Battle as they prepare a squad overhaul this summer.\nMcCabe has spent over a decade in North London, and has won everything possible with the club. Sunday’s inaugural Fifa Women’s Champions Cup success completed the collection, with Champions League (2025), WSL (2018/19), FA Cup (2016) and League Cup (17/18, 22/23 and 23/24) other major team honours.\nThe 30-year-old has been a permanent fixture for Arsenal through the years, a consistent force and a fan favourite. She was nominated for the Ballon d’Or in 2023, named on the Champions League Team of the Season in 2022/23 and the PFA edition in 2021, and was Arsenal Player of the Year in ’21 and ’23.\nMcCabe should have no shortage of options should she leave on a free transfer this summer. She is reported to have interest from rival clubs in the WSL and NWSL, with her desire to continue starting routinely at the top level and winning trophies. The Dubliner has previously been linked with Chelsea and Lyon, with American billionaire Michele Kang — the majority owner of the latter as well as London City Lionesses and Washington Spirit — believed to be a major admirer.\nMcCabe recently moved house in London, while future plans may include those of partner and teammate Caitlin Foord, also out of contract this summer. A fresh challenge and different league could appeal, with plenty to weigh up in the coming weeks and months.\nElsewhere, Courtney Brosnan is reportedly close to signing a contract extension with Everton — though the departure of manager Brian Sørensen today could impact. Brosnan has established herself as one of the best goalkeepers in the WSL since joining the club in 2021, but Everton have struggled this season and are four points off bottom in ninth.\nJess Ziu is back at West Ham United after a shortened loan spell at Bristol City in WSL 2. The 23-year-old was due to spend the season there, but returns to the Hammers after four appearances. One-time call up Dee Bradley has also joined Durham on loan until the end of the season, while Emily Murphy will remain at Newcastle United after a bid from Chartlon Athletic was reportedly rejected.\nMeanwhile, it has been an exciting off-season in the League of Ireland Women’s Premier Division, with Ellen Molloy to Shamrock Rovers and Noelle Murray to Athlone Town among the blockbuster moves ahead of the 2026 campaign, which begins in mid March.",
  "word_count": 1277,
  "scraped_at": "2026-02-14T12:23:43.614657"
}