{
  "article_id": "b606e8c3604b",
  "url": "https://www.nec.edu/news/campus-upgrades-and-an-enrollment-surge-mark-a-transformative-year-at-new-england-college",
  "title": "Campus Upgrades and an Enrollment Surge Mark a Transformative Year at New England College",
  "date": "20240918T214500Z",
  "domain": "nec.edu",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Campus Upgrades and an Enrollment Surge Mark a Transformative Year at New England College\nPartnerships, advanced programs and modernized facilities position NEC as a leader in student success.\nHenniker, N.H. – New England College (NEC) kicks off the 2024–2025 academic year with exciting facility upgrades and notable enrollment increases. Through new academic programs, state-of-the-art facility upgrades, and strong strategic partnerships, NEC provides students with unique opportunities to gain hands-on experience, preparing them for success in an evolving world.\nNEC strengthens its commitment to experiential learning with several exciting academic initiatives. The College’s strong partnerships with local hospitals ensure that BSN students gain in-person patient experience during paid immersive clinical experiences, fast-tracking their journey into healthcare careers. Additionally, NEC is launching a master’s program in artificial intelligence (AI) soon, designed to equip students with the skills required for rapidly changing job markets influenced by AI.\nFor those studying the sciences, NEC’s newly renovated science labs and research spaces offer students the chance to engage in cutting-edge research with brand-new advanced equipment. NEC’s accounting programs have been restructured and are now supported by an endowed faculty position held by Dr. Reza Jalili, the K. H. William and Andrea Krueger Endowed Faculty Chair in Business Administration with a focus on Accounting. The addition of this prestigious role highlights the College’s commitment to academic excellence and leadership in the field of accounting.\nIn addition to academic advancements, NEC has significantly upgraded its recreational and athletic facilities, enriching the student experience. The College recently unveiled its resurfaced turf field that provides a state-of-the-art practice and playing surface for athletic teams, including some practices for NEC’s new football team. A renovated fitness center, now known as the Strength Lab, offers modern equipment to support the health and wellness of the entire NEC community. The College’s esports arena underwent a complete renovation, nearly doubling its size, catering to the growing interest in competitive gaming at a national level. Looking ahead, NEC plans to renovate Bridges Gym, which will further enhance athletic and recreational offerings for all students.\nThese efforts resulted in substantial enrollment gains for fall 2024. Early numbers show that nearly 3,500 students are enrolled across on-campus and online programs, representing the fourth consecutive year of consistent enrollment growth. This reflects a six percent increase in on-campus undergraduate students and a 23% percent increase in graduate students, the latter of whom predominantly pursue their degrees through NEC’s flexible online format.\nDriving this growth are NEC’s innovative programs, strategic partnerships, and new participation in initiatives like the New Hampshire Transfer Guarantee. This program, which offers guaranteed admission into NEC’s bachelor’s programs for community college graduates, opens the doors for more students to take advantage of NEC’s high-quality education, whether they prefer the on-campus experience or the flexibility of online learning.\n“Our focus is not just on maintaining excellence, but on constantly innovating,” said Dr. Wayne F. Lesperance Jr., President of NEC. “We are thrilled to see students responding to these new opportunities, and we will continue to enhance the NEC experience and support student success at every turn.”\nAbout New England College\nFounded in 1946, New England College (NEC) was established to serve the needs of servicemen and women attending college on the GI Bill after World War II. Today, it serves over 5,000 undergraduate, graduate and online students annually. NEC offers more than 50 associate and bachelor’s degree programs, more than 10 master’s degree programs and a doctoral program in education, all delivered by dedicated and accomplished faculty in the liberal arts tradition and with an emphasis on experiential learning. NEC is accredited by the New England Commission of Higher Education. For more information, visit www.nec.edu.\nInterviews are available by request.\nCONTACT:\nJosh McElveen\n603.540.7031\njosh@mcelveenstrategies.com\n###",
  "word_count": 621,
  "scraped_at": "2026-02-14T13:14:35.233541"
}