{
  "article_id": "b63bda7576ea",
  "url": "https://www.canberratimes.com.au/story/8191400/lost-its-appeal-nrls-scathing-canberra-stadium-submission-to-fed-govt/?cs=14329",
  "title": "NRL submits scathing Canberra Stadium assessment to federal inquiry | The Canberra Times",
  "date": "20230510T221500Z",
  "domain": "canberratimes.com.au",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "The NRL has weighed into Canberra stadium debate, making a nine-page submission to a federal inquiry into the national capital that says the existing venue \"has lost its appeal\" for major rugby league content.\nSubscribe now for unlimited access.\nor signup to continue reading\nIn another sporting infrastructure development, the NRL was scathing in its assessment of the state of Canberra Stadium and lack of federal government investment in facilities over the past 20 years.\nOn the same day ACT Chief Minister Andrew Barr described the need for stadium upgrades as a \"10th order issue\", the NRL said the capital's sporting infrastructure had fallen behind in a brutal takedown.\nThe report, compiled by NRL executive general manager Andrew Every, detailed why Canberra would continue to lose out on events rights to Townsville and Parramatta. It said:\n- Scheduling male and female rugby league events on the same day was \"unfeasible\" at the stadium;\n- The venue falls short of NRL major events standards, including connectivity and technology;\n- Canberra Stadium no longer meets \"minimum venue requirements\" for rugby league fan experience;\n- A national stadium in the city would help change the perception Canberra is a regional sporting destination, and;\n- Investing in upgrades at the existing site would fix only some of the stadium's deficiencies.\nThe Alicia Payne-led inquiry will examine ways to enhance Canberra's significance and the role of the national capital, with sport added to the terms of reference for the first time.\nThe inquiry published 24 submissions this week, including documents from the NRL, Cricket ACT, the Canberra Convention Bureau, the Canberra Business Chamber and the Walter Burley Griffin Society, addressing a range of topics.\nThe NRL took its opportunity to have a say on the stadium matter, which has dragged on for the past 14 years without a clear resolution on the horizon.\nACT Chief Minister Andrew Barr wants to rebuild Canberra Stadium as part of a wider AIS precinct overhaul at Bruce, while the Raiders, ACT Brumbies and A-League Men's want Civic to be considered.\n\"It could be argued that Canberra is currently perceived as a large regional centre rather than a proud, innovative, and vibrant national capital city that can effectively showcase Australia's potential in sports, tourism and culture,\" the submission said.\nMORE CANBERRA SPORT\n\"To change this perception, it's critical to invest in quality infrastructure, specifically an iconic national stadium.\n\"[Canberra Stadium] and the national capital have lost their appeal as being a potential location for rugby league events of national significance and no longer fit for purpose.\n\"They will, therefore, be overlooked in favour of venues such as [Townsville and Parramatta].\"\nThe Canberra Business Chamber submission supported the NRL's desire for a new stadium.\n\"Bruce Stadium is no longer fit for purpose and Canberra is losing access to major sporting and other events as a result,\" the chamber said.\n\"A rebuild of Bruce is likely to be nearly as expensive as a new stadium, while not addressing its issues in terms of location and capacity.\n\"Previous proposals combining a new stadium and a new convention centre and be revisited. The co-location of a new national stadium with a national meeting place could result in the development of an entertainment and hotel precinct that could reinvigorate Civic.\"\nFrustration has been bubbling for almost 12 months in Canberra sporting circles after Barr made a \"judgement call\" to ditch his own vision to build a stadium with a roof in Civic in favour of rebuilding Bruce.\nThe NRL, Raiders, Super Rugby and the Brumbies were blindsided by the decision after years of supporting Barr's plans to build in the city.\nInstead, they now face the prospect of years of disruption at the existing Canberra Stadium site during a rebuilding process and concerns of a lack of a match-day experience.\nThe NRL's submission said it was unlikely to schedule international fixtures or an Indigenous All Stars game in the capital while games are still being played at the 50-year-old Canberra Stadium.\nCanberra Stadium did host the women's State of Origin fixture last year and has been a Test-match venue in the past, as well as Socceroos, Matildas and Wallabies games.\nRugby Australia's World Cup bid team suggested an ageing Canberra Stadium could prevent the capital from playing a role in the 2027 tournament.\nThe NRL's submission lamented the lack of good amenities for fans at a venue where less than 20 per cent of seats are covered by a roof.\n\"[Canberra Stadium] falls short in several areas that are critical to hosting an NRL major event,\" the submission said.\n\"Specifically, it has inadequate connectivity and technology, subpar corporate facilities compared to other venues, insufficient undercover accessible seating, leading fans to opt for watching the game from home instead of enduring the discomfort of a cold and wet stadium seat.\n\"... When evaluating minimum venue requirements for NRL major events, the elements needed for an appropriate level of fan and athlete experience are critical. Unfortunately, [Canberra Stadium] no longer meets these requirements.\n\"While some issues may be remedied through a stadium redevelopment, the venue location will always be a significant challenge.\n\"... While essential features of a modern stadium have been identified, the biggest constraint remains the location of [Canberra Stadium].\n\"Investing in the current stadium may solve some deficiencies, but a stadium in Canberra's central business district is necessary to fully benefit tourism, the economy, community pride and cultural connection.\"\nSenator David Pocock is leading a new push for a city partnership deal to include a stadium and convention centre precinct in the Civic.\nHis approach is supported by sporting codes, but individual teams are concerned speaking out will harm their relationship with Barr or government officials.\nThe Raiders are expecting almost 20,000 at their clash against the Parramatta Eels on Saturday night.\nThe club is also preparing to join the NRLW competition in July, but the addition of a women's team has forced the government to upgrade change room facilities to cater for more teams and women.\nThe Raiders have been promised the upgrades will be complete in time for the women's team's first home game.\nThe federal government owns Canberra Stadium, but has not invested in the asset for the past 20 years. The ACT government leases the venue, and pays for any maintenance and upgrades.\n\"Unfortunately, [Canberra Stadium] lacks these facilities [for more than 30 athletes], either entirely or in quality and quantity and with the current lack of female facilities, scheduling premier female and male events in Canberra has become unfeasible for the NRL.\"\nWe've made it a whole lot easier for you to have your say. Our new comment platform requires only one log-in to access articles and to join the discussion on The Canberra Times website. Find out how to register so you can enjoy civil, friendly and engaging discussions. See our moderation policy here.",
  "word_count": 1146,
  "scraped_at": "2026-02-14T12:15:01.628287"
}