{
  "article_id": "b63ee0abbf48",
  "url": "https://www.cityam.com/fifa-strengthens-saudi-ties-as-pif-joins-club-world-cup-sponsors/",
  "title": "Fifa strengthens Saudi ties as PIF joins Club World Cup sponsors",
  "date": "20250606T101500Z",
  "domain": "cityam.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Fifa strengthens Saudi ties as PIF joins Club World Cup sponsors\nFifa has further strengthened its ties with Saudi Arabia after its Public Investment Fund (PIF) agreed a long-term commercial partnership beginning with this month’s Club World Cup.\nPIF has become the eighth sponsor of the revamped tournament, joining global brands Visa, Bank of America, Coca-Cola, Hisense, Lenovo, Budweiser and Qatar Airways.\nBeyond that, the partnership will focus on youth and grassroots development, Fifa said.\n“We are delighted to welcome PIF as a partner of the Fifa Club World Cup 2025. Together, we look forward to delivering a historic tournament that inspires and unites fans from around the world,” said chief business officer Romy Gai.\n“The partners of the first-ever 32-team Fifa Club World Cup believe in our vision to make football truly global. Their support of the tournament will not only be integral to its success but will underpin investment in supporting the development of club football everywhere.”\nIt comes after Fifa awarded Saudi Arabia hosting rights to the 2034 men’s World Cup and president Gianni Infantino’s recent trip to the Middle East with US President Donald Trump.\nEarlier this year Surj, another investment arm of the Saudi state, bought a minority stake in broadcaster Dazn, which acquired the global rights to the Club World Cup.\nFifa deal adds to PIF sporting footprint\nPIF has also made big moves in other sports, bankrolling the LIV Golf tour and making significant investments in both men’s and women’s tennis.\n“PIF is creating a legacy of transformative impact in sports including through its partnerships, delivering positive and lasting results at every level, from players and fans to host communities,” said its head of corporate brand Mohammed AlSayyad.\n“PIF is at the forefront of growing football around the world following our Concacaf partnership announced last year and our continued investment in football. We are unlocking opportunities to drive the growth of the sport around the world.”\nIt comes ahead of the start of the Club World Cup, which has been expanded to a major summer event to be held every four years, in the US next week.\nManchester City and Chelsea are England’s representatives and face competition from Paris Saint-Germain, Real Madrid, Bayern Munich and a host of teams from across the globe.",
  "word_count": 380,
  "scraped_at": "2026-02-14T12:35:49.724574"
}