{
  "article_id": "b695930752bb",
  "url": "https://www.yahoo.com/lifestyle/oslo-one-europe-coolest-cities-100000257.html",
  "title": "Oslo Is One of Europe Coolest Cities and It Has One of the Best New Hotels in the World",
  "date": "20230701T154500Z",
  "domain": "yahoo.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Oslo Is One of Europe’s Coolest Cities — and It Has One of the Best New Hotels in the World\nWhere to stay, what to eat, and where to shop in Norway's capital.\nOne travels to a new city to correct assumptions, to pave over impressionistic fragments with the real deal. One does not sit down at a Paris café expecting to be seated next to Catherine Deneuve any more than one goes on an expedition to the North Pole in hopes of an internship with Santa.\nBut within hours of landing in Oslo, the Norwegian capital presented me with a prismatic fantasy version of itself. Did I come here to order warm cheese buns and a pilsner on the patio of the cultural center and café Litteraturhuset, a table over from the country’s prime minister, Jonas Gahr Støre? I did not. Did I come here to angle for a glass of orange wine later that night at the bar Becco, only to find myself shoulder-to-shoulder with Renate Reinsve, the star of Joachim Trier’s Oscar-nominated The Worst Person in the World? Nei. Nor did I ever think I’d see, also at Becco, a DJ/priest (take all the time you need to let that combination sink in) hovering over a pair of turntables. But over the course of a week in early September, Oslo insisted on presenting an idealized montage of blazing sunsets, arresting art, bracing fjord swims, and a populace that’s exactly as cool as I’d imagined.\nIs there a city right now that feels as culturally inclined, well funded, and environmentally minded as Oslo (crowned “Green Capital” by the European Commission in 2019)? Since the discovery of oil in the North Sea in the late 1960s, Norway has gone from being one of the most underdeveloped countries in the region to one of the richest on the planet. It would take more than a week, not to mention a different skill set, to study the sociological effects of the economic boom. Suffice to say the tendency for self-deprecation among Norwegians is so apparent that it verges on dysmorphia.\nMore recently, Norway’s natural resources have also put it in a politically uneasy position. Soon after war broke out in Ukraine, it supplanted Russia as the EU’s primary gas supplier; since then the country’s profits have become astronomical — and controversial. If Norway is Europe’s biggest deposit box, what are the ethics of keeping the money locked inside (instead of, say, dedicating a portion to aid Ukraine)?\nOslo insisted on presenting an idealized montage of blazing sunsets, arresting art, bracing fjord swims, and a populace that’s exactly as cool as I’d imagined.\nBut even in peacetime, Norway was visibly flush, its infamously high taxes mirrored by a seemingly utopian level of public infrastructure. One could consult a tram or bus schedule in Oslo, but only if one couldn’t afford to wait the minute or two it typically takes for one to show up. It would be possible, I suppose, to track down a cigarette butt or two in Oslo’s breathtaking green spaces. The Ekebergparken sculpture park is an explosion of Modernism and whimsy in the woods south of the city, while the astonishing Vigeland Museet and Frogner parks are fun-house landscapes of fragrant gardens, eye-catching granite and bronze sculptures, and wrought-iron gates that cast shadows down bleach-white steps. I did stumble upon a birdhouse defaced with I ❤ SLUTS! in Kuba Park — but see? Here, even the grit has wit.\nOver a plate of skagen toast (prawns, roe, mayo) at Lorry, an Oslo institution that dates back to the 19th century, Simen Gonsholt, editor of the literary magazine Vinduet, deadpanned, “You will run into someone at a party and they will be very secretive and say they have something to tell you, and it always turns out the thing they have to tell you is that they’ve been cast in the new Joachim Trier movie.” The recent surge of Norwegian literary and film exports has helped usher the capital out of the shadows of neighboring Copenhagen (broadly worshipped) and Stockholm (lots of off-the-record comments about Stockholm). Trier’s moody and stylish trilogy of love letters to his city, made up of Reprise; Oslo, August 31st; and Worst Person (a laugh riot compared with the first two), reflect the sartorial and conversational tastes of a younger generation of Osloites. People here seem as content to delve into a deeper exchange as they are to hit the dance floor. Just so long as you skip the small talk.\nMore Trip Ideas: Everything You Need to Know To See the Northern Lights in Norway\nBut today’s Oslo is not strictly an export business. Three architectural behemoths have altered the skyline in as many years and are drawing waves of tourists. Completed in June 2020, the Deichman Bjørvika library has the breezy feel of an atrium peppered with shafts of light. Inside is the archive of the Future Library, a buzzy project conceived by Scottish artist Katie Paterson, in which authors including David Mitchell, Margaret Atwood, and the Oslo-born Karl Ove Knausgård have deposited manuscripts in inaccessible glass drawers. These works will not be read until 2114.\nIn October 2021, the city opened the world’s first museum devoted to the Norwegian Expressionist painter Edvard Munch, a structure so prominent on the waterfront that it surely would have appeared in the background of his work, had it existed in the late 1800s. The museum contains 26,000 pieces of Munch’s art, including multiple versions of The Scream (these are tucked behind doors that open and close on a timer, to limit their exposure to light) as well as a version of his magnificent Madonna. The building itself is aesthetically controversial, a slightly perplexing drama to an outsider: if the lauded Deichman Bjørvika library resembles a pile of books that fans out at the top, the Munch museum resembles a pile of books on the verge of tipping over.\nFinally, there’s the crown jewel: the National Museum of Art, Architecture & Design, which opened in June 2022. The night before my visit, at Bar Boca (try the pisco sour) in the ever-trendy Grünerløkka neighborhood, a table of thirtysomethings informed me that I would need “at least” two days to “do the museum properly.” I smiled and nodded and sipped.\nLet no one say I wasn’t warned.\nThe next morning, I grabbed a classic skillingsboller (cinnamon bun), available wherever caffeine is sold, and planned on a leisurely perusal of the museum. But when I set foot in the 588,000-square-foot slate-wrapped building, I realized that I should have worn Louvre-appropriate footwear. With nearly 90 rooms holding Norway’s largest collection of art, including works by contemporary artists from around the world — plus more Munch — the place has that new-museum smell (save, perhaps, for the tapestry made from 400 reindeer skulls in the lobby).\nBut its most wonderful quality is one that evades clear description. It’s easy to stumble, as if by accident, upon galleries filled with enormous paintings by Agnes Martin and Sol LeWitt. Poke your head behind a freestanding partition, assuming the presence of a single sculpture or a wall of photographs, and you’ll be met with the entrance to an entire hall dedicated to performance art. There’s more art on the rooftop, and there are structures you can crawl into. Considering skipping a gallery? I wouldn’t do that if I were you, not before opening that unmarked door along the back wall to see what lies behind it.\nEven as I was still there, I wondered how I would begin to describe a city that is still in the midst of describing itself to itself, of being simultaneously proud of and gobsmacked by the world’s newfound interest.\nAs a New Yorker, I’ve had dreams of finding panels in my closet, trapdoors, and secret passages. These doors opened into extra rooms of my apartment. Sometimes they opened into a whole extra apartment. All I had to do was push. To visit Oslo is to experience this “secret room” sensation writ large. It is a city of pockets, where attractions are being obfuscated not out of snobbery but because the people who designed them trust they’ll be found.\nOver the course of my week in Oslo, I learned that even popular destinations contained surprises. The “silent room” — the repository in the Deichman Bjørvika library that houses all those yet-to-be-read works — is, for all the hoopla that surrounded its opening, modest and unobtrusive. The entrance is tucked next to some shelves on the top floor; the interior is bone-dry, and reminiscent of a magical sauna.\nDown the hill from Our Savior’s Cemetery, where Munch is buried, I found myself on Damstredet, a small cobblestoned street with well preserved 18th- and 19th-century houses (a man tending to his garden showed me a shortcut to the main road, where I met a Persian cat that escorted me the rest of the way). Through a deep archway in an unmarked basement space nearby, Izakaya serves fragrant Japanese food along with lychee-, sake-, and ginger-based cocktails. Sorgenfri, a “multilevel shop-space and concept gallery” that opened in 2020, holds a coffee shop and bar (small venues in Oslo tend to run on an infinite loop of stimulants and depressants). There’s even a trick to finding good old Becco, despite its location in a more touristy part of town: follow the lights embedded in the pavement, a sort of yellow-lit road.\nMore Trip Ideas: This is One of the Most Scenic Train Rides in Europe\nMeanwhile Kok saunas, which opened its second location along Oslo’s shoreline this past spring, offers unassuming two-story floating cabins that take you out into the Oslofjord. Along the pier in the Aker Brygge shopping district, the wooden structures are hidden in plain sight — until you notice people shuffling up and down ladders in their bathing suits (when it’s cold, they shuffle at a rapid clip). The night before I partook in my own sauna, the bartender at Rouleur, a bar/café/bike-rental concerned with flattering lighting, captured the spirit of the experience for me: “Some people like it because of circulation — it’s a health thing. I like it because there’s nothing like jumping from heat into water that cold to make you not have a thought in your head.” Having now done it myself, I can say that I came for the first and got the second.\nEven Oslo's hotels are in on the “pocket” theme. The glamorous Sommerro opened just last September, but this industrial yet elegant space has a long and storied past. Built in 1931, it was once the headquarters of the city’s electric company. The original light fixtures, terrazzo columns, mosaic walls, and massive ground-floor mural are an interior designer’s dream, in that the building came ingrained with soul. Upstairs, each of the 231 carefully appointed rooms and suites are filled with cushy chaises and posh products: Deco meets Byredo. In a seamless transfer from municipal building to luxury space, it has a spa with a sauna and a gym, an underground theater, and six different restaurants, including Ekspedisjonshallen (a name I opted to mumble throughout my stay). It all teeters on the overwhelming (what a marvelous bunker Sommerro would make at the end of the world), but the new additions fit harmoniously. With rooftop access, seemingly endless subterranean levels, and a good story around every corner, the hotel feels like Oslo itself: clever in an understated way, and begging to be explored.\nIn fact, when I returned to the hotel from Rouleur (having fallen into a spirited conversation with the bartender’s friend about the digestive benefits of aquavit), I spotted a group of women in matching gowns smoking outside who were soon joined by men in tuxedos. It would have been very un-Trier-y of me not to crash a wedding in Oslo, considering that the heroine of The Worst Person in the World meanders into a stranger’s reception at the start of the movie. And since Sommerro is at once upscale and fanciful, it’s ideal for this sort of activity. Finding the party was another matter, however. Following the sound of merriment from staircase to staircase had a surreal quality, with pristine hallways leading to more pristine hallways. But find it I did. If the newlyweds were curious about the identity of that grinning, slightly buzzed stranger in their photo-booth shots, she is me.\nBy the time I transferred to the Amerikalinjen hotel — which opened in 2019 in the former Norwegian America Line headquarters — and spotted a cozy reading alcove on a stairway landing, I thought, Yup, that tracks. As a rule, one shudders to imagine the global impression of America, but if the U.S.A.-themed Amerikalinjen is any reflection, maybe we’re not so bad. The common areas are dotted with work by Alex Katz and Shepard Fairey. Voted Best Cocktail Bar in Norway at the 2022 Bartenders’ Choice Awards, Pier 42 has a clever menu of Norwegian-themed drinks and their stateside counterparts (Cross-Country Skiing paired with American Football; Holzweiler paired with Calvin Klein, Northern Lights paired with Manhattanhenge — the latter an overgenerous comparison). I refused to try the Statue of Liberty (vodka, green apple, elderflower) because it came in a sizable version of the statue’s head, and I have my self-respect. Instead, I opted for a less high-concept Moscow Mule.\nAfter a couple of these, I needed to start consuming more than the stray cinnamon bun. I was in luck. Oslo is racking up the culinary awards these days, a fact that makes some residents blush. My new friends at Rouleur winced when I mentioned Maaemo and the three Michelin stars engraved into a brass panel outside its door. This is not a reflection of the restaurant, of the life-changing cuisine therein, they told me, but of the über-wealthy clientele who come to Oslo on private planes to “eat and go.” I got a similar vibe speaking with Jostein Wålengen, owner of 10/10, a print shop and design studio. He used to make silk-screened shirts for the Munch museum but “now they have diamond rings of 'The Scream' in the gift shop.” (The limited-edition rings, 18-karat white gold with a pavé face — retailed for $23,000 before they sold out.)\nWålengen approved of my dinner reservation at Hot Shop (the site of a former sex-toy shop in Grünerløkka, its bare-bones website has zero mentions of its Michelin star), where I wound up taking a humiliating number of photos of my food. Would I ever again eat scallops that are not these scallops, raspberries that are not these raspberries? What would be the point? Who knew one could do that to turnips? Plus, the coffee was rocket fuel in a glass. I was up half the night, thinking about my meal.\nEven Stockholm’s gimmicky-but-delicious Punk Royale is jumping in, having opened a branch in the posh Oslo neighborhood of Fronger. I’ve been to the Swedish location, and I can say with some authority that you have not known awkwardness until you’ve had a syringe of pea purée shot into your mouth during a work dinner. If you’re thinking of visiting the Oslo outpost, you might want to consider rolling out the aquavit.\nWith the light fading and one night left in Oslo, I decided to say farewell to this idyllic city by going the classic route: dinner at Lille Herbern. The restaurant is neither new nor hip. It’s been a local favorite since 1929, serving what will henceforth be known as The Best Fish Soup I’ve Ever Had (salmon, mussels, shrimp, carrots, fennel, aioli). Getting to Lille Herbern is its own adventure. It’s located on a tiny island, which is accessed by taking a bus to a well-manicured suburban peninsula (the famed Kon-Tiki Museum, dedicated to Thor Heyerdahl’s expeditions, is a stone’s throw away, so one could do a double feature). There I followed signs to a dock (unmarked, naturally) and prayed a wooden ferry would appear in the marina to pick me up (it did, eventually). I arrived on the last day of the season — desperate seagulls and portable heaters were a sure sign of summer’s end — and ate outside by the glassy water, watching sailboats move across a setting sun, as if pulled by string.\nBack on the mainland, I took my time heading to the bus stop, zigzagging through the dreamlike neighborhood of Bygdøy, spotting a tennis court through a fortress of vines and pondering how much it would really cost to live in Oslo. Oh, who wants to spoil that question with an answer? Even as I was still there, I wondered how I would begin to describe a city that is still in the midst of describing itself to itself, of being simultaneously proud of and gobsmacked by the world’s newfound interest.\nFor so long Oslo has dubbed itself suburban or overlooked, the lesser-loved Scandinavian capital. Have its doors really opened into grander rooms, or is this all still part of the dream? Perhaps ever-evolving Oslo is exempt from the usual corrective impulse to replace impressionistic fragments with reality, to pin a city down. Perhaps the point of a visit is to heed the advice of the country’s most famous son: “I don’t paint what I see,” Munch said, “but what I saw.”\nWhere to Stay\nAmerikalinjen: Opened in 2019, this comfortable, modern hotel has 122 rooms and suites that brim with personality.\nSommerro: Housed in a former electric-company building in the handsome Frogner neighborhood, this 231-key property launched last September and quickly became the crown jewel of Oslo’s hotel scene.\nWhere to Eat & Drink\nBar Boca: A neighborhood standby with stiff drinks, good music, and a friendly, boisterous atmosphere.\nBecco: Join the stylish crowd at this bi-level bar with a sprawling outdoor patio.\nHot Shop: This Michelin-starred restaurant in a former sex-toy shop has won acclaim for inventive dishes made with local ingredients.\nIzakaya: A pocket-size spot serving Japanese snacks and alcohol.\nLille Herbern: It’s well worth the bus ride, walk, and ferry trip it takes to get to this storybook dining destination.\nLorry: Ornate paintings and taxidermy decorate this Oslo institution.\nMaaemo: One of the world’s best restaurants, with three Michelin stars.\nPunk Royale: This Swedish dining experience launched in Oslo last fall. p\nRouleur: A bar/café/bike-repair shop with a laid-back vibe.\nVaaghals: Colorful courses and top-notch wine pairings take center stage at this bright, airy restaurant.\nWhat to Do\nDeichman Bjørika: The new main branch of the Oslo library, by Atelier Oslo and Lund Hagem Architects, houses the Future Library project.\nEkebergparken: Find works by Dalí, Rodin, Jenny Holzer, and other international artists in this 156-acre park.\nKok: With two locations, guests can sauna off a pier or in the fjord. .\nLitteraturhuset :A cultural center with a full slate of events and a quality café menu.\nMunch: More than 26,000works by Norway’s most famous artist in a towering museum.\nNational Museum: Kleihues & Schuwerk’s dazzling building for the country’s largest repository of art.\nVigeland Museet: This installation of more than 200 sculptures by artist Gustav Vigeland is especially beautiful at sunset.\nA version of this story first appeared in the May 2022 ssue of Travel + Leisure under the headline \"Oh, Oslo!\"\nFor more Travel & Leisure news, make sure to sign up for our newsletter!\nRead the original article on Travel & Leisure.",
  "word_count": 3234,
  "scraped_at": "2026-02-14T13:08:01.190383"
}