{
  "article_id": "b6984b6c200d",
  "url": "http://www.malaysiasun.com/news/278568093/bam-khatoon-learns-fate-at-afc-womens-champions-league-2025-26",
  "title": "Bam Khatoon Learns Fate at AFC Womens Champions League 2025 - 26",
  "date": "20250914T150000Z",
  "domain": "malaysiasun.com",
  "source_country": "Malaysia",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "gdelt",
  "body_text": "Tasnim\n11 Sep 2025, 14:17 GMT+10\nThe 12 teams were divided into three groups for the second edition of the continental showpiece and will do battle in a centralized league format between November 9 to 23, 2025.\nGroup A will see top seeds and last seasons beaten finalists Australias Melbourne City FC doing battle with host Ho Chi Minh City FC of Vietnam, Philippines Stallion Laguna FC and Lion City Sailors FC of Singapore.\nGroup B comprises defending champion and host Wuhan Jiangda Womens FC of China PR, Irans Bam Khatoon FC, East Bengal FC of India and Uzbekistans PFC Nasaf.\nThe Group C challenge will be between Suwon FC Women of Korea Republic, Japans Tokyo Verdy Beleza, Naegohyang Womens FC of DPR Korea and Myanmars ISPE WFC who will host the group.\nThe group stage matches in Myanmar will be held between November 9 and 15, with games in Vietnam scheduled for November 13 to 19 and fixtures in China to be played from November 17 to 23.\nFollowing the Group Stage, eight clubs the top two finishers of each group and the two overall best third-placed clubswill advance to the Knockout Stage, with the single-leg Quarter-final pairings to be decided by a draw and played in March 2026.\nThe centralized Semi-finals and Final are scheduled for May 20 to 23, 2026.\nShares\nShare\nTweet\nShare\nFlip\nEmail\nGet a daily dose of Malaysia Sun news through our daily email, its complimentary and keeps you fully up to date with world and business news as well.\nPublish news of your business, community or sports group, personnel appointments, major event and more by submitting a news release to Malaysia Sun.\nMore Information\nnull in null\nBANGKOK, Thailand: Thailand's Supreme Court ruled that former Prime Minister Thaksin Shinawatra must serve a one-year prison sentence...\nLONDON, U.K.: Myanmar's jailed former leader Aung San Suu Kyi is suffering from worsening heart problems and urgently requires medical...\nKATHMANDU, Nepal: Prime Minister K. P. Sharma Oli has resigned amid the violence that continued for a second day Tuesday, which saw...\nNEW DELHI, India: At least 90 people have lost their lives and hundreds more have been displaced as unrelenting monsoon rains continue...\nKATHMANDU, Nepal: Nepal's government announced this week that it is blocking access to most major social media platforms — including...\nJAIPUR, India: On the edge of Jaipur, a sprawling industrial hub has emerged as the focal point of India's ambitious drive to rival...\nNEW YORK CITY, New York: The long-running question of who would control Rupert Murdoch's vast media empire has finally been answered....\nNEW YORK, New York - U.S. equity markets closed Wednesday on a mixed note, with the S&P 500 extending its rally to fresh highs, while...\nSYDNEY, Australia: Australia's ANZ is embarking on one of its deepest restructurings in years, with new CEO Nuno Matos announcing 3,500...\nTOKYO, Japan: Japan's benchmark Nikkei index hit uncharted territory, briefly soaring past 44,000 for the first time as investors cheered...\nNEW YORK CITY, New York: Artificial intelligence company Anthropic has agreed to pay US$1.5 billion to settle a class-action lawsuit...\nIn today's world, protecting your personal information feels like an uphill battle. With the rise of sophisticated email and text scams,...",
  "word_count": 538,
  "scraped_at": "2026-02-14T10:48:31.432107",
  "_text_extracted": true
}