{
  "article_id": "b6d33f745e04",
  "url": "https://royalcentral.co.uk/uk/walesfamily/a-year-as-heir-prince-william-as-first-in-line-192738/",
  "title": "A year as heir – Prince William as first in line",
  "date": "20230907T173000Z",
  "domain": "royalcentral.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "After nearly 65 years carrying the title of Prince of Wales, King Charles ascended the throne one year ago and granted William the title he’d been so closely associated with for most of his life.\nOn 9 September, King Charles addressed the nation for the first time since his accession. Amongst his remembrances of his mother, his own commitment to serving as sovereign, and a touching tribute to Queen Camilla, he announced that William and Catherine would henceforth be the Prince and Princess of Wales.\n“Today, I am proud to create him Prince of Wales, Tywysog Cymru, the country whose title I have been so greatly privileged to bear during so much of my life and duty,” the King said.\n“With Catherine beside him, our new Prince and Princess of Wales will, I know, continue to inspire and lead our national conversations, helping to bring the marginal to the centre ground where vital help can be given.”\nKensington Palace shared shortly after King Charles made the announcement that the new Prince and Princess of Wales were looking forward to “celebrating Wales’s proud history and traditions as well as a future that is full of promise.”\nWilliam telephoned Wales’s First Minister Mark Drakeford, and they spoke about shared goals for the future and visiting the principality as soon as possible.\nWilliam and Catherine have visited Wales on several occasions in their first year as Prince and Princess and are due back on 8 September 2023 to mark the first anniversary of Queen Elizabeth II’s death.\nIn the first weeks of King Charles’s reign, one central question seemed to stick to peoples’ minds: Would William have an investiture ceremony like his father did in 1969? Kensington Palace was quick to dispel any notions that William would want this, noting that there would be no plans for any sort of formality attached to receiving the title, and the people of Wales shared in the sentiment.\nWilliam’s most significant project in his first year as Prince of Wales was the launch of Homewards over the summer.\nBilled as a five-year project to help make homelessness “rare, brief and unrepeated,” Homewards works within six areas of the United Kingdom and is entirely locally-led, meaning that local organisations work together to develop action plans on how to help end homelessness in their communities.\nThe Royal Foundation of the Prince and Princess of Wales will fund up to £500,000 per location and work with the organisations to see their projects through.\nAt its launch, William said: “Homewards aims to give people across the UK hope that homelessness can be prevented by showing them the progress we can make when we collaborate.\n“It’s a big task, but I firmly believe that by working together, it is possible to make homelessness rare, brief and unrepeated, and I am very much looking forward to working with our six locations to make our ambition a reality.”\nPrince William played a big part in his father’s coronation on 6 May. Dressed in his Order of the Garter robes, the Prince of Wales was the only royal duke to pay homage to the King. In past coronations, this was performed by all royal dukes, but King Charles changed the convention.\nAs he knelt before his father, William vowed: “I, William, Prince of Wales, pledge my loyalty to you and faith and truth I will bear unto you, as your liege man of life and limb. So help me God.”\nPrince William joined the Royal Family on the balcony after the coronation. He took a central role in other coronation festivities, including receptions for world and Commonwealth leaders and foreign royals, walkabouts along The Mall, volunteering with the Big Help Out with Catherine, his children, and the Scouts, and delivering a speech at the Coronation Concert at Windsor Castle.\nThere, the heir to the throne spoke fondly of his father’s lifelong commitment to the environment, telling a global audience: “My father’s first words of entering Westminster Abbey yesterday were a pledge of service. It was a pledge to continue to serve, because for over 50 years, in every corner of the UK, across the Commonwealth, and around the world, he has dedicated himself to serve others—both current and future generations and those whose memory has not been neglected.\n“Take the natural world. He warned us of the risks for our planet’s health, long before it was an everyday issue. Or the Prince’s Trust, has supported over a million young people, many from disadvantaged back to realise their own missions.\n“And perhaps, most importantly, of all, my father has always understood that people of all faiths, all backgrounds, all communities deserve to be celebrated and supported.”\nBefore he closed his speech, he paid a personal tribute to his father, saying, “Pa, we are all so proud of you.”\nThe Earthshot Prize, now in its third year, continued to be a major focal point for William in his first year as Prince of Wales. In early December 2022, he and Catherine were in Boston for the awards ceremony; in May 2023, he announced that the third awards ceremony would occur in Singapore.\n“I am delighted that The Earthshot Prize is travelling to Singapore where the ground-breaking solutions of our 2023 Finalists will be celebrated,” he said as the news was announced.\nThe Prince of Wales continued in his regular duties, performing investitures on behalf of the King, attending services and events as part of the Royal Family including Commonwealth Day, Trooping the Colour, Remembrance Sunday and Christmas. He also now oversees the Duchy of Cornwall by himself, involving himself in the meetings and affairs that help fund his work as direct heir to the throne.\nThe biggest controversy came in the summer months when William and Catherine, like millions of parents around the country, try to spend with their children once the school year ends. Their last public engagement was at the Wimbledon men’s singles finals in early July.\nMany column inches were dedicated to the fact that William, in his role as President of the Football Association, did not attend the Women’s World Cup final in Australia when England’s Lionesses made it all the way to the end. Instead, he and Princess Charlotte sent a good luck video to the team and posted it on the Kensington Palace social media accounts.\nThe impossible task continues to be carrying the torch of the previous Prince of Wales, who regularly carried out the most engagements—or if he didn’t, was second only to the Princess Royal—each year.\nA lot has been said about the Prince and Princess of Wales’s dedication to ensuring that their children come first, and some might say that as Prince and Princess of Wales, their royal duties carry more importance than when they were simply the Duke and Duchess of Cambridge.\nWilliam might not work at the same pace as his father, for better or worse, but it’s clear that he intends to reinvent it to suit his own needs as a royal and a father. Overall, William’s first year as Prince of Wales has been resoundingly successful: he is routinely the most popular member of the Royal Family when public polls are released and was also voted as the world leader most trusted by Americans.\nAs he continues in his new role, the big question will be: just how differently will William do it? We’ll see.",
  "word_count": 1233,
  "scraped_at": "2026-02-14T13:03:57.105050"
}