{
  "article_id": "b6f105671794",
  "url": "https://northafricapost.com/90761-fifas-chief-visits-grand-stade-de-tanger-a-world-class-infrastructure.html",
  "title": "FIFA Chief visits Grand Stade de Tanger , a  world - class infrastructure  – The North Africa Post",
  "date": "20250921T163000Z",
  "domain": "northafricapost.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Gianni Infantino, President of the International Federation of Association Football (FIFA), visited Saturday the Grand Stade de Tanger whose ongoing renovation is nearing completion. Infantino expressed great admiration for the work accomplished and commended Morocco, under the leadership of King Mohammed VI, for its world-class infrastructure, which further strengthens the Kingdom’s standing on the international football stage, especially as it prepares to host major tournaments such as the 2025 AFCON and the 2030 FIFA World Cup alongside Portugal and Spain.\n“This is a perfect example of what Morocco has become—not only a great footballing nation, but also a country looking firmly toward the future. A country of the 2030 FIFA World Cup, and, as you can see from this stadium, a country clearly determined to do incredible things for its people and for the world,” said Infantino in a statement published on YouTube channel of the Royal Moroccan Football Federation (FRMF).\n“It’s absolutely magnificent. I congratulate everyone who has done truly exceptional work under the impetus of His Majesty the King. It’s a real gem—this will become a symbol of Tangier,” the FIFA President said.\nInfantino, who was accompanied by the FRMF President Fouzi Lekjaa, toured the stadium and was briefed by the project managers on the renovation works, which were carried out “in record time” by Moroccan workers, national experts, and local companies, FRMF said.\nOn Friday, Infantino paid a working visit to the FIFA Africa headquarters in Rabat. He visited the FIFA training program workshop for female coach educators, held at the Mohammed VI Football Complex.\nAfterwards, the FIFA Chief held meetings with the presidents of the football federations of Senegal, South Sudan, Rwanda, Gabon, and Tunisia, focusing on ways to develop football across the African continent.\nIn a video published on the official FRMF website, Infantino emphasized the importance of the seminar for women’s football educators in Africa. He affirmed that Morocco, a “great footballing and host nation,” has all the infrastructure needed to contribute to the development of African football.\nHe also expressed satisfaction at the meetings he held with several African federations’ presidents, focused on strategies to further develop African football and solidify its place on the international stage. This comes in the context of Morocco’s upcoming hosting of the U17 Women’s World Cup, the 2025 Africa Cup of Nations (AFCON), and the 2030 World Cup.\n“I am happy to be in Morocco, at the FIFA Africa headquarters, for some intense and highly productive days,” he said.",
  "word_count": 412,
  "scraped_at": "2026-02-14T12:36:41.918816"
}