{
  "article_id": "b6fbd2dc4a13",
  "url": "https://www.90min.com/aitana-bonmati-wins-2024-ballon-d-or-feminin",
  "title": "Aitana Bonmati wins the 2024 Ballon dOr Feminin",
  "date": "20241028T230000Z",
  "domain": "90min.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Aitana Bonmati wins the 2024 Ballon d'Or Feminin\n- Bonmati has been crowned the winner of the 2024 Ballon d'Or Feminin\n- Barcelona star enjoyed outstanding 2023/24 campaign\n- Spanish midfielder scoops back-to-back awards after winning in 2023\nBarcelona midfielder Aitana Bonmati has scooped her second successive Ballon d'Or Feminin, after picking up the award in both 2023 and 2024.\nThe Catalan star retains football's most coveted prize after an immense campaign with Barcelona - winning the club's fifth consecutive Liga F title and lifting the Champions League trophy. Her success saw her beat the likes of teammates Caroline Graham Hansen and Alexia Putellas as well as Khadija Shaw and Lucy Bronze to be crowned the best women's player in world football.\nBonmati's success also sees her follow in the footsteps of Barcelona and Spain teammate Putellas - who scooped the award in 2021 and 2022.\nWhile Spain were unable to medal at this summer's Olympics, Bonmati played a starring role in their UEFA Nations League glory. Her showings for both club and country saw her awarded with a new Barcelona contract, which she penned in September.\n2024 marked the fourth successive year that a Spanish player has won the Ballon d'Or Feminin, after both Putella and Bonmati scooped back-to-back awards. The trophy was only awarded for the first time in 2018 - with Ada Hegerberg the inaugural recipient before USWNT legend Megan Rapinoe picked it up a year later.\nThe 26-year-old has already enjoyed a strong start to the 2024/25 campaign, netting three goals in five appearances. Barcelona currently sit at the top of Liga F, clear of rivals Real Madrid.",
  "word_count": 272,
  "scraped_at": "2026-02-14T12:53:01.432619"
}