{
  "article_id": "b6fd66655e1e",
  "url": "https://english.aawsat.com/sports/5026528-fifa-unites-world-cup-winners-and-club-executives-teammates-study-soccer-diploma",
  "title": "FIFA Unites World Cup Winners and Club Executives as Teammates to Study for Soccer Diploma",
  "date": "20240601T124500Z",
  "domain": "english.aawsat.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "World Cup and Champions League winners are learning about the soccer industry at FIFA alongside club founders and front-office leaders.\nAll were teammates in the classroom this week at the soccer body’s headquarters in Zurich to study all fields of the industry for the FIFA Diploma in Club Management.\nGraduates this week included Juan Mata and Angel City founder Julie Uhrman, while Cesc Fàbregas, Esteban Cambiasso and Radamel Falcao are among the latest intake for the 18-month course.\nNow in its third edition, the FIFA course aims to give former stars a pathway to careers off the field and better educate soccer industry executives about the players’ perspective.\n“When we learn something it is a great feeling. These courses give us a chance to do that,” said Mata, who won a World Cup title with Spain and a Champions League with Chelsea.\nAs a co-founder in 2017 of the socially progressive Common Goal charity, Mata’s smarts already were established and he was expected to have an impactful post-playing career.\nHowever, former Argentina and Inter Milan midfielder Cambiasso cautioned in one session that some industry executives “think that if a football player develops his brain, that is a danger.”\nFàbregas is studying on the course while coaching in Italy at Como, newly promoted to Serie A after a 20-year absence, where he is also a minority investor.\nHe was hired at Como by Dennis Wise, who played for Chelsea and England, was an executive at Newcastle and is part of the FIFA selection board for the course and helps teach it.\n“There are many of us that are capable of doing it and we have shown we are capable,” Wise said. “You are never too old to continue to learn.”\nFIFA started its diploma course in 2021 following the UEFA masters course taught since 2015 by the European soccer body with input from universities in England and France.\nThis generation of newly-retired international players typically acquired enough wealth to have serious investment options and no need to work again. Mata has a stake in Formula One team Alpine.\n“We do have exceptional lifestyles,” acknowledged Tim Cahill, an advisor to Qatar’s soccer federation and board member at Qatar-owned Belgian second-tier club Eupen.\nWise suggested the motivation for FIFA students to be educated was “not about money. It is about success and achieving certain things.”\nFIFA’s course focuses on club operations rather than national federation issues and a keynote lecturer is Arsene Wenger, its head of global development after 22 years as Arsenal coach.\n“You could have heard a pin drop in the room when he spoke,” said Karina LeBlanc, the storied former Canada goalkeeper and now general manager at Portland Thorns in the National Women’s Soccer League.\nPortland and Angel City were created in recent years and are now trying to learn and share from clubs that have more than 100 years of history, said Uhrman, the Angel City president who was an entrepreneur in the gaming and entertainment industries before founding the soccer club in Los Angeles.\n“It can only bring you closer together,” she said, “because we are sitting at the table together.”",
  "word_count": 523,
  "scraped_at": "2026-02-14T12:48:00.709344"
}