{
  "article_id": "b755539d3dc7",
  "url": "https://www.fcbarcelona.com/en/club/news/3962107/karol-g-to-be-the-next-artist-on-the-barca-shirt-with-spotify",
  "title": "KAROL G to be the next artist on the Barça shirt with Spotify",
  "date": "20240412T081500Z",
  "domain": "fcbarcelona.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "KAROL G to be the next artist on the Barça shirt with Spotify\n- label.aria.viber Viber\n- label.aria.whatsapp WhatsApp\n- label.aria.twitter Twitter\n- label.aria.facebook Facebook\n- label.aria.messenger Messenger\n- label.aria.link label.aria.tick Copy link\nThe tradition of different logos on the Barça shirt in association with Spotify is about to bring a new episode, and is once again set to make history. This time the chosen artist is Colombia’s KAROL G, the most streamed female Latin music artist worldwide on Spotify for the last four years in a row, and a musical icon who has got the whole planet dancing to such tracks as PROVENZA, TQG and QLONA. In fact, her songs appear in more than 100 million playlists created by Spotify users.\nKAROL G’s iconic barbed wire heart logo will first be appearing on the Barça shirt for the women’s Liga F game on Saturday 13 April against Villarreal. A week later, on Sunday 21st, the men’s first team will be playing El Clásico at the Santiago Bernabéu with the same logo on their chests.\nThis new logo seeks to pay tribute to everyone willing to change the rules of the game, to break down barriers and to leave a legacy for new generations to express themselves as they want. “La Bichota”, just like the Barça women’s and men’s teams, has inspired countless people. It has played a key role in taking Latin music to new global heights.\nExclusive shirts on sale\nWith this special campaign comes two special editions of the shirt which will be released for sale and can be purchased from this Friday from Barça Stores and the Club’s e-commerce service. On the one hand, there are 1899 units of the Match quality FC Barcelona x KAROL G Limited Edition, while the FC Barcelona x KAROL G Signed Limited Edition is even more exclusive, with just 22 units on sale, also Match quality, and signed by the players that start the two matches, the Liga F clash and the men’s Clásico with Real Madrid.\nThis Friday, FC Barcelona, Spotify and KAROL G are also launching on the artist’s official website a limited edition of lifestyle items including shirts, hoodies, scarves, beanies and water bottles. All of these products combine KAROL G’s vibrant visual imagery with the traditional look of Barça items.\nBarça and Spotify: A strategic alliance\nThe appearance of KAROL G’s logo is just the latest of a series of actions between Spotify and FC Barcelona that have linked the music and football worlds. This activation (as with those involving and the Rolling Stones before) is an example of how Spotify’s association with Barça is much more than branding, as it also offers a platform for artists and their work like none before.\nStatement by KAROL G:\n“The heart symbol represents what became ‘Bichota’ style, a moment in my life where I found strength, resilience and support. Thanks to Spotify and FC Barcelona, seeing it on the front of a shirt that inspires so much of that same energy is truly meaningful.”\nStatement by Juli Guiu, FC Barcelona vice-president for marketing:\n\"Changing the logo on the shirt has become one of the most iconic and successful parts of the relationship between Barça and Spotify. The anticipation as to who will be the next chosen artist generates conversation at all levels for weeks and the resulting impact when the news is finally announced can be measured on a global level. This time, the choice of an artist as renowned as KAROL G helps us, together with Spotify, to create synergies outside of sport and to connect with a new generation of Barça fans around the world\".\nStatement by Marc Hazan, Spotify vice-president for sponsorship and marketing:\n“We are so proud to be celebrating the incredible success of KAROL G through the iconic Barça jersey. Her music inspires a unique passion similar to that of the football club and it is amazing to bring the two together. As the biggest Latina artist on Spotify and a trailblazer in her field, we knew KAROL G was a perfect teammate for FC Barcelona.”\n- label.aria.viber Viber\n- label.aria.whatsapp WhatsApp\n- label.aria.twitter Twitter\n- label.aria.facebook Facebook\n- label.aria.messenger Messenger\n- label.aria.link label.aria.tick Copy link",
  "word_count": 703,
  "scraped_at": "2026-02-14T12:52:37.634830"
}