{
  "article_id": "b7881503fead",
  "url": "https://udreview.com/delaware-poised-to-move-up-to-fbs-by-joining-conference-usa-reports/",
  "title": "Delaware poised to move up to FBS by joining Conference united states : Reports",
  "date": "20231127T234500Z",
  "domain": "udreview.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "BY DANIEL STEENKAMER\nManaging Sports Editor\nThis week, Delaware is preparing for its NCAA Football Championship Subdivision (FCS) playoff second round matchup at the University of Montana.\nThe Fightin’ Blue Hens’ game against the Grizzlies on Saturday night could be their last in the FCS postseason.\nMultiple reports Monday indicate that Delaware is set to join Conference USA, a Football Bowl Subdivision (FBS) league, effective the 2025-26 academic year. ESPN’s Pete Thamel was first to report the move and was joined by The Athletic’s Chris Vannini and Action Network’s Brett McMurphy.\nDelaware has played FCS football (formerly known as Division I-AA) since 1980, starting as an independent in I-AA before beginning play in the Yankee Conference in 1986. The Yankee Conference became a precursor to future iterations known as Atlantic 10 football and Colonial Athletic Association (CAA) Football.\nPrior to the 2023-24 school year, the CAA renamed itself as the Coastal Athletic Association, maintaining its three-letter shorthand. In a press release, the conference pitched its rebrand as being timely in that it “reflects the CAA’s recent expansion.”\nThat expansion occurred in the aftermath of longtime CAA member James Madison University (JMU) departing in football and all sports in favor of an FBS move to the Sun Belt Conference. Like JMU’s addition to the Sun Belt, Delaware would enter Conference USA (CUSA) with multiple Blue Hen sports not sponsored by CUSA needing a conference home outside the CAA. It is seen as unlikely, though is not thought to be impossible under the pressures of realignment, that Delaware could continue in the CAA as an associate member in select sport(s).\nThe Delaware programs that require a league that is to be determined are field hockey, women’s lacrosse, men’s lacrosse, men’s soccer, rowing and swimming and diving. Field hockey and men’s lacrosse are two of the squads that have generated lengthy NCAA runs for Delaware in recent years, including field hockey’s 2016 national championship win and a men’s lacrosse second round appearance last season.\nCurrent Conference USA members are Florida International University, Jacksonville State University, Liberty University, Louisiana Tech University, Middle Tennessee State University, New Mexico State University, Sam Houston State University, the University of Texas at El Paso and Western Kentucky University.\nKennesaw State University, another program transitioning up from the FCS, is joining CUSA as its 10th institution in 2024. Conference USA has a geographic footprint concentrated in the southeast with western outposts the way of New Mexico and Texas. As presently constructed, the Blue Hens would be the bunch’s northernmost location.\nDespite geographic overhaul compared to the CAA’s Atlantic coast lineup, signs point to Delaware giving CUSA its 11th full member. The Blue Hens are poised to become the 135th football team residing in the FBS.\nAt present, the Hens are competing in their third FCS tournament in the last four seasons, a run that began with Delaware’s 2020-21 CAA Football title. Delaware won the 2003 national championship in I-AA/FCS and made runner-up finishes in 2007 and 2010. The Blue Hens qualified for the 2018 FCS playoffs and lost to future FBS companion JMU in the first round in Harrisonburg, Virginia.\nThamel’s report specifies that “a decision is expected to be formalized in the coming days” regarding Delaware joining CUSA.\nThis is a developing story.",
  "word_count": 545,
  "scraped_at": "2026-02-14T14:08:51.809599"
}