{
  "article_id": "b7afc4695ec9",
  "url": "https://www.bbc.co.uk/news/uk-england-northamptonshire-66609704",
  "title": "Nike Mary Earps kit U - turn shocks teen who set up petition",
  "date": "20230824T224500Z",
  "domain": "bbc.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "A teenager who campaigned for Nike to sell England women's goalkeeper shirts said it was \"amazing\" the brand had made a U-turn on its position.\nA petition started by 16-year-old Mary Earps fan Emmy, from Northamptonshire, garnered more than 152,000 signatures.\nEngland goalkeeper Earps, who saved a penalty in the World Cup final, also expressed dismay that her shirt was not sold with the rest of the team kit.\nIn a change of heart, Nike said it had \"secured limited quantities\" for sale.\nEmmy, 16, told the BBC: \"Obviously there was that hope that it would happen, I didn't believe it would happen so quickly, and it would be a very quick turn-around.\n\"But I think we can just be grateful that they have turned around and listened to us.\"\nEmmy's petition was launched on 21 July, with the number of signatures doubling since the Lionesses finished runners-up in the World Cup.\nBefore the tournament, Lionesses star Earps said she found it \"hurtful\" that fans could only buy outfield players' shirts - and not hers.\nEngland were beaten 1-0 by Spain in the World Cup final, but Earps saved a penalty and it was the team's best-ever result at the competition.\nEarps' efforts at the tournament earned her the Golden Glove award.\nEmmy, who also plays football, said: \"Mary's such an inspiring person in my life.\"\nShe said an apology form the firm was deserved, given \"the upset that they (Nike) caused, Mary having to go into the tournament, not being able to see her fans in the stands wearing her on their shirts.\n\"Obviously they (Nike) said there would be limited stock, so I hope I can actually get my hands on one.\"\nThe sportswear firm confirmed its U-turn on Thursday and acknowledged it failed to respond quickly enough to public demand during the tournament.\nIt said: \"Nike has secured limited quantities of goalkeeper jerseys for England, US, France, and the Netherlands to be sold through the federation websites over the coming days, and we are also in conversations with our other federation partners.\n\"We recognise that during the tournament we didn't serve those fans who wished to show their passion and support to the squad's goalkeepers.\n\"We are committed to retailing women's goalkeeping jerseys for major tournaments in the future.\"\nRecently, an Oxford-based company designed its own version of the goalkeeper top.\nFollow East of England news on Facebook, external, Instagram, external and Twitter, external. Got a story? Email eastofenglandnews@bbc.co.uk, external or WhatsApp us on 0800 169 1830\nRelated topics\n- Published24 August 2023\n- Published23 August 2023\n- Published22 August 2023\n- Published4 August 2023\n- Published21 July 2023",
  "word_count": 442,
  "scraped_at": "2026-02-14T13:04:09.196275"
}