{
  "article_id": "b7bc795b0303",
  "url": "https://www.newsmax.com/world/globaltalk/spain-luis-rubiales-investigation-airport-super-cup/2024/04/03/id/1159707/",
  "title": "Spanish Police Arrest Ex - soccer Federation Head Rubiales on Return to Country amid Corruption Probe",
  "date": "20240404T021500Z",
  "domain": "newsmax.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "BARCELONA, Spain (AP) — Luis Rubiales, the disgraced former president of Spain's soccer federation who kissed a player on the lips without her consent at the Women's World Cup final, was arrested Wednesday as part of a separate corruption probe by Spanish police before being released.\nThe Civil Guard said that Rubiales was questioned by police at Madrid’s airport after he was detained on exiting the plane that brought him back home from the Dominican Republic. He was released a few hours later. An investigative judge is expected to summon him for more questioning in the coming days.\nRubiales was returning to Spain amid a judicial probe into business deals while he ran the federation, including his biggest decision to move the Spanish Super Cup to Saudi Arabia.\nRubiales was in the Dominican Republic two weeks ago when police raided a property belonging to him in the southern Spanish city of Granada and the offices of the Spanish Football Federation in Madrid. Seven people were arrested before being released and Rubiales was identified as one of five additional individuals under investigation.\nThe corruption and money laundering investigation is looking into contracts for the Spanish Super Cup and the federation’s links with Seville’s La Cartuja Stadium, which hosts the Copa del Rey final and some international games, among other deals.\nRubiales stepped down as president of the federation in September after causing an international scandal for kissing Spain player Jenni Hermoso without her consent at the Women’s World Cup final. He is facing a trial for allegedly sexually assaulting Hermoso. He has denied any wrongdoing in that case.\nRubiales cut short his stay abroad by three days. He had originally told the court that he was coming back on Saturday.\nDuring his time as president of Spanish soccer, Rubiales overhauled the format of the Spanish Super Cup in 2020, creating a four-team mini tournament and moving the competition to Saudi Arabia as part of a deal that was reportedly worth 40 million euros (then $42 million) per tournament for the federation.\nProsecutors opened a probe of that deal in 2022 following leaked audio between Rubiales and then-Barcelona player Gerard Piqué regarding millions of dollars in commissions. Piqué’s sports entertainment company Kosmos was involved in the deal with the federation and Saudi Arabia. A company official told The Associated Press that no employee of Kosmos has been detained or placed under investigation and no property of the company has been raided.\nIn a brief preview of a recorded interview with Spanish television channel La Sexta, Rubiales denied a series of what he called false claims made by Spanish media.\n“I don’t know what the judge has said or what Civil Guard has investigated,” he said. “The money in my bank account is the result of my work and my savings.”\nRubiales, 46, is a former player who ran Spain’s main players union before he was elected to run the federation in 2018 when he replaced Ángel Maria Villar, who was in power for nearly three decades before he was investigated for corruption. Rubiales shored up internal support by boosting revenues for the federation and spreading them around. He worked his way up to UEFA vice president and played a part in securing the joint bid by Spain, Portugal and Morocco to co-host the 2030 men's World Cup.\nSpain’s Justice Minister Félix Bolaños said he was not concerned about possible reputational damage to Spain co-hosting the World Cup.\n“The mere existence of this operation shows that Spain’s democratic and judicial institutions work and that helps guarantee the organization and hosting of all international events like a World Cup,” Bolaños said.\nThe federation runs Spain’s men’s and women’s national soccer teams, the Copa del Rey, and the country's semi-professional and amateur soccer leagues. It also organizes the referees. The government maintains some oversight of the entity but it cannot name or remove its executives.\nRubiales’ biggest decision was to take the Spanish Super Cup to Saudi Arabia. The clubs and federation liked the income, but the move was criticized by women’s and human rights groups over Saudi Arabia’s treatment of women and minorities.\nHe had appeared untouchable, however, until he became a national embarrassment for his kiss of Hermoso at the Women's World Cup. The world champion players boycotted the team and, after Rubiales initially claimed to be the victim of “false feminists,\" he eventually quit under immense pressure.\nHours after Rubiales was arrested, his successor and interim federation president, Pedro Rocha, stepped down after calling for federation elections on May 6 to choose new leadership.\nIn the statement announcing the elections, the federation said it would collaborate with the judicial investigation so that the institution could “leave behind a convulsive period that has seriously damaged the image of Spanish soccer.”\n___\nAP soccer: https://apnews.com/hub/soccer",
  "word_count": 801,
  "scraped_at": "2026-02-14T12:52:44.792449"
}