{
  "article_id": "b7ca55aa6c1e",
  "url": "https://kansaspublicradio.org/2023-10-26/headlines-for-thursday-october-26-2023",
  "title": "Headlines for Thursday , October 26 . 2023",
  "date": "20231026T170000Z",
  "domain": "kansaspublicradio.org",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "UAW Agreement with Ford Could Reopen Claycomo Plant\nKANSAS CITY, Mo. (KSHB) - A tentative agreement on a new contract between Ford and the United Auto Workers was announced Wednesday night. It could be good news for members of UAW Local 249 at Ford’s Kansas City Assembly Plant located in Claycomo, Missouri. KSHB TV reports that the Kansas City area plant has about 7,200 union employees and about 3,000 retirees. The Claycomo plant produces the popular Ford F-150 pickup trucks and the company's transit commercial van. The deal is still subject to the union members’ ratification votes. Last night’s announcement from national UAW officials disclosed that since the union launched its strike, Ford's offer to the union increased by 50%. The final steps in the process are regional meetings to discuss the tentative agreement’s details with local union leaders and to hold ratification votes. No agreements have been reached with union workers at the other two major U.S. automakers, General Motors and Stellantis. Officials at UAW Local 31, which represents workers at General Motors Fairfax Assembly Plant in Kansas City, Kansas, say they are happy for the Ford workers but say that striking employees at the Fairfax plant will continue to negotiate with General Motors.\n==========\nSurvey: Most Kansans Support Legalized Recreational Marijuana\nHAYS, Kan. (KNS) - A new survey from Fort Hays State University shows more than two-thirds of Kansans are in favor of legalizing recreational marijuana. And more than 60% said they would support lawmakers who back legalizing medical use. Kansas is one of just 12 states prohibiting all marijuana use. The Kansas House passed a bill in 2021, but it died in the Senate. Republican Senator Rob Olson has pushed for medical marijuana but says Senate leaders are thwarting efforts to legalize the drug. “But I do believe the majority of the state do want medical marijuana and I don’t see a reason why we don’t pass a bill,\" he said. Republican Senate President Ty Masterson has said medical marijuana is useful but the state must craft a law with tight regulations.\n==========\nKU Doctors Warn Mammograms Insufficient in Detecting Breast Cancer\nKANSAS CITY, Kan. (KNS) - Doctors at the University of Kansas Health System are warning that a standard mammogram might not be enough to detect breast cancer in many women. But a new federal policy could change that and cancer experts say it could be a big win for breast cancer detection. Nearly half of all women over the age of 40 who get a mammogram have dense breasts. That raises the risk of cancer and makes it more difficult to detect. A new FDA rule going into effect in September 2024 would require all mammograms to be accompanied by a breast density assessment. Onalisa Winbald is the Director of Breast Imaging at the University of Kansas Medical Center. Winbald says experts have been pushing for this change for more than a decade. “It’s been quite variable,” Winbald said, “So many patients have not been getting crucial information that could save their lives.” Winblad says ultrasounds and MRIs can help identify cancer in women with dense breasts.\n==========\nKansas Schools Prepare for Law Allowing Students to Switch Schools\nDESOTO, Kan. (KNS) - Kansas school districts are preparing for a new law that allows students attend schools outside of the district where they live. The open enrollment law goes into effect next fall. In the meantime, school districts have to develop policies for how many out-of-district students they can accept and how that will be determined. Alvie Cater with the DeSoto district says paid consultants will help estimate enrollment trends and set student-teacher ratios for each grade level. “We want to make sure we are predicting reasonably what to expect” Cater said. Most districts will hold hearings on proposed policies next month to have the policies in place by January 1st. Republican lawmakers who backed the new law say it gives families more power over their children’s education. Critics say some districts aren’t prepared for an influx of students and other districts could lose students and the funding that goes with them.\n==========\nKansas Court System Down Nearly 2 Weeks in \"Security Incident\" that Has Hallmarks of Ransomware\nTOPEKA, Kan. (AP) — Kansas officials are calling a massive computer outage that's kept most of the state's courts offline for two weeks a \"security incident\" and, while they had not provided an explanation as of Wednesday, experts say it has all the hallmarks of a ransomware attack. The disruption has left attorneys unable to search online records and forced them to file motions the old fashioned way — on paper. Courts are limping along, although the growing piles of paper are a mess that will have to be sorted and scanned eventually. \"It's really just slowed the whole system down,\" said Chris Joseph, a Lawrence-based criminal defense attorney.\nSince 2019, ransomware groups have targeted 18 state, city or municipal court systems, said analyst Allan Liska of the cybersecurity firm Recorded Future. That includes one in Dallas, where some jury trials had to be canceled this year. But state-focused attacks have been much less frequent, and have not yet rivaled what is happening in Kansas. \"We are treating this matter with the highest priority,\" Lisa Taylor, the Judicial Branch's spokesperson, said in an email Wednesday. Liska noted Tuesday that a short-lived attack in 2019 in Georgia shut down some court websites and forced some court dates to be rescheduled. A cybersecurity threat forced Alaska's courts offline for about a week in 2021. Texas' top criminal and civil courts were hit with a ransomware attack in 2020 but the filing system remained operational and trial courts weren't affected.\nIn Kansas, the first sign of trouble came on Oct. 12 when the state's Judicial Branch announced a pause in electronic filings because of a \"security incident.\" The details released since have been sparse. Taylor said only that an investigation is ongoing in response to questions of whether the courts had determined that this was a malicious attack, whether there's been a demand for a ransom or when the systems will be back up. The court system has set up a website dealing with the incident, and Taylor said its officials will cooperate with any law enforcement investigation.\nThe Kansas Bureau of Investigation said only that is is \"engaged\" in examining the problems, along with \"federal partners,\" said spokesperson Melissa Underwood. No ransomware group has come forward to claim credit for the prolonged outage, analysts said. But Liska said it is \"highly unlikely\" that this is anything but a ransomware attack. \"The fact that they're calling it a cyber incident says that it's nefarious,\" Liska said.\nNotably spared was Johnson County in the Kansas City area, the state's most populous county. It operates its own computer systems and had not yet switched over to the state's new online court system.\nThe effort to switch to a single, statewide system for tracking and managing cases started in 2018 under a 10-year, $11.5 million contract with Dallas-based Tyler Technologies. Tyler, which has similar contracts in around a dozen other states, referred questions to state court officials.\nStates have been moving toward statewide systems for more than a decades. On the security front, there are pros and cons, said analyst Brett Callow of the cybersecurity firm Emsisoft. \"On the pro side, economies of scale mean more resources should be able to be committed to protecting and securing that system,\" he said. \"On the con side, when an attack does succeed ... it's going to knock out the entire state system rather than simply an individual county or municipality.\" Additionally, if security is not adequately built in during the rollout, systems can be more vulnerable, Liska said.\nA risk assessment of the state's court system, issued last year, is kept \"permanently confidential\" under state law. But two recent audits of other state agencies identified weaknesses. The most recent one, released in July, said that \"agency leaders don't know or sufficiently prioritize their IT security responsibilities.\" With the system down, courts haven't been able to accept electronic filings, process payments, manage cases, grant public access to records, allow people to file electronically for protection-from-abuse orders and to apply electronically for marriage licenses.\nIn Sedgwick County, home to the state's largest city of Wichita, Judge Phil Journey said Wednesday that although he is known as a \"techie\" judge, he's still maintained extensive paper files. That's allowing him to move forward with his family law cases. But, he said, other judges who were more reliant on digital files are faced with postponing trials. \"All I know is that we're on paper for at least another week,\" he said. \"We'll be killing a lot of trees.\"\nIn Wyandotte County, also in the Kansas City area, the outage has caused some delays, but trials are proceeding, said Jonathan Carter, a spokesman for the district attorney's office. A massive ransomware attack last year in the county crippled key services, including the court system. Whether that is related to what is happening now is unclear.\nMeanwhile, older attorneys are finding their skills in high demand, as they teach younger attorneys to use faxes and file with paper, said Karla Whitaker, interim executive director of the Kansas Bar Association. \"The wheels of justice are turning,\" she said Wednesday. \"But I think it's just happening in a different way at a different pace right now.\"\n==========\nKansas Woman Sentenced to Prison for Role in 2020 Double Homicide\nCOLUMBUS, Kan. (WIBW) - A Kansas woman has been sentenced to prison for her role in a double homicide. Kansas Attorney General Kris Kobach says that 32-year-old Kimberly Blizzard, of Cherokee County, has been sentenced to prison for her role in the 2020 homicides of Blaze Swank and Kyle Shook. Kobach noted that Blizzard was found guilty of two counts of second-degree murder and was ordered to serve more than 27 years in prison. WIBW TV reports that another defendant in the case, Mark Hopkins II, was sentenced to life in prison for his role in the crime.\n==========\nKansas Secretary of Wildlife and Parks Brad Loveless Retiring\nTOPEKA, Kan. (KPR) — The secretary of the Kansas Department of Wildlife and Parks (KDWP), Brad Loveless, is retiring. He intends to step down upon the appointment of a new secretary in 2024. Loveless was appointed to the role in January 2019. During his tenure, the Little Jerusalem Badlands State Park and the Lehigh Portland State Park were established, and Kansas’ Flint Hills Trail was added to the National Trails System. Under his leadership, the department opened an additional research facility and successfully stocked three protected species – Plains Minnows and Neosho and Fatmucker Mussels. “Congratulations to Secretary Brad Loveless on his well-deserved retirement,” Governor Laura Kelly said. “I thank him for his commitment to conservation, to our state parks, and to ensuring Kansans can enjoy the great outdoors for generations to come. His expertise will be greatly missed.”\n==========\nAnother Mountain Lion Spotted in Kansas, This Time in the Northwest\nBREWSTER, Kan. (KWCH) - Another mountain lion has been spotted in the mountain-less state of Kansas. This time, the large predator cat was caught on camera in Thomas County, in northwest Kansas. KWCH TV reports that Wayne Luckert, of Brewster, about 20 minutes west of Colby, caught the animal on his cell phone camera. The Kansas Department of Wildlife and Parks said seeing a mountain lion in the northwest part of the state is a rare occurrence. However, another mountain lion was captured on a trail camera on the other side of the state just last week. That mountain lion was recorded near Parsons. Wildlife officials say only 60 mountain lions have been seen in the state during the past 20 years.\n==========\nReport: The Capital City of Kansas Is the Top Emerging Housing Market in the U.S.\nTOPEKA, Kan. (FOX Business News) — Topeka is ranked the highest among the top 20 emerging real estate markets and is expected to do relatively well amid the tumultuous housing market compared to the rest of the country. That's according to the Wall Street Journal and Realtor.com Emerging Housing Markets Index for Fall 2023. The index analyzes key housing market data, economic vitality and lifestyle metrics in order to determine which markets offer the highest quality of life, and where homes are expected to see future price appreciation. Fox Business News reports that Topeka is among the markets poised to fare better with sales in the midst of what is on track to become the slowest year for home buying since the housing bubble burst in 2008.\n==========\nKansas City Among Top Trending World Destinations for 2024\nUNDATED (KPR) - Kansas City is listed as one of the best destinations for travel. That's according to Lonely Planet, a leading travel guide publisher. Lonely Planet has unveiled its list of trending destinations for 2024. This year’s list highlights 50 exceptional locations worldwide, including Kansas City. The publication also lists the Midwest as tops when it comes to best value destinations.\n==========\nFormer Kansas Poison Specialist and Former Resident at Mayo Clinic Charged with Poisoning Wife\nMINNEAPOLIS (AP) — A poison specialist and former medical resident at Mayo Clinic in Minnesota is charged with fatally poisoning his wife, a 32-year-old pharmacist who died days after she went to a hospital in August with stomach distress. Authorities say Connor Bowman, 30, tried to stop the autopsy on his wife, Betty Bowman — arguing she should be cremated immediately and claiming she had a rare illness, which hospital tests did not confirm. The medical examiner's office halted the order for cremation, citing suspicious circumstances, according to a criminal complaint, and an autopsy showed Betty Bowman died from toxic effects of colchicine, a medicine used to treat gout.\nMedical records indicate she was not diagnosed with gout and had not been prescribed the medicine, the complaint states, adding that Connor Bowman had been researching the drug prior to his wife's death. Six days before she was hospitalized, he had also converted his wife's weight to kilograms and multiplied that by 0.8 — with 0.8 mg/kg considered to be the lethal dosage rate for colchicine, according to the complaint. Connor Bowman was charged Monday with second-degree murder. He was arrested Friday and was still in custody as of Tuesday. His attorney did not immediately respond to requests for comment from The Associated Press.\nMayo Clinic spokesperson Amanda Dyslin released a statement Tuesday that did not identify Bowman by name, but indicated he was a resident at the hospital. \"We are aware of the recent arrest of a former Mayo Clinic resident on charges unrelated to his Mayo Clinic responsibilities. The resident's training at Mayo Clinic ended earlier this month,\" the statement said. Dyslin did not say why Connor Bowman's training at Mayo Clinic ended. Betty Bowman was also a pharmacist at Mayo Clinic.\nAccording to the criminal complaint, the Southeast Minnesota Medical Examiner's Office alerted police to the \"suspicious death\" of Betty Bowman on August 21, a day after she died. She had been admitted to a hospital in Rochester on Aug. 16 with \"severe gastrointestinal distress and dehydration where her condition deteriorated rapidly,\" the complaint said. Her initial symptoms were similar to food poisoning and were treated that way, but they continued to worsen. She experienced cardiac issues, fluid in her lungs and organ failure.\nWhile Betty Bowman was in the hospital, Connor Bowman suggested she was suffering from a rare illness called hemophagocytic lymphohistiocytosis, or HLH. Hospital tests came back inconclusive for HLH, but Connor Bowman told multiple people that she died from that disease, according to the complaint. He also told the medical examiner's office that Betty Bowman's death was natural and that she \"did not want to be a cadaver,\" and therefore, the autopsy should be canceled, the complaint said. He asked an investigator at the medical examiner's office if the toxicology analysis would be more thorough than the analysis done at the hospital.\nThe night before Betty Bowman went to the hospital, she told a man — identified as SS in the complaint — that she was drinking at home with Connor Bowman. The next morning, she told SS she was sick, possibly from a drink that was mixed into a large smoothie.\nConnor Bowman was a poison specialist and answered calls about poisons, using devices from the University of Kansas for his work, according to the complaint. A woman from the University of Kansas told investigators that Connor Bowman had been researching colchicine, the drug used to treat gout, though he had not received any calls about colchicine, nor had any other employees.\nInvestigators found that Connor Bowman had searched \"internet browsing history: can it be used in court?\" and \"delete amazon data police\" on Aug. 5. He did calculations that match the lethal dosage rate for colchicine on August 10. The Minnesota Department of Health found colchicine in Betty Bowman's blood and urine samples that were taken at the hospital, and the medical examiner determined the cause of death to be toxic effects of colchicine, the complaint says.\nOne woman told investigators that the Bowmans had been talking about divorce, and another told authorities that Connor Bowman said he was going to get $500,000 in life insurance from his wife's death, the complaint says. Authorities found a receipt for a $450,000 bank deposit inside his home. He is scheduled to appear in court on November 1.\n==========\nKansas Liver Donor Helping Increase Number of Live Liver Transplants\nUNDATED (KNS) — Medical experts say increasing the number of liver transplants that use organs from living donors could help more Americans access lifesaving transplants. The University of Kansas Health System plans to join a growing number of hospitals that offer the procedure. The vast majority of liver transplants use organs from a deceased donor. But that’s starting to change. (Read more.)\n==========\nManufacturing Council: Coolest Thing Made in Kansas? Cheese Curds\nTOPEKA, Kan. (KPR) - What's the coolest thing made in Kansas? According to the Kansas Manufacturing Council, the answer is... cheese curds. In an annual contest sponsored by the Kansas Manufacturing Council, Alma Cheese Curds from the Alma Creamery was the BIG winner of this year's People's Choice Award. The winner was announced after weeks of voting. More than 30,000 people cast votes in this year's contest. This year's competition started with 58 products made in the Sunflower State. Other finalists in this year's contest: products made by Catepillar Works Tools in Wamego, Plainscraft, LLC in Topeka and Acoustic Sounds of Salina.\n==========\nSporting Advance to Next MLS Play-Off Round\nKANSAS CITY, Kan. (KNS) - After winning in a penalty shootout against San Jose Wednesday night, Sporting Kansas City advanced to the next round of the playoffs in Major League Soccer. The game was scoreless after regulation and Sporting outscored the Earthquakes, 4-2, in the penalty kick shootout. Goalkeeper Tim Melia is now 5-and-0 in penalty kick shootouts while with Sporting and earned the praise of team manager Peter Vermes. “He’s the best I’ve ever been around both player and coach in regards to penalty kicks.” Vermes said, “He’s absolutely incredible.” The win means Sporting will cross Missouri for the next round when they play a best-of-3 series against St. Louis City, the No. 1 seed in the Western Conference. The Sunday night game in St. Louis will start at 9:00 p.m..\n==========\nChiefs Linebacker Nick Bolton Has Surgery on Fractured Wrist in Los Angeles\nKANSAS CITY, Mo. (AP) — The Chiefs' Nick Bolton had surgery in Los Angeles on his fractured wrist this week, though coach Andy Reid said Wednesday he was not sure whether the linebacker would land on injured reserve or how long he might be out. Reid said there was no need during Tuesday's procedure for metal to be put into the wrist to support it, and that could help Bolton return to the field quicker. He already has missed three games this season because of an ankle injury. Bolton was hurt making a tackle in last Sunday's win over the Chargers. The Chiefs visit the Broncos on Sunday.\n==========\nFast Starts by the Chiefs and Eagles Raise Possibility of a Rare Super Bowl Rematch\nKANSAS CITY, Mo. (AP) — Kansas City and Philadelphia are setting the stage for the possibility of a rare Super Bowl rematch. The Chiefs and Eagles both have won six of their first seven games and are tied for the best record in the NFL. This is just the sixth time that the two teams that played in the Super Bowl the previous season are tied for the best record in the NFL entering Week 8 or later. One of the previous times it happened was 1993 with Buffalo and Dallas on the way to the only Super Bowl rematch.\nBuffalo and Dallas finished the season tied for the best record at 12-4 a year after playing in the Super Bowl. They met again in the Super Bowl that season, with the Cowboys repeating as champions in the only time the same two teams met in the Super Bowl in back-to-back seasons.\nThe win over the Chargers gave the Chiefs a three-game lead in the AFC West — just the fourth time in the past 10 seasons that has happened after seven weeks. Kansas City already has won division games against Denver and the Chargers to improve to 29-3 against division opponents with Patrick Mahomes at quarterback. Mahomes' .906 winning percentage in the division is the best of any QB since the merger with at least 20 starts, far outdistancing Dak Prescott's .800 mark for Dallas against the NFC East. The 28-year-old Mahomes had his sixth career game in the regular season or playoffs with at least 400 yards passing and four TDs. The only players with more in NFL history are Peyton Manning (nine) and Dan Marino (eight).\nThe Eagles got to 6-1 by beating Miami 31-17. Receiver A.J. Brown had his fifth straight game with at least 125 yards receiving, tying Calvin Johnson (2012) and Pat Studstill (1966) for the longest streaks ever.\n==========\nThis summary of area news is curated by KPR news staffers, including J. Schafer, Laura Lorson, Tom Parkinson and Kaye McIntyre. Our headlines are generally posted by 10 am weekdays and updated throughout the day. These ad-free headlines are made possible by KPR members. Become one today. And follow KPR News on Twitter.",
  "word_count": 3748,
  "scraped_at": "2026-02-14T12:17:03.149802"
}