{
  "article_id": "b7dd13d84579",
  "url": "https://www.theguardian.com/business/2023/jun/07/labour-donor-dale-vince-influence-access-ecotricity-just-stop-oil-sunak-starmer",
  "title": "Labour donor Dale Vince :  I do want to influence policy but not by buying acces | Dale Vince",
  "date": "20230607T220000Z",
  "domain": "theguardian.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Dale Vince has been condemned in the rightwing press as a hippy turned eco-tycoon who donates thousands of pounds to Just Stop Oil – and even more to the Labour party. And now Rishi Sunak has doubled down on the attacks and claimed that it appears that “eco-zealots” at the campaigning group are writing Labour’s energy policy and “essentially leading us into an energy surrender”.\nSpeaking before the prime minister’s comments, Vince, the founder of Ecotricity, told the Guardian that the “abuse, mudslinging and massive fabrications” he had faced would not stop him bankrolling causes close to his heart.\n“I give money to Extinction Rebellion as well and to Animal Rising, the people that disrupted the Grand National,” he said. “Also, I’ve given money to Greenpeace, to Sea Shepherd, to a women’s refuge in Stroud. I fund food banks, I give jobs to homeless people. I’ll give money to the Green party, the Lib Dems, everybody that’s trying to do some good in the world.”\nVince, 61, has given at least £1.5m to Labour over the last 10 years. On Tuesday, Sunak said the donations indicated that Vince was responsible for Labour’s energy policy, including its decision to ban new licences for North Sea oil and gas projects.\n“It does appear that these eco-zealots at Just Stop Oil are writing Keir Starmer’s energy policy,” he said when asked about the donations while on his way to Washington DC. “Not content with disrupting our summer and cherished sporting events, they are essentially leading us into an energy surrender.”\nLast week, Vince brushed off Tory attacks by announcing he would match any money given to Just Stop Oil for 48 hours. The stunt raised £340,000.\nHe said he was not sure how much in total he had donated to the direct-action group, which caused havoc at a rugby union final and the Chelsea flower show last month. “I gave them some money to get started a while ago. Tens of thousands, might have been 50, I’m not really sure. The numbers don’t really matter to me,” he said. What about a ballpark figure? “Well, with what’s happened [last] week, it’s going to run to some hundreds of thousands.”\nVince said he had faced horrible slurs since revealing last week that he had had a telephone conversation with Keir Starmer in May. Senior Tories claimed the pair’s “secret” talks happened days before Labour announced its North Sea plans.\nVince said the idea that he had shaped the policy was “completely untrue”. “[Starmer] rang to thank me for a donation that’s not been made yet, but the commitment’s been made,” he said. “This phone call had been planned for several weeks and we kept missing each other. It wasn’t a big deal. He just wanted to say thanks, and I’m like: ‘You’re welcome, I really want you to win the election, it’s the most important thing.’” He said he also spoke to Ed Miliband and Jeremy Corbyn when they were leaders of the party.\nVince does want to influence policy but not by buying access, he said. “Every time I give them money, and I’ve been doing it for years, I don’t ask for anything, I don’t want anything, and I make that clear.\n“I do want to influence policy by doing the things that I do. For example, I’ve got a green gas mill that goes live in Reading next month. We published a plan, I shared it with the Conservative party, I shared it with the Labour party. We published a study that shows there’s enough grass in Britain to make all of the gas we need and as a serious alternative to the bonkers national heat pump idea that the government have. And so I do want to influence policy in that way and in that respect, but not by buying access.”\nVince founded Ecotricity, the UK’s first green energy company, in 1996 after living off-grid for a decade. In 2011, the Sunday Times valued the business at £100m. Vince said that was “probably” accurate – “Maybe it is. I don’t even care” – while stressing it was a not-for-dividend company without investors or shareholders.\n“It’s like one of those paper fortune things,” he said. “I don’t have anything remotely like that in the bank. I usually have a few thousand pounds in the bank. I’ve got one current account, no savings account, no pensions, no property, no investments. I don’t live in a way that you might imagine if you just buy simply into the story that I’m worth £100m, or have £100m rather.”\nBorn in Great Yarmouth in Norfolk in 1961, Vince dropped out of school at 15. He “dropped out” of society in the 80s because he didn’t want to live in “a conventional way”, he said. “I didn’t want a job, and without a job, living in town, you’re economically marginalised. I discovered the possibility of living on the road, which transformed that. I lived for a decade in a variety of different vehicles – buses, trucks and stuff that I kind of built or rebuilt myself.”\nHe “dropped back in” in the early 90s in Lynch Knoll, Gloucestershire, with a little windmill on the roof of his trailer. “I decided that I could have more impact if I tried to build a big windmill on the hill I was living on at that time and tried to change the way electricity was made because it was the biggest single source of carbon emissions in our country. And that was the start of the whole Ecotricity mission,” he said.\nThe twice-married father of three went on to build Britain’s first electric supercar in 2008, and became the chair of Forest Green Rovers, the world’s first vegan, carbon-neutral football club, in 2010.\nVince, who lives in a boat in Tewkesbury, said he did not have a corporate alter ego. “I don’t have like a business or professional life and a [separate] personal life. So I won’t fly, I don’t eat animals, I haven’t done that for like 40 years. My favourite form of transport is my electric motorbike [a Harley-Davidson] but I do have an electric car [an Audi] as well.” (He said the last flight he took was in 2018, to Cop24 in Poland, where he launched the Sports for Climate Action initiative.)\nVince believes the next general election will be “the most important in our lifetimes”. He is supporting Starmer, who has condemned Just Stop Oil’s tactics as “wrong” and “arrogant”.\nDoes Vince believe the group’s methods are effective? “I don’t know. But one thing it is doing is creating conversations, creating coverage and creating opportunities to speak about it,” he said.\nHow would he feel if he or a loved one was affected by disruption from one of their protests? “The climate crisis is having a way bigger impact than a bit of inconvenience,” he said. When pressed, he quickly added: “I’d accept it. I’d be a massive hypocrite if I didn’t, wouldn’t I? And I’m not.”",
  "word_count": 1172,
  "scraped_at": "2026-02-14T12:54:44.776763"
}