{
  "article_id": "b7defcf7c89a",
  "url": "https://www.dailymail.co.uk/news/royals/article-15553795/A-Kate-surprise-Princess-Wales-pays-unannounced-visit-London-school-mark-Childrens-Mental-Health-Week.html",
  "title": "Playtime with Kate ! Princess Wales delights youngsters on a surprise visit to a London school to mark Children Mental Health Week",
  "date": "20260212T143000Z",
  "domain": "dailymail.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "- The Princess of Wales made a visit to a school in Croydon\n- READ MORE: Prince and Princess of Wales thank courageous students and staff for their 'selflessness in the face of violence'\nThe Princess of Wales joined flag-waving young children making 'belonging maps' at a primary school to highlight the importance of children's mental health.\nCatherine visited Castle Hill Academy in New Addington, Croydon, on Thursday to mark Children's Mental Health Week in her role as patron of the charity Place2Be.\nShe chatted to the youngsters about the importance of expressing their emotions, asking what made them feel good and safe.\n'Do you like to talk about your feelings, your sense of belonging?' she asked, adding: 'Sometimes it's hard to talk about your thoughts and feelings.'\nThe princess, who admitted she was 'too busy chatting' to make her own map, asked whether the children did arts and crafts at home, telling them: 'It's good to be messy, it's good fun.'\nNew Addington in south London is one of England's most deprived communities with high levels of poverty, youth violence and unemployment.\nCastle Hill Academy works in tandem with the charity Place2Be, of which the Princess is patron, in order to help build trusted relationships, using creativity and play.\nThe princess, wearing a brown trouser suit, was met on arrival by Katy Peart, the school's head, Catherine Roach, chief executive of Place2Be and Col Ray Wilkinson, deputy lieutenant for Croydon.\nThe Princess of Wales has made a surprise visit to a school in Croydon - where she got stuck into arts and crafts with young pupils to highlight Children's Mental Health Week\nKate, 44, beamed while chatting to students at Castle Hill Academy - for her work as patron of mental health charity Place2Be\nKate spoke to pupils, many of whom presented her with cards, during her surprise visit this afternoon\nKate enjoyed some arts and crafts - and also games - during the visit, where she also got to chat to pupils\nKate, a Patron of Place2Be, a UK children's mental health charity, visited Castle Hill Academy in New Addington, Croydon\nShe was shown into the garden of the nursery attached to the school, noting how important it was for children who do not have their own outdoor spaces at home.\nShe joined a group picking up miniature pom poms with tweezers. 'Can I have a go? Is it hard?' she asked. 'What's your favourite colour? I love green, it reminds me of nature and being outside.'\nThe Early Years outdoor play space was funded by Deloitte, a member of The Royal Foundation Business Taskforce for Early Childhood, and is designed to promote emotional regulation, sensory exploration and creative play.\nThe taskforce was founded by the princess in March 2023 and aims to encourage business leaders to champion the social and emotional development of employees.\nInside, the princess sat down with a small group including Nayar, a foster mother who has two daughters at the school, Nikita, whose daughter has counselling with Place2Be and Anisha, whose husband died when their son was in reception.\n'The children must love being outside and being able to use all the activities,' she said. 'What has it meant to you as parents?'\nAnisha described how her son had blossomed with the support he had received since the death of his father.\n'I'm so sorry for your loss but being able to have that support and see how he's thriving just shows the incredible work that's going on,' the princess said.\nKate smiled as she received cards from the pupils\nShe was all smiles as she was greeted with crowds of wellwishers\nHer Royal Highness also visited the school's Art Studio, where she joined children taking part in the official Children's Mental Health Week art project\nPhotos from the outing also showed delighted pupils lining up to gift the princess with flowers, which she gratefully accepted\nKate smiled and waved as she made her visit this afternoon\nLater, Kate met with the academy's leadership team. The visit included discussions on Place2Be's 'whole-school approach to supporting children's mental health, as well as the unique challenges facing children and families in New Addington'\nAn excited Kate surprised children at the school with a visit, and joined in for some arts and crafts\nThe Princess of Wales pictured during a visit to Castle Hill Academy in New Addington, Croydon\nThe future Queen listened and chatted with pupils during the outing, which took place this afternoon\nThe royal was all smiles as she coloured in and cut up carboard and tissue paper with the children\nKate smiled as she laughed along with pupils taking part in Children's Mental Health Week 2026\n'Just focusing on their emotions unlocks so much potential for them, not only with their work but their relationships.'\nAs the princess walked through the playground into the main school grounds she was greeted by an enthusiastic crowd of children waving flags designed around the theme of kindness.\nShe stopped to shake many of their hands, reading their flags and telling them she was 'very impressed' with their work.\nIn the art room, she joined children aged between nine and 11 taking part in the official Children's Mental Health Week art project - creating 'belonging maps' to consider the people, places and experiences that help them feel secure and connected.\n'These are the things that you like, that give you a sense of belonging?' she said as she took a seat at the table.\n'I love this room,' she enthused. 'How often do you come into this room?' The princess noted that it was good to use art to 'work out some personality and identity'.\nLooking at one child's map, she said: 'Kindness is key; that's a very important message isn't it? Gosh you are talented.'\nBefore leaving, the Princess met members of the school and Place2Be leadership team to discuss their 'whole-school' approach to supporting children's mental health, as well as the specific challenges facing families in New Addington.\nThe royal also met with parents who have benefitted from the organisation's support, and paid a visit to the school's art studio\nThe attentive royal was all ears as she heard from the leadership teams during her visit to the school\nShe asked how easy it had been to bring the parents on board with the Place2Be ethos and whether they worked out in the community as well as on site.\n'Social and emotional development and relationship building, making it ingrained in the culture, is what's going to make a difference,' she said. 'Making it more than linear.'\nIn a personal message posted on Kensington Palace's social media channels after the visit, the Princess said: 'This year's Place2Be Children's Mental Health Week is about the importance of belonging. It can be easy to overlook the importance of the things that matter most; love, care and time spent together. Belonging and connection is so important, and is a fundamental part of early childhood development.\n'As Patron of Place2Be, I am incredibly proud of the work they do to support families and communities to nurture children and young people.'",
  "word_count": 1191,
  "scraped_at": "2026-02-14T12:37:59.055962"
}