{
  "article_id": "b7e170df596c",
  "url": "https://combatpress.com/2016/01/toe-to-toe-ufc-on-fox-18-preview-and-predictions/",
  "title": "UFC on Fox 18 : Johnson vs . Bader Preview and Predictions",
  "date": "20250225T210000Z",
  "domain": "combatpress.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "The UFC returns to broadcast television for the first time in 2016. UFC on Fox 18: Johnson vs. Bader takes place at the Prudential Center in Newark, N.J., on Saturday, Jan. 30. The promotion is hoping to build on two incredible championship main events — welterweight champ Robbie Lawler eked out a controversial split decision win over Carlos Condit at UFC 195 and new UFC bantamweight champion Dominick Cruz topped T.J. Dillashaw in a closely contested striking battle at UFC Fight Night 81 — to start off the year..\nThe four-fight Fox main card is headlined by what is widely considered to be the light heavyweight No. 1 contender fight between Ryan Bader and Anthony “Rumble” Johnson. The surging Bader is on the best run of his career. He has won five straight, including victories over top-10 fighters Rafael “Feijao” Cavalcante, Ovince St. Preux and Phil Davis. Bader, 32, is coming off the best win of his career over former UFC light heavyweight champion Rashad Evans. Johnson made a strong return to action at UFC 192 when he stopped Jimi Manuwa with a right hook in the second round. Rumble was devastated when he fell short in his title bid against Daniel Cormier at UFC 187. Before the loss, Johnson had won nine straight fights since he was cut from the UFC after a weight-cutting debacle plagued his UFC 142 bout with Vitor Belfort. Johnson earned knockout victories over Antonio Rogerio Nogueira and Alexander Gustafsson, and won a dominant decision over Phil Davis in his return to the Octagon. The winner of the five-round light heavyweight showdown can certainly make a case for being the division’s top contender with the returning Jon Jones being first in line to challenge for the title.\nThe co-headliner of the evening features what might have just become the No. 1 contender fight for the next heavyweight title shot. Cain Velasquez had to pull out of his UFC 196 championship bout with a back injury, prompting the promotion to put Stipe Miocic in his place to fight UFC heavyweight champion Fabricio Werdum on just two weeks’ notice. The injury to Velasquez and unexpected title shot for Miocic gives way to either former UFC heavyweight champion Josh Barnett or the budding self-promoter Ben Rothwell to earn the next shot at the winner of Werdum and Miocic. Rothwell is riding a three-fight winning streak heading into the bout with finishes over Alistair Overeem and Matt Mitrione. Barnett successfully returned against top-10 fighter Roy Nelson at UFC Fight Night 75 in Japan after a nearly two-year absence.\nTwo prospects look to continue their hot streaks in their third UFC contests as Sage Northcutt and Jimmie Rivera make their UFC main-card debuts. Northcutt takes on late replacement Bryan Barberena after his original opponent, Andrew Holbrook, pulled out of the bout with an injury. Rivera takes on top-15 bantamweight Iuri Alcantara in yet another step up in competition.\nThe six-fight preliminary card on Fox Sports 1 is headlined by a welterweight showdown between former Strikeforce welterweight champion Tarec Saffiedine and the heavy-hitting Jake Ellenberger. The Ultimate Fighter Nations runner-up Olivier Aubin-Mercier clashes with exciting grappler Carlos Diego Ferreira. Rafael Natal looks to extend his winning streak to four against former RFA champion Kevin Casey. Top-10 flyweight Dustin Ortiz will tangle on the mat with former EliteXC bantamweight champion Wilson Reis. Gritty veteran George Sullivan is fighting for his fourth win in five UFC fights when he takes on Russian welterweight Alexander Yakovlev. Alex “Bruce Leroy” Caceres looks to end his three-fight skid against TUF Latin America cast member Masio Fullen.\nThe UFC Fight Pass prelims begin at 3:30 p.m. ET. The UFC on Fox Sports 1 preliminary card begins at 5 p.m. ET, and the main card airs live on Fox at 8 p.m. ET. Combat Press writers Chris Huntemann and Zach Aittama preview the card in this edition of Toe-to-Toe.\nRyan Bader can’t seem to earn any respect. He’s been passed over for a title shot in the past, but he’s on a five-fight winning streak and is widely considered a frontrunner to challenge for the UFC’s light heavyweight belt. Can he get past his latest test, Anthony “Rumble” Johnson, and become the undeniable next challenger? Will he still hold that status if Jon Jones reclaims the belt, or will this scenario lead to Bader getting passed over once again?\nHuntemann: In order to answer this question, let’s take a look at the current light heavyweight rankings in the UFC. The only other person who could make an argument for a title shot is Glover Teixeira. Not only did he beat Bader head-to-head in 2013, but he’s on a two-fight winning streak with both victories coming via finish. However, Bader boasts a victory over someone to whom Teixeira lost: former UFC competitor Phil Davis.\nBader’s time is now. If he defeats Johnson, he should be named the No. 1 contender and retain that role even if Jones regains the light heavyweight title from Daniel Cormier. Cormier shouldn’t receive a rematch were he to lose to Jones, since it would actually be the second consecutive time Jones defeated him. As we saw with Ronda Rousey and Miesha Tate, the UFC is reluctant to give a fighter a third crack at an opponent he or she previously lost to twice.\nBader hasn’t been flashy during his winning streak. All of his victories have come via decision. But as the famed NFL coach Bill Parcells once said, you are what your record says you are. Bader’s record says he’s undefeated in his last five fights against stiff competition.\nWhat’s my prediction? Bader wins again, this time by submission. Cormier exposed Johnson badly in their fight last year, surviving Johnson’s power before wearing him down on the ground and securing a rear-naked choke victory. Johnson’s cardio is still very much in question, whereas Bader is advanced in that department. Johnson’s ground game is also very suspect. If he keeps the fight with Bader standing, he has a chance. But if Bader uses his wrestling prowess and gets Johnson down, then Rumble will turn out to be nothing more than a quiver (see what I did there?).\nAittama: I’m not nearly as confident in Bader’s wrestling and submission offense. In fact, I’m not confident Bader’s vast improvement of his jab and overall striking skill is enough to stay afloat on the feet without using his wrestling in some manner. The problem is, Johnson is an extremely athletic fighter who doesn’t give up takedowns without a dog fight. That’s exactly what Bader is going to have to do if he wants to win. Bader needs to grind this fight inside, in the clinch, and, for his own sake, the ground, but that’s easier said than done against a fighter who defends nearly four out of every five takedown attempts.\nBader has put together an impressive run against top-tier fighters like Rashad Evans, Ovince St. Preux and the aforementioned Davis. He has shown improvements in his overall fight game, most notably adding a crisp jab and improved footwork. The hard work at the MMA Lab is apparent in Bader’s continued improvements in his game-planning and execution come fight time. His fight IQ seems to have improved with his building confidence and positive overall mental state. He’s coming off one of the best performances of his career against one of his toughest opponents to date. Bader landed almost twice as many strikes as his top-five opponent, even taking one of the best wrestlers in the division down to show off his superior wrestling ability and improved in-fight knowledge. Bader has all but locked up the title of No. 1 contender with a win, but that’s where the problem lies.\nEven though Bader has landed the second most takedowns in UFC light heavyweight history, he will have to contend with a fellow collegiate wrestler, albeit a junior college athlete. Bader won two All-American awards during his time with Arizona State University. Johnson won a JuCo National Championship in 2004 with Lassen Community College. Johnson’s greatest strengths while defending a takedown are his shear size and strength. Johnson kept Cormier at bay on multiple takedown attempts, easily fending off the champ and getting back to his feet. Johnson only conceded a ground position after being picked up clear off of his feet and slammed back down in the middle of the Octagon in the second round.\nJohnson’s takedown defense couldn’t save him in the third round when a takedown of his own was reversed by Cormier. The current champion executed a snap-down against the cage and quickly took back control and eventually the neck of his final obstacle before winning the title in his second attempt. The loss came in the third round, but Johnson actually lost the fight the round before. After Cormier was able to pick Johnson off of his feet and move him away from the cage, Cormier controlled Rumble for three and a half minutes, smashing punches and elbows into the face of his opponent. Cormier picked up the elbows in the final 30 seconds of the round, putting on an absolute clinic on how to control an opponent from the top position. Johnson’s will was tested and it looked like he failed. His corner had to ask, “Do you want it or not?” as Johnson was standing up off of his stool for the third round. The fight brought up major questions — questions my colleague has brought up as well — with Johnson’s grappling during the championship bout.\nJohnson was poked in the eye in the first five seconds of the fight. While I don’t believe this played much of a factor, if any, the damage to the eyes of Johnson began with this exchange. Shortly after the eye poke, Johnson floored the hard-headed Cormier with a right hand just 30 seconds into the first round. Cormier couldn’t take Johnson down for long and, after a brief exchange against the cage, Johnson landed a flush head kick to the side of Cormier’s head. Johnson started out much the same in the second round, hurting Cormier with a counter right hand and devastating left head kick that wobbled him. Despite the loss, Johnson showed what made him successful in the past. He just so happened to be fighting one of the toughest fighters in the division on this occasion.\nThe question of if Johnson could come back from such a devastating defeat was answered in his return bout against striker Jimi Manuwa at UFC 192. Rumble, who lands 3.21 significant strikes per minute, has nearly tripled all six of his past opponents’ striking outputs in his past six wins. He did the same against Manuwa. Johnson dropped Manuwa in the first round before dominating the wrestling exchanges for a one-sided start to the fight. Johnson made quick work of Manuwa in the second round with his 12th knockdown (tied for third among active UFC fighters) and ninth knockout victory (tied for fourth all time).\nThis is where my colleague and I differ. I don’t believe Bader has the ability to keep Johnson at bay if the fight stays on the feet for the duration. Johnson is a patient striker who picks his openings and explodes. He is a sound defensive fighter with an underrated kicking arsenal and devastating hooks that he throws whenever his opponent comes inside of his punching range. Bader currently has the best significant striking defense in the UFC at 72.5 percent. This number is due to be lowered when he starts to exchange with Johnson. Bader needs to get to work with his jab and at the very least fake a takedown attempt or two to get Johnson second guessing his counter striking. Bader tends to circle off to the power hand of Johnson, leaving no room for even one mistake.\nThe fight will play out on the feet until Bader feels Johnson’s power. The last two times that Bader fought a superior striker, he took his opponent down at a very high pace, landing nine takedowns against St. Preux and seven against Cavalcante. Bader won’t have success getting takedowns in this fight, though. Instead, he’ll make a mistake and get finished for the fifth time in his career, moving Johnson back into the title picture, especially if Jones beats Cormier in his return to the division.\nJosh Barnett has been pretty inactive in the UFC lately. He did return in September, following a nearly two-year absence, and scored a victory over Roy Nelson. Is Barnett still capable of making a run at heavyweight gold, or is he merely a big-name stepping stone for opponent Ben Rothwell en route to a Rothwell run at the championship?\nAittama: Barnett has been near the top of the heavyweight division for the past 15 years. He won a UFC title in 2002 when he stopped Randy Couture at UFC 36. He made it to the finals of the Pride Fighting Championship’s 2006 Openweight Grand Prix, losing to Mirko “Cro Cop” Filipovic after defeating Antonio Rodrigo Nogueira, the only man to hold both a Pride championship and a UFC title in the sport’s history. Barnett continued his dominance in the now-defunct promotions Sengoku and Affliction before entering the 2012 Strikeforce Heavyweight Grand Prix. He toppled over his quarterfinal and semifinal opponents to meet current UFC light heavyweight champion Daniel Cormier in the five-round final. Despite coming up short, Barnett continued to prove he was among the very best heavyweights in the world. After Zuffa acquired Strikeforce in 2011, Barnett made his way back to the UFC for the first time since his championship win against Couture. Barnett crumbled former UFC heavyweight champ Frank Mir in the first round at UFC 164. He was then knocked out by top-10 heavyweight Travis Browne in his next bout at UFC 168.\nThat’s when Barnett took his absence from the sport. The champion went back to the drawing board. When Barnett was outside of the Octagon, he earned submission victories over Dean Lister and Ryron Gracie in Metamoris. He returned to the Octagon at UFC Fight Night 76, in Japan, a place where he had spent much of his career. Barnett fought through the heavy right hand of Nelson and completely dominated the entirety of the five-round main event. The dominant performance showcased what Barnett had been working on in his absence from the cage. Barnett’s striking kept Nelson at bay. He used his expert clinch work to get inside and keep Nelson against the cage. Barnett landed heavy uppercuts, knees and kicks that wore down the former top-10 heavyweight.\nRothwell is still riding the momentum of his upset win over Alistair Overeem at UFC Fight Night 50 in September 2014. Rothwell countered an Overeem hook with his own right hook that connected on the temple of the former Strikeforce heavyweight champion. The knockout win is sandwiched between finish wins of current ONE Championship heavyweight champion Brandon Vera and, most recently, a first-round submission of Matt Mitrione in June 2015.\nRothwell has built his own unique form of self-promotion, to say the least, after he has had his hand raised in his past three fights. The “Rothwell Dance” and strange voice during interviews are bordering on being defined as a pro-wrestling schtick. Can Rothwell talk his way into a title shot with a win over Barnett? Sure, he may be able to, but he has to win the fight first, which is a much tougher task than it was against his last three opponents. Rothwell is a well-rounded fighter with ever-improving striking and a surprising submission offense, but the problem is Barnett is better in every aspect of mixed martial arts.\nBarnett is going to head into this fight as the favorite and deservedly so. He will close the distance and work his incredible clinch-striking arsenal. After an increasingly devastating workload from Barnett in the clinch, he will find his spot, whether it be on the feet or on the ground, and put an end to Rothwell’s night and three-fight winning streak.\nHuntemann: UFC’s heavyweight division has sorted itself out over the last month or so, with Stipe Miocic the contender of the moment after his devastating knockout of Andrei Arlovski earlier this month. In fact, he is now the top contender after he stepped in to replace Cain Velasquez against Fabricio Werdum at UFC 196. It’s probably good that this happened when it did. The UFC’s title shots are constantly in flux, which is to say that there is no set criteria for who gets one — they are seemingly handed out like party favors sometimes.\nSo, in that sense, yes, “The Warmaster” is still a viable contender in the heavyweight division. His latest stint in the UFC has been modestly successful so far. He has a 2-1 record, and the only loss came to the tough (and probably dirty) Browne.\nHowever, Rothwell wins this fight. He’s claimed three in a row and four of five overall, including a victory over Overeem, who’s jockeying for a title shot of his own. Rothwell seems like a newly motivated fighter who understands that not only is it performance that determines success, but also presence. His post-fight interview with Jon Anik after his last victory over Matt Mitrione proved that. His Darth Vader-esque persona gives fans a reason to care about him, and a victory over Barnett gives him a stronger case for a title shot.\nJimmie Rivera extended his winning streak to 17 professional fights after a split decision nod over fellow prospect Pedro Munhoz in November. Can Rivera keep on rolling and pick up his first top-10 win against Iuri Alcantara, or will Alcantara, an 11-fight UFC veteran, show his all-around skill and stop Rivera’s momentum?\nHuntemann: Sure, why not?\nI’ll be honest. I’m not all that familiar with Rivera. But his record doesn’t lie. He only has one loss in his career, which came five years ago and perhaps under less than ideal circumstances. He’s already been around the block as well, sandwiching two stints in Bellator around appearances in some of the better-known regional MMA promotions.\nAlcantara is no slouch either. He has already faced fighters like Urijah Faber, Frankie Saenz and Wilson Reis. However, Rivera seems to be a star on the rise. I see no reason why his light won’t keep shining bright here. The cream, as they say, eventually rises to the top.\nAittama: Rivera made a splash in his UFC debut on just three weeks’ notice at UFC Fight Night 72 in Scotland. The 26-year-old replaced Ian Entwistle, who withdrew from the bout due to injury. “El Terror” made quick work of Marcus Brimage, stopping him in under 90 seconds as a rare favorite making his UFC debut on short notice. It took only one Rivera right hand to stun Brimage just over a minute into the fight. The aggressive fighter pursued his wounded opponent and put him away with a series of heavy, alternating hooks against the cage.\nThe Tiger Schulmann product came into his bout with former RFA champion Pedro Munhoz as the underdog. After a hard-fought 15 minutes, Rivera upset the highly touted prospect by split decision. Rivera out-landed Munhoz at a 3-to-2 pace, amasing 96 significant strikes and improving his astounding significant strikes landed per minute number to 6.73. Rivera is a well-rounded fighter who put together a long winning streak, not counting his exhibition loss to future top-10 featherweight Dennis Bermudez in the entry round of The Ultimate Fighter 14.\nAlcantara has now spent significant time inside the Octagon since he was brought in with Zuffa’s purchase and addition of the World Extreme Cagefighting roster. The 35-year-old had just one WEC fight, a first-round knockout win over current top-10 featherweight Ricardo Lamas at lightweight. Alcantara won his first two UFC bouts before dropping his third fight against Nova União prospect Hacran Dias. The Brazilian dropped to bantamweight in his next bout. “Marajó” found success in his newly found division, winning six of his next eight fights, and falling short to only the aforementioned Faber and Saenz.\nAlcantara is a well-rounded fighter who starts quickly in almost every fight. He uses his aggressive striking style to hurt his opponents and then wrap them up with lightning-quick submissions. He has shown weakness in between his offensive output, which could create a dangerous opening for the much younger fighter, who is looking for the best win of his career. Rivera will weather the storm, stay the course and get the decision win after a tougher-than-expected battle with his first top-10 opponent.\nIt’s no secret that the UFC wants to make Sage Northcutt its next big star. It even appeared that he and UFC women’s strawweight Paige VanZant were hand-in-hand on the fast track to stardom, before VanZant was brutally derailed by Rose Namajunas. Northcutt is now facing a new opponent on short notice. Is he on his way to becoming the next “big thing” in the UFC? Or will he deal with the same obstacle VanZant faced when finally matched with an opponent who can match and surpass his skills?\nAittama: Northcutt certainly has all of the tools most pundits want in an up-and-coming MMA prospect. He is a superior athlete with an ever-developing skill set in all aspects of the sport and enjoys the backing of the promotion. Northcutt is getting the added benefit of a promotional push that led ohim t training opportunities like his trip to the Tristar gym in Montreal. At just 19 year old, Northcutt has time to develop. However, while the strong push from the UFC is increasing Northcutt’s paycheck — and at the dismay of other top-caliber fighters — it may also have negative effects on his development.\nOne of the most important tools for a fighter heading into a major bout is his mental state. Northcutt seems to believe in himself just as much as his droves of fans, if not more. He does have plenty of negative feedback as well, catching heat from top-10 fighters Aljamain Sterling and Nate Diaz. Northcutt is still feeling the momentum of being the first fighter plucked off of the new UFC Fight Pass reality show Lookin’ for a Fight featuring UFC President Dana White and former UFC welterweight champ Matt Serra. Northcutt’s UFC debut only catapulted his star further. He made quick work of the clearly overmatched Francisco Trevino, knocking him out in just 57 seconds. Northcutt rode the momentum into his main-card fight with Cody Pfister at UFC Fight Night 80. Pfister’s toughness pushed Northcutt in the first round, but the young budding talent snapped up a guillotine choke to start the second round, thereby continuing his seven-fight winning streak.\nNorthcutt was scheduled to face Andrew Holbrook in this bout before Holbrook was pulled due to injury. With just two weeks’ notice, two-time UFC veteran Bryan “Bam Bam” Barberena steps in to attempt to stop the hype of Northcutt. Barberena, 26, is an MMA Lab fighter with a well-rounded skill set and two impressive Octagon performances under his belt. Barberena shocked many when he knocked out Jake Ellenberger’s brother Joe in the third round of his UFC debut at UFC on Fox 13. Barberena returned in enemy territory at UFC 186, where he lost a close decision in the evening’s “Fight of the Night” against Canadian slugger Chad Laprise.\nBarberena adds intrigue to this match-up against the highly touted phenom. Northcutt might just have difficulty finishing his opponent, giving us a little peak into many aspects of Northcutt’s MMA game that we haven’t been lucky enough to see yet. Northcutt last fought just over a month ago, so will this be enough time to improve his skill or just refine what he already brings to the Octagon? Northcutt is well-rounded, but his skill set is still developing. He can improve in many areas of the fight game. It’s trial by fire just three fights into his career, despite the oddsmakers lopsided views on the fight. Barberena has just enough grit, durability and skill to get out of the early exchanges ahead and work his way toward a decision victory. The big question is, how will Northcutt adjust when he faces resistance? Will a champion arise, or we will see Northcutt humbled early into his professional career?\nHuntemann: Northcutt definitely has some talent. You don’t go 7-0 with seven finishes to start your MMA career if you don’t. In this instance, I don’t think being discovered on a reality series will work against him. While he looks like a cast member of America’s Next Top Model, were they to ever do a season with male models (don’t ask me if they have, because I don’t watch that show. No, of course not!), Northcutt does have some skills.\nHis career path does seem to somewhat resemble the path that was started for VanZant. Both feasted on unheralded fighters to begin their UFC careers. Unfortunately for VanZant, she ran into a fighter many underestimated and was badly exposed as a result. The UFC will tread much more carefully with Northcutt. While he’s making his primetime television debut on this card, don’t expect Northcutt to step in the Octagon with the likes of Eddie Alvarez or Tony Ferguson anytime soon.\nNorthcutt will win this fight. Barberena has nearly twice as many fights on his resume and has toiled in the regional MMA scene, so he will have plenty of motivation to make a name of himself at the expense of the UFC’s next hopeful “Golden Boy.” However, Northcutt doesn’t seem like he’s quite ready for his humbling yet. Expect to see his smiling, happy-go-lucky, ready-for-a-toothpaste-commercial face as his hand is raised once again in victory.\nWhich fight is the sleeper match-up on this card?\nHuntemann: Keep an eye on the fight between Tarec Saffiedine and Jake Ellenberger. Saffiedine is still very much an unknown entity in the welterweight division, even though this will be his third UFC fight and he is on the cusp of the welterweight top 10. However, it’s Saffiedine’s first fight since 2014.\nHe’s probably best known for his stint in Strikeforce, where his only loss came to current welterweight title contender Tyron Woodley. Here’s a bit of trivia for you: Who’s the last recorded Strikeforce welterweight champion in history? That’s right, it’s Saffiedine. He captured the belt on the organization’s last card by turning Nate Marquardt’s legs into mincemeat.\nEllenberger’s only victory since 2013 came against former UFC and current Bellator fighter Josh Koscheck last year. The best days of “The Juggernaut” appear to be behind him.\nIf Saffiedine can re-introduce himself to the UFC audience with a convincing victory, it may not be long before the last Strikeforce welterweight champion enters the UFC welterweight championship discussion.\nAittama: The rest of the preliminary fight card is full of fighters working to move up the rankings in their respective divisions. Much of the card features a clash of strengths and styles that could produce exciting, back-and-forth battles on the feet and in the ground work.\nThere is one fighter who was a late addition to the card that is flying under everyone’s radar. He’s the second fighter to make his debut from the UFC Fight Pass reality show Lookin’ for a Fight. Sage Northcutt, the first fighter from the show, is featured in the main card, and that’s exactly where Randy Brown wants to put himself with an impressive showing in his Octagon debut.\nBrown has fought all six of his professional fights under the Ring of Combat banner. The 25-year-old Jamaican-American won the ROC welterweight title at the beginning of 2015. He defended the belt twice to finish out the year, earning wins over Bellator veterans Rocky Edwards, Mike Winters and Ben Brewer. The tall, athletic striker is very diverse in his striking offense. He is also a diverse grappler who has shown an ability to fight and win off of his back. His wrestling is the only concern heading into his UFC debut against the durable Matt Dwyer.\nDwyer has just one win since entering the Octagon for the first time in 2014. He wasn’t exactly given the easiest pick of opponents in his three-fight UFC career. He fought potential top-10 welterweight Albert Tumenov in his debut and, most recently, the skilled scrapper Alan Jouban at UFC Fight Night 71 in July. Dwyer’s lone win inside the eight-sided cage earned him a “Performance of the Night” bonus in an upset when he knocked out William Macario at UFC Fight Night 61 in Brazil. The British Columbia native has knocked out his opponent in all eight of his victories. He is hoping to land another devastating strike here like the Superman punch he landed to finish “Patolino.”\nExpect an exciting fight that most likely gets finished in the first or second frame, as neither man has yet to go the distance in a win. Brown will impress in his UFC debut, but something tells me he won’t get the publicity of fellow reality-show member Northcutt.\nPair this card with…\nAittama: Football fans. No, not the ever-so-popular European game of footy. The hard-hitting, action-packed, billion dollar American industry. The Super Bowl is one of the most watched sporting events worldwide. UFC on Fox 18 is featured in a primetime slot without direct competition against the NFL playoffs or NCAA football bowl games. The event does line up with three NBA games and the NHL skills competition, but this event is primed to build on the momentum of the first two events of the year. We can only hope the main event between Anthony Johnson and Ryan Bader lives up to the two previous incredible five-round championship fights that kicked off 2016.\nHuntemann: A comfortable blanket. There aren’t any particularly “flashy” fights on this card. There are no fights that might make you stand up and go “Wow!” Of course, any fighter on the card could prove me wrong, but on paper it just looks like a night of solid, if somewhat unspectacular, fights. So, sit back, relax, wrap yourself in a warm blanket (particularly if you’re on the East Coast and buried in snow) and enjoy a night of free fights.\nFight Picks",
  "word_count": 5048,
  "scraped_at": "2026-02-14T13:41:02.983046"
}