{
  "article_id": "b814b6321c31",
  "url": "https://www.thenationalnews.com/news/uk/2026/02/06/melania-movie-fernando-sulichin-pope-of-documentaries/",
  "title": "From Melania to the Abraham Accords : Why Fernando Sulichin calls himself the  stylish Pope of documentaries  ",
  "date": "20260206T194500Z",
  "domain": "thenationalnews.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Fernando Sulichin is on a roll. He has plans, for documentaries, which he produces, and for himself.\nHe has just co-produced Melania, about the US First Lady. Currently, he is on a promotional tour. Once that is out of the way, “in 15 days”, he will take “a breather”. Then it is the filming of a new movie he is producing with Sir Martin Sorrell, the UK advertising and communications magnate and Fifa about the World Cup.\nDirected by “my friend Spike Lee”, it is “a documentary for people to show how a crazy sport like football and a tournament like the World Cup can tear up the world for 30 days, so that everything stops. It’s about the fans and their love of football, their passion”.\nUpcoming too is a movie about the Abraham Accords. It is being produced by Sulichin in conjunction with Richard Attias, the events creator and entrepreneur, who now runs the Saudi-backed Future Investment Initiative Institute and curates Abu Dhabi’s the Bridge Summit.‘\nCurrently dividing his time between London and Nassau, Mr Sulichin is planning to relocate his New Media Element Company, “to the Middle East, to Abu Dhabi or Saudi. The next wave of documentary-making is going to come from the region. I need to be culturally embedded there; my headquarters will be there, for sure”.\nThis, and more, is spoken at full speed. To meet Mr Sulichin, to listen to him, is to experience a high-octane, non-stop outpouring of detail. Projects, A-listers, business titans and world leaders – they all trip off the tongue.\nAdd the fact that he is charming and funny with it, and you can see why Mr Sulichin, an Argentinian by birth who studied architecture at UCLA before switching to film as a career, is so seductive. Throw in that he specialises in making connections, in getting things done, often dealing with tough subjects that others would not touch, and the interest and demand are obvious.\nHe has partnered Oliver Stone on films about Vladimir Putin, Fidel Castro, Hugo Chavez and Edward Snowden. Mr Sulichin accompanied Sean Penn and Kate del Castillo to the Mexican hideout of fugitive cartel boss El Chapo shortly before his arrest. They were going to make a film about the drugs mobster – the Mexican authorities had other ideas, seizing him soon afterwards (they claimed they followed the party to El Chapo’s redoubt).\nIt was Mr Sulichin who secured permission to film in Makkah for Malcolm X, directed by Spike Lee, and persuaded Nelson Mandela to perform a cameo in the same movie.\nHis is a never-ending litany of names, stories and films, over 25 and counting. He is no slouch either in picking up awards. His Love Liza won at Sundance and Mary, directed by Abel Ferrara, was a Venice Film Festival winner.\nHe may be less fortunate with Melania, given the current febrile atmosphere and polarising nature of her husband. Mr Sulichin insists he is not bothered. “Melania is the number one documentary at the box office in 15 years of any documentary. Currently, it’s number three in the US box office, taking $7m on its first weekend, a crazy amount for a documentary. Do I mind some of the critical reaction? Listen, I am used to getting tomatoes thrown in my face, I couldn’t care less.”\nHe does say though that he is gratified by the cinema audience’s response. “People love it, they’re giving it an A grade, their positivity is great.” They’re not simply MAGA, he says. “Many women adore it – there is a lot for women and the strength of women in this movie.”\nThe film charts the 20 days leading to Donald Trump’s second inauguration. Given the degree to which the Trump White House likes to control its messaging, the suspicion is that the filming and post-production were tightly-supervised. Not so, says Mr Sulichin. “The movie was aesthetically controlled, sure, but not the content – Melania wanted everything to be as beautiful as she is.”\nAs for the President, he took no part in the process and only saw the finished product just before its release. “He watched it in the White House. He loved it, he can’t stop talking about it.”\nMr Sulichin denies he was anxious about taking on such a high-profile assignment. “The only time I was nervous was when I saw the documentary for the first time. I’d not worked with the director before, I didn’t know what to expect, what it would be like.”\nMarc Berkman, the film producer who is a co-producer on the documentary and a close adviser to Melania, contacted Mr Sulichin and asked him to join.\n“It was not what I was expecting,” says Mr Sulichin. “Normally, I am used to working on films that are one on ones, where someone is asking questions. This was not like that. This was documenting a period in history. That was a new animal for me to encounter.”\nNor, he says, was it about politics. “I’m a creative producer. This isn’t a political film at all – it’s recording the transition from one president to another, from a lady turning into First Lady again. It’s not anti or pro-MAGA. It’s like When We Were Kings, that was about a boxing match [between George Foreman and Muhammad Ali] and the preparation for the fight. It makes for a very rich documentary.”\nA lot of footage was left on the cutting room floor, but he promises, a large amount will appear in the soon-to-air three-part series on Amazon (Jeff Bezos’s streaming giant paid $40m for Melania and is spending a similar amount on promotion).\nThere has been speculation that Bezos is not looking to recoup his outlay. That is not Mr Sulichin’s concern. Likewise, the choice of director Brett Ratner, who was cancelled almost a decade ago after allegations of sexual misconduct surfaced, was also controversial. It was Mr Berkman and Melania who went to Ratner, says Mr Sulichin, not him. But he stresses, he had no doubts. “Brett brings a fresh eye, he’s very emotionally intelligent. He’s intuitive. He’s a great director and he’s also got the innocence of a big kid.”\nWhat is Mr Sulichin’s contribution? “I’m the stylish Pope of documentaries,” he says, laughing.\nHe didn’t think twice about any fallout in Hollywood. “Did Christiane Amanpour suffer because of her interview with Yasser Arafat? No, she did not. Listen, in Hollywood, everything is very fashionable, there always has to be a new subject to oppose. Everyone wants to look intellectual by showing their opposition to something. There are some for whom the opposition is genuine and they are intelligent, but the rest are just actors and they are acting.\n“We’re living in the era of fast news and data. People are selling garbage all the time and it’s trending on TikTok. They are not interested in disseminating the truth.”\nWhich brings us to the Middle East peace process and the Abraham Accords. “The film is about the effort to achieve peace, what it takes to get peace.” He’s got the co-operation of key players, including Mr Trump and Israeli Prime Minister Benjamin Netanyahu, and the Palestinian leaders and main regional rulers and their governments. “It’s not about one particular side; it’s about people reconciling and showing their dialogue,” he says.\n“It’s about building bridges and creating a better world and what it takes to build those bridges. It’s art of course, but a film can start moving the needle to normality.”\nMr Sulichin laughs. “It’s like we’re one big family. If you insult your mother-in-law that does not make for a happy household; if your wife insults your mother that does not make for a happy household. You have to build bridges; so we have to build bridges.\n“What do they call it in Abu Dhabi? The Bridge Summit. Richard Attias is closely involved in that as well. It’s called the Bridge for a reason. It’s about bringing people together.”\nDespite this high-profile subjects he remains little-known in public. It’s his choice. “I’m not a public but private person,” he says. “I’m not in Tatler or Vanity Fair – you won’t find me there. I’m in the trenches doing things, producing films. It looks glamorous but there is a lot of work behind it.’\nWith that, he has to go. He has a plane to catch and more Melania, the World Cup and the peace process, which, when you think about it, is quite a trio for anyone.",
  "word_count": 1418,
  "scraped_at": "2026-02-14T12:38:14.946695"
}