{
  "article_id": "b857b0afcb55",
  "url": "https://www.theguardian.com/australia-news/article/2024/jul/25/morning-mail-gaza-polio-warning-kamala-harris-faces-surge-of-abuse-australia-kick-off-olympics-with-a-win-ntwnfb",
  "title": "Morning Mail : Gaza polio warning , Kamala Harris faces surge of abuse , Australia kick off Olympics with a win",
  "date": "20240724T214500Z",
  "domain": "theguardian.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Morning everyone. The poliovirus discovered in Gaza has added to the perils facing children in the besieged territory, the UN children’s agency has warned in an exclusive interview. We’ve got a full report, plus the latest from the newly electrified US election campaign, fresh fears about food labelling and a winning start for Australia’s rugby sevens players in Paris.\nAustralia\n-\nFlying the flag | Tokyo gold medal-winning paddler Jess Fox and Kookaburras veteran Eddie Ockenden have been chosen to carry the Australian flag at the Paris 2024 opening ceremony, chef de mission Anna Meares announced on Wednesday.\n-\nExclusive | The “incredibly alarming” discovery of the poliovirus in Gaza only adds to the besieged territory’s status as one of “the most dangerous places to be a child right now”, the head of the UN children’s agency has warned in an exclusive interview for Guardian Australia.\n-\nFood fears | The food industry in Australia is allowed to use labelling and marketing tactics to distract from the harmful ingredients in ultra-processed foods due its outsize political power, health experts say.\n-\nReporters axed | Some of News Corp’s most experienced journalists, including health reporter Sue Dunlevy, have been made redundant amid significant cuts to the national reporting team as well as the Herald Sun and Daily Telegraph.\n-\nFly food | Australian scientists are genetically engineering a common fly species so that it can eat more of humanity’s organic waste while producing ingredients for making everything from lubricants and biofuels to high-grade animal feeds.\nWorld\n-\nWashington protest | Benjamin Netanyahu has addressed a raucous joint session of the US Congress that was boycotted by dozens of Democratic lawmakers and saw thousands protest outside. Police arrested five protesters who disrupted the speech and used pepper spray on some of those outside.\n-\nHarris attacks | Kamala Harris and her husband, Doug Emhoff, have been targeted with a fresh wave of racist insults, misogynistic tropes, antisemitic conspiracy theories and viral memes since she emerged as the Democrat challenger to face Donald Trump in the US election in November. The attacks come despite Republican leaders urging supporters not to use racist slurs against Harris and her husband, who is Jewish.\n-\nParis ‘plot’ | A Russian chef who has lived in France for 14 years has been arrested on suspicion of plotting with a foreign power to stage “large scale” acts of “destabilisation” during the Olympic Games in Paris.\n-\nEmissions surge | A surge in new oil and gas production in 2024 threatens to unleash nearly 12bn tonnes of emissions, with the world’s wealthiest countries leading a stampede of fossil fuel expansion, new dats reveals.\n-\nPutin’s ‘lies’ | Vladimir Putin is “peddling lies” about the strength of the Russian economy that must be refuted, EU ministers have said, with growing signs of deterioration in Moscow’s war machine in the face of biting sanctions.\nFull Story\nHow social media is luring men into the Manosphere\nHave you ever wondered how the algorithms on social media platforms affect what you see in your feed? Josh Taylor and Dr Stephanie Wescott, an expert in online misogyny, tell Nour Haydar how Meta algorithms are amplifying sexist and misogynistic content.\nIn-depth\nIt’s the end of an era as Telstra and Optus prepare to shut down 3G – a mobile network that dates back to the early days of the iPhone – at the end of August. Josh Taylor runs through what you need to know, including why the network is being closed and what will happen when the signal goes in September.\nNot the news\nTakeru Kobayashi is the king of competitive eating. He can wolf down 50 hotdogs, 41 lobster rolls or 159 tacos in 10 minutes – and it has brought him fame and a healthy income. As he returns to the fray after five years, Chris Godfrey finds out what he plans to do next.\nThe world of sport\n-\nParis Olympics | Australia’s rugby sevens players kicked off the nation’s Olympics overnight by beating Samoa in Paris while there was chaos in the football tournament when the match between Argentina and Morocco was stopped by crowd trouble.\n-\nDrone scandal | Canada’s Olympic women’s football team is in turmoil after a member of their support team used drones to spy on their upcoming opponents New Zealand.\n-\nCycling | The Tour de France champion Tadej Pogacar says the Slovenian federation’s decision not to select his girlfriend Urska Zigart for the Olympics was one of the reasons behind his decision to withdraw from the Paris Games.\n-\nEquestrianism | A video of the Team GB star Charlotte Dujardin repeatedly striking a horse with a long whip has led the animal rights group Peta to call for all equestrian events to be banned from the Olympic Games.\nMedia roundup\nThe Sydney Morning Herald claims that some senior ministers could quit the Albanese government in the coming days, while the Age focuses on state politics with an exclusive that a multibillion-dollar blow is about to hit the Victorian budget. There are fears of a mass exodus of country firefighters in South Australia due to increased expectations about assiting paramedics and police, the Advertiser reports. The Cairns Post reports on a report that flags serious problems with the region’s disaster response during Tropical Cyclone Jasper.\nWhat’s happening today\n-\nSydney | First case management hearing in Bruce Lehrmann’s appeal of defamation loss.\n-\nIndigenous Australians | US museum to return 20 culturally significant objects.\n-\nEnvironment | World Heritage Committee decision due on whether to list Great Barrier Reef.\nSign up\nIf you would like to receive this Morning Mail update to your email inbox every weekday, sign up here, or finish your day with our Afternoon Update newsletter. And check out the full list of our local and international newsletters, including The Stakes, your guide to the twists and turns of the US presidential election.\nPrefer notifications? If you’re reading this in our app, just click here and tap “Notifications” on the next screen for an instant alert when we publish every morning.\nBrain teaser\nAnd finally, here are the Guardian’s crosswords to keep you entertained throughout the day. Until tomorrow.",
  "word_count": 1037,
  "scraped_at": "2026-02-14T12:09:35.250087"
}