{
  "article_id": "b85871038f2e",
  "url": "https://gbmwolverine.com/michigan-proves-it-s-an-everything-school-again-with-gymnastics-national-championship",
  "title": "Michigan proves it an everything school again with gymnastics national championship",
  "date": "20250420T153000Z",
  "domain": "gbmwolverine.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "It's great to be a Michigan Wolverine and one of the reasons is that in athletics, Michigan is an everything school.\nMichigan proved that once again on Saturday as the Men's gymnastics team won its seventh national championship, on its home floor in Ann Arbor, by edging out Oklahoma in a dramatic win thanks to a clutch final vault from Paul Juda.\nHere's the recap from mgoblue.com: \"Trailing the (Oklahoma) Sooners by 0.537 points (276.162-275.625) heading into the final rotation, the meet came down to the final routine. Juda delivered 13.966 as the anchor to secure the victory over Stanford by just 0.163 points.\"\nIt clinched the first national championship for Michigan in men's gymnastics since 2014. It was also the first national championship won by Michigan since the national title for fooball in 2023.\nIn total, it's the 59th national championship in school history. The Wolverines have won titles in 13 different sports. They have also won at least seven national championships in football, men's hockey, and men's gymnastics.\nBeyond that, since 2018, the Wolverines have played for the national championship in football, men's basketball, hockey, and baseball. No other school can say that. Michigan has also seen both its basketball programs make the Sweet 16 in recent years, in addition to making three straight Frozen Fours from 2022-2024.\nFred Richard won the individual all-around national championship with 84.264 points. Juda took the parallel bars national championship with a14.200.\nWith Dusty May killing it in the transfer portal and Bryce Underwood poised to help Michigan football return to contender status, plus a loaded women's basketball team, you never know when the next national title will come, but Michigan is an everything school, as the gymnastics team reminded us on Saturday.",
  "word_count": 291,
  "scraped_at": "2026-02-14T13:21:22.051400"
}