{
  "article_id": "b8760d313045",
  "url": "https://www.premierleague.com/news/3532942",
  "title": "Premier League Primary Stars champions crowned at Elland Road",
  "date": "20230613T203000Z",
  "domain": "premierleague.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Another exhilarating Premier League Primary Stars Football Tournament concluded with an action-packed finale in Leeds.\nWhile it would be Liverpool and Chelsea who left with the Under-11 mixed and Under-11 girls titles respectively, the feeling of elation was palpable from all the children who had the opportunity to represent their schools and teams on the pitch at Elland Road.\nThe Premier League Primary Stars tournament gave those taking part the opportunity to experience the life of a top-flight footballer for the day, wearing the kit of their favourite teams and competing under the watchful eye of Premier League and Women’s Super League match officials, including Darren England and Emily Heaslip.\n\"PLPS creates a once in a lifetime opportunity, from walking down the tunnel, scoring the winning goal – hopefully!\" said England. \"They may go home tired, but with lots of memories to look back on in years to come!\"\nMore than 9,000 children from schools across England and Wales had competed for the chance to represent their respective clubs at the tournament, with primary school children representing all 20 Premier League clubs from the 2022/23 season.\nAfter a tense group stage, the stakes only got higher with a gripping knockout phase in both tournaments.\nIt would ultimately conclude with two finals that had the audience of parents, teachers and other teams gripped to their seats.\nThe mixed teams got things underway and provided another source of tension, with a Merseyside derby for the final between Everton (Childwall Church of England Primary School) and Liverpool (Mosspits Lane Primary School).\nA late goal from each side forced extra-time but the additional period could not divide the two teams.\nIt would ultimately be Liverpool who took the trophy home, defeating their rivals 4-2 on penalties.\nIn the girls’ competition, Chelsea, represented by South Farnham Primary School, faced Brighton & Hove Albion, represented by Maidenbower Junior School.\nThe London team would prevail, with a solitary goal proving decisive in a hard-fought encounter.\n‘Inspiring people in their everyday’\nAs the awards were handed out at the closing ceremony, the day again proved how valuable football is as a tool to engage and develop the future generation, both on and off the pitch.\n“Football is a game that everyone can enjoy and has the potential to empower and inspire people in their everyday lives,\" said Premier League Chief Executive Richard Masters.\n“The tournament is a highlight of the Premier League Primary Stars calendar and every year I am impressed by the passion, teamwork and standard of play shown by all participants.”\nAs well as the two winners, Newcastle United and Leeds United were named the Fair Play winners in the girls and mixed tournaments respectively, determined by the PGMOL match officials and based upon adhering to the Primary Stars value of \"Be Fair\".\nWords by Sam Akpan",
  "word_count": 471,
  "scraped_at": "2026-02-14T12:39:21.550079"
}