{
  "article_id": "b87f542886ea",
  "url": "https://www.dw.com/en/marie-louise-eta-bundesliga-coaching-pioneer/a-67482129",
  "title": "Marie - Louise Eta : Bundesliga coaching pioneer – DW – 11 / 22 / 2023",
  "date": "20231122T123000Z",
  "domain": "dw.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Marie-Louise Eta: Bundesliga coaching pioneer\nNovember 24, 2023Union Berlin's Marie-Louise Eta will make history when she becomes the first female assistant coach in the men's Champions League. Her rise should open the door for more women, but attitudes still need to change.\nUnion Berlin may be in the relegation zone, and still searching for their first win since August — but on November 25 the club did at least pick up a point while also making football history in the men's Bundesliga .\nWhen Augsburg visited the German capital for that 1-1 draw, a woman was among a men’s Bundesliga team's coaching staff for the very first time. Marie-Louise Eta was named as the assistant to Marco Grote, with both promoted from Union's U19 team to take the reins of the seniors on an interim basis.\nThough Grote has returned to his old job after Union hired Nenad Bjelica as head coach, Eta will be on the bench for Union's Champions League match against Braga on Wednesday before she returns, meaning she will also make history in that competition.\nEta, who was born in Dresden in 1991, hung up her boots at 26 to become a coach, initially working at the German Football Association (DFB), managing various age groups of Germany's international women's teams before making the switch to coach the men at Union.\nHaving just made the emotionally charged decision to fire Urs Fischer, the coach who brought Union into the Bundesliga for the first time in their history and then remarkably guided them into the Champions League, Union's president Dirk Zingler said he has simply chosen the best person for the job.\n\"It's not a conscious decision to have a woman as assistant coach, that would discredit the decision,\" Zingler said after Grote and Eta were appointed. \"We have made a decision for a soccer coach who already works in the team.\"\n'Very calm, very intelligent'\nBeyond Eta, there aren’t many women who can say they’ve coached both men and women professionally. One of the select few is Imke Wübbenhorst, who is currently head coach of Young Boys’ women’s team in Switzerland. She was also Eta's former teammate at BV Cloppenburg for two seasons, before taking charge of the men’s team for a spell.\nThe pair played a season together in the second tier and another season in the Women’s Bundesliga after winning promotion. In an interview with DW, Wübbenhorst explained how the pair would discuss football strategy and even implement tactical changes on the field during games.\n\"We were very similar because I always wanted to be a coach,\" Wübbenhorst said. \"We could speak on a higher level about systems, how to press... sometimes we would stand on the pitch and say 'Ok, how can we solve this problem?' So we would change something on the pitch.\"\nWübbenhorst said her former teammate’s serenity and intelligence is what sets her apart, and believes her new role as assistant coach at Union perfectly matches her skills.\n\"Marie-Louise is a very calm person and a very intelligent player. She always used to play in a central position, as a 6 or an 8. She has good strategy, she knows where to bring the ball, how to create space for others. And she can handle different types of people,\" she said. \"I think she likes to work in the background.\"\n'You have to impress them'\nEta has attracted attention not only for her coaching ability but for her gender.\nWhile Grote said Eta was \"quickly accepted\" by Union's U19 players when she arrived at the club earlier this year, Eta has previously faced resistance as a female coach of male players.\n\"I noticed that some people treated me differently compared with before,\" she told UEFA last month. \"It is something you notice and that is not always comfortable.\n\"I've always tried not to put the focus on the fact that I am a woman,\" Eta added. \"For me, it's not about women and men, or whether a man is good for a women's team, it's always about diversity.\"\nWübbenhorst, who rose to prominence in Germany in 2018 when she was appointed head coach of the men's team at Cloppenburg, sees it the same way. She says most of the challenges coaches face are experienced by men and women. But some are unique to women.\n\"You have to convince them with good drills, good analysis,\" said Wübbenhorst. \"Wherever you are, you have to show that you have good qualities and you have to develop the players.\"\n\"They are used to good coaches, up from the youth level, so they can compare more easily. When you are a female coach, they are not impressed with your career from the beginning. You have to impress them. If you are an international player, someone like Miroslav Klose, they are already impressed so you don't have to convince them.\"\nWübbenhorst spent a season at RB Leipzig in 2019-20 as part of Julian Nagelsmann's backroom team and understands first-hand the challenges of working with top-level professional men.\n\"There are so many foreign players at top clubs with different views of the world,\" Wübbenhorst explained. \"You have to be open-minded... their sensitivity is higher because they are used to be in the spotlight, they're used to earning a lot of money so when you criticize them, you have to do it very, very carefully.\"\nAttitudes toward female coaches shifting but 'a few more years' needed\nEta's historic appointment should open the door for more women to follow but unlike in the US, where female assistant coaches of men's sports teams is long established, there is greater resistance in Europe.\nWübbenhorst believes Eta's promotion at Union makes things easier, but that it will still take time for ingrained attitudes to shift.\n\"When you are the first person to do something, it's hard because the media look at every word you say... but when you are the second or third, it will be so much easier,\" she said. \"The management of the clubs have to see that it works. So they will decide more often to choose a woman for this position.\n\"In Europe — England, Spain, Germany — football is a man's game,\" she said. \"When the role of women changes, and there is a change happening in the whole of society, it becomes easier. Because the management see that there are strong women too, and it doesn't depend on whether it's a man or a woman to be a good coach.\n\"This has to go on for a few years, but right now it's older men who hold the money and make the decisions of who will be the coach, and I think that has to change, and that needs a few years more.\"\nIn the meantime, Wübbenhorst says women shouldn't feel pressure \"to be like the men\". In her opinion, it's crucial for female coaches to be themselves, and she has never felt any pressure to obscure aspects of her feminity in order to succeed in the men's game.\n\"You can't be a better man because you're a woman,\" she says. \"I am a strong personality, it doesn't depend on my sex if I'm strong or not.\n\"There was one time when I wanted to paint my nails and I thought 'well, we have a game on the weekend, maybe I shouldn't stand there with painted nails.' That was the only time in my whole career I thought about this. But now I'm older and more experienced and I think 'why not? It doesn't make me a good or a bad coach.'\"\nPainted nails or not, Eta will take her place in the dugout on Wednesday and has already demonstrated that she is a pioneer. The question now is whether attitudes will loosen further in the men's game and more women will be able to follow her lead at the top level, both in Germany and beyond.\nEdited by: Matt Pearson",
  "word_count": 1324,
  "scraped_at": "2026-02-14T13:44:01.734552"
}