{
  "article_id": "b886a493619b",
  "url": "https://weisradio.com/2025/01/20/trump-inauguration-live-updates-trump-to-address-supporters-sign-executive-orders/",
  "title": "Trump inauguration live updates : Trump to address supporters , sign executive orders - WEIS",
  "date": "20250121T020000Z",
  "domain": "weisradio.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "(WASHINGTON) — At noon today, Donald Trump took the presidential oath for a second time, capping a historic political comeback to the White House.\nAs he did on the campaign trail, Trump painted a dark picture of America and took aim at President Joe Biden’s leadership as his predecessor sat just steps away.\n“My recent election is a mandate to completely and totally reverse a horrible betrayal, and all of these many betrayals that have taken place, and to give the people back their faith, their wealth, their democracy, and indeed their freedom,” Trump said, promising a “golden age of America.”\nWhite House confirms Vivek Ramaswamy is leaving DOGE\nThe White House confirmed to ABC News that Vivek Ramaswamy, who Trump had picked to help lead his Department of Government Efficiency (DOGE) alongside Elon Musk, will now step aside to focus on running for governor of Ohio.\n“Vivek Ramaswamy played a critical role in helping us create DOGE,” Trump-Vance transition spokesperson Anna Kelly told ABC News in a statement. “He intends to run for elected office soon, which requires him to remain outside of DOGE based on the structure that we announced today. We thank him immensely for his contributions over the last 2 months and expect him to play a vital role in making America great again!”\nAn Ohio operative told ABC News last week that Ramaswamy would announce his gubernatorial run soon.\n“Vivek’s base plan remains [the] same: to get accomplishments at DOGE and then announce a run for governor shortly,” the operative said.\n-ABC News’ Hannah Demissie\nTrump enters arena to boisterous applause\nTrump and Melania Trump walked into Capital One Arena together as “Hail to the Chief” was played by a military band.\nThe atmosphere is similar to that of Trump’s campaign rallies, with attendees clad in red “Make America Great Again” hats.\nTrump shook hands with supporters in the crowd, many of whom held up their cellphones to film his entrance.\nDeSantis refers to Gulf as ‘Gulf of America’ in executive order\nFlorida Gov. Ron DeSantis issued an executive order on an approaching winter storm on Monday that refers to the Gulf of Mexico as the “Gulf of America.”\nAmong the first executive orders set to be signed by Trump is one that would rename the Gulf of Mexico to the “Gulf of America.”\nAmy Klobuchar discusses Trump and Biden limo ride to the Capitol\nSen. Amy Klobuchar, chair of the congressional inaugural committee, called into ABC News and spoke with anchor David Muir after the ceremonies on Capitol Hill.\nKlobuchar was in the motorcade with Trump and Biden as they rode together from the White House to the swearing-in the Capitol Rotunda.\n“I’m not going to reveal every detail, except to say maybe we did discuss football just a little bit, and some of the games yesterday,” she said about what was discussed on the short trip. “And we also talked about the now-president’s upcoming trip to Los Angeles, and I talked to him privately about that with the Olympics coming, and how important that is.”\nKash Patel, Trump’s FBI director nominee, addresses crowd\nKash Patel, Trump’s nominee for FBI director, which is a non-partisan position, addressed Trump supporters at Capital One Arena ahead of his arrival.\n“It’s pretty cool to be speaking in Capital One Arena right before the boss,” Patel said, as the crowd cheered.\n“We are not only the beacon of hope, but we are the land of constitutional justice. We are the land under Donald J. Trump and JD Vance where we are going to end the two-tier system of justice. We are going to remove the weaponization of the intelligence community for political purposes, and we are going to put the men and women of America first.”\nInaugural parade taking place at Capital One Arena\nNormally, the president and his entourage would walk down Pennsylvania Avenue to the White House after taking the oath of office.\nBut because of frigid temperatures in Washington, the events have been moved indoors to Capital One Arena.\nThe venue has the capacity to hold roughly 20,000 people. A desk has been set up on stage for Trump to sign some of the first executive orders of his administration.\nBrian Driscoll named acting FBI director\nBrian Driscoll has been named acting director of the FBI by the incoming administration, days after Driscoll was tapped as the new head of the FBI’s Newark field office.\nFBI Deputy Director Paul Abbate resigned this morning, as did most of the executive staff, according to sources.\n-ABC News’ Luke Barr\nFocus will soon shift to Capital One Arena\nThe inaugural luncheon has ended and Trump is about to participate in the First Honors Ceremony at the Capitol.\nHis next stop will be Capital One Arena for remarks to a waiting crowd and the signing of executive orders.\nSome Trump allies and officials have already spoken ahead of his arrival, including Tesla CEO Elon Musk and Arkansas Gov. Sarah Huckabee Sanders. Also speaking was Kash Patel, Trump’s pick for FBI director.\nMilley’s official portrait was removed from Pentagon hallway\nGen. Mark Milley’s official portrait as chairman of the Joint Chiefs of Staff was taken down this afternoon from the hallway where it hung along with those of previous chairmen.\nTwo U.S. officials confirmed that Milley’s portrait was taken down from that hallway and referred questions to the White House.\nOne official told ABC News that the whereabouts of the portrait is unknown.\nThe portrait was officially unveiled on Friday, Jan. 10, at a ceremony in that hallway where both Milley and Defense Secretary Lloyd Austin were present.\nThe portrait’s disappearance was first noted by reporters at the Pentagon who have posted uncleared photos of the empty space where the portrait was hung.\n-ABC News’ Luis Martinez and Matt Seyler\nActing leaders named for Homeland Security, Defense departments\nWhile awaiting the Senate confirmation hearing for South Dakota Gov. Kristi Noem, Trump’s pick to lead the Department of Homeland Security, Benjamine Carry Huffman has been appointed acting secretary.\nHuffman is currently the director of the Federal Law Enforcement Centers, the training arm for federal law enforcement.\nDepartment of Defense official Robert Salesses was also named acting defense secretary until the Senate confirmation hearing is held for Trump’s pick, Pete Hegseth.\nSalesses is the current deputy director of the Washington Headquarters Service.\n-ABC News’ Luke Barr and Luis Martinez\nPlans for Rubio’s 1st day at the State Department\nThe State Department is charging full steam ahead with preparations for Sen. Marco Rubio’s first full day as America’s top diplomat.\nAssuming all goes to plan, two State Department officials say that Rubio — Trump’s nominee to be secretary of state — will give a speech to mark his arrival on Tuesday. He will also meet both one-on-one and as a group with the foreign ministers of India, Australia, and Japan — the three countries that, along with the U.S., make up the Quad, a diplomatic partnership seen as critical to countering China’s influence in the Pacific.\nThe Senate is expected to begin working to formally install as many of Trump’s nominees as possible and Rubio is expected to come up first. He could be confirmed as soon as this evening.\n-ABC News’ Shannon K. Kingston\nWhite House raises flag to full staff after Trump signs proclamation\nThe flag at the White House has been raised after Trump signed a proclamation for flags to be flown at full staff on all inauguration days.\nThe flag had been at half-staff following President Jimmy Carter’s death on Dec. 29. Trump is ordering the flag to return to half-staff on Tuesday for the remainder of the 30-day period, which began the day of 100-year-old Carter’s death.\nLast week, House Speaker Mike Johnson ordered that the flags at the Capitol be raised for the inauguration.\n-ABC News’ Justin Ryan Gomez\nTrump advisers, DOJ prepare for legal challenges\nWith a flurry of executive orders expected today, President Donald Trump’s top advisers, including his incoming Department of Justice leadership, are preparing for a storm of legal challenges to some of the most controversial ones.\n“We’re going to get sued on all of these things,” one top Trump adviser said, adding that the volume of litigation is expected to be a full-time job for Trump’s DOJ.\nTrump has privately told advisers that he believes flooding the zone with executive orders will lead to lawsuits that may be less effective given the volume of actions he plans to take.\nDuring Trump’s first administration, he faced upwards of 400 lawsuits challenging his actions. His advisers anticipate more than that this time.\nThere will be a team inside the Justice Department that is dedicated just to defending Trump’s actions in court, sources said.\n-ABC News’ Katherine Faulders\nWhite House décor transitions from Biden to Trump\nThe transition from the Biden White House to the Trump White House is well underway and crews are working quickly to make the changes before Trump arrives later this afternoon, but the choices are nearly identical to his first term.\nIn the Oval Office, gold curtains have returned behind the Resolute Desk, as well as the red-and-beige carpet with green leaves that covered the wood floor.\nAs Trump sits at his desk, the portrait of President Andrew Jackson returned to the wall on his left side, just as it was during his first term. Biden had a portrait of Benjamin Franklin.\nTo Trump’s right, where Biden hung a 1917 flag-decorated Childe Hassam painting, President Abraham Lincoln is now back on display.\nOther areas of the West Wing still need to be unboxed. In the Cabinet Room is a cardboard box with “DJT Office Bibles” written on the side.\n-ABC News’ Justin Ryan Gomez\nPoliticians attend inauguration luncheon\nMembers of Congress, officials joining the new administration and tech leaders including Meta CEO Mark Zuckerberg have congregated for an inauguration luncheon at the Capitol.\nPelosi criticizes Trump’s inaugural speech\nFormer House Speaker Nancy Pelosi was critical of Trump’s inaugural speech, pointing out that he didn’t mention his plan to cut taxes on the wealthy.\n“In the President’s first term, his only accomplishment was enacting tax cuts that gave eighty-three percent of the benefits to the top one percent while increasing the national debt by $2 trillion,” she said in a statement.\n“While he didn’t say it in his speech, the President campaigned on an extension of those tax cuts being his first priority in the new Congress,” Pelosi said. “The American people want us to build an economy from the middle out — not from the top down.”\nPelosi’s statement came as Trump slammed the former speaker in remarks to his supporters at Emancipation Hall.\n“She’s guilty as hell,” Trump said of Pelosi over her response to the attack on the U.S. Capitol.\nTrump again airs grievances against Nancy Pelosi, Liz Cheney after pledging ‘unity’\nAfter promising ‘unity’ in his inaugural address, Trump is reverting back to bulldozing political opponents like Nancy Pelosi and Liz Cheney.\n“She’s guilty as hell,” he said of Pelosi over her response to the attack on the U.S. Capitol — where he was speaking — buy a pro-Trump mob.\nHe called Liz Cheney, a Republican who endorsed Kamala Harris over Trump because of his actions after the 2020 election, a “disaster.”\n“She’s a crying lunatic and crying, crying Adam Kinzinger, he’s a super crier,” Trump said.\nTrump talks about Jan. 6 ‘hostages’\nIn more off-the-cuff remarks inside the Capitol’s Emancipation Hall after his address, Trump spoke about people who have been convicted for their roles in the Jan. 6 attack on the Capitol as “hostages.”\n“I was going to talk about the J6 hostages,” Trump said. “But you’ll be happy because, you know, it’s action not words that count.”\nTrump previously promised to pardon some Jan. 6 rioters on Day 1.\nHe also went after former Reps. Liz Cheney and Adam Kinzinger, two Republican members of the House Jan. 6 Committee who are outspoken critics of Trump because of his actions after the 2020 election.\n“And I was going to talk about the things that Joe did today with the pardons of people that were, very, very guilty of very bad crimes, like the Unselect Committee of political thugs,” Trump said.\nBiden’s legacy: How will he be remembered?\nSurveys show Americans have mixed views on Biden’s four years at the pinnacle of power.\nHistorians told ABC News it will take years to fully assess his stamp on American politics, but that likely to be included are his legislative achievements while leading the country out of the COVID-19 pandemic and his foreign policy footprint.\nBut many said his 2024 campaign decisions — first to run for reelection and later to drop out — may overshadow his record while in office.\nBiden departs the Capitol\nJoe Biden, now the former president, left the Capitol on a Marine helicopter that will bring him to Joint Base Andrews for a final farewell to Washington.\nThe Bidens and Trumps walked together to the helicopter. Both couples were holding hands.\nBiden smiled and appeared to laugh as he spoke to Trump. Jill Biden and Melania Trump hugged as they said goodbye.\nThis is an exit for Biden after five decades in politics.\nJust before he left, Kamala Harris and Doug Emhoff entered their own motorcade. She is traveling home to Los Angeles, her office confirmed to ABC News.\nInaugural ceremony comes to an end\nAfter Trump’s speech, there were remarks from Rabbi Ari Berman, Pastor Lorenzo Sewell and Reverend Frank Mann. Christopher Macchio performed the national anthem.\nTrump and Melania Trump left the Capitol Rotunda together.\nNext, the Trumps will see off President Biden and Vice President Kamala Harris.\nRoom joins in as Carrie Underwood sings ‘America the Beautiful’\nIn a unifying moment, Carrie Underwood sang “America the Beautiful” after Trump’s defiant inauguration speech.\nThe country star, who was standing in front of Biden, performed a capella after technical difficulties, and the crowd joined in. Biden, Hillary Clinton and Doug Emhoff were among those singing with her.\nTrump celebrates his comeback: ‘Here I am’\n“Many people thought it was impossible for me to stage such a historic political comeback. But as you see today, here I am,” he said. “The American people have spoken.”\nTrump’s long road back to the White House included four indictments, one conviction, two assassination attempts and a campaign of ups and downs.\nTrump references legal troubles: ‘Never again’\nTrump, who has been convicted by a jury of his peers and was indicted four times after his first term, again contended he was politically prosecuted.\n“Never again will the immense power of the state be weaponized to persecute political opponents,” he said. “Something I know something about. We will not allow that to happen. It will not happen again. Under my leadership, we will restore fair, equal and impartial justice under the constitutional rule of law.”\nThe two cases against him were dropped after he won reelection, with prosecutors citing longstanding Justice Department policy that a sitting president cannot be charged with a crime.\nTrump lays out Day 1 executive actions\nTrump is now highlighting some of the executive actions he will take.\nThey include declaring a national emergency at the southern border and a national energy emergency.\nHe said he would send troops to the U.S.-Mexico border, reinstate “Remain in Mexico” policy and other immigration policies.\nTrump takes aim at Biden in address: ‘A horrible betrayal’\nTrump is taking aim at Biden’s leadership these past four years, specifically on immigration and on recent natural disasters, though he didn’t mention his predecessor by name.\n“My recent election is a mandate to completely and totally reverse a horrible betrayal, and all of these many betrayals that have taken place, and to give the people back their faith, their wealth, their democracy, and indeed their freedom,” Trump said.\nLike he did on the 2024 campaign trail, Trump’s painting a dark picture of America.\n“From this moment on, America’s decline is over,” he said. “Our liberties and our nation’s glorious destiny will no longer be denied, and we will immediately restore the integrity, competency, and loyalty of America’s government.”\nTrump: ‘The golden age of America begins right now’\nTrump began his inaugural remarks with a line he’s said repeatedly since his election.\n“The golden age of America begins right now,” he said.\n“Our sovereignty will be reclaimed, our safety will be restored, the scales of justice will be rebalanced.”\nCheers erupted in the freezing cold in the line outside the Capital One Arena as Trump supporters huddled together, glued to their phones watching Trump take the oath of office.\nTrump is sworn into office for a 2nd term, capping historic comeback\nTrump just took the oath for a second time. Melania Trump and their children surrounded him as he did so.\nTrump and Biden shook hands after he took the oath. Kamala Harris, who was standing next to Biden, clapped quietly.\nJD Vance takes oath of office\nJD Vance just took the oath of office with his wife, Usha, and their three children by his side.\nTheme for inauguration is ‘our enduring democracy’\nDemocratic Sen. Amy Klobuchar and Republican Sen. Deb Fischer, who sit on the Joint Congressional Committee on Inaugural Ceremonies, are speaking on the importance of democracy.\n“Our theme this year is our enduring democracy, the presence of so many presidents and vice presidents here today is truly a testament to that endurance,” Klobuchar said in her opening remarks.\nFischer noted the past several years have been a “trying” time for the nation but today’s events marks its 60th inauguration ceremony.\n“Endurance through the years is the ultimate test,” she said. “To persevere through time is the truest measure of an idea.”\nBiden announces preemptive pardons of family members minutes before Trump takes oath\nPresident Joe Biden issued preemptive pardons to his siblings and their spouses in the final minutes of his presidency.\n“My family has been subjected to unrelenting attacks and threats, motivated solely by a desire to hurt me — the worst kind of partisan politics. Unfortunately, I have no reason to believe these attacks will end,” Biden said in a statement.\nHe pardoned his siblings, Valerie Biden Owens, Francis Biden and James Biden, as well as Owens’ husband, John Owens, and James Biden’s wife, Sara Jones Biden.\n“The issuance of these pardons should not be mistaken as an acknowledgment that they engaged in any wrongdoing, nor should acceptance be misconstrued as an admission of guilt for any offense,” Biden said.\nTrump enters Capitol Rotunda for transfer of power\nTrump walked into the Capitol Rotunda solo as he prepares to be sworn in for another four years.\nIt is a historic moment, as he is the first president in more than a century to win non-consecutive terms. He will also be the first convicted felon to serve as president.\nTrump’s children at his side but won’t join his administration\nTrump’s five children were seen entering the Capitol, moments before he is set to be sworn in for a second term.\nUnlike his first term, none will serve in his administration.\nIvanka Trump and her husband, Jared Kushner, were advisers in the West Wing during his first presidency. But neither are returning this time around. Eric Trump and Donald Trump Jr. are currently leading the Trump Organization.\nOmar rips Dems for attending Trump’s inauguration after calling him a ‘threat to democracy’\nRep. Ilhan Omar, D-Minn. sent out a blistering X post criticizing fellow Democrats who called Trump a threat to democracy and are now “willing to be there and clap for him.”\n“People are more upset at performers/artists attending Trump’s inaugural events but not upset at all the politicians who told them he was a ‘threat to democracy’ going to these events are not serious,” she wrote.\n“Performers at least know they are there to perform and get paid, but these politicians who ran their mouth for 4 yrs and are now willing to be there and clap for him, that’s who they should be mad at,” she added. “They lied to you and your criticism/anger should be rightfully directed at them.\n— ABC News’ Benjamin Siegel\nClintons, Bushes, Obama arrive at Capitol\nFormer President Bill Clinton and former Secretary of State Hillary Clinton, who lost the 2016 election to President-elect Donald Trump, have arrived at Trump’s second inauguration. Trump supporters gathered at Capital One Arena in Washington, D.C., booed as the Clintons walked in.\nFormer Vice President Mike Pence was also not accompanied by his wife, Karen Pence.\nTrump’s Cabinet picks are in the Capitol. One could be confirmed tonight\nHundreds of people are gathered inside the Capitol Rotunda, including several of Trump’s Cabinet picks: Tulsi Gabbard, tapped for director of national intelligence; Robert F. Kennedy Jr., chosen to lead Health and Human Services; and Pete Hegseth, his pick to lead the Pentagon.\nHis pick for secretary of state, Marco Rubio, could be confirmed as soon as Monday night. Rubio is considered one of Trump’s least controversial picks.\nA number of Senate committees that will vote on different nominees have scheduled meetings for later this week.\nChants, music, and a watch party inside Capital One Arena\nWith a sea of red hats and the campaign soundtrack blasting, Capital One Arena emulates the environment of a campaign rally.\nNotably, a desk sits at the end of the stage across the podium. Trump is expected to sign executive orders from here.\nThere is a feed of Trump’s movements being streamed live on the Jumbotrons as well. As the president-elect departed St. John’s church, the crowd here burst into applause and chanted “USA.”\nThere were also chants of “JD-48” as they watched the vice president-elect and his wife arrived at the White House.\nABC News Senior Political Correspondent Rachel Scott spoke to one couple from Alabama who arrived at 2:30 a.m. and said there were still “thousands” of people ahead of them.\nEMS first responders from Butler, Pennsylvania — the site of that first assassination attempt — are expected to be present as well.\n— ABC News’ Rachel Scott and Benjamin Siegel\nWhat happens when Trump and Biden get to Capitol\nAccording to the presidential inauguration committee, here is what will happen when Trump gets to the Capitol:\nFirst, he will be sworn in around noon.\nAfter, Trump will bid farewell to President Joe Biden and Vice President Kamala Harris. Biden is leaving the Capitol via helicopter to go to Joint Base Andrews, where he will hold a farewell event with his staff.\nTrump will then visit the overflow crowd gathered at Emancipation Hall to watch the swearing in and later participate in a ceremony in the presidents signing room. He will eventually return to Emancipation Hall for a review of the troops.\nBiden and Trump depart White House together for Capitol\nPresident Joe Biden and President-elect Trump are riding together to the U.S. Capitol for Trump’s swearing-in.\nDemocratic Sen. Amy Klobuchar, who chairs the congressional inaugural committee, walked them out of the White House.\nFirst lady Jill Biden and Melania Trump rode to the ceremony separately, as did Vice President Kamala Harris and Vice President-elect JD Vance.\nBiden sees to peaceful transition of power Trump denied him four years ago\nThe peaceful transition of power is a hallmark of American democracy.\nIt’s currently on display as Biden hosts Trump at the White House before they attend the inauguration together.\nBut four years ago, Trump denied Biden such a welcome. Instead, he bitterly left Washington hours before the inauguration while still refusing to concede he lost the 2020 election.\n“The only president ever to avoid an inauguration is the guy that’s about to be inaugurated,” Biden had said when he confirmed he would be in attendance for Monday’s events.\nBiden leaves letter for Trump\nAs President Joe Biden prepared to pass the baton to President-elect Donald Trump, he’s followed the tradition of leaving his successor a note.\nWhile Biden confirmed that he wrote Trump a letter, he did not say what his message was.\nPresident Ronald Reagan started the ritual of leaving his successor a letter in 1989. Every president since has taken part in the tradition. But since Reagan’s letter to Bush, each handover has been from a Democrat to a Republican or vice versa.\nMike Pence to attend inauguration\nFormer Vice President Mike Pence announced his plans to attend the inauguration.\n“Today, I will attend the Inauguration of President Donald Trump and Vice President J.D. Vance at the U. S. Capitol,” Pence wrote on X. “This is a day when every American does well to celebrate our democracy and the peaceful transfer of power under the Constitution of the United States.”\nPence was seen arriving at the U.S. Capitol at around 9:30 a.m.\nTrump and Vance have had a contentious relationship and did not interact publicly for four years after Pence broke with Trump by refusing to reject the 2020 election results.\nBiden tells Trump: ‘Welcome home’\nAs Trump exited his limousine, Biden said to him: “Welcome home.”\nTrump walked up the steps with Melania Trump and they shook hands with the Bidens.\nTrump is now at the White House\nTrump has arrived at the White House, where he will have tea with President Biden.\nThe two men will later ride together to the U.S. Capitol for Trump’s swearing in.\nTrump’s return caps what has been a remarkable political comeback unlike anything in American history.\nThis isn’t Trump’s first time back at the White House. Biden invited him for an Oval Office meeting days after his victory in November.\nHundreds available to attend inauguration from inside the Capitol Rotunda\nGuests will attend the inauguration from the Capitol Rotunda and overflow areas, with 800 able to attend from inside the Rotunda.\nAbout 1,300 can attend in the Emancipation Hall, and 500 can watch from the theater in the Capitol Visitor Center.\n— ABC News’ Justin Gomez and Allison Pecorin\nTrump will rename Gulf of Mexico the ‘Gulf of America’ among 1st actions\nAmong the first executive orders set to be signed by President-elect Donald Trump will be an order to rename the Gulf of Mexico as the “Gulf of America.”\nDuring his January press conference at Mar-A-Lago, Trump declared he would change the name, saying it’s currently run by cartels and that “it’s ours.”\n“We’re going to be changing the name of the Gulf of Mexico to the Gulf of America, which has a beautiful ring that covers a lot of territory, the Gulf of America,” Trump said. “What a beautiful name. And it’s appropriate. It’s appropriate. And Mexico has to stop allowing millions of people to pour into our country.”\nPresidents have the authority to rename geographic regions and features via executive order.\n-ABC News’ John Santucci and Kelsey Walsh\nBiden takes selfie with first lady at White House\nPresident Joe Biden snapped a selfie with first lady Jill Biden outside the White House, documenting their final morning in office.\nThe Bidens will soon host the Trumps for tea and coffee at the White House.\nBidens greet Harris at the White House\nVice President Kamala Harris and second gentleman Doug Emhoff have arrived at the White House.\nThey exchanged handshakes with President Joe Biden and first lady Jill Biden.\nThe Trumps will soon join Biden at the White House for tea. They have just exited St. John’s Episcopal Church.\nSupporters line up outside Capital One Arena before dawn, despite sub-freezing temps\nTemperatures in the high teens and low 20s did little to stop Trump supporters from lining up early to attend inauguration events at Capital One Arena.\nThose at the front of the line arrived at 3 a.m., despite the fact that Trump was eight hours away from taking the oath, and doors were four hours away from opening.\nThousands were lined up by the time doors opened at 7 a.m.\nABC News spoke with supporters from all over the nation including southern California, Florida, and New York. Many arrived with family members that spanned generations.\nABC News’ Meghan Mistry\nTrumps arrive for church service\nDonald Trump and Melania Trump have arrived for a church service at St. John’s in Washington, a tradition for presidential inaugurations.\nTrump said he’s feeling “great.”\nAfter church, President Biden and first lady Jill Biden will welcome the Trumps to the White House — an invitation that Trump did not offer the Bidens four years ago when he skipped the inaugural events entirely.\nFirst to ABC: Sarah Huckabee Sanders, Tom Homan and Kellyanne Conway to speak at Capital One Arena, per sources\nArkansas Gov. Sarah Huckabee Sanders, “border czar” Tom Homan and Kellyanne Conway will speak at Capital One Arena, per sources familiar with the planning.\nElon Musk will join the speakers list as well.\nThe president will also swing by the Capital One Arena for the 60th Presidential Inaugural Ceremony Viewing & Parade.\nThe evening will include the Oval Office Signing Ceremony, followed by the Commander and Chief Ball, Liberty Ball, and Starlight Ball.\n— ABC News’ Kelsey Walsh\nMembers of Trump’s family arrive at St. John’s\nTrump is about to leave Blair House for the first event of the day: a service at St. John’s Episcopal Church.\nMembers of his family, including his children Ivanka Trump and Eric Trump, were seen arriving for the service.\nSenior Trump adviser dismisses significance of Biden pardons\nJason Miller, a senior adviser to President-elect Donald Trump, dismissed the significance of President Joe Biden’s preemptive pardons for prominent political figures in an interview with “Good Morning America” on Monday.\n“Today is about President Trump and starting to undo some of the disasters from the past four years,” Miller said shortly after the news of Biden’s inauguration day pardons broke.\n“I really don’t care about Joe Biden anymore,” Miller added. “This is about the plan of action President Trump is going to start implementing, starting today.”\nA preview of Trump’s inaugural address\nExcerpts of Trump’s inaugural address, obtained by ABC News, show Trump will call for a “revolution of common sense.”\n“I return to the presidency confident and optimistic that we are at the start of a thrilling new era of national success. A tide of change is sweeping the country,” he will say.\nTrump will also hint at the sweeping executive action he will take, with as many as 200 orders prepared for Day 1.\n“Today, I will sign a series of historic executive orders,” he’ll say. “With these actions, we will begin the complete restoration of America and the revolution of common sense.”\n“My message to Americans today is that it is time for us to once again act with courage, vigor, and the vitality of history’s greatest civilization.”\nWhat Trump has said he’ll do on Day 1\nMass deportations, Jan. 6 pardons and tariffs on trade partners. That’s just some of what Trump repeatedly vowed to do immediately after he is sworn into office.\nSources told ABC News Trump is likely to sign executive orders at the U.S. Capitol after his swearing-in and then additional ones later at Capital One Arena.\nSeparately, top Trump officials told ABC News he is preparing to take more than 200 executive actions on his first day in office.\nWhile plans are still being finalized, sources said they could include declaring a national emergency on the U.S.-Mexico border, rescinding any DEI directives from the Biden administration and offsetting limits for offshore drilling on federal land.\nBiden’s attendance restores hallmark of American democracy\nAfter a bitter 2024 campaign, Biden will put politics aside and stand near his successor as he takes the presidential oath spelled out in the Constitution.\nThe gesture is a tradition of American democracy, but especially notable given that Trump skipped Biden’s inauguration four years ago after refusing to concede.\nStill, Biden made sure to issue a final warning to Americans before he left office to be vigilant against potential abuses of power ahead.\n“Today, an oligarchy is taking shape in America of extreme wealth, power, and influence that literally threatens our entire democracy, our basic rights and freedoms, and a fair shot for everyone to get ahead,” he said in his farewell address. “We see the consequences all across America.”\nHow to watch Trump’s inauguration\nABC News will have comprehensive coverage of the inauguration throughout the day.\nTrump is expected to begin his day with a service at St. John’s Episcopal Church and a private tea at the White House before his swearing-in ceremony at noon in the Capitol Rotunda.\nThe network’s coverage will begin with a special edition of “Good Morning America” at 7 a.m. EST, followed by a day-long special report beginning at 9 a.m. EST and led by “World News Tonight” anchor and managing editor David Muir from Washington.\nInauguration coincides with MLK Day\nTrump’s second swearing in is occurring on Martin Luther King Jr. Day.\nThe last time that happened was former President Barack Obama’s second inauguration in 2013. Obama, the nation’s first Black president, took the oath of office that year using two Bibles, one that belonged to King and one that belonged to Abraham Lincoln.\nThe overlap isn’t expected to happen again until 2053.\nFauci, Milley react to preemptive pardons from Biden\nFollowing Biden’s announcement of preemptive pardons to potential targets of the incoming Trump administration, the recipients express their gratitude to the outgoing president.\n“I really truly appreciate the action President Biden has taken today on my behalf,” Dr. Anthony Fauci told ABC News Chief Washington Correspondent Jonathan Karl. “Let me be perfectly clear, Jon, I have committed no crime, you know that, and there are no possible grounds for any allegation or threat of criminal investigation or prosecution of me.”\nRetired Gen. Mark Milley also expressed that he was “deeply grateful for the President’s action.”\n“After forty-three years of faithful service in uniform to our Nation, protecting and defending the Constitution, I do not wish to spend whatever remaining time the Lord grants me fighting those who unjustly might seek retribution for perceived slights. I do not want to put my family, my friends, and those with whom I served through the resulting distraction, expense, and anxiety.”\n“I wish this pardon weren’t necessary, but unfortunately, the political climate we are in now has made the need for one somewhat of a reality,” said Harry Dunn, former Capitol Police officer. “I, like all of the other public servants, was just doing my job and upholding my oath, and I will always honor that.”\nCopyright © 2025, ABC Audio. All rights reserved.",
  "word_count": 5762,
  "scraped_at": "2026-02-14T13:41:57.056293"
}