{
  "article_id": "b896df2e86db",
  "url": "https://www.aol.com/weather/live-updates-power-outages-soar-105000199.html",
  "title": "Winter Storm Fern Turns Deadly In Louisiana , Outages For Hundreds Of Thousands Vulnerable To Ice , Snow",
  "date": "20260126T220000Z",
  "domain": "aol.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Winter Storm Fern Turns Deadly In Louisiana, Outages For Hundreds Of Thousands Vulnerable To Ice, Snow\nOn Sunday, millions from New Mexico to the Northeast saw impacts from Winter Storm Fern. Thick layers of ice remain on the ground and power lines, and outages across the South skyrocketed as a result.\nThe storm has claimed the lives of two men in Louisiana. Officials there confirm they both died of hypothermia.\nAnother death was reported in Austin, Texas, also from hypothermia.\nHeavy snow is blanketed towns from Missouri to New England and will continue to impact the Northeast into early Monday. At least 24 states had declared emergencies, many roads and highways were impassable and a staggering number of flight cancellations remain.\nSchool districts across the country have called off classes on Monday, with the list growing longer by the minute.\nWe're not only tracking the storm's path for you, but we'll also be bringing you live updates throughout the day on every angle of the storm. Here's what's happening now.\n(09:24 p.m. EST) Storm Death Reported In Austin\nThere has been a death in the city of Austin from Winter Storm Fern. The city’s mayor has confirmed that the cause of death was hypothermia.\nAustin is under an extreme cold warning until noon CST Monday. Wind chills could drop to around zero degrees overnight.\nThe state still has over 70,000 customers without power.\n(09:05 p.m. EST) End Of The Winter Storm Arrives Soon\nFrom senior digital meteorologist Jonathan Belles:\nWinter Storm Fern’s last mark will be made in New England on Monday. Fern’s center may slow for a time on Monday. That means its snow flurries are likely to stick around there at times through the day, but the heaviest snowfall will be long gone by sunrise.\nMeanwhile, many across the country will begin to thaw out from the ice that will likely make travel and recovery efforts tricky from Texas to Tennessee. Temperatures will be well below average to start the work week. They may not reach freezing in parts of the South, including hard-hit northern Mississippi and Tennessee, until Tuesday.\n(09:02 p.m. EST) Small Passenger Plane Overturns at Bangor Airport, Maine\nConditions were snowy, and visibility was reduced at the Bangor Airport around the time a small passenger plane overturned at the airport.\nThe area’s winter storm warning took effect at 7 pm and will last until 3 am Tuesday. Snowfall over a foot is possible.\n(08:39 p.m. EST) Stunning Shot of Ice In Helen, Georgia\nIt is not too often you see significant icing in Georgia.\nMuch of central and northern Georgia has been slammed with significant icing, which has led to power outages climbing up to over 45 customers.\nIce storm warnings will expire by Monday morning, with accumulations across the region reaching up to a half of an inch.\n(08:26 p.m. EST) Creative Ways To Travel In Boston\nRemember the video game SSX Tricky?\nCertainly, somebody does, right?\nThe bulk of the heaviest snowfall has moved to the Northeast, and Boston is seeing some heavier snowfall. While Logan Airport hasn’t actually seen more than 2 inches, totals across Massachusetts are starting to approach a foot.\nWinter storm warnings are in effect for Boston until Monday evening. Heavy snowfall is expected to continue tonight, with the city seeing a storm total potentially exceeding a foot.\n(08:13 p.m. EST) Severe Weather Class In Hood County, Texas, Postponed\nWith the winter weather, it is no surprise that the severe weather class in Hood County, Texas, scheduled for Tuesday, January 27, has been postponed.\nAn extreme cold warning is in effect for the entire Dallas-Fort Worth area as well as much of Texas until Tuesday morning. Wind chills could drop as low as -10 degrees F.\n(07:55 p.m. EST) Heavy Snowfall From Connecticut To Eastern Maine Continues\nAs this powerful winter storm continues to impact the Northeast, heavy snowfall will stay for eastern portions of New England in the coming hours.\nHeavy snowfall rates of 1-2 inches per hour are expected across much of Connecticut and eastern Massachusetts, including Boston, for the next few hours.\nThis heavy snowfall will eventually shift north into eastern Maine.\nThis heavy snowfall is due to some relatively warm air interacting with the bitterly cold air mass over the region, also called warm air advection.\nThe Storm Prediction Center has issued more than 26 mesoscale discussions (MDs) in the last two days. This is the most winter MDs for any 48 hour period since 2008. There have been nearly 8,000 winter storm reports from all of the National Weather Services combined.\n(07:38 p.m. EST) Be Careful Shoveling Snow\nWith snowfall accumulating across a wide swath of the Central and Eastern US, millions of Americans are getting ready to break out the snow shovels.\nHere are some pointers to make sure you go about it safely.\nFirst off, please dress warm and stay dry, especially if the white stuff is still falling. Also, take frequent breaks and stay hydrated. Shoveling can lead to back injuries and even heart attacks.\nEspecially with this winter storm, freezing rain is mixing into many of the forecasts, meaning the snow will not be as light and fluffy. Heavy, wet snow is even more risky to shovel since it is so much heavier than dry, fluffy snow.\nMeteorologist Caitlin Kaiser breaks it down in the following video:\nhttps://weather.com/features/video/shoveling-snow-dangers\n(07:19 p.m. EST) Avalanches Reported In Pennsylvania\nFrom meteorologist intern Miriam Guthrie:\nWhile Pennsylvania continues to get slammed with snow, there are reports of significant avalanches blocking the road on Coxton Road in Duryea, PA.\nReports of 10-15 feet of snow are burying the roadway, making the road impassible. Local police are asking drivers to avoid the area and allow emergency crew to respond.\n(07:04 p.m. EST) Freezing Rain Can Be Deceiving\nFrom digital meteorologist Caitlin Kaiser:\nFor those of you across the South who have seen freezing rain, it’s important that you remain off the roads as much as you can — even if at a glance they don’t look dangerous.\nThis is because wet and icy roads can look very similar, which causes many people to jump on the road without the necessary precautions. We encourage you to stay home, but if you must drive somewhere, make sure you drive slowly.\n(06:42 p.m. EST) Ice Accumulations Report\nThis powerful winter storm is bringing devastation across much of the South and is impacting the East. These ice accumulations are helping to bring power outages to over 950,000 customers:\nGreenville-Spartanburg, South Carolina: 1.00 inch\nGlen, Mississippi: 1.00 inch\nCherokee, Alabama: 1.00 inch\nRayville, Louisiana: 1.00 inch\nClayton, Georgia. 0.75 inches\nBrentwood, Tennessee: 0.75 inches\nIce storm warnings have expired across the South. For the Southeast, ice storm warnings remain for northern Georgia, including Atlanta, and the western Carolinas.\n(06:17 p.m. EST) “Steamnadoes” Reported In Texas\nA pretty cool sight at Lake Ray Roberts, Lake Lewisville, & Lake Limestone near Dallas, Texas. These “steamnadoes” form when cold air moves over the warm lakes. Steam forms, rises and can rotate.\nThey are impressive and harmless.\nStorm chasers have also been spotted enjoying the winter wonderland in the Fort Worth area.\n(05:51 p.m. EST) Snow Game - But NOT Fern Related\nWe are getting some questions about the current snow in the game going on at Denver, and people are asking if it is related to Winter Storm Fern.\nThe answer is NO. The current snow in Denver is actually a disturbance coming down from the Rockies.\nAnd it has definitely been a factor in the AFC Championship Game, with a late field goal block that could have tied things at 10.\nThe Patriots survived the Denver snow, and advance to the Super Bowl with the 10-7 win.\n(05:12 p.m. EST) Ice Takes Down Trees In Nashville, Most Of Davidson County Without Power\nFrom digital meteorologist Caitlin Kaiser:\nDowntown Music City might look a little different after this winter storm. Numerous large trees in Nashville have snapped from the weight of the ice from Winter Storm Fern, leaving them sagging over roads and sidewalks.\nIce reports from around Nashville range from 0.35-0.50 inch. This is considered a disruptive amount of ice where tree limbs break, power outages occur and roads become icy.\nDavidson County, where Nashville is located, has over 85% of its tracked customers now without power.\n(04:43 p.m. EST) A White Out Before The White Out\nThe folks in central Pennsylvania are getting ready for a couple of outdoor hockey games this week at West Shore Home Field at Beaver Stadium, University Park, PA.\nPenn State women’s hockey hosts Robert Morris at 1pm ET on Friday.\nPenn State men’s hockey hosts Michigan State at 1pm ET on Saturday.\nPenn State football is known for their massive white outs, with more than 100k fans in attendance. But check out the white out that mother nature is dumping on the region right now.\nAnd this week, public skating is available.\n(04:13 p.m. EST) Why Bridges Freeze First?\nWe have all seen the signs, “Bridges Freeze Before Roadway.”\nIf you doubted this truth, the ongoing winter storm has something to say about it.\nThe ground beneath a road serves as a bit of natural insulation, meaning the ongoing cold air is only hitting the road from the top.\nFor bridges and elevated roads, the cold air completely surrounds the structure. You have cold air above but also cold air flowing underneath, allowing heat to be lost from all sides.\nBelow is a graphic made by meteorologist Sara Tonks for those visual learners out there:\n(03:48 p.m. EST) Wintry Mix Continues from Northern Virginia To Long Island, Sleet Reported In NYC\nThe area of greatest concern right now is located across parts of the Mid-Atlantic, spreading from northern Virginia to Long Island.\nA wintry mix continues across the region, with the sleet/snow line spreading further north. Sleet has spread to Long Island and is being reported in New York City.\nThere is a chance of some freezing rain to be mixed in, and additional ice of 0.1 to 0.2 is possible. However, sleet looks to be the main form of precipitation now.\nNew York City, specifically Central Park, has seen 7.2 inches of snow so far.\n(03:24 p.m. EST) NBA Impacts From Winter Storm Fern\nThe National Basketball Association has already been impacted by Winter Storm Fern, and there could be more on the way.\nEarlier this afternoon, the NBA postponed today's game between the Nuggets and Grizzlies in Memphis.\nMeanwhile, tonight's game between the Mavericks and Bucks in Milwaukee is also in question. The Mavericks are stuck on the tarmac in Dallas just hours before their scheduled tipoff in Milwaukee. And according to reports, they will not make the trip.\nAn NBA G League game, that was scheduled for Monday between the Memphis Hustle and Stockton Kings in Southaven, Mississippi, has also been postponed. That game is rescheduled for February 19.\n(03:17 p.m. EST) Severe Storms Bring Tornado Warnings To Alabama, Florida\nAcross the southern end of this powerful winter storm, severe storms continue to bring dangerous conditions.\nA gust of 71 mph was reported in Montgomery, Alabama.\nThere have also been some tornado warnings that were issued in the panhandle of Florida and southeastern Alabama.\nEmergency management in the area is investigating potential tornado damage in Elba, Alabama.\nAlso, there was a unique statistic that came out of this storm earlier today, and it took place in Georgia.\nThe southwestern part of the state, which included Columbus, had a tornado watch.\nBut just about 50 miles away to the north? Ice storm warnings.\nThe tornado watch has been reduced, and Columbus is in the clear. Still, it is not too common in the weather world to see such alerts so close to each other.\n(02:46 p.m. EST) Power Outages Now Top One Million\nPower outages from Winter Storm Fern now exceed one million customers, according to poweroutage.us\nTennessee leads the pack with more than 330,000 customers. Davidson County, where Nashville is located, has over 200,000 customers without power. That’s more than 92% of the county.\nNext up is Mississippi, where there are around 175,000 customers without power. That's followed by Louisiana, with just over 145,000 customers without power.\nTexas has finally dropped below 100,000 customers, while Georgia and Kentucky continue to creep up. Georgia has around 80,000 customers without power, while Kentucky is around 70,000.\nAs conditions worsen across the Mid-Atlantic and Northeast, power outages may soar yet again.\n(02:26 p.m. EST) Latest Snowfall Reports\nThis winter storm is bringing it all: rain, snow, storms and ice.\nBut this post will just be about the snow.\nBelow are some of the highlights:\nDavis, West Virginia: 16.0 inches\nPittsburgh, Pennsylvania: 8.5 inches\nSt. Louis, Missouri: 8.0 inches\nLittle Rock, Arkansas: 7.8 inches\nPhiladelphia International Airport, Pennsylvania: 7.4 inches\nNew York City (Central Park), New York: 7.2 inches\nNewark Airport, New Jersey: 7.0 inches\nIndianapolis, Indiana: 6.0 inches\nChicago O’Hare, Illinois: 3.5 inches\nWinter storm warnings spread from Arkansas to Maine and will continue to expire on the west end as the storm heads east. The heaviest snowfall is spreading from Missouri to New England. Below is the current radar:\n(02:04 p.m. EST) Ice Between The Hedges\nUniversity of Georgia's Sanford Stadium is looking more like an ice rink than a college football mecca today.\nIce is covering every surface on the Athens, Georgia, campus.\nThe University encouraged students who could, to go home for the weekend. All in-person classes and campus events are canceled on Monday.\n(01:40 p.m. EST) What Actually Is Black Ice?\nFrom content writer Toby Adeyemi\nThink of black ice like the final boss of winter roads.\nBlack ice is a super-thin, clear layer of ice that forms on pavement, sidewalks and bridges — and here's the problem: you can't see it. It's practically transparent, so it blends right in with the road, which is why it's called black ice.\nMost people don't even know they've hit it until their car starts sliding or they're flat on their back (or face).\nSo here's the move: slow way down, assume bridges are icy (they freeze first), take small steps if you're walking, and if your car slides, ease off the gas and steer where you want to go — don't slam the brakes.\nStay sharp or even more ideally, stay home.\n(For More: What is Black Ice?)\n(12:44 p.m. EST) Tornado Watch Issued For Portions Of Alabama, Florida, Georgia\nFrom meteorologist Jennifer Gray:\nWinter Storm Fern isn’t limited to just snow and ice. Severe storms are firing up along the southern side of the system, bringing the potential for damaging winds and isolated tornadoes.\nThe Storm Prediction Center has issued a tornado watch for portions of the Southeast, including southern Alabama and Georgia, as well as parts of the Florida Panhandle until 7 p.m. EST.\nCities include: Montgomery, Alabama, Albany, Georgia, Pensacola and Panama City.\n(12:31 p.m. EST) Mayor Announces School Closures As Snow Clobbers NYC\nNew York Mayor Zohran Mamdani announced that Monday will be a remote learning day for public schools in the city.\nSnowfall has picked up there this morning with 1-3 inches on the ground already.\nEven before Winter Storm Fern’s arrival, sub-freezing temperatures claimed 5 lives in the city.\n(11:58 a.m. EST) Storm Deaths In Louisiana\nTwo men died of hypothermia in Caddo Parish, which is in the Shreveport area of Louisiana.\nThe state's Department of Health confirmed that the deaths are storm-related, but has not released any more information about the victims.\nMore than 120,000 customers are without power in the state right now, that means most of them have also been left without heat while temperatures hover in the teens.\n(11:45 a.m. EST) Major Airport Hub Cancels All Flights Today\nFrom lead editor Jenn Jordan:\nTravel chaos is worsening around the country as flight cancellations soar past 10,000 today, with nearly 2,000 more already grounded for tomorrow, according to FlightAware.\nAtlanta’s Hartsfield-Jackson International Airport is bearing the brunt, leading the country in canceled flights, while New York’s LaGuardia and JFK aren’t far behind.\nThe nation’s capital is facing a total shutdown of the skies, with every inbound and outbound flight from Reagan National Airport canceled today.\n(10:47 a.m. EST) Freeway Turns Free-For-All\nFrom lead editor Jenn Jordan:\nA major Dallas highway turned into a chaotic mess as drivers stopped in their tracks, threw it in reverse and even started traveling the wrong way.\nSleet and snow have coated the Woodall Rodgers Freeway, wiping out lane markings and turning the stretch into a slick, directionless sheet of ice. With no visible lanes, cars crept forward wherever they could, creating a dangerous free-for-all.\nTxDOT is urging drivers to stay off the roads unless it’s an emergency, as crews work around the clock to treat major roads and bridges.\n(10:33 a.m. EST) DC’s Snowball Fight Canceled Due To Sleet\nFrom meteorologist Tiffany Savona:\nSad news for snow lovers in the nation's capital. The Washington D.C. Snowball Fight Association has canceled the planned snowball fight set to take place at 11 a.m. on the National Mall.\n(10:11 a.m. EST) Shelter In Place For Oxford, Mississippi\nThe Oxford Police department has asked residents not to leave their homes this morning.\nIn an alert on social media, the department said trees and power lines are “actively falling and are blocking various roads.\"\nThe University of Mississippi is also reporting major impacts on their Oxford campus.\nNew daylight images show entire transformers on the ground.\n(09:52 a.m. EST) Fern’s Severe Side: Chance Of Strong Storms Today\nFrom meteorologist Jennifer Gray:\nWarm air being pulled in from the Gulf is clashing with the frigid air from Winter Storm Fern and will set the state for severe storms across portions of the Southeast later today.\nThe Storm Prediction Center has placed a slight risk (level 2 out of 5) for an area that includes southern portions of Mississippi, Alabama, Georgia and parts of the Florida Panhandle.\nPlaces like Mobile, Pensacola, Tallahassee, as well as Albany, Georgia are at risk for severe storms later through tonight.\n(09:38 a.m. EST) Nashville: ‘Trees Falling Everywhere’\nSheets of ice are covering Nashville neighborhoods and residents are sharing photos and reports of trees snapping and falling “everywhere”.\nAlmost half an inch of ice accumulation was measured in the city early this morning.\nNo doubt leading to the incredible amount of power outages we just updated you on in Tennessee.\n(09:06 a.m. EST) Record Snowfall Totals From Saturday\nFrom meteorologist Jennifer Gray:\nSeveral locations set daily records for snowfall on Saturday. It’s important to note that these are not totals from the entire storm, just the amounts that fell on Saturday alone.\n(08:45 a.m. EST) Snow Arrives In New York City\nAs Fern pushes into the Northeast, snow has made its Broadway entrance.\nThe storm is expected to be a showstopper in the city and the state which made an emergency declaration ahead of Fern’s arrival.\nThe NYC area could see up to a foot of snow or more through tomorrow.\n(08:13 a.m. EST) This Is Not A Winter Wonderland\nA neighborhood in Lebanon, Tennessee, looks like a frozen nightmare. A thick layer of ice has covered everything.\nSomeone’s mom is probably pretty unhappy that bike was left outside.\nRainfall is increasing across middle Tennessee this morning, so scenes like this will only multiply.\nMore than 100,000 homes and businesses have lost power in the state.\n(08:00 a.m. EST) Why The South Sees More Ice Than Snow\nFrom lead editor Jenn Jordan:\nIce storms can happen almost anywhere, but in the South, they’re actually more common than snowstorms.\nThat’s because snow requires consistent below-freezing temperatures all the way from the clouds to the ground, and while the South can absolutely get that cold, warmer air tends to linger higher in the atmosphere.\nOne of the biggest reasons for that is the Gulf constantly pumping in warmth and moisture, turning any precipitation into freezing rain or sleet instead of snow. Add in the Appalachian mountains, which often trap icy cold air, and you have the perfect setup for ice, not snow days.\nMeteorologist Jennifer Gray breaks it down in detail here.\n(07:27 a.m. EST) Snow Plows Get To Work In Virginia\nFrom neighborhood roads to interstate highways, snow plows rolled out in Virginia early this morning to begin clearing the way for necessary travel.\nThe snow is expected to change over to freezing rain later today.\n(07:12 a.m. EST) State(s) Of Emergency\nFrom lead editor Jenn Jordan:\n24 states have now officially declared a State of Emergency due to the storm.\nWhat does that actually mean? In short: states can move faster and throw more resources into helping their residents. Governors now have expanded powers to deploy National Guard troops, free up emergency funding and coordinate directly with federal agencies like FEMA.\nIt also means stricter safety measures. Expect travel restrictions, government office closures and transit shutdowns.\nOnce Fern moves out, these emergency declarations will also help states jump-start recovery and pay for repairs.\n(07:00 a.m. EST) Your Flight Is Probably Canceled\nMore than 13,000 flights nationwide have been canceled since Saturday, 10,000 of them are grounded today, according to FlightAware.com.\nNearly all departing flights at Ronald Reagan Washington National Airport are canceled, the Associated Press reports.\nAnd as you might expect major hubs like Charlotte, Atlanta, New York, Philadelphia and Dallas-Fort Worth are all seeing major disruptions.\n(06:17 a.m. EST) Mississippi Encased In Ice\nNearly an inch of ice has coated trees and roads across Oxford, Mississippi, wiping out power. Meteorologist and storm chaser Reed Timmer gave a tour of the dangerous conditions overnight.\nAnd imagine walking out to see this much ice on your car?\nRemember just a quarter-inch of ice can have devastating impacts and the freezing rain is still coming down.\n(05:50 a.m. EST) 'Thunderice' In Texas As Power Outages Soar\nTexas is bearing the brunt of massive power outages this morning, and you can see why here. Roaring thunder and lightning accompanied freezing rain and ice overnight.\nWhile more than 300,000 outages have been reported nationwide by Poweroutage.us, upward of 90,000 of them are in Texas alone.\nMississippi is close behind with some 80,000 homes and businesses left in the dark and the cold.\nLouisiana is reporting more than 70,000 outages, and Tennessee has over 30,000.",
  "word_count": 3728,
  "scraped_at": "2026-02-14T12:44:31.057169"
}