{
  "article_id": "b8f9b51b19e9",
  "url": "https://www.tor.com/2023/09/27/form-8774-d-alex-irvine/",
  "title": "FORM 8774 - D",
  "date": "20230927T134500Z",
  "domain": "tor.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "It’s just business as usual at the Bureau of Metahuman, Mutant, and Occult Affairs until an employee for the government agency begins to wonder if work is following her home. . .\nThursday, 8:47 a.m.\nLeelee’s second cup of coffee hasn’t even worked its pitiful magic yet, she hasn’t finished deleting all her work emails or swiping down through the office Slack channel just so it’s resting on the current message if her supervisor happens to come by and notice. Eight friggin forty-seven, and the superwannabe comes through the door. No knock, no hesitation. Her first appointment isn’t until nine. “Excuse me. Miss Remsburg?”\nLeelee nods. No point denying it.\n“I’m Plumeria Reynolds. I believe I have an appointment. I know I’m a little early, but”—she looks slightly embarrassed but also weirdly proud of herself—“I just couldn’t wait!”\nLeelee could send her back out into the waiting room to wait for thirteen minutes, but what the hell, nothing is happening in here and if she starts early maybe that means, by some law of conservation of impatient applicants, that a thirteen-minute break will appear later in the day.\nHa.\n“Sure,” she says. “Have a seat.”\nLeelee has her own office, with a door and everything, an unusual perk for someone at her service level but mandated because many of the discussions that happen in said office are of a deeply private nature. It isn’t easy to apply for recognition of metahuman or mutant abilities. There’s a stigma. There’s also an awesome factor, but Leelee knows that the supers who revel in the awesome without understanding the stigma and the burden are boarding the express train to Villain-Ville. She makes a note about them in her file.\nPlumeria Reynolds, at first glance, does not appear to be such a person. She’s wearing a skirt and blouse from a mall store—perfectly fine but unremarkable, unlike many of Leelee’s clients who come in wearing costumes of their own design and brandishing various fake weapons and artifacts. The real ones don’t make it through security screening.\n“You’ve filled out Form 8774-D?” Ms. Reynolds nods. “Let me just take a look.”\nForm 8774-D, Affirmation of Emergent Metahuman, Mutant and/or Occult Abilities/Powers, is just the first step in the process of being vetted and certified—but it’s a critical step, and the hardest, because the temptation is to lie, to make yourself sound better, to be a Thanos in a world of Ant-Men. A big part of Leelee’s job is working through Form 8774-D with claimants to get their answers in order so they don’t get embarrassed later.\nPlumeria Reynolds’s form indicates that she is neither a clone nor a cyborg, and that she was born on Planet Earth. She claims powers of flight and energy projection, manifesting after…Leelee squints but can’t quite make it out. “When did your powers first manifest?” she asks.\n“Oh, my handwriting,” Plumeria says apologetically. “I can hardly read it myself. The whole thing started on a fishing boat, if you can believe that. I was thirteen. My uncle caught some strange creature, none of us knew what it was, and my father told me not to touch it.” She shrugs. “But I did. It was kind of slimy, and the slime got into me, I guess. Next thing I knew, I could do…well, all the things I wrote on the form there.” She ends with a self-effacing little laugh that Leelee finds painfully endearing.\nLeelee makes a note on Plumeria’s form. “Okay,” she says.\n“Weird, right?” Plumeria leans forward. “But you probably hear lots of weird stories in your job,” she adds, clearly hoping Leelee will repeat some of them.\n“I sure do,” Leelee says. “But you know, privacy laws…” It’s her turn to shrug.\n“Of course, sure.” Plumeria nods a bit too energetically.\nLeelee finishes scanning the form. “Everything appears to be in order,” she says.\n“Great!” Plumeria beams. “So when can I start?”\nInwardly Leelee cringes. How can so many people not read the basic instructions? When you download Form 8774-D from the department’s website it comes with instructions. When applying for certified metahuman status, an applicant literally cannot get the form without the instructions and an overview of the process. Yet several times a week she runs into this situation.\n“This is not a recruiting office,” she says. The speech comes out on autopilot, she’s given it so many times. “The Bureau of Metahuman, Mutant, and Occult Affairs does not put you in touch with any other superheroes. We do not send you out on missions. What we do in this office is decide whether your particular suite of powers and abilities qualifies you to be a Certified Superhuman Practitioner. What you do with that certification is up to you…although several superhero organizations do keep tabs on what we do here.” She leans closer to Plumeria, because she likes her and wants to give her a little inside info. “Plus I know for a fact that the Dimensional Defense Agency has someone psionically monitoring our clerical staff, so if you fit their profile, they’ll be reaching out to you toot sweet. Possibly via your dreams.” Leelee winks, and then she’s all business again. “Your next step will be a demonstration of your abilities. Our department scheduler will contact you about that. Expect it to take a week or so.”\n“Oh.” Plumeria is disappointed but trying not to show it. This makes Leelee like her more. “How long before the demonstration, once it’s scheduled?”\n“We’re typically scheduling six to eight weeks out,” Leelee says. “I know it’s a long time to wait after you’ve worked up your courage to take this big step, and I wish it could be sooner. But that’s the process, you know?”\nShe stands and so does Plumeria. “What do you think?” Plumeria asks. “About my chances, I mean?”\n“It’s not up to me,” Leelee says. “I just make sure the forms are filled out right. It’s all about the demonstration, and if you can do what the form says you can do, I can’t see any reason why they wouldn’t certify you.” She gives Plumeria a map to the demonstration site, way outside DC past Dulles Airport.\n“Thank you for helping me,” Plumeria says. Then she leans in a little closer and asks, “Were you serious about the Dimensional Defense Agency?”\n“Oh, yeah,” Leelee says, the yeah sounding more like yah because you can take the girl out of the Upper Peninsula but you can’t take the UP out of the girl. “They totally keep an eye on what we’re doing here. Drives our security guys crazy.”\nThey share a laugh and Leelee sees Plumeria out the door. That wasn’t so bad, she thinks. Her coffee isn’t even all the way cold.\nAt lunch she’s talking with Drogba, one of the security guys. Everyone in BMMOA security is a super, usually a disabled vet from the Armageddon Phalanx or the Thule Armada, cashiered out of active service but still potent enough to keep most baby would-bes in line. “Tell you what,” Drogba says around a mouthful of cafeteria lo mein, “no offense, but if I was just starting out now? No way I’d apply. Why do you think people do it?”\n“A lot of them want to serve,” Leelee says. “But there’s also a lot who just want the validation. They want other people to know they’re special. Didn’t you?”\nBack in the day, Drogba was known as The String, for his ability to manipulate matter at the subatomic level. The final battle of the Vortex Singularity left him a shadow of his former self, after he nearly tore himself apart creating a wormhole to drain the singularity out of space-time and into an interdimensional void. That kind of power, the kind of sacrifice, Leelee can barely imagine. Most people, even at BMMOA, don’t know Drogba’s story, but one of Leelee’s skills is that people tend to tell her things.\n“Nah,” he says now, and she thinks he’s sincere. “I figured once they saw what I could do, I’d be all set. Ain’t no point in false modesty.”\n“True enough,” she says. She’s still thinking about that later when she gets home and finds Samir on the couch watching baseball. He’s made dinner. They eat in front of the TV, half-heartedly arguing about what to watch. Leelee gets tired around ten. She takes her time getting ready for bed, and by the time she’s crawling in Samir comes into the bedroom yawning. Everything happens in its prescribed order. Phones on chargers, alarms set, blankets shuffled around, lights out.\nEvery day is pretty much the same. Leelee likes it that way.\nWednesday, 10:05 a.m.\nThis is one of the sad cases. Well, lots of them are sad, because people are so often deluded about what kind of powers they really have. But to Leelee, the saddest ones are the kids. Specifically, the kids whose parents have decided to ride the child’s powers to the narcissistic Promised Land of Super Parenthood. The place where vicarious living, parasitic validation, and insincere performative patriotism mix. Leelee has spent way too much time observing the inhabitants of this terrible place, and it sure looks like she’s about to make a return visit. She calls them NVPs, Narcissistic Vicarious Parents. The usage has spread through the office, a phenomenon of which she is inordinately proud.\nThey’re five minutes late, just enough to let Leelee know they’re calling the shots. Mom’s all smiles, wearing a suit and carrying a briefcase. She strides in, reaching to shake Leelee’s hand and present herself as the one in charge. “Angie Brooks,” she says. Dad and the candidate slouch in behind her, two peas in a pod. “This is my husband, Derek, and daughter, Emmaline.”\nEmmaline is thirteen, skinny, shoulders hunched, doesn’t make eye contact. Hair a patchwork of different dye jobs. She wears waffle-stitch long sleeves to hide the cutting scars under a My Chemical Romance shirt that to Leelee’s eye looks like it probably belonged to Dad first. He’s also skinny and ill at ease, his hair a black roostertail that looks natural now but probably lent itself to quite a Mohawk back in the day.\nAngie hands Leelee the form. Emmaline sits in the chair farthest from Leelee’s desk and stares out the window. Her hand strays to her phone every five seconds, but she pulls it back, cutting glances at her mother. “She’s very powerful,” Angie says. “With the correct mentorship, absolutely Omega potential.”\n“That’s not up to me to decide,” Leelee says. She starts working through the form.\n“Mom,” the girl growls. “I want to go back to school.”\n“This is your future, Em,” Angie says. “You can miss half a school day.”\n“We’ll get you back before your art class,” Derek says, trying to mediate. “Then we’ll get to your lessons.”\nLessons. Some parents actually pay older heroes to cultivate kids’ powers. It’s one of the purest manifestations of NVP syndrome. Leelee hates these cases. She wishes she could tell Emmaline that she’ll survive and thrive, find her way despite her parents. But all Emmaline knows right now is she has some kind of power, but she doesn’t want it. Or of course she wants the power; she’s just terrified of everything that comes with it. Puberty is hard enough without mutant or metahuman latency starting to express itself. The halls of your average middle school, or high school, aren’t forgiving spaces when it comes to being different. Leelee thinks they’re better than they used to be, but still. Little Emmaline Brooks would just be Em the anime artist if she could. It’s the parents who seize on the possibility of powers, like showbiz parents, and the kids suffer. “One hundred percent Omega potential,” Angie says. “We have lots of people consulting who think she’s really destined for the top.”\n“Ma’am, you don’t have to pitch me,” Leelee says. “Your daughter will be evaluated at her demonstration. I’m just making sure the paperwork is in order.”\nShe’s looking down at Form 8774-D as Angie keeps going. “She can teleport, you know. Actually teleport, not just move really fast.”\nLeelee has already seen that in the III.d response field but she nods to be polite. “I see that, sure. Also the kinetic blasts, and the other…” Angie has checked a lot of boxes. “We’ll be vetting all of this in the demonstration,” Leelee says. “Is there anything you want to amend?” She looks up.\nDerek is looking out the window just like his daughter. Angie meets Leelee’s gaze. “We’re confident Emmaline will exceed your expectations,” she says. “She’s always been a very gifted child. Her test scores are off the charts.”\n“Good enough,” Leelee says.\nLeelee directs her next question to Emmaline. “Is everything in the form, or is there anything else I need to know?”\nEmmaline looks Leelee in the eye—the first time she’s made eye contact with anyone since they walked in the door. “I hate this,” she says. “I’ll do the stupid certification but I’m never going to be a superhero.”\n“That’s your prerogative, Emmaline,” Leelee says. “Completing the certification process doesn’t obligate you to anything.”\n“Although of course you’ll understand things differently when you get a little older and you aren’t quite so…contrary.” Angie’s grin is tight. There are going to be words in the Brooks household tonight.\n“So, what’s our next step?” Derek asks, again trying to keep his wife and daughter from going after each other.\nLeelee gives them the scheduling spiel, hands them the map, and watches them go. The girl looks over her shoulder at Leelee as she walks out the door, eyes deep and haunted, jaw tight. She’s on a thin edge. If her parents drive her too hard, she’s going to crack. Either go rogue or turn full villain. But if she can get through the next few years without her parents screwing her up too much, she’ll find her strength. Leelee’s rooting for her.\n“What would you do if we had a kid and the kid had powers?” Leelee asks Samir that night. Kids have come up before. He’s got a good job as a freelance programmer, they have enough common interests to have fun but enough differences that they have independent lives. His parents like her. Her parents like him. She’s thirty-three, so if she’s going to have kids it ought to be fairly soon. All this stuff churns through her head every time she has a kid client. It’s one of the ways she brings work home, and she hates it.\n“You ready to have a kid?” he asks.\n“Oh, I don’t know. Are you?”\nHe thinks about it for a little while. “Yeah. I think I would be.”\nShe lies awake that night, listening to Samir’s occasional snores and wondering what their child would look like. The future starts to take shape. She thinks she likes it.\nTuesday, 10:13 a.m.\nHer ten o’clock appointment is a young kid with a history of family trauma brought in by a distant relative who is involved in experimental science. Leelee’s seen this one before, dozens of times. Sometimes the kid can make ants do the Macarena and nothing else; sometimes the kid turns out to be a psychokinetic juggernaut capable of shaking Planet Earth out of its orbit. You never know until you work through their applications and decide whether to move them along for a demonstration and further screening.\nBrady Murthy is eight years old. His birth parents were casualties of the Calcutta Breach, along with approximately a hundred thousand other people. He was adopted as a baby by Maimuna and Gautam, both chemists. Began to show abilities…huh, Leelee thinks. “So, Brady, you started showing powers when you were two years old?”\n“That’s what my mom and dad say,” he answers. Cute, bright-eyed kid. Skinny, lots of energy. He fiddles with the bobbleheads on Leelee’s desk and Leelee doesn’t tell him not to.\n“It’s true,” his mother says. “When he was a toddler, he could touch a plant and the plant would grow.”\n“Now he can grow a tree from a seed to twenty feet tall, in just hours!” Gautam is bursting with pride. Real pride. Leelee loves to see that. Too many parents either treat their kids like freaks or go full NVP.\n“I wish I could ask for a demonstration,” Leelee says. She nods at her potted plants on the shelf by the window. “Those poor guys could use some help.”\nBrady’s out of his chair before either Leelee or his parents can stop him. He runs a finger along one leaf of a spider plant. With a crackling noise, it doubles in size and sprouts a dozen babies, its leaves becoming a darker shade of green.\n“Brady!” Maimuna snaps. “We are not to demonstrate here. You know that.”\n“Sorry, Mom.” Brady shuffles back to his chair, head down.\nGautam doesn’t care whether his boy was supposed to demonstrate or not. Barely able to contain himself, he points at the plant. “You see? A marvel!”\n“I do see,” Leelee says with a big smile at Brady. “And I’m grateful. I’ve had that plant a long time, and it never looked so good.”\nBrady smiles back. Leelee feels happy the rest of the day.\nSamir’s gone until Saturday, and Leelee enjoys the time by herself. He’s gone once in a while for gigs, people flying him here and there. She doesn’t have to keep track of it so she doesn’t, except usually she knows where he is. Detroit this time.\nShe stays up late watching the news, and irritatingly it’s all about superheroes because there’s been a huge battle against an army of invaders from an alternate Venus. The reconstituted Vanguard combined with the North Star Sentinels to repel it, but there was a lot of damage in Chicago. She talks to Samir about it late that night. “Good thing you weren’t there,” she says. “I know it’s dumb, but I worry whenever you’re traveling.”\n“I know, babe,” he says. “Nothing to worry about, though. Just work.”\nThey shoot the shit for a while about TV, stuff they saw on Instagram, the usual. When he hangs up, Leelee enjoys the peace and quiet. She misses him but sometimes it’s nice to have the place to herself.\nMonday, 4:44 p.m.\nThe home stretch of a Monday, one of the times of the week when a working girl feels a glimmer of hope. That wasn’t so bad, the mind says to itself. Only four more like that and we get another weekend. She’s working through her last screening of the day, and then things take a hard right into Bonkersville.\nHe sweeps into her office, six-six, broad shoulders, sensational hair. Long cape with a high collar, full costume. Trouble, thinks Leelee, but the kind of trouble that is sometimes worth it. This is not a professional assessment; she issues a mental apology to Samir who will never know about the little tremor she just felt deep down in her belly. “Good afternoon, sir,” she says. “You are…”\nWith a theatrical indrawn breath and a smoldering gaze, he proclaims, “You will know me as Brazagh-Nul.”\nLeelee makes a point of scanning her appointment ledger. “I’m afraid I don’t see any Braz…can you say that again?”\n“Brazagh-Nul,” again with the deep breath through the nose and the glower. So much for little tremors. Now he’s just annoying. Leelee knows she should, but she just cannot find any way to be sympathetic to his bullshit. “Yeah, I don’t…” She looks up at him again. Why are the handsome ones always so weird? “Can you spell that?”\nBrazagh-Nul huffs out an irritated sigh, collapses into a chair, and arranges his cape. “Brad Zigler.”\n“Ohhhhh, okay. There you are.” Leelee turns on her professional smile and says, “Let’s go through your materials, shall we?”\nZigler’s claims are quite extravagant. He has checked almost every box under the Matter and Energy headings and listed various artifacts under III.f with names unlike anything Leelee has ever heard. She wonders if Zigler belongs to that common subspecies of applicants who basically fill out the form as fantasy versions of themselves. Some of those cases are almost as sad as the kids with NVPs.\n“Mr. Zigler,” Leelee says carefully, not knowing whether Zigler is lying, delusional, or even possibly accurate in his self-assessment. “You sure have checked a lot of boxes here.”\n“The form can only capture the merest shadow of my powers,” Zigler says, his imperious demeanor restored.\n“Some people’s powers do fall between categories, it’s true,” Leelee says, just to be agreeable. “Okay, then. The next step will be scheduling your demonstration. Someone from our office will be contacting you—”\n“I will demonstrate nothing. Brazagh-Nul is not a performing seal.”\n“Part of the validation process involves a demonstration of the powers underlying the claim to metahuman or mutant status,” Leelee explains patiently.\nIt’s almost always the same. They make claims, and in their claims Leelee can see their hopes, desires, fantasies, fears. She could diagnose every single one of them more accurately than any shrink. Let someone write their own origin story, and they’ll tell you everything you want to know about what matters to them. But what most of them can’t do is back it up. At some point, Form 8774-D always trips them up.\n“Absurd,” Zigler says. “Yet if that is the price I must pay to escape the petty scrutiny of you and your bureaucratic anthill, very well.”\n“Okay,” Leelee says, mentally putting him into the No Help Under Any Circumstances category. Some people you bend the rules for, but not if they talk to you like that. “We’ll be forwarding this for further screening, as we do with all applicants. Someone will respond at the number you’ve provided to schedule your demonstration under controlled circumstances.” She holds out the map to the demonstration facility.\n“When?” Zigler snatches the map from her hand. “I cannot be made to wait for long.”\nLeelee keeps her tone level, but Zigler is really getting on her nerves. “Generally six to eight weeks. Now I’m sure we’re both aware of the time, so—”\n“I care nothing for the time.” Same imperious tone, and now Zigler presses against her desk so he can loom over her. “I care about you performing the service for which you earn your doubtless bloated salary, in a timely fashion!”\nShe shifts his category to her own personal ninth circle: WPOHIHWOF, Wouldn’t Piss on Him If He Was on Fire. “Someone will be contacting you, Mr. Zigler,” she says. “Have a fine rest of your day.”\n“You will address me as Brazagh-Nul,” he says from the door, and then he’s gone in a sweep of his cape.\nLeelee resists the urge to dump his file straight in the trash. He would deserve it, but it wouldn’t be the right thing to do.\nSo frustrating sometimes, this drive to be ethical.\nNow it’s five o’clock. She neatens up her desk and leaves, waving to Louise and Drogba as she heads out the employee entrance at the rear of the building. Usually she goes out the front, but assholes like Brazagh-Nul sometimes wait out front to hassle her after work, and Leelee can’t face that today. The distance to her Metro stop is about the same either way, so she strolls by the facilities guys smoking and the separate group of office professionals smoking and goes around the corner onto O Street. The BMMOA isn’t part of the big office complexes closer to the Mall and the Capitol. They’re stuck on Naylor Court, off the beaten path, on a block that’s mostly smallish condo buildings with the occasional interior designer or architect sprinkled in.\nShe meets Samir over on 9th Street, at an Ethiopian place they both like. It’s right around the corner from the BMMOA, and not far from the train home. He’s already there when she arrives, surrounded by appetizers because he’s a grazer. No big entrees for him. This works for Leelee. She likes to taste everything, too, and does while she fills him in on her day.\n“Can you believe that jerk?”\n“Brazagh-Nul,” Samir says theatrically, drawing out the last vowel. “Pretty good name for a D&D boss.”\n“That’s what I thought too!” Leelee sops up a meaty sauce with the last bit of injera and pops it in her mouth, which means she can’t respond when Samir says, “But I bet you got him calmed down. That’s really your power. Intuition, empathy…”\n“I am literally the most ordinary person in the world, Samir,” she says when she has swallowed her food. “I have nothing like a superpower.”\n“If you say so.” Samir’s looking at her like she said something funny, but Leelee doesn’t think it’s funny at all. She really doesn’t want people thinking she has a superpower.\nFriday, 2:26 p.m.\nFriday, of course it has to be Friday when for the first time in Leelee’s seven-plus years at BMMOA, the shit actually genuinely hits the fan.\nAs she is always insisting to Samir and the security guards, Leelee doesn’t have any superpowers. Unless you count an unerring bullshit detector and a knack for defusing potentially violent situations. What line would super-intuition fit into on Form 8774-D?\nThat’s what she’s wondering, idly, between appointments, when a client strides out of one of the inner offices shouting in a language Leelee suspects is alien. He picks up a desk and throws it through the interior wall between the waiting area and the offices. People sprint for the exits, but Leelee can’t get out without going past him, and anyway she’s mad. People can’t just bust up the BMMOA office.\nShe stands and shouts through her doorway. “Hey!”\nHe turns to look at her. “This is a US Government facility, sir,” she says, in her most commanding tone. “You’re going to have to leave.”\nFor a brief moment, she thinks it might actually work. He stops. He takes a step back. He considers her as if he is making initial observations of a never-before-seen species of invertebrate. Then she realizes that there’s a long distance—a galactic gulf, a dimensional rift—between appreciation of chutzpah and actual acquiescence. What really brings this realization home is the beam of magenta energy that lances out and destroys her desk, sending Leelee flying and covering her with blackened bits of particle board. Her appointment ledger drifts in charred flakes around her.\nIII.d for sure, she thinks. Given the magenta color and the overall personality of the MH, she’s leaning toward arcane energy. So, he’s one of the occult types, and those are always tricky because of the otherplanar and otherdimensional claims. How exactly is a mid-level administrator in a tiny office on Naylor Court supposed to check up on who’s mentoring whom or siphoning power to whom in Limbo or Gehenna or some non-Euclidean beach resort on the shores of a fucking sunless sea?\n“This is not how you optimize your certification process, sir!” she shouts over the general atmosphere of mayhem.\nLouise and Reggie swing into action right about then. This isn’t an ordinary baby super throwing a tantrum, though. It’s a whole different threat level, maybe not Omega but not merely Eta or Theta either. Somewhere around Mu? More than any of the security people have handled since the last time they saved the world, which was a long time ago. Drogba bursts out of the break room. Before he can do anything, the rogue super knocks him flat. Reggie’s cyborg eye shoots an energy beam that scorches the rogue’s back. With a roar, the rogue spins around—straight into a haymaker from Louise. He crashes through another wall, and Leelee sees an opening. She runs like hell for the front door, but before she can get there the rogue explodes back into the ravaged common area, his skin crackling where Reggie’s eye beam keeps hitting him. He leaps and tackles Reggie. Both of them crash into the security screening gate. Louise comes flying in with another series of thunderous punches, but they’re overmatched. The rogue flings them both off and spreads his hands. Magenta energy slashes across the walls and ceiling.\nLeelee has never heard a building collapse, but she’s hearing sounds that sure sound like what a building would sound like if it was about to collapse. And there’s no way out.\nUntil a super in a vibrant blue costume with a full mask punches up through the floor and leaps toward the rogue. The rogue tries to hit him with those magenta beams, but the blue hero is too quick. He ducks and feints and then he’s right on the rogue, staggering him with some kind of martial arts routine. With every blow that lands, blue energy crackles from his fists. The rogue reels back, blasting the front doors out of their frames as he tries to get away, but the blue hero is on him. They grapple out into the street, and Leelee follows, getting out the door just as the front of the building sags inward and collapses. A cloud of dust obscures the battling supers. Leelee doesn’t know which way to run. Occasionally a magenta beam lances out of the cloud. She does the safe thing and hits the deck near a parked car. The sounds of combat subside and the dust cloud dissipates. Leelee risks a glance over the hood of the car.\nThe blue hero is there. The rogue is unconscious at his feet. All of a sudden everyone for blocks around has their phones out. “That was scary,” Leelee says.\nThe super winks at her. “All in a day’s work, ma’am,” he says.\nMa’am? Leelee is thirty-three years old. What child—or what kind of cornpone con artist playing to the cameras—would call her ma’am? Also she does not recognize him, and she suspects he hasn’t been certified. He should probably be filling out Form 8774-D and meeting with her.\nBefore she can say any of that, though, the super is gone.\nThere’s a rumble and a crash and Louise appears in the rubble, digging herself out and then holding a slab up for Reggie and Drogba.\n“We are totally going to need a new office,” Leelee says.\n“Way things are lately,” Reggie pants, “they’re gonna move us to Silver Spring or some shit.”\nThey stand there for a while after the rogue super is taken away. Samir arrives, looking shaken, and pulls Leelee into a fierce embrace. “Sometimes I forget how dangerous your job can be,” he says quietly.\n“Babe,” she says. “It’s all good. The blue guy, he was pretty impressive.”\nIt is decided that they should all go have a drink, since there’s no way to go back to work. It’s a good decision. They all relax together. To Reggie, Louise, and Drogba, the day’s events are old hat, and it isn’t long before they’re talking about it like a game they all went to.\n“Hey, Leelee,” Drogba says. “I saw what you did in there. I was peeking out the break room door waiting to make a move, but you almost backed him down.” He glances at Louise and Reggie. “Did you guys see that?” They shake their heads. “Like a Jedi mind trick, you know?” Drogba turns back to Leelee. “Ever think you have a superpower?”\n“Why is everybody always asking me that? No. God, no. At least I hope not,” Leelee says, and then she’s apologizing in case she’s offended him and buying another round of drinks.\n“I’m telling you,” Drogba says. “Any intuition like yours, that ain’t natural.”\n“Hundred percent,” Samir agrees. Leelee glares at him. “What,” he says, “you want me to lie?”\nLeelee’s jaw is suddenly so tight she can barely get words out of her mouth. “I,” she says, “do not have a superpower. Okay?”\n“Yeah, okay,” Drogba says. Samir looks away.\nThat night she tells Samir she’s thinking about quitting. He nods and does what he always does when she talks about quitting, which is pack her a bowl. It has become something of a ritual, to the point where I’m thinking about quitting actually means Wanna get high? She says they should start using edibles like she always does, but there’s something in her that doesn’t want to let go of that burn deep in the lungs.\n“You worried you’re going to get hurt?” he asks.\n“Yeah,” she says. “Did you see what happened today?”\nHe watches the smoke drift out of his lungs up toward the ceiling. “I saw,” he says in that singsongy way he has when he’s considering carefully what to say next, “a situation, and people responding to the situation the way their excellent training prepared them to respond. Including you, babe,” he adds before she can get mad.\n“All in a day’s work,” she says bitterly.\n“Yeah, that was kind of over the top. But seriously, you kicked ass today. For someone with no powers, faced with that situation?” He extends a fist and Leelee feels the profound obligation to bump it. “Fuck yeah.”\nThey’re both pretty stoned. It’s nice. Samir has a way of making her feel centered, like he believes in what she’s doing more than she does, and that makes it a little easier for her to get up in the morning and do it all over again.\nThursday, 1:17 p.m.\nThe BMMOA office is rebuilt in an astonishing three days, thanks to the loan of a nanobot swarm from the headquarters of the Graviton Corps. Leelee enjoys the time off. Thursday morning she putters around in her office because the nanobots put some of her things in weird places. Putting a positive spin on this inconvenience, she takes it as a hint that it’s time to shuffle things around a little, freshen them up. She doesn’t have any clients until after lunch, which is chicken and rice from the halal food truck over by Logan Circle. Her mouth is still tingling pleasantly from the sauce when her one o’clock knocks on her office door.\n“Hi?” the applicant says, peering around the doorframe. “So sorry I’m late.” She strides to Leelee’s desk, extending a hand. “Veronica Kirstein.”\nLeelee shakes and takes in Kirstein’s presentation. Navy blue dress, knee-high boots with just a hint of heel. Nicely understated and confident…until you get to the six chunky gold rings, each with a different color stone. This sets off a little alarm bell in Leelee’s mind. “Nice rings,” she comments, to let Ms. Kirstein know she’s paying attention. “Security is supposed to scan potential alien or arcane artifacts.”\n“Oh, security,” Kirstein says with an airy wave. “They saw what I wanted them to see.”\nLeelee has an intensifying bad feeling about Veronica Kirstein. In her experience this feeling is never wrong.\n“I’m afraid that’s not really how we do things,” Leelee says. “I’m going to have to ask you to return to screening and—”\nIn the next moment, Veronica Kirstein whips off her dress, revealing a charcoal-gray costume, high at the thigh and low at the bust, accented with a blaze of orange in a fiery V at one shoulder. The dress disappears before it can flutter to the floor, and Leelee’s hair stands up as some kind of ambient energy propagates through the room.\nVeronica raises her arms, showing off some finely toned triceps and arching her back a little in classic Sexy Wizard Lady style. The rings leak a spooky radiance out into the room. Leelee can barely stop herself from saying, Hey, I also am in possession of boobs, so can you maybe show me something more interesting? Like a real actual filled-out Form 8774-D instead of pretending you’re in a Frazetta painting?\n“I am Lady V, and you will hear me!” she cries. “Soon the world will hear me!” Leelee suspects theatrical voice training. A copy of Form 8774-D appears on her desk, filling itself out in a flowing and quite legible cursive.\nOkay, she thinks. Pretty impressive, but still against the rules. “I will hear you, as soon as you return to security, check those rings, and start this procedure the way it’s supposed to be started.” Leelee’s voice is calm, but the demonstration of power right here in her office—especially right on the heels of last Friday’s disaster—has her alarm meter somewhere between nervous and terrified. The appearance of the form right after she was thinking about it is probably a coincidence, but still feels weird.\nDrogba appears in her doorway, flanked by Louise and Reggie. Leelee sure is glad to see them. “We got readings of some kind of power being used,” Drogba says.\n“You certainly did, you rent-a-thugs,” Lady V snaps. “My powers, which I used to walk right by you.” She turns her attention back to Leelee. “You have the form. By any reasonable standard, even a stupid bureaucratic one, I have amply demonstrated that I ought to be certified. Let’s get this done.”\n“It’s not really that easy,” Leelee says.\n“I’ve been working with the Vanguard Alliance,” Lady V insists, some of her bravado falling away. “Kind of teaming up, not officially as a member yet. And I fought the Apocalypse Battalion shoulder-to-shoulder with Captain Cosmic. I am legit.”\n“What do those rings do?” Leelee asks. “Where did you get them?”\n“That’s all on the stupid form!” Veronica shrieks. Visible energy is spreading from the stones, wreathing her arms. The colors get more intense. There are tears on Lady V’s face. She’s not in control.\n“Mm hm,” Leelee says.\nAt that moment Drogba does what the media used to call the String Thing.\nMaybe he couldn’t annihilate wormholes or rearrange space-time anymore, but he still has enough power to squiggle some particles around in Lady V’s mind and drop her to the ground in a brainwave state more or less akin to deep sleep.\n“Sorry,” he says as Louise and Reggie drag Lady V to the holding cell in the basement. Two in one week, Leelee thinks. She hopes it isn’t the start of a trend. “I feel for her, actually. It’s hard to get people to listen sometimes.”\n“I’m taking the rest of the day off,” Leelee says.\n“On your first day back? Somebody else is going to be Employee of the Month for sure.” Drogba nods at her desk. “You have to process her still, though, right?”\nVeronica Kirstein’s completed Form 8774-D is still on her desk. Leelee sighs and sits. Due to a scandal a few years back about backlogs and faked certifications, BMMOA regulations state that interviewers must process applicants into the system immediately at the time of their interview…apparently even if they are on the verge of losing their minds.\n“Catch a beer later?” Drogba asks.\nLeelee’s already typing, a slice of her mind also taking the time to admire Veronica’s handwriting. “Yeah. That would be good.”\n“The String Thing? Love that,” Samir comments later that night, when they’ve gotten him caught up. “Hey, what happens if someone actually does have powers but they don’t want to fill out the forms?”\n“Well, it’s technically illegal,” Leelee says, “but rarely prosecuted. The way my supervisor explained it, if they’re still good guys what’s the point of jamming them up, and if they’re bad guys they’ve got worse charges against them once they’re brought in.”\nSamir nods. “Good practical perspective.”\n“I never woulda filled out that form if I didn’t have to,” Reggie says. His cyborg eye burns bright yellow, an artificial glare incongruous against the backdrop of dark wood paneling and softly clinking glasses. Leelee doesn’t like this place very much, but Reggie and Louise love it. They like to parade their sacrifices in front of the masses. Especially the rich, self-satisfied, insular DC masses.\nReggie is a retired cyborg soldier from an alternate future Earth. He was catapulted through timelines by a process Leelee has never quite understood, and then drifted through various superhero associations before having some of his hardware burned out in the Battle of Saturn’s Rings. Not many people know his whole story, but with the cyborg parts and all the scars, Reggie doesn’t really fit in among the loosened-tie crowd at this place.\n“I think the certification process can also help people who are having trouble with their powers,” Leelee says. She’s thinking of Lady V, but also Emmaline Brooks. “I know sometimes people come into my office nervous or afraid, and by the time they leave they have a little peace of mind, you know?”\n“If there’s a government form for it, it can’t be that weird, right?” Samir’s chuckling as he says it, but Leelee thinks that’s exactly it. “Yeah. Plus you get a tax credit if you fill it out and work with a government-certified hero group.”\nLouise is shaking her head. “Maybe, but I think there’s probably a lot of people out there who haven’t gotten certified. I mean, a lot.” She leans toward Leelee, a twinkle in her eye. “You know what I mean.”\n“I don’t,” Leelee says primly. Samir is watching her with a pretty intense expression on his face, and she wonders why.\nTuesday, 6:14 p.m.\nOn Tuesdays Leelee often works late because she has a book club at seven anyway, so it’s not worth the trip home just so she can get back on the subway. She nods at the evening security guy—Alonso is his name, but she remembers seeing him in the papers when she was a kid as Viridian X. His superpower has something to do with intense expressions of the color green, which doesn’t sound like much, but Leelee has been at BMMOA long enough to know that verbal descriptions don’t always do a super’s power justice.\nThe book is supposed to be really good but Leelee dislikes books about rich people and their ennui and how they rediscover their love for life by doing things Leelee will never be able to afford. As a result, she doesn’t have much to contribute to the discussion. She has a strong sense that several of the other women in the group—there are no men—also hated it but don’t want to say so. After book club she calls Samir. He’s out with friends, subbing in for an absent member of his buddy Duncan’s trivia team. “Come meet us!” he shouts over the bar noise. They’re at the Alibi, which is more Leelee’s kind of place than the stuffed-shirt place they were at the other day. Big windows, upbeat music, people having fun instead of making deals.\nLeelee walks into the bar and looks around for Samir. She doesn’t see him right away, but she does see a couple of his friends. Duncan waves at her and beckons her over.\nThe hairs on the back of her neck stand up a fraction of a second before the bar’s front windows blow in. A coruscating sphere of energy, swirling in every color of the rainbow, drifts in as people cower behind the bar or in the short hallway leading to the bathrooms. Leelee stands and watches. The sphere dissipates, revealing a figure within, backlit by spiraling lattices of prismatic energy that all trace back to rings on the figure’s hands.\nOh, shit. It’s Lady V.\n“Hello, Veronica,” Leelee says.\n“Don’t give me that friendly professional shit,” she growls. “Where’s your friend who scrambled my brain?”\nLeelee shrugs. “I don’t know.”\n“I’m sure. Do you know that I can’t get certified now because you put my impromptu demonstration into your system as a symptom of unreliability?” Lady V floats through the air, a foot or so off the ground, in Leelee’s direction.\nLeelee finds this grandstanding pretty fake. “Well, Veronica, if you didn’t want me to write about it, you shouldn’t have done it in the first place.”\n“Oh, yes. I should be a good little girl and obey all the directives of dull, stupid bureaucrats like you. Very heroic.” She’s close to Leelee now, much too close, and Leelee discovers with terror that she can’t move. “Well, I have a message for people like you, on behalf of people like me. Stay out of our way. And I have a special message for your friend…” She closes her eyes and Leelee can feel a tickle in her mind. No, she thinks. Get out.\nLady V’s eyes open wide. “Oh. Interesting. Most people never know I’m there. Well, I got what I came for. Since your friend Drogba messed around in my brain to protect you, I’m going to mess around in yours. Just to show him, and all the rest of you,” she snarls, looking around the bar. A few people are still cowering under tables, and yep, there are phones out. What the hell is wrong with you people, Leelee wants to scream. She can’t talk, though.\n“Show you,” Lady V goes on, “what happens when you interfere with the natural order of things.” She returns her attention to Leelee and reaches out her left hand. The three rings on it are blue, pink, and green. “Let’s see,” she says. “Pink or blue? I’m not really feeling green. Why don’t you choose? Oh, wait, you can’t speak, can you?”\nLeelee remembers the blue hero from last week. She sure could use someone like that now.\n“Maybe both,” Lady V decides. A beam of pink energy sprouts from that ring, slowly growing toward Leelee’s face. Wreathing it are tendrils of blue. Paralyzed, Leelee watches them approach. If she could run, she would. If she could scream or beg, she might do that too. But mostly, as she faces what she assumes will be the end of her conscious existence, all Leelee can think is For doing my job? This is what I get just for doing my job?\nShe wishes she could see Samir again.\nThe blue tendrils have outpaced the pink beam. They writhe right up to Leelee’s face, so close she can see tiny fractal patterns inside them, endlessly repeating—until another flash of blue absorbs and redirects them. The pink beam hits her square in the forehead. The sensation is unlike anything Leelee has ever experienced. She’s outside herself looking down but she’s also blind, her skin prickles, she’s flooded with memories of things she hasn’t thought of in years—a puppy run over in the road, the day she learned to tie her shoes, a cruel boy making fun of her at a middle-school dance, the first time she ever saw the ocean.\nAll of that in an instant, before Lady V screams in frustration and whirls to meet her attacker. The blue hero from last week flashes into view with a flying kick.\nLeelee collapses. She can’t form a coherent thought and something seems wrong with all of her senses.\nTheir fight is brief but devastating, at least to the bar. Light bulbs explode, rows of liquor bottles detonate, Lady V tries to annihilate the blue hero with sweeping beams of energy and he dodges them like a master thief somersaulting through security lasers. When he gets close, he delivers a staccato series of punches and kicks, each accompanied by those actinic blue flashes.\nThis would make a great TV show, Leelee thinks. But probably everyone thinks that about their job.\nShe’s drifting into some kind of fugue and loses track of time. When she can focus her eyes again, everything is quiet except for sirens approaching. There’s no sign of either Lady V or the blue hero. A few people are emerging from their hiding places, murmuring to each other in the kind of reverent tone people take when they’ve survived a brush with death.\nLeelee feels like someone has put her brain in a KitchenAid. Also her body seems to be moving, and she doesn’t know why until Samir is there, suddenly, cradling her. “I looked for you,” Leelee says. “Where were you?”\nHis eyes are so beautiful, deep and dark and caring. She smells ozone. “Kinda embarrassing, but I got stuck in the bathroom,” he says. “I got here as soon as I could.”\nLeelee has that feeling. She’s never wrong.\nRight before she passes out again, she understands.\nSaturday, 8:33 a.m.\nShe’s in the hospital for a couple of days getting various workups on her brain, which seems to be getting itself together pretty well, so they let her go home Friday afternoon and she crawls into bed and sleeps for sixteen hours. In the morning she goes into the kitchen and just sits, listening to the birds chirp and watching the morning light on the grain of the kitchen table.\nSamir comes down a little while later. She lets him make coffee before she says it. “When were you going to tell me?”\n“Um,” Samir says. He sits across from her and sips his coffee. “Tell you…”\n“Samir,” she says. “You saved my life twice in a week and don’t get me wrong, I’m really grateful for that but it also means that you’ve been lying to me for like three years, and that puts me in a very confused place.”\n“I’m sorry, Leelee,” he says. “I didn’t lie to you just to lie to you.”\n“I’m not sure it matters why,” she says, although of course it does. A silence stretches out until she can’t help but ask, “What do you call yourself?”\n“I never could decide,” he says. “But the leadership, they decided on Electric Blue.”\n“That’s not bad, I guess,” Leelee says. “Wasn’t that a song?”\n“Was it?” Samir’s musical taste runs to techno and ambient stuff. He never knows anything playing on the radio. “So,” he says. “I know how you must be feeling…” He trails off. There’s a distant look on his face, like he’s listening to a voice only he can hear. Leelee’s intuition, or maybe it’s her suspicious nature, locks in on a possibility. “Are you…did you plan this conversation? Like, you rehearsed it?” When he doesn’t say anything right away, Leelee sits up straighter. “You did, didn’t you?”\n“I did, yeah.” His voice is quiet, introspective rather than ashamed. “They wanted me to because they knew eventually you would figure it out. But I’m messing it up.”\n“They? Are you in a group?”\nHe tries to lighten things up. “You’re filling out the form in your head, aren’t you?”\nThis makes her mad because she has in fact been filling out Samir’s Form 8774-D in her head and it infuriates her to be predictable. “Fuck you, Samir! You should have told me! You know I could lose my job. You know I—do I even know you? What other secrets do you have?”\nHis infuriating smile. “I…wet the bed until I was in high school?”\n“Goddammit! It’s against the law! A law, I will remind you, that I sort of help administer?”\n“Babe,” he says, obviously trying to placate her, but for some reason this doesn’t make her angry. That is one of Samir’s gifts. He never seems to be doing anything for the wrong reason. “Babe. I know. But you said yourself they never prosecute anybody. I mean…are you going to turn me in?”\nShe puts her face in her hands, takes a long deep breath down into the belly, lets it slowly back out. No, she’s not going to turn him in. But having an outlaw supe for a boyfriend sure wasn’t on her list of things she expected to happen in her thirties.\n“Yes, I’m in a group,” he says. “And they asked me to get you to tell me when someone really powerful comes through your office. I told them I wasn’t going to put you in that position, and they backed off.”\n“Who?” Leelee asks.\nHe tells her. My god, Leelee thinks. The Quantum Polyhedron. She knows that group. Everyone knows that group. They pulled off the Vacuum Counterstrike, the famous infiltration of a lava tube base under the Mare Serenitatis that permanently crippled the Eschaton Triad.\n“So, they want to use me to recruit,” she says.\n“Yeah.” He leans back, looks out the window. She gets a good look at his profile in the morning sunlight. Her heart quickens a little. “Recruitment is a big deal for the top groups,” he says. “Some people take it a little too far. The QP, they really want someone on the inside at BMMOA.”\n“I don’t want to make you feel bad, but is that why they wanted you? To get to me?”\n“I’m pretty sure I had something to offer them anyway,” he says. “But they did mention you from the beginning.”\nThis makes her feel better, like she has value even though she’s not a supe.\n“There’s a shapeshifter in the group who suggested he could take your place,” Samir says, reluctantly. “I told him I’d kill him if he tried.” He makes that little noise in his throat that always means he’s about to say something else but is holding back. Eventually he lets it out. “So, um, he tried.”\n“Oh my god,” she says. “So that wasn’t Lady V in the bar?”\n“No. He had some plan to take you somewhere after he’d put on a show as Lady V. We found her. She’s all right, he needed to keep her alive as a patsy. She’s pissed, especially because the QP has her rings now. Anyway, that’s why I’m probably going to be out of the QP any minute now.”\n“Good,” she says. “You’re better off without them, and they will totally lose their government contracts if they’re using unregistered talent.”\nShe lets it drop for a while, but a couple of hours later she walks into the living room where he’s sitting on the couch watching soccer. She stands between him and the TV.\n“Are we going to make it, babe?” Relationships between normal people and supes are notoriously doomed. There are TV shows about it, millions of TikTok videos, an entire self-help industry. Everybody knows. And that’s what Leelee is, just an ordinary person.\n“Not if you keep standing in front of the TV when Liverpool’s on,” he says.\nShe looks over her shoulder. It’s halftime and the studio talking heads are bantering. “Oh, please,” she says. She really wants to be angry at him—is angry at him—but several years of working at the BMMOA has taught her that secret identities are just part of the game.\nPlus, Leelee knows Samir. She knows that his sincere smile is a little crooked, she knows the way his crow’s-feet soften when he can tell she’s worried or sad. He’s never been anything but loving to her. If that’s all an act, she’s going to go along with it. There’s a new ride ahead of her—of them—and Leelee wouldn’t want to take it with anybody else. Even if he did apparently call her ma’am once.\nThe decision made, she slides onto the couch next to him, nestles under his arm and exhales, long and easy. “You won’t tell anybody, will you?” he asks.\n“Babe, no. Of course not.” She snuggles closer. Work is work and her life is her life. “It’ll be our little secret.”\n“Whatever you do, don’t make me fill out that form.”\n“It’s really kind of compulsory,” she says. “But I don’t have any enforcement powers.”\n“I can live without the tax break,” he says.\n“Sure,” Leelee says. On the screen there’s a local news break before the second half of the Liverpool game. The midday anchor puts on his concerned face and introduces a piece on budgetary consequences of super battles. The main interviewee is a city councilor who suggests the price of supers might be cuts to education funding.\n“You should be a TV reporter,” Samir says. “The way you can sense bullshit, you’d ask the best questions.”\n“Oh my god.” Leelee shudders. Her, on TV? “As if.”\n“You do have a power, you know,” Samir says. He watches her, waiting. Leelee feels like she’s being tested. She wonders how many conversations in the Quantum Polyhedron’s subterranean hideaway are lurking behind this moment.\n“No,” she says, looking him in the eye and daring him to make a sound. “No, I don’t.”\n“Form 8774-D” copyright © 2023 by Alex Irvine\nArt copyright © 2023 by Zoë van Dijk\nBuy the Book\nForm 8774-D\nSuch a fun story, loved the way the beurocratization of superpowers concept was executed. Made me feel like I was watching The Incredibles for the first time again! Still wondering who Valeria is though…\njust so she can get back on the subway.\nNo long-term local would call the Metro the subway. Even if they really wanted to they’d get tired of everyone else mocking them for it.\nLoved it! Thanks!\n@7–I agree! More, please!\nVery enjoyable; got started and kept reading. Thanks\nI loved this! It has “Laundry Files” vibes in the best way.\n@don — I thought that, too, but I decided the author used the generic term deliberately since other DC details are accurate.\nThe line about everyone thinking their job deserves a TV show made me laugh.\nThanks for reading, everyone!\nLove how much worldbuilding was done through a government form. At least bureaucracy is good for inspiration. Such a fun read.",
  "word_count": 9558,
  "scraped_at": "2026-02-14T12:15:16.871303"
}