{
  "article_id": "b902b9a3f0ed",
  "url": "https://www.offalyindependent.ie/2025/05/25/sundays-briefing-arsenal-conquer-europe-and-premier-league-set-for-finale/",
  "title": "Sunday briefing : Arsenal conquer Europe and Premier League set for finale",
  "date": "20250525T103000Z",
  "domain": "offalyindependent.ie",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Sunday’s briefing: Arsenal conquer Europe and Premier League set for finale\nBy PA Sport Staff\nArsenal pulled off a major shock as they beat the mighty Barcelona to lift the Women’s Champions League trophy for the second time.\nIt was a big day too for Sunderland’s men, who came from behind to beat Sheffield United in the Sky Bet Championship play-off final at Wembley to seal their return to the Premier League.\nThere was also heroics from Aberdeen, who denied Celtic a domestic treble by beating them on penalties to claim the Scottish Cup.\nSkipper Kim Little was celebrating the best moment of her career as Arsenal stunned holders Barcelona to claim the Champions League title for the second time.\nSweden international Stina Blackstenius came off the bench to score the only goal with 16 minutes remaining to edge the Gunners to glory in Lisbon.\nLittle said: “We knew coming into this game that we basically had to be perfect. It’s very special for me. I’ve been at the club a very long time and we have had incredible periods where we have been successful.\n“The club won it in 2007 and I signed the year after that. To still be at the club now and see how much it has done to progress the women’s game and invest in us as players and as a club, it is truly special to be sitting here now today off the back of winning the ultimate trophy for club football and it is definitely the best moment of my career.”\nRegis Le Bris admitted Sunderland’s return to the Premier League was “impossible to predict” when he arrived at the Stadium of Light last summer.\nThe 49-year-old Frenchman guided the Black Cats to a 2-1 Sky Bet Championship play-off final victory over Sheffield United and the estimated £220million (€262 million) that came with it when Tommy Watson scored a stoppage-time winner at Wembley to end the club’s eight-year exile.\nLe Bris, who took up the reins after the club had finished in 16th place, said: “It was impossible to predict. They played fantastic football sometimes (last season). Against Southampton they won 5-0, so it was clear that it was possible to play very good football and to be efficient and very dominant.\n“But at the same time, they were so inconsistent, so my job was to give the methodology to bring this consistency.”\nAberdeen goalkeeper Dimitar Mitov struggled to describe his emotions after becoming a Dons hero at Hampden Park.\nMitov saved from Callum McGregor and Alistair Johnston to seal a 4-3 penalty shoot-out win over Celtic in the Scottish Gas Scottish Cup final and take the trophy back to Pittodrie for the first time in 35 years.\nThe Bulgarian said: “I think I’ve got about 500 messages already from back home. Everybody’s super happy, everybody’s super proud.\n“And listen, it’s moments like this, that’s why we play football. And nobody can take away this from us now because I’m sure we’re going to be heroes forever.”\nThe Premier League reaches its conclusion with only European qualification still to be settled in the final round of fixtures.\nChampions Liverpool, who host FA Cup winners Crystal Palace, and Arsenal, on the road at relegated Southampton, are already assured of Champions League spots, but Manchester City, who travel to Fulham, Newcastle, at home to Everton, and Manchester United’s visitors Aston Villa will battle it out for the remaining three with fellow contenders Nottingham Forest and Chelsea meeting at the City Ground.\nElsewhere, Charlton and Leyton Orient go head-to-head at Wembley in the League One play-off final as they attempt to secure a place in next season’s Sky Bet Championship.",
  "word_count": 614,
  "scraped_at": "2026-02-14T12:43:24.670151"
}