{
  "article_id": "b93e471508ff",
  "url": "https://www.redlandsdailyfacts.com/2024/04/13/swanson-sparks-dont-deserve-caitlin-clark-anyway/",
  "title": "Swanson : Sparks dont deserve Caitlin Clark anyway – Redlands Daily Facts",
  "date": "20240414T000000Z",
  "domain": "redlandsdailyfacts.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Don’t know how closely you were following this stuff Dec. 10, when the WNBA had its draft lottery, but the Sparks came really close to getting the No. 1 pick this year.\nAnd by now, I know you know what that would’ve meant.\nThink about the spark Caitlin Clark would’ve provided in L.A., about the inferno that women’s basketball’s major headliner could have started here. How blessed we Angelenos would have been to have had a front-row seat to see USC’s JuJu Watkins hoop all winter and then to see Clark do the same in the summer as a member of the Sparks.\nAnd I’m sorry, but I’m glad it’s not happening.\nOn Monday, the Iowa sensation and all-time NCAA Division I scorer, who led her team to consecutive championship games and helped spur historic TV ratings, will be drafted No. 1 by the Indiana Fever. The Sparks will pick second – and fourth.\nIt’s just as well. And not because of the Des Moines native’s affinity for mid-major midwestern cities (“I’ve never been to Cleveland before,” she gushed after arriving in the city for this year’s Final Four. “It’s been awesome, honestly!”)\nBut because the Sparks are ill-equipped to control such a burn.\nClark on a heater is must-see theater, attracting history’s largest women’s basketball crowd – 55,646 fans – for an exhibition at Iowa’s football stadium last year. She sold out or broke attendance records in 30 of 32 games this past season, boosting crowds at road games by more than 150%.\nBut as a Spark – because L.A.’s WNBA team again has to temporarily relocate its games, this time on account of construction at Crytpo.com Arena – Clark would play her first five regular-season games as a pro at Long Beach State’s Walter Pyramid, capacity 5,000.\n(She actually figures to play her sixth WNBA game there, when L.A. gets the Fever on May 24 for a game that’s long been sold out. Tickets on vividseats.com ranged from $193 to $1,096 on Saturday.)\nSo what? A few thousand people being able to brag about seeing Clark in an intimate venue, like Prince playing the Troubadour in 2011? That would’ve been just the start of her career, not the end of the world.\nOK, but consider this: As a Spark, the generational shooter would not have a dedicated, private space to get up shots outside of the team’s allotted practice hours.\nOwned by a group including Mark Walter, Magic Johnson, Stan Kasten and Eric Holoman, the Sparks have bounced around in recent seasons. The professional basketball team with a rich 27-year history has been a vagabond in its own city, moving between El Camino College and Jump Beyond Sports in Torrance, Academy USA in Glendale, L.A. Southwest College, USC’s Galen Center, Windward School.\nImagine that instead of having the type of 24-hour access to a closed gym that Watkins had at Galen Center before her 51-point outburst against Stanford this season, the utterly recognizable Clark having to roll up to a 24 Hour Fitness to get up shots.\nPicture a player developing patience waiting for my kids to clear off of one of all those public courts in L.A. that Clippers owner Steve Ballmer had renovated and adorned with his team’s logos?\nI’m kidding, kind of – they’d better make way for a WNBA player.\nBut I’m serious, too: “I’ve never had a practice facility where I could just go get shots up at night, we’ve always shared a practice facility,” Candace Parker said on Draymond Green’s podcast in 2023.\nParker was the face of the Sparks for the first 13 of her 16 WNBA seasons – and a player, by the way, whose name should come up immediately in these women’s basketball G.O.A.T. debates you’re all suddenly having. And last April, she told Green, the NBA star: “I have not had a locker in my entire career I’ve been in the WNBA. I have not had a locker that has my name on it and I can leave my (stuff) and then come back and know my (stuff) gonna be there.”\nGreen, incredulous: “Really?”\nReally. She has one now, though, as a member of the two-time defending champion Las Vegas Aces, one of the WNBA teams that has invested in new facilities. Theirs is a $40 million, state-of-the-art headquarters that led a growing trend that’s reshaping the league.\nThe Phoenix Mercury’s $100 million practice facility is scheduled to open in July and the Seattle Storm’s new $61 million facility helped lure longtime Sparks stalwart Nneka Ogwumike away from L.A.: “I honestly never thought I’d play in a facility that was my own,” she said at her introductory news conference. “I realize I’m stepping into a physical representation of my worth, being in a facility like that.”\nAnd yes, Indiana can offer Clark a recently upgraded locker room, weight room, practice court – all of those bells and whistles that would seem, in most leagues, to be necessities, and which helped attract another former Spark, Santa Ana Mater Dei’s own Katie Lou Samuelson, in free agency. “Seeing the locker room and seeing the practice court and seeing all these resources that I haven’t necessarily had as a player yet,” she said, “was something that was really important to me.”\n\"I don't think I've ever had my own locker room.\"\nKatie Lou Samuelson checks out everything the Fever facilities have to offer, including the state-of-the-art exclusive team locker room ❤️ pic.twitter.com/VMI0wer1fj\n— Indiana Fever (@IndianaFever) February 2, 2024\nL.A. is now one of the last WNBA locales where, no, there’d be no locker labeled “Caitlin Clark” for her to leave her (stuff).\nStory as old as time. Haves and have-nots.\n“Where in sports and in industry is there not essentially – for a lack of a better term – an arm’s race going on?” the Sparks’ new general manager Raegan Pebley told my SCNG colleague John Davis during her introductory video conference in February.\n“What I will tell you, is what happens when bamboo is planted, it grows down before it breaks through the soil,” she added, alluding to pastor Michael Todd, whose sermons reference the power of the plant. “Bamboo, you won’t even see it break through the soil for up to even three years, and then once it breaks through, you start to see it grow rapidly …\n“We are experiencing that stage in the L.A. Sparks organization where we’re really close to breaking through soil. It requires patience, I realize, it requires grace. There’s things going on underground that are unseen by everyone else, but the fruits of those labors will happen and we will be as competitive as anyone.”\nWhat the Sparks have, then: Hope, and belief. And patience.\nAnd those Nos. 2 and 4 picks in a draft class loaded with top-end talent.\nThe Sparks are calling those “foundational” picks, and whether it’s Cameron Brink or Kamilla Cardoso, Rickea Jackson or Angel Reese, they’re right. These are players who could, in the long run, help fortify a franchise that finished 17-23 last season and missed the playoffs for the third consecutive season, and whose infrastructural disadvantages are hurting them in free agency.\nThey have Curt Miller, a winning WNBA coach who has a proven track record of turning around teams’ fortunes.\nThey have Christine Monjer, a new team president to oversee business operations, whose marketing savvy helped make the Aces so popular in Las Vegas and beyond.\nAnd they have you, L.A., a desirable locale for most young professionals. A big city that’s proved it will support women’s sports.\nAngel City, the National Women’s Soccer League team down the street, averaged 19,756 fans per match last season. And this season’s USC-UCLA women’s basketball showdowns sold out Pauley Pavilion and the Galen Center, with both teams then averaging better than 8,500 fans at their respective first- and second-round NCAA Tournament games.\nBefore that, the Sparks were long among the top two draws, league-wide, in all but three of Parker’s non-COVID seasons here. They averaged 10,000 fans per game over those 12 seasons (but fewer than 6,600 people per game the past couple).\nWhat don’t they have? Ogwumike, Parker, Chelsea Gray – former Sparks stars, the latter two of whom became champions again once they left.\nDon’t have a practice space of their own. Don’t have their own lockers.\nDon’t have the No. 1 pick.",
  "word_count": 1398,
  "scraped_at": "2026-02-14T12:57:36.409384"
}