{
  "article_id": "b9400d1b8053",
  "url": "https://www.90min.com/posts/international-break-threatens-arsenal-momentum-chelsea-clash",
  "title": "International break threatens Arsenal momentum ahead of Chelsea clash",
  "date": "20231127T150000Z",
  "domain": "90min.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "International break threatens Arsenal's momentum ahead of Chelsea clash\n- Arsenal face Chelsea at the Emirates Stadium after the December international break\n- The Gunners are in flying form but sending 20 players on international duty\n- Defeat would extend Chelsea's lead at the top of the WSL table to six points already\nBy Emily Keogh\nEight wins on the bounce after a slow start to the season shows Arsenal have finally kicked into gear. But with a top-of-the-table clash against Chelsea next on the cards, this international break beforehand threatens to disrupt the Gunners' momentum going into the crucial fixture.\nArsenal began their season in the worst possible way, dropping points to Liverpool and Manchester United. Their lacklustre start raised questions over the capabilities of the star-studded squad vying for the WSL title. But as more and more games rolled around, Jonas Eidevall's side found their feet.\nArsenal are not in the Champions League this season, having lost to Paris FC on penalties in the first qualifying round. Without any continental football, the entire focus is on reclaiming the WSL title they have not won since 2019 - too long for a club of their prestige and history.\nNow almost a third of the way through the season and, eight games of 22 down, Arsenal have 19 points from a possible 24 as the domestic calendar pauses for UEFA Nations League and various international friendlies. They sit three points behind reigning champions and leaders Chelsea.\nArsenal are simply flying right now. Putting three past struggling West Ham United over the weekend, they have racked up eight consecutive wins in all competitions and are now firing on all cylinders.\nIt stoppage time goals against Manchester United and Aston Villa in the first three fixtures just to rescue four points from those games. But then Arsenal pulled off an impressive 2-1 win over top three rivals Manchester City to set themselves into motion.\nRecording key wins over Bristol City and Brighton & Hove Albion too, no game was then more ruthless than Arsenal's dramatic comeback against Leicester City. The Foxes scored twice in the first half before Eidevall's Gunners managed six of their own without reply in the second half alone in a brutal display that was reminiscent of Arsenal in their former prime.\nThe Gunners face Chelsea in their next league fixture in what is hoped to be a first WSL sell out of the Emirates stadium. This is arguably already a must-win game for Arsenal in order to catch up to the champions and prevent them from sealing their fifth consecutive title.\nA victory for the Gunners would move them level on points with Chelsea. A loss would open the gap to six points between the Blues and the rest of the table before even the halfway mark of the season.\nBut this fixture falls on the other side of the international window, which comes at the worst possible time for the Gunners in light of their momentum coming into it.\nPlayers now head to their national teams for nine days, with high stakes Nations League fixtures taking full focus for the 15 European players dispersing across the continent for the final two games of the group stage. Arsenal's Australian and Canadian cohort also head to North America to face off against each other in two friendlies in Langford and Vancouver, both British Columbia.\nBeth Mead is fully back from her ACL injury, scoring a brace against the Hammers to celebrate her recall to Sarina Wiegman's 23-player squad for upcoming games. Dutch duo Vivianne Miedema and Victoria Pelova face the Lionesses at Wembley Stadium in a must-win game for both sides to top Group A, earn a place in the Nations League finals, and qualify for the 2024 Olympics.\nWhilst the international break provides some breathing room for injured players to return to full fitness, the pause raises key concerns for balancing fatigue and fitness issues.\nAfter the break concludes, Arsenal have only a four-day turn around before facing Chelsea, then Tottenham twice to see out the calendar year. The five players heading to Canada play a friendly on 6 December and will have only a two days in training before facing the Chelsea game 10 December.\nOf course, this impacts Chelsea too. Sending Sam Kerr, Ashley Lawrence and Jessie Fleming across the Atlantic, with the likes of Lauren James, Erin Cuthbert, Zecira Musovic and more being involved in the thick of Nations League action will cause similar problems for Emma Hayes.\nChelsea skipper Millie Bright is already ruled out of the England squad with a knee injury and the break provides a key chance for the Lionesses centre-back to return to full fitness ahead of the London derby. Guro Reiten and Melanie Leupolz have both also been absent from Chelsea's most recent string of fixtures through injury, but there is no timeline on their return.\nChelsea have a far more impressive record returning from internationals than Arsenal. They put six past Aston Villa in their first fixture after the October break in a ruthless display.\nWith Manchester City and Manchester United sitting six and seven points respectively behind Chelsea already, the only team feeling like they have a real chance of dethroning the Blues is Arsenal.\nBut if the international break provides the likely caveats, a loss when the WSL returns next month could be hugely detrimental to Arsenal having any chance of keeping up with their great rivals.",
  "word_count": 911,
  "scraped_at": "2026-02-14T12:22:13.611421"
}