{
  "article_id": "b95d03dd8696",
  "url": "https://theathletic.com/4286720/2023/03/08/lionel-messi-miami-mls/",
  "title": "Will Lionel Messi come to MLS ? In Miami , everyone has an opinion",
  "date": "20230308T153000Z",
  "domain": "theathletic.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "The Hard Rock Hotel and Casino in Hollywood, Florida looks like it was designed by an eight-year-old on the back of a napkin. The locals here call the building the “guitar hotel,” and it’s easy to understand why – it is shaped, quite simply, like a massive electric guitar.\nWander through the place on a Saturday night and you’ll hit sensory overload in a matter of minutes. There is a cacophony of noise: crying children, yapping adults and the continuous drone of a thousand slot machines.\n- Lionel Messi transfer live updates: Follow the latest as World Cup winners nears Inter Miami move\n- Inter Miami pushing to land Lionel Messi over Barcelona, per sources\nWe haven’t come to the guitar hotel to bathe in second-hand smoke and lose our life savings. We’ve come here in search of something even worse for our health: the Messi burger.\nAdvertisement\nSeveral months before the 2022 World Cup, Lionel Messi partnered with the Hard Rock Cafe to produce a line of merchandise and a hamburger that would appear on Hard Rock menus everywhere. The deal was only supposed to be a limited engagement. Then Messi won his first World Cup and became immortalized as perhaps soccer’s greatest-ever player. The partnership was extended, and the food item enhanced.\nThere’s no need to dive into the specifics of the sandwich, but it is about what you’d expect out of a $20 hamburger at a multinational concept restaurant: somehow filling and unsatisfying all at once.\nNevertheless, our server informs us that the Messi burger is the restaurant’s most popular item. A quick scan of the dining room tells us that’s more than a sales pitch — Messi burgers are being eaten in every corner of the place. A few tables over, we see a party of five, and every single patron has a Messi burger in front of them.\nSince almost the moment the team’s founding was announced, MLS side Inter Miami has been linked to Messi. Everyone at the table of Messi burgers is keenly aware of this. The five are part of Miami’s sizable contingent of Argentine immigrants, and all have their own opinions about the players’ future.\nOne of those diners is Germán, a 52-year-old who made the trip to Qatar this past winter to see Messi play in the World Cup final. His excitement is palpable. He has a friend close to Messi’s camp, he says, who tells him the club and player are close to an agreement. It’s the sort of statement that hardly seems believable, but here at this table, in this rapid-fire conversation over a half-dozen Messi burgers, it feels right.\nIf you speak to the people who are actually close to Messi, or to sources close to Inter Miami itself, you’ll get wildly different viewpoints spoken with equal amounts of passion. One source, who was granted anonymity to protect his relationships with Inter Miami, told The Athletic last week that a deal with Miami was all but done, with Messi being promised a small ownership stake in the MLS club. Another bristled at the idea that Messi would ever come to the United States, suggesting he still wants to play at the highest level.\nIn the end, the decision lies with Messi.\nAdvertisement\nIt is not an easy one. Does he remain at PSG, at the highest possible level? Does he choose to return to Argentina, to a glorious homecoming at his hometown Newell’s Old Boys in Rosario? Does he imitate his generational rival Cristiano Ronaldo and take a Middle Eastern payday?\nOr, does he come to the U.S. in search of adventure?\nInter Miami head coach Phil Neville has dealt with his share of superstars as an assistant coach at Manchester United and as head coach of the English national women’s team. Even at Miami, an MLS club still in its infancy, Neville was handed a squad that included former Real Madrid great Gonzalo Higuain and France World Cup winner Blaise Matuidi.\nBut Messi? In a way, managing the Argentine great and the circus that would surround him would be Neville’s greatest-ever challenge. Inter Miami’s reality would change entirely.\n“Things will be different,” Neville says. “The trees might have to be bigger (around the training ground). The security might have to be tighter. The walk the players have today over to that stadium, that might have to be different. The travel might be different. The hotels we stay in might have to be different. But really that might be what we’re aspiring to be like anyway. It’s exciting, but I think it’d be a massive challenge.”\nNeville is sitting at his desk on the upper floor of Inter Miami’s training ground, located just to the north of DRV PNK stadium, Inter Miami’s temporary home. The facility isn’t located in Miami proper, but rather in a somewhat unglamorous stretch of nearby Fort Lauderdale, surrounded by tire shops, a roofing supply company and a used car dealership. But even here, the wealth that defines so much of the Miami area is inescapable. Look out the large, glass windows of Neville’s office and you’ll see the other thing that borders the training facility: the local executive airport, where the city’s wealthiest residents park their private jets.\nAdvertisement\nMore than any other city in the United States, Miami has become a destination for global footballers, particularly South Americans. Messi himself owns property in the city and has visited frequently. Argentina’s federation is building a training facility in the area. Owners and administrators at Inter Miami are very aware of all of this, and feel the city is a very strong recruiting tool.\n“When (players) land in Ft. Lauderdale,” says Neville, “or Miami, there’s places we can take them that will probably guarantee that they or their family will want to come to Miami. Whether they’ve got a wife and kids or whether they’re single. So that’s our biggest selling point.”\nNeville is thoughtful and careful when he talks about the club’s links to Messi. You get the feeling that many at the club would rather not discuss the potential deal at all, but not speaking about this particular player is simply not an option. On the very day David Beckham announced the franchise, Messi reached out on social media to congratulate him and stoked the flames of a potential move. “Maybe in a few years,” Messi said, “you can give me a call.”\nAt the time, Messi was a Barcelona player and it seemed as though he’d retire as one. But after an acrimonious breakup, he left for Paris Saint-Germain.\nBeckham himself was dealing with his own struggles at the time, navigating the harsh realities of trying to get a stadium deal done amidst widespread backlash from locals. Even after getting that deal over the line (Miami is expected to move into a new, downtown stadium in 2025), the waters have remained rough for Inter Miami. They were penalized by MLS for flagrantly violating MLS’ roster rules and struggled to compete in their opening two seasons. The club was always intended to be one of MLS’ few truly glamorous clubs, but it has lacked some of that luster playing in a temporary stadium outside of Miami proper. In 2022 Inter Miami ranked last in the 28-team league in attendance.\nThose are all short-term problems that would be solved by a better venue and a more competitive roster (though the club did make the playoffs in 2022). At its core, Miami still feels like one of Major League Soccer’s most promising franchises. The club is owned by a pair of billionaires (Jorge and Jose Mas) and Beckham, maybe the biggest celebrity footballer in the history of the game. The ceiling for Inter Miami is higher than it is for clubs in smaller markets.\nBeckham knows a thing or two about the effects a single star player can have on MLS. When he arrived at the LA Galaxy in 2007, the league was growing but still struggling for relevance. More than any other player in the league’s history, Beckham changed the profile of MLS and how it does business. He ushered in the era of the designated player – an MLS roster classification that allowed its teams to spend over their allotted salary budget on up to three high-profile stars.\nAdvertisement\nThe league has added 16 franchises since Beckham’s arrival and continues to add rules that increase overall spending on players. However, it has not yet earned the global respect it so badly wants and needs. Messi would certainly push things in that direction.\nYet in a vacuum, the idea of Messi playing for an MLS club feels farcical. The league has hosted its share of superstars — Beckham, Zlatan, Drogba and the like. But Messi? Just months removed from World Cup glory? Playing in Inter Miami’s stopgap stadium, in Fort Lauderdale? As big as those other players were, Messi’s signing would dwarf all of them, and be far more surprising.\n“I think this would be probably the biggest signing in history,” says Neville. “I can’t think of another star of that magnitude to come from a major footballing country to this place. This is maybe similar (to Beckham’s arrival), but maybe even bigger. I think you’re talking about one of the greatest footballers of all time. When you talk about Miami, we have to be in for players like that, you know?”\nDown the hall from Neville, Inter Miami sporting director Chris Henderson is similarly bullish. Henderson represented the U.S. at a World Cup and had a distinguished playing career in MLS. By the time he arrived in Miami in early 2021, he’d carved out his place as one of the more respected front-office figures in the league, a capable navigator of MLS’ web of roster rules. He speaks of Messi’s potential signing in the same business speak he’d use to talk about a college draft pick: Does the player fit the way Miami plays? What about the club’s philosophy?\nBut even Henderson understands the realities of incorporating Messi into Miami’s roster. Unlike other destinations, Miami would need to maneuver around a soft salary budget in order to add Messi. Just last week MLS commissioner Don Garber was surprisingly candid about the pursuit, suggesting the league and Inter Miami would have to “think outside the box” to craft a deal for him. Some say Messi will be offered a piece of Inter Miami itself, while others say Miami could cut him in on some of the real estate surrounding their new stadium.\n“What’s the knock-on effect on the rest of our roster?” Henderson asks, hypothetically. “What moves do we have to make? I mean, you really have to look two windows ahead in all of this. And as you’re signing players, you’re still signing players thinking, ‘Okay, what if this happens? What if these two come? What if?’”\nOne thing that feels beyond question to Henderson is Messi’s potential impact.\nAdvertisement\n“He would change sports here,” said Henderson. “Every stadium we went to, it would just be the biggest thing in the city at that time. It would just be amazing for our league. It would be like Michael Jordan, just would be the biggest thing imaginable.”\nMLS has to make its own considerations. Like Beckham before him, Messi’s deal might change the calculus of every big-name signing from here on out. If Messi gets 5% of Inter Miami, a team that could potentially be worth over $1 billion when it moves into its new stadium, you’d have to think that other players who approach his profile will want a similar deal if and when they come to MLS.\nThere’s no precedent for any of this, but then again, MLS has always been fairly good at making it up as time moves along.\nIn the early morning hours of March 2, shortly before 3 a.m., two armed men on a motorcycle stopped in front of a supermarket in Rosario, Argentina and opened fire. It was the latest instance of organized crime and gangland violence, which has led to over 50 homicides in the city this year. Rosario, the birthplace of Messi and where his parents and in-laws still reside, is currently Argentina’s most violent city. According to Clarín in Argentina, there were over 270 homicides in Rosario in 2022, a new record.\nFor locals, the news about fourteen bullets ripping through an empty supermarket in Rosario wasn’t a random shooting. The shooters’ target, Supermercado Único, is owned and operated by the family of Antonela Roccuzzo, Messi’s wife.\nThe Associated Press reported that the gunman left a sinister note which read “Messi, we’re waiting for you. Javkin is also a drug trafficker, he won’t protect you.”\nThat last line was a reference to Pablo Javkin, Rosario’s mayor, who immediately condemned the attack and said that Rosario is “a laboratory” for criminal activity. He also pointed the finger at local law enforcement for failing to protect the city.\nAdvertisement\n“It’s clear that causing harm in Rosario is easy to do and that Rosario doesn’t have any damn help at all,” Javkin said after the incident.\nThe shooting quickly became world news while simultaneously causing a political controversy in Argentina. When the nation’s defense minister Aníbal Fernández told reporters after the shooting that “the narcos have won,” it painted a ugly picture of the instability in one of Argentina’s most fabled football cities.\nRosario is home to Newell’s Old Boys and Rosario Central — two fierce rivals with rich histories who divide the city’s football loyalties. Newell’s home ground is named after legendary coach Marcelo Bielsa, with an upper tier of the stadium dedicated to Gerardo ‘Tata’ Martino, who starred as a player for the club and led Newell’s to a league championship as a manager in 2013. Rosario Central can claim World Cup winners Mario Alberto Kempes and Ángel Di Maria as club legends, among others.\nMessi, however, is far and away Rosario’s most famous son. He joined Newell’s as a six-year-old in 1994, dazzling local crowds with hundreds of goals and silky dribbling until he departed for Barcelona five years later. Messi has never shied from talking about a romantic return to his boyhood club.\n“Even as time has passed, my desire to (play for Newell’s) remains intact,” Messi told Argentina’s Sportia shortly before the 2018 World Cup in Russia. “I’ve always said that I’d love to play for Newell’s. It’s something that I still have left to do.”\nDuring a recent interview with Brazilian outlet UOL, Messi’s former international teammate and close friend Sergio “Kun” Aguero swung the pendulum in Newell’s favor.\n“He’s seriously considering the possibility of playing for Newell’s,” Aguero revealed. Maxi Rodríguez, a former Argentina World Cup hero who retired with Newell’s in 2021, was on hand for the interview and quickly intervened.\nAdvertisement\n“Kun can’t stay quiet,” Rodríguez said. “We’ll see. It’s difficult to talk about this because it turns into a giant rumor. Let’s wait and see what happens.”\nBefore the supermarket shooting, Messi’s Newell’s return wasn’t entirely implausible. After leading Argentina to a Copa América title in 2021, Messi was finally hailed as a hero after years of disappointment with the national team. Argentina’s dramatic triumph at the World Cup in Qatar further elevated Messi to legend status. He had finally connected with the people of Argentina. So why wouldn’t Messi want to finish his career in his country?\nThis latest act of violence, however, may have prevented that from happening.\n“This doesn’t only affect Leo’s return. It affects everyone,” said Newell’s manager Gabriel Heinze after the shooting. “There’s no doubt that this distances Leo (from Newell’s) and anyone else.”\nRay Hudson is no stranger to the area around Inter Miami’s DRV PNK stadium, which sits about a mile or so from his home in Fort Lauderdale. In the 1970s, Hudson patrolled the midfield at Lockhart Stadium, the venue that was bulldozed to make way for Inter Miami’s current home. He had a front-row seat to American soccer’s biggest-ever boom, the delirium surrounding the arrival of Pelé to the North American Soccer League in the mid-70s. He witnessed the flood of other luminaries that Pelé attracted stateside: Johan Cruyff, George Best, Gerd Müller and more.\nHudson is also closely tied to Messi in his current career as a broadcaster. In the U.S., so many of Messi’s goals were accompanied by Hudson’s trademark commentary, that rapid-fire banter laced with similes and metaphors. Say the word “magisterial” in the U.S. and even many non-soccer fans know exactly who and what you’re talking about.\nWhile it’s tempting to compare Messi’s potential arrival to that of Pelé’s, the Brazilian’s impact on club soccer in America was seismic mostly in the short term. His presence on the New York Cosmos for three years pushed the sport of soccer into the mainstream in the United States at a time when few gave it any thought, but a few years after his departure the entire NASL collapsed.\nAdvertisement\nTo Hudson, Messi’s potential arrival would be the biggest event in the history of the American game, and far more lasting.\n“This would be the biggest bang of football in this country, ever,” says Hudson. “The business element of what David Beckham did was enormous. That was a quantum leap for the league. We all recognize that. But this is a footballer’s footballer, you know? This isn’t just Gareth Bale, (Steven) Gerrard, Lampard. Even when genuine geniuses have come here, like Thierry Henry and Zlatan, it really hasn’t taken that massive leap. This will be the quantum leap in all shapes and forms for anybody that’s followed the game.”\nThis does not mean Hudson shares Inter Miami’s confidence that they’ll land Messi’s signature.\n“Within the last year he won the World Cup at 35 years old, and he’s going to come here?” Hudson asks. “It’s ‘Wizard of Oz’ stuff. It would be like the Mozart of our game. The Shakespeare of the arts arriving in Major League Soccer, and at his absolute peak as well. At his absolute peak … How could this possibly come about? What attraction is there for him? There are very, very good players playing within the league, but he’s playing with Mbappé now. He’s playing with f—ing Mbappé and Sergio Ramos.”\nHistorically, famous footballers have come to the United States in large part to escape the spotlight. Best cruised around Los Angeles and Florida in an open-topped Jeep and was barely recognized. Cruyff rode his bicycle from Georgetown in D.C. to RFK Stadium, a nice escape from his life in Barcelona. Even Henry took the train to Red Bull Arena for a game at least once.\nThat’s not an option for Messi, who at this point is one of the most recognizable humans on earth. During a recent Miami visit, every movement he made in the city was tracked by international media, and a massive crowd swarmed him at every opportunity. Hudson describes it as “Beatlemania all over again,” but in reality, Messi’s permanent arrival would be even bigger.\nFor now, Hudson will continue to try and find new ways to describe Messi’s brilliance remotely. He’ll be on the call in the U.S. for PSG’s Champions League appearance this week against Bayern Munich, as Messi seeks to engineer a little more magic.\nAdvertisement\n“I’m going to be looking at Messi on the ball and thinking ‘There’s no f—ing way that he would be (in MLS),’” he says.\nIt’s a beautiful Sunday afternoon in Miami Beach. The brunch crowd has descended upon the trendier eateries around town, but the Buenos Aires Bakery & Cafe has plenty of tables open. We’re in Little Buenos Aires, where an ever-growing community of Argentine expats have made Miami home for over 20 years.\nThe locals here are enjoying Argentine delicacies like empanadas, facturas (an Argentine pastry), and a wide array of sandwiches and pizzas while they watch PSG defeat Lille 4-3. Messi’s clever free kick in stoppage time proves to be the decisive moment of the match.\nOn the outdoor patio, five grizzled old Argentine men quietly sip their lattes. Alberto, Diego, Jorge and two gentlemen named Cristián are deep in conversation when we approach their table and ask them where Messi’s career will take him next.\n“He’ll stay at PSG,” Alberto says, repeatedly.\n“I’ll bet you $5,000 that he’ll play one season with Newell’s,” belts out one of the Cristiáns, a burly fellow with tanned skin and thinning hair.\n“The rumors are saying that he’s coming here,” says Jorge, who will later reveal his allegiance to Rosario Central, which skewed his opinions. “Leo is from Newell’s. So he’d be abandoning them if he doesn’t go there. I want you to put that in the story!”\nThe debate rages on. For Diego, a move to Inter Miami would jeopardize Messi’s preparation for the 2024 Copa América, because “he won’t take (MLS) seriously.” Argentina will defend its title when the tournament comes to the U.S. next summer.\n“They don’t have passion here,” Diego continues. “The players in the U.S. lose a final and they go home like nothing happened. You can’t grow if you don’t feel football in that way. In Argentina a player loses a game and they’re sad for a week. Here they lose a game and it doesn’t matter. They go out and party.”\nThe other Cristián, the group’s voice of reason, chimes in.\nAdvertisement\n“Messi has accomplished everything that he wanted to accomplish…How will he end his career? In peace and while he thinks about all of the incredible investment opportunities that he’ll have,” he says. “That’s where I think his decision is headed. I believe he’s thinking about where to end his career. And in the U.S. the investment outlook is impressive.”\nWhat about Qatar or Saudi Arabia?\n“Those are very good options in terms of financials,” Diego says. “I’d sign that deal today. Where do I sign?”\nWhile the U.S. market is one Messi hasn’t played in, his brand stateside has arguably never been stronger. Argentina will be the top draw when the Copa América comes to the U.S. next summer, and he’s the big reason why. Unlike Pele, Messi doesn’t have to wear an Inter Miami uniform in order to be known and adored by the American public.\nStill, it is not hard to imagine why Messi would be seduced by the idea of coming to the U.S. The same romanticism which could drive him to Newell’s may well bring him to Miami. The idea that he could come to a still-developing soccer nation and play his part in mainstreaming a sport that still sometimes feels like it operates on the fringes. Pelé tried to do it. Beckham tried to do it.\nMessi may just make his own attempt.\n(Top graphic by Eamonn Dalton. Photos: Catherine Steenkeste, Mark Brown, James Williamson / Getty Images)",
  "word_count": 3815,
  "scraped_at": "2026-02-14T12:51:53.178017"
}