{
  "article_id": "b95ef1816be6",
  "url": "https://www.justarsenal.com/how-did-arsenal-beat-chelsea-to-win-womens-conti-cup-after-recent-wsl-defeat-to-the-blues/363751",
  "title": "How did Arsenal beat Chelsea to win Women Conti Cup , after recent WSL defeat to the Blues ? ",
  "date": "20240404T174500Z",
  "domain": "justarsenal.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Arsenal Women defeated Chelsea women 1-0 on Sunday night, to win the Women’s Continental Cup 2024, for the 2nd consecutive year. Days later, this result is still blowing Gooners’ (and Emma Hayes!) minds, but how did they achieve it?\nArsenal Women were determined to win; they pressed hard and employed a man-marking strategy. Arsenal’s man-marking of Buchanan and Leupolz forced the Blues to build through Carter, making them struggle to employ their game plan.\nUsing the Stina Blackstenius and Frida Maanum duo, which “carried” the Arsenal team last season, was a sensible decision. Eidevall deployed the two (Frida and Stina) as split strikers, with the intention of creating space and stretching the Blues’ defense, allowing for scoring opportunities.\nOur Gunners were also fast to interchange the ball, switching from right to left, making them unpredictable, as opposed to previous games where they’d just use a single channel for attack.\nArsenal’s large, talented squad also came into play. Laia Codina, Steph Catley, Alessia Russo, Kyra Cooney-Cross, and Caitlin Foord are strong for a starting XI. However, Jonas Eidevall introduced the five as substitutes, showcasing his amazing squad depth. Their impact was evident: their introductions aimed to challenge Chelsea’s exhausted legs, and they succeeded.\nIf there was one game where Arsenal’s game plan worked, it was their 1-0 victory over Chelsea. The Blues must have looked at Arsenal and wondered if this was the same team they thrashed two weeks previously.\nSeeing the Chelsea boss, Emma Hayes, throw her toys out of the pram, appearing to shove the Arsenal boss, Jonas Eidevall, when he came in for a handshake post-match, was the absolute icing on the cake! Even through the Football Assocation have said she will face no action from them, she let herself down big time, and she knows it..\nAnything to add Gooners?\nMichelle M\nFollow JustArsenal’s Gooner Women on Just Gooner Women on Twitter for regular updates on the Arsenal Womens Team!\nDo you want to read more about the Arsenal Women’s Team? Click here….",
  "word_count": 336,
  "scraped_at": "2026-02-14T12:57:38.591543"
}