{
  "article_id": "b965f5f362a8",
  "url": "https://www.swindonadvertiser.co.uk/news/24017073.new-years-honours-famous-faces-honoured-king/",
  "title": "New Year Honours : Famous faces honoured by the King",
  "date": "20231229T230000Z",
  "domain": "swindonadvertiser.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Many famous faces and notable names have been awarded New Year's honours by His Majesty King Charles III.\nSeveral stars of the stage, sporting arena, and screen will begin 2024 with new titles added to their name, including England goalkeeper Mary Earps, Glastonbury founder Michael Eavis, and Game of Thrones actor Emilia Clarke.\nSinger Dame Shirley Bassey is being made a Companion of Honour for her services to music, becoming the 64th living member of the order, which can only have 65 members at any one time.\nFilm director and producer Sir Ridley Scott will have his knighthood upgraded to the title of Knight Grand Cross, while author Jilly Cooper will become a dame.\nSir Justin Welby, the Archbishop of Canterbury, is being made a Knight Grand Cross of the Royal Victorian Order for his personal service to the Crown during the coronation at Westminster Abbey in May.\nAwards of the RVO are in the King’s gift and are bestowed independently of Downing Street to people who have served the monarch or the royal family in a personal way.\nSir Justin conducted the service for the coronation and had the momentous task of anointing and crowning Charles and Camilla.\nEngland cricketer Stuart Broad is now a Commander of the Order of the British Empire (CBE) following his retirement, singer Leona Lewis is being made an Officer of the Order of the British Empire (OBE), and author Kate Moss received the title of CBE.\nElsewhere, Game of Thrones star Emilia Clarke has been made a Member of the Order of the British Empire (MBE) alongside her mother Jenny as co-founders of SameYou, a brain injury recovery charity they established after she survived two brain haemorrhages.\nIn politics, former chancellor and home secretary Sajid Javid has been knighted, Dame Margaret Beckett, Labour MP for Derby South, has had her damehood upgraded to a Dame Grand Cross, and Siobhain McDonagh, Labour MP for Mitcham and Morden, has been made a Dame Commander.\nGlastonbury Festival founder Sir Michael, listed under his full name Athelstan Joseph Michael Eavis, said he was looking forward to his investiture after being knighted for services to music and charity.\nIn sport, England captain Millie Bright has been made an OBE, while her fellow Lionesses Earps and Lauren Hemp have been made MBEs for services to football after they finished runners-up to Spain in the women’s World Cup.\nSir Bill Beaumont has been made Knight Grand Cross for services to rugby union football and to charity.",
  "word_count": 416,
  "scraped_at": "2026-02-14T12:30:43.559742"
}