{
  "article_id": "b9694e9a4916",
  "url": "https://www.heraldnet.com/opinion/editoial-small-ball-by-council-can-advance-everett-stadium/",
  "title": "Editoial :  Small ball  by council can advance Everett stadium",
  "date": "20241217T130000Z",
  "domain": "heraldnet.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "By The Herald Editorial Board\nIf there’s no crying in baseball, there’s even less certainty in baseball’s outcomes, at least until the final out.\nBut what seems certain now, following a nearly year-long process by a City of Everett fiscal advisory committee, is that the best chance to continue the 40-year legacy of the Everett AquaSox Minor League Baseball club here is to move forward with plans to build a new stadium downtown, funding construction — in stages if necessary — with a combination of private and public funds.\nThe Everett City Council is scheduled to meet Wednesday to accept the report and decide if and how to move forward.\nThe release of the committee’s analysis and its recommendations, as reported last week by The Herald’s Will Grescke, provide the city with a clear choice among a limited range of options, following an edict from Major League Baseball that facilities for Minor League teams meet certain requirements for players and officials:\nRenovate the team’s current home to MLB standards at Funko Field, owned, managed and shared with the Everett School District, with a price tag between $68 million to $79 million:\nBuild a new multipurpose stadium at a downtown location, potentially sharing it with men’s and women’s United Soccer League clubs, with a estimated cost of between $84 million and $114 million, with an additional $18 million for property acquisition;\nOr do nothing and likely wait for another community to meet MLB’s requirements and provide a new home to the Seattle Mariners-affiliated High-A club.\nThe last option isn’t one the committee nor the larger community should want to see rounding third.\n“Losing the AquaSox would pose a significant impact to the cultural fabric of Everett and result in significant tangible and intangible economic impacts,” the committee’s analysis finds, concluding “the AquaSox are a valuable community asset worthy of significant investment by the City of Everett that aligns with available City resources and does not adversely affect other City operations or result in significant additional tax burden for City of Everett residents.”\nThe report recommends against funding sources that would require tax increases or the use of the city’s general fund, options that city leaders had already sent to the showers.\nKey takeaways in the report also make it clear that renovating the current facility — quirky and charming as it is while also offering lower completion costs than a new facility — can’t deliver the same opportunities for multiple uses, revenue generation and overall economic impact. It’s limitations, in fact — such as a field too small to accommodate a soccer pitch — would inhibit its ability to generate revenue to support its completion.\nBringing on men’s and women’s United Soccer League teams could be key to completion of a new field and stadium. Preliminary conversations with USL, the report said, indicated a willingness to commit between $10 million to $15 million to construction, above the AquaSox’s commitment of $5 million to $10 million, recognizing the time and resources that AquaSox ownership has already invested in the overall effort.\nUSL, which runs several professional, pre-professional and youth leagues, already has a “footie” in the door in Snohomish County; Snohomish United will inaugurate a Men’s USL League Two team for college-level athletes and aspiring professionals next spring, joining more than 120 League Two franchises in the U.S. and Canada.\nThe report details a comprehensive list of funding sources for both the Funko Field and downtown options. Of those outlined for the downtown location — located between Pacific and Hewitt avenues, east of Broadway and near the Angel of the Winds Arena — funding for a city-owned facility would include a combination of public and private sources.\nThe city could draw from its Capital Improvement Program, which is restricted to capital projects; park impact fees; and existing bond capacity between $28 million and $48 million that would be paid back through future event revenues. Among other public sources are $7.4 million from the state, with the potential for additional funding if approved in the 2025-26 state budget and $5 million in capital funds from Snohomish County.\nIn addition to commitments from the AquaSox and USL, the report also anticipates private funding from additional private and corporate donors and a public capital campaign.\nAs well, the pitch for contributions should be made to Major League Baseball and the Seattle Mariners, particularly if the new stadium option goes forward. Each can be asked to contribute as both would benefit from providing players and fans with a worthy field and stadium. For starters, MLB could “refund” penalties in the six-figures it has levied against the AquaSox owners for not showing adequate progress, directing that money toward construction.\nAll told, the public and private funding would total about $95 million, likely short of what the completed project would cost. But, the report advocates a “design-to-budget” approach, which would allow for an initial phase of construction to satisfy Major League Baseball’s requirements — which don’t mandate fan amenities, such as seating — by the start of the 2027 minor league season, with further work completed as funding is available.\nTaxpayers have long soured on providing substantial sums for construction of stadiums and arenas for professional sports. But there is a growing list of examples that — while some public support is included — haven’t leaned heavily on the public’s tax bill.\nA recent commentary for The Conversation, published Saturday in The Herald, outlined how St. Louis, Mo., built a new Major League Soccer stadium through private investment and public bonding and tax incentives. The project was successful, said the authors — professors of economics and government — because it had the support of a locally owned team, was sited with an emphasis on economic development, invested in local workers and businesses and filled its schedule with events year-round.\nBuilding a new multipurpose stadium downtown would seem to meet those key points, building on the existing success of the Everett AquaSox and adding soccer teams and their fans.\nDuring its 2023 season the AquaSox’s 66 home games directly supported $10.7 million in business revenue, 90 jobs and $3.7 million in labor income, according to the city. Indirectly, those stats improved to $13.7 million in business revenue, 130 jobs and $6.4 million in labor income for city residents.\nSituated between the Angel of the Winds Arena and Everett Station’s transit connections, those economic contributions could multiply with the creation of a revitalized entertainment district, encouraging new restaurants, businesses and other attractions to those existing in the downtown core.\nThough it cannot offer guarantees of success, the committee’s report shows what is available, what is possible and has offered sensible recommendations for how to proceed. With the AquaSox’s future in Everett in the late innings, the Everett council, with a “small ball” single, can move the base runners ahead.\nTalk to us\n> Give us your news tips.\n> Send us a letter to the editor.\n> More Herald contact information.",
  "word_count": 1161,
  "scraped_at": "2026-02-14T12:18:18.656394"
}