{
  "article_id": "b982e050cbed",
  "url": "https://www.ocregister.com/2023/06/05/angel-city-fc-unable-to-rally-from-first-half-deficit-in-loss-to-chicago/",
  "title": "Angel City FC is unable to rally from first - half deficit in loss to Chicago",
  "date": "20230606T071500Z",
  "domain": "ocregister.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "LOS ANGELES — Approaching the halfway point of its second season, the Angel City Football Club remains a work in progress.\nAngel City went into Monday night’s game against the last-place Chicago Red Stars with only one win in its past 10 games, including three Challenge Cup games.\nDespite a late goal from Sydney Leroux in her 2023 season debut, Angel City (2-5-3, nine points) suffered another loss, falling 2-1 in front of 16,682 at BMO Stadium.\n“We have to step up our competitiveness,” Angel City coach Freya Coombe said. “We have to be able to deal with moments right now.”\nAngel City’s last win was a 3-2 decision against the Kansas City Current on May 7.\nAfter three consecutive road games (North Carolina, OL Reign and Portland), the return home didn’t seem to help in the early stages. Chicago (3-6-1, 10 points), which had scored just two goals in the month of May, took advantage of a pair of set pieces and equaled last month’s total as Ava Cook converted both for a 2-0 lead before the 30-minute mark.\nAngel City, which had a starting forward trio of Scarlett Camberos, Katie Johnson and Claire Emslie, managed only one shot on goal in the first half and that came from a Julie Ertz header that Chicago goalkeeper Alyssa Naeher was able to keep out of the goal.\nOne positive note for Angel City was the debut and return of Leroux. Acquired last year in a trade with Orlando, she underwent ankle surgery shortly after arriving and finally returned to action, coming on as a substitute in the 76th minute.\nIn the 88th minute, Leroux got on the end of an Alyssa Thompson cross and scored to make it 2-1. The goal was her first as a member of Angel City. She scored twice for the Orlando Pride before the trade last season. At the end of this game, video caught an emotional Leroux hugging her teammates.\n“We need to be better from the first whistle,” Coombe said. “The league is too close for us to shy away from some these moments.\n“With the quality of players we have, we have to start competing in the game. You can’t make the playoffs without that fight. We have to see that reaction from the players.”\nOne look at the post-game stat sheet and one might have expected an Angel City win. The club led in possession and expected goals, but the end result on the scoreboard was enough to drop Angel City into a tie for last place with Kansas City (3-7-0) in the 12-team NWSL.\nAngel City will play its next two games on the road, Saturday at the Washington Spirit and June 17 against San Diego Wave FC.\nIt had to be @sydneyleroux!\nShe brings one back for @weareangelcity! 👊 pic.twitter.com/Is0ghuTDv0\n— National Women’s Soccer League (@NWSL) June 6, 2023\nHad to bring out the on-pitch angle for Alyssa Thompson's first career assist. pic.twitter.com/dLD185Ca3q\n— National Women’s Soccer League (@NWSL) June 6, 2023\nI'm not crying, you're crying, WE ARE ALL CRYING.\nTHIS MOMENT @sydneyleroux 😭 💗 pic.twitter.com/am13lQXXW8\n— National Women’s Soccer League (@NWSL) June 6, 2023\nWELCOME BACK @sydneyleroux!! pic.twitter.com/8VuP8hBbuR\n— National Women’s Soccer League (@NWSL) June 6, 2023",
  "word_count": 540,
  "scraped_at": "2026-02-14T12:14:52.686139"
}