{
  "article_id": "b9a0b0d5e934",
  "url": "https://www.yahoo.com/lifestyle/couple-sues-lauren-witzke-saying-085544509.html",
  "title": "Couple sues Lauren Witzke for saying birth of their surrogate twins is  human trafficking  ",
  "date": "20230327T114500Z",
  "domain": "yahoo.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Couple sues Lauren Witzke for saying birth of their surrogate twins is 'human trafficking'\nEDITOR'S NOTE: This story has been updated to include comments from Lauren Witzke, who responded to a list of questions provided to her last week after this story was published online.\nA Texas couple is suing Delaware right-wing activist Lauren Witzke after she accused the two men of human trafficking and pedophilia in response to the men posting about the birth of their surrogate twins on social media.\nExperts say the lawsuit's filing can be seen as a cautionary reminder of limits people have when trolling online, even when it involves social media influencers such as Eric Vaughn — the owner of a Houston hair salon who happens to have nearly half a million TikTok followers.\n\"If you tell a vicious lie about someone, as Lauren Witzke has done in the case of Eric Vaughn, the person can sue you for defamation,\" said Juliet Dee, a University of Delaware associate professor of communication, who focuses on First Amendment law. \"If one avoids telling vicious lies about someone whom one has never even met, one will not be a defendant in a defamation suit.\"\nWitzke, who ran for U.S. Senate and lost to Chris Coons in 2020, said she will defend efforts to quash speech criticizing the LGBTQ community.\n\"It was Mr. Vaughn that publicized, aired, and broadcasted the statements he now complains caused him 'Injury' and I will vigorously defend any effort by the LGBTQ Mafia to chill the speech of anyone who criticizes them,\" she said in a written statement. \"Anyone with $125 can file a lawsuit but that doesn't make it meritorious, and I look forward to the immediate dismissal of this action, followed by a request for costs, sanctions, and attorney's fees against the plaintiffs and their council.\n\"Also, my attorney and I are currently considering our options to see whether we can have Mr. Buzbee deemed a vexatious litigant, where he will have to seek permission from the chief justice of a court before he will be allowed to file any more of these frivolous lawsuits, which are an unprecedented abuse of the judicial process.\"\nVaughn filed his defamation lawsuit last week in Texas' District Court of Harris County, where most of Houston is located. In addition to seeking no more than $75,000 in damages, Vaughn said he filed the legal action to make an example of Witzke and discourage her from spewing such comments about anyone in the future.\n'We're fighting for our family'\n\"We're fighting for our family,\" Vaughn told Delaware Online/The News Journal. \"We're fighting for every LGBTQ person out there who's ever been attacked like this online. We're fighting for anybody who has had to do adoption or surrogacy to start their family because her statements attacking us attack all of those people as well.\"\n\"These are incredibly damaging things that are said,\" the professional hairstylist said. \"It's a message that this is just not OK.\"\nWhat prompted the lawsuit?\nAccording to the lawsuit, Vaughn chronicled his and his husband's journey through the surrogacy process on social media — the same place their eventual surrogate reached out to them offering to help them start a family after the men tried for two years to adopt.\nVaughn's other social media posting on the processes included announcing in October that his surrogate was pregnant with twins and a February message that the twins had been born prematurely at 32 weeks.\nIn late February, Vaughn shared a video showing him and his husband holding their 32-week-old \"preemie twins\" as a family for the first time.\nSeventeen days later, the lawsuit claims, Witzke reposted Vaughn's video to her Twitter account saying, \"A new fetish with pedophiles consists of robbing babies from their mothers straight out of the womb. This is human trafficking and would be illegal in a sane society.\"\nThis public figure posted this for the world to see for one reason: attention.\nNow he wants more.\nImagine how the babies feel now that they have been ripped from the arms of a nurturing mother. pic.twitter.com/dZgTFzScql— Lauren Witzke (@LaurenWitzkeDE) March 19, 2023\n\"Rather than congratulating Plaintiff on one [of] the happiest moments in his life, or perhaps just ignoring Plaintiff’s happy post, Defendant instead decided to spew hate and lies on the internet in an unprovoked and harmful manner,\" Vaughn's lawsuit said. \"Defendant’s allegations of pedophilia and trafficking of human persons is so vile and obviously harmful that Plaintiff’s reputation may never recover.\"\nWitzke's posting is \"especially reckless,\" according to the lawsuit, because in Texas someone convicted of indecency with a child is not only a felon but may be subject to civil commitment in a mental institution.\nDoes the lawsuit have a chance?\nShortly after Witzke's posting, Vaughn hired Houston attorney Tony Buzbee, who has represented several women who reached a settlement with the Houston Texans football team last year after they accused NFL quarterback Deshaun Watson of sexual misconduct. Buzbee also represented former Texas Gov. Rick Perry when that state's highest criminal court dismissed a case involving abuse-of-power accusations.\nMore:Browns QB Deshaun Watson settles all but four of 24 lawsuits alleging sexual misconduct\nMore in U.S.\nMore:Appeals court dismisses Rick Perry’s criminal case\nBuzbee told Delaware Online/The News Journal it's a crime to falsely call someone a pedophile or human sexual trafficker and that such words are libel in Texas.\n\"This is the type of hate this woman spews,\" he said. \"There is nothing rational to say in response — her words demonstrate the type of person she is.\"\nWitzke told a Houston's FOX 26 TV anchor that her \"tweet is a representation of my beliefs and I truly believe what I say. I have a right as a Christian to my opinion.\"\nWitzke's justification for her post was also quoted by the TV station: \"So they posted it publically on their social media. When you post your depravity, you are going to get reprimand, welcome to the Internet.\"\nIs Eric Vaughn a public figure?\nWhile freedom of speech is protected by the U.S. Constitution, the nation's legal system comes down on speech that makes false accusations against a person or business. But compared with private citizens, public officials face greater challenges in bringing defamation claims by those making the false statements.\nBut Dee, the UD associate professor, doesn't think Vaughn is a public figure even though he put himself out on social media and some of his postings have received millions of views.\nDespite his posts on social media, Dee said, Vaughn still qualifies as a private figure because:\nHis name is not a household word.\nHe has not \"thrust himself into a public controversy,\" as the U.S. Supreme Court qualifies this.\nVaughn does not have access to the media to respond to Witzke's attack on him.\n\"If Eric Vaughn were to hold a press conference, the media would not show up because no one has ever heard of him,\" Dee said. \"So from a legal standpoint, he is a private person, and he would merely have to show that Lauren Witzke is negligent in her defamatory comments about him.\"\nBuzbee said Witzke had been asked to withdraw her comments, but that she declined.\n\"Most people would shut up and apologize,\" Buzbee said. \"She doubled down. We will let a Houston jury decide now.\"\nContact Esteban Parra at (302) 324-2299, eparra@delawareonline.com or Twitter @eparra3.\nThis article originally appeared on Delaware News Journal: Lauren Witzke sued for defamation by parents of surrogate twins",
  "word_count": 1254,
  "scraped_at": "2026-02-14T13:44:46.440006"
}