{
  "article_id": "b9dfd7b04a18",
  "url": "https://goprincetontigers.com/news/2023/12/29/tiger-blog-friday-tigerblog-the-year-in-review",
  "title": "Princeton University",
  "date": "20231229T080000Z",
  "domain": "goprincetontigers.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Princeton University Athletics\nFriday TigerBlog - The Year In Review\nDecember 29, 2023 | Tiger Blog\nWell, that's another year come and gone.\nIt's only a few days away from 2024, which will bring with it the Summer Olympics, a Presidential election, and another 12 months of Princeton Athletics. What will be the top story in those 12 months? Who can say?\nHere's a look back at what the top stories in TigerBlog's year-end reviews have been for the last 10 years:\n2013- the Ivy League football championship\n2014 - Julia Ratcliffe's NCAA hammer title\n2015 - the women's basketball team goes 31-1\n2016 - Ashleigh Johnson wins gold as an undergraduate\n2017 - the women's soccer team defeats UNC to reach the NCAA quarterfinals\n2018 - the men's hockey team wins the ECAC championship/the football team goes 10-0\n2019 - the field hockey team reaches the NCAA final\n2020 - the Covid pandemic\n2021 - the women's lightweight rowing national championship\n2022 - the death of Pete Carril\nYou know what's amazing about that list? Only one sport is listed more than once, and that was football. In other words, you never know what the No. 1 story is going to be or which team it's going to come from for that matter.\nAnd for 2023?\nHere TB's list for the top 10. This is just his opinion, and so anyone can feel free to disagree, though if you disagree with his No. 1, TB would like to know why.\nAlso, to be eligible, it has to be something that was done by a current Princeton athlete or team. To that end, these great accomplishments are ineligible:\n* Chris Young and Mike Hazen go head-to-head in the World Series as opposing general managers\n* Tyler Lussi continues to make her mark in professional women's soccer\n* Abby Meyers makes her WNBA debut\n* Tom Schreiber and Michael Sowers win a World Championship in lacrosse and Schreiber and Ryan Ambler win one in the PLL\n* Andrei Iosivas scores his first two NFL touchdowns\n* Olivia Fiechter Weaver wins gold in Pan Am squash\n* Beth Yeager wins silver in Pan Am field hockey\n* Quincy Monday wins a national wrestling title\n* Kevin O'Toole and Malik Pinto go head-to-head in MLS\n* six Princetonians win medals at the World Championships for rowing\nNo. 10 - Victoria Liu plays in an LPGA event\nThe Princeton senior-to-be played in the CPKC Women's Open in Vancouver in August. Liu was also the Ivy League Player of the Year this past spring after winning the Ivy tournament a year earlier.\nNo. 9 - Lots of league titles\nPrinceton teams won league championships in: men's cross country, men's water polo, men's basketball, women's basketball, men's indoor track and field, women's fencing, women's swimming and diving, softball, women's open rowing, women's lightweight rowing, men's lightweight rowing, women's water polo, men's golf and women's tennis in the calendar year of 2023. This only includes regular season championships, which means it doesn't count the next item ...\nNo. 8 - the men's lacrosse team wins the Ivy League tournament\nPrinceton went into the first weekend of May with only one path into the NCAA tournament: win the league tournament — and that's exactly what the Tigers did. It started with a taut 9-8 win over Penn on a Friday night at Columbia, when Princeton goalie Michael Gianforcaro made 15 saves against the Quakers, and Princeton needed every one of them. He made 17 more against Yale in the final two days later, though that one wasn't as close, as the Tigers rolled to a 19-10 win in a game that was 13-3 at the half.\nNos. 6 and 7 - the men's water polo team and the women's water polo team reach the NCAA Final Four\nWhich one is No. 5 and which one is No. 6? It doesn't really matter. Both the Princeton men and women advanced to the Final Four of the NCAA tournament, the women in the spring and the men in the fall. Together they were a combined 58-10, which is just extraordinary. On the women's side, Princeton took down California 11-9 in the NCAA quarterfinals, becoming the first non-West Coast school to reach the Final Four since Michigan did so in 2016. It was also Princeton's first Final Four trip in women's water polo. The men (who had their first ever first-team All-American in Roko Pokaric) beat UC-Irvine 12-7 in the quarterfinals before falling to No. 1 UCLA 17-13. Between the two Final Fours, the eight teams represented were Cal (men), Stanford (women), UCLA (twice), USC (twice) — and Princeton twice. Does one of those names sort of stick out? Again, that's a ridiculous accomplishment for the Tigers.\nNo. 5 - the women's and men's lightweight first varsity 8s win national championships\nOnce again, the Princeton women dominated, winning their third straight IRA National Championship, this time building a two-second lead after 500 meters of the final before winning by 6.2 seconds over Stanford. Princeton also won the overall team points championship. Unlike the women, the men were pushed the entire 2,000 meters in the first varsity 8 race. The Tigers actually trailed slightly (very slightly, at 0.2 seconds) after 500 meters, and even after they took the lead in the middle of the race, they never really shook the field. When it was over, Princeton men won by 1.8 seconds, giving the program its first IRA first varsity 8 lightweight men's title since 2010. The overall points championship was Princeton's sixth ever and also first since 2010. The men's heavyweights finished third, and the women's open finished third at the NCAA championships.\nNo. 4 - the women's basketball team reaches the second round of the NCAA tournament as Grace Stone makes the Play of the Year\nPrinceton won the Ivy League tournament title and then took down North Carolina State 64-63 in the first round of the NCAA tournament, giving Princeton an NCAA win for the second straight year. Here's how TB called it when it happened: The Tigers trailed in this one 63-55 with five to play. Along the way, the Tigers had a 1 for 24 shooting stretch (yes, that's not a typo) while NC State had a 17 for 22 stretch of its own. And yet Princeton was still in the game. Princeton got a three from Grace Stone and another three from Kaitlin Chen to make it a one-point game with less than a minute to go. It was still that way when Princeton got the ball back on a steal by Stone with just 11 seconds left. Out of the timeout, Stone then drained a three from the corner. Ballgame. It was an extraordinary shot, one that was put up with complete confidence, and which splashed through while barely moving the net. As he thinks back on it, that shot was beyond clutch.\nNo. 3 - Pat Glory wins the NCAA wrestling championship at 125 pounds\nGlory became Princeton's second NCAA individual wrestling champion and first since 1951, a span of 72 years, when he defeated Purdue's Matt Ramos 4-1 in the championship match at 125 to finish a perfect season. Glory also became Princeton's second wrestler ever to be an All-American four times. His championship win in 2023 followed a runner-up finish the year before.\nNo. 2 - Fred Samara retires/Sondre Guttormsen wins his third NCAA pole vault title\nIt was quite the swan song in the men's track and field world for legends Fred Samara and Sondre Guttormsen. Samara, the head coach of the men's program for 46 years, retired after winning 51 Heps titles, coaching 502 individual Heps champions, winning 10 Heps \"triple crowns\" and seeing 10 of his athletes win NCAA championships while six reached the Olympics. The last of those NCAA championships was the indoor pole vault won by Guttormsen, who won three NCAA titles in his career.\nNo. 1 - the men's basketball team reaches the Sweet 16\nIt's hard to imagine anything that could have topped this. Princeton had a magical \"March of the Tigers,\" taking the Ivy League tournament and then defeating second-seeded Arizona and seventh-seeded Missouri to reach the Sweet 16 of the NCAA tournament as a 15 seed. Along the way Princeton made a national name for itself, with a team of eminently likable players and a head coach, Mitch Henderson, who ran, in TB's words, \"gave a master class on how to represent an institution. He was humble. He gave full credit to his players, to his mentors, to the spirit and pride that define the University. He mentioned the great fan support. He talked about how much the team had changed since his playing days in the 1990s. His love of all things Princeton, and not just basketball, was obvious. There is no grade Henderson can get other than an A+ for how he handled success.\" It's a moment that will never be forgotten at Princeton. Actually, it's a series of moments: the all-around play of Tosan Evbuomwan, the white-hot second half that Blake Peters had against Missouri, the toughness of Caden Pierce on the boards, the smoothness of Ryan Langborg and Matt Allocco, the clutch moments from Keyshawn Kellman and Zach Martini. Yes, that run is the No. 1 story for 2023.\nAnd that's the list for 2023. Remember, that is TigerBlog's list, so you can blame only him if you disagree.\nAnd have a happy and safe New Year's Eve. As TB has written before:\nThe evolution of New Year's Eve goes like this: 1) try to stay up til midnight, 2) desperately try to find something fun to do at midnight, 3) pretend you don't care if you have something fun to do at midnight even though you do, 4) don't do anything other than stay up to watch the ball drop at midnight while sneering at those who are in steps 2 and 3, and finally 5) not care that it's New Year's Eve.\nHere's to a great 2024.",
  "word_count": 1679,
  "scraped_at": "2026-02-14T12:46:10.355826"
}