{
  "article_id": "b9e0e6729eca",
  "url": "https://www.fcbarcelona.com/en/club/news/4033204/joan-laporta-hansi-flick-will-bring-fresh-competitive-impetus",
  "title": "Joan Laporta :  Hansi Flick will bring fresh competitive impetus  ",
  "date": "20240604T194500Z",
  "domain": "fcbarcelona.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Joan Laporta: 'Hansi Flick will bring fresh competitive impetus'\n- label.aria.viber Viber\n- label.aria.whatsapp WhatsApp\n- label.aria.twitter Twitter\n- label.aria.facebook Facebook\n- label.aria.messenger Messenger\n- label.aria.link label.aria.tick Copy link\nWith the professional teams' seasons completed or close to a conclusion, FC Barcelona president Joan Laporta has evaluated the 2023/24 season during the second edition of the Barça One 'Presidental Podcast'. The conversation centred around Xavi leaving and Hansi Flick arriving, sporting plans for the 2024/25 season, and the direction each professional team will take in the coming year, as well as going through every institutional aspect of the Club.\nThe change of coach\nOne of the first points to be examined was Xavi leaving and Flick arriving as coach. Joan Laporta gave a step-by-step explanation of how the events unfolded, stating \"Xavi announced he was going to leave in February and we accepted his decision because of who he is. Halfway through the season, he changed opinion and asked to continue as coach. I asked him whether he believed in the team, he said yes, and the Board of Directors and I decided to commit to him. Prior to the game against Rayo, Xavi's rhetoric changed, and he spoke about significant changes to the squad. This change of opinion made me have a rethink and I have the feeling that the squad needs fresh impetus to be more competitive.\"\nIn this sense, Joan Laporta confessed that said impetus the squad needed involved changing coach, \"a new coach who believed in the squad and who had the required ambition was the best idea. That's when the option of Hansi Flick appeared on the table.”\nThe president explained that he wanted to announce the decision once LaLiga was over, but that the insistence of Xavi and his staff brought it all forward to the day before the Women's Champions League final.\nA new coach comes to Barcelona\nWith Hansi Flick announced as the new FC Barcelona coach for the next two seasons, Joan Laporta explained that the German's profile can prove the ideal fit for a team like Barça, stating \"Deco and Bojan interviewed him and the feedback was very positive. Flick is an experienced, professional coach, with a sense of responsibility, but above all, he believes in our playing style and the potential in the squad.”\nDespite the coach not being part of the Barça set up, the president recognised that Hansi Flick has been following the club and the squad for some time, stating \"Flick had been studying our playing style and how to incorporate it for some time. He is also very familiar with the current squad and players from La Masia. I gave him a charter so he could get to know his future Club better and I was very pleasantly surprised because he already knew many things.”\nFurthermore, the president was very clear about what he expects of the new coach, clarifying \"To win. Flick is clear on that he always has to look to a Masia. He knows he has some gems here like Lamine Yamal, Héctor Fort, Cubarsí, Balde, Gavi... and he is excited about working with the young players. He is very motivated about getting the best out of this team.\"\n\"Flick is an experienced, professional coach, with a sense of responsibility, but above all, he believes in our playing style and the potential in the squad\"\n? Joan Laporta\nIn Joan Laporta's opinion, the physical side is one aspect that most needs improving, and that the German is aware of just that, going on to state that \"The team needs more time and experience playing together, but also better physical preparation. We have had problems with injuries this season, as well as drop-offs in performance from the 60th minute onwards. Flick knows that the players need to be prepared better physically.”\nWe will now look into the other sporting issues Joan Laporta discussed during the interview.\nIns and outs\n\"We want to create a more competitive team by making small improvements, not wholesale changes. We want to strengthen the centre midfield position and find an out-and-out winger.\"\n\"We want both Joãos (Cancelo and Félix) to stay. We are working on it. Flick is counting on them and is convinced he can help them perform.\"\n\"Kounde has had an excellent season. We are very happy with him.\"\nLa Masía\n\"We have to always look to La Masia. We have players like Balde, Gavi, Fermín, Lamine Yamal, Cubarsí, Héctor Fort... We can have a strong team both now and in the future.\"\n\"The La Masia players have established themselves really well in the first team.\"\n\"We are very attentive about Marc Casadó. He will join the first team.\"\n\"Our homegrown players can compete in Europe and against any team.\"\nBasketball\n“Our pledge at the start of the season didn't turn out well. Significant decisions will be based on that. It will be a refresh rather than just a few touches. We have room to create a competitive team for the coming season.\" \"I want to thank the blaugrana fans for their unwavering commitment and constant encouragement.\"\n\"Proposals put forward by the professional team managers will be welcome. I will accept 90% of them.\"\nWomen's football\n\"The Women's side are one of the Club's pillars at present.\"\n\"This season saw a historic quadruple with the Champions League win in Bilbao as the major highlight.\"\n\"The team moves a lot of fans. Very wholesome and very appreciative fans who go beyond football, even driving social changes.\"\n\"Every contact extension was completed due to our players firmly believing in continuing at Barça. Most of the squad will remain. We have agreed extensions for Alexia for example, and we still have protagonists like Aitana, the world's best player.\"\nThe other professional teams\n\"Coaches are changing for a number of reasons. For example, we decided we needed a change in roller hockey, whereas for futsal, Velasco decided his time at Barça had come to an end.\"\n\"The roller hockey team has had and continues to have a great season, we hope they can end Edu Castro's time with a Liga win. However, despite the good results, we weren't able to win the Champions League. We have a proposal for change that we considered appropriate.\"\n\"Handball remains at a very high level. We hope to end in the best possible way by lifting the European Cup this weekend in Cologne.\"\n“When it comes to futsal, we have had very back luck with injuries this season, but they continue to fight for the Liga title all the same. Velasco's time in Barça will come to an end and we already have a replacement ready.\"\n- label.aria.viber Viber\n- label.aria.whatsapp WhatsApp\n- label.aria.twitter Twitter\n- label.aria.facebook Facebook\n- label.aria.messenger Messenger\n- label.aria.link label.aria.tick Copy link",
  "word_count": 1132,
  "scraped_at": "2026-02-14T12:47:56.583615"
}