{
  "article_id": "b9e4fc7478c0",
  "url": "https://www.newarab.com/news/arsenal-mena-fans-back-gaza-slam-club-israel-war-stance",
  "title": "Arsenal MENA fans back Gaza , slam club for Israel war stance",
  "date": "20231016T124500Z",
  "domain": "newarab.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Breadcrumb\nArsenal's MENA fans back Gaza, slam club for Israel war stance\nOfficial fan clubs in the Middle East and North Africa for English football team Arsenal have slammed the club for a statement about the Gaza-Israel war as the Palestinian enclave suffers intense bombardment and a suffocating siege.\nOn Friday, Arsenal expressed \"deep sorrow to all those impacted by the attacks in Israel... and the unfolding human tragedy of the past week, claiming innocent lives in both Israel and Gaza\".\nSupporters Clubs from eight MENA region countries said Sunday that they were \"disappointed\" in the Premier League team's statement.\n\"In the statement, Arsenal refused to acknowledge and stand against the publicly announced genocide happening right now against the people in Gaza,\" the Supporters Clubs from Lebanon, Algeria, Oman, Syria, Kuwait, Egypt, Sudan, and Morocco said in a statement.\n\"In addition, we would like to point out the difference in vocabulary that Arsenal used to describe what happened in Israel on Saturday as an 'attack' and what is happening in Gaza right now as an 'unfolding human tragedy', as if it was a natural disaster killing the trapped civilians in Gaza,\" read the statement.\nThe supporters clubs also stated their \"strong unwavering stance in supporting the Palestinian people and their right to resist against the apartheid regime they have lived under for 75 years\".\nIn a repost of a Premier League statement on the war made on Thursday on 'X', Arsenal said: \"We express our deep sorrow to all those impacted by the attacks in Israel on Saturday and the unfolding human tragedy of the past week, claiming innocent lives in both Israel and Gaza.\"\n\"We stand alongside all our supporters and our communities worldwide affected by this conflict.\"\nThe club said respect would be paid at forthcoming games to \"all those who have lost their lives\".\nA moment of silence was held at the women's Arsenal v Aston Villa game on Sunday, and another is to be held at the men's Arsenal v Chelsea match on Saturday.\nArsenal player Alex Zinchenko was criticised for sharing a post in support of Israel last week when fighting between Hamas and Israel broke out.\nMohamed Elneny, an Arsenal player from Egypt who has spoken in support of Palestine during Israel's previous bombardments of Gaza, last week changed his profile picture to the Palestinian flag in a show of solidarity.",
  "word_count": 397,
  "scraped_at": "2026-02-14T12:57:08.828236"
}