{
  "article_id": "ba42efcd20bb",
  "url": "https://www.sounderatheart.com/2024/06/ships-log-june-18-space/",
  "title": "Ship Log , June 18 : There is no soccer without movement",
  "date": "20240618T160000Z",
  "domain": "sounderatheart.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "One of the interesting things that happened in Saturday night's win was that the Sounders played vertically so often. They sent three throughballs, breaking defensive lines.\nThe most common way a team plays vertically is to send balls over the top for their fast attacking players to burst past their defenders. Seattle really only has two players fast enough for this to work – Jordan Morris and Léo Chú.\nBut this wasn't what was working Saturday night.\nInstead, they used their own lateral movement to open lanes and then the player targeted by pass took advantage of their opposition through smart movements.\nTake Paul Rothrock – no one confuses him for a fast youngster. He gets by on grit and an understanding of the space available. He's studious, a fan of books and chess (Defiance 2023 had a vibrant chess community).\nPaul's two sliding shots were the type of movement that deserved to be rewarded.\nRothrock also took the spaces available to him when early in his appearance Minnesota sat off of him, discounting him as a threat. He made himself available to receive passes. If the Loons were going to sacrifice that space, Paulie was going to take it.\nSeattle did that frequently in their win.\nMaybe it was the shock of losing their starting right back and the game plan in the opening minutes.\nBut we saw Cristian Roldan flow into a flex right back like Gregg Berhalter dreams of, but also with the ground coverage of Cristian Roldan. He accepted the open spaces as an invitation to move.\nObed Vargas also looked to move forward. Chú used lateral movement rather than speed to find his openings.\nIf there's a thing that Seattle can carry forward it is that understanding that every ceded space is an opportunity to attack. In soccer there's also space available.\nTo capture it you need not be faster or more technical. Sometimes you merely need to be more tactically aware of opportunities.\nFilm study will show that. Vision will do that. Off-ball movement will take advantage of it.\nTwo little steps when a defender is checking the off shoulder can open up a lane. Presence in unusual places and unconventional overloads can force open opportunity.\nDefending these movements gets mentally taxing. Guarding two channels, plus the space in front of you is difficult. Throw an extra player in there or the 5'6\" pestering guy who keeps hounding you after he turns the ball over and real problems start happening.\nYou break down.\nYou get subbed off at half. Your gameplan gets broken twice.\nYou lose.\nPurchasing the new jersey or planning to get MLS Season Pass? Use our affiliate links to support your bloggers.\nCatching up on Sounder at Heart\nHere's what you need to get ready for the week's play.\nSounders\nNext match: Wednesday June 19th at Houston Dynamo at 5:30 pm PDT on Apple TV (free)\n- Nifty for 50: Sounders dominate Minnesota United\n- Rothrock n’ Roll\n- The Review: Seattle Sounders vs Minnesota United\n- Postgame Pontifications: Just what the Sounders needed\n- Alex Roldan in concussion protocol, Albert Rusnák OK\n- Sounders vs. Minnesota United: Highlights, stats and quotes\n- Seattle Sounders FC vs. Minnesota United: community player ratings form\n- Brazilian interest in Léo Chú resurfaces\nReign\nNext match: Sunday June 23rd hosting Racing Louisville at 3 pm PDT on KONG and NWSL+. This is their Pride match.\n- Reign end losing streak with a disappointing scoreless draw\n- Sounders, Carlyle Group complete purchase of Seattle Reign\n- Maya Mendoza-Exstrom ready to take Reign into new era\n- Three stats: Seattle Reign vs. Portland Thorns\n- Valkyratings: Cast under the Current edition\nThe new ownership has control of two teams playing well below their usual standards.\nDefiance\nOff this week.\nVelocity\nNext match: Sunday June 23rd hosting Lexington Sporting Club at 6 pm PDT on SWX and ESPN+. This is their Pride match.\nUSL2 teams\nA huge win for Ballard in Oregon, plus a recent surge by West Seattle Junction may have created a three-team race, depending on how teams do with their games in hand.\nWednesday: Olympia and Tacoma have home games.\nLooking back at the news\nEverything else you need to know\nECS busted out a big display on Saturday night. It was a celebration of the club, including players in kits they wore from '74 to the present.\nSeattle Sounders at 50: The two priorities are to ‘double our fan base and double our business.’ The Sounders average attendance so far this year is just over 29,000. That's well below their peak era of 43.5k in 2012 to 2017 era. Reign are averaging 7,688. That's below last year's double-header inflated average (that the Reign chose to not report) of 13k, but is higher than every other season.\nMatt Doyle liked what he saw from the Seattle Sounders on Saturday. That's not something we've been able to say much in 2024.\nPartner site Backheeled reviewed every Western Conference team. Here's a selection on the Dynamo. It'll read rather familiar.\nComing into this weekend, Houston were second in MLS in possession but just 21st in non-penalty xG per 90 minutes, according to FBref. Their ball progression into the final third? Awesome. Their goal threat in the final third? Bleak.\nYou made it to the bottom of the newsletter. Get some wine.\nThis newsletter was made possible through the support of Full Pull Wines, a boutique wines reseller that has been sponsoring us since 2011. You can join their mailing list here.",
  "word_count": 925,
  "scraped_at": "2026-02-14T12:23:57.799167"
}