{
  "article_id": "ba673945a8aa",
  "url": "https://www.justarsenal.com/arsenal-womens-lotte-wubben-moy-is-cool-like-saliba-aggressive-like-gabriel-dont-you-think/364455",
  "title": "Arsenal Women Lotte Wubben - Moy is cool like Saliba & aggressive like Gabriel , dont you think ? ",
  "date": "20240413T134500Z",
  "domain": "justarsenal.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Two weeks after our Gunners won the Continental Cup final over Chelsea, with a Stina Blackstenius goal in extra time, Arsenal manager Jonas Eidevall couldn’t help but mention the game, in his pre-Bristol press conference. The Swede, speaking to the media on Friday, emphasised how impressed he was by Lotte Wubben-Moy’s brave performance in that match. He commented on how she fought for 120 minutes, implying that Arsenal runs in the defender’s blood. He appreciates the Lionesses defender’s rise through the ranks, from the Arsenal academy to being a first-choice centre back.\n“[She was] a rock in the defending line for 120 minutes—she’s Arsenal through and through,” said Eidevall (of Lotte’s performance in the Continental Cup). The Swedish tactician also touched on the strides the 25-year-old has made this season, saying, “I think she’s really developed this season in almost all aspects of her game. She’s improved her playing position. She’s improved her duels. She’s improved her leadership on the pitch.”\nInterestingly, even before she began receiving accolades, Jonas Eidevall reveals she was still giving her best in training, whether she is playing or not, and fortunately, she’s reaping the benefits this season. He believes that in order to excel in football, a player must be mentally tough, and Lotte embodies this.\n“She’s a really nice example of a player who is applying herself 100% every day. And that’s not this season only. That’s the seasons before that. In football, if the rewards would come directly linked to your contributions, I think it would be an easier world to succeed in. A lot of people would be doing the right things every day because you get constant positive feedback,” added Eidevall.\n“But that’s not the case. Football is not that linear in its development. So you need to keep on going, keep on going, keep on going, keep on going. And when you don’t think you will see progress or get a reward, you still need to keep on going, keep on going, and then it comes.\n“That’s why you need to be so mentally strong in this game, and Lotte is a prime example of that.”\nThis season, Lotte Wubben Moy has been a pillar for this Arsenal Women team. Without her, I’m not sure how Arsenal’s defence would have been. Some see Arteta’s defence and wax lyrical about how great Gabriel Magalhaes and William Saliba are, and I can’t help but say: Lotte is cool like Saliba and aggressive like Gabriel.\nWhat do you think Gooners?\nMichelle M\nFollow JustArsenal’s Gooner Women on Just Gooner Women on Twitter for regular updates on the Arsenal Womens Team!\nDo you want to read more about the Arsenal Women’s Team? Click here….",
  "word_count": 451,
  "scraped_at": "2026-02-14T12:57:37.273015"
}