{
  "article_id": "ba9682b5c1fb",
  "url": "https://home.nzcity.co.nz/news/article.aspx?id=433812&fm=psp,tst",
  "title": "Premier League star Claude Makelele is serving as a judge on Miss Universe - 14 - Nov - 2025",
  "date": "20251113T174500Z",
  "domain": "home.nzcity.co.nz",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "News | Entertainment\n14 Feb 2026 20:29\nNZCity News\n14 November 2025\nClaude told the Daily Star newspaper: \"I think in life you need to have many experiences, and my people who work with me presented me with this kind of opportunity.\n\"So why not? We all come from ladies, we were born from ladies. We also have a family, we have a wife, and we have a girlfriend.\n\"Yes, the women in general are beautiful women. We love to see beautiful women, it's normal.\n\"It will be my first experience, so I thought, why not?\"\nMeanwhile, Claude hopes to get back into management, following his role as head coach at Asteras Tripolis in 2024, which he quit due to issues with club management.\nThe football ace - who has also had coaching jobs with the likes of Paris Saint-Germain F.C., Swansea City A.F.C., and Chelsea F.C. - recently told The Sun: \"I'll take my time. I love to help young boys dream, because sometimes players dream and don't believe in themselves.\n\"I have a talent for seeing something in young players, many managers don't have time to give young boys. They need understanding and listening to.\n\"I'm thinking about it. One day, I will come back and manage a team again.\"\nClaude terminated his one-year deal with Greek team Asteras Tripolis in mid-September 2024 because of being told what to do by the club's chiefs.\nIn 2024, he told LondonWorld: \"I love the job, but I can't accept when people interfere and tell me what I can or cannot do.\n\"They promised me full control of the team. It was (supposed to be) my decision who played or didn't play.\"\nEnough was enough for the ex-Real Madrid star when club chiefs got involved with his selection for his last match in charge - a 3-1 win over Athens Kallithea.\nClaude said: \"In the last game, they insisted a key player [Darnell Eric Bile] should be benched.\n\"The player has a small amateur salary, but he's the best player in the team. I brought him on for just 20 minutes - he got two assists, and we won the game.\n\"But they didn't want him (to play). They thought they could control whether he plays because he hadn't signed a (new) contract. I used him because of his quality.\"\n© 2026 Bang Showbiz, NZCity\n\"So why not? We all come from ladies, we were born from ladies. We also have a family, we have a wife, and we have a girlfriend.\n\"Yes, the women in general are beautiful women. We love to see beautiful women, it's normal.\n\"It will be my first experience, so I thought, why not?\"\nMeanwhile, Claude hopes to get back into management, following his role as head coach at Asteras Tripolis in 2024, which he quit due to issues with club management.\nThe football ace - who has also had coaching jobs with the likes of Paris Saint-Germain F.C., Swansea City A.F.C., and Chelsea F.C. - recently told The Sun: \"I'll take my time. I love to help young boys dream, because sometimes players dream and don't believe in themselves.\n\"I have a talent for seeing something in young players, many managers don't have time to give young boys. They need understanding and listening to.\n\"I'm thinking about it. One day, I will come back and manage a team again.\"\nClaude terminated his one-year deal with Greek team Asteras Tripolis in mid-September 2024 because of being told what to do by the club's chiefs.\nIn 2024, he told LondonWorld: \"I love the job, but I can't accept when people interfere and tell me what I can or cannot do.\n\"They promised me full control of the team. It was (supposed to be) my decision who played or didn't play.\"\nEnough was enough for the ex-Real Madrid star when club chiefs got involved with his selection for his last match in charge - a 3-1 win over Athens Kallithea.\nClaude said: \"In the last game, they insisted a key player [Darnell Eric Bile] should be benched.\n\"The player has a small amateur salary, but he's the best player in the team. I brought him on for just 20 minutes - he got two assists, and we won the game.\n\"But they didn't want him (to play). They thought they could control whether he plays because he hadn't signed a (new) contract. I used him because of his quality.\"\nBlues fullback Zarn Sullivan has fresh motivation heading into the Super Rugby Pacific season More...\nOpenAI has deleted the word ‘safely’ from its mission – and its new structure is a test for whether AI serves society or shareholders More...\nAuthorities believe Savannah Guthrie's missing mother Nancy is still alive 20:21\nEntertainment:\nBijou Phillips has launched an urgent appeal to find a kidney donor 19:51\nEntertainment:\nStacy Keibler says it was a \"gift from God\" to be with James Van Der Beek in his \"final days\" 19:21\nHealth & Safety:\nTwo sailors have been hospitalised after a nasty crash between the Black Foils and France, forcing the cancellation of racing for the day at the Auckland Sail GP event 18:57\nEntertainment:\nJames Van Der Beek's widow has launched a GoFundMe 18:51\nRugby:\nBlues fullback Zarn Sullivan has fresh motivation heading into the Super Rugby Pacific season 18:37\nEntertainment:\nNick Jonas admires Priyanka Chopra's \"willingness to get her hands dirty\" 18:21\nPolitics:\nThe US government has just entered another shutdown. Here's what it means this time 18:17\nCricket:\nAn international sporting rivalry is set for another chapter 18:07\nEntertainment:\nJennifer Garner channelled her dance background in The Last Thing He Told Me 17:51\nPower Search",
  "word_count": 945,
  "scraped_at": "2026-02-14T12:59:08.976470"
}