{
  "article_id": "bab5c4e7cacd",
  "url": "https://www.prokerala.com/news/articles/a1430105.html",
  "title": "Sr women football nationals : Odisha too good for Punjab ; Tamil Nadu continue to roll",
  "date": "20230619T194500Z",
  "domain": "prokerala.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Amritsar, June 19 : Odisha, runners-up of the 2018-19 edition, former champions Tamil Nadu and their neighbours Karnataka won their respective preliminary league matches in the Senior Women's National Football Championship here on Monday.\nOdisha, who lost to Tamil Nadu in their last match, overcame Punjab's challenge, winning 5-0 in a Group A clash at the Guru Nanak Stadium on Monday.\nWhile Satyabati Khadia and Subhadra Sahoo struck twice each, skipper Jasoda Munda was the other scorer in the match that saw Punjab crash to a big defeat.\nThis win helped Odisha climb up to the second position in the group with six points from three matches. Punjab have two points from three matches after this loss and will now face Jharkhand.\nOdisha had to wait 12 minutes to break Punjab's resistance as captain, Jasoda Munda converted from the spot. Forward Satyabati Khadia doubled the lead in the 36th minute.\nSubhadra Sahoo made it 3-0 in the 47th minute, moments after coming on as a second-half substitute. Satyabati Khadia scored her second goal of the match in the 68th minute. Subhadra Sahoo put the final nail in Punjab's coffin in the 75th minute.\nOdisha's Satyabati Khadia was adjudged the Player of the Match.\nA smooth win for Tamil Nadu Former champions Tamil Nadu defeated Jharkhand 3-0 at the GNDU Main Ground to maintain their perfect run.\nA first-half brace by Priyadharshini S. and a goal from Malavika M. made Tamil Nadu's job look comfortable.\nTamil Nadu have nine points from three matches. Jharkhand are yet to register a point in the competition.\nTamil Nadu opened in the 14th minute when Priyadharshini S. cut inside to score, giving Jharkhand custodian Anjali Munda no chance.\nMalavika M. doubled the lead in the 19th minute with an inch-perfect left-footed volley. Priyadharshini S. scored her second goal in the 32nd minute with a header. She was adjudged the Player of the Match.\nKarnataka earn full points Karnataka registered their first win when they beat Chandigarh 2-1 in a Group A clash.\nAfter a barren first half, Karnataka's midfielder, Sunalinda Iawren broke the deadlock in the 58th minute to help her team take the lead. Aarushi Santhosh extended Karnataka's lead when she made it 2-0 in the 78th minute. Chandigarh pulled one back in the 88th minute.\nSunalinda Iawren was adjudged the Player of the Match.\nChandigarh now will come up against Tamil Nadu and Karnataka against Odisha on June 21 in their next matches.",
  "word_count": 410,
  "scraped_at": "2026-02-14T12:45:38.785780"
}