{
  "article_id": "bab53c8ec98e",
  "url": "https://www.mirror.co.uk/news/royals/king-charles-makes-historic-speech-29587316",
  "title": "King Charles makes historic speech in German - and leaves everyone giggling",
  "date": "20230330T121500Z",
  "domain": "mirror.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "King Charles makes historic speech in German - and leaves everyone giggling\nKing Charles has become the first British monarch to address German politicians from the Bundestag while on a three-day state visit to Germany - and he received a standing ovation after speaking for over 15 minutes in both English and German\nKing Charles received a two-minute standing ovation after making a historic speech in Germany where he spoke movingly about his late mother the Queen - and even teased an old footballing rivalry.\nHe became the first British monarch to address the German Parliament the Bundestag today while impressively switching between German and English to tell several jokes drawing huge laughs from the packed chamber.\nThe wide-ranging 15-minute speech included references to the Beatles, Berlin's vibrant nightlife and a shared love of comedy - prompting much laughter.\nAfter being introduced by the Bundestag president, Charles told how the building hosting him signified \"a demonstration of what binds our two countries\".\nPartially burned down in 1933, before being heavily damaged in WWII British architect Norman Foster redesigned the Reichstag impressive domed glass cupola, intended to be a symbol for transparency and accountability.\nCharles said: \"There could be few better places to do so than in this building which, in its very stones, tells the history of the twentieth century.\"\nAs Charles constantly switched between fluent German and English, one German journalist remarked how the King \"spoke with great honour\", adding how he was impressed with the monarch's language skills.\nAfter paying tribute to the late Queen, Charles spoke in German to once against thank the German people for their reaction to her passing and the friendship shown during her 15 official visits to Germany.\nHe said: \"My family and I were so deeply touched by the reaction in Germany to my mother's death.\n\"The tributes offered in this chamber, the Union Flag projected onto the Brandenburg Gate, and the thousands of messages in condolence books across the country, offered a tremendous comfort in our time of grief.\n\"On behalf of my entire family, I can only offer our heartfelt thanks for the extraordinary kindness that the people of Germany showed to us.\"\nHe also touched on the war in Ukraine saying it has \"inflicted the most unimaginable suffering on so many innocent people\".\nThe King added: \"Germany and the United Kingdom have shown vital leadership. As Europe’s two largest donors to Ukraine, we have responded with taking decisions which might previously have seemed unimaginable. Germany’s decision to send such significant military support to Ukraine is remarkably courageous, important and appreciated.\"\nThe chamber of lawmakers and other dignitaries roared with laughter when Charles, comparing our mutual admiration of The Beatles and Kraftwerk as well as German comic Henning Wehn and Monty Python, said millions of Brits were known \"to admire Berlin’s vibrant culture and nightlife\".\nHe added: \"In Britain, Germany’s comedy ambassador, Henning Wehn, has given us an understanding of German quirks, as Monty Python brought our own here.\n\"Like all old friends at moments, the warmth of our relationship allows a small smile at each other's expense.\"\nAnd touching on the footballing rivalry he said: \"In some areas there are rivalries, of course, and I think especially of our encounters on the football pitch.\n\"Against this backdrop, it was particularly special last year that the England women’s football team - the Lionesses - could win the Euros against Germany last year. Beyond their sporting success, both teams have promoted gender equality in such an impressive way.\n\"In so doing, they inspired a generation - in Britain, Germany and far beyond. This is just one example of how our countries, together, can offer a compelling example to the world.\"\nCharles received further applause as he heralded the Kindertransporte, which 85 years ago saved the lives of more than 10,000 Jewish children from Nazism.\nIn the final leg of the royal visit, Charles and Camilla will tomorrow travel to Hamburg which was heavily bombed by the British leading to mass casualties in 1943.\nCharles added: \"Tomorrow, we will once again stand with the people of Germany in solemn remembrance.\n\"In Hamburg, I will pay my respects at the memorial to the Kindertransporte, which, 85 years ago, saved the lives of more than 10,000 Jewish children from Nazism, and gave them safe passage to new lives in Britain.\n\"I will also join you, Mr President, and First Mayor Tschentscher, in remembering those who perished in the Allied bombing of Hamburg in 1943.\"\nFinishing his speech before a standing ovation, Charles closed in German to say: \"In the long and remarkable story of our two countries, there are many chapters yet unwritten.\n\"Let us fill these with the restless pursuit of a better tomorrow. The legacy of our past, and the great promise of our future, demand nothing less\"\nThe speech at the Bundestag came after a meeting with German Chancellor Olaf Scholz this morning before he and Camilla toured the Wittenbergplatz Food Market, where they were greeted by huge crowds.\nCharles swapped some Buckingham Palace honey for a basket of German honey, where he said: \"I'll swap you one of mine, it's probably not as good.\" Him and Camilla also tried some cheese and were given apple juice and a tankard to take away.\nOne of the first stalls they stopped at was wild garlic stall, Der Barlauchbauer, which sells freeze dried garlic. Owner Axel Kaiser had decorated the stand with images of the King.\nCharles asked Mr Kaiser if he picked the garlic himself, and was told he did, but declined an offer to sample some, saying he was full.\nAmong the many members of the public who jostled to shake hands with the couple was a woman who said she had met Charles 40 years ago when he gave a speech in Wales which she told him was \"wonderful\". Another woman told him she would love him to visit Switzerland.\n\"Are you hear to do some shopping?\" the King asked another woman.\nAt a vegetable stall, he asked: \"Will you sell most of this in a day?\" He also asked about the varieties of apples and pears before taking a slice of apple on a stick to try later. He passed it to his equerry to add it to the basket of honey saying: \"Can I taste that please? I might try that later.\"\nAt the meat stall, the King asked: \"Have you pigs, cattle and sheep?\" He shook hands with the vendor who pointed out some lamb. \"Will you sell all this today?\" he asked. \"We hope so,\" came the reply.\n\"I wish we had more time to try some,\" Charles added before he was handed a tankard to take home. \"Is that for us to take? Thank you,\" he said.\nThe Queen Consort tried some cheese, noting: \"That’s very good,\" before they were given several packages to add to their basket.\nAs they continued to battle through the throng, Camilla said to Charles: \"We've stopped this poor man doing his shopping.\"\nMeanwhile last night, the King pledged to \"strengthen the connections\" between the UK and Germany as he paid tribute to the \"enduring value\" of the two nations' relationship.\nIn the first state banquet speech of his reign, Charles stressed that he was \"utterly convinced\" the bond between Britain and one of the EU’s leading nations “will grow ever stronger”.\nSpeaking in German, he drew laughs from guests at the white-tie event when he referenced a British comedy sketch hugely popular in Germany called \"dinner for one\", about an elderly aristocrat who dines alone while her waiter gets progressively more drunk as he consumes alcohol poured for her missing dinner guests.\nCamilla stunned at the event, by wearing Bruce Oldfield black and silver gown, the dazzling Boucheron diamond Tiara and the late Queen's fringed diamond necklace.\nEarlier in the historic day, the King and Queen Consort receive an official welcome in front of Berlin's Brandenburg Gate, a symbol of peace and unity and the first time the location has been used to greet a foreign head of state.\nGermany’s president Frank-Walter Steinmeier and his wife Elke Budenbender warmly welcomed Charles and Camilla as their first state visit began, heralding a deepening of the post-Brexit relationship between the two countries.\nAt an event promoting UK and German climate and sustainability efforts, he praised the King’s green \"convictions\" and thanked him for making the \"personal gesture\" of choosing his country as the destination for the monarch’s inaugural state visit.\nREAD MORE: King Charles' German hosts 'repeatedly check' pen for state visit after infamous blundersREAD MORE: Prince Harry reconciling with Charles ahead of Coronation 'almost impossible' - expertREAD MORE: Prince William 'has no reason' to see Harry or have family time 'spoiled', says expertREAD MORE: Queen Camilla cherishes 'waggy-tailed memories' in emotional tribute to Paul O'GradyREAD MORE: Harry and Meghan son Archie's profile reappears on royal website with glaring error",
  "word_count": 1489,
  "scraped_at": "2026-02-14T13:02:55.053212"
}