{
  "article_id": "bab9d6b36deb",
  "url": "https://www.smdp.com/rams-donate-5-million-to-la28-free-ticket-program-as-paralympic-games-reach-1000-day-milestone/",
  "title": "Rams Donate $5 Million to LA28 Free Ticket Program as Paralympic Games Reach 1 , 000 - Day Milestone",
  "date": "20251217T220000Z",
  "domain": "smdp.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "The Los Angeles Rams kicked off a new fundraising initiative Nov. 20 with a $5 million donation to provide free tickets to the 2028 Olympic and Paralympic Games for local residents, as organizers marked 1,000 days until the Paralympic Opening Ceremony.\nThe LA28 Organizing Committee launched the ticket donation program to ensure community organizations can distribute passes to residents who might not otherwise attend the Games. The Rams' contribution was celebrated Sunday, Nov. 23, during the team's Night Football game against the Tampa Bay Buccaneers on NBC and Peacock.\n\"The 2028 Olympic and Paralympic Games are for everyone,\" said Casey Wasserman, LA28 chairperson and president. \"This program is about making sure that the people who live, work and contribute to the spirit of Los Angeles can access the Games taking place in their hometown.\"\nThe initiative invites local sports teams, philanthropists and partners to fund ticket donations that will be distributed directly to community organizations. LA28 officials said they are seeking broader participation from individuals, organizations and civic leaders to expand access to the Games.\nRams Owner/Chairman E. Stanley Kroenke built SoFi Stadium, which will be renamed 2028 Stadium for the Games, as the centerpiece of his 300-acre Hollywood Park development. The venue will host both Opening Ceremonies and will be converted into the largest Olympic swimming venue in history.\n\"When Stan Kroenke built SoFi Stadium and Hollywood Park, it was with the goal of bringing the biggest global events in sports and entertainment to Los Angeles,\" said Rams President Kevin Demoff. \"We are honored to team up with them to kick off this program which will give thousands of Angelenos who otherwise might not get to attend the Games an opportunity to experience it first-hand.\"\nIn addition to the free ticket program, LA28 announced that single tickets starting at $28 will go on sale in 2026, with early access available to the Los Angeles community through a local pre-sale. More details on the pre-sale will be released next year.\nOn Tuesday, LA28 marked the 1,000-day countdown to the Paralympic Games by releasing an initial preview of the competition schedule, featuring 23 sports and 560 medal events across 294 sessions.\n\"We're excited to mark 1,000 days from the LA28 Paralympic Games as we set the stage for athletes, fans and the global community to unite in a celebration of sport, resilience and human potential,\" said Reynold Hoover, LA28 chief executive officer.\nThe 2028 Games will mark several historic milestones. Los Angeles will host its first Paralympic Games and will become only the third city to host three Olympic Games, following 1932 and 1984. The 2028 Olympics will be the first in history to feature more women athletes than men.\nThe Paralympic schedule includes several notable features. Para Climbing will make its Paralympic debut, following LA28's successful proposal in 2024 to add the sport to the program. The Games will also mark the first time Paralympic competition begins before the Opening Ceremony, with Wheelchair Rugby starting two days prior and Boccia beginning one day before the Aug. 15 ceremony at 2028 Stadium.\nLos Angeles Mayor Karen Bass emphasized the significance of hosting the city's first Paralympic Games.\n\"In just 1,000 days, we will make history by hosting the first-ever Paralympic Games in Los Angeles, one that will feature the most women athletes ever competing on this world stage,\" Bass said. \"I can't wait to celebrate the elite athleticism and determination of some of the world's greatest athletes and to see Los Angeles shine.\"\nThe Paralympic Closing Ceremony will take place Aug. 27, 2028, at LA Memorial Coliseum. The final weekend will feature finals in 17 sports, with seven sports holding championship events on the final day.\nThe 2028 Games will be the first since 1948 to not build any new permanent infrastructure. Hollywood Park Studios, currently under construction, will serve as the International Broadcast Center.\nLA28 operates as an independently funded, nonprofit organization supported by commercial partnerships, licensing, hospitality and ticketing revenue, along with backing from the International Olympic Committee. The competition schedule will continue to evolve, with a more detailed breakdown by event expected in 2026.\nVisa is the official payment partner for the Games. More information is available at LA28.org.\nEdited by SMDP Staff",
  "word_count": 705,
  "scraped_at": "2026-02-14T13:43:19.579922"
}