{
  "article_id": "bae18019d2c9",
  "url": "https://www.twtd.co.uk/ipswich-town-news/36334/lambert-we-need-a-few-out-of-the-treatment-room/onthisday",
  "title": "Lambert : We Need a Few Out of the Treatment Room - Ipswich Town News",
  "date": "20230725T081500Z",
  "domain": "twtd.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Thursday, 25th Jul 2019 17:41\nBlues boss Paul Lambert admitted he needs a few players to return from the treatment room with Tristan Nydam having been added to an already lengthy injury list after suffering a broken ankle and damaged ligaments at Notts County on Tuesday evening.\nThe 19-year-old, who has been playing at left-back during pre-season, is set to undergo surgery and is expected to be out for around six months.\n“Horrific, I was standing right next to it when it happened,” Lambert recalled. “It wasn’t nice viewing as I said after the game but hopefully we’ll have him back before the end of the season.\n“He was doing well for us as well, that was the galling thing. It was just an accident, there was no malice in the tackle, it was just a tackle, it was never over the top or anything untoward, it just happens and unfortunately it’s given him a bad one.”\nThe Blues had already lost Teddy Bishop (knee, three months) and Toto Nsiala (hamstring, six weeks) during pre-season, while Gwion Edwards (groin), Jon Nolan (calf), Freddie Sears, Ben Morris (both ACL) and Ben Folami (achilles) are still injured from last season. Alan Judge is training but has yet to feature in a friendly having broken his wrist while away with Ireland last month.\n“I can put up with contact injuries, Bish’s one is a contact injury, football injury, football movement, it’s not a muscle injury,” Lambert added.\n“Toto’s is the one that’s frustrating because it’s a muscle injury. Tristan and Bish, they’re the ones you can’t do anything about, they happen.\n“I just saw the Liverpool lad [Nathaniel Clyne] who has just done his ACL in pre-season. These sorts of thing happen, you just have to take it.”\nBetter news is that Edwards and Nolan are closing on on their returns: “This weekend is maybe too early, we’ll see how they are next week. They’re doing well, they’ve hardly done anything but they’re just coming back. We need to get a few out of the treatment room, that’s for sure.”\nLambert says the duo will have to get to fitness through playing matches rather than undergoing their own mini-pre-season: “Just on games. They’re training, they’re doing work with the physios and the rehab guys, it’s just getting them back out with us. We’ll have to get them back out with us.\n“We’ll have wait and see how they are, they’re two naturally fit guys anyway, which is a bonus, so we’ll see how they go.”\nHe says he's not yet sure whether Judge - assuming he hasn't been sold to QPR by that point - will be ready for the opening day game at Burton Albion.\n“I don’t know, I really don’t,\" the Blues manager added. \"Obviously he’s training with us, he’s not done anything games-wise. I’ll see how this coming weekend is and then I’ll decide from there.”\nPhoto: TWTD\nPlease report offensive, libellous or inappropriate posts by using the links provided.\n- Page:\n- 1\nCOYB\nStudied history at University and found it about as useful as Ipswich in injury time! ;-)\nhttps://www.telegraph.co.uk/cu\nGone soft nowadays. Bring back heavy boots & medicine balls for footballs and dock a weeks wages for every match they miss & they'll soon be back on their feet.\n- Page:\n- 1\nYou need to login in order to post your comments",
  "word_count": 566,
  "scraped_at": "2026-02-14T13:26:51.544522"
}