{
  "article_id": "bafc737da955",
  "url": "https://www.namibian.com.na/symbolic-geingob-cup-winds-down/",
  "title": "Symbolic Geingob Cup winds down",
  "date": "20240905T164500Z",
  "domain": "namibian.com.na",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "The Dr Hage Geingob Cup has carved its place in Namibian history as a unifying platform for nation building, the organisers say.\nThe 10th and final edition of the annual event takes place on 19 October and will honour the memory of late president Hage Geingob and his commitment to harnessing the power of sport to bring a nation together.\nIt is a noble initiative which impacted the lives of many people, especially the youth, said the Namibia Football Association (NFA) during yesterday’s launch.\nFootball has been the greatest benefactor of the Geingob Cup, with eight of the editions dedicated to the people’s game.\nInitially a competition between domestic teams, it expanded to include South African and Angolan sides before becoming an annual friendly match date for the Brave Warriors against select visitors.\nLast year, the Geingob Cup was contested by topflight champions African Stars and Eeshoke Chula Chula by popular demand.\n“We are grateful that it started with football and is ending with football. Geingob’s admirable love for the game of football was the driving force of the event,” NFA vice president Markus Murs said.\nHolders Chula Chula and Stars will again be the main attraction, with Women Super League champions Ongos Ladies taking Gals & Goals, while a celebrity exhibition match is also on the cards.\nGeingob had a symbiotic bond with football which is why he was the NFA patron until his death in February, Murs said.\n“We applaud him immensely and are very grateful for that,” the senior NFA official noted.\n“This platform provides our footballers with much needed exposure. We appreciate the precious time that the NFA and football people enjoyed and learned from the wisdom of the late Hage Geingob which he invested in the game we all love so much.”\nNamibia Breweries Limited (NBL), who along with MTC Namibia has backed the Geingob Cup since inception, says the final event would be a spectacular homage to Geingob’s legacy.\nBank Windhoek is the third corporate partner involved in the event.\n“We will be celebrating ten years of sporting success while we also remember the late president Hage Geingob whose vision helped create this tournament,” says NBL finance director Waldemar von Lieres.\n“Although he’s no longer with us, his legacy live ons through events like this, which reflects on his dedication to unity, national development, and the power of sport.\n“Namibia Breweries, predominantly through its Tafel Lager brand, has been proud to be part of this journey since it began in 2014. Over the years it has grown from just a sport event to a symbol of national pride and unity,” Von Lieres continues.\n“This year’s cup is extra special, as it not only celebrates ten years of excellence but also honours Geingob’s memory.\n“As we start the tournament, we do so with deep gratitude for a leader who understood how sport can bring people together and help build the nation,” he says.\nMTC spokesperson Tim Ekandjo says the event has achieved its objective.\n“The Dr Hage Geingob Cup was never just about football. It was about showing love and humanity and about bringing people together,” Ekandjo says.\nEchoing the unity and social cohesion narrative, deputy minister of sport, youth, and nationals service Emma Kantema-Gaomas adds: “What a great investment. It is sad that it is coming to an end, but it is possible to end on a high.”\n“This event is incredibly important to us, as it aligns perfectly with a mission to promote sport and to engage our youth, and also to ensure that we inculcate the unity and patriotism that we want our young people to foster,” she says.\nIn an age of information overload, Sunrise is The Namibian’s morning briefing, delivered at 6h00 from Monday to Friday. It offers a curated rundown of the most important stories from the past 24 hours – occasionally with a light, witty touch. It’s an essential way to stay informed. Subscribe and join our newsletter community.\nThe Namibian uses AI tools to assist with improved quality, accuracy and efficiency, while maintaining editorial oversight and journalistic integrity.\nStay informed with The Namibian – your source for credible journalism. Get in-depth reporting and opinions for\nonly N$85 a month. Invest in journalism, invest in democracy –\nSubscribe Now!",
  "word_count": 711,
  "scraped_at": "2026-02-14T12:48:35.029805"
}