{
  "article_id": "bb14243e09eb",
  "url": "https://www.staradvertiser.com/2026/02/13/hawaii-news/rearview-mirror/rearview-mirror-prices-work-in-coaching-radio-leaves-rich-legacy/",
  "title": "Rearview Mirror : Price work in coaching , radio leaves rich legacy",
  "date": "20260213T131500Z",
  "domain": "staradvertiser.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Two weeks ago, I wrote about former football coach and broadcaster Larry Price, who is 91 this year. Readers and friends sent me many of the funny and memorable things he said and did, and I’ll share them today.\nSecurity guard\nAfter graduating from Roosevelt High School in 1952, Price was in the Army for eight years, where he was a boxing champion and studied martial arts.\nFormer First Hawaiian Bank CEO Walter Dods said, “When Larry Price was going to UH as a student and working security, he was broke and starving. Every night my mom fed him leftovers from the Minute Chef restaurant at the Princess Kaiulani hotel where she worked.\n“Fast forward 30 or 40 years. … Larry Price was attacking me on the radio about something bank related. My mom called the radio station and I heard it while I was driving. She said, ‘Larry, this is Millie.’\n“He said, ‘Oh, hi Millie. How are you?’ She said, ‘Don’t you ever talk about my son again.’ And he never did.”\nCoaching\nPrice was head coach of the Rainbow Warriors from 1974 to ’76. An anonymous reader said, “I heard Larry Price describe how, when he was the UH head football coach, he was interested in recruiting a kid from Roosevelt, and wanted to speak with him.\n“Coach Price checked in at the administration office. As he was walking down the hallway towards the student’s class, he spotted a teacher walking towards him. She stopped, so he did too.\n“One of the Price boys, huh? Which one are you?”\n“I’m Larry, ma’am.”\n“So, what are you doing now Larry?\n“Thinking that he was all over the sports news, Price said, ‘I’m at UH.’\n“Apparently, the instructor didn’t follow sports because she then said, ‘What are you, a security guard?’”\nHow dare you!\nMayor Rick Blangiardi believes that Price’s guidance and mentorship made a huge difference in his life. “I had a full scholarship to play football at Boston College, but my dad had a job offer in Hawaii. I wrote a letter to the UH athletic director to see if I could play here,” he said.\n“Larry Price wrote back a week later. The tone was like, ‘Dear haole. How dare you even ask for a scholarship, sight unseen. If you want a scholarship, if you think you could play here, you gotta show up and earn it.’\n“I passed on Boston college and came out here in 1965 as a walk on. Three weeks later, I was starting inside linebacker and I had a full scholarship. In my second year here, coach Price made me the defensive captain.”\nAfter graduating, Price invited Blangiardi to be a linebacker coach. It allowed him to get a master’s degree at UH.\n“Larry Price as head coach was paid about $25,000 a year and I was making just $15,000 for full-time work.\n“He did so much for me as a player and a coach, and then when I was at the crossroads of my life — when my wife was pregnant with our oldest son and I had to reinvent myself if I wanted to stay here and find a job, it was coach Price’s mentorship about taking a sales job at KGMB that pointed me toward being a successful businessman.”\nBlangiardi worked at several stations and rose through the ranks to be general manager, and since 2021 has been mayor of Honolulu.\nNever follow Larry\nMichael Rota said, “When I was serving as vice president for academic affairs, I spoke at the Windward Community College graduation.\n“I was scheduled to follow the featured speaker, Larry Price. Larry spoke about his experience as a new assistant coach as the team was preparing to face the Huskies, an overwhelming favorite.\n“Family and friends told him, ‘We don’t expect you to win, but play hard and don’t get hurt.’\n“He then talked with passion and great drama about a sequence of plays late in the game when then-trailing Washington was stopped on the Hawaii 1-yard line, bringing up a fourth down. UH then intercepted a Washington pass and went on to victory.\n“After building the drama by detailing each of the three previous plays where Hawaii held off the seeming inevitable Washington, Larry paused, reached for his wallet, and pulled out a small leather piece of the game ball and held it high. It said ‘Hawaii 10 — Washington 7.’\n“It brought the crowd to its feet. He then went on to the true message of his speech, which was not to be captured by the low expectations of family and friends.\n“They love you and don’t want to see you get hurt. But you need to move beyond those constraints in order to make your own way.\n“I was left thinking to myself that I had just witnessed the greatest graduation speech I had ever heard, and as next speaker, my challenge was to quickly deliver my short message without dimming the excitement generated from Larry’s inspiring performance.\n“I also learned that you never want to follow Larry Price on the program.”\nLarry-isms\nAfter three years as head coach, Price went to work for Cec Heftel, who owned KGMB TV and KSSK radio. A few years later, in 1983, Heftel’s top morning deejay, Hal “Aku” Lewis, died, and Price and Michael W. Perry were invited to jointly take over his 5 to 10 a.m. shift.\nPerry said Price’s malapropisms were inspired by comedian Norm Crosby, who was masterful at it. “Larry thought it could be funny, and I told him to go for it.”\nGrant Otoshi said some of his favorites malapropisms came from news, sports and even commercials:\nNews:\n>> “Mardi Grass” instead of Mardi Gras\n>> Kaneohe Marine “Corpse” instead of Corps (pronounced “core”)\n>> “Homo-cides” instead of homicides\nSports:\n>> UH Wahine volleyball player “Heather Bone” instead of Heather Bown\n>> Michael “Jor-jan” instead of Jordan\n>> NY Yankees pitcher C.C. “Sabatina” instead of Sabathia\n>> UH “wee-men” sports instead of women\nCommercials:\n>> “Eee-go” waffles instead of Eggo\n>> “Nes-el” candy instead of Nestle (pronounced ‘Ness-lee’)\n“My favorite Larry-ism is his pronouncing ‘sumo’ as ‘suu-muu.’ When he finally pronounced it correctly one morning, he said it emphatically 3-4 times, possibly to appease any irate listeners,” Otoshi said.\n“But right after that, he proceeded to report that Hawaii-born ‘Mu-sushi-maru’ (instead of Mu-sashi-maru) won his match the preceding day.”\nPrice pronunciations\nJames Wakari said, “I used to tune into their show, largely to hear what Price would come up with next. My favorites were:\n“When referring to the Legislature, he would pronounce it ‘ladies laycha.’\n“He called the State Capitol — ‘That big squa-ah building on Britania Street.’”\n$20 bet\nJerry Takesono said, “Many years ago, a colleague of mine said that Larry Price was from the mainland.\n“I contested that. No, he’s a local boy! Anyone who pronounces the baseball term ‘over the fence’ as ‘owe fence’ can only be from Hawaii. We bet $20 on it.\n“Next time I saw him, he handed me $20. Of course I was right!”\nAn-TEHR-iums\nMerrie Carol Grain-Norris said, “I heard him on radio doing a PSA for an equine event. Instead of pronouncing ‘dressage’ the proper French way, ‘dress-aj,’ he said ‘dressage’ (rhymes with ‘message’).\n“Three of his others were: Her-ricane instead of hurricane.\n“An-TEHR-iums instead of anthuriums.\n“Pohn-SET-ahhs for poinsettias.”\nSmall pet warning\n“Every time the winds blew more than 30 miles an hour, we’d issue a ‘small pet warning,’” Perry recalled. “We’d tell listeners to ‘tie your skinny or lightweight relatives with a lot of sail area down, due to high winds today.’”\nJoyce Clarin remembered a Perry & Price pidgin joke. “Price said he had gone to Kauai the past weekend and it was really laid back.”\n“How laid back was it?” Perry asked.\n“It was so laid back that these two dogs were laying along the side of the road. A car was coming.\n“One dog said to the other, ‘Your turn bark.’”\n“Larry Price leaves behind a legacy that I don’t think anybody else will ever surpass,” Perry believes. “He is just a pure homegrown local boy. Back in the day, he might’ve been king because he was physically strong and mentally awesome.”\nThirty-three years of the Perry & Price Show have been donated to the Hawaii State Archives, where you can view digital versions of them.\nBob Sigall is the author of the five “The Companies We Keep” books. Contact him at Sigall@Yahoo.com or sign up for his free email newsletter at RearviewMirrorInsider.com.",
  "word_count": 1429,
  "scraped_at": "2026-02-14T12:13:22.722361"
}