{
  "article_id": "bb4ea6da0df2",
  "url": "https://mashable.com/article/fifa-womens-world-cup-2027-streaming-netflix",
  "title": "FIFA and Netflix strike a deal on FIFA Women World Cup streaming",
  "date": "20241222T013000Z",
  "domain": "mashable.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Netflix scores exclusive broadcasting rights for FIFA Women's World Cup\nNetflix just won the U.S. broadcasting rights to one of soccer's premiere tournaments: the FIFA Women's World Cup.\nConfirmed by the sports federation on Dec. 20, the streamer giant will be hedging its next live sports bet on the 2027 and 2031 FIFA Women's World Cup tournaments, with Netflix obtaining U.S. rights to air the competition in its first-ever full acquisition of the competition and the World Cup's first appearance on streaming.\nIn addition to dual English and Spanish telecasts, Netflix said it will debut exclusive documentary programming highlighting the teams and players in the lead-up to the tournament. \"Our record-breaking success with Amanda Serrano vs. Katie Taylor demonstrated the massive appetite for women’s sports and live programming,\" wrote Netflix chief content officer Bela Bajaria.\nYou May Also Like\n\"I’ve seen the fandom for the FIFA Women’s World Cup grow tremendously — from the electric atmosphere in France in 2019, and most recently, the incredible energy across Australia and New Zealand in 2023. Bringing this iconic tournament to Netflix is not just about streaming matches — it’s about celebrating the players, the culture, and the passion driving the global rise of women’s sports.\"\nThe decision is a departure from FIFA's normal live-to-air strategy for the global games and is a potential gamble for audiences. But the Netflix deal could be the best option for the Women's World Cup, according to FIFA, with the organization citing increasingly lower bids from broadcasters ahead of the 2023 face-off. And it could pay off for Netflix, as well, with the games drawing in more than a billion viewers in 2019.\nBroadly, FIFA has faced ongoing criticism for further entrenching gender inequity across the sport. In 2023, the body announced it would be tripling the prize money for the women's World Cup to $150 million— part of a three-year gender equity plan that also pledged to increase the number of women in coaching and administrative roles at FIFA and a partnership with UN Women.\n\"This agreement sends a strong message about the real value of the FIFA Women’s World Cup and the global women’s game,\" said FIFA President Gianni Infantino. \"FIFA and Netflix partnering together makes this a truly historic day for broadcasting and for women’s football.\"\nTopics Netflix Social Good Sports\nChase joined Mashable's Social Good team in 2020, covering online stories about digital activism, climate justice, accessibility, and media representation. Her work also captures how these conversations manifest in politics, popular culture, and fandom. Sometimes she's very funny.",
  "word_count": 425,
  "scraped_at": "2026-02-14T12:34:07.559860"
}