{
  "article_id": "bb54f00138a7",
  "url": "https://www.wrestlingnewssource.com/news/85246/WWE-Smackdown-Results-1282023/",
  "title": "WWE Smackdown Results ( 12 / 8 / 2023 ) ",
  "date": "20231209T033000Z",
  "domain": "wrestlingnewssource.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Featured below are complete WWE Friday Night SmackDown: Tribute To The Troops results from Friday, December 8, 2023. The following report was written by Rajah.com reporter Matt Boone and our live coverage partner (@MattBoone0709) as the show aired live from 8-10pm EST. on FOX.\nThe usual \"WWE Then. Now. Forever. Together.\" signature narrated by John Cena airs to get us started.\nWe then shoot inside the Amica Mutual Pavilion in Providence, RI. where we see a bunch of fans in military uniforms chanting \"USA! USA!\" as Kevin Patrick welcomes us to the 21st annual Tribute To The Troops special event.\nThe ring announcer immediately introduces two-time 2024 Grammy-nominated artists The War And Treaty. They are shown at the top of the stage with a piano and they begin performing \"God Bless America.\"\nAfter they wrap up, the fans chant \"USA! USA!\" again and then the song \"Red\" by Hardy and Morgan Wallen, the official theme for Tribute To The Troops once again this year plays as we shoot to Kevin Patrick, Michael Cole and WWE Hall of Fame legend JBL, the latter of which is joining them on special guest commentary tonight.\nSantos Escobar vs. Dragon Lee\nOnce the commentators finish running down the advertised lineup for tonight's jam-packed show, we head down to the ring for our opening contest. Kicking things off on this week's show is the first of two scheduled matches this evening in the ongoing U.S. title contender tournament.\nWith that said Santos Escobar's theme hits and out comes the former LWO member with a very heel looking facial expression, which the commentators point out before walking us through recent highlights from the past few weeks of Escobar's attack on Rey Mysterio and subsequent brawls with Dragon Lee.\nNow he settles in the ring, his theme wraps up, and the music for his opponent plays. Out comes masked fan-favorite Dragon Lee. He settles inside the squared circle and his entrance tune dies down. Before the match begins, Dominik Mysterio makes his way out to a ton of boos. He settles in at ringside.\nThe bell sounds and we're officially off-and-running with this one. After some initial back-and-forth action, we head into a mid-match commercial break with Santos in the offensive lead. When we return, things pick up a bit riding into the finish, which sees Escobar pick up the victory to advance to the next round of the tournament.\nEscobar moves on to face the winner of the other U.S. title contender tourney bout tonight between Bobby Lashley and Karrion Kross in the next round. After the match, Dom gets in the ring and stands over a still down and out Dragon Lee. He raises the North American title as the commentators plug their title tilt at NXT Deadline 2023.\nWinner and ADVANCING to the next round: Santos Escobar\nNow we head backstage and we see Randy Orton and SmackDown General Manager Nick Aldis. Orton asks Aldis why he is being forced to team up with LA Knight after just meeting him last week for the first time. Aldis says he saw Knight make the save for him and knows they both have issues with The Bloodline.\nOrton says he didn't need saved. He pays Aldis $100,000 in fine money for his actions last week in RKO'ing Aldis. Aldis tells him he only owed $50,000. Orton tells him the other $50,000 is future payment for when he does it again.\nWe return inside the Amica Mutual Pavilion in Providence, RI. as we hear the familiar sounds of the theme music of \"The American Nightmare\" Cody Rhodes. Out comes the RAW Superstar for a rare blue brand appearance on SmackDown.\nCody gets a rock-star reaction coming out and makes his way to the ring as fireworks and pyro explodes behind him and the crowd sings along with the lyrics to his catchy-ass entrance tune. He settles inside the ring to fans chanting his name.\n\"So Providence, what do you wanna talk about?\" he begins. He points out that he's a RAW Superstar but he couldn't pass up the opportunity to be here for this special event tonight, which he calls the greatest moment of the year for WWE.\nRhodes introduces a special Tribute To The Troops video package, which features comments from John Cena talking about how special the annual tradition in WWE is, and features highlights from the past 20 installments of Tribute To The Troops shows.\nAfter the package wraps up, we return inside the arena to fans chanting \"USA! USA!\" Rhodes then introduces the U.S. Army Drill Team, who come out and do their military service routine at the top of the entrance stage.\nWe head back to the commentary position at ringside, where Brad Nessler, who will call the annual Army vs. Navy college football game on CBS. He talks about the significance of the game and puts over the annual Tribute To The Troops tradition in WWE.\nBobby Lashley vs. Karrion Kross\nOut comes Bobby Lashley, who is introduced with his U.S. military credits included by the ring announcer, eliciting a big pop for the man who is generally a heel each week on the show. Remaining on commentary to call this match is CBS' Brad Nessler.\nAs \"The All Mighty\" settles inside the squared circle for our second of two scheduled U.S. Title Contender Tournament matches here tonight, we shift gears and head into a quick pre-match commercial break.\nWhen we return, we hear the familiar sounds of Karrion Kross' theme music. Out comes Scarlett doing her \"fall and pray\" routine as the camera shot turns black-and-white on the broadcast. Out comes Karrion Kross for his first match on SmackDown in quite some time.\nThe bell sounds and we're officially off-and-running with this one. We see some good back-and-forth action and then Lashley settles into the offensive lead as we head into a mid-match commercial break as this tourney tilt continues.\nAs we settle back in from the break, we see Kross taking over on offense. Lashley ends up fighting his way back into the lead a few moments later. After getting Kross down and out, Lashley stalks him in the corner. When he gets up, Lashley runs over him with a big Spear for the win.\nWith the win, Lashley advances to the next round of the U.S. Title Contender Tournament, where he faces the other winner of a first-round tourney bout from earlier tonight, Santos Escobar. After the match, The Street Profits come out to celebrate with Lashley as Cole and Patrick thank Nessler on commentary for stopping by.\nWinner and ADVANCING to the next round: Bobby Lashley\nNow we see some footage from last week's show of Damage CTRL and Bayley and their issues. We return live backstage where we see Damage CTRL members Bayley, Asuka, Kairi Sane, Dakota Kai and IYO SKY.\nBayley volunteers to hang backstage during Asuka's match this week after what happened last week. She then tries to be a good member of the group and turns her focus on trying to psyche up Asuka for her big match against Charlotte Flair tonight.\nAsuka, Sane and SKY don't really react, looking at Bayley in a non-friendly way. Dakota Kai approaches Bayley and tells her that it's good she's going to hang back tonight, but mentions how she and the rest of the team will be at ringside during Asuka's match.\nThey all walk off without Bayley, who looks sad watching them leave without her. That's how the backstage segment wraps up, and then we see hype for our next segment coming up after the break, which features the return of CM Punk to SmackDown. We head to another commercial on that note.\nWhen we return from the break, we hear the familiar sounds of Cult of Personality by Living Colour and out comes CM Punk to an explosively loud reaction from the jam-packed house inside the Amica Mutual Pavilion in Providence, Rhode Island.\n\"The Best in the World\" settles in the ring as the commentators try and explain just how loud the reaction in the building is right now, in case it's not translating on TV. They also hype whether or not CM Punk is going to sign with Raw or SmackDown. As his theme dies down, we hear an unbelievably loud \"CM Punk! CM Punk!\" chant from the Providence crowd.\nPunk begins by saying he's got good news. He says his segment isn't at the end of the show this time, so he tells the fans they can go ahead and chant all they want. The \"CM Punk! CM Punk!\" chant grows even louder. Punk mentions how Adam Pearce wants to sign him to Raw. He jokingly asks if the Raw crowd was louder.\nHe then tells the fans he's going to partially leave this decision up to him. He asks if they want him to sign with Raw and be a Monday night Superstar. They boo. He then asks if they want him to sign with SmackDown and be Friday night exclusive. The fans explode with a loud positive reaction. He asks if the fans want to see him throw 29 other Superstars over the top-rope and win the Royal Rumble and go on to main event WrestleMania.\nThe fans react big again and then break into another \"CM Punk! CM Punk!\" chant. He brings up someone in Cody Rhodes who welcomed him back with open arms and says he usually comes out and begins by asking, \"So, what do you wanna talk about?\" He then mentions how some people weren't overly fond of his happy go-lucky attitude in his first promo back.\nPunk then says he's gonna get spicey tonight. He says so it's not what do you want me to talk about, it's who do you want me to talk about? He asks if the fans want him to talk about Cody Rhodes, because he says he sure could tell us some stories. He asks or do the fans want him to talk about someone who's not here and by the sounds of it, never here, Roman Reigns. The fans erupt.\nCM Punk says, \"Tribal Chief ... I acknowledge you. Congratulations on all your success, but don't forget who the O.G. Paul Heyman Guy was. Don't forget he was my Wise Man first!\" He says Roman may not be here tonight, but his cousins are. He calls Solo a big tough son of a gun that he doesn't know. He then brings up Jimmy Uso before giving a quick shout-out to \"Main Event\" Jey Uso on Monday Night Raw. \"I see you, Uce!\"\nHe then brings up Randy Orton and asks if he can trust him. He says whether he can or can't, it'll be entertaining. He brings up LA Knight and the fans say his name along with him. He then says he heard someone say Kevin Owens. He calls Owens a bit prickly and says they are probably too much alike.\nHe jokes about how Owens likes to punch people randomly backstage, referring to his own issues in AEW, which the crowd picked up on. \"You just can't do stuff like that!\" The fans roar with a loud pop and follow-up \"CM Punk! CM Punk!\" chant. He says everyone's happy to see him, even JBL, who he points to on commentary. He then says everyone except one guy -- Seth \"Freakin'\" Rollins.\nHe says he's not gonna put too much stock into anything he says, despite his whiney voice, \"because he's not even 'The Man' in his own household.\" The fans are singing his tune in the background, to which Punk replies, \"That's all he's got is that song, so keep it up!\" He says he's here to talk to Nick Aldis and he's got a call with Shawn Michaels scheduled over the weekend to talk about NXT and then he's got a meeting with Adam Pearce on Monday.\nHe says after that he'll make his decision. He vows that now that he's back, he's the monkey wrench that will ruin everyone's plans and shake things up. He says some people talk about finishing their story, but he's here to finish his own that started years ago, and he makes it clear he's out to headline WrestleMania 40. An absolutely excellent promo segment wraps up on that note.\nThe theme for Charlotte Flair hits and out comes \"The Queen\" to a big pop. As she makes her way out and heads down to the ring, she settles inside the squared circle as we head into a quick pre-match commercial break.\nWhen we return, we see CM Punk backstage getting ready to go into the office of SmackDown General Manager Nick Aldis when out comes Kevin Owens, whom he just referenced in his promo. Owens doesn't look thrilled to see him.\nPunk makes one brief comment and Owens responds with a quick one-word answer before walking off. Punk thanks him and wears a big smirky grin on his face as he gets ready to head into talk to the SmackDown G.M. Back inside the arena, Flair is in the ring awaiting the arrival of her opponent.\nWith that said, Asuka's theme hits and out comes \"The Empress of Tomorrow\" accompanied by the rest of Damage CTRL, except Bayley. Out of nowhere, Michin and Zelina Vega run over and start attacking Damage CTRL. After the chaos is cleared up and in the rear view mirror, Asuka and Flair are in the ring and ready to rock and roll.\nAfter the bell sounds to get this one started, we see Flair start off in the offensive lead, taking it to the Damage CTRL member as the fans cheer her on in the background. Asuka fights back with some kicks and gets in some offense, but when the action spills out to the floor, \"The Queen\" takes back over.\nFlair heads to the top-rope and leaps off backwards, partially connecting with a moonsault on Asuka on the floor. When she gets up, she soaks in the reaction from the crowd as we shift gears and head into a mid-match commercial break as the action continues in this women's singles bout.\nAs we settle back in from the break, the commentators are immediately informing us of a very scary moment that saw Flair slip and take an awkward and very dangerous landing off the ropes during the commercials. The referee keeps checking on Flair, who is badly limping.\nShe looks for the Figure-4 or Figure-8, but out comes Bayley through the crowd. Flair runs over and knocks her off the apron, but this ends up having its' desired affect, as Bayley's distraction allows Asuka to pick up the win. Bayley yells \"YES! I did that!\" happy with her actions as Asuka celebrates the win.\nWinner: Asuka\nBackstage we see Nick Aldis and CM Punk wrapping up their planned behind-doors meeting. Aldis walks off and then we see Cody Rhodes walk up and ask if he heard CM Punk right earlier tonight about the Royal Rumble and finishing his story at WrestleMania.\n\"The American Nightmare\" points out how that means he won't be able to do that himself. He takes a moment and then again welcomes Punk back with a handshake and walks off.\nIt's main event time!\nWe return and shoot backstage where we see LA Knight, Randy Orton and CM Punk. Punk smirks at the two of them and says, \"Good luck tonight, boys.\" He walks off smiling. Orton asks Knight if he's ready for tonight. Knight simply replies, \"Yeah\" in his typical fashion and walks off.\nBack inside the arena, the theme for The Bloodline duo of Solo Sikoa and Jimmy Uso hits and out they come by themselves. Noticably absent is the usually present \"Wise Man\" of The Bloodline, Paul Heyman.\nAs Uso and Sikoa settle inside the squared circle for our final match of the evening, the commentators talk us into a quick pre-match commercial break.\nWhen we settle back in from the break, we see The Bloodline duo still in the ring awaiting the arrival of their opposition. Cole and Patrick announce Roman Reigns' return for next week's SmackDown, as well as Kevin Owens vs. Austin Theory and Grayson Waller vs. TBA in U.S. title contender tourney bouts.\nIn the arena, the theme for LA Knight hits and out comes \"The Mega Star\" to a huge pop from the Providence crowd. He settles in the ring and his music dies down. Randy Orton's theme hits and the crowd explodes as \"The Apex Predator\" emerges and heads to the ring for our final match of the show.\nThe bell sounds and we're officially off-and-running with this one. Orton and Uso kick things off for their respective teams. Orton beats down Uso early on. Solo Sikoa tags in and the fans react to the sight of Orton and Solo. Orton goes to work on Solo as well. We head into a mid-match commercial break.\nNow that we're back we see Knight and Sikoa as the legal men in the ring, with Knight in the offensive lead. Within seconds of returning from the break, however, we see the momentum shift as Sikoa begins beating Knight down. This continues for a few minutes until finally Orton makes the hot tag and takes back over.\nOrton pops the crowd and starts beating down Sikoa and Uso by himself. The fight spills out to the floor where Orton bounces Uso off the commentary desk, which again doesn't break. The fans chant \"One more time!\" but this time Orton doesn't oblige, instead opting to roll him into the ring.\n\"The Apex Predator\" hits his trademark draping DDT spot on Uso and then drops down and pounds the mat as he taps into his inner \"Viper.\" Before he can hit an RKO on Uso, he is attacked from behind by Sikoa. Knight deals with Sikoa.\nKnight then looks to hit his BFT finisher on Uso, but Orton instead spins Uso to his direction and hits an RKO out of nowhere for the pin. After the match, Orton and Knight smirk at each other and then celebrate their victory as this week's show goes off the air on that note. Thanks for joining us!\nWinners: Randy Orton & LA Knight",
  "word_count": 3053,
  "scraped_at": "2026-02-14T12:05:37.305680"
}