{
  "article_id": "bba657fdd7d9",
  "url": "https://www.nbcnews.com/news/world/gary-lineker-match-of-the-day-uk-immigration-nazi-germany-braverman-rcna74486",
  "title": "How a tweet by a TV host became a new battle in the culture war engulfing the U . K . ",
  "date": "20230312T173000Z",
  "domain": "nbcnews.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "LONDON — What began as a tweet by a popular sports personality comparing the language of the government’s new immigration plan to that of 1930s Germany has ended in an embarrassing climbdown from the national broadcaster after a saga that dominated British news for days.\nThe BBC announced Monday morning that it would reinstate Gary Lineker — a feted former English soccer star who once captained the national men's side — after he was suspended last week for overstepping rules on impartiality in the wake of fierce criticism from sections of the media and Conservative politicians.\nLineker will return as the presenter of the country’s flagship soccer highlights program, 'Match of the Day,' restoring order to the U.K.'s airwaves after a mutiny in solidarity with Lineker that fueled growing questions about the public broadcaster's relationship with politics as the country faces an intensifying culture war.\nLineker said Monday that he can’t wait to return to presenting duties and praised the BBC as the “best and fairest broadcaster in the world,” but he stood firm on his views on immigration.\n“However difficult the last few days have been, it simply doesn’t compare to having to flee your home from persecution or war to seek refuge in a land far away, “ he said in one of a series of tweets.\nTim Davie, the BBC’s director-general, said in a statement that he recognized the problems caused by the “grey areas” of the BBC’s social media policy and was launching a review into the rules.\nLast week Lineker called a government proposal to drastically alter the country's asylum policy “beyond awful,” before doubling down when challenged, calling it “an immeasurably cruel policy directed at the most vulnerable people in language that is not dissimilar to that used by Germany in the 30s.”\nThe bill has been blasted by rights groups and criticized by the United Nations Human Rights Council, which said it was in “clear breach of the Refugee Convention” and would effectively result in an “asylum ban.”\nSuddenly, the presenter, who is known for his lighthearted humor and wry asides, and who has appeared in many commercials for one of the U.K.’s largest potato chip brands, found himself subject to complaints from several members of the government and a target of the right-wing press.\nInterior Minister Suella Braverman told the BBC that his comment “diminishes the unspeakable tragedy” of the Holocaust. (Lineker did not mention the Holocaust in his public comments.)\nLineker has faced criticism in the past for his use of social media, having tweeted about Brexit, government policy and donations to the ruling Conservative Party from Russian oligarchs. But his latest intervention hit a nerve with the government. According to a recent poll by British pollster YouGov, 73% of participants thought it was handling immigration issues badly.\nAs it came under mounting pressure, the BBC announced Friday that Lineker was going to “step back from presenting its flagship soccer program ‘Match of the Day’ until we’ve got an agreed and clear position on his use of social media.” The national broadcaster added that it considered “his recent social media activity to be a breach of our guidelines.”\nThe move sparked outrage on social media, and the hashtags #ImWithGary and #BoycottBBC began trending on Twitter. Elsewhere, a petition to reinstate Lineker, the top scorer at the 1986 World Cup, had garnered almost 200,000 signatures by early Sunday.\nAnd after Lineker’s sideline, commentators on “Match of the Day” — which holds the world record for the longest running soccer show — announced they were withdrawing from the program, which aired on Saturday night with no studio presenters or punditry. Soccer players and managers also refused to conduct interviews for the show, and the normal 80-minute running time was cut to 20 minutes.\nOther BBC sports shows were cancelled and Five Live, the network’s news and sports radio station, was reduced to playing podcasts on Saturday, which is normally an action-packed day of soccer, rugby and more.\nNBC News has reached out to Lineker for comment, but he did not respond to reporters when asked about the matter on Sunday.\nEven Prime Minister Rishi Sunak was drawn into the episode. Acknowledging that “not everyone will always agree” with his new asylum policy, Sunak appeared to distance himself from the furor Saturday, saying in a statement that it was a matter for the BBC, “not the government.”\nMany in the know doubted this was entirely true.\nThe government “pushed the BBC to go in a very particular line,” Gholam Khiabany, a professor of politics and the media at Goldsmiths, University of London, told NBC News Saturday. It had “created a crisis” for the broadcaster by putting pressure on the organization to censure Lineker while later stating the matter was entirely “up to the BBC.”\nThe government had tried a similar tactic when it put pressure on the Freedom From Torture charity to remove a video it had posted to Twitter of a Holocaust survivor challenging Braverman about her language on immigration. Freedom From Torture refused to take it down, but Khiabany said the government had done the same thing to the BBC “and to some extent they have succeeded.”\nAlthough it is technically independent of the state, the BBC is funded by an annual levy the government collects from everyone who owns a TV or radio. Because the broadcaster’s income was “determined by the government of the day,” it was “always a sword which is above the head of the BBC,” Khiabany said.\nThe debate has also raised questions over the future of other figures at the BBC, many of whom have expressed overt opinions or have been active in politics.\nChief among them is BBC Chairman Richard Sharp, who has donated money to the ruling Conservative Party and is currently the subject of an ongoing parliamentary inquiry about the part he might have played in facilitating a loan worth hundreds of thousands of dollars to former Prime Minister Boris Johnson. He has denied any involvement in arranging the loan.\nInternally, the BBC faces more pressing problems.\nStaff past and present criticized the BBC’s handling of the issue, including Greg Dyke, its former director general, who told BBC Radio 4 that the broadcaster had “undermined its own credibility by doing this because it looks like — the perception out there — that the BBC has bowed to government pressure.”\nRoger Mosey, a former head of BBC TV News, also tweeted Saturday that it looked like the broadcaster had “given in to one side of the culture war,” which he said was intensified by the presence of Sharp, the chairman, who he said “should go.”\n“He damages the BBC’s credibility,” Mosey wrote, adding that “ideally Lineker should stay within clear, agreed guidelines.”\n“Whatever happens, I think the BBC will come out of this much weaker than it was,” said Khiabany, adding that the corporation had “failed significantly on the notion of independence in journalism.”",
  "word_count": 1159,
  "scraped_at": "2026-02-14T12:13:41.936481"
}