{
  "article_id": "bba800a1ca8e",
  "url": "https://www.dailymail.co.uk/news/article-14752771/Child-four-seriously-ill-hospital-Liverpool-crash-police.html",
  "title": "Child is among four  very seriously ill  in hospital after Liverpool crash - as police face serious questions over how driver was able to get onto road packed with fans before smashing into crowd",
  "date": "20250527T091500Z",
  "domain": "dailymail.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "- For the latest updates on the Liverpool parade ramming, follow our live blog\n- Did you witness the horror? Email arthur.parashar@mailonline.co.uk\nPolice in charge of planning the Liverpool trophy parade were today facing serious questions over how a driver was able to access a packed street and plough into crowds during the celebrations.\nUp to one million Liverpool fans had jubilantly gathered to celebrate the club winning the Premier League title with a 10-mile trophy parade through the city centre on Bank Holiday Monday.\nBut in another alarming reminder of how vehicles can be used as a weapon, the celebratory scenes soon descended into a day of horror as a people carrier veered into crowds on Water Street at around 6pm, leaving at least 47 injured.\nA total of 27 people have been taken to hospital following the horrific incident, including four children. One child was trapped under the car with three adults when firefighters arrived to save them.\nLiverpool City Metro Mayor Steve Rotheram confirmed this morning there are 'still four people who are very, very ill in hospital'. The other 20 casualties were treated at the scene\nJack Trotter, one of the victims who was rushed to hospital, said he remains in 'agony' after being discharged and described it as 'the most horrifying incident I've ever experienced in my life'.\nPrime Minister Sir Keir Starmer this morning said the whole country 'stands with Liverpool', describing the incident as 'scenes of joy turned to utter horror and devastation'.\nIn what has been described as an 'unprecedented' move, Merseyside Police quickly confirmed a 53-year-old white British man from the Liverpool area was arrested, adding that it wasn't being treated as terrorism.\nIt comes after the same police force was criticised over the Southport murders last summer after riots engulfed Britain over false rumours the killer was a Muslim asylum seeker.\nBut the force has come under fire from security experts and witnesses who have today told of their shock that Water Street, a busy road packed with fans, was accessible to the people carrier and ultimately led to the scenes of chaos.\nCharlotte Hennessy, whose father died in the 1989 Hillsborough disaster, said questions need to be asked about how the driver was able to access a 'road which should have been closed'.\nEmergency services rushed to the scene and 27 people, including four children, were taken to hospitals across the city. Pictured: A paramedic carries an injured fan out the crowd\nDistressing footage captured the moment that the people carrier struck fans gathering for the parade\nA 53-year-old white British man from the Liverpool area was swiftly detained by police\nAs police continue to question the driver, this is how the horrific incident unfolded -\n- Up to 1 million fans had lined the streets to celebrate Liverpool's title victory;\n- Parade began at Allerton Maze south of the city before ending on the Strand;\n- Chaos erupted on Water Street, about a mile before the parade's endpoint;\n- The bus had only recently passed the attendees when a vehicle rammed crowds;\n- A 53-year-old white British man from the Liverpool area arrested, police said;\n- Twenty-seven people taken to hospital; further 20 were treated at the scene;\n- Four people trapped under the car, including a child, rescued by firefighters;\n- Police said the horrific incident was not being treated as terrorism.\nFootage appears to show the grey Ford Galaxy struggling to make its way along Dale Street, the main business thoroughfare in the city, while hundreds of fans were still on the street.\nSome could be seen banging on the car's rear and back window, before the vehicle quickly reversed and went forward, seemingly antagonising supporters.\nThe parade bus had passed along The Strand, the main road along the famous waterfront which was closed to traffic, just moments earlier. But Water Street, which runs off it, was packed with people walking into the city to catch trains, buses and taxis home.\nLater footage seemingly showed that, by the time the car reached the end of Dale Street and entered Water Street, its back window had been smashed. The driver then went on the rampage and ploughed into the crowds.\nAssistant Chief Constable Jenny Sims last night told a press conference that there were 'robust' traffic management measures in place for the parade.\nHowever, neither Dale Street or Water were advertised as being part of 'fixed' closures before the event although 'rolling' road closures were anticipated along the route.\nIt is understood that Water Street was closed to traffic as part of a rolling road block as the parade reached the city centre.\nA source told the Mail that there were bollards at the top of the road, at the junction of Dale Street close to the Town Hall, but these were moved to allow an ambulance to get through and the driver 'tailgated' the emergency vehicle to access Water Street.\nMr Rotheram said the 'big question' was how the horror unfolded. 'Water Street was not a route where vehicles were supposed to be using it, it was blocked off,' he said.\n'At this end of it, which is the direction that it was coming in, towards The Strand, there were literally hundreds of thousands of people here, so no vehicle would have got through anyway.\n'And the questions, I suppose, are legitimate, but we have to give the police the time to conclude their investigations, which is what they're doing.'\nSecurity expert Lee Doddridge told Sky News this morning that police had used 'totally the wrong tactic'.\nHe said: 'The immediate thought for me was how was a vehicle allowed to be among so many people?\n'I've got to say it is just alarming that a vehicle was allowed to be so close. You allow for emergency service vehicles, it really doesn't matter at this point what the motive was, we know it wasn't terrorism, but really, a vehicle should not have been allowed anywhere near those celebrations.'\nMr Doddridge added: 'One of the images shown last night were police snipers on rooftops as if they were covering the crowd. Totally the wrong tactic. If they had focused more on preventing vehicles getting in they could have prevented this incident.\n'I say could have prevent it because that's exactly what you do when you do it correctly. I do think it places a massive liability on Merseyside Police for not getting this right.'\nThe former counter-terrorism security adviser said police will be 'very aware of these types of incidents' and the 'tactics' used.\nHe explained that since 2004, police have had the power to implement an 'anti-terrorism traffic regulation order' (ATRO) 'so they can make plans and actually legally close roads so no members of the public can drive through there'.\nMr Doddridge said they can also use the National Barrier Asset, which was used extensively during the Olympics.\n'The Counter Terrorism Security Adviser (CTSA) can make an application on behalf of Merseyside Police and rent the National Barrier Asset which would be deployed around those strategic areas within Liverpool to prevent vehicles coming in,' he said.\nMr Doddridge said there should have been better 'contingency planning' in place - noting this isn't the first time a trophy parade has been held after a Premier League title win.\nJack Trotter (pictured), one of the victims who was rushed to hospital, said he remains in 'agony' after being discharged and described it as 'the most horrifying incident I've ever experienced in my life'\nForensics arrived at the scene of the parade crash on Tuesday morning as investigations continue\nPolice in forensic white suits were seen taking photographs of the area and collecting items\nTwo forensic detectives are seen investigating the scene near to where a car ploughed into the crowd\nPolice officers walk along Water Street near the Liver Building in Liverpool city centre this morning\nPolice tents surrounded by debris at the scene in Water Street the morning after the terrifying incident\nMerseyside Police stressed the event is being treated as an isolated incident, and police are not looking for anyone else in connection with the crash\nLiverpool Metro Mayor Steve Rotheram speaks to members of the media near the scene in the aftermath of the incident\n'They could have been planning for this, watching throughout the season, have plans in place. Once they realise it's there's, they can bring that ATRO in and make sure that entire area for that parade is completely safe with only access to emergency service vehicles.\n'If they had applied an ATRO the only thing they would have prevented was cars and larger vehicles getting in.\n'There's pedestrian portals, so pedestrians could walk through, the fans, supporters could be there and it would make it probably more enjoyable because you wouldn't have it in the back of your mind what if something happens.\n'The police on the outer cordons would be doing the harder work, but everyone inside can almost sort of relax slightly.'\nMailOnline has contacted Merseyside Police for comment.\nWitness Chelsea Yeun said she was inches away from being struck by the car - and was shocked Water Street was not closed.\nShe said after the parade had finished they had all decided to come off the route on The Strand and walk up the city in an attempt to get home. Chelsea and her friend Francesca went onto Water Street, usually a one-way street, where there was a 'sea of people'.\nShe assumed the council had closed the roads off to allow people to have walking access as the street was just 'jam packed and you couldn't move'.\n'We were walking at such a slow pace and when we were walking there wasn't much room around anywhere,' she told Good Morning Britain.\nShe didn't see the car come plummeting towards her and only managed to jump out of the way as she heard a beeping noise and shouts coming from the crowd.\nAsked if she had the impression that the street had been closed down, she said: 'Yes, obviously it is a main city street and Water Street is a very busy street. I feel like just by the sheer amount of people that we assumed it was closed off, and it should have been closed off.\n'As we walked further up, there were railings that were scattered on the floor. I don't know whether those railings were to have the crowds separated or to stop cars coming down.\n'It's common sense that there should have been no cars in the immediate city area. But looking at the footage I've seen, after the event on Dale Street there were cars coming up and down.\n'On Dale Street it leads onto Water Street so I don't know why there were cars up there but there was definitely no cars on Water Street because it was just people. So I don't know if the cars were just allowed on Dale Street and it had just gone through the railings... I don't know. I'm not too sure.\n'But the roads absolutely should have been cornered off just for pedestrians with such a big thing coming to the city.'\nAnother woman, Hannah, told BBC Radio 5 Live: 'The roads are closed, how did a car get down there anyway? You see people lying on the floor, all I can remember is just the police going 'everyone go now, now, leave', they ushered us all off and they were screaming.'\nShe said she could hear shouting and then saw people lying on the floor, adding: 'It was just too many people, you couldn't actually see what had happened.\n'All you could hear was like shouting, shouting, and I just knew something had happened.\nThe parade was due to leave Allerton Road to travel along Queens Drive at 230pm. The route was along Queens Drive, Mill Bank, West Derby Road, Rocky Lane, West Derby Road, Low Hill, Islington, Hunter Street, Byrom Street, Leeds Street, The Strand and was due to finish at Wapping at 6pm.\nPolice had warned ahead of the parade that there would be a 'rolling road closure'.\nBut they said fixed closures would be in place on The Strand (northbound at 7am, southbound at 12pm), Queens Drive, between The Rocket and Prescot Road (12pm), Queens Drive at Allerton Road (12pm), Mill Bank (1pm) and West Derby Road, between Sheil Road and Everton Road (1pm).\nThere was no mention of Water Street being closed.\nAhead of the parade, Merseyside Police said: 'Road closures will be in place to allow the parade to take place safely and the public is advised to either view the parade as close to home as possible, walk or take advantage of public transport.\n'Supporters are also being advised to line the whole route to avoid crowding in busy areas.'\nChief Inspector Chris Barnes, silver commander for the parade, had said there would be a 'large number of police officers on the streets along the whole parade route who will be providing a reassuring presence and making sure fans can enjoy the parade safely.'\nHe said road closures would be put in place by Liverpool City Council. Water Street was not mentioned as a street that would be closed on the council's website.\nA key question is how a car managed to get near a parade involving up to a million people given previous incidents of vehicles being driven into crowds.\nIn 2016, Mohamed Lahouaiej-Bouhlel used a lorry to plough through a crowd in Nice during Bastille Day celebrations on July 14. 86 people were killed and more than 400 injured before the 31-year-old Tunisian was shot dead by police.\nThe following year, vehicles were used in two attacks by terrorists in central London.\nOn March 22 2017, Khalid Masood, a 52-year-old Brit, killed four people and injured more than 50 when he drove into pedestrians on Westminster Bridge and Bridge Street. He was also shot dead by an armed police officer.\nThen just months later, eight people were killed and 48 injured when a van rammed into pedestrians on London Bridge. The three men in the van, Khuram Butt, 27, Rachid Redouane, 30, and Youssef Zaghba, 22, were all shot dead.\nIn two further incidents, 10 people were killed by a van driver in Toronto, Canada, in 2018, while in June 2022, a 59-year-old woman was left with life-changing injuries after driver Luke Geard ploughed into her in Axminster, Devon.\nIn Liverpool yesterday, dramatic footage captured just before the chaos unfolded shows the Ford Galaxy being surrounded and attacked by angry fans as it attempts to reverse out of the packed street.\nOne witness claimed the driver had just left a nearby bar moments before.\nSupporters - alarmed by the car's erratic movements in the dense crowd - can be seen hitting the windows and kicking the tyres.\nOne man even rips off the rear windscreen wiper and appears to try smashing a window before jumping out of the way to avoid being run over before the car then sped off down the road.\nAuthorities have confirmed the incident is not being treated as terrorism and that the man in custody, a white British male from Liverpool, is believed to have been the driver of the vehicle.\nWitnesses reported the car was travelling at 30mph and had been sounding its horn as it edged through the dense crowd - prompting angry fans to ask 'what are you doing?' before it suddenly accelerated, swerved, and mounted the pavement.\nThey described how 'all hell broke' loose and people 'were flying in all directions' as car ploughed into the tightly packed crowd for 200 yards.\nMr Rotheram said this morning there are 'still four people who are very, very ill in hospital'.\nAsked whether that reflects an increase on the previous number of seriously injured - given by authorities last night as one adult and one child - he told BBC 5 Live: 'No, not directly, but of course we're in liaison with the police and with the ambulance services.'\nVideo circulating online showed the people carrier moving slowly along the crowded street. Pedestrians appeared to stop it and try and pull the driver from the passenger seat, shouting 'what are you doing?'\nPolice officers investigate the scene of an incident in Water Street, on the sidelines of an open-top bus victory parade for Liverpool's Premier League title win\nA large emergency service presence is pictured on Water Street during the Liverpool Trophy Parade\nLiverpool is waking up after the trophy parade descended into horror in Liverpool\nThe scene of where the car ploughed into crowds on Water Street is seen this morning\nA large forensic tent protected the scene of the crash this morning as police continued gathering evidence\nIt reversed before suddenly accelerated into the tightly packed crowd of supporters, with witnesses describing the screams of victims and the sickening thud of bodies being flung over the bonnet.\nThe vehicle accelerated veering right then left, travelling across the street mounting the pavement, hitting men, women and even a baby, witnesses said.\nWhen the car eventually slowed to a stop, angry fans surged forward hitting it, throwing bottles, screaming 'kill him' as others attempted to lift the vehicle to rescue pedestrians trapped under the wheels.\nWithin seconds, the driver was dragged from his seat before police intervened.\nThe shocking incident took place only days after a run in one of the city's parks to commemorate the lives of the Liverpool fans who died in the Hillsborough disaster in 1989.\nNinety-seven football fans were fatally injured in a terrace crush at an FA Cup semi-final between Liverpool and Nottingham Forest on 15 April 1989.\nA source told the Mail that the driver appeared to have 'tailgated' an ambulance down Water Street, which had been closed to traffic.\n'It looks as if he has panicked when he realised he was in the crowd and people began banging on his car,' the insider said.\n'Instead of going back the way he came he's got angry and put his foot down, it's absolutely devastating.'\nPictured: The man who was driving the car in Liverpool\nMark Leavy told the Mail: 'I will never forget the noise of the people being hit and I will never forget the look on a policeman's face and his uniform covered in blood.\n'My God, what he must have seen.'\nPatrick Milligan, 25, from Wigan said: 'We all had the best day of our lives watching the parade and then it was like a tsunami within about 5 minutes of the parade finishing. It was horrific.\n'The car just swerved into the crowd at speed and everyone was screaming.'\nOne victim, Jack Trotter, told the BBC from his hospital bed that he was in 'absolute agony' after he was struck by the car.\nMr Trotter, from Newtownards, County Down, had come to the parade from Northern Ireland with his girlfriend, Abbie Gallagher, who narrowly avoided being struck as well.\nAfter being discharged from hospital today, he wrote on Instagram: 'Only back from hospital after the most horrifying incident I've ever experienced in my life... genuinely seriously lucky to still be here after this as I just moved out of the way in time.'\nCounter Terrorism Policing North West are assisting Merseyside Police in the investigation. The driver's identity has not yet been released.\nDave Kitchin, head of North West Ambulance Service, confirmed the scale of the response: 'Twenty-seven patients were taken to hospital, including four children. One of the children and another member of the public sustained serious injuries.'\nHe said several ambulances, plus hazard response teams, the air ambulance and senior clinicians arrived within minutes to treat the casualties.\nAssistant Chief Constable Sims of Merseyside Police said: 'My thoughts are with all those injured in tonight's horrific incident.\n'This had been a joyous day in Liverpool with hundreds of thousands of people lining the streets to celebrate Liverpool Football Club's parade.\n'Sadly, at 6pm as the parade was drawing to a close, we received reports that a car was in collision with a number of pedestrians in Water Street.'\nSims stressed the event is being treated as an isolated incident, and police are not looking for anyone else in connection with the crash.\n'We believe this to be an isolated incident and are not currently looking for anyone else. The incident is not being treated as terrorism,' she said.\nThe police chief urged the public not to speculate or spread misinformation online, and thanked emergency workers and bystanders who rushed to help the injured.\nWitnesses described utter carnage as the vehicle drove through the narrow, packed street.\nFans were flung from the bonnet amid horrifying screams. As the car finally came to a halt, a furious crowd surrounded it.\nOne witness said: 'It's horrific. He must have run over about 20 to 30 people. I saw it and only survived because I got into a side street.\n'The police dragged the (driver) out and arrested him straight away.'\nDramatic footage later emerged online showing the moment of impact and the frenzied aftermath, with people smashing the vehicle and police officers struggling to restrain the crowd.\nHarry Rashid, 48, from Solihull, was at the parade with his wife and two young daughters. He told reporters: 'It happened about 10 feet away from us.\n'This grey people carrier just pulled up from the right and just rammed into all the people at the side of us.\n'It was extremely fast. Initially, we just heard the pop, pop, pop of people just being knocked off the bonnet of a car.'\nAnother witness, Paul, told BBC Radio 5 Live: 'We just heard this screaming and we just saw the car coming towards us and he revved so hard, that's all I can get out my head, the car was revving so hard and then there were just people laid all over.\n'And I just can't get this picture of this poor lady just laid under the front of the car, it was horrendous.\n'And then we dived to some steps at the side which is a block of flats, and after a couple of minutes some people did let us into the flat and some lovely girls actually took us up to their room and let us sit in their room for a couple of hours because it was on lockdown until we were allowed out.'\nLiverpool City Council Leader Liam Robinson said the crash had cast a 'very dark shadow' over what had been a joyful celebration.\nHe said: 'I'd like to start by saying on behalf of everyone in Liverpool how much our thoughts and prayers are with those affected by this appalling incident in the city centre.'\nPolice officers cover area with an inflatable tent to preserve evidence\nThe leader praised the emergency services and NHS staff who responded quickly and are continuing to support the injured.\n'I would appeal for people please not to share the horrifying footage of the incident on social media – please if you have information forward it to Merseyside Police to help them with their investigation,' he said.\n'Once again, our hearts go out to those affected. Liverpool is a city that has a proud history of coming together and supporting each other during challenging times. I've no doubt that will be the case over the coming days and weeks.'\nAnother bystander, Ms Yuen, said: 'We were literally like sardines walking up the street and when we looked up, there was a black, people carrier, driving straight towards us.\n'Me and my friend Francesca jumped out the way and pulled her little girl out the way.'\nFrankie, 24, who survived the 2017 Manchester Arena bombing, was also caught in the incident.\nShe said: 'I was at the Manchester Arena incident. I don't want to go out again. The side of the car went into me and I fell to the floor. It's all a blur. I've got cuts and bruises and I'll be fine but there's loads who have got more severe injuries.'\nRobby Potter, one of the most seriously-injured people to survive the Manchester Arena bombing after being blasted through the heart with shrapnel, told how he was 'seconds' down the street from the carnage.\nThe 'shaking' Liverpool fan, from Wirral, said police and officials should have been aware of the risk of a potential incident away from the parade route itself.\nHe said: 'I was 10 seconds in front. I'm shaking. I said areas away from the main parade could be targets. I said this in interviews.'\nMr Potter said some of the crowd went back seeking to attack the driver.\nOne onlooker, Matthew O'Carroll, 28, from Runcorn, saw the car approaching the top of Water Street.\nHe said the vehicle went past a parked police van at a 'decent' speed and that the driver was beeping as he went through the crowd.\nMeanwhile, witness Mike Maddra said he 'car turned left, mounted pavement, come towards us and runs towards the buildings'.\nHe said: 'We got out the way and it was speeding up'. Mr Maddra said he thought he saw two people being hit.\nSocial media video also showed angry fans converging on the vehicle as it came to a stop, smashing windows before police intervened.\nWitnesses told The Guardian the whole ordeal lasted 20-30 seconds, and the first victim was thrown 'about 20 feet' in the air.\nDan Ogunshakin, an off-duty BBC reporter attending the parade, told the public broadcaster he saw people hitting the car before it reversed and then 'it suddenly accelerated forwards', straight towards the surrounding crowd.\n'What had once been an atmosphere of celebration and joy and happiness suddenly turned into fear and terror and disbelief,' he said.\n'People were gathering around the car. Shaking it, hitting it and people were getting quite angry.\n'People did scatter incredibly quickly but no real surprise because the car did accelerate very very quickly.\n'All of a sudden it was like all hell had broken loose. People were flying in all directions. We saw a gentleman come towards us who was inconsolable - in floods of tears.'\nAuthorities have confirmed the incident is not being treated as terrorism, and the man in custody, a white British male from Liverpool, is believed to have been the driver of the vehicle\nDebris is left behind on Water Street after a Ford Galaxy drove into pedestrians, sparking scenes of panic\nThis morning, Water Street was still closed as police investigated the scene following the tragedy\nA Liverpool flag is left behind at the scene as pedestrians fled the scenes of horror\nFormer Metropolitan Police chief superintendent Dal Babu said the speed at which police released the race and ethnicity of the suspect in the Liverpool car incident is 'unprecedented'.\nThe force was criticised in the wake of the Southport murders last summer for not releasing more information after false rumours were started online that the killer was a Muslim asylum seeker.\nFormer Metropolitan Police chief superintendent Dal Babu told BBC Radio 5 Live: 'What we do have, which is unprecedented, is the police very quickly giving the ethnicity and the race of the person who was driving the vehicle... and it was Merseyside Police who didn't give that information with the Southport horrific murders of those three girls, and the rumours were that it was an asylum seeker who arrived on a boat and it was a Muslim extremist and that wasn't the case.\n'So I think what the police have done very, very quickly, and I've never known a case like this before where they've given the ethnicity and the race of the individual who was involved in it, so I think that was to dampen down some of the speculation from the far-right that sort of continues on X even as we speak that this was a Muslim extremist and there's a conspiracy theory.'\nEducation Secretary Bridget Phillipson has said she won't 'make judgments' on Merseyside Police's decision to reveal details about the identity of the man arrested.\nPolice are pictured this morning after 47 people were injured when a car ploughed into the crowd\nA Liverpool fan scarf was left behind as the joyous trophy parade turned into a day of horror\nAsked if the police had 'changed tack' she told Times Radio: 'These are operational matters for the police, and it's for the police to determine how they will respond. 'I don't think it's right for politicians to make judgments on that, but I would just add that the police were on the scene rapidly and responded to what was a really horrendous incident.\n'And I pay tribute to those first responders, police and other emergency services, for their tremendous bravery, for everything they've done, but also to the community in the way that they're pulling together in light of this tragedy.'\nShe added: 'As I understand it, the police had ensured that traffic controls were in place, but you'll appreciate I don't want to get into speculating at this stage on what has happened.'\nMerseyside police insisted a 'robust' traffic management plan had been in place for the parade.\n'In the lead-up to this event we had been working closely with event organisers and a robust traffic management plan was put in place for the parade, which included a number of road closures throughout the route and the city centre,' Jenny Sims, assistant chief constable, said.\nBBC reporter Matt Cole, who had been at the parade with his family, narrowly avoided being struck.\nHe said: 'There were screams ahead of us and suddenly this dark blue car just came through the crowd. I managed to grab my daughter who was with me and jump out of the way.\n'It missed myself and my family by literally inches.'\nDaniel Jones, 28, told The Sun: 'A lot of people were evidently really angry. They were smashing [the car] up. Police were trying to restrain them. The back of the window was completely smashed. They were ripping the register plate off.'\nSir Keir Starmer said last night: 'The scenes in Liverpool are appalling — my thoughts are with all those injured or affected. I want to thank the police and emergency services for their swift and ongoing response to this shocking incident.'\nThis morning, he added: 'Scenes of joy turned to utter horror and devastation, and my thoughts and the thoughts of the whole country are with all of those that are affected, those injured, which of course includes children, their families, their friends, the whole community, Liverpool fans everywhere.\n'Liverpool stands together and the whole country stands with Liverpool. I'd like to thank the first responders who did a fantastic job last night and continue to do so.\n'There's now an ongoing investigation. I'm being kept updated, talking frequently to the mayor Steve Rotheram. But as I say, my thoughts and the thoughts of the whole country will be with everybody in Liverpool today.'\nHome Secretary Yvette Cooper was also said to have been kept fully briefed as the investigation unfolded.\nRestaurants along Water Street opened their doors to help those affected. Paddy Edrich, a reporter from the Liverpool Post, wrote on X: 'People inside Riva are being treated by paramedics.\nSome have bandages around their heads and limbs. Staff in the restaurant appear to be providing fluids to those being treated and the emergency services.'\nLiverpool FC issued a statement, saying: 'We are in direct contact with Merseyside Police regarding the incident on Water Street which happened towards the end of the trophy parade earlier this evening. Our thoughts and prayers are with those who have been affected by this serious incident.'\nFormer Liverpool stars Jamie Carragher and Robbie Fowler expressed their sorrow online. Carragher wrote: 'Devastating end to the day... just pray everyone is ok', while Fowler posted: 'Heartbreaking news... absolutely sickened with what's happened here in Liverpool.'\nThe Premier League sent its 'heartfelt thoughts' to all those 'injured and affected' by the incident.\nThe horrific scenes marred what had been an afternoon of jubilant celebrations, as fans packed the parade route, which began at Allerton Maze and made its way through the city with players including Mohamed Salah and Virgil van Dijk waving from an open-top bus.\nDespite earlier showers, fans lined the route in their thousands, waving flags, setting off flares and chanting as the team celebrated their first title since 2020.\nAnyone with information or footage of the incident has been urged to contact Merseyside Police.\nLiverpool FC legend Kenny Dalglish, said he is 'horrified' by yesterday's incident.\n'Our anthem has never felt more appropriate, You'll Never Walk Alone,' he said. 'Your Liverpool family are behind you.'\nFormer Liverpool manager Jurgen Klopp said: 'My family and I are shocked and devastated, our thoughts and prayers are with all those who are injured and affected. 'You'll never walk alone.'",
  "word_count": 5496,
  "scraped_at": "2026-02-14T14:16:54.602194"
}