{
  "article_id": "bbab996d171f",
  "url": "https://www.eurogamer.net/eurogamers-80-most-anticipated-games-of-2025",
  "title": "Eurogamer 80 most anticipated games of 2025",
  "date": "20250106T194500Z",
  "domain": "eurogamer.net",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Eurogamer's 80 most anticipated games of 2025\nBumper crop.\nHello and Happy New Year all! As we reacquaint ourselves with our keyboards and coffee mugs, it's time to once again begin another year of video gaming - and as we look ahead to the coming 12 months, it's occurred to us that the 2025 release schedule is packed to the brim of new and exciting games coming out. So what better way to ring in the new year than by putting together a big old list of all the ones we're most pumped about?\nAdmittedly, it's a slightly shapeless-looking year at the moment. As you'll no doubt gather in a minute, very little has actually been dated much beyond March at the moment, with most games shyly clutching their general '2025' coattails until - one can only assume - a certain Rockstar-shaped behemoth has come more fully into view. Yes, 2025 will likely be a year that's very much moulded around the enormous impact crater of GTA 6, so don't be surprised if release dates slip or get announced earlier than expected as everyone does their best to dance around this inevitable attention vacuum.\nBut even with much of the year in flux at the moment, it's still looking like it's going to be one of the most exciting in quite a long time - certainly on the blockbuster front, at last, but there are also plenty of indies we're keen to play, too. Below, you'll find the 80 games we're most excited about in 2025, ordered by date for those we know about, and then alphabetically for everything that's yet to be confirmed. First, though, let's address that big hardware elephant in the room…\nSwitch 2 and its launch games\nWe still don't know what the Switch 2 is even going to be called at the moment, but whatever it is, you can bet that the console, and the potential launch games therein, are definitely going to be high up on all of our collective lists of 'Things we cannot wait to play in 2025'.\nThe arrival of a new console is always an exciting moment in the gaming calendar, especially when the Switch proper launched with one of the greatest games of the last decade, The Legend of Zelda: Breath of the Wild. While it's unlikely we'll get another Zelda alongside the Switch 2, I wouldn't be surprised if we saw a Mario game of some description, which - yep, that's definitely something I'd want to play this year. So consider this entry as one big placeholder for all the Switch 2 launch games, because whatever they end up being, you can bet we'll be chomping at the bit for them. Now, onto the games!\nHyper Light Breaker\n- Release date: 14th January 2025 (early access)\n- Platforms: PC\nDespite being the successor to Hyper Light Drifter, Breaker is shaping up to be quite a different proposition. It's 3D for starters, and is more of a co-op action roguelike than a purely singleplayer adventure. But I'm always excited by developers who are willing to tear up their own rulebooks to try something new, and I'm excited to see what strange new worlds we'll be able to hack and slash our way through in Breaker's ever-changing Overgrowth realm. - Katharine\nDonkey Kong Country Returns HD\n- Release date: 16th January 2025\n- Platforms: Nintendo Switch\nThe decision to release an HD remaster of Donkey Kong's excellent Wii platformathon might seem odd in a world where his vastly superior outing in Tropical Freeze already exists on Switch, but hey, if you're looking to kick off the new year with a smile, this isn't a half bad way to do it. Returns was a riot when it first came out 15 years ago (especially those exquisite mine cart levels), and I can't wait to revisit it in a couple of weeks. - Katharine\nBlade Chimera\n- Release date: 16th January 2025\n- Platforms: PC, Nintendo Switch\nI'll confess I didn't know much about Blade Chimera before the end of last year, but when I heard Team Ladybug had a new Metroidvania out in January, my interest was piqued immediately. Sure, Team Ladybug is perhaps better known for its sidescrolling shoot 'em ups than their Metroid-likes (see Touhou Luna Knights, Drainus etc), but I adored the studio's 2020 game Record of Lodoss War: Deedlit in Wonder Labyrinth, and Blade Chimera looks to be very much more of that - albeit set in a demon-infested, cyberpunk-infused version of Osaka than the lauded 90s anime series. - Katharine\nEnder Magnolia: Bloom in the Mist\n- Release date: 22nd January 2025\n- Platforms: PC (1.0), Nintendo Switch\nThe sequel to one of the best Metroidvanias of recent years, Ender Magnolia: Bloom in the Mist has been in early access on PC for most of the past year. Now it's coming out in full, alongside a release on Switch, and cor, this is the stuff, folks. Picking up several decades years after the events of 2021's Ender Lillies: Quietus of the Knights (which you should also play if you haven't, though it isn't required reading before playing this), Magnolia is once again all about finding and using enemy abilities to pick your way through a forlorn and mysterious fantasy world as you try and save it from total collapse. It's fantastic stuff, so if you're a fan of great Metroid-likes, make sure this one's on your radar. - Katharine\nEternal Strands\n- Release date: 28th January 2025\n- Platforms: PC, PS5, Xbox Series X/S\nIt might have an unfortunately forgettable title, but Eternal Strands - from former Dragon Age creative director Mike Laidlaw's Yellow Brick Games studio - is intriguing stuff. It's a fantasy action-RPG inspired by the likes of The Legend of Zelda: Breath of the Wild and Shadow of the Colossus, with a bit of Monster Hunter thrown in as players venture out into a cataclysm-struck \"open zone\" world - scrambling around 25-meter-high climbable creatures known as the Arks in order to secure resources needed to create new weapons and armour back at a base camp. Core to all this is the much-touted interplay between protagonist Brynn's magical abilities and the environment - its shifting temperatures and a supposedly \"next generation\" physics system - which promises \"unprecedented reactivity\". What that means in practice remains to be seen, but it has the potential to be fascinating. - Matt\nThe Stone of Madness\n- Release date: 28th January 2025\n- Platforms: PC, PS5, Xbox Series X/S, Nintendo Switch\nHaving impressed with its wonderfully moody Blasphemous series, developer The Game Kitchen is tackling something a bit different with The Stone of Madness. This Goya-inspired stealth-tactics adventure unfolds in an 18th-century Spanish Monastery - part prison, part asylum - somewhere in the Pyrenees mountains. Here, players must help five prisoners mount their escape, utilising their unique abilities across two distinct story campaigns. There's a Darkest Dungeon-style twist, however; characters have evolving traumas and phobias that can be triggered during missions, fundamentally changing how they play. And that's on top of objectives players can tackle either during the day or the supernaturally blighted (and potentially more rewarding) night. It's intriguing stuff and out very soon. - Matt\nCitizen Sleeper 2\n- Release date: 31st January 2025\n- Platforms: PC, PS5, Xbox Series S/X, Nintendo Switch\nThough slight, Citizen Sleeper is one of the most tender and heartwarming games I've played. It warms me just to think about it. A sequel, even by its very existence, would be exciting, but what makes it even more so are the leaps made in gameplay and design terms since then. As glimpsed in the demo, Citizen Sleeper 2 is a more defined RPG and a more exciting - more tense - one. This could be something great. - Bertie\nKingdom Come: Deliverance 2\n- Release date: 4th February 2025\n- Platforms: PC, PS5, Xbox Series S/X\nKingdom Come: Deliverance remains one of the most distinct role-playing games in recent years. Based in the old Czech Republic - Bohemia - and informed by historical accuracy, it presents a world as believable as history books are. There's a fictional story running through it, which brings the drama, but the allure is being in a time and place few other games have visited. I'm excited to return. - Bertie\nCivilization 7\n- Release date: 11th February 2025\n- Platforms: PC, PS5, Xbox Series X/S, Nintendo Switch\nCor, a new Civ! There's something wonderfully lavish about a brand new Civilization game. A game about all of human history, a celebration of progress and endeavour, a whacking great map to conquer. Having played a few hours of it I can tell you that up close, the new art style is an absolute treat. I can also tell you that it feels very much like a Civ game still, despite some major, predictably controversial changes to tech trees and ages. Plus, Gwendoline Christie as the new narrator reading out all those nice little quotes is inspired. Time for the return of One More Turn. - Chris\nUrban Myth Dissolution Center\n- Release date: 13th February 2025\n- Platforms: PC, PS5, Nintendo Switch\nMurder mystery fans, listen up! In this compelling anthology of occult crime cases, you play as budding detective Azami Fukurai as you work to uncover the mysteries of strange occurrences around Tokyo. I was a huge fan of developer Hakababunko's previous work, Makoto Wakaido's Case Files Trilogy from 2023, and if its exceptional Steam Next Fest demo was anything to go by, this looks to be taking its methodical foundations of gathering evidence and logical deduction work to the next level. As you try to discern fact from fiction, this will hopefully be one for crime heads as much as Japanese mythology scholars. - Katharine\nDate Everything!\n- Release date: 14th February 2025\n- Platforms: PC, PS5, Xbox Series X/S, Nintendo Switch\nEver wanted to date your fridge? No, me neither. But after watching the trailer for Date Everything! I'm now excited to woo kitchen appliances, a toilet, a nightmare, and a rubber duck this Valentine's Day, in what looks like a funny, occasionally poignant take on dating akin to something like Boyfriend Dungeon. - Jessica\nAssassin's Creed Shadows\n- Release date: 14th February 2025\n- Platforms: PC, PS5, Xbox Series X/S\nStealthy rooftop shenanigans (or loud samurai stomping) through feudal Japan? Yes please. Ubisoft's historical stabathon series finally visits the much-requested country of the shinobi, courtesy of the team behind 2018's brilliant Assassin's Creed Odyssey. After a much-discussed delay and amid turbulent times for Ubisoft itself, expectations for Shadows are through the roof. - Tom P\nTomb Raider 4-6 Remastered\n- Release date: 14th February 2025\n- Platforms: PC, PS5/PS4, Xbox Series X/S, Xbox One, Nintendo Switch\nOK, don't judge me, but I am genuinely looking forward to revisiting Angel of Darkness when Tomb Raider 4-6 Remastered releases next month. Yes, I know it is the worst reviewed Tomb Raider game, so yes I know it is Flawed with a capital F, but what can I say. I have a bit of a soft spot for Lara's double denim, Parisian parkouring antics. Along with Angel of Darkness, Tomb Raider 4-6 Remastered also includes Tomb Raider: The Last Revelation and Tomb Raider: Chronicles. As with last year's Tomb Raider 1-3 Remastered, the upcoming collection will feature improved visuals along with the option to toggle between classic and modern graphics. Pyramid scheme? For me, this is more like a pyramid dream. - Victoria\nAvowed\n- Release date: 18th February 2025\n- Platforms: PC, Xbox Series X/S\nI'm a fan of Obsidian and the Pillars of Eternity series, so I've been following this first-person take on the world of Eora closely since it was announced. But it's had a bumpy ride, struggling somewhat in its series of early gameplay trailers to convince us of its qualities. Nevertheless, there's a beautiful world here and what seem to be interesting ideas, and I would never rule a team like Obsidian out. - Bertie\nLost Records: Bloom and Rage\n- Release date: 18th February 2025 (Part 1), 18th March 2025 (Part 2)\n- Platforms: PC, PS5, Xbox Series X/S\nA brand new narrative game from the original development team behind Life is Strange 1 and 2, Lost Records looks set to recapture the same coming of age with magic realism shenanigans that won over a legion of fans previously. There's some real advancements here, too: interactive photography gameplay and smart crowd dialogue that makes this feel a generation beyond even the most recent Life is Strange effort. - Tom P\nLike a Dragon: Pirate Yakuza in Hawaii\n- Release Date: 20th February 2025\n- Platforms: PC, Xbox Series X/S, Xbox One, PS5/PS4\nWhat's better than being a pirate? How about being a pirate in Hawaii combined with all the usual Like a Dragon hilarity and mini-games thrown in? In this spin-off, Majima takes center stage and plenty of fierce battles await, but don't forget you can belt out tunes with karaoke or speed around to deliver food in Crazy Delivery if piracy starts taking its toll. - Marie\nMonster Hunter Wilds\n- Release date: 28th February 2025\n- Platforms: PC, PS5, Xbox Series X/S\nCapcom's latest and greatest Monster Hunter outing looks to be its best and most ambitious yet, and cor, every new monster and location reveal makes me want to yell out a big fat \"Soooo tasty!\" like its titular hunters do cooking a honking great slab of monster meat. Let the competition for the best dino hat and pants combo commence. - Katharine\nMorsels\n- Release date: February 2025\n- Platforms: PC, Nintendo Switch\nYou may have caught Morsels in one of Nintendo's Indie World announcements last year, and the strength of that trailer alone, with its enormous sentient noses in hoodies, ladders with eyeball stalks and demonic pigeons, was enough to immediately put it on my wishlist. A weird and wonderful roguelite where you're rotating between all manner of whimsical creatures to find your way out of the sewers, Morsels looks like an intriguingly freaky blend of Nobody Saves the World and The Binding of Isaac - which is a pretty potent combo, if you ask me. - Katharine\nTwo Point Museum\n- Release date: 4th March 2025\n- Platforms: PC, PS5, Xbox Series X/S\nTwo Point games are always a blast, made up of two parts management simulation and one part British silliness. Two Point Museum seems like yet another exceedingly good time, only this time we're trying to build a museum empire, and we now have the ability to build partition walls that I may be a bit too excited for. - Jessica\nSplit Fiction\n- Release date: 6th March 2025\n- Platforms: PC, PS5, Xbox Series X/S\nI can't wait to find out exactly what Hazelight Studios - the team behind brilliant co-op platformer It Takes Two - has come up with for Split Fiction. It's the studio's next co-op game, and it looks like it is going to be a hoot and a half. There's even promise of a dance battle with a monkey. Errm, yes please! In Split Fiction, players take on the role of either Mio or Zoe, two aspiring writers, as they jump between sci-fi and fantasy worlds. All I can say is that I hope my husband is ready for some more chaotic couch co-op shenanigans, because I will be booting this baby up day one. - Victoria\nWanderstop\n- Release date: 11th March 2025\n- Platforms: PC, PS5\nWanderstop wants you to think it's going to be a relaxing little game about running a teashop, but there's clearly more brewing here than just tea. Alta, the game's protagonist, used to work as a warrior and her past experiences are haunting her far more than she wants to admit. Though considering Wanderstop is the latest game from Davey Wreden (creator of The Stanley Parable and The Beginner's Guide) and is co-written with Karla Zimonja, most known for Gone Home, we really shouldn't be surprised if there's more to this game than meets the eye. Personally I can't wait to see how Wanderstop manages to twist the cosy game genre. - Lottie\nXenoblade Chronicles X Remastered\n- Release date: 20th March 2025\n- Platforms: Nintendo Switch\nThe black sheep of the Xenoblade Chronicles family, I honestly never thought I'd see this game outside of its Wii U beginnings. But what a thrill to be able to rediscover this strange and singular JRPG again! Its strain of sci-fi is quite a bit harder than its numbered stablemates, featuring mechs, modern cities and an intergalactic threat, but when you first step inside its enormous metal suits and discover there's a whole other layer to this impossibly large world, Xenoblade Chronicles X retains that same sense of awe and wonder that made the series so brilliant in the first place. - Katharine\nAtomfall\n- Release date: 27th March 2025\n- Platforms: PC, PS4/PS5, Xbox Series X/S, Xbox One\nInspired by the real-world events of the 1957 Windscale disaster and made by Sniper Elite studio Rebellion, Atomfall imagines what might happen five years later in a fictional village in the north of England that's trapped inside its large quarantine zone. A survival adventure game that's part Fallout, part Metro and maybe a little bit Everybody's Gone to the Rapture, Atomfall could be one of this year's most pleasant surprises. - Katharine\ninZoi\n- Release date: 28th March 2025 (early access)\n- Platforms: PC\nAs long as our PCs don't melt because of the specs required to produce its stunning visuals, inZoi seems like the best go at a competitor to The Sims yet. With Life By You now cancelled, and The Sims 4 now on its tenth year of service, it's nice to finally have a big new life sim to get stuck into. - Jessica\nFootball Manager 2025\n- Release date: March 2025\n- Platforms: PC, PS5, Xbox Series X/S, Nintendo Switch, iOS/Android\nFM25 was quite astonishingly delayed late last year, from its usual annual slot of November into March 2025. It throws up all kinds of questions - which season will player ratings be based on? What happens to FM26? Will March be the new regular slot going forward? But many of those are really moot. This is a major effort from developer Sports Interactive, moving the game from a custom engine to Unity and overhauling the entire UI in the process, upending decades of muscle memory in the process. It's a big gamble. Much like the sport itself, the one thing that's guaranteed is entertainment. - Chris\nDemonschool\n- Release date: Q1 2025\n- Platforms: PC\nA tactics RPG with a demonic, supernatural twist, this stylish strategy game has been high up on my wishlist for quite a while now. A little bit Buffy the Vampire Slayer in tone, a little bit Banner Saga in its grid-based battles, and just a dash of Persona with its school schedule character building, this game is all about a bunch of university mates travelling to strange and unearthly realms to defeat, you guessed it, hordes of horrible demon lads. Get it into my veins, stat. - Katharine\nThe Alters\n- Release date: Q1 2025\n- Platforms: PC, PS5, Xbox Series X/S\nStranded alone on a mysterious planet, Jan makes clones of himself - adjusting their memories to create different versions of what his life might have become had he chosen differently at various stages of his life - so they can all work together to survive impending doom. An interesting twist on a management sim that has you balancing the relationships between yourself has me very curious to see how The Alters turns out. - Jessica\nWhile Waiting\n- Release date: Q1 2025\n- Platforms: PC\nIs this a game about being patient? Or one about doing every conceivable fidgety thing to fill the time between one event and the next? Both roads lead to success in While Waiting, the next game from the developer behind perspective puzzler Moncage, and its Next Fest demo was such glorious fun. If it doesn't renew your sense of curiosity about the world, at least you'll have some inspiration for other possible things you could do while waiting instead of subjecting yourself to another doomscroll. - Katharine\ndespelote\n- Release date: Early 2025\n- Platforms: PC, PS4/PS5, Xbox Series X/S, Xbox One\nSurely the most Mundial Magazine football game ever made, despelote (stylised without the capital D) is a first-person, autobiographical slice-of-life game about being a football-loving kid on the streets of Ecuador, during the country's qualifiers for the 2002 World Cup. It looks joyous, personal and profound, an example of games' continuing, globalised expansion of genres and perspectives. Its wonderfully pretty art style only helps. - Chris\nDune: Awakening\n- Release date: Early 2025 on PC (consoles to follow)\n- Platforms: PC, PS5, Xbox Series S/X\nFuncom knows MMOs - I think it's easy sometimes to forget that - and it knows desert-based survival games based on big licenses, the reference obviously being Conan. This new Dune project has more going for it than being a movie tie-in, then. But these projects are big swings that depend on mass excitement to get their player base going. Will it hit? We shall see. - Bertie\nBioid\n- Release date: 7th April 2025\n- Platforms: PC\nA monochromatic adventure about a cosmic library in disarray, Bioid has made its way onto my wishlist on the strength of its visuals alone. The trailer is a mesmerizing mix of gorgeously animated worlds and creatures, and the promise of being able to visit lots of different dimensions as we follow the story of two little beings is sure to be one heck of a memorable journey. - Katharine\nFatal Fury: City of the Wolves\n- Release date: 21st April 2025\n- Platforms: PS4, PS5, Xbox Series X/S, PC\nThe first new Fatal Fury game since 1999, Fatal Fury: City of the Wolves is a direct sequel to classic fighting game Garou: Mark of the Wolves, from developer SNK. The signature, health-for-special-moves TOP system returns, now in expanded form as the SPG system, while classic characters are joined by a few newcomers as well. But the real point here is that the series' long-running boss, Yasuyuki Oda, is finally getting a chance to return to it. This is a big deal for a genre that's recently been having something of a renaissance. - Chris\nFarthest Frontier\n- Release date: Spring 2025\n- Platforms: PC (1.0)\nFarthest Frontier has strong Manor Lords vibes. This is an up-close strategy game about surviving in the American frontier lands, at a time when technology was basic and life was dirtier. There's an earthy, touchable charm that comes from it, as you gradually tame the idyllic wilderness around you and feel the icy weather or the warm summer sun that affects it. This is a game that's been honed in early access for a couple of years now, and built up a lot of goodwill. I can't wait to return to it for 1.0. - Bertie\nMoth Kubit\n- Release date: Spring 2025\n- Platforms: PC, Nintendo Switch\nBilled as an experimental RPG about the corporate life of an ordinary insect, Moth Kubit has the air of Undertale meets Knuckle Sandwich. It has an inherently fascinating setup, as Moth's newly earned promotion at work suddenly brings with it knowledge of the ominous-sounding 'Final Process', which rumour has it is meant to change everything. Is it the end of the world? Is it a homage to the Y2K bug? Whatever it is, I'm super keen to find out in this oddball bug life adventure. - Katharine\nBlue Prince\n- Release date: Spring 2025\n- Platforms: PC\nA roguelike-cum-puzzle game about house construction? Consider me intrigued. In Blue Prince, you're tasked with finding the mysterious Room 46 inside the enormous mansion of Mt Holly. Only problem is that floorplan only allows for 45 rooms, so you'll need to find shortcuts and sneaky passageways between the randomly generated rooms you're given to draft along the way. But when the floor plan resets at the end of every day, that's easier said than done. - Katharine\nRevenge of the Savage Planet\n- Release date: May 2025\n- Platforms: PC, PS5, Xbox Series X/S\nBasically a third-person redo of Journey to the Savage Planet, this pseudo sequel seems just as silly and colourful as the original - but with added co-op shenanigans and digs at Google, who the team had a nightmarish time with when under its Stadia branch. - Jessica\nVampire: The Masquerade - Bloodlines 2\n- Release date: First half of 2025\n- Platforms: PC, PS5, Xbox Series X/S\nDéjà vu. I've written about this game before in an article just like this. I imagine this is how vampires must feel doing things again and again over the course of their long lifetimes. This game has been in development for a long time. It was suspended once after mysterious goings on and then rescued by Still Wakes the Deep developer The Chinese Room, where it's now being finished for release. But the big question is, will it be worth the protracted wait? Will it live up to the legacy of the licence and of the first Bloodlines game? Has it been rescued, or has it just been salvaged for release? I remain eternally intrigued. - Bertie\nMafia: The Old Country\n- Release date: Summer 2025\n- Platforms: PC, PS5, Xbox Series X/S\nI like a video game with a clear title, and this - what looks to be a going-back-to-its-roots new chapter in the Mafia series - says it all. You're back in Sicily, the mob's original home, to discover its origins and likely whack a fair few people your new crime family says need a good whacking. - Tom P\nBaby Steps\n- Release date: 2025\n- Platforms: PC, PS5\nA walking sim isn't for everyone, and usually not for me, but Baby Steps still managed to catch my eye. The game cast players as onesie-wearing \"fail son\" Nate, a grown man who spends his days slobbing out on his parents' couch eating pizza and looking at the TV. That is, until he gets sucked away from this sedentary lifestyle and into a world without his trusty couch to support him. Now, Nate has to learn to make his way through this land full of mountains, obstacles, wildlife, muddy quagmires and more, one baby step at a time. Oh, and it also includes a \"fully dynamic onesie soilage system\", so there is that. I'm undecided on how I feel about this particular feature right now, though you can't deny it is different. - Victoria\nBig Walk\n- Release date: 2025\n- Platforms: PC\nThe next game from the team behind Untitled Goose Game, Big Walk is a game where you, and I quote \"hang out and get lost with close friends in a big world\". And presumably, go on a big walk. It looks strange, delightful and eminently mysterious, with lots of strange landmarks to discover, and nooks and crannies to poke around in. A great game to noodle about in with your mates, in other words, and I look forward to discovering its secrets later this year. - Katharine\nBorderlands 4\n- Release date: 2025\n- Platforms: PC, PS5, Xbox Series X/S\nAfter lacklustre sales of spin-off Tiny Tina's Wonderlands, a mixed response to New Tales from the Borderlands and the widespread panning of the Borderlands film, it's finally time for Gearbox's flagship franchise to prove its mettle, once and for all, with a proper new entry. Can the series recapture its heyday with a fully open world set on a fresh planet and an all-new cast? This year, we find out. - Tom P\nCattle Country\n- Release Date: 2025\n- Platforms: PC, PS5\nEssentially Red Dead Redemption meets Stardew Valley, Cattle Country could be just the right amount of adventure and action balanced with cosy comfort. From taking on bandits in train heists to simply waking up each day to water your crops and make sure your cattle are doing well, you can choose how busy or relaxed your new life is. - Marie\nClair Obscur: Expedition 33\n- Release date: 2025\n- Platforms: PC, Xbox Series X/S, PS5\nUnveiled at Gamescom last year, this turn-based RPG has a killer concept and an even better-looking combat system. The setup involves the titular expedition embarking on a do or die mission to prevent a mysterious figure known as The Paintress from threatening the last vestiges of humanity ever again, as every year she paints a cursed number on a monolith that wipes out everyone of that particular age. As you follow the trail of the 32 expeditions that tried to accomplish this feat before you, you'll battle monsters of all shapes and sizes with its reaction-based combat, fusing turn-based and real-time attacks to spectacular effect. It looks stunning and I can't wait to play it in full. - Katharine\nDeath Stranding 2: On the Beach\n- Release date: 2025\n- Platforms: PS5\nI became full-on obsessed with Death Stranding when it eventually came to PC, and even though the story is absolutely bonkers and off its rocker, I'm absolutely here for whatever Kojima Productions has cooked up for its next instalment in the life of post-apocalyptic delivery man Sam Bridges. We don't know much about it yet, but whatever it ends up being, you can pretty much guarantee that it certainly won't be boring. - Katharine\nDeadlock\n- Release date: TBC\n- Platforms: PC\nDeadlock - Valve's hero shooter that managed to entice thousands of players to join in the action, despite not actually being announced at the time - still hasn't secured itself a proper release date, but surely this year will be the year? I quite enjoyed what I played of Deadlock, even in its very early state. For those unaware, Valve's shooter also has MOBA and tower defence-inspired elements, and at times it can get a tad chaotic (although, perhaps that was more to do with me being a little out of my depth and just launching myself from building to building in a bid to survive). But, despite this sort of game not exactly being my forte, I will happily give Deadlock another bash when it gets a proper release. Like I said, I quite enjoyed it. So, just tell me when Valve. Just tell me when. - Victoria\nDoom: The Dark Ages\n- Release date: 2025\n- Platforms: Xbox Series X/S, PC, PS5\nQuite possibly the game I'm most excited about in 2025, I love a bit of Doom, me. I was half wondering where id Software's modern Doom series could go after the stupendously good Eternal, but turning back the clock and giving the Doom Slayer a serrated-edge boomerang shield, a gun that mulches skulls for bullets and a big bear-skin-like mantle? Sign me the hell up. - Katharine\nDispatch\n- Release date: 2025\n- Platforms: PC\nHot off its reveal at The Game Awards, Dispatch puts us on the other side of the superhero crime fighting machine, working as an emergency dispatch worker who's responsible for sending out other supes to deal with various crimes around the city. At the moment, it's unclear how much strategy will be involved - I wouldn't expect anything XCOM-like, for example - but given this is being made by some former Telltale folks who were behind The Wolf Among Us and Tales from the Borderlands, you can definitely count on there being lots of big decisions to make that will affect the fate of your misfit superhero squad. - Katharine\nEarthblade\n- Release date: 2025\n- Platforms: PC\nThe next game from the Celeste team might look like just another pixel platformer to sink our teeth into, but Earthblade is so much more ambitious than that. Rather than climbing a single mountain this time, Extremely OK Games has created an enormous, seamless world for us to explore this time, and it looks utterly astonishing. We don't know much more about it yet, but I can't wait to see how its mix of combat, exploration and platforming challenges come together in the final game. - Katharine\nElden Ring: Nightreign\n- Release date: 2025\n- Platforms: PC, PS5, Xbox Series X/S\nLook, if any other developer announced a co-op spin-off featuring procedurally-generated variations of the original game's world and battle royale elements, we all would have screamed that it was a cash grab. But this is the next major project to come from the masters at FromSoftware, so whether it is a cash grab or not, you know it will still be excellent. And you can still play it solo, to be clear. - Tom P\nEriksholm: The Stolen Dream\n- Release date: 2025\n- Platforms: PC, PS5, Xbox Series X/S\nFans of defunct real-time tactics peddlers Mimimi Games (RIP) might want to keep tabs on Eriksholm, a top-down stealth adventure that might scratch similar itches. The titular setting is a vast Scandinavian city in an alternate 1900s, whose inhabitants live under the tyranny of a police state. As if that wasn’t bad enough, the rozzers have jailed your brother. Featuring gorgeous environment design and some of the best performance capture since Baldur's Gate 3, Eriksholm looks polished, tense, and sharp as hell. - Jim\nFable\n- Release date: 2025\n- Platforms: PC, Xbox Series X/S\nMicrosoft's extremely British action RPG series gets rebooted for the modern era, with plenty of UK comedians and the usual amount of chicken bothering still intact. Expect the usual blend of fantasy, magic and morality-based choices, now with Super Hans from Peep Show as your mentor. - Tom P\nFoolish Mortals\n- Release date: TBC\n- Platforms: PC\nA point and click adventure inspired by games like Monkey Island and Broken Sword, Foolish Mortals drops players into the shoes of a young treasure hunter by the name of Murphy McCallan as he sets off on a \"merry\" and \"macabre\" adventure. Promising an exotic setting, eccentric characters and voodoo, this game has Victoria Kennedy written all over it. - Victoria\nGhost of Yotei\n- Release date: 2025\n- Platforms: PS5\nIf you like going phwoar while swinging your katana and galloping through fields of bending grass and grain like a particularly energised Theresa May, then boy do we have the game for you. Sucker Punch's sequel to Ghost of Tsushima has vast potential - my personal reaction to Ghost of Tsushima was thinking \"this is fun; but a sequel could be properly brilliant.\" Expect rich colours, blood splatter, a slightly fawning approach to all things Japan and a feisty, thrusting approach to melee combat. The Kurosawa comparisons with the first might've been a bit much, but I've no doubt Yotei will be an absolute blast. - Chris\nGrand Theft Auto 6\n- Release date: 2025\n- Platforms: PS5, Xbox Series X/S\nWhat is there to say? Rockstar hasn't launched a big new Grand Theft Auto game since GTA 5 arrived in 2013 for PlayStation 3 and Xbox 360. GTA 6 is the most widely-anticipated game of the decade, and all other video games are going to run away scared. Here's hoping its 2025 launch window sticks. - Tom P\nHorses\n- Release date: TBC\n- Platforms: TBC\nHorses is the next game from Santa Ragione, the studio behind the inimitable Mediterranea Inferno, Saturnalia, MirrorMoon EP and more. We played its demo back at GDC 2024 and found it magnetically sinister, but also somewhat demanding: you'll need to meet this game half way if you want to extract any real meaning from its eerie, enigmatic, and quite oppressively dark atmosphere. The only issue is, it was slated for 2024 but never quite made it, with no announcement apparent to explain why - or when we might be able to expect it. Hopefully, the answer will be some time this year. There are few if any developers out there making video games quite like this. - Chris\nHerdling\n- Release date: 2025\n- Platforms: PC, PS5, Xbox Series X/S\nI adored Okomotive's pair of FAR games, and even though Herdling isn't anything to do with navigating a giant boat-train-ship-thing across a vast and desolate landscape, there's still a trace of going on a big long journey here, only now you've got lots of large fluffy companions along for the ride as well. In this alpine expedition, you'll be travelling with your beasts to the top of a secretive and unexplored summit, and I can't wait to see what kind of vertiginous obstacles we'll have to navigate to reach our goal. - Katharine\nJudas\n- Release date: TBC\n- Platforms: PC, PS5, Xbox Series X/S\nThe much-anticipated game from Ken Levine's new studio, Ghost Story Games. Set on a disintegrating starship carrying the last remnants of humanity to a new home in the stars, Judas is about shooting and magic punching your way to an exit before you and all the other remaining survivors become literal space dust. Yes, it does sound a lot like Bioshock in space. Or, you know, just plain old System Shock 2, albeit with more philosophical elements about robots and the future of human consciousness as opposed to containing a deadly virus. Either way, I'm quietly hopeful about this, and I'm excited to see what its whole deal is if nothing else. - Katharine\nLittle Nightmares 3\n- Release date: 2025\n- Platforms: PC, PS4/PS5, Xbox Series X/S, Xbox One, Nintendo Switch\nIf you loved the original two Little Nightmares games, and all their diminutive gothic slightly Guillermo del Toro-esque horror, you're likely already keeping an eye on this threequel, whose long-awaited release was delayed last year into 2025. The big news this time around is the change of developer behind the scenes - it's being made by Dark Pictures Anthology developer Supermassive Games - but after a couple of preview sessions with the game I couldn't tell the difference, which is praise indeed. - Tom P\nMarvel 1943: Rise of Hydra\n- Release date: 2025\n- Platforms: PC, PS5, Xbox Series X/S\nIf there's one thing that could possibly break my enduring Marvel fatigue, it's a Marvel game being headed up by Amy Hennig. There's still precious little we've heard about what Rise of Hydra involves more generally, other than that it will involve an uneasy and curmudgeonly alliance between Captain America and Black Panther as they work to take down Marvel's classic big bad organisation in Occupied Paris. But it certainly looks the part of a big, shiny blockbuster, and will hopefully be a lot more fun to play than sitting through this year's onslaught of Marvel films and TV shows. - Katharine\nMetal Gear Solid Delta: Snake Eater\n- Release date: TBC\n- Platforms: PC, PS5, Xbox Series X/S\nSnake Eater entered such deep cover last year that it full on missed its original 2024 release window, but here's hoping Konami's spruced up remake of 2004's seminal Metal Gear Solid 3 finally emerges from its camo suit sometime this year. After 2023's somewhat disappointing Master Collection version, this will hopefully be the best way to experience the origin story of Naked Snake and The Boss on modern systems. - Katharine\nMetroid Prime 4: Beyond\n- Release date: 2025\n- Platforms: Nintendo Switch\nI cannot quite believe we're now living in the year that Metroid Prime 4 finally releases. After decades of waiting, a full game reboot and years of silence, Nintendo is at last set to treat us all to a new first-person Metroid game from the team behind the original trilogy, Retro Studios. Oh, and it looks stunning to boot. This would sure make a snazzy Switch 2 launch title... - Tom P\nMiss Mulligatawney's School for Promising Girls\n- Release date: TBC\n- Platforms: PC\nInkle's latest may have a name that I'm almost certainly going to get wrong on multiple occasions, but even though the studio has said next to nothing about it so far (even its screenshots don't give much away!), you know it's probably going to be a grand old ride all the same. I'll be putting in my application forthwith. - Katharine\nMoonlighter 2: The Endless Vault\n- Release date: 2025\n- Platforms: PC, PS5, Xbox Series X/S\nThe first Moonlighter was a surprising delight of a game, marrying Zelda-esque dungeoneering with canny shopkeeping. Now, developer Digital Sun is returning to it once again, giving us a gorgeous new 3D isometric world to bomb around in, and even more delicious loot to plunder on its eponymous vault. While much about its general rhythms will likely remain the same, the land of Tresna looks like an absolutely stunning place to do it all again in. - Katharine\nNirvana Noir\n- Release date: 2025\n- Platforms: PC, Xbox Series X/S\nA sequel to the fascinating jazz odyssey that was Genesis Noir, Nirvana Noir adds one change in particular: a big ol' splash of colour. It's a mystery about the Big Bang, playing out in two realities - one where it never happened. Expect environmental puzzles, old-timey noir trappings (trenchcoat anyone?) and some of the most sumptuous, expressive visual design in video games. - Chris\nNivalis\n- Release date: 2025\n- Platforms: PC\nThe best post-release update to 2020's Cloudpunk, the acclaimed hovercar sim where you played a far-future Evri driver pootling around in a vast voxel-tropilis, was the one that added a first-person camera. Being able to properly explore the rain-slick world of Nivalis walking sim-style added a visceral edge to the experience that enriched the whole thing. In this sort-of sequel, developer Ion Lands is doubling down on that aspect by giving us an immersive life-sim that focuses on, well, living. If they pull it off, it could rival Night City. - Jim\nOpus: Prism Peak\n- Release date: 2025\n- Platforms: PC\nSigono's Opus series is probably one of gaming's best kept secrets. An anthology of standalone, but loosely connected sci-fi tales that all share a common thread of hope and optimism for the future, these heartfelt narrative adventures have all been absolutely stellar (seriously, go and check out Opus: Echo of Starsong if you want to find out more - it was one of my favourite games from 2021!). The studio's latest, Prism Peak, sees you play as a photographer lost in a strange, dreamlike realm where your photos hold the key to discovering its mysteries. If you enjoyed the laidback ramblings of Season: A Letter to the Future, there's a very strong chance this will be right up your street. - Katharine\nParalives\n- Release date: 2025 (early access)\n- Platforms: PC\nFive years after Paralives' eye-catching unveiling set The Sims fans' hearts racing, the promising social sim is finally getting an early access release later this year. At a basic level, Paralives ticks the same boxes as EA's juggernaut franchise, but it's also looking to put its own distinctive stamp on the familiar formula. Developer Paralives Studio has already shown off everything from meticulous customisation options to flexible personality features and eclectic relationship types, with a robust range of \"core\" features promised for its early access launch. Better still, a detailed development roadmap is already pointing to a bright (and mercifully DLC-free) future. - Matt\nPokémon Legends: Z-A\n- Release date: 2025\n- Platforms: Nintendo Switch\nWhile I love Pokémon, I will be the first to admit that even when Game Freak does try to change it, the studio's still married to the 'Eight Gym Leaders, Evil Team and Pokémon League' formula. It's why I fell in love with Pokémon Legends: Arceus so quickly - it kept everything I loved about the series, while also changing it in an interesting way. (Plus the whole plotline about being sent back in time by Arceus, also known as Pokémon god, was wonderfully mad.) It's also why I'm so excited to see what Pokémon Legends: Z-A has in store for us (even if the game's name is awful). Set entirely within Lumiose City, Legends: Z-A returns to the Kalos region and I'm looking forward to seeing how the gameplay established in Legends: Arceus has been developed. Hopefully there will be some more time travel or dimension jumping nonsense happening too. - Lottie\nPromise Mascot Agency\n- Release date: 2025\n- Platforms: PC, PS5, Xbox Series X/S, Nintendo Switch\nThe next game from the Paradise Killer dev, Promise Mascot Agency is all about a disgraced yakuza lieutenant trying to reverse the fortunes of a bankrupt mascot agency. Only these aren't the cute and cuddly Japanese mascots you might be familiar with already. These are severed fingers, depressed tofu blocks, cutthroat salary man cats and songbirds who'll have your head if they're interrupted. It looks utterly bonkers, but I love its madcap energy and its intriguing-sounding blend of business management and open world storytelling. - Katharine\nRatatan\n- Release date: 2025\n- Platforms: PC\nRatatan is the new (and equally alliterative) rhythm action game from the makers of PSP-darling Patapon. While in many respects it can be seen as something of a spiritual sequel to that game (you're still guiding armies of tiny creatures to attack ever-larger boss monsters, after all), it's also got a big focus on online co-op play, and a strong roguelike element to it as well, which should hopefully make it feel fresh and exciting to long-term fans. It's had a hugely successful Kickstarter to help get it made, and it's now due for release later this year. - Katharine\nReplaced\n- Release date: 2025\n- Platforms: PC, Xbox Series X/S\nI've been looking forward to this stunning action platformer ever since its first explosive trailer rocketed onto the scene at Microsoft's E3 showcase in 2021. Mostly because of its gorgeous visuals, which remains some of the most exquisite pixel art I think I've ever seen. But I'm also intrigued by its premise, as you play an AI trapped inside a human body who must… well, it's not quite clear yet. There will be mysteries to solve, outlaw gangs to befriend/dismantle (possibly), but I'm desperate to find out more about it. - Katharine\nSlay the Spire 2\n- Release date: 2025 (early access)\n- Platforms: PC\nI squealed when I heard there would be a Slay the Spire sequel. For all its diminutive stature, this game is a colossus. It popularised the deck-building roguelike genre. A sequel is a big deal. But how do you top an idea like that? The answer seems to be that you don't - you build upon it. You brush up the iconically rubbish visuals a bit, you introduce new classes, and you tinker here and there, but you don't spoil the stew. I'm equal parts terrified it won't work and giddy at the prospect it will. Either way, I can't wait. - Bertie\nSouth of Midnight\n- Release date: 2025\n- Platforms: PC, Xbox Series X/S\nThis third-person action-adventure game comes courtesy of We Happy Few developer Compulsion Games, and visually it looks absolutely stunning. South of Midnight is set in an alternate version of the American Deep South, with players taking on the role of Weaver Hazel. It boasts magic-infused combat, a stop-motion aesthetic and an array of colourful characters including the Blues singing Shakin' Bones. I can't wait to see more. - Victoria\nStage Fright\n- Release date: TBC\n- Platforms: PC, PS5, Xbox Series X/S, Nintendo Switch\nOf the two split-screen co-op adventures announced at The Game Awards in December, it was Stage Fright that really captured my attention. Made by the Overcooked team, this looks absolutely delightful (and with some lovely voice work in its reveal trailer to boot). From the looks of things, you and a pal will be working across different dimensions to solve puzzles and find a way home - and hopefully not throw knives and onions at each other in the process. Very excited for this one. - Katharine\nStar Birds\n- Release date: 2025\n- Platforms: PC\nI fell down a huge Dorfromantik hole in 2022, and Star Birds is Toukana Interactive's next cheerful puzzle game. Part base building, part resource management, you'll be colonising all kinds of colourful planets and asteroids in Star Birds, helping your feathery friends eke out a jolly little existence among the stars. It's also being made in conjunction with the German science channel/animation studio Kurzgesagt - In A Nutshell, lending a slightly more technical edge to its colourful visuals. - Katharine\nSubnautica 2\n- Release date: 2025 (early access)\n- Platforms: PC\nSubnautica is a game that's both beautiful and terrifying in equal measure - your curiosity to find new, peculiar discoveries in its watery depths tempt you ever further beneath the waves, but then something horrible moves in the shadows - was it a pincer? A tentacle? A large, glowing eyeball and sharp teeth? - and nope, get me out of here this instant. But like a sea snail caught in the intoxicating lure of an angler fish, I cannot help but feel compelled to do it all again in Subnautica 2, especially now I'll be able to rope a friend along for the ride as well. - Katharine\nTanuki: Pon's Summer\n- Release date: 2025\n- Platforms: PC, Xbox Series X/S\nThe next game from the creator of Cursed to Golf, Tanuki: Pon's Summer asks, \"What if your tanuki postman in a rural Japanese village was also Tony Hawk on a bike?\" It's a slightly mad mash-up, but one that absolutely works when you see it in motion. Of course I want to play this game. How could I not? Especially when there's a festival to prepare for at the same time, too, where you'll be using your hard-earned wages to fix up a shrine for this special occasion. Yes please and thank you to everything about this. - Katharine\nThe Mermaid Mask\n- Release date: 2025\n- Platforms: PC, PS4/PS5, Xbox Series X/S, Xbox One\nFormally known as The Mermaid's Tongue, SFB Games' latest Detective Grimoire game is a must-play for anyone who enjoyed 2019's brilliant Tangle Tower. This time, you're solving the murder of Captain Magnus aboard a mysterious submarine, who's been found inside a locked room with an ancient stone cauldron that's never been opened before - until now. The crew say it's a terrible (night for a) curse at work here, but the truth is likely to be far, far stranger. - Katharine\nThe Outer Worlds 2\n- Release date: 2025\n- Platforms: PC, PS5, Xbox Series X/S\nSequels like this always excite me because they afford the chance to nail a vision you might not have quite nailed the first time around. The Outer Worlds set everything up: it introduced this tongue-in-cheek, Fallout-in-space-like idea to the world and we had fun with it. It was decent. But now, with an established foundation there, and bags of fan feedback to rifle through, there's the chance to build upon it and hone the formula. The debut trailer looked like a deliriously good time. I've got high hopes for this. - Bertie\nWuchang: Fallen Feathers\n- Release date: 2025\n- Platforms: PC, PS5, Xbox Series X/S\nI know for a fact that I'm almost certainly going to be terrible at playing Wuchang: Fallen Feathers, but hot damn if its stylish and flashy combat doesn't look intensely enticing all the same? Giving Final Fantasy 16 a run for its money in terms of visual flair, this Soulslike action RPG will take us to Ming Dynasty China as the eponymous pirate seeks to purge the land of Shu of a deadly plague. Will I make it past the first horrible boss monster? Debatable. But I'm sure as heck excited to give it a try. - Katharine\nPhew! That's your lot for our 80 most anticipated games of 2025 - or at least the ones we know about so far, of course. As the year goes on, there will be countless more games announced we couldn't even fathom at this stage in the year, not to mention many more in early access that may or may not get surprise 1.0 releases this year. Games like Hades 2, Manor Lords, and Path of Exile 2, to name just a couple. We're looking forward to seeing how all those develop over the coming months as well. Needless to say, it's going to be a big year!\nAnd if we've missed anything that you're personally pumped for in 2025, do shout about it in the comments.",
  "word_count": 8785,
  "scraped_at": "2026-02-14T12:43:19.154937"
}