{
  "article_id": "bbe76712ea35",
  "url": "https://www.smh.com.au/sport/soccer/playing-with-ronaldo-at-a-saudi-arabian-club-with-300-million-worth-of-talent-20240903-p5k7jt.html",
  "title": "Saudi Arabia soccer 2024 : Al - Nassr star Ronaldo a teammate of Australia Aziz Behich",
  "date": "20241111T093000Z",
  "domain": "smh.com.au",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "This was published 1 year ago\n‘So many off-field issues’: Life at one of Saudi Arabia’s richest clubs\nBy Vince Rugari\nIt was an offer Aziz Behich couldn’t refuse. And nor could his club, Melbourne City, who reportedly received a $2 million fee for allowing the veteran Socceroo to go on loan for the final six months of last season, play alongside Cristiano Ronaldo at Al-Nassr and get a first-hand glimpse of Saudi Arabia’s ongoing football revolution.\nJust being in the same squad as Ronaldo, Behich figured, was a once-in-a-lifetime opportunity. Then he walked into the club’s training facility and spotted where his locker was.\n“We were together in the change room, right next to each other,” he says. “So that was a bit of a funny first day.”\nContrary to some views of the 39-year-old Portuguese superstar, it turns out he’s a good bloke when you get to know him, as Behich did.\n“We had a few things in common, other than football – you don’t always want to speak about football,” he says. “His mother had had cancer. My wife battled cancer as well. Just little stuff like that. I love my combat sports, like UFC, boxing. He loves that a lot – so he’d come in and [Alex] Volkanovski or someone is fighting, and he’s like, ‘You see the Aussie guy?’ And he had good banter, to be fair, loved to joke around the change room and that.\n“But when it was down to business, it had to be perfect. Everything had to be 100 per cent.”\nWhen Ronaldo moved to Saudi Arabia in January 2023, it heralded a new era for soccer in the region – and across the world. Al-Nassr was one of four clubs taken over by the Saudi Public Investment Fund, who provided them all with a massive budget to spend on players.\nAnd they went big.\nSeemingly out of nowhere, the oil-rich kingdom became an instant destination for not just players in their twilight, like Ronaldo, but those in their prime, too. Others in the change room with Behich and Ronaldo at Al-Nassr included Marcelo Brozovic, Sadio Mané and Aymeric Laporte, all seduced by the monstrous salaries on offer. According to soccer website transfermarket.com the club currently has more than $310,00,000 (€190,571,273) worth of playing talent on their books.\nElsewhere in the Saudi Pro League this season are players like Riyad Mahrez, Ivan Toney, Roberto Firmino (Al-Ahli), Neymar, Aleksandar Mitrović, João Cancelo (Al-Hilal), Karim Benzema and N’Golo Kante (Al-Ittihad), among many, many more.\nBut make no mistake: Ronaldo is very much the centre of this particular universe. Everything still revolves around him, for good and for bad.\n“Day-to-day life, he probably can’t go out. A normal footballer probably could,” Behich said.\n“You’d rock up to the training ground, and every day there’ll be just rows of people waiting outside the training ground, even if it’s nine in the morning. And that was constant, every single day. It didn’t matter how hot it was. I had a driver at the time, and we just laughed every morning because it’d be about 35 degrees already, and they’re just out there waiting with jerseys and waiting for him, just hoping that they see him.\n“The impact he’s made is massive. There were times where he was suspended or injured and didn’t play, and the stadium wouldn’t be full - and then he’d be back the next game, and it’d be a sell-out.”\nIt’s not just foreign players who are moving to Saudi Arabia. Almost the entirety of Al-Nassr’s technical staff are also imports – from Stefano Pioli, their Italian coach, to the former Real Madrid star Fernando Hierro, their sporting director, all the way down to their physio and head doctor, who are Spanish and Portuguese. All of them have worked at higher-end clubs in Europe, bringing expertise and knowledge that further enhanced their operations.\n“People around the club make sure that you’re looked after, so you can just focus on football,” Behich said. “Obviously, I was lucky and privileged enough that I was at probably the biggest club there, so think it’s a bit different to some other players’ experiences there.”\nThe other side of the coin\nAt the bottom of the Saudi Pro League’s food chain is another Socceroo, Craig Goodwin, who plays for Al-Wehda, a smaller club based in Mecca. Goodwin first played there in 2019 – before the PIF-supported recruitment drive – and then returned for a second stint last year.\nWhat he sees, from his perspective, is a league awash with cash that is not always spent in the right ways.\nFor instance, Goodwin rates Al-Wehda’s facilities as worse than those of his former club, Adelaide United, whose training ground would probably rank towards the lower end of the A-League.\n“For some of the smaller clubs, I still think there’s a long way to go in terms of organisation and structure and just the foundations, in terms of facilities and everything like that,” he said.\n“The top four or five clubs – Al-Nassr, Al-Hilal, all of these teams, they have very good facilities, resources and everything at their disposal, whereas some of the smaller clubs, including mine ... probably a lot of the money that they spend on players at times should be used, or could be used for infrastructure.”\nMoney can’t buy everything\nOff the field, life in Saudi Arabia can be incredibly confronting. The biggest issue faced by foreign players and their families is the most obvious one: the heat.\nThe SPL season begins in July, and in Riyadh at that time, the average temperature is 43.4 degrees. It gets better over winter (towards the end of the year) when temperatures range somewhere between 20 and 30 degrees. But when it’s hot, it’s hot – even when kick-off times are pushed to late at night, around 10pm, to try and escape the worst of it.\nAt the peak of summer, match quality tends to deteriorate as a result; games become much more stretched and transitional, and due to the extra stoppages in play for drinks breaks, added time at the end can range from 15 to 20 minutes.\nMost foreigners live in large, highly secure compounds designed for Westerners; the one housing the Goodwins has around 250 houses or villas, and he describes it as being akin to a huge resort. Inside, there are cafes, restaurants, swimming pools, gyms, social clubs and plenty of activities for young children. While things like dress codes are relaxed inside the compound, other social restrictions do apply; single men, as an example, will be blocked by security from bringing single women in.\nIt’s better than it used to be, though. Until 2018, women in Saudi Arabia were forbidden from driving. A long-standing ban on cinemas was also lifted in the same year.\n“It works in a completely different way to anywhere else in the world,” Goodwin said. “There’s so many off-the-field issues, so many little things that we’d need a whole day to sit here and talk about them.”\nNot all good news for Saudi national team\nOne of the unintended consequences of the SPL’s financial revolution is the impact it is having on Saudi Arabia’s national men’s team. Each club is now allowed to sign up to 10 foreigners; not so long ago, they were restricted to four, with an additional player from another AFC nation.\nIt has lifted the overall level of the competition - one which was, already, close to the best in Asia.\n“What’s happening now is, let’s say the big players that were there previously when I was there [in 2019] are now filtering into the other teams,” said Goodwin.\n“They’re still very, very high-quality players, but they’re not necessarily playing for your top teams because the top teams are going for big names, high-profile players from Europe or South America. And I think the standard is much, much better ... it’s gone to a complete other level.”\nBut it has come at a cost: the national team. The Green Falcons, as they are known, remain one of Asia’s perennial powerhouses, but they have been playing beneath themselves.\nThe influx of foreign talent has pushed many Saudi stars out of their team’s starting XI. According to the CIES Football Observatory, the SPL is now ranked 10th in the world for giving the highest percentage of match minutes (58.3 per cent) to expatriates – and as a result, their best players are turning up for international duty short of a gallop.\nMeanwhile, AFC rivals Japan (17.3 per cent), South Korea (18.2) and even Australia (32) are at the other end of the spectrum.\n“There are too many foreigners in the league,” said then-Saudi Arabia coach Roberto Mancini this year.\nMancini was sacked last month and replaced with Herve Renard, the hero who masterminded Saudi Arabia’s upset over eventual champions Argentina at the 2022 World Cup. The early signs from their 0-0 draw with the Socceroos on Thursday night suggest his return could spark the Green Falcons back into form ahead of what looms as a battle for direct qualification for the 2026 tournament between the two nations.",
  "word_count": 1529,
  "scraped_at": "2026-02-14T12:18:33.700062"
}