{
  "article_id": "bbf3d289c1c3",
  "url": "https://www.caughtoffside.com/2023/09/02/exclusive-fabrizio-romano-names-his-top-5-signings-of-the-summer-transfer-window/",
  "title": "Exclusive : Fabrizio Romano names his Top 5 signings of the summer transfer window",
  "date": "20230902T130000Z",
  "domain": "caughtoffside.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "If it were possible, the summer transfer window was wilder than anyone could’ve imagined due in no small part to the Saudi Pro League hoovering up European Football talent, with transfer guru, Fabrizio Romano, across every deal from start to finish.\nThe notion that Romano never sleeps has become something of a talking point of late, with his social media alive with transfer buzz at all hours of the day and night.\nThere’s a reason he has over 18m followers on Twitter alone, and in order to not let down any of his fans, Romano clearly does his best to deliver the news first, fastest and most accurately than any other sporting outlet.\nTo watch him in action is to see a master at work, and it’s no wonder that certain players apparently use him as a conduit to help get a move from their current club.\n? Deadline Day Special ?@GaryLineker, @AlanShearer & @MicahRichards are joined by @FabrizioRomano on #DeadlineDay ??\n? The transfer that changed his life\n? Players sliding into his DMs\n? Stopping 5-a-side for an exclusive\n? Dreaming of random transfers\n? The team he… pic.twitter.com/frLWTjvG82— The Rest Is Football (@RestIsFootball) September 1, 2023\nAs a journalist who makes his living from the football transfer market, Romano’s top five summer transfers should be of interest to all.\n‘Jude Bellingham to Real Madrid. I think he’s an incredible addition for Real Madrid, a fantastic player. They paid big money yes, but he’s a player for the present and future, and his impact on La Liga has been insane,’ he wrote in his exclusive CaughtOffside Substack.\n‘[…] Moises Caicedo to Chelsea. I love the deal because the battle with Liverpool was an unbelievable 48 hours.\n‘[…] Congrats to Liverpool because in position number three I’ve included Dominic Szoboszlai from RB Leipzig. For Liverpool it wasn’t an easy negotiation, but they have a top talent, an underrated player who can bring goals, assists, creativity and quality.\n‘[…] Position number four, Josko Gvardiol to Manchester City. This is a top centre-back, making history because he’s the most expensive centre-back in the history of the game […] I see him bringing a lot of leadership next to players like Ruben Diaz and John Stones, and he’s a player who has incredible potential.\n‘[…] I also wanted to mention a women’s football transfer because it’s about Ona Battle joining Barcelona from Manchester United. The best right-back probably in the league and one of the most essential players in the United team. This is a very important move.’\nIt’s unlikely that there’ll be too many arguments with his choices, although Declan Rice from West Ham to Arsenal is one glaring omission from Romano’s list.\nThe beauty of opinions on football is that they’re there to be debated and football fans will surely delight in doing so after learning of the transfer guru’s choices.",
  "word_count": 481,
  "scraped_at": "2026-02-14T13:09:55.647964"
}