{
  "article_id": "bc3603a2b9ee",
  "url": "https://www.irishtimes.com/ireland/social-affairs/2023/06/11/tribunal-of-inquiry-into-defence-forces-needed-insists-women-of-honour-group/",
  "title": "Tribunal of inquiry into Defence Forces needed , insists Women of Honour group",
  "date": "20230611T230000Z",
  "domain": "irishtimes.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "The statutory inquiry into the Defence Forces proposed by the Government is too limited, and a full tribunal of inquiry is required rather than a “knee-jerk” response in “the current climate”, the Women of Honour group has insisted.\nIn advance of meetings with Taoiseach Leo Varadkar and Tánaiste Micheál Martin on Monday at Government Buildings, the group, the first to raise allegations of sexual attacks and a range of abuses in the Defence Forces, has published its own proposed terms of reference.\nHowever, it has insisted only a full tribunal of inquiry, concluding with a published report after a holistic examination of the Defence Forces, will be successful in “overhauling” the military. It says such a process would take time and would be costly, but no other form of statutory inquiry would be able to make the recommendations needed for the deep reforms required.\n“In simple terms, the terms of reference need to look at all the football pitch,” the Women of Honour group said in a statement issued on Sunday in advance of their meeting with Mr Varadkar and Mr Martin on Monday. “If, as proposed by the Government, in any match we only look at what happens inside the centre circle, it would be a pointless exercise. Everything on the pitch needs to be looked at.”\nREAD MORE\nThe group, whose members have been in the Defence Forces, believes the Department of Defence has “overly influenced the proposed terms of reference” of the statutory inquiry process set out by the Government. It says “as many people as possible” should be able to come forward and be afforded “a chance to have their situation examined”.\n“The Department of Defence needs to be investigated by a tribunal of inquiry, and have no place deciding on the terms of reference,” the group added.\nIn reply to queries from The Irish Times, the Department of Defence said the Government was “committed to establishing a statutory inquiry to investigate whether there have been serious systemic failures in dealing with individual complaints”. It added the Tánaiste “has had a number of meetings with key stakeholders, including the Women of Honour group”, where draft proposed terms of reference for a statutory inquiry were shared.\n“Stakeholders were invited to revert with their observations for consideration in preparing the terms of reference,” the reply said, adding the meeting between the Taoiseach and Tánaiste with the Women of Honour group was part of the ongoing “engagement with stakeholders” process. Comment on those remarks was awaited from the Department of An Taoiseach.\nAllegations of sexual attacks within the Defence Forces, and their covering-up, have been to the fore in recent public debate after the damning findings of the Independent Review Group (IRG), established by the Government in the wake of initial allegations from Women of Honour. The IRG’s report was published earlier this year and outlined a range of sexual and physical abuse as well as a widespread abuse of power in the hierarchical Defence Forces structure.\nHowever, Women of Honour says the issues facing the military are much broader. These include discrimination and the obstruction of progress in the careers of Defence Forces members targeted by more senior personnel. It believes a much wider range of “abuses” should be investigated by a tribunal of inquiry.\nWomen of Honour\nIn this episode, Róisín Ingle meets two members of the WOH group, retired company quartermaster Sgt Karina Molloy and retired army captain Diane Byrne. They speak about their own experiences of bullying and abuse within the military.\nThese include emotional abuse, discrimination, nepotism, favouritism, career obstruction, passive aggression, bullying, harassment, gender-related conduct, physical torture, sexual harassment, any form of sexual misconduct or crimes up to and including rape, physical assault, acts of indignity, acts of inequality, intimidation.\nIt also says any interaction between, on the one hand, the Defence Forces and Department of Defence with, on the other hand, the Garda or other agencies including the Minister for Defence and Defence Force Ombudsman on the issue of sexual allegations, should be investigated.\nOverall, it wants every oversight, investigative or disciplinary mechanism to be investigated to establish whether it did not carry out its function or was abused, including by those with power, to safeguard their own positions or the positions of others.\nA tribunal of inquiry should also examine “breaches of health and safety within the Defence Forces inclusive of air accidents, hazardous chemicals”. It believes a tribunal should “sit within 12 months of its establishment to receive applications from any complainant who wishes to have personal circumstances relating to a health and safety breach so investigated”.",
  "word_count": 767,
  "scraped_at": "2026-02-14T12:00:34.032421"
}