{
  "article_id": "bc64ff9f68e6",
  "url": "https://www.the42.ie/ireland-wnt-job-6571318-Dec2024/",
  "title": "Six candidates the FAI should talk to for Ireland WNT job",
  "date": "20241213T210000Z",
  "domain": "the42.ie",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "THE SEARCH IS underway for the next Ireland WNT head coach following Eileen Gleeson’s departure.\nThe FAI announced that Gleeson’s contract would not be renewed on Wednesday night, and that the process to recruit her successor would begin immediately.\nIt’s exactly 10 weeks until Ireland begin their 2025 Nations League campaign against Turkey on 21 February. The Irish Examiner is reporting that U19 manager Dave Connell could take interim charge, while other names like Hope Powell and Colin Healy are already being linked.\nMany of the same runners and riders from after Vera Pauw’s exit in August 2023 will re-enter the frame, as a crucial appointment awaits.\nIreland will be in direct competition with Scotland following Pedro Martínez Losa’s exit this morning.\nHere, The 42 takes a look at some candidates the FAI should at least talk to.\nIt’s more of an alternative list: not necessarily the top names being linked, but coaches who might be available, willing, and have the CV and experience to succeed. The FAI’s financial constraints will obviously play a part in the process, so we have tried to keep that in mind also.\nThere are many more, but here’s six for a start:\n1. Carla Ward\nThe former Aston Villa boss has been out of football since May, when she stepped down from the helm of the WSL outfit to prioritise her family life.\nWard recently told BBC Sport she was ready to return to management, and that international football would suit her as a mother to five-year-old Harvey. “In the last month or so, I’ve started to get an itch and that burning passion hasn’t gone away,” she said.\nWard, 40, spent three years at the Villa helm; steering them to their best-ever league finish of fifth in 2022/23, along with the FA Cup semi-final. The former Sheffield United captain also managed the Blades and Birmingham City before taking charge of Villa, where she was a popular figure and recruited well. That job reopened this week, while she likely has other options elsewhere.\n2. Mark Parsons\nParsons was most recently head coach of Portland Thorns in the NWSL for the second time. The 38-year-old Englishman started his career at Chelsea’s Boys Academy before steering the Blues’ Women’s Reserves to a treble in his first season in charge.\nHe then held various roles in America before taking over Washington Spirit in 2013. He oversaw a turnaround there, and later, at Portland, where he won one NWSL Championship, two Shields and made the playoffs in each of his five seasons.\nParsons also has international experience with the Netherlands, where he succeeded Sarina Wiegman at the helm but departed after a short spell when the defending champions exited Euro 2022 at the quarter-final stage.\nMartina Voss-Tecklenburg is another available name from the international circuit, but the former Germany boss is a more obvious candidate.\n3. Melissa Phillips\nPhillips is currently Head of Analysis at Arsenal Women, but the American coach might fancy a return to management.\nHaving cut her teeth Stateside, Phillips made her impact felt at English Championship outfit London City Lionesses. She began as Lisa Fallon’s assistant in 2020, but took over when the Dubliner departed.\nWith several Irish players in the team, Phillips guided them to sixth and second-place finishes respectively, but surprisingly resigned in January 2023. London City were top of the table at that juncture, but Phillips returned to the US to become Angel City assistant coach. The 37-year-old later managed Brighton & Hove Albion to safety in the WSL relegation battle.\n4. Alan Mahon\nMahon left Manchester City Women after almost a decade during the summer.\n“As sad as I am to leave City, I am also excited and inspired for the future,” the former Ireland international said as he departed. “I am looking forward to what lies ahead for me and sharing my experience and passion in pastures new.”\nMahon was heavily linked with the Ireland job before Gleeson’s appointment, and undoubtedly will be again. The Dubliner has garnered huge experience through roles at underage and senior level at City, including assistant coach and interim manager in 2020.\n5. Becki Tweed\nTweed is another exciting young coach and is available, having just exited Angel City in the NWSL.\nThe former England underage international has spent her entire coaching career in America, having started as assistant at Monmouth Hawks and Sky Blue FC, now NJ/NY Gotham. Tweed enjoyed success as co-head coach of the Gotham Reserves, before her Angel City journey began in 2023. There, she went from assistant to interim to permanent, reached the NWSL playoffs and was nominated for Coach of the Year.\nWhile a more left-field candidate, Tweed also has underage international experience, having acted as assistant coach of the USA Women U20s.\nRita Guarino could be another from the club scene, having recently managed Inter Milan and Juventus, and previously, Italy U17s.\n6. Casey Stoney\nAdmittedly, Stoney would be more of an outside shot. Her profile and stature in the game would likely mean she’s out of reach for the cash-strapped FAI, and put simply, this would be an incredible coup.\nStoney has been widely suggested for the Arsenal Women’s post since Jonas Eidevall’s departure, but interim manager Renée Slegers has been doing a fine job since taking the reins. She has been linked with other roles, including Tony Gustavsson’s successor in Australia.\nFormer England international Stoney made her managerial name at Manchester United, where she impressively steered their newly-formed women’s team through the ranks. She stepped down in 2021 and went on to establish San Diego Wave in the NWSL. She departed in June, and has been out of work since.",
  "word_count": 945,
  "scraped_at": "2026-02-14T12:23:01.462924"
}