{
  "article_id": "bc7ebd77818b",
  "url": "https://www.90min.com/features/4-england-players-point-to-prove-ahead-of-euro-2025",
  "title": "4 England players with a point to prove ahead of Euro 2025",
  "date": "20250225T041500Z",
  "domain": "90min.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "4 England players with a point to prove ahead of Euro 2025\n- Euro 2025 in Switzerland is now a matter of months away\n- England have a lot of work to do before opening match against France\n- A number of players in the squad still have a point to prove\nThe countdown is on for the Euros as the first international window of 2025 is now in full swing.\nEngland kicked off their Nations League campaign with a frustrating 1-1 draw against Portugal and now face the challenge of testing themselves against world champions Spain. While the next match is always the most important, there’s no denying that everything England do between now and the summer will, in part, be influenced by the upcoming tournament in Switzerland.\nSarina Wiegman's squad is taking shape, and the picture of who will make the plane is becoming clearer. That said, there is still plenty of time for players on the fringes to make their mark and force the manager's hand, whether it's for a spot in the squad or a starting place the opener against France.\nHere, 90min takes a look at four players who must seize their opportunities in the final months before the tournament and who still have plenty to prove…\nLauren James\nAt first glance, this might seem like a bold choice, given Lauren James is one of England's most talented player and is capable of operating in various positions. However, injuries have meant she's been in and out of the squad since the World Cup two years ago, and this month marks her first involvement with the Lionesses in ten months.\nCurrently, the injured Lauren Hemp is expected to be fit for the Euros, which means a battle for the left wing spot will likely unfold. Of course, James can play elsewhere, but she’s previously admitted that she feels most at home on that flank.\nFriday's performance in Portugal showed flashes of the quality she brings - direct running, fearlessness in taking on opponents, pace, and intelligence on the ball. James at her best could spearhead England to great things, but the Portugal game also highlighted the more wasteful side.\nThe Chelsea star's starting place ahead of the Euros is far from guaranteed, so the 23-year-old must prove herself, not just in terms of availability, but by showing she deserves to be one of the first names on the teamsheet.\nGrace Clinton\nGrace Clinton's rise in the England squad over the past year has been incredibly impressive. She has proven herself at club level and continues to make strides with the Lionesses.\nThat being said, she may not have been a guaranteed starter in midfield at the Euros had Georgia Stanway not suffered a season-ending injury. Now, Clinton's role has drastically shifted, and she will likely be a key player that Wiegman turns to this summer.\nHer first half performance against Portugal desmontrated dynamism and footballing intelligence. However, like the rest of the team, her second half display showed plenty of room for improvement and underscored the level she'll need to reach consistently to become a vital cog for England.\nLate in the game, Kika Nazareth surged past Clinton and showed the strength to hold off the midfielder as she stormed forward to score Portugal's equaliser. It's a vital lesson Clinton must learn from before the summer.\nAggie Beever-Jones\nUnfortunately for Aggie Beever-Jones, her game time in an England shirt has been limited. Surprisingly, Wiegman has seemed reluctant to call on the Chelsea forward, despite her ability to impress off the bench at club level.\nThe 21-year-old won't have a lot of minutes to prove herself, but she must show she is capable of being England's backup striker. At their best, the Lionesses have always had top talent to call upon from the bench, much like Alessia Russo did behind Ellen White at the last Euros.\nSince Rachel Daly's international retirement, that role has been up for grabs, and no one has yet seized it with both hands. Beever-Jones now has four months to prove she can be the one.\nChloe Kelly\nArguably no one entered this international camp with a bigger point to prove than Chloe Kelly. Not least because she wasn't even part of Wiegman's initial squad.\nKelly’s lack of game time at Manchester City had been a growing concern, which certainly hampered her chances with England, even though she was getting selected. It's clear the 27-year-old also recognised the risk of losing her place, which led to her forcing through a January move.\nNow, she has the rest of the season to force Wiegman's hand and ensure she’s firmly in the manager's thoughts. Interestingly, her new Arsenal teammate, Beth Mead, will be her greatest competition, but the rise of Jess Naz at Tottenham has added further pressure for wide places.",
  "word_count": 806,
  "scraped_at": "2026-02-14T12:58:04.533410"
}