{
  "article_id": "bc83d9277e31",
  "url": "https://www.morningadvertiser.co.uk/Article/2023/05/19/stonegate-officially-opens-clubhouse-5-with-wayne-bridge-as-guest",
  "title": "Stonegate officially opens Clubhouse 5 with Wayne Bridge as guest",
  "date": "20230519T083000Z",
  "domain": "morningadvertiser.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Bridge, who played for England, Chelsea and Manchester City, among others, helped promote the Champions League semi-final match at the bar, which saw former club City put European champions Real Madrid to the sword with a dominant 4-0 win.\nStonegate said Clubhouse 5 “will provide fans with an experience second only to being at a live game”.\nThe site, which was revealed to be operated by award-winning licensee Paul Eastwood by The Morning Advertiser earlier this month, is spread across two floors, inspired by sporting nostalgia and adorned with sport artwork, retro football shirts and memorabilia.\nClubhouse 5 promises to offer every customer the best seat in the house, with 4K UHD screens and SKY Q Technology providing “the best possible pub-going experience”. It is also equipped with Sky Sports Recap that gives customers the ability to watch highlights of a live event as it’s happening then jump back to the live action.\nFood and drinks menu\nStonegate has partnered with Heineken at the Lisle Street site, which is just off Leicester Square, Soho, and installed a ‘Subs Bench’ in the venue which, taken from a real dugout, gave fans the chance to sit down and chat with Bridge.\nThe menu consists of burgers, wings, loaded fries and sweet bao buns while Clubhouse 5 has partnered with Angus and Oink to provide seasonings and rubs and also TiNDLE THY, which will supply vegan chicken.\nThe range of beers includes Guinness, Beavertown, Camden Hells, London Pride and craft beers such as Jubel. There will also be six cocktails on-tap available from Black Lines.\nBridge, who also took part in I’m a Celebrity… Get Me Out of Here in 2016, said: “What a venue. Clubhouse 5 is an unbelievable place to watch the football, the tech they have is unreal and not something I’ve seen at the pub before.\n“It was a pleasure to drop in and chat with the fans and share a few beers and the food on offer is so good from burgers to wings, it’s a great place to stop by with your mates.”\nElements amplified\nStonegate Group marketing director Melissa Wisdom added: “We are excited to launch Clubhouse 5 in the heart of London’s entertainment district, bringing the stadium experience to the bar for all sports fans. We have taken what we know is most important to fans and amplified those elements to deliver the best possible sports viewing experience.\n“Fans will be able to experience all games broadcast in 4K UHD on our range of state-of-the-art screens, including a four-metre video wall where we will access all interactive elements of sports broadcasts through Sky Q, perfect for Formula One.\n“We know how important it is to have a strong food and drink offer. All of this can be ordered to table in seconds through our NFC-enabled web-based ordering platform so you don’t have to miss a minute of the action. We can’t wait to host fans from around the world over what is an amazing summer of sport including The Ashes, Women’s Football World Cup and Men’s Rugby World Cup!”\nBuilding on We Love Sport’s partnership with #HerGameToo, which aims to help raise awareness, educate and create a welcoming environment for female sports fans, Clubhouse 5 will be an inclusive venue, open to everyone and will be an official #HerGameToo pub.",
  "word_count": 555,
  "scraped_at": "2026-02-14T12:55:22.430095"
}