{
  "article_id": "bcba5c1be9e6",
  "url": "https://www.webwire.com/ViewPressRel.asp?aId=324123",
  "title": "Ascott is proud to enter a strategic multi - year partnership with Chelsea Football Club ( Chelsea ), becoming the Official Global Hotels Partner of the English Premier League club for the next four seasons . ",
  "date": "20240708T203000Z",
  "domain": "webwire.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Ascott is proud to enter a strategic multi-year partnership with Chelsea Football Club (Chelsea), becoming the Official Global Hotels Partner of the English Premier League club for the next four seasons.\nTapping on the strong synergy between Ascott and Chelsea as storied brands with global ambitions and extensive networks, this partnership will see collaborative efforts in offering money cant buy experiences for Ascott Star Rewards (ASR) members around the world.\nGame On Stay On\nThe experiences lined up for ASR members include exclusive access to matches at Stamford Bridge and VIP visits to The Blues Cobham Training Ground. The Ascott brand will also be displayed at Stamford Bridge for both Mens and Womens matches, as well as across Chelseas social and digital channels with engaging content for fans to enjoy.\nTo bring Chelsea closer to overseas fans, Ascott will be the presenting partner of Chelseas flagship international fan engagement event, the Famous CFC, in two international markets. More details on this will be shared soon.\nAs the Official Global Hotels Partner, Ascott brings together the worlds of hospitality and football to curate memorable fan engagement activities, exclusive offers for Chelsea supporters, and bespoke stay experiences at Ascott properties for fans and guests alike. Through these extraordinary experiences, we seek to ensure that every stay unlocks rewards for our guests, living up to our Stay Rewarded promise.\nKicking Off Soon!\nExclusively for ASR members, fans of Chelsea can look forward to Score Big with stay experiences complemented with guided stadium tours and commemorative co-branded merchandise available in limited quantities. With a touch of Match Day Magic, match-day access will also come with ease for privileged ASR members with limited sets of guaranteed tickets to designated home matches alongside pre-game refreshments.\nElevating guest rewards through money cant buy experiences, ASR members will further gain unparalleled access to VIP meet and greet sessions with the mens and womens football teams, pitch-side access prior to home matches, intimate tours to Chelseas private training grounds, as well as signed memorabilia.\nStand A Chance To Win Tickets To Chelseas First Game Of The 2024/2025 Premier League Season!\nFrom 12 to 31 July 2024, fans who sign up as an ASR member with the referral code GoalChelsea will be entered into a draw for a chance to score a pair of tickets to Chelseas first game of the 2024/2025 Premier League Season on home ground at Stamford Bridge on 18 August 2024.\nThe lucky winner will be announced on 1 August 2024.\nAs part of this global partnership, Ascott will assume management of a 232-unit hotel at Londons Stamford Bridge, home of Chelsea, from 2H 2024. To be rebranded as lyf Stamford Bridge London in 2H 2025, the property will be an anchor showcase of Ascotts hospitality to Chelsea fans from around the world.\n( Press Release Image: https://photos.webwire.com/prmedia/8/324123/324123-1.png )\nWebWireID324123\nThis news content was configured by WebWire editorial staff. Linking is permitted.\nNews Release Distribution and Press Release Distribution Services Provided by WebWire.",
  "word_count": 497,
  "scraped_at": "2026-02-14T12:57:59.389731"
}