{
  "article_id": "bcc747f72144",
  "url": "https://www.nytimes.com/athletic/5570255/2024/06/21/copa-americas-five-weirdest-stories/",
  "title": "Copa America five weirdest stories : Blackmail , three missed penalties and a  chilled ball  ",
  "date": "20240621T120000Z",
  "domain": "nytimes.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Much like South America’s club competitions, the Copa America has an enduring mystique.\nThat is down, in many instances, to a simple lack of familiarity. To fans in Europe, and even North America, South American football only fully gatecrashes the footballing consciousness when the World Cup rolls around every four years. The in-between times are often obscured by a combination of time zones, broadcast rights and apathy. There are, after all, enough games to keep up with already without having to navigate blurry illegal streams at 2am.\nAdvertisement\nMore’s the pity, for the continent’s biggest tournaments are not just festivals of football. They are factories for narrative and nonsense, churning out more storylines — and, yes, punch-ups — than your average TV soap opera.\nStep this way, then, for five strange-but-true tales from the annals of Copa America history…\nGO DEEPER\nThe Radar – The Athletic’s Copa America 2024 scouting guide\nTale one: The pool-party sting\nThe 1979 Copa America was the second of three successive editions to have no single host nation. Instead, matches were played all across South America; think Euro 2020, but with no Covid-19 tests or 11-hour round trips to Baku.\nThe format, as so often as the South American nations try to work out how best to build a tournament out of the 10 of them, was quirky: defending champions Peru got a bye straight to the semi-finals, leaving three sets of three teams, with one from each progressing to the final four. Brazil and champions-elect Paraguay made it out of Groups B and C, but Group A was a little tighter, with Chile and Colombia still in contention before they met in the final round of games.\nChile welcomed Colombia to Santiago knowing only a win would do the job. The stakes were high — so high that coach Luis Santibanez felt compelled to get creative. Not by tweaking his tactics, either.\nThere was only one decent hotel in Santiago, Chile’s capital, at the time: the Carrera. Santibanez, knowing that was where the Colombia delegation would be staying, came up with a plan. The visiting players would be treated to a get-together on the eve of the match, on the terrace overlooking the hotel’s rooftop pool. And they would not be the only invitees, as Chile winger Leonardo Veliz later explained.\n“He came up with the idea of hiring a group of women to distract and seduce the Colombians,” Veliz told Chilean newspaper La Tercera. “The Colombians were turned on, and several fell into the trap. It was a real commando operation.”\nAdvertisement\nSantibanez did not just ensure that Chile’s opponents had a late night. There was also a photographer at the party, snapping away on the quiet. The plan, according to Veliz, was to develop the images overnight and then blackmail key Colombia players — goalkeeper Pedro Zape, midfielder Ernesto Diaz and star man Willington Ortiz — before kick-off the following day.\nPhase two kicked into gear as the teams warmed up at the Estadio Nacional. Chile midfielder Eduardo ‘Madman’ Bonvallet went over and handed a little stack of photos to Ortiz, his opposite number. He told him copies would be sent to Colombian newspaper El Tiempo if Chile didn’t win the match. Zape and Diaz got the same treatment.\n“Zape went white with shock,” said Veliz. Ortiz, meanwhile, chased after Bonvallet, screaming and swearing.\nChile ran out 2-0 winners, qualifying for the semi-finals. Years later, Zape denied Santibanez’s spycraft had influenced the result, but the episode has understandably entered South American football folklore.\n“From the result, it could be said that the strategy was effective,” said Veliz. “I’m a bit embarrassed to talk about it, but it was the only way. They used to take the p**s out of us and put things in our food when we were in (Colombian capital) Bogota. So we had to pay them back in kind.\n“It was tit for tat. The Argentinians, Uruguayans, Brazilians and Paraguayans did these things all the time.”\nHow to follow the Copa America and European Championship on The Athletic…\nTale two: Cancelled/uncancelled\nHosting a major tournament can be a fraught business at the best of times, but it’s even trickier when your country is riven by political upheaval.\nSo it was in 2001, when clashes between armed forces, rebels and paramilitary groups in Colombia overshadowed the run-up to the Copa America there. Violence, death and displacement were grim facts of life for the Colombian people, with news bulletins dominated by reports of kidnappings and terror attacks.\nAdvertisement\nWhispers of disquiet among South America’s various football administrators became a cry when Hernan Mejia Campuzano — then vice-president of the Colombian Football Federation and a member of the CONMEBOL (the continental governing body, like UEFA in Europe) executive committee — was kidnapped on June 25, just 16 days before the start of the tournament. He was quickly released but the message was clear: sport would not be immune to the effects of the wider conflict.\nIn an emergency summit, decision-makers at CONMEBOL, which organises the Copa America, discussed its options. One was to postpone until the following year. Another was a relocation to Brazil, which said it could put measures in place at short notice. On June 29, CONMEBOL announced the competition would not be going ahead in Colombia as planned.\nGO DEEPER\nColombia Copa America 2024 squad guide: Will fearsome form translate into a championship mentality?\nThat might have been the end of it, were it not for an intervention by Andres Pastrana, the president of Colombia. He expressed his dismay at CONMEBOL’s decision — “Taking the Copa away from Colombia is the worst attack of all” — and pleaded with its bosses to reconsider. There followed a series of tense meetings, after which CONMEBOL eventually reinstated the tournament, just four days before the opening game.\nAll’s well that ends well? Not quite. Canada, who were invitees at that year’s competition, had already sent its players home. Argentina, who claimed its stars had received death threats, also opted to pull out at the last minute.\nOnly the willingness of Costa Rica and Honduras to drop everything and make up the numbers at short notice — the latter being flown in by the Colombian air force just hours before their first group game — saved the day. Oh, and Honduras even finished third, beating Uruguay and Brazil along the way.\nTale three: The winless wonders\nGrit and determination are characteristics valued by football fans across South America, but perhaps nowhere more than in Paraguay. Its national team is synonymous with grizzled, almost masochistic suffering; not so much a mindset as a grindset.\nCase in point: Paraguay’s 2011 Copa campaign. Look at the headlines and you’ll see they reached the final, losing only to Uruguay, with Diego Forlan getting two goals. Pretty good stuff. Zoom in a little, though, and it becomes even more impressive. For Paraguay finished second without winning a single match.\nAdvertisement\nThey drew with Ecuador, Brazil and Venezuela in the group stage, sneaking through as the second-best third-placed finishers. In the quarter-finals, they drew with Brazil again and progressed on penalties. In the semi-final, they drew with Venezuela again and won another shootout.\nThe best part? Three of those five draws were 0-0. Talk about being loyal to your DNA.\nGO DEEPER\nGuide to the Copa America stadiums and host cities: Everything you need to know\nTale four: The mystery of the ‘chilled ball’\nThe 1975 Copa America felt like a rebirth. It was not just the new name — it had previously been known as the Campeonato Sudamericano (South American Championship) — it was also the first edition of the tournament for eight years. In that context, the new no-host-nation setup felt well-judged — it allowed the competition to reintroduce itself to all corners of the continent.\nThe group stage produced some thrilling football, too. Argentina were knocked out despite beating Venezuela 5-1 and 11-0 (three-team groups saw each country face the other two twice); Colombia stayed unbeaten to set up a semi-final against defending champions Uruguay. The real standout teams, though, were Brazil and Peru, who were paired together in the other semi.\nBrazil, who had knocked out Argentina, were strong favourites but contrived to lose the opening home leg 3-1 in Belo Horizonte. The return, in Lima, was a necessary rescue act: the Brazilians won 2-0 to restore parity.\nThat meant the winner of the tie was to be decided by… well, nobody actually knew. This was before away goals. With the rulebook unclear, it was decided — after a frantic debate — that the semi-final would have to be settled by drawing lots.\nTwo balls, one representing Peru and one for Brazil, were placed in a bag. The daughter — or, in certain versions of the story, the grandson — of CONMEBOL president Teofilo Salinas picked one out. It was the Peru ball.\nAdvertisement\n“We had already left the stadium when we heard fireworks going off,” Brazil captain Wilson Piazza recalled. “At that point, we knew we were out.”\nBrazil accepted the result with serene magnanimity… in opposite land. The truth is, they fumed, alleging conspiracy. Salinas, after all, was Peruvian. “We can’t prove anything, but we suspected some kind of funny business,” said Piazza. “We all know that anything goes in football. Maybe the (Peru) ball had been chilled.”\nBy the time the final came around, the rules had been cleared up: Peru vs Colombia went to a third, deciding match on neutral turf in Caracas, Venezuela after two home wins in Bogota and Lima meant they had two points each. Not that that was much consolation to Brazil, who felt they had been royally stiffed.\n“That was the only time in my career I saw a tie decided that way,” said Piazza. “It left a bitter taste in the mouth.”\nTale five: History’s bleakest hat-trick\nMissing a penalty: ouch. Missing two penalties in the same match: wow, good luck sleeping at any point in the next fortnight. Missing three penalties in the same match: no, come on, let’s keep this vaguely in the realm of the plausible, eh?\nAt which point, we shall nip back a quarter of a century and say an overdue hello to Martin Palermo, a walking trivia answer who achieved infamy by racking up a hat-trick of howlers from the spot for Argentina against Colombia in a group match at the 1999 Copa in Paraguay (Colombia won, 3-0, topping the group and condemning Palermo and company to a quarter-final against Brazil, which they lost).\nLet’s be honest, you’ve probably read about this before. But now, hopefully, you can place it in the pantheon of great Copa America moments.\nHere’s hoping for a few more this summer.\nGO DEEPER\nCopa America's top 10 goals: Messi, Diaz, Ronaldinho, Aguero - vote for the best\n(Top image designed by Dan Goldfarb; photos by Pedro Ugarte/AFP and Alejandro Pagni/AFP both via Getty images)",
  "word_count": 1830,
  "scraped_at": "2026-02-14T12:32:36.482805"
}