{
  "article_id": "bcdf7293baf3",
  "url": "https://www.90min.com/posts/magdalena-eriksson-explains-what-drives-chelsea-success-conti-cup-final",
  "title": "Magdalena Eriksson explains what drives Chelsea success ahead of Conti Cup final",
  "date": "20230303T154500Z",
  "domain": "90min.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Magdalena Eriksson explains what drives Chelsea's success ahead of Conti Cup final\nChelsea captain Magdalena Eriksson has explained that an insatiable appetite for winning that comes from manager Emma Hayes is responsible for the club’s sustained success.\nThe Blues have won the WSL in each of the last three seasons and are seeking are 14th trophy in the space of eight years when they face Arsenal in the Conti Cup final on Sunday.\nOnce an assistant coach at Arsenal during the club’s historic quadruple season, Hayes has been heading things up at Chelsea since 2012 and has transformed the team into English football’s dominant force – overtaking the Gunners in that respect.\n“It’s difficult to name one trophy as the driver [of Chelsea’s success],” Eriksson explained. “The drive is the mentality of the group and the mentality that Emma has spread across from her position out into the veins of the team.\n“Even winning 3x3 in training, it almost feels like winning the FA Cup because it matters a lot – we keep scores, talk about it and want people to really celebrate winning and that is in everything we do. That is the driving factor, that winning is at the heart of everything we do. We have developed as a team and we are getting better and winning is everything to us.”\nOne game that Chelsea didn’t win was last season’s Conti Cup final when Manchester City came from behind to secure a 3-1 victory and lift the trophy for a fourth time overall.\nEriksson has insisted her team won’t dwell on that defeat, nor will they take it for granted they will beat Arsenal again so soon after knocking them out of the FA Cup last weekend.\n“We are all very conscious of [the 2022 final], but what we have done in the past won’t matter because a final all depends on who is ready and up for it on that day,” the Swede said.\n“We’re not going to focus too much on beating [Arsenal in the FA Cup]. We know it is going to be a new game with new challenges – we just have to be ready and switched because we lost the final last year and we don’t want to repeat that.\n“We’ve had two really tough games against them [so far in 2023]. Even [last] Sunday’s game was tough and they had some chances as well, so they are still a really strong team. They’ve had a tough times with injuries and played tough opponents as well. We have to be ready.”\nPledgeball's Katie Cross & Canaries Trust's Sarah Greaves join Shebahn Aherne to have football's climate conversation about the success of Green Football Weekend. If you can't see this embed, click here to listen to the podcast!\nFor more from Jamie Spencer, follow him on Twitter!",
  "word_count": 473,
  "scraped_at": "2026-02-14T12:21:25.151385"
}