{
  "article_id": "bd32cc82bee0",
  "url": "https://www.livemint.com/global/flirty-emails-and-chummy-photos-show-how-far-epstein-reached-into-business-world-11770172714015.html",
  "title": "Flirty emails and chummy photos show how far Epstein reached into business world",
  "date": "20260204T040000Z",
  "domain": "livemint.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Flirty emails and chummy photos show how far Epstein reached into business world\nLos Angeles scion Casey Wasserman, celebrity doctor Peter Attia and film director Brett Ratner are facing scrutiny over new Epstein files.\nCasey Wasserman was in Italy for the Winter Olympics, scheduled to make a presentation to the International Olympic Committee on the progress of the 2028 Los Angeles Games. Peter Attia, the longevity doctor with cult followers and a bestselling book, was days into a new role as a CBS News contributor. And Brett Ratner was promoting “Melania,\" his documentary about the first lady—his first film since 2017, when six women accused him of sexual misconduct.\nAll three men had reached—or returned to—the pinnacle of their industries in February 2026. And all three, it turned out, had secrets in the Epstein files.\nFlirtatious email exchanges between Wasserman and Ghislaine Maxwell from 2003 were among the files released by the Department of Justice on Friday. Attia’s name appeared more than 1,700 times in the documents, with correspondence showing he maintained a relationship with Jeffrey Epstein through 2019. Twenty undated photos showed Ratner hanging around with Epstein at his Manhattan townhouse, the two men with their arms wrapped around women whose identities are redacted.\nThese interactions have largely escaped scrutiny. The Epstein saga has generated headlines about people such as former President Bill Clinton and Andrew Mountbatten Windsor whose fame have ensured maximum attention. Clinton, who has been called to testify before Congress, has said he had no knowledge of Epstein’s criminal activity. Mountbatten Windsor, who was stripped of his royal title, has denied that he participated in sexual abuse.\nBut the files contain millions of pages, and many of the people in them aren’t former royals or former presidents. They are executives, doctors, lawyers, and dealmakers at the tops of their fields.\nTheir now-public messages and photographs reveal just how intricately Epstein spun his web of influence and how he traded on his connections to amass wealth and powerful friends. The files also show that some people sought the counsel and companionship of Epstein—sometimes even after he pleaded guilty to soliciting a minor for prostitution in 2008— associations that some had previously denied and were until now largely hidden.\nThis week, they have had to discuss their secrets. Wasserman and Attia said they regretted their email exchanges and didn’t know about Epstein’s crimes. Ratner said the photos were from 20 years ago, the woman in the photos was his then-fiancé and he didn’t really know Epstein.\nThe Olympics boss\nCasey Wasserman is the scion of a Los Angeles dynasty, and he is heading up the planning for the 2028 Olympic Games. His grandfather, Lew Wasserman, built MCA from a talent agency into an entertainment conglomerate that acquired Universal Pictures, running the combined company for nearly 30 years.\nAt 24 years old, in 1998, Casey Wasserman purchased the Los Angeles Avengers of the Arena Football League, becoming the youngest owner of a professional sports franchise. That same year, he founded Wasserman Media Group, which he built into one of the largest sports-marketing and talent-management firms through a series of acquisitions.\nIn September 2002, Wasserman flew on Epstein’s private jet as part of a trip to visit HIV/AIDS project sites in Africa with Maxwell, Epstein and others. Six months later, he began exchanging suggestive emails with Maxwell that have now become public.\nOn March 14, 2003, Maxwell told Wasserman she had been thinking of him “at inappropriate moments.\" He wrote back: “I think of you all the time…So what do I have to do to see you in a tight leather outfit?\"\n“I shall be wearing a tight leather flying suit…\" she promised.\nOn April 1, Wasserman wrote again: “Where are you, I miss you. I will be in nyc for 4 days starting april 22…can we book that massage now?\"\nMaxwell, who said she was in Brazil, responded: “All that rubbing—are you sure you can take it? The thought frankly is leaving me a little breathless.\"\nIn another exchange that week, Maxwell told Wasserman that “JE\" had asked her to find a house—and suggested she pick a week to come to Los Angeles to look at properties Epstein could rent in Malibu that summer. At the time of these exchanges, Epstein hadn’t been charged with sex crimes.\nOver the weekend, Wasserman issued an apology from Italy, days before the Winter Games opened. “I deeply regret my correspondence with Ghislaine Maxwell which took place over two decades ago, long before her horrific crimes came to light,\" he said. He added that he had “never had a personal or business relationship with Jeffrey Epstein,\" though he acknowledged the 2002 flight.\nKirsty Coventry, the IOC president, told reporters that the committee didn’t discuss the revelations at its meeting. “We have nothing further to add,\" she said at a press conference Sunday.\nThe celebrity doctor\nPeter Attia is a physician whose bestselling book “Outlive\" promised readers the secrets to extending their healthspan. His podcast drew millions of listeners. In January 2026, a revamped CBS News named him one of 19 new contributors.\nFive days later, the Epstein files dropped, showing that Attia’s name appeared hundreds of times. His relationship with Epstein dated back to 2014 and stretched through 2019—the year Epstein was arrested on sex trafficking charges and then died in jail.\nOver those years, Attia met with Epstein several times at his Manhattan townhouse. Epstein’s calendar suggests Epstein was also a patient: The files include notations for blood draws and follow-ups over several years.\nOn June 24, 2015, Attia emailed Epstein the subject line: “Got a fresh shipment.\"\nEpstein replied: “Me too,\" attaching a photo that was redacted in the DOJ release.\n“Please tell you found that picture on line…bastard,\" Attia wrote back. Then: “You the biggest problem with becoming friends with you? The life you lead is so outrageous, and yet I can’t tell a soul…\"\nIn 2016, Attia wrote to Epstein: “P—-y is, indeed, low carb. Still awaiting results on gluten content, though.\"\nOn Tuesday, Attia responded to the revelations with a 1,000-word letter he sent to his staff and posted on X, apologizing for his “embarrassing, tasteless, and indefensible\" messages and saying that he wasn’t involved in any of Epstein’s criminal activity.\n“The man I am today, roughly ten years later, would not write them and would not associate with Epstein at all,\" Attia wrote. “Whatever growth I’ve had over the past decade does not erase the emails I wrote then.\"\nAttia said the “fresh shipment\" in the 2015 email was metformin, a diabetes drug he was taking for antiaging purposes, and that Epstein’s photo was of “an adult woman.\" He called the exchange “juvenile\" and “not a reference to anything dark or harmful.\"\n“I was not his doctor, though several times I answered general medical questions and recommended other providers to him,\" Attia wrote.\nHe also shared how he was awestruck by Epstein and his extravagant life. “Everything about him seemed excessive and exclusive, including the fact that he lived in the largest home in all of Manhattan, owned a Boeing 727, and hosted parties with the most powerful and prominent leaders in business and politics.\"\nThe Hollywood comeback\nBrett Ratner’s career was derailed in 2017, when the Los Angeles Times published allegations from six women accusing him of sexual misconduct, including harassment, groping, and forced oral sex. Ratner denied the allegations and no charges were filed against him. The “Rush Hour\" director retreated from Hollywood, eventually relocating to Israel.\nRatner made a comeback last year when Amazon paid $40 million to license “Melania,\" a documentary about first lady Melania Trump that Ratner directed, with an additional $35 million for marketing budget. Ratner walked the black carpet at the Kennedy Center premiere in January.\nThe next day, the Epstein files were released and showed a series of undated images depicting Ratner with Epstein and Jean-Luc Brunel, the modeling agent who died in a French prison while awaiting trial on sex-crime charges. In others, Ratner has his arms wrapped around different women whose faces have been redacted by the DOJ.\nThrough a spokeswoman, Ratner said, “Those photos are from over 20 years ago, from an event I attended with my then-fiancée, who I’m pictured with. I did not know Jeffrey Epstein and do not recall having any subsequent contact with him.\"\nIn 2023, an Epstein victim told The Wall Street Journal that Epstein had promised to get her an audition with Ratner if she dressed up as Snow White, but it never materialized. Ratner said at the time that he had never met Epstein and threatened to sue the Journal if he was linked to the sex offender.\nIn an email thread released this weekend, a similar exchange unfolded between Epstein and a person whose name was redacted. In June 2010, Epstein wrote: “brett ratner ,is going to film a big movie,, Snow White, , i would love to take photos of you in a snow white costume. you can get it from the costume store.\" The person replied: “Will get it!\"\nIn December 2010, Epstein discussed in an email a dinner he was hosting at his Manhattan townhouse. He mentioned that he had invited Ratner but hadn’t yet heard back.\nA year later, Epstein’s assistant emailed Ratner directly: “Jeffrey would like to speak with you regarding [redacted] .could you please give him a call.\" It is unclear whether Ratner followed up.\nIn May 2012, during the Cannes Film Festival, celebrity publicist Peggy Siegal emailed Epstein to say she was sitting with Ratner, about to watch a Roman Polanski documentary. “Brett says ‘hi’ and he loves you!\" she wrote.\nIn other emails, Siegal mentioned Ratner in her reports to Epstein on which power brokers were attending various parties and who was staying on whose yacht in St. Barts. Siegal told the Journal that she was unaware of Epstein’s nefarious behavior.\nAs late as 2018, Epstein, who often name dropped, was using Ratner’s name to make introductions. In a heavily redacted message, Epstein wrote: “Hi , im jeffrey. Brett ratner thought we should meet.\" He followed up asking whether Ratner had spoken to the recipient, whose name was redacted.\nAnd on Nov. 1, 2017—the day the Los Angeles Times published its investigation into Ratner’s alleged sexual misconduct—Epstein emailed lawyer Reid Weingarten with four words: “brett ratner now. oy.\"\nWrite to Khadeeja Safdar at khadeeja.safdar@wsj.com and Neil Mehta at neil.mehta@wsj.com",
  "word_count": 1739,
  "scraped_at": "2026-02-14T14:21:54.946062"
}