{
  "article_id": "bd3cfb891a23",
  "url": "https://www.broadcastnow.co.uk/broadcasting/how-dazn-aims-to-combat-media-fragmentation/5194054.article",
  "title": "How DAZN aims to combat media fragmentation",
  "date": "20240528T163000Z",
  "domain": "broadcastnow.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Chief commercial officer Marc Watson outlines the broadcaster’s strategy\nOn May 25, football fans across the globe were on tenterhooks as the finals of four major European competitions - the FA Cup, UEFA Women’s Champions League, DFB Pokal, and Coupe de France – played out. This marked a fitting end to a particularly busy month in the football calendar with top tier leagues, including the Premier League, LaLiga, Serie A, Bundesliga and Ligue 1 also drawing their 2023/24 seasons to a close.\nDAZN has relationships with all these rights holders and has featured the crucial matches in select domestic and international markets. We are the largest broadcaster of European football across the continent. However, amidst the crescendo of excitement, football fans looking to watch matches from different leagues and competitions will largely find themselves still struggling to do so under one roof. As recently as at the start of this year, an Ampere Analysis report found that in major markets fans need access to a growing number of services to watch sporting events, and this is particularly the case in Europe. Meanwhile, football remains Europe’s top sport and fans in the market are generally likely to have an interest in following multiple leagues and competitions. They are not alone in this preference among their global counterparts.\nIn practice, this means that fans have to pay for several subscription services or run the risk of missing out. For many price-sensitive consumers this poses a difficult choice, while rights holders may be concerned that they are not able to build and retain an engaged, core audience as potential fans are deterred by the complexity and price of multiple subscriptions.\nThe dissonance between fans’ needs and the offering by most of the sports broadcast services they can access is clear, as is the fact that the persistent fragmentation in the sports media market is unsustainable if rights holders and broadcasters want to deliver the best entertainment experience to a global audience of sports fans.\nBuilding a global rights portfolio\nDAZN is actively seeking to address this. Through pursuing strategic and collaborative partnerships with rights holders, DAZN has built up an extensive rights portfolio, becoming the global home of women’s football, in addition to our extensive European football portfolio. In fact, we are the only platform that offered users all four of the football competition finals on May 25, as well as matches from top-tier European leagues, with matches available across an array of markets in which we are present. We want to develop and extend our rights holder relationships, so we can give fans what they want most – an unparalleled choice of high-quality content they can access through a single account.\nOffering the right content is only one piece of the puzzle when it comes to ensuring fans continue coming back for more. DAZN’s technology also enhances sports fans’ experiences with the ability to broadcast hundreds of fixtures concurrently.\nAlso, longer-term partnerships with rights holders mean that fans know where to keep coming back for more content. In the case of the FA Cup, for example, DAZN Germany has seen a 45% increase in the total number of viewers watching the semi-finals from the 2022/23 season to the 2023/24 season. The market has also attracted more than 1.6m viewers for the most popular Bundesliga match since December, while DAZN Italy has garnered over 2m viewers for each of the three most popular Serie A matches this season.\nThe ultimate entertainment experience\nA comprehensive rights portfolio also creates the perfect environment for brands to reach and engage with more fans than ever before by enriching the broadcast experience. DAZN holds the largest global portfolio of women’s football rights and, at the start of this year, removed the paywall to this content for all users. Visa FanZone, launched for the UEFA Women’s Champions League quarter finals and running through to the final on May 25, has reached fans in 170 countries in six different languages, promoting Visa’s Pep Talk concept, which incentivises women’s football fans to support their favourite players and teams in the competition. The quarter finals and semi finals delivered 72 million Visa brand impressions and 890,000 chat messages, votes and reactions.\nDAZN goes beyond traditional streaming, offering news and live stats, to ticketing, merchandise, as well as integrated betting and gaming. By integrating these features into one platform, we create a dynamic ecosystem where fans can immerse themselves in the world of sport like never before.\nIt is clear that tackling fragmentation is the future for the sports media sector to creating even more touch points with the 3.5bn sports fans worldwide. Coupled with prioritising accessibility, innovation and fan engagement, fans will be able to benefit from the best sports entertainment experience. Those not willing to take the leap face the risk of being left behind.\nMarc Watson is chief commercial officer at DAZN",
  "word_count": 813,
  "scraped_at": "2026-02-14T12:08:41.518383"
}