{
  "article_id": "bd4c8358b23d",
  "url": "https://menafn.com/1107961801/Turkish-Airlines-Becomes-Melbourne-Victorys-New-Principal-Partner",
  "title": "Turkish Airlines Becomes Melbourne Victory New Principal Partner",
  "date": "20240311T200000Z",
  "domain": "menafn.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Turkish Airlines Becomes Melbourne Victory's New Principal Partner\nWith a rich heritage of supporting a myriad of sports disciplines and teams worldwide, Turkish Airlines brings to this partnership a legacy of fostering athletic talent and sportsmanship. By joining forces with Melbourne Victory, a club celebrated for its spirit and achievements, Turkish Airlines not only extends its vast portfolio of sports engagements but also reinforces its dedication to bridging cultures and communities through the universal passion for athletic achievement.\nFlag carrier will prominently feature as the front-of-shirt partner for Melbourne Victory's Isuzu UTE A-League Men's and Liberty A-League Women's teams, as well as across all Academy sides. The partnership will extend to various in-stadia activations, signage, and digital platforms.\nMelbourne Victory will join the airlines' ranks alongside other high-calibre sporting names such as UEFA Champions League, Trkiye National Football Team, and a host of some of Trkiye's domestic footballing giants.\nOn the new partnership Turkish Airlines Chairman of the Board and the Executive Committee Prof. Dr. Ahmet Bolat, stated: 'We are glad to embark on this journey with Melbourne Victory-it's a truly fitting partnership right now as we celebrate our inaugural entry into the vibrant city of Melbourne. Leveraging our shared values of excellence and passion for success to create memorable experiences for football fans and travellers alike is traditional for our airline at this point as we support numerous clubs in many athletic branches.'\nCaroline Carnegie, Managing Director of Melbourne Victory also expressed her excitement about the newly formed alliance between the worlds of sports and aviation:“We are excited to welcome Turkish Airlines as our Principal Partner, especially as they embark on their expansion into Melbourne from March 2024. As a global powerhouse of the aviation business and one that wins countless awards for their service, customer satisfaction and sustainability, we are proud to be able to partner with them for the next three years and help them launch their brand into the Australian market.”\nOver the weekend, Turkish Airlines celebrated its first inaugural flight into Melbourne and also announced its plans to add Sydney to its network by the end of 2024.\nThe brand-new Melbourne flights will operate three times per week on the Boeing 787-9 Dreamliner for the airline's Winter operation, and A350-900 for Summer.\nLegal Disclaimer:\nMENAFN provides the\ninformation “as is” without warranty of any kind. We do not accept\nany responsibility or liability for the accuracy, content, images,\nvideos, licenses, completeness, legality, or reliability of the information\ncontained in this article. If you have any complaints or copyright\nissues related to this article, kindly contact the provider above.",
  "word_count": 433,
  "scraped_at": "2026-02-14T12:47:21.965359"
}