{
  "article_id": "bd50502de234",
  "url": "https://www.maitlandmercury.com.au/story/9023531/maitland-fc-and-charlestown-share-2025-womens-state-cup/",
  "title": "Maitland FC and Charlestown share 2025 Women State Cup | The Maitland Mercury",
  "date": "20250723T061500Z",
  "domain": "maitlandmercury.com.au",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Maitland FC and Charlestown Azzurri have been declared joint winners of the 2025 Women's State Cup.\nSubscribe now for unlimited access.\nor signup to continue reading\nThe Women's State Cup Final between Maitland and Charlestown was abandoned when Azzurri captain Jayna Frazer suffered a serious knee injury in the closing stages.\nThe match, which was played at Lake Macquarie Regional Football Facility on 13 July, was 0-0 at the time of the abandonment.\nNNSWF General Manager Football Operations Liam Bentley said clubs were consulted before a decision was made.\n\"It was an unfortunate end to an otherwise successful tournament and our thoughts are with Jayna as she faces a long road to recovery after the injury,\" Bentley said.\n\"This has been a difficult season for all clubs in terms of scheduling given the wet weather impacts at the majority of our grounds.\n\"As the game was abandoned near the end of the match, we didn't think bringing both teams back solely for a penalty shootout would be a fair reflection of the tournament as a whole.\n\"I'd like to thank both clubs for their collaboration and input before we made the decision.\"\nMissed penalty costs Maitland a point\nMaitland FC coach Adam Hughes believe officials missed a blatant foul on forward Braedyn Crowley in the penalty box in the final minute of their 2-1 loss to joint competition leader Broadmeadow on Sunday night.\n\"It's a definite shove in the back of (Braedyn) Crowley in the box. It's a penalty, but for some reason, it was was overlooked,\" Hughes said.\n\"I was bemused me, because everyone in the whole grandstand, they're watching, they come up afterwards, Magic fans and said It's 100 per cent a penalty.\"\nHughes said Maitland should have come away with a deserve point to go with the three points earned in their 3-1 win against Belmont Swansea in their July 16 catch-up game.\nThe results took Maitland to fifth on the ladder on 25 points, one point ahead of Charlestown Azzurri and one point behind Lambton Jaffas, but with a game in hand on both.\nHughes said Maitland had the best of play against Broadmeadow, despite trailing 2-0 when the Magic converted a penalty in the 65th minute.\nHe said Magic were in charge for the first 25 minutes and were able to score in the 20th minute.\n\"In that first 25 minutes we probably weren't connecting as cleanly as what I would have liked to see.\nBut once we got past that 25 minute period, I felt that we we really came into the game and had some some very good passages of play where we had complete control.\n\"Crowley scored to get us back at 2-2 and then we've hit the post off a corner. We've hit the post again of MacFarlane, and it was just one of those moments where I suppose a bit of luck on your side, it might skid and go in.\"\nMaitland are away against Valentine on Sunday.",
  "word_count": 498,
  "scraped_at": "2026-02-14T13:32:52.424127"
}