{
  "article_id": "bd51721c2a88",
  "url": "https://www.cityweekly.net/best-of-utah/best-of-utah-2025-e8541b1d",
  "title": "BEST of UTAH 2025",
  "date": "20251121T200000Z",
  "domain": "cityweekly.net",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "BEST of UTAH 2025\nThe 36th Annual Best of Utah. Featuring over 400 reader and staff picks. Take your time and for better viewing pleasure, please pick up a free copy around town.\nWelcome, honored stranger!\nYou bring questions and seek guidance, no? You have come to the right place, for your visit has been foretold by the spirits—our readers—for some time. You look for direction and higher wisdom in a world of tumult and noise, a place which often impedes one’s judgment and vision.\nFret not, dear stranger! We are prepared to give you a reading of that which has been, that which is, and this which may yet be, thanks to over 15,000 voters who contributed to this year's Best of Utah ballot across over 480 categories. By these we will divine Utah's superlatives—and occasional hazards—across the cultural, political, gastronomic and recreational planes. We hope that such may provide you with good times and wise decisions in your near future.\nLet us commence with our reading, then, so that the best of what the Beehive State has to yield may be brought more clearly to our gaze.\n— Wes Long,\nContributing Editor\nHere is your first card—the Eight of Wands. This is a card of activity and of rapid information. Depending on its position and the cards beside it, this could be an omen of good or ill, of hasty action or of long-expected results. Both are not uncommon in the fast-moving environment through which the following honorees operate, either in making the news or reporting it. Whether such actions prove to be well-aimed or hasty has been for our readers to judge, for as we all know, a wand can be an instrument of creative personality or of ego and impulse.\nBest Elected Official\nMayor Erin Mendenhall (Salt Lake City)\nIt’s been an amazing thing to watch Mayor Mendenhall sidestep the draconian efforts of the Legislature at every turn. So far in her second term, she’s already had to work on creative workarounds for their ever-tightening grip and bigotry. And under her steady leadership, the city is weathering unprecedented abuse under GOP leadership at the state and federal levels pretty well, all things considered. slc.gov/mayor/\n2. Sen. Nate Blouin\n3. Mayor Jenny Wilson (Salt Lake County)\nBest Columnist\nEli McCann, The Salt Lake Tribune\nAny ex-Mormon is bound to get a kick out of Eli McCann’s observations of Latter-day Saint culture. He writes without a trace of bitterness, instead channeling nostalgia and bemusement. Not every story is as immediately gripping as, say, his recollection of dressing up as a nun for Halloween. But like any great columnist, McCann can transform something as mundane as his husband’s crusade for more neighborhood speed bumps into a cheeky, insightful tale. sltrib.com\n2. Gordon Monson, The Salt Lake Tribune\n3. Meg Walter, The Deseret News\nBest Community Advocate\nJennifer Plumb\nDoctor Jennifer Plumb represents Utah’s 9th Senate district and has been a huge advocate for fighting the opioid crisis. She worked to build bipartisan support at the Legislature to allow individuals to carry Naloxone, which helps reverse symptoms of an opioid overdose, and she continues to educate members of the community through a monthly online training course. jenplumb.com\n2. Rosie Card\n3. “Bad” Brad Wheeler\nBest Conservative\nMitt Romney\nIt is perhaps incongruous that—within the federal congressional delegation and state Legislature, plus the Governor and his cabinet—Utah’s best conservative this year is a private citizen. Nonetheless, Mitt Romney casts a long shadow. Among the circus of modern politics, Romney held his own doing the work of bipartisan legislating before jumping ship. Time will tell whether Romney’s now unique brand of conservatism retires with him or if it can find a new champion.\nX: @MittRomney\n2. Becky Edwards\n3. Dan Thatcher\nStandout Internet Figures\nIt can be hard to remember a world before the internet gave us the tools to connect. Now, depending on where you look, it was either a wonderful gift or a doomsday curse. On the one hand, you have Elevate Utah, an organization that’s made it their mission to empower Utah’s voters. They’ve made a splash with informational videos that focus on local issues and community involvement where whiteboards and sticky notes are the stars. They’re regular people trying to build a coalition, online and on the ground. On the other hand, you have Mike Lee, a sitting U.S. Senator who seems to live on social media—not to communicate with constituents, but to amplify the worst of the echo chamber he’s descended into. Nothing is off limits, and even when confronted in the halls of Congress by a colleague for callousness in the aftermath of tragedy, apologies are never warranted.\nBest Political Social-Media Influencer\nElevate Utah\nIG: @elevate_utah\n2. Ben Winslow\n3. Black Menaces\nBest Internet Troll\nSen. Mike Lee\nX: @basedmikelee\n2. PhoKingSLC\n3. Utah Satire\nBest Local Podcast\n“City Cast Salt Lake”\nTo live around Salt Lake is to reside alongside folks who have wildly-different personal histories with the region. Many have relatives dating back to the Latter-day Saint settlers of the 1840s, while others just unpacked their U-Haul. “City Cast Salt Lake” provides a place for every manner of local to find something of interest. Telling stories through text, visuals and sound, the crew tackles topics great and small, with a particular emphasis on quality-of-life issues. The site’s myriad lists and its Hey Salt Lake newsletter also provide dependable jumping-off points for local exploration, be you a veteran of life here or a total noob. saltlake.citycast.fm/\n2. “Mormon Stories”\n3. “GeekShow Podcast”\nBest Local TV Lifestyle/Talk Show\nRoots, Race & Culture (PBS Utah)\nCo-hosts Lonzo Liggins and Danor Gerald talk candidly about the wide spectrum of experiences for Black Utahns and communities of color. They interview all types of people, from artists and lawmakers to entrepreneurs, creating an invaluable source of education with the perfect amount of storytelling and humor to keep diverse audiences engaged and informed. You can stream it from the PBS app and online. pbsutah.org\n2. Good Things Utah (KTVX/KUCW)\n3. Studio 5 (KSL-TV)\nBest Mixed-Use Space in which to Live/Work/Play\nMaven District\nSalt Lake City’s Maven District is known for women-owned businesses and a local community atmosphere. Shop for books at the Lovebound Library, grab a treat at Normal Ice Cream, or explore any number of other interests while enjoying murals as you peruse the street. This area also offers several townhomes and lofts for rent, as well as a plethora of wellness spots like Pilates studios and spas. It really has it all. mavendistrict.com\n2. Millcreek Common\n3. Central 9th\nStandout Organizations\nPlanned Parenthood’s Salt Lake Health Center and Action Council of Utah are a lifeline for Utahns—offering birth control, emergency contraception, STI/STD testing and treatment, PrEP and other preventative medications, vaccines, wellness exams, abortion care in certain locations, and more. Despite fierce political attacks, funding freezes and attempts at defunding, they haven’t just survived—they’ve kept their doors open, kept serving, kept educating. The organization is strong under the leadership of Shireen Ghorbani—now interim president/CEO—who brings passion, grit and clear commitment to defending access and expanding care in this challenging moment. In a state where reproductive rights are under constant threat, Planned Parenthood reminds us that these services are essential, the advocacy is urgent and our community depends on them now more than ever. plannedparenthood.org/planned-parenthood-utah\nBest Advocacy Organization\nPlanned Parenthood Action Council of Utah\n2. Equality Utah\n3. ACLU of Utah\nBest Nonprofit Organization\nPlanned Parenthood - Salt Lake Health Center\n2. SLC Pride\n3. The Other Side Academy\nStandout Politicians\nThe cycles of political life are unpredictable. For some, their rise (and fall) can be meteoric, for others, it’s about finding the right time. During his final year in the U.S. Senate, Mitt Romney was reckoning with a career as both party leader and outcast. His retirement came as a welcome surprise to many. Still, some hoped, including Romney himself, that he’d be able to use his voice following retirement to do some good. Instead, he’s chosen to keep quiet about his party and the man he once voted to impeach.\nMeanwhile, despite her loss in the race to replace Romney, Caroline Gleich has emerged as a rising star for the state. A devoted environmentalist, Gleich comes at a time when the state is facing dire threats from climate change. While the Senate race might not have worked out, it likely won’t be the last we hear of Gleich.\nBest Politician: Over the Hill\nMitt Romney\nX: @MittRomney\n2. Rocky Anderson\n3. Ben McAdams\nBest Politician: Up and Coming\nCaroline Gleich\nIG: @carolinegleich\n2. Nate Blouin\n3. Natalie Pinkney\nBest Political Controversy\nHB267 Referendum\nThis year, the Utah Legislature waded further into controversial measures when, despite continuous and fierce protests, lawmakers passed a law to strip public workers of their collective bargaining rights. Utahns’ anger turned to action and, in just 30 days, organizers broke records collecting more than 320,000 signatures to put a public referendum on the ballot to repeal HB267. We’ll see you at the polls.\n2. Trevor Lee’s Pride flag ban\n3. Mike Lee’s attempt to sell off public lands\nBest Progressive\nSen. Luz Escamilla\nFirst elected in 2008, Senate Minority Leader Luz Escamilla has been busy fighting for progressive causes big and small. This year in the Legislature, Escamilla endeavored to close the gap on childcare access in the state and to protect immigrant communities. In the minority caucus, her efforts often hit roadblocks. But to keep on fighting even when we fall short is a great strength. Progress doesn’t happen overnight.\nIG: @senatorluzescamilla\n2. Sen. Nate Blouin\n3. Sen. Jen Plumb\nStandout Radio\nIf you’ve turned on the radio during your morning commute anytime during the last 30 years or so, there’s a good chance you’ve encountered Radio From Hell on 96.3 FM. A rogues’ gallery of supporting characters have come and gone, but what has stayed are titans Kerry, Bill and Gina and their playfully rebellious and insightful conversations to accompany you on those sleepy mornings. Radio From Hell is one of the longest-running local radio shows in the country, and it is a big factor—but far from the only one—for why X96 (KXRK) is beloved by Utahns and nationally renowned, including being ranked as a Top 5 rock and roll station by Rolling Stone. Things are always changing, but Radio From Hell and X96 are a comforting—and subversive—constant. x96.com\nBest Radio Show\nRadio From Hell (X96)\n2. RadioWest (KUER 90.1)\n3. RadioACTive (KRCL)\nBest Radio Station\nX96 (KXRK 96.3 FM)\n2. KUER 90.1\n3. KRCL\nBest Rally\nNO KINGS Protest\nIn response to democratic backsliding during the second Trump administration, huge crowds have made their voices heard by gathering in Salt Lake City and around the state. Among them was Afa Ah Loo—a father, fashion designer and community advocate—who was tragically shot and killed during the protest in June. Ah Loo, like all those who attended, remind us that in the history of our nation, power has always been with people willing to come together.\n2. Transgender Day of Visibility\n3. ICE Out of SLC\nBest Social Cause\nSave the Great Salt Lake\nThe Great Salt Lake has long been the beating heart of Utah. And for years, that heart has been failing as water has been diverted away. Now, faced with difficult choices to keep toxic dust out of our lungs, the state has chosen baby steps where great leaps are required. With our future in Utah and the West dependent on saving the lake, this may prove to be the defining crisis of our lifetimes.\n2. Protecting abortion access in Utah\n3. Protecting collective bargaining rights for public workers\nStandout Reporters\nThe free press is critical for a free society—watchdogging the government, holding mega-corporations accountable and, yes, keeping us up to date on our favorite teams. Robert Gehrke, a Tribune veteran, is an expert at breaking down the tomfoolery of Capitol Hill. His byline is one that Utahns have trusted for decades. His colleague Andy Larsen turned a passion for the Utah Jazz into a dream job—he began blogging about the team for fun before his professional run covering the action at the Delta Center. Fox 13 reporter Ben Winslow is a multi-Best of Utah winner with decades of experience covering Utah news across radio, print, TV and digital platforms. Readers love his sharp, multi-platform skills that make local news accessible and entertaining. And Doug Fabrizio, the silver fox of SLC, is the unmistakable voice of RadioWest. Known for his easeful interviews, he draws out depth and authenticity in every guest.\nBest Reporter: Print/Digital Robert Gehrke, The Salt Lake Tribune\n2. Bryan Schott, Utah Political Watch\n3. Katie McKellar, Utah News Dispatch\nBest Reporter: Radio\nDoug Fabrizio, KUER\n2. Lara Jones, KRCL\n3. Eric Cabrera, KSL Newsradio\nBest Reporter: Sports, All Media\nAndy Larsen,The Salt Lake Tribune\n2. Amy Donaldson, KSL\n3. Gina Barberi, X96/KXRK\nBest Reporter: TV\nBen Winslow, Fox 13/KSTU\nIG: @benwinslow\n2. Mary Nickles, KUTV2\n3. Daniel Woodruff, KSL-TV\nBest Utah Athlete\nTony Finau\nThe SLC-born golfer was dynamite in 2024, tying for third in the U.S. Open and reaching the FedEx Tour Championship. While his performance on the course cooled a bit in 2025, Finau still made the cut in 15 of his 20 events and made the top 50 at the Masters, the PGA Championship and U.S. Open. Finau also has a sterling reputation as a philanthropist and as the founder of the Tony Finau Foundation.\n2. Caroline Gleich\n3. Grace McCallum\nStandout Utahns\nArt has a way of having a lasting impression on us, especially when that art makes people talk. Longtime editorial cartoonist Pat Bagley has spent decades cutting through the fog of political commentary with profound images that don’t require explanation. But, disappointed with and fearful of the current administration, Bagley picked up and moved to Portugal. He’ll continue to offer political commentary from abroad, but Utahns will miss being able to claim this award-winning artist as their own. The current favorite Utahn, on the other hand, is none other than Post Malone, a beloved genre-blending musician that has captured hearts around the world. Malone moved here in 2019, stating his love for the state’s beauty and wanting a quieter lifestyle. Hopefully he’s found what he was looking for and will stick around for some time.\nBest Former Utahn\nPat Bagley\nIG: @bagleycartoons\n2. David Archuleta\n3. John Stockton\nBest Utahn\nPost Malone\nIG: @postmalone\n2. Afa Ah Loo\n3. “Bad” Brad Wheeler\nStandout TV\nMary Nickles has been on air at KUTV since 1991, offering a consistent and comforting person on whom viewers can depend. She’s an absolute pro at her job, the epitome of someone mastering their career. Nickles has also been vocal about the importance of women getting mammograms after her own tumor was detected during an exam in 2011. Her in-depth reporting and work as KUTV’s Check Your Health spokesperson has won Nickles an Emmy and other awards. City Weekly voters also chose KUTV 2 as the overall best news station in town, preferring the downtown broadcaster’s timely and accurate coverage of local issues. From the daily weather and traffic reports to field reporting on breaking news, the team at KUTV consistently delivers well-crafted and easy-to-understand updates on what’s going on in the community. kutv.com\nBest Local TV Anchor\nMary Nickles (KUTV 2)\n2. Kerri Cronk (Fox 13)\n3. Heidi Hatch (KUTV 2)\nBest News Station\nKUTV 2\n2. KSL-TV\n3. Fox 13\nBest Weathercaster\nChase Thomason (KUTV 2)\nWhen the 10-day forecast is just a smartphone app away, it takes a talented and dedicated professional to elevate the weather report to the level of must-see television. KUTV’s Chase Thomason is one such weathercaster, going beyond the daily highs, lows and inch counts to offer expert insights on regional and long-term trends, and showing a keen eye for the news of extreme weather and the on-the-ground impacts of a changing climate. kutv.com\n2. Kevin Eubank (KSL-TV)\n3. Gina Barberi (X96)\nMost Underreported Utah Story\nSLC’s Treatment of its Unsheltered Community\nWhen it comes to homelessness, no one is happy with how things are going. That’s just about the only thing on which anyone can agree, with the debate otherwise devolving into a storm of finger-pointing and blame. Many of those fingers end up pointed at Salt Lake City, but while the media and politicians have the luxury of squabbling over fault, thousands of unsheltered Utahns are simply trying to make it through another night.\n2. Fluoridated water ban\n3. Legislature sneaking $300 million for a pedestrian plaza at the Delta Center\nWorst Use of Public Funds\nFluoride Removal\nWhile nine out of 10 dentists may recommend water fluoridation to prevent tooth decay, the Utah Legislature has decided to listen to the tenth dentist. Now, communities are barred from treating their water with the additive. The decision overrides broadly accepted health expertise and even the will of voters where, as recently as 2023, residents of communities like Brigham City voted 2-to-1 to keep fluoride in their water. Better get that dental checkup booked.\n2. Private school vouchers\n3. “Stand for Our Land” deception campaign\nWorst Utahn\nSen. Mike Lee\nFor years, Utah has thought of its brand of conservatism as more compassionate than the rest. Still, over his three terms in office, Sen. Mike Lee has done his best to prove otherwise. Just this year, his jokes about the assassination of Minnesota lawmaker Melissa Hortman and her husband, as well as his latest efforts to sell off Utah’s public lands, saw Sen. Lee leading a race to the bottom—a race he isn’t running alone. X: @basedmikelee\n2. Gov. Spencer Cox\n3. Trevor Lee\nBest Counterpunch\nMayor Mendenhall’s Sego Lily Pride Flags\nWhen the Utah Legislature voted to ban pride flags from schools and government buildings (HB77), Salt Lake City Mayor Erin Mendenhall refused to let the city be silenced. In response, she and the City Council quickly rolled out three new official flags featuring LGBTQ+, transgender and Juneteenth symbolism, each with SLC’s sego lily. What was meant to erase residents instead became an official banner under which to unite. You can’t legislate identity—only elevate it.\nBest Defense of Democracy\nUtah Courts Uphold Proposition 4\nThe Utah Legislature is petty, callous and drunk on power. So when a statewide majority told lawmakers to stop gerrymandering, the “representatives” reacted by swatting an independent commission aside and cutting the Wasatch Front into worse districts than before. It might have ended there—with voters trapped in a feedback loop of incumbency—but for the state’s Judicial Branch, which reinforced the people’s right to reform their government and sent the Legislature back to the drawing board.\nBest Living Utah Historian\nCraig Wirth\nEntering the historical field involves many circuitous paths, but the connection between history and journalism is, understandably, a short one indeed. Craig Wirth has been walking this path for decades as a journalist and documentarian in New York, Wisconsin and California on top of Utah. His fascination with the offbeat has proved a perfect fit for the history of the Beehive State. Apropos of his ABC4 feature, Craig’s “Wirth Watching.”\nBest New Sports Team\nLeague One Volleyball\nHow often do you get to watch an Olympic-level athlete do their thing in person? In a state as volleyball-crazy as Utah, the opportunity to watch gold medalists Jordyn Poulter and Haleigh Washington in person is truly incredible. LOVB (pronounced “love”) made a major splash in its first season, and with the 2028 Olympics in Los Angeles on the horizon, professional volleyball in Salt Lake is on the rise.\nlovb.com/teams/lovb-salt-lake-volleyball\nBest NIMBYs\nSolutions Utah\nThis pro-business/public safety group had just started earning street cred on homelessness when it bafflingly went full Karen on bike lanes and speed bumps, calling the managers at the Legislature to demand a moratorium from on high and bankrolling a couple of City Council candidates to agitate for the interests of suburban commuters. Helping lawmakers steal power from Salt Lake City is the ultimate betrayal. Hopefully that extra parking space was worth their souls.\nBest Reality Check\nSalt Lake Tribune Overshoots on Stuart Adams\nThe Tribune had a helluva scoop—abuses of power, sex crimes involving a child, nepotistic cover-ups. The editorial board was outraged. The orgs launched 1,000 internet petitions demanding resignation! But the Senate President never flinched, and the factual record revealed a tediously by-the-book change in code related to the crimes of 18-year-old high school students. Then the governor dismissed the “controversy” at his TV press conference and the story vanished into yesterday’s news.\nBest Sports Homecoming\nAlex Jensen, University of Utah Basketball\nAlex Jensen not only played for one of the all-time quirkiest coaches in the college game, Rick Majerus, he returned from a professional basketball career overseas to join Majerus’ staff at Saint Louis University. Since then, Jensen’s earned head coaching duties at several levels of the sport, while spending a decade as an assistant with the Utah Jazz. His choice as the 17th head coach of the Runnin’ Utes feels like an inevitable reunion.\nMost Exciting Jazz Prospect in Decades\nAirious “Ace” Bailey\nWho was the last great small forward to play for the Utah Jazz? Gordon Hayward? Andrei Kirilenko? No disrespect to AK-47 or Hayward, but those guys were one-time All-Stars. Bailey has the potential to be so much more. There’s never been a player with Bailey’s combination of size, athleticism and ball handling in a Jazz uniform, let alone one who’s just 19 years old. Let’s enjoy his talents in the purple and light blue while we can.\nWorst Case of Public Stultification\nUtah Legislature’s “Realignment” of Higher Ed\n“What I want is, Facts,” says the administrator in Dickens’ Hard Times. “Plant nothing else, and root out everything else.” Well, courtesy of its Legislature, Utah’s institutions of higher learning are acquiring a Dickensian flavor through HB265’s $60+ million budget cuts, with the proviso that universities eliminate “inefficient” programs and reinvest in lawmakers’ preferred industries before funds return. Add the effects of banning anything DEI-adjacent and favoring at-will contracts, and you’ve a recipe for hard times indeed.\nIt appears we have continued the suit with the Ace of Wands. With its connotations to intellectual and spiritual passion, this is an encouraging sign, particularly in its upright position. You can expect ambitious creative work from this, backed by a good dose of luck, which is something that the following award-winners can well appreciate with their own endeavors across Utah’s arts scene. Whatever the medium and despite occasional reversals, they strive to bring about the very finest from their hearts and minds and we are all the better for it.\nBest Arts & Crafts Studio\nArt Haus\nNot only known for their pottery, Art Haus also has classes for other mediums such as painting and drawing. It’s an all-inclusive art class experience open to all ability levels, making it much more than an art school, but also a community space. Scholarships are available, so if money is tight, you can still find ways to improve your artistic skills at this community-driven school. arthaus-slc.com\n2. Salt Lake Pottery Studio\n3. Workshop SLC\nBest Art Gallery\nUtah Museum of Fine Arts\nThough you may spend only a few hours wandering the two floors of the Utah Museum of Fine Arts, their collection of over 22,000 works provides the best opportunity for Utahns to be exposed to global artwork, whether it was crafted millennia or mere decades ago. They recently reimagined their Mexican and Central and Southern American galleries and have an exhibit inspired by the age of AI on display until Jan. 4. umfa.utah.edu\n2. Springville Museum of Art\n3. Urban Arts Gallery\nBest Arts Nonprofit\nBroadway Centre Cinemas\nThe Salt Lake Film Society and Broadway Centre Cinemas are the home of independent film not just for Salt Lake; they’re the heart of it for the entire state. They’ve been an important part of the scene for decades, ensuring that lesser-known films get released locally and that filmmakers have a venue to reach audiences. They’re also deep into preservation work on the beloved Tower Theatre, with completion estimated for later this decade. slfs.org 2. Salt Lake Acting Company\n3. Utah Shakespeare Festival\nBest Cultural Event\nSLC Pride\nSalt Lake City is known for many things, but over the years Pride Month events have gotten bigger, better and more fun. Geared to the hyperlocal, the SLC Pride organization hosts events throughout the year, with its June festivities being the centerpiece. Their programming is an accessible and stylish way of letting our LGBTQIA+ friends and family know that they are not only welcome, but very much loved. slc-pride.org\n2. Utah Pride Festival & Parade\n3. Utah Arts Festival\nStandout Concert Venues\nUtah has no shortage of amazing concert venues. Everywhere you turn, there’s a unique place to enjoy local and national tunes. The people have spoken, though, and there can only be one winner—or in this case, a few winners. Red Butte Garden is a stunning setting featuring beautiful flora and an incredible mountain view. You can pull up a blanket and chill on the grass, or bring chairs for the whole family. One really can’t go wrong with this amphitheater when looking for something to do. The Eccles Theater is an excellent venue for everything from classical music to comedy; its interior will have you as transfixed as the performances themselves. Kilby Court is a classic, allowing local performers to cut their teeth and gain experience on its stage. It seems like a rite of passage to have your photo taken in front of the “Welcome to Kilby Court” sign.\nBest Concert Venue: All-Ages\nRed Butte Garden\n2. Kilby Court\n3. Utah First Credit Union Amphitheatre\nBest Concert Venue: Indoor Over 500 Capacity\nEccles Theater\n2. Abravanel Hall\n3. The Depot\nBest Concert Venue: Indoor Under 500 Capacity\nKilby Court\n2. The State Room\n3. Urban Lounge\nBest Concert Venue: Outdoor\nRed Butte Garden\n2. Utah First Credit Union Amphitheatre\n3. Sandy Amphitheater\nBest Drag Entertainer\nSequoia\nWhat sets a good drag performer apart? Not only the charisma, uniqueness, nerve and talent to even grace a stage, but also the quality of live vocals, lip-syncing and storytelling through costume and presence. Sequoia embodies all of this and more with her snatched wigs and sequined bodices that pull you in and wanting more. Follow her on Instagram to keep track of her “Save Her” tour: @theonlysequoia.\n2. Madazon Can-Can\n3. Hoe Shi Minh\nBest Friend of the Arts\nSpencer Eccles\nIf a friend told you to meet you at some building with the name “Eccles” attached to it, you’d probably get lost. The Eccles family’s wealth originated with David Eccles, Utah’s first multimillionaire. Today, his grandson, Spencer Eccles, carries on a family tradition of philanthropy as chairman of the George S. and Dolores Doré Eccles Foundation, a key donor behind the Eccles Theater, Ballet West, KPCW and the Utah Shakespeare Festival. gsecclesfoundation.org\n2. Jonathan King\n3. Kate Rufener\nBest Dance Company\nBallet West\nThe premier dance company for high-class, professional ballet in Utah. From Romeo & Juliet to A Midsummer Night’s Dream to the celebrated Nutcracker, you will be in awe of the dancers and productions that Ballet West produces so consistently. It is one of the country’s leading ballet companies for a reason, so check out the classical stories, historical masterpieces and modern creations that they have to offer! balletwest.org\n2. Ririe-Woodbury Dance Company\n3. SALT Contemporary Dance\nBest Haunted House\nFear Factory\nSpooky season means haunted houses, and Fear Factory outdoes itself each year. It’s not only ranked highly in Utah, but also known throughout the world for its spooktacular size, boasting six buildings—some up to six stories high—with two underground passages and a zombie bus to get you there and back. Be prepared to be scared, but also to have tons of fun. fearfactoryslc.com\n2. Nightmare On 13th\n3. Asylum 49\nBest Movie Theater\nBroadway Centre Cinemas\nThere’s something charming about a theater you don’t need a map to navigate, an older cineplex that feels homey yet blends cutting-edge technology with the capability to run old 35mm prints. Broadway Centre Cinemas is a landmark for film buffs looking to see the best in independent films and classic cinema. It’s also been a local Sundance venue for years, something we’ll look back fondly on through the haze of old celluloid. slfs.org\n2. Brewvies Cinema Pub\n3. Megaplex Theatres at Jordan Commons\nBest Muralist\nLizzie Wenger\nLizzie Wenger’s vibrant depictions of Utah’s landscapes were made to be painted on buildings throughout Salt Lake City, reminding passersby of the natural splendor surrounding the city on all sides. In 2025, she painted majestic mountains, playful horses and gentle flowers on the sides of three structures: Wicksmith Candle Company, Harley-Davidson of Salt Lake City and the addiction recovery center Fellowship Hall. Go check them out! lizziewenger.com\n2. Joseph Anderson\n3. Caro Nilsson\nBest Museum\nNatural History Museum of Utah\nAny museum can curate history, but a truly great one uses the past to interrogate the present. For example, The Natural History Museum of Utah details the ecosystem of the Great Salt Lake to illuminate its water level crisis and uses interactive games to encourage climate action. Other exhibitions cover Utah’s Indigenous peoples and the Ice Age. And if you only visit museums to gawk at dinosaurs, there are plenty of those, too. nhmu.utah.edu\n2. Utah Museum of Fine Arts\n3. Utah Black History Museum\nBest Music Festival\nKilby Block Party\nKilby Block Party’s first iteration was in 2019, and it has been growing stronger with each subsequent year. It’s become famous for incredible lineups that not only draw showgoers from across the state but from across the country as well. Tickets sell out quickly, so you have to be on the ball to get your passes—but it’s well worth the waiting and watching. kilbyblockparty.com\n2. Deer Valley Music Festival\n3. Das Energi Festival\nBest Music Instrument Store\nSummerhays Music Center\nWhere there are booming music scenes, there must be music stores that locals can trust to service their gear or find replacements. Summerhays has locations in Orem, Layton and Murray, allowing for great availability and access across the Wasatch Front. They help with purchasing, repairing and renting, and have lists of private tutors for those who are just starting out. They’ve been around since 1936—a testament to their skills and ability to work with musicians. summerhaysmusic.com\n2. Acoustic Music\n3. House of Guitars\nBest Neighborhood Concerts\nTiny Porch\nIt’s already cool to gather with like-minded people who enjoy the same music you do, but it’s even more fun when it’s hosted on a small porch. Helped along by the Utah Arts Alliance, quality local acts come to play and hang out with a small, intimate group of folks ready to chill. There are often potlucks and snacks, too, so it’s really not something you can go wrong with. tinyporchconcerts.com\n2. Heart & Soul Music Stroll - Sugar House\n3. KRCL’s Day in the Park\nBest Neighborhood Gathering\n999 Ride\nThere’s no organizer and it’s slightly chaotic, but that is also what makes this underground bicycle rally so much fun. You can meet at the 9th & 9th intersection on Thursday nights to meander around the city on your favorite pair of wheels. It’s a sure way to explore new areas as well as make new friends along the way.\n2. Utah Film Center Summer Outdoor Film Series\n3. Avenues Street Fair\nBest Singer/Songwriter\nAddison Grace\nSinger/songwriter Addison Grace has built up a following on social media sites like TikTok and Instagram, but when they began releasing music in 2020, listeners immediately felt a connection—especially in the Beehive State. Grace’s music is sweet, thoughtful and introspective, with a widely appealing bedroom-pop sound. It’s easy to see why they came in first place this year. IG: @graceful.addison\n2. Talia Keys\n3. Michelle Moonshine\nStandout Paint and Pottery\nWhether you prefer paint or pottery, Salt Lake City contains some excellent safe havens of creativity. Enjoy a date night or group outing sipping a beverage at Sip & Paint with Salt Lake Pottery Studio, held at Loki Coffee. Enjoying Loki’s delicious wares, you can paint a pot to your heart’s content before Salt Lake Pottery fires it up for you. Speaking of pottery, Art Haus is a great place to take a class. Students learn at their own pace and the classes are a blend of beginners, intermediates and experts working together in a nonjudgmental space. You can choose from clay to wheel throwing classes, decorating, hand building and figure sculpting.\nBest Paint Night\nSip & Paint with Salt Lake Pottery Studio\nlokicoffeeco.com/events/sip-and-paint\n2. Color Me Mine\n3. Champaint Night with Kat at Why KiKi\nBest Pottery Classes\nArt Haus\n2. Salt Lake Pottery Studio\n3. Red Kiln Pottery Gallery\nStandout Performances\nCity Weekly readers’ favorite musical performances skewed Celtic in 2025. The fiddle and bagpipes in Utah Symphony’s performance of John Powell’s soundtrack to How to Train Your Dragon made the audience feel like they were soaring in the clouds with Hiccup and Toothless. Meanwhile, Irish folk musician Hozier brought listeners down to earth with a voice as soulful as his lyrics, backed by a legion of harmonizing vocalists and string musicians. After a fervent performance like that, it’d be easy to forget about Hozier’s 2019 “handsome Squidward” incident—when he shattered his ethereal persona with an accidental Instagram story post of him messing around with a silly filter—but the internet never forgets.\nBest Classical Music/Opera Performance\nUtah Symphony, How to Train Your Dragon\n2. Utah Opera\n3. Candlelight Concert\nBest Concert of the Past Year\nHozier, Utah First Credit Amphitheatre\n2. Post Malone\n3. Addison Grace\nBest Theater Company\nHale Centre Theatre\nNothing impedes actors more than a shoddy set. Hale Centre Theatre’s actors are lucky not to have this problem, allowing them to bounce around and belt their hearts out without breaking the immersion. The Young Living Center Stage’s ability to rise and descend provides seamless set changes that seem like magic even to an audience of 900. It’s a far cry from the theater’s first iteration, which was housed in an old lingerie factory. hct.org\n2. Salt Lake Acting Company\n3. West Valley Performing Arts\nBest Urban Public Art\nOut of the Blue (The Whale)\nPublic art is supposed to create conversations and become part of the community. There’s no question that Out of the Blue by artist Stephen Kessler—known simply as “The Whale”—has stirred conversation. Initially met with skepticism, it’s now world-famous and so beloved that it’s spawned a Church of the Sacred Whale, Pride flags bearing its image and folks running marathons around it. If that’s not good public art, we don’t know what is. tuskstudios.com\n2. Hoodah (Granary District)\n3. Joe McQueen mural (Ogden)\nBest Utah Author\nBrandon Sanderson\nEvery time you turn around, Brandon Sanderson has written another book, and they always sell like hotcakes. But it wasn’t always so. His popularity launched through the stratosphere when he was handpicked to finish Robert Jordan’s Wheel of Time series. Since then, Sanderson has written millions of words in series like Mistborn, the Stormlight Archive and more. He’s local, dedicated to teaching his craft while honing it, and an overall nice guy. His popularity is well-earned. brandonsanderson.com\n2. Terry Tempest Williams\n3. Shannon Hale\nBest Utah Band\nThe Backseat Lovers\nWhile there are many worthy bands that can hold the title of Best Utah Band, The Backseat Lovers are an excellent choice. They started in 2018 and now have millions of listeners who love their indie/alt sound. They really gained public attention with their 2019 single “Kilby Girl,” a track dedicated to the legendary venue. This is still the band’s most popular song, capturing the hearts of listeners all around the world.\nIG: @the.backseat.lovers\n2. Pixie & the Partygrass Boys\n3. The Used\nBest Utah Comedian\nCraig Sorensen\nThis certified silly goose is being recognized for the third consecutive year. Sorensen helms Crowdsourced Comedy, a queer- and Black-owned comedy troupe that performs live shows Sundays and Fridays at Why KiKi. As a former language instructor at the Missionary Training Center, Sorensen knows what makes Utahns laugh. He continues to push the boundaries of sass, while also teaching others his ways through Crowdsourced’s improv classes. IG: @kcraigsorensen\n2. Mayor Wren\n3. Chan B\nBest Utah Poet\nRJ Walker\nIf you’ve meandered outside of the bars on Main Street on any given night, then chances are good that you’ve run into RJ Walker’s table decked out with a typewriter, stationary and lots of fun stickers. He will write you a poem on the spot that is sure to be a fun souvenir for a memorable evening. He is known to see people very clearly, though, so be prepared to be read like a book.\nIG: @dollarcompliments\n2. Wren Williamson (Lady Death)\n3. Paisley Rekdal\nBest Utah Stage Actor\nJoseph Paul Branca (Salt Lake Acting Company)\nYou might have spotted him as a froglike alien in SLAC’s Close Encounters from the Beehive. Maybe he moved you as David in Beloved King: A Queer Bible Musical. He definitely cracked up your little ones as Mo Willems’ self-centered Pigeon, who insists on driving a bus without a license in SLAC’s family show. No matter the role, Joseph Paul Branca commits to the bit with enthusiasm that infects an entire audience. josephpaulbranca.com\n2. Ed Sciotto (Salt Lake Acting Company)\n3. Jayne Luke (Pioneer Theatre Company)\nBest Visual Artist\nLizzie Wenger (Art by Lizzie Wenger)\nLizzie Wenger has been obsessed with the landscapes of the American Southwest ever since she was a child, finding sanctuary in the outdoors as she grieved her father’s death. Today, Wenger renders Utah’s natural beauty in what she calls a “psychedelic cubist” style. Each rust-red canyon and desert brush is composed of ripples, creating paintings as mesmerizing and unique as fingerprints. lizziewenger.com\n2. Squid Vishuss (Squidvishuss)\n3. Cat Palmer (Bogue Foundry)\nSandbox VR\nSure, virtual reality is all the rage among the young, but if you haven’t strapped on a headset and some body monitors, are you even living in 2025? Sandbox VR—located inside Murray’s Fashion Place Mall—is a full-body experience with an intensity that must be experienced firsthand to understand. Up to six players can play together, and the games range from Squid Game to UFL, aka Unbound Fighting League. Pick your weapon and go! sandboxvr.com\nBest DOGE Dodge\nUtah Humanities\nIf there’s one thing certain kinds of conservatives hate, it’s everything good in the world, including arts and humanities. You can imagine the shock when Utah Humanities, responsible for top-notch programming throughout the last 50 years, had its funding catastrophically slashed by Elon Musk’s DOGE hit squad. Everyone thought it was the end, but thanks to last-minute donations, they’ve stuck around to 51. A 52nd year isn’t guaranteed, though, so stick it to DOGE and donate.\nBest Literary Resistance\nLet Utah Read\nUtah’s lawmakers have made it their business to censor books for school kids, regardless of the literary merit they’re suppressing. Taking pages right out of the fascist playbook, they’re harming school kids and destroying free speech. Let Utah Read, a coalition of organizations, parents, teachers and librarians, has stood sentinel against the tyranny of the legislature and the defense of the First Amendment of schoolchildren—and everyone—across the state.\nBest Musical Rabbit Hole\nThe Salt Lake Hardcore Archives\nYou’re following YouTube leads. A band called Spittin’ Teeth appears. You dig the music and decide to get educated. With some keystrokes, you find the Salt Lake Hardcore Archive, where the very first band featured is the act that sent you there. But Spittin’ Teeth is but one of dozens of punk bands that’ve called SLC home. Together, they find digital residence at a site dedicated to these oft-mercurial acts, with links to original recordings. slchcarchive.com\nBest New Storyteller’s Stage\nUtah Film Center\nThe Utah Film Center’s new black box theater is a versatile, community-driven space built to support local filmmakers and creatives by hosting screenings, table reads and rehearsals. It’s available to rent and welcomes a wide range of events. Home to internal programming like Black Bold & Brilliant, Tumbleweeds, Through the Lens, and the Utah Queer Film Festival, it’s a safe, inclusive venue for emerging, queer, BIPOC, and youth voices to thrive. utahfilmcenter.org\nMost Promising Community Center\nThe Art Castle (Utah Arts Alliance)\nThe Utah Arts Alliance is working to preserve, renovate and activate the west side’s 120-year-old 15th Ward Chapel (at 915 W. 100 South) to create a community gathering space and an immersive art attraction. Get involved to help bring this vision of performances, concerts and special presentations to life. You can check them out during open hours, view the beautiful Victorian Gothic revival architecture and walk the sculpture garden. utaharts.org/en/art-castle",
  "word_count": 6810,
  "scraped_at": "2026-02-14T12:13:03.786176"
}