{
  "article_id": "bd59c1cd10e5",
  "url": "https://www.dailymail.co.uk/news/article-13875397/Fulham-womens-manager-female-players-Mohamed-Al-Fayed.html",
  "title": "Ex - Fulham women manager says staff made sure female players were never left alone with owner Mohamed Al Fayed after they realised he  liked young , blonde girls  ",
  "date": "20240921T013000Z",
  "domain": "dailymail.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Ex-Fulham women's manager says staff made sure female players were never left alone with owner Mohamed Al Fayed after they realised he 'liked young, blonde girls'\nA former manager of Fulham has revealed that staff made sure female players were never left alone with owner Mohamed Al Fayed.\nThe Egyptian businessman, who has been accused of raping five women, bought the west London club for a reported £30million in 1997, over a decade after he became the owner of luxury retail outlet Harrods.\nBut it was during the early 2000s that staff reportedly became aware that the late billionaire 'liked young, blonde girls', which prompted them to put measures in place to protect some of the female players, according to the BBC.\nGaute Haugenes, who managed the team from 2001 to 2003, told the broadcaster that women were kept away from Al-Fayed to make 'sure that situations couldn't occur'.\nHe added that it was not a 'biggest surprise' to hear of the rape accusations against Al-Fayed, who is also accused of sexual assault by more than 15 women.\nMohamed Al Fayed, who died last year aged 94, is accused of raping and assaulting multiple women during his time as Harrods owner from 1985 to 2010. He is seen here unveiling a statue in tribute to Michael Jackson at Craven Cottage on April 3, 2011\nMohamed Al-Fayed stands in front of the east stand of Craven Cottage, in 1997 - the same year he bought the club\nHaugenes also claimed that his salary was paid by Harrods instead of Fulham FC during his time as manager.\nHe told the BBC: 'When the payslip came from Harrods it was quite strange. Also, the contract said that they could put me in the food shop in Dublin if that was what I wanted. It would never have happened today,' he said.\nFulham FC has announced that it is investigating whether anyone at the club was also a victim of the Harrods owner and invited people to come forward with any information about such allegations.\nA Fulham FC spokesperson said: 'We are deeply troubled and concerned to learn of the disturbing reports following yesterday's documentary. We have sincere empathy for the women who have shared their experiences.\n'We are in the process of establishing whether anyone at the club is or has been affected. Should any person wish to share information or experiences relating to these allegations, we encourage them to contact the club at safeguarding@fulhamfc.com or the police.'\nUnder his ownership they rose to the top half of the Premier League in the early 2000s, peaking in qualification for the Europa League. He sold the team in 2013.\nMultiple women have already come forward to claim Al-Fayed sexually abused them in the Knightsbridge store and at his luxury properties in the UK and on foreign trips abroad.\nIn a bombshell press conference on Friday, lawyers representing some of Al-Fayed's victims confirmed that at this stage they did not represent any women who 'sustained attacks' at Fulham FC.\nLate billionaire Mohamed Al-Fayed has been described as 'a monster' amid claims he raped multiple women working for him at Harrods\nAl-Fayed has been compared to sexual predators Jimmy Savile (left) and Jeffrey Epstein (right).\nElsewhere, Barrister Dean Armstrong KC told the press conference that the case of Al-Fayed 'combines some of the most horrific elements of the cases involving Jimmy Savile, Jeffrey Epstein and Harvey Weinstein'.\nHe said: 'I have many years of practice... I have never seen a case as horrific as this.\n'This case combines some of the most horrific elements of the cases involving Jimmy Savile, Jeffrey Epstein and Harvey Weinstein.\n'Savile because in this case, as in that, the institution, we say, knew about the behaviour.\n'Epstein because in that case, as in this, there was a procurement system in place to source the women and girls - as you know there are some very young victims.\n'And Weinstein, because it was a person at the very top of the organisation who was abusing his power.\n'We will say plainly, Mohamed Al-Fayed was a monster.'\nMore than 100 women have got in contact with the legal team representing some of Al Fayed's accusers since the BBC documentary aired on Thursday evening, barrister Bruce Drummond said.\nMr Drummond revealed on Friday that there have been about 100 enquiries. The team is already representing 37 women.\nSpeaking earlier to reporters from across the global press, he added: 'This is one of the worse cases of sexual exploitation that I and perhaps the world has ever seen.\n'It was horrific, just horrific. It's horrific because of the acts carried out on these women and girls.\n'It was horrific because it was the system that procured them, enabling the abuse of these young women and its horrific, because the effect this sexual abuse and of Harrods' institutional betrayal have had on our clients.'\nIt comes as one of Al Fayed's alleged victims told the press conference how the billionaire businessman was 'highly manipulative' and left her 'petrified' as he abused her.\nIn chilling testimony, the woman - known as only Natacha - said joining Harrods was like 'walking into a lion's den' and said Al-Fayed 'preyed on the most vulnerable'.\nOne of Mohamed Al-Fayed's alleged victims, who went by the name Natacha (pictured), told the press conference the billionaire businessman was 'highly manipulative'.\nBarrister Bruce Durmmond (left) and Dean Armstrong KC, who represented the female former employees of Harrods\nThe BBC documentary says the Egyptian-born businessman - who died in London aged 94 last August - carried out the attacks while Harrods boss between 1984 and its sale in 2010\nBranding Al-Fayed a 'sick predator', she said: 'Mohamed was clever and highly manipulative.\nSpeaking about the alleged abuse she suffered at the hands of Al-Fayed, Natacha continued: 'Mohamed Al-Fayed, a sick predator, lured me in by using the same modus operandi he used time and time again.\n'I was subjected to Aids and STD testing without consent, and now believe in hindsight, I was checked for my purity.'\nSpeaking about what happened in meetings with Al-Fayed, Natacha said: 'These private meetings turned into more of a forced kiss, his hands gripping your face to his lips or pulling you down on his lap, where his hands were free to explore any part of your body that he wished.\n'These incidents lasted seconds, but the fear instilled left me paralysed.\n'Al-Fayed brushed off these moments like they had never happened, but I was always reminded not to mention them to anyone.'\nMr Armstrong KC said it is time Harrods 'took responsibility' and 'set matters right'.\nHe told the press conference: 'We are here to say publicly and to the world, or to Harrods in front of the world, that it is time that they took responsibility, and it is time that they set matters right, and that is something they should do as soon as possible.\n'They need to face up to accept the responsibility, that they have full culpability for the abuse that these women suffered.\n'Today, we are going to set out our claim and how our claim shows an abject failure of corporate responsibility and a failure to provide a safe system of work.'\nDuring the press conference, barrister Maria Mulla told how female workers were tormented and threatened by the billionaire alleged sex pest.\nDean Armstrong KC, who featured in 'Al-Fayed: Predator at Harrods' speaks during a press conference to discuss the involvement of the legal team in the investigation and the legal claim against Harrods\nNatacha, who says she was sexually abused by Al-Fayed, described him as a 'monster'\nGemma, who worked for Fayed between 2007 and 2009, is among those accusing him and featured in a BBC documentary on Thursday evening\nWomen would often have to 'speak in some kind of code' and if female workers ever complained they would 'receive threats along the lines of you will never work in London again', the barrister said as she laid bare the horrifying accusations.\nDescribing the threats, Ms Mulla said staff were told 'I know where you and your family live' by security officials allegedly working for Al-Fayed.\n'Often they would be demoted and false allegations made about them so they would have no choice but to leave Harrods,' she added.\n'Threats were also made about police action by the security team.'\nOne woman who had the 'courage and bravery' to report her sexual assault in a written complaint was threatened hours later.\n'One woman we rep was sexually assaulted and she had the bravery and courage to raise this in a formal written complaint to Harrods.\n'On the same day the head of security, John Macnamara said, 'you are a girl alone in London, someone could jump out the bushes at you or you could have a sudden accident,' Ms Mulla said.\n'She of course did what she was told because she was absolutely petrified.'\nAnother woman tried to resign to 'get away from it', Ms Mulla added, claiming the victim had also been threatened.\nUS lawyer Gloria Allred told the press conference Harrods was a 'toxic, unsafe and abusive environment' under the chairmanship of Mohamed Al-Fayed.\nShe said: 'The allegations against Mohamed Al-Fayed include serial rape, attempted rape, sexual battery, and sexual abuse of minors. They involved doctors administering invasive gynaecological exams as a condition of employment for some of the employees who were targeted by Mohamed Al-Fayed for sexual abuse.\n'The allegations also include the unauthorised disclosure to Mohamed Al-Fayed of the examination results of employees he targeted for sexual abuse.\n'The allegations involve cover-ups, threats and a quarter of a century of sexual abuse by Mohamed Al-Fayed after he purchased Harrods and became its chairman.\nOne of Mr Al-Fayed's accusers, Natacha (right), no surname given, who featured in 'Al-Fayed: Predator at Harrods' is reassured by American Attorney Gloria Allred after speaking during a press conference\nSome of Fayed's assaults are said to have been carried out at his Park Lane property in London\nHarrods (pictured) was an alleged hunting ground for Al-Fayed who targeted 'vulnerable' women before sexually assaulting them\n'Harrods is often referred to as the most beautiful store in the world... many women dreamed of working there, to be associated with this prestigious corporation and to further their careers.\n'However, underneath the Harrods glitz and glamour was a toxic, unsafe and abusive environment.'\nAnd in a bombshell statement, lawyers claimed that further probes had been launched into potential crimes by the retail tycoon at other places he was linked to.\nQuestioned on whether employees at other businesses owned by Al-Fayed, such as Fulham Football Club, were also allegedly subject to sexual abuse, barrister Maria Mulla said: 'Yes, we are aware of allegations that have been made at other places of work.\n'We also represent women who were employed by the Ritz.\n'We don't at this stage represent any women who, for instance, sustained attacks at Fulham Football Club.\n'But our investigations are obviously ongoing into all these entities that he had an involvement in.'\nShe said investigations so far had revealed a 'startling' number of women from Harrods involved in the alleged abuse by the Egyptian.\n'It's highly unlikely that there are not victims out there from these other places of work - wherever he went, there will be victims,' the lawyer told reporters.\nBarrister Dean Armstrong KC told the press conference 'this is and was a systematic failure of corporate responsibility'.\n'And that systematic failure is on the shoulders of Harrods,' he said.\nHe added that compensation from Harrods for women who have claimed sexual abuse against Mohamed Al-Fayed would be 'welcome'.\nIf Harrods feel that they ought to compensate women financially for what they've done and how they failed them, then of course that is something which we would welcome,' he told the conference.\n'But we are not going to sit here and accept any suggestion that we are only interested in money.\n'This is about much, much, much more.'\nAsked about the global scope of the case, barrister Bruce Drummond told the news conference the 'scope of this case is vast' and listed countries were Mohamed Al-Fayed's accusers are from.\nHe said some of the women are from Malaysia, Australia, Italy, Romania, the US and Canada.\nMost watched News videos\n- Extraordinary moment mass brawl breaks out between Brits on flight\n- Finance expert's TV interview interrupted by adorable granddaughter\n- Moment driver veers to target e-bike riders before killing teen\n- Moment Swiss bar fire owners collapse after being confronted\n- Woman kills two while speeding just weeks after driving test\n- Israeli hostage reveals how she survived being tortured\n- Chilling police interview of ISIS fanatic plotting UK attack\n- Astonishing moment a street is swallowed by a sinkhole\n- Deepak Chopra confronted over his relationship to Epstein\n- New video shows man with backpack similar to Guthrie kidnapper\n- Food vlogger dies after 'eating toxic devil crab'\n- Spy cam shows woman on her knees next to Jeffrey Epstein",
  "word_count": 2180,
  "scraped_at": "2026-02-14T14:14:25.502065"
}