{
  "article_id": "bd77a6fb4cfe",
  "url": "https://www.fourfourtwo.com/news/manchester-city-and-arsenal-have-to-deliver-perfection-if-they-want-to-dethrone-chelsea-theyre-going-to-start-like-a-train-wsl-legend-izzy-christiansen-gives-her-verdict-on-the-womens-super-league-season",
  "title": "  Manchester City and Arsenal have to deliver perfection if they want to dethrone Chelsea - I dont think theyre going to need time to bed in with the new manager , theyre going to start like a train  WSL legend Izzy Christiansen gives her verdict on ...",
  "date": "20240920T144500Z",
  "domain": "fourfourtwo.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "'Manchester City and Arsenal have to deliver perfection if they want to dethrone Chelsea - they’re going to start like a train': WSL legend Izzy Christiansen gives her verdict on the Women's Super League season\nThe Women's Super League kicks off tonight - and it's bad news for Arsenal and Manchester City, as Izzy Christiansen thinks Chelsea are going to pick up where they left off\nThe best features, fun and footballing quizzes, straight to your inbox every week.\nYou are now subscribed\nYour newsletter sign-up was successful\nWant to add more newsletters?\nFive times a week\nFourFourTwo Daily\nFantastic football content straight to your inbox! From the latest transfer news, quizzes, videos, features and interviews with the biggest names in the game, plus lots more.\nOnce a week\n...And it’s LIVE!\nSign up to our FREE live football newsletter, tracking all of the biggest games available to watch on the device of your choice. Never miss a kick-off!\nJoin the club\nGet full access to premium articles, exclusive features and a growing list of member rewards.\nWSL legend Izzy Christiansen believes Arsenal and Manchester City have to assume that Chelsea will be “perfect” if they are to end the holders' five-year grip on the Women’s Super League trophy.\nChelsea are entering a new era after long-term manager Emma Hayes departed at the end of last season to join the US women’s national team. She closed out her time at the club by winning a fifth consecutive WSL title – but new coach Sonia Bompastor arrives in England with an accomplished CV herself.\n“From what I’ve seen and heard around Chelsea, I don’t think they’re going to need time to bed in with the new manager,” the former England and Manchester City midfielder told FFT. “I think they’re going to start like a train.”\nChelsea will only be beaten by 'a perfect season' - whether that's from Manchester City or Arsenal in the WSL\nThe Women’s Super League season begins tonight as Chelsea host Aston Villa before Manchester City visit Arsenal on Sunday lunchtime, live on Sky Sports. City are looking for redemption this season after losing the title on goal difference.\n“Manchester City have to be where they were last season, but be slightly better. They have to deliver that perfect season, which they came so close to doing last season.\n“Arsenal are an interesting one as well. There’s quite a bit of pressure on Jonas (Eidevall). He’s been backed significantly by the club in the last two to three seasons, in every transfer window, with players who suit his style of play.\n“Everything feels at Arsenal like it's culminating towards a title-winning season, but they are going to have to contend with Chelsea, City, and possibly Manchester United.”\nThe best features, fun and footballing quizzes, straight to your inbox every week.\nManchester United, meanwhile had a disappointing season last year. They finished fifth, behind Liverpool, Arsenal, Chelsea and Manchester City, although they did win a first major trophy by beating Tottenham in the FA Cup final.\n“The title needs to be a secondary aim to finishing third for United,” says Christiansen. “The minimum requirement for them has to be top three. I’m looking at their squad and thinking they have some really good players there. Everyone speaks about how big Manchester United is as a club. There is a level of expectation there.”\n“The challenge for Marc Skinner is to bring it all together. Make a team that’s really hard to beat and overturn the deficits they found themselves in last season.”\nSky Sports commentator Pien Meulensteen is looking forward to another season of the WSL.\n“What I love about covering the WSL with the team we’ve got, is that it’s a really fun environment to be in,” she told FFT.\nVIDEO Why Lauren James Will Change Women's Football Forever\n“When you look at the players that are coming into the WSL now, you’re getting superstars.\n“We’re getting more fans coming in that don’t know much about women’s football but are starting to learn about the hype. I’m hoping that the people that are new to women’s football stick with the journey and enjoy what we are putting out on Sky Sports.”\nWatch the Women's Super League fixtures this season on Sky and NOW, kicking off this Sunday with Arsenal vs Manchester City\nJessy Parker Humphreys is a freelance women's football writer. A Chelsea fan, Jessy has been following the women's game since being taken to the 2003/04 FA Cup final at Loftus Road and seeing Arsenal thrash Jessy's local side Charlton. Fortunately, Arsenal don't win quite as much as they used to – although Jessy hopes Charlton will also be back at the top of the women's game one day.",
  "word_count": 793,
  "scraped_at": "2026-02-14T12:22:57.464450"
}