{
  "article_id": "bd94f83df12d",
  "url": "https://www.si.com/college/alabama/bamacentral/national-championship-game-edition-all-things-cw",
  "title": "National Championship Game Edition : All Things CW",
  "date": "20230107T123000Z",
  "domain": "si.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "National Championship Game Edition: All Things CW\nIn this story:\nThis is the complied version of the All Things CW notes column by Christopher Walsh which appeared in five part this week, with the latest on the Alabama Crimson Tide.\nIt actually began with a long-snapper.\nNick Saban always has what he calls the 24-hour rule regarding games, giving everyone a chance to enjoy the wins a little, or get the losses out of their systems, but then it's always time for what's next.\nConsequently, when the Alabama Crimson Tide locker room was open following the Sugar Bowl, the only time reporters had access to the majority of players this season, the standard response from those asked about what may be next was \"24-hour rule.\"\nThe calm before the onslaught of announcements lasted almost exactly that long.\nSome may have waited until Will Anderson Jr., Jahmyr Gibbs and Bryce Young held their press conference with Nick Saban to declare their intentions. Others may have simply decided to wait until after the New Year's holiday.\nLong-snapper Gabe Pugh was the first, though, posting on Sunday night that he was leaving.\nNow comes the hard part, keeping up with all the changes, which BamaCentral will do with its eligibility tracker.\nNFL teams have office walls dedicated to following player movement, including in their draft war rooms, and now colleges must as well. Rosters have always been in flux, but nowadays it's nearly half the team every year regardless of whether there's a new head coach.\nIncluding a transfer and two junior-college additions, Alabama has 28 incoming players, including a few early enrollees who are already on campus. That's one-third of the roster.\nIt already has 24 departures, with more on the way.\nNo one's questioning if or how Saban will get under the 85-man limit any more, which for years had been the case. The coach has always keep scholarship information close to the vest, not to tip his hand, and continually added players in anticipation of eventual departures.\nYet despite the regular turnovers of players and coaches, Alabama has remained a perennial power. Saban's had unparalleled success, and his ability to successfully recruit and adapt has kept it in the national championship hunt each and every season.\nNowadays, though, the only thing anyone's wondering is how close Alabama might have to a full 85 when it opens the 2023 season Sept. 2 against Middle Tennessee State at Bryant-Denny Stadium.\nThe same is true of nearly every other program even though there are scores of available players who never make it out of the transfer portal. The NCAA needs to adjust its roster regulations to make things a little easier on coaches, but it appears to be way down the priority list.\nThe following list will only grow.\nDeclared for 2023 NFL Draft (12)\nQB Bryce Young\nRB Jahmyr Gibbs\nTE Cameron Latu\nOL Emil Ekiyor Jr, Tyler Steen\nDL DJ Dale, Byron Young\nLB Will Anderosn Jr., Henry To'oTo'o\nS Jordan Battle, S Brian Branch, S DeMarcco Hellams\nTransferred (13)\nWR Aaron Anderson, JoJo Earle, Traeshon Holden, Christian Leary\nRB Trey Sanders\nOL Tanner Bowles, Tommy Brockermeyer, Javion Cohen, Damieon George, Amari Kight\nDL Braylen Ingraham\nCB Khyree Jackson\nK Jack Martin\nCoaches (1)\nCharles Kelly: Hired as Colorado defensive coordinator.\nSEC Proves Once Again It Can Beat Up Your Conference\nBowl play has wrapped up minus the national championship, and the Southeastern Conference left a lasting impression.\nThree of the conference's final games included Alabama crushing Big 12 champion Kansas State in the Sugar Bowl, LSU absolutely obliterating Purdue 63-7 in the Citrus Bowl, and Mississippi State winning in maybe the most Mike Leach-way possible, by taking its first lead with four seconds remaining and then scoring again on the kickoff.\nThis is on top of top-seeded Georgia winning in the College Football Playoff. The Bulldogs are favored by 13 points over surprising TCU to repeat.\nAs a result, the league that had the most teams in bowl games with 11, will finish with the most wins. If Georgia wins, the SEC will have the best winning percentage among the Power 5 conferences.\nSEC (11)\nRecord: 6-5\nLas Vegas Bowl: No. 14 Oregon State 30, Florida 3\nGasparilla Bowl: Wake Forest 27, Missouri 17\nLiberty Bowl: Arkansas 55, Kansas 53 (3OT)\nTexas Bowl: Texas Tech 42, Ole Miss 25\nGator Bowl: No. 21 Notre Dame 45, No. 19 South Carolina 38\nOrange Bowl: No. 6 Tennessee 31, No. 7 Clemson 14\nSugar Bowl: No. 5 Alabama 45, No. 9 Kansas State 20\nMusic City Bowl: Iowa 21, Kentucky 0\nCFP Semifinal: No. 1 Georgia 42, No. 4 Ohio State 41\nReliaQuest Bowl: No. 22 Mississippi State 19, Illinois 10\nCitrus Bowl: No. 17 LSU 63, Purdue 7\nThis is despite some of its teams having a lackluster showing. Authorities are still searching for the MIA Kentucky team that failed to show up in the Music City Bowl, and Ole Miss wasn't the same after losing to the Crimson Tide. The Rebels finished by losing four straight, and five of its last six.\nThe less SEC teams were playing for, the worse they did, which contributed to its 1-4 start in bowl games. The lone win required triple overtime by Arkansas, which had finished fifth in the Western Division.\nIt's not like conference bragging rights were up for grabs, not really. Not considering how it's dominated the national title picture.\nWith Alabama leading the way, the SEC has appeared in six of the seven CFP National Championship Games, winning four.\nBut the College Football Playoff opted to reward the Big Ten with two playoff bids this year, and while the semifinals were dramatic as both games went down to the wire, the conference was promptly dispatched.\nThe Big Ten has gone 1-6 in the playoff since the 2014 national championship win for Ohio State, before Nick Saban and other coaches figured out that it needed to be approached differently.\nConference (Bowl teams), Record, Winning pct.\nMAC (6) 4-2 .667\nIndependents (5) 3-2 .600\nAmerican (7) 4-3 .571\nACC (9) 5-4 .556\nBig Ten (9) 5-4 .556\nSEC (11) 6-5 .545\nC-USA (6) 3-3 .500\nMountain West (7) 3-4 .429\nPac-12 (7) 3-4 .429\nSun Belt (7) 3-4 .429\nBig 12 (8) 2-6 .333\nSo how good was the SEC this year?\nConsider this: If you took the top four SEC teams and lined them up against the top four teams from the rest of college football per the final College Football Playoff rankings, similar to what's done with a conference showdown in basketball, it would look like this:\n- 1 Georgia vs. 2 Michigan\n- 5 Alabama vs. 3 TCU\n- 6 Tennessee vs. 4 Ohio State\n- 17 LSU vs. 7 Clemson\nIf you even have to pause and think about the SEC's chances in that kind of matchup, the point is made.\nEven so, would people bet on the SEC to win the majority of those games? Absolutely.\nThis Week is Showing Us The Best and Worst of College Football\nWe normally reserve \"The Good, The Bad and The Ugly\" for football reviews, but it seems appropriate this week, the first of 2023.\nThe Good\nWe're a little late with this, but Mississippi State honoring late coach Mike Leach by wearing a pirate flag on one side of the helmets, instead of the usual school logo, in the ReliaQuest Bowl at Tampa, Fla., wasn't just good, it was awesome.\nThe Bulldogs could have stayed home while mourning their head coach, but the team was adamant that it wanted to play the game against Illinois.\n“Mike would be pissed if we didn't play,” a source told Sports Illustrated’s Ross Dellenger in December. “The bowl game is at a stadium with an actual pirate ship in it.”\nWe had mentioned before that the ending may have been the most Leach-thing ever, but did you notice that the player who scored the touchdown on the circus-like final play was former Alabama defensive back Marcus Banks?\nThe Bad\nNCAA Transformation Committee’s report includes a lot of good recommendations that will probably happen quickly (including requiring all Division I schools to provide medical coverage for athletically-related injuries for a minimum of two years following graduation or the completion of participation), but the one everyone is focussing on is the expansion of championship tournaments to incorporate 25 percent of teams.\nNot only will this be the mantra for expanding the postseason in numerous sports (and part of how football will quickly go from 12-team playoff to 16), but opens the door to including 90 teams in March Madness.\nConsider me a purist when it comes to the men's and women's basketball tournaments in that I didn't even like the change from 64 because it made some teams play an extra game, or have the stigma of the \"play-in\" game. Moreover, the more teams added the more the field is watered down.\nBut if there's a chance to make more money the NCAA is going to do it, that's just reality nowadays. So the guess here is that the tournaments won't expand for a while, but down the road, maybe when the television contracts all expire in 2032.\nIn the meantime, we get to look forward to years of debate about \"What's best for the sport,\" when we all know it's just another means for making some extra money.\nThe report will go to the Division I board of directors for consideration at the 2023 NCAA convention in San Antonio next week.\nThe Ugly\nJimbo Fisher has Bobby Petrino as his offensive coordinator and D.J. Durkin as his defensive coordinator. Plus Auburn has Hugh Freeze as a head coach.\nThe SEC needs to change its slogan from \"It Just Means More,\" to \"It's All About Winning.\"\nWill Alabama's New Coach Bring Back Gymnastics Fans?\nAlthough gymnastics is a sport that relies on precision, this is one time that just getting close would not only be a good thing, but could be very telling about the program's future.\nFriday night, the Ashley Johnston coaching era will officially begin with the Alabama Crimson Tide, as Michigan State will visit Coleman Coliseum to open the 2023 season.\nRoughly 24 hours beforehand, seat availability was listed as low in every section minus one on the official Alabama ticket website. That's despite students still being on winter break.\nWhile the Crimson Tide saw attendance drop last season, averaging 9,551 fans per meet, LSU led the nation in average attendance for the first time in school history, snapping Utah's streak that dated back to 2004. The Tigers averaged 11,691 across their five home meets.\n2022 Alabama Gymnastics Attendance\n- Kentucky 10,335\n- UNC/Western Michigan 8,856\n- Georgia 10,838\n- Missouri 8,623\n- Arkansas 9,101\nIt wasn't that long ago, that Alabama was challenging Utah for the top spot on a regular basis.\nLast season's attendance average was the 20th best in program history. Not including the 2021 season when Alabama had an attendance limit of 2,055, it's the first time the Crimson Tide hadn't averaged at least 10,000 since 2004.\nAlabama had drawn at least 10,000 fans in 38 of its 42 home meets, dating back to March 2012. The Crimson Tide had ranked among the top five nationally for 14 consecutive years.\nTop 5 Alabama Attendance Averages\n- 13,786 2010\n- 13,422 2013\n- 12,827 2012\n- 12,826 2014\n- 12,730 2011\nSo setting the right tone against the Spartans will be important.\nIn addition to having a new coach, the Crimson Tide is ranked No. 7 in the Women’s Collegiate Gymnastics Association (WCGA) preseason coaches poll — which is exactly where it finished at the NCAA Championships (the Spartans are No. 12).\nBut the Crimson Tide definitely has the potential to move up.\nDespite the coaching change, no one transferred out, and none of the six incoming freshmen class went elsewhere. Johnston has inherited a deep roster, which will give her a lot of options regarding rotation spots.\nAlabama returned 18 of its 24 routines from last year's team, including All-Americans Luisa Blanco, Shallon Olsen, Makarri Doggette and Lilly Hudson.\nWhat will interesting to see is how much of Johnston's personality and, more importantly, driven nature, will immediately rub off on her new team.\nJohnston, who went by the name Priess as a student, wasn't just a champion gymnast before and with the Crimson Tide (2009-13). To borrow a word from someone associated with the program back then, she was \"cutthroat\" as a competitor.\nSee Also: Meeting Every Moment: Alabama Gymnastics 2023 Season Preview\nHas Georgia Caught Alabama Atop College Football?\nWe're a couple of days away from the national championship game, and with Georgia heavily favored to beat TCU and repeat like Alabama did in 2011-12, the question about the Bulldogs' status atop college football is already being asked.\nSome are even suggesting that Georgia has already surpassed Alabama, which is jumping the gun a bit as the title game hasn't even been played yet.\nKirk Herbstreit, who will call the championship for ESPN on Monday (6:30 p.m. CT), was even asked about it during a press conference this week in Los Angeles.\n\"I think Alabama is still Alabama,\" he said. \"I know they've been off here or there a tick here. They lost in the last play of the game to Tennessee, last play of the game to LSU. I'm still a huge believer in Saban and Alabama.\n\"But I know what you're saying because I agree with you, and I do think that Georgia... I already feel that Georgia's right there.\"\nThere's no doubt that what Kirby Smart has done, taking from what he learned under Saban to his alma matter, has been impressive. He's recruited well, players are now developing in the program for the next level (which was a criticism during his first few years in Athens), and there's no knocking the impact of potential back-to-back titles.\nIs it as impress as what Saban's done at Alabama? No. At least not yet.\nWhen doing research for various books I've authored it became apparent that the standard for a college football program to truly be a dynasty it had to win three national titles over a six-year span, although it could always add on to it.\nI wrote that during Alabama's ascent, including in \"Nick Saban vs. College Football\" nearly a decade ago, and nothing has altered my way of thinking about dynasties ever since.\nConsequently, the Crimson Tide's ongoing dynasty is easily the longest in college football history.\nShould Georgia beat TCU it'll be about as close as possible, especially since it lost to Alabama in overtime in the 2018 National Championship Game, but not quite having reached dynasty status.\nCritics will claim the Bulldogs are close enough, but overtimes matter. A two-point conversion in overtime is the reason why Alabama didn't make the College Football Playoff this year.\nPlus for every argument one can make for the Bulldogs to be an exception to the rule, there's a counter claim like the Crimson Tide won the SEC Championship Game last year, and might had won the rematch had its starting wide receivers not gotten hurt.\nYou can't get into what-if scenarios when it comes to history. It's usually pretty clearcut.\nAsk Clemson.\nWe appeared poised for another Alabama vs. Georgia showdown this year, yet the Crimson Tide didn't quite cooperate en route to what will almost certainly be a No. 5 finish in the AP Top 25.\nWith it, Alabama has had just one finish outside of the top five since 2013. Georgia has been twice outside of the top five since 2017.\nWe might soon be down to splitting hairs, but there is a difference. Besides, how many national championships has Saban won?\nThe great thing about it is we're still on target for more showdowns, and for the debate to go for years to come as these two programs clearly stand out from the rest of college football.\nWe also have this national championship game to enjoy as well.\nSee Also:\n2022-23 Alabama Crimson Tide Football Transfer Tracker\nThe Biggest NFL Draft Surprises for Alabama Football: Just a Minute\nAll Things Bama Podcast: NFL Draft Bound\nKeeping Track of Which Alabama Players Have Declared for 2023 NFL Draft\nChristopher Walsh is the founder and publisher of Alabama Crimson Tide On SI, which first published as BamaCentral in 2018, and is also the publisher of the Boston College, Missouri and Vanderbilt sites . He's covered the Crimson Tide since 2004 and is the author of 27 books including “100 Things Crimson Tide Fans Should Know and Do Before They Die” and “Nick Saban vs. College Football.” He's an eight-time honoree of Football Writers Association of America awards and three-time winner of the Herby Kirby Memorial Award, the Alabama Sports Writers Association’s highest writing honor for story of the year. In 2022, he was named one of the 50 Legends of the ASWA. Previous beats include the Green Bay Packers, Arizona Cardinals and Tampa Bay Buccaneers, along with Major League Baseball’s Arizona Diamondbacks. Originally from Minnesota and a graduate of the University of New Hampshire, he currently resides in Tuscaloosa.\nFollow BamaCentral",
  "word_count": 2877,
  "scraped_at": "2026-02-14T13:35:14.103458"
}