{
  "article_id": "bda336a234df",
  "url": "https://variety.com/lists/legal-impact-report-2025-hollywood-top-attorneys/",
  "title": "Variety 2025 Legal Impact Report : Hollywood Top Attorneys",
  "date": "20250409T161500Z",
  "domain": "variety.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Like everyone else, the entertainment attorneys honored on this year’s Legal Impact list — who’ll be gathering at the Variety Power of Law Breakfast, presented by City National Bank, on April 9 — are dealing with progressively more jarring cycles of disruption. Still, they keep working on behalf of their clients. The deals may be slightly less plentiful and, on balance, less rich for those on the transactional side, but litigators are looking at increasingly full calendars, thanks in part to a new administration in Washington, D.C., determined to take a wrecking ball to the status quo.\n-\nLesley Freeman\nChief legal officer\nAGBO\nFreeman had been chief legal officer at MGM, agreeing to stay for two years after the deal with Amazon, even though Amazon was “not the environment I wanted to work in,” she says. Last summer, Freeman joined Joe and Anthony Russo’s AGBO, overseeing all aspects of the studio’s business and legal affairs, while making sure they are prepared to produce the next “Avengers” movies and further develop original IP. “It was the opposite environment, a super entrepreneurial company,” she says. “With a much smaller team you field everything all the time and exercise skills you forgot you had.”\nAdvice to younger self: Always ask the question. “Don’t be afraid to ask for clarification or to for clarification or to confirm you’re thinking about things the right way,” she says.\n-\nChris Spicer, Marissa Román Griffith, Alissa Miller and Vanessa Roman\nPartners\nAkin Gump Strauss Hauer & Feld\nAkin’s team spent 2024 neck-deep in financing deals, advising MUFG bank on its $70 million production loan for the feature “Greenland: Migration”; Miramax on distribution and financing of “4 Kids Walk Into a Bank”; and HarbourView Equity Partners regarding its investment in Mucho Mas Media and financing of concert film “Usher: Rendezvous in Paris.” They also repped production companies CAT5 and Black Bear on the upcoming feature “A Working Man,” while advising Comerica Bank on the film’s financing. Says Spicer: “With all the doom and gloom and the strikes and the content spend not being high, we’ve seen at least a few instances of new players entering into the space.”\nAdvice for new entertainment investors: “You don’t know what you don’t know,” says Spicer. “You’ve got to talk to a law firm like us, or one of our peer firms, not your normal lawyer that might not be versed in film and television, because it’s such a unique asset.”\n-\nGrace Del Val\nChief operating officer and general counsel\nBad Robot\nDel Val thinks it was watching the original “Matlock” TV series starring Andy Griffith that first inspired her to dream of becoming a lawyer when she was 4 years old. Today, she’s living that dream with J.J. Abrams’ production company Bad Robot, where she oversees all legal affairs and dealmaking, including corporate transactions, encompassing film, TV, animation, live theater, games, audio and digital. In the past year, she worked on Apple TV+’s “Presumed Innocent,” Amazon’s “Batman: Caped Crusader” and numerous documentaries, including “The Blue Angels” and “Elizabeth Taylor: The Lost Tapes.”\nBeing authentic: “Often, I’m in spaces where I’m one of one, whether I’m the only woman or I’m just a lot younger than people in equivalent jobs, and it just takes a lot of bravery to be yourself,” she says.\n-\nCarolyn Hunt\nPartner\nBarnes & Thornburg\nHunt says it’s hard to get all the pieces together for a film, from talent to financing, so when things fall into place, “you have to be able to close quickly.” She should know, having closed a flurry of film and TV production loans and/or distribution deals in recent months for entities including Peachtree Media Capital (“We Bury the Dead,” “The Surfer,” “Motor City”), Western Alliance Bank (“Hotel Tehran,” “Cutlers Court”), Magenta Light Studios (“Deep Water”), the Bank of Montreal (“Bad Apples”) and the Pechanga Band of Indians (“People of the West”).\nRevenge of the genre movie: “All of a sudden, we’ve been seeing these old school, mid-budget theatrical films,” she says. “There have been horror, thrillers and action movies that are fun to watch in theaters.”\n-\nStephen Weizenecker\nPartner\nBarnes & Thornburg\nBased in Atlanta, Ga., Weizenecker advises on film, TV and video game financing, with an emphasis on harnessing production incentives in the state and around the globe. “You don’t know how your films are going to perform, you don’t know how your video game will do, but if you have a production incentive, you know that you’re going to get some return on that investment,” says Weizenecker, whose clients include Peachtree Media Capital, Magenta Light Studios and Lionsgate.\nSky not falling on film and TV production: “We took a few punches, but the interest on the consumer side is at the exact same level, and we have to feed the proverbial beast that we’ve created,” he says.\n-\nBlair Berk and Andrew Brettler\nPartners\nBerk Brettler\nBerk and Brettler are go-to lawyers for celebrities in trouble. Berk handles criminal law, Brettler the civil side, but often they work together. When Shohei Ohtani’s interpreter was caught embezzling the Dodgers star’s money to bet on sports, Ohtani turned to Berk and Brettler to keep his name clean. Together, they’re repping former Red Hot Chili Peppers guitarist Josh Klinghoffer, who’s facing criminal charges and a lawsuit in connection with a fatal car accident. Brettler thinks he got the better end of his partnership with Berk. “Her bedside manner with clients is second to none,” he says. “I’ve never seen such a fantastic attorney also be able to speak with such empathy and compassion.”\nCrisis management: “It’s really important to stay cool under pressure,” says Brettler. “For the sake of the client, obviously, but also for yourself as a professional, because we do take on a lot of our clients’ burdens.”\n-\nJohn V. Berlinski, Julia B. Cherlow, Kimberly A. Meyer and Ekwan E. Rhow\nPartners\nBird, Marella, Rhow, Lincenberg, Drooks & Nessim\nThe public only sees the tip of the vast iceberg of this Bird, Marella quartet’s work. The confidential below-the-surface part is often arbitration and/or disputes over profit participation and residuals. The public portion of their work is consequential, too. Berlinski and Cherlow are the attorneys for Brad Pitt in his company’s dispute with Angelina Jolie over the ownership of French winery Chateau Miraval, while Berlinski and Meyer represent Scarlett Johansson in her dispute with OpenAI for allegedly appropriating her voice without permission while Rhow is the trial lawyer for producer Roy Lee, who is facing lawsuits from a former business associate, tobacco heir John P. Middleton. “My clients may be dramatic in the films and television series that they appear in,” says Berlinski, “but I have been very fortunate to have clients who are extremely logical, smart and strategic.”\nOverrated: “Frequent flier programs,” says Berlinski.\n-\nJacki Granet\nPartner\nBlaker & Granet\nAn immigration law expert, Granet helps secure visas, working for individual stars like actor Damson Idris, as well as companies such as Anonymous Content and Skydance. The Trump administration is making her job more challenging, with talk of closures for consulates abroad (where people can begin the paperwork process) and a reduced government workforce domestically for Granet to work with. Costs are rising, service is diminishing and wait times for visas are increasing, she says, which is a major issue for the entertainment industry. “The name of the game now is chaos — let’s make this as difficult as possible,” she says. “I think it will get worse.”\nSurvival tactic: Pause Studio in West Hollywood for contrast therapy, a sauna and cold plunge combo.\n-\nKristina Royce, Marilyn Chinitz and Brett Ward\nPartners\nBlank Rome\nAs divorce attorneys, Royce, Chinitz and Ward are not immune to showbiz trends like the current production slowdown. “A trend in any direction leads to divorce,” says Ward, whether it’s people flush with cash wanting to leave their current lives or those experiencing hard times seeking to escape their misery. What makes them stand out, he says, is that unlike most matrimonial attorneys, they’re top litigators working for a big firm. And they work with very big names, most of which they can’t disclose publicly. Royce repped Arnold Schwarzenegger in his divorce from Maria Shriver, and Chinitz’s clients have included Tom Cruise, Wendy Williams and Michael Douglas. New York-based Ward reps model and actress Emily Ratajkowski, along with other celebrities, athletes and high-net-worth individuals.\nOnly in Hollywood: In most divorces, people fight over the custody of their children and sometimes a beloved pet. “In Hollywood cases, we see people fighting over the PR person,” says Ward. “I’m not joking.”\n-\nLeigh Brecheen, Dave Feldman, Stephen Breimer and Richard Thompson\nPartners\nBrecheen Feldman Breimer Silver & Thompson\nWith the copyright to Philip Barry’s “Holiday” set to expire, Breimer worked with the late author’s estate to commission Richard Greenberg to write a new version of the play, set to premiere at Chicago’s Goodman Theatre in 2026, creating new IP for the family to exploit for decades to come. It’s just one example of this quartet’s innovative efforts to help clients control and monetize their creative assets. Brecheen, Breimer and Thompson cut a FAST channel deal for Tony Robbins and an agreement to establish the Pee-wee Herman Museum, while Feldman brokered an expansion of Keegan-Michael and Elle Key’s “History of Sketch Comedy” and an AI deal for content creator Young Hollywood. Brecheen and Breimer also rep a wide range of comedic talent, negotiating new standup specials for Marc Maron and Iliza Shlesinger for Amazon and Netflix, respectively, and TV show ownership rights for John Oliver and Conan O’Brien.\nOnly in Hollywood: “… does it take at least 20 emails to set up a conference call,” says Breimer.\n-\nJeff Cohen and Jonathan Gardner\nCo-founders\nCohen Gardner\nGardner’s first memory of Cohen is when he walked into their offices on the Universal lot, where they worked as in-house attorneys, and handed him a copy of “What Makes Sammy Run?,” Budd Schulberg’s classic novel about an amoral Hollywood climber. Fortunately, it didn’t scare Gardner off, and the pair eventually teamed to launch their now-23-year-old boutique firm. In recent months, Gardner has cut deals for writer/directors Ryan Coogler (Warner Bros.’ “Sinners”), Megan Park (Amazon series “Sterling Point”), Ava DuVernay (new Netflix doc), Boots Riley (“I Love Boosters”), Bong Joon Ho (untitled animated feature) and Carmen Emmi (“Plainclothes”), while Cohen, a onetime child actor, has brokered pacts for Michelle Yeoh (Amazon’s “Blade Runner” series, Paramount+’s “Star Trek: Section 31”), Lil Rel Howery (directorial debut, “Haunted Heist”) and Ronny Chieng (Netflix special “Love to Hate It”), as well as his sister, screenwriter Eydie Faye (Disney+’s “Camp Rock 3” and “The Slumber Party”) and his “The Goonies” co-star Ke Huy Quan (“With Love”).\nDealbreaker: “Wine in plastic cups,” says Gardner.\n-\nBobby Ghajar\nPartner\nCooley\nGhajar leads the team defending Meta in a class action lawsuit over accused copyright infringement via AI technology. He says that the motions that he has won so far are “creating precedent within the industry.” He has also represented Kim Kardashian in a lawsuit filed by the Judd Foundation and in a trademark infringement case challenging her SKKN BY KIM beauty line.\nNecessary evil: “Micromanaging my own time to ensure I get the most efficiency out of every 10-minute chunk of my day,” says Ghajar. “It isn’t only way I can get through my job, maintain my friendships, my family life, coaching for my kid’s basketball and soccer teams, and then my own fitness and well-being.”\n-\nNeema Sahni, Ashley Simonsen, Jonathan Sperling and Hardy Ehlers\nPartner; co-chair, entertainment and media industry group; co-chair, commercial litigation practice; co-chair, music industry group; vice chair, sports industry group\nPartner\nPartner; chair, music industry group\nSpecial counsel\nCovington & Burling\nCovington’s litigators often take on cases arising from technology and the issues that it spawns. They rep-\nresented Spotify when Drake accused the streamer of illegally trying to promote Kendrick Lamar’s diss track “Not Like Us,” leading to Drake withdrawing a discovery petition. When Netflix was sued by an Indian director for copyright infringement over “Squid Game,” Covington filed motions to dismiss. They also represent Meta in more than 2,000 lawsuits filed by 35 state attorneys general, school districts and parents of teenage social media users, which has led to the dismissal of some cases and the withdrawal of others. “We’re very proud … of representing so many clients with cutting-edge technology,” says Simonsen. “You have an opportunity to confront new issues and therefore to bring innovative thinking to bear on legal strategies.”Advice to younger self: “Embrace the opportunities that being a younger lawyer can present when it comes to representing technology,” says Simonsen.\n-\nFrederick Bimbler, Susan Bodine, Daniel Sheerin and Chase Turner\nPartner\nPartner\nPartner\nSenior associate\nCowan, DeBaets, Abrahams & Sheppard\nBodine and Bimbler are based in New York and Sheerin and Chase in Los Angeles, but this bi-coastal team works so closely they could be in the same location. Whether representing private equity firms in purchasing film libraries, investing in literary properties or structuring deals around IP revenue streams, they collaborate to ensure every aspect of each agreement is fully addressed. While the division of duties varies by case, Bodine and Sheerin typically focus on the financial side of business. In the past year, the team advised producers Frida Torresblanco and Eric Laufer in launching Hangtime International Pictures, which, in 2024, produced “The Stolen Girl” and “The Night Manager.” Meanwhile, Bimbler, Sheerin and Chase represented Red Seat Ventures in securing numerous podcast and TV deals for its roster of top conservative media personalities.\nNo such thing as a crazy clause: “Those [clauses] are important to make sure the artist is in a comfortable creative environment where they’re ready work,” says Bimbler. “No matter what a studio or production company might think, it’s really about getting the best performance out of them.”\n-\nNicolas Jampol, Ambika Kumar, Kelli Sager and Jonathan Segal\nPartners\nDavis Wright Tremaine\nThe Davis Wright Tremaine quartet has been on the frontline of the culture wars, with notable battles that include a high-profile appearance before the Supreme Court representing TikTok users trying to halt the government shutdown of the app. The case was led by Kumar, who’s won multiple online speech cases, including a recent Ninth Circuit appeal for LGBTQ dating app Grindr involving Section 230 of the Communications Decency Act. Sager earned dismissal of defamation claims against Warner Bros. Discovery, the Los Angeles Times and MailOnline and served as lead counsel representing Paramount in a lawsuit filed by actor Barry Tubb alleging right-of-publicity violations and other claims regarding “Top Gun: Maverick,” while Segal helped foil an attempt to restrain distribution of the documentary “Orgasm Inc: The Story of OneTaste,” and Jampol successfully defended M. Night Shyamalan and the writer and producers of the series “Servant” in an $81 million copyright-infringement lawsuit.\nThese days …: “There are more docudramas and documentaries being produced and more claims related to them,” says Jampol, “especially defamation claims and some about privacy and right of publicity.”\n-\nNina Shaw and Christopher Namba\nFounding partner\nAssociate\nDel Shaw Moonves Tanaka Finkelstein Lezcano Bobb & Dang\nShaw’s unique lot in life was driven home to her recently when a friend of her 12-year-old granddaughter expressed amazement that she knew Miss Janine from ABC’s “Abbott Elementary,” who’s played by her client Quinta Brunson. In recent months, the four-decade-plus legal vet has also reached across the generational divide in her firm, collaborating with associate Namba on deals for Lupita Nyong’o (Christopher Nolan’s “The Odyssey”), Jurnee Smollett (starring role in the Apple TV+ series “Firebug”) and Ji-Young Yoo (Sony Animated feature “K-Pop: Demon Hunters”). On her own, Shaw brokered pacts for Brunson (Universal feature “Par for the Course”), Ayo Edebiri (Luca Guadagnino’s “After the Hunt”) and filmmaker Raoul Peck (documentary tentatively titled “The Hands That Held the Knives”).\nPersonal motto: Don’t think you’re an imposter. “There’s no one from my neighborhood who’s here,” says Shaw, a native of New York’s Harlem. “So I always remember that I had to do a lot to be here.”\n-\nJeffrey Finkelstein\nPartner\nDel Shaw Moonves Tanaka Finkelstein Lezcano Bobb & Dang\nWorking in accounting for Spelling-Goldberg Prods. post-undergrad, Finkelstein tried break in as a writer, but when they were unable to shoot his “Fantasy Island” script, he turned his attention to law school. Thirty-seven years into his career as an attorney, he’s cutting deals for clients including Laurence Fishburne (Off-Broadway show “Like They Do in the Movies”), director John Lee Hancock (AMC series “The Talamasca”), producers Eric and Kim Tannenbaum (multi-year overall with 20th Television) and Paul Reiser (feature dramedy “The Problem With People”). He also handles all unscripted development and production legal work for MediaPro Studio U.S.\nThese days …: “Our industry is so challenged with transition and upheaval that we have to be as imaginative in our dealmaking as our clients are in their creative,” he says.\n-\nTom Ara\nPartner; global co-chair, media, sport and entertainment sector\nDLA Piper\nAra and his DLA Piper team made news over the last year with the deal that sold Caryn Mandabach Prods. to French company Banijay. “As lawyers, we are defined by the quality of our clients,” says Ara, “and [Mandabach] is as quality as they come.” The team also brokered animation studio Titmouse’s eight-figure renewal with Netflix and two deals with Korean ties, CJ ENM’s pact with AppleTV+ for the pop song battle series “KPopped” and streamer Coupang Play’s acquisition of rights to English Premier League and FA Cup soccer.\nKey ingredients to a great client relationship: “You have to believe and trust in your client, and they have to believe and trust in you,” he says. “I have to be drinking the Kool-Aid.”\n-\nBenjamin Mulcahy\nPartner; chair, national advertising team\nDLA Piper\nMulcahy handled Amazon’s $21 billion agreement to acquire global streaming rights to NBA games, a deal he calls “a highlight of my career.” The pact is expected to prod the NFL to opt out of its own lucrative rights deals and seek larger sums, which could shake up TV in unforeseeable ways. Mulcahy also led the team making TCL Technologies’ deal with the International Olympic Committee to become one of just 12 sponsors in the Olympic Partners (TOP) program. DLA Piper previously negotiated two of the remaining 11.\nWhat I love about my work: “I’m personally interested in technology and entertainment and pop culture and sports, so the ability to combine those personal interests with what I do for a living is really a privilege,” he says.\n-\nLisa Callif and Chris Perez\nPartners\nDonaldson Callif Perez\nThis duo has expertise spanning everything from financing to fair use, with an emphasis on the unscripted space. Callif has been cutting deals for production companies including Josh and Benny Safdie’s Elara Pictures (Max docuseries “Pee-wee as Himself”) and the documentary division of Ben Affleck and Matt Damon’s Artists Equity. Perez specializes in clearance rights issues for documentaries, features and series like “The Synanon Fix.” He also repped Glen Zipper’s Zipper Bros. Films and Sean Stuart’s Sutter Road Picture Co. on projects such as “Elizabeth Taylor: The Lost Tapes” and “Charlie Hustle & the Matter of Pete Rose.”\nPassé: Bullying. “Lawyers are much more cordial nowadays,” says Callif. “It’s not about being the biggest voice in the room; it’s about getting a deal done.”\n-\nMichael Sherman and Christian Simonds\nPartners\nEisner\nThis duo repped clients ranging from Jon Bon Jovi (licensing of the doc-series “Thank You, Goodnight” to Hulu) to Watermark Media (financing of “Oh, Hi!” and “Mad Bills to Pay,” which both premiered at Sundance in 2025). They also repped Kevin Costner’s TIG Prods. and Territory Pictures in the multiple nine-figure financing, production and distribution of the multi-part film project “Horizon: An American Saga.” The work of these two attorneys overlaps, with Simonds working more in the influencer and podcast space and Sherman focusing more on the book publishing areas. Both also work on production, financing and distribution rights.\nWhen the butts aren’t in the seats: “Making the decision to finance a movie that goes into the theaters is much tougher now because the market is so much more difficult to figure out,” says Sherman. “This is why there’s this huge disparity between tentpole movies and the independents.”\n-\nAdam Hime\nExec VP; head, TV business affairs\nFifth Season\nFifth Season is on a roll, with one of the buzziest shows on TV in “Severance” and some eagerly anticipated projects coming up, including the Zoe Kazan-helmed “East of Eden” limited series for Netflix, Eli Roth’s “Hostel” series and Steph Green’s “The Good Daughter” for Peacock and David O. Russell’s “Bananas” for AppleTV+. Hime executed all these licensing deals and more. “We are constantly evaluating and reevaluating trends in dealmaking to create some flexibility in our deals and to reward accountability and success,” he says.\nPersonal motto: “Open communication and mutual understanding in dealmaking is critical,” he says. “We want to always understand what everyone needs in a deal and explain our interests and ultimately our goals to make a good deal that everyone’s happy with.”\n-\nHoward Meyers\nExec VP; global head of business affairs\nFocus Features\nA member of the Focus team since the launch of the indie-minded division of Universal in 2002, Meyers oversaw a number of deals for movies from major directors in 2024, including Yorgos Lanthimos’ “Bugonia,” Steven Soderbergh’s thriller “Black Bag,” Chloe Zhao’s historical drama “Hamnet,” the Ethan Coen comedy “Honey Don’t” and upcoming films from Wes Anderson and Robert Eggers. “I like a lot of the people that I deal with,” he says. “I think they’re interesting people. So I always try to do lunches and get to know people.”\nUnfashionable: Rudeness. “I think people are definitely a lot more civil now than when I started doing this,” he says. “It’s just generally not acceptable. I seldom have a call where someone’s screaming.”\n-\nDarrell D. Miller\nPartner; founding chair, entertainment & sports law department\nFox Rothschild\nMore than three decades into his career, Ohio native Miller still maintains his Midwestern work ethic. In recent months, he’s cut deals for husband and wife Courtney B. Vance (FX’s “Grotesquerie”) and Angela Bassett (Netflix series “Zero Day”) and their production company Bassett Vance Prods. (multi-year overall with 20th TV), Da’Vine Joy Randolph (MRC feature “The Gallerist”), Chris “Ludacris” Bridges (workout series with Jane Fonda for Meta Quest’s VR platform), Teyonah Parris (Apple TV+ feature “Matchbox”) and Moses Ingram (untitled Kathryn Bigelow Netflix thriller).\nSurvival tactic: “Thinking more about how skills are transferable to these new mediums, different audiences and alternative distribution platforms where they can find real business opportunities in the face of all this change,” he says.\n-\nMarc Simon\nPartner; chair, entertainment & sports law department\nFox Rothschild\nSimon cycles around New York City — riding what he describes as “the ugliest bike in Manhattan, which is both the charm and the practicality of it because no one wants to steal it” — cutting deals for clients such as Sharmeen Obaid-Chinoy (first female director of a “Star Wars” film), Michelle and Barack Obama’s Higher Ground Prods., actor Joe Pesci, Bloomberg Media, production companies Park Pictures (“The Perfect Neighbor”), B-Reel Films and iDeal Partners (“The Librarians”) and filmmakers Lila Yacoub (“East of Wall”) and Joseph Patel (“Sly Lives”).\nPost-streaming boom budget building: “We’re back to exploring more independent ways of financing and looking towards outside-the-box opportunities such as branded and nontraditional corporate financing plays,” he says.\n-\nMarcie Cleary\nPartner, entertainment group\nFrankfurt Kurnit Klein & Selz\nCleary’s client roster — which ranges from Toni Braxton to Stacy London — is increasingly seeking her advice on how to expand professional opportunities, whether its film, TV, podcasting, books or product lines. The NY-based attorney says everyone on both sides of negotiations is getting more creative, trying to make deals work, and her success comes from blending her Southern politesse with ferocious tenacity. “I’m kind and people like to be around me, but I’m a beast when it comes to negotiating,” she says.\nRipe for a comeback: The 10-minute “How are you doing?” conversation everyone used to have during COVID before talking about work. “Everyone has gone back to getting straight to business,” she says. “But those conversations made us human. You got to know everyone.”\n-\nVictoria Cook\nPartner, entertainment group\nFrankfurt Kurnit Klein & Selz\nNew York-based Cook has a diverse roster of clients, from director Robert Eggers to Northwell Health, which launched a studio to produce scripted and unscripted content that aims to “humanize health care.” Beyond recent bidding wars for Natalie Portman and Sophie Mas to produce “Good Sex” and another for Eggers’ next film, deals for independent films and documentaries “have fallen off in a huge way,” she says. “But you have to be patient and still act like you own the negotiation.”\nPersonal motto: Put yourself in the shoes of your client as much as you can but know you can never really walk in them. “If I only see it as a transaction, I can’t actually achieve what’s best for them,” she says.\n-\nAndrew Hurwitz\nPartner; co-chair, entertainment group\nFrankfurt Kurnit Klein & Selz\nHurwitz got deals done for Aaron Sorkin, J.C. Chandor and Tony McNamara, with the latter signing to write “James and the Giant Peach” for Netflix and “Avengelyne” for Warner Bros. He also helped land Mob Entertainment’s “Poppy Playtime” movie deal, which is part of his larger efforts to bring video game companies and studios together to create new projects. Hurwitz likes to build long-term consigliere-type relationships, where he fully understands his clients’ priorities and “they understand they’re being heard,” he says.\nAdvice to younger self: “You will get the most satisfaction out of your work and be most productive by 1) doing fewer things, 2) varying the intensity and 3) focusing on the quality.”\n-\nJoshua Lewin\nCounsel, entertainment group\nFrankfurt Kurnit Klein & Selz\nLewin had a busy year closing a wide variety of deals for Jon Glaser (executive produce and serve as head writer for “They Call It Late Night With Jason Kelce”; launch new podcast with Smartless Media), Nikki James (star in the Tony-winning musical “Suffs”), Ellen Fairey (exec produce MGM+ series “American Classic,” starring Kevin Kline), Nicole Perlman and David Chasteen (blind script pact with Netflix), Cal Brunker and Bob Barlen (write and direct the fourth “Paw Patrol” film) and author Dean Koontz (book rights deals with Amazon Studios and Sony Pictures Television).\nNecessary evil: “Shopping agreements are the bane of every entertainment attorney’s existence,” he says. “Probably under one percent of [them] ever lead to anything, but you always have to deal with them.”\n-\nAlan Sacks, Hayden Goldblatt, Sean Jefferson and Larissa Calva Ruiz\nPartner, IP finance group\nPartner, IP finance group\nPartner, IP finance group\nCounsel, IP finance group\nFrankfurt Kurnit Klein & Selz\nThis group of top transactional attorneys focuses on film and TV financing, rights deals, celebrity-founded businesses and independent film distribution. Recent matters include Omaha Prods.’ extension of its original content agreement with ESPN (Goldblatt), Waypoint Entertainment’s slate financing pact with Neon (Sacks), loans for Sherborne Media on such projects as the Alan Ritchson-starrer “Motor City” and the Shaq and Gina Rodriguez-hosted ABC game show “Lucky 13” (Sacks and Calva Ruiz) and Closer Media’s financing of Angelina Jolie’s next feature, “Stitches,” Justin Lin’s “Last Days” and Alex Gibney’s Elon Musk doc for HBO Max. The team also had an influence on this year’s awards race, representing production company Kaplan Morrison in the financing and distribution of the Oscar-winner “The Brutalist” (Goldblatt and Jefferson), which Sacks says was notable because it’s “reassuring in today’s madness that independent film has a real place on the mantle.”\nAdvice to younger self: Context is everything. “Every set of circumstances is different, and you have to understand the basis upon which you’re having a conversation,” says Sacks.\n-\nChristopher Frost, John D. Maatta and Ben Kassis\nFounding partner\nFounding partner\nPartner\nFrost\nThe firm launched in 2023 and has rapidly grown from four to 30 attorneys, handling often-sensitive litigation for clients spanning major actors to sports figures. Recent clients include Playboy Media, the Fray’s Joe King, ’90s grunge stars the Nixons, rapper-producer Jason Martin, former Activision CEO-turned-musician Eric Hirshberg and Grammy Award-winning producer Jack Joseph Puig. “Culture is really important to us,” says Frost. “We branded ourselves as being an alternative to the traditional firm and feel we’re delivering. We effectively become outside counsel, in terms of advising them and also the breadth of the matters that we handle.”\nFashion trend: Body art. Both Kassis and Frost sport multiple tattoos, including arm sleeves. “Attorneys, especially in the entertainment business landscape in L.A., are showing their individuality more,” says Kassis. “With body art, they’re not the cookie cutter lawyer.”\n-\nAnnie H. Lee, Bianca J. Levin. Daniel S. Passman and Cheryl M. Snow\nPartners\nGang, Tyre, Ramer, Brown & Passman\nThe firm has been around nearly a century and handled legends such as Frank Sinatra and Marilyn Monroe, and Lee says that legacy means “We want to represent icons.” The group’s current client roster includes Timothée Chalamet, Dwayne Johnson, Ridley Scott, Jim Parsons, Regina King, Daniel Dae Kim and YouTuber Rachel Griffin-Accurso (aka Ms. Rachel). Lee says good deals are still out there amidst the current market contraction, and she’s pleased that there’s a shift back towards the success-based compensation model. “People inherently want a direct relationship between success and reward, and something doesn’t feel right about hitting it out of the park and not getting the home run,” she says, adding that the job for lawyers is to “fight for what constitutes success with all the streamers.”\nFashion trend: The “ludicrously capacious handbag. “Two years ago, I was carrying a micro-handbag that didn’t even fit my phone, but I love a big handbag” says Lee. “I was having a picture taken and the photographer said, ‘Do you want to put your luggage down?’”\n-\nMichael Gendler, Kevin Kelly and Sarah Cunningham\nPartners\nGendler, Kelly & Cunningham\n“The business is constantly changing,” observes Cunningham, “and the pace of change is remarkable. But that’s part of what keeps it fun and allows us to be really creative in our dealmaking.” Gendler, Kelly and Cunningham have been able to apply that creativity to deals for some boldface names, including producer Shonda Rhimes (Netflix’s “The Residence” and season four of “Bridgerton”), John Hoffman (“Only Murders in the Building”) and Alex Kurtzman (three “Star Trek” projects) and David E. Kelley (multiple series, including the upcoming “Margot’s Got Money Troubles”) and director Rob Marshall (Sony’s feature remake of “Guys and Dolls”). “Each deal is sort of like three-way chess,” says Cunningham, “where you’re working with the studio, the client, the agents, managers, and thinking through, creatively, what is going to be best for that client?”\nAdvice to younger self: “You can’t plan out a career perfectly from A to Z,” says Cunningham. “Every lawyer I know takes a circuitous path. Just take those twists and turns with a sense of humor and an open mind.”\n-\nApril Perroni\nSenior VP; head of business affairs\nThe Gersh Agency\nPerroni has been at the center of major deals for many of Gersh clients in recent months, including Ralph Ineson (a series of Marvel films beginning with “The Fantastic Four”), Sam Elliott (USAA commercials with Rob Gronkowski), Mark Harmon (“NCIS: Origins”), Melissa Roxburgh (“The Hunting Party”), J.K. Simmons (“Heart of the Beast”), Chris O’Donnell (“9-1-1: Nashville”) and Sam Rockwell (surprise appearance on “The White Lotus”).\nPete peeves: Studios’ continued demands for long windows of exclusivity (“We want to make sure that the second our client is off of a show or out of a film that we can get them right back to work,” she says) and imprecise AI language (“They’re trying to get as much latitude in digitizing and manipulating as they can”).\n-\nKevin Masuda, Benyamin (Ben) Ross, Sarah Graham and Steve Tsoneff\nPartner; co-chair, media, entertainment and technology practice group\nPartner; co-chair, media, entertainment and technology practice group\nPartner\nPartner\nGibson Dunn & Crutcher\nPeople are kicking the tires more these days, rather than just jumping in on deals, but despite the un-certainty in the industry and the American economy under President Trump, things haven’t fallen off as much as anticipated, according to Masuda. “There are still opportunities and we’re pretty busy,” he says. The quartet’s handiwork was in the headlines last year when it advised the Spring Hill Company (founded by LeBron James and Maverick Carter) on its merger with production company Fulwell 73, as well as equity investments in the resulting combined entity, Fulwell Entertainment. In recent months, they have also advised on Oak View Group’s partnership with MSG Entertainment and Sphere Entertainment to form the Crown Properties Collection, and on multiple transactions for RedBird Capital Partners, including its investment in Prologue Entertainment and the investment of RedBird IMI (a joint venture with International Media Investments) in Charles Barkley’s production company Round Mound Media.\nChaos and disruption are good: As a young attorney, “I was always worried about change,” says Masuda. “Will my practice get edged out of the market? But you always find a way.”\n-\nOrin Snyder, Theodore Boutrous, Brian Ascher and Ilissa Samplin\nPartner; co-chair, trials practice group\nPartner\nPartner; co-chair, media, entertainment and technology practice group\nPartner; co-chair, media, entertainment and technology practice group\nGibson Dunn & Crutcher\nThe Gibson Dunn & Crutcher quartet has been at the center of several recent headline-grabbing disputes, most notably repping AMC Networks in a high-profile profit participation case brought by executive producers of “The Walking Dead.” In December 2024, the California Court of Appeals affirmed AMC’s victory over the producers’ claim seeking hundreds of millions of dollars and they’re now defending against a separate action seeking to piggyback on a settlement AMC entered with other profit participants under “most favored nation” provisions. They also achieved a favorable settlement defending Big Fish Entertainment and Reelz Channel in a suit brought by A&E claiming “On Patrol: Live” infringed A&E’s “Live PD” copyrights and trademarks. Currently, they’re defending Warner Bros. Television in a suit from the estate of Michael Crichton claiming its medical drama “The Pitt” is a derivative work of “ER.”\nOnly in Hollywood: “… is a celebrity involved in a case you are handling also a parent in your daughter’s kindergarten class,” says Samplin.\n-\nRick Genow\nFounding partner; management committee\nGoodman, Genow, Schenkman, Smelkinson & Christopher\nGenow closed many notable deals for his clients in recent months, including agreements for Wes Ball to direct “The Legend of Zelda” and Jacob Elordi to star in “Frankenstein” and “Wuthering Heights.” He also brokered Michael Showalter’s overall deals with Amazon and Sony and his pact to direct and produce “Verity,” as well as pacts for Adria Arjona and Drew Starkey to appear in A24’s “Onslaught” and Patricia Arquette to star in Hulu’s limited series about the Murdaugh family murders.\nLiving with market correction: “We had a glut of programming for a number of years that was too much even for people in the industry to keep track of, and now we’ve overcorrected,” he says. “In the next couple of years, I’m hopeful we will see an uptick in production.”\n-\nLucy Popkin\nPartner\nGoodman, Genow, Schenkman, Smelkinson & Christopher\nPopkin has cut deals for Joseph Quinn in “Gladiator 2” and as Johnny Storm/ Human Torch in the upcoming “Avengers: Doomsday,” Leo Woodall in “Bridget Jones: Mad About the Boy” and Milly Alcock in the upcoming “Supergirl: Woman of Tomorrow” and renegotiated Chris Perfetti’s pact for “Abbott Elementary.” Other clients include Murray Bartlett (“Nine Perfect Strangers”) and Saura Lightfoot-Leon (“The Agency”).\nPassing the barre: Popkin is a former ballet dancer who believes it gives her a unique understanding of artists and performers. “When I was a dancer and it came time to negotiate for our needs, I realized I liked advocating for artists and I wanted to have a say in how they were treated,” says Popkin. “This continues to be a meaningful part of my work.”\n-\nAndré Des Rochers, Elizabeth Moody, Anita Surendran and Josh Sandler\nPartners\nGranderson Des Rochers\nThe Beverly Hills boutique Granderson Des Rochers may be only six years old, but its roster is mature and diverse. Moody is partnerships counsel for Roblox and works closely with Wave XR and reps music sharing platform Audius. The firm is also strong with film and TV talent on both sides of the camera, repped by Sandler (Pete Davidson, Janelle James, Sean Patton and Eugene Mirman), Surendran (Alex Scharfman, Michaela Coel, Jesse Williams, Kofi Siriboe and Monique Walton) and Des Rochers (Kristoffer Borgli and Jeremy O. Harris). As far as trends go, “there has been a shift toward features, where it’s as busy as it has been in years,” says Des Rochers. Writers are also taking more chances on spec scripts now and they are selling, he says, pointing to the deal he just helped negotiate for MacMillan Hedges’ spec script, which had eight bidders and “went through the roof.”\nThese days … : “I’m on a cleanse, day five of 15,” says Des Rochers. “Never felt better and more fixated on what my first meal will be.”\n-\nMatt Galsor, Sally James, Mark Muir and Alla Savranskaia\nPartner\nGreenberg Glusker\nThe group’s client roster is filled with household names, toplined by a pair of superstar Toms (Cruise and Hanks), along with fellow actors Chris Hemsworth and Vin Diesel, directors James Cameron, David Fincher and the sibling filmmaking/ producing team Anthony and Joe Russo, one of the world’s most successful living authors, J.K. Rowling, and the estates of two other literary legends, J.R.R. Tolkien and Ray Bradbury. “I’m fortunate to represent quite a few people for whom the deals haven’t really changed even as the environment has changed,” says Galsor. He believes that the overall landscape will continue to get worse before it gets better. However, he does see one solution: going private. “The market rewards growth and potential growth, but to ride out this storm with declining revenue, you want to go into the safe harbor of private owners,” he observes. “Maybe later you can go back into the market.”\nPersonal motto: “Always make money for your partners,” says Galsor, paraphrasing a famous line from “The Godfather, Part II.”\n-\nSky Moore, Ryan Webb, Matthew Dysart and Brandon Milostan\nPartner\nPartner\nPartner\nCounsel\nGreenberg Glusker\nThe Greenberg Glusker quartet’s deals include everything from the sale of Johnson Production Group to TF1 to navigating Sam Asghari’s divorce from Britney Spears. Other recent major transactions include Moore closing a second-stage sale of a substantial equity interest in film distributor Vertical Entertainment to Forest Road. Webb says the group also represents a handful of big gaming companies who have “a lot of leverage now” with demand climbing for video game adaptations. But with studios growing cautious, the group has also seen a big spike in indie films. “I thought indies were dying,” says Webb, “but last year I worked on more indie film financing deals than I had in the last 10 years.”\nBiggest win: Negotiating Jocko Willink’s deal with Skydance and Apple TV+ for the movie adaptation of his children’s book series “The Way of the Warrior Kid.” “When Jocko approached us, it was on a very short timeline,” says Webb. “There’s a podcast and merch items and we had to be surgical with the rights, making sure which are licensed\n-\nDan Black\nVice chairman, global entertainment & media practice\nGreenberg Traurig\n“My attitude is [that] there’s always going to be change, you might as well try to embrace it,” says Black. Looking at where deals are being made and how money is coming into the entertainment industry, he sees more action around IP, along with more involvement from private equity firms. Among the recent deals he’s led are Oaktree Capital Management/Shout! Factory’s acquisition of the Open Road film library and Litmus Music’s acquisition of Opus Music Group for well above $200 million. He also remains primary outside counsel for Pokémon. With these nine-figure deals, he says, “there’s an education involved for all parties.”\nIf you can’t take the punches, it don’t mean a thing: “There’s no shame in finding yourself face down on the canvas,” says Black. “The shame is not getting up.”\n-\nBobby Rosenbloum\nChairman, global entertainment & media practice\nGreenberg Traurig\nRosenbloum calls the 10-year deal he brokered for the Recording Academy with Disney, bringing the Grammys to ABC, Hulu and Disney+ (including global streaming), his proudest win from the last year. “Economically, it’s a fantastic deal for the Recording Academy,” he says, “and it gives [it] the ability to maintain its presence with the Grammys on network television but begin a shift towards streaming.” He also reps the Coca-Cola Company in entertainment and music matters, Meta, Snap and X in music and licensing issues, and several major AI companies, and serves as primary outside music counsel for Amazon Studios and Apple Studios.\nAdvice to younger self: “Responsiveness is really the key to success, and making every client feel like they’re your only client,” he says.\n-\nMathew Rosengart\nShareholder; national co-chair, media & entertainment litigation\nGreenberg Traurig\nAfter closing the chapter on 3 years of litigation for Britney Spears in a successful effort to free her from a conservatorship last year, Rosengart has enough material to fill a book, but has declined offers to write one out of respect for her privacy. Besides, he’s busy enough handling cases for clients like Steven Spielberg, Ben Stiller, Sean Penn, Keanu Reeves, Casey Affleck, Lena Dunham and Jelly Roll.\nPutting out fires for celebrity clients: “These are invariably fast-moving and intense, made all the more so by their personal nature and the proliferation of unchecked social media,”he says, but “they are sometimes the most rewarding, they can be resolved under the radar, before the issues become public.”\n-\nPeter Grant\nPartner\nGrubman, Shire, Meiselas & Sacks\nGrant brokered a pair of pacts for projects about the making of Bruce Springsteen’s 1982 album “Nebraska” — one for a documentary and another for a 20th Century Studios/ Disney feature titled “Deliver Me From Nowhere,” starring Jeremy Allen White. He also closed a deal with Netflix for the Robert De Niro thriller “The Whisper Man,” finalized an agreement to launch an exclusive “The Late Show” FAST channel on Samsung TV Plus for David Letterman’s Worldwide Pants and sealed a co-hosting agreement with Martha Stewart with Magical Elves for a cooking competition series on NBC.\nSurvival tactic: “Remember that your reputation is all you have and treat people as you want to be treated,” he says. “I’ve been lucky to be at this firm for 25 years and everything comes back around again.”\n-\nKaren Gottlieb\nPartner\nGrubman, Shire, Meiselas & Sacks\nGottlieb recently negotiated iHeartMedia+Entertainment’s deal with audio production company Exactly Right Media to be the exclusive sales, marketing and distribution partner for its full slate of podcasts, including “Buried Bones,” “Ghosted! by Roz Hernandez” and its flagship show “My Favorite Murder.” She also reps Live Nation Prods. in both unscripted and scripted projects, including the recent feature “K-Pops!” and Paramount+’s “The French Montana Story: For Khadija,” as well as a several projects currently filming or in development, including a Green Day-inspired comedy feature.\nPersonal motto: No pressure, no diamond. “There’s absolutely a ton of pressure in this industry, especially when you’re dealing with high-level clients, whether talent or institutional clients,” she says, but the ability to handle it is “what makes you good at your job.”\n-\nLawrence Shire\nManaging partner; head, motion picture, TV, theatre, publishing, new media & sports\nGrubman, Shire, Meiselas & Sacks\nEverything is coming up LeBron James for Shire, who recently helped the NBA superstar expand his film, TV and digital empire through a merger of his SpringHill Company with Fulwell 73 Prods. Other major matters include renegotiating Gayle King’s “CBS Mornings” pact and brokering a book deal and a TV/doc rights sale for Wall Street Journal reporter Evan Gershkovich, who spent more than a year in a Russian prison and was released in 2024. He also handles transactional work for Jerry Seinfeld and “Billions” co-creator Andrew Sorkin and represents the estate of David Bowie\nDigital revolution’s downside: “So much has changed in the theatrical business,” says Shire. “A picture used to get a theatrical release. Now, studios change their minds after the final cut and deliver it into streaming, which hurts everybody’s back-end, net-profit participation.”\n-\nRobert Strent\nPartner\nGrubman, Shire, Meiselas & Sacks\nStrent recently closed several deals for LeBron James — including ownership of a UIM E1 powerboat racing team, a DraftKings endorsement for gaming products and services, a Louis Vuitton luxury apparel campaign and a Hennessy special edition cognac — while simultaneously doing legal work for James and Maverick Carter’s Uninterrupted sports platform and production company. Strent also handled actress Mariska Hargitay’s negotiations for her role as star and executive producer of “Law & Order: SVU,” and an agreement for her to direct a documentary about her mother, Jayne Mansfield.\nProduction contraction: “The production process is getting harder,” says Strent. “Producers are being ground down. Budgets are under much stricter scrutiny. They’re not getting approved at the same levels. It’s hard for producers to make the kind of money that they used to.”\n-\nJohn V. Meigs Jr. and Jamice A. Oxley\nPartners\nHansen, Jacobson, Teller, Hoberman, Newman, Warren, Richman, Rush, Kaller, Gellman, Meigs & Fox\nMeigs and Oxley had a big year, closing multiple six- and seven-figure talent deals spanning film, television, branding and theater. For Kaley Cuoco, they brokered a pair of series pacts — to topline and executive produce “Kansas City Star” for Warner Bros. TV and star in “Vanished” — while loading Damson Idris up with endorsements for Hennessy, Bulgari, Heineken, IWC and Mercedes AMG, the latter co-promoting the movie “F1” in which he co-stars with Brad Pitt. Going forward, they face the added challenges wrought by the tumultuous Trump administration. “There is an assault on the little guy, the minority,” says Meigs, who also shares clients such as Issa Rae, Aisha Tyler and Karen Pittman with Oxley. “It’s going to be challenging, particularly for those of us who represent people of color or people from other marginalized groups.”\nPersonal mottos: “Cultivate joy, eliminate fear” (Meigs) and “Let your smile be your umbrella” (Oxley).\n-\nRobert Lister\nChief legal officer & senior executive vice president\nImax\nLister has been an essential part of Imax’s growth from a company with documentary roots to having a hand in global production and creative affairs. “For the first time,” says Lister, “virtually every Imax release from May until September will be a ‘Filmed for Imax’ movie where the filmmakers used our cameras.” That includes “Mission: Impossible — The Final Reckoning,” Marvel’s “Thunderbolts” and DC’s “Superman.” Greta Gerwig’s “Narnia,” originally slated only for streaming on Netflix, will also play an exclusive engagement at Imax theaters worldwide. “Filmed for Imax” deals also include seven upcoming films from Chinese studios.\nStrange bedfellows: Entertainment executives and lawyers. “One focuses on everything that will go right with the deal, one focuses on everything that will go wrong with the deal, and neither ever shuts up,” he says.\n-\nJeff Bernstein\nPartner\nJackoway Austen Tyerman Wertheimer Mandelbaum Morris Bernstein Trattner Auerbach Hynick Jaime LeVine Sample & Klein\nBernstein handles many of the most bankable and lauded names in entertainment, spanning the generations from three-time Oscar nominee Margot Robbie (acting deals for “A Big Bold Beautiful Journey” and “Wuthering Heights”) to Oscar-winner Judi Dench (agreement to become a voice used for Meta’s new AI assistant). He also helped facilitate Daniel Day-Lewis’ return from retirement, negotiating his acting, script acquisition and executive producing deals with Focus Features for “Anemone,” which was co-written with and directed by his son, Ronan Day-Lewis, whom Bernstein also represents.\nStar search: “I do think financiers, whether studios or otherwise, are really searching for those bankable names — and they are paying a premium for those bankable names, arguably even more than they were paying before the strike,” he says.\n-\nAdam Cooper\nPartner\nJackoway Austen Tyerman Wertheimer Mandelbaum Morris Bernstein Trattner Auerbach Hynick Jaime LeVine Sample & Klein\nCooper helped client Sean Evans buy First We Feast — the production company behind his viral hit YouTube series “Hot Ones” — from BuzzFeed for $82.5 million as part of a group of investors that also included podcast company Crooked Media, Rhett and Link’s Mythical Entertainment and Soros Fund Management. He also closed a series of film and TV deals for director Edward Berger in the wake of his Oscar-nominated film “Conclave,” including a pact to make the time-travel feature “The Barrier,” starring Austin Butler, for 20th Century Studios.\nTough times for writers: “We’re in this environment where they’re just making fewer things, so, for people who are specifically working on the TV side, the opportunities to be in writers’ rooms is not what it was,” he says.\n-\nDeborah Klein\nPartner\nJackoway Austen Tyerman Wertheimer Mandelbaum Morris Bernstein Trattner Auerbach Hynick Jaime LeVine Sample & Klein\nKlein built her reputation crafting groundbreaking contracts on behalf of clients like Jim Carrey. She did his deal on “The Cable Guy” back in the mid-1990s and has continued to represent him going forward, including on his recent deal for “Sonic 3.” She was also instrumental in brokering Samuel L. Jackson’s renewal for his Capital One campaign, as well as his fees on the TV miniseries “Fight Night: The Million Dollar Heist.” Klein also negotiated Will Ferrell’s acting deals for his scripted Netflix comedy series “Golf,” as well as pacts for his Amazon movies “You’re Cordially Invited” and “Judgement Day,” along with his PayPal campaign. Other clients include Paul Rudd and Vince Vaughn.\nRipe for a comeback: “R-rated comedies,” she says. “It’s how I really feel.”\n-\nPeter Sample\nPartner\nJackoway Austen Tyerman Wertheimer Mandelbaum Morris Bernstein Trattner Auerbach Hynick Jaime LeVine Sample & Klein\nSample sees himself as a fierce advocate with a mission to help his clients navigate the industry’s choppy waters. In recent months, he’s helped several sail on to the next level, negotiating to extend and improve “Severance” creator and executive producer Dan Erickson’s overall deal with Apple and brokering agreements for Grant Sputore to direct the “Godzilla x Kong” sequel commencing production this year, and Tony Yacenda to direct and executive produce season one of “Chad Powers,” starring Glen Powell, and setting up writer/director Qui Nguyen’s new overall deal at Skydance.\nBeing responsive to a client’s needs: “If a client is looking for stability, then we will structure a deal in such a way that it brings stability as much as we can, given the marketplace,” he says\n-\nDarren Trattner\nPartner\nJackoway Austen Tyerman Wertheimer Mandelbaum Morris Bernstein Trattner Auerbach Hynick Jaime LeVine Sample & Klein\nTrattner’s handiwork was in the headlines when he closed a deal for Scott Cooper to write, direct and produce “Deliver Me From Nowhere,” starring Jeremy Allen White as Bruce Springsteen. He also negotiated pacts for Giancarlo Esposito to play Sidewinder in Marvel’s “Captain America: Brave New World” and Brian Tyree Henry to co-star in Warner Bros.’ “Panic Carefully,” as well as writer Jason Hall’s (“American Sniper”) overall deal with Amazon.\nStay calm and create: “I remain optimistic because it’s such a beautiful and amazing art form and I think that it brings people together,” he says. “But I think it is a very big challenge that we have right now, and it affects all of us,” including clients, the studios and the financiers.\n-\nDavid Singer\nCo-chair, content, media and entertainment practice, antitrust practice and technology practice\nJenner & Block\nLast year, Singer secured a dismissal of a class action against Apple, filed by self-described conservative voters who claimed their speech and voting rights were violated because of a conspiracy between tech companies, the Biden administration and others. It’s the latest in a string of successful defenses Singer has mounted for major tech companies hinging on freedoms granted by Section 230 of the Communications Decency Act against complaints coming from both sides of the political spectrum. Other recent matters include repping Move in a case alleging that its website Realtor.com infringed a photographer’s copyrights.\nCrisis management: “If you can be the calmest person in the room, or at least appear to be the calmest, that’s going to help you and it will actually help everybody else,” he says.\n-\nTara Kole\nCo-founder, co-managing partner\nJohnson Shapiro Slewett & Kole\nKole says her job is “a contact sport every day,” but she loves it. In recent months, she’s handled various matters for Angelina Jolie, including deals for her role in “Stitches” and her brand partnership with Tom Ford, as well as advised on her Atelier Jolie fashion collective. Kole has also negotiated deals for Francesca Gardiner (showrunner and executive producer of Max’s upcoming “Harry Potter” series), Halle Berry (female lead opposite Chris Hemsworth in “Crime 101”) and Josh O’Connor (starring role in Steven Spielberg’s next movie). Other clients include Greta Gerwig (set to direct new “Narnia” film), Zac Efron and Riz Ahmed (co-starring opposite Tom Cruise in an upcoming Alejandro G. Iñárritu movie).\nAdvice to younger self: “Go back to sleep, you will figure it out in the morning,” she says.\n-\nP.J. Shapiro\nCo-founder, co-managing partner\nJohnson Shapiro Slewett & Kole\nCelebrities are increasingly going beyond traditional endorsements to partnering with businesses, says Shapiro, who has an MBA, as well as a JD. A case in point: Selena Gomez. In addition to her film and TV deals (starring role in a Linda Ronstadt biopic; Food Network’s “Selena + Restaurant”), he also handles ongoing work for her lucrative Rare Beauty and Our Place product lines. “As competing pressures put headwinds against us, the ability to think outside the box and to avoid just doing what’s been done before is the primary way to open up value and tap into leverage,” says Shapiro, whose other clients include Emma Stone and John Cena.\nBiggest win: Being part of Greta Gerwig and Noah Baumbach’s negotiations with Netflix regarding the “Narnia” franchise.\n-\nGreg Slewett\nCo-founder, co-managing partner\nJohnson Shapiro Slewett & Kole\nSlewett has been busy cutting deals for big names such as Glen Powell — including starring roles in Edgar Wright’s “The Running Man” remake and J.J. Abrams’ new untitled film for Warner Bros., as well as his upcoming Hulu comedy series “Chad Powers,” which he co-created and executive produced — and Michael B. Jordan, whom he set to direct and star in a remake of “The Thomas Crown Affair” for MGM. He believes that, in the future, “ownership over content is going to become much more of a factor for our clients, especially those who have the capital to be able to exercise on that.”\nSurvival tactic: Never miss a day in the gym. “I try to go five days a week,” he says. “It keeps me sane.”\n-\nPhilip M. Kelly\nPartner\nKendall Brill & Kelly\nGetting a $142.5 million copyright lawsuit dismissed, successfully representing CBS in a $30 million dispute over “Walker, Texas Ranger,” and winning summary judgements for clients like Lionsgate are all great achievements for an entertainment law litigator. Kelly did all those things and more, but he especially enjoyed representing Paramount Global and South Park Digital Studios in a $500 million lawsuit brought by Warner Bros. Discovery over “South Park” content airing on Paramount+, not only for the challenges it posed regarding streaming rights, but because it was fun.\nAdvise to younger self: Find a job where you don’t have to bill by the hour. “I tell my kids to find some job where you’re getting paid even when you’re on vacation and when you’re sitting there at home,” he says.\n-\nRichard B. Kendall\nPartner\nKendall Brill & Kelly\nKendall defended Paramount with two distinct anti-SLAPP motions combating lawsuits filed by “Romeo and Juliet” (1968) actors Leonard Whiting and Olivia Hussey (who died in December 2024), securing final judgment in the first case with a $185,000 attorneys fee award and the dismissal of the second case in October 2024. “The primary issue was that they waited 55 years to bring a claim,” says Kendall, “and the related issue was that they completely reversed their previous position, which was always that they adored and respected the director [the late Franco Zeffirelli].”\nWins are like your children: “I love them all equally,” he says. “The joy of being able to call a client and saying we won is true for whether it’s a small case or a big case.”\n-\nNary Kim\nPartner\nKendall Brill & Kelly\nTaking the side of people accused of child pornography typically results in severe non-COVID social distancing, but when Kim details her recent high-profile cases — defending Nirvana, UMG and others in a suit over the iconic floating naked baby photo on the cover of the “Nevermind” album and a pair of successful anti-SLAPP motions for Paramount defeating lawsuits filed by actors Leonard Whiting and Olivia Hussey over 1968’s “Romeo and Juliet” — the ick tends to dissipate. Other recent matters include defending Paramount Global and South Park Digital Studios in Warner Bros. Discovery’s $500 million lawsuit over “South Park” exclusivity.\nFashion trend: Androgyny. “You can blur the lines and dip into whatever clothes you’re comfortable in,” says Kim, who favors suits and ties.\n-\nPatrick J. Somers\nPartner\nKendall Brill & Kelly\nSomers’ sixth grade yearbook entry said he wanted to be either a baseball player or a lawyer. “Obviously, the baseball part didn’t work out for me, so here I am,” he says with a laugh. And he seems to be doing OK. In recent months, he’s secured a favorable settlement for Nirvana in a copyright/trademark infringement lawsuit against Marc Jacobs Intl. over the band’s “smiley face” design and won a complete trial victory for CAA against former ESPN anchor Sage Steele.\nBiggest win: The returning client. “It reflects their trust in you and how they see that you’re able to operate for them in a moment of crisis to solve their problems,” he says.\n-\nLawrence Iser, Patricia Millet, Kristen Spanier and Chad Fitzgerald\nPartners\nKinsella Holley Iser Kump Steinsapir\nThe group scored a big trial win for longtime client Mattel in a dispute with billionaire real estate developer Norton Herrick, who claimed the toy giant stole an idea for an unscripted TV show from him. The firm had to sift through 700 potential jurors, but, in the end, the 9-to-3 verdict in the 10-week trial showed the firm had demonstrated that the concept was not novel, nor did it include trade secrets, and “The Toy Box” — the Mattel-produced series at the center of the dispute — was independently created. “Hollywood is beset with idea submission claims, but this is a result other studios can point to,” Iser says. Most claims get settled because trials are expensive and juries unpredictable, but Iser says it was important to take this stand, and now studios may be less quick to settle or have more leverage in negotiations.\nTwelve wild cards: “You work hard, you prepare for trial, and then you realize, of course, it’s a jury trial,” says Iser. “The old saying [is], ‘You never know what a jury’s going to do.’”\n-\nMichael Kump, Shawn Holley and Jonathan Steinsapir\nPartners\nKinsella Holley Iser Kump Steinsapir\nThe group handles defamation and other civil cases, as well as sexual assault cases, for clients that have included Evan Rachel Wood, Shia LaBeouf, Trevor Bauer and the late George Foreman. They also handle profit-participation litigation, although Steinsapir says the business model is changing, noting that streamers are paying huge upfront fees instead of giving points on the backend. He questions the wisdom of paying big for shows “that might just fall on their face,” but adds that even with profit participation waning, his firm has enough legacy projects to keep them busy. On the music side, Steinsapir, who represents the estate of Michael Jackson, says the latest trend is younger artists selling their catalogs, although he adds that the market has slowed down in part because of interest rates.\nBiggest win: “We handled a defamation case in Florida for Meghan Markle against her older half-sister on her father’s side,” says Steinsapir. “We won the final ruling last year and the case was thrown out, although it’s now on appeal.”\n-\nMaggie Flores\nPartner\nKirkland & Ellis\nFlores recently served as lead counsel for Caesars Entertainment’s sale of the intellectual property rights of the World Series of Poker (WSOP) to NSUS Group, the digital gaming investors behind the online poker room GGPoker. Valued at $500 million, the deal includes $250 million in cash and a $250 million promissory note due five years after the transaction’s closing date, secured by the WSOP intellectual property being sold. In recent years, she’s repped South Korean gaming company Krafton in its $750 million acquisition of Unknown Worlds and advised on numerous big tech transactions, including Palo Alto Networks in its $500 million acquisition of IBM’s QRadar Software.\nSurvival tactic: “Diet Coke and deep breathing,” she says. “Those are my go-tos.”\n-\nEdward Lee, Joshua Korff and Michael Kim\nPartners\nKirkland & Ellis\nLee, Korff and Kim served as lead counsel to Los Angeles-based Webtoon Entertainment (majority- owned by South Korean tech giant Naver) in its initial public offering of 15 million shares of common stock in June 2024. Priced at $21 per share, the IPO gave a valuation of $2.67 billion to Webtoon, which releases approximately 124,00 episodes daily in more than 150 countries and 10 languages from content partners that include Discord, HYBE, DC Comics. The trio’s work encompasses everything from renewable energy technology (Shoals Technologies’ $1.9 billion IPO) to consumer and retail (repping Walgreens Boots Alliance in its $23.7 billion sale to Sycamore Partners), but it’s maintained a strong presence in the entertainment space in recent years, repping Vince McMahon in the $21 billion-plus merger of WWE and UFC and advising Warner Bros. Discovery in the implementation of its new corporate structure.\nIPO bounce back?: “This new administration is easing rules to make it easier to raise capital, [which is] a healthy indicator for the IPO market,” says Lee. “How many are we going to see this year? Tough to predict, given market volatility.”\n-\nMarvin Putnam\nPartner; global chair, entertainment, sports & media industry group\nLatham & Watkins\n“The most successful things I do,” says Putnam, “are things that you don’t end up seeing,” because he stopped trouble before it really started. Still, he is a trial lawyer, so he spends much of his time arguing cases in court. In the past year, Putnam’s cases have included defending Netflix in defamation suits connected to “Baby Reindeer” and “No Limit” and repping Endeavor in a breach-of-contract action pertaining to its IPO, and producers and broadcasters caught up in the “Scandoval” controversy involving the reality TV show “Vanderpump Rules.”\nRipe for a comeback: “Sadly, the celebrity defamation lawsuit,” he says. “Historically, defamation suits were very hard to bring and even harder to succeed on. That’s been radically changing in a very short period of time.”\n-\nJessica Stebbins Bina, Robert Ellison, Michael Reiss and Laura Washington\nPartners\nLatham & Watkins\nThe rich are different from you and me — they get hit with more lawsuits. These partners in the entertainment sports & media practice fended off suits aimed at companies including Netflix (dispute brought by former “Love Is Blind” contestant), the San Diego Padres (arbitration with the team’s broadcast partner), Endeavor (breach-of-implied contract dispute related to its $10 billion IPO) and Ultimate Fighting Championship (class action brought by fighters), as well as high-profile individuals such as Shaquille O’Neal, Tom Brady, Gisele Bündchen and Larry David. Ellison is especially proud of defending production company Camping World and “The Profit” host Marcus Lemonis against two years of lawsuits brought despite an arbitration agreement.\nAdvantages of a giant firm: “So many of our clients are doing things that are increasingly complicated, increasingly global, and having the Latham platform is really great for us because our clients see us as a one-stop shop,” says Ellison. “There is almost nothing that our clients can come to us with that we don’t have an expert on.”\n-\nMartin D. Singer\nPartner\nLavely & Singer\nSinger’s reputation as a “pit bull” and a “legal hit man” intimidates opponents, but it can also create unrealistic expectations, as he was reminded recently when a client presented him with what he describes as an “almost impossible” task. “They said, ‘Come on, you’re Marty Singer. You can get it done,’” he recalls. But get it done he does, as is demonstrated by recent legal victories, including a dismissal from a harassment lawsuit for Lizzo and a $10.3 million arbitration award in favor of James Packer, Kevin Tsujihara, Avi Lerner and Brett Ratner in their case against Joshua Newton.\nThe dog doesn’t always bare its teeth: “I want the arbitrator to like me,” he says. “When I’m in court, I want the jury to love me.”\n-\nMichael E. Weinsten\nPartner\nLavely & Singer\nWeinsten is an expert at solving sensitive problems for high-profile entertainment entities, both human and corporate, from breach of contract and fraud to harassment. In recent months, he defended Lizzo against hostile work environment claims by dancers and obtained an early dismissal of a sexual assault and defamation suit against radio personality Charlamagne Tha God. Other notable clients include Hailey Bieber, Keifer Sutherland, Eva Longoria, Ray Romano, Paris Hilton, Ellen DeGeneres and Digital Domain.\nProliferation of scams using celebrity images: “I probably get at least a call every week on this,” he says. “These scammers will go out and pretend to be either the celebrity themselves or somebody working on their team and [then] try to get the victim’s information so they can scam them for money.”\n-\nBruce Tobey\nExec VP & general counsel\nLionsgate\nTobey has been busy helping Lionsgate separate from Starz and turn both into publicly traded, standalone entities, a process that includes raising $300 million and collapsing two classes of Lionsgate stock into one. He also won a copyright infringement suit against the studio and is leading Lionsgate’s efforts to apply AI to the distribution of its 20,000-plus-title library.\nAdvice to younger self: “The job of a lawyer, whether we’re at a company or at a law firm, is not to ever say ‘no,’” he says. “When you have to say ‘no,’ if you want to add value, you have to figure out a way to be able to say ‘no, but …’ ‘No, you can’t do that, but you can do this or this or this.’”\n-\nMarc Chamlin\nChair, television\nLoeb & Loeb\nChamlin’s biggest recent deals include brokering Oprah Winfrey’s Penguin Random House publishing pact for her 2024 best-seller “Build the Life You Want,” co-written with Arthur C. Brooks, and negotiating several scripted and unscripted TV deals for her Harpo Studios. He also secured animated TV producing and licensing deals with Disney, Netflix and Chernin Media involving the characters Flash Gordon, the Phantom and Popeye for Hearst Communications’ King Features Syndicate.\nViewer erosion: “Actual viewing numbers will continue to decrease, leading to companies producing less programming for cable and broadcast,” he says. “That’s why broadcasting cable production continues to contract. Companies will close divisions, consolidate and fire senior level executives, realizing that the ecosystem is going to be built from a streamer.”\n-\nScott Edel\nChair, entertainment\nLoeb & Loeb\nRepresenting Alcon Entertainment, Edel brokered deals with Amazon for the TV series “Blade Runner 2099” and the production, financing and distribution of 2024’s “The Garfield Movie” with Sony Pictures. On the gaming front, he repped Finnish mobile developer Supercell Oy in an agreement regarding “Clash of Clans,” Nexon Filmed Entertainment in a film/TV rights pact for “Dungeon & Fighter,” Games Workshop in a transaction regarding its tablet game “Warhammer” with Amazon Studios and Nintendo in its “The Legend of Zelda” deal with Sony Pictures.\nThe comeback that wasn’t?: “I thought ’24 would be more of a rebound year than it was,” he says. “You may have heard the expression, ‘Survive to 2025.’ Now, we’re here. Are we seeing an improvement? I see positive signs, but the jury’s still out.”\n-\nJohn Gatti\nPartner\nLoeb & Loeb\nLast year, Gatti scored a couple of big wins for Miramax. He defended the company in an arbitration seeking damages in excess of $10 million brought by Outlaw Prods. over the payment of profits and the licensing of the their 1989 breakthrough hit “sex, lies and videotape,” and resolved its long-running dispute with photographer Firooz Zahedi, who claimed he owned rights to the image of Uma Thurman it had hired him to take for their “Pulp Fiction” (1994) poster, and that Miramax and each of its licensees were liable for copyright infringement. Additionally, he litigated complex cases for DirecTV and other confidential clients.\nArbitration rules!: “Most disputes these days are really handled in the arbitration venue, and that’s changed the landscape for plaintiffs that are bringing claims,” says Gatti.\n-\nDavid Grossman\nCo-chair, litigation\nLoeb & Loeb\nGrossman successfully defended Paramount Pictures in a copyright infringement case involving the film “Infinite,” starring Mark Wahlberg, obtaining dismissal of the claims with prejudice in December. Currently, he’s defending several other big media companies in rights disputes, including Netflix and NBCUniversal (copyright suit by Providence Publications; breach of implied in fact contract and interference relating to the film “Darkest Hour,” respectively), as well as Christina Aguilera in connection with a dispute with a former business partner over a proposed ice cream/frozen treat product.\nThe coming deluge of trust and estate work: “As the baby boom generation transitions the wealth to the somewhat younger generation, disputes are going to take up a lot of time and energy with more litigators attending court in person,” he says.\n-\nArash Khalili\nFirmwide co-chair; co-chair, the corporate & capital markets department\nLoeb & Loeb\nDealmaker Khalili’s clients run the gamut of the sports and entertainment worlds, from country singers Morgan Wallen (with corporate and entertainment matters) and Carrie Underwood (endorsements and a new health and wellness venture) and supermodel Cindy Crawford (launch of Casamigas Jalapeño Tequila brand) to pro basketball player Chet Holmgren (sponsorships and endorsements, including Nike). Representing the United States Olympic & Paralympic Committee (USOPC) in Salt Lake City’s successful bid to host the 2034 Winter Olympic and Paralympic Games, Khalili provided strategic advice with the commercial relationship between the USOPC, the Salt Lake City-Utah Committee for the Games and the International Olympic Committee.\nCraziest clause: “I was with a celebrity where somebody proposed, in a licensed transaction, to acquire the absolute ownership of the person’s name, image, likeness and identity,” he says.\n-\nNathaniel L. Bach\nPartner\nManatt, Phelps & Phillips\nAt first glance, defending Megan Roup and the Sculpt Society against an anti-competition lawsuit brought by fitness guru Tracy Anderson and representing the European Climate Foundation in a First Amendment lawsuit initiated by X Corp. don’t have much in common, aside from Bach winning both cases (currently under appeal). But he says they all reflect the trend of deep-pocketed plaintiffs weaponizing litigation and strong-arming smaller entities.\nFree speech: “I think that one of the primary challenges that the legal profession faces now is not being afraid to stick up for the rule of law and to defend personal and press freedoms when they are under attack,” he says. “Now is not the time for lawyers to sit idly by. Politicians come and go, but our values shouldn’t.”\n-\nChristopher Chatham\nPartner\nManatt, Phelps & Phillips\nMost of Chatham’s clients want to chart their own destiny, and his goal is to help them achieve that goal. Whether that means orchestrating deals for prolific short-form YouTube content creator Alan Chikin Chow, helping podcaster Chris Williamson land sponsorships or negotiating deals for Logan Paul’s partnership with MrBeast in the company Lunchly or his new Max show “Paul American,” Chatham understands that attention is the most valuable currency in the entertainment industry. One thing he says his deals have in common: they prioritize creative control and direct audience engagement.\nSurvival tactic: Treating early mornings like he’s at the beach, off-limits to distractions. “This time allows me to not only observe market trends and strategize but turn them into steps necessary to achieve client objectives,” he explains.\n-\nMaria Rodriguez, Alexei Cowett and Tom Conaghan\nPartners\nMcDermott Will & Emery\nThis team scored big wins for its diverse client roster in recent months. In the world of athletics, they repped Acrew Capital co-founder and managing partner Theresia Gouw in her equity investment in the Buffalo Bills (marking the first time the Pegula family has taken on additional investors), Lionel Messi in connection with his international sports beverage joint venture Más+ by Messi, and Stephen Curry’s companies (Unanimous Media, Underrated Golf, SC30) in various transactions and IP, tax and employment matters. In the showbiz realm, they advised James Wan and Atomic Monster in their merger with Blumhouse, assisted Halle Berry in the formation of menopause-focused women’s wellness company Respin Health and defended Jimmy “MrBeast” Donaldson’s production company in two class actions related to unscripted television contests.\nImproved California incentives: Rodriguez estimates production slates in Los Angeles have decreased by 60% to 70%. “I truly believe there’s a lot of effort being made, and we need things like tax credits to happen in our state to bring more production back,” she says.\n-\nJeffrey Frankel\nPartner\nMcKuin Frankel Whitehead\nFrankel has negotiated career-defining deals for some of the industry’s top talent, including “Paradise” producer-directors John Requa and Glenn Ficarra, “Loot” co-creator Alan Yang and Molly Smith Metzler, whose series “Sirens” premieres soon on Netflix. But he’s especially excited about the deal he cut for his long-time client, animation writer Jared Bush (“Zootopia,” “Encanto”), to become the chief creative officer of Walt Disney Animation Studios.\nNon-mantra mantra: Quality product begets quality product. “The quality of television in the last 10 years increased, mostly because of the influx of money from streamers,” he observes. “It’s gone to such a level that it feeds on itself in terms of why movie stars want to do quality television, because it’s considered more elevated and better art now than maybe it was 10 years ago.”\n-\nJoel McKuin\nFounding partner\nMcKuin Frankel Whitehead\nMcKuin creates opportunities for clients. He built on Lily Gladstone’s Oscar-nominated turn in “Killers of the Flower Moon,” crafting deals for film and TV projects including the upcoming feature “Lone Wolf,” and helped Maisy Stella — who launched her career as a child in “Nashville” — transition to adult roles with a lead in the indie film “My Old Ass.” He also brokered Kristen Stewart’s first writer-director gig, helming the upcoming feature “Chronology of Water.”\nPatience and perspective: “For some of us, it takes a while to [succeed],” says McKuin. “Maybe you take yourself too seriously, or what you’re doing is somehow bound in your own ego and your need to win or some weird thing from your childhood. Hopefully, we get a little older and we mellow and realize it’s not worth burning something to the ground to get a project made.”\n-\nEmily Evitt\nPartner\nMitchell Silberberg & Knupp\nEvitt has handled several high-stakes cases for Netflix in recent months, including a suit against the streamer alleging that their 2021 film “Don’t Look Up” infringed on the copyright of an author’s self-published novel, which she successfully motioned the court to dismiss on the grounds that the works were not substantially similar. She’s also repping Netflix in a litigation relating to their 2020 docuseries “Tiger King” that is currently pending appeal. Other recent matters include successfully defending Nickelback in a copyright infringement suit regarding their hit song “Rockstar.”\nI thought of it first: “There really is this phenomenon that when a show is successful, that people come out of the woodwork and they all of a sudden say it was their idea,” she says.\n-\nAdam Levin\nPartner\nMitchell Silberberg & Knupp\nLevin made a name for himself 25 years ago when, in a case against writers on the hit series “Friends,” he clarified the principle that writing room comments were protected expression. Today, he is applying the same code for Bravo’s defense in several high-profile cases by “Real Housewives” cast members alleging sexual harassment and discrimination. Last year, Levin scored a win for Warner Bros. in a discrimination case brought by a white former camera operator on “The Big Bang Theory” that could’ve hurt the industry’s efforts to diversify.\nThese days … : “I seem to be spending more time on litigation, dispute resolution [and] calming people down at the bargaining table, because I think that people are more anxious — and rightfully so — about their futures,” he says.\n-\nKarin Pagnanelli, Marc Mayer and Mark Humphrey\nPartners\nMitchell Silberberg & Knupp\nPagnanelli, Mayer and Humphrey have established themselves as go-to litigators in the gaming world. They’re currently defending a publisher against several claims that their games are addictive and cause harm to minors. These cases address issues of first impression, including the application of Section 230 Communications Decency Act of 1996 and the First Amendment to video game development. They’re also leading efforts against the multitude of “gambling” cases filed against companies that have games containing loot boxes and/or social casinos. In the past decade, they’ve successfully pursued over two dozen lawsuits against video game cheat-sellers, including a $14 million judgement won last year on behalf of Activision against a cheat software for “Call of Duty.”\nPut their initials in for the high score: “I feel that since we grew up as the industry grew up, it means that we have a lot of insights and we can really help smaller publishers and developers and give a lot of advice and counsel on how they can grow,”Pagnanelli says.\n-\nSeth Pierce\nPartner\nMitchell Silberberg & Knupp\nPierce litigates sensitive cases for high-profile clients that frequently involve hot-button cultural issues. In recent months, he’s defended NBCUniversal in a salacious sex harassment and reverse gender case and a separate sexual orientation harassment lawsuit; Ziff Davis in a gender discrimination and equal pay claim; Warner Bros. Discovery (WBD) in multiple matters alleging religious discrimination and wrongful termination related to a COVID-19 vaccine mandate; and Mattel, Paramount Global, WBD and Ziff Davis in proposed class actions alleging various wage and hour violations.\nDealing with the Trump of it all: “There’s a human toll when you see positions eliminated, so I’ve definitely seen an uptick in litigation,” he says. “[And] with the new administration, anything that you would do to try to help protected groups is vilified.”\n-\nDavid Fox and Aaron Rosenberg\nPartners\nMyman Greenspan Fox Rosenberg Mobasser Younger & Light\nFox and Rosenberg see speaking the language of artists as fundamental to their practice. The duo negotiated Ariana Grande’s starring role in the box office hit “Wicked,” which earned her an Oscar nomination for best supporting actress. They also repped Oren Uziel on his deal to create and co-showrun the new “Spider-Man Noir” live-action series for Amazon starring Nicolas Cage and advised Dan Lin in connection with his transition from leading his own production company, Rideback, to taking the reins as chairman of Netflix Films. Additionally, they made deals for David Koepp to script the movies “Black Bag” and “Jurassic World Rebirth” and David Robert Mitchell to write and direct the Warner Bros. sci-fi thriller “Flowervale Street,” starring Anne Hathaway and Ewan McGregor.\nMetaphorically muscle-bound legal guardians: “Our mission is to protect the artist and their art and be their intellectual property bodyguards and everything that goes with that,” says Rosenberg.\n-\nElizabeth Cohen, Carrie Johnson, Allison Roarty and Ryan Victor\nSenior VPs, business & legal affairs\nNBCUniversal Global TV Distribution\nThe quartet’s team oversaw agreements generating billions of dollars in revenue for NBCUniversal in the past year, ranging from U.S. film pay output extensions for 2027-2031 slates, including the Netflix live-action/animation pay output deal, and the PVOD deal for “Wicked,” which generated $70 million in its first week. They also handled premium pay film and TV deals with global partners including Netflix, Amazon and Max, covering most international territories, and multiple FAST channel deals with clients such as LG, Samsung, TCL, Roku, Amazon and Comcast.\nCohen says competition is high among the studios, while Victor notes clients are becoming more risk-averse and deals are getting more complicated with the business changing so quickly. Johnson says that as a result, they need to be flexible, adding that when she started on the job “the most advanced technological media was pay per view.” And, according to Cohen, that means, “we can’t rely on what the precedent for the last deal was.”\nAdvice to younger self: “It’s better to get it right than to meet the deadline,” says Roarty.\n-\nStephanie Kyoko McKinnon\nGeneral counsel; co-president of business operations\nSkydance Media\nMcKinnon’s work on Skydance’s $8 billion deal to form a new Paramount — a complex two-step transaction that includes the acquisition of National Amusements and the merger of Skydance and Paramount — still takes up most of her days. The S-4 disclosure to the Securities and Exchange Commission was filed in February, and once regulatory approval is granted, the true merging will commence. Says McKinnon: “We’re only 1,300 people, so it’s just going to be a really different environment to go from what feels like a startup family to a much bigger organization.”\nEarly lesson: “When I was a first-year law student at McGill and really stressed out, my third-year roommate said to me, ‘The stress level is never going down, so you need to figure out how to manage it now.’”\n-\nCaitlin DiMotta and Pooneh Aminian\nMembers, entertainment department\nTroyGould\nAminian and DiMotta enter negotiations understanding that pushing for the best deals comes with risks, since clients’ careers are on the line. They helped Entangled Publishing’s Liz Pelletier launch Premeditated Prods. with Sherryl Clark, allowing the production company to license Entangled’s titles for film, TV, gaming and merchandising opportunities. Thanks to a multi-year deal with Amazon Studios, Premeditated had four projects in development within six months. Additionally, DiMotta represented comic book creator James Tynion IV in launching Tiny Onion Studios and secured him a 12-book, seven-figure graphic novel deal with a global publisher, and Aminian worked on several confidential transactions.\nTraits attorneys need: Patience, creativity and a sense of humor. “A sense of humor is the biggest one for me, particularly right now,” says DiMotta. “[It’s] not something we’re taught in law school. You really have to learn it on the fly.”\n-\nDavid Eisman and Glen Mastroberte\nPartners\nSkadden, Arps, Slate, Meagher & Flom\nEisman and Mastroberte endured their fair share of late-night calls to close their biggest deal of 2024, helping Mumbai-based Reliance Industries — the largest private sector corporation in India — put together its $8.5 billion joint venture with the Walt Disney Company and Viacom 18 Media Private to merge its digital streaming and TV assets. The duo also assisted Downtown Music Group in its $775 million sale to Virgin Music Group and repped Drake’s music label OVO Sound in the sale of a majority stake in its catalog and artist roster to Sony Music affiliate Santa Anna Label Group.\nHelpful AI?: “We have many very optimistic clients believing that you can use AI to decrease a budget by 30%,” says Mastroberte. “That’s a big savings and something the industry really needs. If AI is used constructively and carefully, it can have significant benefits.”\n-\nEvie Whiting, Emily Zipperstein, Russell (Rusty) Weiss and Eric Geffner\nPartners\nSidley Austin\nThe Sidley team worked behind the scenes on many deals that shape what we see, hear and buy in the world of entertainment, sports and consumer products. Most notably, they advised A24 Films on a wide range of financing and co-financing arrangements and L.A.-based National Women’s Soccer League’s Angel City Football Club on the sale of a controlling stake to USC Annenberg School for Communication and Journalism dean Willow Bay and her husband, Disney CEO Bob Iger, that gave the team a $250 million valuation. They also repped DWS Group and Cutting Edge Group in the creation of a joint venture with Warner Bros. Discovery that constitutes one of the most valuable music rights deals ever, and worked with Sidley Austin partner Matthew C. Thompson on Dwayne Johnson’s sale of a majority ownership in his ZOA Energy drink brand to Molson Coors and the launch of his personal care line Papatui.\nBiggest win: “We built a team to meet this moment,” Whiting says, referring to its ability to flourish despite strikes and consolidation in the industry and an uncertain U.S. economy.\n-\nMatthew C. Thompson\nPartner; co-leader, entertainment, sports and media group\nSidley Austin\nThompson’s recent deals include several beverage-related transactions, notably Alex Cooper’s (“Call Her Daddy”) multiyear partnership with Nestle to launch the women’s focused hydration drink Unwell and Dwayne Johnson’s sale of a majority ownership in his ZOA Energy drink brand to Molson Coors, as well as the securing of separate credit facilities with JPMorgan and EastWest Bank for Ben Affleck and Matt Damon’s production company Artists Equity. The talent “realize they’re a brand themselves and can do something with it,” says Thompson, leading to more partnerships instead of sponsorship, adding that Cooper’s Nestle partnership could ultimately be a billion-dollar deal.\nAdvice to younger self: Say “yes.” “Just try everything,” he says. “Unless you’re spending an evening in a hotel room with Johnny Depp and Hunter S. Thompson.”\n-\nDaniel Schnapp\nPartner; co-leader, music, artificial intelligence, interactive media and technology transactions teams\nSheppard Mullin Richter and Hampton\nSpending 30-plus years at the intersection of emerging technologies, entertainment and media prepared Schnapp for one of his most notable landmark cases: representing News Corp in negotiating a strategic collaboration allowing OpenAI to leverage certain News Corp content. The largest deal of its type to date, the agreement Schnapp structured centers on responsible and ethical use of generative AI while prioritizing journalistic integrity and attributing real value to the ultimate rights holders.\nOnly in Hollywood: “I was involved recently in a negotiation of an agreement with a major digital service provider on behalf of an A-list talent to remain nameless,” he says. “The deal itself was put on hold because the talent’s astrologer indicated that Mercury was in retrograde, and it was a bad time to close.”\n-\nRobert Darwell, Ramela Ohanian, Keith Kelly and Segun Aluko\nSenior partner; head, global media\nPartner\nSenior associate\nSenior associate\nSheppard Mullin Richter and Hampton\nThe very definition of team players, Darwell, Ohanian, Kelly and Aluko share an entrepreneurial spirit and a unique facility for serving international clients. Darwell says 12 languages are spoken fluently by the approximately 28 attorneys in the department, some of whom are licensed to practice law in other countries, like Aluko, who is also licensed in Nigeria. The four often overlap on projects, but don’t always all work on the same things. They handle numerous rights agreements and negotiations for Amazon MGM Studios, plus clients such as Skydance Sports, Feld Entertainment and Gaumont France. Much of their work for Meta remains confidential, but their efforts helped the Ray Ban Meta smart glasses Super Bowl commercial featuring Chris Pratt, Chris Hemsworth and Kris Jenner get made.\nRipe for a comeback: Civility and responsiveness in negotiation. “Entertainment law has a reputation for having a lot of big personalities, screamers and tough negotiators, but I think you can be a zealous advocate and still be civil,” says Darwell. “And the more responsive you can be, the more likely the project is going to get done.”\n-\nShaun Clark, Robb Klein, Aerin Snow and Genevieve Perez\nPartner\nPartner\nPartner\nSpecial counsel\nSheppard Mullin Richter and Hampton\nClark, Klein and Perez all handle entertainment transactions, with Clark focusing on sponsorships and advertising deals and Perez technology transactions, while Snow specializes in corporate entertainment transactions. But they work closely as a team to ensure all of their clients benefit from the overall breadth of their collective experience. One deal that Klein is proud of was working with Toho Co. in acquiring a 25% stake in shingle Fifth Season, in part because it involved close collaboration among the team’s corporate colleagues. Another fun project: representing QVC in a sponsorship and broadcast deal regarding rights to exhibit the USA Pickleball National Championships live on the QVC+ and HSN+ streaming services.\nSurvival tactic: Stay calm, “which also turns into a necessary evil,” says Klein. “It’s a very stressful job that we do, particularly when we have demanding timelines, demanding clients. Staying calm through the storm is the key to longevity and success.”\n-\nAshley Yeargan\nPartner; co-chair, media & entertainment\nRuss August & Kabat\nExpanding her litigation practice to include transactional work broadened the types of projects Yeargan works on. Among other accomplishments in the past year, she helped Simon Cowell’s Syco company branch into new territory by negotiating agreements with Box to Box Films and Netflix for a new docuseries, advised Tokyo Broadcasting System Television on IP protection in adapting its various Japanese properties for global markets and defended Black Label Media in a copyright case involving music used in the 2022 biopic “Whitney Houston: I Wanna Dance With Somebody.”\nSurvival tactic: Reality television. “I will admit, I watch the ‘Real Housewives’ franchise, ‘The Traitors’ and pretty much all of the HGTV house flipping shows, ‘Flip or Flop,’ ‘Celebrity IOU’ [and] ‘The Flip Off,’” she says.\n-\nStanton “Larry” Stein\nPartner; co-chair, media & entertainment\nRuss August & Kabat\nOver time, Stein’s litigation practice has expanded beyond contract disputes and profit participation cases to protecting celebrities’ names, likeness, brands and sometimes their physical safety. With his team, Stein recently resolved a copyright dispute on behalf of Donna Summer’s estate and got a $2.5 million negligent security verdict against Drake overturned. They’re currently working with local counsel in Georgia to defend indie record label Listen to the Kids Distribution in litigation surrounding its recording agreement with rapper Yeat.\nCivil service: “A lack of civility and cooperation causes clients to spend more money, makes it less likely that you can find a reasonable resolution, and makes litigation more costly and time consuming,” he says. “I think judges are getting frustrated with it. I know I am.”\n-\nBennett A. Bigman\nPartner, media & entertainment\nRuss August & Kabat\nWhether it’s recovering profit participation payments and royalties, creating licensing deals or battling copyright infringement, Bigman often negotiates confidential settlements for his A-list clients. In the past year, the litigator represented film financer Black Label Media in profit participation audits of “La La Land” and “Sicario,” oversaw profit participation issues for producers Gold and Silver Coin Shop (“Pawn Star”) and A. Smith Prods. (“Kitchen Nightmares,” “Hell’s Kitchen”) and obtained film credit and payment for husband and wife team Ken Cinnamon and Karen Wengrod of Two K Prods. as the co-writers of the animated feature “10 Lives.”\nBack to basics: “Certain streamers are realizing they should be spending their energy, time and money creating the content itself rather than focusing on the delivery system,” he says.\n-\nElsa Ramo and Michelle Chang\nFounder; managing partner\nManaging partner\nRamo Law\nAs the firm celebrates its 20th anniversary this year, Ramo and Chang continue to support independent studios (Boardwalk Pictures, Image Nation, Lion Forge, AGC) and champion cutting-edge filmmakers (Sarah Winshall, Zackary Drucker). They’ve also been helping further the implementation of AI technology, brokering a license agreement for an AI voice of Winston Churchill for Imagine Entertainment’s “Churchill at War” and working with Promise Studios to develop best practices for AI use while mitigating risk, which is no easy task. “When we’re in prep on something, we may make decisions around AI, and by the time we’re in post, the case law or unions may change their perception around it,” says Ramo.\nCraziest clause: Morals provisions. “The streamers wanting it, the unions not acknowledging it, and just that friction point, especially because ‘morals’ is a subjective word [and] could mean a lot of different things for a lot of different people,” says Ramo.",
  "word_count": 15390,
  "scraped_at": "2026-02-14T12:19:57.909140"
}