{
  "article_id": "bda9ce38ace2",
  "url": "https://www.southernminn.com/faribault_daily_news/news/state/in-ncaa-streamlining-the-big-conferences-get-more-power-but-not-everything-they-wanted/article_94910c9b-f4a0-4bde-b4c6-b6d3d017ed86.html",
  "title": "In NCAA streamlining , the big conferences get more power , but not everything they wanted",
  "date": "20250806T203000Z",
  "domain": "southernminn.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Major decisions by the NCAA’s top decision-making body will need approval from all four major conferences — or help from a smaller conference — to pass under a set of rules approved Tuesday that are designed to streamline the way business is done by the nation’s largest overseer of college athletics.\nThe Southeastern Conference had been pushing for it and the other three power conferences to receive a 17% voting share on the newly reshaped Division I Board of Directors, so that if one of the four conferences disagreed with a proposal the others could still band together to pass it with 51% of the vote.\nBut the legislation only increased their voting share to 16.1% each, which gives each conference power to waylay a policy it doesn’t like.\nThe D-I board deals with finances, litigation and infractions unrelated to conditions set in the $2.8 billion antitrust settlement that allows schools to pay players as of July 1.\nThough the NCAA plays virtually no role in overseeing Bowl Subdivision football, which is run by the College Football Playoff, this is the latest in an ongoing push to give the biggest, football-playing schools more autonomy in making decisions across the college landscape. The vote also won’t directly impact the future of March Madness, where expansion has been on the docket but won’t come this year.\nSeparately, the D-I board introduced a proposal to create three additional “units” to pay out for the men’s and women’s basketball tournaments. They would go to the finalists in each tournament. “Units” are worth around $2 million and are commonly distributed to the conferences of the teams that play.\nThe main business of this week’s meetings was to reduce the number of members on the board from 24 to 13 people, with the representatives from the Power Four having a little more than four times the voting power than the rest. If one Power Four member disagreed with the other three, then one of the other nine members could still help a measure pass by voting in favor of it.\nIn May, SEC Commissioner Greg Sankey said the reason he sought more voting power was “because you can’t just have someone walk away at that level among four and everything stops.”\nThe NCAA touted the elimination of about 32% of its Division I committees as a strong signal that a long-running streamlining process was working. It also said athletes will have 40 more seats across 30 committees and will have voting seats on almost all them.\nNeither Sankey nor the other three Power Four commissioners immediately responded to requests from The Associated Press for comment.\nIn a news release, the NCAA supplied reaction from six college sports leaders, only one of whom — Virginia Tech President Tim Sands, who is chair of the NCAA board — represented a power conference.\n“The board’s vote to implement this new structure reflects the association’s commitment to a modernized approach to governing ourselves moving forward,” Sands said.\nSun Belt Commissioner Keith Gil, who is chair of the men’s basketball committee for the upcoming season, said he applauded the board’s work.\n“While I recognize that all constituencies did not get everything they desired, it is a good governance framework that will allow all of us to thrive amidst the evolving collegiate athletics landscape,” Gil said.\nLet the news come to you\nGet any of our free email newsletters — news headlines, e-edition, prep sports, obituaries, entertainment and more.\nExplore newsletters",
  "word_count": 579,
  "scraped_at": "2026-02-14T14:18:50.144795"
}