{
  "article_id": "bdd579daf624",
  "url": "https://thepeoplesperson.com/2026/02/12/fa-firmly-shut-down-thomas-tuchel-and-man-united-claim-306428/",
  "title": "FA firmly shut down Thomas Tuchel and Man United claim - Man United News And Transfer News",
  "date": "20260213T014500Z",
  "domain": "thepeoplesperson.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Football Association chief executive Mark Bullingham has rubbished a claim involving England boss Thomas Tuchel and Manchester United.\nTuchel rules himself out\nFollowing the sacking of Ruben Amorim in December last year, Tuchel’s name was repeatedly mentioned as a likely permanent successor for the Portuguese coach.\nIn the immediate aftermath of Amorim’s dismissal, United appointed Michael Carrick to see out the remainder of the season as interim head coach.\nThe club emphasised that Carrick’s role is temporary, affording them sufficient time to evaluate their options and secure the best candidate in the summer. Carrick’s success so far has sparked some debate about whether he should be considered for the permanent position, but it’s thought United are still keeping an eye out.\nA recent report covered by The Peoples Person relayed that Tuchel was emerging as United’s preferred candidate.\nBut in a stunning twist, news broke within 24 hours that Tuchel had committed to a new contract, keeping him at the helm of England beyond the 2026 World Cup.\nTuchel has put pen to paper on an extension through to the end of the European Championship in 2028. In doing so, he has effectively ruled himself out of the running for the Old Trafford hot seat.\nThere have been suggestions that England acted to avoid Tuchel becoming entangled in a managerial merry-go-round, with clubs such as United searching for a new manager, prompting them to offer him fresh terms.\nHowever, Bullingham has dismissed such talk.\nTuchel and United claim dismissed\nBullingham told reporters [as quoted by ESPN], “We’ve appointed him with a view to him being our coach for 2028. Every single person has performance conditions in their contract, you wouldn’t expect me to go into those.”\n“I’ve got them as well, but we’re really clear that we want him coaching us in 2028.”\nHe added, “Whenever we’ve got any tournament, we want to know where we are a few months ahead. We’ve seen that with [England women’s head coach] Sarina [Wiegman] before and with Gareth [Southgate] previously as well.”\n“We tend to want to know where we are, to remove that uncertainty when you’re going into a tournament, it gives everyone — the support team and the players — that certainty.”\nBullingham stressed that United’s job availability was not in their thinking and discussions with Tuchel kicked off long before Amorim’s exit.\n“The conversation evolved very naturally after we qualified. From our point of view, it’s just a really natural evolution. We felt like he was really enjoying the job.”\n“He’s really enjoyed going to work in international football. The time it allows you between each game to plan, I think he’s really enjoyed that, and just bought into the challenge of that.”\nOther managers who have been linked with the United job include Roberto De Zerbi, Oliver Glasner, Andoni Iraola and Luis Enrique.\nThe Peoples Person has been one of the world’s leading Man United news sites for over a decade. Follow us on Bluesky: @peoplesperson.bsky.social",
  "word_count": 497,
  "scraped_at": "2026-02-14T12:37:55.487261"
}