{
  "article_id": "bde136805151",
  "url": "https://www.theguardian.com/world/2025/mar/12/wednesday-briefing-will-kyivs-commitment-to-a-ceasefire-appease-trump-and-pressure-putin",
  "title": "Wednesday briefing : Will Kyiv commitment to a ceasefire appease Trump – and pressure Putin ? | Ukraine",
  "date": "20250312T080000Z",
  "domain": "theguardian.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Good morning. Just 11 days after Donald Trump kicked Volodymyr Zelenskyy out of the White House for being insufficiently grateful, negotiations over a ceasefire in Ukraine have taken on a new complexion again.\nAfter day-long talks in Jeddah, Saudi Arabia, officials from Kyiv and Washington declared that they had agreed on an immediate 30-day ceasefire plan and called on Russia to do the same. The United States will now lift restrictions on military aid and intelligence sharing. And the deal to give the United States a 50% stake in revenues from Ukrainian minerals is back on the table.\nUkraine is still a long way from a durable, secure peace, and in one sense the success of yesterday’s talks was predicated on a grim recognition – unlikely to be articulated – of how thoroughly Trump has sold out Zelenskyy and Ukraine. But it is also true that Moscow’s actions will now be judged against an unambiguous backdrop. Trump’s special envoy, Steve Witkoff, is expected to see Vladimir Putin in Moscow in the coming days – and, as Volodymyr Zelenskyy said yesterday, “Russia must show its readiness to end the war or continue the war. It is time for the full truth.”\nToday’s newsletter explains what happened at the talks, and what might happen next. Here are the headlines.\nFive big stories\n-\nTrump tariffs | Donald Trump’s tariffs on steel and aluminum imports took effect on Wednesday “with no exceptions or exemptions”, as his campaign to reorder global trade norms in favour of the US stepped up. In chaotic developments on Wednesday, the US threatened to double tariffs on Canadian steel and aluminium but then reversed course.\n-\nUK news | A BBC presenter whose family were murdered by a misogynist with a crossbow has said he hopes women can be inspired by how his daughter ended her relationship with her killer. On the day that Kyle Clifford was sentenced to a whole-life order for the triple murder last year, John Hunt described the former soldier as a psychopath disguised as an ordinary human being.\n-\nNorth Sea collision | A 59-year-old man has been arrested on suspicion of gross negligence manslaughter in connection with the shipping collision in the North Sea. Humberside police said they had opened a criminal investigation into the collision, in which one seaman is believed to have died.\n-\nPhillipines | The former Philippine president Rodrigo Duterte has left Manila on a plane headed to The Hague, hours after he was served with an arrest warrant from the international criminal court over the killings resulting from his “war on drugs”.\n-\nClimate crisis | Climate whiplash is already hitting major cities around the world, bringing deadly swings between extreme wet and dry weather as the climate crisis intensifies, a report has revealed. Dozens more cities, including Lucknow, Madrid and Riyadh, have suffered a climate “flip” in the last 20 years.\nIn depth: Is this really an end to the White House’s ‘Mean Girls’ view of the Ukraine crisis?\nOne measure of the public shift in tone between Ukraine and the United States came in US secretary of state Marco Rubio’s comments after the talks in Jeddah yesterday. Previously, he has attacked Zelenskyy over the notorious Oval Office meeting, saying that “he found every opportunity to try to ‘Ukraine-splain’ on every issue”. Yesterday, he said: “What’s back on track here hopefully is peace. This is not Mean Girls.”\nThat represents a significant success for Ukraine - but it has come at a cost. Here’s what emerged from the talks, and where it leaves the key players.\nJeddah talks | Success for Ukraine – but significant concessions\nUkraine went into the talks saying that it was ready to consider a ceasefire in the air and at sea, but not on the ground - arguing that a full ceasefire without more permanent guarantees would simply allow Russia to regroup. It also said that any ceasefire would have to include security guarantees.\nBy that measure, Kyiv made significant concessions yesterday. A joint statement from Ukraine and the United States said that “Ukraine expressed readiness to accept the U.S. proposal to enact an immediate, interim 30-day cease-fire”, including on the ground, if Russia would make the same commitment.\nAnd there was no mention of security guarantees in the joint statement: while US national security adviser Michael Waltz said that “we … got into substantive details on how this war is going to permanently end, what type of guarantees they’re going to have for their long term security and prosperity”, that may simply be a reference to the minerals deal which now appears to be back on the table.\nBut Ukraine made real progress - securing an immediate end to the suspension of intelligence sharing and military assistance, and extracting Rubio’s recognition that Russia now has to take its own steps toward peace. Perhaps just as significant is the possibility that Trump will be better disposed toward Kyiv, at least for now. He has said that he is now open to Zelenskyy returning to the White House, and said of a ceasefire: “Ukraine has agreed to it. Hopefully President Putin will agree to that also.”\nPressure on Russia | A new equation for Putin to resolve\nThe phrase used by Marco Rubio, and repeated by Keir Starmer and Emmanuel Macron, was that “the ball is now in Russia’s court”. Donald Trump had his own corny analogy, saying that he would speak to Vladimir Putin about the ceasefire proposal this week and adding: “It takes two to tango”.\nBut in its first substantive responses to the developments from Jeddah, Moscow did not present itself as an enthusiastic dance partner this morning. Foreign minister Sergei Lavrov was reported by Russian news agencies to have said that Russia will not make compromises that would “jeopardise people’s lives”. And Russian Foreign Ministry spokeswoman Maria Zakharova said: “The shaping of the position of the Russian Federation does not take place abroad due to some agreements or efforts of some parties.”\nRussia has always had its own conditions attached to any steps towards peace. In this piece, Dan Sabbagh explains that while Russia has been talking about a ceasefire, it has said that it must be accompanied by elections in Ukraine.\nKyiv will now hope that yesterday’s developments have sufficiently soothed Trump’s irritation with Zelenskyy that he will now look more sceptically at Russian claims that it is Ukraine that is blocking a ceasefire. They do appear to have removed some of the ambiguity around which side is holding up that process.\nWhile Russia has made no serious moves to show that its position is held in good faith, Vladimir Putin must now decide whether the favourable position he now holds with Trump will come under threat if he obstructs the proposals that have emerged from Jeddah – or whether he cares. Russia may also calculate that it can feint towards a ceasefire while making additional demands and continuing to attack Ukraine – and still persuade the White House that it wants peace.\nEuropean reaction | Key questions over any international force\nMeanwhile, in Paris, military chiefs of staff from more than 30 European and Nato countries held talks on an international security force. French president Emmanuel Macron, who addressed the meeting, said that “it was the moment for Europe to exert its full weight, for Ukraine and for itself”. Defence ministers from the five leading military powers in Europe – the UK, France, Germany, Italy and Poland – will hold further talks today.\nParis also said that any security guarantees “should not be separated from Nato and its capabilities” and should be “credible and long-term”. But the Associated Press reported that there is no definitive plan for military options yet. Here are some of the key questions that remain unanswered:\nWould the force be “peacekeepers”, intended to monitor breaches of the ceasefire and keep the two sides apart; a “tripwire”, a small force whose sheer presence would create a threat of escalation in the event of a Russian advance; or a much larger “deterrent”? This post by the leading defence analyst Lawrence Freedman sets out the case for each; there is little sense that Nato countries have the will or capacity for a full-scale deterrent force.\nCan the US be persuaded to guarantee the kind of “backstop” – a commitment to US military action if a tripwire force came under attack – to deter Russia from a new offensive? Trump has offered little comfort on this point so far. In this piece, the International Crisis Group argues that it is counterproductive for Ukraine and Europe to pursue this idea, but the reference to Nato’s role may suggest that it is still theoretically in play.\nWould Russia sign up to any deal involving European troops on the ground in Ukraine? Moscow has emphatically refused to countenance such an arrangement, a point reiterated by Lavrov this morning; Trump has claimed, with little evidence, that Putin is prepared to consider the idea. In this piece on the security analysis site War on the Rocks, Jack Watling and Michael Kofman argue that the most important thing is that no peace deal excludes the possibility, even if it is not explicitly endorsed.\nMilitary exchanges | Frantic attempts to maximise leverage for talks\nBoth sides are still seeking leverage in anticipation of ceasefire negotiations. Ukraine launched drone attacks on 10 Russian regions including Moscow yesterday, the biggest such operation it has conducted since the start of the war. Andriy Kovalenko, a Ukrainian national security council official, said that “this is an additional signal to Putin that he should also be interested in a ceasefire in the air”.\nBut – despite Ukraine’s formidable drone production capacity, with the country’s armed forces expecting to buy 4.5m drones from domestic suppliers this year – such attacks are always likely to be confined to psychological operations rather than a route to significant tactical advantages.\nRussia, meanwhile, has continued with aggressive ground operations. A situation report from the Institute for the Study of War published on Monday set out the recent success of Russian and North Korean forces taking back Russian territory in Kursk oblast, and the most recent reports suggest that Ukrainian forces are now under threat in the village of Sudzha, their last significant foothold.\nBut the ISW also notes that in most areas within Ukraine, Russia has failed to make significant recent gains. If the land offensive within Ukraine remains at an impasse, the Kremlin has dramatically stepped up aerial attacks, with massive ballistic missile and drone strikes aimed at critical infrastructure last week. In the aftermath of that attack, Trump said that he was considering new sanctions on Russia. None have yet come into force.\nWhat else we’ve been reading\n-\nAnastacia talks to Paula Cocozza about her life, from mutilating her sister’s dolls, to chart-topping success and her “toxic titties” – despite overcoming breast cancer twice, she’s lost none of the exuberance that propelled her musical success. Toby Moses, head of newsletters\n-\nAfter the arrest of Rodrigo Duterte yesterday, it’s worth going back to coverage of the horrors exacted by his “war on drugs” in the Philippines. This wrenching 2018 piece by his biographer Jonathan Miller tells the story of one family that lost a father and child in the crackdown. Archie\n-\nDavid Squires is in typically excellent form skewering the Fifa president’s transparent attempt to cosy up to the new king in the White House. The combo of Donald Trump and Gianni Infantino is a truly horrifying glimpse at the world we live in. Toby\n-\nMarina Hyde ponders the reaction of a Southampton fan in 2009 to the subsequent rise of Rupert Lowe: “In 16 years’ time, the richest man in the world – who’s the unofficial vice-president to Donald Trump, yes, the one off the US Apprentice – will say that Rupert Lowe should be prime minister of the United Kingdom.” Rupert Lowe?! RUPERT LOWE?!?!?! I honestly think the resultant psychiatric eruption would blow the roof off the mall.” This is correct. Archie\n-\nWhat happens when gen Z and millennials swap jeans? It’s the question everyone’s asking, and luckily we have the answer, with Emma Loffhagen trading trousers with her older colleague, our fashion editor Morwenna Ferrier: “After a few hours of wearing them, I’ve never known comfort like it. I’m just not sure it’s very dignified to be aggressively on trend at my age.” Toby\nSport\nFootball | Gianluigi Donnarumma saved two penalties as PSG beat Liverpool 4-1 in a shootout to send the Paris side through to the quarter-finals. Darwin Nunez and Curtis Jones were both denied from the spot after PSG won the second leg 1-0.\nHorse racing | Jeremy Scott’s mare Golden Ace emerged as one of the most unexpected of all Champion Hurdle winners on day one of the Cheltenham festival. Golden Ace, a 25-1 shot, won after 2023 and 2024 champions Constitution Hill and State Man were fallers.\nFootball | Manchester United have confirmed their intention to build a new 100,000-capacity stadium in the Old Trafford area, leaving their home of 115 years. Officials claim that the project, which United co-owner Jim Ratcliffe compared to the Eiffel Tower, will create as many as 92,000 jobs and 17,000 new homes in Greater Manchester.\nThe front pages\nThe Guardian leads with “US says ‘ball in Russia’s court’ as Ukraine agrees 30-day ceasefire”. The deal dominated UK headlines on Wednesday with the Times running with “Kyiv open to ceasefire as Trump restarts aid,” the i with “Ceasefire in Ukraine - if Putin agrees,” and the Daily Mail “Ukraine agrees ceasefire deal.” “Putin told to agree Ukraine ceasefire,” was the take IN the Telegraph.\n“Trump ratchets up Canada trade war with 50% aluminium and steel tariffs,” writes the Financial Times. The Express follows the latest on the crossbow killer with the headline: “‘I am so proud of all my girls’”. The Mirror runs with “Jail … then hell” and the Metro: “‘They’ll roll out the red carpet in hell’”.\nToday in Focus\nCan Canada’s ‘rockstar banker’ PM take on Trump and win?\nThe former governor of the Bank of England has a new role – saving his country from becoming America’s 51st state. Leyland Cecco reports\nCartoon of the day | Rebecca Hendin\nThe Upside\nA bit of good news to remind you that the world’s not all bad\nThe Guardianas del Conchalito are a group of women who ignored calls to “get back to the kitchen” to create a sustainable shellfish project in Mexico. In 2017, the women were hanging out in La Paz, in the Mexican state of Baja California, and gazing at a polluted mangrove plantation. Drug dealers and tourism were ruining the area, and illegal fishing was depleting the shellfish population. “The mangroves were dying, the trash was everywhere,” Graciela “Chela” Olachea, told the Guardian’s Joanna Moorhead. The women cleaned up the mangrove and sought out funders to help make it sustainable, turning the Guardianas del Conchalito into a legally recognised community cooperative that pays members a living wage. But the project hasn’t only transformed the mangroves, it’s transformed thewomen’s lives. As Guardianas member Rosa María Hale Romero put it: “I used to ask my husband’s permission if I wanted to leave the house. Now if I go out, I just tell him: ‘I’ll be back.’ And instead of me serving him, he brings me my coffee.”\nBored at work?\nAnd finally, the Guardian’s puzzles are here to keep you entertained throughout the day. Until tomorrow.",
  "word_count": 2595,
  "scraped_at": "2026-02-14T13:44:19.878847"
}