{
  "article_id": "be02df13259b",
  "url": "https://www.nzherald.co.nz/bay-of-plenty-times/news/new-zealands-future-stars-teenage-athletes-to-watch/CK4PS2MNMBDVBITAR2XQ3WKUKU/",
  "title": "New Zealand future stars : teenage athletes to watch",
  "date": "20250808T073000Z",
  "domain": "nzherald.co.nz",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "This Herald Premium Sport story was first published in August.\nAfter the Herald’s 20 Under 20 list had the New Zealand sports scene buzzing in January, we’ve gone two steps further. Here are 18 athletes under 18 who made waves on both domestic and international stagesover the past year and are poised for even bigger things ahead. The athletes are aged 18 or younger as of August 2025. The list is in no particular order.\nNew Zealand’s middle-distance prodigy Sam Ruthe became the world’s youngest person to break the four-minute-mile barrier in March, running 3m 58.35s at the age of 15.\nThe now 16-year-old middle and long-distance runner has claimed senior national titles in the 1500 and 3000 metres and continues to lower his national under-17 and under-18 records.\nHe recently came within 0.4 seconds of Sam Tanner’s under-19 and under-20 New Zealand records.\nJessica Ready, skateboarding, 15\nReady collected a bronze medal at the pinnacle of skateboarding competition, the X-Games, last month.\nCompeting in the women’s street event in Utah, she scored 83.66 on her final run to secure a spot on the podium. The teen’s result was unexpected as she only received an invitation just six days out from the competition.\nHaving previously won three consecutive Women’s Street titles at the New Zealand Skateboarding Nationals, Ready is now targeting the 2028 Olympics in Los Angeles.\nSorensen-McGee burst on to the scene for the Blues this year, scoring six tries in eight games to help the Auckland-based side defend their Super Rugby Aupiki title, beating Matatū in last month’s final.\nHer performances earned her a Black Ferns call-up, where she scored two tries on debut. The youngster is hungry and agile and will be a key player for New Zealand in their Rugby World Cup title defence in England next month.\nMollie King, weightlifting, 17\nKing claimed two medals at the World Youth and Junior Championships in Peru. In the youth class (13-17), the Whanganui teen claimed a silver in the clean and jerk and bronze overall. She was eighth overall in the junior class (15-20). The head girl at Whanganui Girls’ College was only 2kg off the gold and 1kg off the silver in the overall youth rankings.\nThe teen is looking toward the 2026 Commonwealth Games in Glasgow and the 2028 Olympics.\nLuke Brooke-Smith, football, 17\nThe teenage forward made a great contribution to the Wellington Phoenix in his first season. He became the youngest Kiwi to ever play A-League football when he debuted in the 2024-25 season. In 14 appearances, he scored one goal and did so against club rivals, Auckland FC.\nHe has starred for New Zealand age group teams, including when he scored five goals, in a 7-1 group win over Fiji at the Fifa U17 World Cup qualifying tournament last year.\nHis abilities have impressed Newstalk ZB’s voice of football, Jason Pine, so much so that Pine told the Football Fever Podcast that Brooke-Smith could be on track for an All Whites call-up for the Fifa World Cup next year.\nGrowing up, Brooke-Smith was a competitive BMX rider, in which he won eight national age-group championships.\nAt just 17 years old, Tuumaialu has already represented Aotearoa across three sporting codes. In 2024, her standout performances helped the Counties Manukau Under-18 Touch team secure the national title, earning her a spot in the Touch Blacks Open Women’s squad. The team went on to win silver at the World Cup in Nottingham.\nTuumaialu has also worn the fern in basketball, representing New Zealand at both the Under-15 and Under-17 levels. On the netball court, she played a pivotal role in leading St Kentigern College to the finals of the NZ Secondary Schools Championships, which led to her selection in the 2024 Secondary Schools Netball Squad.\nZoe Beck, bowls, 14\nBeck began bowling at the age of 9, competing in twilight leagues with her mum and nana. In 2023, at 13, she became the youngest person in the region to win a bowls open after taking out the Southland women’s triples title.\nDemonstrating great ability at a young age, Beck was invited to compete at the national under-21 competition in Wellington in March, where she won eight out of 12 games.\nXavier Bell, cricket, 18\nFrom picking up a sponsorship by top cricket brand Kookaburra in year 11 to smashing a century in his St Peter’s Cambridge first XI debut, Bell is a legit prodigy in the sport.\nLast year, on a tour to England, Bell scored 338 runs off just 184 balls in a two-day game against Forest School.\nInvolved in the Northern Districts A team, Northern Districts U19 team, Hamilton men’s team and his premier club Marist Suburbs, Bell was named the top run scorer across the country for the Men’s A cricket, with 534 runs.\nBell has just secured his first Northern Districts central contract, so he will play professional cricket in 2025/26.\nJackson Ball, basketball, 17\nWith a last name like Ball, the 194cm tall basketballer is making waves in the sport. The Napier Boys’ High School student became the third youngest to play for the Tall Blacks – after being named in the squad for two Asia Cup qualifiers in February.\nHe helped lead both the Under-17s and the Junior Tall Blacks to fourth placings at recent World Championships and has signed with the Illawarra Hawks as a development player for the upcoming NBL season before he heads to the University of Wisconsin next year, where Tall Blacks great Kirk Penney is an assistant coach.\nLily Greenough, BMX, 17\nThe Cambridge teen this month claimed the junior women’s title at the 2025 UCI BMX Racing World Championships in Copenhagen, in the treacherous conditions.\nShe won her quarter-final, semifinal and then was faultless on a wet track in the final to claim gold after taking bronze in 2024.\n“Honestly, it is incredible. I couldn’t have asked for a better outcome. Throughout the whole day, keeping it together especially in the wet weather – unbelievable. I can’t believe it yet,” said Greenough.\nGreenough’s older brothers, Jack and Bennett, were also competing at the BMX Racing World Championships in the under-23 and the elite competitions, respectively.\nCooper Moore, golf, 16\nCooper Moore’s burgeoning career has reached another height as he claimed the Asia-Pacific Golf Confederation (APGC) Junior Championship Boys title at Hong Kong Golf Club in May, adding to his run of amateur titles in the last year.\nHe won the New Zealand Amateur Championship in November and the Australian Boys’ Amateur in April. He also played in his first New Zealand Open in Queenstown in February.\nIt was in spectacular fashion that the St Bede’s College Year 12 student won the Australian Boys’ Amateur too, holing out from a greenside bunker to end a dramatic three-hole playoff at Indooroopilly Golf Club in Brisbane.\nHe’s currently ranked 203rd in the world among amateurs and plays off a +4.2 handicap, including shooting a round of 62.\nJacqueline Kennedy, canoe, 17\nThe year 12 student at Gisborne Girls’ High School took up canoe racing in 2023 and has quickly turned into one of the country’s top young Olympic prospects - named Canoe Racing New Zealand’s Junior Athlete of the Year in February.\nAt the New Zealand Canoe Sprint Nationals in April, she took out the K1 200m, K1 500m and K1 1000m individual events in the U18 category, as a 16-year-old, and won the open K2 500m and K2 500m titles alongside Olympian Aimee Fisher.\nKennedy competed at the Junior World Championships last month. where she won the B final in the K1 500m and was fifth in the K2 500m B final with Stella Crossan.\nHer brother, Maxwell, 17, also races for the Poverty Bay Kayak Club, claiming three titles himself at the New Zealand Canoe Sprint Nationals.\nCormac Buchanan, motorcycle racer, 18\nThe fastest teen on two wheels. Invercargill’s Buchanan is the first New Zealander in almost 25 years to contest a full FIM MotoGP world championship season, currently racing in the Moto3 championship.\nThe KTM rider is racing in his rookie season and achieved his best finish of ninth last month in Germany. He currently sits 19th in the standings with a points finish in eight of the opening 12 rounds in what is considered the most cut-throat of the three classes (MotoGP and Moto2 the others) due to having the biggest fields and being packed full of the hungriest junior motorcycle racers in the world.\n“Moto3 racing is about finding a balance of being calm and then when to know to go a bit crazy and move up through the pack,” he told the Herald in May.\nAvah Sila, netball and sevens, 17\nA promising athlete across multiple sports. On the netball court, Sila played for the Northern Comets at goalkeeper this season and was named as a reserve in the New Zealand squad for the World Youth Champs.\nShe has also excelled at sevens and athletics. Sila was part of the Howick College side that won the Secondary Schools’ Condors tournament last year, and was also named in the New Zealand U-18 side in 2023.\nShe won gold in the Auckland and Counties Manukau secondary school athletics champs in both hurdles and high jump.\nKaraitiana Horne, motocross, 16\nThe Ruapehu College student already has two NZ Open Women’s Motocross Championship titles under her belt, winning her latest in March, along with five NZ Junior titles and the Australian Junior Title.\nBased in the North Island town of Raetihi, Horne was a finalist for Young New Zealand Rural Sportsperson of the Year and was the standout for the New Zealand team at the FIM Oceania Women’s Motocross Cup with three top 10 finishes.\n“For me, when I’m on the track, I don’t notice being puffed or anything; it’s only as soon as I get off my bike that I’m suddenly so hot and can’t breathe,” she told the Whanganui Chronicle earlier this year.\n“I just love racing – and I love winning as well.”\nLuke Harrold, freeskier, 17\nHarrod secured his first World Cup podium at just 15 in December 2023 before winning gold at last year’s Olympic Youth Games in the Halfpipe, as well as bronze in the Big Air.\nStepping up to the senior level, he certainly made a name for himself at the Freeski World Championships in March when he became the first person to ever land a switch left triple cork (three flips) in competition and finished in fourth place. He said it was the “scariest thing I have ever done”. Harrold backed that up with a podium at the European Cup in the slopestyle and seventh in the Big Air.\nThere’s no shortage of talent in New Zealand’s freeskier ranks. Finley Melville Ives, who turned 19 last month, won the event while 17-year-old Mischa Thomas placed ninth in the women’s freeski halfpipe finals.\nRoberts has won age-group national titles in both mountain biking and road cycling and is currently riding in Europe for the Groupama-FDJ team, competing in the Tour de Bretagne, Giro d’Italia Next Gen and the Tour Alsace.\nHe was 17th in the time trial at the junior World Championships last year and won the Oceania title. He was also second in the time trial at the National Championships and 18th in the road race.\nLucia Georgalli, snowboarding, 17\nGeorgalli was crowned the snowboard slopestyle Junior World Champion in 2023, the first Kiwi snowboarder to win the title.\nShe continued that form last year by winning two medals at the Olympic Youth Games in Gangwon - silver in snowboard slopestyle and bronze in the Big Air competition. Georgalli earned a top 20 finish at the most recent World Championships in Switzerland, finishing 19th with Kiwi Zoi Sadowski-Synnott seventh.\nBonnie Jansen is a multimedia journalist in the NZME sports team. She’s a football commentator and co-host of the Football Fever podcast, and was part of the Te Rito cadetship scheme before becoming a fulltime journalist.",
  "word_count": 1999,
  "scraped_at": "2026-02-14T12:43:52.722346"
}