{
  "article_id": "be048d568692",
  "url": "https://www.dailyrecord.co.uk/entertainment/celebrity/cast-90s-cult-classic-bring-35232432",
  "title": "Cast of 90s cult classic Bring It On now from surrogacy to tragedy",
  "date": "20250520T064500Z",
  "domain": "dailyrecord.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Cast of 90s cult classic Bring It On now from surrogacy to tragedy\nBring It On was released 25 years ago and starred Kirsten Dunst, Eliza Dushku, Gabrielle Union, and Jesse Bradford - but what has the cast been up to since then?\nIn the early noughties, cheerleading was a popular theme in films. One such film was Bring It On - a teen comedy filled with high kicks, backflips and squad rivalries, stolen routines and cheer justice.\nThe film was praised for its tackling of subjects like systemic inequality, cultural appropriation, and feminism - themes not commonly addressed in teen films of that era. But what became of its stars once the championships and on-set high school days were over?\nFrom Oscar nominations and Spider-Man fame, to real-life tragedy and life-altering allegations, here's what happened to the cast of Bring It On, 25 years on, reports the Mirror US.\nHere's what happened to the cast of Bring It On since the film's release:\nKirsten Dunst as Torrance Shipman\nBy the time she led the Rancho Carne Toros to nationals, Kirsten Dunst was already a darling of Hollywood. A former child star with a Golden Globe nomination to her name, she brought charm and emotional depth to captain Torrance, who tries to guide her team towards a scandal-free victory after discovering their routines were stolen.\nKirsten then leapt from teen comedy queen to blockbuster stardom with her role as Mary Jane Watson in the Spider-Man trilogy opposite Tobey Maguire. Between 2004 and 2006, she starred in Wimbledon, Elizabethtown and Marie Antoinette, before delivering a Cannes-winning performance in Melancholia (2011).\nHer career then took a turn towards television, with lauded roles in Fargo and On Becoming a God in Central Florida. In 2021, she shared the screen with her husband Jesse Plemons in The Power of the Dog, which earned her an Oscar nomination.\nShe returned to the limelight in 2024 with a starring role in Alex Garland's dystopian thriller Civil War, where critics praised her commanding performance. Away from the camera, Kirsten's personal life has had its share of highs and lows.\nShe was romantically involved with Jake Gyllenhaal in the early 2000s, and was briefly engaged to Garrett Hedlund before settling down with Plemons, with whom she has two sons. The couple tied the knot in Jamaica in 2022.\nEliza Dushku as Missy Pantone\nBefore portraying the cool and edgy outsider Missy Pantone - the gymnast transfer who reluctantly joins the Toros - Dushku was already recognised for Buffy the Vampire Slayer and roles opposite Arnold Schwarzenegger and Robert De Niro.\nAfter her cheerleading days, she led Tru Calling and reunited with Buffy creator Joss Whedon for Dollhouse. She later voiced She-Hulk in Marvel's Agents of S.M.A.S. H. and directed the 2015 documentary Dear Albania, exploring her cultural roots alongside her brother Nate.\nHowever, her stint on the CBS drama Bull ended abruptly when she alleged sexual harassment by co-star Michael Weatherly - a case that resulted in a significant settlement and a public reckoning in the TV industry. Since then, Eliza has stepped back from acting, focusing on academia and mental health.\nAfter returning to Boston and studying sociology and holistic psychology, she graduated in 2020. By 2024, she had become a certified therapist, specialising in psychedelic-assisted therapy for trauma.\nShe remains politically active and campaigned for Bernie Sanders in 2016.\nGabrielle Union as Isis\nAs the captain of East Compton Clovers, Isis, Gabrielle Union stole hearts even as the Toros' rival. Since her breakthrough, Gabrielle has been enjoying a prolific film and TV career, with credits ranging from Bad Boys II, Cradle 2 the Grave, and Think Like a Man to the BET hit Being Mary Jane and crime drama L.A.'s Finest.\nShe also became a successful author, penning two memoirs and two children's books, while her activism around women's health, LGBTQIA+ rights, and racial justice earned her and husband Dwyane Wade the NAACP Image Award President's Award. She was named one of Time's 100 most influential people in 2020.\nGabrielle married Dwyane in 2014 and became stepmother to his three children. In 2018, they welcomed daughter Kaavia James via surrogate.\nJesse Bradford as Cliff Pantone\nMissy's alternative-music-loving brother Cliff, played by Jesse Bradford, was the surprise romantic lead of Bring It On - a grunge sweetheart with a mixtape, a sense of humour, and a low-key cheerleading obsession. Jesse Bradford followed the film with back-to-back starring turns in Clockstoppers and Swimfan (both 2002), then landed a key role in Clint Eastwood's Flags of Our Fathers in 2006.\nOver the forthcoming decade, he featured in series such as Guys With Kids, Shooter, and Sequestered, and made a return to the cinema in films like The Year of Spectacular Men (2017) and Merry Kiss Cam (2022). A film graduate from Columbia University, Jesse is now happily married to Andrea Leal.\nTheir daughter Maggie arrived in 2021, just a day after his birthday.\nNatina Reed as Jenelope\nThe fiery Jenelope from East Compton Clovers was brought to life by Natina Reed - a multi-talented artist who was best known at the time as one-third of the RandB trio Blaque. Their 1999 hit 'Bring It All to Me' reached No. 4 in the Billboard Hot 100, and the group's appearance in Bring It On marked a crossover pop culture moment.\nHer later years were overshadowed by legal issues, including arrests for drink driving and driving without a licence. One 2010 arrest report – which included charges of prostitution and drug possession - was publicly disputed by her management, who claimed the mugshots were doctored by someone who had hacked her social media.\nNatina was once engaged to rapper Kurupt and is the mother of his son. After Blaque disbanded in the early 2000s, Natina stepped back from the limelight, with plans for a group comeback in 2012.\nHowever, tragedy struck on 26 October that year, just days before her 32nd birthday, when she was fatally hit by a car while crossing the street near Lilburn, Georgia.\nLindsay Sloane as Big Red\nBig Red, the red-haired, domineering former captain who had been copying the Clovers' routines for years, was only in a few scenes. Lindsay Sloane, who played Big Red, became a familiar face in comedies after Bring It On, often playing the neurotic best friend or providing comic relief.\nShe starred as Valerie, Sabrina's sweet but slightly clueless best friend, in Sabrina the Teenage Witch and later appeared in The Odd Couple, Weeds, Horrible Bosses and She's Out of My League. Offscreen, she leads a quiet family life.\nIn 2004, she married agent Dar Rollins and they have two daughters. Lindsay maintains a low profile, occasionally appearing in independent comedies or sitcom guest spots.\nNicole Bilderback as Whitney\nNicole Bilderback portrayed Whitney, one half of the mean girl cheer duo alongside Courtney. Nicole, already a teen movie regular with credits in Clueless, Can't Hardly Wait and Dawson's Creek, went on to appear in Dark Angel, Boston Legal, and Heroes, and has worked steadily in TV for over two decades.\nMoreover, she starred in the 2022 thriller The Ninth Order, playing a detective investigating a string of mysterious deaths. Offscreen, she's discussed the challenges of being an Asian-American actress in Hollywood, advocating for better representation and more nuanced roles.\nClare Kramer as Courtney\nPaired with Nicole Bilderback as the other half of the high-maintenance cheer duo Courtney, Clare Kramer is best known outside of Bring It On for her role as Glory in Buffy the Vampire Slayer, where she played a hell-god with a penchant for high fashion and violence. Since then, she's worked in film and television.\nClare has also launched a successful second act as a podcast host and convention organiser. She co-founded GeekNation, a hub for pop culture content, and has hosted red carpet events and fan QandAs for major franchises.\nShe's married to producer Brian Keathley, and they share four children.\nNathan West as Jan\nIn Bring It On, Nathan West played Jan, the spirited male cheerleader who was goofy, likable, and full of energy. Post-Bring It On, Nathan appeared in a handful of films including Miracle (2004), but his offscreen story may be better known than his onscreen credits.\nHe married actress Chyler Leigh (Lexie Grey in Grey's Anatomy) in 2002, after they met filming Not Another Teen Movie. The two have three children and formed the band WestLeigh.\nThey have been performing music together, in addition to publicly advocating for mental health and sobriety. Nathan has remained mostly behind the scenes in recent years, focusing on family and songwriting.\nBianca Kajlich as Carver\nBianca portrayed Carver, a character who became crucial to the film when her dramatic mid-air injury in the opening act kick-started the plot and paved the way for Missy to join the team. After Bring It On, Bianca established a strong TV career, featuring in Rules of Engagement, Undateable, and Bosch: Legacy.\nShe also made appearances in Halloween: Resurrection and Vanished. In 2024, she landed a recurring role on The Lincoln Lawyer, making a return to prime-time drama.\nShe was previously wedded to football star Landon Donovan and later tied the knot with radio personality Michael Catherwood, with whom she has a daughter.\nHuntley Ritter as Les\nHuntley played the sensitive, possibly gay cheerleader whose confidence and charisma made him a standout in the Toros line-up. Huntley continued acting briefly in the early 2000s (The Wedding Planner, We Are Marshall) but soon transitioned into business.\nHe set up a branding and digital content company centred around sports, faith and outdoor lifestyles. Moreover, in 2021, he launched a wellness brand inspired by his passion for hunting and environmental conservation.\nBy 2024, he was working as a motivational speaker and brand strategist. He's been married since 2007 and is a father to three children.",
  "word_count": 1640,
  "scraped_at": "2026-02-14T13:20:40.830523"
}