{
  "article_id": "be3a8fc40df2",
  "url": "https://africa.espn.com/olympics/handball/story/_/id/37911914/premier-handball-league-kuwait-women-referees-maali-al-nezi-dalal-al-naseem",
  "title": "Premier Handball League : Two women referees from Kuwait show how to make most of their passion",
  "date": "20230625T091500Z",
  "domain": "africa.espn.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "The debut season of the Indian Premier Handball League has shone a light on quite a few unknowns -- including the game of handball itself.\nBut two of those unknowns are unlike the others. They are a sight that's not often seen in the men's game... two women referees from Kuwait: Maali Al-Nezi and Dalal Al-Naseem.\nKuwait are handball heavyweights in this part of the world. Four-time champions of Asia, they are also gold (once) and silver (twice) medalists at the Asian Games. All that, though, is for the men's team. They women's team have only played two of 18 Asian Championships held till now: finishing 12th in 2012 and 10th in 2021 with a goal difference of -342 and -87.\nIt's a performance disparity that comes from a ground reality where there's just not enough game time for Kuwaiti women. Maali Al-Nezi played handball for eight years, or she attempted to. She grew up watching Kuwait dominate handball in Asia and there wasn't much doubt as to what she wanted to become. She started in school and was soon picked for the national squad.\nPremier Handball League: Little-known sport hopes to raise its game in new avatar\n\"I played my first game for the national team in 2012. At the Asian Championships. That's where I met the national team,\" she says. You can sense she's still quite astonished about that fact - with little to no preparation before the championships, it wasn't a big surprise that their goal difference read -342.\nMaali speaks about how the games she used to play at the domestic level were horribly one-sided, where scorelines were often 30-0 or worse. \"That's not handball. This didn't improve us. We'd wait for the national team [call-up] and go play internationally to gain experience,\" she says.\nVery often there wasn't even a national camp. \"It was not good for us. We'd lose by high scores. That's why I went to refereeing, to whistle games, because I thought this had a better future.\"\n\"Even if I'm fighting alone in the national team, nothing will happen. I go to practice, every day I go to the gym. But we are a team of seven players. I was captain of the team, and I loved playing...\"\n\"In our country there's not much potential for a [woman handball player],\" says fellow referee Dalal Al-Naseem. \"There are three women's domestic teams [it was two, became three a couple of years ago],\" she says. \"But there are 16 men's teams. The level [of the women's game] is not good, unlike the men.\"\nIt's not just about sporting quality, either. The disparity is a common one in sport.\n\"The men [players] get a good salary, but for the women... nothing,\" says Dalal, who started out as a football player before switching to handball for two years. \"They did nothing. And that's why I changed my position to referee.\"\nShe was 23 when she decided to stop playing, start refereeing. Maali was 25.\n\"They care now,\" says Maali, \"but [when she was playing] they didn't care about women's sport. At least, they have a league now of three, more games.\"\nMaali wanted to go to the big handball events, and that was another reason behind her switch. \"I want to go to the World Cup, to the big championships in Asia... and this won't happen in Kuwait [as a player], no way.\"\nThe two are now going to a World Cup - next month, they'll be refereeing in Croatia at the U-19 World Cup.\nThey'd gotten their Asian Handball Federation (AHF) badge in 2019, and the International (IHF) one in 2022. Apart from their domestic men's league, they'd refereed a men's competition In Bulgaria and are now at the debut season of the Premier Handball League in India.\nIt's an experience that hasn't overawed them. Refereeing in the senior men's league in Kuwait helped prepare them. \"The players in Kuwait were so friendly and they supported us when we started out,\" says Dalal.\nThere were exceptions, of course, she says but the general attitude was one of support. Maali believes that refereeing in the men's league during the COVID-19 lockdown helped them: without fans, it helped them focus merely on the game.\n\"When me and Maali refereed our first men's match, everyone in Kuwait was wondering 'why are they letting a women referee a men's match?',\" says Dalal. Maali laughs in agreement as they remember the negativity on social media.\n\"You need a strong personality,\" says Maali. \"Otherwise, you cannot whistle for the men's game.\"\nThe gig comes with constant pressure \"You know coaches and players won't accept your decision, even if they know they are wrong,\" says Dalal. For her, then, it's about conviction and faith in her understanding of the rules. Plus, as Maali adds with a laugh, \"we know all the tricks that players try. And we learned so much from the senior men's pros in Kuwait.\"\nThe two referees review all their matches immediately, and they always run their decisions past their mentors at the IHF. It's a mechanism of constant communication that they believe improves them day-after-day, a system that assures them that the career-call they made was the right one.\nMaali and Dalal are currently the only women handball referees from the Middle East, but they believe their careers can be an example -- even if all conventional routes are shut, you can follow your passion.",
  "word_count": 907,
  "scraped_at": "2026-02-14T12:45:31.700370"
}