{
  "article_id": "be45e495e459",
  "url": "https://banglamirrornews.com/2025/09/21/ex-liverpool-manager-beard-dies/",
  "title": "Ex - Liverpool manager Beard dies",
  "date": "20250921T220000Z",
  "domain": "banglamirrornews.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Former Liverpool manager Matt Beard has died at the age of 47, the Women’s Super League club has announced.\nBeard led Liverpool to back-to-back WSL titles in 2013 and 2014.\nHe returned for a second spell at the club in 2021 but was sacked in February this year.\nIn a statement, Liverpool paid tribute to “an extremely committed and successful manager”.\nThey added: “He was also a person of real integrity and warmth, who will always be remembered with genuine fondness by everyone he worked with at the club. Rest in peace, Matt.”\nAfter his reappointment in 2021, Beard led the Reds to promotion back to the WSL and helped them to a seventh-placed finish on their return to the top flight.\nBeard also managed Liverpool during their first ever Champions League campaign.\nHis brother Mark paid tribute to the “most amazing, caring man who was loved by anyone who had the pleasure to meet him”.\n“We will love you forever Matt Matt,” he said in a social media post.\nThe Football Association called Beard a “key figure” in women’s football, adding that its “thoughts go out to his family and friends during this difficult time”.\nThe WSL posted a tribute on X, saying: “Everyone at WSL Football extends its deepest sympathies to the family, friends and loved ones of Matt Beard following news of his passing.\n“Matt played an instrumental role in the growth of women’s football and will be missed by everyone associated with the game.”\nBeard was appointed Burnley manager in June but resigned after just two months in charge.\nHe had previous spells at Millwall Lionesses, Chelsea, West Ham and National Women’s Soccer League side Boston Breakers, as well as an interim period in charge of Bristol City.\nThe Clarets paid tribute, saying: “The thoughts and prayers of everyone at the club are with Matt’s family and friends.”\nMillwall Lionesses, where Beard started his managerial career, said in a statement: “Everybody at the club is deeply saddened by the passing of former Lionesses manager, Matt Beard.\n“We send all our love and support to his family, friends and colleagues across the many clubs he managed at this very difficult time.”\n‘A character who lit up a room’\n‘Beardy’, as he was known to those in the game, was an ever-present in the WSL and a character that lit up the room. He was funny, loud and straight to the point.\nHe was often likened to ‘a giant teddy bear’ – a loving man from London who gave out hugs to anyone and everyone in the stands – a contrast to the bellowing manager who shouted instructions to his players from the dugout.\nLiverpool fans were particularly fond of him as he led the club to back-to-back WSL trophies and returned for a second spell, guiding them back to the top-flight with a Women’s Championship title.\nIn the successes, he celebrated hard and happily, enjoying a pint (or two) with staff and supporters in the pub next to Prenton Park, where Liverpool Women used to play their home matches.\nHe invited those of us in the media to join him and discussed further his tactics or what luck was on his side, often teasing us on whether we had been too harsh in the match reports or in our questioning of him in the news conferences.\nAway from the pitch, he was a family man and always spoke about his children, sometimes joking about how he was struggling to help his son with his maths homework.\nHe told me he wanted to start a podcast where he could discuss “the real issues” in women’s football and what it was really like to be a football coach. He found a cheap deal on some recording equipment online and practised.\nThere were ups and downs in his football career but he always cared deeply for his players and the supporters. He will be remembered fondly in the game and the positive impact he had on the people he worked with will remain for a long time.\nA number of figures from the women’s game have taken to social media to pay their own tribute to Beard.\nEmma Hayes: “Can’t quite compute this. Absolutely one of the best humans. Always available for a chat, one of the good guys. A champion in the women’s game and a top bloke. So gutted for his family.”\nCarla Ward: “Heartbroken”\nGilly Flaherty: “Absolutely devastated and lost for words at the news of losing Beardy tonight. A man I thought so highly of, who in all honesty I would’ve followed around the world to play for. The best manager & friend I could’ve ever had asked to have in my life. Rest easy beardy & give my dad a big squeeze please love you gaffer xx”\nAlessia Russo: “Warmest guy with the biggest heart”\nToni Duggan: “So very, very sad. Rip Beardy. Sending all my love and a lot of strength to your friends and family. A great man gone far too soon.”\nOlivia Smith: “Wouldn’t be where I am without you”\nMissy Bo Kearns: “You believed in me from day one and we got on like a house on fire. All the memories we have I’ll never forget especially the one where I lost a bet and you made me train in your kit. I’ll be there for the family and the kids always because you made me part of the family. Lots of love Missy Bo ‘Headache’ xxx”\nRachel Daly: “Absolutely heartbreaking. A truly special man with a heart of gold. RIP Beardy.”",
  "word_count": 931,
  "scraped_at": "2026-02-14T12:58:25.234825"
}