{
  "article_id": "be8166cceb96",
  "url": "https://www.irishecho.com/2026/1/mayo-hopes-high-as-nfl-begins",
  "title": "Mayo hopes high as NFL begins",
  "date": "20260123T203000Z",
  "domain": "irishecho.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "After almost six months of inter-county GAA inactivity we will see a full resumption of inter-county games next weekend when both the hurling and football National Leagues get under way. In former years, the football competition always started a week earlier than the hurling, but the GAA is now in split-season mode and it’s going to be non-stop action from now until the end of July.\nIt’s 75 years since Mayo won the Sam Maguire Cup, but the county has always had a good record in the National League with 13 wins. And five of those wins have come since Mayo last won Sam in 1951. If soccer or rugby rules applied Mayo would have also won the League last year, as they finished top of the Division One table with 9 points, one ahead Kerry. But in the GAA the rule is that the top two counties in Division One meet in a final and back in March it was Kerry who won by six points to take the new Mícheál Ó Muircheartaigh Memorial Cup for the first time. Kerry went on to win the double, lifting the Sam Maguire Cup in July, while Mayo were beaten by Galway in the Connacht final and then they finished bottom of their group in the Round Robin qualifiers. But Mayo followers have a great spirit and on Sunday next they will travel in hope to Pearse Stadium in Salthill to face old rivals Galway in their opening league game.\nFormer Mayo player Andy Moran, who previously managed Leitrim, has replaced another former player Kevin McStay in the dug-out, but can he turn Mayo into a team that wins a national title? Let’s give him a chance anyway. Kerry, who play Roscommon in Killarney, have a few injuries and are expected to rest some of their regulars; captain Gavin White is injured and Dingle’s Paul Geaney says he is going to take a break. When it comes to the National Football League, Ulster counties always do well, but this year there are only three Ulster counties in division one. On Saturday, Donegal will be back in Croke Park for the first time since their 10-point defeat to Kerry in the All-Ireland final last July. Jim McGuinness is still in charge and they should be too strong for what is expected to be an inexperienced Dublin team, now managed by former Louth manager Ger Brennan. The Croke Park game is part of a double-header with the Dubs and Donegal in action at 3pm. With Pairc Tailteann in Navan undergoing a major upgrade Meath will play their home games in Croke Park this year and at 5pm the Royals will meet Derry. The other two Ulster counties in Division One this year, Monaghan and Armagh meet in Clones on Sunday.\nCORK TAP O’CONNOR\nThe Cork hurlers have changed managers since their last competitive game when they collapsed in the second half of the All-Ireland final against Tipperary on July 20. Former player Ben O’Connor has now replaced the unfortunate Pat Ryan and he has much the same squad to work with. The Rebels play Waterford in Pairc Ui Chaoimh on Sunday afternoon. Cork are the reigning League champions having beat Tipp in last year’s final. Elsewhere All-Ireland champions Tipperary get the division one action under way when they play Galway under the Semple Stadium lights on Saturday evening.\nKILBANE UNHAPPY\nWITH ‘SAIPAN’\nFormer Irish international Kevin Kilbane is not happy at the way the Irish players are portrayed as heavy drinkers in the new “Saipan” movie, recounting the row between Mick McCarthy and Roy Keane as the Irish squad prepared in the South Pacific island for the 2002 World Cup finals in Japan and South Korea. Kilbane said: ‘‘The record needs to be set straight on a few falsehoods, so that people learning about Saipan via the film do not think we were a pub team on tour. We reached the last 16 at the tournament without the best midfielder in the world. There was an ill-judged barbecue on the island that the traveling media attended. The film has Roy fuming from his balcony as we did the conga night after night. Rubbish. We had the one session and Roy was there; I remember him being annoyed that the journalists were invited, but he moved on with us to play darts in a local pub. He was in grand form.’’\nCOBDEN IS NEW\nMCMANUS NO. 1\nEnglish-born jockey Harry Cobden will become the number one rider for leading owner J.P. McManus in Ireland and Britain later this year. Champion jockey in Britain in the 2023/2024 season and currently stable jockey to Paul Nicholls. Cobden, who is 27, is expected to start his new role in May when he will replace Mark Walsh. Walsh has been McManus’s chief rider in Ireland since Barry Geraghty retired five years ago. Cobden said last week: ‘‘It’s a massive opportunity for next season and obviously I’m very much looking forward to it It’s privilege to be asked as it’s a huge position, Mr McManus has a lot of very good horses and I’m looking forward to it.’’\nMcManus has his horses with various trainers and is the owner of some top chasers like Cheltenham Gold cup winner Inothewayurthinkin and Ryanair Chase winner Fact to File.\nKING CONFIRMED\nErin King has been confirmed as the new captain of the Ireland women's rugby team ahead of the 2026 Six Nations campaign. King, who recently made a comeback after a serious knee injury, takes on the role from Sam Monaghan and Edel McMahon, who shared the captaincy last year. The 22 year-old Australia-born, Wicklow-raised back-row is still inexperienced at international level, having won just seven caps in her Test career. King said: ‘‘I have worked really hard this past year, but I would have never imagined this would have come of it. It’s a role that I think I am fully capable of and I can’t wait to get going.’’",
  "word_count": 998,
  "scraped_at": "2026-02-14T12:51:26.397234"
}