{
  "article_id": "be983c293ace",
  "url": "https://www.90min.com/arsenal-5-0-brighton-player-ratings-8-11-24",
  "title": "Arsenal 5 - 0 Brighton : Player ratings as Gunners return to winning ways in WSL",
  "date": "20241109T011500Z",
  "domain": "90min.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Arsenal 5-0 Brighton: Player ratings as Gunners return to winning ways in WSL\n- Goals galore at Emirates Stadium as Arsenal beat Brighton 5-0\n- Five individual goalscorers see Gunners sail past Seagulls\n- Disorganised Brighton left asking many questions\nFROM EMIRATES STADIUM - Arsenal returned to winning ways under the lights of Emirates Stadium, thrashing a lacklustre Brighton & Hove Albion side 5-0 in the Women's Super League on Friday night.\nFirst-half goals from Beth Mead, Caitlin Foord and Frida Maanum were enough to put the game to bed before the interval, before Lina Hurtig and Alessia Russo scored late on to secure a statement victory for the Gunners.\nBrighton's stubbornness saw them refuse to let up their preferred style of football, resulting in being punished by Arsenal. The victory sees the Gunners jump up to fourth in the WSL, leapfrogging Manchester United who are set to play Aston Villa on Sunday.\nHow the game unfolded\nArsenal created the better chances of the two sides in the opening stages. The most convincing perhaps came from a clever short pass from Lia Walti to Katie McCabe inside of the 18-yard-box, which was intercepted by a brilliant sliding challenge from Madison Haley.\nThe Gunners were able to break the deadlock in the 13th minute, as Maanum opened the pitch with a visionary ball through to Mead in the right channel. Mead did what she knows best, cutting onto her left foot before burying her shot into the far corner for the opener.\nRusso was too strong for the Seagulls defence, as she muscled around her markers before sending a pass through to Mead in the channel. Before Mead had the chance to shoot, the offside flag was raised.\nThough it would not take long for Arsenal to strike again, as Emily Fox picked-out Kim Little in the area before the Arsenal skipper located Foord with her cross. Foord made no mistake with her goal-line tap-in, doubling Arsenal's lead in the 21st minute.\nMatters were made worse for Brighton only moments later, as Maanum looped Sophie Baggaley in the Brighton goal with an absolute wonder-strike from the corner of the 18-yard-box. Gunners fans were in rapture as Arsenal took a 3-0 lead in the 25th minute.\nFoord looked to deliver another nightmarish blow for the Seagulls, as Arsenal instigated a counterattack to catch Brighton wide open at the back. The Australian beat Baggaley with her shot from range, only to be denied by the post.\nBrighton finally showed signs of revival in the final half hour, as Kiko Seike sent Leah Williamson the wrong way before her shot was narrowly denied by the crossbar. The small glimpses weren't enough for the Seagulls, as their disorganised display went punished.\nIf the game wasn't already put to bed, the Gunners closed proceedings in the 75th minute. A pinpoint corner delivery from McCabe was met by Hurtig, whose header flicked the ball into the back of the net to make it 4-0.\nAs if Brighton hadn't already suffered enough, a clever turn from Stina Blackstenius saw her brought down by Jorelyn Carabali and awarded a penalty. Russo was calm and collected from the spot, slotting home her strike for a well-deserved goal after a strong individual showing.\nArsenal player ratings (4-3-3)\nGK: Manuela Zinsberger - 8/10 - Hardly anything to do for the Arsenal number one on the night. Was only called into action once in the second half and managed to preserve her clean sheet well.\nRB: Emily Fox - 8/10 - The USWNT defender continues to prove why she is one of Arsenal's most important assets. Instrumental for Arsenal's attacking endeavours and made no mistakes defensively.\nCB: Leah Williamson - 6/10 - The centre-back was not at her best distribution wise, making some uncharacteristic turnovers. However, had no qualms defensively.\nCB: Steph Catley - 7/10 - Strong performance from the Arsenal centre-back. Deserved her spot in the starting XI and did well when moved back to left-back upon Fox's withdrawal.\nLB: Katie McCabe - 8/10 - A very solid showing from the Irish defender. Combined well with Foord to threaten Brighton's right side and catalyse some good attacking motions.\nCM: Lia Walti - 7/10 - Composed showing from the defensive midfielder. Didn't have too much to do against a very lost Brighton midfield.\nCM: Kim Little - 7/10 - Certainly one of the captain's more improved showings over recent times. Did excellently to set up Foord for the second goal and made no real mistakes before her substitution in the 55th minute.\nCM: Frida Maanum - 9/10 - A near-perfect performance from the Gunners midfielder as she tormented the Brighton defence. Instrumental in the first goal to set Mead up in the channel before scoring a banger for Arsenal's third.\nRW: Beth Mead - 8/10 - The Mead of old was on show here. Really strong display and good to see her find herself back on the scoresheet. Used the space well, but was perhaps too easily caught out by the offside flag.\nST: Alessia Russo - 8/10 - Russo got her well-deserved goal in the 95th minute, slotting home a penatly after an impressive performance in N5. The number 23 was strong and composed up front, causing real issues for the centre-backs marking her. A confident display from the striker.\nLW: Caitlin Foord - 8/10 - A really bright performance yet again from the in-form forward. Foord terrorised the Seagulls' right side and put herself in the right position to score Arsenal's second of the evening. Combined really well with McCabe.\nSubstitutes\nSUB: Laia Codina (55' for Fox) - 7/10 - Strong defensively but not much was asked of her as Brighton struggled to threaten. A really impressive challenge to preserve Arsenal's clean sheet in the final moments.\nSUB: Stina Blackstenius (55' for Maanum) - 6/10 - Didn't impact the game as much as she would have hoped. Many questions still to be asked of the Russo and Blackstenius partnership, however her clever turn in the dying moments won Arsenal a penalty.\nSUB: Kyra Cooney-Cross (55' for Little) - 6/10 - Did what was asked of her on the occasion and set up well defensively.\nSUB: Lina Hurtig (71' for Foord) - 8/10 - Made an immediate impact to score Arsenal's fourth goal of the evening and put the game to bed.\nSUB: Rosa Kafaji (79' for Mead) - N/A\nUnused subs: Lotte Wubben-Moy, Kathrine Kuhl, Katie Reid, Daphne van Domselaar.\nManager\nRenee Slegers - 8/10 - A strong performance from the Arsenal interim head coach who recently confirmed she would lead out the Gunners for the remaining three games ahead of the next international break. Set up well to nullify Dario Vidosic's possession-based identity and managed to use her bench and give her side some rotation ahead of a busy week. Questions still to be asked in regards to whether Arsenal should have tried new things when leading the game by so much.",
  "word_count": 1162,
  "scraped_at": "2026-02-14T12:42:46.274296"
}