{
  "article_id": "be99bae0bece",
  "url": "https://www.nbcchicago.com/news/business/money-report/super-bowl-59-live-updates-chiefs-eagles-kendrick-and-star-studded-commercials/3669644/",
  "title": "Super Bowl 59 live updates : Chiefs , Eagles , Kendrick and star - studded commercials",
  "date": "20250209T213000Z",
  "domain": "nbcchicago.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "This was CNBC's live blog covering all the commercials and biggest news from Super Bowl 59 in New Orleans.\nSuper Bowl 59 is in the books. Reigning champion Kansas City Chiefs took on the Philadelphia Eagles in New Orleans, but fell short of the three-peat. The Eagles claimed the Lombardi Trophy for the second time in franchise history, with a final score of 40-22.\nStream NBC 5 for free, 24/7, wherever you are.\nThis year's game was broadcast by Fox and streamed on its free, ad-supported streaming service, Tubi. Fox sold out of ad spots for the broadcast back in the fall, and more than 10 spots went for $8 million apiece, CNBC previously reported. A handful of brands like Nike, Dunkin' and water company Cirkul made a splash during the big game.\nThe Super Bowl — and live sports in general — still generates massive audiences for media companies. Last year's matchup, aired on Paramount's CBS and Paramount+, garnered a record audience of more than 123 million viewers, according to ratings firm Nielsen.\nHere's a look back at some of the notable spots:\n- Ben Affleck's DunKings return in Dunkin's Super Bowl ad (with a cameo from Bill Belichick)\n- Barry Keoghan hawks Squarespace while riding a donkey\n- Water brand Cirkul debuts ad at the Super Bowl\n- Coors wants to solve 'case of the Mondays' after Super Bowl\n- Ram Trucks airs 'truck-twisted' fairy tale starring actor Glen Powell\n- Hellmann's mayonnaise reunites Meg Ryan and Billy Crystal\n- Nike returns to the Super Bowl with a message\n- Kieran Culkin voices a CGI beluga whale in NerdWallet's first Super Bowl ad\n- Mountain Dew's nightmarish, yet catchy commercial with singer Seal\nYahoo gets Bill Murray some help\nIn case you missed it (we did), Yahoo snagged a 15-second spot during the Super Bowl broadcast in which it set actor Bill Murray up with an email address to get some help. According to Yahoo, the email address got nearly 150,000 messages in the first two hours after the ad aired.\n— Sara Salinas\nPhiladelphia Eagles win Super Bowl 59\nThe Philadelphia Eagles are Super Bowl Champions.\nThe Eagles dominated the Kansas City Chiefs on Sunday, winning 40-22. This is the second win for the franchise, which took home the Vince Lombardi trophy for the first time in 2018.\n— Sarah Whitten\nKansas City Chiefs add 8 with less than two minutes to go\nPatrick Mahomes connected with Xavier Worthy for a touchdown with less than two minutes left in the Super Bowl. A two-point conversion has slimmed the Eagles' lead to 40-22.\n— Sarah Whitten\nFetch to give away $1.2 million during the final two minutes of the game\nRewards app Fetch is giving away $1.2 million via livestream during the final two minutes of the Super Bowl.\nThe company said it will dole out $10,000 to 120 winners — one for every second of the remaining two minutes of regulation game time — within the Fetch app.\nThe sweepstakes, dubbed \"The Big Reward,\" is the brand's first Super Bowl advertisement.\n— Sarah Whitten\nGoDaddy taps Walton Goggins to highlight AI program\nGoDaddy's Super Bowl spot features Walton Goggins explaining how, as an actor, he is able to convince audiences he knows what he is doing. He equates this work to what GoDaddy Airo does for small business owners.\nThe program uses artificial intelligence to help entrepreneurs create domain names, logos, fully built websites and marketing, social media content and commerce capabilities.\n— Sarah Whitten\nPizza Roll-loving alien Chazmo meets his end in Totino's spot\nTotino's Pizza Rolls ends the saga of two suburban dads, played by actors Tim Robinson and Sam Richardson, and the alien Chazmo in a spoof of \"E.T.\"\nChazmo thanks Robinson and Richardson for sharing their pizza rolls before he heads back to his home planet — but his spaceship malfunctions, crushing and killing him before he can even depart Earth.\nThe ad marks the first Super Bowl appearance from General Mills in more than a decade.\n— Amelia Lucas\nAntonio Banderas and 'Macho Man' Randy Savage in Bosch ad\nAntonio Banderas and late WWE super star \"Macho Man\" Randy Savage star in Bosch's Super Bowl game spot.\nIn the ad, Banderas helps Macho Man open a jar of pickles.\n— Sarah Whitten\nCorrection: This post has been updated to correct Antonio Banderas' role in the Bosch Super Bowl ad.\nKansas City Chiefs score late fourth-quarter touchdown\nThe Kansas City Chiefs scored a touchdown with less than three minutes left in the fourth quarter. With the two-point conversion, the team narrowed the Eagles lead to 40-14.\n— Sarah Whitten\nPhilly's Jake Elliott drills 50-yard field goal, Eagles up 40-6\nPhilly's Jake Elliott added another 3 points to the Eagle's lead with a 50-yard field goal. Philadelphia now leads 40-6.\n— Sarah Whitten\nMuppets travel using Booking.com\nThe Muppets take center stage in Booking.com's fourth-consecutive Super Bowl ad.\nThe spot focuses on the company's app, which features smart filters, verified reviews and an AI trip planner.\nKermit, Miss Piggy, Animal, Gonzo and the grumpy duo of Statler and Waldorf all make appearances to showcase different elements of Booking.com's \"something for everyone\" campaign.\n— Sarah Whitten\nDove wants to change how we talk to girls\nDove's 30-second Super Bowl spot features an excited 3-year-old girl running along a sidewalk.\nText appears on the screen: \"At 3, these legs are unstoppable... at 14, she'll think they're unbearable.\"\nThe commercial then notes that 1 out of every 2 girls who quit sports do so because they were criticized for their body type. Dove urges viewers to \"change the way we talk to our girls.\"\n— Sarah Whitten\nStella Artois reunites David Beckham with his long-lost twin\nA shared love for Stella Artois helps David Beckham, playing himself, bond with his long-lost twin, named \"Other David\" and played by Matt Damon.\nThe ad is the first Super Bowl appearance for the Anheuser-Busch InBev brand since 2019.\n— Amelia Lucas\nEagles kick another field goal, lead 37-6\nThe Philadelphia Eagles continued to add to their lead during the fourth quarter. Jake Elliot tapped in a 48-yard field goal to bring the score to 37-6.\n— Sarah Whitten\nHarrison Ford stars in Jeep ad, trolls Ford\nActor Harrison Ford touts Jeep and Americana while taking a dig at another Detroit automaker during Stellantis' second Super Bowl ad.\nIn the two-minute spot, the iconic \"Star Wars\" actor discusses freedom, heroes and people writing their own stories in life because there is no \"Owner's Manual,\" which is the title of the ad.\nAs Ford discusses the philosophical life topics, several Jeep models can be seen driving and off-roading, including one that passes a Ford Bronco SUV — a newer competitor to the Jeep Wrangler SUV — while the actor talks about inspiring others.\nThe Wrangler passing the Bronco is one of two references to the Jeep rival. The other comes from the actor at the end of the ad: \"Choose what makes you happy. My friends, my family, my work make me happy. This Jeep makes me happy — even though my name is Ford. That's my owner's manual. Get out there, write your own.\"\nStellantis said the ad was created in-house with Ford and Oscar-nominated director James Mangold. It was produced by Santa Monica, California-based Minted Content.\n— Michael Wayland\nSomeone onstage with Lamar reveals Palestinian flag during halftime show\nA person onstage with Kendrick Lamar appeared to unfold a Palestinian flag with the words \"Sudan\" and \"Gaza\" written on it during the halftime performance.\nThe person was onstage, though it was unclear whether they were an official dancer who went rogue or someone who sneaked on.\nIt appeared to happen during the last song, \"tv off.\" The person was then tackled and was walked offstage once the lights went back on.\nApple Music and New Orleans police did not immediately respond to requests for comment.\nThe NFL issued a statement, saying, \"We commend security for quickly detaining the individual who displayed the flag. He was a part of the 400-member field cast. The individual hid the item on his possession and unveiled it late in the show. No one involved with the production was aware the individual's intent.\"\n— Sara Salinas; Rebecca Cohen, NBC News and Jesse Kirsch, NBC News\nKansas City score touchdown to close third quarter\nThe Kansas City Chiefs finally made it into the end zone at the end of the third quarter. However, the team failed to complete its attempted two-point conversion. As the game enters the fourth quarter, the Eagles are up 34-6.\n— Sarah Whitten\nEagles touchdown brings Super Bowl score to 34-0\nJalen Hurts tossed to DeVonta Smith for a touchdown near the end of the third quarter to bring the Philly lead to 34-0.\n— Sarah Whitten\nPoppi promises a 'better soda'\nPrebiotic soda brand Poppi brought social media stars into its Super Bowl commercial to pump what it says is a \"better soda.\"\n— Sara Salinas\nHims & Hers tackles obesity and weight loss drug shortage\nHims & Hers takes aim at the obesity epidemic with its 60-second spot during the Super Bowl, which drew criticism from lawmakers even before the big game.\nThe telehealth company shows the negative impact of obesity on individuals and society, while criticizing the U.S. healthcare system for lack of access to weight loss drugs.\nHims & Hers closes its ad by telling viewers that it is committed to being part of the solution to the weight loss drug shortage and noting that its products are less expensive than other name brands.\nOn Friday, Sens. Dick Durbin,D-Ill., and Roger Marshall,R-Kan., wrote a letter to the U.S. Food and Drug Administration expressing concern over the ad, saying it \"risks misleading patients by omitting any safety or side effect information when promoting a specific type of weight loss medication.\"\n— Sarah Whitten, Ashley Capoot\nLay's little farmer\nLay's Super Bowl ad celebrates the American farmers that grow the potatoes that become its potato chips. The spot focuses on a fictitious farming family and the young daughter who tends her own little potato patch to contribute to the harvest.\n— Sarah Whitten\nEagles touchdown extends lead 27-0\nThe Philadelphia Eagles extended their lead with a field goal midway through the third quarter. With the additional three points, Philly now leads 27-0.\n— Sarah Whitten\nPost Malone stars in Bud Light ad\nPost Malone builds a Bud Light tailgate party in the beer brand's Super Bowl commercial.\n— Sara Salinas\n'Fast and Furious' actors slow down in Häagen-Dazs commercial\nIt's not another \"Fast and Furious\" sequel. It's a Häagen-Dazs commercial.\nActors Vin Diesel and Michelle Rodriguez reprise their characters from the film franchise as they cruise down the highway and enjoy an ice cream bar. Hip hop artist and actor Ludacris, another \"Fast and Furious\" cast member, rolls up alongside them in an effort to get them to speed up.\n— Lillian Rizzo\nDisclosure: Comcast is the parent company of NBCUniversal and CNBC. NBCUniversal is the distributor of the \"Fast and Furious\" film franchise.\nKieran Culkin voices a CGI beluga whale in NerdWallet's first Super Bowl ad\nFor NerdWallet's first ever Super Bowl ad, it's turned to \"Succession\" star Kieran Culkin to voice its first \"spokesanimal,\" a CGI beluga whale.\nCulkin's whale informs a man on a whale-watching tour about how the personal finance website can help him research the best credit cards, insurance providers and personal loans.\n— Sarah Whitten\nTaco Bell puts the spotlight on its customers\nDespite efforts from NBA star Lebron James and rapper Doja Cat, Taco Bell's ad puts the focus on its real customers, not celebrities.\nThe cheeky spot takes aim at the wave of celebrity-centric Super Bowl ads over the last few years — including Taco Bell's own campaigns. Back in 2022, the Yum Brands chain first teamed up with Doja Cat for a Super Bowl ad.\nThis year's spot features nearly 400 Taco Bell fans who stopped by one of the five restaurants used for casting the commercial.\n— Amelia Lucas\nMcConaughey races for a flight\nMatthew McConaughey makes another appearance during a big game, this time for Salesforce.\n— Sara Salinas\nNerds Gummy Clusters take over New Orleans\nNerds Gummy Clusters take over New Orleans, the site of this year's Super Bowl game, in the candy's ad.\nFresh off last Sunday's Grammy performance, country singer Shaboozey performs a cover of \"What a Wonderful World,\" originally performed by New Orleans native Louis Armstrong, with a marching band and a dancing Gummy alongside him.\nThe spot marks the second straight Super Bowl appearance from Nerds. Last year's ad also focused on its gummy clusters.\n— Amelia Lucas\nTwo Chrises and a Kris showcase Meta's smart glasses\nChris Hemsworth and Chris Pratt are joined by Kris Jenner in a second spot for Meta's Ray-Ban smart glasses.\nThe spot features Hemsworth and Pratt using Meta AI to identify pieces from Jenner's private art collection. Hemsworth accidently eats a $6.2 million banana from Maurizio Cattelan's conceptional artwork, \"Comedian.\"\n— Sarah Whitten\nDoorDash enlists comedian Nate Bargatze to push DashPass\nDoorDash is pushing its membership program DashPass in its Super Bowl ad this year.\nThe food delivery company's 30-second commercial features comedian Nate Bargatze living large on all of his savings from being a DashPass member.\n— Lillian Rizzo\nTom Brady runs on Duracell\nDuracell pranked Super Bowl viewers with a commercial starring Fox NFL analysts Tom Brady and Kevin Burkhardt.\nThe ad starts with Brady and Burkhardt in the booth offering their thoughts about the game before Brady appears to malfunction and power-down.\nA brawny scientist appears, revealing that someone put generic batteries into Brady. He replaces them with Duracell branded ones and Brady instantly reboots.\n— Sarah Whitten\nTubi raises eyebrows\nTubi, the free, ad-supported streamer owned by Fox, raised eyebrows with a Super Bowl commercial featuring film fans revealing their tastes in a unique way.\nTubi promises, \"If it's in you, it's in here.\"\n— Sara Salinas\nRoger Federer and Elmo tag team in sportswear brand On's commercial\nSportswear brand On is hosting an alphabet lesson during its Super Bowl commercial this year.\nThe running brand is calling out its logo in the spot, which features tennis champion Roger Federer and Sesame Street's Elmo. The infamous furry red monster tries to school Federer on his letters during the ad.\n— Lillian Rizzo\nKendrick takes the stage\nKendrick Lamar has taken the stage for the Apple Music halftime show, introduced by Samuel L. Jackson dressed as \"Uncle Sam.\"\nSurrounded by American imagery, Lamar performed hits including \"HUMBLE.\" and \"Squabble Up\" and was joined by R&B singer SZA.\nLamar played his Grammy-winning song \"Not Like Us,\" which cleaned up at the music awards last weekend. Drake recently sued over the song, which was one in a series of diss tracks traded between the two rappers.\n— Sara Salinas\nReese's spot urges customers to eat its chocolate lava, not volcanic lava\nReese's spot is a public service announcement: eat its Chocolate Lava Big Cup, not volcanic lava.\nThe ad marks the third Super Bowl appearance for the Hershey candy. In all three ads, Reese's has chosen to lean into absurdist humor to spotlight a new product, like its Take 5 bar or Caramel Big Cup.\n— Amelia Lucas\nNike returns to Super Bowl with a message\nFor the first time in nearly three decades, Nike has a Super Bowl ad.\nThe spot, narrated by Grammy-winning rapper Doechii, features top female athletes like Caitlin Clark, JuJu Watkins and Sha'Carri Richardson. The black-and-white commercial is all about these stars proving critics wrong.\n— Sarah Whitten\nIt's 24-0 at the end of the half\nThe Philadelphia Eagles lead the Kansas City Chiefs 24-0 after two quarters.\nPhilly put up a rushing touchdown early in the first quarter and systematically added to that lead with a field goal and an interception that turned into another score. Philly closed out the half with a second interception and throwing touchdown to A.J. Brown.\n— Sarah Whitten\nEagles capitalize on second interception\nPhilly capitalized on a second defensive interception with a throwing touchdown from Jalen Hurts to A.J. Brown.\nThe Eagles extended their lead to 24-0 over the Kansas City Chiefs with less than 2 minutes left in the half.\n— Sarah Whitten\nWanda Sykes, Hailee Steinfeld advocate for breast cancer screenings\nPharmaceutical brand Novartis made its Super Bowl ad debut with a spot about breast cancer.\nFeaturing breast cancer survivor Wanda Sykes and breast cancer advocate Hailee Steinfeld, the advertisement calls attention to how pervasive breasts are in American culture while also promoting early detection through breast cancer screenings.\n— Sarah Whitten\nBudweiser celebrates 50 years as a Super Bowl advertiser with its Clydesdales\nA Budweiser Clydesdale foal makes its first delivery in the Anheuser-Busch InBev brand's spot.\nThe ad marks the 50th anniversary of Budweiser advertising in the Super Bowl. Its iconic Clydesdale horses became a signature of its advertising 11 years later, making their debut during Super Bowl 20 in 1986.\n— Amelia Lucas\nMustaches take center stage in Pringles' spot\nWhile Pringles' spot includes a number of celebrities, the mustache is really the star.\nIn the ad, actor Adam Brody blows into an empty Pringles can, on the urging of mustachioed mascot Mr. P. That call summons mustaches from actor Nick Offerman, NBA star James Harden, Kansas City Chiefs coach Andy Reid and Mr. Potatohead — along with new cans of Pringles.\n— Amelia Lucas\nRam Trucks airs 'truck-twisted' fairy tale starring actor Glen Powell\nAutomaker Stellantis created a unique take on the classic children's fairy tale \"Goldilocks and the Three Bears\" to promote its Ram Trucks brand.\nThe spot stars \"Twisters\" and \"Top Gun: Maverick\" actor Glen Powell with long blonde hair. Powell plays a \"rugged-woodsy dude\" who fights a dragon, uses chainsaws for wood-carving and then jumps one of the three pickup trucks featured in the ad over an active volcano.\nJust as the truck lands, the 60-second ad, called \"Drive Your Own Story,\" shows Powell reading a story to two children before returning back to the \"truck-twisted\" tale.\nThe spot features Van Halen's \"Panama.\" It was created in partnership with Austin, Texas-based GSD&M and produced by Santa Monica, California-based Minted Content.\n— Michael Wayland\nHellmann's mayonnaise reunites Meg Ryan and Billy Crystal\nMeg Ryan and Billy Crystal return to Katz's Deli in New York City, where they filmed one of the most famous scenes of \"When Harry Met Sally\" 36 years ago.\nThis time, though, it's Hellmann's mayonnaise that causes Ryan's reaction.\nActress Sydney Sweeney, who starred in her own romantic comedy in 2023, gets to deliver the famous punch line, \"I'll have what she's having.\"\n— Amelia Lucas\nBig Brothers Big Sisters leverages NFL talent\nBig Brothers Big Sisters of America is leaning on NFL talent for its Super Bowl campaign, saying, \"Every child deserves a champion.\"\n— Sara Salinas\nOpenAI debuts at the Super Bowl with an ad for ChatGPT\nChatGPT-maker OpenAI made its Super Bowl debut with a black-and-white, 60-second spot that reminds us, \"All progress has a starting point.\"\n— Sara Salinas\nLiquid Death is 'safe for work'\nIn a tongue-and-cheek Super Bowl ad, Liquid Death showcases a surgeon, a cop, an airline pilot and a school bus drive drinking on the job.\nIt's just water, of course.\n— Sarah Whitten\nCoffee-Mate targets taste buds with its cold foam creamer ad\nNestle's Coffee-Mate is using its cold foam creamer to make mouths water.\nIn the 30-second spot, a sip of a beverage with cold foam creamer sends the drinker's tongue dancing. Shania Twain's voice croons through the commercial, which makes sense based on the tagline — \"Let's go, tongues,\" a callback to the opening line of her popular song \"Man! I Feel Like a Woman!\"\n— Lillian Rizzo\nGordon Ramsay, Pete Davidson whip up laughs in HexClad's first Super Bowl commercial\nCookware maker HexClad is following the tried and true recipe for Super Bowl commercials —celebrities and humor.\nCelebrity chef Gordon Ramsay stars in the ad that's supposed to take place in Area 51, where a new alien species of foodies is discovered. The quintessentially spicy Ramsay quips, \"Ugh. Foodies. The worst.\"\nThe commercial includes HexClad's frying pans, aliens and comedian Pete Davidson serving a diss to Ramsay.\n— Lillian Rizzo\nPhilly's pick-six extends lead to 17-0\nPhiladelphia's Cooper DeJean intercepted Kansas City's Patrick Mahomes and ran for a touchdown. A successful point-after kick puts Philly up 17-0 in the second quarter.\n— Sarah Whitten\nGoogle Pixel with AI\nGoogle touts its new Pixel phone with Gemini AI in its Super Bowl Sunday ad.\n— Sarah Whitten\nRocket wants you to 'own the dream'\nRocket is out with a commercial encouraging you to \"own the dream,\" montaging major life milestones set to John Denver's \"Take Me Home, Country Roads.\"\n— Sara Salinas\nEagles add 3 points with 48-yard field goal\nPhiladelphia kicker Jake Elliott nails a 48-yard field goal to put the Eagles up 10-0.\n— Sarah Whitten\nWeather Tech is ready for whatever comes your way\nA group of grannies live it up to the musical styles of Steppenwolf's \"Born to Be Wild\" in Weather Tech's Super Bowl commercial.\n— Sarah Whitten\n'This is taxes?' Issa Rae asks in TurboTax ad\n\"It's 2025. This is taxes?\" Issa Rae asks in TurboTax's Super Bowl commercial.\nThe ad features Rae carrying a cardboard box of receipts in the middle of a wind storm. The spot highlights TurboTax's tax prep solutions for making filing taxes easier.\n— Sarah Whitten\nUber Eats commercial delivers Matthew McConaughey and food puns\nMatthew McConaughey is driving this year's Super Bowl commercial for Uber Eats.\nThe lengthy commercial features the actor's vision for a movie about football and food conspiracies, chock full of food puns at every turn.\nMartha Stewart and director Greta Gerwig also make appearances in what appears to be a McConaughey fever dream.\n— Lillian Rizzo\nWho's the saltiest?\nAubrey Plaza, Michael Shannon and Bad Bunny star in Ritz's Super Bowl ad.\nWhile Plaza and Shannon debate who is saltier, Bad Bunny playfully professes his love for the cracker.\n— Sarah Whitten\nTom Brady, Snoop Dog star in Kraft's Foundation to Combat Antisemitism ad\nNew England Patriots owner Robert Kraft's Foundation to Combat Antisemitism partnered with Tom Brady and Snoop Dogg to create its second-ever Super Bowl ad titled \"No Reason to Hate.\"\nThe Foundation to Combat Antisemitism was started in 2019. In October, Kraft spearheaded professional sports commissioners with a similar campaign against antisemitism.\n— Sarah Whitten\nCoors wants to solve 'case of the Mondays' after Super Bowl\nGoing back to work on Monday after the Super Bowl isn't fun. An estimated 22.6 million Americans will skip work. For years, NFL fans have called for it to be a national holiday.\nCoors thinks it has the solution. Its spot shows sloths toiling away on the Monday after the big game. The Molson Coors Beverage brand's solution to a \"case of the Mondays\" is a pack of its beer, branded as \"Mondays Light.\"\n— Amelia Lucas\nInstacart debuts first ever Super Bowl commercial\nInstacart's first ever game day spot leaned on familiar, brand favorites like Chester Cheetah and the Kool-Aid Man to make a splash.\nThe commercial, set to the tune of Trick Daddy's \"Take it to da house,\" is entitled \"We're here\" and is meant to highlight Instacart's retailer and brand partnerships, its loyal shoppers and its on-demand grocery delivery service.\nPast Super Bowl icons – like Mountain Dew's Puppy Monkey Baby and Heinz's Wiener Dogs – are featured in the spot alongside mascots like the Green Giant, Mr. Clean and The Pillsbury Doughboy, who are shown running through the streets to make it to a customer's home.\n— Gabrielle Fonrouge\nMountain Dew's nightmarish, yet catchy commercial\nMountain Dew has a history of horror-inducing Super Bowl commercials. (Looking at you, Puppy Monkey Baby.)\nSunday's iteration features pop star Becky G taking a sip from a bottle of Mountain Dew Baja Blast only to be transported to a tropical landscape where singer Seal, morphed into a CGI seal, sings a revamped version of his hit song \"Kiss from a Rose.\"\n— Sarah Whitten\nEagles lead Chiefs 7-0 at the end of the first quarter\nAt the end of the first quarter, Eagles are leading the Chiefs 7-0.\n— Sarah Whitten\nBarry Keoghan hawks Squarespace while riding a donkey\nSquarespace tapped Academy Award nominee Barry Keoghan to literally hawk its product in its 11th Super Bowl advertisement.\nTitled \"A Tale as Old as Websites,\" the spot feature Keoghan atop a donkey tossing laptops like newspapers door-to-door to local businesses to promote the website design company.\n— Sarah Whitten\nWater brand Cirkul debuts ad at the Super Bowl\nAdam Devine and real-life wife Chloe Bridges play themselves in water brand Cirkul's Super Bowl commercial.\nIn the ad, Devine goes shopping and gets a reminder from Bridges to pick up Cirkul. When he can't find it in the store, he accidentally orders 100,000 online.\n— Sarah Whitten\n2024 standout Homes.com is back with Dan Levy and Heidi Gardner\nHomes.com, a standout from last year's ad slate, is back this year with its spokesperson duo: actor Dan Levy and Saturday Night Live actress Heidi Gardner.\n— Sara Salinas\nT-Mobile touts its partnership with Starlink\nT-Mobile got in the mix with an ad highlighting its partnership with SpaceX's satellite internet service Starlink.\n— Sara Salinas\nMichelob recruits star power for its ad on the pickleball court\nMichelob Ultra recruited a team of stars to take over the pickleball court, with the beer being served as the prize.\nCatherine O'Hara and Willem Dafoe lead the Anheuser-Busch InBev brand's \"The Ultra Hustle\" 60-second spot. The two actors compete with the likes of WNBA champion and Olympic gold medalist Sabrina Ionescu, NFL star Randy Moss and Olympic track and field gold medalist Ryan Crouser.\n— Lillian Rizzo\nEven aliens love Doritos\nDoritos called upon fans to create 30-second spots for this year's Super Bowl. The winner would see their commercial featured at the big game and take home $1 million in prize money.\nDylan Bradshaw and Nate Norell's ad, titled \"Abduction,\" won the contest and debuted Sunday.\nThe ad features a man who has fallen asleep at his computer with a bag of Doritos on his lap. The computer screen beeps that a UFO has been detected. A burst of light appears trying to tractor beam the bag of Doritos away.\nThe man resists, pulling the bag away only for the alien ship to use the beam to comically bounce him around the room. The ad finishes with the bag hurtling toward the alien craft, destroying it, and an alien and the man sharing the snack back on Earth.\n— Sarah Whitten\nA look at Meta's smart glasses\nChris Hemsworth and Chris Pratt join together in Meta's Super Bowl campaign to showcase the brand's Ray-Ban smart glasses.\nHemsworth uses his smart glasses to shoot a video of Pratt playing around with a statue in an art gallery. Pratt accidentally snaps the head off the statue and Hemsworth asks Meta to delete the video.\n— Sarah Whitten\nPhilly scores first\nThe Philadelphia Eagles drew first blood on Sunday, scoring a touchdown from the one-yard line.\n— Sarah Whitten\nMarvel's 'Thunderbolts*' hits theaters May 2\nDisney and Marvel Studios dropped a new trailer for the upcoming \"Thunderbolts*\" coming to theaters May 2.\n— Sarah Whitten\nLittle Caesars returns to Super Bowl to introduce new Crazy Puffs flavor\nLittle Caesars returns to the Super Bowl for the first time since 2020, when it made its official debut during the game.\nThe ad spotlights a new bacon and cheese flavor of its bite-sized Crazy Puffs. In the spot, actor Eugene Levy's prominent eyebrows fly off his face as he eats his Crazy Puffs and encounter everyone from caterpillars to runners to his daughter — and Schitt's Creek co-star — Sarah Levy.\nThe privately owned pizza chain introduced Crazy Puffs nearly a year ago, following the snacking trend that has taken over fast-food restaurants and pizzerias. Papa John's and Yum Brands' Pizza Hut are among the pizza chains that have introduced their own takes on the pizza snacking trend.\nLittle Caesars is the third-largest pizza chain in the U.S. by sales, trailing only Domino's Pizza and Pizza Hut.\n— Amelia Lucas\nUniversal's live-action 'How to Train Your Dragon'\nUniversal dropped a 30-second spot for its upcoming live-action version of its hit animated film \"How to Train Your Dragon.\"\nThe film is due out in theaters June 13.\n— Sarah Whitten\nSet sail with MSC Cruises\nDrew Barrymore and Orlando Bloom take center stage in MSC Cruises' first ever Super Bowl commercial.\nThe pair spend the 60-second ad highlighting the amenities on the new MSC World America, which is due to make its inaugural trip from Miami in April. The Caribbean-bound ship has 22 decks, seven distinct districts and 19 dining venues, including the first Eataly at sea.\nThe ship also boasts the first over-water swing ride at sea, called the Cliffhanger.\n— Sarah Whitten\nPfizer fights cancer\nPharmaceutical company Pfizer is back this year with another ad touting its fight against cancer. The drug giant got time in the first ad break of the game.\n— Sara Salinas\nBen Affleck's DunKings return in Dunkin's Super Bowl ad\nThe DunKings are back to kick off the Super Bowl.\nIn the first spot of the big game, Ben Affleck once again returns in a Dunkin' campaign, this time with brother Casey Affleck and a new recruit: \"Succession\" star and Oscar nominee Jeremy Strong.\nThe ad marks the third-ever Super Bowl appearance by the coffee chain, which is privately owned by Inspire Brands, the parent company of Arby's and Buffalo Wild Wings. Affleck has starred in all of Dunkin's Super Bowl ads.\nThis year's spot also featured a cameo from Bill Belichick and his girlfriend, Jordon Hudson.\n— Amelia Lucas\nKansas City wins the coin toss, elect to defer\nThe Kansas City Chiefs have won the coin toss and elected to defer. They will kick the ball off to the Philadelphia Eagles to start the game and receive the kick to begin the second half.\n— Sarah Whitten\nSuper Bowl pregame show highlights host city and fan favorites\nThe Super Bowl kicks off in less than 10 minutes, but first, the Caesars Superdome played host to a spectacle of musical talent.\nThe Southern University Marching Band played alongside legendary trumpeter Terence Blanchard, the Soul Rebels, the Original Pinettes — New Orlean's only all-female brass band — and the Spirit of New Orleans Gospel Choir. Harry Connick Jr. also joined in with Leroy Jones on trumpet and Freddie Lonzo on trombone.\nThe live performance came after a message from Fox Sport's team about the resiliency of Americans in the wake of tragedy, particularly the recent attack in New Orleans on New Year's Day, the devastating hurricanes the southeast U.S. in recent months and the deadly wildfires in Los Angeles.\nLady Gaga performed as part of this pre-taped segment, singing \"Hold My Hand,\" her song from \"Top Gun: Maverick.\"\nAnd, Brad Pitt introduced the Super Bowl on Fox with a video championing the resilience of Americans and the unifying aspect of the NFL championship.\n— Sarah Whitten\nFollow and listen to the CNBC Sport podcast\nCNBC Sport is now a podcast.\nEach week we bring you interviews with the biggest names in the business, like ESPN Chairman Jimmy Pitaro, NBA Commissioner Adam Silver, ESPN NFL Analyst Mina Kimes and more.\nFollow and listen wherever you find your podcasts.\nThe ads are officially rolling: Oikos spot highlights the protein in its yogurt\nHow much protein is in an Oikos yogurt?\nAccording to the Danone brand's Super Bowl spot, it's enough that \"Ted Lasso\" star Juno Temple can lift NFL defensive end Myles Garrett on her shoulders and run through a packed airport to reach his gate.\nThe ad specifically highlights Oikos Pro and Oikos Triple Zero, both of which tout high protein content on their packaging.\nIn recent years, U.S. consumers have been upping their protein intake, leading to a swell of snacks and drinks aimed at addressing the dietary change. The growing adoption of GLP-1 drugs has only increased this demand because patients need to eat enough protein to prevent muscle loss.\n— Amelia Lucas\nWhy the BetMGM CEO is rooting for the Eagles\nBetMGM CEO Adam Greenblatt really wants the Eagles to win Sunday's Super Bowl, because it's best for the sportsbook.\nGreenblatt spoke to CNBC about improvements in the digital product and how they've fueled momentum to start 2025. He said more parlay offers on an app that operates faster is drawing in higher margin players.\nAnd while Greenblatt is optimistic about BetMGM's potential for growth in sports betting, he said the online casino business, or iGaming, is on fire, with a 55% year-over-year increase in active players, without adding any additional markets or states.\n— Contessa Brewer\nAsk the Athletes: Sports betting\nAsk the Athletes: Best investing advice\nFanatics says its sportsbook is ready for game day\nFanatics Sportsbook is looking to show off the innovative ways it rewards its players and the advantage it gives them over their competitors.\nFanatics Betting and Gaming CEO Matt King sat down with CNBC to talk about the company's loyalty program powered by FanCash, which customers can then use to buy sports merchandise from Fanatics. The company says at least 3 in 4 Fanatics Sportsbook customers are using FanCash each month for purchases.\nIt's also introduced a type of parlay insurance as part of the Fair Play program for instances when an athlete is injured early in a game. King said the sportsbook has refunded about $3.5 million under the program so far.\n— Contessa Brewer\nDraftKings CEO Jason Robins on bet offerings and the threat of taxes\nDraftKings co-founder and CEO Jason Robins spoke to CNBC fresh off an NFL regular season that cost U.S. sportsbooks big time as fan favorites kept winning.\nRobins said \"diverse bet offerings will make game outcomes less impactful.\" For instance, he said more money is coming in on player props.\nDraftKings and other sportsbooks face the prospect of much higher state taxes in Ohio and Maryland, even as competition increases from sweepstakes-style gaming, fantasy plus, prediction markets and offshore.\n\"You are talking orders of magnitude larger than is going to be wagered in the legal market this year,\" he said.\n— Contessa Brewer\nAd executives say Super Bowl commercials are still worth it\nThe cost of Super Bowl commercials steps up ever year — this year some went for a record $8 million — and yet ad industry executives say the cost is still worth it.\nThe reason? No other TV event beckons such a large audience in one sitting. Last year more than 123 million people tuned into the Super Bowl. This year it'll be broadcast on Fox, as well as aired on its free streamer, Tubi, which could mean more viewers, too.\n\"The scale and buzz factor still delivers a punch,\" said Amy Leifer, DirecTV's chief advertising sales officer.\nFor brands there are some factors that play into whether spending big on the Super Bowl is worth it. One important factor is the ad's placement during the game, getting as specific as what quarter the ad airs in. And thinking of the target audience rather than the size of the audience is important, too, said Andre Banks, CEO and founder of ad data firm NewWorld.\nLaunching a new product is always a positive during the Super Bowl, said Kevin Krim, CEO of EDO, an ad data firm. When companies like Kia and Popeye's launched new products in Super Bowl commercials in recent years, online engagement with the brands remained elevated in the weeks after the game, Krim said.\n— Lillian Rizzo\nCosm is looking to take its immersive sports viewing international\nCosm, the immersive sports-viewing venue company, is looking to go international — and potentially to raise new funding.\nCEO Jeb Terry told CNBC Sport this week that Cosm is fielding inbound calls from real estate developers and municipality leaders in countries around the world.\n\"I get calls daily from everywhere in Europe,\" Terry said. \"You look at calls from China, the Middle East, Japan. Australia is banging down our door. There's an opportunity to bring these venues globally, and we're looking to figure out what's the best path to do that.\"\nWatch the full interview above.\n— Alex Sherman\nContent creators swarm the big game on brand contracts\nContent creators will play a pivotal role in the NFL's strategy to attract Generation Z and Alpha audiences for this year's Super Bowl.\nHundreds of creators are swarming the Big Easy for Super Bowl 59, getting paid as much as six figures to make content for brands like Microsoft, Verizon, Electronic Arts and Nike.\nThe initiative, in collaboration with platforms like YouTube and Snapchat, underscores the NFL's shift toward marketing strategies that prioritize digitally native audiences.\n— Zach Vallese\nCaesars takes center stage in New Orleans\nIt's a big weekend for Caesars Entertainment – the first casino partner of the NFL – with naming rights to the Caesars Superdome and a new $435 million renovation to unveil at its casino, sportsbook and hotel in New Orleans.\nCEO Tom Reeg told CNBC it's a huge opportunity to introduce, or re-introduce, the brand to customers.\n\"Maybe they've got a dated view of what Caesars used to be, even in New Orleans,\" Reeg said. \"They see this and go back and are impressed with it.\"\nAs of Sunday around 4 p.m. ET, the sportsbook had tallied seven bets for more than $100,000 each. The largest wager placed with Caesars, for $250,000, was placed on-site at Caesars New Orleans.\n— Contessa Brewer\nAsk the Athletes: Tariffs\nFanDuel floods the zone on Super Bowl weekend\nFanDuel CEO Amy Howe spoke to CNBC about how she expects the company's investment in the Super Bowl bonanza to pay off in customer acquisition opportunities.\nWhen asked about a bipartisanship request for the DOJ to investigate alleged anti-competitive practices by FanDuel and DraftKings, Howe said she's confident that FanDuel is compliant with antitrust laws, \"but there is still a half a trillion black market with offshore operators that aren't paying any taxes.\"\n— Contessa Brewer\nTrump congratulates both teams ahead of the game\nIn a message from the White House ahead of the Super Bowl, President Donald Trump congratulated the players, coaches and staff on the Eagles and Chiefs, saying that they \"represent the best of the best in professional football, but they also embody the best of the American Dream.\"\n\"Their hard work, dedication, and tenacity is admirable, and their individual journeys are as inspiring as the drive and determination that has led them to this extraordinary moment,\" he added.\nIn the message, Trump also offered condolences to the families who lost loved ones in the terror attack in New Orleans on New Year's Day.\n\"While thousands of fans from across our Nation gather in New Orleans to cheer on their favorite team, we remember that 14 families will be missing a loved one who was tragically murdered during a senseless terrorist attack while celebrating the New Year on Bourbon Street,\" the president wrote. \"Our thoughts are also with the 35 individuals injured during the attack whose lives were changed forever that fateful night, and our prayers will remain with them for continued strength, comfort, and healing.\"\n— Alexandra Marquez, NBC News\nEagles fans flock to New Orleans\nBuyers from Pennsylvania have purchased 15% of Super Bowl tickets sold on ticketing site StubHub, according to data from the company Sunday. Buyers in Kansas and Missouri have purchased 8.4% of tickets.\nThe average price of tickets sold at this point is just over $6,500, more than 20% lower than the average price last year.\n\"This Super Bowl has sold more tickets than any Chiefs Super Bowl in StubHub history, thanks to more approachable prices compared to previous years. Fan interest for this rematch has remained strong with buyers coming from 18 countries outside of the U.S. ... demonstrating the NFL's continued global appeal,\" said Adam Budelli, spokesperson for StubHub, in a statement.\n— Sara Salinas\nNLF media boss says Super Bowl 59 has 'a chance' to be the most watched ever\nOn the heels of a record Super Bowl audience last year, the 2025 championship has \"a chance\" to top it, according to NFL Chief Media and Business Officer Brian Rolapp.\n\"It's got a chance, considering the last time they met two years ago, it was the second-most watched Super Bowl. So if the game is close, I think it's got a chance,\" Rolapp said in an interview with CNBC Sport.\nRolapp sat down with CNBC Sport in New Orleans ahead of the big game. He also spoke about media rights, international expansion and ticket prices.\nWatch the full interview above.\n— Alex Sherman\nChiefs owner Clark Hunt on the record\nCNBC Sport sat down with Kansas City Chiefs owner Clark Hunt ahead of Super Bowl 59.\nHe spoke about the team's valuation compared with top NFL rivals, whether he would sell a stake to private equity, and the prospect of expanding the NFL season to 18 games. He also spoke about how Taylor Swift is changing the team's fanbase.\nWatch the full interview above.\n— Alex Sherman\nLegal betting could hit $1.4 billion\nAmericans are expected to bet almost $1.4 billion on the Super Bowl via legal sportsbooks, according to the American Gaming Association. That would be a record for wagers on the big game.\n— Contessa Brewer\nJon Batiste to belt out National Anthem\nJon Batiste will help kick off Super Bowl 59 with a rendition of the national anthem.\nThis is the Grammy Award-winning artist's first appearance in the Super Bowl as a performer. Batiste formed the band Stay Human while attending Juilliard and has performed as the house band for \"The Late Show with Stephen Colbert\" on CBS since 2015.\nThe big question is how long will it take Batiste to belt out the anthem? You see, there's always a prop bet on the length of the national anthem.\nHere's how long previous singers have taken:\n- 2024: Reba McEntire - 1:36\n- 2023: Chris Stapleton - 2:01\n- 2022: Mickey Guyton - 1:51\n- 2021: Eric Church and Jazmine Sullivan - 2:17\n- 2020: Demi Lovato - 1:49\n- 2019: Gladys Knight - 2:01\n- 2018: Pink - 1:52\n- 2017: Luke Bryan - 2:04\n- 2016: Lady Gaga - 2:23\n- 2015: Idina Menzel - 2:04\n- 2014: Renée Fleming - 2:03\n- 2013: Alicia Keys - 2:36\n- 2012: Kelly Clarkson - 1:34\n— Sarah Whitten\nThe Kansas City dynasty\nThe Kansas City Chiefs have risen to dynastic success in recent year under head coach Andy Reid. Led by Patrick Mahomes, Travis Kelce and Chris Jones, the team has appeared in five Super Bowls since 2019, winning three.\nThis year, the team seeks to be the first team in the history of the NFL to win three Super Bowls in a row.\nBefore the arrival of quarterback Mahomes in 2017, the Chiefs only had one Super Bowl title, back in 1969. Since Mahomes, the Kansas City Chiefs have played in every AFC Championship game.\nMahomes has also been named the Super Bowl MVP in each of the Super Bowls in which his team was victorious.\n— Sarah Whitten\nAsk the Athletes: Nvidia — Buy or Sell?\nNew Orleans readies for an influx of NFL fans and Trump\nHost city New Orleans is expecting an estimated 125,000 visitors this weekend — including President Donald Trump.\nHotel demand surged in the past week, with a spike in interest from travelers in Pennsylvania, New Jersey, Kansas and Missouri, according to travel site Tripadvisor.\nSafety officials have ramped up their security efforts for the weekend in light of a New Year's Day attack in New Orleans' French Quarter that left 14 people dead.\n— Contessa Brewer and Jessica Golden\nWhat your chicken wings cost this year, comparatively\nIf you're a fan of pairing your football with some chicken wings, your wallet will be taking less of a hit this year than usual. Despite the bird flu outbreak, which has decimated egg-laying flocks, chickens raised for meat have been mostly unaffected.\nInflation on an annual basis for fresh and frozen chicken parts is hovering just above 1% nationwide, according to the most recent consumer price index from the U.S. Bureau of Labor Statistics. That's about half the national average for the overall CPI.\nHowever, previous bouts of inflation mean that chicken prices are much higher than they were just four years ago. The price for chicken parts today is up almost 25% from 2021. By contrast, the general CPI is only 21% higher than it was four years ago.\n— Gabriel Cortés\nKendrick Lamar headlines halftime show\nRapper Kendrick Lamar is headlining this year's halftime show fresh off a massive night at the Grammys.\nLamar's \"Not Like Us\" single swept all five categories it was nominated in last weekend, winning Record of the Year, Song of the Year, Best Rap Performance, Best Rap Song and Best Music Video.\nThe song made waves when it was first released in May as one of several diss tracks traded between Lamar and fellow rapper Drake. Drake last month sued his record label, Universal Music Group, claiming the label, which also represents Lamar, defamed him by distributing a \"false and malicious narrative\" with the song.\nLamar is launching a national tour with R&B singer SZA in April. SZA is also set to perform during Sunday's halftime show, sponsored by Apple Music.\n— Sara Salinas\nAsk the Athletes: AI\nManning vs. Manning in the 'Kick of Destiny'\nRob Gronkowski had two chances at FanDuel's \"Kick of Destiny\" — now it's the Manning brothers' turn.\nDuring the Super Bowl pregame show in New Orleans, Peyton and Eli Manning will each get a chance to kick a 25-yard field goal in what's becoming the most high-profile annual pregame betting opportunity.\nAccording to FanDuel's official rules, if both Mannings miss their field goal, the marker is moved up five yards. If they both make it, the ball remains at the same spot and they kick again. If the brothers match each other, the third round will turn to tie-breaker rules.\nFans have until 3:00 p.m. ET to lock in their vote for which brother will be victorious. Winners will receive an equal share of the $10 million prize pool.\n— Sarah Whitten\nSpanish-language telecasts will be on Fox Deportes and Telemundo\nViewers looking for a Spanish-language telecast of the Super Bowl will have two options this year: Fox's cable TV network Fox Deportes and NBCUniversal's over-the-air broadcaster Telemundo.\nThe first time the Super Bowl aired in Spanish was in 2015 on Fox Deportes. Telemundo's first broadcast of the Super Bowl took place in 2022, and the network has seen its viewership of NFL games significantly grow since then. Last fall, the two networks announced they would each air the Super Bowl and produce separate broadcasts.\nWhile NFL games, especially the Super Bowl, are known for their explosive ratings, the league has been pushing to expand its audience, both globally and within the U.S. A key part of that strategy is Hispanic viewership, CNBC reported last year.\n— Lillian Rizzo\nFox nabs $8M ads for Super Bowl this year\nAdvertisers once again shelled out a record amount for spots during the Super Bowl this year. Broadcaster Fox sold out of ad spots in the fall for the Super Bowl, and more than 10 of its 30-second commercials were priced at $8 million, CNBC previously reported. Advertisers that got in early spent more than $7 million, the person said.\nFew live events or TV programming garner the audience that the Super Bowl does each year, ensuring advertisers are willing to pay up to have their brands in front of millions of eyeballs at once.\nLast year Nielsen reported roughly 123.7 million people watched the Super Bowl. This year has potential for even more viewers with Fox offering the game on its free streaming service Tubi.\n— Lillian Rizzo\nFree streamer Tubi will air the Super Bowl for the first time\nThe Super Bowl is no stranger to streaming as broadcasters have been offering simulcasts of the game on their services in recent years. What's different this year is that the Super Bowl will be available on Tubi, the Fox-owned free, ad-supported streaming service.\nConsumers without cable TV subscriptions or access to the game through traditional methods will be able to watch it for free on the Tubi app, which is available on streaming TVs, devices and phones.\nFox Deportes' Spanish-language telecast will be offered, too, and Tubi will have an exclusive pregame Red Carpet show for those looking for an alternative to the typical pregame show.\nTubi's viewership skews toward millennials, Gen Z and women, expanding potential fandom for the NFL and reach for advertisers that have shelled out big bucks.\nTubi will air the same feeds as those broadcast by Fox — commercials and all.\n— Lillian Rizzo",
  "word_count": 8225,
  "scraped_at": "2026-02-14T12:43:09.307523"
}