{
  "article_id": "be99fe79bc27",
  "url": "https://wwd.com/beauty-industry-news/beauty-features/mecca-opens-worlds-biggest-freestanding-beauty-store-1238027730/",
  "title": "Mecca Opens World Biggest Beauty Store",
  "date": "20250806T053000Z",
  "domain": "wwd.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Mecca is thinking big.\nReally big.\nThe Melbourne-based retailer, which has evolved from indie darling to Australia’s dominant prestige beauty player, will on Friday open the doors of its largest store yet.\nMeasuring about 40,000 square feet spread over two floors and located on Bourke Street in the heart of Melbourne’s Central Business District, the flagship will not only be Mecca’s largest, but the biggest freestanding beauty store in the world.\n“It doesn’t take space to sell beauty. It takes space — and a lot of it — to experience beauty as we push into the blue zone of experiential beauty,” said Mecca founder and co-chief executive officer Jo Horgan. “This feels like a natural continuum of when we started 28 years ago.\n“Back then, it was, ‘How do we reinvent the beauty experience to make it totally consumer-centric?’” Horgan continued. “Our view of the way in which beauty is evolving is that experience, service and human connection have become central to the future of beauty.”\nThe store’s opening comes at a time when Mecca continues to outperform the overall market in Australia. Industry sources expect the company to end the year with 1.8 billion Australian dollars, about $1.16 billion, in turnover. Horgan declined to comment on the figure, but did say that Mecca’s growth rate tripled that of the overall prestige beauty market in Australia in 2024, which posted year-over-year gains of 3 percent, and that the retailer has a market share of more than 30 percent.\nThe flagship could hit first-year sales of 80 million to 100 million Australian dollars, according to speculation in published reports. Horgan declined to confirm on those figures, saying, “We are crystal clear that it will take time to build this store to deliver its full potential in every way — in the number of people visiting, in the hours spent in store, in sales delivered. We are very clear that this is a journey.”\nShe also shot down market reports that she is looking to sell Mecca. “You don’t do a store on this scale, something this outlandish, if you’re looking to sell,” Horgan said.\nInstead, the company is doubling down in its home market with the opening of the flagship, which will take Mecca deeper into health and wellness, as well as services. There will be more than 80 available, some free of charge, others not, across hair, makeup, nails, fragrance and wellness.\nMost recently the home of the David Jones menswear store, the location also housed the world’s biggest bookstore named E.W. Cole after its founder. “Edward Cole had a philosophy that customers should come in and have the most extraordinary time — come, sit, read, buy, don’t buy,” said Horgan, noting that the building’s history served as the inspiration for the team when it came to ideating how to fill the space. The goal is to entice customers to stay the entire day — hence the Mecca Café, which will serve everything from martinis to baked goods from Lune, Melbourne’s legendary bakery.\n“In its day, the bookstore was synonymous with Melbourne — it was much more than a shop; it was part of the fabric of the city,” said Maria Tsaousis, chief new concepts officer at Mecca. “Our vision is the same. We want it to be just as synonymous with Melbourne as the National Gallery of Victoria or the Australian Football League.”\nAt the entrance there is a large bronze cloud-shaped concierge desk that will be staffed by up to six people to direct shoppers and answer questions, and the Mecca News Room, a 300-square-foot space with a large digital installation that will deliver a steady stream of beauty content.\n“It’s literally the billboard of what’s going on in beauty at the moment,” said Marita Burke, chief Mecca-maginations officer. “It will be everything you want to know right now and change frequently. For example, it might feature women we admire during Mother’s Day or the latest TikTok trend.”\nA large carousel dominates the center of the floor, a place where shoppers will be able to test, try, play and learn. Mecca has been testing various iterations of the carousel in other locations, and this is the largest manifestation of the concept. “It’s had an extraordinary pulling power — people gravitate to it,” Burke said. “They’re connecting with each other and with product. More and more we’re seeing people want a social setting where they can experience beauty with their friends and community, whether old or new.”\nOn the left side of the ground floor will be skin care, with brands grouped by trending skin, high-performance, ingredient-led active skin care and luxury skin care. Each category “zone” will have both brands and services; in skin care, those will range from consultations to semi-private cabins with no downtime treatments like microdermabrasion or a deep cleanse facial, with the service cost redeemable in product.\nKey brands include Tatcha, Elemis, Korres, Youth to the People, Dr. Dennis Gross, Osea, Omorovicza, Mecca Cosmetica and Shiseido. Augustinus Bader, Dr. Barbara Sturm and Biologique Recherche will also be merchandised here, as well as in the skin spa upstairs.\nColor cosmetics, which Tsaousis calls the “engine room” of Mecca, occupies the right side. The offer will range from emerging brands like Violette_FR and Isamaya to established players including Nars, Glossier, Charlotte Tilbury, Westman Atelier and the house brand Mecca Max. Services, ranging from makeup and lash applications to lessons, will be on offer at an 18-seat artistry studio, and are also redeemable in products.\nIn the rear sits the apothecary and a florist. The apothecary will be the wellness focal point of the store, and will concentrate on three verticals at launch: sleep, stress and hormonal health. There will be about 30 brands in all, many new to Mecca, ranging from beauty tech like Oura Rings to topicals and environmental products and even crystals. Key brands include Aman, Bamford, Flamingo Estate, Kit, Mutha, The Nue Co. and Nopalera.\nMecca has partnered with the Melbourne Apothecary to have a full-time naturopath in the store, who will offer a wide array of wellness services. That will include everything from ear seeding to acupuncture to breath coaching; prices range from 45 Australian dollars for facial mapping to 195 Australian dollars for a one-on-one coaching session.\nHair care products will also be adjacent to the apothecary, “but hair will really come alive upstairs at the Josh Wood Hair Salon,” said Horgan, noting that it is the celebrity stylist’s first international outpost outside of London. Key brands in the retail area include Kérastase, Philip B., LolaVie, Ceremonia, Briogeo, Sam McKnight, Bumble and bumble, La Bonne Brosse, Crown Affair and Dyson.\nA purpose-built mezzanine level will be dedicated to gifting, which Horgan described as a “cocoon of wild color and exotic products.” There will be a calligrapher and engraver on hand, bespoke packaging and specially designed scarves used for gift wrapping in the style of Japanese furoshiki.\nThe mezzanine leads to the Perfumeria, which is divided into two key zones, both staffed by “scent sommeliers.” Fragrance is Mecca’s fastest-growing category and the company has dedicated more than 6,000 square feet to it. Here will be a fragrance bar, complete with stools where customers can have an in-depth consultation, as well as the Scent-Sorium, a large table with diffusers that pop out and emit scent at the press of a button.\nThe scent sommeliers have been trained to deliver a personalized consultation, discover a customer’s needs and style and then curate a personal assortment for them. “In every area of the store — fragrance, makeup, skin care — we asked ourselves, ‘what is the service experience that will breathe life into the category and encourage customers to play, test and learn about something that they didn’t know about before they entered the store,” Tsaousis said.\nThe pillar brands in fragrance include Diptyque, Byredo, Perfumer H, Dries Van Noten, Maison Francis Kurkdjian, Editions de Parfum Frédéric Malle, Maison Crivelli and Officine Universelle Buly. Emerging brands include Arpa, BornToStandOut, To My Ships and Control & Chaos.\nMaria Tash piercing is adjacent to fragrance, which flows into Josh Wood Hair, where salon services will start at $50 Australian for a blowout. Cuts will begin at $95 Australian and color at $115 Australian.\nHere, too, will be the Atelier, where guests can have their hair, makeup and nails done at the same time or separately. Makeup applications will start at $200 Australian while hair and makeup will cost $325 Australian. Melbourne’s trendy nail art studio, Trophy Wife Nails, will be overseeing nail services here and in its own dedicated area.\nThe second floor will also house Meccaversity, which will open in October and seat about 150 people for education-oriented events and master classes, and Mecca Aesthetica, the skin care services concept that the company has been testing in other doors. Measuring about 4,000 square feet, it has seven treatment rooms, and will offer clinical-level services from brands like Biologique Recherche, Ultraceuticals and Zo Skin Health. Facial prices start at about $360 Australian.\nThe building was designed by the Sydney-based architecture firm Studio McQualtar, which left many of the original features like the terrazzo floors intact during the renovation period. Throughout, the space features art by contemporary female artists including Diena Georgetti, Christina Zimpel, Patricia Piccinini and Karen Black, who has also created Mecca’s holiday packaging for 2025.\nHorgan declined to comment on the budget for the buildout, calling the investment “a long-term proposition.” She emphasized that the goal wasn’t to do big for big’s sake. “Our mantra is no vanity projects,” she said. “When we opened our flagship in Sydney, which was nearly three times the size of our previous biggest store, we were blown away by how customers embraced it. That emboldened us to say that our flagship strategy of experiential retail on steroids is something customers clearly want.”\nThe company will also use the store as a portal to its broader community. Earlier this year, for example, Mecca hosted a master class with Charlotte Tilbury during a week of public appearances. “We beamed that into all of our stores and customers could sit at a Mecca Beauty Lab and follow what Charlotte was doing,” said Horgan, adding that it had a reach of more than 800,000 people on TikTok alone.\n“Not only is the flagship a model of innovation where we test and trial and then roll out, but it’s also an IRL platform to give us the greatest content that we can magnify out to our community, both in other brick-and-mortar stores and online. It’s like YouTube made physical.”\nAs to whether Horgan is contemplating taking Mecca global? “We believe there are many ways to open new markets and at this point, Bourke Street is the culmination of our experience to date and all of the tests and trials we’re doing about our future state,” she said. “In terms of brick-and-mortar, we’ll take the learnings from this store and consider what we do next.\n“We’ve taken the Mecca Cosmetica brand and launched it in the U.K., France, Germany and Spain. Everything we do is a test and trial, and we do things incrementally,” Horgan continued. “We are exploring lots of different avenues for growth.”\nBefore the official opening on Friday, Mecca is holding “dress rehearsals” throughout the week, inviting its top Beauty Loop loyalty members in for a special preview, for example, as well as the families of the builders who worked on the renovation and the retailer’s own teams. For the official opening, Mecca will take over the pedestrian mall in front of the building, where the store team of 300 associates will collectively cut a giant ribbon and then clap in the first customers as they enter the store. More than 2,000 shoppers have already registered to be first in. The company expects over 50,000 visitors per week.\n“I took my parents through the building and said, ‘This is mad,’” said Horgan, “and my dad said, ‘Yes, but you have to do mad, because everything else has been done.’”",
  "word_count": 2007,
  "scraped_at": "2026-02-14T13:43:16.435225"
}