{
  "article_id": "be9a37ee3543",
  "url": "https://www.bworldonline.com/arts-and-leisure/2025/01/24/648563/netflix-shares-hit-record-as-subscriber-growth-defies-odds-once-again/",
  "title": "Netflix shares hit record as subscriber growth defies odds once again",
  "date": "20250123T220000Z",
  "domain": "bworldonline.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Netflix shares hit record as subscriber growth defies odds once again\nSHARES of Netflix soared 13% to an all-time high on Wednesday after the streaming giant’s big bet on sports helped add a record 18.9 million subscribers in the holiday quarter, ballooning its already sizeable advantage over other players.\nThe company also unveiled price hikes on Tuesday in markets including the US, aiming to boost revenue just as it shifts focus from subscriber growth to other performance metrics such as sales.\n“We thought it was a typo. Netflix defied the odds once again, delivering subscriber additions far beyond even the most unreasonable subscriber bogey,” Bernstein analyst Laurent Yoon said.\nThe company’s global subscriber base now exceeds 300 million, giving it a commanding lead in the streaming wars and more leverage in talks with marketing firms as it looks to grow its ad-supported business.\nNetflix, already worth more than the combined valuations of rivals Disney, Comcast, Paramount, and Warner Bros. Discovery, was set to add more than $50 billion to its market capitalization of about $370 billion, if gains hold.\nThe stock hit a record high of $988 during early morning trading on Wednesday, paving the way for a potential stock split.\nIts shares soared more than 80% last year, driven by Netflix’s expansion into live sports with content including a boxing match between Jake Paul and Mike Tyson, as well as the debut of popular National Football League games on Christmas Day — which included a half-time performance from popstar Beyoncé.\nThe Nov. 15 Tyson-Paul bout was the most-streamed sporting event ever and drove the most sign-ups for Netflix for any event since Antenna started tracking this data in 2019. Its strong content slate in the quarter also included the second season of Squid Game and the hit streaming movie Carry-On.\n“Sports rights can be incredibly expensive and it makes sense that Netflix has opted to go with special events. Such events are also perfect for attracting advertisers keen to reach a large audience,” said Dan Coatsworth, analyst at AJ Bell.\nMr. Coatsworth, as well as several other analysts, said Netflix would now inevitably start bidding for other major sports rights. The company has already secured US broadcast rights for the 2027 and 2031 editions of FIFA Women’s World Cups.\nNARROW REVENUE BEAT\nThe strong report, however, masked one concern: the subscriber surge did not translate into a similar spike in revenue. Sales rose 16% and were only around $100 million above estimates, while the subscriber growth was about twice the expected number.\nThe narrow beat could be attributed to both subscriber growth from lower average revenue per user (ARPU) countries and the significant number of sign-ups for the ad-supported tier, said Ben Barringer, technology analyst at Quilter Cheviot.\nBut he added that the already announced price hikes and those expected to roll out over the course of 2025 should boost sales.\nThis year, Netflix is expected to showcase new seasons of highly popular shows such as Stranger Things and Wednesday. It has already started streaming WWE RAW.\nAt least 24 analysts raised their price targets on the stock, bringing the median target to $1,025, according to LSEG data. The stock’s 12-month forward price-to-earnings ratio stands at 35.43 compared with Walt Disney’s 19.19. — Reuters",
  "word_count": 545,
  "scraped_at": "2026-02-14T12:11:09.231062"
}