{
  "article_id": "be9e161b4e21",
  "url": "https://www.thenationalnews.com/news/us/2025/05/30/us-supreme-court-lets-trump-revoke-parole-status-for-migrants/",
  "title": "US Supreme Court lets Trump revoke  parole  status for migrants",
  "date": "20250530T164500Z",
  "domain": "thenationalnews.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "The US Supreme Court on Friday let President Donald Trump's administration revoke the temporary legal status of hundreds of thousands of Venezuelan, Cuban, Haitian and Nicaraguan migrants living in the US, bolstering the Republican leader's drive to step up deportations.\nThe court put on hold Boston-based US District Judge Indira Talwani's order halting the administration's move to end the immigration “parole” granted to 532,000 of these migrants by Mr Trump's predecessor Joe Biden. The move potentially exposes many of them to rapid removal while the case plays out in lower courts.\nAs with many of the court's orders issued in an emergency fashion, the decision was unsigned and gave no reasoning. Two of the court's three liberal justices, Ketanji Brown Jackson and Sonia Sotomayor, publicly dissented.\nThe court botched its assessment of whether the administration was entitled to freeze Ms Talwani's decision pending the litigation, Ms Jackson wrote in an accompanying opinion.\nThe outcome, Ms Jackson wrote, “undervalues the devastating consequences of allowing the government to precipitously upend the lives and livelihoods of nearly half a million non-citizens while their legal claims are pending”.\nImmigration parole is a form of temporary permission under American law to be in the country for “urgent humanitarian reasons or significant public benefit”, allowing recipients to live and work in the US.\nMr Biden, a Democrat, used parole as part of his administration's approach to deter illegal immigration at the US-Mexican border.\nMr Trump called for the end of humanitarian parole programmes in an executive order signed on January 20, his first day back in office. The Department of Homeland Security moved to terminate them in March, cutting short the two-year parole grants.\nThe administration said revoking the parole status would make it easier to place migrants in a fast-track deportation process called “expedited removal”.\nThe case is one of many that Mr Trump's administration has brought in an emergency fashion to the nation's highest judicial body, seeking to undo decisions by judges impeding his sweeping policies, including several targeting immigrants.\nThe Supreme Court on May 19 let the President end a deportation protection called temporary protected status that had been granted under Mr Biden to about 350,000 Venezuelans living in the US, while that legal dispute plays out.\nIn a bid to reduce illegal border crossings, Mr Biden in 2022 allowed Venezuelans who entered the country by air to request a two-year parole if they passed security checks and had a US financial sponsor. Mr Biden expanded that process to Cubans, Haitians and Nicaraguans in 2023 as his administration grappled with high levels of illegal immigration by those nationalities.\nThe plaintiffs, a group of migrants granted parole and Americans who serve as their sponsors, sued officials, claiming the administration violated federal law governing the actions of government agencies.\nMs Talwani in April found that the law governing such parole did not allow for the programme's blanket termination, instead requiring a case-by-case review. The 1st US Circuit Court of Appeals declined to put the judge's decision on hold.\nIn its filing, the Justice Department told the Supreme Court that Ms Talwani's order had upended “critical immigration policies that are carefully calibrated to deter illegal entry”, effectively “undoing democratically approved policies that featured heavily in the November election” that returned Mr Trump to the presidency.\nThe plaintiffs told the Supreme Court they would face grave harm if their parole is cut short, given that the administration has indefinitely suspended processing their applications for asylum and other immigration relief.\nThey said they would be separated from their families and immediately subject to expedited deportation “to the same despotic and unstable countries from which they fled, where many will face serious risks of danger, persecution and even death”.\nMs Talwani on Wednesday ordered the administration to resume processing applications for work permits or more lasting immigration status from migrants with parole status from Afghanistan, Latin America and Ukraine.",
  "word_count": 650,
  "scraped_at": "2026-02-14T12:11:25.441044"
}