{
  "article_id": "beb15591f386",
  "url": "https://theathletic.com/4889738/2023/09/22/spain-sweden-women-banner/",
  "title": "Spain and Sweden display  It Over  banner before Nations League fixture",
  "date": "20230922T171500Z",
  "domain": "theathletic.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Players from Spain and Sweden stood together with a banner reading “It’s over. Our fight is the global fight.” before the pair’s Nations League meeting on Friday.\nThe fixture marked Spain’s first match since they beat England in the 2023 World Cup final. Spanish football association (RFEF) president Luis Rubiales kissed striker Jenni Hermoso during the medal ceremony — Hermoso says the kiss was not consensual, which Rubiales denies — sparking widespread criticism, resignations within the RFEF and proposed strike action from the players.\nAdvertisement\nSpain players wore white tape over both their wrists during the fixture in Gothenburg, one with Hermoso’s number 10 written on and the other reading “It’s over”. The starting XI posed for their team photo with their fists raised to display the “It’s Over” message.\nSpain then came together with Sweden on the halfway line to collectively display the banner. The world champions also received a standing ovation from the home crowd at Gamla Ullevi as they ran out to warm up.\nSweden captain Kosovare Asllani had confirmed during Thursday’s pre-match press conference that her side were preparing a joint show of support for Spain.\n“I think it’s sad they had to go through this after winning the World Cup but it’s a fight worth taking,” Asllani said. “They’re taking this fight not just for themselves but for the next generation. This is not just a question in the sport world it’s a society question and these things have to change.\n“It’s 2023 you don’t want to see these things. It’s about time they’re creating these changes in the federation. Every team and every player that are taking these fights are doing it with the rest of the women’s football world supporting them because we know how it feels to be in that situation.”\nSpain won the match, a repeat of last month’s World Cup semi-final, 3-2 thanks to Mariona Caldentey’s 96th minute penalty.\nRubiales had refused to step down in a speech at RFEF headquarters five days after the final and received a standing ovation. He was later suspended by FIFA and resigned in September, while head coach Jorge Vilda was also sacked.\nMembers of the Spain team released a statement on the Friday the squad for their Nations League fixtures was due to be announced, reiterating their stance that they would not play for the national team until major changes were made at the RFEF despite the departures of Rubiales and Vilda.\nAdvertisement\nA squad of 23 was named on Monday but sources close to several players, who asked to speak anonymously to protect their positions, told The Athletic they had not been informed in advance they were going to be selected.\nHermoso was not included in the squad for September’s camp. When asked why, head coach Montse Tome said: “We believe the best way to protect her in this squad is this way.”\nHermoso, who has returned to club football with Mexican side Pachuca since the World Cup, questioned who she needed protecting from in a social media statement: “Let’s be clear. A claim was made today stating that the environment within the federation would be safe for my colleagues to rejoin, yet at the same press conference it was announced that they were not calling me as a means to protect me. Protect me from what? And from whom?”\nA compromise between Spain’s players and the RFEF was reached on Wednesday after meetings involving government officials that ran into the very early hours, with 21 of the 23 players called up for September’s camp agreeing to represent their country. Mapi Leon and Patri Guijarro were the players who left camp due to “lack of morale and personal discomfort”.\nTwo-time Ballon d’Or winner Alexia Putellas said Wednesday’s meeting with government officials will be considered a landmark “before and after” moment for women’s sport in her country.\n“I think that the meeting the other day is a point that is going to mean it is a before and after,” she said. “I really think that. I trust that the agreements we reached, that took us to whatever hour in the early morning, will make our sport and I think also women’s sport and, by consequence, society, much better.”\nSpain are next in action on Tuesday when they face Switzerland in Cordoba. The Nations League fixture will be the first home match they have played since the 2023 World Cup.\nGO DEEPER\nSpain's women are world champions - yet the disrespect goes on\n(Top photo: JONATHAN NACKSTRAND/AFP via Getty Images)",
  "word_count": 756,
  "scraped_at": "2026-02-14T13:50:23.321131"
}