{
  "article_id": "becbc49c6ceb",
  "url": "https://www.southernminn.com/around_the_web/community/snl-cold-open-skewers-donald-trump-michigan-head-coach-in-one-fell-swoop/article_44d9a349-a599-5af1-8626-f0eb6ed5bf81.html",
  "title": "  SNL  Cold Open Skewers Donald Trump & Michigan Head Coach in One Fell Swoop | Community",
  "date": "20251214T161500Z",
  "domain": "southernminn.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "The Saturday Night Live cold open skewered both President Donald Trump and fired Michigan head coach Sherrone Moore in one fell swoop.\nOn Saturday, December 13, James Austin Johnson once again took on the persona of the POTUS, while Ashley Padilla played White House Press Secretary Karoline Leavitt. The scene opened with an Air Force One press conference.\nPadilla, as Leavitt, told reporters, “I know you have questions for the president, but it’s very late. He’s exhausted. His brain is all over the place. So unfortunately, he can’t wait to talk to you.”\nThat’s when Johnson, as Trump, appeared. “It’s your favorite president, hiding behind my curtain. Ohhh!” he said. “Peek behind the curtain, something I enjoyed doing at Miss Teen USA in 1997.” He also noted that he took both an Adderall and an Ambien, “so we’re gonna see which one wins.”\nAfter Leavitt said there was only time for a few questions, Trump turned to her and laid it on thick, declaring, “Oh, how great is Karoline Leavitt? We love her. Oh, she’s got a beautiful face. And those lips that don’t quit.”\nThe POTUS then pointed out, “Pretty amazing that I can just openly simp over my young, blond subordinate. It’s giving Michigan football coach. Can we get a close-up? Let’s get a close-up on her mouth. That’s one of my top mouths. Ah, I love that mouth… I’m a married man. I’m obsessed with this woman.”\nUniversity of Michigan’s head coach, Sherrone Moore, was arrested for alleged assault on December 10, after he was fired for an “inappropriate relationship with a staff member.”\nTrump added, “See? She liked it because I’m very nice to women,” before turning to a reporter and saying, “Yes, you have a question, you nasty, horrible witch.”\n“Uh, my name is Kaitlan Collins, sir,” the CNN journalist — whom Trump previously told, “Quiet, piggy,” — replied. “And that’s one of the nicer things that you’ve told me.”\nLater in the skit, the president said on the topic of military strikes, “We’re not just targeting drug boats, we’re targeting drug planes, as well. In fact, we have some declassified video from a strike.”\nThe camera then panned to a screen showing Santa’s sleigh exploding after the U.S. military locked in and opened fire.\nTo end the cold open, Trump instructed the camera to zoom in on Leavitt’s face, as Johnson and Padilla exclaimed, “Live from New York, it’s Saturday Night!”\nSaturday Night Live, Saturdays at 11:30 p.m. ET on NBC\nMore Headlines:\n- ‘Bob’s Burgers’ Celebrates Christmas With an Action-Packed Ode to Yuletide Favorites\n- ‘SNL’ Cold Open Skewers Donald Trump & Michigan Head Coach in One Fell Swoop\n- 9 ‘King of Queens’ Secrets You Didn’t Know\n- Bill Maher Makes Bold Declaration About Whether Genocide Is Happening in Gaza\n- Kelly Ripa & Mark Consuelos Surprise Daughter Lola at Debut Performance (VIDEO)\nLet the news come to you\nGet any of our free email newsletters — news headlines, e-edition, prep sports, obituaries, entertainment and more.\nExplore newsletters",
  "word_count": 506,
  "scraped_at": "2026-02-14T14:19:37.543631"
}