{
  "article_id": "becdfd90a376",
  "url": "https://www.bbc.co.uk/news/articles/cgj4521d4q6o",
  "title": "Mohamed al Fayed : Timeline of Harrods sexual predator",
  "date": "20240923T133000Z",
  "domain": "bbc.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Mohamed Al Fayed: Timeline of sex abuse allegations\n- Published\nA BBC investigation has exposed decades of serious sexual abuse allegations against Mohamed Al Fayed, the former owner of luxury department store Harrods.\nThe billionaire businessman, who died last year aged 94, is accused of multiple counts of rape and attempted rape by several women who worked for him - many of whom felt unable to report what had happened until recently.\nAt the time of many of the alleged attacks, Fayed was the owner of Harrods, the Ritz Paris hotel and football club Fulham FC.\nHe was a well-known public figure who had links to senior figures in Parliament and courted royalty and celebrities alike.\nHere are some key dates spanning nearly 40 years where there were claims about his behaviour.\n1985 - Mohamed Al Fayed buys Harrods department store in Knightsbridge, London, and becomes chairman.\n1986 - “Alice”, who spoke in the 2024 BBC documentary, started working at Harrods when she was 16. She says she was sexually abused from 1987 and worked as a personal assistant to Fayed - a position she held until 1991.\n1988-1991 - “He was vile,” says another one of the women, \"Sophia\", who worked as his personal assistant during these years. She says he tried to rape her more than once.\n1990s - “Rachel” - a woman who worked as a personal assistant for Fayed in the 90s - says in the same BBC documentary that the billionaire raped her in his luxury apartment overlooking Hyde Park in west London.\n1994 - The “cash for questions” scandal erupts in Westminster. Fayed goes public and admits making payments to two Conservative MPs to ask questions in Parliament.\n1994-1995 “Steve”, who worked for the billionaire during this time, tells the BBC in the 2024 documentary that security staff “did know that certain things were happening to certain female employees at Harrods and Park Lane”.\n1995 - Vanity Fair publishes an article alleging racism, staff surveillance and sexual misconduct by Fayed against Harrods staff.\nFayed sues for libel, which sparks a two-year investigation from Vanity Fair editor Henry Porter. According to documents and statements compiled by Vanity Fair - that the BBC has seen - allegations of sexual harassment and assault were being made in relation to several women.\n1997 - Fayed buys then third-division Fulham FC for a reported £30m.\nIn May, Fayed begins moves to drop his legal action against Vanity Fair, via negotiations between publisher Conde Nast UK and a Harrods executive, Michael Cole - an ex-BBC journalist.\nPrincess Diana and his son Dodi Al Fayed die in a car crash in Paris that August.\nIn a piece for the Observer on Sunday, external, Mr Porter says Conde Nast’s owner, Si Newhouse, agreed to close down the case “out of respect for the grieving father”.\nEvidence on Fayed’s alleged activities collected by Vanity Fair is stored securely by Mr Porter, who has since allowed journalists - including the BBC documentary makers - access, he says in the Observer.\nIn December of that year, ITV’s The Big Story reported further serious allegations including sexual harassment and groping - which is classed as sexual assault.\nFayed issues angry statement saying claims were outrageous and untrue. He claims he did not contribute to the programme as he wasn’t able to hear allegations in advance.\nGet in touch\nHave you been affected by this story?\n1998 - Another former BBC journalist, biographer Tom Bower, publishes “Fayed: The Unauthorised Biography” with more women alleging sexual assault.\nFayed’s then official spokesperson, Michael Cole, calls it \"a travesty of the truth”, saying: \"We helped Tom, and then he betrayed all of that help”.\n2008 - One of the women in the BBC investigation, “Ellie”, not her real name, was 15 in 2008 when she reported an assault to the police - an allegation that made headlines but did not result in any charge.\n2009 - In the 2024 BBC documentary, Gemma, who worked as one of Fayed’s personal assistants between 2007-09, said his behaviour became more frightening during work trips abroad. She said that his attacks culminated in her rape at Villa Windsor in Paris's Bois de Boulogne.\n2010 - Mohamed Al Fayed sells Harrods for a reported £1.5bn to the Qatar Investment Authority. A Channel 4 Dispatches programme in which a number of women were going to make allegations was cancelled.\n2013 - July: Fayed sells Fulham FC to Shahid Khan, owner of NFL side Jacksonville Jaguars in a deal said to be in the region of £150-£200m.\nA woman in her twenties alleges Fayed raped her. Police investigate but no charges are brought against him.\n2015 - The Mirror publishes an article about the 2013 allegations, external. The Met Police confirms it looked again at the case after new information came to light, but again no charges are brought.\n2017 - A Channel 4 Dispatches is broadcast with three women alleging groping, assault, and sexual harassment. One woman waives her right to anonymity for the first time.\n2018 - Channel 4 News follows up the Dispatches film after more women, external come forward, external, including an employee who was 15 at the time. Fayed’s lawyers dismiss the claims relating to the child as “false”, and say he was unable to comment on the other allegations.\n2018-2023 - Police investigate claims by three other women during this period. The Crown Prosecution Service were called in to advise detectives but a full file of evidence was never passed on to prosecutors, as first reported by the Sunday Times in September 2024, external.\n2023 - In July, Harrods begins settling claims with women who came forward alleging sexual assault by Fayed.\nMohamed Al Fayed dies in London aged 94 in August 2023.\n2024 - The BBC Documentary “Al Fayed: Predator at Harrods” aired in September with a number of women alleging sexual abuse at the hands of Fayed.\nThe BBC heard testimony from more than 20 women with allegations ranging from sexual assault to rape. Five said they were raped.\nHarrods has already reached financial settlements with the majority of people who have approached them since 2023, and has had new inquiries this week.\nHarrods is accepting vicarious liability for the actions of Fayed, and there are no non-disclosure agreements attached to the settlements.\nHarrods’ current owners said earlier this week, external they were \"utterly appalled by the allegations of abuse perpetrated by Mohamed Al Fayed\".\n\"These were the actions of an individual who was intent on abusing his power wherever he operated and we condemn them in the strongest terms,\" they said in a response to the BBC investigation.\n\"We also acknowledge that during this time his victims were failed and for this we sincerely apologise. We are doing everything we can to fix this.”\nAt a press conference on 20 September, lawyer Gloria Allred said the \"ugly truth\" was that under Mr Al Fayed's chairmanship, Harrods was \"a toxic, unsafe and abusive environment\".\nShe added: \"The allegations against Mohamed Al Fayed include serial rape, attempted rape, sexual battery and sexual abuse of minors.\n“The allegations involve cover-ups, threats and a quarter century of sexual abuse by Mohamed Al Fayed after he purchased Harrods and became its chairman.\"\nOn 24 September, ex-Harrods chief executive James McArthur told the BBC he witnessed \"abhorrent\" behaviour from Al Fayed, but not sexual abuse.\nHe was chief executive for 10 months in 2008, a time when the Metropolitan Police investigated an alleged assault on a 15-year-old girl in a Harrods boardroom.\nSeparately, on 26 September, the Met Police said they would be exploring whether anyone else should be pursued for criminal offences following abuse allegations.\nIt said it was \"carrying out full reviews of all existing allegations reported to us about Al Fayed to ensure there are no new lines of enquiry\" following allegations reported in the media.\nA BBC investigation into allegations of rape and attempted rape by Mohamed Al Fayed, the former owner of Harrods. Did the luxury store protect a billionaire predator?\nListen to World of Secrets, Season 4: Al Fayed, Predator at Harrods on BBC Sounds. If you’re outside the UK, you can listen wherever you get your podcasts, external, external.",
  "word_count": 1372,
  "scraped_at": "2026-02-14T14:13:26.258481"
}