{
  "article_id": "bed9f806d8ff",
  "url": "https://www.spokesman.com/stories/2024/dec/20/netflix-will-stream-2027-and-2031-fifa-womens-worl/",
  "title": "Netflix will stream 2027 and 2031 FIFA Women World Cup",
  "date": "20241220T234500Z",
  "domain": "spokesman.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Netflix will stream 2027 and 2031 FIFA Women’s World Cup\nLOS ANGELES — Netflix on Friday said it will stream for the first time the FIFA Women’s World Cup, as the streamer continues to expand its library of live sports content.\nNetflix has the exclusive U.S. rights to stream the 2027 and 2031 tournaments in all languages. The company said it has plans to have a dual telecast in English and Spanish with studio shows and top-tier talent. Netflix also plans to have documentary programming, featuring the top players.\nThe 2027 FIFA Women’s World Cup will take place in Brazil on June 24 to July 25, with 32 teams competing in 12 cities. Financial terms of the deal were not disclosed.\nNetflix Chief Content Officer Bela Bajaria cited the growing global popularity of women’s soccer.\n“Bringing this iconic tournament to Netflix is not just about streaming matches — it’s about celebrating the players, the culture, and the passion driving the global rise of women’s sports,” Bajaria said in a statement.\nShe noted that the company’s success with its recent livestreamed boxing match between Amanda Serrano and Katie Taylor has “demonstrated the massive appetite for women’s sports and live programming.”\nThe Serrano-Taylor fight had an average of 74 million live viewers tuning in, with Netflix calling it the most-watched professional women’s sports event in U.S. history. The match was part of a larger event that featured YouTube star turned professional boxer Jake Paul beating former heavyweight champion Mike Tyson last month. An average audience of 108 million live viewers turned in for that fight, though some viewers reported buffering issues. Netflix said it worked quickly to stabilize the viewing for a majority of its subscribers.\nNetflix began delving into streaming live events last year with a Chris Rock comedy special. Since then, it has hosted several live programs, including a hot dog eating competition, Tom Brady comedy roast, Screen Actors Guild Awards and a tennis exhibition match. Next week, Netflix will stream two NFL Christmas Day games for the first time.\nLive sports has been increasingly attractive to some streaming services because it draws large audiences and passionate fans. Organizers behind live sporting events have also been interested in working with streamers to reach global audiences and younger viewers.\nApple in 2022 entered into a 10-year deal with Major League Soccer for exclusive streaming rights to its games. The terms were not disclosed but is allegedly worth about $2.5 billion over the contract.\nFIFA President Gianni Infantino called the Netflix deal a “landmark moment for sports media rights,” adding, “Netflix will play a key role in terms of bringing the fascination of women’s football to a multimillion audience in the lead-up to both final tournaments, thereby enabling us to further increase their appeal.”\nLast year, FIFA Women’s World Cup in the U.S. was broadcast by Fox Sports, which has a deal to broadcast FIFA World Cup through 2026.",
  "word_count": 487,
  "scraped_at": "2026-02-14T12:34:17.568655"
}