{
  "article_id": "bee08fffd69f",
  "url": "https://www.bbc.com/sport/football/articles/c8xge8xd98zo",
  "title": "Chelsea : Blues  special  unbeaten WSL season provides  moments to remember  ",
  "date": "20250510T191500Z",
  "domain": "bbc.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "'Moments to remember' - Bompastor savours 'special' season\n- Published\n\"I'm only about titles but Sonia [Bompastor] said she's after the records - so now so am I,\" said Chelsea's Erin Cuthbert.\nThe Scotland midfielder, 26, is used to chasing trophies but when you have already won them, you need new targets.\nHer side delivered the goods on Saturday, grabbing a stoppage-time winner against Liverpool to ensure they ended the season unbeaten, creating \"history\" in the process.\nThey are the first Women's Super League (WSL) club to remain 'invincible' in a 22-game campaign and the champions broke their record points tally to do it.\nIt capped a brilliant debut season for French manager Bompastor and Chelsea can still achieve a domestic treble, having also lifted the Women's League Cup, and face Manchester United in the Women's FA Cup final on Sunday, 18 May.\nThe scene was set at Stamford Bridge to celebrate in front of their fans in the final game of the season and it was fitting that academy graduate Aggie Beever-Jones claimed the winner after 91 minutes in their 1-0 victory.\nIt led to joyous scenes afterwards as captain Millie Bright was drenched with champagne as she lifted the trophy, before her team-mates grabbed the stadium announcer's microphone and started singing, draped in gold confetti.\nSmoke from the fireworks behind the trophy stage drifted across the pitch as players danced in front of the stands - Bompastor watching on with her four children by her side.\n\"It was wonderful,\" she said, when asked how special it was to have her family alongside her. \"I had goosebumps just because sometimes behind the scenes [my children] cry because you are travelling and not home.\n\"It can be difficult, but they understand your job and it's even better when they can share these moments with you. They know what it means for us.\n\"I think they realised how lucky they are. When they are sometimes sad, I have these moments to remember why we are doing it as a family. It is the best thing you can give to your kids.\"\nHow does this season compare?\nWinning a sixth successive WSL title is one thing, but going unbeaten is another.\nIt is only the fourth time an English women's team has gone a full campaign without suffering defeat, excluding the curtailed Covid campaign in 2020.\nChelsea did it themselves in 2017-18 after 18 games, while rivals Manchester City (2016) and Arsenal (2012) had achieved the feat previously in 16 and 14-game seasons - but none in 22 matches until the Blues.\nBompastor's side also eclipsed Chelsea's own points record set in 2022-23 (58) with their success against Liverpool taking their tally to 60.\nIt is the best points-per-game ratio in a single WSL campaign (2.73) as well - a record previously held by Arsenal in 2018-19 (2.70).\nThe records, like the trophies, continue to roll in.\n\"To be able to achieve that, for me, is more than the title,\" said Bompastor, as she reflected on the magnitude of their unbeaten campaign.\nShe revealed it was not something she had thought about until Chelsea had the WSL title wrapped up with victory over Manchester United, with two games to spare.\nBut defender Lucy Bronze had her eyes on the record for months, stating their goal to be 'invincible' back in January following a 1-0 win over Arsenal.\nThey did not shy away from their ambitions in the end with the word \"unrivalled\" printed on the front of Saturday's match programme, surrounded by flowers bearing the dates of their eight league titles.\nHaving come out on top against their rivals yet again, are they the greatest WSL team in history?\n\"It's difficult to say that. For the club to be able to win six titles in a row means we have been consistent and every year we have managed to win trophies,\" added Bompastor.\n\"Maybe the fact this year we were unbeaten makes it even more special because it never happened before.\n\"When you reflect on that, from now, we will be part of history. We had this unbeaten season and we broke records in terms of points so it will stay in history.\"\nWhere it could have been lost\n\"Consistency\" was the word repeatedly used by Bompastor to sum up Chelsea's campaign but it has not been easy.\nWith the former Lyon boss stepping into the big shoes left by Emma Hayes, the squad went through what they described as a \"transitional season\", bedding in new players and adapting to the new manager's style and coaching methods.\nHayes herself was one of the first to congratulate Chelsea, posting on Instagram that their achievements were \"so, so deserved\".\nThe results were immaculate but not the performances - they won by one-goal margins on 10 occasions and trailed four times during the season.\nOf their 56 goals, 17 came in the last 15 minutes of matches (30.4% of their total), and eight were scored in stoppage time.\nBetween 26 January and 2 March, they dropped two points and won four successive matches by a one-goal margin in a period where they had to grind out results.\n\"It is sometimes difficult to describe my feelings and emotions. We had the right mentality from the beginning of the season until the end,\" said Bompastor.\n\"We have been consistent even when sometimes performances were not the best - we always found a way to win and get the three points.\n\"I think maybe the game we had against Arsenal [in January] was probably when we started to realise we were in a really good position to win the league.\n\"The second part of the season was more difficult because we were not as dominant as we would have liked to have been.\n\"For me, it is a great achievement because we were able to be consistent, unbeaten, and in this league it means a lot because it is really competitive.\"\nAll-in-all, Chelsea's title was never in doubt as they finished 12 points clear with 19 wins and three draws.\nThey won six of their six matches against the other top-four sides - Arsenal, Manchester United and Manchester City.\nThe only times they dropped points were in three draws against Leicester (1-1), Brighton (2-2) and West Ham (2-2).\nThey remain, as they have done for the past five years, the best team in England.",
  "word_count": 1066,
  "scraped_at": "2026-02-14T12:23:18.582711"
}