{
  "article_id": "beec7ad3ba3b",
  "url": "https://www.90min.com/wsl-predictions-gameweek-16-2024-25",
  "title": "WSL predictions : Gameweek 16",
  "date": "20250314T054500Z",
  "domain": "90min.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "WSL predictions: Gameweek 16\n- The WSL returns this weekend with some huge fixtures in the title race\n- Liverpool host Man Utd at Anfield while Arsenal take on Everton\n- Chelsea & Man City are in Subway Women's League Cup final action instead\nIt's set to be another big weekend in the Women's Super League, even with just eight of the 12 teams in action.\nChelsea and Manchester City have already contested their gameweek 16 matches due to involvement in Saturday's League Cup final. Sonia Bompastor's side recorded a comfortable 3-1 win over Leicester City at Kingsmeadow last week, while City were held to a 1-1 draw against West Ham.\nWith Chelsea extending their lead at the top of the table to eight points, it is a crucial weekend for the likes of Manchester United and Arsenal as they look to keep the pace with the reigning champions.\nIt's also set to be a significant matchday in the context of the battle against relegation with Crystal Palace and Aston Villa set to face each other on Sunday.\n90min predicts all four of the weekend’s WSL games and who will come out on top…\nFriday 14 March\nEverton vs Arsenal\nThe 0-0 draw played out between these two sides in October indicates that Everton will be no easy test for Arsenal. The Toffees have also beaten Manchester City this season.\nThat being said, the Gunners look much stronger under Renee Slegers and have been in outstanding goalscoring form. It is for that reason it is difficult to see anything other than an Arsenal victory.\nPrediction: Everton 1-3 Arsenal\nLiverpool vs Man Utd\nLiverpool parted ways with manager Matt Beard at the end of last month and started their new era under interim boss Amber Whiteley with a narrow victory over Crystal Palace. However, United is a different test altogether and Marc Skinner's side are currently the closest challengers to leaders Chelsea, looking for an eighth consecutive league win.\nWhile Anfield is set to stage its third and final game of the season, United have lost just one WSL game all season. They are in good form and have been ironclad at the back, conceding only six time sin 15 WSL fixtures, meaning it will no doubt be a tough night for the Merseyside club.\nPrediction: Liverpool 0-3 Man Utd\nSunday 16 March\nCrystal Palace vs Aston Villa\nOne of the standout fixtures of the weekend is Aston Villa's trip to take on Crystal Palace. The west midlands club have won both of their meetings with the Eagles across all competitions this season, including a narrow 3-2 win in the reverse fixture at Villa Park in October.\nThat being said, last place Palace have recently parted ways with manager Laura Kaminski and will be desperate to close the four-point gap to Villa in the table. If they’re to have any hope of avoiding relegation, fixtures like this are an absolute must-win. But defeat for Palace could condemn them.\nPrediction: Crystal Palace 1-2 Aston Villa\nTottenham vs Brighton\nAfter Brighton & Hove Albion snatched a point off leaders Chelsea earlier this month, they will be full of confidence heading into this fixture. Although the gap to the top four has increased in recent weeks, the Seagulls are still arguably the best of the rest.\nHowever, seventh place Tottenham Hotspur are also in decent form and a mere two points behind this weekend's opponent. So Robert Vilahman's side will be determined to make a statement on Sunday. They also have the home advantage, which could work in their favour.",
  "word_count": 596,
  "scraped_at": "2026-02-14T12:23:07.897592"
}