{
  "article_id": "bf03db73de48",
  "url": "https://www.yahoo.com/entertainment/prince-william-scores-own-goal-221650571.html",
  "title": "Prince William Scores Own Goal Over Women World Cup No - Show",
  "date": "20230822T224500Z",
  "domain": "yahoo.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Why Was Prince William a No-Show for the Women’s World Cup Final?\nRoyalist is The Daily Beast’s newsletter for all things royal and Royal Family. Subscribe here to get it in your inbox every Sunday.\nBy now he is probably wishing he had got on a flight.\nPrince William’s failure to attend the final of the women’s World Cup in Australia last weekend, which the England side had reached in a historic first, continues to be a source of criticism for the royal several days later, on TV and online media.\n'We all know if it was the men's final Prince William, Rishi Sunak & the entire British establishment would be there... Sexism, pure and simple.'@AlbieAmankona says Prince William should be ashamed he's not in Australia to support the Lionesses in the Women's World Cup final. pic.twitter.com/Gwh9LWDXYg\n— GB News (@GBNEWS) August 19, 2023\nWilliam, as president of the Football Association (FA) and a fan of the British premier league club Aston Villa, frequently attends high-profile football matches. There has been widespread speculation that William would have attended the World Cup if a British team had made it to the final of the men’s tournament.\nOn Monday, Sir Geoff Hurst, a British footballing legend who was part of the 1966 World cup winning team was asked on Times Radio if he believed William had made a mistake by not showing up.\nHe said: “Yes I do. I think if the royals attend the men’s game, they should definitely.”\nHow William Won America—and Can Harry and Meghan Win It Back?\nHowever the Guardian columnist Zoe Williams defended William’s decision not to go, saying that speculating about what William might do if England’s men reached a World Cup final “that it took a while to unpick what a slippery hypothetical that was. Prince William wasn’t alive the last time that happened. People are extrapolating his behavior from an event that predated his birth and applying it to a similar event that may never happen, and deciding, nevertheless, that they are absolutely sure what he would do.”\nWilliams also admitted: “If he had flown to Australia, I would have kvetched about his carbon footprint.”\nNonetheless, hers is increasingly a lone voice as anger mounts at the perceived sexist snub to the British team, made all the worse by the fact that Queen Letizia of Spain had no qualms about hopping on a jet to cheer on her countrywomen.\nSorry, let me see if I understand this: England is in its first World Cup Final in nearly six decades, and neither King Charles nor Prince William nor any member of the British Royal Family nor Prime Minister Sunak are attending, and we're supposed to believe this isn't sexism?\n— Charlotte Clymer 🇺🇦 (@cmclymer) August 18, 2023\nMore typical of general opinion is the voice of Piers Morgan, who said on X, “With respect, YRH [Your Royal Highness], you should have got on a plane.”\nWith respect, YRH, you should have got on a plane. Ridiculous that the Queen of Spain is attending the World Cup Final to support her nation’s team, and you won’t be there despite being President of the FA. https://t.co/OyK4TxCVTk\n— Piers Morgan (@piersmorgan) August 19, 2023\nDespite the current high profile of the “lionesses” as the British women’s team have been dubbed—in reference to the crest of three lions that are the British FA’s most recognizable icon—and the fact that a record 17m people watched the final on Sunday in which the team lost 1-0 to Spain, women’s football is still not viewed as being as important as the men’s game. There is a perception that Prince William, of all people, should be doing all he can to help change that.\nFurther irritation was stirred up Tuesday when it was revealed that the team’s sponsor, Nike, will not be producing a replica shirt of the team’s goalkeeper, Mary Earps, despite the fact that she was named goalkeeper of the tournament.\nMore in Sports\nBarcelona fans tear into several players amid Atlético disaster\nThe debate looks set to continue with pressure mounting on the government to give an honor to each member of the team; all players from the winning team in the 1966 World Cup Final were given an honor called an MBE, which stands for Member of Order of the British Empire. Keir Starmer, the leader of the opposition Labor party, has already publicly called for a similar gesture this time around.\nWilliam and his family are understood to have watched the game at home in Norfolk, from where he and his daughter, Princess Charlotte, recorded a supportive video before the game, in which he said: “We’re sorry we can’t be there in person, but we are so proud of everything you have achieved and the millions you have inspired here and around the world.”\nSome feminist organizations accused the prince of sexism for using his daughter in this way in the video, questioning if only boys would have appeared to support a men's team.\nAfter the loss, William posted on X, saying: “Although it’s the result none of us wanted, @Lionesses you have done yourselves and this nation proud. Your spirit & drive have inspired so many people and paved the way for generations to come. Thank you for the footballing memories. Congratulations to Spain. W.”\nKensington Palace did not respond to a request for comment asking why William did not attend the match.\nGet the Daily Beast's biggest scoops and scandals delivered right to your inbox. Sign up now.\nStay informed and gain unlimited access to the Daily Beast's unmatched reporting. Subscribe now.",
  "word_count": 936,
  "scraped_at": "2026-02-14T13:04:15.224482"
}