{
  "article_id": "bf161a2a64f6",
  "url": "https://dailytrust.com/again-amokachi-resigns-as-lobi-stars-technical-adviser-amid-npfl-struggles/",
  "title": "Again , Amokachi resigns as Lobi Stars technical adviser amid NPFL struggles",
  "date": "20250219T051500Z",
  "domain": "dailytrust.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Former Super Eagles coach Daniel Amokachi has stepped down as Technical Adviser of Lobi Stars, leaving the team languishing at the bottom of the Nigeria Professional Football League (NPFL) table.\nAmokachi’s resignation follows a series of disappointing performances, with Lobi Stars managing just 22 points from 24 matches. Assistant Coach Tar Akombo will now take charge as the team prepares for a crucial NPFL clash against second-placed Shooting Stars in Ibadan tomorrow.\nDaily Trust reports that Amokachi’s departure comes as little surprise, given the club’s ongoing struggles and relegation fears. This marks the second time he has resigned from the club, having initially quit in December 2024 before making a brief return.\nLobi Stars have faced additional challenges beyond the pitch, including instability in securing a home ground. The team has been forced to play away from their traditional base at Aper Aku Stadium, Makurdi, for nearly three years due to prolonged renovations, shuffling between Lafia Stadium and Abubakar Tafawa Balewa Stadium in Bauchi.\n- NPA declares zero tolerance for congestion on port access roads\n- Saudi Arabia gifts Nigeria 100 tons of date\nUnfortunately, as the Benue State government and the contractor, Monimichelle Sport Facility Construction Company, continue to trade blames over the slow pace of renovation work on the stadium, Lobi Stars have remained homeless.\nSo, after poor results at the Lafia Stadium including the 0-1 loss to Rivers United in week 3, Lobi Stars relocated to ATB with the hope of halting their dwindling fortunes.\nHowever, the Coach Daniel Amokachi tutored boys were stunned 0-1 in their first match in Bauchi after they failed to respond to a first half goal by Ifeanyi Anthony Ihemekwele, leading to their eleventh defeat of the season.\nThe teeming fans of the ‘Pride of Benue’ have continued to blame the club’s battle with relegation on the absence of home support.\nSo far, Lobi Stars have not won any games in their last five. They recorded two draws, three loses in their last five games, leaving the team at the rock bottom of the table.\nFans have attributed the club’s poor form to the lack of home support. “We’re not surprised by Amokachi’s resignation,” said a Lobi Stars supporter. “The team is struggling, and we hope a new coach can turn things around and keep us in the league.”\nUPDATE NEWS:\nNigerians can now invest ₦2.5 million on premium domains and profit about ₦17-₦25 million. All earnings paid in US Dollars. Rather than wonder, click here to find out how it works.",
  "word_count": 420,
  "scraped_at": "2026-02-14T12:43:05.540124"
}