{
  "article_id": "bf239261cbc5",
  "url": "https://psychiatry.duke.edu/news/concussion-care-campus-community",
  "title": "Concussion Care : From Campus to the Community",
  "date": "20250919T144500Z",
  "domain": "psychiatry.duke.edu",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "When their child takes a hit to the head from a playground mishap, a bike accident, or a sports play gone awry, many parents fear the worst: How long will they be out of school? Do we need to keep them off screens? When can they get back to their sport? Will they recover fully?\nCaring for the estimated two million annual concussions in children and teens in the United States looks different than it did a generation ago. Neuropsychologist Pete Duquette, PhD, says that in most cases, medical providers now recommend just a day or two of rest followed by a gradual return to normal activities.\n“So much has changed with concussion treatment in the last 20 years. The new approach is to actively rehabilitate,” said Duquette, an instructor in psychiatry and behavioral sciences. “If they’re in a sport, we want to get them walking on a treadmill or riding a bike for a little, just what they can tolerate, because light to moderate activity seems to resolve their symptoms more quickly.”\nOverly strict restrictions, he added, sometimes also lead to frustration and social isolation, which can negatively affect a young person’s mental health, especially if they’re already struggling with anxiety or depression.\nCurrently, kids with concussions comprise only a small percentage of Duquette’s patient population, but he aspires to build a more robust concussion management practice in Duke’s pediatric neuropsychology clinic, where he serves as director.\nWhen Concussion Symptoms Linger\nMost concussions heal within a few weeks, but about 10% of patients experience lingering symptoms—headaches, dizziness, memory and concentration problems, anxiety, depression, and sleep disturbances, among others—for up to a year or more. Duquette has expertise in treating concussions at all stages, but these long-term sufferers are the ones he usually sees in his current practice.\nIn a typical initial visit, Duquette gathers information about the patient’s symptoms, what makes them feel better or worse, and current and past treatments. He also conducts neurocognitive assessments—think of them as “brain fitness” tests—to help measure their mood and how well someone can remember, focus, and process information.\nHe talks with the patient about concussion recovery trajectories, whether factors other than the concussion may be at play, and strategies to help with their most bothersome symptoms. Recommendations might include extra support at school, mental health counseling, sleep optimization, home exercise programs, headache journaling, or referrals to specialists such as a physical therapist or psychiatrist.\nDuquette then sees the patient for periodic follow-up appointments to re-assess symptoms and progress toward recovery and adjust the treatment plan as needed.\nDuquette’s concussion care practice at Duke is still new and growing—he just joined the Duke faculty this year—but he has a vision for expanding services to better meet patients’ needs.\n“Especially for longer-term recovery, there’s a gap in care, not just at Duke and in the Triangle, but nationwide,” he said. “Providers don’t always know what to do with these patients when they're still having difficulties or symptoms long after the head injury occurred.”\nTo help fill this gap, he hopes to create a complex concussion clinic with services ranging from same-day concussion referrals from primary care providers and pediatricians to comprehensive, multidisciplinary care for patients with long-term symptoms.\n“That’s my dream, that eventually we can have a couple afternoons a week where we can see kids who have had a concussion—new patients and follow-ups—and help them in their recovery,” said Duquette.\n“That’s my dream, that eventually we can have a couple afternoons a week where we can see kids who have had a concussion—new patients and follow-ups—and help them in their recovery.”\n— Pete Duquette, PhD\nBeyond Concussion Care\nWhen he isn’t seeing concussion patients, Duquette provides care for children, teens, and young adults with a chronic or acute medical condition that’s affecting their brain functioning, emotional well-being, or learning. He sees patients with epilepsy, cancer, sickle cell disease, more severe traumatic brain injuries, and genetic disorders.\nSimilar to his work with concussion patients, Duquette evaluates how the child’s condition is impacting their brain functioning and develops a profile of their strengths and weaknesses.\nBased on these assessments, Duquette collaborates with the child, their parents, and often teachers to create a treatment and support plan to address the child’s challenges and help them thrive. If the assessment results in a diagnosis, such as attention deficit-hyperactivity disorder (ADHD) or a learning disability, Duquette can connect the family with appropriate specialists at Duke or in the community.\nWhat Can Saliva Tell Us about a Concussion?\nIn addition to his clinical practice, Duquette is collaborating with researchers across the School of Nursing and School of Medicine to study genetics and biomarkers in saliva to help clinicians create more individualized treatment plans for concussions.\nConcussion care currently relies heavily on subjective measures—patient symptom reports and clinical judgment—along with cognitive testing and balance testing in some cases. “There aren’t any lab tests that definitively say whether you have a concussion,” said Duquette. “We hope our study can identify objective biomarkers that can help with that decision-making process.”\n“There aren’t any lab tests that definitively say whether you have a concussion. We hope our study can identify objective biomarkers that can help with that decision-making process.”\n— Pete Duquette, PhD\nLed by Karin Reuter-Rice, PhD, a professor of nursing and pediatrics, the five-year study aims to determine whether certain genetic traits can predict how people’s bodies handle inflammation. This information could inform the likely trajectory of recovery from a concussion, as well as what treatments or interventions would best meet the patient’s needs.\nConcussion Care in the Community\nIn his “spare time,” Duquette quips, he shares his neuropsychology expertise with the Carolina Hurricanes, a National Hockey League team, and the North Carolina Courage, a National Women’s Soccer League team.\nFor the Hurricanes, he conducts preseason baseline testing to establish the players’ healthy performance and symptom status, which provides a helpful comparison if a player sustains a concussion during the season. He also assesses players as part of the return-to-play process after they suffer a head injury. Duquette got connected with this opportunity in 2015 while working with researchers at the Matthew Gfeller Sport-Related Traumatic Brain Injury Research Center at the University of North Carolina at Chapel Hill, where he previously held a faculty position.\nIn 2023, he started working with the NC Courage, assessing players’ readiness to resume playing after a concussion and, occasionally, consulting on performance improvement strategies such as enhancing focus and reaction time.\nDuquette, who earned his doctorate in school psychology, also collaborates with North Carolina’s Department of Public Instruction to educate school psychologists about traumatic brain injury (TBI) and prepare them to work with students affected by TBI. He co-developed an online TBI curriculum and provides case-based supervision for school psychologists pursuing certification to conduct TBI-related assessments.\nParents, Listen Up!\nWith soccer and football seasons in full swing and cooler fall weather beckoning outdoor play of all kinds, Duquette has a few insights and pro tips to share with parents and caregivers:\n- Beware of claims about sports equipment. “There’s a growing number of products out there that purport to reduce the likelihood of concussion,” Duquette said. “In fact, research suggests that players who feel like they have particularly good equipment tend to be more aggressive in contact-oriented sports, which can increase the odds of someone getting a concussion.”\n- Let them sleep. Duquette understands parents’ urge to frequently check on their child after they’ve suffered a head injury, but he emphasizes that rest is critical after a concussion. “Assuming there wasn't a seizure or brain bleed, which is exceedingly rare, it’s best not to wake the child up just to make sure they’re okay,” he advises.\n- You can sustain a concussion without losing consciousness. Duquette notes that only about 10% of concussions result in loss of consciousness—so it’s important to consult a healthcare provider after any head injury.",
  "word_count": 1315,
  "scraped_at": "2026-02-14T12:20:03.787795"
}