{
  "article_id": "bf287ff0329e",
  "url": "https://www.leicestermercury.co.uk/news/leicester-news/reasons-leicestershire-police-officers-were-9827562",
  "title": "All the reasons Leicestershire Police officers were found guilty of misconduct in 2024",
  "date": "20250101T053000Z",
  "domain": "leicestermercury.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "All the reasons Leicestershire Police officers were guilty of misconduct in 2024\nFrom stolen loo roll and holiday lies to drug possession and stalking\nFrom stolen loo roll and holiday lies to drug possession and stalking, here are all the reasons Leicestershire Police officers have been found guilty of misconduct this year. Those who work for our police force face challenging situations on a daily basis.\nThey are the front line response in an emergency, see people at their worst and look after people in their most vulnerable moments. There is a contract of trust between them and the public they serve and protect.\nBut with that trust comes a huge level of responsibility – and it can be broken easily. Many misconduct outcomes come with warning that by not upholding the high standards of professional behaviour expected of them, officers can damage public confidence in policing as a whole.\nREAD MORE: Man attacked former MP Claudia Webbe’s offices during General Election campaign\nIn the most extreme cases, employees can be barred from serving for life. Some have even ended up in court for their behaviour. For more minor cases, final written warnings or demotions are considered more appropriate outcomes.\nHere are all reasons Leicestershire officers were found to have committed misconduct this year:\nStalking female colleague\nJohn Stuart Clough tracked a female colleague for almost a year, and used force systems to trace her location. His actions included going to incidents the woman was attending as she carried out her work as an officer, without him having any reason to be there.\nClough, of Leicestershire, also persistently messaged the woman, all while in his role with the force. The 51-year-old committed the offences between November 2022 and September 2023, the force said, and continued the behaviour despite initially apologising for his actions.\nHe appeared before Northampton Crown Court on Thursday, August 8, where he was handed a 22-month jail term, and issued with a five-year restraining order. A misconduct hearing was then held in September by Leicestershire Police, with Chief Constable Rob Nixon ruling Clough should be placed on the police barred list.\nRacist remarks to colleague\nA Leicestershire Police inspector was demoted after a misconduct hearing found she had been racist towards a junior colleague. The officer, who has not been named publicly by the force, had her rank reduced to that of sergeant.\nThe officer immediately resigned when the demotion decision was delivered, and now no longer works for Leicestershire Police, the force said. She was accused of making a comment towards Pc Francis-Wint which questioned his heritage as a member of the black community while he was “sharing a difficult professional experience”.\nPc Francis-Wint told a misconduct hearing the comment left him “feeling like he is a second-class and not valued by the force because of his heritage”. He also raised concerns over how this behaviour might impact the public, saying: “If police officers can be racist towards one of their colleagues, they can definitely be racist towards a member of the public.”\nStolen loo roll\nJulie Smith was accused of stealing multiple rolls over three dates in January and February last year. Ms Smith, who has since retired from the force, originally admitted taking one roll from a toilet at Beaumont Leys Police Station on Thursday, February 9, 2023, but claimed it had been to “clean a spillage in her car”.\nHowever, members of a misconduct panel convened to rule on her actions said they were not convinced by her story, branding her “not a credible witness”. Doubts were raised over the legitimacy of the “spillage\" because Ms Smith had “waited several hours before purporting to attend to it” and had “mentioned it to no one”, a hearing report stated.\nMs Smith had also “concealed the toilet roll on the way to her vehicle”, which the panel felt was “inconsistent” with her story. The officer's credibility was further “undermined” by a later admission that she had taken six toilet rolls “over the course of a year”, the panel judged.\nUltimately, the panel ruled Ms Smith’s actions to be misconduct. As she had retired from the force by the time of the hearing, no action could be taken against her, except to record the finding, Leicestershire Police said.\nCar crash lies\nPc Elliot Watson drove into a fellow officer’s car while parking at Leicestershire Police headquarters, in Enderby. He then drove away and parked in another area of the car park without leaving his details or reporting the incident.\nIn a bid to cover up his actions, the then officer later lied in an email to the force's professional standards department saying he was not “aware” of being involved in any incident and that there was “no damage” to his car, a misconduct hearing found.\nThe officials overseeing the hearing ruled that Mr Watson “more likely than not” knew about the collision due to the force of the impact with the other car, and because of emails between Mr Watson and a repair company to fix damage to his own vehicle.\nThe panel went on to brand Mr Watson's attempt to “evade responsibility for a minor collision” as an “act utterly lacking in integrity”. He was dismissed without notice.\nCannabis possession\nA former Leicestershire Police officer was barred from the profession after pleading guilty to cannabis possession. The drugs were discovered during a search of the officer’s home undertaken by Leicestershire Police in February 2023. The force said two parcels of cannabis were found in the man's shed.\nOne was in a Leicestershire Police evidence bag and the other wrapped in a mask and a glove, records of a misconduct hearing state. The former officer, who has not been named by the force, admitted the crime at a hearing at Lincoln Crown Court in June this year.\nHe was handed a conditional discharge for a period of six months, meaning if he commits another crime in that time he can be re-sentenced for this offence. He was also told to pay a victim surcharge of £26.\nIndecent child images\nA Leicestershire Police constable arrested over alleged indecent child images offences would have been dismissed if he had not already resigned, a force misconduct hearing has ruled. The officer, who has not been named by the force for legal reasons, was a ‘Special’, meaning he volunteered with Leicestershire Police but had the same powers as his paid colleagues.\nHe was taken into custody last October on suspicion of “being in possession of indecent images of children”, Leicestershire Police said. Leicestershire Police ruled he breached the standards of professional behaviour and was engaged in discreditable conduct. For legal reasons, the force did not issued any details of the hearing.\nTargeting young, female colleagues\nNow former Pc Darren Taylor targeted young female colleagues with sexualised behaviour. His actions were “predatory”, “sexually motivated” and “focused”, the panel overseeing the hearing concluded.\nAccusations ranged from inappropriate touching to asking them out on dates and commenting on their appearances. Some 22 incidents were considered by the panel, spanning a 19-month period between October 2021 and May 2023.\nNine unnamed women gave evidence against Mr Taylor. They were aged between 22 and 27 at the time the incidents occurred. Mr Taylor was aged 32 to 34 during the same period.\nMr Taylor resigned from the force prior to the hearing. Had he still been a serving officer, he would have been dismissed without notice.\nLies to jet off abroad\nThree Leicestershire police officers were found to have lied about being ill when they were actually travelling abroad. Then police constable Andrew Gray took a trip to Barcelona in connection with his car sales business.\nHe had tried to book leave for the trip, between Saturday, April 29, and Wednesday, May 3, last year. However, that leave was not granted for the final two days of the trip as there was a ban on time off leading up to the King’s Coronation on Saturday, May 6.\nRaja Khan called in sick in October last year before hopping on a plane to Turkey. Suspicions were raised over the legitimacy of his illness because he had called in sick two days before his next shift. Mr Khan also asked a member of the public to go onto his work laptop and fill in a sickness form his line manager had asked him to complete.\nAn unnamed student officer lied about being in hospital when she had in fact gone on holiday to Tunisia. The officer had claimed to have suffered an injury after playing football. She sent messages to fellow student officers via WhatsApp falsely claiming she was still at hospital.\nMr Khan and the student officer were both placed on the police barred list. Mr Gray was dismissed without notice.\nSexualised posts about colleague\nIan Weston made a series of Facebook posts over a seven-week period in March and April last year about a colleague working under his command. They were sexual in nature, and the panel overseeing the hearing branded them “demeaning”, “derogatory” and “really insulting to women”.\nThe hearing accepted that Mr Weston did not intend them to be understood in that way, that he had written them to be “humorous” and to “make people laugh” and that he used humour as a coping mechanism. The panel also said Mr Weston did not realise his female colleague, named only as Pc A in the hearing report, was upset, and “had no intention to hurt her in any way”.\nThe panel labelled Mr Weston's actions “naïve, foolish and wholly misguided”. He was dismissed without notice and barred from the profession.\nUnlawful restraint of children\nPc Sarah Yendall was handed a final written warning after “unlawfully” restraining a boy following an alleged attack. She also chased a girl across the playground where the altercation happened, a misconduct hearing heard.\nThe officer was off-duty at the time of the incident on Friday, October 27, 2023, and had “rushed” to Halstead Road Playing Fields, in Mountsorrel, after receiving a phone call from her daughter who was upset, the hearing report said. Her daughter had claimed a friend had been “attacked” by a group of children.\nTwo of the children, named as just Persons A and B, claimed Pc Yendall had seized Person B – aged 10 at the time – by the back of his neck and, in doing so, hurt him. A panel found Pc Yendall had more likely grabbed him by the shirt or shoulder. However, the panel still ruled this to be “unlawful” physical restraint.\nFree nightclub entry\nA former police officer twice used a warrant card to gain access to a nightclub. The unnamed ex-cop was suspended from Leicestershire Police at the time, so the warrant had been decommissioned.\nHowever, in October last year, he used a different warrant card to get into a club in Hinckley, the force said. Because he presented himself as a police officer, he was able to get in for free. On a second occasion, in November, the use of the warrant allowed him access after initially having been refused entry due to the time of night.\nRob Nixon ruled the man’s behaviour an “unwarranted and deliberate exploitation of the office of constable” and “fundamentally dishonest”. Had the officer still been serving with the force, he would have been dismissed without notice. He has now been placed on a barred list.\nAffair with vulnerable colleague\nA Leicestershire police constable had an “inappropriate” affair with a “vulnerable” colleague , a misconduct hearing found. The constable, who has since resigned from the force and was named only as Person X in the hearing report, was the woman’s superior at the time of the relationship.\nThe female, named just as Person A, was going through marital troubles at the time of the affair, the report added. While the relationship was consensual, the misconduct panel said Person X had known Person A was in a controlling marriage, had seen her distressed at work and knew work was an “escape” for her. As such, he should have known she was “vulnerable” when he “began a sexual relationship with her”.\nFurther accusations were made against Person X around him liking “sexualised” images on X, formerly known as Twitter, and sending “abusive” and “offensive” messages about other colleagues. The panel described some of the posts liked by the former officer as “particularly sexual and distasteful”, with many objectifying women. Had he not already resigned, the outcome would have been immediate dismissal.\nDrunken night out\nBeth Hoey threatened and swore at colleagues when they refused to leave their posts and drive her home after a night of drinking in October 2023. She contacted two on-duty colleagues and then sent threats and abusive messages when they did not do as she asked, including threatening to drive herself home after one refused to pick her up.\nThis was also not the first time Ms Hoey had behaved inappropriately towards colleagues on a night out. She was issued a final written warning in March last year following a similar incident in May 2022. She was placed on the barred list following the second incident.\nCrypto lies\nDuring the recruitment process, Osama Hussain repeatedly lied about and failed to disclose that he had investments in crypto currency. When he did mention the investments to the force’s vetting team during a later interview, he downplayed them saying he was “inexperienced” and was only investing £150 at a time.\nIt later came to light he was spending thousands on Crypto and had thousands coming back in. The force carries out financial vetting on new employees to assesses “the risk of vulnerability to financial inducement”.\nHe repeatedly failed to update the police on his financial position on a number of later occasions. Had he not already resigned, Mr Hussain would have been dismissed from the force.\nSkiving\nA Leicestershire Police officer who manipulated his laptop so he could skive when he was supposed to be on duty was barred from the profession. The man, who has not been named publicly by the force for “welfare reasons”, altered the machine so the screen was always active, making it look like he was working when he was not.\nA misconduct hearing into his behaviour heard that the then officer implemented his scam on 18 days in December 2023 and 12 days from Monday, January 1, to Friday, January 19, while working from home. On one of those days, the 'up' button on his laptop was pressed down for a period of seven hours and 39 minutes – the longest stretch he pulled the ruse for.\nConfidential information\nTwo Leicestershire police officer shared confidential information with members of the public, while a further three access sensitive files without a policing purpose. Pc Rachael Hughes was found to have sent multiple messages containing protected details to members of the public over several months in 2021, including a child’s autism diagnosis, social services involvement with a local family and previous police involvement with residents.\nMeanwhile, Kayleigh-Mae Knight sent pictures on her phone of documents which contained the name and health details of a person involved in a police incident to two acquaintances. She admitted to sending those images via WhatsApp with a text which said, “Joys of paperwork”.\nPc David Tweddle read 286 different force logs on 364 occasions over 14 days between Friday, June 2, 2023, and Tuesday, July 4, 2023, many of which did not related to the Melton area where he was based. Some of the searches were “extensive”, the hearing panel heard.\nPC Hiron Miah was also found to have “intentionally” and “deliberately” accessed confidential information on the force’s records. He claimed “poor training” had led to the multiple searches which took place between October and November 2022 and largely related to the Loughborough area where he was restricted from working at the time.\nPc Oliver Platts viewed 221 different reports on police systems over 10 separate days in June 2023. A misconduct hearing ruled he had done so “without policing purpose or lawful authority” and most off the breaches had occurred while he was off-duty.\nPcs Platts, Miah and Tweddle all received final written warnings. Ms Knight was barred from the profession and Ms Hughes was dismissed without notice.",
  "word_count": 2716,
  "scraped_at": "2026-02-14T12:53:24.525342"
}