{
  "article_id": "bf43ef5709dc",
  "url": "https://www.the42.ie/aine-ogorman-feature-6014788-Mar2023/",
  "title": "Motherhood , World Cup dream , full - time job and more : OGorman thriving in the chaos",
  "date": "20230311T101500Z",
  "domain": "the42.ie",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "MOTHERHOOD, INTERNATIONAL FOOTBALL, club commitments, a full-time job and much, much more in this World Cup year. How does Áine O’Gorman do it all?\n“Just thriving in the chaos I’d say,” the Irish centurion and Shamrock Rovers star laughs when she’s asked at Sky’s International Women’s Day Panel Event earlier this week.\n“No, look, I love it. I have really good support with my family and my partner at home. In preparation for games, I get off the night feed!\n“I love that little moment as well when you get home to James, if things haven’t gone so well and it just takes your mind off it. You really realise what life is all about. I’m really excited they’re all going to be out in Australia, so hopefully I’ll be playing and doing them all proud too.”\nThriving in the chaos perfectly sums up her life at the moment. And there’s more, as she tells reporters after the panel discussion.\n“I just bought a house. I’m moving out of where I was renting, trying to do that up at the same time as well, but look, my partner’s great. She takes a lot of the burden off of me. Everyone keeps reminding me that I have to focus on the World Cup and that’s the priority, that comes first this year. Look, everything happens together, doesn’t it? It’s great though, it’s all positive.”\n— Stephen McCarthy (@sportsfilesteve) September 2, 2022\nBefore an off-season switch to Rovers from Peamount United, O’Gorman had a change of job last year: the 33-year-old has undertaken a resource role at Youthreach, Sallynoggin, after years of working as a personal trainer.\n“I teach a food and nutrition module and a football module,” she explains. “I love the job, they’re very supportive of me and my football career, coming up to the World Cup. It’s different. But obviously the hours are nice, it’s not as crazy up in the mornings and working in the evenings. I love that structure as well.”\nThrow in some TV punditry and coaching badges and it’s a whirlwind off-field life.\nThe Wicklow native’s Ireland career has been nothing short of a rollercoaster, too. She made her senior debut at the age of 16 in March 2006, and 100 caps later, announced her international retirement in September 2019.\nIn February 2020, she reversed the decision, and with 15 more caps to her name now, she has helped Ireland reach their first-ever major tournament. “This could be the last time you put on a green shirt or you could be going to the World Cup,” O’Gorman told herself before the historic play-off win over Scotland as she was parachuted into the starting team.\n“It’s something you dream of as a kid first off when you are playing for Ireland, to play in a major tournament,” she smiles. “When you progress through your career, you think the first step is going to be an European Championship because it is that little bit easier to qualify for than the World Cup.\nBut since I came back into the squad, there is that belief that we can go on and do something special, we have the players, look at Denise O’Sullivan and Katie McCabe, a lot of players playing full-time professional football. We touched on our failings in the previous qualifying campaign and we learnt a lot from the pressure situation in the Ukraine game and I think that stood to us in this campaign, in the latter stages of the campaign to get to the play-offs.”\nIt’s all in the past now, the full focus on Australia this summer. O’Gorman has family in Australia and more en route for Ireland’s World Cup bow, all the makings for a potential magical swansong.\n“I have a couple of cousins out there — they’re travelling, I don’t know where they’ll be at then but I’m sure they’ll rock up to the games. All my family are booked to fly out so hopefully I’ll be on the plane too!\n“My brother’s getting married in June and he’s going out on his honeymoon with the two kids, they’re super excited. My partner and James are going out, my Mam and Dad, so everyone’s looking forward to it.”\nThe main goal now is making sure she’s there as a player in camp. Competition is through the roof, and O’Gorman and Abbie Larkin were the sole home-based players in Vera Pauw’s most recent squad.\nThe Rovers captain will be hoping her experience and versatility can work in her favour, but needs no reminding of the pressure to perform. The Hoops’ set-up, she feels, is giving her the best chance to put her best foot forward.\n“Look, you had a lot of players who decided to make that move to play full-time football, which is obviously an opportunity they can’t turn down until we have those structures here in Ireland. But we’ve had home-based sessions every week and we’ve been training with the boys, that can help bridge that gap. We’re training four nights a week with a game at the weekend. I think we’re still in a high performance environment.\n“They are the most successful club in the country in the men’s game and we are trying to simulate that on the women’s side of the game and the facilities there are really good, the structures, everything they promised us would be there is there. Collie [O'Neill] and Ciarán [Ryan] have a lot of experience as coaches as well, it has all been very positive so far.”\nO’Gorman bagged a last-minute winner in last weekend’s opening win away to Sligo Rovers, and anticipation is building for their Tallaght Stadium clash with Treaty United this afternoon [KO 5.30pm].\n“Once you go into the league games, it becomes a results business, doesn’t it? Thankfully, the ball just hit off my head and went into the net in the end,” she concludes.\n“Look, it is going to take time and we are not expecting anything to happen overnight but it is really exciting. There’s a buzz around it, and it’s spicing things up.”\nThriving in the chaos. A huge 2023 for Áine O’Gorman continues.",
  "word_count": 1028,
  "scraped_at": "2026-02-14T12:38:49.105458"
}