{
  "article_id": "bf4b2190d6d0",
  "url": "http://thepeninsulaqatar.com/article/28/05/2025/things-to-do-this-weekend-in-qatar-may-29-31-2025",
  "title": "Things to do this weekend in Qatar ( May 29 – 31 , 2025 ) ",
  "date": "20250528T181500Z",
  "domain": "thepeninsulaqatar.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "CHAIRMAN: DR. KHALID BIN THANI AL THANI\nEDITOR-IN-CHIEF: PROF. KHALID MUBARAK AL-SHAFI\nDoha, Qatar: This weekend is the perfect opportunity to start preparing yourself for the upcoming Eid Al Adha, enjoy several musical offerings, watch a highly-anticipated football final, and more.\nTajheezat Eid Al Adha Trade Fair\nUntil June 5, 2025\nWeekdays: 10am – 10pm; Fridays: 3pm – 10pm\nKatara Cultural Village, South Side\nUnique items ranging from jewellery to garments, incense, and much more are all available here. Take a trip to Katara and help make your preparations for Eid Al Adha.\nRegency Outlet Exhibition\nUntil June 2, 2025\nWeekdays: 10am – 10pm; Fridays: 1pm – 10pm\nRegency Halls, D Ring Road\nRegency Halls Outlet Exhibition promises the “biggest sales event of the season” with brands like Max, Baby Shop, Home Box, Lifestyle and more offering big discounts.\nUCL Final Live Screening\nMay 31, 2025\n10pm\nVarious venues\nNovo cinemas across Qatar will host exclusive live screenings of the UEFA Champions League final match between Paris Saint-Germain and Inter Milan. Screenings will be held at 01 Mall, Doha Oasis, Centro, Mall of Qatar, Msheireb Galleria, Place Vendome, Souq Waqif, Tawar Mall, and The Pearl. Tickets here.\nA Seat at the Table: Food & Feasting in the Islamic World\nUntil November 8, 2025\nWeekdays: 9am – 7pm; Thursday: 9am–9pm; Friday: 1:30pm–7pm\nMuseum of Islamic Art (MIA)\nA Seat at the Table: Food & Feasting in the Islamic World\" at the Museum of Islamic Art (MIA). It is exploring the cultural role of food across the Islamic world and within Muslim traditions. Tickets here.\nDoha Women Forum’s ‘The Art of Reinvention’\nMay 31, 2025\n4pm\nAl Aziziyah Boutique Hotel\nA workshop and roundtable featuring remarkable women discussing strategies to revitalise, reinvent, and realign your leadership path with meaningful purpose. The workshop features trailblazing women such as executive & leadership coach Asmaa Al Kuwari, content creator Yezzi Navarro, and radio broadcaster Marwa Al Saleh, and podcast host Alexandria Wood-Ward as moderator. Register here.\nCandlelight concert with Vivaldi and more\nMay 30, 2025\nTwo time-slots; 5:30pm and 7:30pm\nMuseum of Islamic Art Auditorium\nEnjoy a magical performance of Vivaldi’s undoubted magnum opus, the Four Seasons violin concerti, under warm candlelight glow. Tickets here.\nAl Shaqab Show Jumping League Final\nMay 29 – May 31, 2025\n3pm – 5pm\nAl Shaqab Longines Indoor Arena\nSpectators arriving for the Al Shaqab Show Jumping League Final can expect, in addition to the charged sporting atmosphere,a range of family-friendly activities and exclusive hospitality experiences featuring a delectable assortment of food and beverage options. Entry is free. Ticket booking here.\nQatar Outlet Exhibition\nMay 28 – June 1, 2025\nWeekdays: 10am – 10pm; Fridays: 3pm – 10pm\nHall 5, Doha Exhibition and Convention Center (DECC)\nQatar’s biggest outlet exhibition is back, with unbeatable collections across fashion, watches, tech, home, perfumes, travel gear and more.\nChopin’s Piano Concerto No. 2\nMay 31, 2025\n7:30pm\nKatara Opera House\nThe Qatar Philharmonic Orchestra (QPO) promises an evening of captivating music led by conductor Renchang Fu and featuring Eric Lu, winner of the prestigious Leeds International Piano Competition. The concert will begin with Chopin’s Piano Concerto No. 2, followed by the melodies of Dvořák’s Symphony No. 9 “From the New World.” Tickets here.",
  "word_count": 541,
  "scraped_at": "2026-02-14T12:50:13.452988"
}