{
  "article_id": "bf6a540be611",
  "url": "https://www.infonews.co.nz/news.cfm?id=126866",
  "title": "Save Women Sport Australasia : Exposing the Impact of Transgender Policies in Sports",
  "date": "20250309T154500Z",
  "domain": "infonews.co.nz",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Save Women's Sport Australasia: Exposing the Impact of Transgender Policies in Sports\nMonday 10 March 2025, 2:07AM\nBy Save Women's Sports Australasia\n8,356 views\nSave Women’s Sport Australasia proudly commends Sky News Australia for its powerful documentary ‘Fair Game | The Fight for Women’s Sport’, which aired on March 6, 2025. The documentary exposes the alarming consequences of policies that prioritise transgender inclusion over the safety and fairness of female athletes, spotlighting the struggles faced by women at all levels of sport.\nThe program highlights a range of issues, from injuries and unfair competition to silencing and legal repercussions for those who speak out. “This is just so unfair and unjust. Why did I get drug tested for 20 years to prove I had no advantage to then get to this point?” asked Olympic weightlifter and Save Women’s Sport Australasia spokesperson Deborah Acason. Deborah was forced to compete against transgender weightlifter Laurel Hubbard, who was 50kg heavier, ultimately abandoning her dream of setting a World Masters record after Hubbard raised the record by an unattainable 20kg.\nAt the amateur level, the documentary features Vanessa, a soccer player who faced a team with five male transgender players, noting the clear strength disparity: “It was quite obvious when those players would run and kick the ball that there was a different level of strength.” New Zealand Roller Derby player Monique Murphy also shared her experience of injury and exclusion for raising concern about biological males being allowed to compete in women’s games solely on the basis that they self-identified as trans or as gender-expansive. She was later suspended from one of her teams for doing do and is now preparing a complaint to the New Zealand Human Rights Commission against the club that sanctioned her.\nThe documentary also reveals a troubling lack of accountability from sporting leaders, with one football manager admitting he didn’t care how many males played in women’s teams as long as they paid their registration fee, despite reported injuries. Binary Spokeswoman Kirralie Smith, who has faced eight legal actions for calling male transgender players male, stated, “I don’t want to live in a country where you cannot speak the truth for fear of legal action.”\nExercise and Science Professor Helen Parker provided a scientific perspective, stating, “It would be so simple to state that girls and women’s sports is for those who are born female and then look at other solutions to include the broader gender-diverse individuals in our community. Biologically they are still healthy men and it should be up to male athletes to accept their gender diverse brothers into their sport.” Despite such expert warnings and public support for measures like Donald Trump’s recent executive order banning male transgender athletes from women’s sports, most Australian and New Zealand political and sporting leaders remain silent.\n“Sky News Australia has given a crucial platform to female athletes who have been silenced for too long,” said Ro Edge, New Zealand spokesperson for Save Women’s Sport Australasia. “We call on our sporting bodies in both Australia and New Zealand to implement sex-based eligibility criteria to ensure fairness, safety, and dignity for women in sport, and on our political leaders to ensure that publicly funded sports support this.”\nSave Women’s Sport Australasia encourages the public to watch Fair Game | The Fight for Women’s Sport on Sky News Australia and join the movement to protect women’s sports at www.savewomenssport.com.",
  "word_count": 568,
  "scraped_at": "2026-02-14T13:32:01.125820"
}