{
  "article_id": "c02ac9746e4c",
  "url": "https://news4sanantonio.com/news/local/as-their-neighbors-fled-these-texas-volunteer-firefighters-raced-toward-the-flames-smokehouse-creek-fire",
  "title": "As their neighbors fled , these Texas volunteer firefighters raced toward the flames",
  "date": "20240308T001500Z",
  "domain": "news4sanantonio.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "As their neighbors fled, these Texas volunteer firefighters raced toward the flames\nFRITCH — Gena Wells was on duty at the Stinnett Volunteer Fire Department when she got a call about a fire nearby.\nOne of the first to the scene, Wells saw the Smokehouse Creek fire before it would become the largest fire in state history — before it would claim homes, decimate livestock, and leave much of the Panhandle covered in ash and scorched earth.\nWithout knowing the destruction that would follow, Wells felt something she hadn’t during her nearly 20-year career. Fear.\n“We couldn’t put enough water on it to put it out. We tried to cut it off at the highway, and it just jumped,” Wells said “It was so fast.”\nThe Smokehouse Creek fire, along with a spate of others, engulfed the region and forced officials to issue evacuation orders last week, burning more than 1.2 million acres in their collective wake. As residents scrambled to flee, it was largely volunteer firefighters who stayed behind and faced the roaring flames head on.\nThe Panhandle fires are a stark reminder of how millions living in rural Texas rely on their neighbors to keep vital services running. With shoestring budgets and hand-me-down equipment, towns in the far-flung stretches of the state often depend on volunteers in emergencies.\nIn the case of the Panhandle fires, the 911 calls went to the volunteer fire departments, who fought to hold the line while everyone else could escape.\nWells first started volunteering for Stinnett in March 2006, after the East Amarillo Complex fire, which burned more than 907,000 acres, held the record as Texas’ largest until last week.\nWells’ motives were not entirely altruistic: She wanted to spend more time with her boyfriend Allen, who is now the town’s fire chief and Wells’ husband. Eventually, she loved it so much that she took on more calls.\nSome were more dangerous than others — she had a house collapse on her once. The incident left her preferring grass fires over structure fires. And there have been plenty in Stinnett, a small town nearly 60 miles northeast of Amarillo. The town of about 1,200 people is surrounded by grassy pastures, ranch land and open skies.\nWells and a few other women proudly cover the day shift. With teens and young children in tow, they manage the phone lines and fire trucks. When there’s a call, one of the moms stays with the kids.\nThe crew was on high alert the day the fire started. Small fires had already popped up in town this year. The wind was telling. They had babysitters ready to go in case this was the big one. And it was.\n“We were preparing for the event,” Wells said. “When it started, you could see the plume instantly.”\nFor hours, the 18-person crew fought the flames along with other local agencies.\nAmong the historic destruction, Wells witnessed the best of humanity. Firefighters have been getting “mama’s home cooking” from friends three times a day since the fire started. Neighbors have helped clean up debris around town. And, one of her fellow firefighters chose to save their neighbor’s home instead of their own.\nThe department’s resources broke down before the crew’s spirit could. One truck’s engine blew, the brakes went bad on another, and one truck needs a new hose and water tank, which went out in the heat.\nThen the reinforcements came in. By the end of the week, Gov. Greg Abbott said 14 state agencies and 45 local agencies traveled to the Panhandle to help, with some firefighters coming as far away as Houston. Some joined the fight, while others repaired trucks or stood guard at spots that could reignite. The state ultimately transferred management of the disaster over to a national team. That team is trained to handle major crises, and they have ordered personnel and equipment from across the country – since then nearly 500 people and 86 engines have descended on the Panhandle.\nIn the wake of the fires and damage, local nonprofits and foundations have started awarding grants to the affected fire departments.\nScorched remnants of the Windy Deuce Fire between Fritch and Amarillo on March. 1, 2024. Credit: Justin Rex for The Texas Tribune\nThe Amarillo Area Foundation sent the Stinnett and Miami/Roberts Volunteer Fire Departments $10,000 each. The grants came from the Kathy Ryan Fund, named after a woman who lost her life in the 2006 fires.\nThe 100 Club of the Texas Panhandle, a nonprofit organization that provides financial aid for families of first responders, donated $60,000 between the Canadian, Lefors, White Deer and Skellytown departments. Suzanne Talley, executive director of the nonprofit, said they needed it — gas alone cost more than $5,000 for two stations last week.\nTalley has more requests from fire stations she’ll likely donate money to, but knows it’s not enough to make up for the quality of their equipment. Some departments responded to the fire in expired gear and old respirators. They don’t have infrared cameras or navigation systems like the larger city-funded departments do. They never know when their radios will work.\n“They’re volunteering their time and putting their lives on the line, and they don’t have what they need to be as safe as possible,” Talley said.\nTalley said some local firefighters share those concerns with her. None were as vocal as Zeb Smith, Fritch’s fire chief, who died Tuesday while fighting a house fire in town, unrelated to last week’s wildfires. According to officials, he entered the home searching for people.\nTalley said Smith was one of the biggest advocates for firefighter needs in the region. In 2022, he went to the organization for working radios, and succeeded. The station got a new console and two radios at a cost of $33,000.\n“Zeb has a servant’s heart like I’ve never met,” Talley said.\nAt an emotional news conference, Fritch Mayor Thomas Ray choked up, describing Smith like a son. Stinnett Fire Chief Allen Wells called him a colleague and a friend.\n“To know Zeb was to love him. He had a heart of gold and was the epitome of a true leader,” The Hutchinson County Office of Emergency Management said in a statement. “Though this structure fire was not directly connected to any of the active wildfires in the area, the way he chose to respond was no different.”\nOn social media, Smith’s colleagues at the Fritch Volunteer Fire Department shared they are not OK, and asked for people to be patient with them.\nMuch like Stinnett, it was volunteers who responded when the fire quickly reached Canadian, 81 miles east.\nThe small town is the one most affected by the Smokehouse Creek fire. It lies close to the northeast Texas-Oklahoma border and is home to 2,300 people, many of whom are small business owners, ranchers, and families who wanted the quiet life.\nVolunteer Fire Department Fire Chief Scott Brewster among some of the many items donated to the department in Canadian on March 5, 2024. Credit: Mark Rogers\nThe 26-person crew hurried to safely evacuate residents before Chief Scott Brewster noticed another plume of smoke to the south of town, where people were leaving the area.\nBrewster drove to a high point near “Aud,” the bright green dinosaur statue that sits outside of town. He could see the smoke coming from across the tracks. The fire was heading toward the full roads of traffic leaving town. Brewster had to act fast. He and Sheriff Brent Clapp shut down the evacuation orders by redirecting people to a parking lot belonging to the football field. There, people could at least be safe waiting in their cars.\n“We did not want them getting trapped in that canyon,” Brewester said.\nBrewster’s fire department is among the dozens of volunteer-run stations in the Panhandle, and consistently staffed. Still, he knows how hard it is to keep them staffed.\n“There are some areas that have a hard time getting volunteers,” Brewster said.\nWhen the local first responders on the ground need more help, county officials call on the state for support. According to Ken Daughtry, emergency management coordinator in Wheeler County, they call the Texas Division of Emergency Management for any large-scale disasters and the Texas A&M Forest Service, which specifically responds to wildfires. Daughtry said each county’s emergency management coordinator independently reaches out for support.\n“We work together because we know that if you don’t call enough help soon enough, you’re going to make the national news,” Daughtry said.\nBy Tuesday, Daughtry had made multiple calls to the state’s emergency management department for air support. He said he was told there weren’t any air tankers available within the state. Typically, air tankers drop fire retardant from above and help firefighters on the ground contain the wildfire. The aircrafts are owned by private companies who are on contracts with the U.S. Forest Service or the Department of Interior. A single-engine aircraft costs a daily rate of $3,000 to $4,000 according to Texas A&M Forest Service.\nA plane prepares drops retardant on the Roughneck fire on Sunday, March. 3, 2024, in Sanford. Credit: Justin Rex for The Texas Tribune\nAbbott said during a Friday press conference that if air support had been provided earlier, the fire may have been more contained. Wind speeds, in addition to the lack of availability, may have played a role in the delayed deployment. Six single-engine air tankers were used later in the week and were seen making air drops on Thursday. Abbott said he and state lawmakers would consider investing in different aircraft.\nBut what legislation can’t solve — at least for now — is the need for more volunteers to fill the ranks for these services. Many more people would have lost their lives, and more acres would have burned were it not for the first responders, state officials said.\n“If it wasn’t for volunteers, we wouldn’t have a station at all,” Wells said, echoing those state officials.\nShe understands it’s a hard job. But, Wells said, if they don’t show up, no one else will.\nPooja Salhotra contributed to this report.\nWe can’t wait to welcome you to downtown Austin Sept. 5-7 for the 2024 Texas Tribune Festival! Join us at Texas’ breakout politics and policy event as we dig into the 2024 elections, state and national politics, the state of democracy, and so much more. When tickets go on sale this spring, Tribune members will save big. Donate to join or renew today.\nThis article originally appeared in The Texas Tribune at https://www.texastribune.org/2024/03/07/texas-wildfire-volunteer-firefighters/.\nThe Texas Tribune is a member-supported, nonpartisan newsroom informing and engaging Texans on state politics and policy. Learn more at texastribune.org.",
  "word_count": 1784,
  "scraped_at": "2026-02-14T14:10:10.422224"
}