{
  "article_id": "c02baec45dd2",
  "url": "https://www.spin.com/2023/06/method-man-1998-feature/",
  "title": "Ghetto Superstar : Our 1998 Method Man Feature",
  "date": "20230627T233000Z",
  "domain": "spin.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "This article originally appeared in the December 1998 issue of SPIN.\nWhen Method Man hung out with Nas and DMX this fall, the three rap stars drank Hennessy, smoked blunts, and shot a whole bunch of cops. This was all in the service of making a music video for director Hype Williams’s feature-film debut, Belly—a movie in which all three star—but it hardly felt like work. The vibe on the video set was hip-hop Rat Pack—think Frank Sinatra, Dean Martin, and Peter Lawford mugging their way through Ocean’s Eleven, but with a much higher body count.\n“Oh, Hype, why you kill me like that?” Method Man asked the director at one point. The Wu-Tang Clan heartthrob had just learned that in the final cut of Belly, his character had been not only shot, but shot dead. As in killed. As in no sequel.\n“Yo, they took a consensus in the test screening and they had to do it. All the people were pissed at you living.”\n“But I smacked her in the face with a gun twice! And she kicks me in the nuts? Then kills me?”\n“Yo, I should’ve died,” said DMX, wearing a silver dogchain. “I should’ve got hit up right when I smoked that fuckin’ cop who set me up to kill the motherfuckin’ minister.”\n“I wanted you to die too,” a buddy piped in. “I was dying for you to die.”\n“Oh yeah, you had to die,” said another.\nA P.A. pokes his head into the trailer. “We’re ready for you, Meth.”\nMethod Man looks at his half-burned blunt and half-full cup of cognac. “Tell ’em, ‘he’s taking a shit. He’ll be out in a minute.'”\nOutside the trailer, the video looked to be shaping up much like the film: a stylized suite of running around, shooting guns, profiling, running around, and dropping dead—like the “Brock Landers” series in Boogie Nights, only with a ’90s-size budget. For his part in the video, Method Man spent much of the night driving through Los Angeles’ abandoned warehouse district in a black Mercedes-Benz, being chased by eight police black-and-whites. After the shoot wrapped, Williams sped off to film the next Faith Evans video, but Method Man and DMX stuck around. They borrowed one of the police cars and cruised L.A. Eventually they pulled someone over. They let him go with a warning.\nMethod Man is a Pisces, a personality type reputed to have changeable moods, sleepy eyes, and baggy clothes. Lately people call him “John-John,” for Johnny Blaze; his names also include Hot Nickels, Hot Nixon, Iron Lung, Ticalion Stallion, Panty Raider, Shakuan, and his birthname of Clifford Smith. He does not move like a Clifford.\nHere is Method Man in a Hollywood hotel lobby: Shortly after Veronica Webb glides by and Danny Glover ambles through, the Wu star comes striding past the concierge in an extreme-sports pimp-roll—throwing his long arms wildly, swinging his legs outward in a bizarre palsied flail. He has a big, baked smile on his bearded face, a red toothbrush sticking out of his mouth. “What’s up with the walk?” someone asks. “It’s the new shit,” he explains.\nMethod Man is a lightning rod of ghetto style. In an interview, he once made up the word “brolic”—as in “that shit’s brolic“—and the superlative appeared in hip-hop magazines within two months. His sultry, raspy, rope-a-dope flow is among the three or four most recognizable in rap music. A rangy six-four, he’ll rock a backward Yankees cap, a football receiver’s glove, and a doo-rag whose vivid hue less manly men would flee. “Man, that shit ain’t pink,” he’ll tell you. “That’s fuchsia.” He’s a ghetto superstar, and—because he’s Wu-Tang—among the most out-there you’ll ever meet.\n“Method Man is just an incredibly gifted performer,” Hype Williams says. “Like Madonna, or a Janet Jackson.” In a swarm of Wu albums—as many as 24 due in the next 18 months—the November release of Method Man’s Tical 2000: Judgment Day stands out, the long-overdue follow-up to 1994’s platinum solo debut, Tical, an album Method Man calls, with typical braggadocio, “the worst of the Wu-Tang solo joints.”\nRest assured there is no attempt to replicate past glories on Tical 2000: Judgment Day. There is no reprise of Tical‘s plainspoken, Grammy-winning “All I Need” duet with Mary J. Blige. The closest Method Man gets to a love testimonial on 2000 are lines such as “My fingers on the clit splashin’ / Pussy lips got you spazzin’,” which is not very close. Tical 2000 is state-of-the-art East Coast hardcore, with dirty beats and creepy sonics by the likes of Mobb Deep’s Havoc, Erick Sermon, and Wu visionary RZA. Method Man’s rhyming is as goofball-graceful as ever (“UFC fighting championship / G.I. Joe with the kung-fu grip”), and his preferred topics run to what he calls “weird, torrid, horrific, cut-they-head-off-and-throw-it-in-a-fuckin’-drum type shit.” He prides himself on songcraft, not just lyricism, and the scheduled single “Judgment Day,” which he coproduced, has classic pop moves—a quicker tempo than the usual head-nodder, Bomb Squad squeals, and a countdown chorus, going from 10 to 1: Illuminati pop.\nMethod Man often writes his rhymes right there in the studio, without editing. His rough’n’ready swagger is undeniably rock’n’roll. Wu-Tang were the sole rap act on 1997’s MTV Sports and Music Festival, and, while they lasted, on ’97’s Rage Against the Machine tour. Method Man’s fave rock bands include Rage, Soundgarden, and Metallica, although he says, “Overall, Radiohead keep it the realest.” He says Courtney Love turns him on, and that Marilyn Manson bit his style with regard to gross-out colored contacts. When choosing glasses for photo shoots, Method Man leaves the sleek, $500 Louis Vuitton teardrop joints to Will Smith. He prefers “Coke-bottle shit.”\nEven after two Wu-Tang albums, one platinum solo record, and countless guest spots, the Staten Island, New York, homebody is only slightly less enigmatic than he was on their debut, Enter the Wu-Tang: 36 Chambers. Somehow he hides in plain sight, cloaked by multiple monikers and ever-changing eyewear. Clansman U-God calls him “the Michael Jackson of the Wu-Tang Clan.” And in a typically wacked, Wu-Tang way, the epithet fits, for Method is a Man of contradictions.\nFor one, there’s the dog issue. Method Man is pals with Snoop Dogg. He has a duet with Redman called “Big Dogs.” His is a canine-centric subculture. Friends even call him “dog,” as in “What up, dog?” Method Man hates dogs. “Cats, dogs, birds, fish—all that shit,” he says. “I can’t handle them motherfuckers. I won’t even watch the Discovery Channel when they start showing the animal shit.”\nFor another, this member of a nine-MC crew is not too big on posses. He usually rolls solo. “You never really see too many Wu-Tang around him either,” says Ja, a new rapper on the Belly soundtrack. Method Man often shows up at events not only alone but also on foot—a dedicated Everyman, right down to the punk-rock-style crowd-surfing he does at shows. “Black crowds don’t catch you, though,” he says. “They just let your ass fall.”\nMethod Man’s stardom, says RZA, “is an innocent stardom, ’cause he don’t wanna be that star.” Though he has acted in 187, Copland, Belly, and several other films, don’t look for him at a Stanislavski class. His favorite scene in Belly—in which he plays a roving assassin—was one with TLC’s T-Boz, which he liked because he “had a nice little buzz going, got a little drunk, you know?” As for his video presence, Meth notes matter-of-factly: “I can dance my ass off.”\nWhile RZA confirms that Method Man draws more women than any other member of the Wu-Tang Clan, Meth tries not to examine his sex appeal. “I think girls appreciate the fact that he doesn’t play on [his looks],” says Angie Martinez, a DJ at New York City radio station Hot 97. “That’s always a turn-off, especially for a hip-hop artist.” He remains dedicated to Tamika, mother of his two children, subject of “All I Need,” the song that made him the roughneck dreamlover for homegirls across the nation. He’s known Tamika since she was 11 and he 15. Their kids are one-year-old Cheyenne, a daughter, and two-year-old Shakuan, a son—whose names Method Man has tattooed on his wrists. On the cell phone, he greets Shakuan thus: “Hey, dookie-butt. What up, punk?”\nGrowing up in Staten Island’s Park Hill Projects, Method Man was, as U-God remembers, “a New Edition—dancing nigga. He knew how to backflip, break-dance, pop. He was very flexible.” During the years he spent living with his dad in Hempstead, Long Island, Method Man was also a straight-A student, a lacrosse player, even a trombonist—”because I had long arms.” When he returned to Shaolin, he worked in the Statue of Liberty gift shop and snack bar for five years, without ever once going inside the statue.\nMethod Man lives ’90s rap’s typically schizophrenic existence, shuttling between ghetto throwdowns and Hollywood pitch meetings. On one particular day, when he exited L.A.’s chic Mondrian hotel, he walked past Macaulay Culkin, hopped into a limo, and headed down Sunset to Roscoe’s soul-food joint to pick up some chicken gizzards.\nHe travels alone but not light. Method Man’s limo carry-on items have included a Game Boy Pac-Man, a box of El Producto cigars, a bag of salt-and-vinegar potato chips (“Now if that ain’t ghetto”), a mini-bar bottle of Rémy Martin, a caramel apple, some barbecue, and a copious amount of the herb he has smoked daily since age 11. It’s the same herb from which he takes both his Wu name and his album titles. His preferred strain is called Hulk, a cross between Northern Lights and Haze, a winner of the prestigious pot award, the Cannabis Cup. On Tical 2000, Method Man raps he’s “in love with the blunt smoke / Even though it killin’ me / Thereby fillin’ me with thoughts of conspiracy / Whitewater scandals with Bill Clinton, Hillary.”\nA Five Percent Nation and Wu member, Method Man is, de facto, a conspiracy theorist. Yet his analysis of the Lewinsky affair is apt and succinct: “She probably threw the trout at him. He went for it. Whatever, whatever.” He feels Clinton’s pain. “All that attention,” he says, shaking his head. “I don’t even like attention when I’m shopping and a nigga want an autograph. So imagine what this nigga is going through. Every time they see nigga, they see him getting his joint rocked.”\nHe is humble, yet projects. Stylish, yet a man of the people. Talented, waggish, and constantly stoned. Were he in the Rat Pack, Method Man would clearly be Dino, the accidental pop star. As RZA sees it, Wu members such as Raekwon and Ghostface Killah appeal to the thugs (“’cause they straight off the street with that shit”), RZA to the intellectuals (“’cause of my vocabulary and shit”), and Method Man to everyone. “Meth is the warm level,” RZA says. “He make a thug nigga smile, he gets all the women, and the children are into him, too. They look at him as a superhero.”\nLike all superheroes, Method Man is the product of star-crossed fate. “If I’d gotten into mescaline, I mighta been Mescaline Man,” he says, philosophically. Had it been LSD, which he and RZA once dropped after performing at the Apollo Theater—”shit had me fucked up”—who knows, he might have been Acid Man. But, as it happens, it was method, and Clifford Smith became Method Man. The rest, as they say, is brolic.",
  "word_count": 1916,
  "scraped_at": "2026-02-14T12:29:08.800164"
}