{
  "article_id": "c077ed85b0ea",
  "url": "https://www.theirishworld.com/stepping-into-the-lionesses-den/",
  "title": "Stepping into the Lionesse Den - The Irish World",
  "date": "20260108T053000Z",
  "domain": "theirishworld.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "By David Hennessy\nDubliner Lisa Fallon has been appointed manager of London City Lionesses in the Women’s Super League 2.\nFallon has previously worked with Cork City, Northern Ireland and with Jim Gavin’s Dublin helping them on their way to winning All-Irelands.\nLisa told us that the time is right for her to take charge of a team for the first time and that all her work to date will stand to her for the challenge.\nLisa told The Irish World: “It’s a culmination of my experience over the years. I feel now I have built up a bank of experience that will allow to go and do a role like this and hopefully to do it justice. I think for everyone who becomes a manager, your first appointment is the transition but I feel the experience I have built up over the years makes now the time to do this.\n“It would be great to see some of the Irish community in the UK come out to support us when we’re in a position to have supporters back in the ground. I think it would be great to see some of the Irish in and around London and further afield, if they can come and support us when we’re on the road, but certainly it will be great to see and hear some of them in the stadium in Princes Park once we’re back up and running and it’s safe for supporters to be back in the ground.”\nFallon described the move as a “seminal moment” in a career which has gone from strength to strength after she previously became the first woman coach to work in men’s football in Ireland when she took on her role at Cork City.\nShe also says she was impressed by the ambition of the club that was only established last year.\n“I’m really pleased. I’ve been a long time in football and I think ultimately this was always my goal. I think all the years of work were geared towards getting to this point. It’s great now to finally be at this point and I’m really, really excited now about just getting back on the pitch once it’s safe to do so and getting down to the nitty gritty of the job.”\nSurely eager to get to work, is it frustrating for Lisa not to know when exactly she can start working with her squad? “No, I wouldn’t say so. I certainy am already working. There’s a lot to do. There’s a lot of planning to be done in terms of making sure we are ready when the season is safe to proceed and making sure we have the right environment for the players and staff to bring them back into the environment and to do so safely.\n“There is an awful lot of work going on behind the scenes at the moment and that will certainly continue. I wouldn’t say I’m frustrated. I’d say I’m really busy.\n“Once I get to work with the players on the pitch, that vision (of the team’s tactics and style) will become clearer. It’s very much about tailoring the construction of the team to the skill sets of the players you have.\n“I don’t think you go in and say, ‘We’re going to do it this way’ until you have seen the players and the skill sets and the strengths and the areas for development within the squad.\n“I’m going to bring in a couple of players as well. I certainly have my ideas and my principles about how I want us to play but whether that’s set in a defined system, it would be too early to determine exactly that until I get to work with the players on the pitch.\n“I think first and foremost for us, it’s to get the training environments bang on with the considerations that we have to make because going into the next season coaches and managers and every club will have to make adaptations. I think first and foremost the focus has to be on that to make sure that we create really good safe, professional environments for our players to train in. Once we have that established I think then you can start to hone in on the performance aspects and once you hone in on the performance aspects, you really then need your games to come thick and fast. Once the games are coming then that really dictates where you’re going to end up but for me the most important part at the moment is to focus on the preparation for getting us back and getting the environment right so that we can have the players able to perform at their maximum.”\nLisa was most recently part of the coaching staff at Chelsea and will now take on the top job at the second tier side who were fourth in the division before it was cancelled due to the Covid-19 pandemic.\n“I’ve already had a year under my belt with Chelsea Women and that was an incredible experience. I learned a lot in that environment and it was great to have that first experience in women’s professional football because up until that point all of my experience had been in professional men’s football.\n“I think that experience will stand me in great stead in this role. The growth of the game is phenomenal and I really hope that I can bring some of those experiences that I’ve been fortunate enough to have down through the years into the game and hopefully for the benefit of the players and the club.”\nThe women’s game has entered a new age of professionalism since the creation of the Women’s Super League in 2010.\nWould also Lisa agree that the women’s game has grown hugely in popularity in recent years “Absolutely, I think the women’s World Cup last year was almost a defining moment because it put women’s football clearly and consistently into the homes of people. They got to see the game and experience the game, understand how technical the game actually is and how physical it is becoming.\n“Once more and more teams become more professional and players are getting more and more into full-time environments, the game is just going to continue to grow and for me it’s a very exciting time in women’s football. It’s the fastest growing sport in the world and that’s not going to stop any time soon.\n“The women’s game is physiologically different to the men’s game because females are physiologically different to men but the women’s game is very technical, very tactical. The game is becoming faster, the time you have on the ball is becoming less. That’s down to the fact that women are having the time to train in full-time environments and I don’t think it’s fair to compare the two (men’s football and women’s football) because fundamentally they are slightly different. However, I think it’s about female athletes having the opportunity to operate and have a career that they love. They have the opportunity to be a professional footballer and earn a living from it and have the best facilities and best resources available to them to facilitate that.”\nHow will Lisa’s time with Cork City and Jim Gavin’s Dublin stand to her in this role? “They’ve been briliant because they’ve all been really high performing environments where results mattered. There was always that consistent pursuit of excellence every single day on the training pitch and operating at very high standards with very good people: Good players, good coaches, good managers. I think any environment that you’re in at that level, you always learn from and you take aspects from it with you on every next step. That’s the nature of a coach’s development, that you learn from every environment that you’re in and certainly those two environments were crucial to me and I learned an awful lot.”\nDid she always feel accepted in those male sporting environments despite being a female? “Absolutely, I was very normalised in those environments very quickly. I think for the players the most important thing is that you bring value to the set up. I think if you bring value, players don’t mind whether you’re male or female. They just don’t look at it. What they want to see is if you can you help them to perform or if you can bring details to the preparation that will help achieve the outcome.\n“Once you deliver that, my experience has certainly been nothing other than being completely normal in the environment and very equal. It’s not been an issue for me. I was genuinely completely normalised in those environments.”",
  "word_count": 1448,
  "scraped_at": "2026-02-14T12:44:36.453458"
}