{
  "article_id": "c0bd69680ebf",
  "url": "https://wellington.scoop.co.nz/?p=158664",
  "title": "Wellington . Scoop » Phoenix pre - season gamble paying off",
  "date": "20240305T093000Z",
  "domain": "wellington.scoop.co.nz",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Phoenix’s pre-season gamble paying off\nReport from RNZ\nThe Wellington Phoenix had a choice to make over the summer. Stick or twist. They gambled, believing in the talent they have developed in the capital. Not that general manager David Dome or director of football Shaun Gill had much choice, given their tight budget.\nYet splashing out on big Aussie names or bringing in more foreign talent would have been justifiable. The off-season saw the Phoenix lose Oli Sail, Clayton Lewis, Steven Ugarkovic, Lucas Mauragis, Callan Elliot and Josh Laws, as well as head coach Ufuk Talay. Replacing all of the above would have cost a fortune the ‘Nix simply don’t have.\nInstead, the likes of Alex Paulsen, Finn Surman, Ben Old, Lukas Kelly-Heald, Fin Conchie, Isaac Hughes and Oskar van Hattum have been asked to step up, along with new boss Giancarlo Italiano. The ‘Nix didn’t even fill their foreign player quota until Youstin Salas flew in from Costa Rica in January.\nMany predicted that this necessary gamble would fail. Most punters had the Phoenix pencilled in for the wooden spoon, but the opposite is true. A double from Old and van Hattum’s first A-League goal helped the injury-ravaged ‘Nix stay top and put a chokehold on the top two places, with a 3-2 win over Adelaide United this weekend.\nOld was the star. If you were to ask some unknowing bystanders which youngster on the field of play was jumping to Bayern Munich in a couple of months, 9/10 would say Old and not Adelaide wonderkid Nestory Irankunda.\nInjury problems have always hindered Old but he’s starting to look like the Nix’s most mercurial talent since Sarpreet Singh. He’s playing so well that people have even stopped talking about how he was a golf prodigy as a wee boy.\nAs if the weekend couldn’t get any better, a helping hand from a fellow Kiwi in the form of Marco Rojas’ brace saw Brisbane Roar overcome fourth-placed Melbourne Victory. It is looking increasingly unlikely that Wellington will be dropping out of that top two before the end of the regular season. A first semi-final since 2011-12 is now tantalisingly close.\n“You can’t win anything with kids,” are the infamous words once uttered by Liverpool legend turned pundit Alan Hansen in 1995. Manchester United proved him wrong by winning the Premier League title that season, led by the aforementioned ‘kids’ Paul Scholes, Gary Neville and David Beckham. And those three went on to achieve nothing, right?\nHansen’s doomed quote stuck with him until he hung up his punditry tie in 2014. If the Phoenix go on to win the A-League this season, their pre-season detractors should be continually hit with a similar stick.\nIn other football news:\nWhile the Phoenix men continue to climb, the women’s season continues to dive. A 5-3 loss to Melbourne Victory was their third on the spin. That’s two wins in 10 now for the Wahinix and the early season optimism has dried up.\nDid you know the first silverware of the New Zealand domestic season was awarded over the weekend? No? Fair enough as it had nearly zero coverage. Anyway, Wellington Olympic defeated Chatham Cup winners Christchurch United 3-0 in the NZF Charity Cup clash. Hopefully, a new TV partnership with FIFA+, the success of the recent World Cups, Phoenix hype and the new Auckland expansion, can create a bigger buzz about the domestic game in 2024.",
  "word_count": 572,
  "scraped_at": "2026-02-14T13:29:31.081144"
}