{
  "article_id": "c0bd2ed3f5bd",
  "url": "https://www.90min.com/posts/real-madrid-2-2-chelsea-player-ratings-uwcl-15-11-23",
  "title": "Real Madrid 2 - 2 Chelsea : Player Ratings as Blues start UWCL campaign with draw",
  "date": "20231115T234500Z",
  "domain": "90min.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Real Madrid 2-2 Chelsea: Player Ratings as Blues start UWCL campaign with draw\n- Chelsea led 2-1 but were pegged back by a questionable penalty\n- Niamh Charles scored her first European goal earlier in the game\n- Emma Hayes' first game since confirmation of USWNT job\nBy Emily Keogh\nReal Madrid denied Chelsea victory on Women's Champions League matchday one thanks to a controversial late penalty from World Cup star Olga Carmona.\nChelsea manager Emma Hayes faced her first fixture after it was confirmed she would be trading Cobham for Chicago and taking up the role of head coach of the US Women's National Team at the end of the current season after 12 years in charge of the Blues.\nA brace from Carmona, who scored the only goal in the World Cup final to hand defeat to England three months ago, cancelled out Chelsea's two headed goals from Niamh Charles and Sam Kerr.\nHow the game unfolded\nMadrid's solid attack was quickly rewarded with an early goal 10 minutes in. The first shot of the game fell to Spain's World Cup-winning captain Carmona whose rocket of a strike took a big deflection off Chelsea skipper Millie Bright to barrel into the back of the net.\nEvery time Chelsea were pressing forward, Madrid’s defence swarmed them and forced the visitors into errors, in an impressive start to the group stage from the hosts.\nChelsea began to compose themselves in search of an equaliser but Madrid were still firmly pulling the strings to keep last years semi-finalists at bay. Chelsea's break allowed Fran Kirby to feed Sam Kerr who whipped goal-bound but Misa Rodrigues made an exceptional save before Erin Cuthbert and Jessie Fleming were both denied in the same manor.\nChelsea looked shaky defensively, with their midfield also appearing uncharacteristically passive. Yet the Blues front line was far from subdued and were rewarded for their invigorated attack, with Charles netting her first European goal to level the score.\nCharles, who has created the most chances for any club in the WSL so far this season, broke away from Athenea del Castillo to score a bullet header from Ashley Lawrence's pinpoint cross.\nChelsea kept attacking but were not pulling the trigger at the right time. Kerr came close to snatching the lead after a well worked run into the box. But Misa's outstretched desperate dive denied the Australian striker her first European goal of the season. Kirby was also lining up a shot into the back of the net but Madrid skipper Ivana Andres foiled the 30-year-old.\nLeft-back Charles was once again on hand to stop Del Castillo's run in her tracks before apinpoint cross found the head of Kerr, whose prolific skill made no mistake of claiming the lead.\nDespite having a penalty appeal fall on deaf ears earlier in the half after being tackled in the box, Fleming gave away a questionable penalty. Despite the minimal contact happening before the box, Del Castillo fell within the box, seeing Carmona dispatch the powerful equaliser from the spot as a result.\nIn another turn against the visitors, Charles once again had the ball in the back of the net seconds before the final whistle but a questionable offside call, presumably on Kerr for supposedly interfering with play in the midd, left the teams sharing the spoils.\nReal Madrid player ratings (4-2-3-1)\nGK: Misa Rodriguez - 8/10 - Solid performance from the Spaniard who pulled out some imperssive stops to deny Chelsea's prestigious forward line.\nRB: Oihane Hernandez - 6/10 - Evenly matched against Fleming but was quiet and Madrid struggled to use the right flank as an attacking option, using the left far more effectively.\nCB: Ivana Andres - 8/10 - A really impressive night for the skipper, proving how pivotal she is in not only leading the defence but taking on players one v one, and winning.\nCB: Kathellen Souza - 7/10 - Did well to prevent against Kirby but was the shakier of the two centre-halves and Chelsea exploited this.\nLB: Olga Carmona - 8/10 - Screamer of a goal from Carmona to open the scoring. Defensifly, such a solid full back but so dangerous pressing forward and Cheslea were too passive in dealing with the threat she poses.\nCM: Sandie Toletti - 6/10 - Made some dangerous plays and her decision making was less than desirable. Failed to contain Kirby leaving her far too dangerous.\nCM: Teresa Abelleira - 6/10 - A decent match up with Cuthbert but was caught out of position a few times. That being said, her involvement elsewhere on the pitch was useful in keeping Chelsea at bay.\nCAM: Claudia Zornoza - 6/10 - Provided a key avenue for Madrid to play through but struggled against Chelsea's central midfield set up.\nRW: Athenea del Castillo - 7/10 - Did not do well enough to track Charles and the England defender beat her on pace and creativity too many times. Had a quieter night upfront, but was able to provide a succinct attacking option.\nST: Signe Brunn - 6/10 - A quieter evening from the recent Madrid signing who struggled to find footing in the game.\nLW: Linda Caicedo- 7/10 - A real threat but was let down by poor passes feeding her. She was released several times and had to be denied by Chelsea pulling off their most inventive saves.\nSubstitutes\nSUB: Maite Oroz (60' for Zornoza) - 6/10\nSUB: Naomie Feller (71' for Brunn) - 6/10\nSUB: Hayley Raso (89' for Caicedo) - N/A\nSUB: Freja Olofsson (90' for Abelleira) - N/A\nSubs not used: Chavas (GK), Galves, Robles, Moller, Svava, Rodriguez, Lopez, Alonso\nManager\nAlberto Toril - 7/10 - Smart to use 4-2-3-1 and did well to rebuild his midfield after pivotal Caroline Weir suffered her ACL injury last month. Madrid were saved by the officiating.\nChelsea player ratings (4-2-3-1)\nGK: Ann-Katrin Berger - 6/10 - Ended up completely wrongfooted by the opener.\nRB: Ashley Lawrence - 8/10 - Very prominent on the right, both defensivley and providing a ruthless attacking option that resulted in a goal. Her experience in UWCL was clear to see.\nCB: Millie Bright - 7/10 - Very passive early on defending against Madrid's front line, lacking togetherness and communication at the back but did well to grow into the game and settle Chelsea into some more cohesive defending.\nCB: Jess Carter - 6/10 - The Bright-Carter centre-back pairing is the less strong option for Hayes and it was visible that neither providing a ball-playing option and was caught out of position at times, leaving Bright a lone solider.\nLB: Niamh Charles - 9/10 - Exceptional driving forward and scored the equaliser and nearly had a last ditch winner too. Her defensive ability has been vastly improved and she did great work in tracking back and keeping Del Castillo at bay.\nCM: Erin Cuthbert - 6/10 - Smart from Cuthbert defensively and came in to make some important tackles but should have done more in the build up to the first goal.\nCM: Sjoeke Nusken - 7/10 - Getting her first taste of European football, the German international did well to hold the ball up well and use her vision to full advantage.\nCAM: Fran Kirby - 8/10 - Once again, proved how pivotal of a player she is and how clinical her strikes can be. Lined up numerous times to take a shot at Misa who did well to prevent Kirby but that did not dampen the midfielder's impressive relentlessness. A frustrating 65 minutes for the England Lionesses but an impressive one.\nRW: Johanna Rytting Kaneryd - 5/10 - Quiet night for the Swede who struggled to get involved in the attack.\nST: Sam Kerr - 7/10 - Frustrating evening for the usual clinical striker who would been disappointed to not have scored more of her clean cut chances, yet her goal changes the energy for Chelsea and was vital for the last push.\nLW: Jessie Fleming - 6/10 - Positive from the Canadian but gave away the penalty despite the contact happening outside of the box. An unfortunate officiating decision for a tackle that just went the wrong way for Fleming.\nSubstitutes\nSUB: Lauren James (63' for Kirby) - 7/10\nSubs not used: Musovic (GK), Hampton (GK), Fishel, Nouwen, Ingle, Perisset, Mjelde, Buchanan, Cankovic, Beever-Jones\nManager\nEmma Hayes - 7/10 - Set up her team well and her half-time team talk was clearly effective but the side was let down by the questionable officiating.",
  "word_count": 1419,
  "scraped_at": "2026-02-14T12:56:56.248135"
}