{
  "article_id": "c0dbf5f43c43",
  "url": "https://www.fourfourtwo.com/opinion/the-small-thing-i-spotted-at-newcastle-uniteds-training-ground-last-week-that-underlines-why-dan-ashworths-potential-departure-to-manchester-united-is-a-big-thing",
  "title": "The  small thing  I spotted at Newcastle United training ground last week that underlines why Dan Ashworth potential departure to Manchester United is a  big thing  ",
  "date": "20240221T174500Z",
  "domain": "fourfourtwo.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "The ‘small thing’ I spotted at Newcastle United’s training ground last week that underlines why Dan Ashworth’s potential departure to Manchester United is a ‘big thing’\nDan Ashworth was at the 'wheel' of Newcastle United, but while he's on gardening leave the spokes of the club could stop moving\nThe best features, fun and footballing quizzes, straight to your inbox every week.\nYou are now subscribed\nYour newsletter sign-up was successful\nWant to add more newsletters?\nFive times a week\nFourFourTwo Daily\nFantastic football content straight to your inbox! From the latest transfer news, quizzes, videos, features and interviews with the biggest names in the game, plus lots more.\nOnce a week\n...And it’s LIVE!\nSign up to our FREE live football newsletter, tracking all of the biggest games available to watch on the device of your choice. Never miss a kick-off!\nJoin the club\nGet full access to premium articles, exclusive features and a growing list of member rewards.\nThey’ve done a small thing at Newcastle’s Training Ground. It might have been Dan Ashworth’s idea, it might not have been. I can’t say for sure. It might not even be a deliberate ‘small thing’, but let me explain what it is and why I like it.\nI visited last week to interview Sean Longstaff for the next issue of FourFourTwo magazine. It had been 12 months since I was there last and on that occasion the training centre was a building site. We ended up interviewing a Newcastle first team player in a portakabin adjacent to the main building where the media team were based. The transformation of the club following the Saudi-led takeover was very much underway on and off the pitch.\nFast forward to 2024 and the revamped training ground is buzzing, there was literally an audible hum to the building when I walked through the glass door and into the new, clean, spacious, modern reception. The improvement on the old layout (which felt more like a doctor's surgery) is significant.\nVIDEO: Why Man United Want Dan Ashworth So Badly\nAfter being greeted by a friendly staff member I sat down to wait. I noticed there are two glass meeting rooms in the reception area itself. One was occupied by half a dozen people on a Zoom call, one of whom was Newcastle’s currently-on-gardening-leave Sporting Director, Dan Ashworth.\nIt was all smiles from what I could see. The quiet before a storm that came the next day when Sir Jim was ratified having had his 25 per cent investment in Manchester United approved by the Premier League and Football Association. This news was significant because it meant his interest in recruiting Ashworth to lead the Old Trafford revival could officially become official.\nThe other meeting room was empty: I realised that this was likely to be the spot for my interview with Longstaff who appeared in the reception bang on time flanked by two Newcastle press officers. So it was, we spent the next hour inside the other glass meeting room where we had an enjoyable chat that will be in the issue of FourFourTwo magazine on sale 7 March.\nAt one point, Longstaff told me he had been laughing with Dan Ashworth a week or two earlier, jokingly telling the Sporting Director he wanted to sign for a Canadian MLS club so he could indulge his passion for ice hockey.\nThese two glass reception area meeting rooms serve a clever purpose. They keep ‘outsiders’ like me technically out of the training centre. The training centre is the area of business for players and staff. They don’t want journalists poking their heads in where they don’t belong.\nAfter the interview Longstaff shook my hand and headed back through the door to the real inside where, psychologically, he knows he‘s back in the safe confines of the Newcastle dressing room. No fuss. He and his team-mates can relax and focus without prying eyes. As much as I’d like a proper nose around, I appreciate the clear delineation between inner and outer sanctum.\nThe best features, fun and footballing quizzes, straight to your inbox every week.\nA tiny thing in the grand scheme of things, but the devil is in the detail at this elite level of sport, and Dan Ashworth’s job is (was) to be across every aspect of Newcastle United. Sitting, as he put it when unveiled as the club's Sporting Director in June 2022: “in the middle of the wheel connecting the spokes of the different departments of the club.”\nAshworth was celebrated like a new signing, because he was one. His arrival was a coup. Newcastle had secured the services of arguably the best Sporting Director in British football, and now they look like they might lose him – and that is a bigger blow than people might appreciate.\nHe's the heartbeat of the club: from Eddie Howe’s first team to the women’s team and the academy, from medical to recruitment, from commercial to infrastructure, to possibly recommending clever placement of small glass meeting rooms to keep nosy journalists at arm’s length.\nA poll I conducted on X yesterday aimed at Newcastle fans revealed that 87 per cent of over 2,000 people who responded weren’t bothered by the prospect of losing Ashworth. His arrival was celebrated, so shouldn't this potentially premature departure be mourned?\nQuestion for #NUFC fans. Will you be / are you bothered by the prospect of losing Dan Ashworth?Cc’ing @ToonPolls for personal safetyFebruary 20, 2024\nThere's anger from supporters, and probably Newcastle's owners and Eddie Howe, but from Ashworth’s perspective he didn’t court the approach from Manchester United.\nYet, now it’s here you can’t deny it’s an attractive project: he’ll have more money to spend (personally and professionally), he’ll be working at a bigger club with Sir Dave Brailsford who is a personal friend and a man he had immense respect for. Someone he invited to address the Newcastle squad in 2022. Someone who is regarded at the best in world sport at creating environments designed to win. Newcastle need that. Manchester United need that, but sadly for Newcastle Manchester United have more money.\nThere has been so much going wrong at Manchester United that Ashworth would almost find it hard to fail. Playing a key part in bringing success back to Old Trafford would have an immense impact on his already strong reputation, so I don’t think anyone can begrudge Ashworth this move.\nFrom Newcastle’s perspective the situation will delay progress and impact resources from a financial and personnel perspective. Significant time and effort will now have to be redirected to the search, interview process and acquisition of their new Sporting Director which in some ways is as important as finding a new first team player, and it can't properly begin until the situation is resolved. While this all goes on Ashworth is on full pay. Probably the highest paid staff member who doesn't pull on a pair of boots.\nMartin Samuel wrote in The Times that Newcastle should demand £60m for Ashworth. Sounds crazy, yet it kind of makes sense. Ashworth could play a key role in bringing titles and European Cups back Manchester United who have gone a decade without one. That's a long time for a club that demand them.\nSummer transfer negotiations that Ashworth would have been working on will be now paused, other important plans he had put in motion may have to be scrapped entirely. Sadly, I don’t think Newcastle’s owners, or the 12 per cent of fans who seem bothered by Ashworth’s exit right now can have any arguments.\nNewcastle did the same thing to Brighton two years ago and now a bigger shark has come along and eaten their lunch. Newcastle are a club that have been starved of success, losing Ashworth will only prolong that wait.\nMore Matthew Ketchell stories\nBroadcasters are putting TV before Fans and undermining initiatives like ‘Green Football Weekend’ - here’s how to fix it\nIs the original Adidas Predator rubber grip technology still relevant in 2024, as amazing moment of serendipity is discovered 30 years on\nFarewell sweet Prime: Amazon showed broadcasters how football coverage SHOULD be done and I’ll miss it when it’s gone\nKetch joined FourFourTwo as Deputy Editor in 2022 having racked up appearances at Reach PLC as a Northern Football Editor and BBC Match of the Day magazine as their Digital Editor and Senior Writer. During that time he has interviewed the likes of Harry Kane, Sergio Aguero, Gareth Southgate and attended World Cup and Champions League finals. He co-hosts a '90s football podcast called ‘Searching For Shineys’, is a Newcastle United season ticket holder and has an expensive passion for collecting classic football shirts.",
  "word_count": 1452,
  "scraped_at": "2026-02-14T13:11:18.428996"
}