{
  "article_id": "c0f42fbdf40b",
  "url": "https://bleacherreport.com/articles/10062376-uswnt-vs-new-zealand-2023-friendly-top-storylines-and-predictions",
  "title": "USWNT vs . New Zealand : 2023 Friendly Top Storylines and Predictions",
  "date": "20230120T123000Z",
  "domain": "bleacherreport.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Featured Video\nHarper's Rising Stars Game-Winner 🔥\nUSWNT vs. New Zealand: 2023 Friendly Top Storylines and Predictions\nThe United States women's national team complete its two-game tour of New Zealand on Friday in Auckland.\nThe Americans kicked off their 2023 campaign with a win over the Football Ferns on Tuesday, and a similar result is expected when the two teams meet again at Eden Park.\nVlatko Andonovski's side enters the game without midfielder Lindsey Horan, who has returned to Lyon as part of an agreement between the French club and United States Soccer Federation.\nThat leaves a spot in midfield for Andonovski to fill in his starting XI, with Taylor Kornieck and Kristie Mewis among the contenders for the role.\nRegardless of which players are on the field, the Americans need a better start against the 2023 FIFA Women's World Cup co-host.\nThe USWNT won Tuesday's game 4-0, but all of the goals came in the second half. A better start is needed as the team works on every detail of its game with the World Cup on the horizon in July.\nLindsey Horan to Miss Game After Return to Lyon\n1 of 3Horan's absence could turn out to be a blessing for Andonovski.\nInstead of starting the 28-year-old for 45-60 minutes, the USWNT coach has a chance to evaluate his central-midfield depth.\nTaylor Kornieck and Kristie Mewis are the two likely options to replace Horan in a starting lineup that could see some rotation so that Andonovski can get a look at as many players as possible.\nKornieck and Mewis are closer to the fringe of the USWNT roster with the World Cup approaching this summer. The former started alongside Horan for 45 minutes on Tuesday, while the latter was an unused substitute.\nAnother potential option is to use Crystal Dunn in a midfield role that she played a bit in with the Portland Thorns in the National Women's Soccer League.\nThe argument for Dunn to start in midfield is that Andonovski must put his best players on the field in any capacity. As one of the most versatile players in the talent pool, she has played up top in the past and is currently being used as a full back.\nThe 30-year-old may not be needed in her current full-back role because of the USWNT's depth at the position, so Andonovski could give her a chance in the center of the park to assess another option ahead of the World Cup.\nBetter Start Needed by USWNT\n2 of 3Tuesday's 4-0 final score masked some of the difficulties the USWNT had in the first half against New Zealand.\nThe Americans need to play a more complete 90 minutes on Friday as they escalate their preparations for the World Cup.\nOf course, the USWNT has the talent to overcome most situations, as it showed in the second half on Tuesday, but it does not want to be in those positions to start.\nThe team must ramp up the pressure on the hosts from the opening whistle on Friday. As part of that approach, it needs to be more ruthless in the final third.\nAlex Morgan and Mallory Swanson started Tuesday's game, with the latter scoring twice in the second-half onslaught and the former bagging a goal of her own between those two strikes. Lynn Williams completed the scoring after coming off the bench.\nEvery minute of action will be dissected ahead of the World Cup. A dominant showing will point the USWNT in the right direction as it heads home for the SheBelieves Cup in February, where it will face Canada, Japan and Brazil.\nPrediction\n3 of 3United States 5, New Zealand 0\nIt is hard to see the USWNT losing to New Zealand, even if it struggles for one stretch of the match again.\nThe Americans beat the Football Ferns by a combined 9-0 score in their last two meetings in 2022 and 2023.\nThe USWNT did not lose the second game of any two-game series in 2022. It won those matches by a combined 15-2.\nLook for a better start from the Americans this time. If they come out with a higher intensity, the deep forward group could have a fun time in Auckland.",
  "word_count": 706,
  "scraped_at": "2026-02-14T12:14:23.027975"
}