{
  "article_id": "c111fff33714",
  "url": "https://www.runnersworld.com/news/a43412222/nil-college-runners/",
  "title": "NIL - College Runners Cashing in on Name , Image , and Likeness Money",
  "date": "20230330T201500Z",
  "domain": "runnersworld.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Emily Cole’s days are full. A Duke University senior, she’s completing an interdepartmental major in computer science and economics.\nShe runs 65 miles per week and has a personal best of 9:48 in the steeplechase. Last year, as a junior, she qualified for the NCAA outdoor championships and USAs. Earlier this month she ran the leadoff leg for Duke’s DMR at NCAA indoors.\nAnd then there are the NIL deals.\nThese are the business opportunities that allow Cole to capitalize on her name, image, and likeness by promoting brands to her legions of social media followers: 200,000 on TikTok and 110,000 on Instagram. Her agent, Michael Raymond, told Runner’s World the value of those agreements will “easily” top $150,000 in 2023.\nKeeping up her social media may look like little effort—simple photos with her family and from track meets, videos showing Cole on meet day, putting on her makeup and press-on nails, and pulling her uniform over her head.\n“I honestly don’t put my uniform on until after I warm up, but I had to show you the full fit,” she says to the camera in her GRWM post. (The acronym stands for “get ready with me,” and it’s a popular form of content for social media influencers.)\nInterspersed with the personal posts are the promotional posts for companies like Therabody, Dick’s Sporting Goods, and H&R Block.\nBut nothing about this is simple. Conceiving content, creating content, and editing content that will resonate with followers is a job all its own.\n“It definitely does get hard to balance sometimes,” Cole said in a phone call with Runner’s World about her schedule. “I like to go to bed early. I don’t like to stay up late doing a lot of work. At the end of the day, if I just have my priorities straight—what big three things I want to get done every day—it helps me shape my day around that.”\nCole, who said she read the productivity self-help book The 4-Hour Work Week when she was in high school, is something of a rarity in NCAA Division I cross country and track and field—and in the entire NCAA, for that matter.\nShe’s cashing in on NIL. But the vast majority of track athletes are not. Here’s what the current landscape looks like for cross-country and track athletes trying to monetize their involvement in sports.\nControversial collectives aren’t often helping track & field athletes\nNearly two years after a June 2021 Supreme Court ruling paved the way for college athletes to make money, most of the NIL dollars are flowing to football and men’s basketball—hardly a shock to anyone who follows college sports.\nAthletes in those sports receive support from collectives, which are groups of alumni or boosters who pool their money and come up with ways to support the top performers in the highest-profile sports. Collectives aren’t supposed to influence recruiting (ahem) but the promise of a multimillion dollar NIL arrangement can help a program land a big-time quarterback or (male) point guard.\nIn exchange, the player, when he or she gets to campus, does a nominal amount of promotional work for, say, a charity or a local booster’s car dealership. These deals can also keep a star player from entering the transfer portal to another program. Or from turning pro early, if they’re earning good money in the college system.\nThe system has quickly spiraled out of control, with rival coaches making accusations about each other’s unfair use of NIL or unscrupulous agents and parents playing programs off one another.\nCollectives are supposed to benefit all of a university’s sports and athletes, but that’s not usually the case. The result has created two different systems: one for men’s basketball and football and one for all the others.\nSo where does that leave the runners? Two routes\nTrack athletes seem to have two avenues for securing NIL deals: They could be like Cole or Tori Ortiz, an Oklahoma State University 200- and 400-meter sprinter who has a substantial social media following—615,000 followers on TikTok and 157,000 on Instagram.\nOrtiz, who is also represented by Raymond, is not one of the top performers in the NCAA. She hasn’t qualifed for nationals, although her 4 x 400-meter relay was fourth in the Big 12 conference. But she has been able to leverage her social media presence into deals with Meta, WWE, and Force Factor, among others.\nRaymond says the impressive social media numbers alone aren’t enough. “At the end of the day, just because you have a social media following, if you’re not making great content, if you’re not showing your personality, if you’re not really trying to be all in with this in this space, you probably won’t get that many deals,” he said.\nCole already had a large following before she signed with Raymond’s agency. She self published a book about athlete nutrition, The Players’ Plate, and she enjoys sharing snippets of her life.\nThat said, she has to be careful not to let it become all-consuming, and advises athletes looking to build their followings to put guardrails up.\n“Give yourself boundaries on that journey,” she said. “Don’t let social media consume your life. If it takes away from your mental health and your actual life, then it’s totally not worth it.”\nSo where does that leave the runners? The second route\nThen there are Katelyn Tuohy and Charles Hicks, the reigning NCAA cross-country champions, who have signed deals with Adidas and Nike, respectively. Those deals, brokered by agent Ray Flynn, were natural because Adidas already sponsors the athletic department of North Carolina State University, where Tuohy is enrolled, and Nike is the Stanford sponsor, where Hicks is.\nOne of the fundamental principles of NIL is that companies can’t pay for performance. No bonuses or deals can be tied to race results or times. But the shoe companies are aligning themselves behind excellence anyway—even if they aren’t explicit about it. They’ve decided to offer deals to two of the best college athletes in the country.\nTuohy made a simple announcement on her Instagram with a photo on November 22. “Joining the three stripes fam couldn’t feel more right,” she wrote. Since then, she’s made only one overtly Adidas-related post, promoting the Atlanta City Games on May 6, which Adidas will sponsor.\nHicks announced his deal on March 4 on his YouTube channel (33,000 subscribers). In his messy dorm room, he unpacked boxes of Nike gear and explained how excited he is.\nThe requirements on his end aren’t onerous, Hicks told Runner’s World in an email. He has social, digital, and in-person engagement obligations, but Nike staffers have been accommodating his “needs as a student-athlete throughout the process.”\nUnlike Cole and Ortiz, who face an uncertain future in the sport once they use up their eligibility, Tuohy and Hicks are basically locks to sign pro deals. When it comes time for them to turn pro, Adidas and Nike will have a leg up.\nThe University of Florida 400-meter specialist Talitha Diggs, another Raymond athlete, is of the same caliber, if not better, than Tuohy and Hicks. But so far she has no shoe deal. (Nike is the University of Florida footwear sponsor.) Diggs has done individual brand deals with Honey Stinger, Wells Fargo, and Vuori.\nCara Hawkins-Jedlicka, a scholarly assistant professor at Washington State University who studies NIL, points out that Abby Steiner didn’t bother with NIL when she was setting records at the University of Kentucky last year. Instead, she focused on track and turned pro before the World Championships, signing a deal with Puma that was rumored to be worth $2 million per year.\nMultisport talent Anna Hall did work the NIL route while she was at Florida, Hawkins-Jedlicka said. Hall then signed a pro deal with Adidas—which ended the NIL work, as NIL deals are only for college athletes—and has since set an American indoor record in pentathlon.\nHow much money is at stake?\nIt’s hard to say. The only people who know for sure are the agents and the athletes. The NIL company On3 takes a stab at ranking athletes, based on social media metrics and performance, but their numbers are estimates. The current top three athletes are Bronny James, the son of NBA star LeBron James, who is in high school in California (On3 estimates his NIL valuation at $7.2 million); Arch Manning, of the famous Manning football family, who is committed to play football at the University of Texas (valuation is $3.7 million); and Louisiana State University gymnast Olivia Dunne ($3.4 million).\nThe first track athlete on the list is in 18th place on On3’s list: Sam Hurley, a Texas freshman who competes in high jump and decathlon and became a TikTok star in high school. His estimated value, according to On3, is $1.1 million.\nThese athletes lead the lists, but NIL rules do allow for college athletes of all kinds to make smaller sums from their name—by hosting summer camps and clinics, say, for high school runners. It might net an athlete only a modest fee, but under old rules, even that type of work was prohibited.\nIs this money just there for the taking?\nAbsolutely not, especially for runners. The ones who are successful have built an audience already or are at the pinnacle of the sport in college. The others are out of luck—or have decided they don’t have the time and interest in chasing deals that might not amount to very much. Raymond says he fields inquiries from athletes who are seeking representation every week, and he turns down most of them.\nOthers don’t even try. “Many athletes don’t feel like it’s worth their time to build a brand. They are playing a sport, taking four or five classes. Where’s the time?” said Hawkins-Jedlicka.\nAlthough it can be disappointing for runners to look around campus and see football players and basketball players being handed easy deals, many athletes have made the calculations that the effort won’t pay off. Or they just don’t want to put themselves out there—especially women, who feel that the most successful ones are playing off their looks or their bodies.\n“There’s a lot of athletes,” Hawkins-Jedlicka said, “who just want to play their sport.”\nSarah Lorge Butler is a writer and editor living in Eugene, Oregon, and her stories about the sport, its trends, and fascinating individuals have appeared in Runner’s World since 2005. She is the author of two popular fitness books, Run Your Butt Off! and Walk Your Butt Off!",
  "word_count": 1755,
  "scraped_at": "2026-02-14T13:07:25.138824"
}