{
  "article_id": "c1175445f0f8",
  "url": "https://www.engadget.com/entertainment/streaming/wwe-saturday-nights-main-event-how-to-watch-john-cenas-final-match-for-free-235537779.html",
  "title": "WWE Saturday Night Main Event : How to watch John Cena final match for free",
  "date": "20251213T003000Z",
  "domain": "engadget.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "WWE Saturday Night's Main Event: How to watch John Cena's final match for free\nJohn Cena began his WWE retirement tour back in January, and it's coming to an end this weekend when the wrestling legend headlines WWE Saturday Night's Main Event. For the last fight of his career, Cena has been matched up with \"The Ring General\" Gunther on the night's fight card, which also features matches between Cody Rhodes and Oba Femi, a tag team match featuring AJ Styles & Dragon Lee vs. Je'Von Evans & Leon Slater, and a women's matchup between Bayley and Sol Ruca. This show starts at 8 p.m. ET on Saturday and will stream with a subscription to Peacock, or grab a 7-day trial of Peacock through Prime Video and tune in for free.\nHere's a look at how to watch John Cena's final fight at WWE Saturday Night's Main Event this weekend, including how to stream the entire thing for free.\nHow to watch WWE Saturday Night's Main Event:\nDate: Dec. 13, 2025\nTime: 8 p.m. ET/5 p.m. PT\nStreaming: Peacock\nWhere to watch WWE Saturday Night's Main Event:\nThe WWE Saturday Night's Main Event will air live on Saturday, Dec. 13, 2025 on Peacock, with fights starting at 8 p.m. ET. You can also tune in to the Saturday Night's Main Event Countdown pre-show starting at 6 p.m. ET, and the post-show, which immediately follows the event on Peacock.\nWho will be at WWE Saturday Night's Main Event?\nThis weekend's Saturday Night's Main Event will be headlined by John Cena and Gunther. Also on the bill, you can catch matches between Cody Rhodes and Oba Femi, a tag team bout between AJ Styles & Dragon Lee vs. Je'Von Evans & Leon Slater, and a women's matchup between Bayley and Sol Ruca.\nHow to watch the WWE Saturday Night's Main Event:\nThis weekend's WWE Saturday Night's Main Event streams exclusively on Peacock, but there is a way to get it for free, with Prime Video.\nRight now, you can grab a free 7-day trial of Peacock Premium Plus if you sign up through Prime Video, so you can watch sports like the WWE, Premier League, and Sunday Night Football, along with original series like All Her Fault and The Traitors, and great Bravo and NBC shows, at no cost. You can cancel after the trial ends, or keep the subscription to Peacock Premium Plus for $16.99/month.\nWhile a regular Peacock subscription begins at $10.99 for a Premium Plan and goes up to $16.99 for the ad-free Premium Plus plan, you can get an ad-supported subscription for free if you're a Walmart+ subscriber.\nWalmart+ members actually get their choice between Paramount+ or Peacock included in their membership at no additional cost. A monthly subscription to Walmart+ costs $12.99, and an annual plan costs $98 and includes additional perks like five free months of Apple Music, discounts on Cinemark movie theater memberships, free shipping and delivery on Walmart purchases, discounts on gas, and much more.\nInstacart+ subscribers are able to get an annual Peacock Premium plan (a $109.99 value) for free as part of their plan. After a free 14-day trial, Instacart+ plans cost $99/year, meaning you'll save more on Peacock simply by subscribing to the delivery service, but you'll get tons of extras, like free grocery and restaurant delivery, and a free subscription to the NY Times Cooking app, too.\nStarting at $11 a month, a Peacock subscription is a great way to stream this weekend's Saturday Night's Main Event.\nOn top of this weekend's wrestling, you’ll also get access to thousands of hours of shows and movies, including beloved sitcoms such as Parks and Recreation and The Office. For $17 monthly you can upgrade to an ad-free subscription which includes live access to your local NBC affiliate (not just during designated sports and events) and the ability to download select titles to watch offline.\nWWE Saturday Night's Main Event Fight Card:\nJohn Cena vs. Gunther (John Cena's final match)\nUndisputed WWE Champion Cody Rhodes vs. NXT Champion Oba Femi\nWorld Tag Team Champions AJ Styles & Dragon Lee vs. Je'Von Evans & TNA X Division Champion Leon Slater\nBayley vs. Sol Ruca",
  "word_count": 700,
  "scraped_at": "2026-02-14T12:50:40.257204"
}