{
  "article_id": "c123dcfcdbe5",
  "url": "https://cronkitenews.azpbs.org/2023/11/03/phoenix-rising-los-bandidos-support-usl-western-conference-final/",
  "title": "Phoenix Rising FC Los Bandidos key to team run to USL Western Conference Final",
  "date": "20231104T001500Z",
  "domain": "cronkitenews.azpbs.org",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "PHOENIX – In the south end of Phoenix Rising Stadium, supporters enthusiastically crush dollar beers while chanting continuously for 90 minutes.\nWin, lose or draw, the madness, celebration and roar coming from Phoenix Rising FC supporters group Los Bandidos can be found here.\nAs its playoff campaign continues, Phoenix Rising FC is poised to complete the California sweep with a Western Conference Final matchup against No. 1 seed Sacramento Republic FC Saturday at 7 p.m.\nConquering this formidable road atmosphere in the playoffs has been no easy feat. Contingent on the passionate backing of the Rising’s supporters, most notably Los Bandidos, coach Juan Guerra’s team has stolen two games on the road as the sixth seed against three-seed San Diego Loyal SC and second-seed Orange County SC.\n“When you play away from home, turning to the side and you see the support of people that are traveling, that are taking time away from their lives and their weekends to come support us and be there with us, that’s what makes this extra special,” Guerra said. “What I’ve taken from this playoff run is we’re not alone in this and we got people that are going to follow and they are going to support us.\n“In Sacramento, it’s going to be thousands of them, but I’m pretty sure when we turn to our left and right we are going to see a lot of red jerseys and we’re not going to be alone on the field.”\nLos Bandidos have a knack for transforming away games into a home-like experience, creating an inviting atmosphere during away matches for the players and coaches.\n“They are key to our success, our performances, and a very important part of our motivation as well,” Guerra said. “We don’t just do this for ourselves. We do it for a bigger purpose, and they’re definitely part of the bigger purpose that we always focus on.”\n“We want to give the boys a little piece of home to offset the hostile environment and I say that in quotes,” Bandido Thomas Rosales said with a chuckle. “It’s to show the rest of the league how passionate we are as fans, and Phoenix isn’t to be trifled with.”\nWho is the Los Bandidos supporters group and what sets them apart from others?\nInitially established following the rebranding of Arizona United to Phoenix Rising FC in 2017, Los Bandidos was created not only as a result of a shared love for Phoenix soccer but as a means to commemorate the rich culture of Phoenix.\n“Los Bandidos is the heart of the body,” Guerra said. “They keep pumping the blood to the whole stadium. They’re never quiet. With the music, singing and jumping, they’re keeping everyone alive and engaged throughout the whole game.”\nBecoming a Bandido is straightforward, despite misconceptions about this supporters group. There are no secret rituals or initiation processes; all that’s required is a presence in the south end and a strong display of zeal and liveliness.\nFrom their no-cell-phone policy to their non-stop singing, to their joint fundraising endeavors, Los Bandidos stands out as one of the most distinctive fan groups in the USL, both during matches and beyond.\nTomas Rosales, the current Capo for Los Bandidos, doesn’t even watch the game despite being in attendance at every one of them. He’s the one in the south end facing away from the pitch during the entire time.\nTomas inherited the role from the previous Capo, Veda Kettigna, who in 2019 asked him to try the position during the final 20 minutes of a match.\nSince then, in close collaboration with La Banda, the instrumentalists in the supporters group, he interprets cues based on their passionate performances. From there, he will cue them into different songs on what he feels is needed depending on the atmosphere and situation.\n“I’m not there to watch the game,” Rosales said. “I’m here to get people involved in the chants. I’m keeping the cadence of the beat while trying to look for people who aren’t just looking at the game, forgetting to chant, or on their phone. My job is really just keeping people present.”\nEmbracing the role of a Bandido presents a multifaceted challenge. From memorizing the songs to navigating the logistics of attending an away game to handling game-day responsibilities, it demands unwavering commitment and attention.\n“There’s a whole lot that goes on behind the scenes,” said Kieran Thompson, who has been with the group since 2019. “From the people who organize the big banners and even La Banda, the work they do rehearsing and just playing drums for 90 minutes is an incredible workout. We put a lot into learning the songs, writing new chants and rehearsing. It’s a lot of work, like in any group, to organize people and to bring people together.\n“And so there’s a lot of people behind the scenes, people who help with social media, people who are capos, people who plan events and people who design the jerseys. We’ve had some incredible leadership, from the founders on through.”\nThis dedication is what the group believes sets it apart from others in the league.\n“I believe we are the best supporters group in the USL,” Rosales said. “We bring a level of passion and a level of atmosphere that even players that have moved here, that have played against us talk about it, which speaks volumes.\n“Even if it’s a bad turnout for the club on attendance level, we’re still in there making noise and some USL clubs can’t speak to that.”\nPart of this atmosphere heavily relies on the Songs of the Bandidos, in addition to prohibiting phones and discouraging sitting.\nThese 26 songs were crafted by the Bandidos’ own members. They consistently participate in workshops to generate new music and lyrics.\n“The songs are just aspects of the club, its journey with us and our journey with them,” Rosales said. “It’s a lot of things about the city and our passion for the red and black. Mainly, they are about looking for that cup.”\nMuch like Guerra, Rosales believes that Los Bandidos are the lifeblood of the fans, infusing the stadium with energy and giving life to those who aren’t in the south end.\n“I feel like we not only give the team, but the stadium a heartbeat,” Rosales said. “There’s been times where not even just the south end has been rocking, but the entire stadium joining into our songs and chants. It’s cool to see the reach we have outside our own seating area.\n“Not to sound arrogant or boastful, but without a supporters group, we’d sound like certain clubs, where they pump music through the (public address system) for corner kicks and have an obnoxious DJ that just plays throughout the match.”\nThe theory behind the no-phones and no-sitting policies is the group’s desire to be present for the entire match.\n“We’re not there to take pictures. We don’t do it to get clicks on Instagram or Twitter,” Rosales said.\nLos Bandidos’ impact extends beyond the south end.\nCollaborating closely with the team, the Bandidos support the Rising’s community initiatives, actively engaging in the team’s theme nights to aid fundraising.\nRising theme nights consist of a mix of community initiatives and other events including Pride Night, Indigenous People’s Night, Military Appreciation Night and Hispanic Heritage Night.\n“Besides this, we’ve done Prideraiser and this year, we are doing One N Ten which goes to the LGBTQ youth in the community,” Rosales said. “These programs give them a place where they feel welcome, valued and helped with whatever they face in their daily life as challenges.”\nThe Bandidos also unveiled teal indigenous jerseys, with proceeds dedicated to the cause of missing and murdered indigenous women.\nThis year, fans and supporters were invited to participate by pledging a donation amount tailored to their preference for each goal scored, depending on the targeted initiative.\nLast week’s Orange County playoff match saw over 175 Rising fans make the trip to support their team, with Thompson being one of them.\nAfter missing the last trip to the Western Conference Final in 2018, he was determined to not let this opportunity slip away.\n“This time around a lot of us wanted to go out and support the team in Orange County,” Thompson said. “Despite the five-and-a-half-hour drive, there were various ways people made it happen.\n“One group rented a (passenger) van, we filled that up. A bunch of us carpooled, some people flew and some of us even got hotels. … There’s this feeling of like if you can be there, like you want to be there and it was a huge payoff.”\nDedication and sacrifice are essential aspects of fandom, as supporters within the group bear the sole responsibility for covering expenses linked to transportation, meals and lodging.\nFor supporters including Thompson and fellow Bandidos, the value of experiences surpasses any monetary cost.\n“When Cuello scored that game-winning goal in extra time and the whole team came to celebrate with us, you could feel the passion that was put out there by the supporters being felt by the team,” Thompson said. “But then, them also giving back to us and celebrating at the end, it just made it all completely worth it because yes, it does come out of your own pocket, but I feel like anything in life, experiences and memories to me are what I want to spend my money on and it was well worth it.”\nAs Saturday’s Western Conference Final approaches, the Bandidos hope to be a vital source of energy and motivation for a team on a quest to accomplish the remarkable California sweep of three, two and one seeds.\n“It helps a lot,” Rising defender Mohamed Traore said. “When you are playing, especially our last two games, it was very hard. If you turn your back and you see them keep pushing you, it will motivate you more to give them your all.”\nDefender John Stenburg added, “The support we got in OC and also in San Diego was really helping us. Especially going into extra time, you need some extra motivation like the fans cheering you on. It puts extra energy in the team. I can’t speak to that enough, it’s been amazing.”\nPlayers and staff may change, the supporters are here forever.\n“This is their club, This is not anyone else’s club.” Guerra said. “The coaches, players, owners, presidents, general managers, they come and go. At the end of the day, the supporter groups, the Bandidos, and all our fans, those are the ones that will stay here forever. So this club belongs to them and I can promise you that we’ll protect it as much as we can and we’re fighting every single day to try to make it successful.”",
  "word_count": 1802,
  "scraped_at": "2026-02-14T12:17:03.163617"
}