{
  "article_id": "c12e99fa9bda",
  "url": "https://www.nzherald.co.nz/world/us-election-how-donald-trump-won-and-how-kamala-harris-lost/U6OK6ZGQIZD55BJRM42PLJPKOY/",
  "title": "The one essential bet that paid off : How Trump won and Harris lost",
  "date": "20241107T234500Z",
  "domain": "nzherald.co.nz",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "He made one essential bet: that his grievances would become the grievances of the MAGA movement, and then the GOP, and then more than half the country. It paid off.\nDonald Trump’s chief pollster, Tony Fabrizio, had seen just about everything in his three races working for the controversy-stoking former President. But even he seemed to be bracing for bad news.\nTrump had just debated Vice-President Kamala Harris, repeatedly taking her bait, wasting time litigating his crowd sizes and spreading baseless rumours about pet-eating immigrants.\nFabrizio had predicted to colleagues that brutal media coverage of Trump’s performance in a debate watched by 67 million people would lift Harris in the polls. He was right about the media coverage but wrong about the rest. His first post-debate poll shocked him: Harris had gained on some narrow attributes, like likability. But Trump had lost no ground in the contest.\n“I’ve never seen anything like this,” Fabrizio said on a call with senior campaign leaders, according to two participants.\nIt was yet more proof – as if more were needed – of Trump’s durability over nearly a decade in politics and of his ability to defy the normal laws of gravity.\nHe overcame seemingly fatal political vulnerabilities – four criminal indictments, three expensive lawsuits, conviction on 34 felony counts, endless reckless tangents in his speeches – and transformed at least some of them into distinct advantages.\nHow he won in 2024 came down to one essential bet: that his grievances could meld with those of the Maga movement, and then with the Republican Party, and then with more than half the country. His mug shot became a bestselling shirt. His criminal conviction inspired US$100 million ($165m) in donations in one day. The images of him bleeding after a failed assassination attempt became the symbol of what supporters saw as a campaign of destiny.\n“God spared my life for a reason,” he said at his victory speech early Wednesday, adding, “We are going to fulfill that mission together”.\nAt times, Trump could be so crude and self-indulgent on the stump that aides wondered if he were engaged in an absurdist experiment to test how much aberrant behaviour voters would tolerate.\nBut Trump successfully harnessed the anger and frustration millions of Americans felt about some of the very institutions and systems he will soon control as the country’s 47th president. Voters unhappy with the nation’s direction turned him into a vessel for their rage.\n“The elites cannot come to grips with how alienated they are from the country,” said Newt Gingrich, the former House speaker, an informal adviser to the former and now future president.\nBut more than just broad societal forces were at play. His victory owed, in part, to strategic decisions by a campaign operation that was his most stable yet and was held together for nearly four years by a veteran operative, Susie Wiles – even if the candidate himself was, for much of 2024, as erratic as ever.\nThe Trump team schemed ways to save its cash for a final ad blitz, abandoning a traditional ground game to turn out its voters and relying instead on a relatively small paid staff buttressed by volunteers and outsiders, including the world’s richest man, Elon Musk. Trump relentlessly pushed to define Harris not just as radically liberal but as foolishly out of the mainstream. The inspiration, his advisers said, was a memorable Nixon-era saying by Republican strategist Arthur Finkelstein: “A crook” – or, in Trump’s case, a convict – “always beats a fool”.\nTrump’s aides gambled on mobilising men, though men vote less than women, and it paid off. And they gambled on trying to cut into Democrats’ typically big margins among black and Latino voters, and that paid off, too.\nHis close-knit campaign team navigated the hacking of a top official’s emails by Iranians, constricting security measures by US authorities following two assassination attempts and a final phase that included the use of multiple planes, in addition to the one with Trump’s name on it, to keep the former President safe.\nHow Trump won is also the story of how Harris lost.\nShe was hobbled by President Joe Biden’s low approval ratings and struggled to break from him in the eyes of voters yearning for a change in direction. She had only three-plus months to reintroduce herself to the country, and she vacillated until the end with how – and how much – to talk about Trump.\nFirst, she and her running mate, Tim Walz, tried minimising him by mocking him as “weird” and “unserious,” setting aside Biden’s grave warnings that Trump was an existential threat to American democracy. Then she focused on a populist message: Trump cared only about his rich friends, while she would bring down the prices of groceries and housing for ordinary people. Finally, late in the campaign, Harris pivoted again: Trump was a “fascist,” she warned – just the existential threat Biden had invoked.\nSome finger-pointing emerged from the wreckage, including over whether Harris had focused too much on appealing to wayward Republicans or whether Biden had dealt her an unwinnable hand. “We dug out of a deep hole but not enough,” David Plouffe, a senior Harris adviser, wrote on the social platform X.\nIn the end, Harris got only the one debate with Trump to make her case. He never accepted a rematch, and Harris’ team was left to wonder if they had missed a chance to box him in. During her debate preparations, they had discussed challenging him live onstage to a second debate – almost daring him to look afraid – but Harris decided against the move.\nThat meant no more national moments and eight weeks left to fill – a challenge for a candidate who had spent the first half of the race avoiding unscripted settings. Trump scored one break from the justice system when a judge pushed his September sentencing until after the election; Trump privately told people he thought that would have tested what voters would tolerate.\nNot every decision Trump made was genius because he won, and not every decision Harris made was poor because she lost. But in a race and in a nation so narrowly divided, Trump and his team made just enough of the right ones.\nThe strength of his convictions\nFor almost any other politician, Trump’s conviction on 34 felony counts related to hush-money payments to a porn actor would have been the worst day of his candidacy. Instead, it gave him financial rocket fuel.\nSmall donors poured US$50m ($83m) into his coffers in 24 hours. And his main super political action committee was informed by its bank of a US$50m wire transfer the day after the conviction – but needed to first confirm who had sent it first to make sure it wasn’t fraudulent. The problem was, they didn’t know because one of the biggest contributions in American history had been sent without any heads-up. Eventually, they determined the amount and its source: reclusive billionaire Timothy Mellon.\nThe US$100m ($166m) day helped narrow the financial chasm Trump had been facing.\nTo finance a late fusillade of television ads, his team had stretched legal limits to shunt tens of millions of dollars in expenses from the campaign on to the Republican Party and other groups. More significantly, once he became the presumptive nominee, they scrapped the traditional campaign-run, party-funded field operation and outsourced it instead to unproven super PACs.\nA scrub of the party’s books from 2020 by James Blair, the campaign’s political director, and Chris LaCivita, one of Trump’s co-campaign managers, found that the field operation had cost more than US$130m ($216m). That amounted to at least US$100 ($166) for each conversation with a voter.\n“We said we just simply can’t do that,” Blair recalled. “We just simply can’t spend that much money.”\nA surprise ruling from the Federal Election Commission, however, had allowed candidates for the first time to coordinate with billionaire-funded super PACs, and the Trump campaign quickly did so, though Blair was widely second-guessed by veteran operatives in both parties. No one knew how well those outside groups and their mercenary operatives would fare at persuading and motivating people to vote.\nThe Harris campaign had spent months hiring 2500 workers and opening 358 offices across the battleground states – enormous fixed costs the Trump campaign did not have to bear. Last weekend, some 90,000 Democratic volunteers knocked on more than 3 million doors, the pace reaching 1000 doors a minute in Pennsylvania at one point.\nPolls showed the race was one of the closest in modern history, and Harris’ team believed their superior infrastructure and army of believers would make the difference. But Fabrizio’s internal polling told a different and, it turned out, more accurate story – one in which Trump kept a consistent lead.\nA ground game only matters in an exceedingly close race. In the end, Harris did not come close enough.\nThe gender gap\nTrump had long been nervous about the issue of abortion.\nHe blamed the fallout from the Dobbs decision overturning Roe v. Wade for the GOP’s poor performance in the midterms in 2022. He considered the issue so politically fraught that it had the potential to single-handedly sink his campaign.\nAnd so, on the first Tuesday in April, he settled into his seat on the jet his aides call Trump Force One, a thick stack of papers before him on his desk. On top was a document his senior political advisers had prepared, spelling out a simple and compelling argument against his coming out in favour of a national abortion ban.\nThe title, in all caps: “How a National Abortion Policy Will Cost Trump the Election”.\nA 15- or 16-week ban – which Trump was seriously contemplating – would be more restrictive than existing law in Pennsylvania, Michigan and Wisconsin, the three “blue wall” states that were crucial to victory in November. The news media, his advisers told him, would relentlessly portray his position as rolling back the rights of women, who were already in revolt against the GOP over abortion.\nOn the flight to Grand Rapids, Trump began dictating the script of a video he would release the following week: He would leave the abortion issue to the states and would not say how many weeks he considered appropriate – disappointing some social conservatives but making it harder for Democrats to use the issue against him.\nTrump’s approach to gender could not have been more different from Harris’.\nHis team’s data clearly showed that the highest return on investment would be a group that didn’t often vote: younger men, including Hispanic and Black men who were struggling with inflation, alienated by left-wing ideology and pessimistic about the country.\nThe Trump campaign committed its limited resources, including the candidate’s time, to communicating with these young men, embracing a hypermasculine image. His first campaign stop after his criminal conviction was a UFC event. He entered the Republican National Convention one night to James Brown’s “It’s a Man’s Man’s Man’s World”. He spent relatively little time doing mainstream media interviews and instead recorded a series of podcast interviews with male comedians and other bro-type personalities who tapped into the kind of audiences Fabrizio’s data said were most receptive to Trump’s message.\nThey included a three-hour podcast with Joe Rogan that racked up more than 45 million views on YouTube and won Rogan’s election-eve endorsement. Aides and allies like Musk made explicit appeals to men to vote for Trump in the contest’s final hours.\nHarris’ team was trying equally hard to mobilise women in the first national election since the fall of Roe v. Wade, showcasing the stories of women who suffered catastrophic medical emergencies in states where Republicans had enacted strict abortion bans. Michelle Obama made an impassioned case to vote for women’s interests. And there were efforts to encourage wives to ignore their husbands, with sticky notes left in women’s restrooms reminding them that their vote was a secret. Actress Julia Roberts recorded an ad calling the ballot box one of the last places where women still had the freedom to choose.\nTrump was aghast. “Can you imagine a wife not telling a husband who she’s voting for? Did you ever hear anything like that?” he said on Fox News.\nBut Trump declined to call upon Nikki Haley, the runner-up in the Republican primaries, as an emissary to female voters. He didn’t think he needed her, and people close to him said he continued to thoroughly dislike her. “You have the issue of abortion,” he said on “Fox and Friends”. “Without abortion, the women love me.”\nTrump’s gamble on anti-trans ads\nAbout a week after the September debate, Trump started spending heavily on a television ad that hammered Harris for her position on a seemingly obscure topic: the use of taxpayer funds to fund surgeries for transgender inmates. “Every transgender inmate in the prison system would have access,” Harris said in a 2019 clip used in the ad.\nIt was a big bet: Trump was leading on the two most salient issues in the race – the economy and immigration – yet here he was, intentionally changing the subject.\nBut the ad, with its vivid tagline – “Kamala is for they/them. President Trump is for you” – broke through in Trump’s testing to an extent that stunned some of his aides.\nSo they poured still more money into the ads, running them during football games, which prompted Charlamagne Tha God, the host of The Breakfast Club, a popular show among black listeners, to express exasperation – and his on-air complaints gave the Trump team fodder for yet another commercial. The Charlamagne ad ranked as one of the Trump team’s most effective 30-second spots, according to an analysis by Future Forward, Harris’ leading super PAC. It shifted the race 2.7 percentage points in Trump’s favour after viewers watched it.\nThe anti-trans ads cut to the core of the Trump argument: that Harris was “dangerously liberal” – the exact vulnerability her team was most worried about. The ads were effective with black and Latino men, according to the Trump team, but also with moderate suburban white women who might be concerned about transgender athletes in girls’ sports.\nThose were the same suburban women Harris was trying to mobilise with ads about abortion.\nDemocrats struggled to respond. At one point, former President Bill Clinton told an associate, “We have to answer it and say we won’t do it.” He even raised the issue in a conversation with the campaign and was told the Trump ads were not necessarily having an impact, according to two people familiar with his conversations. He never broached the topic publicly.\nThe Harris team debated internally how to respond. Ads the Harris team produced with a direct response to the “they/them” ads wound up faring poorly in internal tests. The ads never ran.\nFor the Trump team, the transgender attacks – along with other ads showing Harris laughing or dancing in a colourful blouse and pink pants – fit into a broader Trump goal: to make her look like a lightweight.\nTrump was already running as a felon. In the eyes of his team, the transgender ads made her look unserious, foolish and outside the political mainstream.\nChange and Obama\nBy early October, the Trump team had been trying for weeks to blunt Harris’ efforts to portray herself as the change candidate.\nThe Trump team’s internal polling had showed Harris succeeding at portraying herself as a change agent in August. She had settled on the slogan “A New Way Forward” and was pressing a generational argument against Trump, who was vying to become the oldest man ever elected President.\nIt was one of the most worrying findings for the Trump team in the early weeks of her candidacy.\nThen she went on The View.\nIn what was otherwise an anodyne talk-show appearance, Harris was asked if she would have done something differently from Biden. She paused, then said, “There is not a thing that comes to mind”.\nIn their group texts, Trump advisers rejoiced. They were stunned Harris did not have a ready-made answer to such a foreseeable and strategically important question.\nBlair, the campaign’s political director, told the team they needed to get the clip seen by as many voters as possible.\nBy that afternoon, up to 10 million voters received text messages containing the clip on their cellphones. Television ads broadcast it to tens of millions more over the following weeks.\nHow Harris talked about Biden was clearly a problem for her. But so was how she talked about Trump.\nAt the Harris campaign headquarters in Wilmington, Delaware, which was never fully redecorated after the candidate swap, leaving conference rooms covered with images of Biden’s signature sunglasses, officials continued to debate how the Vice-President should attack the former President as the short campaign waged on. A broader group of strategists held three meetings on the subject in September and October.\nTrump’s approval ratings were getting rosier despite early predictions that voters would sour on him the more they saw of him.\nThe Harris campaign’s pollsters seemed to press for a label – “dangerous” – that echoed how Trump was trying to pigeonhole Harris ideologically. But the idea ran into opposition, including from Jen O’Malley Dillon, the campaign chair. In 2016, Hillary Clinton had tried to brand Trump as “Dangerous Donald,” but the tactic had flopped then.\nWeeks of deliberations left some participants on the Harris team frustrated and exhausted by the inability to reach a decision. Finally, they agreed on what campaign officials described as the “three U’s”.\nUnhinged, unstable, unchecked.\nAds featuring that tagline soon followed. But Democratic allies immediately began to second-guess the focus on Trump’s character. Those doubts grew after Harris called attention to a report that Trump’s former White House chief of staff had said Trump fit the definition of a fascist.\nRepublicans argued that calling Trump a fascist – as Harris indeed soon did herself – would not persuade anyone.\n“I’m sorry, we had him as president for four years; we know he’s not a Nazi,” said Representative Marjorie Taylor Greene of Georgia, a close Trump ally. “We know he’s not a fascist.”\nDays later, Harris travelled to the Atlanta area for her first rally with former President Barack Obama.\nHer campaign had already announced the location of her closing speech – the Ellipse, where on January 6, 2021, Trump had revved up the crowd that overran the Capitol – and it hinted at her intentions.\nObama had other ideas.\nIn a roughly 10-minute talk in a trailer on the campus of a high school, he urged Harris to infuse her closing argument with more of her biography, to tell the story of who she was in order to get across the kind of president she would be, according to three people briefed on the conversation.\nObama also spoke with Harris’ speechwriter, Adam Frankel, who had once worked for him. The share of the speech that focused on Trump ultimately shrank, two of the people said.\nOn the final Sunday evening of the campaign, at a rally in East Lansing, Michigan, Harris did not mention Trump once. It was the first time she had omitted his name from a speech at a campaign rally.\nTrump turbulence\nTrump was, as usual, demonstrating who was actually in charge.\nSeated aboard his plane in the late summer, he scribbled signed copies of his book for two of his advisers: Wiles, the woman who had led his 2024 campaign from the very first day, and Corey Lewandowski, who had just recently re-entered the fray after managing Trump’s 2016 race and getting fired from that job.\nTrump gave copies of the book to each and, in a characteristically over-the-top gesture, asked who got the first book and who got the second one. It was Wiles, then Lewandowski.\n“That’s the order,” Trump said. “One, two.”\nThat brief behind-the-scenes moment – establishing the pecking order that Wiles was in charge as his No 1 – captured the tensions that had been roiling the Trump operation.\nTrump had previously been listening to outside allies who suggested he needed a change and told some associates he feared people might be stealing from him. Lewandowski had come aboard in August and immediately embarked on a “forensic audit” of the books. He told some people he would be the campaign chair and began assembling a team of loyalists. (Lewandowski said he never heard the pecking-order comment from Trump and denied saying he would have that title.)\nThe senior team – and ultimately Trump – closed ranks around Wiles, but Lewandowski had nonetheless destabilised the Trump operation at one of its most vulnerable junctures. Trump’s original team would ultimately stay in charge through a white-knuckle finish.\nAt one particularly unmoored event, in Lititz, Pennsylvania, on the final Sunday, Trump said he should never have left the White House in the first place and mused approvingly about the prospect of reporters being shot.\nNumerous advisers, including Jason Miller and Wiles, were blunt that day, saying Trump had created a problem for himself, according to two people briefed on the discussions. Sean Hannity, the Fox News anchor and an old friend of Trump’s, called him and described how the speech was being received.\nTrump has long chafed at advisers’ efforts to contain him. The next day at a rally, he made a show of stopping himself after calling a young woman “beautiful,” asking aloud to strike it from the record. “So I’m allowed to do that, aren’t I, Susan Wiles?” he asked, in a rare use of her given first name.\nTrump’s capacity to resist handling kept his aides on edge right up to the end.\nIn the final 10 days, Trump promised to be the protector of women “whether they like it or not”. He called himself the “father of fertilisation”. He made a crack about Liz Cheney facing battle and standing with nine rifles “trained at her face”. His campaign put a comic’s racist set onstage at Madison Square Garden. And he diverted his campaign plane from the seven main battlegrounds where he had run nearly all his ads to make stops in New Mexico, Virginia and New York, simply because he wanted to.\nSome of the Harris team’s final measurements suggested his late wild antics were breaking through and that they believed voters were weighing them against the former President. The election results showed the opposite.\nThis article originally appeared in The New York Times.\nWritten by: Shane Goldmacher, Maggie Haberman and Jonathan Swan\nPhotographs by: Doug Mills, Todd Heisler, Kenny Holston and Erin Schaff\n©2024 THE NEW YORK TIMES",
  "word_count": 3789,
  "scraped_at": "2026-02-14T13:18:15.979898"
}