{
  "article_id": "c1590a035c68",
  "url": "https://kiow.com/2023/09/18/waldorf-to-leave-nsaa-for-gpac-in-2024-2025/",
  "title": "Waldorf to leave NSAA for GPAC in 2024 - 2025",
  "date": "20230918T204500Z",
  "domain": "kiow.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Waldorf to leave NSAA for GPAC in 2024-2025\nWaldorf University held a press conference Monday morning at the Boman Fine Arts Center in Forest City to announce they would be leaving the North Star Athletic Association and joining the Great Plains Athletic Conference starting in the fall of 2024.\nThe BFAC was packed with excited fans, staff, and community members waiting for the official announcement, which came from GPAC Commissioner, Corey Westrea:\nThe GPAC currently has 12 members in Iowa, Nebraska, South and North Dakota, making Waldorf the 13th when they officially start competition next year. Waldorf already competes against GPAC schools in most sports, including the football team, most years opening with Briar Cliff, which Westra says will become a conference game next year.Â\n“This is a great day for the Great Plains Athletic Conference and our member institutions,” said Corey Westra, GPAC Commissioner. “We are excited to welcome Waldorf University to our conference as our 13th member.” “Throughout the membership process, we have been very impressed with the university’s leadership and are looking forward to having the Warriors join our league next year.”\nWaldorf University President, Dr. Robert Alsop, stated that students will miss less class time with less travel.Â\nLess time on the road also means less money spent, and Alsop agreed that would benefit the university.Â\n“The Great Plains Athletic Conference (GPAC) is an affiliated conference of the National Association of Intercollegiate Athletics (NAIA), consisting of 13 private, faith-based colleges and universities in Nebraska, Iowa, South Dakota, and North Dakota”,Â according to a release on the conferences’ website.Â “Originally founded in 1969 as the Nebraska Intercollegiate Athletic Conference (NIAC), the league retains four of the six charter members – Concordia, Doane, Hastings, and Midland”.\nThe conference includes the following schools: Dordt (Sioux Center, Iowa), Concordia, Neb.; Northwestern (Orange City, Iowa), Doane, Neb.; Morningside (Sioux City, Iowa), Midland, Neb., Jamestown, North Dakota, Hastings, Neb., Mount Marty, South Dakota, Briar Cliff, (Sioux City, Iowa), Dakota Wesleyan, South Dakota, College of Saint Mary, Neb.Â\nWaldorf has all but two of the sports the GPAC conference offers: tennis and men’s volleyball. Waldorf Athletic Director Chad Gassman said that Waldorf isn’t ready to announce anything, but the conversation about men’s volleyball will be had. He said tennis was less likely but didn’t rule out the possibility in the future.Â\nWaldorf currently has one sport the GPAC doesn’t offer as a sponsored event – women’s wrestling. Westra stated that women’s wrestling will come to the conference next year when Waldorf joins, as the conference will have enough schools to offer the sport.\nAD Gassman mentioned multiple times that he was excited and explained why.\nThe full press conference can be watched at the top of the page.\nGPAC Release: https://www.gpacsports.com/general/2023-24/releases/202309181m7s3e",
  "word_count": 458,
  "scraped_at": "2026-02-14T13:51:02.800078"
}