{
  "article_id": "c15bff8d8a29",
  "url": "https://www.legit.ng/politics/1541879-president-tinubus-wife-meet-super-falcons-reason/",
  "title": "President Tinubu Wife to host Super Falcons , Gives Reason",
  "date": "20230630T110000Z",
  "domain": "legit.ng",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "President Tinubu's Wife to Host Super Falcons, Gives Reason\n- Nigeria's first lady, Oluremi Tinubu, will be meeting with the Super Falcons as the team prepares to depart for the FIFA Women's World Cup in Australia and New Zealand\n- The nine-time African champion is preparing for a 15-day camping programme in Australia before joining the tournament camp\n- Tinubu will host the team at the Trancorp Hilton Hotel in Abuja at an event organised by the NFF\nFCT, Abuja - Oluremi Tinubu, Nigeria's first lady, will meet with the Super Falcons alongside top government functionaries ahead of the team's departure for the FIFA Women's World Cup in Australia and New Zealand.\nAccording to Vanguard, the World Cup will be held for one month. It will kickstart on July 20 and end on August 20.\nTinubu's wife to host Super Falcons ahead of FIFA World Cup\nThe development was disclosed in a statement by the head of communications for the Nigeria Football Federation (NFF), Ademola Olajire, adding that the event, which was organised by the Nigeria football governing body, will be held on Saturday, July 1, at Transcorp Hilton Hotel in Abuja.\nPAY ATTENTION: Follow us on Instagram - get the most important news directly in your favourite app!\nJoining the ranks at the event would be the permanent secretary of the Federal Ministry of Sports and Youth Development, Ismaila Abubakar, alongside other top officials in the sports ministry.\nRank and files of the NFF's technical and administrative officials are expected to be led to the event by the body's president, Ibrahim Musa Gusau and the General Secretary, Mohammed Sanusi.\nWhy Remi Tinubu wants to host Super Falcons\nThe statement reads in part:\n“The event at the Transcorp Hilton Hotel will also attract corporate chieftains, members of the diplomatic corps and a range of football stakeholders.\"\nThe Super Falcon is a nine-time African champion and is expected to depart Nigeria for a 15-day camping programme in Australia before joining the tournament's camp, which will begin on July 20 and end on August 20.\n\"I would have participated in the arbitrage\": Tinubu speaks on fuel subsidy\nLegit.ng earlier reported that President Bola Tinubu said he has the privilege of participating in the fuel subsidy scam and ruining Nigeria's economy.\nHowever, the president said he would never be part of the saboteurs that kill the country's economy for personal gains.\nTinubu then charged Nigerians on the need to ensure that the necessary resources are mobilised to meet the needs of the common person.\nSource: Legit.ng",
  "word_count": 423,
  "scraped_at": "2026-02-14T12:27:51.615953"
}