{
  "article_id": "c1799ad43526",
  "url": "https://www.offalyindependent.ie/2025/11/12/eni-aluko-reacts-to-joey-barton-conviction-as-difficult-chapter-closes/",
  "title": "Eni Aluko reacts to Joey Barton conviction as  difficult chapter  closes",
  "date": "20251113T003000Z",
  "domain": "offalyindependent.ie",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Eni Aluko reacts to Joey Barton conviction as ‘difficult chapter’ closes\nBy Andy Hampson, PA\nEni Aluko has spoken of her pride and relief after Joey Barton was found guilty of sending grossly offensive social media posts about her and other broadcasters.\nBarton, the former Manchester City and Newcastle midfielder, was convicted last Friday.\nA jury at Liverpool Crown Court found Barton had “crossed the line between free speech and a crime” with six posts he wrote on X about Aluko, her fellow TV football pundit Lucy Ward and broadcaster Jeremy Vine.\nFormer England striker Aluko told the PA news agency: “I feel great, I feel a sense of relief that difficult chapter is all over.\n“I have always been very clear about making sure there are consequences for that type of conduct online, because it is bullying.\n“It was never going to be something I tolerated. I am very proud of being able to stand up to that and show that’s not something we are going to tolerate in the UK and in society.”\nBarton, who was cleared on six other counts of sending grossly offensive electronic communication with intent to cause distress or anxiety, will be sentenced on December 8th.\nAluko said: “Sometimes it can be difficult because sometimes you want to be left alone without all the scrutiny of everything you say.\n“I’m a human being and I’m not perfect. I don’t always get it right, but I think what you can always do in the public eye is stand by your values and stand up for what you believe it, don’t be swayed by that.\n“That’s what I’ve tried to do in what’s been a difficult case and I hope, moving forward, people recognise that online abuse, bullying, sexism, racism – we’re not going to tolerate it, we’re not going to have it in a civilised, tolerant, inclusive society and inclusive sport.”\nAluko was speaking in Manchester as she was inducted into the Hall of Fame at the National Football Museum.\nThe 38-year-old, who earned 104 England caps and whose career included stints with Chelsea and Juventus, was recognised for her on-field achievements and pioneering role in the women’s game.\nShe said: “There is always good news round the corner and to come out of that last week, a difficult week that ended well, and to be here now being recognised, I am very happy and very pleased.\n“It shows you will go through things in life that are difficult but it shapes you. You come out the other end of it and people recognise you for how you stood up and how you stood by your principles and values.”\nShe added: “I feel honoured. It’s a big recognition for the journey and I just want to keep doing the honour justice.”",
  "word_count": 466,
  "scraped_at": "2026-02-14T12:59:08.151023"
}