{
  "article_id": "c1a0dd433373",
  "url": "https://news.yahoo.com/everyone-wants-see-us-fail-110021819.html",
  "title": "  Everyone wants to see us fail : How Erin Cuthbert drives Chelsea to stay on top",
  "date": "20230510T113000Z",
  "domain": "news.yahoo.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "‘Everyone wants to see us fail’: How Erin Cuthbert drives Chelsea to stay on top\nHilariously, the certainty came amid the confusion. “What age am I?” Erin Cuthbert asks, turning to Chelsea’s baffled media officer. “Get it on Wikipedia. I actually don’t know.” After a quick check, the answer turned out to be 24. “Aye,” Cuthbert accepted. “I turn 25 this year, in a couple of months.” So, as the question before put, are you coming into your prime? The reply was quick and decisive. “No. I haven’t yet,” Cuthbert says. “I know there’s more to give.”\nYet open up Chelsea’s trophy-winning machine under Emma Hayes and at its heart you will likely find the Scotland international, whirring away along with the cogs and gears and various parts. After last season’s FA Cup final win against Manchester City, Hayes declared her wish to have a squad of twenty Erin Cuthberts. The versatile midfielder had been awarded player of the match at Wembley, as much for her relentless drive to push Chelsea on in extra time than her strike to light up the final.\n“What a moment that was,” Cuthbert grins, and what a goal it was too, “especially when it comes down off the crossbar.” Chelsea return to Wembley on Sunday to face a new opponent in Manchester United - as well as what is expected to be a record crowd of almost 90,000, the highest ever for a women’s club match in England. Often with Cuthbert, the biggest contributions are saved for the biggest moments. “I would love to be the difference-maker,” she says, too humble to add “again”.\nChelsea too hope to find themselves in a familiar position. Last year, Hayes’s side won their final 12 games of the season to win the Women’s Super League and FA Cup double. They were perfect over the run-in, and needed to be in order to beat Arsenal to the title and edge City at Wembley. Now Chelsea face the same opponent on both fronts, Manchester United, as well as the same task. With the finish line in sight, the objective is clear: beat United on Sunday and they’ll claim a third FA Cup in a row. Carry that on and win their remaining league games (starting tonight against Leicester) and they will add a fourth consecutive WSL crown.\nThe challenge is both a physical and mental one. With games every three to four days and a squad hit by injuries, including to key players like Fran Kirby and Millie Bright, the demands have been heightened, the stakes too. Yet Chelsea have been here before. “Last year I didn’t sleep a wink in the final weeks of the season,” Cuthbert recalls. “I’m sleeping like a baby this time.” That isn’t to say the pressure is less, though. A requirement of playing under Hayes is fuelling the fire to go again, even as the competition for trophies gets tougher. “It feels like the first time,” Cuthbert adds. ”I’m driven as ever, motivated as ever. If I didn’t have the same drive and determination I wouldn’t be at this football club any more.”\nCuthbert helps to set the standard. If Hayes was to create a team in a laboratory you would likely find Cuthbert’s DNA running through the side, but the Scotland international needed to be patient to get her chance - first with a regular run in the team, and now with a regular run in the same position. “I put my head down, worked hard and waited for the opportunities,” Cuthbert says. After spells as a forward and at wing-back, where Cuthbert was praised for her versatility as well as her application, she has nailed down her preferred role in the centre of midfield. It was still relatively new at the end of last season, when Cuthbert produced her standout performance in the FA Cup final, but there is no doubt that it is the area of the pitch where she can excel and exert the greatest influence.\nIt is there where Cuthbert typifies Chelsea. Or perhaps it’s vice versa. After all, they share a number of dogged qualities, which can be traced back to Curthbert’s journey from Crosshouse Boys Club. Cuthbert’s fierce introduction to 11-a-side made it clear that football is as much about having the right attitude than ability. “There are certain players you want in battle and being from Scotland, a young girl from Ayrshire who has had to work for everything, I understand and I get it,” she says. “I want to be on that battlefield fighting for everyone else. We are all good football players, but it’s who wants to win the battle, who has the mentality, who has the mettle to give everything when you can’t give anything more.”\nLast year’s FA Cup final epitomised Chelsea’s grit - “I think just resilience, we never gave up” - but then came something that was arguably even greater. When Chelsea salvaged a miracle escape to stun Lyon and defeat the Champions League holders on penalties at Stamford Bridge, Cuthbert burst into tears, taking big, sobbing gulps at the drama her team had produced. “Nothing comes close to that feeling,” Cuthbert says. “This dressing room, we always seem to find a way. Even if we don’t have the answers, we go out and find them.”\nThe Lyon victory gave Chelsea a lift. Their season needed one, following defeats to Arsenal in March’s Continental Cup final and then Manchester City in the WSL, but knocking out Lyon in the manner in which they did gave Chelsea a reminder of who they are. Even after their exit to Barcelona, Chelsea’s performance in the Nou Camp offered belief and injected energy ahead of the run-in. “It was a turning point,” Cuthbert said. “We haven’t let the Champions League exit derail our league season, or the Conti Cup. Everyone thought, ‘That’s it, Chelsea are falling apart, here we go’. Everyone wants to see us fail but the greatest thing about this team is we bounce back and show ourselves in big moments.”\nCuthbert is increasingly decisive in those situations. The 24-year-old does not score often, but her goal contributions tend to frequently arrive at crucial times. Chelsea’s approach to big games plays into it. Hayes will often ask her side to sit deep and absorb pressure before striking on the counter-attack, where Cuthbert - as a ferocious presser - can help to make the difference. Her stunning assist for Guro Reiten to break the deadlock in Lyon came from such a position, as did last season’s screamer against City at Wembley.\nNow Chelsea must go again, and against a United team under Mark Skinner who are hungry to lift the club’s first major title. For Chelsea, having the right attitude to match United’s on their historic occasion will be as important as their tactical plans. The holders have a target on their backs. “It’s our job to prove we are still at the top,” Cuthbert says. “Trying to remain there is probably the hardest thing. It requires you to adapt and change the way you play a little bit - because everyone starts to figure you out. It’s hard and requires a lot of training and mental toughness.” And in the middle of the Wembley battlefield on Sunday, it will be Cuthbert who reinforces that message.",
  "word_count": 1224,
  "scraped_at": "2026-02-14T12:21:57.706603"
}