{
  "article_id": "c1be0f731699",
  "url": "https://www.dailybreeze.com/2026/01/22/out-about-things-to-do-in-the-long-beach-south-bay-areas-jan-23-29/",
  "title": "Out & About : Things to do in the Long Beach , South Bay areas , Jan . 23 - 29",
  "date": "20260122T183000Z",
  "domain": "dailybreeze.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Friday\nCommunity Roundtable: Discussion will explore how insurance delays and denials can affect cancer treatment decisions. Cancer Support Community South Bay, 2601 Airport Drive, Torrance. 12:30-1 p.m., lunch. 1-2 p.m., community roundtable. Advance registration is required. To register, visit CSCSouthBay.org and select the online calendar. Information: Kari Wendt, Kari@CSCSouthBay.org.\nMixtape Confessions & Wake (the f*ck) Up: Presented by The Studio Collaborative. Long Beach Playhouse Studio Theater, 5021 E. Anaheim St. 8 p.m. Also 8 p.m. Jan. 24 and 2 p.m. Jan. 25. $20. 562-494-1014, lbplayhouse.org.\nThe Parables Tour: With Father Mike Schmitz. Terrace Theater, 300 E. Ocean Blvd. 7 p.m. Starting at $301. shorturl.fm/LsAGX.\nSaturday\n1st Annual Wildwood Mile: For girls and women. Mira Costa High School Waller Football Stadium, 1401 Artesia Blvd., Manhattan Beach. 5 p.m. $10. Register day of event at 4 p.m. 310-720-5832, wildwoodrunning.org/wildwood-mile.\nBark Reading Dogs: “Books, Authors and Writing.” Presented by Long Beach Public Library. Los Altos Neighborhood Library, 5614 Britton Drive. 11:30 a.m.-12:30 p.m. 562-570-1045, longbeach.gov/library.\nBe Pawsitive: Health and wellness. Presented by Long Beach Public Library. Billie Jean King Main Library, 200 W. Broadway. 2-3:30 p.m. 562-570-7500, longbeach.gov/library.\nBook Launch Celebration: “El Segundo’s Little Secret … What Happened to the Blues” by author Cara King and illustrator Sarah Spraggins. Presented by El Segundo Blue Butterfly Conservancy. El Segundo Public Library, 111 W. Mariposa Ave. 11 a.m. Book available for $15 donation. 310-524-2728, elsegundobluebutterflyconservancy.org.\nCalifornia Native Plants 101: Lecture series. Presented by Long Beach Public Library. Harte Neighborhood Library, 1595 W. Willow St. 2-3:30 p.m. 562-570-1044, longbeach.gov/library.\nDavid Lynch 80th Birthday Celebration: Gardena Cinema, 14948 Crenshaw Blvd. 1 p.m. $17.85. shorturl.fm/ODQiI.\nExhibition Opening Reception: “This Side of the Truth” by Coulter Jacob. Long Beach Museum of Art, 356 E. Third St. 5-10 p.m. RSVP at shorturl.fm/DUdz7.\nFestival of Human Abilities: Presented by Aquarium of the Pacific, 100 Aquarium Way. 9 a.m.-5 p.m. Also 9 a.m.-5 p.m. Jan. 25. Free with cost of admission. $34.95-$44.95. 562-590-3100, aquariumofpacific.org.\nForgiveness of Self (virtual): Spirituality workshop. Presented by Mary and Joseph Retreat Center. 10 a.m.-noon. $45. 310-377-4867, ext. 250, maryjoseph.org.\nMakerBoard Machina Cardboard Automata: STEM and STEAM. Presented by Long Beach Public Library. Michelle Obama Neighborhood Library, 5870 Atlantic Ave. 1-2 p.m. 562-570-1047, longbeach.gov/library.\nNew Year Sekku: Earl Burns Miller Japanese Garden, 1250 Bellflower Blvd. 1-3 p.m. $5-$10. shorturl.fm/gh1LO.\nNo Hard Feelings Tour: Featuring comedian Gary Owen. Terrace Theater, 300 E. Ocean Blvd., Long Beach. 10 p.m. Starting at $54. shorturl.fm/3Dfld.\nOutdoor Volunteer Day: Presented by Palos Verdes Peninsula Land Conservancy. Lunada Canyon Nature Reserve Agua Amarga, 29200 Rock Park Drive, Rancho Palos Verdes. 9 a.m.-noon. 310-541-7613, pvplc.org.\nNative Garden Tour Experience: Presented by Palos Verdes Peninsula Land Conservancy. White Point Nature Preserve, 1600 W. Paseo Del Mar, San Pedro. 11-11:30 a.m. 310-541-7613, pvplc.org.\nNative Plant Sales: Presented by Palos Verdes Peninsula Land Conservancy. White Point Nature Education Center, 1600 W. Paseo Del Mar, San Pedro. 10:30 a.m.-noon. 310-541-7613, pvplc.org.\nSew It Goes: “Travel Bags and Custom Embroidery.” Presented by Long Beach Public Library. Billie Jean King Main Library, 200 W. Broadway. 1-4 p.m. 562-570-5756, longbeach.gov/library.\nStaying Connected: Video calling and social media basics. Presented by Long Beach Public Library. Billie Jean King Main Library, 200 W. Broadway. 12:30-2:15 p.m. 562-570-6226, longbeach.gov/library.\nWandering Jews Hike: Saturday afternoon hikes on the Palos Verdes Peninsula. Most hikes are easy or moderately difficult, taking 1-2 hours. Adults, kids, seniors and dogs are welcome. Information: wanderingjewscnt@gmail.com for the meeting time and place.\nWhat the Constitution Means to Me: Written by Heidi Schreck. Presented by Torrance Cultural Arts Foundation. James Armstrong Theater, 3330 Civic Center Drive. 8 p.m. Also 2 p.m. Jan. 25. $25-$35. 310-781-7171, torrancearts.org.\nZaferia Heights Neighborhood Association Community Cleanup: Location at 1435 Orizaba Ave., Long Beach. 8 a.m.-noon. 562-570-2797.\nSunday\nAnimation Mixtape: Presented by Don Hertzfldt. Gardena Cinema, 14948 Crenshaw Blvd. 3, 5, 7 and 9 p.m. $14.64. shorturl.fm/TvM55.\nChildren’s Workshop: “Chromatography Creatures and Landscapes.” Museum of Latin American Art, 628 Alamitos Ave., Long Beach. 1-3 p.m. 562-437-1689 or RSVP at shorturl.fm/5FU6R.\nCorner Garden Plein Air Workshop: Micron pens on paper. Museum of Latin American Art, 628 Alamitos Ave., Long Beach. 9-11 a.m. $5. 562-437-1689 or RSVP at shorturl.fm/QHeYf.\nDrumming Circle: Redondo Beach Center for Spiritual Living, 907 Knob Hill Ave. 12:30 p.m. 310-540-5080, office@redondocsl.org.\nLunar New Year Celebration: Presented by Peninsula Library Friends Foundation. Peninsula Center Library, 650 Deep Valley Drive, Rolling Hills Estates. RSVP and register at plffoundation.org.\nOutdoor Volunteer Day: Presented by Palos Verdes Peninsula Land Conservancy. White Point Nature Education Center, 1600 W. Paseo Del Mar, San Pedro. 9 a.m.-noon. 310-541-7613, pvplc.org.\nRomantic Classics: Featuring world-renowned violinist Andres Cardenes. Presented by Beach Cities Symphony Association. Redondo Union High School, 1 Sea Hawk Way. 5-6:30 p.m. RSVP at bit.ly/3WmVaj7.\nSouth Bay Chamber Music Society: Featuring the Debussy Trio. Pacific Unitarian Church, 5621 Montemalaga Drive, Rancho Palos Verdes. 3 p.m. sbcms.net.\nTorrance Antique Street Faire: Come enjoy the hunt for vintage treasures when more than 200 sellers transform the streets of downtown Torrance into an eclectic open-air antique flea market. At 1317 Sartori Ave. 8 a.m.-3 p.m. 310-328-6107.\nYacht Rock Gold Experience: With special guest Elliot Lurie. Carpenter Performing Arts Center, 6200 E. Atherton St., Long Beach. 3 p.m. $58.75. 562-985-7000, carpenterarts.org.\nMonday\nCommunity Program (virtual): “Stress and Mental Health: Understanding Its Impact on Individuals and Families.” Presented by NAMI South Bay. 7:30 p.m. Zoom. Meeting ID: 897-6003-5176. Passcode: 327697.\nConversational Spanish: Presented by Peninsula Seniors. Scriba Family Center, 602 Deep Valley Drive, Rolling Hills Estates. 1:45-3 p.m. 310-377-3003, pvseniors.org.\nSouth Bay Camera Club: “Route 66,” featuring Justin Tedford. Torrance Airport Administration Building, 3301 Airport Drive. 7 p.m. For Zoom link: sbccphotos.org or donstouder@ca.rr.com.\nWoodwind Faculty Recital: Presented by Bob Cole Conservatory of Music. Daniel Recital Hall, 1250 N. Bellflower Blvd., Long Beach. 7:30 p.m. shorturl.fm/zAXqb.\nTuesday\nDementia Caregiver Support Group: Presented by Beach Cities Health District. Joslyn Community Center, 1601 N. Valley Drive, Manhattan Beach. 1:30 p.m. 310-374-3426, Opt. 1.\nDocent Orientation (virtual): Nature Education Program. Presented by Palos Verdes Peninsula Land Conservancy. 6-7:30 p.m. 310-541-7613, pvplc.org.\nOpen House: Academy of the Arts, 2108 Vail Ave., Redondo Beach. 7 p.m. 310-214-4999, or RSVP at shorturl.fm/t9JMY.\nTaize Service of Healing and Wholeness: St. Francis Episcopal Church, 2200 Via Rosa, Palos Verdes Estates. 7 p.m. 310-375-4617.\nYoga Class: With Dayna Lemieux. Redondo Beach Center for Spiritual Living, 907 Knob Hill Ave. 11 a.m.-noon. $10 per class. 310-540-5080, office@redondocsl.org.\nWednesday\nAnthology Reading: Presented by PV Writes Together and Palos Verdes Library District. Peninsula Center Library, 701 Silver Spur Road, Rolling Hills Estates. 6-7 p.m. 310-377-9584, pvld.org.\nBohannon Lecture Series: “Primed for Paddy Hirsch,” featuring author and journalist Paddy Hirsch. Scriba Family Center, 602 Deep Valley Drive, Rolling Hills Estates. 10:30-11:30 a.m. 310-377-3003, pvseniors.org.\nCentering Prayer Group (virtual): Improving our relationship with God. Presented by Mary and Joseph Retreat Center. 7:30 p.m. 310-377-4867, maryjoseph.org.\nCollege 101: Presented by Redondo Beach Public Library. Main Library, 303 N. Pacific Coast Highway. 4-5 p.m. 310-318-0675, library.redondo.org.\nLong Beach Young Professionals Networking: Presented by Long Beach Area Chamber of Commerce. El Barrio Cantina1731 E. Fourth St. 5:30-7:30 p.m. $15 for members; $35 for non-members. Register at shorturl.fm/1iVoZ.\nVirtual Author Talk: “The Good of the Woods” with Liz Moore. Presented by Long Beach Public Library. 4-5 p.m. 562-570-6128, longbeach.gov/library.\nThursday\nAnnual Business Expo/Networking Mixer: Presented by San Pedro Chamber of Commerce. Crafted at the Port of Los Angeles, 112 E. 22nd St., San Pedro. 4:30-7:30 p.m. shorturl.fm/v9bf2.\nUpcoming\nFC Barcelona Soccer Camp: Toyota Sports Complex, 555 Maple Ave., Torrance. July 6-10. Register at fcbarcelona.us/locations/los-angeles. Use the code FCBLASOUTH50 to enjoy a $50 discount on your registration.\nOngoing\nArt of Wood Carving: Presented by California Carvers Guild. Meets from 8 a.m. to noon every Monday and Wednesday. Senior Center, 1150 E. Fourth St., Room 207, Long Beach. 562-570-3500.\nBlankets of Love: Weekly knitting/crocheting baby blankets for those in need in the L.A. area. Joslyn Center, 1601 N. Valley Drive, Manhattan Beach. 3-5 p.m. Thursdays. blanketsoflovesouthbay.com.\nBook Sales: Hosted by Peninsula Library Friends Foundation every first Friday to Sunday (10 a.m.-5 p.m) of the month at Peninsula Center Library, 701 Silver Spur Road, Rolling Hills Estates. Every third Friday and Saturday (10 a.m.-5 p.m.) at Malaga Cove Library, 2400 Via Campesina, Palos Verdes Estates. 310-377-9584, ext. 253. Malaga Cove Library: 310-377-9584, ext. 553, pvldfriends.org.\nClub of Harps: The harmonica club for all skill levels meets every Wednesday and Thursday at the Long Beach Senior Center, 1150 E. Fourth St. 1:30-3 p.m. Information: clubofharps.org.\nDance Fitness: With Ziann. Lincoln Park, 101 Pacific Ave., Long Beach. 1-2 p.m. Fridays. 562-570-3551.\nDepression and Bipolar Support Alliance: Peer-based support group for people dealing with mood disorders. Meetings are available on Zoom and in person. Information: Scott, 310-497-8801 or woodscott516@yahoo.com; Peggy, 310-548-3457; or dbsasouthbay.org.\nGo Back For Murder: By Agatha Christie and directed by Philip Brickey. Long Beach Playhouse Mainstage Theater, 5021 E. Anaheim St. $20-32. Runs through Feb. 7. 562-494-1014, lbplayhouse.org.\nJulius Caesar: Presented by Long Beach Shakespeare Company. Helen Borgers Theatre, 4250 Atlantic Ave. $31.50; $21.50 for students. Runs through Feb. 7. 562-997-1494, lbshakespeare.org.\nLost in Yonkers: By Neil Simon. Presented by Kentwood Players. Westchester Playhouse, 8301 Hindry Ave., Los Angeles. Runs through Feb. 7. $21-$25. 310-645-5156, kentwoodplayers.org.\nMindfulness Class for Kids: Offered by Redondo Beach Center for Spiritual Living, 907 Knob Hill Ave. Through free play, art, guided visualization and affirmation, kids are taught the power they already have within themselves to create a life they love. 11 a.m.-noon Sundays. Information: 310-540-5080 or office@redondocsl.org.\nNAMI South Bay: Family and peer support groups for mental illness are meeting virtually at this time. Information on times and dates: namisouthbay.com; or Paul Stansbury, pstans5@aol.com.\nRiley’s Red Wagon: Book swap open daily (unless it’s raining). 9 a.m. until dark. 3040 E. First St. First-time guests can have five free books. justinrudd.com/cat.html.\nShoreline Speaker’s Toastmasters: For more than 30 years, Shoreline Speakers Toastmasters has provided a supportive and positive environment for people to become confident public speakers and strong leaders. Visitors are welcome. 7-8 a.m. every first and third Wednesday on Zoom. Information and to receive a meeting link: jgrobaty@gmail.com.\nSocial Skills Classes: For adolescents and young adults. Presented by We Are Team Us. Social weekly sessions, 4-5 p.m. Mondays. PEERS for Adolescents, 4-5:30 p.m. Wednesdays. Hermosa Beach Community Center, 710 Pier Ave. Information: 424-241-0058, contact@weareteamus.co or weareteamus.co.\nSouth Bay Film Society Showing: “Late Shift.” AMC Rolling Hills, 2591 Airport Drive, Torrance. 7-8:30 p.m. Wednesday, Jan. 14. southbayfilmsociety.com.\nTango Lesson: With Sharna. Altar Society Brewing and Coffee Company, 230 Pine Ave., Long Beach. 6:45 p.m. every Wednesday. sharnafabiano.com/tango.\nToastmasters Club 280: Levy Torrance Adult School, 3420 W. 229th Place. 7 p.m. Wednesdays. 310-532-1209.\nTOPS (Long Beach): Take Off Pounds Sensibly. Bolivar Park, 3300 Del Amo Blvd., Lakewood. 6-7:30 p.m. Mondays. 562-278-5603.\nTOPS (South Bay): Take Off Pounds Sensibly. The Harbor Church, 25401 S. Western Ave., Lomita. 7 p.m. Tuesdays. 310-378-2920.\nTrivia Night: The Bungalow, 6400 E. Pacific Coast Highway, Long Beach. 7 p.m. every Thursday. thebungalow.com/long-beach.\nWelcome Orientation: Presented by Cancer Support Community South Bay. Participants will be given a virtual tour of the community and learn about the many free programs that CSC South Bay offers for cancer patients and their loved ones. To register for this virtual meeting, visit CSCSouthBay.org and select the online calendar. 11 a.m. every Monday and Friday. Information: Norma Gonzalez, cancer support navigator, Norma@CSCSouthbay.org or 310-376- 3550.\nYarn Angels South Bay: A charity group that crochets/knits/quilts/sews articles for multiple local charities. Meets second and fourth Monday of the month at St. Mark’s Presbyterian Church, 24027 Pennsylvania Ave., Lomita. 6-8 p.m. New members and yarn/fabric donations are welcome. Information: yarnangelssb@gmail.com or yarnangels.wix.com/yarnangelssouthbay.\n– Compiled by Robert Doss\nSend calendar announcements two weeks prior to the scheduled event to calendar@dailybreeze.com.",
  "word_count": 1949,
  "scraped_at": "2026-02-14T12:53:50.541416"
}