{
  "article_id": "c1c97bcf883d",
  "url": "https://www.thenationalnews.com/news/us/2025/07/28/hate-crime-killer-of-palestinian-american-boy-dies-behind-prison-bars/",
  "title": "Hate - crime killer of Palestinian - American boy dies behind prison bars",
  "date": "20250728T171500Z",
  "domain": "thenationalnews.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "A bigoted landlord sentenced to decades in prison after he killed a Palestinian-American boy and wounded his mother has died.\nThree months ago, Joseph Czuba was sentenced to 53 years behind bars for the attack. He was found guilty in February of murder, attempted murder and hate crime charges in the death of six-year-old Wadee Alfayoumi and the wounding of the boy’s mother, Hanan Shaheen.\nCzuba, 73, targeted them in October 2023 because of their Islamic faith and as a response to the war between Israel and Hamas.\nCzuba died last Thursday in the custody of the Illinois Department of Corrections, according to a statement from the Will County Sheriff’s Office.\nEvidence at trial included testimony from Ms Shaheen and her frantic 911 call, along with photos and police video of a bloody crime scene. Jurors deliberated less than 90 minutes before reaching a verdict.\nThe family had been renting rooms in Czuba’s home in Plainfield, about 64km south-west of Chicago, when the attack happened.\nMs Shaheen said Czuba attacked her before moving on to her son, insisting they had to leave because they were Muslim. Prosecutors also played the 911 call and showed police video.\nCzuba’s wife, Mary, whom he had divorced, also testified for the prosecution, saying he had become agitated about the Israel-Hamas war, which had erupted days earlier.\nPolice said Czuba pulled a knife from a holder on a belt and stabbed the boy 26 times, leaving the knife in his body. Some of the crime scene photos were so graphic that the judge agreed to turn television screens showing them away from the public gallery, which included Wadee’s relatives.\nThe attack renewed fears of anti-Muslim discrimination and hit particularly hard in Plainfield and surrounding suburbs, which have a large and established Palestinian community. Wadee’s funeral drew large crowds, and Plainfield officials have dedicated a park playground in his honour.",
  "word_count": 314,
  "scraped_at": "2026-02-14T12:12:27.400082"
}