{
  "article_id": "c1da4d41bc64",
  "url": "https://huskers.com/news/2025/12/13/vb-preview-regional-final-vs-6-texas-aandm",
  "title": "VB Preview : Regional Final vs . # 6 Texas A & M",
  "date": "20251213T191500Z",
  "domain": "huskers.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "PREVIEW\n• The top-ranked Nebraska volleyball team hosts an NCAA Regional Final for the third straight year at John Cook Arena at the Bob Devaney Sports Center on Sunday.\n• No. 1 Nebraska will face No. 6 Texas A&M at 2 p.m. on ABC. Courtney Lyle and Holly McPeak will be on the call with Madison Fitzpatrick as the sideline reporter.\n• Huskers Radio Network will broadcast all the action on their volleyball affiliate stations, on Huskers.com and on the Huskers App. John Baylor and Lauren Cook West will be on the call.\nABOUT THE HUSKERS\n• Nebraska (33-0) finished the regular season unbeaten for the third time in school history (1994 and 2000), dropping only seven sets overall and one in Big Ten play.\n• Nebraska’s 33 straight wins is the second-longest win streak in school history in the NCAA era. The Huskers have won at least 33 matches in three straight seasons.\n• The Huskers also hold a nation-leading home court win streak of 63 matches, tied for the second-longest home win streak in program history. Nebraska has won 29 consecutive NCAA Tournament matches played in the Devaney Center, a school record.\n• The Huskers won their third straight Big Ten title with a perfect 20-0 record in conference play. It was the Huskers’ first unbeaten conference season since 2004 in the Big 12.\n• Nebraska has now won 37 conference titles all-time, including six in the Big Ten (2011, 2016, 2017, 2023, 2024, 2025).\n• The Huskers have won three straight conference titles for the first time since 2004-08.\n• Dani Busboom Kelly became the first volleyball coach in Big Ten history to win the conference title in their first year as head coach at the school. John Cook won a Big Ten title at Nebraska in his first year in the conference in 2011, but it was his 12th season as head coach at Nebraska at the time.\n• Nebraska has hit over .400 nine times this season, a school record in the rally-scoring era.\n• Nebraska is 95-0 this season in sets when reaching the red zone (20 points) first.\n• The Huskers have won 48 consecutive sets at home, tied for the second-longest streak in school history, trailing only the 52 consecutive home sets won spanning the 2001-02 seasons.\n• NU’s offense ranks first nationally with a .355 hitting percentage. The Huskers haven’t hit better than .300 in a season since 2007 (.327). The school record for hitting percentage in a season is .331 in 1986.\n• The Huskers rank first nationally in opponent hitting percentage at .121. NU led the nation in opponent hitting percentage in 2022 and 2023 and was sixth in 2024.\n• The gap between Nebraska’s hitting percentage and opponent hitting percentage is .234, by far the best in the nation. The next closest are American (.149), Pittsburgh (.145) and Wisconsin (.144).\n• Nebraska ranks fourth nationally in kills per set at 14.69.\n• The Huskers are seventh nationally in assists per set at 13.47.\n• Nebraska ranks 16th nationally with 2.74 blocks per set.\n• Over the last five seasons (2021-25), Dani Busboom Kelly has a 153-15 record for a .911 winning percentage, which is the best by any Division I head coach in that span.\n• Nebraska is 13-0 against ranked opponents this season. The 13 victories against ranked opponents are tied for second in school history, one shy of the school record (14 in 1998).\n• Nebraska played 24 sets in the month of October and went 24-0. In only two sets did an opponent reach 20 points (at Purdue - 23 in set one, and at Michigan State - 20 in set three).\n• Nebraska swept 15 matches in a row and won 48 sets in a row from late September through mid-November. Both were the longest such streaks since the 2007 team swept 17 matches in a row and won 53 sets in a row.\nNCAA TOURNAMENT NOTES\n• With the win over Kansas, Nebraska advanced to an NCAA Regional Final for the 34th time in program history. The Huskers’ 34 regional final appearances are the most in NCAA history. Nebraska has made an NCAA Regional Final in 13 of the past 14 seasons.\n• With the win, Nebraska improved to 137-38 all-time in the NCAA Tournament. The Huskers rank second in NCAA history in postseason wins and winning percentage (.783).\n• Nebraska improved to 34-7 all-time in NCAA Regional Semifinal matches, including a 17-1 record in matches played in Lincoln.\n• The Huskers improved to 90-7 all-time in home NCAA Tournament matches, including a 35-2 record at the Devaney Center.\n• Nebraska has won 90 home matches in the NCAA Tournament while only four other schools have 90 or more total victories in the NCAA Tournament.\n• Nebraska won the first two sets and is now 106-2 all-time in the NCAA Tournament when taking a 2-0 lead.\n• The Huskers held Kansas to fewer than 15 points in all three sets. That marked the second time this season that Nebraska has held its opponents to fewer than 15 points in every set, with both occurrences coming against top-25 teams (also against No. 25 Penn State on Nov. 28).\nROTATION RUNDOWN\n• Junior setter Bergen Reilly orchestrates the balanced Husker attack with 10.41 assists per set and is an AVCA Player of the Year Semifinalist. Reilly was named Big Ten Player of the Year and Big Ten Setter of the Year, as well as All-Big Ten First Team and AVCA All-Region for the third time.\n• Behind Reilly’s setting, the Huskers are on pace for a single-season school record with a .355 team hitting percentage, which ranks first nationally and is the best hitting percentage by a Big Ten team since 2009 Penn State.\n• Reilly has set Nebraska to a .400 or better hitting percentage nine times this season, a school record in the rally-scoring era.\n• A standout defensive player, Reilly is a huge reason the Huskers rank first nationally in opponent hitting percentage (.121). She is second on the team in digs (2.70 per set) and has 64 blocks.\n• Reilly has double-doubles in all five of the Husker matches that have gone longer than three sets, and she has four double-doubles in sweeps. She also has 67 kills on a .387 attack percentage and has 17 aces.\n• Of Reilly’s top five attacking options, all five average at least 2.08 kills per set, and all five are having career-best years hitting at least .284 or better.\n• A two-time Big Ten Setter of the Year and AVCA All-American, Reilly has been named Big Ten Setter of the Week four times this season and 13 times in her career.\n• Reilly ranks No. 3 in school history in career assists in the rally-scoring era with 3,665.\n• Reilly’s career assists per set average of 10.69 ranks No. 4 among active Division I players and No. 2 in school history in the rally-scoring era.\n• Outside hitter Harper Murray is having a sensational junior season. The two-time AVCA All-American leads the balanced Huskers with career highs of 3.47 kills per set and a .297 hitting percentage. She earned All-Big Ten First Team and AVCA All-Region honors for the third time.\n• Murray averages 2.18 digs per set and has a team-high 31 aces along with 62 blocks for a team-leading 4.14 points per set, and she is an AVCA Player of the Year Semifinalist.\n• Murray is one of the best passers in the nation at her position, passing a 2.50 during the regular season.\n• A Big Ten Player of the Week honoree this season, Murray has 1,156 career kills, which ranks 20th all-time at NU and 10th in the rally-scoring era.\n• Murray is seventh in school history in the rally-scoring era in career aces with 106 and with two more can move into a tie for sixth.\n• Junior middle blocker Andi Jackson is averaging 2.79 kills per set on .486 hitting with 1.16 blocks per set and is an AVCA Player of the Year Semifinalist. Jackson was chosen to the All-Big Ten First Team for the second time and AVCA All-Region Team for the third time.\n• Jackson’s .486 hitting percentage leads the nation and ranks as the best single-season hitting percentage in school history.\n• Only eight times has an NCAA Division I player hit better than .486 in a season in the rally-scoring era.\n• In conference-only matches, Jackson hit .559 to break the Big Ten record for hitting percentage in conference-only matches in a season, which was .541 by Arielle Wilson from Penn State in 2008.\n• The reigning AVCA All-American has a career hitting percentage of .443, which is the No. 1 mark in school history and the No. 1 mark among active Division I players.\n• Jackson has 380 career blocks, cracking the top 10 in school history in the rally-scoring era after the Kansas match.\n• Jackson earned Big Ten Player of the Week, Big Ten Defensive Player of the Week and AVCA First Serve Match MVP honors this season.\n• Senior middle blocker Rebekah Allick is having the best season of her standout career with 2.54 kills per set on .449 hitting with a team-high 1.29 blocks per set. She earned All-Big Ten First Team accolades for the first time and AVCA All-Region for the third time.\n• Allick’s .449 hitting percentage ranks as the No. 5 single-season mark in school history, as well as the No. 4 mark in the country this season.\n• Allick ranks No. 5 in career blocks at Nebraska in the rally-scoring era with 539, which also ranks No. 4 among active Division I players.\n• Allick has been named AVCA National Player of the Week, a two-time Big Ten Defensive Player of the Week, and to the AVCA All-First Serve Team.\n• Allick was on the AVCA Player of the Year Watch List at the midway point of the season.\n• Senior outside hitter Taylor Landfair averages 2.08 kills per set and is hitting a career-best .315 and was named to the All-Big Ten Second Team and received AVCA All-Region honorable mention.\n• In Big Ten play, Landfair’s numbers were even better at 2.08 kills per set with a .355 hitting percentage.\n• A 2022 AVCA All-American, Landfair has played in 152 career matches, the most by any active DI player.\n• Landfair has 1,537 career kills, which ranks 19th among active Division I players.\n• Junior libero Laney Choboy leads the Huskers in digs at 2.74 per set and was named to the All-Big Ten Second Team and AVCA All-Region Team.\n• Choboy was named Big Ten Defensive Player of the Week on Nov. 10 after a career-high 20 digs against Illinois and 15 digs at Minnesota.\n• Choboy was also on the AVCA All-First Serve Team in August after 16 digs against Pittsburgh.\n• Freshman opposite hitter Virginia Adriano was chosen to the Big Ten All-Freshman Team, averaging 2.19 kills per set with a .284 hitting percentage in her first season playing volleyball in America.\n• Adriano also contributes 0.67 blocks per set and has 15 service aces on the year.\n• In Big Ten play, Adriano came on strong with 2.34 kills per set on .318 hitting.\n• Adriano was a two-time Big Ten Freshman of the Week and received AVCA All-Region honorable mention.\n• Sophomore libero Olivia Mauch ranks third on the team in digs per set at 2.56 and is second with 21 aces on 384 serve attempts, also second most on the team.\n• Mauch recorded a career-high 16 digs with seven set assists and one ace in a 3-2 win at No. 18 Creighton.\n• Mauch led Nebraska’s back row in passing during the regular season at 2.77.\nSCOUTING TEXAS A&M\n• No. 6 Texas A&M (26-4, 14-1 SEC) is back in Lincoln for an NCAA Regional for the second year in a row under third-year head coach Jamie Morrison. The Aggies were at the Devaney Center in 2024, falling in five sets to Wisconsin in the regional semifinal.\n• A&M is led by senior opposite hitter Logan Lednicky’s 4.06 kills per set on .315 hitting. The reigning AVCA All-American is a four-time All-SEC honoree.\n• Senior middle blocker Ifenna Cos-Okpalla is averaging 2.07 kills per set on .422 hitting with 1.70 blocks per set, which ranks third nationally. Cos-Okpalla received All-SEC First Team honors for the second straight season.\n• Setter Maddie Waak leads the nation in assists at 11.37 per set and was an All-SEC honoree.\nSERIES HISTORY\n• Nebraska is 32-7 against Texas A&M but the last meeting was Nov. 27, 2010 when both teams were members of the Big 12. NU is has won three in a row in the series and 22 of the last 23.\nREILLY, BUSBOOM KELLY HEADLINE REGION HONORS\n• Nebraska junior setter Bergen Reilly was named AVCA West Region Player of the Year, and Head Coach Dani Busboom Kelly earned AVCA West Region Coach of the Year to highlight the AVCA All-Region awards.\n• Reilly was one of five Huskers on the AVCA West All-Region Team. Joining her were Rebekah Allick, Laney Choboy, Andi Jackson and Harper Murray.\n• Virginia Adriano and Taylor Landfair both received honorable mention.\n• Reilly is the fourth Husker overall and third in a row to be named AVCA Region Player of the Year, joining Kelly Hunter (2017), Merritt Beason (2023) and Lexi Rodriguez (2024).\n• Busboom Kelly earned her fifth career AVCA Region Coach of the Year accolade (2017, 2020, 2021, 2022 at Louisville). In her first year as head coach at Nebraska, Busboom Kelly made history with a 30-0 regular-season record and 20-0 mark in Big Ten play. She was voted Big Ten Coach of the Year after becoming the first coach to win a Big Ten volleyball conference title in the first year as head coach at the school.\n• Jackson, Murray and Reilly have been named to the AVCA All-Region Team each of the past three years. Allick earned her third career selection, while Choboy was named to the team for the first time.\nHUSKERS HAUL IN BIG TEN POSTSEASON HONORS\n• After completing the Big Ten’s first 20-0 campaign since 2009, the Nebraska volleyball program was well represented in the Big Ten Volleyball Postseason Honors.\n• Junior setter Bergen Reilly was named the Big Ten Player of the Year and Big Ten Setter of the Year. Head Coach Dani Busboom Kelly was voted Big Ten Coach of the Year by both the coaches and media.\n• Reilly was joined on the All-Big Ten First Team by Rebekah Allick, Andi Jackson and Harper Murray. Jackson, Murray and Reilly were three of nine unanimous selections.\n• Laney Choboy and Taylor Landfair were selected to the All-Big Ten Second Team. Virginia Adriano was named to the All-Freshman Team, and Maisie Boesiger earned a Big Ten Sportsmanship Award.\n• Reilly became the first setter to win Big Ten Player of the Year since Samantha Seliger-Swenson in 2018. She is Nebraska’s second-ever Big Ten Player of the Year (Kelsey Robinson, 2013) and the first Husker setter to earn conference player of the year since Greichaly Cepero in 2002. Reilly also became the second player in Big Ten history to be named Big Ten Setter of the Year three times (Sydney Hilley, Wisconsin).\n• In her first year as head coach at Nebraska, Busboom Kelly made history with a 30-0 regular-season record and 20-0 mark in Big Ten play. She was voted Big Ten Coach of the Year after becoming the first coach to win a Big Ten volleyball conference title in the first year as head coach at the school. Busboom Kelly has won four conference coach of the year honors in the last six years, as she was a three-time ACC Coach of the Year at Louisville (2020, 2021, 2022). Busboom Kelly has had two undefeated regular seasons in her nine-year coaching career (2021 at Louisville).\n• Reilly and Murray are three-time All-Big Ten First Team selections. Jackson earned her third career All-Big Ten honor and second selection to the first team. Allick earned her third career All-Big Ten honor, but her first selection to the first team.\n• Landfair is a four-time All-Big Ten honoree, while Choboy was named All-Big Ten for the first time in her career.\nHOME SWEET HOME\n• Nebraska has won 63 home matches in a row dating back to Dec. 1, 2022, which is the longest active streak in the nation. It is tied for the fifth-longest streak in NCAA history.\n• The Huskers’ home court win streak is its longest since moving into the Devaney Center in 2013, and it’s the tied for the second-longest home court win streak in program history.\n• Nebraska’s longest all-time home win streak was 90 matches from 2004-09. Nebraska also won 63 straight at home from 1999-2002.\n• Penn State holds the all-time record of 94 from 2006-10.\n• The Huskers went 22-0 at home in 2024, a school record for home wins in a season.\n• Nebraska has won 29 consecutive NCAA Tournament matches played in the Devaney Center, a school record.\nTHREE HUSKERS ARE AVCA POTY SEMIFINALISTS\n• Three Huskers are among the remaining 14 players eligible to be named AVCA Player of the Year. Andi Jackson, Harper Murray and Bergen Reilly were all named semifinalists.\n• Jackson, a middle blocker, and Reilly, a setter, are the only players at their respective positions still in contention.\n• Finalists will be announced on Dec. 15, and the Player of the Year Award will be presented in Kansas City at the AVCA Awards Banquet on Friday, Dec. 19.\nBIG RED WINS BIG TEN DISCOVER CHALLENGE\n• The Nebraska volleyball team collected the first-ever Big Ten Discover Challenge trophy in the month of October.\n• Five selected matches for each Big Ten team played on Wednesdays, Thursdays and Fridays in October counted toward the challenge standings.\n• Nebraska and Purdue both went 5-0, but the Huskers won the tiebreaker with a perfect 15-0 record in sets.\nBUSBOOM KELLY DEBUTS AS NEW HEAD COACH\n• Nebraska native Dani Busboom Kelly was named the fourth head coach in program history on Jan. 29, 2025 by Nebraska Director of Athletics Troy Dannen. Busboom Kelly succeeds her former coach and mentor, John Cook, who announced his retirement following the 2024 season after 25 seasons as Nebraska’s head volleyball coach.\n• A Husker national champion player and assistant coach, Busboom Kelly spent eight years (2017-24) building Louisville into a national power. The Cardinals reached two NCAA Championship matches, three NCAA Semifinals, five regional finals and won four ACC titles.\n• Busboom Kelly compiled a 203-44 (.822) record in her eight seasons at Louisville, including a 120-15 (.889) mark from 2021-24, which was the second-best winning percentage in the country during that span. In 2024, the Cardinals reached the NCAA Championship match for the second time in three seasons.\n• Busboom Kelly was the starting libero on Nebraska’s 2006 national championship team, and she was an assistant coach when the Huskers won the 2015 national championship in Omaha. She took the helm at Louisville late in 2016 after being named AVCA National Assistant Coach of the Year in her final season as a Husker assistant, and she guided the Cardinals to heights the program had never experienced.\nHUSKERS WELCOME EIGHT NEWCOMERS\n• Eight of the 17 players on the 2025 roster are newcomers.\n• Senior opposite hitter Allie Sczech is the lone transfer the Huskers brought in for 2025. Sczech was a two-time All-Big 12 Second Team performer at Baylor, averaging 2.44 kills per set with a .273 hitting percentage in 2024. Sczech posted a career-high 21 kills and hit .463 in Baylor’s NCAA Tournament second round defeat to Dayton last year. She totaled 754 kills in three seasons at Baylor.\n• In addition to Sczech, seven freshmen have joined the fold. Campbell Flynn (6-3, Setter), Ryan Hunter (6-2, Opposite Hitter), Keri Leimbach (5-4, Libero) and Teraya Sigler (6-3, Outside Hitter) all enrolled at Nebraska in January. Virginia Adriano (6-5, Opposite Hitter), Kenna Cogill (6-4, Middle Blocker) and Manaia Ogbechie (6-3, Middle Blocker) joined the Huskers in June.\nREGENTS APPROVE NAMING OF JOHN COOK ARENA\n• The home of Nebraska Volleyball will now officially bear the name of one of the legendary coaches in the history of the sport, as the University of Nebraska Board of Regents approved the naming of John Cook Arena at the Bob Devaney Sports Center.\n• Cook retired in January following a remarkable 25-year run as the Huskers’ head coach. He guided the Huskers to four national championships, 12 NCAA Semifinal appearances and 14 conference championships. Cook achieved a career record of 883-176 (.834), the fifth-best winning percentage all-time for a Division I volleyball coach. His record of 722-103 at Nebraska was the best winning percentage (.875) for any DI program from 2000-24.\n• In addition to the naming of John Cook Arena at the Bob Devaney Sports Center, the project also includes a bronze statue honoring Cook on the north side of the Devaney Sports Center. Nationally recognized sculpture artist and Nebraska native George Lundeen was commissioned to produce the life-size tribute to Cook and his career.\n• The court inside John Cook Arena will continue to hold the name of Terry Pettit Court to recognize Cook’s predecessor and fellow Hall of Famer. Additionally, the full athletics complex will continue to be named the Bob Devaney Sports Center in honor of Nebraska Hall of Fame football coach and long-time athletic director Bob Devaney.\nLandfair, Sczech Selected in MLV Draft\n• Nebraska volleyball seniors Taylor Landfair and Allie Sczech were selected in the 2025 Major League Volleyball Draft on Nov. 24.\n• Landfair was the No. 28 overall pick by the Indy Ignite. One pick later at No. 29, Sczech was selected by the Omaha Supernovas.\nHUSKERS SET FOR 23 TV BROADCASTS\n• Nebraska volleyball airs on television 23 times this season. The Huskers have 18 national TV appearances on Big Ten Network, FOX, FS1, ABC and ESPN.\n• Additionally, Nebraska Public Media was granted the rights to televise the Red-White Scrimmage (Aug. 9), the Alumni Match (Aug. 16), and three regular-season home matches: Grand Canyon (Sept. 13), Maryland (Sept. 27) and Northwestern (Oct. 24).\n• All matches that are televised on Nebraska Public Media are also streamed on B1G+. All home matches and Big Ten road matches not selected for TV are streamed on B1G+.\n• NU’s match at Lipscomb is available on ESPN+.\nFOUR HUSKERS NAMED PRESEASON ALL-BIG TEN\n• Four student-athletes from the Nebraska volleyball team were named to the Preseason All-Big Ten Team after a vote by the league’s 18 head coaches.\n• Juniors Andi Jackson, Harper Murray and Bergen Reilly were three of just five unanimous selections to the Preseason All-Big Ten Team. They were joined on the 20-player team by senior Rebekah Allick.\n• The coaches picked Nebraska as the top team in the preseason poll. The Huskers won their fifth Big Ten title in 2024 with a 19-1 conference record to share the crown with Penn State. Nebraska finished the season at 33-3 and reached the NCAA Semifinals. Penn State, Wisconsin, Minnesota and UCLA rounded out the top five.\n• Jackson, a junior middle blocker, had a breakout year in 2024, earning AVCA All-America First Team and unanimous All-Big Ten First Team honors. Jackson averaged 2.62 kills per set with a .439 hitting percentage, which ranked sixth in the nation and fourth in school history. She also put up 1.18 blocks per set.\n• Murray, a junior outside hitter, was an AVCA Second Team All-American last year after earning third-team honors as a freshman. Murray led the Huskers in 2024 with 3.40 kills per set and a team-high 39 service aces. She is a two-time All-Big Ten First Team selection. Murray was selected to the NCAA Championship All-Tournament Team last season and was the NCAA Lincoln Regional Most Outstanding Player.\n• Reilly, a junior setter, is the first player in Big Ten history to win Big Ten Setter of the Year as both a freshman and sophomore, and she is coming off her second straight AVCA All-America Second Team honor. Reilly averaged 11.08 assists per set in 2024 while leading the Huskers to a .284 hitting percentage, their best since 2016.\n• Allick, a senior middle blocker, recorded 1.82 kills per set in 2024 with a career-best .357 hitting percentage. She had a team-high 1.43 blocks per set, which ranked third among Big Ten players and 14th nationally. Allick ranks sixth in school history with 415 career blocks entering the 2025 season. She was an All-Big Ten Second Team selection in 2022 and 2023.\nFLYNN NAMED GATORADE NATIONAL POTY\n• Freshman Campbell Flynn was named the Gatorade National Player of the Year on Jan. 10.\n• Flynn, a 6-3 setter from Oakland, Mich., was a two-time Gatorade Michigan Volleyball Player of the Year. She recorded 730 assists and 180 digs in her senior season for Mercy High School, leading the Marlins to a 31-3 record and the Division I regional semifinals in 2024. Flynn also compiled 131 kills, 52 blocks and 36 service aces while posting a .394 hitting percentage at net.\n• Flynn was a member of the U.S. U21 Women’s National Team that won the gold medal at the NORCECA Championships in 2024 and was ranked as the nation’s No. 4 overall recruit and top setter recruit in the Class of 2025 by PrepDig.com. Flynn concluded her prep volleyball career, which included a state championship in 2023, with 1,973 assists and 737 kills. She also competed in the Under Armour All-America Game. Off the court, Flynn maintained a 3.94 GPA in the classroom.\n• Flynn is the sixth Husker all-time to be named the Gatorade National Player of the Year. The others are Harper Murray (2022-23), Ally Batenhorst (2020-21), Lexi Sun (2016-17), Mikaela Foecke (2014-15) and Gina Mancuso (2008-09).\nFLYNN, SIGLER EARN GATORADE PLAYER OF THE YEAR\n• In addition to being named Gatorade National Player of the Year, Campbell Flynn was named the Gatorade Michigan Volleyball Player of the Year for the second straight year, while fellow Husker newcomer Teraya Sigler was named the Gatorade Arizona Volleyball Player of the Year for the second straight time.\n• Sigler, a 6-2 outside hitter from Scottsdale, Ariz., led Horizon High School to a 25-5 record and a fourth straight Conference 5A state championship in 2024. Sigler amassed 619 kills and 354 digs, including 33 kills and 20 digs in the state championship match. She also had 65 service aces and 28 blocks while posting a .398 hitting percentage.\n• Ranked as the No. 1 recruit in the Class of 2025 by PrepDig.com, Sigler was a member of the U.S. U21 Women’s National Team that won the gold medal at the NORCECA Championships in 2024. She concluded her prep volleyball career with 1,951 kills and 1,128 digs and competed in the Under Armour All-America Game.\n2024 SEASON IN REVIEW\n• Nebraska finished the 2024 season 33-3 overall and advanced to the NCAA Semifinals for the second year in a row and seventh time in the last 10 years.\n• Nebraska won its 36th all-time conference title and fifth Big Ten title with a 19-1 record in Big Ten play last season. The Huskers went back-to-back as Big Ten champions for the second time, also accomplishing that feat in 2016 and 2017.\n• The Huskers’ 29 regular-season wins last year tied the 1983 school record for most wins in a regular season in the NCAA era.\n• The Huskers’ 33 wins last season were tied for the most victories by a Husker team since the 2000 national championship team went 34-0.\n• The Huskers ranked 11th nationally with a team hitting percentage of .284 in 2024.\n• The Huskers ranked sixth nationally and first in the Big Ten in opponent hitting percentage at .143 last season. NU led the nation in opponent hitting percentage in 2022 and 2023.",
  "word_count": 4701,
  "scraped_at": "2026-02-14T12:50:38.486264"
}