{
  "article_id": "c1f394f4a408",
  "url": "https://www.yahoo.com/news/big-ten-resulting-sharply-higher-111511369.html",
  "title": "The new Big Ten is resulting in sharply higher carbon emissions",
  "date": "20241226T114500Z",
  "domain": "yahoo.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "The new Big Ten is resulting in sharply higher carbon emissions\nThe University of Nebraska plays football in the expanded Big Ten Conference at Memorial Stadium in Lincoln. (Aaron Sanderford/Nebraska Examiner)\nCarbon dioxide emissions from Big Ten football team travel for regular-season conference games more than tripled in 2024 compared to 2023 after the addition of a quartet of West Coast schools, a Capital News Service analysis found.\nCarbon dioxide is one of the major contributors to global warming. It is a greenhouse gas, meaning it traps heat in the planet’s atmosphere. Global air travel was estimated to be responsible for 2.5% of all carbon emissions and 4% of global warming, according to a study published by Our World in Data in April.\n“As the Big Ten grows and its carbon-intensive activities increase, they’re contributing to higher levels of carbon emissions, so they’re fueling the heating of the planet,” said Joseph Nevins, a professor of geography at Vassar College and one of the pioneers of Flying Less, a project aimed at reducing air travel in higher education. “They’re making contributions to increasing forest fires in the U.S. Southwest and Canada, growing levels of air pollution, which have direct impacts on people’s bodily well-being.”\nThe Big Ten did not mention environmental impact as a consideration in making its football schedule.\n“Our priority in football scheduling is to balance geography and travel to create compelling matchups in a flexible format that maximize opportunities for Big Ten teams to access the expanded College Football Playoff and win National Championships,” the Big Ten said in a statement to CNS in August.\nIn 2010, the Big Ten consisted of 11 schools: Ohio State, Michigan State, Wisconsin, Iowa, Illinois, Penn State, Michigan, Northwestern, Purdue, Minnesota and Indiana. Nebraska joined the contingent of Midwest schools in 2011. Maryland and Rutgers officially became members in 2014, which allowed the Big Ten to expand its footprint to the East Coast. Carbon emissions from Big Ten travel rose 6% when Maryland and Rutgers joined the conference, per an Arizona State study published in May.\nIn 2024, the Big Ten added USC, UCLA, Oregon and Washington, which brought its buffet of schools to 18 and expanded the conference’s geographic footprint across the country. USC and UCLA are more than 2,400 miles away from Rutgers. When UCLA football traveled to New Jersey to face Rutgers on Oct. 19, its travel emitted more than 150,000 kilograms of carbon. Six days later, the Scarlet Knights took their own cross-country trip to face USC for a nationally televised game that started at 11 p.m. on the East Coast. Those two trips emitted the most carbon dioxide of any Big Ten games.\nEach of the Big Ten’s new members is traveling at least twice as much this season as the year before, with UCLA and Washington traveling more than three times as much in 2024 for regular-season conference games as they did in their final Pac-12 seasons.\nOf the 18 Big Ten schools, 17 will see an increase in carbon emissions from last year. Purdue is the outlier, emitting nearly 14,000 less kilograms of carbon this year in comparison to 2023.\nThe four West Coast schools are the Big Ten’s highest emitters. Washington is emitting more than 500,000 kilograms of carbon dioxide, the highest in the conference. USC, UCLA, Washington and Oregon increased emissions of carbon dioxide by at least 250,000 kilograms in their first year in the Big Ten compared to their final year in the Pac-12. Penn State is projected to emit more 275,000 kilograms, Rutgers above 260,000, while Maryland is above 238,000 to take up the next three spots.\n“Is it necessary? Are there alternative ways of doing things that would not only radically cut our carbon emissions, but produce a more socially and environmentally just world?” asked Nevins, who got his doctoral degree from UCLA.\nMore in Sports\nBarcelona fans tear into several players amid Atlético disaster\nThe Seattle Seahawks of the NFL will travel an average of 3,227.62 miles round-trip for road games this season, the most in the league, according to Bill Speros of Bookies.com. The University of Washington football team, which plays its games less than seven miles from the Seahawks, will average 100 miles more per trip than its NFL neighbors.\nCNS calculated distances from nearby major airports to find the carbon emissions total. For example, UCLA’s Oct. 19 game against Rutgers, CNS used the distance from Los Angeles International Airport to Newark Liberty International Airport. For games where teams likely used bus travel, CNS used the distance between stadiums.\nCNS focused on football team travel for this analysis due to the sport’s once-a-week travel patterns. Most other sports play multiple times a week and may have less predictable travel schedules.\nIn 2023, the conference announced that each Big Ten football program would face all other programs at least twice in a four-year span. Between 2024 and 2028, the Big Ten has scheduled 33 cross-country trips among the seven schools on the East and West Coast (Penn State, Rutgers, Maryland, Washington, Oregon, USC, UCLA).\n“We develop our scheduling formats with input and feedback from school administrators, faculty representatives, medical professionals and head coaches looking at the potential impact on academics, health, safety, rest, recovery, and overall competitive equity,” the Big Ten stated in August. “We continue to evaluate our formats and evolve as needed.”\nKerry Kenny, the chief operating officer of the Big Ten, told ESPN in 2023 that a divisional model restricted the regularity of compelling football games. Oregon and Penn State, the two teams who met in the Big Ten title game on Dec. 7, are scheduled to play each other three times in the next four seasons, which would not have been the case with East and West divisions.\nIn its first season with the four new schools, the Big Ten had four teams qualify for the College Football Playoff, the most of any conference. After an undefeated regular season and Big Ten title, Oregon is the top seed in the 12-team tournament.\nAn Oct. 12 matchup between Oregon and Ohio State, two of the top three teams in the nation at the time, averaged 10.4 million viewers and peaked at 13.4 million in the final minutes of what was an eventual Oregon victory. It was the most-watched Big Ten prime-time regular-season game since 2008, according to a press release from Comcast. Team travel for the game resulted in more than 125,000 kilograms of carbon being released.\n“The ultimate variable, in my opinion, is the games are better, the matchups are better, and certainly far more important,” said Tim Brando, a longtime broadcaster for Fox Sports.\nIncluded in Brando’s 2024 slate was a Sept. 27 matchup between the University of Washington and Rutgers. Washington emitted nearly 149,000 kilograms of carbon dioxide in its flight for the game. The Friday night matchup peaked at 2.5 million viewers as Rutgers, who made the game its annual blackout, escaped with a three-point victory.\n“That was probably the most intensity and the greatest crowd [Rutgers] had for a home game in Piscataway in years,” said Brando. “In large measure, it was because Washington was the opponent, a team that was playing for the National Championship just a year before.”\nWhat’s happening in the Big Ten is representative of the new age of college football. Division-less conferences are the new norm. The only FBS conference split into divisions this season was the Sun Belt Conference.\n“The only option to get to most of these competitions is to fly, which means that necessarily there are more flights,” said Madeleine Orr, an assistant professor of sport ecology at the University of Toronto and a University of Minnesota graduate. “It’s a growth strategy, as opposed to a reductionist strategy and a climate strategy.”\nAs awareness around the impact of air travel grows, more major sports teams and organizations are investing in carbon offsets. Carbon offsets have become a trendy way for major corporations to compensate for emissions. They do so by investing in efforts that lower gasses released into the atmosphere, essentially covering the carbon dioxide they emit.\nIn 2019, the NHL purchased the equivalent of more than 3.8 million pounds (more than 1.72 million kilograms) of carbon offsets to counter its playoff travel. In the five years since then, the NFL’s Houston Texans, English soccer giant Manchester United and even the Australian national men’s and women’s soccer teams have bought offsets to make up for travel.\n“In order for that offset to work effectively, the offset has to immediately cancel out … (those) emissions I’ve generated,” Nevins said. “You also have to be able to verify that it’s taking place and that the cut in emissions persists over time.”\nMost colleges and universities have sustainability departments that evaluate the schools’ practices and how to lessen their environmental impact. In the Big Ten, in addition to sustainability departments, schools such as the University of Illinois and Michigan have programs focused on sustainable aviation.\nThe University of Maryland has a pledge to offset all air travel. While Maryland is offsetting all its travel, according to a school dashboard, the number of miles athletics traveled via commercial and chartered flights from 2021 to 2023 increased by 51%. The dashboard has not been updated for 2024, the first year that would include the West Coast teams in the Big Ten.\n“What we should be concerned with is: What are they teaching their students, right? What are they teaching the communities in the world?” Nevins asked. “They are normalizing a behavior that is counter to the direction you need to be heading, and they are opening themselves up to accusations of hypocrisy.”\nOn Nov. 20, the University of Michigan’s Center for Sustainable Studies released a paper looking at the impact of the school’s football travel. Paige Greenberg and Molly Russell, the authors, found conflict between the university’s messaging and the school’s athletics travel.\n“While U-M has positioned itself as a leader in sustainability within higher education, the recent Big Ten expansion contradicts this image and poses significant challenges to the University’s commitments,” the paper said.\nThe 2024 season is the second of media contracts that the Big Ten has with CBS, Fox and NBC, which total more than $8 billion and will run through the 2030 season, according to the Sports Business Journal. In the 2023 fiscal year, the conference paid most of its members more than $60 million, a 3% increase from the previous year, according to USA Today.\n“That seems to fall into a larger pattern where, in general, more wealth leads to more emissions,” said Seth Wynes, a professor at the University of Waterloo who has published research on the relationship between sports and climate change. “Richer individuals produce more emissions than poorer individuals. The same is true generally for nations. So as leagues or teams become more affluent, it’s not a surprising result.”\nThe immediate future of Big Ten football is set. Major media contracts have been signed, and games are scheduled through 2028.\nMultiple experts mentioned making college sports regionally organized again would alleviate some of the problem. In the Big Ten, doing so would place the four former Pac-12 schools in a West division. That would lean into the decades-long rivalries of these programs and lessen the environmental strain of travel.\nBut re-implementing the East and West divisional format likely can’t be done until 2029 at the earliest, meaning the 2024 bump in emissions is likely to remain steady for the next four years.\n“We should be going in the direction of more regional, not less,” Orr said. “Let’s crunch this smaller, not let’s blow it up bigger.”\nMekhi Abbott, Henry Brown, Keelin Brown, Shaela Foster, Alexa Henry, Steven Jacobs, Caroline Koutsos, Matthew Neus, Joshua Panepento, Brandon Schwartzberg, Laura Van Pate, and Matthew Weinsheimer contributed to this report.\nThis article first appeared in Capital News Service Maryland, a student-powered news organization run by the University of Maryland’s Philip Merrill College of Journalism.",
  "word_count": 2001,
  "scraped_at": "2026-02-14T12:18:15.002447"
}