{
  "article_id": "c20be27e089d",
  "url": "https://www.independent.co.uk/space/asteroid-hitting-earth-how-to-stop-b2697324.html",
  "title": "How to stop an asteroid hitting Earth : Would people co - operate to face a global peril ? ",
  "date": "20250213T083000Z",
  "domain": "independent.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "How to stop an asteroid hitting Earth: Would people co-operate to face a global peril?\nOn the world's first Asteroid Day, Nina Burleigh discovers that Nasa has already commissioned a team of 'planetary defenders' for whom the question is not if but when\n- Bookmark\n- CommentsGo to comments\nThere have been a few near misses over the years, but what would we do in the event of an actual meteor strike?\nEarlier this year, while war and chaos continued to unfold further east, scientists gathered on the outskirts of Rome to discuss another sort of catastrophe. Astronomers and physicists from some of the world's top institutions grappled with a dire scenario: an asteroid up to 1,300ft in diameter – big enough to cause epochal damage – was hurtling towards Earth, and the countries likely to be hit included some of the poorest and most unstable in the world. Policymakers bickered over whether to try to blow it up or move it, and nations nearly went to war over whether deflecting it would make the fiery rock more likely to land on them…\nRelax. It was only a drill. Had it been a real emergency, you would have been instructed to kiss the world – or a large chunk of it – goodbye.\nWatching this five-day asteroid war game from the wings were two Americans, one from the scientific world and one from the military. These elder statesmen of what's called planetary defence have been responsible for reminding policymakers that the planet and all life on it have been shaped by big rocks from outer space slamming into it. Dave Morrison was one of the first researchers to suggest that, unlike the dinosaurs made extinct by an asteroid impact, we might be able to defend ourselves.\nFormer US Air Force Lieutenant Colonel Lindley Johnson was eventually put in charge of Nasa's Near-Earth Object (NEO) division after first suggesting in the 1990s that the Air Force track asteroids. These men, along with all the world's dedicated planetary defenders, are proud (and relieved) that the Big Question has evolved from what if a cataclysm-inducing space rock is aiming for us – we now know an impact is inevitable – to what will we do about it.\nThat question was the main topic of that mid-April meeting held in a conference hall in Rome. The European Space Agency had invited astronomers, physicists, nuclear engineers and mathematicians to discuss the slim possibility of a space rock smashing into Earth and causing regional damage or maybe even the end of civilization.\nScientists today can tell us, with various degrees of certainty, that an object will smash into the planet in, say, 200 years, and they believe we can probably stop it. But nobody knows how people could or would cooperate to face a global peril – and in an age when many politicians deny climate change, can we even count on them to believe the hazard is real?\nMorrison was, in 1989, one of the first scientists to warn the public about asteroids, with Cosmic Catastrophes, a book he co-wrote with astronomer Clark Chapman. Since then, the field has grown to include national space agencies, the US Congress, the United Nations and labs filled with specialists. Thanks to their efforts, more than 150,000 asteroids are now registered with the Smithsonian's Minor Planet Center. However, the defenders estimate there are tens to hundreds of thousands more out there that we cannot see, many hidden by the sun.\nMeanwhile, about 12,700 of those identified are categorised as NEOs, with orbits that come within 121 million miles of the sun, of which about 1,000 NEOs are civilisation-enders – larger than a half mile in diameter. None of the behemoths seems to be a likely threat, but about 1,600 other mapped NEOs may be headed our way, and an impact could kill millions.\nAsteroid impact was first identified by the late geologist Gene Shoemaker when he was examining lunar craters in the 1950s for the US space programme. Eventually, with another scientist called Edward Chao, he discovered coesite, a type of silica produced in a violent impact. But his most important find – in terms of planetary defence – was Comet Shoemaker-Levy 9, which smashed into Jupiter in 1994. It was the first extra-terrestrial impact human beings had predicted and then observed in real time. This gave scientists confidence that similar calculations could be made for Earth.\nAround the same time that Shoemaker was compiling his notes on coesite, geologist Walter Alvarez discovered a layer of iridium-infused clay at the geological strata separating the era of the dinosaurs and our epoch – and iridium is extremely rare on Earth but common in meteorites. Geologists soon found a similar iridium layer at the same geological strata in other parts of the world and postulated that a catastrophic impact had occurred around the time the dinosaurs became extinct. (Scientists even know where – just off the Yucatan Peninsula, at Chicxulub). In the decades since, they have learned more about how extra-terrestrial impacts have changed our planet. They believe our moon is the result of a collision between two planets the size of Mars and Venus.\nAnd numerous smaller objects, with diameters in the five to 10-mile range (like the one that caused the dinosaur extinction) have also slammed into the planet.\nWhen Chapman and Morrison published their 1989 book about cosmic catastrophes, they covered a broad range of menacing events, including comets, asteroids and supernovas. But both men thought the asteroid impact scenario was the most intriguing because mankind could theoretically do something to prevent one. In 1990, US congressional staffers invited Morrison to present his findings on space rock hazards. A year later, Congress authorised Nasa to study asteroids and how to deflect them.\nChapman and Morrison gathered together a team, which concluded that the most dangerous asteroids were about one mile in diameter. Such a rock could have civilisation-ending effects, mainly because weather alterations would result in the starvation of billions of people. So they recommended sky surveys to find all objects of that size. Meanwhile, the planetary defender \"community\" was attracting nuclear weapons designers, about to be left unemployed by the end of the Cold War, who argued that their technology could save us from an asteroid.\nAnd on 24 December 2004, they captured the world's attention with an alarming calculation: it turned out an 885ft-diameter hunk of dark space rock was heading our way, with a one in 25 chance of smashing into Earth in 2036. The ominous spinning rock was soon named \"Apophis\", after an Egyptian god, \"the Uncreator\". And while the experts at the Jet Propulsion Laboratory (JPL) in Pasadena, California – which tracks NEO orbits – soon refined the prediction down to a much less threatening one in 250,000, that still means Apophis will pass between us and our satellites and be visible to the naked eye.\nCanadian-born astronomer Paul Chodas manages Nasa's NEO office at the JPL. There, he feeds an asteroid's many variables – spin, mass, the way it reflects and absorbs light and radiates heat, and the gravitational pull of other asteroids nearby – into a supercomputer that spits out an orbit prediction (filled with variables that sometimes involve plus or minus 18 million miles). One October morning in 2008, his mobile rang as he was dropping off his son at school. It was the Minor Planet Center at Harvard, reporting that an object was speeding towards Earth. Chodas plugged the coordinates into his computer and was soon able to predict an impact time and location – just 20 hours hence, in the Middle East. The JPL then contacted Nasa, who called the White House – because Johnson at Nasa was especially concerned that governments in the volatile region be notified. \"For a while, we had predicted it heading towards Mecca,\" he says, drily. \"And that was a concern.\"\nAt the JPL, Chodas and his colleague, Steve Chesley, drilled into the numbers and soon had a precise impact point, near a fly-specked outpost, population 10 people, deep in the Sudanese desert. JPL scientists were able to direct a team of university students from Khartoum there – and even Chodas was surprised when they found remnants right where his equations had led them to look.\nStill, frightening uncertainties remain. The last significant asteroid event was one that nobody saw coming. In 2013, a bus-sized space rock blew up in the sky near the town of Chelyabinsk, Siberia, with a force similar to a nuclear bomb. Windows were blasted, and one thousand people went to hospital. Because many drivers in Russia mount video cameras on their dashboards, scientists had a plethora of YouTube images of a streaking light, followed by a blinding explosion in the sky, which they used to pinpoint the object's trajectory. Chelyabinsk gave them another lesson: what even a relatively small asteroid, bursting not on impact but in the air, can do. And they know it's only a matter of time before something like that happens over New York, London, Delhi or Tokyo.\nBetween \"Apophis\" and Chelyabinsk, a US law in 2005 instructed Nasa to detect, track, catalogue and characterise the physical characteristics of asteroids larger than about 460ft across. In other words, to do what Morrison had suggested 15 years earlier: try and find them all. The mapping program involved three main elements – telescopes in Arizona and Hawaii, and a fairly small, space-based telescope operating at infrared wavelengths. And by late 2011, it was announced that Earth is – for now – not a target for any huge, civilisation-ending mass.\nBut hundreds of thousands of unmapped smaller objects are winging around nearby: apparently, only one per cent of NEOs above 60ft in diameter have been mapped – and because they're harder to find, they're more likely to hit us. Objects as small as 450ft across would cause severe regional damage, and the mapping project has identified only an estimated quarter of them. Geologists believe objects between about 150 and 450ft in diameter hit Earth every 100 to 300 years, and some have wreaked havoc. Nasa is considering a proposal to build a new space-based telescope that will find and measure many more asteroids; and if approved, it could be operational by 2020.\nDeflecting an asteroid is an embryonic science. There are three schemes, roughly classified as Nuke, Kick or Tug. The Nuke option would aim an explosive device or, more likely, many – at an asteroid on a collision course. Despite its Hollywood-grade visual potential, the planetary defence community regards it as a last-ditch effort. The other two options are the Kick (aiming a \"kinetic impactor\" at an asteroid to knock it slightly off orbit) and the Tug (shooting an unmanned spacecraft into the orbit of the asteroid to operate as a \"gravity tractor\" with enough mass to pull the rock off its trajectory).\nWhile all three schemes depend on man's ability to navigate a craft to an asteroid – achieved when the Rosetta craft landed the Philae probe on a comet last November – none of the asteroid mitigation techniques has been tested. However, Nasa hopes to demonstrate the Tug method as part of a 2020 mission, which would launch a robotic spacecraft to break off and grab a chunk of an asteroid. The craft and its cargo will remain in the asteroid's orbit for 100 days, and scientists believe its enhanced mass will eventually pull it off-course. The device would then drag the asteroid chunk back to the moon's orbit and leave it there, allowing future experiments on it.\nThe idea of giving the moon a satellite still sounds like science fiction, but planetary defenders want nations and space agencies to put real money behind testing it; and for policymakers, journalists and scientists to discuss the threat calmly and realistically, somewhere between the poles of mass panic and dubious hilarity.\nThe public will be hearing with increasing frequency about objects veering relatively close or even speeding toward us – particularly today, when a motley crew of astronomers, physicists, rock stars and filmmakers get behind the world's first \"Asteroid Day\".\nThe date was selected because on 30 June 1908, an asteroid flattened thousands of square miles of remote Siberian forest, in what's known as \"The Tunguska Event\". The organisers and participants include Brian May, the Queen guitarist and astrophysicist, and Lord Martin Rees, the Astronomer Royal; events are planned in cities around the world; and live presentations will be beamed from London and San Francisco. The Asteroid Day organisers are also circulating an online petition called \"The 100X Declaration\" calling for a hundredfold increase in the mapping and tracking of asteroids.\nMeanwhile, after eight years of deliberating, in March the UN finally announced the creation of a global early-warning system to protect the planet from a potentially city-destroying, tsunami-causing or, worse, civilisation-ending large space object. And in mid-April the planetary defenders tested the concept in Frascati. Their mission: save the planet from an asteroid possibly four times the size of a football field. The scenarios were so realistic that their press releases had to be emblazoned with bright red boxes proclaiming, \"Exercise. Exercise. Not a Real World Event.\"\nAt the beginning of the game, participants learned that an asteroid, estimated to be somewhere between 460 and 1,300ft in diameter, was apparently on course to smash into Earth on 3 September 2022. They divided into three groups – national and international policymakers, the media and scientists – and played out over five days what humans might do.\nIn the first year after the asteroid's discovery (days one and two), the participants heard that scientists had estimated a long \"risk corridor\" from south-east Asia to Turkey. As the asteroid moved through its orbit, the experts refined their predictions, homed in on its size and likely damage point, and advised policymakers on the options.\nBy August 2019 (day four), the participants learnt global policymakers had agreed to fire six kinetic impactors, and they reached their target six months later. However, a debris cloud then prevented participants from knowing what had worked until January 2021 (day five), when it was announced that two of the six KIs had missed, one had hit and fractured the asteroid, and another had broken off a chunk that remained on a path towards Earth but was hidden from view by sunlight. Two others hit the remains of the now-broken asteroid, deflecting the largest piece of it.\nThe following year (later on day five), the participants learnt that the broken fragment was still hurtling toward Earth and remained a significant hazard. It would arrive on time, somewhere in India, Bangladesh or Myanmar. And about a \"month\" before its impact, scientists were able to pinpoint the object's size (about 261ft in diameter), as well as the likely time (9am) and precise location (Dhaka, Bangladesh, population 15 million). They predicted that the explosion would release 18 megatons of energy: similar to that explosion in 1908 that flattened thousands of miles of Siberian forest.\nChodas says: \"The number one lesson I took away is that we need infrared, in-space telescopes to tell us more about the sizes of these objects.\" Johnson says that the exercise proved that humans can mount an asteroid response – and it can be affordable, a key element when trying to prevent disasters that might not occur in our lifetimes. (\"A few hundred experts and a few hundred million dollars per year,\" he says.) The astronaut Russell \"Rusty\" Schweickart says: \"I fear there's not enough of a collective survival instinct to really overcome the centrifugal political forces. That is, in a nutshell, the reason we'll get hit…\"\nBut the exercise ended on a cliffhanger, with a massive, flaming rock closing in on a teeming, impoverished Asian city. Having done the best they could, the planetary defenders hung up their hero lanyards, packed their suitcases, checked out of their hotels and headed for the airport, leaving the planet forewarned.\nThis is an edited version of an article that first appeared in Newsweek\nJoin our commenting forum\nJoin thought-provoking conversations, follow other Independent readers and see their replies\nComments",
  "word_count": 2692,
  "scraped_at": "2026-02-14T14:15:47.511507"
}