{
  "article_id": "c2263811c6e2",
  "url": "https://www.pastemagazine.com/movies/1950s/the-100-best-films-of-the-1950s",
  "title": "The 100 Best Movies of the 1950s",
  "date": "20230411T231500Z",
  "domain": "pastemagazine.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "The 100 Best Movies of the 1950s\nWhile the passing decades have distilled critical opinion to a fairly reliable “Required Viewing” roster for the best 1950s movies, the era remains more difficult to pin down than the 1930s or ’40s, largely due to an explosive diversity in both subject matter and cinematic technology. We still see the profound influence of WWII, we still see film noir and Westerns and the development of European neorealism. We also see the proliferation of color technology. The affluence that grew in the post-war years and the rise of “leisure culture” play a role in the zeitgeist of this decade. There is also an emphasis on teen culture, perhaps best represented by the brief but meteoric career of James Dean. Television became mainstream, and Hollywood found itself with some stiff competition from the networks. Cold War paranoia and anti-Communist sentiment joined with a profusion of new technologies to fuel American film—science fiction and “outer space” films, in particular. It was the decade of Alfred Hitchcock and Ingmar Bergman, and in Asia, Akira Kurosawa and Satayajit Ray were both producing some of their finest work. The French New Wave was in full flow, with directors such as Jean-Luc Godard and Francois Truffaut defining what would come to be known as auteur theory. Psychological thrillers, Shakespeare adaptations, goofy musicals, and the “cast of millions” epic style canonized by Cecil B. deMille are all very much in evidence. Film took off in a million directions during the 1950s, and it is truly up for debate what constitutes the “best” of this prolific and diverse decade. So we’ve tried to keep an eye on the films that defined something about the era, and while anyone might squabble over one being more artistically important than another (rightly so, in some cases), we’ve pulled together a list of films that all tick the “if you want to consider yourself a culturally literate cinephile, you need to see this” box for one reason or another.\nHere are the best movies of the 1950s:\n100. The Tingler (1959)\nFor William Castle, going to the movies was a matter of life and death. Or at least he wanted to convince you as much: If he didn’t have you believing you had some serious stakes in what was happening onscreen, then he—the 20th century’s consummate cinematic showman—wasn’t doing his job. So begins The Tingler, Castle’s 1959 creature feature, wherein Castle appears on screen like a B-grade Alfred Hitchcock to remind the audience that what they’re about to see is hardly a lark. Fear is a natural but serious affliction, a building up of poisonous humors within one’s nervous system, and so it must be addressed should you endure the film he’s about to show you. The only way to live through The Tingler? You’re going to have to scream. And, to prove his medical conclusions, Castle introduces us to Dr. Chapin (Vincent Price at the height of his weirdo sophisticate phase), a man who believes that every human being has a parasite living in their spine that feeds off of extreme fear—that’s the “tingling” sensation you get every time you’re panicked. The parasite will grow and decimate a person’s backbone unless it’s defeated/deflated by the only logical reaction to fear: screaming. Things of course get tinglier once Chapin captures an actual rubbery spine centipede—and, meanwhile, Castle was always ready to exploit his audience’s squirm factor, having “Percepto!” contraptions installed into each theater seat, set to buzz the butts of already agitated film-goers to scare them into thinking the insectoid creature was crawling between their legs. Among Castle’s many interactive “gimmick” films in the 1950s, The Tingler might be the Castle-est, a sincerely wacky, unsettling, imaginative experience whether you’re equipped with a vibrating chair or not. And hearing Vincent Price hollering into the void of a pitch-black screen, “Scream! Scream for your lives! The Tingler is loose in the theater!”, offers enough urgency to convince you something may be nipping at your backside after all. —Dom Sinacola\n99. The Ten Commandments (1956)\nThere are a lot of major motion pictures from the ’50s that remain eminently relevant and even bizarrely au courant. The Ten Commandments isn’t one of them, But even though it feels dated, from the standpoint of cultural literacy it remains a must-see. Luckily, it hits the airwaves every year around Easter/Passover, and has done since 1973, so it’s easy to catch. Cecil B. DeMille’s remake of his own 1923 treatment of the same story is the dictionary definition of “epic” with its sweeping, massive set, mind-boggling cast, and overall Big Damn Production. It’s overblown, even a little ludicrous, but at the same time, this story of Moses’ liberation of the Hebrews from Egypt has a certain magnificence that only DeMille could have given it. It’s incredibly extravagant and runs four hours, so prepare to arrange some intermissions if you must. You might giggle at some quaint or dated or kind of pompous moments but you won’t be bored. It takes a big story, gives it a cast of stars (Charlton Heston, Yul Brynner, Edward G. Robinson, Vincent Price, Anne Baxter and Debra Padgett for starters), and gives it an opulent, sprawling, color-saturated, mind-blowingly excessive field on which to play that story out. It’s eye-popping and a genuine spectacle. —Amy Glynn\n98. Lola Montes (1955)\nWay back in the early 2000s, the films of German-born, Paris-based director Max Ophuls languished out of print. His fin de siècle Europe, aristocratic mores, women on the verge of nervous breakdowns and loooooong tracking shots fell out of sight. But with the availability of the fever dream of his financially and critically catastrophic last feature, Lola Montès, our portrait of the artist in his final years is complete. Eliza Rosanna Gilbert—a dancer and actress most often called by her stage name, Lola Montès—pioneered the “cult of celebrity.” Paramour to composers Franz Liszt, Frederic Chopin and Richard Wagner, not to mention numerous dukes, counts and even King Ludwig I of Bavaria, her affairs were fodder for the papers, and sometimes cause for riots. Ophuls anticipates such modern media circuses, eschewing simple biography for his heroine and setting her in a context more grandiose and garish: a real circus. —Andy Beta\n97. Kanal (1957)\n“Watch them closely, for these are the last hours of their lives.” The voiceover that opens Kanal, which simultaneously introduces us to a depleted company of the failed Warsaw uprising and foretells of its imminent grisly fate, powers Andrzej Wajda’s “resistance” movie with a morbid fascination. Aware of their slim chances of survival with the German army tightening its grip all the time, the remaining men and women of Lt. Zadra’s Home Army unit escape to the sewers, not because they think that offers much chance of survival, but because their instincts keep driving them to live, even if just for a few moments more. But the confusion and strange terror down there, in the foul winding tunnels of an underground maze of waste, make them a pitiful few last hours. All sense of time and geography is lost: it’s just mysterious bodies, wading in perpetual night through a river of shit. Sandwiched between A Generation and Ashes and Diamonds, as the least complicated and political of Wajda’s war trilogy, Kanal is as pure a portrayal of human desperation as one might find in the cinema. —Brogan Morris\n96. Les Enfants Terribles (1952)\nJean Cocteau adapted this screenplay from his own novel and Pierre Melville directed. A tale of mind games and manipulations, it features Cocteau’s dreamlike, poetic sensibility and Melville’s lucid, deft direction. Edouard Dermit plays Paul, a sensitive young man who’s a bit obsessed with a girl named Agathe (Renee Cosima), to the consternation of Paul’s sister Elisabeth, who has a rather inappropriate fascination with her brother. Cosima also plays (in drag) school bully Dargelos, who sees to it Elisabeth gets her karmic just desserts after jealousy leads her to thwart the romance between her brother and Agathe. It’s fantastical in tone, with Cocteau’s typical poetry-infused visual sensibility. He also provides the narration, which some critics have found to be a bit over the top—in any event the overall impression is that while Melville might have directed it, this is really Cocteau’s film. It’s strange and dreamy and full of adolescent angst. Probably not the finest work of either Melville or Cocteau, Les Enfants Terribles remains an intriguing collaboration between two masters of mid-century French cinema. —Amy Glynn\n95. Blackboard Jungle (1955)\nRichard Brooks’ glorified after-school special is fascinating for the film it could’ve been: something truly subversive, an indictment of America’s post-war social systems and a loud screed against systemic racism. Instead, Blackboard Jungle is a movie divided, willing to confront some serious issues but unwilling to make much noise about it. Preluded by a title card warning that the film isn’t about all public schools, but is rather a look at the rising tide of juvenile delinquency spreading into some public schools, the film from its very first moments shifts blame to the kids acting out, diluting deeper messages about the broken systems which failed, and continue to fail, these kids in the first place. After all, a young teacher (Glenn Ford) with an expecting wife believes that every kid deserves a shot at a good education, but after his wife ends up in the hospital due to some harassment care of a few hooligans unafraid to go too far, he must admit that some bad apples are just straight-up rotten. Sidney Poitier stars in one of his first films as an ally to the beleaguered teacher, and Ford is predictably committed to the melodrama, but the film shines in its subtler details—the use of Bill Haley’s “Rock Around the Clock” to signal the dawn of a youthful revolution, or the majority of the school’s teachers being WWII veterans returned to a country which doesn’t seem to appreciate them—pointing to a much thornier film in Blackboard Jungle’s marrow. —Dom Sinacola\n94. Ace in the Hole (1951)\nBilly Wilder’s cynical streak is a mile wide in this story of muckraker journalist Chuck Tatum, who plots an amoral scheme to take advantage of a collapsed mine incident in the deserts of New Mexico. Starring Kirk Douglas in full snarling villain mode, it’s a film that looks squarely at the relationship between the press and public calamities that allow it to sell papers. If you have any preconceived notions about ’50s movies being wholesome, Ace in the Hole will soon put those to bed.\n93. Curse of Frankenstein (1957)\nThe presence of color, glorious color, is an overlooked moment in the evolution of horror cinema, but 1957’s Curse of Frankenstein is one of its most important moments. After years of the classic Universal monsters being absent from the spotlight, Hammer Film Productions chose to bring the greatest of them—Frankenstein’s Monster—back to life in a manner that fit the times and once again put the fear of God into audiences. And it’s the richness of the color—the red of arterial blood, the vivid green of Dr. Frankenstein’s traveling cloak, the blue of a dark, shadowy laboratory—that helped create Hammer’s signature vibe, dripping with gothic opulence and grandeur. The roles here are also reversed: The monster this time around (Christopher Lee) is presented as dangerous but more or less thoughtless, an unfortunate automaton who is less than the sum of his stitched-together parts. The true monster is Dr. Frankenstein himself, masterfully played by an imperious Peter Cushing. His blithe disregard for ethics, his own life and the lives of his friends are an obvious influence on the caddish, antihero scientists who came after, such as Jeffrey Combs’ Herbert West in 1985’s Re-Animator. Unlike Colin Clive in the 1931 Universal original, Cushing would never be mortified by the results of “tampering in God’s domain.” Each discovery only pushes him to go further, deeper into his own damnation. —Jim Vorel\n92. A Star is Born (1954)\nJudy Garland proves her nuance and dramatic skill in this archetypal Hollywood tale of rags-to-riches stardom. The story is practically written into the movie industry’s DNA—originally called What Price Hollywood?, the first version was made in 1932. Even with three iterations (and one more on the way, starring Lady Gaga and Bradley Cooper), the ’50s version is still likely the finest. Garland is Esther Blodgett, a homely small-town aspiring singer who is groomed and manicured into a perfect ingenue. But her enormous talent soon eclipses her beloved mentor, James Mason. Mason, a washed-up lush who is hopelessly in love with her. Almost Shakespearean in its tragedy—and in its epic length—A Star is Born is essential viewing.\n91. Picnic (1956)\nThere are only two plots in all of storytelling. One is “a hero sets out on a quest.” This is the other one: “A stranger comes to town.” This film, adapted from William Inge’s Pulitzer-winning play of the same name, depicts 24 hours in the life of a sleepy Kansas town during which several peoples’ lives are turned upside down by the arrival of chaos in the form of Hal Carter (William Holden), a down-on-his-luck former football star who’s passing through to connect with his old friend, Alan Benson (Cliff Robertson). He meets the Owens family (Kim Novak, Betty Field, Susan Strasburg) and their spinster-lodger Rosemary (Rosalind Russell) and sparks begin to fly. The movie is sweet and sad and angry and nostalgic and dreary all at once, and it put Kim Novak on the Hollywood map—all good things. But the takeaway is that ultra-sexy can happen without anyone even touching. The dance scene between Holden and Novak, set to the gorgeous strains of “Moonglow,” is as steamy today as it was in 1955. —Amy Glynn\n90. Black Orpheus (1959)\nThe Greek myth of Orpheus and Eurydice has been the source of countless works of art over the centuries. Marcel Camus’ adaptation is set in a Rio de Janeiro favela and features a brilliant soundtrack by Tom Jobim and Luiz Bonfa. Brenno Melo plays Orfeu, a talented guitarist in a somewhat reluctant engagement to Mira (Lourdes de Olveira) who falls in love with Eurydice (Marpessa Dawn). Eurydice is taken from him by Death. Orfeu tries to get her back, fails, and is killed by the jilted Mira. It’s an ancient story and Camus does a marvelous job of making it new and fresh in its recontextualization. The samba and bossa nova music are befitting of mythology’s greatest singer-songwriter, and the production is stylish and colorful and full of heart. Visually lush and ebullient, this is a film to roll around in, not to be overly cerebral about. Lavishly sensuous, with stunning cinematography and a soundtrack to die for (and come back from Hades to hear all over again). —Amy Glynn\n89. The Browning Version (1951)\nAnthony Asquith directed this adaptation of a stage play by killer British playwright Terence Rattigan, who also supplied the screenplay. Together they afforded Michael Redgrave what just might be his best performance ever. The story of a boarding school teacher whose life goes into freefall is one of the great-granddaddies of the Teacher Who Actually Schools You that has become one of the tropes that never gets old (Lookin’ at you, Stand and Deliver!). The great strengths here are absolutely the script and Redgrave’s performance-he does as spectacular job with what is actually a pretty dreary subject: Life falling apart. He breathes life into a potentially airless character and his performance is riveting. —Amy Glynn\n88. Night and Fog (1956)\nReleased 10 years after the liberation of prisoners from the Nazi concentration camps, Night and Fog was almost never made. Any number of reasons contributed to its tenuous birth: that noted documentary director Alain Resnais refused repeated attempts to helm the movie, insisting that a survivor of the camps be intimately involved, until screenwriter Jean Cayrol came on board, himself a survivor of the Mauthausen-Gusen camp; that Resnais and collaborators battled both French and German censors upon potential Cannes release; or that both Resnais and Cayrol themselves struggled with especially graphic footage, unsure of how to properly and comprehensively depict the unmitigated horror of what they were undertaking. Regardless, the film found release and is today, even at only 31 minutes, an eviscerating account of life in the camps: their origins, their architecture and their inner-workings.\nYet, most of all, Night and Fog is a paean to the power of art to shake history down to its foundational precedents. Look only to its final moments, in which, over images of the dead, emaciated and piled endlessly in mass graves, narrator Michel Bouquet simply asks to know who is responsible. Who did this? Who allowed this to happen? Which is so subtly subversive—especially given the film’s quiet filming of Auschwitz and Majdanek, overgrown and abandoned, accompanied by lyrical musings and a strangely buoyant score—because rarely do documentaries demand such answers. Rarely do documentaries ask such questions. Rarely is truth taken to task, bled of all subjectivity, and placed naked before the audience: Here is evil, undeniably—what will you do about this? —Dom Sinacola\n87. East Of Eden (1955)\nElia Kazan’s adaptation of the Steinbeck novel of the same name might be most famous for being the film that launched the brief but meteoric career of James Dean. A cheery little Cain and Abel story set in the lettuce-farming country of California’s Salinas Valley, the film garnered intense critical acclaim for Kazan’s masterful use of CinemaScope technology to create a beautiful, moody mise en scene. Critical opinion was divided on Dean, whom some found pointlessly histrionic. Others have pronounced his fiery confrontations with his pious father (Raymond Massey) to be compelling and masterful. Whichever way you see it, there’s strong consensus that this film created the persona of disaffected bad-boy Dean, whose iconic rebelliousness defined teenage rebellion and the generational divide that widened into the 1960s. —Amy Glynn\n86. Horror of Dracula (1958)\nHorror of Dracula is either the second or third most iconic “classic vampire” film ever made, trailing only the 1931 Bela Lugosi Dracula and possibly the original Nosferatu. But really, if you were going to put together the ultimate, time-spanning Dracula film, you’d choose this version of the vampire, as played by the regal, intimidating Christopher Lee at the height of his powers. Horror of Dracula is simply a gorgeous movie, with lush, gothic settings—crypts, foggy graveyards and stately manors—photographed with the Golden Age charm of Technicolor. It has the best version of Van Helsing ever put to film (the aquiline, gaunt-looking Peter Cushing), some of the best sets and an omnipresent feeling of refinement and grandeur. Dracula, as played by Lee, is a creature of dualities—preferring to use very few words and simply influence through his magnetic presence, but also just moments away from leaping into action with ferocious animality. Along with Curse of Frankenstein, it’s the film most responsible for the late ’50s to early ’70s revival of classic gothic horror via Hammer Film Productions in the UK, which would produce dozens of takes on Frankenstein, The Mummy, and no fewer than eight Dracula sequels. The first, however, is unquestionably the best—so effective that it typecast Christopher Lee as a horror icon for decades, exactly as Dracula did to Bela Lugosi. —Jim Vorel\n85. Father of the Bride (1950)\nDNA tests have not been conclusive, but this Vicente Minelli comedy is possibly also the father of Nora Ephron and John Hughes. A nostalgia-bomb comedy about an anxious father (Spencer Tracy) coming to terms with the fact that his baby (Elizabeth Taylor) is not a baby anymore. The film might seem like a bit of a lightweight, but it’s worth noting it received Oscar nominations for Best Actor, Best Screenplay and Best Picture. It’s a warmhearted and funny look at parent-child control struggle, anxiety, and confronting the need to let go, and a poignant picture of family life in the postwar United States. It’s not necessarily an epiphany—just a really well done classic comedy with great writing, great acting, and surefooted direction. —Amy Glynn\n84. Throne of Blood (1957)\nIn adapting Macbeth from Scotland to feudal Japan, Akira Kurosawa visually inflected his version with an evocatively chilly ambience—especially with its preponderance of fog and that seemingly isolated castle in the mountains—that gives William Shakespeare’s tragedy of ambition run amok the feel of a horror movie. He also brought elements of Noh theater into the mix—seen in its ceremonial set designs, Masaru Sato’s use of flute and drum in his score, and especially in the deliberately affectless performance styles of Isuzu Yamada and Chieko Naniwa—that has the effect of giving Throne of Blood a ritualized feel, a sense of haunting inevitability. In Kurosawa’s hands, one hardly needs Shakespeare’s own language to experience the horrifying poetry of Washizu’s (Toshiro Mifune) inexorable path toward his own personal doom, imprisoned not just by greed, but also by fear, guilt and heavens-defying egotism. Here is one of cinema’s rare shining examples of a great director transforming a great play and making it indelibly his own. —Kenji Fujishima\n83. The Man Who Knew Too Much (1956)\nSix words: James Stewart, James Stewart, James Stewart. Man, that guy was pitch perfect in pretty much everything, but put this jewel in the setting of a classic Hitchcock noir and you are in for a treat. Hitchcock made this film as a Technicolor reboot of his own 1934 treatment of the same story. Critical debate continues to percolate over which version is better. Hitch famously quipped “Let’s say the first version is the work of a talented amateur and the second was made by a professional.” It took the Oscar for best song and left Doris Day’s rendition of “Que Sera, Sera” permanently imprinted on American cultural vernacular. Some might call this a laconically paced thriller, but Hitchcock took the time to make ample use of the wonderful settings afforded by shooting on location in Morocco, and elicits wonderful performances from the whole cast. For a Hitchcock movie this one’s got a relatively high number of slow moments, but the last act’s a masterful thrill-ride and the rest of the time, Hitchcock’s beautiful compositional sense and the superb acting are more than enough to hold your interest. —Amy Glynn\n82. Godzilla (1951)\nIt’s amazing, isn’t it, how something so seemingly childish and flat-out dopey on paper could be as substantive, and as enduring, as Ishiro Honda’s Godzilla? Hire a couple of actors and have them alternate donning an unwieldy rubber monster suit, and then let them stomp all over a miniature Tokyo set, smashing buildings with wild abandon, and presto: Just like that, you’ve made unexpected movie history. However silly Godzilla sounds when broken down into its component parts, it remains every bit as meaningful today as it did back in 1954, less than a decade after the U.S. of A. dropped nuclear ordnance on Hiroshima and Nagasaki, a colossal and nightmarish metaphor for the horrors of nuclear warfare. The King of the Monsters’ first major outing spawned legions of imitators and about as many sequels and spin-offs and reboots—we’re still making Godzilla movies, after all, and will continue to if Warner Bros. has anything to say about it – but there’s only one Godzilla movie that matters, Honda’s, a film awash in the fears of a nation and ablaze with radioactive nihilism. —Andy Crump\n81. Othello (1951)\nSo, Orson Welles was a supergenius. And studios just hated the guy. He was beset with financial tribulations and pull-outs and bait and switches and catfights every time he got behind a camera. He might be one of cinema’s most enduring examples of creativity being generated by constraint, sometimes perhaps more than it is by unfettered freedom. Welles’ Othello is arguably mandatory viewing for anyone who wants to make a movie on a shoestring budget. It took four years (and three Desdemonas) to make this movie because he couldn’t secure studio backing and would shott until he ran out of dough, then resume when he’d scored a few acting gigs. It was ridiculous and a testament to Welles’ genius or the existence of miracles or both that the film isn’t an epic disaster. On the contrary—it’s fascinating. Many Shakespeare adaptations of this decade focused on extreme faithfulness to the original scripts—Welles cut Othello down to a zero-body-fat 92 minutes. The film uses fast, choppy cuts and intriguing angles to produce a quite Expressionist version of Shakespeare’s tragedy, and it doesn’t look remotely accidental or like the product of a production that stopped and started repeatedly over an agonizing four years. Welles himself is a wonderful Othello, and Suzanne Cloutier as Desdemona matches his energy beautifully, but the real star here is the directorial moxie and quick-wittedness and sheer tenacity of vision that got the thing onscreen. Welles fought hard for this movie and the result is a beautiful and fascinating take on one of Shakespeare’s darkest plays. —Amy Glynn\n80. The Barefoot Contesssa (1954)\nLong, long before Ina Garten was whipping up crabcakes on the Food Network, a nice young lady named Ava Gardner was emitting some serious BTUs as fictional Spanish sex symbol Maria Vargas. Down and out filmmaker discovers sizzling talent in Madrid nightclub, reignites his own career and starts hers, things happen, and Vargas ends up married to a count. There is much bling and sparkle and glam and a very unhappy ending. Joseph Mankiewicz’s original screenplay earned him an Oscar nomination and the film is considered one of the quintessential “Hollywood” high-glamor Golden Age films, although in fact it was entirely produced in in Italy. Critical opinion on the film was rather cleft when it was released: Some admired its decadence while others considered it exemplary of everything wrong with Hollywood culture, crass and unsubtle. I see it as a great meditation on Show Biz cynicism. What most folks agreed on was that Gardner was the hottest thing on celluloid. —Amy Glynn\n79. Pather Panchali (1955)\nSatyajit Ray’s Pather Panchali is, depending on who you ask, either the saddest movie ever made or one of the saddest, and if you don’t believe the former then you likely believe the latter (unless you are made of stone, but aside from rock golems and Republicans, people tend to be made of flesh and blood). But whether the film makes you weep more or less is, perhaps, besides the point. When we talk about the classics of cinema, we talk about influence, and one note worth making about influence is that it comes in all shapes and sizes: Some movies have impact on a micro scale, others on a macro scale. Pather Panchali’s influence may be best evinced on a micro scale, in specific relation to Indian cinema, presenting a watershed moment that sparked the Parallel Cinema movement and altered the texture of the country’s films forevermore.\nThis, again, isn’t proof of Pather Panchali’s actual substance, though let’s be realistic here: Ray’s masterpiece doesn’t need to prove anything to anyone. It’s extraordinary on its authentic artistic merits, an aching, vital movie crafted to transmute the harshest rigors of a childhood lived in rural India into narrative. Maybe it’s presumptuous for an American critic with no frame of reference for Pather Panchali’s cultural context to describe the film as “true to life,” but Ray is so good at capturing life with his camera that we come to know, to understand, the life of young Apu, regardless of who we are or where we come from, and isn’t that just the absolute definition of cinema’s transporting power? —Andy Crump\n78. Les Diaboliques (1955)\nWatching Henri-Georges Clouzot’s Les Diaboliques through the lens of the modern horror film, especially the slasher flick—replete with un-killable villain (check); ever-looming jump scares (check); and a “final girl” of sorts (check?)—one would not have to squint too hard to see a new genre coming into being. You could even make a case for Clouzot’s canonization in horror, but to take the film on only those terms would miss just how masterfully the iconic French director could wield tension. Nothing about Les Diaboliques dips into the scummy waters of cheap thrills: The tightly wound tale of two women, a fragile wife (Véra Clouzot) and severe mistress (Simone Signoret) to the same abusive man (Paul Meurisse), who conspire to kill him in order to both reel in the money rightfully owed the wife, and to rid the world of another asshole, Diaboliques may not end with a surprise outcome for those of us long inured to every modern thriller’s perfunctory twist, but it’s still a heart-squeezing two hours, a murder mystery executed flawlessly. That Clouzot preceded this film with The Wages of Fear and Le Corbeau seems as surprising as the film’s outcome: By the time he’d gotten to Les Diaboliques, the director’s grasp over pulpy crime stories and hard-nosed drama had become pretty much his brand. That the film ends with a warning to audiences to not give away the ending for others—perhaps Clouzot also helped invent the spoiler alert?—seems to make it clear that even the director knew he had something devilishly special on his hands. —Dom Sinacola\n77. The Quiet Man (1952)\nSeen today, John Ford’s 1952 Ireland-set comedy/drama/romance plays as both squarely of its time and enchantingly outside of it. On the minus side, there are its thorny gender politics. Though the female love interest, Mary Kate Danaher (Maureen O’Hara), exhibits a feistiness and a desire for agency that could be seen as proto-feminist to modern eyes, she’s ultimately put at the mercy of the hyper-masculine ex-boxer Sean Thornton (John Wayne), who is finally forced to tap into the violent side he’s so desperate to escape in order to consummate their marriage. The fact that Sean is an American—though of Irish origin, having been born in Innisfree, the village he returns to in the film—and Mary Kate a lifelong Irishwoman gives their dynamic a faint imperialist air as well. And yet, Ford, more often than not, disarms criticism by sheer virtue of his lyrical sensibility, reserves of deep feeling, and humane attention to character detail. The Technicolor Ireland of The Quiet Man is clearly a lush dreamscape: an out-of-time haven of hearty romance and even heartier community. Not that it’s a paradise, necessarily, as Sean finds himself stymied to some degree by Irish traditions that go against his much-more-forthright American upbringing. But this is not the dark and brutal vision of Ford’s later 1956 masterpiece The Searchers, with an outlaw outsider finding himself perpetually unable to fit into any established order. Here, in the looser-limbed and lighter-hearted The Quiet Man, Sean and the Irish locals eventually find common ground, albeit through a perversely extended brawl that plays as a purifying male-bonding session. —Kenji Fujishima\n76. Witness for the Prosecution (1957)\nA courtroom drama with noir leanings, based on a story by Agatha Christie and directed by the always-fascinating and sometimes really-damned-weird Billy Wilder? Yes, please. Tyrone Power’s last role was as accused murderer Leonard Vole, defended by barrister Sir Wilfred Robarts (Charles Laughton). He’s believed to have done in a besotted, wealthy widow, Emily French (Norma Varden) who’d been kind, or dotty, enough to make him the beneficiary in her will. Marlene Dietrich rounds things out as Vole’s wife, who both provides an alibi for her husband and testifies for the prosecution that the man admitted to the crime. Say it with me: Hijinks Ensue, Christie style. And if there was anyone who could match Christie for Twistedness factor, it was surely Billy Wilder. The surprise ending staggered audiences (and no, I’m not telling), the acting crackles with life from end to end (especially in Laughton’s case), and the mise en scene is fabulously dramatic. This is a master of suspense placed into the hands of a master or weirdness and subtlety and it is just plain riveting. —Amy Glynn\n75. The Wild One (1952)\nMarlon Brando—the whirling dervish and one-man force of nature who forever changed screen acting—had better roles than Johnny from The Wild One. But they didn’t often come cooler. The young, fulsome Brando is a pin-up dream in his leather biker jacket and hat, cruising through an unsuspecting and nervous town with his motorcycle gang. Feeding into fears of teenage juvenile delinquency of the era, The Wild One is essentially youthful drive-in movie fare. But the film is forever elevated by the pouting, menacing Brando, whose response to the question “Whaddya rebelling against, Johnny?” is as memorable as they come: “What have you got?” —Christina Newland\n74. The War of the Worlds (1953)\nTo many this is the definitive screen version of H.G. Well’s classic story of alien invaders—a Technicolor marvel of its day that won an Oscar for its visual effects and left an indelible mark on popular science fiction for the next four decades. Essentially the popcorn crowd’s alternative to the more cerebral and talky Day the Earth Stood Still, this adaptation of the 1898 novel effectively kicked off the “alien invaders” era of ’50s sci-fi, which would also give us the likes of Earth vs. the Flying Saucers. It’s actually legitimately scary at times, especially when the protagonists are confronted with the Martians themselves, outside the confines of their war machines. The gross design of the creature, with its tri-colored eyes and squat body, calls to mind a less pleasantly anthropomorphized version of Spielberg’s E.T., in the ickiest manner possible. Overachieving special effects wizardry make The War of the Worlds a must-watch for anyone with an interest in vintage practical effects. —JimVorel\n73. Richard III (1955)\nLaurence Olivier wrote, directed and starred in this adaptation of one of Shakespeare’s greatest historical plays, which also features John Gielgud, Ralph Richardson and Claire Bloom. While perhaps not the most brilliantly executed of Olivier’s Shakespeare adaptations (among other things, Olivier’s dominating presence is slightly distracting), it arguably did more to popularize and increase modern audiences for Shakespeare’s work because it was seen by so many. Richard might be Shakespeare’s nastiest villain, and Olivier definitely creates a monstrous monarch. There is a well-executed sense of courtly grandeur and the acting is superb across the board. One of the truly classic film adaptations of the Bard. —Amy Glynn\n72. The Ladykillers (1955)\nWatching The Ladykillers, one can’t help but notice the way it tends to play like a stage show, with its limited location, cast of archetypal criminal characters and “comedy of doors” mentality—it’s honestly surprising that it took 56 years for it to be adapted as a play in 2011. This is “dark comedy” indeed, as the gang of thieves led by Prof. Marcus (a ghoulish-looking Alec Guinness) take up roost in the home of a cantankerous old woman, Mrs. Wilberforce, posing as a string quartet while they pull off a major robbery. Of course, when the suspicious old bird catches wind of their scheme, her own life is thrown into the fray, and a startling, ever-mounting string of double and triple crosses begins to thin the ranks of the criminals. Veteran British actress Katie Johnson steals the show in her iconic turn as Mrs. Wilberforce, whose “cry wolf” stories have cast her in the role of local eccentric—it was one of the last roles that Johnson ever played before her passing less than two years later. The bickering between thieves recalls the heyday of Hollywood’s own screwball comedies, but the murderous undertones make one wonder if this might not have been the result if Alfred Hitchcock decided to make a crime comedy. —Jim Vorel\n71. The Red Badge of Courage (1951)\nIn a rare example of a film surviving studio butchery with value and some auteurial vision intact, The Red Badge of Courage in its only viewable form—a studio-mandated 69-minute cut, with director John Huston’s own 95-minute version long thought lost—may be a sketch of the director’s original intent, but it’s still a substantial one. An adaptation of Stephen Crane’s Civil War novel, noted for its realism, Red Badge casts actual WWII hero Audie Murphy as Union trooper Henry Fleming, who flees from his first skirmish only to later seek redemption through recklessness on the battlefield. Huston’s noir-ish touches lend a despairing claustrophobia to an already despairing tale; Crane’s is a deeply unromantic war story, where proving one’s “courage” means shedding blood, and the natural instinct to fly from a slaughter is considered cowardice. Huston’s longer cut promised more fleshed-out portrayals of Henry’s platoon mates, but the film in its abbreviated form might actually be at an advantage: in keeping the other characters as ciphers, the movie heightens Henry’s isolation and makes an unintentional point about the soldiers in the bloodiest war fought on American soil being treated not as individuals, but pure, anonymous cannon fodder. —Brogan Morris\n70. The Killing (1956)\nOnce upon a time, before Stanley Kubrick entered the pupal stages of his career and subsequently emerged as a god and master of his medium, he made movies like The Killing. Lean, mean and economical to a fault, The Killing gets lost in the shuffle of Kubrick’s career landmarks, but the man wielded impressive influence even in overlooked 80-minute heist flicks. (The Quentin Tarantino we all know and love and loathe might be a very different filmmaker today if not for The Killing.) Kubrick’s work here is no-frills and elegantly straightforward: Sterling Hayden plans one final holdup before retiring and settling down with Coleen Gray. No twists and turns, just good old-fashioned theft at the racetrack. The film revels in the gray morality of Hayden’s good intentions. Crime pays, at least until it doesn’t. —Andy Crump\n69. Cinderella (1950)\nDisney Studios was $4M in debt when they made this adaptation of the well-known fairy tale “Cendrillon” by Charles Perrault. I know, hard to believe, but they’d had a string of costly flops, including Fantasia and had lost their European market to the war. The film opened in 1950 to thunderous critical applause and put the studio well on its way back to being in the pink—by which I mean health, though it’s worth noting that this film is a direct ancestor of the Pink Sparkly Princess Syndrome that has become pandemic in three-to-seven-year-olds. While there might be no excuse for the merch-floods for which Disney is famous, this film is the real deal, one of the best animated features ever made. Disney pioneered the use of overdubbed vocals for the song “Sing, Sweet Nightingale,” creating the effect of the character singing harmony with herself. Salvador Dali and Christian Dior are said to have been direct influences on the clothes worn by the characters. The plot’s been with us for centuries, so I’ll forego the recap and say that the film takes full advantage of Disney’s fathomless imagination, mixing fantasy and humor and music in a way that captivates children more than sixty years later. And even though adults know “happily ever after” is a mixed bag at best, this film will probably still make you believe in it too. At least for a couple of hours. —Amy Glynn\n68. Kiss Me Deadly (1955)\nCompletely at random, Mike Hammer (Ralph Meeker) nearly runs over a girl wearing nothing but a trenchcoat. While she’s soon caught by the police, Hammer’s intrigued by her tale and begins investigating her past. The very act of pursuing this sets a whole gang of mobsters, FBI agents and seemingly everyone else in the world against Hammer, all the while the girl’s identity and what secrets she was hiding become if anything less clear. That’s the world of Kiss Me Deadly, in which everyone, including Hammer, is a liar only looking out for themselves, yet the stakes are much higher than mere personal gain.\nFew movies have ever been so perfectly of-their-time as Kiss Me Deadly. Anticipating the paranoid worlds of Thomas Pynchon and Don DeLillo a decade before they began publishing, it’s a perfect distillation of Cold War fear and dread molded into typical noir trappings. Of course, the search for a MacGuffin is nothing new to the genre, but here it’s given social context that transforms it from a plot device into an all-consuming philosophy. When given a new car, Hammer knows that it’s rigged to blow up in two different ways not because of any evidence but simply because that’s how the universe now works. “They” are always after him, and the “great what’s-it” he finally arrives at is every bit as apocalyptic as he thought it would be.\nEmphasizing this is the intense stylization by director Robert Aldrich. Noirs are always known for their canted frames and chiaroscuro lighting, but here these stylistic elements are more than just conventions, they’re thematic commentary on the story. There’s always someone hiding in the shadows, and the odd angles characterize an essential inability to understand why things are happening. Disorientation, from the film’s trademark backwards title sequence to point of view shots that seem to come from no one, are Kiss Me Deadly’s norm.\nKiss Me Deadly was one of the last of the great true noir movies before Touch of Evil effectively destroyed the genre, but after Kiss Me Deadly there wasn’t much further for them to go. The noir had found its perfect topic in nuclear paranoia and had also become self-conscious, such that Kiss Me Deadly delivers its promised genre thrills while simultaneously acting as criticism of the direction hardboiled detective movies and books (particularly those by Mickey Spillane) had taken. There are certainly more accomplished movies in the genre, both the slicker Hollywood prestige noirs from a decade earlier and the artistically mesmerizing pictures Orson Welles was producing, but Kiss Me Deadly is the picture that took the style as far as it could go without jumping into self-parody. In the years since its release, Kiss Me Deadly has been copied so many times that many of its boldest elements are familiar, but they’ve done little to dull its overall impact.\n67. The Thing From Another World (1951)\nThere’s some debate over how much of The Thing From Another World was directed by the credited Christian Nyby and how much came from the overseeing hand of Howard Hawks, but whoever directed it, they produced one of the best science fiction/horror crossovers of the 1950s. The characters aren’t so memorable as in John Carpenter’s 1982 remake, but the setting and sheer creepiness fill the gap. The moment when The Thing comes storming into the darkened barracks out of the arctic cold, backlit and looking like an indestructible goliath, is so seminal that even before he conceived of his remake, John Carpenter couldn’t help but putting it into a TV broadcast in Halloween by way of showing his fanboyism. There’s a definite strain of Cold War-era paranoia in the arctic air, a fear of the “other” as calculating alien and threat to all mankind. And then of course you have one of the most iconic closing monologues in sci-fi history: “Tell the world. Tell this to everybody, wherever they are. Watch the skies everywhere. Keep looking. Keep watching the skies!” —Jim Vorel\n66. Harvey (1950)\nWealthy, affable drunk plus imaginary 6’4” bunny equals Pulitzer Prize, Broadway smash, and film adaptation starring the inimitable Jimmy Stewart as Elwood P. Dowd, whose drunken antics are not a problem for the locals until he starts claiming to see a pooka (a trickster spirit from Irish folklore). Suddenly, Elwood’s not so acceptable any more. Except Harvey, the imaginary rabbit, exerts an odd transformative effect on the other characters—with the exception of Elwood’s snobby sister Veta (Josephine Hull), who by the way is the only other person who can see Harvey. Veta tries to have Elwood committed to a mental hospital (his rabbit-antics are interfering with her plans to marry her daughter Myrtle (Victoria Horne) to A Good Match). Veta ends up getting herself committed instead, but the hospital director, Dr. Chumley, begins seeing Harvey as well (awkward…). A whimsical little fantasy/farce with a warm heart, Harvey is also a bit of a meditation of tolerance and the merits of “reality”; the drunken and possibly addled Elwood is significantly happier than the “normals” who surround him. It’s a lightweight film, but the sheer force of James Stewart’s charisma could make just about anything riveting. Even an invisible bunny. —Amy Glynn\n65. Houseboat (1958)\nIn a lot of ways, Houseboat is a bit of a trivium, although it’s never unsatisfying to watch Cary Grant or Sophia Loren, like, ever. Grant plays a widowed father who takes his rather bratty and coddled children to live on a busted-up houseboat, ends up with Sophia Loren as his housekeeper and falls in love with her. It’s a star-vehicle romantic comedy with a kind heart and while it’s enjoyable generally, it won’t strike everyone as cinematic dynamite. There is really one standout feature to this film, but it’s significant because it was really unusual for its time. This film is very focused on the emotional world of the children and is surprisingly clear-eyed and perspicacious about the mixed emotions kids have when their parents repartner. Falling in love with Sophia Loren is easy. Winning back the hearts of your disaffected children? That’s serious. And Melville Shavelson takes it seriously in this film. It’s subject matter that does not always get much authentic consideration in films of this era and genre, and it is worth watching if for no other reason than to see Grant take it on with his typical panache. —Amy Glynn\n64. Julius Caesar (1953)\nOne of several renderings of classic Shakespeare plays made during the 1950s, this treatment of Julius Caesar is not cinematically groundbreaking; indeed it feels quite a lot as though you’re watching a film of a stage play. Which is okay. What matters here, folks, is the acting. The story is a well-worn classic, Shakespeare’s script has so thoroughly infiltrated the American lexicon that you’ve probably quoted it without even knowing you were doing it, and Mankiewicz’s directorial style is clean, concise and understated, giving as much space as possible to the actors. Caesar (Louis Calhern) is wonderfully imperious, but the standout performances are Sir John Gielgud as Brutus and the stunning Marlon Brando as Marc Antony. The acting is so spectacular that one wonders whether a more “imaginative” or “re-interpreted” directorial style might have obscured or obstructed it. Gielgud’s Brutus is intense and intelligent and melancholy; Brando’s Antony is passionate and fiery. This is quite simply a fantastic ensemble cast handling one of the great texts of Western literature. —Amy Glynn\n63. Voyage to Italy (1954)\nThe third and final film in director Roberto Rossellini and actress Ingrid Bergman’s ravishing treatment of “this postwar tragedy” is also, after a fashion, the simplest: Scuttling the psychic extremes of Stromboli (1950) and Europe ’51 (1952), its portrait of a marriage suddenly exposed by the absence of more pressing conflicts is unmannered, naturalistic and distinctly modern, as if it were being imagined before our eyes. Though Katherine (Bergman) and Alex (George Sanders) travel to Italy to sell an inherited estate, the film’s gesture at a narrative seems almost moot when set against its emotional and aesthetic rigors; it is, at heart, a scintillating excavation of life avant le deluge, and of the impossibility of resuming it once the world has almost ended. By the time it makes the conceit explicit, as Katherine and Alex wander the ruins of Pompeii, Voyage to Italy emerges as perhaps the most delicate rendering of the war’s aftermath this side of Tokyo Story: “Life is so short,” Katherine says, crying, in the film’s closing sequence. “That’s why,” Alex responds, “one should make the most of it.” —Matt Brennan\n62. Orphee (1950)\nIn the “totally brilliant but probably not to everyone’s taste” category is Jean Cocteau’s poetic and symbolism-heavy take on the myth of Orpheus. (Well, one of them; it was a trope to which he returned in two other films.) Jean Marais plays the title role in a retelling of the myth set in 1950s Paris, where a plot rife with love-and-death triangles unfolds in Cocteau’s otherworldly, beautiful-but-cryptic style. This film is clearly the work of a poet (the Orpheus myth has preoccupied poets for centuries but Cocteau’s directorial style is also poetic, allusive and pensively paced). Cocteau was also an opium addict, which definitely informs the dreamlike quality of the film and the preoccupation with slipping between the worlds of the living and the dead. Were you to call Orphee pretentious I’m not sure I’d bicker with you, but it is also a relic of a cinematic era that is simply gone, and it’s one of that era’s more beautiful and intriguing artifacts. Whether his style delights or annoys you, Cocteau was indisputably a genius, and this expressive, magical, rather haunting film probably approaches poetry as closely as the medium of film can. —Amy Glynn\n61. Cat on a Hot Tin Roof (1958)\nIt is a testament to the magical powers of Tennessee Williams that two cinematic retreads of this movie (one in the 1970s, one in the 1980s) appeared after Elizabeth Taylor and Paul Newman nailed it so thoroughly you’d have to be high to think you could top it. Then again, there was a certain amount of hubris in Richard Brooks deciding to handle the screenplay himself when he had Williams himself available. In a wealthy Southern family, Big Daddy (Burl Ives) is unaware he’s on the way out from cancer—but that fact isn’t lost on the rest of the family, who are hovering and drooling over his fortune. The operative word for this film: Hot. As in sweltering. As in oppressive, close, sticky-nasty hot. Williams’ story peels layer after icky layer off sexually frustrated Maggie (Taylor) and her tormented husband, Brick (Newman), revealing the baseness, mendacity and deceptiveness, or fragility and self-loathing that Williams seemed to find at the heart of a great many of his most enduring characters. Searing performances by Taylor and Newman, both at the height of their powers. —Amy Glynn\n60. An American in Paris (1951)\nThe movies have paid homage to Paris, la Ville Lumière, for decades, from Gigi to Funny Face, Amélie to Midnight in Paris, but it’s An American in Paris that may honor the city better than all the rest: It’s bright, colorful, atmospheric, an utterly transporting experience, the kind of movie that makes such prime use of its setting that for just under two hours, you’d swear you were walking its streets on your own two feet. An American in Paris came out right in the middle of the musical boom in Hollywood between the late 1940s and the late 1960s, a time when musicals moved box office receipts and drew all kinds of critical praise to boot, but really, when we think of classic musicals, we tend to think of Gene Kelly, and when we think of Gene Kelly, we think of An American in Paris (unless we think of Singin’ in the Rain first). If you like your musicals chock full of whimsy and driven by tone, though, An American in Paris sings a far sweeter tune. —Andy Crump\n59. I Vitelloni (1953)\nIf there’s any lesson worth learning from the history of Italian cinema, it’s that it’s generally unwise to bet against Federico Fellini. In most instances where producers or distributors cast a shadow of doubt on his films’ potential for success, the films in question perform performed so well that you’d swear they had minds of their own: It’s as if the movies, their value called into question, actively revolted against the qualms of Fellini’s superiors and hustled hard to make a buck at the box office. Take I Vitelloni. Fellini’s producer, Lorenzo Pegoraro, deflected the pleas of the distributor to shoot a new, upbeat ending that would utterly defeat the movie’s intentions not only as semi-autobiography but as a cohesive story. (Short version: The sudden discovery of an oil well in the film’s setting affords its characters instant wealth and happiness, leading to cheerful sing-song. Seriously.) Good thing he did, too. I Vitelloni was a hit, commercially and critically, so much so that it became the very first movie in Fellini’s body of work to receive distribution outside of Italy. Chalk that up to its universality. Whether you’re Italian, French, American, or any other nationality, you probably recognize a little of yourself in Fellini’s cast, their hopes, their dreams, their ambitions or lack thereof. —Andy Crump\n58. The Big Sky (1952)\nSaga Alert! Howard Hawks really was one of the great “go big or go home” auteurs of the mid-century, and while it seldom gets the accolades accorded to, say, Rio Bravo or The Big Sleep, if this Hawks film passed you by, I say go track it down and feast your eyes on the epic beauty of the Grand Tetons. A Western-ish drama set in the 1830s, it stars Kirk Douglas as Jim Deakins, a Kentucky frontiersman on a fur-trading trip up the Missouri. He and comrade Boone Caudill (Dewey Martin) find adventure and even some romance on their trip into the northwest frontier. There are comic inflections, in addition to Hawks’ signature attention to natural detail, and if the film runs a little long and maybe stays a bit light on the psychological depth side, this is still a beautifully shot meditation on the West. —Amy Glynn\n57. Elevator to the Gallows (1955)\nPrior to reinventing filmic language with their playful genre experiments, the members of France’s New Wave movement got their start as film critics. In fact, it was through their writings and discussions that the term “film noir” was first christened as a means of describing a certain breed of brooding postwar films. It’s not surprising then that Louis Malle—though not an official New Wave member—would settle on a film noir-influenced project as his first feature film. Acting both as an homage to noir as well as a subversion of its structure, Elevator to the Gallows stars Jeanne Moreau and Maurice Ronet as a pair of criminals whose plan to kill Moreau’s husband quickly falls apart when the Ronet character gets stuck in an elevator. This already absurd concept becomes all the more confounding when paired with the film’s unorthodox, experimental editing and somber, Miles Davis-performed jazz score. —Mark Rozeman\n56. House of Wax (1953)\nHere’s a trivia answer that never goes out of style: House of Wax was the first color 3D film from a major American studio, arriving only two days after the first black and white 3D movie, Man in the Dark. It’s also the film responsible for planting the idea of Vincent Price as a horror icon into the American subconscious—previous to this role, he had largely appeared in supporting parts, or in leading roles of dramas such as The Baron of Arizona. Here, though, Price finds his niche—a hammy, yet thespian quality that suggests he’s always in on the joke and enjoy enriching parts that wouldn’t have been at all memorable if they were coming from a lesser performer. He plays a talented wax sculptor who is maimed in a fire before setting off on a course of revenge against the world. Preying on young women in the area, he sets his sights on one in particular who is the spitting image of his destroyed masterwork, a sculpture of Marie Antoinette. The film has moments of effective creepiness that still resonate, as when Price is chasing the heroine down a foggy street at night, but much of the film is simply campy fun in the same vein as William Castle’s 1950s output—it’s no wonder he was drawn to Price for House on Haunted Hill and The Tingler. The moments meant to shamelessly showcase the 3D technology, such as the wandering paddle ball performer who bats his projectiles straight at the camera, are especially fun to chuckle at in 2017. —Jim Vorel\n55. Rififi (1955)\nBlacklisted and in exile, director Jules Dassin (American, despite the Gallic disguise his name could take on) made Rififi in Paris after more than a decade struggling under the House Un-American Activities Committee’s stranglehold over Hollywood. Reared in noir and similar wise-guy-inhabiting genres, Dassin seemed finally free with Rififi, a tightly wound testament to the weird and alluring dreamscape of criminal enterprise. In it, Jean Servais is a coughing, sagging pile of skin grafted to the frame of a formerly revered gangster, Tony “le Stéphanois,” a man who recently out of jail wants to play it safe until his pride gets the best of him. Assembling a team of European outlaws (including Dassin using the pseudonym “Perlo Vita” to portray Italian safecracker César), Tony masterminds the jewel heist to end all jewel heists, and, in turn, Dassin practically defined his own genre. The “heist film” is now a matter of cultural intuition—everything from Ocean’s 11 to Inception owes its intricacy and style to Dassin’s swagger—but in 1955, there was simply no other film like Rififi. Yet, even today, Dassin’s film is an astounding machine of filmmaking precision: In structure, dialogue, acting, cinematography and overall design, the film feels as if it’s working off of ineffable instincts, hiding nothing but implying everything. And working is perhaps the best way to describe what the film does best: Look only to the now-iconic, 33-minute heist sequence which serves as the film’s second act, totally without dialogue and careful to show, in bouts of unbelievable tension, just how much effort is required of putting together a seamless criminal act. It’s bravura filmmaking without one sweat-infused drop of ostentation, and rather than rest on melodrama to prove a point, Dassin sucks all romance out of the gangster equation, leaving the audience with nothing but the thankless toil of skirting the law. —Dom Sinacola\n54. Stalag 17 (1953)\nTonally, Billy Wilder’s prisoners of war story is a true dramedy, fitting into an odd post-war space when American cinema-goers were apparently content to laugh at the horrors faced by prisoners, even while being reminded of the deadly results of incarceration, which were obviously even more dire for victims of the Holocaust. It’s William Holden who makes the film click and hum, portraying American airman Sefton as a somewhat sleazy but clever profiteer who figures that if he’s going to spend time in a POW camp, he might as well be an enterprising big shot while he’s there, living as comfortably as he can. In comparison with a film like The Great Escape, which would later come along and tell a story ringing with many of the same tropes, albeit without the screwball sense of humor, Stalag 17 is both an escape story and a light mystery, centered around the identity of the German informant who is sabotaging each attempt by the Americans to flee the camp and defy the Germans. With a cast of colorful characters and good-natured humor, Stalag 17 somehow takes a horrific premise and mines it for laughs more successfully than one would have thought possible. —Jim Vorel\n53. Wild Strawberries (1957)\nAs befits a film about a physician, the most striking quality of Wild Strawberries is its surgical artistry. By the time of the movie’s release, Ingmar Bergman had seventeen directorial credits to his name, and his experience shows in each of Wild Strawberries’ 91 (or so) minutes. His craftsmanship is seamless, to the effect that one might offhandedly dismiss the nuance of the film as perhaps obtuse, or overly vague, or even ambiguous. But they’re either missing the point or they haven’t lived enough of a life to recognize Wild Strawberries’ reflective power. This is a movie of self-consideration, art that captures the experience of looking at oneself in the mirror and being dismayed at what they see: Maybe you’re not as curmudgeonly as Victor Sjöström’s Isak Borg, because how could you be, but everyone has endured their share of disappointments and felt bouts of unhappiness in degrees and fits and spurts throughout their own existences. Wild Strawberries is all about the reconciling with such past discontent and finding a form of peace in your present, regardless of the roads you’ve taken to get there. —Andy Crump\n52. Ben-Hur (1959)\nWilliam Wyler’s adventure-drama broke Academy Awards records in 1959, with 11 wins. It’s also on the American Film Institute’s list of the 100 Best American films of all time. Those two facts alone probably put it in the mandatory viewing category before you get to Charlton Heston’s fabulous performance as Judah Ben-Hur, a Jew who tangles with the Roman Empire in the first century CE (concurrent with the time of Jesus of Nazareth). It’s a huge spectacle with a very iconic chariot race, and while contemporary viewers might feel more mixed about it than the Academy of the time did, it’s a spectacle by any standard (and worth watching for the chariot race alone). The story is a timeless one: Scrappy hero fights to remove the yoke of oppression, amid fierce violence and relentless cruelty. In the end, even if you find the acting a tad overdone, or the spectacle too spectacular, I think we might all be hardwired to relate to and love stories where scrappy heroes defeat oppressive institutions. It just grabs you. A perfect film? No. An important one? Yes. And did I mention the chariots? —Amy Glynn\n51. La Strada (1954)\nI like to imagine that if Fellini made La Strada today, we’d all be able to marvel at the depth of compassion he feels toward the film’s male lead, Anthony Quinn, playing the brutish traveling circus performer Zampano, a strong man who shatters chains with the might of his Herculean pecs. The reality is that asking your audience to pity an abusive, terrible human being at the near-literal last minute is asking a lot, but Fellini’s grace as an artist makes that pill easier to swallow. He heaps cruelties both physical and spiritual upon his two subjects, Zampano and the childlike Gelsomina (played by Fellini’s luminous and eminently talented wife, Giulietta Masina), reserving the brunt of the film’s suffering for her: Gelsomina labors under Zampano’s merciless direction and by consequence lives in a state of constant existential anxiety, ever pondering what her place is in the universal order. Maybe it’s just her lot in life to hurt. Maybe there is no universal order. Or maybe she was put on Earth to visit justice beyond the grace on Zampano as he collapses weeping on the beach, broken by the realization of his sins. La Strada is a deceptively simple picture layered with intricate, empathetic subtexts, and this, perhaps, is why it remains the most essential neorealist effort in Fellini’s body of work. —Andy Crump\n50. Giant (1956)\nThis epic Western drama gave birth to the play (and its film adaptation) Come Back to the Five and Dime, Jimmy Dean, Jimmy Dean, and though the principal characters are played by Elizabeth Taylor and Rock Hudson (with a star studded supporting cast), it’s especially memorable as the last (and Oscar-nominated) performance of James Dean’s tragically short career-he died in a car accident while Giant was still in production. Giant is significant for its frankness in confronting racism and hierarchy as well as for stellar lead performances from Hudson and Taylor. As sprawling in scope and scale as the million acre ranch on which it takes place, Giant is surprisingly frank in its exploration of the racist underpinnings of American prosperity, and big on grandeur and sweeping visuals. This film might feel a bit bloated to contemporary viewers, and I wouldn’t argue with them, exactly—but Giant is an iconic, writ-large piece of filmmaking whose remarkable acting performances make it a must-see. —Amy Glynn\n49. Paths of Glory (1957)\nFrançois Truffaut is notoriously and sort of erroneously credited as having said that, “There is no such thing as an anti-war movie.” He did say that he could not make a war movie about Algiers on the basis that, “to show something is to ennoble it.” He also said that “every film about war ends up being pro-war.” If this is true then maybe Paths of Glory is the closest the movies will ever get to producing an anti-war statement, though Stanley Kubrick’s trim World War I opus is better qualified as being disdainful of war: You can sense Kubrick’s contempt for his antagonists seething from behind the camera, his righteous indignation at the unapologetic cowardice of the craven old men who send others off to die on the field of battle at their behest. Maybe Paths of Glory isn’t anti-war, but it is pro-human, a film that celebrates true dignity and honor by recognizing that one need not rush forth to meet their inevitable death to be brave. —Andy Crump\n48. Umberto D. (1952)\nIf ever you should find yourself in an unreasonably chipper mood, if ever the sun should shine upon each step you take as rainbows light your path, then let Vittorio De Sica’s Umberto D. be the cure to your cheer. Umberto D. is a king bummer, a real fucking downer, but it’s a downer out of necessity. Maybe you’re the type to refuse to make eye contact with homeless people, and if you are, then you’ll probably watch Umberto D with your gaze turned toward the wall, but that’s the point. De Sica means to make his audience confront the gross social inequities that force a retired government employee to consider stepping in front of a train clutching his adorable dog (because getting splattered all along the railroad tracks is preferable to slowly starving to death on Rome’s streets, apparently). No matter how wrenching the movie may be, you won’t be able to look away: Umberto D. is true, unflattering, and unfailingly compassionate, the perfect antidote for the obscuring comforts of middle class living. —Andy Crump\n47. The Mummy (1959)\nThe classic Hammer Horror reboots of the ’50s are more or less all defined by their stylish flair and opulent color film settings, but The Mummy may be the most beautiful of them all, even more so than Horror of Dracula or Curse of Frankenstein. In terms of plot, it has little to nothing in common with the 1932 Universal original, instead seemingly drawing inspiration from (but vastly improving upon) the endless parade of slow, rather ugly Universal sequels. Christopher Lee once again has no lines here, but his presence is much more powerful and commanding than in Curse of Frankenstein—rather than an awkward, shambling corpse, the mummy Kharis feels more like an indestructible tank as he bursts through windows and shrugs off bullets like Jason Voorhees. Peter Cushing is back as his adversary once again, leading to another climactic fight to the death. The film backs off from the truly macabre ending of The Mummy’s Ghost that it’s parodying, but makes up for it with more of the grand, stately residences and Technicolor horrors you expect from the series. —Jim Vorel\n46. To Catch a Thief (1955)\nBut really—he didn’t do it.\nCary Grant plays John Robie, a retired jewel thief who’s enjoying his golden years tending vines on the French Riviera. But just when the Grenache is hitting the perfect Brix level, a series of copycat heists put Robie back in the thiefly limelight. Seeking to clear things up, he compiles a list of locals who are known to have heistable jewels, and being a smart and wily guy, he starts tailing a very, very pretty one (Francie, played by Grace Kelly). Budding romance can be an accidental side-effect of these things, but when Francie’s ice does go missing, she suspects John and it sours their relationship, as one might expect. John goes on the proverbial lam to get to the bottom of it. Talk about jewels! Nothing ever sparkled quite like Cary Grant and Grace Kelly onscreen together, especially with the legendary Edith Head on costume design—and their peerless charisma is in amazing hands here. The film itself is a bauble, and unapologetically so. It’s light and frothy and absolutely not Rear Window, none of which is an indictment. Sometimes it’s enough for something to simply be charming and beautiful. This film proves it. —Amy Glynn\n45. The Magician (1958)\nIf you have a buddy who isn’t into Ingmar Bergman, and really, don’t we all, then maybe point them to The Magician as an introduction to the Swedish master’s filmography: It’s a minor but great work, as expected from Bergman, from whom even minor efforts are as worthy as major ones from lesser filmmakers. Like most of his movies, The Magician sees him wondering aloud about life, death and existential matters. Unlike most of his movies, it’s a bit of a middle finger to his critics, or at least to skeptics, pedants, doubters and cynics, and a naked exploration of the innate deception of artistry. Then again, maybe don’t synopsize the film that way for your friend, of course, because if “Swedish arthouse filmmaking” doesn’t make The Magician sound unpalatably dry, then describing it as meta-storytelling will render it arid to their ears. But it shouldn’t! The Magician is as entertaining as it is poetic, sort of the cinematic equal of eating one’s vegetables when the vegetables have been sautéed in bacon fat. —Andy Crump\n44. Mon Oncle (1958)\nThe films of Jacques Tati are films of methodical, meticulously staged bumbling blended with acute disdain for modernity in every imaginable manner: As an aesthetic, as an ideology, as a philosophy, as a signifier of changing times. Call Tati a nostalgist or call him a barmy old codger barking at the world from the safety of his porch, commanding all within earshot to get off of his damn lawn, but be sure to call him a comic genius while you’re at it, too. He deserves that much, doesn’t he? He did us all the favor of making the M. Hulot films, starting with Les Vacances de Monsieur Hulot in 1953, and continuing with Mon Oncle in 1958, Playtime in 1967, and Trafic in 1971. Of these, Mon Oncle feels most distressed—down in the dumps even—serving as a bridge between the sentimentality of Les Vacances de Monsieur Hulot and the undisguised social critique of Playtime, his greatest film. Mon Oncle is playful, jovial, good fun from start to close, a film built to show off Tati’s incredible gift for visual humor and also to serve as a melancholic send-off for the Belle Époque. He contrasts the beauty of old Paris with the austerity of new Paris, bereft of anything resembling character or style. We laugh fondly at Hulot’s graceless ineptitude, but we want to weep for the loss of those characteristics that make the city what it is, or what it was. —Andy Crump\n43. Sansho the Bailiff (1954)\nTwo years before his death, and nearly 80 films into his career, Kenji Mizoguchi poured all of his empathetic intuition and finely tempered social critique into Sansho the Bailiff, a historical drama (or jidai-geki) about redemption not as a means to an end, but as the end itself. After their much-too-idealistic governor of a dad is forced into exile for disobeying a feudal lord—bureaucracy, always bureaucracy—siblings Zushio and Anju follow their mother, Tamaki (Kinuyo Tanaka), to years later visit the faraway land where their father ended up. On the way, a nefarious crone (and, it should be noted for symbolism’s sake, a priestess), tricks the trio into separating, after which Tamaki is sold into prostitution and the kids into the workforce of Sansho (Eitaro Shindo), an oafish but intimidating bailiff with a jonesin’ for branding the faces of disobedient slaves who attempt to escape their deplorable lots in life. As they grow up in the slave camp, the siblings take drastically different routes to adulthood: Anju (Kyoko Kagawa) remembers the magnanimity and mercy of their father, while Zushio (Yoshiaki Hanayagi) beefs out into one of Sansho’s favorite henchmen, often ready without blinking to do some branding on his master’s behalf. Only after Zushio is asked to do the unspeakable does he remember his humanity, agreeing to escape with his sister. From there, Sansho the Bailiff consolidates around Zushio as he attempts to transcend the broken order Sansho represents and come out the other end of the meat-grinder of a society with his dignity intact. While far from anything resembling overt hope, Sansho the Bailiff still operates as an optimistic tribute to the strength of the human spirit, especially after World War II: resilient, tolerant and, above all, the master of one’s fate. —Dom Sinacola\n42. Ordet (1955)\nThe demands of Ordet (The Word) are small compared to the very real physical demands of the spiritual life director Carl Th. Dreyer explores within the film. Yet, these demands persist, in pace and piety, in the pathology of faith and the thankless indifference of the universe, making Dreyer’s 13th feature film a meticulously mannered slow-burn of metaphysical awakening confined within the stolid lives of those who can’t conceive of any reality otherwise. Amidst Dreyer’s characteristic long shots and the breathtaking cinematography of Henning Bendtsen (who transforms every one of Dreyer’s frames into a masterpiece of shadow and blocking), the Morten clan works through their typical days on the farm: baking, praying, tending to the field, forming scouting parties to track down Johannes (Preben Lerdorff Rye), the middle Morten son who read so much Kierkegaard he snapped, believing himself to be a squealy voiced Jesus Christ, often wandering away to preach the gospel to empty fields of wheat. Emptiness, in fact, is what Dreyer contemplates most, filling his bare rooms with silence and gesture and scripture—the tick of the clock signifies the anxious passing of life, while a woman’s low moans from another room haunt the film’s fringes. In this emptiness, Dreyer mixes the ordinary and the symbolic, earning every ounce of portent in which his aching film indulges and allowing the two seemingly disparate polls of the human condition to meet. By the time it occurs, the audience never questions whether the literal miracle at the heart of the film is justified, we simply understand that the most extraordinary moments in life come to those who never take the ordinary for granted. —Dom Sinacola\n41. Sabrina (1954)\nWhile boasted two of the most popular leading men of all time in Humphrey Bogart and William Holden, as well as the brilliant Billy Wilder (The Apartment, Some Like It Hot) as director and Ernest Lehman (Sweet Smell of Success, West Side Story) as one of its writers, it owes virtually every ounce of its justifiable status as a classic to the luminous Audrey Hepburn. I first saw Sabrina in my mid-30s but I already had had a crush on Audrey Hepburn for 20 years, since some friends and I rented the excellent late-career Hepburn-Sean Connery starrer Robin and Marian, thinking that James Bond as Robin Hood had to be fun. Imagine four teenaged boys bawling their eyes out at the end of that great but three-hanky weeper. But I digress … Hepburn was already a star, having won an Oscar for her breakout role in 1953’s Roman Holiday and here she shines once again. Often described as a romantic comedy, Sabrina has far more dramatic chops than giggles, and the 25-year-old Hepburn more than holds her own against heavyweights Holden and Bogart, taking the Cinderella archetype to new levels. If you can ignore the May-December aspect of the romantic pairings on offer, I dare you not to fall in love with this winning look at romance. The perfect example of the old axiom “sometimes what you want is right there in front of you.”\n40. Strangers on a Train (1951)\nEveryone has their favorite Hitchcock movie, and Hitchcock’s body of work has so much breadth and variation that no two cinephiles are likely to have the same favorite. Some people gravitate toward either The Birds or Psycho for their unmistakable iconography. Others might be inclined toward North by Northwest or The 39 Steps, or maybe Saboteur or Foreign Correspondent, Vertigo or Rebecca, as chief exemplars of the American thriller in its many forms. Me, I’ll take Strangers on a Train, one of Hitchcock’s minor efforts, any day of the week. By 1951, he’d been working in the movie biz for roughly thirty years and had to use two hands to count the number of hits he’d put out in between the new decade and the ’30s, and his nonchalant mastery over his medium shows in the film’s every frame. There’s nothing fantastical or outlandish about Strangers’ premise; it isn’t a movie driven by the imaginary but rather the imaginable, an immaculately crafted exercise in creeping dread where the antagonist is good old fashioned human immorality. That it handily evokes the political turmoil of its time without having mention the America’s Red Scare by name is remarkable, and the key to the film’s timelessness. It’s the perfect response to any oppressive political climate in any era. —Andy Crump\n39. Forbidden Planet (1956)\nForbidden Planet is a rarity in a decade of low-budget B-movie sci-fi. Made by MGM Studios—and working as a narrative retread of Shakespeare’s The Tempest—this is high-quality, intelligent science fiction, featuring state of the art special effects. A ship of American astronauts lands on an alien planet where the inhabitants are trying to safeguard the ruins of a previous civilization. Famous for its iconic “Robby the Robot”—more complex and intelligent than most of its automated screen predecessors—Forbidden Planet stands head and shoulders above most science fiction of the ’50s. —Andy Crump\n38. The Band Wagon (1953)\nVincente Minnelli’s 1953 musical came only a year after Singin’ in the Rain, another backstage musical with a story conceived by Betty Comden and Adolph Green. But while the earlier film looked back at Hollywood during the transition from the silent era to sound, The Band Wagon takes place squarely in the present—a rather melancholy one in which a former movie star, Tony Hunter (Fred Astaire), tries to mount a comeback on the Broadway stage with a new musical scripted by dear friends Lily (Nanette Fabray) and Lester (Oscar Levant) Marton. When the Martons bring in ambitious rising theater star Jeffrey Cordova (Jack Buchanan) to direct, however, all sorts of tensions start to flare between them all as egos spar, creative visions clash, and Hunter’s own insecurities—brought into sharper relief whenever he’s around Lily’s co-star, ballet dancer/Broadway novice Gabrielle Gerard (Cyd Charisse)—threaten to bring the project to a halt. Beyond its still-dazzling series of musical numbers and choreographic set pieces, The Band Wagon remains fascinating for the way it stealthily becomes an argument between high art and popular art, with Cordova the flamboyant spokesman for the former—with his desire to turn the Martons’ musical into a modern-day retelling of Faust—and Hunter the lighthearted representative of the latter. Perhaps it’s not surprising that popular art wins out in the end; this is a 1950s MGM musical, after all. On the other hand, the climactic “Girl Hunt” ballet does accomplish, albeit through a more populist idiom, what Cordova initially set out to do for Hunter with his original high-minded vision: push him—or at least, his carefree song-and-dance persona—outside his comfort zone. —Kenji Fujishima\n37. Born Yesterday (1950)\nWhat happens when you combine George Cuckor’s unerring sense of unspooling revelation, Judy Holliday’s stratospheric intelligence, and William Holden’s William Holden-ness? With all due respect to Reese Witherspoon, you get the best not-so-dumb dumb blonde ever. Holliday’s turn as mobster-moll Billie Dawn (a reprise of her Broadway role in the stage version of the film) earned her Best Actress awards from the Academy (she edged out Gloria Swanson for Sunset Boulevard, as well as Bette Davis and Anne Baxter, both nominated for All About Eve) and the First Golden Globe for Best Actress. Mobster (Broderick Crawford) finds the crassness and stupidity of his gal a little embarrassing (look who’s talking) so he hires a journalist (Holden) to tutor her and make her a little more presentable at business dinners, and boy, does it work. With a little education under her belt, Billie Dawn discovers she’s not as dumb as everyone’s always told her she was—in fact she wises up so much she outmaneuvers her crooked and abusive husband. There’s plenty to be said on the script’s social commentary on corruption, or about George Cuckor’s directorial chops, which were generally formidable, but the truth is, you’re likely you have to watch it multiple times in order to notice anything other than Holliday, who was pretty much a neutron bomb in a dress. In real life, Holliday had an IQ in the 170s-but man, she was brilliant at playing dumb. —Amy Glynn\n36. Roman Holiday (1953)\nRoman Holiday is the gold standard for American romantic comedy, and quite possibly one of the most charming films ever made. Cary Grant and Elizabeth Taylor both turned down the lead roles, and thank God they did, because it’s hard to imagine William Wyler could have gotten this jewel without the absolutely exquisite Audrey Hepburn (in her debut American role), playing opposite Gregory Peck, whose performance prompted my little sister to write to Peck begging him to take her to Prom. Hepburn plays Ann, a young princess fed up with the strictures of her diplomatic tour who escapes her unspecified country’s embassy in Rome and goes out to explore the world. Peck is Joe Bradley, ex-pat reporter who finds her asleep on a bench and takes her home without realizing who she is. Once he does, it’s safe to say Hijinks Ensue. The third principal character in this film is of course the city of Rome, whose star power could have easily overwhelmed a less charismatic star-crossed odd couple than the princess and the newspaper man. It’s end-to-end gorgeous, adorably funny and an exemplar of the difference between sweet and hokey. I’m sure there are critics who would pick at this film for being lightweight (it’s supposed to be), or for Hepburn “over-acting” (it got her the only Oscar of her career), or predictable (it’s a love story?)—however, the pacing, the interlocking moments of poignancy and comedy, and the sheer adorable-bomb factor of Peck and Hepburn would make it tough for even the most hardened cynic to turn it off. —Amy Glynn\n35. In a Lonely Place (1950)\nOne of the great noirs of all time and one of the great feel-bad movies of all time. In a Lonely Place treats redemption as a cruel joke, a spell of relief that lasts only long enough for us to view its obsolescence. The film takes jabs at Hollywood and celebrity while telling the kind of dangerous love story E.L. James wishes she could write; Humphrey Bogart is a bad, bad man, but he’s also grossly compelling. He plays Dixon Steele, a Tinseltown screenwriter fallen on hard times whom we sympathize with in spite of ourselves. Apart from being a sad sack, he’s also an explosive lunatic with a frighteningly short fuse, which makes him dangerously alluring bait for his new neighbor, Laurel (Gloria Grahame). Theirs is an ill-fated romance, and through it, Nicholas Ray makes a hauntingly grim study of masculinity, set against the ratcheting suspense of a murder mystery yarn. —Andy Crump\n34. Johnny Guitar (1954)\nJohnny Guitar is a film that barely hangs onto its genre trappings—and is one of the strangest and rarest of fifties Westerns. Nicholas Ray specialized in borderline-hysterical, hyper-magnified psychological drama, regardless of the setting. Here, he pits tough saloon keeper Vienna (a hard-faced Joan Crawford) against wrathful rival Mercedes McCambridge. Sterling Hayden sidles in as Vienna’s love interest and the catalyst for the witch hunt, but he’s hardly the driving force of the film. That showdown belongs to the women of Johnny Guitar-and the fearsome, small-minded community that surrounds them. —Christina Newland\n33. Shane (1953)\nShane is another of the great Hollywood westerns and probably the most archetypal and mythical in its execution. The heroes are truly good, the villains badder than bad. It explores one of the classic Western expansion themes, cattle ranching—or the freedom and lawlessness of the open range—versus farming, which eventually leads to civilization and settling down in one place, bringing families and the laws of the city into play. Visually a character straight out of the Old Testament, Rufus Ryker (Emile Meyer) is a shaggy bearded cattle baron hell-bent on driving farming families from the land he considers his. A mysterious rider named Shane (Alan Ladd) arrives in the nick of time to bolster the courage of a group of homesteaders led by Joe Starrett (Van Heflin). Shane and Ryker, along with their cohorts, are relics of the past, ultimately doomed to extinction once the wives and children move in. Unlike Ryker, Shane knows this, and spells it out in their final showdown. The future of the West is in cities and communities. There is no place for lawless men like them in these new frontiers. All these years later, we know that Shane was wrong. Killing and lawlessness still abound in the cities, and big business still tramples the rights of the common man. The film is a reminder, though, that if communities band together, holding strong in faith and trusting one another, they can take back what is rightfully theirs and shape a collective destiny. —Joe Pettit Jr.\n32. The Asphalt Jungle (1950)\nAn artfully staged robbery sequence is among the highlights of John Huston’s heist classic, an obvious blueprint for films spanning Ocean’s 11 to Reservoir Dogs. What marks it firmly in the noir realm, though, is a censors-baiting taste for the bleak and merciless, a thread of self-loathing amid the double-crosses, and an urban wasteland motif that gets even more suffocating when the underworld rises. Fresh out of the clink, criminal mastermind Doc Reidenschneider (Oscar nominee Sam Jaffe) assembles a crew of irredeemable lowlifes to break into a jewelry store vault. (Fun fact: The Coen Brothers paid homage in their 2001 noir The Man Who Wasn’t There with Tony Shalhoub’s character, Freddy Riedenschneider.) Among Jaffe’s cohorts are Sterling Hayden (well more than a decade before Dr. Strangelove and 20 years before The Godfather) as small-time crook Dix, Louis Calhern as a corrupt lawyer-turned-the group’s fence Emmerich and, as the latter’s mistress, a then-fledgling and essentially unknown actress by the name of Marilyn Monroe. Huston eschewed some of the genre’s flourishes for a more naturalistic approach, keeping musical cues to a bare minimum and detailing the procedural minutia of the break. The dialogue, peppered with slang, is both crackling and realistic. Story has it that MGM chief Louis B. Mayer said, “That ‘Asphalt Pavement’ thing is full of nasty, ugly people doing nasty things. I wouldn’t walk across the room to see a thing like that.” Don’t listen to him. —Amanda Schurr\n31. The Big Heat (1953)\nA pot of boiling coffee to the face is among the lasting impressions that remain long after the first, and second, and tenth viewings of Fritz Lang’s seminal noir. Glenn Ford stars as Det. Sgt. Dave Bannion, the poster boy of black-and-white morality in a sea of film noir gray. He’s a man on a mission, Johnny Law out to clean up the ruinous city. You see, something about the suicide of his colleague, one of scads of cops in the back pocket of the local mob boss, doesn’t sit right with him, and Lord help anyone who gets in his way—or even in his periphery. As the potential for justice seems to slip away, so convinced does Ford’s underdog become of his holy crusade, he’s blind to the collateral damage—emotional, too—or maybe it’s just that his self-righteousness trumps everyone and everything else. Black-and-white no more, eh? Along with Ford’s relentless (anti)hero (that parenthetical, depending on how you look at him), Gloria Grahame is incredible as the moll of Lee Marvin’s (also outstanding) second-in-command gangster. Working from a Saturday Night Post serial adapted by former crime reporter Sydney Boehm, Lang is meticulous in depicting the transition from principled family man to revenge-seeking vigilante, and the below-the-surface hypocrisy of this by-the-book guy, who prefers his own gun to the police department’s, anyway. Viewers can take the thrills at face value—and there are many, and they’re glorious and gut-churning. But what we think is a rather straightforward, if brutal, takedown of systemic corruption becomes something more nuanced, and chilling. “Keep the coffee hot,” the ultimately “triumphant” detective tells a clerk. Given the bodies left in his reckless wake, that line still feels too soon, some 60 years later. —Amanda Schurr\n30. High Noon (1952)\nOne of the handful of films often touted as an archetypal Western, High Noon was actually quite atypical and possibly ahead of its time on its initial release. Director Fred Zinnemann was an unlikely candidate, a German Jew whose main exposure to the genre was through the fantasy Western novels of German writer Karl May. It was possibly the sole Western of its time to have a successful Hispanic businesswoman as one of its prominent characters. The film is often interpreted as an allegory of Hollywood blacklisting during the McCarthy era. Screenwriter Carl Foreman was accused of being a Communist sympathizer, and remained bitter about that fact for the rest of his life. None of these interesting facts would matter if High Noon weren’t a damn fine, gripping Western. Suspense builds with most of the narrative flow progressing in real time. Abandoned by his newlywed Quaker bride (Grace Kelly) and rebuffed by the townspeople, Sheriff Will Kane (Gary Cooper) grows increasingly desperate in his search to find an ally to face off against returning criminal Frank Miller. Due to arrive on the noon train, his old enemy has plans to assemble his gang in order to exact revenge on Kane for putting him away. Tight close-ups of faces, deserted city streets, empty windows, buildings and ticking clocks emphasize Kane’s locked fate and dwindling options, a technique borrowed and expanded on to exaggerated lengths by Sergio Leone. John Wayne thought the film’s themes highly un-American, and later joined forces with director Howard Hawks to film Rio Bravo as a sort of conservative riposte. The Duke was wrong. In retrospect, High Noon is a quintessential American story, expertly exploring the theme of one man, abandoned by those he considered friends, who stubbornly sets out to defy the odds by standing up for what he believes is right. —Joe Pettit Jr.\n29. A Night To Remember (1958)\nEven though it doesn’t have a warbling Celine Dion drama-bomb soundtrack tune, Roy Ward Baker’s 1958 film is still considered the authoritative account of the fateful last night on the HMS Titanic. I’ll spare you the plot recap (uh, the boat sinks). It did modestly at the box office on release, but received immediate and ongoing critical praise for its accuracy, its stoic, realistic style, and its ability to maintain an incredible heightened tension even when there is absolutely no doubt as to how it ends. The film’s reserved, self-contained style is strikingly dramatic, its attentiveness to history and to the scope of the disaster unflinching and utterly devoid of melodrama. The film is a heartbreaker, and a masterpiece. —Amy Glynn\n28. From Here to Eternity (1953)\nThis epic military tale has an unearned reputation for schmaltz, largely because of the famous lovemaking scene in the Hawaiian surf. While romance does rear its head, From Here to Eternity is so much more than a love story. It’s mainly about the boredom, drunkenness, anger, and camaraderie at a far-flung military outpost during peacetime. That intrapersonal drama is shattered by a bigger concern when the outpost in question—Pearl Harbor—is attacked by the Japanese. Directed by Fred Zinnemann, the thoughtful filmmaker behind High Noon, From Here to Eternity has a stellar cast all working at the height of their careers—Burt Lancaster, Montgomery Clift, Deborah Kerr, Frank Sinatra and Donna Reed. —Christina Newland\n27. Night of the Hunter (1955)\nFilm noir or horror—which category does Charles Laughton’s Night of the Hunter belong in? Frankly, all such quibbles are needless. The film fits snugly beneath either appellation, for one thing: It’s a hybridized version of both. (Let’s call it “film noirror.”) For another, it’s a masterwork, so fie upon labels. Night of the Hunter lurks in shadows and revels in misogyny. Whether you’ve seen it or not, you probably have the image of Robert Mitchum’s tattooed knuckles imprinted upon your brain thanks to pop culture osmosis. Reverend Harry Powell is quite the villain, a man as quick to distort the truth with honey-coated lies as Laughton is to distort reality through oblique perspective, unnerving use of shadows and light, and a dizzying array of camera compositions that make small-town West Virginia feel altogether otherworldly. —Andy Crump\n26. The African Queen (1952)\nSamuel Sayer (Robert Morley) and his sister Rose (Katharine Hepburn) are missionaries in German East Africa around during WWI. Charlie Allnut (Humphrey Bogart, in what would be his only Best Actor Oscar win), the captain of tramp steamer The African Queen, delivers their provisions—and, one day, the news that war has broken out between Germany and Britain. Germans burn down the village, a soldier beats Samuel, and he soon dies from complications of the incident. Charlie comes to get Rose out of the area; Rose comes up with a plan to torpedo a German gunboat. The initial plan fails but the surprisingly scrappy and enterprising Rose is undeterred. The pair encounter a series of rapids and perils that are, of course, not at all metaphorical, and over time, strike up an unlikely but also inevitable relationship. Love triumphs. So do the torpedoes. John Huston’s oddball, odd-couple romantic comedy adventure is a gripping story with a great pair of lead actors (though Bogart arguably had more Ocscar-worthy performances earlier in his career) and combines savagery and sweetness in an eccentric and very satisfying way. —Amy Glynn\n25. Anatomy of a Murder (1959)\nThe rigor of Anatomy of a Murder is its most poignant strength, celebrated upon its release for its meticulous dramatization of a particularly difficult case, awash from beginning to end in sweat-stained, legal grayscale. But what drives the heart of the film—a measured masterpiece that, like so many features before its time, found insulting controversy over its “language”—is its setting, snug and warmly secluded in the nondescript middle of nowhere of Michigan’s Upper Peninsula. There, lawyer Paul Biegler (James Stewart), well on his way to early retirement after losing his District Attorney re-election bid, takes the case of Lt. Frederick Manion (Ben Gazzara) on behalf of the lieutenant’s oddball, flirty wife Laura (Lee Remick). Lt. Manion admits to having killed a local innkeeper after finding out the proprietor raped his wife, and is looking for Biegler’s help in successfully entering a plea of temporary insanity. The case draws the attention of a high-profile prosecutor from Lansing (Michigan’s comparatively “big city” capital), played with pristine uppity-ness by George C. Scott. Biegler effortlessly matches wits with his metropolitan peers, spinning a yarn as old as time about the price his opponents must pay for such class-based arrogance, but Anatomy of a Murder is surprisingly subversive in its depiction of such supposed UP yokels, offering a cast of deeply felt characters who act more compassionately to an alleged victim of sexual assault than most FOX News commenters would 60 years later. —Dom Sinacola\n24. The 400 Blows (1959)\nSometimes a movie can be boiled down to its final shot. The Long Goodbye has Philip Marlowe, unhurriedly strolling down a road in Mexico, playing his harmonica after killing his best friend. 8 & ½ has young Guido, bringing down the lights as he marches along with his flute, sending the audience out of the theater wondering whether his presence affirms life or nods to death. The 400 Blows has Antoine Doinel gamboling about on the coast before François Truffaut’s camera zooms in on the boy’s face, freezing the frame just as his eyes meet with the lens. For anyone who saw Barry Jenkins’ Moonlight, that description probably sounds familiar, but this shot has been long-copied since The 400 Blows became a part of the cinematic canon after its 1959 release. (For example: Catherine Breillat’s Fat Girl, or even George Roy Hill’s Butch Cassidy and the Sundance Kid, which both use a similar effect to achieve altogether different ends.) In Truffaut’s film, the shot is meant as a capstone, or, if you prefer, the closing of a book: It’s the climax of one chapter in Doinel’s life, though Truffaut probably didn’t have any thought of making sequels to the film to begin with. Questions linger as the credits roll, and of course they should. When one comes of age, their next age begins, and so The 400 Blows leaves itself open at the last, leaving us to consider what fate may befall Antoine from here. —Andy Crump\n23. Some Like it Hot (1959)\nIs Some Like it Hot one of Marilyn Monroe’s best films, or one of her most antithetical? Sugar Kane is, in a nutshell, the kind of character Marilyn struggled so hard to avoid playing for the bulk of her career: a ditzy blonde, a pure sex symbol, someone who exists in the context of the movie just to tickle the male gaze, whether within the story or without. She’s given nothing to work with, as the bulk of the film’s heavy lifting is accorded to Tony Curtis and Jack Lemmon instead. Watching the film in 2017, you may wonder why Billy Wilder slacked on investing Sugar with any level of empathy, why he wrote the character as a one-dimensional object, a trophy for Lemmon and Curtis to compete over. You may also not wonder at all. Some Like it Hot works, even if Marilyn has little to work with other than her persona and her co-star; it’s funny, it’s quick on its feet, and it sells its central joke—that nobody, save for the audience, can see that Curtis and Lemmon are obviously dudes in drag—perfectly, layering just enough self-awareness of its own ridiculousness to keep the gag from going sour. —Andy Crump\n22. Rio Bravo (1959)\nOne of the truly great Westerns. John Wayne’s casual, seemingly effortless performance is also one of his finest, in a long career of sturdy, iconic roles. Director Howard Hawks and screenwriters Leigh Brackett and Jules Furthman designed the movie as a conscious refutation to Fred Zinnemann’s earnest, socially aware criticism of the genre (and of conservative America) in High Noon. In that movie, a marshal (played by Gary Cooper) pleads for help from the good citizens of his town to no avail, as some gunslingers come to shoot him down. Hawks and Wayne strategically play out a similar situation much differently. Wayne’s sheriff doesn’t have to ask for help when a gang of outlaws descends on the town to violently free Claude Akins from his small jail cell. A group of misfits—down-and-out alcoholic Dean Martin, pretty boy Ricky Nelson, prostitute Angie Dickinson and old codger Walter Brennan—gladly stand by Duke when he needs them the most. When the bullets fly, Wayne and his friends stand tall and steely-eyed against their foes. From its masterful opening scene—a beautifully edited, wordless sequence involving sad-sack Martin, the villainous Akins and a contemptuous yet lovingly paternalistic Duke—to its climactic action-filled showdown, Rio Bravo hits all the right notes with easy-going charm and grit. There’s even a bizarre but lovable music number. But don’t be put off by Rio Bravo’s casual, old-fashioned charm. At its core, the movie resonates profoundly as a story of true camaraderie, moral duty and what it takes to stand up to wrongdoing when the odds are against you. Rio Bravo’s emotional power echoes with each subsequent viewing. —Derek Hill\n21. North by Northwest (1959)\nWhen a mild-mannered ad man (Cary Grant, in some seriously natty threads) is mistaken for a secret agent and finds himself in the crosshairs of a dangerous spy, suspense is a given. Add a romantic entanglement with the epically gorgeous Eva Marie Saint, who might or might not be in cahoots with the spies, and you’ve got Hitchcock at his tongue-in-cheek best, turning a surrealist fever dream of a plot into something light-handed and smooth. Saint’s cool and intriguing, and if Grant ever had one day in his life where he wasn’t unbelievably charming, it was not captured on film. This stylish thriller is one of Hitch’s most utterly entertaining and arguably also his most visually stunning, with some of the most iconic scene compositions in film history (particularly, though not solely, the incredibly shot scene at the top of Mount Rushmore). This is definitely a thriller, but it’s also witty as hell (maybe even a little self-satisfied, but this viewer isn’t complaining—if anyone’s earned that, Alfred Hitchcock did). Skillful, clever, charming—if for some reason you don’t already know why Hitchcock is an enduring god of cinema, this film ought to clear it up for you. —Amy Glynn\n20. The Day the Earth Stood Still (1951)\nThough it’s certainly not the first film about aliens—friendly or otherwise—Robert Wise’s 1951 classic is nonetheless one of the most influential. And while Michael Rennie’s collected but subtly bold lead turn as Klaatu originated some of the most prescient and culturally digestible presentations of extraterrestrials, it’s easy to forget the genuinely transgressive qualities of The Day the Earth Stood Still. At its heart a cautionary tale about Cold War-era nuclear armament, Wise’s movie is far from a feature-length sermon, sprawling into pronged discussions on the meaning of “true knowledge,” the value of individual human accomplishment and the oblivious selfishness of Earthlings who believe they’re above the rest of the universe. Backed by the caterwauling theremin- and vibraphone-heavy Bernard Herrmann score, the film magnificently teeters between genre leanings like Klaatu’s massive laser-eyed robot guardian, Gort (whose rubber suit design—characteristic of the special effects of the era—looks as bulbously cushioned as a bouncy house), and sober monologues about the dangers of substituting fear for reason. In Wise’s cynical vision of politics, even life-changing circumstances aren’t enough to empower a divided world to come together.\n19. On the Waterfront (1954)\nElia Kazan’s most iconic, and memorable, film is a dual-pronged snapshot of 1950s America, one that not only captures a critical moment in the meteoric rise of Marlon Brando—the man who invented modern acting—but also captures the anxieties and tensions of living in the era of McCarthyism, both a shameful practice and a moment in time that’s essential toward understanding mid-1900s American history (especially for a man of principle and a defender of liberty like Rogers). Robbed of proper context, that particular bit of connective tissue is meaningless, and the film remains nothing more than a tale of broken ambitions and a powerful ode to the plight of New York’s longshoremen (as screenwriter Budd Schulberg alleges he intended); that and, of course, a testament to Brando’s preternatural thespian abilities.\nBut taking into account Kazan’s appearance before the House Committee on Un-American Activities in 1952 changes On the Waterfront’s tenor irrevocably. The film is about dockworker Terry Malloy’s (Brando) struggle with morality as he’s goaded by numerous parties into testifying against Johnny Friendly (Lee J. Cobb), a union boss with mob connections that run deep. When Terry makes his ultimate choice and later proclaims his pride in informing on Johnny, he’s speaking for Kazan, who named names to the HUAC more than half a century ago and didn’t express any regret for his actions all the way up to his passing in 2003. He was glad what he done to the end. —Andy Crump\n18.Rashomon (1950)\nWhat you get out of Rashomon likely reflects what you bring into it, but it might help to bring a basic grasp of cubism into it. You hear the word “cubist,” your brain probably goes right to Picasso and Braque, but in cinema it ought to head straight to Kurosawa, who in essence gave birth to the movie version of cubism with Rashomon by performing a feat as deceptively simple as filtering a single narrative through multiple character perspectives; the more Kurosawa filters that narrative, the more the narrative changes, until we can no longer determine which to trust and which to write off. In the trial that comprises the bulk of the film’s plot, who is telling the truth? The bandit, the man accused of murdering a samurai and raping his wife? The wife? The samurai himself, summoned to the trial via spirit medium? Even when Kurosawa generously reveals what actually happened when the bandit crossed paths with the samurai and his wife via the post-trial testimony of a humble woodcutter, we’re still left to wrestle with the question of who, and what, we should believe. Kurosawa’s technical mastery is always awesome to behold, but in Rashomon, it’s his gift for utterly blurring reality that dazzles most. —Andy Crump\n17. Touch of Evil (1958)\nWith its legendary opening, a single, crane-enabled shot just shy of three-and-a-half minutes in length, Orson Welles essentially closed the book on the classic noir era—and rewrote his own legacy in the process. Welles was 20 years into his career and a Hollywood has-been at 42 when he signed on to adapt Whit Masterson’s novel Badge of Evil for the screen. The result is a masterwork wrought by an auteur of monumental brass ones, even for Welles. The film opens at night, as a bomb is placed in the trunk of a convertible just before an unwitting couple take a drive through town. An echoing strain of horns and percussion situate us in an exotic, obviously dangerous locale, the natural sounds of the streets weaving in and out with the rock ’n’ roll playing on the car stereo. Cinematographer Russell Metty slowly pans away to refocus our attention on Mexican DEA agent Charlton Heston and his American bride Janet Leigh—a bit of breezy, expository chitchat fills us in on those details. They stroll through customs, across the border, into the United States on foot and share an embrace, just as the convertible explodes in front of them. In one extended take, we’re hurtled into this thriller with a minimum of screen time and maximum of suspense. Sure, Wells himself will soon command the frame as a fat, drunk, cane-toting corrupt cop, as will Marlene Dietrich as a brothel madam, and Dennis Weaver as a sketchy hotel night manager. The plot will double down with a manhunt, kidnapping, gang rape, drugs and more in a yarn as thick and filthy as Welles’ villain’s final resting place. But those first three minutes and 20 seconds not only encapsulate a singular mastery of filmmaking—an immaculately orchestrated synergy of technical skill, storytelling, and style—they tick off practically every box on the noir checklist: gritty, maze-like streets; foreign vs. domestic threats; isolation and anxiety; the law and the lawless; the passions of a gorgeous gal and her hero; extremes of shadow and light, angles and composition; unsparing tension, and a palpable, inescapable sense of doom. Three. Unbroken. Minutes. —Amanda Schurr\n16. The Searchers (1956)\nJohn Ford spent much of his career wrestling with the United States’ history of vulgar treatment toward Native Americans, whether in Cheyenne Autumn or in Stagecoach. In The Searchers, he appears to pin that history to the mat, but he maintains his hold with uncertainty even as he carries out the direction of the film with brimming confidence. There are reasons and then some why Ford’s 115th feature is considered one of the best and most influential movies of all time; it is a masterclass in craftsmanship and technical wizardry, gorgeously photographed against the backdrop of Ford’s beloved Monument Valley, that has inspired creative minds ranging from Martin Scorsese to Vince Gilligan. You can’t examine the evolution of modern filmmaking, whether in America or across the globe, without considering The Searchers’ deep and abiding significance as a cinematic landmark.\nTo describe the film as a journey of obsession would be putting it mildly. John Wayne’s Ethan Edwards is popularly described as an Ahab type, but the truth is that Ethan is his own character. Here is a man whose need to rescue his nieces from a band of Comanche Indians does not drive him so much as it consumes him; his compulsions blend with his rage and justify casual moral atrocities. Such is the power of racism and prejudice as Ford depicts them. Both qualities invite us to act against our better natures, though it is not clear until the end whether Ethan has one—and even then, just as in the beginning, he remains an outsider, the kind of guy you just do not ask into your home. Ethan is as quintessential a Wayne character as The Searchers is a Ford film, and 60 years ago, they left an impression on cinema that is still seen throughout the medium to this very day. —Andy Crump\n15. The Wages of Fear (1953)\nThis film is one of the main reasons Henri-Georges Clouzot was known as the “French Hitchcock,” though it might be equally fair to call Hitchcock the British Clouzot. Set in a South American oil town, the film tracks a treacherous journey in which men transport nitroglycerine across dangerous terrain—the existential suspense is nearly unbearable. The first half of the film meticulously delineates characters, back stories, motivations. The second half tracks the actual drive, and it is a ruthlessly nail-biting, screw-turning, squirm-inducing ride. A harrowing treatise on fear itself-the tension just doesn’t let up. Yves Montand, Charles Vanel, Vera Clouzot, and Folco Lulli are the human leads, but the real star of this film’s the tank of nitroglycerine being hauled inch by harrowing inch across the unforgiving landscape. —Amy Glynn\n14. Hiroshima, Mon Amour (1959)\nAlain Resnais’s 1959 masterpiece begins like a documentary, one reminiscent of his harrowing 1955 nonfiction short Night and Fog, except focused on the aftermath of the atomic bomb dropped on Hiroshima during World War II. Instead of an omniscient voiceover narrator, however, we hear what we eventually discover are two lovers: a French actress (Emmanuelle Riva) and a Japanese architect (Eiji Okada) who, in the present day, have met in Hiroshima are both carrying on extramarital affairs with each other, even as they realize it can’t last. It sounds like pure Casablanca-like forbidden romance, but under Resnais and screenwriter Marguerite Duras, Hiroshima Mon Amour touches on broader ideas: chiefly, the potential impossibility of art to measure up to personal experience and memory. The man’s repeated incantations to the woman that “You saw nothing in Hiroshima” suggests a level of perspective on the horrific event that even she, starring in a well-meaning “movie about peace,” can’t possibly access. She can only try to identify through her own experience as a tormented outsider in the village in which she grew up—but really, how can even that possibly measure up to the devastation of such a horrific event? Even Hiroshima itself, as captured in black-and-white by cinematographers Sacha Vierny and Michio Takahashi, seems to want to try to forget its past, by covering it up in a preponderance of neon lights. Resnais aids Duras’s reflections on history and memory with a then-groundbreaking editing style that fluidly goes back and forth between past and present. The enduring miracle of Hiroshima Mon Amour, though, is that all its formal and philosophical ambition doesn’t obscure the poignance of its central romance, especially with Emmanuelle Riva’s indelible expressions of passion, anguish, and regret. —Kenji Fujishima\n13. Dial M for Murder (1954)\nMan, Hitchcock kind of owned the 1950s. This crime-thriller stars Ray Milland and Grace Kelly, and has the distinction of being filmed in 3D (as it existed at the time)—there are those who propound that it is in fact the best 3D film ever made, which, given the state of the technology now versus then, is saying a mouthful. (Plenty of other critics will say it was not one of his better films.) A tale of double-cross upon double-cross in which the key that unlocks the mystery is literally a key, Dial M For Murder explores sexual jealousy (something of a master subject for Hitch), social mores, vengefulness and greed. It’s also an interesting treatise on theatricality—based on a stage play, the script and the direction retain much of that medium’s sense of confinement, creating a tense, close environment in which characters develop in very compelling ways. A masterfully character-driven film, this is essential viewing for Hitchcock fans. —Amy Glynn\n12. A Streetcar Named Desire (1951)\nThis adaptation of one of Tennessee Williams’ most seminal plays has so thoroughly infiltrated the American cultural vernacular that if you haven’t seen it yet, you are missing tons of references and jokes and at least one Simpsons episode, so get this taken care of ASAP so you can stop wondering why people clutch their shirtfronts and scream “Stelllllllaaaaaaaa” or why Jesse Eisenberg does that weird-ass southern accent thing in that one scene in Batman v. Superman, for starters. Elia Kazan’s powerfully built adaptation launched Marlon Brando to stardom and boasts red-hot performances from Vivien Leigh, Kim Hunter and Karl Malden as well. The story of a fading Southern Belle seeking refuge in the New Orleans tenement of her sister and brother-in-law, Streetcar is end-to-end iconic, in no small part thanks to the brilliance of the source text but certainly also for stellar acting performances and Kazan’s cramped, gritty, claustrophobic mise en scene. This is a story about crumbling facades, dirty secrets, humiliation and degradation-all the good stuff! The play had to be tamed somewhat in order for the script to comply with the decency codes of the time, but there is still plenty of abuse, sexual assault, and psychic meltdown to go around. A classic and sensitively rendered American drama, this film has been remade a number of times, but no subsequent version can hold a candle to Kazan’s stunning original. —Amy Glynn\n11. Twelve Angry Men (1957)\nSidney Lumet’s high-voltage courtroom drama would likely be difficult to greenlight today (“The entire film is a conversation between twelve jurors in a deliberation room?”) but that does not mean it doesn’t hold up. Taut, tense and snapping with heat-lightning tension, this film remains a brilliant examination of class, prejudice and how personal baggage informs reasonable doubt. One lone dissenter with a “not guilty” finding (Henry Fonda) hangs the impatient jury, and conflict breaks out among the jurors, both personal and philosophical. Lumet makes brilliant use of short depth-of-field to induce an intense feeling of claustrophobia. Between this and the actors reacting to what is obviously a sweltering summer day, the discomfort is intense even before the deliberations devolve into argument. A young man’s life is at stake, we have not seen the courtroom trial, and all the evidence the audience receives is presented as interpreted by the arguing jurors. It’s a brilliant example of an almost purely character-driven movie, and it’s an ageless, fascinating look at human group dynamics. —Amy Glynn\n10. Rebel Without a Cause (1955)\nIf melodrama were high-octane fuel, Nicholas Ray’s emo masterpiece would soar off the end of a rocky bluff and keep flying forevermore. In fact, it’s difficult to not reach the end of the film’s emotionally churning two hours and not declare out loud, as if the room in which you watched it required it, “Well, that was a fucking weird movie.” But then—teenagers are weird creatures, greasy sacs of megalomania, alien to both the demands of adulthood and to the scarier demands of their own bodies. Jim Stark (James Dean, painfully iconic) asks a father he barely respects whether he should prize honor above his own safety, but what he’s really talking about is whether he should care if the cool kids at school like him or not. All is hyperbole to a teenager; even indifference is a world-defining credo. A teenager cares the most about not caring so that when the game of chicken in which he reluctantly participated ends up killing some chump named Buzz Gunderson (Corey Allen), he struggles to determine the course of his own fate rather than what will become of Buzz Gunderson’s loved ones, or even what the metaphysical implications are of a human being wiped prematurely from reality. A teenager will even take the only chance he has, the night of Buzz Gunderson’s death from vehicular explosion, to court Buzz Gunderson’s girlfriend, the self-described “numb” girl next door (Natalie Wood). Add a skin-crawling performance from Sal Mineo as Plato, effortlessly conjuring both pity and revulsion in the viewer, and Rebel Without a Cause channels too perfectly the sociopathy of the American teen, perhaps more than any other movie able to convince even those who’ve already long passed puberty that growing up can be a really terrifying thing. —Dom Sinacola\n9. The Seventh Seal (1957)\nLike any cultural touchstone, any ubiquitous landmark of the arts more mitotically absorbed than actually experienced, The Seventh Seal is bound to be misremembered. We know well the chess game with Death (Bengt Ekerot), as well as Death’s get-up—a sort of gothic mix between Musketeer and monk—etched into the firmament of our pop obsessions (for most my age, it was in Bill and Ted’s Bogus Journey that the bone-white face and cape were first encountered), even if we’ve never actually seen the film. We know well the name of director Ingmar Bergman or that of star Max von Sydow (recently in Force Awakens), even if we aren’t familiar with their work, so ingrained into any working conception of “international cinema” are they, much of which is due to The Seventh Seal. We know well the dour chiaroscuro of Swedish cinema, the arch-symbolic pretension of art house stuff that squeezes all mirth from every orifice of the viewer. But do we forget how little of this movie is the chess game—how dimwitted Death can be? How funny The Seventh Seal actually is? “Is it so cruelly inconceivable to grasp God with the senses?” asks knight Antonius Block (von Sydow). “What is going to happen to those of us who want to believe but aren’t able to?” With The Seventh Seal, a simple story about a jaded knight returning from the Crusades to find that the world he fought for has seemingly been abandoned by God, Bergman sought clarity in the problem of faith—he wanted to map the vast spiritual terrain between experiencing and knowing, between feeling and believing. The reason why today the film still resonates, why we know the movie without having to experience it, is because of that clarity in Bergman’s vision: The Seventh Seal is all symbol, metaphor, allusion—but what it’s symbolic of, a metaphor for or alluding to isn’t too hard for any of us to figure. When the knight asks a question, God answers with silence—and there’s little humans understand better than how that feels. —Dom Sinacola\n8. Singin’ in the Rain (1952)\nThough only modestly successful upon release, Singin’ in the Rain rose in critical esteem to become widely considered the best movie musical of all time. A comedic take on the difficult 1920s transition from silent film to “talkies,” the film stars Gene Kelly as a popular silent film star (and dancer, of course), and Jean Hagen as the vain and irritating costar his studio keeps pairing him with romantically. Perhaps the definitive MGM Technicolor musical, the story is adorable and the singing is terrific, but I’m not sure any of its many, many virtues can top the pure explosive vitality and joy that is Gene Kelly in motion. I defy you to watch this and not feel ridiculously happy. —Amy Glynn\n7. Tokyo Story (1953)\nTokyo Story could be described as a film about regrets. It could also be described as a film about disappointment, or the speed at which families drift apart, or modernity’s absolute indifference to custom and tradition and the old ways. But maybe just save yourself some time and some word count and describe it as a film about life, orchestrated by one of cinema’s most revered masters, Yasujiro Ozu, a director who spent his career making exquisitely calibrated but deceptively simple films. You don’t need to be an insufferable cinephile to enjoy an Ozu movie, especially Tokyo Story, undoubtedly his most accessible, though it does help; this makes him a great gateway filmmaker for anyone looking to increase their appreciation of cinema, and Tokyo Story his gateway film. Its aesthetics are pristine, its performances poignant and powerful, but the most impactful quality Ozu brings to his narrative of intergenerational divide is the passage of time, hours, days, weeks, months, years, all neatly articulated in two plus hours of running time. By the time it all ends, you’ll feel like you’ve lived a life with the Hirayama clan, too. —Andy Crump\n6. Seven Samurai (1954)\nHave superhero movies burned you out? Do you need a break from big-screen commotions involving costumed men and women flying about all higgledy piggledy, blasting one another with computer-generated energy blasts or slugging it out with their bare hands? Are you itching to put the blame for the modern theatrical glut of comic book franchise films? In contemporary terms you can just fault The Avengers, but in a classical context, you might need to go back to 1954 and Akira Kurosawa’s Seven Samurai, which is, without argument, one of the single most influential movies ever made, an ur-text for both “men on a mission” and underdog films, echoed in titles ranging from The Magnificent Seven to Bonnie and Clyde, and even the odd kids’ story, a la A Bug’s Life. But Seven Samurai isn’t great because of its influence; rather, it’s the other way around, a movie whose towering brilliance is validated by the medium’s habit of aping it since its release. Kurosawa’s film is an epic that deserves to be designated as such, a tale whose grand scale encompasses humble ambitions. —Andy Crump\n5. Bridge on the River Kwai (1957)\nA frequent contender for the “greatest film of all time” crown, this adaptation of Pierre Boulle’s novel Le Pont Sue La Riviere Kwai is directed by the magnificent David Lean and stars William Holden, Alec Guinness and Sessue Hayakawa. Though fictional, the work is based on the construction of the Burma Railway in 1943, and was filmed on location in Sri Lanka (then Ceylon). It won seven Academy Awards including Best Picture (and in an interesting side-note, a Best Adapted Screenplay Oscar for Boulle, who didn’t write the script, but had to be credited because the actual writers, Carl Foreman and Michael Wilson, were on the Black List at the time). The film chronicles the convergence of British soldiers in a Japanese POW camp led by Colonel Saito (Hayakawa), an intense and often sadistic officer. The ranking British officer, Lt. Colonel Nicholson (Guinness) is so by-the-book that he philosophizes about whether his men have a duty to try to escape, and nearly starves to death in a stand-down with Saito over adherence to the Geneva Convention. Complicating the mix is American Navy Commander Shears (Holden), a cynic who thinks Nicholson is insane for his dogged dedication tot he rules in a clearly lawless situation. Saito is desperate to complete construction of the bridge (he’ll be forced to commit ritual suicide if he doesn’t) and of course, his war prisoner workforce are more interested in sabotaging the project than complying. Shears escapes, only to find himself recruited by a British commando unit charged with detonating the bridge. Except Nicholson has gone kind of Stockholm Syndrome and become obsessed with making a Great British Work of Engineering for the Japanese army. It ends in a tragic collision that’s been referenced, parodied and studied for generations. The production ruffled a lot of feathers—the British resented their depiction in the film and many deemed it anti-British (Alec Guinness included). Japanese critics resented the implication that they were incompetent engineers. David Lean frequently clashed with his British cast members, especially Guinness. At one point Lean fell into the river and narrowly escaped drowning. Decades before Apocalypse Now, this was a war film that was beset with onion-layers of internal battle. But Lean’s technical perspicacity is unwavering, the performances of the principal characters nuanced and multi-dimensional. No one’s a hero; no one’s a villian. Also, everyone’s a hero and everyone’s a villain. The film remains one of the most enduring WWII films largely because it takes a layered and sympathetic look at what constitutes courage, duty, and the human survival instinct, which can take a multitude of forms. —Amy Glynn\n4. All About Eve (1950)\nWhat goes around comes around. Greed, for instance, or vengeance, perhaps rudeness, or even syphilis. The world gives you back what you put into it. Therein lies the central lesson of All About Eve, Joseph L. Mankiewicz’s black comic masterpiece about the cultivated and finely tuned snubs and slights people hold in reserve for one another, biding their time for the perfect moment to unleash a salvo of venom at whichever poor sap makes a blunder offensive enough to invite verbal abuse. Okay, yes, the film is really about the cutthroat nature of the acting biz; one day you’re an actress at the top of your game, and the next you’ve been replaced by your own super fan, who, after aggressively inveigling her way into your inner circle, manipulates and connives her way to success at your expense. It’s more complicated than that, but let’s just leave it as a tale of backstabbing and barbs, in which the double crosses and lies cut as deep as a set of Wusthof Classics. —Andy Crump\n3. Rear Window (1954)\nThere’s an element of voyeurism inherent in the act of watching a film, and in the act of making one. Hitchcock was crystal clear on that. And in the entire canon of Hitchcock films, Rear Window might be the ultimate exemplar of his fascination with the subject. It’s probably not an accident that the row of windows we can see across that courtyard even resemble a strip of celluloid. Shot in a single room and almost entirely from the point-of-view of Jeff (Jimmy Stewart), an injured photographer confined to his apartment, it almost makes the audience feel as though they too have been spying on something. From the rear window of his apartment, Stewart discovers a world he never thought to explore until he was stuck in the apartment: His neighbors’ windows provide a gallery of characters who have no idea they’ve become subjects of Stewart’s cabin-fever documentary. It goes from humorous to creepy and then Stewart becomes convinced he’s witnessed a murder, and—let’s just say things Get Real. Brooding and obsessive, the film is a meditation on boundaries and confinement, curiosity and specifically the tipping point where the human hunger for knowledge and understanding meets the appeasement of boredom or flows past that into something prurient and debasing. Add a stunning, edge-of-your-seat denouement and the killer acting chops of James Stewart and you have a film that deepens and broadens every time you watch it. —Amy Glynn\n2. Sunset Boulevard (1950)\nBilly Wilder’s meta noir is a doozy, an unfailingly cynical critique of showbiz and a portrait of postwar alienation projected on the microcosm of Hollywood. It’s also wickedly funny in Sahara dry fashion, from the opening words of our dead narrator—floating facedown in his killer’s swimming pool—to Norma Desmond’s concluding descent down her staircase, and the rabbit hole. Gloria Swanson is magnificent and sad as Ms. Desmond, a fading beauty of the silent screen who manipulates broke, hackish screenwriter Joe Gillis (William Holden) into becoming her boy toy. Theirs is a fated relationship from the get-go, she of the wordless era, he dependent on them for his very livelihood. They’re on the outs with their industry, and each other, yet coexist out of desperation. Wilder, who co-wrote with Charles Brackett and D. M. Marshman Jr., layered the script with in-joke upon self-referential wink, perhaps the least of which is Desmond’s passion project, about that OG of femme fatales, Salome. There’s a parade of Hollywood cameos, name checks, and behind-the-scenes instances of “art imitating life” (and vice versa); for example, Erich von Stroheim, who portrays Desmond’s former director/first husband-turned-still lovestruck butler Max, directed Swanson in 1929’s Queen Kelly (excerpted here) before she as the film’s producer fired him, much like her Sunset Boulevard character discards his. Many of these nods were in less-than-good fun, so it’s no shock that Sunset Boulevard met with local disdain, yet Wilder doesn’t flinch. Norma, Joe, Max … they’re all unwanted souls who, try as they might to live in the past, have succumbed to the present—in Joe’s case, most finally. The smoke and mirrors of Tinseltown, of life, don’t do the job anymore (though cinematographer John Seitz, who also lensed Double Indemnity, most certainly did, sprinkling dust into the air for the lights to catch). Desmond may be a seductress past her sell-by date, but Hollywood is the ultimate femme fatale, who chews suckers up and spits them out. Sunset Boulevard gives L.A. its close-up, alright. —Amanda Schurr\n1. Vertigo (1958)\nAlfred Hitchcock made a lot of great films, but I don’t think there’s a single one, not even Rear Window, that can match Vertigo for sheer tour de force factor. A riveting noir thriller shot beautifully on location in San Francisco, the film is Hitchcock’s most intense treatment of his signature preoccupation: Erotic obsession. Complex and a bit surreal, it features a particularly phenomenal performance by Jimmy Stewart, who shucks his aw-shucks good guy persona to become an icy, neurotic, and haunted ex-detective with a serious obsession with the enigmatic Kim Novak. This film introduced the dolly zoom, which Hitchcock used to induce a sense of disorientation and dizziness-it’s still remarkably effective. A gripping story, killer performances, and a famous obsessive’s ultimate meditation on obsession, sexual politics, and the sheer gravitational force of the past. —Amy Glynn",
  "word_count": 21648,
  "scraped_at": "2026-02-14T14:22:52.280185"
}