{
  "article_id": "c242624f343c",
  "url": "https://www.geosuper.tv/latest/50004-sam-kerr-reclaims-australia-captaincy-after-20-month-injury-layoff",
  "title": "Sam Kerr reclaims Australia captaincy after 20 - month injury layoff",
  "date": "20251025T111500Z",
  "domain": "geosuper.tv",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "By Web Desk\nOctober 25, 2025\nAustralia's striker Sam Kerr has reclaimed her spot as captain, despite facing scrutiny over her leadership during a challenging 20-month period sidelined by injury.\nKerr's return with full fitness, resolving to lead her country once again, is unwavering, even as doubts about her suitability for the role continue to surface.\nThe Chelsea forward has been recalled to the Matildas squad for Saturday’s friendly against Wales in Cardiff, marking her return to the team after recovering from a ruptured anterior cruciate ligament.\nKerr, who was replaced as captain by Steph Catley during her absence, made headlines in February when she was involved in a court case following an incident two years earlier during a night out in London.\nShe was found not guilty of racially aggravated harassment of a police officer.\nHaving become a mother during her injury-enforced absence, Kerr acknowledges that it will take time to return to her previous form, when she was regarded as one of the world’s leading strikers.\nKerr expressed frustration over her 20-month injury hiatus, acknowledging she is not yet fully match-fit but can play around 70 minutes.\n\"I've come back from my injury but there's a year and a half of no football behind me so it's been quite frustrating,\" Kerr said.\n\"Fitness wise I'm definitely not 90 minutes fit, I think I've got about 70 minutes in me, that's what I would say.”\nRather than rush back, however, the 32-year-old has set her sights on Australia’s hosting of the Women’s Asian Cup in March, when the team will aim to win the continental title for the first time since 2010.",
  "word_count": 273,
  "scraped_at": "2026-02-14T12:59:11.496609"
}