{
  "article_id": "c272aa572fae",
  "url": "https://www.ndsmcobserver.com/article/2025/03/irish-take-down-sfa-in-ncaa-tournament-first-round",
  "title": "Irish take down SFA , set sights on No . 6 Michigan in Second Round",
  "date": "20250322T191500Z",
  "domain": "ndsmcobserver.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "After dropping three of their last five to end the season, the Notre Dame women’s basketball team returned to Purcell Pavilion on Friday afternoon to host Stephen F. Austin in the First Round of the NCAA Tournament. Despite this being Notre Dame's 30th March Madness appearance, it would be the first all-time meeting between the two programs.\nSince the March 8 defeat to Duke in the ACC Semifinal, the Irish have had 13 days to step away before preparing for the NCAA Tournament. “Having a reset as an athlete is so important to be able to regroup and reflect before having the opportunity to play in this tournament,” sophomore guard and ACC Player of the Year Hannah Hidalgo said.\nDespite the late season struggles, fifth-year head coach Niele Ivey has the most talented Irish side of her tenure. Led by the star-studded backcourt of Hidalgo, graduate Olivia Miles and senior Sonia Citron, Notre Dame reeled off 19 consecutive victories from the start of December through mid-February, even reaching the No. 1 ranking for the first time in six seasons.\nA candidate for Naismith Player of the Year, Hidalgo followed up her breakout freshman campaign by ranking fourth nationally in both points (24.2) and steals (3.7) per game. While Hidalgo has blossomed into the best two-way star in the nation, fellow New Jersey native and backcourt mate Olivia Miles has returned from a knee injury to run the Irish offense, which ranks fifth nationally in scoring efficiency. Expected to be the second selection in April’s WNBA Draft, Miles has turned in averages of 16.2 points, 5.9 rebounds and 5.8 assists, while also becoming the first ACC player ever to record back-to-back triple-doubles. A reliable 3-and-D wing, Citron is also expected to be selected top-three in the draft. The Eastchester, New York native has taken her play up a level throughout the last month of the regular season, averaging 15.2 points on 40% shooting from deep over the last 10 games.\nLed by second-year bench boss Leonard Bishop, the Ladyjacks compiled a 15-game win streak of their own to close the season and capture the Southland Conference Tournament for an automatic bid to the Big Dance. A proud program, SFA reached five Sweet Sixteens from 1989-1996, but are making their first tournament appearance since 2022 and seeking their first win since 2000. Located in Nacogdoches, Texas, Stephen F. Austin is led by senior guard Faith Blackstone, who averages nearly 15 PPG.\nThe No. 3 seed Notre Dame weathered the storm following a rapid 6-0 start from No. 14 seed SFA, eventually holding a 26-13 lead after one. The Irish forced seven Ladyjack turnovers to close the first quarter on a 24-5 run. Notre Dame took 11 more shots than SFA and out-rebounded the ‘Jacks by eight in the first. Hidalgo led the way with eight points and four rebounds, while Marquette transfer forward Liza Karlen provided a spark off the bench with seven points and five rebounds. Graduate forward Maddy Westbeld added six of her own on perfect 3-3 shooting, while Miles tallied four assists in the frame.\nNotre Dame’s high-powered offense, which seemed to go dormant during the last two weeks of the season, kept up the frenetic pace during the second quarter to take a 46-25 edge into the intermission. Citron canned her second and three triples of the afternoon en route to 11 first-half points, while Westbeld joined her in double figures with 10. Sharpshooting junior guard Avery Vansickle knocked down two treys tying her for the team lead in points with eight alongside senior forward Trinity Moore.\nThe Irish energy continued on the other side of halftime, as Notre Dame used a 9-0 run in less than a minute to ignite the soldout crowd and push the lead to 67-33 midway through the third. All told, Notre Dame would score 32 points in the period, and the advantage was 78-41 heading into the fourth.\nSpeaking postgame about the third quarter run, Moore said, “The turnovers were more of us just not taking care of the ball, and less of the crowd. We’ve played in big environments all year, but give credit to Notre Dame for speeding us up.”\nCoach Ivey also credited her group's defense, adding, “I’m really pleased with our defensive effort. Our preparation all week paid off. This was the result of our team locking in, staying focused, and being prepared to start the tournament.”\nIt was a scary sight to begin the fourth though, as Miles went down after twisting her ankle. The second-team All-American rolled over in pain as the crowd came to a hush, but eventually was able to walk to the locker room under her own power. Ivey said postgame that Miles’ status for Sunday is unclear, but added she will continue to rehab over the next 48 hours.\nAfter pulling the stars out, the Irish eclipsed 100 points for the fifth time this season, with a three-pointer from walk-on freshman guard Luci Jensen and and a running floater from fan-favorite graduate guard Sarah Cernugel. Walk-on junior forward Bella Tehrani made it three-for-three by converting a transition layup off a sweet dish from Cernugel.\nAll 11 Irish players scored in the 106-54 victory, headlined by 24 points apiece from All-Americans Hidalgo and Citron. Hidalgo also contributed six rebounds and five assists, and reached the 1,500 point plateau in Notre Dame's triumph. Westbeld and Pittsburgh transfer forward Liatu King also reached double-figures, while Karlen recorded her first double-double at Notre Dame with 13 points and 10 boards. Miles also totaled eight assists before exiting with the injury.\nMoore and Vansickle led the Ladyjacks with 14 and 12 points, respectively, while junior guard Ashlyn Traylor-Walker added 10 in her return to her home state of Indiana. SFA finishes the year with a school-record 29 wins, and should be positioned for continued success with seven expected returners next season.\n“We’ll just continue to recruit high-character student-athletes who also are great basketball players. It’s about representing the city of Nacogdoches and Stephen F. Austin University and I’m confident we’ll continue to succeed,” Bishop said postgame.\nNotre Dame now moves on to Sunday’s Second Round in South Bend, facing No. 6 seed Michigan for a spot in the Sweet Sixteen. Although a classic rivalry, the Wolverines and the Irish haven’t met since Michigan claimed a 76-66 win in South Bend back in December, 2020.\nCitron expressed postgame that the Irish were thankful to continue their season, no matter who their opponent is. “We’re excited to move on and play another day, regardless of the opponent. I know Notre Dame-Michigan is a big football rivalry, but we are just happy to play another day,” she said.\nIvey added some more clarity on the rivalry, saying, “It’s two storied programs with a lot of women’s basketball history. We’re excited for the matchup and it should be a good game for women’s basketball.”\nThe Wolverines played a tight game against No. 11 seed Iowa State to open the First Round on Friday afternoon. Despite a five-point halftime deficit, Michigan used a 48-point second half to grind out the 80-74 win over the Cyclones and their star center Audi Crooks. This is Michigan's eighth NCAA Tournament appearance under 13th-year head coach Kim Barnes Arico, who guided her team to a fifth-place finish in the expanded Big Ten this year. Just like the Irish, the Wolverines boast an elite backcourt, spearheaded by freshmen Olivia Olson and Syla Swords, who each average over 16 PPG.\nSunday’s showdown between 27-5 Notre Dame and 23-10 Michigan will be aired on the ESPN family of networks, with tip-off time yet to be determined.",
  "word_count": 1277,
  "scraped_at": "2026-02-14T13:18:33.766770"
}