{
  "article_id": "c27ab3d72120",
  "url": "https://www.webwire.com/ViewPressRel.asp?aId=341404",
  "title": "New Chelsea Women season tickets now available",
  "date": "20250717T204500Z",
  "domain": "webwire.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "New Chelsea Women season tickets now available\nNew applications can now be made for a Chelsea Women season ticket for the forthcoming 2025/26 season.\nThis season ticket covers our seven Womens Super League fixtures at Kingsmeadow. It also offers access to a priority period to purchase domestic cup fixtures at Kingsmeadow.\nAll new general admission season tickets are available in our West Stand and North Stand seating areas, along with the South Stand terrace areas. There is limited availability within these areas and season tickets will be sold on a first come, first serve basis.\nSeason ticket prices start from £65 for adults, £32.50 for under-16s and £52 for under-23 and 66 or over.\nNew season tickets are available for supporters to purchase up until 5pm on Thursday 24 July.\nHow to purchaseSupporters who already hold an account with us will need to log in to the ticketing portal here. You will then be able to access the womens season ticket under the Season Tickets tab on the top of the page.\nSupporters who do not hold an account with us will be able to create an account once you select the womens season ticket. If you wish to create an account prior to that, please click here to create your account. We strongly advise that all supporters create an account prior to making their purchase.\nPlease note that this season ticket will only allow access to WSL matches at Kingsmeadow. For information on our Stamford Bridge match package called The Bridge Pass, please click here\nSupporters have the option of either paying for their season tickets in full by credit or debit card, or alternatively you can take up the option of spreading the cost over 10 monthly instalments using our finance provider V12.\nSupporters wishing to use the V12 Finance Instalment plan application option to make payment for their season ticket will be able to do so at the checkout stage.\nIf more than one supporter wishes to become a season ticket holder and you want to purchase all tickets in one transaction, you must use one of the accounts as the main account and add others to your network list. In order to do this, the main account holder will need to add the supporter from the My Network section under their account information. For more information on how to create a network, please click here\nDisabled supporters who are looking to apply and require ambulant or non-ambulant season ticket will need to contact us at access@chelseafc.com and we will send you a copy of an application form. Any applications submitted for disabled season tickets will need to be supported with your supporting documents, details of which can be found here, and sent back to the address below.\nTicket Office\nChelsea Football Club\nStamford Bridge\nFulham Road\nLondon\nSW6 1HS\nWe advise you to send the forms back via special delivery.\nAll season tickets applications are subject to availability.\nAll successful season ticket applicants will receive a physical season ticket card ahead of the new season.\nWe look forward to welcoming you to Kingsmeadow for another exciting season!\n( Press Release Image: https://photos.webwire.com/prmedia/8/341404/341404-1.png )\nWebWireID341404\nThis news content was configured by WebWire editorial staff. Linking is permitted.\nNews Release Distribution and Press Release Distribution Services Provided by WebWire.",
  "word_count": 551,
  "scraped_at": "2026-02-14T12:58:40.556196"
}