{
  "article_id": "c28172422963",
  "url": "https://www.presstelegram.com/2023/03/29/former-uc-irvine-star-scarlett-camberos-joins-angel-city-fc-after-leaving-club-america-due-to-safety-concerns/",
  "title": "Former UC Irvine star Scarlett Camberos joins Angel City FC after leaving Club America due to safety concerns",
  "date": "20230329T221500Z",
  "domain": "presstelegram.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Scarlett Camberos is returning to Southern California.\nCamberos, who grew up in Chula Vista and attended UC Irvine, is joining Angel City Football Club on a two-year contract after the club paid an undisclosed transfer fee to Club America in Mexico.\n“I’m super excited to join Angel City,” Camberos said in a statement. “It has always been a goal of mine to play in the NWSL. It’s their second year in the league, and there is still a lot of story to write with this new club. I love the fans, the environment, and I’m glad that my family has the opportunity to watch me play in the wonderful city of Los Angeles.”\nCamberos will wear No. 15.\nHer move to Angel City has been in the works for weeks.\nLast week she left Club America due to online threats by an individual that had been identified as “Jose Andres N” who had violated a restraining order. Camberos also had her social media accounts hacked. According to Club America, the individual received just 36 hours of house arrest.\nIn a statement released by Club America last week, the club confirmed that, “In support of the request from our player Scarlett Camberos and in seeking to contribute to her psychological and emotional recovery, the clubs of America and Angel City FC are in the process of reaching a deal for her transfer.”\nClub America’s statement added, “The response from (Mexican) authorities does not give the player and her family sufficient guarantees for her emotional stability, development as a person and or for a life free of violence.”\nIn February, Club America posted a tweet in support of Camberos: “We strongly condemn any type of violence against women. In accordance with our security protocols, the Club provides legal, digital and psychological support. Scarlett, we are with you, count on us!”\nCamberos earned her first Mexican national team appearance last August. She scored in Mexico’s win over Angel City FC last season. In two seasons with Club America, she scored 18 goals in 41 appearances. She signed with the Mexican club on Dec. 30, 2021.\nIn her final season at UCI, Camberos had 13 goals and seven assists and earned Big West Conference Player of the Year honors.\n“We couldn’t be more thrilled to bring Scarlett back to Southern California and to ACFC,” club co-founder and president Julie Uhrman said. “I can’t wait to see her bring her infectious energy and positivity to our players, club, and community. We are committed to supporting our players on and off the pitch and we know Scarlett will contribute to our success this year.”\nLast season, in one of its initiatives, Angel City became the first professional soccer team in the U.S. to protect its social media channels from “online bullying, including abusive, racist, or derogatory language.”",
  "word_count": 471,
  "scraped_at": "2026-02-14T12:38:41.172587"
}