{
  "article_id": "c28e6315351f",
  "url": "https://theathletic.com/4802331/2023/08/28/summer-transfer-window-close-premier-league-europe-saudi/",
  "title": "When does the 2023 summer transfer window close in Premier League , Europe and Saudi Arabia ? ",
  "date": "20230828T043000Z",
  "domain": "theathletic.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "The 2023 summer transfer window has closed for teams in Europe’s major leagues, with Premier League sides among those to do last-minute business on deadline day.\nSeveral players failed to land moves, while others — including Liverpool’s Mohamed Salah — remain the subject of interest from further afield.\nAdvertisement\nLiverpool rejected Saudi side Al Ittihad’s offer of £100million ($126m), potentially rising to £150m with add-ons, on deadline day, but the saga appears far from over.\nThe window might have shut in England, Spain, France, Germany and Italy on September 1, but players could yet move elsewhere…\nGO DEEPER\nJordan Henderson: I strongly believe that me playing in Saudi Arabia is a positive thing\nWhich other transfer windows are still open?\nTeams in several countries around Europe can still sign players throughout September.\nThe window is open in Poland until September 4 and in Belgium until September 6.\nIt runs until September 15 in Greece and Turkey and up until September 22 in Portugal.\nFurther afield, clubs can still do business in Mexico until September 13, until September 18 in Qatar and until September 21 in the United Arab Emirates.\nWhat about Saudi Arabia?\nThere had been some confusion over when the transfer window closes in Saudi Arabia as FIFA has September 20 listed as the deadline.\nWorld football’s governing body does, however, allow associations to decide the date within a timeframe — and the Saudi Arabian Football Federation (SAFF) website states the window for registration of players for Pro League clubs closes on September 7.\nEither way, clubs in Saudi Arabia will have longer to try and lure players from the European leagues.\nLiverpool manager Jurgen Klopp has voiced criticism, as has Arsenal’s Mikel Arteta.\nAsked if he thought it was fair that Saudi sides could do business beyond the Premier League deadline, “No. Because they are now a competitor, I think we have to change that.”\nCan clubs do any business after the deadline?\nFIFA Transfer Matching System (TMS) details all the deadlines.\nOnce those have all passed, players can only move to a league whose window remains open.\nPlayers without clubs — free agents, as they are often known — can make moves at any time, and if all parties mutually agree to terminate a contract, that player can then seek a new employer.\nAdvertisement\nThe Premier League does have provision for an “exceptional temporary transfer” or “emergency loan” outside the transfer window.\nUnder rule V.7.6.2, clubs can sign a goalkeeper in “exceptional circumstances” — certain injuries, for example — subject to board permission.\nWhat about registrations and squad lists?\nPremier League rules state that players must be registered by midday on the working day before a game, so any players who made late moves on Friday will have to wait until the next round of fixtures.\nAfter the transfer window has shut, clubs are required to submit an updated 25-man squad list to the Premier League. The deadline for this is Wednesday, September 13.\nEach squad must contain no more than 17 players who do not fulfil the ‘home grown player’ (HGP) criteria. The rest of the squad, up to a total of 25 players, must be ‘home grown’.\nPremier League rules say that a ‘home-grown player’ means a player who, irrespective of nationality or age, has been registered with any club affiliated to the Football Association or the Football Association of Wales for a period, continuous or not, of three entire seasons, or 36 months, before his 21st birthday (or the end of the season during which he turns 21).\nAs well as the squad list, each club submits a list of their registered under-21 players who are eligible over and above the squad limit of 25 players.\nAnyone who doesn’t make the cut might see which deadlines are still open — or negotiate their contract be terminated so that they can move as a free agent.\nWhen is the next transfer window?\nIf deals don’t get done, or clubs realise they need more reinforcements, they will have to wait until the winter transfer window opens on January 1.\nThat notoriously tricky market — with clubs scrambling to boost their survival chances or give themselves a push for Europe — runs for the whole of January before shutting on February 1.\n(Top photo: Manchester United/Getty Images)",
  "word_count": 720,
  "scraped_at": "2026-02-14T13:10:00.724362"
}