{
  "article_id": "c29f473aa50c",
  "url": "https://www.kmbc.com/article/kc-current-lawsuit-turf-fields-practice-facility/61544736",
  "title": "Kansas City Current files $2 million suit against Elite Turf united states ",
  "date": "20240709T201500Z",
  "domain": "kmbc.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "KC Current files $2 million lawsuit over quality of turf fields at team practice facility\n\"Elite Turf USA made many misrepresentations and engaged in a deceitful sales campaign.\"\n\"Elite Turf USA made many misrepresentations and engaged in a deceitful sales campaign.\"\n\"Elite Turf USA made many misrepresentations and engaged in a deceitful sales campaign.\"\nThe Kansas City Current are suing the company responsible for installing turf at their practice facility in Riverside for nearly $2 million in damages.\nThe lawsuit, which can be viewed here, was recently filed in Platte County Circuit Court.\nThe Current are accusing New Jersey-based company Elite Turf USA of deceptive sales practices that misrepresented the quality and lifespan of four turf fields installed at the team's practice facility.\nTwo of the seven practice fields are natural grass, and the remaining four are artificial turf.\nThe National Women's Soccer League team called the company's tactics a \"bait and switch\" effort that will cause them years of problems and unexpected expenses.\nAccording to the lawsuit, the Current and Monarch Build, the construction company responsible for the team's practice facility and new stadium, were both intentionally misled over the quality of the fields they would be receiving.\nThe Current bought turf for one pitch directly from Elite in March 2022. At that time, the Current agreed on a more than $500,000 contract that would have Elite distribute the turf.\nIn September 2022, Monarch, at the Current's direction, solicited bids for subcontractors in connection with the construction of pitches four through seven, making clear that the team expected the fields to be fields that would also be FIFA-certified.\nThe football club claims that Elite sent a revised bid of $1,974,312 to the Monarch, which failed to disclose that they were no longer selling Act Global turf products matching the quality initially requested. According to the lawsuit, neither the Current nor Monarch had the expertise needed to identify the swap.\nShortly after the contract for pitches was executed, Monarch noticed the change and immediately told the Current.\nAfter the Current and Monarch demanded answers, the lawsuit states that Elite then admitted it no longer distributed the FIFA-certified turf systems but insisted that the quality of the new fields was comparable.\nTests done by the team in April 2024 found that the integrity of the turf's fiber and bind strength is weak.\n\"This weakness has and will continue to result in fiber shedding, reduced face weight, poor footing, balding and loss of overall system integrity,\" the lawsuit reads.\nDue to the lack of tuft bind strength, Current alleges that the product fails to meet FIFA standards and will not be eligible for certification, which is required within the contract.\nThe Current also claims the turf on pitches four through seven were poorly installed. According to the lawsuit, in an email dated Jan. 5, 2024, Elite stated that it had “no issue fixing any and all issues with field manufacture or installation.” Those fixes have never occured according to the Current.\nThe team is asking for the total cost of the practice pitches, $1,924,954.20, in damages at a jury trial.\nKMBC 9 reached out to the Current for comment on the lawsuit. Representatives responded with the following statement.\nKC Current statement on lawsuit\n\"Elite Turf USA made many misrepresentations and engaged in a deceitful sales campaign. We won’t stand for such business practice hence the litigation. Despite our significant investment and focus on the best playing fields designed to last for a significant period of time, our newest artificial fields provided by Elite Turf USA are not at the level promised to us. Elite’s misrepresentations result in four of our fields not having the longevity promised. We will now face long-term problems of the sort that are neither in line with our agreement with Elite nor with our world-class public facilities.\"\nKMBC 9 has yet to receive comment from Elite regarding the lawsuit.",
  "word_count": 651,
  "scraped_at": "2026-02-14T12:18:11.812681"
}