{
  "article_id": "c2bef953a16b",
  "url": "https://www.manchestereveningnews.co.uk/news/greater-manchester-news/media-cant-name-six-31758827",
  "title": "Why the media cant name six of those injured in the Liverpool parade crash",
  "date": "20250530T161500Z",
  "domain": "manchestereveningnews.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Why the media can't name six of those injured in the Liverpool parade crash\nReporting restrictions are in place\nA man appeared in court twice today charged in connection with the Liverpool FC title-winning parade crash, but restrictions were imposed that prevent the media from naming any of the complainants in the investigation.\nPaul Doyle, 53, appeared before Liverpool magistrates' court and Liverpool crown court on Friday after being charged with a series of alleged offences following the incident during Monday’s title celebrations in Liverpool city centre.\nA total of 79 pedestrians, ranging from four children aged as young as nine to a 78-year-old casualty, were injured after being struck by a Ford Galaxy on Water Street shortly after 6pm, with 50 requiring hospital treatment. Seven remain as inpatients, but are said to be in a stable condition and believed to be recovering well.\nDoyle, of Burghill Road in West Derby, is accused of two counts of wounding with intent, two charges of inflicting grievous bodily harm, two of attempting to inflict grievous bodily harm and dangerous driving. Wearing a black suit, white shirt and grey tie and sporting unkempt, greying dark hair in the dock, he spoke only to confirm his name during the two hearings.\nLarge parts of the magistrates' court hearing was dedicated to discussions regarding reporting restrictions. Prosecutor Phil Astbury applied for reporting restrictions to be put on the names of six complainants, including four adults, reports The Echo.\nDistrict Judge Paul Healey confirmed he had granted the prosecution's request for orders protecting the identities of the complainants. The case was later sent to the crown court, where it was heard before the Recorder of Liverpool Judge Andrew Menary KC.\nFollowing further discussions, Judge Menary confirmed the reporting restrictions will remain in the interim, but said the case would be relisted next week for the matter to be determined. However, he added a different order in respect of the two child complainants will remain in place indefinitely.\nJoin our Court and Crime WhatsApp group HERE\nIn the case of all the orders, this prevents reporting of their names, addresses, places of work, schools, pictures or any other information which could lead to their identities being revealed. The media will be unable to reveal any of the listed information unless the orders are lifted.\nDoyle, who sat with his head bowed for much of the two hearings, nodded as he was told he would be further remanded into custody ahead of a plea hearing on August 14. Judge Menary told him: \"I am going to adjourn this matter now. The next hearing so far as you are concerned is a plea and trial preparation hearing on the 14th of August. The purpose of that hearing will be to enter your pleas to the indictment.\"\nDoyle was charged with the seven offences, which relate to a total of six complainants, on Thursday afternoon. Two of the counts are in relation to children, namely one of wounding with intent and one of attempting to inflict grievous bodily harm, although none of the two men, two women and two boys, aged 11 and 17, can be named for legal reasons.\nThe defendant was pictured arriving in a GEOAmey van early this morning, flanked by police officers on motorcycles. Two Matrix vans and a number of PCs were also seen outside the court building on Derby Square.\nMerseyside Police's assistant chief constable Jenny Sims said during a press conference at the force's headquarters on Thursday: \"As always, our thoughts remain with all those injured and affected by the appalling incident that took place during the Liverpool Football Club parade on Monday. I fully understand how this incident has left us all shocked and saddened, and I know many will continue to have concerns and questions.\n\"Our detectives are working tirelessly, with diligence and professionalism, to seek the answers to all those questions. When we are able to, we will provide further information.\n\"Merseyside Police is determined to gather as much evidence as possible to ensure that every avenue is explored. Now that Paul Doyle has been charged, we ask that the judicial process be allowed to continue without any speculation online or elsewhere that could impede the pursuit of justice for all those affected.\n\"A total of 79 people who were injured continue to be in contact with our officers and staff, and seven people remain in hospital, receiving the expert care of our NHS colleagues. I hope that all of those who were injured, or witnessed this terrible incident, are able, given time, to heal and recover.\n\"This continues to be a large and complex investigation and detectives are reviewing a huge volume of CCTV and mobile phone footage submitted by the public and businesses, as well as footage from our own body worn cameras and dashcams. We are extremely grateful for the ongoing cooperation of the public who have, and continue to, share their footage and witness accounts with detectives. Their input is vital to our ongoing enquiries.\n\"I would encourage anyone who has not yet contacted police who may have relevant information to please come forward and contact us. As always, my thoughts remain with victims and everyone impacted.\"\nMeanwhile Sarah Hammond, chief crown prosecutor for the Crown Prosecution Service Mersey-Cheshire, said the investigation was 'at an early stage', with prosecutors and police said to be continuing to work 'at pace' to review 'a huge volume of evidence'.\nShe also warned about the use of social media.",
  "word_count": 919,
  "scraped_at": "2026-02-14T14:16:50.434925"
}