{
  "article_id": "c318ed4957b6",
  "url": "https://stanforddaily.com/2025/04/17/stanford-softball-a-year-of-change/",
  "title": "Stanford softball : A new stadium , conference , and style",
  "date": "20250418T071500Z",
  "domain": "stanforddaily.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Stanford softball isn’t just adjusting to a new field — it’s adapting to an entirely new reality. A season that was supposed to build on last season’s Women’s College World Series semifinals appearance has instead become a test of resilience. With a transition to the Atlantic Coast Conference (ACC), the departure of star pitcher NiJaree Canady and a temporary home in a converted football stadium, the Cardinal find themselves in uncharted territory. And yet, through every challenge, they remain undeterred.\nStarting the season 17-2 at home, Stanford has made an early statement: no matter the obstacles, they intend to compete at the highest level.\n“Our team may look different, but we expect the same amount of success,” infielder senior Camryn Carmouche said. “We’re coming to the ACC to run it and beat everyone.”\nAdjusting to a football stadium\nSmith Family Stadium is undergoing a $38.5 million renovation, forcing Stanford softball into an unconventional new home: a repurposed football stadium.\nAdam Schneberger, the executive associate athletics director who oversees fundraising and development for the project, explained the reasoning behind the renovations.\n“The facility had not been touched in quite some time … we wanted to ensure that the team had a home worthy of their recent success,” he said.\nWhen completed, the upgraded facility will increase its seating capacity from 829 to 1,347 seats. In addition, private party decks, concessions and merchandise booths will be added, as well as over 4,000 square feet of state-of-the-art team facilities for the student-athletes.\nWhile the university has worked to make the football stadium suitable for softball, the transition has not come without challenges.\nWith their home field undergoing renovations, the Cardinal had been forced to practice on an artificial turf field, during the off-season, typically used for soccer and lacrosse — an environment vastly different from what they will play on in games.\nWithout a centralized practice space, even something as simple as hitting drills became a logistical challenge.\n“We would bike over to the batting cages — bats in hand — then bike back to the field, and sometimes back to the cages,” shortstop junior River Mahler said. “There would be times when we would bike back two to three times every practice.”\nNow, with a temporary stadium in place, the team no longer has to make those extra trips, but new challenges have emerged.\n“The lights in the stadium are much higher than we’re used to, and there’s one that shines directly into center field, so playing at night is challenging,” Carmouche said.\nOutfielders have had to adjust their defensive strategies, particularly when tracking fly balls near the outfield walls.\n“We’ve had to practice getting to the fence early so that we don’t run into the cage fencing in the new stadium,” Carmouche said.\nThe realities of life in the ACC\nBeyond their new home, Stanford is also navigating the logistical challenges of life in a new conference. Competing in the ACC presents not only new opponents but also significant travel demands. Unlike the Pac-12, where road trips typically meant a single flight to a destination, ACC means a strenuous travel schedule with grueling multi-city trips.\nMahler described an upcoming 10-day, particularly demanding road trip.\n“We’ll fly to Indiana to play Notre Dame on Thursday, then play Friday through Sunday. After our last game, we’ll drive five hours to Kentucky, play on Tuesday, then drive five more hours to Virginia for another three-game series from Friday to Sunday,” Mahler said.\nThe physical and mental toll of this schedule cannot be overstated. Long travel days mean disrupted sleep schedules, less recovery time, and limited opportunities for routine training. Managing schoolwork amid constant movement will also be a challenge, as players balance long bus rides and flights with academic demands.\nThe coaching staff has emphasized the importance of controlling what they can control.\n“What we can do is focus on what we can and play with the cards that are dealt,” said assistant coach Sara Groenewegn. “I think our team has done an amazing job at focusing on the day in front of them and not letting any outside noise or distraction steer them off the path.”\nThis level of travel is a stark contrast to past seasons and will test the team’s endurance and adaptability as the season progresses.\nFilling the void left by NiJaree Canady\nStanford also entered this season without its biggest star. NiJaree Canady, the 2024 USA Softball Collegiate Player of the Year, transferred to Texas Tech in the offseason, signing a one-year, $1,050,024 name, image, and likeness (NIL) deal, made possible by Texas Tech boosters John and Tracy Sellers. Canady played a pivotal role in leading the Cardinal to back-to-back Women’s College World Series appearances in 2023 and 2024 and her departure left a significant gap in Stanford’s pitching staff.\nWithout a dominant ace, the Cardinal have taken a different approach. Instead of relying on a single pitcher to go the distance, they have been rotating three pitchers throughout games — an unusual strategy at the collegiate level.\n“It affected the way we play the game, and yes, it hurt to lose a sister like that,” Mahler said. “But we’ve adapted really well, and it’s been exciting. The group of girls we have is amazing, so there’s a lot of good that’s come out of it.”\nWhen Groenewegn was asked about the softball team’s approach to NIL and the transfer portal, she kept the focus on Stanford’s current set of players.\n“We may not be as readily able to bring in a student as other programs due to our academic excellence,” said Groenewegn. “Our focus is and will continue to be on our own kids and making sure they are taken care of here.”\nRather than dwelling on what they have lost, the coaching staff has focused on turning Stanford into an offensive powerhouse.\n“The coaches have had us focus so much on the offensive side of things, which has been phenomenal,” Mahler said.\nTo bolster their offensive approach, the team invested in an over $4,000 state-of-the-art pitching machine that mimics live pitching as closely as possible.\n“It has paid off for us,” Groenewegn said.\nThe results speak for themselves. Among Division 1 teams, Stanford is top-five in batting average (.363) and ranks among the top teams in runs per game and slugging percentage.\nResilience in the face of change\nWith so many changes — new conference, new stadium, new team identity — Stanford softball is proving that adaptability may be its greatest strength. Despite the challenges, the team has embraced a mindset of perseverance and grit.\n“I think this is the toughest team I have ever been a part of,” Mahler said.\nThe road ahead is uncertain, but one thing is clear: the Cardinal aren’t just here to adjust. They are here to compete.",
  "word_count": 1136,
  "scraped_at": "2026-02-14T13:21:25.534299"
}