{
  "article_id": "c31ee2d3a136",
  "url": "https://www.offtackleempire.com/2023/11/17/23961900/mailbag-jimbo-fisher-future-last-big-ten-west-americas-team-harbaugh-rant",
  "title": "Answering Our Mailbag : A Man Called Jimbo ,  America B1G Team  and Dating Iguana People",
  "date": "20231117T204500Z",
  "domain": "offtackleempire.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "So, since I got Peacock last week for a truly terrible effort by Nebraska, I’ve been trying to use it for something else and have consequently started New Girl for the first time. I think I like it, but like... Jess sucks, right? I’m only nine episodes in, so I’m willing to admit that there’s time for her to gain some ground, but so far, she definitely feels like the weak link here. The try-hard quirkiness is too much.\nMailbag: A Man Called Jimbo, “America’s B1G Team” and Dating Iguana People\nAlso, who loses the West? It’s harder than it seems, apparently.\nAm I missing something, or is this a truth universally acknowledged?\nAnyway, here’s your football stuff!\n“Which B1G team is hiring Jimbo Fisher and will he still go 8-4 ish with a winning conference record every year?”\n—Humble Starscream\nRUReady4Brazil: If Maryland was in the midst of a coaching search I know they would try to and fail. Indiana won’t even try. If Nebraska was open, I’d say them. The obvious choices are Michigan State or America’s team Michigan (lol, more on that later), but I’m thinking UCLA. Chip Kelly has already stayed longer than expected. And then yes, they will go 8-4 every year like they pretty much already had been doing.\nRockyMtnBlue: Michigan would turn up their preverbal noses at anyone named Jimbo or Jambo even if he were the love child of Nick Saban and Vince Lombardi. I don’t think he coaches next year, but the question didn’t allow for that so I’ll say MSU. /shrugs\nBRT: I guess this can’t happen because they just “removed the tag” (I love that this somehow became a catchphrase like it’s somehow fun and creative?) but I’d have been pulling for Northwestern, purely for the joy of seeing such a hoity-toity school pay a man named “Jimbo” to do anything for them, let alone to be a fairly public face of the school.\nAs for my colleague’s claim that Michigan would be above hiring a guy named “Jimbo,” how quickly some forget that they did recently hire a guy named “Connor Stalions” which we all agreed is definitely a stripper name.\nBuffkomodo: How great is Jimbo’s agent, getting $75 million to not coach at Texas A&M and then perhaps trying to double dip at a Michigan State who will surrender much north of $40 million to get him.\nMNW: He won’t coach next year—he’s getting paid too much to go away and there’s gotta be some cushiness in that ESPN commentator gig. What’s even nicer is that since he’ll be doing the B-tier ESPN games or their SEC Studio work, I won’t have to see his face at all.\nThat’s not what you asked, though, so UCLA. He wouldn’t come north of Lincoln.\nRU in VA: It’s Penn State. *ducks shoe*\nKind of...: Can’t imagine UCLA would hire him. Michigan fans can pretend they wouldn’t take him, but...Rich Rod? MSU would take him in a heartbeat. Probably sitting out next year, but, if not, Sparty is the guess.\nAlmaOtter: If WVU fires Neal Brown, maybe Jimbo could go home to Appalachia?\nBrian: Isn’t the only current opening at Michigan State? Folks in East Lansing are pretty adamant that Urban Meyer will be taking that job, so it looks like Jimbo is out of luck.\nmisdreavus79: Yes, Penn State would love a coach that wins eight games a year instead of 11, as long as that coach is white. *ducks the other shoe*\n“Iowa’s got the inside track on winning the West, but who do you think is finishing last?”\n—DtownK\nRUReady4Brazil: Wow, just wow. I’ll guess Minnesota because they are the only team with one guaranteed loss in their next two games by virtue of OSU this week on their schedule. Everybody else has two shots to get a win, even though Purdue is one game back of the pack and they shouldn’t be trusted to win their last two, right?\nRockyMtnBlue: How delightfully Big10West would be if Iowa somehow manages to finish last? Unfortunately I think it’s Purdue going from first to last.\nBRT: It’s Nebraska, I think. I’m not checking to see if that’s mathematically possible, I’m just going on vibes. Mathematically, it seems like Purdue has a strong chance —their path to not doing that lies through Northwestern and Indiana, theoretically very winnable games, but it feels like it would be pretty Purdue to stupidly lose one or both for no very good reason.\nBuffkomodo: It’s Purdue. While the Boilers had a good week, they’ve got to play a Northwestern team that can smell the bowl eligibility and then Indiana, whose offense is actually coming along. While I honestly think they’ll beat Indiana, they certainly have the inside track to last.\nMNW: I think we see a whole lot of 1-1 splits the next two weeks and Purdue can’t make up ground on anyone.\nRU in VA: My bullish take on Hudson Card in the beginning of the season was off. But to my credit, Purdue has somehow managed to get Aiden O’Connell ready for the NFL - so having Card be above average in the West wasn’t a wild take. It’s Purdue.\nKind of...: I don’t expect Wisconsin to win again. But unless Purdue goes 2-0, Purdue would lose the tiebreaker to UW. But, yeah, they’ll both be 3-6.\nAlmaOtter: 100% Purdue. But any time I’ve felt confident in any Purdue prediction this season, they’ve done the opposite. So they’ll probably win out now.\nBrian: Six-way tie?\nmisdreavus79: Wisconsin could very well lose their next two, which puts them down there, right? But in reality it’s Purdue. Northwestern will be looking for a bowl game, and Indiana has shown signs of life. It’s Purdue.\nHWAHSQB: Illinois doesn’t win at Kinnick and they don’t win their last game when they have 5 wins. They also go 5-7 after any year they win 8 or more games. So Purdue will “win” this battle based on H2H result.\n“Is Braun the real deal or will he make bank from a dead cat bounce?”\n—PSUGuru\nRUReady4Brazil: I don’t think Braun is, but I think Ben Bryant could be. When you have a QB AND let him throw, you can win a lot of games against the middle of the pack Big Ten.\nRockyMtnBlue: I think it’s in-between. I think they players really like playing for him and that matters. I expect he’s got some growing pains to get through, but I also expect him to get the time he needs to do that because the jNW fanbase is by far the least stupid in this conference.\nBRT: Well, he’s managed to do something real, I think — rebuilding morale after a scandal is no easy task (ask MSU) and it seems that Braun has managed to do that. Of course, hyping guys up isn’t all there is to coaching (ask Minnesota). It should be interesting to watch. Maybe Northwestern bungled their way into accidentally finding the Next Great Coach.\nBuffkomodo: Having watched my school undergo two major coaching changes in the last 17 years without a national coaching search, I don’t think it’s a recipe for success. Then again, I have no confidence that Indiana is capable of making good decisions as a university when it comes to football. My simple thought is, it’s much easier to coach up a team and fake it through recruiting when you believe you’re only getting one year. The harder part is laying a foundation and cultivating a system over a length of time. So...good luck to you, but I don’t envy your position at all.\nMNW: I won’t know if he’s the real deal until I see what he does with the coordinator and position coaches in the off-season. If Mike Bajakian is still here, I’ll worry.\nHe’s gotten the team to play through (largely self-inflicted) adversity, but it’s been beating the dregs of the Big Ten. And that’s fine, because looking at next year’s schedule? Vocal idiots will sour on the hire real fast if Northwestern starts 1-3—a very real possibility with Miami-Ohio, Duke, [TBD FCS bodybag], and at Washington. But shoring up a lot of these talent and schematic weaknesses that had crept in by the end of the Age of Fitz would go a long way to maintaining that goodwill.\nRU in VA: Tough to get what “the real deal” or even a ceiling or floor would look like - NW is a luxury like that. Braun doesn’t necessarily need to get to a bowl game every year. Sure, it’s nice, and an occasional excitement or an 8-4 run. But in that same vein, he’s gotta get more creative coordinators. Take a page out of WVU and run a 3-3-5 on defense. Run exclusively jet option motion every play. You’re never gonna out-rock-fight Iowa or Wisco.\nKind of...: He seems to be the real deal if stability is what you’re after. Can he do what Chris Klieman is doing at KSU? Probably not. But Craig Bohl’s run at Wyoming seems replicable.\nBrian: A little too early to tell.\nmisdreavus79: I don’t think it matters. This Northwestern team was supposed to be a step below the worst teams in the history of the East/West split. Northwestern was supposed to be worse than 2016 Rutgers. Yet here they are, within earshot of a bowl game. If he merely manages to tread water for a couple years, he’ll be good to go.\nHWAHSQB: Most coaching hires are failures so math would say this one is too.\n“Jim Harbaugh just called Michigan “America’s Team.” They’re not... But who is? And could it be... Iowa?”\n—Atinat\nBRT: MNW told me not to include this, but I’m actually curious to see how many ways we can say “lol no,” so have at it. Make me proud.\nRUReady4Brazil: Notre Dame like it or not is more of America’s team than Michigan. I’d say in the 1990s I would have gone with Nebraska, then Texas for a moment just so they would beat USC. For a while it was hard to hate Oregon and rarely do I find people who hate LSU, but right now? I actually do think it will be Iowa if they win the Big Ten title game just like it was Auburn every time they knocked off Alabama. With how successful their women’s basketball team is, Caitlin Clark and co. are definitely America’s team judging by how many people showed up for their game in Charlotte a few weeks ago.\nRockyMtnBlue: When I was in college someone did a big survey (it was harder back then. No internet.) that showed “America’s Team”, the Dallas Cowboys were both the most loved and the most hated team in the NFL. Michigan’s a college team, but I think we’ve got half of that covered.\nBRT: I’m not sure that there’s One True America’s Team, but I am sure that it ain’t Iowa. I think there are potentially two ways to view this:\n- National following: in this case, it probably is Notre Dame. Other schools have national followings, but the vast majority of the fans still have some connection to the school or the region the school is in. ND is highly unusual in that no matter where you’re located in the country, if you tell someone you’re a Notre Dame fan, they won’t find it odd. They may find it bad taste, of course, but not geographically puzzling.\n- Unification potential: this tends to be a flash-in-the-pan label, but does have the quality of a team that’s nearly universally beloved. This is your Cinderella story, the non-ranked team that upsets Alabama, the team with a 100-year-old fan or a mascot of Golden Retrievers. Usually, this fades as memory of the event goes away, but there is one exception to this rule: and thus, I give you the purest example of America’s Team: 2007 App State.\nBuffkomodo: It’s James Madison, the team who is arbitrarily serving the “successful athletic program punishment” because they dared to move up the athletic ranks. The NCAA sucks and should be obliterated.\nMNW: lolno\nRU in VA: If you asked me this 5 weeks ago, Colorado. The team coached by Deion.\nKind of...: College football is America’s sport precisely because of the feuds it stokes. Blood feuds. There is no “America’s Team,” and I refuse to give any credence to BS propaganda from the 70s when the Cowboys were talking religion our the front door while hauling painkillers by the crateful in the back. Shit, maybe...\nAlmaOtter: Ah yes, America’s team. Because America loves an underdog story involving the winningest program in history with one of the largest financial endowments in the country and the biggest ego complex this side of Boulder. Plus (alleged) cheating.\nBrian: What do you mean, Michigan isn’t America’s Team?\nMC ClapYoHandz: America’s Team is Hawaii. I can’t think of anyone that hates them, and if they are rocking their old school rainbow helmets literally no one is cheering for your team. Even you are, at worst, neutral about the experience. Rainbow Warriors all day.\nmisdreavus79: America’s team, as in, “some random ass person will claim affiliation even though they can’t even name a player there?” If so, then it’s Alabama.\n“Going into the home stretch, who ya got for B1G Coach of the year, Offensive Player of the Year, Defensive Player of the Year?”\n—cericjo\nRUReady4Brazil: Coach has to be Braun unless Rutgers wins their next two games. Even if Northwestern finishes 5-7, he still deserves it over Ferentz. Offensive player Henderson deserves it because he is the biggest reason OSU is undefeated (not Harrison). Defensive player probably Castro or Higgins because the Iowa defense has won them all their games.\nRockyMtnBlue: Well obviously coach of the year is Jim Harbaugh (but maybe Braun if freakishly Harbaugh doesn’t win). Offensive player of the year is Harrison and it isn’t close. Defensive player of the year is more interesting. I’ll go with Aaron Lewis upsetting favorite Cooper DeJean.\nBRT: Harbaugh should win for making $10 million to coach, what, six games? That is actually pretty brilliant, in its way. But of the coaches who are actually on the sidelines performing their job, I’d give it to Braun. We all agree that this award is generally for the top feel-good story, and he’s it. It would be hilarious to me if Kirk Ferentz won it though, in a season where his son/offensive coordinator was quite notably fired.\nOffensive Players of the Year are a group effort, and it’s the Husker QB Corps. They certainly were offensive to me, and while they didn’t help their own offenses AT ALL, they certainly gave opposing offenses many, many legs up in the course of every game. Defensive Player of the Year is Beth Goetz, for (unfortunately) trying to protect Iowa Football from the Ferentzii.\nBuffkomodo: COY - Day; Offensive Player - Harrison; DPOY - DeJean\nKind of...: Braun, Harrison, DeJean (because Phil Longo isn’t a player).\nmisdreavus79: Braun, Somebody on Ohio State, Somebody on Iowa.\nHWAHSQB: Mike Locksley is September Coach of the Year and Braun since that point. John Motherfucking Paddock is OPOY and Johnny Newton is DPOY. Seriously, I couldn’t name a player on most of your stupid teams and I am in love with the whole John Paddock story and Illinois is a different team without Johnny Newton.\n- MNW: Coach of the Year: I want to say Braun, but Ferentz is sticking in my mind, especially if he’s looking for a way to make an exit from the Iowa situation.\n- Offensive: Marv Harrison Jr.\n- Defensive: Cooper DeJean\nBrian: Hard not to go with Northwestern’s David Braun for coach of the year. Cooper DeJean seems to be as impactful as any BIg Ten defender, so he gets my vote. As an avid reader of SMCD, the offensive player of the year sounds like it’s a two-horse race between Kyle McCord and Drew Allar. Nonetheless, I’ll go off the board and say Marvin Harrison Jr.\n“Is it time for us to contemplate the best transfers who left and joined the b1g this year? Say, the three best or most interesting moves?\nUnfortunately, I think Cade didn’t pan out as I predicted this season, but Keon Coleman seems to have put up some numbers.”\n—MiddlewestAverage\nRUReady4Brazil: Payton Thorne comes to mind. Other than him and Coleman, I haven’t had time to contemplates the what ifs of all those that left. It would be a good exercise for the Rutgers coaching staff who has refused to bring in a transfer QB since Noah Vedral.\nRockyMtnBlue: Coleman is the obvious “left the Big10” guy. Igbinosun has been really good for OSU and Drake Nugent has been excellent for Michigan at C, but the most impactful incoming transfer (from out of conference) has to be Ben Bryant.\nBuffkomodo: Kel’el Ware is really panning out.\nAlmaOtter: Graham Mertz has been reasonably competent at Florida. 18 TDs to 2 INTs on the season, pretty spectacular for him.\nHWAHSQB: Graham Mertz is putting up numbers like he’s playing against Lovie D every week?!? John Motherfucking Paddock gets my vote for most impactful transfer.\nBrian: What did Dino Babers say about Keon Coleman? That God was showing off when he made him? That’s good enough to get my vote.\nmisdreavus79: There’s a certain Dante Cephas who turned out to be a huge bust.\n“Exotic pets: Who has one? Who wants one? Who knows someone that has one weird enough they won’t attend an event at the owner’s house?\nExample: “I won’t go to Bob’s house because he lets the giant iguana go wherever it wants.””\n—BoilerBehindEnemyLines\n“Was just listening to an episode of a podcast with an extended discussion on the prompt: There’s a person who you’re super attracted to, they have a good steady job, you have chemistry with them, and they’re kind/supportive/friendly. But they have an iguana and take it with them everywhere you go. Do you date them?\n(My answer would be no, but it’s been a long time since I was single and I might be underestimating how desperate/horny I would be.)”\n—TDozer\nRUReady4Brazil: No desire for a pet, exotic or otherwise because I am not paying for a pet hotel when we annually go to the county named in my handle. Would I have dated my now wife if she had said pet? No. And I’m very glad she didn’t.\nRockyMtnBlue: Oh hell no. I don’t even want a dog. I can’t keep plants alive. Regarding potential GF with constant iguana; hmmm. I’m old, so how’s her retirement funding look?\nBRT: I have two cats (I know, a spinster with cats, groundbreaking as florals for spring). They’re just normal cats, one re-homed from a friend and one from a shelter, so very non-exotic. I think they’re great and ideal pets - you can leave them for a weekend, and in that sweet spot of level of care between a houseplant and a needy dog. I can’t imagine a life without pets, tbh, but have never felt a compulsion to be weird about it. Cats are great, and so are some dogs.\nAs for the constipated iguana... I think that’s a no. There’s something else going on there, I think, and I don’t want to find out what it is.\nBuffkomodo: My dog is a big enough asshole, I’m not certain I need anymore pets. I think an ocelot would throw this house into complete chaos.\nAlmaOtter: My cat looks and acts like a feral raccoon, but that’s about as exotic as I would go. Hard no on any reptiles.\nBrian: Exotic pets? No. And I wouldn’t go over to Bob’s house either.\nmisdreavus79: I inadvertently got one of my managers fired at movie theater job many moons ago, because he kept bringing his iguanas to work and I’m deathly afraid.\nHWAHSQB: Being 49yo and starting dating again is hard, but I did go out with a woman that had 3 kids, 3 dogs, 6 cats, and 3 pythons. Honestly, she told me all that and asked if I was sure I wanted to go out with her. At that point, I felt like I had to because that was just too damn interesting of a menagerie to not give it a whirl. She also had a giant tattoo of a demon between her breasts and was 8 months pregnant. Did I mention that online dating is hard?\nBRT: This actually makes me feel better, because sorting through the trash is pretty difficult as a woman... but I’ve been at this a really long time and have never encountered anything quite this insane. Well done getting to the point that you were viewing that tattoo though, I guess.\n“Speaking of Christmas cards, do you send them? How long do you continue sending when you don’t get one in return? What happens when an unexpected card arrives, but you’re out of the Shutterflyphoto compilation cards we all know you ordered?”\n—Indiana, Our Indiana\nRUReady4Brazil: We only started sending Christmas cards once we had kids. Before that, it just caused jealousy from us living our best lives filled with sleep, stain-free clothing, travel budget, and occasional daytime drinking. Also, I wanted to avoid the hassle of some former friends telling me that Christmas cards are not “inclusive enough.” They no longer get one.\nIf we get one from someone we didn’t send to, I just send a few nice texts and call it a day ... but my wife keeps spares just for this reason. I never talked trash to my neighbors who wish me a happy Diwali for not being inclusive enough, card or not. Speaking of which, it’s that time of year!\nRockyMtnBlue: I do not. Never have. Not surprisingly, most people have stopped sending them to me. I’m ok with that.\nBuffkomodo: I detest cards of any kind. Detest! I don’t need you to tell me thank you in a card. If you want to tell me happy birthday, call or text me. You don’t need to give hallmark $6 for that. I’m also self centered and don’t care to see your family change each year. So no, I don’t send them, I hate them, bah humbug.\nBRT: I love Christmas cards! I hang them all up on a wall in my living room, and they make me really happy - they even stay up after the rest of Christmas is put away, and I enjoy that. I like going through and addressing them every year and thinking about how lucky I am to know so many great people all over the country and world. Also, my cards are a little bit like RUReady’s cards pre-kid, and yes, I do love that. I wish more people would include a little update letter in theirs, as I really like reading them, but understand why they do not.\nFor awhile, I felt quite self-conscious about sending photo cards, like it wasn’t “worth it” since I was single, but I got over that like ten years ago. My life is fairly interesting, my cards are usually kind of funny, and I really do hate the idea that we should only celebrate people whose lives look like, well, a Christmas card. So, be the change you wish to see in the world or whatever.\nI will say this though: stop sending photos of just your kids for your Christmas card! They’re cute or whatever, but like, I’m friends with the parents and would actually rather see them. We all know you put on a few pounds, it’s ok. Get in the damn picture.\nMNW: As BRT and I exchange Christmas cards yearly, I think she does it right—and that we do, too—there are pictures of her and her cats, pictures of me, my wife, the kid, and the cat, and a typed update of what we’ve done in the last year.\nDon’t want to share what you did? Fine—but make sure you’re all on the cards, and handwrite a little greeting to the people to whom you’re mailing the card. I like hearing from friends, particularly when there’s a little thought involved; at the holidays it’s just kind of nice to think of others and to be thought of once in a while, too.\nBrian: Yes to holiday cards. To whatever you consider your inner circle. And there’s no rule of reciprocity. ‘Tis better to give than receive, people.\nMC: I do enjoy receiving the classic cards from folks, but as one of those singlemen I do refrain from sending one of my own. While that is one of those remaining few things I still get hung up on as a current solo act, it’s more that I’d go too weird and have a QR code leading to me reprising serious cinematic monologues in ridiculous, unrelated Halloween costumes or something. Everyone would just be concerned.\nBRT: If you ever get over that unnecessary hangup about being a singleman sending out cards, please put me on your list because that bonkers QR card situation sounds amazing. The world has enough color-coordinated families in fall in soft light - yes to more weird cards.\nmisdreavus79: I send them out to the people I care about, but don’t expect any in return. And, the trick is to order the cards early enough that if you do run out and need to get more, there’s enough time to do so.\nThe second trick is to not tie them to a given holiday so you don’t have to timebox yourself into a period of time. I sent a friend of mine a card in February!\nHWAHSQB: I don’t have to worry about this. That is one of the many benefits of not having friends.",
  "word_count": 4306,
  "scraped_at": "2026-02-14T13:10:42.465520"
}