{
  "article_id": "c31f695ae6a1",
  "url": "https://www.ksl.com/article/50611014/pac-12-athletic-department-ratings-which-schools-are-making-the-most-of-the-dollars-spent",
  "title": "Pac - 12 athletic department ratings : Which schools are making the most of the dollars spent ? ",
  "date": "20230330T004500Z",
  "domain": "ksl.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Estimated read time: 9-10 minutes\nThis archived news story is available only for your personal, non-commercial use. Information in the story may be outdated or superseded by additional information. Reading or replaying the story in its archived form does not constitute a republication of the story.\nWelcome to the Hotline's inaugural Pac-12 athletic department power ratings, in which we assess performance in football and men's and women's basketball in 2022-23 against each school's operating expenses.\nIn other words: Wins per dollar spent.\nWhich departments did the most with what they have?\nI'm sure everyone will agree completely with the order below.\n*** Notes on the following:\n— Because the three sports don't carry the same impact across the athletic department and university, we weighted success in the following manner: football, then men's basketball, then women's basketball.\n— Final expenses for the current fiscal year aren't available, so we have used the FY2022 operating budgets as the basis for judgment. (Investment in FY2022 obviously has a significant role in shaping performance in FY2023.)\n— Financial data for USC and Stanford was not available, so we used budgets at peer schools to create estimates. The figure cited for USC is the average of Oregon and UCLA expenses. (Why Oregon? Because of the investment in football success.) For Stanford, we used the average of Cal and UCLA expenses.\nPlease let me know what you think via email (pac12hotline@bayareanewsgroup.com) or on Twitter (@WilnerHotline).\n1. Utah\nFootball: 10-4 overall, 7-2 in conference, won Pac-12 title (second consecutive), lost in the Rose Bowl\nMen's basketball: 17-15 overall, 10-10 in conference, lost in opening round of Pac-12 tournament\nWomen's basketball: 27-5 overall, 15-3 in conference, shared regular-season title, lost in quarterfinals of Pac-12 tournament, lost in Sweet 16 of NCAAs\nFY2022 operating expenses: $111.9 million (source: Utah)\nComment: Easy call with the Utes as the wins-per-dollar kingpin in 2022-23 given their mid-level budget and high-level success in the most important sport, plus a breakthrough season by women's basketball and much-better-than-expected year for the men. Utah has been fiscally shrewd and competitively successful more often than not over the years, but this was above even its lofty standard.\n2. USC\nFootball: 11-3 overall, 8-1 in conference, lost in Pac-12 title game, lost in the Cotton Bowl\nMen's basketball: 22-11 overall, 14-6 in conference, lost in quarterfinals of Pac-12 tournament, lost in first round of NCAAs\nWomen's basketball: 21-10 overall, 11-7 in conference, lost in opening round of Pac-12 tournament, lost in first round of NCAAs\nFY2022 operating expenses: $135.9 million (estimated)\nComment: No school won at USC's level across all three sports with the New Year's Six appearance and two NCAA Tournament bids. We favored Utah in the power ratings because of the disparity in budgets — our estimate for the Trojans is intended to be conservative — which more than offset USC's clear edge in men's basketball success. The best collective year for USC's three sports in ages.\n3. Oregon State\nFootball: 10-3 overall, 6-3 in conference, won the Las Vegas Bowl\nMen's basketball: 11-21 overall, 5-15 in conference, lost in opening round of Pac-12 tournament\nWomen's basketball: 13-18 overall, 4-14 in conference, lost in quarterfinals of Pac-12 tournament\nFY2022 operating expenses: $87.7 million (source: Sportico)\nComment: This placement is entirely about the stellar season on the football field, where the Beavers won 10 games for the first time since the 2006 season. For departments on the lower end of the resource spectrum, football is vastly more difficult to navigate successfully than basketball — OSU's wins-per-dollar ratio in that area is absolutely first-class. Had either basketball program made the NCAAs, the Beavers might have been No. 1.\n4. Washington State\nFootball: 7-6 overall, 4-5 in conference, lost in the LA Bowl\nMen's basketball: 17-17 overall, 11-9 in conference, lost in quarterfinals of Pac-12 tournament , lost in first round of the NIT\nWomen's basketball: 23-11 overall, 9-9 in conference, won Pac-12 tournament, lost in first round of NCAAs\nFY2022 operating expenses: $84.5 million (source: WSU)\nComment: The Cougars do as much with what they have as anybody in the conference on a regular basis (and far more than most schools). Their seventh consecutive bowl berth (excluding 2020) is proof they have just the right model for their resources and geography. But because of the weighting we assigned to football success, WSU falls just below three schools that posted double-digit victories.\n5. UCLA\nFootball: 9-4 overall, 6-3 in conference play, lost in the Sun Bowl\nMen's basketball: 31-6 overall, 18-2 in conference, won regular-season title, lost in finals of Pac-12 tournament, lost in Sweet 16 of NCAAs\nWomen's basketball: 27-10 overall, 11-7 in conference, lost in finals of Pac-12 tournament, lost in Sweet 16 of NCAAs\nFY2022 operating expenses: $131.1 million (source: Hotline)\nComment: We gave serious consideration to slotting UCLA above Washington State based on the marked disparity in men's basketball success and two more wins on the field. But this is a subjective assessment, and the $50 million difference in expenditures (approximately) is significant. That said, the Bruins, like USC, experienced their best showing across all three sports in years.\n6. Arizona\nFootball: 5-7 overall, 3-6 in conference\nMen's basketball: 28-7 overall, 14-6 in conference, won Pac-12 tournament, lost in first round of NCAAs\nWomen's basketball: 22-10 overall, 11-7 in conference, lost in quarterfinals of Pac-12 tournament, lost in second round of NCAAs\nFY2022 operating expenses: $124.9 million (source: Sportico)\nComment: We contemplated a lower position for the Wildcats but ultimately determined their immense improvement on the field — following two abysmal years — should account for more than the mere five victories suggest. The stunning loss to Princeton entered into our calculation but didn't change Arizona's position. The department's budget was a bit surprising (on the high side) and seemingly represents an enhanced university commitment that should support long-haul success.\n7. Washington\nFootball: 11-2 overall, 7-2 in conference, won the Alamo Bowl\nMen's basketball: 16-16 overall, 8-12 in conference, lost in opening round of Pac-12 tournament\nWomen's basketball: 19-14 overall, 7-11 in conference, participating in semifinals of the WNIT\nFY2022 operating expenses: $149.5 million (source: UW)\nComment: The Huskies were similar to Oregon, right down to the scant 6% disparity in expenses and the three-point difference on the field. With UW's slightly better football record and Oregon's slightly lower expenditures, you could make the case the schools should be tied … except we hate ties. The glaring issue on Montlake moving forward is men's basketball, which should be one of the top four or five programs in the conference.\n8. Oregon\nFootball: 10-3 overall, 7-2 in conference, won the Holiday Bowl\nMen's basketball: 21-15 overall, 12-8 in conference, lost in semifinals of Pac-12 tournament, lost in third round of the NIT\nWomen's basketball: 20-15 overall, 7-11 in conference, lost in quarterfinals of Pac-12 tournament, lost in fourth round of WNIT\nFY2022 operating expenses: $140.6 million (source: Oregon)\nComment: Football success was impressive but just short of the top tier; the Ducks didn't qualify for the conference championship or reach the New Year's Six. However, the twin regression by the basketball programs guided our calculation when comparing the Ducks to departments ranked above them. The more you spend, the more difficult the wins-per-dollar road becomes to navigate. That said, we view Arizona, Oregon and Washington as effectively interchangeable in these rankings.\n9. Colorado\nFootball: 1-11 overall, 1-8 in conference\nMen's basketball: 18-17 overall, 8-12 in conference, lost in quarterfinals of Pac-12 tournament, lost in second round of the NIT\nWomen's basketball: 25-9 overall, 13-5 in conference, lost in semifinals of Pac-12 tournament, lost in Sweet 16 of NCAAs\nFY2022 operating expenses: $96 million (source: Colorado)\nComment: The outlook for football is obviously much brighter, but these ratings are reflective, not predictive. And on the field, CU was awful. Two pieces kept the Buffaloes from challenging for the bottom tier: The success of women's basketball, and the relatively low expenditures. The Buffs are not a big-budget operation — only OSU and WSU spent less — although their commitment to football is clearly on the rise.\n10. Arizona State\nFootball: 3-9 overall, 2-7 in conference\nMen's basketball: 23-13 overall, 11-9 in conference, lost in semifinals of Pac-12 tournament and first round of NCAAs\nWomen's basketball: 8-20 overall, 1-17 in conference, lost in opening round of Pac-12 tournament\nFY2022 operating expenses: $124 million (source: Arizona Republic)\nComment: It would have been a dreary sports season for the Sun Devils — we all know what went wrong with football — if not for men's basketball reaching the NCAAs. And in that regard, we submit that no single moment meant more to any school than Desmond Cambridge's 60-foot heave to beat Arizona. Without that shot, the Devils might not have made the NCAAs, and the collective performance of the three teams would look even darker when cast against the expenditures.\n11. Stanford\nFootball: 3-9 overall, 1-8 in conference\nMen's basketball: 14-19 overall, 7-13 in conference, lost in quarterfinals of Pac-12 tournament\nWomen's basketball: 29-6 overall, 15-3 in conference, shared regular-season title, lost in semifinals of Pac-12 tournament, lost in second round of NCAAs\nFY2022 operating expenses: $119.2 million (estimate)\nComment: As with USC, our budget estimate is intended to be conservative. And even if it's high, the outlay would not offset a poor showing in the two revenue-driving sports. Football's collapse and the ongoing mediocrity of the men's basketball program have helped propel Stanford into the land of the utterly irrelevant (both locally and regionally). As with Cal, success and failure start at the top.\n12. Cal\nFootball: 4-8 overall, 2-7 in conference\nMen's basketball: 3-29 overall, 2-18 in conference, lost in opening round of Pac-12 tournament\nWomen's basketball: 13-17 overall, 4-14 in conference, lost in opening round of Pac-12 tournament\nFY2022 operating expenses: $107.3 million (source: Cal)\nComment: We get it: These are difficult times for the academically-oriented universities, especially with the transfer portal and NIL. (And COVID was particularly rough on the Bay Area schools because of absurdly stringent local health restrictions.) But that doesn't fully excuse the collective downturn in Berkeley, which has hauled Cal to depths not previously seen by its two major sports. The Bears are a mess.",
  "word_count": 1702,
  "scraped_at": "2026-02-14T13:07:22.872267"
}