{
  "article_id": "c32f98e7c316",
  "url": "https://www.irishecho.com/2023/8/mcclean-smallbone-doubts",
  "title": "McClean , Smallbone doubts",
  "date": "20230824T184500Z",
  "domain": "irishecho.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "James McClean and Will Smallbone are the latest injury worries for Republic of Ireland manager Stephen Kenny ahead of the Euro 2024 double-header against France and Netherlands next month. Wrexham’s new signing McClean sustained a jarred knee against Wimbledon 10 days ago and missed the 4-2 win over Walsall in League Two in midweek. Wrexham manager Phil Parkinson said: ‘‘McClean had a block tackle in the last five minutes. He had a scan and unfortunately he is going to be out for a couple of weeks.’’ Southampton manager Russell Martin says Smallbone’s injury is worse than expected. The midfielder injured his ankle in the 4-4 draw with Norwich. His injury is a bit worse than we would have liked. He will be a loss but hopefully for not very long.’’ Kenny is already without Séamus Coleman, Mikey Johnston and Michael Obafemi for the September qualifiers\nSAUDI LEAGUE\n‘OBSCENE’: KERR\nFormer Irish manager Brian Kerr says the current situation with players from Western Europe moving to the Saudi Pro League for massive wages is “obscene.” It started with Ronaldo's move to Al-Nassr in December last year, but many have joined this year. Ronaldo’s former Real Madrid teammate Karim Benzema joined Al-Ittihad in June, with the Saudi Pro League champions also adding the likes of N’Golo Kante, Fabinho and former Celtic forward Jota to their ranks. Two ex-Liverpool stars from their EPL winning campaign of 2019/20 have also migrated to the league, with Sadio Mane joining Ronaldo at Al-Nassr and Roberto Firmino teaming up with Al-Ahli. Elsewhere, former Reds captains Steven Gerrard and Jordan Henderson are now working together at Al-Ettifaq, with the former in the role of head coach and Henderson earning the title of club skipper following his July move. Then came news of Neymar move to Al-Hilar where his wages are reported to be 275 million euro over two years. Speaking on Virgin TV Kerr said: ‘‘The Saudi Arabia intervention is extraordinary. I think it’s very obscene the amount of money that is being offered to players and some managers also to go there and work. It’s an extreme form of sports washing without any shadow of a doubt. The players who are going don’t seem to have any conscience about it whatsoever. If they had a look in any depth at all at how the Saudi government run the country and their treatment of people and the way it can be almost blasé about killing people without trial. All sorts of stuff that’s fairly scandalous in my view.’’\nMESSI 10 FROM 7\nMessi was hailed as the “best in the world” as he scored a 10th goal in seven games to help Inter Miami win their first trophy. The 36-year-old Argentinian fired into the top corner from outside the box to give Miami the lead against Nashville SC in the Leagues Cup final. Picault levelled in the second half to send the game to penalties, but Miami won the shoot-out 10-9. Miami had the worst record in Major League Soccer this season before Messi arrived last month alongside former Barcelona team-mates Jordi Alba and Sergio Busquets. They are now unbeaten in seven games on their way winning the Leagues Cup, a tournament featuring MLS and Mexican Liga MX clubs. It was the club’s first trophy since being formed in 2020.\nNICE SENTIMENT,\nWRONG COUNTRY\nFormer Manchester United winger Andrei Kanchelskis last week thanked the people of “Great Britain” for the warm reception he has received in Ireland. Kanchelskis, who won five titles with United between 1990 and 1995, is now the General Director of Kazakh club Tobol, who beat Derry City on penalties in the Europa Conference play-off in Tallaght last Thursday. When interviewed by RTE reporter Damien O’Meara at half-time in Tallaght Kanchelskis said: “I am very happy, very glad to come back to Great Britain. It’s a great atmosphere, great fans. We are very pleased for the British people who are very friendly. Thank you to the fans for coming to Dublin from Derry City.”\nNOLAN QUITS AFTER\n20-YEAR CAREER\nFormer Republic of Ireland international Eddie Nolan has called time on his playing career after 20 years as a professional. Nolan won all three of his caps in 2009, making his debut against Nigeria in a friendly at Craven Cottage. He also saw game time in a defeat to Australia and a victory over South Africa, both played at Thomond Park. His club career brought the Waterford native to England, where he played in the Championship for Preston North End and Sheffield Wednesday, while also enjoying spells at Scunthorpe United and Crewe Alexandra. He returned to his hometown club in the middle of the 2021 season, playing his final professional game for the Blue against Galway this month.\nCARMONA WINNER\nCaptain Olga Carmona scored the winner in the first half as Spain won the Women’s World Cup for the first time by beating England 1-0 in front of 75,784 fans at Stadium Australia in Sydney on Sunday. Spain’s achievement is a remarkable one given manager Jorge Vilda survived a player revolt less than 12 months ago. Fifteen players withdrew from the squad, but three later their minds. That unrest in the set-up meant the manager was missing Sandra Panos, Mapi Leon, Patri Guijarro and Claudia Pina, who all helped Barcelona win the Champions League in June.\nInterestingly none of the Irish squad spoke out in support of their manager Vera Pauw after her spat with captain Katie McCabe in our final game in the World Cup against Nigeria last month. I don’t think Pauw could do without some of her top players like Vilda did. Still no word from the FAI on Pauw’s future. We were told that the World Cup review process is over, but no confirmation regarding the Dutch woman’s future as The Republic of Ireland’s manager. Meanwhile the IFA has appointed Tanya Oxtoby as their new manager. The 41-year-old Australian, who previously managed Bristol City in the Women’s Super League and was most recently assistant manager at Chelsea, has signed a four-year contract. She replaces Kenny Shiels who quit in January after nearly four years in charge. The Maghera native took Northern Ireland to the Euro finals in England in 2022.\nIn other news, Irish midfielder Lily Agg has joined Birmingham City where she will be part of a squad with her international teammates Louise Quinn, Lucy Quinn and Jamie Finn. The 29-year-old has joined from London City Lionesses on a one-year deal, with a further year option.\nNO LUCK IN\nSHOOTOUTS\nThree days after losing a penalty shoot-out to Tobol Kostanay of Kazakhstan in the Conference League qualifiers at Tallaght Stadium, Derry City lost another shoot-out on Sunday evening, this time at home to St Pat’s in the second round of the FAI Cup. Daryl Horgan scored his first goal since his return to Dundalk as the County Louth side beat Bray Wanderers 1-0 at the Carlisle Grounds 1-0 on Friday night. Storm Betty caused the cancellation of Cork City’s home game against Waterford and the abandonment of another Cup game in Dublin. UCD’s game against Galway in Belfield was abandoned at half-time when the first division club were winning 2-0. The last two non-League clubs are out; St Patricks CY were beaten 1-0 in Ringsend by Wexford Youth and Skerries lost 5-0 to Finn Harps in Ballybofey.\nRUGBY FOR GAA\nVENUE IN ULSTER?\nUlster Rugby are believed to be exploring the possibility of staging a fixture at a GAA ground in the province this autumn. With their Ravenhill pitch currently being replaced with an artificial surface, Ulster Rugby has reportedly sounded out their GAA counterparts with a view to staging a pre-season friendly, expected to be against Glasgow in October. The Athletic Grounds in Armagh and Celtic Park in Derry would be among the possibilities, with both boasting capacities similar to that of Ravenhill.\nUlster have never staged a game at a GAA ground, something that for decades would have been prohibited by the GAA’s Rule 42. But that rule was altered in 2005 in light of the redevelopment of Lansdowne Road and Irish rugby and soccer teams played internationals at Croke Park between 2007 and 2010. Last year the Munster Rugby team played South Africa at Páirc Uí Chaoimh and the Cork venue is expected to host a Munster vs Crusaders game next year. Ulster’s URC season begins away to Zebre on Oct. 21, considerably later as the Rugby World Cup takes place in France in September and October.\nKELLY MOVES UP\nOffaly’s under 20 All-Ireland winning manager Declan Kelly is set to take over the county's senior footballers and his appointment should be ratified at the next County Board meeting. Kelly has had much success in recent years, leading the Faithful County to Leinster and All-Ireland under 20 titles in 2021 while also helping St Loman’s to back to back Westmeath titles in 2020 and 2021. Kelly succeeds Martin Murphy who temporarily took over after the of Liam Kearns last March.\nPaddy Christie has been ratified as Longford senior football manager for a second year. The former Dublin full back was reappointed at last week’s county board meeting along with the rest of his backroom team, except for Michael Kenny who has stepped down from his role as a selector. Christie's reign got off to a great start when Longford won the O’Byrne Cup last January. However, they were subsequently relegated to Division 4 of the National League and were knocked out of the Leinster championship and Tailteann Cup by Offaly and Down respectively.\nCALLANAN MULLS\nTIPPERARY OPTIONS\nTipperary forward Seamus Callanan says he is not sure if he is going to continue playing inter-county hurling in 2024. The 2019 Hurler of the Year made his Tipp debut back in 2008 and has collected four All-Star awards to date across a glittering 15-year inter-county career. Callanan missed the entirety of the 2022 campaign through injury but returned to the fold this season, appearing in all but one of Tipperary's six championship outings. Tipp were eliminated from contention after an All-Ireland quarter-final defeat to Galway back in June. After helping his club Drom-Inch beat Mullinahone in the Tipperary county championship, the powerful full forward, who will be 35 next month said he was unsure of where he make himself available for the county team next year. When asked about next year Callinan said: ‘‘I don't know, the year seems like it’s only over there now since the All-Ireland final so your brain has just switches into club mode. So I am just going to enjoy the next few weeks, see how far we go.’’\nDALLAS OUT\nOF N.I. GAMES\nStuart Dallas has been ruled out of Northern Ireland’s Euro 2024 qualifying double-header next month along with Steven Davis and Corry Evans. Dallas has not played since breaking his leg in April 2022, but had previously targeted a return in time to feature for Northern Ireland in June’s qualifiers. After Dallas missed those games, manager Michael O’Neill confirmed the Leeds player would also be out for September’s trips to Slovenia and Kazakhstan. Captain Davis, who suffered an ACL injury in December last year, and Corry Evans, out with cruciate ligament damage since January, will also miss out once again. Northern Ireland travel to Slovenia on Sept 7 before heading to Astana to face Kazakhstan three days later. O’Neill is due to name his squad on Aug. 29.\nMCGREGOR FOR\nDECEMBER FIGHT\nConor McGregor has confirmed he will face Michael Chandler in his return to competitive action in the UFC in December. The 35 year-old Dubliner has not fought competitively in over two years. He suffered defeat against Dustin Poirier in July 2021 after sustaining a broken leg in the first round. That loss was the second at the hands of Poirier in the space of six months and prompted a lengthy spell away from the sport. However, he is now poised to return. During his time out of the octagon, McGregor has featured as a team captain opposite Chandler on The Ultimate Fighter, something which has sparked plenty of rumours of a bout between the pair. And after McGregor took in Anthony Joshua’s victory over Robert Helenius, he confirmed that Chandler was firmly in his sights.\nIRELAND WOMEN\nFOR TWICKENHAM\nIreland’s Women Six Nations game against England on April 20 next year will be played at Twickenham. The famous West London ground attracted a record crowd of 58,498 for England’s Grand Slam win over France last May. Now England captain Marlie Packers says they are looking to sell out their games at Twickenham. England other home Six Nations game next year against Wales will be played at Ashton Gate, which is the home ground of Bristol Bears and Bristol City Soccer club. Ireland’s Women open their Six Nations campaign away to France on March 23, but the IRFU has not yet confirmed the venue for the home games against Italy, Wales and Scotland.",
  "word_count": 2162,
  "scraped_at": "2026-02-14T12:39:59.242439"
}