{
  "article_id": "c33e4c91f3ff",
  "url": "https://www.syracuse.com/tv/2025/06/how-to-watch-the-ncaa-track-field-championships-today-free-stream-channel-events.html",
  "title": "How to watch NCAA Track & Field Championships : Free stream , event list",
  "date": "20250614T020000Z",
  "domain": "syracuse.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "The final day of the men’s NCAA Division I Track & Field Championships is Friday, June 13. Several men’s championship events along with the women’s Heptathlon will air on ESPN2 from 8 to 10:30 p.m. ET.\nHow to watch: Fans can watch the event on ESPN2, or stream it free via a trial of DirecTV. The event can also be streamed via free trial on fuboTV.\nHere’s what you need to know:\nWhat: NCAA Division I Track & Field Championships\nWhen: Friday, June 13, 2025\nWhere: Hayward Field, Eugene, Oregon\nTime: 8 p.m. ET\nTV: ESPN2\nChannel Finder: DirecTV, Verizon Fios, Cox, Xfinity, Spectrum, Optimum\nLive stream: DirecTV (free trial), fuboTV (free trial), Sling (half off first month), Hulu + Live TV, ESPN+\nFriday’s men’s Track & Field Championship events\nTrack\n- National Collegiate Wheelchair 100 meter\n- 4x100 Relay\n- 1500 meter\n- 3000 Steeplechase\n- 110 Hurdle\n- 100 meter\n- 400 meter\n- 800 meter\n- 400 Hurdle\n- 200 meter\n- 5000 meter\n- 4x400 Relay\nField\n- Discus\n- High Jump\n- Triple Jump\nHere’s a recent NCAA story from the Associated Press:\nMIRAMAR BEACH, Fla. (AP) — On the one hand, what this new version of cash-infused college sports needs are rules that everybody follows.\nOn the other, they need to be able to enforce those rules without getting sued into oblivion.\nEnter the College Sports Commission, a newly created operation that will be in charge of counting the money, deciding what a “fair market” deal for players looks like and, if things go well, helping everyone in the system avoid trips to court whenever a decision comes down that someone doesn’t like.\nWith name, image, likeness payments taking over in college, this group will essentially become what the NCAA committee on infractions used to be – the college sports police, only with the promise of being faster, maybe fairer and maybe more transparent.\nIn a signal of what the CSC’s most serious mission might be, the schools from the four biggest conferences are being asked to sign a document pledging not to rely on state laws – some of which are more permissive of payments to players -- to work around the rules the commission is making.\n“We need to get out of this situation where something happens, and we run to our attorney general and file suit,” said Trev Alberts of Texas A&M, one of 10 athletic directors who are part of another group, the Settlement Implementation Committee, that is helping oversee the transition. “That chaos isn’t sustainable. You’re looking for a durable system that actually has some stability and ultimate fairness.”\nNumber crunching to figure out what’s fair\nIn this new landsacpe, two different companies will be in charge of two kinds of number crunching.\nThe first, and presumably more straightforward, is data being compiled by LBi Software, which will track how much schools are spending on every athlete, up to the $20.5 million cap each is allowed to distribute in the first year of the new arrangement expected to begin July 1.\nThis sounds easy but comes with the assumption that universities – which, for decades, have sought to eke out every edge they can, rulebook or no – will provide accurate data.\n“Over history, boosters have looked for ways to give their schools an advantage,” said Gabe Feldman, a sports law professor at Tulane. “I think that will continue even with the settlement. It’s anyone’s guess as to how that manifests, and what the new competitive landscape looks like.”\nAdding some level of transparency to the process, along with the CSC’s ability to deliver sanctions if it identifies cheaters, will be key to the new venture’s success.\n“There’s legal risk that prohibits you from doing that,” Alberts said. “But we want to start as transparent as we can be, because we think it engenders trust.”\nGood intentions aside, Alberts concedes, “I don’t think it’s illogical to think that, at first, it’s probably going to be a little wonky.”\nHow much should an endorsement deal be worth?\nSome of the wonkiest bookkeeping figures to come from the second category of number crunching, and that involves third-party NIL deals. The CSC hired Deloitte to run a so-called clearinghouse called “NIL Go,” which will be in charge of evaluating third-party deals worth $600 or more.\nBecause these deals aren’t allowed to pay players simply for playing – that’s still technically forbidden in college sports -- but instead for some service they provide (an endorsement, a social media shoutout and so forth), every deal needs to be evaluated to show it is worth a fair price for what the player is doing.\nIn a sobering revelation, Deloitte shared with sports leaders earlier this month that around 70% of third-party deals given to players since NIL became allowable in 2021 would have been denied by the new clearinghouse.\nAll these valuations, of course, are subject to interpretation. It’s much easier to set the price of a stock, or a bicycle, than the value of an athlete’s endorsement deal. This is where things figure to get dicey. Though the committee has an appeals process, then an arbitration process, ultimately, some of these cases are destined to be challenged in court.\n“You’re just waiting to see, what is a ‘valid business purpose’ (for an NIL deal), and what are the guidelines around that?” said Rob Lang, a business litigation partner at Thompson Coburn who deals with sports cases. “You can see all the lawyer fights coming out of that.”\nAvoiding court, coordinating state laws are new priorities\nIn fact, elements of all this are ripe to be challenged in court, which might explain why the power conferences drafted the document pledging fealty to the new rules in the first place.\nFor instance, Feldman called a law recently enacted in Tennessee viewed by many as the most athlete-friendly statute in the country “the next step in the evolution” of state efforts to bar the NCAA from limiting NIL compensation for athletes with an eye on winning battles for recruits and retaining roster talent.\n“What we’ve seen over the last few years is states trying to one-up each other to make their institutions more attractive places for people to go,” he said. “This is the next iteration of that. It may set up a showdown between the schools, the NCAA and the states.”\nGreg Sankey, the commissioner of the Southeastern Conference, said a league spanning 12 states cannot operate well if all those states have different rules about how and when it is legal to pay players.\nThe SEC has been drafting legislation for states to pass to unify the rules across the conference. Ultimately, Sankey and a lot of other people would love to see a national law passed by Congress that does that for all states and all conferences.\nThat will take months, if not years, which is why the new committee drafted the document for the schools to sign.\n“We are all defendant schools and conferences and you inherently agree to this,” Alberts said of the document. “I sat in the room with all of our football coaches, ‘Do you want to be governed?’ The answer is ‘yes.’”\nMore sports, gear and tickets\n- Where to watch Michigan State vs. Wisconsin today: College basketball free stream\n- Where to watch the NBA Celebrity All-Star Game for free today\n- Where to watch NASCAR Truck Series at Daytona tonight: Free live stream\n- How to watch Syracuse lacrosse vs No. 1 Maryland today for free\n- Where to watch USA women’s hockey vs. Italy today: Winter Olympics free stream\nWhat is DirecTV?\nDirecTV is a comprehensive internet TV service that offers your favorite entertainment, news and sports channels, as well as local TV stations and regional sports networks. It’s the only choice for fans who want full access to local, televised sports. DirecTV Choice includes 125+ channels, unlimited DVR storage and thousands of on-demand titles.",
  "word_count": 1329,
  "scraped_at": "2026-02-14T14:16:32.104939"
}