{
  "article_id": "c34db50f48d0",
  "url": "https://www.nbcphiladelphia.com/tag/erin-coleman/",
  "title": "Tag : Erin Coleman – NBC10 Philadelphia",
  "date": "20230429T021500Z",
  "domain": "nbcphiladelphia.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "-\nErin Coleman runs annual Hot Chocolate Run in Philly\nNBC10 morning news co-anchor Erin Coleman is feeling “sore” after completing the Hot Chocoalte Run 5K over the weekend. She shows you what it looked like along the course.\n-\nGet a tour of NBC10's new state-of-the-art news studio\nMorning show co-anchors Keith Jones and Erin Coleman give a look around our new space here at NBC10. They even give you a peek at Bill Henley’s new weather center.\n-\nErin Coleman, Keith Jones emcee Heart Ball then Erin gets ‘inspirational' honor\nIt was a big weekend for NBC10’s Erin Coleman as she was honored with PABJ’s “Women of Inspiration” award and joined NBC10 mornings co-anchor Keith Jones to emcee the annual Philadelphia Heart Ball.\n-\nHold on, Erin Coleman has never filled out a March Madness bracket?\nTODAY’s Craig Melvin doesn’t know what to say after NBC10’s Erin Coleman admitted to never filling out an NCAA Men’s Basketball bracket.\n-\n‘Sprinkles of tears': NBC Washington settles Eagles-Commanders bet, sends cupcakes to NBC10\nNBC Washington’s Commanders got destroyed by NBC10’s Eagles, so the D.C. station has sent Georgetown Cupcakes to Keith Jones, Erin Coleman and the NBC10 morning news team to settle the NFC Championship Game wager.\n-\nNBC10 morning team expecting ‘Commanders tears' while making wager with DC station\nNBC10 morning show co-anchors Erin Coleman and Keith Jones — holding up a zero — had the trash talk going with NBC Washington colleagues. What’s on the line? Philadelphia soft pretzels should Washington win (not going to happen) and sprinkled Georgetown Cupcakes once the Eagles win.\n-\nWhat it takes to dress up as an NBC10 morning news team member\nMaybe you want to go trick-or-treating as Bill Henley, Erin Coleman, Brenna Weick and Matt Delucia for Halloween?\n-\nErin Coleman looks back on sharing Universal, Disney parks in Florida with family\nNBC10’s Erin Coleman looks back on a week in Florida as she took her family to Disney and Universal theme parks.\n-\nKeith Jones introduces baby KJ to Erin Coleman\nCuteness alert! NBC10 morning show co-anchor Erin Coleman got the joy of holding KJ, fellow co-anchor Keith Jones’ new baby.",
  "word_count": 362,
  "scraped_at": "2026-02-14T13:35:57.154756"
}