{
  "article_id": "c3525c1dd069",
  "url": "https://www.smh.com.au/sport/afl/i-think-we-should-do-it-aflw-captains-push-for-origin-series-in-quest-for-more-games-viewers-20250805-p5mkjl.html",
  "title": "AFLW 2025 : Captains push for women State of Origin",
  "date": "20250805T143000Z",
  "domain": "smh.com.au",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "By Roy Ward\nAFLW star Chloe Molloy wants the game’s best to play representative football. But despite being raised in Victoria, she said her allegiance would be to the Allies if State of Origin were to return.\n“Do I play for Victoria? Would I play for the Allies? Would I even be up for selection?” said the Swans captain, who debuted for Collingwood in 2018.\n“I never wore the Big V growing up. I played for Calder Cannons and then Diamond Creek, so I don’t have an emotional connection to the Big V, so I’m like an Allies girl.”\nAhead of the start of season 10 next Thursday, this masthead spoke with eight AFLW captains about the potential return of representative football to the women’s game – something the NRL uses to capitalise on interest in its own women’s competition, drawing millions of TV viewers.\nThe captains overwhelmingly urged the AFL to establish regular state of origin football as a way to build passion and interest, after this masthead reported the AFLW was losing $50 million a year.\nThe league’s No.1 priority for AFLW in its 10th season is for on-field standards to improve, followed by lifting attendances/ratings and financial viability.\nThe long-term goal is for the women’s game to have its own broadcast deal beyond 2031.\nThe players’ wish for an expanded season by 2031-32, in which every team plays each other once, would come at a $200 million loss.\nMolloy wants more footy and more chances to put the game’s elite players in the spotlight, and has long wanted the All-Australian side to play together each year.\n“I’m lucky to have a couple of All-Australian blazers and I think to myself, God, I’d love to see this team play,” Molloy said.\n“I don’t know where we play or who we play against, but I always thought to myself that it would be intriguing.\n“We’ve seen so many exciting formats in the men’s game, we’ve seen Origin in the past [in AFLW] and I’d love it. I’d absolutely love it.\n“Any way we can showcase talent and put them all together – I’d love to see it in any format.”\nSome captains also expressed interest in an Australia v Ireland series between AFLW and Gaelic football stars, given the influx of Irish talent.\nBut whatever the format, it must be a good product.\n“We need to make sure it is something people want to watch and really build it up,” Crows captain Sarah Allan said.\nThe teams\nIf State of Origin were to return, Molloy believed the teams should be decided based on where a player’s club is located, not where they were raised.\nBut there is still strong state allegiance from those who would don an Allies jumper. Collingwood skipper Ruby Schleicher was already picking her WA side mid-interview – Ebony Antonio and Emma Swanson were among her selections – and hatching a plan to claim Chelsea Randall from South Australia’s clutches.\n“It would be great to get the old gang back together of people we used to play against in the WAFL,” Schleicher said.\n“There is that state pride, there is nothing like putting your own colours on. But whatever it looks like, I’ll put my hand up.”\nCarlton captain Abbie McKay said she would jump at the chance to play for Victoria or Australia.\n“It would be awesome,” McKay said.\n“I played one year for Vic Metro [at under-18 level] and it would be an honour to do it again.”\nQueensland could also field a strong side considering Brisbane Lions are a perennial contender and the Gold Coast are producing a host of talented players.\n“There is that much talent that Queensland could have our own team – I’d probably say Queensland, South Australia and Victoria could all give it a red-hot crack,” Hawthorn captain Emily Bates said.\nThe standard\nThe AFLW played a State of Origin game in September 2017, when a Debbie Lee-coached Victoria thumped the Allies by 97 points at Marvel Stadium. Daisy Pearce, Ellie Blackburn and Jasmine Garner were among the stars for the Vics.\nSchleicher was adamant such a result wouldn’t be repeated.\n“Hey, hey, hey, you are talking to a WA girl here – of course not,” Schleicher exclaimed.\nBates was a part of the Allies team in 2017.\n“We got absolutely pumped, so that wasn’t a great memory,” she recalled. “But I think it would be great for the game and showcase the best talent available, I’m keen to see it happen again.”\nRichmond captain Katie Brennan was also on that Allies side and said the talent is far better than in 2017.\n“The talent from all the different states is extraordinary now,” Bates said.\n“I’m a Queenslander, born and bred, and that talent pathway has gone from strength to strength. There would be more competitive balance out there and it would be an awesome sight to see.”\nMolloy was more pragmatic about the format.\n“The under-18s is where we display our state talent. I would take a more holistic view and have the Allies playing Victoria as Victoria is like the footy capital,” she said.\nThe timing\nThe league’s continued expansion is written into the CBA – with the current 18-team competition only playing for 12 rounds plus finals.\nWhile Origin would be a way to get more games in the calendar, the same issues that plague discussions of the return of the competition for the men’s game would be problematic for the women.\nPlaying a series on the eve of the season could see star players injured ahead of their club campaigns; playing at the end or in the off-season would interrupt their breaks.\nPlaying representative football in the middle of the regular season – for example, making the game a showcase event on AFL grand final day or eve – is also likely to be unpopular with clubs.\n“The only trouble [in 2017] was the injuries that came from the game, so that would be a risk. But I think we should do it,” Bates said.\n“Timing is tricky. Girls often travel in the off-season and whatnot, I think the perfect time would be straight after the season when you still have your match fitness.”\nMolloy ruled out a mid-season Origin.\n“I don’t think fixturing it during the season is appropriate. We want to win the premiership, every team wants to win the premiership, so you don’t want to take away from that journey.”\nKeep up to date with the best AFL coverage in the country. Sign up for the Real Footy newsletter.",
  "word_count": 1097,
  "scraped_at": "2026-02-14T12:58:34.071944"
}