{
  "article_id": "c396eb6defd5",
  "url": "https://953thebear.com/west-alabama-tuesday-briefing-79/",
  "title": "West Alabama Tuesday Briefing",
  "date": "20241210T213000Z",
  "domain": "953thebear.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "West Alabama Tuesday Briefing\nGood morning West Alabama! It is Tuesday, December 10, 2024.\nTuesday Morning Observations:\nI was sitting in the newsroom this morning as strong, non-severe thunderstorms with heavy rainfall and wind gusts to 40mph moved across West Alabama. During this time dispatchers across West Alabama were responding law enforcement, fire/rescue and ambulances to wreck after wreck.\nA short time ago I talked with a first responder friend who had been busy all morning responding to 10-50s as traffic crashes are referred to in Ten Codes lingo. He lamented at how the vast majority of the crashes were preventable if drivers would just slow down.\nSome people seem to lose all driving sense in the rain. The logical assumption for worse conditions is that you drive more cautiously, but many drivers seem to become more erratic than if it was normal conditions.\nWet roadways are dangerous enough but trying to drive through areas of ponding can cause drivers to lose control of their vehicles quickly. Reduced visibility from torrential rainfall has no impact on some drivers who tool along at bright sunshiny day speeds endangering themselves, their passengers and other drivers.\nHeavy rain makes it harder to see what is ahead, sudden stopping becomes difficult, and rain can cause a car to lose grip when braking. Rain after extended dry spells like we have had can cause grease and oil build-up on roads making them even more slippery.\nThe key to rainy driving safety is pretty straightforward and common sensical. All drivers should stick to the basics when driving in rain.\n- Reduce your speed,\n- Turn your headlights if they are not automatic,\n- Maintain a three to five second gap between you and the car ahead.\n- Make sure you accelerate and brake gradually (instead of suddenly), and\n- Focus your full attention on driving.\nThe U.S. Department of Transportation (DOT) tracked and reported hazards and crashes involving various weather conditions over a 10-year period. Wet pavement not only accounted for the highest percentage of overall weather-related accidents, but it also correlated with the highest rates of accident injuries and fatalities.\nSo come on drivers, use some common sense and slow down when it is raining. It could save your life, the life of a loved one or the other driver.\n(Opinions expressed in Morning Briefing are not necessarily those of the ownership, management or staff of Townsquare Media Tuscaloosa.)\nWeather:\nIt has been a rainy and stormy start to the day with torrential rainfall occurring with some storms, leading to localized flooding in some areas.\nA FLOOD ADVISORY is in effect until1:15 this afternoon for eastern Tuscaloosa and Bibb Counties in West Alabama. Water over roadways, urban and small stream flooding are possible.\nSevere storms are possible roughly south of the I20/59 corridor in West Alabama.\nWind gusts to 40mph have also toppled some trees. The bulk of the heavy rainfall should be out of the area by mid-afternoon with showers ending later tonight.\nThe Forecast:\nTopping the News:\nNumerous traffic crashes resulting from heavy rainfall and ponding on roadways snarled rush hour traffic this morning across Tuscaloosa/Northport and West Alabama.\nDespite the threat of rain last night, good crowds turned out for the Christmas tree lighting and West Alabama Christmas Parade last night in Downtown Tuscaloosa. The two events helped kick the Christmas season into high gear.\nA University of Alabama law School graduate and former Chief of Staff for Alabama Republican Senator Tommy Tuberville is on the \"enemies list\" of Trump FBI Director Nominee Kash Patel.\nSeveral Alabama non-profits, including the group known as \"Alabama Values, are concerned that state courts are levying such high fines that citizens with cases in the legal system are being unduly burdened financially.\nCompared to most states, Alabama Treasurer Young Boozer reports that Alabama is in excellent financial condition. Boozer credits state law that requires the legislature maintain a balanced budget for financial stability. He says many other states are struggling because they do not have such a requirement.\nTopping Sports News:\nThe Crimson Tide Men's Basketball Team has moved up to #7 in this week AP College Basketball Poll and 8th in the Coaches Poll.\n2. Auburn (3) 8-1\n3. Iowa State (1) 7-1\n4. Duke 7-2\n5. Kentucky 8-1\n6. Marquette 9-1\n7. Alabama 7-2\n8. Gonzaga 7-2\n9. Florida 9-0\n10. Kansas 7-2\n11. Purdue 8-2\n12. Oregon 9-1\n13. Oklahoma 9-0\n14. Michigan 8-1\n15. Houston 5-3\n16. Clemson 9-1\n17. Texas A&M 8-2\n18. UConn 7-3\n19. Mississippi 8-1\n20. Wisconsin 8-2\n21. Michigan State 8-2\n22. Cincinnati 7-1\n23. San Diego State 6-2\n24. UCLA 8-1\n25. Mississippi State 8-1Others receiving votes: Baylor 150, Arizona State 143, Memphis 123, Missouri 119, Penn State 90, Arkansas 89, Drake 67, Pittsburgh 62, Utah State 57, Illinois 47, St. John's 43, Maryland 39, Dayton 38, Creighton 32, West Virginia 30, Indiana 30, North Carolina 24, Georgia 21, Saint Mary's 20, Texas 8, Rhode Island 3, Loyola Chicago 1\nThe Alabama Women's Basketball Team has slipped out of the AP Top 25 this week. They are listed at #26.",
  "word_count": 854,
  "scraped_at": "2026-02-14T13:16:56.919351"
}