{
  "article_id": "c3caac88dc2e",
  "url": "https://www.thisdaylive.com:443/index.php/2023/12/28/tinubu-wife-salute-excellence-of-nigerian-women",
  "title": "Tinubu , Wife , Salute Excellence of Nigerian Women",
  "date": "20231229T000000Z",
  "domain": "thisdaylive.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Latest Headlines\nTinubu, Wife, Salute Excellence of Nigerian Women\n* Host Super Falcons star, Asisat Oshoala\nDeji Elumoye in Abuja\nPresident Bola Tinubu and the First Lady, Oluremi Tinubu, Thursday hosted Super Falcons striker and 2023 CAF Women’s Player of the Year, Asisat Oshoala, in their Lagos residence.\nThe first family also congratulated the Barcelona Femeni star on winning the best African female footballer of the year for the sixth time.\nAccording to a release issued by the presidential spokesperson, the duo\ncommended Oshoala for distinguishing herself in the sport, applauding her significant contributions to women’s football on the continent.\n“Nigerian women will always have a pride of place in the world. What our ladies have achieved in football, our women are achieving in all fields of endeavour around the world—rising to the top and demonstrating the best of the Nigerian character of excellence, tenacity, ingenuity, and resilience,” the president said.\nConscious of the feats of star sprinter, Tobi Amusan, and the presence of multiple Nigerian women on the Forbes’ ‘2023 World’s 100 Most Powerful Women,’ list, including media mogul, Ms. Mo Abudu, and Director-General of the World Trade Organization (WTO), Dr. Ngozi Okonjo-Iweala, the president and the First Lady assured Oshoala of the nation’s continued support for her and other Nigerian women striving for excellence in their chosen paths.\nSpeaking to newsmen after the warm reception, Oshoala said: ”I want to appreciate the president and the first lady for giving me the opportunity to present the award to them. During the last World Cup, we had a couple of issues, and they intervened and have been very supportive to the girls, even after the competition.”",
  "word_count": 276,
  "scraped_at": "2026-02-14T12:30:57.538015"
}