{
  "article_id": "c3fc82d623e0",
  "url": "https://www.yahoo.com/lifestyle/bayern-munich-vs-arsenal-live-160949700.html",
  "title": "Bayern Munich vs Arsenal LIVE : Women Champions League latest score and updates after Lea Schuller goal",
  "date": "20230321T190000Z",
  "domain": "yahoo.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Bayern Munich vs Arsenal LIVE: Women’s Champions League result and final score after Lea Schuller goal\nArsenal take on Bayern Munich in the Women’s Champions League quarter-finals as the knockout stages get underway in Germany tonight.\nThe Gunners topped Group C ahead of current holders Lyon having won four of their six matches during the group stages. Jonas Eidevall’s side impressed over the first stage of this competition, scoring 19 goals and conceding just five but have struggled to get past the quarter-final stage in recent seasons – they were knocked out 3-1 on aggregate to Wolfsburg last year.\nBayern also seem to stumble at this stage of the tournament. The German side have reached the last-eight in five of the previous six seasons but have only progressed to the semis twice and have never reached the Champions League final. Their 4-3 aggregate defeat after extra time against PSG last year saw a 2-1 loss in the home leg but they will take confidence from the fact that they won all three of their group stage home games this term, including against Barcelona.\nFollow all the action as the Women’s Champions League knockout rounds get underway:\nBayern Munich vs Arsenal\nBayern Munich host Arsenal in the Women’s Champions League quarter-final first leg\nHow to watch the Women’s Champions League for free\n70’ OFF THE LINE! Both Blackstenius and Williamson denied by clearances (BAY 1-0 ARS)\n52’ POST! Arsenal close to an equaliser but Foord shot hits upright (BAY 1-0 ARS)\n39’ GOAL! Bayern take the lead thanks to towering header from Schuller (BAY 1-0 ARS)\nBayern Munich 1-0 Arsenal\n19:31 , Jamie Braidwood\n85 mins: SAVE! Big stop from Zinsberger to deny the rampaging Rall, who fired straight at the goalkeeper following a counter-attack. That was almost a killer blow from Bayern.\nBayern Munich 1-0 Arsenal\n19:30 , Jamie Braidwood\n84 mins: Arsenal have lost a little of their attacking momentum and Bayern are starting to breathe a little more comfortably.\nBayern Munich 1-0 Arsenal\n19:26 , Jamie Braidwood\n81 mins: Bit of a strange one for Arsenal, as Blackstenius is replaced by Kuhl with around 15 minutes remaining. Arsenal now are without a recognised striker.\nBayern Munich 1-0 Arsenal\n19:23 , Jamie Braidwood\n78 mins: Another Bayern block! This time it’s slipped into Foord, but Rall is there to block the shot from inside the box.\nBayern withdraw the goalscorer Schuller.\nBayern Munich 1-0 Arsenal\n19:21 , Jamie Braidwood\n75 mins: It’s been near-constant attack from Arsenal in this second half, but Eidevall’s side are still searching for their first goal of this quarter-final tie. Defeat would be cruel after this second half performance.\nBayern Munich 1-0 Arsenal\n19:17 , Jamie Braidwood\n72 mins: At the other end, McCabe makes a brilliant sliding challenge to deny Schuller, who had made a break.\nBayern Munich 1-0 Arsenal\n19:14 , Jamie Braidwood\n70 mins: OFF THE LINE AGAIN! How have Arsenal not scored?! From the corner, Foord heads it back across and Williamson’s shot from five yards is cleared by Schuller!\nArsenal are appealing for a backpass after Bayern gather, but nothing is given!\nBayern Munich 1-0 Arsenal\n19:12 , Jamie Braidwood\n67 mins: Bayern are preparing changes as Arsenal are well on top now. McCabe has moved to left back and shoots wide after drifting inside. The angle wasn’t there.\nNow Foord, who at times is looking to do this by herself, cuts inside and her shot is blocked behind.\nBayern Munich 1-0 Arsenal\n19:08 , Jamie Braidwood\n63 mins: Arsenal find Blackstenius again in the box but this time Viggósdóttir makes the crucial intervention with the block.\nArsenal are really pushing now.\nBayern Munich 1-0 Arsenal\n19:05 , Jamie Braidwood\n61 mins: OFF THE LINE! Arsenal are so close again! It’s brilliant defending from Kumagai, who is able to scramble back and clear Blackstenius’ header from the goalline.\nIt came following an Arsenal free kick, which caused chaos in the Bayern box.\nBayern Munich 1-0 Arsenal\n19:03 , Jamie Braidwood\n58 mins: Good defending from Wienroither at the back post. The right back is able to block Schuller’s effort as the striker lined up a volley following a switch.\nIt’s Wienroither’s last action, though, as Pelova comes on.\nBayern Munich 1-0 Arsenal\n18:59 , Jamie Braidwood\n54 mins: Foord tries again after a brilliant turn on Rall. She went for the same shot but didn’t quite catch it, and Grohs gathers.\nBayern Munich 1-0 Arsenal\n18:56 , Jamie Braidwood\n52 mins: OFF THE POST! So close from Foord! She cuts inside and curls an excellent shot towards the far corner, but it’s against the bottom of the upright! So unlucky.\nBayern Munich 1-0 Arsenal\n18:55 , Jamie Braidwood\n51 mins: A couple of neat touches from Blackstenius helps Arsenal progress up the pitch, but the striker’s shot from outside of the box is blocked by Maanum.\nBayern Munich 1-0 Arsenal\n18:53 , Jamie Braidwood\n48 mins: Foord crunches into Lohmann and picks up the game’s first yellow card. Quite a frustrated challenge from the Australian.\nBayern Munich 1-0 Arsenal\n18:48 , Jamie Braidwood\nBack underway in Munich.\nHALF TIME! Bayern Munich 1-0 Arsenal\n18:43 , Jamie Braidwood\nHere’s the goal which has given Bayern the lead. Such a fine header.\nLEA SCHÜLLER GETS HER HEADER IN TO GIVE BAYERN THE LEAD 🔥#UWCL WATCH NOW ⬇️\n🇬🇧 https://t.co/onl6qxSLkQ\n🇩🇪 https://t.co/UJWMYqbMMx pic.twitter.com/MwAr9pkFqj— DAZN Football (@DAZNFootball) March 21, 2023\nHALF TIME! Bayern Munich 1-0 Arsenal\n18:33 , Jamie Braidwood\nAnd there’s the half-time whistle. Maybe Arsenal are fortunate after all that’s it’s only 1-0.\nBayern Munich 1-0 Arsenal\n18:33 , Jamie Braidwood\n44 mins: CHANCE! Schuller could have had a hat-trick in this half alone. The forward is slipped through as another ball splits Williamson and Rafaelle. Her shot this tme is lifted, but just drifts wide.\nBayern Munich 1-0 Arsenal\n18:32 , Jamie Braidwood\n43 mins: Eidevall follows Williamson in roaring at the Arsenal players - the Gunners were right in this until the goal but they must pick themselves up and go again.\nGOAL! Bayern Munich 1-0 Arsenal (Schuller 39’)\n18:26 , Jamie Braidwood\nWhat a header! Bayern lead through their top scorer and it’s a moment of class from the striker! Schuller drifts into the space between Williamson and Wienroither at the back post and powers a header into the top corner, beating Zinsberger.\nIt was a wonderful cross from the right back Rall.\nBayern Munich 0-0 Arsenal\n18:24 , Jamie Braidwood\n35 mins: Now it’s Arsenal’s turn to attack, with this first leg remaining on such a fine edge. McCabe first picked out Blackstenius with a clever ball, but Bayern were able to clear her cross. Then the striker’s touch let her down on the edge of the box.\nBayern Munich 0-0 Arsenal\n18:19 , Jamie Braidwood\n31 mins: SAVE! Rafaelle is caught again with a ball that finds Schuller’s run in behind. Bayern’s top scorer takes another early shot, this time at Zinsberger’s near post, but the goalkeeper is equal to it.\nBayern Munich 0-0 Arsenal\n18:16 , Jamie Braidwood\n28 mins: The momentum has swung back in Bayern’s favour. Arsenal have been caught a couple of times with direct balls forward by Bayern.\nIt’s still nicely poised at 0-0, though.\nBayern Munich 0-0 Arsenal\n18:13 , Jamie Braidwood\n25 mins: The ball sits up nicely for Stanway on the edge of the box after Magull cut inside. The England international took the volley on but it’s dragged wide.\nBayern Munich 0-0 Arsenal\n18:11 , Jamie Braidwood\n23 mins: CLOSE! Schuller is inches away from giving Bayern the lead! Raffaelle slips as Bayern quickly launch a counter. The striker takes on the shot early from outside the box but the shot whistles past the Zinsberger’s post.\nBayern Munich 0-0 Arsenal\n18:08 , Jamie Braidwood\n19 mins: Chance! Williamson makes a burst from defence and Blackstenius is slipped in. The striker can’t squeeze a shot in but it breaks to Maanum in the area, but the midfielder is blocked from close range.\nBayern Munich 0-0 Arsenal\n18:05 , Jamie Braidwood\n17 mins: Arsenal will be happy with how they are able to play through Bayern here. Williamson and Walti are getting time to pick their passes through the press and Eidevall’s side are able to control the game.\nBayern Munich 0-0 Arsenal\n18:02 , Jamie Braidwood\n14 mins: Foord finds space again on the left but Bayern are able to show the Australian down the line this time. The cross drifts behind.\nBayern Munich 0-0 Arsenal\n17:58 , Jamie Braidwood\n11 mins: Chance! Excellent play from Foord again to cut inside and whip a cross into the box. Blackstenius is free in the middle but can’t keep the header down! The striker should have scored and that’s a let off for Bayern.\nBayern Munich 0-0 Arsenal\n17:57 , Jamie Braidwood\n10 mins: Arsenal have been able to ride out that fast start from Bayern and are seeing more of the ball now. The Bayern press is ferocious in midfield, though, and the Gunners will need to be careful.\nBayern Munich 0-0 Arsenal\n17:55 , Jamie Braidwood\n8 mins: Foord cuts inside and take aim at goal from range. It’s blocked by Viggósdóttir, seemingly with the arm, but it’s not looked at any further.\nBayern Munich 0-0 Arsenal\n17:54 , Jamie Braidwood\n6 mins: Arsenal are able to sustain their first attack as Maanum is able to receive a pass through the lines and turn. The Norwegian has been one of the players of the tournament so far for Arsenal.\nBayern Munich 0-0 Arsenal\n17:51 , Jamie Braidwood\n3 mins: Bayern are being aggressive with their press in the early stages, especially towards Walti in midfield. The German side continue to be on the front foot. Buhl’s free kick from the right drifts all the way through.\nBayern Munich 0-0 Arsenal\n17:49 , Jamie Braidwood\n1 min: Bayern make a fast start as a ball in towards Schuller causes a panic in the Arsenal box. Stanway then crunches into Walti in midfield and Buhl’s shot needs to be blocked by Williamson.\nKICK-OFF! Bayern Munich 0-0 Arsenal\n17:46 , Jamie Braidwood\nUnderway at the Allianz!\nBayern Munich vs Arsenal\n17:44 , Jamie Braidwood\nSo here we go! It’s the first competitive meeting between Bayern Munich and Arsenal and the clash comes as both teams are desperate to reach the Champions League semi-finals. Arsenal are without an appearance in the last four in 10 years, while Bayern have also been short of semi-final appearances despite regular trips to the quarter-finals.\nAround 18,000 tickets have been sold for this opening match of the Women’s Champions League knockout stages, and it’s live next!\nHow to watch the Women’s Champions League\n17:38 , Jamie Braidwood\nEvery game in this season’s Women’s Champions League knockout stages is being broadcast live on streaming platform DAZN, and also on DAZN’s YouTube channel. You can set reminders to receive a notification of when the stream goes live, which is 15 minutes before the start of each match\nYou can sign up to DAZN where the matches will also be streamed for free across their digital platforms. The YouTube stream will also be embedded in the Uefa.com and on Uefa.tv for all Women’s Champions League games.\nBayern Munich vs Arsenal - Champions League talking points\n17:28 , Jamie Braidwood\nInjury-hit Arsenal aim to end last-four absence\nArsenal, the only English club to have won the competition, back in 2007, are looking to reach the semis for the first time in 10 years, facing German opposition at this stage again after being eliminated in the 2021-22 quarter-finals by Wolfsburg.\nJonas Eidevall’s side made a very eye-catching start in their group this term, winning 5-1 at eight-time and defending champions Lyon, and would finish top of the pool – but by the final round of games had suffered the significant blow of losing forwards Beth Mead and Vivianne Miedema to ACL injuries.\nThe club re-signed veteran striker Jodie Taylor last week but she is not part of their Champions League squad. Currently fourth in the Women’s Super League, they have won each of the last three games, including beating Chelsea 3-1 in the League Cup final.\nBayern Munich vs Arsenal\n17:19 , Jamie Braidwood\nChampions League quarter-final preview\nAs Arsenal travelled to Bayern Munich looking to reach what used to be familiar ground in the Women’s Champions League, Jonas Eidevall did not need to look back far to remind his players how transformative victory can be. It has been 10 years since Arsenal, the only English team to win a European title, last reached the semi-finals. Progress now would be timely, and not just for Arsenal’s development under Eidevall. It would be a significant moment for English clubs in the Champions League, as well as the tournament as a whole.\nOver the past four seasons, only six teams have reached the Champions League semi-finals: Lyon, Barcelona, Paris Saint-Germain, Wolfsburg, Bayern Munich and Chelsea. It is down to Arsenal defeating Bayern, or Roma stunning Barcelona, to change that line-up. That in itself is striking, given how long Arsenal were the standard bearers in women’s football in England, but in recent years it has been left to Chelsea to carry that charge amid an underperformance by Women’s Super League clubs in Europe.\nCan Arsenal break through the Champions League’s glass ceiling?\nBayern Munich vs Arsenal\n17:12 , Jamie Braidwood\nAn early reunion between Leah Williamson and Georgia Stanway tonight!\nThat #Lionesses love! 🥰pic.twitter.com/zWZEp32AiW\n— Lionesses (@Lionesses) March 21, 2023\nBayern Munich vs Arsenal\n17:02 , Jamie Braidwood\nArsenal manager Jonas Eidevall on Bayern Munich’s record of winning 12 of their last 13 home Champions League fixtures.\n“We have respect for but we shouldn’t fear it. We’ve been playing against teams that have had great home records this year in the Champions League.\n“Both Lyon and Juventus are two teams that have excellent home records in the Champions League and we managed to draw in Turin and won at Lyon.\n“We know we’re going to play against a good team but we’re also a good team. There is a lot of similarities in the way both teams play. It’s an exciting match-up.”\nBayern Munich vs Arsenal - Team news!\n16:47 , Jamie Braidwood\nArsenal make one change from the team that started against Reading last week, with Stina Blackstenius recalled in place of Lotte Wubben-Moy. It means Steph Catley misses out again due to a foot problem, so Noelle Maritz continues at left back with Katie McCabe staying on the wing.\nGeorgia Stanway starts for Bayern, who line up as expected.\nBayern Munich vs Arsenal - Team news!\n16:39 , Jamie Braidwood\nBayern: Grohs; Rall, Viggósdóttir, Kumagai, Hansen; Stanway, Zadrazil; Magull, Lohmann, Bühl; Schüller\nArsenal: Zinsberger; Wienroither, Williamson, Raffaelle, Martiz; Maanum, Little, Wälti; McCabe, Blackstenius, Foord\nOUR STARTING XI ✊ #ChampionsLeagueQF 🏆 pic.twitter.com/eL2h1xdczU\n— Arsenal Women (@ArsenalWFC) March 21, 2023\nBayern Munich vs Arsenal - Champions League talking points\n16:32 , Jamie Braidwood\nFamiliar foe at Bayern\nThe Gunners go up against a Bayern outfit featuring England midfielder Georgia Stanway. After leaving Manchester City to join the Bundesliga club last summer, the 24-year-old scored three goals in their group-stage games, two in a late brace that secured a 3-2 victory at Benfica.\nBayern, who finished second behind Barcelona in Group D but on the same amount of points (15), have twice before reached the Champions League semi-finals, in 2019 and 2021; last season they bowed out in the quarters with defeat over two legs to PSG.\nThey are second in the German top flight at the moment, two points behind Wolfsburg, and on a 12-match winning streak in all competitions.\nBayern Munich vs Arsenal\n16:25 , Jamie Braidwood\nArsenal have triggered the one-year option on Manuela Zinsberger’s contract, keeping the former Bayern goalkeeper at the north London club until the end of next season.\nThe Austrian left the Bavarian club on a free transfer in May 2019 after five years to sign with Arsenal and her existing deal was due to expire at the end of this campaign.\nBut last season’s WSL Golden Glove winner had no doubt in extending her stay in the capital.\n“It wasn’t a tough decision at all,” she said. “I’m happy I’m staying for another season and I’m looking forward to the game here.\n“I love Bayern Munich and Munich itself - it’s close to my family. Looking back, I’m grateful and happy with what I’ve achieved with Bayern but I’m wearing another jersey here and I’m also happy with that.”\nBayern Munich vs Arsenal\n16:18 , Jamie Braidwood\nArsenal boss Jonas Eidevall ahead of Bayern Munich fixture: “We’re a team that is in a good place right now.\n“I don’t know if this is good or bad but I felt with the preparation lately, I have had a feeling of sharing less information with the players because I’m more sure that we know what to do in situations.\n“Let’s hope it’s a good sign and not a sign of false security. I choose to believe in the first one.\n“The only way to develop quality is by spending time on something. If you’re going to have shared understanding and experiences, you have to live through things together. I can’t see any shortcuts for that.”\nBayern Munich vs Arsenal - early team news\n16:07 , Jamie Braidwood\nArsenal remain without Vivianne Miedema and Beth Mead due to long-term ACL injuries, while Steph Catley is a doubt due to a foot problem.\nBayern will be without Germany internationals Linda Dallmann and Giulia Gwinn, while England star Georgia Stanway will line-up against her former WSL opponents.\nPredicted line-ups\nBayern: Grohs; Rall, Viggósdóttir, Kumagai, Hansen; Stanway, Zadrazil; Magull, Lohmann, Bühl; Schüller\nArsenal: Zinsberger; Martiz, Williamson, Raffaelle, Catley; Maanum, Little, Wälti; McCabe, Blackstenius, Foord\nBayern Munich vs Arsenal\n16:04 , Jamie Braidwood\nChampions League quarter-final fixtures\nTuesday 21st March\nBayern Munich vs Arsenal (17.45)\nRoma vs Barcelona (20:00)\nWednesday 22nd March\nLyon vs Chelsea (17:45)\nPSG vs Wolfsburg (20:00)\nWednesday 29th March\nBarcelona vs Roma (17:45)\nArsenal vs Bayern Munich (20:00)\nThursday 30th March\nWolfsburg vs PSG (17:45)\nChelsea vs Lyon (20:00)\nWhen is Bayern Munich vs Arsenal?\n16:01 , Jamie Braidwood\nThe match will kick off at 5:45pm GMT on Tuesday 21 March at the Allianz Arena, Munich.\nHow can I watch it?\nEvery game in this season’s Women’s Champions League knockout stages is being broadcast live on streaming platform DAZN, and also on DAZN’s YouTube channel. You can set reminders to receive a notification of when the stream goes live, which is 15 minutes before the start of each match\nYou can sign up to DAZN where the matches will also be streamed for free across their digital platforms. The YouTube stream will also be embedded in the Uefa.com and on Uefa.tv for all Women’s Champions League games.\nGood evening\n16:00 , Jamie Braidwood\nHello and welcome to live coverage of the the Women’s Champions League quarter-final first leg between Arsenal and Bayern Munich tonight.\nThe Gunners topped Group C ahead of current holders Lyon having won four of their six matches during the group stages. Jonas Eidevall’s side impressed over the first stage of this competition, scoring 19 goals and conceding just five but have struggled to get past the quarter-final stage in recent seasons – they were knocked out 3-1 on aggregate to Wolfsburg last year.\nBayern also seem to stumble at this stage of the tournament. The German side have reached the last-eight in five of the previous six seasons but have only progressed to the semis twice and have never reached the Champions League final. Their 4-3 aggregate defeat after extra time against PSG last year saw a 2-1 loss in the home leg but they will take confidence from the fact that they won all three of their group stage home games this term, including against Barcelona.\nFollow all the action as the Women’s Champions League knockout rounds get underway:",
  "word_count": 3344,
  "scraped_at": "2026-02-14T12:21:19.719264"
}