{
  "article_id": "c405c20edc05",
  "url": "http://europe.chinadaily.com.cn/a/202408/06/WS66b175f7a3104e74fddb898d.html",
  "title": "Spikes and troughs",
  "date": "20240806T033000Z",
  "domain": "europe.chinadaily.com.cn",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Spikes and troughs\nThis year's Summer Games have been a mixed bag for China's 'big ball' teams\nRelying on others to shape your destiny is not about luck, it signals a shortfall in strength. As the curtain fell on the women's basketball group stage at the Paris Olympics on Sunday night, the Chinese team narrowly missed out on advancing to the quarterfinals by a single point, bringing its Olympic journey to an unexpected halt.\nRunner-up at the 2022 Women's Basketball World Cup, Team China entered the Olympics with aspirations of a podium finish. However, its campaign began with a heartbreaking 89-90 overtime loss to Spain, followed by a whopping 59-81 defeat to Serbia.\nIn Olympic women's basketball, teams compete in three groups, with the top two from each group, and the top two third-placed teams, advancing to the quarterfinals. Despite a commanding 80-58 victory over Puerto Rico in its final match, China's fate rested on the outcome of matches in other groups.\nAustralia's triumph over France secured it best third-placed spot, with two wins and one loss. Meanwhile, Belgium's resounding 27-point victory over Japan in its final group game edged it slightly ahead of China on net points, clinching the final quarterfinal berth — and signaling the end of China's bid for Olympic glory.\n\"We stood on the brink, knowing a single defeat could end it all. We fought with determination, treating each game as if it were our last,\" said Team China center Li Yueru after the win over Puerto Rico. Indeed, this match was China's last at the Paris Games.\nIn stark contrast to the disappointment of China's women's basketball team, the Chinese women's volleyball team, securing its Olympic berth just over a month ago, has surged to the top of its group. It clinched three consecutive victories, confidently, advancing to the quarterfinals where it is set to face Turkiye on Tuesday.\nSome net gains\nThe impressive performance of the volleyball team has kept alive China's hopes of podium success in one of the three major \"big ball \"sports — basketball (5x5), volleyball and soccer — at the Paris Olympics.\nSince the Tokyo Olympics, China has struggled.\nThe Chinese men's teams in all three sports failed to qualify for either Games. In Tokyo, the Chinese women's soccer team didn't advance past the group stage, finishing 10th, and didn't qualify for Paris at all.\nThe women's volleyball team, the defending champion in Tokyo, finished a disappointing ninth. The women's basketball team's fifth-place finish three years ago was the best result among the six teams.\nIn Paris, the Chinese women's basketball team finished ninth, its second-worst Olympic result ever, only better than its 10th-place finish in Rio 2016. It has reached the quarterfinals six times and the semifinals twice out of nine Olympic appearances.\nThe early exit, perhaps, wasn't a total surprise. In pre-Olympic warm-up matches, China had a poor record of two wins and 11 losses, struggling against strong teams like Australia, France and Belgium.\nThe women's sport is also grappling with a challenge similar to that faced by their male counterparts: the domestic league's low intensity is failing to maintain high performance levels. The lack of competitive drive and resilience needed for international play is evident in the team's results.\nOne potential solution is to gain experience by playing in higher-level leagues abroad. Li Yueru, a standout player for China in Paris, is a prime example. Having left the Chinese league for Turkiye, and then the WNBA's Los Angeles Sparks, Li has showcased the benefits of international-level competition.\nIn Paris, she has quickly demonstrated her enhanced skills, surpassing her previous Olympic averages of 7.4 points and 3.2 rebounds per game, by scoring 31 points and grabbing 15 rebounds in her first match.\nBasketball commentator Su Qun recently highlighted on his WeChat account that Li's performance in the first game was like that of a female Shaquille O'Neal, reflecting her significant improvement from playing overseas.\n\"Li once told me she wanted to compete in a more challenging environment. In domestic leagues, it's mostly national team players facing each other,\" Su said. \"This underscores the importance of stepping out of one's comfort zone.\"\nLi's international experience serves as a model for players in other major team sports. While moving abroad involves adapting to new languages and environments, these challenges are essential for psychological and technical growth.\nHowever, it's a bit of a \"catch 22\". To find such opportunities, a player has to be good enough, and to be good enough, they need to have a domestic set-up that allows them to excel.\nHowever, the unique appeal of competitive sports lies in overcoming adversity. The stage is always set, and while the Chinese women's basketball team has experienced success, it will not fear the lows.\nNext time, hopefully, the ball will be in their court.\nMost Popular\n- Guangdong beats Macao 2-0 in first leg of soccer cup\n- Para teams set to leave mark on ice\n- US skier Johnson wins women's downhill as Vonn crashes at Milan-Cortina Games\n- Su Yiming clinches first medal at Milano-Cortina\n- Over 300 athletes from 35 countries and regions kick off Asian championships in Tianjin\n- Legacy of Beijing 2022 lives on as Milan welcomes Games",
  "word_count": 873,
  "scraped_at": "2026-02-14T12:17:52.720454"
}