{
  "article_id": "c408bc3ba5e6",
  "url": "https://www.nytimes.com/athletic/6495281/2025/07/16/proper-england-euro-2025/",
  "title": "Will  proper England  be enough against Sweden at the Euros ? ",
  "date": "20250716T080000Z",
  "domain": "nytimes.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "When England defeated world champions Spain 1-0 at Wembley in February, courtesy of a scrappy Jess Park goal and a resilient defensive display, it was a performance out of keeping with head coach Sarina Wiegman’s general philosophy, but more familiar to those who have watched plenty of English football over the years.\nAdvertisement\nIt wasn’t elegant. It wasn’t exciting. But England battled and scrapped, and won the game through tenacity as much as technique.\nThat’s how it felt to the players, too. “We spoke about just being proper English tonight,” centre-back Millie Bright, who played an important role in defending the box, told reporters after the game. “Having that fight, and that desire to defend for each other, to work hard for each other and be hard to beat.”\nBright, an aerially dominant defender who switched to being a Plan B striker when England wanted to go direct, was perhaps the most ‘proper English’ player in the squad that won the previous European Championship three years ago and reached the World Cup final in 2023. She withdrew from contention for this summer’s Euros shortly before the start of the tournament, leaving England less ‘proper English’. And yet the phrase keeps coming up.\n“We’ve spoken about wanting to be ‘proper England’,” midfielder Georgia Stanway said at the press conference before facing the Netherlands in the second of their three group-phase games, explaining what the players had spoken about after the 2-1 defeat to France in the opener four days earlier.“We want to go back to what we’re good at — we want to go back to a traditional style of football — tough tackles, getting back to our roots.”\nCentre-forward Alessia Russo’s interpretation of the phrase was similar. “It means we’ll work hard until we can’t run any more and stick together,” she said. “We know that we are very dominant on the ball (but) we wanted to return to our roots, and we know we’re capable of performances like that.”\nAll this suggests that ‘proper England’ is really about a mentality, and the desire, when out of possession, to make it difficult for opponents. But it’s interesting to note England actually recorded the second-lowest tackle completion rate in the group stage among this tournament’s 16 teams, ahead of only Belgium.\nAdvertisement\nThree matches are a very small sample size, against opponents of varying quality, and tackle success rate doesn’t correlate particularly well with winning games — but this doesn’t particularly appear to be England’s strong suit at Euro 2025.\nTraditionally, ‘proper England’ would also be considered to be about direct football — getting the ball forward as quickly as possible. “The players use that a lot now,” Wiegman said about the phrase after that 4-0 win over her home country, the Netherlands. “(It means) togetherness, and the fight. But at the same time, when you’re in possession, for me it’s important that the passes we play are with purpose, and today you really saw the purpose in every pass we played, and for me that’s also ‘proper English’.”\nIn that game a week ago, England twice scored after excellent long passes from goalkeeper Hannah Hampton. It would be somewhat misleading to consider them ‘long balls’, though — the first, in particular, was more of an exquisite through ball for Russo rather than a long ball. But that ability to go from back to front in a direct but defined manner might be the defining quality of this England side, especially given Russo’s quality with her back to goal. Her ability to receive long balls, and the accuracy of switches out to Lauren Hemp on the left, means England are an outlier in this competition — they play long passes often, but they’re very accurate with them.\nSweden, who they face in the quarter-finals on Thursday, should be a very different test, however.\n“We’ve got a lot of experience against them,” Stanway said. “They’re tough, they’re physical, they’re more direct. I’m not sure we’ve faced that so far in our group, but we do have a lot of experience against them.” That includes a 4-0 win over Peter Gerhardsson’s side at Euro 2022, but also two draws — 1-1 in Wembley and 0-0 in Gothenburg — in qualification for this tournament.\nAdvertisement\nTough, physical and direct sounds quite ‘proper England’. And the problem is that Sweden might be able to beat them at their own game. Indeed, the roots of Swedish football philosophy extend back to the English influence. On a literal level, the game arrived in Sweden in the late 19th century thanks to English sailors whose ships docked in Gothenburg. Tactically, the Swedes’ love of 4-4-2 and zonal defending is generally attributed to the influence of two English managers, Bob Houghton and Roy Hodgson, in the 1970s.\nThis Sweden side also offers plenty of Women’s Super League experience — eight of their probable XI tomorrow night have played their club football in England at some point in their career. They also offer height, physicality and a direct manner of attacking — with long balls in behind for Stina Blackstenius, boundless midfield running from Filippa Angeldahl, or determined dribbling from Johanna Rytting Kaneryd. They’ve attempted the most dribbles (82) and crosses (89) among the 16 sides. Notably, they also cause serious problems from set pieces, particularly the inswinging corners that defined their play in the 2023 World Cup, where they knocked out defending champions the United States in the last 16, and they have as much togetherness as any squad at this tournament.\n‘Proper England’ might be the order of the day at some point again in Euro 2025, particularly if Wiegman and company reach the final and face their 2023 World Cup final conquerors Spain, who they cannot compete with in terms of possession play.\nBut ‘proper England’ alone won’t be enough to win this quarter-final. Sweden will be more fearful of Lauren James’ creativity, Lauren Hemp’s trickery and Keira Walsh’s diagonal passes. “The English are known for having a certain type of mentality, a fight about us,” said England captain Leah Williamson on Tuesday. “Historically, we’ve maybe been quite a defensive team. I remember one of the first things (Wiegman) said was ‘just slow down’. She wanted us to focus on the football.”\n‘Proper England’ might be a useful phrase in terms of mentality and team bonding. But under Wiegman, England have shown they’re capable of so much more.\nAdditional reporting: Thom Harris\n(Top photos: Getty Images)",
  "word_count": 1079,
  "scraped_at": "2026-02-14T12:44:02.106638"
}