{
  "article_id": "c40d289572be",
  "url": "https://www.thenationalnews.com/news/uk/2025/12/29/gaza-aid-worker-named-in-new-year-honours-list/",
  "title": "Gaza aid worker named in New Year Honours List",
  "date": "20251230T063000Z",
  "domain": "thenationalnews.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "A British landmine expert in Gaza and a diplomat in Jerusalem have been named in the King’s New Year Honours list.\nPatrick McCabe, who leads the UN’s Mine Action Service (Unmas) in the occupied Palestinian territories and has been working in Gaza since November 2023, has been made an Officer of the British Empire (OBE) for his work.\nIt could take years for Gaza to be made safe from unexploded weapons, Mr McCabe warned last year. “It is always heartbreaking when a child, or anyone, is injured by unexploded ordnance. But it's a fact of war and going to happen, and it doesn't happen just to the good guys [or] the bad guys. Nobody is immune to it.”\nThe UK announced £4 million for Unmas to help clear 7,500 tonnes of unexploded munitions, including landmines and cluster bombs, in October this year. The presence of large amounts of unexploded weapons in Gaza continues to obstruct paths to aid.\nMr McCabe said then that one of the biggest dangers in Gaza is tin cans containing fuses for mines which are commonly mistaken for food and were first thought to be booby traps. The cans appear harmless but can cause serious injury if opened or tampered with. The Israeli military “were using these as the explosion charges to destroy the tunnels” in the north of Gaza initially, he explained, but it is unclear why they were left behind.\nPart of Mr McCabe’s work is educating Palestinians in Gaza about the dangers of unexploded devices, and the importance of staying on demarcated paths. Mr McCabe previously protected civilians from unexploded devices in southern Somalia.\nThe UK's deputy consul general for Jerusalem Alison McEwen also receives an OBE for “services to British foreign policy”. Ms McEwen has been at the British consulate in Jerusalem since 2021 where she has worked on a range of issues such as settler violence in the West Bank and media freedom in Gaza. She led the UK team in the Palestine Marathon in Bethlehem in 2023.\nThe consulate in Jerusalem will be upgraded to an embassy following the UK's recognition of Palestine in September.\nStephen Hickey, a former ambassador to Iraq who now leads the Foreign Commonwealth and Development Office’s Middle East and North Africa department, is named a Companion of the Most Distinguished Order of St Michael and George (CMG), which recognises the service of diplomats in a foreign country.\nA non-British honouree is the Iraqi national Ali Fakieh, who served as a driver at British Embassy in Beirut.\nThe Refugee Council’s chief executive Enver Solomon is made a Commander of the British Empire (CBE) for services to refugee resettlement. Half of all the recipients at CBE level and above are women, marking the strongest representation since 2020, the Cabinet Office said. Across the list, 10 per cent come from ethnic minority backgrounds.\nActor Idris Elba and ice dancers Jayne Torvill and Christopher Dean lead the New Year Honours List while England's women's football and rugby teams are also recognised.\nElba, 53, who is known for his roles in The Wire and Luther, is knighted for services to young people, having founded the Elba Hope Foundation, which supports community empowerment, education, youth advocacy and sustainable development.\nTorvill and Dean, who took home Olympic gold at the 1984 Winter Olympics and had success at the World, European and British Championships, are made a Dame and Sir for services to ice skating and to voluntary service. The pair, who later became the faces of the TV show Dancing On Ice, said the honour was “wonderful and humbling at the same time”.\nEngland's Lionesses feature heavily on the list after their Euros win in the summer – with captain Leah Williamson made a CBE. Alex Greenwood, Keira Walsh, Georgia Stanway and Ella Toone, who were all part of the side that beat Spain in the final in Basel, Switzerland, in July, become MBEs. The team's Dutch manager Sarina Wiegman, who has won the Euros twice with England and once with the Netherlands, is awarded an honorary damehood.\nMembers of the England Women's Rugby World Cup-winning squad are also strongly represented, with Marlie Packer and Zoe Aldcroft becoming OBEs, along with coach John Mitchell. Teammates Ellie Kildunne, Sadia Kabeya, and Megan Jones are made MBEs after the Red Roses defeated Canada in the final in September.\nPaula Radcliffe, a three-time London Marathon winner who held the women's marathon world record for 16 years, is made an OBE.\nMeanwhile, a woman thought to be the oldest victim of the Horizon IT scandal, Betty Brown, 92, said it was a “shocker” to have been made an OBE for seeking justice for sub-postmasters.\nThis year's honours list includes 1,157 recipients. The oldest on the list is John Hearn, 102, who is one of four centenarians included. He receives a British Empire Medal (BEM) for services to judo and to the community in the north-east of England.",
  "word_count": 821,
  "scraped_at": "2026-02-14T13:07:04.321449"
}