{
  "article_id": "c41e81f58471",
  "url": "https://www.leinsterexpress.ie/news/gaa/1387209/the-scoreline-probably-flattered-us-laois-gaa-s-justin-mcnulty-following-loss-to-offaly.html",
  "title": "  The scoreline probably flattered u - Laois GAA Justin McNulty following loss to Offaly",
  "date": "20240105T111500Z",
  "domain": "leinsterexpress.ie",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Laois football manager Justin McNulty. Picture Credit: Denis Byrne\nThe Laois footballers got their 2024 season underway on Wednesday evening with a game against Offaly in the opening round of the O'Byrne Cup in Stradbally.\nThe game marked the first game of new Laois manager's Justin McNulty second spell in charge having previously been manager from 2010-2013. He gave his post-match thoughts following Laois' 1-11 to 0-12 defeat to their neighbours.\n\"It was nip and tuck for most of the game. The scoreline probably flattered us, I think Offaly were much the better team. They probably have more miles on the clock in terms of their preparation. There were positives, we tried a lot of players this evening and we need to learn lessons from this evening. It wouldn’t be good enough for three weeks on Saturday night when we’re out in the first league game against Longford. We know we’ve a lot to learn and the fellas are disappointed with their performance because there’s much more left in them. They’re hurting and they want to improve which is positive,\" McNulty said.\nMcNulty was unhappy with the manner that Laois gave up possession when they were in good areas and says it's an area thta they must improve on.\n\"I think they had cheap turnovers in the defence and we punished them for it. Their goal will annoy me as we had possession in the full-forward line and they turned us over pretty cheaply. They worked the ball up the pitch unopposed essentially and the ball ended up in our net. We need to recognise that possession is precious and we must not cough it up cheaply, especially if it’s not under huge pressure,\" he said.\nIt's been over 10 years since McNulty has been involved in the inter-county scene so naturally the style of football has changed.\n\"I wouldn’t say it’s changed that massively. Yes, there’s probably more defensive organisation across the board. But we have to move beyond that, it’s how we break down those defensive systems effectively. That’s what teams are all striving towards and we didn’t break them down as well as we could have this evening. The pitch was very heavy and very dead for both teams, there wasn’t a lot of fast play in the game. It’s hard to judge on a wet and heavy pitch like that this evening for both teams,\" the All-Ireland winner with Armagh said.\nThe O'Byrne Cup provides an opportunity for counties to blood new members of the panel and Laois certainly done that in their opening game with the amount of debutantes in double figures.\n\"We had 10 debutantes this evening which is fantastic. It’s a huge honour for those fellas to pull on the Laois jersey, it’s something that they’ve dreamed about since they were young boys. To be able to give them that opportunity it’s a real privilege and an honour for me as the manager and us as a coaching team. The boys although they’ve made their debut, they’re not happy about losing. I think they’ve a hunger and a desire to rectify that in the games coming up,\" McNulty said.\nLaois were in total control of the contest for the majority of the game but after half-time, McNulty made quite a few changes with 11 different players coming on over the course of the second period. This led to a drop in Laois' performance while Offaly's changes gave them a new leash of life.\n\"I wouldn’t necessarily say that the intensity dropped. I think maybe Offaly got themselves better organised than we were and that’s probably down to the fact that they’ve been training four weeks more than us since the get go. Credit to Offaly for that and we need to learn from that and recognise that the momentum did swing to Offaly. We didn’t control that and we didn’t try to check that momentum. There are huge lessons in that and we need to address that before we play Longford in the league,\" he said.\nMcNulty knows that trying to get out of Division Four won't be easy and that his backroom team will provide a big boost.\n\"I feel very lucky to have the men and women around me that we have in our coaching team. The proof is always in the pudding. If you’re judging us on tonight, you wouldn’t be giving us much plaudits so we know we’ve got to try and rectify things and make things better for the Longford game and right throughout the league. There are tough teams in Division Four, it’s going to be a dogfight trying to get out of the division and every team will be striving to do that,\" McNulty said.\nA return to inter-county management is a far cry from McNulty's day job where he is a member of the SDLP and a MLA for Newry and Armagh. He was delighted to take the job and knows how much potential there is in his players.\n\"It’s a huge adjustment but it’s a joy, I’m loving it. It’s an honour, I feel very lucky and fortunate to be working with the Laois players. I think there’s huge talent, huge ability and huge potential within the group. We have to deliver on that potential, there’s no good having potential and talking about it. That potential has to be delivered on and I’m hugely excited for the challenge not just for me and the coaching team but for the players as well to make their mark as footballers and men.\n\"It was a surprise but a pleasant one at that. I jumped at the opportunity to meet the county board and I’m very grateful for them having gone out on a limb to give me this opportunity. It’s a wonderful privilege to be an inter-county manager. I took very little convincing and it was assisted by someone coming on board with me and that was Ross Munnelly. For him to come with me was massive and to have that experience, passion and ambition for Laois in the dressing room is a real boost for us. It’s all well and good having a good strong coaching team on paper but it has got to deliver on the ground and in our performances,\" he said.\nLaois were dealt a major blow after the end of the club championships after it emerged that three stars from last year's Tailteann Cup semi-final team would be travelling for the year leaving them unable to commit to the panel for 2024.\n\"I spoke to the Portarlington fellas and they had made commitments in advance of my appointment to travel. They’re all wishing us well and probably in the back of their minds thinking I’d love to be here. That door will always be open to fellas who put their hand up at any stage and from any club. If they put their hands up and say we’re ready to rock in terms of their ability to step into the county panel, we’ll facilitate that. I wish those players well and I know there are good players in Laois, we’ve good players on the panel. I’m feeling excited for the potential we have and we need to see that delivered,\" the Laois manager said.\nLaois GAA fans in attendance on Wednesday night wouldn't have been pleased to see Paul Kingston look over to the bench and signal that he had to come having only come on a few minutes previous.\n\"There are a few injury concerns, one from this evening in particular with Paul Kingston’s hamstring. We had young Ryan Brady who done his ACL which is a very unfortunate knock for a player who was showing huge promise and it’s a big blow for him having come into the panel for the first time in recent weeks. Hopefully we’ll be going full strength into the first game of the league,\" he ended.\nLaois now drop into the O'Byrne Cup Shield where they'll be away to either Wicklow or Carlow on Saturday, January 13.\nADVERTISEMENT - CONTINUE READING BELOW\nADVERTISEMENT - CONTINUE READING BELOW\nADVERTISEMENT - CONTINUE READING BELOW\nADVERTISEMENT - CONTINUE READING BELOW\nADVERTISEMENT - CONTINUE READING BELOW\nADVERTISEMENT - CONTINUE READING BELOW\nADVERTISEMENT - CONTINUE READING BELOW\nADVERTISEMENT - CONTINUE READING BELOW\nADVERTISEMENT - CONTINUE READING BELOW\nADVERTISEMENT - CONTINUE READING BELOW\nADVERTISEMENT - CONTINUE READING BELOW\nSubscribe or register today to discover more from DonegalLive.ie\nBuy the e-paper of the Donegal Democrat, Donegal People's Press, Donegal Post and Inish Times here for instant access to Donegal's premier news titles.\nKeep up with the latest news from Donegal with our daily newsletter featuring the most important stories of the day delivered to your inbox every evening at 5pm.",
  "word_count": 1459,
  "scraped_at": "2026-02-14T13:30:00.909163"
}