{
  "article_id": "c420462852aa",
  "url": "https://www.thegrocer.co.uk/britains-biggest-alcohol-brands/britains-biggest-alcohol-brands-2024-the-top-100/692624.article",
  "title": "Britain Biggest Alcohol Brands 2024 : The top 100 | Analysis and Features",
  "date": "20240621T171500Z",
  "domain": "thegrocer.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Britain’s Biggest Alcohol Brands is The Grocer’s annual ranking of the biggest booze brands in the UK by value and volume.\nRead our full analysis of what the year has brought for the off-trade alcohol sector here.\nThis ranking is part of Britain’s Biggest Alcohol Brands 2024. See what the top 100 brands have to say about their performance over the past year\n1 (1)\nStella Artois\nSales: £661.8m\nGrowth: +6.3%\nGrocery’s bestselling booze brand has turned in the greatest absolute growth in this report. But only just.\nStella Artois is up £39.2m, having sold an extra 1.5 million litres. For comparison, rival world lagers Madrí (34), Cruzcampo (97) and Corona (11) are up by £37.8m, £29.6m and £35.3m respectively.\nStella’s core 4.6% abv lager has contributed most to the brand’s value growth. It’s up 5.5% to £626m on flat volumes.\nBut that’s not the only driver of growth. “Stella Artois’ success is built on the continuous ability to evolve its offering to meet consumer needs,” says a spokesman for owner Budweiser Brewing Group (BBG). “Recent years have seen both Stella Artois alcohol-free and Stella Artois Unfiltered come to the market.”\nIndeed, its Unfiltered variant, launched in February 2022, is now worth £32.3m, having grown value 25.2% on volumes up 20.1%. Meanwhile, Stella 0.0% has grown 6.7% to hit £3.5m; volumes are up 20.1%.\nWith costs mounting over the past year, keeping a close eye on pricing has also played a key role in Stella’s success. The average price of the 28 beer brands in this ranking has increased by an average of 6.4%. Stella’s has risen 5.7%.\nThis relative value was communicated in part by use of PMPs, the spokesman explains.\n“While shoppers are attempting to make savings across large expenditures, such as household bills, eating out and home furniture, smaller treat purchases such as alcohol are one area [where] consumers are happy to trade up,” he says.\n“Pairing this with data on consumer behaviour allows us to create offerings that catch shoppers’ eyes.\n“More than two-thirds of independent retailers are in favour of PMPs, saying they give shoppers confidence. Consumers echo this view, with more than two-thirds agreeing that PMPs provide a guarantee they’re not paying more than they should.”\nStella is also one of the many brands making use of slash PMPs – PMPs that shout about a new, lower price – during key sales periods.\n“SPMPs give shoppers the confidence that they are getting a deal with a brand they are familiar with,” adds the BBG spokesman.\nWhile Brits are counting the pennies, Stella is happy to splash out. It continues to invest in big ads, launching the global ‘A Taste Worth More’ push in March. David Beckham is seen waiting for a Stella at a bar. He flashes a ‘here we go again’ grin when he’s approached by two seemingly starry-eyed women – but it turns out they want to pick up their pints, not the former football star.\nThe ad’s illustrative of how Stella is using sport to sell lager –and not just footie. Next month will see the return of Wimbledon, of which Stella became the official beer in 2014.\n“BBG is proud to partner with a host of renowned sporting events, and Stella Artois will be serving up excitement to tennis fans ahead of Wimbledon,” says the spokesman. “Shoppers will be able to get their hands on an array of merchandise, from tops to hats, as well as a chance to win tickets to attend the coveted men’s final. Wimbledon is a focal point for Stella Artois’ ongoing Perfect Serve campaign, which offers the chance for fans across both on and off-trade to closer connect to the renowned tournament.”\nLooking beyond the sporty summer, the spokesman expects Unfiltered and 0.0% to continue to drive growth for Stella. “The low & no market is now worth £172m across the off-trade, while BBG is forecasting that by 2025, 70% of total beer consumption will be of brands in the premium or super-premium category,” he says.\n“Adapting to these trends to increase the offering already available has played a huge role in Stella Artois maintaining a strong market share.”\nThe brand has certainly been able to prove its adaptability over the years. In the 1990s, it launched Stella Dry to tap the trend for dry lagers, while 2008 saw the launch of Stella 4% following the success of the 4% abv Beck’s Vier and Budweiser 66 beers.\nThree years later came Stella Cidre – a bid to capitalise on booming sales of cider. While these products have since been axed, they illustrate Stella’s keen eye for a boozy trend.\nChanges to the alcohol duty introduced in August hint at future opportunities for the brand. The expansion of the UK’s lower band to include beer up to 3.4% abv has already prompted a wealth of product launches and reformulations from big-names rivals including Foster’s (8), BrewDog (21) and Carlsberg (23).\nSo, how long until Stella launches a lower-abv brew?\n2 (2)\nSmirnoff\nSales: £597.6m\nGrowth: –0.3%\nSmirnoff’s modest £1.5m dip in value belies a steeper volume decline of 5%. Its core vodka is responsible for most of that loss. While higher prices nudged value up 0.2% to £516.2m, volumes sank 4.5%.\nTo be fair to Smirnoff, though, its performance is strong when compared to the five other vodkas in this top 100. Only challenger Au (73) has grown volumes. Absolut (41), JJ Vodka (55) and Chekov (90) have suffered double-digit losses, and Glen’s (26) is down 5%.\nA steady stream of flavour innovation has driven Smirnoff’s relative success, says Lauren Priestley, Diageo head of off-trade category development. The brand “has continued to break barriers and stand out from the crowd when it comes to innovation”, she adds.\nMost recently, Smirnoff added 30% abv Spicy Tamarind in January. “People are keen to explore new and exciting flavours,” says Priestley. “For four in five British gen-Zers, dining is an opportunity to explore and connect with cultures from around the world. Spicy and tangy flavours play a strong role in this. So, we leveraged Smirnoff’s versatility with the flavours of Mexico to create something totally new.”\nSpicy Tamarind follows 2021’s Raspberry Crush and Mango & Passionfruit Twist, 2022’s Berry Burst, and 2023’s Cherry Drop.\nPriestley promises big things for the latest variant. “We supported the launch with significant marketing across media, sampling and in-store activations,” she says. “We look forward to it making a splash and connecting with consumers, particularly over the summer.”\nIn its first three months, it’s mustered £232k, while it’s a mixed picture for other variants. Raspberry Crush has amassed an impressive £17.5m, although that’s down 13.2%. Mango & Passionfruit has fallen 33.5%, but Cherry Drop is up 315.5% and Berry Burst up 0.5%.\nHopefully, the latest flavour will spice up sales some more.\n3 (3)\nBudweiser\nSales: £432.8m\nGrowth: –1.0%\nBudweiser is lacing up its boots for a summer of soccer. “There’s a massive opportunity to drive sales during UEFA Euro 2024,” says a spokesman for the brand.\nThe 2021 men’s Euros drove up sales of beer by nearly a fifth, he points out, as Budweiser enjoyed the highest penetration of the tournament.\nBud, which has been the England men’s football team official sponsor since 2018, could do with another boost. Value has slipped £4.4m on 12.1 million fewer litres sold. That’s the fifth biggest absolute volume decline in the top 100.\n“Many breweries have seen volume declines, and the cost of living crisis has played a huge part in this,” stresses the spokesman. “While many shoppers are trading up, many have had to cut back on luxuries.”\nRead more:\n-\nUnlocking consumer choices within beers, wines & spirits\n-\nHow low-alcohol is redefining British drinking culture\n-\nCruzcampo makes a splash in biggest booze brands list\n4 (4)\nGordon’s\nSales: £364.0m\nGrowth: –6.8%\nDon’t be fooled by the steep declines of all four gin brands in this year’s top 100. That’s the message from Gordon’s, the UK’s biggest gin brand – which has sold three million fewer litres and lost £26.7m.\n“There are positive signs of stabilisation within the gin category,” insists Diageo head of off-trade category development Lauren Priestley. “Consumer penetration of gin is still the highest of any type of spirit.”\nShe has a point. Gordon’s performance represents a significant improvement from this time last year, when it suffered the greatest absolute value decline of any top 100 brand. The improvement is down to a mix of marketing like the ‘Definitive Gin’ push and NPD such as limited-edition Sugar Plum Gin Liqueur.\n5 (5)\nHardys\nSales: £309.2m\nGrowth: +1.8%\nA 4.8% hike in average price per litre has helped nudge Hardys’ value into the black, but volumes have fallen by 1.1 million litres.\nNot that owner Accolade Wines seems terribly worried. “Any brand delivering value growth in the past year should be viewed as a success,” says marketing director Tom Smith.\n“The wine category has faced two key challenges that have impacted performance: duty change and the cost of living crisis,” he explains.\nDuty on wine rose 10.1% last August, in line with inflation, adding 44p to the cost of any standard bottle with an abv of more than 12.5%.\n“While some cost price increases were necessary, we’ve been able to manage the portfolio effectively to mitigate the impact,” adds Smith.\n6 (6)\nCarling\nSales: £288.5m\nGrowth: –3.8%\nIn absolute terms, no top 100 brand has lost more volumes than Carling over the past 12 months. It’s shifted 22.7 million fewer litres. And value has tumbled £11.3m.\nAt the same time, Aussie rival Foster’s (8) claims to be “reigniting interest” in lager with Proper Shandy, while continental lagers Madri (34) and Cruzcampo (97) are enjoying strong growth.\nAll of which implies Carling’s losses are something do with its limited range and English heritage.\nNevertheless, owner Molson Coors insists the brand is still a classic brew. “While innovation is driving sales in the category, shoppers continue to seek out familiar, trusted favourites like Carling,” says UK sales director Kevin Fawell.\nHe lists 10x440ml and 4x568ml multipacks as particularly strong performers in the past year. Carling is “key for retailers when it comes to consistently strong sales, which is why we will continue to support it with engaging marketing in 2024”, he adds. “Multipacks are continuing to prove popular as friends and families gather together to enjoy social occasions at home, and we only expect that to increase over the summer months, with barbecues, picnics and garden parties bringing a whole host of new opportunities.”\nMolson Coors is banking on more gatherings than usual this summer, given the men’s UEFA European Football Championships has already kicked off and the Paris Olympics is getting underway next month.\nCarling – the official beer of the men’s and women’s FA Cups – is well-placed to cash in on sport, says Fawell.\n“Carling is the lager brand consumers most commonly associate with football. So, we expect it to be a popular choice during a busy summer of sports.”\nTo drive excitement earlier this year, Carling launched an on-pack promotion in the run-up to the FA Cups’ latter stages. Prizes included box seats at Wembley.\nBut the brand should take heed from last year’s report. It revealed men’s World Cup sponsor Budweiser (3) suffered a 14.8% volume loss in the period covering the 2022 tournament.\nClearly, footie isn’t a guarantee of growth.\n7 (8)\nJack Daniel’s\nSales: £281.3m\nGrowth: –4.3%\nJack Daniel’s used to be synonymous with rock & roll. Picture Slash from Guns N’ Roses swaggering around LA swigging straight from the bottle. But times have changed. Now, JD’s official ambassadors are Formula 1 drivers Lando Norris and Oscar Piastri of the McLaren team.\n“Entering the fast-growing world of Formula 1 with McLaren Racing aligns perfectly with our vision to make Jack Daniel’s the most iconic spirits brand globally,” said the brand’s global MD, Sophia Angelis, last September. She was announcing the partnership, which saw JD branding emblazoned on the F1 drivers’ cars and overalls.\nAll of which was intended to rev up sales that have stalled. Value is down £12.5m and volumes have plunged 12.9%.\n8 (7)\nFoster’s\nSales: £274.4m\nGrowth: –7.5%\nThe February launch of Foster’s 3% abv Proper Shandy came just months after Rishi Sunak promised “the biggest shake-up of alcohol taxes in a century”.\nFoster’s poster boys, Brad and Dan, would probably describe it as a “good call”. Proper Shandy falls in the lower duty bracket, which was expanded in August to include drinks with an abv of 3.4% or less – up from 2.8%. Proper Shandy’s tax burden is therefore less than half that of Foster’s core lager.\nBut the new brew – already worth £1.2m – isn’t all about government duties, owner Heineken stresses. “Proper Shandy has been designed for consumers to enjoy consistent quality shandy at home,” says a spokesman.\nHe notes 193 million pints of shandy and lager top are sold in pubs every year.\n9 (9)\nSan Miguel\nSales: £272.0m\nGrowth: +5.9%\nSan Miguel is poised to overtake Foster’s (8) to become the UK’s fourth-bestselling beer. The Spanish lager has added £15.3m, while volumes have slipped a meagre 1.9%.\nThis relatively strong performance is down to efforts to establish San Miguel as a premium world beer, says UK brewer-distributor Carlsberg Marston’s Brewing Company. That included the ‘Here’s to the Seekers’ push, which made a return for summer 2024.\n“Consumers are buying less, but better quality, beer,” says CMBC sales VP Chris Pratt. “Brand differentiation and identity are really important. San Miguel is the UK’s number one world lager by volume and value, offering a sense of discovery and Spanish flair.”\nA wider range of formats is also playing a key role, he adds.\n10 (11)\nYellow Tail\nSales: £269.4m\nGrowth: +8.1%\nA £20.2m gain has propelled Aussie wine brand Yellow Tail into the top 10.\nIts core lineup fuelled the majority of that growth, adding £11.5m. That’s largely due to higher prices, though: volumes are down 4%. Its Jammy range, on the other hand, is up 11% in volumes, making its three variants worth an extra £9.3m.\nNew world blends are having a moment in the UK wine category, says Simon Lawson, MD at Yellow Tail owner Casella Family Brands (Europe). “They are easy to shop, with flavour profiles that are tailored to match consumer preferences.”\nJammy has also helped the brand appeal to younger wine drinkers, Lawson adds. They are “a group that the wine category needs to attract to ensure the long-term health of the category”.\nThe brand’s confidence in the range was shown by the addition in May 2023 of Jammy White Roo, which has “an easy-drinking, approachable flavour”.\nFor all these highlights though, the brand has still faced many of the same cost pressures that have dogged its rivals. Average price per litre has risen 9.9%.\n“Duty has had without a doubt the largest impact on the category over the last year and, of course, Yellow Tail has not been immune to this,” Lawson concedes. “Our approach has always been to minimise the impact of cost on our consumers.”\nThe brand has vowed not to water down its wines to achieve that aim. “Many of our competitors have diluted their products to manage the impact of duty, and we’re seeing consumer feedback that this isn’t an approach they are happy with.”\nInstead, he says, the brand has found a way to balance rising costs “effectively” to minimise the impact to consumers, while also retaining a margin to invest in quality and growth.\nThat investment has included a £1.8m campaign throughout 2024. Its two TV ads have achieved 50% household penetration, while the social media element has reached 12 million users.\nPlus, 15,000 consumers received product samples, adds Lawson, and “we’ve invested a further £500k in BTL activation within our retail partners, to drive conversion at the point of purchase”.\n11 (13)\nCorona\nSales: £264.9m\nGrowth: +15.4%\nGrowing thirst for low & no-alcohol beers has been a big contributor to Corona’s double-digit value growth in the past year. Its 0% abv Corona Cero, launched in January 2022, almost doubled in value to £10.3m and grew volumes 86.7%.\n“The rising sales in the [low & no] sector have made Corona Cero a popular choice, with a share growth of 20% across the total trade,” says a spokesperson for the brand. “The low & no market is now worth £172m across the off-trade.”\nIt makes sense, then, that Cero has enjoyed “a positive reception for those who are seeking enjoyable alternatives to traditional options, without the full effects of alcohol”, the spokesperson adds.\nGiven its current performance, it’s little surprise Corona Cero will take the lead spot in owner Budweiser Brewing Group’s sponsorship of this summer’s Olympic Games in Paris.\nThe group’s portfolio “is full of brands that are synonymous with sports, and Corona will now be part of that and take centre stage at one of the biggest global sporting tournaments”, it says.\nFor drinkers wanting at least a light buzz, the brand added the 3.2% abv Corona Ligera in February. Sales of the brew, which taps the growing session trend, hit the £1.3m mark in its first two months.\n12 (10)\nStrongbow\nSales: £239.9m\nGrowth: –5.7%\nBritain’s biggest UK cider brand has failed where closest rival Thatchers (25) has succeeded. Strongbow has struggled to combat flagging interest in cider, suffering an 11% volume decline and a £14.5m loss.\n13 (12)\nBarefoot\nSales: £213.5m\nGrowth: –8.3%\nBarefoot has suffered a third year of value decline. It’s lost £19.3m, having sold four million fewer litres of wine. In better news, its Buttery Chardonnay is “going from strength to strength”, adding £3.2m.\n14 (17)\nPeroni\nSales: £212.6m\nGrowth: +7.2%\nPeroni’s volumes are up just 0.9%, meaning its £14.3m gain is mostly due to higher prices. But it’s a solid performance after 2023’s double-digit losses, helped by a strong showing from Nastro Azzurro 0.0%.\n15 (14)\nThe Famous Grouse\nSales: £209.3m\nGrowth: +0.2%\nIn October, The Famous Grouse launched a major global TV campaign. Seven months later, it made its “slightly sweeter” Sherry Cask Finish – a limited-edition in 2022 – permanent. Still, volumes are down 5.9%.\n16 (15)\nBirra Moretti\nSales: £208.9m\nGrowth: +3.1%\nMoretti’s £6.2m gain was driven by higher prices. They’re up an average of 10.5% per litre; volumes are down 6.7%. On the up side, the brand’s Sale di Mare lager, unveiled in February, made £1.7m in two months.\n17 (20)\nCasillero del Diablo\nSales: £206.9m\nGrowth: +11.6%\nCasillero has sold an extra 1.1 million litres. A trend for “less but better” wine has boosted the value of its Reserva Especial lineup by 38.3%. A lower-abv Be Light range this summer is tipped to boost sales further.\n18 (16)\nHeineken\nSales: £203.7m\nGrowth: +0.7%\nHaving celebrated 150 years in 2023, Heineken’s been left with something of a hangover. Volumes are down 3.9 million litres. A Dry January push for 0.0, its alcohol-free brew, roped in former footballer Gareth Bale.\n19 (19)\nBaileys\nSales: £195.6m\nGrowth: +4.9%\nA 1.9% dip in average price accompanied a 6.9% volume gain for Baileys. Trendy variants have driven value beyond Christmas – like Salted Caramel and Espresso Crème, which added an extra £2.3m.\n20 (27)\nGuinness\nSales: £191.9m\nGrowth: +19.8%\nDiageo tripled production of Guinness 0.0 in 2023, investing a reported €25m (£21.1m) in a new Dublin facility. The alcohol-free brew added £17.2m last year, over half of the overall brand’s £31.7m value gain.\n21 (22)\nCarlsberg\nSales: £190.9m\nGrowth: +5.2%\nA £9.4m gain comes in a big year for Carlsberg. It’s invested more than £10m to increase production of its ‘snap pack’, and in April kicked off a big-budget global push centred on the evolution of music.\n22 (24)\nBrewDog\nSales: £190.6m\nGrowth: +14.1%\nBrewDog has lost CEO James Watt but gained £23.5m, shifting an extra 6.6 million litres. A busy year for the brand included the debut of session IPA Wingman and an ad ban over environmental claims.\n23 (21) Captain Morgan\nSales: £190.1m\nGrowth: +4.1%\nCaptain Morgan has added £7.5m thanks to average price per litre rising 5.9%. But volumes have dipped 1.7%. The brand launched 40% abv Black Spiced in June 2023 and Spiced Gold 0.0% in August.\n24 (18)\nMcGuigan\nSales: £185.5m\nGrowth: –3.6%\nMcGuigan has been overtaken by Casillero del Diablo in the top 100, having lost £6.9m. In a bid to claw back sales, McGuigan launched its posher Gold Label range in September, followed by the 7% abv Mid in October.\n25 (28)\nThatchers\nSales: £181.5m\nGrowth: +13.9%\nCarrying an average price of £2.94 per litre, a bottle of Thatchers isn’t cheap – but that doesn’t seem to have put off cider drinkers in the past 12 months. Although an 8% price rise fuelled a proportion of the extra £22.2m achieved by the Somerset brand, it also delivered 5.4% volume growth.\nWhile the overall cider category has faced an uphill struggle, Thatchers has benefited from a demand for posher lines, says commercial director Jon Nixon. “Gold, our leading brand, has continued to grow, and we’re seeing this premiumisation trend across the whole cider category.”\nTo further tap this fad, the brand unveiled a new version of Thatchers Vintage in May 2023. It uses “the pick of the crop from the 2022 harvest”, Nixon adds.\n“We gave it a new look and higher abv (8.3%), reflecting its premium positioning and appeal to vintage cider connoisseurs.” The sales results have already been “spectacular” in the first quarter of 2024, he says.\nFurther growth is being driven by flavour innovation. Thatchers Blood Orange has added £4.6m, while Apple & Blackcurrant, added in October, has already hit £4.1m.\nAnd, though less established than in other booze sectors, alcohol-free is also buoying Thatchers’ performance. Its Zero line is up 38% in value. Says Nixon: “The consumer trend towards moderation is here to stay.”\n26 (23)\nGlen’s\nSales: £180.4m\nGrowth: +0.7%\nThe ubiquitous c-store vodka has had a quiet year. A minor rise in value is accompanied by volume fall of 433.7k litres. Average price is up 6%, making Glen’s 17.6% pricier per litre than main rival Smirnoff.\n27 (25)\nKopparberg\nSales: £163.2m\nGrowth: –1.1%\nKopparberg is down 4% in volumes and running its ‘Drink Responsibly This Summer’ push. Activity includes UV-blocking football shirts for the men’s Euros, to raise awareness about sun protection.\n28 (26)\nKronenbourg\nSales: £145.6m\nGrowth: –10.2%\nIn April 2024, Kronenbourg 1664 was rebranded as 1664 Bière in the face of losses to trendier world lagers. Yet it’s still suffered this report’s third-biggest absolute volume loss: down 14.8 million litres.\n29 (30)\nBacardí\nSales: £131.2m\nGrowth: +2.2%\nBacardí has new leadership at its UK HQ and a new lease of life in grocery. Following declines in 2023, the rum’s added £2.8m on volumes up 9.5%. Such is its brand power that in autumn it debuted a streetwear range.\n30 (29)\nI Heart\nSales: £128.5m\nGrowth: –1.2%\nI Heart volumes have fallen 4.3%, while value has taken a hit to the tune of £1.5m. But the brand is nevertheless upbeat, noting its Prosecco Rosé is the market’s number two branded sparkling rosé.\n31 (31)\n19 Crimes\nSales: £125.5m\nGrowth: +2.8%\nThe £3.4m gain for 19 Crimes is due entirely to an average price increase of 7.5% per litre. Volumes are down 4.3%. In February, the brand launched The Vanished spiced rum. Next will be a mid-strength wine.\n32 (34)\nTrivento\nSales: £120.6m\nGrowth: +13.6%\nSolid distribution has been “a key driver” in the past year, says Trivento. A diverse offer has also played a role. “We see it as our role to drive the origin beyond the red malbec Argentina is synonymous with.”\n33 (32)\nCampo Viejo\nSales: £110.4m\nGrowth: –0.8%\nCampo Viejo has kept most of its value after adding its first bag-in-box and appointing chief winemaker Ignacio López last year. However, owner Pernod Richard is rumoured to be considering a sale of the brand.\n34 (50)\nMadrí Excepcional\nSales: £108.6m\nGrowth: +53.4%\nAfter rocketing into the top 100 last year, Madrí continues to soar. Its value has surged £37.8m on volumes up 42.3%. “Growth has been driven in part by impressive distribution growth,” says Molson Coors UK.\n35 (39)\nIsla Negra\nSales: £104.9m\nGrowth: +11.9%\nA move to remain affordable is paying off for Isla Negra. Last June, it lowered its abv from 12% to 10.5% to mitigate duty rises and keep price increases to a minimum. The brand’s now £11.1m better off.\n36 (40)\nJam Shed\nSales: £104.3m\nGrowth: +13.4%\nSoaring input costs have led to “higher retail pricing”, up an average of 9.5% per litre, Jam Shed admits. But the brand still aims to offer “different price points”. And volumes have held up, with 3.6% growth.\n37 (35)\nWhyte & Mackay\nSales: £99.2m\nGrowth: –2.6%\nWhyte & Mackay’s 9.7% decline in volume is a far cry from last year, when the brand toppled Bell’s as Britain’s third-biggest whisky. More woes look likely as its distillery workers take strike action this summer.\n38 (33)\nFreixenet\nSales: £99.1m\nGrowth: –8.3%\nFreixenet is the UK’s number one fizzy wine brand. Its success has been driven by Brits’ love of its Prosecco and Italian Sparkling Rosé lines, it claims.\nThis year, though, the brand’s overall performance has been less than bubbly. Value has dived £9m; volumes are down 9.8%.\nAnd that’s despite only minor price rises. Freixenet’s up just 1.7% to an average of £12.54 per litre.\n“Although the brand has managed to maintain brand penetration versus the category where household penetration is in decline, we are seeing a year-on-year value decline as a result of shoppers buying less volume, a trend observed in the wider sparkling category,” concedes a spokesperson for Freixenet.\nThey point to “challenging macro trends”, including the cost of living crisis and more moderate drinking among younger consumers.\nStill, the brand insists its portfolio is well positioned to tap trends. Its wine “has great versatility for serve options”, including its 20cl format and alcohol-free products, says the spokesperson.\n“The addition of Freixenet sparkling minis has grown the brand’s size… In addition, the alcohol-free sparkling range is delivering 15% year-on-year growth and is the fourth-largest wine brand within this growing sector.”\n39 (43)\nVilla Maria\nSales: £96.8m\nGrowth: +16.0%\nFollowing last year’s ‘Live in the Delicious’ campaign, Villa Maria is up £13.3m – selling an extra 1.2 million litres. New listings in “key retailers” also contributed to this strong growth, the brand says.\n40 (45)\nOyster Bay\nSales: £92.1m\nGrowth: +13.0%\nThe 10.2% volume gain for Oyster Bay will be music to the ears of owner Delegat. The winemaker issued a profit warning in November, predicting lower-than-expected volumes in a “flat” market.\n41 (37)\nAbsolut\nSales: £89.2m\nGrowth: –7.9%\nAbsolut Hunni landed in January as a UK exclusive. The honey-flavoured tipple was a bid to create much-needed buzz for the premium brand. It’s £7.6m worse off in a difficult vodka market.\n42 (38)\nBell’s\nSales: £88.3m\nGrowth: –6.6%\nWhile posher whiskies like Jim Beam and Johnnie Walker have grown volumes, or at least kept losses to a minimum, the same isn’t true for the lower-priced Bell’s. Volumes have slumped by 10%, continuing its decline.\n43 (36)\nBlossom Hill\nSales: £87.5m\nGrowth: –11.4%\nHaving been wine’s second-biggest loser by absolute value last year, Blossom Hill’s struggle continues. As rivals woo younger drinkers, it has turned its marketing towards “slightly more mature” consumers.\n44 (47)\nHenry Westons\nSales: £86.2m\nGrowth: +13.7%\nCider’s struggling, but Henry Westons isn’t. The brand has grown volumes 4.6%. “Distribution and sales of multipacks have performed well in convenience,” says head of marketing Sally McKinnon.\n45 (57)\nLa Vieille Ferme\nSales: £82.7m\nGrowth: +36.2%\nWith one of the biggest value gains in 2023’s report, La Vieille Ferme has continued its upward trajectory. It’s sold an extra 1.8 million litres of wine – even with a 7% increase in average price per litre.\n46 (44)\nTanqueray\nSales: £80.5m\nGrowth: –3.2%\nAll four gin brands in this report have once again suffered value losses. Tanqueray’s is the smallest at just £2.7m. The ‘Let’s Live Magnificently’ push kicked off in February in a bid to kickstart sales again.\n47 (41)\nDesperados\nSales: £79.2m\nGrowth: –8.3%\nThe outlook remains grim for Desperados. Like other established brews in Heineken’s portfolio, the brand has faced an uphill battle for several years in fending off trendier rivals.\nDesperados has lost £7.2m and sold 3.7 million fewer litres, while average price per litre shot up 12.2%.\nAttempts at innovation and diversification have done little to improve the fortunes of the tequila-flavoured lager.\nTake Desperados Red with guarana and cachaça. Its value has halved to £151.6k. Desperados Exotic Rum is the only spin-off to make money, but its total value of £70.1k is unlikely to be sparking celebrations at Heineken HQ.\nThere have been some more left-field efforts to revive interest in the flagging lager brand over the past year.\nIn summer 2023, it launched an improved version of Desperados Dance Club – an app designed to “gamify and unify dancefloors across the globe”. Pitched as “the world’s first dance-powered fundraising party app”, it turns users’ moves into donations to charities such as Stonewall and Women in Music.\nThe revamp followed research conducted by the brand that found 68% of people associate dancing with some of their best memories, while 69% agree dance has the ability to transform a bad day into a good one.\nQuestion is: can it also improve Desperados’ year?\n48 (42)\nCoors\nSales: £78.8m\nGrowth: –6.5%\nCoors has had a rocky time. Value is down £5.5m, with five million fewer litres sold. But Molson Coors insists the brand “remains an attractive option for those looking for a step up from core lagers”.\n49 (48)\nTennent’s\nSales: £76.0m\nGrowth: +2.7%\nPatrick McMahon, CEO of Tennent’s owner C&C Group, stepped down this month amid accounting errors. But the UK lager brand has enjoyed slightly smoother sailing. Volumes are down a modest 2.9%.\n50 (49)\nJameson\nSales: £72.6m\nGrowth: –0.9%\nJameson’s the priciest whisky in this report. But its 8.7% volume loss isn’t the fastest – thanks in part to a tie-up with the English Football League. Jack Daniel’s (7), Whyte & Mackay (37) and Bell’s (42) have declined faster.\n51 (46)\nBombay\nSales: £72.5m\nGrowth: –5.8%\nThe gin brand premiumised late last year, adding small batch Sapphire Premier Cru. Infused with sustainably sourced lemons, oranges and mandarins, the 47% abv tipple is targeted at gifting.\n52 (54)\nWairau Cove\nSales: £64.9m\nGrowth: +1.5%\nWairau’s owner Indevin Wine Partners considers itself the “unsung juggernaut in the New Zealand wine industry”. But the brand has lost speed. Volumes are down 5.4%, and only higher prices have added value.\n53 (52)\nEcho Falls\nSales: £63.7m\nGrowth: –9.2%\nStruggling Echo Falls continues to grow its Fruit Fusion range, adding Watermelon & Kiwi in February. The lineup is “pivotal” to returning to growth, says Accolade Wines marketing director Tom Smith.\n54 (55)\nPlaza Centro\nSales: £63.7m\nGrowth: +2.1%\nExclusive to Tesco, Plaza Centro’s prosecco has enjoyed a 6.4% increase in volume sales as a result of being affordable. It’s also well placed to benefit from this year’s anticipated spritz trend.\n55 (51)\nJJ Vodka\nSales: £62.0m\nGrowth: –12.2%\nBrits are losing their taste for vodka. Only one top 100 brand, Au (73), has grown volumes. JJ Vodka, however, has registered the fastest decline of 15.9%. Its 12.2% fall in value is also the quickest, worth £8.6m.\nIt comes after JJ Whitley vodka was revamped with a new look and new name last September. Out went the tree emblem on bottles and the latter part of its name.\nThe revamped JJ Vodka boasted a “stripped-back, sleeker design, while retaining the ‘family distillers’ messaging that remains so important to us”, said Poppy Williams, group marketing manager of owner Halewood Artisanal Spirits, at the time.\nNext came rationalisation of the brand’s huge range: variants including Gold Filtered and Pink Rose were axed. Abv was cut too in some products, as a consequence of the government’s duty increase on 1 August. Flavoured vodkas such as Blackcurrant, Blue Raspberry, and Raspberry dropped from 38% to 35%.\nJJ’s flavoured vodkas are “growing share, albeit in a declining category”, says James Stocker, Halewood sales & marketing director.\nIn an attempt to gain ground, the brand launched a vodka-based spirit drink aimed at 18 to 28-year-olds in spring 2023. The 20% abv variants include Tutti Frutti and Marshmallow.\n56 (53)\nGallo Family Vineyards\nSales: £59.3m\nGrowth: –10.4%\nIn an bid to increase standout and recoup a £6.9m loss in the latest year, California’s Gallo Family Vineyards extended its £7.99 PMP range in September to include its bestselling Pinot Grigio and Merlot.\n57 (60)\nMalibu\nSales: £59.1m\nGrowth: +3.4%\nMalibu launched an anti-spiking campaign last year, fronted by West End star Amber Davies and comedian Munya Chawawa. It aimed to “empower friends to watch out for each other on nights out”.\n58 (58)\nEstrella Damm\nSales: £57.5m\nGrowth: –3.1%\nEstrella Damm has grown its range of formats, adding a 16x330ml pack and a 4x440ml line for impulse. It’s also tapped the session trend with the August rollout of its 3.4% abv Rosa Blanca.\n59 (61)\nThree Barrels\nSales: £57.1m\nGrowth: +2.8%\nHigher prices helped Three Barrels add £1.6m. But volumes are down 2.2%. Owner William Grant & Sons has been showcasing signature cocktails – such as the Three Barrels Royale – on social media.\n60 (68)\nCaparelli\nSales: £56.8m\nGrowth: +22.2%\nCaparelli’s affordable wines are hitting the spot for consumers. Volumes are up 12.7% – in stark contrast to bigger rivals Blossom Hill (43) and Echo Falls (53), which have both suffered a double-digit decline.\n61 (59)\nJohn Smith’s\nSales: £55.3m\nGrowth: –3.7%\nIn January, Heineken announced it would cut the abv of John Smith’s Extra Smooth from 3.6% to 3.4%.\nThe company “spent many months perfecting the brew and extensively testing it with consumers to ensure the same classic taste”, claims a spokesperson.\nThe change was part of efforts to cater to consumers moderating their alcohol intake, said the brewing giant.\nThe motivation was met with some scepticism given it took the beer into a lower duty threshold, reportedly saving Heineken millions of pounds.\nBut the supplier insists the abv cut was playing to a key trend in booze, rather than an attempt to line its own pockets.\n“Drinks with an abv of 3.4% or less are continuing to gain traction, and brands who focus on this area will be well-placed to help retailers cater to those consumers who are looking to moderate,” says the Heineken spokesperson.\n“We believe that this trend for moderation is here to stay, and it will only continue to grow in 2024 and beyond as people become more attuned with mindful consumption.”\nCertainly, John Smith’s could do with a sustained trend to kickstart sales. Its flagship Extra Smooth has lost £1.6m, while the overall brand is down £2.1m.\nThat value loss could’ve been worse without a 10.1% hike in average price per litre: volumes plummeted 12.5%, or 3.7 million litres.\n62 (63)\nCourvoisier\nSales: £53.2m\nGrowth: +1.1%\nCourvoisier has gone from a 14% value loss to a 1.1% gain in the latest year. Volumes are also back in the black – albeit by just 0.5%. That’s a quietly positive start for Campari, which acquired the brand in April.\n63 (71)\nBuckfast\nSales: £50.2m\nGrowth: +12.7%\nBuckfast sought to expand its appeal last month with the launch of a canned RTD in Original (15% abv) and Lemonade (5% abv). That’s after the tonic wine brand saw volumes slip a modest 3.2%.\n64 (69)\nCanti\nSales: £49.6m\nGrowth: +8.2%\nProsecco producer Canti was something of an outlier as average price eased 2.8%. Its £3.8m gain was instead driven by a 11.3% rise in volumes, as drinkers sought out affordable luxuries at home.\n65 (56)\nWolf Blass\nSales: £48.8m\nGrowth: –21.4%\nWolf Blass continues to shed value, losing a further £13.3m as volumes dropped 25.8%. In a bid to reverse its fortunes, the Aussie brand brought its Zero range of trendy 0.5% abv wines to the UK last May.\n66 (70)\nJohnnie Walker\nSales: £48.1m\nGrowth: +7.7%\nJohnnie Walker has enjoyed price-led value growth: average price per litre grew 9.6% while volumes fell 1.8%. This spring, Black Label targeted audiences via its ‘Black Magic’ push with actor Jodie Turner-Smith.\n67 (62)\nWKD\nSales: £46.4m\nGrowth: –14.7%\n“Trading conditions were undoubtedly challenging” for WKD last year, admits Alison Gray, its head of brand. It overhauled its caffeinated WKD X range in 2023 and this year unveiled WKD 0.0%.\n68 (72)\nGrant’s\nSales: £45.5m\nGrowth: +5.2%\nIndependent whisky brand Grant’s is building back from a heavy pandemic decline. Even after a 9.2% rise in average price per litre, it remains cheaper than blended scotch rivals The Famous Grouse and Bell’s.\n69 (65)\nMoët & Chandon\nSales: £45.3m\nGrowth: –7.7%\nThe bubble has burst for the UK’s bestselling champagne. Volumes are down 11.1%. The high cost of living saw Brits cut back on posh branded fizz, turning to cheaper own-label alternatives.\n70 (73)\nJim Beam\nSales: £45.2m\nGrowth: +8.7%\nAfter a couple of difficult years, Jim Beam has found its feet. Flavoured bourbon, such as Jim Beam’s Orange and Red Stag Black Cherry lines, is bringing excitement to the whisky category, says the brand.\n71 (64)\nMagners\nSales: £41.5m\nGrowth: –15.7%\nA wet summer in 2023 put the dampener on Magners and its sunshine-centric push ‘Gardens. Best Served with Magners’. Value has tumbled £7.7m, and 5.9 million fewer litres have gone through tills.\n72 (66)\nMud House\nSales: £41.0m\nGrowth: –15.5%\nMud House took a 21.6% hit to volumes as higher input costs forced it to push up prices. But Accolade Wines marketing director Tom Smith insists the brand is “uniquely placed to lead category growth”.\n73 (115)\nAu\nSales: £41.0m\nGrowth: +73.6%\nAu is probably the most bling brand in this report. After all, the vodka business shrink-wraps its bottles in gold-effect sleeves and borrows its name from the chemical symbol for gold. Plus, the colours of some of its flavoured lines are vivid, to say the least. All of which has helped bag a top 100 debut for the Swansea brand, which is worth an extra £17.4m.\nSince launch in 2015, Au has won listings across the traditional big four for its 32.5% abv vodkas and RTDs. It’s even expanded into boozy ice-pops and slushies.\nIts growth is proof of how savvy startups can challenge big brands by drawing crowds on social media. Recent Instagram stunts by Au include offering the chance to win a gold-wrapped muscle car and handing out cash prizes in gold briefcases.\nThe brand doesn’t always turn heads for the right reasons, however. In August, the ASA ordered Au to remove three Instagram videos advertising its Pink Lemonade variant, after ruling they linked alcohol with aggressive behaviour and illegal drug use.\nOne of the vids featured London rapper Clavish tending to lemon trees under heat lamps. On screen text read: ‘Street name: Pink Lemo’.\nThe brand rejected the ruling but took down the clips, saying “target consumers understood the intention behind our campaign”.\n74 (82)\nBrancott Estate\nSales: £40.9m\nGrowth: +14.2%\nDistribution gains helped Brancott outperform a tough wine market – as did a pack refresh and repositioning to attract a younger audience. Pernod Ricard says its playful-ness has disrupted the category.\n75 (67)\nWhitley Neill\nSales: £40.3m\nGrowth: –13.4%\nIn the face of a 17.8% volume slump, Whitley Neill has moved into RTDs. In May, the brand unveiled Rhubarb Mojito, Raspberry Cosmo and Blood Orange Negroni. They come in a 50cl bottle and are 17.3% abv.\n76 (86)\nThe Kraken\nSales: £39.5m\nGrowth: +18.8%\nThe Kraken continues to make headway. It enjoyed a 13.1% surge in volumes as rum becomes a trendier tipple. This month saw an installation of a sea monster bursting from the ground in Leicester Square.\n77 (75)\nDisaronno\nSales: £39.3m\nGrowth: –2.4%\nA 7.2% rise in average price per litre failed to add value for Disaronno. The Italian liqueur has lost £1m on volumes down 9%. That’s despite the summer ‘The New Dolcevita’ push for its Velvet variant.\n78 (76)\nThe Ned\nSales: £39.0m\nGrowth: +1.0%\nThe Ned’s modest value gain is the result of higher prices. Volumes are down 4.5%. But the brand says its posh Sauvignon Blanc variants – Pinnacle and Skyscraper – are “striking a chord with UK consumers”.\n79 (92)\nNice Drop\nSales: £38.4m\nGrowth: +21.7%\nWith an average price per litre of just £5.77, it’s no wonder the 10-strong Nice Drop wine range is powering ahead as bigger, pricier rivals struggle. Exclusive to Asda, the budget brand offers still and sparkling lines.\n80 (74)\nStaropramen\nSales: £37.7m\nGrowth: –8.6%\nOwner Molson Coors hopes the April launch of a 4x440ml can pack and more ads starring actor Orlando Bloom will punch up Staropramen’s sales. They’re down £3.6m, driven by a fall of 2.5 million litres.\n81 (81)\nMartini\nSales: £37.5m\nGrowth: +3.9%\nBritain’s biggest vermouth brand has seen volumes grow 5.7%. That’s mainly down to its Asti – an affordable alternative to champers and prosecco, up 11%. Martini’s core tipple, on the other hand, has fallen 6%.\n82 (116)\nInch’s\nSales: £37.4m\nGrowth: +59.8%\nThree years after its launch, sustainable cider brand Inch’s has hit the sweet spot with Brits. It’s registered the second-fastest value increase of the top 100: a rise of £14m.\nDeveloped by Heineken as a way to recruit younger consumers to cider, Inch’s is touted as vegan and gluten-free. It’s made entirely of apples from within 40 miles of the supplier’s Hereford site, where all waste is converted into green energy.\nThese credentials are coupled with “consistent marketing spend, disruptive creative and witty, standout tone of voice”, says a Heineken spokesman.\nThat disruptive behaviour came to the fore in April, when Inch’s kicked off a partnership with a batch of young food influencers. They are set to unveil recipes featuring the cider, using only ingredients sourced from within 40 miles of its site.\nThe activity aims to “drive meaningful awareness of the Inch’s brand and keep it front of mind for shoppers”, adds the spokesman.\nIt will be combined with sampling later in the summer, as part of efforts to position the brand as a lighter, modern cider suitable for foodies.\n“We’ll also inspire and encourage our consumers to enjoy Inch’s apple cider in new and exciting ways through cocktails, food recipes, as a half-pint serve, and by adding a slice of lemon,” the spokesman says.\n83 (80)\nSouthern Comfort\nSales: £36.7m\nGrowth: +1.0%\nSouthern Comfort’s volume decline has picked up pace. Its latest 10.6% fall isn’t surprising given a 12.9% rise in average price per litre. That’s pushed the New Orleans-born brand past the £20 per litre mark.\n84 (77)\nHen\nSales: £36.4m\nGrowth: –2.0%\nHen’s 11.4% slump in volumes looks brutal – but it’s an improvement on the 18.7% reported last year. The 3.4% abv Old Session Hen made its debut in April, followed a month later by Old Midnight Hen stout.\n85 (103)\nAsahi Super Dry\nSales: £36.1m\nGrowth: +32.9%\nPartnerships like Rugby World Cup France 2023 and Manchester City “remain incredibly important to driving sales and engagement” for Asahi. It’s added £8.9m on volumes up 27.7%.\n86 (79)\nTyskie\nSales: £35.8m\nGrowth: –2.0%\nTyskie’s volumes have taken a tumble. They’re down 8.7%, equating to 1.1 million fewer litres. Owner Asahi blames “category turbulence” for the decline, but insists Tyskie still “carries a loyal lager following”.\n87 (83)\nLanson\nSales: £34.6m\nGrowth: –2.2%\nLanson is trying to counter years of decline by educating drinkers about its tipples. “We want to give consumers more information regarding the blend of each unique cuvée,” says UK MD Rob Rand.\n88 (85)\nCalvet\nSales: £34.3m\nGrowth: –0.2%\nVolumes are down 6.8% for Calvet after another poor grape harvest. Marketing has sought to play up the brand’s historical roots, while the second season of its social media series Calvet Kitchen began earlier this year.\n89 (89)\nHobgoblin\nSales: £34.2m\nGrowth: +7.6%\nAfter a shocker in our 2023 report, the “unofficial beer of Halloween” is on the up. Hobgoblin has added £2.4m and shifted 252k more litres – almost entirely thanks to its 3.4% abv Session IPA.\n90 (78)\nChekov\nSales: £33.8m\nGrowth: –8.6%\nRussian-inspired vodka Chekov has suffered the second-fastest value decline of any vodka brand in this report. It’s lost £3.2m on volumes down 14.4%, as the home-cocktail boom becomes a distant memory.\n91 (84)\nRefined & Elegant\nSales: £33.2m\nGrowth: –4.7%\nThis Asda-exclusive boxed wine brand has missed out on the trend for cheaper tipples. Volumes have fallen 13.4% across its five-strong range, which includes Malbec, Pinot Grigio and Sauvignon Blanc.\n92 (87)\nBeavertown\nSales: £33.2m\nGrowth: +0.5%\nBeavertown’s 2024 has been busy so far. The beer has secured its first TV ad; new listings for its four-pack Satellite Super Session IPA across Tesco, Co-op and Sainsbury’s; and a branded pint glass giveaway.\n93 (88)\nSharp’s\nSales: £32.6m\nGrowth: –1.1%\nSharp’s is this year celebrating 30 years as a business. The end of April saw the off-trade launch of two multipacks of Offshore Pilsner – a “refreshing, zesty lager”. However, overall volumes fell 9.4%.\n94 (93)\nPimm’s\nSales: £29.9m\nGrowth: –4.9%\nPimm’s is said to be on the chopping block at Diageo. That’s after the brand’s volumes slid 8.7% – largely the result of a washout summer in 2023 that included the sixth-wettest July on record.\n95 (96)\nDino\nSales: £29.9m\nGrowth: +2.0%\nDino was one of few brands in this report to see average price fall this year – down 1.4% to £7.35 per litre. The wine brand, which can be found in Tesco, added almost £600k as volumes grew 3.5%.\n96 (112)\nKylie Minogue\nSales: £29.8m\nGrowth: +20.9%\nKylie has taken supermarkets by storm, finally breaking into the top 100. Brits can’t get enough of the pop star’s range, which is up 19.3% in volume. This year it will add a Provence rosé and a prosecco DOC.\n97 (3,756)\nCruzcampo\nSales: £29.6m\nGrowth: +233,497.2%\nIf the massive numbers above seem unlikely, bear in mind Cruzcampo’s Especial spin-off has had very limited UK distribution for a while, bringing in a few grand.\nSales kicked up multiple notches last summer, when the Spanish brand’s core lager finally launched into grocery. In its first eight months, the brew drove an extra £29.6m. That’s the fourth-biggest absolute gain in this report.\nBrought to the UK to tap demand for continental lagers, Cruzcampo hit the on-trade in April 2023. Its near-instant popularity resulted in listings in Tesco, Booker and One Stop just four months later.\nCruzcampo has performed “exceptionally well”, says a spokesman for owner Heineken. “It was officially the biggest brand launch in value in over a decade in the beer, wine and spirits category, cementing itself as a must-stock brand for retailers looking to get ahead of trends and tap into new demographics.”\nIn April 2024, the brand kicked off its first UK campaign. With a £10m spend, ‘Choose to Cruz’ emphasises the lager’s Sevillian heritage.\nThe activity “is all about capturing the spontaneous spirit of Seville and inspiring consumers to choose to relax, be present and enjoy the moment”, the Heineken spokesman adds.\n98 (109)\nPorta 6\nSales: £29.1m\nGrowth: +15.7%\nBrits seem to be developing a taste for Portuguese wine, if the entry of Lisbon brand Porta 6 into the top 100 is anything to go by. With listings across the mults, it has grown volumes 8.8%, driving a £3.9m gain.\n99 (124)\nCamden\nSales: £28.8m\nGrowth: +31.5%\nNot only has Camden rocketed up the ranking, its value growth is the top 100’s sixth-fastest. The brand tapped the session trend with 3.4% abv Lager Top ahead of summer 2023. The 4% Stout followed in the autumn.\n100 (95)\nOld Mout\nSales: £28.5m\nGrowth: –7.5%\nOld Mout’s latest push centres on Moutopia, a utopia where people live happily “side by cider”. But the past year was far from idyllic for the brand as the cider market failed to capture Brits’ imagination.",
  "word_count": 8027,
  "scraped_at": "2026-02-14T12:08:04.212664"
}