{
  "article_id": "c4526aa46d38",
  "url": "https://www.aol.co.uk/hard-sarina-wiegman-emotional-mary-115533315.html",
  "title": "It is hard – Sarina Wiegman emotional after Mary Earps retires",
  "date": "20250529T134500Z",
  "domain": "aol.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "It is hard – Sarina Wiegman emotional after Mary Earps retires\nEngland boss Sarina Wiegman is “really disappointed” not to have Mary Earps for the European Championship this summer after the goalkeeper’s shock retirement.\nThe 32-year-old has been Wiegman’s number one choice in goal for previous tournaments, with England winning Euro 2022 and then reaching the final of the 2023 World Cup, where Earps won the Golden Glove.\nEarps announced her international retirement on Tuesday and will no longer be available for the upcoming Euros.\nWiegman said: “I’m really disappointed she is not part of the team because I want her part of the team. It must have been a really hard decision for her and so it is (for) us.\n“I had some conversations with her that I don’t want to share here because it is between us. It is hard. It’s hard for her at the same time.\n“She has done such a great job for England, she has made a massive difference and had an incredible journey so far and I really cherish that. So that’s also where the disappointment comes from too.\n“It’s emotional because you also have a relationship, we’ve had such a massive journey together with lots of highs and lows too and that’s what makes it really hard but we have to move on.\n“We don’t have time to celebrate that because we have to move forward. We have a game tomorrow, going into the Euros and then after that we can think about those things.”\nLionesses captain Leah Williamson won the Champions League with Arsenal on Saturday but had a quick turnaround with the England camp this week and found out about the news as Earps said goodbye at St George’s Park on Tuesday.\nEarps and Williamson have been two of the leading faces for women’s football in recent years and the latter said she will always support her friend with any decision she makes.\nWilliamson said: “I hope she describes me in the same way but she is one of my closest friends in football in terms of what we have been through together and the journey we’ve been on.\n“I’m devastated because I love her and love being her team-mate. The way she wears an England shirt is an example. If she thinks this is the best thing, I’ll support her always.\n“I will always try and change her mind because I want her as my team-mate. I have to respect her, but she knows I didn’t want her to leave.”\nDefender Millie Bright pulled out of the England camp for Nations League matches against Portugal and Spain to prioritise her physical and mental health following a tough and long season.\nThe 31-year-old has the full support of both her captain and head coach.\nWiegman said: “She has to take care of herself, we are in conversations. We will stay in contact and I hope she feels better soon, but I don’t know that yet at the moment.”\nWilliamson added: “For anyone to speak out about mental health is a brave thing to do. It encourages other people to do the same so she is leading by example there.\n“I’ve personally given Millie a bit of space. Naturally, any support she needs from the team we will be there to give it to her.”",
  "word_count": 554,
  "scraped_at": "2026-02-14T12:50:12.921769"
}