{
  "article_id": "c45c72f1fddc",
  "url": "https://www.fourfourtwo.com/news/rise-of-the-other-lionesses-how-one-independent-womens-championship-side-are-aiming-high",
  "title": "Rise of the ( other ) Lionesses : How one independent Women Championship side are aiming high",
  "date": "20250201T153000Z",
  "domain": "fourfourtwo.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Rise of the (other) Lionesses: How one independent Women's Championship side are aiming high\nNot backed by a men's team, Women's Championship side London City Lionesses are setting ambitious targets under leading Lyon Féminin owner, Michele Kang\nThe best features, fun and footballing quizzes, straight to your inbox every week.\nYou are now subscribed\nYour newsletter sign-up was successful\nWant to add more newsletters?\nFive times a week\nFourFourTwo Daily\nFantastic football content straight to your inbox! From the latest transfer news, quizzes, videos, features and interviews with the biggest names in the game, plus lots more.\nOnce a week\n...And it’s LIVE!\nSign up to our FREE live football newsletter, tracking all of the biggest games available to watch on the device of your choice. Never miss a kick-off!\nJoin the club\nGet full access to premium articles, exclusive features and a growing list of member rewards.\nWalk into London City Lionesses’ training ground and it’s still possible to make out a former dancefloor in the centre of the players’ lounge. But while plans to transform the facility into the beating heart of an elite club might soon see that disappear, realising their dreams would surely get more people up on their feet.\nThe second-tier outfit buck the trend as one of only two independent clubs in England’s top two divisions, and having been taken over by US entrepreneur Michele Kang 12 months ago, they have big ambitions for the future.\nKang, the owner of eight-time Champions League winners Lyon Féminin and American side Washington Spirit, hasn’t been shy in announcing her plans to establish the Lionesses as a major force, thanks to an innovative approach that sets them apart from the competition.\nLondon City Lionesses looking to disrupt the status quo\n“Michele has ambitions to really challenge in this country, be the leading women’s independent football club, and prove you can compete at the top level even if you’re not backed by a men’s team,” London City Lionesses managing director Sarah Batters tells FourFourTwo. “She wants to make sure we have the resources, science and research to train women like women and help them reach their potential.\n“Michele bought the training ground in July with the vision to create the world’s largest training complex for women and girls, so we’re in the process of imagining what that is and what that means. Since we arrived, we’ve already invested in the site and made sure that the girls have the right training ground and gym facilities for them.”\nKang’s vision represents a significant shift in the expectations around the club and promises a return to the glories of a distant past, when the side – then named Millwall Lionesses – won the FA Cup in 1991 and 1997 and enjoyed several years in the top flight.\nThey broke away from Millwall in 2019, rebranding as London City, and made home at Bromley’s Hayes Lane ground in south London. Since then, they have finished in the Championship’s upper reaches on several occasions but never quite had enough to earn promotion. With Kang at the helm, however, that’s now the least of their aims.\nThe best features, fun and footballing quizzes, straight to your inbox every week.\n“Michele’s ambitions are that we can challenge at the highest level, which means we need to be promoted to the WSL and then compete in the top four,” says Batters. “If you ask Michele, she’d say the ambition is Champions League in the next few years, but we’ll see how long it takes us to get there.”\nAn important part of that plan was to breathe new life into a playing and coaching team that finished eighth last term, with French manager Jocelyn Precheur brought in from PSG this summer to help shape a new-look side.\nPrecheur has been armed with a squad that is brimming with promise. The Lionesses attracted a number of high-profile names to come down to the second tier – among them Spain international Maria Perez, joining from Barcelona, and Sweden’s 191-cap skipper Kosovare Asllani, from Milan.\n“I’ve worked in women’s football for more than 15 years, and for all these years, I wanted to find a leader who wanted to invest and make women’s football the heart of the strategy of a club,” Precheur says. “This is the only club where I’ve really seen the women’s team at its heart, which has been a little frustrating for me because I wanted to develop that real strategy. When I met Michele for the first time, it was totally the opposite. I met someone who really wanted to develop women’s football globally, starting with a very specific project involving a group of clubs which had a vision. After meeting her, I wanted to be part of this.”\nThe sort of attention brought by Kang’s investment has naturally raised expectations, with many people tipping the Lionesses for promotion to the WSL in this campaign. Strong early-season form has meant they look likely to be in the conversation alongside the likes of Birmingham City – another team with American backing – but Precheur is trying to keep those hopes in check.\n“Having new players could be helpful, but having so many new players at one time is difficult and it’s something we’re still working on today,” he explains. “We don’t have the stability that some other teams have, because more than half of the team is composed of new players, some of whom are very young and some of whom are very experienced. They’re also from different countries, which is new for the club because they didn’t have many foreign players before.\n“We need to learn how to play together. It wasn’t easy and it’s still difficult sometimes because many new players need to adapt in an environment to create a new team. Promotion is one of the aims, but some things take time, and we also need to build a club as well as a team – it’s about staff, facilities and the future.”\nBatters openly admits the club is still working on that behind the scenes, although the ability to “test and learn”, to see what works and what doesn’t, means the end goal should be a haven that will attract the best players and coaches in the future.\nThat philosophy of training girls as they need to be trained will reach into all different elements, including the development of boots, gym equipment and nutrition plans tailored to female bodies, to maximise performance, as well as providing players with exclusively women’s-fit kits. Despite the continued growth of the game, this women’s-first approach remains an exception.\nThere’s also a drive to bring more fans to Hayes Lane by creating a novel matchday experience that includes children’s entertainment, free football games and face painting. A half-time show from a local girls’ dance school in the Lionesses’ season opener against Newcastle set tongues wagging.\n“There’s a drive to offer a different matchday for fans,” Batters says. “We’re competing in south London with a couple of clubs in our neighbourhood, in Crystal Palace and Charlton, while a lot of people travel across the river to Arsenal and fill that stadium.\n“But what is it that we can do with our independence that makes matchdays at Bromley a little bit different?”\nSuccess is one way that is sure to grab the attention of new fans, and if Kang’s record in Lyon and Washington is anything to go by, it would take a brave person to bet against her repeating that in the English capital. So, is it realistic to expect London City Lionesses to be the next great force in the women’s game?\n“There’s no restraint on her ambition,” Batters replies. “How long it takes for us to get there is another question, because as women’s football grows, it becomes more competitive – but there’s definitely no holdback on the ambition.\n“Michele owns Lyon Féminin, who are the most successful women’s football team in the world, and she owns the Washington Spirit, who have just got to the final of the NWSL. We feel really lucky to have those two big sister clubs that are successful, and the ambition is absolutely to be as successful as them one day.”\nGet it right and there’ll be plenty of reasons for London City Lionesses to get on the dancefloor and celebrate.\nChris Evans is a freelance journalist and has been a regular FourFourTwo contributor since 2014, covering a wide range of stories up and down the football pyramid. Chris's work has also appeared in the Guardian, the Independent and other national newspapers, as well as on the BBC Sport and Mail websites. He is also the author of two books for Bloomsbury Sport, How to Win the World Cup: Secrets and Insights from International Football's Top Managers in 2022, and Gary Lineker: A Portrait of a Football Icon, which was published in 2025.",
  "word_count": 1485,
  "scraped_at": "2026-02-14T12:53:18.006121"
}