{
  "article_id": "c46dc40ad579",
  "url": "https://www.the42.ie/loi-prize-money-2-6935246-Jan2026/",
  "title": "LOI title - winner prize money unchanged at €125 , 000",
  "date": "20260122T201500Z",
  "domain": "the42.ie",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "PRIZE MONEY FOR winning the 2026 League of Ireland Premier Division remains unchanged, with the league champions set to bank a cheque for €125,000.\nLeague of Ireland director Mark Scanlon confirmed the figures at a media briefing today, ahead of the new seasons’ start next month.\nThe runners-up in the Premier Division will earn €70,000, with third-place earning €48,000. The side that finishes bottom of the league will earn €25,500.\nThe winners of the First Division will earn €38,000, while the winners of the women’s Premier Division will bank €15,000.\nPremier Division clubs will earn far more money in Uefa solidarity money, which is money distributed to the top-tier clubs who did not qualify for league phase football last year. The total prize fund to be shared by clubs outside of Shamrock Rovers and Shelbourne is €3.06 million, with the Premier Division clubs agreeing to give the Uefa-mandated maximum 15% allocation to clubs in the First Division.\nThis means the eight remaining Premier Division sides will earn €325,000 each in March, and the 10 clubs in the First Division will get €45,000.\n“It’s still too way big a gap and one we and the First Division clubs wish wasn’t there, but that is the hand we have been dealt at the minute”, said Scanlon, pointing out that some top-flight clubs in Europe choose to give none of this money to lower-league clubs.\nThe League of Ireland Premier Division remains somewhat of a European outlier given the paucity of clubs’ revenue that is derived from broadcast income. Scanlon declined to release the figure Virgin Media have paid for exclusive live TV rights for the League of Ireland.\nAverage viewing figures for games on Virgin ranged between 40,000 and 105,000 last year, with the best-viewed game the 1-1 draw between Shelbourne and Shamrock Rovers in the first month of the season. There followed Rovers’ 1-0 win over Pat’s on 7 March, Pat’s goalless draw with Shelbourne on 25 April, the play-off final between Bray and Waterford at Tolka Park, and Bohs’ 4-1 win away to Drogheda on the final day of the season.\nAbsent from this list were high-profile clashes between Bohemians and Shamrock Rovers on a Sunday afternoon at the Aviva Stadium and the thrilling 3-2 win for Bohs at Tallaght stadium on Easter Monday, which has informed the FAI’s view that Friday nights remain the best bet to attract TV viewers.\n“Where we want to push for is that average to be closer to 100,000 for all games, but we’re still building that TV audience. Facilities make a difference, the time makes a difference as well”, said Scanlon.\n“With the Mondays we have tried everything, we have done bank holidays and done late games on bank holidays, we’ve done earlier games on bank holidays, we’ve done regular late games on Mondays but Friday is consistently the one that works. When people talk about spreading out fixtures, do we do games on Friday, Saturday, Sunday, have more games on TV and more fans at home watching them would have been a view I’d have had as a fan in previous years, but it doesn’t translate to the viewership figures. Friday night is still the time the casual TV audience and the people who aren’t at the games are more interested in watching games. We are trying to own the Friday night space as much as we can.”\nScanlon did reveal that the LOITV streaming service brought in €1 million in revenue last year. None of this money is retained by the FAI and is instead distributed to clubs and re-invested into the service. Each Premier Division club earns a minimum of €13,000 per year from LOITV, with a men’s First Division club banking €7,000 and a women’s League of Ireland club earning €5,000. Clubs earn varying sums on top of that from LOITV according to a profit sharing agreement that takes season’s success into account.\nScanlon estimated the service is operating at about half of its revenue potential because of the number of consumers who instead access LOITV on a dodgy box, meaning the service is losing about €1 million per year to piracy.\nAttendances across the three aforementioned divisions increased by 11% last year to 683,208, with an 8% rise in crowds at men’s Premier Division matches. The FAI hope to get the total attendance figure to around 750,000 people, and are hopeful that expansions and improvements at Tolka Park and the Brandywell will help them on the way to this figure.\nThe FAI and Derry City meanwhile remain positive that the relaying of a 90% grass pitch at their home ground remains on course. Derry aim to vacate the Brandywell at the end of March and temporarily play their home games at Celtic Park, the home of Derry GAA, with a view to returning by mid-June, to allow them play a couple of home league games on the surface before the first round of Europa League qualifiers in mid-July.\nGalway United will meanwhile play four home league games at Pearse Stadium, the home of Galway GAA, with Eamonn Deacy Park set to undergo drainage works during the summer. Galway’s final planned home game is prior to the mid-season break, so it’s envisaged that they will play in Salthill for the months of June and July.\nScanlon also revealed more details as to the progress of State funding for academies. The State investment is funding the appointment of an academy director and a director of coaching at each of the LOI clubs, and the FAI are pre-vetting candidates by creating a panel of eligible contenders for the roles from which clubs will then be able to hire. The FAI have received more than 220 applications across both roles, and anticipate more to arrive before Friday’s deadline. The FAI will then select candidates to interview, with the hope of completing the full panel of candidates by the end of February.\nThe State-funded salary for the academy director role is €43,500 per annum, with €38,500 the equivalent salary for the head of coaching role. Each selected candidate must be given a minimum three-year contract, and will be forbidden from any first-team involvement.\nFive clubs – Sligo Rovers, Cork City, Shelbourne, Galway United, and Pat’s – currently employ a full-time academy director, and if they wish to avail of the State funding, they must direct the State money toward paying the academy director salary while funnelling excess money into the creation of another job at the academy. Clubs are free to top-up the State-paid salaries if they so wish, but they cannot use the money to relieve their own budgets in any way.\nFinally, Scanlon says the FAI are granting a measure of leeway to any recently signed or renewed player whose agent is not officially registered by the FAI. While Fifa have recently introduced exams to regulate the agent industry, the FAI have another layer of paperwork for any agent wishing to work in their jurisdiction, mandating Garda vetting to ensure they are qualified to represent minors.\nUnder the FAI’s rules, the relevant agent must be registered with them to validate a player’s contract renewal at a LOI club or a transfer from one LOI club to another. (In areas in which a player is transferred from another country to the LOI, it is sufficient for the agent in question solely to be registered in the country from which the player is arriving.)\nThe FAI’s imposition of these rules ahead of the 2026 season has led to a scenario in which several players represented by Fifa-qualified agents who have not yet been registered with the FAI have not been officially registered with their clubs ahead of the new season.\nThe FAI have decided to show some latitude, however, and will register any player on the proviso their agents begin their registration process, given Garda vetting can take between four and six weeks.",
  "word_count": 1320,
  "scraped_at": "2026-02-14T12:51:29.846698"
}