{
  "article_id": "c476feecd458",
  "url": "https://www.mirror.co.uk/gaming/ea-fc-24-review-gameplay-30995867",
  "title": "EA FC 24 review – best gameplay in years and vital mode upgrades kick off EA new series",
  "date": "20230922T164500Z",
  "domain": "mirror.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "EA FC 24 review – best gameplay in years and vital mode upgrades kick off EA's new series\nUltimate Team feels better than ever in EA FC 24, whilst more care and attention has been put into less popular game modes, although Career Mode continues to disappoint.\nEA FC 24 is finally here. This is the first instalment of the new EA Sports FC series and EA's first football game without FIFA branding. No pressure then.\nAfter months of anticipation, EA FC 24 has finally been released, with players who pre-ordered the Ultimate Edition and EA Play members able to access the full game today through early access. Players have been able to access limited features in EA FC 24 Ultimate Team over the last few days through the Web App and Companion App, but with the full game now live, this is where the excitement really begins.\nEA is under pressure to produce a good game, with EA FC 24 being the first time in 30 years in which the publisher has not been associated with the iconic FIFA branding, following a split between the two after 30 years of partnership. Now going solo, EA has the chance to claim the football gaming market as its own, though if the game falls flat of expectations, it leaves the door open for future competitors.\nIn the build-up to EA FC 24's release, EA has made some big claims about new features, with new additions in Ultimate Team, crossplay being added to Clubs (finally), and some gameplay updates. And, largely, it has delivered.\nEA FC 24 review – the most realistic football game ever?\nGameplay\nOne of the biggest new features for EA FC 24 was HyperMotion V, a feature which EA boasted about the most prior to launch and let me tell you, the upgrade from HyperMotion 2.0 in FIFA 23 to HyperMotion V in FC 24 is clear as day. I've played over 30 games of EA FC 24, using a one-and-a-half-star Cheltenham Town team to five-star Liverpool, and it really feels like a game where the better player will win.\nThe gameplay feels ultra-realistic across Ultimate Team, Career Mode, Clubs and Kick-Off, the four modes I've used the most so far. EA has used new HyperMotion technology using volumetric data from more than 180 professional men’s and women’s football matches to influence player movements in-game, a big upgrade on the two matches recorded for HyperMotion 2.0 in FIFA 23.\nHyperMotion V has helped introduce a bunch of new features into the game such as precision passing, effort dribble touch and responsive shooting. After playing the Alpha version of EA FC 24 at the launch event in Amsterdam, it feels like responsive shooting isn't as impactful as originally set to be, but instead, precision passing looks to be taking control as the most overpowered gameplay feature.\nThe likes of Kevin De Bruyne, Thiago and other midfielders with high passing stats felt almost unstoppable when feeding the ball to a fast striker, and this is easily my prediction for the first feature to be patched for being too overpowered at the beginning of the game.\nEA has replaced traits in EA FC 24 with PlayStyles and PlayStyles+, and there are some PlayStyles in particular that really make a difference to the gameplay. The Quick Step PlayStyle really adds an extra spring to a player's step to give them a fantastic boost of pace, Power Shot almost made some efforts on goal unstoppable at times, and Trickster was by far the most fun to use, adding an extra layer of flair to the likes of Vinicius Junior and Neymar.\nGoalkeepers in FIFA 23 were super annoying but in EA FC 24, the quality of goalkeepers seems less of a differentiator than in previous years. More often than not, 'keepers won't save one-on-ones and bail out a player for poor defending, but I'm glad it's this way. After working hard to break down a defence in FIFA 23, it was often frustrating when the goalie seemed to bail out bad defending and save pretty much everything.\nAcceleRATE 2.0 has also been introduced with four new AcceleRATE types added to take the total to seven, but unlike FIFA 23 where lengthy players took the crown, explosive players feel the best. An example I can use is Manchester City's Jeremy Doku. From a standing position, the winger was able to skip away from a defender with a controlled or lengthy acceleRATE type by some distance, which is more true to real life.\nShooting animations have improved tremendously too, whilst the responsiveness of players feels much faster. Big defensive players seem to block shots more often than not, which has made long-range shooting difficult (and again, more true to life), and pace really does feel like it has a bigger gap than ever before. Although, we do say that every year until the first few patches, so this is something to keep an eye on.\nSet pieces have been slightly redesigned too to give you more of an accurate idea of where the ball will end up, and a new upgrade I absolutely love is to the 1-star skill move, First Time Feint Turn. When you complete this skill move with higher-skilled players, the animation is really smooth and has proven effective during my time playing the game.\nMode Updates\nLet's start with the most popular game mode, shall we? Ultimate Team players, have I got good news for you! It feels like EA has really listened to, and valued, community feedback, and this has led to the mode feeling more fun overall.\nWhen you first enter the mode, the biggest change you notice visually is the menus. I'll admit that this new look for the UT menus took a little time to get used to, but for all you menu surfers out there, the menu in EA FC 24 is way easier to navigate than FIFA 23.\nThe big addition that EA teased was Evolutions, and from what I've seen so far, this is the best update made to Ultimate Team in years, and it's maybe even one of the best features ever. The ability to upgrade players who wouldn't usually get a look-in to my squad and turn them into players who suit my team is fantastic, what isn't there to love?\nOne of the Evolution pathways available at the beginning of the game is called Golden Glow Up, and this allows you to upgrade a bronze midfielder to gold, just by completing a few objectives. It's a really creative and fun way to play the game, but I do not like EA charging 1,000 FC Points or 50,000 Coins for certain Evolutions, which verges into pay-to-win territory.\nStadium customisation is as easy as ever with the ability to assign items as soon as you earn them, whilst the new claim all objective feature does make life easy at the beginning of the game when you seem to be completing objectives for completing the simplest of tasks. Women's players are now in Ultimate Team, and this has made the pool of players even better than before, whilst also improving the options when building a squad.\nClubs, previously known as Pro Clubs, has received the biggest update in years for EA FC 24, with the fan-favourite game mode finally having crossplay implemented into the game. Many fans were left angry after Clubs didn't get crossplay in FIFA 23, but the most social game mode in EA FC 24 finally has it.\nIf EA can keep technical issues to a minimum this year, Clubs should be a really successful mode for EA in EA FC 24, especially with the new league system that's scrapped relegation and follows a similar format to Division Rivals in Ultimate Team. As well as Clubs, Co-op Seasons, Volta and all Co-op modes in Ultimate Team have also been granted crossplay privileges in the new game.\nLastly, EA made some big promises for Career Mode in EA FC 24, for both manager and player. Like most new Manager Career Mode saves, it started off pretty enjoyable. The new tactical vision feature was a great addition, but I would've liked some more customisation options when adjusting your tactics, and the new tactical view was underwhelming, to say the least.\nAs we saw in the Career Mode trailer, the camera angle behind the manager was not great. You couldn't see half of the game, and it got boring. As for the rest of Manager Mode, it was pretty much copy and paste from last year, and even previous FIFA titles. The transfers, contract negotiations and menus were all the same, and once the transfer window closed, there was nothing new to get excited about.\nPlayer Career Mode felt much better than it did in FIFA 23 though. The introduction of player agents has added more realism, whilst it also makes controlling a player so much more fun. Now, you can set yourself goals to work your way to your dream club with the help of your agent, rather than just leaving your future in the hands of the algorithm.\nEA FC 24 verdict\nEA FC 24 is a breath of fresh air for football games. The pressure was on EA to start strongly after its divorce from FIFA, and it has done just that, more than likely cementing the EA Sports FC series as the best football game for years to come.\nNot only has the title got a refreshing new look to match the new name, but EA FC 24's HyperMotion V technology has created the best and most realistic gameplay we've seen in a long time. The publisher has listened to the community about what went wrong in FIFA 23, and what they wanted to see in EA FC 24, and it has largely met those demands.\nThe top-tier authentication we associate with EA has remained too, whilst the addition of women's football is much-needed is well-implemented. Ultimate Team will be a huge success for EA once again in FC 24, and we can only hope it will cut out the countless content errors we saw each week last year, with Clubs also looking rejuvenated with the addition of crossplay.\nCareer Mode is once again, undercooked, but bar that, I think EA FC 24 is the best football game EA has released in a long time, and it sets the bar high for any future competitors.\nEA FC 24 review score: 4/5",
  "word_count": 1751,
  "scraped_at": "2026-02-14T12:39:49.771653"
}