{
  "article_id": "c478e85933f0",
  "url": "https://freerepublic.com/tag/*/index?more=4138943",
  "title": "Latest Articles",
  "date": "20230318T023000Z",
  "domain": "freerepublic.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Search:\nKeywords\nUsers\nTitles\nYahoo\nHome·\nSettings·\nBreaking ·\nFrontPage ·\nExtended ·\nEditorial ·\nActivism ·\nNews\nPrayer PrayerRequest SCOTUS ProLife BangList Aliens HomosexualAgenda GlobalWarming Corruption Taxes Congress Fraud MediaBias GovtAbuse Tyranny Obama Biden Elections POLLS Debates TRUMP TalkRadio FreeperBookClub HTMLSandbox FReeperEd FReepathon CopyrightList Copyright/DMCA Notice\nMonthly Donors · Dollar-a-Day Donors · 300 Club Donors\nor by or by mail to: Free Republic, LLC - PO Box 9771 - Fresno, CA 93794\n-\nPentagon working on trans agenda for military kids worldwide\nDepartment of Defense (DOD) medical providers in Europe are stepping up efforts to identify civilian providers of hormone therapy and other sex-change treatments for the children of U.S. military personnel stationed abroad, Stars and Stripes reported Wednesday.DOD has only one physician stationed on the continent who specializes in transgender treatments for minors, leading to a recent decision to discontinue medical treatment and counseling for new patients, Stars and Stripes reported, citing military health officials. Providers at U.S. military medical facilities in Europe have increased referrals to local health care facilities and are looking for more that will accept the Pentagon’s... -\nIs it time to stop dyeing the Chicago River green for St. Patrick's Day?\nThe sharpest opinions on the debate from around the webMarch is often a green-filled month, as St. Patrick's Day traditions abound while Ireland's national festival is celebrated around the world. One longstanding ceremony is the dyeing of the Chicago River, when artificial coloring is used to turn the water an emerald green during the week leading up to St. Patrick's Day. The event is a cultural milestone in the city of Chicago, with thousands lining the river every year to catch a glimpse of the green hues in action. Chicago's Irish heritage often looms large during the holiday, with Block... -\nSt. Patrick's Day Jokes\nWhy is Ireland a wealthy country? Because its capital is always Dublin. Why is cubic zirconium hte perfect thing for St. Patrick's Day? Because it's a sham rock. -\n70% of Japan Flight Attendants Report Photos Taken of Them Secretly\nAround 70 percent of flight attendants in Japan have reported that photos had been or likely had been taken of them surreptitiously, an aviation trade union said Thursday, calling for tougher penalties against the act. Thirty-eight percent of respondents said their pictures had been secretly taken, while 33 percent said they were not sure but \"believe\" it has happened, with the combined result rising 9 percentage points from the previous survey in 2019, according to the Japan Federation of Aviation Industry Unions. While most cabin crew reported face and full body pictures had been taken, others replied that they were... -\nFamily Member of Jan. 6 Probe Victim Who Committed Suicide: Florida Gov. Ron DeSantis Wants ‘Nothing to Do’ with Jan. 6 Whistleblowers, ‘Ignores’ All Our Calls\nA close family member of a victim who committed suicide under duress caused by the illegal and unconstitutional Jan. 6 probe is speaking out on the cold and callous behavior of Florida Governor Ron DeSantis.Matthew Perna committed suicide in March 2022 after being hit with a multitude of charges for peacefully protesting in and around the U.S. Capitol on Jan. 6. His aunt, Geni Perna stated in a recent interview that DeSantis ignores all of the calls from Jan. 6 whistleblowers who are speaking out against the injustices that are being perpetrated upon pro-MAGA patriots by the federal government.“Ron DeSantis... -\nFEATURE: UFO Sightings Putting Rural Japan Community on Intergalactic Map\nA tiny rural community in northeastern Japan known for numerous UFO sightings is promoting itself as a \"home to aliens\" in a bid to revitalize its local economy and put itself on the intergalactic map. By displaying its many pieces of UFO paraphernalia and holding events that appeal to enthusiasts, Iinomachi, once prosperous through silk production and weaving industries, hopes to build a new future by drawing visitors with a passion for the extraterrestrial. Photo taken on Jan. 20, 2023 shows a statue resembling an alien in Iinomachi district in Fukushima, northeastern Japan. (Kyodo) Residents believe they live in a... -\nMajor Japanese Firms Offer Biggest Pay Hikes in Decades Amid Inflation\nMajor Japanese corporations including Nissan Motor Co. and Hitachi Ltd. on Wednesday agreed on their biggest pay raises in decades in annual wage negotiations after their labor unions requested wage hikes that match rising prices. Nissan said it will increase monthly wages by 12,000 yen ($89) on average, the largest hike since fiscal 2004 when the current wage system was introduced. It will also offer annual bonuses worth 5.5 months' salary as per its union's request. An official of the Japan Council of Metalworkers' Unions writes down offers received by member labor unions from management during annual wage negotiations on... -\nFox News: DA is preparing to arrest Donald Trump and charge him with a Felony\nFox News reports that New York City D.A. Alvin Bragg is preparing to arrest Donald Trump complete with fingerprinting and “normal processing” all under a felony charge federal prosecutors refused to pursue. -\nKiss my a$$: Credit Suisse wife Lizzie Asher flashes butt amid $54B bailout\nAn insider sniped to Page Six Friday that while Credit Suisse put out its begging bowl for a $54 billion bailout on Thursday, the wife of top CS exec Daniel Ezra was “going wild” at the Art Production Fund Gala in NYC that very evening. Philanthropist Lizzie da Trindade-Asher was snapped by fashion industry bible Women’s Wear Daily cheekily flashing her butt for the camera. Our banking insider interpreted the gesture for those of us who didn’t go to Wharton: Looming global financial catastrophe threatening to upend the lives of ordinary people everywhere? Kiss my ass. Ezra is a managing... -\nBattle for Bakhmut grinds down Wagner’s mercenaries and cuts their notorious leader down to size\nYevgeny Prigozhin, the combative boss of Russia’s Wagner private military group, relishes his role as an anti-establishment maverick, but signs are growing that the Moscow establishment now has him pinned down and gasping for breath. Prigozhin placed a bet on his mercenaries raising the Russian flag in the eastern Ukrainian city of Bakhmut, albeit at a considerable cost to the ranks of his force and probably to his own fortune. He spent heavily on recruiting as many as 40,000 prisoners to throw into the fight, but after months of grinding battle and staggering losses he is struggling to replenish Wagner’s... -\nDementia Risk Higher for Elite Soccer Players\nDementia Risk Higher for Elite Soccer Players — Is heading the ball to blame? by Judy George, Deputy Managing Editor, MedPage Today March 16, 2023 Share on Facebook. Opens in a new tab or window Share on Twitter. Opens in a new tab or window Share on LinkedIn. Opens in a new tab or window email article A photo of a header by Dayot Upamecano of France above Mitchell Duke of Australia during the 2022 FIFA World Cup Men who played elite soccer were more likely to develop neurodegenerative diseases -- notably, dementia -- as they aged, a study in... -\nSo this is the head of global markets at Credit Suisse, which just got bailed out by the Swiss central bank (Pips Bunce)\nCredit Suisse, the global investment bank based in Switzerland, would be six feet under today if not for the $54 billion bailout it just got from the Swiss central bank. I'm starting to see a pattern in these failing banks… see tweet https://twitter.com/JordanSchachtel/status/1636353368644886528? -\nFurious pro-trans protesters line up to condemn Florida's proposed ban on sex changes for children, including blue haired woman who INJECTS herself at lectern\nA transgender protester injected herself to gasps during a meeting where she and others opposed plans to ban so-called gender affirming care for children. The unnamed woman, who had blue hair and horn-rimmed glasses, declared: 'I was once a trans youth, and now I'm a happy 22-year-old trans adult... this is my healthcare, don't tread on it.' She proudly produced the syringe, then stuck the needle into her arm and pushed the plunger, to an audible gasp from an unseen eyewitness at the hearing in Tallahassee earlier this week. It's unclear what was in the syringe, although many transgender people... -\nUpdate from Ukraine | The beginning of the end for the Ruzzian dictator | Arrest warrant for Putler\nUpdate from Ukraine | The beginning of the end for the Ruzzian dictator | Arrest warrant for Putler https://www.youtube.com/watch?v=Cwh1m_SWFqk -\nBrothers Paid by Jussie Smollett to Instigate 2019 Hoax Apologize to Country, Didn't 'Foresee' Ramifications\nSmollett was sentenced to 150 days in jail plus probationThe two brothers who were paid by actor Jussie Smollett to orchestrate a fake hate crime had a message for the country about its \"ramifications.\" Abimbola and Olabinjo Osundairo, nicknamed Bola and Ola, apologized for their role in the 2019 hoax, saying they agreed to Smollett’s terms because they wanted to use his connections as a prominent actor to help them in their own careers. \"I just first want to apologize to everyone in the audience, the country and anyone who might have been affected by this directly. When we were... -\nDNC, Joe Biden Will Return Campaign Donations Tied to SVB\nThe Democratic National Committee (DNC) and President Joe Biden’s presidential campaign stated they would return political donations tied to the collapsed Silicon Valley Bank on Friday, according to USA Today. The DNC told the publication that the money would be returned following last week’s bank collapse. The announcement was made the same day the bank’s parent company, SVB Financial Group, filed for Chapter 11 protection in New York bankruptcy court. -\nLynyrd Skynyrd - \"Gimme Back My Bullets\" (1976)\nGimme Back My Bullets is the fourth studio album by American Southern rock band Lynyrd Skynyrd, released on February 2, 1976. Lynyrd Skynyrd - \"Gimme Back My Bullets\" (1976) -\nRCP’s Tom Bevan screenshots MSNBC’s current homepage priorities (‘memo went out’!)\nThere’s a lot going on in the world, from collapsing banks to inflation to the war in Ukraine to the mess at the southern border. With all that in mind Real Clear Politics’ Tom Bevan took a look at MSNBC’s homepage today and categorized the headlines. You probably won’t be shocked:Tom Bevan @TomBevanRCP Headlines on the MSNBC home page right now: 11 mentioning Trump 3 Mike Pence 2 Fox News 2 Tucker Carlson 1 Ron DeSantis 1 George Santos 1 Alex Jones 1 Silicon Valley BankIt’s almost as if MSNBC meets every morning and says “what on our homepage will... -\n‘Unlikely’ Donald Trump will gain new voters with YouTube account reinstated (right ...)\nRepublican Strategist John Jordan says it is unlikely former US president Donald Trump will gain new voters with his YouTube account being reinstated. “Most people are already aware of President Trump and what he says and what he thinks so it’s unlikely that he’s going to win new converts or really move his numbers,” he told Sky News Australia. However, having the YouTube account does allow Mr Trump to react to stories, potentially “shape ... -\nBiden jokes he’s ‘really not Irish’ because he’s sober, doesn’t have relatives ‘in jail’\nPresident Biden told a series of cringe-worthy jokes about his Irish ancestry to mark St. Patrick’s Day, cracking that he’s surprised his distant Irish relatives aren’t “in jail” and that he’s “really not Irish” because he doesn’t drink alcohol. The 80-year-old president, who is roughly five-eighths Irish, made the seemingly stereotype-laden attempts at humor*** “I’ve been to Ireland many times, but not to actually look up, to find my actual family members. And there are so many — and they actually weren’t in jail,” Biden said to scattered laughs as he recalled a six-day visit in which he met his...\nBrowse by Forum\nGet Connected! Join Free Republic Today!\nAlready a Member? Log into your Free Republic account.\nBreaking News (News/Activism)\n- Dear FRiends, our FReepathon has fallen way behind. Please get your donations in as soon as you can. Thank you and God bless.\n- Sunday Morning Talk Show Thread 8 February 2026\n- The MAGA/America 1st Memorandum ~~ February 2026 Edition\n- Senate strikes deal to avert partial shutdown\n- US Border agents shoot two people in Portland, city officials say\n- Minnesota Gov Tim Walz to suspend re-election campaign amid Somali fraud scandal: report\n- One in custody after incident at Ohio home of JD Vance\n- Caracas, VenezuelaJanuary 3, 2026 6:30 AMUpdated: January 3, 2026 1:12 PMU.S. captures Venezuela's leader and his wife in a stunning operation and plans to prosecute them\n- President Trump says Maduro and his wife have been captured. A news conference will be held at 11 A.M\n- The MAGA/America 1st Memorandum ~~ January 2026 Edition\n- More ...\nFront Page News (News/Activism)\n- 'You exposed him to real danger': Father goes nuclear on school board after teachers sent his son to ICE protest\n- House passes SAVE America Act, sending Trump-backed election bill to the Senate\n- Trump set to gut US climate change policy and environmental regulations: White House official\n- Less than 14% of those arrested by ICE in Trump's 1st year back in office had violent criminal records, document shows\n- Lawler: ‘Not Realistic’ to Kick Out Over 25 Million Undocumented People\n- Fact Sheet: President Donald J. Trump Ensures Affordable Beef for the American Consumer\n- Democrats fear body cameras could be ICE’s new mass surveillance tool\n- Migrant, 70, who told girl, 12, to 'cover her head' before sexually assaulting her on way home from school is spared jail\n- Associated Press Complains That Winter Olympics Teams Are ‘Overwhelmingly White’\n- Appeals court sides with Trump admin with mass detention ruling\n- More ...",
  "word_count": 2289,
  "scraped_at": "2026-02-14T12:13:41.697945"
}