{
  "article_id": "c48ba530360d",
  "url": "https://www.independent.co.uk/life-style/taylor-swift-travis-kelce-super-bowl-proposal-engaged-b2691966.html",
  "title": "Travis Kelce has coy response about proposing to Taylor Swift at the Super Bowl",
  "date": "20250204T161500Z",
  "domain": "independent.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Travis Kelce’s coy response about proposing to Taylor Swift\nThe Chiefs tight end and pop star have been dating since 2023\n- Bookmark\n- CommentsGo to comments\nTravis Kelce responded coyly when asked about his plans to propose to his girlfriend Taylor Swift at the Super Bowl.\nThe Kansas City Chiefs tight end discussed his relationship with the pop icon, who he’s been dating for more than a year, during a press conference in New Orleans on Monday (February 3).\nWhen a reporter asked him if he planned on getting engaged during the Super Bowl, Kelce replied: “Wouldn’t you like to know?”\nWhen asked specifically if he planned to give Swift a ring on Sunday (February 8) — when the Chiefs take on the Philadelphia Eagles in the Super Bowl — he changed the subject again.\n“A Super Bowl ring? Next question,” he responded.\nHowever, Kelce did share how the “All Too Well” singer’s work ethic and success keeps him motivated on the field.\n“I better hold up my end of the bargain,” he said. “If she’s out here being the superstar she is, never taking no for an answer, and always working her tail off, I better match that energy for sure.”\nOn Sunday, the Chiefs will face off against the Eagles in the championship game for the second time in the last two years. In addition, Kelce and the Chiefs have the chance to make NFL history if they secure the title for the third year in a row.\nDuring the AFC Championship — which secured the Chiefs spot in the Super Bowl — on January 26, Swift made her way down to the field to congratulate her boyfriend on his win.\n“I love you so much,” the “Blank Space” singer said to Kelce while giving him a big hug. “I’m so proud of you, I can’t stand it. Look what you did!”\nThe sweet on-field moment came amid rampant speculation that Kelce may propose at the 2025 Super Bowl. In the last few weeks, Swift has been spotted out wearing a diamond infinity ring that fans are convinced is a promise and pre-engagement ring.\nWhile neither Kelce or Swift have addressed the topic, the NFL star recently dished about the one time of year he would never want to get married.\n“I’ve seen weddings in f**king February. I’ve seen weddings everywhere but the fall. So I’m not sure if the fall was a good wedding season,” he said during a January 8 episode of his and his brother Jason Kelce’s New Heights podcast.\nLast month, the tight end also spoke to sports journalist Stephen A. Smith about ending his NFL career one day, admitting that his opinion about retirement “changes every single day.”\n“I love everything that I’m doing in this building, but at the end of the day I’m not having that extreme success on the field as I have individually,” he said. “I’ll reevaluate it like I always do, and I’ll probably tell myself how much I love this thing and I’ll come back next year.”\nStill, he also made it clear that Swift — who’s attended more than a dozen of his games since they started dating — has never pressured him into retiring.\n“She’s fully encouraging me to enjoy playing this game,” he said. “She loves coming to Arrowhead and coming to the games and cheering for me so I got all the support in the world to keep chasing these dreams.”\nDuring Monday’s press conference in New Orleans, Kelce clarified that he wants to keep playing football for several years.\n“Hopefully still playing football,\" he said when asked what he hoped to be doing in three years’ time. \"I love doing this, I love coming into work every day. I feel like I still have a lot of good football left in me. We'll see what happens. I know I've been setting myself up for other opportunities in my life. That's always been the goal knowing football only lasts for so long.”\nJoin our commenting forum\nJoin thought-provoking conversations, follow other Independent readers and see their replies\nComments",
  "word_count": 686,
  "scraped_at": "2026-02-14T14:16:01.210240"
}