{
  "article_id": "c48d6b6f190e",
  "url": "https://www.dailymail.co.uk/news/article-14796945/The-EU-flooded-Europe-migrants-cities-peaceful-citizens-risk-Marine-Le-Pen-Viktor-Orban-tell-anti-immigration-rally.html",
  "title": "The EU  flooded Europe with migrant who put  our cities and peaceful citizen at risk , Marine Le Pen and Viktor Orban tell anti - immigration rally",
  "date": "20250610T091500Z",
  "domain": "dailymail.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "The EU 'flooded Europe with migrants' who put 'our cities and peaceful citizens' at risk, Marine Le Pen and Viktor Orban tell anti-immigration rally\nFrench hard-right leader Marine Le Pen and Hungarian leader Viktor Orban have accused the European Union of flooding the continent with migrants who have 'destroy[ed] our cities... [and] kill[ed] peaceful citizens.'\nSpeaking at a rally in France on Monday, the pair launched scathing attacks on the EU and accused Brussels of denying 'states of their most sacred right, that of deciding who enters and who remains on their soil.'\nAimed at marking one year since Le Pen's National Rally (RN) crushed opponents to win their best-ever vote share in European elections, the get-together in Mormant-sur-Vernisson south of Paris brought together hard-right leaders from across Europe.\nThe mood was buoyant and confident in the wake of Donald Trump's return to the White House earlier this year and strong election results across the continent.\nOrban, revelling in his self-proclaimed status as the 'black sheep of the EU' and 'Brussels' nightmare', likened European migration policy to 'an organised exchange of populations to replace the cultural base' of the continent.\nBoasting of having been able to 'push back migrants' in his country, even if it meant incurring sanctions from Brussels, Orban told the several thousands present: 'We will not let them destroy our cities, rape our girls and women, kill peaceful citizens.'\nLe Pen, in her speech, described the European Union as a 'graveyard of politically unfulfilled promises' and termed it 'woke and ultra-liberal'.\n'We don't want to leave the table. We want to finish the game and win, to take power in France and in Europe and give it back to the people,' she said.\nFrench hard-right leader Marine Le Pen and Hungarian leader Viktor Orban (both pictured) have accused the European Union of flooding the continent with migrants\nA trash can is set on fire as Paris Saint-Germain supporters celebrate after PSG won the UEFA Champions League final football match between Paris Saint-Germain (PSG) and Inter Milan held in Munich, on the Champs-Elysees avenue in Paris on May 31, 2025.\nPeople thought to be migrants scramble onboard a small boat leaving the beach at Gravelines, France, in an attempt to reach the UK by crossing the English Channel. Picture date: Saturday May 31, 2025\nHer party previously backed France's exit from the EU. But now it preaches European reform while remaining a member as Le Pen seeks to make the party electable and shake off the legacy of her late father Jean-Marie Le Pen.\nOther attendees included Italy's Deputy Prime Minister and leader of the League party Matteo Salvini, the leader of Spain's Vox party Santiago Abascal and former Czech premier Andrej Babis.\nThey are all part of the Patriots for Europe faction in the European parliament, one of no less than three competing hard-right factions in the chamber.\nSalvini meanwhile described migration as a 'threat' to Europe.\n'The threat to our children is an invasion of illegal immigrants, mainly Islamists, financed and organised in the silence of Brussels,' he affirmed from the podium, calling on European 'patriots' to 'work together' to 'take back control of the destiny and future of Europe.'\nIn a sign of the controversy over the meeting, some 4,000 people from the left, hard left and trade unions protested in the nearby town of Montargis, according to organisers, vowing to 'build resistance' and proclaiming the hard-right leaders were 'not welcome'.\n'You have here the worst of the racist and xenophobic European hard right that we know only too well,' said French hard-left MEP Manon Aubry.\nThe meeting also comes less than two years ahead of watershed presidential elections in France where President Emmanuel Macron, who has long promoted himself as a bulwark against the hard right, cannot stand again and the RN sees its best ever chance of taking power.\nBut it is far from certain if Le Pen will stand for a fourth time as her conviction earlier this year in a fake jobs scandal disqualifies her from standing from public office.\nShe has appealed. But waiting in the wings is her protégé and RN party leader Jordan Bardella, 29, who would stand if Le Pen was ineligible.\nBardella, who polls have shown would still be set to win the first round of presidential elections if he stands, is taking care to project his image including a long TV interview with star anchor Karine Le Marchand aimed at showing his softer side.\nViktor Orban, Prime Minister of Hungary and President of Fidesz attends the Victory Day rally organized by the European nationalist and far-right political party Patriotes.eu in Mormant-sur-Vernisson, France, 09 June 2025\nA man coming from the Loiret region waves a French flag giving his support to French President of Rassemblement National parliamentary group Marine Le Pen, as part of a meeting of the group Patriots for Europe in the European Parliament gathering European far-right leaders in Mormant-sur-Vernisson, center France, on June 9, 2025\nIt is far from certain if Le Pen will stand for a fourth time as her conviction earlier this year in a fake jobs scandal disqualifies her from standing from public office\nSpain's far-right party Vox leader Santiago Abascal and French far-right leader and member of parliament Marine Le Pen are seen on stage during the \"Fete de la Victoire\" (Victory party), an event which gather supporters and nationalist politicians from across Europe to mark a year since the EU elections, in Mormant-sur-Vernisson, in the Loiret department, France, June 9, 2025\n'We reject the Europe of Ursula von der Leyen,' Bardella told the rally, referring to the chief of the EU Commission. 'We reject the Europe of Macron... We represent the rebirth of a true Europe.'\nAs well as Le Pen's legal limbo, the contours of the French 2027 presidential election remain largely unclear, with centre-right former prime minister Edouard Philippe the only major player to clearly state he will stand.\nOrban urged the RN to emerge triumphant from the elections.\n'Without you, we will not be able to occupy Brussels... We will not be able to save Hungary from the Brussels guillotine,' said Orban.",
  "word_count": 1027,
  "scraped_at": "2026-02-14T12:49:56.351139"
}