{
  "article_id": "c4dd61c3156b",
  "url": "https://www.dailyprincetonian.com/article/2023/12/princeton-prospect-arts-glee-club-profile-princeton-music",
  "title": "Glorious music fills the air when Glee Club sings",
  "date": "20231218T063000Z",
  "domain": "dailyprincetonian.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "On the evening of Nov. 4, a deluge of paper airplanes, balloons, and Yale transfer applications were launched from every corner of the Richardson Auditorium. The items converged on the performers onstage — the Princeton Glee Club — as they sang the Princeton Football Medley. The assailants? None other than the Yale Glee Club. Meanwhile, the audience erupted in gasps and eager chatter.\nThis was the night of Princeton Glee Club’s most recent concert in collaboration with Yale University’s Glee Club. Such a scene encapsulates the vibrant, interactive energy that the Princeton Glee Club brings to the campus community with every performance.\nPrinceton University Glee Club was first established in 1874 and will be celebrating their 150th anniversary next November. The group originated as a small male group when Princeton was a male-only school. Once the University became co-educational in 1969, so did the choir. Nikki Rosengren, who served as president of the Glee Club in the very first year of co-education at Princeton, set a powerful precedent for women to have just as much of a voice and presence in the University choir.\nThe Glee Club still performs traditional Western choral music — the style they began with — but has since expanded their repertoire in the past several years, largely due to their “Presents” series. Once a semester, Glee Club invites an outstanding musical artist who will work with the choir on their style of expertise.\nSydney Eck ’24, who serves as current president of the Glee Club, said that this series “allows Glee to learn from the best of the best and immerse in diverse singing styles.”\nEck is a former head Features editor for the ‘Prince.’\nThis past fall, prolific composer and arranger Stacey Gibbs came to collaborate with the Glee Club. Gibbs is the arranger of the famous spiritual song “Sit Down Servant” originally written by The Staple Singers. This piece is an embodiment of the glory that African Americans imagine themselves experiencing in the next world, but with the underpinning of their trials and tribulations in the current realm.\n“Gibbs brought an energy and humor that was so infectious,” Glee member Evan Shidler ’27 said. “Collaborating with him was an experience I won’t forget.”\nThis upcoming February, Glee plans to collaborate with the American Spiritual Ensemble (ASE), which consists of some of the finest singers in the classical music world. With the ASE, the Glee Club will have the opportunity to learn traditional American spirituals.\n“This is perfect because it’s only suitable to learn this style from experts who have personal ties to this music,” Eck said. “Some young singers wouldn’t feel comfortable exploring this style otherwise, so it’s a golden opportunity to branch out as a musician.\"\nShidler, whose mother and uncle are Princeton Glee Club alumni (’96 and ’99 respectively), just finished his first semester as a Glee member. He provides a unique perspective to the musical group, having witnessed the Glee Club evolve over an entire decade.\n“My mom went on to become a professional opera singer with the New York City Opera,” Shidler shared. “She first encouraged me to pursue singing when she heard me singing pop songs as a child.”\nFrom his family’s musical influence, Shidler went on to sing in the MET Children’s Chorus, then the Manhattan School of Music Pre-College division. He had been sitting in the audience at Glee concerts since the age of nine, when Gabriel Crouch had already started leading the group as a director since 2010. From a young age, Shidler held Crouch and the choir with high regards.\nRather than feeling pressure from his family’s strong musical background, especially one that revolved around Princeton’s Glee Club, Shidler said he “always genuinely enjoyed the craft of voice.”\nShidler also stated that although Glee has always sounded very high-caliber, the quality of sound has improved in recent years, and he owes this change to Crouch’s leadership. “There's a certain radiancy in our group’s sound that wasn’t there in the past,” Shidler said. “Gabriel Crouch has definitely transformed the Glee Club into a venerable institution.”\nThe Princeton Glee Club shines not only because of their high standards of music-making, but also due to a uniquely strong sense of culture and Glee pride. Eck noted that an integral part of the Glee Club’s spirit stems from their preserved tradition of rivalry against other Ivy Leagues. Glee Club serves as a traditional ambassador and flagship musical ensemble for the University. This is especially prominent at football games, where the Glee Clubs ramp up University pride by singing traditional football songs, including the infamous “Fight Song.”\n“Out of the sports rivalry was born this wonderful musical tradition,” Eck said. Outside of football games, Princeton, Harvard, and Yale take turns visiting one another’s campuses annually to collaborate in concerts. For example, this past November, Yale came to Princeton’s campus to perform in Princeton’s Glee Concert, while our Glee Club joined Harvard for their Glee Concert. The weekend-long collaboration allows the Glee Clubs to sing together, hear each other’s repertoire, have dinner together, and spend the night at each other’s schools. Although the friendly rivalry is still not forgotten — “it’s a tradition to throw objects at rival Glee Clubs,” Eck said — the activity is effective in fostering community across these rival schools.\nGlee also makes members feel at home with their tight intergroup community. As many clubs do, Glee implements a big-and-little system where new members from each semester are paired with a veteran Glee member. Or, in Glee lingo: the Glig-and-Glittle system. Caitlin Hodge ’27 stated that having a strongly emphasized big-little community has made her feel supported and cared for.\n“I was actually abandoned, or ‘Glorphaned,’ because my initially assigned Glig was having a very busy semester and understandably couldn’t devote too much time to Glee,” Hodge said. “But another upperclassman immediately took me under her wing, and I was ‘Gladopted.’ Glee has this implicit no-member-left-behind mentality that I really cherish.”\nBecause Glee’s upperclassmen community cares deeply about guiding and spending time with younger members, they have created their very own “Gloffice Hours.” These “Gloffice Hours,” run by Glee officers (“Glofficers”), provide Glee members a space to study and snack together. Every school year, Glee also maintains an active spreadsheet containing all the classes members are taking, allowing members to easily reach out for help within the Glee community.\nParties, post-concert gatherings, Gline & Gleese Night (Glee’s wine and cheese night), and sight-singing sessions are other regular activities that keep the Glee bond alive and strong. Glee also rehearses very frequently — three times a week for two hours each, under the leadership of Crouch. The group travels together frequently for Harvard and Yale concerts or football games, and also tours internationally every other year.\nYet Glee is still continuously aiming to bolster their community. This year was its first time organizing a retreat at the beginning of the year, just after the second week of classes. The group spent the day together in the Pocono Environmental Education Center, hiking together and doing bonding exercises. Glee evidently carries a strong ambition for continuous growth and desire to uphold their past legacy.\n“Maybe it’s the club’s legacy, or its age, or just our niche lingo,” Shidler said. “But it’s very touching how it has culminated into an ever-improving, very loving family that is the Princeton Glee Club.”\nShannon Ma is a writer for The Prospect. She is in the class of 2027 and comes from Saratoga, California. She can be reached at sm2818@princeton.edu.",
  "word_count": 1256,
  "scraped_at": "2026-02-14T13:10:17.207693"
}