{
  "article_id": "c4f11f1b98b1",
  "url": "https://www.latimes.com/socal/daily-pilot/news/newsletter/2023-06-21/timesoc-latest-news-in-orange-county-newport-beach-couple-dies-baja-timesoc",
  "title": "Deaths of Newport Beach couple at Baja resort still not fully explained",
  "date": "20230621T163000Z",
  "domain": "latimes.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Deaths of Newport Beach couple at Baja resort still not fully explained\n- Share via\nGood morning. It’s Wednesday, June 21. We are Carol Cormaci and Vince Nguyen, bringing you this week’s TimesOC newsletter. Together we’ve aggregated the latest local news and events.\nWe all collectively learned last week via news reports that reverberated around the nation that two more Americans, this time Newport Beach couple John Heathco and Abby Lutz, had died of suspected carbon monoxide poisoning while vacationing in Mexico.\nThis time the tragedy unfolded at the Hyatt’s Rancho Pescadero, a boutique beachfront hotel in El Pescadero, which is about an hour north of Cabo San Lucas in Baja California Sur.\nHeathco and Lutz, according to the initial Associated Press report we saw last Wednesday, were found dead in their hotel room the night before, several hours after they’d both apparently succumbed.\n“We are shocked and saddened to hear about the passing of our beloved Abby,” Lutz’s family said Thursday in a statement. “Abby had an adventurous spirit and a wonderfully kind heart. She loved to travel, see new places, and share her zeal for life with those around her.”\nThe shocking news of a vacation gone devastatingly wrong was reported so widely that we won’t go into all of the details in this newsletter, but readers should know that employees at the resort said there had been warnings of gas leaks there dating back months, and alarms intended to alert guests of such leaks had been disarmed because they’d been sounding off regularly, resulting in excessive noise complaints. Late last week, dozens of employees staged a protest.\nThe most recently updated Los Angeles Times report on the incident written by reporters Kate Linthicum and Alexandra E. Petri reported that the distraught workers participating in the protest “detailed a history of complaints to hotel managers over what they described as wage theft as well as safety conditions for employees, including fears over gas leaks.\n“One of the employees who spoke on condition of anonymity said workers were worried about a possible explosion given the frequent odor of gas,” according to the story.\n“We are indignant that we reported this, and this tragedy still happened,” the employee said.\nThe L.A. Times report also includes a statement released by Hyatt late Friday that said the company is “deeply troubled by the recent allegations and speculation about the tragic isolated incident at Rancho Pescadero.\n“Authorities have not yet released the cause of this incident, and the hotel continues to cooperate on their investigation to understand a cause,” the statement said. “We understand authorities immediately tested the air quality in the room after responding to the situation, and at the time, did not report any findings of gas or carbon monoxide and advised that the hotel was cleared to continue normal operations. The hotel continues to monitor air quality.”\nThe company’s statement flies in the face of comments made by one of the paramedics called to the scene on the day of the deaths, who told Good Morning America in an interview that he and his partner experienced dizziness on entering the chamber where Heathco and Lutz were found.\n“We went out of the room as soon as possible,” said the paramedic, Fernando Valencia, who added he had wondered if he and his partner would survive the experience.\nLutz’s family set up a GoFundMe fundraising page to collect donations toward transporting her home to Orange County from Mexico and for funeral expenses. As of last night more than $36,000 had been raised.\nMORE NEWS\n• Huntington Beach City Council vs. its own public library system: Last night, after our newsletter deadline, the Huntington Beach City Council was expected to consider its most recent conservative agenda item: a proposal by Mayor Pro Tem Gracey Van Der Mark for the city to devise a process by which books she describes as “obscene” and available to minors can be banned from its public library system. Van Der Mark’s agenda item, to the additional dismay of the Friends of the Huntington Beach Public Library, also sought to create new protocols for books or other content yet to be acquired by the public library that are intended for children to be screened for obscenity and/or pornography. We’ll let you know next week how the vote comes out. Or, if you are a Los Angeles Times subscriber, you can visit the Daily Pilot website later this afternoon for a look at reporter Matt Szabo’s coverage of last night’s meeting.\n• Republican House Speaker Kevin McCarthy met with officials to discuss home-invasion burglaries allegedly committed by Chilean crime rings in the county on Friday. “There’s no consequences for these people when they get caught,” McCarthy said during a news conference at the Orange County district attorney’s office, where he was joined by several Republican members of Congress from Southern California, including Reps. Michelle Steel of Seal Beach. His rare appearance outside of his Bakersfield district concluded with a high-dollar fundraiser at the exclusive Pacific Club in Newport Beach.\n• The Southern Baptist Convention rejected appeals from Saddleback Church, voting to finalize the ouster of the Orange County megachurch over its female pastors. Saddleback Church, based in Lake Forest with locations in Newport Beach and Irvine, is one of the largest congregations in the U.S. and had been the second-largest in the Southern Baptist Convention.\n• People living near Edison High School found antisemitic, anti-LGBTQ+ fliers last Wednesday, the morning after controversy surrounding a student-produced video promoting Pride month stirred debate at a school board meeting. Huntington Beach Mayor Tony Strickland called the messages “completely unacceptable.” Last night, H.B. City Council members Dan Kalmick, Rhonda Bolton and Natalie Moser submitted a recommendation for a resolution for the city to condemn “antisemitism, white supremacy and anti-LGBTQ hate.”\n• After 30 years of running the Orange County Rescue Mission, one of the largest nonprofit homeless service providers in the county, Jim Palmer has stepped down as president and chief executive officer. The longtime advocate for homeless people, 58, told the Los Angeles Times that his resignation was due to health reasons.\nPUBLIC SAFETY AND COURTS\n• Two Orange County men — including a U.S. Marine stationed at Camp Pendleton — were arrested June 14 on federal charges of firebombing a Planned Parenthood clinic in Costa Mesa last year. The clinic “was forced to close and cancel dozens of appointments,” FBI officials said.\n• Two Orange County sheriff’s deputies shot and killed a hatchet-wielding man they suspected was breaking into a home in Midway City on June 14, authorities said. The Sheriff’s Department did not disclose any other details, including the age of the deceased, his actions or that of deputies leading up to the incident or the number of shots fired.\n• A 42-year-old man was sentenced Friday to 410 years to life in prison for opening fire on a pickup full of six men in a road-rage dispute in Costa Mesa on Thanksgiving Day that killed one and wounded four. Lee Queuon Walker was convicted of fatally shooting 30-year-old Lucas Rivera-Velasco of Costa Mesa on Nov. 24, 2022, at 423 W. Bay St. Also wounded in the shooting were Salvador Pulido-Nieto, Bernardo Millan-Pulido, Hugo Medina-Rivera and Gilberto Medina-Rivera, while Jaime Nieto-Millan escaped injury.\nBUSINESS BUZZ\n• Repair Sports Institute owner and founder Chad Beauchamp opened his clinic in 2018 to help patients recover from their injuries. The purpose-driven business was recently accepted into the Better Business Bureau’s new program BBB4Good, becoming the initiative’s first verified business in California. “BBB4Good helps advocate what our mission is and helps get us connected with different organizations in the community that can help support us,” Beauchamp said.\n• Irvine-based Taco Bell agreed to pay $85,500 in fines last Wednesday after it was accused of refusing to cash out customers’ gift cards when they were valued at less than $10, according to this L.A. Times report.\n• Villains Brewing Co. in Anaheim is the latest addition to Smoke & Fire Eatery’s Isaias Hernandez empire. The new brewery has the option of sit-down service barbecue in the outdoor courtyard or a casual bar atmosphere within the space.\nLIFE & LEISURE\n• A mother and son shared one special day together: graduating from UC Irvine at the same time. Faith Couts, 50, said it was a surreal experience and received her bachelor’s degree in social policy and public service. Her son, Hunter Wetzel, 22, received his bachelor’s degree in anthropology.\n• Through thick and thin, the Laguna Food Pantry and its volunteers have served those facing food insecurity for 30 years. What was once a walk-in shopper’s experience is now a drive-through grocery loading lane, but the mission remains the same. “Food is the focus and center of every celebration and activity, and to be able to provide the most basic need to families just is a no-brainer,” said Anne Belyea, executive director of the pantry.\n• Newport Beach author Candi Sary’s second novel, “Magdalena,” connects motherhood with the supernatural. Set to be released July 11, the story centers around town outcast Dottie, who, after suffering from a history of miscarriages, develops a “strange, motherly interest” in her 15-year-old neighbor, Magdalena, who sees ghosts. When Magdalena goes missing, Dottie finds herself at the forefront of a town scandal.\n• “Equal Voices” is a six-session course that takes a comprehensive look at sex, dating and safety for individuals living with intellectual or developmental disabilities transitioning to independent living. Since last July, the classes offered by Planned Parenthood of Orange and San Bernardino Counties have reached nearly 600 people with adaptive needs.\nSPORTS\n• Rowers of the Newport Aquatic Center program, propelled by 11 graduating senior girls rowers, set a new record at the USRowing Youth National Championships in Sarasota, Fla. The women’s varsity eight finished in third place on June 11, medaling for the first time in program history after crossing the line in 6 minutes, 31.55 seconds.\n• Laguna Beach tight end Ryner Swanson has committed to BYU, announcing his decision in a social media video taken from Provo, Utah. Swanson helped the Breakers win their first championship in 76 years after claiming the CIF Southern Section Division 9 title last November.\n• Los Angeles Rams defensive end Desjuan Johnson will participate in Irrelevant Week activities from June 22 to June 27. The last pick in the 2023 NFL Draft will take part in the annual surfing lesson in Newport Beach on June 24.\nCOMMENTARY\n• Gustavo Arellano, L.A. Times columnist and man about O.C. was in Laguna Beach the other day to check out the drag queen story hour hosted at Laguna Art Museum. He’d taken notice of social media posts in advance of the event trashing the museum for offering it. “Typical was one from the Greater Laguna Beach GOP, which alleged with no evidence whatsoever that the mere act of a drag queen reading a book to kids was part of a ‘larger, recent trend of sexualizing children,’” Arellano writes. What did the intrepid journalist find when he arrived? You’ve got to read his column describing the scene. It’s great.\nOBITUARY\n• Alice Chandler, considered to be the first woman to serve as an Orange County sheriff’s deputy, died earlier this month. She was 94. The cowgirl, who held her badge from 1949 through 1951, also worked as a dog breeder, cattle herder, Christian missionary and caregiver during a well-traveled life that took her from her birthplace of Memphis, Tenn., to Irvine Ranch to Africa and back to California.\nCALENDAR THIS\n• VidCon Anaheim, an annual gathering that brings together fans and digital creators from YouTube, Instagram, TikTok and more for panel discussions and other events, opened this morning at the Anaheim Convention Center, 800 W. Katella Ave., and continues through Saturday. More information, including which digital creators are participating and how to buy tickets, can be found here.\n• The OC Parks Summer Concert Series launches tomorrow beginning at 5 p.m. (concert starts at 6 p.m.) with the spotlight on performers Paco Versailles and Cesar Alan in Craig Regional Park, 3300 N. State College Blvd., Fullerton. The free outdoor concert is suitable for all ages. Parking is free. There will be food and beverages available for purchase. For information on this summer’s schedule, go here.\n• The 75th Costa Mesa-Newport Harbor Lions Club Fish Fry runs Friday, from 5 to 10 p.m., from 11 a.m. to 10 p.m. on Saturday and Sunday from 11 a.m. to 9 p.m. at Lions Park, 570 18th St., in Costa Mesa. Admission is free, and food, beverages and ride tickets are available for purchase. For more information, visit cmnh-lions.com.\n• The 44th annual Laguna Niguel Family YMCA Run in the Parks, a family and pet-friendly fundraiser, is set for Independence Day, Tuesday, July 4. Registration for the 9 a.m. kids race and obstacle course (ages 12 and under) is $30. The adult race, which steps off at 8 a.m., costs $50. Participants can enjoy a pancake breakfast and will receive a T-shirt, medal and access to the health expo taking place in conjunction with the event. Laguna Niguel Family YMCA is located at 29831 Crown Valley Pkwy. To register, visit ymcaoc.org/run.\nKEEP IN TOUCH\nThank you for reading today’s newsletter. If you have a memory or story about Orange County, we would love to read and share it in this space. Please try to keep your submission to 100 words or less and include your name and current city of residence.\nWe appreciate your help in making this the best newsletter it can be. Please send news tips, your memory of life in O.C. (photos welcome!) or comments to carol.cormaci@latimes.com or vincent.nguyen@latimes.com.",
  "word_count": 2284,
  "scraped_at": "2026-02-14T13:24:22.132190"
}