{
  "article_id": "c538568da8c8",
  "url": "https://prowrestling.net/site/2025/04/23/new-texas-pro-wrestling-texas-hold-em-results-vetters-review-of-carter-blaq-vs-michael-oku-for-the-new-texas-pro-title-zayda-steel-vs-vert-vixen-vs-brittnie-brooks-for-the-texas-pro-women/",
  "title": "New Texas Pro Wrestling  Texas Hold Em  results : Vetter review of Carter Blaq vs . Michael Oku for the New Texas Pro Title , Zayda Steel vs . Vert Vixen vs . Brittnie Brooks for the Texas Pro Women Title",
  "date": "20250423T213000Z",
  "domain": "prowrestling.net",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "By Chris Vetter, ProWrestling.net Contributor (@chrisvetter73)\nWe are looking for reports on all WWE, AEW, NXT, TNA, GCW, MLW, and other notable live events or television tapings. If you attend a show, you are encouraged to send a report or even basic results to dotnetjason@gmail.com\nNew Texas Pro Wrestling “Texas Hold Em”\nStreamed on IndependentWrestling.TV\nApril 18, 2025, in Las Vegas, Nevada at Swan Dive\nI did a Google Map search to find exactly where this music night club is located — it’s maybe one mile north of the Stratosphere — and I would say that it is outside the main tourism areas in Las Vegas. (I’ve taken the bus to and from the Stratosphere north to the Fremont downtown area and never stopped in the neighborhood where this New Texas Pro show was held.) The reason I go into all of these details to open is that my heart sank when the video began. This is a dark, poorly lit room that has the look and vibe of a seedy strip club. The crowd was maybe 50 to 70. (Cagematch.net lists it as 150 which is simply a massive embellishment.) As is often the case, the ringside cameras were a bit better, but the lighting over the ring is shockingly bad.\nQuite frankly, I was aghast and immediately felt bad for New Texas Pro. They’ve had some really good shows lately and I think are largely under the radar. The opening match and the last four of this 10-match show are great on paper. Sadly, this show got lost in a night of busy wrestling events all over Las Vegas. (GCW’s Joey Janela’s Spring Break, FSW presenting the WWE ID tournament, and Dragon Gate USA were all happening at the same time.) Having this show in what I would consider a ‘not safe’ area of Vegas at 10 p.m. also had to be a turn-off to tourists.\n1. Luke Jacobs vs. Bryan Keith. Jacobs is a top UK star (think Bryan Danielson in style) and it had to be a shock to him to walk to the ring with almost no fans present. An intense lockup to open and good reversals and a standoff at 2:00. Jacobs dropped him with a shoulder tackle and playfully kicked him; Keith hopped up and they traded chops. They rolled to the floor and traded more chops. Jacobs slammed him onto the ring apron at 6:00. (This ring is exceptionally short and closer to the ground.) In the ring, Jacobs stomped on Keith, kept him grounded, and was booed.\nKeith nailed an Exploder Suplex at 9:00, then a second one for a nearfall. Jacobs hit a series of headbutts, so Keith hit a flying headbutt. Jacobs hit a Mafia Kick and a pop-up powerbomb for a nearfall at 10:30. Keith hit a knee to the face for a believable nearfall. Jacobs hit a snap German Suplex, then a decapitating clothesline, and both men were down. These guys were busting their butts in front of a crowd this small. Keith hit a second-rope superplex and a running knee, but Jacobs kicked out at one! Keith hit the Emerald Tiger Driver (flipping powerbomb) for the pin. That was a fantastic match.\nBryan Keith defeated Luke Jacobs at 12:56.\n* Keith got on the mic and urged fans to support indy wrestling and he’s glad to be back in New Texas Pro. Next up is Jay Davis having an “open invitational scramble.”\n2. Jay Davis vs. Jus X Nic vs. Maximus Stone vs. Adrian Rain vs. Jackpot J-Rock vs. Kidd Bandit in a scramble for the Texas Contender’s Series Title. I don’t think I’ve seen Stone, Rain or J-Rock. Stone is a 1940s-style private investigator character from pulpy movies. Davis, the champion, came out last. Everyone ganged up on him early on. Banditt hit a huracanrana on Rain. J-Rock hit a flip dive to the floor on everyone at 2:00. In the ring, Davis hit some German Suplexes. Nic hit a clothesline for a nearfall at 5:00. but Banditt made the save. Davis hit a mid-air spear on Rain for a nearfall. Davis tied Stone in a Trailer Hitch leg lock, and Stone tapped out. Just so-so action.\nJay Davis defeated Jus X Nic, Maximus Stone, Adrian Rain, Jackpot J-Rock, and Kidd Bandit to retain the Texas Contender’s Series Title at 7:28.\n3. “Team New Texas” Father Oday, Charity King, and Dustin Nguyen vs. “Team PrideStyle” JJ Blake, Chris Nastyy, and Johnnie Robbie. Nguyen does a 1970s movie Kung Fu character and I think he does the gimmick wonderfully. Robbie is a top West Coast female wrestler. I believe Nastyy also is a California guy; I’ve seen him maybe twice. Blake and Oday opened. Dustin battled Nastyy, hitting a basement dropkick for a nearfall at 2:30. Robbie got in and she hit a 619 on Nguyen. Dustin hit a spin kick to her head that dropped her. Charity then tagged in and clotheslined Johnnie in the corner. Nastyy got back in and hit some clotheslines. Charity dropped Nastyy with some clotheslines, then a spinebuster for a nearfall at 5:00.\nDustin hit a Dragon Suplex. Johnnie hit flying double knees on Dustin’s head. Blake hit a Cradle Shock. Oday hit a Jay Driller. Johnnie hit a flying Lungblower off the ropes. This has been far better than the second match; still chaotic but this was clicking better. Dustin unloaded some kicks on Nastyy. Nastyy put Nguyen on his shoulders and slammed him face-first to the mat for the pin. That could have gone longer.\nJJ Blake, Chris Nastyy, and Johnnie Robbie defeated Father Oday, Charity King, and Dustin Nguyen at 7:46.\n4. Hanako vs. Kylie Rae. (I noted in my review of the WWE ID show that I wondered where Kylie was; well, she was here instead!) Hanako is a 6’1″ youngster; she’s raw and green, but she has towered over every opponent I’ve seen her against. She wrestled in New Texas Pro last year, too. They locked up, and Hanako easily shoved her to the mat. Hanako wanted a test of strength and held her hands high over her head, so Kylie responded by stomping on her foot. Hanako hit a bodyslam at 2:00. She hit a delayed vertical suplex for a nearfall.\nKylie hit a buzzsaw kick to the head and tied her in a crossface at 4:00, but Hanako reached the ropes. Kylie again applied a crossface, this time in the center of the ring, and Hanako tapped out. Fairly basic but Kylie walked the kid through a watchable match.\nKylie Rae defeated Hanako at 5:51.\n5. Izzy James vs. Robert Martyr vs. Isaac Morales for the New Texas Pro Lonestar Championship. Izzy is a 15-year vet and a good hand. I’ve seen Martyr fight from coast to coast, and I’ve just never seen the ‘it factor’ in him, but I acknowledge he’s a better heel than babyface. Quick reversals from all three to open. Martyr dove over the top rope onto them at 1:30; it’s an awkward dive because the ring is so much lower than most other rings. Back in the ring, Martyr hit a German Suplex on Izzy. Morales jumped in and stomped on James.\nMorales hit a top-rope crossbody block on both guys. James hit a pop-up forearm strike at 5:30 and some discus clotheslines in opposite corners. Martyr hit a moonsault onto both guys, and everyone was down. They all got up and traded blows. Martyr hit a swinging sideslam. Morales hit a mid-ring Sliced Bread for a nearfall. Martyr hit a piledriver for a nearfall, but someone distracted the ref! Martyr hit a brainbuster for a nearfall, but again, this kid distracted the ref! It allowed Izzy to hit a spin kick on Morales’ head and get the pin.\nIzzy James defeated Robert Martyr & Isaac Morales to retain the New Texas Pro Lonestar Title at 9:12.\n* Shimbashi ran in the ring and attacked Izzy James. The commentators said they weren’t aware that Shimbashi was in town.\n6. “The Dream Team” KC Kr’eme & Danny King vs. “Toxic Tour” Pac Ortega & Prince Ly vs. “The 8th Day” Timur the Great & the Guardian vs. “Texas Kingdom” Rob Love & Studstache in an elimination match for the New Texas Pro Tag Team Titles. I don’t know the Texas Kingdom team, and I don’t think I’ve seen the Guardian, either. All eight brawled at the bell, and with how poorly this ring is lit, I can’t really tell who is whom. Texas Kingdom were pinned and eliminated at 2:59; being as they were the team I didn’t know, I’m not surprised they were out first.\nToxic Tour was eliminated at 6:36. They should have just let The Dream Team have a regular tag match with The Eighth Day, because that’s what we finally got to here. The chubby Guardian hit a double clothesline. Timur hit a delayed vertical suplex on Kr’eme at 10:00. Kr’eme got a chair and struck his opponents with it; the commentators reminded us it’s legal in a four-way. The big Guardian hit a Pounce and was fired up. KC struck Guardian in the back with a chair and powerbombed him out of the corner. King hit a frogsplash onto Guardian for the pin. This match was, as Jim Ross would say, was bowling-shoe ugly.\nKC Kr’eme & Danny King defeated Pac Ortega & Prince Ly, Timur the Great & the Guardian, and Rob Love & Studstache to retain the New Texas Pro Tag Team Titles at 12:21.\n7. “Cowboy Way” Thomas Shire and 1 Called Manders vs. Dimitri Alexandrov and Brick Savage. This should be hard-hitting! Savage and Shire opened with a lockup; these are two BIG men. (I’ve compared Brick’s size and build to Bronson Reed.) Manders and Dimitri locked up at 2:00. Savage got in and knocked Manders down with a shoulder tackle. Dimitri chopped Shire at 7:00, and the Texas team kept Shire in their corner. Manders tagged in and they all brawled to the floor, with Manders chopping Dimitri. They brawled into this (very empty) room and onto the plastic folding chairs.\nManders got in a three-point football stance, but Brick hit a Pounce to send Manders flying into the chairs. In the ring, Shire did an airplane spin on Dimitri. However, Brick jumped into the ring, slammed Dimitri, and got the pin. Decent brawl and a bit of an upset, too.\nDimitri Alexandrov and Brick Savage defeated 1 Called Manders and Thomas Shire at 12:39.\n8. Danny Orion vs. Epydemius Jr. These two JUST met in a tournament final in Texas in a fantastic bout. Orion hit a spin kick to the face at the bell for a nearfall! He dove through the ropes, but Epydemius caught him and suplexed him into the rows of empty chairs! That’s a hot start! Back in the ring, Orion hit a tornado DDT for a nearfall at 2:00. Epydemius Jr. fired up and hit some chops. Orion tugged at Epy’s mask, and he grounded him. Epydemius hit a plancha to the floor at 5:00. Back in the ring. he hit a frogsplash for a nearfall. Orion dropped him snake-eyes in the corner and hit a back suplex for a nearfall. Orion went for a slingshot press, but Epydemius got his knees up. They got up at 7:00 and traded forearm strikes. Orion nailed a Crucifix Bomb for the clean pin. Good match — not as good as their tournament finals — but a good match nonetheless.\nDanny Orion defeated Epydemius Jr. at 8:36.\n9. Zayda Steel vs. Vert Vixen vs. Brittnie Brooks in a three-way for the Texas Pro Women’s Title. I noted that there was a WWE ID tournament show that started a bit before this one; Steel and Brooks fought second there and made the trek over to this show to appear here just a few hours later! Brittnie and Zayda immediately traded forearm strikes; Vert got between them and struck them both. Brittnie hit a snap suplex on Vert at 1:30. Steel hit a basement dropkick on both women. Zayda hit a discus forearm strike that dropped Vert. Zayda dove through the ropes onto both women, and they were down on the floor at 3:00.\nZayda whipped Vert into the chairs. Brittnie hit a bulldog in the ring for a nearfall. Vert hit a standing powerbomb on Zayda, then one on Brittnie at 5:00. Vert tied Zayda up on the mat in an STF or a Crossface (it is so ridiculously dark in the ring I truly can’t tell!) Brooks hit the It’s Brittnie Bitch (Eye of the Hurricane) on Zayda for a nearfall, but Vert made the save. Vert hit a Pedigree for a nearfall. Brittnie and Vert traded hard overhand chops. Vert nailed a brainbuster and pinned Brittnie! New champion! Zayda loses her belt without being pinned! Good match for the time given, but this was way too short.\nVert Vixen defeated Brittnie Brooks and Zayda Steel in a three-way to win the New Texas Pro Women’s Title at 7:47.\n10. Carter Blaq vs. Michael Oku (w/Amira Blair) for the New Texas Pro Heavyweight Title. Blaq is the former Mysterious Q, who recently lost his mask. He’s got great size and is bigger than British star Oku. Good reversals at the bell, and the bigger Blaq hit a bodyslam for a nearfall at 1:30. Oku hit a standing neckbreaker. Blaq hit a uranage at 4:30. He hit a release German Suplex that sent Oku across the ring! He hit a Falcon Arrow for a nearfall and was in charge. Oku hit a series of kicks, but Carter hit a Mafia Kick and a Flatliner for a nearfall at 7:30. Oku kicked out the left knee and he began targeting it, hitting a Dragonscrew Legwhip.\nOku locked in the half-crab (his signature hold!) at 9:00, and Blaq writhed in pain on the mat and teased tapping out, but he reached the ropes. Oku kicked at the back of the damaged knee and Blaq grabbed the top rope to help his balance. Blaq nailed a Q Cutter (pop-up stunner) for a believable nearfall. Blaq did an Airplane Spin but his knee gave out. Oku hit a DDT and a top-rope frogsplash for a nearfall. Oku immediately locked in a half-crab. Blaq kicked Oku to the floor. He set u for a dive but Oku cut him off with kick. Oku hit a second frogsplash for a nearfall. He hit a top-rope crossbody block, but Blaq caught him, put him on his shoulders and spun him to the mat in a powerbomb for the pin. A very good match.\nCarter Blaq defeated Michael Oku to retain the New Texas Pro Heavyweight Title at 13:32.\nFinal Thoughts: Just to be clear — my deep criticism of this show has nothing to do with the quality of the wrestling. This a good roster and they worked hard. That said, they should have cut the second match, and half the four teams in the sixth match, and given those minutes to some of the other matches that were far too short. Blaq-Oku was easily best match, and the show-opener Keith-Jacobs was good for second. I liked the women’s three-way and that takes third. Orion-Epydemius Jr. was fine, but again, nowhere as good as a match they just had in Texas.\nThis venue is probably a really nice club to see live music. But after seeing how well-lit the Collective was, and how great the MEET looked for West Coast Pro, Prestige, Deadlock Pro, etc. … this venue came up well short. This was bound to happen… with so much good wrestling going on in this city all at the same time… a show like this with a good lineup … was just going to draw poorly because fans were elsewhere. I can only presume that Texas Pro officials were unaware that the ring would be lit this poorly — maybe they were misled by the venue about the quality of its lighting system and didn’t bring in additional lights. But I fear that no matter how good the wrestling on this show was… people who have IWTV will tune in, see how bad it was lit and the overall production, and turn it off without giving the wrestling a chance.",
  "word_count": 2727,
  "scraped_at": "2026-02-14T12:11:45.573909"
}