{
  "article_id": "c53a8c97e664",
  "url": "https://www.pagosasun.com/stories/library-to-host-internet-safety-session-for-teens-and-tweens-survival-expert-talk-for-all-ages,73601",
  "title": "Library to host internet safety session for teens and tweens , survival expert talk for all ages",
  "date": "20250325T133000Z",
  "domain": "pagosasun.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Library News\nPosted\nRise Above Violence will host a free talk about internet safety tomorrow, Friday, March 21, from 2 to 3 p.m. at the library for teens and tweens.\nThe session will cover how to make sure you know the people you are communicating with online, as well as how to tell if the messages or requests you are responding to are safe — and what to do if they are not.\nThis Rise event is part of an ongoing monthly series aimed at teens and tweens about forming healthy relationships and finding ways to deal with others safely.\nSurvival expert talk\nNext Tuesday, March 25, from 1 to 2:15 p.m., Jessie Krebs will host a free session on “Knots, Hitches and Lashings.”\nShe is a former U.S. Air Force SERE (Survival, Evasion, Resistance and Escape) training instructor.\nAs one of a handful of women in the male-dominated SERE career field, Krebs outsmarted and out-toughed many of her male counterparts in the Air Force to make it through the intense training program. And she is passing her knowledge on.\nToday she is a technical consultant and on-screen survival expert for international survival shows including “Alone” season nine, the Science Channel’s “Hacking the Wild” and Fox’s “Kicking and Screaming.” On National Geographic’s “Mygrations” she became one of only a handful of humans ever to complete a primitive crossing of hundreds of miles of Tanzanian Serengeti on foot.\nBack by popular\ndemand: free tax help\nBecause of the popularity of her first time providing individualized help with taxes, Kathy from VITA Tax Help is offering free personal sessions at your library again on Friday, April 7, from 9 a.m. to 6 p.m.\nEveryone is welcome. But, before you meet face-to-face with Kathy, there are two important steps you must follow. First, you need to pick up a tax packet at the library and complete the packet fully. Then you need to call Kathy at (970) 553-9150 to make an appointment for your session.\nWe are very grateful to Kathy for donating her time and sharing her tax expertise with our patrons at these free sessions.\nOnline author talks\nOur highly popular free online author talks with New York Times bestselling authors continue with two more talks in March for you to watch live on Zoom or via a recording later.\nFor details and to register go to https://libraryc.org/pagosalibrary/upcoming .\nToday, Thursday, March 20, at noon will feature Clara Bingham on “How Woman’s Liberation Transformed America.”\nWednesday, March 26, will star novelist Jennifer Weiner on “Dreams We Chase.”\nCraftapalooza tomorrow\nAll ages are invited to create a variety of crafts Friday, March 21, from 2 to 3:30 p.m. All supplies will be provided.\nAdult knitting Saturday\nJoin new and experienced knitters Saturday, March 22, our free Knitters Circle from 1 to 3 p.m. It is aimed at anyone over the age of 18 who would like to knit together or get some help if you are stuck on your project.\nAgeless Grace exercise Monday\nIn a special community partnership program, Judy, adult services librarian, is leading an Ageless Grace exercise program at the Pagosa Senior Center every Monday in March from 10 to 10:45 a.m.\nIt is a brain fitness program consisting of 21 simple exercises designed for all ages and abilities, performed while sitting in a chair. The Senior Center location was chosen so participants have more privacy as they exercise.\nFamily storytimes\nWednesdays from 10 to 11 a.m., join a free educational hour of reading, singing and free play to build early literacy skills.\nWriters Guild\nEvery Thursday from 9 to 11 a.m., Ruby’s Writers Guild welcomes writers looking for opportunities, support, resources and camaraderie with other writers at this free gathering.\nESL classes\nFree in-person evening classes take place on Tuesdays and Thursdays, with 4 to 5 p.m. reserved for beginners, 5 to 6 p.m. for intermediate and 6 to 7 p.m. for advanced students. Please help us share the word about these classes.\nTech Time\nFree in-person slots are available from 10 a.m. to noon Tuesdays and 2 to 4 p.m. Thursdays. Judy helps you with basic questions relating to computers, smartphones and tablets, and also provides assistance in accessing the library’s online resources.\nNo appointment is needed for these drop-in sessions, but please bring your device’s charger and passwords with you.\nPagosa Adult Learning Services (PALS)\nJoin Mark or Sally for free PALS sessions Tuesdays and Thursdays from 5:30 to 8 p.m. to help with high school equivalency, GED, college prep, financial aid, tutoring and more. No appointment is necessary.\nNew classic books\nsection\nWe have created a new classic books section in the library, thanks to a donation of books from Lee Stopher. They include “Jane Eyre” by Charlotte Bronte and “Don Quixote” by Miguel de Cervantes.\nDVDs\n“Severance” stars Adam Scott in a film about a work-life balance experiment. “One Piece Film: Gold” is an animated Saw Hats feature set in the world’s greatest entertainment center. “Super Troopers” is a two-movie collection.\nBooks on CD\n“There Are Rivers in the Sky” by Elif Silafak is a multi-century epic. “Reborn as a Demonic Tree” is book three of the Isekai LitRPG fantasy series. “Death of the Author” by Nnedi Okorafor features a successful Nigerian sci-fi novelist. “The Oligarch’s Daughter” by Joseph Finder is a spy novel. “Blue Sisters” by Coco Mellors tells of three sisters reuniting after their sister’s death to stop of the sale of family apartment. “Beneath the Stars” by Emily McIntyre is book one of a new Sugarlake romance series.\nLarge print\n“Chronological Bible” is the entire text of the New Living Translation in 365 daily readings arranged in the order the events actually occurred. “By The Fire We Carry” by Rebecca Nagle chronicles the Muscogge’s generations-long fight for tribal land in eastern Oklahoma. “Nordic and Finn” by Peter Brandvold is book one of a new series set in New Mexico Territory. “Blood in Sweet River” by John Shirley is book three in the Clever Trewe western series.\nMysteries, suspense and thrillers\n“Battle Mountain” by C. J. Box is a Joe Pickett and Nate Romanowski mystery. “Close Your Eyes and Count to 10” by Lisa Unger follows an extreme game on a secluded island. “Mask of the Deer Woman” by Laurie L. Dove features a former Chicago policewoman who returns to the reservation to take the marshal job. “Death Takes Me” by Christina Rivera Garza begins with a warning on a crime scene photo. “A Dragon of the Black Class” by James Rollins is a pre-apocalyptic fantasy.\n“The Safekeep” by Yael van der Wouden begins with an unwelcome guest in a rural Dutch home. “Blood Moon” by Sandra Brown features Det. John Bowie in coastal Louisiana. “Our Beautiful Boys” by Sameer Pandya focuses on stars on a high school football team accused of violence. “Ward D” by Frieda McFadden is a thriller set in a hospital’s mental health unit.\nOther novels\n“The Bright Sword” by Lev Grossman is a reimagining of the King Arthur legend for the new millennium. “Same Bed Different Dreams” by Ed Park blends history and fiction about what might have happened in Korea. “Tracking Game” and “Striking Range” by Garet Mizushima are Timber Creek K-9 mysteries featuring Robo. “Far From Home” by Danielle Steel features a wife and mother hiding in occupied France. “The Familiar” by Leigh Bardugo is set in the Spanish Golden Age. “Theft” by Abdulrazak Gurnah is a coming-of-age story in 21st century Tanzania.\n“Our Evenings” by Booker Prize winner Alan Hollinghurst follows a young brown child as he enters an elite English school. “Two-Step Devil” by Jamie Quatro is a horror story about God and loss. “Whale Fall” by Elizabeth O’Connor focuses on an 18-year-old Wales teen wanting to learn more about the outside world. “Rejection” by Tony Tulathimutte presents seven interconnected stories. “The Persians” by Sanam Mahloudji is a darkly comedic novel about an Iranian family grappling with personal and political revolutions. “Dark Hope” by Christine Feehan is part of the Carpathian paranormal romance fantasy series.\nThanks to our donors\nWe are very grateful to Stopher for her donation of books to help us build our classic books section, and to Donna Mosher for her donation enabling us to purchase new staff computers.\nDonations guidelines\nThe Friends of the Library have new guidelines for donations to the library.\nBooks on time-sensitive topics that can quickly become out of date are wanted only if they have been published within the last five years. These subjects include politics/current events, health and medicine, sports/exercise, business, technology, science, education, and travel guides. Not accepted are reference materials, textbooks and nonprint material like CDs, DVDs, Blu-ray, VHS or cassette tapes because they do not sell at Friends of the Library sales.\nWhen the library is open, high-quality used book donations are gratefully accepted at the front desk — not down the outside returns slot at the library or the drop box at City Market, please.\nNo more than two boxes at a time because of space constraints and all books should be in excellent condition, please.\nQuotable quote\n“Travel really has a value. I came home [from my first trip] with a strong feeling that the world is filled with good people. It’s filled with joy, it’s filled with love, it’s filled with diversity that we should not be afraid of, that we should embrace and celebrate. And you won’t know unless you get out there and see for yourself.” — Rick Steves, American travel writer, travel host, PBS TV personality and author of guidebooks who specializes in European travel.\nWebsite\nFor more information on library books, services and programs — and to reserve books, e-books, books on CD and DVDs from the comfort of your home — please visit our website at https://pagosalibrary.org.",
  "word_count": 1635,
  "scraped_at": "2026-02-14T13:40:53.797845"
}