{
  "article_id": "c53b741f01b3",
  "url": "https://theprideoflondon.com/2023/10/23/chelsea-women-bhafc-3-standout/",
  "title": "Chelsea 4 - 2 Brighton & Hove Albion : 3 standout Blues",
  "date": "20231023T134500Z",
  "domain": "theprideoflondon.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Down by a “goal” after the 10′, Chelsea Women showed that champion spirit in front of its home fans. Led by Sjoeke Nusken, Brighton & Hove Albion were denied a historic upset on a ground the home side has not lost at since 2021.\nWe all probably gasped when Pauline Bremer converted an early chance – from an offside position – but that panic did not last long with the way the home side responded. Sophie Baggaley was up for the task, amassing numerous remarkable saves before the equalizer finally came in first half stoppage time.\nIt was like heading down to the coast on a summer day with applying sunscreen. The result of a sunburn is inevitable, just like the opening goal for the west London side on Sunday afternoon. The Seagull’s wall could not stand for any longer. Once it tumbled, the home side kept its foot on the gas. For the fourth time in the last nine league fixtures, Hayes’ crew found the back of the net on at least four occasions.\nHayes shook up the lineup just a bit. Three players made their first starts of the campaign. It started between the sticks with Ann-Katrin Berger getting the nod for the first time this season over Zecira Musovic. Eve Perisset and Canadian Kadeisha Buchanan made it into the starting XI while Fran Kirby, Lauren James, and Sam Kerr maintained their places in the front line.\nThis has to be considered the most complete display of football to date. Clean up some finishing, that’s it. If VAR actually existed or the eyes on the assistant referee worked properly, this would have been a smooth three goal win without any sort of stress. We won’t live in alternate realities though. It’ll only get more difficult from here with the Champions League approaching, but to be at the top with October all wrapped is exactly where this club wants to be.\nHere are three of the most impressive Blues that helped secure a well-deserved three points at Kingsmeadow.",
  "word_count": 339,
  "scraped_at": "2026-02-14T12:40:51.963773"
}