{
  "article_id": "c57f8eb7e4a1",
  "url": "https://www.justarsenal.com/arsenal-loanee-patten-on-aston-villa-beating-chelsea-to-get-to-womens-fa-cup-final/337200",
  "title": "Arsenal Loanee Patten on Aston Villa beating Chelsea to get to Women FA Cup Final",
  "date": "20230415T181500Z",
  "domain": "justarsenal.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Arsenal Loanee Patten on Aston Villa beating Chelsea to get to Women’s FA Cup Final by Michelle\nAston Villa Women welcome Chelsea to the Poundland Bescot Stadium today, Sunday 16th April, with kick-off scheduled for 14:15 UK, for the Vitality Women’s FA Cup semi-final.\nAnna Patten is on-loan to Aston Villa, from parent club Arsenal, and very much hopes to feature for Aston Villa today, having tasted success when she won two FA Youth Cups with Arsenal.\n“The first final I played in with the under-17s, I had my Scottish family come down which was unusual. I had grandparents from both sides there,” Patten told BBC Sport.\n“I remember they were all there with their phones out wanting me to pose for photos with the cup. It was a great feeling.\n“The FA Cup is one of the greatest achievements you can have when you’re playing in English football. We definitely want to stop this Chelsea team as best we can.”\n23 year old Patten began her career at Arsenal and returned to the club after attending college in the US, and is particularly incentivised to beat Chelsea because of their arch rivalry with Arsenal, saying: “I’ll probably get a few messages from the Arsenal girls,”\n“They definitely want to see Villa in the final instead of Chelsea, seeing as they were the team who knocked Arsenal out too.\n“Anyone beating Chelsea will probably make them happy. Me and [ex-Arsenal midfielder] Jordan Nobbs will take that into the game.\n“A couple of the Arsenal girls might come to watch and will probably be supporting us as well. I definitely don’t think they will be cheering for Chelsea!”\nReigning champions Chelsea are definitely favourites going into the game, especially as they beat Aston Villa 3-0 in the WSL, before going into the international break. Arsenal have won the most Women’s FA Cups, with 14 titles, but they were knocked out by Chelsea earlier in the tournament.\nWill you be shouting for Aston Villa? I know we will!\nMichelle Maxwell\nFollow Michelle on Just Gooner Women on Twitter for regular updates on the Arsenal Womens Team!\nDo you want to read more about the Arsenal Women’s Team? Click here….",
  "word_count": 367,
  "scraped_at": "2026-02-14T12:22:00.344183"
}