{
  "article_id": "c5813675e743",
  "url": "https://greatbendpost.com/posts/94c48642-3c57-488b-8e5a-a418a311185c",
  "title": "Tuesday Sports Headlines and Scores presented by Barton Community College",
  "date": "20240716T124500Z",
  "domain": "greatbendpost.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "ARLINGTON, Texas (AP) — Los Angeles Dodgers’ Teoscar Hernández won the Home Run Derby when he beat local star Bobby Witt Jr. of the Kansas City Royals 14-13 in the final round. The 31-year-old Hernández hit 49 homers over three rounds that totaled 3.98 miles. He is the first Dodgers player to win the derby. Kansas City has never had a winner. Witt, needing one to tie with one out remaining, drove a ball to one of the deepest parts of the park in left-center, where it hit halfway up the wall.\nARLINGTON, Texas (AP) — Paul Skenes was the center of attention in a ballpark filled with six dozen All-Stars. The 22-year-old Pittsburgh Pirates pitcher with 11 major league appearances will start for the National League on Tuesday night, when Baltimore's Corbin Burnes starts for the American League. Skenes will have the fewest big league games of any player in the showcase’s 91-year history. His splinker, a hybrid that sinks like a splitter with the velocity of a sinker, has batters muttering. He is 6-0 with a 1.90 ERA since his May 11 debut, striking out 89 and walking 13 in 66 1/3 innings.\nARLINGTON, Texas (AP) — Baltimore’s Corbin Burnes will start for the American League in the All-Star Game against Pittsburgh rookie Paul Skenes. A 29-year-old right-hander, Burnes is 9-4 with a 2.93 ERA in his first season with the Orioles, who acquired him from Milwaukee just before spring training. Skenes, who made his major league debut on May 11, is 6-0 with a 1.90 ERA in 11 starts, striking out 89 and walking 13 in 66 1/3 innings. The 21-year-old right-hander will become the fifth rookie starter after Dave Stenhouse, Mark Fidrych, Fernando Valenzuela and Hideo Nomo.\nUNDATED (AP) — Drew Beam was a key cog of Tennessee’s pitching staff on its road to a College World Series title. Now the right-hander hopes to make an impact for the up-and-coming Kansas City Royals. Beam was one of the first selections on Day 2 of Major League Baseball’s amateur draft on Monday after being taken with the second pick of the third round at No. 76 overall by the Royals. The second day consisted of rounds three through 10. Australian second baseman Travis Bazzana was taken by the Cleveland Guardians with the No. 1 overall pick on Sunday.\nARLINGTON, Texas (AP) — Baseball can’t run away from its lack of runs. Batting averages are near half-century lows. Velocity is at an all-time high. The major league batting average was .240 through April and .239 in May, the lowest since the bottom of .237 in 1968’s Year of the Pitcher. It’s risen slightly along with the temperature as spring turned to summer: .246 in June and .250 in July, according to the Elias Sports Bureau. Still, the season average of .243 heading into the All-Star break was just ahead of 2022 and 1968 as the lowest since the dead-ball era ended in 1920.\nDALLAS (AP) — Southeastern Conference Commissioner Greg Sankey unofficially opened the league’s first football season as 16-team league in North Texas. It was a setting for SEC Media Days at a time when everything about college sports seems to be in flux. He said it was time to update expectations for what college athletics can be. The 59-year-old commissioner stressed that college sports must find solutions from within. He also said that while he is paying attention litigation in the Atlantic Coast Conference involving Florida State and Clemson, the SEC is focused on its 16 schools and he is not a recruiter.\nUNDATED (AP) — The short summer vacation is over for NFL players. It’s time to begin the journey to Super Bowl 59. Coming off a disappointing finish in the AFC championship game, the Baltimore Ravens became the first team to open training camp when they welcomed rookies on Saturday. Nineteen more teams get underway this week and all 32 clubs will open doors by July 24. Everyone is 0-0 but expectations aren’t the same. Some teams are legitimate contenders. A few are rebuilding. Patrick Mahomes and the Kansas City Chiefs are aiming to become the first team to three-peat since the 1965-67 Green Bay Packers won three consecutive NFL championships.\nMIAMI GARDENS, Fla. (AP) — Police say Colombia’s soccer federation president and his son were among 27 people arrested during the crowd control issues that broke out Sunday at the Copa America final between Argentina and Colombia. Ramón Jesurún and his son Ramon Jamil Jesurun were detained after the event at Hard Rock Stadium and charged, Miami-Dade police detective Andre Martin told The Associated Press. Martin did not disclose the charges. Arrest records showed Monday that Ramon Jamil Jesurun was booked on three counts of battery on an official. Colombia’s soccer federation didn’t immediately respond Monday to a request for comment from the AP.\nBERLIN (AP) — Spain has won a record fourth European Championship title after Mikel Oyarzabal’s 86th-minute goal clinched a 2-1 victory as England's painful decades-long wait for a major trophy goes on. Oyarzabal slid in to poke home Marc Cucurella’s cross just when the game at Berlin’s Olympiastadion seemed destined for extra time after the latest show of resilience by England at the tournament. Substitute Cole Palmer equalized for England in the 73rd minute to cancel out Nico Williams’ opener in the 47th from 17-year-old winger Lamine Yamal’s pass.\nUNDATED (AP) — Anthony Davis scored 17 points and grabbed 14 rebounds, Tyrese Haliburton came up with a pair of late 3-pointers that helped stop a freefall by the Americans, and the U.S. beat Australia 98-92 on Monday to improve to 2-0 in its five-game slate of exhibitions leading into the Paris Olympics. Devin Booker scored 16 for the U.S., which saw a 24-point second-half lead cut to four in the final moments. Jock Landale scored 20 for Australia, which got 17 from Josh Giddey and 14 from Dyson Daniels.\nUNDATED (AP) — From Simone Biles to Sha’Carri Richardson and Diana Taurasi to Katie Ledecky, Team USA provides some of the biggest star power at the 2024 Olympic Games. It will be the women leading the way as the U.S. looks to lead the overall medal table for the eighth consecutive Summer Games. The nearly 600 athletes that make up the U.S. squad include more than 250 returning Olympians and 122 Olympic medalists. The women outnumber the men 314 to 278, at last count, and ages range from 16 to 59.\nBALTIMORE (AP) — Former NFL receiver Jacoby Jones has died at age 40. Jones' 108-yard kickoff return in 2013 remains the longest touchdown in Super Bowl history. The Houston Texans were Jones’ team for the first five seasons of his career. They announced his death on Sunday. In a statement released by the NFL Players Association, his family said he died at his home in New Orleans. A cause of death was not given. Jones played from 2007-15 for the Texans, Baltimore Ravens, San Diego Chargers and Pittsburgh Steelers. He made several huge plays for the Ravens during their most recent Super Bowl title season, including that kick return.",
  "word_count": 1190,
  "scraped_at": "2026-02-14T12:42:28.755783"
}