{
  "article_id": "c58b6d3ea920",
  "url": "https://theathletic.com/5254295/2024/02/13/ineos-investment-man-utd-ratified/",
  "title": "INEOS investment in Man United ratified by Premier League – what does it mean for the club ? ",
  "date": "20240213T171500Z",
  "domain": "theathletic.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "A previous version of this article was published on February 13, 2024\nFifteen months on from the Glazer family launching what they called a “strategic review” of Manchester United, a deal for Sir Jim Ratcliffe’s company INEOS to buy 25 per cent of the club is finally complete.\nThis long-awaited moment will mean a shift in dynamic at the club. INEOS now assumes sporting control and is also investing $300million (£239m).\nAdvertisement\nFollow the latest Manchester United news with The Athletic\n- Manchester United will make ‘fresh decision’ on Mason Greenwood\n- Dan Ashworth taking on ‘ultimate challenge’ if he joins Manchester United\n- Sir Jim Ratcliffe on Manchester United, Old Trafford, Sheikh Jassim and Mason Greenwood: Full transcript\nIt is not the complete buyout the majority of United fans had hoped for when the prospect of a “full sale” was mooted by the Glazers under a strategic review that became known inside the club as ‘Project Ruby’. However, the complex deal should bring fresh impetus to the football side of the operation, as well as outside investment for the first time in the Glazers’ near 19 years.\nRatcliffe has acquired Class A shares, which are traded on the New York Stock Exchange, as well as some of the Glazers’ Class B shares, which are worth 10 times the voting rights.\nAs part of the deal, Sir Dave Brailsford, the former mastermind of cycling’s Team Sky, and INEOS Sport chief executive Jean-Claude Blanc, join the board.\nHere is everything you need to know.\nWhat’s the deal?\nINEOS has bought 25 per cent of Manchester United in exchange for sporting control. The deal, worth around £1.3billion, means the club’s football operation are now overseen by INEOS but the Glazer family, who have owned United since 2005, remain in overall charge. The Glazer family and other Class A shareholders receive the same price of $33 per share.\nThe $300m cash injection will be used to improve United’s Old Trafford stadium and other infrastructure, and INEOS has the casting vote on any decision related to football — for example, transfer policy or the future of manager Erik ten Hag.\nYou may be wondering how this is possible, given the structure of the club’s shares.\nUnited split their shares into Class A and Class B. The Glazers owned all of the Class B shares. They are worth 10 times the voting rights of their Class A equivalents, which are publicly traded on the New York Stock Exchange (NYSE). When members of the Glazer family have previously sold Class B shares, they have automatically converted to Class A, but Ratcliffe’s Class B shares retain their full voting power following a change to the company’s rules recently voted through by shareholders.\nAdvertisement\nThe club has other shareholders not called Glazer, with Lindsell Train, a British investment management company, owning more than 20 per cent of the Class A shares. Other notable investors include Ariel Investments, Eminence Capital and Pentwater Capital Management.\nWhen the United-INEOS deal was announced, it was revealed that Ratcliffe would acquire 25 per cent each of the Class A and Class B shares. By offering Class A shareholders just as much opportunity to participate in the offer as the Glazers, INEOS hoped to minimise the risk of legal action from its fellow minority stakeholders.\nSo this isn’t the end of the Glazer era, then?\nNo, it certainly isn’t.\nThe Glazers owned roughly 69 per cent of the club, with about 31 per cent of shares held by non-family members, the vast majority of them by institutional investors.\nRatcliffe’s bid was initially directed solely at the shareholding owned by the American family but, in the third round of bids, he proposed a deal that would mean he gained a majority of slightly more than 50 per cent. This would allow Joel and Avram Glazer — the siblings who have taken the most interest in United — to stay on as minority shareholders.\nThe offer changed again when Sheikh Jassim’s Qatari group withdrew its bid in October and INEOS indicated it wanted to buy a 25 per cent stake in United.\nLarge sections of United’s fanbase have campaigned against the Glazers’ ownership since the family’s hostile leveraged buyout in 2005. Overnight, United were placed into £660m of debt, with half of that borrowing placed on the club itself and the other half on the takeover vehicle, Red Football. The split was pretty academic, though, as United were paying the interest and that bill was enormous: £113m in 2006 alone, against annual revenue of £168m.\nYet, the Glazers have opted to stay on. How Ratcliffe and INEOS navigate the failure to negotiate a clean break will be fascinating.\nAdvertisement\nWhat has INEOS promised for United?\nWhen INEOS — whose secret name for the bid was ‘Project Trawler’, named after legendary then United player Eric Cantona’s famous quote — announced its bid for United in February 2023, its headline was an attempt to “put the Manchester back into Manchester United”.\n“We would see our role as the long-term custodians of Manchester United on behalf of the fans and the wider community,” the company said. “We are ambitious and highly competitive and would want to invest in Manchester United to make them the number one club in the world once again.\n“We also recognise that football governance in this country is at a crossroads. We would want to help lead this next chapter, deepening the culture of English football by making the club a beacon for a modern, progressive, fan-centred approach to ownership.\nManchester United sale on The Athletic…\n- How local lad Sir Jim Ratcliffe built a business empire\n- The Manchester United owners not called Glazer\n“We want a Manchester United anchored in its proud history and roots in the north-west of England, putting the Manchester back into Manchester United and clearly focusing on winning the Champions League.”\nThat all sounds very nice, but what does it mean in terms of Ratcliffe’s plans for the club?\nWell, one criticism of INEOS at Nice (the club it owns in France’s Ligue 1) is that Ratcliffe and his staff put too much faith in the figures who were there before them, believing the same structures only needed greater investment to improve results. They are unlikely to repeat the same mistake at Old Trafford.\nTen Hag’s position as manager has come under scrutiny, not helped by elimination from the Champions League, and indeed European football this season altogether, in the group stage, and speculation about the Dutchman’s future is inevitable under the new minority owner.\nINEOS executives will form a view on his suitability for the role through its assessment of United’s football operations, though figures close to its bid have previously expressed admiration for the work Ten Hag has done since arriving from Dutch club Ajax in summer 2022.\nAdvertisement\nElsewhere, Patrick Stewart has been filling the role of interim CEO following the departure of Richard Arnold. Omar Berrada will take on that role permanently in the summer, having been recruited from Manchester City. Blanc, the former Juventus chief executive who left a high-ranking role at Paris Saint-Germain to oversee the entire INEOS Sport portfolio, is expected to play an influential role and will be offering strategic advice.\nBrailsford, knighted after the London 2012 Olympic and Paralympic Games for taking Britain’s cycling teams to new heights, is also deeply involved. The 59-year-old is undertaking a review of existing operations before implementing changes.\nThe future of football director John Murtough is unclear. Newcastle United’s Dan Ashworth has been identified by INEOS as their top target for a sporting director role and he has been placed on gardening leave by Newcastle while all parties seek a resolution.\nThe indications are that Brailsford is also keen to appoint a transfer specialist to refine recruitment. This has been interpreted by some as being terminal for Murtough, and some people at the club anticipate his departure eventually, but sources insist no decision has been made.\nSources close to the INEOS bid, speaking on condition of anonymity when relaying private conversations, have told The Athletic that Ratcliffe sees the improvement of infrastructure at Old Trafford and the club’s Carrington training ground as essential. His proposal also included a statement of intent to invest in the women’s team.\nBefore the deal was announced, it emerged Ratcliffe was prepared to commit $300m of his wealth for infrastructure upgrades at United.\nWhile that would be insufficient to completely fix the myriad issues at the stadium and training ground, it is a step in the right direction. United’s latest set of annual fiscal results, for the year ending June 30 last year, revealed that they now owe more than £1bn through a combination of net debt, their revolving credit facility and outstanding transfer payments.\nA key element, however, is that Ratcliffe has bought a minority stake — rather than the complete buyout proposed by Sheikh Jassim’s rival bid — and has not said he will wipe United’s existing debt.\nAdvertisement\nHowever, behind the scenes, the INEOS bid has provided assurances that no “fresh debt” (ie, any money borrowed to acquire United) will land on the club’s balance sheet. It will instead be borne by INEOS.\nRatcliffe, though, does not see the need to “keep tipping more money into the bucket” when it comes to United.\nShould United fans get excited about future investment?\nLet’s see.\nEven though United are now part-owned by one of Britain’s richest men, Ratcliffe still has financial fair play (FFP) rules to keep in mind.\nThe Premier League’s FFP rules allow clubs to lose £105m over a rolling three-year period, providing those losses are filled by cash injections from the owners. If you breach that limit, you could be looking at a points deduction, as we have seen with Everton. But United have little to worry about there.\nThey were in this season’s Champions League, even if they only won one of the six group games, finished bottom of their four-team group and are now out of Europe altogether — and it is here that the new investors may want to pay close attention. Cost control will be ensured by UEFA’s new ‘squad cost rule’, which will (eventually) limit clubs to spending 70 per cent of their revenues on the wages of their players and coaches, but not the non-playing staff, as well as the cost of transfers and agents’ fees.\nIt’s something to keep in mind — particularly at a club with a less-than-stellar record when it comes to selling players for profit.\nGO DEEPER\nManchester United's lack of meaningful matches is damaging - and just feels weird\nWho is Sir Jim Ratcliffe?\nRatcliffe, 71, owns the petrochemicals giant INEOS, which says it comprises 36 businesses at 194 sites in 29 countries and has more than 26,000 employees.\nHis net worth, according to the Bloomberg Billionaires Index, is $13.6bn but the Sunday Times Rich List — an annual list compiled by the British newspaper — estimated him to be worth £29.6bn, making him the second-richest man in the UK. How much he is actually worth, however, is open to debate — as The Athletic’s Matt Slater outlined in October.\nAdvertisement\nRatcliffe describes himself as a boyhood United fan and says his favourite player was Cantona, who contributed to a video for Ratcliffe’s 70th birthday last year, along with David Beckham and Sir Alex Ferguson. However, he did attempt to purchase Chelsea when that club were for sale in 2022, as well as offering Barcelona president Joan Laporta “two or three billion” from INEOS for a 50 per cent stake in the current Spanish champions and a promise to never sell up.\nHe also told UK newspaper The Times in 2019 that he bought Nice rather than a Premier League club because “INEOS never wants to be the dumb money in town; never, never”, and said through a spokesperson in November 2022 that investing in his Ligue 1 side “would represent much better value for our investment than buying one of the top-tier Premier League clubs”. But little over a year on, here we are.\nRatcliffe is not averse to the occasional change of heart, then; a UK tax exile who backed Brexit, albeit a soft one, moved INEOS’ headquarters out of the UK and then back again, despite thinking the government’s stance on fracking is “pathetic”.\nHe grew up in Failsworth, a few miles from Manchester city centre, and then his family moved across the Pennines to Yorkshire, where he was enrolled at Beverley Grammar School, just north of Hull. He read chemical engineering at Birmingham University, then worked for Esso after graduation, before moving into private equity at Advent International.\nIn 1992, he co-founded chemicals firm Inspec, and six years later formed INEOS.\nHe also already owns two football teams: Nice, his other ‘local’ club — close to his home in the south of France, a few miles west of Monaco — and, since 2017, Lausanne-Sport in Switzerland.\nAnd it’s not just football: Ratcliffe owns one-third of the successful Mercedes F1 organisation; the INEOS Britannia sailing team, helmed by English multi-Olympic gold medallist Sir Ben Ainslie; and the INEOS Tour de France-winning cycling team.\nAdvertisement\n- Jim Ratcliffe: What Nice fans think of their owner\n- How has he done with his other clubs?\n- What kind of United owner would he be?\nHe also has a pub, The Grenadier in London’s affluent Belgravia; Lime Wood, a five-star hotel in the New Forest, Hampshire, near Southampton; Le Portetta, a ski resort in Courchevel, France; and two superyachts, named Hampshire and Hampshire II. Other assets include Belstaff, the clothing company.\n“There are very few things I have done where I have ended up losing,” he said in Grit, Rigour & Humour: The INEOS story, a book released to mark 25 years since the company was founded. “There are things we have tried at INEOS, some investments we have made, where we were not successful and it is not enjoyable.\n“Looking at Manchester United, my general view is that if we invest, even if the price tag is quite high, then in 10 years, not two years, we would probably be in a good place. I don’t think I am throwing my money away.”\nWhat is INEOS?\nINEOS is the fourth-largest chemical company in the world, and produces chemical and oil products used across industry and everyday life.\nIf you have used a product containing plastic, textiles, medicines or hygienics in recent years, chances are you have used something INEOS helped to manufacture. It also produces chemicals and compounds used in football, including plastic used in artificial grass, stadium construction, seats and goal nets, rubber and PVC used in the balls and plastics in players’ boots.\nRatcliffe has made his fortune out of spotting value in the market. INEOS is basically a conglomerate of businesses he bought between 1998 and 2008, which are still run in a relatively loose, federal style. In this regard, he is similar to Todd Boehly, the investor who, with his partners, ultimately won the Chelsea takeover contest.\nAt INEOS, he used high-yield debt to finance deals and started hoovering up unwanted operations from British Petroleum (BP).\nAdvertisement\nIn 1998, with a young family, Ratcliffe mortgaged his house and put all his money into the deal. “If it goes wrong, you’ve lost all your money and completely screwed up your career,” he told the UK’s Financial Times newspaper in 2014. What did his wife think? “She accepted it was a risk.”\nINEOS eventually bought Innovene, BP’s refining and petrochemical arm, in 2006, and in its first 10 years, completed more than 20 acquisitions. The strategy was relatively simple: take on debt to buy the asset, reduce the outgoings via cost savings and build it back up.\nWhen the global financial crash happened in 2008, INEOS struggled to deal with the sharp decline in oil prices and the company closed some factories. INEOS also broke a covenant and had to renegotiate debts with several banks at a cost of £804m. Ratcliffe asked the UK’s then Labour government for a short-term deferral of a VAT payment worth £350m, but the request was turned down.\nINEOS is also a major consumer of fossil fuels and, therefore, a significant generator of greenhouse gases such as carbon dioxide, and the company’s record on environmental concerns has often been questioned.\nOn its website, INEOS insists “sustainability is fundamental to how we do business”.\nOn the wall of the lift in the company’s headquarters in London, there is a giant compass covered with words and slogans “we like” in its northern half, and ones “we don’t like” in its southern half. In an attempt to explain the company’s DNA, “kids and sport”, “team players” and “work hard, play hard” are all in the northern half, as are “a beer” and “northerners”.\nIn Grit, Rigour & Humour, the company’s co-founder and chief financial officer John Reece is asked about its recent forays into more consumer-facing products, such as fashion, football and building 4×4 vehicles.\nAdvertisement\n“The logic was that we were very successful generating a lot of cash,” says Reece. “(But) you need to have a bit of fun — you can’t spend your whole life in chemicals.”\nHang on, can INEOS have stakes in multiple clubs?\n‘Yes’, is the short answer. INEOS only has a 25 per cent stake in United and Nice are not playing in Europe this season anyway after finishing ninth last year, so Ratcliffe can delay tricky questions about conflict of interest and multi-club ownership… for the time being.\nNice are performing much better domestically in this campaign and are in contention to qualify for next season’s Champions League, even though they have slipped behind Paris Saint-Germain in the title race having been top of the table in November.\nGO DEEPER\nDoes INEOS owning United and Nice mean only one could play in the Champions League?\nThe indications are, however, that Ratcliffe will be looking to sell the Ligue 1 side eventually, with a price of £80m mooted, but that depends on whether INEOS increases its stake in United.\nAdditional contributors: Matt Slater, Adam Crafton, Mark Critchley and Dan Sheldon\n(Top photos: Getty Images; design: Sam Richardson)",
  "word_count": 3044,
  "scraped_at": "2026-02-14T12:41:12.788739"
}