{
  "article_id": "c59583bc528b",
  "url": "https://dailynexus.com/2025-12-09/history-arrives-at-harder-uswnt-to-play-chile-at-ucsb/",
  "title": "History arrives at Harder : USWNT to play Chile at UCSB",
  "date": "20251209T210000Z",
  "domain": "dailynexus.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "UC Santa Barbara’s Harder Stadium is set for its biggest guest appearance in decades, and it’s arriving in red, white and blue. One of the most decorated women’s soccer teams in the world, the U.S. Women’s National Team will be competing at UC Santa Barbara, hosting the Chile national football team on Jan. 27 to close out their January training camp. The match, which will be kicking off at 7 p.m., is the first ever U.S. Women’s National Team international game being played on the Central Coast of California.\nThis matchup will be the conclusion to a two-game set that opens on Jan. 24 in a game against the Paraguay national football team at Dignity Health Sports Park. The match at UC Santa Barbara is only the second U.S. Women’s National Team (USWNT) game in four decades to be played in California outside the Los Angeles or Bay Area regions, making it one of the most significant sporting events hosted at UCSB in years.\nU.S. Head Coach Emma Hayes acknowledged what the Santa Barbara debut means for the national team and the community.\n“Playing in a city for the first time is not a common occurrence at this point in our history, so I know our players will enjoy being in beautiful Santa Barbara and our staff are really looking forward to January camp and these two matches against South American countries,” Hayes said. “This is the start of an important year for our team and as always, we’re focused on maximizing every minute we get with the players.”\nThis match represents a valuable combination of competition, history and visibility for the Gauchos and the surrounding Santa Barbara community. Chancellor Dennis Assanis emphasized the meaningfulness of the event for UCSB.\n“We are proud to host an event that will highlight competitive excellence, energize and bring our community together, showcase beautiful UC Santa Barbara, and celebrate the next generation of athletes and leaders. We look forward to a memorable experience at Harder Stadium for the campus and the greater Santa Barbara communities,” Assanis said.\nIn partnership with UCSB and U.S. Soccer, Visit Santa Barbara arranged to bring this soccer game to the Central Coast. Kathy Janega-Dykes, president and CEO of Visit Santa Barbara, cited the importance and excitement of the unique opportunity.\n“Sporting events generate meaningful economic impact within the community, as spectators traveling to the South Coast for the soccer match support a wide range of local businesses by shopping, eating at restaurants and staying in hotels, and in doing so help sustain local jobs,” Janega-Dykes said.\nWhile this contest at Harder Stadium will be the USWNT’s first official match in Santa Barbara, it is one of a deep-rooted history for UCSB. In 1991, before heading to the first ever FIFA Women’s World Cup in China which crowned USA as international champions, the team trained at UCSB, playing two exhibition games at Harder Stadium. One of these matches was against the top-five nationally ranked UCSB women’s soccer team which ended in USA winning 10-0, and the other was against a team of Southern California women’s all-stars who the USA squad also took victory over. Only weeks later, the team headed to China and took home their first FIFA World Cup victory. The USWNT later returned to Harder Stadium for training camp in 2019.\nUCSB’s connection with the USWNT runs even deeper through its ties to one of the team’s most iconic and historical figures, Carin Jennings-Gabarra. Jennings-Gabarra, who played at UCSB from 1983-86, is the program’s career leader with 102 goals and 60 assists, earning All-American honors during her time as a Gaucho.\nAfter cementing herself in the history books for UCSB, Jennings-Gabarra made history at the international level, leading USWNT to their first World Cup title in 1991 and being awarded the Golden Ball Award, an honor given to the most outstanding player in the competition.\nAnother valued campus heirloom of UCSB, Harder Stadium, holds a vast history and promising future. Often labeled as “soccer heaven,” the stadium has hosted a NCAA College Cup in 2010 and 2018, hosted an international match for the U.S. Men’s National Team in 1993 against Romania, welcomed a recent international friendly between Wrexham AFC and AFC Bournemouth in 2024 and will soon become the home of the United Soccer League One expansion club Santa Barbara Sky FC.\nUCSB athletics director Kelly Barsky captured the significance of bringing this event to Harder Stadium.\n“Bringing the U.S. Women’s National Team to Harder Stadium means more than just hosting a match,” Barsky said. “It’s a celebration of connection, community and excellence … It doesn’t get any bigger and more special.”\nChile is currently ranked at 45th in the world while the USA is ranked second. This will only be their fourth time meeting the U.S., as their most recent encounter came in the 2019 FIFA Women’s World Cup, where the USWNT came out victorious with a 3-0 win in Paris.\nThe presale for these matches will begin on Wednesday, Dec. 10, at 10 a.m. PST and run to Friday, Dec. 12, at 8 a.m. PST. Tickets for both matches will go on sale to the public on Friday, Dec. 12, at 10 a.m. PST.\nFor students, the historical occasion comes with a perk. In coordination with U.S. Soccer, UCSB is providing 500 discounted tickets listed at $20. These tickets will be made available on Dec. 11, at 10 a.m. Faculty and staff will also receive early presale access.\nWith UCSB students, the Santa Barbara community and fans traveling to attend and see the USWNT, Harder Stadium is set to provide a night built upon history, community and must-see soccer.",
  "word_count": 943,
  "scraped_at": "2026-02-14T12:50:44.896706"
}