{
  "article_id": "c5d3ff133616",
  "url": "https://www.newsdakota.com/2023/09/19/with-waldorf-departure-timeline-tightens-for-vcsu/",
  "title": "With Waldorf Departure , Timeline Tightens for VCSU",
  "date": "20230920T003000Z",
  "domain": "newsdakota.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "VALLEY CITY, ND (NewsDakota.com) In collegiate sport, reality for one party changes based on another party being accepted by a third party.\nThat reality played out this week for Valley City State University.\nThe North Star Athletic Association was given it’s window of time left as a football conference Monday when Waldorf University announced it’s departure for the Great Plains Athletic Conference.\nAll schools in the NSAA have had to examine their futures with a two-year timeline, due to the closure of Iowa Wesleyan and Presentation College last year. The NAIA had agreed to that timeline, granting the remaining five-team league a waiver for an automatic qualifier for the playoffs. Conferences need six teams to receive an automatic bid.\nDakota State had reportedly considered Division II membership, based on a $48 million dollar capital campaign to improve their facilities and vacancies in the Northern Sun Intercollegiate Conference.\nDickinson State, sitting on the border of a fully-funded, mostly stable Frontier Conference based largely in Montana, has had an escape route for some time. Waldorf, fitting the charter requirements of the GPAC as a private, faith-based university, found a geographical home that suits them, albeit in a conference that will lend them few favors of a competitive nature.\nFor the Vikings, the two-year window has been reduced to little more than two months, according to head football coach, and athletic director, Dennis McCulloch.\n“Basically, by the first of the year, we need to have something we can put on a schedule. So, we kind of have a couple of months. For recruits, it matters constantly. No matter what option we go with, we need something sooner rather than later,” says McCulloch.\nFinances and geography both play a factor in VCSU having no slam-dunk option that jumps off the page. Joining the Frontier Conference makes sense, but travel to places like Oregon and Arizona costs money and time. Changing affiliations requires partners, and being independent complicates post-season opportunities.\n“Every option is on the table,” McCulloch stated Tuesday. “We’re now having to have conversations with schools to find out what the reality is of where they are, how they are funded, and how things work for them to find the right option for us.”\nSo, which option makes the most sense?\nOption 1: The Frontier Conference\nViking fans are well acquainted with the Frontier Conference. A handful of football playoff scrapes with Carroll College are in recent memory, and names like Montana Tech, Rocky Mountain College, and MontanaState-Northern are familiar to fans that have followed some of the old conference rivals during those rivals’ non-conference affairs before jumping into a Dakota Athletic Conference, or NDCAC, season.\nPros: The conference seems stable. It’s well established, and it wants to expand. They’ve strongly courted Dickinson State in the past, and, during the dissolution of the DAC, plans were in place for divisions within the league to accommodate some travel. The blueprint is there.\nCons: Ashland, Oregon, the home of Southern Oregon University, is 1,610 miles from Valley City. Glendale, Arizona, the home of Arizona Christian University, is 1,619 miles from Valley City.\nMcCulloch estimates it may cost around $100,000 in extra travel costs to be a part of the Frontier Conference on a regular basis. While the Vikings could pursue only a football membership arrangement (the NSAA still has Bellevue and Viterbo for other sports, forming a league large enough for an automatic bid to various playoffs), the Frontier Conference is interested in full membership.\nAnd, if Dickinson State joins the frontier, they may go as a full member, leaving the NSAA short for those other sports.\nOption 2: NAIA Independent\nIt wasn’t long ago that VCSU was independent. In between the DAC and NSAA years, there was a time where the Vikings played the ratings game. Be in the top 20, and the football team receives a bid; be the top-rated team in the Association of Independent Institutions and get a basketball bid. It worked, to some degree. There were some national tournament berths in basketball, and a heck of a game between Valley City State and Azusa Pacific (now NCAA Division II) at the FargoDome that meant a playoff spot.\nPros: No long-term commitments. You can breathe, see the landscape develop, and make a more informed decision when the dust settles.\nCons: Explaining qualifying for the playoffs to recruits in this scenario is a challenge, and the last thing anyone wants when meeting with a recruit is to give an answer to a question that causes eyes to glaze over. Forming a football schedule is extremely challenging, as most leagues have locked in games, and you have none to start a year.\nThe Vikings could hybrid this plan with a scheduling alliance with another conference around them, but that conference has to want to enter into that agreement, and it’s never stable when two-year game contracts expire.\nOption 3: Become an NCAA Division III university\nThere are a couple of conferences in Minnesota the Vikings are just as familiar with as they are with the Frontier Conference. Valley City State and Concordia, from the Minnesota Intercollegiate Athletic Conference, have played a few times. The Vikings have had battles with College of St. Olaf as well.\nAlso in the mix is the Upper Midwest Athletic Conference, featuring Crown College, Martin Luther, and Minnesota-Morris, names, and places, Viking fans have seen before.\nPros: Geography fits well. In the time that it took VCSU to drive to Rapid City for their game with South Dakota Mines the first weekend of September, they would find most of their league in either one of the Division III conferences in Minnesota. With the UMAC only featuring six football playing schools, they may readily accept new membership.\nCons: Division III means no scholarships, athletically anyway. There are still ways to get athletes to campus, and there’s a long-simmering debate if DIII is really devoid of scholarships.\nFormer Viking men’s basketball coach Jeff Kaminsky, who coached in the Division III Wisconsin Intercollegiate Athletic Conference before coming to Valley City State, addressed this issue upon arrival. When asked about the desire to come to Valley City State from Wisconsin, he told KOVC Radio, “I came because whenever I was about to sign a player, someone out here would offer them a scholarship.”\nApparently, the scholarship still means something to recruits.\nOption 4: Move to NCAA Division II affiliation\nThe original Dakota Athletic Conference had 10 teams. Huron University closed. Of the nine other teams in the league, four of them, the University of Mary, Minot State, Black Hills State, and South Dakota Mines, are Division II, and a fifth, the University of Jamestown, has asked to join the party.\nDakota State has reportedly been in conversation also.\nGone are the days of NDSU and UND tearing their way through the North Central Conference. The teams left in Division II are not that far ahead of VCSU.\nThe Vikings lost to South Dakota Mines two weeks ago 31-14. The game was within 10 until late, and the Vikings turned the ball over inside the five, as well as dropped a potential touchdown pass. Mines was 6-3 last year in the Rocky Mountain Athletic Conference, a conference that produced the national Division II runner-up that same season.\nIn these conversations, geography means something. Bill Chaves, the athletic director of the University of North Dakota expressed this when asked about UND’s journey as the late mover to Division I after their area rivals had made the jump.\n“In some ways, geography may have meant even more than just being Division I. When your schools in the Dakotas are moving, and it makes sense, moving along with them seems like the right thing to do. External forces play a large role in this, and there are far more things out of your control than are under your control,” said Chaves of UND’s eventual move to the Summit League and Missouri Valley Football Conference.\nBut is Division II attainable financially?\nThe NCAA requires that a Division II institution sponsor 10 sports. Indoor track and field, and outdoor track and field, count as separate sports if both have at least four contests that a school participates in. With that arrangement in place, the Vikings sponsor 14 sports.\nNCAA Division II membership requires some dedicated personnel, specifically, a full-time compliance officer, an athletic director that doesn’t coach, and other personnel in the athletic department.\nValley City State has someone fully versed in compliance in the form of Dave Bass. However, the Vikings recently combined their football coaching position and athletic director job. They would have to again split those positions, and make at least one hire or promotion for women’s athletics in the department to be Division II compliant.\nFinally, the NCAA mandates that Division II schools meet one of three scholarship minimums: half of the Division II maximum allowable in four specific sports, 20 fully-funded scholarships in the department (which can be split among several players to reach the threshold), 10 of which must be for women’s athletics, or $250,000 in total aid, $125,000 of which must go to women.\nThe numbers are large, but there is not an inexpensive option to be found.\n“No matter what we do, it’s going to cost some money,” said McCulloch, referring to a choice between putting resources into scholarships to make Division II compliance or the extra $100,000 estimated for travel to the Frontier Conference, an option many would regard as the easiest option.\nBut McCulloch felt attaining Division II compliance was possible for Valley City State. “We need to talk to those that have done it, like Minot State, a state school that transitioned to Division II from NAIA. What’s real versus what we’ve heard, so we know that piece of it,” he explained.\nThe final challenge for Division II membership is the conference affiliation. Here, geography matters. With the University of Jamestown approaching the NSIC, Dakota State possibly considering the option, and four other schools in the western Dakotas already in the Northern Sun, there would be the possibility of luring them away from their current affiliations and approaching the NCAA for provisional status as a new Division II conference.\nNCAA bylaws mandate that any new conferences must include 10 teams, and their conference membership is provisional, meaning they would not be playoff eligible for three years. For Valley City State, the University of Jamestown, and Dakota State, that may not be an issue, as they would be making the transition.\nHowever, to get to 10 teams, the new conference would likely have to contain a member, or multiple members, that have made the transition already, are playoff eligible, and would then choose to temporarily forego playoff eligibility for the benefits of a new conference. That would be a tough pill for committed athletes to swallow, and, in the age of the transfer portal, it could have the effect of landing an institution in transition mode for the second time.\nChaves said those kinds of decisions for schools become a “micro versus macro” decision. “The short term matters, and you’re making the best decision that you can in the moment, but also trying to make the best decision for 15 or 20 years down the road. The move might cost something, but does it lead to something better long-term? That the question you’re trying to answer,” said Chaves, reflecting on how UND made their way to the Great West Conference and the Big Sky to be eventually reunited with their natural rivals in Fargo, Brookings, and Vermillion.\nThe future for the Vikings is certainly unclear, but the timeline is very clear. Valley City State University football has seven conference games left, and what is, right now, a blank schedule for 2024.\nThe next two months could ripple through the Viking athletic department, and the region, for decades to come.",
  "word_count": 1979,
  "scraped_at": "2026-02-14T13:09:24.271079"
}