{
  "article_id": "c5d331b17509",
  "url": "https://www.wbrz.com/news/spare-notes-new-site-to-watch-the-clash",
  "title": "SPARE NOTES : New site to watch The Clash",
  "date": "20250916T030000Z",
  "domain": "wbrz.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "SPARE NOTES: New site to watch The Clash\nBATON ROUGE - For the last several years, FOX Sports would run a PBA bowling exhibition on one of the Sundays that they only aired one NFL game with the show to either run before or after the scheduled football game in various parts of the country.\nWith the end of the FOX contract, that will take a little different route this year. Last year, the broadcast featured the clash among all the champions of the PBA League Bowler Certification National Championships which involved some name professionals with champions in youth, adult and senior divisions.\nLike most of the shows, which in years past featured fun formats and a couple of times the celebrity shootouts that the PBA had for several years, the ratings were usually very strong with football on the same viewing channel.\nThis year, you are going to have to do a little searching for The Clash when it comes up on Saturday, Sept. 27 at 3:30 p.m. CT. The eight champions from the 2025 PBA LBC National Champions will meet at Thunderbowl Lanes in Allen Park, Michigan and the event will be carried on the PBA You Tube Champion.\nThe winner will receive “The Duke,” the trophy named for PBA legend Norm Duke.\nThis is part of the new world we will have to get used to as we move into 2026 with bowling on TV going to be dropped into 10 weeks on the CW and the World Series of Bowling on CBS/CBS Sports Network.\nOne would expect that the Masters, the US Open, the Tournament of Champions and the Players Championship will take up at least four of those weeks on CW. Not sure what events will be featured on the other six weeks as things have been very quiet. We will keep you posted.\nTrending News\nHave to admit I missed the Elias Cup team competition this past season, but the event which turned Portland, Maine into an eclectic bowling mecca known around the country, was not able to be fitted into the final year of FOX Sports’ contract because the event would have normally occurred after the contract expired in the spring.\nThe PBA’s attempt at team bowling with the two handers versus one handers and battle of the brands was really dull (that’s maybe not the right term, but it just lacked the excitement). But hopefully there is a point that something in Portland can be brought back to that venue.\nCollege Bowling Begins Soon\nWe are just a few weeks away from the start of the college bowling seasons and the 2025-26 wraparound season for the NCAA Women’s teams. Southern, Grambling, Louisiana Tech, Tulane are all involved in NCAA collegiate women’s bowling and there has been success for many of the schools.\nSouthern’s women have won a couple of regular season titles in the last few years and has been very close to another NCAA bid, while Louisiana Tech did advance to the NCAA Regional round a year ago.\nThere is a good chance you will see the national champion bowl in this state before the year is over as the Conference USA Bowling Championship will again be decided in Harahan at Colonial Lanes.\nBack with you next Monday and until then good luck and good bowling,\nKent Lowe",
  "word_count": 557,
  "scraped_at": "2026-02-14T12:36:54.095489"
}