{
  "article_id": "c5dec7b3b78e",
  "url": "https://hoganstand.com/County/National/Article/Index/328085",
  "title": "  If I go back home to Ireland , Id love to play with my club team again  ",
  "date": "20230610T110000Z",
  "domain": "hoganstand.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Liverpool captain Niamh Fahey.\nBy Daire Walsh\nIt is close to a decade since she first started embracing the life of a professional athlete, but Republic of Ireland international Niamh Fahey hasn’t ruled out the prospect of returning to a Gaelic football pitch at some point in the future.\nA TG4 All-Ireland senior football championship winner with her native Galway in 2004 under the tutelage of PJ Fahy, the Killannin woman switched regularly between inter-county ladies football and soccer before sealing a move to Women’s Super League outfit Arsenal in 2008.\nShe was naturally drawn to Gaelic sports, with her brothers Gary and Richie, as well as her distant cousin Kevin Walsh, having been part of the Galway men’s teams that won All-Ireland senior titles in 1998 and 2001.\nDespite eventually drifting away from the Tribeswomen upon joining forces with Arsenal, she kept one foot in the LGFA by lining out for the Parnell’s club in London - with whom she won an All-Ireland intermediate title in 2012.\nA transfer to Chelsea in the winter of 2014 saw her taking up soccer on a full-time basis for the first time, however, and she went on to spend a single season with Bordeaux in France before transferring to her current employers Liverpool in 2018. The 35-year-old doesn’t have any grandiose plans for a potential comeback to Ladies Football, with plenty still left in the tank from a soccer perspective, but Killannin is a club that remains close to her heart.\n“Obviously if I go back home to Ireland, I’d love to play with my club team again. Beyond that, I don’t have many lofty ambitions past that, really. I would have always said, as the years go on, you’re still in the UK and you’re still playing professionally and at a high level. I try not to think too far down the line,” Fahey acknowledged.\n“I’m happy now with where I’m at and if I ever do go back to Ireland of course I’d like to kick around, but it will probably be the over I don’t know what age category at that stage! We’ll see how my body is and all the rest of it.”\nAlthough she has collected an astonishing 16 winners’ medals across three different English clubs, Fahey will — all things going well — realise a long-held ambition later on this summer.\nA senior debutant for the Republic of Ireland as far back as March 2007, she picked up her 105th cap last October when the women’s national team defeated Scotland in a crunch play-off encounter at Hampden Park in Glasgow to qualify for their first ever major tournament — the FIFA Women’s World Cup that is set to get underway in Australia and New Zealand in a matter of weeks.\nA persistent injury saw her missing out on the three friendlies that Vera Pauw’s charges have played thus far in 2023, but Fahey returned to captain Liverpool in their final two games of the Women’s Super League season. With Ireland set to face co-hosts Australia in front of 80,000 plus spectators on July 20 in Sydney, she will be doing everything within her power to ensure she makes Pauw’s final selection for the tournament later this month.\n“The whole reason I started playing in the first place was to be able to represent my country. It’s the main reason as well that the desire to continue my career has been there. To always try and play for Ireland, and hopefully qualify for a major tournament. We’ve done that as well, so it’s a dream come through really. To be able to go down there and play in a World Cup for Ireland.\n“They’ve had to move the fixture (against Australia) to a bigger capacity stadium because of the interest and the quick sell out. That’s really cool and obviously a massive occasion to be involved in the opening game against the hosts and everything else that comes with that.\n“I don’t think anyone was unhappy when Australia was drawn out for the first game and for us to be versus Australia. I think everyone was definitely excited about that one.”\nHaving captained a Galway team that included future Ireland women's rugby international Claire Molloy to an All-Ireland minor football title in 2005, Fahey’s leadership skills were evident from a young age.\nHer experience with Ireland made her an ideal candidate to take over as skipper of Liverpool FC Women in August 2020 and when the Reds claimed the English Championship at the end of the 2021/22 season, it was an added bonus on top of what was already a big honour for Fahey.\n“I was very proud to be made captain. It’s a big responsibility, but there’s a great dressing room of girls there as well. There was plenty of experience along the way and it’s definitely a collective effort. It’s something I’m very proud of, being a childhood Liverpool fan. To be able to captain the team is something really special.”\nBetween Laura Harvey, Shelly Kerr (both Arsenal), Vicky Jepson (Liverpool) and Emma Hayes (Chelsea) at club level, and Sue Ronan and Pauw on the international stage, Fahey has become accustomed to playing under female managers in women’s soccer.\nHer former team-mate Fiona Wynne has taken a similar step in ladies football with the Annaghdown stalwart currently serving as joint-manager alongside Mághnus Breathnach of the Galway seniors. Following defeats to Kerry and Mayo in the Lidl National Football League Division One and TG4 Connacht Senior Football Championship finals respectively, they will be hoping to make a big impact in the Brendan Martin Cup with the westerners set to face Cork and Tipperary in Group Four of the All-Ireland series over the next fortnight.\nAs someone who still keeps a close eye on their progress, Fahey remains hopeful the current crop can match the heroics of her 2004 side.\n“I’ve always kept an eye on the Galway ladies team. I’m a big supporter of them as well. We’ve been close in recent years. Contested All-Irelands and league finals. It would be great to see Galway win another All-Ireland. There’s a lot of talent in the county as well. You never know,” Fahey said.\n“The league final result wasn’t great, it didn’t go our way and a bit of a rocky start to the championship, but it’s a young team as well. Hopefully they can turn it around and you never know. It’s a funny game at times. You hit form and anything can happen.”\nTweet",
  "word_count": 1089,
  "scraped_at": "2026-02-14T12:14:47.044622"
}