{
  "article_id": "c5e32e828ca0",
  "url": "https://pina.com.fj/2023/06/15/fifa-announces-womens-world-cup-2023-will-be-live-and-free-for-pacific-viewers/?doing_wp_cron=1718749950.1275210380554199218750",
  "title": "FIFA announces Women World Cup 2023 will be live and free for Pacific viewers",
  "date": "20240618T224500Z",
  "domain": "pina.com.fj",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "FIFA has awarded free-to-air rights to next month’s FIFA Women’s World Cup 2023 in Australia and Aotearoa New Zealand to 24 free-to-air broadcasters in the Pacific Islands.\nCook Islands, Solomon Islands, Kiribati, Federation States of Micronesia, Nauru, Niue, Palau, Samoa, Tonga, Tuvalu, Vanuatu, French Polynesia, New Caledonia, Wallis and Futuna, Fiji, Papua New Guinea and American Samoa will all have the tournament distributed through Pacific Cooperation Broadcasting Limited.It will ensure that at least one match per day will be available for free in each of these territories.\nFIFA Chief Women’s Football Officer, Sarai Bareman, said: “We are delighted to work with Pacific Cooperation Broadcasting Limited to ensure that all fans across the Pacific region can follow the matches live from the FIFA Women’s World Cup Australia & New Zealand 2023.\n“This is the first time the tournament will be taking place in Oceania, so it is a great opportunity for football fans of all ages to be inspired by the greatest names in our sport, competing in women’s football’s premier competition, in a time zone where they can watch all the action unfold in the early to late evening.”\nThe FIFA Women’s World Cup Australia & New Zealand 2023 kicks off on 20 July, with co-hosts New Zealand playing Norway in Auckland/Tāmaki Makaurau. This is the first time the FIFA Women’s World Cup will be played across two countries, while it is also the first to feature 32 teams.\nSince its inception in 1991, the FIFA Women’s World Cup has grown exponentially to claim the crown of the most-watched single-sport event for women globally. The most recent edition in France, 2019, attracted a record audience of over 1.1 billion viewers and smashed domestic viewing figures in many territories.\nThrough the sale of media rights for its football tournaments, FIFA generates income which is essential to support and develop football around the world. FIFA offers eight Women’s Football Development Programmes to its 211 Member Associations globally.\nSOURCE: OFC/PACNEWS",
  "word_count": 327,
  "scraped_at": "2026-02-14T12:32:47.076004"
}