{
  "article_id": "c5fc003b4187",
  "url": "https://heavy.com/entertainment/real-housewives/fans-beg-real-housewives-star-to-switch-franchises/",
  "title": "Real Housewives Fans Want Heather Dubrow to Join RHOBH",
  "date": "20240902T113000Z",
  "domain": "heavy.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Bravo fans think “The Real Housewives of Beverly Hills” should add someone new to the cast, but the person they’re eyeing isn’t new to Bravo fans.\nOn August 31, Sutton Stracke posted for a chummy Instagram photo with RHOBH “friend” Kathy Hilton and “Real Housewives of Orange County” star Heather Dubrow. The trio gathered for an event for Stracke’s brand and store The Sutton Concept.\nFans reacted to the photo of the unexpected threesome in the comment section, and they liked what they saw. Some fans suggested that Dubrow should transfer from the O.C. to RHOBH.\nRHOBH Fans Think Heather Dubrow Is Too ‘Classy’ For RHOC\nIn the photo, the three friends posed in front of a faux fireplace setup with a “Sutton” sign hanging above it. “It’s the best having friends who support!” Stracke captioned the post. “Thank you @kathyhilton @heatherdubrow and all for coming out to celebrate @thesuttonconcept and our growing ventures with @suttonbrands. May the fashion and fun continue!”\n“Now this is a trio! ?” one fan commented.\n“We need Heather on RHOBH,” wrote another.\n“Yes, we do!!!! She’s too classy for O.C ,” another chimed in.\n“Come on Heather, just be on the RHOBH already!!!“ another pleaded.\nAnother fan wrote that Dubrow was a “much better fit for RHOBH” than RHOC. “Yes. Much better quality of women,” added another.\nDubrow had some issues with her cast mates during the 18th season of “The Real Housewives of Orange County.” She previously told Decider that she didn’t think her co-star Emily Simpson wanted her to “succeed,” based on her confessional comments. “The glee with which it was all said, it was very disturbing to me,” Dubrow said of Simpson.\nHeather Dubrow Previously Talked About Joining RHOBH\nRHOC season 18 cast\nDubrow first appeared on RHOC in season 7 in 2012 then took a break after five seasons. She returned as a main cast member starting in season 16.\nIn 2022, Dubrow and her husband Dr. Terry Dubrow sold their massive Newport Beach mansion and purchased a penthouse in the Beverly Hills area. At the time, many fans thought she was eyeing a spot on “The Real Housewives of Beverly Hills.”\nDubrow set the record straight in a 2023 interview with The Wrap. “So we didn’t actually move there. We bought a place there and that’s supposed to be a place for me and Terry to live someday, like when the kids leave,” she explained. “We are actually still living in Orange County. Our kids go to school there.”\nBut Dubrow said “never say never” when asked if she would consider joining RHOBH in the future, telling the outlet that “all things are possible.”\nSutton Stracke.\nWhile Dubrow has yet to show up on RHOBH, Stracke made a cameo on RHOC. In a season 18 episode, “Red Flags and Flag Football,” Stracke went out to lunch with Gina Kirschenheiter and Katie Ginella. In a confessional, Kirschenheiter revealed that her former husband used to work with Stracke’s ex-husband Christian, and that’s how they met.\n“I know Sutton because Sutton’s ex-husband is the president of the mutual fund company where Matt formerly worked,” the RHOC star revealed.",
  "word_count": 526,
  "scraped_at": "2026-02-14T13:15:05.206940"
}