{
  "article_id": "c5fd847f33fe",
  "url": "https://www.theguardian.com/world/2026/feb/11/wednesday-briefing-why-the-debate-over-working-from-home-says-more-about-inequality-than-productivity",
  "title": "Wednesday briefing : Why the debate over working from home says more about inequality than productivity",
  "date": "20260211T083000Z",
  "domain": "theguardian.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Good morning. Ever conscious of what makes an attention-grabbing soundbite, this week Nigel Farage reiterated that his Reform UK party would seek to end people working from home, saying Britain needed “an attitudinal change to hard work, rather than work-life balance”. People are not more productive working from home, he claimed, but work better in person.\nEmployees – and many employers – appear unconvinced. Since the Covid lockdowns of 2020 and 2021, flexible working has been widely promoted by recruiters as a way to attract and retain staff, and is consistently linked to higher employee satisfaction. But access to it is far from universal: lower-paid workers and those in the most deprived areas remain the least likely to be able to work flexibly at all.\nFor today’s newsletter, I spoke to Guardian business reporter Joanna Partridge to understand how widespread hybrid working is, what the evidence shows about its benefits and drawbacks, and why the way we work has become yet another culture war battleground. First, the headlines.\nFive big stories\n-\nUK politics | Allies of Wes Streeting expect him to try to challenge Keir Starmer’s leadership within weeks, despite the health secretary insisting he backs the prime minister and is not intending to move against him, the Guardian has been told.\n-\nUK news | A police counter-terrorism unit is leading the inquiry into the stabbing of two boys aged 13 and 12 at a school in north-west London. A 13-year-old had been arrested on suspicion of attempted murder.\n-\nAntisemitism | Antisemitic incidents increased sharply in the UK after the deadly attack on a Manchester synagogue on the holiest day of the Jewish year, according to an organisation that provides security to British Jews.\n-\nCanada | Nine people have been killed after an assailant opened fire at a school in western Canada, in one of the deadliest mass shootings in the country’s history. The suspect was later found dead from what appeared to be a self-inflicted injury.\n-\nMedia | The BBC World Service will run out of funding in just seven weeks with no future deal with the government currently in place, the corporation’s director general, Tim Davie, has warned.\nIn depth: ‘Hybrid working remains out of reach for people in lower-skilled jobs’\nArguments over working from home often generate more heat than light, and Joanna is keen to ground it in what has actually happened since the pandemic. While there has been plenty of noise about a supposed nationwide “return to the office”, she says the reality is far less dramatic: hybrid working has settled into a steady pattern for a significant minority of workers, rather than continuing to expand or collapse back to pre-Covid norms.\nAt the same time, Joanna stresses that any discussion of hybrid working needs to start with who it applies to. The data, she says, is consistent and clear: access to flexibility is concentrated among professional, urban and higher-paid workers, while many others have never had the option at all. That imbalance, she argues, is central to understanding both the appeal of hybrid working and the political backlash against it.\nHow many people are working in a hybrid way?\nLet’s start with the numbers. A House of Commons Library research paper published late last year found that in October 2025, 27% of workers in Great Britain were working in some form of hybrid arrangement, with a further 13% working fully remotely.\nThat proportion has now levelled off, Joanna says. “Hybrid has become the new normal for that part of the workforce, and I don’t think that’s likely to change in the post-pandemic era.”\nBut she is quick to add an important caveat. “Whenever we talk about this topic, you always have to make clear that it’s mainly office workers and professional people – people based in big cities, often with a degree. Hybrid working remains out of reach for people in lower-skilled and lower-paid jobs, and all the data points that way.”\nAccess, in other words, is sharply unequal. As Joanna puts it, “you are much more likely to enjoy some hybrid working if you earn more”, and she tells me she uses the word enjoy “advisedly”.\n“Lots of people have worked in a hybrid way since the pandemic, got a taste for it, and seen that it gives them more time for caring responsibilities, hobbies or sport, helps their wellbeing, and saves money by not commuting.”\nWhat are the advantages claimed for flexible working?\nA House of Lords committee report published in November 2025 concluded that hybrid working can offer “the best of both worlds”, helping with recruitment and retention while preserving collaboration and learning. But it also warned that the benefits are unevenly distributed, and that poorly managed arrangements can create new challenges for teams and managers.\n“One thing that really came out of that report,” Joanna says, “was that hybrid and flexible working could help get more disabled people, or people with long-term health conditions, into the workforce”. That is something the current government has been aiming for.\nThat point was echoed by the Liberal Democrat peer Lady Scott, who chaired the committee. She said increased flexibility could be “especially beneficial to people with disabilities and to parents or carers”, and urged the government to support remote and hybrid working with clearer guidance and better data.\nWhy has working from home become a culture war issue?\nWhether it is Nigel Farage dismissing home working productivity claims as “a load of nonsense”, or Jacob Rees-Mogg leaving passive-aggressive notes on civil servants’ desks, working from home has taken on a symbolic role far beyond its practical impact.\nJoanna says the political charge around the issue reflects who has – and has not – benefited from the shift. “The people least likely to be able to work remotely are in industries like retail, construction and hospitality,” she says, adding that workers in the most deprived areas are also far less likely to have any access to home working at all.\nFor critics, remote work is framed as an elite, London-centric perk enjoyed by professionals at the expense of frontline workers who never had the option. That framing taps into broader political divides about class, geography and values – and makes hybrid working an obvious target regardless of what any evidence says.\nSupporters, meanwhile, see attacks on flexible working as nostalgia for rigid hierarchies and presenteeism, and as a failure to acknowledge how work and family life have changed since the pandemic. As Joanna puts it, if hybrid working had genuinely undermined productivity, “there would be far more companies that had returned to five-day office mandates”.\nEmployers, however, may not need much encouragement from the likes of Farage to tighten policies. Writing recently in HR Director, Matt Russell, the chief executive of work benefits provider Epassi UK, said more than a quarter of businesses had increased office-attendance requirements in the past year. Workers are increasingly aware of the shift, he wrote – but far less enthusiastic. Fewer than half say they would comply with a full-time return, with women and parents the least willing, “perhaps unsurprising given rising childcare costs”.\nWho benefits – and who is left out?\nJoanna notes that flexibility has become one of the most powerful tools employers have to attract and retain staff. “Work-life balance is the biggest lever for retention,” she says, citing the Randstad international recruitment surveys showing that while pay matters most when people accept jobs, flexibility is often the reason they stay. About a third of workers say they have left a role that does not fit with their personal lives.\nThose arguments pre-date Covid. In 2020, with guidance published weeks before the first UK national lockdown, the Chartered Management Institute (CMI) urged employers to judge performance on output rather than “face time”, arguing that flexible working could improve productivity while reducing stress.\nThe CMI also suggested that well-designed flexibility could help narrow the gender pay gap, by enabling women to remain in skilled roles and progress even if they could not work a traditional full-time week, or by enabling men to work flexibly and take more of a share of caring duties. Joanna cautions, too, that hybrid working is not a simple win for everyone who has access to it: younger workers and new starters can lose out on informal learning, mentoring and visibility if hybrid arrangements are poorly designed.\nWhat about productivity?\nThe irony is not lost on me that I sketched out this newsletter at home in less time than it would have taken me to commute into the office. I didn’t feel unproductive. But I am also squarely within the demographic for whom hybrid working works best and has the most access to it.\nThat highly personal experience does align with some broader evidence. “I’ve not really come across any great, reliable data that can show one way or the other exactly how productivity is impacted,” Joanna says. “But anecdotally, from employers as well as employees, productivity mostly seems to stay the same when people work from home for at least some of the week.”\nAs she puts it, if hybrid working had truly damaged performance, “there would be far more companies that had returned to a pre-pandemic five-day office mandate”. Those that have insisted on what she describes as “bums back on seats five days a week” remain outliers.\n“When this becomes a talking point for people like Nigel Farage or Jacob Rees-Mogg,” she adds, “the argument is that if people are working from home they aren’t working hard – ‘shirking from home’, as they’d say. But the evidence doesn’t really back that up.”\nHybrid working has neither transformed Britain’s economy nor solved its inequalities. But nor is it the indulgent fiction its critics suggest. It is simply another reflection of how power, flexibility and opportunity remain unevenly distributed.\nWhat else we’ve been reading\n-\nAI is making a growing number of writing and editing jobs obsolete. These sensitive interviews with women who have been forced to retrain are moving to read. Aamna\n-\nAs a kid in Walthamstow, going to the local greyhound racing was a treat, with no idea of the welfare issues behind the scenes. Nick Harland goes to a dog night in Sheffield to find out if the industry can – or should – survive. Martin\n-\nFirst there was method acting, now there’s method dressing. Emma Beddington’s roundup of actors hitting the promo circuit in outfits inspired by their roles will give you a good chuckle. Aamna\n-\nPeople are excited to see it, but also slightly baffled as to how one European robin has taken up residence in a neighbourhood in Montréal. Martin\n-\nAlexander Hurst’s analysis on the French National plans for culture – less contemporary art, more funding to preserve colonial heritage – serves as an important warning for those of us bracing for far right electoral gains. Aamna\nSport\nWinter Olympics | The Great Britain Olympic team suffered their third heartbreak in the space of 24 hours after the mixed doubles curling team of Bruce Mouat and Jen Dodds lost their bronze medal match to Italy 5-3. The wait for a first medal goes on but the camp believe they have several aces still to play.\nFootball | Benjamin Sesko salvaged a 1-1 draw for Manchester United at West Ham, bringing an end to Michael Carrick’s winning streak as head coach. Tottenham boss Thomas Frank believes he will retain the support of the club’s owners despite calls for him to be sacked after a 2-1 defeat to Newcastle.\nCricket | Pakistan are poised to fulfil their T20 World Cup fixture against India on Sunday, having previously been instructed by their government to boycott the game in a move that could have cost the sport millions.\nThe front pages\nThe Guardian leads with “Streeting still intent on deposing PM despite united front, say allies”. The Financial Times says “Allies admit Starmer is too ‘weak’ to sack Streeting after coup speculation”. The Times reports “Mandelson investigation will go back to Blair era”. The i has “Starmer’s ex-No 10 spin doctor loses Labour whip over link to sex offender”.\nThe Mail reports “Teen held for ‘terror stabbing’ of boys, 12 and 13 in class”. The Telegraph has “Terror probe into school stabbing”, while the Mirror looks at a seperate knife attack with “Leo was gentle and kind … the heartbreak will never end”. Finally the Sun leads with “I was destroyed by Strictly”.\nToday in Focus\nWhy Jeff Bezos gutted the Washington Post\nHundreds of jobs have gone at the newspaper that broke the Watergate scandal. Was profit or politics behind the decision? Jeremy Barr reports.\nCartoon of the day | Ella Baron\nThe Upside\nA bit of good news to remind you that the world’s not all bad\nUefa estimates that up to 60% of kits worn by players are destroyed at the end of the season, contributing to the estimated one billion football shirts in circulation globally.\nWomen are leading this reinvention with a movement of designers and fans hoping to reverse this trend by creatively upcycling old kits. Designer and creative director Hattie Crowther completely transforms them into one-of-a-kind headpieces as part of her “Soft Armour” project. Many of the project’s customers are also women who want something that’s more their style than a baggy football shirt.\nDesigners Renata Brenha and Christelle Kocher, along with brands (re)boot and Rose Ojo, have reworked shirts into everything from dresses to puffer jackets. Clothing store Vintage Threads also offers a rework service, transforming old football shirts into new, custom pieces, such as a shirred top or a leather football jacket.\nSign up here for a weekly roundup of The Upside, sent to you every Sunday\nBored at work?\nAnd finally, the Guardian’s puzzles are here to keep you entertained throughout the day. Until tomorrow.",
  "word_count": 2313,
  "scraped_at": "2026-02-14T12:13:23.041028"
}