{
  "article_id": "c608b00b0182",
  "url": "https://www.reporterherald.com/2025/05/03/university-of-northern-colorado-athletic-teams-to-host-summer-camps/",
  "title": "Multiple University of Northern Colorado athletic teams hosting summer camps",
  "date": "20250503T140000Z",
  "domain": "reporterherald.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Summer is quickly approaching, and spending time at a summer camp can be a fun and productive experience for young athletes when they are out of school.\nUniversity of Northern Colorado athletic programs and coaches are running multiple camps again this summer, and those camps are geared toward school-age students.\nBasketball, soccer, swimming, volleyball and wrestling are among the UNC programs hosting camps in the coming weeks. June and July are busy months for the Bears coaches.\nMen’s basketball\nBears head coach Steve Smiley is running three camps in June: a player development camp June 2-4, an elite camp for boys June 7 and a shooting and scoring camp June 9-11.\n• June 2-4: Player Development Camp. 9 a.m. to noon for co-ed ages 6-16 years old. Cost: $174.50 ($165 plus $9.50 fee) and includes a T-shirt and an official camp basketball. Registration deadline: June 1.\nThe camp will focus on instruction and skill development in all phases of the game: ball handling, passing, shooting, moving without the ball, defense and teamwork. The athletes will also participate in a variety of games and competitions.\nPlayers may attend the player development and shooting and scoring camps (June 9-11) for $290.\n• June 9-11: Shooting and Scoring Camp. 9 a.m. to 1 p.m. for co-ed ages 6-16. Cost: $200.50 ($190 plus $10.50 fee) and includes a T-shirt and an official camp basketball. Registration deadline: June 8.\nThe shooting and scoring camp will focus on the fundamentals of those skills in the game. The game will break down the components of shooting the basketball and work on a variety of drills to help master the right techniques. The sessions will also cover footwork in taking good shots and how to get open for high percentage shots.\nThe camps will be held at Bank of Colorado Arena at the University of Northern Colorado.\nFor registration, go to stevesmileybasketballcamps.com.\nFor questions or for more information, contact the UNC men’s basketball office at 970-351-2983 or email dondrale.campbell@unco.edu.\nWomen’s basketball\nHead coach Kristen Mattio will run five camps from early June through early August. All the camps are led by Mattio and the UNC women’s basketball coaching staff.\n• June 2-4: Individual Skills Camp. 1-4 p.m. for players entering kindergarten through 12th grade. Cost: $174.50 ($165 plus $9.50 fee). Campers will be grouped by age and skill level. Each camper receives a free basketball and T-shirt.\nThe camp will teach the fundamentals of the game through drills and games. The instruction will focus on shooting, ball handling, passing, screening, defense and rebounding. Campers will compete in free throw, hot shot and 1-on-1 contests.\n• June 16-17: Shooting and Scoring Academy. 9 a.m. to 4 p.m. (8:30 a.m. check-in) for players entering kindergarten through 12th grade. Cost: $227 ($215 plus $12 fee) for commuters and $290.50 ($275 plus $15.50 fee) for overnight. Campers will be grouped by age and skill level. Each camper receives a free basketball and T-shirt.\nThe academy is designed to teach fundamentals of shooting, and to develop guard and inside play. The camp will help athletes refine footwork and technique for shooting and cover positional breakdowns.\n• June 18 and Aug. 1: Elite Camps. 9:30 a.m. to 4 p.m. for girls in 9th-12th grades. Cost: $116.50 ($110 plus $6.50 fee). Lunch and a reversible jersey will be provided.\nThe elite camps are designed for players who want to play at the collegiate level. The sessions include individual and positional skill work, competitive practice drills, film with UNC coaches and small-sided and 5-on-5 games.\n• June 19-21: High School Team Camp. For players entering 9th-12th grades. Cost: $870.50 for commuter team ($825 plus $45.50 fee). $274.50 per overnight resident ($260 plus $14.50 fee). T-shirt included.\nThe team camp is a chance for high school teams to play and compete during the offseason. Games are guaranteed against appropriate competition in a high school, junior varsity and freshman division. Teams must be at least seven players and a maximum of 15 players.\nThe camps will be held at Bank of Colorado Arena at the University of Northern Colorado.\nFor registration and more information, go to kristenmattiobasketballcamps.com.\nFootball\nThe Bears program, working with The Arc of Northeast Colorado, and other athletes and coaches from the UNC Athletic Department, will again operate its No Limits Camp.\nThe goal of the free camp is to unite the special needs community of Northern Colorado with UNC football for a day of inclusivity and joy. Peers are welcome to attend, but space is limited and priority will be given to individuals with disability, according to The Arc’s social media.\n• June 19: 9-11:15 a.m. at Nottingham Field on the UNC campus. Check-in begins at 8:30 a.m. The camp is open to participants from kindergarten to 21 years old.\nThe participants will visit sport stations from 9-10:30 a.m. Football games begin at 10:45 a.m.\nFor more information, or to register for the camp, go to forms.gle/5RhQyCThyiC5NvqA8\nThe Arc of Northeast Colorado is available at arcneco.org or by phone, 970-353-5219.\nSoccer\nTim Barrera’s soccer program will run two different camps in May, June and July. The Bears have college ID camps in late May and late July. In early June, UNC will run the week-long youth day camp.\n• May 30-31 and July 25-26: College ID camps. Girls ages 14-21.\n5-8 p.m. May 30 and 9 a.m. to noon May 31.\n5-8 p.m. July 25 and 9 a.m. to noon July 26.\nCost: $185 plus convenience fee. T-shirt included.\nThe college ID camps are open to any and all entrants. They are limited to the first 40 players. Campers are responsible for their own housing and meals.\n• June 2-6: Youth Day Camp. For boys and girls ages 6-13. Cost: $225 for full-day camp and $125 for a half day. T-shirt included. An online convenience fee will be added.\nThe full-day camp will run from 9 a.m. to 3 p.m. Monday-Thursday and 9:00 to 11:45 a.m. Friday.\nThe half-day camp runs from 9-11:45 a.m. Monday-Friday.\nThe youth day camp is open to the first 100 campers. Campers are responsible for bringing their own lunch.\nFor registration and more information, go to uncbearssoccer.com.\nThe camps will be held at Jackson Soccer Stadium, 19th Street and 8th Avenue in Greeley.\nSwimming\nBears coach Lisa Ebeling and her staff will host technique and training camps in June at the Butler-Hancock Athletic Center pool.\n• June 9-13: Technique Camp #1 and Training Camp. June 16-20: Technique Camp #2.\nTechnique Camps are for ages 8-18. Cost: $475 ($25 fee) for half-day camper; $555 ($30 fee) for day camper; $685 ($35 fee) for residential/overnight camper.\nThe focus of the technique camps is on in-depth analysis of all four strokes, and the technique for starts and turns. Campers will learn skills and drills used by Olympians and NCAA champions to maximize efficiency in the water. Underwater and overwater video feedback and one-on-one instruction is provided.\nThe Training Camp is for ages 12-18. $555 ($30 fee) for day camper; $685 ($35 fee) for residential/overnight camper.\nIn the training camp, swimmers will learn high-altitude training — in the water and on dry land — while also receiving technical feedback from coaches in a fun and motivational environment. Sport topics such as recovery, race preparation and mental training will also be covered.\nFor more information, or to register for a camp, go to: uncswimmingcamps.com.\nVolleyball\nUNC coach Lyndsey Oates will host nine camps or clinics starting in early June and running through late July.\n• June 1: College Prep Camp. Noon to 3 p.m. for athletes entering 9th-12th grades. Cost: $28 ($25 plus $3 fee).\nRegistration deadline: May 31.\nThe camp will focus on advanced skills and will include 6-on-6 team drills. The camp is geared toward players who hope to play in college.\n• July 14: Back Row Skills Clinic. 9 a.m. to 4 p.m. for athletes entering 3rd grade and older. Cost: $121.04 ($115 plus $6.04 fee). Lunch included. Registration deadline: July 13.\nThe clinic will focus on serving, passing and back row defense for all levels.\n• July 14: Serving Skills Clinic. 4:30-6:30 p.m. for athletes entering 3rd grade and older. Cost: $53 ($50 plus $3 fee).\nRegistration deadline: July 13.\nThe clinic will focus only on serving. The clinic is for players who are trying to get their serve over the net — to athletes who want to advance and improve their serves.\n• July 15: Front Row Skills Clinic. 9 a.m. to 4 p.m. for athletes entering 3rd grade and older. Cost: $121.04 ($115 plus $6.04). Lunch included. Registration deadline: July 14.\nThis clinic will focus on attacking and blocking.\n• July 15: Setting Clinic. 9 a.m. to 4 p.m. for athletes entering 3rd grade and older. Cost: $121.04 ($115 plus $6.04). Lunch included.\nRegistration deadline: July 14.\nThe clinic is for all levels, but is recommended for middle and high school athletes.\nAthletes must choose the front row skills clinic or the setting clinic — but not both.\n• July 16-18: 3-Day Skills Camp for athletes entering 3rd grade and up. Tentative schedule: 9 a.m. to 8 p.m. July 16-17 and 9 a.m. to noon July 18.\nCost: $499.94 ($475 plus $24.94 fee) for overnight; $368.38 ($350 plus $18.38 fee) for commuters.\nThe camp will focus on all skills and includes 6 v. 6 team drills. The camp is intended for beginners through advanced players. Athletes will be grouped on a court by age and skill level.\n• July 21: Prospect Clinic. 2-5 p.m. for athletes entering 9th-12th grades. Cost: $28 ($25 plus $3 fee).\nRegistration deadline: July 20.\nThe camp is geared to athletes who want to play in college. Training will focus on advanced skills and includes 6 v. 6 team drills. Campers will be grouped on the court by skill level.\n• July 21-23: Commuter Clinic. 9 a.m. to noon for athletes entering 1st grade and up.\nCost: $157.88 ($150 plus $7.88 fee).\nRegistration deadline: July 20.\nThe camp will focus on skills and includes 6 v. 6 team drills. The camp is intended for beginners through advanced players. The athletes will be grouped on court by age and skill level.\n• July 24-26: Team Camp. First-round begins at 11 a.m. July 24.\nCost: $473.63 per team ($450 plus $23.63 fee). Four divisions of competition with a guaranteed minimum of 11 matches.\nRegistration deadline: July 22.\nThe goal of the team camp is to offer the best high school competition before the fall season.\nAll camps will be held at Bank of Colorado Arena and the UNC Recreation Center Auxiliary Gym.\nFor registration and more information, go to uncbearsvolleyball.com.\nWrestling\nBears coach Troy Nickerson is running three camps from June 23-27.\n• June 23-26: 4-Day Team Camp. Recommended for athletes entering eighth grade this fall and older. Check-in: 10 a.m. to noon June 23. Checkout: 10 a.m. to noon June 26.\nCost: $350 resident; $250 commuter (lunch and dinner); $160 commuter (no meals).\nCamp will teach high school wrestlers skills and techniques through competition and training sessions. Teams will wrestle a minimum of five dual meets per day. The overall goal of the camp is to help teams get ahead for next season.\n• June 23-June 27: 5-Day Girls Camp. All ages.\nCheck-in: 12:30-2:30 p.m. June 23. Checkout: 11:45 a.m. to 1:30 p.m. June 27.\nCost: $529 resident; $429 commuter (with meals); $350 commuter (no meals).\nThe goal of the girls camp is to help the athletes develop technical skills and to provide a bonding experience with other girls wrestlers. The campers will participate in drills, skills, live wrestling and conditioning.\n• June 23-27: 5-Day Individual Camp. All ages.\nCheck-in: 12:30-2:30 p.m. June 23. Checkout: 11:45 a.m. to 1:30 p.m. June 27.\nCost: $529 resident; $429 commuter; $350 commuter (no meals).\nThe camp is designed for wrestlers of all experience levels who are looking for skills and techniques through instruction and live wrestling. The goal of the camp is to improve technical and tactical skills.\nFor more information, or to register for a camp, go to northerncoloradowrestlingcamps.com.",
  "word_count": 2012,
  "scraped_at": "2026-02-14T13:44:21.931963"
}