{
  "article_id": "c62a3fe93b85",
  "url": "https://www.yahoo.com/entertainment/tom-samie-still-together-love-211141986.html",
  "title": "Are Tom & Samie Still Together ? How The  Love Island  united kingdom Stars Were Greeted By Their Families & A Surprise Co - Star On Their Homecoming",
  "date": "20230321T140000Z",
  "domain": "yahoo.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Are Tom & Samie Still Together? How The ‘Love Island’ UK Stars Were Greeted By Their Families & A Surprise Co-Star On Their Homecoming\nIf you’ve watched Love Island UK Winter Season, you might be wondering: Are Tom and Samie still together from Love Island UK season 9?\nLove Island UK, which is the original Love Island, premiered in 2005 on ITV, but it wasn’t until it was rebooted in 2015 for ITV2 that it became the reality TV dating show we know and love today. Since it was rebooted in 2015, Love Island UK has aired nine seasons and led to dozens of international spinoffs in countries like the United States, Australia, South Africa and Spain.\nMore from StyleCaster\nThe show, which is one of the highest rated series in the UK, has also led to real-life marriages and babies for couples who met as contestants such as season 2’s Cara De La Hoyde and Nathan Massey, who are married and share two children, and season 3’s Camilla Thurlow and Jamie Jewitt, who welcomed a baby in 2020.\nTom and Samie was a favorite among the season finale of Love Island. In their first impressions of each other, Samie said, “He had really lovely eyes and was cheeky.” The couple ended up as one of the finalists for the show, but how did they end up after the season finale?\nClick here to read the full article.\nAre Tom and Samie still together from Love Island UK season 9? Read more to find out.\nAre Tom and Samie still together after Love Island UK season 9?\nAre Tom and Samie still together from Love Island? It seems like it! After placing third on the reality show, the two went home and were surprised by family and a former co-star. On March 17, the couple was surprised when they came into a house to see their family and friends welcoming them home with large T&S light-up letters in the entryway. Co-star Claudia Fogarty also posted about the couple’s homecoming. She posted on her Instagram stories, “Surprise @samieelishi @tomclare I wouldn’t miss your coming home party for the world. Love you both so much and so proud of you.”\nTom also posted the following morning on his Instagram stories to answer whether he had made things official with Samie yet, confirming that while not yet, she will be his girlfriend soon. “Samie will be my girlfriend very soon. We are very private people and it’s something that we would make just us two but yeah, she’ll be my girlfriend 100%.”\nThe duo headed to a private mountainside restaurant in a classic red Ferrari, driven by Tom for their final date. Tom referred to it as “the best day of his life.” He told her, “We are in it together, we have got each other…there is no one I’d rather walk out that door with. I feel like I’ve met that person that I’ve been looking for. I feel like the feelings I’ve got for you feel so natural and nice, it is not easy for me to say, I’ll just be straight up, I can’t lie, I am falling in love with you.”\nMore in Entertainment\nWhoopi Goldberg struggles to sit at “The View” table during painful discussion: 'I'm out'\nTom’s mom also gushed about her son’s appearance on the show to ITV. “We’ve loved watching him and not missed a night – all of us couldn’t wait for 9pm!” She continued, “Samie seems like a lovely girl and we are all looking forward to meeting her and getting to know her more. I just hope that she likes football!”\nTom Clare is a 23-year-old footballer from Skelmersdale in Lancashire. He plays for non-league Macclesfield FC and was the team’s top scorer from the 2021/2022 season. He has been granted an “extended period of leave” to appear on the show, with the club saying that Tom had expressed an “unwavering desire” to return after the show.\nSamie Elishi is a 22-year-old senior estate agent coordinator from London. She is a self-professed “honest person” with “no filter”, and shared that she won’t be going down without a fight when it comes to an Islander she has her eye on. Sami said, “I won’t take rubbish from anyone, especially when it comes to guys!”\nHow does Love Island UK work?\nIf you’re new to the series, here’s how Love Island works: The show starts with 10 or so singles who are invited to a villa on a tropical island with the hopes of finding love. Within moments of meeting each other, the contestants must couple up. As couples, the contestants are required to sleep in the same bed and complete challenges with each other, such as a classic Love Island game where they have to transfer food from their mouth to their partner’s. As the season continues, more contestants are invited to the villa, and islanders already there have to make a choice about whether to stay with their current partner or couple up with someone new.\nEach week, there’s a re-coupling and the contestants who aren’t in a couple are sent home. In the end, the public votes for their favorite couple among the finalists, and the winner receives a cash prize. On Love Island UK, that prize is 50,000 pounds. However, the money doesn’t go to both members of the couple. It goes to one person at random. That person must then decide whether to share the money with their partner or keep it for themselves.\nWhere is Love Island UK filmed?\nWhere is Love Island UK season filmed? All seasons of Love Island UK have been filmed in Sant Llorenç des Cardassar, Mallorca, in Spain, aside from season 6 and season 9, which were filmed in Constantia, Cape Town, in South Africa. Unlike the previous seasons, season 8 was filmed in a new villa in Mallorca. The season 7 villa—which was first used in season 5 in 2019—is located on the Spanish Balearic Island of Majorca, in Sant Llorenç des Cardassar on the east side of the island. The villa included a super-sized hot tub, infinity pool, outdoor kitchen and terrace. In total, there were 73 cameras in the villa, which are placed near areas like the pool, the kitchen and the communal bathroom. The villa also has hidden microphones to catch what contestants say. The house also has a “beach hut,” where contestants can speak to the camera in private. Fans can also stay in the villa, however, it will cost £3,000 for a week, according to The Sun.\nWho is the Love Island UK season 9 host?\nWho is the Love Island UK season 9 host? Television and radio presenter Maya Jama is the Love Island UK season 9 host. ITV announced in October 2022 that Jama would replace Laura Whitmore, who left as the Love Island UK host after season 8. “I’ve always been such a massive Love Island fan and I’m so excited to be hosting one of the nation’s favourite shows! I can’t wait to get into the Villa to meet all of the Islanders,” Jama said in a statement at the time.\n“Finding a new host to follow the wonderful Laura Whitmore was never going to be easy. In Maya Jama though, we have another high-profile fan of the show who’ll be a great addition to the Love Island family. Cool, charming and charismatic, I speak for us all when I say Maya will also bring a unique presenting style to the show, as did Laura and, of course, the very much missed Caroline Flack. We’re very pleased to have her on board,” Paul Mortimer, Director of Reality Programming at ITV2, added in a statement.\nJama is an English television and radio host and DJ, who is best known for hosting BBC One’s Peter Crouch: Save Our Summer in 2020 and BBC Three’s Glow Up: Britain’s Next Make-Up Star since season 3. Jama also hosted 4Music’s Trending Live! from 2015 to 2017, ITV’s Cannoball in 2017, and MTV’s True Love or True Lies in 2018. She also hosted the first season of Channel 4’s The Circle. As for radio, Jama hosted Rinse FM’s #DriveWithMaya from 2014 to 2017 and BBC Radio 1’s Maya Jama from 2018 to 2020. She also co-hosted the stations Radio 1’s Greatest Hits.\nWhitmore reacted to news Jama was the new host of Love Island UK in a comment on the show’s Instagram post announcing Jama in October 2022. “Yes girl!! So delighted for you! You’re gonna be fab,” Whitmore commented at the time with a a red heart emoji.\nIn an inteview with The Sunday Times in January 2023, Jama claimed that her young age prevented her from being hired as Love Island UK‘s host sooner. “Once you start doing TV, you meet a lot of producers through different shows, and the heads will be aware of talent. That’s weird to call yourself talent, isn’t it? I talk for a living. It’s not exactly tap dancing everywhere or performing a ballad,” she said. “So I think I’ve always been in their eyeline, but I was super young when the presenter shifts were happening in the past. They knew about me but I was always a bit too young, and obviously, there were previous hosts anyway.”\nIn a press release for Love Island UK season 9, Jama revealed how she learned she’d be the new Love Island UK host. “I was in New York. The first person I told was my best friend in Bristol. She wore loads,” she said. She continued, “I celebrated with different people each time. I celebrated with who I was around when I found out, then I celebrated when I got back to London. I feel like I’ll celebrate more after it’s done, then we can be like, ‘Yay we did it!’ rather than getting too excited before it’s happened.”\nJama also revealed what she loved about Love Island UK as a viewer. “I’ve been a fan for years. It was my first reality show, other than Big Brother, that I made sure I was back at a certain time to watch and all my friends and family were speaking out,” she said. “Everybody gets involved, everyone has opinions – from the older people in your family to the younger ones. It’s just fun, it’s fun to see how people play out in different situations and wonder what you would do if you were in the same position. Most of us have had a bit of a holiday romance before and it’s like watching that on telly.”\nJama also explained what she thinks makes a good islander. “Someone that’s looking for love, someone with a lively personality, somebody who is open and shares their feelings, but also someone that’s not afraid to keep their options open and test the waters. Just someone that’s willing to get stuck in and get fully involved in every bit of the experience and all the challenges. Make the most of it!” she said. “And allow it to be a proper test and see if your relationship can carry through that, rather than play it safe. I think that’s what makes the best islander.”\nWho is the Love Island UK season 9 narrator?\nWho is the Love Island UK season 9 narrator? The Love Island UK season narrator is Iain Stirling who has narrated the show since season 1. He is also married to former Love Island UK host Laura Whitford and also narrates Love Island US. In an interview with GQ in 2021, Stirling opened up about how his experience on Love Island UK has changed over the years. “In previous years, it might have been, ‘Redo this joke, please,'” he said. “That’s pretty uncommon these days because the producers trust us more [laughs]. Me and Mark, my writing partner — he works for ITV Studios in development and he’s the guy who actually came up with the Love Island format, 50-year-old Scottish vegetarian, really interesting guy — we’ve just really got the tone down. We’ve also just started asking them beforehand, like, ‘Can we say this?’ Saves us a lot of time. Now, it’s things like, ‘Can you say these people’s names in a different order because they’re sat on a bed in this order?'”\nHe also told the magazine about how he knew Love Island UK would be a success from the first episode. “God’s honest truth — the very first coupling. When I saw the footage of the very first, original coupling on Season 1, I was like, ‘This is unbelievable,'” he said. “I couldn’t believe how much I cared about everyone instantly. The first time a boy came down and they said, ‘Step forward if you like him,’ and no one stepped forward I was like ‘I can’t not watch this, it’s madness.'”\nHe continued, “Especially then, they were all such characters. Like there was this girl, Hannah, who was from Liverpool — and for an American, now that is a fuckin’ linguistic journey. Her accent was unbelievable. And she was a former Playboy bunny, and she had this insane swimsuit on, and had had a lot of work done. There’s a big thing with women in Liverpool, Scouse girls, on a Saturday you walk around a mall in Liverpool, every woman has got rollers in her hair, getting ready for a night out. She just had this massive blow dry, her hair was huge, platinum blonde, and she had these glass heels on. A builder from Essex got coupled up with her. I was just like, ‘I love this.’ I loved it. I honestly loved it.”\nDespite his witty narrations, Stirling also told GQ that he would “never” hurt contestants on purpose. “No, never. We were never told to make fun of the show. [Mark and I] figured that out ourselves. We just thought, if we make fun of the show first, other people can’t really,” he said. “Also, the only reason it works is because the show’s actually quite good. Like with making fun of the dates, the Islanders can be at a rubbish table or whatever with plastic champagne glasses, but they still have to be on quite a nice beach.”\nHe continued, “If they were just in someone’s shitty backyard and it looked terrible, and I said ‘that’s terrible,’ it’s not funny. It has to come from a point of actually being quite good. If the show ever actually gets bad, we are in a difficult position, because it’s not comedy if you’re just saying something’s bad that is bad. I think self-deprecation is also a very British thing. I’s very British to say, ‘This is bad. Isn’t that funny?’ You’ve got to say ‘I’m shit,’ and then everyone will go ‘Oh yeah, I’m shit as well.’ That’s what Love Island does really well.”\nIn an interview with The Arizona Central, Stirling explained how narrating the U.S. version of Love Island is different from the U.K. “I think the hardest thing will be the language,” he said. “I don’t even know what you call it if someone mugs someone off. I don’t even know what you’d say. What do you call that in America when a boy is mugging you off?” He continued, “(Phrases) like ‘mugged off’ weren’t a thing before “Love Island.” So hopefully America will get to invent, sort of, their own vernacular and come up with our own little phrases and make it feel unique to them, do you know what I mean? I would love to get an American (version of) … mugged off, et cetera. So we’ll see how it goes.\nThough the slang is different, Stirling also confirmed that he’s up-to-date on American references—for the most part. “I think — and I’m sure Americans do know this — but literally, like, half of our news feed is American news, American politics. If you go to the politics section of the BBC website, half of it will be U.S. politics,” he said. “Culturally, I think, we’re sort of all right. All the TV shows, I sort of get. The sports, I don’t understand. I don’t get that. Basketball is cool. But why is soccer not the best sport? It’s mad; it’s the best game. It’s so good.”\nHe also told The Arizona Central about what it’s like to narrate Love Island US and UK at the same time. “It’s a bit wild, and I’m very fortunate because the people at Peacock are sort of, like, very aware of how full-on it is, and they’ve done everything to make it possible that I can do this and sort of do things like, you know, sleep and see my family and eat, things like that. Everything’s in LA for the American show, apart from the writing team,” he said. “We’ve basically got two huts next to each other, and me and Mark (Busk-Cowley) will write the British one. And then the second we finish recording that, we go into the American room — I was going to say office, but that makes it sound too good — and go inside the American box. We’ll help those guys write what they’ve written so far and sort of let them know things we would and wouldn’t say. And also we learn stuff, like Americans don’t know what grafting is! I found this out today.”\nLove Island UK is available to stream on ITV2 with a VPN. Here’s how to watch it for free.\nWatch ‘Love Island UK’ in US With… $0+\nOur mission at STYLECASTER is to bring style to the people, and we only feature products we think you’ll love as much as we do. Please note that if you purchase something by clicking on a link within this story, we may receive a small commission of the sale.\nOur mission at STYLECASTER is to bring style to the people, and we only feature products we think you’ll love as much as we do. Please note that if you purchase something by clicking on a link within this story, we may receive a small commission from the sale.\nBest of StyleCaster",
  "word_count": 3032,
  "scraped_at": "2026-02-14T13:07:30.934426"
}