{
  "article_id": "c641165cd3ca",
  "url": "https://www.justarsenal.com/rosa-kafaji-is-destined-to-light-up-emirates-stadium-with-arsenal-women/376069",
  "title": "Rosa Kafaji is destined to light up Emirates Stadium with Arsenal Women",
  "date": "20240917T113000Z",
  "domain": "justarsenal.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Rosa Kafaji is undoubtedly destined for greatness. Every time she’s spoken of, you just get the impression she’s a player who’s going to light up the Emirates Stadium with Arsenal Women.\nJonas Eidevall, like Tottenham Hotspurs women’s coach, Robert Vilahamn, (who coached her at BK Hacken), has labelled her as the next best player in women’s football.\nIn a recent conversation with Sky Sports the Arsenal boss provided additional insight into why Kafaji is unique. Before committing to moving to North London, the Swedish tactician says Kafaji asked to be allowed to “do the extras,” a request he believes exemplifies her desire to be the best.\nFor him, Kafaji is unique; she brings a unique element to his team, and he is confident that he and his technical bench will work tirelessly to guide her as she pursues her potential.\nEidevall said: “Her first question when we spoke about coming to Arsenal was ‘am I allowed to do extras?’, because all she thinks about is ‘how do I get better with the ball and develop?’\n“She adds something different than we have in the squad, and that’s exciting. We can help her taking steps tactically and physically to adapt her game to an even higher level.”\nKafaji showed flashes of brilliance in the opportunities she got in pre-season. In the UEFA Women’s Champions League round 1 qualifiers, Eidevall didn’t really use her; he only gave her a 21-minute cameo versus Rangers. Even so, he might be keen to gradually ease her into his team.\nOn Wednesday, as Arsenal face her former club BK Hacken in the UEFA women’s Champions round 2 qualifiers, it would be intriguing to see if Jonas Eidevall uses her as a secret weapon in that clash.\nShe should be a very exciting player to watch, huh Gooners?\nMichelle M\nFollow JustArsenal’s Gooner Women on Just Gooner Women on Twitter for regular updates on the Arsenal Womens Team!\nDo you want to read more about the Arsenal Women’s Team? Click here….",
  "word_count": 334,
  "scraped_at": "2026-02-14T12:48:19.907102"
}