{
  "article_id": "c64b5e9db734",
  "url": "https://www.espn.com/soccer/united-states-nwsl/story/4848794/four-nwsl-coaches-get-lifetime-ban-after-sexual-harassment-investigation",
  "title": "Four NWSL coaches get lifetime ban after sexual harassment investigation",
  "date": "20230109T223000Z",
  "domain": "espn.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Four former NWSL coaches, Paul Riley, Christy Holly, Rory Dames and Richie Burke, were permanently banned from all participation in the league on Monday as commissioner Jessica Berman handed down discipline based on last month's joint investigative report between the league and the players' union.\nThis joint NWSL/NWSLPA investigation followed a report in The Athletic in 2021 that detailed allegations of sexual harassment and coercion from 2015 made against former Portland Thorns manager Riley as well as other allegations of misconduct, including that of former Chicago Red Stars manager Dames, who was among those found to have verbally and emotionally abused players.\nIn 2021, five male head coaches were either fired or forced to resign as a result of non-soccer reasons, including alleged sexual misconduct, verbal abuse, racist remarks and perpetuating a toxic work culture. A sixth team terminated its general manager.\nThe joint investigation detailed in new light the transgressions that took place with the North Carolina Courage, Houston Dash, OL Reign, Orlando Pride and NY/NJ Gotham FC. An investigation released in October 2022 that was led by former U.S. Deputy Attorney General Sally Yates, on behalf of the U.S. Soccer Federation, had similar findings.\n\"The league will continue to prioritize implementing and enhancing the policies, programs and systems that put the health and safety of our players first,\" Berman said in a news release.\nThe league also handed down two-year employment bans to former Utah Royals FC coach Craig Harrington and former Gotham GM Alyse LaHue and further conditioned their re-employment post-ban.\nThe NWSL Players Association called the steps taken by the league \"critical\" and added in a statement Monday: \"Today, the NWSL announced disciplinary sanctions for Clubs and individuals who committed or enabled misconduct since the league began in 2013. This marks a critical step towards holding clubs and team leaders accountable for their actions, or inactions, that compromised and betrayed player safety.\n\"People in positions of power who have perpetrated harm on Players have been relieved of their duties, banned from the League, suspended or fined.\"\nTwo coaches, James Clarkson, of the Houston Dash, and Amanda Cromwell. of the Orlando Pride, were suspended earlier in 2022 at the recommendation of investigators and can return to the league once they participate in training and demonstrate a commitment to correcting behavior, the league said in a news release.\nThe return to league employment for former OL Reign coach Farid Benstiti, Orlando Pride assistant coach Sam Greene and goalkeeper coach Aline Reis was conditioned on the same criteria as Clarkson's and Cromwell's. The same corrective action was also mandated for Vera Pauw, former Houston Dash coach and current Ireland women's team manager.\nThe league also handed down stiff financial penalties and a requirement of systemic changes to the Chicago Red Stars in the amount of $1.5m, a $1m fine to the Portland Thorns, as well as citing its own league office. Both Portland and Chicago are in the process of being sold, the league noted in the statement.\nRacing Louisville, North Carolina Courage, OL Reign and Gotham FC were also ordered to pay fines.\n\"Our league and clubs are committed to making these changes and will do so with continued input from the NWSL Players Association to make the NWSL a league that sets the standard for the future of sports,\" Berman said.",
  "word_count": 554,
  "scraped_at": "2026-02-14T12:14:30.335501"
}