{
  "article_id": "c66bb2c31f2f",
  "url": "https://www.on3.com/teams/kentucky-wildcats/news/ksr-today-ole-miss-prep-football-recruiting-headline-the-start-of-a-new-week/",
  "title": "KSR Today : Ole Miss prep , football recruiting headline the start of a new week",
  "date": "20230130T190000Z",
  "domain": "on3.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "KSR Today: Ole Miss prep, football recruiting headline the start of a new week\nWe begin this new workweek out of a busy sports weekend where on Saturday we saw Rupp Arena at its best only for Kentucky Basketball to suffer a defeat to Kansas, while Kentucky Football entertained several of its favorite targets on the recruiting board.\nThen on Sunday, Kentucky Women’s Basketball bounced back and the Super Bowl matchup was set with the Eagles’ victory in the NFC Championship before the Chiefs finally got the better of Joe Burrow and the Cincinnati Bengals, winning a thriller in the AFC’s title fight in Arrow-head Stadium. Sorry, Bengals fans. Some of those third-down whistles were suspect.\nNow it’s Monday morning and we have to get ready for the Rebels…\nKT Turner to preview the trip to Ole Miss\nIt is KT Turner’s turn to host the pregame press conference at the team’s practice facility as the Wildcats get ready to travel down to Oxford to play Ole Miss. We will hear from Kentucky’s first-year assistant coach in the Monday morning press conference before Monday’s pre-Ole Miss practice in Lexington. Turner will take questions about what went wrong versus Kansas and what Kentucky will need to do to get back in the win column at The Pavilion.\nYou can watch that conversation and read the stories that come from it later this afternoon here on Kentucky-Sports-Radio-dot-com. In the meantime, we move on and wait for Turner’s appearance.\nJohn Calipari’s call-in show is Wednesday\nWe won’t get John Calipari’s thoughts on Ole Miss because his weekly call-in show is delayed until Wednesday this week. So, you will need something else to do at 6 pm tonight when you would normally listen to Calipari, Tom Leach, and Bob in Jamestown.\nAnother week without Kentucky in the Top 25\nThe Wildcats needed to sweep Vanderbilt and Kansas to crack this week’s update to the Associated Press Top 25, so expect another week of the AP and USA Today Coaches rankings without Kentucky’s inclusion among the best teams in the country.\nLast week, UK received the 14th-most votes outside of the Top 25 for an unofficial No. 39 ranking nationally.\nMonday’s NET Rankings\nOver in the NCAA’s NET Rankings, Kentucky begins the week ranked No. 36 in the field with a 14-7 overall record and only one Quad 1 win (the game at Tennessee) on the tournament resume. Tennessee is up at second, Kansas at eighth, and tomorrow night’s opponent, Ole Miss, is ranked No. 144 with one Quad 1 win (Florida Atlantic).\nSEC Storied’s “Southern Hoops: A History of SEC Basketball” premieres tonight\nSet your DVR or make sure you’re in front of a TV for tonight’s premiere of “Southern Hoops: A History of SEC Basketball” on the SEC Network. The seven-part SEC Storied docuseries chronicles the history of the league with an early emphasis on Adolph Rupp and his first national championship at Kentucky in 1948.\nEpisode one of seven of “Southern Hoops: A History of SEC Basketball” airs tonight at 9 pm with new episodes to follow each Monday through March 13.\nTop 10\n- 1Breaking\nFB commit\nIn-state star picks UK over UofL\n- 2New\nStaff Predictions\nfor UK vs. Florida\n- 3Breaking\n13-2\nUK Baseball Wins Opener\n- 4\nUK-UF spread\nCats a big underdog\n- 5New\nEye-Opening Addition\nto UK Football Staff\nGet the Daily On3 Newsletter in your inbox every morning\nBy clicking \"Subscribe to Newsletter\", I agree to On3's Privacy Notice, Terms, and use of my personal information described therein.\nHere, a trailer and more details:\nKentucky Women’s Basketball smoked Missouri on Sunday\nOn Sunday, the Kentucky women picked up a second conference win with a 23-point rout of the Missouri Tigers in Memorial Coliseum. Four players reached double-figure scoring for the home team, including Jada Walker’s team-high 18 points in the victory. Blair Green (14), Maddie Scherr (13), and Robyn Benton (13) joined Walker with team-bests in scoring.\nIt was a big recruiting weekend for Kentucky Football\nAll of Big Blue Nation’s eyes were on Rupp Arena for Kentucky’s game against Kansas on Saturday, but Kentucky Football had a gigantic weekend in the shadows. It was one of the biggest recruiting weekends of the entire year as the program hosted many of its top Class of 2024 targets as part of its annual Junior Day. In-town quarterback Cutter Boley and new commit Hayes Johnson were spotted with several of their recruiting classmates around the basketball game. Ryan Montgomery is another quarterback target who made the trip to Lexington.\nWe’ll have plenty more Junior Day news to come plus a video recap of the 15 Club’s Fan Fest.\nNational Signing Day is Wednesday\nWhat’s left of Kentucky Football’s 2023 recruiting class will be complete on Wednesday when the unsigned players make their commitments official with letters of intent on National Signing Day. Kentucky signed 23 players in the early December signing period (17 high school seniors, six transfers) and before the week’s over, Mark Stoops hopes to add one or two more.\nOne player to watch is Kendrick Gilbert, who was in Lexington over the weekend to take one last look at Kentucky Football. Kentucky is still in the hunt for the four-star prospect.\nWoo Spencer is another who could join the mix in Lexington.\nDane Key and Barion Brown to meet fans at KSBar and Grille\nTomorrow night, Dane Key and Barion Brown will be at KSBar and Grille for an autograph signing and meet-and-greet with Kentucky Football fans. A Commonwealth Causes event, Key and Brown will be available to meet between 7 and 8:30 pm.\nKSR coming up at 10 am\nMatt Jones, Ryan Lemond, and Shannon The Dude will share their takeaways from Kentucky’s loss to Kansas and more from the weekend.\nGo Cats.\nDiscuss This Article\nComments have moved.\nJoin the conversation and talk about this article and all things Kentucky Sports in the new KSR Message Board.\nKSBoard",
  "word_count": 996,
  "scraped_at": "2026-02-14T13:34:35.668574"
}