{
  "article_id": "c6813c06de70",
  "url": "https://www.abc.net.au/news/2025-07-16/club-world-cup-in-trumps-america-reveals-fifa-hosting-problems/105524690",
  "title": "The Club World Cup in Trump America showed co - hosting the biggest global sport event may be an issue",
  "date": "20250715T233000Z",
  "domain": "abc.net.au",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "The Club World Cup in Trump's America showed co-hosting the biggest global sport event may be an issue\nThe FIFA Club World Cup, called \"the undisputed pinnacle of global club football\" by the governing body's president, came to a close after weeks of poor ticket sales, empty seats and significant weather delays.\nDespite Gianni Infantino's claims the tournament showcased \"a world-class stage\" for football, the test run for the 2026 FIFA World Cup at times appeared to underwhelm.\nAlmost four in every 10 seats across the cup's 11 host cities weren't filled by fans.\nThe US will co-host the 2026 FIFA World Cup with neighbours Canada and Mexico, with 104 matches played across 16 cities between June 11 and July 19.\nWith less than 12 months until the first ball is kicked, FIFA's plans for the tournament face potential challenges as it invites professional footballers into a United States governed by the uncertainty of politics and life under Donald Trump.\nSo, what does that do to the viability of America's key role in what many argue is the world's biggest sporting event? Let's break it down.\nWhat is the FIFA Club World Cup?\nThe modern, global FIFA Club World Cup has existed — in one form or another — since the year 2000. Back then, it was known as the FIFA Club World Championship and was designed to pit the club footballing champions of each continental knockout competition against each other.\nThe tournament has been played 20 times since, but in 2025 it was revamped to become a quadrennial event described as \"a powerful demonstration of club football's global appeal\".\nThe 21st edition this year boasted its largest-ever format, expanding from just seven teams when it was last played in 2023 to 32 teams representing 20 countries.\nIt's a feat Infantino has also sought to achieve in next year's nations-based World Cup, which will include teams from 48 countries — the tournament's first expansion since the adoption of 32 teams in 1998.\nThe Club World Cup's logistical headaches\nWhen the Club World Cup began in mid-June, stadiums of monumental capacity awaited rowdy crowds at venues located across the US — including in heavyweight cities like New York, Los Angeles, and Miami.\nWhat came next for various games were rows and rows of empty seats — broadcast around the world — as fans simply didn't show up.\nThe club tournament simply isn't as popular as the World Cup, where players compete for their countries rather than for a domestic team.\nThe costs — both for games and travel — also kept some fans away, while for others there were lingering concerns of potential US Immigration and Customs Enforcement (ICE) raids at matches amid Mr Trump's crackdown on illegal immigration.\n\"It's like playing football during lockdown,\" observed one fan on social media during the June 18 Ulsan HD vs Mamelodi Sundowns FC match.\nFor days afterwards, FIFA didn't register the attendance of that game on its website. That was because the official number at the 25,500-seat Inter&Co Stadium in Orlando, Florida came out to be 3,412 by the final count — fewer than 14 per cent of seats had been filled.\nThere were similar scenes eight days later when Japan's Urawa Red Diamonds played Mexico's CF Monterrey at LA's famous 89,702-seat Rose Bowl Stadium, where fewer than 14,500 fans showed up.\nOn June 18, 11,974 people entered Seattle's Lumen Field to watch Argentina's River Plate play Urawa but more than 82 per cent of the seats stayed empty.\nA handful of other early fixtures at various venues also managed to fill less than a third of the total seating capacity.\nThere were some notable exceptions — which FIFA has chosen to focus on, instead.\n\"The total attendance across the group stage of 1,667,819 — at an average of 34,746 fans per match — shows just how the most inclusive global club competition ever has captured the imagination of supporters,\" a statement said.\nMonday's final between Chelsea and Paris Saint-Germain (PSG) understandably topped the attendances list, with more than 81,000 people at New Jersey's MetLife Stadium.\nAnother 80,619 fans went to the Rose Bowl to watch PSG play Atlético Madrid in the groups, while 76,611 watched Real Madrid face Borussia Dortmund in New York.\nThe Palmeiras vs Chelsea match in Philadelphia attracted 65,782 spectators, while Bayern Munich and Boca Juniors played in front of 63,587 in Miami.\nDespite those figures, analysis conducted by the ABC of all of the Club World Cup fixtures shows that while almost 2.5 million people attended games, on average, 38.93 per cent of the total seating capacity of all host venues remained unfilled.\nThere was not a single sell-out throughout the cup. The LA PSG vs Atlético Madrid fixture fell just short of the 84,163 who watched the English FA Cup final at Wembley Stadium and was well above the 64,327 attendance for the Champions League final — European club football's biggest match.\nAt the 2022 FIFA World Cup in Qatar, there was an average attendance of just under 50,000 per game for the opening week.\nDavid Zdrilic, an ex-Socceroo, former assistant coach with the Chicago Fire in the US-based Major League Soccer (MLS) competition and current Perth Glory head coach in the A-League, says he believes the empty seats could be attributed to the freshness of the Club World Cup as an international tournament format.\nHe also says he expects next year's World Cup to generate far higher levels of fan interest, as it has over previous decades.\n\"It's not so much a United States thing, it's more the Club World Cup is a new concept — and you're not just selling it to the United States, you're selling it to the rest of the world,\" he told the ABC.\n\"It's the first time we've seen anything like it.\n\"The World Cup's the biggest tournament in the world, in any sport… last time they played in the US [in 1994], the fans came out.\"\nExtreme summer heat and storms play havoc\nEmpty stadiums, however, were not the only obstacle faced by FIFA in the US over the past two months.\nPlayers were expected to take to the field during extreme heat, which FIFPRO — the federation representing professional footballers — says will likely pose an even bigger issue next year.\nDue to football's popularity in Europe, many Club World Cup matches were played in the middle of the day so fans overseas could watch in real time at night.\nThe cup was also played during a time typically known in the US for intense summer thunderstorms, which saw more than six games suspended for periods of up to two hours.\nThose lengthy delays sparked concerns over player welfare and supporter disinterest after stadiums quickly emptied out once teams left the field to seek shelter.\n\"I can understand that for security reasons, you have to suspend the game,\" Chelsea manager Enzo Maresca said after the club's June 29 match against SL Benfica was halted.\n\"If you suspend seven, eight games, that means that probably is not the right place to do this competition.\"\nThose criticisms highlighted a sentiment also shared by former Liverpool manager Jürgen Klopp.\n\"[The] Club World Cup is the worst idea ever implemented in football,\" he said last month.\n\"People who have never had anything to do with day-to-day business are coming up with ideas… perhaps not everyone has recognised the real problem yet, that next season players will suffer injuries they've never had before.\n\"If not this season, then it will happen at the World Cup or afterwards.\"\nZdrilic says that while weather delays can be a point of frustration for players and staff involved in the game, they're unavoidable.\n\"It's not ideal … It can totally reset the game in one direction or the other,\" he said.\n\"I don't think it's going to be a massive problem. [The US] had a World Cup before, it was very successful in terms of getting things right.\n\"The US are built for big stadiums, big crowds, they've got great infrastructure… there's a lot of positives.\"\nCould Trump's politics hurt the FIFA World Cup?\nYes, according to Dr Emma Shortis, director of The Australia Institute's international and security affairs program.\nShe says Donald Trump's aggressive illegal migration crackdown and ongoing ICE raids are already impacting the desirability of travelling to the US for international visitors.\n\"We already have evidence for that in that travel to the US is down by international tourists,\" Dr Shortis said.\n\"There's been a downturn in the industry generally and revenue for the industry because people are reconsidering travelling to the US in direct response to what the Trump administration is doing.\n\"That uncertainty is only going to increase.\n\"People's legitimate concerns about travelling to the US — not just as athletes but as spectators — are only going to deepen in the next couple of years in the lead up to the World Cup next year and then the [2028 Los Angeles] Olympics.\"\nZdrilic, however, pointed to the political and welfare concerns raised prior to the 2018 FIFA World Cup in Russia, which he says ultimately did not create any turbulence during the tournament.\n\"World Cups always find a way to break all those sort of boundaries [that] are put up,\" he said.\n\"There's always a political background to almost any event that's been put out there, especially in the time that we live now, but when they're putting on such a big event, surely they have to make accommodations to allow for the people to come watch.\"\nDr Shortis says the case of members of the Senegalese women's basketball team being denied visa entries into the US last month contradicts that and highlights a point of potential concern for the 2026 World Cup.\nThe visa denials came amid a push by the Trump administration to have countries improve vetting travellers or face a ban on their citizens visiting the US.\nThe Trump administration announced a sweeping travel ban on visitors from 12 countries on June 4, with US authorities later suggesting they were considering adding at least 36 other nations to the list.\nSenegal wasn't on that initial list of countries and it was not immediately clear why the visas were denied.\nIran, however, is among the banned nations — and the Middle Eastern country has already qualified to participate in next year's World Cup.\n\"They've said there'll be exemptions for the World Cup, but of course, there cannot be any trust placed in the Trump administration's willingness to stick by its own rules,\" Dr Shortis said.\n\"It has arbitrarily revoked visas already, it's deporting people in the United States legally without giving them access to due process and so, it's almost inevitable that this will spill over into those big events.\n'It's entirely possible a big incident where someone of high stature is denied entry or treated poorly at the border, which has already happened to citizens of other countries — including Australia, that could cause another international incident for the Trump administration.\n\"It wouldn't be surprising if in response to what the Trump administration is doing that some high-profile players or coaches decide not to come, either because the risk is significant or in protest at what the Trump administration is doing.\"\nThe US will host 78 of the 104 matches at next year's World Cup, including the knockout rounds and the final, to be played at MetLife Stadium, near New York City.\nABC/AP",
  "word_count": 1915,
  "scraped_at": "2026-02-14T12:58:41.981309"
}