{
  "article_id": "c69ae7854b18",
  "url": "https://www.theguardian.com/world/2025/jan/16/israel-gaza-hamas-ceasefire-deal",
  "title": "Thursday briefing : What we know about the Gaza ceasefire deal",
  "date": "20250116T101500Z",
  "domain": "theguardian.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Good morning. After more than 460 days of conflict since Israel’s invasion of Gaza began in response to the October 7 attacks, a new ceasefire deal has finally been agreed.\nAnnouncing the agreement last night, the Qatari prime minister, Sheikh Mohammed bin Abdulrahman al-Thani, said he hoped it would be “the end of a dark chapter of war”. A Hamas official said the militant group had approved the text; Benjamin Netanyahu said early this morning that there were still some obstacles in place over whether Israel will be able to veto the release of specific Palestinian prisoners, but Israel’s security cabinet is expected to meet to finally approve the deal at 11am local time today.\nBarring any late reversal, the ceasefire will take effect on Sunday, with 33 hostages in Gaza being exchanged for about 1,000 Palestinian prisoners over the next six weeks. But while that exchange and an influx of aid into Gaza are hugely significant, it remains to be seen whether they pave the way for a lasting peace.\nToday’s newsletter takes you through the deal and its consequences. Here are the headlines.\nFive big stories\n-\nEconomy | The UK economy grew by 0.1% in November, reversing a 0.1% drop in the previous month and easing pressure on embattled chancellor Rachel Reeves.\n-\nNHS | Patients are dying in hospital corridors and going undiscovered for hours, while others who suffer heart attacks cannot be given CPR because of overcrowding in walkways, a bombshell report on the state of the NHS has revealed.\n-\nForeign policy | Keir Starmer has travelled to Ukraine to meet Volodymyr Zelenskyy for the first time since he entered Downing Street, hailing a “closer than ever” partnership days before Donald Trump returns to the White House.\n-\nClimate crisis | Climate “whiplash” between extremely wet and dry conditions, which spurred catastrophic fires in Los Angeles, is increasing exponentially around the world because of global heating, analysis has found.\n-\nBaftas | Conclave, Edward Berger’s papal thriller about a conflicted cardinal overseeing the election of the new pope, heads into next month’s Bafta awards with the most nominations. It is in the running for 12 awards – one more than its closest rival, Jacques Audiard’s much-decorated transgender musical Emilia Pérez.\nIn depth: ‘People are crying here. They don’t believe it’s true’\nThere was still violence in Gaza yesterday: an Israeli air strike reportedly hit a house in Gaza City, and killed three people. But for the first time in a long time, the prospect of at least a period of calm appeared concrete – and was then confirmed.\nThe outline of the plan that emerged was almost identical to the framework first put forward by the Biden White House in May last year. The phased return of some of the remaining hostages over a six-week period will come in exchange for the release of 1,000 Palestinian prisoners. The last bone of contention, according to Benjamin Netanyahu, is whether Israel will be able to veto the release of “mass murderers who are symbols of terror”.\nMeanwhile, aid flows into Gaza will be massively increased, while Israel will begin a phased pull-back of its troops and allow civilians greater freedom of movement within Gaza.\nThis explainer has more details on those terms. And in this piece, Peter Beaumont details how the deal was done. Here’s what else we know.\nWhat will the deal mean for Palestinian civilians?\nThe deal will bring an end to Israel’s long and brutal siege of Gaza, at least for now. The territory’s health ministry puts the death toll at almost 47,000, with about half women, children or older people. A recent study published in the Lancet suggested those figures could be significantly lower than the real total.\nThose who have survived are living in truly desperate circumstances. This piece by Emma Graham-Harrison details some of the staggering impact, including details of the bombing campaign and mass demolitions that wiped out whole neighbourhoods and the devastating impact on education: 534 of 564 school buildings have been damaged or destroyed.\nNow the deal says that there will be a major surge in aid, and Egypt said last night that work was under way to reopen the Rafah crossing. About 600 trucks a day are due to be allowed in, while Israel will also allow wounded Palestinians to leave the territory for treatment. And about 200,000 tents and 60,000 temporary homes will also be brought into Gaza.\nIn this piece, Malak A Tantesh and Jason Burke heard from civilians in Gaza as they celebrated the news. “The best day in my life and the life of the Gaza people,” said Abed Radwan, a Palestinian father of three. “Thank God. Thank God. People are crying here. They don’t believe it’s true.”\nWhat does it mean for the hostages?\nHundreds of people, including the families and friends of Israeli hostages, gathered in Tel Aviv last night. A group representing the families, the Hostages and Missing Families Forum, welcomed the promise that some would be released but noted: “We will stand by the families until the very last hostage is brought home.” And Sharone Lifschitz, a London-based filmmaker whose father, Oded, is being held hostage, told AP: “I can’t wait to see them coming back to their families. I’m so desperate to see them if by some miracle my father has survived.”\nLorenzo Tondo has more on the families’ reactions here. Under the terms of the deal, 33 hostages – excluding male soldiers and other men under 50 – will be freed during the first phase: three female hostages will be released on day one, followed by another four on day seven, and then three more every seven days until 14 are released in the last week. Their identities have not yet been publicised, but Reuters reported that two Americans, Keith Siegel and Sagui Dekel-Chen, are on the list.\nMeanwhile, lists of Palestinian prisoners are due to be published after the Israeli security cabinet approves the deal, with a question still hanging over that veto condition. And after 16 days, talks will begin on a second phase in which the remaining hostages, and the bodies of those who have died, would be returned to Israel. There are thought to be about 94 hostages still in Gaza, with estimates that between a third and half have died.\nWhere does Hamas stand as the ceasefire deal is agreed?\nHamas has been decimated by Israel’s attacks, with thousands of its fighters killed and many of its senior leaders, including Yahya Sinwar, the mastermind of the October 7 attacks, also dead. Many of Hamas’s tunnels under Gaza have also been destroyed or cleared by Israeli forces.\nLast summer, Israel claimed to have killed 17,000 of an estimated 25,000-30,000 militants, although those figures have been questioned because of the difficulty in differentiating fighters from civilians, and detailed IDF reports recorded by crisis mapping group ACLED list 8,500 militant fatalities. The US secretary of state, Antony Blinken, said on Tuesday that Hamas had been able to recruit almost as many militants as Israel had killed, saying that Israel’s approach had created “a recipe for an enduring insurgency and perpetual war”.\nThe group’s chief negotiator, Khalil al-Hayya, claimed last night that Israel had failed to achieve its goals in Gaza. He added: “On behalf of all the victims, every drop of blood spilt and every tear of pain and oppression, we say: we will not forget, and we will not forgive.”\nWhere does the deal leave Netanyahu and his political allies?\nIsrael’s prime minister, Benjamin Netanyahu, has always blamed Hamas for the breakdown of talks in the past, and loyalists argue that the essential change now is that their adversaries have become more willing to negotiate after the death of Hamas leader Yahya Sinwar, and because of increased pressure from Palestinian civilians facing the consequences of a second cold winter at war.\nBut analysts note that Netanyahu’s position has been framed in part by the presence in his governing coalition of two far-right ministers, Itamar Ben-Gvir and Bezalel Smotrich. Because of his narrow parliamentary majority, they have been able to threaten to collapse the government if a deal goes through.\nBen-Gvir appears to have maintained his position as the latest talks have progressed. But after renewed pressure from Donald Trump on Netanyahu, Smotrich met with the prime minister and his defence minister Israel Katz yesterday, and appears to have been persuaded to withdraw his opposition. Unlike Ben-Gvir, he would be likely to be voted out in the event of new elections.\nHe will still vote against the deal, but it is sure to secure a majority in the Knesset anyway; on the key question of whether he would join Ben-Gvir in trying to collapse the government, he said last night that “our continued presence in the government depends on absolute certainty of resuming the war with full force—on a broad scale and with a renewed strategy—until we achieve a decisive victory”. Israeli television reported that he also demanded limits on aid being allowed into Gaza.\nHow has the US reacted?\nIt appears that Donald Trump’s impending arrival in the Oval Office was a key factor in the deal finally being agreed. He was quick to take credit yesterday, saying on Truth Social: “This EPIC ceasefire agreement could have only happened as a result of our Historic Victory in November.”\nJoe Biden took a different view. When asked who should get credit between him and Trump as he walked away from the White House podium, the outgoing president responded: “Is that a joke?”\nBiden also noted that it will be Trump who bears the responsibility of seeing the ceasefire turn into a more lasting peace. With talks on the release of the remaining hostages and other aspects of the second phase yet to come, and the prospect of Hamas surviving in any form a potential threat to the survival of Netanyahu’s government, that outcome remains deeply uncertain.\nReflecting on the impact of the war across the Middle East in this piece, Patrick Wintour writes: “In every country sucked into the Israel-Gaza war – Lebanon, Syria, Yemen, Iran, Iraq – and in Israel itself, the balance of forces has been changed by the war, but not irreversibly transformed.\n“That is true of Gaza itself, where even if a full ceasefire holds, the future remains deliberately clouded.”\nWhat else we’ve been reading\n-\nBarbara Speed is compelling in this column on a looming contraception crisis in young women. Exhaustion at side effects and the rise of alternative treatments, “wellness” culture and ovulation tracking apps have seen more and more women try something new and take things into their own hands. But is that a good thing? Charlie Lindlar, acting deputy editor, newsletters\n-\nAs always, The Traitors has me completely hooked–and fully equipped with a tin foil hat. Michael Hogan has rounded up some of the audience’s wildest conspiracy theories about the series so far. Nimo Omer, First Edition assistant editor\n-\nIt’s the take I never knew I agreed with: why is it so unsettling to watch grownups drink milk? Arwa Mahdawi explores in this column after watching Nicole Kidman chug a glass while accepting an award for her new erotic thriller Babygirl. Charlie\n-\nThe number of people engaging in civic action – protests, marches and non-violent civil disobedience – has surged in recent years. Helen Pearson takes a look at what makes a movement work. Nimo\n-\n“I’m literally Joan Baez right now” – Alaina Demopoulos has a fun piece on gen Z youngsters discovering, and fully relating to, the angelic-voiced singer and her situationship with self-centred tortured artist Bob Dylan. “True baddie Latina icon,” adds one. Charlie\nSport\nFootball | Two goals just before half-time saw Arsenal beat Tottenham Hotspur 2-1 in the north London derby and close the gap on Premier League leaders Liverpool to four points. Elsewhere, Ollie Watkins’s goal gave Aston Villa a 1-0 win over Everton in David Moyes’s return to Goodison Park, while Newcastle dominated Wolves 3-0, and Crystal Palace took home three points in a 2-0 away win against struggling Leicester.\nTennis | Emma Raducanu set up a match against Polish second seed Iga Swiatek with victory over her close friend Amanda Anisimova at the Australian Open. Raducanu, who won 6-3, 7-5, will play in the third round of the tournament for the first time.\nMedia | Gabby Logan, Kelly Cates and Mark Chapman, the new hosts of Match of the Day, have promised to “evolve” the TV institution when they take the reins this summer, after the BBC confirmed that they will replace Gary Lineker at the end of the current season.\nThe front pages\n“Hope of end to ‘dark chapter’ with Israel-Hamas ceasefire” is the Guardian’s splash headline today. “Ceasefire joy on both sides” says the Times, while the i has “Ceasefire: Israel and Hamas reach deal to end war and free hostages”. The Financial Times leads with a note of caution: “US and Qatar announce Gaza truce but Netanyahu warns deal not sealed”.\nThere are other big stories around – the Daily Mirror has “Chaos in hospital corridors” and the Daily Mail also goes with “The shame and horror of NHS corridor care”. The Daily Express carries a nurse’s perspective: “Like watching a horrid film I can’t stop”. “A double injustice” – that’s the Metro on the Andrew Malkinson case, and the Daily Telegraph has “Pressure builds on Starmer in Adams row”, about the question of whether Gerry Adams might get compensation for unlawful imprisonment.\nCartoon of the day | Ben Jennings\nThe Upside\nA bit of good news to remind you that the world’s not all bad\nWhen C Marina Marchese visited a friend’s apiary 20 years ago, she was enraptured. “I stood at the opened hive, mesmerised at how hundreds of bees were going about their business and ignoring our presence,” she writes in the series A moment that changed me. Her friend described the intricate workings of the hive, with its queen bee and female workers and male drone bees. “I had never imagined that the life of a honeybee could be so intriguing and dramatic.”\nMarchese was working as a freelance designer but after she got her first taste of real honey, she became obsessed with her new hobby. Soon she was the owner of a beehive, protective veil, a smoker and other beekeeping essentials. She went on to learn about what a critical role bees play in the ecosystem, and their impact through pollination on the global food chain, but it wasn’t until her second year in the endeavour that her buzzing charges produced any honey.\nThe experience has led to her writing a book, The World Atlas of Honey, changing careers and becoming a kind of ambassador for “honey literacy”. An unplanned and sweet end to a story that began with a trip to an apiary.\nSign up here for a weekly roundup of The Upside, sent to you every Sunday\nBored at work?\nAnd finally, the Guardian’s puzzles are here to keep you entertained throughout the day. Until tomorrow.",
  "word_count": 2522,
  "scraped_at": "2026-02-14T12:11:13.258490"
}