{
  "article_id": "c6b83c0432df",
  "url": "https://www.cardchronicle.com/2023/9/29/23895991/friday-afternoon-cardinal-news-and-notes-louisville-cardinals",
  "title": "Friday afternoon Cardinal news and notes",
  "date": "20230929T203000Z",
  "domain": "cardchronicle.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "—Spread Check: Louisville by 3.5.\nFriday afternoon Cardinal news and notes\nBeat NC State.\n—Here’s the official U of L preview for Louisville-NC State.\n—Pack Pride gives us five Wolfpack players to watch this evening.\n—Louisville Report’s Matt McGavic looks at the points of emphasis for Louisville vs. NC State.\n—We don’t lose on Kim Schatzel inauguration day.\n—The TNIAAM staff is split on their Louisville-NC State picks.\n—With the schedule out, the CJ looks at the must-win ACC games for Jeff Walz’s Louisville women’s basketball team.\n—Bloomington seem to be in a weird place.\n—The 10th-ranked U of L men’s soccer team will face Virginia on the road this evening.\n—Louisville-NC State is one of Homefield Apparel’s games of the week. Shop new Cardinal gear here and use the promo code “CHRONICLE15” at checkout to save 15% off your first order.\n—The CJ staff plus Kent Spencer and Dominique Yates make their picks for this week’s local high school football games.\n—The U of L women’s soccer team is hitting the road on Saturday to take on No. 10 Notre Dame. Here’s a preview.\n—These are good.\n—It’s a top 10 showdown on Floyd Street this afternoon when No. 5 Louisville field hockey hosts No. 7 Virginia at 3 p.m.\n—Former duPont Manual High School runner Yared Nuguse set the American record in the mile, but he doesn’t seek the spotlight that comes with it.\n—In the last 12 days of September, four new restaurants, including a popular sports bar, have opened in the Louisville area. Here’s a look at each.\n—Congrats on a terrific career to one of the best shooters and bench hype men in the history of Cardinal basketball.\nTweet made me a little emotional.\n—Louisville is 4-0 for the first time since 2016, but the toughest stretch of the Cards’ schedule begins tonight.\n—The Lions are gonna win the Super Bowl.\nIn all seriousness, I have no idea how to go about processing a Lions team that looks legitimately ... good. Do I, like, start looking forward to Sundays for fandom purposes now? This is all new to me.\n—With five weeks left in the Kentucky high school football regular season, the CJ takes a class-by-class look at state’s top teams, biggest surprises and leading Mr. Football candidates.\n—The kids are very rarely the problem in amateur sports.\n—NC State players and fans are hyped for the Blackout environment at Carter-Finley tonight.\n—Here’s what NC State running back Delbert Mimms had to say about the Louisville game.\n—For anyone looking for some last minute insight on the NC State squad, this Inside Pack Sports podcast discussion is an informative one.\n—It was quite the 24 hour period for Jack Harlow, who is featured on a new song by one of the biggest music stars in the world, and then lived out every Highlands kid’s dream by shooting a commercial on the roof of Twig and Leaf.\n—Western Kentucky scored a 31-10 win over rival Middle Tennessee Thursday night.\n—Here’s what Dave Doeren had to say to the media ahead of Friday night’s game against the Cards.\n—Jeff Walz has landed a commitment from 6’4 Australian post player Isla Juffermans. I believe this is the player to be named later in the Trentyn Flowers trade.\n—Dennis still does not miss.\n—With sports gambling going live in Kentucky, The Lines has a look at all of the commonwealth’s college basketball teams for the upcoming season.\n—David Glenn has Louisville-NC State as the second-best game of the weekend involving at least one ACC team.\n“Three To See,” Game #2\n4-0 Louisville at 3-1 NC State, Fri., 7 pm, ESPN\nOLD NORTH STATE TAILGATE (4-6:30 pm; Backyard Bistro)\nThe Wolfpack, which struggled against lowly Virginia before winning a 24-21 squeaker against the Wahoos in Charlottesville last week, is a three-point underdog at home against Louisville in this national spotlight game.\nTwo quick side notes: #1-Wolfpack coach Dave Doeren is 75-55 in his 11 years at NC State, and he’s only two wins away from tying legendary coach Earle Edwards as the program’s all-time wins leader; #2-NFL legend Bill Cowher, the only former NC State player in the Pro Football Hall of Fame, will be on hand at Carter-Finley Stadium, as he’ll be officially inducted into the Wolfpack’s Ring of Honor between the first and second quarters of this game.\nThe Cowher angle is worth mentioning, in part, because it’s crystal-clear how much virtually everyone in Wolfpack Nation admires, respects, reveres and loves him. The Pack fans in attendance are going to be very loud and supremely supportive as Cowher officially joins the school’s other gridiron immortals.\nThat same Wolfpack Nation — one of the loudest and most passionate fan bases I’ve seen in my 37 years covering college sports — may have to be part of the solution during live action, too, if the Pack is going to beat the unbeaten Cardinals. This week’s visitors to Raleigh have been absolutely scorching their opponents offensively under first-year coach Jeff Brohm, the former Louisville quarterback lured back home after some successful years as the head coach at Purdue in the Big Ten.\nThere’s no getting around Louisville’s offensive numbers. They’re just crazy-good. Louisville is averaging 43 points per game through its 4-0 start against Georgia Tech (a 39-34 win), Murray State (a 56-0 blowout), Indiana (a 21-14 grinder) and Boston College (a 56-28 demolition).\nStatistically, for now, the Cardinals actually have the best rushing offense in the ACC (led by brilliant running back Jawhar Jordan, who is averaging an ACC-best 120 yards per game and — get this — almost 10 yards per carry) and the best passing offense in the ACC. The latter is led by sixth-year senior quarterback Jack Plummer, a guy who spent four years learning Brohm’s system at Purdue before starring last season at Cal, and Georgia State transfer wide receiver Jamari Thrash, who is #2 among all ACC pass-catchers at 100 yards per game.\nAs one might have guessed by now, Louisville leads the ACC in total offense, at 542 yards per game, and the Cardinals rank among the top 10 teams nationally in both points per game and yards per game.\nObviously, it’s a lot harder to run your offense when you can’t hear each other — that’s where Wolfpack Nation comes in — and it’s a lot harder to run your offense against a strong defense. While State has had plenty of problems and complications offensively, it’s actually been a pretty solid team on defense, and the Wolfpack may present the toughest defense Louisville has faced so far this season.\nOne possible equation for an NC State victory goes this way: Wolfpack Nation + Tony Gibson’s Defense = create turnovers, plant a seed of doubt in your opponents’ heads (this is just Louisville’s second game away from home; the first was the nail-biter against Georgia Tech at the Atlanta Falcons’ NFL stadium), give Pack quarterback Brennan Armstrong decent field position, and maybe even score on defense to take some pressure off an offense that hasn’t been able to “click” consistently so far this year.\nState has a really solid starting defensive line in Davin Vann, CJ Clark and Savion Jackson. The Wolfpack also has a heat-seeking missile at linebacker in Payton Wilson, an All-ACC caliber player, and another star in cornerback Ayden White. The Pack has had an unfortunate number of injuries, especially at safety, which complicates things, but it’s a talented and pretty effective group overall.\nThe Wolfpack has won 17 of its last 19 games at Carter-Finley Stadium. Friday night’s game versus Louisville is being called a “BLACK OUT” game for the Pack, whose players will wear black uniforms with glow-in-the-dark numbers, cleats and gloves. Maybe that, like Cowher’s honor, also will add to the electricity and noise at Carter-Finley.\nLast thing: Louisville is not a great defensive team.\nClearly, Armstrong needs more help from every direction on the Wolfpack’s struggling offense right now. In a traditional offense, it’s never a great sign when your quarterback leads the team in rushing, as Armstrong does for now.\nOther than right tackle Timothy McKay, the line hasn’t been great. At tailback, original starter Jordan Houston already has left the team, apparently over playing-time issues. His successor, freshman Kendrick Raphael, then went down with an injury. Can sophomore Michael Allen be part of the solution? Someone else? At wide receiver, freshman KC Concepcion, a talented guy who opened many eyes in the preseason, had a break-out game at UVa, with six catches for 116 yards and two TDs. WR/KR Julian Gray also has made some big plays in recent weeks.\nIt likely would take the proverbial team effort, but the Wolfpack has a great chance to put an end to Louisville’s winning streak.\n—Nice preview of tonight’s game here, which includes an interesting note on NC State’s kicker.\n—Georgia Tech has revealed the same “Ghost” glow in the dark uniforms that NC State will be wearing tonight and that Louisville will be wearing in November.\nThe problem? The Yellow Jackets are wearing them for a game against Bowling Green that will kick off at 3:30 in the afternoon.\n—Just one member of the Backing the Pack staff likes NC State to spring the mild upset tonight.\n—Kevin Coleman says Deion Sanders deserves some of the credit for the success the Jackson State transfer is now having at the Power Five level.\n—Friday Irrelevance, double helping:\n—Cardinal Authority’s Michael McCammon previews Louisville-NC State.\n—Pack Pride goes behind enemy lines.\n—And finally, beat NC State.",
  "word_count": 1598,
  "scraped_at": "2026-02-14T13:09:18.086522"
}