{
  "article_id": "c6dfe5906335",
  "url": "https://www.thesierraleonetelegraph.com/the-dark-side-of-sierra-leones-development-part-one/",
  "title": "The dark side of Sierra Leone development – Part One – The Sierra Leone Telegraph",
  "date": "20240905T150000Z",
  "domain": "thesierraleonetelegraph.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Dr. Denis Sandy\nSierra Leone Telegraph: 17 January 2016\nThe Twentieth Century is long gone, but the celebrations that marked the beginning of the twenty-first century on January 1, 2000, reverberated throughout the world.\nThe new Millennium was considered by many, especially development practitioners, as a period of hope for the eradication of poverty, to ensure peace at all times, as well as restore the dignity of the entire human race.\nFor Africa in particular, this was seen as a moment for the continent to take its rightful place among civilized nations. Unfortunately, the development trajectory of most of the 54 countries on the continent is lamentable.\nOn a scale between -1 and 1, where -1 to 0 is considered “underdevelopment” and 0 to 1 considered “development”, most African countries will cluster from -0.5 to 0.3. This implies that their development paths are not encouraging (see IMF Publication on “Regional Economic Outlook, SSA – Staying the Course”, October 2014 edition).\nIn Sierra Leone, the new Millennium started with rehabilitation, construction and settlement, which eclipsed into “development” by the end of the first decade, and then continued extensively into the second decade.\nPlease remember that development means different things to different people, but all definitions point towards a common goal – “improvement in the lives of the people, more commonly called welfare improvement”.\nBut it seems the modern meaning of development is simply “the degree of the lives people are living and the associated freedoms they are enjoying” (Sen, 2000).\nThis piece is therefore an attempt to explain some of the issues on the “dark side” of Sierra Leone’s development in the 21st Century.\nUnachievement of the Millennium Development Goals (MDGs)\nSierra Leone has not made any progress in any of the eight former MDGs that have been replaced by the new 17 SDGs.\nGoal 1 – Of course, no country will be able to eradicate poverty, and so the degree of poverty reduction is the critical factor. China has been able to move about 600 million Chinese out of poverty over the past few decades; and from now to 2020, the goal is to move 30 million additional Chinese out of same (CCTV news on President XI’s China’s Development Aspiration – December, 2015).\nIn Sierra Leone and despite the mammoth interventions in most areas, 53% of the 6 million people living in the country are still living on less than US $ 1.25 per day (UNDP 2014, Human Development Report).\nIn addition, the population is not adequately fed. There is widespread hunger. Malnutrition is responsible for 40% of child deaths in Sierra Leone (MoHS – December, 2015).\nGoal 2 – Our children are indeed going to school but nationwide primary education has not been achieved over this 15 year period. The number of children not going to school is still higher than those going to school.\nThe average expected number of years of schooling in the country is seven, and the government’s educational budget is a paltry 2.7% of the country’s GDP (UNDP, 2014). And level of spending on education is much worse in the rural areas.\nGoal 3 – Gender equality is nothing but a dream in Sierra Leone. Despite the number of Gender Laws in the country, women’s empowerment is still a problem. The reasons for this can be categorised into specific – teenage pregnancy, early marriages, and poverty, and general – customs and traditions, society’s perception about women, and attitudes of women themselves.\nGoal 4 – Our babies are still dying in large numbers, so child mortality has not been reduced significantly. Infant mortality rate is still high at 117 per 1,000 live births.\nGoal 5 – There is the free health care programme for pregnant women, lactating mothers and children under 5 years. But overall, maternal health is not encouraging. Death of children under 5 years of age stands at 182 per 1,000 live births (UNDP 2014).\nGoal 6 – Malaria remains a major killer. Typhoid, HIV/AIDS and now Ebola, have compounded health problem in Sierra Leone. More than 3,800 Sierra Leoneans have so far died of Ebola in the last 18 month (NERC, 2015).\nGoal 7 – The work of the Environmental Protection Agency (EPA) and other Bodies in Sierra Leone, have in no way ensured environmental sustainability. This is because deforestation and environmental degradation continue to cause massive flooding, air pollution, water scarcity, and loss of ecosystem. The October 2015 flooding which destroyed homes and lives in Freetown is a perfect pointer.\nGoal 8 – Finally, we have not been able as a country to develop any strong global partnership so as to implement and achieve sustainable development. And even with the advent of Ebola, the MRU Basin proved ineffective in forming a strong regional partnership aimed at combating the disease.\nSierra Leone failed to achieve any of these goals, because of the absence of a strong sense of direction on what we really wanted to achieve within the first 15 year period.\nTo put it succinctly, as we see in the next section of this article, there was no systematic approach or framework for committing and allocating resources to those areas in which significant gains would have been achieved.\nDifficulty in discerning key priorities\nEven in the second half of the 21st Century, Sierra Leone is still finding it extremely difficult to prioritise its development policies. We continue to rely on foreign expatriates working for the IMF and World Bank to lead us in this area, even though there is sufficient number of better educated and experienced Sierra Leoneans on the ground.\nOtherwise, why do we need to wait for the “Washington Team” to tell us that “a new Airport is not the priority of Sierra Leone for now”. When several professional Sierra Leoneans – including this writer, expressed similar reservations about the proposed Airport project, based on relevant indicators such as the number of flights coming into the country, etc, they were not taken seriously.\nUntil we can identify our priorities, get them right and align them with the MDGs and Sustainable Development Goals (SDGS), this country will be difficult to develop. Sierra Leone needs to focus on the following key priorities and make no mistake about this: education, health, and food security.\nThis is because when people are educated in a society, they are empowered to make positive choices about their health and lifestyles, with food as a very important component. And ultimately, poverty will be reduced.\nThis is the formula that nations all over the world have applied. The message is clear – “Education is the (master) key to development”. Why this is really difficult to understand in Sierra Leone, only God knows.\nLet me explain this further – when the majority of people in a country are educated, they engage in various meaningful and productive activities that give them a constant flow of income over time.\nIt is such income (called money) that is used to enhance their lives and welfare. Now imagine when the greater number of people in a country is not educated? What happens?\nThe moral behind this is that “until Sierra Leone gets its priorities right, development will be difficult to achieve”.\nYouth unemployment\nThis is another key component of the dark side of development in Sierra Leone. Youth unemployment is still a very serious problem. About 70% of the youth are not in any form of gainful employment (NAYCOM, 2014).\nThe government and development partners, including the UNDP are trying very hard to implement programmes for the benefit of young people in the country. But the truth however is that, the lives of these youths have not been transformed as expected. And the fact that there are 30,000 OKADA riders nationwide shows the magnitude of this problem.\nOne major reason for the slow pace of progress in youth development is the lack of effective collaboration between NAYCOM and MOYA. To demonstrate his commitment towards youth development in the country, the President created MOYA in 2013. But NAYCOM (the Commission responsible for the implementation of youth projects) has been in existence since 2009.\nThe Head of MOYA believes (very strongly) that his Ministry should be the “One-Stop Shop” for all youth issues in the country, forgetting that there is no ministry in the country without a youth component. And all of these ministries had been in existence long before the creation of MOYA.\nFurthermore, the Head of MOYA, rather than his ministry providing supervisory role to NAYCOM along with policy formulation, is now focusing on project implementation. Hence, we are now hearing about youth farm at Masalia, proposed Youth Village in Kabala, and garbage collection here and there.\nHence, the role of NAYCOM is being gradually eroded. And had it not been for the UNDP Youth Empowerment and Employment Programme that is pegged to NAYCOM – Graduate Internship Programme, Sierra Agricultural Business Initiative, Business Development Services, Career Advisory and Placement Services, NAYCOM would have been a lame duck Commission.\nImplicitly, what do you expect in such situation in which a Commission was established before a Ministry, when it should have been the other way round; and a Head who believes it doesn’t matter at all?\nThe tension between MOYA and NAYCOM is clearly visible everywhere – over the airwaves, and at public events. And in all of these, the losers are the country’s youths.\nBut Government Officers, including the Head of MOYA should realize that implementing development programmes in the country, should in no way be considered a lawn tennis match, but rather like a football match where team work is the key.\nTherefore, there is no way MOYA will create the necessary impact in the lives of young men and women in the country, without the involvement or active cooperation of NAYCOM.\nEven before the current state of affairs between the Ministry and Commission unfolded, the President should not have established the Youth Ministry when there was already a Youth Commission (established again by him) in existence since 2009.\nA winning or better situation could have been, to dissolve the Commission altogether and subsuming it under the new Ministry of Youth Affairs, and a division created to absorb the NAYCOM staff; or allowing NAYCOM to exist, but bringing it under the Office of the President (like it was done for EPA, MCC, etc) for effective monitoring.\nTherefore, this situation of the mother (MOYA) not wanting to accept the fact that the daughter (NAYCOM) is much older, will not augur well for the development of the youths of Sierra Leone.\nOne of the ramifications is that UNDP – the principal financier of the YEEP, is gradually becoming disillusioned, regarding its implementation and in providing continued support to MOYA and NAYCOM, because of the unhealthy working relationship between these two organs.\nIn the end, this will be detrimental to the youths of Sierra Leone, because the implementation of the “5 Year National Blueprint Document for Youth Development” in the country will be in jeopardy.\nIn part two of this article, I will examine the degree of freedom enjoyed by the people of Sierra Leone, the effects of a distorted salary structure in the country, and the role and status of sports. Stay tuned.\nAbout the author:\nDr. Denis M Sandy is a lecturer in the department of economics and commerce, at Fourah Bay College, the University of Sierra Leone",
  "word_count": 1893,
  "scraped_at": "2026-02-14T12:09:10.097160"
}