{
  "article_id": "c6e2b06a6bfc",
  "url": "http://www.massachusettssun.com/news/278586711/nwsl-shifts-to-rolling-expansion-model-no-eta-on-next-teams",
  "title": "NWSL shifts to  rolling  expansion model , no ETA on next team ( s ) ",
  "date": "20250919T033000Z",
  "domain": "massachusettssun.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Field Level Media\n19 Sep 2025, 07:10 GMT+10\n(Photo credit: Kylie Graham-Imagn Images)\nThe National Women's Soccer League is shifting away from a defined start and end date to the process of adding new franchises, opting instead for a 'rolling expansion process.'\nNWSL commissioner Jessica Berman said the league is open to adding new teams, and will examine bids from interested parties and cities as they are presented.\nThe NWSL currently has 14 franchises and is about to grow to 16. The league's first round of expansion included Bay FC and the Utah Royals for the 2024 season, with each franchise paying a $53 million fee, along with Boston Legacy for the 2026 season. A second expansion process brought in Denver Summit FC, also for next season.\n'We've been through these two rounds, and so we pretty much know the universe of people who are interested -- there's more than a dozen of them,' Berman said, per Sports Business Journal. 'Those conversations are ongoing and each of them have a different perspective on how much time they need to launch and the investments they need to make in order to be successful, including potentially around infrastructure.\n'We want to not force a square peg into a round hole. We want to be more flexible so that we can get to the best possible result for the next round.'\nCities expected to be interested in adding a NWSL franchise include Cincinnati, Nashville, Philadelphia, Minneapolis/St. Paul, Atlanta, Jacksonville and St. Louis.\nBerman, whose four-year contract expires at the end of this season, is reportedly expected to sign at least a short-term extension.\n'What I can say is that I intend to be here,' she said. 'I joined this league because I believe in the future of women's sports and professional women's soccer. That's all I can say.'\n--Field Level Media\nShares\nShare\nTweet\nShare\nFlip\nEmail\nGet a daily dose of Massachusetts Sun news through our daily email, its complimentary and keeps you fully up to date with world and business news as well.\nPublish news of your business, community or sports group, personnel appointments, major event and more by submitting a news release to Massachusetts Sun.\nMore InformationBEIJING, China: Tensions between China and the Philippines flared again this week after a confrontation near the contested Scarborough...\nWASHINGTON, D.C.: More than half of America's healthcare workforce is preparing to leave their current jobs, a new survey shows. This...\nWASHINGTON, D.C.: U.S. President Donald Trump announced this week that he is filing a US$15 billion defamation and libel lawsuit against...\nIn the predawn silence of September 9, 2025, the skies over Doha briefly lit up—not with the brilliance of sunrise, but with the unmistakable...\nPESHAWAR, Pakistan: Pakistani security forces have carried out three major raids against Pakistani Taliban hideouts near the Afghan...\nLONDON, U.K.: The United States and Britain are preparing to unveil a package of tech and energy deals during U.S. President Donald...\nNEW YORK, New York - U.S. stock markets finished broadly higher on Thursday, with the S&P 500 and NASDAQ posting solid gains as investor...\nNEW DELHI, India: India and the United States resumed trade talks in New Delhi on September 16, raising hopes of progress just weeks...\nBERLIN, Germany: China has broken into the United Nations' list of the world's top 10 most innovative economies for the first time,...\nNEW YORK, New York - Wall Street delivered a split decision on Wednesday, with the blue-chip Dow Jones Industrial Average climbing...\nDEARBORN, Michigan: Ford Motor Company is preparing for a historic move, shifting its world headquarters for the first time in nearly...\nLONDON, U.K.: Google pledged 5 billion pounds (US$6.8 billion) in fresh investments in Britain, unveiling the plan just a few days...",
  "word_count": 623,
  "scraped_at": "2026-02-14T12:20:03.481261"
}