{
  "article_id": "c6e4a1a3865d",
  "url": "https://www.90min.com/man-utd-confirm-departure-club-captain-katie-zelem",
  "title": "Man Utd confirm departure of club captain Katie Zelem",
  "date": "20240627T133000Z",
  "domain": "90min.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Man Utd confirm departure of club captain Katie Zelem\n- Katie Zelem will leave Manchester United this summer upon the expiry of her contract\n- The 28-year-old was made captain in her second season with the club\n- Zelem has been at United since they reformed in 2018\nManchester United have confirmed club captain Katie Zelem will leave the club this summer upon the expiry of her contract.\nThe 28-year-old has been with the Red Devils since they reformed in 2018 and was made captain in just her second season at the club. A lifelong United fan, Zelem was part of their Championship winning side in 2019 to earn promotion to the WSL and later guided them to FA Cup glory last season to clinch the club’s first piece of major silverware in the women’s game.\nZelem amassed 161 appearances in total for United across all competitions and scored 32 goals in that time. Silverware aside, she helped the team reach the UEFA Women’s Champions League for the first time in their history and also to their highest ever WSL finish in 2022/23 as they finished runners-up behind Chelsea.\nThe midfielder is part of a significant exodus of players this summer, with the club already confirming the departure of forward Lucia Garcia. Goalkeeper Mary Earps is also expected to depart upon the expiry of her contract, as per widespread reports this week.\nAccording to The Times, Zelem is leaning towards a move abroad, but is yet to rule out a move to another WSL club. Previously, the England international represented Liverpool between 2013 and 2017.\nIn August 2017, she joined Juventus in for an undisclosed fee and spent just one season in Italy before returning to England to join United’s reformed women’s team. Born in Failsworth, a town in Greater Manchester, Zelem spent much of her youth at United’s centre of excellence, but with no professional set-up at the club at the time, she was forced to move elsewhere.",
  "word_count": 329,
  "scraped_at": "2026-02-14T12:47:35.132314"
}