{
  "article_id": "c6e8ffd96c7a",
  "url": "https://www.firstpost.com/explainers/why-us-conservatives-are-taking-aim-at-taylor-swift-and-the-superbowl-13673612.html",
  "title": "Why US conservatives are taking aim at Taylor Swift and the SuperbowlWhy US conservatives are taking aim at Taylor Swift",
  "date": "20240131T104500Z",
  "domain": "firstpost.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Taylor Swift has been in the news recently. Swift had a banner year in 2023. Not only did she create a slew of records with her “Eras tour,” she also began a high-profile romance with a star athlete from the National Football League (NFL). But now, some right-wing figures in the US are targeting Swift and her beau over the romance. But why is this happening? What do we know? Let’s take a closer look: Kelce and Swift First, let’s take a brief look at Swift’s boyfriend Travis Kelce. Kelce, who plays American football, is a tight end for the Kansas City Chiefs. As per The Independent, the Kansas City Chiefs are quite a successful franchise. They won the 2023 Superbowl Championship, were runner-up in 2021 and again picked up the trophy in 2020. The Kansas City Chiefs will yet again meet their 2020 opponents the San Francisco 49ers in the 2024 Superbowl in February. Kelce has also been with the team for more than a decade.\nAs noted, Kelce and Swift began a romance last year.\nSwift has since been seen at several American football games – in support of her new boyfriend – where the cameras have lingered on the pop star. Swifties, as her fans are called, have also been following the NFL. Conservatives, meanwhile, have taken aim at Swift for ‘distracting from the game.’ The Superbowl Conspiracy Theory But some members of the US right wing are now propagating a novel conspiracy theory – that the Superbowl is rigged in favour of the Kansas City Chiefs and that the Pentagon is using Swift in psy-op.’ What’s the ultimate goal? To ensure President Joe Biden wins the 2024 election. Huh, you may well ask. Also, what? Strap in. As per Forbes, the conspiracy theory seemingly has its origins in a Fox News segnment. Jesse Watters, on the 9 January episode of his show, played a video from a 2019 conference of the NATO Cooperative Cyber Defense Center of Excellence. Swift during the meeting was named as a powerful influencer – a fact Watters took and ran with. “Around four years ago, the Pentagon’s psychological operations unit floated turning Taylor Swift into an asset,” Watters said. “It’s real. The Pentagon Psyop unit pitched NATO on turning Taylor Swift into an asset for combating misinformation online.” That segment has since spawned countless posts on reddit and X with right-wing commentators and accounts making wild, speculative claims:\nI wonder who’s going to win the Super Bowl next month. And I wonder if there’s a major presidential endorsement coming from an artificially culturally propped-up couple this fall. Just some wild speculation over here, let’s see how it ages over the next 8 months.\n— Vivek Ramaswamy (@VivekGRamaswamy) January 29, 2024\nWhat's happening with Taylor Swift is not organic and natural. It's an op.\n— End Wokeness (@EndWokeness) January 28, 2024\nWe all feel it. We all know it. pic.twitter.com/GqQ2VWB98G\nThe Democrats’ Taylor Swift election interference psyop is happening in the open…\n— Laura Loomer (@LauraLoomer) January 29, 2024\nIt’s not a coincidence that current and former Biden admin officials are propping up Taylor Swift and Travis Kelce.\nThey are going to use Taylor Swift as the poster child for their pro-abortion… https://t.co/6ydHPVp4oI\nImpact Shorts\nMore ShortsSo what’s really happening? It seems that right-wing activists in the United States seems to be threatened by Swift hold over popular culture – and how she may use her powers. Till 2018, many in the right-wing actually wishcasted that Swift was actually secretly a conservative. Then, Swift came out against Republican Senator Marsha Blackburn. “[Blackburn] voted against equal pay for women,” Swift wrote. “She voted against the Reauthorization of the Violence Against Women Act, which attempts to protect women from domestic violence, stalking, and date rape. She believes businesses have a right to refuse service to gay couples. She also believes they should not have the right to marry. These are not MY Tennessee values.\" As per The Independent, Swift has since signalled support for the LGBTQ community and encouraged her fans to vote. Swift in May 2020 came out against then president Donald Trump.\nAfter stoking the fires of white supremacy and racism your entire presidency, you have the nerve to feign moral superiority before threatening violence? ‘When the looting starts the shooting starts’??? We will vote you out in November. @realdonaldtrump\n— Taylor Swift (@taylorswift13) May 29, 2020\nThe stance against Trump angered many conservatives who told her to ‘stick to music.’\nNow, it seems that some right-wingers fear Swift could endorse Biden yet again ahead of a close 2024 election.\nThe facts show that they indeed have reason to fear. As per The Independent, Swift’s mere presence at NFL games have broken viewing records, increased sales of merchandise and even boosted the value of the team and the NFL itself by $330 million. A piece in Forbes noted that Swift asking her fans to vote in 2022 resulted in a massive 1,226 per cent increase in voter registrations just an hour after her social media post. Or it could be that right-wing activists are simply trying to blunt any endorsement Swift could give Biden. Rolling Stone reported that Trump and his allies himself have talked about the impact such an endorsement from Swift could have. A source close to the former president say they will declare ‘holy war’ on Swift if she does end up backing Biden. “There have been have claims for several months that she’s a psyop, that she’s a Pentagon asset, that she’s a political weapon,” Brennan Suen, the deputy director of external affairs for Media Matters, a left-leaning media watchdog told Huffington Post. “The claims have gotten completely wild.” Suen said there is a “really clear narrative and tactical similarities between the far reaches of the internet, like 4chan and Rumble, and more that established right-wing outlets like Fox News, that are both trafficking and outlandish conspiracy theories about Taylor Swift.” The Pentagon, meanwhile, has denied any claims that Swift is an asset – in a way Tay-Tay would approve. “As for this conspiracy theory, we are going to shake it off,” a Pentagon spokesperson told The Daily Beast. With inputs from agencies",
  "word_count": 1035,
  "scraped_at": "2026-02-14T12:41:17.995558"
}