{
  "article_id": "c6fec7179200",
  "url": "https://www.areanews.com.au/story/9077950/hanwood-triumphs-in-gardiner-shield-grand-final/",
  "title": "Hanwood triumphs in Gardiner Shield grand final | The Area News",
  "date": "20250930T031500Z",
  "domain": "areanews.com.au",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "While not being the ultimate prize in the Football Wagga competition, Hanwood came away from the Grand Final weekend with two titles in the men's competition.\nSubscribe now for unlimited access.\nor signup to continue reading\nIt was a thrilling finish to the Gardiner Shield, with Hanwood taking on their rivals from the past couple of deciders in Lake Albert.\nThe sides are familiar combatants on the final day of the season, and a goal with nine minutes of regulation time remaining proved to be the difference.\nA play straight from the training ground resulted in a goal to Luke Bastianon in the 81st minute, giving Hanwood the 1-0 lead, which they held onto to claim the silverware.\nCoach Brian Bertolin said the game played out just as he expected.\n\"It was a really tight game. We'd beaten them really convincingly 4-0 in the semi-final and that obviously burnt them a little bit,\" he said.\n\"They are an experienced team who have won the last three grand finals in reserve grade, so they are a battle-hardened club when it comes to grand finals.\n\"I don't think any of us were under an illusion that it was going to be anything other than a tough game. It was a dog fight from the start.\"\nIt was a game where both sides had their chances, and if not for some good goalkeeping from both sides, it was going to take a great goal to decide it, and Bertolin felt Bastianon's goal was just that.\n\"We got that chance and it was a beautiful goal, one fitting to win a grand final,\" he said.\n\"I watched the game again on Sunday, and I think we were just able to hang in there. We both had chances, and I think for both teams, their goalkeepers pulled off some good saves.\n\" When it got into the back end of the second half, I think both teams knew it would be a one-goal game, and we got that chance and we took it. It was something that we had partially worked on at training, the way it was constructed, which is always a good thing.\"\nThe win means the side finished the season undefeated, and they weren't the only Hanwood side to secure that feat on Saturday.\nAfter a dominant season in the newly formed Youth 18s competition, having gone through the regular season conceding just 10 goals while scoring 100, Hanwood wrapped up the title with a 3-0 win over Henwood Park.\nA first-half double to Zane Vardanega sent Hanwood into the halftime break with a 2-0 lead before Ryan Calabria finished the game off with 22 minutes left to see Hanwood crowned champions.\nBertolin feels that the combination of both sides' success has the club in a good position for 2026.\n\"It was a brilliant effort for the under-18s to go through undefeated as well. Joe (Catanzariti) and Fabio (Foggiato) and the rest of the group did a great job,\" he said.\n\"To get a couple of wins there is nice, but the ultimate prize is obviously first grade. For next year, for the club, I think that the squad that I have got and the one in 18s is building another good first-grade squad for the next coach who comes in.\"\nUnfortunately, the two women's sides in action across the finals weekend didn't have quite the same luck.\nIn the Leonard Cup, Hanwood went in as underdogs against their arch-rivals Tolland.\nThe minor premiers were able to take a 1-0 lead into the break after a late goal from Christina Grauer-Kompos, while just five minutes after the break, Brianna Howes doubled their advantage.\nJorja Heffer was able to pull a goal back for Hanwood just nine minutes later, but a goal from Tolland's Lizzie Read locked away the Leonard Cup for the Wolves with a 3-1 win.\nMeanwhile, it was a tough end to the Junior Leonard Cup with Hanwood falling to a 4-0 defeat to Lake Albert.",
  "word_count": 666,
  "scraped_at": "2026-02-14T12:13:20.915997"
}