{
  "article_id": "c7119197b2e1",
  "url": "https://www.plymouthherald.co.uk/news/uk-world-news/arise-sir-idris-elba-wire-10728976",
  "title": "Arise , Sir Idris Elba ! The Wire star knighted in New Year Honours 2026",
  "date": "20251230T101500Z",
  "domain": "plymouthherald.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "As we approach the end of another year, a whole host of well-known personalities and celebrities have an extra reason to celebrate as we usher in 2026. King Charles' New Years Honours list for 2026 has been unveiled, recognising a host of individuals for their contributions over the past year.\nThe latest honours list since his Coronation in 2023 includes 1,157 recipients, acknowledging and rewarding those who have made significant contributions in various fields this year with MBEs, OBEs, and CBEs.\nIn addition to ordinary citizens recognised for their services to the country, the list - which is published twice annually, at New Year and in June on the King's official birthday - also acknowledges numerous famous faces and celebrities, including actors, politicians, musicians, and sportspeople.\nBelow are all the superstars, celebrities, and sports personalities honoured in this year's list. Among them are actor Idris Elba and ice dancers Jayne Torvill and Christopher Dean.\nSir Idris, aged 53, renowned for his roles in The Wire and Luther, is knighted for services to young people. He founded the Elba Hope Foundation, which champions community empowerment, education, youth advocacy, and sustainable development, reports the Manchester Evening News.\nHe stated: \"I receive this honour on behalf of the many young people whose talent, ambition and resilience has driven the work of the Elba Hope Foundation. I hope we can do more to draw attention to the importance of sustained, practical support for young people and to the responsibility we all share to help them find an alternative to violence.\"\nDame Jayne and Sir Christopher, who claimed Olympic gold at the 1984 Winter Games and achieved triumph at the World, European and British Championships, have been awarded Dame and Sir respectively for services to ice skating and voluntary work.\nThe duo, who subsequently became household names on celebrity competition programme Dancing On Ice, described the accolade as \"wonderful and humbling at the same time\".\nSir Christopher, 67, remarked: \"It's been mentioned by fans and supporters, but it's something that we never realised might happen. If it did, that would be wonderful, but if it didn't, there's so many other people in the country that are deserving as well.\"\nDame Jayne, 68, felt the timing of the honours appeared \"perfect\" following the pair's final performance on ice this year.\nShe commented: \"We had such a great time, we were so happy with the tour and the fact that we got through it. It was a big thing for us to mark our career before retirement, and then receiving this award at the end of the year, it's just finished everything. It's perfect.\"\nAlongside them, Paul Elliott, one half of the beloved Chuckle Brothers comedy duo, receives a Member of the Order of the British Empire (MBE), whilst Matt Lucas, known for his work in Little Britain alongside David Walliams, is appointed an Officer of the Order of the British Empire (OBE).\nThe Kumars At No 42 star Meera Syal has been elevated to Dame status, and television presenter Gabby Logan, actor Warwick Davis, and author-presenter Richard Osman have all been awarded OBEs.\nRichard, aged 55 and creator of The Thursday Murder Club novel series, expressed being \"absolutely thrilled\" by the recognition, whilst Warwick, also 55, remarked: \"This is the best thing that's ever happened to me and I've been in Star Wars.\"\nProperty expert Phil Spencer from Location, Location, Location has described feeling \"very overwhelming\" upon learning of his New Year Honours recognition. His MBE acknowledges his charitable contributions, particularly his patronage of homeless charity St Mungo's.\nComic performer Bill Bailey has received an MBE for his contributions to entertainment, whilst Wicked leading lady Cynthia Erivo gains an MBE for her work in music and theatre. Ex-Coronation Street actress Sally Lindsay has been honoured with an MBE for her dramatic contributions, as has recording artist Ellie Goulding, recognised for her environmental and biodiversity advocacy.\nEducator, author, and broadcaster Bobby Seagull has been awarded an MBE in the King's New Year Honours list. The 41 year old, whose full name is Jay Bobby Seagull, gained fame on University Challenge and has been honoured for his contributions to public libraries.\nFootball commentator Clive Tyldesley, renowned for his 'Solskjaer has won it' commentary as Manchester United clinched the 1999 Champions League, has been made an OBE for his services to sports broadcasting and charity work. Meanwhile, writer Roy Clarke, the creative mind behind sitcoms Last Of The Summer Wine, Open All Hours and Keeping Up Appearances, has been knighted.\nFollowing their triumphant Euros win in the summer, England's Lionesses feature prominently on the honours list. Captain Leah Williamson has been appointed a Commander of the Order of the British Empire (CBE).\nAlex Greenwood, Keira Walsh, Georgia Stanway and Ella Toone, all integral members of the team that defeated Spain in the final in Basel, Switzerland, in July, have been awarded MBEs. The team's Dutch manager Sarina Wiegman, who has led England to two Euros victories and the Netherlands to one, has been bestowed an honorary damehood, according to the Cabinet Office.\nMembers of England Women's Rugby World Cup winning squad are also well represented in the honours list. Marlie Packer and Zoe Aldcroft have been made OBEs, along with coach John Mitchell.\nTeammates Ellie Kildunne, Sadia Kabeya, and Megan Jones have been awarded MBEs following the Red Roses' victory over Canada in the final in September.\nIn other news, Paula Radcliffe, a three-time London Marathon victor who held the women's marathon world record for 16 years, has been awarded an OBE.",
  "word_count": 923,
  "scraped_at": "2026-02-14T13:07:04.237740"
}