{
  "article_id": "c770e9d19ca9",
  "url": "https://cartilagefreecaptain.sbnation.com/2025/6/18/24451181/womens-super-league-news-tottenham-hotspur-expansion-relegation-playoff-2026-27",
  "title": "WSL votes to expand , include relegation playoff starting in 2026 - 27",
  "date": "20250806T061500Z",
  "domain": "cartilagefreecaptain.sbnation.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Big changes are coming to the Women’s Super League for the 2026-27 season. According to The Athletic, the clubs in the WSL1 and WSL2 (rebranded from the FA Women’s Championship) have voted to expand from 12 to 14 clubs beginning the season after next, and to implement a relegation playoff for added excitement.\nWSL votes to expand, include relegation playoff starting in 2026-27\nThe new owners of the WSL are planning for some changes.\nTo get up to 14 teams, both the winner and second place finisher this season in the WSL2 will promote to the top division, and the 12th place finisher in the WSL1 will play against the third place finisher in the WSL2 to determine who will be the 14th team in the top flight. To use this season as an example, London City Lionesses and Birmingham City Women would have promoted to WSL1, with Crystal Palace playing against Charlton Athletic Women in the initial playoff.\nBeginning in 2026-27, the top two teams will promote from the WSL2 to WSL1; the 14th placed team in WSL1 will be relegated, while the 13th placed team in WSL1 will play a relegation playoff against the third-placed finisher in WSL2. Two teams from the third division will be promoted to WSL2 to keep that league at 12 teams.\nNikki Doucet, CEO of the WSL, said that these changes will help to promote growth and parity within the leagues.\n“Over the past few months, WSL Football has led a thorough and robust, consultative process backed by research and analysis which explored multiple options that could drive the game forward and help it reach its potential.\n“Our priority was to find a route that would benefit the whole women’s game pyramid, and we believe this next evolution of women’s professional football will raise minimum standards, create distinction and incentivize investment across the board.”\nIronically, Tottenham Hotspur Women were rather lucky the changes didn’t start until next season. Spurs Women finished 11th of 12 teams in the WSL in 2024-25, comfortably ahead of Crystal Palace but still their worst-ever finish in the top flight. The poor performance cost head coach Robert Vilahamn his job; Spurs have yet to announce his successor.\nThe relegation playoff match promises an extremely high-stakes game at the end of the season. While this is unlikely to trouble the top clubs of the league like Arsenal, Chelsea, Manchester City, and Manchester United, Spurs have already shown a relatively big club can slip into dangerous waters with a bad season. Other leagues have a relegation playoff, and it often produces some exciting matches, with one team desperate to stay up and the other team desperate to promote.",
  "word_count": 447,
  "scraped_at": "2026-02-14T12:23:29.764694"
}