{
  "article_id": "c77af3952f31",
  "url": "https://theathletic.com/5043323/2023/11/08/uswnt-nwsl-emma-hayes-full-time/",
  "title": "USWNT has its coach , Ali Krieger and Megan Rapinoe headline NWSL Championship : Full Time",
  "date": "20231108T120000Z",
  "domain": "theathletic.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "This is the digital version of Full Time. If you want it earlier, start every week with Full Time delivered to your inbox. Sign up here.\nEither Megan Rapinoe or Ali Krieger will end their career as NWSL champion, and that wasn’t even the biggest news of the weekend. I’m Emily Olsen here with Meg Linehan and Steph Yang — welcome to Full Time!\nAdvertisement\nUSWNT Coach Update\nThe USWNT has a new head coach. And even though U.S. Soccer has yet to announce Chelsea manager Emma Hayes as that new coach officially, it’s only a matter of time. I’m not going to take credit for the chain of events this weekend, but last week’s Full Time newsletter was about how the U.S. needs to press play on the next era of the team.\nBasically, Full Time said, “Name a coach” and USSF said:\nWhen will Emma Hayes take charge?\nThis has not been the cleanest unveiling so far. Chelsea, the team Hayes has managed for more than a decade, released a statement at 11 a.m. ET on Saturday, saying Hayes “will depart the club at the end of the season to pursue a new opportunity outside of the WSL and club football.” A masterclass in telling us she’s taking the U.S. job without telling us she’s taking the U.S. job.\nWhile Hayes has done previous work in television, it quickly became apparent she was getting the USWNT job.\nHere’s what we know:\n- Hayes will leave Chelsea at the end of the 2023-24 season to take over the USWNT.\n- Right now, her first day could be as late as May 2024, just two months before a crucial Olympics for the team, as it looks to rebuild from a disappointing World Cup.\n- Discussions are advanced and if all goes according to plan, Hayes will become the highest-paid coach in world women’s football when she joins, with a potential to match USMNT coach Gregg Berhalter’s salary.\nRead up on the new USWNT boss:\n- The USWNT is hiring a serial winner in Hayes – a coach with unfinished business in the U.S.\n- The story of Chelsea’s relentless genius\nIf you are wondering what this means for Olympic aspirations after a disastrous World Cup, so am I. Luckily, we have Meg Linehan (and Steph Yang) to explore the possibilities:\nMeg’s Corner: What about the Olympics?\nU.S. Soccer’s taking a big swing on the next coach — and also possibly making a major concession to make it happen. Emma Hayes will stay with Chelsea until the conclusion of the 2023-2024 season in England, which could extend through May 25 if Chelsea reaches the Champions League final. The Olympic tournament begins July 25, though, potentially leaving Hayes to have just two windows with the team before heading to France.\nSteph has a look at how this might work (or not) in greater length, but right now we’re mostly waiting for USSF sporting director Matt Crocker and other federation execs to get on the record and explain the plan for these next few months.\nIt’s hard to plot things out without hearing from the folks involved, but the USWNT has this final window of 2023 at the end of November under interim head coach Twila Kilgore still to go. 2024 starts with the CONCACAF W Gold Cup in February and March. Then there’s another normal international window in April.\nAdvertisement\nSo yes, maybe there isn’t a ton of time for a new head coach to really instill their vision for the USWNT ahead of the Olympics either way — especially with a new trophy to win. At the same time, every single training session has to count, especially in terms of roster selection. A lot of questions remain.\nThe good news is the hire is an ambitious one and should be recognized as such.\nRapinoe vs. Krieger\nWhile the Hayes news caught some off guard, the NWSL Championship matchup came as no surprise to its stars.\nOk, so maybe logic said the Shield-winning San Diego Wave, with home advantage, and reigning champion Portland Thorns would meet in the Championship, but it was the narrative that won out. A narrative Rapinoe (OL Reign) and Krieger (Gotham), who are both retiring at the end of the season, predicted in September.\nThey made us sweat, though. In the first semifinal, it was Gotham’s Katie Stengel who broke a scoreless tie in the 107th minute with an absolute banger (something Steph predicted) to send home the Thorns on a rainy Sunday. OL Reign, meanwhile, knocked off top-seeded San Diego with a 1-0 victory thanks to a 47th-minute goal from Veronika Latsko.\n“That was not supposed to be a shot,” she later admitted. But, hey, a goal’s a goal.\nHOW DID THAT GO IN?!? 🤯@V_Latsko12 gives @OLReign the lead from an impossible angle! pic.twitter.com/YUiKbPhrfY\n— National Women’s Soccer League (@NWSL) November 6, 2023\nThe 2023 NWSL Championship is set for Nov. 11 in San Diego at 8 p.m. ET (airing on CBS and Paramount+). The Athletic will be on the ground for all of the festivities, including a skills challenge!\nMore from Meg: A full-circle moment\nRapinoe and Krieger’s final game will (rightfully) be the main storyline heading into the final, but Sinead Farrelly and Mana Shim making the trip to the ‘ship with Gotham is to be another major talking point.\nAdvertisement\nEight years after they last played together for Portland Thorns FC, Farrelly and Shim reunited on the field as teammates this season — years after both had initially retired from the sport, and in a changed NWSL thanks to their decision in 2021 to share their experiences of misconduct and abuse with The Athletic.\nWhen I went back down to New York to ensure I watched the two of them play in person, they already had the unshakeable belief that they’d be playing on the last weekend of the year. That their journey to the championship involved a victory on the road in Providence Park proved a perfect, poetic detail in their return to the league.\n“We have to win a championship,” Shim said. “It’s okay if we didn’t win tonight, as long as we win the final.”\n“Let’s chat again when we win the championship,” Farrelly added, with a smile.\nRead Meg’s full chat with Farrelly and Shim.\nVictory in Portland. 🖤 pic.twitter.com/NPG2oAYD8K\n— NJ/NY Gotham FC (@GothamFC) November 6, 2023\nNWSL by the numbers\nThis will be a final of firsts and lasts. Jeff Rueter collected the data and laid out the numbers:\n- 0: The combined number of NWSL titles for Rapinoe and Krieger (so far).\n- 2: For the second time in league history, the final will not include either of the regular season’s top two sides. Gotham–Reign joins the 2021 NWSL Championship, which featured the third-seed Washington Spirit win over the fourth-seed Chicago Red Stars.\n- 7: The number of combined goals during the two regular-season matchups between Gotham and OL Reign. Each side won the home leg in a blowout while keeping a clean sheet. I have no idea how they’ll handle a neutral site.\n- 1,283: The combined regular-season appearance totals of Lauren Barnes, McCall Zerboni, Jess Fishlock, Ali Krieger, Kristie Mewis, Allie Long, and Sofia Huerta. Those seven players are among the top 12 regular-season appearance leaders in NWSL history, with Barnes and Zerboni ranking first and second on 211 and 204 appearances, respectively.\n- 915,000: the standing record TV audience for an NWSL match. This was set during last year’s NWSL Championship at Audi Field between Portland and Kansas City, setting the stage for another potential high mark this year, given the stars involved.\nSign up for our other newsletters:\nThe Bounce 🏀 | The Windup ⚾ | Prime Tire 🏁 | Until Saturday 🏈 | The Pulse\n(Photo: Henry Browne/Getty Images)",
  "word_count": 1307,
  "scraped_at": "2026-02-14T12:57:00.067906"
}