{
  "article_id": "c7cf15ed097e",
  "url": "https://www.dailymail.co.uk/tvshowbiz/article-12446267/Lioness-Chloe-Kelly-flaunts-figure-tiny-Burberry-triangle-bikini-takes-deserved-break-Ibiza-boyfriend-Scott-Womens-World-Cup.html",
  "title": "Lioness Chloe Kelly flaunts her figure in a tiny Burberry triangle bikini as she takes a well deserved break in Ibiza with boyfriend Scott after the Women World Cup",
  "date": "20230825T183000Z",
  "domain": "dailymail.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Lioness Chloe Kelly flaunts her figure in a tiny Burberry triangle bikini as she takes a well deserved break in Ibiza with boyfriend Scott after the Women's World Cup\nShe's recently returned from Australia after the Women's World Cup.\nAnd Chloe Kelly took to Instagram on Friday to share some snaps whilst vacationing in Ibiza for a well deserved holiday.\nThe 25-year-old donned a tiny triangle Burberry bikini with a cream, black and white tartan print styled with a pair of high waisted crochet cream trousers.\nThe footballer accessorised with a pair of black platform sliders and a pair of oversized sunglasses.\nIn another selfie Chloe has tucked her blonde locks behind her ears exposing a delicate pair of hoop earrings.\nR&R: Chloe Kelly took to Instagram on Friday to share some snaps whilst vacationing in Ibiza for a well deserved holiday\nSelfie: The 25-year-old donned a tiny triangle bikini with a cream, black and white tartan print styled with a pair of high waisted crochet cream trousers\nScott, Chloe's boyfriend of three years, wore a casual ensemble with a pair of blue swimming trunks, a white Moncler T-shirt and white trainers.\nChloe captioned the Instagram post 'much needed R&R time' with a range of emojis including the sun, palm tree and a white heart.\nAfter being in Australia for nine weeks, Chloe returned to Heathrow Airport on Tuesday alongside the rest of the team.\nShe took to Instagram when she returned and shared an adorable picture of herself and two dogs having cuddles in the garden.\nChloe captions the Instagram story 'back with my boys'.\nAround 40 fans including children had gathered at Terminal 3 early Tuesday morning in the hope of meeting the footballers and giving them a rousing welcome home.\nHowever the decision was made for the England players to leave Heathrow via a private exit which left many young fans disappointed after waiting hours to greet them.\nOfficials added that they had asked Heathrow to inform its staff to tell any fans arriving that the players would not be coming through the main arrivals exit.\nPose: Chloe captioned the Instagram post 'much needed R&R time' with a range of emojis including the sun, palm tree and a white heart\nDoggy daycare: Chloe posted a picture on Instagram of her with her dogs, saying: 'Back with my boys'\nComing home: England football fans await the arrival of the women's team at London Heathrow Airport on Tuesday\nBattle: England's Chloe under pressure from Spain's Olga Carmona during the FIFA Women's World Cup final\nIt is not clear whether this message was relayed to any of the supporters gathered in Terminal 3 overnight\nA source also said there would be a chance to celebrate the Lionesses at their next home match, against Scotland at Sunderland's Stadium of Light on September 22.\nIt is not yet clear whether any event to commemorate their run to the final will be held before then.\nSome fans brought flowers for Wiegman, while others held placards featuring messages saying 'You all made us proud' and 'Can we have two T-shirts please?'.\nHopes were raised when former England player Alex Scott, who had been leading the BBC's coverage, was spotted walking through arrivals. Fans said she hinted the team would follow - and the crowd burst out into chants of 'Sweet Caroline'.\nMost watched News videos\n- Extraordinary moment mass brawl breaks out between Brits on flight\n- Finance expert's TV interview interrupted by adorable granddaughter\n- Moment driver veers to target e-bike riders before killing teen\n- Moment Swiss bar fire owners collapse after being confronted\n- Chilling police interview of ISIS fanatic plotting UK attack\n- Astonishing moment a street is swallowed by a sinkhole\n- Israeli hostage reveals how she survived being tortured\n- Deepak Chopra confronted over his relationship to Epstein\n- Food vlogger dies after 'eating toxic devil crab'\n- Spy cam shows woman on her knees next to Jeffrey Epstein\n- New video shows man with backpack similar to Guthrie kidnapper\n- Toddler opens car door in traffic and sends biker flying",
  "word_count": 683,
  "scraped_at": "2026-02-14T13:04:08.165511"
}