{
  "article_id": "c7d869a59c47",
  "url": "https://www.westernpeople.ie/your-community/local-notes-all-the-latest-news-from-kiltimagh_arid-81572.html",
  "title": "Local Notes : All the latest news from Kiltimagh - Community",
  "date": "20251224T040000Z",
  "domain": "westernpeople.ie",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "St Louis Community School, Kiltimagh, made history last week by claiming Connacht honours at Under-20 girls level for the first time.\nThe Mayo side were crowned provincial champions following an impressive 4–1 victory over Galway’s Merlin College in Headford. Unbeaten throughout the campaign, St Louis led 1–0 at half-time before pulling away decisively in the second half.\nAva Mitchell struck twice, with Mollie Gaughan and Ria Foy also finding the net. All three goal scorers came through the underage ranks of Kiltimagh Knock United.\nCaptain Kellie Mallee, another Kiltimagh Knock United player, was presented with the Connacht trophy after the final whistle.\nKiltimagh are set to take on Tyrone’s Clogher Éire Óg on Saturday, January 3, in the AIB All-Ireland Junior Club Championship Semi-Final. The clash is scheduled for a 12.30 throw-in at Heartland Credit Union Páirc Seán Mac Diarmada in Carrick-on-Shannon.\nThe Connacht champions saw off Aughavas on Leitrim GAA’s home turf to capture the provincial title. Their next opponents, Clogher Éire Óg, come into the tie following a hard-fought win over London side Tara, edging the contest with a late point to seal a narrow victory.\nThe encounter between Kiltimagh and the Tyrone champions will be streamed live on TG4 Sport’s YouTube channel. Should Mick Regan’s men prevail, they will book a place in the All-Ireland Final at Croke Park on the weekend of January 10–11.\nThe community extends good luck to the team and congratulates them on their fantastic run in the competition.\nKeith Lydon claimed victory in Round 11 of the Winter Poker League in Teach O’Hora last week. Bart Furtak finished second, while Michael Sheridan took third and Gerry Groarke placed fourth. The remaining finalists were: Marcella Gilmartin (fifth), Nicky Cunnane (sixth), John Reynolds (seventh), Martin Regan (eighth), Derry O’Sullivan (ninth).\nAdam Earley continues to lead the league table and now sits on 193 points. He is followed by Keith Lydon on 172 and Michael Sheridan on 166. The remainder of the top twelve is: Derry O’Sullivan 161, Andy Quinn 156, Martin Regan 156, Paul Walsh 154, Julian Keane 148, Gerry Groarke 141, Michael Higgins 134, John Reynolds 127.\nEntry each round is €50, which includes a rebuy or add-on. €5 from each entry and each rebuy/add-on goes towards the league final prize pool, with the rest paid out on the night. At the end of the league, the top twelve players plus two qualifiers will contest the Grand Final for a prize pool of approximately €3,500.\nAnn McHugh was the winner of Kiltimagh GAA’s 50/50 draw last week, taking home a prize of €566. The previous week’s winner was Joan Gavin, who won €700.\nThe club congratulated Joan and Ann on their success and expressed its thanks to everyone who continues to support the weekly draw. Proceeds help fund the running of teams and ongoing improvements at Gilmartin Park. Tickets remain available online, in local shops and pubs, and from club sellers throughout Kiltimagh.\nThere was a great atmosphere at the latest 25 Card Drive, with keen competition and a strong sense of goodwill as the Christmas season approaches.\nFirst place on the night was shared between three pairs, with Manus Kilcoyne and Chris Flatley finishing level alongside Jack Ryan and Tom Walsh, and Martin Regan and Danny Doherty after an evenly matched contest.\nThe Last 10 prize was also shared, with Patsy Flatley and Francis McNicholas joined by Joe Boyle and Tom Conroy, and Denis Regan and Aiden McDonagh in taking the honours.\nMary and Richard Carney claimed the spot prize, while the raffle winners were Chris Flatley, Tom Conroy, Francis McNicholas and Richard Carney.\nThe organisers would like to thank all patrons for their continued support throughout the year and to wish everyone a very happy and healthy Christmas and a prosperous New Year 2026. The card drive closed last week and will resume on January 8th.\nKevin Higgins from Derryea was the winner of Kiltimagh Knock United’s 50/50 draw last week, taking home €332.\nThe club congratulated Kevin on his win and extended thanks to everyone who continues to support the draw. Each ticket sold helps fund youth teams and maintain club facilities. Tickets remain available online and from local shops, pubs and club sellers in the area.\nKiltimagh GAA Club will once again host its popular Coillte Cup on St Stephen’s Day, bringing players, families, and supporters together for a morning of festive football at Gilmartin Park.\nThe competition kicks off with the first semi-final at 11am between the Townies and Mountain/Balla, followed by Swinford/Bohola versus Knock/Kilkelly at 11.30am. The Shield Final is set for midday, with the Coillte Cup Final concluding the action at 12.30pm, weather permitting, on the main grass pitch.\nA special penalty shootout for U10 and U12 boys and girls will run alongside the tournament, beginning at 11.30am and culminating in a final at noon, with prizes awarded on the day.\nAll matches will be mixed 15-a-side games, featuring ten-minute halves and rolling substitutions. In a popular twist, points scored by female players will count for double. Players are asked to arrive by 10.45am, fully togged out and ready to play, to complete the required waiver forms.\nSpectators can enjoy tea, coffee, and cakes throughout the morning. Entry costs €10 per player, with voluntary donations accepted at the gate. All proceeds will go to the Dillon Quirke Foundation and Mayo Roscommon Hospice.\nThe Coillte Cup presentation will take place later that evening at 7pm in Tommy Ryan’s. Players can register via the link on Kiltimagh GAA’s social media pages.\nThe Kiltimagh Women’s Group will mark Nollaig na mBan on Tuesday, January 6th, at 2pm in the Park Hotel. All local women are warmly invited to attend, and the group extends festive greetings to all members and their families.\nSeason's greetings are extended to all our readers and to all the people who submitted items for publication. Thank you all for your continued support.\nThe death has occurred of Eileen Roughneen (née Gallagher) of Main Street, Kiltimagh, and formerly of Keenagh, Crossmolina. Eileen passed peacefully at home on December 11th, surrounded by her devoted family. She was predeceased by her loving husband Mick and her precious child Linda.\nEileen is survived by her children Mary, Michael and Johanna, sons-in-law Christy and Timmy, daughter-in-law Colleen, grandchildren Michael, Paul, Christopher, James, Feidhlim, Ruth and Grace, great-grandchildren Rhys, Mia, Jack, Robbie, Thady and Oliver, relatives, neighbours and many friends.\nEileen’s remains reposed at her home on Upper Main Street, Kiltimagh on Saturday, December 13th. Removal took place on Sunday for Requiem Mass in the Church of the Holy Family, Kiltimagh, followed by burial in Kilkinure Cemetery.\nMay she rest in peace.\nThe death has occurred of Aileen King (née Burns) of Derryvohey, Balla, and formerly of Shercock, Co Cavan. She was predeceased by her father Michael Burns and brother Eamon Burns.\nAileen will be lovingly remembered by her mother Elizabeth Burns, husband Martin King, daughters Natasha (and her fiancé James), Helen and Rebecca (and her partner Shane), and her cherished grandchildren Bobby, Marco, Leona and Fiadh. She is also deeply missed by her sisters Pauline Grimes and Siobhán Stevenson, brothers Michael, Peter and Ciarán, brothers-in-law Dennis and Stevie, sisters-in-law Kylie and Nancy, extended family, neighbours and friends.\nAileen’s remains reposed at her home on Wednesday last and Funeral Mass took place on Thursday in the Church of the Holy Family, Kiltimagh, followed by burial in Kilkinure Cemetery.\nMay she rest in peace.\nThe death has occurred of Martin Shannon of College Park, Longford Town, and formerly of Kiltimagh.\nMartin died peacefully at home on December 17th, surrounded by his family. He was predeceased by his parents, sisters and brothers, granddaughter Sophie, grandson Alan, and other extended family members.\nMartin is sadly missed and lovingly remembered by his beloved wife Betty, daughter Audrey Sheridan, sons David, Derek, Ian and Patrick, sisters Cora (USA) and Regina (USA), daughters-in-law Maria, Lesley-Ann and Sarah, son-in-law Michael, grandchildren Hillary, John, Ryan, Callum, Emily, Claragh, Ciarán, Liam, Aebhín, Ríonagh and Seán, sisters-in-law, brothers-in-law, nieces, nephews, relatives and friends.\nMartin’s remains were removed to St Mel’s Cathedral, Longford on Friday last with Requiem Mass on Saturday followed by interment in Ballymacormack Cemetery.\nMay he rest in peace.",
  "word_count": 1370,
  "scraped_at": "2026-02-14T12:50:29.447798"
}