{
  "article_id": "c7e87d7757db",
  "url": "https://www.the42.ie/niamh-fahey-interview-wnt-6096329-Jun2023/",
  "title": "Ireland and Liverpool star eyes World Cup after  mentally frustrating  misdiagnosed injury",
  "date": "20230619T083000Z",
  "domain": "the42.ie",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "“LUCKILY ENOUGH, FIGHTING fit now and raring to go,” Niamh Fahey smiles.\nThe Republic of Ireland centurion and Liverpool captain has won her race against time to join Vera Pauw’s World Cup training squad.\nA misdiagnosed calf tear kept Fahey out for almost four months from the end of January to late May, the Galway native yet to wear the green jersey in 2023.\nWith the countdown on to Ireland’s first-ever major tournament and the Reds flying high upon their return to the Women’s Super League, it was testing time for the experienced defender/midfielder.\n“It was tough, more mentally obviously than physically, just given that it was coming in the run-up to the end of the season,” Fahey told the media at Friday’s WNT open training session.\n“I’d had a good half of the year, three-quarters of the year and then to get an injury like that was a bit of a sucker punch for me personally. It took longer than expected but I had a really good rehab and I was able to get back for the last two games of the year to get some actual minutes under my belt. Once I got the games under me, I felt a lot more confident and my body feels good now. Maybe it’s one of those where the rest probably came at a good time.\n“Everyone knows what a big moment this is for Irish women’s football, so you do feel that pressure. I was feeling it, hoping that everything would go right for me. Luckily it did in the end.”\nIt’s fair to say it took some time. The misdiagnosis brought its own challenges, but 35-year-old Fahey can’t speak highly enough of Liverpool’s support throughout.\n“Initially I thought it was a Grade One, which is only like one to three weeks, but it ended up not healing and then got it re-scanned and it was actually a significant Grade Two,” she explains.\n“That obviously delayed [my progress] and I was probably doing stuff too early that I shouldn’t have been doing. It ended up being a much longer injury than first diagnosed, which was a bit mentally frustrating, obviously.\n“Liverpool were very good. They knew the importance of the summer ahead for me, they didn’t push me to any massive timeline, just seeing how my body was reacting and making sure I did it right. We didn’t skip any steps.”\nShe has a special motion for sports therapist Chris Underwood and for her Irish team-mates, Leanne Kiernan and the now-departed Megan Campbell.\n“Me and Leanne were gym buddies or a while so we were keeping each other motivated. Obviously Leanne’s had a tough year as well, she was longer than me, but our rehab coincided towards the end so we were able to get on the pitch together as well. I was enjoying chasing her around, up and down, giving her plenty of kicks!”\nThe pair were in fine fettle at the UCD Bowl the other day. Kiernan scored a screamer in the 11-v-11 training game, while Fahey looked similarly sharp. She was buoyed too in the mid-week by a contract renewal at Liverpool. “Fantastic to get it all sorted before the start of the World Cup. A big boost for me, and delighted to extend my stay for another year.”\nWith club matters parked, the full focus is on the World Cup dream with Ireland.\nCompetition is at an all-time high, with anticipation and nervous excitement in the air since Pauw’s extended group assembled last week. They play Zambia in a sold-out friendly at Tallaght Stadium on Thursday, before the squad is whittled down to 23 (plus three training players) exactly seven days later.\n“It is getting very real. Every day that goes by, it’s getting more real. It’s probably this moment, you’re thinking about it for a long time. Just fully focused now, not trying to think about it too much. It’s just really day-by-day, making sure you’re doing the right things and not looking too far in the future.\n“Obviously, everyone wants to make that spot on the plane, so everyone’s pushing really hard and in great shape. Competition is high and that’s good for the team, it gives the coaching staff and Vera lots of headaches so it’s a good position for her to be in. Everyone’s doing as much as they can — myself included.”\nOne of her brothers, Gary of All-Ireland winning fame with the Tribe, has his flights booked and tickets bought as part of a trip of a lifetime to Australia and New Zealand. “He mightn’t come back somehow I think,” Niamh, a 2004 All-Ireland champion herself, laughs.\nMemories to last a lifetime for one and all, as the former Arsenal and Chelsea star targets a stunning international career crescendo Down Under.\nUnderstandably, the World Cup takes centre stage, but legacy and the overall growth of the game here is hugely important too. Fahey knows that more than anyone, and September’s Nations League opener against Northern Ireland taking place at the Tallaght Stadium is the perfect case in point.\n“It’s fantastic,” she concludes. “Everyone’s so excited, having never played at the Aviva, our national stadium. It’s another step in the right direction and against Northern Ireland as well. It’ll be a big occasion. There’s so much to look forward to, it’s a great moment for the Irish women’s team at the minute.”",
  "word_count": 901,
  "scraped_at": "2026-02-14T12:54:44.092700"
}