{
  "article_id": "c7ffbb9b8d59",
  "url": "https://www.canberratimes.com.au/story/8930012/matildas-v-argentina-in-canberra-tickets-snapped-up-as-fans-go-wild/?cs=14329",
  "title": "Matildas v Argentina in Canberra : Tickets snapped up as fans go wild | The Canberra Times",
  "date": "20250331T080000Z",
  "domain": "canberratimes.com.au",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "The Matildas have sparked a Canberra ticket frenzy as delayed World Cup fever hits the capital before the team returns in June.\nSubscribe now for unlimited access.\nor signup to continue reading\nFootball Australia says more than 20,000 tickets have been sold in less than two days, making it one of the quickest uptakes for a major national event in Canberra in years.\nThere are limited seats available and the match against Argentina on June 2 is expected to sellout given the demand for tickets after a pre-sale on Monday and then opening to the general public on Tuesday afternoon.\nThere are only single seats remaining in most sections, but some extra tickets will be released closer to the game pending corporate and sponsor sales.\nIt's unclear what the capacity will be, but the crowd is expected to eclipse the Canberra Stadium soccer record set last year when the Socceroos played at the venue.\nThe rush for tickets somewhat justifies the ACT government's decision to snub the women's World Cup in 2023.\nThe government withdrew from Football Australia's bid to host the tournament, citing what it described as \"exorbitant\" fees to be a host venue.\nACT Chief Minister Andrew Barr said he would rather spend the host-city money on luring the Socceroos and Matildas to Canberra, even if that meant missing out on the millions watching around the world.\nThe tournament made the Matildas the most popular national team in Australia and set of a chain reaction of sell-out crowds and a boom in women's soccer.\nThere were genuine fears the Matildas had become so popular that it would be impossible for Canberra to host one of their matches because of the size of the venue and the fact the ACT government could not pay the same price as larger states.\nBut Football Australia sees value in having international content in Canberra and officials have been shocked at the quick sales and crazy demand.\n\"We logged on not long after 4pm and couldn't tickets,\" one fan said on Tuesday night.\nSam Kerr has joined the Matildas in camp this week, but isn't expected to play until the two-game series against Argentina.\nThe first match will be in Melbourne before the Matildas and Argentina head to Canberra.\nThousands of tickets gone in four-hours Matildas frenzy as Canberra fans go wild\nCanberra soccer fans have raced to snap up tickets for the Matildas' return to the capital, prompting officials to encourage fans to get in early or risk missing what looms as a sellout clash.\nFootball Australia launched a pre-sale event on Monday less than a week after announcing the Matildas would play Argentina at Canberra Stadium on June 2.\nMore than 3000 fans were in the online queue when the pre-sale went live and more than 10,000 tickets were snapped up in just four hours. Tickets will be available to the general public on Tuesday afternoon.\n\"Anyone wanting to attend the match on June 2, really should not delay,\" a Football Australia spokesperson said.\nMore than 25,000 fans packed into Canberra Stadium to watch the Socceroos' return to Canberra last year and officials are hoping for another sellout.\nThe popularity of that match impressed Football Australia officials, who were surprised at the quick uptake of tickets given the match. The game against Lebanon was shifted to Canberra due to the ongoing conflict in the Middle East.\nIt meant fans from Canberra and the surrounding regions had less than a month's notice before the match, but they still turned up to set a venue record for a soccer match.\nThat could be smashed when the Matildas get back on the field now fans have plenty of notice and the fact the Matildas have surged in popularity since the home World Cup two years ago.\nIt's a stark contrast to when the Matildas played two games in Canberra in 2013 in front of crowds of fewer than 2000 people at the AIS athletics track and McKellar Park.\nThey had a nine-year absence from Canberra before their return in 2022, and the interest in women's football has skyrocketed in the years since.\nNews of Sam Kerr's likely inclusion will add more excitement ahead of the Canberra match, with the team's skipper poised to play in the two-game series against Argentina.\nKerr will join the Matildas in camp this week ahead of games in Sydney and Newcastle, but isn't expected to play as she continues her recovery from an anterior cruciate ligament injury.\nMORE CANBERRA SPORT\nKerr hasn't played in more than a year and has been caught up in off-field drama, but is nearing a return to action and the Matildas-Argentina series looms as a chance to relaunch her international career.\nThe star striker's likely availability will add more excitement for fans, who are already rushing to get tickets to the match.\n'Sincere regret': Matildas make call on Kerr's captaincy\nSam Kerr has avoided being stripped of the Matildas' captaincy after meeting with the Football Australia board, with the superstar striker finally joining the Australian women's team in camp.\nKerr, will link up with teammates in a non-playing capacity in Sydney this week after addressing her recent UK court case, where she was found not guilty on one charge of racially-aggravated harassment of a police officer.\nKerr, who hasn't played since tearing her ACL during a Chelsea training camp in January last year, spoke of her \"regret\" for the incident, with the FA board concluding that it warranted no further action.\n\"I want to express my sincere regret for how events unfolded,\" Kerr said in an FA statement.\n\"It was an incredibly difficult period for me, my family, my club, my teammates, and especially for the fans whose support means so much to us.\n\"I recognise that leadership means being mindful of our actions both on and off the pitch.\n\"I'm proud of the Matildas, the role I have played as a member of that team, and everything we stand for, and I'm committed to learning from this experience.\"\nCrucially, it means Kerr's captaincy, which she has held since 2019, has been settled before the Matildas' next coach is appointed.\nTony Gustavsson's permanent replacement is expected to be in place by mid-year.\nInterim coach Tom Sermanni, who debuted Kerr, 31, as a 15-year-old in 2009, will oversee the striker's first camp since February's high-profile court case.\nKerr was charged after calling a police officer \"f***ing stupid and white\" late in an hour-long altercation at Twickenham police station in the early hours of January 30, 2023.\nThat followed a taxi journey that went sour when a drunk Kerr vomited out of the window.\nThe altercation with police turned heated after it became clear the officers did not believe Kerr and fiancee Kristie Mewis's telling of events.\nFA were blindsided when Kerr's charge came to light in March 2024.\nOn Monday, FA noted the incident had \"implications\" in relation to its code of conduct, but stopped short of saying Kerr had breached it.\nChairman Anter Isaac said the incident shouldn't overshadow Kerr's contribution to the game.\n\"Knowing how Sam (Kerr) feels about the events, along with the additional context we've learned, has added vital perspective that the general public may not be aware of,\" said Isaac.\n\"Setting aside those difficulties, this one incident should not offset the incredible contributions she has made, both publicly and privately, on and off the field for more than 15 years.\"\nAs part of her return-to-play program, Kerr has joined the Matildas for the March 31-April 8 international window.\nGranted leave by Chelsea, she will continue her rehabilitation under the supervision of the Matildas' performance support team.\nAustralia's greatest goal scorer Kerr has not yet been cleared for competitive football.\nBut the Matildas will be hopeful she's available to face Argentina in Melbourne on May 30 and Canberra on June 2.\nAustralian Associated Press",
  "word_count": 1313,
  "scraped_at": "2026-02-14T12:58:21.954698"
}