{
  "article_id": "c80c2d3e0e1c",
  "url": "https://theathletic.com/4172424/2023/02/09/new-european-super-league-proposal-explained/",
  "title": "What the new Super League is proposing ⁠ - and how football has responded",
  "date": "20230209T210000Z",
  "domain": "theathletic.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "The European Super League is back. We told you it would be. On Thursday, organisers of the controversial project presented a long-promised new proposal for a “multi-division” competition involving up to 80 clubs, operating wholly outside of the authority of UEFA, European football’s current governing body.\nAdvertisement\nTo support their proposal, A22 Sports Management — the company promoting the revamped league — published “the preliminary results of a comprehensive dialogue with stakeholders across Europe on the future of club football”, which outlined their grand vision in more detail.\nThe 1,138-word document consisted of “10 principles for a European football league”, which argued that the new tournament would be more “meritocratic”, “transparent” and “competitive” than the status quo.\nThe document also made a number of bombastic claims that brought to mind the initial Super League’s doomed launch in April 2021, as it stressed the tournament would become “the world’s best football competition” with a superior “fan experience”.\nIt didn’t take long for the proposal to make waves across the sport.\nImmediately after the document’s publication, The Athletic contacted a number of clubs, leagues, governing bodies and charities to gather their views. You’ll find their opinions below in our line-by-line breakdown of A22’s statement.\nGO DEEPER\nSpecial report: The rise and rapid fall of the 'universally despised' Super League\n1: “Broad-based and meritocratic competitions”\nA European football league should be an open, multi-divisional competition with 60 to 80 teams, allowing for sustainable distribution of revenues across the pyramid. Participation should be based on annual sporting merit and there should be no permanent members.\nOpen qualification based on domestic performance would grant rising clubs access to the competition while maintaining competitive dynamics at domestic level.\nA22 backed a 12-club ESL proposal in 2021 that failed to materialise after strong protests against it. But it says a Super League 2.0 would be a competition with no permanent members and based on sporting performance, addressing much of the criticism of the original plan.\nUEFA already stages three annual multi-divisional club competitions: the Champions League, Europa League and Europa Conference League.\nAdvertisement\nUEFA’s model of revenue distribution has been criticised, however. Currently, 30 per cent of Champions League prize money, for example, is shared based on a coefficient that takes a club’s historic performance over the previous 10 years into consideration. This has led to allegations that the system is unfairly weighted in favour of bigger clubs.\nUEFA and FIFA, which runs the game worldwide, declined to comment on the proposal when contacted by The Athletic.\n2: “Domestic tournaments: the foundation of football”\nParticipating clubs should remain fully committed to domestic tournaments as they are today. At the same time, the critical need to strengthen and make more competitive domestic tournaments across the continent must be addressed.\nEuropean competitions should play a pivotal role in helping to achieve this goal by generating and allocating additional resources throughout the system.\nThe Super League may want to work with “Europe’s domestic tournaments” — but that doesn’t mean Europe’s domestic tournaments want to work with it.\nJavier Tebas, president of La Liga in Spain, has been a vocal critic of the Super League and wasted little time in denouncing the new proposal.\n“The Super League is the wolf, who today disguises himself as a granny to try to fool European football,” he wrote on Twitter, along with a hastily-edited cartoon. “But his nose and his teeth are very big, four divisions in Europe? Of course the first for them, as in the 2019 reform. Governed by the clubs? Of course, only the big ones.”\nLa Superliga es el lobo, que hoy se disfraza de abuelita para intentar engañar al fútbol europeo, pero SU nariz y SUS dientes son muy grandes, ¿cuatro divisiones en europa? Claro la primera para ellos, como en la reforma de 2019.¿Gobierno de los clubes? Claro solo de los grandes pic.twitter.com/y0IQmLzS6W\n— Javier Tebas Medrano (@Tebasjavier) February 9, 2023\nThe Premier League declined to comment but has previously “condemned any proposal that attacks the principles of open competition and sporting merit which are at the heart of the domestic and European football pyramid”.\nAdvertisement\nThe landscape across Europe’s domestic leagues is very different, however, with the Premier League more wealthy and therefore secure than its counterparts.\n3: “Improve competitiveness with stable and sustainable resources”\nImproving the competitiveness of European clubs requires additional financial resources to be shared across the pyramid and strictly enforced financial sustainability rules. Clubs also need greater stability and predictability in annual revenues so they can make sensible, long-term commitments to player and infrastructure expenditures.\nSubstantial improvements in the format and attractiveness of the current European competitions would generate additional resources. Stability and predictability in revenues would be dramatically improved by offering clubs a minimum of 14 guaranteed European matches each season.\nArsenal, Chelsea, Liverpool, Manchester City, Manchester United and Tottenham Hotspur backed out of the Super League within 48 hours two years ago following widespread condemnation, followed by AC Milan, Atletico Madrid and Inter Milan.\nA source close to one Premier League club said on Thursday that they were unaware of any English club having any involvement in A22’s latest statement. None of the clubs wished to provide a comment.\nReal Madrid, Barcelona and Juventus, however, are still pushing for the creation of a Super League.\nThe European Club Association, a body representing the interests of the professional clubs under the UEFA umbrella, launched a stinging rebuke of A22 on Thursday.\n“This is just another deliberately distorted and misleading attempt to de-stabilise the constructive work currently taking place between football’s real stakeholders to move things forward in the overall best interests of the European club game,” the ECA said.\n“From 2024, more clubs from more countries will participate in European men’s club competitions every season, growing the passion of European football and greatly increasing the amount of revenue being shared. Significant progress can be seen across other aspects of the game from women’s football, youth and academy development, finance and regulation to sustainability and social impact.\n“This is what real change looks like. We have moved on, when will A22?”\n4: “Player health must be at the centre of the game”\nThe health of players must be a key component in determining the number of matches each year. The number of European club competition matchdays should not be increased beyond those in currently planned competition calendars.\nPlayer organisations should be involved to safeguard players’ health and social dialogue across the EU should be promoted. Importantly, European clubs and players should not be obliged to participate in expanded or new tournaments imposed by third parties.\nAdvertisement\nAhead of the recent World Cup in Qatar, FIFPro, the global players’ union, said that footballers are being “pushed past acceptable limits” by this season’s “saturated” schedule.\nThe sheer number of games in European football has become an inflammatory issue in recent years, especially after the introduction of new tournaments such as the Nations League for countries and Europa Conference League for clubs.\nFIFA is also determined to expand the Club World Cup.\nFIFPro came out in opposition to the Super League project in 2021, arguing that a “closed competition” would “challenge the fabric and cultural identity of professional football”. It did not reply to a request for comment on Thursday.\nGO DEEPER\nSuper League survey: What the other clubs from across Europe think six months on\n5: “Club-run competitions with transparent, well-enforced financial sustainability rules”\nEuropean club competitions should be governed by the clubs as they are domestically, not by third parties who benefit without taking any risk. The governance structure must be fully compliant with EU law.\nTo improve sustainability, spending should be based only on resources generated, not from competition distorting capital injections. Financial sustainability rules should allow clubs to only spend a fixed percentage of their annual football-related revenue on player salaries and net transfers, with appropriate provisions for smaller clubs and transition rules.\nA22 insists clubs competing in the Super League 2.0 will abide by “well-enforced financial sustainability rules”. Its statement comes in the same week back-to-back English champions Manchester City were charged by the Premier League for more than 100 breaches of its financial rules.\nBut there is scepticism from some that the Super League’s proposed model would make an immediate impression.\n“The proposals would lock in existing financial differences between clubs by preventing owner capital investment,” Kieran Maguire, a football finance lecturer at the University of Liverpool, tells The Athletic.\nAdvertisement\n“This means that an owner could not fund a new stadium, for example — as we have seen with Tony Bloom at Brighton.\n“By having the Super League playing an extra 14 games-plus per season, they would have a huge financial advantage over other clubs and so disruption — as seen by the likes of Chelsea, Manchester City and others (in recent decades) — would be eliminated and the status quo preserved.”\n6: “The world’s best football competition”\nIn developing a pan-European competition, the aspiration must be to create the most exciting sporting event in the world. Football fans deserve the best matches, and the best experience.\nIt is also critical that younger generations, attracted by globally expanding US sports and digital entertainment, continue to embrace football as the most loved sport in the world.\nThis can only be achieved with competitions that enable the world’s best players to compete throughout the entire season with exciting matches from beginning to end.\nMaking football more appealing to a younger audience is a problem FIFA and UEFA have grappled with in recent years. Shorter matches have been proposed, for example, while other prominent figures within the game have said it should replicate the successes of some American sports.\n“The final should be bigger,” Nasser Al-Khelaifi, the Paris Saint-Germain president and chairman of the European Club Association, told The Athletic in April 2022. “I can’t understand how the Super Bowl can feel bigger than the Champions League final.\n“The Super Bowl, and the US generally, have this mindset — creativity and entertainment. That’s what I have suggested, to have an opening ceremony to the Champions League, to have one match on the opening night where the (previous season’s) winners take on a big team — maybe it is not a good idea, but at least let’s challenge the status quo. Each match needs to be an event and entertainment.”\nAdvertisement\n7: “Improved fan experience”\nFootball is the people’s game and dialogue with fans and independent fan groups is essential to discover ideas which can improve the fan experience.\nAdditional measures should be taken to facilitate fan attendance at away games. There should also be standards for infrastructure to bring football stadiums up to consistent, high levels of quality, enhancing the live football experience.\nThe Football Supporters’ Association, the representative body for football supporters in England and Wales, was quick to distance itself from the plans. “The walking corpse that is the European Super League twitches again with all the self-awareness one associates with a zombie,” its chief executive, Kevin Miles, said.\n“Their newest idea is to have an ‘open competition’ rather than the closed-shop they originally proposed that led to huge fan protests. Of course, an open competition for Europe’s top clubs already exists — it’s called the Champions League.\n“They say ‘dialogue with fans and independent groups is essential’ yet the European Zombie League marches on — wilfully ignorant to the contempt supporters across the continent have for it.”\n8: “Develop and finance women’s football”\nFootball stakeholders should promote and develop the women’s game by putting it “centre stage”, side-by-side with men’s competitions. To achieve this goal, financing should be significantly expanded beyond existing contributions from women’s European club competitions.\nInvestments should be provided at both professional and grassroots level.\nIn April 2021, the Super League said a corresponding women’s competition would be launched, but did not provide any details on how this would happen. It was immediately criticised for failing to consult key figures within the women’s game on the plans.\nAdvertisement\nOn Thursday, A22 provided slightly more information on how it intended to “promote and develop the women’s game” — but not much. It did, however, promise to increase funding to women’s football from current levels.\n9: “Significant increase in solidarity”\nGrassroots solidarity is an essential pillar of European football and should be increased far beyond current levels. As previously announced, a minimum of €400million per year to non-participating clubs, social causes, and investment in grassroots – more than two times the contribution from existing European club competitions – should achieve this objective.\nTransparency should be ensured via the supervision of independent authorities with clear annual reporting on spending and its impact.\nA22’s approach to grassroots football is similar to its eighth pledge, the one on women’s football. It says a new Super League would increase funding for grassroots football “beyond current levels”. It also says “independent authorities” will help ensure that the money is spent “transparently”.\nThe Football Association, which is responsible for grassroots football in England, previously came out in opposition to any breakaway competition.\n10: “Respect For European Union law and values”\nEuropean football and its stakeholders must embrace the values, laws and fundamental freedoms of the EU. Further, no European club should be forced to dispute resolution systems outside the EU rule of law.\nThe jurisdiction of sport arbitration should be strictly limited to matters of sport. Any other disputes should be addressed to the appropriate forum. All cases should be under the ultimate supervision of the judicial system of the EU.\nA22’s 10 proposals for a revamped tournament is the biggest development in the Super League story since an initial setback for the company in December at the European Court of Justice in Luxembourg, in a challenge to what it claims is monopoly control by UEFA.\nAdvertisement\nAdvocate-general Athanasios Rantos proposed then that the court recognise UEFA’s authority over European football competitions.\nAn official ruling from the court is expected before the end of the 2023-24 season and is likely to shape the future of the European game as we know it.\nGO DEEPER\nThe battle continues: The European Super League has been fighting its case in court\nReporting: Luke Brown, Nnamdi Onyeagwara, Omar Garrick\n(Top photo: Getty Images)",
  "word_count": 2375,
  "scraped_at": "2026-02-14T12:39:15.530099"
}