{
  "article_id": "c8164c0b2b6f",
  "url": "https://www.chattanoogan.com/2026/1/30/514120/Mayor-Kelly-Years-Of-Passion-And-Hard.aspx",
  "title": "Mayor Kelly :  Years Of Passion And Hard Work  Led To # 1 Spain Training At Baylor School",
  "date": "20260131T031500Z",
  "domain": "chattanoogan.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Latest Headlines\n- Latest Hamilton County Arrest Report\n- Notre Dame, Boyd Buchanan Claim D-II District Titles\n- Mocs Softball Chattanooga Challenge Openers\n- McCallie Leading Baylor In D-II State Wrestling\n- Lee Lady Flames Softball Drop Two Games At North Greenville\n- CSAS's Anthony Named One Of Top Drawer Soccer’s 10 Best…\n- UTC Men's Tennis Drop 4-3 Loss To Visiting Kennesaw State\n- Delta State Scored In the Top Of The 10th To Win 4-3…\n- Lookout Mountain, Ga. To Offer Longevity Bonuses For…\n- UTC Men Entertain Western Carolina On Saturday\n- Friday, January 30, 2026\nMayor Tim Kelly on Friday said “years of passion and hard work growing the sport of soccer here has led to this historic moment” of the top-ranked Spain soccer team setting up World Cup camp in Chattanooga.\nHe said, \"Hosting Spain, the No. 1 seed in the tournament, is an incredible honor and cements our recognition on the world stage as a great soccer city. I encourage Chattanoogans to embrace Spain’s national team and show them the love and hospitality that makes our city so special. La ciudad de Chattanooga da la bienvenida a la selección nacional de España con los brazos abiertos.” T\nThe Chattanooga Host City Authority, comprised of the city of Chattanooga, Baylor School, Vision Hospitality Group, Hamilton County, Chattanooga Tourism Co., and the Sports & Events Corporation, announced that Chattanooga has officially been selected as the Team Base Camp for the Spain National Football Team. Spain’s official announcement of its Team Base Camp selection is available here.\nOne of the world’s most iconic and successful squads, commonly known as La Roja, will call Chattanooga its home as it prepares for the planet’s largest sporting event, taking place June 11-July 19 across the United States, Canada, and Mexico.\nLa Roja will train at Baylor's cutting-edge soccer complex, designated as the training site, where elite facilities will support their pursuit of glory. Beyond training, Spain’s players, their families, media representatives, and supporting delegations will enjoy world-class hospitality across multiple Vision Hospitality Group properties, ensuring comfort and privacy as they prepare for the tournament.\n“This is an extraordinary opportunity for Baylor and for the Chattanooga community,” said Baylor Head of School Chris Angel. “Baylor has long embraced a global focus, and we are both honored and thrilled to be selected as a training site for such a prestigious international sporting event. Hosting Spain places our school on the world stage and reflects the exceptional quality of our campus, facilities, and infrastructure to support elite athletic performance.”\nMitch Patel, founder and CEO, Vision Hospitality Group, said, “We are proud to serve as the host city and host hotels for the Spanish National Team. This is a historic moment for Chattanooga and an opportunity to showcase our city’s hospitality, culture, and spirit to the world.”\n“Welcoming the world’s top soccer team to Hamilton County is a historic opportunity for our community,” said County Mayor Weston Wamp. “From thriving youth academies to high school state championships to loyal professional soccer fan bases, Chattanooga is known for the best soccer culture in the South. We’re thrilled to host Spain and showcase our city, our schools, and our hospitality on a global stage.”\n“Chattanooga is thrilled to serve as the official training camp for Spain's national team,\" said Barry White, president and CEO of Chattanooga Tourism Co. \"As the top-ranked team in the world, Spain brings global attention to our community and we're excited to share our welcoming hospitality with our international visitors as we work alongside the organizing committee to provide a world-class experience.\"\n“Our community’s strength comes from unity, and now Chattanooga and La Roja stand together as one extraordinary force,” said Tim Morgan, president of The Sports & Events Corporation. “We are ready and excited to give Spain’s National Team a true home away from home.”\nSpain’s selection of Chattanooga comes after a rigorous evaluation process by team officials and tournament partners, who assessed training sites across North America for field quality, privacy, security, infrastructure, and proximity to match venues. Chattanooga met every benchmark, earning the confidence of organizers. When the team arrives, the delegation will include players, coaches, technical staff, medical personnel, and essential support teams.\nOperations during the team’s stay will be conducted under comprehensive security and confidentiality protocols coordinated with local and regional agencies. Additional information regarding scheduling, media access, and potential community engagement opportunities will be released in the coming months.\nOfficials said, \"Chattanooga has built a proud legacy as a premier soccer destination. Our community has welcomed global powerhouses like the U.S. Women’s National Team in 2015, the U.S. Men’s National Team for an exhibition match in 2017, and most recently served as a Team Base Camp for Auckland City FC last summer. With world-class facilities, two thriving pro clubs, and coordinated support from our community and local partners, Chattanooga offers the infrastructure, resources, and passion needed to support Spain’s preparation for competition against the world’s most iconic teams.\"\nTo stay up to date on Spain’s journey and find opportunities to cheer La Roja to victory, visit rfef.es/en.\n- Breaking News\n- 2/14/2026\n- Prep Sports\n- 2/13/2026\n- Sports\n- 2/13/2026\n- Prep Sports\n- 2/13/2026\n- Sports\n- 2/13/2026\n- Prep Sports\n- 2/13/2026\n- 2/14/2026\nHere is the latest Hamilton County arrest report. (If your case is dismissed, just email us your name and date we ran it and we will promptly take off. Email to news@chattanoogan.com ) ADAMS ... more\n- 2/13/2026\nThe Lookout Mountain, Ga. fire and police department has been having a longevity issue said Police Commissioner Taylor Watson. She and Chief Justin Lewis have a new plan that they hope will improve ... more\n- 2/13/2026\nThe U.S. Environmental Protection Agency will hold a public meeting on Tuesday, to update the community on the Chattanooga Lead Superfund Site, including the new EPA Lead Directive and a related ... more\n- 2/12/2026\n- 2/13/2026\n- 2/13/2026\n- Copyright © 2026 Chattanoogan.com",
  "word_count": 1000,
  "scraped_at": "2026-02-14T12:38:28.728166"
}