{
  "article_id": "c81e2315c699",
  "url": "https://www.bbc.co.uk/sport/football/66414642",
  "title": "Netherlands 2 - 0 South Africa : Jill Roord and Lineth Beerensteyn score in World Cup win",
  "date": "20230806T081500Z",
  "domain": "bbc.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Netherlands 2-0 South Africa: Jill Roord and Lineth Beerensteyn score in World Cup win\n- Published\nNetherlands manager Andries Jonker says his team have come to the Women's World Cup \"with the conviction that we can beat everybody\" after securing a quarter-final spot against Spain.\nThe Netherlands were forced to endure several anxious moments before defeating South Africa and booking a place in the last eight.\nThey will have to face Spain without experienced midfielder Danielle van de Donk, who picked up a second yellow card of the tournament and is suspended.\nFormer Arsenal player Van de Donk, a Champions League winner with current club Lyon, broke down in tears at full-time knowing she will miss the quarter-final after starting all 15 World Cup games in Netherlands' history.\n\"We have this conviction, it's not the last game for Danielle. It's very disappointing she got a yellow card but we can't change it,\" said Jonker.\n\"Danielle has very specific qualities that we really need and we will miss those qualities.\n\"But we've got a lot of other good midfielders and that's what we'll need to work out over the next few days.\"\nJill Roord, Manchester City's new club record signing, nodded the Netherlands ahead but South Africa went close to equalising several times against the 2019 runners-up.\nBanyana Banyana captain Thembi Kgatlana was once again a real handful and forced four fine saves from Daphne van Domselaar, Aston Villa's new goalkeeper, in front of a crowd of 40,233 at Sydney Football Stadium.\nLineth Beerensteyn doubled the lead after a mistake by South Africa keeper Kaylin Swart in the second half.\nThe Netherlands will return to New Zealand to face Spain in Wellington on Friday at 02:00 BST for a place in the semi-finals.\nAnother lightning start\nThe Netherlands are two wins from reaching back-to-back finals after another lightning start to a game at this tournament.\nRoord's early header, after Lieke Martens had been denied by a clearance off the line, was the sixth time they have scored inside 20 minutes.\nTheir second goal was a gift, Swart allowing a seemingly routine shot by the recalled Beerensteyn to slip through her grasp and into the net.\nIt was a horrible moment for the keeper but it secured the Netherlands their third win of the tournament after an outstanding goalkeeping display by Van Domselaar.\n\"Daphne saved us a few times and I was happy to lead 1-0 at half-time,\" added Jonker.\n\"But the part of me that wants great football is disgruntled with the first half, where we gave the ball away too much.\"\nThe Netherlands have had a near-perfect World Cup so far and were only denied victory over four-time world champions the United States by Lindsey Horan's equaliser.\nJonker, the former assistant to Louis van Gaal at Bayern Munich and Barcelona, has been tasked with going one step further than previous World Cup, when Sarina Wiegman's side were defeated 2-0 by the USA in France.\nThe Netherlands head into the quarter-finals in fine form and with Spain in their sights.\nSouth Africa bow out with heads high\nBanyana Banyana are heading home but they have certainly left an impression at this World Cup.\nTheir players have brought joy with their dancing and singing before and after games, while on the pitch their exciting fast-paced attacking play has entertained fans.\nAnd all this despite a dispute with their national association. South Africa's players will receive $50,000 (£39,000) each from Fifa for reaching the last 16, but nothing from the South Africa Football Association (SAFA).\nDespite this, they have been a joy to watch with their late win over Italy in their final group game sending them into the knockout stage for the first time.\nSouth Africa went toe-to-toe with the Netherlands despite losing Jermaine Seoposenwe and Bambanani Mbane to injury before half-time.\nThe impressive Kgatlana has caused huge problems with her pace at this World Cup, scoring twice and assisting another two goals, and she was once again dangerous against the Netherlands.\nThe 27-year-old had five of South Africa's seven attempts on target in this match but found herself frustrated by Van Domselaar.\nWill Banyana Banyana be back in 2027?\n\"As a group we need to hold our heads up high,\" said manager Desiree Ellis.\n\"When we reached the last 16 the whole country went crazy and I'm expecting them to go crazy when we get back as well.\n\"The whole of South Africa should be very proud of this team.\"\nEllis had a message to the government and sponsors to step up if women's football in the country is to push on.\n\"To the sponsors: I don't know how you can ignore something special like this,\" she added. \"What this team has achieved, the corporate world needs to stand up and really take notice and be counted.\"",
  "word_count": 806,
  "scraped_at": "2026-02-14T13:26:33.808343"
}