{
  "article_id": "c823a0d8839f",
  "url": "https://runnermag.ca/2024/10/the-final-match-reviewing-christine-sinclairs-last-hometown-game/",
  "title": "The Runner | The final match : Reviewing Christine Sinclair last hometown game",
  "date": "20241021T041500Z",
  "domain": "runnermag.ca",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "The final match: Reviewing Christine Sinclair's last hometown game\nBC Place was electric on Oct. 15 as fans cheered and waved goodbye to the Canadian soccer legend\nCanadian soccer player Christine Sinclair’s last hometown appearance on Oct. 15 was a night to remember as her Portland Thorns secured a dominant 6-0 win over the Vancouver Whitecaps Girls Elite in the CONCACAF W Champions Cup, held at BC Place.\nIt was more than just a match — it was a tribute to Sinclair, who, after a legendary career, played her final game in front of the fans who’ve watched her rise from a local talent to a global icon.\nThe atmosphere in the stadium was electric from the start. Sinclair, who was born Burnaby, B.C., had announced her retirement from professional soccer at the end of the National Women’s Soccer League (NWSL) season, making this match her swan song in her hometown.\nFans from all walks of life flooded BC Place, holding signs that read “Thank You, Sinclair” and wearing jerseys with her iconic number 12. The cheers were deafening, even before kickoff, and only grew louder as the night went on.\nWhile Isabella D’Aquila shined with two goals and three assists, and teammates Alexa Spaanstra, Payton Linnehan, and Reyna Reyes each added goals of their own, the night belonged to Sinclair. She scored one goal herself, and, when her name was announced, the roar of the crowd over the loudspeaker was unforgettable.\nIn the 84th minute of the game, Sinclair netted a goal from a tight angle, capping her final appearance in front of B.C. fans with the poise and precision that have defined her career. Minutes later, when she was subbed off, the stadium erupted again in a standing ovation. As she clapped to the fans and hugged her teammates, it felt like the end of an era.\nFor those of us who have followed Sinclair’s career since the early days, this moment was bittersweet. I remember watching her as a teenager, already showing flashes of brilliance and thinking she was something special.\nBut none of us could have predicted she would become the all-time leading international goal scorer with 190 goals, more than any man or woman in the history of the game. She became more than just a Canadian hero — she is a symbol of resilience, humility, and excellence on the world stage.\nHer contribution to women’s soccer has been monumental. From leading Canada to Olympic medals to being a trailblazer for the sport in North America, Sinclair has inspired generations of players, including myself.\nAs a young girl who loved soccer, seeing her influence in a male-dominated world made me believe I could achieve my dreams, too. She wasn’t flashy and she didn’t seek the limelight, but that’s what made her so special. Sinclair let her performance on the field speak for itself, showing us all that greatness is about consistency, dedication, and love for the game.\nBack to the match, the Whitecaps, who are mostly comprised of teenage academy players, fought valiantly but struggled to contain Portland’s relentless attack. Early on, Vancouver had a couple of promising chances, with Jaime Perrault and Jeneva Hernandez Gray coming close to opening the scoring. But once D’Aquila netted the first goal in the 23rd minute, the floodgates opened. Morgan McAslan, Vancouver’s goalkeeper, made several key saves, but Portland’s clinical finishing proved too much.\nAs the night wore on, D’Aquila’s playmaking abilities were on full display, assisting on goals from Spaanstra and Reyes, while Linnehan and Sinclair added to the tally. By the time Sinclair left the field, the score was 5-0, and Reyes capped it off with a sixth goal in injury time.\nFor Sinclair, the win was fitting, but for the fans, it was about more than just the result. It was a chance to say goodbye to a legend, someone who has meant so much to Canadian soccer and women’s sports worldwide. Watching her leave the field one last time in her hometown felt like closing a beautiful chapter in the story of Canadian soccer.\nSinclair will be remembered as a true icon of the game, and for those of us who’ve had the privilege to watch her play, her legacy will live on far beyond the final whistle.",
  "word_count": 714,
  "scraped_at": "2026-02-14T12:18:45.833797"
}