{
  "article_id": "c8353bc0add3",
  "url": "https://www.newsbusters.org/blogs/nb/brent-baker/2023/01/09/washington-examiners-liberal-media-scream-mrcs-assessment",
  "title": "Washington Examiner  Liberal Media Scream  With the MRC Assessment",
  "date": "20230109T234500Z",
  "domain": "newsbusters.org",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Since late January of 2012, the Washington Examiner’s Paul Bedard has once a week featured a “Mainstream Media Scream” selection in his “Washington Secrets” column. For each pick, usually posted online on Monday, I provide an explanation and recommend a “scream” rating (scale of one to five).\nThis post contains the “Liberal Media Screams” for 2021 and 2022.\n> For 2020. For 2019. For 2018. (Re-named “Liberal Media Scream” as of June 11, 2018.) “Mainstream Media Screams” for:\n> July-December 2017 posts; January through June 2017; July to December 2016; for January to June 2016; for July to December 2015; for January to June 2015. (2012-2014 are featured on MRC.org: For 2014; for June 17, 2013 through the end of 2013. And for January 31, 2012 through June 11, 2013.)\nCheck Bedard’s “Washington Secrets” blog for the latest choice and his other Washington insider posts. Each week, this page will be updated with Bedard’s latest example of the worst bias of the week.\n(For more of the worst liberal media bias, browse the Media Research Center's Notable Quotables with compilations of the latest outrageous, sometimes humorous, quotes in the liberal media.)\n■ December 26, 2022: No Liberal Media Scream this week.\n■ December 19, 2022: Liberal Media Scream: Martha Raddatz lets Biden off on border crisis\n(Washington Examiner post)\nThis week’s Liberal Media Scream features a bizarre line of thinking about the historic border crisis from ABC’s Martha Raddatz, a trusted media voice who wants to shift the blame to Republicans.\nHosting Sunday’s This Week, Raddatz suggested that since President Joe Biden never explicitly said that the border is open, then he’s not to blame for the crisis despite months of signaling that the former Trump administration’s border closings were being lifted.\nInterviewing Texas Gov. Greg Abbott, Raddatz said: “I don’t think I’ve ever heard President Biden say, ‘We have an open border, come on over,’ but people I have heard say it are you, are former President Trump, are [Florida Gov.] Ron DeSantis. That message reverberates in Mexico and beyond.”\nShe doubled down on the impact of Republicans acknowledging the reality of the open border: “Smugglers use all those kinds of statements.”\nFrom Sunday’s This Week:\nRADDATZ: You talk about the border wall, you talk about open borders, I don't think I’ve ever heard President Biden say, 'We have an open border, come on over.’ But people I have heard say it are you, are former President Trump, are Ron DeSantis, that message reverberates in Mexico and beyond. So they do get the message that it is an open border and smugglers use all those kinds of statements.\nABBOTT: It was known from the time that Joe Biden got elected that Joe Biden supported open borders. It is known by the cartels, who have sophisticated information, whether or not the Biden administration is going to enforce the immigration laws or not is known across the world but, most importantly, known among the cartels.\nRADDATZ: And how do you play into that? What can you do better?\nABBOTT: So we have every level of government doing everything we can to prevent people from coming into the country illegally or repelling them or arresting them and putting them behind bars.\nBrent Baker, vice president of research and publications for the Media Research Center, explains our weekly pick: “How ludicrous a line of reasoning. President Biden’s open border policies speak louder than any words he may not have explicitly said. And since when does denouncing a policy mean you are advocating for that reality? By that reasoning, journalists like Raddatz were promoting Trump policies every time they denounced them.”\nRating: FOUR out of FIVE SCREAMS.\n■ December 12: Liberal Media Scream: MSNBC and Beschloss democracy wins only if Democrats do\n(Washington Examiner post)\nThis week’s Liberal Media Scream features presidential historian and MSNBC regular Michael Beschloss with the latest spin that only Democrats are good and all Republicans are bad.\nTalking about the Georgia victory of Sen. Raphael Warnock, he even took it a step further. The victory secured democracy for another minute.\n“This was a really good week for our democracy,” MSNBC’s resident presidential historian declared on Friday’s The 11th Hour with Stephanie Ruhle, citing Warnock’s win in Georgia and how “Donald Trump has continued to implode.”\nHe suggested the GOP is on its deathbed for nominating Herschel Walker in the race at the suggestion of former President Donald Trump.\nPointing to Trump, he said, “If the Republicans continue to beat this horse of Donald Trump, and stick to him, which they may have to because of presidential primaries, the Republicans themselves may die, too.”\nBeschloss on Friday’s The 11th Hour on MSNBC, with substitute host Alicia Menendez:\nAlicia, I think this was a really good week for our democracy. I have been enjoying almost every minute. And I hope that all of our friends watching feel the same way.\nYou know, beginning with Rev. Warnock, you know, this is, he’s been elected to a six-year term in Georgia. Martin Luther King’s church pastor in Atlanta. Well, 1960, Martin Luther King was locked up in a Georgia prison that was so dangerous that Coretta Scott King thought there was a danger that he would be killed in prison.\nLook how far things have come.\nThis is a week in which Donald Trump has continued to implode. You know, let’s think about what might have happened this week had the Republicans won in those battleground states. Those election-denying candidates, they might have, losers might have said we really won. We should be installed. There should be violence in the streets. Almost none of that happened.\nYou know, the fact that we are living in a peaceful country that really, this last month, has resembled the way things used to be in this country in terms of democracy, I think we have to pause and enjoy. And the other thing is when you are thinking about Donald Trump and the Republican Party. Look at history. When parties do not adapt to public opinion, they die.\nThat happened to the Federalists in 1816. War of 1812, they remain the pro-British party. Happened to the Whigs, they did not adapt to changing views on slavery. And if the Republicans continue to beat this horse of Donald Trump, and stick to him, which they may have to because of presidential primaries, the Republicans themselves may die, too.\nBrent Baker, vice president of research and publications for the Media Research Center, explains our weekly pick: “Such crocodile tears from Beschloss, as if such a hardcore left-wing advocate, who sees “a really good week for our democracy” because a liberal Democrat won a Senate seat after a bunch of Republicans lost Senate and gubernatorial contests, would be upset if the Republican Party were to die.”\nRating: FOUR out of FIVE SCREAMS.\n■ December 5: Liberal Media Scream: Video flashback of NYT in the tank for Team Biden\n(Washington Examiner post)\nThis week’s Liberal Media Scream features an archived New York Times video that, richly and deservedly, shows just what an embarrassment the liberal outlet’s coverage of the Hunter Biden affair was.\nImagine suggesting that the Hunter Biden laptop story, covered in conservative media but ignored during the 2020 campaign by liberal outlets such as the New York Times, was akin to pizzagate or birther charges against former President Barack Obama. Well, that’s exactly what the Gray Lady did in a video bragging about how smart she thought she was.\nFLASHBACK: See how the @nytimes Opinion folks trashed the Hunter Biden laptop scoop as \"conspiracy theories and lies\"-- like Birtherism and Pizzagate! -- in a Feb. 4, 2021 video on how Biden beat Trump.\n— Tim Graham (@TimJGraham) December 5, 2022\nBiden won by \"not engaging with the nuttiness.\"https://t.co/yJmcEC9CQZ pic.twitter.com/oEYlglCL4ZA New York Times video posted on YouTube in February 2021 trashed the Trump campaign for highlighting the Hunter Biden laptop story, as the narrator charged the campaign “wrapped” the story “with layers of conspiracy theories and lies.”\nNewsBusters Executive Editor Tim Graham, with our partner for the weekly Liberal Media Scream, the Media Research Center, came across the embarrassing video Monday morning. Of course, the paper this year conceded that the Biden computer story was very real, and it linked the Biden family to potentially scandalous business dealing with China.\nFrom a New York Times opinion video posted on Feb. 4, 2021, on YouTube:\nThough Trump has had more controversies than I can count, Biden had one too: A booby trap that could have brought down his entire campaign, his son, Hunter. For sure, there are some awkward truths about Hunter, from his drug problems to his business dealings around the world.\n[One screen: New York Post with the headline: “Biden Secret E-mails”]\nTeam Trump then wrapped these with layers of conspiracy theories and lies.\nCLIP OF RUDY GIULIANI: This is Hunter Biden’s laptop. And when you look at the photograph section, it’s disgusting, and it includes a large number of underage girls.\nCLIP OF DONALD TRUMP JR: Money tied to human trafficking and prostitution rings and the other one, that’s another big one. The Chinese money. Joe Biden is compromised, 100%.\nNARRATOR: In politics, a conspiracy theory doesn’t have to be true to have legs. Think birtherism or pizzagate. ... Biden won this battle precisely by not engaging with the nuttiness.\nBrent Baker, vice president of research and publications for the Media Research Center, explains our weekly pick: “How embarrassing. Or at least it should be for the New York Times, though they probably lack the required self-awareness. The journalistic line today is that the news media suppressed the Hunter Biden laptop story because corporate media outlets couldn’t prove it was real, so they responsibly tilted toward the side of caution. This shows they were totally in the tank for Joe Biden, eager to discredit as a conspiracy any attacks on him from Donald Trump that may have damaged their preferred candidate.”\nRating: FIVE out of FIVE SCREAMS.\n■ November 28: Liberal Media Scream: New York Times’s Mara Gay calls Herschel Walker ‘insult to black Americans’\n(Washington Examiner post)\nThis week’s Liberal Media Scream features black New York Times columnist Mara Gay decrying the GOP’s pick of Herschel Walker as Georgia’s U.S. Senate nominee as an “insult to black Americans” from a party that she said has one clear goal: to stand against black people.\nIn the broadest racial smear, she not only said on MSNBC’s Morning Joe that Republicans are racists but that they are even worse by putting Walker up to challenger Sen. Raphael Warnock — as if voters had no say.\nAnd even in a more twisted way of thinking, she said Walker’s nomination somehow is a way for white people to deny black people democracy and promote “voter repression,” a false claim since the primary saw record voting.\nThe New York Times editorialist told Al Sharpton, “Given what the Republican Party has come to stand for and stand against, which, in part, is simply black people at this point, and access to democracy and to citizenship, the idea that the Republican Party, in 2022, would put forth a candidate who, among other things, is also a black man, to kind of usher in more voter repression and more of what the Republican Party stands for, is cynical.”\nOf course, show co-host Mika Brzezinski and Sharpton were in agreement.\nFrom Monday’s Morning Joe on MSNBC:\nMARA GAY: Given what the Republican Party has come to stand for and stand against, which, in part, is simply black people at this point, and access to democracy and to citizenship, the idea that the Republican Party, in 2022, would put forth a candidate who, among other things, is also a black man, to kind of usher in more voter repression and more of what the Republican Party stands for, is cynical.\nThe thing that makes it, though, really disturbing to me is just the overall message to voters, black and white, that one black man is just as good as another. One black man is the same as any black man. So it doesn’t matter if you’re Barack Obama. It doesn’t matter if you’re Raphael Warnock. It doesn’t matter if you’re Herschel Walker, they’re all the same. You’re all the same, and voters should see you that way. And it’s also just an insult to black Americans but to all voters.\nMIKA BRZEZINSKI: That’s the, I mean, sort of racist aspect of this is truly insulting.\nBrent Baker, vice president of research and publications for the Media Research Center, explains our weekly pick: “Instead of celebrating how blacks achieved the nominations of both parties to a U.S. Senate seat from a Southern state, MSNBC and the New York Times feel the need to denigrate the nominee who dares stray from the liberal political agenda. It’s Gay who is the ‘cynical’ one, belittling the candidate who doesn’t conform to her view of what a black man should represent politically. So much for any interest in diversity.”\nRating: FOUR out of FIVE SCREAMS.\n■ November 21: Liberal Media Scream: White Jeopardy champs hit for not knowing KBJ\n(Washington Examiner post)\nThis week’s Liberal Media Scream features the biggest screamers on CNN expressing dismay that three white Jeopardy champs didn’t know the newest Supreme Court associate justice, Ketanji Brown Jackson.\nMore than a week after the \"Tournament of Champions\" episode aired, the crew of CNN’s morning show were annoyed that contestants on the game show were unable to name \"KBJ” as the first black woman on the court.\nThe answer for which none of the three contestants could provide the question on the show aired Nov. 9: “She’s the first black woman on the Supreme Court and the first justice to have been a federal public defender.”\nAfter a clip, Don Lemon scoffed, “it’s just that these are smart people.” Kaitlan Collins sad-faced, “you’ve got to know about current events to be on Jeopardy.” And Poppy Harlow said, “she’s been in the news.”\nFrom Friday’s CNN This Morning:\nKAITLAN COLLINS: And then, remember earlier this month, it wasn’t the clue that raised eyebrows, it was the moment that followed. This moment.\nJEOPARDY HOST KEN JENNINGS: She’s the first black woman on the Supreme Court and the first justice to have been a federal public defender.\nJENNINGS: That’s Justice Jackson. Ketanji Brown Jackson.\nCOLLINS: I don’t think that’s that surprising. I will say. A lot of people don’t even know who’s on the Supreme Court.\nDON LEMON: It’s just that these are smart people. When you go on Jeopardy.\nCOLLINS: That’s a good point.\nLEMON: When you go on Jeopardy.\nPOPPY HARLOW: She was just confirmed! Right? She’s been in the news.\nLEMON: But listen, if you’re standing outside – I think Kaitlan’s right. If you're standing outside of a mall or whatever and people may not know, when they do the man-on-the-street thing, yes. But when you’re smart enough to be a contestant on Jeopardy.\nCOLLINS: You’ve got to know about current events to be on Jeopardy.\nLEMON: Yeah.\nCOLLINS: Maybe not be successful on Jeopardy.\nHARLOW: And history making ones.\nBrent Baker, vice president of research and publications for the Media Research Center, explains our weekly pick: “File under annoy a liberal by not recognizing one of their heroes. Numerous polls show the majority of the public doesn’t know the names of most Supreme Court justices, so not knowing the newest one is hardly a surprise. Maybe if CNN and the rest of the media had spent months smearing her reputation, as they’ve done with conservative justices Brett Kavanaugh, Clarence Thomas and Samuel Alito, she’d have a greater name ID.”\nRating: THREE out of FIVE SCREAMS.\n■ November 14: Liberal Media Scream: Sunny Hostin says GOP wants to raise voting age to save party\n(Washington Examiner post)\nThis week’s Liberal Media Scream finds some Democratic media celebrities just unable to sit back and savor the party’s escape from near death in the elections last week.\nExhibit A is The View’s Sunny Hostin, who claimed that younger voters, who “saved this country,” are being targeted by Republicans in some made-up bid to raise the voting age to 28.\n“When you look at the youth voter turnout in the 2022 midterms, they delivered key wins for the Democrats. Younger voters aged 18 to 29, which, by the way, now the Republicans want to raise the voting to age 28,” she said.\nUsing that as her straw man, she lashed out at Republicans, but no national GOP figure in Washington is seriously considering such a move.\nFrom the Nov. 14 The View:\n“Just like the Latina saved the Senate, young voters saved this country. We need to really understand that we are supposed to leave this world in a better place than we found it. When you look at the youth voter turnout in the 2022 midterms, they delivered key wins for the Democrats. Younger voters, aged 18 to 29, which, by the way, now the Republicans want to raise the voting to age 28.”\n“Younger voters were the only voter group by age to overwhelmingly support Democrats in the midterms. Sixty-three percent of voters voted for Democratic House candidates. I think, my friend, you know, Cornell Belcher — and you know Cornell as well — he says there are really two electorates. One older and one younger fighting to take this country in very different directions. The Republican Party has to get with it. They are dying out, and they are being extremist.”\nBrent Baker, vice president of research and publications for the Media Research Center, explains our weekly pick: “More crazy talk from someone on The View. And that’s saying something. Getting all excited about how the youth vote matched her personal liberal views is no surprise, but piling on with a ridiculous claim about how ‘Republicans’ want to hike the voting age to 28, raises again the question of what, if any, oversight ABC News has for their program or how she continues as an ABC News analyst.”\nRating: FOUR out of FIVE SCREAMS.\n■ November 7: Liberal Media Scream: Press trying to block GOP investigations, impeachment of Biden\n(Washington Examiner post)\nThis week’s Liberal Media Scream finds left-wing journalists giving up hopes that Democrats will hold Congress in tomorrow’s midterm elections and shifting to arguing against the very kind of politically driven investigations against Republicans that they have been cheering on for years.\nA media Republican critic, ABC’s Jonathan Karl, is leading the charge to convince Republicans that they shouldn’t spend their time looking into the host of Biden-related scandals the GOP has promised voters they will investigate, including Hunter Biden and the immigration crisis.\nFor example, on Sunday, as he hosted This Week, Karl tried to embarrass Virginia Gov. Glenn Youngkin on the planned investigations, suggesting that they weren’t what Republicans ran on.\nFive times he asked about “impeachment,” though as a governor, Youngkin would have no say in such a move against Biden or his Cabinet members.\nHouse and Senate GOP leaders have promised to open investigations into White House policies and scandals if they take control, just as Democrats have continued to do on former President Donald Trump.\nFrom Sunday’s This Week on ABC:\nJON KARL: I’m hearing a lot, though, of talk about investigations, investigations into Hunter Biden, FBI, all things Anthony Fauci, Republicans talking about going, you know, all-in if they take control of, particularly the House. Is that really what you’re campaigning on, to have massive investigations into all —\nVIRGINIA GOV. GLENN YOUNGKIN: I think that the House and the Senate and the White House are going to have to go to work and offer solutions. On top of that, our democracy is better when our Congress exercises its responsibility for oversight and they can also deliver answers. I think voters are going to make a statement on Tuesday, and they want their elected leaders to deliver results.\nKARL: What about all this impeachment talk? I mean, I’ve gone through — I can count at least three members of the Biden Cabinet that Republicans have talked about impeaching, and obviously, there have already been impeachment resolutions introduced, many of them for Biden himself. Would that be a mistake for Republicans to go in with impeachment?\nYOUNGKIN: Again, I believe strongly our democracy is better when our Congress exercises its oversight functions.\nKARL: Impeachment?\nYOUNGKIN: The reality of this is Virginians are gonna vote for congressional representatives, and I think that we’re going to see a number of seats flip, and they want them to go to work to deliver.\nKARL: But let me press you on that, though, commonsense kitchen table issues, that’s what you’ve been talking about. Is that what voters have in mind impeaching, an impeachment of Joe Biden? I’m hearing that a lot.\nYOUNGKIN: You know, I don’t know — I don’t know if —\nKARL: Would that be a mistake is all I’m asking.\nYOUNGKIN: I can’t speculate on what they’re going to do. What I can tell you —\nKARL: What they should do is what I’m asking?\nBrent Baker, vice president of research and publications for the Media Research Center, explains our weekly pick: “After liberals and the media lowered the impeachment bar by trying to impeach President Trump multiple times, the last time after he was already out of office, Karl has some gall to admonish Gov. Glenn Youngkin about the inadvisability of impeaching President Biden. Karl seems to be trying to stymie any impeachment efforts by getting Republicans to repudiate it. Youngkin wouldn’t play his game.”\nRating: FOUR out of FIVE SCREAMS.\n■ October 31: Liberal Media Scream: CBS argues democracy drowns in GOP election wave\n(Washington Examiner post)\nThis week’s Liberal Media Scream features the media’s final push to sway voters to Democrats, arguing that a Republican victory in the upcoming midterm elections will be the end of democracy.\nIn liberal cheerleading that sounded more like fearmongering, some stars of CBS News said they can’t warn America enough that a Washington not led by President Joe Biden, House Speaker Nancy Pelosi (D-CA), and Senate Majority Leader Chuck Schumer (D-NY) is a threat to everyone.\n“I don’t think we’re nearly alarmist enough,” said liberal media critic Margaret Sullivan on CBS News's Sunday Morning program, which featured similar comments from host Jane Pauley and correspondent Robert Costa.\nHere’s a collection of what they said yesterday:\nSunday Morning Host Jane Pauley: To begin, we’ll look ahead to the midterm elections. This past summer, it was looking like the Supreme Court decision to overturn Roe v. Wade might offer an opportunity to the party in power, the Democrats. But a more recent issue, inflation, could very well rule the day and favor Republicans. And beneath it all, says our Robert Costa, lies what could be the most critical issue of all, the very future of our democracy.\nRobert Costa: Hundreds of candidates for state and national office have denied the legitimacy of the 2020 presidential election. And while crime and inflation dominate the headlines, many are sounding the alarm about what else is at stake in 2022.\nMichael Berkman, Director of the McCourtney Institute for Democracy at Penn State: Democracy doesn’t usually die through coups or invasion. It usually dies from within.\nCosta: The Republican Party is gripped by people who are election deniers. How should the press contend with that? It’s happening inside one particular party.\nMargaret Sullivan: Right. And we need to be very straightforward about saying that and pointing it out. Of course, we are going to hold both parties to the same standards. It’s not that we’re on one team. We hold both parties to the same standards, but when one party is the one who is doing this very troubling thing, we need to be straightforward about that. And if it causes criticism from the Right, that’s OK.\nCosta: Margaret Sullivan is the former public editor of the New York Times and was the media critic at the Washington Post. She has a new book, Newsroom Confidential, in which she says the press has been reluctant to forcefully call out attacks on democracy for fear of being labeled partisan.\nCosta to Sullivan: How does the press cover it without sounding alarmist at every step?\nSullivan: I don’t think we’re nearly alarmist enough. I think we need to stop being asleep at the switch and sound the alarm more about what could happen if election denialists are in power and decide, 'Oh well, we only like the results of this election, but not that one.' I mean, we no longer have a country anymore.\nBrent Baker, vice president of research and publications for the Media Research Center, explains our weekly pick: “Pauley and Costa serve here as liberal political operatives pushing a Democratic polemical line so many journalists find compelling: Vote Democratic, or the nation will end as we know it. Such unjustified fearmongering — the kind of fearmongering they condemn when employed by anyone on the Right. And to treat Sullivan, who spent years at the Washington Post discrediting any media figure who dared challenge the liberal worldview, as some sort of beacon of journalistic integrity, is rich.”\nRating: FOUR out of FIVE SCREAMS.\n■ October 24: No Liberal Media Scream this week.\n■ October 17: Liberal Media Scream: It’s Biden’s communications, not his policies, failing him\n(Washington Examiner post)\nThis week’s Liberal Media Scream features a line from a Biden supporter that, frankly, both sides roll out when they are failing miserably: It’s not the president’s policies that are a disaster but how his team is communicating them that are.\nMaria Teresa Kumar, president of Voto Latino, rolled out that old line while arguing for President Joe Biden on Sunday’s Meet the Press.\n“With Biden, his challenge is that he hasn’t been able to communicate to the American people what he’s done,” she said, citing student loan payoffs and his focus on manufacturing.\nShe went on to suggest that Biden is a “policy president,” and that is a harder sell than former President Donald Trump’s communications about “undermining elections,” though he arrived in Washington with a long list of policy initiatives that he acted on including reducing regulations, limiting illegal immigration, and establishing a basis for Middle East peace.\nKumar on Sunday’s Meet the Press:\n“With Biden, his challenge is that he hasn’t been able to communicate to the American people what he’s done. I mean, we can say that the difference between Donald Trump and the difference within Biden is Biden is a policy president. So, he’s going to make fundamental changes for a generation. And we’re talking about student loan relief. We’re talking about bringing back manufacturing, and the list goes on.\n“But the difference with Trump is that his consequence is not policy. It’s his legacy of undermining elections. And it’s not just him, it’s not him, but he actually has a cadre of individuals right now seeking office that are election deniers. And that legacy is far more dangerous for a modern-day president than any other thing because it believes in undermining our democracy.”\nBrent Baker, vice president of research and publications for the Media Research Center, explains our weekly pick: “More media delusion. Blame the messengers for the public’s failure to appreciate President Biden for the great things he’s supposedly achieved. Biden has nearly the entire news media on his side, doing all they can to boost him and his policies, so if his approval is still underwater, the messenger isn’t the problem. It’s the message.”\nRating: FOUR out of FIVE SCREAMS.\n■ October 10: Liberal Media Scream: Psaki says if media don’t cover, Hunter Biden isn’t news\n(Washington Examiner post)\nThis week’s Liberal Media Scream shows the ridiculous spin liberal flacks are eager to use to deflate the Hunter Biden scandal story as the midterm elections near.\nIn focus this week is former Biden White House press secretary Jen Psaki, who said the Hunter Biden story is a big zero since she hasn’t seen it show up on the front pages of many of the nation’s newspapers.\nPsaki said on Meet the Press, “As much as there was so much news happening in Washington this week, it doesn’t always translate, and often doesn’t translate, to what voters are talking about in states. And I think that’s what we’re seeing currently.”\nFrom the roundtable on Sunday’s Meet the Press hosted by Kristen Welker:\nKRISTEN WELKER: President Biden and his wild week from the decision by OPEC to cut oil production, Jen, to these revelations at the end of the week in the Washington Post that investigators believe they do have enough evidence to charge Hunter Biden. It’s not clear he’s going to be charged, but how large is this looming over the president, over Democrats broadly?\nJEN PSAKI: Well, it was a big week here in Washington. So much news. I don’t even know how you decided what to talk about this morning, Kristen. But the truth is, you know, I looked at a bunch of local front pages this morning. And if you look at the front page in Nevada, they’re talking about Trump’s rally there and what it means for candidates in turning out to vote. If you look at the front pages in Pennsylvania, they’re talking about, “Mastriano, does he have a grassroots campaign or movement going?” And obviously, Georgia is quite focused on every latest development in Herschel Walker. So the truth is: As much as there was so much news happening in Washington this week, it doesn’t always translate, and often doesn’t translate, to what voters are talking about in states. And I think that’s what we’re seeing currently.\nBrent Baker, vice president of research and publications for the Media Research Center, explains our weekly pick: “How ridiculous. Some newspapers covering local news on their front pages do not prove a major development in the Hunter Biden scandal is not newsworthy. Newspapers carry more than one story. But it is true that the media’s power to ignore is its most insidious power, a power which most often benefits Psaki and her allies as the media agree with her news priorities and suppress news harmful to President Biden. So it’s rich to see her citing her media allies for vindication.”\nRating: FOUR out of FIVE SCREAMS.\n■ October 3: Liberal Media Scream: Media says ‘no problem’ on Biden’s mental flubs\n(Washington Examiner post)\nThis week’s Liberal Media Scream shows just how far the Washington press corps will go to look past President Joe Biden’s often embarrassing mistakes.\nInstead of raising questions about the president’s mental state after he called out for a dead lawmaker at a “major” speech last week, the media have been bending over backward to describe it as a sweet tribute, though a bit misplaced.\nThe incident was revived as Chuck Todd hosted his Meet the Press and interviewed Democratic spokeswoman Symone Sanders-Townsend.\nTodd on Sunday dismissed the importance of Biden embarrassingly calling out to the late Rep. Jackie Walorski (R-IN), seemingly unaware she was killed in a car crash more than a month earlier.\n“People make mistakes and you try to go from there,” Todd agreed after Sanders-Townsend defended Biden and his press secretary’s fumbled excuse for her boss.\nFrom the roundtable on Sunday’s Meet the Press:\nCHUCK TODD: Jackie Walorski died in a car accident in — I believe it was in August. She was a big part of this hunger [conference], and so that’s how this moment came about. Symone, how would you have handled that situation?\nSYMONE SANDERS-TOWNSEND: Look, Karine Jean-Pierre has a very tough job. I think she goes out there every single day, and a number of people could not do what she does every single day. Look, I think it’s very clear that the president had a slip of the tongue, obviously. And I’m sure he is extremely apologetic to the family of the congresswoman if he caused them any more trauma or agony.\nNo one — I mean, I think everyone understands that the president, unfortunately, uniquely understands how the family is feeling. And I’m sure he made that very clear to them when he came to the White House on Friday. Just acknowledge he had a slip of the tongue, move on, it’s unfortunate — again, life is here. He understands and empathizes. I think that’s what’s most important here. And I think Karine did try to do that.\nTODD: People make mistakes and you try to go from there.\nSANDERS-TOWNSEND: Yeah, yeah, we have all done it before.\nTODD: Fair enough.\nBrent Baker, vice president of research and publications for the Media Research Center, explains our weekly pick: “President Biden makes an embarrassing fumble which suggests he’s become more forgetful as he approaches 80 years old, but instead of examining the implications of such a level of confusion in a president, Todd is eager to excuse and dismiss its relevance. Not quite the same approach the Washington press corps displayed when questions arose about the cognitive ability of Presidents Reagan or Trump.”\nRating: FOUR out of FIVE SCREAMS.\n■ September 26: Liberal Media Scream: Stephanopoulos slips, says Trump would beat Biden\n(Washington Examiner post)\nThis week’s Liberal Media Scream shows just how reluctant the press are to tell the truth about how bad President Joe Biden’s polling is.\nAn ABC News/Washington Post poll was released on Sunday, and ABC’s George Stephanopoulos led This Week with some findings from it: Biden’s approval at 39%, most Democrats want a different candidate for 2024, Democrats “even” with Republicans in the midterm preference.\nBut it wasn’t until 44 minutes into his show that Stephanopoulos slipped that former President Donald Trump would beat Biden in a head-to-head election. It came as he picked up on panelist Chris Christie’s claim that Trump is losing support among Republicans. Stephanopoulos countered that “the polling right now is not really showing that. It’s showing, among Republican voters, he’s holding firm. Our poll shows him defeating Joe Biden in 2024.”\nIn fact, the poll put Trump at 48% to 46% for Biden, a finding that appeared in the 34th paragraph of a 35-paragraph story in the Washington Post.\nGeorge Stephanopoulos from Sunday’s This Week on ABC:\n“Chris Christie says this is slowly moving away from Donald Trump. And I think I actually agree with him. But the polling right now is not really showing that. It’s showing, among Republican voters, he’s holding firm. Our poll shows him defeating Joe Biden in 2024.”\nBrent Baker, vice president of research and publications for the Media Research Center, explains our weekly pick: “After all the legal onslaughts and renewed media hostility against Donald Trump over the past few months, the fact his own poll found Trump would still beat President Biden must really gall Stephanopoulos. That could have been the lead item to highlight from the poll, not one to bury as an aside deep in the show without even citing the specific numbers.”\nRating: THREE out of FIVE SCREAMS.\n■ September 19: No Liberal Media Scream this week.\n■ New on September 12: Liberal Media Scream: Yamiche Alcindor nails her Biden talking points\n(Washington Examiner post)\nThis week’s Liberal Media Scream shows that when some inside the Washington press bubble air concerns from outside the Beltway, there are those ready to push them back in line.\nWhen, on Sunday’s Meet the Press, host Chuck Todd said swing voters he talks to “all think” President Joe Biden is “too old to run again,” panelist Yamiche Alcindor pushed back with the latest Biden talking point: “The key issue will be whether or not them thinking President Biden is too old outweighs them thinking that the future of our democracy is on the line.”\nThe Washington correspondent for NBC News and host of PBS’s Washington Week argued that “when I talk to voters, even Democrats who say, 'Biden, he's a little slower, he’s a little bit quieter, I’m not sure if I want to back him.' When they think about the state of our democracy, they’re like, 'That's the bigger issue here.'”\nFrom the Sept. 11 Meet the Press on NBC:\nCHUCK TODD: The Biden situation, you know I’ve asked this question to swing voters all over the country. Some of them are Democrats, some are independents. And they’ve all said the same answer. They all think he’s too old to run again.\nYAMICHE ALCINDOR: Well, the key issue will be whether or not them thinking President Biden is too old outweighs them thinking that the future of our democracy is on the line. When I talk to voters, even Democrats who say, \"Biden, he's a little slower, he’s a little bit quieter, I’m not sure if I want to back him.\" When they think about the state of our democracy, they’re like, \"That's the bigger issue here.\" In our NBC poll, we saw people say the threats to democracy are their No. 1 thing, even above cost of living. So I think if you’re a Democrat, even if you’re Joe Biden, looking at this and saying, “OK, I understand people think maybe I should be a little bit more lively,” you’re still thinking they use the words “unrecognizable,” “distrust,” and that there should be some compromise.\nThose are words that I think are probably worse for Republicans, especially when you think of, while we might have a minority of Republicans who don’t believe that 2020 was fair, they’re the people with the loudest voices, right? They’re the people who are still winning the elections. That’s where the candidates are. And I think that, to me, is probably signaling that Republicans have a bigger problem here.\nBrent Baker, vice president of research and publications for the Media Research Center, explains our weekly pick: “How very convenient that the attitude of the press corps toward Biden and supporters of Donald Trump matches Alcindor’s pushback. They cannot accept that people across the country see Biden as too old, and so she reverts to trying to twist some anecdotal polling answers in order to show more really are upset by what journalists are obsessed with: Republicans focused on election integrity.”\nRating: THREE out of FIVE SCREAMS.\n■ New on September 5: Liberal Media Scream: Lefty bias finally catches up with CNN’s Harwood\n(Washington Examiner post)\nThis week’s Liberal Media Scream has an example of journalism’s leftist bias finally costing one of its own.\nNot long after CNN correspondent John Harwood was on the air last week blasting former President Donald Trump as a “dishonest demagogue,” the onetime Wall Street Journal reporter tweeted that he was out on the street looking for work.\n“Personal news: today's my last day at CNN,” he tweeted. “Look forward to figuring out what's next.\"\nHis departure followed that of another CNN lefty, media critic Brian Stelter. The cable company is under new management and reportedly weeding out those who made a living attacking Trump and his followers.\nHarwood, in the 10 a.m. hour on Friday, Sept. 2 of CNN Newsroom With Poppy Harlow and Jim Sciutto:\nWell, look, they are standing by the message that President Biden offered. Of course it was a political speech — we’re in a midterm reelection year. The issues that he’s talking about are inherently political, but I think it’s also important to say that the core point he made in that political speech about a threat to democracy is true. Now, that’s something that’s not easy for us, as journalists, to say. We’re brought up to believe there’s two different political parties with different points of view, and we don’t take sides in honest disagreements between them.\n“But that’s not what we’re talking about. These are not honest disagreements. The Republican Party right now is led by a dishonest demagogue. Many, many Republicans are rallying behind his lies about the 2020 election and other things as well. And a significant portion, or a sufficient portion, of the constituency that they’re leading attacked the Capitol on Jan. 6 violently. By offering pardons or suggesting pardons for those people who violently attacked the Capitol, which you’ve been pointing out numerous times this morning, Donald Trump made Joe Biden’s point for him.”\nBrent Baker, vice president of research and publications for the Media Research Center, explained our weekly pick: “Good riddance. Harwood abused his position as a White House correspondent, using his high-profile role to advance left-wing talking points in the guise of news reporting. Anyone seeing his departure as a sign CNN is shifting to the right doesn’t appreciate the basic journalism norms Harwood regularly violated, but if CNN is to re-gain respectability there are a lot more exits ahead.”\nRating: FIVE out of FIVE SCREAMS.\n■ August 29: Liberal Media Scream: MSNBC gushes over Biden — ‘Isn’t he the greatest?’\n(Washington Examiner post)\nThis week’s Liberal Media Scream features exactly what it takes for legacy news outlets to gush about President Joe Biden. Just hate former President Donald Trump — it’s as simple as that.\nOn MSNBC on Sunday morning, former federal prosecutor and cable network legal analyst Cynthia Alksne set the tone when she said of President Joe Biden, “Isn’t he the greatest?” It came after a guest host, Michael Steele, brought up how Biden had mocked Trump’s claim he could declassify any document. “He just has to sort of call it like he sees it, right?” Alksne said. Steele agreed: “He did.”\nFollowing the clip of Biden talking, Alksne added with a chuckle, “He’s out of malarkeys, that’s all. He’s just out of malarkeys.”\nFrom the Aug. 28 The Sunday Show With Jonathan Capehart on MSNBC:\nGUEST HOST MICHAEL STEELE: Cynthia, the White House has been in a very interesting spot here — a little bit ticklish, I would think. They’ve been careful not to make any statements that would seem to get folks excited or certainly impede the investigation or be perceived as doing so. But the president did allow a little slip this week. So—\nCYNTHIA ALKSNE: Isn’t he the greatest?\nSTEELE: Yeah, well.\nALKSNE: I mean, he just has to sort of call it like he sees it, right?\nSTEELE: He did.\nALKSNE: He’s staying away from it.\nSTEELE: He did. Let’s just take a listen. Let’s see what he said.\nREPORTER: President Trump said he declassified all these documents. Could he have just declassified them all?\nJOE BIDEN: Why, I just want to know. “I’ve declassified everything in the world. I’m president. I can do it all.” Come on! He declassified everything. I’m not going to comment because I don’t know the details. I don’t even want to know. I’ll let the Justice Department take care of that.\nSTEELE: Real quick.\nALKSNE: He’s out of malarkeys, that’s all. He’s just out of malarkeys [Steele laughs]. But that’s definitely true. This whole declassification argument is — is really kind of stupid.\nBrent Baker, vice president of research and publications for the Media Research Center, explains our weekly pick: “‘Isn’t he the greatest?’ Four words never before spoken about President Joe Biden. Only on MSNBC could you find anyone so impressed by Biden, but naturally, it’s not about his job performance but about Biden mocking the person the Left really hates, Donald Trump. That’s how you impress MSNBC hosts, guests, and viewers.”\nRating: THREE out of FIVE SCREAMS.\n■ August 22: Liberal Media Scream: Stelter’s last sanctimonious lecture at CNN\n(Washington Examiner post)\nThis week’s Liberal Media Scream says farewell to one of our regulars, CNN media critic Brian Stelter. His show was dumped last week, and he has decided to quit the slumping cable network.\nHe has been criticized over the years for harping on conservative media and ignoring the problems of liberal media.\nHe ended his final episode of CNN’s Reliable Sources on Sunday with a lecture in which he put himself on the side of decency and patriotism over demagogues and liars: “I know it’s not partisan to stand up for decency and democracy and dialogue. It’s not partisan to stand up to demagogues. It’s required. It’s patriotic. We must make sure we don’t give platforms to those who are lying to our faces,” he said.\nStelter wrapped up by championing CNN as critical to the survival of the nation and the planet: “I believe America needs CNN to be strong. I believe the free world needs CNN to be strong.”\nAnd that’s the watchword here: accountability. So this show's going away, but there’s going to be so many more. We need to have room for media criticism and debate and discussion. And we will. So much of the media ecosystem in 2022 is garbage. And so much of it is spectacular. The hard part is sorting out the treasure from the trash.\nThese are thorny, complicated things. I know I never had all the answers. I didn’t even always have all the questions. But it was the gift of a lifetime to get to confront these issues on international television with the backing of CNN.\nHere’s what I do know. I know it’s not partisan to stand up for decency and democracy and dialogue. It’s not partisan to stand up to demagogues. It’s required. It’s patriotic. We must make sure we don’t give platforms to those who are lying to our faces. But we also must make sure we are representing the full spectrum of debate and representing what’s going on in this country and in this world.\nThat’s why CNN needs to be strong. That’s why I believe CNN will always be strong. You viewers at home, it’s on you. CNN must remain strong. I know the 4,500 staffers are going to do their part to make it stronger than ever.\nBut it’s going to be on you to hold CNN accountable. And not just CNN, you've got to hold your local paper accountable. You've got to hold your local digital outlet accountable. It’s on all of us. We are all members of the media, all helping to make it better. That’s what I believe.\nI can’t wait to be watching CNN, seeing what happens here in the future. I’m going to be rooting for it. I want CNN to be strong. I believe America needs CNN to be strong. I believe the free world needs CNN to be strong. And it will continue to be, because all of us are going to help make that happen.\nThe free world needs a reliable source. So, for Reliable Sources, for the last time, I’m Brian Stelter. Thanks for being with us.\nBrent Baker, vice president of research and publications for the Media Research Center, explains our weekly pick: “Stelter, full of sanctimonious chutzpah, until the end. No acknowledgment of how he destroyed a 30-year franchise by turning it into a partisan hatefest more concerned with proving Donald Trump was ‘authoritarian’ and/or a ‘fascist’ than media criticism beyond relentless bashing of CNN’s more popular competitor, the Fox News Channel. For anyone interested in critiques of ‘mainstream media’ and why so many see so much fake news, he won’t be missed.”\nRating: FIVE out of FIVE SCREAMS.\n■ August 15: Liberal Media Scream: Andrea Mitchell slaps down GOP senator\n(Washington Examiner post)\nWhen you’ve covered Washington for nearly half a century, as 75-year-old Andrea Mitchell has, there can be a tendency to know-it-all-ism. Add in a marriage to a former Federal Reserve chief who once tried to broaden the definition of “recession” beyond two months of negative growth, and you’ve got a dog in the fight over when a recession is a recession.\nSo when Sen. Mike Rounds (R-SD) gave Mitchell, hosting NBC’s Meet the Press, the long-established definition of “recession,” she didn’t hesitate to challenge him.\nHer “That’s out of date, out of date!” won Mitchell our weekly liberal media scream award.\nThe exchange on the Sunday, Aug. 14, Meet the Press:\nANDREA MITCHELL: Given that they did take all this material, boxes of material and classified documents as well, and given how casual he was about securing documents — that’s been well established when he was president — do you think that should disqualify him from being president again? And would you vote for him if he runs?\nSEN. MIKE ROUNDS: I’ll keep my powder dry with regard to your last question. I think right now we’re going to focus on the 2022 election. We want to retake the House. We definitely want to retake the United States Senate. And I think in doing that, our goal is to focus on what’s going on right now with the American people. We’re going to focus on the fact that inflation is still over 8.5%. We’re still talking about GDP, which has been going down, and as you know, sharing breakfast with the chair, the former chairman of the Federal Reserve, anytime you got two quarters in a row, you are in a recession. We want to see us get out of that recession, and we certainly want to see gas prices come down. They’re still a buck and a half higher than when Joe Biden took office. Those are not good policies to run on for Democrats. We need to focus on that. And as we get past that and get into the 2024, I think the Republican will be well positioned, but let’s get past the 2022 election first.\nANDREA MITCHELL: And we’re not in a recession yet. But we’ll wait and see what does happen. And we really want to thank you. It’s very good that you came on today, Sen. Rounds.\nROUNDS: Two quarters tell you differently than that.\nMITCHELL: No, that’s out of date, out of date, even according to Republican economists, in any case.\nBrent Baker, vice president of research and publications for the Media Research Center, explains our weekly pick: “Please don’t castigate Trump supporters for supposedly undermining democracy by accusing corporate media of promoting ‘fake news’ when a veteran broadcast network star does just that — and does it without compunction, to correct a U.S. senator. Rounds wins this round. The facts are on his side. Mitchell conveyed embarrassing, pro-Biden rewriting of the definition of a recession.”\nRating: FOUR out of FIVE SCREAMS.\n■ August 8: Liberal Media Scream: Jane Pauley hypes climate agenda to ‘human extinction’ level\n(Washington Examiner post)\nThis week’s Liberal Media Scream brings us Jane Pauley, hosting the friendly CBS Sunday Morning, with a scary warning that “human extinction isn’t out of the question” from climate change.\nIt was jarring to see Pauley, once seen as the Today Show sweetheart, warning of death and destruction due to the worst of the leftist warnings on global warming.\n“So how bad can it get? According to some scientists, the possibility of worldwide societal collapse, or even eventual human extinction, isn’t out of the question,” she said.\nPauley’s tease at the top of CBS Sunday Morning on Aug. 7:\n“Good morning. I’m Jane Pauley, and this is Sunday Morning. Searing heat, massive wildfires, catastrophic flooding — unequivocal evidence, the United Nations says, that climate change is real and that human activity is its primary cause. So how bad can it get? According to some scientists, the possibility of worldwide societal collapse, or even eventual human extinction, isn’t out of the question. It’s a harsh warning, to say the least. And yet, this morning, Tracy Smith finds there is still reason for hope.”\nBrent Baker, vice president of research and publications for the Media Research Center, explains our weekly pick: “And journalists wonder why so many haven’t bought into the big government ‘climate change’ agenda pushed by President Biden and liberals. It’s this kind of over-the-top, dire fearmongering that does more to discredit the news media than any hot day or big rainstorm in August will ever do to get people to believe their freedoms must be curtailed in order to save humanity from the impacts of ‘climate change.’”\nRating: FIVE out of FIVE SCREAMS.\n■ August 1: Liberal Media Scream: ABC’s Karl Pleads for Jon Stewart to Make Run for President\n(Washington Examiner post)\nThis week’s Liberal Media Scream brings us another left-leaning weekend news magazine host urging a fellow liberal to get into politics and run for office, including the office of the president.\nLast week, it was Chuck Todd egging on Al Gore to run again. “Why not you?” said Todd, to which Gore demurred.\nThis week, we had Jonathan Karl, hosting ABC’s This Week, suggest the same to comic and activist Jon Stewart, who was in Washington last week in his latest campaign for Gulf veterans.\nKarl noted the career path of Volodymyr Zelensky, “a guy in Ukraine who is a comedian who had a very popular show, who is now a president of Ukraine.” Karl then added, “Is there any chance you run for office? I mean, you know, any office at all?”\nFrom ABC’s This Week, hosted by Jonathan Karl:\nJONATHAN KARL: I have heard you say — or say that you have thoughts in the past, you had given consideration of running for office. I think I have that correct. And, you know, look, we’ve had some precedent now. There’s a guy in Ukraine who is a comedian who had a very popular show, who is now a president of Ukraine. Some people think he’s a very good president. Is there any chance you’d run for office? I mean, you know, any office at all?\nJON STEWART: There is a chance that when I go down, I’m going to come back down there to Washington, and I’m going join my brothers and sisters on the Capitol steps who have been sleeping out on fire watch. Rosie Torres of Burn Pits 360, Tim Jensen of Grunt Style, and anyone else who wants to go down there and join them on the Capitol steps. And I will join them, and we will stay there until the United States government does the right thing by the men and women who fought to protect it. That’s what I’m after.\nKARL: All right, Jon Stewart, thanks a lot for joining us.\nBrent Baker, vice president of research and publications for the Media Research Center, explains our weekly pick: “For the second week in a row, an instance of a journalist putting his personal passions ahead of good journalistic judgment. Jon Stewart is a hero to the Left for his aggressive and crass attacks on conservatives, and that seems to excite Karl, who wants Stewart to consider turning that fervor into a candidacy.”\nRating: THREE out of FIVE SCREAMS.\n■ July 25: Liberal Media Scream: Even Al Gore perplexed by Chuck Todd’s 2024 push\n(Washington Examiner post)\nThis week’s Liberal Media Scream features Meet the Press host Chuck Todd egging former Vice President Al Gore into another bid for president, this time as a green candidate.\nOn his Sunday show, Todd proposed that Gore lead “a climate change presidential campaign in the future.” He asked, “Why not you, Al Gore?”\nThe former Democratic vice president appeared rightly perplexed and said, “Oh, well, thank you for making the suggestion. You know, I’m a recovering politician. And the longer I go without a relapse, the less likely one becomes.”\nCHUCK TODD: I’m not going to let you go without asking you this: Australia’s election was a climate change election. And you talked about, \"In order to get that political will.\" Jay Inslee tried to run a climate-focused campaign, and it didn’t get off the ground. Why not you, Al Gore?\nFORMER VICE PRESIDENT AL GORE: Why not me, as a candidate?\nTODD: Leading a climate change presidential campaign in the future.\nGORE: Oh, well, thank you for making the suggestion. You know, I’m a recovering politician. And the longer I go without a relapse, the less likely one becomes.\nTODD: But the idea of climate change and making it the issue, would you like to see more presidential candidates do it?\nGORE: Absolutely.\nBrent Baker, vice president of research and publications for the Media Research Center, explains our weekly pick: “Liberal dreams die hard for Democrats, and Chuck Todd can’t let go of what could have been — and what he imagines could be in the future. Thanks to his television show, we are all let in on what animates Todd’s political fantasies. Hard to imagine Todd ever yearning for another presidential run by any conservative.”\nRating: THREE out of FIVE SCREAMS\n■ July 18: Liberal Media Scream: CNN defends Biden, saying ‘governing is hard’\n(Washington Examiner post)\nThis week’s Liberal Media Scream features a key CNN host mouthing something rarely or never said during former President Donald Trump’s four years: Give the president a break because “governing his hard.”\nAmid historically low approval ratings, sky-high inflation, and a trail of foreign policy missteps, CNN anchor John King didn’t condemn the administration last Friday but instead offered a weak defense of Democratic inaction.\nDuring a discussion of this November's midterm elections, King showed a Republican TV ad and then said, “It is much easier to be the opposition party. Give the Democrats — give the Democrats some grace. Governing is hard, especially when you have tiny margins.”\nFrom Friday’s Inside Politics with John King on CNN:\nJOHN KING: This is a group, Mitch McConnell super PAC, if you will — that’s not exactly what it is but a leadership PAC affiliated with the want-to-be majority leader, the Senate Republican leader. This is in a Arizona Senate race, but you’re going to see this in tough Senate races all across the country.\nTV AD: Wasteful government spending is to blame for inflation. Sen. Mark Kelly was a deciding vote for President Biden’s spending spree. Sen. Kelly and President Biden spending trillions. What we get? Inflation, record gas prices, and soaring prices on groceries. Their spending spree worsened inflation.\nKING: It is much easier to be the opposition party. Give the Democrats — give the Democrats some grace. Governing is hard, especially when you have tiny margins. But ... that’s the challenge for Democrats: They need to get on the same page because the Republicans are just going to hammer with that.\nBrent Baker, vice president of research and publications for the Media Research Center, explains our weekly pick: “Not quite how CNN approached President Donald Trump and Republicans when his administration hit challenges ahead of the 2018 elections. Instead of showing grace to Republicans and regretting how governing is hard, CNN led the charge in putting up obstacles to make it even harder for Republicans and Trump to govern. And they certainly never trumpeted Trump’s successes. Just like an opposition party acts.”\nRating: FOUR out of FIVE SCREAMS\n■ July 4 and 11: No Liberal Media Scream these weeks.\n■ June 27: Liberal Media Scream: MSNBC officially joins DNC over Dobbs\n(Washington Examiner post)\nIt’s been something of a joke in conservative media that MSNBC should really call itself “MSDNC” because some of the cable network's hosts often echo talking points of the Democratic National Committee.\nBut this week, it’s become clear that it’s not a joke anymore, especially among the leading hosts who have been near tears since the U.S. Supreme Court ruled in the Dobbs case and sent the matter of abortion law to the states.\nThis week’s Liberal Media Scream features one of those hosts, Morning Joe’s Mika Brzezinski, who ranted against former President Donald Trump for naming the key conservative judges who have brought several victories to the Right this month. She didn’t just complain about the decisions of the court but implored her viewers to vote for Democrats.\n“For all the Democratic Party’s flaws, they’re the only party that can stem this continued rise of fascism. Register and vote. Work toward an overwhelming majority that can protect your body, protect your freedoms, and just may save our country,” she said in a speech that the show aired twice.\nMika Brzezinski on Monday’s Morning Joe on MSNBC:\n“I’ve been hearing from women all over the country and even around the world. This is devastating. And, you know, they asked me what we can do, and I’ve got two words: ‘Please vote.’ It was Winston Churchill who said that ‘democracy is the worst form of government except for all the others that have been tried,’ and the same might be said of the Democratic Party at this point. Democrats somehow managed to get the most votes and lose the most elections. So they need more. Even when they win, they lose.\n“It could be argued that today’s Democrats are too weak, too fragile, too woke, too elitist, too disconnected from the realities of working Americans, and yet the Democratic Party is the world’s last best hope against fascism, against an extreme, autocratic, anti-woman, anti-gay, anti-contraception, anti-freedom collection of fascists who dominate the Trump wing of today’s Republican Party. A group of fascists who even refuse to investigate the violent riots that their president launched on January 6 to overthrow a legitimately elected president. Why? Because they are fascists.\n“And now, they’re claiming control over your bodies, your health, your life. And they’ve promised they’re coming next to take away your birth control pills, and even what you do with another consenting adult in the privacy of your bedroom. To call Trump’s Republican Party and Trump’s Supreme Court extreme understates the danger these institutions pose to American freedom, to our democracy. They are fascists who have contempt for what 70% of Americans believe about Roe v. Wade, what 90% of Americans believe about universal background checks, and what you believe about your right to control your own body and your life.\n“So what does Donald Trump’s America look like? Joe sort of described it there. In reality, it looks like a 13-year-old rape and incest victim being ordered by the state to have a forced birth of her rapist’s baby. That’s where we are in 2022. And for all the Democratic Party’s flaws, they’re the only party that can stem this continued rise of fascism. Register and vote. Work toward an overwhelming majority that can protect your body, protect your freedoms, and just may save our country.”\nBrent Baker, vice president of research and publications for the Media Research Center, explains our weekly pick: “Unhinged seems the best word to describe Brzezinski’s angry rant, in which she not only impugned a good portion of her fellow Americans as ‘fascists’ but explicitly turned partisan in urging her viewers to vote for Democrats. So much for Morning Joe pretending to be any kind of ‘news’ program. And so much for her really having any kind of anti-fascist faith in democracy. The court’s ruling simply lets the elected official in each state determine its rules on abortion. What could be any more, small d, democratic?”\nRating: FIVE out of FIVE SCREAMS\n■ June 20: Liberal Media Scream: CNN’s Harwood is Biden’s defender in chief\n(Washington Examiner post)\nThis week’s Liberal Media Scream features CNN’s John Harwood defending President Joe Biden against claims he is too old to govern, even from liberal sources such as the Atlantic and CNN’s Brian Stelter.\nOn Stelter’s media show, Harwood tried to blame conservative media for pushing the age story, even after Stelter showed him an Atlantic story by a liberal journalist begging Biden to give up talk of a reelection campaign.\nFrom Sunday’s Reliable Sources on CNN:\nBRIAN STELTER: Where are Biden’s critiques about the media legitimate, where are they justified? And where would you say they’re not justified?\nJOHN HARWOOD: Well, look. Let’s talk about the age thing, to begin with.\nSTELTER: Let’s put up Mark Leibovich’s column. Mark Leibovich, top writer for the Atlantic, saying Biden should not run for reelection. It’s not just Sean Hannity talking about Biden’s age, it’s the Atlantic magazine.\nHARWOOD: That’s right. It was an outstanding piece by Mark. Without taking a stand on whether he’s too old to run for reelection, let me just run through what's true, what's false, and what gets conflated. What's true is the presidency is a hugely taxing job. Mentally and physically. And Joe Biden is old. He doesn’t talk or walk as smoothly as he once did. That suggests challenges. When you get into your 80s, which he’s about to do, the risk of health problems grows with every year.\nOn the other hand, what’s false is that he is not capable of doing the job right now or he’s not mentally in tune with the demands of the job. Anybody, any aide who engages with him or reporters, we can see this. The gears of his mind are working. That’s an issue pushed by right-wing media. But it’s not correct.\nAnd what gets conflated is this. President Biden is in a weak political position right now, and because he’s old, people think he’s weak because he’s old. His biggest political problem right now is $5-a-gallon gas. Gas is not $5 a gallon because Joe Biden’s old. His legislative program is not stymied in Congress because Joe Biden is old. It’s because he got a 50-50 Senate. And one of the members of that Democratic Senate comes from a Trump +39 state.\nBrent Baker, vice president of research and publications for the Media Research Center, explains our weekly pick: “Many Democrats and liberals have begun to show concern for Biden’s mental abilities as he ages, with even a front-page New York Times story on Democrats who don’t want him to run for reelection, as well as the Atlantic piece Stelter highlighted. Yet Harwood sees the world in black and white: liberals striving for what’s best and so must be defended, conservatives always malevolent and so must be denounced.”\nRating: THREE out of FIVE SCREAMS\n■ June 13: Liberal Media Scream: Indict Trump or else, says NBC expert\n(Washington Examiner post)\nThis week’s Liberal Media Scream features a new escalation of Trump Derangement Syndrome in the press over the Jan. 6, 2021, Capitol riots and former President Donald Trump.\nNBC contributor Eddie Glaude Jr. used his appearance on Meet The Press to claim after just one House hearing for the Jan. 6 special panel that Attorney General Merrick Garland can either indict Trump or watch the American justice system crumble.\nGlaude, a professor of African American Studies at Princeton University, said on the show that “if you don’t indict him, there is the end of the rule of law.”\nFrom Sunday’s Meet the Press:\nEDDIE GLAUDE JR.: The fact is that if we know that he [Trump] needs to be indicted or he’s broken the law in some way, but there’s a threat of violence if you indict him, and if you don’t indict him —\nCHUCK TODD: Isn’t there a threat of violence?\nGLAUDE: “If you don’t indict him, there is the end of the rule of law. So it’s the tragic choice that Merrick Garland faces, I think.”\nBrent Baker, vice president of research and publications for the Media Research Center, explains our weekly pick: “A Hobson’s choice? Glaude has already decided Trump is guilty of something bad and so must be charged. The choice is between two bad outcomes: Violence from his supporters or an end of the rule of law if he's not charged. Of course, there’s a third option: Allow the legal process to play out without political commentators like Glaude weighing in early to try to influence the outcome.”\nRating: FOUR out of FIVE SCREAMS\n■ June 6: Liberal Media Scream: 2024 must be near if Morning Joe is slamming ‘authoritarian’ DeSantis\n(Washington Examiner post)\nThis week’s Liberal Media Scream features one of the first indications that left-leaning news outlets are starting to believe Florida Gov. Ron DeSantis is emerging as the top choice to replace former President Donald Trump on top of the GOP 2024 ticket.\nExhibit A is MSNBC’s Joe Scarborough, who chastised DeSantis for vetoing $35 million for a new Tampa Bay Rays baseball practice facility after the team tweeted in favor of gun control.\nOn Monday’s Morning Joe, Scarborough went on a rant denouncing DeSantis for “punishing a public enterprise because of their political views.” He added of the likely 2024 GOP primary candidate: “It’s just craziness. This is not conservative. This is authoritarian. It’s plain and simple, and conservatives know that.”\nScarborough, a onetime Florida House member, on Monday’s Morning Joe on MSNBC, setting up guest Dave Aronberg, the state attorney for Palm Beach County, Florida:\n“If it were just about the sports stadiums, he could have vetoed it and said, ‘I don't support giving money to sports stadiums or sports outfits,’ when, of course, Marc [NBC reporter Marc Caputo] just pointed out, he does for ones he prefers. But again, there is an authoritarian streak here. If you tweet something that a governor doesn’t like, he will veto your spending, and he will tell you that’s why he vetoed the spending. He could have just vetoed it and said, ‘I don’t like sports stadiums,’ and leave it there. But no, he wanted people to know.\n“He’s punishing a public enterprise because of their political views with taxpayer money. Same thing again, I talked about it before with Disney. Talked about with cruise lines that wanted, at the height of COVID, to keep their people safe, to have them wear masks, which any doctor, sane doctor, would have said, 'This makes sense.' Told them they couldn’t do that. Told small businesses they couldn’t have mask mandates if that’s how they wanted to run their small business. Told school boards what they could or couldn’t do despite the fact there’s 67 counties in the huge state of Florida.\n“I mean, it’s just craziness. This is not conservative. This is authoritarian. It’s plain and simple, and conservatives know that.”\nBrent Baker, vice president of research and publications for the Media Research Center, explains our weekly pick: “Conservatives admire DeSantis because he takes it to those trying to undermine conservative values. Liberals like Scarborough don’t like him because he’s so effective at doing that, so they apply the media’s universal derogatory label to him, ‘authoritarian.’ Supporters of DeSantis would say that if he were a liberal Democrat doing the same thing, journalists would be praising him.”\nRating: FOUR out of FIVE SCREAMS.\n■ May 30: No Liberal Media Scream this week.\n■ May 23: Liberal Media Scream: CNN pushes absurd, white-blaming abortion conspiracy\n(Washington Examiner post)\nThis week’s Liberal Media Scream features one of America’s top liberal black voices and a regular CNN guest claiming that white conservatives oppose abortion because they fear becoming a minority race.\nAppearing on CNN Tonight last week, Michael Eric Dyson said that “white replacement theory” is the motivator behind why conservatives oppose abortion. “There’s a newfangled twist to it here — the explicit expression that we are fearful of genetically disappearing, right?” he said.\nData of mothers who report having abortions, however, show that more black people than white, 38%-33%, opt for the procedure.\nBut that doesn’t fit the Left’s posture that the hot-button issue boils down to racism, not religion or fostering life.\n“When you tie it all together, white replacement theory, anti-CRT argument, the insistence that abortion be banned and that white babies, in particular, be born — this is all of a larger piece. And that larger piece is the fear of whiteness disappearing in the face of a worldwide global expansion of people of color,” said Dyson, Vanderbilt University’s centennial chairman and university distinguished professor of African American and diaspora studies.\nDyson, on the May 18 CNN Tonight hosted by Laura Coates:\n\"So, as odd and as exceptional as the white replacement theory looks, there’s a newfangled twist to it here — the explicit expression that we are fearful of genetically disappearing, right? We know that in, what, 20-some-odd years, white people will no longer be the statistical majority in this country. And when you tie it all together, white replacement theory, anti-CRT argument, the insistence that abortion be banned and that white babies, in particular, be born — this is all of a larger piece. And that larger piece is the fear of whiteness disappearing in the face of a worldwide global expansion of people of color. And right here in this nation, we will not be replaced by Jews, by blacks, by Latinos and others. That’s part of the tragedy that has to constantly be dealt with and seen as a throughline from white supremacy, beginning before 1619 on down to today.\"\nBrent Baker, vice president of research and publications for the Media Research Center, explains our weekly pick: “So much for CNN becoming more rational under new ownership. Dyson’s ludicrous theory, beyond its wild conspiracy assumptions about a widespread effort by white people to eliminate ‘people of color,’ doesn’t make much sense. A much larger percent of pregnancies to black than white women end in abortion, so banning all abortions would mean the birth of more black babies compared to white ones.”\nRating: FOUR out of FIVE SCREAMS.\n■ May 16: No Liberal Media Scream this week.\n■ May 9: Liberal Media Scream: No Bias, Says CBS Reporter Now at Planned Parenthood\n(Washington Examiner post)\nThis week’s Liberal Media Scream features maybe the three most ridiculous words we’ve heard lately from a TV network: “We have standards.”\nIn this case, they were aired by an abortion activist who jumped from CBS to Planned Parenthood.\nKate Smith, who last month moved from CBS News to a newly created position at Planned Parenthood, senior director of news content, on Sunday denied her abortion activism came through in her reporting. On CNN’s Reliable Sources, she insisted: “We have standards, we have lawyers. Before anything goes on-air, there’s a thorough review of what’s going on.”\nShowing her hostility to her critics, she said, “I think these people just don’t understand how newsrooms actually work, they don’t have that kind of experience.”\nFrom Sunday’s Reliable Sources on CNN:\nBRIAN STELTER: Last year, though, National Review, the conservative outlet, called you — two years ago — “Planned Parenthood’s ambassador to CBS.” They said you were posing as a reporter and constructing articles that more closely resemble press releases than news. So, that was the charge when you were at CBS and now, you’re at Planned Parenthood. How do you react to the conservatives who said you were biased in your CBS coverage?\nKATE SMITH, PLANNED PARENTHOOD: Look, if you’re a blogger online, you might not realize all of the different layers that someone goes through before they publish a piece, before they go on-air. We have standards, we have lawyers. Before anything goes on-air, there’s been a thorough review of what’s going on. So, I stand by every article I write.\nAnd I would say making that accusation, you’re playing into the Right. Anybody who doesn’t fall by their rules, who isn’t anti-abortion, is against them. So, if you’re trying to cover this from a neutral point of view and you’re including both sides, they automatically think you are against them because they view doctors as anti — or, excuse me, for abortion. And they view them as biased, even though these are doctors we’re talking about.\nSo, I really reject all that criticism. Again, I think these people just don’t understand how newsrooms actually work, they don’t have that kind of experience. But yeah, completely reject that criticism.\nBrent Baker, vice president of research and publications for the Media Research Center, explains our weekly pick: “What a perfect encapsulation of the arrogance of the elite press corps. Conservatives joked that Smith, when at CBS News, was little more than a propagandist for Planned Parenthood. Then she proves it by joining the abortion group’s staff. Yet, she denigrates her critics as uniformed louts, claiming CBS ‘has standards,’ but apparently not standards that weed out an activist with a specific political agenda.”\nRating: FOUR out of FIVE SCREAMS.\n■ May 2: Liberal Media Scream: Of course CNN’s Stelter supports Biden’s ‘Truth Ministry’\n(Washington Examiner post)\nThis week’s Liberal Media Scream features CNN media critic Brian Stelter mocking the coverage of President Joe Biden’s new “Disinformation Governance Board,” dubbed the “Truth Ministry” by conservative foes and media.\n“There’s this incredible backlash to something that sounds like a basic government bureaucracy,” said Stelter on his Sunday show after his guest, Moira Whelan of the National Democratic Institute, described it as a harmless little effort.\nOur own media critic, Brent Baker of the Media Research Center, asked a question posed all weekend by those worried about the new board. What if former President Donald Trump had proposed a truth department like the one headed by Homeland Security Secretary Alejandro Mayorkas?\nFrom CNN’s Reliable Sources on Sunday, May 1:\nBRIAN STELTER: Here in the U.S., there’s been an uproar in recent days about the Department of Homeland Security setting up what they call a Disinformation Governance Board. This has been mostly a Foxworld story — it did come up earlier today on CNN's State of the Union, but I don’t think people know what it is and what it isn’t, and there’s just been a lot of right-wing uproar without knowing what it is, so are you aware of this at all? What is this all about?\nMOIRA WHELAN, NATIONAL DEMOCRATIC INSTITUTE: Aware of it. And I think the first thing is that it’s a board, exactly as we say. It is meant to bring together people to coordinate a lot of the efforts inside of DHS. That means law enforcement. That means emergency services like FEMA. They’ve all been doing counter-disinformation efforts for a while to give us accurate information about human rights abuses, but also about disasters and where people can get assistance. So coordinating that activity and making it speak with one voice and being a stronger advocate to tech companies and engaging the public and academia, that’s really what they’re after.\nSTELTER: Well, that sounds like common sense. But when I Google this, all I see is, like, “Joe Biden’s Ministry of Truth,” and they’re going to, you know, like, it’s — there’s this incredible backlash to something that sounds like a basic government bureaucracy.\nWHELAN: It is basic government bureaucracy ...\nBrent Baker, vice president of research and publications for the Media Research Center, explains our weekly pick: “What could be more ominous to a true journalist than a government agency setting itself up to judge what is disinformation? Sounds very Orwellian, compounded by the fact the woman chosen to run it has a record of spreading disinformation to advance the interests of liberal Democrats. Add it up, and condemning it should have been the top story on Stelter’s show. Imagine what his outrage would have been if this occurred during the Trump presidency.”\nRating: FOUR out of FIVE SCREAMS.\n■ April 25: Liberal Media Scream: MSNBC says DeSantis, Youngkin just like Russian rapists\n(Washington Examiner post)\nThis week’s Liberal Media Scream finds former President George W. Bush’s spokeswoman Nicolle Wallace moving from her crazed anti-Trump rants to attacking popular GOP governors, comparing their “dehumanizing” tactics to Russian troops who rape Ukrainian children.\nOn her MSNBC show Deadline: White House last Wednesday, Wallace said that the efforts by Florida Gov. Ron DeSantis and Virginia Gov. Glenn Youngkin to block explicit sex talk in kindergarten are based on the same motivations of Russians who are raping children in Ukraine.\nThe host said that by framing their actions as on behalf of “parental rights,” the two are hiding how they are really “dehumanizing” the LGBT community.\n“Dehumanization is a tactic that’s being used right now. Russians get their soldiers to rape children by dehumanizing them. Dehumanization as a practice is a tactic of war. It’s being deployed in our politics, and people like you and I sometimes lose the plot and admire its effectiveness,” she said.\nFrom Wednesday’s (April 20) show during a segment with guest Tim Miller of the Bulwark:\nNICOLLE WALLACE: You and even I fall into a tradition of, or profession of, focusing on what works. And I think we recently had a conversation about Mitch McConnell. And why does he do what he does? Because it works. It’s the political reality.\nAnd I worry that in covering Glenn Youngkin and his politics of “parental choice” [uses air quotes], all the focus was on how well it worked. And even in our conversations about DeSantis, it’s about how well they’re serving him. The truth is dehumanization as a tactic for politics is from war. Dehumanization is a tactic, it’s being used right now. Russians get their soldiers to rape children by dehumanizing them. Dehumanization as a practice is a tactic of war. It’s being deployed in our politics, and people like you and I sometimes lose the plot and admire its effectiveness.\nIt’s not acceptance, but even the analysis of these tactics loses sight of what this speech brings us back to, which is that dehumanization has a cost right now! Right now! As it’s being deployed, there are children — and Chasten Buttigieg made this point when \"don’t ask, don’t tell\" was introduced: Kids will die. How do we bring it back to the substance of the harm that is done by any strategy in war and politics of dehumanizing people?\nBrent Baker, vice president of research and publications for the Media Research Center, explains our weekly pick: “This is a particularly vile take, a low blow even by the standards of MSNBC. You can disagree with the particulars of a policy meant to protect children and the rights of parents to decide what sexual matters they are exposed to in school, or even say its advocates have ulterior motives, but to equate Youngkin and DeSantis with Russians raping children in Ukraine is disgusting and ends any rational policy discussion.”\nRating: FIVE out of FIVE SCREAMS\n■ April 18: Liberal Media Scream: Nothing’s Biden’s fault\n(Washington Examiner post)\nThis week’s Liberal Media Scream finds President Joe Biden making history — he may be the first president for whom nothing is his fault.\nWhile every president before him, Democrat or Republican, has had wars, inflation, or terrible policies hung around their neck, Biden’s media fans are finding others to blame for out-of-control inflation, historic illegal immigration, and bumbling decisions.\nLong gone are the Truman days, when the buck stopped at the Oval Office.\nOddly, it was a Clinton-era adviser this weekend who led the \"don’t blame Biden\" brigade. On his show, George Stephanopoulos looked past Biden when talking about border woes and inflation.\n“When it comes to inflation, there’s not much the president can do about it,” said the former communications aide to Bill Clinton.\nFrom the roundtable on Sunday’s This Week with George Stephanopoulos on ABC:\nGEORGE STEPHANOPOULOS: When it comes to inflation, there’s not much the president can do about it.\nMARIA ELENA SALINAS, ABC NEWS CONTRIBUTOR: There’s not much that he can do about it, but at the same time, people’s perception, and that’s what’s important. They look at the numbers, and it doesn’t matter that we have low unemployment, it doesn’t matter that the gas prices are beginning to go down a little bit. The perception is things are more expensive, and when I go to the market, everything is more expensive, even if it does start to get a little bit better. That’s the feeling that people have, and that’s what motivates people to go out and vote sometimes. Not necessarily fact, but the perception, what they’re feeling.\n....\nSTEPHANOPOULOS: Is this a wedge issue that cuts against Democrats?\nSALINAS: I think it definitely does. Now that you mentioned Title 42, what comes to mind to me is that it really depends on who’s talking. Of course, Republicans are going to say President Biden is opening up the border. But then critics are going to say it’s too little too late. Why didn’t he do this before? Remember, this is a health initiative. It’s not an immigration policy that was implemented, so if the CDC is already allowing kids to go back to school, people going back to baseball games and football games, why do they continue to have this at the border when they forced these people to put up these camps, when the \"stay in Mexico\" policy, why are they not allowing them in before? So, you’re between a rock and a hard place. It’s really difficult for the administration. It’s like you’re damned if you do and you’re damned if you don’t.\nBrent Baker, vice president of research and publications for the Media Research Center, explains our weekly pick: “Poor, poor Biden. After enacting policies that caused the problems (on inflation, massive new government spending and hampering domestic energy production; on the border, stopping the building of Trump’s wall and allowing illegal immigrants to pass into the United States while awaiting asylum decisions), he’s now helpless to solve the problems he’s exacerbated. How about he reverse his policies? This media spin is reminiscent of the hapless Carter years, when the media painted the presidency as overwhelmed until Reagan proved the problem wasn’t the office but who was in it.”\nRating: THREE out of FIVE SCREAMS.\n■ April 11: Liberal Media Scream: Stuck with Biden, Dems push anti-Trump scare tactics\n(Washington Examiner post)\nThis week’s Liberal Media Scream focuses on the raw reality of just how bad the 2022 political landscape looks for floundering Democrats stuck with a deeply unpopular President Joe Biden.\nInstead of promoting the type of unity agenda Biden promised in his Inaugural Address, key strategists said the party should deploy anti-Trump scare tactics.\n“You have to remind folks what America looked like, the dumpster fire that Joe Biden got from Donald Trump, and make it clear that Donald Trump still owns that party and intends to waltz back into the White House if we let him,” said Patrick Gaspard, CEO of the Center for American Progress, on Sunday’s weekly The Circus on Showtime, hosted by political-media insiders John Heilemann, Mark McKinnon, Alex Wagner and Jenn Palmieri.\n“Democrats better not f*** this up,” said Heilemann.\nBelow are two portions from the show. And a warning that the video includes language that may be considered offensive.\nMARK McKINNON: What’s your outlook for the midterms and what do Democrats have to do to overcome all the challenges?\nTERRANCE WOODBURY: When you look at a place like Georgia, a place like Florida, where there’s very likely to be a person of color at the top of the ticket, they have to reach Obama-level support amongst black voters. And so when we start to see that approval rating drop to 73, 72 percent amongst black voters, I can tell you right now, any Democrat running statewide in 2022 that has 73% of the black vote has lost, full stop. There is no path to victory.\nMcKINNON: Wow.\nWOODBURY: I think that we have to put Donald Trump back on the ballot. When you talk to voters, this idea that if we don’t vote it could lend to a shift in partisan power in Congress, not motivating to them to all. But when we later asked, what if I told you if Republicans win the House then Donald Trump will be president in 2024? Every single hand went up.\nMcKINNON: Oh really, interesting.\nWOODBURY: Every single hand. Now that right there, we can’t let that happen.\nMcKINNON: Interesting.\n.......\nPATRICK GASPARD: I’m only suggesting that in addition to the affirmative message that we have about successes, you’ve got to be clear they only win by punching hard. You have to remind folks what America looked like, the dumpster fire that Joe Biden got from Donald Trump, and make it clear that Donald Trump still owns that party and intends to waltz back into the White House if we let him.\nJOHN HEILEMANN: If raising the stakes is really important, what’s at stake?\nGASPARD: We’ve already seen the consequences of what happens when we allow the Donald Trump extremists to run our country. We had people overrunning the capitol, parading the confederate flags, chasing down the vice president of the United States.\nHEILEMANN: It’s basically like high stakes.\nGASPARD: The highest stakes ever, beyond inflation, beyond jobs, beyond gas prices.\nHEILEMANN: Democrats better not f*** this up.\nGASPARD: Democrats can’t f*** this up. Democrats cannot f*** this up.\nBrent Baker, vice president of research and publications for the Media Research Center, explains our weekly pick: “Yes, a fine example of the Democratic-news media alliance. To win, we both must scare voters. Democratic strategists formulate a plan to vilify Trump even more and journalists nod along in agreement about how key the strategy, which they will eagerly push, is to the survival of the nation.”\nRating: FOUR out of FIVE SCREAMS.\n■ April 4: No Liberal Media Scream this week\n■ New on March 28: Liberal Media Scream: GOP can’t quiz a black judge without being dubbed ‘racist’\n(Washington Examiner post)\nThis week’s Liberal Media Scream features an extreme example of the media’s portrayal last week of all GOP questions to Supreme Court nominee Ketanji Brown Jackson as racist.\nOn TV show after TV show and in liberal newspapers, GOP senators were called racists if they didn’t offer praise for the “historic” nominee — a ridiculous standard, especially for a pick with a rookie appeals court record and who wouldn’t even define what a “woman” is.\nBut some went further, charging that Republicans simply don’t want black judges on the court, which might come as a surprise to senior Associate Justice Clarence Thomas, the lone black judge on the court — and a conservative. He was chosen by former President George H.W. Bush, who rejected questions that he picked Thomas only because of his race, as you can see in the above C-SPAN clip.\nSubsequent Democratic presidents, Bill Clinton and Barack Obama, didn’t name a black judge to the highest court.\nOn Real Time with Bill Maher, host Bill Maher actually said of Republicans, “I think they would be thrilled to have no black seats on the court.” Guest John Heilemann, national affairs analyst for NBC News and MSNBC, agreed, calling the GOP questions “racist top to bottom through the whole week.”\nFrom Friday’s Real Time:\nBILL MAHER: We have the first black woman, let’s go back — some of the people who don’t remember this also. The first black we’ve ever had, we’ve only had two, Thurgood Marshall [in] 1967. When he died, it was — George [H.W.] Bush ... was president, and so they accepted the idea there was now a black seat on the court, and that’s how we got Clarence Thomas. Now, I thought it was not exactly cricket to give the black seat to someone who didn’t represent the majority of black thinking in America, but here’s the difference. At least they accepted, George Bush did, the idea of at least one black seat on the court, right? I think today’s Republicans would not do that. I think they would be thrilled to have no black seats on the court. OK, a lot of them. OK, so —[Applause]\nJOHN HEILEMANN: Judging by the way they treated this nominee, which was racist top to bottom through the whole week.\nBrent Baker, vice president of research and publications for the Media Research Center, explains our weekly pick: “The casualness with which these two leading media figures accuse an entire political party of virulent racism is in itself astounding, confusing a preference for conservative over liberal policies for racism. All Republicans I know would be ‘thrilled’ to replace every white liberal on the court with conservative black men and women.”\nRating: FOUR out of FIVE SCREAMS.\n■ March 21: Liberal Media Scream: Judge Jackson so ‘perfect,’ criticism is racist\n(Washington Examiner post)\nThis week’s Liberal Media Scream features how the Left has a simple word to hit critics of President Joe Biden’s first Supreme Court pick, Ketanji Brown Jackson: racist.\nOn Sunday’s media panels and last Friday’s The View on ABC, liberals declared the rookie federal appeals court judge so qualified that she is perfect. Thus, questioning her can only be racist, they said.\nWe’re featuring The View here and criticism of the first black woman nominated to the high court by Republicans such as Sen. Josh Hawley.\nCo-star Whoopie Goldberg called Jackson “outstanding\" and better than the three white judges former President Donald Trump nominated. Guest host Eboni Williams went straight to racism when she said, “You know what bus is always on time? The one that indicts the determinations of the qualifications of black women in this country. And so that bus is never late.”\nGoldberg agreed: “That’s what’s scary to them. And it’s like, if you say you want the brightest, the greatest that we have, she's a perfect representation of that.”\nFrom Friday’s The View on ABC:\nWHOOPI GOLDBERG: Just based on the people, the last three people they put in. You know, this is a woman who can — who can outshine each and every one of those people.\nEBONI WILLIAMS: Very literally.\nGOLDBERG: Her abilities are outstanding. I mean, she’s outstanding. So, you put in Amy Coney Barrett, you put in the other one, you know, and you’re questioning her?\nWILLIAMS: But Whoopi, let’s not pretend we don’t know what this is about. You know what bus is always on time? The one that indicts the determinations of the qualifications of black women in this country. And so that bus is never late.\nGOLDBERG: It’s never late.\nWILLIAMS: It’s never late. And I want to say this: Based off the fact that this will be one of the only Supreme Court justices — to your point of that example of the last three we got — who will be confirmed by bipartisan nature — I’m sorry, already has been at the appellate level by the United States Senate, she’s overqualified. Let me go on record in saying that. She’s overqualified.\nGOLDBERG: That’s what’s scary to them. And it’s like, if you say you want the brightest, the greatest that we have, she’s a perfect representation of that.\nWILLIAMS: Yes.\nBrent Baker, vice president of research and publications for the Media Research Center, explains our weekly pick: “How tired of an argument. Instead of addressing the substance of the criticism, or simply accepting that some will have a less upbeat interpretation of a nominee’s judicial record, Goldberg and Williams jump directly to dismissing the criticism as prompted by racism. Is it ever possible to criticize an African American and not be called racist by someone in the media?”\nRating: FOUR out of FIVE SCREAMS.\n■ March 14: Liberal Media Scream: NYT says Trump would have killed NATO by now\n(Washington Examiner post)\nThis week’s Liberal Media Scream features the latest reason why a Trump Derangement Syndrome vaccine for the press should be developed — and its use mandated.\nDuring a Meet the Press panel focused on the war in Ukraine, the discussion turned to former President Donald Trump and the tussle over what he would have done compared to what President Joe Biden has done.\nNew York Times Pentagon correspondent Helene Cooper cut to the chase, offering to “game out” Trump’s move, which she said would have been the destruction of NATO in two weeks.\n“NATO, at this point, would have been completely divided. You would see disunity. You would see other NATO countries peeling off. What are we going to do? The alliance would be broken,” she said on the NBC show.\nDuring his presidency, Trump demanded that NATO allies start paying their fair share of expenses and stop relying on the United States to supply the bulk of money and troops. In his game of hardball, he also cut troops in Germany, sending some home and redistributing others.\n\"We don't want to be the suckers anymore,\" Trump said. \"We're reducing the force because they're not paying their bills; it's very simple.\"\nBut the Times reporter said that was a preview of his plans to kill NATO, which she then said Pentagon generals held off until the election for Biden to stop. Former Trump national security adviser-turned-critic John Bolton has also claimed the former president would have pulled the U.S. out of NATO.\nFrom the March 13 Meet the Press roundtable:\nNew York Times Pentagon correspondent Helene Cooper: “I would love to just game out where we would be right now if Donald Trump was still president and Vladimir Putin had invaded Ukraine. First of all, Trump, who would already have pulled us out of NATO, because that’s what he wanted to do. He had already started pulling American troops out of Europe. The Pentagon had kind of stalled that until Biden came into office.\n“The first thing he would have said is, ‘It’s not our problem. Ukraine is not our problem.’ That’s it. 'Go off and do,' you know, 'this is not our business.' And NATO, at this point, would have been completely divided. You would see disunity. You would see other NATO countries peeling off. What are we going to do? The alliance would be broken. So, let’s make sure, when Trump is saying this stuff about how much differently — just if President Trump was president right now, we would be in a completely different place.”\nBrent Baker, vice president of research and publications for the Media Research Center, explains our weekly pick: “Despite all the policy changes from the Trump years made by the Biden administration which pleased Vladimir Putin, such as ending arms sales to Ukraine and making the U.S. more dependent on importing oil and gas, Cooper can’t see past her Trump myopia: Everything must be worse if Trump is involved. And she overlooked one little fact: When Trump was in office, Putin didn’t invade.”\nRating: THREE out of FIVE SCREAMS.\n■ March 7: Liberal Media Scream: Lester Holt fights truth that cops are where crime is\n(Washington Examiner post)\nThis week’s Liberal Media Scream features a rare case of a news source pushing back against the bias of a big-shot news host, this time NBC anchor Lester Holt’s view that minorities are targeted by biased police.\nDoing the pushing back was former President Donald Trump’s attorney general, William Barr, who challenged Holt’s positive view of Black Lives Matter and rejected the liberal statement that police are racists.\nIn a special about Barr, who is pitching his new book, One Damn Thing After Another: Memoirs of an Attorney, the former attorney general was his typical matter-of-fact self, stopping Holt dead in his tracks when he said, “Black men are the subject of three times as many traffic stops by police.”\nBarr responded, “That sometimes is a function of where the police are. Police go where the crime is.”\nFrom the Sunday night NBC News special, \"Bill Barr: In the Eye of the Storm\":\nLESTER HOLT: Can we talk about the \"big lie\"?\nBILL BARR: Which one is that?\nHOLT: Well, you write about the \"big lie\" being Black Lives Matter.\nBARR: Yeah.\nHOLT: What did you mean by that?\nBARR: Black Lives Matter is based on the premise that the main threat to black welfare in the inner city are out-of-control police force that gratuitously kill African Americans. That’s simply not borne out by the facts.\nHOLT, NARRATION: As the nation’s top law enforcement official, Bill Barr always had hard-line views on crime and how to fight it. In 1992, when Barr was attorney general the first time, he wrote a memo called “The Case for More Incarceration” — the kind of tough, \"lock ‘em up\" policy that’s been cited as a leading cause of destabilizing black communities.\nHOLT TO BARR: 1 in 3 black men will be incarcerated sometime in their lifetime, 1 in 17 for white men. Can you not see how that shapes the perception and makes people want to rally around the idea of Black Lives Matter?\nBARR: Well, I understand the perception, and I think there’s ambivalence. That’s what I have found on the one hand, there is a concern that, when they encounter police, they’re not given the benefit of the doubt and they’re treated as second-class citizens, and there’s definitely that concern. On the other hand, I think they also understand that the police are there to try to make their community safer, that it’s a very tough job and they want more police.\nCROWD: Black Lives Matter! No justice, no peace! No justice, no peace!\nHOLT: In society, do you believe there’s such a thing as systemic racism?\nBARR: I actually think the whole idea is a cop-out. I think racism exists in people’s, individual’s souls.\nHOLT: By dismissing systematic racism, are you not dismissing the pain of African American families that have to sit down with their children and have “the talk” because they’re afraid a simple traffic stop could lead to their deaths?\nBARR: No, I don’t — you know, I don’t — I don’t ignore that —\nHOLT: \"Dismiss\" is the term I used.\nBARR: I don’t dismiss that as a reality. I don’t think that police are racist and, as a general matter —\nHOLT: You don’t see bias in police?\nBARR: No, in every study of the situation that I’m familiar with says there is no bias. The numbers are the product of the number of interactions police have.\nHOLT: Yeah, and black men are the subject of three times as many traffic stops by police.\nBARR: Right. And that sometimes is a function of where the police are. Police go where the crime is.\nBrent Baker, vice president of research and publications for the Media Research Center, explains our weekly pick: “Since it happens so rarely, it’s great to see an interviewee press back in real time against the loaded liberal premise pushed by a star TV journalist. Holt seemed baffled that someone wouldn’t see the world through his liberal prism, where America is racist and police enforce that racism, and thus Black Lives Matter should be treated as a heroic cause.”\nRATING: THREE out of FIVE SCREAMS.\n■ February 28: Liberal Media Scream: Greek gods gave Biden his court pick, says CNN star\n(Washington Examiner post)\nJust when reports have suggested that the new leadership at CNN planned to steer the cable network away from its lefty bias, this week’s Liberal Media Scream features one of its stars declaring that President Joe Biden’s Supreme Court pick is so great that she appears to have descended from Mount Olympus.\nMinutes after Biden announced Friday his selection of Judge Ketanji Brown Jackson as his pick to replace retiring Justice Stephen Breyer, CNN senior legal analyst Laura Coates called the nominee “almost a legal deity” despite having served at the appeals level for less than a year.\nGushing on CNN, she said that Jackson’s achievements, “frankly, sounded as if Mount Olympus decided to choose and give her each of the credentials and gave this great, almost a legal deity, of sorts.”\nAnd as if that wasn’t enough, she said, “I’m not sure I’ll be able to remove this smile off my face today. I am unbelievably proud, in this moment, to have witnessed what I just did.”\nCoates regularly anchors CNN’s Don Lemon Tonight on Friday nights.\nCoates, during CNN Newsroom With Alisyn Camerota and Victor Blackwell, last Friday:\n“I have to tell you, my heart feels full. I’m not sure I’ll be able to remove this smile off my face today. I am unbelievably proud, in this moment, to have witnessed what I just did. Not only did I see the vice president of the United States behind her, but also seeing this profoundly talented, eloquent, well-versed in the law and dignity and humanity, to relay why she ought to be exactly where she is today.\n“Hearing her talk about not only her quest and love of the law, having her invoke the late Constance Baker Motley, speak about her own relatives having been incarcerated — mine have as well, in some instances — the idea of the intersectionality we’re talking about, about all the different facets of what it takes to be who she is was just profoundly moving to watch and to see, and not the least of which as a mother to watch her speak about her children and about the reverence she has for her mentors throughout the field of law.\n“But most importantly, what I think she brings here is the knowledge of, 'Don’t we want somebody in the Supreme Court of the United States, only nine of them, to reflect the people of the United States?' Not just in scholarship, although her credentials, frankly, sounded as if Mount Olympus decided to choose and give her each of the credentials and gave this great, almost a legal deity, of sorts. And yet she disrupted the myth that you had to be but one thing in order to be a Supreme Court justice.”\nBrent Baker, vice president of research and publications for the Media Research Center, explains our weekly pick: “Another example of a journalist putting her personal political agenda and identity politics ahead of doing her job. The media are Biden’s base. If you portray a nominee as a God-like figure, it’s pretty hard for viewers to see your analysis as anything serious worth listening to.”\nRating: FOUR out of FIVE SCREAMS.\n■ February 21, 2022: Liberal Media Scream: Historian equates GOP vote reform to Lincoln’s assassin\n(Washington Examiner post)\nThis week’s Liberal Media Scream features a noted presidential historian drawing a direct line between Republicans who seek sensible voting reform expansion to Abraham Lincoln’s assassin, John Wilkes Booth.\nOn CNN to plug her Presidents Day book on Lincoln, Doris Kearns Goodwin Sunday showed again how unhinged liberals are on the matter of ballot reform, even proposals advanced by Republican governors and legislatures to make it easier to vote than in President Joe Biden’s home state of Delaware.\nGoodwin made the connection by suggesting that the last speech Booth heard from Lincoln, a Republican, was one calling for giving blacks the right to vote.\nLincoln, she said, hoped to extend the right to vote to “African Americans who had fought in the war. He then loses his life because that speech was where John Wilkes Booth heard him give that speech and decided now it’s time to kill him.”\nDrawing parallels to today, she charged, “Here we are, 150 years later, and there are people in the country now trying to get the idea that voting rights should be pulled back, rather than pushed forward.”\nGoodwin during on Sunday’s CNN Newsroom With Fredricka Whitfield:\n“I think the most important lesson that Lincoln provides for us today is on that larger challenge of the big crisis of, is our democracy in peril? In the first days of the Civil War, he said, right then, the central idea they had to fight was if the minority that loses an election, as the South did, could decide to break up the Union simply because they wouldn’t accept the peaceful transition of power, it would prove that democracy was an absurdity. And that’s why that war had to be fought right from the beginning. In the last speech he makes before he dies, just a few days before he dies, is talking about extending the right to vote to African Americans who had fought in the war. He then loses his life because that speech was where John Wilkes Booth heard him give that speech and decided now it’s time to kill him.\n“And here we are, 150 years later, and there are people in the country now trying to get the idea that voting rights should be pulled back, rather than pushed forward, people unclear about what happened in that election and claiming that an election fairly won was not fairly won. This is the fight that we have to be fighting. I think Lincoln would tell him, ‘This is your fight right now. Voting rights is central.’”\nBrent Baker, vice president of research and publications for the Media Research Center, explains our weekly pick: “That’s some unhinged hyperbole, arguing those who prefer 10 days to 12 days of early voting, or are part of the majority of all races who support voter identification, are on a moral par with a pro-slavery murderer who wanted to deny basic human rights based on race.”\nRating: FIVE out of FIVE SCREAMS.\n■ February 14, 2022: Liberal Media Scream: CNN’s Acosta went there, saying to ‘flush’ Trump\n(Washington Examiner post)\nThis week’s Liberal Media Scream features new evidence that the once proud and respected CNN has no plans to shift away from its ratings disaster and instead is doubling down on its hate for half of the country.\nLeading the charge was the grim and humorless Jim Acosta and his lecturing assault on former President Donald Trump and key GOP leaders in what could have been a mildly funny use of the Chinese Olympics to tackle his favorite targets.\nBut instead, his Saturday CNN Newsroom with Jim Acosta was just an overbearing slam of Republicans, Trump, Sen. Ted Cruz, House Minority Leader Kevin McCarthy, and Georgia Rep. Marjorie Taylor Greene.\n“Now that the GOP has failed to root out the problem, it’s up to the American people to flush as many times as possible,\" he said. \"Go Team USA.\"\nFrom the 4 p.m. hour on Saturday’s CNN Newsroom with Jim Acosta:\nJIM ACOSTA: If document preservation hypocrisy were an Olympic sport, Trump would easily take home the gold, which has me thinking about this. Trump and his buddies should consider hosting their own Winter Games. There are some major players to watch. Like Kevin McCarthy speed-skating past questions about the RNC labeling Jan. 6 as legitimate political discourse. And then there’s the Tonya Harding of the House GOP, Marjorie Taylor Greene, who discovered a fly in her canned talking points after it was too late.\nMARJORIE TAYLOR GREENE (voiceover): Not only do we have the D.C. jail, which is the D.C gulag, but now we have Nancy Pelosi's gazpacho police spying on members of Congress, spying on the legislative work we do, spying on our staff, and spying on American citizens that want to come talk to their representatives.\nACOSTA: As some observers noted, first gazpacho police, what’s next? Sangria law? Perhaps Ted Cruz could compete. Yes, it’s true Cancun is probably too warm for the Winter Games, unless there’s a tequila luge, in which case, count me in. But the far-right Olympic games would fit right in with its autocratic tendencies. The MAGA Olympics could follow the lead set by China with its freestyle skiing competition at a dystopian-looking Beijing industrial park, not to mention its appalling human rights record.\nAs for our own cheater in chief back here in the U.S., Trump does not seem very worried as if his punishment is being decided by the Olympic committee rather than the Justice Department. Perhaps in 2024, Trump could run for the White House under the banner: the TIC, the Trump Insurrection Committee. He could bring home yet another gold toilet. But honestly, this is what happens when you allow somebody like Trump to clog the pipes of American democracy. Now that the GOP has failed to root out the problem, it’s up to the American people to flush as many times as possible. Go Team USA.\nBrent Baker, vice president of research and publications for the Media Research Center, explains our weekly pick: “This is Exhibit A in the decline and fall of CNN from a news network to place for left-wing commentary that ridicules half the population and the politicians they elect. Acosta’s smug insults may delight the narrow audience that still watches CNN, but he's talking to a smaller and smaller club of woke liberal elites who find this kind of thing amusing.”\nRating: FOUR out of FIVE SCREAMS.\n■ February 7, 2022: Liberal Media Scream: Stelter says foes lying about dying CNN\n(Washington Examiner post)\nThis week’s Liberal Media Scream features the latest effort by CNN to overcome a series of ratings-killing fumbles.\nPlaying middle linebacker is media critic Brian Stelter. His claim: Those who say CNN is miserable to view, biased, and scandal-ridden don’t watch it. Unsaid: Why would they?\nStelter spoke off the cuff at the end of his Sunday show. “They’re not watching CNN. They’re watching complaints about CNN on other channels that don’t know what they’re talking about. That’s the truth,” he said in a defense of his network.\nStelter’s commentary at the end of Sunday’s Reliable Sources:\n“I want to end the hour with a final thought, and I’m going to go a little bit rogue here, so bear with me, OK? Jeff Zucker’s departure was shocking to the staff of CNN. But CNN was not built by just one man, not by only Ted Turner, and it was not led only by Jeff Zucker. CNN is so much bigger than any single individual. It is about teams and teams of people, thousands of individuals who make up CNN.\n“This place is not perfect, it will never be perfect. We will always have flaws, we will always screw up, we will always have to run corrections, we will always have to keep working to make it better and better and better every single day. That is the goal.\n“But the people who say we’re lacking journalism, that we’ve become an all-talk channel that we’ve run off, and we’re all opinions all the time, that Jeff Zucker led us astray. Those people aren’t watching CNN. They’re not watching CNN. They’re watching complaints about CNN on other channels that don’t know what they’re talking about. That’s the truth.\n“Let’s put the map up on the screen of bureaus around the world. CNN has more bureaus around the world than almost any other news organization on the planet. That map covers the world, London and Moscow, Hong Kong and Beijing, and Nairobi and all the rest. That’s why one of the network’s slogans is, ‘Go There.’ On the day Jeff Zucker resigned, CNN aired more than 135 reporter hits, 135 reporters in the U.S. and around the world.\n“I’m talking about dozens of live shots from international correspondents in just one day. On the day Jeff Zucker resigned, CNN published more than 215 stories on the website, nearly 90 original videos. That’s a hell of a lot of news. It’s a hell of a lot of journalism. Do some of the anchors say provocative things? Yes. Do some of those clips get played over and over again on other channels and mislead people about what CNN actually is? Yes.”\nBrent Baker, vice president of research and publications for the Media Research Center, explains our weekly pick: “The fact that CNN has a bunch of foreign bureaus does not mitigate the fact that CNN’s reputation has collapsed because its hours are dominated by anchors delivering left-wing opinion in the guise of providing ‘the truth.’ If anything, those foreign correspondents are being discredited not by accurate clips of CNN hosts played by conservative channels but by the very fact that anyone who tunes in to CNN is far more likely to see a CNN anchor ranting against conservatives or Donald Trump than they are to see a report from the Bangkok, Johannesburg, or Santiago bureaus.”\nRating: FOUR out of FIVE SCREAMS.\n■ January 31, 2022: Liberal Media Scream: CNN sees ‘permanent political warfare’ only on Right\n(Washington Examiner post)\nThis week’s Liberal Media Scream highlights the blinders-on view of the Left press that only conservative outlets engage in “permanent political warfare” over controversial issues in Washington.\nWitness A is CNN’s media analyst Brian Stelter talking about the upcoming confirmation process of President Joe Biden’s eventual pick for the Supreme Court. Stelter said he hoped a fight wouldn’t occur, then added, “Let's be honest. Fox wants a fight. Right-wing radio and TV wants a fight.”\nAnd without getting into CNN’s warlike coverage of recent GOP court picks, he concluded, “It's a state of permanent political warfare, but does it have to be?”\nFrom Sunday’s Reliable Sources on CNN:\nBRIAN STELTER: I can see this kind of conflict right now over the looming Supreme Court confirmation battle. I guess I could call it a confirmation process, maybe I should, but I default to the word \"battle\" because that’s the way it’s portrayed in the press. And look, maybe it won’t really be a battle, as some conservative activists are saying they’re not planning to go scorched Earth against President Biden’s nominee to replace Justice Stephen Breyer since, whoever the nominee is, will not change the balance of the court. But let’s be honest. Fox wants a fight. right-wing radio and TV wants a fight. They need a fight over the Supreme Court. They are already starting a fight that’s rooted in white identity politics. All of Fox’s prime-time shows are outraged that Biden has committed to nominating a justice who is black and female.\nTUCKER CARLSON: What matters, Joe Biden explained, is sex and skin color.\nSEAN HANNITY: It is beyond extremely divisive. It may even be illegal.\nLAURA INGRAHAM: Rubber-stamp justice.\nSTELTER: It’s a state of permanent political warfare, but does it have to be?\nBrent Baker, vice president of research and publications for the Media Research Center, explains our weekly pick: “Stelter has a lot of chutzpah to castigate conservatives and Fox News for planning to fight a Supreme Court nominee after CNN joined in so eagerly in left-wing efforts to destroy the reputations of President Donald Trump’s picks for the high court, particularly Brett Kavanaugh. And to assume conservative opposition to a liberal nominee is ‘rooted in white identity politics’ is an odious presumption. For Stelter, it’s smears first, facts a distant second.”\nRating: FOUR out of FIVE SCREAMS.\n■ January 24, 2022: Liberal Media Scream: Clarence Thomas’s wife, Ginni, targeted\n(Washington Examiner post)\nThis week’s Liberal Media Scream features an effort to smear Ginni Thomas, the activist wife of Supreme Court Justice Clarence Thomas, because of her activism on key Washington issues.\nLeading the charge was MSNBC and The New Yorker’s Jane Mayer, who wrote a story headlined “Is Ginni Thomas a Threat to the Supreme Court?” Several MSNBC shows appeared to think \"yes.\"\nOn Friday’s Andrea Mitchell Reports, for instance, fill-in anchor Garrett Haake said, “a new New Yorker article is raising questions about Thomas’s wife’s conservative activism.”\nIn his interview, Mayer called Thomas’s political activities “astonishing and worrisome” and cited a liberal judicial ethics expert who said Thomas is “undermining the administration of justice and the rule of law.”\nFrom the Friday at noontime Andrea Mitchell Reports:\nGARRETT HAAKE: On January 19th, the Supreme Court rejected Donald Trump’s request to intervene and stop the January 6th Committee from accessing his records. Justice Clarence Thomas was the lone justice to dissent.\nNow, a new New Yorker article is raising questions about Thomas’s wife’s conservative activism. One example: Ginni Thomas and other prominent conservatives signed a letter to Minority Leader Kevin McCarthy, demanding that the House Republican Conference remove Congresswoman Cheney and Congressman Kinzinger due to, quote, “Their egregious actions as part of the House of Representatives’ January 6th Select Committee,” writing that “the actions of Reps. Cheney and Kinzinger on behalf of House Democrats have given supposedly bipartisan justification to an overtly partisan political persecution that brings disrespect to our country’s rule of law, legal harassment to private citizens who have done nothing wrong, and which demeans the standing of the House.”\nJoining me now is Jane Mayer, chief Washington correspondent for The New Yorker and author of the new article “Is Ginni Thomas a Threat to the Supreme Court?” So, Jane, thank you for being with us. I want to say off the top that Clarence and Ginni Thomas declined to be interviewed for your article and NBC has also reached out to Justice Thomas and his wife’s political lobbying firm, Liberty Consulting. We have not heard back. Your story lays out Ginni Thomas’s long history of conservative activism. Talk about what you found.\nJANE MAYER: Well, I mean, she has been an issue for quite some time because she’s such a vocal activist in politics. And the court is supposed to be seen as, kind of, above politics. In fact, her husband has made a point of saying so.\nBut what I was looking at was her ties to issues directly in front of the court. And there are so many of them, it is astonishing and worrisome. So that I interviewed ethics experts on the law, people like Stephen Gillers, who really is probably the foremost expert on judicial ethics, who said that she is, in his words, “behaving horribly.” And he fears that it’s undermining the administration of justice and the rule of law and the image of the Supreme Court, which right now is handling some of the most explosive issues in front of the country, and also has a problem with public support at this point. It’s dwindled to its lowest rate. And this is worrisome at this point ...\nBrent Baker, vice president of research and publications for the Media Research Center, explains our weekly pick: “The news media/left-wing political industry in action. A far-left journalist with a long history of hostility toward Clarence Thomas writes a story to get Thomas and his conservative voice recused from cases, and MSNBC jumps to promote her message.”\nRating: THREE out of FIVE SCREAMS.\n■ January 17, 2022: Liberal Media Scream: MSNBC’s laughable charge Sinema a white supremacist\n(Washington Examiner post)\nThis week’s Liberal Media Scream features the latest MSNBC host crossing the line so far to raise ratings that all you can do is laugh.\nImagine somebody calling Arizona Sen. Kyrsten Sinema a white supremacist. Crazy, right?\nNot at MSNBC. That’s exactly what host Tiffany Cross said on Saturday because the first-term senator decided to join fellow Democratic Sen. Joe Manchin in choosing to stand behind the filibuster, thus spoiling President Joe Biden’s chances for nationalizing elections with rules that even his own home state of Delaware doesn’t follow.\n“Sinema is a Democrat. But she is in many ways upholding white supremacy,” said Cross, who has even attacked black politicians, notably Republican Sen. Tim Scott.\nIn a way, of course, she was echoing Biden's speech in Atlanta suggesting that those blocking \"voting reform\" were racists and confederates. That speech had some Senate Democrats rolling their eyes.\nFrom the Jan. 15 The Cross Connection on MSNBC:\nTIFFANY CROSS: This is an interesting challenge, Angela [Rye], because, look, Sinema is a Democrat. But she is in many ways upholding white supremacy. You and I both know what the filibuster was originally used for. Take a listen to some remarks she made this week, and then we’ll talk about it.\nSEN. KYRSTEN SINEMA, ON THE SENATE FLOOR: When one party need to only negotiate with itself, policy will inextricably be pushed from the middle towards the extremes. And I understand. There is some on both side of the aisle that prefer the outcome. But I do not.\nCROSS: I don’t think I can roll my eyes hard enough, and you kind of just want to say, ‘Girl, bye.’”\nBrent Baker, vice president of research and publications for the Media Research Center, explains our weekly pick: “Dare to not follow the liberal agenda, and this MSNBC host will smear you as a white supremacist based on disagreement over the ‘rules’ of Senate procedures. No room for subtlety at MSNBC. If you cross Tiffany Cross, you must be silenced, as she acts as the enforcer of what views senators are allowed to hold.”\nRating: FIVE out of FIVE SCREAMS.\n■ January 10, 2022: Liberal Media Scream: CNN goes full Nazi on Trump\n(Washington Examiner post)\nThis week’s Liberal Media Scream highlights the latest anti-Trump screed from CNN by alarmist Fareed Zakaria in a special about the dangers to U.S. democracy that former President Donald Trump and his followers pose.\nIn his special, aired Sunday and scheduled again for tonight, he moves quickly to raise the Nazi Germany comparison, and that of madman Adolf Hitler, with the 45th president, who is eyeing a 2024 bid to get his job back.\nIf Trump “wins the nomination and it’s a close election, we will almost certainly face a constitutional crisis,” Zakaria said in urging Republicans to join more level-headed Democrats to “save American democracy.”\nFrom a CNN Special Report aired Sunday night, The Fight to Save American Democracy, narrated by Zakaria:\nFAREED ZAKARIA: Democracy everywhere is under attack. But remember, America has been here before. America has vanquished demagogues before. So how do we do it now? ...\nThe global superpower promoted democracy abroad and proudly embraced it at home. But can America still be Ronald Reagan’s shining city on a hill?\nJON MEACHAM: There’s nothing inevitable about American democracy. This is a fragile, fallible, complicated experiment.\nZAKARIA: That experiment has faltered before. It’s almost failed, only to return triumphant. To understand how that happened, we need to go back almost a century ago.\nMEACHAM: It was an existential crisis.\nZAKARIA: The early 1930s. The Great Depression is battering a nearly broken country. ...\nJust ahead, while America was rising from the ashes of the Depression, in Germany, democracy was losing to a fanatical madman. How did it win here but lose there?\n[NEWSREEL OVER VIDEO OF HITLER: The German republic was dead.]\nZAKARIA: A story with a twist that has haunting echoes to the current American crisis. ...\nLet’s be very clear. Donald Trump is not Adolf Hitler. But Weimar’s death highlights a danger for all democracies, specifically the way conservative elites, determined to keep the Left out of power, align themselves with an anti-democratic demagogue. The story in Germany began with a big lie. After the nation was defeated in World War I, a baseless, right-wing conspiracy theory was born, that the military had not lost in battle but was forced to surrender by traitorous left-wing politicians. ...\nIf the scenarios outlined here come true, Donald Trump runs, wins the nomination, and it’s a close election, we will almost certainly face a constitutional crisis. ...\nBut today for Republicans, party politics trumps institutional loyalty. The real scandal of Jan. 6 is not what happened outside the Capitol alone. It’s what happened inside when a majority of House Republicans voted to overturn the valid results of a presidential election simply to curry favor with Donald Trump.\nIt is that vote, not the violence, that almost broke the American system. ... In particular, Republicans must come to realize they can and should disagree with Democrats vigorously on taxes, regulation, inflation, the environment, whatever they want. But now, they must come together with these same Democrats to preserve a credible and legitimate political system. For all of us, this is the most important political issue right now. Not your views on Iran or inflation or green subsidies. Those can wait. Let’s first save American democracy. I’m Fareed Zakaria. Thanks for watching.\nBrent Baker, vice president of research and publications for the Media Research Center, explains our weekly pick: “Any ‘journalist’ who says ‘Let’s be very clear, Donald Trump is not Adolf Hitler,’ is, in fact, saying Donald Trump is very much like Hitler. And, by extension, Trump’s supporters are following the same deluded path which led to Nazi rule. Such apocalyptic fearmongering, painting a significant percent of the public as a threat to democracy, just further proves CNN is more an arm of liberal Democratic Party activists than an impartial news organization.”\nRating: FIVE out of FIVE SCREAMS.\n■ January 3, 2022: Liberal Media Scream: MSNBC guest in 2022 rage about GOP, a ‘death cult’\n(Washington Examiner post)\nAs Washington and Big Media turn to the 2022 congressional midterm elections and the establishment’s worry that President Joe Biden’s unpopularity will spoil Democratic control, this week’s Liberal Media Scream highlights the left’s stepped-up desperation to smear Republicans.\nLeave it to MSNBC to lead the way, featuring guest Wajahat Ali of the Daily Beast labeling the Republican Party a “weaponized death cult” over the Jan. 6 riots and handling of the coronavirus, which has turned worse under Biden.\n“Weaponized because they came for violence to overtake the election and a death cult because we are in a pandemic right now and 850,000 people are dead and attack masks and vaccines,” he ranted on Sunday night’s American Voices With Alicia Menendez.\nThe bottom line was just about pure politics when he warned that if the Republicans get control of the House, Senate, or both, “that is the end of democracy and we’re going to have authoritarianism.”\nFrom Sunday night’s American Voices With Alicia Menendez on MSNBC:\nAlicia Menendez: “How do Democrats, and their few Republican allies, effectively tell the story of January 6th?”\nWajahat Ali: “First and foremost, you have to name something for what it is. You can’t treat the GOP as a responsible political party because it isn’t. I call them a radical, weaponized death cult. Radicalized because they believe in dangerous conspiracy theories such as the big lie. Weaponized because a lot of them came with the intention of violence on January 6 to overtake the election through a coup and a pro-death cult because we’re in a pandemic right now and 850,000 people are dead and they’re attacking masks and vaccines. So you need accountability.\n“And the Democrats have a slim majority until 2022. God knows if they’ll have it afterwards. You have to flex your power at every branch of the government to show the American people that no one is above the law. So you need accountability, through the committee and the hearings, you need Merrick Garland hopefully to follow the evidence and use the Justice Department to go after people who committed these crimes and then so you also need a daily, 24/7 nonstop story because as Steve Bannon said he wants to flood the zone with ‘S’ word, right? His enemy is the media and you’ve already seen, with the data that you’ve shown, that a lot of Americans are like ‘yeah, maybe, both sides, we don’t know, let’s see.’ Every single day drumbeat from now to the mid-terms to tell people exactly what the Republican party is, the majority of them believe this, and that right now the elected officials right now in office are doing the deed of President Trump by spreading the big lie. This is not a minority. This is the entire GOP right now that is committed to the big lie and has become radicalized and if they take over in 2022 that is the end of democracy and we’re going to have authoritarianism.”\nBrent Baker, vice president of research and publications for the Media Research Center, explains our weekly pick: “Ali lays bare the left’s obsession with Jan. 6 and how the media are gleefully exploiting it to push an explicitly partisan agenda to defeat Republicans in the 2022 midterms. When you demand a ‘daily, 24/7 nonstop story’ and an ‘every single day drumbeat,’ it’s not about high-minded ideals of strengthening democracy, it’s about ramming your agenda into every crevice of the news in order to advance the interests of the political party you prefer.”\nRating: FOUR out of FIVE SCREAMS.\n■ New on December 27, 2021: Liberal Media Scream: ABC thinks throwing Reagan’s ‘welfare queen’ at Manchin hurts\n(Washington Examiner post)\nThis week’s Liberal Media Scream is another example of how out of touch Beltway journalists are with America and why the media are being ignored more and more.\nTo discredit West Virginia Sen. Joe Manchin, who is blocking President Joe Biden’s massive social spending bill, the panel on ABC’s This Week resurrected President Ronald Reagan’s trope of “welfare queens.”\nCiting Manchin’s concerns that people might misuse child tax credits, Averi Harper, deputy political director for ABC News, said it sounded like “the myth of the welfare queen — that Reagan-era trope used to argue against entitlements, implying that the poorest among us are inherently irresponsible.”\nABC News veteran Terry Moran noted that Manchin “does represent one of the poorest states in the union,” yet he “seems to represent the plutocrats a lot” in Washington.\nFrom the roundtable on Sunday’s This Week on ABC:\nJONATHAN KARL: There was some reporting about what Manchin was saying about how the child tax credit would be used or was being used in West Virginia. What was that all about?\nAVERI HARPER: Right. There were reported comments from Sen. Manchin in which he privately expressed concerns about parents using the child tax credit payments to buy drugs or if family paid leave was initiated, that folks might use it or exploit it in order to go deer hunting, effectively, you know, resurrecting the myth of the welfare queen — that Reagan-era trope used to argue against entitlements, implying that the poorest among us are inherently irresponsible and incapable of using government services for their intended purposes. And that is such a glaring statement that outraged folks who heard it and illustrates just how out of step Joe Manchin is with this current Democratic Party.\nKARL: And as you know, Terry, he’s from a state that Biden only got, what was it, 30-some percent in?\nTERRY MORAN: Yeah, so he’s got that to deal with. He does represent one of the poorer states in the union. He seems to represent the plutocrats a lot. But look, Manchin is just part of the problem. This is a hugely ambitious bill to restructure healthcare, education, immigration, climate, all different kinds of things. The public in West Virginia, in other places, is focused on inflation, pandemic, crime, the border.\nKARL: All right, Terry. Unfortunately, we are out of time. Thank you for the roundtable. We’ll see you next year.\nBrent Baker, vice president of research and publications for the Media Research Center, explains our weekly pick: “Washington press corps shorthand: moderate and liberal Republicans who undermine conservatives, such as the late Sen. John McCain and Sen. Susan Collins, are heroic mavericks putting their country ahead of party. Less than 100% liberal senators, on the other hand, such as Manchin who dares undermine a left-wing goal, must be discredited as a selfish operative out to enrich himself who doesn’t care about anyone else.”\nRating: FOUR out of FIVE SCREAMS.\n■ New on December 20: Liberal Media Scream: CNN’s Zakaria puzzled by Biden’s unpopularity\n(Washington Examiner post)\nThis week’s Liberal Media Scream provides the perfect demonstration of why Washington journalists are often out of touch with the rest of America.\nAt a time when President Joe Biden is experiencing approval ratings lower than former President Donald Trump and even Democrats are expressing hope that Biden doesn’t run for reelection, a top CNN talker said he just couldn’t understand why the president isn’t more popular.\n“I have to confess, I find Joe Biden’s unpopularity puzzling,” said CNN’s Fareed Zakaria.\nApparently suffocating inflation, an out-of-control border, broken promises to end the coronavirus and cure global warming, Americans stuck in Afghanistan, and a general inability to project a coherent plan aren’t enough of a reason for some.\nZakaria instead said that Biden “has mostly handled his job with intelligence and decency” and is a victim of circumstances beyond his control.\nBelow is the beginning and end of Zakaria’s commentary at the top of Sunday’s Fareed Zakaria: GPS on CNN:\n“But first, here’s ‘my take.’ I have to confess, I find Joe Biden’s unpopularity puzzling. He’s rounding out his first year in the White House with the lowest end-of-first-year approval ratings of any elected president in modern times, with the exception of Donald Trump. Why is this? Biden is a genial, likable person. Many of the policies he’s pursued have been popular, even some with Republican support. The country is doing reasonably well economically, as measures like unemployment, which is declining, the stock market, which is rising, and interest rates demonstrate.\n“So why did the latest CNN average of the polls have him at just 45%? Now, one has to remember that Biden is something of an accidental president. He got elected for two reasons, neither of which has much to do with his personal popularity. First, Barack Obama chose him as vice president, which instantly elevated him in the Democratic field. Second, Donald Trump. Had these two factors not been present, it’s difficult to imagine Biden in the White House...\n“Presidents often get rewarded for being around in good times, whether they caused them or not. In Joe Biden’s case, he has mostly handled his job with intelligence and decency, but he’s paying the price for the complicated times that we are living through.”\nBrent Baker, vice president of research and publications for the Media Research Center, explains our weekly pick: “File under ‘Clueless in New York City.’ Zakaria reflects how out of touch much of the press corps are with the concerns of most Americans. To anyone paying attention, it’s not ‘puzzling’ why Biden is not popular. Just look at the out-of-control border. It’s only ‘puzzling’ why anyone who is paid to report the news wouldn’t realize the real mystery is why more than 40% approve of the Biden presidency in its lurch far to the Left.”\nRating: THREE out of FIVE screams.\n■ December 13: Liberal Media Scream: TDS Todd blames Trump for Biden’s slump\n(Washington Examiner post)\nThis week’s Liberal Media Scream features the latest example of how the media remain gripped with “Trump Derangement Syndrome,” none more than NBC’s Chuck Todd.\nOn his Meet the Press Sunday show, he framed President Joe Biden’s plummeting approval numbers as something beyond his control and really the fault of former President Donald Trump. “It seems as if there’s nothing the White House can do to improve their political standing,” he said, citing the president’s failed promises on eliminating the coronavirus and getting past Trump.\n“COVID’s not behind us and Donald Trump’s still lurking. It’s not his fault,” Todd defended.\nGuest panelist Kimberly Atkins Stohr then blamed Republicans for Biden’s woes. “Is it all Joe Biden’s fault? Of course not. Most of it isn’t. You have Republicans who are lock solid against him and won’t vote for anything.”\nFrom the roundtable on Sunday’s Meet the Press on NBC:\nCHUCK TODD: And we are back. It seems as if there’s nothing the White House can do to improve their political standing these days. It does feel like every week, there’s another poll. It’s a new bottom, it’s a new this. And some of it is out of their control. Mark Murray and I were having a discussion. His two big promises were to get COVID behind us and to get rid of Donald Trump. COVID’s not behind us and Donald Trump’s still lurking. It’s not his fault, but is that why we’re in this no man's land here for him?\nKIMBERLY ATKINS STOHR, Boston Globe: It’s a convergence of a lot of things. You have this pandemic that we can’t get behind. You still have people who are struggling economically. Joe Biden also campaigned on a big, broad agenda of protecting civil rights and getting people — helping to get people back on their feet after this, these big, broad packages. But even after these packages have passed, there is still this constant threat to democracy that we keep talking about. The Democrats have failed to pass any measure to protect and bolster up our election system. So, that has people uneasy. Is it all Joe Biden’s fault? Of course not. Most of it isn’t. You have Republicans who are lock solid against him and won’t vote for anything, no matter how many times Joe Manchin says he wants bipartisanship. So, it’s about where do you assign that blame, who is against every measure, including vaccine mandates that could get us past this pandemic. Is that Joe Biden? Where does the blame actually lie?\nBrent Baker, vice president of research and publications for the Media Research Center, explains our weekly pick: “How ridiculous. Trump is out of office and Joe Biden is in the Oval Office, yet, for journalists like Todd, there’s nothing for which they won’t blame the all-powerful Trump. In Todd’s twisted world, a liberal like Biden can’t be held responsible for his failures, and Trump offers a convenient scapegoat. As the saying goes, ‘Trump is living rent-free in Todd’s head.’”\nRating: FIVE out of FIVE screams.\n■ December 6: Liberal Media Scream: Joe, Mika push Jan. 6 ‘decomposition’ of GOP\n(Washington Examiner post)\nThis week’s Liberal Media Scream features the cast on MSNBC’s Morning Joe embracing the liberal Atlantic magazine’s special edition on the Jan. 6 riots that suggests the events on that day were a dry run for more GOP antics.\nHosts Joe Scarborough and Mika Brzezinski featured Atlantic editor Jeffrey Goldberg, who said it would take more than one issue of his magazine to “trace the Republican Party’s decomposition from Lincoln’s day to ours. It is enough to say that its most recent, and most catastrophic, turn — toward authoritarianism, nativism, and conspiracism — threatens the republic that it was founded to save.”\nWith no mention, of course, of the Democratic efforts to turn the U.S. into a socialist state, the trio gleefully took a walk down Trump Derangement Syndrome street to suggest that the GOP and the Jan. 6 rioters are eager to turn the United States into a banana republic.\nBrzezinski even raised a warning about GOP politics from Czech-born, Clinton-era Secretary of State Madeleine Albright. Goldberg agreed: “People like Madeleine Albright, who come out of Europe or Asian experiences or African experiences with authoritarianism, they’re warning us.”\nFrom the 8 a.m. hour of Monday’s Morning Joe on MSNBC:\nMIKA BRZEZINSKI: We’re closing in on the one-year anniversary of the attack on the U.S. Capitol, if you can believe it. With that, just one month away, the Atlantic has dedicated its January and February issues to American democracy in crisis. The headline of the cover story is jarring. Quote, ‘January 6th Was Practice.’\nJoining us now, the magazine’s editor-in-chief, Jeffrey Goldberg. And Jeffrey writes this for the new issue’s editor's note. Quote, 'There is insufficient space in any one issue of this magazine to trace the Republican Party’s decomposition from Lincoln’s day to ours. It is enough to say that its most recent, and most catastrophic, turn — toward authoritarianism, nativism, and conspiracism — threatens the republic that it was founded to save. Stating plainly that one of America’s two major parties, the party putatively devoted to advancing the ideas and ideals of conservatism, has now fallen into autocratic disrepute is unnerving for a magazine committed to being, in the words of our founding manifesto, 'of no party or clique.''\nJOE SCARBOROUGH: Jeffrey, talk about your decision to dedicate this special issue to this topic. As we look behind you at a very ominous cloud hovering over the Capitol.\nJEFFREY GOLDBERG: Yeah. I arranged that for you, Joe.\nSCARBOROUGH: Thank you so much.\nJEFFREY GOLDBERG: You’re welcome. You know, we have three years until an election that might be unlike any election we’ve ever seen, which is to say the following: Democracy depends on the consent of the losers. On the willingness of the party that has lost to say, 'We lost, we’ll try next time. But meanwhile, we’ll support the elected president.' We are heading to a situation, because of Donald Trump’s behavior and because of the people who abet his behavior, in which that is not entirely clear. It’s not entirely clear that that’s going to happen.\nAnd so, I thought we should really focus now, start to really focus now on these — it’s a whole range of threats, a whole range of things that Trump and his minions are doing to try to guarantee that, by hook or by crook, that they win in 2024, and so, we’ve pulled together this special issue just to outline for our readers all the things that could go wrong and all the things that are happening right now that the Republican Party or much of the Republican Party is doing to make sure that the situation is geared to their favor.\n…\nBRZEZINSKI: If you speak to people like Madeleine Albright and those who have come from this type of thing who know it so well, their fear is that January — we’re well over the edge. We’re well over the edge, and we’re not where we should be in terms of turning this ship around. And if you look at the way that Republicans are acting right now in Congress, it can’t be looked at as, oh, they’re the crazies on the far, far Right. This is now the behavior that’s being embraced.\nGOLDBERG: Right. People, people like Madeleine Albright, who come out of Europe or Asian experiences or African experiences with authoritarianism, they’re warning us. The warning is, don’t think you’re special. Human beings are human beings. Societies are societies. People are prey to the same weaknesses and temptations across the planet. And just because we’ve managed to stave off authoritarianism in the past doesn’t mean that you’re able to stave it off in the future when you have a determined group trying to manipulate democracy to result in their permanent domination.\nBrent Baker, vice president of research and publications for the Media Research Center, explains our weekly pick: “The Atlantic magazine and Jeffrey Goldberg seem to have decided their mission is to push the entire news media to discredit the Republican Party and conservatives because of former President Donald Trump’s continued influence within the party. Joe Scarborough and Mika Brzezinski eagerly played along, though trying to silence a large slice of the electorate, through fearmongering over the worst possible interpretations of how some are concerned about election integrity, hardly matches basic journalistic norms of sharing multiple points of view.”\nRating: FOUR out of FIVE screams.\n■ November 29: Liberal Media Scream: Morning Joe guest imagines US democracy ‘backsliding’\n(Washington Examiner post)\nThis week’s Liberal Media Scream features MSNBC’s Morning Joe show hosting a top editor for the Financial Times suggesting that the United States has lost its authority to hold a democracy summit after four years of former President Donald Trump.\nDiscussing the meeting set for next year at the White House, to which Russia and China have been excluded while Taiwan and Ukraine have been invited, the U.S. editor for the influential outlet questioned “whether America is in the position today to really play host and to pick and choose.” His reasoning: “A lot of countries, including the United States, are now defined as less democratic than they used to be. As the term of art goes, ‘democratic backsliding.’”\nEdward Luce, U.S. national editor of The Financial Times, on Monday’s Morning Joe on MSNBC:\n“What will it achieve? That’s an open question. A lot of countries, including the United States, are now defined as less democratic than they used to be. As the term of art goes, ‘democratic backsliding’ and so there is some question whether America is in the position today to really play host and to pick and choose. So I suspect most of the attendees are coming out of politeness rather than any great expectation this will be a big advance, a sort of blow, for the advance of democracy.”\nBrent Baker, vice president of research and publications for the Media Research Center, explains our weekly pick: “A sign of how deep Trump Derangement Syndrome has dug in, where a top editor at a major western news agency would give legitimacy to the view that, in comparison to China and Russia, the U.S. has lost its moral positioning as a democratic nation.”\nRating: THREE out of FIVE screams.\n■ November 12 and 19: No Liberal Media Screams these weeks.\n■ November 8: Liberal Media Scream: Black on black racism greets Winsome Sears in savage attack\n(Washington Examiner post)\nThis week’s Liberal Media Scream features one of several attacks on Virginia Lt. Gov.-elect Winsome Sears, the first black woman selected for that job.\nLiberals have been shockingly bold in attacking her as basically not being black enough because she is a Republican and also claiming that her election does not absolve the GOP of the sins of racism.\nWe’re featuring Vanderbilt University’s Michael Eric Dyson, who was especially nasty to Sears, a former Marine who will join Republican Gov.-elect Glenn Youngkin in Richmond.\nDyson smeared Sears as an enabler of white supremacy: “The problem is: Here they want white supremacy by ventriloquist effect. There is a black mouth moving but a white idea running on the runway of the tongue of a figure who justifies and legitimates the white supremacist practices.”\nOn MSNBC on Thursday, Dyson, who was formerly with Georgetown University, also called Sears a race traitor: “To have a black face speaking on behalf of a white supremacist legacy is nothing new.”\nDyson lectured white people for thinking they should get any credit for voting for a black woman who dares stray from left-wing thinking because if “that person of color happens to undermine and undercut and subvert the very principles about which we are concerned, you do yourself no service by pointing to them as an example of your racial progressivism.”\nFrom Thursday’s The ReidOut on MSNBC:\nJOY REID: And even if they’re literally trying to ban books about black people and saying, \"You cannot talk about the black experience. We’re going cut that out of schools because white people don’t like it,\" they still want credit. They still want to be able to say it’s not racist. And in this case, I just want to get your comment on this because the two choices that voters had in Virginia were a black woman who shares my daughter’s name and Jamaican heritage and an Afro Latina who is part Lebanese. So, you had a choice of two brown/black people, and you picked one of them. Do you get credit? Do you get special credit? It’s like I had ice cream or cake as two options, but I want credit for lowering my calorie count because I picked ice cream. You had two choices, and they were both black. Your thoughts?\nMICHAEL ERIC DYSON: I'd eat the cake and the ice cream, clearly. What’s interesting is that you’re absolutely right. They want credit for breathing. They want credit for having hair in the morning or getting up and brushing their teeth. “Look, I’ve made an achievement that should be noteworthy.” No, you are doing what all political figures must do: make choices. The problem is: Here they want white supremacy by ventriloquist effect. There is a black mouth moving but a white idea running on the runway of the tongue of a figure who justifies and legitimates the white supremacist practices.\nWe know that we can internalize, in our own minds, in our own subconscious, in our own bodies, the very principles that are undoing us. So to have a black face speaking on behalf of a white supremacist legacy is nothing new. And it is to the chagrin of those of us who study race that the white folk on the other side and the right-wingers on the other side don’t understand. This is politics 101. And this is race, not even 101.\nWhat’s beneath 101? It’s the pre-K of race. You should understand the fact that if you tell black people, \"Look, I support a negro. Look, there is a person of color that I am in favor of,\" and that person of color happens to undermine and undercut and subvert the very principles about which we are concerned, you do yourself no service by pointing to them as an example of your racial progressivism.\nBrent Baker, vice president of research and publications for the Media Research Center, explains our weekly pick: “Could anything be any more racist than what Dyson said? Declaring a person’s political views invalid because they do not match the orthodoxy of the Democratic Party and liberals like Dyson? A very sad example of how MSNBC sows discord and animosity by showcasing race-based thought-police conformity in the guise of wisdom from a regular guest celebrated by a star prime-time host.”\nRating: FIVE out of FIVE screams.\n■ November 1: Liberal Media Scream: Chuck Todd shocked GOP favored over Biden\n(Washington Examiner post)\nThis week’s Liberal Media Scream features a classic example of just how shocked the biased Left press is when the public doesn’t fall in line behind ABC, CBS, NBC, and CNN, as well as their view of the world.\nTalking about a new poll on key national issues, the leader of the pack, NBC’s host of Meet the Press Chuck Todd, appeared dumbfounded that the public is choosing Republicans over President Joe Biden. When a talk show host uses the phrase “believe it or not,” you know he doesn’t.\n“Republicans, believe it or not, have double-digit leads in dealing with border security, inflation, crime, national security, the economy and, shockingly, on ‘getting things done,’” Todd said on his Sunday show discussing a new NBC News poll.\nTodd led Sunday’s Meet the Press on NBC:\n“We have a brand new NBC News poll out this morning that’s filled with some scary news for the Democrats. The overarching message: Americans have lost their confidence in President Biden and their optimism for the country, at least, they have right now. Just 22% of adults say we’re headed in the right direction. A shocking 71% say we’re on the ‘wrong track’ and that includes a near majority of Democrats who are saying that.\n“President Biden’s approval rating stands at a dismal 42% versus 54% who disapprove. Believe it or not, just two months ago, Mr. Biden was in positive territory — 49% approving and 48% disapproving. So, what’s pulling down the president’s numbers? Well look at his set of numbers: Just 37% say he has the ability right now to handle a crisis versus nearly a majority who say he does not. Thirty-seven percent also say he’s competent and effective as president. Fifty percent disagree with that description.\n“What’s more, Republicans, believe it or not, have double-digit leads in dealing with border security, inflation, crime, national security, the economy and, shockingly, on ‘getting things done.’”\nBrent Baker, vice president of research and publications for the Media Research Center, explains our weekly pick: “How dare the public not match the views of the press corps. Todd seems genuinely surprised, maybe even appalled, that most people have more trust in Republicans than in President Biden and Democrats. Todd is a victim of his own media bubble where it’s a surprise Republicans lead in areas where Biden has clearly failed, such as border security and crime. It should lead Todd to question NBC’s journalism, but it won’t.”\nRating: THREE out of FIVE screams.\n■ October 25: Liberal Media Scream: Meet the Press all in for McAuliffe\n(Washington Examiner post)\nFormer Virginia Gov. Terry McAuliffe, trying to make some history by getting that job again, has seen the power of the media join his effort to cheer him on as he flounders, the latest being NBC’s Meet the Press.\nThis week’s Liberal Media Scream features the show’s bid to boost the Democrat on Sunday with screen texts that showed its very biased view.\nAll four on-screen text headlines during this Sunday’s Meet the Press roundtable segment on the gubernatorial race framed the contest from the view of the Democratic candidate. One, for example, relayed the claim that McAuliffe “will make things better.” No joke.\nAs substitute host Andrea Mitchell and her four panelists discussed the race, in a segment introduced by a video clip of former President Barack Obama campaigning for McAuliffe, viewers saw this text across the bottom of the screen: “Pres. Obama Campaigns for McAuliffe.” That was soon followed by: “Obama: McAuliffe Will Make Things Better.”\nThe next two conveyed points advanced by McAulliffe’s campaign: “McAuliffe Links Youngkin to Trump in Ad.” And: “McAuliffe Hopes to Nationalize Race.”\nNo text on screen during the three-minute discussion promoted any points made by or in favor of the Republican candidate, Glenn Youngkin, of course.\nBrent Baker, vice president of research and publications for the Media Research Center, explains our weekly pick: “What a great insight into the behind-the-scenes thinking of Andrea Mitchell and the staff at the Washington bureau of NBC News. They see the world through the prism of liberal Democrats excited about a Barack Obama campaign appearance and the hope he gives to the troubled campaign of the local Democratic candidate, and thus pushed liberal talking points as the only ones worth making, as if any points in favor of Republican Youngkin don’t exist.”\nRating: THREE out of FIVE screams.\n■ October 18: Liberal Media Scream: Stelter’s show says Rush Limbaugh, Fox ‘brainwash’ people\n(Washington Examiner post)\nThis week’s Liberal Media Scream features a new level of intolerance at CNN for people who don’t think like Don Lemon, Chris Cuomo, and the lefty gang.\nOn Sunday, CNN's media-themed show Reliable Sources headlined a guest who said the late Rush Limbaugh and Fox News are guilty of tearing families apart and even brainwashing listeners and viewers.\nJen Senko, author of The Brainwashing of My Dad: How the Rise of the Right-Wing Media Changed a Father and Divided Our Nation — And How We Can Fight Back, said, “Our family kind of suffered for about 20 years when my dad discovered Rush Limbaugh and Fox News.”\nWhile some would suggest he was enlightened by the discovery, Stelter marveled, “You rarely hear about that. You rarely hear about the impact on the viewers of the content on Fox News, but maybe that’s changing.”\nFrom the Oct. 17 episode of Reliable Sources on CNN:\nBRIAN STELTER: Tell us about the brainwashing of your dad. That’s the title of the book. It’s not just about your dad, though. What you describe is this phenomenon where families are torn apart by right-wing radio and TV. Why did you decide to address this head-on?\nJEN SENKO: Well, our family, kind of, suffered for about 20 years when my dad discovered Rush Limbaugh and Fox News. His personality entirely changed. He was unrecognizable. He became a zealot, he became very critical of Democrats, and we were run-of-the-mill Democrats. And you know, it wasn’t so much that he became a Republican, it was that he was an extreme Republican, and he was always in a rage. And he was always trying to convert us, he was like a zealot. And my mother would get in these arguments with him and say, you know, “Frank, I think you’re brainwashed.”\nAnd when I first named the movie, The Brainwashing of My Dad, I didn’t actually think that it was necessarily brainwashing, but that's what it felt like to me and many, many people. Of course, after I did the movie and talked to neuroscientists, then I found, well, yeah, it is brainwashing. But I’ve seen this happen to so many people, and thousands and thousands of people have told me their stories. It’s always very sad.\nBrent Baker, vice president of research and publications for the Media Research Center, explains our weekly pick:\n“Conformity. That’s what Stelter and Senko demand. How dare anyone stray from liberal Democratic positions, and if they do, their sources of information must be denigrated and silenced because anyone who believes them must have been ‘brainwashed.’ How insulting. If a conservative writer cited false notions forwarded by CNN in attacking President Donald Trump and charged that the network was thus ‘brainwashing’ its viewers into becoming liberal, Stelter, far from offering a guest slot, would condemn the smearing of CNN.”\nRating: FIVE out of FIVE screams.\n■ October 11: Liberal Media Scream: Reporters debate how to degenerate GOP\n(Washington Examiner post)\nThis week’s Liberal Media Scream highlights the debate in media circles about how to trash Republicans without seeming like Democratic Party cheerleaders.\nVeteran journalist James Fallows expressed frustration with how tough it is to portray Republicans as awful for opposing President Joe Biden without making the media appear biased or taking a side — like most did for four years under former President Donald Trump.\nAppearing on CNN’s Reliable Sources, the national correspondent for The Atlantic rued “the struggle” for journalists who must blame Biden’s opponents for misbehaving. Yet, he added, journalists must be “conscious of seeming to take a side.” So, he said, they need to figure out how to “give out a narrative of the actual realities, recognizing how this is at odds with our conventions.”\nDavid Zurawik, now a professor at Goucher College after many years with the Baltimore Sun, chimed in to agree: “Amen. That’s great.”\nFrom Sunday’s Reliable Sources on CNN:\nJames Fallows: “The struggle for us all in the media is if we keep pointing out that one side of the political divide is actually instigating these things, defying subpoenas, trying to renege on the debt, holding up State Department appointments, et cetera, we are conscious of seeming shrill, we’re conscious of seeming unbalanced, we’re conscious of seeming to take a side. And so it’s something about our culture, we need to figure out how we can give out a narrative of the actual realities recognizing how this is at odds with our conventions.”\nDavid Zurawik, former Baltimore Sun media reporter: “Amen, yes. That’s great.”\nBrent Baker, vice president of research and publications for the Media Research Center, explains our weekly pick: “Here’s a thought for Jim Fallows: Maybe if the national news media wasn’t so obvious about taking sides against conservatives and in favor of liberals, journalists wouldn’t be seen as unbalanced and they wouldn’t have to ‘struggle’ over a conflict between ‘realities’ and their journalistic ‘conventions.’ The ‘conventions’ are what need to be followed, abandoning them in favor of being political activists is the problem.”\nRating: FOUR out of FIVE screams.\n■ October 4: Liberal Media Scream: Journos scold America for not appreciating Biden’s $3.5T spending\n(Washington Examiner post)\nThis week’s Liberal Media Scream highlights the media’s swampy disdain for Republicans and those who don’t share their appreciation for all the goodies President Joe Biden’s \"transformative\" $3.5 trillion in promised social welfare spending will bring.\nTwo journalists on CNN’s Reliable Sources fretted about the media focus on Democratic infighting over the $3.5 trillion social spending bill and $1.2 trillion infrastructure package instead of highlighting all the great things in the huge bills.\n“There’s this narrative that it’s Democrats dividing over this. I actually think this is just Democrats deciding how they’re going to actually get this done,” said Time Magazine senior correspondent Charlotte Alter.\n“I also think that everybody seems to be missing the bigger picture of what $3.5 trillion over 10 years actually could mean to American families,” Alter said, citing as a positive “massive investment in the social safety net, that would be the largest investment in childcare, and in climate change, in paid family leave in a generation.”\nJonathan Cohn, a senior national correspondent for Huffington Post, agreed.\n“I’m 100% with Charlotte on this. It is amazing how little attention over the past few months we’ve given to these potentially really transformative pieces of legislation,” he said, listing how “every other country in the world has a paid leave law” and “the profound change in policy on climate change.”\nSo, “there is a lot in this bill, and we probably should be talking a lot more about it.”\nFrom Sunday’s Reliable Sources on CNN:\nCHARLOTTE ALTER, TIME MAGAZINE: There’s this narrative that it’s Democrats dividing over this. I actually think this is just Democrats deciding how they’re going to actually get this done. You know — and frankly, I also think that everybody seems to be missing the bigger picture of what $3.5 trillion over 10 years actually could mean to American families.\nYou know, even if the number is smaller than that, we’re still looking at the potential for a massive investment in the social safety net. That would be the largest investment in childcare and in climate change, in paid family leave in a generation, and I sort of worry that everyone's kind of missing the big picture about what the potential outcome could be here.\nBRIAN STELTER, CNN: Jonathan, is that true? Is the media missing the legislative forest for the individual trees?\nJONATHAN COHN, HUFFPOST: I’m 100% with Charlotte on this. It is amazing how little attention over the past few months we’ve given to these potentially really transformative pieces of legislation. As Charlotte mentioned, a couple — childcare, paid leave, every other country in the world has a paid leave law, we don’t, we could get one. This could be transformative to hundreds of thousands and billions of people who are elderly or disabled and can’t get home care, and they end up in nursing homes.\nAnd that’s not even to mention, the profound change in policy on climate change, which is really, you know, an existential crisis for the planet. So, there is a lot in this bill, and we probably should be talking a lot more about it.\nBrent Baker, vice president of research and publications for the Media Research Center, explains our weekly pick: “If you ever wondered why there’s hardly ever any scrutiny over federal spending, outside of the Defense Department, Alter and Cohn are exhibits A and B. They are liberal activists personally invested in expanding government spending and government control of people’s lives. Just listen to their excitement for massive additional spending without any regard for the burden put on future generations to pay for it.”\nRating: THREE out of FIVE screams.\n■ September 20 and 27: No Liberal Media Screams these weeks.\n■ New on September 13: Liberal Media Scream: Roland Martin calls 74M Americans unpatriotic\n(Washington Examiner post)\nThis week’s Liberal Media Scream shows that liberals miss former President Donald Trump more than Republicans.\nWhile Republicans are ready to fight over the budget, 2022 elections, and President Joe Biden’s bungled Afghanistan withdrawal, liberals can't stop battling over the last two elections and clearly won't give up until Trump is well off the stage.\nExhibit One is Roland Martin, the left-wing radio and online talk show host who used to be on CNN. On Sunday’s This Week on ABC, he seized on former New Jersey Gov. Chris Christie’s recent comments that the election is over and that it’s time to drop the conspiracy talk and get ready for the next presidential election.\nThat should have satisfied liberals. But not Martin, who, in full sanctimony, turned on Christie for his efforts to help Trump win. “Too many Republicans chose power and riding with Donald Trump as opposed to patriotism and America,” said Martin. “Any Republican who stood with him has to own it and accept the role that they played.”\nChristie urged that Martin get over himself. “I’ll sleep fine tonight with you judging my morals.”\nFrom the roundtable on the Sunday This Week with George Stephanopoulos on ABC:\nROLAND MARTIN: I appreciate the speech, governor, but the reality is this. You have to admit, Sarah, you have to admit the role that you played in putting the person in leadership who is driving conspiracy theories. It’s one thing to condemn them after the fact, but you have to own up to the role that you played in putting the person in power. The time—\nSARAH ISGUR, THE DISPATCH: We both ran campaigns against him.\nMARTIN: No, no, no, no, no.\nCHRISTIE: First off, I don’t have to admit anything to you.\nMARTIN: Can I finish? Can I finish? Can I finish?\nCHRISTIE: First off, I don’t have to admit anything to you. And, second, I ran against Donald Trump in 2016.\nYVETTE SIMPSON, DEMOCRACY FOR AMERICA: You also coached him for the debate, sir.\nMARTIN: Here’s the deal. You ran against him. But when a person has principles, morals, and values, they do not support them even if you lose. And what they say is, 'I choose patriotism and the country over party and power.' And the problem was, too many Republicans chose power and riding with Donald Trump as opposed to patriotism and America.\nCHRISTIE: I’ll sleep fine tonight with you judging my morals.\nMARTIN: Well, guess what? As a voter who has 13 nieces and nephews, what I also want to see in America are Republicans and Democrats who have the guts to stand up to narcissists, to folks who lie, to folks who sit here and led a country in the wrong direction. And what that man has unleashed on this country. Any Republican who stood with him has to own it and accept the role that they played.\nCHRISTIE: Well, that’s fine. I’ll accept the role that I played in the 2016 election running against him. And I’ll accept the role—\nMARTIN: But you helped him prepare for the debates.\nSTEPHANOPOULOS: Let him finish his point now. Let him finish his point.\nCHRISTIE: Excuse me. And I’ll accept the role that I played in my belief that Hillary Clinton was not the right person to be president. We all get to make choices, Roland, in this democracy. I made my choice. I’m on record of my choice. And I’m not walking away from my choice. But it does not preclude me from being able to be critical when the person that I did support does things that I am against. And so this false choice that you’re trying to set up—\nMARTIN: It’s not false.\nCHRISTIE: It’s a false choice, and one that the American people are not going to buy either.\nBrent Baker, vice president of research and publications for the Media Research Center, explains our weekly pick: “It must be nice to live in Martin’s world, where it’s so easy to dismiss political opponents as illegitimate. If he wonders why so many Trump supporters are sticking with Trump, he should look in a mirror. Maybe they are disgusted by being called unpatriotic and un-American for not seeing the world in the same good vs. evil way as does Martin, with them on the evil side.”\nRating: FOUR out of FIVE screams.\n■ September 6: Liberal Media Scream: Joy Reid’s ‘sister’ wants to cancel National Review's Lowry\n(Washington Examiner post)\nThis week’s Liberal Media Scream comes back to Joy Reid and one of her MSNBC guests who wants to ban viewpoints that don’t fall in line with the liberal lunacy.\nIn the very definition of \"cancel culture,\" NYU law professor Melissa Murray was asked on ReidOut about National Review Editor Rich Lowry’s arguing that the Supreme Court did not overturn Roe vs. Wade in last week’s decision supporting the six-week abortion ban in Texas.\nShe said, “That take is absolutely absurd and really has no business being broadcast on mainstream television.”\nJoy Reid: They are trying to get away with implementing very unpopular right-wing ideas that they believe in because of their own reading of the Christian faith, and they want to do these things. But to do them through a normal case would be really bad headlines for the Roberts court. And so, they’re just doing it in a sneaky way. It feels almost like Bush v. Gore. And it’s working with some people. Let me let you listen to Rich Lowry. And you had some thoughts on him before. But he seems to have bought their plan and said, 'See, they didn’t overturn Roe.' Here he is.\nNational Review’s Rich Lowry to Chuck Todd on Meet the Press Daily: People are acting as though Roe has been overturned. I would welcome that outcome. And it may eventually be in this Dobbs case. But it hasn’t been overturned yet at all. This is a procedural ruling that clearly was the correct one. There was no harm here yet.\nReid: So that’s a conservative activist pretending he’s not seeing what happened because it's the better PR strategy. You had some thoughts on Twitter, saying you wish you had been on Meet the Press to respond to that. Well, you’re here now sister, respond.\nMelissa Murray: So I appreciate the opportunity to say forthrightly that that take is absolutely absurd and really has no business being broadcast on mainstream television. This was a procedural ruling. That is absolutely correct. But procedural rulings have substantive implications, as Eli [Mystal] said. This particular procedural ruling effectively guts away with two, three decades' worth of Supreme Court precedent. Roe is effectively dead in Texas. Casey is effectively dead in Texas because of these rulings. And it is, as you say, working on the shadow docket, the court can do things that it would not be able to do on the merits docket where there’s more attention.\nBrent Baker, vice president of research and publications for the Media Research Center, explains our weekly pick: “I wouldn’t want to be in one of Murray’s law classes, afraid that if I expressed a perfectly well-grounded opinion with which she disagreed she’d shame me into silence, banning me from speaking again in class. So much for liberals encouraging an open discussion of public policy issues.”\nRating: FOUR out of FIVE screams.\n■ August 30: Liberal Media Scream: MSNBC’s joyless Reid says Republicans ‘love...savor’ cruelty\n(Washington Examiner post)\nMSNBC’s Joy Reid made picking this week’s Liberal Media Scream easy when she ranted about Republicans, claiming they love cruelty and act as the “grim reaper.”\nAt the end of her Friday show, Reid charged Republicans with “cruelty” for not spending more on school lunch programs.\nThen she turned to the U.S. Supreme Court’s decision blocking President Biden’s unconstitutional extension of a moratorium on rental evictions: “Yay! Three-and-a-half million Americans could now end up in the street thanks to Justices Roberts, Alito, Thomas, Gorsuch, Barrett, and Kavanaugh, a decision they probably cooked up while sitting in the comfort of their million-dollar suburban homes.”\nFrom the “The Absolute Worst” segment at the end of The ReidOut Friday night, picking up after Reid talked about a Wisconsin county that rejected federal school lunch money:\nJOY REID: Maybe they were inspired by the resident grim reaper of the South, Florida Gov. Ron DeSantis, who is refusing to apply for up to $820 million in food assistance for more than two million kids. To put that in terms that y’all can understand, that means that the parents of kids who qualify for free or reduced lunches in Florida are missing out on an extra $375 during a pandemic. And DeSantis does this while flinging open the door to a variant that’s targeting children with a ferocity we’ve never seen. Along those same lines, take a look at what Laura Ingraham recently said about people struggling during the pandemic.\nLAURA INGRAHAM ON FNC, AUG. 13: What if we just cut off the unemployment? Hunger is a pretty powerful thing. I don’t mean physical hunger, because people who truly are in need, need help. I’m talking about people who can work but refuse to work.\nREID: I’m sorry. What? [impersonating Scrooge] ‘Are there no workhouses? Are there no orphanages?’ What is wrong with these people? Oh, wait. I know. They love cruelty. They savor it. Cruelty is the point. Want another example? Just take a look at the conservative-led Supreme Court. Last night, that conservative majority cleared the way for evictions to resume across the country. Yay! Three-and-a-half million Americans could now end up in the street thanks to Justices Roberts, Alito, Thomas, Gorsuch, Barrett, and Kavanaugh, a decision they probably cooked up while sitting in the comfort of their million-dollar suburban homes. So on this Friday evening, I toast these Republicans as the absolute worst because it takes a particular type of person to look someone in need in the eye and then just turn your back on them and say 'Go hungry. Stop being so greedy. Why do you want food?'\nBrent Baker, vice president of research and publications for the Media Research Center, explains our weekly pick: “Reid keeps showing how nasty she is, presuming the most vile instincts of anyone not as far left as she is. Reid has contempt for anyone concerned about wisely spending taxpayer money, presuming every recipient of federal largess is deserving. But she has no such concern for the plight of housing providers who weren’t getting rent they were due, seemingly OK with subverting the constitution to allow people to escape their obligations.”\nRating: FOUR out of FIVE screams.\n■ August 23: Liberal Media Scream: CNN regular says Biden’s doing a heck of a job\n(Washington Examiner post)\nIt is no surprise that some in the liberal media are running block for President Joe Biden’s bumbling in Afghanistan. But CNN took the Liberal Media Scream prize this week by featuring a pundit who thinks the president is doing a heck of a job.\nIt came on CNN’s Sunday Reliable Sources show hosted by Brian Stelter when consultant Matthew Dowd said that the media isn’t giving Biden credit for a great mission accomplished, especially when compared to deaths related to the COVID and crime fights he is struggling with.\nDowd, the former chief political analyst for ABC News, said, “the press has a tendency to judge things by anecdotes,” but “data for the last week shows Joe Biden has basically gotten 30,000 people out of Afghanistan without a single loss of an American life.”\nFrom the Sunday, Aug. 22 Reliable Sources:\nBRIAN STELTER: So, Matthew Dowd, you would describe the media coverage this week as what?\nMATTHEW DOWD: Way over the top and unconnected to a perspective on the issue from the beginning. They added a perspective in the final days, but from the beginning, they didn’t have a perspective on it.\nMy sense of this is, Joe Biden has done — we should judge it by the data of what’s happened and not by anecdotes — and sometimes, the president, the press has a tendency to judge things by anecdotes and not the data. And the data for the last week shows Joe Biden has basically gotten 30,000 people out of Afghanistan without a single loss of an American life ...\nKeep in mind one thing, Brian, 5,000 people, while this was going on, died of COVID in this country. Five hundred people died of gun violence in the last week in this country. And not a single American has died in the pullout amidst this chaotic situation in a political hurricane, and I don’t think the press fully understands what the context is for the American public. And so when you understand the context not only of Afghanistan but the context of what’s going on in our country, there’s far worse crisis situations, including the assault on our democracy, that get forgotten about in the midst of this.\nBrent Baker, vice president of research and publications for the Media Research Center, explains our weekly pick: “Dowd is one of the Baghdad Bobs of the current debacle, ignoring the dire reality that looks very bad for his favored political side. He’s a sycophant in defense of President Biden spinning liberal talking points about the supposed misdeeds of Trump and conservatives instead of offering any kind of honest assessment about Biden’s bungling.”\nRating: FIVE out of FIVE screams.\n■ August 16: Liberal Media Scream: MSNBC ‘expert’ says GOP trying to make migrants ‘disappear’\n(Washington Examiner post)\nThis week’s Liberal Media Scream features a key MSNBC guest who said Republicans are trying to “disappear” nonwhites and liberal migrants from voting rolls.\nMSNBC’s Ali Velshi on Saturday featured a guest who charged “the politics of Republican redistricting really reflects a kind of ugly logic of removal” in which “they’re trying to disappear certain voices and populations.”\nCristina Beltran, associate professor at New York University’s Department of Social and Cultural Analysis, said, “Stephen Miller couldn’t do it, or Trump couldn’t do it” — but following new census numbers, they will try through redistricting.\nBeltran, author of the book, Cruelty as Citizenship: How Migrant Suffering Sustains White Democracy, said that “the GOP really can’t make the nation whiter, so they’re using redistricting to strip citizens of their power and to make Congress look less like America.”\nFrom Saturday morning’s Velshi on MSNBC:\nALI VELSHI: Cristina, when people — the census shouldn’t surprise most people who follow, like you do, population and demographics in America. But, I think that the conclusion is counterintuitive. Most people say, 'Well, if the census says we’re more diverse, our representation should get more diverse.' In fact, it is likely to get less diverse.\nCRISTINA BELTRAN: Exactly, exactly, and I think that’s a real challenge here is that the census, one hand, is telling us something we already know: That America is a deeply multiracial nation, but the politics of Republican redistricting really reflects a kind of ugly logic of removal, right? Where they’re trying to disappear certain voices and populations, right? And so, I think they’re trying to disappear a lot of Americans politically, right? Stephen Miller couldn’t do it, or Trump couldn’t do it in their politics in a complete way, though they tried with anti-immigration politics, but the GOP really can’t make the nation whiter, so they’re using redistricting to strip citizens of their power and to make Congress look less like America.\nBrent Baker, vice president of research and publications for the Media Research Center, explains our weekly pick: “The only ‘ugly logic’ here is from Ali Velshi and MSNBC in their decision to feature a guest with such an ugly take on a standard practice after every census when the party which dominates in a state gets to do some ‘gerrymandering.’ It’s hardly the nefarious deed suggested by Beltran and hardly unique to one party. But leave it to MSNBC to give it a racist tinge while tossing in some vitriol toward Donald Trump and Stephen Miller.”\nRating: FOUR out of FIVE screams.\n■ August 9: Liberal Media Scream: CNN’s Acosta sneers, ‘Call it the DeSantis variant’\n(Washington Examiner post)\nThis week’s Liberal Media Scream features CNN’s Jim Acosta going full liberal bias in attacking Florida Gov. Ron DeSantis’s handling of the latest coronavirus outbreak.\nOn CNN Saturday afternoon, Acosta blamed Republican politicians for COVID-19 deaths, particularly DeSantis.\n“Instead of the delta variant, why not call it the DeSantis variant?” the anchor said. Acosta, known for his hostility to President Donald Trump when he covered the White House, didn’t say the same thing about New York Gov. Andrew Cuomo, who earlier had a COVID death outbreak on his hands.\nWith a matching image on screen, Acosta suggested, “We could sell beer koozies that say ‘Don’t Florida My Fauci,’” (a play on koozies that say ‘Don’t Fauci My Florida’) before snidely concluding with how the money raised could be used “to help pay for all the funerals that will be coming.”\nAcosta, on CNN Newsroom, on Saturday afternoon, Aug. 7:\n“People should not have to die so some politicians can own the libs. They’re not owning anybody, but they may end up owning the pandemic, because they’re prolonging it. Perhaps it’s time to start naming these new variants that may be coming out after them. Instead of the delta variant, why not call it the DeSantis variant? We could sell beer koozies that say ‘Don’t Florida My Fauci’ and use the money to help pay for all the funerals that will be coming in the days to come.”\nBrent Baker, vice president of research and publications for the Media Research Center, explains our weekly pick: “Acosta is just furthering his image as more of a clownish political hack than any kind of fair-minded journalist. If deaths from COVID-9 are such a serious issue, which they are, why is he, an anchor for a national cable news channel, making such a crass political insult which hardly shows respect for the science?”\nRating: THREE out of FIVE screams.\n■ August 2: Liberal Media Scream: New CNN low, comparing Trump ‘cult’ to Jonestown massacre\n(Washington Examiner post)\nThis week’s Liberal Media Scream features CNN’s Brian Stelter’s Trump Derangement Syndrome hitting a new low, inviting a comparison of the “cult” of Trump to the Jim Jones cult killings in Jonestown, Guyana, in 1978.\nOn his Sunday show, Reliable Sources, the liberal media nag brought aboard Rep. Jackie Speier, who survived the Jonestown massacre, to equate the “cult of Trump” with the mass murder-suicide of 918 followers of Rev. Jim Jones. “I wanted to hear her thoughts about the comparison, the notion of the cult of Trump,” Stelter said in setting up the welcoming California lawmaker.\nSpeier, who was shot five times as she tried to escape at an airfield when she was a member of the staff of Rep. Leo Ryan, welcomed the spin. “There's no question” you “could compare” the two “charismatic leaders,” she said.\nStelter played along: “It’s scary to hear that when you have observed the Trump phenomenon, you have seen similarities to Jonestown.”\nStelter had opened the segment by relaying feedback from international viewers asking, “Why doesn’t the American media just call out Trump for what he is, call Trump fandom for what it is? Sometimes they use the word, cult.”\nFrom the start of the segment on the Aug. 1 Reliable Sources on CNN:\nBRIAN STELTER: Welcome back to Reliable Sources, live in the U.S. and all around the world. And one of the great things about being shown on CNN International is that I hear from viewers who observe American political dysfunction from an outsider’s point of view. These citizens in other countries sometimes email me and say, you know, why doesn’t the American media just call out Trump for what he is, call Trump fandom for what it is? Sometimes they use the word, cult. I know that’s a sensitive word. It doesn’t come up a lot in American news coverage.\nSo, I wanted to put it to an expert, an unfortunate expert, Congresswoman Jackie Speier started out her career in politics, working for a lawmaker. She’s on a fact-finding mission to Jonestown. She sadly knows firsthand about the weight of that word, cult. She was able to escape with her life, others were not able to that day. So, I wanted to hear her thoughts about the comparison, the notion of the cult of Trump, especially in the light of January 6th, and the mass delusion that led people to a riot of lies on Capitol Hill. When I brought this up with her, she did not mince words.\nREP. JACKIE SPEIER: There’s no question that you could compare Jim Jones as a charismatic leader, who would bring his congregation together, forced them to do things that were illegal, and then took 900 of them into the jungles of Guyana, where over the course of time, he then convinced them that they should die. I’ve never been able to say they committed suicide because I don’t think they were in control of their faculties, to be quite honest with you.\nSo, you look at Donald Trump, charismatic leader, who was able to continue to talk in terms that appealed to those who are disaffected, disillusioned, and who were looking for something, much like those who became part of Jim Jones’s congregation, the People’s Temple. They were lost souls. And the only difference between Jim Jones and Donald Trump is the fact that we now have social media. So, all these people can find themselves in ways that they couldn’t find themselves before.\nSo, he basically was a merchant of deceit, both of them merchants of deceit, both of them making people not look at facts, not think independently. And sowed a story for them that was indeed destructive.\nSTELTER: It’s scary to hear that when you have observed the Trump phenomenon, you have seen similarities to Jonestown.\nBrent Baker, vice president of research and publications for the Media Research Center, explains our weekly pick: “The longer Trump is out of the White House the more Trump Derangement Syndrome seems to grow among his biggest haters in the media, with Stelter taking it to a whole new level each week. Last week, he featured Carl Bernstein calling Trump a 'war criminal.' This week, Trump’s just like a cult leader who led hundreds of followers to commit mass suicide and murder a congressman. Only Trump has never done that. Maybe Stelter should look a little closer to home to see who is in a personality-based cult.”\nRating: FIVE out of FIVE screams.\n■ July 26: Liberal Media Scream: The worst of Trump hater Carl Bernstein\n(Washington Examiner post)\nThis week’s Liberal Media Scream features the latest anti-Trump outburst from Watergate reporter Carl Bernstein — and his worst hits list.\nSunday on CNN’s Reliable Sources, his main venting venue, he hyped up his prior attacks on former President Donald Trump, claiming that the Republican is a “war criminal.”\nHis over-the-top invective against Trump is nothing new, as a quick trip through the CNN archive shows. In 2017, he declared of Trump’s decision to remove the FBI director, “This is a potentially more dangerous situation than Watergate.” In 2020, he was repeating his Watergate comparison as he charged Trump allies had “now joined hands with a tyrant.” Last fall, he described Trump’s response to COVID as “homicidal negligence” before declaring “we are witnessing the Mad King in the final days of his reign.”\nOur Liberal Media Scream partner Brent Baker, the vice president of the Media Research Center, drew up a list of Bernstein’s greatest anti-Trump hits:\n♦ “I think this is a potentially more dangerous situation than Watergate, and we’re at a very dangerous moment. And that’s because we are looking at the possibility that the president of the United States and those around him during an election campaign colluded with a hostile foreign power to undermine the basis of our democracy: free elections.” — Reliable Sources, May 14, 2017.\n♦ “Let’s look at what Watergate was because it was about a criminal president who acted as a tyrant. And what we have here now is the Senate of the United States, through the Republican leadership and membership, has now joined hands with a tyrant.” — CNN Newsroom, Jan. 31, 2020.\n♦ “His response has been homicidal negligence. He has failed to protect the American people and rather to put his own interest of reelection and holding on to the office of the presidency in front of the health and well-being of the American people.” — CNN Newsroom, Oct. 3, 2020.\n♦ “We are witnessing the Mad King in the final days of his reign, willing to scorch the Earth of his country and bring down the whole system to undermine our whole democracy, strip it of its legitimacy, poison the confidence of our people in our institutions and the constitution for Donald Trump’s own petulant, selfish, rabid ends.” — CNN New Day, Nov. 20, 2020.\n♦ “I think we need to calmly step back and maybe look at Trump in a different context. He is America’s, our own American war criminal, of a kind we’ve never experienced before ... In international law, there have been, quote, 'crimes against humanity.' I think what we’re talking about, Trump’s crimes as an American war criminal in his own country that he has perpetrated upon our people.” — Reliable Sources, Sunday.\nBaker explains our weekly pick: “Bernstein is a one-note musician, trying every week to ramp up his singularly focused anger to get some attention. With so much unhinged animus for Trump, it’s hard to imagine anyone considers his rants anything more than entertainment from a guy trying, but failing, to match Trump’s skill at creating a negative public image for his opponents through creative terminology.”\nRating: FIVE out of FIVE screams.\n■ July 19: Liberal Media Scream: Press should ‘move on’ from balance to liberal advocacy\n(Washington Examiner post)\nThis week’s Liberal Media Scream features a Washington Post columnist telling it like it is: Liberal advocacy in the media is the correct bias.\nOn CNN’s Reliable Sources show, Perry Bacon Jr. argued the news media “should move on from” caring about attracting just as many Republicans as Democrats to read or view their reporting. Picking up on a column he wrote last week, Bacon said the “core mission” of the media is to present “facts” and “an evidence-based view of the world.”\nBut his “facts,” of course, overlap with the priorities of liberals, not uncommon for Washington Post columnists who are given more freedom in their work. For example, he said, “We in the media are biased in terms of we support vaccines. We in the media hire LGBT employees. We are biased against bans against trans or gay people.\"\nGive credit to the Washington Post for highlighting the bias of its scribes. In Bacon’s bio, for example, it offers up his coverage area. Under “The Democratic Party,” it says, “The Democratic Party is generally moving in a pro-equality (racial, economic, class, gender, sexual identity) direction.” Under “The Republican Party,” it reads, “The Republican Party is moving in an anti-democratic, anti-Democrats direction.”\nBacon on Sunday’s Reliable Sources on CNN:\n“They should move on from this idea that they’re trying to, you know, the audience is trying to get equal numbers of Republicans and Democrats or to not offend Mitch McConnell’s office or whatever it is, and to really get focused on what is our core mission. And I would argue the core mission is to present facts, present evidence, present an evidence-based view of the world, and to also, in my view, defend the ideas of a democracy and a multiracial democracy, I think, is part of what the media should be doing. What that looks like, I think, is defending and being unabashed. Vaccines work. Joe Biden won the election. Black lives do matter, and we should be honest about when black people are discriminated against unfairly. And to sort of start from a place of, do we have some clear-cut values we can articulate — articulate those in some way on our websites, in our programming, to be honest about like, we’re trying to fight this bias thing.\n“We are biased in terms of facts. We in the media are biased in terms of we support vaccines. We in the media hire LGBT employees. We are biased against bans against trans or gay people. So we can be honest about those biases, and sort of, we are in favor of a multiracial democracy. That’s why journalists behave the way they did when Trump — we are in favor of the person who won the election being president. So once we’re honest about those things, that may turn off some people, but it will help us be better as institutions and better as journalists if our first goal is, here are the values we stated we are trying to implement, and then secondary, we will take the audience who embraces those values.\n“That doesn’t mean our values are Democratic and not Republican, but our values that we’re talking about are small-D democratic and not authoritarian or something like that. So I think if we get clear on values, of course, the media is for, against authoritarian people like Trump. The media cannot exist in a functional way without having, you know, without having a free press, which dictators usually oppose.”\nMedia Research Center Vice President Brent Baker explains our weekly pick: “I guess Bacon should get some points for honesty, for articulating how, presumably, many of his colleagues feel, that fairness and balance should be damned in favor of declaring liberal presumptions as the factual reality and dismiss contrary views as unworthy. But far from fixing journalism, Bacon's prescription will ensure its demise as media figures no longer pretend to be anything but left-wing political activists.”\nRating: FOUR out of FIVE screams.\n■ July 12: No Liberal Media Scream this week.\n■ July 5: Liberal Media Scream: ABC analysts huff at justices over voting decision\n(Washington Examiner post)\nThis week’s Liberal Media Scream features two ABC This Week commentators making a new argument for wide open voting — some people can’t afford enough gas to get food and vote.\nThe Thursday Supreme Court ruling, upholding two provisions of Arizona’s voting rules which required people to vote at their own precinct and barred ballot harvesting, irked the two who cited anecdotes about difficulties encountered by poor and minority voters.\nLZ Granderson, an ABC News podcaster, ESPN contributor, and Los Angeles Times columnist, said the justices were out of touch because they are not poor: “They’re all privileged.” He recalled his “mom scraping together 50 cents, 75 cents, a dollar just for gas to get to a grocery store” and so “now you’re forcing minorities to decide” between getting to a polling place or buying groceries.\nWashington Post reporter Mary Jordan cited misdeeds she saw in Mississippi with “all kinds of dirty tricks being played about closing polls, switching where you’re supposed to be, telling people they’re in the wrong place even if they’re in the right place.”\nFrom the Sunday, July 4 roundtable after host Martha Raddatz characterized the ruling as “not exactly in line with public opinion,” an assessment based on an ABC News/Washington Post poll:\nLZ Granderson: “No, of course not, but they don’t really care about public opinion, right? If they did, then all of this legislation would be looked at differently. You know, the thing that really frustrates me most is the justices acknowledged that these new laws does impact minorities. They didn’t deny that aspect of it. They just said that the inconvenience of it isn’t so great. Well, they’re all privileged. And I grew up poor. I remember my mom scraping together 50 cents, 75 cents, a dollar just for gas to get to a grocery store. When you do that to polling places, now you’re forcing minorities to decide whether or not they’re going to invest money, gas money, to get to the polling places that are now further away or do I use this gas money to get to the grocery store or do I to get to work. They’re privileged, saying that this doesn’t inconvenience them enough. Well, how do you know? When was the last time you were that poor?”\nMary Jordan: “I’d like to talk about, I went down in Mississippi, and I saw this. And on the morning of the election, people would turn out and the polling place would be closed in the place where there were a lot of Democratic voters. And so the question then was do I drive, so I spend another 45 minutes in the car to go there and wait in a really long line? There’s all kinds of dirty tricks being played about closing polls, switching where you’re supposed to be, telling people they’re in the wrong place even if they’re in the right place. I think if people really knew what was going on, because it differs state by state and county by county, they would think, you know what, it’s July 4th here. It’s all about voting, right? It’s the most fundamental of rights. We had the Boston tea party because we couldn’t vote, and we were getting taxed. And it’s kind of shocking that right now, a lot of people don’t have the same access to votes as other Americans.”\nMedia Research Center Vice President Brent Baker explains our weekly pick: “Granderson and Jordan seemed to be searching for anecdotes to justify their position against very basic voter integrity rules and came up with pretty weak ones. Making everyone vote at their local precinct is the ultimate in fairness and requires the least bus money while eliminating lots of opportunities for confusion and fraud. As for all the misdeeds Jordan saw in areas ‘where there were a lot of Democratic voters,’ which force people to ‘spend another 45 minutes in the car,’ that is just what the Arizona local precinct rule is meant to prevent. And which party controls the election systems virtually everywhere where minorities and Democrats are the majority? It’s not rich, privileged Supreme Court justices.”\nRating: FOUR out of FIVE screams.\n■ June 28: Liberal Media Scream: Taxpayer-subsidized PBS is more DNC than the DNC\n(Washington Examiner post)\nThis week’s Liberal Media Scream features the clearest example yet that taxpayer-subsidized PBS is becoming an arm of the Democratic National Committee.\nAppearing on Meet the Press, activist journalist Yamiche Alcindor echoed the DNC talking points on state-passed voting reforms, ignoring several fact checks that have shown that some, notably Georgia, have adopted more progressive voting changes than President Joe Biden’s home state or uber-liberal Connecticut.\nInstead, the new host of PBS’s Washington Week and the White House correspondent for PBS NewsHour declared “an existential crisis in America” and went so far as to say that states are taking votes away from people “if we don’t like the way that you voted.”\nAnd, as she has before, she gave the president a little advice, this time to “accelerate his nominees to the courts.”\nFrom the roundtable on Sunday’s Meet the Press:\n“When you talk to people who are really familiar with the thinking about this, it’s that Democrats realize that they might, that it’s not going to only be solved in a legislative way. There has to be a judicial and a court battle ahead. And when I’m talking to civil rights activists, they say they want to see two specific things: One, the DOJ really going after state legislatures. So, it’s to say you can not just, not only voters, not only suppress people’s votes, but nullify people’s votes. So, that can’t be the way that America works. The second thing that they want to see is more judges on the court. They want to see President Biden accelerate his nominees to the courts. So, I think that’s also where this is going.\n“This is an existential crisis in America. Who can actually get the access to vote? Republicans in state legislatures are saying if you, essentially, and critics would say that 'if we don’t like the way that you voted, we will take away your vote.' And that, I think, is a real problem. If you look at Philadelphia state legislatures and if they, and whether or not they can even nullify a million votes in Philly — that could be a problem and a big problem.”\nMedia Research Center Vice President Brent Baker explained our weekly pick: “If there was any doubt remaining about whether Alcindor is a journalist or a Democratic political activist pretending to be a journalist, she eliminated it with this bombast, which has no basis in reality and echos the most extreme rhetoric of far-left activists. Nobody’s vote is being taken away anywhere. In fact, while some Republican states have set rules to guarantee multiple days of early voting, some states, such as Democratic-run Connecticut, have no early voting.”\nRating: FIVE out of FIVE screams.\n■ June 21: Liberal Media Scream: Chuck Todd calls parent-led opposition to critical race theory fake\n(Washington Examiner post)\nThis week’s Liberal Media Scream features the dismissal by NBC's Chuck Todd of parent-led opposition to the teaching of critical race theory in schools.\n“It’s manufactured,” he said, brushing aside all the protests, even many near Washington where Todd reports from, of public school parents lining up to oppose CRT. His Meet the Press guest, pollster Cornell Belcher, went further, blaming former President Trump and “tribalism.”\nIn fact, polls show that even in the liberal Washington suburbs, the majority oppose teaching the revisionism that America is basically racist.\nFrom the roundtable on the June 20 Meet the Press, with comments first from PBS NewsHour chief correspondent Amna Nawaz and Republican pollster Brad Todd:\nAMNA NAWAZ: Yeah. And specific to this idea of critical race theory, I have to tell you, I just spent some time reporting on this county in Virginia about an hour outside of Washington. And to your point, this is something that is mobilizing people and resonating very deeply. It was about a 100 degree day. Dozens and dozens and dozens of parents, mostly white, in this largely affluent county, showed up to a school board meeting, for many of them, the very first school board meeting they’d ever attended, specifically because of this one issue.\nBRAD TODD: That’s important to note, that you mentioned critical race theory a couple times. This is a parent-led backlash at the grassroots level.\nCHUCK TODD: It’s manufactured, and then sort of seems to have been lit, the fire was lit.\nBRAD TODD: I disagree. I think it started because parents have had it with the education bureaucracy after COVID. They’re fed up with it. They tend to trust Democrats when it comes to education funding, but they trust Republicans on education accountability. I think that what the backlash you’re seeing on critical race theory in schools is another example of parents trying to hold educators accountable.\nCORNELL BELCHER: It’s coordinated. It’s aggressive. It’s intentional, right? This is, this is part of the tribalism play. The critical race theory is yet another tool in the racial tribal boogeyman’s toolbox to drive and inflame tribalism, which Republicans think helps them in elections. This is Trump 2.0. This is, it’s a continuation of this, right? Critical race theory is an, an arcane sort of ideal. Why is it front and center right now? The same reason that Mitch McConnell attacks Stacey Abrams when she came out for the voting bill. It is racial. It is tribalism. We’ve seen it grow under Trump. And this is part and partial of it. And they think this helps ignite their base. There’s no way this is not grassroots. And, Brad, you know this is organized and is being paid for.\nCHUCK TODD: But, you know, Ashley-\nBRAD TODD: We’re not very good at organizing anything on our side.\nCORNELL BELCHER: You all are better than us.\nMedia Research Center Vice President Brent Baker explains our weekly pick: “Typical of arrogant news media figures, dismissing grassroots concerns as ‘manufactured’ and racist, as if on their own parents can’t recognize extremist racial teaching that will further divide the country. And it takes chutzpah for Belcher to accuse conservatives of ‘Trump 2.0’ and employing ‘the racial tribal boogeyman’s toolbox to drive and inflame tribalism,’ when liberals have spent the last months racializing efforts to pass voter integrity laws by calling them ‘Jim Crow 2.0.’”\nRating: FOUR out of FIVE screams.\n■ June 14: Liberal Media Scream: GQ journo says US may be worse than Russia on human rights\n(Washington Examiner post)\nThis week’s Liberal Media Scream features a prize-winning Russian-born journalist suggesting that President Joe Biden has no standing to challenge Russian President Vladimir Putin on human rights.\nJulia Ioffe, appearing on MSNBC, said the United States fails the moral superiority test because of “voter suppression” and police “constantly” killing black people.\nIoffe, who writes for GQ and other sites, said, “It is a lot harder to talk to Vladimir Putin about human rights when we still haven’t cleaned up our mess at home.” And, she added, “Russians are seeing exactly what we’re seeing: the voter suppression laws, the, you know, slide toward minority rule, the undermining of our own democracy.”\nIoffe on Morning Joe today:\n“I did want to return quickly to the point of ‘whataboutism.’ Of course, it’s a way of not answering the question, but it works on many people because they always start with a grain of truth, right? And, you know, it’s interesting. Yes, the Soviet Union constantly talked about the violation of the civil rights of African-Americans in America in the ’50s and ’60s and even going back to the ’30s. And one of the reasons that the Civil Rights Act was passed and that the American president got behind it was to kind of take this card out of the hands of the Soviets.\n“And, you know, President Biden, politically speaking, is not going into this meeting with a great hand of cards, either. You know, Russians are seeing exactly what we’re seeing: the voter suppression laws, the, you know, slide toward minority rule, the undermining of our own democracy. So it is a lot harder to talk to, you know, we’re seeing black men and women being killed by police constantly in this country, so it is a lot harder to talk to Vladimir Putin about human rights when we still haven’t cleaned up our mess at home.”\nMedia Research Center Vice President Brent Baker explains our weekly pick: “Ioffe not only returned to ‘whataboutism,’ but she returned to the left-wing’s moral equivalence between the U.S. and Soviet Union of the Cold War years when all too many journalists were more upset by what President Reagan said about the Soviet Union than the human rights violations committed by the Soviets. She’s now justifying Putin’s take on the U.S. by treating some shortcomings of the U.S., and democratic debate within our nation about how to improve those shortcomings, with a Russian dictator who has no interest in civil rights for anyone as he suppresses dissent, using unjustified incarceration and murder as his tools.”\nRating: FOUR out of FIVE screams.\n■ June 7: Liberal Media Scream: CNN’s Stelter gives the full Monty to Biden’s Jen Psaki\n(Washington Examiner post)\nThis week’s Liberal Media Scream features CNN media critic Brian Stelter’s “interview” of White House press secretary Jen Psaki, a display of how the liberal cable channel has whipsawed from ripping the Trump administration to fawning over the Biden team.\nJust consider his first question during his Sunday show.\n“What do you think we get wrong?” Stelter asked.\nThat was followed up with wondering, “what’s your advice” for journalists “to stay close to the truth in this world of lies?”\nThen, after noting that he and Psaki have young children, he asked, “What kind of country is this going to be when they are our age? Do you fear that, given the craziness we’re seeing from the GOP? Do you fear that for our kids, your kids and mine?”\nStelter sympathetically set up the segment, recorded on Friday and aired on Sunday’s Reliable Sources: “In this era of media bunkers and alternative realities, the White House press secretary faces some unique challenges. So let’s hear from Jen Psaki to get her perspective nearly five months into the job and about what might lie ahead.”\nSome of his “questions” to Psaki:\n♦ “Busy summer ahead, infrastructure, election reform. What does the press get wrong when covering Biden’s agenda? When you watch the news, when you read the news, what do you think we get wrong?”\n♦ “For other P.R. professionals who watch what you do, for journalists who watch what you do, what’s your advice for them about trying to stay as close to the truth in this world of lies?”\n♦ “I know this is often adversarial, but it also has to be functional. Is the relationship between the White House and the press corps now at least functional in ways that it wasn’t in the Trump years?” (Psaki: “I think so.”)\n♦ “This is what I really wanted to ask you. You mentioned your kids, you have a daughter going into kindergarten, I have a daughter going into pre-K. And I think to myself, what kind of country is this going to be when they are our age? Do you fear that, given the craziness we’re seeing from the GOP? Do you fear that for our kids, your kids and mine?”Media Research Center Vice President Brent Baker explains our weekly pick: “My how the world has changed from the Trump years when CNN treated White House officials as enemies who must be discredited. Now, White House staff are their friends and allies. Stelter should be embarrassed by such a performance after years of disdain for Trump’s politics and press secretaries. But he won’t be. In this interview he acted more like a groveling student yearning for his professor’s approval (‘Tell me what I’m doing wrong,’ ‘How can we be a truthful as you?’), followed by trying to show his shared disdain for her political opponents, than any kind of journalist holding those in power to account.”\nRating: FIVE out of FIVE screams.\n■ May 31: Liberal Media Scream: ‘Some things may be true, even if Donald Trump said them’\n(Washington Examiner post)\nThis week’s Liberal Media Scream features a top critic of the Trump years, ABC’s Jonathan Karl, who finally said out loud what supporters of President Donald Trump already knew: The White House press corps had such contempt for the president that they dismissed everything he said.\nOr, in Karl’s words, “some things may be true, even if Donald Trump said them.”\nKarl on Sunday’s This Week grudgingly conceded that Trump may have been correct in pointing to a lab in Wuhan, China, as the source of COVID-19. He blamed Trump, not journalists, for ignoring the lab as the source because of how Trump used “racist” terms in describing the virus.\nDuring the roundtable segment on This Week, after host Martha Raddatz suggested “some people have egg on their face” for being so dismissive of the possibility that the COVID-19 virus came out of a Chinese lab, Karl said:\n“Yes, I think a lot of people have egg on their face. This was an idea that was first put forward by Mike Pompeo, secretary of state, Donald Trump. And look, some things may be true, even if Donald Trump said them. And there was — because Trump was saying so much else that was just out of control, and because he was, you know, making a frankly racist appeal talking about ‘kung-flu’ and the ‘China virus,’ his notion that he put forward that this may have, or that he said flatly that this came from that lab, was widely dismissed. But actually, there's some real reason — we don’t know, by the way, we still don’t know, we absolutely don’t know, but now, serious people are saying it needs a serious inquiry.”\nMedia Research Center Vice President Brent Baker explains our weekly pick: “Karl said out loud what everyone already presumed: So many in the Washington press corps had such contempt for President Trump that they dismissed anything he said they could characterize in their minds as coming from foul motives. Thus, journalists proudly rationalized putting their prejudices first. But that meant the media failed in its basic duty to inform the public of the best information available about the source of a pandemic which has killed 3.5 million worldwide.”\nRating: FIVE out of FIVE screams.\n■ May 24: No Liberal Media Scream this week\n■ May 17: Liberal Media Scream: Chuck Todd doesn’t like to be called liberal, ‘Don’t start that!’\n(Washington Examiner post)\nThe question in this week’s Liberal Mainstream Scream is this: Can NBC Meet the Press host Chuck Todd handle the truth?\nAn answer came in his interview with Texas Republican Rep. Dan Crenshaw after Todd hit him for five questions on the removal of Wyoming Rep. Liz Cheney as the No. 3 House leader after she refused to stop criticizing former President Donald Trump on his election fraud claims.\nAn exacerbated Crenshaw, after watching the liberal media turn the ouster into the next disaster for the GOP, blurted out, “You guys in the press love doing this” and “I get it, right? The press is largely liberal. They’re largely pro-Democrat.”\nTodd wouldn’t hear it and tried to take back the conversation. “No, no, no, no, don’t start that ... There’s nothing lazier. There’s nothing lazier than that,” he said.\nTodd tried repeatedly to get Crenshaw to denounce his Republican colleagues and Trump in a series of questions, starting with asking him to agree that “Liz Cheney was kicked out of leadership simply because she wouldn’t carry the water of former President Trump’s election lies.” He followed up with “Why should anybody believe a word you say if the Republican party itself doesn’t have credibility?” and “Do any of your critiques come across as credible if you can’t accept the fundamental fact that our democracy held a free and fair election?”\nHe then pressed Crenshaw to backtrack from ever asking courts to review some election processes, leading to this exchange on the Sunday program:\nCHUCK TODD: This is an issue that many people have, is that you’re sitting here trying to, trying to say, ‘No, no, no, no, I just had a specific question,’ yet what you did gets weaponized by the former president. Did you see the rantings of him yesterday? And to the point where a Republican official in Maricopa County called the former president ‘unhinged.’ You know, I understand you guys want to put this behind you, but he is the leader of your party, and he doesn’t stop talking about this nonsense.\nREP. DAN CRENSHAW: Chuck, the only — look, he’s one of many leaders in the party. He’s a former president. We’re five months into President Biden’s presidency, and there is a time to move on. And look, you guys in the press love doing this, and I, and I get it, right? The press is largely liberal. They’re largely pro-Democrat.\nTODD: No, no, no, no, don’t start that. That is the laz — look, there’s nothing lazier. There’s nothing lazier than that.\nCRENSHAW: It is. I mean, there’s a lot of, there’s a lot of reasons to keep this alive.\nTODD: I understand — what you’re trying to appease —\nCRENSHAW: And there’s a lot of people in my party that take the bait. I’m not going to take the bait here —\nTODD: I’m not trying to bait you. I’m trying to — I’m trying to figure out —\nCRENSHAW: What is the outcome you’re looking for?\nTODD: Why do you, why do you, why do we sit here and have a political party that is basically rallying around this bizarre lie and mythology that the former president is doing, and you guys just want to say, ‘Hey, pay no attention to this,’ that, that somehow we in the press are bringing that up. It’s the former president.\nCRENSHAW: Well, I already, I already debunked the notion, I already debunked the notion that there's, that there’s no space in the party for that. Remember, Liz won that first election —\nCHUCK TODD: She’s not there now.\nCRENSHAW: She won that first leadership vote, OK? And I told you why. I helped you understand why. And what I’m trying to help you understand is these are not the phone calls I get about this, about who is the leader of the party, what’s happening with Trump? My Republican supporters do not ask me about Trump, they don’t ask me about what he said, they’re not riled up about it. You know what they’re asking about? What are we doing about over a quarter million illegal crossings on our border in the last two months? That’s what they’re asking about. How is that sustainable? What about my inflation? What about my savings that are now less valuable because of rising inflation because we’re spending money that we don’t have.\nMedia Research Center Vice President Brent Baker explains our weekly pick: “There’s nothing lazier than a liberal journalist, in the midst of pursuing a liberal narrative, denying the undeniable reality that the press and journalists are largely liberal. If Todd doesn’t want his guest to call out his biased agenda, then he shouldn’t keep asking a variation of the same question over and over because the guest won’t accede to his left-wing talking points.”\nRating: FOUR out of FIVE screams.\n■ New on May 10: Liberal Media Scream: Six more years of ‘Stacey Abrams for president’\n(Washington Examiner post)\nThis week’s Liberal Media Scream features the latest and gushiest media profile of politician and author (and wonder woman?) Stacey Abrams, who lost in her last election but who journalists believe will be president soon.\nCBS Sunday Morning larded on the compliments and promoted her presidential ambitions.\nIn a segment tied to plugging a new novel by Abrams, Erin Moriarty said, “Your main character is always a woman of color who’s smart and gutsy and cool under pressure. In short, Stacey Abrams.”\nAfter hailing her efforts to counter Republican voter integrity rules, Moriarty celebrated how “ensuring that right to vote may someday help Abrams achieve her greatest dream: running for president.”\nFrom the Sunday edition of the show:\nJANE PAULEY: We’re in conversation this morning with Stacey Abrams, the Georgia politician who was a force in last year’s presidential election. But she’s a woman of many other talents, as she’ll tell Erin Moriarty ...\nMORIARTY: Stacey Abrams has always dreamed big and accomplished much, but there’s also another side to the political activist from Georgia.\nABRAMS: I think people will be surprised.\nMORIARTY: Coming up on Sunday Morning, a conversation with a woman of many talents and identities.\n...\nMORIARTY: Your main character is always a woman of color who’s smart and gutsy and cool under pressure. In short, Stacey Abrams.ABRAMS: Well, I try to emulate my characters, and I try to have my characters reflect who I am.\n...\nMORIARTY: Ensuring that right to vote may someday help Abrams achieve her greatest dream: running for president.ABRAMS: Do I hold it as an ambition? Absolutely. And even more importantly, when someone asks me if that’s my ambition, I have a responsibility to say yes for every young woman, every person of color, every young person of color who sees me and decides what they’re capable of based on what I think I’m capable of. Again, it’s about you cannot have those things you refuse to dream of.\nMORIARTY: With Georgia, Florida, and most recently Texas, passing laws that limit voting, Abrams is expanding Fair Fight’s efforts around the country. She has a virtual book tour plan for her new novel and, of course, more books to write, which leaves little time for anything else. How do you have any time for a personal life?\nABRAMS: Well, let’s be clear. So Fair Fight, there’s also the Southern Economic Advancement Project, there’s Fair Count, there’s writing —\nMORIARTY: You’re making my point for me. You’re making my point!\nMedia Research Center Vice President Brent Baker explains our weekly pick: “It must be nice to be a liberal Democrat, so easy to get a friendly profile from a major media outlet promoting your political ambitions. Moriarty is clearly a personal admirer as she poured on the effusive praise, heralding Abrams for how she has ‘accomplished much,’ citing her ‘many talents,’ and touting her as ‘smart and gutsy.’ CBS never had to identify her as a liberal or a Democrat. With that kind of excitement about her from a journalist, viewers knew she couldn’t be anything else.”\nRating: FOUR out of FIVE screams.\n■ May 3: Liberal Media Scream: MSNBC declares black Sen. Tim Scott a race traitor\n(Washington Examiner post)\nThis week’s Liberal Media Scream featured a racist attack by a black MSNBC host on South Carolina Sen. Tim Scott, also black, after he rebutted President Joe Biden’s joint session speech to declaring that America is not racist.\nLeading the cable network’s attack was host Tiffany Cross, who denigrated Scott for having the gall to dispute the liberal line that America is racist.\nShe rolled out every racist phrase she could. Cross called Scott “a stone fool,” “slow-witted,” “a token,” and called his points “asinine,” all before the very low blow that Harriet Tubman would have left Scott “behind.”\nCross, however, didn’t have a problem when Biden and Vice President Kamala Harris agreed the United States is “not a racist country.”\nFrom Saturday's The Cross Connection on MSNBC:\nTiffany Cross: “This week, the sole black Republican in the Senate sounded a stone fool when he said this.”\nScott, in the Republican response to Biden’s address to a joint session of Congress: “Hear me clearly, America is not a racist country.”\nCross: “OK. Let’s be clear. Tim Scott does not represent any constituency other than the small number of sleepy, slow-witted sufferers of Stockholm syndrome who get elevated to prominence for repeating a false narrative about this country that makes conservative white people feel comfortable because when you speak an uncomfortable truth, like Nikole Hannah-Jones, the party that Scott claims is not racist gets big mad and tries to silence you. Just this week, Senate Minority Leader Mitch McConnell asked Education Secretary Miguel Cardona to scrap teaching the 1619 Project in schools because it would ‘reorient the view of American history.’ Lucky for McConnell, he has his own tap dancer to try and reorient the view of America for him.\"\n“There were so many contradictions in the senator’s speech that it was clear not even Scott believed the words he was speaking. I could go into detail refuting each of his asinine points, but he did that for me, and moreover, a lesson I’ve learned, don’t argue with people Harriet Tubman would have left behind. And sure, Tim Scott has spoken out about his encounters with law enforcement, and he co-sponsored the anti-lynching bill in the Senate, but there are two sides to every token. So thirsty for white approval, this dude actually stood on the national stage to defend the voter suppression law in Georgia even though, as of last month, 361 bills were being introduced in 47 states to keep people who look like him out of the ballot box.\n“The ability to shame the ancestors and appease the oppressors all in one speech, that’s extreme, though not quite like the domestic violent extremism that the Department of Homeland Security is investigating within its own ranks, mind you. But please, senator, say more about how un-racist the country is while you trot out that tired line about going from cotton to Congress to clown. Perhaps this was merely Sen. Scott’s audition to be Sam Jackson’s understudy in the film Django because, as a descendant of the enslaved and damn near a daily survivor of institutional racism, I can assure you the question, ‘is America a racist country?’, is one that has been asked and answered many times over.\n“Yet we still love America. Not for what it was, but for what it could be. On this one, you’re not only on the wrong side of the aisle, Sen. Scott, but you’re embarrassingly on the wrong side of history, as well.”\nMedia Research Center Vice President Brent Baker explains our weekly pick: “The five scream scale may not be adequate for this one. What a disgusting, hate-filled commentary full of personal invective, excoriating a U.S. senator as some sort of race traitor for daring to deviate from the left-wing line on how America is a racist nation and anyone who is black must not stray from specific policies advocated by the Democratic party. Cross shows how scared liberals are of contrary views, pouncing to silence any divergence from the left’s race orthodoxy before it can get any consideration.”\nRating: FIVE out of FIVE screams.\n■ April 26: Liberal Media Scream: DeSantis must be top dog the way media bark at him\n(Washington Examiner post)\nThis week’s Liberal Media Scream shows the latest evidence that the media view rising Florida Republican Gov. Ron DeSantis as a huge threat.\nThe same group that likes to stick “Hate Has No Home Here” posters in their front yard has pulled out every nasty name and reference they can to belittle his improvements in the state, which continues to see hoards moving there from the north.\nThe latest: He’s the reincarnation of former Alabama segregationist Gov. George Wallace.\nOn MSNBC late last week, anchor Joy Reid went on a rant trying to discredit DeSantis as a Wallace-inspired racist for signing a bill to hold rioters accountable for damages and harm to others. “It feels so George Wallace that I’m shocked that George Wallace didn’t actually think of it back when he was governor of Alabama,” she said.\nAfter a guest from Black Lives Matter declared, “This is straight out of the Jim Crow textbook,” and that “white supremacy is scared to death of us,” Reid said, “DeSantis appears to really want to reenact the entire George Wallace history. I guess he wants to be the modern-day George Wallace, because he is enacting a slew of laws that essentially try to make it illegal to protest in the state of Florida.”\nSomething they didn’t highlight: Wallace was a Democrat who pursued segregationist policies, as others in his party had. He was popular enough that in the 1972 Democratic presidential primaries, he lost to George McGovern by just 2 points in the popular vote. He won the Maryland and Michigan primaries, among others, despite being shot in an assassination attempt.\nFrom the Thursday, April 22 The ReidOut on MSNBC:\nJOY REID: You know, Brittany, this feels like it’s directed at y’all. This is directed at Black Lives Matter. It feels so George Wallace that I’m shocked that George Wallace didn’t actually think of it back when he was governor of Alabama.\nBRITTANY PACKNETT CUNNINGHAM, BLM ACTIVIST: Oh, this is straight out of the Jim Crow textbook, and let’s contextualize Jim Crow, shall we? When black people got more free, there were new laws created to make us less free. This is exactly what is happening right now. What this actually shows me, Joy, is that white supremacy is scared to death of us, and it absolutely should be. This is what you do when you cannot win fair and square. You suppress votes, and you suppress voice. So, we have to pay attention here, because the GOP plays the long game, and they play the expansive game. They plan far in advance. They gerrymander states so that they can control statehouses, and then, they use all of that power to maintain their power and suppress us from multiple angles. So, then they make it illegal to engage in the two most democratic practices you got in this country, and they make sure to target black folks when they do it. That way, among other things, you can leverage the police that you’ve militarized to protect your systems and to continue to terrorize us. So, it’s our job to keep them on the ropes, because this is what desperation looks like, and I want them to stay desperate. They know how powerful we are. That’s why we’re seeing this.\nREID: You know, Rep. [Anna] Eskamani, the racist Miami sheriff who coined the term ‘When the looting starts, the shooting starts’ was from South Florida. Donald Trump then turns around and quotes him. Ron DeSantis appears to really want to reenact the entire George Wallace history. I guess he wants to be the modern-day George Wallace, because he is enacting a slew of laws that essentially try to make it illegal to protest in the state of Florida, illegal to touch their precious Confederate statues from the losing side of the Civil War, right? But then we also can’t vote. This is Jim Crow in your state. What can Democrats do about it?\nMedia Research Center Vice President Brent Baker explains our weekly pick: “Reid long ago lost any pretense of being a journalist and is now just a left-wing political activist dedicated to smearing and discrediting conservative politicians, especially rising leaders like DeSantis who dare gain traction on the Right by going against the woke far-left political narrative. She’s returned to her political roots. She worked for Barack Obama’s 2008 presidential campaign. Now, she’s working on behalf of the entire Democratic Party to abet its most radical elements.”\nRating: FOUR out of FIVE screams\n■ April 19: No Liberal Media Scream this week\n■ April 12: Liberal Media Scream: Smug shrugs from 60 Minutes on DeSantis hit job\n(Washington Examiner post)\nThis week’s Liberal Media Scream turns to the sloppy 60 Minutes report last week on Florida Gov. Ron DeSantis and the TV news magazine’s smug refusal to admit its reporting and editing failures in a story a Washington Post media critic called “a plume of innuendo.”\nUnder fire for a week for suggesting the governor was in a “pay to play” scandal it never proved, 60 Minutes instead offered a big “whatever” in response to critics.\nAt issue was a story two Sundays back by correspondent Sharyn Alfonsi, who suggested DeSantis partnered with Florida’s Publix supermarkets to give COVID-19 shots after dishing contributions to him.\nHe denied the charges, but much of his explanation was edited out of the story, and media critics said that the reporter made her case poorly. DeSantis called the story a \"big lie.\"\nLast night, at the end of the show, when letters are sometimes read, Alfonsi did not pull back her story and instead read excerpts from three letters, starting with how “some viewers, including a retired newsman, applauded the story.”\nShe moved on to a woman who denounced CBS’s “shameful biased reporting,” then ended with a cutesy challenge from a man who wrote, “I will only watch” the show “one more time. Just to see if you broadcast this message.”\nFrom the conclusion of the April 11 60 Minutes:\nSharyn Alfonsi: “In the mail this week, comments on our story about disparities in the distribution of COVID-19 vaccine in Palm Beach County, Florida. Viewers focused on an exchange with Florida Governor Ron DeSantis at a press conference. Some viewers, including a retired newsman, applauded the story.”\nReading a letter from Nick Boryack of Vero Beach, Florida: “Ron DeSantis will continue to deny, refute, call your reporting a witch hunt. I can only hope that you continue to investigate and expose the truth.”\nAlfonsi: “But many more comments condemned our editing and reporting.”\nReading a letter from Amy Ernest of Houston, Texas: “Shameful biased reporting – that is what you are guilty of. You are no longer journalists, but lobbyists and advocates.”\nAlfonsi: “Then there was this:”\nAlfonsi reading a letter from David Plewes of Lighthouse Point, Florida: “I have watched 60 Minutes for decades. After your biased piece on Governor DeSantis, I will only watch it one more time. Just to see if you broadcast this message.\"\nAlfonsi: “I’m Sharyn Alfonsi. We’ll be back next week with another edition of 60 Minutes.”\nMedia Research Center Vice President Brent Baker explains our weekly pick: “A very prominent example of how the news media refuse to hold themselves accountable which provides more fresh evidence for why anyone right of center has no reason to ever trust journalists to be fair to a conservative elected official. After a week in which Democrats, and even liberal media observers, condemned 60 Minutes for a distorted story, the show failed to admit its misdeeds or retract the story. Instead, they dug in, downgrading accountability to reading a few random viewer comments.”\nRating: FIVE out of FIVE screams.\n■ April 5: Liberal Media Scream: PBS’s Yamiche Alcindor connects Georgia voting to George Floyd trial\n(Washington Examiner post)\nThis week’s Liberal Media Scream shows the lockstep reactionaryism to Georgia’s new election reform law that actually expands some voting protections — but is apparently too difficult for critics to read.\nThe list of those blasting it as racist is long, but we feature PBS’s Yamiche Alcindor because she took it another step and tied it to the murder trial of former Minneapolis police officer Derek Chauvin, who has been charged in the death of George Floyd.\n“Watching this [Chauvin] trial and watching what’s going on in Georgia, they absolutely connect,” she said during Meet the Press on Sunday.\nThe Georgia law has divided partisans, especially corporate America’s reaction, including MLB’s decision last week to move the annual All-Star Game out of Atlanta in protest. At the same time, some news outlets have started to study the new law more and found less to complain about while noting that several other states have much stricter election rules.\nFrom the show:\nYamiche Alcindor: “Well, the Chauvin trial, and that murder trial in the death of George Floyd, is connected to voting rights because, at the end of the day, it’s about how African Americans and whether African Americans are allowed to survive and thrive in America and are able to have access to the principles that America holds up as near and dear. And that, of course, is democracy. But it’s also your ability to pursue happiness and to not have an officer kneel on your neck for nine minutes and 29 seconds. Watching this trial and watching what’s going on in Georgia, they absolutely connect.”\nMedia Research Center Vice President Brent Baker explains our weekly pick: “Alcindor displayed the all too typical attitude of journalists who don’t see anything wrong with presuming advocates of making voting more secure are no different than enforcers of ‘Jim Crow’ or, as she charged, are opposed to letting African Americans ‘survive’ in America. Linking Georgia, which actually expanded voting access in several ways, to a murder trial is an outrage and shows Alcindor is more a far-left political advocate, who stirs up racial animosities to advance a cause, than any kind of dispassionate journalist.”\nRating: FIVE out of FIVE screams.\n■ March 29: Liberal Media Scream: ‘Sad but true,’ Joy Reid agrees GOP would make Jesus suffer\n(Washington Examiner post)\nThis week’s Liberal Media Scream has an Easter and election angle, but it’s not very uplifting.\nIt features a famous Georgetown University professor condemning GOP election reform efforts in states such as Georgia and suggesting that the party is so racist and mean it would “pass a law to keep Jesus from getting a cup of water while he's dying on the cross.”\nAnd, of course, it led to Joy Reid, host of her show The ReidOut, agreeing with Professor Michael Eric Dyson.\nThe comments came while the nation is in a heated debate over election reform, with the GOP heading to tightening ballot access and Democrats moving to open it up to a national mail-in system.\nReid’s show focused on condemning the GOP, and Dyson said Republican efforts like those in Georgia are going further than old segregationist Jim Crow laws. “The real religion, the real politics in America is whiteness and whiteness unhinged,” he said.\nDyson on the Friday edition of The ReidOut:\n“I mean, President Biden is right. This is Jim Crow, this is Jane Crow ...The real religion, the real politics in America, is whiteness and whiteness unhinged ... I think he’s contemplating it seriously when he sees the consequences. What he needs to do is fill these busters with some fear of the government. These are the kind of people who would pass a law to keep Jesus from getting a cup of water while he's dying on the cross.”\nReid agreed: “Sad but true.”\nMedia Research Center Vice President Brent Baker explains our weekly pick: “A cute-sounding quip but with a hard edge just before Palm Sunday as MSNBC decided to showcase Dyson, a man who always sees racial animus motivating conservatives. It’s all part of the far-left/news media joint effort to smear as racist anyone interested in keeping the voting system honest, thus discrediting their concerns without having to address their substance.”\nRating: FOUR out of FIVE screams.\n■ March 22: Liberal Media Scream: Seth Meyers rants against rural whites, Constitution\n(Washington Examiner post)\nThis week’s Liberal Media Scream steps outside the usual lane of angry news media figures to NBC’s Late Night show hosted by Seth Meyers and his 15-minute rant for H.R. 1, the “For the People Act” election law, and against the filibuster.\nHis was a sweeping condemnation of Republicans, rural Americans, whites, and the Founding Fathers.\nHe opened Thursday by charging that the electoral system is “heavily tilted toward a minority of voters that are predominately white and rural, thanks in large part to anti-majoritarian institutions like the Electoral College and the Senate.” He cited new Georgia Sen. Raphael Warnock’s “impassioned speech in favor of sweeping voting reforms” and accused Republicans of pushing Jim Crow-style election changes.\n“Republicans tried to steal the last election through the courts. That didn’t work, so now they’re trying to steal the next election through voter suppression. Nuking or changing the filibuster to stop them is a moral necessity,” he urged in his “Closer Look” segment:\nSome of the lowlights:\n“Our democracy as currently constituted is simply not a level playing field. In fact, it’s arguably never been a level playing field, it’s heavily tilted toward a minority of voters that are predominately white and rural, thanks in large part to anti-majoritarian institutions like the Electoral College and the Senate. Just consider that right now the Senate is evenly split 50-50 and yet the 50 Senate Democrats represent nearly 42 million more Americans than the 50 Senate Republicans. For example, Wyoming with a population of about 580,000 people, has two senators. And New York also has two senators, even though there are 580,000 people just on my co-op board. ...\n“I mean, just consider the scope of how heavily tilted our democratic institutions are toward Republicans. They’ve only won the popular vote once in the last 32 years, yet, they’ve appointed a majority of Supreme Court justices, they’ve lost the popular vote by nearly 3 million. In 2016, lost the House by the largest margin since Watergate in 2018, lost two Senate seats in historically red Georgia this year, and yet, Mitch McConnell still basically gets a veto over what the Senate can or cannot pass. The only way the Senate can get anything done right now is through a process called budget reconciliation, which has more rules than a Manhattan parking sign. ...\n“Warnock delivered an impassioned speech in favor of sweeping voting reforms, and he noted that the GOP assault on voting rights is the most ferocious attack on democracy since the era of Jim Crow.”\n[Sen. Raphael Warnock: “We are witnessing right now a massive and unabashed assault on voting rights, unlike anything we’ve ever seen since the Jim Crow era. This is Jim Crow in new clothes.”]\n“He’s right. And the clothes aren’t even good. I mean, look at this [picture of Trump], it looks like he was thrown naked in the dumpster behind a Palm Beach pro-shop, and given five minutes to pick an outfit. It’s a good Halloween costume if you want to go as a lost grandpa at Disney World. Warnock was on the floor specifically to call for Senate passage of H.R. 1, a sweeping package of urgent voting reforms passed by the House that are desperately needed to level what is currently a very lopsided playing field. H.R. 1 would combat virtually every GOP voter suppression tactic by, among other things, mandating nationwide early voting and no-excuse mail voting, instituting automatic and same-day voter registration, implementing public financing of elections, and banning congressional gerrymandering, among other things. It’s also incredibly popular in polls, even among the majority of Republican voters. So, naturally, Republican politicians are losing their minds over it. ...\n“Republicans tried to steal the last election through the courts. That didn’t work, so now they’re trying to steal the next election through voter suppression. Nuking or changing the filibuster to stop them is a moral necessity. We badly need sweeping reforms to make our democracy a level playing field.”\nMedia Research Center Vice President Brent Baker explains our weekly pick: “Meyers’s argument should be with the founders, not present-day Republicans. He’s upset that our constitutional system, with two senators from every state, is inhibiting the enactment of left-wing policies, as if the Senate make-up is something new. He’s upset by Wyoming but ignores how the next least-populous state, Vermont, has a socialist and a left-wing Democrat for senators. H.R. 1 should be known as the ‘Enable Illegal Voting Act,’ as it’s a grab-bag of left-wing policies aimed at making it easy for Democrats to get votes from those not qualified to vote. The fact Meyers is so excited about it demonstrates he’s a left-wing Democratic activist first, a comedian a distant second.”\nRating: FOUR out of FIVE screams.\n■ March 15: Liberal Media Scream: Meet the Press blames Trump for Cuomo refusing to quit\n(Washington Examiner post)\nThis week’s Liberal Media Scream features the latest version of “Trump Derangement Syndrome,” this time on NBC’s Meet the Press.\nDiscussing embattled New York Gov. Andrew Cuomo’s refusal to step down over a couple of scandals, the tag team of host Chuck Todd and guest John Heilemann blamed Trump, suggesting that he set the “precedent” for refusing to quit when pressed by critics.\n“He’s following what is seen now as the Trump precedent,” said Heilemann of Cuomo.\nTodd turned on conservatives, calling them “excited about Cuomo’s downfall” when it’s been Democrats at the highest levels calling the liberal governor to quit over COVID-19 and sex scandals.\nFrom the roundtable on Sunday’s Meet the Press:\nJohn Heilemann: “I think, you know, that the other thing that’s true is Cuomo is totally dug in. I think the likelihood of Cuomo resigning is close to zero. And I think, you know, he is following right now — uncomfortably for a lot of Democrats — he’s following what is seen now as the Trump precedent. You know, if you are determined enough, you are shameless enough, you can hold on.\n“And so the question then just becomes: Does he actually get impeached, does he actually get thrown out? And I think that’s going to be — a large question around that is going to be what additional evidence comes out over the coming — maybe enough now, but there’s going to be a large question of what else unfolds over the next couple weeks.”\nChuck Todd: “It does feel like he’s forcing that. I’m glad you brought up Trump there a minute, John. Lanhee [Chen], I want you to respond on something Tim Miller wrote in the Bulwark. He said, ‘Dunking on Cuomo’s demise requires admitting that the other party has standards and lays bare, once again, the cravenness of the excuse-making for Trump that kept the lights on for the past five years.’ There’s a lot of conservative media, acolytes, and propagandists that are very excited about Cuomo’s downfall, but they seem to not be very self-reflective.”\nMedia Research Center Vice President Brent Baker explains our weekly pick: “Trump Derangement Syndrome lives on, especially with those in the media still upset Trump’s personal foibles didn’t undermine support amongst his fans. Heilemann and Todd can’t get over their contempt for Trump and so still want to scold his supporters for hypocrisy without seeing any in themselves in cueing up a ‘Trump precedent’ to rationalize misbehavior by a liberal Democrat.”\nScream rating: THREE out of FIVE Screams.\n■ March 8: Liberal Media Scream: CNN anchor says Republicans don’t feel ‘pain’ of people\n(Washington Examiner post)\nThis week’s Liberal Media Scream takes a look at the overnight bias on CNN, and it’s a doozy.\nAccording to CNN overnight anchor Rosemary Church, Republicans are callous and heartless and can’t feel the pain of those they represent. It reminded us of when they used to call CNN the “Clinton News Network” for its supportive coverage of the president who famously said in his 1992 campaign, \"I feel your pain.\"\nThe comments came after Senate Republicans balked at approving the $1.9 trillion COVID-19 spending bill that the GOP said spends very little on immediate coronavirus issues.\nInterviewing Ron Brownstein of the Atlantic, Church saw urgency in advancing the Biden agenda.\nThe first two questions to Brownstein from the Atlanta-based anchor for CNN International in the 3 a.m. hour of CNN Newsroom Live simulcast on the domestic side:\n“So President Biden’s COVID relief package cleared the Senate without any Republican support Saturday. Now it’s heading back to the House for a vote Tuesday. How likely is it that it will pass this week? And how imperative is it that this gets done and done fast?”\n“How does all of this look for Republicans who didn’t get on board with helping people? They don’t feel much of the pain that other Americans are feeling during this pandemic, so they can’t begin to understand what people are going through. How much of a barrier is that disconnect for a party already struggling with its own identity?”\nMedia Research Center Vice President Brent Baker explains our weekly pick: “Church perfectly encapsulates the presumptions of so many journalists who assume it’s beyond dispute that anyone who opposes a massive new spending bill is an out-of-touch and uncaring lout, that anyone who disagrees with their outlook has crass motives not worthy of consideration. It’s the kind of embedded bias which infuriates everyone right of center, but cannot be recognized by journalists like Church who are blind to their own bias.”\nScream rating: FOUR out of FIVE Screams.\n■ March 1: Liberal Media Scream: MSNBC’s Ali Velshi says racism defines America\n(Washington Examiner post)\nThis week’s Liberal Media Scream features MSNBC host Ali Velshi condemning America as racist forever.\n“Racism is something that has defined the United States since its very founding,” said the Kenyan-born former Canadian journalist on his show Velshi.\nHis comments came in introducing author Heather McGhee on to talk about her book on racism. In his intro, he said American whites are so racist that they will hurt their own economic future to stop blacks.\nMcGhee, author of The Sum of Us: What Racism Costs Everyone and How We Can Prosper Together, agreed and offered Obamacare as an example of whites being racially driven to oppose a helpful program because it was proposed by a black president.\nFrom Saturday morning’s Velshi on MSNBC:\nAli Velshi: “Racism is something that has defined the United States since its very founding. In fact, it infects nearly all facets of American life, like healthcare, about which we just heard. But it also affects our politics and our economics. The false belief that progress and prosperity for people of color comes at the expense of white people has helped prop up racist systems for generations. This zero-sum theory is what author Heather McGhee tackles in her new book, 'The Sum of Us: What Racism Costs Everyone and How We Can Prosper Together.' In it, she examines the self-destructive bargain of white supremacy and how much we’ve lost economically as a country due to racism in terms of a dollar amount.\n“One of the things that appeals to me about your book is the discussion that you have about how people, often white people or people who have power and privilege in society, often make decisions that are not in their economic interests or work against their own prosperity because they feel like giving other people, in this case, black people, certain rights and privileges will take away some of their own.”\nHeather McGhee: “That’s exactly right. I mean, to stay on the issue of healthcare, which you've covered so well, Ali, you know, white people are actually the largest group of the uninsured, and yet, ever since the Affordable Care Act was signed by our first black president, the majority of white people have disapproved of the pretty modest idea that is Obamacare, and there’s a huge correlation between racial resentment against black people and the southern, in most cases, states and also Maine, which is the whitest state in the nation, refusal to expand Medicaid under Obamacare. So it’s this idea that government is on the side of people of color, and that is why there’s such a fierce anti-government skepticism and suspicion among the majority of white voters — the majority of white voters who have voted for the Republican Party for president, I’ll remind you, ever since Lyndon Johnson signed the Civil Rights Act.”\nMedia Research Center Vice President Brent Baker explains our weekly pick: “As people obsessed by race, Velshi and McGhee lack self-awareness in attributing racism to those with a different point of view. It’s impossible to have a rational policy discussion when so many liberals in the media hurl racism accusations at all those of one race who don’t buy into the liberal agenda, as if they cannot have a logical reason for opposing the policy other than their presumed racism. It’s very destructive politics.”\nRating: FOUR out of FIVE screams.\n■ February 22: Liberal Media Scream: Liberals rush to dump on Rush Limbaugh\n(Washington Examiner post)\nThis week’s Liberal Media Scream takes note of the death of conservative talk radio icon Rush Limbaugh, who influenced many and even pushed some, notably former Vice President Mike Pence, to jump into politics.\nFriends and allies were effusive in their praise.\nSo too was the hate from his foes, too many to list here. But as an example, we feature former New York Times media reporter Bill Carter who disparaged Florida’s plans to honor the long-time resident.\nAppearing on CNN’s Reliable Sources, Carter, now a “media analyst” for CNN, contended Limbaugh didn’t deserve the attention given him by Gov. Ron DeSantis, who plans to lower the state flag.\nAfter host Brian Stelter asked him about the plan by DeSantis, Carter said:\n“Well, it’s kind of shocking because, I mean, first of all, you know the governor of Florida is just playing for conservative attention in doing that. But the justification is really questionable.\n\"I mean, look, Limbaugh had a huge following, and it was very popular among, you know, a group of right-wing listeners. But he wasn’t a heroic figure. I mean, he had a lot of incidents that were extremely questionable, and his views were pretty ugly, and they hurt a lot of people. They hurt some people personally.\n“And I think – you know, there were an awful lot of people who are justifiably saying why are you celebrating a guy who attacked Barack Obama on race, who sang ‘Barack the Magic Negro’ and all kinds of extremely outrageous things that, frankly, the conservatives loved. They loved him for that. And he established the brand. He did. That was a brand. But to make it a heroic thing or something that should be celebrated like, you know, a war hero, I find that pretty questionable.”\nMedia Research Center Vice President Brent Baker explains our weekly pick: “Pretty standard liberal ‘conventional wisdom’ here from Carter, and that’s the disappointment. You’d hope a reporter with a career covering the media could rise above just passing along liberal bromides and, at least in the days after his passing, would offer something positive about a man who earned the loyalty of millions for more than thirty years and inspired generations of Americans about the benefits of conservative policy solutions.”\nRating: 3 out of 5 SCREAMS.\n■ February 15: Liberal Media Scream: CNN’s Don Lemon goes there and blames ‘horrible Reagan’\n(Washington Examiner post)\nThis week’s Liberal Media Scream features ranting CNN host Don Lemon tying everything he doesn’t like to one of the most popular presidents in United States history: Ronald Reagan.\n“Reagan was horrible,” said Lemon, who suggested that the Republican's two-term presidency paved the way for the Capitol riots.\nShouting over fellow CNN host Chris Cuomo, Lemon said Republicans are also bad for respecting Reagan.\n“They hold him up to a gold standard. When you look at what he actually accomplished, he didn’t,” he said.\nFrom the Thursday, Feb. 11 CNN Tonight, during the handoff from Chris Cuomo’s 9 p.m. show to Lemon’s 10 p.m. show:\nCHRIS CUOMO: Reagan and Bush Republicans were nothing like these guys.\nDON LEMON: I don’t know about that.\nCUOMO: Just the issue of immigration. Look at how Reagan and George W. Bush, George H.W. Bush talked about immigration.\nLEMON: Reagan was the first presidential election that I voted in. And listen, ... I’m just saying that people hold him up to be — Reagan was not perfect. Reagan was horrible when it came to—\nCUOMO: Perfect? He gave us one of the biggest deficits we’ve ever seen, and he absolutely fed the divide.\nLEMON: That's what I mean. They always hold him up as a gold standard. But when you look at what he actually accomplished, he didn’t. He was horrible when it came to racial issues. He was horrible when it came to the AIDS crisis. He was horrible when it came to uniting the country. He didn’t unite the country — he was a divider. And so they hold him up as a gold standard. ... I just think it’s degrees, but I think the Republican Party has been moving in this direction forever.\nAgain, they are the party of everything that they’re trying to pretend that they’re not. Now saying, \"The people in the Capitol, that’s not us.\" Yes, it is you! \"The people that were in Charlottesville, that’s not us.\" Yes, it is you! Those people are not marching for Democrats. And this whole weird thing that they keep saying, \"What about the riots and the demonstration that happened this summer?\" That’s apples and oranges. First of all, the demonstrations, the protests were for something that’s real. It was for inequality. It was for police brutality. It was for all those things. It was people who were rising up for their rights. What happened at the Capitol was built on a lie.\nMedia Research Center Vice President for Research and Publications Brent Baker explains our weekly pick: “Such disdain for the late former president, who is a hero to conservatives and an inspiration to many oppressed by communism around the world, shows the baselessness of the widespread media line that they had to be hostile to Donald Trump because he posed a new kind of dangerous and racist threat to democracy and all that is good about the United States. If Lemon had a CNN show in the 1980s he would have been just as hostile to Reagan, calling him a racist night after night, as he was and is to Trump. Conservative presidents come and go, but the media contempt for them never wavers.”\nRating: 4 out of 5 SCREAMS.\n■ February 8: Liberal Media Scream: Reporter decries ‘ex-boyfriend...abuse’ from Team Trump\n(Washington Examiner post)\nThis week’s Liberal Media Scream had a lot of choices from reporters never happier than to have a new administration that thinks like they do to report on.\nBut only one expressed the relief she felt in getting to cover the Democratic Biden administration after the “bad ex-boyfriend” abuse she felt dealing with Team Trump.\nOn CNN on Sunday, Yahoo News White House correspondent Brittany Shepherd came down hard on former Trump press secretary Kayleigh McEnany. She compared McEnany's White House briefings to “having a really bad ex-boyfriend. We were getting essentially abused by Kayleigh for so long.”\nAnd worse, she charged that McEnany incited people to “go to deadly ends for some people with death threats.”\nBut now, with spokeswoman Jen Psaki, “It’s very refreshing.”\nShepherd on CNN’s Reliable Sources:\n“It’s been really refreshing to have briefings every day and to even know who the senior officials talking to Biden are. We were not getting that in any of the Trump years, especially in those waning days of the McEnany briefings.\n“And it is refreshing, I do kind of put it towards like having a really bad ex-boyfriend. We were getting essentially abused by Kayleigh for so long, or at least she was calling us fake news and inciting her followers and followers of the president to not only harass us online but obviously go to deadly ends for some people with death threats.\n“Now, we have Jen and the entire Biden team. It’s very refreshing. But it’s important to remember that the bar has literally been left on the floor, and just being able to show up and clear it isn’t enough.”\nMedia Research Center Vice President Brent Baker explains our weekly pick: “Shepherd exemplifies the hostility the White House press corps had toward Kayleigh McEnany and all things Trump, combined with their eager embrace of the new administration, quick to hail Biden’s press team as ‘very refreshing.’ It’s as if Shepherd just got a job transfer from an office full of people she finds disreputable to a new office full of people who inspire her.”\nRating: 3 out of 5 SCREAMS.\n■ February 1: Liberal Media Scream: New high in CNN bias, blames GOP for ‘divided America’\n(Washington Examiner post)\nThis week’s Liberal Media Scream features a new high in the anti-GOP bias shown by CNN, this time blaming the political divide on the Tea Party, Sarah Palin, Roger Ailes, Fox News, former House Speaker Newt Gingrich, and, of course, former President Donald Trump.\nOver one hour last night, Fareed Zakaria pointed a big finger at the GOP in his special, The Divided States of America: What Is Tearing Us Apart? Over and over, the answer was boiled down to Republicans. And if that wasn’t enough, Republicans were sometimes described as racists.\nZakaria said, “When scholars spent time with Tea Party activists, they found that behind the talk of taxes and big government were people mostly motivated by fears about race and immigration.”\nHe moved on to how Ailes “turned his channel into a right-wing bull horn, blurring facts and opinion like never before.”\nHe added, “Trump had a role model for his exploitation of the class divide: Sarah Palin, who did it first.”\nHis final target was Gingrich: “Before there was a Donald Trump, there was a Republican pioneer who paved the way for the Trump brand of destructive politics. ... His legacy has been both dark and far-reaching — a permanent state of war between the parties.”\nSome excerpts from CNN’s The Divided States of America: What is Tearing Us Apart? which aired Sunday night, Jan. 31:\nFAREED ZAKARIA: When scholars spent time with Tea Party activists, they found behind the talk of taxes and big government were people mostly motivated by fears about race and immigration.\nJON MEACHAM: The people who have been most radicalized by the Trump years believed that diversity was an idea, not a vivid reality.\nZAKARIA: In 1950, the year our political parties were said to be too similar, the country was about 90% white. Now in 2021, as we face an existential crisis of political division, America is about 59% white.\nMEACHAM: We are living in the most vivid manifestation of the politics of fear in our history. That’s where we are now.\n...\nZAKARIA: Ailes became the go-to right-wing media strategist of the 1980s, infamous for his vicious attacks.\nTV AD NARRATOR: As Gov. Michael Dukakis gave weekend furloughs to first-degree murderers.\nZAKARIA: In 1996, Ailes found his destiny when billionaire Rupert Murdoch came calling. The right wing's favorite hatchet man was now creating a new news network. The old, mainstream media cartel had splintered.\nBRIT HUME, IN OLD FNC PROMO: These days, people think TV news is about as unbiased as the commercials.\nZAKARIA: On cable, every channel needed to find its own slice of the audience. Ailes turned his channel into a right-wing bull horn, blurring facts and opinion like never before. Big ratings and profits soon followed.\n...\nZAKARIA: Donald Trump had a role model for his exploitation of the class divide: Sarah Palin, who did it first. When America’s hockey mom became John McCain’s running mate in 2008 —\nSARAH PALIN, FORMER REPUBLICAN ALASKA GOVERNOR: They say the difference between a hockey mom and a pit bull: lipstick.\nZAKARIA: She leaned heavily on identity politics, on American values and culture, to rile up her base.\nPALIN: I’m not a member of the permanent political establishment.\nZAKARIA: Her brand of America, talking about the real America, saying, 'I’m one of you,' was the precursor of Trump’s war on elites.\nGEORGE PACKER: Sarah Palin, who I think of as John the Baptist to Trump, she was the one who came first.\nDONALD TRUMP: Governor Sarah Palin.\n...\nZAKARIA: But before there was a Donald Trump, there was a Republican pioneer who paved the way for the Trump brand of destructive politics.\nNEWT GINGRICH, FORMER REPUBLICAN HOUSE SPEAKER: I am a genuine revolutionary. They are the genuine reactionaries. We are going to change their world.\nZAKARIA: This is the story of Newt Gingrich, the man who wrote the playbook for the modern conservative movement. ... It was a very different time in politics when civility and compromise mattered. House Republican Leader Bob Michael was widely known as Mr. Nice Guy. Imagine that.\nVAN JONES: Newt Gingrich comes in with a buzz saw.\nGINGRICH: What we are living through is a fundamental civil struggle, a civil war fought in public speeches rather than with armies.\nZAKARIA: The Gingrich philosophy: The only way for Republicans to win back power was to be nasty — really nasty.\nGINGRICH: For the Democrats to basically say not only are we going to rape you but you have to pay for the hotel room is a bit much.\nZAKARIA: To treat Democrats not as opponents but the enemy. ... His legacy has been both dark and far-reaching — a permanent state of war between the parties.\nMedia Research Center Vice President Brent Baker explains our weekly pick: “Quite a pretentious feat by CNN and Zakaria in managing to blame all of the nation’s ills on the tone of the rhetoric from conservative political figures, as if liberals are blameless for political divisiveness. By choosing to blame only one side, CNN and Zakaria are exacerbating the very problem they claim to be trying to diagnose.”\nRating: 5 out of 5 SCREAMS.\n■ January 25: Liberal Media Scream: Nuremberg trial for Trump?\n(Washington Examiner post)\nYou would think they would be happy to move on, but this week’s Liberal Media Scream features an ABC News analyst calling for the second impeachment trial in the Senate of former President Donald Trump to be more of a truth and accountability commission process.\n“To me, the impeachment — we have to separate the parts of the impeachment vote. I mean, other countries have gone through this before, Germany, Japan, South Africa, and the thing before you get to reconciliation and healing, you have to have some element of truth and accountability in this,” said Matthew Dowd.\nWhat happened in those countries? South Africa set up the Truth and Reconciliation Commission after the end of apartheid, Japan had the Tokyo War Crimes Tribunal after World War II, and Germany had the Nuremberg trials.\nIn calling for a Trump truth tribunal, Dowd suggested that without one, the United States could be in for a century of political trouble that he compared to racism.\nDowd during the roundtable on Sunday’s This Week on ABC:\n“Well, to me, the impeachment — we have to separate the parts of the impeachment vote. I mean, other countries have gone through this before, Germany, Japan, South Africa, and the thing before you get to reconciliation and healing, you have to have some element of truth and accountability in this.\n“And even besides those foreign country examples, we have an example in our country during Reconstruction in the aftermath of the Civil War when we went through — we were supposed to go through a process of truth and accountability and changing the nature of what went on. And when Abraham Lincoln was killed and Andrew Johnson took over, reconciling — I mean, the idea of forming a thing and demanding truth was stopped. And what did they result in, George? It resulted in this country of Jim Crow laws, it resulted in this country of the KKK, and it resulted in this country of 100 years more of a fight for justice and truth and equality in our country.\n“And so, we have to get to a situation where, yes, let’s have a discussion of what was the truth, what did Donald Trump do, what should be his accountability, and the final stage of that is: What should be his punishment?\n“And to me, the only way to do that is to have a conversation in the trial in the Senate where facts and knowledge and data and information is presented in such a way that the American public can see exactly what went on, what was Donald Trump responsible for, what should he held accountable to. And then, ultimately, what should his punishment be?\n“But we should not do what happened in Reconstruction. When Reconstruction was ended and we went through this huge, long, centurylong process when justice finally prevailed in the end. We have to have an insight into the truth before we get to reconciliation and healing.”\nMedia Research Center Vice President Brent Baker explains our weekly pick: “To say anything Donald Trump has done is on par with genocidal regimes, or that he has left the nation in a condition anywhere similar to a segregated, race-based two-class system like the America in the decades after the Civil War, is just ridiculous. The other panelists should have laughed at him. Dowd needs his own accountability session to separate reality from his overwrought historic comparisons.”\nRating: 4 out of 5 SCREAMS.\n■ January 18, 2021: Liberal Media Scream: Call to silence conservatives and kick OANN and Newsmax off air\n(Washington Examiner post)\nThis week’s Liberal Media Scream features CNN providing a platform for a call to take competitors OANN and Newsmax off the air and to also rob conservative influencers of social media outlets.\nOn the heels of Big Tech kicking the conservative chat site Parler and firearms site AR15.com offline, the former head of security for Facebook and Yahoo said taking platforms away from conservatives is the result of the election and protests at the U.S. Capitol.\nAlex Stamos said, we “have to turn down the capability of these conservative influencers to reach these huge audiences” on Facebook and YouTube.\n“Then we’re going to have to figure out the OANN and Newsmax problem,” urging they be removed from cable systems. “These companies have freedom of speech, but I’m not sure we need Verizon, AT&T, Comcast, and such to be bringing them into tens of millions of homes.”\nStamos, on Sunday’s Reliable Sources, where he appeared with Krebs Stamos Group partner Christopher Krebs, the Trump administration’s former director of the Cybersecurity and Infrastructure Security Agency:\n“First, you have to focus on the violent extremists, and those companies have to be brave in that way. And, second, we have to turn down the capability of these conservative influencers to reach these huge audiences. There are people on YouTube, for example, that have a larger daytime — larger audience than daytime CNN, and they are extremely radical and pushing extremely radical views.\"\n“And, so, it’s up to the Facebooks and YouTubes, in particular, to think about whether or not they want to be effectively cable networks for disinformation. And then we’re going to have to figure out the OANN and Newsmax problem, you know, these companies have freedom of speech, but I’m not sure we need Verizon, AT&T, Comcast, and such to be bringing them into tens of millions of homes. This is, you know, allowing people to seek out information if they really want to, but not pushing it into their faces, I think is where we’re going to have to go here.”\nMedia Research Center Vice President Brent Baker explains our weekly pick: “A very solid signal Big Tech’s agenda goes beyond what they want to portray as benign efforts to shut down those advocating violence. Stamos laid out the next step: Use current concerns to justify a wider suppression of conservative voices who have allowed space for views those on the Left find appalling. The answer is more free speech, not letting a small group of wealthy Silicon Valley tech leaders abuse their power to serve as ‘speech police,’ deciding which views are OK or not with the elite at the moment.”\nRating: 4 out of 5 SCREAMS.\n■ January 11, 2021: Liberal Media Scream: CNN wants conservative media squelched in ‘national emergency’\n(Washington Examiner post)\nThis week’s Liberal Media Scream features CNN’s senior media reporter demanding the targeting of conservative media outlets who ignored their anti-Trump bias in reporting on the president and his administration.\nOn Sunday’s Reliable Sources, Oliver Darcy demanded conservative news sources be “held accountable,” clearly suggesting that they must be squelched, an expansion of the so-called “cancel culture” imposed with glee by outlets such as Twitter and Facebook on conservatives and even President Trump.\nHe cited Fox News and “TV providers that beam OAN and Newsmax into homes, or Rush Limbaugh. There are a lot of people profiting off of lies and conspiracy theories.”\nHe insisted, “this informational environment” must be “cleaned up.”\nDarcy, at the end of Sunday’s Reliable Sources:\n“The story this week was bringing our informational crisis to the forefront. It’s a national emergency. You have corporations and people that are profiting off lies and conspiracy theories, whether that’s big tech, whether that’s Fox News, whether that’s TV providers that beam OAN and Newsmax into homes, or Rush Limbaugh. There are a lot of people profiting off of lies and conspiracy theories, and I don’t really see how things get better, how we move on as a country until this informational environment is cleaned up.”\nAfter host Brian Stelter complained that “Fox News, the Murdochs, they are still enabling this stuff because they’re obsessing over big tech bias, that’s what they call it, and trying to ignore the riot,” Darcy demanded:\n“Where are they? They need to be held accountable as well. We were talking a lot about people like Josh Hawley and Ted Cruz. Rupert Murdoch, Lachlan Murdoch, they need to be held accountable for the lies that they have peddled to this country, not only in the past two months about the election either, but in the past, you know, several years that have really brought this to the forefront.”\nMedia Research Center Vice President Brent Baker explains our weekly pick: “Darcy revealed the true agenda the hard left inside CNN: Selectively cite the baseless allegations of a few on one side of the political spectrum to justify shutting down all the major outlets which allow conservative views to get an airing, silencing those with which Darcy disagrees, thus allowing the public to only hear left wing views. A perfect example of ‘cancel culture.’”\nRating: 4 out of 5 SCREAMS.\n■ January 4, 2021: Liberal Media Scream: Smug Chuck Todd to senator, ‘I’ve Had Enough of Hearing This!’\n(Washington Examiner post)\nThis week’s Liberal Media Scream features NBC’s Chuck Todd, who put on his most dismissive smirk Sunday to mock Republican Sen. Ron Johnson’s defense of President Trump’s claims of election fraud.\nIt came on Todd’s show, Meet the Press, and despite talking over Johnson, a matter-of-fact lawmaker/businessman, the senator stood his ground and told the host after being badgered, “You have destroyed the credibility of the news media by your bias.”\nWhen Johnson pointed out, “This fire was started when you completely ignored, for example, our investigation of Hunter Biden,” Todd jumped in: “Senator. All right, I’ve had enough of hearing this!”\nDuring the heated, multi-minute exchange, Todd turned to ridicule when Johnson discussed investigating Trump’s allegations of voter fraud. “Why didn’t you hold hearings about the 9/11 truthers? There’s plenty of people who thought 9/11 was an inside job.” And: “How about the Moon landing? Are you going to hold hearings on that?”\nFrom the Sunday, Jan. 3, Meet the Press:\nSEN. RON JOHNSON: Chuck, this fire was started back in, you know, January of 2017. People like Mark Zaid in his tweet, ‘The coup has started. First of many steps. Rebellion and impeachment to follow ultimately.’ This was started when the mainstream media stopped, dropped any pretense of being unbiased and actually chose sides during this election. This fire was started when you completely ignored, for example, our investigation of Hunter Biden. You know, no evidence of wrongdoing there. And now we find out after the election, no, there is a fair amount of evidence to the point that we have a real FBI investigation. So-\nCHUCK TODD: Senator. All right, I’ve had enough of hearing this!\nJOHNSON: No, listen. I’ve had enough of this, too. It’s the bias of the media.\nTODD: No, senator. It is, you have spent, you have spent the last two years —\nJOHNSON: It’s the bias in the media that has created a situation where Republicans and conservatives do not trust the mainstream media. And that is what, that is what has destroyed the credibility of the media and our institutions and really —\nTODD: Right, no, the destruction of the institutions —\nJOHNSON: — shaken confidence in this election result. So I didn’t start this ... I didn’t, I didn’t light this fire. This fire was lit over four years ago. And we’ve destroyed the credibility, you have destroyed the credibility of the news media by your bias. And of course people like James Comey, Andrew McCabe, John Brennan destroyed the credibility of the FBI and our justice system as well. We have an enormous problem in this country. It’s unsustainable. And the only way you solve it is with information, and transparency, and hearings, and investigations. It’s not quackery, it’s not conspiracy theory. It’s what’s going to be required.\nTODD: Let me ask you this. Then why didn’t you hold hearings about the 9/11 truthers? There’s plenty of people who thought 9/11 was an inside job. So you’re basically saying is if there’s enough people who believe a conspiracy theory, if there’s enough people who hold, how about the Moon landing? Are you going to hold hearings on that?\nJOHNSON: There are all kinds of things that I’d like to hold hearings on. You have to kind of pick and choose based on priorities. Right now, we have this election. We’ve got tens of millions of Americans that think this election was stolen. We need to get the bottom of it. Again, what’s explained, we need to explain it, get that off the table. We also have to acknowledge there were some real problems here. There’s some issues that need to be explored and investigated.\nTODD: You’ve got to ask yourself when you tell people a million times that something was stolen or something was fraud and then they believe it, I think you need to look in the mirror and ask yourself why so many people believed it.\nJOHNSON: Well, Chuck, you need to look at your mirror because you carried the Democrats’ water on the whole Russian collusion with the Trump campaign hoax —\nTODD: Sen. Johnson, I’ve got to go. I appreciate you coming on. I’ve let you, I’ve let you say plenty of —\nJOHNSON: That is what you did in the media. You carried that water for years. You destroyed the credibility of the press, not me.\nTODD: Sen. Johnson, other than, other than crediting you for coming on, I appreciate that because only two of your colleagues had the guts to say yes this weekend about this conspiracy theory that you’re working on.\nMedia Research Center Vice President Brent Baker explains our weekly pick: “Todd couldn’t have been more smug and sanctimonious toward a guest as he used his platform to discredit and ridicule a U.S. senator with whom he disagrees. Quite an egregious abuse of Todd’s journalistic role, especially since it’s very hard to imagine him ever showing such disdain toward a liberal guest, and one more example of why Trump supporters don’t trust the ‘mainstream media.’”\nRating: 5 out of 5 SCREAMS.\n> Liberal Media Scream posts for 2020.\n> For all of 2018.\n> For July through December 2017.\n> For January through June 2017.\n> For July through December 2016.\n> For January through June 2016.\n> For July to December 2015.",
  "word_count": 46753,
  "scraped_at": "2026-02-14T13:35:07.594100"
}