{
  "article_id": "c863730609c2",
  "url": "https://www.miragenews.com/australian-government-invests-millions-in-1251545/",
  "title": "Australian Government Invests Millions In Netball World Cup",
  "date": "20240607T030000Z",
  "domain": "miragenews.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "The Albanese Government is helping our record breaking Diamonds strive for 2027 Netball World Cup glory with a $6 million investment.\nThe World Cup funding, part of the May budget, strengthens our government's investment in women's sport and reinforces our commitment to the green and gold runway ahead of Brisbane 2032.\nThe 2027 World Cup in Australia will be part of the celebration of 100 years of Netball in this country and our investment will be a significant contribution to event delivery.\nThe Diamonds are 12-time World Cup champions. They are currently the number one team in world rankings with a large gap to second placed New Zealand.\nThe 2027 Netball World Cup will be the first time in more than a decade Australia has hosted the world's best netballers and the Diamonds will be defending their crown.\nAt the 2023 Netball World Cup, held in South Africa, the Diamonds reclaimed their World Cup Champion status from New Zealand with a convincing 61-45 win over England in the final.\nQuotes attributable to Minister for Sport, Anika Wells:\n\"The Albanese Government's $6 million dollar investment will help deliver an exceptional Netball World Cup in 2027, and generate more opportunities for more future Diamonds.\n\"Netball has the highest participation numbers for women and girls in Australian sport and their participation drives health, social and economic benefits, as well as the Government's gender equality agenda.\n\"Netball plays a key role in the community, particularly in rural areas and is visible inspiration for young women and girls to live healthier lives.\n\"Our $6m funding again shows our commitment to invest in women and girls, building on the $85 million invested for last year's Women's Football World Cup, the 2022 Women's Basketball World Cup and the $200m Play Our Way fund for women and girls sporting infrastructure.\"\nQuotes attributable to Netball Australia Chair, Liz Ellis:\n\"We thank the Federal Government for their ongoing support for netball and the 2027 Netball World Cup.\n\"More women and girls play netball across Australia than any other code. The Netball World Cup will be a celebration of their contribution to our great game for the past 100 years.\n\"The Super Netball League is the best league in the world, the Origin Australian Diamonds are the No. 1 team and defending World Cup champions and the 2027 Netball World Cup will be the greatest ever.\"\nQuotes attributable to Australian Diamonds captain Liz Watson:\n\"The 2027 Netball World Cup will be a pivotal moment for our sport both in Australia and internationally,\" Watson said.\n\"The Federal Government's support will help to ensure it is a landmark event for netball in Australia and inspires the next generation of Australian Diamonds.\"",
  "word_count": 448,
  "scraped_at": "2026-02-14T12:47:53.102829"
}