{
  "article_id": "c867053774d0",
  "url": "https://inews.co.uk/news/i-morning-briefing-three-questions-as-small-boats-week-begins-2528951",
  "title": "i morning briefing : Three questions as small boats week begins",
  "date": "20230807T070000Z",
  "domain": "inews.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Welcome to Monday’s Early Edition from i.\nIt’s early August and traditionally, that means we should be in the midst of silly season. Despite the recent drizzle, it is supposed to be that special time of year when front pages are dominated with headlines about criminally aggressive seagulls, constellations in the shape of celebrities, or even “squirrels on crack“. But this week is starting out differently, (perhaps with one exception). Instead, it’s “small boats week”, in which the Government plans to push out more plans to show it is doing something to tackle Channel crossings, as Rishi Sunak’s promised deadline looms. “I want to stop the boats – it’s our promise and I know it’s absolutely critical. I know it’s what the British people really want us to do. They’re on our side,” Suella Braverman told the Mail on Sunday. Officials have been briefing various media with different lines on how they’re going to do this. What do they say, how serious are they, and why does one of them sound a little bit familiar? We’ll take a look, after the headlines.\nToday’s news, and why it matters\nUK scientists are preparing for a potential bird flu pandemic in humans, with several pharmaceutical companies already at advanced stages of developing vaccines to protect global populations against a future outbreak. Experts at the Government’s top-secret laboratories in Porton Down are preparing to test the effectiveness of avian influenza jabs for humans developed by AstraZeneca, Moderna and other firms. Jane Merrick went inside the top secret vaccine lab working to stop another pandemic – and Disease X.\nThe UK lacks a proper industrial strategy that will prepare the country for net zero and enable it to compete with China, the US and EU, a senior Labour MP has said. Stephen Kinnock, shadow minister for immigration, accused Rishi Sunak and Jeremy Hunt of being “blind to the reality of the world around them” by failing to subsidise British industry to guide it through the green transition over the next decade.\nLabour’s shadow equalities minister has doubled down on the party’s U-turn on so-called “self-ID” for transgender people – arguing it will remove “indignities” for trans people without setting back the cause through divisive “culture war” debates. Anneliese Dodds reaffirmed Labour’s commitment to maintaining women-only spaces such as domestic violence shelters.\nThe only events for which Metropolitan police chiefs authorised the potential use of baton rounds in the past six years were black-led gatherings, The Guardian has reported. The weapons have been cleared for use at Notting Hill carnival since 2017 and the Black Lives Matter protests in 2020.\nA mother who was left unable to access any money after Barclays closed her bank account without explanation says she was advised to borrow cash from family or use a food bank. Kerry Maloney, a 30-year-old NHS worker, discovered her personal account with Barclays had been cancelled when she was unable to pay for petrol while taking her young children to school.\nFormer chancellor Kwasi Kwarteng, whose mini-Budget last September was widely blamed for helping cause interest rates to rocket, has complained about the cost of his own mortgage going up. However, in an interview with GB News, Mr Kwarteng denied that he had been “screwed over” by his own economic policies after revealing his own tracker mortgage had gone up.\nThree questions over government migration plans this week:\nAre migrants really going on Bibby Stockholm today? Despite a number of safety warnings, ministers are hoping that the first migrants due to be housed on the floating barge off Dorset will be moved on board today. The firefighters’ union has warned it is a “potential deathtrap”, citing concerns including overcrowding and access to fire exits, while another report raised concerns over how easy diseases could break out and spread. The Home Office did nothing to dampen suggestions the arrivals could come on Monday, the PA news agency reported overnight. However, plans to move migrants have already been delayed, and immigration minister Robert Jenrick said the barge would accept its first occupants “in the coming days”, avoiding naming a specific day. Lawyers acting on behalf of asylum seekers due to be housed on the barge were also reported to be submitting last-minute legal challenges last night.\nWhat does a crackdown on landlords and business owners mean? As part of its new plans, the Government is tripling fines for employers and landlords who employ or rent to illegal migrants in an attempt to deter small boat arrivals. “Unscrupulous landlords and employers who allow illegal working and renting enable the business model of the evil people smugglers to continue,” Mr Jenrick says. Fines for landlords will be increased with the penalty per lodger rising from £80 to £5,000 and per occupier rising from £1,000 to £10,000 for a first offence. The Home Office said employing illegal migrants “undercuts honest employers, puts vulnerable people at risk of exploitation, cheats legitimate job seekers out of employment and defrauds the public purse”. However, whether bigger fines will change anything remains to be seen. Official data shows that 329 fines were issued to employers of illegal migrants between October and December last year, worth a total of £5.8m, and that over 4,000 penalties had been issued since 2018, bringing in £74m. Read the full story here. And, according to Labour’s Yvette Cooper, the Government is still not acting to solve some of the biggest problems on the issue.\nIs the Government going to send migrants to Ascension island instead of Rwanda? Some Tories have called on the Government for a “Plan B” on their policies to cut migration, especially if the courts rule against deporting them to Rwanda. And so today two newspapers report that government ministers are considering sending asylum seekers to a rocky volcanic outcrop in the South Atlantic Ocean 4,000 miles away called Ascension Island. The Times says the Government is in talks with at least five other countries, in case the Rwanda plan falls through, at one point even considering Niger – which is currently in the middle of a coup. The paper says: “Using Britain’s overseas territories forms part of a range of ‘Plan B’ contingencies that have been discussed by ministers and officials in case the Government’s policy to deport migrants to Rwanda has to be abandoned.” The thing is, the idea isn’t new. Firstly, it was based on a hardline Australian policy – whereby asylum seekers were sent to islands such as Nauru for offshore processing. That policy, described as a “dark chapter” for the country, was condemned by human rights groups and the UN. Secondly, the UK government has had this specific brainwave before. It was previously considered by Priti Patel in 2020, but dropped after a feasibility study which raised the problems of inadequate power, water, and the absence of a hospital. While Ms Patel may have considered it for offshore processing, that would also now pose a problem under the new Illegal Migration Act, which forbids those who have arrived in the UK “illegally” from being able to claim asylum here, meaning they would have to then be deported elsewhere. As one migration law expert put it last night: “ If we’re doing Ascension Island yet again then it’s safe to assume the Tories are completely out of ideas”.\nAround the world\nDonald Trump said he will ask for the judge assigned to the case charging him with seeking to overturn the result of the 2020 presidential election to be removed on “very powerful grounds”. In a series of posts on his Truth Social platform, the former president – who pleaded not guilty to the charges on Thursday – claimed he would be unable to have a fair trial under US District Judge Tanya Chutkan.\nAtlanta is braced for the next indictment as Donald Trump’s legal team faces “tangle of potential conflicts”. Fulton County Prosecutor Fani Willis has described herself as “determined” to throw the book at Trump over his efforts to interfere in the outcome of the 2020 presidential election in Georgia, writes Simon Marks.\nThe prospect of an escalation of hostilities in Niger increased on Sunday as the deadline for a military junta to reinstate the country’s ousted president, Mohamed Bazoum, arrived. Nigeria has received the backing of France to send its forces into Niger to oust the coup’s leader General Abdourahmane Tchiani, despite resistance from neighbouring countries.\nAt least 30 people have been killed and 100 more injured after a train derailed in southern Pakistan, officials said. Ten carriages of the Hazara Express – travelling from Karachi to Rawalpindi – derailed near the Sarhari railway station, close to the town of Nawabshah in Sindh.\nFalling asleep to a pleasant smell such as lavender, peppermint or rosemary may help keep the brain sharp later in life, a new study suggests. Researchers found people aged 65 to 80 who drifted off while accompanied by such fragrances increased their scores in learning and word tests.\nWatch out for…\nnuclear fusion, also known as the “holy grail” when it comes to making clean energy. A historic breakthrough was made last December but now scientists in the US say they have managed to do it again. Final results are still being analysed.\nThoughts for the day\nFootball is tackling racism, but remains strangely silent on homophobia. The sport can be neanderthal compared to the rest of society, writes Stefano Hatfield.\nMeg 2: The Trench is the disaster film we deserve. It is wrong to call modern cinema escapist. Increasingly it is mad realism, argues Tanya Gold.\nRishi Sunak tried a Taylor Swift spin class in LA. Here’s what I hope he learned. A lesson that the PM could really stand to learn from Tay is her ability to make her fans happy, says Rebecca Reid.\nCulture Break\nEdinburgh Fringe 2023: The best shows to see, from Frank Skinner to Megan Stalter. As the annual festival returns, here are this year’s best comedy, and theatre and dance shows, writes Rachael Healy.\nThe Big Read\nWhy thousands of teachers are leaving the classroom for ever. One tells i: “Things have become harder. My anxiety levels are higher. It’s definitely contributed to me making a decision to retire now.”\nSport\nMan City may be football’s blueprint for success, but Arsenal aren’t far behind. This was about bringing the fight to City, about matching them not only technically and tactically but mentally, letting them know they were there in the new sense of the phrase, writes Kevin Garside.\nSomething to brighten your day\n“My friend and I bought a £425k house”: The rise in mates mortgages. Forget buying a house with your spouse, with your family, or even on your own (who can afford that?), now friends are clubbing together, writes Kasia Delgado.",
  "word_count": 1795,
  "scraped_at": "2026-02-14T13:01:04.284883"
}