{
  "article_id": "c87ca683c7ae",
  "url": "https://www.themag.co.uk/2025/03/newcastle-united-official-update-on-new-stadium-and-training-ground/",
  "title": "Newcastle United official update on new stadium and training ground",
  "date": "20250305T124500Z",
  "domain": "themag.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Newcastle United official update on new stadium and training ground\nThere has been a new update from Newcastle United on the much anticipated new stadium, plus a new training ground.\nNewcastle United CEO Darren Eales talking after the release of the latest club accounts on Tuesday, which saw turnover increase from £250m in the 2022/23 season, to £320m last (2023/24) season.\nEales talking to journalists about the newly released financials.\nHowever, the Newcastle United CEO, also giving official updates on that much anticipated new stadium, as well as when we could see a brand new state of the art training ground.\nLate last month, Yasir Al-Rumayyan and others arrived on Tyneside for a gathering of the Newcastle United owners and the club’s senior staff.\nA series of meetings held at a Northumberland hotel, where top of the agenda was the stadium plans. The employed club hierarchy, including specialist staff who have been brought in specifically to help formulate the plans and oversee the eventual stadium development once work starts, had been tasked by the NUFC owners to look at all options and then make their recommendation.\nAs has been widely reported, the Newcastle United owners were told that the recommendation is for a brand new stadium to be built, rather than redevelop the current St James’ Park stadium. This plan for a brand new stadium holding close to 70,000 fans, would appear to tick all boxes. Allowing far more fans into games, allow the club to generate far more money, especially as a new design would mean it could be multi-use, able to host other sports, music events and so on. Even better, the fans and city would benefit, as the planned new stadium would overlap on part of the current Leazes End and then go diagonally across what is currently the club’s multi-storey car park and only use a small part of Leazes Park, with Barrack Road remaining open and not impacted, with then part of the plan to develop part of the current SJP site as parkland to compensate what would be lost in Leazes Park. United’s unique place in the heart of the city centre and fans able to have the same pre and post-match routine that they currently have, plus of course the same transport links to get to and from matches.\nOn behalf of the club, Newcastle United CEO Darren Eales now speaking about the much anticipated stadium decision:\n“We are looking to get something done in the near future.\n“We have looked at the feasibility of what is possible and that is what we are narrowing down.\n“Part of that is feasibility building-wise.\n“We don’t want to rush and do something that in twenty years time, where we think, ‘If we had spent a bit more time… that would have had a bigger impact.’\n“This goes back to the ambition of the owners.\n“Which is to be a club that is competing at the top level.\n“In Europe and in the Premier League.\n“We have to find some way to increase the capacity of our stadium.\n“Whether that is a new build, or a refurbishment of St James’ Park.\n“So we can get up to those levels of revenue that we need, if we are to be able to compete in this PSR or [Premier League reportedly set to move in line with UEFA’s] ‘squad cost’ environment.\n“It [Stadium plans] is a huge decision for the club.\n“Something that we have spoken about as being a once in a generation decision.\n“The ownership is very much looking to make this investment.”\nMy feeling is that the Newcastle United owners know exactly what they intend to do now.\nNo doubt plenty of conversations going on in the background with key partners, previous media reporting saying that club officials have had informal discussions with both Newcastle City Council representatives and the Freemen, amongst others.\nIf everybody is pushing together in the same direction, then this brand new stadium can be a reality.\nPlenty of other cases in both football and other walks of life, where new developments getting the go ahead for the greater good of the people and the region.\nTottenham have worked with Enfield Council and plans passed for them to be able to build a huge new training facility for their women’s team, to be built on part of what is currently parkland. With Spurs guaranteeing additional investment on the overall parkland site to compensate for any land lost.\nOur old mate Mike Ashley also getting plans approved by the local authority down in Rugby for a huge new Frasers (Sports Direct) HQ to be built on green belt land, the case overwhelmingly made that the region will massively benefit overall thanks to this development and investment.\nHopefully in our case, when we do hear finally what exactly the plan for the new Newcastle United stadium is, that the majority of work has already been done behind the scenes to smooth the path for the actual building of the new stadium to begin ASAP.\nDarren Eales on a state of the art new training ground replacing the current situation:\n“We are still making ongoing investments in the short-term to our current one.\n“Though we are looking to the medium-term for a new training ground.”\nClub make public the Newcastle United 2023/24 accounts – 4 March 2025:\n‘Newcastle United Limited (Newcastle United) has filed its financial results for the 12 months ended 30 June 2024, reflecting a 28% increase in overall revenue.\nThis strong financial performance reflects continued progress on and off the pitch during the financial year, including a return to the UEFA Champions League.\nThese figures represent a substantial improvement on the previous two financial years, which had been characterised by significant investment into the squad.\nThe improved result was driven mainly by revenue growth from Newcastle United’s participation in the Champions League and profits from transfer dealings in line with Premier League profit and sustainability rules (PSR).\nNewcastle United increased its latest reported revenue to £320.3million (from £250.3million in 2022/23), reflecting 90% and 32% increases in commercial and matchday revenues respectively.\nSince the end of the accounting period, the ownership group led by PIF has continued to invest capital into the club to improve the financial position of the business. This continued investment is consistent with the shareholders’ approach of long-term, patient investment.\nDarren Eales, Chief Executive Officer of Newcastle United, said: “We are committed to sustainable success and we have started 2025 in a strong position.\n“Our progress has been supported by diligent work on and off the pitch. Returning to the Champions League for the first time in more than 20 years was hugely memorable for everyone connected with the club, and it has clear upside financially as we continue to grow.\n“We grew our revenues by 28% in the twelve months to 30 June 2024, with an increase in matchday revenue as well as significantly improved sponsorship deals and a sharper focus on everything we are doing across the club.\n“We continue to make significant strides with our commercial deals and matchday offerings as we strengthen the foundations of the long-term project here at Newcastle United.”\nNewcastle United’s accounts for the 12 months ending 30 June 2024 can be found here.’\nIf you would like to feature on The Mag, submit your article to contribute@themag.co.uk",
  "word_count": 1227,
  "scraped_at": "2026-02-14T12:49:32.703086"
}