{
  "article_id": "c882b28bddb5",
  "url": "https://www.gcis.gov.za/newsroom/media-releases/statement-cabinet-meeting-wednesday-21-june-2023",
  "title": "Statement on the Cabinet Meeting of Wednesday , 21 June 2023 | Government Communication and Information System ( GCIS ) ",
  "date": "20230622T141500Z",
  "domain": "gcis.gov.za",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "ISSUES IN THE ENVIRONMENT\n1. Recommendations of the Judicial Commission of Inquiry into Allegations of State Capture, Corruption and Fraud in the Public Sector, including Organs of State\n1.1. Today, 22 June 2023, is exactly a year since The Presidency received the final report of the Judicial Commission of Inquiry into Allegations of State Capture, Corruption and Fraud in the Public Sector, including Organs of State.\n1.2. In October 2022, President Cyril Ramaphosa submitted to Parliament government’s plan for the implementation of the Commission’s recommendations. Cabinet is due to receive a progress report on the implementation of the Commission’s recommendations.\n2. Protocol Agreement with France to increase Special Investigating Unit (SIU) capacity\n2.1. South Africa, represented by the Minister of Justice and Correctional Services, Mr Ronald Lamola and France, represented by the Minister for Europe and Foreign Affairs, Ms Catherine Colonna, have signed a cooperation protocol agreement that will increase the capacity of the SIU.\n2.2. This cooperation further capacitates the SIU on cyber forensics, financial crimes and analytical skills.\n2.3. The partnership will result in the establishment of an Anti-Corruption Academy in Pretoria. This academy will serve members of the SIU, other law-enforcement and anti-corruption agencies within Southern African Development Community member states, the Commonwealth and non-Commonwealth countries.\n2.4. This new capacity will also deepen the country’s ability to respond to matters arising from the State of Capture Commission.\n3. Joint Working Visit by Prime Ministers of the Netherlands and Denmark\n3.1. Cabinet welcomed the engagements between President Ramaphosa, Prime Minister Mark Rutte of the Netherlands and Prime Minister Mette Frederiksen of Denmark, during the joint working visit in Pretoria this week. The joint working visit was a first of its kind in our country.\n3.2. The economic relations between the three countries are a present-day manifestation of longstanding relations between South Africa and two European Union countries that offered significant support to South Africa’s liberation movements and the fight against apartheid.\n3.3. During this working visit, South Africa signed Memoranda of Understanding on cooperation in the field of green hydrogen and energy partnerships with the two countries.\n3.4. Companies and institutions from the three countries made investment and partnership announcements, including a one billion United States Dollar commitment for the establishment of the SA-H2 Fund to mobilise green hydrogen investments.\n3.5. The Public Infrastructure Fund for Water and Energy: Invest International intends to establish a concessional financing package fund for 300 million Euros and grants of 100 million Euros that will assist South Africa in the delivery of water and energy infrastructure.\n4. African Peace Mission\n4.1. Cabinet welcomed a briefing by President Ramaphosa on the recent African Peace Mission to Ukraine and the Russian Federation in which the President participated alongside leaders and representatives of the governments of Senegal, Comoros, Zambia, Egypt, Congo-Brazzaville, and Uganda. The Mission underscored South Africa’s principled position of non-alignment and the country’s commitment to the peaceful resolution of the conflict.\n4.2. Cabinet noted that President Volodymyr Zelensky of Ukraine and President Vladimir Putin of the Russian Federation had welcomed the African peace initiative and committed to further engagements with African leaders on matters raised towards a peaceful resolution of the conflict.\n4.3. The Mission emphasised the need for a de-escalation of the conflict to allow negotiations to commence with urgency, the return of children taken from Ukraine, the release of prisoners of war and creation of corridors to facilitate for greater humanitarian assistance.\n4.4. Cabinet welcomed the appreciation expressed by global leaders of the value of this African Leaders’ Peace Initiative towards finding a peaceful resolution of the conflict as expressed by the Prime Ministers of Denmark and the Netherlands, as well as the Foreign Minister of France, amongst others.\n4.5. Following the peace mission, South Africa will participate in the African Union-Russia Summit in Moscow in July, on the sidelines of which, our government will also take the opportunity to further engage Russia on matters the two Presidents undertook to give their consideration.\n4.6. President Ramaphosa’s National Security Advisor, Prof Fholisani Sydney Mufamadi, will attend a Peace Summit, convened by President Zelenksy, that will take place in Copenhagen, Denmark, in August.\n4.7. With regard to the flight that transported South African presidential security personnel and media representatives to Poland en route to Ukraine and Russia, Cabinet noted the unfortunate events that unfolded when this flight landed in Warsaw, Poland.\n4.8. Cabinet noted that the Department of International Relations and Cooperation will pursue discussion on this matter through the appropriate diplomatic mechanisms and channels.\n5. Trade matters\n5.1. Cabinet noted the latest trade figures as presented by the Department of Trade, Industry and Competition showed that South Africa’s exports to China reached US$33 billion in 2022, more than twice the level of our next largest trading partner, Germany.\n5.2. Overall, South Africa-China trade increased by 30% from US$44 billion in 2018 to US$57 billion by the end of 2022. From 2018 to 2022, average annual growth rates of 10% (exports) and 4.5% (imports) were recorded. South Africa maintained a large trade surplus over those five years.\n6. Energy\n6.1. Cabinet welcomed the agreement that will see Mozambique supply South Africa with 100 megawatts (MW) of electricity within the next three (3) months upon the signing of the Power Purchase Agreement. The next three to 12 months will see South Africa importing up to 1 000 MW of electricity from Mozambique.\n6.2. Cabinet further welcomed continuous improvement in the Eskom’s generation capacity that has ensured the utility registers over 60% Energy Availability Factor.\n6.3. Cabinet extends its appreciation to South Africans for your contribution in lowering the demand for electricity, which has contributed to Eskom being able to maintain lower stages of load-shedding. Saving electricity is a shared responsibility and an action from which all of us benefits.\n6.4. Cabinet expressed appreciation for a donation to South Africa by the People’s Republic of China of emergency and small-scale generation equipment valued at R167 million. A deployment plan is being developed to ensure the donated equipment is installed in public facilities which will, as a result, be isolated from load-shedding. A formal handover ceremony will take place as soon as the goods are cleared by South African customs authorities.\n7. Water\n7.1. Cabinet received an overview of responses by the Department of Water and Sanitation to water and sanitation challenges in the country.\n7.2. The overview highlighted the acceleration of surface water resource projects that had previously experienced such as:\n7.2.1. Construction of the R40 billion Phase 2 of the Lesotho Highlands Water Project which will serve Gauteng and surrounding provinces. Work will be completed in 2027.\n7.2.2. The R4 billion Phase 2A of the Mokolo Crocodile Water Augmentation Project in North West and Limpopo. Funding is being raised for another phase on which construction will start in May 2024, with completion planned for 2030.\n7.2.3. In a partnership between government and the mining sector, construction is underway on the R24 billion Olifants River Water Resource Development project in Limpopo, with completion expected in 2030.\n7.2.4. In a similar partnership with mines in the Northern Cape, construction will start later this year on the R10 billion Vaal Gamagara project where completion is also expected around 2030.\n7.2.5. Construction started this month, June 2023, on the R500 million Groot Letaba Water Augmentation Project in Limpopo, which entails the raising of the Tzaneen Dam. Work on this project will be completed in 2025.\n7.2.6. In the Western Cape, construction will begin in 2024 on the R1,2 billion Voëlvlei Augmentation Scheme, where completion is expected in 2026.\n7.3. These projects are securing the supply of water to the nation and in this process thousands of people will be employed, businesses around the construction sites will benefit from the consumption of workers and contractors, and the improved infrastructure will benefit local economies.\n8. Launch of South African Isotope Facility (SAIF)\n8.1. Cabinet welcomed the partnership between the Department of Science and Innovation and IThemba LABS, which saw the opening of the SAIF, a world-class facility that responds to the growing challenge of cancer as one of the leading causes of death. The facility will conduct advanced research and training as well as increase the production capacity for radioisotopes. Radioisotope therapy targets cancerous cells with minimal damage to surrounding healthy cells.\n8.2. Currently about 5 000 South African patients a year benefit from the supply, and it is expected that these numbers could increase by a factor of five to seven, with the increase in production capacity through the SAIF and the availability of a new cohort of isotopes.\n9. Passing of the Postbank Limited Amendment Bill\n9.1. Cabinet welcomed the passing of the Postbank Limited Amendment Bill by Parliament (both the National Assembly and National Council of Provinces), which paves a way for the licensing of the state bank.\n9.2. The Bill addresses the risks currently associated with the current structure of the Postbank, by amending the ownership and reporting structure to establish a new holding company for the Postbank.\n9.3. Cabinet will await the President to sign the into law which will allow the registration of the Postbank as a Bank Controlling Company.\n10. Youth Empowerment\n10.1. Cabinet thanked all South Africans for joining in the country’s Youth Day celebrations on 16 June 2023 under the theme: “Accelerating youth economic emancipation for a sustainable future”.\n10.2. Cabinet welcomed the launch of state-of-the-art Public Employment Mobile Bus by the Departments of Basic Education, Higher Education, Science and Innovation, and Employment and Labour, in collaboration with the European Union's Education for Employability programme. These opportunity buses travel to far-flung areas to help learners and work-seekers on their employment path by matching individuals’ strengths and capabilities to potential careers and job opportunities.\n10.3. Cabinet further welcomed the initiatives by the Department of Agriculture, Land Reform and Rural Development to support youth to participate in the agricultural sector in their revitalisation of communal areas such as the Marapyane-Bakgatla primary cooperative. This cooperative has created more than 100 jobs in their villages and these youth are primarily grain and sunflower farmers.\n11. Working on Fire Programme\n11.1. Cabinet salutes the 400 South African firefighters deployed to Canada to assist in saving lives, homes, businesses and vegetation; in the Canadian Province of Alberta.\n11.2. The 2023 deployment is in response to an urgent request from the Canadian Inter-agency Forest Fire Centre. This fifth collaboration between South Africa and Canada is evidence of the strong relations between our two countries and South Africa’s contribution to preserving our physical environment, regardless of which part of the world is affected by environmental threats.\n12. Special Olympics World Summer Games\n12.1. Team South Africa continues to fly the flag at the 2023 Special Olympics World Summer Games in Berlin, Germany, from 17 to 25 June 2023. Team SA comprises 64 athletes and 21 coaches who are competing against 7 000 athletes from across 180 countries. They represent the best of our nation and are proof of the power of the human spirit.\nB. CABINET DECISIONS\n1. South Africa’s Ratification of the Luxembourg Protocol to the Convention of International Interests in Mobile Equipment on Matters Specific to Railway Rolling Stock\n1.1. Cabinet approved the submission of the Luxembourg Rail Protocol to Parliament for ratification. The Luxembourg Rail Protocol fosters economic growth by enhancing private sector financing in the rail industry.\n1.2. The Luxembourg Rail Protocol is a result of the success of the Cape Town Convention on International Interests in Mobile Equipment that was held in 2007. South Africa signed the protocol in 2022, as an indication of how serious the country is about rail reform.\nC. APPOINTMENTS\nAll appointments are subject to the verification of qualifications and relevant clearance.\n1. Mr Evert Potgieter as Chief Financial Officer of the Property Practitioners Regulatory Authority.\n2. Mr Sandile Psychology Mkhize as Chief Executive Officer of Magalies Water (extension of contract).\n3. Dr Mlungisi Bhekizizwe Gabriel Cele as Head: National Advisory Council on Innovation at the Department of Science and Innovation.\n4. Members of the Agricultural Research Council:\n(a) Ms Joyene Isaacs (reappointment);\n(b) Dr Poncho Mokaila (reappointment);\n(c) Dr Jonty Tshipa;\n(d) Mr Neo Harrison Masithela;\n(e) Ms Clarinda Elizabeth Simpson;\n(f) Dr Hilke Maartens;\n(g) Mr Goodman Gcaba (reappointment);\n(h) Dr Troy Govender;\n(i) Dr Konanani Liphadzi (reappointment);\n(j) Dr Pieter Naude Malan (reappointment); and\n(k) Dr Owen Horwood.\n5. Filling of vacancies on the Cross-Border Road Transport Agency:\n(a) Ms Bukeka Mahlutshana; and\n(b) Mr Leroy Nsibande.\n6. Filling of vacancies on the Board of the South African Civil Aviation Authority:\n(a) Adv Mpati Lebakeng; and\n(b) Mr Tshepo Peege.\nD. BILLS\n1. Draft Marriage Bill of 2022\n1.1. Cabinet approved the publication of the Draft Marriage Bill of 2022 for public comment.\n1.2. The Bill gives effect to the White Paper on Marriages in South Africa, which was approved by Cabinet in March 2022. The Bill empowers the Department of Home Affairs to develop a single Marriage Act for the country.\n1.3. The Bill seeks to ensure that all marriages are concluded in accordance with the principles of equality, non-discrimination and human dignity as provided for in the Constitution of the Republic of South Africa of 1996.\n1.4. The draft Bill allows South Africans and residents in the country of all sexual orientations, as well as religious and cultural persuasions, to conclude legal unions in line with the constitutional principles.\n1.5. The Bill outlines measure to prevent unions such as child marriages and those done in the absence of the other party.\n2. National Water Resource Infrastructure Agency (NWRIA) Bill of 2022\n2.1. Cabinet approved the submission of the draft NWRIA Bill to Parliament. The Bill proposes the setting up of an NWRIA to be responsible for the planning, financing and development of the water infrastructure for the country. It will also be responsible for the maintenance of the current water resource infrastructure.\n2.2. The agency is to ensure a sustainable, equitable and reliable supply of water in line with constitutional obligations of access to water and a secure healthy environment. It will be set up as a Public Entity under the Schedule 2 of the Public Finance Management Act, 1999 (Act 1 of 1999). The agency will take on the functions that are currently performed by the Trans-Caledon Tunnel Authority.\n3. Divorce Amendment Bill of 2023\n3.1. Cabinet approved the submission of the draft Divorce Amendment Bill of 2023 to Parliament.\n3.2. The Bill amends the Divorce Act, 1979 (Act 70 of 1979) so as to provide for mechanisms to safeguard the welfare of minor or dependent children born of Muslim marriages. The amendments also aim to provide for the redistribution of assets on the dissolution of a Muslim marriage; to provide for the forfeiture of patrimonial benefits of a Muslim marriage.\n3.3. In June 2022, the Constitutional Court had found that the Divorce Act in its current form to be inconsistent with the Constitution as it excludes Muslim marriages. The court found that a section of the Divorce Act is unconstitutional in that it unfairly discriminates against children of married parents and those of unmarried parents.\n4. The African Renaissance and International Cooperation Fund (ARF) Amendment Bill\n4.1. Cabinet approved the submission of the publication of the ARF draft amendment Bill for public comment. The purpose of the Bill is to amend the ARF Act (Act 51 of 2000). The amendments will also mean that the ARF will now be called the South African Development Partnership Agency. The agency will serve as a tool to manage, support and facilitate South Africa’s outgoing development cooperation and assistance.\n4.2. The ARF is critical to promoting South Africa’s national interests and values, the African Renaissance and the creation of a better world for all.\n4.3. The ARF is also important for South Africa as it enhances cooperation between our country and other countries, in particular African countries, through the promotion of democracy, good governance, the prevention and resolution of conflict, socio-economic development and integration, humanitarian assistance and human resource development.\n5. Update in South Africa’s Re-election to serve as a Member of the Council of the International Civil Aviation Organisation\n5.1. Cabinet noted the re-election of South Africa to serve as a Member of the Council of the International Civil Aviation Organisation\nF. UPCOMING EVENTS\n1 Mandela Month\n1.1 South Africa and the world will, in July, commemorate Mandela Month under the theme “Climate, Food and Solidarity” During the month, South Africans celebrate former President Nelson Mandela’s life, his legacy and take action to help change our communities for the better, integrating efforts contributing towards the fight against poverty and inequality.\n1.2 Cabinet urges all South Africans to use the month to do something that will make a difference in their communities and ensure that we build the South Africa envisioned by our founding father.\n2 Summit for a new Global Financing Pact\n2.1 President Ramaphosa will, on 22 and 23 June 2023, participate in the summit for a new global financing pact in France.\n2.2 South Africa will address key issues such as the reform of multilateral development financial institutions, debt crisis, innovative financing, international taxes and special withdrawing rights.\n3 Representative Council of Learners (RCL) Conference\n3.1 The RCL Conference will be convened on the 29 and 30 June 2023 at the University of Pretoria with an aim of building and strengthening the role of RCLs in schools.\n3.2 This year’s conference will focus on empowering learners, the identification of learners’ needs and improving the functioning of RCLs. This is an important platform for developing future leadership of the country.\n4 2023 Netball World Cup Tournament\n4.1 With 36 Days to go to the Netball World Cup 2023 which will take place at the Cape Town International Convention Centre from 28 July to 6 August 2023, Cabinet thanked all South Africans for the warm Ubuntu welcome to the entourage on a countrywide World Cup Trophy tour.\n4.2 The trophy tour forms part of the build-up to the opening game. The trophy tour kicked off in KwaZulu-Natal and will make its way to Gauteng, Mpumalanga, Limpopo, North West, Free State, Northern Cape and the Eastern Cape. The tour will culminate in the Western Cape as the host province, before the start of the tournament on 28 July 2023.\n5 Banyana Banyana depart for Women’s FIFA World Cup\n5.1 On behalf of the nation, Cabinet extends its best wishes to the national women’s football team, Banyana Banyana, as they prepare to depart on Friday, 23 June 2023, for the Women’s FIFA World Cup which will be staged in Australia and New Zealand in July.\n5.2 The team’s performances in various tournaments have brought global attention to the development of the women’s game in South Africa, as part of the broader self-empowerment and societal empowerment of women in the country.\nG. MESSAGES\n1. CONGRATULATIONS\nCabinet extended its congratulations and well-wishes to:\n- South African wheelchair tennis players Donald Ramphadi and Kgothatso Montjane who emerged as Grand Slam champions in their respective divisions at the prestigious Roland Garros tournament in France.\n- All the winners of the 2023 Comrade Marathon and runners who participated in the ultramarathon down run from Pietermaritzburg to Durban. We congratulate Tete Dijana and Gerda Steyn for not only winning the men’s and women’s races respectively, but also for breaking the down-run records for both the men and women races.\n- A special mention is also reserved for Limpopo resident Ntate Johannes Mosehla who, at the age of 81, became the oldest person to complete the Comrades. In Youth Month, South Africans of all ages can learn the value and benefit of a healthy lifestyle from this very senior citizen.\n- Cabinet also commends Nomhle Ngwenya for becoming the youngest and first black woman to obtain a PhD from the science faculty at Wits at just 25 years old.\n- Ms P Khoza who was elected the President of the 42st ICAO Assembly that took place from 27 September to 7 October 2022 in Montreal, Canada\n2. CONDOLENCES\nCabinet expressed condolences to the family and friends of:\n- Member of Parliament, Ms Tina Joemat-Pettersson, who was the Chairperson of the National Assembly Portfolio Committee on Police, and previously served as Minister of Agriculture, Forestry, and Fisheries and Minister of Energy. She also served as an MEC for Education in the Northern Cape. She was also a member of the National Executive Committee of the African National Congress (ANC) and ANC Women’s League. A liberation struggle activist with the United Democratic Front.\n- Kgoshi Kgagudi Kenneth Sekhukhune, Kgoshi ya Marota Mohlaletse, Hlabirw’a a Bauba and the long-serving former regent of the Bapedi Kingdom. The thoughts and prayers of Cabinet are with the Royal Family and the Bapedi people as final preparations are made for the late Regent’s funeral.\n- Legendary former Bafana coach, Clive Barker, who led our nation to victory in the historic 1996 Africa Cup of Nations, which was held on home soil for the first time.\nEnquiries:\nMr Michael Currin – Acting Government Spokesperson\nMobile: 082 462 7896\nIssued by: Government Communication and Information System (GCIS)",
  "word_count": 3523,
  "scraped_at": "2026-02-14T12:45:42.216696"
}