{
  "article_id": "c891442a5f7a",
  "url": "https://www.rnz.co.nz/international/pacific-news/492005/will-brian-kaltak-s-success-open-doors-for-pacific-players-into-the-a-league",
  "title": "Will Brian Kaltak success open doors for Pacific players into the A - League ? ",
  "date": "20230614T203000Z",
  "domain": "rnz.co.nz",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Analysis\nThe meteoric rise of Vanuatu international and A-League champion Brian Kaltak begs a question...why aren't there more Pacific Islanders in the league?\nThe start of this month saw Central Coast Mariners defender Brian Kaltak create history.\nThe Vanuatu national team captain marshalled his side to a 6-1 demolition of Melbourne City in the A-League Men's Grand Final, becoming the first player from his nation to win the competition.\nThis feat came in a week in which he was also named in the A-League Men's Team of the Season - topping off both a stellar team and individual campaign.\nHis achievements become all the more impressive when remembering this is a 29-year-old playing his first-ever season as a professional. Whereas most footballers his age are a depreciating asset, Kaltak's stock is on the rise.\nNot only did Kaltak become the first Pacific Islander to win the A-League showpiece on June 3, he was also the first to ever feature. Which is no surprise, considering he is just the sixth Pacific Island-born player to participate in the A-League across the competition's 19-year run.\nKaltak's countryman Mitch Cooper, Brad McDonald (Papua New Guinea), Henry Fa'aorodo and Benjamin Totori (Solomon Islands) came before him while Fiji's Roy Krishna is perhaps the most successful of them all, winning the Johnny Warren medal as the league's best player with the Wellington Phoenix in 2018-19.\nBut like Kaltak, Krishna had to wait for his opportunity, not turning professional until he was 26.\nBefore his big break at Central Coast, Kaltak had played football across the region, most notably in New Zealand with all-conquering domestic side Auckland City.\nBut at no point, despite also leading his nation, was Kaltak ever playing professionally...until now. It is a fact that has continually baffled his head coach Nick Montgomery. He also believes Kaltak cannot be alone.\n\"We know he's a great character and just a beautiful human being, but as a footballer, he has every attribute to play at the top level,\" Montgomery said.\n\"He's an inspiration to anyone in the Pacific Islands or anyone who thinks it's maybe too late to become a professional at 29. He has proved that theory completely wrong.\"\n'An outstanding achievement'\nCentral Coast were the culmination of a perfect storm for Kaltak. Montgomery has an affinity for Vanuatu formed after visiting the archipelago in the wake of Cyclone Pam in 2015. Meanwhile, the club's former technical assistant Joshua Smith has worked with the Vanuatu Football Federation for the past six years.\nSmith, currently head coach of Adelaide-based National Premier League (NPL) side FK Beograd, worked with Kaltak at the Oceania Football Confederation's (OFC's) FIFA World Cup qualifiers in March 2022. He sent videos to Montgomery and his assistant Sergio Raimundo back in Gosford detailing Kaltak's talent before briefly signing him at FK Beograd when an initial trial at the Mariners was cut short due to injury. He is not surprised by Kaltak's progression.\n\"As soon as Brian arrived in camp I knew he had the ability, mindset and physicality to play in the A-League,\" said Smith.\n\"The rest is history. It's an outstanding achievement, I couldn't think of someone who deserved it more.\"\nConsidering the success of Krishna and Kaltak it seems a no-brainer to roll the dice on a Pacific Island player.\nSmith has worked with plenty of players from the region and admits it is a \"big step\" from the Pacific to the A-League. But he sees no reason why clubs in Australia's tier two NPL shouldn't act as more of a stepping stone.\n\"I would encourage more NPL sides to take the plunge and look to recruit visa players from the Pacific,\" he said.\n\"It's so close to home, has lots of talent and they are mad about football with so much room for improvement. If they can come and perform in the NPL then the opportunity into the A-League should follow if everything aligns.\n\"We currently have (Solomon Islands international) Micah Lea'alafa playing here in Adelaide with us. If he had been picked up by an A-League club when he was 25 he definitely would have been a household name by now, there are more hidden gems out there.\"\nVisa restrictions\nClosing that gulf in standard between the Pacific and the A-League is difficult. A-League clubs can currently only sign five foreign players, with the aim of maintaining the development of local talent.\nThe fruits of this incentive are evident in last year's FIFA World Cup overachievement by the Socceroos and in precocious talents such as Garang Kuol and Nestory Irankunda.\nHowever, five visa slots results in clubs being reluctant to give young and unproven Pacific Island players a chance, instead favouring experienced pros with years of high-level game time.\nTake the example of Solomon Islands talent Raphael Lea'i. The skilful forward had envious eyes at the Brisbane Roar and Melbourne Victory while the Wellington Phoenix once looked a likely destination. The attacker even attended Scots College in the New Zealand capital, a school linked to the Nix's academy programme.\nBut as Wellington Phoenix general manager David Dome admitted, taking risks on unknown quantities is difficult. It's not just with players from the Pacific either, but young foreign players in general. The Phoenix had to let Mexican talent Eugenio Pizzutto and English winger Calvin Harris go in 2017 and 2018 respectively, as well as Lea'i.\n\"We have had to forgo a few young international players who came through our academy due to the international restrictions, who we may otherwise have signed,\" said Dome.\n\"Currently, we reserve our international visa positions for experienced and proven players who can make an immediate impact in the first team. To allocate it to a youth player would be a significant departure from the strategy - and I'd suggest quite a risky one.\n\"It would be difficult to convince a head coach or the board that it makes sense to roll the dice on a youth player who is unproven at the international level. But as our Academy continues to grow and develop players it's not out of the question.\"\nIt's one of the reasons Kaltak will have previously struggled to find himself a playing deal in the A-League. He himself trained with the Phoenix as a teenager in 2011 but did not earn a professional contract.\nDoors may open\nBoth Dome and Montgomery have stated they would support the idea of a 5+1 quota for Pacific Island players - allowing clubs to sign one extra foreign player, on top of the current five, from the Pacific. In that scenario, a player like Lea'i, who is now playing for Bosnian outfit Velez Mostar, would be worth a punt.\nSmith agrees and hopes the mooted launch of OFC's professional league in 2025 will help \"unlock some doors\" on the pathway for players and coaches.\n\"I think it would be a step forward for Oceania,\" he said.\nHowever, the A-Leagues (men and women) no longer have any tangible affiliation to the Oceania Football Confederation, which governs the region's member nations.\nAustralia's football governing body, Football Australia, jumped ship to the Asian Football Confederation (AFC) in 2006, allowing for a more likely passage to men's World Cup qualification and entry to the AFC Champions League for club sides. While the A-Leagues unbundled from Football Australia and are now run by Australian Professional Leagues (APL) the competition remains affiliated with the AFC, meaning no mandate to develop OFC, thereby Pacific, talent. As a result, discussion has often centred around an AFC player quota for A-League clubs rather than an OFC or Pacific allowance.\nThe APL did not provide a comment when approached on the topic.\nDespite this, the fact remains that geographically, demographically, culturally and vocationally the Pacific Island nations remain more intrinsically linked to Australia and New Zealand than anywhere else. There is a symbiotic relationship between the two regions with huge diaspora and heritage across the Tasman Sea. The talent may be there but the most likely and convenient route into the professional game is essentially blocked off.\nA-League teams are not the free-spending behemoths of the European game. Tight margins and small squads mean every visa slot is precious. When faced with a choice of an upstart Pacific protege or an experienced European or South American, clubs are reticent to roll the dice.\nThe issue is just as stark in the A-League Women. No Pacific Island representative has played in the competition yet. Women's football in the region is undoubtedly some way behind the men's game, with cultural and social issues a factor, but it is improving. Anyone who saw the likes of Fiji's Cema Nasau or Tonga's Laveni Vaka in action at last year's OFC Women's Nations Cup would struggle to suggest they wouldn't thrive in the A-League.\nMeanwhile, the first-ever OFC Women's Champions League concluded last week, with New Caledonia's AS Academie Féminine crowned the region's best. Yet again, however, using a prized visa spot on an unknown is a risky business most clubs would avoid.\nBack in 2014, in an interview with The Guardian, Roy Krishna spoke of his newfound success as a pro and the hope of future Pacific representation in the A-League.\n\"There's a lot [of talent] back at home, and even in the other Pacific islands, but we're not lucky enough to get out of there,\" he stated.\n\"So it just disappears in the islands.\"\nNearly a decade later and Kaltak has been the only player to avoid that disappearing act. It will take a change in systems and perceptions for Kaltak not to be another outlier, like Krishna was, in the years to come.\nThis story was originally published in a slightly longer form on the author's Substack newsletter Two Halves.",
  "word_count": 1622,
  "scraped_at": "2026-02-14T12:45:47.898136"
}