{
  "article_id": "c8973bf1d1cb",
  "url": "https://www.inverelltimes.com.au/story/8668503/changing-academy-picks-system-this-year-folly-swans/?cs=9735",
  "title": "Changing academy picks system this year  folly : Swans",
  "date": "20240619T084500Z",
  "domain": "inverelltimes.com.au",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Another shot has been fired in the conflict over northern AFL club academies, with Sydney boss Tom Harley saying potential changes to the draft bidding process would be \"folly\".\nSubscribe now for unlimited access.\nor signup to continue reading\nLast week, the league's football operations manager Laura Kane sparked plenty of discussion when she said the points bidding system for father-son and academy draft picks could be changed - as early as this year's draft.\nUnrest has grown after Gold Coast had a rich haul from their academy at the draft last year, snaring four players inside the top 26 picks.\nSpeaking at a media conference on Wednesday to mark the Swans' 150th birthday and their record membership, Harley strongly defended the four northern clubs' academy programs.\n\"I'm happy to go absolutely on record with this - the academies are the most important game development initiative for (its) growth ... certainly in Sydney and in Queensland,\" Harley said.\n\"The reality is the current bidding process and the 'belts and braces' that are attached to that are absolutely adequate.\n\"To make a snap judgment off the four Gold Coast players, which is what it feels like, would really be folly.\n\"I take a different view - I celebrate the fact the Suns had a really strong academy haul.\"\nSwans captains Callum Mills and Chloe Molloy flanked Harley on Wednesday as the club celebrated its milestone anniversary and a membership that has gone above 70,000.\n\"If we can get up to 75,000 ... double-digit growth, that would be as significant a spike growth as we've had in the (last) 40 years,\" Harley said of the club's aim for 2024.\nHe added the large crowds attracted to the SCG and Henson Park for AFL and AFLW games were important elements for the club's ongoing success.\nSydney are two-and-a-half games clear at the top of the AFL ladder, while the women dominate AFLW crowd averages.\n\"Chloe often talks about (being) out on Henson Park, standing next to an opposing player. They turn to you and say, 'Chloe, do you normally get this many people go to your games?'. It matters to the players,\" Harley said.\n\"We feel like we're a significant part of the sporting landscape of Sydney.\"\nThe Swans will host Collingwood at North Sydney Oval on August 30 in the AFLW season opener.\n\"Your premiership is your pinnacle, but if something closely follows underneath it would have to be that,\" Molloy said of the crowds.\nMills remains sidelined by the shoulder injury he suffered when he wrestled a teammate last year on Mad Monday.\nThe star onballer had no update on when he might return, saying he is in a training block and his progress will be reassessed in a few weeks.\nAustralian Associated Press",
  "word_count": 463,
  "scraped_at": "2026-02-14T13:30:11.669909"
}