{
  "article_id": "c8c04ccda097",
  "url": "https://www.broomfieldenterprise.com/2026/01/29/ochs-family-a-legacy-and-the-children-who-pass-it-along/",
  "title": "The Ochs family , a legacy and the children who pass it along",
  "date": "20260130T054500Z",
  "domain": "broomfieldenterprise.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Years before he became the starting quarterback at Fairview High School — the high school All-American whose star power was eventually dimmed by concussions at the University of Colorado — Craig Ochs was the new kid in Boulder.\nHe had just met the most beautiful girl he’d ever seen.\n“It was winter break of my seventh-grade year,” Craig recalled. “The first weekend of being in Boulder, I went to Sunday school and I was the new kid just kind of sitting alone. And out of the corner of my eye this pretty girl approaches me and introduces herself.”\nIt was Jessi Burgener. Later, Jessi Ochs.\nShe would go on to create her own athletic legacy, becoming the first student at Fairview to letter in three varsity sports. Craig was a grade behind her, unaware then of what lay ahead.\nThe two fell in love on Homecoming Night in 1997. They married in 2004 and had four children together.\nIn January 2024, however, Jessi died from a sudden respiratory illness.\n“It rocked our worlds. Rocked my world and, of course, the kids’,” Craig said. “I always tell people the hardest part as a spouse — yes, you mourn and you’re in so much pain — but you can deal with that. What I couldn’t do was take the hurt away from the kids. The hardest part was seeing them hurt.”\nOn Tuesday, Craig, the once-upon-a-time sports star, took his place on the purple bleachers at Holy Family High School, assuming only the role of dad.\nHe was there to watch his son Trevor, a junior, play basketball for the visiting team, Fairview. Craig’s father was also there, and the two watched as Trevor’s Knights scrapped and fought in a tough 41–39 loss.\nTrevor played great, his coach said, even on a night he didn’t score as much as usual. But he had a game-tying 3-pointer rim out in the final minute and a potential game-winner come up just short at the buzzer.\n“He’s the ultimate competitor, but he’s also very level-headed,” Trevor’s coach, Andre Goldberg said after the game. “Whether shots fall or not, he just continues to play hard.”\nTrevor, who is averaging 13.3 points, five rebounds and three assists per game, is a big reason the Knights remain solidly in the Class 6A playoff picture with eight games remaining.\nBut it’s the things he does without the ball that may matter most.\n“He just has the best family,” the coach went on. “Parents, grandparents — just great people. And Trevor is a great person as well. It’s infectious when you have somebody like that on your team.”\n“He gets that from his mom,” Craig said.\nAnd though Jessi’s not here, the Ochs keep her close. Even tougher than Ochs is their Christian faith. Jessi led by example, Craig said.\n“She saw herself as a Christian first,” he said. “But ultimately, of course, as a mom and wonderful wife.”\nCraig and Jessi leaned on that faith well before children.\nCraig’s football career may have been hard to accept without God.\nOut of Fairview, Craig made an immediate impact with the Buffs. He was the team’s promising, young starting quarterback, but he couldn’t stay on the field. He had multiple concussions before losing the starting job.\nAll of it left him in an unknown place. He’d always wanted to be a Buff, growing up in Colorado Springs with two CU grads as parents. Luckily, he said, he had Jessi by his side.\nHe decided to transfer out of Boulder. With the way today’s transfer portal rules are, he said he’d probably have gone to the University of Washington to join former Buffs coach Rick Neuheisel, who led the recruiting efforts for Ochs. Or even the University of California.\n(Luckily, it wasn’t Cal).\n“I’m sitting down with a coach, nice guy,” Ochs said. “He’s like, ‘We got this freshman named’ — and I hadn’t heard about him yet. But, he said, ‘We also got this junior college kid who we think might be pretty good. His name is Aaron Rodgers.’”\nCraig would have had to sit out for at least a season if he chose a Division I FCS program. Instead, he moved to Division I-AA Montana, where he led the Grizzlies to the national title game and put himself on NFL teams’ radars.\nCraig said he heard chatter that he could have been drafted as high as a fourth rounder. His history of concussions ultimately dispelled that, however, and he went undrafted.\nHe made his way into the NFL anyway, signing first with the San Diego Chargers. At the time, the Bolts were still figuring out which future star QB they’d hand the franchise to, Philip Rivers , or Drew Brees. But Ochs was cut before they did.\nThe next season, 2006, was his last. He signed with the Buffalo Bills, who sent him to Frankfurt, Germany, to play in the NFL’s former developmental league. “Verjüngen” is German for “rejuvenate,” and that’s what he did there for his career. At least, so everyone thought.\nHe led the Galaxy to a 7-3 record and a World Bowl title. Yet what could’ve been a story of how perseverance can pay off, didn’t play out that way. Late in the championship game, Craig was tackled, landed on his shoulder and broke his collarbone. His pro football career was done.\n“Jessi at the time was pregnant with Lucy and I had a coaching job sitting for me in Montana,” said Craig, who passed on NFL offers the following season. “And I really thought at that point in my life I wanted to go the coaching route.”\nCoaching didn’t stick. Craig and Jessi’s role as parents, happily, did. Watching Jessi be a mom was one of the best parts, Craig said.\nFor as good as Jessi was as an athlete, Craig explained, she never labeled herself as that, truly knowing what was important in life. She told her kids they’re much more than athletes as well.\nBut she could’ve labeled herself that. A great one, too. Jessi lettered 12 times across three sports at Fairview — soccer, basketball and softball. At CU, she played soccer but also had the chance to play for the women’s basketball team. Ceal Barry, the Buffs’ legendary hoops coach, reached out to her to possibly join the team.\nIn the end, Jessi attended a few practices but chose to stick to just soccer.\n“I always tell people, Deion was a pretty good two-sport athlete,” Craig said, speaking of the Buffs’ football coach Deion Sanders. “And I tell the kids, for a second there, your mom was a pretty good two-sport athlete as well.”\nThe Ochs’ oldest, Lucy, was a standout soccer player at Fairview who is now a freshman studying journalism at the University of Kansas.\nThe other three Ochs children are still home — one in high school, one in middle school and the other in elementary.\nTrevor has already made a name for himself on the court. He and sophomore Gus Van Matre give the Knights reason for optimism both now and in the future.\n“I think since the summer us as a team realized we could be really good,” Trevor said. “I think a bunch of people just fit into spots and we all really want each other to succeed.”\nToday, Craig works at an industrial company.\nHe said he and his kids have received a lot of support from extended family and the Boulder community since Jessi’s passing, including the local schools Fairview, Eisenhower Elementary and Platt Middle School.\nHe sees his wife every time he looks at his kids.\n“The one thing that flows through all of them is kindness,” Craig said. “They’re kind and they look out for people. And those qualities were 100% instilled by Jessi.”",
  "word_count": 1302,
  "scraped_at": "2026-02-14T13:23:16.061952"
}