{
  "article_id": "c8dcfd1e74a7",
  "url": "https://www.90min.com/leah-williamson-arsenal-setting-standard-renee-slegers",
  "title": "Leah Williamson : Arsenal  setting the standard  under Renee Slegers",
  "date": "20241219T123000Z",
  "domain": "90min.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Leah Williamson: Arsenal 'setting the standard' under Renee Slegers\n- Arsenal top their UEFA Women's Champions League group\n- The Gunners triumphed 3-2 over Bayern Munich at Meadow Park\n- Leah Williamson speaks to 90min following the 'dramatic' game\nArsenal defender Leah Williamson says the side are 'so happy coming into work' after an emphatic 3-2 victory over Bayern Munich in the UEFA Women's Champions League.\nThe north-London fans were treated to a European masterclass under the lights of Meadow Park as a late penalty from Mariona Caldentey shot Arsenal up to the top of their group standings.\nSpeaking to 90min after the match, Williamson spoke on the momentum Arsenal have gained under the interim management of Renee Slegers.\n\"Momentum creates momentum,\" said Williamson. \"We are setting a standard and trying to go higher. It is much easier to review and pick at your performances when you are winning. You win, you can rotate the team, good scorelines, everyone gets their rightful minutes because everyone deserves to play and then you move on.\"\nDespite taking the early lead, Arsenal had to make up the ground in the second half after Bayern Munich went 2-1 up inside of 58 minutes. The defender said that despite the deficit, she knew the Gunners would get back into the game.\n\"With this team at the minute, I always feel like we’re going to score, even when we’re not playing the prettiest football,\" Williamson admitted. \"That turnaround, everyone being accountable and stepping up and doing their jobs. My job in the end is to make sure they don’t score again and then the other girls have the freedom to do what they needed.\"\nA scheduling blunder meant that the women's team were moved out of Emirates Stadium to account for the men's match being played against Crystal Palace in the Carabao Cup. Despite the controversy that surrounded the decision, the Arsenal faithful were sure to make Meadow Park a cauldron on the night.\n\"I think it is really special,\" Williamson praised. \"You play teams sometimes and they are notorious for having a really good set of away fans or there are certain teams you want to play because you want to experience their atmosphere- I think we are one of those teams now.\n\"It is incredible and it only dawned on me in the warm-up when I couldn’t hear myself think. This ground allows that, we’re very close to them [the fans], we can feel them and you want to give back to the fans, especially when they’re that close and you can celebrate with them. It feels a lot nicer than just winning.\"\nAfter a harrowing 5-2 loss at FC Bayern Campus in the reverse fixture, the fight that the Arsenal side had at Meadow Park was a stark comparison. Since taking charge as interim head coach, Slegers has led the Gunners on an eleven game unbeaten streak.\n\"When you don’t have a set manager and you have an interim, everyone becomes more accountable and everybody has to step up,\" added Williamson. \"Everybody is pulling their weight a bit more and maybe we needed that.\n\"You’ve seen a different side because we as players have taken more responsibility and she [Slegers] has just encouraged everyone to be themselves. We found a way that fits everybody and taken advantage of that.\"\nThe England defender laughed when asked whether or not she thinks Slegers should be awarded the permanent job: \"I am so happy coming into work, but I am so happy it is not my decision or not my role.\"",
  "word_count": 595,
  "scraped_at": "2026-02-14T12:48:46.535372"
}