{
  "article_id": "c8e58fffc3d5",
  "url": "https://www.fourfourtwo.com/team/everton-boss-admits-to-emotional-week-and-canteen-smiles-after-major-dugout-change",
  "title": "Everton boss admits to  emotional  week and  canteen smile after major dugout change",
  "date": "20260205T211500Z",
  "domain": "fourfourtwo.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Everton boss admits to 'emotional' week and 'canteen smiles' after major dugout change\nScott Phelan takes interim charge of Everton Women after Brian Sorensen’s sacking, admitting it has been an emotional 24 hours for players and staff\nThe best features, fun and footballing quizzes, straight to your inbox every week.\nYou are now subscribed\nYour newsletter sign-up was successful\nWant to add more newsletters?\nFive times a week\nFourFourTwo Daily\nFantastic football content straight to your inbox! From the latest transfer news, quizzes, videos, features and interviews with the biggest names in the game, plus lots more.\nOnce a week\n...And it’s LIVE!\nSign up to our FREE live football newsletter, tracking all of the biggest games available to watch on the device of your choice. Never miss a kick-off!\nJoin the club\nGet full access to premium articles, exclusive features and a growing list of member rewards.\nNewly-appointed Everton interim boss Scott Phelan met his players for the first time on Thursday, following Brian Sorensen’s shock sacking this week.\nA difficult season has left the Toffees ninth and just four points above bottom-placed Liverpool and, despite a first home win at the weekend, Everton dismissed the Danish coach, who had been in charge since 2022.\nUnder-18s coach Phelan has stepped up on a temporary basis and, speaking at his first press conference since the appointment, admitted the last 24 hours had been emotional for players and staff.\n'Emotional 24 hours' at Everton following Sorensen's shock sacking\nDespite a first home win at Goodison Park against Aston Villa last weekend, the victory was just their third of the Women's Super League season, leaving much cause for concern.\n“There's obviously been a lot of emotion in different ways over the last 24 hours or so,” Phelan said. “So it was important we had our first step of getting to know each other, introducing ourselves and then making the players understand what they can expect from us as a coaching staff, but also what we will expect from them moving forward.\n“We just want to win games of football and become a winning team again. We should be doing a little bit better than maybe we have done over the course of the season. What I’ve seen in training today has encouraged me to suggest there are plenty of promising moments that could arrive between now and the end of the season.\n“We want the team to be confident and play with freedom and bravery. And ultimately, we've told them to enjoy. The ambition is simply to win games of football and win more than we've been able to do so far this season.”\nThe best features, fun and footballing quizzes, straight to your inbox every week.\nPhelan has longstanding ties to Everton, having previously been at the club as a youth player and young professional before returning to coaching role in the academy, experience he believes has set him up to take on this role at this pivotal time.\nAs well as positive signs on the training pitch, Phelan said there were encouraging signs off the pitch as well in terms of the players’ moods.\n“Off the pitch and around the canteen, there's been plenty of happy, smiley faces,” he added. “And that is always a good indicator that maybe people have enjoyed what's happened today on the pitch.”\nGet VIP Everton tickets HERE with Seat Unique!\nEverton's new Hill Dickinson Stadium at Bramley-Moore Dock features a state-of-the-art Premium Experience. The packages, available for the 2025/26 season, will offer prime pitch views and easy movement between seats and lounges, ensuring a top-tier, seamless, and luxurious matchday environment consistent with the club's ‘Nothing but the best’ motto.\nEverton travel to face London City Lionesses this weekend for Phelan’s first game in charge.\nAsked to share a fun fact about himself, he laughed: “I'm not too sure if I'm a fun guy. But actually, if we get three points on Sunday, that will be fun.”\nAyisha Gulati is the women's football writer at FourFourTwo. Fresh from a summer covering the Lionesses’ triumphant Euro 2025 campaign in Switzerland, she brings a passion for all things WSL, UWCL, and international women’s football. She has interviewed names including Alessia Russo and Aitana Bonmati and enjoys telling stories that capture the excitement on and off the pitch.\nYou must confirm your public display name before commenting\nPlease logout and then login again, you will then be prompted to enter your display name.",
  "word_count": 745,
  "scraped_at": "2026-02-14T13:23:10.406538"
}