{
  "article_id": "c8ff954ae448",
  "url": "https://www.portstephensexaminer.com.au/story/8899772/nnswf-npl-magic-seal-charity-shield-with-5-0-triumph/?cs=305",
  "title": "NNSWF NPL : Magic seal Charity Shield with 5 - 0 triumph | Port Stephens Examiner",
  "date": "20250224T020000Z",
  "domain": "portstephensexaminer.com.au",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Broadmeadow Magic coach Jimmy Cresnar was after a response.\nSubscribe now for unlimited access.\nor signup to continue reading\nCresnar was \"a little disappointed\" with the way the Northern NSW NPL champions opened the new season, wasting a number of opportunities in a 1-0 loss to Edgeworth.\nHis players delivered in spades on Sunday, thrashing fellow heavyweights Lambton Jaffas 5-0 at Magic Park.\nTheir opening goal in 10th minute set the tone.\nJack Simmons won possession inside the Magic half. Two passes later James Cresnar (junior) made a run into the box and turned a Jared Baker cross past keeper Ben Kennedy.\nThe midfield quartet of Jeremy Wilson, Cresnar, Simmons and Bailey Wells picked the visitors apart.\nBaker doubled the advantage in the 30th minute and Simmons added a third three minutes later. Game over.\nThe home side were a yard faster than the Jaffas right across the field.\nThey played with urgency, forced turnovers and moved the ball with pace and precision.\nWells got in on the act three minutes into the second half, pouncing on another turnover, before replacement Jayden Stewardson (77th minute) completed the rout with his first touch.\n\"It was a great performance, a real team performance,\" Cresnar said. \"We were a little disappointed with the performance against Edgeworth.\n\"Today we were much better. Our quickness and how effective we were going forward was tremendous. The first three goals were transition moments.\n\"We worked on that - how quickly we could break the lines and, more importantly, the runs into the box.\"\nJaffas entered the game without former A-League centrback Nikolai Topor-Stanley (calf) and then lost fellow defender Tom Waller (calf), Jimmy Oates (knee) and Riley McNaughton (quad) to injury.\n\"We are a bit busted but that is no excuse. We were down 2-0 after 30 minutes,\" Jaffas' coach Dave Tanchevski said. \"Magic were very sharp. They were at their best today and we were probably at our worst. \"\nMagic's win secured the Charity Shield and more than $4000 was raised at the ground for the Westpac Rescue Helicopter Service.\nIn the late game Sunday, defender Jye Rodway scored in the 94th minute to snatch Newcastle Olympic a 2-all draw with Weston at Darling Street Oval.\nOlympic, who were without marquee signing Roy O'Donovan, appeared dead and buried down 2-0 at half-time.\nCooper Buswell put the Bears ahead in the 43rd minute and Blake Archbold doubled the advantage in the third minute of stoppage time.\nThat is how it stayed until the 65th minute.\nKale Bradberry punched at the back post to give the home side a lifeline.\nOlympic sent wave after wave of attack at the Bears' goal. They finally cracked when Rodway burst into the box and hit a low volley.\nElsewhere, Adamstown, who avoided relegation in last year's play-offs, posted their first competition win since June 18 last year when they beat Valentine 3-2 at Adamstown Oval on Friday night.\nValentine's Carter Smith opened the scoring in the 55th minute but Adamstown scored two goals in four minutes through William DeVitis then Taj Buck to lead 2-1 by the 67th minute.\nRosebud captain Dino Fajkovic made it 3-1 with a length-of-the-field effort in the 85th minute before Toby Jensen scored from the penalty spot for Phoenix in the 89th minute after being pulled down in the box by Dane Lawther.\nOn Saturday, Cooks Hill were 2-1 winners over Maitland at No.2 Sportsground, Charlestown beat New Lambton 3-0 at Lisle Carr Oval and newcomers Belmont Swansea continued a dream return to top-flight football when they drew 1-1 with Edgeworth at Blacksmiths Oval.\nGoalkeepers were a talking point of NPL Women's action over the weekend.\nOn Friday, New Lambton coach Aaron Stedman urged Northern NSW Football to review its rules around signing injury replacements amidst a goalkeeping crisis at the club. Golden Eagles centre-back Amy Gosling donned the gloves against Maitland at Cooks Square Park on Sunday.\nOn Saturday night, Adamstown goalkeeper Olivia Sneddon's rugby league-style tackle on Broadmeadow striker Cassie Corder at Lake Macquarie Regional Football Facility proved a topic of conversation.\nMagic led 3-2 when Sneddon tackled Corder from behind in the 18-yard box in the 82nd minute. Sneddon had been stranded high while Corder chased a long ball into area. The Magic striker had already put her shot wide of the goals when Sneddon made contact.\nA penalty was awarded and Sneddon was issued with a yellow card.\nLarissa Ryan scored from the spot for the second time to seal Magic's 4-2 win.\nMarion Dunbabin gave Rosebud a 1-0 lead in the 20th minute but Lilly-Jane Babic equalised in the 31st minute before Ryan converted a penalty two minutes later after being felled in the box.\nBabic doubled down in the 37th minute but Tanya Jones made it 3-2 on the stroke of half-time with an Adamstown penalty after she went down in the area.\nNewcastle Olympic beat newcomers Lake Macquarie 5-2 at Lake Macquarie Regional Football Facility on Friday night.\nPremiers Maitland accounted for New Lambton 3-1 at Cooks Square Park on Sunday afternoon.",
  "word_count": 844,
  "scraped_at": "2026-02-14T12:49:43.351827"
}