{
  "article_id": "c917c0e9fd5d",
  "url": "https://www.spectator.co.uk/article/can-anything-stop-reform/",
  "title": "Can anything stop Reform ? ",
  "date": "20250724T001500Z",
  "domain": "spectator.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "A close associate of Nigel Farage received phone calls from three civil servants in the past week, asking how they might help Reform UK prepare for government. Officially, mandarins won’t begin talks with the opposition until six months before a general election, which might be nearly four years away. And Reform currently has just four MPs. But behind the scenes, the source reveals: ‘I’m personally getting middle-ranking civil servants in various departments asking if they can help – people who actually understand how to get things done. They don’t want to lose their jobs, but they want to tell us what’s going on.’\nMPs may have departed Westminster for recess, but that also marks the firing of a starting gun on a highly consequential political summer. In Downing Street and the Treasury, work is under way on Sir Keir Starmer’s party conference speech, the next Budget and a reorganisation of No. 10, in what’s seen as a vital reset after Labour’s turbulent first year in power. The government is facing two political onslaughts. The first is from Reform on crime, as Farage’s six-week campaign, launched on Monday, promises ‘zero tolerance’ policing, ‘nightingale prisons’ and 30,000 new police officers. The second is from the Tories on the economy, as the Treasury prepares for tax rises this autumn.\nThe question is no longer ‘Could Reform win?’ but ‘Can anything stop them?’. The expectation is that Farage’s party will pick up thousands of seats in the Welsh, Scottish and local elections next May and emerge as the largest party in 2029. ‘The polls are much stickier than we expected,’ a Reform source says. ‘We could be the next government.’ They are optimistic of winning in Wales and making gains in outer London boroughs next year and are eyeing councils in Norfolk, Suffolk, Hampshire, Coventry, Dudley and Tameside.\nOne answer to what can stop Farage might once have been Farage himself, whose intensity used to waver between elections. Now allies describe a man for whom a working day of 4.30 a.m. to 11 p.m. is not unusual. ‘All his bodyguards are ex-SAS and parachute regiment and they’re knackered trying to keep up,’ one friend says. ‘He spent three days preparing for that crime press conference so he was across the detail. There is a seriousness there. Does he want to be prime minister? I’m not sure he does. But he feels: if not him, then who? He feels it’s his duty, and perhaps his destiny.’\nFarage’s allies point to an incident before his return to frontline politics last year, while he was campaigning in Skegness. ‘This guy said to him: “Thank you for coming here, Nigel, but why are you letting us down?” You could see Nigel’s eyes go down. He knew he needed to get back in and fight for these people.’\nAnother answer might once have been the sense that Reform is a ‘boys’ club’ – yet at his press conference on Monday Farage was flanked by the Reform MP Sarah Pochin, a former magistrate, and Laila Cunningham, a Westminster councillor and ex-prosecutor who defected from the Tories. On Tuesday he announced the defection of Conservative Laura Anne Jones, now the party’s first member of the Welsh Senedd. ‘We used to be testosterone city,’ says an insider, ‘but these women are not window dressing.’\nA third answer might once have been media scrutiny by the centre-right press, whose loyalties tended to lie with the Tories. In 2019, the Daily Mail harangued Farage to back Boris Johnson to ‘save Brexit’. Yet Farage met senior media figures for ‘peace talks’ and coverage is now much friendlier. Farage (hotfooting it from Royal Ascot) turned up wearing union jack shoes at the summer party held by News UK, which owns the Sun, the Times and the Sunday Times, and also dined recently with Victoria Newton, the Sun’s editor. Reform sources say that Rupert Murdoch ‘has always liked Nigel because they are both disruptors’. Paper insiders say Murdoch is attracted to backing Reform, though his son Lachlan, the titular head of the company, is both less interested in British politics and less convinced by Farage. Newton apparently urged Farage to show that he is taking preparations for government seriously. ‘Nigel doesn’t need to be told these things,’ a close ally notes.\nFarage’s nemesis could still be the Labour government with its huge majority. But he’s not alone in being urged to get serious. ‘There have been a procession of people, including Tony Blair, telling Keir “This isn’t working”,’ says one of those advising him. ‘He needs far more good people around him and he needs to get serious about being prime minister and not just assume everything is going to turn out fine. He needs to use his power, not just occupy it.’\nThe PM’s chief of staff, Morgan McSweeney, has three priorities for the summer and autumn: getting Starmer’s conference speech and the Budget to tell the same ‘story’ about what Labour is about and where it wants to take the country; getting the best people into No. 10; and improving relations with the parliamentary party.\nA No. 10 reorganisation is coming, along with a reshuffle, probably in September. McSweeney is studying a report by Nathan Yeowell of the Future Governance Forum and Helen MacNamara, the former deputy cabinet secretary (published in mid-August), which recommends the creation of a new Downing Street department, with its own chief operating officer. Some would like to see MacNamara – the one official whose brains and cunning Dominic Cummings rated alongside his own – return to government.\nThe reorganisation is intended, in part, to bypass Sir Chris Wormald, the cabinet secretary, who is seen both as a block to reform and as the PM’s most perverse appointment. ‘They can’t fire him,’ explains an exasperated ally. ‘They’re just having to find ways to work around him.’\nWormald’s critics are busily sharing two stories. The first is that he told another official how to bamboozle politicians by going into every meeting ‘with a few QI points’ – fascinating facts like those presented on the comedy quiz programme – to divert attention. The second is that he tried to impose Jeremy Pocklington, the permanent secretary at the Department of Energy, on the Ministry of Justice, against the wishes of Lord Chancellor Shabana Mahmood, because Pocklington needed the experience if he was to become cabinet secretary one day. This reinforced the idea that Wormald is more interested in civil service careerism than getting the best people to drive political change. Mahmood won the day.\nAnother key appointment will be an economics adviser for Starmer, a job which still lies vacant. There is talk of Torsten Bell, the pensions minister, taking the role, but others want a bigger hitter. Former Treasury mandarins Jon Cunliffe, Tom Scholar and John Kingman are all on the wish list. ‘It has to be someone who can speak with authority to the Chancellor,’ says one senior aide.\nStarmer’s critics will also have a close eye on his policy team, a frequent target of disapproval. Liz Lloyd, a Blair-era retread who runs delivery, led policy discussions at a recent cabinet away day. But ministers say her views differ from those of Olaf Henricson-Bell, the civil service policy chief, and Stuart Ingham, the PM’s longest-serving aide, who many see as a problem. ‘[Ingham’s] great at having a conversation about the history of progressivism, but he’s not right for a government which needs snappy ideas that deliver,’ a senior Labour figure says.\nIf Starmer fails to sort all this out, then not only will he be unable to face down Farage, he might even have to confront a leadership challenge. While Angela Rayner is the favourite, both Andy Burnham and Sadiq Khan, the mayors of Manchester and London, are expected to make returns to parliament with half an eye on the succession.\nLabour strategists are acutely aware that the party’s annual conference is in Liverpool, where Hillsborough campaigners (supported by Burnham) still aren’t happy with the government’s plans to impose a ‘duty of candour’ on public servants to avoid a cover-up like the one which followed the deaths of the football fans. ‘If they don’t sort out Hillsborough, Andy will kill them at conference,’ says one MP.\nCould the Tories prove a thorn in Farage’s side? The return of James Cleverly to the front bench in Kemi Badenoch’s reshuffle this week gives the Tories another good media performer, but most of the others promoted are barely household names in their own households. Party membership has fallen by 8,000 since she became leader. At a summer party for Politico last week, one of her senior aides had a drink-fuelled argument with two former cabinet ministers over their demands for her to ‘step it up’.\nThe appointment of Neil O’Brien, one of the brightest brains in the party, as policy chief was widely welcomed by Badenoch’s critics. But the decision to make plain-speaking Yorkshireman Kevin Hollinrake party chairman was interpreted as evidence that Conservative Campaign Headquarters (CCHQ) is still not match-fit for the local elections. His predecessors, the co-chairs Nigel Huddleston and Dominic Johnson, are both said to have contemplated resignation in recent months. ‘The operation is a shitshow,’ says one former CCHQ hand. ‘They had so little power and were sick of carrying the can for failure.’ Another former aide is circulating details of a recent focus group in which Badenoch was described by one voter as ‘repulsive’.\nSo what might stop Farage? The best answer might be Reform themselves. Nick Candy, the treasurer, has not raised the millions he promised. Insiders say he has been distracted by his divorce from TV actress Holly Valance. ‘She was more political than him,’ a party source admits. ‘Money is tight.’\nThen there are the internal rivalries, which burst into the open again last week when Zia Yusuf, the former chairman, went public to accuse Suella Braverman, the former Home Secretary, of ‘covering up’ the decision to grant a superinjunction to hide the leak of data on Afghans who worked for Britain. Her husband, Rael Braverman, who defected from the Tories to Reform several months ago, resigned in disgust. ‘Suella was quite close to defecting,’ a source says. ‘Rael urged Zia to take it down and he doubled down.’\nFarage, in short, is not without his internal party problems and he might yet succumb to external attacks. ‘Nigel is at the “could” be the next government stage rather than the “will” be stage,’ an ally notes. But while it may be a long-distance race until the next general election, Reform remains the pace-setter of British politics.",
  "word_count": 1769,
  "scraped_at": "2026-02-14T12:12:31.572227"
}