{
  "article_id": "c921cc07c333",
  "url": "https://punchng.com/where-are-the-safe-hands/",
  "title": "Where are the safe hands ? ",
  "date": "20230831T010000Z",
  "domain": "punchng.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "The days when Nigerian goalkeepers were feared in Africa are gone. These were days of the likes of Peter Fregene, Okala brothers Emmanuel and Patrick, Best Ogedengbe, Peter Rufai, Aloy Agu, David Ngodigha, Iks Shorunmu, Dosu Joseph, Vincent Enyeama, Austin Ejide, Dele Aiyenugba, Carl Ikeme amongst others.\nThese keeper’sanned the Super Eagles posts from different generations spanning from the 1960s to the as recent as 2016, when the impressive Ikeme, who had just 10 caps, had his career cut short by leukaemia.\nHowever, these days, anytime an Eagles list is released, there is usually an iota of doubt over the prowess of the men in between the sticks.\nThis is not because the country doesn’t have talents in that department, but it is due to the sheer inconsistency that has characterised the performances of these goalkeepers for the national team.\nAs a result, Nigerian fans keep demanding for new names to be invited.\nSome even joked that Super Falcons safe hands, Chiamaka Nnandozie, be drafted into the men’s national team to solve the team’s goalkeeping problems following her fantastic showing at the recent 2023 Women’s World Cup in Australia and New Zealand.\nWhile Nigeria’s outfield players were prominent in the European transfer market this summer, the keepers were inactive, except for Maduka Okoye, who moved from English side Watford to sister club Udinese in the Italian Serie A.\nPUNCH Sports Extra x-rays some of the top goalies, home and abroad, and how they’ve performed recently\nAmas Obasogie (Bendel Insurance)\nThe Insurance keeper has been consistent for his club since 2019, keeping eight clean sheets last term during the regular season. Hardly showing any signs of pressure during their games, he has also proven to be a penalty specialist, as he saved two (one in regulation time and another in the shoutout) in a tense game against ASO Chlef in Algeria to help Insurance progress into the next round of the CAF Confederation Cup.\nKayode Bankole (Remo Stars)\nFor two consecutive seasons, Bankole has kept the most clean sheets in the NPFL, keeping nine during the regular season last term. He has been part of the Super Eagles B in recent times and a step up into the main team for the Remo shot stopper will leave him with the task of keeping up with his eye-catching saves.\nOjo Olorunleke (Enyimba)\nA long-time goalkeeping prospect on the domestic scene, Olorunleke appeared to be stepping into the big shoes when he was called up for the Eagles clash against Sierra Leone last June. Although he didn’t get a chance, the new Enyimba captain still has a lot to prove in order to be deserving of a chance in the national team.\nVictor Sochima (Rivers United)\nSochima has been in the Eagles mix twice and didn’t also get a chance. His consecutive invitations makes him seem like yhe go-to player for the ‘NPFL slot’ in the Eagles set up, but if anything will change about getting a chance, the Rivers man must keep rising up to the occasion at club level.\nAdebayo Adeleye (Hapoel Jerusalem, Israel)\nAdeleye won the hearts of Nigerians for his performance in the last AFCON qualifier against Sierra Leone in June. Although he conceded two goals, Adeleye showed flashes of his goalkeeping prowess, which earned him praise just as he was finally glad to have made his mark in the hard-fought 3-2 win. Since returning to his club for the new season, Adeleye keeps his place as the club’s first choice, after he kept eight clean sheets in 20 matches last season.\nFrancis Uzoho (Omonoia, Cypriot)\nSince impressing against Argentina during a pre-World Cup friendly in 2017, which the Eagles won 4-2, many felt the team’s goalkeeping issues were over.\nHowever, Uzoho has not been unable to produce that stunning performance since he sustained an injury against Brazil in a friendly in 2019.\nUzoho was the Eagles first choice at the 2018 World Cup in Russia, playing all three games against Croatia, Iceland and Argentina as the Eagles crashed out from the group stages.\nHe was also at the 2019 Africa Cup of Nations in Egypt, where he only played one out of seven games, the third-place match against Tunisia, which the Eagles won to clinch the bronze medal. Just over two years later, Uzoho was at another AFCON, this time Cameroon 2021, and he only played one game as Nigeria got knocked out in the round of 16.\nUzoho has played 29 games in total for the Eagles, conceding 29 goals, an average of one goal conceded per game, while keeping 11 clean sheets.\nThe 24-year-old won the Cypriot Cup with Omonia in May and kept 15 clean sheets last season, thus attracting interest from Ligue 1 side Stade Rennais.\nPerhaps, this is a sign that the tall shot stopper is still improving and may yet step into the role of a world-class keeper.\nMaduka Okoye (Udinese, Italy)\nSome tagged him ‘fine boy of Nigerian football’ but Okoye has been unable to repay the faith Nigerian fans had in him, when he first filed out for the Eagles, against Brazil in an international friendly October 13, 2019.\nInterestingly, Okoye had an impressive debut, when he replaced the injured Uzoho in the high-profile friendly, keeping a clean sheet in the 1-1 stalemate.\nHowever, it has all gone downhill from there.\nMost notably at the 2021 AFCON, where Okoye was taunted on social media by fans, when he let in Tunisian Youssef Mskani’s 47th minute goal from outside the box – which looked easier to save – as the Eagles were agonisingly knocked out by Tunisia in their second round clash.\nAfterwards, he was subjected to cyber-bullying, including death threats by the fans. Following the backlash, the former Watford goalie allegedly pulled out of the Eagles Qatar 2022 World Cup final qualifiers against Ghana on account of illness, last March.\nHe also asked to be left out of the team to focus on settling in at his new club (then Watford), after he was called up for the friendlies against Mexico and Ecuador, as well as the 2023 AFCON qualifiers against Sierra Leone and Sao Tome and Principe.\nPeseiro then gave the 23-year-old another chance to have a shot at the No.1 jersey during last year’s double-header friendlies against Algeria.\nBut the move seemed to backfire, as his blunder gifted the Algeria B team the opening goal of the 2-2 draw.\nAt club level, Okoye made a name for himself at Dutch side Sparta Rotterdam but endured a torrid time in England, where he amassed two appearances for Watford in the 2022/23 season, one in the Carabao Cup and the other in the FA Cup.\nHe is now set to revive his career after a quiet and difficult time in England with a move to Serie A club Udinese.",
  "word_count": 1139,
  "scraped_at": "2026-02-14T13:09:59.962705"
}