{
  "article_id": "c9881aa64edb",
  "url": "https://www.mirror.co.uk/3am/celebrity-news/mary-earps-heartbreak-lionness-left-31719894",
  "title": "Mary Earps heartbreak as Lionness left  feeling invisible  and sobbing on kitchen floor",
  "date": "20231220T184500Z",
  "domain": "mirror.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Mary Earps heartbreak as Lionness left 'feeling invisible' and sobbing on kitchen floor\nThe goalkeeper has seen her fortunes change after she was selected to play for England and then scooped the coveted BBC Sports Personality of the Year award after struggles\nFootball star Mary Earps has won new fans after being crowned the BBC’s Sports Personality of the Year - but her life hasn’t always been rosy.\nThe 30-year-old goal keeper was overwhelmed when she was awarded one of the year’s most coveted awards - having helped the England women’s team make it all the way to the 2023 FIFA Women's World Cup final thanks to her incredible ball catching skills. And while the team ultimately lost out to Spain in the final, Mary was crowned the winner of the Sports Personality of the Year award on Tuesday night.\nEarlier this year, Mary became a household name after a scandal emerged over England women’s football shirts - as Nike failed to make a replica of her World Cup top available for fans to buy, sparking national outrage and a huge petition. The champion player almost gave up her beloved sport as she feared she was ‘invisible’ as a goal.\nShe explained to ESPN how football manager Sarina Wiegman finally made her feel valued and helped keep her in the game. She said: \"I mean obviously, everything that happened sort of pre-Sarina ... I had the floor wiped from under me kind of out of nowhere… So, I had to do a lot of work on myself to sort of figure out what I was going to do next ... I wasn't an England international anymore as far as I was concerned.\nREAD MORE: Revolution's new £7 highlighter is an 'absolutely stunning' alternative to Fenty Beauty's £32 one\"I was playing well for Manchester United and they'd offered me a new contract, but I was sort of feeling like maybe it was time that I had an honest conversation with myself, looked at myself in the mirror. I had a mortgage, I had responsibilities, there was a lot going on where I needed to make sure that I was not putting myself in a difficult financial situation.\n\"I always said when it was time to call it time, I would be honest enough with myself to say, look, maybe it's just not quite ... maybe it's just not quite worked out, you know, you've given it your best and it's OK to fall short. But then Sarina came in and my whole world changed. She just basically ... I feel like she just saw me.\"\nHer happy ending also came after she was left disheartened when she saw goalkeepers Carly Telford, Ellie Roebuck, Hannah Hampton and Sandy MacIver all picked to represent England ahead of her. She recalled how this prompted her to sink to her kitchen floor and cry. She told the Daily Mail: \"I got to a point where I felt I had sort of reached my limits,' Earps said. 'I had given football a good go, but wasn't quite good enough. I had responsibilities, I had a mortgage and it wasn't adding up.\"\nAfter scooping the prize on Tuesday night, Mary explained how she hopes to change the world through the spotlight her sporting achievements have offered her. She told BBC Radio 5 Live: \"I'm trying to be a game changer.\n\"I'm trying to change the world in whatever small time that I'm here. I enjoy the responsibility of being a role model, I try to inspire as many people as possible - young, old, whatever. I want people to relate to me and my journey, see that I'm just a normal person trying to live out her dream.\n\"I'm trying [to make goalkeeping cool]. It's happening, it's happening. Slowly but surely - it's the Merps mission. Goalkeeping is cool!\"\nThe sport star was emotional when she was handed her award on Tuesday night. She said: \"Thanks for voting for me everyone! I’m very honoured and humbled, as this is the ultimate all round sporting accolade. We’ve had an incredible couple of years but this is just ‘wow’.\n\"It’s not been the easiest journey and I wouldn't be here without my loved ones in my corner, who have been with me through the really not so great times. The last two years have been unbelievable, I’ve done more than I could have ever imagined. Thank you to my goalkeeping coaches, my team-mates and my coaches.\"\n* Follow Mirror Celebs on Snapchat , Instagram , Twitter , Facebook , YouTube and Threads .",
  "word_count": 764,
  "scraped_at": "2026-02-14T12:46:30.628041"
}