{
  "article_id": "c9ab0534a953",
  "url": "https://www.ariananews.af/messi-named-fifa-player-of-2022-england-women-rewarded-for-euro-campaign/",
  "title": "Messi named FIFA player of 2022 , England women rewarded for Euro campaign",
  "date": "20230228T071500Z",
  "domain": "ariananews.af",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Sport\nMessi named FIFA player of 2022, England women rewarded for Euro campaign\nLionel Messi was named FIFA player of the year 2022 on Monday as Argentina scooped all major men’s awards after winning a vintage World Cup final last December, Reuters reported.\nThe 35-year-old forward scored two goals in the final against France, with the South Americans emerging triumphant on penalties following a 3-3 draw after extra time in Qatar.\n“It’s amazing. It was a tremendous year and it is an honour for me to be here tonight and win this award”, said Messi, who sat next to France forward and Paris St Germain team mate Kylian Mbappe throughout the ceremony at Paris’s Salle Pleyel.\nAccording to Reuters Mbappe, also nominated for the highly anticipated award of the night, netted a hat-trick in the World Cup final but his achievement was overshadowed as Messi finally won the most coveted trophy in world football.\n“I want to express my thanks to (coach Lionel) Scaloni and my team mates, without them I would not be here,” Messi added.\n“I achieved a dream I had been hoping for so long and finally I achieved it. It’s a dream for any player, very few people can achieve that and I was lucky enough to do so.”\nHis compatriots Lionel Scaloni and Emiliano Martinez won the coach of the year and keeper of the year awards respectively, and their supporters even got the best fans prize, while England were rewarded for their victorious women’s Euro 2022 campaign.\nMary Earps was named keeper of the year and England’s Dutch coach Sarina Wiegman received the accolade for best coach of a team who had four players in the year’s World 11 – Beth Mead, Lucy Bronze, Leah Williamson and Keira Walsh, read the report.\nSpain’s Alexia Putellas, who won the Ballon d’Or last year, was named women’s player of the year after inspiring Barcelona to a third consecutive national title in 2022.\nPolish amputee Marcin Oleksy won the Puskas prize for best goal of the year for a spectacular acrobatic volley with Warta Poznan against Stal Rzeszow.\nSport\nWinter Olympics 2026: Wednesday brings records, first-ever golds and thrilling action\nAudiences in Afghanistan have been able to follow all the action live, as ATN holds exclusive broadcast rights to the Winter Olympics, with events aired nationwide on Ariana Television.\nWednesday’s competitions at the 2026 Winter Olympics in Milan-Cortina delivered a packed schedule of medal events, record-breaking performances, and historic firsts, keeping fans on the edge of their seats.\nAcross speed skating, biathlon, luge, figure skating, and other winter disciplines, the day showcased the depth and diversity of talent at the Games.\nSpeed Skating Record\nIn one of the standout moments of the day, Jordan Stolz of the United States captured gold in the men’s 1,000m speed skating, setting a new Olympic record. Stolz’s performance marked a breakthrough on the world stage and established him as one of the sport’s emerging stars.\nHistoric Luge Gold for Italy\nOn home ice, Italian duo Andrea Voetter and Marion Oberhofer made history by winning the first-ever women’s doubles luge gold medal. Their victory delighted local fans and added a memorable chapter to Italy’s Olympic story, highlighting the host nation’s strength in sliding sports.\nBiathlon Brilliance\nFrench athlete Julia Simon claimed gold in the women’s 15km individual biathlon, demonstrating remarkable accuracy and resilience in challenging snow conditions. Her performance underscores France’s continued strength in Nordic disciplines and sets the stage for further excitement in upcoming biathlon events.\nFigure Skating Excellence\nIn ice dance, France’s Laurence Fournier Beaudry and Guillaume Cizeron claimed the top podium spot, while American favorites Madison Chock and Evan Bates earned silver in a tightly contested free dance final. Fans were treated to a display of precision, artistry, and athleticism, reflecting the high level of competition in this marquee Olympic sport.\nWednesday also featured intense competitions in alpine skiing Super-G, Nordic combined, women’s moguls, and doubles luge, keeping spectators engaged across multiple venues. Each event underscored the Olympics’ commitment to showcasing a broad range of winter sports and the exceptional skill of the athletes representing their nations.\nExclusive Coverage in Afghanistan\nAudiences in Afghanistan have been able to follow all the action live, as ATN holds exclusive broadcast rights to the Winter Olympics, with events aired nationwide on Ariana Television. This allows Afghan viewers to witness key moments, record-breaking performances, and historic wins as they happen, bringing the excitement of the Games directly to homes across the country.\nAs the Milano-Cortina Winter Olympics continue, fans can expect more thrilling stories, emerging stars, and unforgettable moments, with each day adding new highlights to a Games already rich in drama and achievement.\nSport\nAFC U17 Men’s Asian Cup Saudi Arabia 2026 Draw sets stage for continental showdown\nThe final draw for the AFC U17 Men’s Asian Cup Saudi Arabia 2026 took place today, Thursday February 12, confirming the group-stage line-up for Asia’s premier youth football tournament and setting the stage for a highly competitive continental battle.\nSixteen teams have been drawn into four groups of four, with each side aiming not only for continental success but also qualification for the FIFA U17 World Cup Qatar 2026. The top two teams from each group will advance to the quarterfinals and secure their places at the global showpiece.\nHosts Saudi Arabia headline the tournament as top seeds, joined by Asia’s leading youth football nations and several emerging teams that impressed during the qualification phase. The draw balanced traditional powerhouses with ambitious newcomers, promising closely contested matches throughout the group stage.\nScheduled to take place from May 5 to May 22, 2026, the 21st edition of the AFC U17 Men’s Asian Cup will once again serve as a key platform for the continent’s brightest young talents to showcase their potential on the international stage.\nWith the groups now confirmed, preparations intensify as teams turn their focus toward tactical planning and squad development ahead of what is expected to be a thrilling tournament in Saudi Arabia.\n- Group A: Saudi Arabia, Tajikistan, Thailand, Myanmar\n- Group B: Japan, Indonesia, China, Qatar\n- Group C: South Korea, Yemen, Vietnam, UAE\n- Group D: Uzbekistan, Australia, India, North Korea\nSport\nAfghanistan’s semi-final hopes hang in the balance after two T20 World Cup defeats\nFollowing two consecutive losses, Afghanistan currently sit third in Group D with a net run rate of -0.555.\nAfghanistan’s campaign in the ICC Men’s T20 World Cup has taken a serious hit after suffering back-to-back defeats, leaving fans concerned about the team’s chances of progressing to the semi-finals.\nFollowing two consecutive losses, Afghanistan currently sit third in Group D with a net run rate of -0.555.\nNew Zealand and South Africa lead the group standings with four points each from two matches.\nWith four matches scheduled per team in the group stage, only the top two sides will advance to the next round.\nDespite the setbacks, Afghanistan have not yet been eliminated from the tournament. However, their path to qualification has become significantly more complicated.\nTo secure a place in the Super 8 stage, Afghanistan must win their remaining two matches against the United Arab Emirates and Canada — and do so by substantial margins to improve their net run rate. At the same time, they will need either New Zealand or South Africa to suffer heavy defeats in their remaining group fixtures.\nIf these conditions are met, Afghanistan could still break into the top two based on a superior net run rate. While the scenario is challenging, qualification remains mathematically possible — keeping Afghan hopes alive in the tournament.\n-\nInternational Sports4 days ago\nIPL 2026: Franchise sales gather pace as global investors circle teams\n-\nSport5 days ago\nEarly medal leaders emerge as Winter Olympics continue in Italy\n-\nLatest News5 days ago\nTerrorist activities observed along Afghanistan borders, says Lavrov\n-\nSport2 days ago\nAfghanistan’s semi-final hopes hang in the balance after two T20 World Cup defeats\n-\nBusiness4 days ago\nUzbekistan approves feasibility study agreement for Trans-Afghan Railway\n-\nBusiness3 days ago\nAfghanistan signs 845MW Power deal with Azizi energy; Baradar meets company Chief to advance investment plans\n-\nInternational Sports3 days ago\nAFC Champions League Elite delivers key results as race for knockout stage intensifies\n-\nRegional5 days ago\nIran arrests at least four reform front politicians",
  "word_count": 1388,
  "scraped_at": "2026-02-14T12:52:08.738251"
}