{
  "article_id": "c9b0cd1fab99",
  "url": "https://www.oakdaleleader.com/opinion/stepping-back-into-the-past/",
  "title": "Stepping Back Into The Past - Oakdale Leader",
  "date": "20250821T213000Z",
  "domain": "oakdaleleader.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "It’s official, so now I can talk about it – I will be part of the cast for the 2025 edition of “Once Upon A Tomb – Tales From Beyond” that will be staged at the Oakdale Citizens Cemetery in early October.\nThis will be the second year for this event and it is a fundraiser for the local cemetery in Oakdale. Last year, it was something that we promoted in the newspaper, providing background information on the characters that were being portrayed and by whom.\nThe focus is on notable people in Oakdale’s history, buried in the cemetery. Each cast member is stationed at the gravesite of their character and gives a little of their history and shares anecdotes about their time here. This year there are seven cast members, three women and four men.\nLast year, watching the program unfold as one of those invited to the ‘preview’ show, I was definitely captivated by it. So much so, that I told the organizers that “I might just have to try out for this next year” and they held me to it. When they had the audition date, I was contacted and told what I needed to do to prepare for the audition. It wasn’t too difficult; memorize a brief monologue – which could be done in a Southern accent or your normal one – and then do some onsite readings, also brief, in front of the audition panel. Those didn’t have to be memorized, just read, with a directive as to whether there was an accent to use or not.\nSo, I went back and forth, should I try out, should I not? But I figured I had nothing to lose and I was always involved in drama in high school. I was usually the stage manager because they were typically musicals and I am not a singer. But a stage manager, right up my alley; I could tell people what to do and where to go and they had to listen to me.\nI also learned everyone’s part and we did some amazing shows that I still remember fondly to this day.\nBut I digress.\nI finally told co-workers Marissa and Michelle about it and Marissa was quickly on the case, downloading a few ‘one-minute monologues’ for me to peruse. The one I chose was a humorous one about my pet rock and his anxiety. I used my best Southern accent, a little drawl, and just had fun with it. My onsite readings were a little more subdued, a little more serious, and they both went pretty well.\nSince there were several females trying out for three available parts, I wasn’t sure what would happen. The day I got a text saying they wanted to offer me a part, I truly was thrilled.\nThey let me know my role – Tomasa Griffith – known as the ‘Tamale Lady of Oakdale’ and I will get my script soon.\nIt was all perfect … until they told me that dress rehearsal is October 3, just ahead of the October 4 performance.\nWell, October 3 is Homecoming in Escalon. I don’t think I have missed Homecoming in Escalon in more than 25 years.\nI was stressed, especially breaking the news to Escalon head football coach Andrew Beam, but I had committed to Once Upon A Tomb before I had the football schedule.\nWe had our cast of characters photo shoot recently and I did learn that my character, Tomasa, happens to be the first stop on the tour. Explaining my “how can I be in two places at once?” predicament to the organizers, I was assured that, once the dress rehearsal watch group had been at my site and I had done my part, I could go.\nHuge sigh of relief.\nI should be able to make it to Escalon in time for the crowning of the Homecoming Queen. And if I forget to change before I head over to Engel Field and show up in 1800’s-style dress, apron and shoes, with my hair gray from spray-in color and wearing round spectacles … well, at least you’ll know why.\nMarg Jackson is editor of The Oakdale Leader, The Escalon Times and The Riverbank News. She may be reached at mjackson@oakdaleleader.com or by calling 209-847-3021.",
  "word_count": 714,
  "scraped_at": "2026-02-14T13:43:01.445446"
}