{
  "article_id": "c9b5923aa5d2",
  "url": "https://www.fcbarcelona.com/en/club/news/4151641/laporta-board-of-directors-and-i-feel-stronger-more-convinced-and-more-determined-than-ever-to-complete-the-clubs-recovery-in-all-areas",
  "title": "Laporta :  Board of Directors and I feel stronger , more convinced , and more determined than ever to complete the club recovery in all areas  ",
  "date": "20241019T153000Z",
  "domain": "fcbarcelona.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Laporta: 'Board of Directors and I feel stronger, more convinced, and more determined than ever to complete the club's recovery in all areas'\n- label.aria.viber Viber\n- label.aria.whatsapp WhatsApp\n- label.aria.twitter Twitter\n- label.aria.facebook Facebook\n- label.aria.messenger Messenger\n- label.aria.link label.aria.tick Copy link\nJoan Laporta opened the FC Barcelona Ordinary General Assembly of Members with the traditional report from the president. He reviewed the overall situation of the club, placing particular emphasis on yet another positive response from La Masia, with fabulous youngsters strengthening the football team, the ordinary profit achieved last season despite having to play at the Estadi Olímpic Lluís Companys, the reduction in the payroll without losing competitiveness, and the excitement surrounding the return to Spotify Camp Nou and the celebrations of the 125th anniversary.\nLaporta started his speech by highlighting that the idea of an online assembly is more economically sustainable, ensures greater participation, and is more universal. The president also believes that, after reaching the halfway point of his term, the club is in a much better position than when he was elected in 2021.\n“You trusted us to recover the club’s finances; to restore order and institutional prestige; to move forward with Spotify Camp Nou; and to strengthen La Masia as the cornerstone of our sporting project\" he said. \"And that is what we have done, what we are doing, and what we will continue to do with determination and professionalism if you continue to trust in us. The Board of Directors and I feel stronger, more convinced, and more determined than ever to complete the recovery of the club in all areas.”\nAccording to Laporta, the members' commitment has been decisive for the club’s recovery in recent seasons. For this reason, he expressed special gratitude to those who, in his view, have supported Barça through the most difficult moments in its history. “I believe that throughout its history, it is you, the Barça members, who have always held the club together, because Barça is yours, you love it, and you understand better than anyone when more support and stability are needed for the institution, especially in times of great difficulty.”\nLa Masia responds again\nIn the sporting realm, the president justified the new momentum achieved by a change of coach, with the arrival of Hansi Flick. He predicted new sporting success, thanks to the team being built on the foundations of players trained at La Masia, along with others who bring experience and talent. Laporta expressed his great satisfaction with this season's squad, the work being done by Flick, and also Deco, highlighting that he has managed to lower the payroll while keeping the team competitive and rejuvenated. Laporta also acknowledged the work done by Xavi, but said that \"at that time we felt it was necessary to make a change and give the first team a fresh boost.\"\nThe perfect season for the women’s team and the Champions League win for the handball team were also highlighted by a man who described how proud he is to preside over a club that can now boast 48 European Cups.\nRecord revenue and ordinary profits\nLaporta reiterated, once again, that as long as he is president, FC Barcelona will remain the property of its members. He assured listeners that the club has managed to stabilise its economic situation, emphasising that despite having to play at the Estadi Olímpic Lluís Companys, which resulted in a reduction of over €100 million in annual ordinary income, the result for the 2023-24 financial year is a €12 million profit. This means that, for the first time since the 2017-18 season, Barça has closed the financial year without losses.\nThe president spoke of “levers” that his Board had to activate to strengthen the team which would end up winning the league in 2022/23, and to make urgent payments without passing on the burden to Club members. Elsewhere, also on financial matters, he outlined the wage reduction achieved with Deco heading up the sporting area - from €670M to a little under than €500M. He also looked at income and record sponsorships of €210M, which seems likely to increase, as well as record income from merchandising with BLM reaching almost €110M.\nBarça Vision\nWith regards to the Club’s digital business, Joan Laporta assures that, based on the forecasts from professionals in the sector, it needs to mature and that the non-payment of some investors means that the Club has debts to call in regarding some Barça Vision activity. The Club has recorded this potential non-payment under the principle of prudency, without renouncing its right to be paid, and that has brought about a net result of –91 million.\nRegarding the proviso of the auditors, Laporta stated that in no case does it oblige a reworking of the accounts and he considers there are reasons to justify the current value of the company, such as the investment made by Aramark this summer.\nAs such the president said that “the technology business is very new and it’s agreed, and we are calm because in the future it will be one of the main sources of income for the Club.”\nExcitement regarding the present and future of Spotify Camp Nou\nRegarding the future Spotify Camp Nou, the president talked of the collective dream of Barça fans and the courage of his Board of Directors to start the construction work, and that this very season a return home is achievable. The events for the Club's 125th anniversary were also a focus of attention for Laporta during a speech in which he spoke of emotions and hopes. “Barça is loved and admired by the world once again for who we are, what we do and how we do it,” said the president.\nJoan Laporta finished his speech with a call for institutional unity and stability. “We have to fight against those who don’t want us to do well. Those who use the Negreira case against us, who bring this subject up every time we are doing well. We have to be brave to defend ourselves and show ourselves to be strong,” with the president also adding that he does not share the “apocalyptic forecasts because that shows weakness, and we have to be strong.”\n- label.aria.viber Viber\n- label.aria.whatsapp WhatsApp\n- label.aria.twitter Twitter\n- label.aria.facebook Facebook\n- label.aria.messenger Messenger\n- label.aria.link label.aria.tick Copy link",
  "word_count": 1059,
  "scraped_at": "2026-02-14T12:53:03.658481"
}