{
  "article_id": "c9d8d13aba68",
  "url": "https://www.thenorthernecho.co.uk/news/23792465.pictures-people-lost-batts-area-bishop-auckland/",
  "title": "In pictures : the people of the lost Batts area of Bishop Auckland",
  "date": "20230922T103000Z",
  "domain": "thenorthernecho.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "THE people of the Batts area of Bishop Auckland lived on low-lying ground beneath the Market Place and the bishop’s castle always in fear of the Wear.\nTheir community was washed away by the Great Flood of 1771, when the river was eight feet above its usual levels, but as the Durham coalfield exploded into live in Victorian times, so the Batts was recolonised with mining terraces and hundreds of people.\nA postcard showing the riverside terraces of the Batts area with Auckland Castle on the high ground above\nHowever, this flood of people soon ebbed away as the fortunes of the coalfield went into reverse during the Great Depression of the 1930s. Unemployment at Bishop was 60.2 per cent in 1932, and the town’s population dropped from 15,602 in 1921 to 14,160 in 1931 as people fled in search of work.\nREAD MORE: THE SPOOKY TALE OF THE GHOST IN THE GASLIGHT\nREAD EVEN MORE: BEWITCHED BY THE BATTS AREA OF BISHOP\nThe Batts was as hard hit as anywhere, and in the 1939 register, its population of 329 is lower than at any time since 1851.\nWith the people leaving, so in the 1950s, the Batts terraces were cleared. A way of life came and went; a community lived and then died.\nThree of the six Allison sisters who lived practically all their years in the Batts: Margaret, Elizabeth and Emily, pictured around 1915\nAt Bishop Auckland Heritage Festival on Saturday, September 23, Tom Hutchinson, who comes from a Batts family, will be signing copies of his new book, Down the Batts Bank Between the Wars, which tells of the demise of the area and records the people who lived through it all with a smile on their faces, despite the tough times.\nTom will be in the town hall from 10am to 3pm. The book, which costs £7, will also be available from the railway station, the football shop in the Market Place, Bondgate Books, Fifteas Vintage Tearoom, Cockton Hill News and Bakers newsagents in Princes Street.\nA wonderful family portrait of Henry Jackson and his family taken around 1918. Henry, a miner at Auckland Park Colliery, lived at 9 Batts Terrace from 1891 to 1938. He is with his daughter, Emma Thrower, and his grandson, William, but the cat under his chair is the star of the picture\nBatts residents visiting Buckingham Palace in 1951 when they were in London to see Bishop Auckland play at Wembley in the FA Amateur Cup final. Norah Hutchinson (née Saunders), Ellen and Billy Fletcher and Mary Calland (née Saunders) are inspecting a guardsman in his busby. Their team lost the final, but returned five more times that decade, winning the trophy on three occasions\nCathy Chappell in Jock's Row around 1850, looking towards the bridge that still stands although the houses are gone. Little Jackie Chappell is behind a large dog at the front, and in the distance, with a baby, is Jennie Chappell\nA Batts wedding party in 1958 when Kathleen Hudspeth, of 7 Back Dial Stob Hill, married George Chapman\nLife in Batts Terrace around 1925: a baby sleeps in its chair while children play behind, women gossip in the doorways and a hen pecks at the unmade road\nThe cover of Tom Hutchinson's new book, from which all of these pictures have been taken\nREAD MORE: THE HISTORY OF BISHOP AUCKLAND'S KINGSGATE QUARTER\nPLAYWRIGHT Ed Waugh is one of the speakers at the festival, with Wor Bella and First World War women’s football in the North East as his subject. Here he explains more…\nTHE Lionesses have taken us on a highly emotional rollercoaster ride, winning the 2022 European Championships and landing the runners-up spot in this year’s World Cup.\nThat's no mean achievement, especially since women's football was banned by the FA in 1921, and not \"unbanned\" until 1971.\nAs Paul Green, Chelsea FC Women general manager, told me for the Wor Bella website (worbella.co.uk): \"That's 50 years the women's game was set back and it inevitably meant a lack of opportunities. We're playing catch-up at the moment.\"\nIt's incredible how rapidly women's football is catching up both skills wise and organisationally. According to FIFA, a record 32 countries were represented in World Cup while more than 29 million women and girls now play football worldwide.\nFemale participation in football has increased by 80 per cent this year alone in the UK and more than 12m viewers watched the final live between Spain and England.\nAs well as highlighting the tremendous strides forward that women’s football has taken, the World Cup also highlighted the struggles against sexism, the battle for equal pay and better healthcare.\nHowever, it is important to remember the professional players of today stand on the shoulders of their sisters from the First World War, when hundreds of women's teams were formed nationally to raise money for injured soldiers, widows and orphans.\nREAD MORE: HOW THE MUNITIONETTES KICKSTARTED WOMEN'S FOOTBALL IN THE NORTH EAST\nThe North East was a women's football hotbed and even had its own \"Munitionettes\" cup. The top team in the region were Blyth Spartans Ladies, made up of Northumberland dock workers, who defeated Bolckow Vaughan, a steelworks team from Middlesbrough, at Ayresome Park, Middlesbrough, in May 1918, in front of 22,000 people.\nBlyth's hero was Bella Reay (above) who scored 130 goals in 33 matches. She was the Alan Shearer of her day.\nMy play Wor Bella is about Bella and the spontaneous rise, and tragic fall, of these heroic football teams.\nOn Boxing Day 1920, Dick Kerr Ladies (a munitions team from Preston) played St Helen’s Ladies at Goodison Park, the home of Everton FC, and a staggering 53,000 spectators attended, with around 14,000 locked out.\nSeeing this, the middle-class, male Football Association (football has never ever been run by the working class) feared they were losing control. These fears were compounded by the bitter, three-month miners' strike of 1921, when women's football matches raised money for the, often destitute, families of striking miners.\nIt was one thing for hundreds of women's football teams to raise money for the war effort; it was another for them to be seen as giving \"political\" support to workers in industrial battles. On December 5, 1921, the FA banned women's football. Unforgiveable!\nThe game was only unbanned in England 50 years later, a time of \"women's liberation\".\n- Ed Waugh’s talk is at 10.45am in the town hall. At 11.45am, Durham’s Senior Conservation Officer Bryan Harris is speaking about hidden history, and at 12.45 Tony Nicholson is talking about the astonishing cache of Victorian photographs and letters he discovered in an attic which grew into a story of love and intrigue. All talks are free but need to be booked. Go to baccanalia.co.uk to do so, and for full details of Saturday’s festival\nREAD MORE: FAMOUS FLOWER SHOW AT THE HEART OF THE HERITAGE FESTIVAL",
  "word_count": 1154,
  "scraped_at": "2026-02-14T13:03:50.685421"
}