{
  "article_id": "c9e58ecdaf9f",
  "url": "https://newsbusters.org/blogs/culture/john-simmons/2023/08/22/british-media-womens-world-cup-time-question-england-teams",
  "title": "British Media on Women World Cup : Time to  Question the England Team Whiteness  ",
  "date": "20230822T200000Z",
  "domain": "newsbusters.org",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Before England lost to Spain 1-0 in the Women’s World Cup final on Sunday, a panel on the British network Sky News discussed what they thought was the squad’s biggest problem before the match. But, it didn’t have anything to do with the sport, rather, they claimed the biggest issue with the team is their “lack of diversity.”\nWhat should have been a cheery discussion about a major event quickly changed tune when black activist Wilfred Emmanuel-Jones said the team wasn’t “representative of England.”\nSo Emmanuel-Jones made an audacious claim about the ethnic makeup of the team, yet couldn’t provide any concrete evidence about the problem he claims exists? Sounds like most race-baiters in today’s media cycle.\nHowever, he was far from the only one to gripe about the melanin count of the women’s team. Bristol City coach Anita Asante wrote a rambling op-ed about how the current state of English football prevents black girls from wanting to play soccer. She begins her article by saying:\nBefore they can begin envisaging being part of a trophy-winning team or start dreaming about scoring goals galore, budding Lionesses need role models to whom they can relate.\nThat is one of the many reasons why diversity is so important and why it is legitimate to question the England team’s whiteness.\nAsante then rambled on and on about how the English football system doesn’t look for talent in diverse areas enough and that racial bias explains why mostly white women get chosen for the team. Once again, the system is the problem and is silently destroying any hope for black girls in England to play soccer.\nBoth Emmanuel-Jones and Asante think that too many white girls get chosen over black girls. But if you look at the demographics of the country, you’d realize that shouldn’t be a surprise.\nEngland and Wales report a joint census each year, and in 2021 the population of these nations was 59.6 million. Of those roughly 60 million, nearly 82 percent identified as white, and only four percent identified as black.\nThese numbers alone mean that the chances of the team being predominantly white are pretty high, since four out of every five people there are white. If the country is predominantly white and not black, then I’d say Emmanuel Jones was looking at a team that “represents England” pretty accurately!\nAnother annoying element of the left’s diversity arguments is that they assume an unequal outcome of “representation” automatically means racism exists, but only when black people are in the minority.\nFor example, there is a huge imbalance of representation in the NBA, where 71 percent of all players are black. Does that mean the progressive media has come out guns blazing and said the NBA has racial bias against White, Asian, or Hispanic men that want to play at that level? If you guessed no, you’re correct!\nBut as soon as black people aren’t in the majority - like we see with England’s women’s team - the progressive media sounds the racism alarm. That's an irresponsible assumption to make, especially when so many other factors provide a more likely explanation for an inequality of outcomes.",
  "word_count": 527,
  "scraped_at": "2026-02-14T12:05:09.688720"
}