{
  "article_id": "c9eebdb93691",
  "url": "https://www.90min.com/posts/sarina-wiegman-heaps-praise-lauren-james-after-denmark-heroics",
  "title": "Sarina Wiegman heaps praise on Lauren James after Denmark heroics",
  "date": "20230728T150000Z",
  "domain": "90min.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Sarina Wiegman heaps praise on Lauren James after Denmark heroics\n- Wiegman impressed with James' performance\n- The boss confirmed England's plan to cope without injured Keira Walsj\n- Happy with how team adapted and maintained that the most important thing was winning\nEngland manager Sarina Wiegman has praised Lauren James for stepping up and playing a starring role as the Lionesses saw off Denmark on Friday.\nWiegman opted to start James after previously bringing her on from the bench in England's first match against Haiti, a tactic that was deliberate based on the way they expected Denmark to play.\nThe gamble undoubtedly paid off as James bagged the only goal of the game just six minutes in, fizzing the ball from long range into the back of the Denmark net in what was an overall excellent display from the Chelsea forward.\n\"She did well when she came in,\" Wiegman said after the game. \"What we did in the approach to this game [was] that we know Denmark is dropping deeper, that they have a very tight defensive block, and we really thought that we needed players in the pockets.\n\"And that’s where she came a lot, together with also Georgia Stanway and [Ella] Toone, and that worked really well, they also struggled with that. And yes she made, indeed, a very nice goal.”\nREAD THE LATEST LIONESSES WOMEN'S WORLD CUP 2023 NEWS HERE\nWiegman was, however, keen to ensure her entire team was praised after a battling performance.\n\"You’re all talking about Lauren James again, and she has done really well, but it’s a team effort too and we're very careful with her, she’s a very young talented player and yes we're very happy with her performance,\" she added.\nIt was another difficult match for England, who were tested on how to adapt quikly when Keira Walsh had to be stretchered off due to a knee injury.\n\"We just had to find our feet,\" Wiegman said of England's response to the injury. \"Of course, it's not nice when a player goes off the pitch that way. But we also know, unfortunately, these things happen sometimes in football.\n\"You just have to move on and you're the World Cup and you want to win the game. We really had to adapt to a new situation as quickly as possible and that's what we did.\n\"It’s all about winning games of course and we also want to play well. I think we had two totally different games. Haiti was totally different than tonight. We never take anything for granted, so everyone thinks ‘Oh, England, you’re just going to win’. Well, we have to work really hard every time we play any game. So that’s what we did today. We had a lot of ball possession, especially in the first half, we dominated the game, and at the end we’re really happy with the 1-0 and that’s what counts.\"\nWhen asked about a 'Plan B' if Walsh is out for an extended period of time, given that there wasn't one in place during last summer's European Championships, the England manager said: \"You’re talking about the Euros. We’re now in a World Cup. You saw the Plan B. Georgia Stanway drops back and Laura Coombs comes in.\"",
  "word_count": 544,
  "scraped_at": "2026-02-14T13:26:45.929359"
}