{
  "article_id": "ca09cd35c800",
  "url": "https://www.themag.co.uk/2025/06/mikel-arteta-not-happy-after-premier-league-official-announcement-today-arsenal-newcastle-united/",
  "title": "Mikel Arteta not happy after Premier League official announcement today",
  "date": "20250603T101500Z",
  "domain": "themag.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Mikel Arteta not happy after Premier League official announcement today\nMikel Arteta is infamous for his excuses.\nThe Arsenal boss very rarely, if ever, gracious in defeat.\nThe embarrassing excuses Mikel Arteta has came out with over the years to try and deflect from the shortcomings of himself and his team, arguably reached new levels this season.\nMaybe topping it all off, was when Mikel Arteta blamed the ball after United won 2-0 at the Emirates in the semi-final first leg of the League Cup.\nWhilst Nike supplied the ball used in Premier League matches last season, it was a Puma ball that was used in the League Cup in 2023/24.\nMikel Arteta claiming his Arsenal players were unfamiliar with this different ball and blamed its use for the defeat.\nWell, the 2025/26 season could be interesting.\nAfter 25 years of a Nike ball having been used in Premier League matches, it has now been announced that the 2025/26 season will see a Puma ball in use…\nPremier League official announcement – 3 June 2025:\n‘The PUMA Orbita Ultimate PL, the official match ball of the 2025/26 Premier League season, is here.\nThe new ball will make its first official appearance this July in the Premier League Summer Series in the USA, offering a global audience a first look at the ball that will be used in the world’s most-watched league next season, which kicks off on the weekend of 16 August.\nThe PUMA Orbita Ultimate PL features 12 evenly sized panels that ensure precise weight distribution, keeping the ball perfectly balanced. Its high-frequency moulding guarantees long-lasting durability with enlarged and deeper seams to improve aerodynamics and shape retention.\nThe official Premier League match ball is available at shop.premierleague.com.\n‘Have a Ball’\nThe partnership between the Premier League and PUMA kicks off with the “Have a Ball” campaign, which aims to encourage players at all levels to play with confidence and celebrate the joy of having the ball at their feet.\nAs part of the long-term partnership, the Premier League and PUMA will support grassroots football through Premier League Kicks, along with girls and women’s grassroot initiatives, international community activations and No Room For Racism.\nWill Brass, Chief Commercial Officer at the Premier League, said: “The launch of the new ball, which will be seen in play for the first time during the Premier League Summer Series, marks the beginning of an exciting new chapter. We are thrilled to welcome PUMA as a key partner in our efforts to enhance the Premier League, both on and off the pitch. We can’t wait to see the ball in action, delivering unforgettable goals and moments for players and fans alike.”\nRichard Teyssier, Vice President Brand & Marketing – PUMA, added: “By emphasising the emotional and liberating aspects of playing football, the ‘Have a Ball’ campaign highlights how the simple act of just having the ball can bring immense joy and excitement. On average, a professional footballer has control of the ball for around 109 seconds every game, so when you have the ball at your feet you need to make it count and create moments that make a difference on the pitch. We are proud to have some of the best players in the world creating magic moments on the pitch using the new ball. PUMA is committed to elite performance and product, something evident as a result of our new partnership.”\nDuring the Summer Series there will also be community coaching programmes in all three cities – New Jersey, Chicago, and Atlanta – to support the development and accessibility of football in local communities. The activations will also include in-store events at the PUMA New York City flagship store.’\nIf you would like to feature on The Mag, submit your article to contribute@themag.co.uk",
  "word_count": 632,
  "scraped_at": "2026-02-14T12:36:00.585114"
}