{
  "article_id": "ca0fe1b8093e",
  "url": "https://www.wunc.org/2024-12-18/david-gentry-cullen-jones-miles-wolff-nc-hall-fame-class-of-2025",
  "title": "David Gentry , Cullen Jones , Miles Wolff in NC Hall of Fame class of 2025",
  "date": "20241218T164500Z",
  "domain": "wunc.org",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "The N.C. Sports Hall of Fame unveiled the class of 2025.\nThe roster includes North Carolina's all-time winningest high school football coach, an Olympic champion swimmer, and the man who brought Durham its beloved minor league baseball team.\nThe group of 11 will be enshrined May 2 during the 61st annual induction celebration at the Sheraton Greensboro Hotel Joseph S. Koury Convention Center. This class brings the total number of Hall of Fame members to 421.\n\"The Class of 2025 of the North Carolina Sports Hall of Fame is wonderfully diverse, just like the sports landscape of this great state,\" said Rick Webb, president of the hall's board of directors, in a news release. \"Trailblazers, icons, and luminaries, from the high school ranks to the professional circuits, there is so much history encapsulated within these eleven inductees, all of whom contributed to the sports culture of North Carolina.\"\nThe hall provided a brief biography of each 2025 inductee, which follows below. (Isaac and McGlockton are being inducted posthumously.)\nGreg Ellis\nEllis was a consensus first-team All-America in 1997 as a senior at the University of North Carolina. The Tar Heels' all-time sack leader (32.5), the Wendell, N.C., native was selected in the first round of the NFL draft (No. 8 overall by Dallas). Ellis played 11 seasons for the Cowboys and one for the Oakland Raiders, making 84 sacks. He played in the 2007 Pro Bowl when he was named the NFL's Comeback Player of the Year after an Achilles injury had ended his previous season prematurely. Ellis, who is one of only four Tar Heels to earn first-team All-Atlantic Coast Conference honors three times, was an All-State football player at East Wake High School and the 1993 North Carolina High School Athletic Association Male Athlete of the Year.\nNora Lynn Finch\nFinch was a coach for 13 years and a trailblazing administrator for 47. A native of Henderson, N.C. she worked at Wake Forest, Peace College and NC State, along with the ACC where she was the league's first female associate commissioner. Finch's awards and accolades reflect her impact on college athletics and how she championed opportunities for women in sports. She received the Order of the Long Leaf Pine in1987 as well as the 2007 Billie Jean King Lifetime Achievement Award given by the Women's Sports Foundation. Finch was the inaugural chair of the NCAA Division I Women's Basketball Committee, serving from 1981-88. The NCAA acknowledged her leadership in women's basketball by naming her to its 10th Anniversary Women's Basketball Team.\nRollie Geiger\nGeiger has been NC State's men's cross country coach since 1982 and coached the women's team from 1981 to 2004. In addition, he was the head coach of the men's track team from 1984-2023 while coaching the women from 1984-2018. He currently serves as Senior Associate Director of Track & Field and Cross Country, as well as the head coach of the men's cross country team. Geiger was inducted into the USTFCCCA Coaches Hall of Fame in 2019. His teams have won 40 ACC titles and he's coached 24 NCAA individual, relay and team champions, as well as 250 individual ACC champs and 400 All-ACC performers. Geiger is a 34-time ACC Coach of the Year.\nDavid Gentry\nGentry is North Carolina's all-time winningest high school football coach. He has 426 victories overall with 366 of those coming at Murphy, more than any other coach at a single school in N.C. He won nine state championships at Murphy with a playoff record of 82-25 (.766). Gentry is a member of the NCHSAA Hall of Fame. He was a four-sport standout at Edneyville High and played college football at Elon, where he later joined Red Wilson's staff as an undergraduate assistant.\nDale Inman\nA native of Level Cross, Inman revolutionized NASCAR's crew chief position. He is largely credited for developing the driver-pit communication system. He was part of eight NASCAR Cup Series championships, seven of those as crew chief for Richard Petty (1964, 1967, 1971, 1972, 1974, 1975 and 1979). Inman was part of 193 wins, including seven Daytona 500 victories. In 1967, he and Petty won a NASCAR-record 27 races, including 10 in a row. He is a member of the NASCAR Hall of Fame (2012) and International Motor Sports Hall of Fame (2013). Inman also helped develop the Victory Junction Gang Camp.\nBobby Isaac\nIsaac was named one of NASCAR's 50 Greatest Drivers and was inducted into the circuit's Hall of Fame in 2016. He dominated NASCAR in 1969-70, winning 28 races and earning 61 top five finishes (and 32 poles over the two seasons). Isaac captured 19 poles in 1969, which still stands as the record in a single season (by comparison, only 37 drivers have 19 or more poles in their entire career). Isaac was NASCAR's Grand National Series champion in 1970. For his career, Isaac had 37 wins, 48 poles, and 134 top-five and 160 top-10 finishes in 308 Cup Series starts. He died in 1977 at the age of 45.\nCullen Jones\nJones nearly drowned as a 5-year-old at a water park but later became an Olympic champion swimmer. He is a four-time Olympic medalist, competing in 2008 (Beijng) and 2012 (London). His first medal was gold in 2008 and came in world record time in the 4×100-meter freestyle relay with Michael Phelps, Jason Lezak and Garrett Weber-Gale. Jones won three medals in London – silvers in the 50-meter freestyle and 4×100-meter freestyle relay, as well as a gold in the 4×100 meter medley relay after swimming the freestyle leg in the preliminaries. He is a 2006 NCAA champion in the 50 free and a five-time ACC champion (three times in the 50 free). He is the first Black swimmer to hold a world record and second to win an ACC title.\nChester McGlockton\nMcGlockton was a second-team USA Today All-America at Whiteville (N.C.) High where he returned nine interceptions for touchdowns during his career. He played three seasons at Clemson and was a first-team All-ACC selection in 1991. McGlockton was the 16th pick overall by the Oakland Raiders in the 1992 NFL draft and went on to play 12 seasons with four different teams. While with the Raiders, he appeared in four straight Pro Bowls and was a first-team All-Pro selection in 1995. He finished his NFL career with 555 tackles, 51 sacks, 14 forces fumbles and four interceptions in 179 games. McGlockton died in 2011 at the age of 42.\nWendy Palmer\nThe 1992 NCHSAA Female Athlete of the Year, Palmer attended Person High School in Roxboro, N.C., where she was named a High School All-America by the WBCA. She's the University of Virginia's career rebound leader (1,221), first in double-doubles (58), second in field goal percentage (.614) and fourth in scoring (1,918). Palmer was the first Cavalier to total at least 1,000 points and 1,000 rebounds during her career. She was the ACC Player of the Year 1995 and 1996, while earning first-team USBWA and Kodak All-America honors during the same seasons. Palmer played 11 years in the WNBA (1997-2007) averaging 10.1 points and 5.9 rebounds in her career. She was a WNBA All-Star in 2000, second-team All-WNBA in 1997 and the WNBA's Most Improved Player in 2004.\nJimmy Raye\nRaye, who had a standout career at E.E. Smith High School in Fayetteville, NC., became one of the first Black quarterbacks to start at the NCAA Division 1-A level. He was a star on the powerful Michigan State teams of the mid-1960s. In three years with the Spartans, Raye threw for 1,733 yards, 15 TDs and 18 Interceptions. He rushed for 926 yards and nine touchdowns. He played on Big Ten and national championship teams in 1965 and 1966. Raye played two seasons in the NFL before moving to the coaching ranks. He coached in the NFL for 37 years with 10 different teams, serving as offensive coordinator for 13 seasons.\nMiles Wolff\nWolff was integral to the resurgence of minor league baseball in North Carolina in the 1980s. He bought the Durham Bulls in 1980 for just over $2,400 and revived baseball in the Bull City after it had shuttered nine years earlier. Wolff later befriended a Hollywood producer who developed the movie \"Bull Durham.\" Wolff also brought life back into the sport in both Asheville and Burlington, all of this following a stint as General Manager in Savannah. He was the president and publisher of Baseball America (Durham) for 18 years. He also purchased the Raleigh Ice Caps of the ECHL in 1990.",
  "word_count": 1427,
  "scraped_at": "2026-02-14T12:48:47.712047"
}