{
  "article_id": "ca14ba74928a",
  "url": "https://www.bbc.com/sport/football/articles/c5y88m6lvj3o",
  "title": "Women Super League predictions : Can anyone stop Chelsea ? ",
  "date": "20240920T071500Z",
  "domain": "bbc.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "WSL predictions 2024-25: Can anyone stop Chelsea?\n- Published\nThe Women's Super League returns this weekend and Chelsea are aiming to win a sixth title in a row - but can anyone stop them?\nNew manager Sonia Bompastor is hoping to pick up her first WSL title but Manchester City, who lost out on goal difference last season, will want revenge.\nWith Crystal Palace joining the top flight and others spending big money in the summer transfer window, it promises to be another rollercoaster campaign.\nSome of BBC Sport's pundits have predicted their top three for the 2024-25 campaign, along with who they think will be relegated, while Emma Sanders tries to predict where each team will finish this season.\nRate every WSL club's summer transfer window\n- Published13 September 2024\nHow to watch and follow 2024-25 WSL season on the BBC\n- Published26 December 2024\nWhat are priorities for new WSL company this season?\n- Published11 September 2024\nWho are the pundits backing?\nEmma Sanders' predictions\n1. Manchester City\nGareth Taylor's side missed out on the title last season because they scored seven goals fewer than Chelsea.\nThey responded by making some strong additions in the summer transfer window.\nVivianne Miedema and Aoba Fujino give them more depth in attack and club record signing Jill Roord is set to return from an anterior cruciate ligament injury.\nThey have got better in the past 18 months and I think their consistency, with added depth, will finally take them over the line this time.\nLast season: 2nd\n2. Chelsea\nChelsea have won five titles in a row for a reason - they have world-class players. That has not changed and they will still be right up there.\nFormer Lyon manager Bompastor has a track record of winning trophies, but have rivals City managed to catch them up?\nThe French woman will have to settle quickly and, although they have signed some good players in the transfer window, City's consistency might make the difference.\nLast season: Champions\n3. Arsenal\nArsenal need to catch up on the top two and they have made perhaps the best signing of the summer in Barcelona forward Mariona Caldentey.\nIt could take them closer, but while the Gunners have strengthened, so have Chelsea and Manchester City.\nManager Jonas Eidevall is heading into his fourth season in charge and they have not progressed as much as hoped.\nI think they will fall short again.\nLast season: 3rd\n4. Manchester United\nIt's been a turbulent summer for United, who faced backlash for switching their women's team's training facilities.\nThey have lost several key players including last season's top scorer Nikita Parris, their number one goalkeeper Mary Earps and captain Katie Zelem.\nBut they have also recruited well.\nElisabeth Terland, Celin Bizet and Dominique Janssen are particularly strong signings and, I think, will help them climb back to fourth in the table.\nLast season: 5th\n5. Aston Villa\nVilla were one of the biggest spenders in the summer, backing new manager Robert de Pauw and emphasising their ambitions to break into the top four.\nClub record signing and Brazil forward Gabi Nunes is an exciting addition - and they have had a good pre-season campaign, going unbeaten.\nThey face stiff competition from the clubs around them but I think they can be the 'best of the rest'. I don't see them breaking into the top four, though.\nLast season: 7th\n6. Liverpool\nMatt Beard's side exceeded expectations last season, recording huge wins over the top clubs and pipping United to fourth place.\nThey will remain tough to beat and Beard is a shrewd manager, who knows how to get results.\nBut after making big strides, they had a quiet summer in the transfer window. Their consistency will help but others might have overtaken them.\nLast season: 4th\n7. Brighton\nAnother club who showed big ambition in the transfer window. Like Villa, Brighton were willing to spend and reaped the benefits.\nEngland's Fran Kirby and Jelena Cankovic were good additions, while Parris' arrival on transfer deadline day was a real coup.\nThey have lost last season's top scorer Terland but those attacking additions will help fill that void.\nThe main thing holding them back is constantly having to deal with change. Once again, there was a high turnover of players and a new manager hired.\nI expect them to improve but they need time.\nLast season: 9th\n8. Tottenham\nSpurs had a great first season under manager Robert Vilahamn but were far too vulnerable in some matches.\nThey showed lots of potential but two key players are not with them anymore - Bizet and on-loan midfielder Grace Clinton.\nThey tried to replace them in the transfer window but have they strengthened enough elsewhere?\nI'm not convinced. Other clubs around them have more depth.\nLast season: 6th\n9. Leicester City\nBy all accounts, Leicester City have looked very impressive in pre-season so perhaps this prediction is too low.\nBut having not finished above 10th in the WSL, I haven't made any wild assumptions.\nNew French manager Amandine Miquel is allowing them to play free-flowing football so they will be dangerous - but their squad is still young and might need more time to fulfil their potential.\nLast season: 10th\n10. Everton\nIt could be another tricky season for Everton, who have been cash-strapped for several windows and are struggling to keep up with others.\nLast season they faced an injury crisis and did remarkably well so you can never write them off.\nI don't think they have to worry about relegation but the strength in depth at other clubs might be too much.\nLast season: 8th\n11. Crystal Palace\nAs Bristol City showed last season, the jump from the Women's Championship to the WSL is still huge.\nCrystal Palace will likely struggle but they had a busy transfer window which gives them some hope.\nAmerican striker Katie Stengel performed well at Liverpool and defender Katrine Veje has brought experience from Everton.\nTheir transfer business could be enough to help them finish above West Ham.\nLast season: Women's Championship winners\n12. West Ham\nIt's been a rough few years for West Ham and they have stayed in the WSL by the skin of their teeth.\nThis could finally be the season they succumb to relegation after another difficult transfer window.\nSeveral key players left including captains Mackenzie Arnold and Hawa Cissoko, as well as Japan internationals Honoka Hayashi and Risa Shimizu.\nIt's going to be a long campaign for them.\nLast season: 11th",
  "word_count": 1090,
  "scraped_at": "2026-02-14T12:22:54.164687"
}