{
  "article_id": "ca161eff7a08",
  "url": "https://theathletic.com/4403327/2023/04/12/england-australia-world-cup-sarina-wiegman/",
  "title": "England World Cup wake - up call is ringing loudly for Sarina Wiegman and squad",
  "date": "20230412T083000Z",
  "domain": "theathletic.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "It was going to happen eventually.\nAfter 31 games as England manager, Sarina Wiegman finally tasted defeat. The warning signs were there in the second half against Brazil at Wembley in the Finalissima, but a victorious penalty shootout painted over the cracks.\nAustralia, this summer’s World Cup hosts, did not let England off — they exposed weaknesses in the defence, midfield and attack for a deserved 2-0 victory. There is much work to be done before England travel Down Under.\nSo what went wrong?\nAdvertisement\nDespite England having more possession (71 per cent), more shots on target (four), more attempts on goal (16) and a higher expected goals (xG, the measurement of the quality of chances created), Australia’s goalscoring opportunities stemmed from England’s mistakes.\nFor the first goal, Leah Williamson’s undercooked header back to Mary Earps allowed Chelsea striker Sam Kerr to pounce.\n“Once I saw it was floating, I knew there was going to be a miscommunication between the two (Mary Earps and Leah Williamson),” said Kerr.\nFor the second, Jess Carter lost possession and Australia hit quickly on the counter.\nA new-look back line had left England vulnerable. With Alex Greenwood and Millie Bright out with a concussion and a knee injury, Wiegman selected 22-year-old Esme Morgan over Carter and Lotte Wubben-Moy to partner Williamson at centre-back. This was just Morgan’s second international start and she has only started 10 out of 17 Women’s Super League (WSL) games for Manchester City, but Wiegman justified her decision after the game.\n“She’s a very talented centre-back and I wanted to see that,” she said.\nIt was an interesting choice given Williamson and Morgan are similar in style. Carter could have shifted across from left-back and Wubben-Moy partners Williamson at Arsenal. Given Wiegman’s reluctance to tweak her starting XI, it is an indication of the pecking order.\nMorgan was too often sloppy in possession, but she was not the only one. England looked disjointed and misplaced passes, leading to high turnovers. There was uncertainty with this new centre-back partnership and perhaps the weight of leading the relatively inexperienced internationals in Morgan and Carter had an impact on the usually faultless Williamson.\nAgainst Kerr, the Lionesses lacked Bright’s more active and combative style. She leads by example, is a strong tackler and is an aerial threat defensively and offensively. Williamson and Bright complement each other well. The England captain tends to hold her position and mark the space, preventing gaps from opening in behind.\nBut it’s all too easy to say Bright was the missing piece — England’s cracks lie deeper than that.\nAdvertisement\nEverything about England was unusually slow and ITV pundit Karen Carney compared their build-up play to walking football. A lack of tempo created a domino effect.\n“We want to speed up the ball tempo, go forward quicker,” said Wiegman. “But then you also need runs in behind. There was not very much space in the centre of the pitch because they were really tight. It’s a big learning game against a very physical, well-organised Australia.”\nAustralia pressed high and were compact between the lines, maintaining a narrow 4-4-2. England needed to stretch them and switch the play more frequently to speed things up. Williamson, Bright and Greenwood’s diagonal balls to England’s wingers and progressive passes into channels along the floor have been extremely effective and crucial to breaking down the opposition’s press since Wiegman took charge in 2021. Against Australia, Williamson, the usual playmaker, did not play these passes as often.\n“We looked like we were lacking ideas on the ball,” Williamson said.\nEngland’s creative force in midfield and up front made fewer runs in behind and into pockets of space. Wiegman recognised the lack of creativity and brought on Rachel Daly, who has been playing as a striker for Aston Villa this season having starred at left-back in the Euros success last summer, for Ella Toone in the No 10 role on the hour. When asked post-match, Daly admitted it was a surprise to her.\nCould Alessia Russo have dropped deeper and Daly pushed up as the No 9? That would have allowed Russo to link up play and Daly to attack crosses, playing to their strengths.\n“We had to score goals,” said Wiegman. “We wanted to create more. We also needed power because we lost too many duels and second balls. We thought Rachel Daly gets closer to Alessia Russo and to head crosses. We wanted to see if that is an option when Daly comes from that position, have the runs in behind, but also win duels.”\nAdvertisement\nThat Wiegman opted to play Daly in the attacking-midfield role instead of one of her named midfielders, such as Jordan Nobbs, suggests a lack of depth in that area. Fran Kirby, who is sidelined with a knee injury and has not played for England since November, is a big miss.\n“Fran, I’m a little more concerned,” said Wiegman when asked about her fitness. “She’s assessed at her club, she’s progressing. We’re just following it really closely.”\nWiegman went to a back three in a bid for more attacking options, bringing Jess Park on for Carter in the 84th minute. The Dutch coach made a similar move when England were 1-0 down against Spain in last summer’s Euros, bringing on Greenwood in place of Daly, putting Bright up front and switching to a back three. This time around, the change was less effective.\nWith 99 days until the World Cup, there is no reason to panic, but there have been faint alarm bells, particularly against Brazil last week and the Czech Republic in October. A lack of creativity against a low or mid block is a recurring theme.\n“We play against some opponents now that drop a little deeper,” said Wiegman. “They’re really tight so we have to make the game… we have to find solutions and a way to create more to score goals.”\nEngland have the quality and cohesiveness, but they have to return to the high standards they set themselves during the Euros.\n(Top photo: John Walton/PA Images via Getty Images)",
  "word_count": 1016,
  "scraped_at": "2026-02-14T12:22:02.711129"
}