{
  "article_id": "ca1746647eae",
  "url": "https://www.canberratimes.com.au/story/8939937/michelle-heyman-200-a-league-games-canberra-united-beat-wellington/",
  "title": "Michelle Heyman 200 A - League games , Canberra United beat Wellington | The Canberra Times",
  "date": "20250413T091500Z",
  "domain": "canberratimes.com.au",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Canberra United gave the best possible gift to Matildas veteran Michelle Heyman in her historic 200th A-League Women's game - a memorable win and a long-awaited finals berth.\nSubscribe now for unlimited access.\nor signup to continue reading\n\"Best day ever. That's all I can say,\" Heyman beamed after United's 1-0 victory over Wellington Phoenix.\n\"200 is something, but all I really wanted was the three points.\n\"It's never easy, but I'm just really proud of the girls to get the three points and make finals.\"\nUnited's nail-biting win in front of 1873 vocal fans at McKellar Park on Sunday afternoon edged Canberra to their first finals appearance since the 2020-21 season, thanks to some help from the Western Sydney Wanderers.\nSitting in sixth spot on the A-League ladder, the Canberra side didn't just need a win against the Phoenix, they also needed seventh-placed Brisbane to lose or draw with Western Sydney on the same day in order to secure a finals place with one round to go.\nThe Roar's thrilling 4-4 draw against the Wanderers kept United from sweating for another week.\nThe Canberra squad still have one more week of the regular season to play before the finals, with the bottom-of-the-ladder Wanderers their next match in Sydney on Saturday.\nHeyman was the star of the show on Sunday with the 36-year-old given a special guard of honour before the game and honoured in a post-match presentation.\nShe was also given a rousing standing ovation by supporters when substituted before the final minute.\nThe tension was high early in the match in the capital with the ramifications for finals football at the front of players' minds.\nSofia Christopherson was awarded the opening goal in the 25th minute off a corner, though it was initially thought Madison Ayson had the final touch.\nHeyman had a golden chance to extend the lead later in the first half but whiffed at the ball while losing her footing as it trickled tantalizing across the face of goal.\nNothing would dull the excitement from the home crowd for the club legend on this day however.\nAlready the games record-holder, Heyman simply added another page to the history books by notching her 200th appearance.\n\"I never thought the day would come [to play 200 games], but I'm feeling very honoured to be able to take the field with the girls and wear the green and do the thing I love most,\" Heyman said.\nHeyman's mum travelled from Shellharbour for the match which made the day more memorable for the striker even though she rued the missed shot at goal.\n\"I know my mum would be disappointed without the goal,\" Heyman joked.\n\"But the bigger picture is finals.\n\"I think we've actually started growing at the right time of the season. It's the first time the season has been this long, and it's super important for us to continue to get these wins.\"\nAT A GLANCE\nCanberra United 1 (S.Christopherson 25') bt Wellington Phoenix 0 at McKellar Park. Crowd: 1873\nTHE TALE OF TWO HEYMANS\nOne look at Michelle Heyman's face and it's easy to see why she's on the verge of achieving A-League history.\nThe iconic wide and toothy grin the 36-year-old striker has sported in the lead-up to her 200th game this weekend was nowhere to be seen six years ago when her career came to an abrupt and unhappy end.\nThe difference between now and 2019 when she announced her retirement? Heyman is doing things on her terms now.\nThe Shellharbour product is currently in peak physical condition with ongoing painful injury setbacks a thing of the past.\nAfter well-documented mental health struggles she's now playing the game she loves with a smile on her face.\nHeyman is at a club that appreciates her and as a result, she's enjoying the top goal-scoring form, Matildas caps and other accolades that come with it all.\nCoaches, teammates and fans all notice that happiness for Heyman has been key to her success since her A-League debut in 2008, and it could be the key to her reaching 250 and even 300 games if she wants to chase even more history.\n\"That's where her happiness comes from - it's her choice now. It's not her body saying no or a contract that's not good enough,\" United head coach Antoni Jagarinec told The Canberra Times.\n\"I think that she's at a point now where she's proven it to herself, she's proved it to the world quite frankly that she's still good enough and that she can do it.\n\"If she keeps her body fit she'll keep playing into the future as long as she wants.\n\"Being at home in the Canberra environment too, in her 'happy place' as she'll often talk about, it's going to extend her career.\"\nJagarinec and Heyman go back over a decade. It was 2013 when he first coached her at Belconnen United.\nThe A-League Women competition back then was not as long as the 22-game home-and-away season it is today, and often players would spend their off-season at local soccer clubs, or play overseas to supplement their income and keep their skills up.\nThe top domestic competition at the time did not offer as much financial support in terms of salaries and sponsorship dollars that A-League and Matildas players like Heyman can earn in the current market thanks to a huge rise in popularity of women's sport in recent years.\nJagarinec explained that when Heyman came to play at Belconnen she similarly found a way to rediscover her love for the game despite dealing with what was a difficult juggle for many female soccer players at the time.\n\"She was in a crossroads in her life in that 2013 season where she didn't love football and didn't know if she wanted to be a footballer for millions of reasons, like you could only get a few dollars to play and all that kind of stuff,\" he said.\n\"So she had almost a rest year at Belconnen, and then once again found that happiness and we've had a great relationship since, whether I'm coaching her or just being a sounding board when I haven't been directly involved with her career.\n\"We're great mates off the park, but that's not to take away that she's done it all herself.\"\nHeyman turns 37 in July, but remarkably there's no suggestion that retirement is near.\nAs a forward still playing international soccer with the Matildas, why wouldn't she keep going. The question is how much more A-League history does she aim to achieve?\nHeyman is already the greatest goal-scorer in league history, she's won the most Golden Boots (three), won the equal-most Julie Dolan Medals (two), and was part of two championships and two premiership-winning teams with Canberra United.\nREAD MORE:\n\"300 games? Maybe with an extra A-League team, and you count the finals then 250 is not unrealistic,\" Jagarinec said.\n\"But 300 the way that she is, you don't write Michelle Heyman off - that's only about four seasons more. You look at Melissa Barbieri, she's 45 and still in the A-League, and Heyman at 36 years young, it's definitely not out of reach.\n\"We're making a conscious effort to make sure that we give her every chance to play as long as possible.\n\"She doesn't have retirement in her right now. She's a winner. The day will come, but until it's clear and she's ready, it's definitely not in the near future.\"\nHeyman will be celebrated at McKellar Park this Sunday afternoon to make her 200th A-League Women game, and a big crowd of Canberra United supporters are expected to cheer her on for the special occasion.\nSunday: Canberra United v Wellington Phoenix at McKellar Park, 3pm",
  "word_count": 1293,
  "scraped_at": "2026-02-14T12:19:56.321039"
}