{
  "article_id": "ca1ee7e3cad7",
  "url": "https://greatbendpost.com/posts/3ecac2c7-af18-48e4-a576-e8b8a8f55f51",
  "title": "Sunday Sports Headlines and Scores presented by Barton Community College",
  "date": "20251221T204500Z",
  "domain": "greatbendpost.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "CHICAGO (AP) — Caleb Williams threw a 46-yard touchdown pass to DJ Moore in overtime, and the Chicago Bears overcame a 10-point deficit late in the fourth quarter for a 22-16 win over the Green Bay Packers. Green Bay lost quarterback Jordan Love to a concussion. The Bears extended their lead in the NFC North to 1 1/2 games over the Packers with two to play and got some payback for a loss at Lambeau Field two weeks earlier. It was Chicago’s sixth win this season after trailing in the final two minutes and its most incredible — Green Bay had a win probability of 99%.\nLANDOVER, Md. (AP) — Three players have been ejected after a brawl involving plenty of others from the Eagles and Commanders broke out on the field late in the fourth quarter of Philadelphia's 29-18 victory that clinched the NFC East title. The confrontation happened Saturday night after Philadelphia’s Saquon Barkley scored on a 2-point conversion to boost his team’s lead to 19 points with about 4 1/2 minutes left. Javon Kinlaw and Quan Martin of the Commanders and Tyler Steen of the Eagles were disqualified after being flagged for unnecessary roughness. Commanders coach Dan Quinn didn't directly address whether it was disrespectful for the Eagles to go for 2 but he noted the teams play again in two weeks.\nEUGENE, Ore. (AP) — Perhaps it was James Madison going for it twice on fourth down on its first drive of the game. Or, maybe it was coach Bob Chesney calling for a wide receiver pass on the Dukes’ second series of the evening. Even 12th-ranked James Madison successfully pulling off a fake punt could have adequately explained what the scoreboard failed to convey. It was clear that the fifth-ranked Oregon Ducks were in a different class than their visitors in a 51-34 win in a College Football Playoff first round matchup Saturday at Autzen Stadium. Oregon led 48-13 midway through the third quarter before the Dukes added a trio of late touchdowns to make the final score appear closer than the game really was.\nOXFORD, Miss. (AP) — Trinidad Chabliss and Mississippi have aced their first test without former coach Lane Kiffin. The sixth-ranked Rebels beat No. 17 Tulane 41-10 on Saturday in the first round of the College Football Playoff. Chambliss passed for 282 yards and a touchdown and ran for two scores. Kewan Lacy also ran for a TD for Ole Miss. Recently promoted defensive coordinator Pete Golding had a triumphant debut as Kiffin's replacement, and Ole Miss moves on to face No. 2 Georgia in a CFP quarterfinal. The game was coach Jon Sumrall's last with Tulane. He's been hired as Florida's coach.\nCOLLEGE STATION, Texas (AP) — Malachi Toney’s tiebreaking 11-yard touchdown reception with less than two minutes left lifted No. 10 seed Miami to a 10-3 win over No. 7 Texas A&M in the College Football Playoff. Mark Fletcher Jr. had a career-high 172 yards rushing to help the Hurricanes (11-2) advance to the Cotton Bowl to face No. 2 seed Ohio State on Dec. 31.\nEUGENE, Ore. (AP) — Dante Moore threw four touchdown passes and ran for another score and No. 5 Oregon beat No. 19 James Madison 51-34 on Saturday night in a College Football Playoff opener. The Ducks (12-1) advanced to face Texas Tech in a quarterfinal game at the Orange Bowl on Jan. 1. Oregon won a playoff game for the first time since 2014, when the Ducks beat Florida State in the Rose Bowl semifinal before losing to Ohio State. James Madison (12-2) dropped Group of Five teams to 0-4 in CFP games. No. 17 Tulane fell 41-10 at No. 6 Mississippi as well Saturday. Oregon led 34-6 at the half.\nLANDOVER, Md. (AP) — The Philadelphia Eagles have won their second straight NFC East title. Jalen Hurts and Saquon Barkley led the Eagles to a 29-18 win over the Washington Commanders on Saturday night. The game included a late brawl after Barkley tacked on a 2-point conversion to increase the Eagles’ lead to 19 points. Hurts completed 22 of 30 throws for 185 yards, two touchdowns and no turnovers. Barkley had a 12-yard TD run as part of his 21-carry, 132-yard performance. It wasn't a terrific performance by the Eagles, who had a fumble on the opening kickoff and a pair of penalties on the tush push.\nINGLEWOOD, Calif. (AP) — Luka Doncic suffered an injury and didn't return after halftime of the Lakers' game against the Clippers. The Lakers say the NBA's leading scorer sustained a left leg contusion. Doncic had 12 points, five rebounds, and two assists in 19 minutes during the first half. The visiting Lakers trailed 54-39 at the break and went on to lose 108-88. Doncic missed his first six shots and picked up a technical foul. His absence left the Lakers even more short-handed. Rui Hachimura missed his first start of the season with a sore groin, while Deandre Ayton and Austin Reaves have been out.\nVAL D'ISERE, France (AP) — Sofia Goggia finally got the win her skiing this season deserved in a World Cup super-G on Sunday and Lindsey Vonn was third for the second straight day at French resort Val d'Isere. The two former Olympic downhill champions were split on a high-class podium by runner-up Alice Robinson who is already a two-time winner this season on the World Cup circuit. Goggia finished 0.15 seconds ahead of Robinson. The 41-year-old Vonn then hit a high speed touching 115 kph (71 mph) but the ideal racing line was elusive and she finished 0.36 behind Goggia.\nKaillie Humphries Armbruster has achieved a significant milestone by winning a World Cup two-woman bobsled race in Sigulda, Latvia. This marks her first victory since turning 40 and becoming a mother. She teamed up with Emily Renna to secure the win, breaking Germany's 20-race winning streak in the event. Humphries Armbruster now has 31 World Cup two-woman wins and 43 career victories, including Olympics and world championships. The U.S. women’s team is gaining momentum as the Milan Cortina Olympics approach, with strong performances from Kaysha Love and Elana Meyers Taylor.\nFinals\nNATIONAL HOCKEY LEAGUE\nFinal Detroit 5 Washington 2\nFinal SON-Y Rangers 5 Philadelphia 4\nFinal Minnesota 5 Edmonton 2\nFinal Ottawa 6 Chicago 4\nFinal SO Buffalo 3 N-Y Islanders 2\nFinal St. Louis 6 Florida 2\nFinal Montreal 4 Pittsburgh 0\nFinal Nashville 5 Toronto 3\nFinal Tampa Bay 6 Carolina 4\nFinal SO Vancouver 5 Boston 4\nFinal Seattle 4 San Jose 2\nFinal Calgary 6 Vegas 3\nFinal Anaheim 4 Columbus 3\nNATIONAL FOOTBALL LEAGUE\nFinal Philadelphia 29 Washington 18\nFinal OT Chicago 22 Green Bay 16\nTOP-25 COLLEGE FOOTBALL\nFinal (10)Miami 10 (7)Texas A&M 3\nFinal (6)Mississippi 41 (17)Tulane 10\nFinal (5)Oregon 51 (19)James Madison 34\nTOP-25 COLLEGE BASKETBALL\nFinal (1)Arizona 68 San Diego State 45\nFinal (19)Texas Tech 82 (3)Duke 81\nFinal (6)Purdue 88 (21)Auburn 60\nFinal (8)Houston 94 (14)Arkansas 85\nFinal (9)Michigan State 79 Oakland 70\nFinal (11)Louisville 94 Montana 54\nFinal (12)North Carolina 71 Ohio State 70\nFinal Kentucky 78 (22)St. John's 66\nFinal (23)Virginia 80 Maryland 72",
  "word_count": 1196,
  "scraped_at": "2026-02-14T12:37:25.323704"
}