{
  "article_id": "ca381c581530",
  "url": "https://www.businessweekly.co.uk/posts/aline-miller-eyes-incredible-opportunity-through-ai-progress",
  "title": "Aline Miller eyes incredible opportunity through AI progress",
  "date": "20260106T011500Z",
  "domain": "businessweekly.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Aline Miller eyes incredible opportunity through AI progress\nWomen4Technology spoke with Miller - Associate Vice President for Enterprise at the University of Manchester, former CEO of Manchester Biogel, and now Chief Scientific Officer of Unit M, and Executive Committee member for Sister - about entrepreneurship, regional innovation, the Cambridge–Manchester partnership, and her vision for the future of inclusive growth.\nQ - Aline. You've built an impressive career spanning research, commercialisation and now innovation leadership. Was entrepreneurship always part of your vision or were there pivotal moments or people that influenced your decision to step beyond research and academia?\nA - Entrepreneurship and innovation definitely weren’t on my radar at the start. I was very focused on fundamental research, on being inquisitive, understanding how molecules self-assemble, and exploring the physics behind it. I never had a specific end goal, but I always wanted to do work that was interesting and challenging in equal measure. After about 10 years as an academic, having been promoted, I found myself asking: do I just carry on like this for the next 10 or 20 years? What else can I do?\nAt the same time, the funding landscape was shifting towards creating impact and considering end application. Even if you worked on fundamentals, you needed to show how your research might ultimately be useful, and that’s absolutely right when you’re using taxpayers’ money. In our case, we were beginning to think about applications in areas like regenerative medicine, and getting involved in more interdisciplinary collaborations. Accelerator initiatives were also just starting to come through and touch academia.\nWe had a large EU grant that brought together materials scientists, cell biologists, clinicians, veterinarians, and industry partners. The consortium’s Business Development Manager asked my collaborator and me how we might commercialise the materials we were creating. That really planted the seed.\nAround the same time, researchers at conferences kept asking for collaborations. We’d send them our powders and a recipe, but they could never reproduce a homogeneous, stable material. I joke that it’s like my cooking: the final dish never looks like the picture in the recipe book. So, we realised there was an opportunity to make and sell ready-to-use products. Those two things came together, and that’s when we decided to take the jump and give it a go.\nQ - So, that was the start of Manchester Biogel, the company you co-founded and then led as CEO to a successful exit to Cell Guidance Systems in 2023. What were the biggest challenges in transitioning from academic researcher to CEO?\nA - There were many - and we made plenty of mistakes - but we learned from them. The first challenge was moving away from an academic mindset to an entrepreneurial one. Realising that you can have an opportunity and an idea, and that’s fine, but it has to solve a real problem and you have to be able to articulate the value proposition very clearly.\nThe second challenge was building the right team. Running a commercial team is very different from an academic one. People have different motivations, and keeping everyone aligned to your company’s North Star is quite different, as is the diversity that you need within the team. In academia, to a certain extent you’re hiring in your own image, because you’re all researchers and have fairly similar skill sets for different projects. In a company, of course, you need scientists, QC managers, marketing and sales people, all with distinct skills and motivations. That was a steep learning curve. The first salesperson I hired was really a researcher. I learned quickly that if a salesperson isn’t motivated to get up in the morning to make money, they’re not a salesperson!\nQ - As Chief Scientific Officer of Unit M, you’re working to maximise the University’s impact on the region’s economy and society, and you’ve set an ambitious goal: for the University to become the most innovative in Europe, powering a globally leading inclusive innovation system. Can you tell us more about your approach? Who are you working with, and how are you fostering inclusive growth?\nA - It’s a really exciting time to be at the University, focusing on how we generate impact from research and really accelerate and supercharge that growth through societal and commercial enterprises. We’ve recently launched a 10-year strategy, and becoming Europe’s leading innovation university is at the heart of it. Aim high!\nI currently work closely with our Pro-Vice-Chancellor for Civic Engagement and Innovation, John Holden, and a rapidly-growing Unit M team, now 14 people strong. We’re a relatively new, dynamic team looking to make a step change in both what we do and the way we do it. We’re trying to create new ways to partner with the University, and supporting ideas all the way through to impact in its broadest sense.\nOne of the most exciting developments is that we’ve broadened the definition of innovation. It’s no longer just about tech transfer or commercialising IP. It’s about student entrepreneurship, life-long learning and place. At the University of Manchester we have 47,000 students, and the latest survey shows that around half are considering something entrepreneurial. So how do we capture that energy? How do we support them, whether they want to create a startup or service business, or whether they want to take entrepreneurial skills into an SME environment? We’re supporting the Masood Entrepreneurship Centre to expand their reach and put in new programmes to help catalyse those activities.\nWe’re also looking at how we partner with businesses, from local SMEs to large corporates. The University already has a strong track record in research partnerships, and now we want to broaden that. We’re working to build clusters within the region, nationally and beyond, strengthening supply chains for large corporates whilst also supporting micros and SMEs to grow. That support ranges from innovation grants and KTP studentships, to consultancy, larger contract research, leveraged UKRI funding, and CPD. As a university it’s our bread and butter to train the next generation of students, but the needs of the workforce are changing fast.\nQ - AI and engineering biology are transforming industry at pace. Regionally and nationally, there’s a big push around getting biomanufacturing into play to support sustainability goals. So how do we upskill and reskill the current workforce to take advantage of these developments?\nA - It’s about educating everyone, from plant operators to marketing teams to the C-suite, so they understand the opportunities, and what will give them competitive advantage in the workplace. So they can adopt new technologies effectively, to meet new products, processes and sustainability goals, both from a knowledge and learning perspective, but also so that new innovations can be rolled out seamlessly.\nPartnership is fundamental to that. Manchester is a civic university, founded through philanthropy and built in collaboration with the city, so we work closely with the Manchester Combined Authority. Through that partnership, we can access devolved innovation funding and we have the space and infrastructure to support growth. That means not just incubation space for new ventures, but grow-on space for companies to scale within the region. And we hope to attract organisations from elsewhere too, because we have manufacturing capability, room for office clusters, and, we like to think, a great quality of life. I’ve heard there are also a couple of good football teams!\nThe new Cambridge-Manchester partnership builds on all of this. It allows both regions to leverage knowledge, expertise and space across a shared innovation corridor. It’s super exciting, and we’re only just getting started.\nQ - Yes, can you tell us more about the Cambridge-Manchester partnership? Your role as Executive Committee member for Sister (formerly Innovation District Manchester), puts you right at the heart of connecting the two innovation ecosystems. What practical steps are proving most effective in fostering collaboration?\nA - We’re still in the early stages of building out the partnership, and both sides are recruiting key people to co-ordinate and run activities. Right now, it’s all about building connections, nurturing relationships and learning from each other. Cambridge’s innovation ecosystem is more mature than Manchester’s, so we’re asking: how can we learn from Cambridge in terms of building out the support structures, and develop the people and expertise within the region to help ideas move from concept, through value proposition, to investment and growth?\nAt the same time, Manchester brings strengths in terms of creative tech. We’re known for sports and music. So how can we leverage that in Cambridge? We’ve also got capacity and space in the region for companies to grow, and the skills within the region too. We’ve already begun with joint events: Cambridge NeuroWorks held an event in Manchester, and we have an AI learning event taking place here and livestreamed in Cambridge. I’ve been down to Cambridge a couple of times, speaking with accelerator teams, mentor networks and investors, then bringing that knowledge back to Manchester and embedding it so we can fast-track ideas through to impact.\nQ - As Gender Equality Lead for the University from 2014–18, you achieved the first departmental Athena SWAN Silver Award in Science and Engineering. You’ve spoken about your own early-career uncertainty, the ‘precarious path’ of postdoctoral roles, and the importance of women leaning in and ensuring their voices are heard. How do you balance the need for women to be strategic within current systems while also pushing for systemic change? What does genuine change look like?\nA - What I would love to see is gender parity all the way through, from GCSE and A-level choices, to undergraduate and postgraduate levels, right through to senior leadership and board positions. And not just gender parity, but across ethnicity and all underrepresented groups. We need role models across the whole piece, and we need those voices to be heard.\nWhen you look at the statistics, all-male founding teams are more likely to raise investment than mixed teams, and far more likely than all-female teams, despite all-female teams delivering 35 per cent higher returns on investment in comparison to their male counterpart. So how do we change that? We need visible role models and champions. Women are reaching senior positions now, just not in the numbers we need. So we need to encourage those who are there to talk openly about their journeys, whether linear or nonlinear (and both are great), and to be honest about the challenges. No one has a smooth path. Whether it’s balancing work with home life, whatever that may mean, whether family or caring responsibilities, or dealing with setbacks, it’s challenging, it’s the real world. Being open and honest is key.\nTalking about imposter syndrome is part of that honesty. It wasn’t until one of my heroines talked about having imposter syndrome that I realised how common it is. And, sharing failures is important. We’ve all had grant rejections, investment knock-backs or pitches that missed the mark. But being open about what went wrong, and what you learned, or how you pivoted, builds a resilient mindset. The more we talk about it, the more we share, the more it starts to become the norm. Because we know that the more diverse voices we bring to decision-making, the better the outcomes: stronger companies, better university pipelines, more students choosing STEM, and ultimately a more inclusive ecosystem. Keep championing, keep talking, keep being authentic along the way.\nQ - Your research in bio-based and biodegradable materials and in regenerative medicine has the potential to be transformational. For those of us less familiar, what makes bio-based materials so promising for real-world applications?\nA - There are two angles to it. Much of my work focuses on hydrogels, soft, solid materials, and this is going back to my fundamental physics focus. We design short peptide molecules, made up of natural amino acids, that self-assemble one on top of another into fibrils. These fibrils entangle, a bit like spaghetti, to form three-dimensional hydrogel matrices that are very similar in structure to our natural tissues.\nBecause the materials are biocompatible and mimic the extracellular matrix, they provide an ideal home for cells. When we place cells throughout the matrix, and get the material–cell interactions right, they thrive; growing, depositing their own matrix and forming tissue. We use these systems for regenerative medicine, for repairing damage in cartilage, bone and other tissues. They’re also used to grow organoids, mini organs, for drug discovery, helping to reduce animal use. And they’re promising as drug-delivery devices.\nWe’re working on two exciting projects at the moment. One, delivering treatments into the back of the eye for wet macular degeneration, and the other delivering hormones and anti-inflammatories to treat endometriosis. One is in partnership with an external company, and the other we hope will form the basis of a new spin-out, taking all the lessons (and mistakes!) from my first venture and channelling them into something new.\nQ - What’s your vision for women’s leadership in technology over the next decade?\nA - More of it! I’d love to see a truly diverse spectrum of women coming through, across ethnicities, backgrounds and generations. To be genuinely inclusive, we need to do a deep dive into communities that haven’t traditionally seen universities as places they could aspire to. So, going out into the wider communities and encouraging school children and other people within the community to think about how they could tap into innovation. Whether they have an idea to solve a service challenge, or they have a specific problem and they’re motivated to try to find a solution. My vision would be engaging these people in order to be properly inclusive and to diversify the entrepreneurial pipeline so that it draws on a whole range of backgrounds, not just university research.\nQ - Your diary must be very full. I don’t imagine that you have the luxury of a lot of free time. But, when you do have a day off, where do you find inspiration? What are you currently curious about?\nA - Great question. I have a family, so any spare time I have, I try to spend with them, although they’re getting older now, so they don’t always want to spend it with me! I have three boys, and each is very different. One is studying physics and thinking about finance, which gives him such a different perspective. Another has chosen not to go to university, he wants to be a pilot. How he navigates a slightly less academic, conventional route is very inspiring for me and I’m learning a lot. The youngest loves deep space, so I’m learning a lot about the wider universe from him.\nIf I had more spare time, I’d love to dive into the psychology and sociology of what motivates people. To look at how background and life experiences shape decisions, whether to go to university and become an academic, or to join a corporate, or what is inherent in some people that makes them want to be an entrepreneur and take risks in some of their life choices. Even beginning to understand those thought processes would be fascinating.\nScientifically, I’m increasingly curious about engineering biology. Much of my work draws inspiration from nature, the thousands of years biology has spent perfecting molecular assembly and efficient materials. Engineering biology takes that to another level: harnessing biological processes and re-engineering them to do things we’ve never seen in nature.\nWith the adoption of AI, putting that into the mix, the opportunities are incredible, from next-generation medicines, to sustainable food production, to replacing fossil-fuel-derived carbon through recycling and upcycling current carbon sources. I’d love to understand more about how people are engineering cell biological pathways and host chassis to make that possible.",
  "word_count": 2617,
  "scraped_at": "2026-02-14T13:23:55.819099"
}