{
  "article_id": "ca5c47c6ffc6",
  "url": "https://www.justarsenal.com/4-gunners-in-england-women-lionesses-squad-to-face-germany-at-wembley-this-friday/378736",
  "title": "4 Gunners in England Women Lionesses squad to face Germany at Wembley this Friday",
  "date": "20241022T161500Z",
  "domain": "justarsenal.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "England’s Lionesses are gearing up for two high-stake friendlies this month as they prepare for the UEFA Women’s EURO 2025, and there will be 4 Gunners in the squad! As reigning Euro 2022 Champions, their place in the finals is already secured. The squad will host Germany and South Africa, testing their talent and ambition ahead of next summer’s tournament in Switzerland.\nUpcoming Matches\nGermany vs. England\nDate: Friday, October 25, 2024\nTime: 19:30 BST\nVenue: Wembley Stadium\nThis match is particularly significant as it marks a rematch of the UEFA Women’s EURO 2022 final, where England triumphed over Germany to claim their first major trophy.\nSouth Africa vs. England\nDate: Tuesday, October 29, 2024\nTime: 19:45 BST\nVenue: Coventry Building Society Arena\nThis will be the first meeting between these two teams since February 2010, when England secured a narrow victory during the Cyprus Cup.\nLionesses captain Leah Williamson, along with forwards Beth Mead and Alessia Russo, played pivotal roles in securing qualification with a crucial draw against Sweden in July. They are joined by Lotte Wubben-Moy for these friendlies, as she returns from injury.\nHead coach Sarina Wiegman emphasized the importance of these matches for preparing the team for the upcoming EUROs, stating, “Qualifying directly for the finals provides us with a very valuable opportunity to play four friendlies this autumn and lay the foundations for next summer”\nWith tickets still available for both fixtures, Wiegman expressed her hope for strong fan support: “The fans are always so brilliant whenever we play… we’d love as much support as possible and another two memorable atmospheres”\nAs the Lionesses look to build momentum ahead of their Euro title defense, these matches will not only serve as preparation but also as a celebration of women’s football in England, which has grown exponentially since the Lionesses won Euro 2022.\nAre you travelling to Wembley Gooners?\nMichelle M\nFollow JustArsenal’s Gooner Women on Just Gooner Women on Twitter for regular updates on the Arsenal Womens Team!\nDo you want to read more about the Arsenal Women’s Team? Click here….",
  "word_count": 346,
  "scraped_at": "2026-02-14T13:05:30.960911"
}