{
  "article_id": "ca7807b79e7c",
  "url": "https://www.thenationalnews.com/news/mena/2025/04/30/lebanese-president-joseph-aoun-urges-us-to-pressure-israel-to-stop-attacks/",
  "title": "Lebanese President Joseph Aoun urges US to pressure Israel to stop attacks",
  "date": "20250430T104500Z",
  "domain": "thenationalnews.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Lebanon's President Joseph Aoun has urged the US-led committee overseeing the Israel-Hezbollah ceasefire to increase efforts to stop Israeli attacks, days after Beirut was bombed despite a truce being agreed on in November.\nThe Lebanese government is also under pressure from Hezbollah to stop the attacks. Israel bombed Beirut on Sunday for the third time since November. It also continues to bomb south Lebanon on a daily basis against perceived threats from Hezbollah.\nThrough remarks to US Maj Gen Jasper Jaffers, who chairs the committee, Mr Aoun called for pressure on Israel to withdraw from the five points of Lebanese territory it still occupies and return all Lebanese prisoners. Israeli forces were supposed to have withdrawn fully by January under the ceasefire deal.\nMaj Gen Jaffers was introducing his successor as co-chairman of the committee, Maj Gen Michael Leeney, at the presidential palace in Baabda.\nLebanon and Hezbollah have repeatedly said they are complying with the terms of the ceasefire but breaches have been recorded on both sides.\nMr Aoun, a former army commander, said the Lebanese military is confiscating Hezbollah weapons and taking over its positions in south Lebanon as per the terms of the ceasefire.\nHezbollah chief Naim Qassem said the Lebanese government must do more to stop the attacks, as he accused Israel of violating the ceasefire terms 3,000 times.\n“Put pressure on America and make it understand that Lebanon cannot rise if the aggression doesn’t stop,” he said in a televised speech.\nThe Lebanese government is under international pressure, as well as some internal demands, to disarm Hezbollah. Mr Aoun has said he wants to bring all non-state weapons under the control of the military by the end of the year, but has insisted this must be done diplomatically and not by force.\nHezbollah has vaguely said it is open to discussions about a national defence strategy – but only after Israel withdraws fully and returns the prisoners. The Lebanese armed group and political party was weakened severely by the war with Israel last year but still remains a potent threat.\nIsrael's war on Lebanon reduced vast parts of the country to rubble and killed more than 4,000 people. It also eliminated almost all Hezbollah's senior commanders and destroyed much of its arsenal.\nThe Lebanese government said this month that 190 people have been killed and 485 injured in Lebanon by Israeli strikes since the ceasefire took effect.",
  "word_count": 402,
  "scraped_at": "2026-02-14T12:11:41.455820"
}