{
  "article_id": "caa2ba373ddd",
  "url": "https://www.theadvocate.com.au/story/8671605/devonport-strikers-dominant-first-half-leads-to-2-0-win/?cs=2605",
  "title": "Devonport Striker dominant first half leads to 2 - 0 win | The Advocate",
  "date": "20240623T010000Z",
  "domain": "theadvocate.com.au",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "A strong performance in the first half was enough for Devonport Strikers' coach Tom Ballantyne to make several half-time changes ahead of \"very big games coming up\".\nSubscribe now for unlimited access.\nor signup to continue reading\nThe Strikers went head-to-head with Riverside on Saturday, June 22, scoring two first half goals to record a 2-0 round 11 NPL victory at Valley Road.\nDespite missed opportunities in the first half, Ballantyne felt his side had done enough to \"put the que in the rack a little bit\".\n\"It went very much to plan, especially in the first half,\" Ballantyne said.\n\"We played very nice football [and] could have had another 22 goals. A couple of decent saves from their keeper kept them in the game.\n\"In the second half they were a bit more direct and caused a few issues.\n\"With about 30 minutes to go we were able to rest a few of our forward players knowing that we've got some very big games coming up.\"\nRiku Ichimura opened the scoring in the seventh minute of the game before Nick Lanau-Atkinson found the back of the net half-an-hour later.\nIchimura was praised by Ballantyne for a \"fantastic\" performance, while Taylor Last and Dominic Smith were also among the Strikers' best players.\nIt also went to script for the Women's Super League side who turned a blistering 8-0 half time lead into 10-0 against Riverside to remain unbeaten - a performance Ballantyne could hardly fault.\n\"The women in the first half were superb, we could have been 13-nil at half time,\" he said.\n\"We came back out and Riverside sat even deeper, were even harder to break down and the game turned into a bit of a stalemate mate in the second half.\"\nAmong the Strikers' goal scorers were Georgia King, Annalee Bidwell, Lucy Foote, Dani Capel, Whitney Knight and Madeline Payne.\nBoth sides will travel to face South Hobart in round 12.",
  "word_count": 323,
  "scraped_at": "2026-02-14T12:41:29.352160"
}