{
  "article_id": "caaf7af3f791",
  "url": "https://www.dailymail.co.uk/news/article-13406613/gary-lineker-gaza-israel-quiet-speaking.html",
  "title": "Gary Lineker insists he WONT stop speaking out on Gaza",
  "date": "20240511T090000Z",
  "domain": "dailymail.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Gary Lineker insists he WON'T stop speaking out on Gaza saying: 'There's a lot of heavy lobbying on people to be quiet but I can't be silent'\n- The BBC commentator said he had to speak out because he is 'fairly secure'\nGary Lineker has broken cover once again to insist he won't stop speaking out about Gaza - as he claims he 'can't be silent'.\nThe controversy-prone BBC commentator claimed there is 'heavy lobbying' against people who speak out against Israel but said he had to speak out because he is 'fairly secure'.\nHis comments came as part of an interview with Guardian columnist and prominant Israeli critic Mehdi Hasan for 'independant and unfliltered' news site Zeteo.\nThe former England captain, 63, has previously landed himself in hot water for his political interventions which critics see as flagrant breaches of the BBC's impartiality rules.\nIn January he said he recieved threats after he retweeted and later deleted a post on social media calling for Israel to be banned from international sporting events, including football - leading to him being hailed by Hamas' mouthpiece news agency.\nBut speaking to Zeteo, he said: 'There is a lot of heavy lobbying on people to be quiet so I understand why most people refrain but I'm getting on a bit now, I'm fairly secure and I can't be silent about what's happening.\nGary Lineker (pictured) claimed there is 'heavy lobbying' against people who speak out against Israel but said he had to speak out because he is 'fairly secure'\nHis comments came as part of an interview with Guardian columnist and prominant Israeli critic Mehdi Hasan for 'independant and unfliltered' news site Zeteo\n'I think it's just so, so utterly awful and now they're talking about: \"Oh, it looks like it's happening, going into Rafah\", where they've sent everybody down there.\n'So I don't see how you can be - it's not anti-Semitic to say that what Israel is doing is wrong. I just can't see how everybody doesn't see it that way now.\n'But whatever the cause, whatever started it - we all know that the history of this area of the world goes way before October 7th. But it's truly dreadful what's happening.\n'And I cry on a regular basis when I see certain images on social media.'\nCommenters flocked to praise the Match of the Day star, as he gained praise for\nBaroness Jenny Jones of Moulsecoomb - the Green Party former Deputy Mayor for London - said: 'I woke up tired, after another week of pushing back on stupid legislation from the Govt, but Gary Lineker speaking out is a bright point for today.'\nLouise Mathews added: 'My biggest celeb crush as a teen was Gary Lineker and I applaud wee teen me. Not only is he gorgeous but he is brave, fair and uses his platform for the good of human rights.'\nAnd a third - Sinead Kehoe - said: 'It's so rare to hear the truth from public figures that when you hear it, it's so refreshing. Gary Lineker is a class act\nThe Zeteo news website has been a prominant critic of Israel's involvement with Gaza, with more than two thirds of the videos they have produced being focused on the conflict.\nThe former England captain, 63, has previously landed himself in hot water for his political interventions which critics see as flagrant breaches of the BBC's impartiality rules\nThe Zeteo news website has been a prominant critic of Israel's involvement with Gaza, with more than two thirds of the videos they have produced being focused on the conflict. Pictured: Zeteo founder and host of Mehdi Unfiltered Mehdi Hasan\nThe first work pulished on their YouTube channel is called 'Debunked! Top Seven Lies About Gaza', while their 'people' include outspoken fellow Guardian columnist Owen Jones and climate activist Greta Thunberg.\nLineker, who was temporarily taken off air by the BBC after being caught up in an impartiality row last March, said that many people feared speaking out on Gaza because they get 'accused of being a supporter of Hamas'.\nIt was reported early this year that Lineker took down a reposted tweet from a pro-Palestinian account calling for Israel to be banned from sporting tournaments because of an apparent misunderstanding.\nThe Daily Telegraph said the former England footballer was not fully aware of what he was sharing. According to a source, he believed it was a news item about Israel being banned, rather than a call for this to happen.\nThe Quds News Network, a Palestinian youth news agency affiliated to Hamas, published a story on its website trumpeting Lineker's reposting of the proposed ban with the headline, 'Renowned English broadcaster calls for Israel to be banned from international [football]'.\nPoliticians told the BBC to 'enforce its own guidelines' and take action against the 'out of control' Match of the Day host.\nIn December, a Tory MP reported Lineker to the BBC after the Match of the Day host launched a series of taunts against Tory politicians. The BBC's chairman, Samir Shah, told MPs the online attacks appeared to have breached the corporation's social media guidelines.\nLineker continued: 'It's the worst thing I've seen in my lifetime. I've seen so many images of children that, you know -\n'I've go no skin in this game. I'm not Muslim, I'm not Jewish, I'm not Israeli, I'm not Palestinian.\nGary Lineker previously retweeted this message calling for Israel to be punished by FIFA\nThe Hamas mouthpiece Quds lavished praise on the 'renowned English broadcaster'\n'So I see it, I think, purely from the outside as from a neutral perspective. And I can't think of anything that I've seen worse in my lifetime. The constant images of children losing their lives day in, day out.\n'Now, obviously, we all know, you know, October 7th happened and you know, the unmasking. But the minute you raise your voice against what they're now doing there, you get accused of being a supporter of Hamas, or, you know, this kind of stuff.'\nThe row comes as the Biden administration said that Israel's use of U.S.-provided weapons in Gaza likely violated international humanitarian law - but wartime conditions prevented US officials from determining that for certain in specific airstrikes.\nThe finding of 'reasonable' evidence to conclude that the U.S. ally had breached international law in its conduct of the war in Gaza was released in a summary of a report being delivered to Congress on Friday. It is the strongest statement that the Biden administration has made yet.\nBut the caveat that the U.S. was unable immediately to link specific U.S. weapons to individual strikes by Israeli forces in Gaza could give the administration leeway in any future decision on whether to restrict provisions of offensive weapons to Israel.\nIsrael launched its offensive after an Oct. 7 assault into Israel, led by Hamas, killed about 1,200 people.\nTwo-thirds of the Palestinians killed since then have been women and children, according to local health officials. U.S. and U.N. officials say Israeli restrictions on food shipments since Oct. 7 have brought on full-fledged famine in northern Gaza.\nHuman rights groups long have accused Israeli security forces of committing abuses against Palestinians and have accused Israeli leaders of failing to hold those responsible to account.\nIn January, in a case brought by South Africa, the top U.N. court ordered Israel to do all it could to prevent death, destruction and any acts of genocide in Gaza, but the panel stopped short of ordering an end to the military offensive.\nIsrael says it is following all U.S. and international law, that it investigates allegations of abuse by its security forces and that its campaign in Gaza is proportional to the existential threat it says is posed by Hamas.\nMost watched News videos\n- Extraordinary moment mass brawl breaks out between Brits on flight\n- Finance expert's TV interview interrupted by adorable granddaughter\n- Moment driver veers to target e-bike riders before killing teen\n- Moment Swiss bar fire owners collapse after being confronted\n- Astonishing moment a street is swallowed by a sinkhole\n- Chilling police interview of ISIS fanatic plotting UK attack\n- Food vlogger dies after 'eating toxic devil crab'\n- Spy cam shows woman on her knees next to Jeffrey Epstein\n- Deepak Chopra confronted over his relationship to Epstein\n- Toddler opens car door in traffic and sends biker flying\n- New video shows man with backpack similar to Guthrie kidnapper\n- Israeli hostage reveals how she survived being tortured",
  "word_count": 1427,
  "scraped_at": "2026-02-14T12:08:52.613529"
}