{
  "article_id": "cad2bb03ffce",
  "url": "https://punchng.com/setting-business-agenda-for-current-administration/",
  "title": "Setting business agenda for current administration",
  "date": "20230619T004500Z",
  "domain": "punchng.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "On Thursday, October 22, 2022, the All Progressives Congress presidential candidate released an 80-page policy document highlighting an eight-point agenda. Top on the priority lists of the agenda which detailed what Asiwaju Bola Tinubu planned to do as President was national security, economy, agriculture, power, oil and gas, transportation and education. In his manifesto, Tinubu said his objective was to foster a new society based on shared prosperity, tolerance, compassion, and the unwavering commitment to treating each citizen with equal respect and due regards.\nThe former Lagos State governor promised to: One: build Nigeria, especially for our youths, where sufficient jobs with decent wages create a better life. Two: manufacture, create, and invent more of the goods and services the country requires. He said Nigeria shall be known as a nation of creators, not just of consumers. Three: export more and import less, strengthening both the naira and our way of life. Four: assist the struggling and toiling farmers, through enlightened agricultural policy that promotes productivity and assures decent incomes, so that farmers can support their families and feed the nation. The commodity board will be introduced to assist farmers in production and marketing of their products.\nFive: modernise and expand public infrastructure so that the rest of the economy can grow at an optimal rate. Six: embolden and support young people and women by harnessing emerging sectors such as the digital economy, entertainment and culture, tourism and others to build the Nigeria of tomorrow, today. Seven: train and give economic opportunity to the poorest and most vulnerable among us. We seek a Nigeria where no parent is compelled to send a child to bed hungry, worried whether tomorrow shall bring food. Eight: generate, transmit and distribute sufficient, affordable electricity to give our people the requisite power to enlighten their lives, homes, and dreams. State governments shall be encouraged to generate electricity.\nNine: make basic healthcare, education, and housing accessible and affordable for all. Ten: And, most importantly, establish a bold and assertive policy that will create a strong, yet adaptive, national security architecture and action to obliterate terror, kidnapping, banditry, and all other forms of violent extremism from the face of our nation. In his inaugural speech on Monday, May 29, 2023, President Bola Tinubu used the opportunity to reiterate the priority of his administration. The new leader promised to create at least one million jobs for Nigerians, especially the youth. It is in line with this one million job promise that setting a business agenda for the President becomes a necessity.\nNigeria has a comparative advantage over and above most countries of the world in agriculture. The country is blessed with arable land, being a tropical nation, consumer market and high number of youth population. It will be productive if we invest in farm settlements where our vibrant unemployed youths who are interested in engaging in mechanised agriculture can have opportunities of becoming a modern farmer. The youths are Nigeria’s power house. Despite the numerous disappointments from the older generations, they have lived up almost to expectations by contributing their quotas, based on their ability, to the development of the country, with no or little support from the governments. They performed creditably well in international music front and information technology start-ups.\nAfrica’s fastest-growing unicorn startup, which has reached a $3bn valuation and is still driving the waves of digital payment, having processed over 200 million transactions worth over $16bn across 34 countries in Africa, Flutterwave, was started by three Nigerians. The company was founded in 2016 by Iyinoluwa Aboyeji, Olugbenga Agboola, and Adeleke Adekoya and is headquartered in San Francisco, California. Jumia, Opay and Andela were created by Nigerian youths. The duo of Tiwa Savage and David Adeleke (Davido) made us proud on the international music scene. While the former sang at the coronation of King Charles in London, the latter sang at the closing ceremony of the FIFA World Cup in Qatar. Before that, Nigerian-born Briton, Jacob Banks (Jacob Akintayo Akinoso) sang at the Commonwealth Games closing ceremony in Birmingham. Grammy’s award winner, Damini Ogulu, otherwise called Burna Boy co-headlined the 2023 UEFA Champions League Final kick-off show by Pepsi, at the Ataturk Olympic Stadium in Istanbul on Saturday, June 10, 2023. The rave of the moment, Victor Osimhen who broke the Golden Boot Award of Italian SERIE A, is a Nigerian youth.\nEfforts should be made by this administration to invest more on the youth who are the future of tomorrow. Though top on this government’s priority lists of action are national security, economy, agriculture, power, oil and gas, transportation and education, the government still needs to give the youth ‘mass employment’ priority. This will ensure efficiency of the Nigerian people, reduce abject poverty, and increase purchasing power of the people, thereby incentivising manufacturing and increasing revenue generation. The Federal Government, through the Central Bank of Nigeria, should identify all the items being imported, especially the finished goods and look for means of producing the same in Nigeria. Government should make an attempt in reviving the four refineries by selling them to investors who are ready to operate them.\nIt is a shame that Nigeria imported toothpicks to the tune of N26m from Germany and China in 2018 according to the National Bureau of Statistics. It is only through mechanised agriculture by a high number of rice farmers that the mega-rice mill established by Lagos State government will not go moribund. Our extinct textile industry should be revisited. Epileptic electricity supply, which forced some firms out of Nigeria, should be addressed. If we can revive the Oba Akran – Ikeja, and Apapa Industrial Estates in Lagos State alone, the problem of industrialising Nigeria is half-way solved. Football is a morning spinner. The Federal Government should show interest in making the football league attractive by inviting major players in the Nigerian business environment to sponsor teams and take over the administration of football as a business in Nigeria.",
  "word_count": 991,
  "scraped_at": "2026-02-14T12:45:43.052383"
}