{
  "article_id": "cae0ca414db7",
  "url": "https://www.essence.com/festival/2025-essence-festival-of-culture/tyler-perry-netflix-essence-fest-preview/",
  "title": "Exclusive : Netflix Gives ESSENCE Fest Fans A Front Row Seat To The Future Of The Tyler Perry Universe - Essence",
  "date": "20250706T183000Z",
  "domain": "essence.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "From iconic stageplays to drama-filled shows and films, the Tyler Perry universe has been a staple in nearly every Black household for over 20 years.\nAnd if the multi-year, first-look series and film deal he inked with Netflix in 2023 didn’t indicate it, the streaming company and entertainment mogul’s exclusive preview of a wide range of upcoming shows and films at the ESSENCE Festival of Culture main stage definitely confirms he has no plans to slow down any time soon.\nOn day one of the ESSENCE Festival of Culture, Netflix treated fans to exclusive, never-before-seen footage from some of Tyler Perry’s most anticipated upcoming series and films. Moderator Bevy Smith introduced a familiar face—Terri J. Vaughn, who many remember as Lovita Alizay Jenkins from The Steve Harvey Show. These days, she stars as Antoinette Dunkerson in the Netflix series Miss Governor, which returns for season two on August 14.\nComedian and actress Terri J. Vaughn made her debut not only as “number one on the call sheet” in season one of what was previously titled She The People – a political comedy that follows Vaughn as Mississippi’s first Black lieutenant governor – but she also makes her debut at the ESSENCE Festival of Culture to give fans more insight into the inspiration behind the series, as well as why she is so honored to play this role.\n“Playing Miss Governor, Antoinette Dunkerson, is the role of a lifetime for me,” Vaughn shares. “This role represents us on purpose. All of our women…all the black women in leadership roles and leadership positions and all the drama and crap that we have to put up with – that’s what this character represents. How we work to be the best that we can be in the midst of all the mess. So I am honored to represent her and play her.”\nShe also gives a major shout out to her fellow castmates, Jade Novah, Dyon Brooks, Karon Joseph Riley, and Jo Marie Payton, who we all still love and cherish as The Winslow Family’s mild mannered voice of reason and matriarch, Harriette Winslow. “Now she is not Mrs. Winslow on our show,” Vaughn warns. “She is a different kind of mama, and I love it.”\nThe ESSENCE Stage transitions from jokes and laughter to hot, sexy, and steamy as cast members Taylor Holidore Williams, Crystle Stewart, Julian Horton, and Ricco Ross take the stage to give fans a taste of what’s in store for season two of their hit Netflix show “Beauty in Black.”\nThe cast shares in excitement over their collective ESSENCE Festival debut, including Williams, who plays Kimmie. “It feels so good to be here,” Williams says. “I’m a Houston girl, so I know ESSENCE Fest through and through. It’s such a celebration of being black, and it just feels so good to be seen and to see y’all, so I’m excited.”\n“I got a lot of connections to New Orleans,” says Horton, who plays Roy Bellarie. “I played football, so I got to play in the Sugar Bowl [in college]. I played against the Saints here. I filmed my first movie [The House Invictus] in New Orleans. But at the same time, I’ve never been to ESSENCE Fest. The love has been tremendous. It’s been priceless. I’m glad to be here fasho.”\nIn terms of what fans can expect for season two of Beauty in the Black, they all agree on one word: crazy.\n“This season, Kimmie is all about coming into being a new wife, and most importantly a boss, but it’s not gonna be easy,” Williams shares about her character. Meanwhile, Stewart teases a no-nonsense facade when it comes to her character Mallory. “She is not having it. Mallory is NOT having it. That’s what you’re gonna see in season two.” Overall, though, she adds, “You get to delve into a lot of the characters more and peel back and unfold some of the layers, and what you find is…crazy. Absolutely crazy. A wild ride.”\n“With Roy, he’s crazy again. That’s all I’m gonna say,” Horton shares about his character in season two. “He does a lot in season one, but he does even more in season two. He’s a wild boy. So just be prepared.”\nMany fans were worried about the fate of Ross’ character, Bellarie patriarch Horace, who is sick with cancer.” A lot of people have been asking whether Horace will be back. Well the good news is: he’s not only back, but he’s better.”\nWhile the cast could not agree on whose character is the outright messiest, fans can weigh in when season two premieres Sept. 11, only on Netflix.\nFollowing the Beauty in Black special preview is a story that brings love, faith, and purpose front and center. Tyler Perry Studios and Netflix give fans an exclusive look at their new film Ruth and Boaz, a modern day retelling of the timeless Biblical love story brought to life by one of the most inspiring voices of faith-based films – producer DeVon Franklin.\n“We wanted to produce a movie to put love back in the culture. I promise…you’ve never seen black love on screen like this.” Franklin also adds that he and Perry are not stopping here, as this is just the first installment of an ongoing partnership between the two to produce even more faith-based films.\nFranklin gives fans a real treat in the form of one of ESSENCE’s Sexiest Men of the Moment – none other than Tyler Lepley, who portrays Boaz in the upcoming film. The exclusive sneak peek opens with Lepley – shirtless and hard at work on top of a roof on a hot, sunny afternoon. That’s it. That’s the scene.\n“The biggest thing for me was the fact that we got to put our own twist onto not just the story of Ruth and Boaz but what love looks like for us nowadays. Regardless of what we see on social media, real love will meet you right where you’re at,” Lepley shares.\n“Real love is not conditional,” Lepley continues, explaining what he hopes fans take away from the film. “Outside of the fact that this story comes from the Bible, what I truly feel in my heart is that God is always working, even when you don’t think he is, and that’s really what is going on in this story in terms of love.”\nThe film also features leading lady Ruth, played by Serayah, as well as Phylicia Rashad, who plays Naomi. Ruth and Boaz premieres Sept. 16 on Netflix.\nNetflix’s special presentation concludes with a never-before-seen clip of Tyler Perry’s Madea’s Destination Wedding.\nIn 20 years of Madea films, she has never been on vacation. Now, all of that is changing as the Simmons family’s matriarch is headed to the Bahamas for her grandniece Tiffany’s wedding. Not only that, she is bringing the entire: Joe, Cora, Mr. Brown, Aunt Bam, and the whole family.\nTo celebrate the film’s upcoming release, Netflix surprised one lucky couple in the audience with an all-expense paid trip to the beautiful Atlantis Paradise Island Bahamas – the same resort mirroring Madea’s.\nEveryone grab your bags and pop your popcorn when Madea’s Destination Wedding premieres next week, July 11, only on Netflix.",
  "word_count": 1209,
  "scraped_at": "2026-02-14T13:43:18.248466"
}