{
  "article_id": "cae21b23e028",
  "url": "https://apnews.com/article/womens-world-cup-england-haiti-acc7577c3cffcf9d3cebfaf6fd77d1da",
  "title": "England won , but it was a far from convincing start to its Women World Cup bid",
  "date": "20230723T050000Z",
  "domain": "apnews.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "England won, but it was a far from convincing start to its Women’s World Cup bid\nEngland won, but it was a far from convincing start to its Women’s World Cup bid\nSYDNEY (AP) — As European champions and one of the favorites to lift the Women’s World Cup, England was always expected to make a winning start.\nAt least the Lionesses can tick that item off the checklist.\nBeyond that, there were few positives to take from an unconvincing 1-0 victory Saturday night against Haiti, which was making its debut at the global tournament.\nA twice-taken Georgia Stanway penalty was the difference between the teams that are ranked fourth and 53rd by soccer’s world governing body.\n“It’s so important to win your first game in a tournament. It’s been a long build-up to today and we’re kind of happy to just get over the line,” a relieved Stanway said in the wake of the game.\nThe sense back in England was that it was an underwhelming start for a team that has had its problems recently.\nHaiti — particularly through the outstanding 19-year-old forward Melchie Dumornay — could yet throw up some surprises at the tournament being co-hosted by Australia and New Zealand.\nEngland’s struggles in Brisbane, however, seemed to be more of its own making as its run of game time without a goal from open play stretched to more than seven hours, including a behind-closed doors warm-up game against Canada that ended 0-0.\nInjuries have undoubtedly disrupted England’s preparations with key players Beth Mead, Fran Kirby and Leah Wiliamson all ruled out. Captain Millie Bright started against Haiti in a return from a knee injury she sustained in March, and she appeared to be uneasy for much of the game.\nA dispute with the English Football Association over bonuses and commercial arrangements has also cast a shadow over the build up, even if the players have decided to pause negotiations to focus on the World Cup.\nCoach Sarina Wiegman needs to find a way to get her team back into gear on the field after the triumph of last year’s Euros.\nOnly six members of the lineup that started the final against Germany at Wembley last July were in the XI on Saturday, and consequently England lacked cohesion.\nMost notable was its lack of cutting edge.\nRecord goal scorer Ellen White retired and is working as a pundit for the BBC during the tournament.\nIn her place against Haiti was Alessia Russo, who was the subject of a reported world record bid worth 500,000 pounds ($642,000) from Arsenal last season as a result of her outstanding form for Manchester United. She eventually joined the London team as a free agent this month and was selected for England’s World Cup opener ahead of Rachel Daley, the leading scorer in the Women’s Super League.\nDespite that show of faith from Wiegman, Russo wasn’t able to get her World Cup account up and running. England’s attacking threat was hardly improved when Daley replaced her in the 76th minute.\nIt wasn’t that England didn’t have its chances, registering 19 shots with 10 on target. It was an issue of its failure to convert.\n“We did create chances, but we lost the ball and then they were gone. That was hard for us,” Wiegman said. “Sometimes we had the last pass instead of shooting ourselves. I hope the next game in open play we can score a goal.”\nWiegman had wrestled over the decision about who to start at the point of her attack, and that may be her biggest dilemma again ahead of England’s second Group D game against Denmark in Sydney on Friday.\n___\nJames Robson is at https://twitter.com/jamesalanrobson\n___\nMore AP Women’s World Cup coverage: https://apnews.com/hub/fifa-womens-world-cup",
  "word_count": 627,
  "scraped_at": "2026-02-14T12:16:45.322329"
}