{
  "article_id": "caf88dac3a7c",
  "url": "https://metro.co.uk/2024/05/28/erik-ten-hag-blasts-ajax-getting-rid-two-players-man-utd-move-20922369/",
  "title": "Erik ten Hag blasts Ajax for getting rid of two players after his Man Utd move",
  "date": "20240528T134500Z",
  "domain": "metro.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Erik ten Hag has slammed Ajax’s decision to offload Davy Klaassen and Daley Blind after he joined Manchester United and claims the Dutch club’s hierarchy have ‘made a mess’ of the squad.\nTen Hag won three Eredivisie titles and two KNVB Cups during his time as Ajax manager before his move to United in 2022 with both Klaassen and Blind playing key roles in his team.\nHowever, Ajax allowed Blind to leave on a free transfer seven months after Ten Hag’s departure, while Klaassen was also allowed to join Inter as a free agent after his contract was terminated last September.\nAjax, meanwhile, have endured one of their worst seasons in Eredivisie history, finishing fifth in the table and 35 points behind champions PSV.\n‘The squad is completely out of balance, you really need to improve that,’ Ten Hag told Voetbal International about Ajax’s current situation.\n‘And that also takes time, maybe it will take another year, because they have made a mess of it. That is unprecedented.\nGet your football fix\nDon't want to miss the week's biggest football stories? Metro's exclusive football newsletter, In The Mixer, is your essential guide.\nFrom the latest transfer rumours and managerial moves to analysis of the biggest games and a lot more, our experts have you covered.\nSign up here, it's an open goal.\n‘How were they able to say goodbye to players like Daley Blind and Davy Klaassen? I really thought that was so scandalous, the way that happened. So bad for Ajax.\n‘They should never have gotten rid of Davy Klaassen. Such a player is so important for the group, for the club. You want to guard that DNA, you must guard it. He will always continue to go for your club, even if others give up, because he is a true Ajax player. Daley Blind same story. How stupid can you be?\n‘It is such a beautiful club and we have created so many beautiful things there, you hope that the club can continue to build on that.’\nTen Hag also hit out at Ajax’s treatment of their former director of football Marc Overmars, who received a one-year ban for sending inappropriate messages to women during his time at the Dutch club.\n‘Technically it has become a complete chaos. On all levels. For example, look at Young Ajax this season, they finished almost at the bottom of the First Division, in my opinion that always says a lot about the technical condition. And the first-team squad is completely out of balance. It went from bad to worse,’ Ten Hag said.\n‘A lot can be traced back to the dismissal of Marc Overmars. His departure was killing for the club. I maintain that I find it scandalous what they did to Overmars.\nMore Trending\n‘From a club perspective, it was also so stupid how they approached that, by immediately throwing him under the bus.\n‘That was already clear to me at the time, but I now think for everyone – Overmars was the crucial and binding factor in the club management in terms of football. When he left, it all fell apart and it became one big anarchy in the organisation.’\nFor more stories like this, check our sport page.\nFollow Metro Sport for the latest news on Facebook, Twitter and Instagram.\nMORE: Edu explains Arsenal transfer approach and makes cryptic Manchester City comment\nMORE: Newcastle United respond to Arsenal asking price for Aaron Ramsdale",
  "word_count": 575,
  "scraped_at": "2026-02-14T13:12:46.860268"
}