{
  "article_id": "cb06aeebcdb6",
  "url": "https://www.nydailynews.com/2025/02/11/readers-sound-off-on-the-super-bowl-mvp-paper-straws-and-invective-against-immigrants/",
  "title": "Readers sound off on the Super Bowl MVP , paper straws and invective against immigrants",
  "date": "20250211T094500Z",
  "domain": "nydailynews.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Jalen Hurts shows us how to overcome adversity\nBrooklyn: Jalen Hurts is now a Super Bowl champion and Super Bowl MVP. Let that sink in. After years of perseverance, countless doubters and every challenge thrown his way, he has risen above them all. On the grandest stage in football, Hurts delivered a performance that will be remembered for generations. He didn’t just win, he dominated, leading his team to victory and cementing his place among the game’s greats.\nBut this moment is about more than one game. It’s a testament to resilience, determination and an unshakable belief in oneself. Hurts’ journey to the top was filled with obstacles, setbacks and moments when others counted him out. His career has been a story of relentless grit. From his early days at the University of Alabama, where he led his team to a national championship appearance as a freshman, to the heartbreak of being benched in the title game a year later, he faced adversity head-on. Many players would have crumbled under the weight of such a moment, but Hurts supported his team, learned from the experience and came back stronger.\nThrough sheer determination and leadership, he took command of the Eagles offense and led them to back-to-back playoff appearances, including a Super Bowl berth two years ago. Though they fell short, Hurts returned this season even hungrier, even more determined to finish what he started.\nHurts’ journey is bigger than football. It’s a message to every athlete, dreamer and every person who has ever been told they weren’t good enough. It’s proof that setbacks are not the end, but rather stepping stones to something greater. Kevin De La Cruz\nUncompetitive\nShaftesbury, Vt.: Super Bowl 59 was a bust for Kansas City, and they never really showed up. The refs didn’t help, with a couple of terrible calls against the K.C. defense giving the ball back to the Eagles so they could score. There was no pass blocking for K.C., and the holes in the offensive line were big enough to drive a tractor-trailer through. This game makes fans want to cancel the Super Bowl for good and just move on to baseball. Party boys out there playing football after a big night in the hotel is what we got. Now we can forget this disaster for the NFL and think spring training! Tom King\nNo disrespect\nDelhi, N.Y.: Jonathan Zimmerman’s guest article asking “Why is the K.C. team still called the Chiefs?” (op-ed, Feb. 9) when other teams like Washington and Cleveland have changed to less controversial names, while somewhat comical considering the fantasized suggestion, is totally off-base. The name Chiefs is no more derogatory than the name “Presidents” or “Senators.” A chief is merely a leader. For Native Americans, it is simply that and hardly controversial. Perhaps naming a team “The Jews” is a bit hyperbolic, but there is nothing wrong with the name “chief,” as he is a respected leader of numerous “real” Americans. Arthur Martello\nBathroom break\nHubertus, Wis.: You know things are bad when the commercials were more entertaining than the halftime show. While there was just too much rap and crap being presented, it did give us all a good chance to hit the bathroom, visit the fridge and get back to the game. Finally, one picture was worth a billion words: President Trump’s wide smile and Taylor Swift’s big frown! Bob Lobenstein\nStraw stock\nNutley, N.J.: I confess that when I was younger, I foolishly followed former President Joe Biden’s advice and purchased a stock of paper straws. With a new president, the attitude toward saving the environment has undergone a seismic shift. Trump’s pronouncements on the superiority of plastic straws reek of his deeply ingrained common sense. I recognize the error in my thinking, but what to do with my gross of paper straws? May I suggest that the federal government follow the custom of private corporations when a dangerous product has been purchased by the consumer? Could the Trump administration institute a recall program in which all individuals who are in this country legally could exchange their paper straws for plastic ones? Peter Griswold\nCommunity health\nYonkers: Thank you, Democratic Women’s Caucus. During your Saturday morning press conference, you made clear what is at stake. Critical funds for early childhood education, the Supplemental Nutrition Assistance Program, the World Health Organization and the National Institutes of Health are frozen. This freezes research needed for clinical and immune therapy trials. Maternal health, Medicaid and anti-trafficking funds are frozen. What can we do? Stay healthy. Eating a mostly plant-based diet keeps our blood pressure, blood sugar and cholesterol levels low. Find like-minded folks to help you stay on the right healthy track, like HeartSmarts. Find us on Instagram. Stay informed, stay healthy. Alycia Bethea\nRedundant reps\nSaratoga, N.Y.: Checks and balances are gone. If the Republicans are just going to nod like bobbleheads to everything Trump proposes, then we don’t need them. Eliminate the House of Representatives and Senate instead of cutting services to those in need. The total cost to taxpayers to fund Congress, including salaries, benefits and operational costs, is estimated to be around $5 billion a year. Shirley Smith\nCritical caveat\nRichmond Hill: In 1787, in response to a question from Elizabeth Willing Powel — “Well, doctor, what have we got, a republic or a monarchy?” — Benjamin Franklin answered: “A republic, if you can keep it.” Joseph Napoleone\nCrisis disconnect\nWestern Springs, Ill.: Following the hottest year on record was the hottest January. A new study shows the last 15 years have warmed at about twice the rate of the previous 40 years. The consensus of climate scientists, including those at major oil and gas companies, for more than four decades has predicted global warming from burning fossil fuels, which would cause more extreme weather. Their predictions have proved accurate. Recent destructive storms and wildfires are just a taste of much worse to come. Yet, the world’s most powerful person, the president of the United States, says climate change is a hoax and “drill, baby, drill” as he benefits from large political contributions from fossil fuel interests. The supposedly brilliant and visionary lineup of billionaires behind him led by Elon Musk seems solely concerned with their short-term financial interests. Who will tell the emperor that he is wearing no clothes? Richard Barsanti\nDisability hire?\nDix Hills, L.I.: If Musk has Asperger’s syndrome, does that mean he got his job through DEI? And if you follow that logic, should he fire himself? Maybe I have too much free time. Barbara Lorge\nCompromised\nParkland, Fla.: Mayor Adams’ move to allow NYC agencies to assist ICE officials in pursuit of undocumented immigrants is clearly an act of desperation aimed at currying favor with Trump and his merry band. Adams, who started out as mayor of the nation’s biggest sanctuary city, should know when he is beaten and resign from office. His actions are so obviously a bid for receiving aid from Trump in the form of clemency for the various crimes he has been accused of. Not only has he been a failure as mayor of NYC, he is a turncoat interested only in self-preservation. Fortunately, I don’t believe he will achieve reelection even if he dodges the law. John Squicciarini\nStatistically wrong\nHyde Park, N.Y.: Congratulations to Voicer James McCaffrey for a letter that had only one word I needed to look up (philippic). He usually likes to spice up his letters with many words that nobody uses in actual conversation. That said, the schoolyard score on his most serious charge against illegal immigrants — murder — is very lopsided. According to the Border Patrol’s website, there were 60 in 2020. There were 24,000 murders by U.S. citizens that year. In 2023, it was 29 against 3,000. I think James should do some research and not just be a bucket-head with a thesaurus. Jack Cregan\nIn the mail\nBriarwood: To Voicer Anita Forgash: Since you already have the EasyPay senior card, you should have received a letter from MTA Customer Relations that included the OMNY card. If not, the EasyPay Account Service Center can be reached at 877-323-7433 or online at Easypaymetrocard.com. Hope this helps. Patricia Nuzzi",
  "word_count": 1373,
  "scraped_at": "2026-02-14T14:15:49.515180"
}