{
  "article_id": "cb69ae0ada8d",
  "url": "https://www.90min.com/posts/ona-batlle-contract-marc-skinner-insists-star-remains-happy-man-utd",
  "title": "Ona Batlle contract : Marc Skinner insists star remains  really happy  at Man Utd",
  "date": "20230222T171500Z",
  "domain": "90min.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Ona Batlle contract: Marc Skinner insists star remains 'really happy' at Man Utd\nManchester United manager Marc Skinner has insisted that Ona Batlle remains ‘really happy’ at the club, despite a report this week suggesting she has rejected the offer of a new contract.\nBatlle, along with star forward Alessia Russo, is out of contract at the end of the season and on course to leave as a free agent if no new deal is agreed. Mary Earps is another coming towards the end of her terms, although United retain an option to extend the goalkeeper’s current contract.\nThe club has been in ‘heavy’ talks with Batlle and Russo this season, while negotiations have also got underway over a fresh deal for Earps.\nA report from The Athletic stated that Arsenal, Barcelona, Chelsea, Lyon and Paris Saint-Germain are all interested in Batlle and that some of those have indicated a willingness to pay her more than twice as much as the offer from United, as well a more ideal contract length.\nIt has been suggested that Batlle’s camp are still waiting for an ‘enticing offer’ from United.\n- Ona Batlle & Alessia Russo contracts could be a waiting game for Man Utd\n- Man Utd Women contracts: When every player's current deal expires\nBut the player, who is part of the squad's senior leadership group and has worn the captain's armband on occasion this season, has long been known to be happy in Manchester and Skinner underlined that when he addressed the media ahead of the upcoming FA Cup tie with Durham.\n“The reality is when I look at Ona in the face, I know how happy she is here,” the boss stressed.\n“I know what we do every day in training. Only yesterday, we were doing some one-on-one stuff, on Friday we are going through her clips and how we continue to progress her abilities.\n“I have no doubt she loves Manchester United. I know Polly [Bancroft, head of women’s football] and the group are working hard behind the scenes on and off the pitch to try and make her a Manchester United player for years to come.\nSkinner has previously admitted that the rapidly evolving world of women’s football has made things such as contract negotiations more challenging and alluded to such ‘complexities’ again.\n“But I know Ona is really happy here and we are still working hard to make it happen. I hope that Ona will look at that and we can keep her here for many years to come,” he added.\nUnited are well in contention to finish the season in the WSL top three and qualify for the Champions League for the first time. In terms of both footballing ambition and growing the budget, that could yet prove to be a huge step in retaining key players in the long run.\nFor more from Jamie Spencer, follow him on Twitter!",
  "word_count": 485,
  "scraped_at": "2026-02-14T12:21:27.196062"
}