{
  "article_id": "cb7602c252d4",
  "url": "https://www.twtd.co.uk/ipswich-town-news/29320/sears-we-can-still-make-the-play-offs/onthisday",
  "title": "Sears : We Can Still Make the Play - Offs - Ipswich Town News",
  "date": "20240321T043000Z",
  "domain": "twtd.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Monday, 21st Mar 2016 06:00\nStriker Freddie Sears says the Town squad still believe they can make the play-offs, despite Saturday’s dismal 1-0 home defeat to Rotherham United.\nLeon Best netted the only goal of the game as the Millers climbed out of the relegation zone, while the Blues remain eighth, but now four points - plus goal difference - from the top six.\n“We didn’t do enough to get something from the game,” Sears admitted. “Rotherham have a good manager and they have picked up some points of late so their confidence is high.\n“Even so, these are the games we should be winning at home. It is a big blow, especially as the teams around us won. We have to keep going and coming back strong.\n“The gaffer will get us working as we have a tough run of games coming up. We have to stick together as a club and come out firing. We believe we can still get in the play-offs.\n“We looked better in the second half when we played with a bit more width. The first half was a bit tight. We played down the middle, which suited Rotherham.\n“They played Greg Halford just in front of the defence and it suited them, we couldn’t break them down.\n“Goals change games and once Rotherham got in front it was hard for us. We made changes at the break and came out better in the second but couldn’t break them down.\n“We had a couple of chances but we need to create more chances for the frontmen. We need to get more balls in the box for the strikers. But there is no point in pointing fingers, we need to stick together.”\nThere were boos and chants of ‘What a load of rubbish’ at the final whistle, but the 26-year-old hopes the fans will be back on side when the Blues get back to action at Wolves after the international break and in the back-to-back home games against Charlton and Brentford which follow the visit to Molineux.\n“As a player you hear the fans and it is not nice but you have to get on with it,” the former Colchester and West Ham man continued.\n“The fans have been brilliant so for them to give us a bit of stick now is probably fair enough.\n“Hopefully they will be supporting us next time round. The fans are disappointed but we are too — we have not come off laughing and joking, everyone is down in the dressing room. “\nRotherham captain Kirk Broadfoot said: “Mick McCarthy’s sides are always difficult to beat. We had a good structure, we contained them for most of the game and we looked dangerous. We were comfortable and overall we deserved the points.”\nTown’s U21s are in action at home to Nottingham Forest at Portman Road this evening with David McGoldrick and trialist Keiran Morphew both expected to play (KO 7pm).\nMeanwhile, former Town skipper Jon Walters was named Senior International Player of the Year at the FAI Soccer Awards last night.\nElsewhere, Ipswich Town Ladies beat AFC Sudbury Ladies 1-0 in the Suffolk Womens' Cup semi-final after extra-time at Greens Meadow, Stowmarket.\nPhoto: Action Images via Reuters\nPlease report offensive, libellous or inappropriate posts by using the links provided.\nIf the lad Feeney isn't offered terms it will show what we have here in charge at PR.\nWhether he wants to play for us after Saturday is up to him, I'm sure he will catch the eye of many a championship manager who will be able to offer him far better terms than we are prepared to.\nCOYB\nWorrying for me is the number of fans who are genuinely thinking of not renewing. These are proper hard core fans for whom going to Portman road has turned in to a chore due to the poor entertainment. They would rather cherry pick 10-12 games and who can blame them. If things go well they can always get a half season ticket.\nif we had played that then we would have stood a good chance of all 3 points. and like has said on here and facebook, why are we setting up to stop the visiting team playing, we are at home ffs, we set our stool out and let them worry about us for once, in the long term we will benifit, although MM has came out and said he was wrong, i should coco you was wrong, if it was the first time you tried it then fair enough but he tried it against blackburn and it failed until he changed it and then we got the points, wasnt pretty but atleast we had one well worked goal, how many have we had like murphy second goal this season, yep i think thats prob it, we need killer balls from midfield on the deck to split defences esp if they park the bus which rotherham did. but no one in the midfield could supply that.\nso MM that is a wake up call mate, get your head out of your butt play the best 11 in there best postions and atleast end the season all guns blazing, if it works fantastic, more people just may renew there season tickets if it dont well atleast you tried from here on in. if you dont how ever we will end up in the middle of the table with low renewals and even less at portman road next year.\nwe had a good chance this year with some good players, unforchantly to many times we have never played our best available 11 with some sat on the bench, yes we have had injures esp to fraser disdy and the bish, but alot of times we have set up to negative and to many round pegs in square holes.\nIt's clear now that season ticket numbers will fall - and who would blame anyone for deciding that they can't watch football so devoid of any quality, skill, ability, competence, that the whole thing becomes completely pointless?\nHe admits it so what you gonna do ME ? Nothing I expect MM has his new contract and pipe and slippers on maybe crazy idea but I would have said we will give you a contract with big bonus in may if we go up .\nWho knows ? But what I do know players like Freddie who actually play football won't be hanging about as long as we have 'Hoof the magic dragon' in charge\nMick, WISE UP FFS!!\nChange manager? Just sit (or stand where I am) & take this utter dross?\nI missed Rotherham on purpose, I couldn't give a flying flick & that is dreadful for a season ticket holder of 20 odd years or any fan to be honest, but that's because of the utter $hite being dished up at Portman Road.\nI saw the \"highlights\" Douglas at fault for their goal I think & Bera too friggin slow, apalling!\nI for one would ask for a change, sorry but that's how bad I feel.\nLove the \"Hoof the Magic Dragon\" from a previous post, best part of the weekend.\nPLaying 7 at the back may have worked on tuesday but it was still a very poor game. MM doesnt like change but unless he frshens up the team he's going to lose the fans trust.\nWe have no hope if we play like that !!\nDream on Freddie\nMM is a percentage manager we know he fc##d up sat as does he now he only has one option whether the players are good enough to attack attack attack is another matter I hope they are I somehow doubt they are perhaps that's why he sets the team up as he does time will tell .\nI have been going to Portman road for over 50 years and I can say the team Mick has put out for the last 2 games is the worst balanced teams I have ever seen.\nProblem with Mick he always puts a team out not to get beaten and worries how the other team will set there team up.\nFor gods sake we are going for a play off place you put a team out to win the game. We sign a new winger he does not bring him on till half-time, Pringle has scored winners in 2 recent games he does not start, Foley has looked good he does not even get on field. Bru scores great goal at Bolton keep on bench until 10 minutes from time.\nI suggest MICK walks around Stadium and looks at Statues of Sir Alf and Sir Bobby and asks himself why they are there.\nThe answer Mick is they played bloody good football and won the hearts of Town fans, they put a smile on our faces made us proud of this great club, they always played to entertain the fans.\nSounds slightly childish, but how about yelling \"HOOOOOOOF\" every time the ball is errr, hoofed? Surely \"Hoof the Magic Dragon\" would get the message eventually.......or would he?\nYou need to login in order to post your comments",
  "word_count": 1531,
  "scraped_at": "2026-02-14T12:07:22.899874"
}