{
  "article_id": "cb7d0ba5c358",
  "url": "https://www.prokerala.com/news/articles/a1607445.html",
  "title": "WPL : Gujarat Giant Kashvee Gautam aiming to be back in national reckoning",
  "date": "20250213T074500Z",
  "domain": "prokerala.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "New Delhi, Feb 13 : The upcoming third edition of the Women's Premier League (WPL), starting from Friday, serves as a key platform for Indian players aiming for national team selection.\nGujarat Giants' (GG) fast-bowling all-rounder Kashvee Gautam is sure to attract the attention of onlookers in the Indian cricket ecosystem. She first came into limelight by picking up ten wickets in an innings, including a hat-trick, for Chandigarh in an Under-19 one-day game in 2020.\nIn December 2023, she became the most expensive uncapped Indian cricketer in WPL's history with a pay cheque of Rs 2 crore in the auction ahead of 2024 WPL. But Kashvee never set foot on the field due to a stress fracture in the toe of her left foot, ruling her out of WPL 2024.\nEventually, Kashvee made a comeback in the 2024/25 Senior Women's One-Day Trophy, where she picked seven wickets in six games for Chandigarh.\nAhead of GG set to open their WPL 2025 campaign against defending champions Royal Challengers Bengaluru (RCB) in Vadodara, Kashvee's ability to hit the deck hard at a high speed and be a quality finisher is something the side will benefit hugely from this season.\n\"Last year, I was with the team in Bangalore for some time. I saw what I was missing out on, and also realized what I could add up. After recovery, I worked on my range hitting. I looked for areas for scoring shots - not only in front but also behind the wicket. I developed variations in bowling, as there is very little margin of error in WPL.\n\"My domestic season went well, my economy was good and I am confident that I will do my best in the coming matches. I want to take as many wickets as I can in powerplay and keep the economy down. I want to take the game to the end and finish matches in my role as a finisher,\" said Kashvee to IANS.\nWith a new coaching staff, barring head coach Michael Klinger, and a new captain in Ashleigh Gardner, Kashvee feels the group has gelled well to click as a unit and step up from its twin bottom-placed finishes in WPL so far.\n\"The group is looking good. We have been bonding well since last year. We have all gelled up together very easily. It wasn't like we all came from different areas. We all play for different domestic teams. So, it felt like we have been playing together for years.\n\"WPL had a big impact, like women's cricket has changed. Even in domestic cricket, the girls are playing intensely like anything. The range hitting has increased, and it's a good thing for India. We are producing good finishers, batters and bowlers. People are also watching women's cricket.\"\nNagesh Gupta, who coaches Kashvee at his Zirakpur cricket academy, told IANS that they extensively trained her in death-over bowling and finishing matches as a batter.\n\"Right now her rhythm was good, so mainly we worked on her death-over bowling, as it becomes very important in slog overs. Plus, after the injury, her swing has also returned and has started to get better.\n\"Her line and swing should be good in WPL, as in-swing comes to her naturally. We also worked on her batting a lot, as she is doing very well right now in it. God willing, all good things will definitely happen, she will do well and let's hope for the best,\" he said.\nAt one point, Kashvee was close to making it to the Indian team – she was with the India A team who won Emerging Women's Asia Cup, as well as featured in the series against England A and got a good WPL deal. Gupta recalled everything seemed to go smoothly for Kashvee before the injury ruling her out of WPL 2024 came.\nMotivating Kashvee during that time proved challenging for Gupta. She had overcome phases when her performance wasn't great or the facilities and grounds weren't up to the mark to eventually shine bright with her performances. The injury phase, however, proved to be a very tough challenge to come out of.\n\"God has his own plans. It was very difficult for me as well as for her to go through that phase, because she had prepared for it. More than the price at the auction, the biggest thing is that she missed such a big opportunity to play, and learn from many good players. It was difficult to keep her motivated. But on our side, we tried our best to keep her constantly motivated.\n\"We read books of other players who have made comebacks from setbacks and had discussions on it. At that time, I met Kashvee so much off the field to motivate her, something which I had never done so much previously in life. It was a difficult period, but we wanted her to become stronger. She is strong now, her pace has also increased and has bowled well in the Challengers, so she is very motivated,\" added Gupta.\nGrowing up in Chandigarh, Kashvee dabbled in skating, badminton, and football. But cricket always had a soft spot for her – she would wake up at 5am to play gully cricket with boys. Gupta has been her coach since 2017, the year Kashvee first played for Punjab. She would go on to move to Chandigarh, where she's their captain now.\nIn that phase of not being able to play WPL 2024, Kashvee also got ample support from her mother, who's a housewife, and a father working as a property dealer. Kashvee also had her paternal aunt and younger sister, who is preparing for her 12th grade board exams, as big support figures.\n\"My parents have supported me from the beginning. They never told me not to play or that I don't have a career in it. Even though there are ups and downs, like some seasons don't go well, they never told me to quit and always inspired me to work hard.\n\"They motivated me when I feel down, and I still get calls from them before I play any game, telling me not to be nervous. They have supported me like anything. If I needed anything, like a bat, they will get it for me the next day, even if it was expensive. They have supported me a lot,\" she added.\nKashvee finds significant inspiration in Hardik Pandya, the India men's fast-bowling all-rounder due to the similarity in their skill sets. Her admiration for Pandya is so intense that she has also got tattoos.\nKashvee's exclusion from WPL 2024 proved challenging, but she has shown the same resilience as Pandya in recovering from injury and now aims to be back in the national reckoning again, starting from putting in excellent all-round performances for GG in WPL 2025.",
  "word_count": 1140,
  "scraped_at": "2026-02-14T12:49:50.090368"
}