{
  "article_id": "cba9646e988b",
  "url": "https://www.mcall.com/2023/05/23/around-the-valley-matt-millen/",
  "title": "Matt Millen , Larry Miller , Dave Crowell voted into the PA Sports Hall of Fame",
  "date": "20230523T114500Z",
  "domain": "mcall.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "The Pennsylvania Sports Hall of Fame will hold its annual induction ceremony and banquet in the Lehigh Valley on Oct. 28 and it’s fitting that several local legends will be honored at the Delta Hotels by Mariott in Breinigsville.\nThe Pennsylvania Sports Hall of Fame was chartered in 1962 and bills itself as the only community-based Hall of Fame in the country. It has 28 chartered chapters, including the Lehigh Valley-Pocono chapter.\nCatasauqua High and University of North Carolina basketball legend Larry Miller headlines the four local inductees along with former Whitehall High and Penn State standout and four-time Super Bowl champion Matt Millen, wrestling coaching legend Dave Crowell and the late Billy Sheridan.\nSheridan is considered the founding father of wrestling and a charter member of the National Collegiate Wrestling Hall of Fame. He coached Lehigh for 41 seasons from 1912 to 1952 and is the school’s winningest wrestling coach with a record of 222-86-8.\nAmong the other 11 inductees are former major league baseball player and manager Art Howe, longtime NFL player and assistant coach Russ Grimm, longtime Phillies public address announcer Dan Baker, legendary Rutgers women’s basketball coach Vivian Stringer and iconic Clarion University wrestling coach Bob Bubb.\nLV-Pocono Hall of Fame\nThe Lehigh Valley-Pocono Sports Hall of Fame held its annual induction ceremony May 13 at the Northampton Community Center and on Mother’s Day weekend there was definitely a family feel in the air as the living inductees came back home to the Lehigh Valley to take their bows.\nPro Football Hall of Famer Andre Reed returned from Southern California, former Catasauqua High and Lehigh University quarterback Mike Rieker came in from Florida as did Mitch Lukevics, the Liberty High and Penn State graduate who is now the senior adviser for player development for the Tampa Bay Rays after serving as the franchise’s director of minor league operations.\nFormer Notre Dame-Green Pond, East Stroudsburg University and Lehigh University men’s basketball coach Sal Mentesana got a standing ovation and Bob Stetler, a Stroudsburg High and ESU soccer and wrestling standout in the 1970s was honored posthumously as was Gary Wagner, who made his mark as a track and field star at Parkland and the University of Tennessee in the 1960s.\nPerhaps no one touched the heartstrings more, however, than Rich Wescoe who some might regard as Mr. Bethlehem for his contributions to the athletic programs at both Freedom and Liberty high schools.\nA three-sport star at Liberty before graduating in 1972, Wescoe spent 40 years in the Bethlehem Area School District as a special education and physical education teacher at Liberty. He was named the Special Olympics Coach of the Year in 2006 and the Bethlehem Chamber of Commerce Outstanding Young Fitness Leader in 1989.\nTo demonstrate his level of fitness, Wescoe still plays in the Lehigh Valley Men’s Senior Baseball League and has played on five MSBL National World Series championship teams in tournaments in both Arizona and Florida. He has the distinction of having played in every MLB spring training facility in Arizona and Florida.\nBut it’s in Bethlehem where he has made the greatest impact with perhaps his biggest moment coming in 1987 when he led the Liberty boys basketball team on an improbable run to the District 11 championship.\nWescoe thanked his entire family during his acceptance speech, especially his wife of 47 years, Millie. His daughters, Emily and Jennifer, are both teachers. Many know Jen Wescoe as a 1,000-point scorer for Liberty girls basketball team and as a Freddy-award winning director for the Freedom High musical-theater department.\nHowever, Emily DiZebba has spent 17 years serving the inner city schools such as Harrisburg and Chambersburg and has received numerous awards for academic and community contributions.\n“While I may not be recognized for my contributions to athletics, I certainly have saved some inner city youth and continue to work with those in poverty and lift then up every day,” she said.\nAs Wescoe pointed out, it’s a “Hall of Fame family,” that has shined in every possible way.\n“I may have not have reached my dream of playing baseball at the highest level. But I hope that through my playing three sports, including baseball for 60-plus years to the present and coaching three sports, including 25-plus years as a head coach and assistant, and by teaching for more than 40 years, I was able to make a difference, inspire and touch many lives,” Wescoe said.\nPSFCA East-West all-star games\nEmmaus senior Jake Fotta threw a 19-yard touchdown pass and Parkland’s Gryffin Mitstifer kicked a 41-yard field goal but it wasn’t enough as the West beat the East, 24-16, Saturday in the Pennsylvania Scholastic Football Coaches Association big-school all-star game at Bishop McDevitt’s Rocco Ortenzio Stadium.\nState College’s Finn Furmanek, the West MVP, completed 8 of 13 passes for 109 yards and carried 10 times for 71 yards. McDevitt’s Kade Werner was the East team’s MVP.\nIn the small-school game played earlier on Saturday, Northern Lehigh’s Nick Frame ran for two TDs and passed for another and his Bulldogs teammate Jayden Krempasky was involved on a stop with eight seconds to go that preserved the East’s 41-34 win over the West.,\nIzaiah Ramos, another Northern Lehigh product, had a TD reception.\nJosiah Jordan of Berks Catholic was the East MVP.\nPromotion for Kyle Griffin\nFormer Allentown Central Catholic player Kyle Griffin has been elevated to associate head coach on the Florida Gulf Coast men’s basketball staff. Head coach Pat Chambers made the announcement recently.\nGriffin enters his second season with the FGCU program. He spent four previous seasons with La Salle. He had also worked at Lehigh and Robert Morris.\nThe Eagles went 17-15 last year in the first season for Chambers and Griffin and the program picked up a key addition when former ACCHS standout Keeshawn Kellman transferred from Princeton for a fifth season.",
  "word_count": 980,
  "scraped_at": "2026-02-14T12:39:31.010594"
}