{
  "article_id": "cbc823745a2a",
  "url": "https://www.finanznachrichten.de/nachrichten-2023-03/58514254-xylem-inc-pep-guardiola-calls-time-on-polluted-waterways-leads-drive-to-tackle-untreated-wastewater-around-the-world-004.htm",
  "title": "Xylem Inc .: Pep Guardiola Calls Time on Polluted Waterways , Leads Drive to Tackle Untreated Wastewater Around the World",
  "date": "20230309T150000Z",
  "domain": "finanznachrichten.de",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Manchester City Football Club and Xylem Encourage Fans to Call for Action on Untreated Wastewater Ahead of Milestone UN 2023 Water Conference\nUNESCO estimates that 80 percent of wastewater globally is released back into the environment untreated1, polluting the world's waterways and posing risks to human health. Ahead of the United Nations (UN) 2023 Water Conference, Manchester City Football Club and global water technology leader Xylem (NYSE: XYL), are calling on football fans globally to drive action on wastewater pollution.\nThrough a new 'Water Heroes' website, football fans are invited to engage with educational resources and to add their name to a statement emphasizing the need for governing bodies to honor their commitments to treating wastewater. The 'Water Heroes' site offers opportunities to win match tickets and other prizes by signing up as water advocates.\nTo support the campaign, Manchester City Football Club and Xylem have launched a short film featuring Club Manager Pep Guardiola. The film depicts the realities of a world drowning in untreated wastewater and aims to create urgency amongst football fans to take action. The initiative advances Xylem and Manchester City Football Club's ambition to create a global movement of one billion water citizens committed to solving the world's water issues.\n\"Manchester City's partnership with Xylem is about maximizing the power of our collective voice to raise awareness on critical water issues,\" said Pep Guardiola. \"Our world is more polluted than ever, and untreated wastewater continues to impact the health of millions of people. We're asking fans to come together and demand action before it's too late. The time has come to take the waste out of water.\"\nThe UN Water Conference brings together stakeholders from Governments, the private sector, non-governmental organizations, academic institutions, and the scientific community to advance progress on global water issues. As the first such conference in 50 years, young football fans have a once-in-a-generation opportunity to join the conversation.\n\"As demand for clean water rises, we must do everything we can to protect this vital resource,\" said Patrick Decker, President and CEO of Xylem. \"The UN 2023 Water Conference provides a global platform to put wastewater pollution on government agendas and advance progress at scale. Together with Manchester City Football Club, we're urging young fans to become water stewards by demanding action on wastewater pollution our future, and the health of our planet, depends on it.\"\nTo further amplify awareness, Xylem and Manchester City Football Club are collaborating with Global Citizen a movement that empowers millions of people around the world to take action on critical issues. Launching on World Water Day, March 22, the collaboration features players from Manchester City's Women's Team alongside young water leaders from around the world, highlighting the impact untreated wastewater has on communities everywhere.\nTo lend your voice to this important issue, pledge your support at: waterheroes.xylem.com\nAbout Xylem\nXylem (XYL) is a leading global water technology company committed to solving critical water and infrastructure challenges with innovation. Our more than 17,000 diverse employees delivered revenue of$5.5 billion in 2022. We are creating a more sustainable world by enabling our customers to optimize water and resource management, and helping communities in more than 150 countries become water-secure. Join us at www.xylem.com.\nAbout Manchester City Football Club\nManchester City FC is an English Premier League club initially founded in 1880 as St Mark's West Gorton. It officially became Manchester City FC in 1894 and has since then gone onto win the European Cup Winners' Cup, eight League Championship titles, including six Premier League titles (2012, 2014, 2018, 2019, 2021, 2022), and six FA Cups. Manchester City FC is one of ten clubs comprising the City Football Group and counts New York City FC and Melbourne City FC among its sister clubs.\nUnder manager Pep Guardiola, one of the most highly decorated managers in world football, the Club plays its domestic and UEFA Champions League home fixtures at the Etihad Stadium, a spectacular 55,000 seat arena that City have called home since 2003. Today, the Stadium sits on the wider Etihad Campus, which also encompasses the City Football Academy, a state-of-the-art performance training and youth development facility located in the heart of East Manchester. Featuring a 7,000 capacity Academy Stadium, the City Football Academy is also where Manchester City Women's Football Club and the Elite Development Squad train on a daily basis and play their competitive home games.\nFor more information, please visit www.mancity.com\nAbout Global Citizen\nGlobal Citizen is the world's leading international advocacy organization on a mission to end extreme poverty NOW. Powered by a worldwide community of everyday activists raising their voices and taking action, the movement is amplified by campaigns and events that convene leaders in music, entertainment, public policy, media, philanthropy and the corporate sector. Over the past 10 years, $41 billion in commitments announced on Global Citizen platforms has been deployed, impacting more than 1.15 billion lives. Established in Australia in 2008, Global Citizen's team operates from New York, London, Paris, Berlin, Melbourne, Toronto, Johannesburg, Lagos and beyond. Join the movement at globalcitizen.org, download the Global Citizen app, and follow Global Citizen on Facebook, Instagram, LinkedIn, TikTok and Twitter.\n____________________________\n1 UN World Development Report: Wastewater, the Untapped Resource\nView source version on businesswire.com: https://www.businesswire.com/news/home/20230309005489/en/\nContacts:\nHouston Spencer\n+1 (914) 323-5723\nHouston.Spencer@xylem.com\nGleichzeitig vollzieht sich an der Wall Street ein lautloser Favoritenwechsel. Während viele auf Wachstum setzen, feiern Value-Titel mit verlässlichen Cashflows ihr Comeback: Telekommunikation, Industrie, Energie, Pharma – die „Cashmaschinen“ der Realwirtschaft verdrängen hoch bewertete Hoffnungsträger.\nIn unserem aktuellen Spezialreport stellen wir fünf Aktien vor, die genau in dieses neue Marktbild passen: solide, günstig bewertet und mit attraktiver Dividende. Werte, die nicht nur laufende Erträge liefern, sondern auch bei Marktkorrekturen Sicherheit bieten.\nJetzt den kostenlosen Report sichern – bevor der Value-Zug 2026 endgültig abfährt!\nDieses exklusive PDF ist nur für kurze Zeit gratis verfügbar.",
  "word_count": 974,
  "scraped_at": "2026-02-14T11:59:29.313859"
}