{
  "article_id": "cbc9c8f175f8",
  "url": "https://www.dglobe.com/news/local/berries-cabbage-lead-to-lifetime-of-love-for-worthington-couple",
  "title": "Berries , cabbage lead to lifetime of love for Worthington couple",
  "date": "20241127T151500Z",
  "domain": "dglobe.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "WORTHINGTON — Who says nobody ever meets cute over kumquats?\nNot Dominic and Dalen Burns, a recently married couple whose happily ever after kicked off when each was a teenager working in Hy-Vee’s produce section.\nADVERTISEMENT\nShe made the first move on me. And of course, when you’re a teenage boy and there’s a girl who’s interested in you, that makes her the hottest person in the world.\nIn May 2018, shortly after Dominic graduated from Worthington High School, he headed north to Nisswa where he spent the bulk of the summer as a counselor at Minnesota Elks Youth Camp, temporarily bidding farewell to his established Hy-Vee produce gig.\nWhen he returned in early August, he immediately noticed the striking blond who’d been hired at Hy-Vee as another part-timer in his absence.\n“I didn’t really know Dominic at all when we were in high school together,” said Dalen, 22, of her husband, now 24. “He showed up at Hy-Vee one day and I thought, ‘Oh, there’s a new person here.’”\nJoked Dominic, “She made the first move on me. And of course, when you’re a teenage boy and there’s a girl who’s interested in you, that makes her the hottest person in the world.”\nWhile stocking squash and curating carrots, the future Mr. and Mrs. Burns quickly discovered a mutual attraction.\n“It felt very natural to talk to her,” said Dominic. “She laughed at my jokes, we always seemed to have a good time together and she wasn’t just a co-worker I was stuck putting up with for the next three hours.”\nDalen found Dominic’s jocularity immediately appealing.\nADVERTISEMENT\n“I liked his personality,” she said. “He had a sense of humor, and I always enjoy getting a good laugh. Plus, he seemed sweet.”\nWhile Dominic loves mangos and Dalen prefers strawberries or watermelon, he didn’t wait long to connect outside of the produce aisle when Dalen asked for his phone number.\nI liked his personality. He had a sense of humor, and I always enjoy getting a good laugh. Plus, he seemed sweet.\n“We texted each other and made a date to go to a (Trojans) football game,” said Dominic, who was also working part-time then as a sports stringer for The Globe.\n“I was supposed to cover the phones (for coaches calling in to report game scores) at the Globe that night, but I was very late — first, because it was a long football game and then because Dalen said she needed to pick up mint chip ice cream at the store for her mom.”\nDespite knowing he was in trouble for being tardy, Dominic smiled warmly and said, “Sure, I have time to get ice cream for your mom.”\nSoon after, Dominic initiated a second date, this time to Palisades State Park in Garretson, S.D.\n“I think the cliff and river are so cool,” said Dominic, “so we walked, climbed the cliffs and had our first photo taken there by two elderly women.\nADVERTISEMENT\n“We looked quite handsome together,” he joked.\nFive years later, on an unusually warm Saturday afternoon in November, the couple returned to Palisades State Park for a fateful hike.\n“I was wearing my best shirt and had combed my hair especially well that morning,” teased Dominic, who had pocketed a special ring — a yellow-gold, oval-cut diamond with a halo band purchased at Johnson Jewelry — for the occasion.\n“We’d picked out the ring together, so I had an idea a proposal might be coming,” said Dalen. “And we hadn’t been to Palisades for a while.”\nStill, Dominic did his best to create an aura of suspense.\n“I made her hike,” he said. “We did the lower loop by the river bend and then worked our way up to the cliffs, where I tried to discreetly set up my phone to record the moment.”\n“It was just the two of us,” said Dalen, “and it was special; a really nice day.”\nADVERTISEMENT\nDear readers: Dalen consented to Dominic’s romantic cliffside proposal, and soon after, the wedding planning began.\nDo-it-yourself approach involved family, friends\nDominic, the fourth of Karen and Scott Burns’ five sons, is a 2022 summa cum laude graduate of Minnesota State University, Mankato. He majored in German, having been Worthington’s 2016-17 exchange student to Crailsheim, Germany.\nAfter his first post-college stint at Hubbard Feed, Dominic worked as the Globe’s sports editor for just under a year before being hired to teach German and English at Worthington High School.\n“I’m also an assistant coach for Knowledge Bowl and I teach Trojan News, so that’s a fun connection with my newspaper background,” said Dominic.\nDalen, meanwhile, parlayed her PSEO classes into an associate’s degree in business management at Minnesota West Community and Technical College before completing a bachelor’s degree in management at Southwest Minnesota State University. The daughter of Patrick and Amy Shultz, Dalen is currently employed by ISD 518 as a technology management technician.\nHer wish was for a fall wedding, so the couple zeroed in on the Education Minnesota fall break as the perfect time.\nAnd on Oct. 19, 2024, Dalen and Dominic were married at St. Mary’s Catholic Church by Father Tim Biren.\nADVERTISEMENT\n“He did a good job of getting to know us and gave us some exercises to work though so we’d have a good foundation for married life,” said Dalen.\nWriting letters to each other in which they shared their feelings, hopes and aspirations for their life together was one of the tasks they undertook in advance of their nuptials.\n“That made us reflect on everything already in our shared history and on all we look forward to,” said Dominic, while Dalen commented it will be meaningful to review the letters in the future.\nDalen found her wedding dress at Bride to Bride Wedding Co. in Sioux Falls, S.D., a consignment store that also carries new gowns.\n“Mine was new,” said Dalen of her lacy, ballgown-skirted dress, which was fitted through the bodice and adorned with a train. “It was actually very comfortable.”\nBridesmaid dresses, in complementary autumnal hues, were ordered online for Dalen’s five female attendants from Azazie; the groomsmen obtained suits from The Stag, the groom distinguished with his champagne-colored tie.\n“Robyn Moser and her staff were great about accommodating us,” said Dominic.\nADVERTISEMENT\nJenny Kaddee, a hair-styling colleague of Dalen’s mother, fashioned Dalen’s blond tresses into an attractive low bun for her wedding day. Dalen completed her look with earrings, a bracelet and a delicate gold necklace to match her ring.\nAutumnal accents graced the boutonnieres, bouquets and other floral arrangements, ordered from Etsy.\n“We assembled the larger displays and table centerpieces in our basement,” said Dalen.\nLexi Larson was the couple’s photographer, while the groom’s younger brother, Quentin, partnered with Tyson Henkels to provide videography services.\nWith 270 guests, the Burnses’ reception filled the Wilmont VFW. As a young couple, keeping costs manageable was a priority.\nThey leaned on the talents and willingness of friends, family and their own steam to create a menu of pulled pork sandwiches (“They’re a staple of family gatherings for both of us,” said Dominic), cheesy hash browns, corn and cabbage salad. White cake topped with cream cheese frosting was the sweet finish.\n“The cabbage salad includes a vinaigrette recipe my mom’s perfected,” said Dominic. “I love it, and I could eat that forever.”\nTwo of Dominic’s aunts — Anne Bullerman and Beth Bovy — and family friend Jodie Johnson were the primary cooks and caterers.\n“We owe them, and Dalen’s family, a big thank you for all their work,” said Dominic. “It was something that stressed us out a bit but we were able to make the menu what we wanted and it brought everyone together.”\nDJ Brody Wright kept the party going into the evening hours.\nNow, comfortable at their Heron Lake home as winter descends, the pair contemplate honeymoon plans, enjoy their calico cat Daisy and strive not to clash over their favorite football teams.\n“My whole family has been Packers fans forever,” said Dalen. “That’s one of the few areas where our views split. Dom gets a little more into the games than I do.”\nTake time to joke and laugh. When one of you has a bad day, try to make the other one feel better.\nAdmitted Dominic, “If the Vikings lose, I’m a little more bothered by it and then I’m sad for a few hours; it’s bad, but true.”\nTogether, the Burnses enjoy photography, the great outdoors and sports spectating at athletic events of the Trojans, Bluejays and Worthington Community Football Club.\n“Communicating with each other and sharing your thoughts is important,” said Dalen, offering one key to their successful partnership.\nContributed Dominic, “Take time to joke and laugh. When one of you has a bad day, try to make the other one feel better.\n“You have to handle the serious things as they come along but it’s always the right time to have a good time — so enjoy the laughter.”",
  "word_count": 1501,
  "scraped_at": "2026-02-14T12:10:14.860985"
}