{
  "article_id": "cbd4d3780f05",
  "url": "https://saudigazette.com.sa/article/631027/SAUDI-ARABIA/Saudi-Arabian-womens-national-team-enters-FIFA-world-ranking-for-first-time",
  "title": "Saudi Arabian women national team enters FIFA world ranking for first time",
  "date": "20230324T191500Z",
  "domain": "saudigazette.com.sa",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "RIYADH — The Saudi Arabian Women’s Football National Team has been included in the official FIFA World Ranking for the very first time on Friday.\nThe historic sporting achievement for the country has been celebrated widely across Saudi with a dedicated event held at the King Abdullah Sports City in the coastal city of Jeddah.\nThe Women’s Football Department of the Saudi Arabian Football Federation (SAFF) was established in September 2019, with the national team introduced two years later following initial try-outs that welcomed over 700 girls and the squad has since featured 47 girls from across Saudi Arabia.\nThe national team, commonly known as the Green Falcons are currently led by Finish Head Coach Rosa Lappi-Seppälä, who took over from the newly promoted Women’s Technical Director Monika Staab. The team’s first competitive international matches took place February 2022 against Seychelles and Maldives and captured global headlines and were a watershed moment for Saudi women’s sports, with the Saudi’s recording 2-0 victories in both matches.\nOverall, the national team has featured in nine official matches, three of which were in its inaugural friendly tournament that saw it crowned as champion, helping earn its place on the global stage within the FIFA Ranking. As a result, the team will now be able to build on its record of four wins, three draws and two defeats by officially competing in FIFA and AFC-sanctioned competitions.\n“Each player has their own story, but what we all share is a love of football and a desire to compete. To be FIFA ranked makes us part of world football and that means everything. We recognise that we have a huge responsibility to inspire the youth and pave way for the future generation who will represent Saudi Arabia,” said team captain Sarah Khalid.\nThe goalkeeper added: Regardless of our ranking today, we will work hard to improve. We have an exciting future ahead when you look at how young our squad is. But for now, we are just taking it one step at a time and trying to grow every day.\nYasser Al Misehal, President of the Saudi Arabian Football Federation and FIFA Council member said: “What these girls achieved in just a matter of a year and a half has been nothing short of incredible. Since 2019 we have managed to successfully establish a national team, a premier league, a first division, a school’s league, with 50,000 girls signing up and in recent weeks introduced an U-17 national team. In just 2 years we have nearly doubled the number of registered players, clubs, referees and staff and seen an 800% growth in the number of coaches. Statistics all of football can be proud of and it just shows what is possible when you love the game.\nWe are fully committed to offering equal opportunities for boys and girls, in sport and beyond. For instance, our national teams get equal daily allowance while representing their country, regardless of gender. They share the same training pitches, stay in the same quality accommodation, and have access to the same equipment and resources.”\nWomen’s football in Saudi Arabia has undergone huge strides in recent years and mirrors much of the transformation happening across all areas in the country. The last two years alone witnessed astronomical growth across all metrics including the number of registered players to licensed coaches and referees to clubs and domestic competitions. All have massively increased.\nToday, there are 694 league players, representing over 20 nationalities from across the globe, marking an 86% increase since 2021. Female coaches grew from 119 to over 1,000 in two years, while grassroots academies focused on 6-17-year-old players recorded a massive 773% growth in registrations. Anoud Al Asmari also became the first Saudi referee to be included on FIFA’s official referee list for the year, paving the way for aspiring referees hoping to represent Saudi Arabia on the world stage.\nLamia Bahaian, Saudi Arabian Football Federation board member and Supervisor of the Women’s Football Department said: “Our national team made history when it was established 18 months ago, and since then their journey has inspired millions across Saudi Arabia and the region. Entering the FIFA Ranking has been the moment we’ve been building up towards, and signals just the beginning of what we want to achieve with these girls. They can write their own history now.\nWe are also already in active collaborations with many global bodies and federations and invite the world to join us on our women’s football movement as we strive to give it the platform it truly deserves.\nEarlier this year, SAFF concluded its inaugural professional leagues last month, with Al Nassr crowned champions of the eight-team Women’s Premier League. On an amateur level, almost 50,000 girls from a total of 3,660 school teams took part in the first nationwide Schools League.\nFollowing a successful men’s AFC Asian Cup bid, Saudi Arabia now awaits a decision on its 2026 AFC Women’s Asian Cup bid which promises to grow the sport across the continent and build a lasting legacy in Saudi Arabia. — SG\nSaudi Arabian women’s national team enters FIFA world ranking for first time",
  "word_count": 858,
  "scraped_at": "2026-02-14T12:44:55.775158"
}