{
  "article_id": "cc02fd47e959",
  "url": "https://metro.co.uk/2023/12/11/alex-scott-hits-back-joey-barton-message-sexism-row-19955568/",
  "title": "Alex Scott hits back at Joey Barton with message after sexism row | Football",
  "date": "20231211T111500Z",
  "domain": "metro.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Alex Scott sent a message of encouragement to all women working in football after a week dominated by the sexist outbursts of ex-professional Joey Barton.\nBarton, who was recently sacked as manager of Bristol Rovers, has made headlines for several misogynistic comments targeting female commentators and broadcasters.\nThe former midfielder has suggested that women ‘shouldn’t be talking with any kind of authority in the men’s game’ and has hit back at what he perceives to be ‘tokenistic’ hiring of women in football.\nIn another post on X, he also claimed that ‘the British, White, Middle Aged men [sic] is under attack’ with jobs no longer being offered to people like him.\nWhen invited on Piers Morgan’s Uncensored show, Barton, who represented his country at international level on one sole occasion, turned his ire on Scott, a popular host of the BBC’s Football Focus.\n‘She hasn’t played in it [the men’s game],’ Barton told Morgan in reference to Scott. ‘One is 200 years old and one is about 40 years old… It’s the same rules but football is about a lot more than rules… The games are at two different speeds.’\nHowever, Scott has now hit back at the 41-year-old’s claims, sending a heartfelt message as she ended the BBC’s live coverage of the Women’s Super Clash clash between Arsenal and Chelsea on Sunday, which saw a WSL-record crowd of 59,042 at the Emirates Stadium.\nGet your football fix\nDon't want to miss the week's biggest football stories? Metro's exclusive football newsletter, In The Mixer, is your essential guide.\nFrom the latest transfer rumours and managerial moves to analysis of the biggest games and a lot more, our experts have you covered.\nSign up here, it's an open goal.\nSorry, this video isn't available any more.\n‘Just before we say goodbye,’ Scott said. ‘To all the women in football, in front of the camera or behind it, to the players on the pitch, to everyone that attends games – keep being the role models that you continue to be to all those young girls that are told ‘no, you can’t’.\n‘Football is a better place with us all in it.’\nEarlier in the week, current Chelsea women’s manager Emma Hayes delivered a powerful response to Barton’s comments, reflecting on the systemic problems still present within the sport.\nMore Trending\n‘The realities are that male privilege has been something that’s always been at the centre of football in this country. Women were banned from playing football up until the 1970s,’ she said.\n‘I don’t expect any individual personality to understand their privilege, nonetheless, you only have to see scores of women across the internet or in the business, whether you’re a presenter, a coach or a player to realise that we’re routinely used to dealing with systemic misogyny, bullying, and behaviour that has been pretty normal for a large part of the football public.’\nMORE: Bloke with 12-minute England career tells Alex Scott to stick to women’s football\nMORE: Sam Kerr mocks Arsenal fans after Chelsea suffer 4-1 thrashing\nFor more stories like this, check our sport page.\nFollow Metro Sport for the latest news on Facebook, Twitter and Instagram.",
  "word_count": 528,
  "scraped_at": "2026-02-14T12:22:12.991337"
}