{
  "article_id": "cc04cf4bdda0",
  "url": "http://outsidelands.org/podcast/WNP497_San_Francisco_College_for_Women",
  "title": "Outside Lands Podcast Episode 497 : San Francisco College for Women - Western Neighborhoods Project",
  "date": "20230325T164500Z",
  "domain": "outsidelands.org",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Western Neighborhoods Project is dedicated to the history of San Francisco's Richmond, Sunset, OMI and West of Twin Peaks districts. read more ...\nWNP497 – San Francisco College for Women\nNicole: [00:00:00] It's Outside Lands San Francisco, podcast of Western Neighborhoods Project. Your weekly dose of friendly neighborhood history.\nHello, Outside Landers. I am your host, Nicole Meldahl.\nArnold: And I am your co-host, Arnold Woods.\nNicole: So, I'll have kind of low energy today, but maybe I'll get whipped up into a fury like I normally do in my art podcast, cause they're so entertaining. And also, we're not talking about Blackthorn Tavern as we previewed last week, but never fear, we are simply postponing that for a smidgen of time. Instead, and in honor of Women's History Month, we're gonna delve into one of the first universities of women in San Francisco. I'm sorry, universities for [00:01:00] women, also of women, in San Francisco. Which was appropriately named the San Francisco College for Women. In fact, when it opened, it was the only place in San Francisco where a woman could earn a degree other than a teaching certificate. So how did this all come about, Arnold?\nArnold: Well, our story actually begins in France.\nNicole: Mais oui!\nArnold: The Society of the Sacred Heart of Jesus was a Catholic religious institute for women established by St. Madeline Sophie Barat on November 21st, 1800.\nNicole: Whoa. Is that the oldest time period we've gone back to on the podcast so far?\nArnold: Perhaps, cause that predates San Francisco. Anyway, she had been born into a relatively well-off family in France in 1779. Barat's older brother [00:02:00] Louie was a bit of a savant, entering college at the age of nine.\nNicole: What?\nArnold: And after college, he entered a seminary to become a Catholic priest.\nNicole: At the age of like 12?\nArnold: Something like that, because he finished his studies to become a deacon at the age of 16, but he had to return home because he could not be ordained until he was 21.\nNicole: So, you know, with time on his hands, Louie decided to educate his sister Madeline. Thus, she received the education that girls were not normally afforded at the time. At the age of 18, Madeline decided to become a Carmelite nun. She then formed a Society of the Sacred Heart of Jesus with a French priest, Joseph Varin after the French Revolution, to provide educational opportunities for girls. Starting with a convent school in Amiens in 1801, it quickly spread to a number of other French cities. It received an official papal [00:03:00] approbation from Pope Leo the 12th in 1826. Pardon me, reading Roman numerals on the fly, listeners. From there, it began opening schools in other countries around Europe.\nArnold: In 1818, Rose Philippine Duquesne opened the first Sacred Heart higher education school for girls in the U.S. in St. Charles, Missouri. And from there, just like in Europe, they spread out throughout the states. In 1898, they opened a Sacred Heart Academy in Menlo Park. That campus changed its name to College of the Sacred Heart in 1921. The professors at the college were largely nuns, most of whom had doctorate degrees.\nNicole: Nice.\nArnold: And since we're talking about the San Francisco College for Women, we now get to that part of the story that brings it home for us.\nNicole: In May 1929, it [00:04:00] was announced that the Religious of the Sacred Heart, which operated a convent at 2700 Jackson Street, had incorporated and purchased a 33-acre site atop Lone Mountain. Plans then began being made to build a new site of, for the College of Sacred Heart there. Architect H.F. Minton was hired and he declared his intention to build Spanish-Gothic style buildings for the campus. He declared, and I quote, “this kind of architecture, is peculiarly fitting for two reasons. Because it will provide a commanding group of buildings adapted to the topography of Lone Mountain and because it has a historic suitability to that old outpost of the Spanish regime.”\nArnold: So, there was a particular need for this women's college, as was explained by Right Reverend Monsignor Joseph N. Gleason of the St. Francis de Sales Church in Oakland. He said, quote, “in San Francisco, there has been a notable and lamentable [00:05:00] lack of opportunity for the higher education of women. The great colleges in which they may prepare for degrees are all situated at great distance from the metropolis. There is not a single institution in San Francisco in which women may receive an academic degree.” End quote.\nNicole: A building fund committee was formed by alumni of the Sacred Heart Convent in California that was headed by Mrs. Robert Watt Williams. Let us again note here how ridiculous it is that newspaper stories at the time would only refer to women by their husband's name. Also makes them really hard to research by the way. But in preparation for the courses of study that the school would offer, the new college received cooperation from both UC Berkeley, and Stanford. So, thank you, Stanford and Berkeley.\nArnold: So, at the time there was a cross atop Lone Mountain that was from the cemeteries when they were there. It had been erected in 1862 by Archbishop Joseph Alemany. The [00:06:00] original cross was replaced in 1875, and then again in 1887, to make it sturdier both times, by Francis Buckley. That distinctive cross was even used as a navigation tool by early pilots.\nNicole: Huh?\nArnold: Your architectural plans would retain the cross, but it was gonna be moved atop a 200-foot central tower on the campus. And initially, the college was only going to accommodate just several hundred women.\nNicole: Within a month of the announced plans, the aforementioned Monsignor Gleason donated his rare book collection worth an estimated $100,000 to the school for its library. Gleason began collecting when he was a young man. His collection included many volumes about California history, 1200 volumes on French history, thousands of volumes and original papers on American history, rare works of drama in French, Spanish, and Italian, and many Asian manuscripts. Among [00:07:00] the rarest books, was the first book published in California, the Manifesto of Figueroa, published in 1839 in Monterey. All told, Monsignor Gleason's collection amounted to about 30,000 books.\nArnold: The construction work at Lone Mountain proceeded expeditiously, but the school trustees wanted to get the school opened even quicker than the construction would allow. So, on June 11th, 1930, the college announced that it had leased the home of the late Eleanor Martin at 2040 Broadway as a temporary location for the school. Mrs. Martin's home had been quote, “the center of societal gaiety,” end quote, for three generations. The school would actually open there on September 11th, 1930.\nNicole: That is how I hope my home is remembered sometime long after my death, when I donate to Western Neighborhoods Project. On June 11th, 1931, the San [00:08:00] Francisco College for Women at it, as it was now being called, graduated the first 13 women, the commencement exercises were held at the Menlo Park campus, which was still being used for primary and high school education for girls. Juanita Macondray delivered the valedictory address. The theme of her speech was the vision of women's leadership and responsibility. The graduation ceremony took place outdoors in the gardens of the convent at the Menlo Park campus.\nArnold: And since there's only 13 graduates here, let's name these pioneering San Francisco female college graduates. Besides the valedictorian Macondray, diplomas were also received by Genevieve Albers, Mary Anton, Catherine Conlin, Dorothy Dulfer. Dorothy Dunn, Margaret McCormack, Pauline O'Connor, Elizabeth Richardson. Ellinor Robinson, Maria Somavia, [00:09:00] Virginia Wardell, and finally, Myrtle Woldson.\nNicole: Ugh. I wanna research all these women. Maybe one day I'll have time. Meanwhile, construction was going on at Lone Mountain. Crews cut off the top 75 feet of the mountain to create a level foundation for the new buildings that would be constructed. The excavated dirt was then spread out over the rest of the hilltop with the expectation that gardens would later decorate the grounds. The fundraising committee put on a number of events to raise monies for the construction of the campus. These included theater performances, garden teas, and Mexican fiestas. And let me tell you, the school at Lone Mountain still sends a ton of fundraising emails. So, so a long history of fundraising at this school.\nArnold: Yeah, that pretty much never stopped as we will get to. On September 8th, 1932, the cornerstone for the new Lone Mountain building was laid. Already, the first building in the campus was nearing [00:10:00] completion. By the end of 1932, the first three buildings were finished. So, the college announced that a formal dedication ceremony would occur on Sunday, January 22nd, 1933. Before then, the new Lone Mountain campus was actually opened on Tuesday, January 3rd, 1933. To honor his book donation, the library was named the Gleason Research Library.\nNicole: Ah, I have to say, as someone who attended school on Lone Mountain, I got to, our orientation was in one of these buildings and it feels like Hogwarts. You can just imagine all these like young, incredible women who were pioneering the future of women's education in San Francisco, like bopping around and chit-chatting while like grabbing a quick drink of water. So, highly recommend you go and sneak into one of these buildings. Anyways, at the January 22nd dedication, a [00:11:00] detachment from the 30th Infantry, which was stationed at the Presidio at the time, and didn't have anything to do because it was the inter-war years, so they did all kinds of stuff like this around the city at the time, raised the American flag while San Francisco Archbishop Edward Joseph Hanna gave brief remarks. It was followed by a procession of clergymen from around the state, led by a cross-bearer. The procession ended in the auditorium where a benediction was pronounced. Afterwards, thousands of people wandered around the campus to examine the classrooms, dorms, chapel, tennis courts, of course, and a few other athletic facilities. On June 1st, 1933, the first commencement exercises were held at the Lone Mountain camp, campus for 22 graduates. So, they were already increasing their number of students.\nArnold: And we won't name the 22 graduates.\nNicole: Sorry friends/\nArnold: Even though the campus was open, the [00:12:00] aforementioned fundraising continued for the completion of other buildings. Almost monthly, for years after the opening, there were stories in the paper of teas and other events, but mostly teas, that were being held for fundraising. Even after the fundraising teas were no longer necessary for the original buildings, the San Francisco College of Women continued to hold these teas and other events to raise funds for future building projects. And these continued to receive press attention. Anytime the college held a dance, it also received mention in the news. During the World War II years, the ladies at the schools specifically held dances for Army students at USF.\nNicole: Should WNP hold fundraising teas?\nArnold: I don’t know if that's still a thing.\nNicole: But we could bring it back. Also, someone, a total non-sequitur, someone today offered to maybe bake some things for us and I was like, should we do bake sales? [00:13:00] Down for that. Anywhosit. By far, the most frequent reason that the school got mentioned in papers was, no surprise, wedding announcements. Oh, I have so many thoughts. Literally every year there were anywhere from a dozen to 20 or so wedding announcements that mentioned that the bride to be was a student or graduate at the San Francisco College for Women. Those announcements led to a curious find though. Apparently, it used to be fairly common to refer to the newly engaged woman as the “bride-elect,” as if she won an election to become some dude's wife. I swear this isn't gonna be a podcast just about how terrible women were treated back in the day. But yeah, schools, even Ivy League schools, were thought of more as finishing schools for women to prepare them for marriage, than they were to ever prepare them for careers.\nArnold: I just, I did not understand this bride-elect term. [00:14:00] I mean, they also used fiancé and bride to be and other terms like that. But the frequent mentions of bride-elect floored me.\nNicole: I feel like it's because women were selected, for many reasons, for many years, to be a man's wife, and it rarely had to do with love or, you know, it was, it was a political arrangement for, for many families. But again, not a podcast about that.\nArnold: So shortly after the Lone Mountain campus opened in 1933, a noted local artist named Clarkson Dye spent much time visiting and studying the area. As he described it, quote, “day after day, I made long trips to all sides of the mountain, studying it at every hour and in every conceivable light. Later, I began bringing a camera with me. I poured over photographs, taken from streets and housetops. Little by little, my ultimate composition [00:15:00] emerged. I made sketches with a brush. Some with, from windy roofs. One from a tombstone in the adjacent cemetery. One day, a policeman suspected me and made me answer for my prowling. Another day, a janitor refused me entrance to his roof for fear that I should commit suicide by leaping from it.” End quote.\nNicole: All pertinent reasons. Dye went on, “early one morning came the vision. The weather had been stormy, and everything was gray just before dawn. Close to the eastern horizon stretched a thin strip of clear sky. Suddenly, a shaft of sunlight shot through a rift in the sky. Glamorous and radiant just for a fleeting moment. Then all was gray again. But, in the quick instant, everything was touched with gold. That was the site I had been waiting for. It engraved an image in my memory.”\nArnold: So, Dye's resulting painting was [00:16:00] called the Splendor of the Dawn. In September 1933. It was exhibited at the White House, along with an enlarged photograph of Lone Mountain covered with snow in 1887. Dye was a native San Franciscan who had lived much of his life at 2595 Union Street, which is at Divisidero. In 1936, he assisted Frank Van Sloun in painting murals on the rotunda of the Palace of Fine Arts. Many of his paintings depicted San Francisco life. He retired to Los Gatos by 1941 and lived there till his death in 1955.\nNicole: It is one of the most beautiful hilltops in San Francisco. And it's really, it's really hard to get up those stairs if you're past the age of 35, as coeds of 19 rushed by you. But it's okay, you can just stop and pretend to take an Instagram photo. That's what I would always do. So, in 1935, the school narrowly [00:17:00] escaped disaster. Just to the west of campus, a new subdivision was being built. On December 26th, 1935 at 1:00 AM, as a result of grading work being done, an entire flank of Lone Mountain came sliding down with a loud rumbling. Streets and roads were snapped and tossed like corks on a rolling sea of earth. So, the newspaper quoted. 30,000 tons of earth were moved in the landslide. People in the area saw blue flashes of light from broken wires on poles. Because of the Christmas holidays, the campus was vacant, thank goodness, but hundreds of other people in the area were awakened. Fortunately, the campus buildings at the top of the hill were not affected. However, the college had to file an $82,000 claim against the city for damage to its grounds.\nArnold: In 1938, Maud Lee Fritz Flood, might recognize that name…\nNicole: [00:18:00] Ooh.\nArnold: Deeded the Flood mansion at 2222 Broadway to the San Francisco College for Women. Maud was the second wife of James Leary Flood, who was the son of James Clair Flood, who was the owner of the Comstock Lode, where they made their money.\nNicole: Yeah.\nArnold: Building was originally built in 1912, but had been in continual use by the school after the deeding, we think to house nuns. This is not the more famous Flood Mansion built in 1886 that still sits atop Nob Hill and it's now the home of the Pacific-Union Club.\nNicole: And still won't let women in, by the way. I will get in that building one day.\nArnold: And maybe that's why Maud decided to go the other way, and deed this to the College for Women.\nNicole: Good grief. In 1964, nearby USF, an all-male institution, began admitting women. I still can't believe it took that long, but here we are. Previously, San Francisco State, [00:19:00] which started as a school to earn a teaching degree, had expanded to become a full university with all kinds of subjects to earn a degree in. Which we've gotten into a few times on this podcast. Women now had other places where they could get a complete college education in San Francisco and the San Francisco College for Women was not doing so well financially as a result. So, what's a women's college to do? By all means, start admitting men. This started in 1967, a great year for San Francisco, as an exchange program with USF, as an experiment in co-ed education. And I actually did an oral history series for USF magazine about this year on campus and interviewed a few women who started at the, at the San Francisco College for Women and ended up graduating from us. Very interesting time for the campus.\nArnold: So, in April 1969, the San Francisco College for Women announced that it would begin [00:20:00] admitting men that fall. Now, while it might have been interesting to see if men would actually apply to a university named San Francisco College for Women, the school decided it would save men any kind of embarrassment by renaming itself. Ultimately, they chose the name Lone Mountain College. And by year two of this newly co-ed college, there was 185 men in the school of 800 students.\nNicole: I mean, if I'm a guy of college age, I mean, I would wanna be on the campus with the most ladies. Would you not Arnold?\nArnold: I agree. But, you know, there are many men out there I think who would be afraid to go to a school that was called the College for Women.\nNicole: Yeah right. Cause we attract bears once a month. So, you know it, I understand. So, despite the addition of male students now, Lone Mountain College's financial situation did not improve much. It's [00:21:00] not easy to run a college. Although it was a private school, trustees had kept tuition lower than other private institutions so as not to price out the middle class. And it shows in the students that graduated and supported for many years. Nonetheless, the college was unable to fill a complete class, so they began to look once again for ways to become more financially viable. Lone Mountain College also decided to begin disassociating itself from the Society of the Sacred Heart of Jesus. They brought in new trustees, though Sacred Heart still had about a third of the Board of Trustees positions.\nArnold: Yeah, so the complete class, as I understood it, was about a thousand students and they only had 800 in year two of this, and I think it keeps going down from there. The financial solution they hit upon was this, to return to just being a college for women.\nNicole: Oh boy.\nArnold: On November 18th, 1977, Lone Mountain College announced that it would begin [00:22:00] phasing out men from their undergraduate programs in the fall 1978 term. They also stated that the college's name would be changed again, this time to the Lone Mountain College for Women. The school's Vice President for Corporate Planning and Development, Joan Barr, stated that the college would seek, quote, “to address the new roles women are going to be playing and are indeed playing in the corporate and business world.” End quote.\nNicole: Barr went on to state that the school wanted to provide, and I quote, “a situation where women can have a chance to be competitive without worrying what young men think of them.” End quote. Which, to be honest, was what I heard my entire life going to school. Like, ah maybe, maybe now we gotta encourage girls to raise their hand more. And maybe they're better off at an all-girls school so they don't have to worry about men and how distracting boys are. Yeah. As part of the changes, Lone Mountain College announced it would also be offering a one-year fast track program in [00:23:00] management skills for women. Barr also stated that the school's $2,700 tuition price would likely increase the following year.\nArnold: Unfortunately though, the financial situation was only getting worse and the school concluded that it would not be able to actually make it.\nNicole: Should have stuck with tea parties.\nArnold: Lone Mountain College President Bernard Kolker said that they had high hopes that returning to a female focused education would attract more students and donors, but they, quote, “just didn't have enough time to bring it all together.” End quote, Kolker said that the quote, “hard realities of deficits,” end quote, forced the decision.\nNicole: Yeah. On February 1st, 1978, Lone Mountain College announced that it would have to close at the end of the spring semester. In order to make it to the end of the term, the school received a $700,000 loan from neighboring USF. Under the terms of a loan, [00:24:00] USF received an option to purchase the Loan Mountain Campus for $5.8 million dollars. The USF trustees unanimously approved the acquisition of Lone Mountain College on April 27th, 1978. The purchase would be effective on June 30th, 1978. And under the terms of the purchase, all Lone Mountain College students were allowed to transfer to USF without any loss in credits. And this is interesting, cause if you don't remember, USF tried to step in to save the San Francisco Art Institute as it began foundering. So, it sounds like USF has a long history of trying to save higher education institutions in jeopardy in San Francisco.\nArnold: Even though they were part of the problem for the San Francisco College for Women, by admitting women themselves.\nNicole: Bygones. Bygones.\nArnold: So thus, after 45 years atop Lone Mountain, the story of the San Francisco [00:25:00] College for Women came to a conclusion. It was a groundbreaking institution in its time with the educational opportunities that it offered women. However, the world caught up to it, leading to its demise, which leads us to declare…Say What Now?\nNicole: Yeah, so back in the early to mid-1940s, Herman Wedemeyer was a standout football halfback at St. Mary's College. So good, in fact, that he would finish fourth in the Heisman Trophy voting in 1945. He was variously dubbed Squirmin’ Herman, the Flying Hawaiian, and the Hula-Hipped Hawaiian. Wedemeyer went on to become a character actor, actually, most notably playing Sergeant Duke Lukela on Hawaii Five-O.\nArnold: And it makes us wonder, you know, does St. Mary's College still have a football team? I'm not sure that they do.\nNicole: Yeah, I don’t know.\nArnold: And by now, you're also wondering what [00:26:00] Wedermeyer has to do with the San Francisco College for Women. The answer is technically nothing. But, in October 1943, Patricia Herman, who is a student at the San Francisco College for Women, wrote into the San Francisco Chronicle about a story they had written about Wedemeyer. In said article, the Chronicle sportswriter had waxed poetic about Wedemeyers's running and passing. However, Ms. Herman noted the Chronicle was overlooking something.\nNicole: She wrote, and I quote, “why do you think Jim, Jimmy Phelan, the St. Mary's coach, leaves Wedemeyer in 60 minutes? He isn’t on offense 60 minutes. Phelan knows Weedy is as valuable to St. Mary's in breaking up plays as he is starting those of his own.” End quote. The Chronicle noted that Herman was a “football nut and no superficial student of the game.” End quote. And this gets us to our favorite part of [00:27:00] the story.\nArnold: As the Chronicle noted, quote, “coming from a girl, this observation embarrasses us. Why didn't we think of this before? Gals are not supposed to appreciate dull defensive stuff.” End quote. So, let's hear it for Patricia Herman. Embarrassing stuffy, sexist sportswriters with a keen observation that “gals” aren't supposed to be able to make.\nNicole: To this day, Arnold, whenever I bring up baseball stuff, people are always like, huh, I never thought you'd be into baseball. And I'm like, why wouldn't you think that? And they look at me with big eyes like, uh, well we can't say it's cause you're a girl.\nArnold: Even though that's what they're really thinking.\nNicole: Yeah, exactly. And most of those men have never been to a Hall of Fame induction in Cooperstown like I have. So, you know. [00:28:00] Well, before we move on into listener mail, I have to say, just to harp on this some more, the original buildings from the San Francisco College of Women that are up on Lone Mountain are beautiful. And I wanna give a shout out to USF, cause they've been building lots of new buildings along the hillside and they all are very respectful of the context that those original buildings are in. And you, if you ever get a chance, please go wander the halls of the main building on campus. It's where I was able to take some classes. It really is a trip back in time. So, thank you again to all my USF companions up on the hill for, for letting me into the program, so I could experience that firsthand. And now Arnold, it's time we move to?\nArnold: Listener mail. So, if you have ideas for future episodes or something came up while you were listening to this [00:29:00] episode, you can drop us line at podcast@outsidelands.org. We're also on all the social medias. So, send us a message on Instagram, Twitter, and Facebook. Those are mostly outsidelands with a Z for the first two, and outsidelands with an S for Facebook.\nNicole: We’re not on TikTok. I don't know if we are gonna get on TikTok. I think we might shut TikTok down because of the Chinese government's observation of TikTok. But, who knows. So, in last week's podcast, we cut short the flood of responses we got about episode number 493 about the BarbCo office building at 41 to 47 West Portal Avenue, cause we were running extremely long. So, let's get back to those memories now. Andrew wants more from that neighborhood writing, and I quote, “great podcasts. Loved it. Do more West Portal stuff.” Message received Andrew.\nArnold: And we will absolutely get to that at some [00:30:00] point in the future. The podcast inspired many of you to share general neighborhood memories, like Linda who said quote, “there was a chandelier shop on West Portal Avenue in the mid-1960s. The owners bought one of our silver miniature female poodle puppies and took it to work with them every day. Of course, they named her, Chandelier.” End quote.\nNicole: This is the history I'm in this job to do. Nora said, “very cool. My grandmother had the first beauty shop, Lucille's, across the street from the Philosopher's Club. I think there is still a beauty shop there today.” And yes, Nora, I believe you can get a mani-pedi there.\nArnold: And finally, Carol shared, quote, “my parents lived in and managed a large apartment building at 139 West Portal throughout the 1940s. The building was built during the 1920s and, at some point before the [00:31:00] 1980s, it was demolished and a Starbucks replaced it.” End quote.\nNicole: Oh.\nArnold: So…\nNicole: I think if Joan, if Joni Mitchell recorded, you know, her song about bulldozing and building a parking lot, I think it might be a Starbucks if she recorded it today.\nArnold: Yeah. They paved, they pave paradise and put up a Starbucks.\nNicole: Starbucks.\nArnold: And Andrew if you're listening to this podcast, if you have a picture of your poodle “Chandelier” that was bought by the chandelier shop, please share it with us.\nNicole: In general, if anybody listening has any photos anywhere on the west side, we’ll wanna see them. So now Arnold, perhaps you can tell us a little bit about the benefits of membership and donating.\nArnold: Absolutely. And the biggest benefit of all…\nNicole: Yeah.\nArnold: Is you support these great programs that we do, like this podcast. But [00:32:00] we're doing so many things, so many events that we offer, that our members get in at a reduced price.\nNicole: Yeah.\nArnold: Because membership gets you discounts on events and other exclusive perks. And, it gets you our quarterly membership magazine, which has all kinds of fascinating West side history information.\nNicole: Yeah.\nArnold: Your membership also helps support the OpenSFHistory treasure trove of photos that we have. It also helps the care and exhibition of the Cliff House collection, some of which is back on our walls here at the office. And we hope to be opening the office soon for people to come and visit it. So, clickety, clickety, clack that big orange Become a Member button at the top of every website page. Or if that's just a little too much for you, there's also a big orange Donate button at the top of every page. So, throw a couple bucks our way and help support all we do. [00:33:00]\nNicole: Yeah. So, we'll get into all those events in a second, Arnold. But the number one thing I've been working on this month is, the National Park Service, in all of their infinite wisdom, has informed Western Neighborhoods Project to remove the historic Whitney family totem pole from the only location it's ever lived in, next to the Cliff House. And as you can imagine, it's not easy to move a totem pole. Nor will it fit in the office. So, I've been talking to many people, including the American Indian Cultural District, about how we all feel about this thing. Where it can possibly go. How much it's gonna cost us to move it, way more than all of our memberships combined. And, and so, stay tuned for the children's book version of Have Totem Pole, May Travel.\nArnold: Which is a [00:34:00] good reason to become a member or donate to help us move that totem pole.\nNicole: So, if you ever wonder why the office isn't open, it's because I'm on the phone dealing with nonsense like that. So, stay tuned on where the totem pole ends up. Or email us here if you have an idea. Like, “hey, I think that'll fit in my business or my backyard.” Or anything else in between. So, but let's talk about some more fun, less stressful things Arnold. What kind of events do we have going on.\nArnold: Yeah, let's get into announcements. So work is progressing on our windmills of Golden Gate Park Exhibition at the WNP Clubhouse here on Balboa.\nNicole: Shall be installed at the end of March.\nArnold: Absolutely. So that's gonna be coming up. And we are, I think we have a date now for our trivia night with Fort Point Beer. What's that date Nicole?\nNicole: [00:35:00] It's April 10th, which I think is a Monday, so everybody clear your work schedules for Tuesday. But yeah, we're very excited. We're starting this new partnership, well ongoing partnership, with Fort Point Beer Company doing neighborhood trivia in neighboring watering holes. We're starting with the Sunset District and it's gonna be at the Little Shamrock. So, Fort Point is gonna run all of the registration info for that. It will be free, but we do want you to RSVP, cause I have a feeling we're gonna have some beer available for you.\nArnold: And, of course, the Little Shamrock itself is a historic West side business.\nNicole: Yes. Thank you to the Little Shamrock team for allowing us to do this in their space.\nArnold: So, coming up on Saturday, April 8th, 2023, John Martini is gonna lead you around a history walk of Mountain Lake Park. Then on May 13th, and that may be actually sold out by now. So, [00:36:00] the fact that we're announcing it is bad news for you because, but you can check in just in case somebody needs to drop out or whatever. But your chance of getting a ticket for that are not very good right now. Then on May 13th, 2023, former WNP Board member Richard Brandi, is going to take you on a tour of the Forest Hill Extension area. And Richard is also having a celebration of his book, which is called Garden Neighborhoods of San Francisco. That will happen on the Internet Archive on Thursday, April 6th. So, these history walks and the Richard Brandi book event are happening. They're only costing $10 for WNP members, $20 for everyone else. And, at the book event, copies of Richard's book will be available for purchase. And you can probably have him sign it there as well.\nNicole: And WNP sells that book for the cheapest anywhere. It's even cheaper than Amazon sells it, [00:37:00] cause we don't try to gouge you for history.\nArnold: So, visit the events page on outsidelands.org to get your ticket. Or you can follow us on Eventbrite to sign up through them. And more events are coming, so keep an eye on the events page, the Eventbrite, and our social media channels where they will also get announced. Tickets are usually limited for all these, so you don't wanna be miss out your chance to be a part of the fun.\nNicole: Absolutely. And did we mention that we cover all of your Eventbrite registration fees when you're a member. But if you're not a member, you gotta pay them yourself?\nArnold: Do we have a preview for what's gonna be coming up next week.\nNicole: Yes, Arnold. Our preview for next week is not what we previewed last week either. I have a very special guest with me. If you've ever used Craigslist to find a roommate or sell your office chairs like [00:38:00] WNP just recently did, then you won't wanna miss it because we'll be talking to Craig of Craigslist. Who yes, is a real human being. So, until next time, I'm Nicole Meldahl.\nArnold: And I'm Arnold Woods.\nNicole: And this has been another episode of Outside Lands San Francisco. Thanks for being with us history friends.\nIan: Outside Lands San Francisco is recorded by Ian Hadley. Content creation and media production at ihadley.com.\nNicole: To learn more about the Western Neighborhoods Project and more on San Francisco history, go to Outsidelands.org. You can also find us on social media at Facebook, which is outsidelands with an S, at Twitter, which is outsidelandz with a Z, and on Instagram, which is outsidelandz, also with a Z. And check out our historic San Francisco images website at OpenSFHistory.org. [00:39:00]\nMore Podcasts\n-\nPodcast # 73: Columbarium\nSan Francisco's Columbarium, built in 1898 in the Odd Fellows Cemetery, still stands and is still in business in the Richmond District. Tens of thousands of cremated remains in a grand domed building with room for more. -\nPodcast # 128: Coronet Theatre\nHome of Star Wars premieres, Oklahoma, and 1,300 stadium seats on Geary Boulevard, the recent-gone Coronet opened in 1949.\nThe Outside Lands San Francisco podcast is also available as a subscription via iTunes and by RSS feed.",
  "word_count": 6064,
  "scraped_at": "2026-02-14T13:07:26.762133"
}