{
  "article_id": "cc19089742a8",
  "url": "https://www.cardchronicle.com/2023/3/3/23623867/friday-afternoon-cardinal-news-and-notes-louisville-cardinals",
  "title": "Friday afternoon Cardinal news and notes",
  "date": "20230303T220000Z",
  "domain": "cardchronicle.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "—Highlights from today’s ACC quarterfinal triumph over Wake Forest are here.\nFriday afternoon Cardinal news and notes\nPoppin’ some bubbles next week?\n—It’s Shriners Classic day one for the Louisville baseball team, which will take on Texas A&M at 7 p.m.\nMatt Sefcovic lets you know how you can watch:\n—The latest bit of evidence that the SEC is going to move to a 9-game conference schedule for football is that Nick Saban is already complaining about who Alabama’s permanent opponents are rumored to be.\n—The U of L softball team moved to 12-4 with a 7-0 win over Northern Kentucky on Thursday.\n—Louisville’s scheduled lacrosse match against Cincinnati for today has been canceled.\n—Trentyn Flowers, the 5-star prospect who appears to be Louisville’s primary focus in the class of 2024, talks about the five schools currently recruiting him the hardest.\nArkansas - “The entire staff has been great at recruiting me. I talk to them all several times a week. I love that Coach Eric Musselman has a great plan for me. I believe they could help me with my goal of playing at the next level.”\nCreighton- “They have done a good job recruiting me. I have really gotten to know the staff and have enjoyed both of my visits. I was able to attend their pink out game and the fans and atmosphere was amazing. I really like their play style and how they would utilize me in their offense. I play the right way and their offense lends to my play style.”\nAlabama - “I have had a relationship with coaches for awhile and they were one of my first offers in the ninth grade. They have a great plan for me and I like their style of play.”\nLouisville - “I have known Coach Nolan Smith since he was recruiting me when he was at Duke. Even though their season has not been the greatest, I see what they are trying to do over there. The entire staff has a lot of experience that I believe can help me achieve my goal of playing at the next level. I took an official visit for Louisville Live and was able to watch the Florida State game recently. The energy and fans there are amazing.”\nUNC- “Coach Sean May and Coach Hubert Davis have been involved the most in my recruitment. I took an unofficial before the season started and really liked the visit. UNC is basically in my backyard! There is so much culture there and the coaching staff and fans are great!”\nAs he nears a decision, Flowers emphasized his three needs for a school of his choice.\n“The most important thing is want, fit and need! I have been very thoughtful in all of my final schools and each of them are in there for a reason,” Flowers said. “I want to go to a place where I can come in and make an immediate impact and that has a plan in place for me to get to my goal. It is important for me because I value relationship’s, that I go to a school that feels like family. I want to be around a staff that makes my goal, their goal.”\n—Jeff Brohm has offered Minnesota DB transfer Beanie Bishop. Bishop is from Louisville and played his high school ball at PRP.\n—It sounds like the Big 12 could move to add four Pac-12 schools as early as by the end of this month.\n—Antoine Davis had a shot at the end of regulation to tie Pete Maravich’s all-time NCAA scoring record, but it found nothing but iron.\nDetroit led for most of the evening, but ultimately fell short against top-seeded Youngstown State in the Horizon League quarters. Tempers flared after the game between Davis and the Penguin student section.\nIt’s worth mentioning that there were like eight conference tournament game where tempers flared ... or where dudes got straight up punched in the face.\n‘Tis the season.\n—In related news, this is wild.\nAlso crazy: Maravich averaged 38 shot attempts per game and took more field goal attempts in three seasons than Davis did in five.\n—Cardinal Authority tracks every Louisville football roster change as we get ready for the start of spring football.\n—Tonight’s 7th Region boys basketball semifinals at Valley have been postponed because of the weather.\n—Sean Vinsel writes about JJ Traynor for his latest Hoops Insights newsletter.\n—Friday Irrelevance:\n—I like that the frisbee dog shitting on the court at halftime Tuesday night is the thing that Louisville has gotten the most press for during the worst season in program history.\n—U of L volleyball’s spring schedule is out.\n—Jeff Greer writes about hope in his latest Louisville basketball newsletter.\nThere is a Martin Luther King Jr. quote I think of every now and then: “We must accept finite disappointment but never lose infinite hope.” It was, and still is, a statement that applies to much, much larger, more important topics than college basketball … and yet, I’m about to apply it to college basketball.\nI couldn’t help but think of that line as news floated this week that former Minnesota signee Dennis Evans may be leaning toward Louisville and current star guard El Ellis said he’d return to Louisville if he stayed in school.\nYou, dear reader, have accepted so much disappointment, some of it part and parcel of rooting for a college basketball, some of it a tad much to take for even the hardest-core fans. You are still here — week in, week out — reading about Louisville men’s basketball. You are still, at least I assume, tuning into games or clicking on news stories or following along some way, somehow. After everything — the Katina Powell scandal, the FBI scandal, the departure of a Hall of Fame coach, the nasty parting of ways with a massively influential athletics director, multiple coaching changes, multiple bad seasons, this particularly painful 4-26 campaign and a dog crapping on your court — you are still here. That, even with all the angst and the madness and the frustration and the sadness, is what makes Louisville basketball Louisville basketball. So many other fan bases would’ve given up by now, resigned to malaise and mediocrity or even worse. But you have not. Many of you have not.\nThat is the power and the allure of hope, and it’s a faith based in a history-making past, not on something false or empty.\nHope is to cherish a desire. Hope is to expect with confidence. It is to think that, surely, at some point, what you expect to happen will happen. And in the case of Louisville men’s basketball, hope is the belief that someday — sooner rather than later — the program will be the program it once was, a proud, winning team that plays with pizzazz and gusto and swagger and makes the NCAA Tournament every year. A bad year is a double-digit seed and bubble status, not 4-26 or 13-19. This is not nostalgia; this is simply a belief in resources, tradition, standards. This is not hope as a dream-like, fairytale wish; it is hope as a belief, a confidence that your faith will be rewarded because it has been so often in the past.\n—You can read a transcript of Jeff Walz’s comments following today’s win over Wake Forest here.\n—Cavs Corner previews Virginia’s Senior Day game against the Cards.\n—U of L has offered Arizona safety Jaylen Jones.\n—It’s been a pretty incredible week already for college hoops quotes.\n—Three Kosair kids are getting an all-access experience with the Louisville baseball team in Houston.\n—Matt McGavic is predicting a 70-59 Virginia win over Louisville tomorrow.\n—Take me to that old familiar place ...\n—Louisville Report lays out the five biggest questions for Louisville football heading into spring practice.\n—The 20th-ranked Louisville men’s tennis team will face No. 22 Duke and No. 10 North Carolina this weekend.\n—Eric Crawford recaps the first of hopefully many postseason wins for the U of L women’s basketball team this month.\n—And finally, beat Texas A&M, beat Notre Dame or NC State, and beat Virginia.",
  "word_count": 1363,
  "scraped_at": "2026-02-14T11:59:33.436885"
}