{
  "article_id": "cc2a47e45a8e",
  "url": "http://europe.chinadaily.com.cn/a/202412/26/WS676cc85ea310f1265a1d50fa.html",
  "title": "Next year will spell end of amateur era",
  "date": "20241226T070000Z",
  "domain": "europe.chinadaily.com.cn",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Next year will spell end of amateur era\nSettlement of landmark legal case will see US colleges become responsible for directly paying athletes\nWhen the page turns on 2024, it will be time to say goodbye, once and for all, to the amateur athlete in North American college sports.\nIn theory, the concept held on stubbornly via the quaint, and now all-but-dead, notion that student-athletes played only for pride, a scholarship and some meal money.\nIn practice, the amateurs have been disappearing for years, washed away by the steady millions, now billions of dollars, that have flowed into college athletics, mostly through football and basketball, both through legitimate and illicit means.\nIn the coming year, the last vestiges of amateur college sports are expected to officially sputter out — the final step of a journey that has felt inevitable since 2021. That's when the Supreme Court laid the foundation for paying college players in exchange for promotions — on social media, TV, video games, you name it — featuring their name, image or likeness (NIL).\nThe changes have come in spurts so far, not always well thought out, not always fair and not regulated by any single entity, like the NCAA or federal government, but rather by a collection of state laws, along with rules at individual schools and the leagues in which they play.\nBut, on April 7, the day final approval is expected for the landmark, $2.8 billion lawsuit settlement that lays the foundation for players to receive money directly from their schools, what was once considered anathema to the entire concept of college sports will become the norm.\nDavid Schnase, the NCAA's vice-president for academic and membership affairs, acknowledges that maintaining the unique essence of college sports is a challenge in the shifting landscape.\n\"You can use the word 'pro,' you can use the word 'amateur,' you can attach whatever moniker you want to it, but those are just labels,\" Schnase said. \"It's much less about labels and more about experiences and circumstances. Circumstances are different today than they were last year, and they are likely going to be different in the foreseeable future.\"\nDo players get rich off these new deals?\nFew would argue that college athletes should get something back for the billions they help produce in TV and ticket revenue, merchandise sales and the like.\nBut, is everyone going to cash in? Are college players really getting rich?\nRecent headlines suggest top quarterback recruit Bryce Underwood was lured to Michigan thanks to funding from billionaire Oracle founder Larry Ellison, and that a top basketball recruit, AJ Dybantsa, is heading to BYU — not a hoops powerhouse — for the reported price of $7 million.\nFor every Underwood or Dybantsa, though, there are even more Matthew Slukas and Beau Pribulas.\nSluka's agent says he agreed to play quarterback at UNLV after a promise of receiving $100,000, and quit three games into the season after the checks never came.\nPribula was the backup quarterback at Penn State who abruptly entered the transfer portal earlier this month, choosing the college version of free agency over a chance to play with the Nittany Lions in the College Football Playoff. He's not the only one hitting the portal in hopes of getting rich before new regulations related to the NCAA settlement take effect.\n\"We've got problems in college football,\" Penn State coach James Franklin said.\nThe settlement will overhaul the current system. Currently, players receive money via third-party collectives that are booster-funded groups affiliated with individual schools. Coming up fast: The schools paying the athletes directly — the term often used here is \"revenue sharing\" — with collectives still an option, but not the only one.\n\"It's going to be more transparent,\" said Jeff Kessler, the plaintiffs' attorney and antitrust veteran who helped shape the settlement.\n\"If anything, having the schools handling all the payments is only going to improve the system.\"\nThe NCAA has started collecting data about NIL payments, which date to July 2021. Its first set of numbers, which includes data from more than 140 schools across more than 40 sports in 2024, show a bracing disconnect between haves and have-nots.\nFor instance, average earnings for football and men's and women's basketball players is nearly $38,000. But, the median earning — the middle number among all the data points on the list — is only $1,328, a sign of how much the biggest contracts skew the average.",
  "word_count": 741,
  "scraped_at": "2026-02-14T13:16:23.036824"
}