{
  "article_id": "cc438a95bb7e",
  "url": "https://www.campaignasia.com:443/article/what-tariffs-hyundai-stays-the-course-but-ny-auto-show-vibes-signal-caution-ahe/502123",
  "title": "What tariffs ? Hyundai stays the course , but NY Auto Show vibes signal caution ahead | Analysis",
  "date": "20250424T013000Z",
  "domain": "campaignasia.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "This past weekend, the NY Auto Show celebrated its 125th anniversary. But what normally would have been a joyous occasion filled with fanfare from automakers and car enthusiasts alike was cast with trepidation for some and cautious optimism for others in the wake of the Trump administration’s 25% automotive import tariffs. The move threatens to send the price of cars skyrocketing for American consumers already reeling from higher prices on groceries and other essential goods. Reuters has predicted the decision could lead to 2 million fewer auto sales in the U.S. and Canada in 2025.\nFollowing the administration’s initial announcement, which has since waffled as automakers scramble to make adjustments, Ford immediately went into fight-or-flight mode with the launch of its From America, For America campaign, offering consumers employee discount pricing for many of its models through June 2 while highlighting its U.S.-based manufacturing.\nHyundai Motor Group, which was already in the process of reshaping its marketing strategy to be a more consumer-centric brand, recently released its own campaign, The Hyundai Way, offering American consumers a reprieve during the same time window as Ford. Filmed in its Georgia and Alabama manufacturing facilities, the 30-second spot features shots of the plant’s employees, but — instead of discounts — the auto brand offers support through its Customer Assurance Program, an initiative that ensures customers purchasing or leasing vehicles will not see a price increase on the Manufacturers Suggested Retail Price (MSRP) through June 2.\nAs a result, the Korean automaker came into the NY Auto Show with more confidence than most, focused not on tariff talks, but on the company’s new slate of product offerings and partnerships that it hopes will elevate the brand’s awareness and favorability among consumers and reach them where they are.\n“It's not really having a change in our marketing strategy,” Hyundai CMO Sean Gilpin told Campaign about the tariffs. “We're focused on doing good things for the customer, making good products and being a big ‘leaned in’ company when it comes to our marketing investments.”\nNavigating new terrain\nGilpin, who ascended to the CMO role in August following a restructuring that led to the departure of Hyundai’s previous CMO, Angela Zepeda, to X, says the customer assurance campaign was really a continuation of its previous work as brand, citing Hyundai’s 10-year, 100,000-mile warranty and its COVID assurance policy, which allowed customers to return vehicles without penalty in the event of hardship.\nThat said, the company saw an urgent need to deliver messaging reassuring customers of the policy after data findings revealed many were confused about how tariffs worked.\n“One thing they assumed was that the cars were going to be more expensive as a result,” said Gilpin. The brand wanted to “give customers that confidence that they could come in and still be getting a great Hyundai, at a great price.”\nThe spot is currently running during the NBA playoffs, marking an expansion on Hyundai's investment in sports, which now also includes the NCAA March Madness tournament. The brand has previously been intentional with its media spend; eschewing big-ticket buys such as the Super Bowl in recent years in favor of the NFC and AFC championship games instead. It has since ramped up its NFL investments to include NBC’s Sunday Night Football and Amazon Prime’s Thursday Night Football.\nMost notably, Hyundai has also entered a partnership with the Fédération Internacionale de Football Association (FIFA), becoming the official global auto partner of the 2026 World Cup. Gilpin also shared that the brand recently announced it is an official founding partner for the Boston Legacy National Women’s Soccer League (NWSL) team, set to debut in 2026, stating that the brand continues to lean into women’s sports.\nThe automaker has also ramped up its work with content creators on TikTok and YouTube Shorts, and remains committed to using multicultural agency partners Lopez Negrete Communications and Culture Brands as it continues to create stronger inroads and content specifically tailored to Hispanic and African-American consumers — bucking a trend that began at the start of the Trump administration targeting inclusive business practices.\nThe show must go on\nWhile Hyundai remains optimistic about its fortunes in the current climate, the mood at the NY Auto Show told a more somber story.\n“The NY Auto Show felt quiet. Not the usual vibrancy, anticipation and fanfare of previous years,” Scott Zacaroli, creative director of his eponymous company, Zacaroli, told Campaign. “I think it is due to a number of factors. First, some of the industry’s biggest and most glamorous players have taken a pass on this show. And it was felt. Second, I do think there is a touch of uncertainty in the air as everyone tries to read the times. And third, these traditional shows have generally become scaled-back versions of what they once were. So that is more than just a New York thing.”\nIndeed, the Detroit Auto Show, which took place earlier this year, has been seeing steep declines in attendee numbers, with Carscoops reporting attendance at what was once considered the premier auto industry event in the U.S. has dropped by 500,000 in the past six years.\nThat said, Zacaroli acknowledged that Hyundai, Genesis (which also falls under HMG) and Toyota stood out as the more confident brands in attendance.\nThe former agency veteran — who previously worked as a creative director at Merkley+Partners on its Mercedes-Benz business prior to starting his own company, where he produces a wide range of projects for a variety of brands across the luxury and automotive space including Jaguar, Land Rover, Cadillac, MillerKnoll and Mercedes — says companies that overreact to the fluctuations of sales and the whims of culture will be much more vulnerable when uncertainty comes.\n“Companies that actively cultivate the power of their brands are less susceptible to the dynamics we see today,” he said. “A brand that is well articulated and truly meaningful to its constituents will endure the cycles of economics, politics … all of it.”\nAgencies still have something left in the tank\nBased on his experience, Zacaroli believes the current climate presents an opportunity for nimble agencies to thrive, sharing that younger brand CMOs coming up through the ranks now have different expectations of their creative partners.\n“They don’t need big org charts,” he said. “They need — and want — direct access to the thinkers. The writers and designers. The directors. The makers. For large clients there is an undeniable need for major support infrastructure, and for teams that can move mountains. But the line from CMO to Maker still needs to be direct.”\nHe also sees client/agency relationships with a strong level of trust enduring economic fluctuations and industry shifts, citing brands who’ve built in-house agencies through their agency talent, much the way Hyundai has with Zepeda and now Gilpin, both of whom were at its creative agency, Innocean, before joining the executive ranks at the brand. (Gilpin is technically a boomerang, having worked with the brand before his stint at Innocean.)\n“In-house agencies used to pick up the pieces the general agency didn’t want. But some of the most interesting work is now being done within brands by people who have built fully functioning ‘in-house’ agencies. And they have hired some of our industry’s best talent, making them a legitimate alternative to the older agency model.”",
  "word_count": 1221,
  "scraped_at": "2026-02-14T12:19:53.221675"
}