{
  "article_id": "cc83aaf53c9b",
  "url": "https://www.twincities.com/2025/08/27/get-to-know-new-gophers-quarterback-drake-lindsey/",
  "title": "What to know about new Gophers QB",
  "date": "20250827T204500Z",
  "domain": "twincities.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "In August 2023, promising young quarterback Athan Kaliakmanis took the reins of the Gophers’ offense.\nIn 2022, the redshirt freshman made five starts in place of injured Tanner Morgan, including a starring role in a rivalry win over Wisconsin at Camp Randall Stadium. With Morgan exhausting his eligibility that next year, it was time for the 6-foot-4 signal caller with a big right arm to become the no-doubt QB1 at Minnesota.\nThat new era became a cautionary tale.\nAt the end of 2023, Kaliakmanis capped an underwhelming season with a rivalry loss to the Badgers and entered the NCAA transfer portal after head coach P.J. Fleck said competition was coming by way of the NCAA transfer portal.\nLast fall, New Hampshire transfer Max Brosmer completed the most passes in a single season in program history with 2023 signee Drake Lindsey as his understudy. With Brosmer now on the Vikings’ roster, it’s time for Lindsey, a 6-foot-5 redshirt freshman with a big right arm, to become the no-doubt QB1 at the U.\nThis new era is a blank slate.\nWhile there are similar touchstones between Kaliakmanis and Lindsey, the latter has an opportunity to make his story unparalleled over the next few seasons.\nHere are nine things to know about Lindsey going into the season opener against Buffalo at 7 p.m. Thursday at Huntington Bank Stadium:\nGot a taste last year\nLindsey played in three total games as a true freshman, keeping his redshirt. He completed 4 of 5 passes for 50 yards, one touchdown and no interceptions, with 13 of his 19 total snaps coming late in a 48-0 blowout of FCS-level Rhode Island on Week 2.\nBefore the Duke’s Mayo Bowl, Brosmer campaigned for Lindsey to have a special package in Charlotte, and the protege completed one pass for 15 yards in the 24-10 win over Virginia Tech.\nHigh school honors\nThe Fayetteville, Ark., native was the state’s Gatorade Player of the Year after leading his team in an undefeated (13-0) run to the Class 7A state championship in 2023. He was MVP of the state title game.\nAs a senior, he threw for nearly 4,000 yards, completed nearly 70 percent of his passes with 54 touchdowns and three interceptions. Two of his picks came when his arm was hit.\nOut of Razorbacks’ backyard\nLindsey grew up a fan of the Arkansas Razorbacks and in a family of student-athletes who wore the Hogs’ cardinal and white. His grandfather Jim Lindsey was inducted into the school’s hall of fame for his career as a running back in the 1960s.\nDrake’s father, John David, played receiver at Arkansas in the 1990s. His sister Loren was on the women’s basketball team a few years ago. Also, one uncle and a cousin played football there, and another cousin was a track and field athlete.\nBut the Razorbacks’ football program didn’t show interest in Lindsey until well after the three-star prospect was committed to the Gophers and signing day was around the corner in December 2023. It was too little, too late.\nDrake was “upset a few times” at the snub from his hometown SEC school, and John David acknowledged the lack of interest “was a little bit of a weird thing,” but said he was ultimately “happy with Drake’s decision” to go to Minnesota..\nRELATED: How the Gophers got quarterback recruit Drake Lindsey out of the Razorbacks’ backyard\nA Vikings fan\nSince his grandfather Jim played for the Vikings from 1966-72, Drake became a fan of the Purple.\n“It just seemed like destiny almost, with my grandfather playing in the NFL here,” Drake said in July. “It felt like something was calling me here, to be honest.”\nThat has only grown with Brosmer making the Vikings’ 53-man roster as an undrafted free agent this week.\nMore on Drake’s plate\nDuring spring practices, Fleck said Lindsey was “playing at a really high level … probably higher than any younger player I’ve ever had at that position.”\nIn fall camp, offensive coordinator Greg Harbaugh added he was challenging Lindsey “more than I did last year with Max. I probably put more on Drake’s plate than I did (with Max) last year.”\nThe Gophers shifted their run-heavy offense two years ago to a more balanced scheme with short-and-intermediate passing under Brosmer a year ago. Harbaugh’s system has evolved again, but expect Lindsey to work through similar passing progressions at the line of scrimmage.\nOvercoming adversity\nAs an eighth grader, Lindsey tore a patellar tendon and said he had to rehab for most of the following year.\n“It taught me a ton,” Lindsey told the Pioneer Press at Big Ten media days in Las Vegas in July. “Once I had surgery, it made me realize how much I wanted it. When you can’t do something, you kind of realize how much you love it, how much it means to you. … I couldn’t walk for 10 weeks, so it teaches you a lot of different things, mentally, physically and just gratefulness.”\nThat injury setback was also when Lindsey, who just turned 20, knew he wanted to play college football and “be one of the best.”\nFuture first rounder?\nCBS Sports commentator Josh Pate in June put out a list of the top 10 quarterbacks in the Big Ten this fall; Lindsey was not included. His QB trainer, Quincy Avery, chimed in on X this week.\n“I’m willing to bet a good chunk of change that a top 3 QB in Big 10 isn’t on this list right now: Drake Lindsey is so much better than anyone understands,” Avery wrote. “I truly and honestly believe he’s gonna be a Rd1 pick when it’s all said and done.”\nQB with “swagger”\nLindsey’s favorite quarterback is Joe Burrow of the Cincinnati Bengals. He felt that way in high school in Arkansas and again when watching Burrow in the series “Quarterback” on Netflix this summer.\n“That dude is just so awesome, like really cool,” Lindsey said. “Crazy knowledge of the game, but just his presence and what he brings to the team. I said this in high school when I was young, like a freshman: My game, I want to replicate Joe Burrow when he was taking off (at LSU). His swagger, his aura that he brings to the field.”\nFore football\nLindsey loves to play golf and feels like it helps him on the football field.\n“There is always ups and downs,” Lindsey said after practice Aug. 5. “It’s going to be challenging. That is a good reason why I love the game of golf. It’s because every (shot) is so independent.”\nLindsey was a standout golfer as a kid and plays often with Gophers standout safety Koi Perich.\n“I haven’t beat him yet this summer — very disappointed in that,” Perich said. “He also went to the World Amateur Golf Championship when he was young and has been playing his whole life. I just joined (in the last 18 months) … So, I’ve still got years to come. But it’s fun to chase a guy who is way better than you.”",
  "word_count": 1182,
  "scraped_at": "2026-02-14T13:22:44.909955"
}