{
  "article_id": "ccafbafc1068",
  "url": "https://www.dailymail.co.uk/news/article-15093265/Day-swore-Queen-Buckingham-Palace-didnt-bat-royal-eyelid.html",
  "title": "  Day I swore at the Queen at Buckingham Palace ... and she didnt bat a royal eyelid ! ",
  "date": "20250912T223000Z",
  "domain": "dailymail.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "'Day I swore at the Queen at Buckingham Palace... and she didn't bat a royal eyelid!'\n- Tourette’s sufferer John Davidson has faced a lifetime of bullying and shame. But as a deeply harrowing (and often darkly comic) memoir shows, he’s still swearing to do good\n- Click here to visit the Scotland home page for the latest news and sport\nWalking the tapestry-lined corridors of the Palace of Holyroodhouse for a royal investiture would be a daunting enough prospect for any award recipient.\nBut for John Davidson, an invitation to meet the monarch was already proving an excruciating test of nerves.\n‘Just being there was raising my stress levels,’ he admitted. ‘And for people like me, the more you worry, the more likely it is that you should be worried. It’s never a case of “Will I embarrass myself?” – it’s a case of when, and how badly.’\nHe had already caused a minor diplomatic incident as armed police checked his car’s undercarriage at the palace entrance.\nTry as he might, the words just exploded from his mouth: ‘A bomb! I’ve got a f***ing bomb!’ By the time he was in front of Her Majesty, all royal protocol had been jettisoned as his treasonous tongue betrayed him: ‘F*** the Queen!’ he bellowed at the top of his voice.\n‘It was absolutely awful,’ he recalled. ‘There was a military band playing and I thought some of the guys were going to choke on their instruments, they were trying so hard not to laugh.\n‘But the Queen never batted an eyelid. She was just so cool and calm. She was very lovely and asked about the documentaries and congratulated me on doing so well.\nShe’s probably had that slur thrown at her before, although maybe not in her own palace.’\nJohn Davidson, pictured in 2007, likens his condition to someone else controlling his mind\nHaving returned to his seat, Mr Davidson’s stress levels were so high that when another recipient was announced ‘for services to water-skiing’, he remembers shouting ‘F****** water-skiing!’ before excusing himself and slipping away from the ceremony to decompress.\nSuch is the extraordinary world of Tourette syndrome. Of course, the late Queen made allowances for Mr Davidson because he was there in 2019 to receive an MBE for his tireless work raising awareness about the condition.\nFor those with longer memories, his transformation from outcast to respected community leader is astonishing.\nHe has appeared in five TV documentaries – the most notable being a ground-breaking episode of the BBC’s QED series, entitled John’s Not Mad, which aired in 1989 when no one had heard of Tourette’s.\nThat programme showed a lost boy desperate for answers to ease his distress. And desperate, too, for acceptance.\nNow, that lost boy is John Davidson MBE, a published author, whose remarkable life story has been turned into a biopic due for release next month.\nIt is based on the 54-year-old’s newly-published memoir, I Swear – a searingly honest account of his incredible journey, by turns darkly comic and deeply harrowing.\n‘It is a massive turnaround, considering what I was going through in the 80s,’ he accepts.\n‘But not long after that first documentary was out, I realised I finally had a platform to try and change the way people with Tourette’s were viewed.\n‘I knew there had to be other people out there with the condition, although we were told it was very rare. And from then I just was determined to try and make life as bearable as possible.’\nJohn Davidson is a published author with an MBE\nIt is fair to say that, for many years, life was far from bearable for him.\nHis exquisitely painful book details how illness transformed him almost overnight from a popular, carefree child growing up in the Borders town of Galashiels, who loved playing football with his mates and riding his BMX.\nAged ten, after he had his tonsils and appendix removed in quick succession, everything changed.\nAfter that the tics began – then the bullying. ‘I’ll never know the trigger, but after that last operation I began to feel different,’ he recalls. ‘There is one theory that a streptococcus infection can trigger Tourette’s, but who knows?’\nIt was on a family holiday abroad after his operations when he noticed he had started blinking erratically.\nWhen his mother accidentally stood on a lizard, the words ‘What a stupid cow!’ leapt from his mouth. Back home, his condition worsened, with shouting, swearing and punching.\nHe likens Tourette’s to ‘someone else controlling my mind’ which as a child he found terrifying.\nHis aim in writing the book, was to explain ‘how [Tourette’s] makes me actually feel; the shame, the guilt, wanting to hide away all the time. I’ve done that for years and years, thinking if I stay away from people enough the Tourette’s might go away. It doesn’t, it’s never going to go away, and it’s about accepting your condition.\nJohn as a boy searching for answers on TV’s QED in 1989\n‘Understanding it is key. Because other people can’t understand it if you don’t understand it yourself, to be able to explain to people what it’s really like, and that’s what we need to get over.’\nCertainly, as a child he was misunderstood. He alienated friends by skipping down the high street and licking lampposts. When he began spitting food into the faces of his parents and siblings (he has a brother and two sisters) at the dinner table he was forced to eat with the family dog, Honey.\nSome teachers were downright cruel. One English teacher made him spend lessons in a ‘cramped, airless’ store cupboard as punishment. Classmates called him ‘blinker boy’ and would beat him up. He would take long detours to school and started playing truant to escape the persecution.\nBut family life was equally intolerable. ‘My dad was a joiner, a very quiet, self-contained man,’ Mr Davidson says. ‘He couldn’t cope with this alien child so he would go to the pub.’\nUnder the strain, his parents’ marriage disintegrated and his mother struggled on alone. He tells how he witnessed her weeping in anguish, at first behind closed doors and later in front of him.\nBy the time her son turned 12, his GP believed he was having a nervous breakdown and suggested psychiatric care. He was now barking at dogs and in a bad place mentally, but aware of the toll his behaviour was taking on his family. ‘You’d be better off killing me,’ he told his mother.\nIt was while Mr Davidson was in a psychiatric hospital, medicated with the powerful antipsychotic drug haloperidol, that a neurologist finally identified the problem: full-blown ‘Tourette’s plus’, the condition in its most severe form.\nAccording to Tourette Scotland, about one in 100 people are born with the condition, although there is a spectrum. Coprolalia (swearing) affects about 10 per cent of sufferers; echolalia (repeating others’ words) and palilalia (repeating one’s own words) are more common.\nUp to 85 per cent also have conditions including obsessive compulsive disorder (OCD), attention deficit hyperactivity disorder (ADHD) and autism. Mr Davidson has almost the full set – coprolalia, echolalia, OCD and ADHD.\nPhysical ticcing is common, involving exaggerated blinking or twitching, although in Mr Davidson’s case it includes grander gestures such as shoving loved ones towards traffic or putting hands over a driver’s eyes when they are at the wheel of a car.\n‘The tic urge often comes when I’m anxious, stressed or tired,’ he explains, ‘then it’s an exhausting mental battle telling myself, “John, that’s the absolute worst thing you could do in this moment,” and then trying not to do it.’\nUsually the urge wins. ‘For instance, I could see somebody walking down the street with a limp so I’ll tic, “Hopalong!” Sometimes it can land me in trouble if people take offence.’\nTalking to him nowadays, Mr Davidson is impressively calm as he articulates his tumultuous story – once his initial tic-triggering nerves subside.\nAt the start of our conversation, his arm shoots out and knocks his cup of tea over his chair. He chuckles as he swaps the chair for a dry one, saying: ‘Don’t worry, it’s just a tic. Just ignore the tics.’\nHe describes that first TV appearance as a 16-year-old as a watershed moment. One contributor was the renowned neurologist Oliver Sacks, who told him he must accept his condition or be haunted by it forever.\nIt has been a slog but he has been helped by the lifelong friendships he has made with people who could see beyond his extreme behaviour. People such as his mentor Tommy Trotter (played in the film by Peter Mullen).\nTrotter, who sadly died just before Mr Davidson received his MBE, gave him his first proper job at a community centre despite Davidson shouting at their first meeting: ‘F*** off, you fat ginger c***!’\nJust as vital was the day his school friend Murray invited him to his house for tea. Mr Davidson was reluctant to go because he’d heard that Murray’s mother Dottie had liver cancer and only six months to live.\nHis fears about saying the wrong thing proved accurate when he greeted her with ‘Ha ha! You’re gonnae f***ing die!’.\nBut Dottie just roared with laughter and they became firm friends. In fact, Mr Davidson moved in with Murray, Dottie and her husband Chris. Mercifully her cancer was a misdiagnosis and he now calls her his stepmother.\n‘Dottie helps a lot,’ he said. ‘She is my sounding board and will say when she thinks I should step back from all this film and book business for a couple of days.\n‘I worry about the likes of Lewis Capaldi, who’s come out with Tourette’s. I have concerns that he’s going to burn out as his itinerary is absolutely chock-a-block. He doesn’t get time to just go away and zone out from the world, and that’s very important for people with Tourette’s.\n‘I need my space. I live on my own with my black lab Suki and that’s my sanctuary.’\nMr Davidson has had to accept, too, the things in life he cannot do. As an adult it is having a girlfriend: ‘Who wants to stay with someone who calls out another woman’s name when they’re having sex?’\nAnd he gave up sitting in the front seats of cars ‘after grabbing the steering wheel and guiding the car off the motorway at 70 miles an hour’.\nEven going to pubs was stressful as he was targeted by overzealous bouncers at the first sign of erratic behaviour.\n‘My friends would meet women and girls then, but I missed out as every time I tried to be in a pub I’d either get asked to leave or there would be a fight breaking out, so I just gave it up as a bad joke.’\nOn one occasion, he was charged with assault after he threw an involuntary punch at a group of drinkers he thought were laughing at him, although he was later acquitted at trial.\n‘I did feel a bit of paranoia about how people viewed me. When you have Tourette’s, there’s always that feeling of, “I’m not the same as these people”. Our brains are wired differently.’\nHis life now, though, is light years from what it was. He gets on well with his family (his parents both remarried) and after becoming a youth worker he was eventually recognised as the leading national campaigner for awareness of Tourette syndrome.\nHe has bumped into former teachers who praise him for what he has achieved. ‘At the end they’ll say, “I hope I wasn’t one of those teachers that were bad to you…”. They obviously feel guilt but for me it’s sort of in the past. I’m moving forward and I don’t blame anybody for what happened.’\nThe old Galashiels Academy building is due for demolition and Mr Davidson plans to watch: ‘It’s going to give me some kind of closure on the bad experiences I had in that building. I can leave it and get it out of my mind.’\nHe has, he says, only eyes for the future. That includes the Glasgow premiere of the biopic, also called I Swear, on Thursday.\nBut technology could soon offer hope to Tourette’s sufferers after researchers at the University of Nottingham developed a wristband device which acts on the median nerve, sending electrical impulses to the brain to suppress the urge to tic.\nMr Davidson has tested a prototype of the Neupulse, which could be available next year.\n‘I’d never felt calm like it for a long, long time and my tics were massively reduced,’ he said. ‘It’s very exciting.’\nFor now, though, he will continue to act as a mouthpiece for Tourette’s.\nOnce vilified for his profanities, he now swears to do good.",
  "word_count": 2141,
  "scraped_at": "2026-02-14T12:36:57.835585"
}