{
  "article_id": "ccb0b218b120",
  "url": "https://kyma.com/stacker-money/2025/05/01/richest-women-in-america-2/",
  "title": "Richest women in America",
  "date": "20250501T133000Z",
  "domain": "kyma.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Richest women in America\nChristian Liewig – Corbis/Getty Images\nRichest women in America\nThe overwhelming majority of those who make it onto “richest people” lists—in all 50 states or the world—are men. This fact is unsurprising, considering the history of discriminatory workplace practices and various barriers to women’s wealth, including barring women from having credit cards until the 1970s. Even in 2025, an income gap leaves women earning $0.83 on average for every $1 a man makes.\nMadam C.J. Walker, an early 20th-century purveyor of hair care and cosmetics for Black women, is widely considered the first woman self-made millionaire in the United States. But the glass ceiling still hasn’t been shattered more than a century later. In 2016, Gabriel Zucman, an economics professor at the University of California, Berkeley, told The New York Times that “the higher up you move in the income distribution, the lower the proportion of women … [which] shows that there is a fundamental form of inequality at the top related to gender.”\nThat inequality may finally end in the coming years, however, or at least shift in the right direction. According to an August 2024 Fortune report, women will soon control the majority of personal wealth, which is expected to reach $30 trillion within the next 10 years. And considering many wealthy women like Melinda French Gates spend their money on philanthropic and charitable causes, those trillions could go in unexpected directions.\nFor now, though, Stacker compiled a list of the richest women in America, using data from Forbes. These wealthy women are ranked by their net worth as of March 7, 2025. The women on the list have come upon their fortunes in various ways. Among them are heiresses like the Waltons or the Pritzkers, who inherited wealth created by their families’ businesses. Others, like Thai Lee, are self-made. Still, others built businesses with their husbands, like MacKenzie Scott of Amazon. Regardless of how these women came into their fortunes, their economic impact is undeniable.\nKeep reading to see how many names you recognize.\nPhillip Faraone // Getty Images for Caring Across Generations\n#50. Lynn Schusterman and family\n– Net worth: $4.5 billion\n– Worldwide rank: 801\n– Source of wealth: Oil & gas, investments\nSince Lynn Schusterman’s husband died in 2000, she has retained lucrative oil and gas assets via Samson Energy, part of her late husband’s Samson Resources company. Though Lynn’s daughter, Stacy (pictured here), led the company to unload much of Samson Resources in 2011, the sale brought in more than $7 billion. Today, Lynn helps oversee the Charles and Lynn Schusterman Family Philanthropies organization; she and Stacy received the Carnegie Medal of Philanthropy in 2022.\nPatrick McMullan // Getty Images\n#49. Gwendolyn Sontheim Meyer\n– Net worth: $4.6 billion\n– Worldwide rank: 789\n– Source of wealth: Cargill\nAn heir to the Cargill food corporation, Gwendolyn Sontheim Meyer is the great-granddaughter of W.W. Cargill, who founded the company in 1865. Sontheim Meyer lives in Rancho Santa Fe, California, and spends much of her time training show-jumping horses.\nNicholas J Klein // Shutterstock\n#48. Winifred J. Marquart\n– Net worth: $4.7 billion\n– Worldwide rank: 767\n– Source of wealth: Cleaning products\nWinifred J. Marquart is one of the heirs to S.C. Johnson & Son and the president of the Johnson Family Foundation. Marquart lives in Virginia Beach, Virginia, making her the only member of the extended Johnson family to move out of their Racine, Wisconsin, hometown. In 2017, she joined her siblings in pledging $150 million to Cornell to fund the S.C. Johnson College of Business.\nDave Reginek – Pool // Getty Images\n#45. Marian Ilitch (tie)\n– Net worth: $4.8 billion\n– Worldwide rank: 751\n– Source of wealth: Little Caesars Pizza\nIn 1959, Marian Ilitch and her husband, Mike, co-founded Little Caesars Pizza, which now brings in over $5 billion in yearly sales. Though Mike passed away in 2017, Marian still owns Little Caesars, the Detroit Red Wings professional hockey team, and the MotorCity Casino Hotel. In addition to her food, sports, and entertainment holdings, Marian is a renowned philanthropist, having donated more than $220 million to a variety of charitable causes over the decades.\nClint Spaulding // Patrick McMullan via Getty Images\n#45. Martha Ingram and family (tie)\n– Net worth: $4.8 billion\n– Worldwide rank: 751\n– Source of wealth: Book distribution, transportation\nMartha Ingram inherited Ingram Industries upon her husband’s passing in 1995 and served as the company’s CEO over the next decade. She donated much of her earnings to charity, contributing to Vanderbilt University and the construction of a new symphony hall in Nashville, Tennessee. Though Ingram retired from Ingram Industries in 2008, her tenure as CEO pushed the company to new heights and led to the development of the independent public entity Ingram Micro.\nJHVEPhoto // Shutterstock\n#45. Helen Johnson-Leipold (tie)\n– Net worth: $4.8 billion\n– Worldwide rank: 751\n– Source of wealth: Cleaning products\nAn heir to the privately held S.C. Johnson & Son, whose products include Glade, Raid, and Windex, Helen Johnson-Leipold is a graduate of Cornell University. Johnson-Leipold is the CEO and chairman of Johnson Outdoors, which is publicly traded, and the chairman of the Johnson Financial Group. In 2017, she and her siblings pledged $150 million to her alma mater to fund the Cornell SC Johnson College of Business.\nEamonn M. McCormack // Getty Images\n#44. Jean (Gigi) Pritzker\n– Net worth: $4.9 billion\n– Worldwide rank: 734\n– Source of wealth: Hotels, investments\nJean “Gigi” Pritzker is a movie producer in Los Angeles and an heir to the Hyatt Hotels fortune. She founded the entertainment company Madison Wells Media, named after the Chicago streets where her great-grandfather once sold newspapers. Her company has produced films such as “Ender’s Game” and “Hell or High Water.” Pritzker is also behind the Pritzker Pucker Family Foundation, which donates to nonprofits focused on the arts, education, and building community.\nPAUL J. RICHARDS // Getty Images\n#42. Margot Birmingham Perot (tie)\n– Net worth: $5.3 billion\n– Worldwide rank: 673\n– Source of wealth: Computer services, real estate\nAfter meeting her late husband, H. Ross Perot Sr., on a blind date in 1962, Margot Birmingham Perot gave him a $1,000 check to start Electronic Data Systems. When the entrepreneur and politician sold the company to General Motors in 1984, he netted $1.5 billion. Birmingham Perot has donated large sums of money to organizations such as the Perot Museum of Nature and Science and the Global Fund for Children; she also provides essential funding for the Margot Perot Center for Women and Infants in Dallas.\nMichael Tran/FilmMagic // Getty Images\n#42. Dagmar Dolby and family (tie)\n– Net worth: $5.3 billion\n– Worldwide rank: 673\n– Source of wealth: Dolby Laboratories\nThe audio technology firm Dolby Laboratories pioneered the modern surround sound technology used in most of today’s media, from movies to video games. The company was founded by Ray Dolby, but when he died in 2013, his widow, Dagmar Dolby, inherited about 36% of the brand. Since then, Dolby has donated nearly $200 million, giving to the University of Cambridge, the University of California in San Francisco, and the Academy Foundation. She’s also a vocal advocate for reproductive rights—she and her granddaughter, Stella, spoke at the 30th annual Reproductive Freedom for All Luncheon in March 2025.\nThe Washington Post // Getty Images\n#41. Annette Lerner and family\n– Net worth: $5.7 billion\n– Worldwide rank: 620\n– Source of wealth: Real estate\nAnnette Lerner enters the list after inheriting some of her late husband Ted Lerner’s estate. He created a real estate empire in the Washington D.C. area, and it all started with Annette loaning him $250 in 1962. The Lerner family has also owned the Washington Nationals MLB team since 2006; the Lerners’ son, Mark, currently serves as the managing principal owner of the team.\nPaul Morigi // Getty Images\n#40. Elizabeth Uihlein\n– Net worth: $6 billion\n– Worldwide rank: 581\n– Source of wealth: Packaging materials\nEntrepreneur Elizabeth Uihlein currently serves as president of the packaging company Uline. According to Forbes, the North American shipping giant pulls in an estimated $8 billion in annual revenue. Uihlein and her husband have famously contributed millions of dollars to conservative political candidates over the years, including Donald Trump.\nWesley Hitt // Getty Images\n#39. Janice McNair and family\n– Net worth: $6.2 billion\n– Worldwide rank: 561\n– Source of wealth: Energy, sports\nJanice McNair met her husband, Robert McNair, at South Carolina’s Columbia College in the late 1950s. The McNairs made their first fortune in 1999 by selling their company, Cogen Technologies, to Enron for $1.5 billion. They then bought an 80% stake in the NFL’s Houston Texans, which Janice inherited upon Robert’s death in 2018. In March 2025, she received the Houston Sports Awards Lifetime Achievement honor for her work with the NFL team.\nStefanie Keenan // Getty Images\n#38. Lynda Resnick\n– Net worth: $6.3 billion\n– Worldwide rank: 551\n– Source of wealth: Agriculture\nLynda Resnick is the vice chairman and co-owner of the Wonderful Company, the privately held, California-based enterprise behind Wonderful Pistachios, POM Wonderful, Fiji Water, Teleflora, and other brands. Resnick founded the company with her husband, Stewart, whom she met when he hired her ad agency to run marketing for an alarm business. The Resnicks have pledged to donate more than $2 billion of their combined $10.6 billion fortune to charity; however, the couple made headlines in early 2025 after the Los Angeles fires led to scrutiny of their water ownership in California.\nT. Schneider // Shutterstock\n#36. Blair Parry-Okeden (tie)\n– Net worth: $6.7 billion\n– Worldwide rank: 507\n– Source of wealth: Media, automotive\nBarbara Cox Anthony, youngest daughter of James M. Cox and aunt to Margaretta Taylor and Katharine Rayner, had two children: son James and daughter Blair Parry-Okeden. Parry-Okeden inherited a 25% stake in her grandfather’s company, Cox Enterprises, upon her mother’s passing in 2007. She has never held an active role in the company, instead choosing to spend her life in Australia writing children’s books.\nCliff Welch/Icon Sportswire via Getty Images\n#36. Denise York and family (tie)\n– Net worth: $6.7 billion\n– Worldwide rank: 507\n– Source of wealth: San Francisco 49ers\nIn 1977, Denise York’s father, construction magnate Edward DeBartolo Sr., bought the San Francisco 49ers for $13 million. Today, York and her family own more than 90% of the NFL team, now worth $6 billion—the fifth most valuable team in the league. York was also president of the NHL’s Pittsburgh Penguins when the team won its first Stanley Cup in 1991.\nJerod Harris // Getty Images\n#34. Edythe Broad and family (tie)\n– Net worth: $7 billion\n– Worldwide rank: 474\n– Source of wealth: Homebuilding, insurance\nEdythe Broad was married to billionaire businessman Eli Broad, the founder of SunAmerica Inc. and KB Home. The two were married for nearly 70 years until Eli’s death in 2021. A renowned art collector and philanthropist, Edythe has given away $4 billion of her fortune to causes like medical research, public education, and public arts funding.\nRay Park Stock Photo // Shutterstock\n#34. Thai Lee (tie)\n– Net worth: $7 billion\n– Worldwide rank: 474\n– Source of wealth: IT provider\nBorn in Bangkok and raised in South Korea, Thai Lee moved to the U.S. in her teens to attend high school. Equipped with an MBA from Harvard University, Lee is now the CEO of SHI International, an information technology provider with more than 17,000 customers. SHI is the largest minority- and woman-owned business enterprise in the U.S., with more than 7,000 employees worldwide.\nSean Gardner // Getty Images\n#33. Gayle Benson\n– Net worth: $7.1 billion\n– Worldwide rank: 464\n– Source of wealth: New Orleans Saints\nFormerly an interior designer, Gayle Benson married Tom Benson in 2004. When he died in 2018, she became the sole owner of the NFL’s New Orleans Saints and the NBA’s New Orleans Pelicans. The transfer of ownership wasn’t uncontested; Tom’s daughter and several grandchildren fought against Gayle, his third wife, for control over the teams.\nStephen Lovkin // Getty Images for HBO\n#32. Karen Pritzker\n– Net worth: $7.2 billion\n– Worldwide rank: 453\n– Source of wealth: Hotels, investments\nAnother of the 13 billionaire heirs to the Hyatt Hotels fortune, Karen Pritzker used her inheritance to make some savvy investments, growing her fortune beyond that of her siblings and cousins. In 2002, Pritzker founded the Seedlings Foundation, which ranks among the top-giving organizations in Connecticut and focuses on the physical and mental health of children. She also frequently donates to organizations such as Yale University, Teach for America, and the Michael J. Fox Foundation for Parkinson’s Research, among others. In July 2024, the Pritzker Vlock Capital Management made a substantial contribution to Maxim Biomedical.\nKen Wolter // Shutterstock\n#30. Pauline MacMillan Keinath (tie)\n– Net worth: $7.3 billion\n– Worldwide rank: 443\n– Source of wealth: Cargill\nWhile she is believed to be the largest single shareholder of the Cargill food and agriculture company with a 13% stake, Pauline MacMillan Keinath lives a fairly private life. The family company made $160 billion in total sales in 2024.\nTommaso Boddi // Getty Images\n#30. Lynsi Snyder (tie)\n– Net worth: $7.3 billion\n– Worldwide rank: 443\n– Source of wealth: In-N-Out Burger\nIn 1999, Lynsi Snyder became the sole heir to the In-N-Out Burger chain at 17 after both her uncle and father died. In 2010, she became president of the company and has since worked to expand the business to have more than 400 locations and counting in eight states as of 2024.\nSteve Ferdman // Getty Images\n#29. Judy Faulkner\n– Net worth: $7.7 billion\n– Worldwide rank: 411\n– Source of wealth: Healthcare software\nIn a Wisconsin basement in 1979, computer programmer Judy Faulkner founded Epic Systems with the support of two part-time assistants. Epic Systems has grown to be the leading medical record software in America, and Faulkner is still its CEO. In 2015, Faulkner signed the Giving Pledge, agreeing to give 99% of her family’s wealth to a nonprofit foundation.\nRandy Shropshire/Getty Images for The Music Center\n#28. Tamara Gustavson\n– Net worth: $8.5 billion\n– Worldwide rank: 353\n– Source of wealth: Self-storage\nTamara Gustavson is the largest individual shareholder of Public Storage, a self-storage company founded by her father in 1972. She sits on the boards of that company and another of her father’s enterprises, American Homes 4 Rent. A racehorse aficionado, Gustavson also frequently donates to the HollyRod Foundation, which researches autism and Parkinson’s disease.\nSettawat Udom // Shutterstock\n#27. Elisabeth DeLuca and family\n– Net worth: $8.6 billion\n– Worldwide rank: 347\n– Source of wealth: Subway\nWhen her husband and Subway co-founder Fred DeLuca died in 2015, Elisabeth DeLuca inherited his half of the restaurant chain. In April 2024, Elisabeth and the Buck family—the descendants of Fred’s business partner, Peter Buck—sold Subway to private equity firm Roark Capital for more than $9 billion. DeLuca is also a noted philanthropist, serving as a director of the Frederick A. DeLuca Foundation and a foundation of her own.\nBennet Raglin/Stringer // Getty Images\n#26. Ronda Stryker (tie)\n– Net worth: $8.6 billion\n– Worldwide rank: 347\n– Source of wealth: Medical equipment\nIn 2013, Ronda Stryker, a former special education teacher, earned a lifetime achievement award from the YWCA, acknowledging her as a positive role model. Stryker inherited the Stryker Corporation from her parents, who had inherited it from her grandfather. She serves as a director of the medical equipment company and is the only one of her three siblings to take on an active role in the business. She made headlines in 2018 when she donated $30 million to Spelman College, the largest gift from a living donor in the school’s history.\nBrett Coomer/Houston Chronicle via Getty Images\n#24. Dannine Avara (tie)\n– Net worth: $9.2 billion\n– Worldwide rank: 311\n– Source of wealth: Pipelines\nDannine Avara’s father, the late Dan Duncan, was once the richest man in Houston. When he died in 2010, his company, Enterprise Products Partners, passed to his four children, including Avara. The company her father began in 1968 now owns nearly 50,000 miles of oil, natural gas, and petrochemical pipelines across the country.\nJHVEPhoto // Shutterstock\n#24. Milane Frantz (tie)\n– Net worth: $9.2 billion\n– Worldwide rank: 311\n– Source of wealth: Pipelines\nOne of Dan Duncan’s daughters, Milane Frantz, also inherited a portion of Enterprise Products Partners after her father died in 2010. While she’s not involved in the company’s operations, Frantz serves as the director of the Duncan Family Foundation and sits on the board of Houston’s Hermann Park Conservancy.\nBob Levey/Getty Images for U.S. Fund for UNICEF\n#23. Randa Duncan Williams\n– Net worth: $9.3 billion\n– Worldwide rank: 307\n– Source of wealth: Pipelines\nRanda Duncan Williams is Dan Duncan’s oldest daughter and the only one of his children to be involved in the operations of the family-owned company, Enterprise Products Partners. Duncan Williams joined the business in 1994 after graduating from the University of Houston with a law degree. In 2001, she was promoted to president and CEO of the company. Today, she serves as chairman of the board.\nDarryl Brooks // Shutterstock\n#20. Marijke Mars (tie)\n– Net worth: $10.7 billion\n– Worldwide rank: 236\n– Source of wealth: Candy, pet food\nIn 1911, Marijke Mars’ great-grandfather Frank Mars founded Mars, Incorporated—what was then simply a candy company. Today, Mars, Inc. is America’s largest candymaker and has expanded into pet food. Marijke sits on the board of Mars, Inc. and helps make decisions about the future of the business.\nRoman Samohkin // Shutterstock\n#20. Pamela Mars (tie)\n– Net worth: $10.7 billion\n– Worldwide rank: 236\n– Source of wealth: Candy, pet food\nAnother of the four Mars sisters, Pamela Mars inherited 8% of the company when her father, Forrest Mars Jr., died in 2016. Pamela has been actively involved in the family business since she took her first job in 1986 and currently serves as the family ambassador to the Mars Petcare division.\nJonathan Weiss // Shutterstock\n#20. Valerie Mars (tie)\n– Net worth: $10.7 billion\n– Worldwide rank: 236\n– Source of wealth: Candy, pet food\nValerie Mars began working with the family’s candy business in 1992. She’s been actively involved since then, currently serving as the company’s vice president of corporate development. Mars has also sat on the board of Fiat Chrysler Automobiles.\nLukassek // Shutterstock\n#20. Victoria Mars (tie)\n– Net worth: $10.7 billion\n– Worldwide rank: 236\n– Source of wealth: Candy, pet food\nThe eldest of the Mars sisters, Victoria Mars began working for the family candy company in 1978 as an assistant brand manager for Milky Way. She officially stepped down from Mars, Inc. after resigning from her role as chairman in 2017. Mars’ four children stand to inherit her 8% stake in the company.\nSOPA Images/LightRocket //Getty Images\n#20. Elizabeth Johnson\n– Net worth: $11.1 billion\n– Worldwide rank: 225\n– Source of wealth: Fidelity\nElizabeth Johnson is the granddaughter of Fidelity Investments founder Edward Johnson II and the sister of Abigail Johnson, the company’s current CEO and chairman. She also founded Louisburg Farm, a Wellington, Florida, stable for show-jumping horses, in 2013. She is also a member of the resource council of the Boston Society of Arts and Crafts.\nThe Image Party // Getty Images\n#20. Trudy Cathy White\n– Net worth: $11.4 billion\n– Worldwide rank: 213\n– Source of wealth: Chick-fil-A\nThe only daughter of Chick-fil-A founder Truett Cathy, Trudy Cathy White is an ambassador for the fried chicken company. While her two brothers took over the family business after their father’s death and now serve as CEO and executive vice president, White elected to serve as a Christian missionary and founded two religious nonprofits, Lifeshape and the Impact 360 Institute.\nJohn Leyba/Denver Post // Getty Images\n#16. Ann Walton Kroenke\n– Net worth: $12.6 billion\n– Worldwide rank: 189\n– Source of wealth: Walmart\nAnn Walton Kroenke, a registered nurse, is not at all involved in operating Walmart, her family’s business. While she did inherit billions of dollars in shares upon the death of her father, Bud Walton, she and her husband chose to use their combined billions to purchase numerous sports teams: the Los Angeles Rams, the Denver Nuggets, the Colorado Avalanche, the Colorado Rapids, and the Arsenal Football Club.\nGeorge Sheldon // Shutterstock\n#15. Judy Love and family\n– Net worth: $13.1 billion\n– Worldwide rank: 178\n– Source of wealth: Gas stations\nRoad trippers will recognize Judy Love’s last name from the popular brand of gas stations she founded with her late husband, Tom, who died in March 2023 at 85. Love’s Travel Stops and Country Stores began as a single gas station lease in Watonga, Oklahoma, in 1964, and now spans more than 600 locations across 42 states.\nSteve Eichner/WWD/Penske Media via Getty Images\n#14. Nancy Walton Laurie\n– Net worth: $14.7 billion\n– Worldwide rank: 151\n– Source of wealth: Walmart\nOne of several Walmart heirs on this list, Nancy Walton Laurie inherited enough company stock from her father, Bud Walton, to make her a billionaire. Walton Laurie and her husband, Bill Laurie, owned Missouri’s Providence Bank until they sold it in 2021. Besides her business interests, in 1998, she founded the Columbia Performing Arts Centre in Columbia, Missouri, and continues to be deeply invested in the center’s success.\nSteve Jennings // Getty Images\n#13. Laurene Powell Jobs\n– Net worth: $15.6 billion\n– Worldwide rank: 136\n– Source of wealth: Apple, Disney\nLaurene Powell Jobs met her late husband, Apple founder Steve Jobs, after he gave a guest lecture at Stanford University, where she was an MBA student. When he died in 2011, Laurene inherited billions of dollars in Apple and Disney stocks.\nAlberto E. Rodriguez // Getty Images\n#12. Christy Walton\n– Net worth: $18.5 billion\n– Worldwide rank: 109\n– Source of wealth: Walmart\nWhen Christy Walton’s husband John died in 2005, she inherited one-sixth of his Walmart fortune. In 2010, she established the venture capital firm Cuna del Mar, which fights for sustainable seafood supply chains by backing brands like Earth Ocean Farms and Sol Azul Maricultivos. In March 2025, Walton placed a full-page ad in The New York Times, critiquing President Donald Trump’s administration.\nChip Somodevilla // Getty Images\n#11. Diane Hendricks\n– Net worth: $21.9 billion\n– Worldwide rank: 92\n– Source of wealth: Building supplies\nAs a child, Diane Hendricks spent her days on a dairy farm. Once married, she and her husband, Ken Hendricks, founded ABC Supply, one of the largest wholesale distributors of roofing, siding, and windows in the country. Hendricks has run the company solo since her husband died in 2007, donating millions of dollars to nonprofits in her home state of Wisconsin every year.\nT. Schneider // Shutterstock\n#10. Lyndal Stephens Greth and family\n– Net worth: $25.8 billion\n– Worldwide rank: 77\n– Source of wealth: Oil & gas\nLyndal Stephens Greth’s father, Autry Stephens, founded the Texas-based oil firm Endeavor Energy Resources in 1979. Before he passed away in 2024, Autry negotiated the $26 billion sale of Endeavor Energy Resources to Diamondback Energy. As a result, Greth now owns more than a third of Diamondback’s shares.\nJORG CARSTENSEN // Getty Images\n#9. MacKenzie Scott\n– Net worth: $28.2 billion\n– Worldwide rank: 68\n– Source of wealth: Amazon\nThe ex-wife of Amazon founder Jeff Bezos, MacKenzie Scott signed the Giving Pledge in 2019, promising to donate most of her wealth to philanthropic causes. Scott was awarded a 4% share of the online retailer Amazon upon the finalization of her divorce from Bezos in 2019. As of 2025, Scott has donated $19 billion of that money in the years since the split.\n360b // Shutterstock\n#8. Elaine Marshall and family\n– Net worth: $28.3 billion\n– Worldwide rank: 67\n– Source of wealth: Koch Inc.\nThe daughter-in-law of businessman J. Howard Marshall II, Elaine Marshall and her two sons inherited a sizable stake in the corporation Koch, Inc. after Elaine’s husband died in 2006. She and her sons still retain an estimated 16% of Koch, Inc. today. Elaine has also served as North Carolina’s Secretary of State since 1997, winning her reelection bid in November 2024.\nChristian Liewig – Corbis/Getty Images\n#7. Melinda French Gates\n– Net worth: $30.4 billion\n– Worldwide rank: 58\n– Source of wealth: Microsoft, investments\nA former high-level employee at Microsoft Corporation, Melinda French Gates founded the Bill and Melinda Gates Foundation in 2000 with her then-husband, Bill Gates. In 2021, Melinda French Gates became a billionaire in her own right after Bill Gates transferred $2.4 billion worth of stock to her amid their divorce proceedings. Though Melinda resigned from the Bill and Melinda Gates Foundation in 2024, she devotes much of her time to philanthropy, focusing on girls’ and women’s issues. She also invests in woman-owned businesses through Pivotal Ventures, her venture capital firm.\nEugene Gologursky // Getty Images\n#6. Marilyn Simons and family\n– Net worth: $31 billion\n– Worldwide rank: 57\n– Source of wealth: Hedge funds\nMarilyn Simons was married to hedge fund manager and investor Jim Simons until his death in 2024, at which point she inherited his approximately $31 billion net worth. She and Jim had long been active philanthropists, gifting hundreds of millions of dollars to educational initiatives via the Simons Foundation. Launched in 1994 and still chaired by Marilyn, this nonprofit is worth $4.5 billion as of 2025.\nDenise Truscello // Getty Images\n#5. Miriam Adelson and family\n– Net worth: $32.1 billion\n– Worldwide rank: 56\n– Source of wealth: Casinos\nAn Israeli American physician who focuses on addiction, Miriam Adelson is the widow of Sheldon Adelson, the founder of the Las Vegas Sands casino company. Upon Sheldon Adelson’s death in 2021, she became the primary owner of the company. Adelson is a dedicated philanthropist who focuses much of her attention on the Dr. Miriam & Sheldon G. Adelson Clinic for Drug Abuse Treatment & Research, which helps treat people with opioid use disorder. She’s also a prominent backer of President Donald Trump and donated more than $90 million to his 2024 campaign.\nDrew Angerer // Getty Images\n#4. Abigail Johnson\n– Net worth: $32.7 billion\n– Worldwide rank: 55\n– Source of wealth: Fidelity\nAbigail Johnson has served as the CEO of Fidelity Investments since 2014. After spending summers working at Fidelity during college, Johnson accepted a role as a full-time analyst in 1988. In 2016, Johnson became chairman and CEO and currently holds an estimated 28.5% stake in the company. The Johnson family has frequently contributed to Boston-area nonprofits, with donations going to Harvard, Historic New England, and the Institute of Contemporary Art.\nPool // Getty Images\n#3. Jacqueline Mars\n– Net worth: $42.6 billion\n– Worldwide rank: 33\n– Source of wealth: Candy, pet food\nJacqueline Mars is the great-aunt of the four Mars sisters highlighted earlier in this list. She owns an estimated one-third of her grandfather’s candy company and worked for it for nearly 20 years, serving on the board until 2016.\nRabbani and Solimene Photography // Getty Images\n#2. Julia Koch and family\n– Net worth: $74.2 billion\n– Worldwide rank: 21\n– Source of wealth: Koch, Inc.\nJulia Koch inherited a 42% stake in Koch Industries when her husband, David Koch, died in 2019. The duo met on a blind date in 1991 and married in 1996. The former fashion assistant and her late husband have donated $10 million to Mount Sinai Medical Center and Stanford University’s Lucile Packard Children’s Hospital, respectively. Her recent business dealings include purchasing a 15% stake in BSE Global and selling a Manhattan apartment for $45 million in February 2025.\nRick T. Wilking // Getty Images\n#1. Alice Walton\n– Net worth: $101 billion\n– Worldwide rank: 15\n– Source of wealth: Walmart\nThe only daughter of Walmart founder Sam Walton, Alice Walton inherited a huge portion of the company upon her father’s death in 1992. A member of the richest nonroyal family in the world, Walton has spent very little time working for the family business, instead focusing on curating artwork. In 2011, she opened her own art museum in Arkansas—the Crystal Bridges Museum of American Art—which features works from greats like Warhol, Rockwell, and Rothko.\nStory editing by Cu Fleshman. Copy editing by Paris Close.",
  "word_count": 4762,
  "scraped_at": "2026-02-14T13:01:45.260016"
}