{
  "article_id": "cce23e233860",
  "url": "https://www.dailyadvertiser.com.au/story/9135560/country-championships-and-west-wyalong-knockout-to-collide-in-2026/",
  "title": "Country Championships and West Wyalong Knockout to collide in 2026 | The Daily Advertiser",
  "date": "20251216T200000Z",
  "domain": "dailyadvertiser.com.au",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Representative rugby league was moved to the pre-season to avoid taking players away from their clubs but it still won't be the case in 2026.\nSubscribe now for unlimited access.\nor signup to continue reading\nInstead the start of the Country Championships will coincide with the West Wyalong Knockout.\nCourtesy of a tight loss to Western in round one of this year's Country Championships, Riverina will kick start its next campaign with a clash against Monaro at Laurie Daley Oval on Sunday, March 1.\nThe two regions have traditionally supplied the majority of the teams entered at West Wyalong, which has been held on the last weekend in February for most of its 55-year history.\nOnly eight clubs have entered the popular pre-season event so far compared to the full allotment of 16 that had booked their place by Christmas last year.\nWest Wyalong president Matt Goodwin wasn't aware of the clash.\nHowever he doesn't expect the representative game will have a big impact on the popular event on February 27 and 28.\n\"I don't think so,\" Goodwin said.\n\"We've got eight games from 16 teams on Friday and eight teams playing the next day.\n\"If there's a couple people out of a team that plays representative football whether it be from West Wyalong, Wagga or Young it won't be too detrimental to the sides that come.\n\"I know when I played for Riverina the main support was the families.\"\nThe winner of the game between Riverina and Monaro will tackle on reigning champions Newcastle, who have won the past three finals, at Queanbeyan's Seiffert Oval on March 7.\nThere is then a weekend allocated for wet weather before the semi-finals on March 21 or 22.\nThe final will be played at a venue yet to be determined on March 28.\nA NSW Rugby League spokesperson said many factors are considered when determining draws for its competitions every season.\n\"The Men's Country Championships is highly regarded as it provides players from around NSW with an opportunity to proudly represent their region,\" the spokesperson said.\n\"It has the support of the NSWRL, as well as Group and Divisional committees from around NSW.\n\"It has been played in the pre-season period for a number of years now to avoid players being removed from teams in the season proper.\n\"The process is challenging and it is unfortunate where clashes occur with other pre-season competitions that are historically important to local communities.\"\nIt's the second time in three years Junee will host a round of representative rugby league on the same weekend as the West Wyalong Knockout.\nRiverina played Western across four grades in 2024, but the men's competition had not yet started.\nNext year five games will be played against Monaro.\nIt will be the fifth round of the Andrew Johns Cup (under 16s boys) and Laurie Daley Cup (under 18s boys) and fourth of the Regional Lisa Fiaola Cup (under 17s girls).\nEach of the three competitions will start with a Magic Round on January 31 with all 13 games to be played across three venues in Singleton and Queanbeyan.\nRiverina will travel to tackle Northern Tigers in Singleton.\nThe women's campaign starts with a clash against Western, alongside the three underage games at Parkes on February 21.\nThe West Wyalong Knockout clash follows on from the NRLW Magic Round in Wagga being played on the same weekend as the Riverina Schoolboys Carnival in 2026.\nJunee's iconic event is forging ahead and will be held on August 1, but a decision on the leaguetag carnival that follows it the following day is yet to be decided.",
  "word_count": 604,
  "scraped_at": "2026-02-14T12:50:33.541401"
}