{
  "article_id": "ccea60023404",
  "url": "https://www.macleayargus.com.au/story/8884271/matildas-newcastle-return-kerr-potential-comeback/?cs=305",
  "title": "Matilda Newcastle return : Kerr potential comeback | The Macleay Argus",
  "date": "20250205T000000Z",
  "domain": "macleayargus.com.au",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "The Matildas are returning to Newcastle - and superstar Sam Kerr could be back to lead the attack.\nSubscribe now for unlimited access.\nor signup to continue reading\nFootball Australian confirmed on Tuesday that the Matildas will take on Korea Republic at McDonald Jones Stadium on April 7.\nThe clash against the Asian Cup silver medalist is part of a two-game series that includes a battle in Sydney on April 4.\nKerr has been sidelined since tearing the ACL in her knee last and January training with English club side Chelsea.\nThe 31-year-old has resumed running and Matildas coach Tom Sermani has hinted at a possible return during the March-April series.\nThe striker's availability may hinge on a London court case where the Matildas captain is defending a charge of racially aggravated intentional harassment of a police officer after a drunken night out in London.\nSermani will take a \"wait and see approach\" regarding Kerr.\n\"From a football perspective, my main aim as head coach is to have her fit and healthy as quick as possible,\" he said.\nThe Matildas battle with Korea will be the first time they have played in Newcastle since a 3-0 shutdown of Jamaica In the Cup of Nations on February 22, 2023.\nWhile there is uncertainty over Kerr, the match will be a rare opportunity for home grown duo Emily Van Egmond and Clare Wheeler and Jets defender Tash Prior to play in front of family and friends.\nThe trio are part of the Australian squad to compete at the SheBelieves Cup in the United States later this month.\nAustralia will take on Japan (February 20), the hosts (February 23) and Colombia (February 26).\nVan Egmond, who signed a two-and-a-half-year deal with English Women's Championship club Birmingham City last week, and Wheeler are key figures in the Matildas set-up.\nPrior made a stunning first impression for Australia, scoring two goals in three appearances during internationals with Brazil and Chinese Taipei on home soil in December.",
  "word_count": 331,
  "scraped_at": "2026-02-14T12:58:07.317186"
}