{
  "article_id": "ccf5963bfcb0",
  "url": "https://www.pilotonline.com/2024/05/23/former-florida-atlantic-cornerback-commits-to-old-dominion/",
  "title": "Former Florida Atlantic cornerback commits to Old Dominion",
  "date": "20240524T040000Z",
  "domain": "pilotonline.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "LOCAL BASEBALL\nThe Peninsula Pilots drew a big crowd but dropped their Coastal Plain League season opener Thursday night, falling 7-6 to the Martinsville Mustangs before 3,150 at War Memorial Stadium in Hampton.\nKody Abrisz, a Menchville High graduate who has played for Patrick & Henry Community College, belted two home runs andwas 3 for 5 with five RBIs and three runs for Martinsville, which erased a 4-0 deficit. Abrisz scored the eventual winning run on Tanner Thomas’ groundout in the ninth.\nFor the Pilots, Haiden Walters of Felician was 2 for 4 with three RBIs, Henry Garcia was 3 for 4 with two doubles and two RBIs, and Cole Stanford of Lenoir-Rhyne was 2 for 2 and scored twice. Cam Pittman of Radford also scored twice.\nJustin Ritz gained the victory, pitching 2 2/3 hitless innings.\nCOLLEGE FOOTBALL\nFlorida Atlantic CB to transfer to ODU\nFormer Florida Atlantic cornerback Justin McKithen announced his commitment to Old Dominion via social media.\nThe 5-foot-10, 157-pounder from Savannah, Georgia, came to FAU in January 2020 and played in each of the past four seasons, albeit sparingly. He had 35 career tackles for the Owls.\nCOLLEGE MEN’S BASKETBALL\nWestern Kentucky signs ex-ODU center\nWestern Kentucky announced the signing of Old Dominion transfer Leeroy Odiahi. The 6-foot-11 junior center appeared in 24 games for the Monarchs, averaging 1.2 points, 2.6 rebounds and 10.8 minutes.\nTCU landed a commitment from Vasean Allette, a former Old Dominion guard who led the Monarchs in points, rebounds and steals last season before being dismissed for disciplinary reasons. Allette hails from Scarborough, Ontario, the same hometown as current Horned Frogs player Emanuel Miller.\nCOLLEGE TRACK AND FIELD\nNSU athletes advance at East Preliminary\nTwo Norfolk State athletes moved past the first round of the NCAA East Preliminary Round in separate events Wednesday evening in Lexington, Kentucky.\nKai Cole got things started on the right foot, qualifying for the quarterfinals in the 100 meters. Cole clocked in at 10.41 seconds while fighting a headwind, ranking No. 20.\nPremier Wynn ran the 400 meters in 51.43 seconds, also taking the No. 20 slot.\nJunior Tafari Bishop concluded a strong season in the same event, placing 29th in 51.89 seconds but not advancing.\nAmong Virginia Cavaliers, Janae Profit punched her ticket to the NCAA Outdoor Championships in the shot put while Esther Seeland (4:22.93 in the 1,500 meters) and Sarah Akpan (11.29 in the 100) advanced to the quarterfinals. Profit threw a personal-best 53 feet, 5 inches, to earn the 12th and final qualifying position.\nVMI junior Eleyah Armstrong, a Bethel High graduate, completed her outdoor season in the 100-meter dash, the event she won at the Southern Conference championships, with a time of 11.80. She was seventh in her group and 46th overall. The top 24 athletes will advance to Saturday’s quarterfinals.\nCOLLEGE LACROSSE\nShellenberger gains fourth first-team honor\nFor the fourth consecutive year, Virginia attackman Connor Shellenberger was named a first-team men’s All-American by the United States Intercollegiate Lacrosse Association and the recipient of the Lt. Col. JI Turnbull Outstanding Attackman award, the organization announced Thursday.\nShellenberger is the first player in UVA history to garner first-team status four times and only the fifth Cavalier to receive the Turnbull award.\nFive other Virginia players — Cole Kastner (second team), Chase Yager (second team), Payton Cormier (third team), Griffin Schutz (third team) and Ben Wayer (honorable mention) — also earned All-America accolades.\nOn the women’s side, three Cavaliers were tabbed All-Americans: Morgan Schwab (second team), Maggie Bostain (third team) and Mackenzie Hoeg (third team). James Madison’s Isabella Peterson made the second team.\nSix CNU players gain USILA awards\nSix players for Christopher Newport, which reached the NCAA quarterfinals, received All-American honors from the U.S. Intercollegiate Lacrosse Association.\nAndrew Cook gained a first-team slot for the second consecutive year. Alex Brendes was a second-team selection, and Ryan Young was on the third team. Coby Auslander, Warner Cabaniss and Drew Miller gained honorable mention.\nAuslander, Cook and Cabaniss were honored for the third straight season, joining Dylan Rice and Max Wayne as CNU’s only three-time USILA All-Americans.\nCOACHING\nNSU coaches invited to ‘The Next Up’\nThree Norfolk State basketball coaches will represent the university at “The Next Up,” an upcoming basketball conference aiming to help young minority men’s and women’s basketball coaches gain opportunities to advance their careers.\nNorfolk State men’s head coach Robert Jones and associate head coach Jamal Brown have been selected, as well as NSU women’s basketball associate head coach Trinese Fox.\nHosted by Pittsburgh Steelers head coach Mike Tomlin, a Peninsula native, and North Carolina Central men’s basketball coach LeVelle Moton, the conference aims to connect Black and minority coaches with influential leaders and executives throughout college athletics. It will take place from May 30-31 in Raleigh, North Carolina.",
  "word_count": 800,
  "scraped_at": "2026-02-14T13:13:08.018578"
}