{
  "article_id": "cd7a3225cddc",
  "url": "https://www.udel.edu/udaily/2025/may/UD-President-Dennis-Assanis-stepping-down/",
  "title": "University of Delaware president announces plans to step down",
  "date": "20250505T133000Z",
  "domain": "udel.edu",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "University of Delaware president announces plans to step down\nPhoto by Evan Krape May 05, 2025\nServing since 2016, Dennis Assanis to continue through June 30\nEditor’s note: On May 13, 2025, the University of Delaware Board of Trustees voted unanimously to recognize President Assanis’ service to UD by bestowing on him an honorary doctorate and the title of President Emeritus. Also, the Board presented Eleni Assanis with the Medal of Distinction, UD’s highest non-academic honor. A tribute to President Assanis is available on UD's YouTube Channel.\nDennis Assanis — who has led the University of Delaware since 2016 during a unique period of transformation and growth — announced today that he will step down from the presidency on June 30.\nAssanis, UD’s 28th president, led the University with a deep commitment to academic excellence and student success, a drive to expand world-class research, scholarship and innovation, and a determination to translate knowledge into beneficial impact for all. As a distinguished educator, renowned scholar and seasoned administrator, Assanis has energized the University as a hub for global education and engagement, expanding resources and opportunities for students, faculty and staff to thrive in a rapidly changing world.\n“My wife, Eleni, and I are so grateful to everyone in the University of Delaware community, whom it has been my distinct honor to serve as president. Our hearts are filled with gratitude and pride,” said Assanis. “UD is a remarkable place with a vibrant culture of interdisciplinary inspiration to reimagine what’s possible in higher education. I will forever treasure my experience of leading such an extraordinary institution defined by amazing students, talented faculty, dedicated staff and a vast network of loyal alumni and friends who support its mission.”\nBoard of Trustees Chair Terri Kelly said, “I want to thank Dennis Assanis for his inspiring leadership and service as the University of Delaware’s 28th president. His tireless commitment and bold vision have been transformative, advancing the University to new levels of accomplishment, promise and potential. As we look ahead to the next chapter in the University’s leadership, President Assanis’ legacy of purpose-driven, positive change will forever have an impact on UD’s continued future of institutional excellence. We wish him and Eleni nothing but the best for their future.”\nKelly said the announcement of an interim president to serve beginning July 1 will be forthcoming.\nA Campus Transformed\nAs president, Assanis collaborated with leaders across the University to solidify and advance the Forward and Forever strategic plan, designed to position UD for continued excellence, growth and transformative impact. With its foundational commitment to student success, inclusive excellence, interdisciplinary work on a global scale, innovation and entrepreneurship, and ongoing investment in the intellectual and physical capital of the University community, the strategic plan presented a robust vision for a campus on the move.\nOf note, the upward trajectory of UD’s institutional progress has continued to be recognized across multiple national rankings. This momentum has been achieved and sustained throughout his presidency in spite of unprecedented challenges posed to higher education over the past several years, including the COVID-19 pandemic. The University is ranked #26 among 500 U.S. colleges and universities (up 60 spots from the year before) and #10 out of 235 public universities in The Wall Street Journal/Pulse Rankings 2025, and #86 among 434 national universities by U.S. News & World Report 2024-25. Earlier this spring, UD’s top-ranked graduate programs announced by U.S. News & World Report included 13 programs ranked among the top 50.\nSome key outcomes of President Assanis’ leadership and influence include:\nCommitment to Student Success\nAssanis introduced initiatives aimed at expanding access, affordability and pathways to success for all students, as well as improving pipeline programs and lifelong learning opportunities. His prioritization of academic excellence has translated to an impressive four-year graduation rate that has placed UD ninth in the nation among other public R1 institutions, as reported in the IPEDS 2022-23 Graduation Rate Survey, 2016 cohort. Also, undergraduate financial aid at UD has increased by more than 95% since 2016, from $94 million to $185 million. Throughout his tenure, applications to the University achieved record levels, translating to all-time high enrollments across all categories of students (in-state, out-of-state, honors, graduate, international, transfer). Of note, this is the sixth consecutive year that UD has received a record number of first-year student applications, now exceeding 41,000 and 50% more than when Assanis started his tenure.\nIn addition, to enhance socioeconomic mobility and student success, he introduced the First State Promise program, which aims to cover all tuition and fees for Delawarean undergraduate students coming from families with incomes under $75,000. About one-third of enrolled Delawareans are covered by First State Promise. Also, since 2016, enrollment of Pell Grant recipient students has increased by more than 62%, and enrollment of underrepresented minority students has increased by more than 35%.\nAssanis also led enhancements of student life, increasing support for mental health services and fostering a culture of inclusion. For example, a new Wellbeing Center at the renovated Warner Hall is driving a more holistic approach to health, wellbeing and counseling for students. In parallel, he supported the creation of programs and physical spaces that encourage and enable all members of the University community to connect, learn, grow and collaborate, including the Center for Intercultural Engagement. Assanis also established the President’s Student Advisory Council to assemble student leaders from across campus for interactive discussion regarding pressing needs and opportunities for the University.\nAs an advocate for innovative learning, Assanis has supported creation and expansion of programs on UD’s multiple campuses in Delaware, as well as through institutional partners around the world. For example, building on the success of the Associate in Arts Program, he fostered new academic opportunities and facilities for students. As former international students themselves, both President and Mrs. Assanis actively promoted and supported expansion of the UD World Scholars Program by adding sites at the American College of Greece in Athens, the University of Auckland in New Zealand, and Newcastle University in England.\nAcademic and Research Excellence\nAs president, Assanis fostered transformational growth of UD’s research, scholarship, and innovation. Total research expenditures from all sources increased by more than 160%, from $176 million in FY16 to $466 million in FY24. During his tenure, UD’s rankings in the most recent Higher Education Research and Development (HERD) survey released by the National Science Foundation improved from #59 to #28 among publics, and from #84 to #45 among 626 academic institutions, when comparing non-medical school R&D expenditures. Research and scholarship have expanded across various disciplines, evolving through interdisciplinary collaboration, academic focus, human relevance, and societal impact.\nOne catalyst for growth has been UD’s role as headquarters for the National Institute for Innovation in Manufacturing Biopharmaceuticals (NIIMBL), which Assanis helped secure in 2016. Also during his tenure, UD has created and/or renewed multiple interdisciplinary centers and institutes in innovative materials, clean hydrogen and environment, biomedical and life sciences, engineering driven health, education and policy. Assanis has also worked closely with various campus stakeholders to support numerous and emerging campus-wide artificial intelligence (AI) initiatives in academics, research, operations and ethics. He also created a policy to invest campus resources in support of the growth of the Arts and Humanities, emphasizing the comprehensive nature of the University and the importance of holistic education.\nThroughout his tenure, Assanis worked closely with the provosts, deans and chairs to spearhead an unprecedented effort to enhance UD’s faculty ranks, hiring more than 600 faculty across campus since 2016, including several in interdisciplinary clusters. About 45% of current faculty members have been hired since 2016, bringing new perspectives, energy and diversity to UD’s distinguished faculty ranks. Their collaborative efforts have yielded multi-year faculty hiring plans to meet projected demand for undergraduate and graduate student instruction across multiple departments and colleges at the University, based on growth in enrollment and research opportunities.\nIn addition, Assanis elevated the undergraduate Honors Program to the Honors College, recognizing its excellence and interdisciplinary standing. The Honors College is currently receiving more than 16,000 applications for 800 honors placements in the first-year class. Over a 10-year average, the four-year graduation rates for UD’s honors students are 88% across the entire cohort. In parallel, he placed a renewed commitment on graduate education and research by launching the Graduate College to promote excellence and the creation of new interdisciplinary programs.\nAssanis also catalyzed the naming of UD’s stand-alone, highly ranked Joseph R. Biden, Jr. School of Public Policy and Administration, enhancing the school’s programs and impact through partnerships with many of the colleges and the community, including the creation of the Biden Institute at UD and the Stavros Niarchos Foundation Ithaca Initiative on civil discourse and civic engagement.\nAssanis continued to nurture campus-wide participation in Horn Entrepreneurship, evolving it into a highly ranked program, currently rated as #3 in the Mid-Atlantic by Princeton Review. The Assanises have been strong supporters for the elevation of the School of Music, raising resources and expanding its community outreach. The introduction of the Calidore String Quartet and the global ambassadorship of the Delaware Choral Scholars are exemplars of the school’s excellence in both academics and performance.\nCampus Evolution\nAssanis has been an active champion for the vision to develop UD’s Science, Technology and Advanced Research (STAR) Campus as a nexus for cutting-edge discovery and innovation, top-notch academics, community partnerships, entrepreneurship and economic development. He has led initiatives to make STAR home to more than 1.2 million square feet of new buildings where more than 3,000 people work. Significant investment by UD and its partners over the past nine years have helped create the Tower at STAR, the Ammon Pinizzotto Biopharmaceutical Innovation Center, Chemours’ global R&D Discovery Hub, the FinTech Innovation Hub and the Securing American Biomanufacturing Research and Education (SABRE) Center, currently under design. Powered by changemakers with big ideas, the STAR Campus community is accelerating innovation in health, energy and environment, financial technology and data science services, rapidly elevating UD’s prominence and impact as a 21st-century research university.\nOther areas of campus, including the historic Green, have been transformed as well. Completed projects under Assanis’ leadership include the new interdisciplinary science center, known as Building X, which brings together brain science, biological science and quantum science; the renovation of Worrilow Hall; the addition of Joseph and Judith DeStefano Chemistry wing to Drake Hall; the renovation of the Design Studio; the Pearson Hall Makerspace; numerous classrooms, laboratories and significant spaces for music, theater and dance; the opening of the South Academy Residence Hall; and the acquisition of the University Courtyard apartments.\nAs a leader and connector, Assanis significantly advanced University relationships with multiple constituents throughout his presidency, yielding consistent increase in philanthropy and federal and state appropriations for capital projects.\nRecord-Breaking Philanthropy\nThroughout his tenure at UD, Assanis brought a strategic and deliberate approach to philanthropic development, crafting a vision and case statements in support of institutional priorities and capital projects. Together with his wife, Eleni, the Office of Development and Alumni Relations and multiple units across campus, Assanis prioritized deep relationships with major philanthropic donors and prospects to support life-changing UD initiatives in alignment with institutional evolution and impact.\nOne year into his presidency, the University launched the most comprehensive fundraising and engagement campaign in its 282-year history, Delaware First, garnering more than $1 billion to support scholarships, faculty research and campus infrastructure and programming. The campaign drew support from more than 113,000 donors, fueling growth and discovery for generations of Blue Hens. In 2020 and 2022, UD’s outstanding philanthropic campaign was recognized as the winner of two National Circle of Excellence educational fundraising awards. Since the completion of the campaign, UD has raised more than $270 million in two and a half years to support scholarships, student success and capital projects. Among them, in March of this year, the University announced the largest donation in its history — a $71.5 million commitment from UD alumni Rob and Kathy Siegfried to create Siegfried Hall, a state-of-the-art, student-centric learning space, and the Siegfried Institute for Leadership and Free Enterprise as part of UD’s Alfred Lerner College of Business and Economics.\nElevating Athletics\nThroughout his presidency, it was not unusual to see the Assanises cheering on Blue Hen student-athletes from the stands. Under the president’s leadership, the University saw the renovation and construction of new athletic facilities — including an upgrade of UD’s 22,000-seat Delaware Stadium and construction of the new Whitney Athletic Center, integrating student-athlete development. In 2023, the University announced its move to Conference USA and the football team’s transition to FBS, which will be a game-changer for UD athletic competition. In addition, the University will add women’s ice hockey as a varsity sport.\nAbout Dennis Assanis\nDuring his time at the University of Delaware, Assanis served the White House as an appointed member of the President’s Council of Advisors on Science and Technology, and he served on the National Commission on Innovation and Competitiveness Frontiers, an initiative of the nonprofit and nonpartisan Council on Competitiveness.\nPreviously, Assanis served as provost and senior vice president for academic affairs at Stony Brook University in New York. Earlier he had a distinguished career at the University of Michigan and the University of Illinois at Urbana-Champaign.\nWith a worldwide reputation as a scholar and expert in both fundamental and applied studies of internal combustion engines and energy systems, he was inducted as a member of the National Academy of Engineers in 2008 for his scientific contributions to improving fuel economy and reducing emissions of internal combustion engines, and for promoting automotive engineering education. He holds five patents and has directed more than $100 million in research grants and contracts.\nHe holds an honors bachelor of science degree with distinction in marine engineering from Newcastle University in England and four degrees from the Massachusetts Institute of Technology: a master of science in naval architecture and marine engineering, a master of science in mechanical engineering, a master of science in management from the Sloan School of Management and a doctorate in power and propulsion.\nPraise for President Assanis\n“President Dennis Assanis is a scientific leader himself, a patent holder and innovator, and a transformational leader for the University of Delaware. Since 2016, he has brought a focus to the university on steady investment and improvement in the quality of campus research facilities, on the competitiveness of student admissions, on the quality of research—both federally and privately funded—and on the general future of the University of Delaware. Dennis and his beloved wife Eleni have been a constant presence not just on UD’s campus, but throughout Delaware. As someone whose aspirations and vision for the future of the University of Delaware and its role in our state have been to constantly press for more, for greater, for better, his particular focus on the STAR campus and NIIMBL—the National Institute for Innovation in Manufacturing Biopharmaceuticals—and in collaborative research has elevated UD dramatically and has resulted in lasting and positive change for the better. My entire family and I express our deep gratitude to President Assanis for his tireless, energetic, effective, and innovative leadership of the University of Delaware. He has been one of the most important presidents in the history of the university, and I wish him well in his next chapter.” — U.S. Sen. Chris Coons\n“For nearly a decade, President Assanis led the University of Delaware with precision, pride, and a deep commitment to academic excellence. Despite the challenges facing world-class universities in America today, his bold vision has positioned UD for continued growth and success. I thank him for his service and wish him and his wife, Eleni, much happiness and success in their next chapter.” — U.S. Sen. Lisa Blunt Rochester\n“President Assanis led [the University of Delaware] through some of its most challenging moments in recent history, including the onset and impact of the COVID-19 pandemic. His leadership will always be a cornerstone of UD's resilience, and I am deeply grateful to him and his wife, Eleni, for their unwavering commitment to the Blue Hen community. I wish him all the best as he embarks on the next chapter of his career.” — U.S. Rep. Sarah McBride\n“President Assanis has led the University of Delaware with vision, integrity, and an unwavering commitment to excellence — even in the most challenging times. From guiding the university through the uncertainty of the COVID-19 pandemic to navigating today’s looming federal cuts, his steady leadership ensured that students, faculty, and the broader community remained supported and prepared. I thank him for his service to our state and wish him all the best in this next chapter.” — Delaware Gov. Matt Meyer\n“President Dennis Assanis has been a strong leader for the University of Delaware, my alma mater - and has become a great friend and colleague during challenging times for higher education. I was proud to serve on the search committee that led to the hiring of Dr. Assanis, and on the Board of Trustees during a portion of his tenure before coming to Delaware State University. I have seen his leadership firsthand and know how much UD’s ascension has benefited from Dennis’ tenacity and wisdom and his wife Eleni’s indomitable spirit. They are a power couple for sure. I am grateful for his friendship, his service, and his partnership in many notable University of Delaware / Delaware State University initiatives, most notably our Engineering cooperative program creating unprecedented opportunities for another generation of STEM leaders across the country. Godspeed, Mr. President!” — Delaware State University President Tony Allen\n“Even before his first official day at UD back in 2016, President Assanis was working nights and weekends from Stony Brook to advance the future of the University of Delaware. Dennis was providing a leadership role as a founding member of the Delaware Innovation Space. Dennis has always been a force of nature, and his commitment helped to manifest a new public-private nonprofit partnership between UD, DuPont, and the State of Delaware that would provide incubation/acceleration/fundraising support and services to startups not only spinning out of UD, but to startups from across the United States and abroad landing in Delaware. Dennis served as our board chair for many years and has been a key leader in driving the impact we deliver: support for over 140 startups, the creation of over 1,000 jobs, and the enabling of our startups to raise over $1.2B in funding. The work being done at The Innovation Space has helped to propel the success of UD spinouts such as Versogen, Lectrolyst, and Nitro BioSciences and firmly cement the role of UD as a catalytic force to drive science, innovation, and economic development in Delaware. We at The Innovation Space want to applaud Dennis’s contributions and impact and wish him, Eleni, and the entire Assanis family much continued success!” — Bill Provine, President & CEO of The Innovation Space; Alexa Dembek, Chief Sustainability and Technology Officer, DuPont; Kevin Myers, Deputy Policy Director, Office of Governor Matt Meyer, State of Delaware; Miguel Garcia-Diaz, Vice President for Research, Scholarship, & Innovation, University of Delaware; Patrick Callahan, Innovation, LabWare; Alex Khutorsky, Vice President, Mergers & Acquisition, DuPont\n“The reason that Chemours' Discovery Hub is located at UD's STAR Campus is because of Dennis. He smashed all the barriers, real or unreal, that normally exist between corporations and academic institutions. Dennis has made such a positive difference for UD, the State of Delaware, and area companies. Thank you Mr. President. Wishing you all the best.” — Mark Vergnano, former president, CEO and chair of the Board of Directors, Chemours Company\n“When Dennis Assanis became President of the University of Delaware in 2016, he brought a bold vision: a university as a catalyst for innovation and industry. At Bloom Energy, we had already planted roots at STAR Campus with strong support from the state and local leaders—and under Dennis’s leadership, our partnership truly thrived. Dennis understood that powering the future and being at the forefront of innovation takes strong partnerships. Thanks to him, our collaboration became a model for what’s possible when academia and industry work together with purpose. Like all great leaders, Dennis doesn’t work alone—he comes as a package deal. His wife, Eleni, has been a vital partner in creating a true community. I’m grateful for their friendship and support in transforming the STAR Campus into the vibrant and bustling innovation hub it is today and a place where nearly 800 Bloom employees are building clean, reliable energy solutions. That’s a testament to Dennis’s leadership and legacy. Thank you, Dennis, for demonstrating that great leadership unites vision with impact.” — KR Sridhar, Founder, Chairman & CEO, Bloom Energy\nContact Us\nHave a UDaily story idea?\nContact us at ocm@udel.edu\nMembers of the press\nContact us at mediarelations@udel.edu or visit the Media Relations website",
  "word_count": 3462,
  "scraped_at": "2026-02-14T13:21:02.540557"
}