{
  "article_id": "cd861ecc38be",
  "url": "https://www.huffingtonpost.co.uk/entry/13-world-news-stories-you-might-have-missed-this-year_uk_658428a9e4b03e698a123ad8",
  "title": "World News Stories You Might Have Missed In 2023 | HuffPost united kingdom Politics",
  "date": "20231225T113000Z",
  "domain": "huffingtonpost.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Over the past year, headlines in America were dominated by US politics and some world news events, including the ongoing war in Gaza between Israel and the Hamas militant group, and the conflict between Russia and Ukraine in Eastern Europe, among other things.\nStill, there are plenty more international news stories that are worth your attention.\n2023 saw the rise of right-wing populism with leaders like Javier Milei, who prevailed in Argentina’s presidential contest last month, winning elected office.\nHowever, in Poland, where voters turned out to the polls in record-breaking numbers, conservatives were unable to secure enough support to stay in government, paving the way for Donald Tusk, a centrist politician who previously served as the country’s leader, to return as prime minister.\nMeanwhile, natural disasters took place around the world — including in Libya, where Storm Daniel and the ensuing floods killed thousands of people, and in Greece, which recorded the largest wildfire ever in the European Union.\nThere was still cause for optimism though, as UK scientists made a huge breakthrough in cervical cancer research, and the sports world appears to be taking more action to increase diversity among its referees.\nHere is a more detailed look at 13 international stories from 2023, which we wanted to make sure you didn’t miss.\nThe Rise Of Right-Wing Populism\nArgentina\nFar-right politician Javier Milei last month won Argentina’s presidential election, defeating then-Economy Minister Sergio Massa by over 11 percentage points, and earning the praise of former US President Donald Trump. Milei, who became popular by calling out what he described as the political “caste” on national TV before being elected to serve in Congress, has since announced shock economic measures, including devaluing the currency by over 50% and slashing ministries from 18 to 9, to stem the country’s fiscal deficit that he says is responsible for high inflation, among other things.\nArgentina’s new government is also bringing in new security rules as part of an effort to crack down on anticipated protests over the austerity measures, in a move that critics have deemed “unconstitutional.”\nThe Netherlands\nThe party of populist Geert Wilders won the general election in the Netherlands on November 22, delivering a shock to onlookers around the world. His party, however, will need to form a coalition to earn a majority, and Wilders has so far struggled to do so.\nWilders’ Party for Freedom had campaigned on a manifesto proposing a referendum on the country’s EU membership. An official for the Netherlands’ central bank on Monday, though, warned that a potential “Nexit” would be a “very bad idea.”\nWilders — who has previously praised Vladimir Putin but has in recent weeks criticised the Russian president, calling him a “terrible dictator” — says his country should cut off military support to Ukraine.\nSlovakia Elects Left-Wing Populist With Pro-Russia Agenda\nThe left-wing party led by Robert Fico, who ran on a pro-Russia and anti-US agenda, won the country’s general election in October. Fico was sworn in as prime minister for a fourth time after he managed to form a coalition government with another left-wing party, Hlas, and the ultranationalist Slovak National Party.\nPeople in capital Bratislava took to the streets to protest a plan by Fico’s government to close the top prosecutors’ office as part of a series of legal changes it wants to implement, which both the EU and Slovakia’s president have raised concerns about. Many are also worried that Fico could follow in the footsteps of Hungarian Prime Minister Viktor Orbán, who often spars with the EU and opposes more funding for Ukraine.\nFico had resigned as prime minister in 2018 amid mass protests over the killing of an investigative journalist and his fiancée outside the couple’s home.\nPoland Rejects Conservatives\nCentrist Donald Tusk was sworn in as prime minister of Poland, ending the rule of the right-wing Law and Justice party after eight years. While Law and Justice won the election, its vote share decreased by nearly 7 percentage points, and it was ultimately unable to reach a deal with other parties to remain in power.\nThe party of Tusk, who previously served in the premiership from 2007 to 2014 before becoming president of the European Council from 2014 to 2019, formed a coalition government with two other opposition parties as he vowed to restore Poland’s ties with the European Union. The EU had cut the country off the bloc’s pandemic recovery fund over concerns about the independence of Poland’s judiciary, but the bloc on Friday announced that it would be transferring 5 billion euros (£4.3 billion) of those funds to Warsaw.\n‘Patriots Only’ Local Election Sees Record-Low Turnout In Hong Kong\nJust over 27% of Hong Kong’s eligible voters took part in last month’s district council elections, despite the government’s efforts to encourage people to head to the polls. As the Financial Times wrote, the vote was also “an important test of the government’s ability to demonstrate public support for the political order imposed by China’s President Xi Jinping.”\nParticipation was down dramatically compared with 2019, when widespread pro-Democracy protests opposing a security law backed by Beijing drove a historic 71% turnout. Since then the landscape has shifted, with only those considered “patriots” in support of China being allowed to run, based on new criteria.\nCandidates are now required to pass national security screenings and get nominated from government-appointed committees to be eligible to participate in races. The number of directly elected seats in district elections has also been dramatically reduced.\nMeanwhile, the trial of Jimmy Lai, the Hong Kong media tycoon who has been in jail since 2020, started in December in what is considered a big test for the city’s judicial independence. Lai faces National Security Law and seditions charges. Lai owned Apple Daily, a news outlet critical of Beijing that authorities shut down in 2021.\nHong Kong’s government last week placed five activists who fled abroad from the city on a wanted list, claiming that they have “continued to commit offences under the National Security Law.” It announced a million Hong Kong dollar ($101,000) reward for anyone who “can provide information on the wanted persons or the related cases.” US Secretary of State Antony Blinken denounced the move as an “attempt to threaten and harass those advocating for freedom and democracy.”\nPortugal Corruption Scandal\nAntónio Costa, Portugal’s longest-serving socialist prime minister, abruptly resigned last month after police raided his residence amid a corruption probe into him and other government officials, in relation to energy deals in the north of the country. These included schemes to mine lithium, build a solar-powered data center and generate hydrogen fuel.\nSnap elections have been scheduled for March to elect a new government. While Portugal has resisted the nationalist wave that has engulfed other European countries in the past, Chega, a far-right party, is expected to make gains in next year’s race.\nOver the weekend Portugal’s Socialists, Costa’s party, elected Pedro Nuno Santos as their new leader heading into the 2024 contest.\nCosta was also reportedly being considered as a leading candidate to replace European Council President Charles Michel in the upcoming EU elections before the scandal broke.\nIndia Cracks Down On Dissent\nIndian Prime Minister Narendra Modi continued cracking down on dissenting voices in the media in 2023.\nIn October, Indian authorities raided the homes of several journalists from the digital news outlet NewsClick, which is known for its critical coverage of Modi’s government, and arrested its founder and the company’s head of human resources, in what human rights groups decried as an assault on press freedom. Indian officials claimed the move stemmed from allegations that the news platform was getting illegal funding from China, which NewsClick has denied.\nIn February, Indian authorities raided the BBC’s offices in Mumbai and New Delhi following the network’s release of a documentary that looked at Modi’s role in anti-Muslim protests in Gujarat, which left over 1,000 dead in 2002, and at his government’s track record following his 2019 reelection. The government also moved to restrict screenings of the two-part documentary and had it removed from YouTube and Twitter, the platform now known as X.\nMilitary Coup In Niger\nNiger’s military overthrew Mohamed Bazoum, the country’s president, over the summer, with Gen. Abdourahmane Tchiani becoming the country’s new leader. The U.S. officially designated Bazoum’s ouster a coup on Oct. 10, announcing that it was suspending more support for Niger’s government. The Economic Community of West African States has repeatedly called on coup leaders to release Bazoum, and recently offered to lift sanctions on the country in exchange for his freedom. But Tchiani has ruled that out.\nThe ECOWAS Court of Justice last week ruled that Bazoum was arbitrarily detained and should be reinstated. The decision was welcomed by Bazoum’s legal team, who said that it “gives legal ammunition to those pressing for his full restoration.” While the decision is binding on ECOWAS institutions, it’s unclear how the junta will proceed.\nNatural Disasters\nLibya Floods\nFloods that hit Libya following Storm Daniel in September killed thousands of people, with many still missing and thousands of others displaced. The coastal city of Derna was the most affected area, and the storm caused two dams above the city to break; up to that point, the dams had been holding back the floodwaters.\nProtesters burned down the home of Derna’s mayor, who later resigned. And authorities targeted the media, instructing all journalists to leave the city after being accused of blocking the rescue teams’ efforts.\nResidents told BBC Arabic that the government’s response was seriously flawed. They pointed to poor maintenance of the dams, the absence of a plan for where evacuated people would shelter, and conflicting stay-at-home orders and curfews, among other things.\nGreece Wildfires\nThe blaze that burned in Greece’s Evros region this summer was the largest wildfire recorded in the EU since 2000, when the European Forest Fire Information System started gathering data. The fire — which, according to the Guardian, destroyed 96,600 hectares (239,000 acres) of forest — killed 18 people who were believed to be migrants, including two minors.\nRight-wing groups in the country seized the opportunity to spread baseless conspiracy theories, accusing migrants of being behind the environmental disaster.\nMajor fires also broke out in other parts of Greece in July — one of the busiest months for tourism — including on the island of Rhodes, where officials performed the largest evacuation from wildfires that the country has ever recorded.\nVenice Becomes First City To Charge Day-Trippers For Entry\nVenice in September became the first city to authorize an entrance fee of 5 euros for travelers who visit but don’t stay there overnight, in yet another effort to curb overtourism to the popular destination. The charge will apply on peak days starting in the spring, and the measure will first be tested for 30 days.\nU.K. Scientists Make Breakthrough In Cervical Cancer Research\nResearchers from University College London and University College London Hospitals found that giving cervical cancer patients a short course of chemotherapy before they received standard treatment reduced their risk of dying or the disease returning by 35%, in what the lead investigator of the trial described as “the biggest improvement in outcome in this disease in over 20 years.” Researchers expressed hope that their findings could be replicated to help patients experiencing other types of cancer.\nProgressives Who Won Thailand Election Left Out Of Coalition Government\nThe progressive Move Forward Party, which promised to reform legislation that bans criticism of the country’s monarchy, made a surprise win in Thailand’s election in May. But it was unable to get its eight-party coalition government confirmed after it failed to garner enough support from the unelected conservative Senate.\nPheu Thai, the populist party that came in second in the election and was originally part of Move Forward’s coalition, was then given the opportunity to form a government but chose to exclude Move Forward from its coalition. Pheu Thai said Move Forward’s opposition to the country’s royal defamation law would have made it impossible to get the required votes in parliament.\nPheu Thai also walked back a pledge to not partner with pro-military factions, with its 11-party coalition government now including two pro-military parties.\nSaudi Arabia Attracts Some Of Europe’s Biggest Soccer Stars\nAfter Cristiano Ronaldo signed with Al-Nassr in December 2022 following his departure from England’s Manchester United, Saudi Arabian soccer teams continued their quest to attract top-tier talent in Europe to their league. The league, which is funded by the country’s Public Investment Fund, spent more than $1 billion over the summer transfer window for players like Neymar, who signed a two-year contract with Al-Hilal with yearly earnings of nearly $1 million, and Karim Benzema, who got a $436 million two-year contract to join Al-Ittihad. Al-Hilal also reportedly made record offers to Kylian Mbappé and Lionel Messi, but the two players turned them down.\nFemale Referee To Make History In English Premier League\nWomen are due to shatter another glass ceiling this year as Rebecca Welch is set to officiate Saturday’s game between the Fulham and Burnley soccer clubs, which will make her the first woman to referee a Premier League game.\nMeanwhile, Sam Allison is set to officiate a game between Sheffield United and Luton on Tuesday, which will make him the first Black person to referee a Premier League game in 15 years.\nThis follows a pledge by the Football Association to hire 50% more referees from “historically under-represented” backgrounds by 2026.",
  "word_count": 2247,
  "scraped_at": "2026-02-14T13:10:09.262792"
}