{
  "article_id": "cd88c9d168c2",
  "url": "https://theathletic.com/4574643/2023/06/07/arsenal-women-summer-transfer/",
  "title": "Arsenal Women summer transfer window : Russo , Lacasse , Batlle on radar",
  "date": "20230607T051500Z",
  "domain": "theathletic.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Arsenal pushed as far as they could last season.\nWithout context, finishing third thanks to goal difference may seem underwhelming after missing out on the title in 2021-22 by a single point. But given they contended with five major injuries while also winning the Conti Cup and reaching extra time of a Champions League semi-final shows just how much energy was put into their 2022-23 campaign.\nAdvertisement\nAhead of next season, recovery and retribution will be the goal. If anything, this season has proven the base level of this team is exceptional. Now the summer window can help them jump up a few more notches to compete more fully next year.\nHow much money is likely to be available this summer?\nWhile there is not a concrete answer to this, there is a feeling within Arsenal that this will be a key window for them. Head coach Jonas Eidevall admitted as much last month, saying: “It has to be a very big transfer window for us this summer, especially given that both last summer and this winter windows, in my words, were not good enough for us. We didn’t get our required targets in the way we wanted, so we have to get that right this summer.”\nThis time around, there is a recognition that a few more quality options are needed to strengthen the squad. The context of transfers within women’s football is also important here as players leaving on free transfers at the end of their contracts is more common than in the men’s game, where transfer fees are involved in the majority of deals.\nThe bottom line is, Arsenal are prepared to invest in the team, and Champions League qualification would no doubt have helped that stance.\nWho makes the key decision over signings?\nOver his two years in charge, it is clear that Jonas Eidevall has an impact on who is recruited. Rather than being a head coach and that alone, there is room for collaboration with head of women’s football Clare Wheatley and recruitment officer Kevin Murphy.\nPlayers who fit profile-based and positional frameworks will be presented to Eidevall and Wheatley, the former outlining his preference and the latter going into negotiations before sporting director Edu Gaspar signs off.\nEdu has been increasingly visible around the women’s team since 2021. A reshuffle in his department was confirmed in April with Jason Ayto being named as assistant sporting director and James Ellis being promoted to head of recruitment. As part of this, it was stressed that the pair would support Edu in recruitment across the men’s, women’s and academy sides.\nAdvertisement\nEven so, it is likely Arsenal will hope the months of work from Eidevall, Wheatley and Murphy come to fruition. It would be unlikely for Ayto and Ellis to have as much influence as those three, with the transfer window opening just two months after their role changes, although they are understood to have already developed close working relationships on both men’s and women’s sides of the club.\nWhich positions are the priority?\nThis summer will be about Arsenal bolstering the spine of their team ahead of next season. The majority of — but not all — signings so far in the Eidevall era have been wide players — both in attack and defence. He has retained many of the central players who precede his time at the club.\nThe Swede’s main aim in his early windows was to build a squad big enough to compete domestically and in Europe. The run to the Conti Cup final win, Champions League semi-final and staying in the Women’s Super League title race until April, despite those five major injuries — and other untimely ones throughout the year — proves there is enough of a foundation there. Now it is about strengthening areas of the pitch where the difference is made.\nThe main area Eidevall was looking to improve in January, in his own words, was a “prolific striker”. His desperation for another option was seen in the short-term signing of 36-year-old Jodie Taylor after the January window had closed.\nThe desire for a new striker is not a slight on Stina Blackstenius, who has performed an instrumental role in Eidevall’s Arsenal. Instead, it would offer her much-needed support in a squad that hopes to compete on multiple fronts.\nRafaelle Souza’s departure also leaves a major hole for Arsenal to fill. The Brazilian’s partnership with Leah Williamson in defence was essential to Eidevall as she provided a left-foot/right-foot balance as well as the ability to defend higher up the pitch.\nAdvertisement\nAsked whether he’d want to replace her with another left-footed centre-back, Eidevall joked: “It’s definitely on that Excel sheet as one of the things that can be a plus.”\nSuccession planning in central midfield may be the next priority for Arsenal. Kim Little, Lia Walti and Frida Maanum have all signed new contracts but a) giving them cover and b) looking forward to how that area is set up without Little and Walti in particular could be important.\nWho are known or plausible targets?\nGiven the stage we’re at in a World Cup summer, there will likely be a lot of variables at play.\nAlessia Russo is a player Arsenal retain significant interest in after their bids for her in January and are most likely to sign the 24-year-old this summer. Benfica forward Cloe Lacasse was also subject to January interest from Arsenal and although reports of a move remain strong in Portugal, there has not been any movement from Arsenal just yet.\nManchester United’s Ona Batlle is also into the last month of her contract. Arsenal were among the clubs — which include Barcelona, Lyon and Paris-Saint Germain — interested in the 23-year-old Spain international but it looks increasingly likely that she will return to her homeland. Arsenal’s interest preceded Laura Wienroither’s anterior cruciate ligament injury at the start of May. The injury could make the need for another right-back more pressing, although priorities will be further upfield.\nWho is an outside name to keep an eye on?\nThe conundrum around a left-footed centre-back is more complicated. Rafaelle’s departure is not just simply a left-footed centre-back leaving, but a supremely talented footballer whose influence went beyond how she kicked a ball.\nThat is arguably Arsenal’s most important piece of business to get right, and with her departure only a week old, it may be a while before the names on Eidevall’s spreadsheet reach the surface.\nAdvertisement\nWho could be heading out?\nMost of this Arsenal squad is settled, with nine first-team players signing new contracts since last May. One of the most important deals was for Vivianne Miedema, who is under contract until the end of next season (2023-24). Departures will likely come from players who are not truly competing for those starting spots.\nTaylor’s deal was only until the end of the season, so it would not be a surprise if her stay does not go beyond this summer. Mana Iwabuchi’s time at Arsenal is also expected to come to an end after returning from her loan to Tottenham Hotspur.\nAnna Patten is another loanee (returning from Aston Villa) who has had speculation over her future of late. She remains highly rated at Arsenal where she could be useful with their most recent anterior cruciate ligament injuries coming in positions she can fill (centre-back and right-back). Or she could be moved on if a deal is put forward that suits all parties.\nEven with these plans to invest in the team, Eidevall and his staff are at an interesting time in their tenure.\nThey had to find different ways to play with so many of their first-choice players unavailable through injury. As they filter back into the team alongside new signings over the summer and into next season, there are a few directions this Arsenal team can go. Do they revert to the 4-3-3 shape that worked so well before they were decimated by injuries, continue with the three-at-the-back system that got them through the back end of the season, or mix things up depending on what suits a game best?\nAs that squad fills out, Eidevall and those who follow Arsenal will likely get a better idea. Those dilemmas do underpin just how important a summer this can be in north London, however — and not just from a transfer perspective.\n(Photos: Robbie Jay Barratt – AMA/Getty Images, James Williamson – AMA/Getty Images, Chloe Knott – Danehouse/Getty Images)",
  "word_count": 1414,
  "scraped_at": "2026-02-14T12:39:25.231553"
}