{
  "article_id": "cd95655829e7",
  "url": "https://www.buzznet.com/2024/07/these-nba-players-are-working-9-5-jobs-since-retiring/",
  "title": "These NBA Players Are Working 9 - 5 Jobs Since Retiring",
  "date": "20240806T013000Z",
  "domain": "buzznet.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "These NBA Players Are Working New Jobs Since Stepping Off The Court\nAfter making millions of dollars in the NBA, retirement offers the league's brightest stars the ability to start a second life. Some, like Shaq and Charles Barkley, can't stay out of the spotlight and move into television. Others take their money and invest in completely different careers.\nSee which former NBA superstars are now working normal jobs as truck drivers, farmers, or even UPS drivers!\nMark Blount - Auntie Anne's Franchisee And Real Estate Mogul\nMark Blount entered the NBA in 1997 and made his long-awaited debut with the Celtics in 2001. In 2009, he retired, ending an unspectacular career. In retirement, Blount decided to invest his money, buying two Auntie Anne's Pretzel franchises.\nBlount isn't the only former NBA star who loves Auntie Anne's. After four years as a franchise owner, Blount sold his stores to focus on real estate opportunities. His initial $700,000 investment ended up earning him a $2 million payday!\nRead on to learn what Birdman is up to these days.\nDan Dickau - Barbershop Owner And ESPN Broadcaster\nDan Dickau is one of Gonzaga University's greatest basketball players of all-time. If only his talent had translated to the NBA! Six years into his professional career, it was over and Dickau was forced to find work elsewhere. To make a living, the former college star opened The Barbers in Washington.\nThe house of hair has become a neighborhood staple since opening. Aside from owning and operating his own barbershop, Dickau is also an on-air personality for ESPN and the Pac-12 Network.\nStill ahead, a player who prefers raising cattle now.\nGreg Oden - Sports Adviser\nThe Portland Trailblazers selected Greg Oden with the first overall pick in 2007 hoping they had found the face of their franchise. Over an injury-riddled career, Oden only played more than 23 games once and retired with chronic foot problems.\nWith his NBA career over, Oden turned back to his academics. He took a job at Ohio State as the student manager of the men's basketball team. The position allowed him to go back to school and take classes to help him prepare for a second career. In 2019 he graduated with a degree in sports industry and accepted a job as the athlete adviser for Edyoucore Sports and Entertainment.\nTim Duncan went from being a \"monster\" on the court to a monster somewhere entirely different.\nAdrian Dantley - Crossing Guard\nThis might be the most surprising post-NBA job on our list. Adrian Dantley had a 15-year NBA career that ended with him scoring 23,000 points and being inducted into the Hall of Fame. In 2010, Dantley, who had been coaching, left the league for good and became a crossing guard.\nThe low-profile job reportedly pays Dantley $14,000 a year, so we know he's not in it for the money. According to the big man himself, he enjoys helping other people. It doesn't hurt the job provides health benefits, too. Dantley also works as a referee for high school and recreational teams during his spare time.\nDetlef Schrempf - Business Development Officer\nIn college, Detlef Schrempf majored in International Business. As soon as his 16-year NBA career was over, he put his degree to good use, signing up to work for Coldstream Capital Management as a business development officer.\nOn top of his 9-5, Schrempf has also dipped his toe into acting. He had a recurring role on Parks and Recreation while it was on the air, and looked very comfortable in front of the camera.\nComing up, we reveal what Brandon Roy has been keeping busy with since retiring.\nBrandon Roy - High School Basketball Coach\nMany analysts believed Brandon Roy was on his way to a Hall of Fame NBA career when knee injuries derailed his future. Roy's knee never recovered correctly and he was forced to retire young. Initially, he attempted a second career in broadcasting, only to learn he wasn't a fit.\nIn 2016, Roy accepted the job as the head boys basketball coach at Nathan High School. In his first season, the team went a perfect 29-0. For his efforts, he was awarded the Naismith High School Basketball Coach of the Year Award. Since 2017, Roy has been the head basketball coach at Garfield High School.\nBryant Reeves - Cattle Farmer\nBryant Reeves floundered out of the NBA after six seasons. Injuries proved too much for the man nicknamed \"Big Country\" to handle, and he turned to a quiet life of raising cattle on a farm. He might not have been meant for sports glory, but he knows his way around a farm.\nReeves currently owns and operates a massive 300-acre cattle ranch in Oklahoma. Never has a nickname seemed more appropriate than the one Reeves earned when he played. Some kids dream of growing up to be cowboys. Reeves grew up with NBA dreams but seems just fine living like the rest of us.\nAnother former player who's farming now is next.\nScottie Pippen - Livestock Farmer\nIt took Scottie Pippen a long time to accept his retirement. One of the greatest Chicago Bulls of all-time, Pippen retired in 2004 and instantly regretted his decision. He spent the next several years trying to make a comeback, desperate to win a seventh ring.\nOnce Pippen accepted the comeback would never happen, he found a second career with his brother. Together, the two co-own a livestock farm in Arkansas. On the side, Pippen still makes appearances on television multiple times a year.\nCharlie Ward - Head Coach\nCharlie Ward won the Heisman Trophy playing football at Florida State but went undrafted by the NFL and turned to the NBA. Ward played 11 seasons in the league, mostly with the New York Knicks. With his NBA career over in 2005, he turned to another love; coaching.\nWard didn't get into college or professional coaching, though, he went smaller, taking jobs at the high school level. In 2005, he was named the head coach at Booker T. Washington High School in Pensacola, Florida. Since 2018, he has been the head basketball coach for Florida State University's Developmental Research School.\nJust ahead, we check in on Karl Malone and where retirement has \"driven\" him.\nKarl Malone - Truck Driver\nKarl Malone made enough money during his legendary NBA career to never have to work another day in his life. Don't tell him that, though. Since leaving his first love, Malone invested his money into several businesses and even works as a part -time truck driver.\nOne of the businesses Malone has given money to is a timber hauler. Malone's interest in the company, oddly enough, was both for business and pleasure. He drives trucks for the company part time and has become very passionate about the industry according to those close to him.\nVinnie Johnson - CEO Of Manufacturing Company\nVinnie Johnson is fondly remembered by NBA fans as one of the \"Bad Boys\" of the league. With the Detroit Pistons, he won back-to-back titles in 1989 and 1990. It was 1992 when he retired and found his true calling.\nJohnson started Piston Group, a small manufacturing company that has grown into a multi-million dollar asset. Still working as the CEO, Johnson has proven he's much more than just an NBA superstar; he's a life superstar!\nShawn Kemp - Sports Bar Owner\nShawn Kemp had a successful 14-year career in the NBA. He was a six-time all-star and was named All-NBA Second Team three times. After he retired in 2003, he stepped away from the court, but couldn't leave his love of the game behind, and opened Oskar's Kitchen in Seattle.\nThe sports bar located in the Pacific Northwest was a daring endeavor for the NBA star. He ran the business for as long as he could afford rent. In 2015, Kemp was forced to close the bar's doors. Today, Kemp still works in hospitality as a part owner of Amber's Kitchen in Seattle.\nDarko Milicic - Apple Grower\nDarko Milicic likes to refer to himself as the biggest NBA Draft bust of all-time. Taken with the second overall pick in 2003, he jumped around the league until calling it quits with the Celtics in 2012. These days, Milicic lives a quiet life in Serbia growing apples.\nBefore settling into the simple life, Milicic trained to become a kickboxer in his home country. The violent sport wasn't a fit for the big man, who prefers to wander up and down the rows of apple trees on his 125-acre farm.\nLaRue Martin - Community Services Manager For UPS\nLaRue Martin was full of potential when he was taken with the first overall pick in the 1972 NBA Draft. Four years into his career, however, his potential dried up and Martin was out of the league. Needing a way to make a living, Martin took an entry-level job at UPS.\nPatience and perseverance paid off for Martin, who was named Community Services Manager in 2005. On top of his 9-5 job, Martin also works on the Board of Directors for the National Basketball Retired Players Association.\nNext up is Birdman. What's he been up to?\nBirdman Wants A Return To The NBA\nThe last time that Chris \"Birdman\" Andersen stepped onto an NBA hardwood floor was back in 2016-17 season when he played for the Cleveland Cavaliers. A year and some change later, Andersen speaks and says he wants to be back out on the floor.\nStaying in shape and hoping that a team will give you a call while you're not in the NBA is a job in itself. Since 2018, he has played in the Big3 league.\nVin Baker's post-NBA job might surprise you.\nOscar Robertson - Affordable Housing Advocate\nAn old school NBA star, Oscar Robertson was ascendant during his 14 year career. He was named an all-star 12 times and retired as one of the league's highest scoring guards ever. Still, his greatest accomplishment was his work to create affordable housing for African Americans in Indianapolis.\nFor his amazing efforts to improve his community, the University of Cincinnati honored Robertson with an Honorary Doctorate of Humane Letters in 2007. When he has time to himself, the NBA icon also enjoys woodworking.\nVin Baker - Starbucks Manager\nVin Baker had an incredible 13-year NBA career. Sadly, he lost his fortune in retirement, struggling to adjust to the major life change. Today, Baker works as a manager at Starbucks and is a minister at his father's church.\nBaker knows how working at a Starbucks might look to people on the outside, but has come to terms with that, saying, \"I lost a fortune. I had a great talent and lost it. For the people on the outside looking in, they're like 'Wow.' For me, I'm 43 and I have four kids. I have to pick up the pieces.\" In 2019, Baker took a job as an assistant coach for the Milwaukee Bucks.\nTim Duncan - MMA/Coach\nEasily the strangest retirement choice on this list, San Antonio Spur legend Tim Duncan has been training as an MMA fighter since retiring. Currently, his training can only be considered a hobby, although his trainer is high on his potential, calling him \"a monster\" and \"a legit contender.\"\nWhile he waits for his MMA career to begin, Duncan keeps plenty busy running BlackJack Speed Shop, an auto body shop he opened in 2013. In 2017, the shop helped organize the delivery of needed supplies to Hurricane Harvey victims. In 2019, Duncan agreed to return to the Spurs as an assistant coach. He has no plans to sell his auto shop.\nMichael Ray Richardson - Substitute Teacher\nMichael \"Sugar\" Ray Richardson played professional basketball for 24 years. His career started in the NBA but was cut short in 1986 when the commissioner banned him for life. Richardson continued to play across the globe, spending 14 years in Europe.\nOnce he retired in 2002, Richardson got into coaching for a few years until he found his second love; substitute teaching. Now in his 60s, the former star works as a teacher in Oklahoma and runs a youth camp for underprivileged children.\nDerrick Coleman - Water Supplier\nDespite a 15-year NBA career, Derrick Coleman was labeled as lazy by his coaches. They can't say that about his post-NBA life, which has seen Coleman work tirelessly to deliver water to families in need.\nColeman spends his days driving around Flint, Michigan, making sure its residents have clean drinking water. He says, \"That's what I'm seeing. Distress. I'm seeing people who need help. I've seen the rust and everything that's in their water. Flint is like a ghost town, and it's sad... How can this happen here in America?\"\nSteve Francis - Entrepreneur\nWith nine NBA seasons to his name, Steve Francis called it a career to pursue other passion projects. One of those passions was music, leading to the formation of Mazerati Music. His attempt to start a hip-hop record label was forgettable at best, leading him to his next venture.\nFollowing Mazerati Music, Francis started his own clothing line, We r One. Unofrtunately, all of his projects are on hold today while he sorts through financial problems.\nDennis Rodman - Political Ambassador\nDennis Rodman has never stayed out of the public eye. The NBA icon with a boisterous personality to match loves attention. So far, he has avoided a 9-5 job, but his post NBA career is too strange to not include here.\nAfter retiring, Rodman got into professional wrestling. Once he couldn't do that anymore, he became a political ambassador, making his first trip to North Korea in 2013. When he came home, he called Kim Jong Un a \"friend for life.\" He made a return trip to North Korea in 2017.\nLatrell Sprewell - Pitchman\nLatrell Sprewell has always been a controversial name. Considered a superstar when he played, he marred his career by violently attacking Warriors head coach P.J. Carlesimo in 1997. After retiring in 2005, karma struck back. Sprewell was forced to foreclose his multi-million dollar houses and crashed his yacht.\nAll the drama led Sprewell to his new job, being a pitchman for Priceline. As part of his pitch to use the service, Sprewell admits to making bad life decisions. Hopefully he has actually learned his lesson.\nWilt Chamberlain - Everything\nWilt Chamberlain retired from the NBA in 1973. At the time, he was the greatest to ever lace up on the court. After he retired, Chamberlain dipped his toes into every job pool possible, trying to find out what was right for him.\nUltimately, he ended up settling into life as a pitchman. Sadly, Chamberlain passed away in 1999 from heart failure. He might be gone, but his memory lives on forever, both in his highlight reel and his commercials.\nGilbert Arenas - Analyst\nGilbert Arenas was not supposed to be as great of an NBA player as he was. He was drafted with the 31st pick in the 2001 Draft and ended up earning $163 million over his career. You'd think after retiring he'd refuse to work another day in his life.\nNot Arenas. We guess he likes the grind. Since retiring we wouldn't say he has gone full 9-5, but he has stayed business as a sports analyst for Complex. He currently hosts a YouTube sports show for them.\nKenny Anderson - Camp Director\nKenny Anderson was comfortably living his life as a high school basketball coach when it all came crashing down. In 2013, he was arrested and charge with a DUI. The crime got him fired from his job.\nIt took him a while to rebound, but these days Anderson makes his living running basketball camps in Florida. He also still coaches, working in basketball travel league. His big goal is to get back into high school coaching, but he knows he can't rebuild his reputation over night.\nJay Williams - Spokesman\nJay Williams was supposed to be one of the best to ever play in the NBA. Drafted by the Bulls, the hype around the young star was real. Sadly, before his career even began, Williams got into a motorcycle accident. The Bulls cut him and his career was over.\nSince overcoming the tragic loss of his career, Williams has become a spokesman. He is currently the face of Visions Federal Credit Union. He also works on the side for ESPN as a college basketball analyst.\nAntoine Walker - Financial Advisor\nAntoine Walker made a lot of money over his NBA career. In 13 seasons, he made over $100 million. Of course, he still somehow managed to spend more money than he ad and filed for bankruptcy in 2010.\nThree years later, Walker paid off his debts and began his second career. He took a job with Morgan Stanley Global Sports and Entertainment to teach financial literacy to up and coming stars. Who better to learn from than the man who realized it was a problem to own seven luxury vehicles at one time?\nAdam Morrison - Coach\nAdam Morrison's promising NBA career was put on hold when he tore his ACL in 2007. Although he recovered, he never become more than a role player on the Los Angeles Lakers. After he retired, Morrison made the decision to go back to school.\nNot only did Morrison enroll at Gonzaga to finish his degree in sports management, he also took a position on the basketball team's coaching staff. Since joining the Zags, Morrison has moved quickly up the college coaching ranks.\nRony Seikaly - DJ\nRony Seikaly had a very successful 11 year NBA career. Upon retiring, he embarked on his second life as a DJ. Unlike some former players who failed to find success after the NBA as entertainers, Seikaly was a natural at his new job.\nSince transitioning, Seikaly has played clubs in Las Vegas, Miami, New York and Ibiza. He says he never intended to become a full time DJ, but \"the opportunity came organically and it seemed like it would be fun and it grew from there.\"\nJohn Stockton - Basketball Coach\nDuring his career in the NBA, John Stockton was known as one part of a dynamic duo with Karl Malone. He was known for his unselfish outlook on basketball always more willing to part of an assist rather than score the basket for himself.\nAfter retiring from the NBA in 2003, although he decided to give up playing professionally, he didn't leave basketball behind entirely. While he was the assistant coach for the Montana State University Women's Basketball team, he more regularly coaches numerous youth basketball teams.\nBill Walton - Sports Broadcaster\nBill Walton started his basketball career playing for the UCLA Bruins in the 70s winning two national titles during that time. After school, he was drafted into the NBA where he played for the Portland Trailblazers winning MVP and two NBA Championships.\nAfter retiring in 1987, he overcame a stuttering problem and became a successful NBA commentator for CBS, NBC, the Los Angeles Clippers, ABC/ESPN. After taking a break from broadcasting he came back to sports broadcasting full time.\nMichael Jordan - Entrepreneur\nRegarded as one of the greatest basketball players of all time, former Chicago Bulls powerhouse had no need for money after his retirement in 2003. During his time in the NBA he cashed in a total of $90 million although now has a net worth of $1.3 billion.\nWhile he could have sat back and counted his money, he decided to keep working and now owns the Charolette Hornets as part of his job. Besides that, he also works and makes deals with massive companies such as Hanes, Gatorade, and more. He also owns a car dealership and seven restaurants.\nHakeem Olajuwon - Real Estate Dealer\nHakeem Olajuwon played for both the Houston Rockets and the Toronto Raptors between 1984 and 2002 with back-to-back-championships in 1994 and 1995. He is also known for mentoring some other incredibly skilled players of today such as Lebron James and Dwight Howard, among others.\nWhile Olajuwon made some sound investments both during and after his NBA career, he knew that he could keep using his money wisely. So, today, he is a real estate dealer which keeps the money coming in.\nShawn Bradley - Rancher\nShawn Bradley is known as one of the tallest players to step on the NBA court, especially during his time in the league. While he started out playing for the Philadelphia 76ers, he then wen to the New Jersey Nets.\nHowever, he spent the majority of his career playing for the Dallas Mavericks. Aside from playing a role in Space Jam, after his retirement in 2005, Bradley decided to take his talents out in the field and bought a massive cattle ranch.\nMaceo Baston - Owns A Cupcake Store\nWhile in the NBA Maceo Baston joined with the Toronto Raptors, then played for the Indiana Pacers playing for both teams twice over the course of his career. He traveled the world playing basketball in various countries until he decided it was time to hang up his basketball shoes.\nHe then started up a cupcake business with his wife called Taste Love Cupcakes in Michigan. Their business went on to compete in Cupcake Wars taking home $10,000. He's not so much the baker as the taster.\nTom Chambers - Sports Broadcaster\nTom Chambers is the only player to have scored 20,000 points over the course of his career and to be eligible for the Hall of Fame but isn't. He was the NBA All-Star four times and had a 16-year career with six different teams.\nToday, Chambers works as a broadcaster for Fox Sports Arizona where he covers the Phoenix Suns. He also breeds horses in Utah although he describes that aspect of his life more like a hobby than an actual job.\nJunior Bridgeman - Coca Cola Distributor\nJunior Bridgman is currently worth $600 million after playing in the NBA for 12 years. He played from 1975 to 1987 where he played for the Lakers and later the Bucks. After retiring from playing ball, he used his money and acquired 450 restaurant franchises, most of which are Wendy's and Chili's.\nHowever, most recently he sold many of his restaurants in order to work with Coca Cola. He is now a distributor for the Coca Cola company and the third independent bottler.\nChris Washburn - Works For Mortgage Company\nChris Washburn is one of the biggest guys to ever play in the NBA. He was drafted as the third pick in 1986 and played for the Golden State Warriors. Unfortunately personal problems got in the way of his basketball career and was punished with a lifetime ban from the league after failing three drug tests in three years.\nFinally, he decided to clean up his actin in 2000. It was then that he started a fried chicken business with his girlfriend. While that only lasted a year, he now works for a home mortgage company.\nEvan Eschmeyer - Attorney\nDrafted into the NBA in 1999, he played for the New Jersey Nets where he spent four years. However, he struggled to get time in the game due to knee problems, he played in 153 games scoring 421 points.\nHowever, he forced to retire due to his knee in 2004. He then returned to Northwestern University where he played basketball in college and enrolled in the competitive JD-MBA program, where he earned both a law degree and an MBA. He has since worked as an attorney, entrepreneur, and director of finance for Atlas Tower.\nKevin Garnett - Actor\nIn addition to his broadcasting duties on TNT since retiring, Kevin Garnett has also looked to Hollywood to start a new career. He played himself in Uncut Gems, a movie that was met with critical and commercial praise.\nWe know that Garnett might not be settling for a quieter career managing a Starbucks or driving a truck like other players. For some former NBA stars, staying out of the limelight is just never going to happen.\nSteve Nash - Consultant\nAfter retiring from the NBA, Steve Nash had one goal - live a more private love. His love for the sport reeled him back in, though, and he turned to consulting, with franchises including the Golden State Warriors.\nIn 2020, Nash realized he couldn't stay off the court and began interviewing for head coach jobs, landing the gig with the Brooklyn Nets. If that doesn't work out, we imagine he'd fall back on consulting.\nCaron Butler - Burger King Franchisee\nCaron Butler starred in the NBA for 15 seasons before finally calling it quits after the 2016 campaign. During his time on the court, Butler was a two-time all-star and won an NBA championship with the Dallas Mavericks in 2011.\nAfter retiring, Butler went back to his roots. Before playing in the NBA, he worked at Burger King. Once he was out of the NBA, he became a six-time franchisee. In 2020, he also was hired as an assistant coach with the Miami Heat.\nDavid Harrison - Stock Trader\nDavid Harrison only played in the NBA for four seasons. A former top college recruit, he let personal problems overtake his professional life and found himself at rock bottom.\nAfter leaving the world of basketball behind, Harrison took a job behind the counter at McDonald's. He quit after two weeks. Today, he works as a stock trader and has left his troubles in his past.\nLarry Johnson - Business And Operations Representative\nLarry Johnson had his future set up after retiring from the NBA. He returned to college at UNLV where he got his bachelor of arts in social studies. He then was hired by the Knicks to be a business and operations representative.\nThe good times didn't last. In 2015, Johnson was forced to file bankruptcy when it was revealed he owed over $100,000 in unpaid child support.\nBen Wallace - Owner\nBen Wallace was massively successful during his NBA playing days. He lasted in the league for 16 seasons, was named the NBA Defensive Player of the Year four times, was an all-star four times, and led the league in blocks once.\nAfter retiring, Wallace faced several legal problems, but not that damaged him financially. In 2018, Wallace paid his way into the ownership group of the Grand Rapids Drive of the NBA's G-League.\nBill Laimbeer\nDuring his 15 year NBA career, Bill Laimbeer and his father started planning for life after the league. In 1994, they founded Laimbeer Packaging Corporation, which was located in Melvindale, Michigan.\nLess than a decade later, Laimbeer got back on the court, becoming a coach in the WNBA. Overall he has a record of 282-207 as a head coach and has won three WNBA Championships.\nMark Eaton - Restaurant Owner\nMark Eaton was a one-time all-star during his NBA career. He was named to the NBA All-Defensive First Team three times and led the league in blocks four times. And when he retired, what did he do?\nEaton has dipped his toes into several new career opportunities since he retired. He has provided regionally commentary on the radio for the Utah Jazz. He has also opened his own restaurant in Salt Lake City, named Tuscany.\nTony Parker - Musician\nTony Parker officially retired from the NBA in 2019 after a Hall of Fame-worthy 18-year career. He won four NBA Championships, was named the Finals MVP once, was a six-time all-star, and was a major piece of the San Antonio Spurs dynasty.\nOff the court, Parker has pursued several post-career lifestyle paths. Most notably, he has dabbled in becoming a rapper, even releasing his own album in France.\nChris Webber - Investor/Actor/Author\nA five-time NBA all-star and the 1994 NBA Rookie of the Year, Chris Webber spent 16 seasons in the NBA making a case as a possible Hall of Famer.\nWhen Webber retired, he didn't stop. Not only has he gotten into broadcasting, but he also opened a restaurant, an investment company, and is even working on writing his very first book. Webber doesn't just have one normal job, he's got several odd ones!",
  "word_count": 4714,
  "scraped_at": "2026-02-14T13:30:55.860646"
}