{
  "article_id": "cdc982b7b6d5",
  "url": "https://www.thenationalnews.com/news/2025/07/07/us-ends-foreign-terrorist-designation-for-syrias-hts/",
  "title": "US revokes foreign terrorist designation for Syria Hayat Tahrir Al Sham",
  "date": "20250707T173000Z",
  "domain": "thenationalnews.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "US President Donald Trump's administration has revoked the foreign terrorist organisation designation for the Syria-based Hayat Tahrir Al Sham (HTS), according to memo published online on Monday.\nThe memo from US Secretary of State Marco Rubio, dated June 23, was published in a preview of the Federal Register before official publication on Tuesday.\nHTS was added to the State Department’s existing designation of its predecessor, Al Nusra Front, as a foreign terrorist organisation.\nAl Nusra Front operated as Al Qaeda’s Syria branch, but in 2016, HTS broke away from Al Qaeda and rebranded, eventually merging with a number of other groups opposed to former president Bashar Al Assad. The group led a blitz offensive against Damascus in December last year, toppling the Assad regime.\nAhmad Al Shara, leader of HTS and formerly known by the nom de guerre Abu Mohammed Al Jawlani, is now serving as Syria's transitional President. HTS makes up the backbone of the new Syrian government.\nHTS has said that it is “an independent entity that follows no organisation or party, Al Qaeda or others”, and it has gone so far as to arrest Al Qaeda-linked operatives in the territories under its control, according to Site Intelligence Group.\nMr Trump announced during a trip to the Gulf in May that he would lift all sanctions on Syria to allow the country to recover from more than a decade of civil war.\nDuring a speech in Riyadh, Mr Trump said the sanctions were “brutal and crippling and served an important function” but “now it's their [Syria's] time to shine”.\nLast week, he signed an executive order making the move official, though unwinding the US laws and designations around sanctions is a complex process and requires congressional action in some cases.\nThe text of the order highlights “developments over the past six months, including the positive actions taken by the new Syrian government under President Ahmad Al Shara”.\nMr Rubio said the revocation \"is an important step in fulfilling President Trump’s vision of a stable, unified and peaceful Syria\".\nA former member of the HTS security forces in Idlib province, who now works with the new state security forces, welcomed the development.\n\"We are very happy with this news and thank the US government for taking this action,\" he told The National. \"The Syrian people have the right to live a dignified life after this crime and destruction that has happened to them.\"\nIn mid-June, two senators introduced a bill to repeal the Caesar Syria Civilian Protection Act, which placed sanctions on the Assad regime for war crimes against the Syrian people.\n“The Syrian people have a generational opportunity to write a new chapter for their country and the entire Middle East,” said the Democratic senator Jeanne Shaheen in a statement at the time. “We can keep the new Syrian authorities accountable without decimating the economy. Sustained diplomatic engagement can yield tremendous results.”\nThe US is also preparing to circulate to the UN Security Council a draft resolution calling for the lifting of sanctions on Mr Al Shara, sources told The National last week. Discussions are already under way between the council's permanent members to potentially delist Mr Al Shara, his Minister of Interior Anas Khattab and HTS, as part of broader efforts to ease economic recovery.\nLizzie Porter contributed to this report from Istanbul",
  "word_count": 556,
  "scraped_at": "2026-02-14T13:43:18.178884"
}