{
  "article_id": "cdda792f3abf",
  "url": "https://apnews.com/19a11b188f474b97d4792c87ce54a572",
  "title": "Dominant pitching helps make top - seeded Oklahoma the favorite heading into NCAA softball regionals",
  "date": "20230516T223000Z",
  "domain": "apnews.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Dominant pitching helps make top-seeded Oklahoma the favorite heading into NCAA softball regionals\nDominant pitching helps make top-seeded Oklahoma the favorite heading into NCAA softball regionals\nLast season, all-time home run leader Jocelyn Alo led an Oklahoma squad that pounded its way to a second straight Women’s College World Series title.\nThe Sooners still can light up the scoreboard, but their pitching staff and defense stand out just as much this year. Oklahoma (51-1) enters NCAA regional play with a nation-leading earned run average of 0.86 — a key reason the top-seeded Sooners are on a 43-game winning streak that is just four victories shy of Arizona’s Division I record.\nThe 64-team NCAA Tournament opens Friday at 16 sites, with the final eight teams meeting at the World Series starting June 1 in Oklahoma City.\nUCLA is the No. 2 overall seed, followed by Florida State, Tennessee, Alabama, Oklahoma State, Washington and Duke. Stanford is seeded ninth, followed by LSU, Arkansas, Northwestern, Texas, Georgia, Utah and Clemson.\nMIGHTY SOONERS\nPitching is among the reasons Oklahoma is favored to threepeat.\nJordy Bahl is a finalist for USA Softball Collegiate Player of the Year. The sophomore is 15-1 with a 1.15 ERA and leads the team with 109 1/3 innings pitched. Alex Storako – a transfer from Michigan who was the first overall pick in the Women’s Professional Fastpitch draft last month – has a 17-0 record with a 0.75 ERA. Nicole May, a third starter, is 16-0 with a 0.60 ERA.\nA defense that leads the nation in fielding percentage supports the pitching staff. Infielder Grace Lyons was named Big 12 Defensive Player of the Year for the third straight year.\nJayda Coleman and Tiare Jennings — both Player of the Year finalists — are the main players on an offense that leads the nation in batting average and scoring.\nOklahoma will host the Norman Regional starting Friday against Hofstra (29-25).\nANOTHER BRADY\nUCLA’s Maya Brady is much more than just football star Tom Brady’s niece. She’s a finalist for USA Softball Collegiate Player of the Year who leads the team with a .458 batting average, 18 home runs and 59 RBIs.\nLike her uncle, Brady’s got quality teammates. Megan Faraimo, another Player of the Year finalist, leads the Bruins in the circle. She has a 29-2 record with a 1.33 ERA and has 226 strikeouts in 168 1/3 innings.\nThe Bruins (52-5) will open the Los Angeles Regional against Grand Canyon (46-11) and the nation’s RBI leader, Kristin Fifield.\nFOUTS INJURED\nAlabama pitcher Montana Fouts suffered a left leg injury in the Southeastern Conference Tournament, and her status for the Tuscaloosa Regional was unclear.\nFouts, who leads the nation with 311 strikeouts, is one of the nation’s most accomplished players. She threw a perfect game against UCLA in the 2021 World Series. She was NFCA Pitcher of the Year in 2021 and a first-team National Fastpitch Coaches Association All-American last season. She has been a USA Softball Collegiate Player of the Year finalist three times and recently was the No. 4 overall pick in the Athletes Unlimited draft.\nAlabama (40-18) opens on Friday against Long Island University (32-24).\nTOUGH BRACKET\nOklahoma State has made three straight trips to the World Series, but the Cowgirls could have a tough time getting out of its Stillwater Regional this year.\nOklahoma State (41-14) opens Friday against Maryland-Baltimore County (26-15), but possible matchups with Wichita State loom after that.\nWichita State (43-10) appears to have the talent to advance. The Shockers feature middle infielder Sydney McKinney, the No. 1 overall pick in the Athletes Unlimited draft and a finalist for USA Softball Collegiate Player of the Year. She led the nation in batting last season and leads the way again this season with a .519 average. The Shockers also have Addison Barnard, who has 14 homers this season and 69 in her three-year career.\nThe Shockers open against Nebraska (34-20) on Friday. The Huskers are a scrappy team that finished fourth in the 14-team Big Ten.\nUNFAIR SEEDING?\nTwo strong non-Power Five programs will have to win at Southeastern Conference venues to advance to super regionals.\nLouisiana-Lafayette and Central Arkansas did not get top 16 seeds, despite having top 16 RPIs.\nLouisiana-Lafayette (46-13), a Sun Belt Conference team with an 11 RPI, opens against Omaha (32-15) on Friday in the Baton Rouge Regional. LSU (40-15) is the host and seeded 10th overall with a 9 RPI.\nCentral Arkansas (44-10), an Atlantic Sun member with a 16 RPI, opens against Middle Tennessee (39-18) on Friday in the Tuscaloosa Regional. Alabama (40-18) is the host and seeded fifth overall with an RPI of 12.\nTENNESSEE TOUGH\nTennessee takes some big names into the Knoxville Regional.\nKiki Milloy leads the nation with 24 home runs and is batting .421 with a .966 slugging percentage. Ashley Rogers – the third overall pick in the WPF draft – has a 16-1 record and a 0.70 ERA. She has 160 strikeouts in 119 1/3 innings. Both are USA Softball Collegiate Player of the Year finalists.\nThe Lady Vols also have a player with championship experience in Mackenzie Donihoo. She was on the World Series All-Tournament team for the 2021 Oklahoma squad that won the national title. This season, she is hitting .277 and has 15 doubles.\nTennessee (44-8) opens against Northern Kentucky (23-30) on Friday.\n___\nAP college sports: https://apnews.com/hub/college-sports and https://twitter.com/AP_Top25",
  "word_count": 902,
  "scraped_at": "2026-02-14T13:09:15.496974"
}