{
  "article_id": "cdf6433cf952",
  "url": "http://www.nationalaccordnewspaper.com/messi-wins-record-8-ballon-dor-osimhen-oshoala-make-history/",
  "title": "Messi wins record 8 Ballon dOr , Osimhen , Oshoala make history National Accord Newspaper",
  "date": "20231031T074500Z",
  "domain": "nationalaccordnewspaper.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Argentina captain Lionel Messi won a record-extending eighth Ballon d’Or for the best player in the world on Monday in Paris, France.\nThe News Agency of Nigeria (NAN) reports that Messi beat Norway’s UEFA player of the year, and treble winner Erling Haaland of Manchester City to the prestigious prize.\nFrance and Paris St Germain’s Kylian Mbappe completed the list of the top three best players in the world.\nNigeria’s Victor Osimhen and Asisat Oshoala both made history for Nigeria and Africa as they finished in an impressive 8th and 20th positions in the 2023 Men and Women’s Ballon d’Or rankings.\nA message on Super Falcons’ official X handle congratulated Oshoala for the historic achievement both for Nigeria.\n“Asisat Oshoala’s 20th place ranking in the 2023 Women’s Ballon d’Or is a historic and significant achievement for Africa.\n“She’s a talented footballer and deserves the recognition. “Congratulations @AsisatOshoala,” it said.\nInter Miami’s Messi, who last won the award in 2021, played a pivotal role in guiding Argentina to their first World Cup title in 36 years in Qatar last season.\nMessi has won the Ballon d’Or for a record eighth time, fending off competition from Manchester City striker Erling Haaland after leading Argentina to the World Cup last year.\nMessi, 36, becomes the first MLS-based player to claim the coveted prize, although the triumph comes largely on the back of his exploits with his country in Qatar.\nFormer Manchester United player and Inter Miami co-owner, David Beckham handed his prize-signing Messi the award in Paris.\nHaaland, who scored 52 goals last season as City won the Treble in 2022-23, finished second in the voting and won the Gerd Muller Trophy given to the best striker of the year.\n“I couldn’t imagine having the career that I’ve had. Everything that I’ve achieved,” Messi said after getting his award.\n“The fortune I’ve had playing for the best team in the world, the best team in history. It’s nice to win these individual trophies.\n“To win the Copa America and then the World Cup, to get it done is amazing. All of them [Ballon d’Or awards] are special for different reasons.”\nPrior to Messi receiving his award, Barcelona and Spain midfielder, Aitana Bonmatí won the Ballon d’Or Féminin after a record-breaking year with club and country.\nShe helped Barça win Liga F and the Champions League last season, before leading Spain to World Cup glory in the summer.\nIn other awards handed out on Monday, Messi’s Argentina teammate Emiliano Martinez won the Yashin Trophy for best goalkeeper.\nEngland and Real Madrid midfielder, Jude Bellingham was handed the Kopa Trophy as the world’s top player under the age of 21.\nDuring his acceptance speech, Messi made a point of wishing Argentina countryman Diego Maradona happy birthday.\nThe 1986 World Cup winner, who died on Nov. 22, 2020, would have been 63 on Monday.\n“My last mention is for Diego [Maradona],” Messi said. “Today is his birthday.\n“So I would like to remember him from here, surrounded by the best players, coaches and people who love football like he did.\n“Wherever you are, Diego, happy birthday. This goes also to you.”\nPrior to Monday’s ceremony in Paris, no player had won the Ballon d’Or more times than Messi, who first won it in 2009 and then again in 2010, 2011, 2012, 2015, 2019 and 2021.\nCristiano Ronaldo has won it five times, while Michel Platini, Johan Cruyff and Marco van Basten are all three-time winners.\nMessi scored 21 goals in 41 appearances last season as Paris Saint-Germain retained the Ligue 1 title before moving to Inter Miami earlier this year.\nSince moving to the U.S., he has scored 11 goals in 14 games for Miami, helping the franchise win its first-ever piece of silverware, the Leagues Cup.\nHowever, he missed several matches through injury at the end of the regular MLS season as Gerardo “Tata” Martino’s side came up short in their late push for a playoff spot.\nIt is Messi’s performances at the World Cup at the end of 2022 which have earned him an eighth Ballon d’Or as Argentina ended a 36-year wait to be crowned world champions for the third time.\nMessi, as captain, was instrumental to Argentina’s success in Qatar, scoring seven goals and assisting three more as he was named as the Player of the Tournament.\nHe scored twice in the final and again in the penalty shootout against France.\nLionel Scaloni’s team edged one of the most memorable showpieces in the competition’s history.\nHaving come up short with Argentina at four previous World Cups, including losing the 2014 final to Germany, it was deemed by many to be his last chance to get his hands on football’s biggest prize.\nAt 36 years and four months old, he also becomes the second oldest player to ever win the Ballon d’Or.\nHe replaces 2022 winner Karim Benzema.\nOnly the inaugural winner, Stanley Matthews in 1956, was older when he won it aged 41.\nMessi’s first six Ballons d’Or were won while he played for Barcelona, where he is the club’s record goal scorer and appearance holder.\nHe won it for a seventh time shortly after joining PSG in 2021 following Copa America success with Argentina.(NAN)",
  "word_count": 873,
  "scraped_at": "2026-02-14T12:40:48.457871"
}