{
  "article_id": "cdfb73ce2595",
  "url": "https://mwnation.com/tabitha-on-fire/",
  "title": "Tabitha on fire | The Nation Online",
  "date": "20240312T023000Z",
  "domain": "mwnation.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Tabitha on fire\nF\nrance-based Malawian women’s football star Tabitha Chawinga could be writing a fairy-tale success story in her debut season as she is on the verge of winning a silverware and two golden boots.\nThe Scorchers captain inspired Paris Saint Germain (PSG) Women to the final of the Coupe de France on Sunday evening when she scored a brace in a three-all draw against Paris FC before sailing through on post-match penalties.\nThe 27-year-old is also chasing two golden boots as she is now joint leading scorer in Coupe de France with Lyon’s Eugine Le Sommer with four goals apiece.\nTabitha, who also leads the French women’s top-flight league scorers chart with 13 goals, has an edge over Le Sommer as Lyon were booted out of the tournament following a shock 5-4 penalty shoot-out defeat at the hands of Fleury after playing out a goalless draw in regulation time in the other semi-final.\nThe final is scheduled for this Saturday.\nIn a match monitored on PSG TV, the Parisians stared defeat in the face as Paris FC led 3-2 until the 85th minute when Tabitha levelled the scores and there was a huge sigh of relief for PSG.\nIt came as no miracle for the prolific forward to snatch the equaliser in the derby.\nShe received a pass that oozed class in the goal area and in a blur, made a swift turn before firing past a helpless Paris goalkeeper.\nBefore that, Tabitha had scored the second goal with a sweet first-time left-footed shot in the 56th minute as the two teams were tied one-all.\nIn an interview, Tabitha could not hide her excitement on reaching her first final.\nShe said: “Late in the game, it looked scary as we trailed 3-2, but to our credit, we never gave up hope and fought until we got the equaliser.\n“I am so excited to reach my first final here in France and the attention now switches to the match on Saturday. Hopefully, we will win it. I thank the Almighty God for His blessings.”\nMeanwhile, Rwanda-based Malawian female footballer Mary Chavinda shone brightly at the weekend when she claimed a hat-trick as her team Rayon Sport Women FC thumped Kamonyi 8-2 to take her tally to 18 goals.\nThe former FCB Nyasa Bullets Women player was named Player of the Month for January in the Rwandan Women’s First Division League.\nRayon, who are the defending champions, are at the top of the league.",
  "word_count": 414,
  "scraped_at": "2026-02-14T12:47:20.726508"
}