{
  "article_id": "ce169c2a353d",
  "url": "https://www.nbcnews.com/politics/2024-election/live-blog/election-2024-trump-harris-live-updates-rcna178430/rcrd62338",
  "title": "New Hampshire town of Dixville Notch splits the vote : 3 for Harris , 3 for Trump",
  "date": "20241105T064500Z",
  "domain": "nbcnews.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Harris and Trump hold final campaign rallies on eve of Election Day\nBoth candidates held rallies in Pennsylvania, a crucial battleground state.\nWhat to know on the eve of Election Day\n- Former President Donald Trump and Vice President Kamala Harris hit the trail to deliver their closing messages in the final hours before Election Day.\n- Harris had several events scheduled in Pennsylvania, including a star-studded rally in Philadelphia in the evening. Trump, who secured a major endorsement tonight from Joe Rogan, held rallies in North Carolina and Pennsylvania before his last campaign event in Grand Rapids, Michigan.\n- Their running mates had busy schedules, too: Minnesota Gov. Tim Walz, the Democratic vice presidential nominee, and Sen. JD Vance of Ohio, the Republican vice presidential nominee, both held events in the key battleground states of Michigan and Wisconsin.\nCoverage on this live blog has ended. For the latest news, click here.\nNew Hampshire town of Dixville Notch splits the vote: 3 for Harris, 3 for Trump\nThe first in-person votes of the New Hampshire general election were cast at midnight in Dixville Notch, where there are six registered voters this cycle.\nThe result of the presidential race was a tie: Harris and Trump each received three votes. The polls opened at midnight and closed at 12:07 a.m. ET after all voters cast their ballots.\nThe small town has a tradition dating to 1960 in which voters place their ballots in a wooden box shortly after midnight. The results are announced minutes later.\nIn the 2020 general election, Joe Biden won all five of the votes cast in Dixville Notch. In New Hampshire’s 2024 Republican primary, six votes were cast for former U.N. Ambassador Nikki Haley; none were cast for Trump.\nHarris delivers final campaign speech in Philadelphia\nBefore a large crowd in Philadelphia, Harris delivered her final campaign speech of the election, hitting themes about unifying a nation.\n\"I am asking for your vote. And here is my pledge to you: As president, I pledge to seek common ground and common-sense solutions to the challenges you face,\" Harris said. \"I pledge to listen to those who will be impacted by the decisions I will make. I pledge to listen to experts. I pledge to listen to people who disagree with me. Because, you see, I don't believe that people who disagree with me are the enemy. I'll give them a seat at the table. That's what real leaders do. That's what strong leaders do.\"\nHow Pennsylvania’s mail ballot rules will lead to thousands of provisional ballots on Election Day\nLast week, a flurry of litigation in Pennsylvania clarified the rules for mail balloting there. In short, mail ballots will still be rejected in the key battleground state if voters fail to properly date the affidavits that accompany their ballots — but voters who make any mistake with their mail ballots will be able to vote by provisional ballot instead on Election Day.\nThe NBC News Decision Desk examined how many mail ballots remain outstanding in the state, as well as how many counties have already identified as deficient. In the event of a close race in Pennsylvania, provisional ballots and their counting will get a lot of attention after tomorrow night.\nVoters with outstanding mail ballots will need to ensure that election officials receive them by 8 p.m. tomorrow for them to count. But voters with outstanding or deficient mail ballots can also go to their polling places to vote in person.\nOprah casts election as an opportunity to protect voting rights\nSpeaking shortly before Harris took the podium at a rally in Philadelphia tonight, Oprah Winfrey cast the presidential election as an opportunity to fight for democracy.\n\"If we don’t show up tomorrow, it is entirely possible that we will not have the opportunity to ever cast a ballot again,\" she claimed.\n\"We are we are voting to save ourselves from this precipice of danger where we now stand. All the anxiety and the fear you’re feeling, you’re feeling that because you sense the danger, and you change that with your vote. We are voting for healing over hate,\" she said.\nWinfrey also invoked a twist on the familiar slogan that invigorated Barack Obama's campaign in 2008 — \"Yes, we can\" — by saying, \"Yes, she can,\" which the crowd repeated with her.\nWith abortion on 10 state ballots, reports of deadly consequences of bans emerge before election\nResidents of 10 states will vote tomorrow on abortion-related ballot measures, half of which would overturn existing restrictions. In the weeks ahead of an election in which abortion access has been a central issue, a spate of reports have emerged about the life-threatening consequences of strict laws against it.\nProPublica reported last week that two Texas women died after they faced delays in getting miscarriage care because of the state’s abortion ban. ProPublica’s coverage in September linked two deaths to Georgia’s abortion ban.\nIn response to the most recent reports, a group of OB-GYNs told Texas officials and policymakers in an open letter that the two women — Josseli Barnica, 28, and Nevaeh Crain, 18, died — should still be alive.\nHarris goes door-knocking in Pennsylvania\nHarris went door-knocking in Reading, Pennsylvania, this evening as part of a final push to get out the vote in the battleground state.\nAt one house, Harris met a family who said they haven’t voted yet but have made up their minds. At another home, a woman opened the door and Harris told her and her husband that she wanted to stop by as part of her effort to earn their votes. The woman said that she had already voted for Harris and that her husband will be voting on Election Day.\nHarris chatted with the couple about finding common ground, pushing back against the divisiveness that she has said characterizes the Trump campaign.\nTrump’s once enthusiastic crowds dwindle in election’s closing days\nAt a pre-Election Day rally today, Trump was speaking at a venue that was about 70% full — a sight that has become increasingly familiar in the past week.\nTrump has been holding his signature rallies since he first burst on the political scene in 2015, and in the nine years since then he has routinely drawn massive and enthusiastic crowds around the country, from the urban cores to the remote rural fields, where supporters have consistently shown up despite sometimes icy conditions or extreme heat.\nThe events were so packed that thousands wouldn’t be able to get in, and they’d remain outside the venues to show their support.\nCapitol Hill correspondent Ryan Nobles speaks with NBC News' Tom Llamas about the critical states that could change control of the Senate.\nBiden’s election season draws quietly to a close\nFor President Joe Biden, the 2024 campaign ended much as it began, in a room full of union members. But this time, he was a surrogate, not the candidate.\nInstead of commanding the national spotlight, as he did when he spoke at a union conference in Washington the day he announced his re-election bid in April 2023, his speech at the carpenters union hall in Scranton, Pennsylvania, on Saturday was overshadowed by dueling rallies for Harris and Trump.\nAnd rather than the triumphal and defiant defense of his record and a pledge to “finish the job,” Biden’s remarks were sentimental and subdued, so much so that the audience at times seemed to feel compelled to buck up the commander in chief.\nWalz rallygoers feel mix of nerves and optimism ahead of Election Day\nAnxious, optimistic, nervous: That’s how people at Walz’s final rally in Detroit said they’re feeling on election eve.\nRudene Glass said she was ready to cry last night because of nerves — but tonight, she’s feeling hopeful.\nGlass, 74, has been canvassing for Democrats and is especially driven by Social Security and Medicare.\n“This one is different, because it hits home for me personally now I’m retired,” she said. “Don’t take everything from me.”\nGlass said she’s inspired by the way the Democratic ticket is committed to bringing people together.\n“I think we’re at this point with Coach Walz and Kamala that, yes, bridges can be mended,” she said. “She spoke about bringing Republicans on her team, and I said go for it. We can’t just divide ourselves by party. Bring others on our team.”\nPaul, a Dearborn resident who did not want to share his last name because of political divisiveness, said he plans to vote for Harris tomorrow.\n“I think a lot of people are going to vote Democratic but they’re not going to fess up to it,” said Paul, 66, a union mechanic.\nHe cited Trump’s track record and former staffers’ coming out against him as reasons he’s voting for Harris, but he said his chosen candidate isn’t without her own weaknesses.\n“The border is a blemish for the Democratic ticket,” Paul said.\nHarris and Trump are voicing their last pitch to battleground state voters. NBC News' campaign correspondents across the country report on how voters are leaning ahead of Election Day.\nRepublican in Wisconsin Senate race says he will accept election results\nRepublican Senate candidate Eric Hovde said tonight that he will accept the election results in his attempt to unseat Democratic Sen. Tammy Baldwin.\nSpeaking at a campaign stop in Racine, Wisconsin, Hovde answered “of course” when he was asked in a brief interview whether he would accept the results.\nAsked how he expects to do in Wisconsin compared with Trump, Hovde said: “You know, I don’t know. Look, I feel really good. There’s a lot of energy for both President Trump and me. I’m sure he’s going to get some votes that I won’t, and I’m going to get some votes that he won’t.”\nHovde made the remarks at the last of six stops on his election eve bus tour.\nA fixture of American politics for nearly a decade, Trump rallies are coming to an end\nRegardless of who wins tomorrow’s election, a key fixture of America’s political landscape for nearly a decade is set to disappear: the Trump rally.\nThe Trump road show barreled into the end of its run today, with Trump set to close out his campaign with a rally in Grand Rapids, Michigan.\nTrump, who says 2024 will be his last campaign, has held — by his own count — more than 900 rallies since he announced his bid for the White House in 2015.\nArizona Republican mayor door-knocks for Harris campaign\nMayor John Giles walked the sunny streets of Mesa’s Eastmark neighborhood in hope of securing a few last-minute votes for Harris. The suburb, which is 40 minutes east of Phoenix, was built out of an Air Force base and has skewed Republican in previous elections.\n“People are either fish or fowl at this point. They’re one or the other,” he said of Harris and Trump voters.\nBut in a state where presidents have won the last two elections by razor-thin margins, Giles anticipates an unusual pattern could emerge if voters pick Trump for president, choose to protect access to abortion and send Ruben Gallego to the Senate to join fellow Democrat Mark Kelly.\n“That’s kind of the picture of the Arizona voter,” Giles said, shrugging. “That’s our reputation as being independent, right, and being a John McCain maverick.”\nEastmark resident Andre Miller said he was a Republican voter until Trump’s first term. He voted early for Harris this time.\n“Civility has been lost, and we need somebody to help restore that,” he said. “I have sons. I have a grandbaby. And so the last thing I want is for them to see the moral standard-bearer of our country be someone like the previous president.”\nA slice of voters explain why they’re wavering on Harris and Trump\nBeneath the surface of a tight presidential race and NBC News’ tied final national poll, the handful of voters who have wavered in recent weeks illustrated the lesser-of-two-evils thinking that could decide the election.\nHarris is an “empty vessel,” one voter says. Others worry world leaders won’t respect Harris because she’s a woman. Another voter’s concern: It’s not clear what she stands for besides opposing Trump.\nBut then there are voters who say Trump lacks the character or demeanor a president should have. He’s “very rude” and “lies too much.” And some specifically panned the racist and demeaning rhetoric from Trump allies at last week’s rally at Madison Square Garden, criticizing them for alienating Americans instead of bringing them together.\nThat’s according to answers from 24 respondents in the newest national NBC News poll, conducted over the last few days, from voters who say they seriously considered voting for Harris or Trump in the last two or three weeks before they picked the other option.\nGen Z voters at Trump's Pittsburgh rally say economy is their top issue\nThe economy is the main issue for first time, Gen Z voters who spoke with NBC News at Trump's rally in Pittsburgh said this afternoon.\nRyan Jones, 21, said he supports Trump’s proposal for no taxes on tips or overtime.\n“I’m a big fan of lowering taxes personally, and in high school I worked jobs that I earned money through tips. So that would have been able to help me save a lot more for college, and I think that would have helped me out a lot more in the long run,” he said.\nJones, a student at the University of Pittsburgh, says his friends are split over whom to vote for — a lot of his classmates are not voting for Trump, but his hometown friends in Butler County are backing him.\nKaeli Bennett, 18, dreams of being a homeowner and says housing was more affordable during the Trump administration.\n“In the future I want to be able to own a home. And when he was president, the prices were a lot lower, especially for homebuyers. And that is a huge issue for me. I want to be able to own my own home. I want to be able to start a family at an affordable cost,” she said.\nMatthew Lonergan, 19, said the difference in the economy under Trump versus Biden is “night and day.”\nBiden and Harris “really didn’t do anything but hurt the country, and Trump did nothing but help the country,” he said.\nAnother reason Lonergan is voting for Trump is that he sees Trump as more aligned with his Catholic faith. “As a Catholic, Jesus Christ is my lord and savior. Donald Trump supports Jesus, and that just goes with that,” he said.\nTrump’s rally in Pittsburgh took place across the street from Duquesne University, a Catholic college.\nJenna Pindrock, 20, who is Catholic and describes herself as “pro-life,” said she has Catholic friends who were initially on the fence but then were turned off by Harris when she told anti-abortion-rights protesters “you’re at the wrong rally.”\nTrump, in Pittsburgh, says he wants a UFC fight against migrants\nIn his nearly two-hour speech in Pittsburgh tonight, Trump again depicted migrants as vicious criminals, saying he wanted to see Penn State wrestlers and UFC champions fight people migrating to the U.S.\n\"Ah, those Penn State guys, I wanted them to wrestle them migrants,\" Trump said as he talked about meeting the team at a recent campaign stop.\nHe then pivoted to UFC, saying he recently told the company's CEO, Dana White: \"Dana, you got to set up your league of champions — unbelievable, best fighters in the world — and a migrant.\"\nTrump then went back to the Penn State wrestlers, saying: \"I tell you, I felt very comfortable with those big Penn State wrestlers. … I said to them, 'Fellas, you may be like the only guys in the country that could beat the hell out of the migrants.' That’s true. They’re the only ones that could beat the migrants in the fight. These are tough people. These are people have been in jails. They're killers. They're murderers. The level — the level of viciousness is unexcelled.\"\nTrump wrapped his remarks just before 9:30 p.m. ET and is running substantially behind schedule before his final rally of the night in Grand Rapids, Michigan.\nHis closing pitch to supporters in Pittsburgh: \"The only way we can blow it is if you blow it. I’ve given you the ball. I mean, you got to go and vote.\"\nHarris in Pittsburgh declares 'we will win'\nIn her second-to-last rally of the campaign, Harris struck a bullish tone about her chances in tomorrow's election, departing from her typical underdog posture.\n\"The momentum is on our side,\" Harris told a crowd in Pittsburgh. \"Make no mistake, we will win. We will win.\"\nWith the rusting hulk of industrial machinery lit up behind her, Harris whipped through a condensed version of her stump speech. She has had a packed schedule on Election Day eve, capped with a late-night rally in Philadelphia that her allies expect to be massive.\nHarris has often told audiences that she is an underdog, but her campaign and Democrats more generally have grown less anxious and more confident in recent days.\nJoe Rogan endorses Trump on eve of Election Day\nJoe Rogan, who hosts one of the most popular podcasts worldwide, endorsed Trump tonight in a post on X that also praised billionaire Elon Musk, who has been campaigning for Trump in Pennsylvania.\nRogan wrote that Musk \"makes what I think is the most compelling case for Trump you’ll hear, and I agree with him every step of the way,\" in a post that included a more than two-hour interview with Musk.\n\"For the record, yes, that’s an endorsement of Trump,\" Rogan added.\nTrump responded at his rally tonight in Pittsburgh: \"He’s not a person that does endorsements, but he did an endorsement, so I just want to thank Joe Rogan. That’s fantastic.\"\nRogan recorded a three-hour conversation with Trump for his podcast late last month, in which Trump defended himself as \"actually the opposite of a dictator” after The New York Times published a series of interviews with former Trump White House chief of staff John Kelly that included his comment that Trump meets the definition of a fascist.\nAs the election winds down, worries of ‘bond vigilantes’ and inflation hit markets\nThe potential that Trump could prevail in the presidential race has contributed to sentiment in financial markets that his policies could stir both economic growth as well as inflation.\nIn the case that Trump defeats Harris, some see a scenario in which rising fiscal deficits, along with a potential global trade war, could mean higher inflation and surging bond yields, along with gains in the stock market.\nGiven that yields and prices move in the opposite direction, that would be bad for underlying fixed income value. Depending on how things trend, there’s even talk about the return of “bond vigilantes” — traders who essentially force the government’s hands by either eschewing government debt or selling it outright.\n‘Feels kind of weird’: Vance reflects and looks ahead as his VP campaign ends\nVance, who says his partnership with Trump has cost him friends, is wrapping up his campaign for vice president by asking voters not to let their political differences come between them.\n“I really don’t like Kamala Harris and her policies, but most of the people who are voting for Kamala Harris are fundamentally decent people,” Vance, R-Ohio, said in an interview aboard his campaign plane today. “I just believe that.”\nIt’s a belief Vance has articulated at his rallies ahead of Election Day.\nTrump has women speak for him at Pittsburgh rally\nThree female supporters gave speeches during the main part of Trump's rally in Pittsburgh today as he seeks to narrow his gender gap among women vs. Harris.\nArkansas Gov. Sarah Huckabee Sanders, former Democratic Rep. Tulsi Gabbard of Hawaii and conservative personality and former Fox News and NBC News host Megyn Kelly took the stage during Trump's address.\nIn her speech, Kelly said Trump \"will protect\" women and talked up his efforts to curb undocumented immigration and prevent trans women from participating in women's sports. She also mocked the idea that women were secretly voting for Harris because they didn't want their husbands to know they weren't backing Trump.\n\"President Trump gets it,\" Kelly said. \"He will not look at our boys like they’re second-class citizens. And ladies out there who want a bit of girl power in this election, let me tell you something: How can you win when the sons and the husbands and the brothers and the dads you love are losing? It’s not a win.\"\nVance hits up four battleground states on final day of campaigning\nAs Trump savors what could be his last rallies as a candidate, his running mate is running like a man in a hurry.\nVance’s day began in Cincinnati, where he and his wife, Usha, boarded their private campaign plane and promptly cranked up the volume on Europe’s “The Final Countdown” as the plane, known as Trump Force 2, took off for the first stop of the day in La Crosse, Wisconsin.\nSince that very loud needle drop, Vance has remained mostly ahead of schedule on his last day on the trail. From La Crosse it was on to Flint, Michigan, and then to Atlanta. He took the stage for his final rally of the night, in Newtown, Pennsylvania, about 15 minutes earlier than expected.\nWhile Pennsylvania is the fourth and final battleground state of the day for Vance, he has been in six states today. His visit to La Crosse took his motorcade briefly through Minnesota. And for the Newtown rally, Trump Force 2 landed in nearby Trenton, New Jersey.\nVance has stuck to his standard stump speech, with minor tweaks here and there, through all four stops, though he teased the crowd in Newtown that he was looking to go off script.\n“You know, for the last few weeks, my team has been telling me we’re doing good. We’re doing good. Just go out there, make sure people know what a disaster Kamala Harris has been. Make sure people know how great Donald J. Trump is. And that’s the message I’ve been carrying forward,” he said. “But you know, it’s the last day of the campaign, and I think today I’m just going to say whatever the hell I want to.”\nHe then gave largely the same speech he delivered at the three previous rallies.\nFake Arizona election whistleblower is Russian disinformation, agencies say\nFederal agencies said tonight that Russian propagandists are behind a video on X that falsely purported to show a former Arizona aide confessing to a plot to rig the state’s election for Harris.\nThe video was posted yesterday, and the account that uploaded it has been suspended.\nTonight's statement from the FBI, the Cybersecurity and Infrastructure Security Agency and national intelligence director's office is the fourth time in the past 10 days that federal agencies have publicly rebutted a staged Russian video that falsely claims to depict voter fraud in the U.S.\n“Influence actors linked to Russia in particular are manufacturing videos and creating fake articles to undermine the legitimacy of the election, instill fear in voters regarding the election process, and suggest Americans are using violence against each other due to political preferences,” the statement says. “We anticipate Russian actors will release additional manufactured content with these themes through election day and in the days and weeks after polls close.”\nWith early voting done, Trump returns to advocating for Election Day-only voting\nTrump was fairly disciplined the past few weeks as his campaign and the Republican Party generally urged him to embrace vote-by-mail and early voting — and Republican voters complied.\nBut tonight, with early voting concluded, Trump’s Election Day-only preference is back with a vengeance.\nTonight in Pittsburgh, he said he wanted to see “paper ballots, voter ID, one-day voting,” and decried the time it takes to count votes in some states.\n“How can you do this where they say its going to take days?” Trump said.\nTrump brings his kids onstage, tells story about Barron at home\nTrump brought up two of his three sons, Eric and Donald Jr., and his daughter Tiffany onstage during his speech. His other children, Barron and Ivanka, were not in attendance.\n“And do I have good kids?” Trump said after he told a story about Barron’s spending too much time on his computer. “Where are my kids? ... Get them out here.”\nTrump said Barron and Ivanka were at home watching.\nRoberto Clemente Jr., son of MLB legend, shakes hands with Trump before rally\nAhead of his Pittsburgh rally, Trump met backstage with Roberto Clemente Jr., son of the late Pittsburgh Pirates legend Roberto Clemente, both professional baseball players from Puerto Rico, a Trump adviser told NBC News.\nClemente, who died in a 1972 plane crash on a humanitarian mission to Nicaragua, is considered a barrier-breaker for Latino ballplayers in Major League Baseball.\nClemente Jr. is at Trump’s closing rally as his campaign has faced backlash over a comedian's racist jokes at his Madison Square Garden rally, including calling Puerto Rico a \"floating island of garbage.\"\nTrump invited Clemente Jr. on stage during the rally, with the former president saying: \"Puerto Rico! I love Puerto Rico.\"\nClemente Jr. said, \"It’s very important for me to support this man,\" adding to Trump: \"I believe in everything you stand for right now.”\n\"I told this man I commit myself to helping RFK Jr. with making America healthy again,\" he added.\nTrump says there's a '96.2% chance' he wins the election\nIowa voters react to new poll and wonder if the Hawkeye State is a battleground again\nIowa voters seem to be just as surprised as political experts by Saturday’s Des Moines Register Poll showing Harris leading Trump by 3 percentage points, within the margin of error.\nThe state, which voted ruby red for Trump the last two presidential elections, now appears to be shifting, according to the poll, largely because of senior women and politically independent women.\n“Seeing the poll, I was honestly just amazed,” Karen Jackson, who voted for Harris, told NBC News. “Trump had his chance. He didn’t provide us with what we needed, and now we’re going on to someone who will be able to do that for us.”\n“I hope it can just change into a big blue wave, and we can reform some things that need desperately reformed, everything from health care and all the way up and all the way down,” Michelle Lorey said, explaining that she’s invested in making sure her two daughters have the ability to make their own decisions when it comes to their health care, which is why she also voted for Harris.\nSeveral voters said their voting choices coincided with their opposition to Iowa’s strict six-week abortion ban, which passed this summer.\n“It’s historically been a swing state,” Matthew Todd said. He voted for Trump but added, “I’m not going to be shocked if Harris wins the state.”\nBoth Democratic and Republican strategists remain skeptical, given the poll is an outlier compared with others conducted in state. Some strategists have suggested the poll may indicate that Trump could win by a smaller margin than the 8 points he carried the state with in 2020. They also pointed out that Republicans have increased their voter registration advantage in the state by about 170,000 people since the previous election cycle, highlighting a potential roadblock for Harris.\nPennsylvania county says tabulation center has more cameras per square inch than local casino\nElection officials here are confident they are prepared to ensure a smooth process on Election Day and into the night. They also say they're ready for any lawsuits that may arise.\n“We’re running an extremely tight process to prepare for any legal challenges,” Allegheny County spokesperson Abigail Gardner told NBC News today. “It’s very expensive and time-consuming, as you can imagine.”\nThe county spent six figures on cameras, which it installed at every polling location, at all 10 ballot drop boxes and in the Pittsburgh warehouse where ballots will be counted. There are more cameras per square inch in the tabulation center than in the local casino, Gardner said.\nThe goal is to ensure the county has “eyes on everything.” Four to five people will staff each precinct, with 7,000 poll workers scattered throughout the county.\nAn additional 100 election workers are “roaming,” to be dispatched as needed.\nThe county expects 225,000 to 230,000 registered votes to vote by mail and 500,000 more to vote in person on Election Day.\nProud Boys claim they’ll be at polling places as Trump ups violent rhetoric and election fraud claims\nAs Trump yet again tells his supporters he can lose tomorrow only if there’s massive voter fraud and as he ramps up violent rhetoric about Democrats and other “enemies,” members of the far-right group that put more “boots on the ground” than any other at the U.S. Capitol on Jan. 6, 2021, say they’re mobilizing.\nThe last time Trump tried to overturn his election loss, the Proud Boys played a critical role, jumping into action on Jan. 6 just weeks after Trump gave the group a major recruitment boost by telling it to “stand back and stand by” during a presidential debate. The group, which was “thirsting for violence and organizing for action,” sent members to the Capitol to act as “Donald Trump’s army,” federal prosecutors said later. Several Proud Boys leaders were ultimately convicted of seditious conspiracy and are still in prison, including former chairman Enrique Tarrio, who is serving 22 years, the longest sentence given to any Jan. 6 defendant.\nBut the decentralized all-male far-right group remains active around the country, and some of its members are openly making plans to get involved in Tuesday’s elections, as Trump closes his campaign by talking about shooting through the media; calls his political opponents “evil,” “dangerous” and “the enemy within”; and spreads more baseless predictions of election fraud.\nPhilly rapper Meek Mill endorses Harris in new song\nPhiladelphia rapper Meek Mill endorsed Harris this afternoon in a new track called “Who You Voting For.”\nThe rapper lays out his case for backing Harris over Trump at the start of the song: “My homie said he vote for Trump, he want that stimulus / I want it too for him, but the way he moving venomous / I work for everything I got, earn all my privileges / they give immunity to cops, they gone probably finish us.”\nHe later states, “I ain’t vote for Cam-a-la,” mispronouncing Kamala, then saying: “I’m a probably vote Kamala, somebody call her.”\nThe song appears to be a change of tune after fans had speculated that Meek Mill was supportive of Trump after he framed Trump as resilient following the first attempt to assassinate him.\nAnother rapper who once appeared to support Trump only to later back Harris, Sexxy Red, endorsed Harris last week.\nAnd Will.I.Am of the Black Eyes Peas also released a record endorsing Harris, “Yes She Can,” yesterday. It has 1 million views on YouTube.\nTrump and Harris face a persistent gender gap heading into Election Day\nMemos on bathroom stalls. Celebrities on the trail. And supporters of Harris girding for the possibility of a secret vote from Republican women as Liz Cheney proclaims that women “will save the day.”\nFor the second time in a decade, a Democratic woman is running against Trump in a presidential race. And once again, Trump faces a persistent gender gap. It is unusual that both Republican and Democratic presidential campaigns are focused on the same slice of voters, but as the race narrows, both Harris and Trump have found themselves pulling out the stops to mobilize women.\nGoing into Election Day, female voters are much more likely to say they support Harris, with some polls showing her holding a double-digit advantage. In an outlier poll from J. Ann Selzer for the Des Moines Register, Harris has leaped ahead of Trump in Iowa, a state he won in 2016 and again in 2020. According to the survey, which does not disclose how it is weighted to party affiliation, the shift is in part driven by women voters ages 65 and over, who are breaking for Harris by a 2-to-1 ratio.\n20 states have activated National Guard for election support\nTwenty states have placed a total of about 250 National Guard troops on state active-duty orders or are preparing to activate orders for election support.\nThe troops are mostly activated for cyber support, law enforcement or general support to the election.\nTen states have active-duty orders, including swing states like Arizona and North Carolina, as well as others like Alabama, Illinois, New Mexico and Washington. Another 10 states have troops on standby. They include other battlegrounds like Nevada, Pennsylvania and Wisconsin, as well as Iowa, Oregon and Texas.\nMaricopa County official says some problematic voter registration forms are tied to one group\nMaricopa County, Arizona, Recorder Stephen Richer said today that his office has discussed with the county attorney’s office some voter registration forms that he said were tied to a group \"that we have been not wholly satisfied with the voter registration forms that have been submitted.\"\nRicher was responding to a question from NBC News about whether thousands of voter registration forms that he had characterized as problematic were tied to the group Field+Media Corps. Richer said his office \"did not have the specific number for exactly how many of those forms were from\" Field+Media.\nFrancisco Heredia, the CEO of Field+Media Corps, said in a statement to NBC News: \"We do our best to have applicants complete the entire form to turn in to the Recorder’s office, if we have incomplete forms by law we still turn them in to their office, turning in all forms we collect. At the end of the day, we take pride in our work and we believe in the power of voter registration to strengthen our elections.”\nRicher said at the news conference that \"any single form that is processed that puts a voter into suspense status or where the voter has incomplete information, we have to, by law, still process that form, and we have to, by law, send a letter to the affected voter at the best address that we have alerting the voter that he or she needs to take certain steps or provide certain documentation in order to be fully registered.\"\nExamples he cited include an address or a date of birth that \"got translated incorrectly on the handwritten paper registration form.\"\n\"I’ve seen just forms missing required information, and so they will provide that required information, as well,\" he added.\nTrump set to address about 10,000 supporters at Pittsburgh rally\nThe upper deck at PPG Paints arena is closed off, which means Trump will speak to a crowd of 10,000 to 12,000 supporters here tonight.\nIt’s a lively crowd with a fair number of students and lots of folks wearing reflective vests after Trump donned one last week after Biden's \"garbage\" comment.\nPhiladelphia district attorney warns against any Election Day interference\nPhiladelphia District Attorney Larry Krasner warned against foul play at the city's polls tomorrow saying: \"We’re not playing. Eff around and find out.”\nKrasner said at a news conference that he wanted to reassure voters that city officials have been working for months to ensure there is \"nothing to fear\" in casting a ballot on Election Day. He also issued a particular warning to anyone seeking to \"play militia\" or looking \"to threaten people\" at the polls.\n“We do have the cuffs; we do have the jail cells. We do have the Philly juries, and we have the state prisons,\" Krasner said. \"So if you’re going to try to turn an election into some form of coercion, if you’re going to try to bully people, bully votes or voters, you’re going to try to erase votes, you’re going to try any of that nonsense — we’re not playing. Eff around and find out.\"\nHarris' venue for her last stop in western Pennsylvania has a unique history\nHarris’ last campaign stop in western Pennsylvania tonight will be at a unique venue: Carrie Blast Furnaces — a sprawling relic of Pittsburgh’s steel industry.\nThe blast furnace, which operated for almost a century until the 1980s, has been designated a National Historic Landmark.\nThousands are gathering in the shadow of the tall, rusted figure while a DJ plays — as they await Harris’ remarks tonight, as well as performances by Katy Perry and Andra Day.\nTrump rally speaker in Pittsburgh wears rival Cleveland Browns jersey\nKimberly Brown, daughter of Pro Football Hall of Fame running back Jim Brown, took the stage at Trump’s Pittsburgh rally to detail why she is supporting him.\nBrown was wearing her father’s uniform — a Cleveland Browns jersey. The Browns, of course, are the arch-rival of the Pittsburgh Steelers.\nHarris supporters line up for Walz election eve rally in Detroit\nAs the campaign entered its final evening, dozens of Harris supporters lined up outside Hart Plaza in Detroit hours before Walz is scheduled to make one of his final pitches to voters.\nAmong those in line was Jaz’mene Little, 23, a social media manager for the city government. Little said she lived through the Covid pandemic as a college student and watched the Jan. 6 insurrection take place on her 20th birthday, so Harris’ campaign made her “excited” about the country’s direction again.\n“She’s the change that America needs right now, especially in a place like Detroit,” Little said. “It would just be nice to have a leader that actually cares about its people and not just, like, a certain type of, certain group of people.”\nTonight's campaign event is expected to feature a performance by Bon Jovi.\nBill Clinton logs 50 campaign stops for Harris in past month\nBill Clinton made 50 stops on behalf of the Harris campaign in the last month of the presidential race, hitting every battleground state in the final stretch, an aide said.\nThe former president was deployed mostly to small towns in rural areas, including on several bus tours. Clinton held events in Pennsylvania, Michigan, Wisconsin, Georgia, North Carolina, Nevada and Arizona, as well as New Hampshire, Maine and Florida.\nClinton focused his message on the economy and worked to make the case that Harris’ policies would “benefit the middle class and working families,” the Clinton aide said.\nHe also repeatedly discussed reproductive freedom and what role the U.S. should play on the world stage during most of his appearances, “in stark contrast to what he thought would be a travesty if Donald Trump becomes president again.”\nMost places Clinton visited hadn’t seen a high-profile political surrogate, let alone a former president, which is why the Harris team felt he could be effective, aides for both Clinton and the campaign said. He also campaigned for Democrats in some key downballot races throughout his travels.\nBy contrast, his wife, former Secretary of State Hillary Clinton, the 2016 Democratic nominee, used a previously scheduled book tour to talk about Harris. She held a few fundraisers for Harris and, most recently, spoke at two events for the Harris campaign in the final weekend of the race in Florida.\nHarris makes appeal to Latino voters in battleground Pennsylvania\nHarris cast herself as a friend to people of Puerto Rican descent, appealing to voters who were put off by a comedian’s insulting joke about the island during Trump’s rally last month in New York.\nHarris opened her 20-minute appearance in this Hispanic-majority city by assuring voters she has a “long-standing commitment to Puerto Rico” and that, if elected, “will be a president for all Americans.”\nShe did not mention Trump by name, nor did she refer to the comedian’s depiction of Puerto Rico as a “floating island of garbage.” But she and others delivered a message that Hispanic voters in particular need to reject Trump.\nOne of the speakers warming up the crowd was Fat Joe, an American rapper. Leaning on the lectern at Muhlenberg College, he recounted some of what happened at the Trump rally at Madison Square Garden.\n“It was filled with so much hate,” he said. “My Latinos, where is your pride?”\nHarris’ appearance was part of a multicity blitz across Pennsylvania, a pivotal swing state whose 19 electoral votes are key to her chances.\n“This is it,” she told a jubilant crowd in the school gymnasium. “Just one more day. One more day left in one of the most consequential elections in our lifetime, and momentum is on our side. Can you feel it? We have momentum.”\nSince she entered the race in July, Harris has portrayed herself as the underdog. But on the eve of Election Day, she sounded a bolder, more confident note.\n“Make no mistake; we will win,” she said.\nAs the campaign winds down, Harris has avoided speaking Trump’s name in hope of ending on a more positive note. Yet she worked in a few swipes at him, nonetheless. Invoking Trump’s focus on people he dislikes, she said, “When I walk into the White House, instead of stewing over an enemies list I will spend every day working on my to-do list.”\nMusk’s America PAC attorney says $1M winners aren't chosen by chance\nA Pennsylvania judge today declined an effort by the Philadelphia district attorney to stop Elon Musk’s America PAC from doling out cash prizes to registered voters.\nThe injunction means Musk’s PAC will be able to do one last giveaway tomorrow, the last day of the offer.\nThe America PAC giveaway has promised million-dollar checks to some voters and $47 and $100 payments to other registered voters who signed a political pledge in swing states. It was advertised as a lottery-style giveaway through Election Day.\nThe PAC picks winners who effectively serve as spokespeople, and they then “earn” $1 million for doing so, America PAC attorney Chris Gober said.\nGeorgia Supreme Court rules absentee ballots sent late in Cobb County must still arrive by Election Day to count\nThe Georgia Supreme Court ruled today that absentee ballots that were sent late in Cobb County will be counted only if they arrive by Election Day, siding with Republicans in an ongoing case in the key swing state.\nBallots arriving after tomorrow will be set aside pending a further ruling from the court, the justices said. Specifically, the ruling orders officials in Cobb County to segregate the ballots received between 7 p.m. ET tomorrow — the time polls in Georgia close — and 5 p.m. Friday. Voters may continue to hand-deliver their absentee ballots to Cobb County elections offices.\nThe latest ruling puts on hold a decision by a lower court that had extended the deadline for absentee ballots in the county.\nThe ruling pertains to a legal battle over 3,000 absentee ballots in Cobb County that were sent to voters late.\nThe Democratic National Committee and the Democratic Party of Georgia sued Cobb County on Friday after elections officials there said Thursday they had not delivered more than 3,000 absentee ballots on time.\nUnder Georgia law, anyone who requests an absentee ballot by an Oct. 25 state deadline must receive one within three days. Cobb County officials said Thursday that they would send absentee ballots to the affected voters who had requested them with express or overnight shipping. Democrats argued in their suit that the ballot receipt deadline for those ballots must be extended to Nov. 8 because there would not have been enough time for some voters to return them by Election Day.\nTrump Media stock is a sell ‘even if he wins,’ analyst says\nA Trump victory won’t change the fundamental challenges his social media company faces, analyst Jay Woods said.\n“We are trading this like GameStop on steroids right now,” Woods, chief capital strategist at Freedom Capital Markets, said of Trump Media on CNBC’s “Power Lunch.”\n“And, you know, kudos to those that are trading it making money. But over the long term, the metrics don’t make any sense,” he said.\nTrump Media has said in regulatory filings that it does not track key performance metrics, such as daily and monthly active users. Third-party data firms have clocked a decline in traffic on Truth Social. A Trump Media spokeswoman did not immediately respond to a request for comment.\nWoods also noted that the investment vehicle of Trump Media co-founders Andrew Litinsky and Wes Moss — who were contestants on Trump’s TV show “The Apprentice” — sold nearly their entire DJT stake shortly after they were allowed to do so.\nTrump, who owns nearly 57% of the company, has vowed not to sell his stake.\nWoods said that if Trump loses, “you may see even a little rally, people flocking to the site. But overall, how is this going to survive from a fundamental point of view?”\n“I think it is still a sell” even if he wins, Woods said.\nNBA holding 'civic engagement night' ahead of election\nIt's \"civic engagement night\" for the NBA, with all 30 teams playing and sharing \"important resources from voting organizations encouraging fans to make a plan to vote\" at their games, the league said in a news release.\nThere will be no basketball games at all tomorrow, part of the league's aim to get people out to vote, and numerous arenas are being used as polling stations, the league said.\nElection Day begins in Guam\nIt is just after 7 a.m. in the U.S. territory of Guam, which means Election Day has begun and the polls are open.\nGuam residents are voting for a nonvoting delegate in the U.S. House of Representatives, the state Senate, the state Supreme Court, intermediate appellate courts and municipal governments. Other positions on the ballot include auditor, the state board of education and the utilities commission.\nGuam is the first territory to cast its votes on Election Day, but voters don't get a say in the presidential race because it has no Electoral College votes.\nAzealia Banks says she will vote for Harris\nRapper Azealia Banks withdrew support from Trump today, indicating in a post on X that she plans to cast a ballot for the Democratic presidential nominee — although writing a lengthy post that disparaged both Harris and Walz.\n\"I will be Voting For Kamala Harris tomorrow,\" Banks concluded, adding that billionaire and Trump surrogate Elon Musk \"belongs no where near American Politics.\" Banks also took aim at Trump's plans to deport migrants, calling the former president's deportation plans \"delusional\" in all caps.\nTrump has suggested that he could adopt Musk’s plan for a government efficiency commission to reduce spending and has repeatedly indicated plans for massive deportation of undocumented immigrants if he is elected.\nBanks had previously endorsed Trump in the 2024 presidential race.\nTrump says at campaign rally in Reading, Pa.: 'We're at the 2-yard line, maybe the 1-yard line'\nTrump said at his afternoon rally in Reading, Pennsylvania, \"We're at the 2-yard line, maybe the 1-yard line.\"\nThe former president said that he's not starting from the 20-yard line, but that \"we're starting 15 yards off the field.\"\nUpper deck curtained off at Trump's Pittsburgh arena rally\nThe upper deck at Trump's Pittsburgh rally is curtained off, slicing the capacity significantly from the roughly 18,000 seats available at PPG Paints Arena.\nThere was additional seating made available on the floor of the arena, though. And the line to get inside was backed up far from the arena entrance.\nTrump is slated to deliver his penultimate rally here Monday evening.\nMitch Landrieu says Iowa poll was a pleasant surprise\nHarris’ campaign was pleasantly surprised by the Des Moines Register poll showing her leading Trump in Iowa, but isn’t banking on a victory in what has long been viewed as a solid red state, a top campaign official said in an interview Monday.\nMitch Landrieu, the Harris campaign co-chair, was among those in the crowd in Allentown for Harris’ speech this afternoon as she blitzed Pennsylvania in a final push for votes.\nThe new poll showed Harris leading Trump 47% to 44%, a result driven by older, independent-leaning women. The poll was led by J. Ann Selzer, whose surveys are considered Iowa’s gold standard.\n“First of all, she’s one of the best pollsters, objectively, for both sides,” said Landrieu, a former New Orleans mayor who was also a senior official in the Biden administration. “So, I think everyone in the country was surprised to see that, because nobody had been watching it.”\n“I wouldn’t dismiss that poll, but it’s not part of our calculus.”\n“Our focus — while we’re campaigning everywhere in the country — is on the seven swing states. And we feel really good about our momentum in Wisconsin, really good about our momentum in Michigan, excellent about our ground game in Pennsylvania.”\n“We actually feel really good about Georgia, and North Carolina, Arizona and Nevada.”\nMick Jagger says his kids are voting for Harris\nRolling Stones frontman Mick Jagger took to social media to urge Americans to vote — and said his kids are voting for Harris.\n\"Don't forget to vote — Jagger kids are voting for Kamala,\" the British singer wrote on Instagram in a post featuring pictures of him with six of his adult children.\nTrump is a Rolling Stones fan and has used their songs \"You Can't Always Get What You Want\" and \"Start Me Up\" at his rallies. The band's representatives sent him a cease and desist letter in 2020.\nFBI keeping an eye on threats to election security\nThe FBI reported a slight uptick in reported election security threats, a boost that officials said could simply be due to heightened awareness of interference efforts.\n“So the threat reporting that we’re getting in here is a little more, not a huge volume increase, but people are more aware of reporting information to the FBI,” said agent James Barnacle, deputy assistant director of the bureau's Criminal Investigative Division.\nThe FBI's National Election Command post launched Friday will be running through at least Saturday. For multiple presidential elections now, Russia has sought to influence the White House race.\nBarnacle said the threats are varied: “We’ve also seen some, some attempted cyberattacks, which we see cyber instances all the time, where adversaries are trying to hit the secretaries of state or state governments or local governments and cause issues with their infrastructure.\"\nCISA director: Small incidents had \"no significant impact\" on election\nThe head of the Cybersecurity and Infrastructure Security Agency (CISA) is confident in the security of the 2024 election despite minor disruptions, she said in a press call.\n“I can say with great confidence that our election infrastructure has never been more secure and that the election community has never been better prepared to deliver safe, secure, free and fair elections. State and local election officials have been preparing for this day for years, working tirelessly and selflessly on the front lines of our democracy,” CISA Director Jen Easterly said.\nThis is despite several issues, including a criminal attempt to destroy several ballot drop-off boxes, hurricanes Helene and Milton, and at least one low-level hacking attempt, she said.\n“We have observed small-scale incidents resulting in no significant impact to election infrastructure,” Easterly said.\n“We expect these types of incidents and other forms of disruptions will continue on Election Day and in the days that follow. It’s important to remember that disruptions happen in every election, which is why election officials invest so much into Incident Response preparation and contingency plans,” she said.\nWhat the stock market typically does after the U.S. election, according to history\nStocks typically rise after a presidential election — but investors need to be prepared for some short-term choppiness first, history shows.\nThe three major benchmarks on average have seen gains between Election Day and year-end in the presidential election year going back to 1980, according to CNBC data. However, investors shouldn’t be expecting a straight shot up in the market after polls close.\nIn fact, the three indexes have all averaged declines in the session and week following those voting days. Stocks have tended to erase most or all of those losses within a month, CNBC data shows.\nThis means investors shouldn’t be anticipating an immediate pop Wednesday or the next few days after.\nThat’s especially true given the chance that the presidential race, which is considered neck and neck, may not be called by Wednesday morning. America may also need to wait for close congressional races to have final counts for determining which party has control of the either chamber.\nWhitmer deserves credit if Harris wins Michigan, source close to governor says\nIn the event Harris wins Michigan, a source close to Gretchen Whitmer believes the credit is due to the second-term Democratic governor.\nWhitmer has \"gone above and beyond to help the VP” win over independents and Republicans, the source said.\nAll told, Whitmer’s Fight Like Hell PAC has supported or co-supported more than 160 voter activation, engagement and outreach events in Michigan since January. The governor hit the campaign trail, boosted the Harris-Walz ticket on social media and served as a key media surrogate.\nPoll worker in Nebraska's 2nd Congressional District wears welfare-related shirt as Douglas County counts votes\nA man working as a poll worker in Nebraska's 2nd Congressional District — where government officials conscript poll workers for mandatory duty similar to jury duty — was wearing a shirt disparaging the role as Douglas County's Election Commission began counting early votes today.\nThe man was spotted by NBC News wearing a yellow shirt that said, \"Welfare recipients should be here instead of me\" in an area where poll watchers can view the counting of votes. NBC News was allowed access to the area for about 30 minutes today. The man's identity is unclear.\nHe was also wearing a hat that said, \"Wood Chipper ‘24\" that mimicked a campaign graphic or slogan.\nAccording to The Associated Press, Nebraska residents are required to assist with running the state's elections, similar to jury duty. The state is the only one in the country that has compulsory election duty.\nNebraska's 2nd Congressional District awards a single electoral vote, while three electoral votes exist for the rest of the state. The district includes Douglas County, which is where the state's most populous city, Omaha, is located. Biden carried the district in 2020 while Trump won it in 2016.\nPennsylvania election officials to start counting returned ballots at 7 a.m. tomorrow\nPennsylvania election officials cannot start counting the nearly 2 million ballots that have already been returned until 7 a.m. tomorrow, Secretary of the Commonwealth Al Schmidt told reporters today in the latest of eight recent news conferences.\n“That means election officials can’t even remove the ballot from their envelope and prepare them to be counted until then, which is the same time those officials will be also running more than 9,100 polling places across the commonwealth for in-person voting,” he said.\nSchmidt added that the Pennsylvania Department of State has “never had final official results on election night, regardless of whether media outlets have projected winners on that night or a later date. The department is confident the counties will work diligently to count every eligible ballot cast, and we can’t predict what percentage of those votes will be counted on election night.”\nHarris' relatives show support in new video\nIn a video posted on X by Doug Emhoff, several of Harris' relatives showcased their support ahead of Election Day.\nTony West, Harris' brother-in-law, said, \"She never met a bully she didn't stand up to or a person in need she didn't stand up for.\"\nHarris's stepson, Cole Emhoff, had a similar message, saying, \"Her intent is always to protect.\"\nThe video also showcased Harris' niece Meena Harris, sister Maya Harris, stepdaughter Ella Emhoff, in-laws Barbara and Mike Emhoff, and Meena Harris' partner, Nik Ajagu.\nFulton County officials respond to Republican lawsuits over election\nIn a news conference this morning, Fulton County officials responded to a pair of lawsuits filed against the county by the Republican National Committee and Georgia Republican Party claiming the county had illegally accepted absentee ballots over the weekend.\nThe first lawsuit claimed Fulton County broke state law by allowing absentee ballots to be returned at government buildings over the weekend. A state judge on Saturday ruled the practice is legal, as absentee ballots can be returned any time before polls close on Election Day.\nThe RNC and Georgia have since filed a similar lawsuit in federal court against Fulton and six other counties.\nAt a news conference this morning, the Fulton County Commission board chair, Robb Pitts, said the county anticipates more legal challenges and has lawyers ready.\n“I believe, and we believe ,that the groundwork is being laid for some challenges at some point in the future, but we get sued every day,\" Pitts said. \"So the answer to the question is, we are prepared. There will be no basis for any challenge, but that does not prevent someone, anyone from filing a suit. If a suit or suits come forward, we will be prepared to defend the great work that we’ve done and all the preparations been put into ensuring that this election is open, fair and transparent.”\nThe lawsuit and response comes after Secretary of State Brad Raffensperger has said he stands ready to defend Georgia’s elections — a posture he repeated at a separate news conference this morning.\nBoth federal and local officials are taking extreme measures to ensure voter safety with some states even putting the National Guard on standby. Officials are also working to stop the online spread of disinformation and lies particularly coming from Russia, China and Iran intended to disrupt the election. NBC’s Stephanie Gosk reports for \"TODAY.\"\nInside the final sprint in the biggest battleground state on the map\nPITTSBURGH — No state has played a bigger role in the presidential campaign in the run-up to Election Day than Pennsylvania.\nIt’s been the backdrop for Trump and Harris more than any other state and the site of the most spending on behalf of either candidate. It’s where Trump was almost killed over the summer, only to make his triumphant return months later. It’s where he served french fries during a photo op at a McDonald’s restaurant and danced before the cameras for almost 40 minutes during a rally that turned into an impromptu music-listening session. It’s where Harris unveiled her running mate, her economic platform and made appeal after appeal to disaffected Republicans.\nIt’s where Harris and Trump held their only debate of the cycle. It’s served as a proverbial red carpet for prominent surrogates. Harris has benefited from having three presidents on the trail here boosting her, Joe Biden, Bill Clinton and Barack Obama, while Trump has had Antonio Brown and Le’Veon Bell, two-thirds of the Pittsburgh Steelers’ “Killer B’s” offense of the prior decade, backing him.”\nOver the final two weeks of the race, both candidates and their running mates held 16 events in Pennsylvania — including today, marking some of their final rallies of the campaign. In short, in Harris’ and Trump’s cross-country dance, Pennsylvania is the belle of the ball.\nIn the first stop of her final campaign day, Harris paints contrast\nOn her first stop of her Pennsylvania tour today, Harris offered a moment of optimism to her supporters and drew a comparison between her and Trump's campaign, saying pointing fingers at each other is not beneficial and that she has \"a people-driven campaign.\"\n\"It makes people feel alone. It makes us feel like there’s nobody standing,\" she said. \"And so the way I’ve always been thinking about our campaign and these next 24 hours is as we are getting out the vote, as we are canvassing, let’s be intentional about about building community, about building coalitions, about reminding people we all have so much more in common than what separates us.”\nHarris is making several stops in Pennsylvania today, concluding with rallies tonight in Pittsburgh and Philadelphia.\nTrump posts video of RFK Jr. encouraging his one-time supporters to vote for the former president\nTrump posted a video on his Truth Social account this afternoon featuring Robert F. Kennedy Jr. encouraging his one-time supporters to back the former president.\n“It will be too late by 2028. Once we’re in the grips of totalitarianism, we’re not going to be able to vote our way out of it. This is our last chance to stop them,” Kennedy says, speaking directly to the camera.\n“As you know, this could be a very close election. A disputed election result would be a disaster for our divided nation. President Trump needs to win in a landslide,” he said.\nKennedy, who initially ran as a Democrat in this cycle for president and then decided to run as a third-party option, dropped out of the race in August and immediately endorsed Trump for president. Trump has hinted that if he's elected again, he would put Kennedy — a conspiracy theorist and someone who's warned about the effects of vaccines — in charge of the nation's health issues.\n'Know your power and show your power,' Pelosi says in X post after voting\nAfter voting for Harris, former House Speaker Nancy Pelosi, D-Calif., took to X to urge voters to join her in supporting the Democratic ticket.\n\"Voting is always a happy occasion to me — our voice is our vote,\" Pelosi said in a video of her submitting her mail-in ballot. \"But today I am so happy to be voting for Kamala Harris and Tim Walz to be president and vice president of the United States and to have a Democratic Congress. So it is with great joy that I mail in my ballot for Kamala Harris.\"\nHave confidence and be patient tomorrow, state election officials say\nAmericans should prepare for minor voting hiccups and for the election not to be officially called tomorrow, the country’s leading organizations that represent state election officials said today.\nIn joint announcement today, the National Association of Secretaries of State and National Association of State Election Directors, sister organizations that represent officials in all 50 states, said Americans should have confidence tomorrow.\n“Planning for tomorrow’s election began four years ago, and the election community is prepared,\" the groups said. \"Our members, along with their colleagues at the local level, have devoted extensive time, energy and resources to safeguard America’s elections.\"\nTrump Media stock trades higher after recent big slide\nTrump Media stock was trading higher the day before Election Day.\nMarket analysts have characterized it as a meme stock, since the company, which owns Truth Social, doesn't make much revenue and has lost millions of dollars. Many of the company’s retail investors are supporters of the former president, who are buying the stock as a way to back Trump or bet on his odds of winning the election.\nWhile the stock was up this afternoon, trading around $35 a share, it has fallen a great deal since surging above $54 last Tuesday. It trades under the ticker symbol DJT, which are the former president's initials.\nTrump owns almost 57% of the company, a stake worth about $3.6 billion as of this afternoon. Trump Media executives have said that the company would benefit if Trump beats Harris in the election.\nDemocrats up their Latino outreach with radio ads in several states\nDemocrats have made another infusion of spending to reach Latino voters in battleground states and for key downballot races in time for Election Day.\nThe Democratic National Committee said it has invested a seven-figure amount to reach millions of Latino voters with two bilingual radio campaigns — IWillVote.com and VoyAVotar.com — which have been ongoing for about three weeks. The campaign was to be focused on states with competitive downballot races, but the party also added battleground states more broadly, the DNC said.\nThe campaigns are instructional, with details on when, where and how to vote. The ads have been airing in Arizona, California, Colorado, Connecticut, Georgia, Florida, Maryland, Michigan, Nevada, New Mexico, New York, North Carolina, Oregon, Pennsylvania, Texas, Wisconsin and Washington. They’ll continue airing until polls close tomorrow.\n“The Democrats are making historic investments into bilingual advertising to direct Latino voters to the information they need to make their voices heard at the ballot box in the most important election of our lifetimes,” Monica Guardiola, the DNC's co-executive director, said in a statement.\nDemocrats have been trying to rebuild their critical support with Latino voters. Harris has improved from the lows President Joe Biden was seeing before leaving the race, but still has had a gap to close to reach Biden's level of support among Latino voters in 2020.\nMichigan election results expected by midday Wednesday\nMichigan’s unofficial election results are expected by midday Wednesday, Secretary of State Jocelyn Benson announced today.\nBecause of a new state law that allows clerks to preprocess absentee ballots, the 2024 election is expected to avoid counting delays that plagued the 2020 election.\nSo far, 3.2 million voters in the state have cast ballots, with 1.2 million participating in the state’s first year of early voting and 2 million returning absentee ballots, Benson's office said.\nWith 44% turnout among active registered voters, she said the trends indicate the state is on pace for a high-turnout election.\nWashtenaw, Oakland and Kent counties lead the pack with about 54%, 50%, and 48% turnouts respectively, according to her office. Ann Arbor has the highest city turnout with 60%, while Detroit lags significantly behind at 32% turnout.\nWomen have cast 55% of votes so far, while young voters ages 18 to 30 comprise 12.5% of all early votes, and 15% of early and absentee voters did not vote in 2020, her office said.\nAfter her news conference, Benson noted to NBC News that one municipality, Warren, has elected not to take advantage of mail-in ballot preprocessing. Benson said that would mean processing about 22,000 to 25,000 ballots starting tomorrow, \"and by the evening, we’ll know how many have actually gone through the process.\"\n“We’re hopeful and optimistic all will be done by then, and we’ll, we’ll have plenty of eyes on the process throughout the day and have done a lot of outreach through other means to make sure, again, that the clerk has all that she needs to be as efficient and secure as possible as possible.\"\nObama aimed to help candidates in swing states and key Senate races\nA source familiar with former President Barack Obama’s strategy this cycle said his plan this fall has been driven by “where he can move the needle with Democrats and persuadable voters, particularly in states with key races.” As a result, the person pointed out that Obama traveled to every swing state (and some like Pennsylvania twice), engaged digital creators and taped dozens of digital get-out-the-vote, persuasion and fundraising ads.\n“President Obama has been clear-eyed that the stakes of this election could not be more consequential and that is why he has been doing everything he can to help elect Vice President Harris, Governor Walz and Democrats across the country,” Eric Schultz, a senior advisor for Obama, said in a statement. “His goals are to win the White House, keep the U.S. Senate, and take back the House of Representatives. In the final days of voting, our focus is on persuading and mobilizing voters, especially in states with key races. Many of these races are likely to go down to the wire and nothing should be taken for granted.”\nObama helped raise more than $85 million and worked to help Democrats downballot campaign.\nFor example, this month, Obama surprised volunteers and campaign workers with donuts and cookies from local bakery Woodmoor Pastry Shop as they were working to get out the vote on the final day of Maryland early voting at a phone bank for Angela Alsobrooks, who is running for Senate.\nObama also phoned Texas Senate candidate Colin Allred to “offer his encouragement in the final stretch of the campaign.”\nEarlier this fall, Obama also recorded candidate-specific ads for key Senate races including in Pennsylvania, Nevada, Michigan, Wisconsin, Arizona, Texas, Maryland and Florida. He also recorded robocalls for congressional candidates which are expected to roll out into Election Day to help turn out voters.\nPuerto Ricans turn out for Harris in Allentown\nPuerto Ricans expressed their support for Harris ahead of her rally in Allentown, Pennsylvania, saying the \"floating island of garbage\" comments by a comedian at Trump's Madison Square Garden rally last week changed their perspective.\n\"My first thoughts were, you never come for Puerto Rico, that's a mistake,\" said Josie Lopez, who grew up in Allentown. \"It was illegal to talk about Puerto Rico independence for multiple years. It was illegal to fly our flag,\" she said. \"So a lot of people don't know that, and that's why there's a lot of Puerto Rican pride. We're very proud of our island. We always will be and forever.\"\nAnother Harris supporter, Lisa Richie, said Puerto Ricans were hurt by the comedian's comments, adding \"it offended all of us.\"\nAnother supporter, Ada Kelly, said the comments have allowed Puerto Ricans to come forward.\n\"They're finally putting us on the map,\" she said. \"It's a shame what happened at that Trump rally. I think it was disgusting what that person said, but it put us on the map. It identified, it said we're important.\"\nThe Poles (in Poland) favor Harris over Trump\nWhile the Polish American vote is up for grabs, Poles in Poland think Harris would be better for their country than Trump, state run Polish Radio reported today.\nSome 58% of the Poles responding to a United Surveys poll gave the nod to Harris, while 31% backed Trump, the outlet reported.\nThe survey of 1,000 Polish participants, which was conducted by phone and email from Oct. 25-27, also noted a deep gender divide similar to what pollsters in the U.S. have found.\nAmong Polish women, 77% favored Harris. Among Polish men, 55% backed Trump.\nWhile Polish Americans are a small sliver of the U.S. electorate, they're concentrated in must-win swing states such as Pennsylvania, Michigan and Wisconsin. And many of these voters, experts say, are deeply concerned about the ongoing Russian war against Ukraine, which borders their ancestral homeland.\nHarris said as much in September during the presidential debate with Trump, in which she accused Trump of being too cozy with Russian President Vladimir Putin and too ready to abandon Ukraine.\n“Why don’t you tell the 800,000 Polish Americans right here in Pennsylvania how quickly you would give up for the sake of favor and what you think is a friendship with what is known to be a dictator who would eat you for lunch?” Harris asked Trump.\nTrump is a 'patriot' or 'tyrant' depending on whom you ask\nTrump is a \"patriot,\" \"energetic\" or simply a want-to-be \"tyrant\" depending on whom you ask in battleground Arizona.\nWhen NBC News asked random voters in Phoenix to sum up the former president in one word, the answers were as expectedly varied.\n\"Patriot,\" said 70-year-old, Trump supporter Ned McCarthy. \"He doesn’t take any money for the job he does. He’s lost hundreds of millions of dollars working for this country. I just think he’s a quality person.\"\nPatricia Lam, a 63-year-old backer of the former president, called him \"energetic\" and said \"he seems to care about people.\"\nBut 63-year-old Harris backer David Duane said \"tyrant\" best fits Trump because of his long list of grievances and promises to settle scores.\n\"His threats to his political rivals and even nonpolitical, he’s super equipped to put people down and call the names, punish them,\" Duane said.\nKaty Perry casts ballot for Harris\nKaty Perry, who is set to appear at a Harris rally tonight in Pennsylvania, posted on X and Instagram that she's officially filled out her ballot and voted for the vice president.\nThe pop star shared what appeared to be a throwback video of the two when Harris was senator, saying, \"She's going to be, well ...\" before Harris responds \"I'm just a fan!\"\nAnother image in the carousel featured Perry's pup Nugget with an \"I voted\" sticker on her head. Perry ended the short social media post by encouraging her followers to vote.\nTrump threatens to impose new 25% tariff on Mexican imports\nTrump said he would impose a 25% tariff on all Mexican imports unless the country enacts stricter border regulations.\nIf Mexican leaders “don’t stop this onslaught of criminals and drugs coming into our country, I’m going to immediately impose a 25% tariff on everything they send in to the United States of America,” the Republican presidential nominee said at his first rally of the day in Raleigh, North Carolina.\nHe added that it was the first time he had announced the proposal, though for months, a central plank of his economic platform has been a hard-line approach to tariff policy. Trump has floated a 20% tariff rate on all imports from all countries with an especially high 60% rate on China.\nEconomists and Wall Street analysts view Trump’s hyperprotectionist trade policy as a potential threat to America’s inflation recovery, just as consumer prices have begun to cool from their pandemic-era spikes. In turn, the Harris campaign has branded the tariff plans as the “Trump sales tax.”\nWhat does Trump's Election Day look like?\nTrump will vote in person along his his wife, Melania Trump, sometime tomorrow morning. He will then call into a few \"tele-rallies\" from Mar-a-Lago, according to a source familiar with the planning.\nThe former president plans to spend the late afternoon and early evening at Mar-a-Lago with a tight-knit circle of advisers, friends and donors, according to another source familiar with the plans.\nThe former president plans to host a dinner at Mar-a-Lago for club members and top donors, according to a source who received an invitation.\nTrump will eventually go to the Palm Beach County Convention Center later in the evening, when the results are better known, according to the second source familiar with this plans.\nJason Miller, a Trump campaign senior adviser, said the former president would declare victory when his team believes he has hit the 270 threshold in the Electoral College.\nVance posts 'make six packs great again'\nIn a post on X, Vance drew a comparison between a normal sized six pack of beer and the display at the World's Largest Six Pack in La Crosse, Wisconsin, aiming to make the point that under Trump, life for Americans is better.\n\"This is a six pack under the leadership of Kamala Harris,\" he said holding a six pack of a beer. He then pointed to the large tanks, saying \"This is a six pack under the leadership of Donald J. Trump. Let's make America great again.\"\nThe World's Largest Six Pack site in Wisconsin showcases various brewery tanks that appear like a six pack of beer.\nTrump falsely claims Harris is inactive on the trail 'every other day' while he's gone 62 days straight\nTrump falsely claimed at a morning rally in Raleigh, North Carolina, today that Harris has been inactive on the campaign trail \"every other day\" and claimed he's been campaigning for more than two months straight.\n\"You know, I've gone through 62 days without a day off,\" Trump told his supporters in the key battleground state during one of four rallies he's scheduled to hold today.\n\"You know what? She takes a day off every other day,\" he added.\nThat claim was false, however, as Harris has been holding near-daily events over the last few weeks, sometimes multiple events a day.\nTrump, for his part, has not campaigned for 62 days in a row. NBC News identified several days in September when the former president had neither a public campaign event nor a fundraising event and one day in October in which events were canceled because of Hurricane Milton.\nTrump campaign spokesperson Steven Cheung argued that on some of the dates in September, the former president held telerallies, in addition to participating in a podcast and a town hall.\nNBC News also reached out to the Harris campaign for comment.\nHarris andTrump are making their final pitches to undecided voters ahead of Election Day. NBC News’ Vaughn Hillyard, Allie Raffa, Maura Barrett, and Chuck Todd break down the latest developments from both campaigns as the race to the White House nears its end.\nMegyn Kelly says she will speak at Trump's final Pennsylvania rally\nConservative pundit Megyn Kelly said today on her show that she will attend Trump's rally in Pittsburgh — the last Pennsylvania rally of his campaign — to speak about why she's voting for him.\n\"Over the weekend, we got an invitation that we never really expected to get, and that was from Team Trump, to show up tonight in Pittsburgh, Pennsylvania, and for yours truly to make some remarks on the president's behalf or really, more accurately, just to explain why I'm voting for him,\" she said. \"And I said yes.\"\nKelly, who hosts one of the internet's most popular podcasts, has also emerged in recent years as one of his most vocal and ardent supporters. Her appearance also comes as Trump's campaign continues to struggle to attract women voters.\nArizona voters talk about Trump's plan to deport migrants\nSix Harris and Trump supporters asked by NBC News about his plan to deport millions of undocumented immigrants said they were against the policy, with the exception of one of the Trump supporters who said she was open to the idea.\n“That might be a little radical, but I’m all for closing the border,” said Patricia Lam, a gallery owner. “I don’t know how they’re going to expel them, but it might be a good idea because it’s affecting a lot of people,” she added.\nNed McCarthy, a Trump supporter, said undocumented immigrants who commit a crime apart from crossing the border illegally should be deported, but added, “I’m cool with them putting a program together that they could pay a fine, pay their back taxes and stay.”\nSandra Cano-Bravo, an activist and banker who is supporting Harris, had a different view.\n“He is instilling the oldest playbook of a tyrant — you know, instill fear, confusion, chaos, and then conquer,\" she said. \"So here in Arizona, we did not turn a purple state by chance. We’ve worked at it, against Jan Brewer, against Sheriff Arpaio, against all the anti immigration legislation,\" referring to the former governor and the former Maricopa County sheriff who was known for his harsh rhetoric on illegal immigration and later ran unsuccessfully for mayor in his hometown.\nPete Buttigieg appears on popular YouTube channel to court undecided Michigan voters — and changes their minds\nIn a video on the YouTube channel Jubilee, Transportation Secretary Pete Buttigieg attempted to convince 25 undecided Michigan voters to cast their ballots for Harris on Tuesday.\nJubilee produces videos of people with varying political beliefs, lifestyle preferences, ethnic backgrounds, occupations, and other characteristics confronting each other about their differences.\nButtigieg was featured in an episode of \"Surrounded,\" a series that puts people in a hot seat to debate a group of people encircling them. Buttigieg presented four claims to the voters, who then had the opportunity to question him about his statements.\nButtigieg argued that Harris is running to \"make your life better\" whereas Trump was running \"for himself.\" He also said that the economy would be better, that Americans would have more rights, and that crime would decrease under Harris.\n\"If you're skeptical of [Trump] and you're willing to give [Harris] a chance, I'm urging you not just to withhold your vote from him, but to use your power to make sure that she becomes the next president of the United States,” Buttigieg said.\nThe undecided voters shared how they were planning on voting at the end of the video. Prior to their conversation with Buttigieg, six were leaning toward Harris, four were leaning toward Trump, five were leaning third party and 11 were leaning toward no vote at all.\nAfter speaking with Buttigieg, 12 participants said they were voting for Harris, five said they were voting for Trump, six said they were voting third party and three said they were not voting.\nPhotos: Headgear is an active battlefront in final days of campaign\nThe signature red MAGA hat was the opening salvo in the battle for headgear supremacy. The Harris campaign countered with the camo hat, but the creative juices are still flowing for supporters of both candidates — and the competition is only heating up in the final days of the campaign.\nTrump ad promising American comeback uses overseas images\nA Trump campaign ad declaring America can make a comeback under Donald Trump relies on images taken overseas. The ad and the links to the overseas images were shared with NBC News by a strategist who opposes Trump.\nIn a section saying that Americans’ “values were labeled shameful,” the ad shows an image inside a German church from 2012, according to Getty Images, which sells the photo.\nAs the speaker begins the line, “And we’re wondering if America can make a comeback,” the ad shows a video clip from Thailand of a model dressed as a construction worker in 2021, according to Getty Images.\nAnother section saying Americans have “surrendered” their paychecks shows a grocery cart in a parking lot in Thailand in 2020, according to the information on istockphoto.com where that clip is available for sale.\nTrump supporters in Ohio speak to voters on last day of early voting\nEnergy was high on the last day of early voting in Columbus, Ohio.\nMeredith Freedhoff, the chairwoman of the Franklin County Republican Party, spent yesterday afternoon at the Board of Elections with other members of her party passing out cards with information about the Republican ticket to voters.\n“I just can’t believe politics in the U.S. right now,” Freedhoff said. “I see the division and I see the anger and the emotional response, and I wish that we could get that out of the equation and just get back to talking about issues and what people want and what they need.”\nFreedhoff, who voted for Trump, said the division in American politics is of high concern, and that increased bipartisanship could result in progress on voters’ top issues.\n“If we all work together as a country, we could do so much better than dividing like we are over issues that probably would never affect us,” she said.\nLisa Chaffee, secretary of the Franklin County Republican Party, was also at the Board of Elections to witness the large number of voters at the polls.\n“No matter what side of the aisle you’re on, the right to vote is a very precious thing, and to see so many people taking part of that, it’s an amazing day,” she said.\nChaffee, a single mother working two jobs, said she voted for Trump in hopes that he would address her concerns about inflation.\n“People can’t afford the cost of inflation, the cost of goods,” she said. “We’re going to make this country great again, and there is absolutely nothing wrong with putting Americans first.”\nThousands of Pennsylvania ballot applications from overseas voters targeted in 'bad-faith' challenges\nA \"coordinated effort\" was launched across 14 Pennsylvania counties through the weekend challenging about 4,000 mail ballot applications, mainly from overseas voters, state officials said today.\nThe Pennsylvania Department of State described the action as \"several bad-faith mass challenges,\" and they appeared to be \"coordinated efforts to undermine confidence in the Nov. 5 election\" by targeting overseas voters who generally are permitted to vote in federal elections.\nOverseas voters can include military members and U.S. citizens living abroad who are uncertain when they will return. The Uniformed and Overseas Citizens Absentee Voting Act of 1986 allows certain groups of citizens to register and vote absentee in elections for federal offices.\nThe issue in Pennsylvania has been resolved in at least one county — Chester County, located outside of Philadelphia, which has more registered Democrats than Republicans . There, the local Board of Elections dismissed all of the more than 200 challenges after hearing hours of testimony, Department of State spokesman Matt Heckel said.\n\"This was a victory for Pennsylvania voters and the Department is confident that all other similar challenges deserve to be likewise dismissed,\" he said in an email.\nAccording to The Philadelphia Inquirer, the effort in Chester County was lodged by a resident who told the election board she was working with the group PA Fair Elections, whose research has fueled right-wing activists. But the newspaper reported that the group has denied being part of the challenges.\nThe American Civil Liberties Union of Pennsylvania has sent a letter to all of the state's counties asking them to reject related challenges \"so as to avoid unnecessary litigation and expense.\"\nMusk’s lawyer: Million-dollar giveaway isn’t a contest, it’s a job\nElon Musk’s million-dollar voter giveaway isn’t a lottery, it’s actually a job, his lawyers said in a Pennsylvania courtroom today.\nMusk and his America PAC were sued last month by Philadelphia District Attorney Larry Krasner, who alleged that the super PAC's million-dollar giveaway is an illegal lottery. Musk said Oct. 19 announcing the giveaway for registered voters who signed a PAC pledge of support to the Constitution that his PAC would choose winners “randomly” each day through Nov. 5.\nBut in a hearing this morning, attorney Chris Gober said winners aren’t determined by chance. The PAC picks winners who will serve as an effective spokesperson, and they then “earn” a million dollars, Gober said.\nThe admission could have legal implications elsewhere: Krasner’s suit said “if their scheme actually did not involve a chance or random selection of winners,” then they “would be admitting to acting deceptively and in violation of the Commonwealth’s consumer protection law.”\nDonald Trump Jr. spreads election falsehoods about Democrats\nDonald Trump Jr. urged his father's followers to get out to the polls tomorrow by baselessly saying votes cast by mail or counted late are fraudulent.\nHe told attendees at a rally in Raleigh, North Carolina, that if \"we win decisively, we stop them from playing the games where they drag it out,\" suggesting, in an oft-repeated falsehood that votes by mail or counted late, often in large urban areas, are somehow not legitimate.\n\"So if we win decisively tomorrow, you don’t give them a week to find that magical truck filled with ballots. Right?\" the former president's son said. \"No one knows where they came from but — take back your country America.\"\nMother-daughter duo heads to polls in Ohio to vote early\nLandy Twum had already cast her ballot but she made the trip out to the Franklin County Board of Elections to support one of her four daughters, Mikia Lewis, through the process.\n“I already came and voted, but it was a great opportunity for me to bring my second-born to get an opportunity to vote,” she said.\nTwum added that the economy is a top concern this election season.\n“This inflation has really taken us to the other side,\" she said. \"It’s a struggle even with as much money as I’m making to provide for me and my girls. So I don’t think we can sustain another four years of Trump.”\nLewis, 22, a first-time voter, said seeing Harris be elected would mean a lot to her.\n“It’s like seeing myself in office, another Black woman,” she said.\nCardi B blasts Elon Musk for calling her a Harris 'puppet'\nRapper Cardi B hit back at a claim from tech billionaire Elon Musk that she is a \"another puppet\" for the Harris campaign.\n\"I’m a daughter of two immigrant parents that had to work their ass off to provide for me! \" she wrote in a post on X on Saturday, after joining Harris for her rally in Milwaukee. \"I’m a product of welfare, I’m a product of section 8, I’m a product of poverty and I’m a product of what happens when the system is set up against you….But you don’t know nothing about that. You don’t know not one thing about the American struggle.\"\nMusk has become one of the former president's biggest donors and supporters. He's come under scrutiny in the last week for his super PAC’s $1 million daily giveaways to registered voters in swing states.\nIn recent months, Musk has also turned his social media platform, X (formerly Twitter), into an echo chamber amplifying right-leaning causes and Trump’s electoral campaign. In her post, Cardi B called on Musk to \"fix\" her algorithm.\nArizonans say they can't wait for the political ads to stop\nNBC News interviewed Trump and Harris supporters from Arizona about what it’s like being bombarded with TV, digital, mail and text message ads for the campaigns — which amounted to almost a billion dollars' worth of advertising for races across the country in the last week alone.\n“I’m dying for it to be over. I can’t wait,” said Ned McCarthy, a 70-year-old Trump supporter, whose feelings were mirrored by the others NBC News interviewed.\n\"It’s the mail, the TV commercials. It’s ridiculous how much they’re putting into it,\" McCarthy added. He lamented what all that money could have accomplished if it had been put \"towards something good.\"\nPatricia Lam, a Trump supporter, said, \"I think they’re wasting too much money, and I think they should have given half of it to veterans that are homeless on the street instead of people on the border.\"\nLala Johnson, 24, who supports Harris, said, “I’m sick of getting text messages every day people blowing up my phone.\"\n“Inundated, inundated, but it’s to be expected. I mean, unfortunately, politics has turned into money, but we have to play the game,” said Sandra Cano-Bravo, a banker who plans to vote for Harris.\n“I am so done with the political advertising,” said Diana Bejarano-Figueroa, 55, a Harris supporter. She added, \"I am hoping and praying that the text messages stop, that the phone calls stop, that the commercials stop, that all of it stops.\"\nNikki Haley pens WSJ op-ed saying her support for Trump is 'an easy call'\nGiven former South Carolina Gov. Nikki Haley’s lack of physical presence on the Trump campaign trail — and her consistent drumbeat of criticism of the way he and the party are speaking to women voters — it’s notable that she put her pro-Trump stance in written form for voters in a Wall Street Journal op-ed.\n“I don’t agree with Mr. Trump 100% of the time. But I do agree with him most of the time, and I disagree with Ms. Harris nearly all the time,\" she wrote in the op-ed, which was published yesterday. \"That makes this an easy call.\"\nHaley, who served as Trump's ambassador to the United Nations, delved into the cost of living and national security — that latter being an area of divergence between her and Trump when she was running against him for the GOP nomination. She backed Ukraine; Trump waffled on the war. She was unequivocal about Putin as an adversary; Trump has never been very clear.\nIn the op-ed, she allowed for the likelihood that they’ll disagree again.\n“Will Mr. Trump do some things I don’t like in a second term? I’m sure he will,” Haley wrote “If that was the question before voters, then I imagine Mr. Trump would lose. But that isn’t the question in any election.”\nNBC’s Steve Kornacki joins \"TODAY\" to break down the final national NBC poll that shows a dead heat between Harris and Trump, the latest Iowa poll showing a new lead by Harris that could symbolize a shift from voters in a state that voted dominantly red in the last two elections, and how the gender gap could decide the 2024 election.\nEarly voting comes to an end in Franklin County, Ohio, breaking records\nThe Franklin County Board of Elections, the sole early voting place in Columbus, Ohio, closed late last evening after holding four hours of polling from 1 p.m. to 5 p.m.\nLines were long, with some voters willing to wait up to three hours to cast their ballots. Others told NBC they would not wait in line but planned to head to their polling site tomorrow.\nPolls in Franklin County are closed today. As of 2 p.m. yesterday, early in-person voting hit an all-time high record of more than 123,000 voters, said Aaron Sellers, the board's spokesman.\nInside NBC News’ Decision Desk: When will we know who won the presidential race?\nAmericans have two big questions as they head into another election with a deeply divided electorate: who will win and when will they know it?\nIn 2020, election week replaced election night: Joe Biden wasn’t declared the winner until Saturday. This year, it could go either way. It may take as long as a week for the NBC News Decision Desk to project a presidential winner, or it could happen as early as Wednesday, even by Wednesday morning.\nThe truth is the Decision Desk cannot know until election night which scenario will unfold, regardless of how carefully we have analyzed the polls, early vote and other election-related data. The answer depends not only on how states count their votes, but also on the unknowable factor of how close the margins will be.\nOne thing is clear: The days of projecting a winner on election night itself are almost certainly over.\nProjecting a presidential winner as early as Wednesday would require that the key battleground states, particularly Pennsylvania, are not essentially tied. There would need to be a large enough spread between the first and second place to be able to project a winner.\nRaces that are nearly tied, such as the presidential race in Georgia and Arizona in 2020 (Joe Biden’s winning margins in these states were 11,779 and 10,457 votes, respectively), require essentially all the votes to be counted before the NBC News Decision Desk can project a winner. This can take days.\nBut let’s go through the battleground states where Wednesday calls are at least possible.\nArizona voters talk about what it would mean to elect the first female president\nNBC News interviewed four Democrats and one Republican from Arizona about what electing the country’s first female president would mean to them.\n“It would be historic. It would be that every little girl can look up and see and see a woman as president, as a leader of the free world, and say, I can be president of the United States of America,” said Sandra Cano-Bravo, a Democrat from Phoenix.\nDiana Bejarano-Figueroa, a Democrat who works in marketing, said, “To see a woman be the president of the United States would be amazing. To see a woman of color be the president of the United States would be tremendously amazing. I would be so overjoyed.\"\nLala Johnson, a Democrat who recently moved to Phoenix from Los Angeles, said, \"Crazy how it’s not normal for us already, how a lot of people, a lot of different countries, have already elected female presidents or female rulers, and we haven’t yet. So I feel like it’s going to make a huge difference for women.”\nPatricia Lam, a Republican gallery owner, said the gender issue didn't matter to her.\n\"I'd rather have someone smart that understands the economy and business, because I don’t think she’s smart enough, and she doesn’t even know the difference between giving people $25,000 to help their small business or a write-off,\" Lam said. \"She doesn’t understand business or economy. So I think she’s going to be really bad.\"\nDNC rolling out 'I Will Vote' mobile billboards as part of $7M campaign\nThe Democratic National Committee plans to deploy mobile billboards in neighborhoods across the key battleground states as part of a final push to get voters to the polls.\nThe billboard campaign caps off the party committee's $7 million paid media investment during this cycle, according to a news release.\n\"The DNC's multimillion-dollar and multimedia 'I Will Vote' campaign is a testament to Democrats’ commitment to and investment in the many communities that make up our strong coalition of voters,\" DNC Chair Jaime Harrison said.\n\"Throughout this campaign, Democrats have worked with diverse vendors and talent that are reflective of our values as a party and the communities that we are reaching with the campaign,\" he added.\nDuring a weekend battleground blitz, Trump said that he should have never left the White House despite his 2020 campaign loss. Referring to the bulletproof glass now that now surrounds him at his rallies, he said anyone who might want to shoot him would first have to fire through the reporters covering him. “I wouldn’t mind that,” he said. NBC’s Garrett Haake reports for \"TODAY.\"\nHakeem Jeffries says Republicans would 'take a blow torch' to social safety nets\nHouse Minority Leader Hakeem Jeffries, D-N.Y., said Republicans would \"take a blow torch\" to Social Security, Medicare and the Affordable Care Act if they win both chambers of Congress.\nDemocrats, on the other hand, \"will put the American people first,\" he said in an interview on ABC's \"Good Morning America.\"\nIf the Democrats retake the House, Jeffries would likely be the next speaker.\nJeffries' comments came as House Speaker Mike Johnson, R-La., faces scrutiny for remarks he made about the ACA at an event in Pennsylvania last week.\nIn a video obtained and first reported by NBC News, Johnson can be seen taking a dig at Obamacare and telling a crowd there would be \"massive\" health care changes in the U.S. if Trump wins the White House\n\"When I say we're going to have a very aggressive first 100 days agenda, we got a lot of things still on the table,\" the Louisiana lawmaker said.\nHarris and Democratic congressional candidates are campaigning on protecting and expanding the ACA. Trump, who repeatedly tried and failed to gut Obamacare during his term in the Oval Office, has called for reopening the issue.\nTrump has promised to replace the landmark health care without providing clear specifics, saying at his debate with Harris that he has \"concepts of a plan.\"\nIn final day, Trump looking to break 'blue wall' and light up Sun Belt\nTrump will spend his final full day of campaigning in the \"blue wall\" states of Pennsylvania and Michigan and the Sun Belt battlegrounds of Georgia and North Carolina.\nTrump has appearances set for Raleigh this morning, Reading this afternoon, Pittsburgh in the early evening before wrapping up in Grand Rapids.\nVance has an equally busy schedule with stops in Wisconsin, Michigan, Georgia and Pennsylvania.\nBig issues, surprise races and ticket-splitting: 5 things to watch in the battle for Congress\nThe close and uncertain battle for the White House has taken center stage this year. But Congress will play a major role in implementing (or blocking) the next president’s agenda — and the fight for the legislative branch is coming down to the wire.\nBoth parties only need to net a handful of seats to flip each chamber, with Republicans currently controlling the House and Democrats controlling the Senate with slim majorities.\nSenate Republicans need a net gain of two seats to win the majority outright or just one seat if Trump also wins the White House, since the vice president casts tie-breaking votes in the Senate.\nIn the House, Democrats need to net just four seats to take control of the chamber, and it is possible they could win the House even if Harris loses the White House. Control of the House could also be unclear for days, with several battleground seats in slow-counting California.\nAs the battle for Congress comes to a close, here are five things to watch.\nHarris is wrapping up her campaign with a rally in Pennsylvania featuring Lady Gaga and Ricky Martin, among others. Harris’ message in the closing days of the election included remarks on the Israel-Hamas war and a message urging voters to ignore recent indications by Trump that he might prematurely claim victory on election night like he did in 2020. NBC’s Peter Alexander reports for \"TODAY.\"\nWhat we’ve learned from the consistent poll numbers shaping the 2024 election\nLet’s get one thing straight: The polls can’t tell us who is going to win the presidential election. Or which party will control Congress. Or who will win a particular state.\nThe race is that close and uncertain, and polls in previous election cycles have been that far off the mark.\nWith those caveats out of the way, let’s not ignore the consistent storylines in the polls that have defined the political forces shaping the election.\nThey don’t tell us who’s going to win — but we’ll know that soon enough. What the polls can do already is help explain the forces that shaped this election and how either Trump or Harris could emerge victorious.\nTrump’s loose-cannon rallies clash with Harris’ cautious endgame\nTrump’s campaign spent the final Sunday of the 2024 election on all-too-familiar turf: responding to the reaction to the candidate.\nSpeaking at a rally outside Lancaster in the crucial swing state of Pennsylvania, Trump noted the bulletproof glass that his security team has used to protect him since he was shot in the ear this year in the western part of the state.\n“To get me, somebody would have to shoot through the fake news,” he said. “And I don’t mind that so much.”\nTrump, who had criticized the media earlier in his remarks, drew immediate backlash for the violent rhetoric. His spokesman Steven Cheung quickly fired off a statement insisting that Trump was arguing the media should be shielded and that he was “looking out for their welfare, far more than his own!”\nHarris spends last day of the campaign blitzing across Pennsylvania\nHarris will spend the last day before Election Day campaigning in cities across Pennsylvania, hitting Scranton, Allentown, Reading, Pittsburgh and Philadelphia, according to the campaign.\nDuring her campaign blitz, she will appear alongside Democratic stars such as Rep. Alexandria Ocasio-Cortez of New York and Pennsylvania Gov. Josh Shapiro. She'll also be joined by Lady Gaga, Katy Perry, Andra Day, Fat Joe, Oprah Winfrey and other celebrities.\nHarris' stops in Pittsburgh and Philadelphia are scheduled to feature concert performances.\nDemocrats flipped Pennsylvania blue in 2020, and it is expected to be a closely contested battleground state tomorrow.\nDNC to highlight Trump ally's comments about Puerto Rico outside Trump rally\nThe Democratic National Committee will use a bilingual mobile billboard advertisement today to highlight a Trump ally's racist joke about Puerto Rico, and the ad will target the Pennsylvania city where Trump is set to appear.\nThe billboard, detailed first to NBC News, will run a video of Trump praising his rally at Madison Square Garden and the racist joke about Puerto Rico by the comedian who performed, as well as TV clips of the fallout.\n\"Puerto Rico deserves respect,\" the final image of the video reads. \"Not Trump's racism and neglect.\"\nThe DNC wants to \"ensure voters know how Trump views the Puerto Rican and Latino community,\" said a release from DNC Hispanic Media Director Marco Frieri.\n\"We cannot forget that Trump did not just give a platform to a man who called Puerto Rico a 'floating island of garbage,' but has himself said that he thinks immigrants are 'poisoning the blood of our country,'\" Frieri added.\nTrump will rally this afternoon in Reading, Pennsylvania, about 67% of residents are Hispanic or Latino, according to census figures from 2020.\nTrump campaign senior adviser Danielle Alvarez has said the joke about Puerto Rico \"does not reflect the views of President Trump or the campaign.\"",
  "word_count": 17333,
  "scraped_at": "2026-02-14T12:42:47.594522"
}