{
  "article_id": "ce1bf9cb79d2",
  "url": "https://www.bbc.com/sport/rugby-union/articles/cz9jvj1ne3zo",
  "title": "Women Rugby World Cup : Final predictions - will England or Canada win ? ",
  "date": "20250926T184500Z",
  "domain": "bbc.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "World Cup final predictions - will England win?\n- Published\nEngland face Canada at Twickenham on Saturday in the Women's Rugby World Cup final.\nThe Red Roses are on a record 32-game winning run and are seeking to win the World Cup for a third time - and for the first since beating Canada in the 2014 final.\nCanada are 95% of the way towards their million-dollar fundraising goal entitled 'Mission: Win Rugby World Cup' - which was set up to help them compete with the world's best-funded teams.\nJohn Mitchell's England, ranked number one in the world, are favourites to win the tournament and will have the support of the majority of the 82,000 fans at a sold-out Twickenham.\nHowever, they will face a side who are arguably in better form and who comfortably dispatched holders New Zealand in the semi-finals.\nWill it be England captain Zoe Aldcroft or Canada skipper Alex Tessier who lifts the trophy?\nBBC commentators Claire Thomas and Sara Orchard give their views, with predictions and analysis also coming from 2014 World Cup winners Kat Merchant and Maggie Alphonsi, former England wing Ugo Monye and former Canada international Lesley McKenzie.\nWomen's Rugby World Cup final: Canada v England\nSaturday, 27 September at 16:00 BST\nTwickenham\nWatch live on BBC One & iPlayer from 15:00 BST\nWhere will the game be won?\nEngland's pack v Canada's backs.\nThe Red Roses' dangerous backline failed to fully click in the semi-final win over France, relying on two individual scores from full-back Ellie Kildunne.\nIt was the pack and replacements who stepped up in the second half to help secure a final spot, whereas Canada's backs showed their class by carving up the Black Ferns.\nMcKenzie: \"Canada showed last week they could dispatch the world's best backline and arguably they now have the world's best backline.\n\"Canada have a back three that really like to crash and bang. They love it. How will England show up against that?\n\"I think it could be a determining factor this weekend.\"\nMerchant: \"England have the best pack in the world. Canada have the second. It is pretty close.\n\"It is about how you get those backlines functioning.\"\nOrchard: \"England will want a set-piece game. They will be craving scrums and line-outs. They will want to use their kicking game. Canada won't. They like to run.\n\"Canada have conceded seven tries this tournament. England have conceded six. Those are the type of stats to hang your hat on as a team.\n\"This is going to be an incredible defensive match-up. Sometimes finals can be very ugly games and not always pretty games with loads of tries.\"\nMonye: \"How deep can this Canadian starting XV go? How many minutes will they have to play on Saturday? Especially in the pack, those replacements are England's super strength. I don't think Canada can go as long or as deep.\n\"They can't afford to let the Red Roses' 'bomb squad' [replacements] come on and take it up a gear. It will be such an important aspect of the game.\"\n'The performance of a lifetime' - stars to watch\nEngland full-back Kildunne and Canada second row Sophie de Goede are the big stars of their respective teams, but who else might have a key role in deciding the winners?\nRed Roses centre Meg Jones, who was not involved in the World Cup final defeat by New Zealand in 2022, was nominated for world rugby player of the year on Monday and is in exceptional form.\nCanada's lethal backs Alysha Corrigan and Florence Symonds are also players to keep an eye on.\nOrchard: \"I remember when Meg Jones announced she was coming back from sevens to 15s [in 2021] and I thought 'that is the missing part of the puzzle'.\n\"She is by her nomination one of the best rugby players on the planet. She can do everything. I think we will see the performance of a lifetime come Saturday by Jones.\n\"She is a player that rises to the occasion on the biggest stage.\"\nMcKenzie: \"One of the key players in the Canada backline is centre Florence Symonds. She allows those wingers to play as abrasively.\n\"She has got great hand speed and is quite physical. Very skilled and balanced.\n\"Alysha Corrigan on the right wing is unsung in this tournament. She is ferocious in the collision.\"\nMonye: \"I have thought about what would happen if Jones went down injured. She is so integral to the England team.\n\"She has been nominated as well for all the stuff she does in defence. That is going to be massive come Saturday.\"\nChasing greatness through grief - England's warrior queen\n- Published27 September 2025\nDahl, Torres and 'Keighley Queens' - the making of Kildunne\n- Published27 September 2025\nThe battles England need to win in World Cup final\n- Published25 September 2025\nWhat makes Canada so good and will they cause World Cup upset?\n- Published23 September 2025\nFinal predictions\nAlphonsi: \"England will win but it is going to be close. I am going to say by two points.\"\nMerchant: \"England win. They've been dominant for so long. Last year they were putting in amazing performances and everything was clicking.\n\"Watching the WXV tournament, there wasn't a single team in the world that could beat them on form. The more you've seen teams show up this World Cup - like Canada - the more you get worried.\"\nOrchard: \"By hook or by crook it will be ugly, but England will scrap themselves over the line.\n\"John Mitchell has had this England team for a number of campaigns. This is also his fifth World Cup as a coach - four with different men's sides.\n\"He was hired to help manage the occasion and if they don't come out with the trophy at the end there has got to be a big review and questions asked about the approach.\n\"The amount of money the RFU (Rugby Football Union) have pumped into women's rugby - they should be winning a World Cup.\"\nMcKenzie: \"Canada. We are aware of the speed and intensity Canada will bring and they will start strongly as they have done throughout the tournament.\n\"England have not started fast. That is going to be a telling first 20 minutes, but the back 20 minutes are going to be the most impactful.\"\nMonye: \"It will be an open game. When it is 50-50, as an Englishman, I have to say the Red Roses win.\"\nThomas: \"Canada. They have played much better rugby than England for the past five weeks and I think they have got such a grounded coach in Kevin Rouet and a strong connection.\n\"I have been convinced by Canada and I haven't been by England.\"",
  "word_count": 1127,
  "scraped_at": "2026-02-14T12:36:15.694367"
}