{
  "article_id": "ce2bce654e8b",
  "url": "https://www.news4jax.com/news/local/2024/09/10/news4jax-crime-and-safety-analyst-discusses-tyreek-hill-traffic-stop/",
  "title": "News4JAX Crime and Safety Analyst discusses Tyreek Hill traffic stop",
  "date": "20240911T001500Z",
  "domain": "news4jax.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "In an unprecedented move, the Miami-Dade police have released five body camera angles capturing the moments when Tyreek Hill was detained.\nMiami Dolphins star wide receiver Tyreek Hill was pulled from his sports car by Miami-Dade County police officers outside Hard Rock Stadium during a traffic stop before the team’s game on Sunday, triggering a national debate on whether the treatment was justified.\nNews4JAX Crime and Safety Analyst Tom Hackney reviewed the video on Tuesday.\n“It is certainly not a very good way to begin that encounter with the officer,” Hackney said.\nRelated: Dolphins star Tyreek Hill had an altercation with police. Here’s what we know\nLess than 90 seconds after the officer got off his bike, Tyreek Hill was being put on the asphalt.\n“These are legitimate, potentially legitimate orders for him to get out of the car. It’s a lawful order for him to get out of the car. But also, on Tyreek Hill’s part, you got to give me a second to follow your command,” Hackney said.\nAt a post-game press conference Sunday, Hill says he was being pulled over for allegedly speeding.\nIn the body cam video, you can hear different accounts of the speed he was driving about 15 to 20 over the speed limit which was 40 miles per hour. We asked Hackney his thoughts on the incident and whether Hill should have been detained.\nHackney is a former law enforcement officer of more than 30 years.\n“Looking at myself in that situation, you need to control that situation. You see, it’s not going anywhere, pulling him out of the car, right then, you know, that’s a judgment call. I’m sure that officer is questioning his judgment at this particular time, because, you know, they’re pulled out of the line of duty, put on administrative leave,” Hackney said.\nEventually, two other people show up at the scene. One of them was Jonnu Smith, another Dolphins player, and the other was Calais Campbell, a former Jaguar and current Dolphin. Whether the officer knew it at the time, this was a high-profile traffic stop.\nHackney said no one won in this exchange.\n“Generally speaking, you get some of these officers, men and women, black and white, who have this Superman’s Cape mentality, and don’t step on Superman’s cape,” he said.\n“There’s a bit of a Superman mentality that you can see with him (Tyreek) you know, I get it, you know, he’s a multi-millionaire who’s a starting football player for a very good football team on game day. So, you know, you just got all these things mixed into the mixed into the pot there that it’s a recipe for it going south,” he said.",
  "word_count": 449,
  "scraped_at": "2026-02-14T14:15:07.149284"
}