{
  "article_id": "ce4638dd0dca",
  "url": "https://apnews.com/article/jamaica-womens-world-cup-bunny-shaw-c5024acf26bf9a014f334428ad5e2024",
  "title": "Jamaica World Cup players boycott tournament over disagreements with their federation",
  "date": "20231025T221500Z",
  "domain": "apnews.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Jamaica World Cup players boycott tournament over disagreements with their federation\nJamaica World Cup players boycott tournament over disagreements with their federation\nPlayers for the Jamaican women’s national team say they are boycotting a pair of tournament matches because of “constant mistreatment” by their soccer federation.\nKhadija “Bunny” Shaw was among those who posted a statement to Instagram this past weekend that said players from the country’s Women’s World Cup team would not take part in this week’s CONCACAF Women’s Gold Cup qualifiers.\nInterim coach Xavier Gilbert took a hastily assembled squad to play in Jamaica’s qualifier against Panama on Wednesday. Jamaica fell 2-1 in Panama. A second match against Guatemala in Kingston, Jamaica, was set for Sunday.\n“While this has been one of the hardest decisions we have had to make, we feel it is necessary to take such a drastic stance to put an end to the constant mistreatment we receive from the Jamaica Football Federation,” the players’ statement said.\nThe players said they had not received “full and correct” payments for their play at the World Cup this past summer in Australia and New Zealand. Jamaica advanced to the Round of 16 for the first time before falling to Colombia. The players also maintain the federation did not pay numerous bonuses for World Cup qualifying in 2022.\nThe Jamaican Football Federation issued a statement that claimed all of its debts to players for 2022 were settled. The statement said that the only outstanding payment was 20% in FIFA prize money for the World Cup because the players did not specify how the funds should be distributed, but those payments were being processed. The JFF further said it had not yet received the full prize money payment from FIFA.\nFIFA announced before the World Cup that each player participating in the tournament would earn $30,000. The amount rose to $60,000 apiece for teams that advanced out of the group stage. It was unclear whether the Jamaican players had received those payments. Federations also receive FIFA funds for participation in the tournament.\nThe women also noted they were not informed of coaching and other staff changes. Jamaica parted ways with World Cup coach Lorne Donaldson and appointed Gilbert in the interim. Players said they learned that Gilbert was coach on social media three days before they were expected to report for the CONCACAF qualification matches.\n“As always, it is an honor and a privilege to represent Jamaica. It is our job to perform to the best of our ability and put all of our efforts into representing our country, making our fans, loved ones at home and diaspora proud,” the players said. “Due to the current circumstances the Jamaica Football Federation has put us in, we would not be able to do our job.”\nThe tension between the players and the Jamaican federation are long simmering. The players also went to social media to decry what they called subpar support in advance of the World Cup.\nTheir pleas concerning pay and financial support spurred a pair of crowdfunding campaigns to help the team train and pay staff, including one set up by a player’s parent.\nJamaica’s match against Panama on Wednesday was moved from Estadio Universitaro in Penonome to Estadio Rommel Fernandez in Panama City because of protests in the country.\n___\nAP soccer: https://apnews.com/hub/soccer",
  "word_count": 556,
  "scraped_at": "2026-02-14T12:06:59.233278"
}