{
  "article_id": "ce7e0f383fc9",
  "url": "https://www.90min.com/posts/chelsea-fatigue-arsenal-poor-defence-leicester-turnaround-five-questions-wsl-matchday-three-2023-24",
  "title": "Chelsea fatigue , Arsenal poor defence & Leicester turnaround : Five questions ahead of WSL matchday three",
  "date": "20231014T100000Z",
  "domain": "90min.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Chelsea's fatigue, Arsenal's poor defence & Leicester's turnaround: Five questions ahead of WSL matchday three\n- Are Chelsea running on fumes already?\n- Did Arsenal neglect bolstering their defence?\n- Can Leicester challenge the mid-table?\nBy Emily Keogh\nThe 2023/24 WSL is now in full swing and matchday three will provide some tasty fixtures. But while it is still to early in the season to accurately call how clubs will perform in the long-term, there is plenty to discuss ahead of the weekend games.\nAfter last week's yellow card fiasco and last season's top four all sharing points in draws with each other, Leicester and Liverpool occupy the top two places with six points each and 100% records. Manchester United, Chelsea and Manchester City are all not far behind on four points, although Arsenal sit as low as ninth with only one point to show from their opening games.\nThis weekend, the Merseyside derby takes place at Anfield on Sunday, with bragging rights at stake in the first major local rivalry game of the season. Chelsea host West Ham before Aston Villa travel to the Emirates Stadium to ace Arsenal. Manchester United host leaders Leicester. And Bristol City have their biggest challenge since promotion...travelling to Manchester City.\nHere, 90min breaks down some of the big talking points ahead of the games...\nAre Chelsea suffering a World Cup hangover?\nEvery club that sent crucial players to the World Cup are navigating new waters, managing load and minutes after such a tight turnaround since the tournament that ended less than two months ago.\nIn their last two fixtures - a 2-1 win over Spurs and a 1-1 draw with Man City - the champions showed far more cracks than usual. It was slow, plumb and sluggish from the Blues, with fatigue a prominent factor in those performance and squad choices.\nFans have become accustomed to stellar, unrivalled performances from Emma Hayes's team, yet the international summer has provided likely caveats to Chelsea's current lacking form. But there is only so much time before this no longer feels like an adequate excuse as other clubs whose players also travelled to the other side of the world begin to regain form and fitness.\nFacing West Ham on Saturday, the Blues have vast squad depth, but with some of their core XI still feeling fatigued after the World Cup, Chelsea must ensure they have rested and recuperated this week to prevent the Irons from causing an upset.\nDid Arsenal add enough defensive depth in the summer?\nArsenal began their campaign with a loss. A lacklustre performance from the Gunners, made worse by poor defending, allowed Liverpool to sneak a 1-0 win in front of a record WSL crowd. Against Manchester United, they looked far more aggressive and connected, yet dismal defending remained their one major downfall and it cost them two points.\nManager Jonas Eidevall faces torrid waters, despite signing a new three-year contract as issues pepper his backline. The caveats to Arsenal's defensive woes are chalked up to the loss of Rafaelle, who departed the club in the summer, and the Leah Williamson's ACL absence.\nEven introducing World Cup-winning centre-back Laia Codina and the impressive Amanda Ilestedt, the Gunners still need to build a solid defensive unit. It takes time to bed in new signings, but even the centre-back pairing of Jen Beattie and Lotte Wubben-Moy looked uninspiring against Liverpool. United boss Marc Skinner even commented on the lack of mobility Arsenal have at the back.\nLacking a world class shot stopper, the defensive woes also continue in other ways. Arsenal made an ambitious play for Mary Earps in the summer, but United flat out refused. Neither of the current options, Manuela Zinsberger or Sabrina D'Angelo, have started the campaigns well- failing to keep clean sheets and having less than impressive performances between the sticks.\nWith gaps still showing at right-back, centre-back, and in goal, Arsenal perhaps focused too much on strengthening their lethal attack and needed to bolster their defence more ahead of a brutal campaign. Eidevall will need to rectify their shaky start and improve their defences if the Gunners want to be in with a chance of overthrowing reigning champions Chelsea.\nWas Aston Villa's progression sustainable?\nAston Villa have started their campaign entirely opposite to last season. A 4-3 win over Manchester City; 2-0 over Leicester. It is a very different narrative now with consecutive defeats to Manchester United and Liverpool at the beginning of a season when some tipped them to upset the top four.\nHowever, in failing to register a point so far, questions are already being raised over whether Villa's progression last season, jumping from ninth and tenth to fifth, was sustainable.\nWith influential playmaker Kenza Dali out injured, Maz Pacheco recovering from illness, and Kirsty Hanson suspended following a red card on the opening weekend, the reasons for their slow start are vast. But with only 22 games in a season, such a start can be challenging to come back from - Manchester City lost their first two games last season and ran out of opportunities to rectify that.\nSimply put, it is too early in the season to tell if Aston Villa's progression is sustainable. But the success of Carla Ward's masterplan will only be measurable when she has her entire squad fit and operating like a charm. They will not have Hanson back for this weekend - or next - but hopefully Dali and Pacheo may be eligable to return to the lineup.\nPlaying Arsenal, who look less than convincing at it stands, it may be the perfect time to get their campaign up and running with a win.\nHas Willie Kirk turned things around for Leicester?\nNo one could have predicted that two weeks into the campaign, Leicester City, who faced relegation last season after losing all of their first nine games for the second year in a row, would be at the top of the table with more points than any of last season's top six.\nCredit has to go to manager Willie Kirk, who took over the side last November, clumped along the bottom, with little glimmer of hope of retaining their WSL place. Yet, in bolstering the side in January, Kirk managed to steer the Foxes to tenth, seeing them through into this WSL this season.\nTwo games in, Leicester are firing on all cylinders, looking increasingly impressive and putting up significant results against Bristol City and Everton. Five goals from four different players has rectified a major weak point from last season and Kirk's further business in the summer transfer window is proving crucial as three of those goalscorers are new signings.\nIt is looking increasingly like Leicester will be challenging for a mid-table finish, and as long as their sprightly form continues, there is no argument against the possibility of the Foxes finishing multiple higher than previously. But they must knock a point off a top-six side to solidify their run.\nOne thing is certain: Kirk is essential for Leicester's success and has done a stellar job turning a struggling side into an utterly different-looking team. Facing former club Manchester United on Sunday, Kirk has an early opportunity to cause an upset and retain his top-of-the-table standing.\nIs the jump to the WSL too much for Bristol City?\nThe disparity between the top two tiers of women's football in England is stark. Promoted teams often struggle to gain footing in the WSL, especially without the backing of a successful Premier League side. Bristol City were consistent in the WSL after winning promotion in 2017. But that only lasted until 2021, when the Robins trudged back to the second tier.\nTwo games into the campaign, Bristol still need to earn a point. They have lost to Leicester and Tottenham so far. Despite scoring in each, it is apparent that the gap between the teams is large.\nHead coach Lauren Smith has never led a team in the top flight before, posing another argument that perhaps the uncharted waters are even more challenging for the side without a vastly experienced manager at the helm.\nWhilst Bristol have yet to face a top six side, their struggles so far will only deepen as the campaign grows. The Robins face Man City on Sunday before then hosting Arsenal next weekend.\nBristol are well equipped in talented players. Still, the monetary disparity and fact that they have not played in the WSL in two years shows that they might face returning to the Championship unless they can claim vital points off bottom half teams and also try to hold one or two top sides to a draw.",
  "word_count": 1443,
  "scraped_at": "2026-02-14T12:22:17.956733"
}