{
  "article_id": "ce95e2f45e0e",
  "url": "https://www.france24.com/en/live-news/20240628-migrant-fans-breathe-life-into-copa-america",
  "title": "Migrant fans breathe life into Copa America",
  "date": "20240628T230000Z",
  "domain": "france24.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Migrant fans breathe life into Copa America\nHouston (AFP) – Whether it's a sea of yellow-clad Colombia fans, multitudes of green-shirted Mexico supporters or hordes of Venezuelan spectators bedecked in burgundy, migrant fans are providing a raucous, passionate backdrop to the on-field action at the Copa America.\nIssued on:\nFor only the second time in history, South America's continental championship is being held at venues across the United States this year, offering a taste of what North America can expect when the 2026 World Cup is staged in the region in two years' time.\nGleaming, state-of-the-art stadia mostly used to the violent, bone-crunching collisions of the NFL, are instead pulsing to the rhythms of the beautiful game, with migrant fans an integral part of the spectacle.\nAt an eve-of-tournament warm-up game at the Maryland home of the Washington Commanders NFL team, Colombian fans turned a friendly against the United States into a virtual home fixture, roaring on 'Los Cafeteros' to a 5-1 thrashing of the Copa America hosts.\nThose kind of scenes have been replicated across the group phase of the Copa America, with migrant spectators flocking to venues from all corners of the United States.\n\"Thousands of compatriots who have arrived tell me: I come from Florida, I come from New York, Atlanta, from everywhere,\" said Alejandro Quintero, 48, a Colombian fan who has lived in North Carolina for three years.\n'United through soccer'\n\"Everyone can be united through soccer,\" added Quintero, who has sought asylum in the US due to security issues in his homeland. \"These type of events help us to have hope.\"\nIn addition to the 10 teams from South America who usually take part in the Copa America, this year's tournament has been expanded to include six teams from the CONCACAF region -- North America, Central America and the Caribbean.\nMany of the Latin American CONCACAF teams can draw on large pools of support from migrant fans that span several generations in the United States.\n\"I have lived in Houston for two years. Latin Americans put more emotion into Copa America matches,\" said Alex Angulo, a 39-year-old Colombian who lives in the US with his wife and two of his children.\nAngulo is part of a Hispanic population in the United States estimated at around 63.7 million according to 2022 figures, or 19.1% of the total population.\nOutside the Children's Mercy Park stadium in Kansas City, Lourdes Pino was among masses of red-and-white shirted Peru fans enjoying traditional cuisine from the country.\nPino moved to the United States in 2014 \"looking for an opportunity to grow and prosper\". She lives in Charlotte, North Carolina and traveled to watch 'La Blanquirroja' play games in Arlington, Texas and Kansas City.\n\"Having the team here has been one of the biggest emotions; I have postponed my work, everything,\" said Pino, who works in the construction industry.\nBrazil fan Luiz Gustavo says there is a word for the sort of fanaticism demonstrated by migrant fans at the Copa America.\n\"In Portuguese we call it 'saudade' -- a mixture of nostalgia and love,\" said the 30-year-old, who arrived in the United States two years ago and who was among the crowd to watch Brazil's 0-0 draw with Costa Rica in Los Angeles on Monday.\nLatin engine\nFor those involved in club football in the United States, the strong migrant support for Copa America teams comes as little surprise. Major League Soccer executive Alfonso Mondelo says the league's growing attendances have been driven by migrant populations.\n\"The growth of fans in recent years has been incredible and unparalleled in the history of soccer in this country,\" he told AFP. \"This has a lot to do with the Latin community, which embraces soccer as part of its culture.\n\"At least a third of the fans in (MLS) stadiums are of Latin origin. American fans sees that atmosphere of partying, of fun and want to be part of it.\"\nThe success of the United States women's national team, and the arrival of Argentine superstar Lionel Messi at Inter Miami, have also contributed to the growing attendance numbers, Mondelo said.\n\"Many children in the future are going to get hooked on football and will want to be Messi,\" he said.\n© 2024 AFP",
  "word_count": 709,
  "scraped_at": "2026-02-14T12:32:14.085785"
}