{
  "article_id": "ce9b5457f8b4",
  "url": "https://www.nytimes.com/athletic/5581939/2024/06/21/africa-cup-of-nations-2025-dates/",
  "title": "AFCON 2025 to be held in December and January , CAF confirms",
  "date": "20240622T013000Z",
  "domain": "nytimes.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "The 2025 Africa Cup of Nations (AFCON) will take place between December and January, it has been confirmed.\nMorocco will play host to the tournament that will begin on December 21, 2025 and run until January 18, 2026.\nThe Confederation Africaine de Football (CAF) executive committee (Exco) confirmed the scheduling in a release on Friday.\nAdvertisement\nThe Exco also confirmed that the next Women’s AFCON will be held between July 5, 2025 and July 26, 2025, also in Morocco.\nCAF president, Dr Patrice Motsepe, said: “I am confident that the CAF TotalEnergies AFCON Morocco 2025 will be extremely successful and will be the best AFCON in the history of this competition.\n“I am also impressed by the enormous growth of women’s football in Africa and I am expecting the CAF TotalEnergies WAFCON Morocco 2024 to be immensely successful.\n“The announcement of the dates of the CAF TotalEnergies AFCON Morocco 2025 took much longer than expected, as there were complex and at times challenging discussions with various interested parties, in the light of the extensive international and domestic match calendars.\n“CAF is committed to protecting and advancing the interests of African players, playing in football clubs in Europe and worldwide. CAF is also committed to building mutually beneficial relationships with the ECA, UEFA, other football confederations and FIFA.\n“We will continue to make significant progress in developing and ensuring that African football is globally competitive and amongst the best in the world.”\nMorocco, who have not been crowned AFCON champions since 1988, made history by becoming the first African country to reach the World Cup semi-finals in 2022, where they lost to France.\nThe 2024 edition of AFCON was held in the Ivory Coast from January 30 until the final on February 11. The hosts went on to win their third AFCON, beating Nigeria in the final.\nThe 2021 edition of the tournament was also held in the winter months, with Cameroon hosting the tournament between January and February.\nThe last time the tournament was held during the summer was in 2019 when Egypt hosted Africa’s showcase event in June and July.\nGO DEEPER\nAFCON final: Haller's fairytale finish seals glory for Ivory Coast as Osimhen falls short\n(Franck Fife/AFP via Getty Images)",
  "word_count": 372,
  "scraped_at": "2026-02-14T12:32:32.026267"
}