{
  "article_id": "cead2adf12a4",
  "url": "https://www.boston.com/news/local-news/2024/03/07/what-to-know-about-white-stadiums-renovation-after-judge-temporarily-delays-project/",
  "title": "What to know about White Stadium renovation after judge temporarily delays project",
  "date": "20240307T201500Z",
  "domain": "boston.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Newsletter Signup\nStay up to date on all the latest news from Boston.com\nLast year, Boston officials and Boston Unity Soccer Partners announced ambitious plans to renovate White Stadium in Franklin Park and bring a National Women’s Soccer League team back to the city.\nThe idea was revealed with great fanfare from the Wu administration, but was met with deep skepticism by some locals. Last month, the nonprofit Emerald Necklace Conservancy, which serves as a steward of Franklin Park, joined 20 residents in filing a lawsuit to halt the project amid concerns that it would displace members of the local community and “unconstitutionally privatize” public land.\nAfter a hearing this week, a Suffolk County Superior Court judge postponed her decision on an injunction for two weeks. Both sides are being given until the end of next week to present their responses to the hearing, and the judge indicated that she would issue a ruling on March 22.\nAdvertisement:\nHere’s what to know about the project and the ensuing legal battle.\nAll the parties involved appear to agree on one thing: that White Stadium is in desperate need of improvement. It was built in 1945 by the George Robert White Fund, a permanent public charitable trust, to host events and athletic competitions for the Boston Public School system. The stadium fell into disrepair, and a $45 million restoration plan stalled after Mayor Tom Menino left office in 2014.\nUnder Mayor Michelle Wu, the city reassessed the facility in 2023 and issued a request for proposals for a public-private partnership to “reimagine and reinvest” in the stadium. Only one response came in: from an organization called Boston Unity Soccer Partners. The group hopes to bring professional women’s soccer back to Boston. The city’s previous NWSL team, the Breakers, played in four different stadiums between 2001 and 2018. It folded amid financial struggles and poor attendance.\nAdvertisement:\nCity officials say that the resources from a public-private partnership are necessary due to the dire state of the stadium. In total, the city plans to contribute $50 million to the project, while BUSP is adding $30 million, according to the lawsuit.\nBoston Globe Media CEO Linda Henry is an investor in BUSP. Boston.com is part of Boston Globe Media.\nUnder the plan, White Stadium would host about 20 NWSL games and 20 practice sessions annually, from April to November. The stadium would be available for BPS sporting events and a variety of public events like graduation ceremonies, summer camps, fundraisers, and concerts when it is not being used by the pro team.\nWhite Stadium would receive serious upgrades. The entrances, stairs, elevators, and bathrooms would all be improved. Concession stands, a lounge, and a press room would be added. The east grandstand would be completely rebuilt. The existing track would be replaced with a brand-new one. A BPS athletics hub would include strength and conditioning facilities and a “student resource space” with a 50-person classroom. Improved lighting, security features, and a new rooftop are also included in the plans.\n“The Grove,” an adjacent green space, would also be renovated. It would be used for concessions on days that the NWSL team plays, and available for public and private events throughout the rest of the year.\nAdvertisement:\nNo parking would be added to the area, and spectators would use shuttle buses from nearby MBTA stations and remote parking lots on game days.\n“Anyone who’s been to the stadium knows how badly we need to reinvest in it, it’s just unacceptable,” Wu said during an appearance on the “Java with Jimmy” show this week.\nCity officials had anticipated that demolition could begin as soon as spring 2024, but that timeline is now unclear amid community concerns and the lawsuit.\nThose behind the lawsuit allege that the plan violates Article 97 of the Massachusetts Constitution, known as The Public Lands Preservation Act, and the conditions of the George Robert White Fund. They say it would transfer public trust land to private use and exclude members of the public from the site, including BPS teams who currently use the field.\n“The concern is that this site in Franklin Park will no longer be exclusively available to residents of Boston, period, if this project is allowed to go through because it will become a privately run operation of this professional soccer team, instead of being a space available for Boston residents as it always has been,” Edward Colbert, the lead attorney for the plaintiffs, recently told The Boston Globe.\nAdvertisement:\nThe plaintiffs say there is no “realistic” transportation plan for the days when the NWSL team would play, and that the “incredibly fast-moving redevelopment process” resulted in a lack of adequate community input as the plan was being developed.\nThe Emerald Necklace Conservancy and other advocates support using the $50 million in taxpayer funds to renovate the stadium and surrounding areas. But they would like to see this done without the involvement of a private group of investors. Any improvements should be pursued in “thoughtful coordination” with the larger Franklin Park area to benefit BPS families and those living nearby, they said.\nTwo out of the seven BPS varsity football teams play home games at White Stadium currently. In her interview with host Jimmy Hills this week, Wu acknowledged that these teams would be forced to play some of their games elsewhere, but emphasized that late-season games after the NWSL season ends would be played at the renovated stadium. The city is working to ensure that the teams would have refurbished fields to play at during and after construction.\nThe number of hours that BPS students would be using the stadium would “more than triple” under this plan, Wu said, citing the new track and the ability for the stadium to host more student soccer games. The NWSL team would only use the new facilities for about 10% of the hours that it would be open all year, she added.\nAdvertisement:\n“We never would have signed on to any kind of deal that would have at all diminished our city and especially our young people’s access. If anything, this is the opportunity to really deliver something that we would have no other way of delivering,” she said.\nThose opposed to the city’s plan expressed gratitude for the judge’s decision this week to delay a ruling.\n“We are relieved that the judge postponed making her decision on this important constitutional question,” Renee Welch, a plaintiff who lives in Egleston Square, said in a statement. “Franklin Park and White Stadium are for the people of Boston, not for private investors to make a profit. This project has been moving too fast, ignoring the community’s concerns over the displacement of BPS student-athletes and the local community from the stadium and Franklin Park.”\nCorrection: An initial version of this story indicated the judge delayed the project for two weeks. The judge delayed her decision on an injunction for two weeks but did not pause the project during this time.\nRoss Cristantiello, a general assignment news reporter for Boston.com since 2022, covers local politics, crime, the environment, and more.\nStay up to date on all the latest news from Boston.com\nWant to leave a comment?\nMass. politicians decry the SAVE America Act. What to know.\nMassachusetts ER wait times rank among the longest in the U.S.\nMass. woman killed while sunbathing after car drives into residential pool area in Florida\nNew ICE facility confirmed in N.H., state officials knew for weeks\n$240K in Boston — but no remote work. Would you take it?\nStay up to date with everything Boston. Receive the latest news and breaking updates, straight from our newsroom to your inbox.",
  "word_count": 1279,
  "scraped_at": "2026-02-14T13:11:08.714891"
}