{
  "article_id": "cebb520dc7ad",
  "url": "https://www.whittierdailynews.com/2024/06/11/college-world-series-with-only-sec-and-acc-teams-might-portend-the-future/",
  "title": "College World Series , with only SEC and ACC teams , might portend the future",
  "date": "20240611T194500Z",
  "domain": "whittierdailynews.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "By ERIC OLSON AP Sports Writer\nOMAHA, Neb. — The College World Series begins this week and only two conferences will be represented on the game’s biggest stage for the first time since the event expanded to eight teams in 1950.\nThe Southeastern Conference and Atlantic Coast Conference each are sending four teams, the SEC for the fourth time since 2015 and seventh overall and the ACC for the first time since 2006.\nTheir exclusivity this year hints at an even greater concentration of power in the sport as college athletics moves into an era where players, already able to transfer around freely, can make more money than ever, scholarship limits are likely to be removed and the richest schools pour more resources into facilities.\nThe CWS opens Friday with an all-ACC matchup between North Carolina (47-14) and Virginia (46-15) and Tennessee (55-12) of the SEC playing Florida State (47-15) of the ACC. Games the next day match Kentucky (45-14) of the SEC against the ACC’s North Carolina State (38-21) and Texas A&M (49-13) against Florida (34-28) in an all-SEC meeting.\nCollege baseball has never been better, coaches and administrators say. The shortening of the amateur draft since the pandemic has kept talented older players in school, regular-season television coverage has expanded and attendance has increased.\n“I honestly believe we’re probably in a golden age of college baseball right now,” American Baseball Coaches Association executive director Craig Keilitz said.\nBeneath the surface, there is concern the transformation of college athletics will further reduce the number of programs capable of competing at the highest level.\nBaseball already is top heavy. The SEC has claimed four straight national championships and nine of the last 14, and has had at least one team in 14 of the past 15 finals. Since 2014, 50 of the 80 CWS teams have been from the SEC (31) or ACC (19).\nPart of the sport’s charm has been the ability of smaller programs to occasionally rise up and challenge the big-name brands, scenes familiar to fans of the March Madness basketball tournaments.\nEvansville, which had one of the oldest rosters in the country this year, came within one win of going to Omaha by extending its super regional against No. 1 national seed Tennessee to three games. Oral Roberts made it to the CWS last year and won a game. Stony Brook was here along with Kent State in 2012. Coastal Carolina, then in the Big South, won the national title in 2016.\n“Those are the teams you root for,” Cal State Fullerton coach Jason Dietrich said. “Not to say you don’t root for the other schools, but you love the underdog, the teams that don’t have the bells and whistles.”\nTRANSFERS AND TENDER\nAs with other sports, the transfer portal and athletes’ ability to earn endorsement money through name, image and likeness deals have turned baseball on its head.\nFlorida State, Kentucky and Texas A&M each went into their super regionals with five players in their everyday lineups who started at other Division I schools. The number was two for North Carolina, N.C. State and Tennessee and one for Virginia.\nKentucky had the most D-I transfers on its roster with 12; N.C. State had the fewest with five.\nBaseball receives only 4.8% of overall NIL spending, according to Opendorse, and is far behind the top three sports – football, men’s basketball and women’s basketball. The top 25 NIL earners in baseball are making an average of $45,000 per year.\nBut with most players receiving a partial scholarship because of the current NCAA limit of 11.7 per team, any income helps offset cost of attendance. Schools offering the most NIL money through their donors naturally get the best players.\nSince July 1, 2021, the average estimated annual NIL spending per SEC baseball team was $820,000 to $920,000, based on more than 150,000 NIL transactions disclosed through or processed by Opendorse, a company that works with dozens of schools and more than 40 collectives on NIL activities. A number of SEC teams are said to be spending well into the millions.\nThe average NIL spending in the ACC is half that of the SEC but still ranks second among all conferences.\nIf scholarship limits are removed, which is the expectation, deep-pocketed programs could choose to fully fund their programs.\nThis year, each program can divvy up 11.7 scholarships among 32 players. If all 32 get full rides in the future, the chasm between the haves and have-nots in the sport surely will deepen. And there could be additional money for baseball players in the major conferences as part of the revenue-sharing plan proposed in the NCAA’s antitrust case settlement.\nRIPPLE EFFECTS\nDietrich grew up in Southern California and remembers when the small-budget Titans were one of college baseball’s best programs. Cal State Fullerton has appeared in 18 CWS, most recently in 2017, and won four national titles, tied for the fifth most.\nDietrich can’t offer the amenities of the major-conference schools and must recruit players who often need a year or two of seasoning. Cal State Fullerton has less NIL money available compared with larger programs, so Dietrich is susceptible to losing the players he develops who can land larger endorsement deals elsewhere.\nCal State Fullerton went to an NCAA regional last year but lost three starting position players and its best reliever to the draft and then had another everyday starter and a bullpen arm join five teammates in the transfer portal. The Titans were 16-38 this season.\n“We’re doing everything we can,” Dietrich said. “Our goal is to go to Omaha and compete for a national championship. We see there are some obstacles ahead, but that’s just the way it is.”\nBig Ten-bound UCLA is one of the biggest brands on the West Coast but has struggled since making a regional in 2022. Eleven players went into the portal in the next two cycles, and most were difference-makers like pitchers Thatcher Hurd and Gage Jump (both to LSU).\nPersonnel losses to the portal and the draft left Bruins coach John Savage relying on one of the most freshman-heavy rosters in the country. He noted the physical mismatch between his 18-year-old freshmen against opponents’ 24-year-old seniors. The result was a last-place finish in the Pac-12 this year.\nRetiring Coastal Carolina coach Gary Gilmore said he’s not against the idea of NIL money for athletes. He is against the lack of guardrails around it, especially with booster-funded collectives at the big schools spending freely and rules that allow players to transfer as often as they like without penalty.\n“If Major League Baseball, the NBA and NFL had a system where everyone was a free agent every year, do you realize what chaos it would be?” Gilmore said. “If you did it in baseball, it would be the Yankees, Red Sox, Dodgers and Texas. The rest of the teams couldn’t compete. That’s what is going on right now. There’s not a level playing field.”",
  "word_count": 1165,
  "scraped_at": "2026-02-14T12:41:31.862957"
}