{
  "article_id": "cef8a8b8088f",
  "url": "https://www.afl.com.au/aflw/news/1452295/i-felt-really-alone-why-young-gws-giant-kaitlyn-srhoj-is-speaking-up-about-her-battle-with-eating-disorder",
  "title": "  I felt really alone : Why Srhoj opened up about eating disorder battle",
  "date": "20251112T050000Z",
  "domain": "afl.com.au",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "This article contains descriptions of eating disorders that may be triggering for some individuals.\nGIANTS midfielder Kaitlyn Srhoj hopes her decision to talk publicly about her ongoing battle with an eating disorder will inspire other young women to speak up and seek support.\nSrhoj first contemplated the idea of talking publicly about her experience in February this year, and raised the prospect with the club's media team.\nIn those courageous and vulnerable discussions, she mentioned not having a role model or an advocate to look up to growing up; no advocates she felt she could relate to.\nNow, the 20-year-old is determined to be that person for others, to use her story to help young athletes, feel seen, understood and supported.\n\"At the time, I felt really alone,\" Srhoj said.\n\"I felt like no one could relate to me at all.\n\"Growing up playing sport and then having this mind-consuming eating disorder, it's isolating.\n\"I just wish I had a role model I could look up to, someone I could relate to and understand that this is a normal, human experience that people go through.\"\nSrhoj's journey began in high school, after a serious ankle injury sidelined her for over a year.\n\"When I got injured, I felt like I lost my identity, I wasn't training, so my mindset became, 'Well, if I'm not training, I don't deserve to eat.' That's when it started,\" she said.\n\"I started thinking I had to look a certain way. I was stuck between trying to look like an athlete and a normal person.\n\"Even now, I still battle with that.\n\"During the season, when I'm focused on the AFLW, I'm in a good headspace, but in the off-season, it's so hard.\n\"I'm constantly trying to balance being a normal girl and the best athlete I can be.\"\nSrhoj says eating disorders are far more common than she had first thought, particularly in a high-performance environment.\n\"I know I'm not the only one who's felt this way,\" she said.\n\"So many girls I've played with have probably experienced the same thoughts in patches, even if they don't talk about it.\nShe describes her experience not as a \"dieting issue\" or \"body image problem,\" but a constant, relentless internal voice that she can't switch off.\n\"It's a voice in your head that doesn't stop,\" she said.\n\"People think it's about being thin, but it's about control. I think about food all the time, it's exhausting.\nSrhoj was first diagnosed in 2021, has received treatment since 2022, and says her recovery has been far from straight-forward.\n\"I thought it would take a year or two, but recovery is long-term,\" she said.\n\"It's something I'm learning how to manage. My psychologist once told me, 'You put all your energy into football, now you need to put that same energy into recovery.'\n\"That really stuck with me and is something I'm trying to do.\"\nNow 20 games into her fledgling NAB AFLW career, Srhoj says football has been both a challenge and a saviour in her recovery journey so far.\n\"Football is my outlet,\" she said.\n\"It's the one thing that keeps me grounded and gives me purpose, but it's also tricky because being in a high-performance environment means you're always thinking about your body and performance. It's a constant balancing act.\"\nSrhoj has worked closely with the Giants' AFLW Player Development Manager and her personal psychologist, both of whom are helping her learn to separate her athlete identity from her personal one.\n\"When I walk into the Giants, I want to be seen as an athlete. When I leave, I work on being Kaitlyn, the person, not the footballer,\" she said.\nOpening up to her friends and family has also helped Srhoj rebuild relationships that her eating disorder once strained.\n\"I lost a lot of friends because I pushed people away,\" she said.\n\"I didn't want to go out to eat, I didn't want to be around people who didn't understand. But now, I've been able to reconnect, and those relationships are so much stronger.\n\"I've learned that people actually relate more than you think, you just have to be willing to talk about it and that's the hardest part.\"\nSrhoj might only be at an early stage in what she describes as a 'long-term recovery' but she's determined to use her platform as an athlete to encourage more open conversations around eating disorders in sport.\n\"I don't think there's many female athletes really talking about this,\" she said.\n\"It's something I want to change. I want to create a space where people can talk openly about it, where it's not taboo or shameful.\"\nSrhoj hopes her story will reach young athletes who might be struggling in silence, just like she did.\n\"I really just want to raise awareness,\" she said.\n\"It takes work, it takes time, but recovery is possible, and I want young girls and boys to know that you can go through something like this and still come out stronger.\n\"You're not broken, you're just human.\n\"If my experience can help even one person feel less alone, then it's all worth it.\"\nIf you or anyone you know requires support in connection with the themes raised in this article, the Butterfly Foundation is available 8am to midnight (AEDT), 7 days a week: Call 1800 ED HOPE (1800 33 4673) or visit https://butterfly.org.au/get-support/helpline to chat online or email.",
  "word_count": 903,
  "scraped_at": "2026-02-14T13:33:09.547809"
}