{
  "article_id": "cf04aeffa2c6",
  "url": "https://www.cardchronicle.com/2023/1/13/23553918/friday-afternoon-cardinal-news-and-notes-louisville-cardinals",
  "title": "Friday afternoon Cardinal news and notes",
  "date": "20230113T200000Z",
  "domain": "cardchronicle.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "—UNC’s starting frontcourt duo of Armanda Bacot and Pete Nance are doubtful to play tomorrow against Louisville.\nFriday afternoon Cardinal news and notes\nJeff Brohm’s already got the Cardinal kids dreaming about September.\n—Louisville will celebrate the 10th anniversary of the 2013 national championship team next month, but the school will have to walk a fine line and the banner definitely will not be going back up.\n—Here’s the U of L preview for tomorrow afternoon’s game against UNC.\n—In addition to voicing his support for Kenny Payne, Josh Heird told the media on Friday that he is, at least for the time being, fully committed to playing out Louisville’s three-game football contract with Indiana.\nSeveral reports in the media have said Indiana called Louisville recently to discuss canceling the series. U of L athletic director Josh Heird was asked about the situation following with U of L Athletic Association Board of Directors meeting on Friday morning and he said the Cardinals “we’re going to play in Indianapolis in 2023.”\nThe game is scheduled for Lucas Oil Stadium on Sept. 16 of next season.\n“There’s no opportunity for us or for them to go find another game,” Heird said. “I would presume they are excited about playing that game. We are extremely excited about playing that game. I think it’s a great opportunity for both of our fan bases. I think our student-athletes love playing in a pro-environment.”\nUnder the current contract, Louisville is supposed to host IU in 2024 and the Cardinals would play in Bloomington in 2025.\n“When you get to that point, call it the home-and-home,” Heird said. “I don’t have any idea. There are conversations that get had by teams all of the time. . . . I know we like to schedule these things out for the next 10 or 15 years but they change all of the time. Right now, we are fully committed to playing in ’23 and then we’ll see what happens in the future, if we mutually think there’s essentially a better opportunity out there would be the reasoning.\n“But right now we committed to a three-game series, they did too and that’s where we are right now.”\n—Ashton Gillotte season highlights are here. Kid’s gonna be a monster in 2023.\n—The Jaden Rashada saga, which includes the freshman QB leaving Florida to go back home after a reported $13 million NIL promise was not fulfilled, is wild.\n—Matt McGavic is taking the Heels over the Cards by 13 tomorrow.\n—Brian Brohm is already making his presence felt locally.\n—Someone sat down and talked with the guy who brought the “Please go to Texas” sign to Rupp Arena Tuesday night. He’s apparently a teacher at Lafayette High School who is desperate for Jay Wright to take over the program.\n—Highlights from last night’s gut-punch loss to Virginia Tech are here.\n—Three-star RB TJ Engleman (2024) will visit Louisville this weekend.\n—Happy cancer-free anniversary to Pete, who rules.\n—The U of L women’s soccer team will participate in the 2023 Spring Cup, which is being held for the second time this year.\n—Jeff Goodman writes that it’s time for the marriage between Kentucky and John Calipari to come to an end.\n—Kyle Tucker of The Athletic also did not hold back when it comes to the issues between Cal and UK at the moment.\n—Tar Heel Blog gives us three things to watch for during Saturday’s game at the Yum Center.\n—No one in college baseball knows their strike zone better than C-Knap.\n—Akoy Agau says that bringing a new pro basketball team to Louisville is a dream come true (video).\n—Baseball jerseys are now available for purchase on the U of L auction site.\n—Joe Lunardi’s latest Bracketology is out. Louisville did not make the field of 68 teams.\n—Ava Jones, the Iowa signee who was seriously injured when an impaired driver struck her and her family in Louisville over the summer, returned to the court this week.\n—Louisville game notes for tomorrow’s tilt against North Carolina are here.\n—Josh Heird sees a path towards getting a deal for new Cardinal Stadium naming rights done.\n—Since Jeff Brohm was announced as football coach, U of L has seen a $1.1 million increase in revenue from ticket sales.\n—Jeff Greer’s latest U of L hoops newsletter focuses on the emergence of Mike James.\nThere’s a lot to like about James from just watching him. He works hard. He hustles. He has good body language. He’s a really confident shooter. He’s not afraid of mixing it up inside.\nThere’s even more to like about him from his playing data through 17 games, even on a team as bad as 2-15 Louisville.\nWe mentioned James’s effective field-goal percentage. How has he gotten there? For one, he is a smart scorer. He sticks to what he does best, and hoops analytics folks would appreciate those efforts. More than 80% of his shot attempts have been either layups and dunks or 3-pointers, which is good because he makes 64.5% of his layups and 39.1% of his 3s. He mostly avoids mid-range jumpers for good reason: James is 4 of 18 on mid-range 2s.\nOnly Sydney Curry has a better effective field-goal percentage than James, and Curry has attempted half the number of James’s shots and almost exclusively attempts shots around the basket.\n“From the last time I played, all through my high school career, I don’t take bad shots,” James told me on my podcast, Floyd Street’s Finest. “I let the game come to me. I shoot shots in the flow of the game. I don’t force anything because that leads to bad misses and your efficiency drops.”\n—Greg Scruggs has been hired as the new defensive line coach at Wisconsin.\n—The Fayetteville Observer previews Louisville vs. North Carolina.\n—U of L has offered class of 2024 OT Jordan King from Indiana.\n—Friday Irrelevance:\n—A year after the men’s basketball team lost to Virginia Tech for the first time since 1993, the women’s team dropped a game to the Hokies for the first time since ‘95.\n—Basketball blues are being felt across the Bluegrass State at the moment.\n—The latest Card Chronicle Podcast episode is out.\n—And finally, beat UNC.",
  "word_count": 1044,
  "scraped_at": "2026-02-14T13:34:56.274166"
}