{
  "article_id": "cf16683d1a7a",
  "url": "https://www.nytimes.com/athletic/6571021/2025/08/23/barbra-banda-orlando-pride-injury/",
  "title": "Orlando Pride Barbra Banda placed on season - ending injury list",
  "date": "20250823T180000Z",
  "domain": "nytimes.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "The reigning National Women’s Soccer League Championship MVP Barbra Banda will miss the remainder of the 2025 season through injury.\nThe Orlando Pride confirmed forward Banda, 25, had been placed on the season-ending injury list due to an adductor tendon problem sustained in the NWSL fixture against Kansas City Current on Aug. 16.\nAdvertisement\nThe Pride said the Zambia international had suffered a “full thickness avulsion of her right adductor longus tendon” during last weekend’s delayed game, and would begin a rehabilitation program with her club.\n“We are devastated to announce Barbra Banda has been placed on the Season Ending Injury list following the soft-tissue injury she sustained during our recent match against Kansas City Current,” Pride’s vice president of soccer operations and sporting director Haley Carter said in a statement. “Barbra has been instrumental to our success and losing a player of her caliber is heartbreaking for the entire organization.”\nBanda was named NWSL Championship MVP after scoring the only goal in the 2024 season finale. She provided 17 goals and seven assists in 25 appearances last year. She was nominated for the Ballon d’Or Feminin earlier this month.\nThe forward was replaced 15 minutes into last weekend’s 0-0 draw with Kansas City Current after going down with an injury following a blocked shot attempt.\nThe game was delayed for three and a half hours due to extreme heat, with NWSL commissioner Jessica Berman threatening to fine the Current after a disagreement over extreme heat procedures that delayed the fixture.\nAfter the match was authorized to begin, both teams were given 20 minutes to warm up, in accordance with league guidelines.\nIn a statement provided to The Athletic by the NWSL Players Association, executive director Meghann Burke expressed concern about how the heat delay was handled by the league in relation to Banda’s injury and player safety.\n“Any time one of our members sustains a season-ending injury, it is devastating,” Burke said. “The costs of mismanaging warmups and extreme heat are not abstract — they are real, personal, and career-altering. This has to be made clear: compromising core values of player safety for short-term business interests results in paying a far greater price in the long run.”\nBanda joined the Pride from Shanghai Shengli in March 2024 for a then club record fee of $740,000. She has scored eight goals in 16 league appearances this season.\nAdvertisement\n“We are committed to providing her with the highest level of care and support throughout her recovery,” Carter added. “Her contributions to this team both on and off the field have been immeasurable, and we know she will approach her rehabilitation with the same determination and professionalism she brings to everything she does.”\nThe Pride return to action against Gotham on Friday.\n‘The Pride lose undisputed talisman Banda’ – analysis\nBy The Athletic’s Women’s Soccer Writer Tamerra Griffin\nOn a team brimming with household name stars and unsung heroes, Banda has been the Orlando Pride’s undisputed talisman. With eight goals to her name this season, she is in the running for the Golden Boot race, but her insatiable hunger for scoring only tells a portion of the story about all that she contributes to the Pride.\nHer work rate is unparalleled, which, combined with her dynamic athleticism and endurance, often means consistent performances from first kickoff to final whistle, and this season in particular, she’s further improved her defensive efforts as well, tracking back to support and apply pressure to the opposition’s attack. There is a reason she won the 2024 NWSL Championship MVP award and two consecutive Ballon d’Or nominations.\nWhile the Pride, who currently sit in the No. 3 spot in the league table midway through the weekend, will take some solace knowing that their offense will soon be aided greatly by the introduction of preternatural winger and Mexican international Lizbeth Ovalle, for whom the club recently set a new world record with a $1.5million transfer fee, she was never going to be employed as a replacement for Banda — if anything, the two were meant to build a partnership playing alongside each other.\nAnd yet for all that Banda’s season-ending injury means for the Orlando Pride as they enter the final portion of the season, it is also a significant blow for the league and followers of global women’s football. The 25-year-old Zambian needed fewer than two full seasons to build an unforgettable reputation for herself in Orlando as a tireless, dedicated, and humble worker — a player the club was ready to invest in, as shown by the transfer fee they paid for her to come over from China, where she last plied her trade for club.\nAdvertisement\nThe World Cup is still far enough away for reasonable hope for her recovery, but the next Women’s Africa Cup of Nations kicks off in the summer of 2026, raising questions about her ability to participate with the Copper Queens, who reached the quarter finals in this summer’s iteration.\nNo matter which way you spell it, Banda’s absence will be unmissable until she’s back on the pitch.\n(Photo: Jeff Dean/NWSL via Getty Images)",
  "word_count": 853,
  "scraped_at": "2026-02-14T13:22:53.346370"
}