{
  "article_id": "cf686b89fb8f",
  "url": "https://theboar.org/2024/12/debutants-wales-drawn-against-reigning-champs-england-for-euro-2025-group-stages/",
  "title": "Debutants Wales drawn against reigning champs England for Euro 2025 group stages",
  "date": "20241228T133000Z",
  "domain": "theboar.org",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Debutants Wales drawn against reigning champs England for Euro 2025 group stages\nThe draw for the 2025 Women’s European Championships took place last Monday and saw Wales and England both drawn together, in what some are calling this tournament’s ‘group of death’. This is the first time the Welsh women’s team have ever made a major tournament, and it sees the Lionesses defending their memorable 2022 Euros triumph. The two teams find themselves in Group D, alongside the Netherlands and France.\nHosts Switzerland took the first position in group A, with the three highest-seeded teams from pot one being drawn in the first position of groups B-D. The remaining 12 teams were split between the four groups, with one team from each pot ending up in each group.\nAs Wiegman’s England team finished second in their qualification group, they were bound to be drawn against one of the highest-seeded opponents, who were all found in pot one. They managed to escape facing recent world champions Spain, as well as eight-time European champions Germany, and will instead face the Dutch national team.\nWhen asked for her opinion after the draw, she described the group as ‘very interesting and very exciting’\nThis means Wiegman will face her native and previously managed Dutch team, whom she led to victory at Euro 2017, as well as second place at the World Cup two years later. When asked for her opinion after the draw, she described the group as “very interesting and very exciting”. Whilst she acknowledged the group would be “very tough”, she is “confident” even if “things have changed so much in international women’s football”.\nWales midfielder, and highest-capped player, Jess Fishlock described her team’s qualification as a “really special moment,” claiming that the squad is “going to give everything… no matter who the team is”. Fishlock “can’t wait” for the tournament and the chance to face some of the world’s toughest opponents and has been “walking around with a smile on my face 24/7” since qualifying.\nThe remainder of the draw saw Switzerland, Norway, Iceland, and Finland drawn in Group A; Spain, Portugal, Belgium, and Italy drawn in Group B; and Germany, Poland, Denmark, and Sweden drawn in Group C.\nNext summer’s tournament will begin on July 2nd, with the final taking place at St Jakob-Park in Basel on July 27th. This will be the first time Switzerland has ever organised a major women’s sporting event of this size, and eight stadiums across the country will be in use for the tournament.\nEngland and Wales go head to head on Sunday, July 13th, at the Kybunpark in St. Gallen\nThe prize money has significantly increased since 2022, with the prize pot totalling £34 million (€41 million)- a growth of 156%.\nThe Lionesses are in action for the first time against France on July 5th, with Wales facing the Netherlands in their debut match on the same day. England then faces the Dutch team four days later before England and Wales go head to head on Sunday, July 13th, at the Kybunpark in St. Gallen.\nEvery match of the tournament will be available to watch in the UK either on BBC or ITV. Will we see a repeat of 2022 and the Lionesses victorious? Or will another team beat Wiegman’s formidable squad to take the championship?",
  "word_count": 553,
  "scraped_at": "2026-02-14T12:33:35.112009"
}