{
  "article_id": "cf6991b0147c",
  "url": "https://www.dailymail.co.uk/news/article-15087501/Prince-Harry-promise-King-Charles-father-son-relationship.html",
  "title": "Prince Harry promised King Charles that details of their first meeting in 19 months would remain private - because he is determined to  rebuild their father - and - son relationship  ",
  "date": "20250911T101500Z",
  "domain": "dailymail.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Prince Harry promised King Charles that details of their first meeting in 19 months would remain private - because he is determined to 'rebuild their father-and-son relationship'\nPrince Harry promised his father that he could be trusted to stay quiet about their private discussions before they met for the first time in more than 18 months, it can be revealed today.\nThe Duke of Sussex spent 54 minutes having a cup of tea with King Charles at Clarence House in London yesterday as part of 'rebuilding their father-and-son relationship'.\nWhen they met in February 2024 after the monarch was diagnosed with cancer, Harry's audience was limited to just over 15 minutes.\nA royal source has said that Harry is determined to 'reset' his relationship with his family, and the British people, after years of turmoil caused by Megxit - starting first with his father.\n'This is an important first step towards rebuilding their father-and-son relationship', a royal insider told the Daily Mail today.\n'He has told his father he won't be giving any interviews about it and his team have been instructed not to brief journalists about what was said.\n'There's a long way to go before Harry can earn his family's trust but he's given some assurances.'\nPrince Harry, pictured today at a Diana Award event, met his father for the first time in 19 months as they rebuild their relationship\nKing Charles arrives at Clarence House, in London, ahead of a meeting with his son Harry\nPrince William talks to members of the Welsh Rugby Union during his visit to Cardiff yesterday. The Daily Mail's source believes he will have been informed that his younger brother and father were meeting\nAfter yesterday's royal summit the Duke looked carefree as he took centre stage at an Invictus Games event where he revealed his father was 'great' when asked about their meeting.\nHe apologised for being late and joked that many of his guests might be drunk.\nBut after telling all and launching vicious attacks on his family in his memoir Spare and in various TV interviews, it is understood that Harry told King Charles that he would not be sharing any more details with the public.\nPrince William did not attend yesterday's Clarence House meeting but will have been aware it was going to take place, it is understood.\nThe Prince and Princess of Wales have been out at royal events all week - and on one occasion were only three miles away from Harry but chose not to meet.\n'William would have known that this was going to happen. It's not clear how happy he is about it but, you know, sooner or later most families reach some sort of accommodation after a family rift', the Daily Mail's source said.\nPrince Harry looked buoyant as he described his father King Charles III as doing 'great' after the pair reunited for a long-awaited reconciliation meeting at Clarence House.\nThe Duke of Sussex said of the Monarch 'Yes he's great, thank you,' when asked about the face-to-face meeting during a reception for the Invictus Games, which he launched in 2014 as a tournament for injured service personnel and veterans.\nThe Duke of Sussex during a visit to take part in a panel discussion on how social action positively impacts mental health with four young people who are involved with The Diana Award, in Salisbury Square, central London, today\nAppearing relaxed, smiling and upbeat, Harry mingled with corporate sponsors and government ministers as he attended the event in The Gherkin, London, ahead of a speech outlining the next 10 years of his Invictus movement.\nHarry, 40, arrived at the event 40 minutes later than planned after travelling directly from a private tea with the Monarch, which lasted for 55 minutes. It was their first meeting in 19 months since the Duke flew to the UK to see Charles in February 2024.\nHe was spotted being driven into the royal residence in a black Range Rover at 5.20pm before leaving in the same car at around 6.15pm.\nEarlier, the King was seen arriving at Clarence House at 4pm, having landed at RAF Northolt at around 3pm following a flight from Aberdeen Airport. Charles met with Holocaust survivor Manfred Goldberg, where he was invested with an MBE.\nCharles had flown to the capital after a stay at Balmoral in Aberdeenshire, raising the possibility of a meeting with Harry during his son's four-day stay in Britain.\nHarry was due to arrive at the Invictus reception at 6.45pm but organisers said he was running late, before he finally arrived at 7.24pm.\nIt is believed the Duke travelled to the event straight after seeing his father but traffic has been very heavy in central London this week due to an ongoing Tube strike.\nPrince Harry arrives at Clarence House, London, after his father King Charles\nThe Duke of Sussex is seen leaving the royal residence around 55 minutes later\nAfter a reception where he met sponsors and supporters, the duke gave a speech and began by joking about his long journey across London to attend the event.\nHe made his guests laugh when he said: 'I think this whole thing has been delayed slightly, so at this point you're all hammered - which was part of the plan all along, stuck up here at the top of the Gherkin.'\nHarry's comments became serious when he said: 'We live in a time when conflicts rage across the globe, when anger and resentment towards those who are different can feel overwhelming.\n'The Invictus community stands as a direct challenge to that. We prove that unity is not just possible, but formidable. That the bonds of courage, respect and humanity are stronger than the divisions of politics, background, or nationality.\n'Our ambition for the future is clear: we will focus where the need is great, we will strengthen the international community we have already built, and we will continue to drive systemic change - ensuring that wounded, injured, and sick service personnel everywhere can find recovery through sport, rehabilitation, and the support of community.'\nThe Duke is on the final day of his rare four-day trip to the UK, carrying out a string of solo charity visits.\nHe is attending a Diana Award event this morning before he is expected to fly back to Los Angeles.\nHarry arrived in Britain on Monday and attended the WellChild Awards at London's Royal Lancaster Hotel to celebrate the achievements of seriously ill youngsters.\nHe then travelled by car to Nottingham on Tuesday to visit the Community Recording Studio and announce a £1.1million personal donation to the BBC's Children In Need.\nThis afternoon, Harry was all smiles as he was greeted at the Centre for Blast Injury Studies in White City at about 1pm and hugged former Army captain David Henson.\nThe ex-Royal Engineer served as Team GB captain for the inaugural Invictus Games and attended Harry's wedding to Meghan Markle at Windsor Castle in 2018.\nMr Henson lost both his legs above the knee after standing on an improvised explosive device in 2011 while clearing a compound in Afghanistan. He went on to gain a PhD in Amputee Biomechanics at Imperial.\nHarry opened the Centre for Blast Injury Studies in 2013, which was the forerunner of Imperial's new centre which was launched a few years ago on its White City campus.\nClinically-driven trauma injury research is carried out at the building, and the King visited in February to highlight support for injured soldiers in Ukraine.\nHarry's office said that his foundation has donated $500,000 (£370,000) to projects supporting injured children from Gaza and Ukraine, including helping the World Health Organization with evacuations and work developing prosthetics.\nThe Duke visited the centre to learn more about its work, especially an increased focus on injuries suffered by children and those sustained in natural disasters.\n'No single organisation can solve this alone,' Harry said in a statement. 'Gaza now has the highest density of child amputees in the world and in history.\n'It takes partnerships across government, science, medicine, humanitarian response and advocacy to ensure children survive and can recover after blast injuries.'\nThe three grants announced by Harry and Meghan's Archewell Foundation include $200,000 (£150,000) to the World Health Organization to support medical evacuations from Gaza to Jordan, and $150,000 (£110,000) to Save the Children to provide ongoing humanitarian support in Gaza.\nThe third grant $150,000 (£110,000) was to the Centre of Blast Injury Studies to help its efforts to develop prostheses that can support injured children, particularly those children injured from the conflicts in Ukraine and Gaza.\nThe Duke has a long association with the Centre for Blast Injury Studies, which was set up with a focus on helping military veterans and personnel, having opened its former laboratories in 2013.\n'We very much consider you part of our story,' Emily Mayhew, the paediatric blast injury lead at Imperial College London, told him when he arrived.\nThe Prince himself spent 10 years in the British military, during which he served two tours in Afghanistan.\nHe has made campaigning to help the fate of veterans one of his main priorities, founding the Invictus Games for military personnel wounded in action.\nHe was joined by WHO chief Tedros Adhanom Ghebreyesus for a tour of the centre, where he met with research teams working on a number of world-leading projects.\nShowing him round was double leg amputee Dave Henson, an ambassador for the centre, who has known Harry for more than a decade and was the first captain of the British Invictus team in 2014.\n'It's been hugely important for raising the profile of the centre,' Mr Henson, who lost his legs in an explosion in Afghanistan in 2011, said of Harry's involvement.\nThe centre said children were seven times more likely to die from blast injuries than adults and in 2023 with support from Save the Children began expanding its work to launch of the Centre for Paediatric Blast Injury Studies.\nAmong the research Harry was shown were new designs for prosthetic knee joints for children, a demonstration of the world's most advanced foot and ankle physiological simulator, and the 'gait lab' which uses a virtual environment with motion capture cameras and a treadmill to evaluate the impact of new prosthetic designs on patients.\n'Here's a good-looking man,' Harry said with a big grin when he saw Steve Arnold who was demonstrating the gait lab equipment.\nLike Mr Henson, Mr Arnold, who lost both his legs in an IED blast ion Afghanistan in 2011, was also well known to the Duke after taking part in the 2014 and 2017 Invictus Games as a cyclist.\nRugby player Jac Morgan and Prince William participate in arts activities during his visit to new a mental health hub run by the Jac Lewis Foundation\nOn Monday, Harry marked the third anniversary of Queen Elizabeth II's death by privately laying flowers at her grave in St George's Chapel, Windsor Castle.\nBut he remained apart from William, with the Prince just seven miles away visiting a Women's Institute branch in Sunningdale, Berkshire, in his grandmother's honour.\nHarry and Charles last met face-to-face more than a year and a half ago when the duke made a transatlantic dash to see the monarch on February 9, 2024, after hearing of his cancer diagnosis, but they spent just over 30 minutes together before the King left to recuperate in Sandringham.\nThe Duke, who stepped down as a senior working royal along with his wife Meghan Markle in 2020, does not carry out official royal duties on behalf of the monarchy and remains estranged from much of the Royal Family.\nHarry claimed in his controversial memoir, Spare, that William had physically attacked him in a row over Meghan, and that his brother and Kate encouraged him to wear a Nazi uniform to a fancy dress party in 2005 and 'howled' with laughter when they saw it.\nThe Duke - who levelled other accusations at William, Kate and the King and Queen Camilla in his Oprah interview, Netflix documentary and his autobiography - told the BBC in May that Charles will not speak to him because of his court battle over his security, and he does not know 'how much longer my father has'.\nHarry is reported to have not been offered a place at a royal palace and is said to be staying at a hotel at his own expense.\nThe Duke has previously spoken of his hopes for a 'reconciliation' with his family, saying: 'Of course, some members of my family will never forgive me for writing a book. Of course, they will never forgive me for lots of things.'\nHe added: 'But you know, I would love reconciliation with my family,' and said there was 'no point in continuing to fight anymore'.\nSenior aides to the King and the duke were pictured together in London this July in what was reported to be an initial step towards opening channels of communication between the two sides.\nAs for William today, he visited a new mental health hub in Cardiff on World Suicide Prevention Day.\nWilliam attended the Principality Stadium to see a new centre for the Jac Lewis Foundation.\nMr Lewis, a popular footballer from Ammanford, was aged 27 when he died by suicide in February 2019.\nThe charity set up in his name provides rapid access to mental health support in communities across Wales.\nIt already operates two hubs, at Ammanford and Swansea Football Clubs, to encourage people to come forward.\nWilliam met Janet and Jesse Lewis, the parents of Mr Lewis, for a private conversation by the pitch at the stadium.\nThey were joined by Rhys Fisher and Shaun Williams, former teammates of Mr Lewis at Ammanford FC.\nThe prince then spoke to Wales rugby captain Jac Morgan and head coach Steve Tandy.\nWilliam asked Mr Morgan and Mr Tandy about their experiences with mental health support as their careers progressed.\n'I've heard from some football guys that when they reach a certain level, mental health becomes harder to talk about,' he said.\n'Do you feel, as your career has progressed, that it gets harder to talk about it and be open about it?'\nMr Tandy said he aimed to create an environment for players to talk about mental health, regardless of level.\nAs he left the table, William said to Mr Tandy 'good luck, we need you' before telling Mr Morgan: 'We really need you too.'",
  "word_count": 2414,
  "scraped_at": "2026-02-14T12:37:01.866957"
}