{
  "article_id": "cf6b9cedbdaa",
  "url": "https://www.begadistrictnews.com.au/story/8441859/obituary-leona-cairns-an-educator-activist-soulmate/",
  "title": "Obituary : Leona Cairns an educator , activist , soulmate",
  "date": "20231130T000000Z",
  "domain": "begadistrictnews.com.au",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Community educator, social justice advocate, aged and disability care manager, and community engagement activist are some of the many roles and qualities of Leona Cairns, who suddenly, and unexpectedly, died on October 10, 2023.\nSubscribe now for unlimited access.\nor signup to continue reading\nThe Anglican Church of Saint John the Evangelist, Bega was full of relatives, friends and colleagues for her funeral and celebration of life on October 23.\nLeona was born in Box Hill, Melbourne on March 21, 1942. She attended primary school in Box Hill and then won a scholarship to Canterbury Girls Secondary College, an elite school also known as Mangarra. She was always near the top of her class throughout her studies.\nLeona studied for an infant/primary teaching qualification at Burwood Teachers College and took up her first teaching appointment at Forest Hill State School. What a baptism of fire! A class of 51 lively five-year-olds.\nAs always, Leona accepted the challenge, put her head down and worked like a beaver to give those children the best possible educational experience.\nShe became engaged in late 1960 to Brian Cairns and they married in October 1961. In 1969 their first daughter, Bryony, was born.\nShe joined the local branch of Australian Breastfeeding Association and was an active member for many years. Two years later, a second daughter, Melinda, was welcomed into the family.\nNot long after the birth of Melinda the company Brian was working for merged with another and he was asked to transfer from Melbourne to work at the new head office in Sydney. He said he would accept the transfer on a trial basis, and for four months flew home for weekends; a very difficult situation for Leona who was coping with an energetic two-year-old and a baby who was a poor sleeper.\nThe family then spent nearly eight happy years in Sydney. When both girls were at school, Leona, ever the educator, took an additional course of study and began part-time teaching of special education classes. She also began her long and abiding interest in social justice activism by joining the local branch of Women's Electoral Lobby.\nAlthough the family returned to Melbourne in 1979, a couple of major unexpected events caused them to again re-assess their situation. They chose to make a sea change and leave the city behind, deciding the Sapphire Coast and Tathra in particular was where they would continue to raise their family, beginning a radically different life at beautiful Mogareeka. As usual Leona did everything she could to help fulfill their hopes and dreams in a new and so different environment.\nAfter a time she began teaching again in a number of schools in the district. She retained the same dedication and professionalism she always had. Then in 1986, consistent with her vocation to help others, she took on an entirely new role as the first manager of the local branch of the State Government's Home Care Service of NSW which was to expand from a small mainly voluntary group, to one which would cover the whole of the Bega Valley Shire.\nSetting up such an organisation was a formidable task, but she marshalled her many skills and determination, and developed a highly efficient, caring branch which became a model of its kind.\nAt that time she also sat on the regional NSW Home and Community Care Committee and began her long association with the Bega and District Nursing Home, which included 10 years as a board member.\nIn addition to her career, Leona was also involved in community activities including Tathra School P&C, the Tathra and District Ratepayers Association, the Tathra Wharf Restoration Committee and the Tathra Australian Rules Football Club.\nIn shared interests Leona and Brian always worked together and supported each other. They were a team in everything.\nLeona had also earlier rekindled her relationship with the church and became more involved in church activities. This included the establishment of a highly successful regular singalong for elderly people at Tathra Uniting Church, absolutely loved by all who attended. She also became involved in a meditation group and for some time established a group of her own. More recently she joined the Tathra Singers which she thoroughly enjoyed.\nIn 2007, Leona was diagnosed with a very aggressive melanoma on her right eyeball. It required urgent attention and she was very fortunate that one of the world's foremost pioneers in a radical new treatment was in Sydney. She had a great result from the treatment and the melanoma was killed by the nuclear radiation, and never returned. However, there was a downside, and though she retained her eye she lost its vision.\nUndeterred, after a time, she decided to teach again; she just could not stay away. This time she taught in the Catholic Education system and worked with the same dedication she had always shown, even learning Indonesian so she could teach it in language classes at Saint Patrick's School, Bega.\nShe finally retired from teaching and settled down to enjoy a less complex lifestyle, and her grandchildren.\nShe became active in the Bega Valley Advocates for Timor Leste group and served as secretary for several years. Leona joined in with Anglican Women and the Social Justice Advocates of the Sapphire Coast organisation.\nLeona was secretary of the Bega Girl Guides, twice - the first time when daughters Bryony and Melinda were enrolled, and the second time when granddaughters Eliana and Bronte were Guides.\nLeona and Brian spent 65 years together and four days after her passing they would have celebrated their 62nd wedding anniversary.\nLoving, passionate, dedicated, compassionate, loyal and true, strong, tenacious, resilient and fun are all qualities that quickly come to mind when thinking of Leona. She has been so much to so many, as a devoted wife, mother, grandmother, sister and aunty, and as an educator, employer, community worker, social justice and aged care advocate and activist, carer, colleague and, most of all, friend.\nAs many mourners remarked, she was a remarkable woman and friend, with a strong sense of duty for others, who contributed in many ways to making peoples' lives and the community better.\nShe will be sadly missed.",
  "word_count": 1030,
  "scraped_at": "2026-02-14T13:10:35.683196"
}