{
  "article_id": "cf71b1cb2826",
  "url": "https://www.examiner.com.au/story/8241999/concern-over-norths-statewide-league-thumpings/",
  "title": "Launceston City , United and Riverside seek NPL Tasmania reversals | The Examiner",
  "date": "20230621T043000Z",
  "domain": "examiner.com.au",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "All Launceston clubs will be looking to bounce back from what may well go down as the region's worst ever weekend of statewide soccer.\nSubscribe now for unlimited access.\nor signup to continue reading\nTwo 6-1 NPL Tasmania defeats for Launceston United and Riverside were followed by City's 8-1 loss to Devonport, with United's 5-0 Women's Super League result on Sunday failing to lighten the mood.\nThe combined 25-3 aggregate score prompted plenty of social media debate about the North's competitiveness and all three men's sides will welcome the chance to answer that question on Saturday afternoon.\nWhile the only points recorded by Olympic (1-0-9) and United (0-0-10) came when the sides met each other, City dropped from third to fifth with their fourth and biggest loss of the campaign which would have been particularly hard to swallow for their former Strikers contingent in coaches Daniel Syson and Nathan Pitchford plus co-captain Joel Stone.\nFive goals in 34 minutes underlined the value of Devonport's freakish Spanish striker Roberto Garrido against a City side that had conceded just 10 in the previous nine fixtures.\nMeanwhile United found the net for the first time in four games and Olympic for the first time in five - Angelo Amato and Riley Wakeford respectively providing welcome positives for the struggling sides.\nAll teams will welcome the opening of the mid-season transfer window with several key import players expected to be added to squads.\nROUND 11\nSaturday\n- 2.30pm Clarence v Launceston United, Wentworth Park\n- 4.30pm Devonport v Riverside, Valley Road\n- 4.45pm Launceston City v K'borough, Prospect Park\nSunday\n- 2pm South Hobart v Glenorchy, Darcy Street\nWOMEN'S SUPER LEAGUE\nLaunceston United will hope their hold over Taroona continues as they seek to respond to back-to-back disappointments.\nFresh from relinquishing their Statewide Cup title to South Hobart, Nick Rawlinson's side went down 5-0 at home to a rampant Devonport Strikers on Sunday to leave their league title defence looking almost as fragile.\nA hat-trick inside the first 16 minutes by the pacy Jazmin White set the trend at a rain-soaked Birch Avenue as United struggled to find a goal threat in their first fixture since the departure of prolific US import Courtney Marten.\nHowever, if United ever need a pick-me-up, Kelvedon Park is the place to go.\nIn three previous meetings with Taroona this season, United have won 8-0 and 5-0 in the league plus 2-0 in the cup quarter-final.\nThey may be facing the league's bottom-placed side but Taroona are in better form than suggested by just one point from 10 games.\nThat draw came at high-flying Devonport at the start of the month and was followed up by Saturday's clash at Kingborough where the Lions were behind for half the match and needed an injury-time winner from Cara Lashmar to secure a 2-1 win.\nWSL ROUND 11\nSaturday\n- 12.15pm Devonport v Clarence, Valley Road\n- 2pm Kingborough v South Hobart, Twin Ovals\n- 2.30pm Taroona v Launceston United, Kelvedon Park\n*************************\nOur journalists work hard to provide local, up-to-date news to the community. This is how you can continue to access our trusted content:\n- Bookmark www.examiner.com.au\n- Sign up for our breaking and regular headlines newsletters\n- Follow us on Twitter: @TheShawThing and @examineronline\n- Follow us on Instagram: @examineronline\nFollow us on Google News: The Examiner",
  "word_count": 558,
  "scraped_at": "2026-02-14T12:14:35.113898"
}