{
  "article_id": "cf7a7749f819",
  "url": "https://www.twtd.co.uk/ipswich-town-news/47271/morsy-skippers-at-children-of-gaza-fundraiser",
  "title": "Morsy Skippers at Children of Gaza Fundraiser - Ipswich Town News",
  "date": "20240602T103000Z",
  "domain": "twtd.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Sunday, 2nd Jun 2024 10:11\nBlues skipper Sam Morsy captained a team at yesterday’s Children of Gaza charity fundraising match at Barnet’s Hive stadium.\nThe Egypt international wore the armband and led out a side representing Nujum Sports, a charity supporting Muslim athletes and run by Ebadur Rahman, who organised the match, although didn't play in the game due to Town’s pre-season recovery schedules.\nThey were up against a team assembled by ex-Aston Villa and Ajax winger Anwar El Ghazi.\nTown striker Ali Al-Hamadi, currently recovering from adductor surgery, was also at the match with a long list of high profile current and ex-players involved, Crystal Palace pair Jeffrey Schlupp and Jairo Riedewald, Emile Heskey, former Town loanee Aaron Mclean, Everton’s Abdoulaye Doucoure, Adama Traore of Fulham, Leicester City’s Hamza Choudhury and Donny van de Beek of Manchester United among them.\nAhead of the game, Morsy said: “I’m really proud to be here and support the children of Gaza.”\nOn so many players coming together, he added: “I think that’s the truly special thing. It’s a charity game but it shows there’s still goodness in the world and people who want to come together who want to try and make a change, so it’s going to be a special day.”\nOrganiser Rahman said: “All children need to be protected and cared for no matter what their socioeconomic background, ethnicity, or faith. Our duty of care goes beyond borders, and we must act now to make sure our response is genuine, impactful, and urgent.\n“Nujum Sports thanks all our athletes who are currently playing professional football and coming out of retirement to add their ‘boots’ to this amazing endeavour.\n“A special thank you goes out to Anwar El Ghazi for championing this initiative and for his courage in speaking out against injustice and advocating for all Palestinian children.”\n@NujumSports for the children of Gaza thank you for everyone who have supported and continue to support the children as we try help in these unprecedented times ❤️ https://t.co/ymqGeobLlI— Sam Morsy (@sammorsy08) June 1, 2024\nPhoto: Matchday Images",
  "word_count": 345,
  "scraped_at": "2026-02-14T12:08:39.492844"
}