{
  "article_id": "cf82783c77c9",
  "url": "https://www.greenocktelegraph.co.uk/news/25511553.amy-muir-gourock-trailblazer-100-glasgow-city-appearances/",
  "title": "Amy Muir : Gourock trailblazer on 100 Glasgow City appearances",
  "date": "20251005T141500Z",
  "domain": "greenocktelegraph.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "A GOUROCK footballing trailblazer admits it's an honour to have reached a major milestone with Scottish giants Glasgow City.\nAmy Muir recently became a centurion for the SWPL stalwarts, making her 100th appearance for Leanne Ross's side in a 5-1 romp over Hearts.\nAnd the 25-year-old hopes that the good times can keep on rolling after an unbeaten start to the Scottish Women's Premiership.\nLooking back on her 100 appearances, she told the Tele: \"I feel like I've been at Glasgow City quite a long time and I'm only coming into my fourth season now.\n\"In football terms it's quite long, but it's been an amazing time.\n\"That first season winning the league is probably still the main highlight.\n\"We've also been on a few European runs in there, and getting to cup finals.\n\"We want more of that, and this season we've already put ourselves in a good position by staying in the Europa League and getting another chance at that.\n\"If we can continue a good start to the league it'd be great. We want to be back in cup finals and competing in the league because want to win trophies.\"\nMuir was part of the City side that completed a stunning last-gasp title triumph against Rangers two seasons ago on the final day at Ibrox.\nAnd to this day the defender admits she still can't believe just how late the Petershill Park side left it to pull off what many thought was the unthinkable.\nOn the final day, Rangers, Celtic and City all had a chance of the title.\nGoing into injury time, the game at Ibrox remained goalless, with Celtic 2-0 up against Hearts and on course to win the league - before Lauren Davidson netted City's championship-winning goal in the second minute of added time.\nIt looked like there was to be an even later twist when Rangers captain Kathryn Hill headed home what briefly looked like the equaliser that would send the trophy to Celtic Park - only for her goal to be disallowed for a foul on City keeper Lee Gibson.\n\"That day is still quite mad to think about,\" Muir continued.\n\"We've recently played at Ibrox again, and we were still speaking about it before the game.\n\"Some of the players involved that day are still in the team, and were just speaking about key moments in the game and not really knowing how long there was to go.\n\"We scored late on to wrap it up, but I'd presumed there was still quite a bit of time left.\n\"I actually thought we'd scored around 80 minutes, so I still thought there was quite a chunk of the game left.\n\"When I realised there was only a few minutes left, my sole thought was 'we just need to hang on here'.\n\"It has just been an absolute dream being involved with this club.\n\"It's been good being involved in the last few camps and playing a good bit more as well with the new manager coming in.\"\nThings have only continued to look up for the full-back who has worked her way back into the Scotland squad under the eye of new boss Melissa Andreatta.\nMuir featured in the 2027 World Cup qualifiers earlier this year at Hampden, when Scotland faced off against Austria before featuring in a 1-1 draw against the Netherlands.\nAnd she hopes that she can keep herself in and around the group when they face off against Switzerland in Dunfermline at the end of the month.\nShe added: \"It was nice to start Melissa's tenure by getting a couple of starts. I just want to continue that and try and get myself back into the mix.\n\"That's the next aim, but there's quite a few friendly camps coming up.\n\"There'll be a few changes and trials here and there, so I just want to try and keep myself in that squad first and foremost and then try my best to keep my place.\"\nMuir admits she's been extremely fortunate to have been a part of so many 'pinch me' moments in the early stages of her career.\nAnd looking back to when she made her first steps into the game she admits the opportunities presenting themselves to youngsters in the area is night and day.\n\"It is quite amazing to look back to when I first started playing,\" she added.\n\"I was at First Touch, my first boys' club, just because I liked to play football.\n\"There were times where some of the boys in the team were getting trials at pro youth set-ups, and at that point things were quite limited in where girls' teams were available.\n\"I just always presumed when I was that age that I would just always play with boys, because you'd never seen women's football anywhere. I just thought I'd keep playing until I got bored.\n\"When they were going on trials for these teams, I thought 'why can't I go and train with Kilmarnock boys?'.\n\"That's when I was told hey were like, 'oh, we can't take girls,' but it didn't really process properly to me.\n\"I was like, oh, God, I'm going to need to eventually find a girls' team.\n\"The difference between then and now, even just with the amount of women's teams and the standard of it has just blown up, especially the last five years in Scotland.\n\"It's just mad to think how things were different when you were younger.\n\"I have seen quite a bit from Morton, and a few other clubs in the area that are giving girls an opportunity to play.\n\"That's amazing in itself, because it wasn't really there at all when I was younger.\n\"Giving opportunities is the main thing and having those opportunities there for girls now is lovely to see.\"",
  "word_count": 970,
  "scraped_at": "2026-02-14T13:33:24.673962"
}