{
  "article_id": "cf85a673f169",
  "url": "https://www.bbc.co.uk/sport/football/65903957",
  "title": "Australia, Canada, Republic of Ireland & Nigeria: A guide to Group B at 2023 Women's World Cup",
  "date": "2023-06-30T07:08:57.000Z",
  "domain": "bbc.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_bbc",
  "body_text": "Australia, Canada, Republic of Ireland & Nigeria: A guide to Group B at 2023 Women's World Cup\n- Published\n- comments\nThe 2023 Women's World Cup is taking place in Australia and New Zealand between 20 July and 20 August. Co-hosts Australia are in Group B, along with Canada, debutants Republic of Ireland, and Nigeria. BBC Sport takes a closer look at those teams.\nAustralia\nManager: Swedish manager Tony Gustavsson has been in charge of the Matildas since 2020. The 49-year-old is probably best known for guiding Tyreso to the Women's Champions League final in 2014, where the now defunct Swedish side lost 4-3 to Wolfsburg. That came in the middle of two spells as assistant manager of the United States, which included two World Cup wins in 2015 and 2019.\nStar player: Of course it is Sam Kerr. Who else could it be? The Chelsea forward is a headline act for the tournament and is one of the most feared finishers in the game. The 29-year-old has scored 63 goals in 120 caps and heads into the World Cup after helping Chelsea to a Women's Super League and FA Cup double. This is her big stage and she will be desperate to thrive.\nForm guide\nTournament history\nCanada\nManager: There is a familiar face in charge of Canada as English manager Bev Priestman, 37, leads one of the dark horses to the World Cup. Priestman was assistant manager under former boss Phil Neville as the Lionesses reached the World Cup semi-finals in 2019 before making the move into management with Canada a year later. Her biggest achievement has been leading Canada to a gold medal at the delayed Olympic Games in Tokyo.\nStar player: At 39 years of age, Christine Sinclair may not be at the peak of her powers but her record speaks for itself. With 190 goals in 323 caps, nobody has found the net more times in international football. She has 10 World Cup goals and has scored in all five tournaments she has played in. She will be desperate to keep that run going in what is likely to be her World Cup swansong and hopes to end a glittering international career on a high.\nForm guide\nTournament history\nRepublic of Ireland\nManager: Since taking charge in 2019, Vera Pauw has elevated the Republic of Ireland's fortunes and guided the country to the World Cup - their first major tournament. Pauw previously managed Scotland, Russia and her native Netherlands, and has overcome personal difficulties in the past 12 months - such as revealing she was sexually assaulted in the Netherlands and being named in the NWSL's misconduct report over body shaming players, which is something she denies. The 60-year-old has delivered resounding success on the pitch and encouraged the Irish team to play with added confidence, a journey which has led to their historic qualification.\nStar player: Captain, leader, national legend. Katie McCabe has already secured her place in Irish folklore by leading the Republic of Ireland to a first major tournament. A key player for Arsenal in the Women's Super League, where she is also a fan favourite and won goal of the season for 2022-23, McCabe became the youngest captain in the Republic's history when she was handed the armband as a 21-year-old in 2017. Now 27 and entering her prime, her drive and talent will be crucial to her side's hopes in Australia.\nForm guide\nTournament history\nNigeria\nManager: American Randy Waldrum has been in charge of Nigeria for three years and this will be his first World Cup. The 66-year-old has spent the majority of his coaching career in college football, mainly taking charge of men's and women's teams for various universities in his homeland. Away from college level, Waldrum had a three-year stint at Houston Dash and was manager of Trinidad and Tobago's women's side.\nStar player: Wherever Asisat Oshoala goes, success seems to follow. The 28-year-old has won titles in her native league with Rivers Angels, the FA Cup with Arsenal in 2016, back-to-back championships in China and a remarkable number of trophies - including a Champions League and Liga F double this season - since making the switch to Barcelona in 2019. All of that before you consider three African Championships with Nigeria at international level. The first African to win the Champions League in 2021, she is a five-time winner of African Footballer of the Year. She also scored in both the 2015 and 2019 World Cups, so will be aiming to make it three in a row.\nForm guide\nTournament history",
  "word_count": 765,
  "scraped_at": "2026-02-14T11:17:39.938712"
}