{
  "article_id": "cf8d4c48ca15",
  "url": "https://www.dailymail.co.uk/tvshowbiz/article-12450799/Mel-C-49-showcases-toned-abs-skimpy-orange-bralet-sequinned-joggers-engertic-performance-Big-Feastival.html",
  "title": "Mel C , 49 , showcases her VERY toned abs in a skimpy orange bralet and sequinned joggers during energetic performance at The Big Feastival",
  "date": "20230827T174500Z",
  "domain": "dailymail.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Mel C, 49, showcases her VERY toned abs in a skimpy orange bralet and sequinned joggers during energetic performance at The Big Feastival\nMel C flaunted her very toned physique as she took to the stage at The 2023 Big Feastival held on Alex James' Farm in the Cotswolds on Sunday.\nThe iconic Spice Girls star, 49, looked incredible in a skimpy orange bralet as she displayed her rock hard abs.\nMel lived up to her Sporty Spice name as she completed the look with a pair of blue sequinned jogging bottoms.\nThe stunner put on a very energetic performance as she showcased her impressive vocals and ran about the stage entertaining the crowd.\nMel joined the likes of Tom Grennan and Mae Muller on the line-up at the three-day family friendly music festival.\nAns: Mel C, 49, flaunted her very toned physique as she took to the stage at The 2023 Big Feastival held on Alex James ' Farm in the Cotswolds on Sunday\nBorn to perform: The iconic Spice Girls star looked incredible in a skimpy orange bralet as she displayed her rock hard abs\nThe performance comes after Mel teamed up with Self Esteem and Olivia Dean to record a song roaring England's Women's World Cup squad on to victory.\nThe song 'Call Me A Lioness' was released last month, the day before the tournament kicked off in Australia and New Zealand and three days before the Lionesses get their quest for glory underway.\nUnlike Baddiel and Skinner's iconic Three Lions (It's Coming Home) - which its creators have said is about 'losing' - this tune, produced by an 11-strong team of artists who have come together to form Hope FC, strikes a more upbeat tone.\nAfter the success of the Lionesses at Euro 2022, fans were always unlikely to hear the lyrics 'one year of hurt' in the new tune - although the words 'winning once was not enough' can be heard.\nOther similarities include the use of commentary from last year's triumph - a stark contrast to the downbeat footage used in Three Lions - while the new song also name drops players from the national team, much in the same vein as the anthem from 27 years ago.\nProceeds from the track will raise money for charities that support grassroots girls' and women's football, with former Spice Girl Melanie C praising the impact of last year's victory on the sport.\nMelanie C said: 'It's been amazing to see the popularity of women's football grow and their incredible win last year was a huge inspiration for this new song for the World Cup.'\nShe added: 'I'm so privileged to be involved with a whole host of amazing female artists, cheering on our women's team to bring it home again!'\nDancing queen: The stunner put on a very energetic performance as she showcased her impressive vocals and ran about the stage entertaining the crowd\nIconic: Mel lived up to her Sporty Spice name as she completed the look with a pair of blue sequinned track suit\nPals: Mel (R) later posed fro snaps with fellow celeb guest Laura Whitmore (L)\nLeggy: The former Love Island star put on a leggy display in a red mini-dress\nMercury-prize nominee Self Esteem described the recording process as 'very fun', adding: 'The Lionesses are the future and I am so proud and excited to get behind them this summer.'\nThey are joined by Wolf Alice singer Ellie Rowsell, Sports Team's Al Greenwood, Marika Hackman, Rachel Chinouriri, Shura, Jasmine Jethwa, Rose Gray and Highlyy on the track.\nSongwriter Glen Roberts conceived the idea for the song after he realised the Lionesses did not have a song of their own while he was celebrating their Women's Euro 2022 victory last year.\nMost watched News videos\n- Extraordinary moment mass brawl breaks out between Brits on flight\n- Finance expert's TV interview interrupted by adorable granddaughter\n- Moment driver veers to target e-bike riders before killing teen\n- Moment Swiss bar fire owners collapse after being confronted\n- Chilling police interview of ISIS fanatic plotting UK attack\n- Astonishing moment a street is swallowed by a sinkhole\n- Israeli hostage reveals how she survived being tortured\n- Deepak Chopra confronted over his relationship to Epstein\n- Food vlogger dies after 'eating toxic devil crab'\n- Spy cam shows woman on her knees next to Jeffrey Epstein\n- New video shows man with backpack similar to Guthrie kidnapper\n- Toddler opens car door in traffic and sends biker flying",
  "word_count": 755,
  "scraped_at": "2026-02-14T13:04:02.430279"
}