{
  "article_id": "cfa4ba5e553b",
  "url": "https://thepeoplesperson.com/2023/01/31/manchester-united-insist-that-alessia-russo-is-not-for-sale-259122/",
  "title": "Manchester United insist that Alessia Russo is not for sale",
  "date": "20230131T220000Z",
  "domain": "thepeoplesperson.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Manchester United have rejected a second bid from Arsenal for Alessia Russo.\nLast night the Gunners put in a world record breaking bid for the 23-year old striker which was rejected immediately by the club.\nToday the Red Devils further reiterated that Russo was not for sale by turning down the Londoners’ second bid with just two hours to go before the window closes for domestic transfers.\nRusso’s contract is up at the end of this season and she turned down an extension last June with the Reds amid rumours it was to do with Champions League football.\nUnited are sitting on the top of the WSL table, ahead of Chelsea on goal difference and don’t want to sell to fellow title contenders.\nAlthough they may lose Russo in summer, selling now would be detrimental to United’s title hopes and the possibility of being in the Champions League next season.\nMeanwhile, Jonas Eidevall, Arsenal’s manager, has been vocal about their need to bring in a striker and are pushing to sign either Russo or Signe Bruun before the window closes tonight.\nHis squad has been decimated by injuries including ACL injuries to Beth Mead and Vivienne Miedema.\nDie-hard United fan, Russo, joined United in 2020 and has scored five goals in nine WSL appearances this season.\nFans will be delighted as it seems that their star striker is staying put for now.\nIf they were to qualify for Champions League and potentially win the league, surely it would be enough to convince Russo to stay in summer.\nDespite being linked with Lyon previously, no offer has been made by them in this transfer window.",
  "word_count": 274,
  "scraped_at": "2026-02-14T12:21:33.682670"
}