{
  "article_id": "cfa7fa9b211a",
  "url": "https://www.mlb.com/news/lou-gehrig-day-mlb-preview-2023",
  "title": "What Lou Gehrig Day means around MLB",
  "date": "20230601T044500Z",
  "domain": "mlb.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Eight years ago, everything changed for Aaron and Austin Nola when their uncle, Alan Andries, was diagnosed with ALS (Amyotrophic Lateral Sclerosis). While that diagnosis altered the way Andries lived his life, it didn’t change his passion for baseball, as he was involved in every part of Aaron and Austin’s baseball careers until he passed away on Feb. 10, 2021, following a courageous six-year battle with ALS, which is also known as Lou Gehrig’s Disease.\nOn Wednesday, the Nola brothers helped introduce this year’s Lou Gehrig Day activities with a virtual press conference. Lou Gehrig Day will be held on June 2, the date in 1925 that Gehrig became the Yankees starting first baseman, and the date in 1941 that he passed away at the age of 37.\nThe Nola brothers were joined at the press conference by Marlins pitcher Tommy Nance, Lou Gehrig Day spokesperson and 10-time All Star Steve Garvey, MLB researcher and writer Sarah Langs, founding member of the Zac Brown Band John Driskell Hopkins, Lou Gehrig Day committee member Phil Green and MLB senior vice president of social responsibility April Brown. MLB Network host Robert Flores moderated the event.\n“It’s incredibly important for us to celebrate this day under our new social responsibility platform MLB Together,” Brown said. “It’s important we keep this mission on the forefront every day, not just on June 2.”\nEveryone on the call had a personal connection to the disease, whether it was through their own diagnosis or someone close to them.\nGreen, a former University of Washington football player who was part of the committee that helped make Lou Gehrig Day a reality, said the day is just as much about celebrating those who are currently fighting the disease as it is about creating a better future for people who will be battling it.\n“If [Lou Gehrig] were diagnosed today, his prognosis would be very similar to what it would be today,” said Green, who was diagnosed with ALS in 2018. “We’re doing this so that people diagnosed tomorrow or five years from now have a much better prognosis. I really appreciate the baseball community embracing our community.”\nGreen wasn’t alone in that sentiment, as everyone who spoke mentioned the same thing: ALS is a deadly disease that is underfunded in its research.\n“We have a chance to show people that it's not just middle-aged men who suffer from this. It attacks everyone,” said Langs, who was diagnosed with ALS in 2021. “I’m glad to be able to share awareness. I see this as a really positive thing.”\nLike Langs, Hopkins was diagnosed with ALS in 2021, but he feels he had symptoms of the disease prior to his diagnosis. In 2022, Hopkins (who goes by “Hop”) started Hop On A Cure, a 501(c)3 dedicated to bringing awareness to ALS and stopping the disease in its tracks. Hopkins said the organization has already raised more than $1 million towards ALS research and has made donations to the Sean M. Healey & AMG Center for ALS at Massachusetts General Hospital and Duke University.\nOn June 2, Hopkins and the Zac Brown Band will be performing a live benefit concert at Great American Ballpark to help raise money for ALS research.\n“Not only has MLB stepped up their research, but individual teams are stepping up as well,” Hopkins said. “We as a human force can make progress and can be victorious over this thing. It takes teamwork and communication and we’re excited to be helping lead that charge.”\nIn 1984, Garvey won the Lou Gehrig Award, which is given annually to the player who best exhibits the character and integrity of Lou Gehrig. A 19-year MLB veteran who holds the National League record for most consecutive games played, Garvey understands what it was like to be the type of ironman that Gehrig was.\n“When I first fell in love with baseball, I read a biography of Lou Gehrig,” Garvey said. “From that moment I admired what he stood for.”\nAs an advocate for ALS, Garvey has gone to Washington D.C., where he’s spoken to senators and other politicians to advocate for more ALS research and funding.\n“I think the wind is beneath our wings,” he said. “I know there are men and women with ALS who are fighting every day, and we’re going to be right beside them.”\nNance's connection with ALS was forged nine years ago when his dad was diagnosed. Last year, both he and his dad joined MLB’s ALS committee, which happened in part due to his connections in the baseball world.\n“It all started when I was with the Cubs [in 2021],” Nance said. “I got connected through [Cubs manager] David Ross, and from there I decided I wanted to get involved with the community.”\nNance said the involvement helps him be with his dad from afar, as the time away from his family during the MLB season means that he sees the progression of the disease more than his other family members.\n“It’s not a pretty disease, and I struggle because I’m gone for so long,” he said. “My dad’s strong and he wants to continue to spread awareness, and I’ll do anything I can do to help.”\nOn June 2, every TV broadcast booth will feature an illuminated wood star known as “A Langs Star,” an effort that was put together by ESPN’s Karl Ravech and woodworker Christopher Owens. The 22x22 stars are available for purchase at StarsforSarah.org, with all the proceeds going towards Project ALS on Sarah’s behalf.",
  "word_count": 923,
  "scraped_at": "2026-02-14T13:48:32.925370"
}