{
  "article_id": "cfb4a2e73d16",
  "url": "https://www.nytimes.com/athletic/6618613/2025/09/11/brazil-ancelotti-world-cup/",
  "title": "Brazil race against time for World Cup , ticket sales for tournament hit initial glitch",
  "date": "20250911T164500Z",
  "domain": "nytimes.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "The Athletic FC ⚽ is The Athletic’s daily football (or soccer, if you prefer) newsletter. Sign up to receive it directly to your inbox.\nHello! Just how strong is Carlo Ancelotti’s Midas touch?\nOn the way:\n- Brazil lose their aura\n- Ex-PL ref’s criminal charge\n- World Cup ticket sale delays\n- Can Ramos win a Grammy?\nBrazil in Bother: Ancelotti’s team faces a fight to be ready for the World Cup\nI’m reluctant to dig out Brazil’s national team because the last time they made a meal of World Cup qualification, they went on and won the damn thing. That was 2002 and the age of Ronaldo, Rivaldo, Ronaldinho, Roberto Carlos and Cafu; a roll of honour that couldn’t fail indefinitely.\nAdvertisement\nPresent-day Brazil, however, aren’t so stacked. They have their showmen, in the traditions of South American flair, but a historically rare shortage of fear factor. They’re also, in layman’s terms, not especially good — as outlined succinctly in Jack Lang’s review of their latest qualifying campaign.\nWe’ll start with the basic facts. They finished fifth in a CONMEBOL group of 10 nations. Points-wise, they were scraping the barrel. Were it not for FIFA trying to ram as many countries as it credibly can into a 48-team World Cup — increasing South America’s automatic places from four to six — Brazil and Carlo Ancelotti would be lumbering towards a play-off. When have the Selecao failed to reach FIFA’s big show, you ask? Never. It’s unheard of for them to run it so close.\nOnce upon a time, coaching Brazil was the international scene’s plum job. As it is, Ancelotti — appointed in May — is the Hail Mary for dysfunction that has no instant cure. Qualification was secured three months ago, so the defeat against Bolivia on Tuesday was neither here nor there, but Ancelotti is part of a trend in international coaching: fighting the clock to be ready for next summer. Without having much in the way of preparation time, he’s an old dog, learning new managerial tricks.\nTo some extent, he is the equivalent of Ronaldo, Rivaldo et al: so outrageously decorated that your heart tells you he can spin straw into gold. But can a team hammered so badly by World Cup holders Argentina in March convince themselves of their own potential?\nCase for the defence\nAny time I read coverage of Ancelotti’s squad in Brazil, there’s an undertone of pining for Neymar. It’s somewhat misty-eyed and more than a little hopeful. He’s been out of the Brazilian squad for two years, largely as a consequence of injury. European club football has spurned him, and Ancelotti wasn’t tempted to call him up for the final two qualifiers. At 33, he has been around the block.\nAdvertisement\nAncelotti has alternatives and attacking choices aplenty. There is Raphinha (above), Vinicius Junior, Joao Pedro, Richarlison, Rodrygo and Savinho. Give Ancelotti three wishes and he might spend them all on manufacturing equivalent quality across his back four. Paraguay’s defensive record was superior in qualifying, as was Uruguay’s and Ecuador’s. Ecuador conceding five times in 18 games makes them a team to dodge in December’s World Cup draw.\n“Something can always be magicked from nothing,” my colleague Jack writes of Brazil. “Just look at what happened at the 2002 World Cup.” Unfortunately for Ancelotti, this isn’t football as it was in 2002 and it isn’t that stellar a squad either. Set alongside his countless coaching honours, a World Cup winner’s medal would eclipse them all.\nNews round-up\n- Former Premier League referee David Coote has been charged with making an indecent image of a child. Coote, 43, pleaded not guilty at Nottingham Magistrates’ Court this morning. The case is set to be heard at Nottingham Crown Court on October 9.\n- England’s Championship is considering altering its fabled play-off structure to add an ‘eliminator round’ and increase participants from four to six. I’ve often wondered if the traditional format would evolve eventually, and the idea has merit.\n- After our recent coverage of Football Manager 26, the game has an official release date: November 4. Set your alarms.\n- He might be getting on, but Christian Eriksen was still too good to be languishing in the free-agency market. German club Wolfsburg have signed the 33-year-old on a two-year deal, igniting his career again after Eriksen’s exit from Manchester United.\n- West Ham United can be an odd club. Having released goalkeeper Lukasz Fabianski in May and then spent millions on buying Mads Hermansen from Leicester City, they’ve re-signed Fabianski on a free. He turns 41 before the end of the season.\nTicket test: World Cup lottery hits problems on launch day\nFIFA’s World Cup ticket lottery, the first of multiple phases of sales, opened yesterday… and of course there were technical issues. What fun would online queuing be without the dreaded 404 error?\nSome users (including TAFC reader Mark Pitcock, who alerted us to the “glitches”) got trapped in a waiting room; promised access after five minutes and then held there for an hour or more. Others who waited it out were hit with a message reading: “HTTP Status 400 — Bad Request.”\nFIFA said the snags were down to “extraordinary” demand, and it’s because of the popularity of a tournament as big as the World Cup that the organisation is free to dream up a convoluted application process, making a mint as it goes.\nAs it happened, there was no need for anybody to pile in desperately yesterday. The pre-sale lottery window is open for nine days and doesn’t operate on a first-come, first-served basis. It’s luck of the draw for those who enter. Actual sales for the chosen ones kick off next month — which is when the stress test will really start in earnest.\nAdvertisement\nMoore To Follow: Rhea, 15, sets record for youngest scorer on debut\nI got my first part-time job aged 15. It involved washing dishes in a pub/restaurant that later burned down (nothing to do with me, your honour).\nRhea Moore, at the same age, is a pro American footballer, because that’s how fast the kids ascend these days. I hadn’t heard of her before the weekend but her name will stick with me now because on Sunday, she set a record as the youngest goalscorer in the history of women’s professional soccer in the United States. The finish (above) was a sweet one, too.\nStrictly speaking, Moore was 15 years and 332 days old and even funnier, she was making her debut for Dallas Trinity against Sporting Jax in the United Soccer League’s top division, the Gainbridge Super League. She had been on the pitch for eight minutes. “It was like a dream come true, really,” she told Tamerra Griffin. Something tells me she won’t be remembered as a one-hit wonder.\nAround TAFC\n- Sergio Ramos, or Mr Low Profile, has released a single professing his love for Real Madrid (above). He’s aiming to win a Grammy. I’m saying nothing.\n- Nick Miller’s piece on Premier League anomalies is ace. Any idea who appeared 24 times in the division without winning once? Or which defender came up with one assist in more than 22,799 minutes of play?\n- Erling Haaland was so stupidly good for Norway against Moldova on Tuesday — five goals, two assists — that Eduardo Tansley rewatched the 11-1 pasting and picked apart every move. I mean this sincerely: it’s great that football writing passes as a real job.\n- Henry Bushnell’s column is bang on the money: if every USMNT player is fit, Folarin Balogun starts up front. No ifs or buts.\n- The Athletic FC Podcast got into the Ange Postecoglou for Nuno Espirito Santo swap at Nottingham Forest. I’m still a bit perplexed by it. Listen on Apple and Spotify.\n- Most clicked in Wednesday’s TAFC: the USMNT’s welcome bounce-back.\nAnd finally…\nSpecial thanks are due to the Scottish Challenge Cup, which has been feeding TAFC’s GIF habit this week. Today’s ‘And Finally’ comes from Kelty Hearts versus Stranraer, where referee Josh Hay (no relation, otherwise I’d have disowned him) accidentally clattered Stranraer’s Bernard Coll during the pre-match warm-up.\nColl’s grimace made it clear he felt the impact, and then some. At least Hay had the good humour to offer out his red card afterwards, inviting Coll to send him off.\n(Top photo: Pablo Porciuncula/AFP via Getty Images)",
  "word_count": 1403,
  "scraped_at": "2026-02-14T12:37:01.597370"
}