{
  "article_id": "cfea7186d8be",
  "url": "https://www.sbs.com.au/news/article/the-matildas-are-back-together-for-the-first-time-since-the-world-cup-heres-what-you-need-to-know/zt68q15l9",
  "title": "How to watch the Matildas Olympic trials",
  "date": "20231025T223000Z",
  "domain": "sbs.com.au",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Two months after their historic performances at the 2023 FIFA Women's World Cup, the Matildas are coming back together as they start their campaign to qualify for the 2024 Paris Olympics.\nDuring the World Cup, the Matildas captured the attention of the nation and became household names as they advanced to the semi-finals for the first time and broke viewership records.\nNow, they are preparing to return to the football pitch with captain and hometown hero Sam Kerr and vice-captain Steph Catley headlining the 22-player squad.\nHere's what you need to know and how to watch.\nWhere are the Matildas playing next and how can you watch?\nThe Matildas will be competing in the Women's Olympic football tournament Paris 2024 Asian qualifiers Round 2 in Perth.\nThe team is in group A and their three matches are on Thursday 26 October, Sunday 29 October and Wednesday 1 November. All the games are sold out.\nThe games will be shown on 10 Bold in Western Australia, Queensland and the Northern Territory and Channel Ten in NSW, the ACT, Tasmania and South Australia, or can be streamed via 10 Play and Paramount +.\nAnother eight teams from Asia, making up groups B and C, will be playing on the same dates, in Xiamen, China and Tashkent, Uzbekistan, respectively.\nThe three winners of the groups and the best group runner-up will go through to the third round of qualification.\nWho are the Matildas playing in the Olympic qualifiers?\nThe Matildas will play Iran on 26 October at Perth Rectangular Stadium in the first-ever international match between the two teams. The match will kick off at 7pm Perth time (10pm AEDT).\nOn 29 October they will take on the Philippines at 3pm Perth time (6pm AEDT). The game was originally scheduled for Perth Rectangular Stadium, but was moved to the larger Perth Stadium after allocated tickets were exhausted.\nOn 1 November, the Matildas will return to Perth Rectangular Stadium to take on Chinese Taipei with kick-off at 7pm Perth time (10pm AEDT).\nAs the highest-ranked team in the group and the host, Australia will be favoured to win all three of their Group A games.\nThe Matildas came fourth in the Tokyo Olympics in 2021.\nWhat have the Matildas been doing since the World Cup?\nAfter their historic performance at the World Cup, the Matildas returned to club football, with many based in the United Kingdom and Europe.\nKerr plays as a forward for Chelsea, and this week was one of five players nominated for the BBC Women’s Footballer of the Year.\nShe was also nominated for the Ballon d’Or prize for the world's best player in September alongside Hayley Raso, who plays for Real Madrid.\nCatley plays for Arsenal alongside Caitlin Foord.\nEllie Carpenter plays for Olympique Lyonnais in France, while fellow defender Alanna Kennedy plays at Manchester City alongside Mary Fowler.\nGoalkeeper Mackenzie Arnold plays for West Ham, where she has been appointed captain for the 2023/2024 season.\nCortnee Vine, who scored the winning penalty that took Australia to the semifinal, plays for Sydney FC.\nHead coach Tony Gustavsson reflected on the return to the pitch following the \"exhilarating and unifying\" World Cup.\n“While we have had some time to reflect on the impact of this remarkable team on and off the pitch, the special trait of this group is that they are always looking to embrace the next challenge and that is now qualifying for the Paris 2024 Olympic Games,\" he said.",
  "word_count": 581,
  "scraped_at": "2026-02-14T12:57:05.911827"
}