{
  "article_id": "cfebf706e597",
  "url": "https://www.90min.com/features/lucy-thomas-reflects-birmingham-city-near-misses-new-beginnings",
  "title": "England Lucy Thomas reflects on Birmingham City near misses and new beginnings",
  "date": "20240906T093000Z",
  "domain": "90min.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "England's Lucy Thomas reflects on Birmingham City's near misses and new beginnings\n- Birmingham City Women begin their 2024/25 Championship campaign against Sunderland\n- The Blues finished fifth in the standings last term and 10 points off promotion\n- 90min caught up with Blues goalkeeper Lucy Thomas to discuss the new season\nBirmingham City are ready to challenge again. Following their relegation from the WSL in 2022, they have pushed for a Women's Championship title (and promotion) in both the 2022/23 and 2023/24 seasons. But the Blues fell short on both occasions.\nTheir first campaign in the Championship was their strongest, finishing on 47 points and just one behind winners Bristol City. Last season, after a haphazard start, they went on an outstanding run to top the table at Christmas. In the new year, however, results became far less consistent. Coach Darren Carter vacated his role in April to pursue other opportunities, and maintaining the form that served them so well in the earlier stages of the season proved to be unattainable.\nBirmingham placed fifth in the standings, as many as ten points off champions Crystal Palace. A return to the top flight of women's football in England would have to wait.\n\"It was frustrating,\" City goalkeeper Lucy Thomas admitted, speaking at a pre-season media event.\n\"We had a poor start [to the season], but we ended up top at Christmas. We maybe didn’t expect that after the start we had.\n\"We need to start better, as we didn't start very well after Christmas, either. We need to make sure we're fit enough and ready to go from day one. As players, we're a very tight group, but maybe we need to be better at keeping our heads in moments.\n\"Sometimes [last season], we would get lost if we'd go a goal down, and I think that's potentially where we lost the title race. We weren't able to say we'll get back into this game. If we were winning games, we'd see it out, but if we weren't, that’s when we lost it. As a group, we need to get better at that.\"\nOne significant change the club has undergone this summer is in the dugout. Throughout his two-and-a-half seasons in charge, Carter had provided a sense of stability when it was needed most, and helped lay some of the foundations for the club to push on. But, it was becoming increasingly clear more would be needed if the team were to make that next step, and he left the club by mutual consent in the latter stages of the campaign.\nAmy Merricks was viewed as the ideal appointment to push them back into the top flight, and she already had a solid working relationship with technical director, Hope Powell following the pair's time at Brighton & Hove Albion. Merricks took charge in April, but she has now had a full pre-season and a transfer window with which to make her mark on the squad.\n\"She's got ideas for everything, and she's changed a lot, which I think was needed,\" Thomas continued, speaking about the new manager's impact on the team so far. \"Her detail on the pitch tactically is really impressive, and I know she's only just started drip feeding it into the team.\n\"She has changed little things about how the environment works, our schedules, and what we do on the pitch. She's taken it to another level.\"\nAnother significant change over the last 12 months has been the arrival of new owners, Knighthead, along with NFL legend Tom Brady. In a short time, they have made significant strides in rebuilding trust with the club's fanbase, and they're determined for the women's team not to get left behind.\n\"They definitely are [making a difference],\" the City goalkeeper added, when asked how things are running under the new owners. \"We had Tom Wagner in training recently, just to watch and ask us things. He's very open. If we've got ideas for things, he absolutely will try and implement them.\n\"The facilities this year [have improved]. There's new buildings, the changing rooms and pitches have been redone, and it's all for us. The men aren't at the same training ground anymore. Essentially, everything they are doing there is for us.\n\"He seems absolutely invested in us, and he comes to as many games as he can. He has conversations, and tries to get to know us as players. We can't thank them enough really.\"\nFor 24-year-old Thomas, this will be her third season at Birmingham City. She joined the club in July 2022, after spells with Coventry United and London City Lionesses, and she'd also represented England at youth level.\nHer form for the Blues continued to catch the attention of the national side, but this summer it was first-team manager Sarina Wiegman on the other end of the phone. Thomas was initially named on the standby list for the Lionesses' Euro 2025 qualifiers, replacing an injured Kayla Rendell. Further injury to Mary Earps in June meant she eventually joined up with the main squad.\n\"It was a bit mental! I was just on my holidays and got a phone call from Sarina [Wiegman],\" Thomas beamed, reflecting on her maiden call-up. \"It wasn't expected at all, but it was an unreal experience. The goalkeepers there, and the team as a whole, are world class. I felt like I learnt a lot that I can bring back to club football.\n\"Each goalkeeper [in the England squad] has their own attributes they are world class at. You can learn from anyone you work with. For me, I'm quite a vocal goalkeeper anyway, but some of the detail they go into with how they communicate, I've learnt so much from that.\n\"The speed of play - everything - you have to level up when you're there, and hopefully I'll be able to maintain that now I'm back with my club.\"\nREAD THE LATEST WOMEN'S FOOTBALL NEWS, FEATURES & ANALYSIS",
  "word_count": 996,
  "scraped_at": "2026-02-14T13:05:00.070568"
}