{
  "article_id": "cff7206ecae9",
  "url": "http://africa.chinadaily.com.cn/a/202408/21/WS66c54216a31060630b9241ec.html",
  "title": "Man City Phil Foden and Khadija Shaw voted PFA player of the year in English soccer",
  "date": "20240821T030000Z",
  "domain": "africa.chinadaily.com.cn",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Man City's Phil Foden and Khadija Shaw voted PFA's player of the year in English soccer\nMANCHESTER, England — Manchester City duo Phil Foden and Khadija Shaw were voted the men’s and women’s player of the year in English soccer for last season at the Professional Footballers’ Association awards on Tuesday.\nThe 24-year-old Foden helped Man City win a fourth consecutive Premier League title, scoring 19 times and providing eight assists. Shaw was the top scorer in the Women’s Super League as the Jamaican forward netted 21 goals, although City lost the title on goal difference to Chelsea.\nFoden and Shaw also won the equivalent award from the Football Writers' Association, which is voted on by journalists. The PFA winners are selected by professional players.\nChelsea attacking midfielder Cole Palmer was voted the men’s PFA young player of the year, with Manchester United midfielder Grace Clinton winning the women’s prize after her performances on loan at Tottenham last season.\nPalmer was second only to City’s Erling Haaland in the Premier League scoring charts with 22 goals and also had more assists than any other Chelsea player, with 11. Haaland won the men's player of the year award in 2023.\nClinton contributed four goals and four assists in 20 WSL appearances.\nMost Popular\n- Guangdong beats Macao 2-0 in first leg of soccer cup\n- Para teams set to leave mark on ice\n- US skier Johnson wins women's downhill as Vonn crashes at Milan-Cortina Games\n- Su Yiming clinches first medal at Milano-Cortina\n- Over 300 athletes from 35 countries and regions kick off Asian championships in Tianjin\n- Legacy of Beijing 2022 lives on as Milan welcomes Games",
  "word_count": 279,
  "scraped_at": "2026-02-14T12:42:12.867217"
}