{
  "article_id": "d015d53be868",
  "url": "https://www.burntorangenation.com/2023/8/25/23846351/longhorns-daily-news-texas-backup-qb-maalik-murphy-arch-manning-quinn-ewers-steve-sarkisian",
  "title": "Longhorns Daily News : Who wins Texa backup QB job – Maalik Murphy or Arch Manning ? ",
  "date": "20230825T231500Z",
  "domain": "burntorangenation.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "It becomes a first-world problem when a coach like Steve Sarkisian has to choose between redshirt freshman Maalik Murphy and true freshman Arch Manning for the Texas Longhorns’ backup quarterback job. On3’s theorizing, albeit with good reason, that Manning will eventually overtake the elder Murphy for the gig behind returning starter Quinn Ewers.\nLonghorns Daily News: Who wins Texas’ backup QB job – Maalik Murphy or Arch Manning?\nPlus: Julien Alfred deserves everyone’s shoutout\nI think they’ll play whoever they think is better,” On3 analyst Andy Staples said, according to Inside Texas. “You know, the one thing with Arch is, they’re not going to pressure, like the family and that, they’re not going to pressure anybody to play him. They seemed to go in with a pretty mature plan for him, and are perfectly accepting if he needs a year or so to win that job. But maybe he develops faster, and they feel like he’s ready.\nWHAT THEY’RE SAYING ABOUT THE LONGHORNS\nAustin American-Statesman: Texas expects its special teams to complement offense, defense\nAustin American-Statesman: Bohls, Golden: Texas’ softer schedule should offer no excuses\nAustin American-Statesman: Texas’ top 2022 defensive performances, returning leaders for 2023\n247Sports: Morning Brew: Texas linebacker expected to miss time with injury\n247Sports: Texas football picks up votes for Big 12’s most overrated, underrated team for 2023 season by CBS Sports\nInside Texas: Texas ranked No. 5 in Pro Football Focus’ preseason power rankings\nInside Texas: On Texas Football: What was the reason behind Xavier Worthy’s 2022 regression?\nICYMI IN BURNT ORANGE NATION\nRECRUITING ROUNDUP\n247Sports: Potential Texas flip targets to monitor this season\n247Sports: The Huddle: Recruiting notes from Thursday night\n247Sports: Recruiting Retrospective: How Texas kept Colton Vasek in Austin\nInside Texas: Recruiting Humidor: Wingo, McKinley, Bussey, new visitors, hoops news\nInside Texas: Offensive line target Jackson Christian talks Texas\nInside Texas: Texas commit Cam Scott has recruiting targets in mind\nBIG 12 BREAKDOWN\nDallas Morning News: As Texas, Oklahoma approach departure to SEC, Big 12 is bigger than ever\nOur Daily Bears: 2023 Baylor Football Opponent Quick-Hitter: West Virginia\nOur Daily Bears: What the predictive stats say about Baylor for 2023\nFrogs O’ War: 2023 TCU Football Opponent Preview: Oklahoma Sooners\nFrogs O’ War: Frogs Odds: 2023 preseason futures\nWide Right & Natty Lite: WRNL predicts the 2023 football season\nBring On The Cats: Position Group Breakdown: Wide Receiver\nWHAT WE’RE READING\nSB Nation: Noah Lyles is the preeminent track superstar of the post-Usain Bolt era\nSB Nation: Luis Rubiales’ gross behavior at Spain’s Women’s World Cup finale keeps getting worse\nSB Nation: Dwyane Wade was the NBA’s most human superstar\nNEWS ACROSS LONGHORN NATION AND BEYOND\n- Let’s all send a very proud shoutout to Texas alum Julien Alfred.\nOdds/lines subject to change. T&Cs apply. See draftkings.com/sportsbook for details.",
  "word_count": 468,
  "scraped_at": "2026-02-14T13:37:44.292349"
}