{
  "article_id": "d057bc5a4166",
  "url": "https://www.standard.net.au/story/8929233/2025-hampden-league-netball-preview-what-to-expect-this-season/?cs=2611",
  "title": "2025 Hampden league netball preview : What to expect this season | The Standard",
  "date": "20250403T014500Z",
  "domain": "standard.net.au",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "New coaches, game-changing recruits and injuries could shape the 2025 Hampden league open netball season.\nSubscribe now for unlimited access.\nor signup to continue reading\nTen clubs will enter the fray for round one on Saturday, April 5 eager to sing the song and start their seasons on a winning note.\nWho are the teams to beat and who is going to find wins harder to come by?\nThe Standard's JUSTINE McCULLAGH-BEASY has looked at each team's list ahead of the season-opening round.\nCAMPERDOWN\nLAST SEASON: Sixth.\nSUMMARY: The youth at the Magpies' disposal is exciting. The addition of Koroit premiership goal shooter Nell Mitchell will give them an advantage in the ring and late addition Annaliese Hughes, a medical student who is living in Warrnambool, will add height in the defensive end. Emerging player Izzy McDowall has crossed from North Warrnambool Eagles. New coach Jill Leader arrives at Leura Oval with an enviable resume, having led Victorian Netball League club Geelong Cougars and Geelong league side Geelong West Giants. Hampden representative Lily Eldridge will leave a hole in defence, having taken on the A-grade coaching gig at Warrnambool and District club Nirranda. Matilda Pollard (Sebastopol) and Leah Purcell are the Magpies' other omissions.\nCOACH'S CALL: \"We are focusing on ourselves, knowing we were very close to making finals last year. There were a lot of games they lost by very small margins. My expectation is we'll make finals, I feel like we could push for a top-three (spot) if everything goes well. In saying that, I don't know the rest (of the competition), so I have got my blinkers on in that we're really focusing just on us. We picked up a defender down one end and a goaler down the other end and the young kids and everybody who has been there a while is super keen to have some experience around them. The energy levels are really high. \" - Jill Leader\nPREDICTION: Fifth. The only team to beat premier South Warrnambool in 2024 and, through recruiting and natural progression, should climb up the ladder this season.\nCOBDEN\nLAST SEASON: Third (preliminary final).\nSUMMARY: Five massive inclusions automatically put Cobden in the premiership frame again. Sophie Hinkley, Sarah Moroney and Remeny McCann (all on maternity leave), Sophie Blain (plantar fasciitis) and recruit Macey Hicks, who hails from Yarrawonga and is a national barefoot water skier, will give new coach Nadine McNamara - in her second stint at the helm - plenty of options. Combine that with the Bombers' youth and it looms as another success season for the team in red and black. The only confirmed omission is Emily Finch (Achilles/pregnancy).\nCOACH'S CALL: \"For us, it is a little bit unknown at this stage. We've got some players returning from a year off and we've got some young players who have been developing really well and playing some high-level netball the past two years, so for us the first few rounds are going to be about consolidating our squad and trying to find what works best for us and what combinations complement each other. The girls who have had a year off are really excited about the prospect and we're really excited as a club to be able to provide women who have had children (with a place to play) and to support them in their travel. We have Remeny coming from out Branxholme way, Sarah from Koroit and Jess McGlade from Warrnambool.\" - Nadine McNamara\nPREDICTION: Third. The Bombers' returnees make them a powerful force.\nHAMILTON KANGAROOS\nLAST SEASON: Eighth.\nSUMMARY: New coach Jarryd Anton returns to Melville Oval with experience garnered as leader of Bellarine club Port Arlington. He welcomes back all-rounder Madsie Phillips who \"has the ability to play across all seven spots\". Erin Macdonald (defensive midcourter), Rachael Ough (goal shooter) and Kyra McKinnis (midcourter) have jumped on board, while Hayley Sherlock has returned to the open side after time in division one. Molly O'Brien (university in Ballarat), Kellie Sommerville (spending 12 months in Canada) and Mimi Chun (injury) are the Roos' omissions. Clare Crawford is having a year off from playing but will remain at the club in a coaching capacity.\nCOACH'S CALL: \"We're aiming to make some significant improvements on where we finished last year. We're looking to implement a much more structured game plan and holding that over more consistent minutes is the ultimate goal, which will hopefully move us closer to being more successful and taking more wins. We'll be implementing quite a physical presence out there in the hope we can bring a certain level of intensity to our game play.\" - Jarryd Anton\nPREDICTION: Eighth. A work in progress and, like its football side, could cause some surprises.\nKOROIT\nLAST SEASON: Runner-up.\nSUMMARY: Danielle McInerney will coach for a second season after leading the young Saints to an unlikely grand final berth in 2024. Goal shooter Nell Mitchell has left for Camperdown but midcourter Millie Jennings, who has moved away for university, will remain part of the Saints' line-up when available. Former captain Emily-Rose Dobson has returned to the club and will add experience. Defender Layla Monk is eyeing a return following a serious knee injury and teenager Chloe Gleeson will be part of the open squad. The Saints will have to juggle player availability with players also committed to Big V basketball with Warrnambool Mermaids, Coates Talent League football side GWV Rebels and school netball. Edie Batt, a 15-and-under player who is the cousin of Shelby O'Sullivan and Indi O'Connor, will debut in round one.\nCOACH'S CALL: \"We will have a different line-up every week again, so it will be like last year's approach, just taking it game-by-game. Finishing in the top-four is really important to us, and we got pretty far last year (making the grand final), and to go one step further would be ideal. We still know we have lots of work to do to get there. We have a lot more versatility this season and I feel that will be a bit of a bonus.\" - Danielle McInerney\nPREDICTION: Fourth. Its best line-up is dangerous but getting it together regularly could be a challenge.\nNORTH WARRNAMBOOL EAGLES\nLAST SEASON: Fifth (elimination final).\nSUMMARY: Kate O'Meara has returned to Rokewood, Izzy McDowall has crossed to Camperdown, Skye Billings is sidelined with a knee injury but Charlotte Smedts - niece of coach Maddison Vardy - has joined via Koroit. Teenager Matilda Sewell has basketball commitments in Geelong but remains on the Eagles' list. The Eagles' depth will come to the fore.\nCOACH'S CALL: \"We did lose a couple from the year just gone but we're really, really excited for the year ahead. We have a lot of juniors, about five or six, who will definitely play open netball for the club this year. We've also got a few experienced heads who are still on the court, like myself, and we've got Maisie Barlow who is in unbelievable form at the moment and ready to go, and we've moved Vic Grundy from the shooting end to the defensive circle and she's had an awesome pre-season in there. We've also still got experienced heads in Ash Ferguson, Phoebe Wittmann and Chelsea Quinn. I think we'll be competitive for sure.\" - Maddison Vardy\nPREDICTION: Sixth. Always around the mark and will push for finals.\nPORT FAIRY\nLAST SEASON: Last.\nSUMMARY: Ange Northcott and Emily Forrest have teamed up as new co-coaches. Inika Tobin-Salzman, Laura McDonald and Georgia McLennan have all signed on and midcourter Maddie Green has returned in a major boost. Charli Crouch and Alicia Moloney have committed for full seasons. Stacy Dunkley (Russells Creek) and Emma Stacey (Allansford) have returned to the Warrnambool and District league.\nCOACH'S CALL: \"We're working hard on building connections and implementing structures, so we're well-equipped when we're on the court and we can adapt quickly if we have to. We hope to be more competitive and can maybe ruffle some feathers in the top half of the ladder.\" - Ange Northcott\nPREDICTION: Tenth.\nPORTLAND\nLAST SEASON: Ninth.\nLaura Kelly has committed to a second season as coach and she's bolstered the Tigers' depth. Tess Norman, Karla Payne, Mackenzie Barr and Sienna Stone, who is also playing Big V basketball for Warrnambool Mermaids, have joined as recruits with height. Ellyse Chapman, Rachel Hansen, Ella Smith and Matilda Hutchison also join the squad, which has lost midcourter Remy Grant, who has moved to the United Kingdom.\nCOACH'S CALL: \"Rach, Ella and Matilda have all come across from Tyrendarra. Rach has probably slotted - not that Remy is replaceable - but into that centre position and had a massive pre-season. She is excited for the challenge Hampden has to offer. Karla, Tess, Sienna and even Mackenzie all offer a level of height Portland has lacked previously, so I think having some bigger bodies and height is always exciting as a coach. As a team, we definitely have a lot more depth and flexibility with players.\" - Laura Kelly\nPREDICTION: Ninth. More options make the Tigers a new-look proposition in 2025.\nSOUTH WARRNAMBOOL\nLAST SEASON: Premier.\nSUMMARY: Master coach Will Jamison will strive for four flags in four seasons. He has lost assistant coach Ange Northcott to Port Fairy as the Seagulls' new co-coach. Defensive pillars Genevieve O'Connor and Carly Watson (both pregnant) will miss the season while goal option Meg Carlin will be sidelined in the early rounds after breaking her finger at Warrnambool Mermaids' Big V basketball training.\nCOACH'S CALL: \"We'll pull from our existing senior squad as well as some of our junior players. The thing that gives me faith is you've got Hollie Phillips and Meg Kelson both training in the (Geelong) Cougars' under-23 environment (in the Victorian Netball League) and Ally O'Connor, who is now training with (Super Netball club Melbourne) Vixens' reserves, so we're anticipating growth out of those players. We forget they're still young, still growing and still improving, so we'll look for those incremental improvements from them.\" - Will Jamison\nPREDICTION: First. Have lost high-calibre players but deserve to enter the season as the hunted.\nTERANG MORTLAKE\nLAST SEASON: Seventh.\nSUMMARY: Passionate clubperson Kym Grundy has re-signed as coach for a second season while the bulk of the open side has returned. Jo Glennan has returned to the sport after time off, Mahni Johnstone is also back and Isabelle Kenna, who is \"young, fit and keen\", has crossed from Warrnambool and District league side Kolora-Noorat. Alice Suhan will not play after earning an employment opportunity in Kununurra.\nCOACH'S CALL: \"We want to improve on last year and go that one step further. We want to try and play finals. We felt like we didn't quite close out games (in 2024), we were competitive with all teams. We have worked hard on fitness and, hopefully with a few inclusions and all the juniors we have, that might help us to run those four quarters and maybe get some more wins.\" - Kym Grundy\nPREDICTION: Seventh. Will cause a few headaches.\nWARRNAMBOOL\nLAST SEASON: Fourth (first semi-final).\nSUMMARY: Major winners in the netball off-season, adding Kasey Barling (Koroit), Jo Couch (Nirranda) and Tahni Porter (North Warrnambool Eagles) to strengthen a finals-calibre side. Couch arrives as one of the Warrnambool and District league's best and will add a spark to the midcourt. Dakota Crichton (Geelong, WNBL) will have basketball commitments and is the Blues' only omission.\nCOACH'S CALL: \"We are really spoilt for choice this year. We've got really good depth across the team and it's afforded me the opportunity to trial several combinations across the off-season. I feel pretty prepared if we need to change things up throughout the season. The ambition is firstly to finish higher than we did last year when we finished fourth and that's a bare minimum. It's fabulous to have attracted these players to the club but we're still going to take time to settle I think.\" - Kate Linsdey\nPREDICTION: Runner-up. Signing Jo Couch - a three-time Warrnambool and District league best and fairest - was a massive coup and they've spent the past two years building a list capable of contending under coach Kate Lindsey.",
  "word_count": 2033,
  "scraped_at": "2026-02-14T12:43:36.319789"
}