{
  "article_id": "d058aea20887",
  "url": "https://www.sounderatheart.com/2024/06/match-preview-seattle-reign-vs-gotham-fc/",
  "title": "Match Preview : Seattle Reign vs . Gotham FC",
  "date": "20240630T014500Z",
  "domain": "sounderatheart.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Seattle Reign is back on the road this weekend for a rematch of the 2023 NWSL Championship. On Sunday, June 30, the Reign face Gotham FC at Red Bull Arena in New Jersey. The match kicks off at 10 a.m. PT and will air on ESPN 2 / ESPN Deportes and stream on ESPN+.\nAfter winning the NWSL Championship match, Gotham did a lot of recruiting this offseason. They brought in several free agents who represent the U.S. women's national team: Emily Sonnett and Rose Lavelle from the Reign, Tierna Davidson from Chicago, and Crystal Dunn from Portland. They also brought in unrestricted free agent Ella Stevens, who currently leads the team in scoring.\nGotham has been clicking lately with all these new players. Until their loss last week, Gotham had won five straight games and was undefeated in nine matches. They've also been dealing with injuries, with a rotating set of forwards, including Stevens, Esther González, and Lynn Williams unavailable in recent matches.\nWith just one more regular-season match next week ahead of a league break and the NWSL / Liga MX Femenil Summer Tournament, the Reign are on the hunt for their first road result of the season. They are 0-7-0 on the road this year.\nRecent Results\nThe Reign gave up a late lead and drew 1-1 with Racing Louisville at home last week. Gotham FC hosted the Washington Spirit and lost 2-0, marking the team's first home loss of the year.\nHead-to-Head\nThis is the first matchup between the two teams in 2024. The Reign are 12-9-7 against Gotham.\n- That includes a 6-3-3 road record against Gotham.\n- The Reign won the last two meetings between the teams at Red Bull Arena, 2-0 in April 2023 and 1-0 in September 2022.\nQuick Stats\n- Gotham (8-3-3) sits in 4th place heading into the weekend and has scored 16 goals and conceded 11.\n- Seattle Reign (2-9-3) sits in 13th and has scored 14 goals and conceded 26.\n- Gotham typically lines up in a 4-3-3 formation.\n- Ella Stevens has five goals and one assist to lead Gotham.\nWhat to Watch\nLots of defensive pressure\nGotham leads the league in a key pressing stat, and they have since last year. It's not a new tactic for this team under head coach Juan Carlos Amorós. They allow their opponents 8.6 passes, on average, before they commit some kind of defensive action – a tackle, interception, or foul. That's the fewest passes allowed in the league per defensive action, which means Gotham has the most intense press and is going to try to close down on the Reign quickly.\nGotham is also second in the league, behind Kansas City, in the number of high turnovers they have forced (197 compared to 186 for the Reign, who are third). Those high turnovers have led to 25 shots and three goals for Gotham.\nThe Reign have been better in possession in recent matches, which had been a key reason they were leaking goals. Head coach Laura Harvey is hopeful they are trending in the right direction and can bring more of this on Sunday.\nA hard team to break down\nOn the other end, Gotham doesn't give up many chances. In fact, they allow the fewest shots in the league and the second-lowest expected goals (xG). The opportunities that sneak through are often snatched up by Ann-Katrin Berger, who was named to the NWSL Best XI in May.\nBut the Washington Spirit showed that teams can find some luck pressing them, as Gotham likes to play with a high defensive line.\nTeams that can break Gotham's initial high press can also find some good opportunities, especially if they can move the ball out and in as they build. It certainly helps to have a player like Trinity Rodman who can finish those chances.\nDangerous on set pieces\nGotham has created the most xG from set pieces in the league. More than a quarter (26%) of their xG comes from set plays. They have scored four of their 16 goals off 5.34 xG and 44 shots from set plays.\nElla Stevens, who has a team-high five goals, is a common target on these set plays. So is Esther González, who scored on a corner kick in the NWSL Championship. Esther loves to hang out on the far post, while Stevens is always an aerial threat.\nGotham is also great at recognizing when they can take free kicks quickly to catch teams out of position.\nMeanwhile, the Reign have conceded only 3.1 xG on set plays, the fourth lowest in the league, but they've given up six set-piece goals. The Reign will need to be organized, quick to get set, and disciplined in winning the first and second balls on corner kicks and free kicks.\nGotham plays expansive football\nGotham likes to play expansive football – hoping to pull defenses out of shape to create passing lanes and runs higher up the field. They build play from the back and look to get their fullbacks wide and involved in the build-up. If one player runs into space, their teammate quickly vacates to try to create holes.\nTheir centerbacks, fullbacks, and holding midfielder consistently lead the team in passes, while their forwards often pull into space to draw a centerback out of position.\nThis has been a big area of focus for Harvey and the team in training this week.\n\"We've spoken a lot about being as good with the ball as we've been of late, which I think we've been quite good with it. Making sure we try and keep doing those things whilst also knowing that they try and make the field really big, really expansive. So defensively, how we can solve that by making sure we can take care of all the spaces that they tried to exploit. So that's been our big focus area.\"\nInjury / Availability Report\nSeattle Reign\nOUT: Lauren Barnes (leg), Ryanne Brown (leg)\nGotham FC\nOUT: Svava Gudmunsdottir (excused absence), Sinead Farrelly (SEI – concussion), Esther González (foot), Kelley O’Hara (knee), Midge Purce (SEI – knee), Yazmeen Ryan (suspension), Abby Smith (SEI - lower leg)\nHow to Watch\nSeattle Reign faces Gotham FC on Sunday, June 30, at 10 AM PT. The match will air on ESPN2 and ESPN Deportes and will stream on ESPN+.",
  "word_count": 1061,
  "scraped_at": "2026-02-14T12:09:51.958420"
}