{
  "article_id": "d08ce3d98c00",
  "url": "https://bernews.com/2024/08/swd-kenni-thompson-receives-knee-injury-boost/",
  "title": "Kenni Thompson Receives Knee Injury Boost",
  "date": "20240822T144500Z",
  "domain": "bernews.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Kenni Thompson Receives Knee Injury Boost\nKenni Thompson, the Bermuda women’s national team footballer, has been told her knee injury is not as serious as first feared and could return to action in weeks not months.\nThe winger returned to AFC Bournemouth Women from international duty last month nursing a knee injury, which threatened to rule her out for a lengthy period.\nThe 23-year-old, who joined Bournemouth from Spanish side Eibar in January, featured twice for Bermuda in a friendly double-header against Belize.\nThompson missed pre-season and the club’s opening National League Division One South West game against Bristol Rovers last weekend; however, following a medical assessment, it was revealed her right knee injury is not long-term.\nSteve Cuss, the Bournemouth manager, told the club’s website, “We’ve had a scan and some assessments on Kenni’s knee, and it isn’t as serious as we first feared.\n“She is now on a rehab programme, which is working towards her being back within weeks rather than months.\n“We’re all relieved it isn’t a long-term injury and we’re really pleased with the news.”\nCuss acknowledged the stress that players endure during injury assessments, emphasising the psychological toll it can take.\n“It’s been difficult for Kenni, and we’re just pleased the diagnosis has come back positively and she can recover through her rehab programme,” he added.\n“We won’t rush that and will give her as much time as she needs. We’re just really pleased that we’ll be able to get her back a lot sooner than we anticipated.”",
  "word_count": 253,
  "scraped_at": "2026-02-14T13:30:50.997898"
}