{
  "article_id": "d0b4b68cd98c",
  "url": "https://www.prweb.com/releases/2023/5/prweb19334368.htm",
  "title": "U . S . Soccer Fan Data Shows Growing Market Ahead of FIFA World Cup in New Report from Sports Innovation Lab and Jung von Matt SPORTS",
  "date": "20230512T004500Z",
  "domain": "prweb.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "The data-driven report on U.S. soccer fandom explores opportunities for brands, properties, media companies, and technology providers on the road to FIFA World Cup 2026™.\nBOSTON, May 11, 2023 /PRNewswire-PRWeb/ -- A new data report on the state of U.S. soccer fandom has found that American interest in the sport is making positive progress in reaching the average interest level found globally. The report, \"Fanarchy26,\" was released today by fan intelligence company Sports Innovation Lab in partnership with award-winning European creative agency Jung von Matt SPORTS, and provides several benchmark statistics of behaviors exhibited by U.S.-based soccer fans in advance of the 2026 FIFA Men's World Cup - which is scheduled to be hosted throughout the United States. The report merges data with creativity, utilizing artificial intelligence-generated images to support its data story throughout.\nAmongst the key findings from Fanarchy26, available for free download alongside select AI-generated images at http://www.fanarchy26.com:\n- TOTAL FANS - Roughly one quarter (27%) of United States-based sports fans (83M) show an interest in soccer, compared to a global average of 40%. By contrast, American football is the most popular sport (52%) with basketball (43%) and baseball (37%) further behind. Meanwhile, 76% of U.S.-based soccer fans say they became fans when they were children, proving leagues need to continuously prioritize youth demographics for growth. California is home to the most soccer fans in the U.S., while Texas ranks second.\n- SPENDING - U.S. sports fans who purchase from soccer merchants spend more on average per fan, per year than fans of baseball, basketball, or football. Every 14 out of 1,000 Americans have spent, or are spending on soccer. 72% of U.S.-based soccer fans will purchase a ticket and attend a match at least once per season, and 71% spend on soccer-related merchandise yearly. Jerseys are the most popular item (65%).\n- PASSION - On a scale of 0-5 measuring passion, where 5 is the most passionate, U.S.-based soccer fans average 3.32.\n- WATCHING - Roughly 79% of U.S.-based soccer fans watch at least 1 match per year at a bar or restaurant with other fans. Approximately 77% pay for a streaming service to watch an average of 2-3 matches per week. The majority of fans (57%) watch more than 2 matches per week at home on television or via live stream on another device.\n- FAVORITE LEAGUE - Based on the survey data, Fanarchy26 finds that amongst English or Spanish-speaking soccer fans in the U.S. - the MLS (44%) is the most-followed soccer league in the U.S., followed by the EPL (39%), USL (36%), La Liga (30%), and NWSL (28%). Spanish-speaking fans in the U.S. specifically follow La Liga (59%) more than any other league.\nFanarchy26 explores the nuances of the United States soccer marketplace in contrast to global fan communities, and offers demographic and purchase analysis of more than 20 million U.S. consumers (at a credit/debit transaction level) to inform consumer acquisition strategies leading into FIFA World Cup 2026 and beyond. The report serves as a commercial and cultural guide for brands, leagues, and clubs on how to participate in the rise of the U.S. soccer market. In addition, Fanarchy26 introduces five personas that can be leveraged to activate soccer fans in the U.S. This information can answer questions such as:\n- Why might a U.S.-based fan choose to support Angel City FC or Juventus?\n- Which soccer stars do Americans care about, and how did they find them?\n\"'Potential' is the keyword that has defined the relationship between the United States and soccer for decades,\" said Angela Ruggiero, Co-founder and CEO of Sports Innovation Lab. \"However, an actualized rise in national interest on the back of the growing popularity of the NWSL, in combination with hosting the 2026 men's World Cup, has created a rare opportunity for the U.S. sports ecosystem to co-create an idealized soccer fan culture. Sports Innovation Lab's research in this area will help brands and organizations accurately understand not only who is attending, watching, and playing soccer, but more importantly why and how these people act as fans.\"\nThe United States features a melting pot of entertainment, culture, lifestyle, and merchandise options in a market where women's sports has a powerful impact on the growth of U.S. soccer fandom – ironically, despite the U.S. trailing global fandom levels, these circumstances have created a unique dynamic that may represent the future of soccer commerce globally. Through this lens, Fanarchy26 details the broad opportunity for brands, leagues, and clubs to unlock soccer fandom through data, and examines macro-trends to identify population centers for soccer fandom in the United States.\n\"Football (a.k.a. soccer) is the world's greatest sport, and the Americas are the world's greatest growth opportunity for all industry stakeholders - from clubs and leagues to brands and fans,\" said Robert Zitzmann, Managing Director and Partner of Jung von Matt SPORTS. \"Hence the chance to grow the game, fandom in the U.S. is co-creating a new era of soccer culture, bridging entertainment and societal equity beyond any social border. And maybe that's the best news for anyone out there who cares about soccer: the road to 2026 is the perfect journey to engage deeply with soccer's next-generation fans and fandom.\"\nAdditional content from Fanarchy26, including AI-generated images found in the report, can be found using this link: Fanarchy26 Press Kit.\nAbout Sports Innovation Lab\nSports Innovation Lab is a fan intelligence and market research company that helps the world's leading sports organizations acquire the fan of the future - the Fluid Fan™ - and maximize their value. We collect and analyze observational data on what fans buy, watch, and how they behave, then provide analysis and strategic interpretation of that data to world-class clients such as the NFL, NHL, FIFA, Google, Facebook, Coca-Cola, Visa, and PUMA. Learn more at sportsilab.com\nAbout Jung von Matt SPORTS\nJung von Matt SPORTS is Europe's most awarded creative agency in sports — based in Hamburg and Los Angeles. We work for brands, advertisers, associations, clubs, athletes, publisher, start-ups and NGOs. Moreover, Jung von Matt SPORTS is a proud supporter and partner of Common Goal – the world's leading non-profit collective in soccer. We play to make sports a better business. Learn more at http://www.jvmsports.com\nMedia Contact\nAnthony Baldini, Sports Innovation Lab, 1 4085065975, [email protected]\nJan-Luca Lossau, Jung von Matt SPORTS, 152 069 207 12, [email protected]\nSOURCE Sports Innovation Lab",
  "word_count": 1065,
  "scraped_at": "2026-02-14T12:01:35.128754"
}