{
  "article_id": "d0e9612a2f74",
  "url": "https://www.arsenal.com/news/wsl-preview-arsenal-women-v-chelsea",
  "title": "WSL Preview : Arsenal Women v Chelsea",
  "date": "20230114T221500Z",
  "domain": "arsenal.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Close to 45,000 people are set to descend on Emirates Stadium on Sunday as Arsenal Women finally kick off 2023 with a top-of-the-table clash with Chelsea.\nOn a day of fierce London derbies across the club, victory over the Blues at our N5 home could see us overtake the Blues at the top of the Women's Super League table, where we still have a game in hand on our London rivals.\nThe Blues' season so far\nDespite a shock loss to newly promoted Liverpool in the opening game of the season, the reigning champions have won every league game since and steadied the ship to rise to the top of the WSL table. However, in Chelsea's last league fixture before the Christmas break, they nearly let a struggling Reading stage a second-half comeback but ultimately escaped with a 3-2 win.\nMeanwhile in Europe, Emma Hayes' side fended off the likes of Real Madrid and PSG to qualify top of their Champions League group.\nIn terms of players to watch out for, Norwegian midfielder Guro Reiten is enjoying a notable run of form and Fran Kirby is the Blues' current top goal scorer with six, though the perennial threat of Sam Kerr will still be one to neutralise on Sunday.\nLast time around\nWe last hosted our London rivals at Emirates Stadium in a 3-2 thriller back in September 2021, where an incredible team performance and Beth Mead's two goals secured our first competitive win over Chelsea in three years. Our most recent WSL meeting ended in a 0-0 draw at Kingsmeadow.\nHow to watch\nWe kick off at Emirates Stadium at 12pm (UK time) on Sunday, and you can watch along at home on Sky Sports. Build-up coverage begins at 11:30am on Sky Sports Football.\nWhat the managers say\nEidevall on Chelsea: \"It's the next game, so it's the most important one. We've played some thrilling games against Chelsea before and we like to play these kinds of games, and we have the privilege to play it at the Emirates in front of our home fans.\n\"Last year, we played Chelsea twice and we took four points off them. They took one point off us, and we didn't win the trophy, so it shows that you can be better in a head-to-head but still not win. So, the answer is that every game is important if you want to win the league.\" - read every word of Eidevall's presser\nHayes on us: \"I've done this for ten years and I don't know how many times we've faced Arsenal - it must be in the double digits. It's a fantastic game and one that we look forward to. But it's no more significant to me than the following game against Liverpool. However, I love that it's in a big stadium! That, for me, is the special piece - we're going to have a packed crowd.\"\nTeam news\nWe've added four new faces to our squad since our Gunners last played a game. Victoria Pelova and Kathrine Kuhl have joined our midfield ranks, with Gio Queiroz returning from her half-season loan with Everton. Canadian international goalkeeper Sabrina D'Angelo is another new signing between the posts.\nBeth Mead and Vivianne Miedema remain sidelined for the foreseeable with ACL injuries sustained last year. No further injuries have been reported in our squad.\nOn the Chelsea side, only Danish international Pernille Harder is set to be absent from the squad due to a long-term hamstring injury.\nFacts and stats\n- We have won just one of our last seven WSL meetings with Chelsea. That win came in this exact fixture last season, with the game finishing 3-2 to our Gunners\n- However, Chelsea Women have never won a game at Emirates Stadium. As well as last season's win, we ran out 3-1 victors in April 2012 courtesy of goals from Kim Little and Katie Chapman\n- We are unbeaten in our last 10 WSL London derby matches, winning eight and drawing two since a loss at Chelsea in February 2021\n- Chelsea have won 18 of their last 19 WSL games, including each of the last nine in a row. The Blues have never won 10 consecutive WSL matches before\n- Our No.12 Frida Maanum has scored four goals in her last six league games. This is already one more than she had in her first 24 WSL appearances\nCopyright 2026 The Arsenal Football Club Limited. Permission to use quotations from this article is granted subject to appropriate credit being given to www.arsenal.com as the source.",
  "word_count": 761,
  "scraped_at": "2026-02-14T12:21:39.840656"
}