{
  "article_id": "d10fa184f38b",
  "url": "https://www.dailymail.co.uk/femail/article-13320667/biggest-welfare-fraud-history-benefits-factory-mini-supermarket-fake-claims-police-missed.html",
  "title": "Benefits factory at the back of a mini - supermarket at the centre of the biggest welfare fraud in British history - which was missed by police too busy dishing out lectures on social distancing",
  "date": "20240418T033000Z",
  "domain": "dailymail.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Inside the benefits factory that made its Bulgarian masterminds 'very rich': TOM RAWSTORNE reveals how migrants pulled off the biggest welfare fraud in British history and were sitting on £750,000 in cash when finally caught\nProudly posing behind the counter of a mini-supermarket selling goods from eastern Europe, Galina Nikolova looks every inch the proud shopkeeper.\nAnd a successful one at that. Other photos on social media show the designer-clad Bulgarian enjoying spa breaks in Manchester and luxury holidays to Madrid, Turkey and a five-star beach resort on the Black Sea.\nBut what emerged last week is that the key to the 38-year-old's lifestyle lay not in the stuffed vine leaves, salamis and sweet treats that lined the shelves of this North London shop — but in an office at the rear where the real 'business' took place. There, together with four of her compatriots — two women and two men — Nikolova went about her daily work, ripping off the British taxpayer.\nBulgarians Galina Nikolova and her boyfriend Stoyan Stoyanov were known as The Bosses Of London\nThe gang's aim was simple: to exploit the benefits system on an industrial scale, using it as 'a cash machine' to fund their lavish lives.\nOperating from three 'benefits factories' across London, they offered a bespoke range of services. As well as creating multiple false identities to allow them to claim Universal Credit for themselves, they offered fake documents to enable others to make bogus claims.\nThese included fictitious tenancy agreements, counterfeit payslips and forged letters from landlords, employers and GPs. Success for customers was almost guaranteed, with fully prepared 'benefits packs' available to buy containing all the necessary paperwork.\nEven if the claims were initially rejected by the Department of Work and Pensions, the fraudsters would brazenly try again and again until they were granted.\nPolice raids recovered a high-end Audi and designer goods including watches, jackets and glasses\nAdvertising largely through word of mouth, the Mail has learned that the service they offered was so popular that at times a queue of 30 to 40 people would snake through the shop in Wood Green, waiting to be seen.\nIndeed, it is claimed that during the coronavirus lockdown the gatherings were so large police were, on occasion, called to disperse them.\nWhile, sadly, benefits fraud is nothing new, what is shocking about the fraud perpetrated by Nikolova and her gang is its longevity and scale.\nOperating between 2016 and 2021, by the time investigators smashed the ring it is estimated that some 6,000 fake claims had been submitted at a cost to the taxpayer of a staggering £54 million — the biggest benefits con in British history.\nWhere all the money has gone is another matter.\nA video recovered by police from gang member Gyunesh Ali's phones shows him holding a wad of £20 notes which he throws into the air, while an unknown woman scrabbles around on her hands and knees to pick them up.\nWhen police arrested Nikolova's 27-year-old toyboy lover Stoyan Stoyanov — the pair were nicknamed The Bosses Of London by friends — they recovered more than £750,000 in cash.\nGang member Gyunesh Ali is detained by Bulgarian police for his part in the biggest benefits con in British history\nSmaller sums were also seized from Tsvetka Todorova, Patritsia Paneva and Ali. A high-end Audi and designer goods including watches, jackets and glasses were also recovered. Investigations are now underway to see whether any of their ill-gotten gains were invested in property or shipped back to Bulgaria. Following his initial arrest, Ali fled the UK to dodge justice. The Mail can reveal that while there, the 34-year-old set up a company to invest in property in the country's second largest city, Plovdiv.\nFaced with incriminating evidence, including encrypted messages and CCTV footage, all five defendants pleaded guilty to charges including fraud and money laundering related offences. The final pleas were entered last week allowing details of the case to be reported.\nSentencing will take place at the end of May.\nThe convictions have been widely praised, with Mel Stride, the Work and Pensions Secretary, saying: 'These criminals were cold and calculated in their manipulation of a system designed to help the most vulnerable people back on their feet.\n'Benefit fraud is not a victimless crime. By stealing from the most vulnerable, fraudsters put pressure on a system designed to help those who need it most — all for personal gain.' Strong words, but the reality is that benefit fraud has mushroomed in recent years. Universal Credit is the main welfare benefit in the UK and is currently claimed by 5.8 million people both in and out of work. It is intended to help with the costs of housing, children and childcare. It also supports disabled people and carers.\nWhen police arrested the gang they recovered thousands in cash, some stashed in suitcases\nWhen it was launched in 2013, replacing six other benefits, the Government said its design would reduce fraud and error in the welfare system.\nBut, as it was rolled out to more claimants, fraud levels increased, peaking during the pandemic when the rules claimants had to follow were relaxed.\nLast month it was revealed that Universal Credit has cost taxpayers £11 billion in fraud and erroneous payments in the past two years, prompting the Government to target extra money to counter the problem.\nOf course, what makes the latest case all the more shocking is that those involved moved to this country from abroad.\nThe Mail understands that Nikolova, Stoyanov, Ali, 52-year-old Todorova, and Paneva, 26, were all in the country legally.\nBulgaria, along with Romania, joined the EU in 2007 with restrictions on the rights of those from those countries to work here lifted in 2014. By 2019, the Bulgarian population in the UK stood at about 120,000.\nWhile it is unclear when all the gang's members arrived in this country, Ali claims to have been here since about 2010. Well-placed sources in Bulgaria say he comes from the nation's Roma community, as do a number of the other gang members.\nStoyan Stoyanov was director of a number of companies which were set up then dissolved without ever filing accounts\nDuring his extradition proceedings, Ali claimed to have worked as a carpenter before opening a company offering immigration services and advice.\n'I didn't do anything illegal,' he told a court in Bulgaria. 'My job in London was to help new arrivals to prepare their papers for residence status for appropriate fees. I have helped many people in the UK and they can prove that.'\nBut while the gang claimed to assist people with simply obtaining national insurance numbers and benefits to which they were entitled, the reality was very different. An investigation by the DWP identified three locations from which repeated false claims for benefits originated.\nOne was the Wood Green shop. The business, now closed, was owned by a Bulgarian man who was not among those convicted of the fraud.\nThe gang's customers would walk through the shop, past the refrigerators, to be seen in an office at the back.\n'I saw a lot of people queuing in the supermarket, not for groceries but for the services,' said one local resident. 'You'd see queues outside the shop and many times the police came there during corona [virus] and said: 'Why are you waiting here?' and they'd tell everybody to get out.' He added: 'I used to see Galina sometimes but I never spoke to her.'\nA video recovered by police from gang member Gyunesh Ali's phones shows him holding a wad of £20 notes which he throws into the air\nTodorova was also seen at the shop on an almost daily basis, arriving in a sports car. Witnesses claimed that many of those seeking help were also from the Bulgarian Roma community.\nAnother neighbour said: 'The supermarket rented the offices at the back and she [Nikolova] did what she did. It was maybe going on for two years for sure. 'People knew what was happening. Everybody knew what was going on. They got caught because they went too far.' He added: 'When the police came, they found 50 or 60 phones in there. They were working from Turnpike Lane and Palmer's Green. They had three or four offices.\n'After they got arrested it was another few months and the shop closed. People stopped coming there and they didn't sell anything. There was no business left, so the supermarket closed.'\nHow the DWP discovered the fraud is unclear but they raided the premises and properties linked to the gang in May 2021.\nThe so-called benefits factories were all fronted by a legitimate business, with an office behind kitted out with desks and computers where the fake claims and documents were prepared.\nInvestigators say that everyone participating in the scam was doing so willingly.\nThe gang would create fake identities for themselves and then lodge fake claims for Universal Credit, with the money paid into bank accounts before being withdrawn as cash.\nSmaller sums of money were also seized from Tsvetka Todorova\nAdditionally, individuals would come to them with their real identity and the gang would charge them for supplementing that real identity with false documents — such as a tenancy agreement or forged information on dependants — to make a claim for benefits they were not entitled to. Shell companies were also established to create false employment documents and counterfeit payslips.\nRecords show that Stoyanov, Nikolova and Ali were the directors of a number of companies that were set up then dissolved without ever filing accounts.\n'This was a highly sophisticated and targeted attack on the benefits system and they clearly got very rich off this scheme,' said one source.\nBefore her arrest, Nikolova was living a ten-minute drive away from the Wood Green grocery store, in a flat in a desirable private block in Palmers Green. Two-bedroom flats in the low-rise block cost £1,700 a month to rent.\nOne neighbour claimed that Nikolova also had properties in Chelsea. Pictures posted by her on social media show her and boyfriend Stoyanov flaunting an extravagant lifestyle.\nThe convictions have been widely praised, with Mel Stride, the Work and Pensions Secretary, saying: 'These criminals were cold and calculated in their manipulation of a system designed to help the most vulnerable people back on their feet'\nIn one post, they boasted about a luxurious trip to Turkey, where they visited Istanbul's famed Grand Bazaar, posing together in designer DKNY shirts.\nThey also shared a snap of a trip to a luxury spa in Manchester and a visit to Aston Hall stately home in Birmingham before watching a football match at Premier League team Aston Villa.\nProceedings are under way to recover money from the gang under the Proceeds Of Crime Act. This includes an application for the forfeiture of £751,237.69 in cash seized from Stoyanov. A further £41,511.32 was seized from Ali with five figure sums also taken from Todorova and Paneva.\nThose living near the North London shop told of their amazement at discovering the sheer scale of the fraud. 'How can you get £54 million in benefits?' said one. 'I don't know how. I'm shocked.'\nInvestigations are now under way to see whether any of their ill-gotten gains were invested in property or shipped back to Bulgaria\nAnother added: 'They should go to prison. That's money for children and families.' As foreign nationals, a custodial sentence of more than 12 months would see them considered for deportation.\nWhether that happens, only time will tell. As it stands, only Ali is being held on remand — the other four are on conditional bail.\nSince her arrest, Nikolova has had a baby. In December, she posted a video on her TikTok feed which featured a well-know Bulgarian singer inviting her followers to attend a birthday party being held for her young son at a restaurant in North London. 'All of you are welcome,' he says.\nAmong the comments thanking them for the invitation, one reads: 'How many poor people become rich because of [Galina's] help. She helps everybody.'\nBut, as we now know, not with her own money — but with the British taxpayer's.",
  "word_count": 2037,
  "scraped_at": "2026-02-14T12:57:36.297883"
}