{
  "article_id": "d1252928a817",
  "url": "https://www.burntorangenation.com/2023/3/7/23629035/longhorns-daily-news-texas-steve-sarkisian-xavier-worthy-spring-practice-quinn-ewers-arch-manning",
  "title": "Longhorns Daily News : Texa Steve Sarkisian : Texas WR Xavier Worthy broke hand in 2022 , enters spring practice healthy",
  "date": "20230307T200000Z",
  "domain": "burntorangenation.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Spring practice is officially underway. Like, officially officially.\nLonghorns Daily News: Texas’ Steve Sarkisian: Texas WR Xavier Worthy broke hand in 2022, enters spring practice healthy\nPlus: Ewers, Manning will compete for starting job\nIncluded among the recently healthy Texas Longhorns is star returning wide receiver Xavier Worthy, who, according to head coach Steve Sarkisian, played with a broken hand in 2022.\n“One guy that was great to have back out there today — which you guys didn’t know about and I tried to protect this throughout the season — but Xavier had a broken hand essentially the second half of the season,” Sarkisian said, per 247Sports. “He was in a cast for about eight weeks roughly, so to get him back out there practicing full speed was awesome.”\nWHAT THEY’RE SAYING ABOUT THE LONGHORNS\nAustin American-Statesman: Golden: Moody was a double hit for men’s and women’s basketball\nAustin American-Statesman: Bohls: Sark out to refine Ewers, re-find pass rusher or two or ...\nAustin American-Statesman: Texas opens spring practices with a healthy Xavier Worthy in hand\nDallas Morning News: Former Texas coach Chris Beard met with Ole Miss AD about HC opening, report says\nDallas Morning News: Quinn Ewers vs. Arch Manning and other big questions for Texas coach Steve Sarkisian\nInside Texas: Morning Brew: Year 2 for Quinn Ewers under way and other offensive notes from spring practice No. 1\nInside Texas: Steve Sarkisian excited about clean-cut Texas QB Quinn Ewers’ second-year growth potential\nInside Texas: ‘I just want to get the guy healthy’: Texas QB Maalik Murphy still dealing with injury\nInside Texas: On Texas Football: Spring football reactions, Steve Sarkisian’s first press conference of 2023\nInside Texas: Sark’s spring priorities? Pass game and pass rush\nInside Texas: Practice one reveals that Texas football is brimming with offensive talent\nInside Texas: Catalon, Holmes bring ‘needed’ experience to Texas secondary\nICYMI IN BURNT ORANGE NATION\nRECRUITING ROUNDUP\n247Sports: Top247 DB Jordon Johnson-Rubell goes in-depth on upcoming visits\nInside Texas: Corian Gipson locks in Texas official visit date\nInside Texas: 2025 safety Sael Reyes recaps Texas visit\nBIG 12 BREAKDOWN\nOur Daily Bears: Big 12 MBB power forward report cards\nViva the Matadors: Tech goes 1-2 at the Shriners Classic\nFrogs O’ War: TCU Baseball Series Recap: 2023 Shriners Children’s College Classic\nThe Smoking Musket: Erik Stevenson joins elite company in West Virginia basketball history\nWide Right & Natty Lite: Gary Barta Asks Taxpayers to Fund Settlement: Cites lawsuit disparity between Iowa and Iowa State as reason\nBring On The Cats: K-State stumbles 89-81 at West Virginia\nWHAT WE’RE READING\nSB Nation: Aaron Rodgers to the Jets is drawing closer to a reality\nSB Nation: NFL’s top-5 free agent wide receivers in 2023, ranked\nSB Nation: Referee Scott Foster swings outcome of Nuggets-Raptors with technical foul, ejection\nNEWS ACROSS LONGHORN NATION AND BEYOND\n- It’s gonna be an interesting offseason.",
  "word_count": 480,
  "scraped_at": "2026-02-14T13:45:48.023989"
}