{
  "article_id": "d128a8e33e2c",
  "url": "https://www.easternriverinachronicle.com.au/story/8232863/world-cup-glory-on-home-soil-ultimate-dream-sam-kerr/?cs=6364",
  "title": "World Cup glory on home soil  ultimate dream : Sam Kerr",
  "date": "20230613T090000Z",
  "domain": "easternriverinachronicle.com.au",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Hailing it as a once-in-a-lifetime experience, Matildas megastar Sam Kerr has urged her teammates to embrace the pressure of a World Cup on home soil.\nSubscribe now for unlimited access.\nor signup to continue reading\nKerr will have the nation's expectations on her shoulders when Australia launch their campaign against the Republic of Ireland in Sydney on July 20.\nThe 10th-ranked Matildas shape as genuine contenders after a penalty shootout defeat to Norway cruelled their hopes of advancing to the quarter-finals in France four years ago.\nAnd they will be led by a supreme big-game player in Kerr, who played starring roles as Chelsea clinched their fourth consecutive FA Women's Super League title and third straight FA Cup.\nKerr also found the back of the net on enemy soil in the Matildas' 2-0 triumph over England in April, helping to hand the European champions their first defeat in 31 matches.\nEnjoying a pre-tournament break at home in Perth, the 29-year-old said getting one over the old enemy had reinforced the Matildas' confidence ahead of what looms as the biggest moment of her career.\n\"I just said to my agent at coffee, if we win the World Cup I probably won't see her for a few months,\" Kerr joked at a Lego promotional event.\n\"It would be the ultimate dream.\n\"That's why I play football. That's why I do what I do every day. That's why I sacrifice so much, to win a World Cup.\"\nHaving risen to heights once unimaginable for an Australian footballer, Kerr hopes the tournament will inspire a new generation to grow the game even if she won't get the opportunity to play in her home town.\nThat will have to wait until October, when the Matildas host the first of three Olympic qualifiers scheduled at HBF Park.\nKerr's long-anticipated homecoming is already being marketed as the opportunity of a lifetime for local fans, but the Matildas skipper is squarely focused on what lies ahead for her and her teammates.\n\"It's such a big event, it's such a big moment for us,\" she said.\n\"The most important thing is we focus on ourselves and focus on performing to the best of our ability and enjoying it too, because this is a once-in-a-lifetime experience.\n\"You don't want it to become a bad experience by getting overawed by the crowd or whatever it may be, you want to enjoy this experience.\"\nThe superstar striker concedes the Matildas won't have long to find their groove as they prepare to gather in Brisbane ahead of the group stage.\n\"Last time we had a great result against England, so I think that gives us a lot of confidence. But there's a long way to go,\" she said.\n\"We're not at our best right now but that's what we've been planning for the last four years, to be at our best in four weeks' time.\"\nAustralian Associated Press",
  "word_count": 485,
  "scraped_at": "2026-02-14T12:45:52.905167"
}