{
  "article_id": "d13d3a56f5d5",
  "url": "https://combatpress.com/2019/03/what-if-pro-wrestlers-were-mma-fighters-fantasy-64-man-tournament-round-1/",
  "title": "What If Pro Wrestlers Were MMA Fighters ? Fantasy 64 - Man Tournament",
  "date": "20230829T130000Z",
  "domain": "combatpress.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "What if pro wrestlers were MMA fighters? It’s a question a lot of crossover fans have probably asked themselves. Some former WWE superstars, including Brock Lesnar and CM Punk, have even provided an answer. However, we here at Combat Press are striving to provide an even more comprehensive answer to how some of the best pro wrestlers would fare against one another in a 64-man fantasy tournament.\nA panel of writers from Combat Press, combined with some of our colleagues in the world of MMA and pro-wrestling media, have taken on this task. The match-ups were done based on the wrestlers’ real last names, alphabetically. The premise is simple: the fights are judged on UFC 1 rules and based on the combatant’s real-life martial-arts credentials and reputation for toughness in actual brawls and street fights. Let’s get started with the opening round of the tournament.\n[Ed. Note: The number in parentheses next to the fighter’s name in the result represents the number of votes he received from our panel in his match-up.]\nMany MMA fans know Abbott for his time in the UFC and for famously getting absolutely smoked by Kimbo Slice far later in his career. Abbott was a legit street fighter turned mixed martial artist with an overall record of 10-15 who once competed for the UFC heavyweight championship. He was not the most refined fighter, but he was a popular face in the early UFC days. He had crazy power in his hands that allowed him to knock out Wesley “Cabbage” Correira cold with one punch. Abbott was a JUCO All-American in wrestling, but, compared to most in this tournament, that is peanuts.\n“The Man They Call Vader” was a pro-football player turned monster pro wrestler. He legitimately tipped the scales at over 400 pounds. Yet, even at that weight, he had uncanny athletic abilities and agility. How tough was Vader? He once had his eye ripped out of the socket in a stiff wrestling match in Japan against Stan Hansen and popped it back in on the spot. That said, Vader was, by multiple accounts, beaten up pretty badly in a backstage altercation with Paul Orndorff, who is no slouch himself.\nWhat the writers are saying:\nBryan Henderson: “In his prime, Tank was knocking guys out in seconds. He only lost to superior wrestlers who could ground him… Vader didn’t have the skills to do that.”\nKyle Symes: “I was originally going to take Tank here, but Vader was massive and athletic. That said, from backstage stories, Vader does sound like a big softie. However, Abbott had almost zero cardio, and Vader could perform an entertaining 20-minute match without tiring. Vader would tire Abbott out before beating him.”\nResult: Abbott (5) def. Vader (2)\nThis bout went the way of the former UFC fighter. Although Vader is a big, rugged guy, one has to believe Abbott would land a couple big shots on Vader and put him down. Abbott may be a street fighter, but he’s thrown down with some very tough dudes and could definitely knock out Vader.\nAngle is arguably the most famous amateur wrestler in American history. He won an Olympic gold medal with a broken neck — no, it was not a pro-wrestling storyline, but something that actually happened. Beyond just being an ace on the mat that reportedly beat Brock Lesnar in an amateur-style match before a WWE show, Angle was a freak athlete with ridiculous agility and quickness. In a legit backstage quarrel, Angle got the better of an enraged Eddie Guerrero and could have absolutely destroyed him if he wanted to (why Guerrero chose to shoot on an Olympic champion, who knows, but Guerrero reportedly acknowledged this by saying, “Because I’m stupid!”). Angle would have been a UFC champion had he chosen MMA instead of pro wrestling.\nWilliams was one of the baddest dudes in wrestling in the 1970s and 1980s. In his prime, “Dr. Death” was an All-American in both football and wrestling at the University of Oklahoma. He was a notorious tough guy who was highly respected in Japan and elsewhere for his legitimate fighting skills. If you listen to Jim Ross or Jim Cornette talk about Doc in the territory days, they’d say how Williams is famous for beating the hell out of hordes of fans who tried to jump him at ringside or at the bar. He was 0-1 as an MMA fighter, having taken a fight after his prime. During the Brawl for All tournament, a legitimately real fighting tournament in the WWE, Williams scored a TKO of Quebecer Pierre in the first round before succumbing to a shocking knockout loss at the hands of Bart Gunn. Williams tore his hamstring sprawling a takedown before getting his clock cleaned by Gunn.\nWhat the writers are saying:\nHenderson: “Williams was a good wrestler, but Angle was a great wrestler.”\nRiley Kontek: “Williams was a world-class athlete and could beat up most people. Unfortunately, Angle was not one of those people.”\nResult: Angle (7) def. Williams (0)\nOlympic gold defeats All-American status. Williams definitely has more fighting experience from his days in the territories and his one MMA fight, but the consensus is that Angle would out-wrestle him all the way through the fight.\nBarnett is one of the most respected MMA heavyweights of all time, despite his history of failed drug tests. He currently holds a 35-8 record and is a former UFC heavyweight champion. He is a master of catch wrestling and has trained many fighters currently in MMA or in the ranks of pro wrestling. He’s no joke, and if you know MMA, you know “The Warmaster.”\nThe Iron Sheik’s life is an amazing story. He was a former bodyguard of the Shah of Iran before he decided to come to America. While living in America, Sheik picked up an AAU gold medal in wrestling and coached many top amateurs in the country. There is a story of him once coming to Bruno Sammartino’s aid when Sammartino got in a scuffle with several fans backstage. Sheik and Sammartino cleared the area. He’s a legitimate shooter and a guy who is not afraid to throw down if needed.\nWhat the writers are saying:\nKontek: “I love Sheiky baby, and I risk him breaking my back and making me humble, but Barnett’s well-rounded skill set is too hard to pick against. In pure wrestling, Sheik would dominate, but Barnett’s striking, size and takedown defense would be key.”\nResult: Barnett (7) def. The Iron Sheik (0)\nThe Sheik would likely match up well with many of the men in this tournament, but he’s running into a real fighter that can shuck off his takedowns and beat him up with their hands. There is a reason Barnett was a UFC champion. Sheiky Baby is a sentimental favorite, but he takes an early bow out of the tournament.\nBautista got his background in fighting as a huge dude who served as a nightclub bouncer. He eventually took to actual fight training as a pro wrestler. Bautista did take one MMA fight a few years ago and won via TKO. He had a legit locker-room scuffle with Booker T, and many people have gone on record to say Booker T got the best of the fight. This was before Bautista’s MMA career, though, so it might not count as much as it could have.\nThe Barbarian is another one of the Pacific islanders, specifically Tongans, feared throughout the wrestling business. He studied sumo in Japan before getting his start in pro wrestling. The Barbarian was a notorious tough guy that most people in the locker room feared. He was wickedly powerful and not a guy anyone wanted opposite them in a fight. Reportedly, the only person he was scared of was his wife, which says something about Polynesian women.\nWhat the writers are saying:\nSymes: “The Barbarian is one scary dude, but I think Bautista’s grappling skills from training jiu-jitsu would help him out here.”\nResult: The Barbarian (5) def. Bautista (2)\nIn what some would consider an upset, The Barbarian advances. Bautista is a physical specimen, but The Barbarian is even bigger and more powerful. Also, his reputation as a legitimate wildman worked in his favor. Bautista would get some shots in, but, with UFC 1 rules, Barb would smash him.\nBenjamin may be one of the best pure athletes ever seen, period. A track and wrestling star at the University of Minnesota, he was Brock Lesnar’s roommate in college. The dude is very strong, incredibly agile, ridiculously quick and a legitimate shooter. There are no reports of him getting in a fight outside the ring, but not many people would want to try him, as it likely wouldn’t end well.\nThesz is one of the most celebrated pro wrestlers of all time, but the dude was a legitimate wrestler, too. His suplexes are legendary, and he was known to be an expert in legitimate wrestling submission holds due to his training in catch wrestling with fellow legend Ed “Strangler” Lewis. In the early days of wrestling, promoters put their championship belts on legit shoot wrestlers, so if anybody tried to go off script and win the title when they weren’t supposed to, the champ would actually beat the hell out of them. That’s why Thesz was a 15-time world titleholder in pro wrestling. He was a scary man.\nWhat the writers are saying:\nSymes: “Maybe it’s because I’m not old enough to remember Thesz in his prime, but Benjamin is a special kind of athlete that could catch Thesz in a shoot. So, I’ll go with the former Golden Gopher.”\nResult: Thesz (5) def. Benjamin (2)\nThis would likely be a close match-up, based purely on the insane athleticism of Benjamin. However, Thesz is one of the greatest wrestlers in history for a reason. His shooting ability would outdo Benjamin, leading to a lackluster decision in the cage.\nBarrett is one of the few pure strikers in this tournament. He was a European bare-knuckle boxing champion, which is a huge accomplishment, especially in England’s bare-knuckle scene. He will likely struggle with shooters, but if he lands one big shot, it could be lights out.\nTenta may be one of the most underrated tough guys in this field. Weighing in at one point at over 400 pounds and standing around 6-foot-6, he wrestled collegiality at Louisiana State University. He later went to Japan and became a top sumo wrestler, which just shows how legitimately good of a grappler he was and how powerful he was to boot. He once got in a situation in the ring with fellow former sumo wrestler Koji Kitao, where Kitao tried to legitimately get in a fight with Tenta. Not much happened, but Tenta held his own. He likely could have beat Kitao in a real fight.\nWhat the writers are saying:\nKontek: “Striking is a rare skill here, so Barrett could easily catch anybody with one of his soup-bone hands. However, Tenta is a monster that will close the distance and throw opponents like a frisbee. Kitao had balls shooting on him.”\nResult: Barrett (4) def. Earthquake (3)\nThis was a close call by the panel, but the striker appears to catch the wrestler here with some of his patented bare-knuckle strikes. Perhaps Barrett’s quickness would also be a factor, as Earthquake’s weight and overall size would have him lumbering around the cage.\nGable is one of the young stars in the WWE right now. For a guy his size, he is very powerful. He was an Olympic qualifier in wrestling, but he never medaled. He is also a Pan American Games gold medalist in wrestling.\nSpivey is a former pro-football player who became a wrestler after his football career came to an end. He is notoriously tough and was given the nickname “Dangerous Dan” after legitimately beating up Adrian Adonis for stiffing him in the ring. If you want to see Spivey score some big punches on camera, watch his match as a members of the tag team “The Skyscrapers” when they take on Mike Blackwell and Avalanche. Blackwell sandbags him and no-sells in the ring, so Spivey took it upon himself to beat the crap out of Blackwell after the bout.\nWhat the writers are saying:\nAndres Magana: “Regardless of the size difference, Gable should be able to get in quick and take Spivey down relatively easy. From there, it’s all over for Spivey.”\nResult: Gable (6) def. Spivey (1)\nAgain, Olympic wrestling scores a victory here in a shocking result. Spivey was a slugger in his day, and he’s a lot bigger than Gable. However, the panel believed that Gable’s lack of size was canceled out by his pure athletic ability, which would allow him to get in on Spivey, put him on his back and out-wrestle him to victory.\nBigelow was damn near 400 pounds and ungodly athletic. Just from the looks of him, with his skull tattoo and mean stature — in real life, though, he was a very nice guy — he was intimidating. He did have an 0-1 MMA record, which means he had to fight at either super heavyweight or openweight. If you want to know how notoriously tough Bigelow is, consider the story where he rushed into a burning house to save a group of children. He suffered burns to 40 percent of his body. Not only is he ridiculously tough, but he’s as brave as they come.\nSmothers had a reputation as a good ol’ boy that could hold his own. He was a tough guy in pro wrestling. He had a near brawl with Tom Prichard, which many in the wrestling community said Smothers would have dominated. He also didn’t mind throwing some legit punches at John “Bradshaw” Layfield in an ECW ring after JBL legitimately beat the crap out of Smothers’ friend The Blue Meanie.\nWhat the writers are saying:\nHenderson: “This was a tough pick. Bigelow is a huge, tough dude, but he just seems better suited for worked bouts over actual fights.”\nSymes: “Bam Bam seems like the ‘bite down on your mouthpiece’ kind of guy, so I have to take him here.”\nResult: Bigelow (5) def. Smothers (2)\nTwo roughnecks would collide in a fun little scrap here, but it’s the bigger, more powerful Bigelow who would thrive. He’s a massive man, but his agility for a man of his size was scary. He could possibly control the cage against Smothers. Bigleow could also eat a mean shot, meaning he would walk through some heavy blows from Smothers to get his hands on him and score the win.\nBlackman was as legit of a martial artist as you could find in pro wrestling. “The Lethal Weapon” owns multiple black belts in different disciplines and was especially dangerous with his striking. After pro wrestling, he opened his own MMA gym in Pennsylvania, where he trains professional fighters. He notoriously beat the hell out of John “Bradshaw” Layfield at an airport after JBL was drunkenly messing with him. Also, it’s reported that he once hooked The Big Show in a wrestling hold backstage for messing with him as well. Blackman took part in the Brawl for All tournament in the WWE, which many, including Bob Holly, think he would have won had he not gotten injured in training. Before bowing out of the tournament, though, he dominated Marc Mero.\nThere’s nothing flashy about Slater. He’s just a southern boy who is tough as nails. Nobody wanted to mess with him. The former college football player once famously rushed from the heel locker room to the babyface locker room to beat up Sting, who had given Slater’s girlfriend a ride to the event. After destroying Sting, he dragged him to the bathroom and stuck his head in the toilet for the old fashioned “Swirly.”\nWhat the writers are saying:\nFreedman: “Blackman is actually a well-rounded martial artist and would’ve been competitive had he gone the MMA route.”\nKontek: “Blackman was a silent assassin. Those are always the most scary ones.”\nResult: Blackman (7) def. Slater (0)\nIn a unanimous verdict, the panel agreed that Blackman would cruise through Slater. Slater was a tough man, but Blackman was legit. He could strike, he could wrestle, and he could submission grapple. Slater would have to pick his poison. Either way, he’s not making it to the judges’ scorecards in a battle with Blackman.\nThe fighting career of CM Punk is well documented. He’s a massive crossover star. The UFC gave Punk two chances to prove himself in the Octagon against opponents with little experience. He was dominated in those fights against Mickey Gall and Mike Jackson. It was quite sad. It’s reported that during his time in TNA, Punk got in a dust-up with Teddy Hart. Hart reportedly got the better of the future WWE superstar. Punk does have jiu-jitsu training, but, as Joe Rogan once famously said on his podcast, “He’s just not talented.”\nSimmons was an absolute hoss. A college football legend at Florida State and a pro for a brief time, Simmons seamlessly transitioned to pro wrestling. He was feared by most men in the locker room. As his partner Bradshaw once said, “He’s a man’s man.” Simmons was ridiculously athletic and strong. He also knew how to fight, and everybody knew not to mess with him. It’s reported that even the Steiner brothers respected Simmons to the point of not ribbing him.\nWhat the writers are saying:\nHenderson: “We’ve seen what Punk has in a real fight. Color me unimpressed.”\nMagana: “I’m a big CM Punk fan, but if Mike Jackson, a semi-athletic journalist, could dominate him, what would a much larger, more athletic specimen in Simmons do to him? All I have to say is, ‘DAMN!’”\nSymes: “Simmons was a legit NCAA Division I athlete and strong as an ox. What has Punk ever done in a real fight to make anyone think he’d beat the XFO welterweight gatekeeper, let alone a guy like Simmons?”\nResult: Simmons (7) def. CM Punk (0)\nPunk’s string of bad luck in real MMA fights would continue here. Simmons wouldn’t need much to finish Punk. Simmons is a better athlete, more powerful, more feared and an absolute killer. Simmons would knock out Punk quickly.\nThere doesn’t seem to be a more respected pro wrestler than The Undertaker in the history of the business. He was a leader and a moral compass. He was a legitimate badass, too. He frequently trained in boxing and submission grappling. Taker was notoriously tough and rarely out due to injury. That’s a lot of mileage to put on and work through. The best backstage story about him was when Shawn Michaels did not want to drop the WWE championship to “Stone Cold” Steve Austin, and Undertaker, hearing this, taped up his fists in front of Michaels as a non-verbal sign that if Michaels refused to do the job, then Taker would be speaking with his hands when Michaels returned.\nShamrock is a legend of MMA. If you’re new to the sport, don’t judge him on his later fights. Go back to his early days. He holds a 28-17-2 record in MMA and an 0-1 record in pro kickboxing. He was the UFC Superfight champion and the King of Pancrase, two huge accolades in the early days of MMA. He also had a short temper. He was absolutely legit.\nWhat the writers are saying:\nHenderson: “In his prime, Shamrock was one of the best MMA fighters out there.”\nSymes: “Taker’s long arms and legs are just begging to be put in a Shamrock arm/leg lock.”\nResult: Shamrock (7) def. The Undertaker (0)\nThe Undertaker is undoubtedly one of the most respected guys in pro-wrestling history, but he’s simply running into a fighting legend in this contest. Shamrock would likely shoot on him, hook him and finish him with a submission. They’d shake hands after, because that’s the type of guy Taker is.\nGallagher is 2-0 in MMA and is well versed in catch wrestling. He’s a small man in stature, but he obviously knows how to handle himself.\nSevern is an incredibly decorated fighter, martial artist and wrestler. He was an All-American wrestler at Arizona State and an Olympic team alternate. He holds black belts in judo and jiu-jitsu, as well as a master in sport in combat sambo. In the cage, he was the UFC 5 tournament winner, as well as the UFC Superfight champion. He went 101-19-7 in pro MMA competition. Severn competed in the WWE’s Brawl for All shoot tournament, where he beat the Godfather before dropping out of the competition due to his lack of interest.\nWhat the writers are saying:\nKontek: “Severn, while not the most exciting pro wrestler, is a legit badass who fought well into his fifties. The dude is dangerous to this day.”\nResult: Severn (7) def. Gallagher (0)\nGallagher is a serviceable fighter, but Severn is simply on another level. The size difference alone would spell bad news for Gallagher. Severn is world-class, and he wouldn’t need much time to shoot on Gallagher and slap on a submission.\nBrown was another guy who was feared by most in the locker room. He was a legit street fighter and an Olympic bronze medalist in judo. It’s reported that Andre the Giant was legitimately afraid of him when Brown once challenged him to a fight outside their bus. He also beat the crap out of Owen Hart backstage once for seemingly disrespecting him after a match. Brown got in a fisticuff with the Cuban Assassin in a parking lot, where he fought off his opponent despite enduring a knife wound.\nNot many people know this, but the Authors of Pain star Rezar was a former MMA heavyweight with a 6-2 record. He also has a background in kickboxing and trained at the famed Golden Glory gym. He even holds a submission win over Oli Thompson, who has fought in the UFC.\nWhat the writers are saying:\nSymes: “Brown’s judo credentials are impressive, but how many times has a judo player enjoyed success in MMA? Karo Parisyan and Ronda Rousey?”\nResult: Brown (4) def. Rezar (3)\nIn what could be considered an upset in MMA circles, the Olympian Brown would succeed here. He’s a world-class grappler, definitely a level above Rezar. Rezar is a better striker, but Brown has a ton of street-fighting experience and is ridiculously tough. It’d be close, exciting and probably bloody.\nThere wasn’t anything fancy about Duggan either inside or outside the ring. The former pro-football player was a renowned tough guy, especially when it came to getting into bar fights or street fights in the Mid-South wrestling territory. Go to YouTube and watch him reminisce with Jim Cornette on some of the crazier times from when he wrestled in Louisiana. Times were way different then, and Duggan was not a man to take lightly.\nSaturn is one tough dude. The former Army Ranger had solid amateur wrestling creds, and he also stopped a rape in progress while suffering multiple gun shots (he thought they were punches). He once famously beat up Mike Bell in the ring for almost hurting him on a couple of spots. He was seen as a feared man in the WCW locker room.\nWhat the writers are saying:\nKontek: “If you suffer a gunshot and in the moment think it’s a punch, don’t die from said gunshot wounds, and still fight off two attackers, you are an absolute animal.”\nResult: Saturn (6) def. Duggan (1)\nTwo tough men who would likely brawl for the entirety of their bout. Duggan would be throwing heavy hands, but Saturn would have no problem returning fire. Saturn’s wrestling ability would be a deciding factor, as would his mental toughness from military service.\nIf there is a more feared man in the history of pro wrestling, we have yet to hear about him. The way Meng is described has the makings of folklore. It’s not folklore, though, because the stories are consistent regardless of the source. The stories are legendary. Meng beat up a group of Marines who were being racially insensitive toward him in St. Louis. In another altercation, it took seven police officers to subdue him when pepper spray had no effect. He bit off a dude’s nose in a bar fight. In an altercation with Jimmy Jack Funk, he tore Funk’s eye out of his head. Meng studied sumo in Japan, but it’s not his sumo that he uses when the chips are down. Instead, it’s pure, psychotic energy. The ironic part about it is that everyone who speaks of Meng talks about how he’s the nicest guy you’ll meet, as long as you don’t disrespect him.\nSammartino was a legit shoot wrestler, but it was his pure physical strength that was most impressive. He could bench press over 550 pounds with ease. That’s what helped him to be such a tough wrestler. He was attacked backstage by a half dozen fans that he fought off with a little help from the Iron Sheik. That’s not a man you want to mess with.\nWhat the writers are saying:\nFreedman: “The quantity and outrageous nature of stories from the road about Meng seem absurd until you realize how many pro wrestlers tell the same exact tale.”\nKontek: “Under MMA rules, this fight would be a lot closer than a regular street fight. To be honest, I don’t think there’s a person alive that would take Meng in a no-rules street fight. However, under UFC 1 rules, Meng would run wild, and as tough as Sammartino was, I don’t think he wants any of Meng.”\nResult: Meng (5) def. Sammartino (1)\nRemember, this is UFC 1 rules. Meng would thrive under those guidelines. He wouldn’t be able to pull out an eye, bite a nose or go for an Adam’s apple, but that wouldn’t stop him from being his typical berzerker self. It would be somewhat close, but Meng moves on.\nGoldberg may not have been the best wrestler, but he was a physical specimen and a freak athlete. The former pro footballer also trained in kickboxing and MMA, so he definitely knew how to throw. However, his wrestling was notoriously weak. In a backstage scuffle with Chris Jericho, he was thrown in a front facelock and unable to beat up his much smaller opponent.\nRude was an underrated tough guy that many in the locker room respected for his abilities to scuffle. He was another guy in the territory days and WCW days that would take on multiple fans and drunks at the bar with ease. His most famous story is the time he knocked out Ultimate Warrior cold backstage after Warrior disrespected Rude for requesting Warrior “ease up in the ring.” Warrior acted like an asshole, so Rude put him down.\nWhat the writers are saying:\nMagana: “Goldberg’s lack of stamina would cost him in this fight. As he tires out, Rude would proceed to toy with the wheezing Goldberg before finishing him.”\nSymes: “I think Rick Rude puts up a bigger fight than most would believe, but in the end, Goldberg takes this one.”\nResult: Goldberg (4) def. Rude (3)\nIn another close bout, Goldberg edges Rude. The biggest key is likely his MMA and kickboxing background, but don’t think Rude would go down quietly. Rude was a tough guy who could throw with power. Ultimately, though, Goldberg would overwhelm him for the win.\nBrody was one of the most feared men in wrestling before his untimely murder in Puerto Rico. The former pro-football player was extremely strong and was known to be a tough guy. He was hard to do business with and stubborn. Nobody wanted to cross him. Brody once was not cooperative with Lex Luger in a cage match, as he was not a fan of Luger personally. He slapped Luger around to the point where Luger quit the match and walked backstage. Luger knew not to fight Brody, as it would have ended poorly.\nDel Rio is seemingly a pretty nice guy, but he definitely has a known temper and is a legit fighter. His wrestling background is impressive, too. He would have gone to the 2000 Olympics under the Mexican flag, but the country chose not to send a team due to lack of sufficient funds. Del Rio held a 9-5 pro MMA record, but he was knocked out by a head kick in his most famous fight against Mirko “Cro Cop” Filipovic. He has also notoriously gotten into some backstage fights where he has legitimately beaten the crap out of several wrestlers, including his brother in a jail in Switzerland. Del Rio is not very tolerant when he perceives disrespect, and he has no problem using his fighting skills to solve the problem.\nWhat the writers are saying:\nKontek: “Del Rio is a legit fighter, without question.”\nResult: Del Rio (6) def. Brody (1)\nThis may be a bit of an upset, but considering his wrestling credentials and fighting history, del Rio has more tools at his disposal. Brody would definitely give him a run for his money, as he’s a tough, powerful son-of-a-gun. Del Rio would take some damage, but hand out more.\nGotch is credited with popularizing pro wrestling in North America in the late 1800s and early 1900s. He was a legitimate catch wrestler with excellent submission ability, his favorite move being the toe hold. He was a renowned tough guy in the early days of wrestling when promoters would put the belt on legitimate wrestlers in case somebody tried to actually beat them and steal the title in the ring. Nobody would dare try this on Gotch.\nRobinson is a notorious wrestler who was known for his time training at the Snake Pit, not only learning the craft, but passing it on to later generations. He has trained many pro wrestlers and MMA fighters in his style. He famously knocked out The Rock’s grandfather, Peter Maivia, in Japan after they got in a drunken fight. Robinson took down the tough Samoan to control him, but Maivia bit through his cheek. When that happened, Robinson knocked him out cold.\nWhat the writers are saying:\nSymes: “In a coin flip, I will take Gotch, but this one is pretty tough to call.”\nKontek: “I didn’t flip a coin. As an avid fan of both men, I pictured this fight playing out in my head. Robinson gets my vote.”\nResult: Robinson (5) def. Gotch (2)\nThis is a dream match-up for fans of old-time wrestling. The reason Robinson likely gets the nod here is because he’d come after Gotch. He had more techniques, more experience with training fighters, and took things that Gotch popularized and bettered them. It would be like an apprentice beating the master.\nHaas is a respected amateur wrestler from Seton Hall University. He was undeniably tough. His wrestling creds speak for themselves, but he also got in a backstage scuffle with Eddie and Chavo Guerrero, which ended in Haas reportedly shooting a takedown before the scuffle was broken up. Haas also reportedly slapped around Grizzly Redwood backstage in Ring of Honor, though that’s not even a fair fight. He’s definitely underrated in toughness.\nRiddle started in MMA before coming over to pro wrestling, so there’s no doubt he’s legit. He was 8-3 with two no-contests in MMA. Most of his career took place in the UFC. He left the sport since he couldn’t pass a drug test due to his marijuana usage. As a college wrestler, he holds a pinfall win over UFC legend and champion Jon Jones. He’s a strong athlete with big power in his hands. Watch his knockout win to get into The Ultimate Fighter house — he absolutely shatters the jaw of his opponent in what Quinton “Rampage” Jackson called “the knockout of the century.”\nWhat the writers are saying:\nFreedman: “Riddle was one of the more well-rounded fighters during his MMA days, whereas Haas is a one-trick pony wrestler who would be in trouble against Riddle’s heavy hands.”\nResult: Riddle (7) def. Haas (0)\nHaas would match up well with a lot of guys in this tournament, but he drew Riddle in round one, which leads to his downfall. Riddle could match the wrestling of Haas, causing this to become a striking battle. Riddle would probably score a knockout when kept to striking.\nSwagger just made his Bellator debut recently, scoring a submission win in the process. However, it’s his amateur wrestling background that is most impressive. He was an All-American at the University of Oklahoma, where he holds the record for most pinfall victories. He’s definitely an athlete, and a powerful one at that. His showing in Bellator proves he’s legit, too.\nThe stories about Steiner are legendary. The dude is a lunatic. He used to mess with people backstage just because he could. Nobody would fight him, except Diamond Dallas Page, who was lucky to escape with his life. Kevin Nash once told a story about Scott — or maybe Rick; he did not specify — where Lex Luger walked into a TV taping and Steiner kicked his legs out from under him for fun. Luger wisely did nothing. Scott was an All-American wrestler at the University of Michigan. He’s ungodly athletic and ridiculously powerful. Most guys said they didn’t have to jump on Steiner’s suplexes in the ring, because he was so strong that they were getting thrown anyway.\nWhat the writers are saying:\nKontek: “Had Steiner taken to MMA over pro wrestling during the 90s, he’d have been a world champion. Not only is he a raging lunatic, but his wrestling and athleticism were beyond legit. Many wrestlers say he was the most powerful guy they ever felt in the ring. Take that and put it in the cage, and you’ll see some embarrassing ragdolling.”\nSymes: “Swagger owns the record for pins at University of Oklahoma, but Steiner is insane. Add his legit wrestling credentials, and you have the dark horse of the tournament. The only concern I’d have is that he could gas out if he didn’t win quickly.”\nResult: Steiner (6) def. Swagger (1)\nSwagger may have the MMA experience, but he doesn’t have the insanity, physicality and killer instinct of a dude like Steiner. Steiner might get disqualified for not stopping after he finishes Swagger, but we’ll assume he follows “Big” John McCarthy’s instructions. Steiner will be a tough out for anybody in the tournament.\nHalme was a legit fighter with pro boxing experience. Although he was 0-4 in MMA, he was still not a guy to be messed with in the pro-wrestling world. His most famous story is not the most flattering, though. After an argument with Scott Norton backstage in Japan, he knocked out Norton with a sucker punch in what is kind of a dastardly and cowardly act.\nFor Rick, see the description of his brother, Scott. The big difference was that Scott was an All-American and Rick was not while both attended the University of Michigan. He did get roughed up by Vordell Walker in the ring for trying to shoot, but he was way past his prime by that point. Rick, like his brother, was legitimately feared and respected.\nWhat the writers are saying:\nKontek: “I’ve actually heard Rick Steiner was the crazier of the two Steiner brothers. That said, his amateur wrestling creds were second to his brother’s, but he was still a bad dude”\nResult: Steiner (7) def. Halme (0)\nHalme may have the pro fighting experience, but he doesn’t have the wrestling chops or insane mentality of a Steiner brother. Rick would shoot on Halme, beat the hell out of him on the mat, and get pulled off by the ref. He’ll be a tough out in this tournament, just like his sibling.\nRoad Warrior Hawk was an absolute brute in terms of raw strength and power. He was also a tough and respected guy. Hawk was a bouncer before he took to pro wrestling. He is yet another guy who beat the crap out of the late, great Eddie Guerrero. Hawk also beat up Randy Savage and reportedly knocked out “The Macho Man.” Too Cold Scorpio claims to have gotten the better of Hawk in a scrap overseas, but nobody else has backed this story. Hawk took part in the WWE’s Brawl for All tournament, where he fought Darren Drozdov to a draw and got injured.\nRace is one of the most respected tough guys in the history of pro wrestling. How tough? Andre the Giant was legitimately scared of him. He was a notorious shooter in the ring if he needed to be. He also has some great stories of fighting in the territory days in the bars and at ringside with fans and idiots who thought they could take him. The best story, though, is when he pulled a gun on Hulk Hogan backstage.\nWhat the writers are saying:\nSymes: “Anybody that Andre the Giant was afraid of is definitely someone I’d take in a fight. Harley Race all day.”\nResult: Race (6) def. Hawk (1)\nRace and Hawk would be a slobberknocker while it lasted. These two men would throw bombs until one fell. Hawk is tough, but Race is a legend. Race would eventually put down Hawk for the count and move on to round two.\nHodge is legitimately one of the best athletes in American history. The dude was an Olympic silver medalist in wrestling after being a national champion at the University of Oklahoma. He was also a Golden Gloves boxing champ. Hodge was an MMA fighter before MMA was a thing. Even in his elderly age, he is so strong he can crush apples with his bare hand. That kind of grip strength is scary and impressive.\nReaders might remember Puder from his short stint in the WWE, where he engaged in a shoot with Kurt Angle in the ring that was supposed to be pure wrestling. It turned into Puder trying to break Angle’s arm with a kimura. Luckily, he did not, but it showed he had legit skills from his MMA background. He was an 8-0 heavyweight. There is no doubt this dude was a legit badass.\nWhat the writers are saying:\nFreedman: “Gimme the former Bodog Fight veteran to guillotine or leg kick Hodge to death.”\nKontek: “Hodge is a legend. The dude was crazy strong, had world-class wrestling ability and top-notch boxing, and was two-dollar steak tough. He’d have fared very well in MMA.”\nResult: Hodge (6) def. Puder (1)\nPuder was likely an early favorite in this tournament, but he ran into a buzzsaw. Hodge has better grappling and more physical strength. He can use his hands, too. Puder wouldn’t go down easy, though.\nHolly is often considered a bully in the wrestling business, but he was more likely just a tough, old-school dude that liked a good donnybrook. He was notoriously tough and had no problem getting in real fights, including the time he beat up Rene Dupree in the ring. He is the only man in the Brawl for All WWE shoot tournament to not get knocked out by Bart Gunn, which is legitimately impressive.\nGunn’s biggest accomplishment as a pro wrestler was winning the aforementioned Brawl for All. After beating current opponent Holly by decision, he scored massive knockouts over “Dr. Death” Steve Williams, The Godfather and Bradshaw. Unfortunately, his reward was a shoot fight against Butterbean at WrestleMania, where he was easily knocked out by the pro boxer. Gunn had a background in tough-man competitions. The big lefty also had a 1-1 pro MMA record, with his fights taking place in Japan.\nWhat the writers are saying:\nFreedman: “Did you see the left hand of Gunn in Brawl for All? As tough as Holly is, Gunn is going to put someone out cold with that thing.”\nSymes: “There is no way Holly can take too many punches after having his neck broken for real by Brock Lesnar in the ring, and especially with Bart’s big left hand.”\nResult: Gunn (6) def. Holly (1)\nThis fight already happened, so it’s easy to predict. Gunn and his big left hand would find Holly’s chin consistently and accumulate damage. Gunn in his prime scores the knockout, even though he decisioned Holly in their first encounter.\nBooker T may not have formal MMA training, but he’s a noted street fighter that most guys backstage would not dare cross. His most famous backstage story was when he got in a scuffle with Dave Bautista and got the better of his foe. The tough streets can definitely mold serviceable fighters.\nOrndorff, a former pro-football player, was definitely a man’s man. He was a renowned badass and was seen as a guy that could keep the locker room in order. He once got in a roadside fight with Tony Atlas. Orndorff bit part of Atlas’ ear off. He also beat the crap out of Vader backstage for being disrespectful while wearing shower sandals. The dude is a powerhouse and a man not to be crossed.\nWhat the writers are saying:\nKontek “Orndorff beat the hell out of the 400-pound Vader in shower flip-flops in a real backstage fight. That’s a real man right there.”\nResult: Orndorff (6) def. Booker T (1)\nThis would be a fun fight to watch. Both men are sluggers, but with different styles. Orndorff is a wildman, a brute and immensely powerful. Booker is slick, tough and has a ton of street fights under his belt. In a back-and-forth slobberknocker, Orndorff eventually catches Booker.\nInoki was a world-class athlete in multiple sports. He had a background in karate and wrestling. He was a respected tough guy in Japan and a promoter that could not be strong-armed. His most famous story came when he was in the ring with The Great Antonio. After trying to work a match with the Great Antonio, who was uncooperative and disrespectful, Inoki got fed up and absolutely brought him to the woodshed. Watch the shoot fight on YouTube. It’s absolutely brutal and showed Inoki is not a guy you screw around with in a serious business.\nO’Haire was a physical specimen, but he was a legitimate martial artist with big-fight experience, too. As a kickboxer, he was just 0-4, but he fought some notable competition. He was also 4-2 in MMA. O’Haire was insanely athletic and should have had a more productive wrestling career.\nWhat the writers are saying:\nKontek: “Inoki looks like the Japanese John Wayne. He is as tough as “The Duke” and stars in my favorite beatdown video in handing that fat, disrespectful jagbag The Great Antonio a smashing.”\nResult: Inoki (5) def. O’Haire (2)\nThis might be a mild upset. O’Haire is a helluva striker, but Inoki has the grappling chops and good enough striking to set up takedowns. Expect both men to damage each other, but it looks like Inoki escapes a close fight with the win.\nGotch is a renowned tough guy with an Olympic background in wrestling. He was notorious as someone that could stretch any opponent in the ring who was uncooperative or disrespectful. He was feared for his abilities.\nNorton has an interesting background, but he was definitely a tough guy who was respected in Japan and WCW. The former professional arm-wrestling world champion was a bodyguard for many years. He had legit fighting skills and impressive strength.\nWhat the writers are saying:\nKontek: “Gotch could stretch the best of them. Sorry, Norton”\nResult: Gotch (7) def. Norton (0)\nNorton was a tough guy, but he would likely get taken to wrestling school in a showdown with Gotch. Gotch would shoot, hook and finish Norton with a submission hold. It may be quick, but it wouldn’t be painless.\nJones’ background was in Strongman competitions, which explains his impressive physique. He was also an arm-wrestling champion. He did fight Koji Kitao in an MMA fight, but it’s known to be fixed — Jones allowed Kitao to defeat him.\nNash came up in the rough streets of Detroit. He has an extensive background in bouncing in a tough city. He’s a street fighter who has claimed to be in over 100 fights in his life. His size and strength are great attributes. There are a couple stories of him getting physical backstage, famously smacking around Roddy Piper and Samoa Joe, though they didn’t turn into full-on brawls.\nWhat the writers are saying:\nKontek: “Jones may be a tad soft. He seemed injury prone, more so than Nash. Plus, Nash is bigger than Jones and is adept at scrapping, so I think he takes him.”\nSymes: “Nash was crazy strong — he powerbombed a 500-pound Big Show in WCW — and was a high-level athlete.”\nResult: Nash (6) def. Jones (1)\nTwo behemoths clash here. When it’s all said and done, Nash would be standing taller. He’s clearly a tough guy who can throw down a bit. He would get his hands on Jones and get the better of him with strikes.\nLashley is a freak athlete and a physical specimen. He was an NAIA wrestling national champion, as well as a U.S. Army wrestling champion. Lashley went 15-2 in MMA, where he scored some big wins and showed that he’s a legit badass. His gas tank can empty quickly, but when he’s a monster when he’s fresh.\nNakamura possesses a submission-grappling background and some karate training. He’s 3-1 with one no-contest in MMA. Nakamura hasn’t fought in a while, but he’s no joke.\nWhat the writers are saying:\nKontek: “Lashley will be tough to beat in this tournament. Nakamura is tough, but not tough enough for ‘The Dominator.’”\nResult: Lashley (6) def. Nakamura (1)\nNakamura has an MMA background, but he’s running into a whole different animal against Lashley, who would opt to put Nakamura on his back. From there, it’s just a matter of time before Lashley smashes him to oblivion on the mat and scores a violent TKO.\nLawlor has recently made the move full-time from MMA to pro wrestling, but he has the goods. He was 10-7 with one no-contest as an MMA fighter, mostly with the UFC. He wrestled collegiately at the University of Central Florida and holds a brown belt in Brazilian Jiu-Jitsu.\nBefore wrestling, Mero was a Golden Gloves boxing champion and a helluva athlete. However, in proven combat, Mero went 0-2 in the WWE Brawl for All tournament. He was defeated by both Steve Blackman and Bradshaw via decision, showing very little in the way of grappling or wrestling skills.\nWhat the writers are saying:\nFreedman: “Mero couldn’t stop a takedown for his life in the Brawl for All. Lawlor should score an easy submission.”\nResult: Lawlor (7) def. Mero (0)\nMero has a puncher’s chance, but Lawlor can throw a bit too. Mero cannot defend a takedown, though, and Lawlor is a strong wrestler. Lawlor shoots a takedown and quickly destroys Mero with ground-and-pound or a submission.\nThe stories of Bradshaw are wild and plentiful. The dude is a renowned tough guy and former football player, but he messed with a lot of people and sometimes got the short end of the stick. His triumphs came in beating up The Blue Meanie and allegedly knocking out Michael “P.S.” Hayes. He also got beaten up by Steve Blackman and, embarrassingly, was knocked on his ass by Joey Styles. Bradshaw was the inspiration for the WWE’s Brawl for All tournament, where he scored decision wins over Mark Canterbury, Marc Mero and Darren Drozdov. He was knocked out in the tourney finals by the dominant Bart Gunn. He was tough, but fights could go either way with him, depending who he picked on.\nRegal was a student of Billy Robinson and a legit catch wrestler. He also competed in bare-knuckle brawls in England, where he proved to be no pushover. His only legit fight story came against Van Hammer in WCW, where Regal took Hammer down and headbutted him to oblivion.\nWhat the writers are saying:\nKontek: “I loved Bradshaw as a wrestling fan when I was young, but hearing him get his clock cleaned by a play-by-play commentator really makes me question his abilities sometimes. Plus, Regal is no joke. Dude is a bare-knuckle boxer and one of those guys you know can get nasty in a street brawl.”\nResult: Regal (5) def. Bradshaw (2)\nThis is likely to be considered an upset, but it shouldn’t be. Bradshaw is a big, powerful guy with heavy hands, but Regal is a legit shooter and street fighter who is as tough as they come. Regal likely wouldn’t box with the superior Bradshaw, instead opting to shoot a takedown and blister Bradshaw on the mat.\nLeBell may be one of the most accomplished judo players in American history. He is legendary in both fighting and pro wrestling. He has a 10th degree red belt in judo and 9th degree black belt in jiu-jitsu. He would actually take mixed-rules fights before MMA was a thing. In addition to training Ronda Rousey and many others, he most famously choked out Steven Seagal on the set of a movie, despite Segal hammering him in the testicles.\nLesnar may be the most decorated pro wrestler and MMA fighter in history. He was 5-3 with one no-contest in MMA, but he also held the UFC heavyweight championship. He destroyed the legendary Randy Couture for the belt. He is also ridiculously tough. He beat two bouts of diverticulitis and then scored a comeback win over Shane Carwin. He was a national champion wrestler at the University of Minnesota. Lesnar also almost made the Minnesota Vikings after not having played football since high school, based purely on how freakishly strong and athletic he is. Lesnar is a one-of-a-kind athlete and fighter.\nWhat the writers are saying:\nHenderson: “This one’s actually tricky. Lesnar either crushes LeBell with punches or gets submitted in less than a minute.”\nKontek: “It sucks that this is a first-round match-up. “Judo” Gene could have fared well against most of the pool here. As badass as LeBell was, Lesnar would just be too damn much.”\nRob Tatum: “It depresses me that I have to pick Brock Lesnar and pick against Shinsuke Nakamura.”\nResult: Lesnar (7) def. LeBell (0)\nAgainst anybody else, a win for LeBell would be almost a given. However, Lesnar is an animal that is likely to be unstoppable in this tournament. Yes, LeBell could catch him in a unique submission, but Lesnar in his prime? He would be using his brute power and massive fists to inflict damage on the feet or with his ground-and-pound. He’s the clear favorite in this field.\nThe panel for this tournament consists of the following members of the media:\nShawn Bitter (Cageside Report), Max Freedman (Cageside Report; The Body Lock; Breakdown Podcast), Bryan Henderson (Combat Press), Riley Kontek (Combat Press; MMAintel), Andres Magana, Kyle Symes (Combat Press), Rob Tatum (Combat Press)",
  "word_count": 8533,
  "scraped_at": "2026-02-14T12:04:49.249855"
}