{
  "article_id": "d147bad5f7a8",
  "url": "https://news.yahoo.com/north-korean-leader-kim-jong-151200196.html",
  "title": "How North Korean leader Kim Jong Un became one of the world most feared dictators",
  "date": "20230209T153000Z",
  "domain": "news.yahoo.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "How North Korean leader Kim Jong Un became one of the world's most feared dictators\nNorth Korean leader Kim Jong Un is regarded as one of the world's most repressive leaders.\nDespite his high-profile career, there is relatively little known about the reclusive 39-year-old.\nHere's what we do know about his life, and that of his family.\nThe current head of a dynasty that's ruled North Korea since the 1950s, Kim Jong Un took power at a young age and has ruled with an iron grip.\nBetween fear of nuclear annihilation, brinkmanship, and ongoing tensions with South Korea and the US, Kim has kept a firm hold on North Korea, with his people given very few freedoms.\nMeanwhile, after having the most tense, heated exchanges with a US commander-in-chief in his country's history, Kim then met with President Donald Trump twice.\nOver the years, there have also been speculation about Kim's health, and intense speculation over who his eventual successor will be.\nBut despite all this, relatively little is known of Kim, though a 2019 book called \"The Great Successor\" does give some tantalising details of his childhood.\nHere's what we know about Kim, and how he became one of the world's most intimidating dictators.\nPaul Szoldra, Jeremy Bender, Gus Lubin, and Veronika Bondarenko contributed to previous versions of this story.\nKim Jong Un was born on January 8 — 1982, 1983, or 1984.\nKim's parents were future North Korean dictator Kim Jong Il and his consort, Ko Young Hee. He had an older brother named Kim Jong Chul and would later have a younger sister named Kim Yo Jong.\nMore in World\nWhile Kim Jong Un's official birth year is 1982, various reports suggest that the year was changed for symbolic reasons, linked to being 70 years after the birth of Kim Il Sung and 40 years after the birth of Kim Jong Il.\nWhen the US Treasury Department sanctioned Kim Jong Un in 2016, the agency listed his official date of birth as January 8, 1984.\nKim, here with his mother, lived at home as a child.\nDuring this period, North Korea was ruled by \"Great Leader\" Kim Il Sung, the current ruler's grandfather. While Kim Jong Il, Kim Jong Un's father, was the heir apparent, Kim's path to command was far less certain.\nThen it was off to Switzerland to attend boarding school.\nCalled \"Pak Un\" and described as the son of an employee of the North Korean embassy, Kim Jong Un attended an English-language international school in Gümligen, near Bern, Switzerland.\nHe lived in the suburbs with his aunt, Ko Yong Suk, his uncle Ri Gang, and their three children, according to Anna Fifield's book \"The Great Successor: The Divinely Perfect Destiny of Brilliant Comrade Kim Jong Un.\"\nSome former classmates described Kim as a quiet student who spent most of his time at home, but with a sense of humor.\n\"He was funny,\" former classmate Marco Imhof told The Mirror in 2011. \"Always good for a laugh.\"\n\"He had a sense of humor; got on well with everyone, even those pupils who came from countries that were enemies of North Korea,\" another former classmate told the German newspaper Welt am Sonntag. \"Politics was a taboo subject at school ... we would argue about football, not politics.\"\nBut others painted Kim as an unremarkable boy who was bad at school and lashed out at others.\nAccording to Fifield's book, classmates said Kim was embarrassed to answer questions in class and frequently lashed out because he struggled to speak in German.\n\"He kicked us in the shins and even spat at us,\" a former classmate told her.\nThe book also outlines how Kim was introverted, avoided girls, and wore Adidas tracksuits with Nike sneakers.\nKim Jong Un loved basketball and idolized Michael Jordan.\nThe young Korean reportedly had posters of Michael Jordan all over his walls during his Swiss school days. Although Kim Jong Un was overweight and only 5-foot-6, he was a decent basketball player.\n\"He was a fiercely competitive player, very explosive,\" former classmate Nikola Kovacevic told The Mirror. \"He was the playmaker. He made things happen.\"\n\"He hated to lose. Winning was very important,\" said former classmate Marco Imhof.\nHe also had a \"fantastic\" collection of Nike sneakers.\nAfter school in Switzerland, Kim returned home for military schooling.\nUpon his return to North Korea, Kim Jong Un attended Kim Il Sung Military University with his older brother. Some reports say they also started to attend their father's military field inspections around 2007.\nWith his father's health fading, Kim Jong Un was rapidly promoted up the chain of political and military leadership, despite having little experience in either.\nHe was made a four-star general, deputy chairman of the Central Military Commission of the Workers' Party, and a member of the Central Committee, according to the BBC.\nKim Jong Un has a theme song known as \"Footsteps.\"\n\"Footsteps\" looks and sounds like a propaganda song from the Soviet Union.\nThe song calls people to follow in \"Our Admiral Kim's footsteps.\" Here's a sampling of the lyrics:\nFootsteps, footsteps ... spreading out further the sound of a brilliant future ahead ... tramp, tramp, tramp, ah, footsteps.\nMany North Koreans see Kim Jong Un as a youthful version of \"Great Leader\" Kim Il Sung.\nKim bears a clear resemblance to his grandfather, Kim Il Sung, in appearance, haircut, and mannerisms.\nRumors had circulated that Kim Jong Un had received plastic surgery to enhance the resemblance even further, although the North finally responded and called the allegations \"sordid hackwork by rubbish media.\"\n\"The false report ... released by enemies is a hideous criminal act which the party, state, army and people can never tolerate,\" said the official Korean Central News Agency.\nAfter his father died, Kim Jong Un was quickly declared \"Supreme Leader\" of North Korea.\nWhen Kim Jong Il died of a heart attack on December 17, 2011, the young Kim Jong Un inherited the world's fourth-largest military, a nuclear arsenal, and absolute control over North Korea.\nHe took over ahead of his older brother Kim Jong Chol, whom their father thought was \"effeminate\" and weak.\nHis other brother Kim Jong Nam apparently said negative things about the regime, according to The Australian. He was killed in 2017, reportedly on the orders of North Korea.\nTaking the reins of the country when he was around 30, Kim Jong Un was the youngest head of state in the world when he took power.\nSome initially believed that Kim Jong Un's aunt and uncle were actually calling the shots.\nAmong Kim Jong Un's most trusted advisers were his aunt Kim Kyong Hui and her husband, Jang Sung Taek, both 66 at the time.\nThe couple was reportedly ordered by Kim Jong Il to take control of the country's military and help the young leader consolidate his position while he gained more experience.\nAt a meeting of the DPRK Workers' Party, both were photographed sitting close by Kim. Their most important job, it seemed, was to push his role as a powerful figure among some of the generals who do not yet trust him, according to The Telegraph.\nBut at the end of December 2013, Kim Jong Un had his uncle and his uncle's family executed, apparently in a bid to stop a coup against his rule.\nOn December 12, 2013, Kim Jong Un had his uncle Jang Sung Taek executed. He was charged with having tried to take control of North Korea through a military coup.\nFollowing his uncle's execution, there were reports that Kim Jong Un continued to purge the rest of the uncle's family.\nBut North Korea's ambassador to the UK denied that Jang Sung Taek's family was also executed. Instead, the ambassador claimed that only Jang Sung Taek was killed by firing squad, following a trial.\nHe's married to a former cheerleader and may have three kids.\nLeaders in the Hermit Kingdom are often very secretive when it comes to their significant others, but Kim Jong Un often has his wife join him and allows photographs.\nNorth Korean media revealed in July that he was married to Ri Sol Ju — a former cheerleader and singer — but no one knows exactly when they were married, according to NBC News.\nSouth Korean intelligence believes the couple probably married in 2009 and had their first child in 2010.\nRi Sol Ju reportedly gave birth to a girl in 2013, and is believed to have had a third child in 2017.\nKim Jong Un lived out a childhood fantasy when former Chicago Bulls star Dennis Rodman visited.\nEveryone in the family is apparently a huge Chicago Bulls fan.\nHis father owned a video library of \"practically every game Michael Jordan played for the Chicago Bulls.\" Kim Jong Il tried unsuccessfully to get Jordan to visit in 2001.\nKim Jong Un had tons of Jordan posters as a kid. Brother Kim Jong Chol was photographed as a child wearing a Bulls Jersey: No. 91 — Dennis Rodman.\nIn the first years of his rule, things didn't go so well.\nIn 2013, Kim was reportedly the target of an assassination attempt.\nSouth Korean intelligence believed the young leader was targeted by \"disgruntled people inside the North\" after he demoted a four-star general, which resulted in a power struggle.\nPerhaps as a means of reasserting control, Kim Jong Un became extremely belligerent, shutting down all links with South Korea and threatening thermonuclear war against his neighbor and the US.\nHis father and grandfather used to make these threats all the time, without following through.\nKim Jong Un has continued to be belligerent with South Korea and the West throughout his rule.\nNorth Korea has continued to test ballistic missiles and nuclear devices under Kim Jong Un's rule, despite the threat of sanctions.\nIn 2013, North Korea conducted its third-ever nuclear test and its first under Kim Jong Un. Since then, Kim Jong Un has overseen additional nuclear tests, including the test of a hydrogen bomb, which is much more powerful, and dozens of missile tests, including missiles with the range to hit the US mainland.\nIn 2012, the country also launched its first satellite into space.\nThe assassination of Kim's half-brother Kim Jong-Nam in Malaysia led to a global investigation into North Korea's involvement.\nOn February 13, 2017, Kim's half-brother Kim Jong Nam was fatally poisoned in an airport in Kuala Lumpur, Malaysia.\nAmid worldwide suspicion of North Korean involvement, Malaysian police conducted an autopsy against the wishes of Kim's government and named a North Korean official and several other nationals as suspects, alongside two foreign women believed to be working as hired assassins.\nBy March, tensions escalated after Malaysia directly accused the North Korean government of orchestrating the murder.\nNorth Korea issued an order that prevented Malaysian citizens from leaving the country, while Malaysia responded by canceling visa-free entry to North Koreans.\nIn the Trump era, conflict with North Korea reached a new high.\nShortly after taking office, President Donald Trump reportedly labeled North Korea the single biggest threat to the US.\nBreaking with former President Barack Obama's attempts at diplomatic negotiations via \"strategic patience,\" the Trump administration started demanding North Korea's immediate de-nuclearization and hinted at the possibility of a preemptive military strike.\nIn November 2017, North Korea tested intercontinental-range ballistic missiles with the express purpose of threatening the US mainland — something that Trump swore he would prevent.\nThroughout 2017 and early 2018, North Korea continued its nuclear threats, and Trump continued to taunt Kim.\nIn December 2017, then-National Security Adviser H.R. McMaster said the chance of war was \"increasing every day.\"\nBut then 2018 ushered in the possibility of peace on the Korean peninsula.\nA secret trip to Beijing in March 2018 marked Kim's first known trip outside of North Korea since becoming supreme leader in 2011, and a historic departure from years of deteriorating relations with China.\nFollowing up on his New Year's address that called for \"peace and stability\" between the two nations, Kim was the first North Korean leader to set foot on South Korean soil as part of a summit with South Korean President Moon Jae-in.\nThe two leaders agreed to seek an end to the armistice agreement and sign a peace treaty, as well as achieve \"complete\" denuclearization.\nOther measures that were announced included ending all propaganda broadcasts and leaflet drops along the border, creating a joint liaison office for the two countries, and holding four-way talks with the US and China.\nKim has continued his country's close relationship with China throughout his rule.\nIn January 2019, Kim Jong Un rode his personal armored train to China to spend his 35th birthday with Chinese President Xi Jinping. It was Kim's fourth trip to China in a year.\nKim went to Beijing for a four-day summit with China, North Korea's most important trading partner and a buffer against pressure from the US.\nAfter a fiery start, relations between Trump and Kim softened to suggest a new era for the two countries.\nAfter Trump tweeted in January 2018 that his nuclear button was bigger than Kim's, the US placed what Trump described as the \"heaviest ever\" sanctions against North Korea in February, which the country decried as \"an act of war.\"\nIn March 2018, Trump accepted Kim's offer for a meeting to discuss denuclearization, which would later result in a historic first-time meeting between the two leaders and the signing of an agreement that called for establishing new US-North Korea relations and supporting building a stable peace on the Korean Peninsula.\nBut many experts were wary that North Korea wasn't held to strict, specific requirements to denuclearize.\nThough the meeting was widely received as a positive development for global relations, many experts and some Trump administration officials were reportedly frustrated with the slow-moving reality of denuclearization and concerned with the then-president's \"very public embrace\" of Kim.\nUS intelligence in late 2018 suggested that the rogue state had privately continued its nuclear activities, with US officials growing wary of Kim's promises for progress, which eventually gave way to threats toward the US as relations between China and South Korea blossomed.\nTrump announced during his 2019 State of the Union address that he and Kim would meet in Vietnam for a second summit, and remained optimistic about Kim's intentions.\n\"As part of a bold new diplomacy, we continue our historic push for peace on the Korean Peninsula,\" Trump said in his address. \"Our hostages have come home, nuclear testing has stopped, and there has not been a missile launch in 15 months.\"\nTrump's comments were in sharp contrast to widespread reports that the US intelligence community had seen little progress towards denuclearization after the June 2018 summit.\nA January 2019 report from the director of national intelligence concluded Pyongyang is \"unlikely\" to give up its nuclear weapons program.\nDespite this, Trump touted optimism.\n\"If I had not been elected President of the United States, we would right now, in my opinion, be in a major war with North Korea with potentially millions of people killed,\" Trump said.\n\"Much work remains to be done, but my relationship with Kim Jong Un is a good one. And Chairman Kim and I will meet again on February 27 and 28 in Vietnam.\"\nAhead of Trump's arrival to the summit, reports again turned to Kim's mysterious habits and travel logistics.\nKim was spotted smoking a cigarette in rural China during his nearly three-day, 2,000-mile train journey to the summit, in a rare, candid glimpse of the leader standing with his sister and an aide nearby.\nHis choice to take a train created speculation, with analysts floating several possibilities, including that the trip was a possible commentary on North Korea's relations with China, and another saying the leader didn't want to look needy.\nBut the second summit largely ended in failure.\nTrump said the summit ended early because Kim wanted total sanctions relief in exchange for only a few nuclear site closures.\nNorth Korea contradicted Trump's reason for the collapsed summit in a rare press conference, and true to form, state media hailed the summit as \"extraordinary\" and \"successful.\"\nTrump and Kim remained amicable.\nThe US and North Korea seem stalled on sanctions and nuclear tests, but the two leaders remained somewhat friendly — much to the concern of foreign policy experts.\nTrump praised a \"beautiful letter\" he received from Kim, which was reportedly greetings for the US president's 73rd birthday.\n\"I think North Korea under [Kim's] leadership has tremendous potential,\" Trump told reporters.\nIn October 2019, North Korean media released photos of Kim riding a white horse, and the propaganda shots were full of symbolism.\nAs Business Insider's Ellen Ioanes wrote, the photoshoot was on Mt. Paektu, a symbolically important mountain for the Kim family.\nSuch releases often herald a major military announcement, and the photos had experts worried that North Korea had a nuclear advancement to unveil.\nIn April 2020, Kim was widely rumored to have undergone heart surgery that left him gravely ill, with some reports even saying he had died.\nUS intelligence indicated in late April 2020 that Kim could be incapacitated.\nAlthough the Korean government denied such reports, news media in Japan reported days later that he was in a \"vegetative state.\" On the same day, a Hong Kong-based outlet cited a source saying he was dead.\nAll reports on the leader's health remain unconfirmed, but that didn't stop reporters from raising questions about the North Korean line of succession.\nShortly after President Joe Biden's inauguration, Kim called out the US as North Korea's main enemy.\nIn January 2021, shortly after President Joe Biden was sworn in, Kim gave an insight into where US-North Korea relations stood.\nHe declared the US as North Korea's \"biggest enemy,\" adding that his country would continue to develop nuclear weapons and would look into acquiring new capabilities, per Voice of America News.\nLater in the year he ordered a crackdown on Western fashion.\nNorth Korea banned mullets, certain piercings, branded t-shirts, and skinny jeans in a bid to keep the country free from \"decadent\" Western fashion trends, Insider reported in May 2021.\nThe new fashion rules were part of the regime's crackdown on \"anti-socialist\" and pro-capitalist behavior, according to Metro.\nKim lost a lot of weight in 2021, prompting more rumors about his health.\nKim's weight loss in 2021 apparently worried and upset North Koreans. According to Reuters, a Pyongyang resident told state TV that seeing him looking \"emaciated\" was breaking the hearts of people around the nation.\nThe weight loss once again prompted speculation on the leader's health and sparked questions about the stability of the regime and the line of succession.\nIn May 2022, Kim Jong Un announced North Korea's 'first' COVID-19 outbreak.\nKim Jong Un declared the country's \"first\" COVID-19 outbreak in May 2022, more than two years after the World Health Organization declared a global pandemic.\nThe North Korean leader called the outbreak a \"great disaster\" and imposed strict nationwide lockdowns, The Guardian reported.\nRadio Free Asia said that those who broke COVID-19 prevention measures were informed they would be forced to do hard labor.\nIn June, Kim blamed top officials for allowing the country to suffer \"grave consequences\" from the pandemic, adding that they had brought \"tremendous harm to the country,\" per the Korean Central News Agency\nIn 2022 Kim debuted his daughter— the first of his children to be introduced to the public.\nIn November 2022, Kim Jong Un unveiled his daughter, Kim Ju Ae, for the first time, The Washington Post reported.\nState media published photos of Kim holding hands with her at a missile launch site, The Post said.\nShe was seen again later that month, inspecting troops and an ICBM with her father, sparking speculation that Kim was paving the way for a future successor, according to The Guardian.\nKim appears to be lining her up to be his successor.\nKim Ju Ae, believed to be 9 or 10 years old, is the first child Kim Jong Un has debuted in public. He is believed to have two other children.\nIn February 2023, Kim Ju Ae made a rare appearance at a military banquet, meeting with North Korea's top generals and officers, and sparking discourse that her father could be preparing her to eventually take over.\nKim Jong Un disappeared for 36 days at the start of 2023, abruptly reappearing in February.\nKim Jong Un hadn't been seen since January 2, 2023. His absence once again raised questions about his health.\nHowever, after 36 days out of the public eye, Kim attended a meeting with military officers on February 6, 2023, during which he urged his country to \"prepare for war,\" Insider reported.\nTwo days later he attended a military parade in Pyongyang — which included the country's largest-ever display of ICBMs.\nAround a dozen long-range ICBMs were displayed at a military parade in Pyongyang, attended by Kim Jong Un, his daughter, and senior military officials.\nThe parade to make the 75th founding anniversary of North Korea's army followed a record year of missile testing by the country, which launched close to 100 cruise and ballistic missiles in 2022, inflaming tensions on the Korean peninsula, per CNN.\nThe late-night spectacle was described by state-run media as a display of Pyongyang's \"nuclear attack capability,\" CNN reported.\nRead the original article on Business Insider",
  "word_count": 3570,
  "scraped_at": "2026-02-14T12:59:54.778200"
}