{
  "article_id": "d14f802a5d54",
  "url": "https://womenscompetitions.thefa.com/Article/Barclays-Womens-Super-League-wrap-20230326",
  "title": "Barclays Women Super League : Manchester City beat Chelsea to blow open title race",
  "date": "20230326T210000Z",
  "domain": "womenscompetitions.thefa.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Goals from Filippa Angeldal and Lauren Hemp helped Manchester City beat Chelsea 2-0 in the latest twist in the Barclays Women's Super League title race\nThere was yet another turn in the Barclays Women’s Super League, as Manchester City stunned Chelsea with a 2-0 victory on Women’s Football Weekend.\nThe Blues led the way heading into the weekend, but now sit third after first-half goals from Filippa Angeldahl and Lauren Hemp condemned a lacklustre Chelsea to only their second defeat of the season.\nThe win moves Gareth Taylor’s City up to second, level on points with local rivals Manchester United who move to the top as the title race looks tighter than ever heading into the final few weeks.\nCity stake their claim for the title\nAny doubt that there are four teams involved in the title race has now been blown away, as Manchester City staked their credentials with a superb 2-0 victory over reigning champions Chelsea.\nCity were on top from the start and got the breakthrough halfway through the first period thanks to Angeldahl’s first WSL goal.\nThe Swede fired past Ann-Katrin Berger after excellent work from Hemp, before the England winger netted herself, rifling into the top corner from inside the box.\nChelsea pushed for a way back with boss Emma Hayes ringing the changes – including two subs after just 36 minutes – but it was to no avail as their title hopes were dented.\nThis @lauren__hemp strike though! 🥵#BarclaysWSL @ManCityWomenpic.twitter.com/zLEH1NMTCF\n— Barclays Women's Super League (@BarclaysWSL) March 26, 2023\nElsewhere in the title race, Arsenal kept up the pace with a stunning 5-1 victory away at local rivals Tottenham Hotspur.\nCaitlin Foord was the star of the show as she netted twice, including a stunning solo run and finish from outside the box, to earn another three points for the Gunners.\nStina Blackstenius opened the scoring after just five minutes before Foord netted her first, only for Beth England to halve the deficit from the spot.\nBut Arsenal were dominant and added three more after the break through Kim Little, Frida Maanum and another from Foord to seal a productive afternoon in the capital.\nShe just loves scoring against Spurs!@CaitlinFoord 🙌#WomensFootballWeekend pic.twitter.com/hPcfkc5CLV\n— Barclays Women's Super League (@BarclaysWSL) March 25, 2023\nUnited rise to the summit\nManchester United bounced back from defeat to Chelsea last time out with a comprehensive 4-0 victory over West Ham United at Old Trafford to go top of the WSL.\nNearly 28,000 fans packed into the Theatre of Dreams to see an impressive second-half showing from the hosts, who shrugged off a frustrating first 45 minutes to net four times after the break.\nKatie Zelem broke the deadlock from the spot six minutes after the break after Alessia Russo was felled by Hawa Cissoko.\nThis baller from @ellatoone99 🤌@LuciaGarcia17 with the composure!#WomensFootballWeekend @ManUtdWomen pic.twitter.com/JxelueU7xk\n— Barclays Women's Super League (@BarclaysWSL) March 26, 2023\nLucia Garcia followed up soon after, slotting past Mackenzie Arnold, before Hayled Ladd curled home a third and Garcia rounded off the performance with her second in stoppage time.\nVilla keep on winning\nAston Villa kept up their unbeaten run with an impressive 5-0 victory against Leicester City.\nFresh from sealing a place in the Vitality Women’s FA Cup semi-final, Villa returned to league action in style as Alisha Lehmann and Rachel Daly both netted twice to seal a fourth consecutive WSL win.\nIt means Carla Ward’s side are unbeaten in the league since December and sit fifth, six points behind fourth-placed Arsenal.\nThat @MazPacheco x @lehmann_alisha link-up! 🔗@AVWFCOfficial are flying at Villa Park! #WomensFootballWeekend pic.twitter.com/vqYB7aJ63e\n— Barclays Women's Super League (@BarclaysWSL) March 26, 2023\nKenza Dali got the home side off to the perfect start at Villa Park, opening the scoring after just six minutes before Lehmann and Daly both netted before the break to put the hosts in control.\nOnly Khadija Shaw has scored more goals than Daly this season, and the England international netted her 13th of the campaign ten minutes after the break before Lehmann added the shine 20 minutes from time.\nSpoils shared in relegation battle\nWhile plenty of eyes might have been on the title race, Brighton’s trip to Reading was a key match in the relegation battle, with both sides hovering just above the drop zone.\nAn enthralling 2-2 draw edges both sides slightly further away from bottom side Leicester City, but both will have wanted more.\nIt was the perfect start for Brighton, as two goals from Veatriki Sarri inside the opening 13 minutes had them in control.\nBut the Royals fought back with a double of their own, as substitute Emma Harries netted her first two goals of the season after the break to earn a point for the hosts.\nThey LOVE a comeback! ❤️@EHarries9 grabs her brace to get @ReadingFCWomen level as The Royals look to complete another comeback story! 😱#WomensFootballWeekend pic.twitter.com/xsfL746y55\n— Barclays Women's Super League (@BarclaysWSL) March 26, 2023\nHonours even in Merseyside Derby\nAnd there was also nothing to split Everton and Liverpool at Goodison Park on Friday night, as Katie Stengel cancelled out Gabby George’s opener.\nOver 22,000 fans watched a hard-fought affair that saw neither side truly able to wrestle control of the match.\nGeorge opened the scoring for Everton, as her cross from the left curled all the way in past Rachael Laws.\nBut Liverpool fought back before the break as Stengel fired home her seventh goal of the season five minutes before half-time.\nThe visitors thought they had a winner as Leighanne Robe forced the ball home only for Ceri Holland to be penalised for a foul on Courtney Brosnan.\nBack in the goals 💪\n— Barclays Women's Super League (@BarclaysWSL) March 25, 2023\nTricky feet from @ksteng12 🙌#WomensFootballWeekend @LiverpoolFCW pic.twitter.com/MiiGSCTkEg\nGet the latest news on everything football",
  "word_count": 969,
  "scraped_at": "2026-02-14T12:21:21.040873"
}