{
  "article_id": "d16da7d33b96",
  "url": "https://president.ie/en/diary/details/president-and-sabina-host-the-team-of-italia-90/speeches",
  "title": "Diary | President And Sabina Host The Team Of Italia 90 | President of Ireland",
  "date": "20250318T203000Z",
  "domain": "president.ie",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Speech by President Michael D. Higgins at a Reception for the Ireland Football Team from Italia ’90\nÁras an Uachtaráin, 15 March 2025\nA cháirde,\nMay I say how much of a great pleasure it is to welcome you all to Áras an Uachtaráin this afternoon as we gather to recall, to celebrate and to reflect on one of the most cherished moments in our sporting history — the remarkable journey of the Ireland football team at Italia ‘90.\nHow wonderful it is to see so many familiar faces here today, to welcome back so many members of the team whose journey that summer provided such joy and pride to the people of Ireland, and to have the opportunity to acknowledge, once more, the extraordinary contribution that you have made — not only to Irish football but to gifting us a memory that informed the spirit and confidence of a nation like no other ever at a defining moment in our shared story.\nI am so delighted to see that Charlie O’Leary, 101 years young, is here with us today. Charlie – as the much loved kitman, the genuine care that you bestowed upon the players, and the camaraderie and sense of unity that you fostered, played such a pivotal role in shaping the character of the team, earning you the admiration and love of fans throughout the country.\nItalia ‘90 was more than a tournament or a contest. It was a unique moment of shared national celebration, a time when Irish people, wherever they were in the world, came together in a spirit of joy, hope, and possibility.\nWho could ever forget the drama, the sheer exhilaration of that night in Genoa? The tension as we stood on the brink of history, the national gasp and sheer elation when Packie Bonner made that save from Daniel Timofte, the collective breath held as David O’Leary stepped forward to send us into the quarterfinals of the World Cup for the very first time.\nThese moments are etched in our collective memory — so full of emotion, of relief, of unbridled joy — belonging to all of us, not just as a sporting achievement, but as a piece of living history we treasure, as milestones in our national story, woven into the fabric of our shared experience as a people.\nOf course, Italia ‘90 was about so much more than one result. It was about the sense of sharing something together that emerged across the country, the streets throughout Ireland that became filled with colour, the sense of shared celebration transcended generations, the songs that became anthems of a summer never to be forgotten, young children were inspired to take to the football fields of their communities, believing that they too might one day wear the green jersey with pride.\nMy friend Desmond Morris, in his book The Soccer Tribe, captured so well this deep, almost tribal connection we have with football, explaining,\nhow football gives us a unique opportunity to display our presence in our community and our shared belief in a common cause, providing an opportunity for emotional release.”\nDesmond has written of how the sport unites us in joy, passion, in shared rituals and emotions, and perhaps most importantly in a shared sense of belonging. Italia ’90 was a perfect example of this. It was a time when football brought our entire nation together. It reminded us that beyond the goals and the results, the true magic of football lies in uniting people through the common language of the game, in the fulfilment and togetherness it creates.\nOn this occasion, it is so appropriate that I pay tribute to the late Jack Charlton and Maurice Setters. Jack’s legacy is one of outstanding leadership of a group of players of many diverse talents, moulding them into the successful team that captured the imagination of the nation. It was not just the success on the field of play, Jack’s endearing popularity also had much to do with his warmth and charismatic personality. He was a true legendary sporting icon of our nation.\nIn 2020, following his sad passing, it was a poignant occasion to posthumously award Jack a Presidential Distinguished Service Award in recognition of his outstanding contribution to Ireland.\nLet us think fondly too of the late Alan McLoughlin, whose unforgettable goal on that night in Belfast in November 1993 brought us to the World Cup the following summer in 1994, another great moment in our football history.\nToday, we keenly feel the presence of so many great supporters of, and participants in football such as Jack, Maurice and Alan. Ar dheis Dé go raibh a n-anam.\nThis period was such a brilliant time for men’s football in this country, as the International team were pioneers for men’s football in Ireland, becoming the first team to qualify for major tournaments – qualifying for Euro 88, Italia 90 and USA 94. There were also many pioneers for women’s football.\nRecently, I had the honour of hosting a reception at Áras an Uachtaráin for the very first Irish women’s football team, welcoming 22 members of the squads which represented Ireland in the team’s first international matches against Wales and Northern Ireland in May and June of 1973.\nMay I also mention a valued friend Paul McGrath, whose presence at Áras an Uachtaráin represented the sporting community with great distinction when President Biden visited here in 2023.\nI am so pleased to welcome Mick McCarthy here today. Mick, such a stalwart of Irish football, served as captain of the team during this historic period, before going on to manage Ireland at the 2002 World Cup in South Korea and Japan.\nAnother player who followed Mick into management after his playing career is Steve Staunton, who I am so glad to see joins us today. Steve holds the distinction of being the only player to play in every single one of Ireland’s 13 World Cup games – across the 1990, 1994, and 2002 tournaments. May I say that it is all our hope that we will see this record eclipsed soon.\nFinally, I am minded to recall the team’s homecoming to Dublin on 1 July 1990. It was such a particularly memorable moment as it coincided with the day Nelson Mandela visited Dublin, adding to the significance of that joyous occasion.\nMar Uachtarán na hÉireann, may I extend my deep gratitude to Jack Charlton’s family, to all the families of the members of the team, to all the coaches and backroom staff, and to all those who made it possible, who played their part in the crafting of that remarkable journey.\nEach of you gave us something invaluable — memories of an unforgettable summer that continue to endure, a legacy that continues to inspire new generations of Irish footballers, and a confidence that comes from that great success, one that encourages us all to believe that we can do it again.\nSo today, let us celebrate once more, let us recall those wonderful weeks with the warmth and affection that they deserve, and let us say, with full hearts — thank you.\nGo raibh míle maith agaibh is beir beannacht.\nENDS",
  "word_count": 1197,
  "scraped_at": "2026-02-14T12:34:57.391175"
}