{
  "article_id": "d17a43f8fc70",
  "url": "https://www.bupipedream.com/opinions/nil-deals-can-be-unethical-and-predatory/155548/",
  "title": "NIL deals can be unethical and predatory",
  "date": "20240909T053000Z",
  "domain": "bupipedream.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "In July 2021, the National Collegiate Athletics Association lifted its ban on athletes profiting from their name and image. Name, Image and Likeness deals have brought many opportunities to the table for college athletes. In short, NIL deals allow athletes to be compensated for promoting brands. Protein bar company Built Brands made headlines in August 2021 because they covered tuition for walk-on athletes’ on the Brigham Young University football team in exchange for endorsements. Also, University of Connecticut women’s basketball phenom Paige Bueckers accepted deals with Gatorade and StockX, earning her close to $1 million, according to estimates. Likewise, NIL collaborations have enabled the best in the women’s sports scene to earn a following, such as Louisiana State University gymnast Olivia Dunne, who has amassed millions of followers across all platforms and earns $3.5 million in NIL deals.\nNIL can be helpful and have a positive impact, and it’s especially true for women’s sports, increasing exposure for athletes. LSU women’s basketball star Angel Reese was featured in 2023’s Sports Illustrated Swimsuit Issue, paving the way for the University of Central Florida’s Jas Williams, the University of Cincinnati’s Jillian Hayes and the University of Houston’s Alexa Massari to get sponsored on this year’s issue. Such endorsements would attract a range of fans to follow a new favorite athlete’s career, meaning increased viewership for women’s leagues.\nDespite this positive impact, NIL deals are not what they seem. For one, some politicians have taken advantage of NILs for political gain, some of which target female athletes. Montana Together, a group supporting U.S. Sen. Jon Tester of Montana, has offered athletes at the University of Montana up to $2,400 to make videos endorsing the Democrat in his race against Republican Tim Sheehy. Tester voted against the Protection of Women and Girls in Sports Act — a bill passed that barred transgender women and girls from competing with biological females. I mention this because Montana Together was desperate for support in a close battle, and asking for support from people frustrated with Tester’s decision to vote against the protection of females under Title IX isn’t the right move. Politics have no place in NIL deals and vice versa — people are likely to slam athletes for political opinions, potentially ruining their reputation, and more importantly NIL deals give way to buying political support, illustrating the corruption NIL deals may inspire.\nNIL deals also put a dent into college sports because they promote unevenness during recruiting and pose risks for unforeseen events. Nebraska Head Coach Matt Rhule says it costs up to $2 million for a good quarterback in the transfer portal and that some teams have $6-7 million players on the roster. Coach Rhule implies that NIL deals create an unequal gap between the elite and low-tier programs since the top programs can lure in top talent with their considerable budget.\nQuarterback Cameron Ward entered the transfer portal in December 2023, gaining interest from schools in the Southeastern Conference, Atlantic Coast Conference and Big Ten. Ward opted for the Miami Hurricanes, where he partnered with Canes Connection in February. Former Kansas State guard Nigel Pack received an $800,000 NIL deal for two years when he first transferred to the University of Miami. This arrangement prompted guard Isaiah Wong to ponder transferring from the Hurricanes if the program didn’t match Pack’s accommodation. Though Wong opted to stay, signs of an unbalanced environment were evident as all players look for more significant contract from larger schools.\nThough the acquisition of Ward bolstered Miami’s roster, smaller schools didn’t stand a chance with Miami having the most funds to lure in the former Washington State Cougars quarterback. Small schools are out of the race for prime-time talent for a simple reason — they lack the budget or resources to get involved in these sweepstakes. While NIL deals promote lopsided climates, spotlighting elite programs and diverting resources away from smaller programs, the cycle continues as athletes from larger schools with high media exposure and fanbases also tend to get NIL deals.\nAside from the irregular atmosphere NIL deals promotes, they place athletes in danger of exploitation. For example, fraudulent sources can take advantage of college athletes because they don’t have an adapted sense of financial responsibility or lack legal support. University of Florida gymnast Savannah Schoenherr was in hot water after accepting an opportunity to model for a New York clothing company, which ended up being a scam — her $3,000 paycheck bounced before paying $1,500 for a “facility fee.” In addition, Gervon Dexter Sr., a former UF football player, sued Big League Advance II for violating Florida’s NIL laws — the company had minimal licensing in Florida and Dexter had agreed to pay 15 percent of his future pre-tax NFL earnings while still in college. College athletes — be aware of fishy situations because those can make or break a career. NIL deals rely on college athletes lacking legal support to read between the fine lines and reveal the buyer’s true intentions.\nIt is evident that athletes make bank from NIL deals — just ask Dunne, Bueckers, Shedeur, Sanders and others. Student-athletes must consider the big picture and realize these deals aren’t what they think they are — they promote uneven playing fields and put athletes at risk for unforeseen events, including scams. I’m not dictating an athlete’s decision regarding NIL deals — that’s their choice if they might need the money or the exposure to eventually land in the bigs. An ethical NIL deal would include an offer where the athlete earns X amount of dollars under a specific time frame, similar to a pro sports contract, but the span shouldn’t be more than four months to even out the field. I’m no jock, but I can give some wise words — weigh out all your options and opt for the scenario that would benefit not only you, but also your passion.\nChristian Bongiorno is a junior majoring in political science and is a Pipe Dream’s opinions intern.\nViews expressed in the opinions pages represent the opinions of the columnists. The only piece that represents the view of the Pipe Dream Editorial Board is the Staff Editorial.",
  "word_count": 1029,
  "scraped_at": "2026-02-14T13:14:59.334939"
}