{
  "article_id": "d17caaecdf7c",
  "url": "https://kansaspublicradio.org/local-news/2023-05-25/headlines-for-thursday-may-25-2023",
  "title": "Headlines for Thursday , May 25 , 2023",
  "date": "20230525T173000Z",
  "domain": "kansaspublicradio.org",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "National Bio-Defense Lab Opens in Kansas\nMANHATTAN, Kan. (AP) — After more than a decade of controversy and delays, the nation's most secure biosecurity laboratory for research on potentially deadly animal and plant diseases has opened in Manhattan. Although a ribbon-cutting ceremony was held Wednesday, researchers at the $1.25 billion National Bio and Agro-Defense Facility (NBAF) are not expected to begin working on biohazards for more than a year, officials said. For now, staff will conduct compliance and regulatory work, prepare protocols and operating procedures and train before working with any pathogens, The Topeka Capital-Journal reported.\n“They will check all the systems according to the international standards and national standards,” NBAF director Alfonso Clavijo said. “And only after we have that approval will we be able to actually do any work. We expect that by late 2024, we should be able to have that approval.”\nInitially estimated to cost $451 million, the price tag more than doubled after the National Research Council published a report in 2010 that questioned putting the facility in the heart of cattle country with a history of large, destructive tornadoes. Department of Homeland Security officials said the increased cost came in part because the lab’s design was changed to reduce the possibility of releasing deadly pathogens. The laboratory replaces an aging facility in Plum Island, New York. Officials there fought hard to keep the lab and several other states made bids to become home to the lab before Kansas was chosen in 2009.\nOriginally expected to open in 2016, construction of the laboratory was delayed several times by economic problems, safety concerns and resistance from politicians who wanted the project in their states. The northeastern Kansas facility will be the nation’s only large-animal biosafety Level 4 lab, which means it will be able to handle pathogens that do not currently have treatments or countermeasures. It is unclear when pathogens used in research will be moved from Plum Island to Kansas, spokesperson Katie Pawlosky said, and no animals or equipment will be transferred. About 280 people currently work at the lab, which is expected to have more than 400 people when fully staffed.\n==========\nGOP Leaders in Kansas Back off Threat to Sue Democratic Governor over Education Funding\nTOPEKA, Kan. (AP) — Leaders of Kansas's Republican-controlled Legislature backed off a threat to sue the state's Democratic governor for vetoing parts of a GOP education funding bill, saying Thursday that they still doubt the legality of her actions but now question whether a court challenge would be worth it.\nGovernor Laura Kelly nixed items in a $6 billion measure that provides the bulk of the funding for public K-12 schools for the 2023-24 school year. The vetoes changed how state funds are distributed to protect rural schools, though the move helped a majority of the state's 286 local districts and took funds away from only 25 of them, according to State Department of Education data.\nKelly also didn't touch the only school choice initiative that divided Republicans were able to pass this year, expanding an existing program for private school scholarships of up to $8,000 a year for low-income public school students. While public education groups strongly opposed it, some GOP conservatives had hoped to pass the kind of sweeping plan to use state education dollars to help parents pay for private or home schooling that states such as Iowa,South Carolina and Utah enacted.\nRepublican leaders contend that Kelly exceeded the power granted to governors under the Kansas Constitution to veto individual spending items in budget bills. The education funding bill mixed spending with policy, and Kelly deleted six pages of language and also made a technical adjustment at the end of the bill. Senate President Ty Masterson, a Wichita-area Republican, told reporters Thursday at the Statehouse that GOP leaders initially feared she would go after more parts of the bill.\n“I don’t know that it’s worth the fight now,” Masterson said. “I don’t think we’re going to do anything with this one.”\nWhen Kelly announced her vetoes last week, Masterson and House Speaker Dan Hawkins, a Wichita Republican, called on GOP Attorney General Kris Kobach to review them, suggesting they were poised for a lawsuit.\nKelly's actions rejected a GOP-backed change for local school districts with declining student numbers — more than half of them. The state distributes its dollars with a per-student formula, so funding drops as enrollments decline, but the state phases in the decrease over several years.\nThe GOP change would have allowed less time for districts to adjust to a funding loss, and top Republicans contend the move would have helped growing districts. But Hawkins said in a statement that the issue “can probably be addressed in a more efficient way” than suing Kelly.\nThe governor told reporters Thursday after a Statehouse event that she believes the six pages she vetoed “clearly” represented a budget item. She said she wasn't sure she could go after other parts of the bill, \"and I didn’t want to test it out.” Kelly's vetoes benefitted more than 150 districts, giving them more state funds than they would have received otherwise, according to State Department of Education data. More than 100 others saw no difference.\nKansas has boosted aid to public schools over the past decade, with an increase of about 3% coming for 2023-24. Even with fewer students across much of the state, only 10 districts will receive less aid overall than they did in 2022-23. All of those have fewer than 500 students, and four have fewer than 100. Without Kelly's vetoes, 29 districts would have received less money overall than in 2022-23. “If they continue to put really bad policy in appropriations bills, you know, I probably will continue to line-item (veto them),” the governor said.\n==========\nPaola Police Arrest High School Coach on Sexual Assault Allegations\nPAOLA, Kan. (KSHB) – Paola police have arrested a local high school track coach on allegations of sexual assault. Police say they received information regarding an alleged 2022 rape and other allegations involving a former minor. KSHB TV reports that officers searched the home of 46-year-old Chad Kelsey Wednesday morning and seized his phone, computer and other electronic devices. Investigators forwarded the case to the Miami County Attorney’s Office for possible charges of rape, aggravated indecent liberties with a child and furnishing alcohol to a minor. Kelsey is currently in the Miami County Jail and will remain there until his arraignment.\n==========\nIola Paramedic Arrested, Accused of Aggravated Sexual Battery\nALLEN COUNTY, Kan. (KPR) – The Kansas Bureau of Investigation (KBI) and the Iola Police Department say a paramedic with Iola Emergency Medical Services (EMS) has been arrested. On Monday afternoon, 42-year-old Adam M. Ferguson, of Iola, was arrested for aggravated sexual battery related to an incident that occurred in December, while Ferguson was working as a paramedic with Iola EMS. The allegation was reported to the Iola Police Department, who requested KBI assistance with the case. Investigative findings were presented to Allen County Attorney Jerry Hathaway and charges were filed May 22. Ferguson was arrested at his residence. The case remains under investigation.\n==========\nJackson County Sheriff Identifies Inmate Who Died in Custody\nTOPEKA, Kan. (WIBW) - The Jackson County Sheriff’s Office has identified the man who died in custody this week at the county jail. WIBW TV reports that 70-year-old Mark W. Hull, of Topeka, was found unresponsive in his cell Tuesday. He was pronounced dead at the scene. Hull had been in jail since May 2 on drug charges. The Kansas Bureau of Investigation is reviewing Hull’s death but say no foul play is suspected.\n==========\nTransgender Kansans Prepare for Law Changes\nWICHITA, Kan. (KNS/KMUW) — A new law taking effect in July will affect transgender Kansans. Among other provisions, the new law will bar them from using public restrooms, locker rooms and other spaces that match their gender identity. The law doesn’t specify any enforcement measures, which has left trans people with a degree of uncertainty. University of Kansas law professor Kyle Velte says the lack of clarity is creating confusion about whether businesses have a duty to enforce the law. \"If a customer sees somebody that they suspect is trans going into a women's restroom, do they have the right to go to the proprietor and say, I want to enforce the Women's Bill of Rights? That is very unclear,\" he said. Transgender Kansans will also likely lose the ability to change the gender listed on their drivers licenses and other state IDs on July 1st.\n==========\nTarget on the Defensive After Removing Some Products Aimed at LGBTQ+\nNEW YORK (AP) — Target once distinguished itself as being boldly supportive of the LGBTQ+ community. Now that status is tarnished after it removed some products aimed at LGBTQ+ and relocated Pride Month displays to the back of stores in certain Southern locations in response to online complaints and in-store confrontations that it says threatened employees’ well-being. Target faces a second backlash from customers upset by the discount retailer’s reaction to aggressive, anti-LGBTQ+ activism, which has also been sweeping through Republican state legislatures. Civil rights groups chided the company on Wednesday for caving to anti-LGBTQ+ customers who tipped over displays and expressed outrage over gender-fluid bathing suits. “Target should put the products back on the shelves and ensure their Pride displays are visible on the floors, not pushed into the proverbial closet,” Human Rights Campaign president Kelley Robinson said in a statement. “That’s what the bullies want.”\nThe uproar over Target’s Pride Month marketing — and its response to critics — is just the latest example of how companies are struggling to cater to different groups of customers at a time of extreme cultural divides, particularly around transgender rights. Bud Light is still dealing with the fallout from when it sent transgender influencer Dylan Mulvaney a beer can with her face on it, which Mulvaney then displayed in an Instagram post, igniting backlash. Bud Light's parent company is tripling its U.S. marketing spending this summer as it tries to restore lost sales. In Florida, Disney has been engaged in a legal battle with Governor Ron DeSantis since expressing opposition to the state's classroom limits on discussing gender identity and sexual orientation.\nAllen Adamson, the co-founder and managing partner of the marketing firm Metaforce, said Target should have thought through the potential for backlash and taken steps to avoid it, like varying the products it sells by region. “The country is far less homogenous than it ever was,\" he said. “For any brand, it’s not ‘one size fits all’ anymore.” Shares of Target, which is based in Minneapolis, extended their fall on Thursday, declining 2.6% in morning trading. On Wednesday, the stock closed down 3%.\nAccording to a 2021 Gallup poll, 21% of people in Generation Z identify as lesbian, gay, bisexual or transgender, compared with 3% of Baby Boomers. Gallup has also found that younger consumers are most likely to want brands to promote diversity and take a stand on social issues. “Pulling back is the worst thing that they could have done,\" said Jake Bjorseth, who runs trndsttrs, an agency helping brands understand and reach Gen Z customers. “Not to expect potential backlash is to not understand what (LGBTQ+) members go through on a daily basis.” “Once they fold to the more extreme edges of the issue, then they’ve lost their footing,” Adamson added. “If you can change a big brand just by knocking over a display, then they are on the defense, and you never win on the defense.”\nTarget has long been seen as a trailblazer among retailers in the way it embraced LGBTQ+ rights and customers. It was among the first to showcase themed merchandise to honor Pride Month, which takes place in June, and it has been out front in developing relationships with LGBTQ+ suppliers. It has also faced backlash. In 2016, when a national debate exploded over transgender rights, the company declared that “inclusivity is a core belief at Target” and said it supported transgender employees and customers using whichever restroom or fitting room “corresponds with their gender identity.” But even after being threatened with boycotts by some customers, Target announced months later that more stores would make available a single-toilet bathroom with a door that could be locked.\nAs recently as last year, law enforcement agencies were brought in to monitor a social media threat from a young Arizona man who said he was “leading the war” against Target for its Pride Month merchandise, and he encouraged others to take action. But the company is operating in an even more politicized environment now.\nThere are close to 500 anti-LGBTQ+ bills that have gone before state legislatures since the start of this year, according to the American Civil Liberties Union. At least 17 states have enacted laws restricting or banning gender-affirming care for transgender minors, though judges have temporarily blocked their enforcement in some states.\nTarget declined on Thursday to say which items it was pulling from its stores. But \"tuck friendly” women’s swimsuits, which allow trans women who have not had gender-affirming operations to conceal their private parts, were among Target’s Pride items that garnered the most attention. Target removed online this week designs by Abprallen, a London-based company that sells occult- and satanic-themed LGBTQ+ clothing and accessories outside of Target.\nAbprallen couldn't immediately be reached for comment but its website on Thursday said it was temporarily closed, with a message that read: “Thank you all for your unrelenting support and love. The positivity and beautiful vibes you’ve sent my way this past week has been overwhelming.” The controversy at Target has been exacerbated by several misleading videos circulating online. In some, people falsely claimed the retailer was selling “tuck-friendly” bathing suits for kids. ”Given these volatile circumstances, we are making adjustments to our plans, including removing items that have been at the center of the most significant confrontational behavior,” Target said in a statement Tuesday.\nThe company pledged its continued support for the LGBTQ+ community and noted it is “standing with them as we celebrate Pride Month and throughout the year.” Indeed, it was business as usual at many Target locations on Wednesday. At the Target in Topeka, Kansas, the Pride display remained up front, visible as shoppers passed a corral of shopping carts right after the entrance. It included Pride-themed clothing for kids, as well as T-shirts and women’s bathing suits for adults. “I like that our local stores here have it front and center, when you walk in,” said Shay Hibler, a Topeka self-employed small business owner who was shopping with her 13-year-old daughter and supports LGBTQ+ rights.\nMegan Rusch, a Kansas City-area resident who is studying criminal justice at Washburn University in Topeka, was shopping at the same store and said while other locations might worry about their image, “This is a pretty diverse area.” She said she believes it’s good for the stores to have the Pride displays so that LGBTQ+ customers feel included. Her shopping companion, Blake Ferguson, a Colorado resident who is studying accounting and finance student at Ottawa University, added simply: “Love is love.”\n==========\nKCI Preparing for Memorial Day Weekend Crowds\nKANSAS CITY, Mo (KSHB) — Memorial Day weekend, the unofficial start of summer, begins Friday for many people. Travel experts expect more Americans to travel this holiday weekend than at any time since 2019, before the COVID-19 pandemic. KSHB TV reports that Kansas City International Airport is getting ready for a surge of travelers. Airport officials say they expect at least 20,000 passengers to fly out of KCI every day through the weekend, starting today (THUR). That would make it the new airport’s busiest weekend since opening in February. KCI is bringing on additional staff to manage the expected heavy passenger traffic.\n==========\nRemains of World War II Soldier to be Buried in Southeast Kansas\nINDEPENDENCE, Kan. (KPR) – The remains of a U.S. soldier killed during World War II will be interred June 2, at Mount Hope Cemetery, Independence, Kansas. Graveside services for Army Air Force Staff Sgt. David E. Holeman will be performed by Webb & Rodrick Chapel in Independence, preceding the interment. A native of Le Harpe, Kansas, Holeman was a member of the 17th Pursuit Squadron, 24th Pursuit Group, when Japanese forces invaded the Philippine Islands in December 1941. Intense fighting continued until the surrender of the Bataan peninsula April 9, 1942, and of Corregidor Island May 6, 1942.\nHoleman was among thousands of U.S. and Filipino service members captured and interned at POW camps when U.S. forces in Bataan surrendered to the Japanese. The men were subjected to the 65-mile Bataan Death March and held at a Prisoner of War Camp where more than 2,500 POWs perished. According to prison camp and other historical records, Holeman died July 19, 1942, and was buried along with other deceased prisoners in the local Cabanatuan Camp Cemetery in Common Grave 312. He was 39 years old.\nFollowing the war, American Graves Registration Service personnel exhumed those buried at the cemetery, relocating the remains to a temporary U.S. military mausoleum near Manila. Twelve sets of remains from Common Grave 312 were identified in 1947 – the rest were declared unidentifiable and buried at the Manila American Cemetery and Memorial as unknowns. In early 2018, the remains associated with Common Grave 312 were disinterred and sent to the Defense POW/MIA Accounting Agency laboratory at Joint Base Pearl Harbor-Hickam, Hawaii, for analysis.\nHoleman was accounted for August 23, 2022, after his remains were identified using circumstantial evidence as well as anthropological, mitochondrial DNA, Y chromosome DNA and autosomal DNA analysis. Although interred as an unknown at the Manila American Cemetery and Memorial, Holeman’s grave was meticulously cared for over the past 70 years by the American Battle Monuments Commission.\nClick here for additional information about Staff Sgt. Holeman.\n==========\nLawrence Busker Festival Lands in Downtown Lawrence this Weekend\nLAWRENCE, Kan. (LJW) – Street performers will be out in force at the annual Lawrence Busker Festival this weekend. The four day event runs Friday through Monday in downtown Lawrence. According to the Lawrence Journal-World, the highlights include Friday’s family-friendly street party at 10th and Massachusetts, the Art Tougeau art car parade at noon on Saturday, and four stages, two on Eighth Street and two on Massachusetts, with a rotation of entertainment all weekend. Vendors, face-painting, balloon artists and much more will be available. A full schedule of events can be seen at lawrencebuskerfest.com.\n==========\nFour Men Charged with Trafficking Firearms in Kansas City\nKANSAS CITY, Mo. (KPR) — Four Kansas City area men have been indicted by a federal grand jury for illegally selling machine guns and other firearms, some of which have been linked to prior shootings. According to the Bureau of Alcohol, Tobacco and Firearms, three of the men are from Kansas City. One is from nearby Independence. All four have been charged in a 23-count indictment returned under seal by a grand jury in Kansas City last week. The indictment was unsealed and made public this week. Prosecutors say several of the guns have been traced to other crimes, including fatal shootings.\nProsecutors allege that all four defendants took part in a conspiracy to illegally traffic in firearms, including machine guns. Those charged include 21-year-old Antonio Manning, his 20-year-old brother, Sheron Lamont Manning and 20-year-old Michael Dewayne Hardy, all of Kansas City, and 25-year-old Dejohuan Mietz Huntley, of Independence. According to a detention motion filed by the government, the firearms allegedly were sold to a confidential informant monitored by the Bureau of Alcohol, Tobacco, Firearms and Explosives. (Read more.)\n==========\nKansas City Studies Idea of Reparations for Black Residents\nKANSAS CITY, Mo. (KCUR) — The Kansas City Mayor's Commission on Reparations met for the first time this week to study how slavery and racial segregation policies over the last century have harmed the community's Black citizens in areas like education and housing. KCUR Radio reports that Kansas City Mayor Quinton Lucas appointed the committee earlier this month to study reparations for Black Kansas Citians. Lucas said this work is not to atone for what happened during slavery, but to solve problems that still affect Kansas Citians.\nNearly half of this week's meeting consisted of a presentation by Mickey Dean, the founder of the KC Reparations Coalition, which submitted the first reparations proposal to City Council in 2020. Dean's history of the reparations movement included explanations of the injustices incurred by Black people in the United States from 1619 to the present.\nOne example of discriminatory policies was the Homestead Act. \"If you read the Homestead Act you'll see it's, racially neutral on its face,\" Dean said. \"But in reality, 99.73 percent of all of the land that was distributed under the Homestead Act went to white people, and Black people got nothing,” he said. Dean estimated some 93 million white Americans still benefit from the Civil War-era policy that encouraged white settlers and immigrants to move West, leading to the displacement and genocide of Indigenous populations.\nThe committee is scheduled to meet on the last Tuesday of the month for the next 18 months and present their findings and recommendations to City Council.\n==========\nKeystone Oil Pipeline Spill in Northern Kansas - What Happened?\nWASHINGTON COUNTY, Kan. (KNS) — The Keystone pipeline’s biggest spill ever... happened in Kansas last year. Now, an investigation reveals that the Canadian operator, TC Energy, knew about problems in that section of the pipeline a decade ago. The Kansas News Service reports that a chain of events led to the massive spill in December.\nThe Keystone was built with extra safety measures, yet it split open under run-of-the-mill pressure levels that less rigorously designed pipelines regularly withstand. Independent investigators paint a very different picture from what oil company TC Energy has said publicly about events that led to the spill. For instance, the independent report says the company dug up the section of pipe nearly a decade before it burst because it knew the pipe had warped. Yet it reburied the spot without fixing it.\nInvestigators also found gaps in TC Energy’s standards and controls for how it designs bends in the pipeline and how it judges whether to repair warped pipes. The investigation also found lapses in construction oversight and pointed to ways TC Energy underestimated key risks that paved the way for more than 500,000 gallons of tar sands crude oil to spill onto a hillside and into a stream in Washington County in northern Kansas.\nTC Energy says it has “robust practices and policies” and that the spot that ruptured was up to code. “We are confident in our ability to continue to safely deliver the energy North Americans rely on,” the company said in an email. “We will examine how we can further our overall safety and integrity.” TC Energy says that it is running extra checks on its system and that it ran inspection tools through 300 miles of pipe in Nebraska, Kansas and Oklahoma. (Read more.)\n==========\nKCC Approves Transmission Line from Wolf Creek Power Plant\nTOPEKA, Kan. (WIBW) – The Kansas Corporation Commission has approved an 83-mile transmission line starting at the Wolf Creek nuclear power plant near Burlington in Coffey County and spanning five counties. WIBW TV reports the KCC approved the permit Wednesday to construct the transmission line through Coffey, Anderson, Allen, Bourbon and Crawford counties. NextEra Energy will build and operate the transmission line.\n==========\nJury Recommends 50+ Years in Prison for Missouri Mom Whose Two Children Died in Hot Car\nLIBERTY, Mo. (AP) — A jury is recommending a sentence of more than 50 years in prison for a Missouri mother whose two young daughters died when she left them in a hot car and then fell asleep. A Clay County jury on Monday recommended that Jenna Boedecker serve 22 years in prison for each of two counts of second-degree murder. The jury also recommended nine years for several counts of endangering the welfare of a child. The same jury convicted Boedecker on Friday. Prosecutors alleged Boedecker left her 2-year-old and infant daughter inside a vehicle overnight at a rural home near Kearney and then fell asleep. Emergency responders found the girls dead on July 4.\nProsecutors alleged that Boedecker said she put her 2-year daughter and 8-week-old daughters in her Jeep while she argued with her husband and then fell asleep at their rural Kearney home on July 3, 2018. She found them unresponsive the next morning and took them to a neighbor's home for help but emergency responders declared the girls dead. Evidence during the trial showed Boedecker had about two times the therapeutic amount of Xanax in her system the day her daughters were found, WDAF-TV reported.\nClay County Prosecutors Zachary Thompson said evidence also showed Boedecker had contact with law enforcement the day before the girls died about a separate incident of leaving the children in the vehicle.\n==========\nKC Transportation Authority Hopes to Study Intercity Rail for Northeast Kansas\nTOPEKA, Kan. (KSNT) – The Kansas City Area Transportation Authority has applied for a $500,000 grant from the Federal Railroad Administration to study the idea of an intercity rail system. The rail line would serve northeast Kansas and the KC Metro. KSNT reports that if it’s eventually approved, the new rail system could connect Kansas City International Airport to Olathe and Independence, Missouri, with Topeka - with numerous stops along the way.\n==========\nDeath of Historic Kansas Tree Reveals Secrets\nINDEPENDENCE, Kan. (KSNW) — The community of Independence has lost a beloved historic tree. KSNW TV reports that the Riverside Park elm tree had stood for as long as anyone could remember. But unfortunately, the tree had to come down after Dutch Elm Disease killed it. Park, Zoo, and Cemetery Director Scott Patton says a close inspection of the tree's rings turned up several surprises. First, the tree was 130 to 150 years old. Second, it wasn’t one tree but four trees that had grown together. It’s a process called inosculation. Basically, four trees grew near each other and eventually grew together, appearing to be a single tree. The rings of the trees also showed signs of historical events like a flood and the Dust Bowl of the 1930s. Patton says cut sections of the trees will be displayed and used for educational purposes. They are also working on ideas to preserve the remaining stump.\n==========\nTopeka Zoo to Undergo Animal Exhibit Renovations\nTOPEKA, Kan. (KSNT) — The Topeka Zoo will undergo some major updates this summer. KSNT reports that the facility will renovate several animal exhibits. The zoo’s black bears will see the first addition. Construction will begin next month on new features in the bear’s living area including a new climbing structure and an interactive learning and exploration experience for the animals. In July, renovations will begin for the golden lion tamarins new outdoor exhibit. The new exhibit will be larger, and mimic a Brazilian jungle tree canopy which is closer to their natural environment.\n==========\nKDHE: Senior Food Coupons to Increase Value\nTOPEKA, Kan. (KOAM) – Officials with the Kansas Department of Health and Environment (KDHE) say they intend to increase the value of food coupons available for low-income seniors. KOAM TV reports that the Kansas Senior Farmers Market Nutrition Program raised its coupon value from $35 to $50. KDHE says seniors are eligible for the coupons if they complete an application, are 60 years old or older and meet income guidelines. The coupons can be redeemed from vendors at participating farmers’ markets for the purchase of eligible foods. Seniors can apply at local KDHE offices beginning June 1st. Seniors can find more information on the food coupons by clicking here.\n==========\nPresident Biden's Nominee for Kansas Federal Judge Post Asks to Withdraw\nWASHINGTON (Reuters) — Jabari Wamble, U.S. President Joe Biden's pick for a federal judgeship in Kansas, has asked to have his nomination withdrawn from consideration in the U.S. Senate. Reuters reports that Wamble became the second Biden judicial nominee to drop out in as many weeks. Michael Delaney, a former New Hampshire attorney general selected by Biden for a spot on the Boston-based 1st Circuit U.S. Court of Appeals, last week asked to withdraw his nomination amid bipartisan criticism in the Senate. Wamble is the son-in-law of Missouri Congressman Emanuel Cleaver. Wamble wrote in his letter to Biden that he feels that \"it is best\" to remain in his current position as a federal prosecutor in Kansas. Wamble did not give detailed reasons for his withdrawal. The U.S. Constitution gives the Senate the authority to confirm presidential judicial nominations.\n==========\nOklahoma Lures Solar Panel Manufacturing Facility with $180 Million Incentive Package\nOKLAHOMA CITY (AP/KPR) — Enel North America says it's planning to invest more than $1 billion and will create about 1,000 new jobs with a new solar cell and panel manufacturing facility in eastern Oklahoma. The company announced this week that construction will start in the fall. Oklahoma landed the project after the Legislature and governor agreed to offer up to $180 million in tax rebates if the company hits certain benchmarks over the next several years. In order to qualify for the entire package of incentives, the company would have to spend at least $1.8 billion in qualifying capital expenditures and create 1,400 permanent new jobs.\nThe company will build a 2 million-square-foot solar photovoltaic cell and panel manufacturing facility that will have an annual production capacity of 3 gigawatts, it said in a statement. Construction on the massive facility is expected to begin this fall in Inola, Oklahoma, which is located about 27 miles east of Tulsa.\nOklahoma also agreed to spend more than $38 million on water and wastewater system upgrades to the inland waterways in the region, including at the Port of Inola.\nEnel North America's parent company is based in Italy, and European companies have been eying the U.S. to invest in the green energy boom, weighing up the U.S. Inflation Reduction Act's $375 billion in benefits for renewable industries.\nOklahoma lawmakers are also considering a separate package of incentives to lure a second Panasonic manufacturing facility to the Sooner State. Last year, Oklahoma lost out in a bidding war with Kansas, which the Japan-based company ultimately selected as the location for a multibillion-dollar mega-factory to produce electric vehicle batteries for Tesla and other carmakers.\n==========\nKansas State Pitchers Combine for 2-Hitter, Eliminate Texas from Big 12 Tournament\nARLINGTON, Texas (AP) — Ty Ruhl and Tyson Neighbors combined for a two-hitter and Kansas State eliminated top-seeded Texas 6-0 in the Big 12 Tournament. Kansas State (34-23) plays in another elimination game on Friday. Texas (38-20) was the first team eliminated from the tournament. Dom Hughes went 3 for 4, including an RBI single in the first inning to give Kansas State a 1-0 lead that would hold until a five-run seventh. Kansas State chased starter Lebarron Johnson after leading off the seventh with a single. The Wildcats scored five runs with the bases loaded — two on walks. Nick Goodwin hit his two-run double off the third Texas pitcher of the inning.\n==========\nBaker Team Loses Opening Game in NAIA Softball World Series\nUNDATED (KPR) – In the NAIA Softball World Series, the Baker University Wildcats lost their opening game Thursday, 2-0, in eight innings. The game went into extra innings after a scoreless tie through seven, but Central Methodist captured the win on a two-run homer in the eighth and advanced in the winner's bracket. Baker will play Friday morning in an elimination against the loser of the Thursday night game between the University of the Cumberlands of Kentucky and the University of Science and Arts of Oklahoma.\nThe Baker Wildcats are making their first appearance in the NAIA Softball World Series.\n==========\nJayhawks' Kevin McCullar Jr Returning for Last Season of Eligibility\nUNDATED (AP) – Kevin McCullar Jr. said Wednesday that he will return to Kansas for his final year of eligibility, likely rounding out a roster that could make the Jayhawks the preseason No. 1 next season. McCullar transferred from Texas Tech to Kansas for last season, when he started 33 of 34 games and averaged 10.7 points and 7.0 rebounds. He was also among the nation's leaders in steals, and along with being selected to the Big 12's all-defensive team, the 6-foot-6 forward was a semifinalist for the Naismith Defensive Player of the Year award. “To be able to play in front of the best fans in the country; to play for the best coach in the nation, I truly believe we have the pieces to hang another banner in the Phog,\" McCullar said in announcing his return. Along with McCullar, the Jayhawks return starters Dajuan Harris Jr. and K.J. Adams from a team that went 28–8, won the Big 12 regular-season title and was a No. 1 seed in the NCAA Tournament, where it lost to Arkansas in the second round.\nPerhaps more importantly, the Jayhawks landed Michigan transfer Hunter Dickinson, widely considered the best player in the portal, to anchor a lineup that was missing a true big man. They also grabbed former five-star prospect Arterio Morris, who left Texas, and Towson's Nick Timberlake, who emerged last season as one of the best 3-point shooters in the country. The Jayhawks also have an elite recruiting class arriving that is headlined by five-star recruit Elmarko Jackson.\nMcCullar declared for the draft but, after getting feedback from scouts, decided to return. He was a redshirt senior last season, but he has another year of eligibility because part of his career was played during the COVID-19 pandemic. “This is a big day for Kansas basketball,” Jayhawks coach Bill Self said. “Kevin is not only a terrific player but a terrific teammate. He fit in so well in year one and we’re excited about what he’ll do with our program from a leadership standpoint.”\n==========\nChiefs' Mahomes: 'I'm About Legacy and Winning Rings More Than Making Money'\nUNDATED (AP) – Patrick Mahomes would rather win Super Bowls than a contest to make the most money. That doesn't mean the Kansas City Chiefs quarterback hasn't seen what's been happening across the NFL. Mahomes signed a 10-year, $450 million extension in 2020 that set the bar for quarterbacks, but it already has been surpassed several times over. The Eagles' Jalen Hurts signed a five-year, $255 million deal April 17 that briefly made him the NFL's highest-paid player, until Lamar Jackson signed a five-year, $260 million deal with the Ravens a mere 10 days later. That immediately raised the question about whether Mahomes would want to redo his contract.\n“Me, my agent and the team always keep open communication, and we always try to do whatever is best for the team, and obviously I want to do what is best for me as well,” Mahomes said after a voluntary workout Wednesday at the team's facility. \"But I've always said I'm about legacy and winning rings more than making money at this moment. I know we keep communication. We see what's going on around the league,\" he continued, \"but at the same time, I'll never do anything that will hurt us from keeping the great players around me. It's about teetering on that line.”\nStill, the deal Mahomes signed just three years ago already has slipped to seventh in terms of annual value, behind far less accomplished QBs such as the Broncos' Russell Wilson, Kyler Murray of the Cardinals and the Browns' Deshaun Watson. “Everybody wants to get paid a lot of money when they think they're the best at their craft,” Mahomes said. “But when you look at the greats, they find that sweet spot where they make a lot of money but they keep great players around them.”\nMahomes is coming off perhaps the best year of his career, throwing for a league-leading 5,250 yards and 41 touchdowns with only 12 interceptions. He was chosen for his fifth straight Pro Bowl, voted the AP's player of the year for the second time and, in February, helped Kansas City rally in the second half for a Super Bowl victory over Hurts and the Eagles. Given those accomplishments, it's hardly surprising that many are curious whether another contract is in the works, especially with Joe Burrow of the Bengals expected to reset the market with a new contract before the start of the season.\n“You just want to not hurt other quarterbacks when their contracts come up,” Mahomes said. “You want to keep pushing but it's not about being the highest-paid guy. It's not about making a ton of money. I've made enough money where I'll be set for life. But at the same time, you have to find that line where you're making good money and keeping great players around you.”\nMahomes spent the first part of the offseason program working out with wide receivers and tight ends at his home in Texas, but he was back at the Chiefs training facility this week for the start of more structured voluntary workouts. In between, Mahomes jetted his way to the Met Gala, the Kentucky Derby and the Formula One race in Miami.\n“I always wanted to go to the Kentucky Derby but I wanted to go after we won the Super Bowl, and in 2019, we had COVID happening,\" Mahomes said. “It's just picking and choosing what you can do, but now we're back in football and locking down and getting your body in the right spot. I have a few more trips but I've kind of settled down this offseason.”\nChiefs coach Andy Reid said he had no reason to believe Mahomes wouldn't be there. “He's all in and going after it,” Reid said Wednesday, “and he challenges himself and he challenges those around him to be great, on both sides of the ball. Everything is alive out there and moving fast and as a head coach, I appreciate that.”\n==========\nThis summary of area news is curated by KPR news staffers, including J. Schafer, Laura Lorson, Tom Parkinson and Kaye McIntyre. Our headlines are generally posted by 10 am weekdays and updated throughout the day. These ad-free headlines are made possible by KPR members. Become one today. And follow KPR News on Twitter.",
  "word_count": 6390,
  "scraped_at": "2026-02-14T12:01:04.068141"
}