{
  "article_id": "d18bbb53a010",
  "url": "https://www.southernhighlandnews.com.au/story/8704799/meet-illawarras-2024-paris-olympians/?cs=300",
  "title": "Meet Illawarra 2024 Paris Olympians | Southern Highland News",
  "date": "20240724T220000Z",
  "domain": "southernhighlandnews.com.au",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Some were born here, some spent their early years here, others are intrinsically linked and some still call the Illawarra home.\nSubscribe now for unlimited access.\nor signup to continue reading\nAnd we'll be backing them all the way when they don the green and gold for Australia at the 2024 Paris Olympics.\nThere are 11 women in the 15-strong Illawarra contingent, and three of them are Matildas.\nWhat's more, all three - Caitlin Foord, Mary Fowler and Michelle Heyman - have worn the colours of the Illawarra Stingrays.\nThen there's the inimitable Emma McKeon - the most successful Australian Olympian of all time - who will bring a close to her always-elegant career in the French capital.\nEquestrian Shane Rose is the oldest member of Australia's Olympic team at 51, and two of these athletes - gymnast Ruby Pass and surfer Tyler Wright - will make their games debuts.\nNow, meet them all ...\nBLAKE GOVERS\n- Age: 28\n- Olympics: Rio 2016, Tokyo 2020\n- Event: Hockey\nAt 18 years of age, Govers was the youngest member of the Rio 2016 men's hockey squad, following the example of his brother Kieran who played at London in 2012.\nThe one-time Albion Park Hockey Club and UOW player made his international debut in May 2015 at the Hobart International Challenge, scoring a goal on debut.\nHe was crowned top scorer and best junior at the 2015 World League semi-final.\nGovers was a part of the six-placed Aussie squad at the Rio Olympics in 2016, and was joint top-scorer at the 2018 World Cup with seven goals.\nThat rich vein of form continued and the next year he was the 2019 FIH Pro League top-scorer (12 goals in 14 matches) and was nominated for the Rising Star of the Year Award.\nGovers was part of the silver medal-winning Kookaburras squad at the Tokyo Olympics where Belgium broke green and gold hearts in a shootout.\nCAITLIN FOORD\n- Age: 29\n- Olympics: Rio 2016, Tokyo 2020\n- Event: Football\nThe Mt Warrigal-born Illawarra Stingrays product is one of the nation's most recognisable football stars.\nFirst bought into the Matildas' squad as a 16-year-old in 2011, she played the World Cup that year in Germany as a right back. Australia was knocked out in the quarter-finals but Foord was named the tournament's best young player.\nFour years later she was at the other end of the pitch as a forward in the Matildas' reached the 2015 World Cup quarter-finals; she played at the Rio Olympics and followed that with another World Cup in 2019.\nHeading to Arsenal in 2020 increased her profile, as did the Tillies' fourth placing at the Tokyo Olympics where Foord scored in the bronze medal match against the US and set up a Sam Kerr goal, too, in Australia's best-ever Olympics finish.\nAt the 2023 World Cup, Foord proved why she's a plank of the national team and with two goals during the tournament is now at No.5 on the all-time scorer's table.\nEMMA McKEON\n- Age: 30\n- Olympics: Rio 2016, Tokyo 2020\n- Events: 50m freestyle, 100m butterfly\nMcKeon is the most successful Australian Olympian of all time.\nIn the pandemic-delayed Tokyo Olympics, she won seven medals - four gold, three bronze - the single biggest hail by a female swimmer at an Olympics.\nThat took her total Olympic medal haul to 11, eclipsing Ian Thorpe and Leisel Jones' previous record of nine.\nAt Tokyo she also claimed four Olympic records (50m freestyle, 100m freestyle, the women's 4x100m medley relay and the 4x100m freestyle relay). The 4x1 freestyle relay doubled as a world record, too.\nHer Olympic pedigree is strong. Swimming runs long and deep in the family. Her father Ron is a dual Olympian(1980 and 1984), as a freestyler he won four Commonwealth Games gold medals, while her mum Susie (nee Woodhouse) was a 200m butterfly finalist in the 1982 Commonwealth Games in Brisbane. Her brother David McKeon (London 2012, Rio 2016) is also a dual Olympian, taking home silver in Rio.\nELLEN PEREZ\n- Age: 28\n- Olympics: Rio 2016, Tokyo 2020\n- Event: Tennis\nFrom Oak Flats Tennis Club to the Tennis Australia academy at Melbourne Park and now .... the world!\nEllen Perez takes on her second Olympics after exiting the mixed and the women's doubles competitions at the recent Wimbledon championships in the second rounds.\nA seven-time finalist and two-time champion on the Women's Tennis Association doubles circuit, Perez won her maiden title with Daria Saville in 2019.\nShe has won two singles titles and 17 doubles titles on the International Tennis Federation circuit since turning professional in 2013.\nPartnered with Sam Stosur at the Tokyo Olympics, the unseeded Aussies made the quarter-finals before their run was stopped.\nShe'll renew her partnership with Saville in the women's doubles.\nFLYNN OGILVIE\n- Age: 30\n- Olympics: Tokyo 2020\n- Event: Hockey\nHailing from the University of Wollongong Hockey Club, the talented midfielder made his representative debut for Australia at the 2010 Youth Olympic Games where Australia won gold.\nIn 2014 Flynn made his senior international debut and has been a squad regular ever since.\nHe's won gold medals at the 2015 and 2019 Oceania Cup, the 2016 and 2018 Champions Trophy, the 2018 Commonwealth Games and the Pro League in June 2019.\nAt Tokyo 2020, Ogilvie was part of the silver medal-winning Kookaburras squad that lost to Belgium in a shootout.\nThe Aussies bounced back at the 2022 Commonwealth Games, maintaining their gold medal streak since men's hockey was introduced in 1998.\nGRACE STEWART\n- Age: 27\n- Olympics: Rio 2016, Tokyo 2020\n- Event: Hockey\nThe forward moved from her hometown Gerringong to Perth in 2016 when she was promoted from the National Junior Squad and awarded a Hockey Australia Scholarship to train full-time with the senior team at the Western Australian base.\nHer performance at the 2016 Champions Trophy in London and the International Hockey Tournament earned Stewart her Olympic debut in Brazil where the Aussies lost to New Zealand in the quarter-finals.\nShe won silver with the Hockeyroos at the 2018 Commonwealth Games and the International Hockey Federation (FIH) Pro League before a heartbreaking quarter-final loss to India at the 2020 Tokyo games.\nIn 2022 the Aussies won bronze in the FIH Women's World Cup, and were runners-up at the Birmingham Commonwealth Games.\nIn 2023, the Hockeyroos finished third in the Women's International Pro League, before clinching a place at Paris by winning the Oceania Cup series against New Zealand.\nJESSICA HULL\n- Age: 27\n- Olympics: Tokyo 2020\n- Event: Athletics 1500m\nThe Albion Park-raised athlete may have been previously based in the US for a while and now may have relocated to the Hunter region, but she's Illawarra through and through.\nAfter an amazing lead-up to the Games, the 27-year-old is being spoken of as a genuine medal chance in the women's 1500m final. In the last fortnight alone, the 27-year-old has set a new personal best and broke a world record (2000m).\nAfter starting her athletics journey in cross-country running at school, Jessica joined Albion Park Little Athletics Centre. Her father, Simon, who was a national level middle-distance runner, guided his daughter's development, building a foundation with meticulous planning.\nIn the three years since the Tokyo Olympics, Hull has competed for Australia on seven occasions and bagged a bronze medal in the mixed teams relay at the world cross-country championships in Australia.\nHer standout 2024 has included a fourth placing over 3000m at the World Indoors in March, her fourth national 1500m title in April, at 1500m; personal bests at every distance from 800m to 3000m, and five more national records, taking her tally to 19.\nKIERAN WOOLLEY\n- Age: 20\n- Olympics: Tokyo 2020\n- Event: Skateboarding, men's park\nIn 2017 Woolley was crowned Australian Junior Bowl riding champion and as a 14-year-old finished sixth at the Continental Cup Global Series.\nA year later he was fourth at the Oceania Continental Championships and the Wollongong native made the skateboarding world sit up and take notice.\nIn 2019 he skated the Olympic qualifier in two wrist braces and, quite remarkably, finished as runner-up in the Australian Park Skateboarding Nationals.\nAt the Tokyo Olympics, he scored the second-highest score in qualifying to advance to the finals. There his 82.04-point ride left him just 2.09 away from a podium finish.\nMARY FOWLER\n- Age: 21\n- Olympics: Tokyo 2020\n- Event: Football\nFowler, once an Illawarra Stingray, after spending two seasons with Montpellier HSC in France, now plays for Manchester City.\nShe captured imaginations the world over with her silky skills in the 2023 World Cup.\nShe scored against Canada in the group stage, sent the most exquisite through-ball to Caitlin Foord to score against Denmark in the round of 16 and converted a crucial penalty against France.\nShe made her Matildas debut as a 15-year-old in 2018 and was in the World Cup squad a year later.\nAt the Tokyo Olympics, she was in the squad that made history. The Matildas produced the nation's best-ever result - finishing fourth after going down 4-3 to the USA in the bronze medal game.\nShe, too, starred in the Olympic qualifier against Uzbekistan, scoring twice and producing an assist in her 50th cap for the Tillies.\nMICHELLE HEYMAN\n- Age: 36\n- Olympics: Rio 2016\n- Event: Football\nAfter junior years in Shellharbour, Michelle cracked the then W-League with Sydney FC and in 2008 and went on to make her Matildas debut in 2010.\nShe played the Asian Cup in 2014, the women's World Cup the following year and scored from the spot in the 2016 Olympics quarter-final Australia ultimately lost to Brazil.\nInjury at the 2018 Asian Cup prompted her retirement from the game.\nHours of rehab and a competitive hunger earned her a place at Canberra United in 2020-21 and her consistent goal-scoring didn't go unnoticed.\nWhen star striker Sam Kerr's ACL injury hit, Heyman was recalled to the national team.\nAfter scoring once in the first leg, Heyman bagged four when Australia slammed 10 past Uzbekistan to claim a place in Paris back in February.\nSARAH CARLI\n- Age: 29\n- Olympics: Tokyo 2020\n- Event: 400m hurdles\nCarli's Olympic debut in Tokyo was a miracle of sorts. In the lead-up to the pandemic-delayed games, when she ran 55.09 for the one-lap race, she suffered what was thought to have been a training mishap late February 2021 but which turned into a life-and-death situation. She damaged the wall of the carotid artery, had a seizure in Wollongong Hospital and needed life-saving vascular surgery. Somehow she resumed racing in June, clocking 58.53.\nAt Tokyo, she finished fifth in her heat, in the remarkable time of 56.93 - 0.1 away from automatic qualification.\nIn 2022 she won her first national title; in Europe in 2023 she smashed her PB clocking 54.66. and also ran three of her fastest four times. Carli is now the third fastest Australian of all time in the vent - behind none other than Olympic champion Debbie Flintoff-King and world champion Jana Pittman.\nIn the lead-up to Paris, Carli won her third national title - in 54.96, the second fastest time of her career.\nSHANE ROSE\n- Age: 51\n- Olympics: Beijing 2008, Rio 2016, Tokyo 2020\n- Event: Equestrian eventing mixed, eventing individual, individual - open, team - open\nFour months before the start of the Paris Olympics, equestrian Shane Rose was lying in a hospital bed with 19 different bone fractures. He was working with a young horse at his Werombi property in the Wollondilly shire, when it hit a hurdle and he ended up with the 550kg horse on top of him.\nDespite the seriousness of his injuries, Rose worked on a 100-day rehabilitation plan to get him to Paris. He made it.\nHe was selected to represent Australia in eventing at the 1996 Olympic Games in Atlanta as a 23-year-old but his horse ended up lame, preventing him from going on to compete with the team that would eventually win gold.\nSince then he has competed around the world, tasting success at the 2008 Beijing Olympics, where Rose and his horse All Luck were part of the team's silver medal for eventing. He also competed at the 2016 Olympics where he won a team bronze and at Tokyo where he won team silver.\nRUBY PASS\n- Age: 17\n- Olympics: Debut\n- Event: Artistic gymnastics\nThe 17-year-old, born in Figtree, called Shellharbour home before the gymnastics bug bit. When she turned 10 she joined a Sydney club to help advance that ambition. The family made the trip six days a week for three years before moving to Pass moved to Queensland - for gymnastics.\nCompeting out of Premier Gymnastics in Morningside, Brisbane, Pass was named Junior International Gymnast of the Year for 2021 by Gymnastics Queensland.\nIn 2023, Ruby transitioned seamlessly to senior competition, and in April was named the Commonwealth Games Australia Emerging Athlete of the Month.\nIn October 2023, Ruby was part of the Australian women's artistic team that booked its ticket to the Paris Olympics, after securing a team place at the Artistic World Championships in Antwerp, Belgium.\nNeeding to finish in the top 12, the team - Pass, Emily Whitehead, Georgia Godwin, Kate McDonald and Breanna Scott - came ninth, with 157.896 points. It was the first time Australia had qualified a team spot since London 2012.\nAt the 2024 Team Challenge in Stuttgart, Pass finished sixth in the all-around and the Australian team claimed silver with 159.450.\nSAYA SAKAKIBARA\n- Age: 24\n- Olympics: Tokyo 2020\n- Event: BMX\nSaya Sakakibara joined South Illawarra BMX Club with her brother Kai as youngsters and began competing on the junior circuit.\nSaya, a six-time national champion, made her Olympic debut at Tokyo 2020, joining teammate Lauren Reynolds in the semis.\nIn a hideous twist of fate, the younger sister of Kai, also an Aussie rep, who was seriously injured on the track in 2020, crashed out on the third run.\nShe suffered a concussion and took an extended break, returning at the end of 2021 to win her maiden Australian title at the national championships.\nIn 2023, she won five of the 10 rounds of the UCI BMX Racing World Cup and secured the overall title and world No. 1 ranking.\nTYLER WRIGHT\n- Age: 30\n- Olympics: Debut\n- Event: Surfing\nTwo-time world champion and part of the South Coast's surfing dynasty, Wright will make her Olympic debut in Paris.\nInitially from Culburra Beach, her brother Owen surfed for Australia at the Tokyo Olympics.\nShe made her debut as a fulltime professional in 2011, finished fourth, and was duly named rookie of the year.\nShe won back-to-back world championships in 2016 and 2017 before being struck down by chronic fatigue syndrome the following year.\nWright returned to competition full-time in 2021 and won the Maui Pro at Pipeline in Hawaii that year.\nSurfing at the Paris Olympics is being held at Teahupo'o, a small and quiet fishing village on Tahiti.",
  "word_count": 2522,
  "scraped_at": "2026-02-14T13:01:35.307365"
}