{
  "article_id": "d1c1c77c1035",
  "url": "https://theprideoflondon.com/posts/ajax-0-3-chelsea-women-3-standouts-blues-take-comfortable-lead-back-to-london-01hsc147zkr9",
  "title": "Ajax 0 - 3 Chelsea Women : 3 standouts , Blues take comfortable lead back to London",
  "date": "20240320T113000Z",
  "domain": "theprideoflondon.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "The stress heading into the second leg of the UEFA Women's Champions League quarterfinals is not going to be what it was last year. Even with injuries across all three lines, the depth is what separates this team from the majority. In front of a record crowd for women's football in the Netherlands, Emma Hayes' Chelsea Women took one step toward a second straight UWCL semifinal appearance with a 3-0 triumph over the three-time Vrouwen Eredivisie champions Ajax.\nSuzanne Bakker was forced to name an incredibly inexperienced starting XI with an average age of just under 22. Four of its starters were under the age of 21. Two were under 18. The low average age was mostly due to the club missing captain Sherida Spitse due to yellow card accumulation.\nThe Dutch outfit threatened to start, but the Blues grew into the match, taking complete control, using that all-important experience. The home side struck the post within the first seven minutes. Its two shots on target in the first half were the only it was able to muster throughout the 90 minutes. A calm finish by Lauren James that was first called off due to offside put the Group C runners-up in a hole within the first 20 minutes. A mere seconds after Guro Reiten's goal was questionably chalked off for offside, German Sjoeke Nusken gave CFCW a two-goal lead heading back to the dressing rooms.\nTwo of Hayes' second-half substitutes, Catarina Macario and Ashley Lawrence combined in the build-up of the third and final goal which was smashed home by Nusken just seven minutes prior to the 90' mark.\nThe back-four was once again immense, picking up a fourth clean sheet over the last five fixtures across all competitions. Seeing a zero next to the Ajax logo has been a rarity in this campaign. Tuesday was the time since November against Roma in the group stages that it failed to convert at least one opportunity in the final third in a competitive contest. It breaks Romée Leuchter's streak of nine goals in her previous six games.\nNo matter how dominant Chelsea was, there are still another 90 minutes left. The victor will face either FC Barcelona or SK Brann Kvinner in the semifinals. If Barca takes the cake in the other tie, Hayes will once again take on Jonatan Giráldez, two managers that are jetting across the pond to the United States upon the conclusion of the European club campaign. Let's run through last night first though. Here are our three standout players from the Blues' first-ever victory over the Dutch power.",
  "word_count": 433,
  "scraped_at": "2026-02-14T12:47:05.722221"
}