{
  "article_id": "d21d980c9c6b",
  "url": "https://www.pedestrian.tv/news/matildas-womens-asian-cup-ready-to-win/",
  "title": "Matildas Set Sights on Women Asian Cup And Are Ready To Win",
  "date": "20251217T103000Z",
  "domain": "pedestrian.tv",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "The AFC Women’s Asian Cup is shaping up as a pressure-cooker moment for women’s football. As the March kick-off creeps closer, it’s set to be a tournament where momentum and belief will matter as much as raw talent. Asia’s powerhouses will be circling and the spotlight will only intensify on the Matildas, making the margins and expectations feel tighter than ever.\nThis is a Cup that will demand edge and experience in equal measure, and the Matildas enter knowing every performance counts.\nWhen we sat down with forward Hayley Raso and midfielder Emily van Egmond during the Matildas’ last training camp ahead of the Cup, there was a palpable sense of focus driving the players towards the upcoming competition.\nIn It For The Long Game\n“It’s a major tournament on home soil for us, and I mean, the men obviously were at home when they won the Asia Cup. So for us, we want to try and replicate the same thing if we can,” van Egmond told PEDESTRIAN.TV.\nThe home-ground advantage isn’t something that’s lost on the players. Having the cup hosted in Australia adds extra excitement and the push to dig deep for the Nike athletes when times are tough. To be able to perform at home in front of what van Egmond says are the “best fans in the world” is an advantage no other team will have. However, this is a double-edged sword. Playing in front of your fans comes with the pressure to perform (read: win).\nRaso said that winning the Cup is something that’s lingering in the back of the players’ minds. “We’ve come very close a lot of times. So this tournament, I think it’s a goal and a desire for us that we want to do well and we want to win,” said Raso.\nSo how do they make this happen? By taking it one game at a time and asserting dominance from the second they step on the field.\nThe team is narrowing in on keeping their calm and staying focused on each game. Both players acknowledged they’d be lying if they said they weren’t thinking about later stages of the tournament, but stressed the importance of starting strong while still keeping the final in sight.\n“I don’t think you can really get too far ahead of yourself [but] the opening game for us is a really important game to stamp our authority to say like, ‘Hey, we’re really here and we’re serious’,” said van Egmond\nThere’s going to be some fierce competition in every match throughout the Cup. One team the Matildas are particularly keeping an eye on is Japan. Raso says Japan has always been a team they’ve watched closely, and the Cup next year will be no different.\nJapan is a huge powerhouse in the game and has demonstrated its mastery of football for years. The Matildas’ strategy going up against them is to focus on themselves, as van Egmond said, that’s really the only thing they can control.\nA multi-game tournament comes with its challenges. Players need to take it day by day, game by game. However, every moment counts. Players need to give their all every second to make it to the next round, but they also need to keep enough in the tank for the next game. Raso shared that this requires a level of mental focus to stay calm and roll through the challenges that comes with each game throughout a big tournament.\n“You kind of just have to keep all your energy and all your focus [and] calm on what you have in the moment to then be able to prepare yourself for what’s coming after that,” she said. It’s a skill she’s developed through years of playing, and she feels confident in her mindset going into the Asia Cup.\nA Close-Knit Team And The Future Of Women’s Sport\nFocus is strengthened by a tight-knit group of players. It helps the whole team come together as one united front. Many of the women have been playing together for years and see each other more than their own families.\nThis unity is visible to fans off the field, and both van Egmond and Raso say it creates a welcoming atmosphere when new players enter the fold. It can be a daunting experience coming into the squad, but Raso said the Matildas embrace new players with open arms.\nVan Egmond agrees saying, “We’re actually quite a really welcoming team. A lot of the girls who have come in have settled right away, and that’s awesome to see. I think that’s credit to the environment and the culture being really welcoming, especially for younger players.”\nThe Matildas’ sense of community is evident both on and off the field, from the way players work together seamlessly to score goals to the camaraderie shown in moments shared away from competition. That strong culture of connection and support has helped shape the team into influential role models for young Australians.\nThey offer a visible example of teamwork, inclusion and resilience in a sporting environment where the focus is often on individual success. The Matildas stand out for the way they prioritise collective effort and genuine connection within the team.\nBeing a good role model is something that’s “really important” to Raso.\n“The way we play, the things we do on the field, but also who we are as people off the field. You see these kids and how excited they are to meet us and tell us that they idolise us. It’s so special, it really is, and we can’t forget that we have so many people looking up to us,” she said.\nVan Egmond agrees with Raso, saying that a recurring message within the Matildas’ playing group is the importance of legacy and responsibility to those who follow. Lots of players entered the national team at a young age and benefited from the groundwork laid by earlier generations who helped leave the game in a strong position.\nThe current squad is dedicated to continuing that progress by ensuring the sport is left in an even better place than when they started. Van Egmond said now there are clearer pathways and greater opportunities for the next generation, and the whole Matildas team wants to inspire young girls to grow up dreaming be to a Matilda.\nThis is something they’ve definitely achieved, especially after the Matildas fever that was ignited during the last World Cup. That standout run didn’t just capture hearts but had a measurable effect on football nationwide. More than 21,000 additional women and girls took up football, raising total participation to over 158,000 players across Australia. A surge widely linked to the excitement generated by the Matildas’ success.\nThe team’s matches during the World Cup also set new broadcast records, with their semi-final against England drawing an average audience of 7.13 million and reaching a peak of 11.15 million viewers on Australian television. This was the largest television audience for any sporting event in the nation’s history.\nWomen’s football is in the best place it’s ever been and it’s only going to get better and bigger.\nWhen Raso started playing, she was the only girl in a team of all boys. Now, she says, you see teams full of girls because there are so many girls wanting to play football.\n“The pathway is now there, and I think we’ll see more of that, more girls playing, more young boys looking up to players like us, and just the pathway continuing to grow,” she said.\nVan Egmond believes the future for female athletes burns bright and the opportunities are endless. “I think we’ve seen how quickly the game’s changed in the last few years. Even more so probably off the back of the World Cup going into the Euros, [it] has been massive, especially for the countries that have been quite successful. I think women’s sport in general is just booming, and it’s going to completely take off, and I’m excited,” said van Egmond.\nSo, dust off your jersey and get those green and gold ribbons ready, because the 2026 Women’s Asian Cup is shaping up to be a big one. With the Matildas riding the wave of momentum that’s been building for years, the tournament feels like the next chapter in a run that’s already reshaped how the country shows up for women’s sport.\nExpect full stadiums, group chats buzzing on match nights and a new generation of fans locking in for what could be another defining moment for Australian football.",
  "word_count": 1423,
  "scraped_at": "2026-02-14T12:37:43.989964"
}