{
  "article_id": "d25c28416d90",
  "url": "https://www.foreignpolicyjournal.com/2015/09/25/terror-as-method-a-journalists-search-for-truth-in-rwanda/",
  "title": "Terror as Method : A Journalist Search for Truth in Rwanda",
  "date": "20240428T161500Z",
  "domain": "foreignpolicyjournal.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Intimidated for exposing the dark secrets of an African regime out of control, Canadian journalist Judi Rever drew the line at having the life of her own children threatened.\nNight was falling when Judi Rever got to her hotel in downtown Brussels in July 2014. In the dimming light, the Canadian journalist was able to make out two Mercedes—both black, one clearly armored—parked so close to the entrance that she pictured some celebrity holding court at the Novotel, and cursed her luck.\nBut the lobby was clear and there was no line at the reception. The reporter gave her name, handed her passport, and watched the receptionist rise slowly to his feet. “Welcome to the Novotel,” he said, “We’ve been waiting for you.”\nNext, Rever saw a man in a dark blue suit approach. Laying a faintly cologned hand on her shoulder, he whispered: “Judi Rever?” Stunned, the journalist nodded. “My name is Denis Ledure. I am the head of the Close Protection Services,” a branch of the Belgian Secret Service “I am here because we have reason to believe that the Rwandan Embassy in Brussels constitutes a threat to your security.”\nWhat followed was the confirmation of every scrap of journalism Rever ever put together on Rwanda, a speck of a country associated with brave recovery from genocide but, to the reporter’s expert reckoning, the single most sinister military dictatorship in Africa instead.\nWhispers of a Double Genocide\nRwanda was the reason Rever was in Brussels to begin with. Half a century after Belgium’s exit from the African colonial scene, Brussels was still a natural destination for Rwandans with money. Some of them were happy laying low in the suburbs, but others were sufficiently unhappy to stick their neck out and point Rever in the direction of a story or two. Nothing big: an inconvenient truth here, a blossoming scandal there. But as Rever’s reputation began to grow, the quality and the level of the information changed, and the reporter found herself tapping into a vein whose existence she had stumbled into years prior as a novice.\n“War crimes,” she says, “Horrible atrocities. Huge numbers of unarmed civilians killed,” by the very people credited with suffering the genocide of 1994 and putting an end to it before rolling up their sleeves and rebuilding the country from the ground up—all in a feat of self-abnegation comparable to the Jews putting Germany back together after the Holocaust.\nThat these people might be collecting public praise one minute and gunning down entire populations the next seemed implausible at first. The genocide had produced a set category of victims, the Tutsi ethnic minority, just as it had produced a set category of perpetrators, the Hutu ethnic majority. In a reversal of circumstance that had the world practically weeping with relief, the Tutsi were now in power, having just escaped mass murder, yet keen to move past it.\nBut everywhere Rever turned, she ran smack into a mirror reality, a shadow field in which the victims had killed just like the executioners. The Tutsi, it seemed, had dropped their fellow humans as fast as the Hutu, only at different times and in different places. It looked as if two types of killing had gone on at the same time: one in the public eye, the other away from it; the first recognized and reviled, the second unseen, unheard, untold.\nIn the first type—the type that got the Turnley brothers of Magnum repute scrambling to the same corner of the world—the Hutu had massacred the Tutsi in acts of collective folly so beyond the pale that western reporters stopped trying to make sense of them, conjuring ancient tribal hatreds instead.\nThe second type was different only in two respects: how organized it was, and how few people knew about it.\nRever was part of a virtual cabal, the vast majority of them scholars. As far as the general public was concerned, Rwanda was a success story, one well worth financing although the tab was far from cheap. At close to a billion dollars in aid a year, the central African nation was in a recipient class of its own, well ahead any other African country in terms of dollars per capita.\nOn the surface of it, the return on the investment had been solid. Rwanda had posted growth rates of seven percent. Literacy rated had soared, infant mortality rates had plummeted, and fertility rates had been cut in half. The government offered universal health coverage. Kigali, the capital, had acquired a distinctly un-African feel. With its perfectly manicured lawns, its noise-levels regulated by law, it could, pass for Geneva on a hot day.\nBut a growing number of scholars and of economists warned that beneath the facade, progress had been minimal, that some of the numbers did not add up, and that in the villages people were just as poor as before. Yet every year, as a sort of mea culpa for the genocide no one did a thing to stop, donors kept sending money with no strings attached.\nThis lack of accountability, says Rever, made Rwanda “one of the world’s most expensive mistakes.” Out of obstinacy, nerve, and the most admirable of all journalistic traits—inexhaustible moral indignation—she’d kept digging, and publishing.\nThe Rwandan Patriotic Front\nRwanda is exactly the size of Maryland, a microbe on the African map. Rever’s notions of it, when she acquired them, bypassed the place entirely. Unlike most high school kids, she had actually read Conrad’s Heart of Darkness. Later, out of curiosity, she’d looked Congo up on a map and she’d seen Rwanda pushed up against it like an insect to an elephant. She had seen that it produced coffee. And tea. Bananas, too.\nOver time, she picked up a couple of other significant facts. The country had one of the highest population densities in the world and poverty so extreme that only an act of God was judged capable—by common dictum—of lifting it. It had an eighty-five percent Hutu majority historically indentured to a fifteen percent Tutsi minority. The relationship had been reversed at independence, in 1962, when the Hutu exercised the right to vote for the first time.\nNumbers don’t lie: the day the polls closed, Rwanda became a Hutu nation. The bottommost Tutsi stayed put. Those that could, however, got out. The richest went to Belgium, France, francophone Canada; the rest settled directly across the border in Burundi, Tanzania, Congo and, most significantly, Uganda. A single generation later—in what remains the shortest incubation period of any armed repatriation effort—the sons of the Ugandan group showed up at the border with guns.\nAt the time of the genocide, the Rwandan Patriotic Front (RPF) had been in Rwanda for over three years. To the outside world, they were Tutsi, just like the bodies piling up in churches and schools were Tutsi. In reality, the two were like night and day. The former were rich, comparatively speaking; the latter poor. The former had degrees; the latter were illiterate. The former had come to Rwanda to fight; the latter just wanted to be left in peace. To the media, the RPF professed the desire to share power with the Hutu.\nIn private communications Rever was able to track, the group betrayed the determination to regain what the older generation had lost: power, at all costs.\nThe Assassination of President Habyarimana\nNot only had Rever never heard of the RPF when it invaded Rwanda in October of 1990, knifing a lone guardsman and gunning for the capital Kigali, she’d never met anyone who had. In that, she was like ninety nine percent of the world’s population. She remained blissfully unaware of the group’s existence for the next four years, a fact that allowed her to remain correspondingly clueless about their progress on the ground.\nLater she learned that in three-plus years of fighting, the RPF had cut off a major road to the capital, freed the inmates in the town of Ruhengeri, snuck up on the regular army from behind, occupied some territory and lost it, but that their real accomplishment had been to send an impressive bunch of fast-talkers to round after round of peace talks with the Hutu in Arusha, Tanzania.\nBy common, if reluctant, consensus, brain-power is not in short supply in the RPF. Professor Alan Kuperman of the University of Texas at Austin refers to the top echelon of the RPF as “the smartest bunch of people I have ever met.” No longer a fan of the group, whose leadership he interviewed at length in the immediate aftermath of the genocide, Kuperman cannot help concede that “they are smarter and more articulate than anyone in Washington.”\nWhen push came to shove, the RPF’s ability to talk itself out of a military impasse produced the most extraordinary of all results: a power-sharing agreement in which a group representative of a fifteen percent minority netted forty percent of all army posts. The agreement was signed to general applause in August of 1993, a UN force 2,500 strong dispatched to implement it.\nThen, on April 6, 1994, as Rever shared a meal with the man who would become her husband, the president of Rwanda was blown out of the sky by a surface-to-air missile that tore through the fuselage of his private jet as it came in for landing in Kigali.\nJuvenal Habyarimana wasn’t just the president: he was the physical embodiment of Hutu emancipation from Tutsi rule. Tall, broad, brash, he was the proud son of one of three ancient Hutu principalities that had held their own against the Tutsi. In the eyes of a nervous majority, he was the last effective barrier against the Tutsi menace. With him gone, every bit of propaganda served up by Hutu extremists bore its fruit. Barricades went up in Kigali within minutes of the plane crash. Hutu and Tutsi were carded and separated—the first to live, the second to die.\nA Journalist on the Trail\nRever was in Paris between jobs with the Canadian Broadcasting Corporation (CBC). Radio France Internationale was spitting out reports 24/7. “I was getting half the story but I did not know it,” she says. The other half took her another twenty years to nail.\nFirst, she says, she had to “wake up to the nature of the group” by witnessing scenes of extreme brutality in Rwandan occupied Zaire in 1997.\nNext, she had to suffer severe intimidation, like having her bedroom window strafed by gunfire after she filed a radio report accusing the RPF of straight-up butchery from Kisangani, a town in Zaire solidly under RPF control.\nFinally, she had to translate her understanding of what she calls “a bunch of criminals” into hard evidence of wrongdoing. She was at the Novotel in Brussels to do just that.\nEnter Kagame\nAs Rever herself admits, the numbers never interested her. Scholars like Kuperman have long insisted on an equivalency, suggesting that the half a million killed in the genocide of the Tutsi matches the half million Hutu murdered by the RPF in secrecy. But as soon as Rever heard the term “double-genocide”, she left the numbers to the academics and went after “eye-witness testimony, by which I mean people who were present and could describe who did what to whom and when.”\nHer sources never wavered on the subject. Without fail and without exception, they pointed to the same high-ranking, high-flying, stylishly attired, and, for the most part, strikingly good-looking members of the RPF, now in the government or the army. On paper, the two consortiums were separate. In reality, they converged as inexorably as the sides of a triangle.\nPerched at the very top of the pyramid was none other than the man that Tony Blair and Bill Clinton had tripped over themselves to introduce at black-tie events in Aspen and Davos: Paul Kagame, the skeletal army general whose metabolism was assumed to be formidable until his aides had to admit he had no taste for food.\nKagame’s alleged appearance at the site of one of the earliest massacres—a deliberate affair culminating in the strafing of a crowd in a stadium in Byumba, a town twenty miles north of Kigali—was the central piece of a puzzle Rever had been trying to solve for years. The reporter had six interviews lined up in Brussels the day she got there. One of them had to do with Byumba.\nThe Bodyguard\nByumba is a typical Rwandan town, consisting of a couple dozen shops built out of cold concrete on either side of the road snaking north from Kigali. All around it, though, is what the Rwandans call ‘the beloved land’: a vision of endlessly receding hills, of blazing greens and reds, of morning mist so thick it snakes up the tallest trees, festooning God’s own sleeping quarters, or so the saying goes. At any elevation, the sight is heart-stopping.\nIn Byumba, by contrast, beauty is very much in the eye of the beholder. The road—paved and passable—is the town’s main distinguishing feature, along with a wheat processing plant and a stadium, a sad-looking enclosure the length of a single soccer field.\nIn the stadium, on the night between the 24th and the 25th of April 1994, the RPF staged its first large-scale massacre. By the estimate of Human Rights Watch, which published the first mention of it in 1999, it was a large operation, one targeting “several hundred” Hutu.\nThe numbers have since been revised by a factor of ten. A commonly accepted estimate is now in the range of several thousand Hutu, all of whom were supposed to be dead by sunrise.\nVery unusually for a piece of machinery as slick as the RPF, Rever learned, something went wrong. Almost certainly there weren’t enough people for the job. Whatever the reason, enough Hutu were still alive by sunrise for the operation to risk slipping into chaos.\nFear ran like raw voltage up the command chain. On that occasion, and on that occasion alone, it took nothing short of an unscheduled appearance by Kagame to get things back on track.\nRever knew that Kagame’s policy vis-à-vis the massacres typically involved “driving to the other side of the country”. She knew that no other mass killing had seen the shadow of the man. This made Byumba “the only mass murder traceable to him”, she says. “For two reasons: first, because he was seen outside the stadium the day after the massacre by anywhere between fifty to sixty of his men”; and, second, because when some survivors were found attempting an improbable escape on all fours, his bodyguards heard him say, “Finish them off. And clean this up.”\nRever had this particular piece of information from one of Kagame’s bodyguards, a man who had reinvented himself radically and now lived a quiet life in North America. He’d been with Kagame during the RPF’s initial takeover of Byumba. He’d also been at the boss’s side on the night of the massacre, so he didn’t have much useful information to relay in terms of who organized what or when. The bodyguard did say that the private homes closest to the stadium had been taken over by teams of eight men each assigned on rotation to the massacre. But, he said, he was personally not involved, having been stationed with the other bodyguards—and of course Kagame himself—in a home about two miles away.\nAs the bodyguard told it, one of the men on his detail had a reputation as a good football player. “Don’t worry,” Kagame assured the player upon arrival, “There will be a lot more room to play football when we’re done here.”\nRever needed more—hence her trip to Brussels.\nThe Diplomat\nRever did not know it but her travel plans, when she made them, weren’t exactly top secret. Her itinerary had been discussed in conversations to and from the Rwandan embassy in Brussels while Belgian intelligence was listening. But according to one of Rever’s sources, Belgian intelligence took no action until a very specific exchange involving a former Rwandan diplomat was intercepted.\nThe diplomat, Didier Rutembesa, had been kicked out of South Africa in the wake of the sensational murder of Patrick Karegeya, a Rwandan spymaster turned opposition leader, in January of 2014. After finding Karegeya’s body in a Johannesburg hotel, the South African government gave Rutembesa forty-eight hours to leave the country. Shortly thereafter, the Belgian foreign ministry denied him diplomatic accreditation.\nThen, one day, according to a high-profile Rwandan dissident monitored by Belgian intelligence whom Rever spoke with, Rutembesa was overheard telling a Rwandan operative in Belgium that he could be counted on to “lay a trap” for Rever upon her arrival in Brussels.\nUnable to denounce the man’s intentions publicly or even privately, the Belgians put Ledure on the case. (A spokesman for Belgium’s civil intelligence and security service, the VSSE [Veligheid van de staat], stated that the department was not in a position to comment and could “neither confirm nor deny” that Rever had been placed under protection.)\nThe Security Contract\nThe threat level to Rever had been rated “severe”—a level 3 of a possible 4. “This is all I am allowed to share with you,” Ledure told Rever before plucking a contract out of thin air and laying it out on the coffee table for her to sign.\nFighting the urge to call her husband with a hysterical plea to locate their two girls, ages 12 and 7, Rever picked up the piece of paper and read it. In two paragraphs flat, the Kingdom of Belgium placed an armored vehicle and the same bodyguard assigned to Salman Rushdie at her disposal for the entire duration of her stay. The bodyguard would precede Rever everywhere she went. He would also spend the night in the room next door, ready to jump at the slightest noise. If Rever chose to reject the terms of the contract to protect the anonymity of her sources, the Kingdom of Belgium would understand. It would let her carry on with her work while finding itself “absolved of all legal responsibilities”.\nLedure, a man with a full head of white hair and “unusually empathetic eyes”, says Rever, stood up to stretch his legs. Watching him cross the lobby of the hotel, the reporter was overcome by two distinct emotions: fear, principally, but also guilt on a level she had never experienced before.\n“It was my husband,” she says.\nA scientist naturally inclined to caution, Rever’s spouse had endured years of quixotic pursuits on the part of his wife. He had watched her return from the newly renamed Democratic Republic of Congo at the beginning of their marriage with raging post-traumatic stress disorder (PTSD). Two children and countless memories later, he had come home to find her putting the finishing touches on a story in which she accused none other than Patrick Nyamvumba, a Rwandan general at the head of the United Nation’s force in Darfur, of murdering thousands of Hutu civilians in the shadow of the genocide.\nFive days later, he’d found himself shopping around for a state of the art alarm system. Someone had called the home phone and left a message simulating gunfire. In between rounds, the voice of a stranger asked: “Do you want to know my name? I’ll tell you my name….”\nIt was the name of their youngest daughter.\nTo Brussels\nThe Montreal police officer who responded to Rever’s panicked call that night had never heard of Rwanda either, other than in hazy connection to the genocide. “She kept asking me which Rwandan made the call,” says Rever, “I kept telling her I did not know.”\nIt was only a matter of time before the Canadian Security Intelligence Service, which offered no comment on this story, got involved. According to Rever, a federal member of parliament weighed in, too, and the municipal police took on periodic patrol duty around Rever’s house. New routines were put in place for both girls, with Rever’s youngest smuggled in and out of separate entrances at school.\nEventually things settled down. No more calls were received, no more messages left. Spring turned to summer and the tension in the household began to lift. Then, out of the blue, Rever announced she was headed to Brussels. Her piece on Nyamvumba had had a measurable effect. All sorts of people were paying attention now. None of them had any intention of talking on the phone but some considered meeting with her in person in Brussels.\nOne of them claimed to be a former member of the RPF’s High Command battalion.\nHigh Command defectors were like great white sharks, you simply didn’t run into them. They were either six feet under or long gone. But Rever had been told about his older sister, Esperance Mukashema, a polyglot who had fled Rwanda after denouncing the murder of the archbishop of Kigali by RPF troops and now lived in the Netherlands. Rever had heard of the family, too. They were well-connected Tutsi urbanites that had prospered under Habyarimana despite their ethnicity. They owned a football club in Kigali. The youngest of the bunch, Theo, had made the national team. He had been expected to go to university but he had broken his father’s heart and joined the RPF when they’d first crossed the border from Uganda. He’d fought at Kagame’s side for over a decade, stationed first in Mulindi, the abandoned tea planation that served as the RPF’s headquarters, then just about everywhere else. He’d fled Rwanda in 2001, after being called into Jack Nziza’s office.\nNziza was the most feared man in Rwanda by then, cause for greater alarm than Kagame himself. Just as skeletal, just as ashen, with a lazy eye and a propensity toward long, debilitating silences, Nziza had been in charge of internal security from the very beginning and had survived purge after purge only by doing the purging himself. At the end of what seemed a casual conversation but wasn’t, Theo realized he was being shadowed.\nHe had voiced quite a few doubts by then. “Interior Tutsi” such as himself, while absolutely critical when the RPF was militarily outnumbered, were being marginalized with increasing nonchalance. As he told Rever, “when all was said and done, I stood face to face with the fact that we had been sacrificed as a group,” not only in the genocide, whose victims were for the most part “interior Tutsi” who had never left Rwanda, but in every political and administrative decision made since.\nThe country belonged to a very specific sub-category of Tutsi: anglophones from Uganda at the top, anglophones returned from Canada or the United States just below that. Francophones returned from Burundi were slowly making their way up largely thanks to Kagame’s wife, Jeanette, who was born and raised in Burundi. The rest were little more than a nuisance.\nHaving witnessed no less than a dozen disappearances in his time, Theo had made a few quick arrangements for his family and gotten out through Burundi. He now lived in Spain, but he would make the effort to meet with Rever in Brussels.\nWith her husband pacing nervously behind her, she had packed her bags. Now, here she was, in Brussels, staring at the guy the Belgians called when Salman Rushdie came to town. With a sigh, she signed the contract and gave it to Ledure. The following morning, when her husband rang, Rever gave new meaning to the word “omission”.\nTheo\nTheo Murwanashyaka was strangely fluid in body when Rever met him, curiously comfortable in a plain white T-shirt, worn jeans and white baseball cap. She’d forgotten that he’d been a professional football player. She’d also forgotten that he had been in Europe for over half a decade. They met at a hotel and he laid out his credentials for her.\nHe had provided testimony for Jean Louis Bruguiere, the French special prosecutor who indicted Kagame for the downing of Habyarimana’s plane. “When Kagame took the decision to kill Habyarimana,” he told Rever, “he made the decision to sacrifice our parents, our brothers and sisters.”\nThe mystery of Habyarimana’s assassination has never been solved, but scholars like Filip Reyntjens, the leading authority on modern Rwanda, believe the blame lies with the RPF, which profited from the chaos unleashed by the genocide and captured Kigali.\nTheo also provided testimony against the RPF at the International Criminal Tribunal for Rwanda (ICTR). Soon thereafter, he had been contacted by magistrates in Spain and placed under witness protection there.\nSpain is an improbable thorn in Kagame’s side. The French have a long history of involvement in Rwanda but the only thing Spain can claim in relation to the small central African country are nine dead Spaniards—one killed during the genocide, the rest after. But Spain is a big fan of the principle of universal jurisdiction, which gives any country the right to pursue any person suspected of a crime against humanity. Some of the dead Spaniards bore signs of torture so the State launched an inquiry.\nAt the start of 2008, after years of work and volumes of eyewitness testimony, judge Fernando Andreu Merelles fired off forty international arrest warrants—spraying the entire upper cadre of the RPF in one sitting. Nothing came out of it, except the relocation of some pretty big guns by Rwandan standards to the sunny side of the Alps. Armed with information, they hoped to receive state protection. One of them was Theo, who had since taken up residence in Barcelona.\n“So,” Rever asked him, “Can you talk about Byumba?” At his assent, Rever placed her digital recorder on the table.\n“When were you in Byumba town?” she asked, and hit record.\nThe MP\nRever’s husband wasn’t at the airport when she flew back. He wasn’t at home either. She’d finally told him about Ledure and he had reacted by prophesying “a pine box” in her future. The trip to Belgium had been, in Rever’s own words “a trip,” with the security circus making some of her sources paranoid, making her paranoid, even though, as her bodyguard put it, she had reason to be paranoid. “Believe me,” he’d said while holding the door for her one day, “This stuff costs money.”\nBut it had paid off largely thanks to Theo. Now she needed another trip, this one to Spain, to another Rwandan in the witness protection program: a former member of the Military Police (MP). A lawyer with ties to US, Canadian, and Belgian intelligence communities had warned her that Kagame was aware of her trip to Spain. “Be careful,” he’d said in a Skype message, “Stay away from Europe. And if you go to Africa, you’re dead.” Instead of triggering the usual wave of panic, the message brought on the first surge of true defiance Rever had ever experienced.\n“I thought: what can happen to me in Spain? What can possibly happen to me in Spain?”\nTwo days spent listening how men, women and children had been blasted and bludgeoned to death took care of that question. At the end of a marathon session, Rever felt sick to her stomach, sick to where, she says, she started “seeing double”.\nYes, the former MP said, Kagame was in Byumba; his presidential guard was everywhere. And yes, some survivors had in fact crawled over of the fence. How many, asked Rever? “About twenty,” her source said.\nWhich accorded with what she’d gotten from Theo in Brussels.\nThe Byumba Massacre\nIt was coming together. The details Rever had extracted from three different sources, two with the High Command battalion, one with the Military Police, matched. The story they told was one of fundamental cool in which the complexities of mass-murder—from crowd control to body disposal—were ironed out as they arose, with nobody losing sight of the final objective: ethnic cleansing at its least complicated.\nHistorians like Reyntjens point out that in the face of unrelenting hostility, mass-murder became a “mode of governance” for the RPF: a way to make things clear from the very start. “The RPF killed to terrorize,” says Reyntjens. “And they succeeded.”\nBut Rwanda was severely overpopulated, too, and there were, at that point in time, an awful lot of Tutsi living like second class citizens in neighboring countries—a lot of nieces and nephews and cousins and uncles, all waiting to come back. The concept of lebensraum, or living space, developed more as an abstraction by the Nazis, held no nebulous theoretical allure for the RPF. Lebensraum came before food as a necessity, for the simple reason that, in Rwanda, no land equals no food.\nAfter moving some of its most trusted people into the largest and finest homes in Byumba, recently become Command HQ, the RPF turned them into sleeping and feeding quarters for two platoons subdivided into teams of eight men each. The men weren’t necessarily pals but they’d seen each other around. Most of them were anglophones raised in Uganda. All, without exception, were Tutsi without a drop of Hutu blood.\nThe first thing they did was leave the Hutu who had gathered in Byumba without food or water for three days. The Hutu, roughly three thousand in number, were barely able to stand by that point. Most of them were refugees, some twice or three times displaced already. They’d surrounded the town hall and were waiting for someone to tell them what to do. Theo called them vas nu pieds, piss-poor peasants who couldn’t afford shoes. He described them as a meek multitude “who would have obeyed anyone in a position of administrative power,” never mind people with guns.\n“I thought for sure we were going to let them go,” said Theo, who was stationed outside the stadium.\nInstead, he watched them file into the stadium, picking up assorted pots and pans on the way in. He watched the smoke from cooking fires and imagined them passing maize and water around, their jaws relaxing—hope rippling like an undercurrent from one end to the other of the stadium. Then he watched Col. James Kabarebe, head of the RPF’s High Command, come and go. At around seven in the evening, when it got pitch black, he saw dozens of men fan out soundlessly and he heard the first grenade explode. More grenades followed. Then volley after volley of gunfire let loose almost blindly into the night.\nThe Cleanup\nThe cleanup crews set to work at sunrise. It was hell on earth, said Rever’s Military Police source, who had been inside the stadium. Not only did soldiers from the Military Police take turns with the agafuni, a blunt hoe, and other mixed weaponry until everyone was dead—that alone took an entire night—they also had to load the corpses, so slick with blood they were hard to get a hold of, onto trucks. After unloading them all, they had to get a hold of more hoes and start digging in two different locations: the wheat processing plant in Byumba and the outskirts of Rukomo, a town about an hour and a half east, which for reasons known only the top had been selected for the purpose of mass burial.\nBut that wasn’t all.\n“A week later, Kagame called and said we’d been stupid to bury the bodies,” Rever’s source said, “He said the French had satellites and they would spot the graves. They gave us masks and gloves. They ordered us to dig up the bodies. The bodies were decomposing, we were all vomiting. It was really very difficult. A lot of us had nightmares after that.”\nThe trucks came once more. The bodies were loaded in various pieces and driven further east to the Akagera National Park, where they were incinerated with a mix of petrol and gas oil.\nThe Disappeared\nWhile Rever was making copies of her interviews, Kagame was stepping onto a floodlit stage in D.C. to warm applause. President Barack Obama had personally welcomed him to the White House on the eve of the African Leaders Summit, a three day affair meant to achieve, in the immortal words of the White House’s press office, “stronger ties between the United States and Africa.”\nTo a primped and largely bespectacled audience, Kagame outlined his country’s projected quantum leap from pre-industrial society to post-industrial technology hub, stating, roughly halfway through one of his speeches, that African leaders had to stop being so dependent on the West, and not just for money, but on how to approach divisionism. “We know what the issues are,” he said, “We must solve them without coming to Europe or America”.\nHow, he did not specify. But as the Rwandan opposition was quick to point out, it seemed hardly a coincidence when, roughly a week later, fishermen on the Burundi side of Lake Rweru started pulling up dead bodies—half of them wrapped in plastic, the other half displaying the RPF’s signature ligature at the elbows.\nThe incident would have stayed local had not more bodies washed up—twenty, thirty, forty of them, until the local prosecutor was left with no choice but to open a file. Tongues started wagging and it wasn’t long before the matter blew up in the press. Surprisingly, the Burundians came right out and said the bodies were Rwandan. The Rwandans reacted by saying they had no reports of missing persons. But “relations between our countries”, they added, would be better served in the future by Burundi using “proper diplomatic channels” instead of going to the press.\n“Those bodies are probably Rwandan,” Reyntjens says, echoing a common sentiment, “The Rwandan government has not allowed a proper inquiry, but it should be possible to match the DNA of the bodies with that of family members of those that went missing back in April last year” as mentioned in a Human Rights Watch report.\nThe Professor\nRever and her husband were discussing divorce by then. Rever had developed an autoimmune disorder for which she needed weekly injections of methotrexate, but she kept taking calls on Skype from her sources at the worst times, exasperating her husband, so they agreed on a trial separation. The reporter moved out of the large, well-appointed home the two bought together into a building with a 24-hour doorman.\nFeeling low one day, she picked up the phone and called a professor at Colgate University in upstate New York.\nSusan Thomson, a native of Nova Scotia, knew Rwanda like the back of her hand. She held the rare distinction of having been in Kigali the day the genocide began. She’d been promptly evacuated but on her way out she’d stepped over the bodies of two Tutsi UN employees. She’d returned—“a moth to flame”, she admits—to help rebuild Rwanda’s justice system, whose capacity had been completely obliterated by the genocide, and consisted, when she landed in the capital in September of 1997, of little more than couple copy machines and a pencil sharpener or two.\nThere were no judges in Rwanda when she arrived; they were all dead. No judges, no prosecutors, no defense attorneys. No court staff either. There were 120,000 Hutu taking turns sleeping and standing in jails meant for one tenth that number and no way of thinning out the crowds aside from the mother of all amnesties, which wasn’t in the cards.\nWorking with aspiring lawyers drove Thomson over the edge in record time. Not only did she have to favor Tutsi candidates but “the regime controlled everything,” she says. “People were scared shitless: half the conversations were in code, the other half didn’t take place at all.” So she left, got some psychiatric help, and decided that if Rwanda and the improbable paradox “of the victims being, in fact, the killers” was going to qualify as a lifelong obsession, she probably ought to get paid for it. When she disembarked in Kigali in 2003, it was to gather evidence for her PhD dissertation, whose unstated objective was finding out how ordinary Hutu, trapped in the Matrix-like reality of modern Rwanda, whispered their “truth to power”.\nShe ended up under house arrest, with her passport confiscated and half her files feeding a fire at the bottom of her garden. “I stood there thinking, damn, I wish I had a better memory,” but in the end, she says, by keeping only material that she had codified already, she probably spared her sources a visit from the agafuni specialists. She herself had to sit through a “re-education course” with hundreds of genocide convicts still in their prison wear and only managed to get out of the country thanks to the Canadian High Commission, which slipped her a new passport. Back in Nova Scotia, she won her degree from Dalhousie and published her work with the prestigious University of Wisconsin Press, triggering an avalanche of hate mail and a number of not-so-veiled death threats.\nOne day during a teaching fellowship at Hampshire College in Massachusetts, her eight-year-old son came home with a note in his lunchbox. The school secretary, Thomson says, put it in there at the request of a “tall, dark-skinned man with a foreign accent”.\n“We know who you are,” the note said, “We know where you are.”\n“TOP SECRET”\nRever and Thomson bonded as only two mothers whose children have been messed with could. In the process, however, Rever discovered that Thomson was angry. Thomson’s computer—all her devices in fact—had seen enough “suspicious activity”, or evidence of hacking, for the IT department at Colgate to involve the FBI. She’d also been maligned by what she calls the “super-savvy Rwandan PR machinery”, one able to put a tawdry spin on the simplest transparencies, like one and one is two. She had come out swinging, generating huge internet traffic to a blistering roundtable she convened on the twentieth anniversary of the genocide in Colgate’s largest auditorium, but also routinely calling on scholars to be “a little louder” in their criticism of the RPF.\nBuoyed, Rever began working the phones again. After more than a year, she got in touch with an old source with the International Criminal Tribunal for Rwanda (ICTR).\nA bureaucratic mastodon with the efficiency of a Caribbean post office, the ICTR had witnessed the tormented life of a special investigative unit, a three-man-team that labored thanklessly to indict the RPF of at least a fraction of the crimes it had committed. Absent the political will to prosecute, however, the team eventually disbanded: but not before it put together several confidential reports. Like many other journalists, Rever had tried to get her hands on them, with little success.\nThis time was no different. Her source asked her how she was, how her children were, what she planned to do about her marriage. He was about to hang up when she told him about the bodyguards in Brussels, the simulated gunfire on her home answering machine, her autoimmune disorder, which a health professional had linked to stress, and the sickening sense that all of it had been for nothing. He didn’t say much. The following day Rever received an email from an email account set up under the fictitious name of Clarice Habimana. She clicked on the message, half expecting a request for cash, and out came the Tribunal’s report.\nHeadlined “TOP SECRET”, the document by the special investigative unit put meat on the bones of the infamous “Gersony report”, whose findings were suppressed as soon as they were put together in mid-October of 1994. The report assembled by American consultant Robert Gersony documented systematic killing by the RPF for the United Nations High Commission for Refugees and made the case that the repatriation of Hutu refugees ought to, at a minimum, be delayed.\nHer head pulsing, Rever scrolled down the document until she found was she was looking for. “Byumba stadium,” the report stated, “has been identified as a massacre site,” during a nighttime operation under the command of James Kabarebe, the current Minister of Defense and the former head of the RPF’s High Command.\nFurther on, the report identified an authorization order to start killing Hutus as having come from General Kagame.\n***\nI met Judi Rever in Vermont in October of last year, before her source at the ICTR sent her the report, and before Theo Murwanashyaka agreed to go on the record for this piece. Rever has since received what she believes are credible reports that the RPF intends to silence its critics in North America by staging traffic accidents—a method successfully employed in Africa—with the help of a former official at the Rwandan embassy in Ottawa. She and four other Canadians have gone to the press in an attempt to generate public awareness of their plight.\nRelated Article: Rwandan Generals Accused of War Crimes in UN Employ",
  "word_count": 6789,
  "scraped_at": "2026-02-14T12:08:56.866760"
}