{
  "article_id": "d26d5fd68dc4",
  "url": "https://theathletic.com/5405543/2024/04/11/rachel-daly-england-retirement-wiegman/",
  "title": "Rachel Daly England retirement raises difficult questions for Sarina Wiegman",
  "date": "20240411T044500Z",
  "domain": "theathletic.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "There will inevitably, and rightly, be an enormous level of affection for Rachel Daly after the shock news of her retirement from international football, which came merely 12 hours after appearing for England as a substitute against the Republic of Ireland on Tuesday.\nBut beyond the recognition for this unique footballer — full-back, wing-back, wide midfielder, winger and Women’s Super League Golden Boot winner when actually used in her best position as a striker — there are a couple of pertinent questions. Why has Daly made this decision? And what does it say about Sarina Wiegman’s England? Daly’s retirement message gave little away. But it seems clear this is a footballer who felt overlooked.\nDon’t cry because it’s over, smile because it happened 🏴❤️ pic.twitter.com/Rawl2Ohrkl\n— Rachel Daly (@RachelDaly3) April 10, 2024\nIn the aftermath of Euro 2022 it seemed clear Alessia Russo would become England’s first-choice centre-forward. Ellen White’s retirement meant there was a vacancy up front. Russo had been introduced as a substitute in all six games at the Euros, scoring four times — including the famous backheel against Sweden in a 4-0 semi-final victory. At 23, Russo was set to explode into a consistent world-class striker.\nAdvertisement\nThat, so far, has not quite happened. Russo scored nine WSL goals for Manchester United the season before Euro 2022, and improved only slightly to 10 in 2022-23. She moved to Arsenal last summer, but has only managed six this time around. Russo’s all-round game has improved, but her goalscoring return remains modest.\nThe goalscoring explosion has instead come from Daly. Her situation was always somewhat peculiar; primarily a full-back for England, but a centre-forward in the NWSL for Houston Dash, and in a brief loan spell for West Ham United during the behind-closed-doors 2020-21 campaign. But her move to Aston Villa, a week after the Euro 2022 success, meant her penalty-box threat could no longer be ignored by Wiegman. She won the Golden Boot, with 22 goals in 22 WSL games, which must have come as a surprise even to her considering she did not manage more than 10 in a season during her seven years in the NWSL.\nThat form was rightly rewarded with an opportunity up front for England. Against Italy in the second of their three Arnold Clark Cup games last February, Daly started as England’s No 9 for the first time, and in a 2-1 victory scored two classic centre-forward’s headers. Russo started the other two matches, against South Korea and Belgium, managing a single goal. There was, therefore, a genuine debate about England’s best option up front: Russo or Daly.\nBut Daly has not received many more chances. She was a substitute in the penalty-shootout victory in the Finalissima against Brazil this time last year, and also the 2-0 home defeat by Australia, where she partnered Russo in the final half hour, playing just off her. She did start up front in a goalless draw with Portugal shortly before the World Cup, but was substituted at half-time and dropped for Russo for England’s opening 1-0 win over Haiti.\nAdvertisement\nFrom then, Daly returned to the side as a left-back and left wing-back, starting the next six matches, including the final. When England were 1-0 down at half-time to Spain, Wiegman surprisingly took off both Russo and Daly, who might have fancied her chances of being switched up front. No — that was her tournament over, and Wiegman ended up turning to third-choice Bethany England and regular plan B Millie Bright.\nSince then, Russo has generally led the line. Even when Wiegman has left the Arsenal forward out, she has favoured a rotating trio with Lauren Hemp usually deployed through the middle rather than in her usual position on the wing.\nThis week, it seems, was the final straw for Daly. She was not used at all in the 1-1 draw against Sweden. Russo started up front, headed in the opener, and when substituted 10 minutes from time, winger Chloe Kelly came on, and Hemp moved up front. For the trip to the Republic of Ireland, with Wiegman making five changes, Daly might have expected a rare start. No — she got only four minutes to impress.\nGO DEEPER\nBronze seems undroppable for England - but should she be?\nAll of which has prompted the early retirement of a striker who has outscored Russo 29-16 in the WSL since Euro 2022. Most would agree Russo’s all-round game is superior, particularly in terms of bringing others into play, and it is reasonable that Wiegman considers her a better option.\nBut you can understand the frustration from Daly’s perspective: getting a chance up front, taking it with two great headers against Italy, and then only being sporadically used in that role. To Daly’s great credit, she has never complained about being used at left-back, but now finds herself behind Niamh Charles in the pecking order. Alex Greenwood and Jess Carter might also be preferred in that role when Bright and Leah Williamson are available for selection together in the middle, for the first time in over a year.\nAdvertisement\nDaly’s retirement is a huge personal decision. She is only 32, and surely has another few years left in her. She would surely have travelled to Euro 2025 next summer. With respect to Aston Villa, she does not play for one of the WSL’s title contenders, so international football was her best chance of winning another major trophy. It must also be acknowledged that a player’s commercial opportunities are much greater when they are involved with England, whose popularity remains absolutely huge despite a slightly disappointing recent run of form.\nFor England, this is a significant blow. Russo was the only other proper centre-forward in this week’s squad selection. Her form is inconsistent, and if she goes down injured then Wiegman will probably be counting on Tottenham striker England — in and out of the squad over the past couple of years. Ebony Salmon has also been involved, but is ultimately Daly’s back-up at Villa. Nikita Parris, who was part of the Euro 2022 squad and has scored eight WSL goals this season, is another option. Chelsea’s Aggie Beever-Jones is promising, but a different type of attacker and has only nine WSL starts to her name. Hemp still seems at home on the wing. None of these players compare to the player who is — for a couple of months — still the WSL’s current Golden Boot holder.\nAll of which leaves us to conclude that Wiegman, seemingly so adept at keeping non-playing squad members happy, has played this situation badly and perhaps taken Daly for granted.\nThere are some who insist playing for your country is a privilege that should never be refused, but 32-year-olds don’t want to spend their time constantly getting call-ups, travelling around Europe, giving 100 per cent in training and then not getting a chance, especially when the alternative is conditioning your body properly for upcoming WSL tests. Wiegman’s coaching of England has been outstanding for the most part, but Daly’s retirement, for the first time, will lead to questions about her managerial acumen.\n(Top photo: Naomi Baker — The FA via Getty Images)",
  "word_count": 1201,
  "scraped_at": "2026-02-14T12:22:38.091995"
}