{
  "article_id": "d271da8a4ae1",
  "url": "https://www.bendigoadvertiser.com.au/story/8762401/golden-city-women-eye-remarkable-super-cup-final-turnaround/",
  "title": "Golden City women eye remarkable Super Cup final turnaround | Bendigo Advertiser",
  "date": "20240913T044500Z",
  "domain": "bendigoadvertiser.com.au",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Should Golden City win Sunday's League Two Women's Super Cup final it would complete one of the most remarkable turnarounds in Bendigo Amateur Soccer League history.\nSubscribe now for unlimited access.\nor signup to continue reading\nBetween July 7, 2021, and April 20, 2024, Golden City's women's team didn't win a game.\nIn the 2023 championship season, the Rams were winless, only scored two goals and conceded 122 goals. To say they were battlers would be an understatement.\nHow does a team concede 122 goals one year and qualify for the grand final the next season?\nAppointing an experienced coach would be the first move, right? Wrong.\nJohn Dean has never played a game of soccer in his life.\nHis only coaching experience before taking on a Golden City junior side two years ago was coaching his daughter's under-12 netball team.\nAfter guiding the Golden City under-16 girls to title success last year, Dean was given the task of coaching the senior women's squad in 2024.\n\"We lost our first two games quite badly, 7-1 and 7-2, and I thought I might have been in the gun,'' Dean said with a chuckle this week.\n\"We got on a bit of a roll and won a few games and then the turning point came in a game up at Moama.\n\"We only had eight or nine players and that's when we called on four under-14s to fill in. We rolled Border Raiders on their home deck and those under-14s have been in the side ever since.\n\"At the start of the year there's no way we thought we'd be in this position.\"\nIronically, Golden City's opponent on Sunday is Moama-based Border Raiders - the team which finished on top of the ladder and earned promotion to League One next year.\nWhile it's the biggest game of the season, Dean hasn't changed his approach.\n\"Tactics are not my strong point, so it's all about keeping the girls happy,'' Dean said.\n\"I just try to make sure they're enjoying what they're doing. If they're not enjoying it, they're not going to respond to what we're trying to do.\n\"If anyone watched our training they would go 'how the hell are these girls so good?'.\n\"It's the most unorganised set-up you've ever seen, but I let the girls be themselves. They can say what they want to say to me as long as they understand what we're trying to do on the day. It works for us.\"\nIt's a big weekend for Golden City's female football program.\n\"The under-16 girls have made the grand final and the under-12B girls are in the grand final as well,'' Dean said.\n\"It's great for the club. We have a lot of girls teams and the club is heading in the right direction.\"\nTwo of Golden City's key players on Sunday will be Dean's daughters - Maddi, 16, and Mia, 14.\n\"I'd never been involved in soccer and now I love it,'' Dean said.\n\"The best part is coaching my daughters. Driving to and from games and training and getting that chance to spend some time together, I love it.\n\"Don't worry, they give me some honest feedback about my coaching.\"\nThe Golden City versus Border Raiders clash kicks-off Super Cup Sunday festivities from 9.30am at Club Court in Strathfieldsaye.",
  "word_count": 552,
  "scraped_at": "2026-02-14T12:42:05.367004"
}