{
  "article_id": "d27ef7c81fd5",
  "url": "https://www.liverpoolfc.com/news/gareth-taylors-first-interview-im-really-proud-be-here-our-ambition-high",
  "title": "Gareth Taylor first interview :  Im really proud to be here - our ambition is high  ",
  "date": "20250808T134500Z",
  "domain": "liverpoolfc.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Q&AGareth Taylor's first interview: 'I'm really proud to be here - our ambition is high'\nA 'really proud' Gareth Taylor outlined his plans to take Liverpool FC Women forward during his first interview as head coach.\nThe Reds announced the appointment of the experienced 52-year-old today, representing his first role since a successful reign at Manchester City came to an end in March.\nTaylor led City to triumphs in the Women's FA Cup and League Cup, along with a pair of runner-up finishes in the Barclays Women's Super League.\nHaving met his new squad and taken charge of a session at the AXA Melwood Training Centre, Liverpoolfc.com sat down with the boss to discuss his arrival and the future. Read on for a full transcript of the chat…\nGareth, a very warm welcome to Liverpool Football Club. How much of an honour is it to be here?\nIt's a massive honour. When I heard there was interest from Liverpool and seeing what a juggernaut of a club it is, it's fantastic to actually be here. Back at Melwood, I visited here a long time ago as a young player. I'm just really proud to be here at the club. Like I said, a fantastic club which is steeped in tradition. There's a real good connection with the supporters – I think it's unparalleled.\nWhy Liverpool then? Why was this the right move for you to get back into football?\nWell, because of that, because it's more than a club. I think when Liverpool come calling, it's really hard to resist. I've been a massive admirer of what they've done in the men's game but also the women's game as well – I think there's a lot of history there. Going back to what I said previously, that connection with supporters, I think, is unparalleled and there's probably only a few other clubs around the world that have that same kind of connection. That was one real big reason – the fact that it's Liverpool.\nThe other one for me would be Andy [O'Boyle, managing director] in terms of the move he made for me and the way he made me feel wanted, in the sense of [being] interested to do something a little bit different and really clear on how I want to do things. We had some really good conversations and I think his experience is quite rare in the women's game. He's had a lot of varied experiences, he's straight-talking, he's very honest, he's very clear and there's good collaboration with everyone here at Fenway Sports Group. The people there are fantastic and made everything really, really smooth in that sense.\nThe final bit would probably be that opportunity to move this thing forward. I think that there's some really good early gains that can be made. Of course it's going to take a little bit of time, there's going to be some bumps in the road along the way, of course there are, but our ambition is high and we know that it takes time to do that in any league but particularly this one. That's the exciting part. It was that real growth opportunity, I think, to come in and help what we already have.\nWhat about these fantastic facilities here at the AXA Melwood Training Centre – was that also a big factor that attracted you here?\nYeah. I was really lucky that we came here last pre-season for a friendly and got to really see it. And again, I mentioned previously that I'd been to Melwood but it was many, many years ago when the men's first team were here. What a facility this is to have for us to be the best version of ourselves. Everyone who works here is for the women's team and I think that's really, really rare in the women's game because everybody's trying to improve, everyone's trying to get better. What we have here is a fantastic foundation for us to operate in and try to earn those gains that we'll look to do.\nYou did a fantastic job during your time with Manchester City and you certainly know Gemma Bonner well from your time there. She has signed a new contract and it must be great to meet up with Gemma again...\nA great character, Gem. I think she's been an incredible servant for Liverpool and securing her was really, really important for the club to do and great for me. I'm sure she's been pestered left, right and centre from the girls asking about myself! It feels a long time ago that we worked together. She's great and I think she gets what we're trying to do. I think that helps us when you have people in the environment already that understand what we want to try to achieve. I think that's really, really great to have.\nThe recruitment drive has started already with four new signings in place, plus numerous players committing themselves to the club. That's so important, isn't it?\nAbsolutely. I think the re-signings are really interesting for me because it shows that players want to be here. The sheer number of those players who have re-signed is really, really positive for me. Certainly in a period where there was uncertainty as to who the next coach was going to be, I think it's amazing that players want to commit their futures, their immediate futures, to the club. But the recruitment side of the game is so, so important at any club. Of course we are ambitious, we give really good opportunities. We lost a couple of players more recently but those players were given a really good platform here to go and showcase their talents and they've been picked up elsewhere. That's normal, that happens at every club. So, [it's] exciting.\nI know we lost a couple of big players in the team and, in terms of recruitment, I would imagine you might want to get a few more in before the start of the WSL season...\nYeah, we have some time. Of course there's lots of competition out there for players and it's a lot busier now these transfer windows than probably when I started four, five seasons ago, particularly the January window. You look at that window now and there's a lot of activity going on, a lot of big money being spent. Of course we want to try to improve and get better, but I think it's recognising what we do have in here already – which is really important. Because if you don't know that then how do you know what you need? We'll certainly be sensible in the way we operate and certainly with wanting to bring players to the club. But, of course, I think it's a big selling point, a club like Liverpool being interested in a player. Again, trying to create that identity that we strive to be and what we want to stand for as a club, I think it's also a really big selling point for any players that want to come.\nFuka Nagano has been a big favourite among the fan base here and I know you worked with a couple of Fuka's Japan teammates at Man City. How much are you looking forward to working with her after she committed her future to the club?\nReally pleased that we were able to secure her future, her short-term future, to the club. I think she's a player that I've always admired and, like you said, [I've] worked with a player in that position in Yui Hasegawa, who was incredibly coachable, a very good player, adapted from a more attacking midfield position to a more defensive one and went on to receive so many individual accolades that she really, really deserved. Of course I see the same with Fuka, I see that opportunity there for someone to grow into that position. She'll certainly be really important for us and it was a real key re-signing for us.\nIn terms of your style of play, I have to say your Manchester City teams were fantastic to watch and you had some great success there. What can the fans expect here at Liverpool?\nHopefully more of the same. I think the playing style is really important to me. It's something we work on on a daily basis. And again, hopefully in time once we get to a position where we're starting to see that shaping up with this team that it also becomes another selling point for recruitment. I think players now want to come to a club not just for the name but also for how the team plays and the style. I think that's really interesting. We just do it a different way. It's not to be different to everybody else, it's to play a game and a style that actually we think will win more often than not. That's nothing against other styles. There's other teams that play different styles and do that really well, and we truly respect those teams.\nBut for us, I think the identity that we want to try to achieve at Liverpool is really key. One of the big reasons why I came here was, again, a bit of a blank canvas for me to be able to go, OK, let's learn this, let's experience it, let's get it wrong, because that will happen at times and those are the bumps in the road that I talk about – but I think that's the exciting part. And unfortunately in life, we only learn a little bit by failure. But the players understand and know that it's on me. I take all the pressure, we'll never point the finger. We're asking them to play in a specific way and when it works they'll massively enjoy it.\nThe Liverpool fans are renowned for their passion and they have a song for every player. They will definitely get a song going for your good self as well, you can be assured of that. How much are you looking forward to meeting them? You've experienced their passion when you were on the touchline at Anfield last season...\nI'm really excited about that. I think a connection with the supporters is important. I think what I noticed – again, that attraction of coming to the club – is just how our supporters are, men's and women's. If you're a Liverpool supporter, you're a Liverpool supporter. I certainly was impressed from the outside looking in. We arrived at Anfield and I think there was near-on 20,000 that day, the Kop looked pretty full, the support was great. Their away support is very good as well. We're going to need those guys. The more we can have that connection with them where they understand what we're trying to do and where we're trying to go, I think that speaks volumes and it's a really exciting partnership for us to look forward to.\nThere's a lot of young talent in this squad, a squad that was a crossbar away from reaching the Women's FA Cup final at Wembley last season. So there's certainly some real talent for you to work with here...\nThere is and that's great. I spent a lot of years working, albeit in the boys' academy, at Manchester City, working with the incredible talent. I love working with young players [and] love learning to try to improve them as much as we possibly can. It's an exciting time. I think the women's game has changed a hell of a lot, academies at clubs now are massively improving and we're starting to see products at young ages [that] are ready to play in first teams.\nYou're about to embark on a number of pre-season friendlies, starting this weekend at Aston Villa. That will give you a great opportunity to have a look at the squad and try one or two different things...\nFor sure. It's our first game, we're in that early part of the season where pre-season is really important for everyone to be healthy and to feel good. The least injuries that we can pick up, the better. We need to push them into a position where we can try to execute what we need to do in the games. But, of course, this is really early. I think certainly with a game on Saturday is great, it's an extension of the training sessions that we'll do and it's what the players look forward to. You can train as much as you want but it's the games that everyone gets excited about. What I would like us to do is just have the games as an extension of our training, where we get ourselves into a position in the training session where actually the game becomes easier. It's going to take time. It won't happen this Saturday against Aston Villa – we're aware of that. But I'm pretty certain that after a while of being here and working in this way, the girls will get used to it and we'll start to see ourselves in those games.\nAs you say, a work in progress but you have a clear vision of what you want and what you need to take this team forward...\nYeah, really clear, really clear. Something that is probably the most authentic thing about myself is my loyalty to the way I see the game. Again, it's not to be smarter than anybody, I respect everybody else's vision of the game. I have big influences, obviously working where I was working with probably one of the great managers on the men's side for many, many years and seeing that battle develop with Jürgen [Klopp]. And obviously Arne [Slot] doing fantastically well last season. That's the exciting part: just having an opportunity to come to a big juggernaut of a club with fantastic supporters. I'm really excited about the challenges ahead.\nCould we also ask you about your backroom staff? I know Amber Whiteley is going to stay on as your assistant and joining is Chad Gribble, who you had at Manchester City...\nWe haven't worked together for tremendously long, [me] and Chad, but I was very fortunate at City that I was able to see a lot of coaches – from the boys' academy, girls' academy, men's first team. I'm a bit of an elder statesman now, I kind of know what a good coach looks like [and] it might not be for everyone. But I was really impressed with Chad. I think he's a top coach. I think [we are] very aligned in the thinking – and that's not to say that we don't challenge ourselves on a daily basis and we question each other, because I think that's really healthy to have as well. For me, he's a top coach and he'll do really good things here. For Amber to be here with us is fantastic. I had a good conversation with her. She's going to be really, really important for us because she knows the girls really, really well [and] they respect her. She's well-respected here at the club by myself and everybody else. I think that is going to be a really good dynamic for us going forward.\nFinally, do you have a message for the Liverpool FC Women supporters?\nJust to say to our wonderful supporters that I'm so delighted to be here, representing a fantastic football club. We're going to need your support. I've been super-impressed by what I've seen from the outside looking in about how big that support is for the club as a whole – not just the women's. I'm looking forward to seeing you this season supporting the team and we'll do good things together.",
  "word_count": 2628,
  "scraped_at": "2026-02-14T13:23:10.306159"
}