{
  "article_id": "d2a9c22a78e8",
  "url": "https://www.cameroon-tribune.cm/article.html/47531/fr.html/guinness-super-league-competition-begins",
  "title": "Guinness Super League : Competition Begins Saturday",
  "date": "20240619T051500Z",
  "domain": "cameroon-tribune.cm",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Guinness Super League : Competition Begins Saturday\n- Par Elizabeth MOSIMA\n- 14 Apr 2022 11:34\n- 0 Likes\nA total of 12 teams will be vying for the championship title this year’s championship.\nThe second season of the Guinness Super League championship will kick off in the days ahead. The official opening ceremony will take place on Saturday April 16, 2022 at the Yaounde Ngoa Ekelle Stadium. A total of 12 teams will be competition in this year’s championship. The opening match will pit current champions, Awa FF and Louves Minproff. Less than one week to the start of the competition organisers are living no stone unturned in order to have a hitch free competition. The teams are well prepared and ready for the competition. Referees concerned in officiating the matches have been selected. The stadiums that will host the different matches have been chosen.\nAccording to a release by the Secretary General of the Cameroon Women’s Football league, Pauline Therese Manguele, the competition will take place in six fields in five sites notably Yaounde, Douala, Guider, Ebolowa and Bamenda. In Yaounde, the Ngoa Ekelle Stadium and the Omnisports Annex Stadium Number One will host the matches for the clubs in Yaounde. In Douala, Caïmain Filles and Authentic Ladies will play their games at the Bepanda Annex Stadium. Renaissance of Guider will play at the Municipal Stadium in Guider and FC Ebolowa will play at the Municipal Stadium in Nko’o Vos. Vision Sport of Bamenda will play their matches at the Yong Sports Academy Stadium in Bamenda.\nThe new season is taking off with some major innovations and has put smiles in the faces of clubs. The Cameroon Football Federation (FECAFOOT) and the main sponsor of the women’s league, Guinness Cameroon SA set to improve the wages of the major actors of the 2022 season. Apart from the monthly stipend of FCFA 5...\nCet article complet est réservé aux abonnés\nDéjà abonné ? Identifiez-vous >\nAccédez en illimité à Cameroon Tribune Digital à partir de 26250 FCFA\nJe M'abonne1 minute suffit pour vous abonner à Cameroon Tribune Digital !\n- Votre numéro spécial cameroon-tribune en version numérique\n- Des encarts\n- Des appels d'offres exclusives\n- D'avant-première (accès 24h avant la publication)\n- Des éditions consultables sur tous supports (smartphone, tablettes, PC)",
  "word_count": 383,
  "scraped_at": "2026-02-14T12:47:40.006960"
}