{
  "article_id": "d2abd3381964",
  "url": "https://www.publishersweekly.com:443/pw/by-topic/new-titles/childrens-announcements/article/91565-spring-2023-children-s-announcements-publishers-a-e.html",
  "title": "Spring 2023 Children Announcements : Publishers A - E",
  "date": "20230218T054500Z",
  "domain": "publishersweekly.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Abbeville\nStars of Major League Baseball by Craig Calcaterra (Mar. 28, $15.95, ISBN 978-0-7892-1459-1) compiles profiles of 28 current players, action photos, and key stats. Ages 8–12.\nAblaze\nFamily Time by Robert Windom and Lily Windom, illus. by Asiah Fulmore (May 30, $14.99 paper, ISBN 978-1-68497-132-9). These father-daughter authors present a fantasy adventure about a family transported back in time while vacationing in Ireland. Ages 12–17.\nBlitz, Vol. 2 by Cédric Biscay and Tsukasa Mori (Feb. 28, $12.99 paper, ISBN 978-1-68497-107-7). In this shonen manga exploring the world of chess, seven players compete for a spot in a school tournament. Ages 12–up.\nThe Elle-Verse (Elle[s], Vol. 2) by Kid Toussaint, illus. by Aveline Stokart (Apr. 25, $10.99 paper, ISBN 978-1-68497-128-2). After a family tragedy and a startling discovery, Elle must face down her greatest enemy: herself. Ages 12–up.\nShepherdess Warriors, Vol. 1 by Jonathan Garnier and Amelie Flechais (July 25, $12.99 paper, ISBN 978-1-68497-169-5). This French comic makes its English-language debut with the story of a girl who joins a woman’s order to help protect her village. Ages 12–up.\nWAKFU, Vol. 1 by Tot, Azra, Saïd Sassine, Tom Gobart, Jérôme Lefévère, Cynthia Leman (June 27, $14.99 paper, ISBN 978-1-68497-137-4). In this manga series opener, friends set off on an adventure after a troublemaker breaks up a birthday party. Ages 12–up.\nAbrams\nBridges by Marc Majewski (Mar. 28, $19.99, ISBN 978-1-4197-5681-8) reveals how bridges around the world connect us to new places, cultures, and people. Ages 4–8.\nThe Carpet: An Afghan Family Story by Dezh Azaad, illus. by Nan Cao (Apr. 4, $18.99, ISBN 978-1-4197-6361-8), focuses on a loving Afghan refugee family and the carpet that links them to home—wherever they are. Ages 4–8.\nThe Courage of the Little Hummingbird: A Tale Told Around the World by Leah Henderson, illus. by Magaly Morales (Apr. 11, $18.99, ISBN 978-1-4197-5455-5). When a forest fire threatens the Great Forest, a hummingbird inspires all the animals to work together to save their homes. Ages 4–8.\nDogs: A History of Our Best Friends by Lita Judge (Apr. 18, $19.99, ISBN 978-1-4197-5544-6). This illustrated history of dogs explains how humans’ partnership with canines has changed our lives and theirs. Ages 4–8.\nThe Fairest in the Land by Lesléa Newman, illus. by Joshua Heinsz (May 2, $17.99, ISBN 978-1-4197-5709-9). Annabelle and Benjamin realize that they can both be their authentic selves during a game of dress-up—and that having two princesses means twice the fun. Ages 4–8.\nThe Good Hair Day by Christian Trimmer, illus. by J. Yang (May 23, $18.99, ISBN 978-1-4197-4588-1). A boy dreams of having long hair in this story about self-expression and embracing one’s true self. Ages 4–8.\nGrandma’s Tipi: A Present-Day Lakota Story by S.D. Nelson (May 9, $18.99, ISBN 978-1-4197-3192-1). During a summer at Standing Rock Reservation, a tipi brings Clara’s family closer together. Ages 4–8.\nGrowl by Jen Corace (June 6, $18.99, ISBN 978-1-4197-5748-8). Animal visitors interrupt a girl’s midnight snack-making in this story celebrating the power of generosity and new friends. Ages 4–8.\nHidden Hope: How a Toy and a Hero Saved Lives During the Holo-\ncaust by Elisa Boxer, illus. by Amy June Bates (Mar. 14, $19.99, ISBN 978-1-4197-5000-7), tells the true story of how a toy duck smuggled forged identity papers for Jewish refugees during WWII. Ages 4–8.\nThe High Line: A Park to Look Up To by Victoria Tentler-Krylov (May 2, $19.99, ISBN 978-1-4197-5670-2) offers an illustrated history of New York City’s elevated park, which was built on an abandoned train track and opened in 2009. Ages 4–8.\nThe Midnight Babies by Isabel Greenberg (June 13, $18.99, ISBN 978-1-4197-5954-3). In this fantastical bedtime adventure, babies join forces to defy their ultimate nighttime nemesis: sleep. Ages 4–8.\nThe Museum of Lost Teeth by Elyssa Friedland, illus. by Gladys Jose (Feb. 7, $17.99, ISBN 978-1-4197-5705-1). After Liam tucks Toothy under his pillow, the Tooth Fairy takes him to live at the Museum of Lost Teeth. Ages 4–8.\nMy Powerful Hair by Carole Lindstrom, illus. by Steph Littlebird (Mar. 21, $18.99, ISBN 978-1-4197-5943-7). The author of We Are Water Protectors offers a story celebrating hair and its significance across Indigenous cultures. Ages 4–8.\nNaming Ceremony by Seina Wedlick, illus. by Jenin Mohammed (Apr. 11, $18.99, ISBN 978-1-4197-5626-9). In this tale of tradition and sibling bonds, Amira hopes Baby Sister loves the name she’s chosen for her. Ages 4–8.\nPa, Me, and Our Sidewalk Pantry by Toni Buzzeo, illus. by Zara González Hoang (July 11, $17.99, ISBN 978-1-4197-4937-7). Pa and his granddaughter build a food pantry next to their sidewalk library in this story about community and generosity. Ages 4–8.\nThe Pumpernickel-Daffodil by Galia Bernstein (June 20, $18.99, ISBN 978-1-4197-5945-1). Competing in his first dog show, a misfit puppy learns the importance of family, friendship, and being oneself. Ages 4–8.\nSummer Is for Cousins by Rajani LaRocca, illus. by Abhi Alwar (May 16, $17.99, ISBN 978-1-4197-5733-4). Ravi worries that his oldest cousin won’t want to spend time with him on vacation in this tale about the bonds among extended family members. Ages 4–8.\nThe Yellow Handkerchief (El pañuelo amarillo) by Donna Barba Higuera, illus. by Cynthia Alonso (Mar. 21, $18.99, ISBN 978-1-4197-6014-3). A child confronts conflicting feelings of embarrassment and love for her Mexican abuela. Ages 4–8.\nBefore Colors: Where Pigments and Dyes Come From by Annette Bay Pimentel, illus. by Madison Safer (June 6, $24.99, ISBN 978-1-4197-5706-8), explores pigments and dyes made from natural sources—across time and\ngeography. Ages 8–12.\nWho’s Got Mail? The History of Mail in America by Linda Barrett Osborne (May 2, $22.99, ISBN 978-1-4197-5896-6). This chronicle of the U.S. Postal Service includes stories of individuals and technological developments. Ages 10–14.\nSeries\nKitty-Corn introduces Party Hearty Kitty-Corn by Shannon Hale, illus. by LeUyen Pham (Mar. 28, $18.99, ISBN 978-1-4197-5095-3), ages 4–8. And Sensing Your World launches with Can You See It? by Susan Verde, illus. by Juliana Perdomo (Apr. 4, $15.99, ISBN 978-1-4197-6163-8), ages 4–8.\nAbrams Appleseed\nSqueak-a-Boo! by Natasha Wing, illus. by Grace Habib (Feb. 7, $9.99 board book, ISBN 978-1-4197-5536-1). Kids lift flaps to discover animals in this rhyming story featuring puns and wordplay. Ages up to 3.\nPicky Panda by Jackie Huang (Apr. 25, $16.99, ISBN 978-1-4197-6279-6). In this book with layered cut-paper art, the gift of a flower awakens persnickety Mr. Panda to the world’s beauty. Ages up to 5.\nWe Might See by Charlie Mylie (May 16, $14.99, ISBN 978-1-4197-5894-2) identifies things—expected and unexpected—that children might spot in their own backyards. Ages up to 5.\nDía de Muertos: Números: A Day of the Dead Counting Book by Duncan Tonatiuh (May 2, $15.99, ISBN 978-1-4197-6446-2). A family honors the memory of loved ones in this bilingual counting book. Ages 3–5.\nOne, Two, Grandpa Loves You by Shelly Becker, illus. by Dan Yaccarino (Mar. 28, $16.99, ISBN 978-1-4197-6508-7). A girl and her loving grand-father set out on an outdoor adventure. Ages 3–5.\nSeries\nAbrams Block Books adds Bugblock by Christopher Franceschelli, illus. by Peski Studio (Apr. 4, $17.99 board book, ISBN 978-1-4197-6062-4), ages up to 3. All Aboard! The Sesame Street Subway is a new Abrams Extend-a-Book by Nichole Mara, illus. by Andrew Kolb (Mar. 28, $12.99 board book, ISBN 978-1-4197-6655-8), ages up to 3. Collector’s Classic Board Books introduces Star Wars: Return of the Jedi by Lucasfilm, illus. by Al Williamson (Apr. 25, $12.99 board book, ISBN 978-1-4197-6787-6), ages up to 3. Empowerment welcomes I Am Ready for School! by Stephen Krensky, illus. by Sara Gillingham (July 18, $8.99 board book, ISBN 978-1-4197-6168-3), ages up to 3. And My First Pull-the-\nTab Eco Books rolls on with Go Green! Energy by Pintachan (Mar. 21, $9.99 board book, ISBN 978-1-4197-6102-7), ages up to 3.\nMail Duck Special Delivery presents Mail Duck Helps a Friend: A Book of Colors and Surprises by Erica Sirotich (June 13, $10.99 board book, ISBN 978-1-4197-6564-3), ages up to 3. Joining My Mighty Marvel First Books is Ant-Man and the Wasp by Marvel Entertainment, illus. by Jack Kirby et al. (Feb. 14, $10.99 board book, ISBN 978-1-4197-6665-7), ages 2–4. Let’s Play Outside! Books picks up Sandy Toes: A Summer Adventure by Shauntay Grant, illus. by Candice Bradley (Apr. 25, $16.99, ISBN 978-1-4197-6307-6), ages 3–5. And Baby Rube’s Opposites is a new accordion-fold Rube Goldberg Book by Jennifer George, illus. by Vin Vogel (May 9, $16.99 board book, ISBN 978-1-4197-5949-9), ages 3–18.\nAbrams/Amulet\nBatcat by Meggie Ramm (Mar. 28, $13.99, ISBN 978-1-4197-5657-3). In this graphic novel series debut, when Batcat is suddenly haunted by an annoying ghost, they ask a witch for a spell to remove it. Ages 6–9.\nThe Good Sports League: The Ultimate Goal by Tommy Greenwald, illus. by Lesley Vamos (Apr. 11, $14.99, ISBN 978-1-4197-6365-6). In the launch title of a series about sports and sportsmanship, a boy on a winning soccer team questions whether winning is really all that matters. Ages 7–10.\nThe Mighty Bite by Nathan Hale (Apr. 4, $14.99, ISBN 978-1-4197-6553-7). In this graphic novel series opener, Trilobite and Amber contend with ancient sea creatures as they compete in a video-making contest. Ages 7–10.\nGrounded by Aisha Saeed, S.K. Ali, Jamilah Thompkins-Bigelow, and Huda Al-Marashi (May 9, $18.99, ISBN 978-1-4197-6175-1). When a storm grounds all flights after a Muslim convention, four very different kids are stranded together at an airport. Ages 8–12.\nKeep Dancing, Lizzie Chu by Maisie Chan (Mar. 28, $18.99, ISBN 978-1-4197-5992-5). A girl tries to cheer up her grieving, forgetful grandfather by taking him on a road-trip adventure. Ages 8–12.\nThe Museum of Lost and Found by Leila Sales, illus. by Jacqueline Li (May 16, $17.99, ISBN 978-1-4197-5451-7). Vanessa fills an empty museum with her artifacts and memories, hoping to fix a broken friendship. Ages 8–12.\nAre You Afraid of the Dark? by Rin Chupeco (May 30, $15.99, ISBN 978-1-4197-6349-6). In this series debut, after disaster strikes a construction site, a woman in white begins haunting the neighbors. Ages 10–14.\nDanny Phantom: A Glitch in Time by Gabriela Epstein (July 18, $24.99, ISBN 978-1-4197-6054-9). Danny travels through time and space to save humanity in this graphic novel based on the Nickelodeon series of the same name. Ages 10–18.\nDear Mothman by Robin Gow (Mar. 21, $18.99, ISBN 978-1-4197-6440-0) is a novel in verse about a trans boy who deals with the death of his friend by writing to his favorite cryptid. Ages 10–14.\nThe Forge & Fracture Saga: That Self-Same Metal by Brittany N. Williams (Apr. 25, $19.99, ISBN 978-1-4197-5864-5). In this series opener, a teen in Shakespearean London uses her ability to control metal to fight the rising conflict between the human and Fae worlds. Ages 12–18.\nNo Boy Summer by Amy Spalding (Apr. 25, $18.99, ISBN 978-1-4197-5752-5). After two sisters make a pact to avoid boy drama during vacation, one of them looks for a loophole when she falls for a girl. Ages 12–18.\nLook No Further by Rioghnach Robinson and Siofra Robinson (June 13, $18.99, ISBN 978-1-4197-5740-2). Two estranged siblings who meet at art camp confront their differing experiences of race and identity. Ages 13–18.\nThirty to Sixty Days by Alikay Wood (June 20, $18.99, ISBN 978-1-4197-5230-8). Three teens facing uncertain futures embark on an adventure that challenges each of their identities. Ages 14–18.\nWolfwood by Marianna Baer (Mar. 28, $19.99, ISBN 978-1-4197-3371-0). A teen begins secretly forging paintings, plunging herself into a dark and dangerous imaginary world. Ages 14–18.\nSeries\nThe Questioneers continues with Bug Bonanza! (Ada Twist, Scientist: Why Files #4) by Andrea Beaty and Theanne Griffith (Mar. 7, $12.99, ISBN 978-1-4197-6555-1), ages 5–8; and Aaron Slater and the Sneaky Snake (The Questioneers, Book #6) by Beaty, illus. by David Roberts (May 2, $12.99, ISBN 978-1-4197-5398-5), ages 6–9. Hello!Lucky Books welcomes Star Struck! (The Cosmic Adventures of Astrid and Stella, Book #2) (Mar. 21, $12.99, ISBN 978-1-4197-5702-0), ages 6–9. Marya Khan returns in her second chapter book, Marya Khan and the Fabulous Jasmine Garden by Saadia Faruqi, illus. by Ani Bushry (Mar. 28, $14.99, ISBN 978-1-4197-6118-8), ages 6–9. Spider-Man: Animals Assemble! is a new Mighty Marvel Team-Up by Marvel Entertainment and Mike Maihack (June 13, $12.99, ISBN 978-1-4197-6480-6), ages 6–9. And We Are the Smurfs picks up Bright New Days!, Book #3 by Peyo (May 16, $12.99, ISBN 978-1-4197-5541-5), ages 6–9.\nThe Extincts issues Flight of the Mammoth, Book #2 by Scott Magoon (Mar. 21, $24.99, ISBN 978-1-4197-5252-0), ages 8–12. The Powers gains Haven’s Legacy, Book #2 by Melissa Benoist and Jessica Benoist (Feb. 7, $18.99, ISBN 978-1-4197-5263-6), ages 8–12. Joining SpongeBob SquarePants Mysteries is Ooze in the Ocean, Book #2 by David Lewman (June 6, $14.99, ISBN 978-1-4197-6206-2), ages 8–12. Tales of Eternia introduces He-Man and the Masters of the Universe: Lost in the Void, Book #3 by Liselle Sambury (June 6, $14.99, ISBN 978-1-4197-6604-6), ages 8–12. Suee and the Strange White Light, Book #2 by Ginger Ly, illus. by Molly Park (May 30, $22.99, ISBN 978-1-4197-4641-3), joins Suee and the Shadow, ages 9–12. G.I. Joe Classified issues G.I. Joe Classified, Book #2 by Kelley Skovron (July 11, $14.99, ISBN 978-1-4197-5442-5), ages 10–14. Wildseed Witch is back in Charmed Life, Book #2 by Marti Dumas (May 2, $18.99, ISBN 978-1-4197-5563-7), ages 10–14. And Outer Banks offers Dead Break by Jay Coles (June 13, $18.99, ISBN 978-1-4197-6161-4), ages 13–18.\nAbrams/Magic Cat\nThe Book of Blast Off! 15 Real-Life Space Missions by Timothy Knapman, illus. by Nik Henderson (June 20, $18.99, ISBN 978-1-4197-6595-7), showcases the spacecrafts and astronauts from 15 space missions. Ages 4–8.\nThrough the Fairy Door by Gabby Dawnay, photos by Lars van de Goor, illus. by Giulia Tomai (Apr. 18, $19.99, ISBN 978-1-4197-6598-8). A girl who embarks on a magical quest discovers that change starts with a tiny seed and no one is too small to make a difference. Ages 4–8.\nSeries\nMagic Flaps presents In the Pond (Mar. 21, $12.99 board book, ISBN 978-1-4197-6593-3) and In the Tree (June 6, $12.99 board book, ISBN 978-1-4197-6594-0) by Will Millard, illus. by Rachel Qiuqi, ages 1–3. My First Discovery Graphic Novels introduces Scientists Are Saving the World! by Saskia Gwinn, illus. by Ana Albero (May 2, $14.99, ISBN 978-1-4197-6596-4), ages 6–9. Joining Changemakers is Old Enough to Make a Difference: Be Inspired by Real-Life Children Building a More Sustainable Future by Rebecca Hui, illus. by Anneli Bray (Mar. 28, $18.99, ISBN 978-1-4197-6599-5), ages 8–12. And Slow Down continues with Slow Down and Be Here Now: More Nature Stories to Make You Stop, Look, and Be Amazed by the Tiniest Things by Laura Brand, illus. by Freya Hartas (Mar. 14, $22.99, ISBN 978-1-4197-6597-1), ages 8–12.\nAftershock Comics\nThe Darkness We Brought Back by Alex Segura and Rex Ogle, edited by Mike Marts (May 30, $17.99 paper, ISBN 978-1-956731-27-9). After stepping through a door into an alternate world and returning to the real world changed, six teens from disparate backgrounds must stop a monster from consuming their souls. Ages 13–17.\nAlbatros\nHenry the Snail by Katarina Macurova (June 13, $16.95, ISBN 978-80-00-06793-3). A snail without slime triumphs when he discovers his own way to do things. Ages 3–6.\nHow Plants Talk by Helena Harastova, illus. by Linh Dao (Apr. 4, $14.95, ISBN 978-80-00-06811-4). This book with flaps reveals how plants communicate with each other. Ages 4–7.\nThe Big Book of Jobs by Hana Mokrosova and Helena Harastova, illus. by Elena Pokaleva (May 2, $16.95, ISBN 978-80-00-06798-8), introduces readers to potential careers and jobs based on their interests. Ages 6–9.\nThe Origins of Sports by Tom Velcovsky and Stephanka Sekaninova, illus. by Matej Ilcik (May 30, $17.95, ISBN 978-80-00-06796-4), covers the geographic and cultural origins, equipment, and rules of various sports. Ages 6–9.\nVersatile Vertebrates by Tom Velcovsky and Marie Kotasova Adamkova, illus. by Babora Idesova (Apr. 18, $17.95, ISBN 978-80-00-06799-5), spotlights the world of vertebrate creatures. Ages 6–9.\nThe Language of Plants by Helena Harastova, illus. by Darya Beklemesheva (Apr. 25, $15.95, ISBN 978-80-00-06797-1), explains how plants protect themselves, help one another, and communicate their needs. Ages 8–12.\nSeries\nKids Around the World issues How Kids Play Around the World by Stepanka Sekaninova (May 16, $15.95, ISBN 978-80-00-06795-7) and Where Kids Go to School Around the World by Sekaninova and Helena Harastova (June 20, $15.95, ISBN 978-80-00-06772-8), both illus. by Michaela Bergannova, ages 6–9. Numbers, Numbers Everywhere by Magda Gargulakova, illus. by Sean Longcroft (June 6, $16.95, ISBN 978-80-00-06844-2), joins Look Around and Learn, ages 6–9. Unfolding the Past adds Ancient Greece for Kids by Oldrich Ruzicka, illus. by Tomas Tuma, edited by Scott Alexander Jones (Mar. 7, $16.95, ISBN 978-80-00-06598-4), ages 6–9. How the Wonders Were Built releases How the New Seven Wonders of the World Were Built by Jiri Bartunek and Tom Velcovsky, illus. by Jan Sramek (July 11, $17.95, ISBN 978-80-00-06843-5), ages 9–12. And Means of Transport moves on with Means of Transport That Almost Changed the World by Tom Velcovsky and Stepanka Sekaninova, illus. by Martin Sodomka (Apr. 11, $18.95, ISBN 978-80-00-06845-9), ages 12–15.\nAlgonquin\nMermaid and Pirate by Tracey Baptiste, illus. by Leisl Adams (Apr. 4, $18.99, ISBN 978-1-64375-077-4). A Black mermaid and a pirate build a friendship through kindness, empathy, and shared adventure. Ages 3–7.\nSunny and Oswaldo by Nicole Melleby, illus. by Alexandra Colombo (Feb. 7, $18.99, ISBN 978-1-64375-095-8). This tale of friends, family, and the importance of compassion features a cranky cat and his young owner. Ages 4–8.\nCamp Quiltbag by Nicole Melleby and A.J. Sass (Mar. 21, $16.99, ISBN 978-1-64375-266-2). At a summer camp for queer and trans kids, two campers help each other navigate crushes and their identities. Ages 8–12.\nSam Makes a Splash (May 9, $16.99, ISBN 978-1-64375-310-2) and Marina in the Middle by Nicole Melleby (May 9, $16.99, ISBN 978-1-64375-311-9) launch the House on Sunrise Lagoon series about five siblings who live with their two mothers in a house by the bay. Ages 8–12.\nThe Demon Sword Asperides by Sarah Jean Horwitz (July 11, $16.99, ISBN 978-1-64375-278-5). A talking, scheming sword and a virtuous knight-in-training band together on a quest. Ages 9–12.\nI’ll Take Everything You Have by James Klise (Feb. 28, $17.99, ISBN 978-1-61620-858-5). One summer, a teen discovers the queer community in 1930s Chicago and gets caught up in the city’s criminal underbelly. Ages 13–17.\nAllen & Unwin/A&U Children\nWhen You’re Older by Sofie Laguna, illus. by Judy Watson (May 2, $18.99, ISBN 9781760291341), reveals a big brother's hopes for the amazing experiences he will share with his new baby brother— when he's older. Ages 4-8.\nAmazon Crossing\nBatu and the Search for the Golden Cup by Zira Nauryzbai and Lilya Kalaus, trans. by Shelley Fairweather-Vega (Mar. 28, $17.99, ISBN 978-1-66250-702-1). Batu and his friends set out with Aspara, the Golden Warrior, to find the Golden Cup in a world where myths come alive. Ages 8–12.\nSeries\nThe Moonwind Mysteries starts up with The Night Raven by Johan Rundberg, trans. by A.A. Prime (June 6, $17.99, ISBN 978-1-66250-958-2), ages 10–14.\nAmazon/Two Lions\nMarker by Anna Kang, illus. by Christopher Weyant (June 20, $17.99, ISBN 978-1-5420-3961-1). In this companion to Eraser, a marker learns it’s okay to make mistakes even if all that she does is permanent. Ages 3–7.\nWe Are One by Jackie Azúa Kramer, illus. by Raissa Figueroa and Niña Mata (May 16, $17.99, ISBN 978-1-5420-1694-0). This tale celebrating community, friendship, and the natural world stars two girl who bond at a lantern\nfestival. Ages 3–7.\nOutside Amelia’s Window by Caroline Nastro, illus. by Anca Sandu Budisan (Mar. 28, $17.99, ISBN 978-1-5420-2785-4). With the help of a bird, Amelia finds the courage to embark on a journey in her new wheelchair. Ages 5–8.\nSeries\nTurkey Trouble continues with Turkey’s Sandtastic Beach Day by Wendi Silvano, illus. by Lee Harper (May 9, $17.99, ISBN 978-1-66250-835-6), ages 3–7.\nAPA/Magination\nCamilla, Super Helper by Julie Dillemuth, illus. by Laura Wood (May 16, $18.99, ISBN 978-1-4338-4193-4). In this companion to Camilla, Cartographer, Camilla and Parsley help bees find the flowers and water they need during a hot summer. Ages 4–8.\nDad and Daddy’s Big Big Family by Seamus Kirst, illus. by Karen Bunting (May 9, $18.99, ISBN 978-1-4338-4038-8). Harper learns about all the little families that are part of her large extended clan. Ages 4–8.\nSomething Happened to Our Planet: Kids Tackle the Climate Crisis by Marianne Celano and Marietta Collins, illus. by Bhagya Madanasinghe (Apr. 4, $19.99, ISBN 978-1-4338-4072-2), describes friends’ efforts to help the planet by advocating for reusable plates at their school. Ages 4–8.\nThe Sound of Kindness by Amy Ludwig Vanderwater, illus. by Teresa Martinez (June 13, $18.99, ISBN 978-1-4338-4149-1). A parent and child listen for words of friendship, gratitude, and love in their community. Ages 4–8.\nSpacemanatee! by Katie Gilstrap, illus. by Alice Samuel (Mar. 7, $18.99, ISBN 978-1-4338-4037-1). Determined to find the “Manatee on the Moon,” a manatee blasts off into space in her self-made rocket. Ages 4–8.\nTummy Troubles: Gretchen Gets a Grip on Her Fear of Throwing Up by Jaime Roche, illus. by Doruntina Beqiraj (June 6, $19.99, ISBN 978-1-4338-4078-4). The new school counselor helps a girl contend with her fear of vomiting. Ages 4–8.\nOut of the Fires: A Journal of Resilience and Recovery After Disaster by Carrie Lara, illus. by Colleen Larmour (July 4, $19.99, ISBN 978-1-4338-4069-2). After a fire destroys his neighborhood, a boy keeps a journal and discovers what it means to be resilient and to recover. Ages 8–12.\nStress Less: A Teen’s Guide to a Calm Chill Life by Michael A. Tompkins (Feb. 14, $16.99, ISBN 978-1-4338-3704-3) outlines skills for managing stress rooted in family, friends, dating, school, and media. Ages 13–18.\nSeries\nKid Confident: Middle Grade Shelf Help presents How to Handle Stress for Middle School Success, Book #3 by Silvi Guerra (Feb. 21, $16.99, ISBN 978-1-4338-3816-3) and How to Navigate Middle School, Book #4 by Anna Pozzatti and Bonnie Massimino (Feb. 21, $16.99, ISBN 978-1-4338-3822-4), both edited by Bonnie Zucker, illus. by Deandra Hodge, ages 11–14.\nAmicus Ink\nEverything a Drum by Sarah Warren, illus. by Camila Carrossine (Mar. 14, $16.99, ISBN 978-1-68152-749-9). In this tale about musicality and family, a toddler uses everything as a means to tap out a beat. Ages 2–5.\nHappy Birthday, Belly Button! by Kalli Dakos, illus. by Luciana Navarro Powell (Mar. 14, $16.99, ISBN 978-1-68152-751-2). A child celebrates being one year older and his growing body parts. Ages 2–5.\nSeries\nLittle Animal Friends welcomes Little Otter (Mar. 14, $9.99 board book, ISBN 978-1-68152-870-0) and Little Walrus (Mar. 14, $9.99 board book, ISBN 978-1-68152-871-7) by Julie Abery, illus. by Suzie Mason, ages up to 3.\nAndersen Press USA\nThe Day Fin Flooded the World by Adam Stower (Apr. 4, $18.99, ISBN 978-1-72849-213-1). What happens when a forgetful boy leaves the tap running until it floods the world? Ages 4–9.\nHedge Lion by Robyn Wilson-Owen (Mar. 7, $18.99, ISBN 978-1-72849-212-4). A friend helps Hedge Lion, who wants everyone to think he’s a hedge, to find his confidence and his roar. Ages 4–9.\nThe Pipsqueak by Ben Manley, illus. by Andrew Gardner (Apr. 4, $18.99, ISBN 978-1-72849-211-7). When a bully appears, average Pip proves he is a hero by standing up for his friends. Ages 4–9.\nSeries\nElmer returns in Elmer and the Gift by David McKee (Mar. 7, $18.99, ISBN 978-1-72849-205-6), ages 4–9.\nAndrews McMeel\nCome Back to Me: A Bedtime Story for Sleepy Eyes by R.H. Sin, illus. by Janie Secker (May 30, $17.99, ISBN 978-1-5248-7461-2), is a lullaby celebrating dream-filled slumber. Ages up to 5.\nGrimwood, Vol. 1 by Nadia Shireen (May 30, $18.99, ISBN 978-1-5248-8226-6; $9.99 paper, ISBN 978-1-5248-8225-9). Two fox cubs on the run from a terrifying cat star in this launch to an animal-filled series. Ages 7–10.\nPeculiar Woods: The Ancient Underwater City by Andrés J. Colmenares (May 23, $21.99, ISBN 978-1-5248-8491-8; $11.99 paper, ISBN 978-1-5248-7929-7). As this series opens, a boy uses his ability to speak with inanimate objects to solve the mystery of his flooded new hometown. Ages 7–11.\nWorld’s Worst Time Machine, Vol. 1 by Dustin Brady, illus. by Dave Bardin (Apr. 25, $13.99, ISBN 978-1-5248-8413-0; $9.99 paper, ISBN 978-1-5248-7708-8). In this series debut, after finding a time machine at a garage sale, Liam summons Thomas Edison for help with his book report—but a different Edison appears. Ages 7–11.\n150 Happy Facts by The Happy Broadcast by Keith Bonicci, illus. by Mauro Gatti (Mar. 7, $11.99 paper, ISBN 978-1-5248-7577-0). The creators of this social channel offer a roundup of uplifting news items. Ages 7–11.\nWhen Everything Went Wrong: 10 Real Stories of Inventors Who Didn’t Give Up! by Max Temporelli and Barbara Gozzi, illus. by Agnese Innocente (May 2, $14.99, ISBN 978-1-5248-8042-2), spotlights inventions that had rocky starts—and their persevering creators. Ages 7–12.\nThe Boy with Wings by Lenny Henry (May 20, $21.99, ISBN 978-1-5248-8471-0; $12.99 paper, ISBN 978-1-5248-8000-2). After Tunde sprouts wings on his 12th birthday, he is tasked with saving the world. Ages 8–12.\nMeems and Feefs: Ferrets from Planet Ferretonia! Vol. 1 by Liza N. Cooper (July 25, $12.99 paper, ISBN 978-1-5248-7670-8). Two ferrets from another planet crash-land on Earth in this series launch. Ages 8–12.\nNancy Wins at Friendship by Olivia Jaimes (May 16, $12.99 paper, ISBN 978-1-5248-8092-7). In this collection of syndicated comics, Nancy navigates school and friendship. Ages 8–12.\nFour Months Past Florence by Emily Paige Wilson (May 30, $18.99 paper, ISBN 978-1-5248-8133-7). Millie feels sidelined as a weatherwoman for her school newspaper, but a hurricane changes everything. Ages 14–17.\nSeries\nLeila & Nugget Mysteries continues with The Case with No Clues, Vol. 2 by Dustin Brady, illus. by April Brady (Mar. 7, $12.99, ISBN 978-1-5248-7925-9; $9.99 paper, ISBN 978-1-5248-7753-8), ages 7–9. Prancer, the Demon Chihuahua returns in More Jokes, More Fun!, Vol. 2 by Pam Pho, illus. by Cloris Chou (June 6, $10.99 paper, ISBN 978-1-5248-7613-5), ages 7–10. Diary of an 8-Bit Warrior Graphic Novels picks up Battle for the Dragon, Vol. 4 by Pirate Sourcil, illus. by Jez and Odone (Apr. 4, $13.99, ISBN 978-1-5248-7939-6; $9.99 paper, ISBN 978-1-5248-7679-1), ages 7–11. And Lincoln Peirce’s Big Nate returns in Big Nate TV Series Graphic Novel: Next Stop, Superstardom!, Vol. 3 (May 30, $19.99, ISBN 978-1-5248-8415-4; $12.99 paper, ISBN 978-1-5248-7931-0), ages 7–12; Big Nate: Nailed It!, Vol. 28 (Feb. 28, $12.99 paper, ISBN 978-1-5248-7923-5), ages 8–11; and Big Nate: No Worries (July 25, $16.99 paper, ISBN 978-1-5248-8091-0), ages 8–12.\nAdventure Kingdom picks up A Knight of the Realm, Vol. 2 by Steve Foxe, illus. by Pedro Rodrã-Guez and Shadia Amin (Apr. 25, $21.99, ISBN 978-1-5248-7872-6; $12.99 paper, ISBN 978-1-5248-7871-9), ages 8–12. The Bright Family reappears in Family Vacation, Vol. 2 by Gabe Soria, illus. by Ribs Rafa (Mar. 28, $21.99, ISBN 978-1-5248-7869-6; $12.99 paper, ISBN 978-1-5248-7868-9), ages 8–12. And Gamer Girls by Andrea Towers, illus. by Alexis Jauregui, star in Gnat vs. Spyder, Vol. 1 (May 9, $19.99, ISBN 978-1-5248-8453-6) and Monster Village, Vol. 2 (May 9, $19.99, ISBN 978-1-5248-8452-9; $11.99 paper, ISBN 978-1-5248-7659-3), ages 8–12.\nHeart of the City presents Lost and Found: A Heart of the City Collection, Vol. 2 by Steenz (Apr. 4, $12.99 paper, ISBN 978-1-5248-7930-3), ages 8–12. Dana Simpson’s Phoebe and Her Unicorn continues with Punk Rock Unicorn, Vol. 17 (Apr. 4, $12.99 paper, ISBN 978-1-5248-7922-8) and The Shimmering Stories of Phoebe and Her Unicorn (June 20, $16.99 paper, ISBN 978-1-5248-8090-3), ages 8–12. Unicorn Island issues Beyond the Portal, Vol. 3 by Donna Galanti, illus. by Bethany Stancliffe (Apr. 4, $13.99, ISBN 978-1-5248-7870-2), ages 8–12. Archibald Finch stars in Archibald Finch and the Curse of the Phoenix, Vol. 2 by Michel Guyon (May 16, $19.99, ISBN 978-1-5248-7136-9), ages 9–12. And The Witch’s Throne offers The Witch’s Throne, Vol. 2 by Cedric Caballes (June 13, $15.99 paper, ISBN 978-1-5248-8127-6), ages 13–17.\nArbordale\nSeries\nAnimal Anatomy & Adaptations adds Animal Myths by Mary Holland (Feb. 14, $11.95 paper, ISBN 978-1-64351-981-4), ages 5–8. And Compare and Contrast presents Alligator or Crocodile? by Jennifer Shields (Feb. 14, $11.95 paper, ISBN 978-1-64351-982-1), Birds by Aszya Summers (Feb. 14, $11.95 paper, ISBN 978-1-64351-984-5), Black Bear or Grizzly Bear? by Chris Schmitz (Feb. 14, $11.95 paper, ISBN 978-1-64351-983-8), Fishes by Marie Fargo (Feb. 14, $11.95 paper, ISBN 978-1-64351-985-2), Hippo or Rhino? by Samantha Collison (Feb. 14, $11.95 paper, ISBN 978-1-64351-991-3), Octopus or Squid? by Annmarie Lisi (Feb. 14, $11.95 paper, ISBN 978-1-64351-986-9), and Turtles by Cherlyn Vatalaro (Feb. 14, $11.95 paper, ISBN 978-1-64351-995-1), ages 6–9.\nArchie Comics\nThe Archies in India by Bill Golliher et al. (Feb. 14, $14.99 paper, ISBN 978-1-64576-872-2), collects tales in which Archie and his Riverdale pals visit India. Ages 9–12.\nArchie & Friends: Endless Escapades by Tee Franklin, et al. (July 11, $12.99 paper, ISBN 978-1-64576-885-2), reveals the first appearances of Eliza Han, a biracial pansexual character; and Stacy Banks, an African American coding genius. Ages 9–12.\nSeries\nWebtoon adds Big Ethel Energy, Vol. 2 by Keryl Brown Ahmed, illus. by Siobhan Keenan (Mar. 14, $17.99 paper, ISBN 978-1-64576-873-9), ages 13–up. And Going Viral by Ron Cacace, illus. by Vincent Lovallo, joins Bite Sized Archie (May 16, $12.99 paper, ISBN 978-1-64576-877-7), ages 13–up.\nArctis\nGrim by Sara B. Elfgren, trans. by Judith Kiros (Mar. 7, $20, ISBN 978-1-64690-030-5). A teen searches for the truth behind the death of his father’s bandmate 30 years before, who appears in the boy’s dreams. Ages 14–18.\nSeries\nDagfrid, Viking Girl releases No More Ear Buns! (Apr. 4, $7 paper, ISBN 978-1-64690-804-2) and Secret Viking Wishes (Apr. 4, $7 paper, ISBN 978-1-64690-805-9). by Agnès Mathieu-Daudé, trans. by Nanette McGuinness, illus. by Olivier Tallec, ages 6–8. The Woodwalkers debuts with Carag’s Transformation (Feb. 14, $16, ISBN 978-1-64690-020-6) and A Dangerous Friendship (Mar. 14, $16, ISBN 978-1-64690-021-3) by Katja Brandis, trans. by Rachel Ward, ages 8–13. Franny Cloutier stars in The Year My Life Turned Upside Down by Stephanie Lapointe, trans. by Ann Marie Boulanger, illus. by Marianne Ferrer (Feb. 14, $17, ISBN 978-1-64690-024-4), ages 10–14. And Vardari launches with Iron Wolf by Siri Pettersen, trans. by Tara Chace (Feb. 21, $20, ISBN 978-1-64690-015-2), ages 13–17.\nAstra\nSeries\nArithmechicks navigate numbers in Arithmechicks Explore More (May 9, $12.99, ISBN 978-1-63592-599-9) and Arithmechicks Find Their Place (May 9, $12.99, ISBN 978-1-63592-597-5) by Ann Marie Stephens, illus. by Jia Liu, ages 4–8. And Secret Life uncovers The Secret Life of the Flying Squirrel by Laurence Pringle, illus. by Kate Garchinsky (Apr. 11, $17.99, ISBN 978-1-63592-529-6), ages 6–9.\nAstra/Calkins Creek\nThe Brilliant Calculator: How Mathematician Edith Clarke Helped Electrify America by Jan Lower, illus. by Susan Reagan (Mar. 14, $18.99, ISBN 978-1-66268-006-9), profiles Clarke, an innovative mathemetician who built the first graphing calculator—from paper. Ages 7–10.\nJosephine and Her Dishwashing Machine: Josephine Cochrane’s Bright Invention Makes a Splash by Kate Hannigan, illus. by Sarah Green (Mar. 14, $18.99, ISBN 978-1-63592-621-7), explains how Cochrane streamlined the task of washing dishes by inventing a machine to do the task. Ages 7–10.\nPitch Perfect and Persistent! The Musical Debut of Amy Cheney Beach by Caitlin DeLems, illus. by Alison Jay (Mar. 21, $18.99, ISBN 978-1-66268-008-3), recounts the life of Beach, the first successful woman composer in America. Ages 7–10.\nA Take-Charge Girl Blazes a Trail to Congress: The Story of Jeannette Rankin by Gretchen Woelfle, illus. by Rebecca Gibbon (Feb. 7, $18.99, ISBN 978-1-66268-012-0), follows the life of this early 20th-century Montana activist who became America’s first Congresswoman. Ages 7–10.\nThe Women Who Built Hollywood: 12 Trailblazers in Front of and Behind the Camera by Susan Goldman Rubin (May 16, $18.99, ISBN 978-1-66268-010-6) spotlights groundbreaking Old Hollywood women. Ages 12–18.\nAstra/Hippo Park\nA Delicious Story by Barney Saltzberg (June 6, $17.99, ISBN 978-1-66264-016-2). Little Mouse is looking for a story and Big Mouse has to admit he ate it in this tale of on-the-spot storytelling. Ages 3–6.\nKing of Cool by Mike Petrik (May 9, $12.99, ISBN 978-1-66264-018-6). Duck and his pals discover what it means to be a friend in this launch of a graphic chapter-book series. Ages 6–9.\nThe Love Report by Beka, illus. by Maya (June 13, $19.99, ISBN 978-1-66264-040-7). In this graphic-novel series debut, two friends try to unravel the mystery of romance by analyzing the ways of love at their school. Ages 10–14.\nSeries\nHippo Park Pals return in Fiona in the Sandbox by Rilla Alexander (Feb. 7, $9.99, ISBN 978-1-66264-010-0), ages 3–6.\nAstra/Kane\nSeries\nEureka! The Biography of an Idea continues with Guitar by Lori Haskins Houran, illus. by Kaly Quarles (Apr. 4, $17.99, ISBN 978-1-66267-005-3); and Wind Power by Laura Driscoll, illus. by Marco Guadalupi (Apr. 4, $17.99, ISBN 978-1-66267-004-6), ages 4–8. And Mouse Math serves up Cheese Fest! Composing Shapes by Lori Haskins Houran, illus. by Deborah Melmon (May 2, $16.99, ISBN 978-1-66267-006-0), ages 4–8.\nAstra/mineditionUS\nLuna Ranchera by Rodrigo Morlesin, illus. by Mariana Ruiz Johnson (June 20, $18.99, ISBN 978-1-66265-110-6), is a rags-to-riches tale about a canine mother-daughter singing act in the Nuevo Wild West. Ages 3–6.\nPapá’s Magical Water-Jug Clock by Jesus Trejo, illus. by Eliza Kinkz (June 6, $18.99, ISBN 978-1-66265-104-5). In this story by Mexican American comedian Trejo, young Jesús learns a lesson when he makes a mistake involving Papá’s allegedly magical jug. Ages 3–6.\nLittle Lessons by Seymour Chwast (Apr. 4, $12.99, ISBN 978-1-66265-117-5) offers graphic renditions of popular sayings from around the world. Ages 4–7.\nHow Birds Sleep by David Obuchowski, illus. by Sarah Pedry (Mar. 28, $17.99, ISBN 978-1-66265-097-0), uncovers the unexpected sleeping habits of more than 20 bird species across the globe. Ages 4–8.\nAstra/Wordsong\nPush-Pull Morning: Dog-Powered Poems About Matter and Energy by Lisa Westberg Peters, illus. by Serge Bloch (Feb. 21, $18.99, ISBN 978-1-63592-527-2), introduces physics through play, poetry, and a puppy. Ages 4–8.\nGarvey’s Choice: The Graphic Novel by Nikki Grimes, illus. by Theodore Taylor III (June 6, $22.99, ISBN 978-1-66266-002-3). A boy learns to accept himself and connect with his distant father in this novel in verse. Ages 9–12.\nBarefoot\nDriving My Tractor by Jan Dobbins, illus. by David Sim (Mar. 7, $14.99 board book, ISBN 978-1-64686-855-1). A busy farmer picks up 15 animals along his route, but when his trailer hits a stone, chaos ensues. Ages 3–7.\nTwice as Many Friends/El doble de amigos by Brian Amador, illus. by Vanina Starkoff (Apr. 4, $16.99, ISBN 978-1-64686-845-2). This English-Spanish singalong reveals how learning a new language facilitates connecting with people and making friends. Ages 3–7.\nFood for the Future: Sustainable Farms Around the World by Mia Wenjen, illus. by Robert Sae-Heng (May 23, $17.99, ISBN 978-1-64686-839-1), tours farms around the globe to introduce farming innovations and longstanding sustainable ways to grow food. Ages 3–8.\nThe Perfect Sushi by Emily Satoko Seo, illus. by Mique Moriuchi (Apr. 4, $16.99, ISBN 978-1-64686-837-7). Making sushi for her grandmother, Miko learns that love—not perfection—is the crucial ingredient. Ages 4–9.\nWhatever Comes Tomorrow by Rebecca Gardyn Levington, illus. by Mariona Cabassa (Mar. 7, $17.99, ISBN 978-1-64686-841-4), reassures kids that they have the resilience to manage whatever comes their way. Ages 4–9.\nI’ll See You in Ijebu by Bunmi Emenanjo, illus. by Diana Ejaita (May 23, $17.99, ISBN 978-1-64686-843-8). A Catholic girl from Lagos, Nigeria visits her Muslim relatives in the town of Ijebu to celebrate Eid al-Adha. Ages 4–10.\nSeries\nMix-and-Match by Nelleke Verhoeff serves up Bruno Builder Bakes Bread (Apr. 4, $12.99 board book, ISBN 978-1-64686-850-6) and Ketchup on My Sundae (Apr. 4, $12.99 board book, ISBN 978-1-64686-849-0), ages up to 4. And Our World visits Brazil by Ana Siqueira, illus. by Ana Matsusaki (Apr. 4, $9.99 board book, ISBN 978-1-64686-630-4); India by Meera Sriram, illus. by Neethi (Apr. 4, $9.99 board book, ISBN 978-1-64686-628-1); Italy by Francesca Di Marzo, illus. by Naida Mazzenga (Apr. 4, $9.99 board book, ISBN 978-1-64686-848-3); and Mexico by Cynthia Harmony, illus. by Claudia Navarro (Apr. 4, $9.99 board book, ISBN 978-1-64686-847-6), ages up to 4. And new bilingual additions to Yoga Tots/Niños yoga by Tessa Strickland, illus. by Estelí Meza, are Brave Bear/Oso valiente (Mar. 7, $7.99 board book, ISBN 978-1-64686-851-3), Calm Bunny/Conejito calmado (Mar. 7, $7.99 board book, ISBN 978-1-64686-852-0), Happy Tiger/Tigre feliz (Mar. 7, $7.99 board book, ISBN 978-1-64686-853-7), and Strong Puppy/Perrito fuerte by Tessa Strickland, illus. by Estelí Meza (Mar. 7, $7.99 board book, ISBN 978-1-64686-854-4), ages 2–4.\nTitles in Spanish\nEl cisne de chatarra: la limpieza de un río (Scrap Metal Swan: A River Clean-Up Story) by Joanne Linden, illus. by Estrellita Caracol (Mar. 7, $9.99 paper, ISBN 978-1-64686-877-3); and La gata jet (no es una gata) (Jet the Cat [Is Not a Cat]) by Phaea Crede, illus. by Terry Runyan (Mar. 7, $9.99 paper, ISBN 978-1-64686-875-9), ages 3–7; and El pan mascota: una historia de masa madre (The Bread Pet: A Sourdough Story) by Kate DePalma, illus. by Nelleke Verhoeff (Mar. 7, $9.99 paper, ISBN 978-1-64686-876-6), ages 4–9.\nBeaming\nBig Truck Playdate by Laurie Carmody, illus. by Jennica Lounsbury (Mar. 7, $17.99, ISBN 978-1-5064-8484-6). Told from the perspective of a truck-loving boy on the autism spectrum, this story demonstrates how the power of play can connect us with new friends. Ages 3–8.\nFlipflopi: How a Boat Made from Flip-Flops Is Helping to Save the Ocean by Linda Ravin Lodding and Dipesh Pabari, illus. by Michael Machira Mwangi (Mar. 14, $19.99, ISBN 978-1-5064-8640-6), is based on the true story of how a Kenyan boy and his grandfather transformed plastic waste items into something useful. Ages 3–8.\nDear Star Baby by Malcolm Newsome, illus. by Kamala Nair (Apr. 4, $18.99, ISBN 978-1-5064-8480-8). A boy processes his grief after a miscarriage, in this story written as a letter to his unborn baby sibling. Ages 5–8.\nA Dive into the Blue by Ellie Huynh and Bao Luu (May 23, $17.99, ISBN 978-1-5064-8634-5). Determined to dive into the pool, a girl uses her imagination and musters up the courage to overcome her fears. Ages 5–8.\nDuck, Duck, Tiger by Brittany R. Jacobs (May 16, $18.99, ISBN 978-1-5064-8743-4). Lili is aware that she’s different from those around her in this story about the difficulties those with marginalized identities face. Ages 5–8.\nI Am Not Afraid: Psalm 23 for Bedtime by Sandy Eisenberg Sasso, illus. by Marta Dorado (Feb. 21, $17.99, ISBN 978-1-5064-8551-5), offers a bedtime retelling of this psalm for children who feel afraid of the dark. Ages 5–8.\nLooking for Happy by Ty Chapman, illus. by Keenon Ferrell (May 2, $18.99, ISBN 978-1-5064-8354-2). This story about a Black boy coping with his emotions emphasizes that it’s normal to have happy and sad days. Ages 5–8.\nNila’s Perfect Coat by Norene Paulson, illus. by Maria Mola (Feb. 7, $18.99, ISBN 978-1-5064-8581-2). At the thrift store, Nila finds the perfect coat, but decides it might be more perfect for someone else. Ages 5–8.\nOne Small Thing by Marsha Diane Arnold, illus. by Laura Watkins (May 9, $18.99, ISBN 978-1-5064-8377-1). After Raccoon loses his home, his friends each find one small way to help—and make a big difference. Ages 5–8.\nThe Postcard Project by Maggie Lauren Brown, illus. by Asma Enayeh (Apr. 25, $17.99, ISBN 978-1-5064-8692-5). When Lola gets homesick while visiting Gram, they make postcards to send love to those back home. Ages 5–8.\nSometimes Shy by Julie Bliven, illus. by Dang Khoa Tran (May 23, $18.99, ISBN 978-1-5064-8593-5). In this tale about situational shyness, a sensitive boy notices different inanimate objects that are shy too. Ages 5–8.\nSparrow’s Prayer by Roger Hutchison, illus. by Ag Jatkowska (Feb. 14, $17.99, ISBN 978-1-5064-8159-3). When Sparrow can’t find the words to pray, his animal pals show him ways to connect with God without words. Ages 5–8.\nWherever You Are by Glenys Nellist, illus. by Sian James (Feb. 28, $17.99, ISBN 978-1-5064-7377-2), encourages children to notice God all around them in the people and places of everyday life. Ages 5–8.\nFinding Calm in Nature: A Guide for Mindful Kids by Jennifer Grant, illus. by Erin Brown (Mar. 21, $19.99, ISBN 978-1-5064-8513-3), shows how spending time in nature can help kids navigate their feelings. Ages 9–13.\nSeries\nWoodland Friends celebrate springtime in Doe’s Dandelions by Laura Renauld, illus. by Jennie Poh (Mar. 7, $17.99, ISBN 978-1-5064-8568-3), ages 3–8.\nBehrman/Apples & Honey\nDaddy, Can You Make Me Tall? by Rona Novick, illus. by Ana Sebastian (Mar. 16, $17.95, ISBN 978-1-68115-597-5). A boy’s parents let him join in the preparations for Shabbat by allowing him to do the parts he can and helping him just enough to begin to do the rest. Ages 3–6.\nThere’s a Goblin on the Ark by Susan Tarcov, illus. by Mackinzie Rekers (May 2, $17.95, ISBN 978-1-68115-602-6). Frightened animals on Noah’s ark try to scare away a goblin, until they discover the creature has lost its friend, and they help it find its partner. Ages 3–6.\nHank on First! How Hank Greenberg Became a Star on and Off the Field by Stephen Krensky, illus. by Alette Straathof (Mar. 7, $17.95, ISBN 978-1-68115-599-9), profiles this first baseman for the Detroit Tigers in the 1930s, who was determined to be himself, even in the face of antisemitism. Ages 4–7.\nMatilda Makes Matzah Balls by Rhonda Cohen, illus. by Francesca Galmozzi (Mar. 7, $17.95, ISBN 978-1-68115-616-3). A girl’s grandmother encourages her to try out her imaginative ideas while helping to cook for Passover for the first time, even if they don’t always work out. Ages 4–7.\nUnder the Sea Seder by Ann D. Koffsky (Mar. 7, $17.95, ISBN 978-1-68115-594-4). Unable to sit still during the Passover seder, Miri slips under the table to lead one of her own with imaginary sea creatures as guests. Ages 5–8.\nGolem Goes to Camp by Todd Gutnick, illus. by Ruth Bennett (May 23, $16.95, ISBN 978-1-68115-622-4). A camper tries his hand at art and unwittingly creates a mud monster—a Golem from Jewish folklore. Ages 7–9.\nThe Unexpected Adventures of C.A.T. by Johanna Hurwitz, illus. by Sam Loman (May 23, $16.95, ISBN 978-1-68115-603-3). A feline-loving girl and her brother have a nocturnal adventure when magical cat food turns them into cats. Ages 7–9.\nRose Spoke Out: The Story of Rose Schneiderman by Emma Berne, illus. by Giovanni Abeille (Apr. 4, $17.95, ISBN 978-1-68115-617-0), is a biography of Schneiderman, a Polish-Jewish immigrant who founded the International Ladies Garment Workers Union. Ages 8–12.\nBerbay\nTiger & Cat by Allira Tee (Mar. 7, $17.99, ISBN 978-1-922610-50-8). Two pals are separated when one goes to camp in this tale about learning where you belong and finding friends who like you just the way you are. Ages 2–6.\nAll in a Day by Chihiro Takeuchi (Apr. 4, $18.99, ISBN 978-1-922610-54-6). This story about time and community follows the comings and goings of individuals who live and work in the same building. Ages 3–7.\nHow to Make Friends: A Bear’s Guide by Cat Rabbit (June 6, $18.99, ISBN 978-1-922610-56-0). A timid bear stars in this guide to making friends while keeping the qualities (and quirks) that make you unique. Ages 3–7.\nNorton and the Borrowing Bear by Gabriel Evans (May 2, $18.99, ISBN 978-1-922610-55-3). In this sequel to Norton and the Bear, two companions learn lessons about setting boundaries and accepting friends, flaws and all. Ages 3–7.\nBunnygirl: The First Adventure by Holly Jayne (Feb. 7, $17.99, ISBN 978-1-922610-51-5). Told in comic panels, this story launches a series about an aspiring superhero whose real power is her kindness. Ages 4–7.\nMoth in a Fancy Cardigan by Charlotte Lance, illus. by David Booth (May 9, $19.99, ISBN 978-1-922610-57-7). This tale about identity centers on a butterfly who wants to disappear and a moth who wants to be seen. Ages 7–12.\nBHC\nSeries\nThe Immortals introduces Blood Born by Shelley Wilson (May 23, $22.99, ISBN 978-1-64397-340-1), ages 14–18. And The Morgalla Chronicles presents Diary of a Lonely Demon by Jon David (Feb. 21, $23.99, ISBN 978-1-64397-204-6), ages 14–18.\nBlack Dog & Leventhal\nSeries\nA Child’s Introduction adds A Child’s Introduction to Pride: The Inspirational History and Culture of the LGBTQIA+ Community by Sarah Prager, illus. by Caitlin O’Dwyer (May 2, $21.99, ISBN 978-0-7624-8191-0), ages 8–12.\nBloomsbury\nGrandpas Are the Greatest by Ben Faulks (May 16, $18.99, ISBN 978-1-5476-1230-7) showcases the special bond between grandfathers and grandchildren. Ages 3–6.\nZap! Clap! Boom! The Story of a Thunderstorm by Laura Purdie Salas, illus. by Elly MacKay (Mar. 28, $18.99, ISBN 978-1-5476-0225-4), explains the science of a thunderstorm in verse. Ages 3–6.\nOut of the Blue by Robert Tregoning, illus. by Stef Murphy (May 30, $18.99, ISBN 978-1-5476-1239-0). A boy finds the courage to share his true favorite color with his father in this celebration of being yourself. Ages 3–7.\nBe Wild, Little One by Olivia Hope, illus. by Daniel Egnéus (Apr. 11, $18.99, ISBN 978-1-5476-1126-3), pays tribute to the magic in our world and the wildness in each of us. Ages 4–8.\nWhen Sea Becomes Sky by Gillian McDunn (Feb. 28, $16.99, ISBN 978-1-5476-1085-3). In this tale inspired by McDunn’s family history, siblings discover an underwater statue and try to ascertain why it’s there. Ages 8–11.\nThe Worlds We Leave Behind by A.F. Harrold, illus. by Levi Pinfold (Feb. 21, $17.99, ISBN 978-1-5476-1095-2). A boy struggles with accepting his mistakes in this story about facing down monsters: in the darkness, in our friends, and in ourselves. Ages 9–12.\nNo Perfect Places by Steven Salvatore (May 30, $19.99, ISBN 978-1-5476-1107-2). Twins navigate grief and life-altering secrets after their father is incarcerated and then suddenly dies in prison. Ages 12–18.\nPlanning Perfect by Haley Neil (Feb. 14, $17.99, ISBN 978-1-5476-0749-5). An asexual teen finds a vineyard to host her mother’s wedding and explores her newfound feelings for the girl whose family owns it. Ages 12–18.\nAll That Shines by Ellen Hagan (July 11, $19.99, ISBN 978-1-5476-1021-1). In this novel in verse, a Kentucky teen explores a new life, identity, and relationships after her family goes bankrupt. Ages 13–18.\nAll That’s Left to Say by Emery Lord (July 18, $19.99, ISBN 978-1-68119-941-2). This story exploring grief centers on a teen who seeks to learn who gave her cousin the pills that caused her to overdose. Ages 13–18.\nSecret of the Moon Conch by David Bowles and Guadalupe García McCall (May 16, $19.99, ISBN 978-1-5476-0989-5). A modern-day teenage girl and a Tenochtitlan soldier boy from the 1500s communicate across centuries as they fight to survive in their worlds and fall in love. Ages 13–18.\nShe Is a Haunting by Trang Thanh Tran (Feb. 28, $18.99, ISBN 978-1-5476-1081-5). A Vietnamese teen tries to save her father and sister from the dark forces living in the house they’re working to restore. Ages 13–18.\nSing Me to Sleep by Gabi Burton (June 27, $19.99, ISBN 978-1-5476-1037-2). A siren must choose between protecting her family or following her heart in a kingdom where her very existence is illegal. Ages 13–18.\nIf Tomorrow Doesn’t Come by Jen St. Jude (May 9, $19.99, ISBN 978-1-5476-1136-2). With an asteroid due to destroy Earth within nine days, a queer teen struggling with depression learns to find hope. Ages 14–18.\nRemind Me to Hate You Later by Lizzy Mason (Feb. 28, $17.99, ISBN 978-1-5476-0918-5). Two friends of a girl who died by suicide star in this novel about social media pressures and grief. Ages 14–18.\nYou’re Not Supposed to Die Tonight by Kalynn Bayron (June 20, $19.99, ISBN 978-1-5476-1154-6). A teen’s dream summer job at Camp Mirror turns terrifying when her peers start disappearing. Ages 14–18.\nSeries\nBig Bright Feelings welcomes Milo’s Monster by Tom Percival (Feb. 7, $17.99, ISBN 978-1-5476-1097-6), ages 4–7. Wolfboy faces the Grumble Monster in Wolfboy Is Scared by Andy Harkness (July 11, $18.99, ISBN 978-1-5476-0445-6), ages 4–8. And Phil Stamper’s Golden Boys concludes with Afterglow (Feb. 7, $18.99, ISBN 978-1-5476-0738-9), ages 13–18.\nBlue River\nSeries\nAll About... picks up All About Margaret Hamilton by Tamra Orr, illus. by Moriah McReynolds (July 20, $6.99 paper, ISBN 978-1-68157-136-2); and All About the Moon Landing by Chris Edwards, illus. by Claire Wagoner (July 20, $6.99 paper, ISBN 978-1-68157-139-3), ages 9–13.\nBold Strokes\nA Talent Within by Suzanne Lenoir (June 13, $15.95 paper, ISBN 978-1-63679-423-5). In a world controlled by religion, magic, and men, two girls of different backgrounds forge their paths to adventure and love. Ages 13–18.\nBOOm Studios\nMech Cadets: Book One by Greg Pak, illus. by Takeshi Miyazawa (May 23, $24.99, ISBN 978-1-68415-917-8), opens a series about giant aliens who help Sky Corps Academy cadets keep Earth safe. Ages 11–14.\nboom studios/Archaia\nFlavor Girls by Loïc Locatelli-Kournwsky (Mar. 21, $24.99, ISBN 978-1-68415-889-8). The Flavor Girls hone their sacred fruit powers to defend the earth from impending destruction. Ages 14–up.\nBoom Studios/KaBOOM\nORCS! The Curse by Christine Larsen (Mar. 30, $16.99, ISBN 978-1-68415-890-4). After heroic ORCS have a party to celebrate their return from traveling, a failed prank unleashes something ancient and evil. Ages 8–14.\nBoxer\n10 Cats by Emily Gravett (May 2, $16.99, ISBN 978-1-914912-58-0). Buckets of paint quickly turn playful kittens—and their sleeping mother—into works of art. Ages 3–5.\nBallet Kitty by Bernette Ford, illus. by Sam Williams (Apr. 4, $14.99, ISBN 978-1-914912-55-9). Ballet Kitty finds a way to have fun without her missing ballet slippers. Ages 3–6.\nBig Book of Animals (Apr. 4, $17.99, ISBN 978-1-912757-93-0) and Big Book of Dinosaurs (Apr. 4, $17.99, ISBN 978-1-912757-90-9) by Harriet Blackford, illus. by Britta Teckentrup. These oversize volumes compile facts and images of numerous species of animals; and dinos. Ages 3–6.\nNature’s Treasures of North America by Alison Limentani, illus. by Katie Putt (Apr. 4, $17.99, ISBN 978-1-912757-97-8), showcases various habitats of North America and the animals that live there. Ages 4–7.\nA Year of Good News by Martin Smatana (Apr. 25, $19.99, ISBN 978-1-914912-49-8). This antidote to bad news stories celebrates the good things in life. Ages 7–12.\nDuckling, Duckling Peekaboo (May 2, $10.99 board book, ISBN 978-1-914912-78-8) and Puppy, Puppy Peekaboo (May 2, $10.99 board book, ISBN 978-1-914912-77-1) by Grace Habib. Animals play a favorite game in these books featuring pull mechanisms and a mirror. Ages up to 2.\nAnimal Portraits by Lucie Brunellière (Apr. 4, $19.99, ISBN 978-1-914912-47-4). This large-format book rounds up images of a variety of critters. Ages up to 3.\nMixed-Up Construction Vehicles (June 6, $12.99 board book, ISBN 978-1-914912-38-2) and Mixed-Up Emergency Vehicles (June 6, $12.99 board book, ISBN 978-1-914912-76-4) by Spencer Wilson. These board books with split pages encourage kids to make their own vehicles by mixing the top and bottom halves. Ages up to 3.\nMy First Book of Fruit (Mar. 7, $8.99 board book, ISBN 978-1-914912-42-9) and My First Book of Veggies (Mar. 7, $8.99 board book, ISBN 978-1-914912-40-5) by Fred Wolter share images of the insides and outsides of various produce. Ages up to 3.\nThe Rainbow Snail by Karin Åkesson (Feb. 21, $17.99, ISBN 978-1-914912-28-3). The title character introduces the colors of the rainbow. Ages up to 3.\nSparkle! Sparkle! I’m a Unicorn! by Jo Lodge (Apr. 18, $9.99 board book, ISBN 978-1-914912-36-8) provides an interactive look at unicorns and princesses. Ages up to 3.\nWhose Ears? (Mar. 7, $14.99, ISBN 978-1-914912-25-2) and Whose Feet? (Mar. 7, $14.99, ISBN 978-1-914912-26-9). by Sam Williams, illus. by Ekaterina Trukhan. Kids follow visual clues to match body parts to the appropriate animals. Ages up to 3.\nBig Red Fire Truck (May 2, $12.99 board book, ISBN 978-1-914912-16-0) and Big Silver Spaceship (May 2, $12.99 board book, ISBN 978-1-914912-17-7) by Ken Wilson-Max, paper engineering by Jo Lodge, are interactive reimaginings of these 1990s books. Ages up to 5.\nBritannica\nSeries\nFactopia! continues with Animal Factopia! Follow the Trail of 400 Beastly Facts by Julie Beer, illus. by Andy Smith (Apr. 4, $14.99, ISBN 978-1-913750-73-2), ages 8–12.\nBrown\nAnnabelle Bee and the Butterfly Tree by Debra Raso O’Connor, illus. by Stephen Lomazzo (Apr. 4, $16.99, ISBN 978-1-61254-586-8). When her mother announces that they must move, will a honey bee have to leave her butterfly friend behind? Ages 4–8.\nBing! Bang! Chugga! Beep! by Bill Martin Jr. and Michael Sampson, illus. by Nathalie Beauvois (Apr. 25, $18.99, ISBN 978-1-61254-599-8). Written to the cadence of “This Old Man,” this tale is an ode to a beloved auto. Ages 4–8.\nPoppy Through the Paintings by Julie Lucht, illus. by Dan McGeehan (Apr. 18, $16.99, ISBN 978-1-61254-590-5). On a school field trip at the museum, Poppy gets so invested in the art that she literally falls into it. Ages 7–10.\nSeries\nNew Tiny Team Books by John Biemer, illus. by Cynthia Meadows, are Baby Gator (June 13, $12.95 board book, ISBN 978-1-61254-561-5) and Baby Longhorns (May 9, $12.95 board book, ISBN 978-1-61254-450-2), ages 2–4. And Let’s Play introduces a classic Korean game in Let’s Play Gongghidol by Im Seo-Ha, illus. by Jang Joon-Young (May 9, $16.99, ISBN 978-1-61254-582-0), ages 6–10.\nBushel & Peck\nToo Many Hugs by Yvonne Pearson, illus. by Maria Burobkina (Apr. 11, $17.99, ISBN 978-1-63819-148-3). In this tale about the importance of consent, a boy addresses the need for respect and personal boundaries. Ages 3–6.\nWitness Trees: Historic Moments and the Trees Who Watched Them Happen by Ryan G. Van Cleave (Apr. 4, $19.99, ISBN 978-1-63819-125-4). Told in verse, this story of trees from around the world that witnessed historic events includes a map of sites one can visit today. Ages 6–9.\nMarkets: A World to Discover by Josep Sucarrats, illus. by Miranda Sofroniou, foreword by Ferran Adrià (Mar. 7, $19.99, ISBN 978-1-63819-130-8), discusses the origin and importance of markets throughout the world and where food comes from. Ages 8–11.\nThe Honey Jar by Joan Schoettler (Mar. 7, $16.99, ISBN 978-1-63819-154-4). Based on a true story, this book tells of a boy who returns to Armenia to find his sister, who was left behind when the family fled the genocide. Ages 8–12.\nExoplanets: A Guide to the Worlds Outside Our Solar System (Apr. 4, $18.99, ISBN 978-1-63819-098-1) explores exoplanets that exist outside our solar system. Ages 9–12.\nSeries\nTruck Tales rolls along with Cylinderella (June 6, $9.99 board book, ISBN 978-1-63819-137-7), Hansel and Diesel (June 6, $9.99 board book, ISBN 978-1-63819-136-0), and The Three Little Rigs (June 6, $9.99 board book, ISBN 978-1-63819-138-4) by David and Stephanie Miles, illus. by Sara Ugolotti, ages 3–5. Two titles by Gina Perry join Mini Doodles: Let’s Draw Dinosaurs (Apr. 4, $7.99 paper, ISBN 978-1-63819-202-2) and Let’s Draw Magical Creatures (Apr. 4, $7.99 paper, ISBN 978-1-63819-161-2), ages 4–8. And Two-dle Doodle releases Draw with Grandma (Feb. 7, $11.99 paper, ISBN 978-1-63819-157-5) and Draw with Grandpa (Feb. 7, $11.99 paper, ISBN 978-1-63819-158-2) by Stephanie Miles, ages 4–10.\nThe Good Guys Agency adds Play on Like Ludwig van Beethoven (May 9, $14.99, ISBN 978-1-63819-081-3) and Sweet Like Milton Hershey (Mar. 7, $14.99, ISBN 978-1-63819-082-0) by Nick Esposito, illus. by Ricardo Tokumoto, ages 6–10. Little Library of Languages checks out My First Book of Mandarin: 800+ Words and Pictures! by Timothy Tsai (Feb. 7, $12.99, ISBN 978-1-63819-046-2) and My First Book of Spanish: 800+ Words & Pictures by Tony Pesqueira (June 6, $16.99 paper, ISBN 978-1-63819-153-7), ages 7–12. And Little Library of Natural History acquires The Little Book of Flowers by Christin Farley (Mar. 7, $16.99, ISBN 978-1-63819-155-1) and The Little Book of North American Trees (Mar. 7, $16.99, ISBN 978-1-63819-156-8) by Christin Farley, ages 7–12.\nBushel & Peck/Milk + Cookies\nThe Dragonfire Journals by Nicolas Jeter (July 11, $14.99, ISBN 978-1-63819-159-9). In this series starter, instead of attending Battle School to become a knight, magic-hating Ned is sent to Magic School. Ages 7–10.\nStormbringer by Greg Boden (June 5, $16.99, ISBN 978-1-63819-160-5) launches a series in which Cinder, a mortal abandoned at birth who’s been shuffled through the System, again faces expulsion from school. Ages 10–18.\nBushel & Peck/Moonshower\nBody Music by Jane Yolen and Ryan G. Van Cleave, illus. by Luis San Vicente (June 6, $18.99, ISBN 978-1-63819-201-5), compiles 15 poems about the sounds of the human body, plus scientific facts. Ages 4–8.\nThe Museum on the Moon: The Curious Objects on the Lunar Surface by Irene Latham (May 2, $19.99, ISBN 978-1-63819-203-9) showcases items left on the moon since the first humans landed in 1969. Ages 8–12.\nSeries\nThe Illustrated Poets Collection welcomes The Illustrated Edgar Allan Poe, edited by Ryan G. Van Cleave (Mar. 7, $18.99, ISBN 978-1-63819-146-9), ages 7–10.\nCamCat\nHunterland by Dana Claire (Feb. 7, $19.99, ISBN 978-0-7443-0734-4). Liam, whose monster-hunting family visits a town where a slew of teachers have been murdered, teams up with a local girl to solve the case. Ages 13–18.\nOur Vengeful Souls by Kristi McManus (June 6, $19.99, ISBN 978-0-7443-0891-4). In this villain origin story for “The Little Mermaid,” a cursed mermaid seeks revenge against the brother who betrayed her. Ages 13–18.\nVaulting Through Time by Nancy McCabe (July 25, $19.99, ISBN 978-0-7443-0936-2). A teenage gymnast catapults through time to stop a fellow time traveler who may prevent her from being born. Ages 13–18.\nSeries\nThe Frean Chronicles adds Queen’s Catacombs by Jordan H. Bartlett (Mar. 14, $19.99, ISBN 978-0-7443-0776-4), ages 13–18.\nCandlewick\nThe Dream Train: Poems for Bedtime by Sean Taylor, illus. by Anuska Allepuz (Mar. 14, $19.99, ISBN 978-1-5362-2834-2), collects 30 bedtime poems. Ages 2–5.\nJazzy in the Jungle by Lucy Cousins (Apr. 4, $12.99 board book, ISBN 978-1-5362-2855-7). A lemur and its mother play hide-and-seek in this book with die-cuts and shaped pages. Ages 2–5.\nLet’s Go Puddling! by Emma Perry, illus. by Claire Alexander (Apr. 25, $17.99, ISBN 978-1-5362-2849-6). On a rainy day, three families gather in front of their apartment building to splash in puddles. Ages 2–5.\nRuffles and the New Green Thing (June 6, $17.99, ISBN 978-1-5362-2982-0). When a reluctant toddler finally tries the new green thing in his bowl, he discovers that broccoli is delicious. Ages 2–5.\nSpecial Delivery: A Book’s Journey Around the World by Polly Faber, illus. by Klas Fahlén (Apr. 4, $17.99, ISBN 978-1-5362-2985-1), tracks the book-making process through printing, shipping, selling, and reading. Ages 2–5.\nMolly, Olive, and Dexter Play Hide-and-Seek by Catherine Rayner (July 4, $17.99, ISBN 978-1-5362-2841-0). After a hare teaches her owl and fox pals how to play her favorite game, they hide a bit too well. Ages 3–5.\nAnimal Atlas by Ingela P. Arrhenius (Apr. 4, $19.99, ISBN 978-1-5362-3123-6). This introduction to animals on each continent features interactive flaps and pop-ups. Ages 3–7.\nAs Brave as a Lion by Erika Meza (May 16, $18.99, ISBN 978-1-5362-2508-2). In this friendship tale about overcoming fears, a child and her lion are there for each other when it matters. Ages 3–7.\nDakota Crumb and the Secret Bookshop: A Tiny Treasure Hunt by Jamie Michalak, illus. by Kelly Murphy (May 2, $17.99, ISBN 978-1-5362-2330-9). The mouse heroine of Dakota Crumb: Tiny Treasure Hunter is recruited to help her cousin locate a rare and priceless book. Ages 3–7.\nEarnest Sandpiper’s Great Ascent by Timothy Basil Ering (Apr. 18, $18.99, ISBN 978-0-7636-9735-8). When it’s time for three sandpiper siblings to soar, one needs his family’s encouragement to conquer his fears. Ages 3–7.\nThe Fastest Tortoise in Town by Howard Calvert, illus. by Karen Obuhanych (Apr. 11, $18.99, ISBN 978-1-5362-2835-9). A spin on “The Tortoise and the Hare” fable, this story celebrates all that can be accomplished with preparation and self-love. Ages 3–7.\nHave You Seen My Invisible Dinosaur? by Helen Yoon (May 9, $18.99, ISBN 978-1-5362-2625-6). A girl’s special friend goes missing after a bath—or does he? Ages 3–7.\nI Am Not an Octopus by Eoin McLaughlin, illus. by Marc Boutavant (Feb. 14, $18.99, ISBN 978-1-5362-2505-1). A scared octopus finally dares to dip his tentacles into the water in this tale about facing anxiety. Ages 3–7.\nLupe Lopez: Reading Rock Star! by e.E. Charlton-Trujillo and Pat Zietlow Miller, illus. by Joe Cepeda (June 28, $17.99, ISBN 978-1-5362-0955-6). In this sequel to Lupe Lopez: Rock Star Rules!, first grader Lupe has a new goal: to become a Reading Rock Star. Ages 3–7.\nMy First Pop-Up Endangered Animals by Owen Davey (Mar. 21, $18.99, ISBN 978-1-5362-2844-1) portrays 15 endangered species in 3-D illustrations. Ages 3–7.\nPick a Perfect Egg by Patricia Toht, illus. by Jarvis (Feb. 14, $17.99, ISBN 978-1-5362-2847-2). This companion to Pick a Pine Tree and Pick a Pumpkin celebrates Easter. Ages 3–7.\nSari-Sari Summers by Lynnor Bontigao (Apr. 11, $18.99, ISBN 978-1-5362-2614-0). In this ode to the Philippines, Nora finds a way to attract customers to her grandmother’s sari-sari store in a heat wave. Ages 3–7.\nShy Robin and the First Day of School by Jaime Kim (June 13, $17.99, ISBN 978-1-5362-0929-7). A hippo discovers that looking out for a new friend can turn shyness into bravery. Ages 3–7.\nTogether with You by Patricia Toht, illus. by Jarvis (Feb. 14, $17.99, ISBN 978-1-5362-2351-4), relays a story about the love between a grandparent and grandchild. Ages 3–7.\nWild Blue: Taming a Big-Kid Bike by Dashka Slater, illus. by Laura Hughes (Feb. 14, $18.99, ISBN 978-1-5362-1567-0). Kayla summons a cowpoke’s courage to tame her intimidating new bicycle. Ages 3–7.\nWindrush Child: The Tale of a Caribbean Child Who Faced a New Horizon by John Agard, illus. by Sophie Bass (May 16, $18.99, ISBN 978-1-5362-2853-3), recalls the journey made by thousands of Caribbean children and their families who traveled to Britain between 1948 and 1971 as part of the Windrush generation. Ages 3–7.\nElena Rides by Juana Medina (Mar. 14, $9.99, ISBN 978-1-5362-1635-6). Demonstrating childlike persistence, a plucky elephant learns to ride a bike. Ages 4–6.\nSora’s Seashells: A Name Is a Gift to Be Treasured by Helena Ku Rhee, illus. by Stella Lim with Ji-Hyuk Kim (May 9, $17.99, ISBN 978-1-5362-0993-8). In this intergenerational story of kindness and confidence, loss and remembrance, a Korean American girl grapples with who she is and how she fits in. Ages 4–6.\nYou, Me, We: A Celebration of Peace and Community by Arun Gandhi and Bethany Hegedus, illus. by Andrés Landazábal (June 13, $18.99, ISBN 978-1-5362-1744-5). Cowritten by a grandson of Mahatma Gandhi, this guide to cultivating peace underscores that tranquility can be found in us all. Ages 4–6.\nFrom Here to There: A First Book of Maps by Vivian French, illus. by Ya-Ling Huang (May 16, $17.99, ISBN 978-1-5362-2511-2). Anna and her father explore the world of maps in this story encouraging readers to chart their own neighborhoods. Ages 4–7.\nA Bed of Stars by Jessica Love (Apr. 4, $18.99, ISBN 978-1-5362-1239-6) offers a tale of first-time camping, father-child bonding, and feeling at one with the universe. Ages 4–8.\nCool Green: Amazing, Remarkable Trees by Lulu Delacre (Mar. 28, $17.99, ISBN 978-1-5362-2040-7) presents a portrait of the world’s trees, seen through the eyes of a landscaper who loves them—and his granddaughter, who begins to understand why. Ages 4–8.\nEco Girl by Ken Wilson-Max (Mar. 7, $17.99, ISBN 978-1-5362-2809-0). This companion to Astro Girl centers on a girl who becomes an environmental steward to express her love for all things leafy and green. Ages 4–8.\nMommy Time by Monique James-Duncan, illus. by Ebony Glenn (Mar. 28, $17.99, ISBN 978-1-5362-1226-6),\ncaptures the joys—and occasional struggles—of being a stay-at-home parent. Ages 4–8.\nMy Friend, Loonie by Nina LaCour, illus. by Ashling Lindsay (Mar. 28, $18.99, ISBN 978-1-5362-1393-5). This story of connection and loss finds hope in memories after a girl loses her constant companion—a balloon. Ages 4–8.\nOne Tiny Treefrog: A Countdown to Survival by Tony Piedra and MacKenzie Joy (Mar. 8, $19.99, ISBN 978-1-5362-1948-7). Set in Costa Rica, this introduction to frog metamorphosis views this animal’s habitats and predators as it illustrates competition and natural selection. Ages 4–8.\nThe Search for the Giant Arctic Jellyfish by Chloe Savage (June 6, $18.99, ISBN 978-1-5362-2851-9) recounts an Arctic expedition to find this elusive, mysterious creature. Ages 4–8.\nThis Is a Story by John Schu, illus. by Lauren Castillo (Mar. 14, $17.99, ISBN 978-1-5362-0452-0), pays tribute to the myriad ways that books can foster connection and understanding—and empower children. Ages 4–8.\nTwenty Questions by Mac Barnett, illus. by Christian Robinson (Mar. 14, $17.99, ISBN 978-1-5362-1513-7), poses questions that tap into kids’ curiosity and explore where the best questions lead: to stories. Ages 4–8.\nDesert Jungle by Jeannie Baker (May 9, $18.99, ISBN 978-1-5362-2577-8). Baker’s mixed-media art reveals—through one wary boy’s experience—the biodiversity of the Sonoran Desert in Mexico. Ages 5–8.\nGreat White Shark by Claire Saxby, illus. by Cindy Lane (June 6, $18.99, ISBN 978-1-5362-2503-7). A shark heads to warm waters for the sake of her young in this look at one of the ocean’s biggest predators. Ages 5–8.\nA Is for Australian Reefs by Frané Lessac (June 13, $18.99, ISBN 978-1-5362-2830-4) examines the diverse creatures living in reefs along Australia’s shores. Ages 5–8.\nMoving the Millers’ Minnie Moore Mine Mansion: A True Story by Dave Eggers, illus. by Júlia Sardà (June 6, $19.99, ISBN 978-1-5362-1588-5), spins an historical event involving a mansion near an Idaho mine into a “tall-ish true tale” of American ingenuity. Ages 5–8.\nWater: How We Can Protect Our Freshwater by Catherine Barr, illus. by Christiane Engel (Mar. 21, $18.99, ISBN 978-1-5362-2886-1). This call for action tells the story of freshwater around the world and urges us to work together to defend a vital resource. Ages 5–8.\nCloud Babies by Eoin Colfer, illus. by Chris Judge (Apr. 4, $18.99, ISBN 978-1-5362-3107-6). Based on Judge’s family experience with childhood illness, this story aims to comfort kids facing health issues or hardship and to guide those who wish to offer support. Ages 5–9.\nEmperor of the Ice: How a Changing Climate Affects a Penguin Colony by Nicola Davies, illus. by Catherine Rayner (Feb. 14, $18.99, ISBN 978-1-5362-2839-7). In the Antarctic winter, two emperor penguins share the task of keeping their young one alive—and discover how fighting climate change is key to their survival. Ages 5–9.\nSo You Want to Be a Frog by Jane Porter, illus. by Neil Clark (Apr. 25, $18.99, ISBN 978-1-5362-2513-6), rounds up facts about frogs’ origin, life cycle, habits, food preferences, and relatives around the world. Ages 5–9.\nThe Tree and the River by Aaron Becker (Mar. 14, $18.99, ISBN 978-1-5362-2329-3) is a wordless time-lapse reimagining of human civilization and a meditation on the relationship between nature and humankind. Ages 5–9.\nChristo and Jeanne-Claude Wrap the World: The Story of Two Groundbreaking Environmental Artists by G. Neri, illus. by Elizabeth Haidle (Apr. 18, $18.99, ISBN 978-1-5362-1661-5), profiles the husband-and-wife artists and their innovative collaboratorations. Ages 6–9.\nOne World: 24 Hours on Planet Earth by Nicola Davies, illus. by Jenni Desmond (Mar. 14, $18.99, ISBN 978-1-5362-2613-3). This trip around the globe pays tribute to the natural world and emphasizes its fragility. Ages 6–9.\nThe Skull: A Tyrolean Folktale by Jon Klassen (July 11, $19.99, ISBN 978-1-5362-2336-1). After escaping from danger, a brave girl becomes lost in the dark forest, where a house containing a skull beckons. Ages 6–9.\nHow Do You Spell Unfair? MacNolia Cox and the National Spelling Bee by Carole Boston Weatherford, illus. by Frank Morrison (Apr. 11, $18.99, ISBN 978-1-5362-1554-0), profiles this girl who, as an eighth grader in 1936, became the first African American to win the Akron, Ohio spelling bee. Ages 7–10.\nThe Tree Book by Nosy Crow, illus. by Hannah Alice (Mar. 7, $15.99 board book, ISBN 978-1-5362-2983-7). This book with see-through acetate pages reveals how trees grow and change throughout the seasons. Ages 7–10.\nWhere I Live: Poems About My Home, My Street, and My Town by Paul B. Janeczko, illus. by Hyewon Yum (Mar. 14, $18.99, ISBN 978-1-5362-0094-2). Poems by a diverse group of contributors celebrate the places where we live: our homes, streets, and towns. Ages 7–10.\nElf Dog and Owl Head by M.T. Anderson, illus. by Junyi Wu (Apr. 11, $18.99, ISBN 978-1-5362-2281-4), recounts the magical adventure of a boy and the dog who leads him to ancient secets folded into the forest. Ages 8–12.\nThe Girl from Earth’s End by Tara Dairman (Mar. 14, $18.99, ISBN 978-1-5362-2480-1). Gifted gardener Henna embarks from her island home to search for the plant that might save her father’s life. Ages 8–12.\nHoops by Matt Tavares (Mar. 14, $22.99, ISBN 978-1-5362-0136-9). Inspired by a true story, this graphic novel showcases the ongoing struggle for gender equality in high school sports. Ages 8–12.\nSoccer Queens by Charles R. Smith (Apr. 11, $15.99, ISBN 978-1-5362-2533-4) spotlights the talent of top female soccer professionals and pays homage to the legendary U.S. World Cup team of 1999. Ages 8–12.\nWhere the Water Takes Us by Alan Barillaro (May 9, $18.99, ISBN 978-1-5362-2454-2). Ava learns that she must come to terms with things she can’t change—and take responsibility for those she can. Ages 8–12.\nCalling the Moon: 16 Period Stories from BIPOC Authors, edited by Aida Salazar and Yamile Saied Méndez (Mar. 28, $22.99, ISBN 978-1-5362-1634-9), collects short fiction and poems on the topic of menstruation, written by authors who are Black, Indigenous, and/or people of color. Ages 10–18.\nHarvest House by Cynthia Leitich Smith (Apr. 11, $19.99, ISBN 978-1-5362-1860-2). This follow-up to Hearts Unbroken brings readers to the literary crossroads of contemporary realism and mystery. Ages 12–18.\nAb(solutely) Normal: Short Stories That Smash Mental Health Stereotypes, edited by Nora Shalaway Carpenter and Rocky Callen (Apr. 11, $24.99, ISBN 978-1-5362-2414-6). Channeling their own experiences, 16 authors subvert mental-health stereotypes in this story collection. Ages 14–18.\nThe Family Fortuna by Lindsay Eagar (Mar. 7, $19.99, ISBN 978-0-7636-9235-3). Performing as the popular Bird Girl in her family’s circus, Avita feeds on the shrieks and fear that her act incites. Ages 14–18.\nFirst-Year Orientation, edited by Lauren Gibaldi and Eric Smith (Apr. 4, $19.99, ISBN 978-1-5362-2449-8), is an anthology of linked short stories about the first days of college, featuring works by 16 authors. Ages 14–18.\nWork with What You Got:\nA Memoir by Zion Clark and James S. Hirsch (Apr. 11, $18.99, ISBN 978-1-5362-2421-4). This memoir of elite wheelchair racer and wrestler Clark recounts his childhood adversity, perseverance, and self-invention. Ages 14–18.\nSeries\nWhere’s The… releases Where’s the Cat? by Nosy Crow, illus. by Ingela P. Arrhenius (Mar. 7, $9.99 board book, ISBN 978-1-5362-2984-4), ages up to 2. Unlikely pals Kitty and Cat star in Opposites Attract by Mirka Hokkanen (Apr. 4, $18.99, ISBN 978-1-5362-2367-5), ages 2–5. Animal Heroes debuts with Supermoms! by Heather Lang and Jamie Harper, illus. by Harper (Mar. 7, $17.99, ISBN 978-1-5362-1797-1), ages 3–7. I Am welcomes a ravenous squirrel in I Am Hungry by Michael Rosen, illus. by Robert Starling (July 11, $17.99, ISBN 978-1-5362-2510-5), ages 3–7. Judy Moody and Friends return in Izzy Azumi, F.D.O. (Future Dog Owner) by Megan McDonald, illus. by Erwin Madrid (Mar. 14, $14.99, ISBN 978-1-5362-2472-6), ages 4–6. And Then Comes continues with And Then Comes School by Tom Brenner, illus. by Jen Hill (June 13, $17.99, ISBN 978-1-5362-0913-6), ages 4–8. And See the Cat offers See the Ghost: Three Stories About Things You Cannot See by David LaRochelle, illus. by Mike Wohnoutka (July 25, $9.99, ISBN 978-1-5362-1982-1), ages 4–8.\nClassroom mice Fergus and Zeke are back in Fergus and Zeke for President by Kate Messner, illus. by Heather Ross (May 23, $15.99, ISBN 978-1-5362-1831-2), ages 5–8. Princess in Black gains The Princess in Black and the Prince in Pink by Shannon Hale and Dean Hale, illus. by LeUyen Pham (Apr. 11, $14.99, ISBN 978-1-5362-0978-5), ages 5–8. Bear and Bird make a chapter-book appearance in The Picnic and Other Stories by Jarvis (May 9, $15.99, ISBN 978-1-5362-2832-8), ages 5–9. Book Buddies return in Dazzle Makes a Wish by Cynthia Lord, illus. by Stephanie Graegin (Mar. 21, $14.99, ISBN 978-1-5362-1356-0), ages 6–9. And Shermy and Shake introduces two very different new friends in Shermy and Shake, the Not So Nice Neighbor by Kirby Larson, illus. by Shinji Fujioka (May 9, $15.99, ISBN 978-1-5362-1942-5), ages 6–9.\nStink becomes a sleuth in Superhero Superfan by Megan McDonald, illus. by Peter H. Reynolds (Mar. 7, $14.99, ISBN 978-1-5362-1507-6), ages 6–9. The World of Emily Windsnap picks up The Truth About Aaron by Liz Kessler, illus. by Joanie Stone (Apr. 11, $14.99, ISBN 978-1-5362-1524-3), ages 6–9. Crimson Twill stars in Witch in the Country by Kallie George, illus. by Birgitta Sif (July 11, $15.99, ISBN 978-1-5362-1464-2), ages 7–9. Sci-Ku Haiku issues Trees: Haiku from Roots to Leaves by Sally M. Walker, illus. by Angela McKay (Mar. 14, $19.99, ISBN 978-1-5362-1550-2), ages 7–9. Too Small Tola reappears in Too Small Tola Gets Tough by Atinuke, illus. by Onyinwe Iwu (Mar. 21, $15.99, ISBN 978-1-5362-2946-2), ages 7–9. And Clarice Bean returns in Clarice Bean, Scram! The Story of How We Got Our Dog by Lauren Child (Apr. 11, $18.99, ISBN 978-1-5362-3112-0), ages 8–12.\nTitles in Spanish\nMi perro solo habla Español (My Dog Just Speaks Spanish) by Andrea Cáceres (May 9, $17.99, ISBN 978-1-5362-2988-2), ages 2–5; Lupe Lopez: ¡Estrella de lectura! (Lupe Lopez: Reading Rock Star!) by e.E. Charlton-Trujillo and Pat Zietlow Miller, illus. by Joe Cepeda (June 13, $17.99, ISBN 978-1-5362-2987-5); and Valiente como un León (As Brave as a Lion) by Erika Meza (May 16, $18.99, ISBN 978-1-5362-2507-5), ages 3–7; Elena monta en bici (Elena Rides) by Juana Medina (Mar. 14, $9.99, ISBN 978-1-5362-1641-7), age 4–6; and Verde Fresco: Árboles asombrosos y extraordinarios (Cool Green: Amazing, Remarkable Trees) by Lulu Delacre (Mar. 28, $17.99, ISBN 978-1-5362-2986-8), ages 4–8.\nCandlewick Entertainment\nDance with Oti: The Bird Jive by Oti Mabuse, illus. by Samara Hardy (June 6, $17.99, ISBN 978-1-5362-2500-6). Kids learn the 10-step Bird Jive in this book by a winner of British TV dance show Strictly Come Dancing. Ages 3–7.\nCandlewick Studio\nWhose Dinosaur Bones Are Those? by Chihiro Takeuchi (May 9, $17.99, ISBN 978-1-5362-3069-7). In this guessing-game follow-up to Whose Bones Are Those?, clues hint at which dinosaur’s bones are pictured. Ages 3–5.\nArthur, the Always King by Kevin Crossley-Holland, illus. by Chris Riddell (Apr. 11, $29.99, ISBN 978-1-5362-1265-5). This collection of Arthurian lore spans from the king’s conception to his final battle. Ages 10–18.\nCandlewick/Big Picture\nHow Old Is a Whale? Animal Life Spans from the Mayfly to the Immortal Jellyfish by Lily Murray, illus. by Jesse Hodgson (Mar. 7, $21.99, ISBN 978-1-5362-2975-2). This examination of animal life cycles portrays creatures in their natural habitats. Ages 6–9.\nFrom Shore to Ocean Floor: The Human Journey to the Deep by Gill Arbuthnott, illus. by Christopher Nielsen (May 2, $24.99, ISBN 978-1-5362-2974-5), tells the story of ocean exploration, relaying how humans progressed from building the first boats to discovering the secrets of the deep. Ages 8–12.\nSeries\nAnimals Everywhere spotlights Birds Everywhere by Camilla de La Bedoyere, illus. by Britta Teckentrup (Mar. 7, $17.99, ISBN 978-1-5362-2973-8), ages 6–9.\nCandlewick/MITeen\nShare Better and Stress Less: A Guide to Thinking Ecologically About Social Media by Whitney Phillips and Ryan Milner (Mar. 14, $19.99, ISBN 978-1-5362-2874-8). Two media experts explore how information pollution affects our online networks—and our well-being—and how to maximize a positive impact. Ages 14–18.\nCandlewick/Templar\nBe Happy: A Little Book of Mindfulness by Maddy Bard, illus. by Emma Dodd (Mar. 7, $14.99, ISBN 978-1-5362-2976-9). Two dogs share tips on how to stay present and positive. Ages 3–6.\nA Field Guide to Leaflings: Guardians of the Trees by Owen Churcher, illus. by Niamh Sharkey (Mar. 21, $17.99, ISBN 978-1-78342-522-8), explains how trees around the world breathe, make food, and support many forms of life. Ages 5–7.\nSeries\nLittle Life Cycles gains Bug (Mar. 7, $9.99 board book, ISBN 978-1-5362-3022-2) and Frog (Mar. 7, $9.99 board book, ISBN 978-1-5362-3023-9) by Maggie Li, ages 2–5.\nCandlewick/Walker Books US\nTalia’s Codebook for Mathletes by Marissa Moss (June 13, $19.99, ISBN 978-1-5362-1802-2). In this tale told in comics diary form, can math-loving Talia crack the code of being cool in middle school? Ages 8–12.\nThe Book That No One Wanted to Read by Richard Ayoade, illus. by Tor Freeman (Mar. 14, $17.99, ISBN 978-1-5362-2216-6). A book that no one read (until now) tells its story—and wants readers to do likewise. Ages 10–14.\nNever Trust a Gemini by Freja Nicole Woolf (May 9, $19.99, ISBN 978-1-5362-3054-3). Cat is ready to fall in love, but her crush is on her best friend Alison, who’s more interested in chatting with boys. Ages 12–18.\nDifferent for Boys by Patrick Ness, illus. by Tea Bendix (Mar. 14, $18.99, ISBN 978-1-5362-2889-2). In this novel about teen sexuality, friendship, and romance, Anthony wonders if it’s different for boys who like boys. Ages 14–18.\nSeries\nThe Legends of Eerie-on-Sea picks up Festergrimm by Thomas Taylor, illus. by Tom Booth (Apr. 25, $19.99, ISBN 978-1-5362-2742-0), ages 8–12. Loki: A Bad God’s Guide to Taking the Blame by Louie Stowell (May 9, $15.99, ISBN 978-1-5362-2630-0) is a new Loki: A Bad God’s Guide, ages 9–12. Welcome to Your Body continues with Welcome to Consent: How to Say No, When to Say Yes, and How to Be the Boss of Your Body by Yumi Stynes and Melissa Kang, illus. by Jenny Latham (Mar. 28, $17.99, ISBN 978-1-5362-2617-1), ages 10–14. And The Gifts presents Every Gift a Curse by Caroline O’Donoghue (May 9, $19.99, ISBN 978-1-5362-2840-3), ages 14–18.\nCardinal Rule\nHide and Shh! A Not-So-Sneaky Sister Story About Inclusion by Christina Dendy, illus. by Nathalia Takeyama (Apr. 1, $17.95, ISBN 979-89-85805-13-0). When her efforts to get into the big kids’ game backfire, a girl with Down Syndrome realizes she might need to change some of her own behaviors—and shows her sister and friends there is more than one way to play. Ages 5–7.\nCassava Republic\nObioma Plays Football by Chika Unigwe, illus. by Chinyere Okoroafor (Feb. 7, $16.95, ISBN 978-1-913175-37-5). When Obioma moves to a new city, she finds a way to make friends and play football—and to avoid being known as just “the girl in the wheelchair.”Ages 3–6.\nBirds of Our Land by Virginia W. Dike (Feb. 21, $16.95, ISBN 978-1-913175-43-6). This guide to 25 West African birds features info about their habitats and names in African languages and includes activities. Ages 7–10.\nCharlesbridge\nWombat by Philip Bunting (June 13, $17.99, ISBN 978-1-62354-391-4). Laced with wordplay, this tale introduces wombats, twobats, threebats, and morebats. Ages 2–5.\nNot a Monster by Claudia Guadalupe Martínez, illus. by Laura González (May 9, $17.99, ISBN 978-1-62354-303-7). This story featuring Spanish words explains the life cycle of amphibian axolotl, of Minecraft fame. Ages 3–7.\nI Am Made of Mountains by Alexandra Hinrichs, illus. by Vivian Mineker (May 16, $18.99, ISBN 978-1-62354-260-3), explores the diverse landscapes of national parks across the U.S. Ages 4–7.\nGlitter Everywhere: Where It Came From, Where It’s Found & Where It’s Going by Chris Barton, illus. by Chaaya Prabhat (June 27, $19.99, ISBN 978-1-62354-252-8), focuses on the good, bad, and shiny of all things glitter. Ages 5–8.\nThe Lobster Lady by Alexandra Hinrichs, illus. by Jamie Hogan (May 23, $17.99, ISBN 978-1-62354-393-8), profiles 102-year-old Virginia Oliver, who is the oldest known person lobstering in Maine. Ages 5–8.\nOur Roof Is Blue by Sara E. Echenique, illus. by Ashley Vargas (Apr. 11, $17.99, ISBN 978-1-62354-233-7). Two siblings work to recover and rebuild their home in Puerto Rico after Hurricane Irma hits. Ages 5–8.\nNo World Too Big: Young People Fighting Global Climate Change by Lindsay H. Metcalf et al., illus. by Jeanette Bradley (Mar. 14, $18.99, ISBN 978-1-62354-313-6). The creators of No Voice Too Small here honor young activists who have impacted climate change around the world. Ages 5–9.\nStand as Tall as the Trees: How an Amazonian Community Protected the Rain Forest by Patricia Gualinga and Laura Resau, illus. by Vanessa Jaramillo (July 18, $17.99, ISBN 978-1-62354-236-8), relays how Gualinga, an activist in the Amazon, helped other Indigenous communities to protect their sacred lands and forests. Ages 6–9.\nGlaciers Are Alive by Debbie S. Miller, illus. by Jon Van Zyle (May 9, $17.99, ISBN 978-1-62354-361-7), reveals the wonders of glaciers, the wildlife that calls them home, and the importance of preserving them. Ages 8–12.\nThe Remarkable Rescue at Milkweed Meadow by Elaine Dimopoulos, illus. by Doug Salati (May 16, $17.99, ISBN 978-1-62354-333-4). Young rabbits star in a tale of friendship, community, and doing what’s right. Ages 8–12.\nCaptain Skidmark Dances with Destiny by Jennifer A. Irwin (Apr. 4, $17.99, ISBN 978-1-62354-254-2). Will, who hates hockey and loves dancing, navigates middle school, bullies, and his father’s expectations. Ages 10–14.\nMonster vs. Boy by Karen Krossing (July 11, $17.99, ISBN 978-1-62354-356-3). A boy befriends the benign monster who lives in his closet in this story about unlikely friendships, facing fears, and mental health. Ages 10–14.\nSeries\nStorytelling Math adds A Beautiful House for Birds (Mar. 14, $7.99 board book, ISBN 978-1-62354-347-1) and Where Are the Eggs? (Mar. 14, $7.99 board book, ISBN 978-1-62354-346-4) by Grace Lin, ages up to 2; and Lia & Luis: Puzzled! by Ana Crespo, illus. by Giovana Medeiros (Mar. 7, $16.99, ISBN 978-1-62354-322-8); and Tyson, el pequeñito/Too-Small Tyson by Janay Brown-Wood, illus. by Anastasia Williams (Apr. 11, $16.99, ISBN 978-1-62354-215-3), ages 3–6. And Playdate! (With Bear, Too?) by Jamie Michalak, illus. by Katie Mazeika (Mar. 7, $8.99 board book, ISBN 978-1-62354-287-0), joins Chicken Soup for the Soul Babies, ages up to 3.\nLeo Can! welcomes Leo at the Park by Anna McQuinn, illus. by Ruth Hearson (June 6, $8.99 board book, ISBN 978-1-62354-340-2), ages up to 3. Lola Reads continues with Lola’s Nana-Bibi Comes to Visit by Anna McQuinn, illus. by Rosalind Beardshaw (Apr. 11, $16.99, ISBN 978-1-62354-335-8), ages 2–5. All About Noticing picks up All About Nothing by Elizabeth Rusch, illus. by Elizabeth Goss (Apr. 4, $17.99, ISBN 978-1-62354-352-5), ages 4–8. Hands-On Science offers Matter by Lola M. Schaefer, illus. by Druscilla Santiago (July 11, $16.99, ISBN 978-1-62354-243-6), ages 4–8. And Every Day with April & Mae issues three new titles by Megan Dowd Lambert: April & Mae and the Animal Shelter: The Thursday Book by, illus. by Briana Dengoue (Mar. 14, $12.99, ISBN 978-1-62354-262-7); and April & Mae and the Movie Night: The Saturday Book (Mar. 14, $12.99, ISBN 978-1-62354-264-1) and April & Mae and the Sleepover: The Friday Book Mar. 14, $12.99, ISBN 978-1-62354-263-4), illus. by Gisela Bohórquez, ages 5–8.\nTitles in Spanish\nAbuelita y yo hacemos flan (Abuelita and I Make Flan) by Adriana Hernández Bergstrom (June 13, $17.99, ISBN 978-1-62354-399-0); and Nuestro techo es azul (Our Roof Is Blue) by Sara E. Echenique, illus. by Ashley Vargas (Apr. 11, $17.99, ISBN 978-1-62354-422-5); ages 5–8; and Con la cabeza en alto: cómo una comunidad Amazónica protegió la selva (Stand as Tall as the Trees: How an Amazonian Community Protected the Rain Forest) by Patricia Gualinga and Laura Resau, illus. by Vanessa Jaramillo (July 18, $17.99, ISBN 978-1-62354-237-5), ages 6–9.\nCharlesbridge Teen\nThe Other Pandemic: An AIDS Memoir by Lynn Curlee (June 6, $19.99, ISBN 978-1-62354-350-1) examines the parallels and the differences between the AIDS epidemic of the 1980s and ’90s and the current Covid-19 crisis. Ages 12–18.\nChicago Review Press\nScribble Art: Independent Process Art Experiences for Children by MaryAnn F. Kohl (Apr. 25, paper, $19.99, ISBN 9781641608404) features activities and ideas to help children embrace their creativity and let their imaginations soar. Ages 5–8.\nSuperpod: Saving the Endangered Orcas of the Pacific Northwest by Nora Nickum (Apr. 11, $19.99, ISBN 978-1-64160-793-3) follows three groups of orca whales and researchers who work to ensure that they can thrive in their natural habitat. Ages 8–12.\nThe Bones of Birka: Unraveling the Mystery of a Female Viking Warrior by C.M. Surrisi (Mar. 21, $19.99, ISBN 978-1-64160-706-3) recounts the discovery of the bones of a female Viking and its impact on evaluating gender roles. Ages 14–17.\nSeries\nWomen of Power heralds Climate Champions: 15 Women Fighting for Your Future, Vol. 10 by Rachel Sarah (Mar. 14, $16.99, ISBN 978-1-64160-700-1), ages 14–18.\nChicago Review Press/Parenting Press\nThe Way I Feel Too by Janan Cain (May 9, $16.99, ISBN 9781641609869) helps children identify and express their complex feelings in a positive manner. Ages 3–8.\nChild’s Play\nSeries\nBaby Rhyme Time adds Haitian Creole-English editions of Kawotchou Bis La/The Wheels on the Bus (May 1, $5.99 board book, ISBN 978-1-78628-752-6), Leve Ti Lapen/Sleeping Bunnies (May 1, $5.99 board book, ISBN 978-1-78628-753-3), Senk Ti Kàna/Five Little Ducks (May 1, $5.99 board book, ISBN 978-1-78628-751-9), and Zoum, Zoum, Zoum!/Zoom, Zoom, Zoom! (May 1, $5.99 board book, ISBN 978-1-78628-754-0) by Annie Kubler, illus. by Sarah Dellow, trans. by the Language Banc, ages up to 2.\nGimnasio de bebé/Baby Gym issues the following Spanish-English editions by Sanja Rescek, trans. by Yanitzia Canetti: Calma y serenidad/Calm & Soothe (May 1, $5.99 board book, ISBN 978-1-78628-722-9), Meneo y remeneo/Wiggle & Move (May 1, $5.99 board book, ISBN 978-1-78628-720-5), and Rebote y balanceo/Bounce & Jiggle (May 1, $5.99 board book, ISBN 978-1-78628-721-2), ages up to 2. And Child’s Play Mini-Library gains Errol’s Garden by Gillian Hibbs (May 1, $6.99 paper, ISBN 978-1-78628-418-1), ages 3–6; and The Cloud by Hannah Cumming (May 1, $6.99 paper, ISBN 978-1-78628-417-4), ages 4–8.\nSpanish-English additions to El taller de Rosa/Rosa’s Workshop are Rosa explora el ciclo del agua/Rosa Explores the Water Cycle (May 1, $7.99 paper, ISBN 978-1-78628-663-5), Rosa explora los ciclos de la vida/Rosa Explores Life Cycles (May 1, $7.99 paper, ISBN 978-1-78628-664-2), Rosa y el experimento de los grandes títeres de sombra/Rosa’s Big Shadow Puppet Experiment (May 1, $7.99 paper, ISBN 978-1-78628-666-6), and Rosa y el experimento del gran comedero de pájaros/Rosa’s Big Bird Feeder Experiment (May 1, $7.99 paper, ISBN 978-1-78628-665-9) by Jessica Spanyol, trans. by Yanitzia Canetti, ages 3–7. And joining Child’s Play Library are Around the World on 80 Horses by Jill Newton (May 1, $19.99, ISBN 978-1-78628-808-0; $9.99 paper, ISBN 978-1-78628-807-3), ages 3–8; and For the Love of Lettuce by Courtney Dicmas (Apr. 1, $19.99 978-1-78628-476-1; $9.99 paper, ISBN 978-1-78628-475-4); and Tree Whispers by Mandy Ross, illus. by Juliana Oakley (Mar. 1, $19.99, ISBN 978-1-78628-683-3; $9.99 paper, ISBN 978-1-78628-682-6), ages 3–7; and Thames by Emma Shoard (Apr. 1, $19.99, ISBN 978-1-78628-472-3), ages 4–9.\nChooseco\nSeries\nChoose Your Own Adventure—Dragonlark picks up Big Bigfoot’s Secret Vacation by Katherine Factor, illus. by Audrey Suau (Mar. 7, $8.99 paper, ISBN 978-1-954232-11-2); and Glitterpony Farm by Tina Connolly, illus. by Norm Grock (Mar. 7, $8.99 paper, ISBN 978-1-954232-10-5), ages 5–8. And The Warlock and the Unicorn by Deborah Lerme Goodman, illus. by Suzanne Nugent (Mar. 7, $7.99 paper, ISBN 978-1-954232-13-6), is a new Choose Your Own Adventure installment, ages 9–12.\nChronicle\nLittle Dumplings by Jekka Kuhlmann et al., illus. by Manita Boonyong (May 9, $7.99 board book, ISBN 978-1-79721-692-8), introduces dumplings eaten around the globe. Ages up to 3.\nHello Hummingbirds: Read and Play in the Tree! by Hannah Rogge, illus. by Emily Dove (May 2, $12.99 paper, ISBN 978-1-79721-009-4). This book featuring this bird species transforms into a tree. Ages 2–4.\nSome of These Are Snails by Carter Higgins (May 2, $15.99, ISBN 978-1-79722-018-5) offers a concept book exploring sorting, comparatives, and quantifiers. Ages 2–4.\nDancing Hands: A Story of Friendship in Filipino Sign Language by Joanna Que and Charina Marquez, trans. by Karen Llagas, illus. by Fran Alvarez (July 18, $17.99, ISBN 978-1-79721-332-3). Two girls—one who speaks Filipino sign language and one who doesn’t—learn to communicate with one another. Ages 3–5.\nGet Up, Stand Up by Bob Marley, adapted by Cedella Marley, illus. by John Jay Cabuay (Mar. 7, $7.99 board book, ISBN 978-1-79721-942-4), adapts this song delivering messages of peace, love, and truth. Ages 3–5.\nI Made These Ants Some Underpants! by Derick Wilder, illus. by K-Fai Steele (May 16, $15.99, ISBN 978-1-79720-216-7). A boy attempts to create a pair of underpants for each of his buddies. Ages 3–5.\nTap! Tap! Tap! Dance! Dance! Dance! by Hervé Tullet (May 16, $19.99, ISBN 978-1-79722-146-5). In this interactive book, kids’ hands are the dancers and the pages are a dance floor. Ages 3–5.\nYenebi’s Drive to School by Sendy Santamaria (June 27, $17.99, ISBN 978-1-79721-629-4). A loving family crosses the Mexican–U.S. border on its morning drive to school. Ages 3–5.\nYou Rule! by Rilla Alexander (Apr. 4, $17.99, ISBN 978-1-79721-179-4). A child and their dog star in this story affirming that the most precious things in life are immeasurable. Ages 3–5.\nThe Bee Without Wings by Amberlea Williams (Mar. 21, $18.99, ISBN 978-1-79722-250-9). The unexpected bond between a girl and a wingless bee is at the center of this tale about friendship and loss. Ages 4–8.\nThe Fire of Stars: The Life and Brilliance of the Woman Who Discovered What Stars Are Made Of by Kirsten W. Larson, illus. by Katherine Roy (Feb. 28, $18.99, ISBN 978-1-4521-7287-3), celebrates the life and scientific discoveries of astronomer Cecilia Payne. Ages 5–8.\nFish and Crab by Marianna Coppo (Mar. 14, $17.99, ISBN 978-1-79720-443-7). In this story of the friendship between two aquarium inhabitants, Crab is ready to sleep at bedtime, while Fish is still wide awake. Ages 5–8.\nHomeland: My Father Dreams of Palestine by Hannah Moushabeck, illus. by Reem Madooh (Mar. 28, $18.99, ISBN 978-1-79720-205-1). At the end of the day, three sisters await the return of their father, who tells them stories of his native Palestine. Ages 5–8.\nInvisible Things by Andy J. Pizza and Sophie Miller (July 18, $17.99, ISBN 978-1-79721-520-4). This look at things comprising the human experience urges kids to see past the visible and connect with the unseen. Ages 5–8.\nMaurice by Jessixa Bagley (May 9, $17.99, ISBN 978-1-79721-173-2). The tale of a music-loving dog in Paris reveals that we have the power to weather a changing world. Ages 5–8.\nOde to a Bad Day by Chelsea Lin Wallace, illus. by Hyewon Yum (Apr. 18, $16.99, ISBN 978-1-79721-080-3), offers an ode to a girl’s unpleasant day. Ages 5–8.\nOh No, the Aunts Are Here by Adam Rex, illus. by Lian Cho (May 23, $16.99, ISBN 978-1-79720-794-0). Chaos and absurdity erupt when a troupe of overwhelming and overly enthusiastic aunts come to visit. Ages 5–8.\nThe Red Tin Box by Matthew Burgess, illus. by Evan Turk (Apr. 4, $17.99, ISBN 978-1-4521-7973-5). In this tale about intergenerational bonds, Maude buries a box of her treasures, to be opened at the right moment. Ages 5–8.\nA River of Dust: The Life-Giving Between North Africa and the Amazon by Jilanne Hoffmann, illus. by Eugenia Mello (July 18, $18.99, ISBN 978-1-79721-175-6), pays tribute to global interconnectedness and the vital roles that even the tiniest particles of dust play in taking care of our planet. Ages 5–8.\nDog & Hat and the Lunar Eclipse by Darin Shuler (May 23, $14.99, ISBN 978-1-79720-689-9). In the second tale about Dog and Hat, the duo joins in when Ant visits her cousins on the moon. Ages 6–9.\nHenry, Like Always by Jenn Bailey and Mika Song (Mar. 21, $14.99, ISBN 978-1-79721-389-7). A boy on the autism spectrum is apprehensive about his class’s upcoming parade in this series launch. Ages 6–9.\nLOL 101: A Kid’s Guide to Writing Jokes by David Roth and Rinee Shah, illus. by Shah (May 2, $15.99, ISBN 978-1-79721-392-7), rounds up tips for aspiring comedians. Ages 6–9.\nDon’t Trust the Cat by Kristen Tracy (Apr. 18, $16.99, ISBN 978-1-79721-506-8). In this novel about self-acceptance and learning who your friends are, a bullied girl makes a wish to be happy and wakes up in the body of her cat. Ages 10 and up.\nSky Ropes by Sondra Soderborg (July 11, $16.99, ISBN 978-1-79721-564-8). A girl with a phobia of heights stars in this story about facing fears, discovering the meaning of friendship, and being open to possibilities. Ages 10 and up.\nSeries\nBeginning Baby adds Let’s Go to Color Camp! by Nicola Slater (June 22, $12.99 paper, ISBN 978-1-79721-872-4), ages up to 3. Bookscape Board Books gains Bon Voyage! by Ingela Arrhenius (Apr. 4, $8.99 board book, ISBN 978-1-79721-559-4), ages up to 3. Finger Puppet Books welcomes Baby Alligator (Mar. 28, $7.99 board book, ISBN 978-1-79722-019-2) and Baby Pony (Mar. 28, $7.99 board book, ISBN 978-1-79722-020-8) by Yu-Hsuan Huang, ages up to 3. Taro Gomi’s Little Chicks (Feb. 28, $7.99 board book, ISBN 978-1-79721-874-8) is a new Taro Gomi title, ages up to 3. Nature Books offers A Shell Is Cozy by Dianna Hutts Aston, illus. by Sylvia Long (May 9, $18.99, ISBN 978-1-79721-247-0), ages 5–8. I Didn’t Do My Homework Because... picks up A Funny Thing Happened After School... by Davide Cali and Benjamin Chaud (July 11, $12.99, ISBN 978-1-4521-8300-8), ages 6–9. Science Explorers issues Search for a Giant Squid: Pick Your Path by Amy Seto Forrester and Andy Chou Musser (Apr. 25, $14.99, ISBN 978-1-79721-393-4), ages 6–9. And Sheepology: The Ultimate Encyclopedia by Ilaria Demonti, illus. by Camilla Pintonato (Apr. 25, $14.99, ISBN 978-1-79722-243-1), joins the Farm Animal series, ages 6–10.\nChronicle/Twirl\nHow Are You? by Edouard Manceau (Mar. 7, $12.99 board book, ISBN 979-1-03-635324-6) encourages children to respond to characters’ feelings and recognize their own. Ages up to 3.\nMy Big Book of Nature Sounds by Lucie Brunelliere (Feb. 7, $21.99 paper, ISBN 978-2-408-04216-5). Kids press buttons to hear and identify sounds that animals and people make. Ages up to 3.\nWho’s the Most...? A Guess Who Book by Claudia Bielinsky (Feb. 7, $10.99 board book, ISBN 979-1-03-635309-3) offers a seek-and-find game featuring superlatives. Ages up to 3.\nSeries\nJoining Secret Life is The Secret Life of Bugs and Other Little Critters by Emmanuelle Figueras (Mar. 14, $18.99, ISBN 978-2-408-04254-7), ages 3–5. Do You Know? continues with Do You Know? Boats by Laurence Muguet (May 16, $16.99, ISBN 978-2-408-04255-4) and Do You Know? Music by Julie Delas (May 16, $16.99, ISBN 978-2-408-04253-0), ages 5–18. The Ultimate Book of Dinosaurs and Other Prehistoric Creatures by Sandra Laboucarie (July 11, $24.99, ISBN 979-1-03-635307-9) is a new The Ultimate title, ages 5–18. Ultimate Spotlight shines on Caring for Earth by Sandra Laboucarie et al. (Mar. 21, $16.99, ISBN 979-1-03-635323-9), ages 5–18. And What About releases What About: Philosophy by Anne-Sophie Chilard and Jean-Charles Pettier (May 9, $16.99, ISBN 979-1-03-635308-6), ages 7–18.\nCicada\nSnail Trail by Ziggy Hanaor, illus. by Christos Kourtoglou (May 2, $16.99, ISBN 978-1-80066-031-1). What happens when a snail who loves her family and friends sometimes needs a bit of alone time? Ages 3–6.\nAre We There Yet? by Sven Völker (July 4, $16.99, ISBN 978-1-80066-037-3). Bear and Butterfly embark on a journey in this bedtime story that introduces Buddhist philosophies and values. Ages 3–7.\nEpic Animal Journeys: Navigation and Migration by Air, Land and Sea by Ed Brown (Apr. 4, $22.99, ISBN 978-1-80066-029-8) examines how different animals migrate and the science of migration. Ages 6–11.\nNomads: Life on the Move by Kinchoi Lam (May 2, $22.99, ISBN 978-1-80066-032-8). This look at seven contemporary nomadic cultures illuminates alternative ways of being connected to our ancestral roots. Ages 6–11.\nChanging World: Cold Data for a Warming Planet by David Gibson (Apr. 4, $19.99, ISBN 978-1-80066-028-1) underscores the realities of climate change. Ages 11–18.\nClavis\nMy Grandma Is a Superhero by Marloes Van Loon (June 13, $18.95, ISBN 978-1-60537-839-8). A girl searches for Granny’s lost memory in this story aimed at helping kids understand Alzheimer’s disease. Ages 4–8.\nSweet Suzy. Everyone Is Special by Joni Bosch, illus. by Aiko Graven (July 18, $19.95, ISBN 978-1-60537-845-9). In this animal tale, Suzy’s friends help her discover what makes her unique. Ages 4–8.\nTrees Are Not Just for Birds by Bonnie Grubman, illus. by Katrien Benaets (May 23, $18.95, ISBN 978-1-60537-820-6). Looking for the right tree for her nest, Bird learns that life is better with others around us. Ages 4–8.\nChasing the Sun by Liu Hao (July 25, $17.95, ISBN 978-1-60537-842-8). After finding his way out of van Gogh’s “Sunflowers,” a boy who’s fascinated by light travels through the artist’s paintings. Ages 5–9.\nConnor Crowe Can’t Let Go by Howard Pearlstein, illus. by Stefani Buijsman (Mar. 28, $18.95, ISBN 978-1-60537-731-5). What happens when a boy who loves his tablet wishes he could give it up? Ages 5–9.\nHip Hip Hooray! by Carolijn Leisink, illus. by Maruga Koops (June 6, $18.95, ISBN 978-1-60537-840-4). When Grandma goes on a cooking spree, making her native Surinamese dishes, Abbey throws a surprise party. Ages 5–9.\nThe Old Man Eating Alone by Howard Pearlstein, illus. by Hilde Groven (Mar. 14, $18.95, ISBN 978-1-60537-768-1). Listening to a man talk about his fondest memories, Emily realizes that, with the bond he had with the late love of his life, he will never be lonely. Ages 5–9.\nAngel and the Paper Trail by Makenzie Hice, illus. by Natasja Horne (July 11, $18.95, ISBN 978-1-60537-732-2). Feeling alone at a new school, Angel finds a cryptic note in a library book that helps him find friends. Ages 6–10.\nIn My Dreams by Effie Lada (Apr. 18, $22.95, ISBN 978-1-60537-865-7) presents a poetic narrative about dreaming, waking up, and daring to be yourself. Ages 6–10.\nSeries\nKiki returns in Kiki’s Potty by Esther van den Berg (May 16, $14.95, ISBN 978-1-60537-852-7), ages 2–4. Little Mouse curls up in What Do You Do to Fall Asleep? by Guido Van Genechten (June 20, $18.95, ISBN 978-1-60537-846-6), ages 2–5. The World of Worm introduces Colors by Esther van den Berg (June 6, $18.95, ISBN 978-1-60537-794-0), ages 2–5. Piggy celebrates his birthday in Party for Everyone by Francesca Pirrone (July 11, $18.95, ISBN 978-1-60537-844-2), ages 3–10. Butterflies in Your Belly starts up with All About Your Body by Pauline Oud (June 27, $17.95, ISBN 978-1-60537-858-9), ages 4–8. Little Tractor chugs on with Little Tractor and the Baby Deer by Natalie Quintart, illus. by Philippe Goossens (Apr. 25, $18.95, ISBN 978-1-60537-837-4), ages 4–8. Super Animals welcomes Travelers by Reina Ollivier and Karel Claes, illus. by Steffie Padmos (June 27, $19.95, ISBN 978-1-60537-854-1), ages 6–9. And Brilliant Inventions by Mack Van Gageldonk (Apr. 25, $21.95, ISBN 978-1-60537-857-2) joins World of Wonder, ages 6–9.\nCollective Book Studio\nD Is for Donut by Rachel Teichman, photos by Rebecca Wright (June 2, $15.95, ISBN 978-1-68555-186-5), introduces the alphabet via donut varieties found throughout the world. Ages up to 8.\nI Hope You Will Know by Jaren Ahlmann, illus. by Pete Olcyzk (Apr. 4, $17.95, ISBN 978-1-951412-98-2), collects words to share with loved ones as they face life milestones. Ages 4–8.\nNo One Owns the Colors by Gianna Davy, illus. by Brenda Rodriguez (Feb. 7, $17.95, ISBN 978-1-951412-96-8). This celebration of self-expression and uniqueness emphasizes that all colors belong to everyone. Ages 4–8.\nOasis Pages: Teen Writing Quest by Grace Welker (Feb. 28, $18.95, ISBN 978-1-685550-17-2) presents a roadmap for teens to hone their writing skills and habits. Ages 12 and up.\nSeries\nBaby Animals First chimes in with Baby Animals First Sounds by Alexandra Claire (Feb 21, board book, $9.95, ISBN 978-1-951412-91-3), ages up to 3.\nConcordia\nSeries\nN Is for Nativity joins Christmas A to Z by Ruth E. Meyer (June 22, $15.99 paper, ISBN 978-0-7586-7331-2), ages 2–8. Arch Books offers God Gave Us Heaven (July 25, $3.49 paper, ISBN 978-0-7586-7333-6), ages 2–8. And God, I Need to Talk to You... issues six books by Susan Leigh, including God, I Need to Talk to You About Being Afraid (Mar. 7, $1.99 paper, ISBN 978-0-7586-7160-8), God, I Need to Talk to You About Being Patient (Mar. 7, $1.99 paper, ISBN 978-0-7586-7162-2), and God, I Need to Talk to You About Violence (Mar. 7, $1.99 paper, ISBN 978-0-7586-7168-4), ages 2–8.\nCottage Door\nABCs of Halloween, illus. by Jennica Lounsbury (May 2, $9.99 board book, ISBN 978-1-64638-840-0), is a holiday alphabet book. Ages up to 4.\nMy Dad Loves Me by Sara Miller, illus. by Flavio Remontti (Feb. 21, $9.99 board book, ISBN 978-1-64638-480-8), pays tribute to the bond between father and child. Ages up to 4.\nSpace by Jaye Garnett, illus. by Junissa Bianda (Feb. 1, $9.99 board\nbook, ISBN 978-1-64638-775-5). Young astronauts guide readers through the solar system in this lift-the-flap book. Ages 2–5.\nSeries\nBabies Love releases Babies Love Daddy (Feb. 1, $7.99 board book, ISBN 978-1-64638-803-5) and Babies Love Grandma (Feb. 1, $7.99 board book, ISBN 978-1-64638-802-8), ages up to 4. The Paw Patrol characters return in Paw Patrol Rescue Mission (May 30, $7.99 board book, ISBN 978-1-64638-820-2), ages up to 4; Paw Patrol Happy Pawsome Birthday! (Apr. 18, $7.99 board book, ISBN 978-1-64638-827-1), ages up to 6; and Go, Pups, Go! (July 18, $9.99 board book, ISBN 978-1-64638-861-5), ages 2–5. John Deere Kids rolls on with Tractor by Jack Redwing (May 2, $6.99 board book, ISBN 978-1-64638-822-6), ages up to 5. And Baby Wonders picks up Little Wonders Bugs by Rose Nestling (May 2, $9.99 board book, ISBN 978-1-64638-864-6), ages 1–4.\nThe CoComelon stars come out in Best Friends (July 4, $12.99 board book, ISBN 978-1-64638-893-6) and Halloween Songs (May 16, $13.99 board book, ISBN 978-1-64638-823-3), ages 1–4; and JJ Goes to School (May 30, $21.99 board book, ISBN 978-1-64638-624-6) and Yes Yes Bedtime (July 18, $18.99 board book, ISBN 978-1-64638-894-3), ages 1–5. Dinos Love offers Dinos Love Diggers (Apr. 18, $7.99 board book, ISBN 978-1-64638-863-9), ages 1–5. Thomas Tyrannosaurus Wrecks (July 18, $13.99 board book, ISBN 978-1-64638-866-0) is a new Thomas & Friends book, ages 1–6. Daniel Tiger’s Neighborhood celebrates Daniel Tiger Happy Halloween (May 16, $12.99 board book, ISBN 978-1-64638-821-9), ages 2–5. Things That Go by Ruby Byrd, illus. by Melanie Demmer (Feb. 1, $17.99 board book, ISBN 978-1-64638-654-3), is a new Early Bird Sound Book, ages 2–5. And Chop Chop serves up Chop Chop Eatable Alphabet by Sally Sampson, illus. by Danielle Mudd (Feb. 1, $12.99 board book, ISBN 978-1-64638-761-8), ages 2–8.\nTitle in Spanish\nMi Abuela y yo (Grandma & Me) by Brick Puffinton, illus. by Olivia Chin Mueller (Feb. 1, $7.99 board book, ISBN 978-1-64638-876-9), ages up to 4.\nCrabtree Blossoms\nSeries\nForecast Fairy weighs in on the weather with six books, including Flying into Fog (Feb. 1, $7.95 paper, ISBN 978-1-03-980092-2), Racing Around Rain (Feb. 1, $7.95 paper, ISBN 978-1-03-980088-5), and Whirling Through Wind (Feb. 1, $7.95 paper, ISBN 978-1-03-980089-2) by Amy Culliford, illus. by Mariano Epelbaum, ages 4–8. And Moose the Dog plays his guitar in Moose Joins the Band by Laurie Friedman, illus. by Gal Weizman (Feb. 1, $8.50 paper, ISBN 978-1-03-980096-0), ages 4–8.\nCrabtree Branches\nSeries\nCryptid Guides: Creatures of Folklore releases Guide to Bigfoot (Feb. 1, $9.95 paper, ISBN 978-1-03-966391-6), Guide to Chupacabras (Feb. 1, $9.95 paper, ISBN 978-1-03-966392-3), Guide to Mummies (Feb. 1, $9.95 paper, ISBN 978-1-03-966393-0), and Guide to Unicorns (Feb. 1, $9.95 paper, ISBN 978-1-03-966395-4) by Carrie Gleason, ages 8–11. Among Kim Thompson’s six contributions to Can You Believe It’s True? are True Facts on Animals (Feb. 1, $9.95 paper, ISBN 978-1-03-969775-1), True Facts on Inventions (Feb. 1, $9.95 paper, ISBN 978-1-03-969778-2), and True Facts on Sports (Feb. 1, $9.95 paper, ISBN 978-1-03-969776-8), ages 8–14. Extreme Sports adds six books by Bernard Conaghan, including BMX (Feb. 1, $9.95 paper, ISBN 978-1-03-969769-0), Skateboarding (Feb. 1, $9.95 paper, ISBN 978-1-03-969771-3), and Surfing (Feb. 1, $9.95 paper, ISBN 978-1-03-969773-7), ages 8–14. And there are six new Improving Your Social Skills titles by Vicky Bureau, among them Don’t Be a Bully (Feb. 1, $9.95 paper, ISBN 978-1-03-966240-7), Respecting Diversity (Feb. 1, $9.95 paper, ISBN 978-1-03-966244-5), and Working as a Team (Feb. 1, $9.95 paper, ISBN 978-1-03-966243-8), ages 8–14.\nCrabtree Crown\nSeries\nGreat Explorers has six additions by Stephen Krensky, which include Daniel Boone (Feb. 1, $9.95 paper, ISBN 978-1-03-980070-0), Kit Carson (Feb. 1, $9.95 paper, ISBN 978-1-03-980072-4), and Meriwether Lewis and William Clark (Feb. 1, $9.95 paper, ISBN 978-1-03-980069-4), ages 8–10. Among the six new Look into the Human Body titles by Tracy Vonder Brink are Digestive System (Feb. 1, $9.95 paper, ISBN 978-1-03-980076-2), Muscular System (Feb. 1, $9.95 paper, ISBN 978-1-03-980075-5), and Skeletal System (Feb. 1, $9.95 paper, ISBN 978-1-03-980080-9), ages 8–10. Brink adds six volumes to Members of the Animal Kingdom, including Amphibians (Feb. 1, $9.95 paper, ISBN 978-1-03-980081-6), Mammals (Feb. 1, $9.95 paper, ISBN 978-1-03-980085-4), and Reptiles (Feb. 1, $9.95 paper, ISBN 978-1-03-980086-1), ages 8–10. And Pods, Troops, and Other Animal Groups has six additions, among them Elephant, Deer, and Other Herds by Cynthia O’Brien (Feb. 1, $9.95 paper, ISBN 978-1-03-980678-8), Penguin, Prairie Dog, and Other Colonies by Kylie Burns (Feb. 1, $9.95 paper, ISBN 978-1-03-980680-1), and Wolf, Coyote, and Other Packs by Heather C. Hudak (Feb. 1, $9.95 paper, ISBN 978-1-03-980683-2), ages 8–10.\nCrabtree Forest\nSeries\nFocus on Geography explores Focus on Australia by Natalie Hyde (Feb. 1, $11.95 paper, ISBN 978-1-03-980671-9), Focus on Chile by Linda Barghoorn (Feb. 1, $11.95 paper, ISBN 978-1-03-980668-9), Focus on Ghana by Heather Hudak (Feb. 1, $11.95 paper, ISBN 978-1-03-980669-6), and Focus on Pakistan by Ellen Rodger (Feb. 1, $11.95 paper, ISBN 978-1-03-980670-2), ages 10–14. And new Investigating Body Systems titles by Natalie Hyde are Investigating the Digestive System (Feb. 1, $11.95 paper, ISBN 978-1-03-980673-3), Investigating the Immune System (Feb. 1, $11.95 paper, ISBN 978-1-03-980674-0), Investigating the Nervous System (Feb. 1, $11.95 paper, ISBN 978-1-03-980675-7), and Investigating the Respiratory System (Feb. 1, $11.95 paper, ISBN 978-1-03-980676-4), ages 10–14.\nCrabtree Leaves\nSeries\nMagic Strong by Stephanie Perry Moore, illus. by Anthony Ketuojor Ikediuba, introduces five books, including Aquarium Clock (Feb. 1, $11.50 paper, ISBN 978-1-03-980110-3) and Space Rocket (Feb. 1, $11.50 paper, ISBN 978-1-03-980111-0), ages 7–9.\nCrabtree Little Honey\nSeries\nMy Decodable Readers offers 10 books by Kim Thompson, illus. by Brett Curzon, among them Doc’s Job (Feb. 1, $8.50 paper, ISBN 978-1-03-980064-9), Fun for Pups (Feb. 1, $8.50 paper, ISBN 978-1-03-980067-0), and Who Yaps Back? (Feb. 1, $8.59 paper, ISBN 978-1-03-980060-1), ages 4–7. And My Phonics Readers—I See My Consonant Teams issues six titles by Shannon Anderson, including I See Ch (Feb. 1, $7.95 paper, ISBN 978-1-03-969733-1) and I See Th (Feb. 1, $7.95 paper, ISBN 978-1-03-969734-8), ages 4–7.\nCrabtree Roots\nSeries\nChristina Earley contributes 18 titles to Words in My World, among them At the Farm (Feb. 1, $5.95 paper, ISBN 978-1-03-969688-4), I See Colors (Feb. 1, $5.95 paper, ISBN 978-1-03-969677-8), In the Summer (Feb. 1, $5.95 paper, ISBN 978-1-03-969681-5), and People in My Neighborhood (Feb. 1, $5.95 paper, ISBN 978-1-03-969692-1), ages 2–7. Six books by Amy Culliford join Baby Animals, including Super Cute Kittens (Feb. 1, $8.95 paper, ISBN 978-1-03-969738-6), Super Cute Ocean Animals (Feb. 1, $8.95 paper, ISBN 978-1-03-969740-9), and Super Cute Reptiles (Feb. 1, $8.95 paper, ISBN 978-1-03-969742-3), ages 4–6. Measuring Things weighs in with Length (Feb. 1, $8.95 paper, ISBN 978-1-03-969748-5), Temperature (Feb. 1, $8.95 paper, ISBN 978-1-03-969747-8), Time (Feb. 1, $8.95 paper, ISBN 978-1-03-969749-2), Volume (Feb. 1, $8.95 paper, ISBN 978-1-03-969750-8), and Weight (Feb. 1, $8.95 paper, ISBN 978-1-03-969751-5) by Marie Lemke, ages 4–6. Embarrassed (Feb. 1, $7.95 paper, ISBN 978-1-03-969744-7) and Worried (Feb. 1, $7.95 paper, ISBN 978-1-03-969743-0) by Amy Culliford join My Emotions, ages 4–6. And People I Meet greets Chef (Feb. 1, $7.95 paper, ISBN 978-1-03-969746-1) and Pilot (Feb. 1, $7.95 paper, ISBN 978-1-03-969745-4) by Douglas Bender, ages 4–6.\nCrabtree Seedlings\nSeries\nMy State issues 20 state-specific titles by Christina Earley, including Hawaii (Feb. 1, $8.95 paper, ISBN 978-1-03-980255-1), Massachusetts (Feb. 1, $27.93, ISBN 978-1-03-969659-4), New York (Feb. 1, $8.95 paper, ISBN 978-1-03-969765-2), and Texas (Feb. 1, $8.95 paper, ISBN 978-1-03-969762-1), ages 5–7. What Color Are My Feelings? by Margaret Salter shares I Feel Blue (Feb. 1, $9.95 paper, ISBN 978-1-03-980690-0), I Feel Green (Feb. 1, $9.95 paper, ISBN 978-1-03-980691-7), I Feel Purple (Feb. 1, $9.95 paper, ISBN 978-1-03-980692-4), and I Feel Red (Feb. 1, $9.95 paper, ISBN 978-1-03-980693-1), ages 5–7. Sports Friends introduces two pals who are baseballs in Out of the Park! by David Roth, illus. by Wes Tyrell (Feb. 1, $9.95 paper, ISBN 978-1-03-966416-6), ages 5–9. And Where Materials Come From offers four titles by Robin Johnson, including Cotton to Clothing (Feb. 1, $8.95 paper, ISBN 978-1-03-980685-6) and Oil to Plastic (Feb. 1, $8.95 paper, ISBN 978-1-03-980686-3), ages 5–9.\nCrabtree Sunshine\nSeries\nSunshine Picture Books welcomes Along Came Callie by Alicia Rodriguez, illus. by Duc Nguyen (Feb. 1, $10.95 paper, ISBN 978-1-03-966310-7); and I’m Not Afraid of This Haunted House by Laurie Friedman, illus. by Srimalie Bassani (Feb. 1, $10.95 paper, ISBN 978-1-03-980115-8), ages 4–10.\nCrackboom!\nSeries\nSqueeze ‘n’ Squeak gains Welcome to the Farm! by Carine Laforest, illus. by Karina Dupuis and Annie Sechao et al. (Apr. 4, $8.99 board book, ISBN 978-2-89802-476-4); Wild Animals by Laforest, illus. by Dupuis and Sechao (Apr. 4, $8.99 board book, ISBN 978-2-89802-478-8); and Where Is Squeaky Bear? by Charlotte Ferrier. illus. by Helen Graper (Mar. 7, $8.99 board book, ISBN 978-2-89802-474-0), ages up to 3. Baby’s First Words adds Birthday Party (Mar. 21, $5.99 board book, ISBN 978-2-89802-485-6) and Easter (Feb. 7, $5.99 board book, ISBN 978-2-89802-460-3) by Carine Laforest, ages 1–3. Dinosaurs: A Look-and-Find Book by Laforest, illus. by Karina Dupuis (Mar. 7, $11.99 board book, ISBN 978-2-89802-357-6), joins Little Detectives, ages 2–4. AboNINAbles ushers in Mix and Match Monsters by Laforest, illus. by Johanna Reynaud (May 23, $9.99 board book, ISBN 978-2-89802-499-3), ages 3–6. And The Little Prince stars in The Journey of The Little Prince by Corinne Delporte. trans. by Laforest, illus. by Antoine de Saint-Exupéry (Apr. 4, $17.95 board book, ISBN 978-2-89802-497-9), ages 5–8.\nCreative Editions\nPuddle Song by Laura Purdie Salas, illus. by Monique Felix (Mar. 14, $9.99 board book, ISBN 978-1-56846-383-4). Kids explore their senses as they see how puddle water splashes and feel the droplets on their skin. Ages 2–5.\nWhat to Do with a Stick by Jane Yolen, illus. by Paolo Domeniconi (Mar. 14, $16.99, ISBN 978-1-56846-365-0). Lauded as an ordinary object with extraordinary uses, a stick can be a sword or an oar—or other things. Ages 5–9.\nIsland of Shadows by Davide Cali, illus. by Claudia Palmarucci (Mar. 14, $19.99, ISBN 978-1-56846-388-9). In this story, animals’ nightmares take literal shape, yet the scariest place is an island that’s the domain of extinct creatures whose dreams have disappeared. Ages 8–11.\nSister Spring by James Christopher Carroll (Mar. 14, $16.99, ISBN 978-1-56846-384-1) centers on a small green girl who pops up from the earth after the last frost to unleash the natural glories of the new season. Ages 9–12.\nCreston\nFood for Hope: How John Van Hengel Invented Food Banks for the Hungry by Jeff Gottesfeld, illus. by Michelle Laurentia Agatha (May 2, $19.99, ISBN 978-1-954354-24-1), profiles this individual who launched the first food banks to combat the problems of food waste and widespread hunger. Ages 7–10.\nHer Eyes on the Stars: Maria Mitchell, Astronomer by Laurie Wallmark, illus. by Liz Wong (May 2, $19.99, ISBN 978-1-954354-13-5), chronicles the life of this 19th-century astronomer who was the first American to discover a comet and the world’s first woman astronomy professor. Ages 8–11.\nCrocodile\nKatinga Finds the Perfect Name by Mabel Mnensa, illus. by Chantelle and Burgen Thorne (May 30, $18.95, ISBN 978-1-62371-743-8). With her grandmother’s help, a girl in South Africa explores her identity and learns to appreciate her name. Ages 3–8.\nZebra in the Mirror by Tina Arnuš Pupis, illus. by Marta Bartoli (June 6, $18.95, ISBN 978-1-62371-745-2). In this tale about self-confidence, a zebra is happy with her reflection in the lake, until she remembers mean remarks by other animals. Ages 4–8.\nFolktales for a Better World: Stories of Peace and Kindness by Elizabeth Laird, illus. by Mehrdokht Amini (Feb. 14, $19.95, ISBN 978-1-62371-797-1), compiles stories from seven countries that have endured wars and conflicts in recent times, including Palestine, Afghanistan, and Sudan. Ages 5–8.\nSeries\nBabylink issues If Mom Sings by Laura Wittner, illus. by Maricel R. Clark (July 4, $11.95 board book, ISBN 978-1-62371-744-5), ages up to 3. And Against All Odds presents The Amazing Students of Venezuela by Claudia Bellante, illus. by Elizabeth Builes (Mar. 14, $18.95, ISBN 978-1-62371-793-3); and The Mermaids of Jamaica by Bellante, illus. by Herikita (Mar. 14, $18.95, ISBN 978-1-62371-792-6), ages 5–8.\nDisney Hyperion\nEllie Engle Saves Herself by Leah Johnson (May 2, $18.99, ISBN 978-1-368-08555-7). In this series starter, a Black girl discovers she can bring dead things back to life through touch. Ages 8–12.\nPrincess Private Eye by Evelyn Skye (May 2, $16.99, ISBN 978-1-368-07802-3). A New York foster kid discovers she’s actually a long-lost princess of a remote country—and must solve the mystery behind a threat to the crown. Ages 8–12.\nFrom the World of Percy Jackson: The Sun and the Star by Rick Riordan and Mark Oshiro (May 2, $17.99, ISBN 978-1-368-08115-3). Demigods Nico di Angelo and Will Solace endure the terrors of Tartarus to rescue an old friend in this addition to the Percy Jackson saga. Ages 10–14.\nGood as Gold by Candace Buford (May 5, $18.99, ISBN 978-1-3680-7754-5). Casey spends the summer before college on a quest to find her town’s legendary sunken treasure in order to clear her family’s name and save her future. Ages 12–18.\nTim Burton’s the Nightmare Before Christmas Novelization by Megan Shepherd (May 31, $18.99, ISBN 978-1-3680-9421-4). In this official novelization of the classic film, Pumpkin King Jack Skellington longs for creativity and newness to challenge his brilliant mind. Ages 12–18.\nA Spark in the Cinders by Jenny Elder Moke (June 6, $18.99, ISBN 978-1-368-03991-8) reimagines “Cinderella” in a kingdom on the brink of ruin where one wicked stepsister becomes the heroine of her own quest. Ages 12–18.\nWhen We Had Summer by Jennifer Castle (Apr. 25, $18.99, ISBN 978-1-368-08140-5). A tight-knit, daring,\nand eclectic group of friends dedicate every summer to completing their #SummerSistersBucketList together—until one of them dies. Ages 12–18.\nA Whole Song and Dance by Sarvenaz Tash (Apr. 4, $18.99, ISBN 978-1-368-07755-2). In this romantic comedy, Iranian American college freshman Nasrin lives a double life as a musical theater performer and as a business major to appease her parents. Ages 12 and up.\nThere Goes the Neighborhood by Jade Adia (Mar. 7, $18.99, ISBN 978-1-368-08432-1). This YA debut tells the darkly humorous story of three best friends willing to do whatever it takes to stay together and push back against gentrification in their South L.A. neighborhood. Ages 14–18.\nThree Drops of Blood by Gretchen McNeil (Mar. 21, $17.99, ISBN 978-1-368-07215-1). A mundane office job takes a sinister turn when a girl witnesses a double murder through the window. Ages 14–18.\nSeries\nMother Bruce by Ryan T. Higgins rolls on with Bruce and the Legend of Soggy Hollow (July 11, $18.99, ISBN 978-1-368-05958-9), ages 3–5. Penelope Rex takes center stage in We Don’t Lose Our Class Goldfish by Higgins (Mar. 28, $18.99, ISBN 978-1-368-07698-2), ages 3–5. Bibbidi Bobbidi Academy by Kallie George, illus. by Lorena Gómez, opens the doors for Ophelia and the Fairy Field Trip (Apr. 11, $14.99, ISBN 978-1-368-05789-9), ages 5–8. The Sugar Rush Racers by Shari Simpson, illus. by Saoirse Lou, featuring characters from Wreck-It Ralph, launches with The Sweet Outdoors (June 6, $16.99, ISBN 978-1-3680-8145-0), ages 5–8. Camp Lil’ Vills, focused on Disney Villains when they were kids, kicks off with My Bunkmate Hates Puppies by Sam Hay, illus. by Ria Maria Lee (Apr. 25, $14.99, 978-1-3680-5740-0), ages 6–8. And Horsetail Hollow prances into spring with Stupendously Samson by Kiki Thorpe, illus. by Laura Catrinella (Mar. 14, $14.99, ISBN 978-1-368-09422-1), ages 6–8.\nKingdom Keepers: Inheritance, a new trilogy by Ridley Pearson, debuts with The Shimmer (Feb. 21, $17.99, ISBN 978-1-4847-8557-7), ages 8–12. The Society of Explorers and Adventurers welcomes Shinji Takahashi: Into the Heart of the Storm by Julie Kagawa (Apr. 18, $16.99, ISBN 978-1-368-07414-8), ages 8–12. Belles by Dhonielle Clayton continues with The Beauty Trials (Feb. 14, $18.99, ISBN 978-1-3680-4692-3, ages 12–18. Mirrorverse by Delilah S. Dawson, in which mirrored reflections of Disney characters transform into battle-ready Guardians to fight evil, debuts with Pure of Heart (July 4, $17.99, ISBN 978-1-3680-7891-7), ages 12–18. And Villains expands with Fairest of All: A Villains Graphic Novel by Serena Valentino, illus. by Fiona Marchbank (May 2, $21.99, ISBN 978-1-368-06817-8), ages 12–18.\nDisney Press\nHow Far You’ll Go by Tim McCanna, illus. by Grace Lee (Apr. 4, $17.99, ISBN 978-1-368-07775-0), features watercolor scenes from classic Disney films that depict moments of bravery and resilience. Ages 5–8.\nSeries\nTie-ins to the live-action feature film The Little Mermaid include Make a Splash by Ashley Franklin, illus. by Paul Kellam (Apr. 11, $17.99, ISBN 978-1-368-07726-2), ages 3–5; Guide to Merfolk by Eric Geron (Apr. 11, $12.99, ISBN 978-1-368-08040-8). ages 8–12; and Against the Tide by J. Elle (Apr. 11, $18.99, ISBN 978-1-368-07722-4), ages 12–18. And Disney Lyrical Tales sings out for Encanto: We Don’t Talk About Bruno by Disney Books (May 16, $16.99, ISBN 978-1-368-09416-0), ages 3–5.\nDisney Lucasfilm\nStar Wars Hunters: Battle for the Arena by Mark Oshiro (Feb. 21, $14.99, ISBN 978-1-3680-7603-6). This book based on the game Star Wars: Hunters centers on Rieve, a Force-sensitive orphan struggling to control her abilities. Ages 10–14.\nStar Wars: The High Republic YA Anthology by Claudia Gray et al. (July 25, $18.99, ISBN 978-1-3680-9379-8) brings together short stories featuring fan-favorite characters from the High Republic series each written by a bestselling author. Ages 12–18.\nSeries\nYoung Jedi Adventures gains Jedi Training by Caitlin Kennedy (May 2, $17.99, ISBN 978-1-3680-9098-8), ages 3–5.\nDisney/Marvel\nThe Marvels: The Hero I’m Meant to Be by Pamela Bobowicz, illus. by Alexandra Barboza (July 11, $12.99, ISBN 978-1-3680-8050-7). Three of the Marvel Cinematic Universe’s most powerful heroes come together in a book that explores what it means to be a hero. Ages 6–8.\nThor Quest: Hammers of the Gods by Jackson Lanzing, illus. by Collin Kelly (July 25, board book, $14.99, ISBN 978-1-3680-7435-3), launches a middle grade series in which teenage Asgardians Thor, Loki, Valkyrie, Sif, and the Warriors Three venture across the realms to fight fantastical monsters of various mythologies. Ages 8–12.\nAraña and Spider-Man 2099: Dark Tomorrow by Alex Segura (May 2, $17.99, ISBN 978-1-3680-7900-6). In the future world of Spider-Man 2099, Anya Corazon’s beloved mentor is killed and she is swept up into an epic quest for justice. Ages 12–18.\nSeries\nSpidey and His Amazing Friends greets A Little Hulk Trouble by Marvel Press (June 27, board, $8.99, ISBN 978-1-3680-8481-9), ages 3–5. And Marvel Rebels & Renegades adds The Winter Soldier: Cold Front by Mackenzi Lee (Feb. 7, $17.99, ISBN 978-1-368-02227-9), ages 14–18.\nDisney/Riordan\nRick Riordan Presents Winston Chu vs. the Whimsies by Stacey Lee (Feb. 7, $17.99, ISBN 978-1-368-07480-3). Twelve-year-old Winston Chu stars in this modern-day reimagining of a classic Chinese folktale—replete with magic, boba tea, and lots of trash talking. Ages 9–12.\nThe Last Fallen Realm by Graci Kim (June 6, $16.99, ISBN 978-1-368-07316-5). An adopted Korean American girl named Riley discovers her heritage and her magic on a perilous journey to save her witch clan family. Ages 10–14.\nRick Riordan Presents Last Canto of the Dead by Daniel José Older (May 16, $18.99, ISBN 978-1-368-07090-4). Simultaneous battles rage in the Caribbean and Brooklyn as two gods-turned-teenagers try to get to the bottom of what is keeping them apart, in this conclusion to the Outlaw Saints duology. Ages 12–18.\nDK\nThe Mystery of the Golden Feather: A Mindful Journey Through Birdsong by Tessa Strickland, illus. by Clara Anganuzzi (May 16, $17.99, ISBN 978-0-7440-6989-1). A boy discovers the wonder of birds and their songs when he pauses to appreciate the present moment and the sounds of nature around him. Ages 3–5.\nStuck in the Middle: A Story About Separation by Tom Tinn-Disbury (May 16, $16.99, ISBN 978-0-7440-8028-5) introduces children to family separation and teaches them how to deal with the emotions surrounding divorce. Ages 3–5.\nMy Animal Family: Meet the Different Families of the Animal Kingdom by Kate Peridot (May 9, $16.99, ISBN 978-0-7440-7087-3) presents various social structures across the animal kingdom. Ages 5–7.\nThe Egg Book: See How Baby Animals Hatch, Step by Step! (Feb. 7, $17.99, ISBN 978-0-7440-6996-9) offers a visual journey through the early life stages of more than 20 different baby animals as they hatch from their eggs. Ages 5–8.\nAmazing Animal Journeys: The Most Incredible Migrations in the Natural World by Philippa Forrester (Feb. 14, $24.99, ISBN 978-0-7440-5990-8). Readers follow the Arctic tern and other animals as they search for food, look for mates, head to warmer climates, or seek a new home. Ages 7–9.\nGalàpagos (Mar. 28, $19.99, ISBN 978-0-7440-7917-3) explores the flora, fauna, and geology of the biologically diverse Galapagos islands. Ages 7–9.\nPets and Their People: The Ultimate Guide to Pets—Whether You’ve Got One or Not! by Jess French (Apr. 18, $16.99, ISBN 978-0-7440-6993-8). Veterinarian and author French provides information about the behavior of numerous pets and how best to care for them. Ages 7–9.\nWonderfully Wired Brains: An Introduction to the World of Neurodiversity by Louise Gooding, illus. by Ruth Burrows (May 30, $16.99, ISBN 978-0-7440-7463-5), challenges misconceptions and shows how neuro-\ndivergent brains work a little differently. Ages 7–9.\nGoddesses and Heroines: Meet More Than 80 Powerful Women from Around the World by Jean Menzies, illus. by Katie Ponder (July 11, $21.99, ISBN 978-0-7440-8031-5). Profiles and stories of women from religion and myth from cultures all around the world. Ages 7–10.\nHabitats of the World (Mar. 14, $21.99, ISBN 978-0-7440-6972-3) spotlights habitats from forests and oceans to deserts and the frozen poles. Ages 7–11.\nThe Ancient Worlds Atlas (Apr. 25, $20, ISBN 978-0-7440-7726-1) travels through 5,000 years of history to show where and how ancient peoples lived. Ages 8–12.\n1,000 Amazing Gross Facts (June 13, $14.99 paper, ISBN 978-0-7440-8143-5). Animal and human waste and goo take center stage in this look at the science of things icky and sticky. Ages 9–12.\nThe Most Exciting Book of Science, Inventions, and Space Ever, illus. by Lisa Swerling and Ralph Lazar (Mar. 7, $21.99, ISBN 978-0-7440-7753-7). Mischievous cartoons the Brainwaves lead readers through a range of STEM topics and important inventions. Ages 9–12.\nTimelines of Nature: From Mountains and Glaciers to Mayflies and Marsupials (June 6, $29.99, ISBN 978-0-7440-8148-0). Visual timelines depict the history of our planet. Ages 9–12.\nSeries\nBaby Dinosaur returns in Baby Dinosaur Under the Sea: Follow Baby Stegosaurus on Her First Swimming Adventure! (May 30, $7.99 board book, ISBN 978-0-7440-8046-9), ages up to 3. Little Chunkies takes on Animals in the Forest (Mar. 14, $12.99 board book, ISBN 978-0-7440-6999-0) and Animals in the Wild (Mar. 14, $12.99 board book, ISBN 978-0-7440-6998-3), ages up to 3. DK Find My Favorite reveals Farm (Apr. 4, $12.99 board book, ISBN 978-0-7440-7088-0), ages 2–5. The Guinea Pigs, Bob and Ginger, star in a series of concept books beginning with Guinea Pigs Go Bug Hunting: Learn Your ABCs (Mar. 28, $7.99 board book, ISBN 978-0-7440-7285-3), Guinea Pigs Go Painting: Learn Your Colors (June 27, $7.99 board book, ISBN 978-0-7440-8034-6), and Guinea Pigs Go to the Beach: Learn Your 123s (Mar. 28, $7.99 board book, ISBN 978-0-7440-7284-6), all by Kate Sheehy, ages 2–5. And Jonny Lambert’s Bear and Bird adds Try, Try Again by Lambert (Feb. 28, $12.99 board book, ISBN 978-0-7440-6261-8), ages 2–5.\nDK Super Readers Pre-Level ramps up with 20 new titles, including A Day at the Petting Zoo (Apr. 4, $14.99, ISBN 978-0-7440-6769-9; $4.99 paper, ISBN 978-0-7440-6770-5), Chomp! Big Teeth (May 2, $14.99, ISBN 978-0-7440-7117-7; $4.99 paper, ISBN 978-0-7440-7118-4), and Save the Sea Turtles (June 6, $14.99, ISBN 978-0-7440-7269-3; $4.99 paper, ISBN 978-0-7440-7270-9), ages 3–5. Everyone Is Special welcomes Babies (Apr. 25, $8.99 board book, ISBN 978-0-7440-7779-7) and Dogs (Apr. 25, $8.99 board book, ISBN 978-0-7440-7778-0), ages 3–5. New to I Love My is I Love My Farm: A Pop-Up Book About Animals on the Farm (Feb. 7, $12.99 board book, ISBN 978-0-7440-6995-2), ages 3–5. Kindness Club by Ella Law greets Kindness Club Mouse Tells the Truth (May 2, $12.99, ISBN 978-0-7440-8029-2) and Kindness Club Rabbit Says Sorry (May 2, $12.99, ISBN 978-0-7440-8030-8), ages 3–5. Bedtime Books rolls out The Bedtime Book of Dinosaurs and Other Prehistoric Life: Meet More Than 100 Creatures from Long Ago (Apr. 11, $16.99, ISBN 978-0-7440-7001-9), ages 3–6.\nJoining A Dinosaur’s Day is Deinonychus Goes Hunting by Elizabeth Gilbert Bedia, illus. by Marie Bollmann (Feb. 21, $16.99, ISBN 978-0-7440-6005-8), ages 4–7. Mrs Wordsmith gains Mrs Wordsmith the Book of Big Feelings: Hundreds of Words to Help You Express How You Feel (Mar. 21, $24.99 paper, ISBN 978-0-7440-6103-1), ages 4–8. Dinosaur Club offers Escaping the Liopleurodon by Rex Stone (May 2, $18.99, ISBN 978-0-7440-8027-8), ages 5–7. The Math Adventurers by Sital Gorasia Chapman adds A Day at the Zoo: Learn About Time (May 2, $16.99, ISBN 978-0-7440-8025-4), Build a Friendship: Discover Shapes (May 2, $16.99, ISBN 978-0-7440-8024-7), and Measure Up: Discover Height and Length (June 6, $16.99, ISBN 978-0-7440-8033-9), ages 5–7. Vocabulary Builders expands with 1000 Animal Words: Build Animal Vocabulary and Literacy Skills (Feb. 14, $14.99, ISBN 978-0-7440-6994-5), ages 5–7. And My First issues My First Garden: For Little Gardeners Who Want to Grow by Livi Gosling (Mar. 7, $16.99, ISBN 978-0-7440-7086-6), ages 5–8.\nAmong the 20 new DK Super Readers Level 1 titles are A Day on the Farm (Apr. 4, $14.99, ISBN 978-0-7440-6705-7; $4.99 paper, ISBN 978-0-7440-6706-4), Bugs Hide and Seek (July 11, $14.99, ISBN 978-0-7440-7425-3; $4.99 paper, ISBN 978-0-7440-7426-0), and Sea Otters (June 6, $14.99, ISBN 978-0-7440-7244-0; $4.99 paper, ISBN 978-0-7440-7245-7), ages 6–8. My Book Of gains My Book of Cats and Kittens (Feb. 21, $14.99, ISBN 978-0-7440-7389-8) and My Book of Dogs and Puppies (Feb. 21, $14.99, ISBN 978-0-7440-7394-2), ages 6–9. DK Super Readers Level 2 grows with 22 entries, including Amazing Bees (July 11, $14.99, ISBN 978-0-7440-7455-0; $4.99 paper, ISBN 978-0-7440-7456-7), Sniffles, Sneezes, Hiccups, and Coughs (Apr. 4, $14.99, ISBN 978-0-7440-6814-6; $4.99 paper, ISBN 978-0-7440-6815-3), and Water Everywhere (May 2, $14.99, ISBN 978-0-7440-6809-2; $4.99 paper, ISBN 978-0-7440-6810-8), ages 7–9. The Magic and Mystery of Nature introduces The Frozen Worlds: The Astonishing Nature of the Arctic and Antarctic by Jason Bittel, illus. by Claire McElfatrick (Mar. 21, $16.99, ISBN 978-0-7440-7000-2), ages 7–9. The Secret Explorers by S.J. King, fact-filled adventure stories, debuts with The Secret Explorers and the Sunken Treasure (July 4, $18.99, ISBN 978-0-7440-8039-1), ages 7–9. And DK The Met continues with Gods of the Ancient World: A Kids’ Guide to Ancient Mythologies by Marchella Ward (Feb. 14, $21.99, ISBN 978-0-7440-6096-6), ages 7–11.\nNew DK Super Readers Level 3 titles are Amazing Buildings (May 2, $4.99 paper, ISBN 978-0-7440-7145-0), Claws (June 6, $14.99, ISBN 978-0-7440-7302-7; $4.99 paper, ISBN 978-0-7440-7303-4), and How Do We Communicate? (June 6, $14.99, ISBN 978-0-7440-7323-2; $4.99 paper, ISBN 978-0-7440-7324-9), ages 8–10. DK Eyewitness delivers The Civil War (Apr. 18, $16.99, ISBN 978-0-7440-6251-9), National Parks (June 6, $16.99, ISBN 978-0-7440-6974-7), and Planets (Apr. 18, $16.99, ISBN 978-0-7440-7994-4), ages 8–12. Back to Life serves up Wonders of the World (Apr. 18, $24.99, ISBN 978-0-7440-6985-3), ages 8–12. DK Our World in Numbers picks up Our World in Numbers Animals: An Encyclopedia of Fantastic Facts (July 18, $19.99, ISBN 978-0-7440-8151-0), ages 9–12. DK Our World in Pictures offers Our World in Pictures: The History Book (May 2, $24.99, ISBN 978-0-7440-7631-8) and Our World in Pictures: The Dinosaur Book (June 13, $24.99, ISBN 978-0-7440-8147-3), ages 9–12. DK Super Readers Level 4 offers a slate of titles including A World of Technology (July 11, $14.99, ISBN 978-0-7440-7469-7; $4.99 paper, ISBN 978-0-7440-7470-3), Moon Landings (June 6, $14.99, ISBN 978-0-7440-7307-2; $4.99 paper, ISBN 978-0-7440-7308-9), and Shark: Apex Predator (July 11, $14.99, ISBN 978-0-7440-7357-7; $4.99 paper, ISBN 978-0-7440-7358-4), ages 9–12.\nEerdmans\nBear Is Never Alone by Marc Veer-kamp, illus. by Jeska Verstegen, trans. by Laura Watkinson (Apr. 4, $17.99, ISBN 978-0-8028-5603-6). A piano-playing bear is pressured by other animals to perform when all he wants to do is relax. Ages 4–8.\n9 Kilometers by Claudio Aguilera, illus. by Gabriela Lyon, trans. by Lawrence Schimel (Feb. 28, $18.99, ISBN 978-0-8028-5600-5), follows a Chilean child as he crosses mountains and rain forests—traveling more than five miles—to get to school each day. Ages 5–9.\nThe Sky Is Not the Limit by Jérémie Decalf (Mar. 14, $18.99, ISBN 978-0-8028-5602-9) introduces young readers to NASA’s groundbreaking Voyager 2 probe, which has spent more than 45 years observing and exploring our galaxy. Ages 5–9.\nWe Are Human Animals by Rosie Haine (Mar. 7, $18.99, ISBN 978-0-8028-5601-2) imagines the lives of our Paleolithic ancestors and how they shaped what humanity would become. Ages 5–9.\nHow the Sea Came to Be (And All the Creatures In It) by Jennifer Berne, illus. by Amanda Hall (Apr. 25, $18.99, ISBN 978-0-8028-5478-0), is a rhyming history of the ocean—from its evolutionary past to its biodiverse present. Ages 6–10.\nThe Miracle Seed by Martin Lemelman (Mar. 28, $18.99, ISBN 978-0-8028-5590-9). This graphic novel relates the true story of the ancient Judean date palm, which was reborn in the modern era by two Israeli female scientists. Ages 8–14.\nWind: Discovering Air in Motion by Olga Fadeeva, trans. by Lena Traer (Apr. 11, $18.99, ISBN 978-0-8028-5599-2), explores the wind’s role in human history and earth science. Ages 8–14.\nEnchanted Lion\nMy Very Own Special Particular Private and Personal Cat by Sandol Stoddard Warburg, illus. by Remy Charlip (Mar. 7, $17.95, ISBN 978-1-59270-385-2). A lively child is taught a thing or two about boundaries by his most particular cat. Ages 3–8.\nSylvester’s Letter by Matthew Burgess, illus. by Josh Cochran (Mar. 28, $19.95, ISBN 978-1-59270-380-7). A boy imagines the high-octane, action-packed journey his letter will go on to reach his beloved grandmother, who has died. Ages 4–7.\nI Touched the Sun by Leah Hayes (June 6, $18.95, ISBN 978-1-59270-390-6). Undeterred by his family’s doubts, a boy goes on an adventure to meet the Sun and discovers his inner light. Ages 4–8.\nMr. Fiorello’s Head by Cecilia Ruiz (June 27, $19.95, ISBN 978-1-59270-379-1). When Mr. Fiorello loses his prized possession—his luscious hair—he learns to look beyond himself to make space for newness and growth. Ages 4–9.\nThe Truth About Max by Alice and Martin Provensen (Mar. 21, $18.95, ISBN 978-1-59270-375-3). This never-before-published work from the late creative duo follows a mischievous, clever, and independent cat’s daily—and nightly—antics on the farm. Ages 5–8.\nThe Amazing and True Story of Tooth Mouse Pérez by Ana Cristina Herreros, illus. by Violeta Lópiz, trans. by Sara Lissa Paulson (Mar. 7, $16.95, ISBN 978-1-59270-359-3), traces the history of the Tooth Mouse (the Spanish equivalent of the Tooth Fairy) as he adapts to a world changed by urbanization, capitalism, and immigration. Ages 6–10.\nBunny & Tree by Balint Zsako (Apr. 4, $24.95, ISBN 978-1-59270-393-7) is a wordless adventure story about a rabbit and a tree, their surprising friendship, and the distance they go to find a place to call home. Ages 7–18.\nMulysses by Øyvind Torseter, trans. by Kari Dickson (Apr. 18, $27.95, ISBN 978-1-59270-276-3). In this graphic novel that blends The Odyssey, Moby-Dick, and other seafaring adventures, Mulysses accompanies an eccentric collector on a quest for the world’s biggest eye, finding riches, love, and self-discovery on the way. Ages 8–18.\nThe Grammar of Fantasy: An Introduction to the Art of Inventing Stories by Gianni Rodari, trans. by Jack Zipes, illus. by Matt Forsythe (Mar. 21, $27.95, ISBN 978-1-59270-305-0). This collection of essays and activities serves as a handbook for writers trying to find their own storytelling voice. Ages 12–18.\nSeries\nMy Alter Ego Is a Superhero by Håkon Øvreås, illus. by Øyvind Torseter, trans. by Kari Dickson, gains Black (Feb. 21, $9.95 paper, ISBN 978-1-59270-268-8), ages 8–12.\nEnd Game Press\nThe Anxious Lily by Shannon Cook (Mar. 7, $18.99, ISBN 978-1-63797-051-5). Lola the Lily worries that she is different from the other flowers and must discover her true value in order to grow. Ages 4–8.\nThe Dog That Gave My Brother Words by Wendy Hinote Lanier (Apr. 11, $18.99, ISBN 978-1-63797-060-7) tells the story of a nonverbal boy with autism and the service dog who helps him find his voice. Ages 4–8.\nMouse Malachi Discovers the Sabbath by Dreama Archibald (May 2, $18.99, ISBN 978-1-63797-065-2). Mouse Eva introduces Mouse Malachi into the fascinating traditions of the Jewish Sabbath. Ages 4–8.\nThere’s an Elephant Sitting on My Chest by Caris Snider (July 18, $19.99, ISBN 978-1-63797-067-6) guides readers who are feeling the weight of anxiety on how to “shrink” the elephant on their chest through breathing exercises and positive thinking. Ages 4–8.\nUpside Down Dreams by Michelle Curran (June 20, $19.99, ISBN 978-1-63797-075-1). Former Air Force Thunderbird pilot Curran encourages readers to pursue their dreams. Ages 4–8.\nA Country of Their Own by Hope Bolinger (Apr. 4, $18.99, ISBN 978-1-63797-042-3). Priscilla and Carter meet doing community service at a retirement home known as Country Acres, where all the residents look like they’re teenagers, not seniors. Ages 14–18.\nEnd Game/Wren and Bear\nI Made the Earth by Shannon Cook (Mar. 14, $19.99, ISBN 978-1-63797-053-9) encourages children to take care of the earth that God created. Ages 4–8.\nLove Connects Us All by Michelle Medlock Adams (Apr. 18, $17.99, ISBN 978-1-63797-055-3) introduces kids to a variety of family types. Ages 4–8.\nEndless Mountains/Kalaniot\nElla Kvellephant and the Search for Bubbe’s Yiddish Treasure by Jen Kostman (Apr. 25, $19.99, ISBN 979-89-86396-51-4). During a day at the beach, Ella the elephant helps her grandmother find the lost Yiddish language she used as a girl. Ages 4–8.\nAn Invitation to Passover by Rabbi Kerry Olitzky, Rabbi Deborah Bodin Cohen, illus. by Mariia Kolker (Feb. 14, $19.99, ISBN 979-89-86396-50-7). Hannah invites a diverse group of her friends to share a Passover seder with her.\nSeven Good Years: A Yiddish Folktale by Shoham Smith, illus. by Eitan Eloa, trans. by Ilana Kurshan (Mar. 21, $19.99, ISBN 979-89-86396-52-1). When a magician offers a poor man and his family seven years of good luck, the magician is surprised that they have no use for a life of wealth. Ages 4–8.\nEnslow/West 44\nAlways June by Kate Karyus Quinn (Feb. 16, $16.35 paper, ISBN 978-1-978596-38-2). June finds unexpected refuge in the girls’ bowling team after news of her eating disorder sweeps the school. Ages 14–18.\nThe Best Part Is at the End by Mel Mallory (June 16, $16.35 paper, ISBN 978-1-978596-56-6). Movie-lover Anna wishes she could disappear into her TV screen and escape her chaotic life after her pregnant sister moves back home. Ages 14–18.\nCatch Me If I Fall by Claudia Recinos Seldeen (Apr. 16, $16.35 paper, ISBN 978-1-978596-35-1). Angela, a gifted trapeze artist pressured to be perfect, risks disappointing her Guatemalan immigrant family when she takes up boxing, Ages 14–18.\nEverything in Its Path by Max Howard (Mar. 16, $16.35 paper, ISBN 978-1-978596-41-2). When their home is destroyed by a tornado, Noah and his little brother Quinn follow the monarch butterflies’ migration on a road trip hoping to wake people up to the threats of climate change. Ages 14–18.\nEverything You Left Me by Paige Classey (Feb. 16, $16.35 paper, ISBN 978-1-978596-47-4). Maybeth is thrust into an identity crisis when she learns that her absentee father is the lead suspect in a string of unsolved murders. Ages 14–18.\nHeart Like a Broken Arrow by Maija Barnett (Apr. 16, $16.35 paper, ISBN 978-1-978596-50-4). After the death of her younger brother, and later becoming paralyzed from the waist down, 17-year-old Fern overcomes her depression and develops a love for archery. Ages 14–18.\nNo Place for Fairy Tales by Edd Tello (Feb. 16, $16.35 paper, ISBN 978-1-978596-32-0). Openly gay artist Yuriel and his family live in a poor neighborhood in Mexico, but that won’t stop him from playing fairy godmother to his trans cousin, Azul, by throwing her a special quinceañera. Ages 14–18.\nThe Shining City by Demitria Lunetta (Mar. 16, $16.35 paper, ISBN 978-1-978596-44-3). In a climate-\nravaged world, Mal seeks refuge in the Shining City as the sole survivor of his group, but learns that the metropolis is not the safe haven he thought it would be. Ages 14–18.\nThree Shots by Katy Grant (May 16, $16.35 paper, ISBN 978-1-978596-53-5). Daniel learns how to move forward after he loses his skateboarding partner and best friend, Gracie, in a murder-\nsuicide. Ages 14–18.\nExperiment\nWild Child: Nature Adventures for Young Explorers—with Amazing Things to Make, Find, and Do by Dara McAnulty, illus. by Barry Falls (Apr. 4, $18.95, ISBN 978-1-61519-916-7). A young naturalist introduces readers to the joys of the great outdoors. Ages 7–11.\nEye of Newt\nSeries\nYikes! shines a light on What Lurks in the Dark? by Kelly Ward-Wills, illus. by Steven James (June 5, $10.95 board book, ISBN 978-1-77779-182-7), ages up to 3.",
  "word_count": 22479,
  "scraped_at": "2026-02-14T12:00:02.257801"
}