{
  "article_id": "d2bc47a62a02",
  "url": "https://www.slashfilm.com/1416901/the-mask-of-zorro-oral-history-interviews/",
  "title": "  We Were Still Doing Everything For Real : An Oral History Of The Mask Of Zorro",
  "date": "20231211T140000Z",
  "domain": "slashfilm.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "The Mask Of Zorro At 25: An Oral History Of The Last Old School Blockbuster\nHis predictive sci-fi action film \"Minority Report\" was still several years away, but in 1997, Steven Spielberg could already see the future.\nAt that time, Spielberg was an executive producer of \"The Mask of Zorro,\" and during production, he sensed something in the air. In an interview earlier this year, \"Zorro\" star Antonio Banderas recounted what the famed filmmaker told him:\n\"Steven Spielberg said to me once when we were shooting, 'This is probably going to be one of the last Westerns shot in the way the Westerns were shot in the old days, with real scenes and real horses, where everything is real, real sword fighting, no CGI.' Everything was practical. And he said, 'But things are going to change. They're going to change and they're gonna change fast. And so you should be proud of this movie.' And I am, probably even more now than at the time that I was doing it.\"\nSpielberg's prediction came true. While there have been a handful of practical Westerns shot in the years since, none at this budget level have managed to achieve a similar sublime combination of style, stunts, sexiness, and swashbuckling. \"The Mask of Zorro\" felt special when it came out. The casting is pitch perfect, the script is terrific, the score is top notch, the stunt work is out of this world — everything about it just works. As an elegant blending of origin story, \"passing the torch\" tale, and superhero action flick (despite Zorro technically not being a superhero), this movie should serve as the gold standard for modern movie studios obsessed with intellectual property. An argument could be made that Hollywood still makes movies in this vein these days, but it sure as heck doesn't make them in the same way.\n25 years after its release, I wanted to learn about how \"The Mask of Zorro\" came together. Over a dozen people who worked on the film told me about the film's multi-year journey to the big screen, the directors who came and went, a sickness that swept through the crew during production, government corruption, failed explosions, and much, much more. This is the oral history of \"The Mask of Zorro.\"\nChapter 1: Earliest days\nWriter Johnston McCulley created Zorro in 1919. After successful movie adaptations in 1920 and 1940 starring Douglas Fairbanks and Tyrone Power, Zorro headlined a live-action Disney TV series in the 1950s. But in the years that followed, the character faded for American audiences. By the time the late 1970s rolled around, the masked hero was all but forgotten in the pop culture zeitgeist.\nJohn Gertz, co-producer: I'm the CEO and president of a company called Zorro Productions. As such, we own all the rights to the character — all the copyrights and trademarks. And when I took over the property back in the late '70s, those rights and maybe 25 cents might have gotten you a cup of coffee somewhere, because coffee was cheaper in those days. It was considered to be an old washed-up thing. So together at that time with my twin sister, Nancy Larson, she and I started developing ideas and concepts for Zorro and hitting the streets in Hollywood and trying to sell them. And we succeeded. We got some TV series up and running and did the film \"Zorro the Gay Blade,\" and so on.\nIn the late '80s and early '90s, my sister and I decided that maybe it's time for a major motion picture, and we began to develop a concept for it. And my twin sister wrote a screenplay. She's a very good screenwriter, and she wrote a wonderful screenplay, and we decided to shop it in Hollywood. We had a young and aggressive agent by the name of Michael Siegel, and we arranged for an auction. The way it was set up was that we invited all of the producers in town — large studios and independents and so forth — all to pick up their copy of the script at precisely noon Pacific time at the agency office, and we would accept bids on Monday morning. The ploy worked. On Monday morning, we actually had offers come in, but one that we did not receive was from Amblin. Somebody over there sent a simple note, saying, \"No, this not a project that we'd be interested in.\"\nWe then went down the road with one studio or another for a bit, and suddenly we get a call from the head of TriStar Studios, who said that they're going to make a better offer than anybody. And the crux of it is they've got a filmmaker that's going to knock our socks off. So we went to the table with them, and I spent an entire day, myself personally, in the room with the head of TriStar and the head of business affairs there, negotiating the deal in excruciating detail. But at the end of the day, the numbers worked. But I said to Mike Medavoy, who was the head of TriStar Studios at the time, \"The numbers worked, but it's all been contingent on this mystery filmmaker you've got.\" And he asked everybody else to leave the room, including my agent and everybody on his side. So Mike and I were just alone in the room together, and he put his feet up on the desk and lit a cigar and said, \"It's Steven Spielberg.\"\nAt that time, he was filming [\"Hook\"], the Peter Pan movie with Robin Williams and Dustin Hoffman. And apparently Mike Medavoy just went up to Steven and said, \"Hey, listen, I've got this Zorro thing. Would you be interested in Zorro?\" And Steven said, \"Zorro! I grew up with Zorro. I love Zorro. I can't wait to do Zorro.\" Okay. So whoever it was that rejected it at Amblin had never bothered to ask Steven, apparently.\nSo then I left the room. I said, \"Mike, I got to speak to my twin sister and partner in this.\" So I left the room to call her, and I said, \"Nancy, the numbers work, trust me on that, and the filmmaker they have in mind is Steven Spielberg.\"\nAnd Nancy, to my amazement, started screaming at me, \"Get the hell out of that room. Get out of there. Run to the parking lot, get in your car and don't look back.\" I go, \"What's wrong?\" This was the complete opposite reaction from what I expected. And Nancy said, \"He's not going to make this movie, and I'm going to be the first one he bumps off the project.\"\nIn the meantime, TriStar agreed to pay Nancy a huge sum of money for a script, never mind on top of that, a rights deal for us, for my company. Anyway, so the next thing is Nancy was flown down to Los Angeles to meet with Steven, and she was offered the chance to write the second draft. But she got out of that meeting — Nancy's got a lot of artistic integrity, and she came out of that meeting and said, \"You know what, John, make the deal. Steven will make a tremendous movie. I'm sure it'll be fantastic, but I don't share his vision. I don't want to be the writer.\" Because Steven wanted to do a \"passing of the sword\" story, a father-son tale, which is a leitmotif that runs through a lot of his work, as I'm sure you know, and Nancy didn't want to tell that story. So she walked out of it. That's the genesis story for the movie.\nRandall Jahnson, writer: I started working on it in 1991, and I was in the sort of zeitgeist, I guess you would say, at the time, because the movie \"The Doors\" was coming out and I was, along with Oliver Stone, one of the screenwriters on it. We shared credit on that. So when that happens, at least ... [this] is last century kind of stuff, but when you have a movie coming out, you're kind of hot. And it's a little bit not unlike professional sports, where you're on a good batting streak or something like that. So your agents will certainly say, \"Hey, take advantage of this momentum and let's get the next big gig that maybe can come your way.\"\nI was actually writing something else for another company. And then I got this call from my agent, who said, \"Would you be interested in writing a revamp of Zorro?\" That's quite a turnaround from \"The Doors.\" And I thought, \"Well, yeah, maybe.\" And they said, \"It's for Spielberg.\" And I said, \"Oh, I'm in. Please.\" So we had to put a pin in what I was currently working on, which was about the shootout at the O.K. Corral, which is a whole 'nother story, and then ask, \"May I please have an exception to go work for Steven Spielberg on this?\"\nJohn Gertz, co-producer: It takes a long time to get a movie made, but it was shocking how long it took ... the agreement I entered into then was dated 1991. I think it was April, if I remember correctly, but it was 1991. And the film got green-lit for production, I guess it would've been in '96 and produced in '97 and released in '98, something like that.\nRandall Jahnson, writer: I met with Steven on — I wrote some days down — May 31, 1991. So this was a good seven years earlier from when the movie was released. [...] You don't get to meet Spielberg right away. You have to sort of go through channels. So I went out to Amblin a couple of times and met with their development staff, and I'd really like to recognize the two women that were heading his development project at that time: It was Kathy Stewart and then Deb or Deborah Neumeyer were there. So I met them first and they had read some of my work. So they said, \"Hey, listen, we're really interested in you. Steven wants to set it during the California Gold Rush. How do you feel about that?\" And I said, \"I love that because I'm a big history buff, and especially Western history.\" And I said, \"I think that's really an interesting concept.\" And they said, \"Okay, great.\" [...]\nRandall Jahnson, writer: I was given the green light to meet Spielberg. So that came on May 31, 1991. So I got the call and it's like, \"Okay, you're going to meet him. He wants to meet you, but it's not going to be at Amblin. It's going to be at MGM where he is shooting 'Hook'. So he wants you to come down and meet him at his trailer down there.\" And I go, \"Oh, okay. All right. Well, that's pretty cool.\" So I went down and was ushered by one of his handlers, gofers, down to the trailer and they said, \"He'll be here in just a few minutes.\" So I was waiting around and then boom, the door flies open and in comes Steven. And he's just as charming and boyish as you can really imagine, very enthusiastic and stuff. \"Hey, how are you?\" And just immediately gets right down to it.\nHe said, \"I haven't seen 'The Doors' yet. I'm really kind of square when it comes to rock and roll and stuff, but I don't know, I've heard you might be the right guy for Zorro. So what do you think?\" And I said, \"Well, I'm really interested, for the same reason — I love California history, love Western history.\" I said, \"If anything, I would be interested in making Zorro more ethnic, making him more brown-skinned, more of a traditional Mexican/Latino character.\" I knew that Johnston McCulley, who had created the Zorro character, had been a journalist and kind of an amateur historian. I knew that he was very conversant in California history, and he no doubt drew from Joaquin Murrieta and Tiburcio Vásquez, who were famous, storied, Robin Hood-like characters from the Gold Rush period. I said I would like to go back to those roots and get away from the Guy Williams, the real Anglo-looking guy from the old Zorro TV series and stuff.\nSpielberg said, \"Yeah, yeah, yeah, that's great. That's great. It's really cool.\" He said, \"I would love that. I want this whole thing to read like a history lesson. I want the Bear Flag Revolt. I want Joaquin Murrieta, I want the beginning of statehood, the Mexican War,\" all this kind of stuff. And I was like, \"Okay. Whoa, that's a big canvas, but sure.\" We were very excited about it. Our conversation was — we had only [gotten] about 10, 15 minutes into it when somebody came in and said, \"Steven, they want you back on the set.\" So he said, \"Oh, okay, look, just wait here. If I'm not back in 10 minutes,\" he said, \"just come on down to the set and we'll continue the conversation there.\" And I was like, \"Really?\" And off he goes. And I said, \"Please God, make him not come back to the trailer.\" So a few minutes later, the handler came back and said, \"He wants you down on the set.\" I said, \"Okay.\"\nI remember this so vividly ... I remember going out the door and coming out, and coming up is George Lucas and Carrie Fisher. I remember Lucas just looking at me and saying, \"Hey, is Steven in there?\" And I said, \"No, he's down on the set. Come on, follow me!\" [laughs] Oh my God. Never met before. So yeah, it was something I can't believe. Already this day is something I'll never forget.\nSo we go on down, and he was shooting in the old sound stage where \"The Wizard of Oz\" was shot. I forget if it was Stage 2 or 3, but it was one of the great, storied, ginormous facilities. And we came in and it was unbelievable, the set. He had the whole ship there, the lagoon, and literally a cast of dozens, if not hundreds, of extras — pirates and villagers.\nThe camera rig was set up in the stern, so we weaved back through that. And there's Steven there, and Kathleen Kennedy was there. She was still a mainstay at Amblin that time. And she was very sweet, very nice. She'd said she'd read some of my stuff and thought it was really good. \"We're really happy to have you.\" Just really, really welcoming. And Spielberg then just ... everybody in the crew was moving around and setting up the next shot, and he said, \"Oh, here, meet Robin Williams.\" And everyone comes over and there's Robin Williams, who seemed to be very preoccupied. I saw him kind of talking to himself. I think he was going over lines to himself there.\nAnd then Dustin Hoffman, \"Oh, Dustin, come over here and meet Randall. He's a writer.\" He didn't break character. He was completely in costume and he put out his hook to shake my hand, which I had a hat on, and I bowed and genuflected as well. And I said, \"I think your reputation precedes you, my Lord,\" something like that. And he goes, \"Argh.\" [laughs] But it was pretty funny.\nSo then Steven just started going right into it again. \"So what do you think about the Bear Flag Revolt and this and that?\" And I said, \"Well, all that stuff is really, really cool. We just want to have a story that fits all this stuff. It's a big canvas.\" He's like, \"Yeah, yeah, I know. I just get really excited.\"\nI remember this very distinctly: He said, \"Apart from I want it to read a history lesson,\" he said, \"don't worry about the action. Just give me a great story with great characters and don't worry about the action too much, okay?\" \"Okay, you're the man.\" And then [he'd raise a] finger. \"Hold on just a second.\" And they would do a take and he would cut and then turn around to me and just pick up right exactly where we left off. It was pretty astonishing. I'd never seen anything like it. And this went on for 20 minutes or more, where they're doing that setup there. I'd never seen anyone compartmentalize like that. And it wasn't like he's a machine. It wasn't like he was sort of robotic or doing things by rote at all. I mean, he knew what he was doing for the direction, but he turned around, he looked me in the eye. It was a meaningful conversation. He was taking in everything that I was having to say about it, and I felt it was landing. So it was pretty astonishing. It was a great day.\nChapter 2: Pitching Spielberg\nRandall Jahnson, writer: So he turned me loose and word came back I had the job. So that's good news and bad news, in a sense. The good news is you're working for Spielberg. The bad news is you've got to come up with a story now actually, because they really didn't have a story. They were totally open to new ideas. They wanted to bring fresh blood to the Zorro franchise.\nOnce that initial exhilaration was gone and the deal was being negotiated, I was going, \"Oh God, oh man, what is the story?\" So I had to go out and actually pitch to him. Before I committed to doing any kind of writing whatsoever, I had to go out and pitch the story verbally to him. And I went out twice. And both times he was underwhelmed. He said, \"Yeah, I'm just not hearing something that feels fresh to me.\" It just didn't feel like it was something that he wanted to do. And I started getting pretty nervous at that point. They don't tell you, but it's pretty much third time at bat, and if you don't hit it out of the park at that point, you're kind of, \"Thanks, but no thanks.\" It's onto the next.\nI was scared, frankly. I was really scared, because the issue for me was that I was trying to give him what he wanted, which is set during the California Gold Rush. But the California Gold Rush, gold was discovered in 1848, and then the rush started in 1849 and then into the 1850s. The Bear Flag Revolt was slightly before that time. So California was essentially sort of independent, and then statehood came in right on the tails of the Gold Rush, of course. So to have Zorro be Zorro as kind of the wise and crafty Don, well, most of those guys were gone. Their lands had been taken from them. So we were talking about two different eras. In other words, Zorro couldn't be Zorro, to own the great rancho. The halcyon days of California? Those days were gone. Now it was different, and I just had a hard time reconciling the history with what Spielberg wanted.\nI swear it was not until the night before that I had to go out and meet with him that it came to me, finally. And it's just like, duh, there's two of them. Of course! There's two of them, and it's about passing the torch. It's about what happens when you're kind of a superhero, for lack of a better term, and you're just getting too damn old to do it anymore? And that's where it just suddenly clicked. So I rapidly came together with this scenario of where, at the very beginning, we'll see the original Zorro in Mexican or Spanish California in all his glory, saving a group of campesinos from a firing squad for stealing loaves of bread or something like that. And then I thought, Oh, Joaquin. We could have little Joaquin be an orphan! It just started magically coming together.\nI was literally still making it up as I was driving out to Universal. I'd gone to UCLA film school, so I was living still on the West side of L.A. at that time. So it was a long drive out there to Amblin, so I had some time still to keep making it up and talking to myself and pitching it to myself in the car.\nI got out there and ushered into his office, and he sits down on the couch and it's like [crossing his arms], \"So what do you got?\" And I think he was not expecting me to ... maybe I was going to whiff again.\nSo I started pitching this thing with the opening and there's going to be a firing squad and this and that, and then Zorro comes and saves the day. And we have these two orphan boys running around in the midst of the interaction, and they see him and they talk ... he is a real life hero to them. And I remember it was just like ... when he gets something, I mean he listens, and then as soon as he gets the beat, he'll just go, \"Yes,\" and nod. And that's code for just, \"Got it. Move on to the next thing.\" So I started getting, \"Yes, yes, yes.\" And then at one point I think, Oh my God, I got him on the line. I've just got to reel it in. And I kept imagining, I kept hearing the ringing of a pinball machine as I was scoring points: ding ding ding, ding ding ding.\nRandall Jahnson, writer: I carried on through this whole thing of at the very, very beginning, and he saves the boys and he gives a young Joaquin the medallion and he said, \"Thank you. You saved my life. I will always remember you.\" And then he rides off, and the image was a classic image of him rearing on Tornado against the setting sun and waving, and then [going] down. But I said we switch angles from that to when he comes down and he slumps in the saddle. And we didn't know, but in this fight, he had gotten wounded and he was bleeding badly. So we follow him back to his rancho, and we go through kind of a hiding place, but he goes back to the rancho and he's bleeding and needs help. So his loyal assistant takes him, summons a doctor, but the doctor is not a good guy and figures out who he is and uses that as a means to turn him in and advance his career, so to speak.\nIt ended with the old Zorro being dragged away by authorities. And his infant daughter, or very young daughter, was screaming for him. He did not have a wife. He was a widower, as I recall. That was a big difference there. So anyway, he's dragged away, and boom, we cut to 20 years later. And we're now with Joaquin Murrieta, and we ultimately see him robbing some guys, he and Three-Fingered Jack or whatever, and he's in the midst of a robbery. And in the course of it, we see this medallion around his chest. And we thought, \"Oh wow, Joaquin's a juvenile delinquent now.\" I mean, he's grown up, he's a badass guy and everything. And what has happened in those 20 years is the Gold Rush has happened. California and the beautiful halcyon days of California, those are gone. And now California's just been run over by stuff.\nWe see him make a robbery, but then Captain Harry Love and the California Rangers come after him and in a run and gun battle, his brother is killed, and Joaquin barely gets away and Three-Fingered Jack barely gets away or whatever. And he's destitute and finds himself hiding out in the ruins of the old rancho. And that's when the old Zorro shows up and he is teetering around, and then Joaquin's going to try to steal his horse, and the old man is very good. And then he sees the medallion on him and he says, \"Where did you get that?\" And anyway, that set it up. I carried it a little bit forward, but basically that was the setup. They realized they had a common enemy ...\nAll the rest was going to be invented, but I just felt like if I could just get him hooked on that, and I finished at that point and just kind of quickly just summed it up and Spielberg just jumped up. He said, \"I love it. I love it. I love it.\" He said, \"This is great.\" He's like a 12-year-old kid jumping around there or whatever. And he said, \"Do you think we can get Sean Connery to play the old guy, the old Zorro?\"\nThen the pressure was on to really make all this stuff work. So I delivered four drafts for them ... there were nine writers on it in all. I think there were 32 or 50 drafts of it when it was all said and done. I remember standing next to all of [the scripts] at one point that had been given to me by the Writer's Guild to help determine credit, and it was just pretty astonishing. [...]\nTerry Rossio, writer: The first thing that comes to mind when I think about \"Zorro\" was the moment when I first became aware of the project. [My writing partner, Ted Elliott, and I] were just starting out in the film industry and back then, the internet wasn't a thing, so it was very difficult to get information. You had the trades, Variety and Hollywood Reporter, but that was pretty much it. There was nothing available \"behind the scenes.\"\nExcept for one source. There was an obscure magazine called Film Journal, targeted to distributors, and once a year they would publish an insert called The Blue Pages. Why they did this, I have no idea, but the Blue Pages would detail every project in development at every studio, hundreds of projects. I remember coming to the end of the list one year — projects were arranged in alphabetical order — and there was Zorro, to be made by Steven Spielberg!\nMy mind was ablaze. A Zorro film made by Spielberg? How cool would that be? And at the same time, there I was, sitting in my rented room with three roommates in an apartment on Balboa Island down in Orange County and thinking, how in the world could somebody ever get a job like that? It seemed impossible — as far away as walking on Mars.\nSo several years later, it was so incredibly strange to get a meeting to pitch on the project. It was an \"open writing assignment,\" so the process was, you get a call from your agent, you schedule a meeting, and go in and pitch your \"take\" to the executives, in competition with other writers.\nWe had a particular approach: Explore the adventures of Don Diego de la Vega in Spain, as a set-up to his return to California, where he would continue to face off against a rival and continue a love triangle romance. As far as we knew, this hadn't been done before. We also had the element of a villain attempting to buy California from the United States using gold he'd secretly found in California.\nSpielberg must have liked something we said, but he came back with his own structure — he wanted a \"passing the torch\" of Zorro to one of the Murietta brothers. So we adapted our story to his structure for a second pitch, and that became essentially the shape of the film that was made. All in all, as I recall, the whole process was a whirlwind two or three weeks.\nRandall Jahnson, writer: When ultimately I met Rossio and Elliott at a Writer's Guild function and we started comparing notes, they go, \"You came up with the old Zorro/young Zorro thing?\" And I said, \"Yeah, that was me.\" And he said, \"Oh, wow.\" I said, \"You guys didn't know that?\" \"No, we always thought Spielberg, it was his idea.\" \"No, no man. That's why I'm sharing credit with you guys.\"\nJohn Gertz, co-producer: I guess we were being naive at the time. Well, I think we all were. [Spielberg] said he was going to direct it, but once the deals were signed and so forth, it became apparent that really, he was not going to be directing it.\nChapter 3: Mikael Salomon\nIn 1993, cinematographer-turned-director Mikael Salomon was hired as the director of \"The Mask of Zorro.\"\nMikael Salomon, director: I took over a [film] for Disney, and Steven Spielberg was the producer on it — not [officially], I think, but he was the one who came to me, because the movie I ended up doing was \"A Far Off Place\" with Reese Witherspoon. And it was a project I always kind of liked, and I was a DP. And I said to Kathy Kennedy, who produced several things that I was involved in as a DP, \"If it ever gets around to that, I'd love to be involved.\"\nThey gave it to a French director, \"A Far Off Place,\" and Frank Marshall offered me [the DP job on the Andes Mountains plane crash survival film] \"Alive,\" because, \"You've done sand, you've done water, you've done heat, you've done, how about some snow?\" I said, \"Snow? No thanks.\" I've done my snow, because I'm from Scandinavia. [I've done] I don't know how many shows in the snow. And also I wanted to start looking for a project to direct.\nSo one day, Kathy Kennedy calls me from the glacier up in Canada where they were shooting \"Alive\" and said, \"Can you call Steven? They have some problems on another movie.\" \"Oh, I know that one,\" I said, \"you gave me the script a long time ago to read.\" \"Call him.\" So I ended up doing [\"A Far Off Place\"]. Steven really liked it. That's the short story. And he said, \"You're going to do 'Zorro.'\" I said, \"Yes, sir, I'd love to.\"\nHere's the unverified version, because my memory is not that great, but Branko Lustig became the producer ... he was the producer on \"Gladiator.\" He did \"Schindler's List\" with Steven. So I said, \"Yeah, can't do better than that.\" So he and I produced a budget. We went to TriStar and said, \"Here's the numbers.\" I can't remember the numbers we came up with, I think it was 45 million dollars. And they said, \"That's too much money. We will spend 35 million dollars. That's it.\" So we went back to the drawing board, and this took — I was shooting commercials at the time, and we worked on the budget again. Months went by, we go out to TriStar again, and we said, \"45 million dollars.\" Again, they said, \"No, no, we can't do that.\" And it kind of ended in a stalemate. We said, \"We can't do it for less than that.\" So at one point I said to Steven, \"Steven, I need to entertain other offers, and I love the fact that [you're working on this], but this has been going on for two years or something like that.\" And he said, \"Go with God. That's fine, and we'll do something [else together].\"\nAnd then I think Robert Rodriguez got involved, and as I heard — this is only hearsay — exactly the same thing happened. He said, \"This can't be done for under 45.\" So Martin Campbell came up and said, \"I can do this for 35 million dollars.\" And they said, \"Okay, you got the job.\" And I think the movie cost 50 million. [laughs] [Editor's note: The final reported budget ended up being $95 million.] So I learned a lesson, a very serious lesson about that. And it's not a good lesson, really: That you should lie, lie, lie, even though you know what the facts are.\nMikael Salomon, director: Viggo Mortenson, I remember, read for or had a meeting for the sheriff, I think it was. Sean Connery was involved at one time [as Diego de la Vega]. Steven said, \"No problem with him. I'll take care of him. He could be a little grouchy, but I'll be there with you.\" Who else was [in the mix]? Some big — oh yeah, Tom Cruise. Early on, [Spielberg] wanted to offer it to him. Have you heard that? He wanted to offer it to Tom Cruise. And my friend and countryman Bille August had done \"The House of the Spirits\" with all non-Latinos, and he got in so much hot water because of that, and they picketed the movie in South America. And I said to Steven, \"You know, that's probably not a good idea, just for that reason.\" This is unverified. But apparently he offered it to Tom, because one day I was doing a commercial and my assistant said, \"Mikael, there's Tom Cruise on the phone for you.\" \"Tom Cruise? Okay.\" I had worked with him on \"Far and Away.\" I was the DP on \"Far and Away.\" So he called me up and said, \"Thanks for the offer, but I think it's not a great idea for me to do this movie because, as you know...\" I said, \"Tom, you're a very smart guy. Absolutely, you're absolutely right.\" [...]\nThe guy I wanted ... Andy Garcia was the one who, I was talking to him, we had great meetings, but then it all petered out. It became Antonio Banderas. I thought it was a great movie, but it wasn't the movie that I envisioned originally. [...]\nWe hadn't hired a production designer or anybody like that. And usually, I like to do storyboards, but it was still all in the deal-making. And to be honest, I was busy, and I loved the idea of the project, obviously, with these guys involved, Branko and Steven, so there's not much to think about here. But I didn't really get into it. I know I was talking to, [Spielberg's longtime editor] Michael Kahn was going to edit it. He had agreed to edit it, and I think [Spielberg's now-frequent collaborator] Janusz [Kamiński] was interested in shooting it ... he was definitely around, because I remember when I was working with Steven as a DP, I actually visited him in Krakow where he was [filming] the first project he did, \"Schindler's List,\" with Janusz. That was obviously before this.\nChapter 4: Robert Rodriguez\nBy 1995, Salomon had left and the project had a new director.\nJohn Gertz, co-producer: So the director that [Spielberg] then brought on board was Robert Rodriguez.\nDoug Claybourne, producer: We went out and scattered locations and we took Robert out to see them and he approved the locations, but I never really got a chance to speak creatively. I mean, I was basically overseeing the production of the picture, but Steven and two development producers were working with Robert in terms of the creative vision for the picture. He had worked with [production designer] Cecilia [Montiel] before, so she and Robert were completely in sync. And then ultimately Cecilia stepped into the movie with Martin [Campbell]. But I don't know how different [Rodriguez's] vision was of the picture to Martin's. I don't honestly know that. He was a quiet kind of character as well, so it was a little more difficult to get to know him.\nJohn Gertz, co-producer: I took a creative meeting with Robert. I'm working with him now on a different project, on a Zorro TV series. But at that time, he was a young creative star guy, and he gave me his great vision. The part that stands out is when he says, \"And then Zorro's going to lop off the villain's head, and it's going to go bouncing down the stairs, bloop, bloop, bloop, down the stairs!\" And I'm thinking, \"Zorro lopping off heads?\" [laughs] I'm going, \"Oh, no!\"\nTerry Rossio, writer: I recall a production meeting with Robert, also his wife Elizabeth Avellán as producer, and the production company and studio. This was around the time Robert was finishing post-production on \"From Dusk to Dawn.\" Later, we had a meeting at Robert's house, and I was super impressed that he had a nonlinear video editing system set up in his living room. At the time, to have your own editing system was kind of a big deal. Those gig drives cost tens of thousands of dollars! But it was all in keeping with Robert's style of filmmaking, which was to do everything himself, hands-on, on his own.\nJohn Gertz, co-producer: All I know is that eventually what happened was on a Friday afternoon, he was the director. On some weekend, he had meetings with Spielberg, and by Monday morning, he was out. What happened and why? I never got the straight story to my satisfaction of what that was. It would be hearsay anyway, but it would be fascinating if you could figure out what happened in the room between Spielberg and Robert Rodriguez that got him bumped.\nRay Zimmerman, physical production executive: It was early in my career. I started at Sony in 1995 and did \"Mask of Zorro\" in '97. It was just such an interesting time in the business, but it was also, for me, just being new in that job, it was a real big job. And I was working probably like 15-hour days for about the first year and a half or so, and I was just kind of getting into my rhythm and kind of understanding what the job was about when \"Zorro\" came along. [...]\nSo all of a sudden I'm called into this one meeting. And it's Spielberg and Laurie and Walter — [executive producers] Walter Parkes, Laurie MacDonald — and then Elizabeth Avellán, and the director was Robert Rodriguez. And then there was all the studio people. It was Stacey Snider, Marc Platt, the co-presidents, Gary Martin, the president of physical production for the whole deal. He was my direct boss. We all thought it would kind of be a rah-rah kind of event.\nI get there and we sit down, and there's Robert at one end and everybody else is kind of down at the other. And Steven starts talking about the script and the structure and kind of his philosophy, as he does, which is great. It's always great to hear the wise man talk. And he turns to Rob, then he brings up the thing about the budget. And I think the budget, it was at that time around, as I recall, around like 35 [million dollars] or something like that. And Steven says, \"Well, we have to get the budget down, but I'll help you. Don't worry, I'll help do that.\"\nAnd Robert took umbrage. There was clearly some other stuff going on before the meeting had happened, but he took umbrage for this. And he stood up and said, \"Look, I'm not interested in cutting the budget. In fact, we need more. I think we need more, like 40 million.\" And Spielberg had this script and he just went bam, and slammed it shut. And he looked at Robert, and Robert just walked out of the room. Holy s***. So it's like, \"Ray, welcome to the film business.\"\nNow Elizabeth was Robert's wife and she was [going to be] a producer of the movie, and I'd known her. Actually, my wife had worked with Robert on \"Desperado.\" And so I had a relationship, a personal relationship, with him on that. So after the meeting, Elizabeth comes out of my office [and said], \"What are we going to do?\" I go, \"Just chill out. We're going to find out.\" Cut to: They already had Martin Campbell in the wings.\nChapter 5: Martin Campbell\nAt that time, Campbell was hot in Hollywood after directing \"GoldenEye,\" which rejuvenated the James Bond franchise.\nJohn Eskow, writer: I had written, at that point, three or four Westerns. I was kind of known as a guy who was good at Westerns. I love Westerns and I had written one recently for Fox, which was a very different take on the story of the Alamo. As a result of that, I got a call from an executive at TriStar saying, \"We have a project that I'm sort of asking for your help on.\" And that was not \"The Mask of Zorro.\" That was a script that was, at that point, 30 or 40 years old. It had originally been meant to star Steve McQueen. That's how old it was ... so I got this call from TriStar and they said, \"Martin Campbell,\" who at that point was just really taking off as a really super hot director, \"has read this, and he wants it to be his next movie.\" [...]\n[So] every morning at eight o'clock, I'd get up, leave my hotel and drive over to the Fox lot, which was where Martin's office was. And there was nobody else on the freaking lot. It was just basically me and him, because everybody was on vacation [in August], but we were having a great time working on this other Western. But all of a sudden, with a great air of mystery, Martin would disappear for four hours at a time, leaving me alone on this sweltering empty lot.\nFinally, it happened so many times, that I got a little mischievous, and I poked around in his desk and I saw a script for a movie called \"The Mask of Zorro.\" And I flipped through it a little, but it didn't appeal to me at that point. I was really all-in on this other Western.\nSo one day, he came back from a four-hour meeting, and I said, \"Martin, I got a confession to make. I peeked at your desk and I know about this movie that's in development, 'The Mask of Zorro.' And if you feel that you have to leave this project to go do that, I will understand and hopefully we will revisit this movie. But just one thing that you ought to know is, don't ask me to rewrite this one. I'm not interested.\"\nNeedless to say, 48 hours later, I was signing contracts to rewrite this one after having made my grand proclamation. And we put the other one aside and unfortunately never got back to it. It would've been a great movie. So we just flipped over from \"Running the Big Wild Red,\" it was called, to working around the clock on \"Mask of Zorro.\" Because the situation at that point was really intense and pressured.\nWe were told that Antonio and Hopkins had problems with the current draft. I saw the potential riches, let's say, that were there. And Rossio and Elliott are very good on plot, they're excellent at that, but it was really felt that the script needed a radical rethink — \"fresh eyes,\" as they say. So I was the fresh eyes. And because Martin and I had set up this wonderful work rhythm on the earlier Western, we hit the ground running on \"Mask of Zorro.\" I wrote it really quickly ... And also surprisingly quickly, word came back that the studio really liked it, that Banderas and Hopkins really liked it, and it was a go movie. It hadn't been greenlit yet.\nGeorge Parra, first assistant director: Martin Campbell is probably one of the most prolific directors there is. He can direct anything. I mean, he resurrected the Bond series, and he's just a craftsman director. He directed a lot of great films, so it was a pleasure to work with him. And we had a lot of good times and laughs. So I mean, the overall experience was a giant adventure. From the beginning to the end, there was so much going on.\nThom Noble, editor: He is the hardest working director ever. He never stops. Never, never, never. It's just on and on and on. He's absolutely the most enthusiastic, the most on top of it guy I've ever come across.\nDoug Claybourne, producer: [My biggest challenge] was get getting through the transition between going from a director that walks off the show because he's not happy to a new director that I didn't know. I mean, I knew his movies, but then transitioning from that to literally, I had hundreds of people on the show starting and I had to let everybody go. And then find out, \"Well, what's Martin going to want? What's he going to like?\" We took him on a location scout. Am I going to be on the show? Who knew? I had no idea if we'd get along. And then who are we going to be able to hire back if, in fact, I'm involved at all? So I think that was the biggest challenge for me in the movie. It was just making the transition work if it was going to work at all. And then what's the difference? What's the movie? How are we going to save the movie and still make it a good movie?\nChapter 6: Pre-production\nWith Campbell on board, pre-production ramped back up as the film raced toward its start date.\nDoug Claybourne, producer: We had prepped 20 weeks with the whole crew, and then we started all over again with Martin and prepped yet another 20 weeks. And Martin ended up basically hiring substantially about 90% of the crew that we had on board already. I mean, the same production designer, I ended up staying on as one of the producers, and about 90% of the locations he liked that we had chosen.\nBut then he went back through and really prepped the movie himself, made changes. That's when Anthony Hopkins came on. So it was a huge prep on the movie. It took a long time to get it set up. [He was] very focused on his prep. He came in early every morning, an hour or so early, to work out his shots for the day. Very prepared. He was probably one of the most prepared directors I've ever worked with. And lovely to work with. He was a real gentleman.\nJohn Eskow, writer: I wrote, I think two or three drafts as this was all coalescing, and now locations are being scouted. And I'm writing a lot of drafts, getting a lot of notes from Spielberg and from Walter Parkes and Laurie MacDonald. It seemed like we were all in complete agreement, but there was one issue that we weren't, it turns out, in complete agreement on. And that was they wanted — or at least Spielberg wanted — for the dialogue to be very period, sort of flowery, 19th century-sounding, a lot of which you hear in the movie as it stands. I didn't want that. I wanted less of that. And frankly, that's my one only serious problem with the eventual movie that we produced. And it's not a big deal, it's just how I feel. The point I kept trying to make was in writing period movies — and I had written a lot of them — it's important to remember that people back then didn't know they were talking period, flowery ... it's just how they might have talked. So you have to find analogous ways of human speech. You don't want to be writing a movie about a troubled prince in the present-day and have it be Hamlet doing Shakespeare.\nSo as the summer turned into fall and the start date approached of shooting, I kind of made my disagreements known, and I think I probably did that too forcefully. I mean, I was passionate about the movie. I loved the movie by this point, and there used to be, and I forget who said it, but a line from Shakespeare, I think, \"He loved, not wisely, but too much.\" I loved it, not wisely. I fought a little too hard. And I forgot the first rule of being a screenwriter, which is that you're not the boss. And I think I trusted my passion for getting it right would immunize me against friction with the producers. I think I thought that all the way up until the day when Martin Campbell called me up and said they were getting another writer.\nThey felt the movie was locked-in at that point, but they wanted someone who, number one, was available to go down to Mexico on location to shoot, which I was not, and two, was on board with the what I would call flowery dialogue concept. Having said that, it doesn't seem to have bothered a lot of people, the flowery dialogue thing. So who's right, who's wrong? It's all silly at this point. It's water under the bridge, because going back to Rossio and Elliott, with their excellent plotting and their interesting little twists that they programmed into the story, going then through me giving it a more modern, I think what people said at the time was hipper, more hip character in Banderas.\nI added a lot of things like Captain Jack forcing them to sing, Banderas and [his brother] when he is leading them through the desert, which people love, I have to say. That just gave the movie a fresher, funnier sensibility. I think my favorite contribution to the whole movie, we were also watching a lot of Sergio Leone Westerns, Martin and I. And I wanted to somehow program into the opening a Sergio Leone moment.\nRossio and Elliott had written the opener, the execution, which of course has been in a lot of movies, but always works. And so suddenly, I just sat up in bed in the middle of the night and I had what I wanted, which was the image of the kids cutting the eye holes in the wanted poster and looking out, having that image, it was as if you were saying to the audience, \"You are going to be seeing the movie through these eye holes of these kids.\" Several levels of playfulness there. We just relentlessly went through the script, adding bits of business, simplifying certain overly-plotted things, but very much fueled by what Rossio and Elliott had started. They came in after Jahnson. So I guess I should say what Jahnson and Rossio and Elliott had done.\nTerry Rossio, writer: One interesting moment came during rewrites in pre-production. Anthony Hopkins had read the screenplay, and told us, \"There's a scene missing.\" Hopkins pointed out there was not a scene where Diego de la Vega got to speak with his daughter Elena alone, one on one, with him not able to reveal the truth. \"It's like two ends of a triangle haven't been connected,\" he said, and he was right. That led to us writing another scene in the stable, the one where the horse is groomed. Diego and Elena are able to connect as adults on an emotional level, and of course it's an absolutely necessary scene.\nGeorge Parra, first assistant director: Pre-production was long and wonderful. There were lots of pre-planning and a lot of horseback riding lessons and sword fighting lessons and choreography and scouting. And it took months to prep that film, and Martin does it properly. So it took a lot of time, and the studio gave us the money to do it.\nDoug Claybourne, producer: Mexico had a couple of trade unions at that point. They covered the below the line crew and we needed to make some kind of deals with them for their work on the show, because we wanted to be covered by the trade unions that represented the local grips, electrics, carpenters, et cetera. And those were kind of tricky deals to make, and I worked through my local production manager to negotiate those deals. And at a couple of points, it got a little sticky with the trade unions, and as I recall, there was some kind of negotiation that — and I have to be honest with you, I don't remember exactly the details — but they either wanted more money than we could afford or they wanted to hold back on services.\nAnd at some point, I remember that I let everybody go. I literally fired the entire crew, basically as a negotiation — I don't want to say \"ploy,\" because we were serious. Based on the rates that they were talking about, we couldn't proceed. Because we were going to hire hundreds of people to do construction, grip, electric. We were all over Mexico. I think we were in 25, 30 locations. So I mean, we had to let everybody know that we were serious about it, and we pulled the plug and moved the production. So I think by doing that, we certainly convinced everybody that we were serious, that we needed some kind of concessions. We got the concessions we needed in order to move forward. But they were all good faith negotiations. Nobody was angry at one another. It was a matter of both sides having to say, \"Hey, we're serious about this and we need help to get it done.\"\nAlyssa Wittenberg, production coordinator: The deal at the time in Mexico was that for every foreigner that we brought into Mexico for the shoot, we had to hire a local. So I had to have equal numbers of local Mexican coordinators for our team, and they were in charge of our local accommodations and translating the scripts into Spanish for the other people. And it was never love at first sight between us and the locals because they basically got paid better than us, barely worked, hated us. [...]\nI just remember that Christmas before we started shooting in Mexico City, I got a call from one of the other coordinators, Nelson, who tested me to see if I spoke Spanish properly and if I qualified to come and be there on location. [...]\nThe whole flight there, I kept thinking, What have I done? What have I done? Yeah, I speak Spanish, but I don't speak production Spanish, which you realize is a whole 'nother language. Even in English, it's a whole 'nother language. To tell a local [production assistant] to go get something done in production lingo is a different language that I was like, \"Oh, God. I've made a horrible mistake because I don't know how to say, 'Quick, get the Xerox 500 times on this color paper, three hole punch it, collate it, staple it, and distribute it to this list.'\" That whole thing was a massive learning curve of even how you say \"staple.\"\nAnd all of our rented desktop Apple computers were top of the line, but internet wasn't really a thing yet, and we didn't have cell phones, and the only way we communicated with the outside world for seven months was that we had two satellite phones that literally looked like that James Bond suitcase with a satellite that they stuck on top of the production trailer on set. And then one was with the exec producer. But we didn't have one in the office. We had to rely on whatever the local thing was.\nPhil Meheux, director of photography: [Martin and I] found that we got on very well, and I ended up doing nine films with him. It got to a point where I sort of knew what he wanted, and we agreed on so many things.\nI'd put the viewfinder up and say, \"I was thinking about something like that,\" and he'd go, \"That's it. Perfect. Yeah. Yeah.\" ... It got to a point where he didn't really tell me anything. He'd show me the script, and he wouldn't say anything about the look of the film or how he saw the film. He left it to me, which I also obviously enjoyed immensely, which gave me a great deal of responsibility at the same time.\nBut when \"The Mask of Zorro\" came around, which was 1997, we'd already done James Bond \"GoldenEye\" with Pierce Brosnan, and I did another picture after that called \"The Saint\" with Val Kilmer, which wasn't very successful for various reasons. Then, up came \"The Mask of Zorro.\" So all Martin did was ring up and say, \"We're doing another one. We're going to start in so-and-so, so-and-so. I'll send you the script.\" I read it and I thought, What do I do with this to give it some sort of interest? I'm making it sound all grand now, because it was just, it was your job. You know? You just had to think about how you did things, how you planned it.\nI had this idea that, because it was costume and it was a sort of a comedy action film, but at the same time, the action was very real, but there was comedy and glamour in it with Catherine Zeta-Jones and all of that, I decided it should look like an old Technicolor film. So that was my thesis, is to make this look like old Technicolor with plenty of color, as often you could make it, but at the same time, keeping a certain reality to it, which is a difficult line to keep with. But that's really how I came upon that approach, as it were.\nAlyssa Wittenberg, production coordinator: We had a lot of stuff for two weeks sitting on the border of Mexico in L.A. All of our big trucks with our armory, and with our horses, and with our set [decorations], and literally anything we needed that was being brought in from the U.S. had been sitting at the border for two weeks solid. But Sony TriStar had decided at the outset that we weren't going to bribe anybody. This was going to be a company policy.\nLiterally the day before we start to do pre-pro shooting and camera tests, we had one of our team go out there with stacks of American cash and just make it rain on the border, and suddenly all the trucks were coming in. So it started rough where it was a scramble to get into pre-production, because people were only just arriving who should have been there two weeks prior to start unloading, and start taking stock, and doing some of that rehearsal pre-camera testing. It was intense from day one, and bribing started from day one because it's the only way to do business down there ...\nWe were behind schedule by two weeks from the very beginning, and I think we were told we were going to be on location five to six months, and that we had to pack one bag but have enough clothing from, well, all these different locations, different temperatures, but from January to end of summer. So that was a big thing for everybody — how to pack a whole year's worth of stuff in one bag.\nChapter 7: The cast\nAntonio Banderas had starred in dozens of films in Spain and appeared in a handful of English-language productions, but \"The Mask of Zorro\" launched him to superstardom in the United States. Anthony Hopkins had just starred in \"The Edge\" and was filming Steven Spielberg's \"Amistad\" concurrently with this production. Catherine Zeta-Jones had played a supporting role in \"The Phantom,\" but legend has it Steven Spielberg saw her in a 1996 CBS miniseries called \"Titanic\" and brought her in to audition for this film, which changed her career forever.\nGeorge Parra, first assistant director: I mean, Antonio's a pleasure. He became one of my great friends, and I AD'd for him shortly thereafter on a film that he directed, and to this day is still a good friend of mine. He's a cool cucumber. He's a talented actor — always was, always will be. He's gifted. He's very coordinated. He can ride a horse. The sword fighting came easy to him. He did a lot of the stunts, but not all of them, of course. But he's talented, charming, super handsome, just a pleasure to work with.\nJohn Gertz, co-producer: I mean, his Zorro was probably the best that's ever been performed.\nGlenn Randall Jr., stunt coordinator/2nd unit director: Banderas was great to work with. He came and worked with us on the second unit on the chase scene, and he was really enthusiastic and game for almost anything I asked him to do and kept making the remark that he said, \"I want this to be good, Glenn. I want my kids to be proud of it. I can't wait for my kids to see this.\"\nJohn Gertz, co-producer: Banderas was really an artist. I mean, he cared so deeply about every element of the production. Fortunately, Martin was not at all thick-skinned, but Banderas was almost directing the director. And in a positive way. I mean, they seemed to have had a positive rapport, but Banderas would constantly second-guess every element of the production and scrutinize it, and in between shots, come and look at his takes to see how he could improve himself. He had really a master's dedication to his art.\nThom Noble, editor: The villains were so good, as well. When you have a really good villain, you're home free.\nAlyssa Wittenberg, production coordinator: The guy who plays Montero, [Stuart Wilson], he was very particular about his character's little curly hair bits and was constantly making sure they were just so with a certain amount of wax and that they looked just so. He was kind of driving hair and makeup crazy. And one of the bats that they released [in the dungeon scene] had got in his hair and was messing it up just before the shot, and he was screaming for help. And hair and makeup were both like, \"He's all yours. We don't do bats.\"\nPhil Meheux, director of photography: Montero, he ended up in another film we did called \"No Escape,\" which was shot in Australia, because we liked him so much. He was very professional actor. He always knew his lines, knew where to stand. He could make it exciting, the performance. When you're doing a film like that, it's got to have excitement, and the whole point of staging anything, you've got to — it's show business. I always use this word. It's show business. There's two people dancing [in a scene]. All right, but what can we do with the camera or the lights that makes it more show business-y, that makes people can't turn their eyes off the screen?\nJohn Gertz, co-producer: Zeta-Jones, of course, was a revelation. Spielberg had discovered her, just watching TV one night. He saw her on TV and said, \"I've got to have her for that role.\" And that was just magnificent casting, of course ... I often sat next to her on the set, talking about the weather or whatever, but not realizing at the time when a mega-star she was about to turn into. But I found her to be very thoughtful and with apparent depth beyond what you would just see as a pretty face.\nPhil Meheux, director of photography: I used to say to Catherine a lot, I'd say, \"When you look to your left, don't just use your head, because it makes these big stretch marks on your neck.\" So I'd say, \"Turn your body slightly as you look to your left,\" and she'd say, \"Oh. Got it.\" She was always good like that. I remember on one occasion, she said to me — we shot, we rolled, and we cut, and Catherine said, \"Was I on my mark?\" I said, \"Yes, you were.\" She said, \"Oh, because the light didn't feel quite right.\" I went, \"Oh. Interesting.\" So I started to look behind me, and there was one lamp, and the bulb had gone. Nobody had noticed at that particular moment in time, because we're all caught up in the action and everything. But she knew what she was doing.\nJohn Eskow, writer: When I came on board, they were basically decided on Cameron Diaz, oddly enough, but she would've been, at that point, I think, good for it. She's got a lot of Hispanic blood in her, and she was of course, at that point, really sexy. And the role called for both sexuality, kind of innocent sexuality, and real tough, sassy, strong woman. Which I think is another thing, by the way, that makes the movie work so well, is that at a time when there weren't very many strong women in movies, that was one.\nRay Zimmerman, physical production executive: We'd done this movie called \"The Fan\" with Tony Scott directing and it was down in Anaheim. I was still young and full of piss and vinegar, and I'd get up at two in the morning, be at the set on three because they were shooting all night. And Tony said, \"What the f*** are you doing here, man?\" I said, \"Well, all those extras, haven't you shot them out by now? Can't you get rid of them?\" He goes, \"Oh yeah, okay. Skotch, get rid of them.\" Jim Skotchdopole was the first AD on it.\nCut to a couple of weeks later, I'm back in my office and I get this phone call and it's the head of legal. He's going, \"Ray, Ray, we got to get down on the set right away.\" I went, \"What's going on?\" He goes, \"I've got SAG calling.\" Apparently, they had the Jumbotron out and they cut for lunch and it was Skotchdopole's birthday and the second AD hired a stripper to come and dress as a cop. And we had brought in all these church groups with little ladies to staff the extras. Those were back in the days where you didn't do all the CG extras.\n\"Oh my God.\" So me and the head of legal go down there, and the first thing the head of legal goes is, \"Who's got the tape of that?\" Bury the evidence. That's the first thing that a good lawyer's going to do ... We made a policy that I basically had to go out to every single movie set and give the sexual harassment spiel. So that was my first journey down to Mexico. [...]\nSo anyway, we go down there and I give that kind of spiel and all that kind of stuff. And it happens on that day, they're doing a screen test. And Martin had three women in mind for the role that Catherine Zeta-Jones got. And he had just done a Bond movie and he wanted his Bond girl. [There was Catherine], and then there was a third one. So we're set up in this little scene, like a little stage, and there's a horse eating some straw, and the scene is the girl is brushing the horse and then turns around and delivers a line. That's it.\nSo the first woman does it, and okay, great, it's great, looks great. Next woman comes in, she does the same thing. Me and Martin are there with the DP just looking through the lens. Great. Catherine Zeta-Jones comes out and she starts brushing the horse.\nAnd I don't know if you know much about horses, but there's the term when a male horse \"drops.\" When a horse drops, a male horse's penis comes out of the sheath and it just keeps coming out, and it's fairly large. And [that happened] the minute she started brushing the horse, and Martin and I are just going, \"That's the one! The horse knows!\" [laughs] Now, sorry if that was a little off-color. I didn't mean to offend anybody, but it was kind of a classic story, so I couldn't help myself.\nJohn Gertz, co-producer: I would like to talk about the nobility of character and the Anthony Hopkins character, his pathos and emotionality, and the way that Banderas and his character raised to that same level of nobility. That, to me, really stands out as a magnificent quality. Hopkins was magnificent to see or to work with — a very, very lovely human being. Very, very nice man.\nGeorge Parra, first assistant director: [Anthony Hopkins is] one of the great actors of all time. He, of course, has a British accent. It's there, will never go away, et cetera, et cetera. And we did a lot of camera testing for many different things, costumes and looks and all that kind of stuff. And I don't remember who — and even if I did, I wouldn't say who did — but somebody wanted to test Anthony without his British accent. So we put him on stage, and we did a camera test. He was in wardrobe and makeup. And he came in and did a scene without his accent. During the test, it was going on, and I remember standing next to Martin and Doug Claybourne, and they kept looking at each other saying like, \"What's going on?\" because you, as an audience, get so accustomed to Anthony Hopkins.\nNo matter if he's supposed to play a Spanish lord or whatever it was — Mexican, Spanish — and then, he comes out with a British accent, that's what you want. So when we saw [the footage without his natural accent] in dailies, we all started sort of laughing, because it was so absurd. And Anthony turns around and he goes, \"So I guess I get to play it in my mother tongue,\" or something like that, and everyone laughed more. I mean, if you notice in the film, he's got a British accent, but nobody cares. It's much better. It's like, \"Why would a guy like that have a British accent?\" But after you get over it, because, \"Oh, it's Anthony Hopkins.\" You don't care.\nAlyssa Wittenberg, production coordinator: Because we had people from all over, we had Mexicans, we had Cubans, we had Welsh, we had British — this is not a Mexican team — they had to figure out what they were all going to speak like. What is this \"speaking in English, but with a Latin accent\" thing going to be like? And they kind of uniformly had to decide where they were going to land in terms of what they all sounded like. And I don't know that they totally succeeded. At a certain point, they decided they were going to call it an Atlantic accent for all of them, which is some random, made-up thing. But some of them were more successful than others at covering their Welsh or British accents. It's not a full commitment to Spanish, it's like bad Brits trying to speak Spanish. So I thought that was really interesting at the very start, was just all the conversations around what their accents would be. And a lot of the dailies that got sent back to Spielberg and the team had a lot of comments about, \"What is that?\" So there was a lot of working out that whole mess.\nCasey O'Neill, stunt double: I remember talking to Anthony Hopkins before ... it was a scene where he jumps off the balcony and lands onto the horse. So I was there for that. And I remember he would talk just like we are now, and then, \"Hey, you ready, Mr. Hopkins?\" \"Yeah. Okay.\" He turned to the camera and they'd say, \"Rolling, action,\" and he was completely — I don't know how he went from this kind of a conversation to so serious and so good. It was unbelievable to see that right in front of your eyes. You're like, \"Okay. That's why he's who he is, because he's that good.\"\nPhil Meheux, director of photography: Hopkins, I felt he thought it was a little beneath him a little at the beginning. In fact, him and Martin got into an argument. We were doing one scene. They've got an invite to this party, and they arrive. Hopkins is talking to him, and say, \"Charm, you have to have charm,\" like that. He's saying all of that, and Hopkins would only do two takes and walked away. Martin said, \"Well, hey. Wait a minute. I think I'm not quite happy with Banderas. I think we need to just have another go.\" \"Well, I don't like to do more than two takes. I mean, this material is not worth it,\" like that.\nSo that was a sort of tense moment, but we got through the evening. We got through the job, and then we showed Tony the rushes that we'd had up to that point, which included some of the horse work and some of the sword fighting and all the rest of it. Bless his heart, he suddenly realized that this film wasn't quite what he thought, and it was actually better than he'd actually imagined. From then on, he was very much on our side.\nAlyssa Wittenberg, production coordinator: I had to organize tanning salons in Mexico City for everybody, because they were all so pasty. I think Tony Hopkins went three times. The first two times I was like, \"Still don't look dark. Still don't look Mexican.\" So we had to keep sending him back to the tanning salon ... The actors hate when the coordinators tell them they have to go do stuff like that, so they reluctantly did. But it's always our job when the executives see the dailies and they go, \"Somebody has a zit. You have to get them to a dermatologist, stat.\" And then you have to have that conversation with the talent like, \"I really don't want to have to tell you this, but I've got an appointment with a dermatologist and you have to go now.\"\nGeorge Parra, first assistant director: The other [story] behind the scenes, it was really interesting, is we were a Directors Guild of America shoot. Martin's a DGA member, I am, Doug is, everybody, four or five of us. So we brought in our crew. My ADs were American. And the DGA had given us a guy named Jorge who was bilingual. He's no longer an AD. He went on to become an attorney, and he left the business. But Jorge and I kept in touch for a while. Educated kid, grew up, I think, in New York or something. Anyhow, he was the guy who, on a daily basis as a trainee, knocked on the trailers and got the actors into makeup and hair and did the production reports, and that was his job. But now, the Directors Guild rule is that they have so many days per film. They place you in a job as a trainee. It's a very difficult program to get into. I don't know if you're aware of it. I don't know what the numbers are now, but it used to be something like 2,000 people take the test, and 100 get into the final interview phase, and something like 20 make it yearly. It's a very small percentage, like getting into NYU or something.\nSo his days were coming up, and he had to be replaced and put onto another film, and everybody knew it, and it was like he's with family. So I was on the set, and somebody said to me, \"Anthony would like to see you in his trailer.\" And I said, \"Okay.\" And when Anthony Hopkins wants to see you, you go see him. So I replaced myself with my second AD, and I went to his trailer when I could. And he goes, \"Come in, dear fellow, sit down. Sit down.\" So basically, the gist of that meeting was that he said, \"Look, I know that Jorge has to leave, and I know how valuable he is to not only the production, but to me.\" They got to be very good friends. I mean, this is like a 24-year-old kid.\nHe said, \"Tell the producers that I would like Jorge to stay, and I will pay the difference in the salary out of my pocket,\" which was tens of thousands of dollars. I can't be exact on the number. And I thought that was one of the most unselfish, wonderful ... so I went to the set, and I said, \"So here's the deal.\" And immediately, Doug Claybourne, the producer, said, \"Well, if he's offering, we're not going to say no.\" I mean, we can't say no to that request, because it doesn't cost production anything. So we called the studio, and that was it, done. And Anthony Hopkins paid for Jorge out of his own pocket. So he stayed for another two or three months on Anthony's dime.\nChapter 8: Production\nProduction began in Mexico on January 27, 1997.\nAlyssa Wittenberg, production coordinator: We took over the production stages and offices from the \"Titanic\" movie that had just pulled out. So people kept asking us if we knew where Leonardo DiCaprio was, and I'm like, \"Not the same movie. Sorry.\" So we kind of slid into their location when they abandoned it to go to the next location. But it was the only big studio in Mexico City, and where all their telenovelas and all their movies happen.\nAnd being a big L.A. team, we basically were blowing the power circuit for the whole neighborhood over and over again. And we had landlines, and the production office in L.A. would be asking us to get stuff done, or why aren't we answering the phone? And we'd be in this super hot, un-air-conditioned office with no power and we wouldn't hear the phone. They could hear it ring, and they were so mad we weren't picking it up, but it wasn't ringing on our side. We were just sitting there dying of heat exhaustion, trying to get stuff done. But there were a lot of times I went to set to get paperwork signed because we had daily paperwork that had to go back to the studio, and they were always mad at me if it didn't happen that same night. But we literally had one plug in the wall, the power kept going out, old school computers.\nIt was like they were so far back in terms of tech at that time that it was like, \"Guys, if two of us get on the phone at the same time, the whole power for the neighborhood goes out. You just got to give me a minute. If it's ringing and we're not answering, it's not that we're not there, we just don't hear it ring.\"\nGeorge Parra, first assistant director: The actual shooting was long. I think it was 110 days or something like that. Very, very long production schedule, a lot of traveling all through Mexico. We didn't just do Mexico City. We went all over the countryside to different places. I mean, shooting the party sequence was spectacular, with the costumes and the extras and the lighting and all that. All the big action sequences, the finale at the mine with the explosions, and the fires, and the sword fighting, and the villain dies, et cetera, was very time-consuming and grueling. Physically exhausting. Somehow, we made through it without many injuries at all — nothing dramatic, I remember.\nAlyssa Wittenberg, production coordinator: We had seven company moves, which my team was in charge of making happen, and a cast of thousands, basically, that we were moving each time. I just remember at the very start of production, the production team hosted a big dinner at The Palm in Mexico City. It was this massive room, and all of us were sitting around this big square table. And I have photos of that night, and everybody looks so optimistic, and so excited to be there, and so rested and young. And then I have, in my photo album, as you go through seven months of hard time in Mexico, we start looking super skinny, black eyes from lack of sleep, exhausted, like we've seen some things.\nDoug Claybourne, producer: Do I remember anything about the locations? I mean, just that they were extraordinarily beautiful, far apart, and a challenge to set up and get people from place to place. I just remember that we started out on stage and we just kind of went from place to place. I can't remember the names of all the places. Tlaxcala, which I think is where the big first set was, where all the people into the town and where Zorro comes in, both the old and new Zorro together, which is a great sequence. I just remember it was a very exotic location to be on, and our production designer was wonderful. She did a great job, Cecilia, and of course Martin had just done one of the big James Bond movies and he was amazingly well-prepared.\nCasey O'Neill, stunt double: The haciendas, a lot of them were already there, but then they added on to some stuff to make it work for the story. But just the scenery and being in Mexico and shooting that movie there was so necessary, I think, for the story and just for the feel of all of it to do that. Because now they just make movies ... if it's New York, it's in Toronto. It is not the same thing. So it was really nice and a unique opportunity to actually be in Mexico at those remote locations and shooting in those haciendas and at those amazing sets that they built.\nGeorge Parra, first assistant director: [Martin Campbell's] cinematographer at the time was Philip Meheux. And they're both like Abbott and Costello sort of humor, like they're British. I think Martin's from New Zealand, but he lived in London for a long time, and Philip is British. So they have that sort of dry sense of humor all day long [...] I mean, [Martin] and I and Phil, we worked our butts off. It was a labor of love. It was hardcore. Good thing I was 25 years younger. It was intense. We were working six-day weeks and a lot of driving, a lot of driving. Martin had a Suburban and a driver. And it was usually Phil and I in the back with another producer, David Foster, was in there. And there were four of us, and we drove and drove. We drove forever, tens of thousands of miles.\nAlyssa Wittenberg, production coordinator: The places we were staying at were very rustic. When SAG-AFTRA requires anybody above the line to be in a first class accommodation, you're like, \"This is all they have.\" We booked completely the two hotels in Tlaxcala, one was considered above the line in town, and as far as I know, it was the only hotel in town. And then we were in a country hotel up in the mountains, which was really rough. It was very low tech, very rough ... I have lifelong friends from this movie that I still see all the time and still talk to all the time because we had seven months isolated from the rest of the world. I call it one of my seven-month blackout periods, where any number of things could have happened in the outside world, but we wouldn't have known because we had so little contact with anybody outside the movie for seven months.\nGeorge Parra, first assistant director: [Early on in production], everyone started catching a flu. And when the flu goes through a crew, it's hard to avoid it, because you're in direct contact. This is way before masks. Nobody wore masks. And everyone's exhausted and working long hours, and so on and so forth, and coughing. People are coughing, and just like this cold, flu-ish thing going through. And I didn't catch it, but Martin did. A lot of people did.\nAlyssa Wittenberg, production coordinator: He wasn't a big guy to begin with, but we started calling him Skeletor because he'd lost so much weight. And it was unclear if he was going to be well enough to continue as the director, really from the very get-go.\nDoug Claybourne, producer: You get off the grid and you start eating vegetables and eating salads and that kind of stuff, and drinking water or using ice cubes that were put together with local drinking water, you can pick up that bacteria, and very quickly, you've got the runs. And it's not easy to get rid of. So I think that's what happened with a lot of people, was they just ended up not drinking bottled water and catching this local bacteria.\nAlyssa Wittenberg, production coordinator: We were plagued with stomach stuff the entire seven months because there's no food safety. If they didn't just overcook it to death or you saw it get killed and cooked for you, there's no refrigeration, so we would have entire teams go down with stomach bugs. I was passing out Mylanta, Pepto, and anything else I could throw at them. \"We just need somebody in your department to show up on set today. The show must go on. Can one of you remove yourself from the floor of the bathroom and join us on set?\"\nGeorge Parra, first assistant director: And we had met doctors, giving us these antibiotics and cough syrup and what have you.\nMark Ivie, assistant sword master: The doctor who was down on the other end came down over to me, and gave me this — I don't know what it was. It was this chalky thing. And suddenly I was okay again. It was that fast. I was throwing up in the trash can, and he saw it, and he came up, and he gave me this little powdery thing. And I was back on my feet ready to go. And they knew what to use, but I certainly didn't.\nGeorge Parra, first assistant director: So everybody got really sick. And there was a point we were shooting at night where Martin was really sick. He was coughing up a lung. Horrible. He could barely talk, and he'd look run down. His eyes were all watery, but he kept going. He's like the Duracell Bunny. This was a big film. He didn't want to let anybody down. And I'm in close contact with him. And I remember his wife, when she was visiting during prep, saying to me, right as she left, she said, \"George?\" I said, \"Yes?\" I can't remember her name. \"Do me a favor.\" And I said, \"Yes?\" And she said, \"Look out for Martin, because he'll keep going till he drops.\" I was like, That's weird.\nSo at that moment, that night on the set, I said to myself, \"Oh, that's what she meant.\" It occurred to me over the next half-day, and he kept getting worse and worse and worse. And I said to Doug Claybourne, I said, \"Doug, we need to meet in Martin's trailer at lunch.\" He goes, \"What about?\" I go, \"I'll tell you when we get there, it's just something important.\" So we got there, Martin was in there coughing and coughing and coughing. And they usually brought him his lunch. And he was coughing and coughing ... Doug came in and we sat down. And I brought Phil Méheux, his old friend of many films, and we all sat there, and I said, \"Guys, I'm here to tell you that I'm the safety monitor on the film as the first AD.\" I said, \"We can't continue with Martin.\" And Martin got upset. He was like, \"No, I'm fine.\" And I go, \"Marty, you're going to get worse and worse.\" So Doug looked at me, I looked at him, and he didn't hesitate. He just went, \"Done.\" He goes, \"You're right. We can't continue.\" And we were off for two to three [days], maybe three [days]. We went back to Mexico City, and he ended up in the hospital. He had pneumonia, and that's dangerous. So yeah, it was a big thing.\nDoug put his arm around him and said, \"Marty, don't worry. The insurance will cover this. We got to get you better, and everybody else better.\" There were people that were falling left and right. All kinds of technicians were sick, and the horse wrangler and who knows, everybody seemed to be sick. So we took off at least three [days], which is a big blow to a film. It's just like coming to a screeching halt. But then, we picked up again. He was fine and back to his sassy, funny British humor. And we were all good. We kept going.\nDoug Claybourne, producer: We had to hold off until he was well enough to continue. I mean, that, and the cast, you have to worry about. Those are the folks you really have to be careful about. Or the director of photography. You can go along without a producer. You don't need a producer on the set, but you can't go along very far without an actor or a director.\nPhil Meheux, director of photography: The opening days of work was the bucking horse in the stable ... Well, it's night, it's a black horse, and it's Banderas dressed in black. So I'm thinking, \"Better concentrate here.\" Four cameras, all anamorphic, widescreen ... The deal was that Churubusco would process the film and make the rush print. So I did a makeup test on everybody and put that through. That seemed okay to me, and it seemed fine. So we shoot the scene, and then the next day, we shoot the next part of the scene. Because you can't do it all in one, and then everyone gathers in the preview theater to see what we've done. I've never seen such bad-looking film in my life. I mean, it was terrible. You couldn't see a thing. It was all grain. And everybody's in there. The place is full. Every department's in there. I've got the lab standing behind me, and I said, \"What have you done?\" He said, \"We've done nothing. We followed your instructions.\" ... So everybody files out in silence, [and I'm looking at the back of Martin's head], and he says, \"Tell me it's not you.\" I said, \"Well, I mean, I don't think it is me, because it should not look like this. This has all gone wrong.\" So now, I'm conferring with the lab, and we're talking about it, whether we should reprint it and all the rest.\nThen, I discovered that the workers in the laboratory, because they knew we were coming and we were a big Hollywood production as far as they were concerned, they wanted more money. The studio, quite rightly, wasn't going to give it to them, because they'd already done the deal for the job. So all the laboratory staff said, \"Well, that's it. We're out.\" So they all went on strike. So now, it was only the office staff who could work the machinery. So now, people who hadn't done it for years, they took over, and they made a hash of the whole thing. Fortunately, we hadn't sent the second days rushes away. The producer on the film, Doug Claybourne, suggested we send it to a lab in Hollywood called CFI, which used to be known as \"Can't Find It.\" They do a lot of porn and everything. I went, \"CFI, are you sure about that?\" and he said, \"Yeah, I think they'll do a good job.\" I went, \"Oh my God.\" I'm standing here having seen this rubbish, thinking, Was it me? Was it my meter? Did I read it all wrong? What did I do? The executive producer is Steven Spielberg. I'm thinking, I'm out, aren't I? I'm going to get the sack ...\nWe shot the third day, and I didn't change anything. I just checked to make sure the meter was working. Because I thought I could make it even worse if I started changing everything, and it wouldn't all match. The upshot was that the second day's rushes came in by plane that afternoon, and it was fantastic. What a sigh of relief ... I also found that CFI was actually processing \"Titanic\" at the same time, so I thought, Well, if it's good enough for James Cameron's film, it must be fine for my film.\nAlyssa Wittenberg, production coordinator: Back then, it was the early days of AOL, and no cell phones and no cell phone towers. And if you didn't have a landline, forget about it. You have no way of reaching anybody unless you beg one of the execs to get on the satellite phone, which was really expensive. And was really only for them to talk to Spielberg every day about notes on the dailies. But we did old school daily screening on location, which even then it was really hard to find somebody who knew how to use the old projectors.\nAnd they edit it on Steenbeck, and one of the things you can't import to Mexico is wood. And so [editor Thom] Noble had all these, literally pencils for marking the film for the edit, of where to cut and splice and put it back together. And they all got confiscated at the border, and he was like, \"What do you mean I can't have pencils?\" I'm like, \"Dude, we're going to have to have somebody bring them in illegally in a suitcase and hope they don't get busted, because I can't get them for you here and they won't let me bring them in.\" It's just one of many, many weird things about what you can import to Mexico.\nAnd then it was super corrupt. I don't know if I need to tell you that. But they would have a green or red light at the border. It was supposed to be random whether they checked your bag or not. If it was red, you had to stop and they check your bag, and if it was green, you could go through.\nBut we sent dailies, everything shot, we had two PAs out of the L.A. office at TriStar who took turns every other day flying to Mexico, getting the film, taking it to CFI in Hollywood, and then picking up whatever was there and then coming back the next day. And neither of them spoke Spanish, which was, in hindsight, a big mistake. The local security guys at the border started to realize very quickly that they were part of our film because we had so much movement back and forth, and would hold them up at gunpoint and threaten to open the cans of film if we didn't hand over a certain amount of cash.\nSo the first couple of times these guys got caught by the border at the airport in Mexico, and they're calling me in the office going, \"Okay, these guys with berets and machine guns are threatening to shoot me or open the film and expose it before it gets to the lab. What do you want me to do?\" \"Just throw money at them, whatever per diem you have, give it to them and I'll reimburse you when you get back. Just do whatever they tell you. Just go.\" So that was every single time for seven months that they came across the border. We learned to have them carry cash because there was just no point in going through the trauma every time of them being held at gunpoint. We were just like, \"Here's your petty cash across the border.\" Every time. A lot of stuff went missing when it hit customs in Mexico. If they liked it, they kept it. That was clothing, gear, personal equipment. It was bananas what they would take ...\nIt's totally a corrupt system there. We used to have our American Teamsters pulled over on the highway by local cops who would say, \"You owe me $500 US because you did this, this, and this.\" And the Teamsters, being very straight-up union Teamsters, would call me and go, \"Alyssa, this guy is saying I was speeding. I wasn't. That I was on drugs. I'm not.\" Whatever the charges were. And I was like, \"Dude, it's so hard to get people out of jail here, I just need you to give him whatever he wants. Just give him your money.\" I spent a lot of time telling people, \"We're not in America. This is going to keep happening. I can't afford to get you out of prison. We're never going to get you out. Just you and the truck and the gear just need to get here and I will reimburse you whatever you hand him. But just hand him whatever cash you have.\" And he was like, \"Jesus, that worked.\"\nBut that kept happening. There were a million versions of that, but what we quickly realized is that the cops and some of our local guys that we had to hire were in on the, \"Let's just get all the money we can out of TriStar.\" But it was one of those things that once it started, there was no going back. It was the only way to get stuff done, was just decide you're going to write it off as unexpected onset expense of some sort.\nChapter 9: A much-needed party\nAfter a rough start to the production with all of the sickness, the fourth week was much smoother and ended in a triumphant pool party, where the first snippets of footage from the film were shown to the crew.\nAlyssa Wittenberg, production coordinator: We were in Tlaxcala, [at] the above the line hotel, and it was a pretty decent sort of Spanish parador hotel. And it was the trailer, the first cut of the trailer, and we'd only really just started shooting. I think we'd been there three weeks, maybe four. I know we hadn't been in Tlaxcala long, and they had a courtyard with, I think it had a pool, and they put a big screen up in the back and they screened it for everybody.\nTony Angelotti, stunts: Anthony Hopkins got up, it was either on the table or on the stage, and was dancing. And then I was up there dancing with him.\nAlyssa Wittenberg, production coordinator: The thing about Tony [Hopkins] was that he was clean and sober at that point, 10 years, but he would come out with us all the time to party and dance. And the big hit at the time was \"Macarena,\" and there was a lot of tequila \"Macarena\" dancing on tables. So there were many parties where he was dancing. I had a wet, sweaty dance with him and I was like, \"Ew, it's so gross.\" And then I was like, \"But it's Tony Hopkins who's sweating on me. It's fine.\" But lots of dancing the \"Macarena\" on tabletops all over Mexico. And he was great. He came out with us all the time.\nCasey O'Neill, stunt double: They were all there and having a great time, and he was so — because a lot of times, the stars don't show up to any of that kind of stuff, or if there's a crew party or any of that. But yeah, he was definitely there and doing exactly that, and Catherine and Antonio. It was just a lovely party, that kind of kickoff thing that they did for everybody down there. And it was pretty tight because we're in Mexico and we're all on location together, so there's not a lot of places to go when you're in certain towns. We traveled all over, so you kind of ended up being together a lot more maybe than you normally would if you're working in L.A. or somewhere else.\nChapter 10: Swordplay\n\"The Mask of Zorro\" contains some of the most impressive sword fighting sequences of the modern era, thanks to one of the most legendary sword masters in the history of cinema.\nMark Ivie, assistant sword master: Bob Anderson was an amazing fight coordinator, and I learned a lot from him ... Bob was a stunt coordinator, a person who ended up working with Errol Flynn in 1952. He was going to the Olympics, and they said, \"Hey, they're filming over there. Maybe you should go take a look at it.\" And so he went over, and apparently what happened was Bob ended up doubling Errol, doubling the sea captain, and ended up [playing] both [in a fight scene]. So he killed himself [laughs], and then went over the side of the boat.\nBut the other thing that happened was during the fight, Errol is being backed up the gangplank, and Bob is fighting him. And these people, these admirers, came around the corner in a boat, and they said, \"Hey, Errol!\" right in the middle of the fight. And he turned around and looked, right as Bob was thrusting the sword and into Errol Flynn's leg. It was real swords. They didn't have fake swords at that time. So Errol, he went over, sat down, and had a whiskey or something like that, and they ended up becoming good friends after all.\nCasey O'Neill, stunt double: Bob Anderson was there. He is a very famous sword master, and I worked with him again on \"Pirates of the Caribbean,\" and I worked with him on \"Lord of the Rings\" after that. Bob is a complete legend, right? So he's done \"Princess Bride,\" \"Star Wars,\" and he was just an amazing talent. And even then, he was a bit older, but such a lovely person. He was so great at talking to the actors, and he was just a legendary movie-maker, and his style and his finesse and the way he would explain things to the actors and how he wanted to bring the action across with the swords — it was always so elegantly done. He was so good at what he did and just a lovely, lovely person. And we became great friends with him and his wife, and Mark was there as his assistant. Bob brought him in to kind of help with all the organization of stuff and the other side of things that he just wasn't really doing at that time. But yeah, Mark also did a great job too, and obviously he studied underneath Bob and they were a great team.\nMark Ivie, assistant sword master: Antonio is such a skilled performer that he started doing his own routines, or started moving the sword around how he would do it, and it just worked really well. It was quite the interesting juxtaposition of getting things back and forth, and working together. He'd take the sword home and play with it, and get these really amazing moves out of it. So he was already practicing before we even started. He was just ready. He was just able to do so much. And then we would work around certain things. If there was something that might get in the way, we backed it up. We moved it forward. It was quite a wonderful learning experience for me as well as enjoying the presence of people like that.\nDave McMoyler, supervising sound editor: I worked together with my lead sound designer, Hector Gika ... he just dug in and he's very thorough, he's very creative, and together, we'd try a lot of different experiments. If you listen to the production track of the swords as recorded, it's like little pieces of tinfoil. And even, I went back and I looked at some other sword fight movies, \"The Three Musketeers\" from the '70s, I think it was — I remember seeing that as a kid, and I loved that movie. I thought it was so great. It was just like, \"Let me see if I can get some ideas from listening to 'Three Musketeers.'\" I don't want to offend anybody, but it was just like, \"Okay, yeah, we don't want it to sound like that.\" We wanted to bring a lot of weight, and we wanted to bring just — the sounds that we have for those swords are from much, much thicker metal than what we're seeing in the movie.\nMark Ivie, assistant sword master: Stuart Wilson [who plays the villain, Montero], he was having a tough time with the swords, and so Bob had to work a lot one-on-one with him. And he basically threw down the sword a couple of times because he just got frustrated. But Bob is very patient, and so he would just work at it, and get him back up there and doing it.\nDave McMoyler, supervising sound editor: In some of those scenes, we do have some animal sounds, particularly for Montero, who's the main bad guy. We wanted him to be brutal. We wanted his swords to sound more brutal. So we kind of played with a little bit deeper pitch for the actual metal strikes, and then we also, we tucked in some animal sounds too, on some of the whooshes. In that case, it's more to my liking because you don't really hear it. You feel it more than you hear it. A leopard has a really nice — it has more of a guttural sound. And then we ended up using a cougar or a panther, which is more of a scrapy, higher-pitched sound.\nRay Zimmerman, physical production executive: [Catherine] was so cool. I said, \"We've hired the best swordsmen in the world to train you. We've got the best horsemen in the world to train you. I mean, do you feel like you're on cloud nine or something?\"\nShe goes, \"Oh Ray, I can't believe it. It's just like a dream come true. It's just magic because it's just like these people are — I'm getting paid to learn my craft better and better and better.\" And you can't have somebody better than Antonio and Hopkins surrounding you and supporting you.\nMark Ivie, assistant sword master: Catherine was just perfect. There was no question. Bob and I were looking at the pictures and everything, and he just said, \"Look, she's a dancer. She moves well. She's got the character down already. She's smooth. She's the perfect person for it.\" So the producer came by, and said, \"Well, I think so, too\" [...] She would just float with the sword. She was able to be so smooth, and just very concentrated, but also in a good way. She'd be smiling, she'd be moving, she just made it work so well, and it was part of who she is because she is such a good dancer, such a good mover, that it wouldn't have been the same with anybody else, I don't think. She's just that capable.\nDave McMoyler, supervising sound editor: I won't say that there was no sword hit that was ever repeated. I mean, we did. But what we wanted to do is really, really mix it up. If you listen to actual sword hits, it's the same pitch [with] every hit. Dink, dink, dink. That wasn't going to work for us. We tried to make it as musical as possible and to just mix it up, so almost that you wouldn't expect the next sword sound.\n[When Zorro takes someone else's sword and uses it], we tried to have it sound similar, but yes, kind of take it to the next level in terms of there's a little bit more skill, there's a little bit more power, there's a little bit more precision [to the sound it makes] once Antonio got ahold of it.\nMark Ivie, assistant sword master: You want to get [the swordplay] up to that speed, but you don't want it to be dangerous. That's a really key part, because you do the wrong thing, and it can be devastating. In fact, one of the stunt guys was practicing that fight, George Ruge, and I forgot the other guy's name, but they were doing the fight sequence on the steps, and they actually moved in too fast, too hard, and it ended up putting the sword right into the guy's cheek.\nTony Angelotti, stunts: I got stabbed in the face here [points to cheek]. We were rehearsing the sequence in Zorro's home, and it was Montero and Zorro fighting on the staircase. They had to have this big staircase fight sequence. And so we were rehearsing that at one of our locations, and George and I are fighting back and forth, back and forth, back and forth. And there was a move where George was up on the stairs down at me, and Bob wanted him to thrust at my face and [me] to parry. And something happened where I parried and the blade went in.\nWe were fighting at such fast speed that I thought they were going to have to slow the camera down. We were going so fast, when we actually shot the sequence. When we were rehearsing this, I got stabbed in the face — thank God it was just in this little meaty part right here. There's a major vein that runs through here as well, and a lot of nerves. I didn't sustain any nerve damage, but the doctor on set — okay, here's one of the sketchy stories. The doctor on set was like, \"I can just do a couple stitches and you'll be good.\" And Doug Claybourne came over and he says, \"I don't think so. He's going to a plastic surgeon in Mexico City.\" Because it was my face! Had it been like, \"Oh, it was my arm or somewhere where you could do a couple stitches onsite,\" it'd be one thing. But since it was my face, they shipped me into Mexico City. The production staff handled everything. I show up into the emergency room, they're waiting for me, the surgeons and all. And I go, they stitch me up. Barely can even see anything today.\nMark Ivie, assistant sword master: They just got carried away and did a zig instead of a zag, and that's when it got dangerous. But overall, that was pretty much the only experience that I had with any kind of cutting or a problem with it.\nChapter 11: The stable fight\nOne of the film's most memorable scenes features Banderas's Zorro and Zeta-Jones' Elena having a passionately charged sword fight in a stable, ending with Zorro making a series of strategic slices to her clothes that result in Elena's top falling off.\nThom Noble, editor: I always put my own temp music on it, before the composer ever sees it. Sometimes, they get very sensitive about, \"I don't want to see anybody else's. Just play it without music.\" But sometimes, they're smart enough, like Hans Zimmer, to basically know, \"If you've got something good, I'm going to copy that, because it works perfectly.\" [laughs] What happened was that in that duel between Catherine and Antonio, I put [Maurice Ravel's] \"Boléro\" over it, and I cut it to the music. And [\"The Mask of Zorro\" composer] James [Horner], basically, if you listen to that cue, it's almost the same ... I think that's a great compliment, when they actually think, I can't do any better than this, so we'll just do it.\nMark Ivie, assistant sword master: They did tell everybody to step outside so that it was just Antonio, and Catherine, and a few crew people. They didn't allow a lot of people in to see it during the process. With good reason. It came out really well. Martin is a great director, and he was very able to make it work as fluid, and it just gelled. It was just such beautiful timing, and [the way they were] looking at each other. Antonio had a quirk when he looks to the side, and has this smirk on his face. It's part of the fun part of the movie too, is just being able to have that back and forth juxtaposition thing, and what can come of it.\nDave McMoyler, supervising sound editor: That was one where we really wanted to dial back. We didn't want the swords to sound at all brutish. We want it to sound more artful and to be more seductive. So we tried to come up with stuff that wasn't as heavy, especially towards the end, where he basically cuts all her clothing to shreds. It was a combination in that scene of Hector's excellent work coming up with the personality that was specific to this scene. Then the other thing that was really very critical was the Foley movement, for the swords. All of the hits, all the actual impacts, sword strikes, that was all Hector in his mad scientist laboratory. But what we needed also is the connective tissue of the actual sounds of holding, handling the swords.\nDave McMoyler, supervising sound editor: There was one moment in that scene, which I'm glad you brought it up, because it's one of my other favorite sounds, was at the part where she holds the sword up right to his face and he puts his finger on the blade and slides it from the hilt up to the tip, and then, shing, does a little [movement where he flips the tip of the sword down]. And it took a while to come up with, because what I wanted is for that finger sliding on the blade, I really wanted to have to pitch. I wanted it to kind of reach a crescendo. And it was hard, because most metal makes one sound at one pitch. But again, with [Foley artists] Gary [Hecker] and Jeff [Wilhoit], we experimented with and finally they found the right piece of metal that they were able to bend so that we did get that pitch shift to the point where it comes up, and then he did the little [flip down]. That's another one of my favorite moments in the movie.\nTony Angelotti, stunts: I was very much a part of that sequence. Any time they shot over Antonio's shoulder, it was my shoulder, not his, to shoot onto Catherine. So she fought me quite a bit. The rigged dress, every time he just did a little swipe and the dress kept falling off into pieces.\nAnd there was the part of that where I think she disarms him, and then it's me that does a back handspring. And it's what's called the cowboy switch, where Antonio was crouched down and I did the back handspring and he popped right back up [instead].\nTerry Rossio, writer: It was conceptually a great idea. I imagined it would be a bit sexier and show more skin during the sword fight. And I always thought the final bit with pulling away the dress looked fake and awkward, and diminished the character of Elena. That was never the intent. She was supposed to stay strong in the face of her state of undress.\nChapter 12: Stunts\nFlips, drops, swinging from tree branches, elaborate swordplay, incredible horse riding — the stunt work on display in this movie is second to none.\nGlenn Randall Jr., stunt coordinator/2nd unit director: The director gave me a lot of liberties to create the action sequences, which I was grateful for [...] Creating something that hadn't been done before in other films was quite a challenge, and I think we accomplished it.\nCasey O'Neill, stunt double: I just finished doing a play in Vegas called Man of La Mancha with another sword master, Philippe Gagnon, from France. So I had been doing a lot of sword work, obviously, in the show that I was doing, and then also other ones. I was doing Winds of the Gods, which was at the Luxor Hotel, which is with bullwhip fights and all that kind of stuff. So I'd been wrapping a bullwhip around someone's neck, like 20-foot bullwhip, and doing a big bullwhip fight and chariots and all this stuff. So I feel like I was kind of training for [the \"Zorro\"] job for years before it even happened. And I was also trick riding in the show at the Excalibur, along with being a knight in the show.\nBut I remember going to the audition and everything was real quick. I remember Glenn saying, \"Yeah, do you do sword stuff?\" I said, \"Sure.\" And I just did a few bits and he said, \"Okay, that's good. Do you bullwhip?\" I said, \"Yeah, I do too.\" And I did all this stuff and the popper went flying and he goes, \"Okay, that's enough.\" And I thought, Man, this is not going very well. I'm not able to show anything, right? And then so he says, \"You ride a horse?\" I said, \"Of course.\" So I did one lap on the trick riding, which was double vaults, was a very easy trick. It's like one of the first things you learn. He said, \"That's enough. Come on down.\" And I thought, Oh man, this didn't go very well. And he said, \"Hey, you can leave here knowing that you got the job doubling Antonio.\" And I was just blown away.\nWhat a great opportunity. And to be there on the full show like that and to be with Anthony Hopkins, Antonio Banderas, and Martin Campbell as the director, it was amazing. It was like a life-changing job for me. I never looked back. I basically have been going ever since that movie.\nThom Noble, editor: When Antonio tries to steal the horse, that mayhem that's going on in that place, with things falling all over, it's just amazing. I just thought, God, that's well-staged. And Martin is really brilliant at that sort of thing, absolutely brilliant.\nJohn Gertz, co-producer: The stunt work was unbelievable. I was there the day the soldier's barracks was blown up, and it was just basically one shot. It took most of the day to prepare it, cameras everywhere. And then in a single moment, all the stuntmen were in their positions, all properly padded and so forth, and it was just a ten-second shot, 15-second shot, when all hell broke loose, and the whole thing collapsed in a pile of rubble.\nCasey O'Neill, stunt double: You have to do it all in steps, a little bit at a time. To get the horse to actually crash through wood or balsa wood, even though it was flimsy-ish, you have to start with paper or streamers [hanging] down. So that was a tricky one, to get the horse to actually break through something, because it's not in their nature to do that stuff.\nSo that went really well, and just getting that whole scene down with the bucking horse and spinning around and rearing and knocking the whole bunk beds down, and just that whole scene, even up to where the giant throws me. I'm on an Air Ram [pneumatic device] and land down there ... but a lot of the horse work came through really well, but it was absolutely rehearsed, meticulously, every step of the way [...]\nThere's a couple other doubles. One, Tony Angelotti, who was kind of the gymnast double, so he did a lot of the back flips and all the flipping around and some of the sword stuff. And he and I would trade back and forth between doubling Antonio and Anthony Hopkins. I did mostly the horse stuff and the falls and the crashes and things. And Tony did a lot of the flipping and swinging on the vines and running up high on the walls and doing all that kind of stuff.\nAnd it was funny, because while he was getting in prosthetics to double either Antonio or Anthony Hopkins, I would test everything. So he'd come to set. We were both pretty new stunt people at the time. He said, \"Man, what's going on?\" I said, \"Oh, you got to run across here, do the whip there, swing across that, and then the bullet hits are going to go here.\" It was really fun. We had a great camaraderie and teamwork with him.\nTony Angelotti, stunts: I had to do some crazy stunts. And a lot of times, you're doing stuff for the first time that you've never done before. I have to swing from a church steeple to doing a bullwhip around a flagpole and then swing and then kip up on a bar and then jump onto a balcony. Obviously, that's all shot in cuts.\nThe bullwhip was, when I went to actually swing on it, it was secured to the pole with a wire within the bullwhip. Otherwise, it would just stretch and I would eventually land on the ground. I was over three stories up in the air, and I had rehearsed this a number of times with a wire and a cable. But then when it came to the day, Glenn said, \"I don't want to use the cable. I want you to do it without the wire.\" And I'm thinking, Why would I need to do it without the wire when we did it with the wire all along? And that was his call, and I did it. I did it like three, maybe four times. And then I get word a few weeks later that we have to shoot it again because it didn't match the sky of all the previous masters that they shot.\nI was on set shooting nights ... it was the sequence when Montero breaks into Zorro's house. We were shooting sequences of the fight scene there, and it's like two o'clock in the morning. And I get pulled aside by Doug Claybourne and [production supervisor] Nancy King, and they basically said, \"We need you to be on set at six AM tomorrow morning to reshoot this sequence,\" which was possibly one of the hardest stunts I've ever done in my life, because I didn't have a safety loop. I didn't have anything on that bullwhip. The last thing you wanted to do was peel off at the bottom. I had a row of boxes and a crash pad with Casey O'Neill at the end, and if I were to peel off on the bottom, he was going to try to catch me. Those were my last words to him. I said, \"Whatever you do, don't let me go tumble onto that cobblestone. Just go long with that.\" So they said, \"Well, we need you to go and reshoot this.\" And they basically asked me if I was okay with it, because it didn't meet any turnaround rules whatsoever.\nI said, \"I'm fine with that.\" And they said, \"Well, you need to leave now.\" That shot was more important than what we were doing there. So I basically got a few hours of sleep and went back to set the next day. I asked the head rigger, \"Is there any way that we could put a little safety loop\" — it's basically called a circus loop — \"on this, so it would just help me hang on a little?\" And he's like, \"Yeah, I'll weave one in.\" And I could have done 100 of them after that, because that made it a million times easier. I did it three times, done and in the can ... so thank goodness, that worked out perfect.\nCasey O'Neill, stunt double: I know there's one [image], it's on my website somewhere, but it's an iconic shot of Zorro rearing, and he's on top of the building with the sword, which we would never do that practically nowadays. But we did it like 30 feet in the air and it was like a 9-by-9 set piece. And the horse, I ran him up the stairs and reared him on the top of this building, and he would step here and there, and all I could think about is like, \"Oh my gosh, one step or two this way or that way, and we're going down, off the edge of this building.\" But all that went really, really great.\nTony Angelotti, stunts: You look at the sequences and you think, Well, someone actually could do that. That's not super-human. They wanted it to be very believable, and this hero could actually do all of these things. Now, granted, it'd be one hell of a person who could do all of that stuff. It was this major acrobat who was an expert swordsman, who was an expert horseman, everything all in one. We had so many doubles to do all of the different sequences, so many different horse doubles. Casey was the other main double. We had Tad Griffith, who did all the Roman riding and the trick riding — I mean, just amazing sequences that he did. And then we had Richard Blackwell, and there was another gentleman, I forget who it was, that did some of the bronco riding sequences when the horse went crazy in the barn. And we had numerous more horse-related doubles because there was so many different specialties that they needed to get done.\nGlenn Randall Jr., stunt coordinator/2nd unit director: It's a tough business. You're going to get bruised, I don't care how careful you are, if you really sell out on a stunt. That's before we did so much CGI and bluescreen work ... since I've retired, I look at films now and I don't even know how the hell they make them. I've been out of the business 20-some years now, and we had to do everything for real. And now everything is in cables and bluescreen, and from what the guys tell me, they won't even let you do high falls anymore unless you have a cable on you.\nCasey O'Neill, stunt double: Because we had the tall kind of cowboy boots with the heels, there's a scene where I jump off the balcony and swing on a chandelier and it's all cut into certain pieces, but I jumped off into a pad and I rolled my ankles kind of early on. And so I ended up just taping my ankles, almost like a football player does to play football, kind of from the beginning of that show on. And I remember Glenn saw me kind of limping down the hallway a little bit. He goes, \"Hey, are you limping?\" I said, \"No, no, no. I just stepped wrong.\"\nAs a stunt performer, maybe now they don't do it so much, but back then, you just worked injured and you didn't want anyone to know because the next guy is going to be there. But I did. I had my ankles taped up on the show, but it was a very heavily athletic-type show, not only with the horses, just in general.\nGlenn Randall Jr., stunt coordinator/2nd unit director: If I design something, I know the guy's abilities and we might rehearse it a time or two to make sure it goes according to our plans, but pulling it off on the day, you better be prepared to do it and not have to do it more than once or twice. Production time costs a lot of money, and we don't have time to waste on doing any particular stunt. There was one stunt — I did remember having difficulties with the shooting the wagon full of gold going over and hitting the cage. I think I shot it three times and each time I shot it, I totally destroyed a wagon. It took a long time to reassemble everything, but I wasn't satisfied with the first two shots and I finally got it on the third shot.\nChapter 13: The epic horse chase\nTerry Rossio, writer: I recall pondering Zorro's escape ride, wondering how to come up with an action sequence that was somewhat on par with the famous Indiana Jones truck scene. Sending his horse forward, and then Zorro taking out the soldiers one by one from behind, jumping from horse to horse, felt like a worthy addition to cinema chase scenes.\nGlenn Randall Jr., stunt coordinator/2nd unit director: It was written as a chase scene and very little description of the action and what took place. So [Martin Campbell] allowed me to storyboard a sequence that I thought would be interesting. I showed it to him. We made some minor adjustments. I went back and storyboarded some more, and finally came up with the original concept for the chase, which he bought off on and allowed me to go out and shoot it.\nCasey O'Neill, stunt double: Inherently on a second unit, you try and add a few things to make it better, or you get what's scripted and you want to try and add a few pieces that make it more exciting. When the guy gets ... he vaults over and kicks the guy and he falls off and hits a tree and the tree falls down, that wasn't scripted. But we've set it up that way to do the action like that. And then locations kind of dictate a little bit as well. You're like, \"Oh, shoot, this would be really great,\" or \"This would be cool,\" but the location allows or doesn't allow for something. So that also kind of directs the way the action will go as well. And Glenn, he had done so many second units as a stunt coordinator and director, and he was so talented, or is. He's retired now, but really had a great handle on all that stuff.\nJohn Eskow, writer: The other issue was Hopkins had a severely injured back, and it was very dicey as to whether he would be able to do some of the stunts that the movie required. That's another thing this movie has, is awesome stunt coordination.\nGeorge Parra, first assistant director: We doubled [Hopkins] a lot, obviously, because he's an elderly man. Was then and still is now. He was probably in his late 60s back then. Zorro would do these things, as he was Zorro, jumping through the air off of a horse. And then we'd do the old cowboy [switch], you'd see the stuntman fly through the air and land behind a table, and then Anthony would pop up. He would give us the pose and dash off. And then everybody just died laughing, because it was absurd, but it worked. You know what I mean? I think he himself a few times couldn't hold a smile and laugh. We'd have to cut and do it again because it was funny. It wasn't supposed to be, but it was.\nCasey O'Neill, stunt double: Then there was another guy that came in, Tad Griffith, who brought his Roman riding team, where he's standing on the horses and he jumps over the tree. And I actually, at that point, was doubling the colonel who hits the tree and he gets stuck and then falls down.\nTad Griffith, stunts: I got into [Hollywood] by being a world champion trick rider, a Roman rider. It was a breakthrough movie for me, mainly because it came along at a time that I had the perfect horses trained already to do the movie. I never could have done that movie the way it was done if I'd had to just train horses once I got the word — or worse yet, try to fly down to Mexico and train horses there. It would've never been possible. What made that movie possible was the horses I had at the time that I was asked to do it. To me, the horses are the star of the show.\nCasey O'Neill, stunt double: The horses were amazing.\nTad Griffith, stunts: If you look my family up, that's what we do. We're equestrian gymnasts and it dates back, well, to my grandfather, but my father was really the one that took what we do to a whole other level. When he was nine, he won the trick riding competitions in this country, and when he was 21, he went to London at the White Horse Stadium and competed against 48 other countries, did 156 tricks to win the world championship. That's really hard to do in Europe because nobody wants to give an American cowboy a trick riding championship, so he had to go beyond superhuman. He was one of the few people that I think could reinvent a sport, then perform the sport, and then on top of that, teach the sport — teach a new way of doing it.\nWhat he allowed us to do, and you'll see that in this sequence, is he learned how to use the strength of the horse and the timing of the horse, and he redefined the position that we needed to be in to take advantage of that power of the horse coming off the ground that makes us go up instead of on. Everyone else may jump off a horse — no offense, but the Russians or the Europeans, it's common sense. If you jump off a horse, you want to get back on as fast as you can, but when you turn in, all your momentum goes into the horse, you kind of climb back on. Or they also think if they hit far enough in front of the horse, it'll jerk you on as they go by.\nMy dad invented a new way, and that is to stay away from the horse, strike the ground when he does, pull, and then every single stride for an instant, you're weightless. That's why if you watch that sequence, you'll see how I hit the ground and I land softly, and then the next beat, I'm ready to do something. Because one, two, three, four — it's like a dance partner.\nTiming is innately in your head, and if you're not with the horse, if you're not with a thousand pound animal or machine throwing you around, then you're against them, and it makes you look like scrambled eggs and it looks really, really rough when you do it. When you do it in timing correctly, it's seamless, graceful, and light, and that's how he taught.\nIn the film's biggest horse chase scene, Zorro inadvertently sends his horse off as a decoy and a group of soldiers ride after it. Zorro doubles back and hops onto the last horse of the bunch, unseating its rider, and proceeds to slowly take out each soldier without the others realizing. One of the sequence's most jaw-dropping stunts involves Zorro (Tad Griffith) sliding backwards out of the saddle and throwing his legs over the side, using the ground as a springboard to completely flip upside down and land in the saddle again, now seated backwards, so he can ride alongside the next guard and surprise him with a punch. Griffith makes it look easy, but it's quietly one of the coolest moments of the entire film.\nTad Griffith, stunts: We changed a few things from the original storyboards, but that was one of the things I actually did have to change. They had me doing it from the back of the horse, landing forwards, kind of like a straight over flip. We have a variation of that, but we determined it was cooler with the cape. That was the thing I found with the other one. I couldn't not get wrapped up in the cape when I did the full twist forward, I just had the big black cape wrapped in my head. But when I just did the half twist, I was able to clear it and do the punch, so that's what we went with.\nCasey O'Neill, stunt double: I felt like it was still real old school stunts. We were still doing everything for real ... It was all practical. I remember jumping off this rock to the horses as they ran by, and I told Glenn, \"I said, how do you want me to land? On my feet? Then jump down?\" He said, \"Kid, just get on.\" And I said, \"Okay.\" And I missed the horse by 10 feet, the first one. I wasn't even close, but finally ended up dialing that in.\nTad Griffith, stunts: I rehearsed everything in Vegas before I went, which shocked them a little bit. But I like to rehearse everything, being a live show guy, I wanted to make sure I had it before I went down there. Of course, it changed a lot when I got down there because I'd been rehearsing that jump over the tree with a piece of PVC in an arena on a straightaway. I got down there and found a tree and it's kind of like downhill and they just dug a new road around it. It comes off the main road, makes a half moon around this tree. I think the picture I sent you [see above], you'll see that I'm kind of all cockeyed going one way. That's because I'm having to jump to where the horses are going to be when I land. First couple of times I did it, I did the same move I had done before and I just landed there were no horses there because they went left. You learn. The learning curve gets pretty quick.\nCasey O'Neill, stunt double: Those horses were so well-trained, and it was such an honor to be able to be a part of that and to ride those horses and do what we did on those horses, even just from jumping on the back of them or jumping off the balcony and landing on the back. And it all seems simple, but man, it's all stuff that horses shy away from. They're not supposed to do any of that stuff.\nTad Griffith, stunts: They asked me originally if I could jump over a tree branch. \"Yeah, yeah. Sure, sounds good. I think so, yeah.\" But what I found was, well, first off, it's a tree. It wasn't a tree branch. I remember getting there and I rode up to it on my horses standing up and it was like head high. I'm going, \"I think that Zorro would just duck under.\" Anyway, so we got the tree dug out. We were the only ones on location for two weeks by ourselves, just my wrangler and myself, a couple security guards. We got it down to the level where it had to stay about eight inches above my horse's backs for them so that when they're running their back didn't hit it. And then — I'm just going to walk through the thing with you so you can understand what the stunt involved. The thing about that gag was, because we used no wires, we used no protection, it just either worked or it didn't work. It was really weird, because once I committed to the tree, the horses had to come in into perfect stride, three strides before the tree because then I had to throw the range down, load my legs, and then jump, and that's three strides.\nIf in that time they didn't stay perfectly in stride, I didn't have time to even jump down because I'd just eat the tree in the face and chest and there was nowhere to go because I'd already thrown. There's no way to stop and no way to jump down. Literally you would just impact the tree. I learned, after a while, not to just stare at it. If it wasn't going right, do something. You would think you could just lean over onto one leg and get enough lift off of one horse, but you couldn't. You would just wind up tagging one shin and just ... I knocked myself out a couple of times in the beginning. Yeah, just because you're coming from about 11, 12 feet in the air to the ground.\nI remember the first day all these other guys [came] to watch. They finally joined me on second unit. I've been shooting a bunch of stuff that didn't involve everyone else, so I was all excited because they were all there. I lined everybody up. I said, \"Hey, watch this...\"\nI came running in there and I tried to jump over the tree and I didn't make it, and I hit the ground and they're all going, \"Oh my God.\" I get up and I go back. I'm a little embarrassed because it's one of my first big movies and these are all really big, real famous people. I go back and I try to again and I make it over.\nOne of stuntmen goes, \"Hey, come here.\" He goes, \"Okay, you're not going to practice that anymore.\" I go, \"Of course I'm going to have to practice this.\" \"No, no, no, you're not going to practice that anymore until you do it.\" I go, \"Why?\" He goes, \"Because if you kill yourself practicing, they're going to line us up all in Zorro suits and make one of every us try doing that, and we're not doing it.\"\nChapter 14: The mine explosion\nMontero's dastardly plan is to buy California from General Santa Anna using gold Montero discovered on Santa Anna's own land. Once the gold has been procured, Montero and Captain Love decide to blow up their massive mining operation, killing all the workers so there will be no witnesses and Santa Anna will never know of their treachery. When the explosion finally happens, you can hear animal sounds growling and roaring across the soundscape.\nDave McMoyler, supervising sound editor: I won't say it's a sore subject, but it is something that, if I had it to do again, I would try to minimize some of the animal sounds. What happened was, I think it was for the big climax where the mine blows up at the end of the movie, on a couple selected explosions, we put in some ... I think there were some tiger grows, and then a cougar growl. The thing is, when we were going through that, Martin, the director, he just loved them. He loved them. From my perspective, maybe a little too much, because he wanted them to play louder than I would've preferred, because using an element like that can be very effective. But the whole point is, it's kind of like a painter: You don't want your brush strokes to show. I think the animal sounds were a little, to my liking, a little bit [too loud]. But I can't argue with the results, because people love the mix. And kind of along the same line, he also fell in love with the red-tailed hawk, which you hear in pretty much every commercial ever made, and he loved it ... we had it in a few strategic places, and Martin would just say, \"Hey, I need that bird. Give me that bird.\" So those two things, for me, I wish we had peeled them back a little bit, but whatever.\nCasey O'Neill, stunt double: I worked both on first and second unit for the whole goldmine explosions, and all that stuff was on Glenn's second unit. And the elevator that they brought the gold up and down on, there's a big fight on that and all kinds of just crazy stuff there.\nDoug Claybourne, producer: [The mine set] was built from scratch. We had to build it to blow it up.\nGeorge Parra, first assistant director: When we did the big explosion at the mine at the end, they had determined ... this is by memory 25 years ago. But I remember they had determined that some of [the explosives] had not exploded. These weren't CG, computer-generated explosions. They were a lot. They were real, which is what we used to do, mostly. But they'd determined that some of them had not gone up, and yet there was a half-acre of pile of rubble, because we blew up everything. They'd determined that some of them still had not gone off, had not detonated...\nSo we determined that we couldn't shoot the last scenes, where I think it was Antonio, Catherine, and I think the two of them were walking through the rubble, the smoking embers of the mine. We couldn't put a crew, let alone two actors to go through there without detonated explosives.\nDoug Claybourne, producer: We had a lot of challenges with our special effects, mechanical effects on set. I'm sure you noticed that we blew up that compound a couple of different times trying to destroy it. It was built very well. And I think we went through a couple of different special effects foremen that had expertise in blowing things up, and that didn't work. So we had to end up rehiring a couple of different people. I don't remember names, and of course wouldn't quote names, but we had a challenge trying to blow that thing up and do it safely. That was a big deal.\nDave McMoyler, supervising sound editor: The other sound that I would have to say that, to me, is one of my favorite sounds is during the mine explosion. And the mine explosion itself was — we were very fortunate in that Martin shot that three times because he wasn't happy until he got his final, and there's kind of like three beats to it. The first one is sort of like the earth-shaking, rumbling, that's kind of inside the mountain. Then there was the fire, there were all the fireballs — that was the second stage. Then the third phase was just debris flying, and the dirt ... I think it's one of the final shots during the phase three, which was the debris, there was this one big post that kind of spun through the left foreground of the screen. And working with Gary Hecker and Jeff Wilhoit, who were my Foley walkers, I said, \"We need something special for that.\" And they got a bullroarer, which is, it's an Indian — it's a musical instrument, I guess, where it's basically a piece of wood at the end of a rope and you twirl it around. And there's one moment where Gary and Jeff just came up with the perfect sound for that one beam that [spins] through. So that's one of my favorites.\nCasey O'Neill, stunt double: I remember that when we went to do the explosion at the goldmine, the first one didn't go so big. So the [third] time they did it, it obliterated the entire set, gone, and there was shock waves that went miles away, broke a window out on some homes and stuff. And I remember people just being like, \"Oh my gosh, that was insane,\" the amount of whatever explosives and primer cord and everything else that they did there. I remember that story because everyone just couldn't believe that here's this goldmine and then boom, and it was just gone. But too much gone.\nChapter 15: Post-production\nDave McMoyler, supervising sound editor: I have to say, the whole project was the high point of my career in many, many ways. But a lot of it was just working with Martin because he was so appreciative of everything we did, and he was willing to let us try different things and experiment with things. The process of spotting this movie was different than pretty much any other film I've done, because normally you go over and you have a spot and you look at the whole movie.\nBut this one, it was just, they brought me over into the cutting room pretty much every day or every other day for about two weeks, and every day I would look at a new reel, and every one was just like Christmas. It was just like, \"Oh my God, I can't wait to get my hands on this. This is going to be so fun.\" I think Martin knew what he had. He knew this was going to be a great movie, and people were really going to enjoy it, and people would be talking about it 25 years later, so it was a pleasure working with him. I would say the biggest thing is just his dedication and his enthusiasm. He just was so into it.\nThom Noble, editor: The footage started coming in. And I knew Martin was good, but I didn't realize he was that good, because everything that you ever needed, as far as material's concerned, it was there. So it started to be the greatest fun, cutting this together. Plus the fact that we were in Mexico, which was kind of exotic, at Churubusco Studios.\nDave McMoyler, supervising sound editor: Unlike a lot of other movies, the other aspect of this where I felt extremely fortunate is that once they turned over a reel, it really didn't change very much. I mean, typically, most movies, they are messing with it right up to the end, and sometimes they juxtapose scenes and they try [all kinds of things]. This was very, very minor changes. Again, I felt unusually blessed in that instead of having to work with conforming and fixing holes and things like that, we were able to just continue to improve and to continue to try new things.\nThom Noble, editor: All [modern] dialogue scenes are shoving two or three cameras, they want you to cut constantly between side angles. And for what? Nothing. Everybody is fidgeting nowadays. So I think when you look at \"Zorro,\" it's cut exactly an old movie would be, but with different sort of pacing. Everybody has their moment.\nDave McMoyler, supervising sound editor: There was one shot, it was around the time when [Zorro] meets Elena for the first time, and there was a shot where he looks down at his reflection in a well, and there was a moment, there was a little break in the music and a little break in everything, and Stu found the perfect wolf howl that he put in there. \"Zorro\" actually means \"fox,\" but it was perfect.\nThom Noble, editor: We're getting to the end of the film, and Martin said to me, \"I want you to go over to London with the composer, and just sit in there. Because I can't be there for the beginning, and you know what I want. Make sure that he gives it to us.\" I say, \"Well, yes.\" Because I'd worked with Jamie Horner before, and I remember saying to him, on \"Uncommon Valor,\" with Gene Hackman, I said to Jamie — he was very young at the time — I said, \"This is the most arrogant score I have ever come across, because you don't care about anything except your music. You realize that we've got to get dialogue through all this? This is insane.\" Anyway, so that was our meeting. So Martin knew about that, and he said, \"So I'm sending you to keep an eye on him.\"\n[James Horner] had all these flamenco dancers come in, but he wanted to separate the clapping and the feet from the guitar playing. It was such a brilliant idea, because that footstep happens right at the beginning of the credits — I think it had just that. And throughout the film, it's being used by the sound people, to just make it much more exciting, with all this sort of clapping and stamping. Fantastic. He did an amazingly good score, really good.\nDave McMoyler, supervising sound editor: I met [Horner] several times, but most of my contact was with his music editor, Dick Bernstein, who, again, did an amazing job. Yeah, there was a lot of give and take. I think we started before James had started working on the score for the first temp mix we did, and we hit it pretty hard. We actually really wanted to load up and really pack a lot of goodies into the first preview with an audience. It was fairly well-built out. I think what ended up happening was James, working through Dick Bernstein, had access to all of our stems, all of our effects and background stems, and he used that and kind of did a cool little dance. Along those lines, I would like to say that all of the clapping and the foot stomping, all that, I'd like to say that was all me, but that was James, and he did a great job. He did a really great job.\nThom Noble, editor: One of the funny things that happened in the last scene is that Martin said, \"The thing about Catherine, she's very good, but she should let a tear drop in that scene.\" So we had a CGI tear cut into that. And it did make a tremendous difference.\nTony Angelotti, stunts: One [sword fight] sequence, we called it the table sequence ... that sequence, which we were able to shoot from the point of me after I landed [a jump down from a balcony], and then I continued on, that whole master sequence, of doing the fun flip over the guy's back and the handspring onto the table, and then all of the sequence up until the point of where they had to cut to Antonio, I thought that was pretty amazing. Just how clever it was. And then the part about me swinging on the tree, which, that was another stunt I designed. I designed that with the special effects [team] and the set dresser and production designer, on how the tree branches needed to be for me to be able to kick someone, kip up, hook my knees underneath, and then do what's called a penny flip onto the ground and pick up my sword and keep going.\nSo in post-production, Martin Campbell called me into his office and he wanted to show me — which, let me just tell you, this is not normal, when a director would call a stunt guy in and ask him their opinion, if they were okay with something. I went in at Sony and he said, \"I just want to let you know that I want to use the master on this sequence and then cut to Antonio at the last part. Are you okay with that?\"\nI just looked at him, and I'm like, \"Well, I think you're asking the wrong person. I'm thinking maybe you should be asking Antonio this question, not me.\" [laughs] And he's like, \"No, it's too flawless and I want to use it up until the point where we need to go to his close-up.\" And I said, \"I'm fine with that. I would love that.\" And it looks great. It was shot all in one. So that was a fun, I think, memorable sequence.\nThom Noble, editor: We got back to Culver City to do the final cut, and it was actually the easiest final cut ever, because there was really not much to do. Everything fit perfectly the way it should. The music was fantastic. Everything was amazing. And Martin said, \"Well, we've got to show this to Spielberg, the director's cut.\" And I said, \"Well, okay, fine.\" So we went out to the house, and he ran the film. And there were some comments on it, but all very positive. And we got into Martin's car, and he said to me, \"I can't believe it. All he talked about was the editing. Nothing about my direction at all!\" And I said to him, \"Look, I couldn't have done it without the way you shot it!\"\nDave McMoyler, supervising sound editor: One of the things that I have to say that helped on his project and that Martin appreciated, and I know Thom appreciated, were gags. I've always liked to put in gags. On this one, there were a number of times where Zorro would make a dramatic exit. The first time he meets Elena, it's very flirtatious and just adorable, adorable. And then he runs up to the top of stairs on this part of the building and whisks over and disappears down the other side. Well, I had him take a horrendous fall and you could hear the sword clashing. [laughs]\nAnd then the other place, the one that I think Martin appreciated, was there was a scene early on when Anthony Hopkins' character comes back to the estate and he's in the house, but they cut to his wife, and she's down on the bluff looking out at the ocean, and then she turns around and looks up at the castle behind her, the mansion. And it was like, there was a question about, \"Should there be a sound?\" And we ended up not playing it, but one of my ideas was to have a toilet flush, and Martin really liked it. [laughs] Those are Easter eggs that did not make the final mix.\nThom Noble, editor: The other thing I remember about the end of it was that Jamie Horner said, \"We need a song.\" And of course, having done the song for \"Titanic\" [\"My Heart Will Go On\"], we thought, Oh, well, I guess we can't argue with him, because that was such a smash. We've got to smash for \"Zorro.\" And I thought, Well, is he going to get Celine Dion to do it? It's like two unknown Sony artists that ended up on the soundtrack, and it was a rubbish song. It really was. Oh my God. Thank God the film is so good. To go out on a sort of dud like this is unfortunate. It's like the B-side of something, you know?\nChapter 16: The premiere, and the film's legacy\nThom Noble, editor: At the preview, the audience wasn't happy with the ending, which was Antonio and Catherine leading the mine survivors to meet Santa Anna. So the final scene was a reshoot done at Sony: Catherine and Antonio with a baby boy to continue the legend. Naturally, a Spielberg idea. He really loves to bookend his movies.\nGeorge Parra, first assistant director: Phil Méheux, the DP, myself, Martin, and Martin's assistant went to a screening. It might've been the premiere, but it was a big screening in L.A. And we were sitting up on a terrace looking down at everybody. And he had brought a spread of food, his assistant had two bottles of champagne — very British, very fun — and we watched the film. I hadn't seen it. They had, of course, but I hadn't seen it. And I was just so happy about the outcome, because it turned out spectacular.\nThe lights came up, and everybody looked up and applauded Martin, and Martin waved and what have you. And then, coming from the stair area, was Steven Spielberg ... he came up to Martin and gave him a big hug. And I remember the exact words. He said, \"Congratulations, Martin. My only regret is not directing this film myself.\" And he said, \"It turned out beautifully. Good job.\" And then he said, \"Who are these gentlemen?\" And so Martin reintroduced Philip Méheux and me, and he gave me a nice congratulations. And it was such a pat on the back. One of the greatest filmmakers of all time saying, \"Great job.\" I'll never forget that moment. It was a great finality to a great experience, to have of the greatest filmmakers thank you — and he did say \"thank you,\" because he was a producer.\nDave McMoyler, supervising sound editor: I remember there was something amiss in the sound system at the theater we were at, and there was about a 75 cycle hum that we could hear coming from the surrounds, and we tried to fix it. They were able to minimize it, but they weren't — I was kind of obsessing about that, until about the third reel, and then it was just because the audience was so into it. It probably was even earlier than that. It could have been the very first courtyard scene, because the audience was so into it, it was like they didn't hear that. To see things working and to hear the responses to the stuff we had cut, it was very gratifying. I think even before we showed it to an audience, we knew that we were working on something pretty special. But after that, it was just like, \"This is awesome.\"\nJohn Eskow, writer: My wife and I took [my mother] to a big screening in New York. She was still pretty young. She was probably like 65 or something. And as we came out of the theater, I saw she had tears in her eyes. And I said, \"What's up, Mom?\" And she said, \"I'm just marveling over the fact that when you were six years old, for Halloween, you were Zorro and you had the cape and the hat, and you were carving Zs everywhere you went, on the sofa. I had to get it reupholstered. And now you're writing Zorro.\" And for a parent — now as a parent myself, I can only begin to imagine how overwhelming that must have been for her: The journey from seeing your five-year-old, to seeing your 40-year-old or whatever, as a grownup as the writer of it. That was a magical moment for me.\nJohn Gertz, co-producer: I'm proud of the portrayal of Zorro. I mean, this movie has been terrific for the property at large. It set kind of a gold standard, if you will, that everybody realizes. I've never met anybody who doesn't love this film. It's generally considered to be a real classic. Matter of fact, when I saw it for the first time, in the screening room, I happened to be sitting next to the president of marketing at the time. You're going to have to look it up, I think his last name was Levinson. [Editor's note: It was Robert Levin.] As soon as the lights came up, I turned to him. I said, \"Mike,\" or \"Joe,\" or whatever his first name was, I'm blanking on it. I said, \"Oh my God, this is going to win an Academy Award as the Best Picture of the year!\" And you know what he said to me? Actually, I felt like this small when he said it. He turned to me, and his exact words, and with sort of real disdain in his voice, were, \"God forbid.\" And I go, \"What?\" And he wasn't joking. I had to have it spelled out for me, because I'm not a marketing executive. He says, \"This is a summer blockbuster. This is a summer fun film. If you try to label it as a classic piece of art that's worthy of an Academy Award, nobody's going to see it.\" I learned a lesson that day, the hard way.\nThom Noble, editor: Years later, my agent called me, and he said, \"Ralph Winter wants to talk to you. Is that okay? Can I give him your number?\" And I said, \"Yeah.\" Because Ralph Winter had cut \"Ben-Hur.\" He was one of the great editors of all time. And he said to me, \"Listen, you're not going to get an Oscar. But, 'Zorro' was the best cut film this year.\" I thought, \"Wow, coming from you, that's really amazing.\" But he was absolutely right. It's not a film that would ever get nominated. It just wouldn't. Performances? No, you couldn't give Tony an Oscar for \"Zorro.\" It's too much fun, isn't it? I think the only nomination was for sound, which is perfect.\nJohn Eskow, writer: This is a movie that I had some great experiences on, some not so great experiences. But at the end of the day, I'm really happy to have participated in it, because it's brought a lot of people a lot of happiness. I can't tell you how many people I've run into spanning from age eight to 58, people who saw it as children, saw it with their parents, saw it as grownups, saw it as teenagers, and have very fond memories associated with it.\nIt's very, very rare that you get to write a movie that really has something substantive to offer children and adults at the same time. I remember sitting in the audience at a couple of theaters when it opened. You'd just go walk around, in the days when there were people going to movie theaters, and you'd look around and you'd just see all ages — parents laughing along with their eight-year-olds.\nDoug Claybourne, producer: It's a lovely kind of big popcorn picture. It's fun and I am very proud of it. I think it was just a wonderful feat to get it made. And considering the amount of time and money and the energy and effort, I have very good feelings about it. Some pictures, when you're finished, you're like, \"Oh my God, I'd never do that again,\" but I would certainly dive in and make this movie — or something better.\nTerry Rossio, writer: \"The Mask of Zorro\" was always intended to be a throwback film, like they discovered a dusty, overlooked Douglas Fairbanks screenplay in the studio vaults and decided to made the film. So yes, I think the film holds up well, because it was designed to feel classic from day one.\nRay Zimmerman, physical production executive: The rhythm, the pacing, it pulls you through. It's good old-fashioned storytelling. When I came into the business, I came in 1980, and that was kind of, I guess they call it now the New Hollywood. And that was just the business to us. When I left in 2005, it had changed and I could feel the vibe changing and I just kind of didn't want to be part of it anymore because it was getting more digital instead of analog.\nDoug Claybourne, producer: Mexico was really just a lovely country and the people were terrific. Again, we were not in one place, so we moved from place to place. So we got to see the country and really be with the people in Mexico. And I hope they have good feelings for us having made it there. We tried to be respectful and upfront with everybody, so I hope they feel the same way about us.\nThom Noble, editor: It's like seeing an old friend again. I ran a bit this morning of \"Zorro,\" and I thought, \"Actually, it's really, really good.\" And it has some nice comedic moments in it, too. It's doesn't take itself at all seriously. And yet, there's some heartbreaking moments in it.\nJohn Eskow, writer: It's all worth it when you get the incredible, joyful experience of being on Hollywood Boulevard with the streets blocked off, just like you've seen in every movie from the '40s of a Hollywood premiere. It was amazing, the search lights sweeping the sky and the paparazzi. And this leads into the story of how and why I got kissed in on the mouth by Kirk Douglas.\nAt the opening, [co-producer] David Foster said, \"Let me bring you over and introduce you to Catherine.\" So we went over. And I'm telling you, I've never seen a woman as beautiful as her in that moment. It was dazzling, like Ava Gardner or Marilyn Monroe. It was just almost unreal how gorgeous she was. And this was a funny moment. David Foster said, \"Catherine, I want you to meet John, the writer.\" And she leaned in and she gave me a kiss, and I smelled this — as if she wasn't already overwhelming enough, this perfume just suffused me. It was just incredible. And she whispered in my ear, \"Hello, writer.\" And I thought, Oh my God, my knees are going to give way, basically. And suddenly I heard my wife, who is very beautiful herself, off to the side saying, \"And I'm his wife.\" I said, \"Oh yeah, this is my wife, Val.\"\nUltimately, a couple of weeks later, or a couple months later, I was in a restaurant in Hollywood with this guy whose name was Guy McElwaine, who used to be the head of [an agency], ICM. We were having drinks or something, and he says, \"Let me take you up ... \" And suddenly I see Kirk Douglas across the room, and there are only a couple of movie stars that really knocked me on my ass when I met them. Clint Eastwood was one. I did a movie with him, \"Pink Cadillac.\" He produced my first movie and starred it. And Robert Mitchum. The guys who, when I was a little boy, were big macho guys. And Kirk Douglas was definitely one who I was starstruck by.\nHe had already had his strokes and everything, but he was sitting down there eating. And I said to this guy, McElwaine, \"I don't know, why would he want to meet me?\" And he said, \"You'll see.\" I was like, \"What's this?\" So he took me over to Kirk Douglas' table and he said, \"Kirk, this is John Eskow, writer of 'The Mask of Zorro.'\"\nAnd to my complete bewilderment, Kirk Douglas stands up, grabs my head with both hands, and pulls me in and kisses me on the lips. I said, \"I'm a little confused here.\" Kirk said, with trembling voice, \"You got my son married.\" I said, \"What do you mean?\" He said, \"Michael saw Catherine on the screen in 'The Mask of Zorro.' He fell in love, he asked to contact her, and now they're engaged.\" And that was an amazing moment. You begin to realize the incredible ramifications that a movie can have. That was an amazing moment for me. I'll never forget it.",
  "word_count": 28414,
  "scraped_at": "2026-02-14T12:05:35.536012"
}