{
  "article_id": "d2e62e13b05c",
  "url": "https://www.arsenal.com/news/gemma-davison-watford-arsenal-usa",
  "title": "Gemma Davison : From Watford to Arsenal to the united states ",
  "date": "20251124T104500Z",
  "domain": "arsenal.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "When Arsenal won the UEFA Champions League for the first time in 2007, Gemma Davison was just 20 years old. While she describes that win over Umea as the defining moment of her career at such a young age, the journey into the Arsenal squad was far from straightforward.\nIt took some initiative, both from her mother and from her own sense of being a “maverick” on the pitch to forge her path as one of the most fearsome one v one wingers in the game.\nBut Gemma’s love of football emanated from her close relationship with her older brother growing up. “He was four years older than me and he was really good at football,” Gemma says.\n“You know when you’re at that age where you just follow your older sibling everywhere? That was me.”\nDavison, who played for Arsenal between 2005 and 2013 with some jaunts to the United States in between, says there were several other formative figures who supported and encouraged her path to professional football.\n“I played because I enjoyed it, I didn’t play for a team initially, then my teacher at primary school saw me play. My mum asked if I could join in with my brother’s football training and my teacher told my mum, ‘She’s really good, you should find a team for her.\n“My teacher pushed me and stuck up for me when I was picked for the boys’ team. Some parents were unhappy when I got picked over a boy, but she stuck by me.”\nGrowing up in Hertfordshire, Barnet-born Davison had access to good opportunities for girls’ football. “I ended up playing for a girls’ team in London Colney right near Arsenal’s training ground,” she says, which led her to be signed up by Watford.\nHer path to Arsenal from Watford was a mere hop over the fence geographically, but getting that opportunity required assertiveness and opportunism from her mother.\n“Shall I be really honest?’ Gemma contemplates. “Our Watford team was outstanding and on a par with Arsenal, but there are always trials. My mum overheard players from Watford were going on trial with Arsenal but she was never told about them. She took it into her own hands and called Clare Wheatley to see if she could get me a trial.\n“But I had missed so many already – it was the final trial and we were told that I might not be able to get in. But my mum got me a space and I did enough.”\nActually she did more than enough.\n“I knew I had to do something special to get in so I picked up the ball from my own half, took on the whole team and scored. I think that got me signed!”\nLooking back, Gemma is grateful for her mum’s foot in the door approach. “If it wasn’t for my mum overhearing a conversation and pushing for me, I never would have got that opportunity. She’s not a pushy parent either but I will forever be grateful she took that into her own hands.”\nHaving been encouraged by her mum and PE teacher, Davison had cause for gratitude to another key mentor once she signed for Arsenal. “Sian Williams was the captain at that time. I saw her the other week and she told me they knew after ten minutes of my trial they were going to sign me.\n“It was Sian who told me at 16, ‘You can get into the first team.’ She sat me down and asked, ‘What do you want to improve on?’ I said my crossing wasn’t consistent enough and I asked whether I could develop my one v one ability by combining with people more and she said, ‘This is great, but what’s your long-term target? You can play for England.’\n“I never thought I would be able to do that. After that, the penny dropped.”\nDavison, who now coaches at Chelsea, was a direct winger who revelled in the opportunity to beat a full back for pace or with a trick or skill. “I was always the same player,” she recalls. “I was very maverick. I enjoyed beating players and being creative. I was naturally good at manipulating the ball and moving with it at speed.\n“Coaches like Vic Ackers, Emma Hayes, Laura Harvey, they always encouraged me to try to beat my opponent and be myself. I always felt like I could eliminate my full back.”\nDavison came into an Arsenal team replete with stars like Kelly Smith, Jayne Ludlow, Rachel Yankey and Emma Byrne, managed by the legendary Akers.\nShe says she found a unique blend of elite players but an environment that was not oppressive for a precocious, skilful teenager: “Vic would let me be myself. I was 16 and I would get picked to go to first team training with these giant players like Rachel, Kelly, Jayne and these huge personalities, but they were really good people.\n“It was very special, this collection of legendary players, but they were playing for the badge. I was very fortunate to be in with that group. I knew I wasn’t close to starting at that age but I could be myself with them.\n“Every one of them encouraged me to do what I was good at. I probably got shouted at by Jayne a few times for not releasing the ball quickly enough but they looked after me and encouraged me to be me.”\nDavison later went on to play for Chelsea. She says Hayes’ influence on her career while Emma was part of Vic Akers’ staff cannot be understated. “Emma pushed Vic to play me. I knew Vic believed in me anyway, but she pushed even more. All these people are winners and being surrounded by that was incredibly special.”\nIn her nascent career, Gemma was part of a generation that really had to go to the US if they wanted to be full-time professionals. Davison had short-term spells at New York Magic, Chicago Red, Western New York Flash and Sky Blue, some of which were loan spells to keep her fitness up when she was not a regular fixture in the Arsenal starting eleven. Davison says her jaunts stateside were also about emulating role models.\n“Women’s football went pro in America and I saw my idols like Kelly Smith and Katie Chapman go there. Karen Carney went too, and she is one of my best friends in football. I just thought, ‘I want that.’ I was young and not starting every week for Arsenal and Emma Hayes advocated for me. She told me, ‘You need to go and learn to be a leader.’\n“She said to me, ‘Pick any state in America and I will send you there.’ I always wanted to go to New York so I went there. It was far from the best team that I played for, but it was the best time of my life because I learned to lead.\n“I learned how to run the show and win games myself. At Arsenal I knew if I gave the ball to Kelly Smith she would score. Being in the US taught me to take responsibility. Three months after I came back I was starting every game.”\nDavison always returned to Arsenal after her spells in the States, including in 2012 when she returned upon the sudden dissolution of the Women’s Professional Soccer League. “Never in doubt, I was always coming back to the Gooners!” she says. The winger says her time at Arsenal made her who she is.\n“I learned so much from being around players like that and coaches like Vic and Emma – being around winners on a team where everyone wanted the same outcome.\n“In games I would see someone like Kelly say, ‘Right, enough of this’ and go and score one, two, three goals. I saw and respected these people. Rachel Yankey is one of the best wingers of all time but so humble and I thought, ‘I have got to be like that.’\nDavison was 20 when Arsenal won the Champions League for the first time in 2007, a member of the matchday squad for both legs of the final against Umea, she says the senior players left her in no doubt about the size of the occasion - one senior player in particular.\n“Jayne Ludlow gave a speech before the first leg and that woman screams passion through her veins. I don’t think I have played with anyone like that. That was when it really hit me how big it was. I sat there as a kid and thought, ‘Wow, this is big.’”\n\"We knew Umea had said we were underdogs in the Swedish press and that fired everyone up.\"\nUmea, boasting talent like Marta, Hanna Ljungberg and Ramona Bachmann, were favourites for the final, especially as Kelly Smith was suspended for both legs. Davison said that merely redoubled the team’s determination to cause an upset.\n“We knew Umea had said we were underdogs in the Swedish press and that fired everyone up. We were without Kelly and we were doing it for her too. She was a targeted player and she carried the team to that point – without her we wouldn’t have been there.”\nDavison came on as a sub in the first leg, but not in the second. “In the second leg, Vic asked me to warm up and I said to Faye White (also a substitute that day), “I dunno if I can do this!” But I was ready.\n“Every single player and every single performance in that team was top class. It was made for us that day. I will never forget it - it’s one of the best memories of my life and I don’t think I’ve ever matched it. We had a point to prove and we knew it was a big statement.\n“We felt it was time for Arsenal to get what they deserved.”\nDavison was the last outfield player of that 2007 team to retire (only substitute goalkeeper Becky Spencer is still playing) and had spells at Liverpool, where she won two further WSL titles, Chelsea, Reading, Spurs and Aston Villa before finishing where it had all started at Watford.\nDavison played for as long as her body allowed and went straight into coaching upon retirement. Her desire for football has never dimmed but she says her focus altered in recent years.\n“I’ve always loved football; my mindset has shifted now. Being around the players I was around at Arsenal, Vic was big on looking after you, Emma Hayes was massive in my career.\n“Then I played with Rachel Yankey, Jayne Ludlow, Kelly Smith, Emma Byrne – every player in that team went above and beyond to help you.\n“I had a good family around me too and my big lesson at Arsenal was that you have to give to others if you want to win. So now it is my turn to give back - and I love doing that.”\nCopyright 2026 The Arsenal Football Club Limited. Permission to use quotations from this article is granted subject to appropriate credit being given to www.arsenal.com as the source.",
  "word_count": 1865,
  "scraped_at": "2026-02-14T12:23:37.391382"
}