{
  "article_id": "d2eff15b4840",
  "url": "https://www.newcastleherald.com.au/story/8323836/a-long-time-coming-as-magic-book-nplw-grand-final-appearance/",
  "title": "Broadmeadow advance to NPLW NNSW grand final | Newcastle Herald",
  "date": "20230825T140000Z",
  "domain": "newcastleherald.com.au",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Broadmeadow are the first team through to NPLW Northern NSW grand final after beating Newcastle Olympic 3-1 in the qualifying semi-final at Magic Park on Friday night.\nSubscribe now for unlimited access.\nor signup to continue reading\nMagic have been a top-two side since returning to Northern NSW Football's premier women's competition in 2020 but until now had not won a finals match.\n\"It feels like it was a long time coming and we've finally done it,\" a thrilled Broadmeadow captain Kalista Hunter said.\n\"We've just been so much more consistent and we've had a lot more depth this year.\"\nThis season's premiers largely dominated the first half and held a 1-0 lead at the break after Chelsea Lucas had scored with a leaping header at the front post off a corner in the 15th minute.\nMagic goalkeeper Alison Logue was rarely called to action in the opening 45 minutes but stood tall when she was, repelling Elodie Dagg's on-target shot in the 30th minute.\nThe second half was more even, and full of action and controversy.\nMarion Dunbabin looked to have found an equaliser with a header in the 50th minute only to be ruled off side.\nOlympic goalkeeper Claire Coelho, who was treated on field in the opening minutes for a shoulder injury, tipped Adriana Konjarski's long-range free kick over the bar one minute later then Magic's Lucy Jerram hit the post in the 71st minute.\nBut the hosts went 2-0 up in the 76th minute when Kiarra Lewis buried a penalty into the top right corner on her second attempt. The first also went in but had to be retaken after a Magic player had stepped into the area before the ball was kicked.\nThe penalty was controversially given after Olympic's Alesha Clifford appeared to get the ball before felling Lucas in the 18-yard box.\nOlympic coach Neil Owens was shown a yellow card after questioning the decision and was clearly frustrated by the outcome.\n\"It's disappointing when you put in a bit of effort then disallowed goal, penalty ... but that's just football,\" Owens said post-match.\n\"We were half asleep on the first goal. Our start was a little bit slow. We built into the second half of the game and there wasn't much in it, once we started settling down.\n\"But then [after the penalty] we were just chasing the game. But it is what it is.\"\nOlympic were awarded a penalty of their own in the 82nd minute when fullback Jemma Lawson clipped Dagg in Magic's penalty area.\nDagg stepped up to slot the spot kick and close the gap to 2-1.\nThings got tense as Olympic lifted.\nLogue denied midfielder Sophie Walmsley from close range in the 86th minute before Jerram sealed the 3-1 scoreline and an elusive grand final berth on September 10 at Magic Park with a stoppage time goal on the counter-attack.\nMagic will have next weekend off while Olympic play the winner of Saturday's elimination semi-final between Maitland and Charlestown Azzurri for another shot at making the championship decider.",
  "word_count": 510,
  "scraped_at": "2026-02-14T12:56:11.152728"
}