{
  "article_id": "d31c7c1ae3a1",
  "url": "https://www.the42.ie/norway-switzerland-6750927-Jul2025/",
  "title": "Swiss roll spoiled in four minutes on dramatic opening night of Euro 2025",
  "date": "20250703T014500Z",
  "domain": "the42.ie",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "SWITZERLAND’S PARTY WAS spoiled in four second-half minutes, Norway turning a thrilling game on its head — and the drama didn’t stop there on opening night at Euro 2025.\nDay One had just about everything: an upset, a red card, an own goal, a penalty missed, another overturned, VAR drama, great goals . . . Group A delivered.\nNorway and Finland are celebrating, the hosts and Iceland left bitterly disappointed.\nWith temperatures still 28 degrees at the final whistle in Basel, Pia Sundhage and her players circled the pitch, wondering how they hadn’t taken something from a historic encounter.\nNorway will have felt a huge weight off their shoulders after coming from behind to salvage a winning start — this was their first time to beat the hosts at five consecutive major tournaments — but plenty of question marks remain.\nThey have a wealth of talent, though have been unconvincing through the years.\nThat said, they got the job done. By hook or by crook.\nAtmosphere had been building in sweltering Switzerland all day, as they prepared for their first major tournament since co-hosting Euro 2008.\nIn Basel, the green man on the traffic lights was changed to a woman kicking a football.\nIn honor of the 2025 Euros, Basel, Switzerland has changed the men in the traffic lights to female football players, and we are OBSESSED with it🚦🇨🇭\n— The Women's Game (@WomensGameMIB) July 2, 2025\n🎥: @lionel_pittet pic.twitter.com/p7NfFX49KT\nSt Jakob-Park turned red for the de facto opener; Finland and Iceland got the tournament underway 125km south in Thun three hours earlier.\nThe pageantry that goes with these things was embraced by the 34,063 fans present, predominantly natives. After a colourful opening ceremony, Swiss players smiled through their national anthem on an emotional occasion.\nThey then brought the fight through an end-to-end opening, feeding off the energy of the lively home crowd. Noelle Maritz’s superb last-ditch tackle on Ada Hegerberg captured their hunger in a snapshot.\nAs captain Lia Wälti pulled the strings around the middle, they began to find their range. Géraldine Reuteler came closest before the breakthrough arrived in the 28th minute, rattling the crossbar.\nLeft wing-back Nadine Riesen was the early hero with just her second international goal; she was sent on her way by Arsenal’s Wälti and ran at the Norwegians, before slipping Smilla Vallotto in. The ball spat back out after a scramble in the box, and Riesen’s first-time finish kissed the inside of the post, before nestling in the opposite side of the net.\nEvery Swiss player celebrated arms outstretched, the TV cameras flashed to a delighted Sundhage, who was winning the tactical battle so far.\nBut Norway — seven places superior in the Fifa world rankings in 16th — awoke from their slumber, and an open game sparked to life further in the second half.\nWithin four minutes, from the 54th to the 58th, Switzerland’s dream turned into a nightmare of sorts. The Swiss roll stalled. Much more drama would follow.\nAn unmarked Hegerberg leaped highest to head home Vilde Bøe Risa’s corner and bag her 50th international goal.\nThen, Julia Stierli turned the ball into her own net, botching a clearance after a cross from the electric Caroline Graham Hansen, and the pendulum swung.\nBig saves, and penalty melodrama, then ensued at either end.\nAfter a baffling Reuteler handball, 2018 Ballon d’Or winner Hegerberg dragged her spot kick wide.\nA boost for Switzerland, and almost another immediately: the referee pointed to the 13-yard mark after Mathilde Harviken put a hand on Riesen , but VAR overturned for offside in the build-up.\nThe Swiss threw the kitchen sink at it; Reuteler blazing over one-on-one, before more goalmouth drama.\nBut ultimately, Norway prevailed. Ecstasy to agony for the hosts, party mode turned sombre at the finish, though they will take huge encouragement in hindsight.\nEarlier, in a much cooler Thun, Finland enjoyed an upset win over 10-player Iceland.\nIt was the Finns’ first Euros victory in 16 years — and a deserved one for the lowest-ranked side in Group A. (And third lowest of the tournament, 26th ahead of just Poland and Wales.)\nTheir celebrations, in front of 7,683 fans at the foot of the Alps, showed just how much it meant.\nKatariina Kosola proved the matchwinner in the 70th minute, having threatened all evening down the left. The Malmö wide player cut in and let fly to score the first goal of the tournament:\nLatest: Iceland 0-1 Finland\n— RTÉ Sport (@RTEsport) July 2, 2025\nKatariina Kosola has scored the first goal of #Euro2025 with this superb strike for the Finns @WEURO2025 @rte2 @rteplayer\n📺 Watch live - https://t.co/XnOP6grnB7 #euro2025 pic.twitter.com/Pum4YvhQ13\nThe red card was 12 minutes earlier, Hildur Antonsdóttir given her marching orders for a second booking. Iceland might feel it was a harsh decision, but they were poor overall.\n12 ranking places superior and firm favourites, they looked disjointed throughout, offering little in attack bar the long throw-in of Sveindís Jónsdóttir. The loss of injured captain Glódís Viggósdóttir at half time was a blow, encapsulating a disappointing night overall.\nWhile the first game didn’t compare to the second, the result set the tone for three and a half weeks of thrills and spills.\nIt will have also been a painful reminder of what could have been for Ireland, watching from home.\nIreland beat Finland twice in 2023 World Cup qualifying, and are ranked a place higher. They won 2-1 in Helsinki and 1-0 in Tallaght, where Lily Agg’s header ultimately secured a playoff place.\nThe Girls In Green went on to beat Scotland at Hampden Park to qualify for their first major tournament, and incidentally, Finland overcame the Scots to reach this one.\nWales crushed Ireland’s Euros dream last December, and now relish the underdogs tag in the Group of Death, Group D. They make their finals debut against Netherlands on Saturday, with defending champions England and France going head to head in a blockbuster afterwards.\nBut first, Day Two: Belgium, Ireland’s Nations League playoff rivals in October, face Italy, before World Cup champions Spain open their bid against Portugal.\nBuckle up, if tonight is anything to go by.",
  "word_count": 1029,
  "scraped_at": "2026-02-14T12:20:35.663683"
}