{
  "article_id": "d33ade98ef6f",
  "url": "https://greatbendpost.com/posts/56e4a10e-1303-49f8-b6a9-9222a5b087c2",
  "title": "Monday Sports Headlines and Scores presented by Barton Community College",
  "date": "20251229T180000Z",
  "domain": "greatbendpost.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "The Patriots became the fourth team to clinch a division title, the Browns kept the Ravens alive and the 49ers moved closer toward a No. 1 seed. There’s plenty left to be settled before the NFL’s playoff schedule is set. Twelve of the 14 playoff berths have been secured and four teams are battling for the final two spots. Both No. 1 seeds are up for grabs and there could be two winner-take-all games in Week 18. New England routed the Jets 42-10 on Sunday, and clinched the AFC East title when the Bills lost to the Eagles. The Patriots completed a worst-to-first turnaround under first-year coach Mike Vrabel.\nSANTA CLARA, Calif. (AP) — Brock Purdy threw a 38-yard touchdown pass to Jauan Jennings with 2:15 to play, and the San Francisco 49ers forced an incomplete pass on the final play from the 2 to beat the Chicago Bears 42-38 and set up a Week 18 showdown for the top seed in the NFC. Caleb Williams drove the Bears down the field in the closing seconds and had one last shot for the win. But Bryce Huff forced him out of the pocket and his throw short-hopped Jahdae Walker in the end zone to seal a sixth straight victory for the 49ers. San Francisco can secure the top seed by beating Seattle on Saturday night.\nINDIANAPOLIS (AP) — Philip Rivers knows he may have made the last start of his improbable comeback. Rivers ended a five-year retirement to rejoin the quarterback-needy Indianapolis Colts at age 44. But he couldn't stop the Colts' losing streak. Although he gave the Colts a chance to win two out of his three games, he went 0-3 as a starter. With one meaningless game left, the Colts may turn to Anthony Richardson or rookie Riley Leonard as the starter. Rivers says even if he had known the outcome, he'd do it again. He says it was “an absolute blast” to play what he called “three more bonus games.”\nORCHARD PARK, N.Y. (AP) — Josh Allen sailed a 2-point conversion attempt wide of open receiver Khalil Shakir in the back of the end zone with 5 seconds remaining, and the Philadelphia Eagles hung on for a 13-12 win over the Buffalo Bills. Dallas Goedert caught a 1-yard touchdown pass, Jake Elliott hit field goals of 28 and 47 yards, and the Super Bowl champion Eagles barely avoided squandering a 13-0 fourth-quarter lead. Linebacker Jalyx Hunt had two of Philadelphia’s four sacks. Allen scored on a tush push on fourth-and-goal to pull the Bills within one point with 5 seconds remaining. Buffalo went for 2 and the win but Allen couldn't connect with Shakir.\nINGLEWOOD, Calif. (AP) — With a franchise scoring record there for the taking, Kawhi Leonard elected to take a pass in order to be fresh for another day. Team-oriented to the core, Leonard scored a career-high 55 points to push the Los Angeles Clippers to a 112-99 victory over the Detroit Pistons on Sunday night. The Clippers are now on a season-best four-game winning streak and a recent scoring burst from Leonard is the primary reason. Leonard was closing in on the franchise record but decided to keep his fourth-quarter floor time to six minutes and departed with just under a minute remaining. He now shares the team mark for points in a game with teammate James Harden.\nNEW YORK (AP) — New Orleans Pelicans guard Jose Alvarado has been suspended two games and Phoenix Suns center Mark Williams has been suspended one game for their roles in a fight during the third quarter of Saturday night’s game. The NBA announced the suspensions, that come without pay, on Sunday. Alvarado will miss Monday night’s home game against the New York Knicks and Wednesday night’s game at the Chicago Bulls. Williams will miss Monday night’s game at the Washington Wizards. Both players were ejected following the incident.\nSEMMERING, Austria (AP) — Mikaela Shiffrin has come from behind to win a World Cup night slalom in tough conditions and extend her winning streak in the discipline to six races. The American was fourth, more than half a second off the pace in the opening run on a rapidly deteriorating course. But she posted the fastest time in the evening to beat first-run leader Camille Rast. The world champion from Switzerland finished 0.09 seconds behind. Italian-born prodigy Lara Colturi was 0.57 back in third. Colturi competes for Albania.\nORLANDO, Fla. (AP) — Kyle Whittingham was barely two weeks into retirement after 21 years at Utah when he found an offer he couldn't turn down. Whittingham is the new head coach at Michigan. It's a proud program in disarray after the firing of Sherrone Moore for an extramarital relationship with a staffer. Michigan also was punished for a sign-stealing scandal. Whittingham says that didn't deter him from what he calls one of the best jobs in the country. He says the players are solid and the issues will work themselves out. Whittingham says he brings a style of play familiar to Michigan.\nDUBAI, United Arab Emirates (AP) — Nick Kyrgios has won the latest version of the “Battle of the Sexes” in tennis. He beat top-ranked women’s player Aryna Sabalenka 6-3, 6-3 in an exhibition match that represented light entertainment rather than another landmark moment for gender equality. There was laughing and joking between the players, some under-arm serves, over-the-top grunting on shots, and even some dancing from Sabalenka during a timeout to entertain the crowd at the 17,000-seat Coca-Cola Arena in Dubai. The “Battle of the Sexes” name was borrowed from the 1973 match between Billie Jean King and Bobby Riggs, which King won in straight sets. That took place amid King’s efforts to start a female tour and get equal pay in tennis.\nCOLUMBIA, S.C. (AP) — Tessa Johnson and Madina Okot each scored 18 points to lead third-ranked South Carolina over Providence 96-55, but the Gamecocks also lost guard Ta’Niya Latson to injury. Latson, South Carolina’s second-leading scorer who led the country in points per game last season, left in the second quarter after injuring her lower left leg at Colonial Life Arena. She was helped off the court with no weight on the foot. Coach Dawn Staley had no immediate update after the game. The Gamecocks (13-1) out-scored the Friars (8-6) on a day where their defense wasn’t great but they had more than enough points to win.\nFinals\nNATIONAL HOCKEY LEAGUE\nFinal Columbus 4 N-Y Islanders 2\nFinal SO Tampa Bay 5 Montreal 4\nFinal Pittsburgh 7 Chicago 3\nFinal OT Detroit 3 Toronto 2\nFinal Seattle 4 Philadelphia 1\nNATIONAL FOOTBALL LEAGUE\nFinal Cincinnati 37 Arizona 14\nFinal Cleveland 13 Pittsburgh 6\nFinal Jacksonville 23 Indianapolis 17\nFinal Miami 20 Tampa Bay 17\nFinal New England 42 N-Y Jets 10\nFinal New Orleans 34 Tennessee 26\nFinal Seattle 27 Carolina 10\nFinal N-Y Giants 34 Las Vegas 10\nFinal Philadelphia 13 Buffalo 12\nFinal San Francisco 42 Chicago 38\nTOP-25 COLLEGE BASKETBALL\nFinal (7)Gonzaga 96 Pepperdine 56\nFinal (15)Texas Tech 87 Winthrop 57",
  "word_count": 1182,
  "scraped_at": "2026-02-14T12:44:43.906885"
}