{
  "article_id": "d33bbf0ed94c",
  "url": "https://www.aol.co.uk/atrocities-mount-daily-promised-aid-050009270.html",
  "title": "Atrocities mount daily . Promised aid does not arrive . Why has the west turned its back on Sudan ? ",
  "date": "20250323T060000Z",
  "domain": "aol.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Atrocities mount daily. Promised aid does not arrive. Why has the west turned its back on Sudan?\nA friend had gone missing. Nothing unusual in Sudan’s ruinous war, but Hitham Mohund knew it was vital to act quickly. However, in an abandoned home near the Nile River he stopped searching after making a grisly discovery: wedged inside a bathroom were three bodies. Hands tied, eyes staring upwards.\n“They were shot in the chest,” said the 28-year-old, as he walked towards Maigoma Street, a dusty thoroughfare in north Khartoum, Sudan’s capital.\nIt had been less than 24 hours since Mohund had found the bodies and his friend’s whereabouts were still unknown. Around him, shoppers were chatting, some were even dancing, as the street staged its first Friday market for nearly two years, since the civil war erupted between the Sudanese army and the paramilitary Rapid Support Forces (RSF).\nThree days earlier, the RSF had finally been pushed out of the Maigoma neighbourhood by the Sudanese army, and residents were in the mood to celebrate.\nBut even now, safety was an illusion. A shell suddenly exploded on the street. Black smoke belched across the market. Moments later a donkey pulled a cart into the thoroughfare, carrying a wounded man lying face down.\n“There was another random shelling yesterday,” Mohund said, as the smoke cleared. “A home was hit.”\nThe house belonged to the Mohammeds. At 7pm the day before, the family were preparing “mullah”, the main meal of the day. Awadin Mohammed was especially excited. Schools were starting to reopen. She remembers nothing of the moment an RSF projectile fell from the dark sky, flattening her home.\nDr Ahmed Ibrahim, senior consultant at Omdurman’s teaching hospital, recalls the 10-year-old arriving. “She had been hit with shrapnel and was bleeding heavily.”\nNormally a child arrives escorted by anguished family. Awadin had no one. The hospital director, Prof Abdul Moneim, said that initially they waited for a relative. Still, no one came. So they began operating. A shard of metal 10cm square was removed from her colon.\nNo one turned up for Awadin. Her entire family – mother, father, brother and sister – were found dead in the rubble of their home.\n“I miss my mother so much, my father,” she says, blinking back tears from her hospital bed. She wonders if anyone will adopt her. “I want this to stop.”\nBut no one seems able to stop the slaughter. Hours after the Mohammeds were killed, Sudan’s unrelenting conflict claimed more people from Maigoma Street.\nThe injured man on the cart died halfway to hospital, bleeding out on the five-mile journey.\nOther tragedies on Maigoma Street are less clear cut. The three bodies Mohund found have, at the time of writing, still not been identified. His friend remains missing.\nThe dead, bound by a single street on a single day, are a microcosm of Sudan’s agony, replicated countless times during this war.\nIn an era of rolling crises, Sudan stands supreme. By some margin it is the world’s largest, most devastating humanitarian catastrophe. Every metric confirms it is worsening. Thirty million Sudanese need aid to survive; half of them are children. Fighting has precipitated the worst famines in decades. Atrocities mount daily. More than 12 million Sudanese are at risk of sexual violence.\nSuch statistics are not cutting through. As Africa’s third-largest country implodes, the west looks away. “International donors are fiddling as Sudan burns,” says a senior UN official.\nThis is not donor apathy, but a tale of outrageous chicanery; of high-profile global announcements that were always untrue. At least £500m promised by the west 12 months ago to help Sudan cope with its suffering has not been paid.\nLike Awadin, Sudan is waiting for an intervention that might never happen.\nAmong the shattered remains of central Khartoum North is a modernist house with a blue-tiled swimming pool, a throwback to when the middle classes thronged to one of Africa’s leading centres of commerce and culture. The imposing three-storey property belongs to Abdelrahim Hamdan Dagalo, second in command of the RSF. Last month the Guardian was allowed inside his home.\nAt the time, television screens across Africa carried footage of a beaming Dagalo 1,050 miles (1,700km) away in Nairobi as he announced a breakaway Sudanese government.\nHe may have presented himself as the consummate politician, but Dagalo was sanctioned for commanding soldiers responsible for the “massacre of civilians, ethnic killings, and use of sexual violence”.\nInside his home was evidence of a cosseted life: a sophisticated gym, designer furniture. In the kitchen, cans of whipped cream, a tub of Maxtella chocolate spread, luxuries in a country where more than 26 million face acute hunger. There were clues also as to the central driver of Sudan’s conflict – gold. Display cases for gold jewellery lined the master bedroom. Dagalo and his brother, Mohamed Hamdan Dagalo – known as Hemedti – built their army on the proceeds of the precious metal, which is found across Sudan.\nElsewhere in the dining room: three immaculate copies of a local newspaper, dated October 2022, months before the civil war erupted. Its front page read: “No disagreement with Burhan: Hemedti.” The headline was wrong. Relations between rival generals Abdel Fattah al-Burhan, head of Sudan’s military, and Hemedti were beyond tense.\nSix months later, gunfire reverberated in central Khartoum. Within days, hundreds lay dead on its streets. Hastily, the UK and US embassy evacuated staff. More than two years later there is no sign either country will reopen their diplomatic missions, even in Port Sudan, which has escaped the fighting. “Once the UK packed its bags it never really looked back,” says a senior diplomat.\nYet much was expected of Britain. Not only Sudan’s former colonial power but, as penholder of the UN security council on the country, it was responsible for galvanising the international response. “On the most fundamental issue – protecting civilians – the UK has failed abysmally,” said a Sudanese aid official. Both warring sides have committed myriad crimes against humanity: repeated, deliberate attacks against its people. Eleven million people have fled their homes, the world’s biggest displacement crisis. At least 200,000 are dead.\nAsked to sum up UK leadership on Sudan, one official answers: “Total bollocks.” Pinned to David Lammy’s X account is the message: “We must not forget Sudan.” Some wonder if it is a reminder to himself. The UK’s foreign secretary has yet to visit Sudan. No date is in the diary. Of 38 Foreign Office ministerial trips abroad during the first three months of the Labour government, none chose to witness the world’s most pressing humanitarian crisis.\nSudan’s military-led government – increasingly confident of outright victory after Friday’s symbolic seizure of Khartoum’s presidential palace from the RSF – feels abandoned by Britain. During last month’s Munich Security Conference, Sudan’s foreign minister attempted repeatedly and unsuccessfully to meet Lammy. “Why won’t the UK engage?” asked a source.\nSections of Sudanese civil society feel similarly spurned. One group approached Lammy’s office to discuss human rights abuses. They never heard back.\nDisquiet simmers over the UK’s reluctance to follow the US and accuse the RSF of genocide. “It’s confusing. The UK receives the same intelligence as the US,” says another diplomat.\nFive days after Awadin’s home was flattened, senior RSF officials were allegedly spotted in the UK parliament. “How did it happen?” says Abdallah Abugarda, head of a Sudanese diaspora group. He is among those who believe the answer lies with the provenance of the gold found in Dagalo’s bedroom. Their display cases indicate it came from the UAE, where practically all most of Sudan’s gold is exported.\nIn return for this gold, the UAE is accused of backing the RSF, sending it state-of-the-art drones and weaponry. At the same time, the UK is attempting to seduce the UAE for investment. Lammy describes the Emirates as “central to driving [UK] economic growth”.\nSome wonder if the UK is compromised. Has the UK, they ask, put its economic needs above helping Sudan? “Any discussion about the UK’s approach to Sudan cannot ignore its relationship with the UAE,” says a senior diplomat, requesting anonymity.\nCertainly the UK has not been sluggish to court the UAE, owner of the world’s biggest sovereign wealth fund. Lammy chose to visit Abu Dhabi before Ukraine. His first call to an Arab official was to his UAE counterpart.\nUK officials would not say if Lammy ever asked the UAE to stop arming the RSF. Unlike with the Sudanese, sources describe “constant chatter” between the UK and Emirati officials. .\nThroughout Sudan’s war, the UK has remained a steadfast arms supplier to the UAE while receiving intelligence indicating that the Emiratis, in turn, have armed the RSF. In 2023 the UK government licensed £56.4m of arms exports to the UAE, more than the development funding it gave to Sudan last year. In the first nine months of 2024 another £19m was licensed, roughly the amount Lammy recently announced to help Sudanese refugees.\nThe UK government says Lammy is “committed to pushing for peace in Sudan” while it pursues “all diplomatic avenues” to end the war.\nAcross the Atlantic, efforts to help Sudan have drained away. The US has dismissed its special envoy with no plans to rehire. Troy Fitrell, lead state department official for Africa, has yet to mention Sudan.\nThe abrupt dismantling of USAid has wiped out its coveted Sudan specialists. “The USAid experts on Sudan are gone, so too the state department experts. It has been gutted,” says a source.\nUS pressure on the Emirates to cease supplying the RSF appears to have waned. A UAE official denied “providing any support or supplies” to the paramilitary group.\nAmerica’s disengagement from Sudan has left the UK with even greater responsibility. Expectation is mounting before a London conference on 15 April – the war’s second anniversary – that aims to “end the conflict”. The event is already mired in controversy. Of 20 foreign ministers invited, Sudan’s was not among them. Relations with Sudanese officials deteriorated further on 7 March when they learned the UK had invited the UAE.\nA day earlier Sudan launched proceedings against the UAE over its support for the RSF.\nAbugarda adds: “The UK is putting economic interests ahead of human rights. So much for British values.”\nThe hospital that saved Awadin Mohammed is symptomatic of a country in freefall. A former RSF command centre, its troops stole everything. Even a collection of broken walking frames was looted. The hospital also mirrors the world’s reaction to Sudan’s suffering.\nEight months after the RSF fled, its staff still wait for assistance. Requests for equipment and funding have proved fruitless. “We have received no help from the international community,” says Moneim.\nThe hospital director, like most Sudanese people, had no idea that the same community had promised his country £515m a year ago – a promise that wasn’t upheld.\nLast week, Moneim sent a dizzying list of what the hospital needs to function, from life-saving drugs to stethoscopes. Two thousand patients visit his hospital weekly. Amputations are commonplace due to the shelling. Most patients, though, are dying from malnutrition.\nKhartoum’s residents drink from leaky water pipes. Food is scarce. One stall was seen offering a solitary bag of onions. A boy was killed last week over a falafel sandwich.\nAt least five children a day are dying in the city of malnutrition, according to Hanin Ahmed, a volunteer at Khartoum’s community kitchen network. Ahmed’s emergency response rooms, which have been nominated for a Nobel peace prize, have kept millions of destitute Sudanese people alive. But aid cuts mean they are vanishing. Just 220 out of 800 across Sudan remain. More shut daily. There is $200,000 (£155,000) to share among those still functioning: enough to run operations for several days. “It’s shameful that the international community cannot help more,” says Ahmed.\nShe laments that the UK is still not engaging, or funding her community kitchens. Without direct funding it takes six weeks for cash to reach them.\n“We are losing the ability – and hope – to assist,” she says, gasping as a report from colleagues comes in. A mother of five has been raped in south Khartoum. As she reported the crime to medics, the RSF perpetrator attacked her again.\n“He threatened to kill her and her children. She needs evacuating to a safe area.” But Ahmed has no money to help. The mother is trapped.\nThings will deteriorate. Western nations are scaling back foreign aid. Five days after Awadin arrived at hospital, Keir Starmer announced swingeing cuts to Britain’s aid budget. The decision made humanitarians reeling from the derailment of USAid despair. During a recent closed UK parliamentary meeting, UN agencies demanded – without success – to know how much funding would remain for Sudan. One aired concerns it may have to suspend operations. A crucial scheme safeguarding displaced people could, it feared, fold in two weeks.\nWith a quarter of the year gone, the UN’s collective humanitarian response for Sudan has reached just 6.63%, a shortfall of $3.9bn. Multimillion-pound projects have not received a penny. “It’s beyond terrifying,” says a Sudanese UN official. The pooled Sudan fund is also struggling. Last year it granted Sudan $183m, with the UK to contribute almost a third. So far it has amassed $15.9m. The UK is yet to give anything.\nPerhaps the greatest indictment of the international community’s approach to Sudan was seen at a high-profile Paris conference a year ago. Before the world’s media, donors lavishly pledged more than €2bn (£1.68bn) for Sudan. Documents show the UK pledged £87m. When asked if it was ever paid, Foreign Office officials refused to answer. By far the largest amount offered at the conference – a quarter of the total – was a massive $555m pledged by the World Bank, a transformative sum in light of the USAID cuts. Not a penny was paid.\nA World Bank source said there had been a misunderstanding: it had not pledged any extra cash at the conference. Instead, it was talking about existing World Bank programmes in Sudan. These amount to $383.9m.\nHowever, a year on from the Paris conference, its official website still states that the World Bank had “announced” $555m for Sudan.\n***\nThey were closing in on her. In truth, it was far from a fair race. Heavily pregnant, she could hardly run. Amira knew what the RSF soldiers would do if they caught her. Everyone knew that the RSF raped women wherever they wanted.\nEarly afternoon, last July, Amira turned off Alshaheeda Nada Street and hid down a side alley. There, her waters broke. She gave birth but passed out, her newborn left lying on the ground.\nTousif Osman found Amira, not her real name, just in time. A large stray dog had eaten the placenta and had turned its attention to the newborn.\n“They were in danger. I pushed the dog away and ran to get help.” The mother was taken to the same Omdurman hospital where, seven months later, orphan Awadin would arrive.\nOsman never learned what happened to the mother: people vanish all the time in wartime.\nFresh accounts of life in Sudan’s capital under RSF occupation confirm a hellish existence. There was no sanitation, no streetlights, no power, no phone or internet connectivity: people could only wonder if the rest of Sudan was engulfed in chaos.\nThe RSF ruled through arbitrary violence. “When you heard their motorbikes you moved away. If you walked too close they beat you. No eye contact. Ever,” says Malik Award Siddig.\nOnly a few people stayed in Maigoma, largely those who couldn’t escape: Osman’s father was disabled.\nWithin days of the RSF occupying Maigoma in April 2023, Osman sent his sister away from the capital. Accounts indicate the RSF began raping women the moment they arrived.\nAhmed Abdelraman, 27, witnessed at least 10 women raped in Alshaheeda Nada Street. “Many more in other streets.”\nPeople were abducted from their homes. Mechanics and doctors were the first to be kidnapped, says Abdelraman.\nOthers were executed. Snipers killed for kicks. Mustafa Ibrahim, pointing east towards Haj Yusuf, says a toddler was shot. People, he says, became too scared to retrieve bodies. Corpses piled up on certain corners.\nSome people stopped leaving their houses, preferring not to eat. All lived in fear of a knock on the door. Of about 30 people in Maigioma interviewed by the Observer, all said their homes were looted by RSF gunmen.\nResistance meant likely death. Mohammad Khalil ran a jewellery shop on Alshaheeda Nada Street. The RSF demanded it, but the 37-year-old refused. “He had worked all his life to build his shops,” says best friend Mussi Mohammed.\nThen the RSF threatened to kill Khalil’s wife and children, so he sent them away. Last summer gunmen burst into the shopkeeper’s home. Khalil appears to have run on to the roof where, cornered, he was killed.\nMohammed found his body hanging from the top of the building. Dried blood is still visible on the wall.\nRSF brutality was not confined to Khartoum’s residents. New testimony offers a rare insight into how the militia also treated their own.\nEnlisted at the pinnacle of the RSF’s power – January 2024 – recruits reveal how the group exploited young men from neighbouring countries.\nSome were later press-ganged into battle with no weapon. Others were given two days’ training.\nDubbed “mercenaries” by the Sudanese military – all have been detained in a military prison in Omdurman for the past year. Their families have no idea if they are even alive. All were promised a generous salary but none received a penny.\nHassan Mohammed was playing football with friends one evening before Christmas 2023 in Abéché, Chad, when RSF fighters approached them with promises of payment. All 57 footballers joined the war.\n“They took us into Sudan straight away. We never informed our parents,” said Mohammed, who looked no older than 14.\nSent to Sudan’s national broadcast headquarters in Omdurman in January 2024, Mohammed was locked inside the top floor. Rations consisted of one portion of stale bread a day.\nA Sudanese army offensive soon recaptured the headquarters. “By then all the commanders had left.” He witnessed four of his friends from Abéché die.\nThe cowardice of their commanders was a recurrent theme. Ateir Lonjar, 25, from Abyei in South Sudan, was charged with defending eastern Omdurman.\nAs night fell on 12 March 2024, he witnessed the entire RSF command sailing across the Nile to safety in Khartoum. “They left us to die. I wasn’t even given a gun.”\nThe ethnic hierarchy of the RSF was also evident. Anyone from Darfur’s Rizeigat tribe was, said Lonjar, allowed to cross the river. “Other tribes had to stay,” said Lonjar, a Dinka.\nOther RSF soldiers confirm a two-tier system with troops from Darfur given the best food and accommodation.\nMakuach Achoul, 22, from Aweil, South Sudan, said: “They call themselves the ‘RSF proper’, they don’t mix with us.” Achoul was abducted from a Khartoum charcoal factory last year and forced to fight for the RSF. “My family will think I’m dead.”\n***\nIt was the first Friday prayers since the war began. Inside Khartoum’s al-Noor mosque, six Sudanese army troops knelt, AK-47s laid beside them. No one led the weekly Jum’ah. Al-Noor’s imam had been killed and his successor had not appeared, perhaps concerned the area was unsafe.\nThe mosque caretaker, Al Mogtba Obeid, had turned up, but wished he hadn’t. “They’ve even stripped the carpet. What a mess.”\nHe could say the same for his country.\nAwadin’s future, like that of Sudan itself, is uncertain. As it became clear that no extended family was coming to take her in, one of the hospital nurses, Roaa Yoosif, stepped up.\n“My mother will take care of her for now. But maybe, one day, someone will turn up and offer a new beginning.”",
  "word_count": 3320,
  "scraped_at": "2026-02-14T14:15:16.661928"
}