{
  "article_id": "d341c01a0fae",
  "url": "https://www.jamaicaobserver.com/latest-news/ssl-saga-history-making-reggae-girlz-shocking-murder-observer-onlines-10-biggest-local-stories-of-2023/",
  "title": "SSL saga , history - making Reggae Girlz , shocking murder … Observer Online 10 biggest local stories of 2023",
  "date": "20231229T193000Z",
  "domain": "jamaicaobserver.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "SSL saga, history-making Reggae Girlz, shocking murder… Observer Online’s 10 biggest local stories of 2023\nFrom the gruesome murder of the 10-month-old daughter of a veteran Member of Parliament along with her 27-year-old mother that shocked the nation, to the multi-billion dollar SSL fraud that ensnared Olympic icon Usain Bolt and over 200 others, 2023 proved to be another roller coaster of a year for news in Jamaica.\nThrow in the ‘Wild Wild West’-type attacks on courier company Beryllium, the standoff between the Government and the Integrity Commission after the prime minister was cited for possible conflict of interest, add the euphoric highs that came with the Reggae Girlz’ historic run at the FIFA Women’s World Cup, and the news during the year under review was pulsating to say the least.\nSee below Observer Online’s 10 biggest local stories of 2023:\nThe multi-billion dollar SSL fraud that keeps unraveling\nIn what has emerged as the biggest fraud in Jamaica’s history, private securities dealer, Stocks and Securities Limited (SSL) found itself at the centre of a multi-billion dollar scandal that has ensnared over 200 clients, including Olympic icon Usain Bolt, who lost more than US$12 billion or nearly J$2 billion.\nBolt appears to be the SSL client hardest hit, as while initial estimates had placed the fraud in the region of J$3 billion affecting between 30 and 40 clients, shortly after it was uncovered in January, that figure had ballooned to US$30 million or J$4 billion and involving over 200 clients domiciled in Jamaica and overseas by December, as reported by the Financial Investigation Division (FID).\nYet, despite the ballooning fraud, and the expansive investigation involving the FID, Fraud Squad, the United States’ Federal Bureau of Investigations (FBI), a UK-based forensic firm and other agencies, just one individual, former wealth advisor Jean-Ann Panton, has been charged. Panton confessed to stealing from clients’ accounts and has been charged with three counts of larceny as a servant, five counts of forgery, five counts of uttering forged documents, three counts of engaging in transaction involving criminal property, and three counts of breaching the Cybercrimes Act. Her case is currently before the Home Circuit Court.\nEffective January 17, the Financial Services Commission (FSC), which has oversight of the financial sector, appointed business recovery expert Kenneth Tomlinson as the temporary manager at SSL.\nAround the same time, the legal team representing Bolt gave SSL 10 days to return his missing funds or face criminal and civil action. The invested sum was reportedly towards Bolt’s “self-designed pension”.\nIn a letter to SSL dated January 16, the law firm of Frater, Binns and Gordon told SSL that Bolt’s account contained in excess of US$12 million (J$1.8 billion) as at October 31, 2022. However, according to the letter, only US$12,000 (J$1.8 million) remained.\nOn February 1, the SSL Board broke its silence with its directors denying that they were attempting to wind up the company in contravention of instructions by the FSC. They also denied being aware of alleged fraudulent activities by Panton.\nThe directors also said that there had been no ‘run’ on the entity and “the vast majority of clients have not been affected by fraud”.\nOn March 6, Finance Minister Dr Nigel Clarke signed an agreement with Kroll Associates UK under which the company would assist local law enforcement agencies with their probe of the multi-billion fraud.\n“Kroll will bring to the table technology and expertise that will enable the investigators to unravel every aspect of this fraud,” Clarke said in a short ceremony at his office in Kingston.\nHe pointed out that Kroll Associates is “a subsidiary of Kroll International, a firm known for their forensic auditing experience and expertise”.\nIn January, Clarke had announced the Government’s intention to engage international forensic auditors as well as the FBI to help unravel the fraud which spanned more than a decade.\nAccording to a statement issued by the FID in early December, further investigations into the SSL fraud had revealed that more than 200 accounts were affected, surpassing US$30 million in fraud and other irregularities, with inquiries extending beyond Jamaica.\nThe FID said that despite numerous appeals and direct means of communication, it had only received 23 official statements from affected individuals and entities.\nThere was a development in the case on December 7 that set tongues wagging after it was revealed that several laptops were stolen from the SSL’s Hope Road offices.\nShocking murder of Paulwell’s daughter and child’s mother\nDespite the regularity with which brutal murders occur in Jamaica, there are some killings that leave the nation collectively numb by their sheer callousness.\nThe murder of the 10-month-old Sarayah Paulwell, the daughter of the longstanding Member of Parliament for East Kingston and Port Royal, Phillip Paulwell, and her 27-year-old mother, Toshyna Patterson in September, was one of those occasions. Their killings left the nation stunned!\nIt was even more shocking when the murder plot was revealed and the unmasked alleged mastermind turned out to be another of Paulwell’s ‘baby mothers’ – United States Navy Culinary Specialist Seaman Leoda Bradshaw. The 34-year-old shares a young daughter with Paulwell.\nSarayah and her mother were kidnapped from their Gilmore Drive, Kingston 20 home on September 9, and taken to a location in East Kingston where they were shot and their bodies burnt.\nFor her alleged part in the kidnapping and murder conspiracy, Bradshaw is charged with two counts of conspiracy to kidnap, two counts of conspiracy to murder, two counts of kidnapping, and two counts of capital murder.\nHer cousin, Roland Balfour, whose help she allegedly sought to execute the plot was charged with two counts of accessory before the fact to kidnapping and two counts of accessory before the fact to murder. Bradshaw, who describes herself as Paulwell’s spouse, reportedly offered $500,000 for the hit job on which prosecutors said she made a down payment of $100,000.\nBradshaw, her cousin and two other men were initially charged, however, on November 15, two of the men, who were not named for security reasons, pleaded guilty to their roles in the murder-kidnapping conspiracy. One man was sentenced to 30 years imprisonment having pleaded guilty to two counts of murder. He also pleaded guilty to two counts of kidnapping and was sentenced to one year and 10 months at hard labour. The sentences will run concurrently and he must serve 20 years before becoming eligible for parole.\nThe second man who pleaded guilty for his part in the conspiracy was sentenced to seven years and 10 months behind bars. He was sentenced on the charge of being an accessory before the fact.\nAfter the police confirmed that Sarayah and her mother had been murdered, Paulwell issued a statement in which he said his heart was “heavy with sadness”. He expressed that he wanted those responsible to be “punished to the fullest extent of the law”.\nReggae Girlz’ historic run at FIFA World Cup brought joy to a proud nation\nDespite a lack of funding and their on-again off-again dispute with the Jamaica Football Federation (JFF) over pay, the Reggae Girlz, Jamaica’s senior national women’s football team, created history when they reached the last 16 of the FIFA Women’s World Cup this past summer.\nAlong the way to the last 16, the Girlz held football powerhouses France and Brazil to 0-0 draws and got by Panama 1-nil. Their 0-0 draw with Brazil effectively knocked the South Americans out of the tournament as the Brazilians needed a win to advance.\nWhat was remarkable about the historic run by the Reggae Girlz was that they were appearing at only their second World Cup after France in 2019. During the 2019 World Cup they went winless in three group games, conceding 12 goals. In the 2023 tournament held in New Zealand and Australia, the Reggae Girlz conceded just one goal, when they lost 1-nil to Colombia in the Round of 16.\nThe Jamaicans also became the first women’s team from the Caribbean to win a match at the tournament when they defeated Panama 1-0.\nWhile their coach Lorne Davidson and the JFF parted ways in September after they did not agree terms, Donaldson in December was named the new head coach of the Chicago Red Stars.\nArmoured courier Beryllium became a target for robbers\nA disturbing trend emerged in 2023 when gunmen started targeting trucks belonging to courier company Beryllium Limited with deadly consequences.\nBy the end of the year, at least one security guard was shot dead, and several others shot and injured, while at least one gunman was shot and killed and several injured as the security guards fought back. Millions of dollars were stolen and the public confidence in the ability of the security forces to maintain law and order was shaken.\nIn response, the police high command in early May announced that it had put together a special team of highly experienced and trained detectives to carry out investigations into the attacks on the Beryllium vehicles. However, the attacks would continue.\nAt the time of the announcement, there had been four attacks on the security firm’s personnel in Portmore in St Catherine, St Elizabeth, and St Thomas. Head of the Jamaica Constabulary Force’s Crime and Security Portfolio, Deputy Commissioner of Police Fitz Bailey, who made the announcement of the investigative team, acknowledged the impact that the robberies have had on public confidence in the police’s ability to maintain law and order and assured that the police would be assisting Beryllium in carrying out its tasks.\nOne of the deadliest attacks took place on February 27 at the Portmore Pines plaza in St Catherine, when brazen gunmen absconded with almost $10 million in cash after gunning down a security guard and injuring two others, in an audacious mid-Sunday morning robbery that shocked bystanders.\nOn August 25, gunshots rang out in the heart of Mandeville, Manchester during a major robbery in the vicinity of the Scotiabank branch on Ward Avenue in the town.\nGunmen toting high-powered rifles attacked a Beryllium security team during a cash delivery at the bank.\nOne of the guards challenged the attackers, but the security team eventually retreated and the gunmen managed to grab two of the bags containing cash, escaping in a Mark X motorcar.\nWhile the police initially said three people were shot, it was later discovered that five persons, all innocent bystanders, had in fact been shot and injured. They included one individual who was inside the bank and another who was waiting to use the ATM machine.\nThe exact amount of cash that the gunmen escaped with was not disclosed.\nIn the wake of the repeated attacks on the courier companies, financial institutions warned customers that they could be inconvenienced and said some ATM locations could be closed. In fact, customers have been inconvenienced with many complaining that ATM machines are often out of cash or otherwise malfunctioning.\nCrab Circle closed over filthy affair\nThe stomach-churning action of one vendor who was caught on video wiping herself, after defecating inside her stall, before nonchalantly dropping the tissue at her feet, resulted in a near two-month closure of the popular street side eatery, Crab Circle, located at National Heroes Circle.\nAfter the video went viral with Jamaicans at home and in the diaspora expressing their disgust at the vendor’s action, the police, on the advice of the Kingston and St Andrew Public Health Department, moved in and closed the facility on October 5.\nThe offending vendor, Alice Waugh, who was one of the most popular vendors at Crab Circle, was banned from the facility after the location was reopened in late November, the vendors having undergone mandatory training. Additionally, bathroom facilities were constructed for both vendors and members of the public ahead of the reopening.\nWhile public health officials noted that Waugh’s action could have resulted in some foodborne illness, she became the butt (No pun intended) of memes on social media with many people dismissing her claim of having a sudden bout of diarrhea, hence her reason for relieving herself inside the very stall from which she sold food.\nSince its reopening, Crab Circle is yet to see the crowds it experienced daily before the Alice Waugh debacle.\nMassive salary increase for politicians\nThe massive salary increases announced in May by Finance and Public Service Minister Dr Nigel Clarke for public sector workers and the political directorate, resulted in sustained criticism of the Andrew Holness-led Government.\nEven the usually smooth-talking Clarke had trouble, during an appearance on TVJ’s All Angles, justifying the level of increases to Jamaica’s politicians when several Caribbean countries in better financial standing are paying their politicians far less.\nIn the wake of the criticism, the prime minister took a decision to forego the increase which, if he had taken it, would have seen his salary balloon to $28 million per annum.\nFor his part, Opposition leader Mark Golding called a press conference to announce that he would be donating most of his salary increase to charitable causes.\nHe told a press conference that he was aware that he was the only opposition member in the House of Representatives being paid at the senior executive leadership level.\nAs Opposition leader, Golding is paid at the same level as the deputy prime minister. Both will take home $25.7 million beginning April 2024.\nGolding said he would only keep the equivalent of a 20 per cent increase, which is in line with what most members of the public sector received.\n“As leader of the Opposition, I must lead by example in a time like this. I will therefore redirect the bulk of the 240-plus per cent increase in my pay and retain 20 per cent of that increase…. I intend to do this until the outstanding grouses affecting the public sector workers arising out of the restructuring have been satisfactorily addressed,” he said.\nThe increases will see Members of Parliament taking home $14.2 million, effective next April.\nOf note is that the senior leadership across the public sector to include the police, doctors, nurses and teachers also benefitted from massive increases in their salaries.\nOpposition takes court action over Government’s decision to extend retirement age for the DPP\nOn August 8, the Opposition People’s National Party filed a lawsuit challenging the Government’s amendment to the Constitution which increased the retirement age of the office holders of the director of public prosecutions (DPP) and auditor general (AuG).\nOpposition leader Mark Golding had threatened to take legal action after the Government, with its super majority in the House of Representatives, had two weeks earlier rammed through the amendments despite strenuous objections by Opposition Members of Parliament.\nThe bill, which was tabled by Justice Minister Delroy Chuck, was tabled and debated the same day. Golding argued that such a constitution required that he be first consulted in his capacity as Opposition leader.\nThe amendments facilitated the change in retirement age for the DPP and AuG from 60 to 65 years.\nThe amendment means that DPP Paula Llewellyn, whose time in office was to have ended in September, received an extension for at least two more years. She could, in effect, remain in office until she is 70 as she could be given a further five-year extension.\nThe DPP has now been given a second extension; she previously received a three-year extension in 2020 when she turned 60. AuG Pamela Monroe Ellis, who could also benefit from the amendment, is in her early fifties.\nGolding has argued that the way the Government approached the matter could undermine confidence in the Office of the DPP, and suggested that the independence of the office could be questioned.\nCabinet Minister Robert Morgan has accused the Opposition of pursuing a personal vendetta against Llewellyn.\n39 years for Klansman gang leader Andre ‘Blackman’ Bryan as long-running trial ends\nThe long-running Klansman trial which commenced in September 2021 in the Supreme Court, came to an end on October 2 when gang leader, Andre ‘Blackman’ Bryan, was sentenced to 39 and a half years by presiding judge, Chief Justice Bryan Sykes.\nBryan’s sentencing was briefly halted due to reported stomach-related issues, during which he kept his head down and even burped at one point.\nBefore Bryan’s sentencing, another gang member, Tomrick Taylor, received a nine-and-a-half-year sentence. Taylor’s sentence was reduced from an initial 17 years, considering he had already served five years and received a two-year discount due to having no previous convictions.\nEarlier, the lone female defendant, Stephanie Cole-Christie, aka ‘Mumma’, who was convicted for being a member of a criminal organisation, was sentenced to nine years and 10 months behind bars.\nThe notorious Klansman gang’s bloody rein in St Catherine have left hundreds dead as gang members battle each other for extortion spoils in and around the bus park.\nAfter a split in the gang, one faction was led by Bryan while the other was reportedly led by Tesha Miller who himself is serving a 38-year sentence.\nThe trial began in September 2021 with 33 defendants, including Bryan.\nIn the final verdict delivered in March 2023, Bryan, aged 38, and 14 others, were convicted of various charges to include murder, arson and membership in a criminal organisation.\nHylton, Cohen out at NCB, agree multi-billion dollar separation package\nWhen the CEO of NCB Financial Group Patrick Hylton and his former Deputy, Dennis Cohen, were sent on leave on July 16, a tremor was felt in Jamaican financial circles. The men had spent 20 years at the bank, moving profits from $2.5 billion annually into the stratosphere while extending NCB’s footprints into at least 20 countries.\nThey were later separated from the bank in November by its billionaire chairman Michael Lee-Chin who cited the need for new leadership and a different direction.\nWhile things were initially tense between Hylton and Cohen on one hand, and Lee Chin on the other, including when the former employees demanded nearly $14 billion in compensation, all three men shook hands in November in a settlement estimated at between $6 billion and $7 billion.\nThe figures are estimates calculated by the Jamaica Observer from the company’s financials.\nThey had demanded $13.8 billion that they said they were due after surrendering shares of that value in 2021 to the company. A dispute ensued over the compensation, which ultimately led to the two men being separated from NCB Financial Group officially on November 13 after being on leave for four months from July 16. It is estimated that Hylton received approximately 60 per cent of the settlement while Cohen walked away with the other 40 per cent.\nBoth men, along with the NCB Financial Group Chairman Michael Lee Chin, have also buried the hatchet that led to the disagreement. They sat with the Business Observer for an exclusive interview to show Jamaica that despite the events of the previous four months, all parties are satisfied and ready to move on.\nStandoff between Gov’t, Integrity Commission after Holness cited for possible conflict of interest\nIt was politics on display in February when all 13 Government senators closed ranks behind Prime Minister Andrew Holness as they called for the sacking of Executive Director of the Integrity Commission (IC), Greg Christie, ostensibly over what they deemed the IC’s handling of a damning report on perceived actions by Holness.\nThe senators accused Christie of presiding over the “unjust treatment” of the tabling of the report related to contracts during the time when Holness was education and youth minister in Bruce Golding’s administration.\nThe senators collectively blamed Christie for “unjust treatment” in relation to the belated publication of the connected ruling by the director of corruption prosecution, which exonerated Holness of any wrongdoing in the awarding of contracts to Westcon Construction Limited, whose principals Holness has been closely associated with.\nAfter coming under relentless criticism for its delay in tabling the connected report, the IC, in a statement said: “It is worth repeating and stressing that publication of the ruling could not be done before or simultaneously with the report. It had to await the tabling of the report. That is the law as crafted by Parliament”.\nThe IC also stated that Christie “has no control over the content of an investigation report or a ruling”.\nThe IC had recommended that the prime minister be referred to its director of corruption prosecution for possible further action in a case involving the award of millions of dollars in Government contracts to Westcon Construction, citing a possible conflict of interest.\nHolness, in his initial response said he “strongly rejects” some of the commission’s findings and had referred the matter to his lawyers.\n“I strongly reject any suggestion or insinuation of wrongdoing and I will do all in my power to ensure that the truth is known,” he remarked.\nThe investigation commenced with the then Office of the Contractor General (OCG), which has since been subsumed in the IC. Two state agencies, the National Works Agency (NWA) and the Social Development Commission (SDC), have also been implicated in the IC report.\nThe company in question – Westcon Construction Limited – received contracts totalling more than $21 million between 2006 and 2009, which overlaps with the period when Holness served as the minister of education, youth and information.",
  "word_count": 3538,
  "scraped_at": "2026-02-14T12:05:24.805286"
}