{
  "article_id": "d37a47c053fd",
  "url": "https://www.afl.com.au/aflw/news/1158149/new-west-coast-eagles-recruit-jess-hosking-on-move-west-career-fears-life-without-twin-sister-sarah",
  "title": "  Havent stopped smiling : New West Coast Eagles recruit Jess Hosking on move west , life without twin sister Sarah",
  "date": "20240627T080000Z",
  "domain": "afl.com.au",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "JESS Hosking has been a fixture of the NAB AFLW competition since its very first days.\nBut at the end of last season, she was forced to confront her own football mortality.\nDelisted by Richmond, the 28-year-old had a brief period of football homelessness, before West Coast offered a lifeline as a delisted free agent signing.\n\"Honestly, I probably wasn't in a great head space coming off the back of injuries, and at the time, probably wasn't expecting it,\" Hosking told AFL.com.au.\n\"Obviously no one likes to be delisted. But on another side, I guess it triggered something in my head. It was probably the first time I thought about not playing footy, or if [there was a chance] I wasn't ever going to play footy again.\n\"And then I guess, in hindsight, it's triggered a thought that if I did get an opportunity then I'll give it everything I've got, and if someone's willing to take me on, that was the kind of mindset I was going in with.\"\nHosking's Richmond career finished in round three, suffering a syndesmosis injury which required surgery. She's now completed her rehabilitation, having taken part in West Coast's scratch matches against Gold Coast and Fremantle in May.\n\"There were thoughts of not playing footy again, and obviously, after an injury, you can think pretty negatively in those head spaces, but to be able to turn around and to have this pre pre-season block of [scratch matches] and the enjoyment and the fun that I'm having with this group, it would have been a shame if I ever did decide to stop,\" Hosking said.\n\"I'm honestly one of the happiest I've ever been playing footy or in a footy environment, and that's a testament to the players, the staff and I guess the club as a whole at West Coast.\n\"Since I walked through the doors, I haven't stopped smiling, and the connection piece feels really strong here. So yeah, I'm honestly extremely happy at the moment.\"\nHosking has landed on her feet in the west, living with West Coast men's player development manager Drew Petrie, his wife Nic, and three children Jack, Abby and Ruby.\nShe has a small previous connection with the Eagles head of women's football, Michelle Cowan, who coached Hosking in the midfielder's first women's exhibition match, playing for Melbourne against Brisbane in 2016.\n\"I had the conversations with Jordy (Loxley, list manager) and Dais (Pearce, coach), and was super honest and open about where my head was at with footy. Like I said before, if they were to take the opportunity of me coming over, I would give it everything, and I was willing to move,\" she said.\n\"I think I've said for the last 10-15 years that I've always wanted to leave Melbourne for winter, but never could because of sport. So to have the opportunity and ability to do it for sport was pretty exciting.\n\"I don't know if I'm babysitting (the Petries) or leading them astray, but lots of activities and I think that's part of this WA lifestyle of getting out and about with the kids, doing some fishing and surfing and just enjoying some downtime in that pre pre-season period.\"\nHosking is near-impossibly close with twin sister Sarah, who still plays for Richmond. The pair have still never been apart for longer than three-and-a-half weeks in their 28 years, a mark that is set to be broken as pre-season gets underway in earnest before the pair clash in round one.\n\"We've pretty much spoken every day. Because I'm in a new environment, I'm consistently saying how happy I am, and how amazing everything is over here – obviously, the weather's a big one, but the activities and everything that I'm doing,\" Hosking said.\n\"Whereas she's stuck in kind of the same environment, and Melbourne's getting a bit colder and more miserable, I think she's feeling it a bit more.\n\"It's a weird feeling. I'll wake up in the morning and I'm top of the world, feeling happy, then something won't feel quite right. I'll check in, and she'll say she's had a shocker morning and she's been crying for 10 minutes. It's a weird kind of twin telepathy thing.\"\nWest Coast currently has the youngest squad on average (22.9), excluding inactive players, although that number could shift when it signs its replacement player for the pregnant Dana Hooker.\n\"I think we've got so much talent coming in. And the one thing that I've realised, is all the girls are sponges. We had one praccy match against Freo where we probably got sucked into a lot of stuff on contests and all that. We spent one week working on it, and the following week came out and absolutely blitzed what we had worked on,\" Hosking said.\n\"As a whole, this team has grown ridiculously from what they were last year, and have been able to add in in certain areas maybe what they were lacking. I think I've really realised in my first week I got called Mum and Nanna, so I think I finally realised I'm that older player, but I weirdly liked it.\n\"I think the girls that they've brought in, including 'Drenno' (Ali Drennan) and even Roxy (Roux, ex-Fremantle).\n\"She's back on track and she's thriving in this environment. I had a conversation with her the other day, and she's happy and loving being around this group. She said she feels that connection. I think it's going to hit a point where it will be hard to crack into the team, because I think we've got a fair bit of depth in areas.\"",
  "word_count": 941,
  "scraped_at": "2026-02-14T13:30:04.325260"
}