{
  "article_id": "d3f0223d7345",
  "url": "https://thestandard.org.nz/luxon-slumps-in-latest-colmar-brunton-poll/",
  "title": "Luxon slumps in latest Colmar Brunton poll",
  "date": "20230313T074500Z",
  "domain": "thestandard.org.nz",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Written By:\n- Date published:\n6:18 pm, March 13th, 2023 - 57 comments\nCategories: act, chris hipkins, Christopher Luxon, greens, labour, maori party, national, Politics, polls, uncategorized -\nTags: act, election 2023, greens, labour, national, polls\nThe latest One News Kantar Poll result has been released and it is a doozie.\nLabour is down slightly from 38% to 36% which is not great … but …\nNational is down 3% from 37% to 34% which is not good for them but …\nAct is up 1% to 11% and the Greens are up 4% to 11%.\nIt is still neck and neck. But the polls have tipped to the left. With the Maori Party there is now a way for the left to retain power.\nBut the headline is that Chris Luxon’s polling has plunged.\nPreferred prime minister rankings will be disappointing for National’s Luxon, who plunged to 17%, a 5% drop on the last 1News Kantar Public poll.\nTo add insult to injury, Labour Party leader Chris Hipkins picked up almost all of those points, rising to 27%, a 4% jump on his previous result.\nAct Party leader David Seymour is steady on 6%, New Zealand First leader Winston Peters is up 1% to 3%, and some still hung on to former prime minister Jacinda Ardern, with the Mt Albert MP on 2%, down 3% on the last poll,\nNational must be wondering what to do with Christopher Luxon. As leader it is clear that he is not up to scratch, people do not like him and do not trust him.\nThe interesting dynamic is the surge to the left and to the right minor parties. Clearly the electorate is becoming increasingly polarised.\nStand by it is going to be a hell of a year …\n- Comments are now closed\n-\nWith the Maori Party there is now a way for the west to retain power.\n? 😉\n[Oops I meant left!. Will correct – MS!]\n-\nThank goodness the National Party has no understanding of the blindingly, toe-curlingly obvious … and it's been obvious for many months:\n.https://thestandard.org.nz/open-mike-26-07-2022/#comment-1902150\n“I think it’s highly likely Luxon will be replaced before the election. Sure, people can say “no, not another change”, but it would be a worse mistake to persist with somebody so ill-suited for the job, so out of his depth.”\n(see dozens of similar comments, not just from me but by anyone who's … awake?).\nTo repeat my earlier prediction: Nicola by May.\n-\n-\nMe too; and Judarth before him. If only Judarth were still at the helm, instead of being just the Nats spokesperson for Science Innovation and Technology, Foreign Direct Investment, Land Information, and Digitising Government.\n-\n-\n-\n-\nphallus head may need a little Blue pill to resurrect his electable dysfunction\n-\n-\nInteresting – if (and, like all polls, it's a big 'if') this was to be the result after election day, and if (not such a big if) Te Pāti Māori at least held on to Waiariki, then might it give the redneck NAct MPs and their campaign managers pause for thought? Time will tell.\nNew ACT Party policy branded 'divisive' and 'bigoted' by Māori Party\n[24 March 2022]In New Zealand, Māori co-governance is already underway – referendum or not [23 April 2022]]\nGreens pull Three Waters support, citing lack of protection against privatisation [8 December 2022]\nThe political debate National and Labour can’t agree on [6 February 2023]\nLabour and National’s leaders came to Waitangi agreed on which areas need more investment in election year. But as political editor Jo Moir writes, the country is going to see a big debate on how Māori should benefit from it -\nThe person with some explaining to do is Farrar. The Roy Morgan had the Greens on 12% and this one has them on 11%. Farrar's Curia poll of a few days ago has them dropping to under 6%.\nMy impression is that Morgan usually has the Greens too high, but Farrah has got the Greens’ direction of travel completely wrong. The charitable interpretation is that Farrar's poll is a rogue or it has a methodological error of some sort. Other, less charitable, explanations are also possible.\n-\n\"Other, less charitable, explanations are also possible.\" I would bet on that.\n-\nI have done one of those surveys. The questions are loaded and difficult not to answer in favour of the right.\nit takes a bit of thinking to understand the question’s and not give the answer thats wanted.\ntaxpayer Curia polls are a fucking rort.\n-\nI have been to the same movie as you with Curia. You say \"it takes a bit of thinking to understand the questions and not give the answer that's wanted.\"\nI distinctly remember thinking (and wanting to say) \"You can't ask me that, like that. it's not scientific.\"\n-\nIf that's true, Peter (and I'm not saying it's not), David Farrar had best be careful. It's only a matter of time before they inavertantly phone a journalist who realises there's a story in this.\nAotearoa is a small place and damned hard to keep political secrets hidden.\n-\n-\n-\nFarrar always has an agenda. His Green poll numbers will have been doctored to give the media the headline \"Greens close to crashing out\" which RNZ was dumb enough to use in its bulletins on the Farrar poll.\nMeanwhile Farrar made comments on RNZ's The Panel (see my post a few days ago) supporting the Israeli law changes that emasculate the Israeli Supreme Court and bolster the current right-wing extremist government. These changes have led to some of the biggest protests ever seen in Israel-Farrar was spectacularly wrong again…or is he in the pocket of the Zionists?.\nhttps://www.bbc.com/news/world-middle-east-64929563\n-\n-\nInteresting. I think we should be told.\nSurely Farrar reads TS?\n-\n-\n-\n-\ntoo me, the big take is the rise in the green vote. the changing climate is going to be the big factor in the election, as pretty much everybody(even maureen) now realise the obvious, and most kiwis are thinking green. even the rednecks. water quality and the threat of privatisation has also made many think green. bad health and bad weather turns everybody socialist.\n-\nBy that polling, not counting whatever rump is in Labour, that’s 48% of the country for doing nothing about climate change.\nAnd the current PM has just canceled parts of the successful clean car scheme and other things, so it is difficult to call Labour votes pro-climate action votes.\nSo we’ve whittled down our climate response to will we follow the ACT line and leave everyone affected to the mercy of the insurance companies or after each event, will we continue trying to throw whatever cash can be freed up at the problem?\nOur biggest ever cyclone and rain fall and the result is about 4% for the Greens, maybe.\nWhat a waste that 100% pure branding was! 100% equity loss, 100% road closures…we’ll give a couple of bucks to an appeal, but stop driving an urban tank or even mildly support cyclists or find a farming leader who’ll tell farmers they should be part of the solution…\nThat’s some sad polling.\n-\nIt's not that bad. The same poll shows climate change as issue no. 2 for voters (cost of living is top, as expected). So it's above e.g. crime, despite all the negative headlines.\n-\nBut what does climate change as an issue mean here?\nThere’s a huge difference between will I get bailed out if trouble hits which is a massive climate change concern, to will I support expensive (but comparatively cheap) infrastructure and lifestyle changes necessary to reduce the future impact of climate change. We’re not remotely on track to meet our obligations climate wise.\n-\n-\n-\nI know that National has dropped a bit. But would Labour really be that happy about the result? After all, they have had a popular change of leader, and all the media attention with the recent flooding etc. So, maybe they would have been looking for more of a gap than that. Because it is still very close with the election quite awhile away.\n-\n-\nThe next real leader of the National party has not landed yet…….\n-\n-\nThe Bene Tleilaxu always struggled with eyes – I'm sure the vats are brimming with promising new gholas already.\n-\n-\n-\nChriscialus Luxon is suffering from premature electoral popularity now his peak popularity has past. National may have to abort this leader and find another who is not a christian brother.National voters may vote Labour again to keep the greens and the Maori party out in the cold.\n-\n-\n-\nLuxon tries for gravitas, trips over himself, and comes off as a snoozey bore.\n-\nThe disingenuous way Luxon reined in the fing useless Maureen Pugh made him look like a complete tool.\n-\n-\nJust had a look at the trends for the 2020 election as a comparison (https://en.wikipedia.org/wiki/Opinion_polling_for_the_2020_New_Zealand_general_election)\nAround this time in 2020, Simon Bridges was still leader and the Nats replaced him with Muller in May. Muller was replaced by Collins in July but in hindsight that was because of Muller's health issues. But, it shows they would be prepared to do a leadership switch even as close to election date as May – June, if it made sense. But, who would they replace Luxon with? My guess would be Paul Goldsmith, but Michael Woodhouse is the Shadow Leader. Or, they could try to take advantage of Jacinda being replaced by a male and put up Nicola Willis as an attempt at a Jacinda-style leadership.\nI still think, however, that National's biggest hurdle is its behind-the-throne leadership. In my opinion, ever since Simon Bridges, each National leader has reflected more the ageing-boomer image than someone who will enter parliament after election night, roll up their sleeves and get things done for the people of this country. I've suggested before that Luxon seems to be trying to appeal to National party leadership than the swinging voters. If National's leadership replace Luxon with another person who continues that trait, they might as well keep Luxon.\nBut all is not roses for the left. At this time in the last election cycle, Jacinda was above 40% popularity and it just went up from there. It looks good for Hipkins, but we are still far off another result like in 2020.\n-\nThey should replace Luxon of course, but it's not just who, it's how.\n2017 worked for the (then) opposition because Little chose to quit. 2020 didn't work because Bridges was knifed. Party united vs party divided, total contrast.\nWillis will probably oust Luxon, but it would be far better for National if Luxon \"did an Andrew Little\". Given all we know about his inflated self-regard, not much chance of that.\n-\nyes, luxon is only there because he was promised leadership .\n-\nObserver your \"…doing an Andrew Little\" comment made me laugh. Before Andrew Little, we boys' school pupils were brought up on the phrase \"…doing a Captain Oates\", in reference to Scott's ill-fated 1912 south pole expedition.\nWe were encouraged to learn from his brave sacrifice that was the only possible chance his companions had of survival. In adulthood, however, we learn that he was so riddled with frostbite he must have known death was not far away and he probably did what he did just to rid himself of a painful end.\nIt made me imagine the National Party caucus inside their tent as the blizzard of unpopularity rages outside, their icy, frostbitten fingers clutching the latest Colmar Brunton poll that points to their inability to reach election base camp and to their being doomed to endure the frosty poll results until their final, misty breaths. Somewhere in the corner (yes, I know its a circular tent) kneels Judith Collins, deep in prayer, just in case TV1 is nearby.\nSuddenly, Captain Luxon stands up and opens the tent flap \"I am going outside\" he says \"And I may be some time\"…\n-\nGreat extended image, Thinker.\nI thought yesterday of the remaining National caucus members who, facing the prospect of another three years outside the tent in the blizzard eating corned beef and biscuit whilst looking in at the feasting, slink away to their places under post-political corporate board tables and gnaw on the bones tossed to them.\n-\n\"I am going outside\" he says \"And I may be some time\"\nI wouldn't expect such spare, clean language from Mr Luxon. Something more like this perhaps:\n\"Hey look, what I'm saying is that all the indicators are going in the wrong direction, we need to power up our strategic thinking and deliver. We need to rationalise our human resources in line with weather conditions and future high-probability scenarios so that we are all delivering value in ways that are aligned to the vision we have for hard-working polar explorers keeping more of their own lives and getting ahead. As a former CEO I am unequalled in my humility concerning the superiority of my talent for making hard decisions, cutting out waste and delivering. I am optimising the value chain by shrinking it across multiple cost-time dimensions operationally. This takes effect – immediately. Goodbye.\"\n-\nBrilliant, AB. Can you do the accent as well?\n-\n-\n-\nThe anointed one [1 December 2021]\nThere's a new face at the head of the National Party – but he's the fifth new face since John Key resigned five years ago. Is his the one that will stick?During that time [as CEO of Air NZ] he [Luxon] formed a relationship with John Key.\nLuxon had Sir John in his camp for this leadership bid and was guiding him, and although Key wouldn’t have been working the phones, he didn’t need to – party members knew.\nBacking a losing flag is one thing, but to oust Luxon would be to admit Sir John backed the wrong man, and that's gonna hurt at least some of the party faithful.\n-\n-\n-\n-\nNational must be wondering what to do with Christopher Luxon. As leader it is clear that he is not up to scratch, people do not like him and do not trust him.\nFor god sakes, let's do everything in our power to keep him in place!\nOur last undercover operative, JC, was uncovered and dumped! Let's not repeat that mistake.\nSimply put, Luxon is our best chance to keep Nats/ACT out of power. Let's not stuff this one up.\n-\nDisagree.\nIf I was a one-man selection panel, I'd replace the Luxon-Willis ticket with Sam Uffindell and Maureen Pugh.\n-\n+100\nThe fucking useless perverts. As described by their own. Perfect.\n-\n+100 from me. perfect combination. covers all the nat fan groups.\n-\nNo, I rather fancy the Nataliban: Simeon Brown and Chris Penk!\n-\n“If I was a one-man selection panel, I’d replace the Luxon-Willis ticket with Sam Uffindell and Maureen Pugh.”\nOne can but dream…\n-\n-\nIndeed – the mutter 'Electorate vote National party vote ACT' is growing by the day in Pubs outside the main centres\nThe National Party may not last for much longer at this rate!\n-\n-\n-\n-\n-\nOn the issue of the Greens, it's worth noting that overseas Kiwis casting Special Votes usually favour the Green Party. They almost always gain one MP after \"Specials\" are counted, and National and/or Labour lose one.\nI'd always add an extra percentage point to whatever polling figures show, or on election night.\n-\nKantar/TVNZ really should explain their numbers here. There's a big discrepancy between the party vote total (which gets to 100% once you add in all the 1% parties) and the preferred PM numbers, which leave around 40% unaccounted for. What did those respondents say?\nIt's seriously misleading – unprofessional, even – to eliminate \"don't knows\" on one measure but then include them on the other. Apples and oranges.\n-\n-\n\"33% answered Don’t know if there’s anyone they’d prefer as PM.\"\nDoesn't surprise me.\nHalf of them have probably heard the name \"Chris Hipkins\" for the first time and no nothing about him.\nThe other half fell for the anti-Ardern line and now she's gone they don't know either.\nIt doesn't bode well for Luxon that so many no longer know.\n-\nThe Know Nothing Party\nThe best known of these nativist groups came to be called the American Party, and its adherents as Know-Nothings. The aim of the Know-Nothing movement was to combat foreign influences and to uphold and promote traditional American ways.\nThe no Zealand Party …\nJames Bond’s Epic Battle with Self Doubt and Doctor No\nThey chose to start the film series with the book with the simplest narrative storyline.\n-\n-\n-\n-\nWell, that made Mutch Mckay's eyes pop out, she is finding it increasingly difficult to spin the polls to suit National.\n-\nThere are more MPs lining up to defend Luxon in just one article than there were for Ardern in 5 years.\nUsual rule applies: if you have to keep saying there's no issue with the leadership, there's obviously an issue with the leadership.\n-\nThis is an easy MMP election to call.\nFirst the history\n1996. Winston divides the opposition vote and keep National in power (a good man returns to his roots and then gets shafted and learns his lesson).\n1999. Change after 3 terms.\n2002. The left falls apart and there is Labour coalition with the sensible centre United.\n2005. WP goes with the largest party (Labour 41-39 over National), once again enabling a third term government (as in 1996).\n2008-2014. Change after 3 terms. National is narrowly again and again the only party capable of forming a government (playing off ACT and MP to reduce their influence).\n2017. Change after 3 terms. WP this time gets involved in the formation of a new government (on balance the need for a change to more economic justice for workers and more public funding – such as PGF).\n2020. One party government enabled by centrists to block a Labour-Green coalition. The rejection of NZF resulting in WP determining not to support Labour again.\n2023. The most likely outcome is a minority government.\nWP will not back a NACT coalition. Nor form one with ACT. He is then reduced to supporting National with confidence and supply and leave ACT no option but to do the same.\nSo either this has a majority, or it does not.\nIf not, then Labour can form a minority government with confidence and supply from Green and the MP. This allows the new PM to cast it as him and Luxon, Labour or National. If WP neutralises ACT extremism, Labour will have to be precise as to how a coalition (with Greens and MP) would govern, or operate as a minority government.\n- Comments are now closed",
  "word_count": 3172,
  "scraped_at": "2026-02-14T13:07:51.192912"
}