{
  "article_id": "d3fc3fe2108d",
  "url": "https://punchng.com/falcons-to-play-pre-wafcon-tourney-in-abidjan/",
  "title": "Falcons to play pre - WAFCON tourney in Abidjan",
  "date": "20260128T000000Z",
  "domain": "punchng.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Nigeria’s Super Falcons will begin their build-up to the 2026 Women’s Africa Cup of Nations by competing in a four-nation West African tournament scheduled to hold in Abidjan later this month, PUNCH Sports Extra reports.\nThe team has confirmed participation in the invitational competition, which is organised by the West African Football Union B and will run from February 27 to March 7, 2026 in Ivory Coast.\nThe tournament will feature four teams that have all qualified for WAFCON 2026, with hosts Ivory Coast joined by Nigeria, Ghana and Senegal.\nThe mini-tournament is expected to serve as a final competitive test for the teams, ending just ten days before the start of the WAFCON finals in Morocco.\nThe continental showpiece will be staged from March 17 to April 3, 2026.\nIt is understood that head coach Justine Madugu has already submitted a provisional squad list, which is expected to be released through official channels in the coming days.\nAt WAFCON 2026, Nigeria have been drawn in Group C alongside Zambia, Egypt and debutants Malawi.\nThe meeting with Zambia renews a recent rivalry, following Nigeria’s emphatic 5–0 win over the Copper Queens during last year’s tournament, which ended with a dramatic final victory over Morocco.\nEgypt return to the finals following the expansion of the competition to 16 teams, while Malawi will make their first appearance at the tournament.\nThe 2026 edition will be staged across four venues in Rabat, Casablanca and Fez, with the four semi-finalists securing automatic qualification for the 2027 Women’s World Cup.\nNigeria will head into the WAFCON as the most successful side in history, having lifted the title a record ten times.",
  "word_count": 276,
  "scraped_at": "2026-02-14T12:38:35.668851"
}