{
  "article_id": "d3feac56b08e",
  "url": "https://www.winnipegfreepress.com/uncategorized/2023/12/26/missouris-cody-schrader-goes-from-d-ii-star-to-folk-hero-in-leading-tigers-to-the-cotton-bowl",
  "title": "Missouri Cody Schrader goes from D - II star to folk hero in leading Tigers to the Cotton Bowl – Winnipeg Free Press",
  "date": "20231226T143000Z",
  "domain": "winnipegfreepress.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Missouri’s Cody Schrader goes from D-II star to folk hero in leading Tigers to the Cotton Bowl\nAdvertisement\nCOLUMBIA, Mo. (AP) — There were very few people willing to wager that Missouri would be playing in a New Year's Six bowl game this season.\nRead this article for free:\nor\nAlready have an account? Log in here »\nTo continue reading, please subscribe:\nMonthly Digital Subscription\n$1 per week for 24 weeks*\n- Enjoy unlimited reading on winnipegfreepress.com\n- Read the E-Edition, our digital replica newspaper\n- Access News Break, our award-winning app\n- Play interactive puzzles\n*Billed as $4.00 plus GST every four weeks. After 24 weeks, price increases to the regular rate of $19.95 plus GST every four weeks. Offer available to new and qualified returning subscribers only. Cancel any time.\nMonthly Digital Subscription\n$4.99/week*\n- Enjoy unlimited reading on winnipegfreepress.com\n- Read the E-Edition, our digital replica newspaper\n- Access News Break, our award-winning app\n- Play interactive puzzles\n*Billed as $19.95 plus GST every four weeks. Cancel any time.\nTo continue reading, please subscribe:\nAdd Free Press access to your Brandon Sun subscription for only an additional\n$1 for the first 4 weeks*\n*Your next subscription payment will increase by $1.00 and you will be charged $16.99 plus GST for four weeks. After four weeks, your payment will increase to $23.99 plus GST every four weeks.\nCOLUMBIA, Mo. (AP) — There were very few people willing to wager that Missouri would be playing in a New Year's Six bowl game this season.\nRead unlimited articles for free today:\nor\nAlready have an account? Log in here »\nHey there, time traveller!\nThis article was published 26/12/2023 (781 days ago), so information in it may no longer be current.\nCOLUMBIA, Mo. (AP) — There were very few people willing to wager that Missouri would be playing in a New Year’s Six bowl game this season.\nStill fewer probably bet that Cody Schrader would someday be an All-American running back.\nHe received precisely zero Division I scholarship offers coming out of Lutheran South High School in St. Louis, and wound up at Truman State. The Division II school about a three-hour drive from home is known just as much for its accounting school and renowned women’s swimming and diving program as it is for the Bulldogs football team.\nSchrader never stopped believing in his ability, though. After leading Division II with 2,074 yards rushing two years ago, he bet on himself by entering the transfer portal, and ultimately agreeing to an invitation to walk on at Missouri.\nTigers coach Eli Drinkwitz never met Schrader until he stepped on campus.\nTwo years later, Schrader not only has taken over the starting job but etched his name in Missouri lore. He ran for 1,625 yards and 13 touchdowns, highlighted by a record-setting day against Tennessee. He led the Tigers to a 10-2 record and a spot opposite perennial heavyweight Ohio State in the Cotton Bowl on Friday.\n“It’s a dream come true for me and this team,” Schrader admitted.\nThe 5-foot-8 bowling ball of a running back is exactly the kind of dream — the kind of lightning-in-a-bottle success story — that programs such as Missouri rely upon to compete against college football’s powerhouses.\nSure, the Tigers have recruited better under Drinkwitz than they have in years, landing five-star prospects such as Luther Burden III, who was among the nation’s leading receivers this season. They still lag far behind programs such as Alabama, Georgia and, yes, Ohio State, when it comes to reeling in top prospects from high school and the portal.\nYet players such as Schrader, who are willing to work harder and longer and suffer more than most other players, can bridge that gap between good and great. While the Buckeyes have pro prospects galore — wide receivers Marvin Harrison Jr. and Emeka Egbuka, defensive ends J.T. Tuimoloau and Jack Sawyer and defensive tackle Mike Hall Jr. could all be first-round picks in the April draft — the Tigers counter with players every bit as capable who have overachieved to reach that point.\n“I’m sure we’re going to be a big underdog in the game. I’m sure people are going to write us off,” Drinkwitz acknowledged. “I don’t love it but I embrace it if it is what it is.”\nSort of like how Schrader, who won the Burlsworth Trophy awarded to the nation’s top former walk-on, embraced the underdog mentality to rise from Division II afterthought to national sensation.\nDrinkwitz certainly learned his name by the time Schrader methodically passed Stanford transfer Nathaniel Peat on the depth chart last year, helping the Tigers to a 6-6 record and a spot in the Gasparilla Bowl. And the rest of the nation likely learned his name when the Tigers faced Tennessee in a revenge game for a whipping they took last season.\nSchrader piled up 207 yards rushing and 116 yards receiving to become one of 10 players at college football’s highest level to reach 200 and 100 in the same game. He was just the second to do it against a ranked opponent, helping the Tigers to a 36-7 rout of the Vols, and his total yards from scrimmage were just shy of Devin West’s school record.\nThat was part of a stretch of five straight games to finish the regular season in which Schrader topped 100 yards rushing. He had 217 in their finale against border rival Arkansas to help the Tigers clinch a New Year’s Six bowl game, and he will take a nine-game streak of reaching the end zone into the showdown with the Buckeyes.\nIn the Cotton Bowl. At Cowboys Stadium. Before a national TV audience.\nThat’s a long way from the America’s Crossroads Bowl, the annual Division II game that Truman State played in a couple of years ago, when Schrader ran for 219 yards in a win over Hillsdale College at a high school stadium in Hobart, Indiana.\n“It’s extremely special,” Schrader said, “and nobody wanted to be (with the Tigers) on the outside before the season, right? I think this brotherhood, the culture we’ve built with the guys in this room — it’s cool that people might want to transfer here, that other people might want to be a part of it. But my question to a lot of people is: Where were you guys at the start of the year?\n“A lot of people didn’t think we’d make it this far outside of this team,” he added, “but we knew we would.”\n___\nAP college football: https://apnews.com/hub/ap-top-25-college-football-poll and https://apnews.com/hub/college-football",
  "word_count": 1099,
  "scraped_at": "2026-02-14T13:10:09.763338"
}