{
  "article_id": "d403f2427f2a",
  "url": "https://www.nytimes.com/athletic/6923843/2025/12/29/cameroon-etoo-pagou-brys/",
  "title": "Cameroon had a chaotic AFCON build - up , but they have proved they are not to be underestimated",
  "date": "20251229T080000Z",
  "domain": "nytimes.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "When the uncapped Valerenga midfielder Brice Ambina withdrew from the Cameroon squad on the eve of the Africa Cup of Nations, new coach David Pagou responded with a surprise call-up.\nArnold Mael Kamdem, a 25-year-old midfielder, was a vaguely familiar name to Cameroonians, but only those with a decent memory, seeing as he had left the country for a career in Brazil in 2020.\nAdvertisement\nKamdem has since bounced around so many clubs that even the teamsheet from Sunday night’s game against the Ivory Coast was out of date.\nAccording to the records of the Confederation of African Football (CAF), Kamdem was currently playing for a team in the Amazonian basin called Penarol, but on December 8, he joined his 13th Brazilian club. Sixth-tier Sport Sinop are from one of the remotest parts of the Mato Grosso region, close to the Bolivian border.\nPagou knew Kamdem when he was a coach at Renaissance de Ngoumou seven years ago. Around that time, Kamdem was selected for Cameroon’s Under-20 team, where Pagou served as a fitness trainer.\nKamdem did not appear in Marrakech, and he is yet to feature across two games in Morocco, but his presence at AFCON 2025 might, in some ways, come to symbolise the civil war that has ripped through Cameroonian football over the past 18 months.\nThe opposite factions are Fecafoot, the country’s football federation, led by president Samuel Eto’o, and the ministry of sport, who appointed Pagou’s predecessor, Marc Brys, in the summer of 2024.\nThe pair have been openly critical of one another ever since, with the national team setup becoming a battleground for control. November proved to be a key month because after Brys failed to qualify for the 2026 World Cup, Eto’o won another four-year term in his role.\nOn December 1, Fecafoot released an extraordinary statement that announced the sacking of Brys, just two weeks before the squad was due to arrive in Tagazhout near Agadir to begin their preparations for AFCON.\nBrys was accused of 11 “professional failings” that ranged from alleged non-attendance of meetings convened by the federation, to the publication of squads and the organisation of press conferences without prior authorisation.\nThe claims went on and on. Brys was cited for supposedly not complying with marketing schedules, as well as refusing to communicate training programmes and providing reports after international matches. Fecafoot also accused him of the “incitement of defiance” towards the federation through players.\nAdvertisement\nWhen approached by The Athletic at the start of December, Brys stressed that he had not been informed of any decision by the ministry of sport, which he answered to rather than Fecafoot. Brys promptly named his squad, but in the meantime, his replacement, Pagou, provided another list of players, with some notable absentees, including goalkeeper Andre Onana and captain Vincent Aboubakar.\nBrys, 63, did not respond to Fecafoot’s allegations, but admitted he was tired of dealing with Eto’o as well as other members of the organisation.\nEto’o, one of the greatest African centre-forwards of all time following an illustrious playing career that included success with Barcelona and Inter, has emerged as a controversial figure in football administration.\nHe was given a six-month ban from attending national team matches by FIFA for breaching two articles of the governing body’s disciplinary code in 2024. A statement from FIFA said the sanction was related to an Under-20 Women’s World Cup match between Brazil and Cameroon, played in Bogota on September 11 of that year.\nEto’o’s lawyers later successfully quashed that verdict through the Court of Arbitration for Sport (CAS), a decision which allowed him to run for a position on CAF’s executive committee the following month, where he succeeded. Before all of this, Eto’o had claimed he was a victim of a “campaign” by CAF against him, but his opinion within the organisation now clearly matters.\nWhen CAF president Patrice Motsepe announced the “historic” decision that AFCON would be held every four years from 2028 rather than every two before this edition kicked off, he namechecked Eto’o as one of the biggest “supporters” of the ruling.\nAs Eto’o’s power grows and Brys disappears from view, Pagou’s influence is already clear, which is impressive given he has had such little time to work with Cameroon’s players.\nAdvertisement\nThe 56-year-old does not have much of a reputation elsewhere on the continent of Africa, but at home, he is known for setting up a three-man defence and delivering teams that are energetic and aggressive out of possession.\nIn 2020, he led PWD Bamenda to the league title for the first time in the club’s history and followed that achievement with a domestic cup the following year. Cameroonians inside Marrakech’s Grande Stade were quite happy that a local had been entrusted to lead the national team, acknowledging their confidence in Pagou was boosted by a victory over Gabon in his first game.\nThere was a feeling that he might be better equipped to oversee a transition that needs to happen pretty soon, given Brys was still leaning on the experience that helped Cameroon win AFCON eight years ago.\nConsidering the lack of preparation time, the outcome against the holders of the competition and their regional rivals would not be a measure of where Cameroon are at, but a reflection of where they could be.\nA spirit is certainly there because it looked like Ivory Coast might bulldoze past them early in the second half after having a goal ruled out and scoring beautifully through Amad inside a couple of minutes.\nYet Cameroon responded with vigour and though their equaliser came via a big deflection, there can be no surprise that the initial shot was delivered by Junior Tchamadeu, a right wing-back from Stoke City who Pagou positions high.\nIn the meantime, Pagou’s back three became more of a back four depending on the phase of play. One of the markers was a classy 20-year-old, Samuel Kotto, who joined Gent from Malmo last summer. If he carries on playing like this, there will be another move to one of Europe’s top five leagues soon.\nCameroon began the month in crisis, but there was a shade of disappointment with a draw in Marrakech, given the level of performance, and suddenly, they look like a real team, full of hunger.\nAdvertisement\nRecent AFCON history reminds us that anything can happen in this tournament. Ivory Coast, after all, were on the verge of elimination in 2024 and sacked their coach before the group stage schedule was over, but somehow won the whole thing.\nDespite their problems, Cameroon are not to be underestimated. Maybe they can deliver something just as improbable.",
  "word_count": 1107,
  "scraped_at": "2026-02-14T12:53:55.112697"
}