{
  "article_id": "d405511ca609",
  "url": "https://variety.com/2024/tv/news/netflix-nfl-streaming-no-technical-issues-1236259075/",
  "title": "Netflix NFL Streaming Issues ? No Major Reported Technical Snafus",
  "date": "20241225T193000Z",
  "domain": "variety.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "UPDATED: Netflix‘s rookie start as an NFL media partner didn’t draw any yellow flags.\nThe streamer’s first Christmas Day game, Kansas City Chiefs vs. Pittsburgh Steelers, commenced at 1 p.m. ET, following two hours of pregame coverage. Next up was Baltimore Ravens-Houston Texans (starting at 4:30 p.m. ET), with superstar Beyoncé taking the field at halftime to perform songs from “Cowboy Carter.”\nBy all appearances, Netflix delivered the livestreams without any major hiccups. As of 7:30 p.m. ET, there were minimal error reports for Netflix in the U.S. on Downdetector, an uptime-monitoring service. The relatively small number of user-reported problems with Netflix on Dec. 25 (a peak of about 600 as of 1:13 p.m. ET) did not indicate any widespread technical difficulties.\nPopular on Variety\nNetflix execs are surely exhaling in relief. The global streamer’s inaugural flight with the NFL was being closely watched because its previous live sporting event — the Jake Paul-Mike Tyson fight on Nov. 15 — hit technical turbulence.\nAccording to the NFL, users in more than 200 countries tuned in at some point during the Chiefs-Steelers livestream on Dec. 25, and it was the second most popular live event on Netflix to date (after the Paul-Tyson event). Nearly one-third of Netflix’s global concurrent users were watching the Chiefs vs. Steelers game, the NFL said. According to the league, Netflix eclipsed peak concurrent viewers of any NFL Christmas Day game in the past four years.\nIt’s possible that the demand for Paul-Tyson was higher than for the pair of Christmas Day football games. Going into Christmas Day, the four AFC teams competing in Netflix’s doubleheader all had already locked up playoff berths so the outcome of the contests are consequential only for postseason seeding. Meanwhile, ABC and ESPN are presenting five NBA games on Dec. 25 — a 13-hour solid block of sports programming — continuing the NBA’s long-standing Xmas Day tradition.\nEven with the glitches in the Tyson-Paul livestream, the event drew an estimated average minute audience (AMA) of 108 million live viewers globally, which the streamer said made it the “most-streamed global sporting event ever.” The event peaked at 65 million concurrent streams, with 38 million concurrent streams in the U.S. “It’s a Super Bowl-like audience we were able to draw,” Netflix co-CEO Ted Sarandos said at an investment conference this month.\nOn Nov. 15, during portions of the Paul-Tyson event, thousands of Netflix customers took to social media to complain about their video feeds freezing while the livestream was buffering. One disgruntled customer filed a lawsuit filed against Netflix, alleging the event was “unwatchable” because of the technical problems.\nUnder Netflix’s agreement with the NFL, in the U.S., the two games expire three hours after the livestream ends (meaning the Ravens-Texans game, including Beyoncé’s performance, will no longer be available to rewatch on Netflix as of around 11 p.m. ET, while the Chiefs-Steelers will be gone by around 7 p.m. ET). Outside the U.S., the games expire on Netflix 24 hours after the livestream ends. (NFL Network plans to re-air both games on cable.)\nNetflix’s NFL livestreams included ad breaks, even for subscribers on no-ads plans. Naturally, the company used the real estate to promote its own upcoming programming, with promos for “Squid Game” Season 2 (premiering worldwide Dec. 26), “WWE Monday Night Raw” and “Black Doves” as well as trailers for “The Night Agent” S2 and Adam Sandler’s “Happy Gilmore 2.”\nComing up, Netflix has rights to at least one holiday NFL game in 2025 and ’26. Starting in January 2025, Netflix will run WWE’s “Monday Night Raw” live each week under a $5 billion, 10-year pact. Last week, the streamer inked a deal for exclusive U.S. rights to the 2027 and 2031 installments of the FIFA Women’s World Cup.",
  "word_count": 628,
  "scraped_at": "2026-02-14T12:34:00.121752"
}