{
  "article_id": "d40d1c7082ee",
  "url": "https://www.islingtontribune.co.uk/article/in-a-different-league-top-award-as-girls-get-on-the-ball",
  "title": "In a different league ! Top award as girls get on the ball",
  "date": "20231109T213000Z",
  "domain": "islingtontribune.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "In a different league! Top award as girls get on the ball\nHundreds play in the Girls Super League every weekend\nThursday, 9th November 2023 — By Steve Barnett\nClub SFC Under-10s, who enjoyed success at the 2023 Girls Super League summer tournament\nA RAPIDLY growing girls’ football league that encourages young players to pursue their love of the beautiful game was honoured by the London FA at the weekend.\nLaunched in 2021, the Girls Super League (GSL) hosts competitive matches across the capital every weekend with more than 500 players aged between eight and 16 years old taking part.\nFounded by Bloomsbury Football, one of the competition’s top goals is to ensure that clubs with fewer resources or without a home pitch “don’t have to miss out” and can “just show up and play”.\nIn addition to arranging regular fixtures, organisers run educational workshops and fun events, and also showcase the multiple “positive pathways” that are available to young players within the world of football, including refereeing and coaching courses.\nThe team effort displayed both on and off the pitch to get more girls involved in football was recognised over the weekend when the GSL was announced as winners of the London FA’s 2023 Grassroots League of the Year award.\nMaya Williamson, who manages the league, described the acknowledgement as “a very proud moment” for all those involved.\nShe added: “It’s a recognition of the hard work that has gone into building a league that addresses the barriers that girls face in accessing competitive football.\n“A typical boys’ league will require teams to host home games and travel for away games, but this model often isn’t feasible for many girls’ clubs.\nPro Sports Academy also won silverware over the summer\n“By hosting all our matches at a central venue and offering smaller formats such as five-a-side or seven-a-side games, the league caters specifically to the needs of girls’ clubs.\n“These clubs might have one coach responsible for managing multiple teams across age groups, a smaller squad of players, or limited access to quality football pitches. At GSL teams can just show up and play without having to worry about hiring a pitch, finding a referee, or providing goals and footballs.”\nReflecting on the impact that the GSL is having, Williamson continued: “The fact that we have doubled the number of participating teams since last season goes to show that there is a demand for competitive football for girls.\n“Beyond our league provision, the aim of the Girls Super League is to go above and beyond to create a hub for girls’ football. We do this by hosting a range of workshops and events for our community.\n“Last season, we were able to bring 150 girls to play on the pitch at Wembley Stadium. They took part in mindfulness activities and skills workshops led by former Lioness player, Rachel Yankey. It was amazing to see the excitement of the girls as they walked on to Wembley’s iconic pitch – it’s these kinds of opportunities that will inspire them to stay involved in football.\n“We also encourage girls to pursue other pathways within the sport. We had 18 participants on our refereeing course for women and girls, some of whom are now working in our league under the mentorship of experienced referees.\n“Our goal with the GSL is to continue building a community that nurtures every girl’s love of football.”",
  "word_count": 569,
  "scraped_at": "2026-02-14T12:40:41.135041"
}