{
  "article_id": "d4296cf99ac9",
  "url": "https://www.pressherald.com/2024/02/29/thursdays-college-roundup-vachon-reaches-milestone-in-maines-win-over-binghamton/",
  "title": "Thursday college roundup : Vachon reaches milestone in Maine win over Binghamton",
  "date": "20240301T023000Z",
  "domain": "pressherald.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Anne Simon notched a double-double with 26 points and 10 rebounds, and Maine survived a poor shooting night as it held on for a 57-51 win over Binghamton in an America East women’s basketball game Thursday night at Cross Insurance Center in Bangor, giving Coach Amy Vachon her 150th career victory.\nThe game was moved to the Cross Center because of a power outage on campus in Orono. Maine (20-9, 13-2 America East) shot just 35 percent from the field, and Simon was the only player in double figures for the Black Bears. Their second-leading scorer for the season, Adrianna Smith, was 0 for 12 from the field, though she finished with eight points, 13 rebounds and seven assists.\nElla Wanzer led Binghamton (12-16, 7-8) with 14 points, including four 3-pointers.\nMaine ends its regular season at home Saturday against Albany. The winner will be the No. 1 seed for the conference tournament.\n(17) NOTRE DAME 71, (5) VIRGINIA TECH 58: Freshman Hannah Hidalgo had 23 points and 12 rebounds to help the Fighting Irish (22-6, 12-5 ACC) beat the Hokies (23-5, 14-3 ACC) in South Bend, Indiana.\nSonia Citron added 21 points and Maddy Westbeld had 19 for Notre Dame. Cumberland’s Anna DeWolfe was held to two points.\nMEN’S BASKETBALL\nBINGHAMTON 76, MAINE 74: Tymu Chenery hit a tiebreaking layup with 1:25 remaining in overtime, Dan Petcash made two clinching free throws, and the Bearcats (13-14, 5-9 America East) edged the Black Bears (13-16, 5-9) in Vestal, New York.\nAfter trailing 39-31 at halftime, the Black Bears took the lead with a 14-0 run early in the second half. They were up 58-52 with six minutes to go in regulation, but Binghamton scored the next eight points. A floater by Maine’s Jaden Clayton with 2:08 left tied the game at 62-62. Neither team scored again in regulation.\nMaine’s last lead was 68-66 after a 3-pointer by Kristians Feierbergs with 2:36 remaining in overtime. Nehemiah Benson answered with the tying basket, and Chenery broke the deadlock on Binghamton’s next possession.\nGavin Walsh led Binghamton with 17 points, Armon Harried had 16, and Chenery and Petcash each finished with 13.\nPeter Filipovity recorded a double-double for Maine with 17 points and 14 rebounds. Kellen Tynes (16 points), Quion Burns (13) and Jaden Clayton (12) also scored in double figures.\nFOOTBALL\nPLAYOFFS: College Football Playoff officials are considering a 14-team format that would guarantee three spots each for the Big Ten and Southeastern Conference, two for the Atlantic Coast Conference and Big 12 and one for the highest-ranked team from the other five leagues, two people with direct knowledge of the discussions told The Associated Press.\nThe people spoke on condition of anonymity because the CFP management committee’s talks were not being made public. The management committee is made up of 10 major college football conference commissioners and Notre Dame’s athletic director.\nThe CFP expands from four teams to 12 this season and next, but Executive director Bill Hancock acknowledged last week that the group had already begun talking about another expansion, starting in the 2026 season, when a new media rights contract kicks in.\nThe CFP and ESPN have an agreement in principle on a six-year contract that will pay the conferences involved about $1.3 billion per year. But the deal cannot be finalized until format and revenue distribution issues are resolved by the management committee.\nThe 12-team model that will be be used for this season has conference-specific automatic bids. The five highest ranked conference champions, regardless of the league, are guaranteed a spot in the field, along with seven at-large selections. The CFP made the move from the six highest-ranked conference champions to five last week, a decision prompted by conference realignment and the demise of the Pac-12.\nThe 14-team model being considered would have a field comprised of 11 automatic bids and three at-large selections.",
  "word_count": 647,
  "scraped_at": "2026-02-14T12:47:32.230453"
}