{
  "article_id": "d42e11aad0a0",
  "url": "https://www.runnersworld.com/runners-stories/a42830561/sophia-gorriaran-harvard/",
  "title": "Sophia Gorriaran Chooses Harvard",
  "date": "20230212T170000Z",
  "domain": "runnersworld.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "High school senior Sophia Gorriaran entered the 800 meters at Boston University’s Valentine Invitational on February 10. Racing against three college athletes and three professional runners in the first heat, Gorriaran finished second in 2:01.16. Michaela Rose, a sophomore at Louisiana State University, was the winner, in 2:00.18.\nGorriaran was nonplussed. “It was okay,” she said after the race. “I didn’t feel amazing, but it was okay. I kind of fell asleep in the middle of the race.”\nShe has high standards for herself. Gorriaran, 17, thought a run at the 2-minute barrier, which also would have given her the indoor high school record in the 800, might have been possible. Last year at this meet, she ran 2:00.58.\nNever mind that her time would have won the NCAA indoor championships last year. Or that it was her second-fastest indoor 800 ever. She wasn’t thrilled.\nAfter the race, she went outside on a Boston street, jogged a bit, and then ran 5 x 200 meters in 40 seconds, an easy pace for her. After that, she and her parents got in the minivan and headed to New York, Gorriaran in the middle row so she could stretch out her legs on the trip down.\nHer father, Steve, who was her coach until the end of seventh grade and now considers himself her executive vice president, managing every detail of her training and racing, joked she would have been in her Normatec recovery boots if only he could have figured out a way to plug them in while they were driving.\nGorriaran needed her legs to be ready. She raced a second time about 24 hours later, in the 600 meters at the Millrose Games, at the Armory in upper Manhattan. The field included world-class talents like Ajee’ Wilson, 28, who holds the American indoor record in the 800 meters and five world indoor medals. Wilson had a dominant win, Gorriaran finished fifth of five entrants in 1:27.51, less than half a second from her best.\nIn between races, Gorriaran made an announcement about her future. On a RunnerSpace livestream from the Armory, she told viewers her plans:\nShe’s going to Harvard next year.\nIt’s late in her senior year to be making a college announcement—most top high school athletes announce in the fall of their senior year—and because of the delay, many track fans assumed Gorriaran would skip college and turn pro.\nBut Harvard it is, about an hour from home in Providence, Rhode Island. Her older brother, Max, who runs for BU, will be close by. Her older sister, Natasha, plays lacrosse for the the University of Pennsylvania. (Yes, the Gorriaran family will have all three in college next year.)\n“I thought Harvard would be the best fit for me, based on the school itself,” she said in a phone call with Runner’s World a week before her announcement. “I wanted to challenge myself academically. I liked the women on the team and got along with them really well. I liked all the coaches. I thought they were really willing to work with me and work with what I had done in the past. I felt like it was more individualized than a bigger program.”\nA calculated approach\nGorriaran has had the benefit of an individualized program, one that in many ways resembles pro training, since middle school. Steve, 60, has seen to that, carefully planning her training, obsessing over workouts and splits, helping his daughter develop race strategies.\nHe was a wide receiver on the football team at Brown University and was a solid sprinter, running 10.57 in the 100 meters and 49.23 in the 400. He still competes from time to time—and jokes about it: “Watching a 60-year-old guy run is not the prettiest thing in the world, but I’m reasonably fast for an old guy.” The goal, he said, is to run his age in seconds for 400 meters. Anything close to 60 seconds and he’s happy.\nA computer scientist who runs two businesses, Steve has brought his analytical mind to all his kids’ athletic training. By the time Sophia was in seventh grade, she had run 2:19 for 800 meters. Steve realized he had brought her as far as he could with sprinting training. He enlisted a local coach, Jon Barnes, a retired banker, to hone the endurance side of his daughter’s training.\nBarnes recalls sitting down with the family for a 90-minute meeting in August before Gorriaran went to eighth grade.\n“Steve said, ‘You know, within three or four years, she should be getting very close to 2 minutes [for 800 meters]. Here is what other athletes have done,’” Barnes said. “He could name female athletes from 10 years ago. ‘This is the progression they made, this is where they are, this is where [Olympic gold medalist] Athing Mu was when she was 14.’ He knows all of that stuff backward and forward.’”\nTo an outsider, it might appear Steve is the sports parent from hell. To those who know the family, that’s completely wrong. (It also overlooks his role as a volunteer coach to dozens of developing athletes, outside of his own family, in the community.)\n“Steve and I have collaborated very well,” Barnes said. “He’s a strong-willed person, he’s very focused on doing what’s best for his daughter. He allowed me to play a big role during those four years. He could trust me to write workouts that would help her development.”\nGorriaran has inherited her father’s memory for numbers. She can hit splits exactly—Barnes will ask her to hit 48 seconds for 300 meters, and she’ll nail it every time.\n“She’s very intelligent, very focused, very disciplined, very committed,” he said. “If I say to her, ‘Do you remember the hill workout we did in September of 2019?’ And she will tell me every step that she took practically. She remembers workouts, what times she had and so on.”\nNo stone unturned\nAlong the way, thanks to her dad, Gorriaran has met with pro coaches and physiologists all over the country. She’s worked out with Wilson and her coach, Derek Thompson, in Philadelphia. She’s visited with sprint coach Dan Pfaff in Round Rock, Texas, and has undergone testing by Aaron Davis, a physiologist in Austin.\n“We have not really spared any expense with Sophia or any of the kids on their development,” Steve said. “I joke to Sophia, for most kids, it’s one coach for 10 or 20 athletes. You have one athlete with 10 coaches. We try to take care of her.”\nIn September, Barnes handed the training over to Kurt Benninger, who is married to American 10,000-meter record holder Molly Huddle. He is the head coach of the Rhode Island Track Club. When it fits with her school schedule—Gorriaran goes to Moses Brown, an independent day school in Providence—she works out with pros Marielle Hall and Helen Schlactenhaufen, who train under Benninger.\n(Benninger is also an assistant coach at Brown University, and although the NCAA allows him to coach Gorriaran through the Rhode Island Track Club, he was not permitted to speak to Runner’s World about Gorriaran.)\nA 17-year-old, working out with pros. It is it too extreme?\n“We are intense people, I guess you would say,” Steve said. “But that doesn’t mean we’re lunatics, I think. If you’re going to do something, do it to your best, so why not be intense about it?”\nHe thinks it’s good for his daughter to see how Hall and Huddle go about their jobs, because after all, she’s aspiring to a career as a pro runner. “The example they set—no complaining, liking it, enjoying it, knowing what it takes, I think it’s very good for Sophia to witness that,” Steve said.\nA two-sport star\nIn addition to being a world-class track athlete, Gorriaran, like her sister, excelled at lacrosse. She could have played in college and some programs recruited her promising she could do run and play lacrosse.\nShe loved being on a team sport and said she thinks it’s made her stronger as a whole. “All the other muscles that track doesn’t hit, I think lacrosse does,” she said. “And if people are throwing elbows at me [in the 800], it doesn’t really faze me. I experience a lot more of that in lacrosse.”\nPlus, Steve and his wife, Dr. Carine Leconte—who’s a pediatrician in Providence and very involved in decisions about their daughter, although less public about it than Steve—didn’t see how it would be fair to make her stop playing: You’re too good at track, so we’ll punish you by taking away lacrosse? It didn’t make sense.\nBut after she suffered a lacrosse injury last spring, which curtailed her track training for weeks, Gorriaran has decided to dial back and stick to running.\nUltimately, she is the boss of her own future.\n“Sophia calls the shots, absolutely, positively,” Steve said. “It’s her life, her career.”\nGorriaran says there are ways she can improve—staying engaged in the third 200 of an 800-meter race, for example.\nAnd by getting more sleep. She’s often up until 1 a.m., watching shows, on social media, doing her hair, which she wears loose on the track. Then she has to be up by 7 a.m. to get to school.\n“I don’t sleep enough for being a runner and an athlete,” she said. “I definitely have to work on that.”\nThe best path forward?\nGorriaran is unafraid to state her goal: Making the U.S. Olympic team in the 800 meters in 2024.\nIs going to college the best way to help her do that? For all of Steve’s calculating, that’s harder to predict.\nFor sure, the NCAA will help her hone her racing tactics. She’ll be up against Rose of LSU, plus Juliette Whittaker and Roisin Willis, both Stanford freshmen, who ran faster in high school than Gorriaran has so far, just to name three. The U.S. is deep in the 800 meters, and that extends to the college ranks.\nGorriaran could have gone to the University of Virginia or Texas A&M (two of the handful of other universities she was considering), gotten a full ride, plus a monthly stipend to pay for living expenses and anything she can earn from name-image-likeness (NIL) deals.\nHarvard, as part of the Ivy League, does not offer athletic scholarships. She can still seek NIL deals there, although so far only a handful of those deals have been generous for college runners. Most of the biggest names in NIL are in football, basketball, and gymnastics.\nKatelyn Tuohy of North Carolina State University has what’s thought to be a substantial NIL deal with Adidas. Emily Cole, a steeplechaser at Duke University, has arrangements to endorse several companies’ products. But so far, they seem more the exception than the rule.\nOr maybe the best thing to do for her Olympic aspirations was to stay home. Gorriaran could have signed a pro deal, likely worth six figures annually, and skipped college, a path Wilson took, as have others, like Mary Cain, Hobbs Kessler, and Drew Hunter.\nThe lure of the Harvard reputation was too much to turn down.\n“We always wanted to make sure they got a very good education,” Steve said of his kids. “To my wife and I, we feel it’s difficult to make a living as a professional track athlete. If along the way it pans out that she can be a pro runner, that’s great. You need to have plan B also.”\nThe result of Steve’s deliberate planning means that his daughter, he believes, has room for improvement at Harvard and for the next several years. They’ve taken her training little by little, adding slightly more each year, improving certain parts of her races piece by piece. Only recently did Gorriaran start incorporating long runs, never more than 8 miles. Five years ago, that would have accounted for an entire week of work.\nShe races at every distance, from 300 meters to 3,000 meters, to keep her fresh and fun. “I don’t want want her getting so focused on one thing and burned out because she can’t take it,” Steve said. “There’s plenty of time for her to focus when she gets older.”\nThat’s how it is that she’s running an 800 one day, a 600 the next. For Sophia Gorriaran, that’s her idea of a good time.\nEditor’s note:\nThis article has been updated to clarify that Harvard University does not offer athletic scholarships, nor do any universities in the Ivy League. All students, including athletes, can apply for need-based financial aid.\nSarah Lorge Butler is a writer and editor living in Eugene, Oregon, and her stories about the sport, its trends, and fascinating individuals have appeared in Runner’s World since 2005. She is the author of two popular fitness books, Run Your Butt Off! and Walk Your Butt Off!",
  "word_count": 2143,
  "scraped_at": "2026-02-14T13:34:05.273813"
}