{
  "article_id": "d45662a7e204",
  "url": "https://www.espn.com/espn/story/_/id/47607014/afcon-nigeria-vs-morocco-recent-head-head-record-favours-atlas-lions",
  "title": "Nigeria vs Morocco - Recent head - to - head record favours the Atlas Lions",
  "date": "20260114T104500Z",
  "domain": "espn.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "For the first time since 1980, Nigeria will face back to back North African opposition in the knockout stage of the Africa Cup of Nations when they take on Morocco in the semifinals on Wednesday.\nIncidentally, it is the same two nations, just in reverse order. To win that title, the Green Eagles, as they were known at the time, beat Morocco, then Algeria in the final in Lagos.\nWhile the history of Nigeria-Morocco games does not have the same rich tapestry that marks the Nigerians' rivalry with Algeria, there have been some memorable games in the past that bear reliving.\nPast encounters\nMorocco Vs Nigeria (Tokyo 1964Olympic Games Qualifier: Dakar)\nThe earliest meeting of these two sides came during the qualifiers for the 1964 Olympic Games.\nThere were three spots available for Africa, and Morocco and Nigeria were in Pool 3, which also included Kenya and Ethiopia in a two-round knockout series.\nNigeria easily won the first leg 3-0 in Lagos. Asuquo Ekpe, with two goals, and Wonderboy Paul Hamilton were the goalscorers.\nIn the return leg, Hamilton opened the scoring for Nigeria in Casablanca to stretch Nigeria's lead to 4-0. But Morocco pulled out all the stops. Mohamed Lamari drew them level within seven minutes of Hamilton's goal and it was one way traffic from then on.\nThe game ended 4-1 for a 4-4 aggregate score. At the time, the away goals rule was not yet in force, and so FIFA ruled that there should be a one-legged playoff at a neutral venue to determine the winner.\nMorocco won the playoff 2-1 in Dakar, and advanced to the final where they beat Ethiopia 2-0 over two legs and qualified for the Games.\nMorocco Vs Nigeria (1976 Africa Cup of Nations: Addis Ababa)\nAfter their first AFCON qualification in 1963, Nigeria failed to make it to the next five tournaments in a row.\nWhen they returned in 1976, it was a young, talented and driven squad led by Chairman Christian Chukwu and featuring the likes of Haruna Ilerika, Joe Erico, Sam Ojebode, Muda Lawal, Thompson Usiyen Aloysius Atuegbu and Sunday Oyarekhua.\nThat team stunned defending champions Zaire (now DR Congo) 4-2 in their first match of the continental finals in Ethiopia. That was followed by a 1-0 win over Sudan.\nBut in their final game of the group, they were beaten 1-3 by the Atlas Lions. The last of those goals came via Larbi Chebbak, father of Morocco women's striker Ghizlane Chebbak.\nBoth sides were to meet again soon after in the second and final round of the tournament, which was played on a round robin, league basis, the only time that has ever been done.\nBaba Otu Mohammed scored just before the hour but Ahmed Faras and Redouane El Guezzar won it for Morocco with late goals. Morocco emerged champions while the Eagles, who defeated Egypt 3-2 in their final game, took bronze.\nColin Udoh discusses how Nigeria could play without their captain Wilfred Ndidi as he faces a one-match suspension.\nNigeria Vs Morocco (1976 Olympics Qualifying Match: Lagos)\nThree weeks after the disappointment of Addis Ababa, the Eagles were presented with an opportunity to exact revenge on the Atlas Lions. Just like their first meeting, it was an Olympic qualifier, this time, for the 1976 Games in Montreal.\nJust like they did the first time, the Eagles treated fans at the National Stadium in Lagos to an entertaining fare, sweeping to a commanding 3-1 win thanks to goals by Thompson Usiyen (a brace) and Kelechi 'Caterpillar' Emeteole.\nThere was to be no repeat of what happened in their previous Olympic run as Nigeria held Morocco to a lone goal win and qualified for the Games.\nHowever, the story was not to have a happy ending as the Government of Nigeria led an African boycott of the Games because of host nation Canada's dalliance with New Zealand, which had sporting ties with apartheid South Africa.\nNigeria Vs Morocco (1980 AFCON semifinal: Lagos)\nThe Green Eagles were flying high in the first AFCON to be hosted by Nigeria, and the Atlas Lions could not stop them. Felix Owolabi lashed in the only goal early in the semifinal encounter at the National Stadium in Lagos to set the stage for a Nigeria vs Algeria final, which the Eagles won to claim their first AFCON title.\nMorocco Vs Nigeria (1984 AFCON qualifying match: Rabat)\nAfter a scoreless draw in Benin City, Nigeria and Morocco again ended it 0-0 in the return in Rabat, necessitating a penalty shootout to determine the winner. Nigeria won 4-3 on penalties and qualified for Cote d'Ivoire 1984.\nMorocco Vs Nigeria (1984 Olympics Qualifying Match: Casablanca)\nFor the third time, both teams were again involved in a tussle to reach the Olympic Games. This time, they ended the first leg in Lagos 0-0, and the same result was returned in Casablanca in the race to the Los Angeles 1984 Olympics. In the ensuing penalty shootout, Morocco won 4-3 and qualified to the next round.\nNigeria Vs Morocco (2000 Africa Cup of Nations: Lagos)\nCo-hosting the tournament at home, with Ghana,, the Super Eagles were heavily favoured to win the trophy and came loaded with top players like Austin Okocha, Nwankwo Kanu, Sunday Oliseh and co.\nBut Morocco held firm, even after Finidi George ripped in an unstoppable effort in the first half.\nIt was not until Julius Aghahowa sprinted past the Morocco defence and acrobatically lifted the ball over the goalkeeper that Nigerians heaved a sigh of relief, claimed victory and qualification to the quarterfinals.\nMorocco Vs Nigeria (2014 African Nations Championship: Cape Town)\nMorocco took the game by the scruff from the first blast of the whistle and sped to a 3-0 lead after 45 minutes at the Cape Town Stadium.\nHowever, Nigeria, coached by the late Stephen Keshi returned from recess a different proposition, and drew level before winning in extra time to qualify for the semifinals.\nMorocco Vs Nigeria (2018 African Nations Championship: Casablanca)\nNigeria reached the final of the African Nations Championship for the first time, and were hoping to come away with victory.\nInstead, they found themselves totally outclassed by Morocco. A brace from Zakaria Hadraf, was further goals from Walid El Karti and Ayoub El Kaabi put paid to Nigeria's hopes.\nEl Kaabi, who emerged tournament top scorer with nine goals, is in the current AFCON squad and has three goals already.",
  "word_count": 1071,
  "scraped_at": "2026-02-14T12:44:32.280933"
}