{
  "article_id": "d4607d441b26",
  "url": "https://www.elevenwarriors.com/skull-sessions/2024/02/145409/skull-session-ryan-day-to-move-on-from-play-calling-cj-stroud-will-compete-in-the-nba-celebrity-all-star-game-and-JSN",
  "title": "Skull Session : Ryan Day to Move On From Play Calling , C . J . Stroud Will Compete in the NBA Celebrity All - Star Game and the Smith - Njigba Brothers Are Now Together in Seattle",
  "date": "20240208T140000Z",
  "domain": "elevenwarriors.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Welcome to the Skull Session.\nJermaine Mathews Jr. – good at football.\nHighest graded freshman Cornerbacks from the 2023 season pic.twitter.com/VuSqdjWNSf\n— PFF College (@PFF_College) February 7, 2024\nHave a good Thursday.\nGIVE ME ALL THE CONTENT! Ohio State head coach Ryan Day needed a couple of bottles of Dasani on Wednesday.\nAfter a 65-minute press conference at the Woody Hayes Athletic Center, Day spent another 60 minutes with Paul Keels, Jim Lachey, Tim Walton and Mark Pantoni on The Ryan Day Radio Show. With the potential for cottonmouth and irritated vocal cords, Day provided the Ohio State beat with over two hours of #content to use – an incredible blessing in the offseason (when little to no #content exists).\nThank you, Coach Day.\nThank you.\nUpon looking at all the news and notes from Day’s media appearances, here are five important quotes from the head coach:\nUNIMPORTANT NOTE: Why do journalists always choose five things for matters of importance? And why did I, a journalist, pick five things for this section, knowing journalists always choose five things? The world may never know.\nOn hiring Bill O’Brien\n“I think at the end of the season you look at what changes need to be made. As we all know, at Ohio State, we’re chasing that one or two percent. ... I felt like, in that particular situation, for me to really be able to hand over a lot of the duties that I had been doing. I looked for someone who had a great background. And he had been in the NFL and the SEC. He’s been a (college) head coach. He’s been a head coach in the league. The experience of developing quarterbacks was there. Then, the fit. Culturally, he was the right fit.”\nGive credit to Day. It’s hard to find a coach with a better background than O’Brien.\nOn moving on from play calling\n“I know that that is an ideal situation moving forward. I know that it has to happen. ... Do I want to? No, I don't. I love the football part of it. I love calling plays. I love being in there. But I'm getting pulled out (of offensive meetings). I'm not, on a Wednesday night, thinking about what to call on 3rd-and-4 on the 21-yard line in the third quarter of a game. Those are all the things you rehearse in your mind. It takes a lot of work. I know that my energy and time and all that stuff needs to be in other areas. And especially with all that's going on right now across the board, just with the team and the portal and NIL and just all those types of things, I know that's the right thing to do. But now making sure the right person’s in place was critical.”\nWhen I read Day’s comments here, the old John D. Rockefeller quote, “Don’t be afraid to give up the good to go for great,” came to mind (Ironically, Jim Tressel posted those words to X on Wednesday). Day is a good play caller – a great one, even. But for Ohio State to be great, Day needs to direct his attention elsewhere. It will be nice to see him do that now that he has O’Brien on his staff.\nOn Will Howard\n“I like his competitiveness. I like his toughness. Coach Mick (Marotti) would tell you he sees that every day in the weight room. He’s a guy that’s won a Big 12 championship. He’s a field goal or whatever away from beating Texas last year. He’s got a mature approach about him. He’s got the ability to throw the football. When he needs to run, he can run. He’s big. You see the size when he gets up on you. There’s a few things you really can grab onto (that impress).”\nDay has not named Howard the Buckeyes’ QB1, as Devin Brown and Lincoln Kienholz remain on the roster, and five-star freshmen Air Noland and Julian Sayin round out the room. Still, it’s obvious Day is enamored with what the 6-foot-5, 242-pound Howard offers. Day will claim there’s a “competition” in the position this offseason, but I am 99.9% sure Howard will be Ohio State’s’ starter in the 2024 season opener.\nOn TreVeyon Henderson and Quinshon Judkins\n“He was unbelievable. He said, ‘If you think it helps the team, coach, let’s do it.’ ... I think both of their approaches are that they can get each other better. But it all started with TreVeyon. I think TreVeyon’s leadership as he has transitioned into his fourth year has been tremendous – the way he’s going about his work and the way he’s holding guys accountable. He’s got a different look in his eye. He's been in these games before. He knows (what it's like). ... I'll give Quinshon credit. He's also embraced our culture over the past couple of weeks. We'll see how it grows. All the reports are that he is doing a great job assimilating.\"\n2024 Ohio State captain TreVeyon Henderson? People are saying.\nOn the expectations and pressure to perform well next season\n“It's like that every year. I've watched C.J. Stroud get up there and say, 'Pressure is a privilege.' I think he is so right about that. We have an opportunity with an unbelievable team to go attack this next year. To see the fans and Buckeye Nation kind of buzzing over the last few weeks and getting behind this team and building it, I think the guys feel it. A long way from the season, but pressure is a privilege. These guys now have an opportunity to go have a great season. It’s a long way away, and there’s a lot of work to be done. But we look at the team we’ve got, and we’ve got the right guys in the right seats right now. ... There's a lot of things we need to attack, but I think we all embrace that, and that's why we are at Ohio State.”\nC.J. Stroud is so right about that. Ohio State has pressure, and its coaches and players wouldn’t have it any other way.\nHEY NOW. YOU’RE AN ALL-STAR. Speaking of Stroud, the former Ohio State quarterback is headed to another All-Star game.\nOn Sunday, Stroud performed in the Pro Bowl Games in Orlando, completing 18 of 22 passes for 173 yards and two touchdowns. On Wednesday, Stroud was named to the NBA Celebrity All-Star Game, which will be held at the Indiana Pacers’ Gainbridge Fieldhouse on Feb. 16.\nBringing his talents to the #RufflesCelebGame at #NBAAllStar its @CJ7STROUD! pic.twitter.com/bde00j9x3o\n— #NBAAllStar (@NBAAllStar) February 7, 2024\nStroud will be a member of Team Stephen A. Smith, which will take on Team Shannon Sharpe in the event. In addition to Stroud, Team Stephen A. features former NBA All-Star Metta World Peace, Phoenix Mercury guard Natasha Cloud and EGOT winner Jennifer Hudson, among others. In contrast, Team Shannon features Dallas Cowboys linebacker Micah Parsons, IndyCar Series racer Conor Daly and Emmy winner Lilly Singh.\nThe 2024 #RufflesCelebGame rosters!\n— NBA (@NBA) February 7, 2024\nFriday, 2/16 at 7:00pm/et on ESPN pic.twitter.com/ocm3KYxI3H\nBefore Stroud became a Heisman finalist for Ohio State and an NFL Offensive Rookie of the Year favorite for the Houston Texans, he was a standout on the football field and the basketball court for Rancho Cucamonga High School in California. Here is a Hoop Mixtape™ for Stroud from back in the day:\nNext week in Indianapolis, we'll see if Stroud can knock down some 3-pointers and get to the rack like he did as a sophomore in high school.\nKnowing Stroud, he'll put on a show.\nHe'll put on a show, for sure.\nNOW THERE ARE TWO OF THEM! Another member of the Smith-Njigba family will play for a Seattle team after the Mariners claimed outfielder Canaan Smith-Njigba off waivers on Wednesday.\nWelcoming another Smith-Njigba to the PNW\n— Seattle Mariners (@Mariners) February 7, 2024\nWe have claimed OF @CanaanSmith_ off waivers from the Pirates.\nhttps://t.co/k5i3unMkQ3 pic.twitter.com/eNHwUfwwwu\nThe brother of former Ohio State wide receiver Jaxon Smith-Njigba – now a member of the Seattle Seahawks – Canaan previously played in the Pittsburgh organization and appeared in 15 games across two stints with the Pirates last season. In 105 games for the Triple-A Indianapolis Indians, he hit .280 with 15 home runs and 74 RBIs.\nSmith-Njigba was originally a fourth-round pick in the 2017 draft by the New York Yankees. He made his major league debut with the Pirates in 2022 and appeared in three games that season.\nJaxon Smith-Njigba had the second-most receptions for a rookie in Seahawks history with 63 across 17 appearances in 2023. The Seahawk with the most receptions as a rookie? Another former Ohio State wide receiver – you may have heard of him (!) – Joey Galloway, who collected 67 receptions in 1995. With his 63 catches, JSN recorded 628 yards and four touchdowns.\nJust the start for @jaxon_smith1 https://t.co/WlVAhO713C\n— Ohio State Football (@OhioStateFB) February 6, 2024\nWhat a talented family!\nWOMEN IN SPORTS. Wednesday was National Girls and Women in Sports Day. Ohio State football celebrated the public holiday with a picture of its female employees.\nHappy National Girls & Women in Sports Day to all our Buckeyes. Thank you for the tremendous work & continuing to elevate our program every single day\n— Ohio State Football (@OhioStateFB) February 7, 2024\n#GoBucks | #NGWSD pic.twitter.com/4EaOTlGvyA\nThese are the women who help make Ohio State one of the best programs in America. While the photo shows us what they look like, it doesn't tell us what they do. That said, I decided to do some research. Here's what I found out about each of them and their role for the Buckeyes:\nFRONT\n- Kaila Olson, MS, RD, LD, became Ohio State’s performance dietitian in July 2019 after serving for two and a half years as a dietetic intern at the university. In her role, Olson assesses players’ nutritional and health needs and develops meal and nutrition plans to meet their goals.\n- Maddie (Marotti) Post is an administrator for the football program. A former Ohio State softball player, Post is Ryan Day’s special assistant and helps him with schedule management, event planning, travel support, and expense reports.\n- Ali Fischer joined Ohio State’s athletic training staff as an intern with football (and men’s tennis) in April 2021. She received her bachelor’s degree in athletic training from the university in 2019.\n- Carey Hoyt is a senior associate athletic director who oversees the Gene Smith Leadership Institute. She is also an administrator for football (and other sports) and leads NIL programs for all Ohio State student-athletes.\nBACK\n- Zoe Rosebrough is a performance dietitian for the Buckeyes and assists with the football and men’s lacrosse programs. Rosebrough has degrees in nutrition and dietetics from Oklahoma and worked for the Sooners for several years. She also spent time as an intern at EXOS in Phoenix.\n- Kayla Hackenberg is a veteran of Ohio State’s staff and will enter her 12th year with the program in 2024. Her time with the Buckeyes has included stints as a student assistant, administrator and now as a full-time coordinator in administration and operations. She is responsible for camps and clinics, travel and is a liaison for former players, coaches, staff, families and NFL personnel.\n- Charron Sumler, LPC, coordinates services and resources for university players in crises. She has more than 10 years of experience in counseling, leadership and case management. She has a bachelor’s degree in psychology from St. Edward’s University and a master’s in counseling from Texas State University.\n- Erin Dunston has been with Ohio State since March 2021 and is the director of on-campus recruiting. In this role, she coordinates official and unofficial visits for recruits, special events and game-day recruiting activities.\n- Madison Lowe is a football front office assistant for the Buckeyes. A former Ohio State soccer player, Lowe has two sports management degrees from Ohio State – a bachelor’s in 2021 and a master’s in 2022. She worked as a football intern in 2022 and became a program administrator in 2023.\nSONG OF THE DAY. “Ophelia” - The Lumineers.\nCUT TO THE CHASE. Taylor Swift is demanding this college student stop tracking her private jet... From Uber Eats’ “Friends” reunion to Bud’s Clydesdales, here are the buzziest Super Bowl ads so far... Christian Bale breaks ground on foster homes he’s fought for 16 years to see built... Video shows New York man driving truck into ocean off Daytona Beach in bizarre scene... Tony Romo needs a reboot.",
  "word_count": 2108,
  "scraped_at": "2026-02-14T12:41:23.894836"
}