{
  "article_id": "d472c9c5fd40",
  "url": "https://www.justarsenal.com/caitlin-foord-shines-in-arsenal-womens-uwcl-victory-over-linkoping/348258",
  "title": "Caitlin Foord shines in Arsenal Women UWCL victory over Linkoping",
  "date": "20230907T153000Z",
  "domain": "justarsenal.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "After an impressive FIFA Women’s World Cup campaign for Australia on home soil, where she helped her country get to the semi-finals, Caitlin Foord looked on fire in Arsenal Women’s Wednesday afternoon UWCL clash against Linkoping. Scoring a goal and getting two assists in the World Cup, Arsenal Women fans were hoping that Foord would come back with the same hunger she showed in the World Cup and hit the ground running.\nPlaying a full 90 minutes in our 3-0 win against Linkoping, she looked dynamic and fast down the left wing. Causing Linkoping’s players trouble whenever she got the ball and tracking back well when needed. After trying hard to break through the opposition’s backline and a difficult first half, she started the second half with a burst of energy.\nShortly after the second half started, after an incredible dribble and dink from Arsenal’s captain Kim Little, Foord put herself at the back post, in the perfect position to head the ball into the bottom left corner and put the Gunners in front. She never once took her foot of the pedal, sprinting down the wing and creating chances for her fellow teammates.\nMoving to the right wing around the 60th minute mark, she looked just as dangerous there. In the 90th minute her hard work had paid off, a quick pass by Katie McCabe from the centre of the pitch, had Foord running down the right wing and with a perfectly timed pass to the feet of Stina Blackstenius to finish off the game 3-0.\nIt’s safe to say that the Australian has brought her World Cup form back to club football. I was really impressed with how well she did on the right wing as well as the left, showing how dynamic she can be if needed. Looking Dangerous every time she touched the ball. Coming away from the match with a goal and assist is exactly what Arsenal fans would have been hoping for.\nWhat’s your thought on Foords performance Gooners? Were you as impressed as I was?\nDaisy Mae\nCOYGW!\nFollow JustArsenal’s Gooner Women on Just Gooner Women on Twitter for regular updates on the Arsenal Womens Team!\nDo you want to read more about the Arsenal Women’s Team? Click here….",
  "word_count": 376,
  "scraped_at": "2026-02-14T13:33:27.770726"
}