{
  "article_id": "d47de30642a8",
  "url": "https://www.espn.com/blog/new-england-patriots/post/_/id/4826922/patriots-hire-first-full-time-female-scout-in-64-year-franchise-history",
  "title": "Patriots hire 1st full - time female scout in 64 - year franchise history - ESPN - New England Patriots Blog - ESPN",
  "date": "20230522T153000Z",
  "domain": "espn.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "FOXBOROUGH, Mass. -- Quick-hit thoughts and notes around the New England Patriots and NFL:\n1. Breakthrough hire: When longtime Princeton football coach Bob Surace received a call from Patriots director of player personnel Matt Groh about a week before the 2023 draft, he figured it was a last-minute check-in on receiver Andrei Iosivas (sixth round, Cincinnati Bengals).\nTo his surprise, that wasn’t Groh’s primary intention.\nInstead, Groh was seeking information on one of Surace’s ace behind-the-scenes staff members: director of football operations Maya Ana Callender, who had emerged as a leading candidate for an entry-level scouting assistant job in New England.\nOver the next 45 minutes, Surace raved to Groh about her “phenomenal” performance, which contributed to a groundbreaking hire a few weeks later -- Callender, a 2016 graduate of Utica College, is believed to be the first full-time female scout in the Patriots’ 64-year history.\nSurace points to Callender’s 2021 training-camp fellowship with the Philadelphia Eagles, which was part of a wider NFL initiative aimed at providing more exposure and opportunity for women, as a key turning point.\n“Her whole background had been operations and she was really good at it, but they gave [fellows] different areas of the organization to work and one of them was the scouting piece. She called me from Philadelphia, and I could hear the joy in her voice,” Surace recalled.\n“It’s almost like ‘You really like this [operations side], and that’s where you saw your career going, but you didn’t know this other possibility was there.’”\nWhen Callender returned to Princeton for the 2021 preseason, she made growth in scouting a priority, in addition to her primary operations job that covered everything from booking team travel and hotel accommodations to coordinating coaches’ meeting times and field schedules.\n“She was able to carve out time almost every day to practice the craft of evaluating. She would look at NFL games, evaluate players and learn scout-speak -- the language of talking about somebody’s reach, length, production, how they use their hands. ... She would have a pad out at our practices, taking notes,” Surace said.\n“She became our pro/NFL liaison, so every time a scout came in -- which was probably 50 times last year, every team came in at least once -- she set them up. She talked about the players, their injury histories, how she had evaluated their performances. Then, by the time the scouts got to me, they didn’t have a lot of questions. I was kind of irrelevant on that, which was a new thing for me. She was terrific.”\nSurace has served as Princeton’s coach since 2010, posting a career record of 91-50. Prior to that, he was an assistant offensive line coach with the Cincinnati Bengals from 2002 to 2009.\nAs a young Bengals assistant, Surace said he studied the Patriots and noted their approach of hiring “highly intelligent” candidates who weren’t always coming from the highest level of football “but had this hunger to be successful and learn and grow.”\nHe has attempted to do the same at Princeton, which was how Callender was initially hired, sparked by a recommendation from Princeton alum and former NFL executive Marc Ross.\n“We’re not the NFL. We have a small staff, so they’re given lots of duties. For some of them like Maya, they rise to the top,” Surace said. “To her credit, she started from the ground up and really put herself in great position to take this next step.”\nThere were 33 full-time female scouts employed by teams in 2022, according to the NFL.\n2. OTAs preview: The Patriots enter the third and final phase of their voluntary offseason program this week, with organized team activities beginning. Media members will be present for Thursday’s OTA, which is traditionally when quarterbacks have addressed reporters.\nReceiver Tre Nixon was one of the standout OTA performers last year, and considering he didn’t appear in a regular-season game in 2022, it’s a reminder to keep non-padded spring practices in perspective. The Patriots' goal is generally to create a learning environment and foundation for players, so when they return for the start of training camp in late July, they’re in the best position to compete.\n3. Onwenu status: Starting right guard Mike Onwenu isn’t expected to be on the field during voluntary OTAs after undergoing offseason surgery for a lingering ankle injury from last season, according to a source with knowledge of his status.\nOnwenu was on course to play every snap last season until the fourth quarter of the final game when 317-pound Bills defensive lineman DaQuan Jones landed on the back of his legs. Onwenu, who was already playing through an ankle injury, crashed to the ground in a heap. That led to him missing his only six snaps of the season and ultimately carried into the start of the offseason.\n4. Boutte = Diggs? NFL Films senior producer Greg Cosell, who is an analyst on ESPN’s \"NFL Matchup\" show, told the “Inside the Birds” podcast that he’s intrigued by Patriots sixth-round pick Kayshon Boutte, the wide receiver from LSU.\nAcknowledging that the 187th overall pick in the draft isn’t even a lock to make the 53-man roster, Cosell studied Boutte and said: “If he reached his ceiling and can play to [his physical] traits all the time, I thought there’s a Stefon Diggs comparison to be made. Keep in mind, Diggs came out of Maryland as a fifth-round pick and the 146th player chosen. That’s what I was comparing him to, not Stefon Diggs in the last number of years as arguably a top-five receiver in the NFL. No one thought that of Diggs when he was a fifth-round pick and 146th player chosen. Boutte is a fascinating player.”\n5. Boutte at Premiere: Boutte was the lone Patriots draft pick to be invited to the 29th annual NFL Players Association Rookie Premiere in Los Angeles from Thursday to Sunday. There were 45 draft picks across the NFL who accepted invitations, which were made based on factors such as college performance, draft status, position and marketability. Boutte, who as a freshman at LSU was viewed as a top talent but saw his stock slip in his final two seasons, was the second-lowest draft pick to receive an invite, behind Cowboys running back Deuce Vaughn (sixth round, No. 212).\n6. Don’t forget Ty: Retired Patriots running backs coach Ivan Fears said veteran running back Ty Montgomery, who was limited to one game in 2022 because of a shoulder injury, is a Patriots player he’s watching closely. Fears is still a regular presence around the team and said of Montgomery on the “6 Rings and Football Things” podcast: “I think he has a great chance to be the third-down back and take some of the load off Rhamondre [Stevenson], so [Rhamondre] can be fresh when we really need him on first and second down carrying the ball as the featured guy. We need some help for Rhamondre, and I think Ty is looking really good right now. He’s healthy.”\n7. Wynn deal: Patriots 2018 first-round pick Isaiah Wynn landed with the Dolphins last week, on a modest one-year deal with a base value of $2.3 million and maximum value of $2.7 million. The Patriots had paid him $10.4 million in 2022 after picking up the fifth-year option of his rookie deal, which, as the math suggests, was a gift for a player who didn’t meet expectations. On a related note, 2019 Patriots first-round pick N’Keal Harry remains unsigned after spending last season with the Bears. The Patriots don’t have a player from their 10-member 2019 draft class on the roster after waiving offensive tackle Yodny Cajuste on Thursday.\n8. Covington accelerates: The NFL’s spring meeting is scheduled for Sunday to Tuesday in Minneapolis, and Patriots defensive line coach DeMarcus Covington will be in attendance as part of the league’s Coach Accelerator program. That gives Covington, entering his seventh season with the Patriots and having interviewed for the Cardinals’ defensive coordinator job in the offseason, a chance to further connect with owners and executives with future career growth in mind. Patriots pass-rusher Josh Uche (11.5 sacks in 2022) said of Covington: “It’s the integrity that he has -- in the meeting room and outside of it. [Me] being able to play more free, and having more confidence, definitely flows from him.”\n9. Brotherly bond: The Patriots' signing of San Diego State undrafted defensive tackle Justus Tavai -- the brother of New England linebacker Jahlani Tavai -- gives the Tavais a chance to become the fifth set of brothers to play together in New England. The others are DE Whit Canale/OL Justin Canale (1968); WR Clarence Weathers/RB Robert Weathers (1983-84); TEs Rob Gronkowski/Dan Gronkowski (2011); and DBs Devin McCourty/Jason McCourty (2018-20). Leading into April's draft, Jahlani had said: \"It would be cool if we get to suit up with each other.\"\n10. Did you know?: The Patriots and Giants had met in 17 straight preseasons prior to this year, which marks the first time the teams won’t face each other since 2004 (there was no preseason in 2020 because of the COVID-19 pandemic). The Giants remain the team's most frequent preseason opponent in franchise history (31 times), behind the Eagles (24) and Commanders (23). The Patriots' preseason slate will consist of the Houston Texans, Green Bay Packers and Tennessee Titans.",
  "word_count": 1564,
  "scraped_at": "2026-02-14T13:35:59.572405"
}