{
  "article_id": "d4bb882eb0bf",
  "url": "https://www.twtd.co.uk/ipswich-town-news/49048/obrien-no-matter-what-happens-on-sunday-the-leagues-not-done",
  "title": "OBrien : No Matter What Happens On Sunday the League Not Done - Ipswich Town News",
  "date": "20250301T143000Z",
  "domain": "twtd.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Saturday, 1st Mar 2025 13:11 by Asif Burhan\nAs Ipswich Town prepare to face Hashtag United for the fourth time this season, their two wins in the previous three encounters have revolved heavily around Lucy O’Brien, who spoke to Asif Burhan ahead of Sunday's game at Canvey Island’s Steve Taxis Stadium (KO 2pm).\nThe midfielder scored the opening goal in their 2-0 league win over the Essex side in September before coming on to drive home the winning penalty in the dramatic shoot-out victory over Hashtag in the Women’s FA Cup.\n“With the league fixture, we all knew it was a big match,” O’Brien recalled. “It was only the second game of the season. There was still everything to play for.\n“I scored quite early on, there was no shying away from how good that felt. It was a big goal to take the early lead.\n“I think in the FA Cup, it was even more special. The last penalty - nerves were going - but I backed myself, backed my team-mates as well and, yeah, I was just lucky enough to put it away.”\nO’Brien was a substitute in that match and the impact from the bench was felt again in Town’s last league match at home to Exeter City when another sub Ella Rutherford rifled home a crucial late winner in a 2-1 win.\nShe feels that this demonstrates that every member of the squad has a part to play for the rest of the season.\n“I think it leaves the team in a really good place,” she added. “We all know that no matter where you are in the squad, you’ve got a massive part of play.\n“Sometimes coming off the bench is more important than those who start. I’d even say for those who miss out on the squad, they play such an important part during the week and they really help the team supporting from the sidelines as well on the Sunday.\n“We’re so lucky that we’ve got such great depth in our squad and we’ve also a brilliant togetherness so matter what role you play, everyone plays their part.”\nTown remain unbeaten in the FA Women’s National League Southern Premier Division with eight games remaining. If that record is still intact at the end of this weekend, the possibility of going through the entire season undefeated becomes much more of a reality. O’Brien however prefers not to dwell on the thought.\n“Obviously it’s a nice accolade if we’re able to do it but I think our primary focus is, of course, promotion,” O’Brien, who has been at Town since 2020, continued.\n“We’d be silly to say it wasn’t. If, with that, we get the invincible season, then that would be brilliant. We just take each game as it comes, try and get the three points and if something happens off the back of that, then that would be great.”\nA win on Sunday over the current league leaders would put Town top with three games in hand, a huge advantage considering Hashtag United would only have four games remaining themselves. Having gone so close to promotion in the last few seasons, O’Brien knows it would be too soon to start celebrating.\n“We’ve been in this division long enough to know that no matter what happens on Sunday, the league’s not done,” the 21-year-old said.\n“We’ve got seven games after that will be of equal importance. Of course, people might be looking at what might happen to the table but for us, in the training ground and the team, we’re very much focused on the next game and then the one after that.”\nO’Brien has represented England at youth level playing in the same age group as current internationals Aggie Beever-Jones, Laura Blinkilde-Brown, Grace Clinton and Ruby Mace. On Wednesday, Clinton started for England as they defeated the world champions Spain at Wembley, an inspiring moment for the watching O’Brien\n“I think there was four of them from my age group that were within the squad,” she said. “For me, that’s quite special to see. My dad was saying ‘oh, you played with them when you were younger’.\n“It’s quite inspiring for me to see those players that I’ve shared experience with at England now going on to play for the seniors. It’s something that I’m striving to do and hopefully, one day, I’ll be able to.”\nIn the opposition side on Sunday, will be former Town player Eloise King, who recently moved to the Essex side after seven years at the club she grew up supporting.\nKing scored four times on her first start for Hashtag against Barking and O’Brien knows only too well the threat she now poses to the team.\n“She’s a good friend, so I’ve spoken to her,” she added. “We haven’t talked about football but we all know she’s a good player. She’ll be up for it on Sunday but so will we. It should be a really good game.”\nPhoto: ITFC\nPlease report offensive, libellous or inappropriate posts by using the links provided.\n- Page:\n- 1\nYou need to login in order to post your comments",
  "word_count": 858,
  "scraped_at": "2026-02-14T12:10:56.971745"
}