{
  "article_id": "d4e02082eb30",
  "url": "https://www.foxnews.com/entertainment/cmas-host-lainey-wilson-admits-lied-fiance-duck-hodges-first-date",
  "title": "Lainey Wilson hosts CMAs after admitting she lied to fiancé on first date",
  "date": "20251119T143000Z",
  "domain": "foxnews.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Lainey Wilson will be returning as the host of the Country Music Awards on Wednesday night, just weeks after she admitted she lied to now-fiancé Devlin \"Duck\" Hodges on their first date.\nWilson will be the third woman ever to repeatedly host the CMAs. Dolly Parton and Reba McEntire were the only women to be asked to return as a host prior to Wilson's big night on Wednesday.\nLeading up to Nov. 19, Wilson shared that she texted McEntire asking for advice on how to navigate the award show alone.\n\"There's so much joy. I think it's going to be a great week. I mean, this is, it's a big deal. I mean, some big old shoes to fill. So I don't take it lightly, but... I'm going to do the only… we've only had a solo woman host three times; Dolly, Reba, Lainey, which is wild,\" Wilson said during a press conference Sunday.\nLAINEY WILSON SPILLS DETAILS OF INTIMATE PROPOSAL, EYES 'VERY SIMPLE' WEDDING\n\"I texted Reba last night and I said, 'If you had one piece of advice to give me going into this week, what would it be?' And I thought she was just going to say something like 'just be yourself and have fun.' She sent me a list. I was like whoa, whoa, one piece of advice,\" she said.\n\"But yeah, it's like I said, some really big shoes to fill and I just feel so honored. So thank you all for letting me run my mouth and celebrate country music,\" Wilson added.\nLast year, Wilson co-hosted the 2024 CMAs alongside Luke Bryan and Peyton Manning.\nWilson and Hodges arrived on the red carpet in matching black blazers and cowboy hats during the 2024 CMAs – a historic night marking Wilson's hosting debut.\n‘YELLOWSTONE’ STAR LAINEY WILSON ‘COMPLETELY SHOCKED’ BY FIANCE'S PROPOSAL\nRight before Valentine's Day 2025, Hodges popped the question. \"4x4xU forever ❤️,\" Wilson captioned her Instagram post, announcing the couple's engagement.\nIn October, Wilson did an interview with Wide Open Country and shared details about the couple's first date in 2021. She told the outlet that she lied to Hodges, a former NFL player, on their first date to impress him.\nWATCH: CMAS HOST LAINEY WILSON TEXTED REBA MCENTIRE FOR ADVICE BEFORE HOSTING THE BIG SHOW SOLO\nHodges kicked off the date by telling the singer the story behind his nickname, \"Duck,\" which came from his time playing college football.\nLIKE WHAT YOU’RE READING? CLICK HERE FOR MORE ENTERTAINMENT NEWS\n\"He said he was playing football at Samford (University), and the coach there (said), 'You remind me of one of my favorite quarterbacks ever, and his name was Duck.' And he had an excellent season that year. And so the whole team started saying, 'It's Duck season; it's Duck season!' So that's how he got Duck,\" Wilson explained.\nWilson quickly realized she wanted to follow up with a story and lied that people call her \"Goose.\"\n\"On our first date, I told him that people call me Goose. I was lying, but he fell for it. I think he was like, 'Oh, I'm in love,'\" she told the outlet.\nWilson previously opened up to People magazine about the difficulties that come with being in a relationship while being a touring artist.\n\"You have to definitely carve out the time. It has to be something that you're very aware of, and you're like, 'Okay, I've got a day off here in 10 days. I've got to dedicate that day to spend time with my person.' And we both need that and deserve that, and it's always great. We just try to soak up those moments as best as we possibly can,\" Wilson told People in August.\nCOUNTRY STAR LAINEY WILSON ENGAGED AFTER JOKING SHE ‘MIGHT HAVE TO PROPOSE’ AFTER THREE YEARS\nIn September, Wilson told Taste of Country that she knows her marriage with Hodges will be successful because of their similar approaches to managing their finances.\n\"I'll tell ya this about Duck, he's pretty frugal, except when it comes to good hunting stuff, like getting ready for duck season and having all the appropriate gear and whatever, that's his thing he likes to splurge on,\" she said.\nCLICK HERE TO SIGN UP FOR THE ENTERTAINMENT NEWSLETTER\nWilson doesn't have an issue with her soon-to-be husband's big purchases since she doesn't want him to control hers. \"I'm not gonna tell him what to do, because he's not gonna tell me what kind of guitar I can buy, ya know?\" she said.\nIn August, the \"Yellowstone\" star shared details about how wedding planning with Hodges has been.\n\"Well, you ain’t gonna believe this but we still have not planned it, bless his heart,\" Wilson told Taste of Country at the time.\nEven though concrete plans have not been made, Wilson told the outlet that she and Hodges have talked about the details of their wedding, including the guest list.\n\"Of course we sit around and talk about like, what we would want. Just trying to figure out is it [the wedding] big or small? Is cousin so-and-so coming? Is cousin so-and-so not?\"\nThe 59th annual CMA Awards will be held on Nov. 19, 2025, at the Bridgestone Arena in Nashville, Tennessee.\nFox News Digital's Larry Fink contributed to this report",
  "word_count": 885,
  "scraped_at": "2026-02-14T14:20:55.372739"
}