{
  "article_id": "d4f6e65e80f6",
  "url": "https://www.myjoyonline.com/how-does-the-new-club-world-cup-work-and-why-is-it-so-controversial/",
  "title": "How does the new Club World Cup work , and why is it so controversial ? ",
  "date": "20241204T093000Z",
  "domain": "myjoyonline.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Audio By Carbonatix\nThe new expanded FIFA Club World Cup will take place in the United States between 15 June to 13 July 2025.\nPreviously an annual tournament contested by the top seven teams, the Club World Cup will now feature 32 teams and occur once every four years.\nThe tournament once branded a “mistake” by ex-Fifa president Sepp Blatter is undergoing a revamp as significant as it is controversial.\nHow have teams qualified?\nTeams from each of the six international football confederations will be at the Club World Cup: Asia (Afc), Africa (Caf), North and Central America (Concacaf), South America (Conmebol), Oceania (Ofc), and Europe (Uefa).\nThere are twelve places available for European clubs - the highest quota of the confederations. These places are decided by clubs’ Champions League performances over the last four seasons.\nThat means recent winners Chelsea, Manchester City and Real Madrid have all qualified.\nOther European teams have qualified through a UEFA ranking system determined by clubs’ performances over the four seasons. Only two clubs per country can qualify, meaning 2022 Champions League finalists Liverpool are not included.\nThere are four club places each for Asia, Africa and also the North America and Central America federation.\nSix places are awarded to South American clubs, and one to Oceania.\nClubs have accrued points over the most recent four seasons, based on their performances in their continental club competitions.\nAll qualifying teams have now been confirmed, the last being Botafogo, who beat Atletico Mineiro in the final of the South American Copa Libertadores.\nWhich clubs are taking part and who is seeded?\nPot 1: Manchester City, Real Madrid, Bayern Munich, Paris St-Germain, Flamengo, Palmeiras, River Plate, Fluminense\nPot 2: Chelsea, Borussia Dortmund, Inter Milan, Porto, Atletico Madrid, Benfica, Juventus, Salzburg\nPot 3: Al Hilal, Ulsan, Al Ahly, Wydad, Monterrey, Club Leon, Boca Juniors, Botafogo\nPot 4: Urawa Red Diamonds, Al Ain, Esperance Sportive de Tunisie, Mamelodi Sundowns, Pachuca, Seattle Sounders, Auckland City, Inter Miami\nWhy is Lionel Messi involved?\nOne spot in the tournament is reserved for a team from the host nation.\nFifa opted to awarded that place to Inter Miami for winning the 2024 MLS Supporters’ Shield, the trophy given out to the team which has the best regular season record. The Floridians then lost in the MLS play-offs, meaning they are not this season’s champions.\nThe invitation handed out to Lionel Messi’s Inter Miami has drawn some cynicism\nThe decision to invite Inter Miami to the Club World Cup before the MLS campaign was concluded has been interpreted by some as an attempt on Fifa’s part to ensure that Lionel Messi, who joined the team in 2023, will play in a tournament that has drawn little public enthusiasm so far.\nWhen is the draw?\nThe draw for the revamped Club World Cup will take place at 18:00 GMT on Thursday 5 December.\nYou can follow the draw through live text on the BBC Sport website and app.\nHow does the format work?\nThe revamped Club World Cup will run in a similar way to the international men’s and women’s World Cup competitions.\nThe 32 teams will be divided into eight groups of four, who will play each other in a single round-robin format. The top two teams from each group will then go through to the knockout stages.\nUnlike the international World Cups, the Club World Cup will have no third-place play-off.\nThe final will take place on 13 July 2025.\nWhere will matches be held?\nAll matches will be held in the United States, ahead of the country's co-hosting of the 2026 World Cup alongside Canada and Mexico.\nFixtures are set to be played in twelve different stadiums. The host venues are:\n- Atlanta, Mercedes-Benz Stadium\n- Charlotte, TQL Stadium\n- Cincinnati, Bank of America Stadium\n- Los Angeles, Rose Bowl Stadium\n- Miami, Hard Rock Stadium\n- Nashville, GEODIS Park\n- New Jersey, MetLife Stadium\n- Orlando, Camping World Stadium\n- Orlando, Inter&Co Stadium\n- Philadelphia, Lincoln Financial Field\n- Seattle, Lumen Field\n- Washington DC, Audi Field\nThe opening match will be held in Miami, and the final is scheduled for New Jersey.\nWhy is the new Club World Cup controversial?\nFifa is currently facing legal action, external from player unions and leagues about the scheduling of the tournament.\nGlobal players’ union Fifpro and the top European Leagues say the international football calendar is “oversaturated” to the extent that it “risks player safety and wellbeing.”\nSeveral players - including Liverpool's Alisson Becker and Manchester City's Rodri - have raised concerns about players’ wellbeing amid an increasingly jam-packed football calendar.\nThere are just five weeks between the Club World Cup final and the first Premier League match of the 2025-2026 season, which is scheduled for 16 August.\nManchester City manager Pep Guardiola has already requested a late start to the Premier League season for his team, while City midfielder Kevin De Bruyne told reporters: “The issue is that UEFA and Fifa keep adding extra matches, and we can raise concerns, but no solutions have been found. It seems that money speaks louder than the players’ voices.\"\nA Fifa spokesperson BBC Sport: “The FIFA Club World Cup is not responsible for calendar congestion. It is a competitive tournament that takes place once every four years and, as independent studies have verified, FIFA is only responsible for a small percentage of matches per season.\n“FIFA cares about the welfare of the players. Following a decision taken earlier this year, FIFA is formalising the Task Force on Player Welfare, headed by Arsène Wenger, to promote further global dialogue on player welfare issues with key stakeholders across football.”\nLatest Stories\n-\n‘Behind The Lens with Queen Liz’ explores the true meaning of Valentine’s Day, Love, Lust or Legacy?\n26 seconds -\n‘I wanted to be an architect but ended up as a nurse’ – Diana Hamilton reveals\n50 minutes -\nFrom wards to worship: Diana Hamilton reveals how nursing school shaped her destiny\n1 hour -\nMahama demands binding deadlines for African reparations\n2 hours -\nThis is not the time to settle political scores – Bawumia to government\n3 hours -\n5 definitive Valentine’s Day gifts to win your lover’s heart in Ghana\n3 hours -\n37% of SHS students exposed to drugs – Opare-Addo\n3 hours -\nNLC secures court injunction against striking tertiary unions\n4 hours -\nOSP says it remains guided by law after INTERPOL deletes Ofori-Atta’s Red Notice\n4 hours -\nWaiting in the Ring: life inside Bukom’s halted boxing scene\n4 hours -\nRed Notice cancellation: OSP official fires back at Ofori-Atta’s lawyers\n5 hours -\nOfori-Atta saga: Red Notice ends after arrest – OSP official clarifies\n5 hours -\nAAG raises alarm over billboard demolitions, calls for presidential intervention\n6 hours -\nHealth Minister to chair probe into ‘No Bed Syndrome’ death; promises system overhaul\n6 hours -\nPrime Insight to tackle ‘galamsey tax’ debate, cocoa reforms and Ayawaso East fallout this Saturday\n6 hours",
  "word_count": 1166,
  "scraped_at": "2026-02-14T12:49:09.973182"
}