{
  "article_id": "d4fc28756bf0",
  "url": "https://www.myjoyonline.com/uefa-reopens-bidding-for-2027-champions-league-final/",
  "title": "Uefa reopens bidding for 2027 Champions League final",
  "date": "20240925T050000Z",
  "domain": "myjoyonline.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Audio By Carbonatix\nUefa has reopened the bidding for stadiums to host the 2027 Champions League final after the match was stripped from Milan.\nThe San Siro was to be the venue for the showcase final but, after Milan officials failed to assure Uefa that planned redevelopment work would not hamper the event, European football's governing body opted to take it away from them.\nAC Milan and Inter Milan are considering building a new stadium in the San Siro area.\nThe new host stadium for the 2027 final is expected to be announced in May or June 2025.\nThe decision was taken at a meeting of the Uefa Executive Committee on Tuesday, where changes to the organisation's solidarity funding was also agreed.\nThe 'big five' European leagues - the Premier League, La Liga, Ligue 1, Serie A and Bundesliga - agreed to have their solidarity payments capped at 10m euros (£8.3m) per season up to and including 2026-27.\nThis is an increase of 1.5m euros on the previous cycle, but there are now 308m euros (£256.3m) to be shared rather than 177.2m euros (£147.4m) in the previous cycle.\nThe funds are allocated to clubs not participating in European competitions.\n\"Such funds are meant to support competitive balance across Europe's top division leagues, where some clubs benefit from additional revenue streams due to European competition participation,\" Uefa explained.\nAt Tuesday's meeting Uefa's women's football strategy for 2024 to 2030 was also agreed, though details of what it entails are yet to be released.\nLatest Stories\n-\n‘I wanted to be an architect but ended up as a nurse’ – Diana Hamilton reveals\n49 minutes -\nFrom wards to worship: Diana Hamilton reveals how nursing school shaped her destiny\n1 hour -\nMahama demands binding deadlines for African reparations\n2 hours -\nThis is not the time to settle political scores – Bawumia to government\n3 hours -\n5 definitive Valentine’s Day gifts to win your lover’s heart in Ghana\n3 hours -\n37% of SHS students exposed to drugs – Opare-Addo\n3 hours -\nNLC secures court injunction against striking tertiary unions\n4 hours -\nOSP says it remains guided by law after INTERPOL deletes Ofori-Atta’s Red Notice\n4 hours -\nWaiting in the Ring: life inside Bukom’s halted boxing scene\n4 hours -\nRed Notice cancellation: OSP official fires back at Ofori-Atta’s lawyers\n5 hours -\nOfori-Atta saga: Red Notice ends after arrest – OSP official clarifies\n5 hours -\nAAG raises alarm over billboard demolitions, calls for presidential intervention\n6 hours -\nHealth Minister to chair probe into ‘No Bed Syndrome’ death; promises system overhaul\n6 hours -\nPrime Insight to tackle ‘galamsey tax’ debate, cocoa reforms and Ayawaso East fallout this Saturday\n6 hours -\nCocoa crisis, galamsey complicity and election credibility to dominate this Saturday’s Newsfile\n7 hours",
  "word_count": 471,
  "scraped_at": "2026-02-14T12:48:14.067083"
}