{
  "article_id": "d53065ccd5e2",
  "url": "https://www.the42.ie/carla-ward-ireland-squad-turkiye-slovenia-6708786-May2025/",
  "title": "What can we expect as Carla Ward names Ireland squad for Nations League finale ? ",
  "date": "20250519T200000Z",
  "domain": "the42.ie",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "IRELAND HEAD COACH Carla Ward is due to name her third squad tomorrow morning.\nThe selection for the final Nations League group double-header against Türkiye and Slovenia will be unveiled before 9am when Ward speaks to the media in Dublin.\nMost eyes will be trained on the defenders: retiring centurion Louise Quinn has made herself available “until the summer”, the manager revealed last week.\nQuinn last played for Ireland in a Euro 2025 qualifier win over France at Páirc Uí Chaoimh last July. A long-term hip injury sidelined her for much of the season, and the towering centre-half announced her retirement from football last month. She featured in Birmingham City’s final Championship fixture, and could be set for an international farewell, pending selection.\nWard also confirmed last week that Heather Payne (Achilles) and Leanne Kiernan (quad) are unlikely to be available, but Megan Connolly and Kyra Carusa are back in the mix, having returned to full fitness. Connolly missed the Greece double bill due to an ankle setback, while Carusa sustained a hamstring issue and withdrew from the second game.\nSince her appointment in January, Ward’s squads have generally run along expected lines. Melisa Filis was the only new face in her first selection, but the Charlton Athletic midfielder was not recalled and remains uncapped. Shelbourne’s Aoibheann Clancy was a headline inclusion last time out, while Saoirse Noonan and Chloe Mustaki also returned. Noonan, who scored 31 goals for Celtic this season, was the only one to get minutes.\nAnother Shelbourne player, Alex Kavanagh, was a later fringe addition, replacing the suspended Katie McCabe and bringing the number of Women’s Premier Division representatives in the squad to three. Ruesha Littlejohn of Shamrock Rovers needs little introduction.\nWard and her assistant head coach, Alan Mahon, have been taking in games across the domestic league, while there has been a WhatsApp group set up with club managers.\nAfter watching Shamrock Rovers versus Sligo Rovers at Tallaght Stadium two weeks ago, the former Aston Villa manager identified 15-year-old Hoops left-back Keelin Comiskey as “the best player on the pitch by a mile”.\n“Tidy” Ellen Molloy, who returned to Wexford after a stint at Sheffield United, has been staking a claim for a recall, while there are several other players across the league on the radar. It’s understood Shelbourne defender Jess Gargan was in the provisional squad last time out.\n“We will continue to look at not just performances on the pitch but how much everybody wants it, on and off the pitch. We look at every aspect,” Ward recently explained.\n“Aoibheann Clancy for example, she hasn’t left me alone since the last camp, wanting to know everything about reviews. She’s so hungry to learn and that’s what you want. Whether it’s Ellen, Alex, the young left-back, we look at every aspect of being a top pro.”\nThe 42 understands Sarah Rowe has been included in recent extended squads. The Mayo multi-sport star helped Central Coast Mariners to historic A-League Women’s success over the weekend, having recently transitioned from winger to right-back.\nRowe is due back to Collingwood for AFLW pre-season this month, but told The 42 that she would “never turn down an opportunity to play for my country”.\nCiara Grant also won a league title with Hibernian in Scotland this weekend, but the Donegal midfielder hasn’t been called up since the 2023 World Cup.\nWard was at Wembley Stadium on Sunday for Chelsea’s FA Cup final win over Manchester United. United’s Aoife Mannion was the only Irish international in action — and is one of the few WSL players still with her club, ahead of the inaugural World Sevens Football tournament in Lisbon this week.\nKatie McCabe will travel to the Portuguese capital for one of the biggest games of her career on Saturday as Arsenal face Barcelona in the Champions League final.\nThe Ireland captain is due to arrive late to camp as a result. The squad report directly to Istanbul on Sunday, ahead of next Friday’s game, with the Páirc Uí Chaoimh showdown against Slovenia scheduled for the following Tuesday.\nWhile question marks may hang over McCabe’s availability for Türkiye, she and Denise O’Sullivan will spearhead tomorrow’s squad. As with before, there will be a familiar core, but perhaps some freshness.\nWard has also not shied away from her plans to draft in dual eligible players, like her predecessors Eileen Gleeson and Vera Pauw. FAI Head of Talent ID and Recruitment, Aidan Price, is operating in that realm, while “one or two (players) made themselves available for the last camp and again this one”.\n“It’s got to be right for squad balance and for us. If we believe they can add value, they’ll be selected,” Ward added. The 42 previously highlighted rising A-League star and American-born forward Erin Healy as one potential candidate, while Kelly Brady — the New Yorker who plays for Ireland U19s — has been in superb form for Athlone Town.\nIn terms of long-term injury absentees, Jamie Finn is back playing minutes after a lengthy ACL recovery, while Jess Ziu (ACL) and Tara O’Hanlon (MCL) are on the comeback trail. Lily Agg is a little further behind. Izzy Atkinson, Ward clarified, is fit and available but has not been selected recently. Megan Campbell joins Grace Moloney as a free agent, having also departed Championship winners London City Lionesses.\nThere will be no shortage of talking points when Ward faces the media tomorrow morning — including Hannah Dingley’s departure as FAI Head of Women and Girls’ Football — but all eyes will be on what should be an interesting squad.",
  "word_count": 933,
  "scraped_at": "2026-02-14T12:23:18.153637"
}