{
  "article_id": "d53866503350",
  "url": "https://www.dailymail.co.uk/lifestyle/article-15419979/Daily-Mail-Power-List-50-women-50-stars.html",
  "title": "The Daily Mail+ Power List of 50 women over 50",
  "date": "20251230T043000Z",
  "domain": "dailymail.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "The skincare guru who banishes lines. The business leaders making millions. The fashion star that makes any woman sparkle... REVEALED: The Daily Mail+ Power List of 50 women over 50\n2025 has been a standout year for women over 50. These powerful females have been winning in everything from television and politics to sport and medicine. In fact there has been no better time to be female and 50-plus.\nAccording to Government data there are more and more women working in the second half of their lives – rising by more than 14 per cent since 2000. In no particular order we celebrate the incredible achievements of all those pioneering scientists, straight-talking campaigners and brilliant entertainers who are over 50 and enjoying every single second of their moment in the spotlight.\n1. Claudia Winkleman, TV presenter, 53\nIt’s not as if the self-described ‘tiny orange lady’ with the heavy fringe, panda eyes and pale lips was an unknown before this year. After all, she started appearing on our screens back in the late 1990s and, after stints on the spin-off show and the Sunday night results show, has been hosting Strictly Come Dancing since 2014.\nBut this year the addition of celebrities to the Bafta-winning Traitors series drew yet more fans to the show – and to her (not to mention to her Highlands-inspired wardrobe). So perhaps it was little wonder that, alongside Strictly co-presenter Tess Daly, she was awarded an MBE for her contribution to broadcasting in the King’s Birthday Honours.\nWith the two Strictly stars leaving the show, she’s free to pursue other projects, and rumours in the industry are that she’s in talks about her own chat show, a perfect vehicle for her signature combination of wit and warmth – watch this space.\n2. Baroness Heather Hallett, 76, former Court of Appeal judge\nGiven how much she’s achieved in her career to date, you wouldn’t have blamed Baroness Hallett for deciding that rather than chairing the UK’s Covid-19 Inquiry, she would just hang out in the House of Lords (she’s been a Life Peer since 2019).\nSince qualifying as a barrister in the early 1970s, she’s gone on to become one of the highest-ranking women in the judiciary, serving as vice-president of the criminal division and overseeing everything from terrorism cases to the 7/7 inquests with calm, razor-sharp authority.\nHer calm demeanour, crisp questions, no-nonsense tone and visible empathy made The Rt Hon Baroness Heather Hallett DBE (to give her her proper title) the perfect choice to hold ministers, advisers and experts to account, with the damning conclusion that the UK pandemic response was ‘too little, too late’. In an era of bluster, Hallett’s silk-gloved steel has been a masterclass in public service – precise, principled and quietly fearless.\n3. Sarina Wiegman, 56, football manager\nThe Dutch dynamo is the woman who has transformed the Lionesses into the national football team (apparently there is an England men’s team, too) and this year cemented her status as the most successful England football manager ever.\nHaving previously captained her country and managed the Netherlands to a Euros win in 2017 and a World Cup final in 2019, she crossed the North Sea in 2021 and a year later saw England raise the trophy at the 2022 Euros.\nIn 2023 the team were runners up in the World Cup and this year she guided them to a second consecutive Euros win in Switzerland (and her third on the trot) — the first time any England senior side has bagged the top spot in any major competition abroad.\nLittle wonder she was named the world’s best women’s coach at the Ballon d’Or football awards, cementing her status as the FA’s most prized asset and, frankly, UK national treasure in a tracksuit – even made an honorary dame for her services.\n4. Maria Balshaw, 55, museum director\nDirector of Tate (the first female one ever) since 2017, with responsibility for all four galleries and their global reputation, this former academic made her name transforming Manchester’s Whitworth and Manchester Art Gallery. She oversaw their award‑winning expansions, proving regional museums could be both daring and deeply rooted in their communities – and picking up a CBE in 2015 for her work.\nFresh from publishing her book last year – Gathering of Strangers: Why Museums Matter – Balshaw helped Tate Modern celebrate its quarter-century in May and, more broadly, has doubled down on her ambition of transforming the galleries from hushed and stuffy temples into more widely accessible spaces. Her aim is to curate museums that are more inclusive, and more reflective of the world around them. To this end she continues to champion both access to all – with £5 tickets for under-25s – and a range of shows covering, this year, everything from Nigerian modernism and feminist surrealism to radical new media.\n5, 6, and 7. Marion Calder, 55, Trina Budge, 54, and Susan Smith, 53, campaigners\nLeft to right, Marion Calder, Trina Budge and Susan Smith\nThe trio – an NHS administrator, a farmer and a former fund manager – met on Mumsnet, united by their worries about how gender recognition reforms would affect biological women with regard to public board quotas in Scotland. The group they co-founded in 2018, For Women Scotland, shot to the top of the news agenda this year when their challenge to the Scottish government reached the UK Supreme Court, culminating in April with the announcement by Lord Hodge that, in law, ‘sex’ refers only to ‘biological sex’ – a landmark ruling with significant implications not only for public board quotas, but for women’s single-sex spaces throughout the UK.\nDespite being lauded by JK Rowling as ‘extraordinary’, Calder, Budge and Smith say they are just ‘ordinary women’ – though Calder does concede that Rowling has a point when she also calls them ‘tenacious’, admitting ’anger us enough [and] we will just keep going’.\n8. Julia Donaldson, 77, children’s author\nEven if you haven’t read to a child in the last 30 years, chances are you’ve come across the rhyming stories of Julia Donaldson. Her modern classics – The Gruffalo, Room On the Broom, and Zog – have turned reluctant readers into devoted bookworms and netted her an MBE and a CBE, as well as the post of Children’s Laureate.\nAfter studying Drama and French at Bristol, she moved from publishing and teaching into writing songs for children’s TV, before one of them – A Squash and a Squeeze – became her first picture book.\nSince then she has written more than 100 books and in January 2025 it was announced that the number of copies she had shifted catapulted her into the position of Britain’s best-selling author, above JK Rowling, since records began. With total sales now estimated to be more than 50million books, a live tour of her new book Paper Chase – and another story, The Scarecrows’ Wedding, the BBC’s big animation for New Year’s Day – her star’s not waning any time soon.\n9. The Queen, 78, royal advocate\nA long-time campaigner against violence against women, it was revealed this year that Queen Camilla had personal experience of sexual assault. In a book, Power and the Palace by Valentine Low, it was revealed the Queen told Boris Johnson that, as a teenager, she had used her shoe to fight off a man who attempted to sexually assault her on a train.\nSources at the Palace suggest she was reluctant to talk about it, preferring to focus on the victims she now works with. Last year’s ITV documentary Behind Closed Doors showcased her commitment to this work, highlighting the issues involved with domestic abuse. And she’s hardly taken her foot off the gas this year.\nFrom opening a new ‘healing garden’ at the Asian Women’s Resource Centre in London, where she met women recovering from abuse and highlighted the specialist support needed for black and minoritised communities, to hosting events that bring together victim‑survivors, advocates and banking leaders to spotlight economic abuse and push for better systems in finance and law, she continues to speak up for the women who can’t speak for themselves, and to insist that domestic abuse is everyone’s business.\n10. Dame Esther Rantzen, 85, campaigner\nDiagnosed with stage‑four lung cancer in 2023, the indefatigable crusader was given months to live, until a ‘wonder drug’ gave her more time. Perhaps inevitably for a seasoned campaigner, she has spent this ‘bonus’ time doing what she has always done best: turning personal challenge into public change.\nAs the Assisted Dying Bill moved through Parliament this year, she became its most recognisable champion, writing letters to every MP, sparring with critics on TV and urging politicians to vote ‘with compassion, not cowardice’.\nFrom championing children with Childline to alleviating loneliness for older people with The Silver Line, Dame (since 2015) Esther Rantzen – who first found fame as the presenter of That’s Life! – has always been one of life’s advocates and has helped millions of people in her lifetime, making her something of the nation’s unofficial agony aunt.\n11. Maggie Oliver, 70, campaigner\nFormer Greater Manchester Police detective Maggie Oliver is the whistleblower who refused to look away. After years in serious crime, she resigned in 2012 to expose the Rochdale grooming scandal, shining a light on catastrophic failures to protect abused girls and helping inspire the BBC drama Three Girls, which brought the reality of grooming gangs into living rooms across the country.\nIn 2019 she channelled that fury into the Maggie Oliver Foundation, offering legal advocacy and emotional support so adult survivors can, in her words, turn ‘pain into power’.\nThis year she has been everywhere: fronting the #TheyKnew campaign and raising funds for strategic legal action against officials who ignored abuse, advising on the Government’s national audit into group child sexual exploitation, and calmly skewering ‘empty promises’ in a succession of TV interviews. More than a decade on, she is still pushing the state to treat victims as witnesses to crimes, not problems to be managed.\n12. Dame Joanna Lumley, 79, actor\nNearly six decades after her first screen roles, Dame Joanna Lumley is still joyfully over‑employed. While those of a certain age will know her as Purdey in The New Avengers, for another generation she was the champagne‑soaked Patsy in Absolutely Fabulous, (a role she fleetingly reprised alongside co-star Jennifer Saunders at Burberry’s fashion show in September).\nBut with two recent roles in some of the most talked-about dramas on screen, she is very definitely back in her natural habitat of scene‑stealing TV comedy, and has undoubtedly endeared herself to anyone hitherto unaware of her genius.\nAs well as taking on the role of Felicity, the gloriously imperious mother whose passive aggressive asides could strip paint in BBC One’s Motherland spin‑off Amandaland, she has also joined Netflix hit Wednesday as Grandmama Hester Frump, a magically mischievous matriarch created especially for her and quickly expanded.\nFar from easing off, she seems to be treating her late seventies as the start of yet another act.\n13. Nieves Barragan Mohacho, 50, chef\nSince arriving in London from the Basque Country in the late 1990s with limited English and a head full of flavours, Nieves Barragan Mohacho has quietly rewritten the English capital’s Spanish food story. She rose through the ranks at Fino and then Barrafina, where as executive chef she helped it win a Michelin star and turned counter‑top tapas into the hottest ticket in town.\nIn 2018 she stepped out on her own with – which means flavour – in Mayfair, which picked up a Michelin star in its first year and has since become a perennial critics’ favourite for its tour of Spain’s regions, from Galician seafood to Castilian wood‑fired sharing dishes.\n14. Asma Khan, 56, chef\nIndian‑born, London‑based Asma Khan has built a career on turning home cooking and sisterhood into restaurant gold. After moving to the UK to study law, she started a supper club in her home that grew into Darjeeling Express, now a Michelin‑Guide‑listed Soho restaurant famed for its all‑female, all‑South‑Asian kitchen of home cooks, rather than classically trained chefs.\nAlong the way she became the first British chef featured on Netflix’s Chef’s Table, a UN World Food Programme chef advocate and, in 2024, one of Time’s 100 most influential people.\nThis year she became the first patron of the Sodexo Stop Hunger Foundation, proving that food isn’t just delicious, it can also be used for political good.\n15. Ruth Rogers, 77, restaurateur\nFor almost four decades, American‑born, London‑made Ruth Rogers has been something of a doyenne of the London food scene. In 1987 she co‑founded the River Cafe on a Hammersmith wharf with her friend Rose Gray, initially as a canteen for her husband Richard Rogers’s architecture practice. The simple, fiercely seasonal menu and light‑filled room soon made it a destination, earning a Michelin star in 1998 and launching the careers of chefs including Jamie Oliver and Hugh Fearnley‑Whittingstall.\nLast year, she opened the River Cafe Cafe, a more affordable offshoot across the garden that serves River Cafe‑grade ingredients at bistro prices – a smart move when times are as tight as they are. Her podcast, Ruthie’s Table 4, is into its fifth season and continues to attract the great and the good, including Kamala Harris and Cate Blanchett – and yet she’s still found the time to squeeze in her new book Squeeze Me a coffee table ode to the humble lemon.\n16. Sheila Dillon, 81, food journalist\nBritain undoubtedly takes food more seriously now than it did 30 years ago, and you can in no small part thank journalist Sheila Dillon for that. Originally from Lancashire, she worked on New York-based magazine Food Monitor before joining BBC Radio 4’s The Food Programme, where she has helped to turn issues like BSE (commonly known as mad cow disease), GM crops and hospital food from niche worries into national conversations, picking up a shelf of journalism awards and an honorary doctorate along the way.\nIn 2025 she remains at the heart of the UK’s food debate. She has fronted landmark episodes on everything from school dinners and communal dining to the closure of London’s historic wholesale markets and Denmark’s food revolution, and chaired judging for the BBC Food & Farming Awards, which she helped to establish in 2000. She continues to help us see food as more than just pleasure, but as politics, public health and culture too.\n17. Anne Mensah, 53, TV executive\nMensah is one of those largely behind-the-scenes people whose name you won’t necessarily know but who will undoubtedly have had an impact on your life – and your viewing habits. While she’s now vice-president of UK content at Netflix, she’s been a serious player in UK TV for years, starting in script editing and rising through senior drama roles at the BBC and Sky – where she backed projects like Wallander, Patrick Melrose and Chernobyl.\nSince 2019 she’s been at Netflix and this year alone her team has delivered global hits such as the award-winning Adolescence and spy thriller Black Doves – not to mention previous hits such as One Day and Baby Reindeer, which led to Netflix picking up six awards at this year’s TV Baftas, as well as Golden Globes and Emmys.\nBut it’s not just her shows bagging the gongs. She was honoured with the Impact Award at the Black British Business Awards for championing diverse storytelling and named Outstanding Executive of the Year by the British Broadcasting Guild. And, to ensure what she starts is continued, she champions schemes like Bafta Breakthrough that pulls new talent up behind her.\n18. Abi Morgan, 57, screenwriter\nFor more than 25 years Abi Morgan has been creating the sort of work that holds your attention, whether on screen or stage. Born in Cardiff, she cut her teeth on the ITV drama series Peak Practice but has gone on to write some of the strongest real-life-inspired dramas on TV – from Sex Traffic and Tsunami: The Aftermath, to the newsroom thriller The Hour, which won her an Emmy. Eric, starring Benedict Cumberbatch, was one of hers as was divorce law saga, The Split — oh, and that adaptation of Sebastian Faulks’s Birdsong? Yep, hers too.\nIn cinemas you’ll have seen her work through powerful films including Brick Lane, Shame, The Iron Lady and Suffragette. But, on a lighter note, she was responsible for bringing Bridget Jones’s midlife sequel Mad About The Boy to the big screen this year.\nAs for what’s next, word in the industry is she will adapt and direct her own bestselling memoir, This Is Not a Pity Memoir, for TV. Rest assured, Morgan has plenty more stories to tell.\n19. Dame Bobbie Cheema-Grubb, 59, judge\nThe daughter of Sikh Punjabi migrants who grew up in Leeds, Dame Bobbie Cheema‑Grubb has spent her career dismantling the idea that the senior judiciary must look and sound a certain way. Called to the Bar in 1989, she became the first Asian woman appointed Junior Treasury Counsel at the Old Bailey, then QC, before in 2015 making history again as the first Asian woman High Court judge. Along the way she helped reshape how courts treat vulnerable witnesses through the influential Raising the Bar report and prosecuted cases involving abusive clergy and corrupt lawyers.\nThis year she has presided over some of the year’s most closely watched criminal trials, including sentencing former Reform UK Wales leader Nathan Gill for taking pro‑Russia bribes. But beyond the bench, she has been honoured with a Lifetime Achievement Award at the Women and Diversity in Law Awards, celebrated as a trailblazer whose very presence widens the path for others.\n20. Baroness Sue Carr, 61, judge\nBaroness Sue Carr of Walton‑on‑the‑Hill has the kind of CV that makes legal historians sit up. In October 2023 she became Lady Chief Justice of England and Wales – the 98th person to hold the role that oversees the entire judiciary but the first woman in the position’s 750‑plus‑year history.\nCalled to the Bar in 1987 and taking silk in 2003, she built a formidable commercial and professional negligence practice before moving to High Court judge in 2013, and Lady Justice of Appeal in 2020.\nIn 2025 she’s been deep into the hard graft of modernising an overstretched court system. She has used major speeches and select committee appearances to argue for proper investment in the rule of law, technological reform that does not sideline vulnerable court users, and a judiciary that is more representative of the society it serves. At the same time, she continues to sit on significant appeal cases, making clear that even at the very top, judging – not just administration – remains at the heart of the job.\n21. Caroline Hirons, 56, beauty brand founder\nDubbed the most powerful woman in the beauty industry because of her ability to make or break a brand (thanks to the faith placed in her by almost 800,000 Instagram followers) Hirons has held almost every job in the business from counter girl to facialist trainer. Her 2020 bestselling debut book (skinCARE: The ultimate no-nonsense guide) scooped Lifestyle Book of the Year and she launched her own brand Skin Rocks three years ago.\nThis year she stepped things up another gear with a new book focusing exclusively on teen skincare published in June which became an instant bestseller, a slew of new products including a hugely impressive hyperpigmentation serum, and the launch of Skin Rocks Pro, a range of salon-only products and associated facials. With insiders flagging a January 2026 product as an industry first and one to watch, there’s clearly a lot more to come.\n22. Dame Cally Palmer, 67, health leader\nDame Cally Palmer has spent more than two decades proving an NHS hospital can be both world‑class and relentlessly patient‑centred. As chief executive of The Royal Marsden NHS Foundation Trust since the late 1990s, she has overseen its transformation into one of the top cancer centres globally, pioneering a model that combines NHS care, leading‑edge research with the Institute of Cancer Research and a thriving private patient service that feeds money back into frontline treatment. She picked up a CBE in 2004 and a Damehood in 2020 for services to cancer care.\nSince 2015 she has also served as NHS England’s national cancer director, steering national strategy, securing investment for new drugs and diagnostics and chairing the board.\nIn 2025 she announced she would step down from the national role after almost a decade, winning tributes from colleagues for driving earlier diagnosis and improving survival, and freeing her to focus fully on the Marsden’s next chapter – from new research facilities to strengthening its global reputation as a place where patients receive not just treatment, but hope.\n23. Kathy Abernethy, 64, menopause specialist\nMenopause might have become a part of the national conversation in recent years but specialist nurse Kathy Abernethy has been talking about it for much longer than that. After leading an award‑winning NHS menopause service in London, she co‑founded the British Menopause Society, went on to chair it, and helped write its key handbook on menopause management – the text many GPs now reach for when a baffling symptom walks through the door. She is also author of Menopause: The One Stop Guide, a highly regarded book aimed at helping women make informed decisions about treatment.\nThis year her influence has been as practical as it is political. She co‑leads the Coombe Menopause Clinic in south‑west London, offering evidence‑based HRT, testosterone and non‑hormonal treatments, and continues to run The Menopause Course, an education programme that upskills nurses across the UK. Fresh from serving on the healthcare watchdog’s menopause guideline group and finishing a six‑year stint helping to build start-up Peppy’s clinician‑led digital menopause service, she is now a go‑to commentator pushing for calmer, more balanced conversations about midlife health.\n24. Dominique Ludwig, 55, nutritionist\nWhile the rest of the country might be talking about Joe Wicks or Tim Spector, those in the know turn to Dominique Ludwig who, with a masters in clinical nutrition from King’s College London and more than 30 years’ experience, has become one of the UK’s most influential nutritionists.\nAfter early work in the food industry and clinics in Germany, she now runs Dominique Ludwig Nutrition, heads the nutrition department at the Meyer Clinic in Chichester, West Sussex, and works as a secret weapon nutritionist to high‑profile clients and Oscar‑winning actors, as well as imparting her knowledge to more than 700,000 followers on Instagram.\nHer trademark is a no‑nonsense, research‑led approach that focuses on blood sugar balance, gut health and eating real food, rather than endless restriction.\nThis year, building on her award‑winning Renew Reset Recharge 28-day online plan, she has launched The Triple 30, with its focus on 30g of protein per meal, 30g of fibre a day and 30+ plants a week. She’s also found time to write a cookbook, No‑Nonsense Nutrition (out in February), and is fast becoming the go‑to voice for women who want straight‑talking, sustainable, science-based advice on how to eat well.\n25. Ruby Hammer MBE, 64, make-up artist and founder\nThere are a handful of women in the fast-paced beauty industry who have managed to remain relevant and high profile for several decades, and Ruby Hammer is one of them. Born in Nigeria to Bangladeshi parents and raised in the UK, she worked her way from restaurant shifts to assisting backstage at London Fashion Week, before becoming a go‑to make-up artist for Vogue, Elle and for supermodels including Kate Moss and Naomi Campbell.\nIn 2007 she was awarded an MBE for services to the cosmetics industry after co‑founding high‑street game‑changer Ruby & Millie and helping introduce brands such as Aveda and L’Occitane to British shoppers.\nToday her focus is Ruby Hammer Beauty. Launched in 2019, this tightly edited line of clever, multitasking products is designed to make make-up quicker and more intuitive. In 2025 she’s stepped it up a notch, winning a Who What Wear Next in Beauty award for her nail tool, picking up a CEW UK Achiever Award, expanding retail partnerships and extending the shade range of hero products like the Lip Serum Balm that blurs the line between skincare and colour.\nHer message – that true beauty is ageless, inclusive and rooted in confidence – lands louder than ever.\n26. Dame Debbie Crosbie, 55, banker\nScottish‑born Dame Debbie Crosbie is one of the most powerful figures in British retail banking today. After joining Clydesdale Bank as a graduate trainee, she rose to chief operating officer, steering its de-merger and stock‑market listing, then took on the poisoned chalice of TSB in the wake of its IT meltdown, leading a turnaround that dragged the bank back into profit. In 2022 she became the first female chief executive of Nationwide Building Society in its 175‑year history.\nThis year has been a landmark even by her standards. She completed the £2.9billion acquisition of Virgin Money, announced record results, presided over Fairer Share – profit-share cash payouts to millions of members (even if some of them raised an eyebrow about her 43 per cent pay rise) – and committed to keeping all branches open until at least the start of 2030.\nIn June she was made a Dame for services to financial services, later received the Freedom of the City of London, and in December was appointed the Government’s new Women in Finance Champion, tasked with boosting female representation at the top of the sector.\n27. Dame Amanda Blanc, 58, insurance chief\nIf you’re not nose-deep in the money pages, you might not know Welsh‑born Dame Amanda Blanc, a queen in the world of insurance. She started as a graduate at Commercial Union (which later became part of Aviva) and held senior roles at Groupama, Towergate, AXA and Zurich, before becoming the first woman to chair both the Association of British Insurers and the Insurance Fraud Bureau.\nIn 2020 she returned to Aviva as group chief executive and has spent the past five years simplifying the business, selling off non‑core operations, strengthening the balance sheet and refocusing on the UK, Ireland and Canada.\nThis year saw the completion of a £3.7billion acquisition of Direct Line, cementing Aviva’s status as Britain’s largest insurer, with operating profits up more than 20 per cent on 2024, and shares at their highest level in almost 18 years.\nRenowned for being uncompromising and detail-oriented, she recently stepped down as HM Treasury’s Women in Finance Champion, but continues to be a political force, advising Chancellor Rachel Reeves on the creation of a national wealth fund.\n28. Dame Emma Walmsley, 56, pharma chief\nAt the end of this year Dame Emma Walmsley will leave her position as chief executive of GSK, one of Britain’s biggest drug companies. Since taking up the role in 2017, when she became the first woman to lead a major pharmaceutical company, she has restored GSK’s position in oncology and helped them double down on vaccines.\nAs one of the highest-paid chief executives in the UK (last year she pocketed £10.6million and this year could take home as much as £21.6million), her take-home reflects her value to the company. She’s been instrumental in separating out GSK’s consumer arm, Haleon, which includes the likes of Sensodyne and Panadol, and on her watch both profits and FDA approvals have gone up.\nShe will stay on for most of 2026 to oversee a smooth handover and, while she hasn’t announced her next role, nobody’s expecting her to retire just yet.\n29. Caroline Quentin, 65, actor/gardener/artist\nWhile her on-screen role as the long-suffering girlfriend of Men Behaving Badly’s Gary (Martin Clunes) shot her to fame in the 1990s, more than 30 years later Caroline Quentin is still picking up plum roles, on stage and screen – most recently Arcadina in The Seagull at the Royal Lyceum in Edinburgh.\nBut alongside her acting work, she’s quietly been growing in another direction, with plants and paint taking centre stage. A lifelong container‑gardener, she graduated from window boxes to a rambling Devon plot and now to a new cottage garden in Somerset, sharing the whole muddy, joyous process with a large online community via her 200,000-strong CQ Gardens Instagram account. Her pivot was completed by Drawn to the Garden, a bestselling British Book Awards‑shortlisted blend of memoir, planting notebook and her own watercolours.\nThis year has seen a live tour spun out of the book and a host of covetable gifts – from tea towels to cards, gardeners’ hand cream and soap (created with her talented skincare-brand owning husband, Sam Farmer), all adorned with her beautiful art.\nNow that’s how you write a second act.\n30. Margherita Della Valle, 60, telecoms chief\nIt’s increasingly rare these days for someone to spend their entire career at the same company, but that’s exactly what Margherita Della Valle has done. Now London-based, the Bocconi University graduate first joined Omnitel (now Vodafone Italy) in the 1990s and rose through the ranks, from marketing analyst to group CFO and, in 2023, became Vodafone’s first female chief executive – one of a handful of women at the head of a FTSE-100 company.\nReshaping, or ‘rightsizing’, the company has been her goal since taking the top job and 2025 has been the year where plans came good. She’s overseen the sale of Vodafone Italy (hot on the heels of last year’s sell-off of Vodafone Spain), pushed ahead the £16.5billion merger with Three and has committed £11billion to building the UK’s best 5G network.\nThe result? Since January shares are up by almost 40 per cent. That’s very definitely not phoning it in.\n31. Nnena Kalu, 59, artist\nWhile her name might not yet be as familiar as the likes of Damien Hirst, Grayson Perry, Rachel Whiteread and Anish Kapoor, the latest winner of the Turner Prize, Nnena Kanu, has been working on her craft since the late 1990s.\nAutistic and with limited verbal communication, she’s the first artist with a learning disability to win the UK’s top art prize but has been in the art world since the 1990s, creating instantly identifiable ‘cocoons’ of tape, fabric and paper that grow into bold hanging sculptures and compelling floor‑filling installations, as well as abstract drawings.\nBorn in Glasgow to Nigerian parents and now based in London, her history-making win has been described as ‘seismic’, while other disabled artists have spoken about how she has inspired them, changing what they dare to dream of for themselves.\n32. Clare Waight Keller, 55, fashion designer\nTrained at Ravensbourne College of Art and the Royal College of Art, Clare Waight Keller cut her teeth at Calvin Klein, Ralph Lauren and Gucci before taking the role of creative director at Pringle of Scotland and later Chloé.\nIn 2017 she moved to Givenchy as its first female artistic director, designing both menswear and couture and, most famously, Meghan Markle’s wedding dress, which was probably when she caught the eye of non-fashion types, too.\nExcitingly for High Street shoppers, her latest role is less haute couture. Having launched the design-led Uniqlo:C line in 2023, she was appointed Uniqlo’s overall creative director in autumn 2024. Her influence in creating functional yet stylish pieces in cuts that endure (at prices we can afford) has been apparent throughout this year’s collections, leading some to dub the Japanese store as a purveyor of stealth luxe looks for those without a stealth luxe budget.\nDemocratisation of great design — how quintessentially 2025.\n33. Dame Mary Berry, 90, cook and broadcaster\nLong before she became the nation’s grandmother‑in‑chief on The Great British Bake Off, Mary Berry was a demonstrator for the Bath Electricity Board, driving to customers’ houses and baking Victoria sponges to show people how their new ovens worked. Training at Le Cordon Bleu and a stint at the Dutch Dairy Bureau led to an extraordinary media career with stints in magazines, numerous cooking shows and more than 80 cookbooks to her name.\nIn 2025 she has marked both her 90th birthday and 60 years in food with a flurry of celebrations, including a special episode of The One Show, an appearance in Vogue – she was picked as one of the faces for designer Holland Cooper’s latest fashion campaign – and a bestselling book, Mary 90: My Very Best Recipes, complete with accompanying tour and a six‑part BBC series. There was also, of course, a slot in the December schedules for A Mary Berry Christmas.\nThis is one designer-clad dame who won’t be hanging up her pinny any time soon.\n34. Paula Sutton, 56, writer, stylist and author\nAfter years in London fashion PR and publishing, Paula Sutton swapped sample rails and shows for a Georgian house in rural Norfolk – and accidentally created one of social media’s most joyful corners. (Vogue dubbed her The Happiest Influencer on Instagram). Her Hill House Vintage blog – now an Instagram account with more than 610,000 followers – began as a way to chronicle family life and showcase her interior decor, but its blend of chintz sofas, frothy dresses and sun‑drenched lawns epitomised the ‘cottage-core’ obsession that gripped social media and has catapulted her into a new career — or careers.\nSince 2023, she’s been one of the hosts of Channel 4’s Millionaire Hoarders; last year she penned her first cosy crime novel The Potting Shed Murder; and this year has added Country Living columnist to her CV with a regular slot reflecting on the realities of village life behind the pretty pictures.\nThis year also saw the launch of her second cosy‑crime novel, The Body in the Kitchen Garden, plus a collaboration with sofa.com – there’s no doubt she’s sitting pretty, in every sense.\n35. Sarah Burton, 51, creative director\nThe last year has been one of great upheaval in the world of high fashion. Jonathan Anderson left Loewe, the Spanish brand that he’d taken from languishing to loved, to move to Dior. Over at Chanel, Matthieu Blazy took over from longtime Karl Lagerfield collaborator Virginie Viard. Finally and perhaps most significantly, Sarah Burton left her role as creative director of Alexander McQueen to begin a new role at Givenchy. Embracing a sensuality and feminine allure, her first two collections for the label this year (Autumn/Winter 25 and Spring/Summer 26) have already made the move a critical success. Indeed at the beginning of this month, she won womenswear designer of the year at the British Fashion Awards for her work since joining the brand.\nShe has cited much of her inspiration for her recent collections as being founded in the exquisite tailoring of Hubert de Givenchy’s earliest designs. We cannot wait to see what she will send down the runway next.\n36. Val Garland, 66, make-up artist\nFrom Alexander McQueen fashion shows all the way through to Lady Gaga album covers and quirky 1980s music videos, when you think of your favourite famous face, there is every chance that Val Garland has done their make-up. But she didn’t always want to be a make-up artist. She began her career by dropping out of school aged 15 and working in a hair salon in Bristol. She moved to Australia on a whim and, after years of doing hair and opening her own salons, she moved back to London with the intent of becoming a make-up artist.\nToday, Garland is the global director of L’Oréal Paris and a judge on BBC’s Glow Up: Britain’s Next Make Up Star. Celebs who love her include Helen Mirren and Lady Gaga, but she doesn’t just have fans in the starry world of showbiz, her Instagram is followed by 766,000 people.\n37. Gabby Logan MBE, 52, TV presenter\nFollowing in the footsteps of Gary Lineker is no easy task, yet Match of the Day is safe in the hands of Gabby Logan. A former rhythmic gymnast who represented both Wales and Great Britain, she understands the world of competitive sport from the inside out.\nSince her time at Durham University where she briefly dabbled in radio, Gabby has carved a lasting career in broadcasting, from Sky and ITV sports to Final Score on the BBC, where she worked until 1998 before moving to ITV.\nThis year she has led the coverage of two major women’s sporting tournaments – the Euros and the Rugby World cup. Both of which England won. She must be a lucky charm.\n38. Collette Roche, 50, football executive\nOne of the most senior women in English football, Collette Roche took on the role of Manchester United’s chief operating officer in 2018, after roles at Ford, Siemens, United Utilities and Manchester Airports Group. She’s the first woman to hold the role – and it’s not as if she was passed an easy ball. United are no longer in their 1990s heyday and have been through five managers since she took over.\nPart of her goal has been to improve facilities for the women’s team, and this year saw them making their third consecutive FA Cup final (even if they’ve only won one of those three). Crucially she’s now spearheading United’s push for a new £2billion stadium, describing it as a ‘once in a lifetime opportunity’ that will not only help the team, but also support the local area with a predicted 17,000 new homes and 1.8million additional visitors to the area each year.\nIn March this year, Roche was rumoured to be the leading candidate for the chief executive position at Newcastle United. Although the transfer never happened, it’s a clear sign of just how highly she’s thought of in Premier League executive circles.\n39. Dame Katherine Grainger, 50, athlete\nIt has been a stratospheric year for Glaswegian athlete Dame Katherine Grainger. The 2012 Summer Olympic gold medallist, four-time Olympic silver medallist and six-time World Champion for Great Britain, was appointed head of the British Olympic Association – the first woman to take on the role in its 120-year history.\nIt’s clear she doesn’t lack the experience for the job: not only is she Britain’s joint most decorated female Olympian, but she’s also chaired UK Sport for eight years. On top of that she found the time to act as the Chancellor of Oxford Brookes University between 2015 and 2020 and is currently Chancellor of the University of Glasgow.\n40. Sharron Davies, 63, campaigner\nWith a swimming career spanning more than 20 years, and an Olympic silver medal in 1980, Sharron Davies was already a household name before her latest incarnation as campaigner for women’s rights in sports.\nA relentless and vocal advocate for the separation of sporting categories by sex, this year she launched the campaigning Women’s Sports Union with round-the-world yachtswoman Tracy Edwards. To cap off a year of all round heroism, in December she was named a new Conservative Peer in the House of Lords by Tory leader Kemi Badenoch.\n41. Vivienne Lewis, 63, businesswoman\nIt seems 2025 has been the year for women at the top of their game in the world of football. For Vivienne Lewis, daughter and heir to Joe Lewis, who bought Tottenham Hotspur in 1991, it could not be a more apt description.\nChief cheerleader at the north London club, where she’s apparently known as ‘Viv’, she’s the senior managing director of Tavistock Group, which owns the English National Investment Company – the majority shareholders at Spurs. To top it all off, Lewis is involved in running the family’s reportedly vast private art collection.\n42. Dame Kristin Scott Thomas, 65, actress\nFrom her pitch-perfect demonstration of repressed English yearning in Four Weddings and a Funeral to that monologue in TV series Fleabag, which brought her a whole new generation of fans, there are few actors who are as adored and respected as Kristin Scott Thomas.\nThis year has seen her once again winning plaudits for her portrayal of Diana Taverner in the fifth season of gritty spy comedy Slow Horses. Her depiction of the ice queen of MI5 captures the character’s composure and repressed feminine rage in a way that has resonated with viewers globally.\nNext summer she is slated to return to the stage as the lead in the West End run of Chekhov’s The Cherry Orchard.\n43. Dame Tracey Emin CBE, 62, artist\nFrom a tent appliqued with the names of past lovers and friends to an unmade bed that sold for almost £2.5million, Tracey Emin has never done art by halves. Since the 1990s she has poured autobiography into her work, becoming one of Britain’s most recognisable – and divisive – artists.\nA bladder cancer diagnosis in 2020 prompted a shift towards works that reflect the vulnerability of the female body and touch on themes of illness and survival, but also made her think about her legacy.\nMajor solo shows this year in Florence and at Yale’s Center for British Art, not to mention an appearance ‘in conversation’ at Frieze Masters, prove she’s just as relevant as ever. A point cemented by the announcement next year Tate Modern will host a major exhibition of her 40-year career.\n44. Kate Winslet, 50, actor/writer/director\nAlready an Oscar, Emmy and Bafta winner, Kate Winslet has spent 2025 adding new job titles to an already crowded CV. ‘Activist’ is nothing new – she’s always spoken out about body-shaming and the way women are treated within the industry – but this year marks her debut as a director.\nGoodbye June, a Christmas family drama for Netflix, is based on a script by her son Joe Anders and stars Helen Mirren, Toni Collette and Andrea Riseborough – as well as Winslet, who also produced the film.\nAdd a forthcoming HBO limited series Trust, which she executive produced as well as starred in, and 2025 looks like the year she’s fully claimed her place behind the camera as well as in front of it.\n45. Bernardine Evaristo, 66, writer and literary activist\nWhile Bernardine Evaristo started her career in theatre, co-founding Theatre of Black Women in the 1980s, it is as a writer that she has become a part of the national consciousness. Born in Woolwich, south-east London, to an English mother and Nigerian father, she’s long shown that everyday black experience belongs at the heart of British literature with novels The Emperor’s Babe, Mr Loverman and the Booker winning Girl, Woman, Other.\nThis year she received the one-off Women’s Prize Outstanding Contribution Award, a £100,000 honour for her body of work and ‘transformative influence’ (which she donated to fund a new RSL prize celebrating pioneering women writers), while the BBC adaptation of Mr Loverman scooped two Baftas.\n46. Dame Maggie Aderin-Pocock, 57, space scientist and TV star\nAs a dyslexic child growing up on London council estates, Maggie Aderin Pocock was inspired by the Clangers and the moon landings, telling anyone who would listen she wanted to go into space. Despite a lack of support from her teachers, she hit the physics books anyway and a degree and PhD from Imperial led to work on missile warning systems, hand-held landmine detectors, the Gemini telescope in Chile and, later, instruments for the James Webb Space Telescope.\nAlready beloved as co-host of BBC Four’s The Sky at Night, she was chosen to deliver this year’s Royal Institution Christmas Lectures, celebrating the 200th anniversary of the educational event with an ‘epic voyage through time and space’ on BBC Four that doubled as a love letter to telescopes and curiosity.\nThis year her alma mater, Imperial, has named her its Distinguished Alumni winner, and there is also talk of future missions that might yet get her a little closer to the stars she’s spent a lifetime admiring.\n47. Mariella Frostrup, 63, broadcaster and campaigner\nOnce best-known for late night arts shows and book interviews, Mariella Frostrup has now become one of the UK’s leading voices on women’s midlife health. As the Government’s Menopause Employment Ambassador, she has spent the year talking to ministers, civil servants and employers about practical changes that keep midlife women in the workforce. On the back of the success of her co-authored book, Cracking The Menopause, she has co-authored another, Menolicious, a bestselling cook book packed with hormone supportive recipes.\nHer drive to make menopause care a fundamental part of healthcare received a boost this year after the Government agreed that menopause advice should be added to free NHS health checks, ensuring millions more get the support they need.\n48. Victoria Beckham, 51, designer and beauty founder\nBeyond the family fallout with Brooklyn, Victoria has had a cracking 2025. Her three-part Netflix documentary tracking her rise from Spice Girl to serious designer was one of the year’s most eagerly awaited binges, while her fashion collections drew some of her best reviews yet.\nThe beauty business hasn’t been slacking either. Victoria Beckham Beauty was behind one of the year’s buzziest complexion launches, with the £104 Foundation Drops – a cosmetic/skincare hybrid with input from Augustinus Bader – having beauty editors in raptures.\nOh, and with husband David made a Sir this year, Posh – sorry, Lady Beckham – can really live up to her best-known label.\n49. Professor Anne Trefethen, 63, computing and AI leader\nYou might not know her name, but Anne Trefethen is one of the biggest brains in tech and at the forefront of the responsible use of AI in the UK. Trained as a mathematician and computer scientist, she built her reputation in high-performance and scientific computing on both sides of the Atlantic.\nSince 2005 she’s been in Oxford, where she founded the Oxford e-Research Centre, became the university’s first chief information officer and now serves as pro vice-chancellor (people and digital) and professor of scientific computing, as well as a fellow of the Royal Academy of Engineering, a trustee of the Alan Turing Institute and co-host of AI UK 2025, the UK’s national showcase of data science and artificial intelligence. Phew.\nWhere Oxford leads, others follow, so the fact that this year she’s overseen the rollout of ChatGPT Edu and other generative AI tools to staff and students might indicate the UK’s direction of travel. If that’s the case, best that someone like her – who believes AI should be used in ways that are positive, equitable, and grounded in human experience – is at the helm.\n50. Davina McCall, 58, presenter and midlife champion\nAfter three decades of live TV – from Big Brother to The Masked Singer – Davina McCall has become Britain’s go-to ringmaster for high-emotion, big-hearted entertainment. And she’s showing no signs of slacking, despite undergoing two serious surgeries this year – to remove a brain tumour and for early-stage breast cancer.\nThis year she’s been a multimedia queen with a book Birthing about pregnancy and a podcast Begin Again which has gone from strength to strength with guests such as Gillian Anderson and Richard E Grant. And, of course, TV, with Stranded on Honeymoon Island, a BBC One dating show for newly matched couples that critics hailed as a kinder, more relatable Love Island.\nAway from TV, she secretly married long-time partner, hair stylist Michael Douglas after the pair got engaged earlier this year.\nCompiled by Liz Hartley, Group Editorial Legal Director DMG Media; Justine Hancock, Assistant Editor (Health); Alex Brummer, Consultant Editor; George Bond, Sports Editor Mail+; Dinah van Tulleken, Fashion Editor; Claire Coleman, Beauty Expert; and Rosie Beveridge, Features Assistant.",
  "word_count": 7894,
  "scraped_at": "2026-02-14T12:13:34.415625"
}