{
  "article_id": "d544d375b07e",
  "url": "https://www.theguardian.com/australia-news/2025/may/08/morning-mail-thursday-ntwnfb",
  "title": "Morning Mail : India  must suffer , says Pakistan PM , Albanese takes aim at defeated Green , black smoke from the Vatican | Australia news",
  "date": "20250507T220000Z",
  "domain": "theguardian.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Morning everyone. Pakistan’s prime minister has authorised “corresponding” retaliation after an Indian missile attack killed 31 people and said his country’s rival “must suffer the consequences”. We have live updates, reports and analysis amid concerns about an escalating conflict.\nAt home, Anthony Albanese has blasted an outgoing Greens MP and there’s a winner in the cookbook wars – for now. In Rome, cardinals have begun voting for a new pope, but a puff of black smoke signalled that they hadn’t picked their man on day one.\nAustralia\n-\nBake off | Recipe book writer Nagi Maehashi has beaten cupcake queen Brooke Bellamy at the publishing industry’s annual awards, as Maehashi and other authors accuse Bellamy of plagiarism. Look out for our Full Story podcast on the controversy further down.\n-\nFactional ‘shenanigans’ | Labor MPs from the party’s New South Wales right faction say any move to cut their numbers in the next ministry would be a backwards step for Labor, amid concerns the industry minister, Ed Husic, or another Sydney-based frontbencher could be demoted.\n-\nDocument test | Google is considering allowing people to store and share identification documents such as their passport or driver’s licence on their phone in a move it argues would help enforce the upcoming social media ban for under 16s.\n-\nEthical question | An ethical super fund is pushing for QBE to overhaul its coverage policies amid criticism the insurer can underwrite fossil fuel projects without restriction while blaming the climate crisis for steep premium rises.\n-\nElection fallout | Anthony Albanese says Max Chandler-Mather should look in the mirror after the former Greens MP described workplace culture in parliament as “bloody awful”. Keep track of the final election counts here.\nWorld\n-\nSmoke signal | Smoke has emerged from the Sistine Chapel after Catholic cardinals began their conclave to decide the next pope – but it was black, not white, indicating they haven’t yet reached a decision. You can catch up with how it all works here.\n-\nKashmir clash | Pakistan has authorised its military to take “corresponding” retaliatory action against India after a missile attack by the Indian air force killed 26 across Pakistan, raising fears of an escalating conflict between the two nuclear-armed countries. Follow developments live. Our correspondent suggests that neither country can afford a showdown, but who will talk them down? And who are the groups behind Pakistan’s “terrorist infrastructure”?\n-\nCold war | Denmark will summon the US ambassador to Copenhagen to respond to reports that US intelligence agencies have been ordered to increase espionage in Greenland.\n-\nTory extinction warning | The former UK chancellor Jeremy Hunt has warned that the Conservatives risk becoming extinct because of a “massive earthquake” in politics fracturing the old two-party system.\n-\nSuccession clue | A hearing before Nevada’s high court today could provide the first public window into a secretive legal dispute over who will control Rupert Murdoch’s empire after he dies.\nFull Story\nNagi v Brooki: does anyone really own a recipe?\nLifestyle editor Alyx Gorman speaks to Nour Haydar about the recipe plagiarism allegations that have caused a stir in the cookbook world.\nIn-depth\nFrom inaccurate (and nonexistent) polling to a years-long ground game by the Labor challenger Ali France, and from national factors to the impact of a local independent, our Queensland correspondent Ben Smee unpicks how Peter Dutton became the first opposition leader to lose his seat. And talking of polls, observers give pollsters a pass for getting the margin of Labor’s win wrong but raise questions over why all the surveys were very similar.\nNot the news\nAs an antidote to Australia’s image as being “hot and all beach”, the photographer Simone Rosenbauer set out to record the small-town museums that archive Australiana such as the apple industry, old shops and an underground hospital in Mount Isa.\nSport\n-\nSurfing | Steph Gilmore, the world’s most successful women’s surfer, is back in action from a two-year furlough and is not ruling out a tilt at a ninth world title even though some competitors were not even born when she started out.\n-\nBasketball | The Minnesota Timberwolves coach, Chris Finch, said the team’s star, Anthony Edwards, did not pull his weight as his team suffered a 99-88 loss against a Steph Curry-less Warriors in their opening NBA playoff game.\n-\nFootball | Can this morning’s Champions League semi-final second leg between PSG and Arsenal be as good as yesterday’s Inter-Barcelona classic? Find out here.\nMedia roundup\nNSW’s police chief was forced out of office early by a toxic web of internal discontent and media criticism, according to the Sydney Morning Herald. As Adam Bandt exits parliament, analysis in the Age says the party of protest might have protested too much. The Monash University medical science pioneer Prof Rinaldo Bellomo, whose research into intensive care medicine saved millions, has died aged 67, the Herald Sun reports. Tasmania’s long-dreamed ambition of having an AFL dream will hinge on a vote in the state parliament, the Mercury reports.\nWhat’s happening today\n-\nMelbourne | Verdict in the case of pianist Jayson Gillham who is suing Melbourne Symphony Orchestra for cancelling his concert over Gaza comments.\n-\nBusiness | Climate protests expected outside Woodside AGM at 10am.\nSign up\nIf you would like to receive this Morning Mail update to your email inbox every weekday, sign up here, or finish your day with our Afternoon Update newsletter. You can follow the latest in US politics by signing up for This Week in Trumpland.\nBrain teaser\nAnd finally, here are the Guardian’s crosswords to keep you entertained throughout the day. Until tomorrow.",
  "word_count": 944,
  "scraped_at": "2026-02-14T12:53:41.242680"
}