{
  "article_id": "d5617eb8ed9a",
  "url": "https://virginiabusiness.com/virginia-tech-president-sands-nih-funding-defense/",
  "title": "Virginia Tech president defends NIH research funding",
  "date": "20250502T154500Z",
  "domain": "virginiabusiness.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Kate Andrews //May 2, 2025//\nSUMMARY:\n- President Sands warns NIH funding cuts could cost Virginia Tech $13M\n- DEI offices shut down across Virginia colleges amid Trump orders\n- Tech’s federally funded research tops $550M annually\n- Sands leads Innovation Campus growth, tackles NIL issues in NCAA\nAs college administrators nationwide navigate funding challenges and difficult choices in the second Trump administration, most university presidents aren’t writing public letters about the times we live in.\nBut Virginia Tech President Timothy Sands did just that. In a Feb. 10 letter to the university community, he addressed the White House’s attempt to cap indirect cost reimbursements for National Institutes of Health research, funding that helps maintain labs and other facilities. The move, Sands wrote, could result in a $13 million hit to Virginia Tech’s total sponsored research budget, which was $453.4 million in 2024.\nAnd while $13 million might not be an emergency for a large institution like Tech, the overall NIH cutbacks — in addition to other federal budget slashes anticipated — would have a “debilitating effect” on research universities to “carry out their mission,” Sands wrote. “Lives will be lost due to the corresponding reduction in the pace of biomedical research. It will degrade the nation’s ability to compete in a global technology environment, threaten our national security, and impact the economies of the states and localities that host these institutions.”\nVirginia Tech’s total federally funded research expenses in fiscal 2024 exceeded $308 million, he noted, with direct spending of $235 million and $73 million going to facilities and administrative reimbursement.\nMeanwhile, in an effort to protect their federal funding, public universities across the nation are closing their diversity, equity and inclusion offices and ending other DEI initiatives, under orders from President Donald Trump.\nSo, in late March, Virginia Tech’s board of visitors voted to dissolve the university’s Office for Inclusive Strategy and Excellence after the University of Virginia and Virginia Commonwealth University’s board members did the same.\nIn an April town hall meeting on Tech’s campus that was streamed online, Sands explained that total federal funding at Tech amounts to about $550 million a year, and that it represents significant leverage.\n“Just to give you an overall perspective, our overall operating budget is $2.3 billion, so $550 million is a big chunk of that,” Sands said.\nRegarding the Tech board members’ move to dissolve the university’s diversity office, Sands said that “every board of visitors at the major universities in Virginia has done the same thing or almost exactly the same thing. … You should know that the [Virginia Tech] Board of Visitors is trying to protect the institution. You may disagree with how they are doing it, but that is what they are trying to do.”\nIt comes down to power wielded by the federal government and who’s in the White House, but the option of withholding federal funding “has been a consistent threat,” Sands said. “They rarely use that hammer. The difference now is that you can see the federal government is swinging that hammer rather wildly, and then they are asking questions later. It is just hard to know where that is going to end up.”\nIn an interview with Virginia Business, Sands says that several of his university’s researchers working on projects funded by federal grants and contracts received stop-work orders from the federal government, although some projects have resumed. “It’s a wait-and-see kind of situation.”\nAs reported about other Trump policy changes, some of the decision to place stop-work orders on research projects appear to have been “done by word search,” Sands says. “They were looking for certain words, and they wanted to pause anything that had those words in the description of the work.”\nAlthough Sands didn’t specify which words were flagged, in February, The Washington Post reported that research projects at the National Science Foundation with the descriptive words “women,” “diverse,” “trauma” and “equity” were among those halted, at least temporarily. Sands notes that at Virginia Tech, “it was a pretty small percentage of what we do, to be honest, and hopefully will remain that way.”\nBut massive cuts to the U.S. Agency for International Development — the federal agency that was responsible for civilian foreign aid and development assistance worldwide, which was essentially shut down by the White House — has also impacted some of Virginia Tech’s research, particularly involving agriculture, Sands says. “As a land-grant institution, we do a lot in agriculture, and we’re globally engaged in diversity, so most land-grants had that challenge around USAID.”\nAs for NIH grants, biomedical research is “a very fast-growing area for Virginia Tech,” particularly at the Fralin Biomedical Research Institute and the Virginia Tech Carilion School of Medicine, Sands says. “We have the second fastest-growing NIH portfolio in the country.”\nSands’ decision to write a public letter and speak openly about White House policy is relatively rare among his higher education cohorts, as they try to protect their funding and not rile up the powers that be.\n“I don’t comment too often on things that could be regarded as political,” Sands says. “But the reality is this one had direct impact on the institution, so I felt the need to at least explain the impact of that decision, if the federal government were to follow through on that.”\nNot only would cuts to research funding affect Virginia Tech’s future in drawing global talent to Virginia, but they also could impact students from around the state who benefit from paid internships made possible by federal funding, he adds.\n“Those two initiatives — when something touches those — I’m going to speak out,” Sands says.\nTrained as a materials engineer with expertise in LEDs, nanotechnology and microelectronics, Sands is in his 11th year leading Virginia Tech, and he has been instrumental in expanding the university’s presence beyond its origins in Blacksburg, most prominently in Alexandria, where the university’s $1.1 billion Innovation Campus opened its first academic building in late February, housing graduate programs in computer science, computer engineering and business.\nTech’s Innovation Campus, as well as the state’s Tech Talent Investment Program initiative to produce 32,000 more computer science and engineering graduates over two decades, were widely cited as major factors in Amazon.com’s 2018 decision to build its East Coast HQ2 headquarters in Arlington County.\nSands also has overseen significant growth in enrollment and applications. In 2019 and 2020, Virginia Tech reached 30,000 undergraduates for the first time, and undergrad enrollment has grown to about 31,000 today, Sands says. This academic year, the school received 58,000 applications for undergraduates, “three times what it was a decade ago,” he notes, “so that means we’re much more selective than we really want to be, to be honest.”\nThat’s placed some stress on the campus. “We’ve pretty much hit the limit in terms of the capacity of the campus and in the surrounding community in Blacksburg, and we have a project going on called Partnerships for Progress, which engages the local jurisdictions in a sort of joint planning, so we can plan for a future where we might grow,” Sands says. “I think our growth potential is probably more outside of Blacksburg now.”\nSands also chairs the NCAA Division I Board of Directors, a post he assumed in August 2024. The board governs Division I policies, particularly the relationship between college sports and their universities. At the moment, D1 schools are grappling with relatively new name, image and likeness (NIL) payment rules for student athletes and the loosened NCAA transfer portal policy, which have together radically changed athletics at most larger universities.\nUnlike in the past, student athletes — primarily in football and men’s and women’s basketball, but increasingly in other sports — often transfer to new schools after a year or two to secure higher NIL payments, creating instability for coaches who now must recruit incoming freshmen as well as players in transfer portals.\n“This past year has been particularly challenging, because name, image and likeness in its original manifestation back in 2021 was intended to be not used for inducement for play, or pay for play,” Sands says.\nAlthough the NCAA has attempted to adjust the system, temporary court injunctions have hampered rules enforcement, Sands notes. “That has created a period of chaos, where institutions that have a lot of money can dump it on NIL, and scrutiny has not been there because legally everybody’s handcuffed.”\nThe Atlantic Coast Conference, in which Virginia Tech is one of 18 member teams, has struggled to produce strong men’s basketball teams in the era of NIL and the transfer portal, and prominent voices like former Duke basketball coach Mike Kryzyzewski have called for change.\nHowever, the expected settlements of two lawsuits embroiling the NCAA and its five power conferences — the ACC, Big 12, Big Ten, Pac-12 and SEC — are expected to eventually calm some of the chaos.\nIn addition to $2.85 billion in backpay to former D1 athletes, there will be a cap on future NIL payments, which will prevent colleges or fans with the biggest pocketbooks from outbidding everyone else, at least to some degree, Sands notes. “It won’t be impossible, but it’ll be much harder for an institution — or a booster — to essentially pay to have someone play at a particular institution.”\nInstead, starting July 1, student athletes will receive shares of the revenue “they help generate, which is really the source of the tension that’s been created over the last couple of decades, this huge amount of money coming in from television for media contracts,” Sands says. “So, I think we’re entering potentially into a much more stable and more competitive environment where the ACC, for example, should be able to restore some of its competitiveness.”\nAt Virginia Tech, Athletics Director Whit Babcock “has been a great resource through this,” Sands says. Once the NIL settlements are in place, “I think some of that normalcy will return. I think the coming year will be chaotic, but hopefully it’ll settle down.”\nFounded\nFounded in 1872 as a public land-grant university, Virginia Tech was originally known as Virginia Agricultural and Mechanical College. Renamed Virginia Polytechnic Institute and State University in 1970, the school manages a research portfolio of more than $556 million.\nCampus\nVirginia Tech’s main campus in Blacksburg stretches over 2,600 acres. Tech also has regional presences statewide and a study-abroad campus in Switzerland. Academic Building One, the first part of the university’s $1.1 billion Innovation Campus, opened in Alexandria in January.\nEnrollment (Fall 2024)\nUndergraduate: 31,035\nGraduate and professional: 7,822\nIn-state undergraduate: 20,271\nInternational: 2,698\nStudent profile\nMale: 57%\nFemale: 43%\nStudents of color: 12,153\nEmployees\nFull-time employees: 9,126\nResearch and teaching faculty: 3,719\nTuition, fees, housing and financial aid*\nIn-state undergraduate: $15,950\nOut-of-state undergraduate: $37,777\nRoom and board: $12,358\nAverage financial aid awarded to entering in-state undergraduates in 2023-24: $11,998\n*2024-25 figures, except as noted",
  "word_count": 1815,
  "scraped_at": "2026-02-14T13:21:12.988187"
}