{
  "article_id": "d56a5f99e3e8",
  "url": "https://www.wtok.com/2024/04/22/sideline-view-with-dale-mckee/",
  "title": "Sideline View with Dale McKee",
  "date": "20240422T221500Z",
  "domain": "wtok.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Sideline View with Dale McKee\nMERIDIAN, Miss. (WTOK) -\nArchie Cooley, who grew up in Laurel and helped Jerry Rice become a star at Mississippi Valley, died this past week. He was nicknamed the “Gunslinger” for his creative passing offense that averaged over 61 points per game in 1984. His teams set dozens of NCAA records with Willie “Satellite” Totten and Rice playing pitch and catch. He began his football coaching career as an assistant at Southside High School in Heidelberg. His girls’ basketball teams compiled a six-year record of 176-9 and at one point won 77 straight games. Cooley was an All-SWAC player for Jackson State under John Merritt during his playing days.\nBaylor University transfer Blake Shapen shined in the Mississippi State annual Maroon-White spring game this past Saturday. Shapen threw for 322 yards and three scores in only one half of action. Head Coach Jeff Lebby was pleased with Shapen’s showing. “I think he’s got a chance to be, not a good player, but a great player,” stated Lebby. Linebacker Branden Jennings stood out for the Bulldogs defense.\nThe NFL Draft will be held this Thursday-Saturday. Round one will be held on Thursday followed by the second and third rounds on Friday. Then on Saturday, rounds four-seven will complete the process. This year, most of our college hopefuls will be middle rounder selections at best. Mississippi State hopefuls are Nate Watson (LB), DeCamerion Richardson (CB), Jaden Crumedy (DL) and Lideatrick Griffin (WR). Ole Miss hopefuls are Cedric Johnson (DE), Daijahn Anthony (DB) and Deantre Prince (CB). Southern Miss running back Frank Gore has a good chance to be chosen in the later rounds.\nOur state had three basketball players drafted as Marquesha Davis of Ole Miss went 11th overall to the New York Liberty and was joined on the Liberty roster by MSU’s Jessika Carter chosen 23rd overall. Jackson State’s Angel Jackson was taken 36th overall by the Las Vegas Aces.\nBaseball\nOle Miss took one of the three games at Georgia this past weekend. The one win was historic as it was head coach Mike Bianco’s 1,000th as a head coach and his 900th win at Ole Miss. The Rebels (21-18, 6-12) will host Alabama beginning on Thursday this week. The Rebels and Mississippi State will meet on May 1 in Pearl for their annual Mayor’s Cup game.\nSouthern Mississippi won two of three from ULM over the weekend and are now tied in second place in Sun Belt play. The Eagles (25-15, 11-7) will head to league-leading Louisiana-Lafayette (31-11, 15-3) this weekend.\nMississippi State won all three games over Auburn this past weekend. The Bulldogs (26-14,10-8) travel to Vanderbilt this weekend.\nBlue Mountain and William Carey have matched up every year in baseball since 2011. The Toppers finally won a series from the Crusaders this past week winning two of three games in Hattiesburg. Blue Mountain (27-17,11-16) will host UT of Southern this weekend while Carey (27-14, 17-10) travels to Loyola of New Orleans beginning on Thursday.\nEast Central Community College swept a doubleheader from Pearl River ending the Wildcats’ 29-game winning streak last Wednesday. The Warriors (44-4, 20-4) travel to East Mississippi (29-17, 15-10) this Saturday. PRC (43-7, 22-2) travels to Jones College (35-11, 17-7) on Wednesday.\nThe Mississippi College softball team is leading the Gulf South Conference standings. The Lady Chocs (39-6, 21-6), as well as the baseball team, will head to Delta State this weekend.\nGolf\nThe Mississippi State women’s golf team won their first SEC Championship. The William Carey women’s golf team won the SSAC championship.\nThe 12th annual Bobby Myrick Golf Tournament sponsored by the Pine Belt FCA is scheduled for May 2 at the Hattiesburg Country Club. Myrick, who died in 2012, was a Hattiesburg native who played for Mississippi State and the New York Mets. The format is a four-man scramble with flights in the morning and afternoon. For more information, contact Mitch Williams at mitchwilliams@fca.org.\nClick here to subscribe to our daily newsletter!\nCopyright 2024 WTOK. All rights reserved.",
  "word_count": 672,
  "scraped_at": "2026-02-14T13:14:12.161161"
}