{
  "article_id": "d5b4661507a3",
  "url": "https://citizen.digital/article/harambee-starlets-nine-years-of-waiting-one-glorious-return-to-wafcon-n372327",
  "title": "Harambee Starlets : Nine years of waiting , one glorious return to WAFCON",
  "date": "20251101T233000Z",
  "domain": "citizen.digital",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Harambee Starlets: Nine years of waiting, one glorious return to WAFCON\nAudio By Vocalize\nAfter nearly a decade in the wilderness, Kenya’s Harambee Starlets are back on the grandest stage in Africa after qualifying for the 2026 Women’s Africa Cup of Nations (WAFCON) in Morocco with a commanding 4–1 aggregate victory over The Gambia.\nThe path was anything but easy. The Starlets began their qualification campaign against Tunisia with a cagey 0–0 draw at home that left fans anxious, before delivering a stunning away win courtesy of Tereza Engesha’s early strike. That win set the tone —Kenya meant business.\nThen came The Gambia. In the first leg at Nairobi’s Nyayo National Stadium, the Starlets dazzled under the floodlights. The trio of Mwanalima “Dogo” Adam, Fasila Adhiambo, and Sherlyne Opisa found the net, sealing a 3–1 home win.\nThe return leg, played in Senegal due to Gambia’s unavailability of a CAF-approved home venue, tested their composure. But ‘Dogo’ just like she did back in 2016 rose again scoring the decisive goal that secured a 1–0 win and Kenya’s long-awaited return to Africa’s biggest women’s football stage.\nFor head coach Beldine Odemba, this was more than a football victory. It was a statement, a triumph built on belief, discipline, and togetherness. “Coach Beldine Odemba didn’t win this,” she said humbly after the match. “The entire country did.”\nIndeed, it’s been nine long years since Kenya last featured at WAFCON, in Cameroon 2016 under then-coach David Ouma.\nOdemba, who served as Ouma's assistant then, has now brought the story full circle from apprentice to history-maker. Her team’s qualification wasn’t just about tactics or goals; it was about rewriting destiny.\nTo get there, the Football Kenya Federation (FKF) had named a 38-player provisional squad, signaling depth and intent.\nFrom the local league stars to overseas-based players like goalkeeper Lilian Awuor of Romania’s Farul Constanța, the blend of youth and experience finally clicked. “The unity, the faith and the spirit made the difference.\nKenya’s world ranking of 149th at the start of qualification only magnifies this achievement. To outwit Tunisia (ranked 78th) and Gambia (126th) was not just an upset but a rebirth.\nAnd as the final whistle blew in Thies, the celebrations weren’t just about football. They were about resilience, about Kenyan women demanding their space on the continental map once again.\nAfter ten years in the shadows, the Starlets had reminded Africa who they are. The question is — how far can this newfound fire take them?\nEyes on Morocco\nQualifying is one thing and competing at the highest level is another. As Kenya now looks toward Morocco 2026 (March 17–April 3), the Starlets know that this is where legends are made.\nThe first order of business? Tactical discipline and game management. Even in qualifiers, Kenya created a flurry of chances but finishing remained an area of concern.\n“We created numerous opportunities but couldn’t capitalise,” Odemba admitted after the Tunisia draw. Against Africa’s giants like Nigeria, South Africa, and Zambia, missed chances could prove costly.\nThen comes squad depth and rotation. With a larger pool of players and some making senior debuts, coach Odemba’s ability to balance youth and experience will be crucial. Injuries, fatigue, and suspensions are part of tournament football. A team’s bench strength often determines how far it goes.\nEqually vital will be mental strength. The bright lights of WAFCON can be daunting and Kenya must find the composure to handle pressure moments.\nThe group stages will feature heavyweights with more experience and exposure, but the Starlets have already proven they can punch above their weight.\nPreparation will define everything. Pre-tournament friendlies, scouting reports, and opponent analysis must become the norm.\nTo face the likes of Ghana, Nigeria, or hosts Morocco, Kenya will need a clear tactical identity on whether to press high, play compactly, or exploit counterattacks through speedsters like Adam and Engesha.\nBeyond the pitch, professionalism off it is equally important. Travel arrangements, nutrition, rest, and recovery often separate winners from the rest. These details matter a lot and FKF must ensure nothing is left to chance.\nBut perhaps the biggest weapon will be support from fans, media, and the wider football fraternity. Football thrives on passion, and the Starlets’ home crowd has already shown its power. The 3–1 win at Nyayo was played in a carnival atmosphere, with songs, chants, and flags waving in red, green, and black. That connection between team and fans must grow even stronger.\nFor veterans like Dorcas Shikobe, who played in 2016, this qualification is deeply personal.\n“We didn’t want to disappoint the fans,” she said. “We’ve shown the world what we can do.” For the younger generation and the new faces in the team it’s an opportunity to learn, grow, and inspire.\nThe 2026 WAFCON will not just crown Africa’s champions but it will also serve as the qualifier for the 2027 FIFA Women’s World Cup in Brazil. The top four semi-finalists will book automatic tickets, while two more will head to intercontinental playoffs.\nCan the Harambee Starlets go beyond participation and fight for a World Cup dream? The ingredients are there - talent, belief, leadership, and growing support. What remains is consistency, preparation, and a bit of Kenyan audacity.\nGovernment, FKF, and the Power of Belief\nNo great sporting story stands alone — it’s built on systems, leadership, and belief. For the Harambee Starlets, this return to the continental stage has been fueled by unprecedented government and federation support.\nPresident William Ruto has been a visible and vocal supporter of women’s football. His congratulatory message after the 1–0 away win over Gambia captured the national mood:\n“Warm congratulations to our brilliant Harambee Starlets for their 1–0 victory over The Gambia, sealing a 4–1 aggregate triumph that books Kenya’s place at WAFCON 2026 in Morocco. This decisive win is a glowing testament to the discipline, talent, and indomitable spirit of our women footballers and the leadership of the technical bench.”\nTrue to his word, the President followed through on his financial pledges. The team received Sh10 million after their home win and Sh1 million per player for the qualification triumph in Senegal.\nThat kind of motivation which is tangible and symbolic, can lift spirits more in the team and drive performance. “The motivation worked,” Odemba smiled, acknowledging the Head of State’s gesture.\nFKF President Hussein Mohammed also credited government partnership and structural improvement within FKF for the milestone. From organizing training camps and provisional squads to ensuring smooth travel and logistics, the federation’s coordination played a major role.\nFinancial incentives, proper planning, and institutional backing are the pillars that have too often been missing in Kenyan women’s football. But now, they’re in place. And the results are clear.\nBeyond the immediate success, this support creates a ripple effect. It signals to sponsors that women’s football is worth investing in. It tells young girls in schools and academies that football can indeed be a viable career path. It assures fans that women’s football deserves the same respect, coverage, and enthusiasm as the men’s game.\nAnd this visibility matters. When the President tweets, when media houses lead with women’s football headlines, when the federation speaks proudly about the women’s game, then the message reverberates across the country: Kenyan women can conquer Africa. Kenyan women can conquer the World.\nNow, as the Starlets prepare for Morocco 2026, that partnership between the government, FKF, and the players must deepen. Odemba has already made a passionate appeal: “We don’t just want to participate — we want to compete. We need international friendlies and early preparation to be more competitive.”\nThe roadmap is clear. The willpower is visible. The unity is real.\nThe Dawn of a New Era?\nThe Harambee Starlets’ qualification for WAFCON 2026 is more than a football story; it’s a national revival. It’s a reminder that with proper planning, belief, and unwavering support, Kenyan football which has long been plagued by inconsistency and underfunding can rise again.\nCoach Odemba’s humility, leadership, and tactical acumen have reignited belief. The players’ grit and passion have restored pride.\nThe FKF’s logistical backing and the government’s visible commitment have created an environment where success is possible.\nBut qualification is only the beginning. The real challenge lies ahead because in Morocco, under the bright lights, against the best in Africa. This is where Kenya must prove that 2025 was not a one-off miracle, but the start of sustained progress.\nAs the team returned home to a heroic welcome and fans chanted their names across Nyayo and Kasarani and JKIA, one can’t help but feel a sense of destiny. The women who waited ten years to return now carry the dreams of millions.\nThey’ve conquered the qualifiers with courage and conviction. Now, can they conquer Africa?",
  "word_count": 1456,
  "scraped_at": "2026-02-14T13:44:35.055572"
}