{
  "article_id": "d5e36fb61cdc",
  "url": "https://www.eadt.co.uk/news/23367902.international-womens-day-brantham-athletic-mark-day-open-day/",
  "title": "International Women Day : Brantham Athletic mark day with open day",
  "date": "20230307T140000Z",
  "domain": "eadt.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "A village's football club will host an open training session to mark International Women's Day to boost the growth of women's football.\nBrantham Athletic Football Club will welcome players to the open session on the main pitch between 6-7pm on Wednesday, March 8.\nThere will be a chance after the training session to socialise at the Brantham Leisure Centre, while enjoying a slice of pizza.\nThe club currently supports girls from age 7 (Mini Imps) up to the adult ladies' team, and even recently formed a ladies' veterans and recreational group, launched in December.\nOrganiser Louise Madley, said: \"A number of our current players will be attending and we are keen to welcome any women and girls, of all ages, for the session - regardless of experience or whether they are currently involved in a team at Brantham.\n\"We have a variety of age groups already playing at the club and we felt this was a great opportunity to celebrate women and girls at Brantham FC and within football in general.\"\nAt Brantham, they have three girls teams at U13 and U14 level, with a ladies team playing in the Suffolk Girls and Womens League.\nThey first started having women's teams as far back as the 1950's.\nWomen's football has increased in stature over the past few years, with the help of the women's England team, the Lionesses, winning the European Championships in 2022 on home soil.\nLouise continued: \"This is a really exciting time to be involved in women's and girls' football and what better day to acknowledge that than on International Women's Day.\"\nEveryone is welcome to Brantham Athletic Football Club on March 8 to take part in the training session.",
  "word_count": 283,
  "scraped_at": "2026-02-14T13:03:16.557479"
}