{
  "article_id": "d5eae9ca88d2",
  "url": "https://njbiz.com/2024-njbiz-power-100-k-z/",
  "title": "2024 NJBIZ Power 100 : K – Z",
  "date": "20240219T081500Z",
  "domain": "njbiz.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "NJBIZ STAFF//February 19, 2024//\nAfter leading the organization for more than a quarter century, Michael McGuinness exited NAIOP New Jersey in 2023 leaving big shoes to fill. Enter Kennedy, who stepped into the CEO position in September. A registered legislative agent, Kennedy frequently meets with and testifies before New Jersey legislative committees and regulatory agencies. Day-to-day, he oversees the operations and programs of the association, which represents Garden State developers, owners and other professionals in office, industrial and mixed-use real estate through its advocacy, education, business development efforts and diversified membership. Kennedy brings a different kind of leadership to the organization at a time when broader economic uncertainty lingers and local challenges (those “stop the warehouse” signs, for instance) persist. Following NAIOP NJ’s Annual Meeting and Outlook event last month, Kennedy paid tribute to those circumstances, but found a silver lining. “Our expert panelists are aligned in the opinion that we have entered 2024 with some clear headwinds and new challenges not only here in New Jersey but throughout the country. However, in every challenge there is opportunity, and there are a number of positive indications that the landing will be on the softer side.”\nKennedy is able to offer keen insights from his position as president and CEO of Peapack-Gladstone Bank, which expanded its reach outside of the Garden State’s borders in 2023. But also, from his post as a Class A director representing Group 2 on the Federal Reserve Bank of New York. Currently serving in his second consecutive term, Kennedy’s three-year appointment overseeing banks with capital and surplus of $40 million to $2 billion concludes at the end of 2025. Over the summer, he said many banks remain safe while issuing a warning about public perceptions. “When the three banks failed, we watched our money flows on an hourly basis,” he told NJBIZ. “At the same time, we contacted customers with uninsured deposits and offered to ‘sweep’ their excess funds into an FDIC-insured account each night at no charge. So, out of our approximately $5.8 billion deposit base, about $120 million moved out, but about $50 million of that flowed back in, so the net percentage outflow was not particularly significant.” And, as they say, when one door closes another opens: “We also saw opportunity in the crisis,” said Kennedy. “We hired 17 private banking professionals from financial institutions that included First Republic Bank and Signature Bank and will leverage their experience to open our first office in midtown New York.”\nKessler PR Group, the public relations firm Kessler founded and leads as CEO is known for working with clients that run the gamut from Fortune 100 companies to colleges and universities, health care systems, financial institutions, and law firms (regionally, nationally and internationally), offering litigation support in addition to crisis communications and reputation management. Kessler has been busy in public as the spokesperson for mixed martial arts athlete Conner McGregor, a man whose Wikipedia page includes a “Controversies” subheading, further driving home the point that if you’re in trouble, Kessler should be your first call. As artificial intelligence makes it easier to inflict reputational harm online, Kessler’s services will be in even greater demand.\nOne of the state’s leading business voices, Meadowlands Chamber & Meadowlands Convention and Visitors Bureau President & CEO Jim Kirkos and his organization received a huge piece of news recently when MetLife Stadium landed the FIFA World Cup 26 Final (and eight matches in total) – bringing jobs, a major economic impact, and a chance to showcase the region and its businesses to the world. “The Meadowlands has been hosting the world’s most notable events for more than 50 years,” said Kirkos. “We will most certainly provide a warm welcome and a fabulous experience to visitors from all over the globe as they visit the Meadowlands region for FIFA World Cup 26. The Meadowlands knows how to do big things, and our destination is bigger and better than ever filled with fabulous dining, incredible retail, and attractions and a wide array of entertainment that will delight the millions of visitors the FIFA World Cup 26 generates.” Kirkos has also been leading efforts for a proposed Meadowlands Convention Center – to be built at the site of the former Izod Center. “Together with American Dream, the Meadowlands Racetrack, and MetLife Stadium, a convention center would round out a cohesive, connected, walkable entertainment asset,” said Kirkos.\nOver the last 40 years, Kobler has handled some of New Jersey’s largest and most complex health care transactions, including mergers & acquisitions and capital financing, earning him the reputation as one of the most prominent M&A lawyers in the state. Also recognized numerous times as a New Jersey Super Lawyer, Kobler’s practice often extends beyond the state and into the higher education, housing and nonprofit sectors. Besides being a partner at Newark-based law firm McCarter & English LLP, Kobler is chair of Public Media NJ, Inc. (NJ PBS), member of the board of directors of the New Jersey Performing Arts Center, trustee of the Newark Alliance and director of the Catholic Medical Mission Board. He was also part of a coalition of New Jersey lawyers who founded “Jersey Lawyers for Joe,” a 2020 effort to support President Joe Biden’s election, bid and serves as treasurer for the Booker for Senate campaign.\nAs CEO of the New Jersey Builders Association, Kolakowski leads the state’s premier association for homebuilders in the state, including residential and mixed-use builders, developers, remodelers, subcontractors, suppliers, engineers, lawyers, architects, consultants and others. His work puts him at the forefront of advocacy efforts for the association in a broad array of policy areas, including land use, redevelopment, economic development, utility infrastructure, environmental matters and building codes and standards. Over the summer, Kolakowski get involved in the debate over liquor license reform (legislation that the governor eventually signed in this past January), promoting the positive influence changes would have for local economies. “We are restricting, growth in communities that are welcoming it. These communities want to be destination downtowns. They’re welcoming this and we have this one little thing that’s stopping us all to accommodate growth in the places that want it. And where it makes more sense,” he testified during an Assembly committee hearing. Looking ahead, as a lack of available housing keeps demand high for new projects, NJBA is focused on addressing the crisis in New Jersey. Kolakowksi also serves on the Emerging Leaders Council of the Rutgers Center for Real Estate and is a board member of Habitat for Humanity of Burlington and Mercer Counties.\nWith more than 22,000 students enrolled at Montclair State University, Koppell leads New Jersey’s second-largest university as president, a role he assumed in 2021. Last fall, U.S. News & World Report ranked Montclair State, No. 7 nationwide – and No. 1 in New Jersey – for Social Mobility. “These new rankings demonstrate that a school can be accessible, affordable, rigorous and excellent – and can do it all at a high level,” Koppel stated at the time. “We are not just providing an exceptional value. We are providing a truly excellent educational experience, and changing the lives of students and their families affordably without compromising quality.” And that mission is resonating with students. Montclair State’s incoming classes have set records for their size for three consecutive years, and it recently welcomed its largest returning student population. Those cohorts of future graduates are also getting more diverse. Another example of the school’s commitment to students came when it agreed to merge with struggling Bloomfield College, which was New Jersey’s only four-year Predominantly Black Institution, as well as a Hispanic-Serving Institution and Minority Serving Institution. That deal closed over the summer, establishing the renamed Bloomfield College of Montclair State University. In his own words, “Montclair State University is an institution on the rise,” and Koppel is leading that ascension.\nThe monumental Gateway Project is moving – under the ground and across the river, beginning with replacement of the century-old Portal Bridge. And right in the middle of it is Lalevee, the business manager of the International Union of Operating Engineers Local 825 and vice president of the IUOE’s general executive board. His members – more than 8,000 strong – are already at work. Lalevee also acts as an advocate for infrastructure improvements, including, for now, the replacement of the Newark Bay Bridge on the New Jersey Turnpike and a multibillion first phase of widening the approach into the Holland Tunnel. And he is vice chair of the New Jersey Transportation Trust Fund Authority. The fund needs to be replenished in 2024 for the first time in eight years in what will likely be a complicated legislative debate in the midst of a presidential and U.S. Senate election. Lalevee is a vigorous supporter of the fund, recently posing this question about the governor’s electric vehicle mandate: “Gasoline and gas taxes are going to be a declining source of revenue, how [is the state] going to continue to pave the same amount of roads, what’s the proposal to do that or what’s the discussion around doing it?” In a recent interview with WBGO-FM, Lalavee said the state’s ability to get federal funding to projects de-pends on the renewal of the trust fund. “With the infrastructure bill that got passed through Congress out there, funding a lot of this, there are federal matching dollars to be had so it’s only better to have our house here in New Jersey in order,” he said.\nAfter assuming the role of president and chief executive officer of the New Jersey Restaurant and Hospitality Association in March 2021 – in the midst of the pandemic – Lancellotti has spent the last three years advocating for the state’s hospitality industry as it rebounded from the extended public health emergency. A Jersey Shore native, Lancellotti is proud of her local roots and passionate about helping support the long-term resilience and revenue growth of restaurants, bars, hotels and hospitality venues. For Lancellotti, the hospitality and tourism industries have played a significant role in shaping her career over the last 25 years, having held positions ranging from restaurant services to hotel sales management to multimedia advertising sales to Ocean County’s director of tourism. Over the past 15 years, she has also focused on supporting the U.S. military, both on a local and national level, as an honorary commander emeritus at Joint Base McGuire-Dix-Lakehurst and as an active alumnus at the Air Force Air Mobility Command Civic Advisory Council at Scott AF Base in Illinois. Also, a founding member and volunteer executive director of the Military Support Alliance of New Jersey, Lancellotti has made an impact on military-civilian relations, connectivity and awareness, an involvement that highlights her commitment to both the business and military communities.\nRalph LaRossa serves as chair, president and CEO of PSEG. In these roles, LaRossa oversees an organization that is one of the 10 largest electric companies in the nation, which has served the Garden State for more than 120 years. In November, PSEG launched its first Sustainability Report since LaRossa took the helm. “PSEG is actively working toward our vision of a future where people use less energy, and it is cleaner, safer and more reliable than ever,” he said. “This year’s Sustainability Report continues to show that we are engaged in the fight against climate change and taking action to mitigate the existing impacts, while also focusing on predictability for our business.” LaRossa also serves as chairman of Choose New Jersey, the state’s leading nonprofit business attraction organization, which is coming off a big 2023. “This has truly been a transformative year for Choose New Jersey,” he recently said. “The team’s tireless efforts ensured that the organization remains a driving force in the New Jersey economy, contributing substantially to the prosperity of the state and fostering a climate of advancement.”\nLest you forget the name of the largest woman-owned business in New Jersey, and the largest Minority & Woman-Owned Business Enterprise in the United States, one only need look up – or around – at the next Rutgers football or men’s and women’s lacrosse game on the Scarlet Knights’ home turf: SHI Stadium in Piscataway. After forging a relationship in 2019, the partners announced this month they are keeping things going through 2029. According to Lee, the collaboration pays tribute to the pipeline between the university and the company, based across the Raritan River in Somerset. Among its approximately 2,000 New Jersey-based employees, nearly 500 are Rutgers alums, representing the biggest contingency from any institute of higher education among the company’s 6,000-member global workforce. Getting its name out in another sporting way, the global provider of information technology products and solutions entered the women’s golf world last year as an official partner of the LPGA Tour. Lee’s success building up the company she leads as co-founder, president and CEO – which was purchased for $1 million in 1989 – has helped her boost her own brand, as well. This past summer, Forbes ranked Lee – and her $4.8 billion net worth – at No. 5 on its list of “America’s Richest Self-Made Women.” For reference: Oprah Winfrey was No. 13.\nThe first member of his family to earn a college degree, Lim took over as the ninth president of New Jersey Institute of Technology last year. He is running a school on a roll, particularly in the national rankings. NJIT was ranked as the second-best public school, landing at No. 19 overall in the Wall Street Journal/College Pulse 2024 list of the Best Colleges in the U.S., released in September. “This ranking confirms that NJIT is an exceptional public polytechnic university that primes students for rewarding careers, particularly in STEM disciplines,” Lim said at the time. “We are focused on outcomes and enabling graduates to realize their goals, so they can personally thrive and make significant contributions to society.” NJIT said this year’s list, which re-places the former WSJ/Times Higher Education ranking with some similar methodology components, uses a larger survey and factors in feedback from students and alumni. It also called the 2024 ranking “more exclusive, with only 400 schools awarded. That’s just 20% of the eligible universities examined.”\nThe new year is shaping up to be a Wonder-ful one for Lore, as his new-era delivery and food hall concept continues to expand its footprint across the metropolitan area. Originally launched by the billionaire e-commerce mogul as a concept based on mobile kitchens that prepared chef-designed meals outside of customers’ homes, the Cranford-headquartered company has pivoted over the past year to a venture focused on physical locations offering options from restaurants it has licensing deals with. Intent on disrupting at-home mealtime by creating a category Wonder describes as “fast fine,” the brand gives customers the ability to order cuisines from some of the world’s best chefs and well-known restaurants at once for delivery, pick-up or dining in. The brand has opened five eateries in New York City and five in New Jersey and plans to launch at least four more outposts this year, including one in Pennsylvania. After that, the company will reportedly speed up development, with plans to introduce up to 100 stores in the Tri-State area and then fill out the Northeast, which will require a second food manufacturing facility, Lore recently told Restaurant Business. Lore also shared with the publication that the business has already raised more than $850 million, a sum he says will top $1 billion by early 2024, and potential plans for an initial public offering. He also believes there’s a path to a $1 trillion market cap for Wonder and that eventually there could be as many as 7,000 locations nationwide. As part of its pivot to brick-and-mortar, Wonder closed a $103 million acquisition in November 2023 of meal kit provider Blue Apron, a deal that expanded the startup’s offerings to include boxes of recipes and ingredients as well as heat-and-eat options. The announcement came a few weeks after Wonder secured a $100 million investment and strategic partnership with food giant Nestlé to grow a new business-to-business offering. Lore is also the cofounder of online baby products retailer Diapers.com and e-commerce platform Jet.com – which were later sold to Amazon and Walmart, respectively, and shut down following the acquisitions. Following the merger with Walmart, he served as president and CEO of the retailer’s U.S. e-commerce business from 2016 through 2021. An ownership group led by Lore and former MLB all-star Alex Rodriguez is also poised to become majority owner of the NBA’s Minnesota Timberwolves and WNBA’s Minnesota Lynx. Commenting on Wonder’s growth in 2023, Lore has said he “couldn’t be prouder of the team for becoming one of the fastest to scale from 0 to 10” and that the business is well on its way to “creating the mealtime super app,” that not only features a variety of cuisines but leverages “our culinary engineering and vertically integrated model.” Lore also said, “At-home meals play a key role in this vision and have been on our strategic roadmap since the beginning.”\n“Our 2023 results reflect continued strong sales across our insurance and retirement businesses and solid underlying earnings growth,” Prudential Financial Inc. Chairman and CEO Lowrey said recently, following the release of the Newark-headquartered company’s 2023 Q4 and year-end results. “We are proud of the significant progress we made to become a higher growth, more capital efficient, and more nimble company.” In that same statement, Lowrey touted Prudential’s ability to reach more people around the world through its products as well as the launch of Primic, a life and annuity reinsurance company, and the adoption of a new operating model to meet customers’ needs while driving efficiency. Under his watch, the company oversees a bevy of significant initiatives and programs such as the Prudential Emerging Visionaries, which recognizes young leaders developing innovative solutions to community challenges. “It’s an honor to support young leaders who are making their communities stronger and more inclusive,” said Lowrey. “This program is another way we’re working to fulfill Prudential’s purpose of making lives better by solving the financial challenges of our changing world. I look forward to recognizing the creativity, initiative, and perseverance of the next cohort of Emerging Visionaries.”\nMaher is the CEO of OceanFirst Bank, the current chair of the New Jersey Bankers Association and chair of the board of trustees of Monmouth University. He has led OceanFirst since 2015, two years after joining as president and chief operating officer. Maher is also a keen observer of the state and national economy, particularly along the New Jersey shore. “I was with one of our best clients … who runs a seasonal hospitality business at the Shore, and he tracks reservations every week. You know, this week, this year, this week last year. … He said reservations are ahead of where they were for last summer,” Maher told NJIBZ recently. So that’s a good sign. And we’re seeing consistently strong numbers around property values up and down the Shore. One thing I think is gonna stick from the the pandemic, our Shore is a great place for people to spend a little more time. Even if they commute to New York or Philadelphia, and spend a few days in the office and a few days at home. The net beneficiary of that is New Jersey.” And on his connection to the university, Maher emphasized the value of higher education. “I’m a huge believer that education is the opportunity to level the playing field for all of us for every generation,” he said. “So we can’t do enough to invest in the future of our youth. And I had think having a vibrant university system that includes private and public university options is is critically important. I think these universities also provide, exceptional community anchors where they bring scholarship and thought and discussion and debate into our communities in a very positive way.”\nNew Brunswick is a flurry of activity and RWJBarnabas Health is right in the center. As president and CEO of the state’s largest academic health care system, Manigan leads a network of 12 acute care hospitals, among various other facilities, from which the system serves eight counties and 5 million people. To get all that work done, RWJBarnabas is among New Jersey’s largest private employers – with more than 38,000 employees and 9,000 physicians reporting, up the chain, to Manigan. In the Hub City, RWJBarnabas is a founding tenant of the transformative HELIX project, representing its status as an anchor institution for Middlesex County and New Brunswick. Manigan was also part of the group that traveled with Gov. Phil Murphy on last year’s economic mission to East Asia. That resulted in Rutgers University, RWJBarnabas and Hiroshima University signing a historic agreement to advance cancer research and education. Locally, efforts to expand cancer care are progressing, too, with the $25 million Jack & Cheryl Morris Cancer Center in New Brunswick. Completion of the state’s first freestanding cancer hospital is expected later this year. In anticipation, the health system and Middlesex County forged the RWJBarnabas Health Workforce Partnership in 2023 as part of the county’s investment in the center. In another big win, in December, the system closed the book on a five-month nurses strike at RWJ University Hospital in New Brunswick that drew national attention. Amid the standoff, Manigan submitted written testimony to a Senate committee field hearing held by U.S. Sen. Bernie Sanders on nursing staffing and safety in New Brunswick. “Nearly a quarter of our employees are in a union. RWJBarnabas Health currently has over $1.3 billion in construction projects underway with organized labor,” Manigan said defending the system’s track record, adding, “I can tell you, as an organization, we believe strongly in the collective bargaining process, and we look forward to continuing to make progress at the bargaining table – where negotiating belongs.”\nThe president and CEO of Holy Name Medical Center, Maron has been with the state’s last independent Catholic health system for nearly four decades. Last year was another one full of positive developments for Holy Name. In December, the Accreditation Council for Graduate Medical Education awarded initial accreditation to Holy Name for its new graduate medical education program. “Receiving initial accreditation from the ACGME is an important first step in launching a high-quality graduate medical program to strengthen our future health care workforce,” said Maron. “With New Jersey facing a worsening physician shortage, it is critical we train more doctors in the Garden State, who will then live and practice medicine here in the future.” That follows an announcement earlier in 2023 to combat the nursing shortage hitting the health care industry – as Holy Name’s Sister Claire Tynan School of Nursing received $3.8 million in federal funding. “It’s up to us to provide the best education, help build the pipeline of clinicians, and provide the top-notch care all patients deserve,” said Maron. Meanwhile, a recent $3.3 mil-lion funding boost to initiate a new residency program is a direct response to the acute physician shortage. The effort aims to train 100 doctors annually across several clinical specialties, such as internal medicine, psychiatry, general surgery, obstetrics and gynecology, orthopedics, neurology and palliative care. The investment will transform an 8,400-square-foot area and equip it for the program, emphasizing Holy Name’s commitment to enhancing health care’s future workforce. Holy Name recently received approval for an ambitious campus expansion, adding 1 million square feet of space over the next decade. The center has excelled in software development, contributing innovative solutions to health care technology. In addition, Villa Marie Claire, an inpatient hospice, stands as a testament to Holy Name’s dedication to compassionate end-of-life care.\nMedina, as president and CEO, and De La Hoz, as chairman, lead the Garden State’s largest chamber. The Statewide Hispanic Chamber of Commerce of New Jersey represents the interests of the New Jersey’s 120,000 Hispanic-owned businesses, which together contribute more than $90 billion to the economy. The SHCCNJ regularly tops the NJBIZ Lists Chamber of Commerce rankings, most recently reporting 8,000 members. The state mission of the group is to educate, train, and advocate for its members in the political landscape and provide procurement opportunities for all its members. Recapping its educational efforts at the end of 2023, SHCCNJ detailed key results: nearly 400 students and participants, at least 90 hours of classroom time, and more than 40 guest speakers. On the policy side, following the January release of findings from the New Jersey Disparity Study that highlighted shortfalls in state contracting opportunities for Minority and Women-Owned, Medina seemed encouraged. “We anticipate that this will result in increased participation from bidders, fostering competition and ultimately leading to a cost savings to the state,” he stated then. Outside of work with SHCCNJ, Medina is also president at Robinson Aerial Surveys Inc. De La Hoz is regional director – Community Lending NJ/NY for Valley Bank.\nMeyers, one of the longest-serving health executives in the Garden State, oversees the Valley Health System. She was named president and CEO, first of the Valley Hospital in 1999 and then system president and CEO in 2003. And Meyers has a big year ahead. The long-awaited new Valley Hospital is scheduled for an April opening in Paramus. The state-of-the-art, acute-care facility on Winters Avenue will feature 370 private patient rooms and be the centerpiece of a 40-acre campus. The site also includes Valley’s medical office building, located at 140 E. Ridge-wood Ave., and the Robert & Audrey Luckow Pavilion, which houses Valley-Mount Sinai Comprehensive Cancer Care, The George R. Jaqua Same Day Services Center, a full-service retail pharmacy and more, the health care provider said in a July 6 announcement. Plans to move The Valley Hospital from Ridgewood were announced in January 2017, and officials broke ground on the new site in November 2019. Recent estimates put the price tag of the new facility at approximately $800 million. In 2018, the hospital received two sizable donations for the project: $20 million from an anonymous source and $15 million from The Bolger Foundation. The 875,000-square-foot facility also will include: single-patient rooms, rather than traditional shared spaces; an expanded Emergency Department located next to diagnostic imaging and near surgical and interventional services, which minimizes travel for patients; a sustainable design (more than 30% of the hospital’s portion of the 40-acre campus will feature open green space, such as gardens, lawns and walking paths. The new facility also incorporates energy efficiency, space utilization and the use of natural light); and A “smart hospital” design using state-of-the-art technologies, such as artificial intelligence, smart beds and Real-Time Location Systems.\nIn 2022, New Brunswick-based Johnson & Johnson named Mongon as chief executive officer of the health care giant’s consumer health business, since spun off and dubbed Kenvue. A 20-year J&J veteran, Mongon previously served as executive vice president and worldwide chairman of the company’s Consumer Health division since 2019. According to J&J, he is responsible for leading one of the world’s largest portfolios of consumer health products with brands including Tylenol, Neutrogena, Aveeno, Listerine and Johnson’s. “With Thibaut at the helm, we can expect the New Consumer Health Company to remain mission driven with iconic, science-backed brands and a strong commitment to innovation and remarkable talent,” J&J CEO Joaquin Duato said when the appointment was announced. Kenvue completed its separation in August 2023 and now operates on its own. “This is a historic moment for Kenvue and with a singular focus on delivering innovative care solutions to customers and consumers around the world, we’re excited to write the next chapter of consumer health,” Mongon said immediately after the spinoff.\n“As with everything in society today, how people view what’s going on in their own backyard seems to be filtered through a partisan lens,” Patrick Murray, who has been director of the Mon-mouth University Polling Institute since its founding in 2005, noted in last year’s benchmark Garden State Quality of Life Index. Under his watch, the institute has grown into one of the most cited and respected in the business – with Murray regularly serving as a trusted voice and expert – especially during these crazy political times. An example can be found just last month, Monmouth University Polling Institute was once again named as one of the top survey research organizations in the country by FiveThirtyEight, the independent election poll analysis site – ranking #5 out of 539 organizations included in the rankings and earning high marks for its accuracy and transparency. “The consistent recognition of excellence at Monmouth University is very gratifying,” said Monmouth University President Patrick Leahy. “The Monmouth University Poll is a trusted resource for policymakers, and we appreciate the validation from FiveThirtyEight’s evaluation that puts us in the top five of the leading national polling organizations.” And of course, there are important elections coming up – these days, important elections are always coming up – which will put Murray’s work under the national spotlight.\nThe managing shareholder and CEO of Parker McCay, a leading law firm, Philip Norcross is a mainstay on this list, and usually near the top, as his impact is felt in a number of areas. His practice focuses on public finance and transactional law – representing a slew of governmental and private entities in finance, real estate, private equity and development matters throughout the Garden State. Norcross also serves as chairman of the Cooper Foundation board of trustees; secretary of the board of directors for the United Way of Greater Philadelphia and Southern New Jersey; a member of the board of trustees of the Cooper Health System and a member of the executive committee, finance committee, and treasury subcommittee – and is a frequent lecturer and sought-after voice on critical matters here in New Jersey. And he is on track to add another title to his resume this year: chairman of the Republic First Bank board of directors as part of a $35 million investment agreement reached between the Norcross Braca Group and the bank following a long proxy fight. “As we said when we first announced we had taken a stake in Republic First more than 18 months ago: we believe that with proper board leadership and a focus on improving operations, the company can provide great service to its customers and depositors as well as value to its shareholders,” his brother, George Norcross, said in October. “This investment and new leadership on the board is the next step of what will be the new Republic First.”\nFor almost six years, this unique duo has successfully led Cooper University Health Care, one of the centerpieces of Camden’s economic revival. Under their leadership, Cooper continues to buck the trend by growing and maintaining strong financial footing including two recent credit rating upgrades from Moody’s and S&P Global. In 2023, Cooper revenue exceeded $2.2 billion and the system now operate more than 100 locations throughout the southern eight counties of the state. Late last year, Cooper opened its largest ambulatory facility, a 166,000-square-foot innovative redesign of an old Sears building at the Moorestown Mall. Phase two of the campus is expected to open during the first quarter of 2024. Additional services will include physical therapy, radiology, infusion services, radiation therapy, an outpatient surgery center, and Cooper and Inspira Neurosciences. “We’ve worked hard to create an extraordinary patient experience on the Moorestown Campus that will match the excellent level of care they receive from our clinical teams,” Mazzarelli said. This year, Cooper also plans to break ground on its Camden Campus expansion as well as continue its growth through an acquisition of Cape Regional Health System that will result in a health care provider with $2.5 billion in revenue and nearly 13,000 employees.\nSince founding SOSV in 1995, O’Sullivan, who serves as managing general partner, has grown the organization into a global venture capital firm supporting investments in more than 100-125 new startups each year, with eight general partners operating offices globally, everywhere from its Princeton headquarters to New York to Shenzhen. Among the initiatives O’Sullivan and SOSV are overseeing is the construction of the U.S. hub for the HAX hard tech startup accelerator program in Newark. SOSV intends to take 100 startups through the program over the next five years – with many already at work in temporary space at the Broad Street headquarters. “In March 2024, we will open a 35,000-square-foot HAX space in Newark, complete with chem, mech, and EE labs as well as a wide array of fabrication equipment,” O’Sullivan wrote in a recent blog for SOSV. “More than ever, it’s fair to say that SOSV offers deep tech founders a uniquely powerful blend of on-staff expertise, world-class facilities, and capital. On top of that, SOSV is the gateway to a vast syndicate of deep tech investors who have already invested in our portfolio companies.”\nNamed in October 2023 as chief executive officer of Nuts.com, Oleksak is the first woman to lead the Cranford-based snack company. She’s also the first non-family member to take the helm, succeeding Jeff Braverman, whose grandfather founded the business in 1929 as a storefront in Newark. Considered the leading direct-to-consumer specialty food company in the U.S., Nuts.com ships its high-quality nuts, dried fruit snacks, sweet treats, confections, gifts and pantry staples to all 50 states and Canada. Within the past year, more than 1 million customers have placed an order with Nuts.com and sales have more than doubled since 2019. Oleksak, who came on board as president in 2021, was responsible for leading the company’s multiyear market growth strategy, scaling and evolving the business-to-business and gifting divisions. Previously, she was chief business officer at Slice, a takeout and delivery app that connects customers with independently owned pizzerias, and online grocery delivery service Fresh Direct. Stepping into the new role, Oleksak – who served as president of the company for the past two years – said she was excited to work with the team to “innovate and unlock new opportunities.” She recently told Modern Retail that while she hopes to triple Nuts.com’s business in the next five years, she also wants to make sure the timing is “what’s right” for the company. Besides boosting the gifting segment, Oleksak also aims to double down on the B2B division, which sup-plies snacks to corporate kitchens. The plan also includes focusing more on wholesale and retail, along with some pop-up experiences and partnerships as a way to have more of a physical presence in stores. As part of the better-for-you snack segment, Nuts.com is already in a strong position given the continuing consumer interest in healthy eating, Oleksak pointed out to Modern Retail, saying, “We have the product, we have the service, we have the execution. We’re already a really sizable company. I think we’re still in early innings of people being even aware of who we are and what we offer. We’re not just nuts.”\nAn executive vice president at Trenton-based Zita Group, Orlando serves as the lead on legislative and regulatory affairs at one of the state’s top lobbying and public affairs firms. Tapping into his more than two decades of experience in policy development, coalition development, strategic outreach and direct advocacy, Orlando has managed complex policy initiatives and negotiated successful outcomes in the legislative and regulatory arenas. Orlando is also the first executive director of the Brewers Guild of New Jersey, a group representing the policy interests of pioneering independent craft breweries and brewpubs across the state. Through his role as the Guild’s government affairs representative, Orlando works tirelessly to promote sensible, innovative policies that will help increase purchase opportunities for consumers and the overall visibility of New Jersey-made craft beer. A high-profile win came in January, when the state Legislature approved a bill easing controversial two-year-old event and food restrictions that the local craft brewing and distilling industry have railed against. While Gov. Phil Murphy vetoed an earlier version of the measure, he signed the compromise bill because lawmakers included some of his proposed revamps of New Jersey’s antiquated liquor license system, including in-creasing the number and types of available liquor licenses. Following the signing, Orlando said the measure “will most certainly set New Jersey’s craft beer industry on a positive trajectory for years to come and shows the state’s commitment towards embracing the ingenuity and local pride which are at the core of every craft brewery which calls the Garden State home” and that “clarifying the rights and privileges afforded to craft breweries in our state will give our industry a stronger foundation to operate on moving forward.” Orlando also believes the newly passed legislation will enable the industry more opportunities “to deliver both the unique products and experiences our customers deserve in our tasting rooms and throughout our communities.”\nA former CEO of the New Jersey Economic Development Authority, Orsen joined SJI in 2017 as senior vice president, general counsel. In 2021, she became the first woman president of SJI Utilities, retaining her SVP title with SJI. She also holds the distinction of being the first woman to oversee both South Jersey Gas and Elizabethtown Gas. Currently, the former – which serves about 400,000 customers in its namesake region – is overseeing a five-year, $200 million infrastructure project to upgrade roughly 250 miles of at-risk equipment. Beyond investing in existing services, the company is looking ahead, too. To close out 2023, South Jersey Gas and Elizabethtown each filed a request with the New Jersey Board of Public Utilities to expand their respective energy efficiency programs for two-and-a-half years, beginning in January 2025. Both South Jersey Gas’s $425 million proposal and Elizabethtown’s $277 million plan would expand opportunities for low-to-moderate income customers and align with the state’s clean energy goals. “Promoting energy efficiency is core to our efforts to reduce costs for our customers while also advancing favorable environmental outcomes,” Orsen said at the time. “We fully support the Murphy Administration’s and the BPU’s efforts to continue the progress our industry has made in enhancing energy efficiency and carbon emissions reduction in our State.” In 2023, Orsen was elected as a new member of the New Jersey Chamber of Commerce board of directors.\nAfter starting as a sandwich maker 23 years ago in the family business, Papanier advanced up the ranks to take over from his father as CEO in 2019 and propelled PrimoHoagies to unprecedented growth. Known for its specialty sandwiches made with high-quality meats and cheeses piled high on fresh-baked rolls, the 30-year-old Westville-based chain has more than 100 U.S. locations and plans to surpass the 300-mark within the next five years. Focused on making PrimoHoagies a nationally recognized name, Papanier has taken several steps to position the company for its biggest push yet, including bringing on a chief financial officer as well as the company’s first marketing director. Papanier has lowered franchising fees in addition to building and improving infrastructure to support operators, such as a new point-of-sale system and finance department focused on helping locations increase store revenues. The efforts appear to be paying off. 2023 was another year of healthy growth, with more than 80 stores in development, including ones in the Albany area, the metro-Detroit market, Louisiana and Massachusetts. With 90% of PrimoHoagie’s business consisting of takeout orders, Papanier told Franchise Times recently the brand will start experimenting with drive-thru service, as well as third-party delivery this year. Papanier also acknowledged that while it’s challenging being in a crowded space dominated by Subway, Jersey Mike’s, Jimmy John’s and Firehouse Subs, he believes the quality of PrimoHoagies’ sandwiches – as well as the fact that the company is still family-owned and operated – is what sets it apart. He also told the publication, “Every week I get calls from private equity firms, and I make it a point to listen to what they have to say because I think it’s always good to know what people are thinking and share ideas. I tell them the same thing, though. We’re just not ready to sell our company and give up control at this point. We’re a private-held, family-owned business and there is a lot more we want to accomplish on our own.”\nThe first woman to hold the title of executive director of the Garden State Wine Growers Association, Perry is working to raise New Jersey’s profile as a wine destination. A seasoned marketing and hospitality industry professional with two decades of experience, Perry was appointed to lead the statewide coalition of 50-plus wineries and vineyards in March 2022 after former director Tom Cosentino passed away in November 2021 from heart disease. Considered the fastest-growing segment of agriculture in the state, the local wine industry generates 272,500 tourist visits and $94.48 million in tourism expenditures annually, providing a boost to New Jersey’s economy and tax bases. Founded in 1987, the GSWGA seeks to drive growth in the industry through wine education initiatives, cooperative marketing campaigns and a slate of annual events dedicated to bringing New Jersey wines into stores and into the spotlight. Since taking the helm, Perry has reinvigorated and refocused the organization’s passport program for visiting wineries, strengthened its relationship with New Jersey Division of Travel & Tourism and increased support of women in wine. Perry is also founder of Segel Associates, a boutique interactive media firm specializing in brand strategy, social media, public relations and crisis communications she built during the early days of the pandemic. She was previously director of marketing and business development for Kings Hall, executive director of Visit South Jersey, chief executive officer of WineLovers LLC and founder of ShareURMeal.\nWell, the 2023-2024 NCAA basketball season hasn’t gone well for Pikiell’s Rutgers Scarlet Knights. At least on the court. As of mid-February, the team is 13-10 overall and 5-7 in the Big Ten, which puts the Knights near the bottom of the conference standings. And while the team got a boost from the return of Jeremiah Williams after his suspension for violating NCAA rules on gambling, a March Madness berth seems out of reach. Nonetheless, Pikiell has transformed the program from a national punch line into a dangerous foe. And the Knights are especially dangerous at home – Jersey Mike’s Arena remains a difficult environment for visitors. And next season could be epic, as highly rated recruits Ace Bailey and Dylan Harper arrive in Piscataway. Those two players have fans dreaming of a conference title and deep run in the NCAA Tournament. Of course, nothing is guaranteed and it will be up to Pikiell to help the team live up to what will almost certainly be national hype next season.\nThe TechUnited CEO had a busy 2023, with a number of developments and plans in the works heading into 2024. The theme of last fall’s eighth annual Propelify Innovation Festival, organized by Price, was all about artificial intelligence – a prescient choice given how rapidly the technology is working its way into daily life. “There was a huge amount of interested in AI – our stage being programmed around AI was a very effective way to educate people on the possibilities there, inspire entrepreneurs, and share what large corporations are up to and interested in getting involved with, so that New Jersey and this community can be ahead of the curve on some of these advancements,” Price told NJBIZ. He also joined Gov. Phil Murphy on the Choose New Jersey-backed economic mission to East Asia. Shortly after returning from that trip, TechUnited announced the official launch of BetterFutureLabs, a startup studio that will act as a co-founder to start new companies here in the Garden State. “We spend a lot of time thinking about – how do we make sure we are ahead of the curve and not doing the same things we have been doing for many years?” Price told NJBIZ. “I think you will see that that spirit continues very much in 2024.”\nPullin is president and CEO of Virtua Health, South Jersey’s largest health system. Recognized as a Top 100 Innovator by Modern Healthcare magazine, Pullin focuses on all that a health system should be. According to Virtua, his accomplishments include establishing an academic affiliation and sweeping partnership with Rowan University to bolster the future medical work-force, advance innovation and research, and attract top talent to the region. The Virtua Health College of Medicine & Life Sciences includes the state’s only osteopathic medical school. In addition, Pullin developed a unique and growing fleet of mobile health programs that bring vital services directly into vulnerable communities; launched South Jersey’s first proton therapy center in partnership with Penn Medicine; established Hospital at Home programs at all five Virtua hospitals, creating one of the first and largest programs statewide; secured a $2 million federal grant to expand and enhance the Virtua Center for Organ Transplantation—South Jersey’s only such facility; and instituted Virtua’s “Culture of WE” centered on employee respect and empowerment, including a robust diversity, equity and inclusion program.\nQuallis is founder and CEO of Scotch Porter, a Newark-based grooming and wellness company that consumers may recognize from the shelves of Target and Walmart. Founded in 2015, the company’s personal care products (for beards, hair and now skin) are made with clean ingredients. Beyond changing what people are using, Quallis is also broadening the conversation around wellness routines and why they’re important for Black men. And customers are buying in. In August, WWD named Scotch Porter one of its “Power Brands,” not just for riding the wave of soaring sales in the beauty space but helping to create it. According to Barron’s, Scotch Porter’s sales add up to eight figures annually, and in 2023 the company was on track to grow 70% in the second half the year. All of Quallis’ good work is also being shared with other businessowners. In 2021, he joined the Target Accelerator Program. As its founder in residence, Quallis mentors more than 20 minority brand founders each year. In 2022, the company introduced the Scotch Porter Impact Fund, pledging to contribute 1% of its total sales to the effort. So far, that’s netted the nonprofit $331,713 in total donations and emboldened it to impact 76,776 lives.\nSince January 2020, Christina Renna has served as the president and CEO of the Chamber of Commerce Southern New Jersey. Renna brings unique perspective to this role – with a past stint as a Gov. Chris Christie staffer and deep experience working for the CCSN before being tapped to take the helm. A South Jersey native, Renna and the CCSNJ serve as a trusted voice and advocate for the region’s business community. An example of that advocacy can be found in the CCSNJ’s recent report, “Long Story Short: South Jersey – A Busy Policymaker’s Guide to Under-standing a Misunderstood Region,” which details what is unique and misconstrued about the area, as well as possibilities and hurdles to economic growth. “South Jersey is deeply misunderstood by policymakers,” Renna said. “Although the region has many similarities, its differences make holistic policy measures difficult to enact. As a result, South Jersey is at times neglected when well-intentioned policies are crafted and intended to have a statewide benefit.” Renna also serves as chair of the Public Policy Committee on the Walter Rand Institute for Public Affairs advisory board at Rutgers University-Camden; on the advisory board of directors for Habitat for Humanity of Burlington and Mercer Counties; and as a member of the Burlington County Workforce Development Board.\nThe CEO and co-founder of Newark-based manufacturer ZAGO Manufacturing Co. Inc. also holds high profile appointments as a member of the board of trustees for New Jersey Manufac-turing Extension Program and as a new addition to the board of the New Jersey Business & Industry Association. She’s also a councilmember in Fair Lawn, where her committee work includes the Planning Board and Fair Lawn Main Street. Formerly the Fair Lawn Economic Development Corp., the latter, nonprofit entity rebranded at the start of 2023. At the time, Rottenstritch said the new structure would allow local needs and goals to be better addressed. Meanwhile, Zago achieved Certified Women Business Enterprise Status over the summer opening new avenues for the company. Rottenstrich characterized the move as a significant milestone. “It enhances access to contract opportunities where sustainability and supplier diversity is important, such as in offshore wind,” she commented at the time. As the Garden State looks to get some more air in its sails in the developing sector, Zago stands to be part of the work with its sustainable fasteners and components.\nAfter Edmund DeVeaux stepped down from his role as president of the New Jersey CannaBusiness Association in April 2023, Rudder was tapped to return as leader of the influential industry group he founded seven years earlier. One of the most prominent figures in the Garden State’s evolving cannabis market, Rudder has been involved in the industry since before it even existed. A former New Jersey state assembly member representing the 8th legislative district and mayor of Medford, the Republican began focusing on medicinal cannabis matters in 2016 after joining Burton Trent Public Affairs as the lobbying and consulting firm’s vice president and partner. With a goal of fostering expansion into a responsible and sustainable industry, Rudder founded the NJCBA and served four years as its president. Under his leadership, the organization led cannabis reform efforts to increase patient access, as well as promotions to end stigma and stereotypes associated with the plant. With New Jersey’s recreational-use market poised to mark its two-year anniversary in April, Rudder remains bullish about the still-developing sec-tor and pushes back against criticism over the pace at which it has grown. Moving into 2024, he expects market forces and regulatory changes – such as the potential removal of cannabis from a Schedule I to a Schedule III controlled substance – to benefit the space in terms of business financing, consumer prices and product quality/variety. Rudder – once dubbed “the Mayor of Cannabis” by the Star-Ledger – is also gearing up to open a licensed retail dispensary in Riverside, Township Green LLC, later this year.\nThe CEO of Carlstadt-based Russo Development earns high praise from his peers, especially when it comes to the future of industrial. With more than a half-century of experience in the vertical, that tracks. And that historical insight could be invaluable as the space settles following some uncharacteristically hot years. That experience has also helped Russo Development win two reversals for project denials in the wake of proliferating backlash to warehouses across the state. The family-owned business also has specialties in data centers, residential and mixed-use projects. In September, Russo capped a six-year transformation at a former 42-acre industrial site adjacent to Kean University. Now Vermella Union, the community features 900 apartments, a park and 35,000 square feet of retail space. In Newark, Russo’s 14th Vermella-branded community just started welcoming residents. With nearly 300 units, 40,000 square feet of amenity and social spaces and a location less than 500 feet from a train station, the project is an anchor for the redevelopment of the Lower Broad Street neighborhood. And there’s is more coming down the pike. To close out 2023, Russo won approvals for its plans to bring 360 units of multifamily housing to another high-traffic area, next to the Paramus Mall. An active member of NAIOP, Urban Land Institute, the Meadowlands Chamber of Commerce and the New Jersey Chamber of Commerce, last year Russo and his family’s commitment to the Meadowlands Area YMCA was commemorated with a naming gift, also from the Russo Family Foundation, for the Russo Family Food Pantry.\nLeading one of the largest supermarket operators in New Jersey is Saker, a fourth-generation grocer, former chair of the New Jersey Food Council and the biggest stakeholder in Wakefern Food Corp., the Keasbey-based retailer-owned cooperative. With 39 ShopRite stores in Monmouth, Ocean, Somerset, Middlesex, Mercer and Somerset counties, as well as Dearborn Market in Holmdel, 39 pharmacies, two liquor stores, four commissary kitchens and a transit dock facility that supports its local stores, Saker employs over 10,000 associates. In recent years, Saker has relocated older ShopRite stores on Route 35 in Middletown and Wall to newer and larger locations. Soon, the company will begin a project to replace a small 60-year-old ShopRite on Route 9 in Freehold with a larger supermarket next door. Saker also serves as secretary of Wakefern’s board of directors and is an active member of the NJFC, an organization his father, Joe Saker, helped found and served as the first chair in 1969.\nThose issues in the office sector? If they’re something that Saraceno and Schultz are contending with, outwardly it’s hard to see. As managing partners the pair lead Onyx Equities LLC. The full-service, Woodbridge-based real estate firm specializes in investment, asset repositioning and ground-up development, having acquired more than $4 billion worth of assets throughout New Jersey, New York and Pennsylvania and executed over $1 billion in capital improvement projects under its signature repositioning program. That latter part lends itself to Onyx’s success. In 2023, the company added high-profile tenants at its suburban office hubs as well as the transit-adjacent Gateway Center in Newark. After 25 years in its Parsippany office, NJM Insurance agreed to move within the municipality to 53,000 square feet of new space at The Arbors, Onyx’s five-building, 60-acre campus. Meanwhile, J&J consumer goods spinoff Kenvue signed a long-term lease at the firm’s 46-acre Summit East campus. In the state’s largest city, an Onyx property won out as NJ Transit’s new location with the agency entering a 25-year agreement for approximately 407,000 square feet of space at Two Gateway Center. Onyx has been ahead of the curve carving out space in the growing life sciences sector, too. After acquiring Merck’s former 100-acre Kenilworth campus in May, the firm revealed plans for the Northeast Science and Technology Center. At the time, Gov. Phil Murphy applauded the news “of one of our leading developers prepar[ing] to build a high-tech life sciences hub, consistent with our vision for New Jersey’s economic future.” Last week saw action on the effort, with Out-shine Properties tapped to renovate and lease the campus. First up: the revamp of a 280,000-square-foot research and development plant. NEST is also set to host its first life sciences conference in the coming year, with Bisnow.\nAfter founding Little Falls-based business law firm Scarinci Hollenback in 1988, as managing partner Scarinci has grown the practice to become a regional leader in environmental, land use, commercial real estate, transactional intellectual property and cannabis with 60-plus attorneys in New Jersey, New York and Washington, D.C. Thanks to two recent mergers, its range of services has expanded further. In October 2023, Scarinci Hollenbeck united with Spector & Ehrenworth PC, a Florham Park firm specializing in commercial litigation, bankruptcy and creditors’ rights, commercial transactions, real estate and business organizations. Then, last month, Scarinci Hollenbeck announced it was merging with Warren Law Group, a New York City practice focused on financial services, government investigations and business litigation. Scarinci was also appointed to serve on the advisory board of Term Limit the Court, an organization pushing for the end of lifetime tenure of U.S. Supreme Court Justices. One of the most highly respected attorneys in New Jersey, Scarinci is a sought-after speaker and columnist when it comes to Constitutional Law, having written numerous pieces for online media and published two books, “David Brearley and the Making of the United States Constitution” and “Redistricting & the Politics of Reform.” Additionally, he edits the award-winning Constitutional Law Reporter, an educational website that contains an annotated U.S. Constitution and information about the Supreme Court.\nLast year, the New Jersey Performing Arts Center made the leap from stage to screen, with the announcement that Lionsgate, in partnership with Great Point Studios and NJPAC will anchor a $125 million, 12-acre production facility in Newark. NJPAC, which Schreiber leads as president and CEO, will manage public affairs and community relations for the project in addition to creating educational programs and internships for high school and university students in the city – work it pursues similarly from its base on Center Street. And the future is getting even brighter. The New Jersey Economic Development Authority approved nearly $199.7 million in Aspire tax credits for a transformative, mixed-use residential project in the area surrounding the performing arts center. A nearly 580,000-square-foot mixed use development, the NJPAC District will connect the existing venue to the larger Newark community, serving as a touch-point between the city center and a new riverfront park. “From its earliest imaginings more than a generation ago, NJPAC was designed as a unique anchor cultural institution in service to the city of Newark and the state of New Jersey,” Schreiber said when the award was announced. “Our audiences, staff, and programming reflect the remarkable diversity of the many communities we serve. Today’s landmark tax credit award makes possible the exciting next phase of the Arts Center’s evolution, and the dynamic neighborhood we will build on our campus will help further elevate downtown Newark’s status as a 24/7 live, work, and play destination.”\nA leading voice for the Garden State business community and a mainstay on lists such as these, Siekerka serves as the president and CEO of the New Jersey Business & Industry Association. Under her watch since 2014, the organization has expanded its voice on critical policy issues affecting New Jersey businesses, as well as its member services and resources. And NJBIA is consistently on the front lines of those major policy issues – such as last year’s corporate business tax surcharge sunset and many more. The organization holds events throughout the year, drawing the state’s top leaders and stakeholders from business and government. In addition to fighting for business owners in her work with NJBIA, Siekerka is also a fierce advocate for empowering and supporting women leaders – reflected in events such as the annual New Jersey Business Women Leaders Forum. “We have a lot of very talented women here in the State of New Jersey,” Siekerka told NJBIZ during last year’s forum. “It’s for them. It’s providing visibility that they’re here. And it’s that next generation. As I always say – our executive and our higher-level women – reach back and bring them forward and share how they got into the C-suite and the boardroom. So, we focus on C-suite and boardroom.”\nSmall is chairman of Hackensack University Medical Center’s Department of Psychiatry and serves as physician-in-chief for behavioral health at Hackensack Meridian. He’s also the inaugural H. Hovnanian Family Foundation Endowed Chair in Behavioral Health at Hackensack Meridian Health, which was created with a $3 million donation from its eponymous philanthropy. Small joined HMH in 2020 and oversees educational programs and training. He is responsible for his department’s clinical operations and develops and expands research and academic programs, in addition to developing and maintaining quality initiatives. He also leads recruiting efforts for physicians within the behavioral health field. In an interview with NJBIZ not long after he arrived at HMH, Small said he was impressed by the health system’s commitment to behavioral health. While HMH continues to expand its services and capabilities – something CEO Bob Garrett mentions frequently – Small’s leadership will only grow in importance as the system continues to gain prominence.\nSmith is an employment and civil rights lawyer and the co-founder and partner of Smith Mullin PC in Montclair. Practicing for more than four decades, Smith has argued before the U.S. Supreme Court. Among her most high-profile cases, she represented broadcast journalist Gretchen Carlson in her sexual harassment case against former Fox News CEO Roger Ailes, which was settled in 2016. Beyond the win for the client, Smith’s power is evident in the impact that has resonated since. Currently, she’s representing a former Trump National Golf Club employee who claims she was sexually harassed by her manager and tricked into signing an NDA by the ex-president’s lawyer, Alina Habba. Smith is a speaker at conferences and summits and her namesake firm has been featured in Forbes, CNN, The Washington Post and other national outlets. Speaking with New Jersey Monthly magazine over the summer, she touched on the importance of the #MeToo movement for setting a new precedent for women. “I absolutely think women are feeling more empowered,” Smith told the publication. “And when I speak to younger women, they are really informed in their view of the world, that they don’t have to tolerate the abuse that all the rest of us have felt, on some level, that we had to tolerate for years. So, I am hopeful. But there’s always a backlash.” And when there is, count us lucky someone like Smith is out there, working to turn the tide.\nSommer is an adviser and confidante to anyone who matters in Democratic politics in this state. And some Republicans, including those at high levels. And reporters, who value his insight and connections. And Rutgers students who take his Public Policy Advocacy class at the university’s Bloustein School of Planning and Public Policy. As the state’s political pros gear up for a presi-dential race and congressional elections this year, and a gubernatorial campaign – with no incumbent – in 2025, Sommer’s counsel will be highly sought after. Outside of campaigns, he can be counted upon to make connections and provide important context to a variety of political and policy issues. He knows the personalities, the histories and the motivations of the state’s most important political players, including South Jersey boss George Norcross. New Jerseyans’ understanding of the state is shaped in no small measure by Sommer’s guidance to those responsible for reporting the news. Sommer is also a former president of Rock Entertainment Group, president of Observer Media Group, and was a partner and executive vice president of national PR firm MWW.\nAfter Wakefern Food Corp.’s longtime president Joe Sheridan announced plans to retire at the end of 2023, Stigers, an industry veteran, was tapped to assume leadership of the nation’s largest retailer-owned grocery cooperative. Before joining Keasbey-based Wakefern, Stigers served as chief executive officer of Cub Foods, a Minnesota-headquartered organic and natural food unit of United Natural Foods Inc., since 2019. Before that, he spent eight years at SuperValu, beginning in 2011 as president of Shaw’s/Star Market in New England. In 2013, he went on to lead SuperValu’s northern wholesale region and then, in 2014, he was named president of Cub Foods. In 2016, he was promoted to the position of executive vice president, SuperValu Wholesale and Supply Chain Services, and occupied that role until it was acquired by UNFI in 2018. In taking the reins, Stigers said, “I am excited to join Wakefern at this important time in its history. The strength of the cooperative and its solid position as a regional grocery is well-known in the industry. I am looking forward to joining the team and working alongside the cooperative membership to help shape its future.” Stigers also said, “The past 77 years has seen Wakefern achieve the considerable feat of becoming the nation’s largest retailer-owned cooperative. This cooperative has a pretty remarkable history, and I’m so grateful to be part of it. I’m excited to think about what the next 77 will bring and how we can take the next steps on Wake-fern’s journey into the future.” Founded in 1946, Wakefern’s 48 member companies – which include ShopRite, Price Rite Marketplace, The Fresh Grocer, Gourmet Garage, Dearborn Market and Fairway Market – own and operate 365 stores across New Jersey, New York, Connecticut, Pennsylvania, Maryland, Delaware, Massachusetts, New Hampshire and Rhode Island.\nMichael Stivala has served as president and CEO of Suburban Propane since 2014 – and has extensive experience and expertise in the propane industry. “Fiscal year 2023 was another year of strong performance in the face of a challenging weather pattern and a persistent inflationary environment, and we made significant advancements in our long-term strategic growth initiatives with the expansion of our renewable natural gas business,” said Stivala during a November earnings announcement. Under his watch, Suburban Propane is undergoing a transformation – with Stivala noting that the company’s long-term growth plan is to continue fostering the growth of its core propane business while making strategic investments in the energy transition to lower carbon renewable energy alternatives. In December, he was recognized for those efforts – earning a finalist nomination in the Chief Trailblazer of the Year category at the 2023 Platts Global Energy Awards. The company also earned two nominations. “As society transitions, Suburban Propane is leveraging our 95-year legacy of an unwavering commitment to safety and excellence in customer service, and our reputation as a trusted distributor of energy to local communities in order to position the business for long-term growth and sustainability in a lower carbon economy,” said Stivala.\n“The future of human health is being shaped today, and it is clear that RBHS [Rutgers Biomedical and Health Sciences)] – as a place where solutions are discovered and applied, leaders are trained, and innovation flourishes is poised to influence its growth,” said Strom, who serves as chancellor of RBHS. Over several decades, his body of work has been extensive – writing more than 580 papers and 14 books; and serving as principal investigator for more than 275 grants, including over $115 million in direct costs. He has also spearheaded the effort to merge New Jersey Medical School and Robert Wood Johnson Medical School under one umbrella as the Rutgers School of Medicine. “This integration will empower Rutgers to navigate the dynamic landscape of health care, meeting the ever-evolving and complex needs of the future while flourishing amidst a competitive market,” said Strom. “We will amplify Rutgers’ position as a trail-blazer in 21st-century medical education and solidify our role as a leader in advancing the frontiers of health care.”\nSugden, the managing partner of Edison Partners, is one of New Jersey’s most prominent private capital executives. The firm’s portfolio companies are located outside Silicon Valley in 18 states. It has made more than 270 investments and 218 exits and boasts $1.7 billion in assets under management. In January, Edison led a $43 million investment in 120Water, a cloud-based water management and testing system. Under proposed federal Lead and Copper Rule Improvements, all lead water service lines around the country must be replaced within 10 years and water supplies must undergo regular testing, surveillance and remediation. If adopted, the rule would take effect Oct. 16. 120Water, based in Zionsville, Ind., operates a digital platform for testing, data collection and consulting services. The company has posted 60% annual revenue growth and the Environmental Protection Agency’s proposed water rules are expected to create a $2 billion market, according to Edison Partners. 120Water has worked with government agencies in Newark; Chicago; Providence, R.I.; and Buffalo, N.Y.\nTom Szaky is founder and CEO of TerraCycle, a leader in the collection and repurposing of complex waste streams. TerraCycle operates in 21 countries, working with some of the world’s largest brands, retailers and manufacturers to create national platforms to recycle products and packaging that currently go to landfill or incineration. In May 2019, the company launched Loop, a circular reuse platform that enables consumers to purchase products in durable, reusable packaging. Loop is available in France, the UK, Japan and the U.S., and is a key step in helping to end the epidemic of waste that is caused by ‘single-use’ consumption. Szaky and TerraCycle have received hundreds of social, environmental and business awards and recognition from a range of organizations including the United Nations, World Economic Forum, Schwab Foundation, Fortune Magazine, Time Magazine and the U.S. Chamber of Commerce. Szaky is the author of four books, “Revolution in a Bottle” (2009), “Outsmart Waste” (2014), “Make Garbage Great” (2015) and “The Future of Packaging” (2019). He also created, produced and starred in TerraCycle’s reality show, “Human Resources,” which aired on Pivot from 2014-2016 and is syndicated in more than 20 foreign markets on Amazon and iTunes.\nSince taking over the reins as Gibbons PC’s managing director in early 2022, Torcicollo has maintained the standard set by longtime leader Patrick Dunican, who first transitioned to executive chairperson before departing the firm last month. “Having been at the firm about as long as he has been, and having worked as closely as we did in our 30-plus years here together, Gibbons will definitely be a different place without Patrick Dunican,” said Torcicollo. In June, Gibbons announced that former Assistant U.S. Attorney and First Assistant Attorney General of New Jersey Ricardo Solano Jr. was rejoining the firm to launch, lead and build the standalone White Collar & Investigations Group. In the fall, Gibbons was recognized by NJBIZ for the 18th year in a row as a Best Places to Work in New Jersey honoree. “Our employees, both attorneys and non-attorneys, are undoubtedly our greatest asset, and we will always be committed to earning their dedication,” said Torcicollo. “We also know that creating a positive workplace for them ensures that our clients – many of whom are also on this list – will continue to receive the top-notch service they have come to expect from Gibbons.”\nAn advocate for responsible cannabis use and champion of locally owned cannabusinesses, Trent is well-known for her enthusiasm, mentorship and commitment to helping New Jersey build a sustainable, equitable legalized industry. Trent is the founder and chief executive officer of Valley Wellness in Raritan, which was the first independently owned medical dispensary to open in the state and second to launch in Somerset County. Since opening its doors, Valley Wellness was approved by the New Jersey Cannabis Regulatory Commission to expand operations into the personal-use market in May 2023. Over the past year, Trent has forged several retail partnerships with other woman-owned manufacturers and cultivators in New Jersey, including Brute’s Roots in Egg Harbor and ButACake in Jersey City. She’s also a licensed attorney who serves as co-chair of the New Jersey State Bar Association’s Cannabis Law Special Committee, as well as the force behind NJ Cannabis Certified, a 15-hour educational certificate program taught virtually in conjunction with eight community colleges across the state that is geared toward those interested in working in the industry or wanting to learn more about cannabis. In a recent member spotlight, the New Jersey Cannabis Trade Association recognized Valley Wellness and Trent, saying the business quickly became “a prominent figure in New Jersey’s cannabis industry” for its focus on exceptional customer service and high-quality products for both medicinal patients and recreational customers. NJCTA added: “Not only does Valley Wellness provide a top-notch in-store experience, but they also extend their expertise to fellow operators, fostering the success of the industry.”\nFollowing the October bombshell announcement by Orsted that it was pulling the plug on Ocean Wind 1 and 2, the future of the Garden State’s offshore wind sector appeared very much in flux. At the time, that decision left Atlantic Shores Offshore Wind as the only approved offshore wind farm project, slated to be about 10 miles – 20 miles off the coast between Atlantic City and Barnegat Light (two others have since been approved by the NJBPU). Enter Veldhoven, Atlantic Shores Offshore Wind CEO, who maintains that the project remains on track – with the potential to bring power to more than 700,000 homes and gen-erate $1.9 billion in economic activity, while creating some 18,000 jobs. The project stakeholders say they remain committed to delivering safe, reliable, renewable power – while establishing a thriving domes-tic offshore wind industry here in the Garden State. “This means supporting New Jersey in meeting its clean energy goals and driving economic growth,” said Veldhoven in November. “Despite these headwinds, we are actively engaged in conversations with the administration, regulators, and elected leaders across New Jersey that confirms the state’s commitment to offshore wind, and we are working with them to identify viable solutions that will not only preserve the progress made thus far in the industry, but also create a landscape that will enable the successful execution of the Atlantic Shores portfolio.” A lot of eyes will be on this project – and Veldhoven – to see if Atlantic Shores Offshore Wind can deliver.\nEditor’s note: This list was updated at 2:31 p.m. ET Feb. 20, 2024, to include updated figures in Richard Saker’s profile. Additionally, it was updated at 9:36 a.m. ET Feb. 23, 2024, to correct the description of the green space for the new Valley Hospital in Audrey Meyers’ profile.",
  "word_count": 12061,
  "scraped_at": "2026-02-14T12:07:34.641301"
}