{
  "article_id": "d5ea086661c9",
  "url": "https://www.theguardian.com/world/2025/sep/16/wednesday-briefing-trump-arrives-in-the-uk-and-his-playbook-is-reshaping-the-british-right",
  "title": "Wednesday briefing : Trump arrives in the united kingdom – and his playbook is reshaping the British right",
  "date": "20250917T061500Z",
  "domain": "theguardian.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Good morning. Donald Trump arrived in Britain last night, landing with his wife, Melania, at Stansted airport and then taking a helicopter to central London. But he had an advance party: the mass of Maga political messages that have been picked up and repurposed by some fellow travellers, namely those of the British nationalist right.\nBritish politicians have imitated their frankly sexier US cousins for decades, of course. But something distinctive to the Trump era has been particularly apparent in recent months: the borrowing of an inescapably American political style in order to implant it in a political culture that barely knows what to make of it.\nIt’s been visible across the spectrum of the right for a while, from Kemi Badenoch to Tommy Robinson, but it was especially obvious at Saturday’s far-right rally in London, which Keir Starmer belatedly said yesterday represents the “fight of our times between patriotic national renewal and decline and toxic division”. Participants wore Maga hats, heard speeches from Elon Musk and Stephen Bannon, and, as Daniel Boffey sets out here, paid tribute to the assassinated conservative activist Charlie Kirk. For supporters and opponents alike, Trump’s trip to the UK may look like a glimpse of the politics they would like to bring here as well.\nWhat’s far less clear is how much all this means to the wider voting public, who may not know their Bannons from their bunions – and whether it is a useful style for political actors whose appeal is based on relentless nativism. As Donald Trump meets the king today, and affirms that his main interest in the UK is as a kind of ossified theme park, today’s newsletter – with the help of Aamna Mohdin – asks what the British right wants from him. Here are the headlines.\nFive big stories\n-\nGaza | Israel unleashed its long-threatened ground offensive in Gaza City on Tuesday, sending tanks and remote-controlled armoured cars packed with explosives into its streets, in defiance of the findings of a UN commission that it was committing genocide in the Palestinian territory.\n-\nHollywood | Robert Redford, star of Hollywood classics including Butch Cassidy and the Sundance Kid, The Sting and All the President’s Men, has died aged 89.\n-\nUS news | Tyler Robinson, the man accused of fatally shooting the far-right activist Charlie Kirk, was charged with aggravated murder in Utah yesterday. Prosecutors say they intend to pursue the death penalty against the 22-year-old if he is convicted.\n-\nImmigration and asylum | An Eritrean man has had his deportation to France under Labour’s “one-in, one-out” scheme halted at the 11th hour after he won a high court challenge. The 25-year-old man is the first to win such a challenge against the new scheme.\n-\nObesity | A daily pill for weight loss can help people reduce their body weight by as much as a fifth, according to a trial that could pave the way for millions more to shed pounds. Orforglipron is manufactured by Eli Lilly and targets the same GLP-1 receptors as weight loss injections such as Mounjaro.\nIn depth: ‘The goal is not just victory, but reshaping the landscape’\nLiz Truss complaining, endlessly, about the “deep state”. Nigel Farage promising to “make Britain great again” at a party conference (pictured above) designed to resemble an American political convention. Reform’s promise of Doge-style units to root out council waste. “Woke” supplanting “political correctness”. Tories calling on the government to “release the Mandelson-Epstein files”. Kemi Badenoch and Blue Labour warning about the dangers of “DEI” instead of “positive discrimination”. Even the assertion that a national flag is a straightforward emblem of patriotism rather than a potentially divisive symbol, a claim with a more plausible lineage in the US, where schoolchildren pledge allegiance to it every day, than it has here.\nThere are myriad recent examples of rightwing political discourse making the trip across the Atlantic and taking up residence in the UK. The strangest thing about it is that very little effort is made to explain the more obscure parts of it to a local audience, or to disguise the unmistakably Trumpy associations in a country where he remains pretty unpopular. So why is the right so attracted to a style that turns so much of the public off?\nThe history\nIt would be wrong to suggest that a fascination with American politics is a singularly rightwing phenomenon. “There’s been a magnetic attraction to American politics in Britain for a long time,” said Robert Saunders, a political historian at Queen Mary University of London. “You think of Gordon Brown holidaying in Cape Cod, or the influence Bill Clinton had on Tony Blair.” We might add the enduring liberal obsessions with JFK, Barack Obama and The West Wing.\nJournalist and author Daniel Trilling told Aamna that as recently as last year, “there was an idea that the incoming Keir Starmer Labour government would be the deputy to this revived US liberalism under Joe Biden. The Atlantic alliance was strong again and they were going to sort out Ukraine and the rest of it. So when the political weather in America changes, so it does here.”\nBut those habits were really about strategy, and conversations among political obsessives – not the messages they deliberately shared with the mostly indifferent public. “It has certainly ramped up to a new level recently,” Saunders said. “And that is largely happening on the right.”\nWhat’s different now\nOne obvious reason populists, extremists and their imitators look to the US for inspiration is that their politics are further advanced there than anywhere else in the English-speaking world. “American far-rightism is more developed in terms of actually wielding power,” Trilling said. “So it’s not surprising that it influences the development of the far right here and elsewhere.” As Sadiq Khan says in an opinion piece for the Guardian, Trump has “perhaps done the most to fan the flames of divisive, far-right politics around the world in recent years”.\n“That’s the most straightforward explanation,” Saunders said. “It’s just a visible and exciting model of success for the right. The Tories are staring into the abyss after the worst defeat in their history; Reform is on the rise, but they still only have five MPs. What this language embodies is what the right can do not just electorally, but culturally – it’s part of a project that’s not just about winning elections, but reshaping the entire landscape.”\nThat nihilist streak is anathema to old-fashioned one-nation conservatives. But that group is now a political irrelevance, and their successors find alliances across the same borders they’re so keen to put on lockdown. “They share online spaces in a way that obviously wasn’t true 20 years ago,” Saunders said. “They are radicalised by the company they keep. And in a very concrete way, Tommy Robinson’s revival is obviously linked to Elon Musk reactivating Robinson’s X account.”\nAll that might point to one reason for adopting a style that is so baffling to so many people: political actors are no longer fighting for a majority, but for the attention of the share of the public who will give them the time of day. That engagement is inevitably deepest among the perpetually online.\nThe political project\nThis is not a merely rhetorical relationship, said Trilling. “There are obvious shared aims between far-right populists in the UK and US. Going back at least to 2016, the big populist upsets of that year: Trump getting elected and the Brexit referendum being won by leave – the key figures behind those knew one another and talked about these things as part of a shared project.\n“The far-right position then, which is now becoming the mainstream right position, is that globalisation went too far, it ended up weakening our own economies and diluting our national identity through mass immigration, and what’s needed is a restoration and reinforcing of the borders.” Similar trends can be seen in national conservative movements across Europe, whose adherents have picked up the same Maga idioms from Italy to Hungary.\nEvidence for that shared project was visible in the appearances by Steve Bannon and Musk at Saturday’s rally, as well as JD Vance’s notorious intervention in European politics, and meeting with the AfD leader Alice Weidel, in Munich earlier this year. But it is also apparent in the financial support flowing from wealthy Trump supporters to rightwing British thinktanks – and which previously funded Tommy Robinson as he sought restoration to the national political stage.\nThe risks for the right\nEven if it gets their supporters amped up, there are limits to the utility of this style for the right. “They should be a bit cautious,” Saunders said. “There’s a danger for any nationalist movement in looking like the branch office of a foreign power, and if you look like somebody else’s mini-me, you have a problem.” He pointed to the example of Oswald Mosley in the 1930s, who was eventually interned because of suspicions that his first loyalties were to Germany. “That’s why Farage is so personally important,” Saunders said. “As a recognisably British character who it’s harder to define as a puppet.”\nThen there’s the question of what policy prescription even those who might give the far right a hearing actually want. “The Maga movement is much more ‘let’s just slash everything away’,” Trilling said. “But in Britain, I don’t think most people, including a lot of those who were at that protest last Saturday, think about their relationship to the state in the same way. Opinion polls do seem to bear out that people in Britain, generally across the political spectrum, tend to favour higher social spending from the government.”\nThe question, then, is whether any branch of the right can yoke the thrill of Trumpy nihilism to a persuasive claim that they care about things like the NHS, in a more authentically British tone of voice. But it remains to be seen whether they can transcend the same thing they deplore in their country: a cosmopolitan, magpie spirit, addicted to aspects of a foreign culture even as they dismiss them.\nWhat else we’ve been reading\n-\nAfter the death of Robert Redford (above) at 89, Peter Bradshaw pays tribute to a “supremely beautiful movie star” (the life in pictures proves it) who was also “always an outlier”. Archie\n-\nIn Knowsley, where healthy life expectancy is about 54 years, decades of social and economic decline have transformed one of Labour’s safest seats into what Kirsty Major found now feels like one of Reform’s newly minted constituencies. Aamna\n-\nEducators across the world are working in dangerous and febrile conditions. I was moved by the quiet heroism of teachers in Lebanon, Niger, Ukraine and Afghanistan who spoke of what keeps them going. Aamna\n-\nThe banquet King Charles is hosting for Donald Trump tonight, Marina Hyde writes, is “the most hideously ill-starred dinner party since the vomiting scene in Triangle of Sadness”. And for more than one attendee, Jeffrey Epstein will be “a ghost at the feast”. Archie\n-\nThe Israeli city of Tel Aviv, long known as the country’s liberal capital, is only 60km away from Gaza. This video by Matthew Cassel, who speaks to Israelis about a war that is increasingly being described as genocide, is well worth a watch. Aamna\nSport\nAthletics | Kenya’s Faith Kipyegon (pictured above) won the women’s 1500m in 3:52.15, securing her fourth world title in a row, while USA’s Cordell Tinch went from working in a toilet paper factory to winning the 110m hurdles.\nFootball | Substitutes Gabriel Martinelli and Leandro Trossard scored the goals that gave Arsenal a 2-0 victory over Athletic Bilbao on the opening day of this year’s Champions League. Later last night Tottenham beat Villarreal 1-0 thanks to an own goal from goalkeeper Luiz Júnior.\nBasketball | A group of 18 former employees of the British Basketball League (BBL) are taking legal action against the competition that replaced it, Super League Basketball, in the latest development in the extraordinary civil war that has engulfed the sport.\nThe front pages\n“Trump fans the flames of division, says Khan” is the Guardian’s top story while the Mirror goes with “The ego has landed”. The Times greets the US president with “Technology deal worth billions is boost for UK” while the i paper’s angle is “Starmer to press Trump on Israel – as UN warns of Gaza genocide”. The Financial Times has “Tax fears mount as productivity blow confronts Reeves with bigger fiscal gap”. The Express cites expert opinion in proclaiming “4m to pay tax on state pension in 2 years”. In the Telegraph you can read “Migrant flight grounded by court” which the Mail reports with glee: “Human rights fanatic PM sunk … by human rights” while the Metro wraps that together with Trump’s arrival: “Don in … none out” and it’s as well that we leave things there.\nToday in Focus\nUS on the edge after Charlie Kirk’s killing\nThe killing of the rightwing activist and podcaster has left the US reeling. Yet President Trump and his supporters are a long way from calling for calm. Ed Pilkington reports.\nCartoon of the day | Ben Jennings\nThe Upside\nA bit of good news to remind you that the world’s not all bad\nRed cups are a staple of the student partying scene in the US, beloved by revellers at frat parties and beer pong enthusiasts. But the material they are made from is very difficult to recycle, adding to the growing plastic crisis.\nEnter engineering student Lauren Choi (above), who saw an opportunity to turn these problematic cups into fabric. In 2019, during her senior year, she led a team that built an extruder machine to spin plastic waste into textile filaments. They partnered with campus fraternities to gather thousands of red cups.\nChoi then took a weaving class so she could make a sample fabric out of those filaments. That became the foundation for the New Norm, a textile company that today transforms a variety of post-consumer recycled plastic into stylish sweatshirts and beanies.\nSign up here for a weekly roundup of The Upside, sent to you every Sunday\nBored at work?\nAnd finally, the Guardian’s puzzles are here to keep you entertained throughout the day. Until tomorrow.",
  "word_count": 2385,
  "scraped_at": "2026-02-14T12:43:39.926155"
}