{
  "article_id": "d607b78c8fcb",
  "url": "https://www.kmbc.com/article/kc-current-kmbc-chronicle-pitch-fit-for-a-queen/60289432",
  "title": "KMBC 9 Chronicle : A Pitch Fit for a Queen",
  "date": "20240411T053000Z",
  "domain": "kmbc.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "KMBC 9 Chronicle: A Pitch Fit for a Queen\nThis is the story of how Kansas City constructed the world’s first sports stadium built solely for the purpose of housing a women's professional team.\nThis is the story of how Kansas City constructed the world’s first sports stadium built solely for the purpose of housing a women's professional team.\nThis is the story of how Kansas City constructed the world’s first sports stadium built solely for the purpose of housing a women's professional team.\nKansas City is, at its core, a place of majesty and tradition.\nA place bold enough to call itself a kingdom and yet small enough to relish and embrace the role of the underdog.\nA spark of life in the quiet of the Midwest. Since its origins in the early 1800s, Kansas City has become the unexpected home to Mavericks, Royals, Chiefs, and even Monarchs.\nFast forward to 2024, and it's only fitting — if not overdue — that the city finally built itself a pitch fit for a queen.\nThis is the story of how Kansas City constructed the world’s first sports stadium built solely for the purpose of housing a women's professional team and how the Kansas City Current maneuvered from the status of upstart to trailblazing leader within the National Women’s Soccer League.\nYou can watch each segment of KMBC 9 Chronicle: A Pitch Fit for a Queen in the article below. The entire hour-long documentary can be watched in full in the video player above.\nA Matriarchal Lineage\nCPKC Stadium, named after the Canadian Pacific Kansas City railways, is the first of its kind in the world, a venue designed and built for a professional women's sports team.\nCPKC Stadium is a seven-acre site at the east end of Berkley Riverfront Park along Kansas City's riverfront. The 11,500-seat stadium opened on March 16, 2024, to a sold-out crowd eager to witness the history that was the Kansas City Current's home opener.\nBut that day was far from the beginning of women's soccer in Kansas City.\nFC Kansas City was the first football club to bring professional women's soccer to the metro.\nIn fact, the metro was home to the NWSL's very first game. That game was held on April 13, 2013, at the Shawnee Mission District Stadium in front of a crowd of 6,784 fans. The Portland Thorns visited FC Kansas City, playing to a 1–1 draw in front of the home crown.\n\"We got the very first NWSL game here in Kansas City. Our forward Renee Cuellar scored the very first NWSL goal, so there's a lot of history with the NWSL and Kansas City,\" Kat McIntyre, the unofficial historian of women's soccer in Kansas City, said.\nMcIntyre, a dedicated KC Current fan, founded the KC Blue Crew to support the FC Kansas City Blues, the first supporters group for a women's team in KC.\nDespite early momentum, the team faced challenges with fluctuating crowd sizes and location changes. However, they did bring home the national title in 2014 and 2015, helping KC earn its nickname as the Soccer Capital of America.\nUnfortunately, diehard fans' fervor wasn't enough to keep professional women's soccer from temporarily leaving town. At the end of the 2017 season, the team moved to Utah under new ownership.\nAs McIntyre and the rest of the KC Blue Crew will tell you, the desire for women's soccer in KC never left. Just two years later, the passion and belief were rewarded.\nIn 2019, Kansas City-based investment bankers Chris and Angie Long found themselves in Paris watching the Women's World Cup and feeling inspired to bring a professional women's team back to their city.\nThe couple says things moved quickly after that, leaping at the opportunity to seize control of the Utah Royals FC and bring them back to KC.\nThe Longs teamed up with Brittany Mahomes, the wife of Kansas City Chiefs quarterback Patrick Mahomes and a former soccer star in her own right, to bring professional women's soccer back in the spring of 2021.\nThe newly named KC Current premiered not on a pitch but a diamond, Legends Field, in Kansas City, Kansas. The promise of something more was already on the horizon.\nIn December 2020, Current co-owner Chris Long first announced plans for a practice facility and stadium. Those plans would come into focus in 2022 once the owners landed on the stadium's future home along KC's riverfront.\nOf course, the city is now home to a new team, new ownership, and a new stadium built specifically for women.\nIt's a beacon of hope not only for the current generation of female players but the future and past stars of the sport.\nHanding Down The Crown\nAt Homefield KC in Olathe, Kansas, young girls are training hard on the turf.\nThe next generation of soccer players there may just be learning the basics, but their dreams are big. Many espouse a deep desire to play professionally when they're older, inspired by the KC Current and the recent international success of the USWNT.\nThese lofty goals are no longer dismissed as cute or impossible. That's thanks to pioneers like Michelle Akers.\nAkers, a name synonymous with women's soccer, is often recognized as the greatest of all time. She was a member of the first U.S. Women's National Team in 1985, won the Olympic gold medal in '96, played in the first FIFA Women's World Cup in 1991, and again in 1995 and 1999 before being named FIFA Female Player of the Century three years later.\nKMBC 9 spoke with Akers to get her perspective on KC Current's new stadium and the long and arduous journey to make it a reality.\nAkers was a woman in professional soccer, surrounded by men making all the decisions. Doubts crept in all the way from the top, with even the president of FIFA during her time as a player asking for shorter shorts with more \"sex appeal.\" The organization also questioned women's ability to handle a full-size ball and 90 minutes of playtime.\nVoices from the outside also contributed to the roadblocks facing women's sports.\n\"I had reporters asking me, \"Is my husband OK with me playing? and how does this affect my menstrual cycle and can you have babies?\" Akers said.\nIt wasn't until February of 2022 that players on the USWNT finally reached an agreement to be paid the same as men in soccer. It was a moment that Akers knew was long overdue.\n\"It was just like a wave of emotion, like sadness and immense, like joy and celebration. Relief, just exhilaration and pride. And then I got pissed. I was like, \"What the hell? Why did it take so long? Why is it so hard?\" Akers said.\nDespite the anger, Akers is still grateful for the progress and for what the first stadium built for a women's professional team represents. She knows everything, even the losses, was worth this win.\n\"It's the visual representation and the physical location of the first stake in the ground dedicated to women's soccer,\" Akers said.\nThe young girls practicing at Homefield KC may not understand the magnitude of the moment, but they understand the opportunity being passed to them — the chance to chase their dreams.\nThe women responsible will continue to be honored with every goal scored along the way.\n\"Don't forget where we came from. This change has to keep going,\" Akers said.\nIn Kansas City, that dream is as close to reality as it has ever been.\nConnecting A Kingdom\nTeal is not hard to find in Kansas City.\nThe Current has made its presence felt well beyond the soccer field since its debut in 2021.\nSure, there's plenty of merchandise to buy in nearly every grocery store in town, but the team's strong commitment to investing in the local community may be making the biggest impact.\nThe team invests 10% of its brand partnerships revenue back into programs that strengthen the Kansas City community. That move inspired at least one partner, Boulevard Brewing Company, to also donate 10% of the proceeds of its annually-released KC Current branded drink, Teal Rising, to Win for KC — an organization that aims to empower the lives of girls and women by advocating for the power of sports, fitness and leadership.\nThe Current also backs up its words and money with actions. Volunteers and representatives with the YMCA of Greater Kansas City have shouted out the team for not only sponsoring their soccer leagues but also going out of their way to ensure they were helping young girls learn the game while getting outside and being active.\nThe community support doesn't stop at sports. Just down the road from their new home, Current players regularly volunteer at the Don Bosco Senior Center, the largest provider of senior services in Kansas City.\nThe Current's complete list of community partnerships is extensive and sweeping, stretching from significant donations to the 15 and the Mahomies Foundation to more personalized efforts like teaming up with Variety KC to donate an adaptive bike to a Kansas City-area family.\nIt should come as no surprise that the team's intentionality also extended to the construction of CPKC Stadium and the women-builders selected to bring it to life.\nBuilding The Castle\nThe Current broke ground on the privately funded $117 CPKC Stadium million in October 2022.\nGenerator Studio, J.E. Dunn and Monarch Build, and Henderson Engineers were the key organizations that helped bring it to life.\nAccording to Henderson Engineers, more than 60% of the CPKC Stadium project leads and designers were women.\nKMBC spoke with three of those leaders: Monarch Build Owner and Founder Courtney Kounkel, J.E. Dunn Senior Project Manager Cassie Morrison and Henderson Engineers Project Manager Katelyn DePenning.\nKounkel believes the stadium represents more than just a sports venue.\n\"I think it's much bigger than sports. I think what this stadium represents for all women is raising the bar to say women deserve exactly what men have,\" she said.\nThe stadium's location on the river symbolizes its significance: steady, strong, and current, if not overdue.\n\"It's past time. It is. It's something women have deserved for a long time and so it's exciting someone is taking that step forward, making the statement and doing the right thing,\" DePenning said.\nCassie Morrison, senior project manager at JE Dunn Construction, echoed this sentiment.\n\"You don't necessarily have to share. I mean, women are owed their own things. I mean,\nwe need to be able to have our own facilities,\" Morrison said.\nKounkel, DePenning, and Morrison have been breaking barriers in a male-dominated industry long before they ever broke ground on CPKC Stadium.\n\"You know, I didn't ever feel like I'm a trailblazer. To be honest, I really felt like I really wanted to blend in. Initially, my thought was just, \"I need to be like them. I need to be like the guys,\" Kounkel said.\nOver time, that feeling has faded, and Kounkel, in addition to owning her own construction company, also believes being a woman in a male-dominated field is now her superpower.\nDePenning, who graduated from KU in 2008 with a degree in architectural engineering, also faced challenges as a woman in the industry.\n\"My first job out of school was at a firm where I was more like a construction manager and always the only female in the room. I just kind of had to figure out, as a 23-year-old on a job site, how to carry yourself so you're actually heard,\" she said.\nMorrison, a Kansas State University graduate with a degree in Construction Science and Management, is also making her mark in the industry.\n\"We make a big push within the construction business to include women. I mean, the perspectives are there that help drive, and the men are starting to understand that that other perspective is important to have within a team in our business,\" she said.\nThe construction of the CPKC Stadium is a testament to the progress women have made in both the construction industry and sports.\nAs attendees of the first game at CPKC Stadium will tell you, the project was finished right on time. Among the sold-out crowd was another team of women, receiving the honors they deserved decades earlier.\nThe First Knights\nThe world's first stadium built for a women's professional sports team may not even exist were it not for the efforts of pioneers like the 1985 U.S. Women's National Soccer Team.\nThat team, the first U.S. Women's National Soccer Team, was in attendance for the first game at CPKC Stadium. A team full of 17 unheralded heroes was at the game to finally receive its due nearly 40 years after they took to the pitch.\n\"The way things are going now with women's rights for Kansas City Current to move this another step forward? For us, it's just thrilling. It's historical. And we are so honored to be here and be a part of this,\" 1985 USWNT goalkeeper Ruth Harker said.\nThe team, now known as the '85ers, played in hand-me-down men's jersey shirts in Italy, resulting in three losses, one draw, and a significant mark on history.\n\"We were so excited almost 40 years ago to have been selected to this, but who would imagine that this is what it would evolve to?\" 1985 USWNT defender Ann Germain said.\nThe appreciation, gratitude and significance of what these women did does not go unnoticed by fans and women alike. CPKC Stadium is home to a permanent display honoring the 1985 team.\nThe exhibit is located in the northwest part of the stadium, on the concourse behind section 108.\nThe team was also honored at halftime of the Current's 2024 season opener. Fifteen of the team's 17 players were in attendance.\n\"The experience that we had, I think, is really hard to describe,\" 1985 USWNT forward Kathy Ridgewell Williams said.\nThe team's legacy continues to inspire and pave the way for future generations of women in sports.\nOpening The Gates\nNow, the women of the KC Current are building a new legacy.\nThe players, the owners, the builders and a city full of fans all came together on March 16, 2024, to make history on opening day at CPKC Stadium.\nThe first stadium in the world built for a women's professional sports team opened its gates to thousands of fans.\nIn front of a sold-out home crowd, the women at the center of that history, the 2024 members of KC Current, wowed their fans and took home their first win of the season and the first win in the new stadium.\nIt was an impressive 5-4 win for the Current, who used an explosive start on offense to hold on against the Portland Thorns. It was just a first punctuation mark for a club that is currently undefeated at 3-0 atop the NWSL rankings.\nBut it's not the first mark that this team has left on this city. Women's sports are still fighting for the attention they've always deserved. As Michelle Akers will remind you, the progress and work are far from done.\nCPKC Stadium is the first stadium built for women's professional sports, but it shouldn't be the last. In some cities, NWSL teams are still working to earn the facilities they also deserve.\nNot every city embraces its women's teams with the same vigor that they do their NFL or MLB franchises. But, in Kansas City, they do. Merch is available everywhere you look, major landmarks are decked out in teal, and an army of local businesses and charities are eager to champion the team.\nThe electricity that the team and their stadium generated could seen on the faces of every fan in attendance on Opening Day. Screams of \"KC Baby\" ran out louder than ever before, led by the fervent and loyal members of the Blue Crew who have spent years of their lives evangelizing what all of Kansas City now knows.\nFrom women of the 1985 Women's National Soccer Team to the thousands of young girls preparing for their very first YMCA match, Women have always deserved a pitch for a queen.\nDive deeper into the KC Current's historic new home:",
  "word_count": 2709,
  "scraped_at": "2026-02-14T13:02:33.165115"
}