{
  "article_id": "d63b3e98a48f",
  "url": "https://www.liverpoolfc.com/news/we-love-you-liverpool-meet-official-lfc-supporters-club-nepal",
  "title": "We Love You Liverpool : Meet Official LFC Supporters Club ... Nepal",
  "date": "20240615T123000Z",
  "domain": "liverpoolfc.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "FeatureWe Love You Liverpool: Meet Official LFC Supporters Club... Nepal\nLiverpool FC has more than 300 Official LFC Supporters Clubs (OLSCs) across 100 countries worldwide.\nThe Reds’ fanbase is famous for its passion and loyalty, cheering on both the men’s and women’s squads whether on Merseyside or watching from afar.\nOur We Love You Liverpool feature aims to bring supporters closer together to learn more about each other wherever they are based around the globe.\nWhether in the UK and Republic of Ireland, on Merseyside itself, in North or South America, Europe, Africa, Asia, Australia or elsewhere, fans provide the very foundations that the club is built on.\nHere, we meet OLSC Nepal...\nTell us about the OLSC…\nWe started off as a group of a few local Liverpool supporters around 2008. It began with screenings on a matchday and then we started inquiring about the possibility of having an officially recognised OLSC in Nepal. We now have around 4,000 members in our Facebook group, 15,000 likes on our Facebook page and a couple thousand followers on Instagram and X. We also have over 50 official Liverpool members.\nHow special is it to have the supporters club where you are?\nWe were one of the very first officially recognised OLSCs in Nepal, so it goes without saying it was very special and we are all very grateful to have had official status granted to us. We serve the local Liverpool supporters and community here with pride and honour.\nIt must give you a sense of community and connection to Liverpool and the club itself?\nAbsolutely! Being a Liverpool fan in itself is like being part of this big global family. With the OLSC status, it turns things up a notch. We love being able to participate in the global events that are carried out by the club. We have so many inquiries regarding the OLSC black tie dinner at Anfield. The event is almost like a once-in-a-lifetime opportunity to meet with supporters from all around the world at Anfield, so that is probably the pinnacle of it all. We also love it when people from around the world who are in Nepal to visit our beautiful country come to our screenings. We've had the pleasure of exchanging a couple of scarves with other OLSCs too.\nWhat is so special about supporting Liverpool for your members?\nI don't think words will ever be enough to describe it. Football for us is more than just a sport and the club, it's not just a club, it's a way of life. I think that sentiment is echoed by everybody who supports Liverpool. It's no different for us really.\nDo you hold meet-ups for games, or any special events throughout the year?\nWe do hold meet-ups for games and try to organise regular screenings for our members. We've been doing so from 2009, when we initially started off as a group of friends. A couple of our screenings have been pretty big, pulling in over a thousand supporters. The Champions League finals that Klopp took us to, for example, each of those were massive.\nApart from screenings, we have also organised different charity events and blood donation programs. The 2015 earthquake was devastating for our nation and we did our best to help in the relief efforts after the quake. We have also organised and participated in many different futsal tournaments against other OLSCs.\nHas the OLSC ever visited Anfield?\nIt was obviously our dream to do so, and we had hoped we'd make the pilgrimage to Anfield together someday. I and another founding member had planned to visit Anfield for the black-tie dinner in 2023 but he couldn't make it that year and it was only me, another one of our members and his wife. But the friend who couldn't make it last year attended the black-tie dinner this year.\nWhat is your favourite memory together as an OLSC?\nThe Champions League final where we made it six. That has to be the cream of the cake, so to speak. We had a big screening at Purple Haze Rock Bar, we probably sold around 1,000 tickets or a little more. The owners are two big LFC supporters as well and they also have a band. We did our own version of a Boss Night with the band playing all the big hits from the Jürgen era. That was pretty epic. Also, right when I was at Anfield, the club was doing a 'Far And Wide' feature and our OLSC was featured on the same day. I only caught a glimpse of it from the stairs on my way into the stadium, but being able to see our OLSC on the big screen at Paisley Square was a great moment of pride.\nLastly, if anyone else is interested in joining your OLSC, how would they go about doing so?\nWe are active on Facebook, Instagram and X. So just send a quick message on any of those platforms and we should be able to walk you through the steps required to be a part of The Himalayan Kopites.\nOLSC info\nName: OLSC Nepal (The Himalayan Kopites)\nLocation: Nepal\nX: lfcnepal\nFacebook: lfcnepal\nInstagram: lfcnepal",
  "word_count": 870,
  "scraped_at": "2026-02-14T12:47:43.136968"
}