{
  "article_id": "d67d65bfb30a",
  "url": "https://www.wcvb.com/article/mlb-wnba-postpone-games-air-quality-canadian-wildfires/44120890",
  "title": "MLB , WNBA postpone games due to smoke from Canadian wildfires",
  "date": "20230608T010000Z",
  "domain": "wcvb.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "MLB, WNBA postpone games due to smoke from Canadian wildfires\nWith the stench of smoke permeating Yankee Stadium and wafting through its walkways, Major League Baseball postponed games in New York and Philadelphia on Wednesday night because of poor air quality caused by Canadian wildfires.\nVideo above: Smoke pours into Cassville, NY, from wildfires in Canada\nA National Women's Soccer League game in New Jersey and an indoor WNBA game set for Brooklyn were also called off Wednesday amid hazy conditions that have raised alarms from health authorities.\nThe New York Yankees' game against the Chicago White Sox was rescheduled as part of a doubleheader starting at 4:05 p.m. on Thursday, and the Philadelphia Phillies' game against the Detroit Tigers was reset for 6:05 p.m. on Thursday, originally a day off for both teams.\n“These postponements were determined following conversations throughout the day with medical and weather experts and all of the impacted clubs regarding clearly hazardous air quality conditions in both cities,\" MLB said in a statement.\nThe National Weather Service issued an air quality alert for New York City, saying: \"the New York State Department of Health recommends that individuals consider limiting strenuous outdoor physical activity to reduce the risk of adverse health effects.\" In Philadelphia, the NWS issued a Code Red.\nThe Yankees and White Sox played through a lesser haze on Tuesday night. A day later, stadium workers and fans arriving early to the ballpark wore face masks for protection in a scene reminiscent of the height of the COVID-19 pandemic.\n“It was business as usual for me coming in. I got in around 12, 12:30, and didn't really think too much of it,” Yankees manager Aaron Boone said. “I actually walked outside about 2 o'clock and was like — like everyone else, like — whoa.”\nWhite Sox manager Pedro Grifol thought MLB made the right decision postponing the game.\n“These are health issues, right? So this has got to be it. We’ve been through everything — snow, rain, hail. I don’t think I’ve been through something like this,” he said. “Today at one point, it was pretty bad out there. We walked out of the dugout and it was kind of orange. They did the right thing. They got all the information.\n“I’m assuming if Major League Baseball is comfortable setting up a doubleheader tomorrow, they have some type of information that it should be better than what it is today, or at least safe.”\nIn Philadelphia, the Phillies beat the Tigers 1-0 on Tuesday night in a game played in hazy conditions with the smell of smoke in the air. Afterward, manager Rob Thomson and his Phillies players said the conditions didn't affect them.\nAbout a half-hour before Wednesday's postponement, Thomson said he thought the game would be played. But the Philadelphia skyline could not be seen from the ballpark in the afternoon, and the smoky smell remained.\nMinor league teams nearby also changed plans. The Yankees' Triple-A affiliate at Scranton/Wilkes-Barre in Pennsylvania, and the Mets' top farm club in Syracuse, New York, postponed their games for the second consecutive night.\nThe Mets' High-A affiliate in Brooklyn completed a game Wednesday against Greenville that began at 11 a.m.\nThe WNBA called off a game between the Minnesota Lynx and New York Liberty, saying the decision was made to “protect the health and safety of our fans, teams and community.” A makeup date wasn't immediately announced.\nEven inside Barclays Center at the morning shootaround, reporters could smell smoke in the arena.\nThe NWSL postponed Orlando's match at Gotham in Harrison, New Jersey, from Wednesday night to Aug. 9.\n“The match could not be safely conducted based on the projected air quality index,” the NWSL said.\nAt nearby Belmont Park, the New York Racing Association said training went on as planned Wednesday ahead of Saturday's Triple Crown horse race. However, NYRA canceled training Thursday morning at Belmont and Saratoga Race Course upstate “due to poor air quality conditions forecast to impact New York State overnight and into Thursday morning.”\nNYRA said a decision about Thursday’s live racing program, scheduled to begin at 3:05 p.m., will be made Thursday morning “following a review of the air quality conditions and forecast.”\n“NYRA utilizes external weather services and advanced on-site equipment to monitor weather conditions and air quality in and around Belmont Park,\" spokesman Patrick McKenna said Wednesday. \"Training was conducted normally today, and NYRA will continue to assess the overall environment to ensure the safety of training and racing throughout the Belmont Stakes Racing Festival.”\nNew York’s NFL teams, the Giants and Jets, both had Wednesday off from offseason workouts. The Giants had been planning to practice inside Thursday, and the Jets said they are also likely to work out indoors Thursday.\nYouth sports in the area were also affected, with parents quick to voice concern about their children's safety outdoors.\nIn a statement Wednesday, the New Jersey State Interscholastic Athletic Association said schools should understand that all schedules were subject to change.\n“NJSIAA is closely monitoring air quality data across New Jersey and local/state health advisories. As start times for athletic events draw near, we will make decisions for each venue and sport based on currently available information,” the organization said.\nIt’s not the first time in recent years that wildfires forced changes to the MLB schedule. A two-game series in Seattle between the Mariners and Giants was moved to San Francisco in September 2020 because of poor air quality caused by West Coast wildfires.\nAbout an hour after Wednesday night's game at Yankee Stadium was postponed, two fans visiting on vacation from Vancouver, British Columbia, were still lingering.\n“It’s just circumstances. What do I say? It makes me disappointed because this is one of the highlights of the trip,\" said Malcolm, who was in town with his daughter and didn't want to give his last name.\n“I have a heart condition. That’s the only reason I’m wearing two masks and whatever. And my personal thought is that, why wasn’t it canceled two days ago? Because we knew about all this two days ago. But having said that, I don’t want the players running around and putting out in this, too. It can’t be good for them.”\n___\nAP Baseball Writer Ronald Blum, AP Basketball Writer Doug Feinberg, AP Pro Football Writer Dennis Waszak Jr., AP Sports Writers Tom Canavan, Pete Iacobelli and Stephen Whyno and AP freelance writers Larry Fleisher and Aaron Bracy contributed to this report.",
  "word_count": 1081,
  "scraped_at": "2026-02-14T12:00:38.606994"
}