{
  "article_id": "d68f79f86eb8",
  "url": "https://www.ghanaiantimes.com.gh/garfa-middle-league-roars-off-saturday-as-awuni-wins-coach-of-the-month-award/",
  "title": "GARFA Middle League roars off Saturday … as Awuni wins Coach of the Month award",
  "date": "20230615T113000Z",
  "domain": "ghanaiantimes.com.gh",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "GARFA Middle League roars off Saturday …as Awuni wins Coach of the Month award\nNungua-Based Danbort FC will roar off their campaign in the Greater Accra Division Two Middle League on Saturday morning when they take on Still Believe FC at the Accra Sports Stadium.\nKick-off is slated for 10 am to be followed by the second game of the day at the same venue between Accra Athletic and the junior team of Accra Hearts of Oak – Auroras FC, at 1pm.\nThis was the upshot of Tuesday’s draw that saw six zonal champions hungrily poised to dash for action.\nThe pairings had Danbort, Still Believe and Banana Inn FC thrown into Group A, whilst Accra Athletic, Auroras FC and Desideros FC are housed in Group B.\nBanana Inn FC will swing into action on Wednesday, June 21, with a crunch game against Danbort. On the same day at 3pm, Auroras will square off with Desidero FC.\nThe campaign continues on Sunday June 25 at 10am with Banana Inn entertaining Still Believe FC, while Desidero clash with Accra Athletic at 3pm same day.\nThe climax of the competition will see winners of the two groups crossing swords on Sunday July 2 to determine the club that makes it to the second tier of Ghana football. Aside clinching Division One ticket, the winner is expected to smile away with a huge trophy.\nA curtain raiser ahead of the cracker pits two top women teams in the GARFA League at each other with a trophy and other rewards at stake.\nAhead of Tuesday’s draw, a number of awards were splashed on deserving winners in the GARFA League with Danbort’s Daniel Awuni swaggering away with the Coach of the Month Award.\nThe winning coach had guided his team to seven wins in eight games in the month of May, scoring 15 goals, conceding six and amassing 21 points in the process.\nThere were also awards for hat-trickers in the just-ended league, Best Player of the Month, Best male and female player of the month, Best Referee and Best Assistant Referee of the month.\nChairman of GARFA, Mr Samuel Aboabire, congratulated all award winners whilst wishing contestants in the Middle League a fruitful campaign.\nHe charged the clubs to exhibit a high sense of professionalism and sportsmanship during the week-long competition.\nBY JOHN VIGAH",
  "word_count": 390,
  "scraped_at": "2026-02-14T12:45:47.712795"
}