{
  "article_id": "d6a2ff9d9058",
  "url": "https://www.arsenal.com/news/jayne-ludlow-captaining-our-legendary-2007-team",
  "title": "Jayne Ludlow on captaining our legendary 2007 team",
  "date": "20260115T134500Z",
  "domain": "arsenal.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "As the most successful women’s team in Britain and one of the most successful and enduring women’s clubs in Europe, Arsenal’s history is littered with legends of the game.\nYet even by our own illustrious standards, few players can rival the legacy of Jayne Ludlow. The Welsh midfielder spent 13 years at the club and is our record scorer with 205 goals from 356 appearances.\nOver a trophy-laden spell, Ludlow won 11 league titles, seven FA Cups, six League Cups, and she captained the team in their victorious Champions League final against Umea in 2007. CVs in this sport do not get more comprehensive than that.\nBorn in the Rhondda valleys in Wales, football was always a family affair for Ludlow. “My dad was an ex-Swansea City youth player who retired pretty young and went into coaching,” she says.\n“He was coaching local teams in Wales, so my upbringing involved being on the side of a pitch with my dad. Pre-game, post-game, half-time, I would just be kicking a ball around the pitch. It was unusual for a girl to be playing football, but to me it felt totally normal. I just followed in my dad’s footsteps.\nLudlow’s talents were apparent early on. “I was allowed to play for my local boys’ club until I was 11 or 12.” However, a lack of girls' football infrastructure where she grew up meant that the sport nearly lost Ludlow, a talented triple jumper, sprinter and netball player, to track and field.\n“They stopped me playing at that point due to the regulations, so I moved over to athletics. I managed to compete for Wales and GB under-20s,” she says. “When I was about 15, my mum noticed a women’s team was being advertised about 30 minutes away from where I lived. I was desperate to get back into football, but the avenues just weren’t there for girls where I lived.\n“I tried doing football and athletics for a bit, but even though the career options weren’t really there in football I chose it over athletics because I enjoyed it more.”\nLudlow applied her athletic talents to the football pitch, where she quickly made a name for herself as a competitive, box-to-box midfielder.\n“I was a sprinter and a jumper so I could sprint and recover pretty well. It certainly helped with being a box-to-box midfielder and it played a part in me being more explosive. When I played with the boys when I was younger I was a tough tackler. I wanted the ball all the time and liked scoring goals like most kids do!\n“I wasn’t a standout technician, but I loved the competition. A lot of my teammates would say I never became a technician, but that I was probably one of the most competitive teammates they had.”\nLudlow is now a parent to a son and a daughter, and while she says opportunities are better for her children than they were for her, there is still work to be done in her native Wales.\n“Opportunities to play football are not as developed in Wales as they are over the bridge right now. My kids do have opportunities and it is better, and we are aware of where those opportunities are.\n“My journey and how I got to Arsenal was pretty ridiculous – a kid growing up at the top of the Rhondda valleys from a pitch on the side of a mountain and a passion for the game. There wasn’t an obvious path but the passion I had for it meant that I found a way and my parents were huge in finding me those opportunities.”\n\"A lot of my teammates would say I never became a technician, but that I was probably one of the most competitive.\"\nAn opportunity arose in the United States through Ludlow’s academic pursuits, but it didn’t turn out as she hoped.\n“I was a bookworm in school. I was pushed towards medicine but realised I wanted to do sports so I didn’t want to commit to medicine. I ended up choosing dentistry, so I went to Cardiff University to pursue that. Then I read about a girl from Wales in SheKicks magazine who had gone out to the US and she was a friend of a friend to the US and she was a friend of a friend.\n“We didn’t have search engines or the internet so I couldn’t find much out about these sorts of things,” Jayne reflects. “I got in touch with her, won a scholarship during my first year at university and went over to Pennsylvania. When I got there, the standard of football wasn’t what I expected.\n“I was playing for Barry in the top flight in Wales and I didn’t find the standard in Pennsylvania to be better. On top of that, it was going to take seven years to qualify to be a physio and it just didn’t make sense.”\nFrom there, Ludlow’s path to Arsenal was relatively quick.\n“I came back, worked and went to Southampton for a bit, then I had the opportunity to go to King’s College to study physiotherapy. I stayed with Southampton for a few months, and then we played a cup game against Arsenal and I scored a goal or two. I think that was how I got scouted.”\nThen-Arsenal boss Vic Akers was impressed by Ludlow’s display against his team. Already having a long-serving Welsh captain at the Gunners also smoothed Jayne’s path to north London. “I had a connection through Sian Williams who was in the Wales set-up and she knew about me, so she was part of the process too.”\nLudlow jokes now that her combative approach playing against Arsenal made the settling in process a little icy. “I don’t think I made too many friends with the Arsenal players in that game – I think I kicked every single one of them – so it took me a while to bed in when I got there!”\nAs well as her bustling box-to-box style, Ludlow was renowned for her leadership, something she continues to take seriously today. Jayne is currently Head of Sport at the University of South Wales, which connects her with coaching education and coaching pathways. She is also part of the FIFA Technical Leadership Team, which involves helping coaches and technical directors with leadership.\n“Leadership is looking after people, if you simplify it,” she explains. “It’s about helping others to perform at the best of their ability. I always enjoyed that responsibility and it’s the realm I work in now. I had great female role models too, which was unusual.\n“There is still a lot in the game that needs to evolve, like women in leadership positions and support for the game itself. One of the roles I have with FIFA now enables me to build relationships with people at the highest level of the game.\n“I’m grateful to be in that position and hope I can have a positive influence on what the game looks like in the future. It should be fun and enjoyable, but it should be supported.”\nLudlow’s teammates from the Invincible quadruple-winning team continue to reflect on a rousing speech she gave in the home dressing room before the 2007 UEFA Cup final victory over Umea.\n“I’d had a hamstring tear in the build-up to the game and I was struggling to get back,” Ludlow recalls. “It was always going to be the biggest game of my life – being champions of Europe was an opportunity I knew I wasn’t going to get with my national team.\n“The build-up for me was about how I prepared myself and how I helped the team to prepare. I was captain at the time. We were sitting in the changing room and at that stage before a game it wasn’t about screaming in each other’s faces and pumping each other up. It’s more about calm reflection and thinking positively.\n“I used to sit there and visualise all the great things I wanted to do on the pitch; I think the athletics training helped with that. When I went to speak before the game all these things I had been thinking about before the game just came out.”\n“I hope I can have a positive influence on what the game can look like in the future”\nLudlow admits that the speech might not have been PG in places. “I’m sure I would have said something about fighting and there would have been a few F-bombs,” she says with a laugh. “I knew there were question marks over my fitness, but I told my team-mates I wasn’t going to let them down and that I was fit to play. I wanted to encourage that thought process of us doing it together.\n“We were in that final for a reason and I wanted us to show everyone what we could do. Every player in that team was a superstar in my eyes.”\nLudlow put the seal on that quadruple win with a stunning 30-yard volley in the FA Cup final victory over Charlton Athletic. She is married to Ciara Grant [now Ciara Ludlow], another crucial pillar of that all-conquering team. Ludlow says they watched the 2025 final together to see the current team repeat the feat Jayne and Ciara had achieved 18 years earlier.\n“We were quite emotional. We were just so happy for players like Leah, one of the ‘babies’ we know very well and isn’t a baby any longer! Kim was another one we played alongside and we were so happy for her.\n“I remember what it meant to us, and seeing them have that too made us so happy. I don’t keep in touch with people a lot, but I texted Leah afterwards and told her to enjoy it and that the team deserved it.\n“Seeing the club back at that level was very pleasing – as ex-players we look at the club as being the best in the world and that is where they should be.”\nJayne brought the curtain down on her 13 years with the Gunners in 2013, a mixture of persistent injuries and emerging midfield talent like Kim Little and Jordan Nobbs forced her decision to call it a day.\n“The last year or 18 months of my career was quite tough. I kept tearing my calf. My calves retired me! I wasn’t as physical and I knew I wasn’t the same player; I enjoyed it less.\n“We had great youngsters coming through like Jordan and Kim, and it’s lovely to have been part of their journey. I realised these kids are better than me – and that was fine, I’d had my time.”\nLudlow could have stayed at the club but couldn’t envisage herself in a non-playing role. “Arsenal offered me a role as a physio. Everyone knows how much I love Arsenal, but I just couldn’t be part of the club and not be on the pitch. Emotionally I couldn’t do it.\n“I needed to go out and find out what was next for me in life and I was offered a great opportunity at Reading to become manager. It was a baptism of fire, but I learned a lot and I will be forever grateful to Kelly Chambers and the club for trusting me as a young coach.”\nAfter stints as head coach of Reading and then the Welsh national team, Ludlow took a new direction as Head of the Academy at Manchester City.\n“My passion in coaching is developing people. After the Wales job I made the decision that I didn’t want to be a head coach for a senior team at that moment in time. Wales was tough because it’s several roles in one, but I reflected on the parts I liked the most and developing young players was one of them.\n“Manchester City gave me that opportunity; I had a great time there,” she adds. “It’s nice to see some of the players we brought into the club or developed getting into the first team now – that’s the joy for me in coaching.”\nLudlow is a giant figure from Arsenal’s past continuing to shape and lead the future of women’s football.\nCopyright 2026 The Arsenal Football Club Limited. Permission to use quotations from this article is granted subject to appropriate credit being given to www.arsenal.com as the source.",
  "word_count": 2066,
  "scraped_at": "2026-02-14T12:51:36.299670"
}