{
  "article_id": "d6be44dc4254",
  "url": "https://cartilagefreecaptain.sbnation.com/2024/4/14/24130279/tottenham-hotspur-women-2-1-leicester-city-were-going-to-wembley",
  "title": "Tottenham Hotspur Women 2 - 1 Leicester City : Were going to Wembley !!! ",
  "date": "20240414T230000Z",
  "domain": "cartilagefreecaptain.sbnation.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Exactly thirteen months and one day ago, I watched Spurs and Leicester play out a truly, deeply abysmal 1-0 match in Tottenham Hotspur Stadium. That game was billed as a relegation derby at the time, although neither team ended up relegated. If you’ve been watching either Spurs Women or Leicester City this season, you already know how much can change in one year–the two sides faced off again today in the FA Cup as well-deserved semifinalists. After 118 minutes of football, Spurs’ Martha Thomas found a winner. Spurs will face Manchester United in the final on May 12th.\nTottenham Hotspur Women 2 - 1 Leicester City: We’re going to Wembley!!!\nI pledge allegiance to Jess Naz and Martha Thomas etc. etc.\nWith three weeks since the last match and a long international break, it was unclear how Robert Vilahamn might choose to line up. He went with a relatively familiar lineup with a few notable details–Becky Spencer got the start in goal ahead of Bara Votikova, while Beth England and Jess Naz got starts in a frequently changing front line. Olga Ahtinen found herself on the bench in favor of Drew Spence.\nSpurs started brightly, with Celin Bizet forcing a save from Kop and firing wide. Despite the threatening start, Leicester struck first. Eveliina missed a tackle in midfield which allowed Leicester to play their own dazzling Finn, Jutta Rantala, into the box. Rantala is known for cutting inside, and that’s exactly what she did, getting enough space from Nilden to fire a rocket of a shot past an unsighted Becky Spencer.\nSpurs had several chances to equalize, but ultimately lacked end product. Jess Naz looked great running in behind, and Drew Spence looked really dynamic in midfield. Meanwhile, Beth England looked sharper than she did before international break, but she was still not quite getting into the same positions she did last season. On the other end of the pitch, Leicester found more joy through Deanne Rose and Rantala, but Spurs defense was ultimately able to do enough to contain their threat.\nBoth sides came out for the second half unchanged, and things started to get a bit scrappy. In the 58th minute, Vilahamn introduced Martha Thomas for Celin Bizet in an unfamiliar position on the right, and later Kit Graham for Drew Spence (who was excellent, but was on the receiving end of some crunching tackles and a ball to the face). In the 77th minute, Olga Ahtinen, Charli Grant and Matilda Vinberg replaced Eveliina Summanen, Amanda Nilden and Grace Clinton. As the match wore on, Vilahamn also began experimenting with the positioning of the players on the field–Jess Naz moved to striker and Beth England moved into the number 10 role. Vilahamn later explained that this would allow Jess to rest her legs more in between her lightning runs in behind.\nIt totally worked, too–in the 83rd minute, Beth England played a ball just between Leicester’s defenders. Jess capitalized on a bit of miscommunication and controlled the ball past them into space, then confidently put a cool shot past Kop. Let me step back for a minute–it’s always lovely to see a young player succeed, especially one who has developed with the club for a long time. I’ll be the first to admit I didn’t know whether Jess Naz would be able to break through. I couldn’t be more thrilled to say that every week she makes me eat even more of my words (is that what she’s cooking up in that classic celebration? Maybe!). Anyway, this was just beautiful timing, smart use of speed and control, and the perfect cool shot to top it off. Hats off to you, Jess, and thanks for the extra time!\nDespite some obvious tired legs, Spurs kept control and continued to create chances. Martha Thomas just barely missed a chance in the first half of extra time–we all watched her shot slip through Kop’s arms and slowly trickle to the post… and then past it. Amy James-Turner headed the resulting corner kick wide. Leicester had their best chance to find a winner on a free kick in our third, but Becky Spencer and the crossbar combined to keep Rantala’s ball out.\nSpurs piled on the pressure and intensity, and the breakthrough finally arrived in the 118th minute. Matilda Vinberg knocked the ball back into a crowded box. Luana Bühler got a head onto it and forced it goalward, and Martha rose above her defender to put a powerful but looping header over Kop and into the back of the net.\nReader, I died. I wept. Watching our players celebrate on the pitch like that–I actually don’t even remember the rest of the game, and I have no more calm and coherent analysis for you. We’re going to Wembley man!!!! We’re really doing it! Last season we almost got relegated and now we’ve got a cup final! Spurs have been exceeding my wildest expectations for a few months now, but I never imagined this, and man, I’m so damn excited! I’m so happy for all the players, and for all of us, too!\nOne last bit of housekeeping–Manchester United defeated Chelsea in the other cup final this weekend. We’ll face them at Wembley on May 12th. From what I’ve heard, tickets go on sale tomorrow. On the plus side, Manchester United might be a bit easier to beat than Chelsea, as they’re barely holding on to 4th place in the WSL ahead of Liverpool. On the downside, Grace Clinton’s loan contract states that she’s not allowed to play against her parent club. She’ll miss the final, which is a real shame both for her and for Spurs. If you told me I’d be saying this a year ago, I’d have said you were crazy, but I still think we have enough depth to do it without her.\nI’ll see you next month for a CUP FINAL AT WEMBLEY HOLY SHIT, and in the meantime, COME ON YOU GD SPURS!!!!!!!!",
  "word_count": 998,
  "scraped_at": "2026-02-14T12:57:35.466436"
}