{
  "article_id": "d6d28e2d67f4",
  "url": "https://www.terrain.org/2024/nonfiction/beyond-flaco-wildness/",
  "title": "Beyond Flaco : An Exploration of Wildness",
  "date": "20241230T134500Z",
  "domain": "terrain.org",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "In searching for eagle-owls in Finland, David Gessner finds that we are restored to our most vital selves when we are in contact with the wild.\nFlaco: A Triptych\nBy David Gessner\nRead the full series that precedes this essay:\nYou should never expect to win a staring contest with an owl. If you look at it, it will often look back. Not a glance either. A full-on stare. Owls and human beings share forward facing eyes, binocular vision, and this commonality makes a difference in how we regard them. With them we are face to face, eye to eye. True, we can’t spin our heads fully behind us, 270 degrees, but still we see ourselves in them. What I see now is what I will anthropomorphically call a judging, paternalistic look, the eyebrows slanting sternly over the blazing eyes.\nThe owl turns away because he has had enough of me. He has other business. His three young are screeching down in the spruce trees below the cliff, a variety of sharp querulous sounds that are all saying the same thing: “Feed me!” He waits though; it is already close to ten here near the top of the world, but it is not quite dark enough for hunting. We both notice when the darkness takes another gulp forward, swallowing the light.\nHuuhkaja, with its hoot-like first syllable, is the onomatopoeic name for the bird in this land. In my land we call it the Eurasian eagle-owl, the largest and strongest of owls. For six months now, I have been reading up on this bird, studying words and pictures about it, maybe a little jealous when I talked to others about their encounters.\nBut now it is real. Now I see it. Beautiful, but also bulky and strong. His power is obvious, power in repose. He grips the tree with talons that would not look too out of place on a grizzly bear.\nAnd then suddenly he drops down off the tree, and with two strong flaps of his powerful wings, showing the white of his underwings, crosses by and then below me, and down toward the valley, a dark shape slicing through the gloaming, almost a part of the encroaching darkness, moving toward something that only he sees.\nBefore I came to this cliff, to this country, I was an observer, and not just an observer but an observer of those who observe, doubly removed. During that time I immersed myself in the story of Flaco, the Eurasian eagle-owl who escaped from the Central Park Zoo after vandals cut a hole in the iron mesh of his enclosure. During the year that Flaco lived outside the enclosure where he had spent the previous 11 years, from February of 2023 to February of 2024, he became the most photographed, chronicled, posted-about, and overall watched bird in the world.“The world’s most famous bird,” is what people started to call Flaco almost from the beginning. But who you call “most famous” depends on where you live. In Finland, like New York, many claim that title belongs to an eagle-owl, but here they are talking about Bubi not Flaco. Bubi is the name Finns gave to the eagle-owl, a play on its Latin name bubo bubo. Bubi became famous by flying into the Olympic Stadium during a qualifying match for the European Football Championship in 2007. The Finnish national team was playing Belgium, who they rarely beat. The giant bird swooped down and alighted atop the Belgian goal, forcing the referee to stop the game. Fans cheered and heckled (since it was Finland these were gentle and relatively polite heckles). The owl took its time, no doubt staring down the players with its orange eyes, then flew to the goal at the other end, before flying off to more roaring cheers. Finland won 2–0.\nAfter that the Finnish men’s team was called Huuhkajat, a name they have kept ever since. The women’s team would eventually have their own nickname, Helmarit, which means boreal owls.\nIt was in the sauna in the basement of my friend Juha’s house that I first heard the full story of Bubi. His brother-in-law, a well-known Finnish composer, told it to me as sweat dripped from my brow.\n“Now that is the world’s most famous bird,” he concluded.\nThough I reported on Flaco, interviewed dozens of Flaco followers, and learned everything I could about eagle-owls, I never saw Flaco. Not once. I arrived late on the scene, like Columbo, the body already cold, and pieced the story together from those I spoke to.I came here because I decided it was time for me to see an eagle-owl in the wild. As a writer my obsession was as much or more with telling Flaco’s story than with Flaco himself. But I began to realize I was jealous of people I was interviewing, like Nan Knighton, or Anke Frolich, the photographer who followed Flaco alone in the park late at night, despite the dangers. Jealous of everyone who got to see the bird in the park and in the city.\nI decided it was time to cut out the middleman. I was hungry for some wildness of my own.\nTwo days ago, the very last day of July, I attempted to rectify this feeling, hoping to fill the void. I did so in an extreme way, boarding a plane from JFK to Helsinki. Back in May, an author from Finland, Juha Kauppinen, visited me in North Carolina and spent an evening on the back deck of my writing shack, drinking beers and swapping stories. Later that month, as I started to read more deeply about owls, I began to see that many of the owl experts, mostly bearded older men who could have stepped right out of the pages of The Lord of the Rings, reside in Finland. And that eagle-owls reside here, too.\nIt turned out that one of these bearded men, Heikki Willamo, was both a friend of Juha’s and one of the country’s best nature photographers, and that he had spent several years back in the early 2000s climbing up to the top of a cliff he called Eagle-owl Hill, where he photographed a pair of eagle-owls and their young. Before long I had concocted a plan to fly to Helsinki and climb that hill with Heikki.\nEarlier today Juha and I drove out to Heikki’s home, a beautiful, converted schoolhouse with spacious rooms and outbuildings with moss roofs, an hour northwest of Helsinki. When white-bearded Heikki greeted us by saying, “I will be your shaman,” he wore a wry smile. It was a joke, at least partly. But an hour later, walking down a dirt road with farmland on one side and woods that guard a granite cliff on the other, we were nervous. What if I had come all this way and didn’t see a bird? There was no guarantee. Heikki and Juha felt the pressure too.\nA dozen common cranes, beautiful, long-necked white birds with black wingtips, black half-patches around their eyes, and red markings on their head, grazed on seed out on the fields, looking anything but common to me. Then, after I commented on how unusual it was for someone from my country to see stands of aspens and birch trees growing together in large numbers, like Vermont and Colorado squashed together, I looked up and noticed a distinct dark shape rowing with deep flaps across the sky from cliff to woods.\n“An immature,” Heikki said, “one of the young,” and just like that, the pressure was off. I would not go 0 for Finland. I had seen my first eagle-owl in the wild.\nWe laughed, relieved. Heikki now knew he would not fail in his shamanistic duties. Soon the road turned toward the cliff and we took a path that wound upward through a hobbit world of reindeer lichen, moss, and stone. Mythical Journey is the title of one of Heikki’s books and already the trip was taking on some of that vibe. Especially when we climbed out of the woods and up into the open space atop the cliff.\nHeikki joked this hill was what qualified for a mountain in Finland, “our Rockies,” he said. But while it was a fairly easy climb, the view was as satisfying in its fashion as those I have seen from the continental divide. Our patio was a ledge of granite and moss with a drop-off of maybe 300 feet, where we stared out at a mix of farmland and forest. Heikki broke out three Sandels, a Finnish beer, and we toasted our ascent.\nWe listened to the tinkling music of aspen leaves and I realized that in the fall the whole hillside must be lit up gold. We drank our beer and stared out at the fields, soon spotting a moose—“elk” they called it—and a roe deer, an animal I had only heard of because the books I had recently been immersed in told me that eagle-owls have been known to hunt them. My mind is jammed full of owl facts. (For instance, I learned that while many, myself included, have boasted that eagle-owls are the largest owls, Blakiston’s fish owl might have something to say about that.)\nIn the woods below three fledgling eagle-owls screeched, begging for dinner. It was a sharp, grating, insistent sound, a sound that fit its goal of rousting a parent to hunt. Heikki explained that during nesting the female tended to the young while the male hunted, but now most of the work, the hunting and feeding, fell to the male.\nJuha and I continued to scan the fields with our binoculars, while Heikki headed back into the woods behind us, to urinate, I assumed. But whatever he went in for, it is what he came back with that counted.\nHe returned and smiled and pointed behind him.\nLook, he said simply, and we looked. What we saw, not 30 feet away, was a large eagle-owl in a fir tree staring down at us.\nThe light was fading, but its eyes glowed orange. Its puffed chest was slashed with dark marks that looked cinnamon in the light. I felt a mix of disbelief and wild excitement. It was the very thing I had been thinking about, reporting on, and now it was real. It stared directly at me. If I were half my size, I would have been nervous.\nIt was the beginning of a magical two hours. Crepuscular hours, though dusk this far north is close to ten. We had all made jokes earlier about words like magical and shaman, but this was exactly what I had come for, this experience as much as the sight of the bird, and there was magic to it. I have experienced times like this before in my life, times when the sights keep coming, the light keeps getting better, when you are as full as you can be, and then suddenly fuller, like a gambler on a roll.\nThe owl dropped off the fir tree, flapped, showing us the white undersides of its wings, and glided over to the top of one of two tall spruce trees that Heikki called the twin towers. Two decades ago he had spent every day here, photographing these birds and getting to know them personally. The bird we were watching was 22 years old. Not close to the record for an eagle-owl, but long-lived for a bird.\nDarkness was moving in now, coming in like the tide in almost imperceptible shifts. The young continued to beg. We heard a barking below that Juha first thought might be a lynx, but then apologized, no, it is likely just a roe deer. This seemed to be confirmed when we saw a deer freeze out in the field and we heard more barking, which we suspected was a warning from another deer letting the first one know something else was nearby. We were distracted from that drama by another, as the owl swooped down off the spruce tree and flew to a gnarled pine, not 15 feet from us.\nIf I have not made this clear already let me say it once more: to see an owl is different from seeing other birds. Part of that is the way they truly stare right into your eyes. That is what this one was doing now. I looked at it without my binoculars and then, though it was close, I stared through the binoculars at that stark and exaggerated version of its face, almost human, almost feline, those burning eyes, the facial disc that aids vision as well as hearing, the shoulders huffing up and then relaxing, the adjustment of the head as it bobbed and weaved.\nHaving paid us a visit, it flew back to the tallest spruce, and as the light faded we considered the possibility that we might have had enough and should leave the owl in peace. He had work to do after all. Down below we could still hear the young birds screeching for food. It was time to go and let their father fulfill their demands.\nThen, just as we prepared to leave, the owl drops off the spruce. He doesn’t flap at first, dropping like a stone, and I find myself thinking that that is exactly how I would drop off that tree. But then with a single flap he is gliding in front of us and down into the valley. He is after something this time, you can tell. Juha lifts his camera. Heikki and I, he with his bare eyes and me with my binoculars, try to follow the dive. As the owl gets close, we see something. “A rabbit,” one of us calls out. But it is not a rabbit.\nWhat the eagle-owl is diving toward is much larger than a rabbit. It is a lynx.\nHe is not likely hunting the lynx but warning it. Get out of my territory. I have work to do.\nWe do not see all this of course. Just a blur. But a few seconds later Juha, who by some miracle has captured the moment, is showing us the viewfinder of his camera. He is also yelling with excitement. There is the owl, wings spread wide, and there is the lynx, black tail and white paws, running off.\nThis evidence adds to our growing elation. The owl now perches in a tree above the field where the lynx was, far below us. Juha tells me that there is another name for lynx in Finland, which he translates “shadow that does tricks.” The shadows themselves have been swallowed by full darkness. It is also suddenly quieter and we realize that the beseeching of the young owls stopped as soon as their father dropped off his perch and swooped into the valley. I drink another beer and pace back and forth on our granite stage. We are not ready to leave.\nI have come to Finland to see an owl. But I have also come in search of moments. Wild moments. But what do I mean by the word? What do I mean by wild?In his essay “Walking,” published in The Atlantic in June of 1862, Henry David Thoreau has this to say: “Life consists of wildness. The most alive is the wildest.”\nBut though he then spends much of the essay circling it, Thoreau never quite lands on a strict definition of wildness. Which is perhaps appropriate given its ineffable qualities. He equates it with absolute freedom, but is not entirely clear what that means either. Robert Richardson, one of Thoreau’s finest biographers, also circles the definition, making clear that as well as being an external quality it is an internal one, and that for human beings it has “the vital, tonic effect of resorting man to emotional and cognitive awareness of his essential innermost self.” Through contact with the wild we are restored to our most vital selves.\nSo much gets in the way of this contact. In the same essay, Thoreau warns that “our expeditions are but tours.” We crave the authentic, the real, the wild, but we understand how hard these are to achieve. Self-consciousness, like our phones and screens, is another lens that gets between us and experience. We are thrice removed, maybe thrice thrice. Wildness itself, as much as any animal, seems to have gone extinct. It has become harder and harder to find, the more removed and virtual we get.\nDavid Gessner talks with 85-year-old Pertti Saurola, Finnish osprey and eagle-owl expert.\nShaman number two is wilder.\nOn my first afternoon in Finland Juha and I walked through the Kotinen Primeval Area, a deep mossy woods near his house that he called “my cathedral.” Martta, the family’s black Lab, came with us, and I marveled at the way she tore through the woods, leaping over logs and ripping through thickets and thorny briars, somehow never getting injured.\nPertti Saurola, though 85 years old, has a style similar to Martta’s. Finland’s premier osprey expert charges through the woods in his knee-length raincoat and rubber boots. He has long white hair and a white beard in the style of Santa Claus, but this is no rolly-polly elf. Rather he is angular and wired, jumping over logs and cutting through brush like an athletic Gandalf. I, wearing the same sort of getup as he is—coat and boots—try to keep up. Rain is pouring. “It’s deep there,” Pertti yells back as he leaps over a small gully onto a landing pad of peat. These mossy, dripping woods remind me of woods where I once spent a week in a cabin in Oregon.\nAn hour ago Pertti dumped some maps in my lap and told me to navigate as he drove his old car through a maze of forest roads. Now he continues to charge through thickets over the peatlands and bogs. My boot is almost sucked off when I land in one of the boggy gulleys. I am aware of the comic aspects of our mission, but I am also tired and uncertain and, thanks to jet lag, a little anxious. I stuff those feelings down. It seems we are truly lost for a while, though Pettri has a compass and GPS. “Five hundred meters that way,” he yells back to me while pointing ahead. He says there’s a path nearby and I don’t really believe him. But then, miraculously, a path appears.\nAfter about another hundred yards, or rather about another hundred meters, he stops.\n“You see it?” he asks.\nI don’t at first, but then move a couple steps closer and there it is, an osprey nest, maybe 18 feet high in a tree. Though the bulky nest is not on a platform, like so many of our nests in the United States, there are some wooden supports at the top holding it up.\n“A good storm could take it down,” Pertti says.\nOur job today is to survey the nest and determine if it is occupied. Earlier in the year an assistant of Pertti’s reported it was not, and at first that seems to be the case. But then Pertti starts to whistle.\nI know what an osprey call sounds like and can do a pretty fair imitation myself. This, however, is whole different level. This is musical genius, a series of rising and cascading whistles that sound as much like an osprey as an osprey does. Which the birds obviously think too, because soon one osprey, a juvenile, and then another, the adult female, are circling above us. We stare up through the trees. Another osprey calls from farther off. In any other nature situation with an expert, I would admit to being a bumbler and would defer. But with ospreys I can actually be helpful, aiding with the identification. Pertti is pleased with what we have discovered.\nThe rain lets up. Before we move on to survey the next nest, I point up into the tree at the nest. I know Pertti has climbed most of these trees to band the nestlings, and ask if he climbed this one.\n“Yes,” he says. “This is an easy tree. An extremely easy tree. But it is a widow-maker. Its top can break at any time. I climbed up last year to ring the nestlings when I was 84. But this year I got sensible enough not to.”\n“You’re just going to send me up there,” I say.\n“No,” he says emphatically. “No one will be climbing the tree. If anyone will be climbing the tree it’s me.”\nThe reason he will not climb it today is not really because he has gotten sensible. It is because of a recent operation on his knee. He says he hopes to be climbing again next year.\n“I would like to be climbing a week before I die,” he adds.\nAnd then he is off, charging through the wet woods back to the car so we can drive to a spot deeper in with access to the next nest.\nWhy go on about ospreys? What do they have to do with my current obsession with eagle-owls?Quite a lot it tuns out.\nPertti just happens to be an expert on the two species of birds that most interest me, ospreys and owls. He has done the work we did today, surveying Finland’s osprey nests, for more than five decades, while also studying his country’s owls, and he has found the two species inextricably intertwined. He tells me that at one point 10 percent of the predation on osprey nestling and fledglings was from attacks on their nests by Eurasian eagle-owls. This was not Flaco learning to hunts rats. This was a large bird attacking the nest of another large bird. “Intra-guild predation” is the term for one raptor attacking another.\nThose attacks fell as the eagle-owl population did, and the osprey population rose. Many other factors, including the decreased human use of environmental toxins like DDT, led to the rise in the number of ospreys, but having their homes no longer divebombed by eagle-owls certainly didn’t hurt. Pertti wrote of ospreys in 2006: “Of the 1,526 potential nest sites inspected in 2006, 987 were occupied, 795 were active (eggs were laid), and 744 were successful (young were produced). The latest population estimate for Finland is 1,200 breeding pairs.” My experience today with Pertti suggests that he inspected all 1,526 of those nests by himself or with a single companion. Likely he climbed up to most of them.\nOspreys weren’t the only birds he took stock of. He also inspected the nests of other raptors and found that while ospreys were on the rise, eagle-owls had gone through a more complicated, and bumpier, trajectory. There was a long history of eagle-owl persecution in Finland, with the hunting of the birds not just allowed but encouraged, since they were perceived as competing with human hunters. The population started to increase in the 1970s and 1980s once the hunting of eagle-owls was banned. This growth was aided by an unexpected boon that Flaco would have appreciated: “the excellent year-round food supply of Norwegian rats.” The rat boom occurred partly due to the abundance of loosely run local dumps, where the rodents feasted, covering mountains of trash to the point that, as Pertti told me, the rubbish hills looked alive, throbbing with rodents. The eagle-owls thrived on this easily accessed food source, just as Flaco had. But since the mid-1990s many of the dumps had been closed which, according to Pertti, “is certainly one of the factors behind the steep negative trend” of the eagle-owl population.\nI consider these connections as I drive my rental car south toward Helsinki. Maybe “consider” is too mild a word. I am dazzled by them. I return to the old John Muir quote: “When we try to pick out anything by itself, we find it hitched to everything else in the universe.” Which suggests a corollary: pick up two things and you will inevitably find them connected.\nFinland is turning me into a night owl.My hours are shifting due to the animal I am pursuing, but it isn’t only that. At home I am an early bird, but here we are seven hours ahead.\nThis evening I take a long nap, and when I wake, groggy and uncertain where I am, it is almost seven. At home my day would be ending. Here I take the five-minute walk to the harbor and decide, impulsively, to get on a ferry. It is a beautiful night, the Baltic Sea calm and the sky clear, and soon I am heading to the island of Suomenlinna.\nThe ferry pulls up to a green island, spotted with buildings and homes, radiant in the autumn light. I have seen my eagle-owl in the wild but now I want to see a bird like Flaco, one who has adapted to life near humans. The other day Juha told me that there might still be eagle-owls nesting on one of the islands just beyond the harbor. At first, he believed there might be a pair on Vallisaari Island, home to a military base until recently and known as “rampart island” for its old forts. I considered kayaking out to it, though I was warned that the shipping lanes were dangerous. But this turned out to have been an outdated report; there were no longer owls on Vallisaari. There was a rumor, however, that there might be an owl on this, the larger island of Suomenlinna, though no one knew exactly where. I am on the ferry following that rumor.\nWhen we dock on the island I have no idea where to go. But I see that there is a small general store not far off and I follow some fellow passengers in that direction. Seventy percent of my job on these trips, and of my working method as a writer, is talking to strangers. I see a guy coming out of the store carrying a long tube-like black case that I think may contain a fishing rod. I approach him on the principle that fishermen know where the birds are. His English is pretty good and he says that though he hasn’t caught sight of one this year, he has seen an eagle-owl here in years past. He suggests they might be nesting over by the old shipyard—as he searches for the exact word in English someone else coming out of the store stops and provides it for him, “dry dock.” He is trying to explain where the dry dock is, and I know there is no way I’ll be able to find it, when another man, this one older, says he is going that way and can take me there.\nEric wears a stubbly white beard and a Gilligan’s Island bucket hat and has a little dog of indeterminate breed who he picks up and carries as we walk. We amble over cobblestones past an old church while he tells me he spent his life at sea before retiring to Suomenlinna. He says he reads the Guardian and watches CNN and I get the sense, not for the first time on this trip, that this country might have more at stake in the coming U.S. election than we do, due to their history of being invaded by Russia and their fear that they will be next on Russia’s plate after Ukraine. Eric says we need to stop at what he calls his cabin to drop off the dog, and then insists on giving me a tour of the place, including the sauna.\nBack on the road we walk over a beautiful, low-arching bridge and turn right toward what I now see is a boatyard. Fencing blocks off the area, clearly marking it as off-limits, but Eric suggests I ignore it. He says he will do the same; he is interested in picking up some stray boards for repairs on his cabin.\nThe area we walk through is cluttered with scaffolding and two-by-fours, parts of ships, ladders, stanchions, cement blocks. After a short walk beyond the fence there is a 25-foot drop-off into a kind of graveyard of old ships in various states of disrepair, none of them looking like they would float. I stand on the edge of this area and look across the chasm at a massive Swedish fort, built in the 1700s and later captured by the Russians. A hundred yards long and 40 feet high, its walls are a mosaic of stone topped by a row of brick. What catches my eye immediately are the series of alcoves along the top that look like rough bay windows, but turn out to be gun ports. There are ten of them, black caves maybe six feet across, 30 feet up. I glass them, thinking that if I were an eagle-owl that is where I would be. I see what might be a log or stump in the third alcove from the right.\nWhile I stare, Eric scavenges for lumber. When he returns he starts telling me about his life on the sea. It is interesting stuff, but now I have eagle-owls on my mind, and I am not unhappy when he at last decides to leave. I stare at the log in the third bay. Down below me, in the chasm of lost boats, 11 barnacle geese, with black heads, white chests and gray wings, wander over the cobblestones between the ships. When I return my gaze to the third bay, the log is looking more owlish, but that could easily be my hungry imagination. And then the log moves.\nI am excited but not entirely certain what I am seeing, but gradually the log/owl starts to clarify itself. At nine o’clock the bells in the church start to play. The light is slowly fading. Through my binoculars I think I can make out the ear tufts and the slashes of black on the buff chest. But I’m still not sure. I need to watch this not-yet-owl carefully in case it moves again or possibly flies. I don’t allow myself to even look down at my phone. Time passes, maybe an hour. And then suddenly the owl fully announces itself, walking down out of the depth of his alcove/cave to its outer edge, the doorstep of the bay. I can hear his footsteps on what I assume must be an aluminum floor, and I now notice the debris, old food and bones, the innards of pellets, that litter the edge. The owl stands right on the edge of the bay, his talons gripping it, looking ready to push off, but he just scratches himself, turns around and walks back into the deeper cave of the gun bay.\nAnother hour passes. Real darkness starts to creep in. At one point a man in a sleeveless shirt with tattoos on his arms starts walking through the fenced off area where I have camped out. Someone I might try to avoid in other circumstances. But when he gets close, I point up.\n“There’s an owl up there,” I say, not taking my eyes off it.\n“It’s always there,” he says in decent English.\nIt turns out he works here.\n“He’s our dockyard mascot. We call him Mr. Who.”\nHe leaves and I keep watching. I recognize this as a test of patience. I will not miss flyout, the moment when the owl leaves behind sedentary day and begins to hunt. Another 30 minutes passes and real darkness begins to settle. Mr. Who finally decides to stroll back down to the edge of his alcove. He moves his head, bobbing and shifting, listening now, zeroing in on sounds. This is his launching pad and he is not going to push off until he is really going after something. Though his hunt will culminate in a dramatic, violent moment, eagle-owls do a lot of this. Much of what they do is wait. Wait and listen and watch.\nWaiting and watching were also at the core of the Flaco phenomenon. We can look at the whole thing through a glass darkly, and see it as a convoluted post-modern story created by social media, one that sent small armies of people chasing a beleaguered bird. But we can also see that at its essence it was about human beings watching an animal. To follow an animal. To watch an animal. To learn about an animal. It is an experience encoded in humans from our very beginnings. Millions of years of evolution have taught us this is a good thing. To quietly watch the creatures we share the world with. One of the very first skills of our species, one of the first vital tasks we took on. No wonder if feels so good to do it.\nFor the most part I resist reaching for my phone, only taking a couple of pictures of the old fort. Photography was central to the Flaco experience. On the one hand there is something distinctly un-present about our mania for picture-taking, the way we instinctively reach for our phones like gunslingers, that is if we ever put them down. It says something about our society’s hunger for being other than where we are, for wanting to remember a thing even before it has happened, for treating moments like trophies. But to pursue a perfect picture, as some of the more obsessive Flaco photographers did, is different. It is to be a hunter and to be a hunter requires virtues quite different than valued in our fast-twitch world. It requires waiting, not moving, not readying for the next thing. Which means that photographing owls, or simply watching them, requires the exact skill set that owls have in spades.\nIn this light the big bird looks almost tiger-striped, his marking distinct and his eyes orange. I try to tamp down my excitement. He seems poised to fly and that is how I feel, too: poised. When he pushes off at last I want to cheer, but he does not dive but merely flies up to the roof, perhaps to get a better view. I can hear him now. Not a hoot but a kind of curt eh-eh-eh, like a cough almost.\nFinally he drops off the fort, his wings spread, and swoops down into the boatyard chasm, taking aim at the barnacle geese. He pulls up before hitting a goose, and though they squawk I am surprised when they don’t fly off, instead just waddling away between the boats. The owl lands on a block of wood not 40 feet from me. I can see how big he is now, can see the blazing eyes up close. He is very aware of me and stares right back. He is right on top of the geese but they do not fly off, even when he swoops down again. Like he is playing a game.\nA security guard approaches but I try to keep my eye on the owl.\n“You can’t be in here,” he says. “You can’t be behind the fences.”\nI tell him I am here to watch the owl, that I have come from the United States to see it, and soon he is forgetting about ordering me to leave and telling me about the history of the fort and the history of the owls. He is the one who informs me that the owl’s home is an ancient gun bay.\n“They have been living here for quite a long time,” he says.\nHis accent is thick. Russian I think. No, Finnish, he corrects me, offended. We watch together as the owl takes another swipe at the geese and then flies off, landing atop one of the construction cranes. When he flies off the crane I lose sight of him.\nThe security guard moves on and I stay for a while, hoping the owl will come back. When he doesn’t, I leave the fenced-off area and walk over toward the crane. It is true night now and I think I had better leave, but then I catch sight of the owl atop a fir tree. I watch him, a black silhouette against an almost black sky, until it flies back atop the crane.\nIt is past midnight now and the island is empty. The ferries run late but I am not sure of the way back since on the way here I simply followed Eric. I walk up to the church, uncertain and lost, and discover a couple, their arms around each other, walking across the cobblestones. I head over to them and ask them where the ferry landing is. They have no English; in fact we have no words at all in common. Finally the man uses the translation device on his phone and shows me the screen. One word: Boat? I nod and he points me down one of the streets running away from the church.\nI am almost alone on the ferry back. We stream across the harbor toward the glittering lights of Helsinki.\nOn my last night in Finland I return to Eagle-Owl Hill.Juha will join me later, but I asked for a couple hours alone first. The problem is that, alone, I can’t find the spot where we cut in to the path up the cliff. I wander below the granite walls through the woods for an hour, looking for a way up. The walls echo with the cries of hungry juvenile eagle-owls. As a connoisseur of wild experiences, there is a certain disoriented flavor to this one: being lost.\nI finally make it back to the granite ledge and am almost immediately greeted by the owl. The second visit does not have quite the same magic as the first, unable to match the mix of surprise, expectation fulfilled, and sheer novelty. But over the next two hours I will witness a variety of interesting behaviors as the owl is divebombed by a sparrowhawk, takes several flights right below my granite stage, and flies back and forth between the twin towers of spruce and the firs closer to me. During the years it was hunted in this country, eagle-owls learned to be wary and avoid humans, but when we changed our behavior, they changed theirs, and this owl, perhaps habituated by years of human visitation, is not afraid of getting close to me. When it does I see, and feel, its sheer size and power.\nI am encouraged by the fact that both humans and owls can change our behaviors. In his brilliant manifesto The Abstract Wild, Jack Turner focuses on one particular definition of wildness, a definition that Thoreau made note of; the fact that wild is “the past part participle of ‘to will’: self-willed.” Turner argues that wilderness can be defined as “self-willed land” and that wild creatures are similarly self-willed. What does this mean exactly? It means that wild creatures tell their own story. The story that this particular owl has fashioned up on this craggy rock ledge, mating every spring for almost two decades with the same female. fathering multiple broods of young, 39 juveniles flying away from this cliff to start their own lives, getting to know every nook of its territory, learning the patterns of its prey down below, enduring the heat of summer and the cold of winter, is all its own.\nWe can argue all we want about the meaning of Flaco. Yes, he was still a captive bird, tame in some ways. But by Thoreau’s definition his final year was a wild one. The story he wrote was his own. During that year he changed and grew and learned. He acquired new skills or, rather, old skills newly found. His was a tragic story, but it was his. Up until that point in his life, for 12 years, everything, from what he was fed to how far he could fly to whether he could interact with other birds to finding a mate, was controlled by human beings. In his final year that was not the case. It is true that his year was influenced by man, man’s poison’s, man’s buildings, man’s attempts to capture and watch him. But he was wild in this sense: he authored his own story.\nI turn away from the bird and thoughts of the bird, and focus on my journal and, inevitably, on myself. I write: What, if any, is the deeper meaning of encounters like these? Can I honestly use the word “sacred” and if I do what does it mean? At the very least these moments seem capable of jarring us out of our own lives, our own enclosures.\nA shadow passes over my journal page and then over the granite- and lichen-covered tock below my feet. I look up to see the owl flying right above my head.\nA few seconds later Juha arrives, and I laughingly try to explain what I have just experienced. Juha and I have grown close during the last week. Over the next hour we watch together as darkness falls.\nThe light fades, the young owls still hectoring their father. He huffs up his wings, changes posture. It is time once again to go to work. He seems to stamp his feet on the branch he is perched on. Finally he pushes off, spreads his wings, and we watch as he once again swoops down into the valley below.\nRead David Gessner’s Walks and Talks with Dave (and Henry) series, as well as “Abandoned Homes: A Triptych” (an excerpt of A Traveler’s Guide to the End of the World), “Grizzled,” “Making a Name: Wallace Stegner,” and “Edward Abbey at Havasu,” all appearing in Terrain.org.\nHeader photo of eagle-owl in Finland by Heikki Willamo. Photo of David Gessner by Debi Lorenc.",
  "word_count": 6976,
  "scraped_at": "2026-02-14T12:11:19.291152"
}