{
  "article_id": "d6d395893dde",
  "url": "https://www.cajnewsafrica.com/2025/03/25/mtn-and-springbok-sponsorship-agreement-comes-to-an-end-after-eight-years-of-record-breaking-success/",
  "title": "MTN and Springbok sponsorship agreement comes to an end after eight years of record - breaking success",
  "date": "20250325T120000Z",
  "domain": "cajnewsafrica.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "JOHANNESBURG, 25th MARCH 2025, –/ Centre for African Journalists, (CAJ) News Africa – AFTER back-to-back Rugby World Cup wins, inspiring teamwork, deft touches, breathtaking tries and plenty of joy for fans from all walks of life, the sponsorship agreement between MTN and the Springboks ends after eight highly successful years.\nThe Springboks are the reigning world champions, having won the RWC a record four times, two of those – in 2019 and 2023 – under the MTN sponsorship.\n“This has been the most awe-inspiring and rewarding partnership for MTN after coming in as lead sponsors during a more difficult period for rugby in 2017 after the Boks had not fared as well after last winning the World Cup in 2007,” said MTN SA CEO, Charles Molapisi.\n“For us, it was about more than branding; it was about redefining transformation by returning rugby to the people and fostering the spirit of Ubuntu. We demonstrated leadership and commitment to SA sport and could not be happier with the results.\n“We would like to thank SA Rugby for placing their faith in us and having us as their headline sponsor for such a long time. We are proud to have been partners as they upped the game’s development and ushered in a golden era of success for current and future generations.\n“After closing the page on a winning campaign on-and-off the field, where the game was taken from the big lights of Emirates Airline Park, Stade de France, and Twickenham to the inner cities, small towns, and rural areas where growth needed a boost, the Boks and MTN will now open new chapters in their respective sponsorship journeys.”\nMr Mark Alexander, President of SA Rugby, said: “I’d like to thank MTN most sincerely for their support over the past eight years.\n“If you remember, we put out a call to corporate South Africa to partner with us at a challenging time for rugby in this country, and MTN answered that call, loud and clearly. Together, we have enjoyed what will, in time, I’m sure, be regarded as a golden age for the sport in this country.\n“The Springboks have twice visited MTN’s offices as newly crowned world champions, marking the pinnacle moments in our partnership. MTN has supported us every step of the way—not only in our efforts to win rugby matches and bring joy to the country but also in showcasing the power of South Africa’s diversity when we stand united.\n“MTN’s faith was truly inspiring when they first came on board during those dark days. Of course, rugby would grind to a halt without the unwavering support of our partners. MTN led the way in this regard, and we wish them every success in the future.”\nTogether with SA Rugby, MTN played a key role in raising SA Rugby’s global profile and securing long-term sustainability.\n“Beyond the professional game, MTN committed R30 million to grassroots rugby development in South Africa, and we will continue playing a vital role in the development phase of rugby across the country,” added Molapisi.\nDuring its period as headline sponsor, MTN aimed to broaden and inspire the fan base to get behind their team. MTN invested in fan engagement through BokSquad, the official Springbok supporters club, and the Bozza, bringing supporters closer to this passion – and to the team.\nMolapisi said: “We could not have had this success without the fans, and I would like to thank every one of the Bok fans from across the country – from the young children in Dutywa running through the streets to support their team to the parents and families in big cities and small villages – for their unbelievable passion and support. The Boks’ global success is their success.\n“I believe rugby and its development are set to reach even greater heights built on the firm foundation of transformative success, loyalty, support and excellence that has been seen over the past eight years.”\nAs part of its renewed brand positioning, MTN is evolving its sponsorship strategy to explore new opportunities that will drive progress for even more sportsmen and women around the country.\nMTN remains committed to sport and development in South Africa – the company will continue to invest in football through its MTN8 sponsorship.\n“We remain proud wearers of the Bok jersey. Rugby’s success shows the impact sport can have in uniting our nation, inspiring its people and giving hope to millions. There is no doubt that with the continuing support of MTN and other corporates, together with the backing of sport bodies like SA Rugby, SA will continue to raise the champions of tomorrow,” concluded Molapisi.\nDistributed by Centre for African Journalists, (CAJ) News Africa on behalf of MTN SA.\nISSUED BY:\nMthokozisi Ndlovu, Senior Manager: External Communications, MTN SA\nCell: 083 209 2683\nE-mail: Mthokozisi.Ndlovu@mtn.com\nAbout the MTN Group\nLaunched in 1994, the MTN Group is a leading emerging market operator with a clear vision to lead the delivery of a bold new digital world to our customers. We are inspired by our belief that everyone deserves the benefits of a modern connected life. The MTN Group is listed on the JSE Securities Exchange in South Africa under the share code ‘MTN’. Our strategy, Ambition 2025, is anchored on building the largest and most valuable platform business, with a clear focus on Africa. www.mtn.com\nVisit us at www.mtn.com or www.mtn.co.za\nFollow us on X @MTNza | LinkedIn: MTN South Africa\n– CAJ News",
  "word_count": 910,
  "scraped_at": "2026-02-14T12:34:56.295567"
}