{
  "article_id": "d6f5a23436a0",
  "url": "https://www.inverelltimes.com.au/story/8667838/aflw-players-set-for-earlier-hall-of-fame-nods/?cs=9735",
  "title": "AFLW players set for earlier Hall of Fame nods",
  "date": "20240619T041500Z",
  "domain": "inverelltimes.com.au",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "An immediate rule change will allow AFLW champions such as Erin Phillips and Daisy Pearce to be acknowledged in the Australian Football Hall of Fame earlier than expected.\nSubscribe now for unlimited access.\nor signup to continue reading\nOnly one female is currently in the Hall of Fame - women's football pioneer Debbie Lee - and all six inductees on Tuesday night were men.\nUntil now, players must have been retired for at least five years before being considered for selection.\nBut AFL chair Richard Goyder, who doubles as the Hall of Fame selection committee chair, confirmed AFLW players can now be considered after just one year in retirement.\nIt opens the door for the likes of Adelaide and Port Adelaide champion Phillips and former Melbourne star Pearce, now coach of West Coast's AFLW team, to be included as early as next year - when the Hall of Fame celebrates its 30th anniversary.\n\"We've altered our rules to allow us to induct AFLW players after one year of their retirement,\" Goyder told a packed room at Tuesday night's induction ceremony in Melbourne.\n\"The Hall of Fame includes just one woman currently - Debbie Lee - who is here tonight and who made such an incredible contribution to the growth of women's football.\n\"But in future years, the great female players who built the AFLW will start to be inducted here as they continue to inspire both young girls and young boys to play our game.\"\nPhillips and Pearce are both considered certain future Hall of Fame inductees for their significant contributions to women's football, especially in the formative years of AFLW.\nBoth are among the biggest stars of the women's competition since it began in 2017.\nDual-sport star Phillips is a three-time premiership player and won the league's best-and-fairest award twice, while Pearce was Melbourne's inaugural captain and played in their season-seven premiership.\nAustralian Associated Press",
  "word_count": 316,
  "scraped_at": "2026-02-14T12:47:40.003327"
}