{
  "article_id": "d70452f26a09",
  "url": "https://www.90min.com/posts/arsenal-sign-alessia-russo-free-transfer-man-utd-exit",
  "title": "Arsenal sign Alessia Russo on free transfer after Man Utd exit",
  "date": "20230704T161500Z",
  "domain": "90min.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Arsenal sign Alessia Russo on free transfer after Man Utd exit\n- Arsenal have announced Alessia Russo signing\n- Striker joins after leaving Man Utd at the end of June\n- Gunners failed with world record bid for Russo in January\nArsenal have completed the signing of England striker Alessia Russo on a free transfer following her recent departure from Manchester United.\nThe Gunners had attempted to sign Russo at the end of the January transfer window, only to see two world record bids rejected by Manchester United. But with the player unable to agree a new contract to remain in the north west, she ended up being available as a free agent just months later.\nSet to wear the same number 23 shirt she had at United, and will wear for England at the World Cup this summer, the former Brighton and Chelsea player is already the third Arsenal signing of the summer after bringing in Swedish defender Amanda Ilestedt and Canadian forward Cloe Lacasse.\n\"I'm really excited to be here, and I can't wait to get going,\" Russo said. \"I want to win trophies – as does everyone in this club. I can't wait to get stuck in and grow as a player – it's a new challenge and a new environment.\"\n\"I think the growth of the women’s game has been incredible, but particularly at a club like Arsenal. The sell-out against Wolfsburg at Emirates Stadium last season was fantastic, and I'm just really excited to be part of this club.\"\nThe announcement is a weight off the shoulders of one of the biggest names in English women's football, recently admitting the speculation about her future has been tough. The move to Arsenal had been one of the WSL's worst kept transfer secrets of recent weeks, while Beth Mead had also spoken of her desire to link up with Russo at club level during an appearance on 90min Talks.\nREAD THE LATEST WSL NEWS, QUOTES, PREVIEWS & MATCH RATINGS HERE\nOf his newest player, Arsenal boss Jonas Eidevall said, \"Alessia is one of the best forwards in the world and has significant potential to continue growing and improving.\n\"She has a proven track record of scoring goals in the WSL and at international level, and we believe she will be a quality addition to our forward line, so we’re all delighted to have brought her to the club.”\nAt international level, Russo has scored 11 goals in 21 appearances for England and was part of the team that won Euro 2022 last summer. She netted four times in the tournament, always off the bench, with her instinctive and opprtunistic backheel against Sweden in the semi-final named Goal of the Tournament by UEFA and later nominated for the 2022 FIFA Puskas Award.\nAnalysis: What Alessia Russo transfer means for Man Utd & Arsenal\nManchester United rejected a world record fee in order to keep Alessia Russo at the club midway through the season. The hope was that a new contract would be agreed, but plenty have questioned that choice now that she has ended up leaving as a free agent and joining the same rival anyway.\nIn that moment, Russo continuing at United regardless of the possibility she could still move on without a transfer fee was worth more to the Red Devils in their pursuit of Champions League football. Taking the money risked upsetting the balance of the team in the most important season of the club's short history and, in one sense the gamble paid off, becaue European qualfication was delivered.\nAs one of the faces of the Lionesses, Russo was a huge draw for United in terms of matchday attendance and wider marketing opportunities. On the pitch, she was yet to reach the heights of a player like Sam Kerr, Khadija Shaw or Rachel Daly, capable of scoring 20 league goals in a season.\nRusso was an attacking focal point for United and still has the potential to become world class, but her 10 WSL goals this past season were matched by winger Leah Galton. The team spread around its goals more than any other it may not be too challenging to secure a similar replacement to plug the gap - as long as the club is willing to invest. In that sense, Barcelona's Geyse is on the radar. Within the United fanbase there is a feeling that Ona Batlle, who has joined Barcelona on a free transfer after the club failed to retain her, is actually a more significant loss on the pitch.\nAs far as Arsenal are concerned, they have added one of the brightest and most recognisable talents in women's football to their squad as she, at the age of 24, prepares to hit her peak. That is all without spending a single penny on a transfer fee. It represents incredible business.\nWith the right nurturing from Jonas Eidevall and his staff, Russo could take everything she has learned with Manchester United and from her fledgling international career and step up to the next level relatively quickly. Given that there remain uncertainties about Vivianne Miedema's long-term future and Stina Blackstenius has been somewhat hit and miss, Russo could ultimately thrive.\nIn the short-term, however, she will go from being an automatic starter like she was in Manchester, to just one of several options for the Gunners. The fact that Arsenal intend to compete for trophies on four different competitions at least means there won't be a lack of opportunities, with squad depth important to build in the wake of last season when injuries nearly had catastrophic consequences.\nRusso is versatile enough that she can play on the right in addition to the 'number nine' role she is mainly known for. It was something she did on occasion for United, both when Signe Bruun was briefly at the club and early in 2022/23 when Nikita Parris had first arrived. With Beth Mead still sidelined at least for now, she gives Arsenal that option too, even if Blackstenius continues to start through the middle, and is a different option to the more natural winger Victoria Pelova.",
  "word_count": 1022,
  "scraped_at": "2026-02-14T12:22:08.400190"
}