{
  "article_id": "d727e73b85ea",
  "url": "https://www.newsindiatimes.com/trump-campaign-courts-younger-men-to-make-up-losses-with-women-voters/",
  "title": "Trump campaign courts younger men to make up losses with women voters",
  "date": "20240920T203000Z",
  "domain": "newsindiatimes.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Republican presidential nominee Donald Trump is betting on podcast interviews, appearances at sports events and targeted digital advertising to reach uncommitted young, male voters, whom his campaign has identified as his best path to victory in November.\nThe campaign has homed in on a group of undecided voters that makes up 11 percent of the electorate in battleground states, according to an analysis that Trump advisers presented to reporters in August. Those voters are mostly men under 50 who identify as moderates, and they are predominantly White but include more Latinos and Asian Americans than the general population, said campaign officials, who spoke on the condition of anonymity to discuss their strategy.\nThis focus has led Trump to some unfamiliar settings for a former president. He discussed recreational drug use and addiction with Theo Von, a former MTV host turned popular podcaster. He also appeared on podcasts hosted by controversial YouTuber Logan Paul, whose sponsors include the maker of intimate grooming products, and Adin Ross, who rose to fame streaming himself playing video games on Twitch until the platform banned him for homophobic and other hateful content.\nTrump has repeatedly attended Ultimate Fighting Championship matches and chose UFC chief executive Dana White and former pro wrestler Hulk Hogan to introduce him at the Republican National Convention. Trump also took credit for blessing the winning car at a Formula One race in Miami.\nThe campaign’s emphasis on younger men in the race against Vice President Kamala Harris plays to Trump’s celebrity appeal and, to some people, an archetype of a certain image of masculinity. It also acknowledges his consistent underperformance with suburban and older women, who used to be more reliable Republican constituencies.\n“That is beyond smart because they’re talking about a population that is underrepresented in actual votes on Election Day,” said Josh Holmes, a prominent Republican strategist. “To the extent they can capture and motivate them, that is a significant demographic. It’s a totally untapped marketplace.”\nBut Trump’s hunt for disengaged young men carries risk because they vote less frequently – a gamble that reflects how much ground he has lost with more traditional Republican voters.\n“If they don’t turn out and he’s alienated the people who are more consistent voters, then you’re really in a pickle,” said Amy Walter, editor in chief of the nonpartisan Cook Political Report.\nHarris’s campaign is also targeting young men with television commercials during college football, National Football League and Major League Baseball games, and soccer matches, as well as with ads on sports talk radio and content on social media and the live-streaming service Twitch. Democrats said they have been able to redouble their emphasis on young men since Harris replaced President Joe Biden at the top of the ticket because she made up ground with young women where he had been lagging.\nBut the Harris campaign does not define its target voters as narrowly as the Trump team, and advisers argue she has more room for growth. In addition to voters under 50, who are more likely to be men and who include more people of color than the general population, the Harris campaign also sees opportunities among White women without a college degree who are especially affected and motivated by reproductive rights, as well as moderate Republicans and independents who are uncomfortable with Trump and his MAGA transformation of the GOP.\n“That is a target group, it’s not the primary target group for Democrats,” Democratic pollster Celinda Lake, who has advised Biden and Planned Parenthood, said of young men. “The formula for success for Democrats is to win women by more than they lose men,” Lake added.\nThe long-standing partisan split along gender lines is growing even more pronounced this cycle. New York Times-Siena College polls of six swing states in August found that young men backed Trump by 13 points, while young women favored Harris by 38 points. An ABC-Ipsos poll this month found that Harris led by 38 points among young female likely voters under 30. By contrast, Harris edged Trump by three points among young male likely voters under 30.\nIn a deeply divided electorate, the slice of voters that the campaigns believe could swing either way has grown vanishingly small – just about 2 percent, according to a Harris campaign official who spoke on the condition of anonymity to discuss internal strategy. The greater challenge is to mobilize disengaged Americans who are deciding whether to vote at all.\n“The traditional image of a swing voter is a real anachronism: It’s not really like there’s just these people who sit in Wisconsin and they’re trying to decide between the Republican or the Democrat every single cycle,” said Dan Pfeiffer, a former adviser to Barack Obama. “Some of them are choosing between Kamala Harris and Trump. More of them are probably choosing between one of the two candidates and the couch.”\nBecause young voters are historically part of the Democrats’ core coalition, if Trump significantly outperforms with young men compared with 2020, Pfeiffer said, “it makes the math impossible for Harris.”\nIn 2020, men ages 18 to 29 favored Biden 52 percent to 41 percent, according to the national network exit poll. A different exit poll, AP VoteCast, found that the group supported Biden 56 percent to 41 percent, similar to the result in a recent Washington Post-ABC-Ipsos poll.\nTrump has also mentioned privately that his 18-year-old son Barron is a big fan of Von, according to a person close to the former president. But such interviews reflect a more deliberate strategy of putting the former president in front of audiences that skew young and male and don’t typically tune in to political news.\n“There is a reason why we’re doing all of those things,” a Trump campaign official said. “These are not people that sit up watching ABC, Fox and CNN.”\nIn interviews with young male voters at recent Trump rallies, several brought up his podcast appearances, including with the Nelk Boys, Logan Paul and Adin Ross. Others said they watched his interview with Elon Musk on X and his interview with Von. They liked that Trump attends UFC matches and expressed admiration for his persona. Many cited the economy as their top concern and said they admired that Trump spoke his mind.\n“I thought it was really cool, like Theo was talking about how he’s a recovering alcoholic and drug addict, and Trump was kind of asking him questions out of curiosity because Trump claims to have never drank or anything before. I believe it, personally, but I thought that was cool,” said Evan Lahey, 21, who attended Trump’s town hall in La Crosse, Wis. “He’s kind of just a guy’s guy, which appeals to a lot of people.”\n“Even though he’s like way older than Kamala, he’s way more in touch with our demographic,” Lahey added.\nResearchers from both parties said young men are more likely to get information from nontraditional sources such as social media or streaming. They are also more likely to show interest in third-party candidates or split their tickets.\nAkshay Salvi, 35, of the Philadelphia area, said independent Robert F. Kennedy Jr. was his favorite, but Kennedy’s endorsement of Trump did not influence him and he was now supporting Harris. He said abortion weighed heavily on his vote – an issue that Harris campaign officials say resonates with young men and women alike.\n“Trump, he had his four years and people didn’t like the way he controlled power, so he was not elected the next time, in 2020,” Salvi said. Overturning Roe v. Wade, he said, was “like going back 20 years, maybe 50 years. That’s not the way women should be treated.”\nMolly Murphy, a Harris campaign pollster, said the challenge is persuading these voters to support Harris, “because they don’t know her very well.”\n“Part of the reason these younger voters have always been core to our target universe is, over time, they’ve become more and more turned off by politics and less trusting of institutions,” Murphy said. “And so they’re actively trying to ignore us all.”\nThe Harris campaign said its outreach to young voters includes campus organizing and digital ads emphasizing the right-wing policy blueprint known as Project 2025. The campaign is targeting suburban women with a bus tour and television ads focused on reproductive rights. For people of color who are undecided or vote inconsistently, the campaign is appearing at historically Black colleges and universities, partnering with faith leaders, using a Latinos-focused WhatsApp channel and running ads tailored to Black Americans and Spanish speakers.\n“It’s never like, ‘Hey, if we just say this one thing to this group of voters, we’re going to be fine.’ It’s never that and it’s not like one day they all move in unison,” Harris campaign senior adviser David Plouffe said. “Trump believes that if he goes on certain podcasts and says he likes UFC and says he’s a tough guy, he’s somehow going to over-perform, but he looks incredibly weak right now, and almost, I think, to the extent that some voters are laughing at him.”",
  "word_count": 1516,
  "scraped_at": "2026-02-14T12:17:39.702644"
}