{
  "article_id": "d7328d449fbf",
  "url": "https://news.webindia123.com/news/Articles/India/20250612/4326219.html",
  "title": "NCB and ANTF organise  Drug Free India  Walkathon in Chandigarh",
  "date": "20250612T044500Z",
  "domain": "news.webindia123.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Saturday, February 14, 2026\nNews\nChandigarh | June 12, 2025 9:44:11 AM IST\nAccording to IG Narcotics, Pushpendra Kumar, the 'Drug Free India' Walkathon was orgainsed as an anti-drug movement in Chandigarh, and it is taking place in different parts of the country as well.\nThe main motive of the initiative is to convey to the youth the ill effects of drug addiction and also motivate them to stay away from them, the official said.\n\"The NCB (Narcotics Control Bureau) and ANTF (Anti-Narcotics Task Force) of Chandigarh Police are organising this fortnight as an anti-drugs movement. It is happening in different places across the country. Our effort is to tell the youth about the ill effects of drug addiction and motivate them to stay away from drugs. At the same time, we are also telling the people through a walkathon or other creative activities that drug addiction is a bad thing\", Pushpendra Kumar told ANI.\nMeanwhile, on Wednesday, Punjab Chief Minister Bhagwant Mann said that his government would \"wash away the stigma of drugs\" from the state through sports.\nHe was speaking to the media here after flagging off, along with Aam Aadmi Party leader Arvind Kejriwal, a shipment of rugby balls to London from Jalandhar.\n\"Today, a shipment of 25,000 rugby balls has been sent to London from here in Jalandhar... The Rugby World Cup has been played with rugby balls made in Jalandhar. The Cricket World Cup has been played with bats and balls made in Jalandhar... Even during the election campaign, Arvind Kejriwal said that Jalandhar should be established as a sports hub,\" Mann said.\n\"This time, the captain of our cricket team, Shubman Gill, the Captain of the women's cricket team, Harmanpreet Kaur, and the captain of India's football team, Gurpreet Singh Sandhu, all are from Punjab... We will wash away the stigma of drugs on Punjab through sports,\" he added.\nLast month, the Punjab and Haryana governments had launched 'Walk for Drug-Free Chandigarh' initiative, which was attended by governors and Chief Ministers of both states. (ANI)\nLATEST COMMENTS ()\nComments Not Available",
  "word_count": 347,
  "scraped_at": "2026-02-14T12:35:14.378458"
}