{
  "article_id": "d757f473b03a",
  "url": "https://www.newsandstar.co.uk/news/23786270.zero-tolerance-sexual-harassment-ncic-report/",
  "title": "  Zero tolerance  for sexual harassment at NCIC after report",
  "date": "20230914T083000Z",
  "domain": "newsandstar.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "The North Cumbria Integrated Care Trust (NCIC) has said there is ‘zero tolerance for harassment’ after a report said that there a pattern of female trainees being abused by senior male surgeons across the NHS.\nThe sexual misconduct in surgery survey found that a third of NHS female surgical staff had been sexually assaulted by colleagues in the past five years across the country.\nThese findings come just four months after a study by the BMJ found evidence of more than 35,000 sexual safety incidents had been recorded in NHS hospitals in England over the past five years.\nOverall the study two thirds of women working in surgery report having been sexually harassed by a colleague in or around the operating theatre. There were 11 instances of rape reported by surgeons who participated in the study.\nThere is no suggestion that any such incidents have been reported across Cumbria and NCIC say any allegations will be ‘taken seriously’.\nA spokesperson for NCIC said: “At North Cumbria Integrated Care NHS Foundation Trust we have processes in place for staff to raise concerns or highlight any issues.\n“We have a zero tolerance for harassment and the safety of our employee is one of our highest priorities.\n“Any allegations of sexual harassment or assault will be taken seriously, and staff will be supported through our own safeguarding team and the police.”\nThe British Medical Association (BMA) called the findings \"atrocious\".\nREAD MORE: Charity football match raises more than £6,000\nDr Latifa Patel, BMA equality lead, said: \"It is appalling that women in surgery are being subjected to sexual assault and sexual misconduct from their colleagues, at work and often whilst they are trying to care for patients.\n“The impact this will have on their wellbeing for years to come as well as their careers is profound.\"\nNHS England said that the report made for \"incredibly difficult reading.”\nA spokesperson said: \"We are already taking significant steps to do this, including through commitments to provide more support and clear reporting mechanisms to those who have suffered harassment or inappropriate behaviour.”",
  "word_count": 346,
  "scraped_at": "2026-02-14T12:04:18.711340"
}