{
  "article_id": "d761a31f34fe",
  "url": "https://www.theguardian.com/world/2025/may/02/friday-briefing-reform-takes-labour-scalp-in-knife-edge-runcorn-by-election",
  "title": "Friday briefing : Reform takes Labour scalp in knife - edge Runcorn byelection",
  "date": "20250502T071500Z",
  "domain": "theguardian.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Good morning. Who knows if they were awake for it, but if so, Kemi Badenoch and Keir Starmer may wish they could go back to bed. In the byelection in Runcorn and Helsby, Labour’s 49th safest seat, the party lost a majority of almost 15,000 to the Reform candidate Sarah Pochin after a recount – agonisingly being defeated by the margin of just six votes, the narrowest byelection victory in more than 100 years. In Lincolnshire, the former Conservative minister Andrea Jenkyns was announced as the new Reform mayor a few minutes ago.\nA caveat worth repeating: there is an awful lot of this story still to be told, because the results in councils are yet to be announced. We can say this, though: the results so far will have left Nigel Farage in a very good mood indeed.\nTo follow the latest news and analysis as it lands, head to the live blog. The latest results are here. Today’s newsletter, with the help of Josh Halliday in Runcorn, Robyn Vinter in Doncaster, and Ben Quinn in Lincolnshire, is about what we know so far. Here are the headlines.\nFive big stories\n-\nUS news | Trump’s two top national security advisers, Mike Waltz and his deputy Alex Wong, are stepping down from their posts in the Trump administration. Waltz, who has faced intense scrutiny over the Signal group chat scandal, will be nominated as the US ambassador to the United Nations.\n-\nClimate crisis | Nine London-based banks, including HSBC, Barclays, NatWest and Lloyds, have collectively put more than £75bn ($100bn) into companies developing huge oil, gas and coal “carbon bomb” projects, a study has found. Experts say the 117 projects have the potential to produce the equivalent of a decade of total global carbon dioxide emissions.\n-\nUkraine | The White House will approve its first sale of military equipment to Ukraine since Donald Trump took office, in an indication that the minerals deal signed by the two countries this week may open a path to renewed weapons shipments. A senior aide to Volodymyr Zelenskyy said Kyiv hoped that weapons deliveries would resume swiftly.\n-\nCyber security | Harrods has been hit by a cyber-attack, just days after Marks & Spencer and the Co-op were targeted. The M&S attack, linked to a hacking collective known as Scattered Spider, wiped £650m off the company’s value as it was forced to stop website orders for almost a week.\n-\nCulture | Dozens of artists – including Pulp, Paul Weller and Primal Scream – have come out in support of the band Kneecap, as counter-terrorism police said they were investigating videos of them allegedly calling for the deaths of MPs and shouting “up Hamas, up Hezbollah”. As a planned gig in Plymouth was cancelled by the venue, the artists said there had been a “clear, concerted attempt to censor and ultimately deplatform” Kneecap.\nIn depth: A good night for Nigel Farage – and pain for the Tories and Labour\nThe first sign of the direction of the night came in North Tyneside, shortly after 2am, where Labour held the mayoralty – but saw their majority massively reduced. Labour’s Karen Clark beat Reform’s John Falkenstein by just 444 votes. In 2021, Clark’s predecessor Norma Redfearn won with 53% of the vote; Clark prevailed with a shade over 30%. “A win is a win,” science minister Peter Kyle told the BBC. But a win can also be a warning.\nHere’s what else you need to know.\nWhat happened in Runcorn?\nNigel Farage was reported to have spent quite a lot of the night sitting in a car somewhere near the DCBL Stadium in Widnes, where votes in the Runcorn and Helsby byelection were being counted, ready to sweep in to claim the glory if it went Reform’s way. He was waiting for a long time.\nThe extraordinarily tight margin of the first count – four votes - was followed by a full recount, and close scrutiny of every ballot (“I’ve seen more drawings of penises than I’ve ever seen in my life,” one observer told Josh Halliday). At 4.24am, Farage made a premature claim of victory on social media, and said it was Labour that demanded the recount. He finally got out of a car with his candidate, former Conservative councillor Sarah Pochin, at 5.49am.\nA few minutes later, the result finally landed: Pochin had won. In her speech, hilariously delivered with the Monster Raving Loony Party candidate hovering inches to her left, she said that the voters had delivered an anti-system message: “Enough is enough. Enough Tory failure. Enough Labour lies.”\nThis was a brutal result for Labour, given Runcorn was one of their 50 safest seats in the country at the general election. Keir Starmer stayed away from the seat, presumably hoping to avoid being too closely associated with a potential defeat: he may now be wondering if he might have swayed the four people he would have needed to fend off the Reform challenge.\n“Bloody hell,” Josh Halliday said in Widnes. “It was pretty dramatic. Often when you do these things, you hear that it’s too close to call, and actually most of the time people have a good idea who won. This time no one knew which way it would go right until the wire.”\nWhat is the broader significance of the result?\nPochin doesn’t seem like a classic Reform candidate on paper: she has previously welcomed refugees, and appeared compassionate towards criminals in her role as a magistrate. “But she was very much on message during the campaign,” Josh said. “‘Stop the Boats’, bashing Labour for letting prisoners out early, but also criticising them over the winter fuel allowance. She was quite provocative on sensitive local issues, with a video outside a local hotel housing asylum seekers and another one outside a Turkish barber’s in the city centre.”\nAhead of the vote, there were suggestions that tactical anti-Reform voting might play a crucial role here. And the number of votes for the Green party and Lib Dems – 3,256 between them – suggests that that may have been the case. But it was not enough to hold off Reform, who may have similarly benefitted from Tory switchers.\n“I spoke to a couple of Tories who said they were going to back Labour because they couldn’t stomach Reform, and that probably made it closer than it would have been,” Josh said. “I’ve been here four times since the end of January, and it’s felt like Reform’s to lose – I wonder whether polls showing them winning made people ask if they really wanted a Reform MP. But at best, it cushioned the Labour defeat.”\nLuke Tryl, of More In Common, said that one key question ahead of the by-election was whether Reform’s momentum could be converted to actual votes against the traditional parties’ “get out the vote” operations: “Clearly they’ve done that in Runcorn,” he said. “Their performance in the byelection significantly exceeds the swing you might you expect based on current opinion polls.”\nWhat else do we know so far?\nIn Greater Lincolnshire, Reform’s candidate Andrea Jenkyns – who you may remember giving the finger to protesters outside Downing Street in her previous incarnation as a Tory minister, and who campaigned on a “DOGE Lincolnshire” ticket – won comfortably: she won more than 100,000 votes, 42% of the total, against less than 65,000, or 26%, for her Conservative opponent.\n“This is a painful blow to the Tories in an area that’s one of their heartlands,” said Ben Quinn, who was covering the count. “It wasn’t without damage for Labour as well – she annihilated the Tories across Lincolnshire, but even the places were Labour might have done better she beat them comfortably.”\nIn the West of England, Labour’s Helen Godwin finished ahead of her closest rival, Reform’s Arron Banks, by 5,945 votes – a much better performance for Reform than the polling had indicated.\nAnd in Doncaster, Labour’s Ros Jones beat Reform’s Alexander Jones by a whisker – 23,805 votes to 23,107. While that was a relief for Labour, it also represented a 21% swing to Reform.\n“Everyone has been talking for quite a long time about Reform being a threat to the Tories, but this is a really good example of the threat they pose to Labour,” said Robyn Vinter, who was covering the count there. “The Conservatives actually did better than they could have expected, considering they’ve never won here before. Ros Jones told me she was frustrated with the national party over the winter fuel allowance cut and the Pip cut, which she thought had gone down very badly here.”\nThose looking for a sense of how the Conservatives are likely to do in the many councils they hold across the country that are up for grabs were paying close attention to Staffordshire, where the Tories held 55 of 62 seats until yesterday. Of 30 results called by 5.30am, 24 had gone to Reform – every one of them previously held by a Conservative.\nSam Freedman, author of the Comment is Freed Substack, reasonably called it an “absolute shocker” for the Tories, and added: “I thought it was one of their best chances to hold a council and Reform are going to win it outright easily. I can’t see them holding any of their 19 councils now.” Across all of the council seats declared in England a short while ago, Reform had 66 seats – from a standing start – while the Tories were on 37, down 50, and Labour were on 11, down 13.\nWhat’s still to come?\nOnly one council was expected to complete their count overnight – Northumberland – and the results there should land soon. If the Tories lose control there, with Labour hopeful of becoming the largest party but with no one having overall control, it may be the start of a very long day for Kemi Badenoch.\nThere’s a break until 1pm when Durham are next to announce, and you can expect that void to be filled by considerable broadcast pontification. While Reform has undoubtedly had a good night, we should wait to see the council results before making any claims about the complete picture. The mood of the electorate presented by most recent polls – with Labour, the Conservatives and Reform all between 20% and 25% – means that quite small variations can make big changes to the overall result.\nThe BBC publishes John Curtice’s estimate of national vote share in the afternoon, and the final results drop around 7pm tonight: by then, we’ll have a sense of just how ugly things might get for Badenoch and Starmer – and whether Reform really can claim to be the most popular party in England.\nWhat else we’ve been reading\n-\nFor this Guardian long read, Manvir Singh explores the myths and money-making behind the booming ayahuasca and magic mushrooms shaman trade. Annie\n-\nCongratulations to Stuart Heritage on coming up with 20 Dwayne Johnson movies to do a Ranked! on. It’s rough news for the four movies that are worse than Journey 2: The Mysterious Island, though. Archie\n-\nHe moved fast and destroyed things; Elon Musk’s 100 days of chaos in the Trump White House is dissected by Nick Robins-Early. Annie\n-\nChris Stokel-Walker has a fascinating piece about ChatGPT’s tendency to tell you what you want to hear, however unhinged your question might be – and what that reveals about the incentives in systems built to “maximise retention, engagement and emotional buy-in”. Archie\n-\n“I don’t want to die in a hotel room”: Ozzy Osbourne exclusively speaks to Alexis Petridis about chronic pain, 50 years on the road and Black Sabbath’s final reunion. Annie\nSport\nFootball | Manchester United cruised to a 3-0 victory in their Europa League semi-final first leg in Spain against Athletic Bilbao, while Tottenham took a 3-1 win over Bodø/Glimt. Chelsea climbed to the top of the Conference League with their 4-1 semi-final win over Djurgården, and in the Premier League, Brentford took advantage of Nottingham Forest’s lax defence for a 2-0 win.\nFootball | In a U-turn, the Football Association will ban transgender women from playing in women’s football from 1 June following the ruling from the supreme court that the term “woman” in the Equality Act refers only to a biological woman.\nDarts | Luke Littler fought back to see off Michael van Gerwen 6-4 to win night 13 of the Premier League in Birmingham, setting a new record with a fifth overall evening victory of the season.\nSomething for the weekend\nOur critics’ roundup of the best things to watch, read, play and listen to right now\nTV\nThe Four Seasons | ★★★★☆\nThis Tina Fey comedy is full of properly funny lines, rooted in properly middle-aged experience. In its comedy and its drama it captures the warm, weary affection for life and each other that only old friends and enduring couples really know. Part White Lotus without fatalities, part Gilmore Girls on HRT or Golden Girls with men, The Four Seasons is Fey and her writing and acting ensembles on fine form, everything informed by her rigorous intelligence, wit and experience. Rest your aching bones and enjoy. Lucy Mangan\nFilm\nThunderbolts* | ★★★☆☆\nMarvel’s latest can be messy. Not just the movie, with its clumsily forced narrative beats and whiplash tonal shifts. But also, its title characters, the broken and lonely souls who ditch the colourful costumes and wear their emotions on their sleeves, as if it’s their brand. It may irritate because the depression and trauma the movie supposedly grapples with so often lives on the surface, like easy characters traits that are spoken out loud or worn like another costume fitting. But if it ultimately works, it’s all due to Florence Pugh – she’s a superhero performer, easily navigating the tricky balance between cheeky Marvel-brand humour and genuine pathos. Stuart Heritage\nBook\nBad Friend by Tiffany Watt Smith\nWatt Smith is a historian, and this book is a deeply researched study of 20th-century women’s relationships, but the reason for writing it is intensely personal. In the prologue, she says that she fell out with her best friend, Sofia, in her early 30s, and has been battling with the feeling that she is incapable of close friendship ever since. With this book, she provides us with a blueprint for how to sustain friendships that are flawed, and sometimes painful – but more meaningful because they are real. Kitty Drake\nMusic\nModel/Actriz: Pirouette | ★★★★☆\nWhether the band are dealing in the tension of opposites or something more holistic, Pirouette is reliably exciting. You would struggle to describe its take on pop music as commercial when faced with something as overwhelming as Ring Road, but it’s certainly more approachable than their debut Dogsbody, an album you almost had to brace yourself to listen to. At any rate, if that album was the kind of thing from which rabid cult followings are made, its successor is the kind of thing from which bigger cult followings are made. Model/Actriz still don’t really sound like anything else. Alexis Petridis\nToday in Focus\nHow Kneecap became most controversial band in the UK\nThey shot to fame with their provocative blend of rap and republicanism, but their on-stage pronouncements have sparked shock and led to a media storm. Rory Carroll reports\nCartoon of the day | Ben Jennings\nThe Upside\nA bit of good news to remind you that the world’s not all bad\nIn the five years since the managers of the Sharpham estate in south Devon began an ambitious rewilding project on the 223 hectare estate, miraculous things have started to happen. Butterflies, woodland animals and insects have returned, and a flock of 500 goldfinches have appeared, drawn to the new food sources from the grasses and thistles that have grown over what used to be ploughed fields.\nFor years the estate, originally created by a wealthy naval sea captain from the spoils of plundered Spanish treasure, has been hosting Buddhist-inspired mindfulness retreats.\nWhen the rewilding project began, the new director of the estate Julian Carnell wanted to build something that would combine the estate’s mental health work with its conservation aims. Since then, they have designed the programme around ensuring that people can get access to the land and its natural environment, holistically.\nThe hope is that in the coming years, as the project continues, more people, as well as the land itself, will continue to feel the benefits.\nBored at work?\nAnd finally, the Guardian’s puzzles are here to keep you entertained throughout the day. Until Monday.",
  "word_count": 2777,
  "scraped_at": "2026-02-14T13:44:21.649035"
}