{
  "article_id": "d7814bf94af3",
  "url": "https://www.independent.ie/regionals/wexford/new-ross-news/localnotes/around-the-districts-ballycullane-to-clongeen/a1967858192.html",
  "title": "Around the Districts : Ballycullane to Clongeen",
  "date": "20250423T011500Z",
  "domain": "independent.ie",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Around the Districts: Ballycullane to Clongeen\nBALLYCULLANE\nTintern Review\nPreparation has already begun for the 15th issue of the Tintern Review. The committee would be most grateful for any information which you think would be of interest to the readers. You may have some treasured old or new stories or photos which would appeal to our eager readership.\nThere is just one more request...we need some new volunteers to bring a fresh perspective to The Review! There are only a few meetings each year, so it will not be too time consuming. The following committee members have provided their email addresses for you to make contact: eileenlacey53@gmail.com, paudieforan5@gmail.com and tallaughtfarm@yahoo.com.\nTIntern Lotto\nThere was no jackpot winner in the Tintern Lotto Draw last week when the numbers drawn were 10, 16, 18 and 26. The match three winners were Kellie and Danni Byrne of Boley, Patrick Walsh of Milltown, Kathleen Molloy of Coolroe and James Spillane of Galway. This week’s jackpot stands at €10,400.\nModel County Tickets\nTime is running out to purchase your Club and County Draw ticket. The draw is a huge source of income for the Gusserane club and they are looking for your support once again in the coming weeks. Gusserane have been lucky enough to have had a couple of major prize winners in recent years. Tickets cost €50 and are available through club members.\nThe first prize in the April 30th draw is for a Ford Puma car while first prize in the two May draws is €15,000 each draw. There are thirty prizes each draw with the total prize fund being €100,000.\nPayment this year can easily be made through the club’s Revolut account on 087 1502914.\nBANNOW-BALLYMITTY\nSad passing\nDeepest sympathy to the Cullen family Littlegraigue on the death of Kitty Cullen nee Morgan wife of the late Eamon Cullen.\nEamon and Kitty lived in Littlegraigue for their retirement and Kitty died in Castlebridge nursing home on Thursday April 10th. She was waked in Ryan’s funeral parlour on Sunday 4pm - 8pm with removal to Carrig church on Monday for funeral mass at 11am with burial afterwards in Ballymitty cemetery. May she rest in peace.\nGrantstown 5K Charity Walk\nThe annual 5km walk in aid of Grantstown Daycare Centre will take place Bank Holiday Monday 5thMay. Registration from 10.30am, the walk will start at 11am sharp from Grantstown Church. High Vis Vests must be worn. Tea/Coffee and snacks for everyone on their return. Adults €10/Teens €5/Under 12s free. Please contact us at 051 561016 if you would like to support but cannot attend on the day. All support gratefully appreciated.\nTeach na nOg CLG AGM\nThis year’s Annual General Meeting for Teach na nOg will take place on the 29th April at 7.30 pm at the Teach na nOg building. The AGM will include a report on the finances and main activities of the year. Parents of children in the preschool and parents of children planning to attend the preschool in the following year are encouraged to attend the AGM.\nSocial Dancing\nDancing continues in Carrig Community Centre this Wednesday 23rd April with music by Glen Flynn, Wednesday 30th with Silver Moon Dance Band (its first Wexford gig).\nMeals on Wheels\nWould you like a freshly prepared dinner & dessert delivered to your door? We can deliver 2 meals per person on Tuesday and Thursday every week. Anybody living in the local community that would like to avail of this service please call 051 561016now for more details.\nKiltra School of music\nThe Kiltra School of Music Adult Singers and Youth Choir featuring Kiltra Youth Orchestra presents a wonderful showtime concert of 100 Years of Broadway at the National Opera House, Jerome Hynes Theatre, on Saturday 26th April at 7.30pm and Sunday 27th April at 5pm. Book now at National Opera House Box Office 053 9122144 or nationaloperahouse.ie.\nCarrig Community Centre\nYoga every Monday evening at 7.00pm and Thursday morning at 9.30am and chair yoga at 11am just come along and enjoy, pay as you go.\nBridge is played every Tuesday night.\nSlimming world is every Wednesday 5.30 till 7.30pm.\nBingo every Saturday night from 8pm all welcome.\nBallymitty NS 75th Anniversary\nCalling all past pupils, staff, community members and friends of Ballymitty NS – We are having our 75th School Anniversary celebrations on Saturday 24th May.\nCome along to Ballymitty NS from 3-7pm that day to meet with old friends, walk the corridors and share stories over a cuppa!\nWe are having a mass to celebrate our school at 7.15pm that evening in Ballymitty Church. Finally, you are all welcome to come to Tullycanna Pub for a Grand School Reunion – meet with friends and celebrate the night away! Raffle and refreshments on the night!\nBallymitty hall - dates for diary\nMonday Night Bingo – Ballymitty Drive-in Bingo Monday nights at 8pm, Ballymitty Church Carpark\nCar boot & market – unfortunately Ballymitty Carboot will not be back this year due to low attendance and footfall.\nWomen’s Shed – Ballymitty Hall. Monday mornings from 10am to 12pm. All welcome to come join.\nCAMROSS\nCamross I.C.A.\nThe ICA Has Talent show is being held again this year in Camross Hall on Wednesday, 23rd April. We are currently practicing our acts for the show, as I am sure are most Guilds in the county. This is always a great night of fun, laughter and music, so put it in your diary and come and enjoy the show, and support two charities – South-East Blood Bikes and Cumas, New Ross.\nOn Sunday, 18th May our Ann Power and Margaret O’Gorman Memorial Walk will take place, leaving Camross Hall at 6 o’clock sharp. All proceeds from the Walk will go to local chapter of SVDP.\nNext meeting is on 12th May at 8pm. Remember I.C.A. Has Got Talent is on Wednesday 23rd April in Camross Hall Y35 YY89. Follow our Camross ICA on Facebook for all that’s happening.\nSt. Garvan’s N.S. Caroreigh\nEnrolment is now open for September 2025. For more details contact 053-9134294 or log on to our website at www.stgarvansns.ie\nCamross Hall news\nI.C.A.’s got Talent - Wednesday 23rd April sees the return of the very entertaining I.C.A’s Got Talent at 8pm, more details will follow.\nDancing at Camross - Camross Hall is the place to be on Friday 2nd May, dancing to the one and only Michael Collins Band. Admission is €10 including The Tea. Dancing 9pm till late. Why not get a group together and enjoy a fun night. Or maybe a girl’s night out? A fantastic night is guaranteed. Get on those glad rags, and pop on those dancing shoes.\nCheck out Camross Hall’s Facebook Page for further details on all upcoming events or contact kaynolandoyle@gmail.com\nGolf classic\nTaghmon Camross GAA Ladies Football and Camogie Club will host their 3rd Annual Golf Classic on Friday 23rd May at Rosslare Golf Club. 4 Ball Team Entry €250 Meal included Over €2,000 in Golf Prizes. Morning and Afternoon Tee Times. Enter a team: 087-6796857 GUI and Non-GUI Sections. Sponsored by Finestra Ltd.\nActive Retirement\nTaghmon/Camross Active Retirement Association are organising a trip to the Bloom Festival on Thursday 29th May. Anyone wishing to travel (members or non-members) please contact Secretary: Chris Whitty, Telephone: 086-3623508 as soon as possible.\nBBCT Community Games\nUpcoming events: There’s a 2km cycle on grass for U12 & U14, for both boys and girls. To enter contact Maria on 086 1943483 ASAP.\nThere’s also County Talent coming up on 10th May in Bree which includes: Talent solo U13 & U16, Solo Dance, Solo Music, Solo Recitation & Solo Singing. There’s also a talent group for U13 & U16 which includes: group dance–Irish contemporary, group dance–Modern & Disco, group drama & comedy, group Music and group Singing.\nFor any of the above competitions, all entries are needed by May 1st. For further information or to enter, please contact either: Maria on 086 1943483, Phyllis on 087 9966185 or Anne on 083 3153216.\nCoaches needed - If anyone is available to coach indoor teams, please contact 087 6235905 the closing date is fast approaching.\nCommunity Employment\nANCCR Area Development CLG covers the areas of Adamstown, Newbawn, Carrigbyrne, Clonroche, Camross, Carroreigh, Cushinstown, Terrerath and Raheen.\nWe are recruiting for the following positions on our Community Employment Scheme: Childcare Assistant in ‘A Place to Grow’ based in Raheen/Rathgarogue-full training provided; General Operative/Handyman in Raheen; Caretaker/Groundsperson for Community Hall and Grounds in Camross-This position will be available in August 2025\nCE provides a great opportunity to get back into the workforce, full training is provided. 19.5 hours per week. Contact Ruth on 087 4144313 for further information or to check eligibility.\nTaghmon/Caroreigh & Trinity Parish news\nWeekend Mass Schedule - Saturday: Cleariestown 6pm–Caroreigh 8pm. Sunday: Trinity 9am–Taghmon 10.15am–Rathangan 11.30am\nWeekday Mass Schedule - Tuesday: Cleariestown 9.30am. Wednesday: Caroreigh 9.30am. Thursday: Rathangan 9.30am. Friday: Taghmon 9.30am.\nDates for your Diary - First Holy Communion in Caroreigh: 10th May. First Holy Communion in Taghmon: 24th May. Patron in Kilgarvan: 29th June. Field-Day in Caroreigh: 27th July.\nCheck out our Caroreigh Community Page & Taghmon Rathangan Parish page for all Church Notices.\nHeritage Weekend 2025\nHeritage Weekend 2025 takes place this from 16th-17th August. Preparations are well underway, and busy times are ahead. We would invite you to attend our next meeting on Thursday 8th May in the Scout Hall 8pm to hear your views. All are welcome.\nTaghmon History Society\nMembership - A reminder that membership fees are now due. New members welcome, contact Kay Doyle, 087-2680273/kaynolandoyle@gmail.com\nMeeting - The next meeting of Taghmon History Society will take place in Scout Hall at approx. 9pm on Thursday 8th May. Everyone is welcome and new members to the Society are welcome too.\nPhotos - We are again putting out a call for photos for our 2026 Calendar, all photos will be returned intact. So many old photos are in boxes in attics or suitcases under beds. This is valuable history, and we are compelled to retrieve them. We will be closing for photographs earlier this year as we are producing a new journal also.\nCheckout our Facebook page for any other queries. You can reach us at email: kaynolandoyle@gmail.com\nCharity Motorcycle Run\nThe Gurriers MCC Present a charity Motorcycle Run in aid of The Irish Kidney Association on 13th July. Check in 11am, Start 12noon, Ends 2pm from Taghmon Camross GAA Club. Cost €20 per bike. Visit https://www.idonate.ie/fundraiser/IKACharityMotorcycleRun or thegurriersmcc.ie\nYour Correspondent\nIf you would like a notice included, please email kaynolandoyle@gmail.com\nCLONGEEN\nContacts/Deadlines\nIf anyone has notes to be published, please send the information via email. The normal deadline is 9am on Mondays prior to the Wednesday publication but on a Bank Holiday weekend, the deadline is earlier–it’s midday on the Friday. Either way, the email to use is: grooney@hotmail.com–thanks.\nEaster GAA Camp\nClongeen Coiste Na nÓg are delighted to announce that they will be holding an Easter GAA Camp on Tuesday 22nd & Wednesday 23rd April from 10am until 1pm each day. The camp is aimed at primary school children. Early booking is highly recommended with a charge of €20 per child and €50 per family with more than 2 participants. Refreshments being served each day for those attending. For further information or to make a booking, please send a text or WhatsApp to 087 7645117.\nClongeen GAA News\nClongeen GAA will hold a Golf Classic on Friday 6th June in New Ross Golf Club. The cost of entry is €160 per team and it’s €100 for tee sponsorship. For tee times and tee box sponsorship, please contact Anton Stafford on 086 088 9132, Lorcan Whelan on 086 0605845 or Jamie O’Grady on 086 060 7432. There are great prizes to be won.\nCommunity Employment\nA number of Community Employment positions are available across Clongeen and environs. These are mainly training and development opportunities that are available and for these positions there are various terms and conditions. To apply or if you are looking for further information, can you please contact Máire Jackman on 087 1973537.",
  "word_count": 2011,
  "scraped_at": "2026-02-14T12:11:46.185263"
}