{
  "article_id": "d79814661191",
  "url": "http://www.tnledger.com/Default.aspx?newsDate=8/8/2025",
  "title": "The Nashville Ledger",
  "date": "20250807T061500Z",
  "domain": "tnledger.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Rare breed\nCrowley runs a small-town rescue with big goals\nOver the years, Trisha Crowley has helped get countless dogs from Tennessee to temporary and forever homes up north, as far and farther than her hometown of Buffalo, New York. But taking scruffy 2-year-old terrier mix Caesar up to these particular would-be adopters? That might break a distance record.\nOdds are against Musk’s mole hole ever being built\nThings that seem too good to be true generally prove to be just that. So color me skeptical when it comes to the Great Musk Hole.\nWe’re No. 1, but it’s not a distinction any area wants\n“Once-booming regions” are feeling the brunt of the slowing U.S. housing market, Realtor.com tells us. And which area leads its list of the 10 slowest markets in the United States? That would be Nashville.\n39.9°F\nA Few Clouds\nWind: calm mph\nHumidity: 58%\nEVENTS\nWilliamson BizFest. An annual business expo designed to spotlight the businesses that comprise the Williamson Chamber community. Held at The Factory at Franklin, this three-hour event attracts hundreds of attendees for networking, discovery and local business celebration. Thursday, 4-7 p.m., Liberty Hall at The Factory at Franklin, 230 Franklin Road, Franklin. InformationTop Davidson County residential real estate sales for July 2025\nTop Davidson County residential real estate sales for July 2025, as compiled by the Nashville Ledger.\nAverage rate on a 30-year mortgage drops to lowest level since April\nMCLEAN, Va. (AP) — The average rate on a 30-year U.S. mortgage has fallen to its lowest level in four months, welcome news for prospective homebuyers who have been held back by stubbornly high home financing costs.\nQB Boyle happy with his life in NFL\nRarely a starter, always ready to help a team\nThere were eye rolls and heads scratched when the Titans signed Tim Boyle this spring, making him the fourth quarterback on the 90-man training camp roster. He was released Monday.\nNext two weeks vital in gauging progress of Titans offense\nIf you’re a Tennessee Titans fan, you’ve probably heard about Brian Callahan’s rant at the end of practice Sunday where he, let’s just say, voiced his displeasure with the play of the offense.\nRookies other than Ward looking for early playing time\nBeyond Cam Ward, the Titans also find themselves counting on quite a few other rookies to help reverse the team’s slide during the past three seasons.\nJoint practices give coaches a better way to evaluate starters in more competitive environment\nTAMPA, Fla. (AP) — Baker Mayfield got in the middle of a scuffle and injured All-Pro tackle Tristan Wirfs went onto the field on a crutch to join his teammates.\nAguilar making a good impression with Vol fans, coaches\nGraduate transfer Joey Aguilar immediately noticed how important football is to University of Tennessee fans in Knoxville, especially when it comes to quarterbacks.\n20 from Neal & Harwell moving to Womble\nA group of 20 attorneys, including 15 partners, from the 54-year-old firm Neal & Harwell have moved to Womble Bond Dickinson (US) LLP.\nWeGo expands contactless payment\nIt’s easier than ever to ride WeGo Public Transit. WeGo now accepts contactless payment through credit cards, debit cards and mobile wallets, including Visa, Mastercard, Discover, Apple Pay, Google Pay and Samsung Pay.\nSmall luxury SUV test: Acura ADX vs BMW X1\nThe 2025 Acura ADX is all new this year, and it takes its place as Acura’s smallest and least expensive crossover SUV. If you think Acura’s RDX or MDX are too big or too expensive, the entry-level ADX could very well satisfy.\nAre you at risk of having your wages garnished over student loan debt?\nMillions of student borrowers could begin having their wages garnished as soon as this summer, according to estimates from credit bureau TransUnion.\nEmployers should be transparent with job seekers\nHave you ever been through a job interview that takes months? It feels like you’re going through a full inspection process from head to toe. Then, you may learn the employer was hiding something from you all along.\nFalcons QB Michael Penix Jr. lands at bottom of pile during joint-practice scuffle with Titans\nFLOWERY BRANCH, Ga. (AP) — Atlanta Falcons quarterback Michael Penix Jr. was surprised to find himself in the middle of a scuffle that interrupted his team's second joint practice with the Tennessee Titans on Wednesday.\nAttorney: Lady Vols guard Ruby Whitehorn will plead not guilty at preliminary hearing\nKNOXVILLE (AP) — The attorney for Ruby Whitehorn says the Tennessee guard will plead not guilty when arraigned on felony charges of domestic assault and aggravated burglary.\nTennessee town approves deals to turn closed prison into immigration detention facility\nMASON (AP) — Officials in a rural West Tennessee town voted Tuesday to approve agreements to turn a former prison into an immigration detention facility operated by a private company, despite loud objections from upset residents and activists during a contentious public meeting.\nGE Appliances shifts more production to US as part of a $3 billion investment\nLOUISVILLE, Ky. (AP) — GE Appliances plans to shift production of refrigerators, gas ranges and water heaters out of China and Mexico as part of a more than $3 billion investment to expand its U.S. operations in Kentucky, Georgia, Alabama, Tennessee and South Carolina.\nTrump administration's lawsuit against all of Maryland's federal judges meets skepticism in court\nBALTIMORE (AP) — A judge on Wednesday questioned why it was necessary for the Trump administration to sue Maryland's entire federal bench over an order that paused the immediate deportation of migrants challenging their removals.\nAppeals court lets the White House suspend or end billions in foreign aid\nWASHINGTON (AP) — A divided panel of appeals court judges ruled Wednesday that the Trump administration can suspend or terminate billions of dollars of congressionally appropriated funding for foreign aid.\nCrypto mogul Do Kwon, known as 'the cryptocurrency king,' pleads guilty to fraud charges\nNEW YORK (AP) — South Korean cryptocurrency mogul Do Kwon pleaded guilty on Tuesday to two fraud charges arising from the $40 billion collapse of a cryptocurrency ecosystem that had promised investors their money was safe.\nHarvard and the Trump administration are nearing a settlement including a $500 million payment\nWASHINGTON (AP) — Harvard University and the Trump administration are getting close to an agreement that would require the Ivy League university to pay $500 million to regain access to federal funding and to end investigations, according to a person familiar with the matter.\nHomeowners turn to cash-out refinancing to take advantage of big gains in home equity\nHomeowners are cashing in on years of home equity gains, even as mortgage rates remain elevated.\nWhy many Americans are rethinking alcohol, according to a new Gallup poll\nWASHINGTON (AP) — Fewer Americans are reporting that they drink alcohol amid a growing belief that even moderate alcohol consumption is a health risk, according to a Gallup poll released Wednesday.\nA $200 million endowment focused on Black Americans is taking shape\nStarted in 2020 as a five-year initiative inspired by the racial justice outcry following the police murder of George Floyd, the California Black Freedom Fund plans to expand to a $200 million endowment. The move is both rare in the world of philanthropy and politically bold, given the Trump administration's efforts to eliminate race-based grant making.\n'Alligator Alcatraz' migrant jail could halt construction over environmental concerns\nMIAMI (AP) — Construction of a makeshift immigrant detention center in the Florida Everglades dubbed \" Alligator Alcatraz \" could be halted indefinitely as a federal judge considered Wednesday whether the hasty development on sensitive wetlands violates environmental laws.\nFEMA abruptly disbands youth advisory council, but students say their climate advocacy won't stop\nAfter a few frightening incidents seeing family and friends collapse in Phoenix's grueling heat, Ashton Dolce, 17, began to wonder why his country's leaders were not doing more to keep people safe from climate change.\nNew draft of global plastic pollution treaty wouldn't limit plastic production\nGENEVA (AP) — Negotiators working on a treaty to address global plastic pollution discussed a new draft of the text Wednesday that wouldn't limit plastic production or address chemicals used in plastic products.\nAir Canada to begin cancelling flights ahead of possible strike by flight attendants\nMONTREAL (AP) — Air Canada said Wednesday it will begin a gradual suspension of flights to allow an orderly shutdown of the country's largest airline as it faces a potential work stoppage by its flight attendants on Saturday.\nUS national debt reaches a record $37 trillion, the Treasury Department reports\nWASHINGTON (AP) — The U.S. government's gross national debt has surpassed $37 trillion, a record number that highlights the accelerating debt on America's balance sheet and increased cost pressures on taxpayers.\nVietnam wants to be the next Asian tiger and it's overhauling its economy to make it happen\nHANOI, Vietnam (AP) — Beneath red banners and a gold bust of revolutionary leader Ho Chi Minh in Hanoi's central party school, Communist Party chief To Lam declared the arrival of \"a new era of development\" late last year. The speech was more than symbolic— it signaled the launch of what could be Vietnam's most ambitious economic overhaul in decades.\nAmazon expands its perishable delivery service, putting pressure on traditional grocers\nNEW YORK (AP) — Amazon is now rolling out a service where its Prime members can order their blueberries and milk at the same time as basic items like batteries and T-shirts and get them within hours.\nCanada's Gildan Activewear is buying HanesBrands for $2.2 billion\nGildan Activewear is buying the struggling HanesBrands for $2.2 billion in a deal that gives the basic apparel maker access to household name brands like Hanes and Maidenform.\nMcDonald's Japan's Pokemon card Happy Meals promotion comes to an unhappy end\nTOKYO (AP) — Fast-food chain McDonald's Japan has canceled a Happy Meal campaign that came with coveted Pokemon cards, apologizing after resellers rushed to buy the meals and then discarded the food, leaving trash outside stores.\nFederal agents will be out 24/7 on patrol in Washington, the White House says\nWASHINGTON (AP) — As a wary Washington waited, the White House promised a ramp-up of National Guard troops and federal officers on the streets of the nation's capital around the clock starting Wednesday, days after President Donald Trump's unprecedented announcement that his administration would take over the city's police department for at least a month.\nTrump names Strait, Stallone and Kiss for Kennedy Center Honors, says he'll host the awards show\nWASHINGTON (AP) — As the new chairman of the Kennedy Center, President Donald Trump added a highly personal stamp to this year's announcement of the recipients of the annual honors, whom he named as country music star George Strait, \"Rocky\" actor Sylvester Stallone, singer Gloria Gaynor, the rock band Kiss and actor-singer Michael Crawford.\nTrump's nominee to oversee jobs, inflation data faces shower of criticism\nWASHINGTON (AP) — The director of the agency that produces the nation's jobs and inflation data is typically a mild-mannered technocrat, often with extensive experience in statistical agencies, with little public profile.\n'Crazy!!': How Labor Statistics staff reacted to Trump firing commissioner after dismal jobs report\nWASHINGTON (AP) — \"Depressing.\" \"CRAZY!!\" That's how staff at the Bureau of Labor Statistics reacted after President Donald Trump fired its commissioner, Erika McEntarfer, after a dismal jobs report issued Aug. 1 undermined the White House's claims of an economic boom.\nLeaving a top Trump administration post? The president may have an ambassadorship for you\nWASHINGTON (AP) — Diplomacy may be soft power, but in President Donald Trump's administration, it's also lately a soft landing.\nMexico transfers 26 cartel figures wanted by US authorities in deal with Trump administration\nWASHINGTON (AP) — Mexico sent 26 high-ranking cartel figures to the United States Tuesday in the latest major deal with the Trump administration as American authorities ratchet up pressure on criminal networks smuggling drugs across the border.\nWhite House orders a review of exhibits at Smithsonian museums ahead of nation's 250th birthday\nWASHINGTON (AP) — The White House is ordering a wide-ranging review of the Smithsonian museums and exhibitions ahead of the country's 250th birthday with a goal of aligning the institution's content with President Donald Trump's interpretation of American history.\nRidley's TD catch in return to Atlanta is rare highlight for Titans in joint practice with Falcons\nFLOWERY BRANCH, Ga. (AP) — It didn't take former Atlanta receiver Calvin Ridley very long to make a big play in his return to his former home.\nTitans switch out quarterbacks with Trevor Siemian back and Tim Boyle gone\nThe Tennessee Titans have seen enough of quarterback Tim Boyle to make a change after one preseason game.\nDefense Secretary Hegseth belongs to an archconservative Nashville-area church. Here's what to know\nWASHINGTON (AP) — Defense Secretary Pete Hegseth says he's proud to be part of the Communion of Reformed Evangelical Churches, an archconservative network of Christian congregations.\nBusiness spat between Daryl Hall, John Oates has been resolved in arbitration, attorneys say\nNASHVILLE (AP) — Daryl Hall and John Oates have resolved their dispute over a Hall & Oates business partnership through arbitration, reaching a private ending after details of their rift went public in court documents filed in a 2023 lawsuit by Hall against Oates, according to a court filing Monday.\nNFL appeals Nevada Supreme Court ruling allowing Gruden's lawsuit to proceed\nLAS VEGAS (AP) — The NFL will appeal the Nevada Supreme Court's ruling Monday that former Las Vegas Raiders coach Jon Gruden can proceed with his lawsuit and not go through the league for arbitration.\nEpic Games wins partial victory in Australian court against Google, Apple\nMELBOURNE, Australia (AP) — Epic Games, the company behind the popular online game Fortnite, won a partial victory in an Australian court in U.S. billionaire chief executive Tim Sweeney's claim that Google and Apple engaged in anti-competitive conduct in running their app stores.\nShooter attacked CDC headquarters to protest COVID-19 vaccines\nATLANTA (AP) — The man who fired more than 180 shots with a long gun at the headquarters of the U.S. Centers for Disease Control and Prevention broke into a locked safe to get his father's weapons and wanted to send a message against COVID-19 vaccines, authorities said Tuesday.\nDelivery drones may soon take off in the US. Here's why\nDelivery drones are so fast they can zip a pint of ice cream to a customer's driveway before it melts.\nA UFC fight at the White House? Dana White says it's happening as part of deal with Paramount\nHours after Paramount and UFC announced a billion-dollar rights deal, Dana White said he had yet to hear from his friend, President Donald Trump, on his thoughts about the fight company's new streaming home.\nYouTube to begin testing a new AI-powered age verification system in the U.S.\nYouTube on Wednesday will begin testing a new age-verification system in the U.S. that relies on artificial intelligence to differentiate between adults and minors, based on the kinds of videos that they have been watching.\nIncreasing the danger: Journalist killing in Gaza sends a chilling message\nIsrael's targeted killing of an Al Jazeera correspondent in Gaza over the weekend was noteworthy even for a conflict remarkably blood-soaked for journalists, leaving some experts to marvel that any news at all emerges from the territory.\nUS July budget deficit up 20% year-over-year despite record Trump tariff income\nWASHINGTON (AP) — The U.S. budget deficit in July climbed 20% this fiscal year compared to the last despite the U.S. taking in record income from President Donald Trump's tariffs, according to Treasury Department data released Tuesday.\nUS inflation held steady as mild tariff hit offset by cheaper gas, food\nWASHINGTON (AP) — U.S. inflation was unchanged in July as rising prices for some imported goods were balanced by falling gas and grocery prices, leaving overall prices modestly higher than a year ago.\nAustralia's central bank cuts interest rate for third time this year to 3.6%\nMELBOURNE, Australia (AP) — Australia's central bank on Tuesday reduced its benchmark interest rate by a quarter percentage point for a third time this year to 3.6%, with inflation tamed and economic growth stalling.\nUS and China extend trade truce another 90 days, easing tension between world's largest economies\nWASHINGTON (AP) — President Donald Trump extended a trade truce with China for another 90 days Monday, at least delaying once again a dangerous showdown between the world's two biggest economies.\nUS stocks rally to records on hopes for cuts to interest rates\nNEW YORK (AP) — The U.S. stock market rallied to records on Tuesday after data suggested inflation across the country was a touch better last month than economists expected.\nMexican-American designer apologizes for Adidas sandal design accused of cultural appropriation\nMEXICO CITY (AP) — Mexican-American clothing designer Willy Chavarria has apologized for an Adidas sandal he created after being accused by Mexican authorities of \"cultural appropriation\" for imitating an Indigenous shoe design.\nSpirit Airlines sounds the alarm on its future ability to stay in business\nNEW YORK (AP) — Just months after emerging from Chapter 11 bankruptcy, Spirit Airlines is warning about its future ability to stay in business.\nKodak cautions on business operations but remains confident it can meet debt obligations\nThe more than 130-year-old Eastman Kodak Co. is cautioning on its business operations, but says it is confident it will be able to work out upcoming debt obligations.\nTrump says Intel CEO has an 'amazing story' days after calling for his resignation\nLess than a week after demanding his resignation, President Donald Trump is now calling the career of Intel's CEO an \"amazing story.\"\nSherrod Brown, Ohio's highest-profile Democrat, expected to seek a return to the US Senate in 2026\nCOLUMBUS, Ohio (AP) — Former U.S. Sen. Sherrod Brown, Ohio's best-known Democrat, is expected to make another run for the U.S. Senate next year, giving Democrats a likely boost as they wage an uphill fight to win control of the chamber.\nTrump's takeover of Washington law enforcement begins as National Guard troops arrive\nWASHINGTON (AP) — The new picture of law enforcement in the nation's capital began taking shape Tuesday as some of the 800 National Guard members deployed by the Trump administration began arriving. The city's police and federal officials, projecting cooperation, took the first steps in an uneasy partnership to reduce crime in what President Donald Trump called — without substantiation — a lawless city.\nTrump's rhetoric about DC echoes a history of racist narratives about urban crime\nWASHINGTON (AP) — President Donald Trump has taken control of D.C.'s law enforcement and ordered National Guard troops to deploy onto the streets of the nation's capital, arguing the extraordinary moves are necessary to curb an urgent public safety crisis.\nTrump administration calls out human rights records of some nations accepting deported migrants\nWASHINGTON (AP) — The Trump administration on Tuesday released human rights reports for countries worldwide, which eliminate mentions of discrimination faced by LGBTQ people, reduce a previous focus on reproductive rights and criticize restrictions on political speech by U.S. allies in Europe that American officials believe target right-wing politicians.\nTexas Republicans plan another special session to deliver Trump more GOP congressional seats\nAUSTIN, Texas (AP) — Texas Republican leaders said Tuesday that they were prepared to end their stalemated special session and immediately begin another standoff with Democrats in the GOP's efforts to redraw congressional maps as directed by President Donald Trump.\nTrump nominates conservative economist to head agency that compiles jobs, inflation data\nWASHINGTON (AP) — President Donald Trump said Monday that he has nominated E.J. Antoni, chief economist at the conservative Heritage Foundation, to head the agency that compiles and publishes the nation's employment and inflation figures.\nRepublicans, Democrats alike exhort Trump: Keep security pact with Australia, UK alive\nWASHINGTON (AP) — U.S. lawmakers from both parties are urging the Trump administration to maintain a three-way security partnership designed to supply Australia with nuclear-powered submarines — a plea that comes as the Pentagon reviews the agreement and considers the questions it has raised about the American industrial infrastructure's shipbuilding capabilities.\nTexas is No. 1 in AP preseason Top 25 for first time, Tennessee No. 24\nTexas is No. 1 in the Associated Press preseason Top 25 for the first time. The Longhorns narrowly edged out Penn State in the closest preseason vote since 1998.\nAP Top 25 preseason rankings\nThe AP Top 25 college football poll preseason rankings are now. Texas took the No. 1 spot for the first time in an opening poll, narrowly edging out Penn State by just five points in the closest preseason vote since 1998. Defending champion Ohio State ranked No. 3.\nCam Ward shows why the Titans took him at No. 1 overall in his preseason debut\nThe Tennessee Titans are the first to point out that rookie Cam Ward has room for improvement, even as the No. 1 overall draft pick provided plenty of optimism for the future.\nTranscripts of grand jury that indicted Epstein ex-girlfriend Maxwell won't be unsealed, judge says\nNEW YORK (AP) — Transcripts of the secret grand jury testimony that led to the sex trafficking indictment of Jeffrey Epstein's former girlfriend Ghislaine Maxwell won't be released, a judge ruled Monday in a stinging decision belittling the government's tease of new revelations as \"demonstrably false.\"\nTrump has said abortion is a state issue. His judicial picks could shape it nationally for decades\nCHICAGO (AP) — One called abortion a \"barbaric practice.\" Another referred to himself as a \"zealot\" for the anti-abortion movement. Several have played prominent roles in defending their state's abortion restrictions in court and in cases that have had national impact, including on access to medication abortion.\nWhat to know about how Trump's judicial picks could reshape abortion rights for decades\nCHICAGO (AP) — A review by The Associated Press shows that several of President Donald Trump's nominees to the federal courts have revealed anti-abortion views, been associated with anti-abortion groups or defended abortion restrictions.\nAOL is finally shutting down its dial-up internet service\nNEW YORK (AP) — AOL's dial-up internet is finally taking its last bow.\nOusted FDA vaccine chief Vinay Prasad is returning to the agency\nWASHINGTON (AP) — A Food and Drug Administration official is getting his job back as the agency's top vaccine regulator, less than two weeks after he was pressured to step down at the urging of biotech executives, patient groups and conservative allies of President Donald Trump.\nFord hits the pedal on EV production with $2 billion overhaul of Kentucky plant\nLOUISVILLE, Ky. (AP) — Ford Motor Co. will invest nearly $2 billion retooling a Kentucky factory to produce electric vehicles that it says will be more affordable, more profitable to build and will outcompete rival models.\nParamount will become the new home to all UFC events in the US under 7-year deal with TKO Group\nNEW YORK (AP) — Paramount will become the new home to Ultimate Fighting Championship events across the U.S. next year, through a seven-year agreement announced with TKO Group on Monday.\nTrump's tax law will mostly benefit the rich, while leaving poorer Americans with less, CBO says\nWASHINGTON (AP) — President Donald Trump'stax and spending law will result in less income for the poorest Americans while sending money to the richest, the nonpartisan Congressional Budget Office reported Monday.\nWhitmer told Trump in private that Michigan auto jobs depend on a tariff change of course\nWASHINGTON (AP) — Michigan Gov. Gretchen Whitmer met privately in the Oval Office with President Donald Trump to make a case he did not want to hear: The automotive industry he said he wants to save was being hurt by his tariffs.\nA pause on higher tariffs for China is due to expire Tuesday. Here's what to know\nTAIPEI, Taiwan (AP) — A 90-day pause on imposing higher tariffs on China is due to expire on Tuesday and it is unclear if it will be extended.\nUS will get a 15% cut of Nvidia and AMD chip sales to China under a new, unusual agreement\nNEW YORK (AP) — Nvidia and AMD have agreed to share 15% of their revenues from chip sales to China with the U.S. government, as part of a deal to secure export licenses for the semiconductors.\nTrump says he's placing Washington police under federal control and activating the National Guard\nWASHINGTON (AP) — President Donald Trump said Monday he's taking over Washington's police department and activating 800 members of the National Guard in the hopes of reducing crime, even as city officials stressed crime is already falling in the nation's capital.\nTrump's order to deploy troops in DC is his latest use of the National Guard in cities\nWASHINGTON (AP) — President Donald Trump is bringing in 800 National Guard members to help law enforcement fight crime in Washington, but just 100 to 200 of the troops will be on the city's streets at any given time, the Army said.\nTrump exaggerates, misstates facts on Washington crime\nWASHINGTON (AP) — President Donald Trump said Monday that his administration will take over policing the nation's capital city in what the Republican said is an effort to bring down rising crime rates in Washington, D.C.\nTrump suggests he'll know if Putin wants a peace deal with Ukraine soon into their meeting\nWASHINGTON (AP) — President Donald Trump said Monday that he expected to determine mere moments into his meeting with Russian leader Vladimir Putin this week whether it would be possible to work out a deal to halt the war in Ukraine.\nTrump's big bill is powering his mass deportations. Congress is starting to ask questions\nWASHINGTON (AP) — President Donald Trump's border czar Tom Homan visited Capitol Hill just weeks after Inauguration Day, with other administration officials and a singular message: They needed money for the White House's border security and mass deportation agenda.\nTrump's new congressional map in Texas still stymied as Newsom urges president to give up\nAUSTIN, Texas (AP) — Texas Republicans were unable again Monday to approve new congressional districts to meet President Donald Trump's demands as California Gov. Gavin Newsom and other Democrats urged Republicans to stand down and avoid a partisan brawl spanning multiple statehouses.\nAttorney says heart device did not shock Tennessee man in execution who said he was 'hurting so bad'\nNASHVILLE (AP) — A Tennessee man who said he was \"hurting so bad\" during his lethal injection this week for the 1980s killings of his girlfriend and her two young daughters was not shocked by his implanted defibrillator, his attorney said Friday.\nJustice Department subpoenas New York AG James as it investigates whether she violated Trump rights\nWASHINGTON (AP) — The Justice Department has subpoenaed New York Attorney General Letitia James as part of an investigation into whether she violated President Donald Trump's civil rights, according to people familiar with the matter.\nAppeals court tosses judge's contempt finding against Trump administration in prison deportations\nWASHINGTON (AP) — A split appeals court panel tossed out a judge's contempt finding against President Donald Trump's administration on Friday in a case over deportations to an El Salvador prison.\nNew lawsuit on Epstein case seeks records of Trump administration communications\nWASHINGTON (AP) — A legal organization challenging President Donald Trump's administration on multiple fronts filed a new lawsuit on Friday seeking the release of records detailing the handling of the sex trafficking investigation into Jeffrey Epstein.\nTrump administration asks high court to lift restrictions on Southern California immigration stops\nWASHINGTON (AP) — The Trump administration on Thursday asked the Supreme Court to halt a court order restricting immigration stops that swept up at least two U.S. citizens in Southern California.\nJudge to consider the fate of an agreement on protecting immigrant children in US custody\nMcALLEN, Texas (AP) — A federal judge on Friday will hear a Trump administration request to end a nearly three-decade-old policy on ensuring safe conditions for immigrant children held in federal custody.\nFAFSA application is open for early testing. Here's what to know.\nNEW YORK (AP) — The Free Application for Federal Student Aid for the 2026-27 school year has opened for a limited number of students as part of a beta test, the Department of Education says.\nTrump administration seeks $1 billion settlement from UCLA, a White House official says\nThe Trump administration is seeking a $1 billion settlement from the University of California, Los Angeles, a White House official said Friday.\nCollege endowment tax is leading to hiring freezes and could mean cuts in financial aid\nA big increase in the tax on university endowments is adding to financial uncertainty for the wealthiest colleges in the U.S., leading several already to lay off staff or implement hiring freezes.\nClosure of Midwest-based newspaper chain leaves dozens of communities without a news source\nSIOUX FALLS, S.D. (AP) — Dozens of communities in the Midwest and West learned Thursday they had lost their newspapers after an Illinois-based publisher announced it would abruptly close because of financial problems.\nUS at plastics treaty talks is rare international participation under Trump. What's the goal?\nUnder President Donald Trump's leadership, the United States has withdrawn from international negotiations and commitments, particularly around climate. But the U.S. is very much involved in treaty talks for a global accord to end plastic pollution.\nIntel CEO responds after Trump calls for his resignation\nIntel CEO Lip-Bu Tan says he's \"always operated within the highest legal and ethical standards\" after President Donald Trump said he should resign.\nBoar's Head plans to reopen troubled deli meat plant, but reports of sanitation problems persist\nThe Boar's Head deli meat plant at the heart of last year's deadly food poisoning outbreak is set to reopen in the coming months, company officials said.\nTrump defends the US economy with charts after job reports showed warning signs\nWASHINGTON (AP) — President Donald Trump unexpectedly summoned reporters to the Oval Office on Thursday to present them with charts that he says show the U.S. economy is solid following a jobs report last week that raised red flags and led to the Republican firing the head of the Bureau of Labor Statistics.\nTrump removes IRS commisioner less than 2 months after his confirmation\nWASHINGTON (AP) — President Donald Trump has removed former U.S. Rep. Billy Long as IRS commissioner less than two months after his confirmation, a White House official said Friday.\nUS has 'no plans' to recognize Palestinian state, Vance says before talks with UK foreign secretary\nLONDON (AP) — U.S. Vice President JD Vance met with U.K. Foreign Secretary David Lammy on Friday at a stately home south of London, with the two leaders saying the agenda includes global economics and the Israel-Hamas war and Russia's full-scale invasion of Ukraine.\nCalifornia rushes to plan a still unscheduled election in US House seats standoff with Texas\nLOS ANGELES (AP) — California Democrats' rush to schedule an emergency election to remake U.S. House districts and counter rival moves by Texas Republicans has created a dilemma for county officials who are being urged to plan for an election that hasn't been scheduled and might never happen.\nTrump says he's placing Washington police under federal control and activating the National Guard\nWASHINGTON (AP) — President Donald Trump said Monday he's taking over Washington's police department and activating 800 members of the National Guard in the hopes of reducing crime, even as city officials stressed crime is already falling in the nation's capital.\nJudge orders temporary halt to construction at Florida's 'Alligator Alcatraz' detention center\nMIAMI (AP) — A federal judge on Thursday ordered a temporary halt to construction at an immigration detention center — built in the middle of the Florida Everglades and dubbed \"Alligator Alcatraz\" — as attorneys argue whether it violates environmental laws.\nJudge issues temporary injunction against Trump administration cancellation of humanities grants\nWASHINGTON (AP) — A federal judge in Oregon issued an injunction Wednesday temporarily stopping the mass cancellation of National Endowment for the Humanities grants to humanities councils around the country, saying the cancellations were likely unconstitutional.\nTrump orders federal regulators to probe alleged bank discrimination against conservatives\nNEW YORK (AP) — President Donald Trump on Thursday signed an executive order mandating a probe into whether banks have discriminated against conservatives and certain industries like gun manufacturers and cryptocurrency companies, invoking the vast powers to go after entities that the Republican president alleges have discriminated against him and his allies.\nEPA cancels $7 billion Biden-era grant program to boost solar energy\nWASHINGTON (AP) — The Environmental Protection Agency on Thursday terminated a $7 billion grant program intended to help pay for residential solar projects for more than 900,000 lower-income U.S. households, in the latest Trump administration move hindering the nation's shift to cleaner energy.\nTrump moves to shut down NASA missions that measure carbon dioxide and plant health\nThe Trump administration is moving to shut down two NASA missions that monitor a potent greenhouse gas and plant health, potentially shutting off an important source of data for scientists, policymakers and farmers.\nToyota reports a 37% drop in profit, cuts its forecast due to Trump's tariffs\nTOKYO (AP) — Toyota's profit plunged 37% in the April-June quarter, the company said Thursday, cutting its full year earnings forecasts largely because of President Donald Trump's tariffs.\nUS Air Force to deny retirement pay to transgender service members being separated from the service\nWASHINGTON (AP) — The U.S. Air Force said Thursday it would deny all transgender service members who have served between 15 and 18 years the option to retire early and would instead separate them without retirement benefits.\nRFK Jr.'s vow to overhaul vaccine injury program echoes grievances of anti-vaccine movement\nWASHINGTON (AP) — Health Secretary Robert F. Kennedy Jr. is vowing to \"fix\" the federal program for compensating Americans injured by vaccines, opening the door to sweeping changes for a system long targeted by anti-vaccine activists.\nFDA flags problems with two Boston Scientific heart devices tied to injuries and deaths\nWASHINGTON (AP) — U.S. health regulators are warning doctors and patients about safety issues with two separate Boston Scientific heart devices recently linked to injuries and deaths.\nTrump plans to sign an order requiring colleges to prove they don't consider race in admissions\nWASHINGTON (AP) — President Donald Trump plans to sign an executive order requiring colleges to submit data to prove they do not consider race in admissions, according to a fact sheet shared by the White House ahead of the Thursday signing.\nSchools are using AI surveillance to protect students. It also leads to false alarms — and arrests\nLesley Mathis knows what her daughter said was wrong. But she never expected the 13-year-old girl would get arrested for it.\nWhat to know as Trump's immigration crackdown strips tuition breaks from thousands of students\nAUSTIN, Texas (AP) — Tens of thousands of U.S. college students without legal resident status are losing access to in-state tuition prices as part of President Donald Trump's crackdown on immigration.\nUCLA says Trump administration has suspended $584 million in grants, threatening research\nThe Trump administration has suspended $584 million in federal grants for the University of California, Los Angeles, nearly double the amount that was previously thought, the school's chancellor announced Wednesday.\nWhat you need to know about ESPN's new steaming service, its deals with the NFL, WWE\nESPN's much-discussed streaming service finally has its launch date.\nOpenAI releases GPT-5, a potential barometer for whether artificial intelligence hype is justified\nSAN FRANCISCO (AP) — OpenAI on Thursday released the fifth generation of the artificial intelligence technology that powers ChatGPT, a product update that's being closely watched as a measure of whether generative AI is advancing rapidly or hitting a plateau.\nRoblox rolls out open-source AI system to protect kids from predators in chats\nRoblox, the online gaming platform wildly popular with children and teenagers, is rolling out an open-source version of an artificial intelligence system it says can help preemptively detect predatory language in game chats.\nBill Clinton plans big changes for Clinton Global Initiative annual meeting\nFormer President Bill Clinton plans big changes for this year's Clinton Global Initiative annual meeting \"by necessity\" to address the changing landscape for global development and increasing needs driven by war and climate disasters.\nTrump to nominate top economic aide Stephen Miran to Federal Reserve board\nWASHINGTON (AP) — President Donald Trump said Thursday he will nominate a top economic adviser to the Federal Reserve's board of governors for four months, temporarily filling a vacancy while continuing his search for a longer-term appointment.\nTrump's new tariffs go into effect as US economy shows signs of strain\nWASHINGTON (AP) — President Donald Trump began imposing higher import taxes on dozens of countries Thursday just as the economic fallout of his monthslong tariff threats has begun to cause visible damage to the U.S. economy.\nUS applications for jobless benefits up modestly but remain at a healthy level\nWASHINGTON (AP) — The number of Americans filing for jobless benefits rose modestly last week, a sign that employers still retaining workers despite economic uncertainty related to U.S. trade policy.\nTrump's planned 100% computer chip tariff sparks confusion among businesses, trading partners\nPresident Donald Trump's plans for 100% tariffs on computer chips that aren't made in the U.S. are stoking confusion among businesses and trading partners — boosting stocks for leading semiconductor companies while leaving smaller producers scrambling to understand the implications.\nThe Bank of England cuts its main interest rate to 4%, the lowest level since March 2023\nLONDON (AP) — The Bank of England cut its main interest rate Thursday by a quarter percentage point to 4%, as policy makers seek to bolster the sluggish U.K. economy.\nOntario premier says he doesn't trust Trump and warns the US president could reopen trade pact\nTORONTO (AP) — The leader of Canada's most populous province said Wednesday he doesn't trust U.S. President Donald Trump and expects the president to soon reopen the free trade agreement he agreed to in his first term.\nIntel's stock tumbles after Trump says its CEO must resign\nShares of Intel slumped Thursday after President Donald Trump said in a social media post that the chipmaker's CEO needs to resign.\nTrump opens the door for private equity and crypto as 401(k) retirement plan options\nNEW YORK (AP) — Millions of Americans saving for retirement through 401(k) accounts could have the option of putting their money in higher-risk private equity and cryptocurrency investments, according to an executive order signed Thursday by President Donald Trump that could give those financial players long-sought access to a pool of funds worth trillions.\nOhio river's level raised to accommodate Vice President JD Vance's birthday kayaking trip\nCOLUMBUS, Ohio (AP) — Vice President JD Vance's security detail had an Ohio river's water level raised last week to accommodate a kayaking trip he and his family took to celebrate his 41st birthday.\nFBI forces out more leaders, including ex-director who fought Trump demand for Jan. 6 agents' names\nWASHINGTON (AP) — The FBI is forcing out more senior officials, including a former acting director who resisted Trump administration demands to turn over the names of agents who participated in Jan. 6 Capitol riot investigations and the head of the bureau's Washington field office, according to people familiar with the matter and internal communications seen by The Associated Press.\nTrump seeks to change how census collects data, wants to exclude immigrants in US illegally\nWASHINGTON (AP) — President Donald Trump has instructed the Commerce Department to change the way the U.S. Census Bureau collects data, seeking to exclude immigrants who are in the United States illegally, he said Thursday.\nTrump maintains influence over GOP and keeps potential successors vying for his favor\nWASHINGTON (AP) — Although President Donald Trump has not directly said he thinks JD Vance should be the heir to his \"Make America Great Again\" base of support, he acknowledged this week that his vice president is probably the favorite to succeed him \"at this point.\"\nTrump could meet in person with Putin as soon as next week, White House official says\nWASHINGTON (AP) — President Donald Trump could meet in person with Russian President Vladimir Putin as soon as next week as he seeks to broker an end to the Russia-Ukraine war, a White House official said Wednesday.\nTrump delivers a steady stream of wins for his conservative Christian base\nIn his first half-year in office — amid his tariff campaign, government-slashing moves and immigration crackdown — President Donald Trump has also repeatedly delivered for conservative Christians, who form the bedrock of his Republican support.",
  "word_count": 6770,
  "scraped_at": "2026-02-14T12:43:53.066399"
}