{
  "article_id": "d7c1b012b625",
  "url": "https://dailytimes.com.pk/1373986/fifa-to-launch-historic-womens-series-in-uae/",
  "title": "FIFA to launch historic women series in UAE",
  "date": "20250925T120000Z",
  "domain": "dailytimes.com.pk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "FIFA has announced the launch of its historic FIFA Unites: Women’s Series, which will take place in Dubai, United Arab Emirates, from October 23 to October 29. The tournament will bring together four teams, including the Afghan women’s refugee football team, Chad, Libya, and the United Arab Emirates. This initiative highlights FIFA’s growing efforts to provide women and girls equal opportunities to play football and pursue their sporting dreams.\nRead more : UN experts urge FIFA, UEFA to ban Israel\nThe event is particularly significant as it will mark the first-ever international tournament appearance for the Afghan women’s refugee team. Formed with FIFA’s support, the team represents not just footballing passion but also resilience and the right to play under challenging circumstances. Facing national teams from Chad, Libya, and hosts UAE, the Afghan side will step into a global spotlight for the very first time.\nThe United Arab Emirates team, coached by experienced Dutchwoman Vera Pauw, will be eager to showcase their recent progress on home soil. Meanwhile, Chad and Libya are eyeing their FIFA Women’s World Ranking debuts, underlining their ambition to make their mark on the international stage. The series will be played in a round-robin format, with each team contesting three matches, and the side with the most points declared the winner.\nFIFA President Gianni Infantino praised the tournament’s importance, emphasizing that women’s access to football remains a key priority for the organization. He highlighted that these matches go beyond competition, symbolizing hope, progress, and global unity in sport. Infantino also thanked the United Arab Emirates Football Association for hosting a landmark event that elevates women players to international recognition.\nRead more : FIFA to distribute record $355 million to clubs for 2026 World Cup\nThe matches will be played during the Type II window of FIFA’s Women’s International Match Calendar. This scheduling framework ensures players are available for national duty, offering 12 days to play up to three matches while maintaining a ten-week buffer between major tournaments. These reforms were introduced last year to strengthen international women’s football planning.\nFans worldwide will be able to watch the entire series live on FIFA+, giving global audiences a chance to celebrate this milestone. With new teams making debuts and refugee players breaking barriers, the Women’s Series promises to be an inspiring showcase of resilience, opportunity, and football’s power to unite communities across borders.",
  "word_count": 395,
  "scraped_at": "2026-02-14T12:36:20.173696"
}