{
  "article_id": "d7d9686f3fca",
  "url": "https://www.thehindu.com/data/phase-4-lok-sabha-polling-sunil-chhetri-announces-retirement-mumbai-illegal-hoarding-collapse-and-more-the-week-in-5-charts/article68186249.ece",
  "title": "Phase 4 Lok Sabha polling , Sunil Chhetri announces retirement , Mumbai illegal hoarding collapse , and more | The week in 5 charts",
  "date": "20240519T083000Z",
  "domain": "thehindu.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "(1) Nearly 67% voter turnout in first four phases of Lok Sabha elections\nThe cumulative turnout in the first four phases of the Lok Sabha elections has been recorded at 66.95%, the Election Commission said on May 16, adding 45.10 crore of the nearly 97 crore electors have voted so far in the ongoing electoral exercise.\nIn a statement, the poll panel urged electorate to come out and vote in large numbers in the coming phases.\nAccording to the poll authority, the updated voter turnout in the fourth phase of polling held on May 13 was 69.16%, 3.65 percentage points higher than the corresponding phase in the 2019 parliamentary polls.\nThe updated voter turnout figures for the third phase of polling in the Lok Sabha election stood at 65.68%. In the third phase of the 2019 general election, the turnout was 68.4%. In the second phase of the election held on April 26, the turnout was recorded at 66.71% as against the 69.64% in the second phase of the 2019 polls. In the first phase of the ongoing general elections, a 66.14% turnout was recorded. In the 2019 polls, the turnout in the first phase was 69.43%.\nA total of 379 seats across 23 States and Union Territories have voted in the first four phases of elections.\n(2) The burning hills of Uttarakhand\nFive people were killed in May in forest fires that have been raging in Uttarakhand since last November. The forest department attributes the fires to out-migration, high-tension wires, and the abundance of pine trees, while the State government has said in the Supreme Court that the fires are completely manmade.\nAccording to a 2019 report of the Forest Survey of India, Uttarakhand has a recorded forest area of 38,000 square kilometres, which is 71.05% of its geographical area. Since November 2023, when forest fires began to rage, there have been 1,038 incidents that have gutted 1,385.5 hectares (ha) of forest land till May 10. While authorities have dismissed these as “annual affairs” in the hills, the cost of these fires has been borne by the people whose lives depend on the mountains.\nOn travelling across the State, The Hindu found that that villagers, mostly women, are helping extinguish the flames.\n(3) Indian football legend Sunil Chhetri to retire on June 6\nIndian football icon Sunil Chhetri on Thursday announced his decision to retire from international football after the FIFA World Cup qualifying match against Kuwait in Kolkata on June 6, bringing the curtains down on a glorious two-decade career. The long-serving national team captain announced his decision via a video he posted on his social media accounts.\nIndia are currently second in Group A with four points, behind leaders Qatar. Chhetri had made his 150th appearance for India in March and scored on the occasion against Afghanistan in Guwahati. India, though, lost that game 1-2.\nChhetri, who made his debut in 2005, has scored 94 goals for the country. He will leave the scene as India’s all-time top scorer and most-capped player. He is also third in the list of goal scorers among active players behind Cristiano Ronaldo and Lionel Messi.\n“When people think about me, I should be remembered as a hard-working person. I could play 150 matches because of it. A lot of attributes are required for a player to do well, but this is one characteristic that I want to leave behind me,” Chhetri said during a media interaction on May 17.\n(4) Hoarding collapses in Mumbai storm, killing 14\nAn illegal advertisement hoarding collapsed during a storm and fell on a petrol pump, killing 16 and injuring at least 75 in Chheda Nagar, Mumbai on Monday. The 250-tonne, 120x120 feet hoarding was larger than the permitted size of 40x40 feet. In fact, it was certified as the largest hoarding in India by the Limca Book of Records.\nAccording to the Brihanmumbai Municipal Corporation (BMC), the hoarding stood on a piece of land in possession of the Government Railway Police (GRP). The police probe has pointed out that Ego Media Private Limited, the agency which put up the hoarding, failed to meet the standards set for soil checks and structural audits of the structure’s pillars.\nA complaint was registered against the hoarding’s owner Bhavesh Bhide for culpable homicide not amounting to murder. The city corporation is in the process of removing three other billboards near the petrol pump erected by the same agency.\nThe BMC had issued three notices to the agency over the past year, but no action was taken against it. A notice was issued in March 2023 over a lapse in paying a licence fee of ₹6.14 crore. A second notice was sent on May 2 this year, mentioning that the complaint was filed against the advertiser regarding cutting down of trees or poisoning them to prevent obstructions in front of the hoarding. Both notices did not speak of legality or structural violations and no action was taken.\nThe third notice was issued on May 13, hours before the hoarding collapsed. The notice stated, “The illegal advertisement panels were erected without acquiring any permission from us [BMC] and this is a violation under Section 388 of the Mumbai Municipal Corporation.”\n(5) U.N. revises India’s 2024 economic growth projection to nearly 7%\nThe United Nations has forecast India’s growth projections for 2024 to close to 7%, with the country’s economic expansion mainly driven by strong public investment and resilient private consumption.\nThe 6.9% economic growth projections for India in the mid-year update is an upward revision from the 6.2% GDP forecast made by the U.N. in January this year. The projection in January for India’s GDP growth for 2025 remains unchanged at 6.6% in the latest assessment of the economic situation.\nThe World Economic Situation and Prospects as of mid-2024, released on May 16, said, “India’s economy is forecast to expand by 6.9% in 2024 and 6.6% in 2025, mainly driven by strong public investment and resilient private consumption. Although subdued external demand will continue to weigh on merchandise export growth, pharmaceuticals and chemicals exports are expected to expand strongly.”\nSouth Asia’s economic outlook is expected to remain strong, supported by a robust performance of India’s economy and a slight recovery in Pakistan and Sri Lanka.\nPublished - May 19, 2024 01:31 pm IST",
  "word_count": 1052,
  "scraped_at": "2026-02-14T12:08:44.212488"
}