{
  "article_id": "d7eb9e11b09f",
  "url": "https://www.news4jax.com/news/2025/10/03/the-latest-sean-diddy-combs-to-appear-in-court-for-sentencing/",
  "title": "The Latest : Sean  Diddy  Combs to appear in court for sentencing",
  "date": "20251003T153000Z",
  "domain": "news4jax.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "NEW YORK – Sean ‘Diddy’ Combs was sentenced Friday to 4 years and 2 months in prison in case involving sex workers, violence and “freak-offs.”\nU.S. District Judge Arun Subramanian said a lengthy sentence was needed for deterrence and that he was unconvinced that if Combs is released these crimes won’t happen again. Since Combs has served a year in prison already, the sentence means he would be released in about three years.\nRecommended Videos\nThe 55-year-old hip-hop mogul was convicted in July of flying people across state lines for drug-fueled marathon sexual encounters that were deemed violations of the the Mann Act. Jurors acquitted him of racketeering conspiracy and sex trafficking charges that could have carried a life sentence.\nThe Latest:\nCassie’s lawyer praises her courage\n“While nothing can undo the trauma caused by Combs, the sentence imposed today recognizes the impact of the serious offenses he committed,” attorney Douglas Wigdor said in a statement. “We are confident that with the support of her family and friends, Ms. Ventura will continue healing knowing that her bravery and fortitude have been an inspiration to so many.”\n___\nThis item has been corrected to include Wigdor’s statement issued Friday on the sentencing. The Associated Press previously erroneously published text from a statement Wigdor released after Combs was convicted in July, which was mistakenly sent to AP immediately after the sentencing.\nCombs also faces a fine and conditions after his prison time\nThe judge imposed a $500,000 fine and ordered five years of supervised release after he leaves prison.\nCombs can appeal his convictions, of course, and his lawyers have said they will. They have 14 days to file notice.\nCombs seems dejected by his sentence and apologizes again to his family\nCombs showed no visible change of emotion as he learned his sentence, sitting in his chair and looking straight ahead as the judge spoke. He remained subdued afterward and appeared dejected, with none of the enthusiasm and smiles that accompanied his interactions with lawyers and his family earlier in the day.\nHe also appeared somewhat worn out from a long day of sentencing arguments that seemed to drain him as time passed.\nThroughout his trial and earlier in the day, he gave numerous gestures of encouragement to his family, including pats to his heart, a blown kiss to his mother and a thumbs up. But after he learned of the yearslong sentence, he turned to his mother and children among spectators and let out a sigh before telling them: “I’m sorry. I’m sorry.”\nThe court is adjourned after a final admonition from the judge\n“We all have voices, but you have a megaphone,” the judge told Combs, saying he has a chance to show the world what “real accountability” and change can be.\n“I’m counting on you to make the most of your second chance,” the judge said.\nCombs stood, adjusted his sweater, turned briefly to the gallery, then sat back down at the defense table.\nJudge praises the ‘brave survivors’ who came forward\nSubramanian said they shared “horrific stories, but stories of courage.”\n“We heard you,” he added.\nHe singled out Cassie and “Jane,” and the other women who testified.\n“I am proud of you for coming to the court to tell the world what really happened,” he said.\nJudge tells Combs to expect ‘hard time’\n“This is hard time in prison, away from your family, friends and community, but you will have a life afterward,” the judge told Combs.\nSince Combs has served a year in prison already, this sentence means he would be released in about three years.\nThis wasn’t just a rock ’n’ roll lifestyle, judge says\nDuring sentencing, U.S. District Judge Arun Subramanian rejected the defense’s argument that this was the byproduct of consensual sexual conduct and a celebrity musician’s lifestyle.\n“You had the power and the resources to keep it going, and because you weren’t caught. You paid for and organized these acts. You were no John. You were responsible for that, even if your currency was sexual desires and not money.”\nSubramanian is excoriating Combs for his persistent violence, focusing part of his remarks on his assault on “Jane” just last year, which was after Combs knew he was under federal investigation.\nGood works don’t wash away crimes, judge says\n“I’ve considered the fact that you are a self-made artist and businessman who has innovated, inspired and lifted up communities, including communities of color, worldwide,” the judge said.\nSubramanian also said he appreciates the discussion of the impact of a sentence on Combs' family. He said he also appreciates that addiction “may have exacerbated your violent and erratic behavior over the years.”\nAll this said, “a history of good works can’t wash away the record of this case,” the judge said.\nThe evidence shows he abused and controlled women in his life, he said. “The evidence of abuse with respect to freak-offs and hotel nights is massive,” the judge said.\nCombs sentenced to 4 years and 2 months in prison\nFollowing his time in prison, the judge sentenced combs to another five years of supervised release.\nThe judge said a lengthy sentence was needed for deterrence and that he was unconvinced that if Combs is released these crimes won’t happen again.\nCombs, 55, was convicted in July of flying people across state lines for drug-fueled marathon sexual encounters. Jurors acquitted him of racketeering conspiracy and sex trafficking charges that could have carried a life sentence.\nCombs says his speaking engagements aren’t a scheme\nCombs says his desire to tell his story and change others’ lives is not an effort to reduce his sentence.\n“This story is real. This story is tragic,\" he said. “I don’t have nothing else.”\nHe thanked the jury, and thanked the judge for giving him the confidence to believe in the jury, so that he didn’t have to testify. He thanked the jurors for acquitting him on two charges that carry potential life sentences. As for the other charges, he told the judge, “I don’t take lightly my Mann Act convictions.”\n\"If you give me another chance, I won’t let you down,\" he said. \"And the evidence of that is those beautiful children that got up there and spoke for me.”\nHe then turned to his children, said he loves them, and told the judge he would never again jeopardize his chance to be with them.\n‘I can’t change the past, but I can change the future,' Combs says to judge\n“I ask your honor for mercy,\" he continued. \"I beg your honor for mercy. I ask your honor for a chance to be a father again, a son again, a leader in my community again — for a chance to get the help that I desperately need to be a better person because I don’t want to let God down, I don’t want to let my family down.”\nCombs then said he’s willing to comply with any conditions the judge imposes when he’s released.\n“I have nobody to blame but myself. I know I’ll never put my hands on another person again. I know that I have learned my lesson,” he said. “And I take full accountability and responsibility.”\nCombs said he let Black people down\nGoing through all the people he said he failed, Combs touched on the disappointment his behavior has brought to Black people, a community he had sought to uplift.\n“That was my mission. I got lost. I’m not this bad person. I’m sorry to my community for letting you all down.”\nHe said to the judge, \"if given a chance, people can change. I know I’ve changed.”\nCombs apologizes to his children, too\nAnd his voice broke as he apologized to his mother.\nHe began to cry as he told her: “I failed you as a son. You taught me better. You raised me better.”\nCombs says, ‘I hate myself right now’\nHe says he lost his businesses, his career, his reputation, “but most of all, I lost my self-respect.”\n\"I’ve been stripped down to nothing.”\nCombs says he should have known better\nHe says domestic violence is a burden he will have to carry for the rest of his life.\nHe blames his drug use, in part, for his behavior. He says he was raised to know better, taught to know better by his mother and his faith.\nCombs offers multiple apologies\n1. to Cassie, for any physical or emotional harm he caused her — “I don’t take that lightly,” he said.\n2. to Cassie’s family and to ‘Jane’: “I didn’t mean to hurt you. I’m sorry I brought you into my mess.”\n3. to all victims of domestic violence, saying he knows that the “disgusting, despicable video” of him beating Cassie was triggering for people around the world.\nCombs apologizes to judge for his ‘disgusting, shameful’ behavior\nSpeaking at his sentencing hearing, Combs apologized and called his past behavior “disgusting, shameful” and “sick.”\nThe hip-hop mogul told the judge Friday that his domestic violence is a burden that he will have to carry for the rest of his life.\nCombs addresses the sentencing judge\nCombs let out a deep breath and then began speaking, starting by thanking the judge.\n“I want to thank you for finally giving me a chance to speak up for myself. One of the hardest things I’ve had to handle is to be quiet, not able to express how sorry I am for my actions.”\nPrivate school founder wants Combs to talk to her students\nA founder of a private school where Combs is scheduled to speak if he’s released believes “everybody deserves a second chance.”\nThea White is one of the founders of the Sprouting to Success School in Miami Gardens, Florida. White told The Associated Press that Combs will address kids in the K-12 school on Oct. 14 if the judge lets him out of jail.\n“I believe that life isn’t just about never making mistakes — it’s more about what we do after we make those mistakes,” White said.\nShe declined to say how the speaking engagement came together.\nProsecutor wrapped up by repeating the words of a key witness\nThe prosecutor hit back at the Combs team’s portrayal of him as a man devoted to helping others and improving their lives.\nShe, by contrast, cited “the words of one person whose life the defendant has changed” -- Cassie.\nSlavik read from a letter that the R&B singer submitted to the judge, saying that she still has regular flashbacks and nightmares about Combs’ abuse: “My experience was real, horrific, and deserves to be considered,” Cassie wrote.\nIt’s not just the media in the court’s overflow rooms\nSome Combs fans have come to the courthouse for the sentencing, where they have been watching the proceedings on closed-circuit monitors in overflow rooms.\n“I’m here to see how the justice system plays out, to compare what others of his caliber and color have faced with the sentence Sean Combs will receive today,” said Desiree Monroe, who came from Pennsylvania.\nCombs himself will address the judge after a short break\nProsecutor suggests Combs’ image isn’t accurate\nAfter the defense lawyers and witnesses had their say, prosecutor Christy Slavik is getting a chance to rebut their presentation.\nShe’s telling the judge that Combs “is a master puppeteer of his own image. … but that image is incomplete, and it’s misleading.”\nSlavik contrasted the highly produced 11-minute biographical defense video played in court on Friday when the gritty, raw security camera footage that showed him kicking, beating and dragging his former longtime girlfriend, Cassie, at a Los Angeles hotel in 2016.\nThat video, she said, “shows the defendant for who he is when he doesn’t know the camera is rolling.”\nDefense says Combs suffers from PTSD\nAgnifilo says that multiple doctors diagnosed the hip hop mogul with post-traumatic stress disorder. He said they made such findings in 2014, 2017 and 2020.\nThe attorney says it’s unclear what initial trauma triggered the problem, though he noted his father’s death when he was a toddler.\nAgnifilo acknowledged that “we’re asking for a lot” by seeking Combs’ immediate release. But, he argues, the “I’ll Be Missing You” singer has been uniquely punished — not only with a year in jail, but with the public spectacle of raids on his home, a flurry of civil lawsuits and the destruction of his businesses.\nNonprofit’s director explains why he’s planning a Combs speaking tour\nThe executive director of the organization sponsoring Combs’ planned talks spoke briefly in court about the benefits he sees in having the music, fashion and business mogul speak to people who’ve also been involved in the criminal justice system.\n“When an individual has the willingness to create his own life skills and entrepreneurship program, despite his legal challenges, that demonstrates reform and rehabilitation,” said Giovanni Sairras, of Re-Entry One Inc.\nCombs is slated to give seven talks this month in the Miami area, provided he’s released from federal custody, beginning on Monday at a work release center. A prosecutor blasted Combs for scheduling the talks when he’s facing a potential yearslong sentence, calling it “the height of hubris.”\nSairras said he was impressed by letters shared with him expressing how Combs had a positive impact on the fellow inmates he taught in Jail.\nDefense says the rap impresario could be a teacher if freed\nAfter a prosecutor criticized Combs’ plans for “teaching engagements” in Florida as soon as next week, defense lawyer Xavier Donaldson told the judge that the proposed community events were meant to show what the former rap impresario would be doing “if the court let Mr. Combs out.”\nThey’re not meant as money-making ventures, but rather as “purposeful,” “intentional” activities that would show he would be “in a structured environment,” Donaldson added.\nIn a Sept. 29 letter to the court, a Combs’ supporter at a Miami-based nonprofit that helps prisoners readjust to freedom said he had scheduled Combs to speak at “teaching engagements” at a prison and various other facilities in South Florida this month, starting Monday.\nDefense says Combs wasn't a pimp\nDefense lawyer Xavier Donaldson took issue with the prosecution’s contention that Combs acted like a pimp as he engaged in prostitution-related crimes.\nUnlike pimps, Combs didn’t recruit women to engage in paid sex work, nor did he make any money off of their work, the lawyer said.\nFlorida chaplain offers to personally guide Combs’ rehabilitation\nRev. Gary Johnson, a Florida preacher, encouraged the judge to release Combs to probation, saying it pains him to see the one-time rap star locked up.\nJohnson, a chaplain for the Miami Beach Police Department, said he would personally guarantee that Combs continues his rehabilitation post-incarceration.\n“If you free him,” Johnson told the judge, “we’ll help free his mind.”\nDefense portrays Combs as a civil rights leader\nSteel urged the judge to only consider the conduct for which Combs was convicted, reiterating that the mogul was acquitted of the most serious charges, sex trafficking and racketeering conspiracy.\n“Sean Combs is a leader. He is a civil rights leader. His good outweighs his bad, by far,” Steel said.\nThe judge said earlier Friday that he will weigh all relevant conduct — including Combs’ violence — as he decides on a sentence. He left in place an “enhancement” for coercion, citing Combs’ threats to his longtime former girlfriend Cassie to publicly release videos of their so-called “freak-offs.”\nCombs can use his fame for good if freed, defense says\nCombs’ celebrity could be used to spread an anti-drug, anti-crime message if he’s freed. “He can be a spokesperson,” Steel said.\nHe said another attorney would address plans for upcoming events apparently featuring Combs in Florida, according to a letter sent to the court by a Miami-based nonprofit that helps prisoners readjust to freedom.\nThe letter lists a series of “teaching engagements” at a prison and various other facilities in South Florida, starting Monday.\nProsecutor Christy Slavik said Friday morning that planning for Combs to walk free by then is “the height of hubris.”\nLawyer says Combs is haunted by his own violence\nSteel urged Subramanian to see the case through the prism of the “untreated trauma” and “ferocious drug addiction” that he says contributed to the hip-hop mogul’s misconduct. He noted that Combs was three years old when his father was murdered, leaving his mother, Janice, to raise him by herself.\nSteel also noted that Combs’ best friend, Christopher Wallace — the rapper known as Biggie Smalls and the Notorious B.I.G. — was murdered in 1997. And then he got hooked on on painkillers following a medical procedure in 2000, and his addiction “got out of hand,” even causing him to “flat line” at times. He was high “every single day,” Steel said.\nSteel called Combs a “moral man,” a “strong man,” “a family man,” and the “hardest working person that I have ever known.”\n“He was medicating because his body was hurt and his emotions were hurt. But he never stopped working. And all of that, the drug addiction and the trauma — untreated, your honor — caused him to hit, on occasion... the woman he loved.”\nSteel said Combs remains haunted by his violent outbursts, remembering “every strike” he’s inflicted.\nCombs had emotional reactions as his children spoke\nHe stood just feet away from them as they approached the lectern. Then he sat back down, watching them intently. At times, he cast his head down and shook it. And when he seemed particularly upset, he dropped his head down and ran his hands through his hair.\nImmediately after the children finished speaking, the defense showed the video, including clips of Combs with his children or trying to inspire others, particularly children, in public settings. Several minutes in, Combs put a hand over half his face and began crying, his shoulders at times heaving. Then he wiped his eyes with one hand before taking a tissue and doing the same.\nPart of the video showed him running competitively, including finishing a New York Road Runners race. In one clip, he wore a t-shirt that said: “I am the American dream.”\nLater Friday, the defense cited his children's emotional pleas, saying he needs to be free for his family’s sake.\n“He grew up without a father, his mother working all the time, and he swore that he would be there for his children,” Brian Steel said. “That’s what Sean is fighting for.”\nThe defense presentation has been atypical, reflecting a unique client\nCombs is a wealthy celebrity with a robust legal team. And as a music producer, TV executive and fashion force, he’s well-versed in making and shaping an image — evident in the production values of the video they played for the judge. The 11-minute video includes highlights from his home videos, business exploits and more. It showcases him as a parent, businessman and a philanthropist.\nHis lawyers contrasted his case with what they say are other prostitution-related cases involving far more heinous conduct. And Westmoreland delivered an emotional soliloquy that accentuated his impact on the Black community and fellow inmates, and his desire to effect positive change once he’s out from behind bars.\nThree more defense lawyers and Combs himself are expected to speak after 2 p.m., when they return from lunch.\nJudge thanks Combs’ children for speaking\nSix of Combs’ seven children spoke. His youngest daughter, Love, is just two years old. The judge thanked them afterward, saying he appreciated that doing so was difficult but it was important for the court to hear.\nHis daughters Chance and D’Lila Combs cried as they read prepared remarks. D’Lila saying she fears losing their father to prison and effectively being parentless after the 2018 death of her mother, Kim Porter.\n“We are tired of being strong. We have already lost so much. We have lost our mother, we have lost time with our father, and every day he remains incarcerated, we lose more and more. Please, your honor, please,” D’Lila Combs said, crying, “give our family the chance to heal together, to rebuild, to change, to move forward, not as a headline, but as human beings. We’re trying to do better.”\nChance Combs said: “Instead of making excuses, my father now works on ways to improve.”\nSon Christian Combs said the impresario has become “more patient, more relaxed, more trusting, more understanding and just a better man” while in jail.\n“Please give my family grace. Please let my father out,” Christian Combs said. “Please give him mercy.”\nSome of Combs’ children are addressing the court\nThey’re crowding around the podium, imploring the judge to give their father a second chance.\nHis eldest son, Quincy Brown, says his father “has learned a lesson.” The family has seen him evolve, Brown says, and “he is completely transformed.”\n“My father is my superhero. Seeing him broken down and stripped of everything is something I will never forget,” said another son, Justin Combs.\nHe suggested that as tough as the ordeal has been, it probably saved his father’s life because, during his year in jail, he has kicked drugs and alcohol.\nDiddy taught a class in jail on business skills, defense says\nCombs’ reputation as a successful businessman followed him inside the Brooklyn federal jail where he’s been held since his arrest last year.\nWith other inmates at the Metropolitan Detention Center asking him for advice on a daily basis, Combs agreed to teach a six-week class dubbed “Free Game with Diddy,” Westmoreland said.\nBefore the class, Combs made a deal with his fellow inmates, the lawyer said: If he was going to teach them, they would have to stay peaceful and let everyone on the unit who wanted to participate do so — even if they had differences.\n“Your honor, this is change. This is inspiration. This had not happened at the MDC, ever,” Westmoreland said.\n“Mr. Combs can reach so many more on the outside than he can on the inside,” she concluded. “It is of no benefit to anyone to warehouse him in a prison.”\nDefense lawyer says Combs changed her life\nWestmoreland grew emotional as she recounted Combs’ accomplishments as a Black entrepreneur, explaining that he was an inspiration to her.\nShe said that as she was trying to make her way as an attorney about eight years ago, she attended an event where he spoke and encouraged the audience not to be afraid to dream — but to follow up with action and help others.\n“That changed my life,” she said, with a sniffle.\n“Mr. Combs is not larger than life. He’s a human being. And he’s made some mistakes. He has flaws, like we all do,” Westmoreland said. “But judge, how many of us can say that we helped so many lives, countless lives?”\nCombs’ lawyer says he’s been an inspiration for Black people\nDefense attorney Nicole Westmoreland is discussing Combs’ life and career as a hip-hop artist and businessman who owned his own record company and fashion label. Some of his achievements, she said, were milestones for the Black community and helped inspire others to follow their own dreams.\nWestmoreland choked up as she talked about Combs’ Revolt TV network, which offered a mix of programming focused on hip-hop culture, R&B music, social justice and documentaries.\n▶ Read the AP’s timeline of Combs’ life and career\nCombs’ lawyers say Mann Act shouldn't apply to his sexual encounters\nAttorney Jason Driscoll started by recapping the defense’s argument that the Mann Act, which Combs was convicted of violating, should never have been applied to him. The 115-year-old federal law prohibits taking someone across state lines for criminal sexual activity.\nDriscoll argued that Mann Act prosecutions generally have targeted people accused of making money off their conduct. He asserted that Combs “did not make a single cent” from what he was convicted of doing.\nProsecution is done arguing, pending a rebuttal\nSlavik urged the judge to take an opportunity with his sentence to send a message to victims, the public and would-be perpetrators that Combs’ crimes were serious and are being punished accordingly.\nA lenient sentence might encourage more people to commit such crimes, knowing they won’t face much consequence, she argued.\nA lengthy sentence, she said, would potentially deter such behavior. She again urged the judge to sentence Combs to at least 11 years and 3 months behind bars.\nAnother few words, about ‘Jane’\nBesides pointing to Combs’ conduct toward Cassie, prosecutors emphasized testimony from another of his ex-girlfriends, who testified under the pseudonym “Jane.”\nThe former model dated Combs from 2021 until his September 2024 arrest. At his trial, she said he repeatedly pressured her into having sex with other men against her will, and that one night in June 2024, he put her in a chokehold, punched her in the face and forced her into an encounter with a sex worker.\nCombs already knew by then that he was under investigation, Slavik noted in her sentencing argument. She suggested the episode showed that when challenged, “he reacts unpredictably and abusively.”\nProsecutor argues that Combs has not owned up to his crimes\nSlavik slammed Combs’ letter Thursday night to the judge seeking leniency, saying that he portrayed himself as the victim of his own bad behavior.\n“Even in his submission last night, his remorse was qualified,” the prosecutor said.\nIn the letter, Combs wrote: “My domestic violence will always be a heavy burden that I will have to forever carry.”\nBy framing it that way, Slavik said, it’s “like he’s the victim in this scenario.”\n“This is not a person who has accepted responsibility,” Slavik said.\nIs Combs really a changed man?\nSlavik suggests that there are reasons to be skeptical about that claim, but that in in any event, “his victims don’t have the luxury of moving on so easily. They’re still picking up the pieces.”\n“The violence in this case was uncontested,” Slavik said, pointing to the defense’s trial admission that he sometimes used physical force. “The conduct here very clearly involved violence.”\nJurors repeatedly saw security camera footage of Combs kicking, beating and dragging his then-girlfriend Cassie at a Los Angeles hotel in 2016. That assault, in a public hallway, “was just one of many violent outbursts,” the prosecutor said.\n“Imagine how much worse it was behind closed doors,” Slavik said.\nAdmitting to violence as part of a defense strategy is not accountability, she said — a substantial prison sentence is.\nProsecutors blast Combs for apparently booking a speaking gig next week\nIn a Sept. 29 letter to the court, one of Combs’ supporters, a Miami-based nonprofit that helps prisoners readjust to freedom, said he had scheduled “teaching engagements” at a prison and various other facilities in South Florida this month, starting Monday.\nThe letter evidently anticipated he’d be free to lead these entrepreneurship and life skills programs, describing the work as “following his release.”\n“That is the height of hubris,” Slavik said. Defense lawyers haven’t yet had their chance to respond\nMore on the witnesses whose testimony the judge can consider\nSean “Diddy” Combs’ sex crimes trial involved testimony from 34 witnesses.\nThey included Combs’ ex-girlfriends Cassie and Jane, who said he forced them into drug-fueled sex marathons, a sex worker they knew as “The Punisher,” personal assistants who said they witnessed violence, and other women who accused him of abuse. The judge can consider all trial testimony as he decides the sentence.\n▶Read more about some of the key witnesses and their testimony.\nProsecutors begin their argument for more than 11 years in prison\n“Today is about accountability and justice. Accountability for the defendant, who committed serious federal crimes repeatedly over the course of 15 years, and justice for the public, including for the victims, whose lives have been shattered,” prosecutor Christy Slavik said.\n“It’s a case about a man who did horrible things to real people to satisfy his own sexual gratification,” she added. “He didn’t need the money. His currency was control.”\nSlavik said the prosecution’s recommended 11-year, 3-month sentence “reflects the conduct appropriately, is consistent with other similarly situated defendants and fully respects the jury’s verdict.”\nNot sentencing him to significant prison time would, in effect, be allowing him to get away with years of domestic violence, Slavik said.\nJudge provides a glimpse of his thinking\nThe judge’s actual sentencing decision is many hours away. But in the course of legal arguments, the judge gave a glimpse of his view of Combs’ stance toward the case.\n“In general, the narrative that he and his attorneys have put forth — that this case involves nothing more than adults paying for time, not sex — is flatly inconsistent with both reality” and an acceptance of responsibility, the judge said.\nIn this first phase of the sentencing, the judge is going through complex legal reasoning in response to objections that both sides have raised to the pre-sentencing report. It’s very common for lawyers to raise such objections.\nDefense objected to ‘Mia’ speaking, saying she lied\nA former personal assistant testifying under the pseudonym “Mia” said Combs put his hand up her dress and forcibly kissed her at his 40th birthday party in 2009, forced her to perform oral sex on another occasion and raped her in 2010.\nHis lawyers say the claims are false.\nIn a letter objecting to “Mia” speaking at sentencing, Combs’ lawyers said: “Virtually everything that came out of her mouth was a lie” and that “she is not a victim of anything.”\n“She got to lie, she got to testify with a false identity, she got to try out her fake voice for a jury of savvy New Yorkers. But, she also saw the consequences of lying to a jury: they don’t believe you,” Combs’ lawyers wrote.\nWitness who testified Combs raped her won’t speak\nA former personal assistant who testified at Combs’ trial that he raped her in 2010 is no longer planning to speak at his sentencing.\nThe woman who testified under the pseudonym “Mia” had already submitted a victim witness statement urging the judge to hold Combs “fully accountable.”\n“This letter has been excruciating to write,” her statement said. She wrote that the little girl she once was “is gone. She was buried alive by an abuser, trapped in a world of terror, abuse, humiliation, and coercive control.”\nAssistant U.S. Attorney Christy Slavik said Mia changed her mind about speaking in court after Combs’ lawyers submitted a letter objecting to Mia’s appearance.\nThe letter, the prosecutor said, “can only be described as bullying.”\nThe judge agreed, concluding that “the tone of the defense’s letter was inappropriate” and advising Combs’ lawyers not to do it again.\nJudge Arun Subramanian has taken the bench\nCombs smiled briefly and waved to his family in the gallery before sitting down, putting on a pair of glasses and reading through papers from a large accordion-style folder.\n“Good morning and good morning to you, Mr. Combs,” the judge said.\n“Good morning, your honor,” Combs replied.\nThe hip-hop mogul entered the packed courtroom through a side door, escorted by deputy U.S. marshals, after being transported from the Metropolitan Detention Center, the Brooklyn federal jail where he’s been held since his arrest in September 2024.\nGiven permission by the judge to don non-jail clothes, Combs arrived wearing a light-colored sweater over a button-down shirt and dark-colored dress pants. He hugged his lawyers and greeted his family and supporters as he walked to the defense table. As at his trial, Combs’ hair is grayer and whiter than the black mane he’s known for. That’s because he’s not allowed hair dye in jail.\n‘The Punisher’ thinks Combs has been punished enough already\nAn exotic dancer who testified at the trial joined the crowd outside the courthouse, promoting a self-help book that he wrote.\nSharay Hayes went by the stage name “The Punisher.” At the trial he testified about being paid to have sex with Combs’ girlfriend Cassie Ventura.\n“It’s been a crazy couple of months for me,” he said.\nHayes said he believes that the judge should sentence Combs to the time he’s already served in jail.\nCassie has asked for a tougher sentence. She told the court she was manipulated into participating in sexual encounters with other men, and that Combs frequently beat her.\nA key voice for the prosecution has been silenced\nThe most outspoken and prominent voice among six prosecutors at Combs’ trial won’t be heard at his sentencing. Maurene Comey was fired from her position as an assistant U.S. attorney in Manhattan two weeks after the jury returned its verdict.\nShe is the daughter of former FBI director James Comey. She told colleagues in a note afterward that “fear is the tool of a tyrant” and that her firing without reason should fuel “a fire of righteous indignation at abuses of power.”\nThen she sued the U.S. government in mid-September, saying her firing was for political reasons and was unconstitutional. James Comey was fired as FBI director by President Donald Trump in 2017. The lawsuit noted he has since written a memoir critical of Trump and has publicly criticized Trump and his administration.\nBoth sides have tried to persuade the judge\nIn a court filing, Combs’ lawyers argued the conduct for which he was convicted involved “threesomes where fully competent adult men and women voluntarily crossed state lines and had consensual sex with each other, and the defendant made no money from the conduct.”\nProsecutors, citing trial evidence, say Combs used coercion and violence, including domestic abuse, in committing his crimes.\nCombs will “not be punished for any crimes of which he was acquitted, of course, but punishment for his crimes of conviction must take into account the manner in which he committed them,” prosecutors wrote.\nCombs’ lawyers wrote that the government’s view is, “Verdict be damned — lock him up and throw away the key.”\nWho is Judge Subramanian?\nU.S. District Judge Arun Subramanian is a Columbia Law School graduate and former clerk for Supreme Court Justice Ruth Bader Ginsburg, and was appointed a federal judge by President Joe Biden in 2022.\nBefore becoming a judge, he worked in private practice, handling primarily commercial and bankruptcy matters as a partner at the prestigious law firm Susman Godfrey LLP.\nA Pittsburgh native, he presided over Combs’ trial and recently denied the hip-hop mogul’s request to have his conviction overturned.\nThe video could backfire on Combs\nBefore the sentencing hearing began, Combs’ lawyers released an 11-minute video they prepared for the judge, featuring clips from home videos, scenes of him playing with his children, running in the New York City Marathon and coaching youth football.\nThe video chronicles Combs’ business successes, philanthropy and touches on some of his sorrows, such as the death of his longtime girlfriend Kim Porter. It shows Combs speaking about young people, his family and God, and features others speaking positively about him.\nProsecutors say that at the same time, he was beating women, plying them with drugs and paying male sex workers to engage in sex parties he called “freak offs.”\nIt's possiblet the judge might consider the video — which doesn’t mention his criminal case or the remorse he expressed Thursday in a letter to Subramanian — to be a transparent attempt to rehabilitate Combs’ image and downplay his crimes.\nJudge has lots to consider in sentencing Combs\nSubramanian will be weighing a lot more than what’s said in court on Friday.\nLeading up to the hearing, prosecutors and defense lawyers submitted lengthy arguments detailing what they think the penalty should be.\nThen there are federal sentencing guidelines, which probation officials say suggest a penalty of around 5 years and 10 months to 7 years and 3 months.\nSubramanian has also received letters — from some of Combs’ accusers and former employees, who say he should not receive leniency, and from character witnesses who support him and say he should.\nFederal sentencing guidelines are suggestions, based on a variety of factors. They are meant to promote transparency and uniformity in sentencing across the federal judiciary and to prevent wide disparities in punishment for the same crimes.\nCombs will speak in court during his sentencing\nHis lawyer, Teny Geragos, says the hip-hop mogul plans to speak in court before he is sentenced. Combs didn’t testify at his trial and spoke only briefly in court when the judge questioned him to make sure he was making the decision not to testify on his own.\n“I’m doing great, your honor,” Combs said in that exchange, and volunteered a compliment to the judge, saying: “I want to tell you thank you, you’re doing an excellent job.”\nAccording to the American Bar Association, addressing the court at sentencing — formally known as the right of allocution — gives a defendant a chance “to express remorse, and explain personal circumstances” that a judge might consider in deciding on a punishment.\nIn a 1961 ruling enshrining the right, U.S. Supreme Court Justice Felix Frankfurter wrote that judges should address defendants directly and leave “no room for doubt that the defendant has been issued a personal invitation to speak prior to sentencing.”\nCombs is being sentenced on prostitution-related charges\nCombs’ trial ended in a mixed verdict with convictions on two prostitution-related counts and acquittals on the most serious charges of sex trafficking and racketeering conspiracy.\nThe prostitution-related counts each carry a maximum penalty of 10 years in prison for flying people around the country, including girlfriends and male sex workers, to engage in sexual encounters, a violation of the federal Mann Act.\nCombs’ acquittals on the other charges spared him the possibility of a life sentence.",
  "word_count": 6278,
  "scraped_at": "2026-02-14T13:43:41.627490"
}