{
  "article_id": "d8398b8dad01",
  "url": "https://screenrant.com/rory-mccann-best-movies-tv-shows/",
  "title": "10 Best Rory McCann Movies & TV Shows",
  "date": "20240519T020000Z",
  "domain": "screenrant.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Summary\n- Rory McCann's versatility shines in a wide range of roles, from brutal enforcer to emotional father figure.\n- McCann's unforgettable performances in Game of Thrones, Hot Fuzz, and The Legend of Vox Machina showcase his talent.\n- From voicing Megatron to playing Jurgen the Brutal, McCann brings depth and charisma to every character he portrays.\nRory McCann is a Scottish actor who has been performing for years, but it wasn't until his role in a genre-defining fantasy TV series that mainstream audiences began to take real notice of the actor. When Rory McCann appeared in the pilot of Game of Thrones as the Hound, book readers knew instantly he must be an actor of some talent to get such a significant role. They were immediately proven right by his performance, though if viewers had been lucky enough to catch one of McCann's earlier roles they would have known the breadth of his abilities.\nSince he first began appearing in TV and movie productions in 1999 with the television film Coming Soon, McCann has proven himself to be an actor with significant range. It may surprise those who first saw him as the fearsome Sandor Clegane, but McCann is adept at comedy, heartfelt drama, goofy action, and slice-of-life everyman roles. At 6' 6\", few camera tricks can make McCann look any less imposing, but with just a tilt of his eyebrows, he can go from grizzly to teddy bear. Consequently, his best roles cover a range of characters, each different from the next.\nGame Of Thrones Cast - Where Are They Now?\nThe Game of Thrones cast was one of the best ensembles in TV history, with many actors continuing to deliver impressive performances after its ending.\n10 The Legend Of Vox Machina (2022-Present)\nRory McCann Voices Duke Vedmire (3 Episodes, 2022)\n- Release Date\n- January 27, 2022\n- Network\n- Prime Video\n- Showrunner\n- Brandon Auman\n- Directors\n- Young Heller, Eugene Lee, Alicia Chan\n- Writers\n- Eugene Son, Travis Willingham, Chris Wyatt, Kevin Burke, Suzanne Keilly, Mae Catt, Todd Casey, Ashly Burch, May Chan, Marc Bernardin\nCast\n-\nLaura BaileyVex'ahlia (voice)\n-\nTaliesin JaffePercy (voice)\n- Seasons\n- 3\nRory McCann has a recurring role in The Legend of Vox Machina as Duke Vedmire, the Briarwood's goliath enforcer. The Legend of Vox Machina is based on the ongoing web series Critical Role, where voice actors play the Dungeons & Dragons fantasy tabletop RPG; specifically, based on the first campaign the show depicted. The series follows the Vox Machina team through seven adventures and, in season 1, they try to stop the necromancer Briarwood family from taking over the town of Whitestone.\nVedmire is a brutal and cruel overseer of the town, and he perishes when the people of Whitestone rise up against their oppressors and kill him. The Duke curses and shouts obscenities often in the series and McCann's gravelly voice perfectly portrays his anger and hatred toward those smaller and weaker than himself.\nRecasting Vox Machina In Live-Action: 10 Actors To Take Over The Critical Roles\nSome actors are easy to picture in a live-action adaptation of The Legend of Vox Machina, provided the animated show's stars don't return.\n9 The Jury (2002-2011)\nRory McCann Plays Derek Hatch (5 Episodes, 2011)\nThe Jury is a British TV series that first premiered in 2002, and then had its second season premiere years later in 2011. Each season follows the 12 men and women selected for jury duty, investigating their lives and how they go about trying the crime they've been picked to pass judgment on. Rory McCann appears in season 2 as Derek Hatch, or Juror #6. Derek told his employer he would be on holiday so that he could have time off during his jury service.\nHe even goes so far as to go to a tanning salon before he returns to make it look like he had a tropical vacation. The second season concerns the retrial of a man who was convicted five years earlier of murdering three women after new evidence has emerged. The Jury is primarily a drama, but Derek adds some levity to the proceedings, which are a welcome respite from the high stakes.\nThe Jury season 2 is not currently available to stream, rent, or buy digitally.\n8 XXX: Return Of Xander Cage (2017)\nRory McCann Plays Tennyson Torch\n- Release Date\n- January 20, 2017\n- Runtime\n- 110minutes\n- Director\n- D.J. Caruso\n- Writers\n- F. Scott Frazier, Chad St. John\n- Prequel(s)\n- xxx, xXx: State of the Union\n- Franchise(s)\n- XXX\nCast\n-\nNina Dobrev\n- Budget\n- $85 million\nxXx: Return of Xander Cage is the third film in the xXx film series. The xXx field agent Xander Cage (Vin Diesel) is found to have faked his death in the previous movie and is now living in the Dominican Republic, enjoying retirement. However, after a covert terrorist team obtains a satellite-destroying weapon, Cage is obligated to return to xXx.\nThere he meets his new team, including his joyous and fun-loving getaway driver, Tennyson Torch (Rory McCann), who keeps track of how many vehicles he's destroyed: 200 at the end of the movie. Torch is emotional, funny, and always having a good time when he's behind the wheel of a car. He's also a talented driver and helps Cage and the team on more than one occasion.\nAt the end of the film, during a funeral for one of the team members, Torch is blubbering and singing heartily along with the gospel choir in a surprisingly moving scene that's a great reminder of how much happiness and heart McCann can inject into his roles.\n7 Slow West (2015)\nRory McCann Plays John Ross\n- Release Date\n- May 15, 2015\n- Runtime\n- 84 Minutes\n- Director\n- John Maclean\n- Writers\n- John Maclean\nCast\n-\nSilas\n-\nKodi Smit-McPheeJay Cavendish\nRory McCann's performance in Slow West came right in the middle of his run on Game of Thrones, so the director of the revisionist Western, John Maclean, most likely saw some connections between the Hound and John Ross and cast the character accordingly. John is a similar kind of man to those McCann has often played, a quiet but intimidating figure who wants to protect a young girl.\nSlow West is a Western that does not rely heavily on action, however, so McCann does not do much fighting, but his presence alone scares enough people away. It's a slow-building film that follows Jay Cavendish (Kodi Smit-McPhee) as he searches the American West for his lost love, Rose Ross (Caren Pistorius).\nRose lives with her protective father who, while anxious and paranoid about their status as wanted criminals, is a caring man. McCann manages to slightly shift his usual portrayal of a gruff figure into something warmer and more fatherly, making John not just a repeat of the actor's similar characters.\n6 Transformers: EarthSpark (2022-Present)\nRory McCann Voices Megatron (11 Episodes, 2022-2023)\nRory McCann puts his recognizable voice to good use as the voice of the Transformers supervillain Megatron in the Paramount+ animated series Transformers: EarthSpark. The series is set 15 years after the space bridge to Cybertron is destroyed, ending the war between the Autobots and the Decepticons.\nOn Earth, a new race of Earth-born Transformers called \"Terrans\" are born, and they team up with the Autobots, the special ops organization G.H.O.S.T., and a repentant Megatron to hunt down the remaining Decepticons. This version of Megatron is much more sympathetic, and McCann's deep but sad voice is perfectly cast to portray the robotic but emotional former evil leader.\nMcCann had big shoes to fill for the role, coming after Fred Tatasciore, Hugo Weaving, and Frank Welker, but he carved out a memorable and unique performance. This is a Megatron who has had to live with his sins, a characterization McCann knows well.\n5 The Book Group (2002-2003)\nRory McCann Plays Kenny McLeod (12 Episodes, 2002-2003)\nIn the Channel 4 series, The Book Group, American Clare Pettengill (Anne Dudek) moves to Glasgow, Scotland, and starts a book club, hoping to meet the cultured class of the city. What she ends up with is a collection of eclectic people from all sorts of backgrounds: a post-grad student, a man who has a history of abusing drugs, the discontented wives of local football players, and an easy-going man who aspires to be a writer, along with a few more who become an unlikely group of friends.\nThe writer is Kenny McLeod (Rory McCann), a happy and sweet man who uses a wheelchair but never lets that or anything else stop him from pursuing the things he enjoys. His first appearance involves him asking his friends to carry him up the many steps to Clare's apartment for the first club meeting. Kind and humorous, Kenny is a better writer than he is a speaker, but he learns to come out of his shell with the group. McCann is unexpectedly sweet as the character, and viewers can't help but root for him.\n4 Jumanji: The Next Level (2019)\nRory McCann Plays Jurgen The Brutal\n- Release Date\n- December 4, 2019\n- Runtime\n- 123 minutes\n- Director\n- Jake Kasdan\n- Writers\n- Scott Rosenberg, Jeff Pinkner, Jake Kasdan\n- Producers\n- Dany Garcia, Dwayne Johnson, Hiram Garcia, Jake Kasdan, Matt Tolmach\n- Prequel(s)\n- Jumanji\nCast\n-\nDr. Smolder Bravestone\n-\nFranklin 'Mouse' Finbar\n- Budget\n- $125 Million\nFor the most part, Rory McCann plays supporting characters, but Jumanji: The Next Level puts him in a more central role as the main antagonist of the film, Jurgen the Brutal. The third movie in the Jumanji franchise, Jumanji: The Next Level takes place a few months after the first film, with the original group of friends now apart at different colleges. Spencer (Alex Wolff), sad that his friends have moved on in their lives, goes back into \"Jumanji\", forcing his friends to go after him.\nThis time around, to beat the game, the heroes need to claim the Falcon Jewel from a violent warlord, Jurgen. McCann is perfectly cast against Jack Black, Kevin Hart, Karen Gillan, Danny Devito, Donald Glover, and Dwayne Johnson. Each one of these actors is instantly recognizable, and their rival needs to be the same.\nAs soon as McCann appears on-screen, it feels like he's always been a part of the series, just the latest downloadable character for the \"Jumanji\" game. Also, few actors can take a punch to the face from the Rock and remain standing.\n3 Hot Fuzz (2007)\nRory McCann Plays Michael \"Lurch\" Armstrong\n- Release Date\n- February 14, 2007\n- Runtime\n- 121 minutes\n- Director\n- Edgar Wright\n- Writers\n- Edgar Wright, Simon Pegg\n- Budget\n- $16 million\nFans of the Three Flavours Cornetto Trilogy by Edgar Wright starring Simon Pegg and Nick Frost will have been well-acquainted with Rory McCann before Game of Thrones. That's because of his appearance as one of the best villains in the trilogy, Lurch in Hot Fuzz. Hot Fuzz, the story of a London police officer forced to transfer to the sleepy town of Sandford, features hilarious dialogue, brilliant characters, and an intricate and fantastic plot that rewards repeat viewings.\nLurch is a lumbering, dimwitted employee at Skinner's (Timothy Dalton) supermarket, and with only one repeated line, \"Narp\", he cements himself as a classic character of the series. McCann is bald, with an overbite, and does whatever Skinner tells him, including getting into a brawl with Nicholas Angel (Pegg), giving McCann a chance to show off his talent for stunts and physical action.\n2 Knuckles (2024)\nRory McCann Plays The Buyer (3 Episodes, 2024)\n- Release Date\n- 2024 - 2024-00-00\n- Network\n- Paramount+\n- Directors\n- Carol Banker, Jeff Fowler, Jorma Taccone\n- Writers\n- Brian Schacter\n- Franchise(s)\n- Sonic the Hedgehog\nCast\n-\nKnuckles the Echidna (voice)\n-\nWade Whipple\n- Seasons\n- 1\nThe Sonic the Hedgehog franchise has come a long way from the first movie and Sonic's design woes. With two blockbuster films, another on the way, and a 2024 miniseries starring Knuckles, Sonic has quickly become one of the more successful video game adaptation franchises. Rory McCann plays \"The Buyer\" in the six-episode miniseries from Paramount+. \"The Buyer\" is a former lackey of Dr. Robotnik's (Jim Carrey), who is seeking to take Knuckles' (Idris Elba) power for himself.\nIt's a major role for McCann and in a giant franchise series no less. With henchmen of his own for once, McCann proves he can play a powerful and charismatic leader as well as he can a lackey. Sporting a bushy, wild beard and glaring eyes, McCann slots perfectly into the goofy and antic tone of the universe, fitting in well alongside villains like Robotnik and heroes like Knuckles.\n1 Game Of Thrones (2011–2019)\nRory McCann Plays Sandor \"The Hound\" Clegane (39 Episodes, 2011-2019)\n- Release Date\n- 2011 - 2019-00-00\n- Showrunner\n- David Benioff, D.B. Weiss\n- Directors\n- David Nutter, Alan Taylor, D.B. Weiss, David Benioff\n- Writers\n- D.B. Weiss, George R.R. Martin, David Benioff\n- Franchise(s)\n- Game of Thrones\nCast\n-\nJon Snow\n-\nIsaac Hempstead WrightBrandon Bran Stark\nBased on George R. R. Martin's ongoing A Song of Ice and Fire novel series, Game of Thrones is a fantasy drama set in the fictional continents of Westeros and Essos. It follows noble families like the Starks, Lannisters, and Targaryen vying for control of the Iron Throne while a rising threat from the undead looms in the North.\n- Seasons\n- 8\nGame of Thrones features an ensemble of characters, all conniving for power, safety, love, duty, and more. Sandor Clegane, or \"The Hound\", has one simple goal: revenge against the brother who burnt off half his face. That simple motivation turns into one of the best character arcs in the award-winning series and McCann has the gravitas to pull it off and turn the \"worst s**t in the Seven Kingdoms\" into a hero who even Arya has to thank.\nIt's the role that made McCann's career and any episode where The Hound appears is bound to be a good one. His physical acting was some of the best in the show, credibly cutting men in half and beating zombies to death. His sense of humor made even his more brutal scenes enjoyable.\nHowever, Rory McCann's greatest skill was showcasing the quiet sadness that underpinned all of Clegane's actions. It's a look in his eyes and a shadow on his face that makes the character deeper than he ever could have been written.",
  "word_count": 2450,
  "scraped_at": "2026-02-14T13:13:21.375360"
}