{
  "article_id": "d84127847341",
  "url": "https://news.yahoo.com/duke-carter-become-household-name-201435219.html",
  "title": "Duke Carter about to become a household name for lawsuit against NCAA",
  "date": "20231212T210000Z",
  "domain": "news.yahoo.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Duke’s Carter about to become a household name for lawsuit against NCAA\nDeWayne Carter attended Duke’s introduction of Manny Diaz as its new football coach on Saturday, mingling with boosters and university executives. For the moment, he’s got one bowl game left to play for the Blue Devils. His name’s about to be known for a lot more than that.\nCarter is the named plaintiff in the latest and most dramatic lawsuit against the NCAA, joining with TCU women’s basketball player Sedona Price and Stanford soccer player Nya Harrison to argue that any restriction on player compensation from schools is an antitrust violation. It’s the biggest swipe at the so-called “amateur model” yet, and has the potential to tear down the entire system.\n“It’s time for the NCAA to recognize that the rules prohibiting athletes from sharing in the massive revenues we help to generate are harming all college athletes,” Carter said in a statement issued by his lawyers. “There are hundreds of people involved in NCAA sports but the only ones who cannot be paid are the athletes; I’m proud to stand up for all college athletes to correct that injustice.”\nDuke would not let the media speak to Carter on Saturday, and whether Carter asked Duke for that protection or merely went along with the university’s wishes, he seemed OK with it. But his time in the spotlight is coming, and it will be extremely bright.\nFor him and for Duke.\n“DeWayne is a fantastic kid,” Duke athletic director Nina King said. “We don’t treat him any differently. We won’t deal with him any differently. But we’re still looking at what all of that means for us.”\nThe lawsuit means … a lot. It’s an existential threat to the quiet inequity underlying the entire NCAA economy: the players can’t and don’t make any money, because they’re just students in an extracurricular activity jazz band or the chess club, but everyone else does – coaches, administrators, contractors, architects, engineers, consultants, vendors – because the river of cash never stops flowing and it has to go somewhere.\nThe Carter suit is only one of several now floating around that attempt to hack and whack at various pillars of college sports, even if it wields the biggest weapon of them all.\nThere’s House v. NCAA, recently granted class-action status, which asks for billions in name, image and likeness payments that it claims were unlawfully withheld – essentially, NIL back pay for athletes who didn’t benefit – as well as a piece of television deals.\nThere’s State of Ohio et al v. NCAA, which a group of seven attorneys general including North Carolina’s Josh Stein filed last week in an attempt to remove all NCAA transfer restrictions. Stein earlier threatened the NCAA with legal action when it initially refused to grant North Carolina football player Tez Walker and Wake Forest basketball player Efton Reid waivers as second-time transfers before relenting. If the plaintiffs successfully obtain a restraining order in a hearing scheduled for Wednesday, all players awaiting waivers would be immediately eligible.\nAnd there’s Baker vs. NCAA, not actually a lawsuit, but new NCAA president Charlie Baker’s groundbreaking proposal last week to allow some high-revenue schools to start paying some athletes via trust funds. That’s merely fodder for discussion and not a finished product, but it opens doors for debate that had previously been closed, and acknowledges that the foundation of the NCAA’s entire (losing) legal strategy to date is no longer valid. For an organization that too often gets paralyzed by conflicting agendas, Baker’s shot from the top sets a new tone and creates a new imperative.\nAll of this builds on O’Bannon, which opened the door to the NIL era, and Alston, which had a minor financial impact – allowing narrow “educational” payments to athletes – but set a major precedent when the Supreme Court basically mocked the NCAA’s arguments and, in one particularly scathing concurrence, laid out a road map for future challenges to the NCAA the court would clearly welcome.\nMore in Sports\nBarcelona fans tear into several players amid Atlético disaster\nThis is all the NCAA’s fault, for taking such a hard line in O’Bannon and Alston instead of finding a way to settle. That left its future open to the whims of the courts and state legislatures, the latter basically imposing the new NIL world upon the NCAA, which continues to complain about a mess of its own making while begging Congress for help.\nThat legal strategy got president Mark Emmert fired; the new proposal from Baker, his successor, is designed to move the NCAA in a different direction, one where it at least tries to act proactively while Carter and House and Ohio circle it like sharks. Because even if you agree the players should get a piece of the pie, who gets what is an even more complicated question when two sports generate almost all of the revenue.\nBaker’s proposal hinted at a new division for schools willing to pay players, one that may be a bridge too far for private ACC schools like Boston College, Duke and Wake Forest compared to their larger Big Ten and SEC peers. Diaz talked Saturday about “competing at the highest level,” which certainly hinted at making that leap, but Duke president Vincent Price told the News & Observer the Baker proposal was never discussed during the hiring process.\nWe may even be headed toward a new iteration of the model that works for a few small schools like Clarkson, Colorado College, St. Lawrence, Union and RPI that compete in Division I in men’s hockey and one women’s sport, hockey or soccer, but Division III in every other sport.\nEither way, the players are going to get their share. It’s just a matter of when, and how, and who pushes the system over the edge.\nIt could very well end up being DeWayne Carter.\nRight now, Carter’s just a Duke defensive lineman getting ready for the Birmingham Bowl and the NFL draft. In a decade, his name could be synonymous with college athletes getting their fair share of the pie, whatever that turns out to be.\nNever miss a Luke DeCock column. Sign up at tinyurl.com/lukeslatest to have them delivered directly to your email inbox as soon as they post.\nLuke DeCock’s Latest: Never miss a column on the Canes, ACC or other Triangle sports",
  "word_count": 1067,
  "scraped_at": "2026-02-14T13:10:22.605095"
}