{
  "article_id": "d86083fa798e",
  "url": "https://toffeeweb.com/season/24-25/comment/reports/45402.html",
  "title": "Two fantastic strikes secure Everton first away win",
  "date": "20241019T200000Z",
  "domain": "toffeeweb.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Ipswich Town 0 - 2 Everton\nEverton put in an excellent performance at Portman Road to secure heir first away win of the season with a fine win over Ipswich Town.\nSean Dyche has had to revert to his old guard favourites for this one as the relentless injury problems limit his selection options with Chermiti, Broja, Iroegbunam, Garner, and Branthwaite either injured or not sufficiently recovered from long-term injury.\nThere's two places on the bench for goalkeepers but none for Jesper Lindstrom, with Everton playing in Spurs colours. The home side kicked off but Davis fell heavily inside 10 seconds and the age was halted.\nEverton got possession but Mykolenko's punt up the wing was poor. Still Everton worked it forward and Gana won an early corner. McNeil's delivery was good but Doucure needlessly pushed Muric. Ipswich made a quick break, Jack Clarke on the penalty spot, shafted his shot high and wide.\nCalvert-Lewin did brilliantly to rob a defender but was of course hopeless in the one-on-one with Muric. Nevertheless, Everton continued to push forward but Mykolenko overhit his cross. Harrison rescued it and Ndiaye put it on a plate for McNeil but he wanted an extra touch rather than hitting it first time and a defender took it off his toe.\nTarkowski slid in very strongly on Hutchinson but got the ball and was not punished. Tarkowski then complained about Delap pushing him off the pitch. Everton were gifted another corner which flew over Keane and Tarkowski.\nAfter good work by McNeil and Harrison, Iliman Ndiaye pounced on a ball that Ipswich were struggling to clear and he fairly belted it into the Ipswich net, with the benefit of a slight deflection, to give Everton the lead.\nEverton kept possession well to keep the home side under the cosh. McNeil fed a lovely ball to Calvert-Lewin who got a poorly directed shot off that was never going to beat Muric. Young delivered a brilliant ball straight up to Calvert-Lewin but it was put out for a corner that almost beat Muric.\nKeane blundered into Hutchinson and gave away a dangerous free-kick that was blocked before going out for a corner to Ipswich, the first pressure Everton had to withstand. Clarke dribbled in and went to shoot but kicked McNeil's leg... penalty? Hmmm. Ref says Yes — but wasn't this identical to Calvert-Lewin against Newcastle???\nVAR Graham Scott invited Micheal Oliver to review it on the monitor ... and amazingly they were consistent!! It was ruled out!!!\nCalvert-Lewin ran out of space wide left. But Everton had surely had the better of the game so far. However, they seemed to be allowing Ipswich to have more of the ball, Keane giving them a corner, intercepted at the near post.\nA breakout was the result, with Calvert-Lewin winning a corner at the other end. But nothing came from it and NcNeil's shot hit Calvert-Lewin for a goal kick.\nA speculative cross from Harrison saw Burgess head it behind for another Everton corner. It seemed to be cleared but came through from McNeil to Michael Keane, who, from an impossible angle, smashed it into the roof of the net! Unbelievable strike by the big galloot!!!\nEverton managed the last few minutes well enough until a mistake by Doucoure led to Gueye fouling Delap just outside the dee, Phillips spooning it over the bar as 6 minutes were added on.\nAs Everton worked the ball upfield, Phillips fouled Harrison for a decent free-kick that Young shot goalward — perhaps he should have gone for the near post? Everton saw out the added time to go off at he break with a very nice two-goal lead.\nEverton looked to take a degree of control through some unaccustomed high possession numbers as the home side struggled to see much of the ball. Calvert-Lewin tried to counter but his cross to Ducoure was cut out. But Town's passing was poor, giving Everton the ball repeatedly.\nDoucoure gifted the ball in to Calvert-Lewin's feet and he turned well enough but shot feebly well wide of the near post. Great supply, shockingly poor finishing from the Everton No 9.\nNdiaye picked up a loose ball and ran at goal but his shot was saved low down by Muric. Ipswich were almost invited to have a go a couple of times as Everton eschewed the press in favour of waiting for a mistake.\nIt was nearly an hour gone before Ipswich got their first corner of the second half, but Everton broke and Ndiaye fed a lovely ball to the feet of Calvert-Lewin but what exactly he was trying to do with the ball wasn't clear. He wasn't trying to shoot despite the keeper being flat on his face.\nSome changes by McKenna seemed to embolden the home side as Everton looked to lock in 3 points, but it led to more nervy moments. Mykolenko did well to win the ball but Everton failed to keep the ball on the counter as Ipswich were given more and more of it and almost invited to attack.\nNdiaye was lively and his trickery won Everon another free-kick left of the area, swung in by McNeil and it fell to Dcucoure but he could not fashion a shot. Ipswich countered at speed and Delap fired just inches over Pickford's bar.\nStupid play by Everton out from the back saw the easy turnover and Hutchinson fizzed a shot just past the far post. From the corner, Burgess headed into the roof of Pickford's net as Ipswich came closer and closer to scoring.\nAnother Ipswich corner and Chaplin fired it straight at Pickford – their first attempt on target as Everton defended deeper and deeper, with Mangala on for Ndiaye. A dangerous free-kick was headed clear, the last stages of the game played almost completely in Everton's half.\nCalvert-Lewin drew a foul on half-way to relieve the pressure. Young then delivered a brilliant ball right onto Calvert-Lewin's head and it bounced off toward the corner flag!\nEverton got forward but Calvert-Lewin then stood on the ball and lost it, giving Ipswich possession again as the clock ticked toward 90 minutes. Taylor was allowed to advance and test Pickford at the near post with 4 minutes added and Evertin holding on to their 2-goal lead.\nHutchinson's cross was headed well over by Taylor, who was then booked for an overly aggressive challenge on Young.\nPerhaps fittingly, another beautiful ball was played through directly to Calvert-Lewin's feet with only goalkeeper Muric to beat… but there is no need to describe what happened to the last kick of the game!\nIpswich Town: Muric, O'Shea (63' H Clarke), Woolfenden, Burgess, Davis, Morsy, Phillips (71' Taylor [Y:90']), Burns (63' Chaplin), Hutchinson, J Clarke (71' Szmodics), Delap (79' Hirst).\nSubs not Used: Walton, Townsend, Ogbene, Broadhead.\nEverton: Pickford, Young, Keane [Y:24'], Tarkowski, Mykolenko, Gana, Doucoure, Harrison, Ndiaye (81' Mangala), McNeil, Calvert-Lewin.\nSubs not Used: Virginia, Begovic, Patterson, Beto, O'Brien, Coleman, Armstrong, Dixon.\nReferee: Michael Oliver\nVAR: Graham Scott\nAttendance: 29,862\nReader Comments (247)\nNote: the following content is not moderated or vetted by the site owners at the time of submission. Comments are the responsibility of the poster. Disclaimer ()\n1 Posted 19/10/2024 at 13:53:19\nI just want Dyche gone.\n2 Posted 19/10/2024 at 14:02:19\n3 Posted 19/10/2024 at 14:03:44\n4 Posted 19/10/2024 at 14:04:16\nWhy the hell has he dropped Mangala to the bench?\n5 Posted 19/10/2024 at 14:04:25\n6 Posted 19/10/2024 at 14:06:40\n7 Posted 19/10/2024 at 14:08:04\n8 Posted 19/10/2024 at 14:08:37\n9 Posted 19/10/2024 at 14:10:22\nIn the dying seconds he weakly passed back to Pickford which was intercepted by an Ipswich forward, who scored, then the final whistle went !\nHope it was just that, a nightmare, and not reality !\n10 Posted 19/10/2024 at 14:13:30\n11 Posted 19/10/2024 at 14:14:49\n12 Posted 19/10/2024 at 14:15:18\nRoll on Xmas and TFG...\n13 Posted 19/10/2024 at 14:15:48\nBut, it's all opinion.. I hope we shut the door tight and clean them out early on!\n14 Posted 19/10/2024 at 14:16:22\n15 Posted 19/10/2024 at 14:17:49\n16 Posted 19/10/2024 at 14:19:06\nAs for today - we need to win and whatever happens, not lose.\nCan't believe he's included Doucoure again. Would be nice to see Patto get some minutes today, though more chance of Begovic playing at RB methinks.\n17 Posted 19/10/2024 at 14:19:24\n18 Posted 19/10/2024 at 14:19:49\n19 Posted 19/10/2024 at 14:20:18\n20 Posted 19/10/2024 at 14:21:27\nGood enough to win. 1-0 Everton\n22 Posted 19/10/2024 at 14:24:56\n23 Posted 19/10/2024 at 14:25:37\n24 Posted 19/10/2024 at 14:27:24\n25 Posted 19/10/2024 at 14:27:28\n26 Posted 19/10/2024 at 14:28:44\n27 Posted 19/10/2024 at 14:28:45\nSaying that, we should win but if we do it will be despite Dyche’s best efforts.\nI can’t wait for Friedkin to come in with a massive broom.\n28 Posted 19/10/2024 at 14:31:42\nTwo goalies on the bench because we have a thin squad, I think he couldn't even have a full bench last game.\n2-1 to us COYB\n29 Posted 19/10/2024 at 14:31:56\n30 Posted 19/10/2024 at 14:32:44\n31 Posted 19/10/2024 at 14:32:53\n32 Posted 19/10/2024 at 14:32:56\n33 Posted 19/10/2024 at 14:33:39\n34 Posted 19/10/2024 at 14:34:25\n35 Posted 19/10/2024 at 14:35:00\n36 Posted 19/10/2024 at 14:37:13\n37 Posted 19/10/2024 at 14:37:27\nAssume Mangala played during the international break so rested. Coleman and Patterson almost ready to start.\nThere is an OK squad there if we could just catch a break with injuries.\n38 Posted 19/10/2024 at 14:39:34\nIf he trained this week without any recurrence of his injury, should he not be in the squad like Coleman?\n39 Posted 19/10/2024 at 14:39:59\n40 Posted 19/10/2024 at 14:40:03\n41 Posted 19/10/2024 at 14:40:51\nHome to both Wolves and Forest in December? Are they the 2 points you are hoping for? :)\n42 Posted 19/10/2024 at 14:41:13\n43 Posted 19/10/2024 at 14:42:07\n44 Posted 19/10/2024 at 14:43:16\n45 Posted 19/10/2024 at 14:43:25\nWhat kinda message is that giving the the players left out?\n46 Posted 19/10/2024 at 14:45:29\n47 Posted 19/10/2024 at 14:47:24\n48 Posted 19/10/2024 at 14:48:16\n49 Posted 19/10/2024 at 14:48:39\n50 Posted 19/10/2024 at 14:48:45\nhttps://www.viprow.nu/epl/ipswich-town-vs-everton-online-stream-1\n51 Posted 19/10/2024 at 14:50:39\n52 Posted 19/10/2024 at 14:51:11\n53 Posted 19/10/2024 at 14:51:44\n54 Posted 19/10/2024 at 14:51:51\n56 Posted 19/10/2024 at 14:52:10\n58 Posted 19/10/2024 at 14:52:37\n59 Posted 19/10/2024 at 14:52:49\nI think an extra point - Beat wolves and lose to Forest!\n60 Posted 19/10/2024 at 14:52:50\n63 Posted 19/10/2024 at 14:54:16\n64 Posted 19/10/2024 at 14:54:35\n65 Posted 19/10/2024 at 14:55:19\n66 Posted 19/10/2024 at 14:55:20\n67 Posted 19/10/2024 at 14:55:25\n68 Posted 19/10/2024 at 14:55:59\n69 Posted 19/10/2024 at 14:56:22\n70 Posted 19/10/2024 at 14:56:37\n71 Posted 19/10/2024 at 14:56:52\n72 Posted 19/10/2024 at 14:57:20\n73 Posted 19/10/2024 at 14:57:49\n74 Posted 19/10/2024 at 14:58:33\ntinternet...\n75 Posted 19/10/2024 at 14:58:42\n76 Posted 19/10/2024 at 14:59:03\n77 Posted 19/10/2024 at 14:59:14\n78 Posted 19/10/2024 at 15:00:06\n79 Posted 19/10/2024 at 15:02:08\nIt's quitting on the idea of using the ball in midfield before the game starts.\n80 Posted 19/10/2024 at 15:02:34\nI agree Ipswich will use their quicker players to advantage especially against Young\nWhy no Mangala ? Gana isn't strong enough or quick enough and dare we expect Harrison or Doucoure to shine - I doubt it. Sorry guys no points here.\n81 Posted 19/10/2024 at 15:02:36\n82 Posted 19/10/2024 at 15:07:17\n83 Posted 19/10/2024 at 15:10:02\nHowever, in the unfortunate event that we are not, might someone attempt to explain what it is all we diehard supporters can see that our esteemed and horribly overpaid manager can not.\n84 Posted 19/10/2024 at 15:12:18\n85 Posted 19/10/2024 at 15:21:37\n86 Posted 19/10/2024 at 15:21:54\n87 Posted 19/10/2024 at 15:24:04\n88 Posted 19/10/2024 at 15:43:35\n89 Posted 19/10/2024 at 15:58:04\n90 Posted 19/10/2024 at 16:13:21\n91 Posted 19/10/2024 at 16:15:31\nAs for their penalty claims, it was a little bit difficult to see what had actually happened and wasn't that much clearer on replay and my first thoughts were that it was very similar to DC-L's penalty claim the other week but the defending immediately leading up to it was very second rate.\nThen Ndiaye with a superb finish before that striker cum centre half Keane put an even better one away.\nSo far so good but I'd like to see a bit more from the midfield working together.\n92 Posted 19/10/2024 at 16:56:38\n93 Posted 19/10/2024 at 17:17:33\n94 Posted 19/10/2024 at 17:23:41\n95 Posted 19/10/2024 at 17:24:00\nPlease someone tell him to shut up about the \"noise\" around the club, though.\nBy \"noise\", I think he means high expectations. High expectations aren't a problem (as long as no more old women are put on headlocks).\n96 Posted 19/10/2024 at 17:25:18\nI suppose we'll now be told to be thankful for the win and we shouldn't mention missed one-on-ones with the keeper but Dyche must get this improved on the training ground.\n97 Posted 19/10/2024 at 17:26:53\nNdiaye with a nice finish and the much maligned Mick Keane showing DCL how to finish.\nIpswich will struggle on this showing, delap looking more like his dad than a premiership striker.\nHutchinson and Smodics looked their only threat.\nI was very surprised to see the pen overturned by Oliver who couldn't wait to give it.\nNice to get 3 points on the road for the travelling fans.\n99 Posted 19/10/2024 at 17:29:41\nAnd I guess the \"penalty\" about turn has quitened the conspiracy theorists!\nUTFT!\n100 Posted 19/10/2024 at 17:30:42\nWell done Keane for not being a terrible as he's made out to be. We're on a good run now with a handful of players to return hopefully.\n101 Posted 19/10/2024 at 17:31:29\nI fuckin' love the lorra yers!!!\n102 Posted 19/10/2024 at 17:33:05\nAbsolutely fantastic result. Another eight of those between now and May and we're safe.\n103 Posted 19/10/2024 at 17:38:06\nFor all the hard work Calvert-Lewin does he is probably the worst one-on-one finisher in the Premier League. Next summer replacing him with a proven finisher should be our biggest objective.\n104 Posted 19/10/2024 at 17:39:02\nFrom now on I will request you proof read them on my behalf\n105 Posted 19/10/2024 at 17:42:03\n106 Posted 19/10/2024 at 17:42:36\nUsual nonsense from posters writing us off before a ball is kicked - seriously, why bother? - yet we won comfortably.\nBut for dodgy finishing, we'd have scored a couple more. Amazing away fans getting what they deserve.\n107 Posted 19/10/2024 at 17:42:49\nDom getting alot of abuse again, a couple of missed chances but workrate superb.\nNdiaye, Keane and Gueye superb today, Doucoure not good again today in my opinion. I presume Lindstrom was injured, if not why have two keepers on bench?\n108 Posted 19/10/2024 at 17:44:02\nNo name-calling from me after that. The Ginger Bell End got it right.\nI was very disappointed in Ipswich to be honest, after spending a load they haven't really shown any signs of being any better than when in the Championship!\n109 Posted 19/10/2024 at 17:45:00\n110 Posted 19/10/2024 at 17:46:58\nBut for me the MotM goes to the travelling Blues. They were singing their lungs out throughout.\n111 Posted 19/10/2024 at 17:48:52\nYup. Sure. Exactly what happened.\nFor those of you who post absolutely inane stuff without any knowledge whatsoever of injuries, training during the week, tactics, etc. and bash our Manager prior to a ball being kicked?\nI have a suggestion. Take it or leave it.\nTry just rooting for the team you miserable sod (to use an English phrase).\nThree points. TYVM (acronym intended).\n- Rando 'Merican\n112 Posted 19/10/2024 at 17:53:36\nI'll take the win but my word do they make us suffer in the closing minutes.\n113 Posted 19/10/2024 at 17:55:02\n3 points\nKeane scored\n8 points from last 4\nDyche Out!\n114 Posted 19/10/2024 at 17:55:49\nI wasn't happy with the line-up prior to kick-off but a win is a win and I am delighted to eat humble pie. Long may it continue.\nShout out to Ndiaye and Keane who thought both played exceptionally well. Calvert-Lewin covered some ground too.\n115 Posted 19/10/2024 at 17:56:23\n116 Posted 19/10/2024 at 18:00:28\n117 Posted 19/10/2024 at 18:09:43\n118 Posted 19/10/2024 at 18:10:36\nSean Dyche is doing an excellent job in extremely difficult circumstances and we will stay up comfortably. Anyone thinking new owners will bring about a new manager will be disappointed as most sensible people can see the stellar job he is doing.\nDoes he make mistakes? Of course he does, who doesn't? But overall he is doing a great job and who knows, if he has some money to spend in January, we might even sneak a top-half finish.\nI'm not going to bother getting into arguments with anyone because time will tell who's right but if I'm wrong and we get relegated, I'll come back on here and hold my hands up. I wonder how many of the Dyche haters will do the same if they are wrong?\n119 Posted 19/10/2024 at 18:11:51\nDelighted with the win also, but I wouldn't be eating humble pie. As you said, it didn't make sense dropping Mangala, especially as Doucoure was poor again.\n120 Posted 19/10/2024 at 18:12:00\nAnything to do with their 5 substitutions / fresh legs starting at 60 minutes versus 1 only for us?\n121 Posted 19/10/2024 at 18:12:42\nAlthough I'm sure they will find fault with something…\n122 Posted 19/10/2024 at 18:12:44\nI'm not joking, by the way. I did, and they didn't.\nI do, however, feel a certain sense of dread about future away goals.\n123 Posted 19/10/2024 at 18:15:39\nWho would you have subbed on, and for whom, to enhance our ball control?\n124 Posted 19/10/2024 at 18:15:52\nBut it is fun re-reading them, then reading the apologies later, and then reading the usual suspects doing the same thing week after week.\n(Isn't that a sign of madness? ….Yawwwn, another boring comment often put on here.)\n125 Posted 19/10/2024 at 18:18:11\nTwo clean sheets on the spin is good because it means on the whole the team is working as a unit. Such a pity that Dominic couldn't get on the scoresheet as he needs a couple of goals to boost his and the team's confidence.\nWe shouldn't get carried away with today though because there are tougher opponents to come; if we can eek out a few wins in our upcoming games, things will look brighter for the team and the club.\nWell done Keane for his goal and Ndiaye for being bright enough to spot the opportunity to score. Fulham up next a winnable match for Everton, but also a bit of banana skin in recent years. Let's hope the unbeaten run continues for quite some time.\n126 Posted 19/10/2024 at 18:29:24\n127 Posted 19/10/2024 at 18:32:22\nMost clubs would not tolerate you and Everton certainly do not deserve some of you on here. Some of you cannot put a sentence together without having to use foul language.\nRegarding Mangala, he is short of pace for the Premier League.\n128 Posted 19/10/2024 at 18:33:30\nAnother 3 points.\nAnother week in which the Dyche-hating, keyboard cursing, Toffee Web lurkers masquerading as fans are forced to watch re-runs of Howard's Way in their underpants while chuntering to themselves about possession stats.\nEntirely predictable result.\n129 Posted 19/10/2024 at 18:35:45\nProfessional win that could have been more if Calvert-Lewin could finish.\nWell done blues and Dyche. Let's hope for a stress-free season!\n130 Posted 19/10/2024 at 18:38:37\nNot sure Dyche could have done much different with the starting line-up considering the injuries. And Ashley Young played pretty well, too!!\n4 points from the next 2 games (minimum) and we can relax about our tough run in December. Just remember, you never win all the games you think you'll win and you never lose all the games you'll think you lose, either.\n131 Posted 19/10/2024 at 18:40:29\nVery glad to see the penalty decision overturned, it was eerily similar to the Calvert-Lewin claim against Newcastle so we've surprisingly seen some consistency.\nThought Calvert-Lewin had a great game, apart from getting on the scoresheet. Harrison has improved since being dropped for Lindstrom in the first half a few weeks back, he's adding a bit of end product (inconsistently).\nUnbeaten in four, long may that continue. Happy for our awesome away fans, I would have liked to have gone to this game but currently on business in the Caribbean, at least I got to watch it.\n132 Posted 19/10/2024 at 18:43:40\nHowever I think 2 things can be simultaneously true: First that Dyche has done a good job and continues to do so. Second that the new owners may well look for a new manager to build on these foundations and develop a more attractive style.\nI’ve been a fan of the Dyche appointment since day one and he deserves much credit but the performances will need to improve still to convince me that he’s the best long term option.\n133 Posted 19/10/2024 at 18:43:59\nIf we can get the investment before the January window and get over our injury worries, then things could start to look up. We just need to stay in the Premier League and get to the new ground with proper leadership in charge of the club.\nMight actually watch MotD tonight.\n134 Posted 19/10/2024 at 18:53:19\nDyche out!\n135 Posted 19/10/2024 at 18:57:51\n136 Posted 19/10/2024 at 19:04:01\nCalvert Lewin works hard but boy – his finishing really lets him and us down.\nHave a great weekend, Evertonians, wherever you are.\n137 Posted 19/10/2024 at 19:10:17\nLoved the performance today but once again we didn't use our quota of subs. Okay, it worked out today but law of averages, eg, Bournemouth, says it won't.\nDom was brilliant today and I wish one of his 3 chances went in. He's got everything bar the clinical finish. He needs to drill in training so it becomes 2nd nature.\nAway fans were superb.\n138 Posted 19/10/2024 at 19:12:56\n139 Posted 19/10/2024 at 19:18:36\nNow to beat Fulham, it should be a cracking match under the lights.\n140 Posted 19/10/2024 at 19:18:51\n\"Everton won comfortably, should have scored more, Ipswich did nothing until 80 mins. \"\nYet they gave MotM to Pickford????\n141 Posted 19/10/2024 at 19:22:29\nAlright, two goalies on the bench and the usuals in the team whilst we had three right-backs on the bench and none of them getting on as a sub.\nBut three valuable points. Dyche must be doing something right because we are starting to slowly climb the table after that horrendous start. I say 'slowly' because we can do it no other way as there are only 3 points available each game.\nSome of it might not be pretty but I trust that the knockers will have a rest for a week or so and give the players more of a chance than they have been doing.\n142 Posted 19/10/2024 at 19:27:55\nAlso, our fans were amazing again today.\n143 Posted 19/10/2024 at 19:45:45\nA pleasure to watch, really!\n144 Posted 19/10/2024 at 19:48:53\nPeople say \"Well, Dyche could pick someone from the U21 side instead.\" Like... okay? And he'd have zero percent chance of seeing the pitch, same as the extra goalie. It literally does not matter. Find some better hills to die on.\nAnd while I'm complaining, I saw a number of people on Twitter having a pop at Dyche for not making subs. These were the same people who crucified him for \"ruining things\" against Bournemouth, but now they want him to just throw O'Brien on to \"get some minutes\". Yeah, okay.\n145 Posted 19/10/2024 at 20:09:23\n146 Posted 19/10/2024 at 20:16:45\nI must admit though I'm a bit baffled by some of the stronger Sean Dyche dissapproval though. I don't think he is perfect but I honestly think he deserves to be at the helm for a couple of years more. I'm also of the opinion that he will only improve us further in that time. I know there are plenty that don't share this opinion though.\n147 Posted 19/10/2024 at 20:19:53\nGreat to meet with, John.\nIt was interesting to go to the pub directly opposite the station in view of Portman Road. As I tried to enter, the door men asked me who I supported. Well that is an obvious answer, but in fairness, they told me to go around the corner, through the car park and join the crowd, full of Evertoninaians. Strangely, they were playing all Everton songs and the supporters were getting in the mood.\nWell done travelling blues. You never fail. I wish I could have been in there with you. I will be at Goodison next week and at Southampton the week after, when John will escort me to my seat!!\n148 Posted 19/10/2024 at 20:27:08\nI thought we controlled the game up until the last 15 minutes or so when Ipswich finally decided to exert some pressure. Solid defending yet again by the back four restricted Ipswich to, well, zero chances.\nAfter a long flight home from Dubai on Thursday, the last thing I could have faced was an horrendous coach journey there and back, so train it was. Best thing I ever done!!!\n149 Posted 19/10/2024 at 20:55:43\nWell done the hard-boiled eggs and their butty soldiers! Look, I wouldn’t call myself a Dyche – what? – “supporter”, “admirer”, or “backer”, and to be honest I hope that he is not our manager twelve months from now.\nBut the key to that position is to give praise and credit when it is due and duly earned. Without that, you look like a twat. Dyche completely outfoxed a younger talented manager who nearly everyone thinks will be in a “top job” before too long. If we/he continues in this vein heads should turn and positions might change (including mine, as I would most likely miss my hard-boiled eggs).\nI was thrilled for Michael Keane. I’ve never said a bad word about him (that I can remember; partly due to his very public mental health issues that I have infinite empathy and sympathy for) and it was wonderful to hear the wonderful 3,000 singing “Keano”. We have not lost in four league games. Keane has been a key part of that and has been MOM or near MOM in three games in my opinion.\nSo, let’s have a look shall we at some of the pre-match “experts”. Our own Fenny Fensta believes that Dyche is a “complete bell-end”; makes you wonder who looks like “complete bell-ends\" now.\nDerek Powell (1) couldn’t wait to kick off, “the twats needs sacking” – and then dear old Derek was so excited that he popped on another 5 or 6 times, including (18), “he's set us up for a draw or defend a one goal win … tactics are dire, subs are dire … ”.\nKevin Naylor (3): “What a crap line up, going backwards”.\nJohn Wilson (19): “No width. They'll have all the possession, we'll be playing in low block. … This Dyche has not got a clue” (and nor have you Mr. Wilson).\nDerek Powell (36): he’s prolific our frothy Derek, unlike our fucking bell-end gormless championship striker, and he’s getting all worked up with only half-an-hour until kick-off : “we are going down”.\nFenny Fensta (39): “To be honest I’d sack Dyche now … Wtf is that about ? The man is a complete bell end”.\nTom Bowers (80): “Sorry guys no points here”.\nWhat is the other common denominator that ties these canny soothsayers together? Anyone? It’s past 8-30PM and not one of our pre-match doom-and-gloom merchants has had the integrity to post something after our great win (the first in seventeen on the road and the first since last December). Not one of them had the decency to accept that they got it all wrong and Dyche and co. got it right. Each one of them might learn something from Annika (114). Frothy Powell was bouncing before kick-off and is nowhere to be seen/read after the final whistle. Is yer Wi-Fi down Frothy?\nSo, there will no doubt be lambasting and lampooning voices calling me – what – a “gloater”? Not really. I don’t feel like gloating. It seems more useful to me to point out the lack of quality among the pre-match howling hecklers so that (1) we ought never to give them the time of day to be honest, so that (2) the rest of us can enjoy our win and give Dyche his due, so that (3) I don’t have to write this ever again.\n150 Posted 19/10/2024 at 20:57:01\nI'm not sure whether I can say that Calvert-Lewin had an excellent game when he made such a hash of his chances, but I thought he did. And so did Ashley Young. And Doucouré. And, whisper it – Michael Oliver.\nAbsolutely made up for everyone who travelled – you came over loud and clear.\n151 Posted 19/10/2024 at 21:01:11\nYou held your nerve after the first lot of games. In fact, you helped me hold mine!\nWhat did you see today that makes you jump ship? We were really good today, in my view.\n152 Posted 19/10/2024 at 21:01:38\nCalvert-Lewin is doing just about everything right except for putting the ball in the back of the net. It's so unfortunate but that's his main job and good things will follow if he can just put one of those one-on-ones away.\n153 Posted 19/10/2024 at 21:16:38\n154 Posted 19/10/2024 at 21:20:38\n155 Posted 19/10/2024 at 21:24:06\nGary Player once said (sarcastically)the more I practice, the luckier I get.\n156 Posted 19/10/2024 at 21:26:29\nThis is perhaps why Dyche deserves another couple of seasons with us before the club is capable of moving to the next level under a new manager.\nAs Sam notes the Friedkins are probably mulling this over but Dyche did well today and it won't have gone unnoticed.\n157 Posted 19/10/2024 at 21:30:35\n158 Posted 19/10/2024 at 21:41:17\n159 Posted 19/10/2024 at 21:41:19\n160 Posted 19/10/2024 at 21:47:24\nI gave him a call and listened to his criticisms of Dyche, and how that, even if he had money, he wouldn't be able to get his team playing good football.\nI defend Dyche because the bigger picture is that he came into a club that was rotten to the core and I also think he would surely be able to get a team to play some good football because I don't think it's that hard to achieve for anyone who has been involved in professional football for all these years.\nI don't know if I'm correct about my views on Dyche, but reading this thread, admittedly made easier knowing that we have won, one thing I have to agree with our manager about, is when he says that every single person has an opinion of what he's doing wrong and most people think they could do a better job of managing a football team, and this includes builders, bus drivers, traffic wardens, policemen, taxi drivers, binmen, and window cleaners!!\nI understand the venom. I had a similar dislike of Walter Smith but one thing they both had in common was that they were both managing Everton when the club never had a pot to piss in.\nMade up for the traveling blue army. I didn't even know my son and nephew had both gone but I'm glad they did because I'm sure they are having a laugh on the way home now.\nMichael Keane might have taken some stick but I'm sure his name is getting sung tonight!!\n161 Posted 19/10/2024 at 21:51:55\nNot one of the 3,000 got up early this morning thinking that we would lose. They all deserve top drinks, top food, top times, and top rumpy pumpy tonight!\n162 Posted 19/10/2024 at 21:54:13\nOnly one complaint: Why do we always resort to 10 men behind the ball for the last 15 minutes of a match?\n163 Posted 19/10/2024 at 21:58:50\nI also understand folk feeling a bit negative, especially after we've all been through lately, but I can't understand making the effort to post such negative rubbish just before the game. Especially when we were unbeaten in 3 and they hadn't won a game. I used to have to sit by one of these planks, but fortunately not any more.\nDyche has deserved some of the criticism for sure, but also deserves plenty of praise. Things aren't ideal, and often tough to watch, but we're in pretty safe hands while we ride the wave of financial and ownership chaos.\nColin #112,\nI put that down partly to tiredness. We worked very hard today. But it's also about confidence, surely? I would have brought on Mangala sooner, but what do I know?\n164 Posted 19/10/2024 at 22:07:40\nI wish we had done that versus Bournemouth. Today, having failed to convert several opportunities to score a third and facing a team keen to change the game in front of their own fans, the priority in the final stages was to prevent any late drama. Even then, the best scoring chance fell to Calvert-Lewin.\n165 Posted 19/10/2024 at 22:16:34\nBut I suspect TFG have ambitions beyond survival for us and potentially the resources to meet those ambitions. Dyche does not yet have the track record to make him the obvious candidate to meet those ambitions.\nWhilst I'd be happy to see him get another season with better players, the end of his contract may prove a natural place to part ways. I'm not necessarily advocating for that but I wouldn't be surprised by it either. The future is a foreign land.\n166 Posted 19/10/2024 at 22:26:44\nDyche is doing a great job and getting total commitment and effort from the players he selects and for some of the early plantpot posters on here, as we used to say to moaners at Goodison, if you don't want to support Everton, go across the park.\n167 Posted 19/10/2024 at 22:27:05\n168 Posted 19/10/2024 at 22:28:14\nI don't think he gets half of the credit he deserves leading our line the way he does. It will just take one of those chances to go in and then the floodgates will open, I'm convinced of it.\nI thought Dom, Keane and Young (again) were top notch today. A very professional performance by the boys.\n169 Posted 19/10/2024 at 22:31:52\nGrit and professionalism are vastly underrated but I think it's logical to have those feelings for Dyche, Sam, until (if) he is given a chance to work with better footballers.\nI didn't know Ipswich had spent £127M but sometimes buying players who have played the game can cause a lot of problems for an up-and-coming football manager who has got his own ideas of how he wants the game to be played… just as it might be hard for a manager who has always had the least money to be suddenly given more money to spend.\nI do think that Dyche is slowly making us a lot more professional and that's the name of the game, imo.\n170 Posted 19/10/2024 at 22:34:31\nWatching the game today, I thought there were long periods when we controlled possession, passed the ball around with purpose, created shooting opportunities and generally looked a team confident and capable. During those periods, I wondered what was wrong with the style of our football? The answer, for me anyway, was nothing at all.\nWhile there were some misplaced passes, some crosses not delivered with sufficient precision, and some chances missed these were the consequence of individuals lacking quality in key moments rather than a failure of the manager. He does not have the power to inject quality into players who, let's face it, are short of it.\n171 Posted 19/10/2024 at 22:38:27\nDyche is doing a superb job but he's unfashionable and it's fashionable to hate on him and to ‘expect' more.\nThose fans just don't understand the game. It's ridiculous. I just hope TFG give him a chance…\n172 Posted 19/10/2024 at 23:25:39\nNo need for cathartic emotional unloading today on TW.\n173 Posted 19/10/2024 at 23:27:44\nI suggested a hypothesis (note the question mark)…\nSo the question I would counter with: Are the subs really that bad they are incapable of performing as required for 20 or 30 minutes? Or is it more a case of the manager having a particular aversion to changing personnel when the team on the pitch are still just about ‘doing the job'?\nI thought this ‘characteristic behaviour' was what cost us against Bournemouth and I don't know how anyone expects 12 players to consistently match the workload over 100 minutes of 16 equally fit opponents. When you add in the fact that we have real veterans in positions where they are likely to be covering ground, then I think it is a real gamble.\nSo it's a balance to be struck. I'm concerned that the manager is overly reliant on ‘heart' to keep players going; the deeper we go into the season, the more we will be impacted.\nBy and large, this is pretty much my only real issue with the manager.\n174 Posted 19/10/2024 at 23:52:41\nWhat the bloody hell is going on with the 2-3 sitters for fiuck's sake...? All around though we are good, confident, go forward with the ball, and even put a few good tackles in!!\nTarkowksi's big early tackle is exactly what we need in big home matches!! Cunt got wrecked!!! 😂…\nSometimes it's nice to actually forget that we're just watching 11 millionaires strolling about a pitch for 90 minutes (the ball is only in play for only 60 minutes)…\nIt's mad how different it feels actually watching a team that resembles a professional outfit and not 11 morons. We've all been damaged the last few years but this ginger brute is leading us to the promised land!!\n175 Posted 19/10/2024 at 00:02:23\nThere could have, possibly should have been a couple more but for better finishing, but 3 points is 3 points on the road too. What fantastic support all through the game... thank you all!!\nDyche for me cuts a frustrating figure. I don't like the way he sets up his teams, blah, blah, blah… but we are where we are through no fault of Dyche, and I doubt few of the better managers would fare better with the squad we have (or seems we rarely have these days).\nThis is like sitting in the back of a flatbed ute with no suspension on a cobble road, you get to where you're going but feel like you have been gritting teeth and holding on for many a mile… not a great experience.\nIt's an arduous journey, but Christ almighty, the 3,000 away supporters would walk over broken glass to support the team, lung-busting pride.\nInvaluable win, I'll take every one of them on our way back up the ladder. Pretty professional or just hard work… well done, Blues. The boss can enjoy his curry tonight.\n176 Posted 20/10/2024 at 00:06:17\nBut the bastards made a rod for their own back and couldn't give it as the exact same thing happened to us last time out and it would have looked farcical.\nHad me laughing...\n177 Posted 20/10/2024 at 00:29:32\nBut seeing the circle jerking \"he's doing a stellar job\", \"outstanding job\" comments just reminds me of where we were a few weeks ago after losing to Villa when I posted the below.\nIn our next 7 matches, we face 6 teams who spend less than us on wages. We'll scrape a few results and climb up to lower mid table. Might even win a cup game. People will claim it's evidence that Dyche's methods are working, that he is 'the right man for right now', that he's 'working miracles', and that he 'says it like it is'.\nAnd here we are. Two of those fixtures left – Fulham at home and Southampton away. Then it changes and we'll see if we can actually overperform, as Dyche is typically credited with doing.\nDon't get me wrong, a win always improves the mood. But a win against Ipswich doesn't change my view of Dyche.\n178 Posted 20/10/2024 at 00:56:25\nThe new owners, if we have them, can hopefully look at the situation in the close season with our safety assured. It's really not that difficult to understand the logic of it, is it?\nOn that basis, surely any normal Everton fan would be supporting Dyche and the team to do well – rather than posting negative comments about today's match before a ball had even been kicked?\n179 Posted 20/10/2024 at 01:20:34\nI could just post \"Go Everton\" but that seems a bit pointless.\nI've continually argued that this team is better than it's given credit for. And it's definitely good enough to stay in the Premier League.\nThe man who gives the side the least credit is the man in charge, because he wants survival to equate to success.\nReferring to Dyche as working miracles after beating a team built on a fraction of our resources isn't supporting the team. It's accepting the lowest of standards.\n180 Posted 20/10/2024 at 03:19:08\nThese last few weeks, Dyche has been getting it right more times than he gets it wrong.\nIpswich, £127M in the hole, had better come to terms with the realities of the Premier League and/or hope that they really are the 4th worst team over 38 games... or Moyes could be looking for a nice short-term rental property out that way.\nThat's if West Ham don't drag him back first.\nOnwards and upwards, well onwards anyway.\n181 Posted 20/10/2024 at 03:34:24\nNice one Ernie (179): \"Referring to Dyche as working miracles after beating a team built on a fraction of our resources isn't supporting the team\".\nRemind me Ernie, by how much did Ipswich outspend us over the summer? And what a fecking unnecessary pompous comment! Ernie, ladies and gentlemen, possibly the best Evertonian in the world.\nSo, any one of the 3,000 who left Portman Road today thinking that Dyche is \"working miracles\" - get this - \"isn't supporting the team\".\n182 Posted 20/10/2024 at 03:37:18\nGood away performance and, if Calvert-Lewin had taken his chances, it would have been a lot more. He played well overall and led the line well. Maybe Keane can show him how to finish in training, ha ha.\n183 Posted 20/10/2024 at 03:49:36\nWith no budget and a reduced wage bill the squad is getting younger and better. Not easy. We'll finish mid-table no problem. That's if our frankly crank fan base will let him get on with it and cease the endless moaning and drama.\nThe club is finally stabilising and I'd be quite happy with Dyche being offered an extension at the end of the season. More change is the last thing the club needs. Rippng out the DoF, manager, and all the support staff and starting over again yet again offers no guarantees the new Dof and manager will even be on the same page.\n184 Posted 20/10/2024 at 04:42:25\nIf the new owners want to go all Billy Beane, Ted Lasso 'newbroom-tastic' then there's not much we can do.\nSo a 1-year extension, 'softly, softly catchee monkey' policy\nrather than our recent managerial slash-and-burn tactics might be the way to go.\n185 Posted 20/10/2024 at 05:27:29\nIpswich went out and spent money on players because they were coming from the Championship. I don't need to explain that, do I? After all that spend, their wage bill is less than a third of ours.\nThey don't have the players. They're not a very good football team. They will more likely than not be relegated.\nA month ago, Dyche was slated on here after losing to a decent side. Now he's being lauded again for his miracle-working because we beat Crystal Palace and Ipswich Town. Give it another month. He'll be slated again.\nAt least I'm consistent. I don't think he's a good manager based on his performance, regardless of who we play from one week to the next.\nAs for your last paragraph – just weird. I didn't say the thing you've tenuously linked to our travelling fans.\n186 Posted 20/10/2024 at 05:40:46\nIf you try to pivot every result to find an angle to criticise Dyche, then the danger is that people will stop reading what you post.\n187 Posted 20/10/2024 at 05:48:13\nIn light of your comment, Ernie, the Ipswich spend is relevant. I also agree that Ipswich, sadly, will go down. McKenna has used 26 players in 8 games. He is nowhere near knowing his best XI.\nWe need to keep an eye on Suffolk, there are some cracking not yet seasoned players down there.\n188 Posted 20/10/2024 at 06:31:07\nIpswich was a game that we should be expected to win (but you could have said that about Bournemouth when 2-0 up at home) against a fellow relegation dogfight rival (hope not this season), so we'll have to wait until we get tougher opposition to judge the ability of the manager to set up a team.\nDecember will be a tough test and is Dyche's chance to get some big performances on his CV just before Friedkin takes over.\nGood luck to him, 'cos if he's successful, it means the team is too.\n189 Posted 20/10/2024 at 06:49:55\nI actually think, when the majority of posts on here were frothing at the mouth about him, I was a bit more balanced. Now he's back to being a miracle worker, I'm obviously going to come across as pretty negative with my position on him.\nHe hasn't gone from tit to miracle worker in the space of a month, just as he didn't go from miracle worker to tit previously. In my view, he's just the same basic, agricultural, expectation-lowering, nonsense-talking bloke he was all the way through.\nWe've actually landed on a half-decent setup now. Do I give him credit? Absolutely not – you don't get credit for finally changing your Number 10 when you picked a guy with a big engine and two left feet for so long.\n190 Posted 20/10/2024 at 06:59:22\nIpswich were shorter odds to win the game according to the bookies before the game. Ipswich have drawn away to Brighton and at home to Villa. There is no easy game in the Premier League, especially away from home\n191 Posted 20/10/2024 at 07:20:00\n192 Posted 20/10/2024 at 07:46:39\nMichael Keane has been in form and playing well. And when he scores, they are special. His one against Palace to get us back in the game was cultured. The screamer against Tottenham and then Saturday.\nHe's had his doubters, myself included, as he has often worried me, but credit to his professionalism. Keep going as ultimately, we respect performances.\nAs for Dyche, we may get frustrated by the tactics but he's picking up points. Beat Fulham and Southampton and it's a different landscape from the early season.\nAnd we've got the FA Cup to come soon.\n193 Posted 20/10/2024 at 08:39:34\nI would write more, but a combo of TW and my useless phone have made posting anything lengthy very drawn out. Bonus for the rest of you!\n194 Posted 20/10/2024 at 08:56:37\nCalvert-Lewin worked hard and held the ball up really well, but he's such an ungainly finisher. Nobody in the ground expected him to score those one one-on-ones.\nNdiaye is such a great outlet. We need to keep him fit and happy. The fans love him and sang his name all game.\nKeane was excellent. Commanding in the box and a cracking goal. He's a natural finisher, unlike Dom.\nSpecial mention for Young playing right-back, he's been really good of late.\nAll round a good performance, albeit against a dreadful Ipswich side. They have a couple of good players but they're not a good side.\nAway fans in full voice throughout (thanks Steve for the ticket). Loud and proud, drowned out the home fans. You could see our players genuinely appreciated it at the end too.\nWe'll have much tougher games, but if we can be brave and keep the ball batter like we did yesterday, this team can play and we'll be alright those season.\n195 Posted 20/10/2024 at 09:33:44\nSurvival has definitely meant success, during the previous two seasons for a lot of Evertonians, but we are hopefully moving onto better things, and this will only happen if amongst other things, we get the right manager.\nLooking at the team that started yesterday, which players actually bring craft and excitement into our play?\nNdiaye - definitely, McNeil - sometimes, but after this I’m struggling to think of any names, and this isn’t down to Sean Dyche. We also have Dominic - who leads the line fantastically, (imo) but look at the arguments against our centre forward, because he hisn’t a natural finisher.\nIf Dyche had more players with craft, and was overlooking them then I’d say that a lot of the criticism was valid, but the simple fact of the matter is that this isn’t true, so logic tells me a lot of these claims are invalid.\nIt’s debatable if he’s the man, to take us forward, best illustrated by a man on these pages who says he has always backed him, (Sam H) but that is the conundrum for our new owners, who can’t get here quick enough.\n196 Posted 20/10/2024 at 09:34:28\nIt doesn't necessarily mean that we have better players. You continuously hold up our wage bill as something to beat Dyche with but never mention this crucial context.\nPerhaps a better (though very subjective) measure of the quality of playing squad is neither wages nor transfer spend but the value of those players to the wider market. By this criteria Transfermarkt has us around 16th which would seem about right to me, though there's not much between us, Fulham, Brentford, Wolves, Bournemouth and Palace.\n197 Posted 20/10/2024 at 10:10:05\nThat said, 'Go Everton' from an Everton supporter makes more sense than 'Dyche needs to be sacked now, he's got two goalies on the bench again' before the game has even started.\nA number of posters sound like they are frothing at the mouth for Dyche to go the minute we play badly, as if we're the only team in the Premier League that doesn't have off days. They then go very quiet when we win, you have to wonder what their motivation is.\nI acknowledge he's not everyone's cup of tea, but some balance might make these posts more credible.\n198 Posted 20/10/2024 at 10:13:04\nDyche trains and picks the team, he doesn't have anything to do with the money side of things, that's what your Director of Football is for.\nThelwell also manages the support staff, meaning the coaches.\n199 Posted 20/10/2024 at 10:22:00\nThey've had the ability to freshen things up. We've got Premier League experience which is valuable.\nTransfermarkt is a decent guide. But it's not particularly scientific. It's a community of opinions (at least probably impartial) and values move up and down based on performance. Well we've been crap for a while so it's no great shock to see the squad value down at 16th... still close to double Ipswich's though.\nI take on your point about us not having a wage reset. That would sort out players like Doucoure.\nBut our wage bill is also important. Both us and Ipswich were able to go and spend about the same money on a wide attacker this year (£18M-ish). We got the one who is paid about 900% more because he's more developed and more experienced. They got the one with a single top-flight appearance to his name. That's the difference in the respective markets we shop in.\nAnd obviously a similar situation applies to those in the top half of the table. They can attract players we can't. They will pay more than we will pay.\n200 Posted 20/10/2024 at 10:22:39\nMichael Keane played well again and scored a cracker, and for me on this season's performances, he deserves to partner Branthwaite when he returns. Yes, Keane has made mistakes but, as always happens at every football club, certain players always seem to get more criticism than others who at times have been a lot worse.\nNdaiye continues to excite and I just wish that we would play a system which allowed him to be more involved. Calvert-Lewin again put in a shift and under this system is mainly on his own, and puts in a thankless task. As others have commented, his finishing isn't as good as his work rate. I also think confidence is a big thing and at present he doesn't look like somebody who believes they will score more one-on-ones with the goalkeepers than he does.\nBut at the moment I don't believe he is under any threat from Beto; mind, when both Broja and Chermiti are fit, I think his position will come under more pressure.\nObviously the bench said everything about our ongoing injury problems, with Dyche selecting 2 goalkeepers and 3 right-backs, and Beto as the only forward.\nI don't think I will ever be a fan of Sean Dyche, even his first comments in his after-match interview, he started by saying we kept our shape and defended well – sums up his approach to the game.\nAnd before anybody asks, no I don't expect him to have us playing like Man City, but I would like to see a more progressive manager in charge when we move to the new stadium.\nWe have to start looking at survival football which Dyche is excellent at as was Allardyce, but I want to go into the new stadium and feel excited as to what I am about to watch, which is far away from what we are watching at the moment.\nI don't see Brentford or Brighton playing survival football, so you can play a different style to avoid a relegation battle. But, as I said at the beginning, delighted with the win as this club cant afford to go into the new stadium without Premier League football.\n201 Posted 20/10/2024 at 10:23:22\nI agree expenditure is not the only measure but it does give a good indicator of where we are competitively and what our current expectations should be. Dyche's job this season is to avoid relegation and to get us as high up the table as possible but arguably anything above 15th is a good performance. (Leicester's squad, a 14th in the spend table, cost £45M more than ours.)\n202 Posted 20/10/2024 at 10:24:24\nThey are determined to be proved right whatever happens. I have a mate like that I can show him the facts in black and white but he still insists he's right.\nThere's more than one way to skin a cat; the Idea is to give yourself the best chance of success with the tools at your disposal, it's called common sense.\nWe have scored more goals than Man Utd, Newcastle Utd and Nottm Forest, it's been our defence that's been our soft spot.\n203 Posted 20/10/2024 at 10:24:42\nI wasn't overly impressed by Ipswich when I watched them once live last season because my own view from the Dark Ages was that they looked like they had been coached in a “style over substance” kind of way, if that makes sense, and any manager who is using this many players doesn't come across as though he's trying to get the substance right?\n204 Posted 20/10/2024 at 10:54:17\nA beacon of sense and positivity in a sea of negativity.\n205 Posted 20/10/2024 at 11:01:38\n206 Posted 20/10/2024 at 11:11:13\nMcNeil is better - he connects play, holds the ball and has goals in his game. It gets him more involved in the game. But he is slow and has the turning circle of a super tanker.\nMcNeil and Ndiaye rotate regularly, but I would love to see Ndiaye or Lindstrom in that position eventally.\n207 Posted 20/10/2024 at 11:11:19\nI think we’re of a similar view re Dyche and DCL. I believe Dyche WILL see us safely into BMD as PL team but he will be replaced before we kick off.\nDCL is playing well but it’s stating the bleedin obvious to say he should be putting those 1v1s away. Hopefully he’ll spend the whole of this week being coached on that aspect.\nI enjoyed that game and was impressed with some of the football. No idea what the goals expected stats were but we “should have” won that 4 or 5 nil.\nLooking forward to my first visit to Goodison Park this season for the Fulham game. I hope it won’t be my last but tickets are much harder to come by this season.\nOn that note, I’ll be doing a Danny and going to Southampton without a ticket. If anyone can spare on ill love you forever.\nUTFT\n208 Posted 20/10/2024 at 11:31:29\nWhich manager are you talking about having used 26 players?\nAnd on that note, and in view of how many injuries we see these days, how many players did we use in 84/85?\nI’m pretty sure it was virtually the same eleven all season with Alan Harper and Kevin Richardson the regular subs??\nUTFT\n209 Posted 20/10/2024 at 11:42:26\nWhy oh why oh why oh why... doesn't Keano play up front? He's by far a better finisher than DCL, Beto, Chermiti etc. He's usually a liability in Defence and everytime I see him on the teamsheet in defence I worry he's either going to give away a penalty or concede an own goal.\nI really do rate Keane - not as a CB but as a striker.\n210 Posted 20/10/2024 at 11:51:23\nunusual gait without which he could, with his skills,\nhave been a top centre forward or creative midfielder.\nAs it is he is a pretty decent centre back.\n211 Posted 20/10/2024 at 12:02:05\nI thought Gueye, Doucoure, and Young had very good games and if Keane could hold the ball up as well as DCL, or DCL could finish as well as Keane, we would have the best centre forward in the premier league - bar none.\nWe are most definitely on our way back.\nUp the Blues.\nBy the way the commentators were calling Ipswich “The Blues”. We are the Blues - no other team - only us.\nIpswich used to play in orange and white.\nUp the Blues - the real ones.\n212 Posted 20/10/2024 at 12:10:12\nOut of one pod will emerge a world class striker and the mess that emerges from the other one, we can sell to the RS\n213 Posted 20/10/2024 at 12:21:37\nI’m not suggesting our squad is of similar level to Ipswich, we have better players; but I do think wages or transfer fees alone don’t give an accurate impression, especially if you have an irresponsible DOF. Happily I think Thelwell has done a decent job in bringing wages down a bit and we’re no longer hanging out contracts like we did to Doucoure etc\n214 Posted 20/10/2024 at 12:27:33\nHe reminds me of a certain Duncan Mackenzie.\nVery clever on the ball in tight situations with an eye for goal.\n215 Posted 20/10/2024 at 12:33:21\nFor me they have got us out of a potential hole with two or three very solid performances whilst we were short of our probable first choice options. Both should keep their places as the men in form.\nIn terms of Dyche, for me the man is a complete enigma, a real marmite character. He certainly sticks to his principles, which when it goes wrong can be incredibly frustrating but yesterday it worked perfectly, so credit where credit is due. Well done Sean Dyche.\nHopefully for the next game Dyche now may at last have a real dilemma such as who he plays at centre back. Personally I think it should be Michael Keane and Jarrad Branthwaite. Tarks should have some proper time to allow his injury to heal.\n216 Posted 20/10/2024 at 13:43:02\nIt wasn't always like this. I'm old enough to remember hope –no, make that expectation. I know there are ultra loyals always willing to believe (Hi Danny!) but is it really a surprise given recent seasons that so many are downbeat? It's the evidence of our eyes.\nOn Dyche, I'm on the fence. I take the point about the difficult circumstances. Actually beyond that, I don't think many managers could have held things together under the farce of the last few seasons. In fact, while our very existence was under threat (hopefully no longer), Dyche walking out on us in a hissy fit would likely have finished us.\nBut I'd still like to think we could have a better manager as and when we escape from the doldrums. Dyche may well rail about never getting a chance to work with better players but he can take comfort from the fact that – provided he keeps his copybook clean for the remainder of this season, he is never going to be short of very well paid rescue jobs in the forthcoming years.\nFor that, he will owe something to his Everton years. For us, even if we do move on with somebody else, I think we would always have a debt of gratitude for him holding us together over these awful past years.\n217 Posted 20/10/2024 at 13:57:12\nI have often been, let's say, sceptical of his methods and very often for good reason. Now that we are starting to see a gradual upturn in results, those who deemed to question his suitablity for the job seem to be open to attack again.\nI would like to think and do believe that, for the vast majority of us that ToffeeWeb is a forum where all views can be discussed in a decent and respectful manner.\nWhat we all have in common is an innate desire to see our beloved Everton succeed and sit again at the head of the table where we belong. That's all that matters.\n218 Posted 20/10/2024 at 14:02:38\nThere's pointing out mistakes and/or weaknesses but constant moaning for moaning sake is gonna get called out, and rightly so.\nAnd these posters are usually nowhere to be seen when we win.\n219 Posted 20/10/2024 at 14:11:53\nWhen I was a foot soldier in the Gwladys Street, there was a middle-aged guy always stood near us. Every single time the opposition crossed the halfway line he groaned “Oh no – here we go again!”\nOn the few occasions we conceded, he would turn around with a happy look on his face and say “Told ya!” He was a right miserable cunt!\n220 Posted 20/10/2024 at 14:13:54\n221 Posted 20/10/2024 at 14:35:46\nHis workrate upfront on his own and holding up the ball, and in defence is immense, he never stops running and hopefully he can be on the score sheet shortly. He's definitely putting in a huge shift.\n222 Posted 20/10/2024 at 14:37:34\nTony 205, with you as always, keep it going.\n223 Posted 20/10/2024 at 15:21:25\nHe is doing incredible work for the team and we are lucky to have him. In the right team, he will be leading goal scorer. I hope we will be the right team.\nFor fuck's sake, imagine Lineker, Haland, Saha or Jimmy fucking Greaves doing what this lad does? He is unique.\n224 Posted 20/10/2024 at 15:42:56\nHow does the song go? \"You only moan when we're losing!\" :-)\n225 Posted 20/10/2024 at 15:46:48\n226 Posted 20/10/2024 at 15:50:00\nIf Dominic could get his act together on the ground we would be much more of a menace.\nWith a full side playing I don't think we need to fear any team apart from the 5 or 6 usual suspects.\n227 Posted 20/10/2024 at 16:29:49\nDyche and Thelwell and their colleagues have done well under conditions that've exposed many others as not good enough in the manager's/DoF/coaches offices.\nWho knows how they might do with a sound, larger budget? I'd like to find out.\nLastly, I think it brilliant that as a team we're shooting meaningfully again - long may it continue.\n228 Posted 20/10/2024 at 16:44:07\nMy memory is shot to bits - I don’t remember your comments, but I was probably misunderstood if I upset you.\n229 Posted 20/10/2024 at 16:59:42\nIt's probably true that there are some that go too far, especially if they are not around on the relatively rare occasions that we do win. That is weird.\nBut 'the bucket is half empty' is strong within some of us. My friends and family will certainly tell you I am or have been hugely negative about Everton, always fearing the worst and often rightly. He seems like a lovely bloke, but I genuinely can't quite understand Danny's boundless optimism.\nI have a brother who supports the RS (don't ask), he is fanatically involved but never watches them live on TV. He just can't bear it, the possibility of them losing. Now that is a bit odd, but there's nowt so queer as folks as the old Yorkshire saying goes.\nAnd I challenge anyone, other than the real fluffy bunny optimists, not to have been dreading the last 10 minutes yesterday, and maybe like Mark's 'miserable cunt' in the post above, muttering about the impending doom. I guess if you expect the worst, you can sometimes be pleasantly surprised...\n230 Posted 20/10/2024 at 17:33:24\n231 Posted 20/10/2024 at 17:41:48\nHard to disagree with your appreciation of the wider role DCL plays and his contribution.\nHowever, you mentioned Jimmy Greaves. Now that is someone (along with Thierry Henry) that DCL could usefully watch on YouTube with regard to how to play one-on-ones against a keeper.\nDoes he ever practise these situations in training? He is frankly piss poor. It's either a weak hit and hope, or he hesitates, by which time a defender has repossessed him (as happened the other week).\nFrankly, if he gets in those positions at the moment ,you might as well head for your half-time pie, because you won't be missing a goal.\n232 Posted 20/10/2024 at 19:07:40\nI'd like to think that on Tuesday he'll be put on a thousand one-to-ones with the goalkeeper.\nIs that not what coaching is? What do we know!!\n233 Posted 20/10/2024 at 19:12:23\nI believe Iroegbunam, Lindstrøm, Chermitti etc have craft imo. Do you think they would all be played if fit?\n234 Posted 20/10/2024 at 21:02:26\nBut he can be a better finisher than he is now. I've seen him be better than he is now. And I'm convinced it's purely a confidence issue. His body language on his two one on ones screamed 'tentative'. Mind you, the keeper did make a decent save.\nHe's spent the last few years in a team where he gets no support up front and has had to rely on fighting for his own flick ons.\nLately things have changed a bit. He's got Ndiaye and McNeil around him, and even Harrison looks improved by having decent footballers to work off. Dom's had a few one on ones - something I don't remember seeing over the last couple of years.\nI'd love to see us get players around Dom more; even when the fixtures toughen up, and see if we can get him firing. It might just take a couple of breaks to go his way.\n235 Posted 20/10/2024 at 21:12:13\nParticularly by the likes of the 3 thousand at Ipswich who passionately and positively give their support and who often have the highest expectations of club and players.\n236 Posted 21/10/2024 at 01:40:54\nWhen he was running through on Saturday, no one around me really expected him to score and, of course, he didn't. His miss right near the end was even worse and just before that a close-range header nearly went out for a throw-in!\nOver a full season, the best we'll ever get out of him is around 12 goals. 15 would be a miracle – and that includes the odd penalty.\n237 Posted 21/10/2024 at 14:07:45\nPaul Ferry wrote earlier on in this thread about the amount of players that Ipswich have already used this season mate. It sounds like they are on their bare bones though because the Ipswich fan who has been on ToffeeWeb did say they played a couple of League One central defenders against us on Saturday.\nIt would be interesting to see how many players Kendall used in 1984-85, Mark. Heath got a very bad injury and this let in Andy Gray, and I'm sure both Harper and Richardson played in the away game at Bayern Munich, and did John Bailey also start the season at left back?\n238 Posted 21/10/2024 at 14:29:40\nI think you're right about Bailey starting at left back but still, I'm sure we only used a squad of 14 or 15 that glorious season?\nI'm in the Harlech this Saturday if you're about?\n239 Posted 21/10/2024 at 15:58:25\nSad to say it reminds me of a goal disallowed at Anfield many years ago that may have won a Euro game for RS against Milan if offside wasn't called on a RS player being in a position that obscured the keeper's vision This was a little different as the law has changed somewhat and we now have VAR to complicate matters.\n240 Posted 21/10/2024 at 16:08:22\nI saw it and I think that it was a good goal. Silva was in an offside position but he did not interfere with play or obstruct the goalkeeper or his vision of Stones's header.\n241 Posted 21/10/2024 at 16:21:09\nOn the City goal, the player doesn't interfere in my opinion. He actually goes to ground. Goal for me. Well, it was.\n242 Posted 21/10/2024 at 17:05:28\nI had to laugh when the Southampton goalie tried to claim the same for Leicester's winner!\n243 Posted 21/10/2024 at 17:43:14\n“How many players did Howard use in the 84-85 season?”\nThat would make a good quiz question, that I suspect most people would get wrong (myself included until I checked). The answer is 25!\nI suspect most of us have forgotten the two league games after the Cup Final. More pertinently, only 15 players played into double figures.\n244 Posted 21/10/2024 at 18:19:44\n245 Posted 21/10/2024 at 18:44:15\nSurely it can only be a matter of time before the media start demanding he move on to a “bigger” club?\n246 Posted 21/10/2024 at 18:53:06\nDon't give away your answers. You're not one of those who shouts out answers too loud in a pub quiz are you?!!!\n247 Posted 21/10/2024 at 19:22:16\n248 Posted 21/10/2024 at 19:35:03\nI never realised either that we used 25 players 84-85 Season and I probably went to 90% of the games too. Thanks for the info!\n249 Posted 21/10/2024 at 19:55:44\nThis was the squad for the 1984-1985 season:\nNeville Southall, Jim Arnold, Darren Oldroyd, Kevin Ratcliffe, Derek Mountfield, Alan Harper, Ian Atkins, Mark Higgins, John Bailey, Pat ven den Hauw, Darren Hughes, Gary Stevens, Gary Parkinson, Peter Reid, Neill Rimmer, Derek Walsh, Jason Danskin, Kevin Richardson, Ian Bishop, Paul Bracewell, Andy King, Trevor Steven, Kevin Sheedy, Adrian Heath, Alan Irvine, Terry Curran, Robbie Wakenshaw, John Morrisey, Ian Marshall, Graeme Sharp, Andy Gray, Paul Wilkinson\nAs well as the usual suspects, these lads got a game in the league or cups: Darren Hughes 2, Ian Atkins 7, Darren Oldroyd 1, Terry Curran 5, Jason Danskin 1, John Morrisey 1, Robbie Wakenshaw 1, Neill Rimmer 1, Paul Wilkinson not sure (he played though, got the winner over there in May when we were champions – played 32 games 1986-87), Mark Higgins went to Man-U in 1985.\nI’m in a hazy smiley dream along Howard’s Way.\nEqually importantly, the Paleys released From Across the Kitchen Table in Feb-1985\n250 Posted 21/10/2024 at 19:58:18\nI had tears in my eyes a few times, marveling at a team, that could play the game anyway it was demanded to be played, and some beautiful memories really came flooding back.\nOh Everton - oh we love Everton - oh Everton - oh we love Everton!\n251 Posted 21/10/2024 at 21:46:03\nI would never have got 25 in a million years – we seemed to have the same eleven every week.\nThat Ian Bishop. Didn't he play for West Ham in the later '80s??\n252 Posted 21/10/2024 at 22:33:10\n253 Posted 22/10/2024 at 02:30:41\nAdd Your Comments\nIn order to post a comment, you need to be logged in as a registered user of the site.\nOr Sign up as a ToffeeWeb Member — it's free, takes just a few minutes and will allow you to post your comments on articles and Talking Points submissions across the site.\nHow to get rid of these ads and support TW",
  "word_count": 12216,
  "scraped_at": "2026-02-14T12:18:48.457467"
}