{
  "article_id": "d8806b04b288",
  "url": "https://www.islingtontribune.co.uk/article/williamson-our-rivalry-with-spurs-is-really-important",
  "title": "Williamson : Our rivalry with Spurs is really important",
  "date": "20250213T223000Z",
  "domain": "islingtontribune.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Williamson: Our rivalry with Spurs is really important\nArsenal co-captain – and lifelong Gunners fan – looks ahead to derby day clash at the Emirates\nThursday, 13th February 2025 — By Catherine Etoe\nDefender Leah Williamson can recall a time when Tottenham plied their trade in the lower divisions [Pedro Porru/SPP]\nTHE Emirates is set for another blockbuster women’s match on Sunday – and Arsenal co-captain Leah Williamson is more than happy that the visitors this time are near neighbours Spurs.\nA senior Arsenal player for over a decade, the 27-year-old defender can recall a time when Tottenham plied their trade in the lower divisions. But since the Lilywhites’ promotion into the Women’s Super League in 2019, the north London derby has become a regular fixture.\nAnd in an exclusive interview with the New Journal to coincide with the launch of a new cervical cancer public health campaign (see next week), Williamson spoke of Tottenham’s presence in the top-flight as a win-win for everyone.\n“I think it’s really important that we have those rivalries,” she said. “And that fixture, two teams that are so close together in north London, it’s a missed opportunity if it’s not there.\n“So I’m glad that they have joined the top-flight and they are up there now, because they should be, especially with the resources that they have.”\nSpurs have never finished higher than fifth since joining the WSL, while Arsenal have always been in the top three in that time.\nThe red half of north London can also claim the bragging rights when it comes to derby days – Arsenal are unbeaten in all but one of their 10 league encounters so far.\nOf those, two stand out for Williamson. Firstly, their maiden meeting in November 2019 at the Tottenham Hotspur Stadium in front of a then record crowd of 38,262; secondly, their sold-out derby at the Emirates last March.\n“The first one we played that I felt this is a real fixture now that we can be excited for every year and fans can get excited for every year was just before Covid when we played at their stadium,” she said.\n“There are moments where, unfortunately in women’s football, you actually feel, ‘Oh wow, I am a professional and this is a real thing,’ and that was one of them.\n“And last year [at the Emirates] it made me proud because I thought, that’s our responsibility to the game as well, to do that and get those people in the stadium to watch us.”\nA Gunner since the age of eight and a lifelong fan of the club, the calm and collected centre-back, who can also play in midfield, shot to national prominence in 2022 when she captained England to Euro glory.\nShe has suffered a serious knee injury and other niggles since then, but has featured in 10 of Arsenal’s 13 league outings this term and is in the newly-announced England squad for upcoming international games against Portugal and Spain.\nDomestic duties prevail this weekend, though, and after a disappointing last-gasp League Cup semi-final defeat at the hands of Manchester City, Arsenal got back on track last Sunday with a 2-0 win over London City Lionesses to reach the FA Cup quarter-finals.\nAnd Williamson insists that the team “want to finish strongly” against Tottenham in front of what is expected to be a bumper Emirates crowd.\n“We have a lot of work to do in the league still, so you’ll see as together a team as you’ve seen in the last couple of games, that won’t change, but hopefully [it will be] a ruthless and clinical version of ourselves!”\nMeanwhile, Williamson will be joined in the England squad for the upcoming internationals by Arsenal teammates Lotte Wubben-Moy, Beth Mead, and Alessia Russo, but there was no place for forward Chloe Kelly, who joined the Gunners on loan from Manchester City earlier this month.\nTottenham striker Jess Naz was also selected by Lionesses manager Sarina Wiegman.",
  "word_count": 663,
  "scraped_at": "2026-02-14T13:05:52.707147"
}