{
  "article_id": "d883bb4ea812",
  "url": "https://www.northwichguardian.co.uk/news/24016880.lionesses-mary-earps-among-cheshire-residents-new-year-honours-list/",
  "title": "Lionesses Mary Earps among Cheshire residents in New Year Honours list",
  "date": "20231229T230000Z",
  "domain": "northwichguardian.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "THE King’s New Years Honours list has been revealed.\nGlastonbury founder Michael Eavis, Game of Thrones actor Emilia Clarke, director and producer Sir Ridley Scott, Dame Shirly Bassey and the Archbishop of Canterbury are just some of the famous faces to make the cut.\nBut you don’t have to look that far from home for some remarkable people achieving extraordinary things.\nPerhaps the standout local name is Wilmslow’s Mary Earps, the Lionesses and Manchester United’s superstar goalkeeper.\nEarps has been made an MBE for services to football after England finished runners-up to Spain in the women’s World Cup.\nThe honour caps an incredible month for Earps after she was crowned 2023 BBC Sports Personality of the Year in a public vote.\nEarps is not the only Wilmslow resident on the list.\nKhumi Tonsing Burton JP DL has been awarded an MBE for services to the community in Manchester and Cheshire, having supported the Royal British Legion for over 20 years.\nShe grew up in Imphal Manipur in India, where some of the greatest battles of the Second World Wars took place, and has always had an interest in the military.\nAfter studying history and politics at Bombay University, Khumi became an air hostess and it was on a flight that she met her husband Sidney, who had served as a Major in the Cheshire Regiment.\nShe moved to Wilmslow in 1976, becoming an integral part of the community.\nKhumi first got involved with RBL in 2000 when she started helping during the Poppy Appeal, collecting in local supermarkets, shops and offices in Wilmslow.\nIn 2002 she started the Wilmslow Street Party and in 2003 was appointed as Deputy Lieutenant of Greater Manchester.\nMore recently, in 2019, she organised VJ Day commemorations in Wilmslow to honour those who fought in the Far East.\nMeanwhile, over in Northwich, Reverend Canon Diane Veronica Cookson has been awarded a BEM.\nDiane has been vicar of St. Saviour's Parish Church in Stockport since 1996\nMoving further west, Thomas Daniel Critchley from Tarporley has also been include in the New Year Honours list.\nThomas works as a data scientist in the Prime Minister’s Officer and has been awarded an OBE for services to evidence-based policy.",
  "word_count": 369,
  "scraped_at": "2026-02-14T12:30:44.569184"
}