{
  "article_id": "d8b3bb46e192",
  "url": "https://www.aol.co.uk/articles/londons-men-got-caught-blizzard-060151172.html",
  "title": "How London men got caught in a blizzard of cocaine",
  "date": "20260208T063000Z",
  "domain": "aol.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "How London's men got caught in a blizzard of cocaine\nIt’s an early weekday morning in east London. The city around him is slowly waking up, but Danny* has yet to go to sleep. When he finished his shift working front of house at a popular Borough Market restaurant last night, he bought a gram of cocaine and finished it in his flat, alone.\nHe opens his banking app, the balance reads zero. Next, he flicks through his credit cards; the debt his lifestyle has amassed totals £10,000. “This was rock bottom,” the 31-year-old recalls of this point in December 2024. For nearly four months he used the class-A drug around five times a week, typically during and after work. “I numbed myself to the point where I didn’t feel anything.”\nMaybe you’ve spotted the dilated pupils and clenched jaws that dart all over the Square Mile. Perhaps it’s the buzz you can sense in the pub — loud, animated conversations, sniffs coming from the toilet cubicles. Whether you’ve noticed it or not, it’s hardly a secret that Londoners love cocaine.\nWe love the white stuff so much that King’s College estimates we snort more than eight tonnes of it each year, more than Amsterdam, Berlin and Barcelona combined. The UK has climbed to become the second biggest consumer per capita of it in the world (after Australia), and it’s not just humans riding the high. A few years ago, concern was raised for the eels of the River Thames — high traces of cocaine in London’s wastewater were turning them hyperactive.\nBack to humans, and the media has historically painted the UK’s typical coke user as one of three: the supermodel or pop star with a partying problem, the football-loving Tommy Robinson sympathiser foaming at the mouth for a brawl, or the “woke coke” snorting, high-flying businessman who lives by the motto “live fast, die young” (series four of Industry is currently airing, in unrelated news).\nThese personas may very well exist, but the reality is that in 2026, cocaine is no longer a drug ruled by class or background. “Compared with years ago, use is less concentrated in a narrow socio-economic group and spread across communities,” Robin Pollard, head of policy at drug and mental health charity We Are With You, tells me. “Cocaine is a far more diverse drug than people realise.”\nAll-time high: The rise of marching powder\nWhy? It’s more accessible than before, available at an instant via social media and WhatsApp. It’s cheaper, thanks to higher production and yield (according to a United Nations World Drug Report, production increased by 34 per cent between 2022 and 2023). It’s also stronger — that same report details that cocaine in Europe had an average purity of 60 per cent in 2023, compared to 35 per cent in 2009. Consequently, demand has risen.\nBut how we consume it has also switched a gear. “A key message we hear from staff and clients is that cocaine has become increasingly normalised across society,” Pollard says. “More and more, it’s seen as a normal part of a night out, going hand in hand with drinking.”\nThe charity’s support service has seen an uptick in the number of clients from all backgrounds seeking help for their use. Often, they claim their weekend use has become daily, or their work-life patterns normalise its use in the week — especially in industries like construction, hospitality and sales.\nCameron* very quickly realised that cocaine was just “part and parcel” of his recruitment job in the city. “You have to be strong-willed for it not to. It’s so egged on and normalised by senior members of the team,” he explains. He tried it for the first time at university and takes it occasionally at the weekend with friends, but says his use has soared since joining the industry.\n“My work involves a lot of networking, and lines eventually get racked up”\nBaggies left on desks, colleagues sleeping in the office after coke-fuelled benders, it’s all a part of the “work hard, play hard” culture of the job, the 27-year-old says. “My week involves a lot of networking — socials, lunch clubs, events — where drinking is heavy and lines eventually get racked up. It’s just the done, regular thing.”\nDanny’s addiction started when he worked in a famous pub in north London, where he labels the top-down cocaine culture as “cult-like”. “Everyone knew it was going on, but nobody ever had a discussion,” he says.\nDealers were regularly present around the establishment, while staff would take it together in blind spots and toilet cubicles: “It was like our way of showing camaraderie.” As well as eye-watering debt, Danny’s addiction strained relations with family and friends, caused romantic relationships to end, and took a toll on his mental and physical health, leaving him unable to leave his bed on days off.\nEmployers — especially in industries where long hours, high-pressure and demanding work create a culture where cocaine can thrive — have a responsibility to support their employees, and specific charities and initiatives like Hospitality Action do exist. But alongside their work cultures, both Cameron and Danny have something else in common: their gender.\nMan’s worst friend\nIn the UK, men are twice as likely to report using cocaine as women. They also made up nearly 80 per cent of the deaths involving the drug in 2024 (a figure which has increased consecutively each year for the past 13, attributed to the rise in cocaine’s purity, making it easier to overdose). In both men’s experiences, inside and outside of work, it’s men who do cocaine the most. Studies have shown that men are more likely to engage in high-risk behaviours, but surely there must be more to why blokes love coke so much?\nJournalist David Hillier has been writing about drugs for over a decade, and sought to answer this question via his drug culture newsletter, WHAT ARE YOU ON. After speaking to nine men, he found most use cocaine because of the perception that it “sobers” them up and helps them drink more, for longer. It explains why coke has bumped pork scratchings and pool tables as a pub staple in the past decade. “As a guy in his late twenties, it’s quite rare to have a night of drinking where you don’t get a bag in,” Cameron admits.\nReferencing Fiona Measham’s Swimming with Crocodiles, which outlines the history of the UK’s heavy episodic drinking culture, Hillier explains that drinking became the reason why people went out in the 2000s. “Coke is such a big part of pub culture because pub culture is such a big part of British culture,” he says.\nIt’s impossible to have a conversation about trends in drug use without discussing the climate it takes place in. A cost-of-living crisis plagues life in the UK. Society is fractured politically, socially and economically. Life can be hard. “People are looking for escape routes from reality — and for many, alcohol is the key,” Hillier explains. “Then cocaine is enabling them to drink for longer.”\n“One of the main reasons I use cocaine is because it lets me chat openly. I definitely go deeper when I’m on gear, even with friends I’ve had for years”\nBut there’s another theory, specific to men, that Hillier believes may explain why they love cocaine so much: it makes them talk (like those pub chats I mentioned earlier). A stimulant, cocaine skyrockets the level of dopamine in the brain, creating intense feelings of self-confidence and diminished social inhibitions. For men, who have historically struggled to talk about their inner thoughts and feelings, a cocaine high offers a window to air them. “One of the main reasons I use it is because it lets me chat openly,” Cameron explains. “I definitely go deeper when I’m on gear, even with friends I’ve had for years.”\nIn Hillier’s view, the stereotypical cocaine user — boorish, argumentative, navel-gazing — isn’t reflective of many who use the drug. “My experience is that most of the time men took it, they were sitting around having sweet conversations,” he explains. “Suddenly, they start talking about their parents’ break-up or something going on in their personal lives… It’s a shame they can’t access that without using cocaine, but we should have sympathy for the fact they do.”\nMisconceptions surrounding cocaine users are a huge problem — they only serve to stigmatise and shame those who use it, and they’re having a knock-on effect. “We often find that people who use cocaine often are more hesitant in accessing support,” Pollard says, adding that they’re also less likely to self-refer into physical services.\n“Coke is so widespread now, people are always going to use it,” Danny says, and he has a point. Outlawing cocaine and slapping on severe punishments for possessing it hasn’t stopped its use (lifetime use in the UK has doubled since 2001). London’s snowstorm isn’t calming any time soon — so what is the solution? How do we reduce the deaths linked to coke, and help men to stop relying on it?\nBringing people down off the high\nWhile he hopes the popularity of therapy with younger men reduces their emotional reliance on cocaine, Hillier also calls for legislative changes. “If people feel criminalised for taking it, they’re never going to come forward for help,” he says, referencing the legalisation and medicinal uses of other recreational drugs around the world. On an immediate level, Pollard wants to see awareness of the harms of cocaine boosted via non-stigmatising and targeted public health campaigns.\nFor instance, if more knew that cocaethylene — the toxic psychoactive substance our liver produces when alcohol and cocaine are mixed — is far more potent and harmful to the cardiovascular system than cocaine alone, they may feel less inclined to get a bag in when they’ve had a pint.\nBoth Pollard and Hillier stress the importance of harm reduction information being widely available and financial investment into treatment services. “There’s a presumption that treatment centres are geared towards heavy drinkers or users of drugs like heroin or crack,” Hillier explains. “Through conversations I’ve had, there’s a gap for what you could call the recreational user.”\n“Cocaine is part of the culture in London, but I’d also flip it on its head — in terms of accessing recovery sources, there’s nowhere better to be,” Danny says. After switching jobs (“I told the owner that if I carried on there, I’d be dead in a few months”) and with the support of an industry mentor and Narcotics Anonymous meetings, he’s now one year clean of cocaine. Recently, he shared his story at an industry-wide mental health event in the hopes of inspiring others.\n“I’m feeling really reflective about the milestone,” he says, a smile detectable in his voice. His career is flourishing and he’s recognised how consistent and dependable he’s become again.\n“I’m in a position where I can be surrounded by people on cocaine and it sends a shiver down my spine. But I don’t judge them, and nobody else should, either. Because what does anyone gain from that?”\n*Names have been changed\nIf you or someone you know is struggling with cocaine, contact We Are With You’s support service; wearewithyou.org.uk",
  "word_count": 1879,
  "scraped_at": "2026-02-14T12:53:50.241758"
}