{
  "article_id": "d8ba5cff3889",
  "url": "https://www.dailymail.co.uk/tvshowbiz/article-13542563/Englands-Lionesses-Chloe-Kelly-hen-party-Ibiza.html",
  "title": "England Lionesses celebrate Chloe Kelly hen party with a raucous Ibiza getaway - while the men gear up for their second Euros group match",
  "date": "20240618T131500Z",
  "domain": "dailymail.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "England's Lionesses celebrate Chloe Kelly's hen party with a raucous Ibiza getaway - while the men gear up for their second Euros group match\nTheir male counterparts will be hoping for another victory as they take on Denmark at the Euros on Thursday.\nAnd while all eyes are on the England men's squad, the Lionesses have swapped football boots for stilettos at Chloe Kelly's raucous Ibiza hen do.\nManchester City captain Steph Houghton, 36, was joined by teammate Demi Stokes, 32, to celebrate Ms Kelly's forthcoming wedding to Scott Moore on the Spanish party island.\nLooking rather different off the pitch, the group of women ditched their kits in favour of tight dresses and heels as they attended well-known club Ushuaia where they partied in the VIP section.\nMs Kelly, 26, who got engaged to her fiancé under the Northern Lights on a trip to Iceland last year, wore white high-waisted trousers, a halterneck top and a 'bride' headband.\nEngland's Lionesses have swapped football boots for stilettos, as they celebrated Chloe Kelly's hen party with a raucous getaway to Ibiza\nManchester City captain Steph Houghton, 36, was joined by teammate Demi Stokes , 32, to celebrate Ms Kelly's forthcoming wedding to Scott Moore on the Spanish party island\nThe group then descended one of Ibiza's famous beach clubs, posing for the camera in bikinis and sunglasses, with Ms Kelly wearing a white fluffy cowboy hat.\nIn typical hen do style, the footballer's friends had kitted out her hotel room with a giant inflatable engagement ring, balloons and gift bags.\n'Ibizeeeeeee baby! Unreal hen party for our amazing bride to be @chloekelly. These girls are special, now bring on the wedding,' Ms Houghton wrote on Instagram.\nEarling-born Ms Kelly rose to prominence during last year's World Cup, during which she scored England's winning penalty against Nigeria.\nJust one year before that she had been a substitute for all six of England's matches during the Euros, having only just recovered from a ligament injury she suffered in 2021.\nShe has been in a relationship with Moore, who is thought to work for a golf centre, for more than five years and they have largely kept their romance out of the public eye.\n'Nothing really changes for me except for a nice ring, I guess,' she told Sky Sports after Moore proposed.\n'It's an amazing feeling and it was so special, wedding planning is going well. I'm really enjoying it, I've got a little book and I just enjoy it,' she said.\nLooking rather different off the pitch, the group of women ditched their kits in favour of tight dresses and heels as they attended well-known club Ushuaia\nSteph shared a glimpse of the personalised gift bags laid out for Chloe's pals in celebration of her upcoming wedding\n'Ibizeeeeeee baby! Unreal hen party for our amazing bride to be @chloekelly. These girls are special, now bring on the wedding,' Ms Houghton wrote on Instagram\nMs Kelly, 26, who got engaged to her fiancé under the Northern Lights on a trip to Iceland last year, wore white high-waisted trousers, a halterneck top and a 'bride' headband\nEarling-born Ms Kelly rose to prominence during last year's World Cup, during which she scored England's winning penalty against Nigeria\nChloe and her pals also posed up a storm in matching personalised loungewear\nChloe has been in a relationship with Moore, who is thought to work for a golf centre, for more than five years and they have largely kept their romance out of the public eye\n'I go home from training and it's a nice switch off to focus on wedding planning – it's just enjoyable for me.\n'I'd like to be a wedding planner when I finish playing. I'm good at it so far, I'm not finding it stressful. I don't get stressed.'\nWhile the Lionesses are letting off steam in Ibiza, the men's squad are training hard in Germany as they gear up for the rest of their group stage matches.\nThe Three Lions were the winners in their first match against Serbia, with a 1-0 victory thanks to a goal by Jude Bellingham.\nDenmark were held to a 1-1 draw by Slovenia in their opening match and still have some work to do to qualify for the round of 16.\nEngland will next battle it out against Denmark before their second group match, before their third and final game against Slovenia on Tuesday, June 25.\nMost watched News videos\n- Extraordinary moment mass brawl breaks out between Brits on flight\n- Finance expert's TV interview interrupted by adorable granddaughter\n- Moment driver veers to target e-bike riders before killing teen\n- Moment Swiss bar fire owners collapse after being confronted\n- Astonishing moment a street is swallowed by a sinkhole\n- Chilling police interview of ISIS fanatic plotting UK attack\n- Food vlogger dies after 'eating toxic devil crab'\n- Spy cam shows woman on her knees next to Jeffrey Epstein\n- Deepak Chopra confronted over his relationship to Epstein\n- Toddler opens car door in traffic and sends biker flying\n- New video shows man with backpack similar to Guthrie kidnapper\n- Israeli hostage reveals how she survived being tortured",
  "word_count": 867,
  "scraped_at": "2026-02-14T12:32:42.497897"
}