{
  "article_id": "d8bfdfc4b4b2",
  "url": "https://thenationonlineng.net/nff-playing-games/",
  "title": "NFF : Playing games - The Nation Newspaper",
  "date": "20240606T051500Z",
  "domain": "thenationonlineng.net",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Commentaries\nJune 6, 2024 by Hardball\nNFF: Playing games\nMoney is usually said to be an issue in the affairs of the Nigeria Football Federation (NFF), the country’s football governing body. So, it was good news when President Bola Tinubu, in January, approved the payment of N12b to cover allowances and bonuses owed the Super Eagles, the country’s senior men’s national football team, and other Nigeria national football teams.\nIndeed, Sports Minister John Enoh was recently reported to have not only confirmed this approval but also listed this special intervention fund as one of his achievements in office.\nHowever, six months after Tinubu’s intervention, according to Sporting Life, “what has so far been paid out to Super Eagles are match bonuses for the 2023 AFCON home qualifiers against Sao Tome & Principe and Sierra Leone. These monies were paid in Naira as is the standard for home games.”\nThe report said: “The team have NOT been paid other outstanding monies, ranging from allowances for friendly matches to 2022 World Cup qualifiers and dating as far back as 2021.”\nAccording to the report, “This special fund was to pay the Flying Eagles outstanding allowances and bonuses for the 2023 U20 AFCON in Egypt as well as the 2023 U20 FIFA World Cup in Argentina.\n“Allowances for 28 days – 15 days at the U20 AFCON and 13 days at the World Cup – as well as qualifying bonuses from both U20 AFCON qualifiers as well as the U20 AFCON proper.” But the payments are outstanding, the report said.\nRead Also: Court orders another forfeiture of N11b properties linked to Emefiele\nThe report also said: “This same fund was to pay the allowances and bonuses of the Golden Eaglets 2023 U17 AFCON campaign in Algeria as well as the WAFU B qualifiers in Ghana the previous year.\n“This has also NOT been paid.\n“The same is the unfortunate case of both the women’s national team, the Falconets.”\nInterestingly, according to the report, NFF board members and NFF secretariat staff who were involved in these international engagements were paid last month. The question is: What about the players?\nThe NFF’s announcement that all Super Eagles 2023 AFCON allowances and bonuses had been paid failed to answer the questions concerning the reported outstanding payments. The body has a lot of explaining to do. It needs to clarify when and how much the involved national teams were paid from this fund, and whether there are outstanding payments. That’s what transparency and accountability are about.\nIt’s curious that there are reported outstanding payments despite the intervention fund that was meant to cover allowances and bonuses owed Nigeria national football teams. The money should be used for the purpose it was meant for. Failure to do so after six months is inexcusable.",
  "word_count": 465,
  "scraped_at": "2026-02-14T12:08:38.601746"
}