{
  "article_id": "d8c01f31ae8d",
  "url": "https://tvovermind.com/dumbest-got-fired-stories/",
  "title": "  How Dumb Can You Be ?: 93 Times People Got Fired And Had No One But Their Stupid Selves To Blame",
  "date": "20251119T213000Z",
  "domain": "tvovermind.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Depending on where you live, it can be pretty hard or very, very easy to fire you. If you are a Hong Kong banker, you might get months of severance pay after being fired. But some folks do things so deeply idiotic that not a single soul is surprised when they are let go more or less on the spot.\nSomeone asked “What’s the dumbest way someone you worked with got fired?” and people shared their best stories. So get comfortable as you read through these folk’s misadventures, upvote the best (or worst) ones and be sure to add your own thoughts and experiences to the comments section down below.\n#1\nDude got fired for forgetting to mute himself during a zoom call where he spent 10 minutes explaining to his cat why our boss “has the leadership skills of wet cardboard”.\nImage source: Ok-Revenue-7282, Getty Images\n#2\nDude was a police officer for over a decade and got fired for running multiple women’s license plates through the system to get their #s and hit on them. They complained and utilizing the system for a non-LE purpose is a crime in itself. You can see where this becomes a huge problem for the agency.\nBro had wife and kids at home too.\nImage source: Odd-Highway-8304, Ahmet Kurt\n#3\nUncle of ex husband (who worked at the same place) told his boss his wife died. The boss came to the house with flowers and said sorry for your loss. Wife heard him, walked in and said who died. Doofus wanted a day off and got a permanent one.\nImage source: Additional-Start9455\n#4\nIn the back of the grocery store I worked at was something called a cardboard baler. You’d toss your broken down boxes into this machine and press a button, then it would smush all the cardboard down until it was full enough that you would bail it with wire and put it on a pallet jack and take it out back.\nWell, a couple knuckle heads figured out that the press only goes down to about 18” of the bottom; just low enough to frighten the bejesus out of a new hire. And so they took a new guy to the back to “show them how to work the baler”, and tossed the guy, slammed the door, and hit start. The guy is screaming up a storm with fear that he’s about to be squished to death when the safety feature kicked in and these two ding dongs go “JK LOL”.\nFired.\nImage source: TMdownton916, MART PRODUCTION\n#5\nShe showed up to her 2nd shift, stumbling and stinking of liquor, while making jokes about the fact there was a bar across the street.\nShe was a delivery driver.\nYeah, bye.\nImage source: b_wald81, Tima Miroshnichenko\n#6\nTwo co-workers were out one night and one of them hurt his hand and had to go hospital. He still came into work on time the next morning. The other one phoned in saying he was still stuck at the hospital with the friend so couldn’t make it in. 🙄😂.\nImage source: Significant-Yak-2373, Curated Lifestyle\n#7\nHired a guy to be a welder. Kept asking where the spools of copper were kept. By lunch he’d stolen a forklift and tried ramming the storage bay the copper was kept in. Only manager key cards could open them.\nImage source: Cassandra_Canmore2, ELEVATE\n#8\nTried covertly switching a customer’s bank deposit into their own account. Yeah, not too bright that one. Bank found out like, the next day. Ironic part? She was in operations and was one of our auditors.\nImage source: Ortuatra, Tima Miroshnichenko\n#9\nCalled in sick to work, then posted photos on Facebook of her partying while she was supposedly out sick.\nMany of her coworkers were Facebook friends with her, including some of the managers.\nImage source: Narissis, Maurício Mascaro\n#10\nFormer airline worker here. Head flight attendant thought it would be funny to enter the cockpit wearing a plastic bag over their head, pretending they had been hijacked. Needless to say, they were stood down swiftly.\nImage source: InternationalWind625, Kenny Eliason\n#11\nA lunch teacher at my elementary school would hover over kids yelling at them to stop talking and eat their food. She got fired because a kid complained to the principal that we can’t talk during class or lunch so when are we supposed to socialize??\nImage source: Lille_8, Engin Akyurt\n#12\nBrand new cake decorator at my HEB turned in a cake with the words “I JUST REMEMBERED I HATE DECORATING CAKES”.\nImage source: otcconan, Jordan González\n#13\nI worked at a university. A guy got hired with the maintenance crew. Later that day, a woman’s bike was stolen from the bike rack outside the maintenance office. The next day, it reappeared on the bike rack with a new lock. She called campus police and as they were taking a report at the bike rack, the new maintenance guy came out to go home on his “new” bike he stole from her. He was fired.\nImage source: udontknowme_whodis, Mehmet Turgut Kirkgoz\n#14\nGuy tried to call off saying his ride got into an accident during the winter rain-snow mix and put their truck into a ditch. He texts the boss an unprompted picture of the truck in the ditch. She shows me the pic saying, “look who called off again”. I look at the picture and something looks weird to me. There were pine trees in it. We don’t have many of those around here. “I google “truck in ditch winter” and it’s the very first picture that pops up. She isn’t even that mad and we laugh about it more than anything. She wasn’t even going to plan on any write-ups or anything. I later find out that when she showed him the picture on google after he kept bringing up the accident”, he became irrationally angry and threatening so she sh**canned him.\nImage source: magseven, August de Richelieu\n#15\nI own my own company, came back from holidays and there were a few new hires I hadn’t met. Came into the canteen to grab a tea wearing casual wear and a guy was loading up a large back pack with a few hundred euros of snacks. It was mid morning so the place was empty as people were working.\nI casually asked what he was doing and he explained the snacks were free and there was no limit on how many you could take, he suggested I should steal some too handing me a box of 48 kitkat chunky bars. I declined, saying If I took them then there wouldn’t be enough for everyone else.\nI’d image, based on his face, he died a little inside at the company all hands meeting when he realised who I was.\nHis manager fired him that afternoon and said he wouldn’t be arrested if he emptied his bag and returned all the snacks stolen on previous days. Which in fairness he did.. 3 suitcases!! were needed to return his boxes of snacks. He was there 1 week.\nImage source: Additional-Sock8980, A. C.\n#16\nGuy got caught stealing office snacks on camera after HR literally sent an email saying “we have cameras, don’t steal the snacks.”\nCoworker called in sick then posted Instagram stories from a pool party the same afternoon.\nImage source: azianmommy, Mikhail Nilov\n#17\nIntern took a nap at work, but he chose to take that nap on one of the nice couches in the executive suite.\nImage source: sexrockandroll, Ron Lach\n#18\nOh, man. My fake brother. Like, unofficially adopted.\nI was working at this warehouse for high end shoes and they treated us all so d**n good. Literally threw a million dollar new year’s party every year. They were making 12b a year and we got catered lunch daily and our insurance was 100% coverage. Not exaggerating. I had NO MEDICAL BILLS while working there. This s**t is unheard of, I know. I used to tell the front desk “I promise I don’t owe you a co-pay” and they’d roll their eyes, charge me anyway, and HR would run a check to me for the $20 2 days later. They were so used to it. Because companies CAN afford to treat you well, but all of them seem to choose to do the least legally required by law instead. Capitalism!\nAnyway, I got my friend/brother to apply. He interviewed well. Got the job. Went to orientation. On the safety tour, they tell everyone what the Emergency Stop does. And then say, “Do not hit this button if it isn’t an emergency.” And he f*****g immediately hits the button and shuts down the entire converyor belt for the building. They just look at him and walk him to the door. Never even got assigned a department. I am still flabbergasted by it to this day. He was like, “I don’t know why, man. I just couldn’t resist.” Ahahah.\nImage source: AndNowAStoryAboutMe, Tiger Lily\n#19\nDay one in orientation with about 20 other people. Cute gal in a professional skirt and blouse steps up on the stage and starts to introduce herself.\nA guy from one table over whistled, basically cat calling the woman. The presentation stopped immediately, and the dude was escorted out.\nWe all got a lesson on unwanted sexual advances instead.\nImage source: codemise, Andrea Piacquadio\n#20\nI worked at a bank and one of the tellers called out saying she would be out for the week because she had appendicitis. It was bank policy that after 3 days of being out sick the bank manager would audit the tellers drawer which was locked in the vault, when the manager counted the cash in her drawer it was several thousand dollars short. She ultimately admitted to “borrowing” the money, she said that her boyfriend had some sort of monetary settlement coming in a few days and they wanted to take her kids on vacation with it so she “borrowed” the money, called in sick to work, and went to Florida. She claimed his check would come in while they were on vacation and she thought she could just come back to work after a week and return the cash without anyone knowing what had happened. She should have had charges pressed against her for bank robbery but for some reason they took pity on her and simply fired her on the premise that she pay the money back in full, I truly think management was simply covering their a**es because a teller should never be a position where they can walk out of a bank after their shift with several thousand dollars in their purse.\nImage source: 2inTHEivies, Pixabay\n#21\nStole cash from the register that had a camera pointed at it. She could see the view of the camera on a monitor right by the register, so she knew she was in frame.\nImage source: ElChuloPicante, Nathan Anderson\n#22\nSomebody who worked for me. One of the top consulting companies did the usual graduate hire. One of mine was sent on a training course, then did not come back. We learnt he had asked his girlfriend to come stay with him at the hotel, decided nobody would miss him at the training, skipped the training, then they just stayed in the hotel room, thinking we would carry on paying for it. HR found out, Travel expenses, no show at training. I had the ‘pleasure’ of contacting him to tell him he was fired and we were withholding the hotel charges from his pay check. How completely stupid can you get, get a great job, just out of college and blow it up like that!\nImage source: jthechef, Matteo Milan\n#23\nWhile serving in the army, a young private decided to take a Land Rover home for a long weekend. Realised he might get caught, so took it to a car park, smashed the ignition and set it on fire (all caught on CCTV)\nHowever it took about a week for the unit to get informed by the police that they had found our burned out landy, no one had noticed it was missing and if he’d drove it back and left it where he found it, no one would’ve noticed it had gone anywhere.\nResult – discharged and 6 months in civvy nick.\nImage source: paulbdouglas, cottonbro studio\n#24\nI work for an airline and we fly for free, new-ish hire decides he’d rather be on the beach so he calls in sick and he shows up to the airport and hops on a plane, one of the sups sees him and lets him fly and they halted his flight benefits after the plane left. Don’t know exactly what happened after that but I never saw him again.\nImage source: DickFartButt, Tahir osman\n#25\nThey got caught writing in tips – adding an extra one or whatnot. They got arrested at the restaurant.\nImage source: DiscoLibra, cottonbro studio\n#26\nWhen selling flooring, we had racks of runners/entrance mats that were cut to length. The guy put it over it leg to cut it with a stanley/utility knife. Obviously, he cut into his own leg, and then when he came back from that injury, he did it again.\nImage source: Black-RedShark, Getty Images\n#27\nNot really dumb so much as memorable. Working at Sonic in the 90s. Training this new guy who seemed perfectly normal for a 18-20 year old dude. Weekend stoner, got along with the carhops without bein a creeper. Learned the grill and prep station pretty good in only a couple days.\nHis third or fourth day hes prepping onion rings and the owner of the local franchise had come in to do paperwork. Owner walks by the prep table and new guy turns and power slaps him across the face with a hand covered in batter and bread crumbs. Owner jumps back. Dude pulls one of his own legs up by the ankle with one hand, hops up and down on the other while playing air guitar with the batter hand screaming “I’m rockstar ghandi!” At the top of his lungs.\nHe guitar hopped all the way out the door screaming the whole time and then took off running and we never saw him again. He didn’t even come back for his paycheck.\nImage source: a_man_in_black, Dom Gould\n#28\nBack when the Internet was newish I worked for a company you have absolutely purchased fuel from… and we hired a guy to come and sort out some infrastructure issues and work out who was using all the bandwidth.\nA month later we got a bill for like $27,000 for “bandwidth overrun”.\nTurns out that within an hour of being in the building he had set up a Napster node and was downloading every file in there, and re-sharing them.\nWhen we fired him he had tears 😭 in his eyes and was genuinely destroyed… he just kept saying “But I read the Employee Handbook and there was nothing in there saying I couldn’t do that!”.\nImage source: Former_Balance8473, Ketut Subiyanto\n#29\nAs a manager at GNC. I hired a girl who was a solid fit with the team. After 2-3 days, she no called / no showed. I found out later it was cuz her boyfriend “didn’t like her working with guys”…\nGood luck!\nImage source: MProsserMMA, Vera Arsic\n#30\nHaving an affair with the married boss. When both stopped getting along with each other it was just weird and the boss not only stopped the affair but also fired my colleague.\nImage source: nayanextdoor, Anna Shvets\n#31\nWorked security, at a government department. Dude on night shift was walking around doing his checks one night in the building. Saw a PC on, and noone around. He started looking up p**n on it. The PC was on because the person was remoted in from home working.\nHe had a disciplinary meeting, and took his mum along as support person. His mum tried to say her son doesn’t look at p**n, etc. boss provided proof of everything he was looking at, times, all of it. Fired.\nImage source: minimaddnz, cottonbro studio\n#32\nHe was a packager at a dispensary hub. He put a bunch of loose w**d in his pockets and tried to sell it to employees during first break, which is as long as he lasted.\nImage source: Rev_Christopheles, armağan başaran\n#33\nI used to work as a bartender for a big, well known hotel chain. One day, another bartender decides to steal a case of beer. To accomplish this, he took it to the loading dock (which, as you’d expect, had security cameras on it), placed it right in the middle of the well-lit loading area and covered it with a cloth.\nBy the time he came back with his car, a security guard was there waiting for him, and said “if you’re going to insult our intelligence this much, you deserve to be fired.”\nImage source: ndab71, cottonbro studio\n#34\n#1: We got a call from a truck/lorry-driver and said that he saw one of our company cars swerving across the road. Turns out he was drunk out of his skull at 9am. He started working 2 weeks prior.\n#2: Had a guy working at a tech company (camera’s all over the place) steal a tablet/i-pad from a room. The tablet he stole was back at the company for repair, so the idiot got fired for stealing a broken item.\nImage source: williamrtd, Pavel Danilyuk\n#35\nA coworker would take an empty trash cart out back to act like he was taking the garbage out so he could smoke a cigarette. He would do this at least 5-6 times a day! It was a small business that didn’t produce much garbage. People started complaining so the Boss finally noticed that he was going in and out a lot and decided to check the cameras. The second he came rolling that cart back in he got fired!\nImage source: Three6Stamina, Faruk Tokluoğlu\n#36\nComputer programmer at a bank started wearing expensive fur coats to work. They checked her code and found that she had been diverting money to her own account.\nImage source: Ancient_Skirt_8828, ThisIsEngineering\n#37\nWorking at a call centre. We were in training. He took a call and thought the customer sounded hot so he took her number from her profile and started texting her. Naturally she found this highly creepy and reported him to our operations manager. He was fired that day and had to explain why to his wife.\nImage source: MetalRanga, Tima Miroshnichenko\n#38\nOur job was showing occupied apartments (people still lived there) for the landlord to re-rent. You had to be friendly and helpful, supervise, make sure people didn’t touch the tenant’s stuff, answer questions, lock up after.\nThis dude finished an apartment showing, stayed in the apartment, and started eating the tenant’s cereal out of the box with his bare hands! The tenant had cameras and sent us the video while he was still in there chowing down….\nImage source: VeterinarianPast6830, MART PRODUCTION\n#39\nHe got sacked for stealing toilet paper. Could easily have swiped hundreds of dollars of small tooling (cnc machine shop). But no. Bog roll.\nImage source: danwerkhoven, Anna Shvets\n#40\nDrunk, pants down, dancing in the kitchen at work on the prep bench singing “i see you baby, shakin that a*s, shakin that a*s” 🥳😂.\nImage source: Ok_Development_3961, Vitaly Gariev\n#41\nI worked for the audit team of an international energy firm with the HQ here in the UK. We hired someone based in Texas to undertake our US based work with an inflated salary due to difficulties recruiting the right person.\nWithin a week of them receiving their company credit card for expenses they spent $20,000 on furniture, make up and luxurious personal items.\nThey were an Auditor for God’s sake!! I don’t know how they thought they were going to get away with it.\nImage source: ImDeadBossMe\n#42\nWe had a new wooden staircase installed at work because the old one was dangerous.\nFor some unknown reason he decided it was a good idea to carve his initials into it with a knife.\nBoss didn’t think it was such a good idea tho.\nImage source: rabtj, Annie Spratt\n#43\nA guy tried to book time off to play in a local football match but was denied so he went sick and then was found out because he was pictured scoring a goal in our local newspaper.\nImage source: rFAXbc, Tembela Bohle\n#44\nA guy I worked with got fired because he would use company stationery to write fake recommendation letters for his friends who were looking for a job. He gave himself a fake job title (we worked in word processing). I think he said he was Office Manager. He got caught when a prospective employer called asking for the Office Manager of the company instead of the name of guy writing the fake letter. When the real Office Manager got the call, his deception was revealed and he was out of there.\nImage source: november13, Pixabay\n#45\nThe boss asked the new admin assistant (AA) to order some sandwiches from Jimmie Johns while he worked through a lunch meeting. This was one of the AA’s job duties. The AA disappeared for 3 hours before coming back and threw the sandwiches on his desk an hour after the meeting had ended.\nThe boss gently asked her what had happened and she started screaming and cursing at the boss that it was his fault because he had given her an impossible job and she couldn’t find a Jimmie Johns in 2 hours of driving around. Jimmie Johns had delivered to our office many times before that. She got fired for screaming and cursing at the boss, and of course, not being too smart.\nI was the boss. She kept screaming the whole time she cleaned out her desk.\nImage source: Routine_Mine_3019\n#46\nA fellow journeyman fitter, making $130 an hour of total package pay, plus a work truck with gas card, decided to spend many hours on the job collecting bottles and cans around the jobsite so he could turn them in for .10 each. Got fired for wasting company time to collect $10 a day in recyclables.\nImage source: CantFeelMyLegs78, Greta Hoffman\n#47\nWorked in kitchen. A co-worker got caught attempting to steal a bag of napkins. He put a whole pile of them in a paper bag, then looked up at the security camera, then tried to subtly put the napkin bag under the counter.\nSomeone found the bag filled with napkins, so they checked the security cameras. And the guys behavior was so sketchy, it was obvious he was trying to steal them.\nManagment decided that if he tried to steal these, he probably had already stolen other things, and they fired him – it was his first and only offense.\nRight after he got fired, covid started. Last I heard, he spent all of covid unemployed, struggling to buy insulin for his girlfriend. I never imagined someone’s life could be so wrecked by napkins.\nI felt bad about the whole situation, but I had nothing to do with it. He was probably stealing the napkins because he couldn’t afford toilet paper.\nImage source: Raider_Scum\n#48\nHad a guy get fired for bringing a drone to work and flying it on his lunch break, at a secure facility.\nI mean how dumb can you be?\nImage source: One_Cell1547, Pok Rie\n#49\nOwners of the security company I worked for were both ex law enforcement. One was the chief of police he was fired for using city funds to fill his private vehicle. The other had some insane a**se of power charges. The one with the a**se charges is a major piece of actual s**t. He got their non profit human trafficking firm shut down because he “rescued” a woman from being s*x trafficked and offered her protection if she agreed to sleep with him instead. It came out that he was sleeping with 3 of the young female guards in their twenty’s when the 3 women settled for $10,000 each to not take it to court. He had a daughter older than me but had no shame hitting on me. Disgusting behavior and I’m still in the process of teaming up with multiple previous employees to get them shut down.\nImage source: ForeverStrangeMoe\n#50\nTrashing Hotel rooms when staying in them on company account.\nImage source: Expresso_Presso\n#51\nNew starter was fired 10 days after starting.\nI was working at the time for a self storage company in the uk, new guy turned out to be a massive racist (calling Black customers the N word after they left, calling Polish people “pieces of sh*t” etc)\nHe was defenestrated by the area manager who heard new guy say that he had his “p*ki bashing boots” in his car (while laughing).\nThe area manager (who was Pakistani) told him in no uncertain terms to “get the f**k out, and dont bother coming back”\nThat was a the last we saw of new guy.\nF**k that sh**bag.\nImage source: Mark_fuckaborg\n#52\nPizza restaurant. One of our delivery drivers picked up his girlfriend on his way back from a delivery and decided to show off. He raced someone he knew past the high school and rear-ended a parked car. He drove back to the restaurant (barely) and told the boss that someone else had hit *his* car.\nHis noisy car was easy for bystanders to recognize, with our company sign on it. Multiple witnesses called the police.\nPolice officers showed up and took the guy’s statement. He swore he was only going the posted 40 mph and that the other car wasn’t parked properly. But the evidence was very much against him, his frightened girlfriend was being honest, and the boss overheard his contradictory story.\nHe was fired for lying, for unsafe driving, and for having an unauthorized passenger while on the clock. I don’t remember what legal trouble he also faced.\nImage source: HawaiianShirtsOR, Usman Malik\n#53\nI work at a brewery and I have a ton of funny tales.\nServer girl was ‘trading’ drinks to the kitchen for food to take home. Double stealing when you think about it.\nBartender wasn’t ringing in cash sales and literally tossing the cash payments in the tip jar.\nCaught multiple people taking 4x packs out of the cooler and drinking them in the back while working and hiding the evidence in their locker.\nTwo brewers got let go for losing their temper and screaming at the boss and calling him names and one even started using racial slurs.\nI’ve worked with a ton of people who got let go because they don’t do their jobs in the most basic sense. Like had an old kitchen manager who had already been given multiple warnings told the GM that he needed to go home early that day to finish laundry, while he was drinking a beer at our bar, at 11 am. That wasn’t even the last straw, unfortunately.\nImage source: bendbrewer\n#54\nWe had a guy get fired for always having p**n playing on his 2nd monitor during the workday. This was in a semi-open office and the dude sat at the front of the office so you could see everything on his screen if you walked by.\nImage source: ZingBurford\n#55\nI worked in the medical office of my county’s jail. I was a medical officer, employed by the sheriff’s dept. Once weekly, a dentist and his assistant, who were contracted to work there as opposed to being sheriff’s dept employees, came in to treat the inmates.\nThe dental assistant was smuggling in loose tobacco and rolling papers to an inmate by hiding it in the inmate restroom trashcan. She was also giving him clandestine b**wjobs in the X-ray room.\nThe inmate sang like a pigeon in hopes of getting better accomodations (of course). The d*****s assistant was not only fired, but arrested on a class C felony for trafficking contraband. But that’s minor in comparison to the condyloma infection (genital warts) she caught from the inmate.\nImage source: AccountOfMyDarkside\n#56\nA particular receptionist was constantly on her phone at the reception desk despite being told we were not supposed to have our phones on us during our shift. She got sooooo many warnings. One day, she came in to work and was fine, happy, her normal self. About an hour later she was asking someone to cover the desk so she could go to the bathroom, she was crying. The manager came out when she came back and asked what was wrong, worried a patient had been a*****e. Oh no, not work related. Her boyfriend had been texting her and they got into a fight and she needed to go home to resolve it. They told her to go home and not come back, she had too many warnings about no phones.\nImage source: CrabbiestAsp\n#57\nWhen I worked as the Cash Loss Control Officer for a bank, I was called to a branch to investigate a large cash difference. A new teller, who was only three weeks on the job, had a significant discrepancy at the end of her shift. Her supervisor had helped her with the reconciliation, and the branch reported that all checks had been made.\nThe next day, I went to the branch and asked to see the teller’s reconciliation and microfilm copies. Within 30 minutes, I found two deposit slips for over $10,000 that were not properly processed. Both deposits were for the same customer. When I questioned the teller and her supervisor, the teller couldn’t remember the transactions, but the supervisor became very nervous.\nI contacted the customer, who told me the supervisor had personally made the deposits to repay a personal debt he owed. I confronted the supervisor, who confessed to the theft. He was immediately fired and arrested at the branch.\nImage source: Deep-Gur-884\n#58\nMy old colleague and flatmate just got fired for going on a drunken LinkedIn rant about Epstein diddling kids.\nSomehow it doesn’t surprise me this happened.\nAnother guy I worked with years ago lied about his right to work and some idiot in HR didnt bother to check. 2 weeks in he got marched out of the office acting surprised. He was a good kid, sometimes I wonder where he landed.\nImage source: DogfoodEnforcer\n#59\nCoworker was a key closer at a restaurant. After everybody had left aside from him and one female cook (everything was done, everybody should’ve left together, all 7 of them) he stayed clocked in, fried up an ENTIRE CASE of chicken tenders, split it between them in catering pans, b*ned her in the walk in, then went home.\nHe was married with kids and she was engaged with kids 🤣 she got to keep her job because she wasn’t in a “position of authority”. She got her fiance a job there like a month later and literally everybody that worked there knew what happened except for him. Somebody eventually told him and he had a nuclear meltdown.\nImage source: anon\n#60\nWorked at a place that made safes… dude used a forklift to put one in the back of his truck at lunchtime.\nCame back next morning like nothing happened.\nWas even shocked and saddened that he was fired and then arrested.\nImage source: princesschainsaw\n#61\n1. got sacked for looking up p**n not on his computer but the general managers computer. Was caught by general manager and another manager. Suspend and sacked three days later.\n2. Senior partner in firm( medical doctors) was in trouble for bullying and was under investigation when two young female staff attended his office and found him watching p**n. They reported him. He was off the property within an hour. Other partners bought him out for $800 k which was his buy in originally. Under their contract if you were sacked as a partner you got paid out what you put in. Partners sold the firm a couple years later for $7 million each.\n3. A chef at a hospital my brother in law worked at was sacked for throwing a knife at my brother in law when he complained about the food quality. He was sacked on the spot, police rang, got charged and was found guilty but then appealed in court wrongful dismissal which cost a lot just to lose.\nImage source: Milled_Oats\n#62\nStole $500 from the safe that he was fully aware has excellent camera coverage.\nImage source: Pete_maravich, Andrej Sachov\n#63\nA coworker at my workplace was slapping people’s a**es. Mostly women’s. You can imagine how fast he got fired.\nImage source: akaram369, Hurrah suhail\n#64\nSmall business. Delivery car is registered in my name. Cops called twice looking for me because someone had reported the delivery driver. I gave him the benefit of the doubt the first time, fired him after the second. I still don’t know what he did.\nImage source: Ancient_Skirt_8828\n#65\nI worked in a secured facility (security clearance required to enter), where obviously there’s a ton of security protocols. Well, a newly retired military guy in a different office than mine, a survivalist type, thought that if it’s not listed as prohibited behavior, then it’s totally acceptable behavior. Behavior such as… 😞 showing off his new tactical concealed carry vest, and how well it hid the full-sized loaded pistol he pulled out right in the middle of his fully staffed office. The dude’s flabbber was gasted when he was immediately fired like “what’d i do wrong?! I didn’t point it at anyone!”.\nImage source: GuerillaRiot\n#66\nForgot to drink water and passed out on the job, after being told/virtually forced to take water breaks where the dummy still didnt drink water or even go sit infront of the ice cold misting fan set up we had.\nBoss was gracious about it and all, took care of injury and drove them to dr and paid for it out of pocket but was seriously concerned theyd do something similarly stupid and get seriously hurt the next time (construction). If this guy was on a scaffolding set up he could have died when he fell out.\nHe let dude go, still gave him some cash at firing because boss wasnt heartless b*****d and knows he has to put food on the table.\nImage source: Dingus_Majingus\n#67\nWhen I was working at McDonald’s one of the other girls called her d**g dealer from the store phone in the managers office after her cell died so she could get a meetup set before she was off work. She was in the junior management training program and everything prior to that as well.\nImage source: Saltynut99\n#68\nWhile cashiering, they ran their employee rewards card or loyalty card for random customers so they would get the small discounts on store brands. Sounds altruistic, right? And I am sure her motives were altruistic.\nWell, *the company* didn’t think so and considered it tantamount to stealing since my former coworker continued to rack up redeemable points with these transactions. Points that only the card holder can redeem.\nAnd this is why even the UFCW discourages this practice. They don’t have an argument against the company and they can’t save anyone who’s terminated for doing it.\nImage source: Rasheverak\n#69\nShowed up to work high on m**h. For context I work in the kitchen and this is not all that unusual. What was unusual is when she became convinced that one of our takeout customers was the Antichrist and started screaming at him in tongues from the kitchen. Yeah there’s not much you can do to come back from that.\nImage source: JusticeIncarnate1216\n#70\nMost people who work for my company are idiots caught on camera for stealing. There’s a camera right above each register. It can see what you’re doing. It can see you ringing up stuff, cashing it out, getting the receipt then you refund the transaction so the till isn’t off but now you have a receipt for the item and it looks like you paid for it. They get caught every time.\nImage source: Excellent_Editor_501\n#71\nCoworker at a waste transfer station went to the site manager claiming he found a bag of c*****e, everyone got called in for a d**g test and the only guy that went positive was the guy that handed the bag in. Theory is that he dropped it and was worried he’d be seen pocketing it so he pretended he had found it on the ground.\nImage source: Hotdog_disposal_unit\n#72\nWe hired this guy because he was the son of an employee’s friend. Not the worst guy on the planet. A little dim and unsure of himself, but he was kind of a steady Eddie type.\nWell, imagine my surprise right after lunch when my bookkeeper comes into my office holding a revolver by the grip, pinched between two fingers.\nShe discovered it when she needed a PostIt note and thought, “Well, maybe Chuck has some in his desk.” Opened the lap drawer and there it was.\nI know how to shoot, but I don’t own a gun. So I emptied the revolver of bullets and shoved it in a drawer. She’s freaking out, I’m freaking out, but we don’t want the entire office freaking out.\nAbout ten minutes later, Chuck comes back from lunch. My bookkeeper could hear him frantically searching through his desk, then around his office. Then he started wandering up and down the halls with a worried look, presumably in search of his pistol. Meanwhile, I’m wondering exactly how to handle matters.\nHe passed my office on his next circuit. I called him into my office, held up the pistol and asked, ‘Are you looking for this?’\nAfter his eyes finished bugging out, he asked if he could have his pistol back. I said that I would return it to him the next day, but that he needed to go home for the afternoon while we decided what to do.\nHe left and I immediately called the landlord to notify security to never, ever allow that guy in the building again and to cancel his key fob. Meanwhile, my bookkeeper had a locksmith over pronto and issued everyone new keys.\nThe next morning, I fired Chuck over the phone and gave him a month’s worth of severance and the promise of a good recommendation letter–mainly as a way to keep him from shooting me in the parking deck sometime in the near future. His mom called me an hour later all pissed off that I fired her son (He was 25ish and his mom was calling on his behalf. That should give you a clue), and all I said was, “Well, do you want to come buy and pick up Chuck’s gun?”\nThere was several seconds of silence on the other end. And finally, the woman shouted at someone in the other room, “Did you give Chuck a pistol?” And then hung up. Last I ever heard from those guys.\nImage source: AnybodySeeMyKeys\n#73\nSlipped on a piece of carpet that was sticking out in the reception area. Put in a claim for an injury at the workplace. When we reviewed the cameras from a few days earlier they could be heard talking with another member of staff about how they were planning to fall and hurt themselves 🤦♂️.\nImage source: Proper_Juggernaut561\n#74\nBlokes wheelie bin was broken so he swapped it for the document destruction bin in the office 🤦🏻♂️.\nImage source: The_Drovers_Dog\n#75\nEating pipe dope paste. It is a sweet taste but eating was crazy to hear. He was developing sores in his mouth from it.\nImage source: Ok-Arachnid-460\n#76\nGave his car to his sister during lunch break, then stated he couldn’t come to work because of lack of car. Then stated he couldn’t work from home because his laptop was in the car.\nImage source: BowlerInside564\n#77\nCoworker was caught snoring while sleeping underneath the unit he was working on. Lol.\nImage source: CarbonGTI_Mk7\n#78\nSending death threats to me in Whatsapp.\nLike he’d k**l me if I break something on “his” truck or if some of his stuff would go missing (the truck was full of garbage and I cleaned it out first thing in the morning)…\nSend the screenshot to dispatch and never saw him again.\nImage source: Schiissdraeck\n#79\nWas told his contract wasn’t extended, came back to his position on the assembly line, and proceeded to jam a screwdriver continually into equipment for testing and tuning antenna. He was promptly escorted off premises and not even allowed to collect personal items.\nImage source: SugarInvestigator\n#80\nInappropriate jokes.\nHe was frustrating a delay by another team and asked, “Who do I need to buy a h**ker for to get this done?” Gone within the hour.\nThe sad bit was that he commented to me the day before that this place was “too perfect” and didn’t seem real, that he was “waiting for the other shoe to drop.”\nI said that this was just our culture. We respected each other and didn’t do pranks or stuff like that in the previous five or so years that I had been there at the time.\nYou can take the sailor out of the Navy, but looks like your couldn’t take the Navy out of that particular sailor. Dumb, because our boss is ex-Navy, too, and doesn’t tolerate that c**p. .\nImage source: twilightmoons\n#81\nA warehouse manager got fired for s**ually harassing a subordinate via company email.\nSomeone in my department pulled a no-show/no-call on her second day. They finally get ahold of her and she told them about a family emergency. She’s back the next week for a few days and gets injured and goes out on disability. A week after that, she’s on facebook running a half marathon. Gone.\nImage source: Commander_Cyclops\n#82\nA girl borrowed a lighter from the stock and went out for a smoke, returned it to it’s place. Got fired for stealing lighter fluid.\nImage source: speakwithintention\n#83\nWe call it turkey bacon when someone says something sexually inappropriate because a security guard we hired called himself that as like a weird stage name 💀 even bought the Velcro name tags for his vest lmfao. On the company communications chat he said something about his body count and one of the upper management got on before any of the supervisors could even respond and told him to rethink the information he shares and the dude responded with something along the lines of “why I have no shame” he also broke NDA and posted the job site on his very public TikTok while b******g about how professional he is and how unprofessional some guards are 😭 I called him out and he blocked me lmfao.\nImage source: ForeverStrangeMoe\n#84\nWhen I was a dumb 18 year old, I had a “mutual agreement to depart” with my old boss. He caught me doing donuts and wheelies on a zero turn mower. This wasn’t my first offense. So he calls me into his office and starts explaining how he has to let me go. In the middle of this, we hear a loud boom, crash, and a bunch of laughing and yelling. He ran outside and I followed behind him. Two of the other guys who were hired as summer help, and the same age as me, launched a John Deere Gator full speed off a huge pile of dirt and rolled it. He lays into them and then says to me “I’m not sure if I can fire you anymore.” I told him “It’s alright, I’m still gonna leave. Good luck with these two.”\nImage source: WhitebeltAF\n#85\nDrove through the ID checkpoint gate still smoking a joint.\nWhere I work is pretty lax about weed usage. Just don’t be s****d at work. That’s basically it. This guy literally went through the guard shack with a joint in the ashtray, still burning.\nThat being said. He was already on his way out from what I’ve been told. This just made it a lot easier.\nImage source: zylpher\n#86\nI’m a nutritionist in early childhood education, so it’s me & some ladies certified to teach, like…larval humans in a kind of charming play-school with keypad locks on every entrance/exit & lots of pretty strict & reasonable rules. We’re hosting other peoples’ offspring age 6mo-5yrs, so there’s a lot of clearance that goes into attaining a position, & your f**k ups follow you through a required state registry for early care providers.\nWe had a pre-k teacher who was a really nice girl. Maybe too nice – those 4yos absolutely ran her most days. Anyway, she didn’t even get caught smoking w**d – she plugged her w**d vape into her work laptop to charge. In the classroom, in the middle of a school day. And then forgot about it & asked the director to cover the room for her while she took a bathroom break.\nImage source: JennaStCroix\n#87\nA new chef came onboard and came out drinking with us that very first night. Needless to say he had a bit too much fun and never made it back to the boat until 8 am the next morning. He was still reeking of booze and just had time to go to his cabin and grab his unpacked duffle bag, then he was escorted off the boat. We left him there on the dock as we sailed away.\nImage source: TamtamBe\n#88\nWe do data entry, entering prescription information. We select the patient from a database, type the date, the d**g, quantity, refills, directions, select the prescriber from a database, calculate the day supply, enter the form of the prescription, then send it through.\nThis woman was clearing out duplicate prescriber information from the database. When she’d go to select the prescriber information, there would sometimes be a few different entries that looked similar, and she would delete ones that looked exactly the same.\nNobody had ever told her to do this. Nobody had ever even mentioned it.\nBut when she deleted an entry, if there were any prescriptions that were entered with that specific entry, it would cause an issue.\nBut nobody could figure out why it was happening, because nobody had ever been told to do this, so it was difficult to narrow down where it was coming from.\nShe had been doing it for *years*.\nOne day someone walked by her desk and happened to notice her in the process of deleting some prescriber information and she was pulled in and told under no uncertain terms, that she was to stop. They explained the problems she was causing, that she was never told to do this, and that if she continued, there would be more intense consequences including termination\nWELL GUESS WHO DIDN’T STOP!?!?\nI’ll never understand why, I suspect some form of ocd.\nImage source: NeedsItRough\n#89\nA grocery store chain had a grand store opening, proudly showcasing their expansive wine/liquor/craft beer department. They made a director-level hire with extensive buying experience in this field to oversee the operation from the start.\nHe showed up drunk to the grand opening, thinking no one would notice.\nImage source: its_an_armoire\n#90\nWe had a new receptionist who didn’t wear bras but would wear white t shirts, low cut tops, etc. This was a customer-facing position and we had received several complaints over her nip norps and unprofessional behaviour. Within three weeks of working there, she was b*nging the purolator guy. One morning I noticed she had a rip in the seat of her pants and let her know…she was also going commando. She seemed mortified and found something to cover up with, and I thought that was that.\nThen a week later, she’s wearing the same pair of pants but now the rip is bigger. She’s scrambling to get a sweater to wear around her waist, but finds a sewing kit. Rather than taking it to the bathroom, she decides our boardroom is the logical place to do it. She sat her bare a*s on a leather chair and sewed her pants, meanwhile narrowly missing getting walked in on by a stakeholder meeting that was happening shortly.\nOur manager learned of this and called her into her office. As she’s closing the door, all I can hear is “you know, I’m really sick and f*****g tired of hearing complaints about your clothing.” Next thing I knew, she was gone.\nImage source: Global_Push6279\n#91\nMy first job was at a fast food chain. Dude I worked with had an obvious crush on me and started using d***s (we all smoked pot back then). He called out one night, then an hour later called the business line (manager’s office) to ask to talk to me. Manager answers and knows it’s him, gives me the phone anyway. Dude asks me to go to a party with him after my shift, claiming to have some pretty heavy d***s (was never interested in him or said d***s). I decline, then hang up. Manager asks if it was Dude calling and I just rolled my eyes (not wanting to rat, but also perplexed that Dude called in the first place…plus pissed off he wanted me to take heavy d***s w him). Dude was fired the next day when the GM arrived. Byeeee!!!\nImage source: Pan_Fluid_Boo\n#92\nThey started off mooching drinks when we went out to the bar after work. Then they started hitting up coworkers to borrow their credit cards saying it was to buy concert tickets. Thankfully no one coughed theirs up. Then they applied for a transfer to the financial department where they’d have access to customers banking info. Then we finally fired them.\nImage source: tangcameo\n#93\nThey were caught looking at my bosses OF first thing in the morning.\nImage source: im-just-confused–\nFollow Us",
  "word_count": 8382,
  "scraped_at": "2026-02-14T12:13:04.226211"
}