{
  "article_id": "d8e8c390127e",
  "url": "https://www.fourfourtwo.com/features/ranked-lion-cubs-englands-20-youngest-debutants",
  "title": "Ranked ! Lion cubs : England 20 youngest debutants",
  "date": "20240331T194500Z",
  "domain": "fourfourtwo.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Ranked! Lion cubs: England's 20 youngest debutants\nOver 1000 players have represented the Three Lions since 1872 - here are the youngest post-war debutants\nThe best features, fun and footballing quizzes, straight to your inbox every week.\nYou are now subscribed\nYour newsletter sign-up was successful\nWant to add more newsletters?\nFive times a week\nFourFourTwo Daily\nFantastic football content straight to your inbox! From the latest transfer news, quizzes, videos, features and interviews with the biggest names in the game, plus lots more.\nOnce a week\n...And it’s LIVE!\nSign up to our FREE live football newsletter, tracking all of the biggest games available to watch on the device of your choice. Never miss a kick-off!\nJoin the club\nGet full access to premium articles, exclusive features and a growing list of member rewards.\nSince the first official international match on November 30 1872, over 1,000 players have been chosen by 15 managers to represent England. As the sport has developed and evolved in the intervening years with the modern game’s emphasis on stamina and fitness, the age of England’s debutants has dropped.\nConversely, all of the 15 oldest England debutants were pre-war, with the exception of 38-year-old Leslie Compton, who made his debut in 1950 and remains the oldest outfielder to win his first cap.\nWith only post-Second World War debutants taken into consideration, here are the 20 youngest players to win their first England cap.\n20. Glen Johnson (19 years, 84 days)\nCaps: 54\nHaving made his debut as a first-half sub for the injured Gary Neville, Johnson racked up a half-century of appearances over an 11-year spell. He had to wait to become a regular, but after Neville's last cap in 2007 Johnson represented England at the 2010 and 2014 World Cups as well as Euro 2012.\nAlthough he was called up by the then stand-in manager Gareth Southgate in October 2016, Johnson didn't won another cap after England's awful 2014 World Cup campaign in Brazil.\n19. Aaron Lennon (19 years, 48 days)\nCaps: 21\nThe best features, fun and footballing quizzes, straight to your inbox every week.\nWinger Lennon was named in England’s 2006 World Cup squad having never before played for England - his debut against Jamaica came after Sven-Goran Eriksson’s announcement and just before the start of the tournament in Germany.\nLennon appeared 21 times for England, losing just twice – on penalties at the quarter-final stage in Germany against Portugal and in a 2010 World Cup qualifier in Ukraine.\nDespite his relatively few international caps, he represented England at two World Cups, starting the 2010 group games against the USA and Algeria.\n18. Bukayo Saka (19 years, 33 days)\nCaps: 18\nSaka pulled on the Three Lions for his debut against Wales in a 2020 friendly that marked the second game in a row where four players made their England debuts. It went well: England won 3-0.\nSaka was the youngest among them, having only become a regular fixture of the Arsenal side the previous season. He has since gone on to become an integral part of Gareth Southgate's group, starting three matches at Euro 2020 – and, cruelly, missing the decisive penalty in the final against Italy.\nHe bounced back tremendously, though, and has continued to be one of his country's most indispensable players. Will Euro 2024 bring the ultimate redemption of major tournament glory?\n17. Rio Ferdinand (19 years, 8 days)\nCaps: 81\nFerdinand was selected for four consecutive World Cups but only appeared at two, having failed to get on the pitch in 1998 and withdrawing injured in 2010. Altogether, he played in 10 World Cup matches, with England keeping seven clean sheets.\nDespite his extensive World Cup career, Ferdinand never played in a European Championship: he didn't make Kevin Keegan's squad in 2000, was serving a ban in 2004 and England didn't qualify in 2008.\n16. Rico Lewis (18 years, 364 days)\nCaps: 1\nHaving emerged as one of Manchester City's most prodigious young players, versatile full-back Rico Lewis earned his first senior England call-up in November last year – having only made five appearances for the U21s.\nHe played the full 90 minutes as the Three Lions' drew 1-1 away to North Macedonia in their final Euro 2024 qualifier.\n15. Mason Greenwood (18 years, 340 days)\nCaps: 1\nThe Manchester United forward's first senior call-up was a bit of a mixed bag. Greenwood made his first England appearance against Iceland in the Nations League in September 2020, following a breakthrough season at Old Trafford, netting 17 goals in 49 games.\nBut he and Manchester City's Phil Foden broke quarantine procedures in place for the squad to prevent a coronavirus outbreak by inviting two women back to the team hotel.\nGreenwood, currently on loan at LaLiga outfit Getafe, has not played for England since, with his international career rather up in there in light of the 2022 charges against him (which were later dropped).\n14. Kobbie Mainoo (18 years, 339 days)\nCaps: 2\nManchester United prodigy Kobbie Mainoo only made his first Premier League start in November 2023, but it didn't take him long to catch the eye of England boss Gareth Southgate, who named him in his squad for March 2024 friendlies against Brazil and Belgium.\nThe defensive midfielder came off the bench in the first game then started the latter, and there have been calls for him to start at this summer's Euros.\n13. Alex Oxlade-Chamberlain (18 years, 284 days)\nCaps: 35\nOxlade-Chamberlain was named in Roy Hodgson’s Euro 2012 squad before he’d made his international debut. His first appearance came a fortnight after the announcement of the 23 players selected for the tournament in Poland and Ukraine when he came on as a substitute in a warm-up against Norway.\nHe made his full debut days later in a victory over Belgium and started in England’s first group game against France.\n'The Ox' was called up for the World Cup in 2014 but didn’t feature, before missing the 2018 World Cup with injury. Now 30 and playing in Turkey for Besiktas, he's unlikely to earn any more caps.\n12. Luke Shaw (18 years, 236 days)\nCaps: 21\nShaw twice replaced Ashley Cole: on his debut in a 1-0 friendly win over Denmark, then in the 2014 World Cup squad, prompting Cole’s international retirement. He became the youngest player to appear at the 2014 World Cup and, after an underwhelming few years, has rediscovered his best form at Manchester United.\nIn the final of Euro 2020, Shaw put England ahead against Italy in record-quick time, scoring inside two minutes at Wembley. He then started all five games at the 2022 World Cup, and he looks set to be first-choice left-back at Euro 2024 if fit.\n11. Jack Wilshere (18 years, 222 days)\nCaps: 34\nJack Wilshere's England story typifies his career. He made his debut at 18 amid great expectations but was limited to just 34 caps in six years as injuries hindered his progression.\nIn a 2013 friendly encounter at Wembley, Wilshere's excellence against Brazil drew comparisons to Paul Gascoigne, but his influence waned in subsequent seasons.\nWilshere's last international appearance came in 2016. He hung up his boots earlier this year, aged just 30.\n10. Marcus Rashford (18 years, 208 days)\nCaps: 60\nRashford became the youngest ever Englishman to score on his debut when he volleyed home after just 138 seconds against Australia at the Stadium of Light. He had made his first-team debut for Manchester United just four months earlier and such was his impact he was called into the England squad for Euro 2016, making two substitute appearances.\nAfter featuring for the Three Lions at the last three major tournaments – scoring twice at the 2022 World Cup – he'll be optimistic of keeping his place in the squad for this summer's Euros.\n9. Jadon Sancho (18 years, 200 days)\nCaps: 23\nLooking for more chances for first-team appearances, Sancho swapped Manchester City for Borussia Dortmund in 2017. He established himself as one of the best young players in Europe during his time in Germany, before joining Manchester United in 2021.\nSancho made his maiden England appearance in a 0-0 draw with Croatia in the Nations League in 2018 and his taken his tally of caps up into the 20s – but a disappointing couple of years with United have seen him fall out of international favour.\n8. Duncan Edwards (18 years, 182 days)\nCaps: 18\nBusby Babe Edwards became the youngest player to play in the top flight of English football in April 1953 when he made his Manchester United debut aged 16 years and 185 days.\nHe played his first England game two years later, almost to the day, in a Home Championship encounter with Scotland – the first of 18 appearances before his untimely death in the aftermath of the Munich air crash, aged just 21.\nIn a professional career of less than five years, he helped United to two league titles, two Charity Shields and the semi-final of the European Cup, playing over 150 matches. In his 18 England appearances he scored five goals.\n7. Micah Richards (18 years, 143 days)\nCaps: 13\nEngland’s youngest-ever defender, Richards made 13 appearances for the national team – all before his 24th birthday. The Manchester City defender played the full 90 minutes on his debut, a 1-1 draw against the Netherlands, and played seven of the 12 matches in the doomed Euro 2008 qualifying campaign.\nFollowing Steve McClaren’s departure, Richards won what turned out to be his final cap in caretaker Stuart Pearce's only game – again, against the Netherlands.\n6. Callum Hudson-Odoi (18 years, 134 days)\nCaps: 3\nHudson-Odoi came on as a substitute to play the final 20 minutes of a 5-0 Euro 2020 qualifier victory over the Czech Republic, becoming the youngest ever player to make his England debut in a competitive fixture.\nThree days on, he became the second-youngest ever player to start a competitive match for England, after Wayne Rooney.\nHudson-Odoi has not played for the country of his birth since 2019, leading to reports that he could switch his international allegiance to Ghana.\n5. Michael Owen (18 years, 59 days)\nCaps: 89\nOwen will forever be remembered for his impact at France 98. By the time his international career came to an end 10 years and 42 days later, he had captained the side nine times in 89 appearances for England, more importantly bagging 40 goals – putting him sixth in the list of all-time top goalscorers for the Three Lions, behind only Wayne Rooney, Harry Kane, Bobby Charlton, Gary Lineker and Jimmy Greaves.\nOwen is one of only 11 Englishmen to represent their country at three World Cups, following his French breakthrough with campaigns in in South Korea and Japan in 2002 and Germany 2006.\nHe also played at Euro 2000 and Euro 2004, with his goal against Portugal at the latter making him the only England player to score in four major tournaments.\n4. Raheem Sterling (17 years, 341 days)\nCaps: 77\nSterling's debut was somewhat overshadowed by Zlatan Ibrahimovic, who scored all four of Sweden's goals including a barely credible overhead kick. Sterling had to wait until March 2014 for his second cap, where he put in a Man of the Match performance against Denmark at Wembley.\nSterling’s form saw him selected for the World Cup in Brazil later that year, where he played a part in all three group games as England disappointed. Sterling’s influence began to increase throughout the Euro 2016 qualification campaign, contributing two goals in eight appearances as England won every game en route to the final tournament in France.\nThough he played at the 2018 World Cup – where England, you won't have forgotten, got to the semis – it wasn't until October of that year that he broke a 27-game dry spell for his country with two goals in a 3-2 victory over Spain. Sterling was back to his best at Euro 2020, where he was England's standout performer.\n3. Jude Bellingham (17 years, 137 days)\nCaps: 29\nHaving made the well-trodden path from Birmingham City to Borussia Dortmund in 2020, Bellingham had just four Bundesliga appearances under his belt when he made his way out onto Wembley's hallowed turf for his England debut. Bellingham came on for the final 17 minutes of a routine friendly victory over the Republic of Ireland, with the Three Lions already 3-0 up.\nAfter helping England to the final of Euro 2020 mainly as a substitute, Bellingham was one of the first names on the teamsheet by the time of the 2022 World Cup – where he scored his first international goal and the Three Lions' first of the tournament.\nAlready established as one of the best midfielders in world football at the age of just 20, the stage is set for the Real Madrid star to take Euro 2024 by storm.\n2. Wayne Rooney (17 years, 110 days)\nCaps: 120\nA fresh-faced Rooney made his debut against Australia in February 2003. When he called time on his England career almost 14 years later, he’d won 120 caps, scored 53 goals and captained the team on 22 occasions. It could have been very different had Rooney accepted an offer to play for the Republic of Ireland, who approached him at the age of 16.\nHis critics will point to his poor return in major tournaments, with his strike against Uruguay in 2014 his only World Cup goal in 11 appearances. His record is markedly better in European Championships with six in 10 matches, but it will be a source of regret that he was unable to replicate his vast haul of club silverware with the national side.\n1. Theo Walcott (17 years, 75 days)\nCaps: 47\nSven-Goran Eriksson raised more than a few eyebrows when he selected Theo Walcott in his World Cup squad in 2006. The 17-year-old had made just 13 first-team appearances in his career and none since joining Arsenal the previous January. Despite fitness concerns over Wayne Rooney and Michael Owen, Walcott didn’t get on the pitch in Germany.\nEriksson defended Walcott's selection over the likes of Darren Bent and Jermain Defoe, claiming it would stand him – and England – in good stead for forthcoming tournaments. Given that Walcott has only played in four matches for England at major tournaments – and none at a World Cup – history has not proven Eriksson right.\nSince his debut against Hungary in 2006 Walcott has appeared 47 times for England, but, perhaps indicatively, he has only completed 90 minutes for the national team on four occasions.\nMore on England from FourFourTwo\nENGLAND EURO 2024 SQUAD Gareth Southgate's full squad for the March internationals\nLIST The best English players ever\nQUIZ! Can you name the last 50 countries England have played in friendlies?",
  "word_count": 2484,
  "scraped_at": "2026-02-14T13:30:37.611778"
}