{
  "article_id": "d8f0fa785b6c",
  "url": "https://www.the42.ie/chiedozie-ogbene-ireland-3-6332213-Mar2024/",
  "title": "Ogbene next chapter in story that has already captured hearts and minds",
  "date": "20240321T203000Z",
  "domain": "the42.ie",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "THE GETTING TO know you phase of the relationship with Chiedozie Ogbene has been an enjoyable one.\nEven if it now feels as though it is over and expectations have changed.\nAll of those early milestones and standout moments that helped form an opinion are behind us.\nThe signs are good; this one can last the course.\nThe Cork man’s talent, worth ethic and ability to affect games for the Republic of Ireland have made him a pivotal player for these upcoming friendlies and, of much more importance, the Nations League campaign that will soon be on the horizon for whoever the FAI name as the permanent manager.\nHe is a player who has continually shown a willingness to take on greater challenges, and then rise to them.\nHe has thrived with Luton Town in the Premier League this season, the first signing by manager Rob Edwards last summer after he had caught the eye while helping Rotherham United earn promotion from League One.\nOgbene is not just someone who has shown he can stand out among the elite with eye-catching pace and directness. Equally as important in England’s top flight is how he also fits right in because of his discipline and tactical awareness.\nThe derogatory description of “a speed boat with no driver” that often does the rounds for pacey players who can’t deliver the final product when it matters, or follow specific orders defensively, has been utterly dismissed by Ogbene.\nHis display in the Euro 2024 qualifier this time last year, helping to keep Kylian Mbappe under wraps in Dublin while also giving Theo Hernandez trouble going the other way, is a prominent example in a green jersey.\nIn the Premier League this season we’ve also seen it with four goals – among them one against Liverpool at Anfield – while his all-action display from right wing-back in a thrilling 4-4 draw away to Newcastle United seemed to catapult him into a more mainstream discussion.\nJamie Carragher’s analysis on Monday Night Football played a key role in that, likening Ogbene’s pace to Thierry Henry.\nHe turns 27 in May but the nature of his ascent as a senior international during his mid-20s means it’s only really since he emerged on the scene under Stephen Kenny in the summer of 2021 that Ireland fans got a sense of what was possible.\nKenny had an idea of the potential since their days in the League of Ireland, when the former Dundalk boss tried to bring Ogbene to Oriel Park.\nBy that point, he was already bound for Brentford in the English Championship having first broken on the domestic scene with Cork City before making the decision to leave for Limerick to play regular football in 2017.\nIn November of that year, he had a week-long trial at Chelsea.\nA few months later, Brentford made their move.\nHis self-belief was vindicated.\nAs Ogbene’s profile increased here, his story captured hearts and minds – especially as he rose in prominence for Ireland.\nIn interviews he spoke candidly about leaving Nigeria at the age of eight and moving with his family to Leeside. They settled in Grange on the southside of Cork and one of his closest friends from childhood remains women’s senior international Saoirse Noonan.\nOgbene loved GAA and football, choosing to pursue the latter, even if his mother and father, both of whom are nurses by profession, preferred for him to follow his brother Uche’s lead. Chiedozie was supposed to be a doctor but the way in which he has chosen to follow his own path has continued to inspire.\nWhen he came on as a substitute against Hungary in June 2021, he became the first African-born player to represent the senior Ireland team, an honour he later said he felt “blessed” to hold.\nAs the years went on and his influence rose, Ireland fans would have felt blessed.\n“We all have one agenda – to win for the nation,” Ogbene told the Irish Times in January 2022.\n“And, at the same time, you are doing your family proud. We came to Ireland, to a different culture, different surroundings, and the way I have been accepted really did bring tears to my mother’s eyes.\n“You see how people treat her in Cork. She feels famous. It is really nice for her to feel included in the society.”\nWhat happens next for Ogbene at club level will, naturally, have a follow-on effect with Ireland.\n“His career is only going in one direction,” Ireland centurion Kevin Kilbane wrote in his Irish Times column earlier this season.\n“I cannot wait to see what he does over the next three, four years. He has the confidence, the touch, the pace and by all accounts the mentality to succeed. There is no reason why he cannot aim for Champions League football.\n“And not necessarily with an English team. It’s his versatility, the ability to play left or right, as an attacker or wing-back that will earn him a lucrative deal.”\nA new chapter is about to be written for Ogbene, by which point a new Ireland manager will be another influential character.",
  "word_count": 857,
  "scraped_at": "2026-02-14T12:47:03.415885"
}