{
  "article_id": "d8fd27644246",
  "url": "https://www.burntorangenation.com/2025/1/24/24351338/longhorns-daily-news-texas-bevo-birthday-cfp-sec-tennessee",
  "title": "Longhorns Daily News : Texa Bevo turns 10 this week",
  "date": "20250125T001500Z",
  "domain": "burntorangenation.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Bevo VV — the 15th edition of the Texas Longhorns mascot — turns 10 years old this week.\nLonghorns Daily News: Texas’ Bevo turns 10 this week\nPlus: Texas WBB beat Tennessee last night\nHe’s been on the job since Bevo XIV passed from cancer back in 2015.\nHappy birthday, Bevo.\nWHAT THEY’RE SAYING ABOUT THE LONGHORNS\nAustin American-Statesman: Barryn Sorrell draft profile: NFL scouting report for Texas edge\nAustin American-Statesman: Texas softball releases final schedule details: Here’s opening day\n247Sports: Sources: Steve Sarkisian looking to add an assistant to his football staff\nInside Texas: Texas 2025 roster audit: What sources say about Arch Manning, Trey Owens, KJ Lacey\nInside Texas: Which players will be the hardest to replace from the 2024 Texas Longhorns?\nInside Texas: The ideal offensive line makeup to balance attitude and technique\nICYMI IN BURNT ORANGE NATION\nRECRUITING ROUNDUP\n247Sports: Four offer candidates visiting Austin for Texas’ Junior Day\n247Sports: Five key visitors for the Longhorns from this weekends’ junior day\n247Sports: A potential new storyline for Texas’ 2026 class\nInside Texas: 2026 Texas OL target Papungatoa Katoa talks relationship with coach Kyle Flood and upcoming Junior Day visit\nInside Texas: Texas Longhorns aggressively pursue top 2026 defensive line talent nationwide\nInside Texas: Top 2027 QB target Peyton Houston ready to see Texas again\nSEC SHOWDOWN\nAustin American-Statesman: Vic Schaefer’s impressed with Lady Vols despite Kim Caldwell’s absence\nDallas Morning News: Texas, Texas A&M, Oklahoma rank among the top 10 most valuable college football programs\n247Sports: Five keys for Texas to avenge its previous loss to Texas A&M\nGood Bull Hunting: Ranking the way too early top 25 rankings\nRock M Nation: MBB Preview: Mizzou returns home for a battle with Ole Miss\nRed Cup Rebellion: The Aggies stun the Rebels at home\nRocky Top Talk: Tennessee announces date for Orange and White game\nRoll ‘Bama Roll: Alabama Football: Meet the new guys 2025\nA Sea Of Blue: Caleb Wilson secretly committed to North Carolina over Kentucky in December\nWHAT WE’RE READING\nSB Nation: MLB free agency is so broken a salary cap would actually help\nSB Nation: Everything you need to know ahead of South Carolina-LSU matchup in women’s college hoops\nSB Nation: Every NFL coaching hire in 2025, graded so far\nNEWS ACROSS LONGHORN NATION AND BEYOND\n- Texas women’s basketball beat Tennessee last night.",
  "word_count": 391,
  "scraped_at": "2026-02-14T13:41:45.744302"
}