{
  "article_id": "d905f75d752b",
  "url": "https://www.bbc.co.uk/sport/football/67543580",
  "title": "Lionel Messi : Inter Miami forward is  gripping  United States , says Guillem Balague",
  "date": "20231127T210000Z",
  "domain": "bbc.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Lionel Messi: Inter Miami forward is 'gripping' United States, says Guillem Balague\n- Published\nRoll up, roll up and welcome to the Lionel Messi show, currently the hottest ticket in the USA. A flash in the pan or finally a changing of the guard in American sport?\nAmerica is in the grip of Messi madness after he signed for Inter Miami from Paris St-Germain in the summer. Football in the country has been here before. But never quite like this.\nHis move to the United States was as reasoned, calculated and well planned as his departure from Barcelona to Paris was clumsy, rushed and unwelcome.\nThe timing could not have been better with the Copa America taking place there next year and the final set to be played in Miami at the Hard Rock Stadium on July 14. The Club World Cup is due to be held in the States in 2025, and what will be the biggest World Cup yet is coming to the USA, Canada and Mexico in 2026.\nWhen it comes to a well-oiled machine looking to promote and grow a brand, nobody does it better than the USA. With all this marked in, plus the possibility that the country could also be hosting the next Women's World Cup in 2027, it's safe to say that if football - sorry, soccer - doesn't take off in the USA after all that, then it is difficult to imagine when it ever will.\nWill the arrival into Major League Soccer of Messi, regarded by many as the greatest player in the history of the game, finally burn an indelible brand into America's sports-mad psyche and establish its place alongside team sports like American football, basketball or baseball, or will it turn out to be another false dawn?\nHow has Messi's arrival changed Inter Miami and the MLS?\nIf there's one thing American sports fans adore more than the teams they support it is the passion they feel for superstars playing for them. Think Michael Jordan, Tom Brady, Wayne Gretzky and you get the idea. Now add the name Lionel Messi.\nThe New York Red Bulls have offered a special offer holiday ticket promotion involving next season's home opener and the derby against rival New York City FC. But there's a catch. If the first match sees them drawn against Inter Miami, it won't count as part of the deal. Written in small print alongside the offer are the words, \"If RBNY plays Inter Miami CF in the home opener, each home opener ticket will be replaced with a ticket to RBNY's 2nd home match.\"\nThe name 'Lionel Messi' doesn't feature but then it doesn't really have to. Surely no team will be including Inter Miami tickets in cheap seats deals in the new season.\nNo-one at club or league level was prepared for the effect Messi's signing would have on them.\nSeason ticket packages for next season are coming out at double what they were in 2023, which makes Inter Miami one of the most expensive tickets in the world - and this for a league not generally considered to be among the top level worldwide.\nThe club's Instagram account has gone from one million followers to 15 million.\nIf you want to catch the little magician when Inter Miami play away from home be prepared to dig deep.\nFor example, if you had wanted to watch Columbus Crew this year you could do so for as little as $40. Next season they will be charging a minimum of $382 for a seat in the 'nosebleed' section for the visit of Inter Miami, going up to $680.\nIf you happened to be in Orlando visiting Mickey Mouse and fancied catching a game, then last season you could have watched the locals for around $97. If you're in town when Leo visits Orlando City next season, be prepared to shell out more than $1,500 for a seat on the secondary market.\nThe atmosphere at games borders on the surreal. No-one is really watching the game other than through the participation of Messi.\nIf he is 50 metres from the ball everyone is still watching him. When he walks up to take a corner it is celebrated almost like a goal. It is almost like watching an event, a happening, that is occurring within another event.\nWhat about buying a shirt then? Good luck!\nSuch is the frenzy for buying replica shirts that Adidas are struggling to meet demand in certain sizes. Even for next season.\nAnd if you can find a shirt - and apparently even Inter Miami co-owner David Beckham has been finding it tricky to get some to give to people as gifts - there is logically a dearth of the numbers 1 and 0 and the letters M, E, S and I.\nPre Messi, Inter Miami had a stadium with plenty of empty seats. An extra stand was built to accommodate demand for when he arrived.\nNew stadium and new approach from all involved with Inter Miami\nConstruction has now begun on the Inter Miami CF stadium, set in a 58-acre public park, and scheduled to open in 2025.\nThe team's budget has gone from $60m to $300m and tickets are sold out within minutes whenever Inter Miami play - home or away.\nMichelle Kaufman has been a sportswriter for around 35 years, most of which has been spent writing predominantly about soccer for the Miami Herald.\n\"My life was a lot quieter and less complicated before this man arrived in my life,\" she told me when we met up recently in Miami at a Soccerex exhibition.\n\"I'm spending about as much time focusing on him as I am my husband which is probably not a good thing.\n\"There is a Messi cult following that I have never seen before. I am doing a podcast on him and I have people watching it from Gabon, from Tangier [in Morocco]. I'm looking at the map and wondering where these countries are.\"\nThe Inter Miami press office has never had to deal with anything like it - not only the best player in the world, but also a celebrity.\nSo how are things going for Messi since he arrived?\nMessi certainly hit the floor running.\nIn front of a capacity crowd of 20,000, including the likes of LeBron James, Serena Williams and Kim Kardashian watching on from luxury suites, he scored a stoppage time free-kick winner to seal a 2-1 win over Liga MX side Cruz Azul.\nWhen he arrived the team were languishing at the bottom of the MLS table.\nLess than a month after his arrival, he scored a screamer to earn a draw against Nashville in the Leagues Cup final to secure the club's first piece of silverware after a 10-9 win on penalties.\nBuoyed by cup success, Messi's Miami went on a 12-match unbeaten run to force themselves into contention for a play-off place that would have been almost unthinkable when he arrived.\nIn the end it was a bridge too far, especially after a muscle injury caused Messi to miss six games in September and early October.\nThis is now a side transformed after a roller coaster of a campaign. Failure to make it into the play-offs means he can now look forward to the longest holiday break he has ever had.\nHe will have about a month and a half off, although that will be interspersed with games for his country. The dream for many football fans is that Messi will remain in contention for Argentina at the 2026 World Cup.\nOff the pitch, things are going well, although the US media expected more appearances from him.\nHe did only one press conference when he arrived and sports media are used to more regular contact. That said, he has spoken more than ever, twice after a game for Apple TV, five individual interviews after the August press conference, as well as in the big presentation on his arrival.\nIf the media want more from him then they are going to be disappointed.\nMessi, the Inter Miami captain\nHe now has the captain's armband, although it was not what he wanted but rather something that was thrust upon him.\nAnd with the surging demand for anything Messi-related that can fill column inches and air time, going out in public is proving difficult. When he first arrived he was pictured visiting the supermarket. This is no longer possible because everybody knows he is in town, even those that do not follow football.\nMeanwhile, he is committed to the Miami cause. He flew to Paris for the Ballon d'Or ceremony, arriving at 8am on the Monday and flying back to Miami immediately afterwards in the first minutes of the Tuesday to be back for training.\nHe has also joined the players' Whatsapp group, where he has shared some of his match tickets with those that need them. He even handed a penalty to his team-mate and forward Josef Martinez because he had been going through a spell without scoring.\nAt home, his wife Antonella is helping him settle, finding things out about Miami, such as the best places to eat and enjoy, as well as honing his look and his image off the pitch. He is more confident these days, he has found his place in the world.\nThey were no strangers to Miami and the Messis have got an impressive property in the area that they have rented for years.\nHe has been reunited with former Barca team-mates Jordi Alba and Sergi Busquets, while Luis Suarez will almost certainly also soon join them.\nHis time in Paris was not the happiest of his life. The fans didn't get him. But now things are different and his next club target will be to go looking for victory for Inter Miami in MLS.\nThe future of MLS and the importance of Messi in guaranteeing it\nDespite great personalities and events like the 1994 World Cup, football has never really 'arrived' in the USA to the extent that many thought that it would.\nHow big is the arrival of Messi in MLS? Fernando Palomo, ESPN sports anchor and one of the most respected commentators on football, has no doubts: \"It is one of the biggest revolutions in the world of sport that this country has seen in decades,\" he said.\nBut even he stops short of confirming that the Argentine superstar's arrival into MLS will prove to be the game's upward tipping point.\nHe said: \"I live in a small town in Connecticut and people that don't talk to me about football have approached me not only to talk about football but to tell me that they have already bought the Messi jersey, which kind of tells you where it's landed and how it's impacted this game.\"\nPalomo adds it is much bigger than when Beckham came over but that \"time will tell\" if it really makes football in America take off.\n\"At least the game is in a better place than it ever has been,\" he said.\nUltimately, American sports fans' emphasis on the individual rather than the team could make it difficult for the game to grow to where many believe it should in the United States.\nIn the meantime, let's all enjoy the ride.",
  "word_count": 1889,
  "scraped_at": "2026-02-14T14:08:50.572665"
}