{
  "article_id": "d90b5a2f4e43",
  "url": "https://theathletic.com/live-blogs/chelsea-dortmund-champions-league-live-scores-updates-results/IW7kJJGaTs8a/",
  "title": "Chelsea vs Dortmund live updates : Champions League start time , streaming info , line - ups and team news",
  "date": "20230307T180000Z",
  "domain": "theathletic.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Advertisement\nHow Chelsea overcame first leg deficit to beat Borussia Dortmund, advance to Champions League quarter-finals\nSummary\nChelsea have beaten Borussia Dortmund 2-0 in the second leg of their Champions League matchup in the round of 16, advancing 2-1 on aggregate to the quarter-finals.\nRaheem Sterling broke through for Graham Potter's men with his strike in the 43rd minute, blasting the ball into the back of the net on his second try after fluffing his first shot.\nKai Havertz put the hosts in front on aggregate with a penalty in the 53rd minute. He originally hit the post with his first attempt from the spot, but was given a second chance after Dortmund were penalised for encroaching the area before he shot.\nCan: 'We lost because of the referee'\nEmre Can has criticised the referee in the aftermath of his side's loss: \"We didn't deserve to lose, but we lost because of the referee. Giving the penalty back to be taken like that, how is that possible? I don't understand it. The referee was very bad today. The way he talked to us was arrogant.\"\n(All photos by Getty Images)\nBellingham: The penalty retake 'was a joke'\nJude Bellingham has spoken to BT Sport about Chelsea's penalty: \"From where I was it looked very close. I'm not sure what more he can do with his hands.\n\"I don't want to get in trouble, I've paid enough (fines).\n\"It was disappointing. The fact they had a retake was a joke. When you have such a slow run up you're always going to have players encroaching into the box by a yard or so.\"\nTerzic: 'We don't want to compete with Chelsea in the transfer market'\nEdin Terzic has also spoken to BT Sport: \"Fair play to Chelsea and congratulations.\n\"Both games were very close for both teams but, at the end of the day, they deserved it.\"\nOn Chelsea's penalty: \"I'm responsible for the performance of our team. I don't want to talk about the referee. I thought it was a tight call and a tight decision.\n\"I think the first 10 minutes you can feel the power not just from Chelsea but from the stadium. After that, we came back into the game but they managed to score and we didn't.\n\"We had a clear chance through Bellingham and only had a couple of counter-attacks to defend. We didn't create much later and that's the problem.\"\nOn Julian Brandt going off injured: \"We adapted well and Gio (Reyna) came in to take over the position. We have enough quality in the team. We don't want to compete with Chelsea in the transfer market, we want to do it on the pitch.\"\nTerzic: Both sides deserved to advance\nEdin Terzic has spoken to Amazon Prime Video: \"It's a tough result to accept. We're very disappointed.\n\"They were two very tight games. In the second half we produced a very dominant performances and created a lot of chances. In the end, though, it wasn't enough.\n\"We have to say, over the course of two games, Chelsea deserve to go through. But we would have deserved to go through too as it was two games that were very evenly matched.\"\nBenfica join Chelsea in last eight\nBenfica crushed Scott Parker's Club Bruges in Portugal in the night's other Champions League match, running out 5-1 winners to advance 7-1 on aggregate.\nCucurella man of the match\nGraham Potter made a big call bringing Marc Cucurella into his starting line-up tonight, and it definitely paid off as the defender earned the plaudits.\nPotter: 'We deserved to go through'\nGraham Potter had more to say to BT Sport: \"We have to recover and prepare for Saturday when we play Leicester. It is great for the boys, two clean sheets after a tough period. You get that in life and it is about how you respond and the players have been fantastic.\n\"It was important we put pressure on them and get the crowd with us. It is not easy to do because they are a top team playing with confidence.\n\"Credit to the players. They gave everything and over the two games I thought we deserved to go through.\"\nPotter: 'The boys played fantastic'\nGraham Potter has also spoken BT Sport, who asked him how he's feeling: \"I'm not sure! There is a lot of emotion in the end. It was tense in the end but the boys played fantastic. I am delighted for them to get the win and great for everyone here.\"\nOn what he knew about the penalty: \"Not a massive amount to be honest. I knew they had encroached. It was him or Reece (James). Sometimes they have to feel it on the pitch. Obviously we have confidence in Kai (Havertz). I wasn't watching it but delighted when I heard the roar.\n\"Taking penalties is not for me, so I am in awe of anybody (who does).\n\"There was a fantastic feeling in the dressing room. We have been through a tough period and this competition means a lot for us. We wanted to progress and get into the last eight and it sets us up for the next few weeks.\"\nHavertz: I was nervous to retake penalty\nKai Havertz has also spoken to BT Sport: \"I don't know what I was thinking (on his first penalty attempt) but the referee let me retake the penalty. I was a bit nervous but I scored. I tried to wait and look at the keeper and the second one was a bit easier.\n\"The last two weeks were hard, we lost a lot of games.\n\"Tonight was important. This is a big tournament and it's the last trophy that we can win.\n\"We showed character and that we want to keep going.\"\nSterling: 'We had to dig deep'\nRaheem Sterling has spoken to BT Sport: \"It was a massive performance. We had to dig deep. We took our chances. We felt as a team we could do it.\"\nOn his goal: \"I had a little miskick with the first touch but it landed perfectly and allowed us to build on that for our performance.\"\nOn Kai Havertz retaking the penalty: \"I thought about taking it the second time but I was so confident in Kai to put it in the back of the net.\"\nPotter matches Robson\nGraham Potter has become just the second English manager to win five Champions League games in a single season, after Bobby Robson won five with Newcastle in 2002-03.\nComeback kings\nChelsea have now advanced in five of the eight Champions League knockout stage ties in which they lost the first leg away from home.\nDortmund's European road woes\nBorussia Dortmund have now lost eight of their past nine away games in the Champions League knockout rounds.\nThe German club has also lost each of their past six away games in the competition against English sides.\nNot Dortmund's day\nBorussia Dortmund's 10-game winning streak in all competitions comes to an end.\nThis is only the second time the club have failed to advance in a Champions League knockout tie after winning the first leg in seven such instances.\nWhy Havertz was allowed to retake penalty\nKai Havertz's penalty proved to be the difference in this tie, but why was he given a second chance from the spot after hitting the post with his first attempt?\nThe Athletic has all the answers below.\nHuge result for Chelsea\nChelsea have done it. Who would have thought it?\nWhat a big night for Potter, the players, the fans and the club.\nFT: Chelsea 2-0 Borussia Dortmund, Chelsea win 2-1 on aggregate\nChelsea have done it!\nPotter on edge\nI'm surprised Potter hasn't pulled a muscle in his arms, he has been waving and gesticulating wildly to his players for several minutes. He's feeling the tension.\nWolf shot blocked\n90+5‘ Chelsea 2-0 Borussia Dortmund\n(Chelsea lead 2-1 on aggregate)\nWolf has a big chance in front of goal but can't find a way through traffic.\nChilwell draws a foul in Dortmund's half and the visitors are running out of time.\nTeam Stats\nCHE\nBVB\nGame Details",
  "word_count": 1364,
  "scraped_at": "2026-02-14T11:59:33.492077"
}