{
  "article_id": "d927a929848f",
  "url": "https://www.sounderatheart.com/2026/01/preseason-for-the-fans/",
  "title": "Preseason for the fans",
  "date": "20260117T200000Z",
  "domain": "sounderatheart.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Players have off-season fitness routines, maybe some film to study, a few have injury recovery or minor surgeries. They come into camp in the best shape of their lives, ready to learn the tweaks to the system and their new teammates. For the players and coaches preseason is a job preparing them for trophies.\nFor fans, preseason is an opportunity for hope, optimism and planning. Here are some key steps a fan can take during preseason.\nMeet the new guys\nThe Sounders signed Hassani Dotson as a free agent, a mostly defensive midfielder who also plays as a right back or forward or pretty much anywhere. His comps in his last healthy season are similar to Cristian Roldan at the same age. Raised in Federal Way and spending college at Oregon State under Terry Boss, Dotson spent his first years in MLS with Minnesota. Now he's back home.\nSeattle took on loan U22 Nikola Petković from Charlotte. The young Serb started his U.S. time with Charlotte's Next Pro team and was dominant. But when leadership changed in Charlotte Petković struggled to see the field as a tweener not seeing much time with either the first or second team. He's more of an 8, with a bit of bite and creative bent. His peak is to be a surging goal threat from a deep line. If he doesn't work out here he's back to Charlotte. If he does work out he's still cheap.\nDepth acquisitions included former UW centerback Ryan Sailor who burst into a starting role in year one with Inter Miami, but then became a spare part in their star-studded organization. Sailor will compete with Kim and Hawkins for time as the third CB. They also added Max Anchor, a Canadian Youth National Team keeper who was on waivers from Vancouver Whitecaps. Anchor was quite good with Pacific FC while on loan to the CPL club.\nTwo Defiance players rose the ranks, extending the annual tradition of restocking from below. Yu Tsukanome is an attacking mid/forward in the mold of modern Ferreira who crushed Defiance scoring records last season. Sebastian Gomez is an attacking/central midfielder who does a bit of everything required when asked. Gomez is an HGP.\nStart making transit plans\nThis may seem early, but Puget Sound is going to have extensive construction both on the roadways and for mass transit in the rush to host the Men's World Cup. Take a gander at the Sounders and Reign schedules (which include trips to alt-home ONE Spokane) to figure out how you'll get to the games.\nThen be prepared to adjust that plan. The World Cup is going to impact the spring months in ways we'll learn throughout the year. You should also expect more visitors – tourists of course, but also business leaders, foreign dignitaries, national team staff assessing the area, security personnel and others. SoDo will be crowded as the weeks advance.\nAdjust your subscription settings\nMaybe there are newsletters you want to get during the season – Sounder at Heart and Ride of the Valkyries give you control of what kind of emails you want. Maybe you want to support the site, maybe you want a magazine. It's up to you. This is your home for Puget Sound pro soccer. Maybe you want to join a wine list.\nIf you are super passionate and/or travel to games you may want to join ECS and the Royal Guard. I enjoy getting the ECS prematch newsletter for hype every game.\nFor the Sickos\nThe tactics will probably be tweaked. Paul Arriola is back and the club may use sets that seem more like a 3-back in defense, or play like a 2-back in the attack with wider bands high.\nHow will you know? By getting up extremely early to watch preseason games from Portugal and Spain. These matches are usually late morning in Iberia, so around 4 a.m. PT.\nOr by reading Sounder at Heart. We'll have sickos up to cover the games and more... you want that more? Subscribe to Sounder at Heart and join the Discord.\nMost of all, fandom with hope\nThe rare times the Seattle Sounders didn't compete for a trophy (final four or two wins off the Shield or qualifying for Champions League/Cup) were 2023, 2018, 2015, and 2013. This is a club that makes the playoffs and usually makes a run, and of course they are strong in non-league play.\nFor the past season and a half the home games feature an attack where confidence in scoring should be high. There's flair players, speed players and something amazing regularly.\nIn this chaotic world you can unify with your community behind teams that play a game beautifully while winning. Your community is on the field as well – the homegrowns are from the 206, the 253, the 425, the 360. They went to the schools you went to, shop where you shop.\nAnd they win. A lot.\nHay fe.\nUse our affiliate links to support your bloggers when buying merch and tickets.\nCatching up on Sounder at Heart\nHere's what you missed on the site this week.\nSounders\nNext match: Sunday, February 22, 2026 v. the Colorado Rapids | 6 p.m. PT | Apple TV/FS1\n- The 2026 Sounders preseason is underway\n- Lobbing Scorchers: Seattle Sounders are Playing In Spokane?\n- Sounders acquire $800k in GAM in two separate trades\n- Realio’s Ratings: Seattle Sounders vs. 2025, #1\nThis newsletter was made possible through the support of Full Pull Wines, a boutique wines reseller that has been sponsoring us since 2011.\nReign\nNext match: Sunday, March 15, 2026 at Orlando Pride | 1 p.m. PT | Victory+ (a new free-to-view partner of the NWSL)\n- 2026 Seattle Reign schedule announced\n- Seattle Reign 2026 Season: Key updates and timelines\n- Reign sign goalkeeper Evan O’Steen from Florida State\n- Reign transfer goalkeeper Maddie Prohaska to Louisville\nDefiance\nSchedule still to come.\nLooking back at the news\nEverything else you need to know\n- Measuring Goalkeeper Impact in MLS: A Data-Driven Look at Value, Volatility, and Efficiency (American Soccer Analysis)\n- Western Conference: Breaking down every team's premium roster slot status (MLS Soccer) Seattle has one so-called premium slot open\n- Figuring out roughly how much GAM each team has (Tactics Free Zone)\n- The Story of GAM Inflation (Footy Analytic Musings)\n- Sporting KC Is Being Sold For Roughly $700 Million, An MLS Record (Forbes)\n- Houston's iconic soccer voice says Dynamo exit wasn’t 'mutual' (Houston Chronicle)\n- NWSLPA: 'Rodman rule' violates CBA, federal law (ESPN)\n- Sources: NWSL Challenge Cup moving to June (Equalizer)\n- NWSL’s winningest coach embraces stability, determined to bring championship to Seattle Reign (Yahoo Sports)\n- Chicago Stars, stadium opponents building campaigns around team's ask to play at Ryan Field (Evanston RoundTable)\n- Manager of women’s football club banned for 12 years after bombarding players with indecent images (The Guardian)\n- More workers at Lumen Field are now union members ahead of World Cup (Northwest Public Broadcasting)\n- Seattle warns its emergency management system is stretched thin ahead of major disasters and events like the World Cup (KING5)",
  "word_count": 1192,
  "scraped_at": "2026-02-14T12:44:30.758434"
}