{
  "article_id": "d928c936c6e2",
  "url": "https://www.brisbanetimes.com.au/politics/federal/how-the-high-court-sparked-albanese-s-first-full-blown-political-crisis-20231208-p5eq19.html",
  "title": "High Court ruling becomes political crisis for Anthony Albanese government",
  "date": "20231208T090000Z",
  "domain": "brisbanetimes.com.au",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "This was published 2 years ago\nHow the High Court sparked Albanese’s first full-blown political crisis\nCoalition MPs were almost salivating when they entered the House of Representatives at about 9pm on Wednesday as Labor sought to put a full stop on arguably its first full-blown political crisis.\nThe government wanted to ram through laws to re-detain a group of foreigners previously in immigration detention and opposition MPs, keen to cause chaos, were instructed to yell “resign” the moment Immigration Minister Andrew Giles rose to speak.\nLeader of the House Tony Burke was visibly frustrated when Speaker Milton Dick allowed the Coalition to move amendments to the bill and have a debate. Burke then used Labor’s numbers to shut down parliament for the day.\n“Gutless, gutless, you don’t even want to debate it,” Coalition immigration spokesman Dan Tehan thundered. “What a shambles, what chaos, you don’t even want to debate the number one priority of any government: to keep the community safe. You’re hiding, it’s time the prime minister stood up.”\nTeal MPs and senator David Pocock attacked Labor for the haphazard way it shepherded through the bill.\n“This is what regimes do to communities when they are seeking to have complete control. They pass laws in the dead of night,” North Sydney MP Kylea Tink said.\nOn paper, Prime Minister Anthony Albanese finished the parliamentary year with a bang. His government secured deals on industrial and environmental laws, the NDIS, federal-state funding and the Murray-Darling Basin.\nMuch of this, however, was drowned out by a saga involving the release of more than 140 detainees, many of whom had serious criminal records, after a landmark High Court ruling on the illegality of indefinitely detaining non-citizens who cannot be deported.\nThe paradoxical end to the year – steadily honouring long-planned commitments while struggling to react to fast-moving political crises – in some ways encapsulates the government’s recent performance.\nThroughout the Voice campaign, amid the Qantas debate, at the outset of the war in Gaza, and in the aftermath of the High Court’s decision, Albanese and his office have been accused of being flat-footed, an idea prosecuted by Peter Dutton, a relentless opposition leader more than willing to turn up the noise in question time.\nThis week began with the headlines from hell, after Afghan refugee Aliyawar Yawari, a violent sex offender who had been jailed for preying on elderly women, faced court on Sunday night on new indecent assault charges less than a month after he was released from indefinite detention.\nLike clockwork, the rest of the week, police forces around the country revealed other ex-detainees had been arrested for alleged crimes.\nThe prime minister has not held a press conference to address the political crisis, instead allowing his ministers to take the heat.\nBut a Wednesday press conference with Home Affairs Minister Clare O’Neil, Attorney-General Mark Dreyfus and Giles went badly wrong when the attorney-general snapped after a reporter asked if O’Neil should apologise to those who had been affected by the alleged reoffending.\n“Do not interrupt! I will not be apologising ... for acting in accordance with a High Court decision. Your question is an absurd one,” Dreyfus said, in an exchange replayed all week.\nThe question that prompted his fury went to the heart of the dispute about whether Labor could have done anything differently to protect community safety after the November 8 High Court ruling.\nDutton argues Labor could have released only the Rohingya man involved in the High Court case – a stateless child rapist no third nation was willing to take – and waited until November 28, when the court published its full reasoning, to make a call about the dozens of others held in the same circumstances.\nConstitutional expert Anne Twomey told this masthead she agreed with Dreyfus, though some conservative legal figures back Dutton.\n“The government couldn’t pretend it didn’t know certain people were being held unlawfully,” Twomey said. “If it had continued to hold them, it would have been seriously breaching the law.”\nGiles – who has faced calls to resign but retains the confidence of Albanese, a close factional ally – said his department had begun preparing applications to use the government’s new powers to put back behind bars the “worst of the worst” of the ex-detainees.\nThe government has not confirmed how many of the 148 it intends to return to custody. If the number is small and more of those who were released are accused of crimes, Dutton will continue to dine out on the crisis over the summer break.\nIt’s not clear if the fierce tone of the debate matches the threat to the community posed by the released foreigners.\nFive members of the cohort have been arrested since their release. Some of their alleged crimes are insignificant, such as stealing luggage. But the gravity of the risk is demonstrated by the alleged assault of an elderly woman at an Adelaide hotel, and a man who once preyed on teens in residential care allegedly contacting children online.\nIn purely political terms, the prospect of dozens of non-citizen rapists, paedophiles, and murderers turning recidivist over Christmas is diabolical for a Labor Party whose last term in government was dogged by border protection failures.\nTwo Liberal MPs claimed the detainee saga was the first Albanese government crisis they believed was cutting through with voters.\n“It’s being raised unprompted. Some people don’t fully understand the issue but it’s confirming in people’s minds why they don’t trust Labor,” said one MP, who spoke on background.\nLabor MPs are not in full panic mode, but they yearned for the parliamentary year’s end like a football team limping to half-time after an unexpected battering from a side they considered underdogs.\nCut through the noise of federal politics with news, views and expert analysis. Subscribers can sign up to our weekly Inside Politics newsletter.\nMore:",
  "word_count": 980,
  "scraped_at": "2026-02-14T14:08:23.778976"
}