{
  "article_id": "d9298397e2ad",
  "url": "https://www.dailymail.co.uk/news/article-12795383/Horrors-endured-Hamass-hostages-released-food-sleep-executed.html",
  "title": "The horrors endured by Hamas hostages",
  "date": "20231127T130000Z",
  "domain": "dailymail.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "The horrors endured by Hamas's hostages: Barely any food, forced to sleep on plastic chairs, waiting to be executed... Israelis reveal the Hell they went through while held captive for seven weeks\n- With the release of more hostages, a picture is beginning to emerge about the dire conditions in which Hamas's 240 captives have been held in within Gaza\n- On Monday, the truce deal between Israel and Gaza entered its final 24 hours\nAs groups of Israeli hostages were released from Gaza in recent days, an army of medics, child protection experts and trauma specialists battened down the hatches and shielded them from the media spotlight.\nBut with a four-day truce between Israel and Hamas now in its final 24 hours, a picture has started to emerge about the dire conditions in which the freed hostages were being held by the terror group over the last seven weeks.\nTheir relatives have spoken of plastic chairs as beds, irregular meals of bread and rice, and hours spent waiting for the bathroom.\nSome of the freed hostages have lost significant weight, and have told their loved ones how they had no sense of time passing in Gaza.\nIn one 84-year-old woman's case, it is reported that she was not given vital medication while in Gaza, and that she is currently in an 'unstable' condition.\nAnother elderly woman said she feared she was on her way to be executed in the build up to her release, only to find that she was being freed.\nSharon Hertzman Avigdori embraces her son after she was released along with her daughter from Hamas captivity, early on November 26. With a four-day truce between Israel and Hamas now in its final 24 hours, a picture has started to emerge about the dire conditions in which the freed hostages were being held by the terror group over the last seven weeks\nA group of Israelis watch as a helicopter carrying hostages released from the Gaza Strip lands at the helipad of the Schneider Children's Medical Center in Petah Tikva, Israel, Nov. 26\nAs of Monday morning, of the roughly 240 people dragged into Gaza by Hamas in its brutal October 7 attack, 62 hostages have been released\nInternational Red Cross vehicles, carrying Israeli hostages released from Gaza, are on their way through the Rafah crossing to Egypt in Rafah, Gaza, November 26\nAs of Monday morning, of the roughly 240 people dragged into Gaza by Hamas in its brutal October 7 attack, 62 hostages have been released (made up of Israelis and foreigners), one was freed by Israeli forces, and two were found dead inside Gaza.\nOf those released, 58 were freed under a cease-fire deal over the past three days. Four others were freed earlier in the conflict.\nA total of 14 hostages with Israel citizenship were returned to Israel on Sunday, the third day of a four-day truce deal with Hamas that will see a total of 50 Israeli captives freed in exchange for 150 Palestinian prisoners.\nUnder the terms of the agreement, one more group of captives is set to be handed over to Israel in exchange for Palestinian prisoners before the end of the truce.\nIt's possible that the temporary ceasefire could be extended if more hostages are exchanged, but so far, nothing has been confirmed by either side. Hostilities are set to resume on Tuesday unless an extension deal can be struck.\nTherefore, an agonising wait continues for those who still have relatives inside the coastal strip, and they more than anyone will be listening intently for any information about how their loved ones are being treated by Hamas.\nThose freed in recent days have largely stayed out of the public eye.\nMost are still in hospitals being treated as they start to process a seven-week ordeal that may have left many of them deeply traumatised.\nAmong the 240 kidnapped and dragged into Gaza during the attack were babies, children and the elderly, according to an Israeli count.\nSome 13 Israeli hostages released from Hamas captivity: Margalit Moses, Adina Moshe, Danielle Aloni and her daughter Emilia, Doron Asher and her daughters Raz and Aviv, Hanna Katzir, Keren Munder and her son Ohad, Ruti Munder, Yaffa Adar, and Hannah Perry\nIsraeli hostages released on November 26, 2023: Top L-R: Hagar Brodutch and children Ofri, Yuval and Oriya, Roni Krivoi; middle: Chen Almog Goldstein and her children Agam, Gal and Tal Almog; bottom: Avigail Idan, Elma Avraham, Aviva Siegel, and siblings Ela and Dafna Elyakim\nA Hamas fighter and Red Cross medics help a newly released Israeli hostage Maya Regev into a Red Cross vehicle, in the Gaza Strip early on November 26\nHostages who were abducted by Hamas gunmen are seen in a video released on Sunday\nA helicopter transporting hostages released by Hamas arrives at Schneider Children Medical Center in Petah Tikva on Sunday\nRaz Asher (left), four, her two-year-old sister Aviv (right) and their mother Doron, 34, reunite with their father and husband Yoni at the Schneider Children's Medical Centre on Sunday\nRaz Asher (left), four, her two-year-old sister Aviv (right) and their mother Doron, 34, reunite with their father and husband Yoni at the Schneider Children's Medical Centre on Sunday\nNine-year-old Irish Israeli former hostage Emily Hand embraces her father at a hospital in Israel after being released by Hamas, amid an exchange operation of hostages against prisoners between Hamas and Israel, on November 26\nHostage Roni Kriboy, 25, who was abducted by Hamas gunmen during the October 7 attack on Israel, is handed over by Hamas militants to members of the International Committee of the Red Cross\nIn the build up to the truce deal, medics and other professionals were preparing for the worst, noting that infants, children, and adolescents were at an extremely high risk of physical violence and abuse, including including sexual abuse, mutilation, humiliation, and long-term physical damage, according to the Jerusalem Post.\nThey also warned that the youngest captives are the most prone to 'extreme psychological anguish and developmental delay' due to being kidnapped, held hostage and witnessing horrific crimes on October 7.\nBut while the conditions sound dire, there have yet to be reports of torture or physical abuse that many feared, especially given the atrocities committed by Hamas terrorists in the October 7 attack on Israel, in which 1,200 were killed.\nHowever, serious concerns remain over the mental health of the hostages, and over the conditions those who are still inside Gaza are living in.\nThe fullest image yet of life under Hamas captivity was conjured by 85-year-old Yocheved Lipschitz, one of the hostages freed before the current cease-fire.\nUpon her release, Lipschitz said she had been held in tunnels which stretched under Gaza 'like a spider web.' But she also said her captors 'told us they are people who believe in the Quran and wouldn't hurt us.'\nLipschitz said captives were treated well and received medical care, including medication. The guards kept conditions clean, she said.\nHostages were given one meal a day of cheese, cucumber and pita, she recalled, adding that her captors ate the same as the hostages.\nBut unsurprisingly for an 85-year-old woman beaten and dragged away by Israel's most savage enemies, she also admitted: 'I went through hell.'\nWhen asked at the press conference why she had shaken a Hamas terrorist's hand as she was freed, she replied: 'Because they treated us very nicely.'\nYocheved Lipschitz, 85, center, and Nurit Cooper, 79, were escorted by Hamas as they were released to the Red Cross in an unknown location\nAfter being released, grandmother Yocheved Lipschitz shook hands with one of her captors and looked him in the eye before saying 'shalom'\nIt is not obvious that everyone would agree with that, especially given the brutal beating she suffered.\nBut through her daughter, she said that during her 16 days as a prisoner, her captors 'took care of all the women's needs - shampoo, conditioner.'\nShe described how each prisoner was assigned their own guard, and they would talk and eat with them every day. On top of this, a doctor examined the hostages daily and gave them any necessary medication.\nSpeaking for her mother, Sharone Lifschitz (who spells her surname differently), said the terrorists were particularly anxious about cleanliness.\n'They were very concerned with hygiene, and were worried about an outbreak of something. We had toilets which they cleaned every day,' she said.\nHer description was contrary to what many in Israel had been expecting.\nA panel of reporters on the country's top-rated Channel 12 news appeared flummoxed by her description of captors who were polite, fed their hostages, kept their quarters clean and provided medical care.\nThey criticised officials for not coaching her before she appeared before reporters.\nSince Lipschitz's release, information about the conditions of their captivity has been tightly controlled, but family members of the released hostages have begun to share details about their loved ones' experiences.\nSome of their latest descriptions have painted a more bleak picture.\nLike Lipschitz, recently freed hostages also appeared to have been held underground, likely in Hamas's tunnel system it uses to hide from Israeli strikes.\nEyal Nouri, the nephew of Adina Moshe, 72, who was freed on Friday, said his aunt 'had to adjust to the sunlight' because she had been in darkness for weeks.\n'She was in complete darkness,' said Nouri. 'She was walking with her eyes down because she was in a tunnel. She was not used to the daylight. And during her captivity, she was disconnected ... from all the outside world.'\nNouri said that Moshe didn't know that she was going to be released until the last moment. 'Until she saw the Red Cross,' he said. 'This is the moment when she realized, okay, these horrifying seven weeks are over.'\nHis niece Mayan Moshe, 43, told The Times she thought she was on her way to be executed in the build up to her release.\nAdina Moshe, 72, told her family she thought she was being led to her death before she and 12 other hostages were released on Friday\n'She knew something was happening when the explosions all stopped on Friday and suddenly there was silence,' he said in an interview with the British publication.\n'Our aunt said when they were moved from the tunnel they were scared — they thought they were being taken to be executed. Only when they saw the Red Cross buses did they realise they were being freed.'\nAdina had been kept underground by Hamas terrorists for 50 days before being released and her eyes were still adjusting to sunlight when she spoke to her family. Her nephew Ayat Nouri said: 'They kept up the terror to the end.'\nShe emerged to the news that her husband had been killed by the militants and her son's family had miraculously survived.\nOthers have also emerged to tragic news.\n'They are in our arms. They are fine, in good condition and they are smiling,' said Inbar Goldstein after her sister-in-law Chen Goldstein-Almog, 48, was released with three of her four children: Agam, 17, Gal, 11 and Tal, eight.\nWhen Hamas gunmen stormed into southern Israel, killing 1,200 people, mostly civilians, and kidnapping the 240, they murdered the children's father Nadav and their older sister, Yam, with the rest of the family taken to Gaza.\n'They know about the terrible tragedy that happened to their family on that black shabbat,' Inbar said in a statement released by the Hostages and Missing Families Forum after her family were released.\n'Now we're taking a moment to breathe deeply, to really smile again, to start picking up the pieces and to continue the fight until the last of the abductees returns to us safe and sound.'\nMerav Raviv, whose three relatives were released by Hamas on Friday, said they had been fed irregularly and had eaten mainly rice and bread. She said her cousin and aunt, Keren and Ruth Munder, had each lost around 15 pounds in just 50 days.\nRaviv said she'd heard from her freed family members that they had slept on rows of chairs pushed together in a room that looked like a reception area.\nThey said they sometimes had to wait hours before going to the bathroom.\nNine-year-old Ohad Monder reunites with his father, his brother and family member\nAdva Adar, the grandchild of 85-year-old released hostage Yaffa Adar, said her grandmother had also lost weight.\n'She counted the days of her captivity,' Adar said. 'She came back and she said, 'I know that I've been there for 50 days.''\nAdar said that her grandmother was taken captive convinced that her family members were dead, only to emerge to the news that they had survived.\nStill, her release was bittersweet: She also found out that her house had been ravaged by militants.\n'For an 85-year-old woman, usually you have your house where you raised your kids, you have your memories, your photo albums, your clothes,' said Adar.\n'She has nothing, and in her old age she needs to start over. She mentioned that it is tough for her.'\nOhad Munder, Merav's nephew and Keren's son, was surrounded by friends soon after his release. They celebrated his ninth birthday a month late with ice cream and pizza in a hospital ward, and he seemed in good spirits.\nThe little Liverpool fan was then taken by surprise when an Israeli football team also paid him a visit, draping him with a red football scarf and hugging the small boy.\nOhad and his brother embrace following the youngster's release from Gaza\nIn the evening, he was joined by a group of his friends to celebrate, where they were treated to ice cream in honour of his ninth birthday which he spent as a hostage\nOhad's friend, Eitan Vilchik, told Israel's Channel 13 that his friend was 'emotionally strong' and already able to answer their questions about what he ate and what happened to him while he was in captivity.\nBut his friends refused to share details, saying they wanted to respect his privacy.\nVilchik said teachers have cancelled Munder's homework requirements but his friends will help him make up the subjects he missed in school.\nHe said Ohad was still able to solve a Rubik's cube in less than a minute.\nThe Raviv family's elderly uncle Avraham was taken by Hamas separately.\nThe kidnapped family had believed their frail uncle was murdered until Ms Raviv told them he had been taken hostage - but Keren's brother Roi had been killed, she said.\nMr Munder is not in good health, walks with a cane and has bad eyesight. He was left behind by Hamas in the house as his wife, daughter and grandson were abducted.\nTragically, Ohad's uncle Roee, 50, was murdered by Hamas. He was buried in an emotional service outside Tel Aviv.\nDoctors have warned of the steep psychological toll of captivity. Israel has made counselling and other support available to those who have been released.\nBut most of the freed hostages have appeared to be in good physical condition, able to walk and speak normally.\nBut at least two needed more serious medical care. One hostage released Sunday, 84-year-old Alma Abraham, was rushed to Israel's Soroka Medical Center in the southern city of Beersheba in life-threatening condition.\nThe hospital's director said she had a pre-existing condition that had not been treated properly in captivity. Doctors said she was in 'critical condition'.\n'She's being treated in our emergency department after serious neglect for the last several weeks while being held by Hamas,' said Shlomi Codish, head of Soroka hospital. The elderly artist was kidnapped from Nahal Oz kibbutz.\nAnother young female hostage was on crutches in a video Hamas released Saturday.\nThe girl grimaced at her captors as she entered a Red Cross vehicle bringing her out of the besieged enclave.\nAviv Asher, two, her sister Raz, four and mother Doron, step off an Israeli helicopter\nSharon Avigdori, and her daughter Noam, 12, were pictured safely returning to Israel\nDafna Elyakim (pictured, right) and Ela Elyakim (pictured, left) were reunited with their mother Maayan Zin (pictured, centre)\nSix-year-old Emelia Aloni and her mother Danielle reunite with their family at the Schneider Children's Medical Centre on Sunday\nYair Rotem, whose 13-year-old niece, Hila Rotem-Shoshani, was released Sunday, said he had to keep reminding her she didn't need to whisper.\n'They always told them to whisper and stay quiet, so I keep telling her now she can raise her voice,' said Rotem. He added that Hila, who celebrates her 13th birthday on Monday, slept well during her first night back in Israel and has an appetite.\nMr Rotem also suggested that Hamas had breached one element of its deal with Israel with its release of his niece.\nHila, he said, had told him she was held hostage together with her mother Raya and Emily Hand, a nine-year-old Irish-Israeli girl who was also released over the weekend.\nHowever, her 54-year-old mother Raya was not released.\nMr Rotem said Hila's account to him contradicted Hamas's own claims that the group is not aware of where Raya is. Her not being released from captivity along with her daughter would also represent a violation of the truce agreement, under which the terror group committed not to separate mothers from their children.\n'Hila returned without her mother and that is a clear violation of the agreement with Hamas. We demand from Hamas and the mediators that Raya be returned home as they agreed, immediately,' he said, speaking from Sheba Hospital.\n'Hila told us she was in captivity together with her mother and Emily [Hand] until two days ago,' he told reporters.\n'We know she was in good condition and expect her to remain in good condition.'\nIt has also emerged that one of the hostages briefly escaped from captivity.\nRoni Kriboy, 25, was a surprise addition to the roster of hostages released on Sunday, alongside 13 women and children who had been pre-agreed in mediated Israel-Hamas negotiations.\nCiting Kriboy's dual Russian citizenship, Hamas said he was freed to show appreciation for Moscow - what it said was the only world power openly engaging the group during the now seven-week-old war.\nLike other recovered hostages, Kriboy has been kept away from the media in what Israeli authorities describe as an effort to focus on helping with their recovery.\nHis family said Kriboy had vanished while working as a stage hand at an outdoor dance party where armed Hamas infiltrators killed 364 revellers on October 7.\nIsraeli authorities determined a week later that he was among some 240 people taken captive.\nKriboy's aunt, Yelena Magid, said in an interview with Israel's Kan radio that she spoke to Kriboy after his return.\n'He recounted being seized by terrorists, who held him in a building that was bombed,' she said, in an apparent reference to Israeli shelling, adding that he sustained head wounds there.\n'He managed to escape and to hide out, alone, for four days. He tried to reach the border. In the end, the Gazans caught him and returned him to the terrorists' hands.'\nKriboy's cousin, Alex Magid, gave a similar account in an interview to Israel's Army Radio on Monday, adding that the bombing of the building killed several Palestinian gunmen.\nHostage Roni Kriboy, 25, arrives at the Rafah border, amid a hostages-prisoners swap deal between Hamas and Israel, in the southern Gaza Strip November 26, 2023\nIn this photo provided by the Israeli Army, Hila Rotem Shoshani, a released hostage, reunites with her Uncle on Sunday, November 26\nOri Megidish, 19, was operating an observation post on the heavily-militarised Gaza border when she was seized in the Hamas attacks of October 7.\nHer rescue was confirmed by the Israeli military just over three weeks later, but no details have been released of her captivity or the operation to free her.\nIn a relaxed video filmed at her home and posted to her TikTok account, she said she was 'fine' and 'happy to see all the moving clips of hostages returning to their families'.\n'I hope all the families who are still waiting for their hostages to return will be united and they will be able to celebrate as I did. I hope they will all return with God's help.'\nAnother of the freed hostages was toddler Abigail, a US-Israeli dual citizen whose parents were killed on October 7 and whose case was highlighted by US President Joe Biden.\nIn a brief statement via the Families Forum, her family confirmed the girl - who turned four in captivity - was safely home but asked for time and privacy to let her recover.\n'She just landed in the hospital and she's been checked and taken care of,' said her aunt Ella Mor. 'I just want to say she has family and we are taking care of her.'\nWhile it appears that most of the hostages being released are in a good physical condition, with a few exceptions, concerns remain about their mental well-being.\nHow they will recover from the psychological trauma of being held captive is a difficult question to answer, experts say, because the capacity to recover varies enormously and unpredictably from one person to another.\n'Whilst many people released from captivity experience understandable distress symptoms, not all of them will develop PTSD (post-traumatic stress disorder) or other mental health disorders,' explained British psychiatrist Neil Greenberg, who specialises in psychological trauma.\n'However, an important minority will,' he added, speaking to AFP news agency.\n'Much will depend on the experiences of the people as they were taken hostage and whilst in captivity,' he said.\n'How they are supported after they get released is also really important.'\nGreenberg said there are no particular mental consequences of being taken hostage compared to other traumatic experiences such as being bombed, as has been the case of civilians in Gaza trapped under Israeli air strikes.\n'There are no specific post-hostage PTSD symptoms,' he said.\nHowever he said the experience can sometimes trigger psychological problems later on - feelings of isolation, humiliation or helplessness. Other factors such as intense media attention can also have a bearing on a former hostage's capacity to recover.\nMost former hostages do tend to regain control over their lives.\nSome, however paradoxical it might seem, may even eventually reap psychological benefits from the experience.\nA pair of female IDF soldiers comfort Raz, four, and Aviv, two, following their release\n'This does not kick in on day one, but many ex-hostages find that months or years later, they can cope better with adversity because they have been able to overcome the [...] challenges of being kidnapped,' Greenberg said.\nThe world is waiting anxiously again today to see whether Hamas will release what is set to be the final group of hostages under the on-going truce agreement.\nCalls are also growing for the truce to be extended, and for more people to be freed.\nNegotiations for an extension of the pause in the fighting, and with it more hostage returns, were continuing Monday.\nMost watched News videos\n- Extraordinary moment mass brawl breaks out between Brits on flight\n- Finance expert's TV interview interrupted by adorable granddaughter\n- Moment driver veers to target e-bike riders before killing teen\n- Moment Swiss bar fire owners collapse after being confronted\n- Chilling police interview of ISIS fanatic plotting UK attack\n- Astonishing moment a street is swallowed by a sinkhole\n- Israeli hostage reveals how she survived being tortured\n- Deepak Chopra confronted over his relationship to Epstein\n- Food vlogger dies after 'eating toxic devil crab'\n- Spy cam shows woman on her knees next to Jeffrey Epstein\n- New video shows man with backpack similar to Guthrie kidnapper\n- Toddler opens car door in traffic and sends biker flying",
  "word_count": 3976,
  "scraped_at": "2026-02-14T14:08:50.312622"
}