{
  "article_id": "d9595b60f7b1",
  "url": "https://www.arsenal.com/news/all-wsl-matches-be-played-emirates-stadium",
  "title": "All WSL matches to be played at Emirates Stadium",
  "date": "20250610T101500Z",
  "domain": "arsenal.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "We are proud to announce Emirates Stadium will host all 11 Barclays WSL matches in the 2025/26 season, reaffirming N5 as the main home of Arsenal Women.\nThe European champions hosted nine WSL matches across the 2024/25 season, with an average attendance of 34,110 and a high of 56,748 in the 5-0 win against north London rivals Tottenham Hotspur in February.\nGrab your 2025/26 home shirt now!\nFollowing engagement and feedback from supporters, and significant investment in the facilities, next season’s UWCL League Phase matches will be played at long-standing host venue, the Mangata Pay UK Stadium (Meadow Park, Borehamwood).\nOther games, including all women’s domestic cup fixtures (Adobe Women’s FA Cup and FA Women’s Subway League Cup), will also be played at the Mangata Pay UK Stadium.\nThe announcement follows sustained growth in match-going crowds in recent seasons, with more than 415,000 tickets sold across 2024/25, up 20% on the previous season.\nWith all WSL matches coming to N5, Arsenal will also introduce a full Emirates Stadium Season Ticket for the women's team for the first time, giving thousands more supporters the opportunity to reserve their seat in the club’s iconic home.\nRichard Garlick, Arsenal Managing Director, said: “Today’s announcement is another bold step forward. It’s an opportunity to create a special home for our team and allow more opportunities for our community, and a new generation of supporters to watch the European champions.\n“It’s the start of another chapter in the story of our women’s team just two weeks on from us lifting the Champions League trophy with our community here in Islington. We keep moving forward together, and we’ll continue to fuel and inspire each other.”\nClare Wheatley, Director of Women’s Football, said: “Our players and staff know what it means to walk out in front of a packed Emirates Stadium. It brings a sense of pride and belonging to all of us. It fuels a relentless drive to win and is a crucial part of how we create the best conditions for our women’s team to succeed.\n“We felt that winning connection all season, and to share in a Champions League win with our supporters in north London after returning from Lisbon inspired us all to push on.”\nRenée Slegers, Head Coach of Arsenal Women, said: “I'm so proud of the journey we've been on with our supporters this season. From Boreham Wood to the Emirates, on the road to every WSL and European destination we visited, and of course all the way to Lisbon, they've shown up and we've fuelled each other to an historic season for our club.\n“For us, this is just the beginning, and bringing every WSL match to the Emirates is another step for more supporters to be part of this special journey. We’ll come back next season, with fire in our hearts, more determined, more ambitious, and more together than ever.\"\nSupporters will also have the option to purchase a Six Game Bundle, giving them opportunity to attend six select WSL matches at a discounted rate. The exact fixtures incorporated into this will be confirmed later in summer, after the 2025/26 WSL fixtures have been released.\nArsenal Women Supporters’ Club said, “We are delighted to hear that all WSL home games will be played at Emirates Stadium next season. This allows more people than ever to experience a WSL matchday and help Arsenal to build on the success we achieved in Lisbon. We are also excited that Meadow Park will still be used for cup games. We've experienced some great times at Meadow Park and look forward to cheering on the team from the North Bank next season.”\nBoth Season Tickets and Six Game Bundles will also give supporters access to exclusive benefits. They will go on general sale on 4th July. Supporters can find out further information and register their interest here.\nCopyright 2026 The Arsenal Football Club Limited. Permission to use quotations from this article is granted subject to appropriate credit being given to www.arsenal.com as the source.",
  "word_count": 670,
  "scraped_at": "2026-02-14T12:49:56.406050"
}