{
  "article_id": "d9688f56b963",
  "url": "https://www.manchestereveningnews.co.uk/news/tv/who-taking-part-bbc-strictly-29916685",
  "title": "Who is taking part in BBC Strictly Come Dancing 2024 ? Celebrity line - up in full",
  "date": "20240914T093000Z",
  "domain": "manchestereveningnews.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Who is taking part in BBC Strictly Come Dancing 2024? Celebrity line-up in full\nFifteen celebrities - including singers, Olympians and a former Love Island contest - are taking part in the BBC One show\nIt's official that time of the year as after months of anticipation, Strictly Come Dancing returns to our TV screens this weekend. After an epic run in 2023, we'll finally get to see the new crop of celebrities in action as the BBC One dance contest.\nThe sparkly juggernaut is back, filling our Saturday nights with glitz and glam and plenty of moving and shaking from 15 celebrities - including singers, soap actors, Olympians and a former Love Island contest and their professional partners as they were brave enough to sign up for the 2024 series.\nThings kick of on Saturday, September 14 at 7.20m on BBC One and BBC iPlayer with Strictly's pre-recorded launch show, with viewers set to see the celebrities paired with their professional partners for the first time and a special performance from the pro dancers dedicated to Amy Downde's return.\nREAD MORE: BBC Strictly Come Dancing's Shirley Ballas admits 'feeling of terror' ahead of show return\nBut the real competition won't begin until the first live show a week later, on Saturday, September 21, in which fans will see the new couples perform for the judges' verdict and viewers' votes for the first time.\nAs the hit dance show returns, here's a reminded of who is taking part this year:\nChris McCausland\nChris McCausland is a comedian and was the first official celebrity contestant for Strictly Come Dancing 2024 to be announced. The 47-year-old lost his sight due to retinitis pigmentosa, a hereditary eye disease, which causes gradual degeneration of the retina.\nHe has hosted his own self-titled show on ITV1 on Saturday mornings, and has also featured on panel shows such as Have I Got News For You, 8 Out Of 10 Cats Does Countdown and QI.\nAs he was named as a contestant on Strictly, he said: \"This is literally the worst kept secret there has ever been in British television. I think its been out there, it’s been exhausting keeping a secret everyone seems to know.”\nAsked how he feels about taking part, McCausland said: \"Apprehensive, massively apprehensive. I don’t know what I’m getting myself into, I’ve never watched it, obviously. It’s just some music.\" He continued: \"I don’t dance, I have never danced. I grew up with headbanging and mosh pits.\"\nJB Gill\nJB Gill rose to fame as a member of one of the UK’s biggest boybands – JLS. The group have accumulated five number one singles, over 10 million record sales worldwide and has won a multitude of awards.\nJB is also an avid and award-winning farmer and was the lead presenter on CBeebies’ BAFTA-nominated television series, Down On The Farm, Channel 5’s On The Farm series, plus contributions to the BBC’s Countryfile and Springwatch. JB Gill has been a part of the presenting team for BBC Songs of Praise since 2017 and has his own TV show Cooking With The Gills on Channel 5.\nJB said: \"I danced in the Strictly Christmas special over a decade ago and LOVED it, so when I got the call to join Strictly this year, it was an immediate yes from me. I’m raring to go to and looking forward to showing off some new skills to the JLS boys. From muddy wellies on the fields of my farm to sequins and Glitterballs - I’m here to embrace it all!\"\nWynne Evans\nWynne Evans is a broadcaster, presenter, and professionally trained opera singer. He is best known for his operatic skills, throughout his 25-year career he has had two number one classical music albums, has been a principal at most of the major opera houses around the world and has given over 200 performances at the Royal Albert Hall in London.\nWynne currently has a daily radio show on BBC Radio Wales and has previously had radio shows on BBC Radio 3 and Classic FM. He said of joining Strictly: \"I am honestly still pinching myself, a portly balding opera singer, me, taking part in Strictly Come Dancing?! I’m not entirely sure how I’ll get along, if all else fails I’ll just have to learn the art of distraction.\n\"What I do know is I will give it my all and aim to make Wales proud. I’m definitely going to try and combine my love of Opera into one of my routines. Plus, after winning Celebrity MasterChef last year, maybe the route to the judges’ hearts will be through their stomachs!\"\nToyah Willcox\nToyah Willcox has been performing across stage and screen for over 50 years. She is an award-winning rock legend with hit singles like ‘It's A Mystery’, ‘I Want to Be Free’ and ‘Brave New World’ and played at this year’s Glastonbury Festival with her husband, Robert Fripp.\nShe has amassed thirteen top 40 singles, recorded twenty-five albums, written two books, appeared in over forty stage plays, acted in over twenty feature films and presented many television programmes. In 2018 Paul McCartney awarded Toyah a Liverpool Institute for Performing Arts Companionship for Outstanding Achievement in music, drama, performance and media.\nToyah said of signing up for the BBC dance show: \"Wow Strictly Come Dancing, can you believe it! This is going to be a wild and wonderful ride, and I'm here for every sparkly second. I’m used to performing for big crowds but this is completely fresh for me, how I will do, it’s a mystery… I just want to get cracking and learn some dance routines now!\"\nDr Punam Krishan\nDr Punam Krishan is a media medic and broadcaster. She is a resident GP on BBC Morning Live and BBC Radio Scotland. Alongside being a practising NHS GP, Punam regularly reports on health news as a broadcaster on TV, radio and national newspapers and has also written her own children’s book with additional books in the pipeline.\nSpeaking about joining Strictly, she said: \"This still doesn’t feel real, I am overjoyed to be a contestant on this year’s show. I have watched Strictly every year with my family and it feels extra special that it’s the 20th year, I can’t believe I will be the one getting Strictly-fied now. This is so out of my comfort zone, but I’m up for the journey and will give it my absolute all.\"\nTasha Ghouri\nTasha Ghouri is a model and TV personality that is passionate about raising awareness for the deaf community. She appeared on ITV’s Love Island in 2022, and since then has amassed a following of over 2.2 million across her social media network.\nTasha has worked with Number 10 Downing Street, The Department of Education and MED-AL to champion issues close to her heart. She is a published author with her debut novel “Hits Different” and has her own podcast, “Superpowers with Tasha”.\nShe said of joining Strictly 2024: \"Pinch me, I can't believe I'm going to be on Strictly Come Dancing! I’ve been watching the show since I was little – it's a firm Ghouri family favourite - so this is a total dream come true. I know it's going to be an unforgettable experience and I hope to represent and make everyone proud out on that dancefloor.\"\nPete Wicks\nPete Wicks is a TV personality, author, radio and podcast host, probably best known for appearing on The Only Way is Essex and co-hosting Staying Relevant with Sam Thompson.\nPete is best known for his television appearances and presenting including from the red carpet at the BRIT Awards, Pride of Britain Awards and National Television Awards. Pete Wicks first appeared on our screens on the BAFTA award-winning ITV show ‘TOWIE’ in 2015. Alongside this Pete Wicks co-hosts the award-nominated podcast Staying Relevant which has had over five million downloads to date and has been number one in the comedy charts numerous times. Pete Wicks is also an animal rights advocate and supports many charities.\nPete said of signing up: \"Dancing live in front of the nation every Saturday? Absolutely terrifying. But anyone who knows me knows I love a challenge and trying new things, so I'm genuinely looking forward to getting stuck in.\"\nShayne Ward\nShayne Ward is best known for being an actor and singer who shot to fame on The X Factor. Shayn's debut single and album topped the UK charts, with his single, ‘That's My Goal’ making it to Christmas number one after he won the second series of The X Factor in 2005.\nAs well as being an accomplished music artist, Shayne is a multi-award-winning actor with his character, Aidan Connor in ITV’s Coronation Street, earning him Best Newcome at the NTA’s and Best Storyline at the Soap Awards amongst others. In addition, Shayne has performed in a number of musicals and feature films, including Rock of Ages on the West End stage. He’s currently the lead character in the crimedrama series The Good Ship Murder on Channel 5. Shayne said of signing up for the show: \"I’m buzzing to see all of the sparkles and magic that is Strictly in real life. I’m no stranger to live TV, but dancing Latin and Ballroom in front of millions is a whole new level. No promises on my dancing ability, but I will give it my best shot!\"\nSarah Hadland\nSarah Hadland will also be taking to the dancefloor this year and is an actress with an extensive background in film, television and theatre.\nShe is best known for her role as Stevie in the BAFTA nominated sitcom Miranda as well as being one of the original cast members of the multi-award winning series ‘Horrible Histories’, both for the BBC. Sarah was nominated for an RTS Award for Best Comedy Performance for her leading role in ITV’s comedy series The Job Lot. Sarah has appeared in numerous films, including the Bond epic Quantum of Solace and her notable theatre credits include Noises Off on the West End.\nSarah commented: \"I cannot believe I am part of Strictly! I feel particularly excited to be part of such an iconic show in its 20th year. I’m so ready for the glitz, glam and glitter and hopefully I can make everyone watching at home proud!\"\nJamie Borthwick\nActor Jamie Borthwick rose to fame for his portrayal as Jay Brown in BBC's EastEnders which he has starred in since 2006. He is now one of the longest-serving actors on the show. In 2008 his role in EastEnders earned him a British Soap Award for Best Dramatic Performance from a Young Actor.\nHe then went on to win Best Actor at the Inside Soap Awards in 2023. Jamie also won the 2023 Strictly Come Dancing Christmas special.\nJamie said of signing up to the full series: \"I had a ball doing the Strictly Christmas special last year, so when I was asked to join for this series it was the easiest yes! This is a fresh challenge and it will be so different to be learning a new dance every week and for the public to have their say. I’m hoping to be Salsa-ing around Albert Square in no time and I’ll be asking my Walford Strictly alumni for some words of wisdom. See you on the dancefloor!\"\nTom Dean MBE\nTom Dean MBE will be swapping the pool for the ballroom. The three-time Olympic swimming champion made history at the Tokyo 2020 Olympics as the first British man to win a gold medal for the men’s 200m swim freestyle in over 100 years, going on to win a further gold medal in Tokyo and become England’s most decorated athlete at the subsequent 2022 Commonwealth Games, winning a total of seven medals.\nMost recently, he brought home his third gold medal for Team GB from the Paris 2024 Olympic Games in the team 4 x 200m freestyle relay.\nTom said of his next challenge: \"I am taking part in Strictly Come Dancing 2024! You may have heard me accidentally say it poolside first… but now I can officially talk about how excited I am to get stuck into something new, meet some brilliant people and get dancing. Bring it on!\"\nMontell Douglas\nMontell Douglas is known by many as Fire in the BBC One series Gladiators. The 38-year-old is also an Olympian for Team GB appearing in the 100m at the Beijing Olympics in 2008. She won a gold medal at the 2010 Commonwealth Games in the 4x100m relay race.\nMontell also became the first female UK athlete to compete at both the Summer and Winter Olympic Games when she represented Great Britain at the Beijing Winter Olympics in the Bobsledding team.\nAfter being announced to appear on Strictly she said:\" “Strictly ARE YOU READY, Fire is here to light up the Ballroom. Wow I am so honoured to have been asked to do the show. It is such an amazing thing to be a part of and I can’t wait to get started. Hopefully a few of my Gladiator moves will come in handy with the Tango or Paso Doble!\"\nNick Knowles\nViewers will know Nick Knowles for being a BAFTA-winning TV presenter. For the last 24 years, Nick has been the face of the BBC’s BAFTA-winning DIY SOS.\nAlongside this, Nick has always been passionate about travelling and most recently, worked with Channel 5 on various travel programmes including Into the Grand Canyon, The Mighty Mississippi and Nick Knowles in South America. Over the past two decades, Nick has presented across an extensive list of formats spanning news, factual, travel and entertainment and has solidified himself as one of the UK’s most familiar faces on television.\nNick said: \"I’m so, so excited to be doing Strictly this year. People may be more used to me getting stuck in on a building site or travelling the world, but dancing live on TV will be a whole new adventure. I’ve spent my whole life learning new skills and I’ve never been afraid of a challenge - there’s life in the old dog yet to take on one more big one – being taught how to dance! I’ll give it my everything .... and try not to embarrass my kids of course!\"\nPaul Merson\nPaul Merson is best known for being a former footballer and broadcaster. He made his debut playing for Arsenal Football Club when he was 17 years old and went on to win the PFA Young Player of the Year.\nPaul played for the club for over a decade, playing 424 times, scoring 99 goals and winning all domestic trophies, as well as the European Cup Winners’ Cup. Paul played 21 times for England, scoring three times and went on to play for Middlesbrough, Aston Villa, Portsmouth and becoming player manager at Walsall Football Club. Paul is now a football pundit and commentator and has written numerous books that cover his football career and personal life.\nPaul said: \"Joining Strictly is a whole new ball game for me, but I’m going to tackle this challenge head on. I’m ready to swap the pitch for the Ballroom floor, so here’s hoping my two left feet can learn some moves and you never know, maybe I’ll be taking home the Glitterball Trophy!\"\nSam Quek MBE\nSam Quek MBE is an Olympic and European Gold medallist, former England and Team GB hockey player and now a TV and radio presenter.\nSam won 125 international caps for the England and Great Britain women’s hockey teams, including a Gold Medal at the 2016 Rio Olympics. In 2017, Sam Quek was awarded an MBE for Services to Hockey.\nShe is now a broadcaster and has presented on BBC Morning Live and was a Team Captain on Question of Sport. Sam Quek presents for a range of sports including Football, American football, Rugby and Cricket. She co-anchored the BBC’s Tokyo Olympic Games Breakfast programme and regularly appears on programmes across the BBC’s radio channels.\nSam Quek commented: \"As a former hockey player I’m used to playing as part of a team, but the thought of dancing on the Ballroom floor in front of a live audience is quite daunting! I’m chuffed to be a part of this legendary show and Quickstep into the shoes of a performer, it feels absolutely surreal but I’m ready for every bit of the adventure.\"",
  "word_count": 2741,
  "scraped_at": "2026-02-14T12:33:31.168266"
}