{
  "article_id": "d99549957dd0",
  "url": "https://www.burntorangenation.com/2025/5/6/24424649/longhorns-daily-news-texas-justin-tucker-baltimore-ravens-nfl-sec",
  "title": "Longhorns Daily News : Former Texas K Justin Tucker released by Ravens",
  "date": "20250506T090000Z",
  "domain": "burntorangenation.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Former Texas Longhorns kicker Justin Tucker was released by the Baltimore Ravens this week, according to an announcement from the organization. Although franchise officials have called the move “based on football,” Tucker is currently under investigation for alleged sexual misconduct, NFL.com reports. At least 16 massage therapists in the Baltimore area have accused Tucker is instances of misconduct. Tucker has denied the allegations.\nLonghorns Daily News: Former Texas K Justin Tucker released by Ravens\nPlus: Texas softball takes series versus Kentucky\nWHAT THEY’RE SAYING ABOUT THE LONGHORNS\nAustin American-Statesman: Justin Tucker released by Ravens following sexual assault allegations\nAustin American-Statesman: Why Texas football QB Quinn Ewers fell in the NFL Draft\nAustin American-Statesman: Texas leads college football’s NCAA re-rank 1-136 after spring practice\nAustin American-Statesman: Golden: Texas baseball in gut-check mode after sweep at Arkansas\nAustin American-Statesman: New Texas basketball coach Sean Miller given 6-year contract\nDallas Morning News: Olympic swim great Gary Hall Jr awarded 10 medals to replace those destroyed in LA fires\n247Sports: Here’s a look at Texas 2025 NFL Draft selections rookie contract and first-year salary projections\n247Sports: Horns247 Staff Roundtable: Which of Texas’ 12 NFL Draft picks landed in the best spot?\nInside Texas: Video Reheat: Early Season Opponent Preview; Will Ewers go down as a Texas great or a what-if?\nInside Texas: Sourced intel on Duane Akina’s first 70 days back with the Texas Longhorns\nICYMI IN BURNT ORANGE NATION\nRECRUITING ROUNDUP\nAustin American-Statesman: Texas recruiting target excels at state track meet\n247Sports: Top track and field numbers for top 2027 Texas recruiting targets\n247Sports: Top transfer portal pickup on every 2025 Texas opponent’s roster\n247Sports: The Stampede: 10 flip targets for the Texas Longhorns\nSEC SHOWDOWN\nAustin American-Statesman: Texas Baseball: 3 things we learned from Arkansas’ sweep of Longhorns\nAustin American-Statesman: When will Texas play at the SEC Tournament, and who will UT face?\nDallas Morning News: Texas’ CJ Baxter, Texas A&M’s Will Lee III among SEC players to watch in 2025\n247Sports: Texas baseball coach Jim Schlossnagle has said life in the SEC is about how you respond. So, here we go.\nGood Bull Hunting: Aggies take series from No. 2 LSU\nRock M Nation: Mizzou Baseball allows two runs in ninth, swept by Georgia\nAnd The Valley Shook: AJ Haulcy transferring to LSU\nRed Cup Rebellion: Lane Kiffin’s first number one overall draft pick\nRocky Top Talk: Tennessee Vols’ fall continues in latest college baseball rankings\nRoll ‘Bama Roll: Alabama melts down on Sunday, loses series to Vanderbilt\nDawg Sports: We went to Jared! Bulldogs pick up huge 2026 quarterback commit\nA Sea Of Blue: Mark Pope is expecting a big jump from Brandon Garrison ahead of an important summer\nWHAT WE’RE READING\nSB Nation: NBA Playoffs’ final 8 teams ranked by their 2025 championship chances\nSB Nation: 10 best NFL free agents still unsigned after the draft, ranked\nSB Nation: Recently retired women’s college basketball coach could face Team USA in 2028 Olympics\nNEWS ACROSS LONGHORN NATION AND BEYOND\n- Texas softball took their series versus Kentucky over the weekend.",
  "word_count": 510,
  "scraped_at": "2026-02-14T13:21:00.258262"
}