{
  "article_id": "d9a7f35ff9ab",
  "url": "https://www.independent.co.uk/life-style/patrick-mahomes-donald-trump-tommy-tuberville-b2693807.html",
  "title": "Patrick Mahomes debunks Trump claim Senator Tuberville coached and recruited him",
  "date": "20250207T023000Z",
  "domain": "independent.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Patrick Mahomes debunks Trump’s claim that Senator Tommy Tuberville coached and recruited him\n‘I don't remember if I ever got to meet him or not,’ says Kansas City Chiefs quarterback\n- Bookmark\n- CommentsGo to comments\nPatrick Mahomes has contradicted claims by Donald Trump that Alabama’s Republican Senator Tommy Tuberville coached and recruited the Kansas City Chiefs quarterback. Mahomes told The Philadelphia Inquirer Thursday that he’s not even sure he ever met the guy.\nDuring the president’s executive order signing on Wednesday, Trump praised Tuberville, claiming that he had both coached and recruited Mahomes while he was at Texas Tech University.\n“Tommy Tuberville, a great coach,” said Trump, who’s attending the Super Bowl Sunday in New Orleans between the Chiefs and the Philadelphia Eagles. “You know, his quarterback was named Mahomes. He was a great college coach.”\nTrump said he asked Tuberville, referring to Mahomes: ”How good was he?” The president said Tuberville responded: “You don’t want to know how good … he made me into a great coach.”\nTrump added: “He’s a pretty good quarterback, right? Yeah, he was very good, and he’s a good guy too.”\nMany were quick to point out on X that Mahomes and Tuberville never even worked together. Tuberville coached from 2010 to 2012 while Mahomes played football at the school from 2014 to 2016.\n“Donald Trump said that Senator Tommy Tuberville coached Patrick Mahomes. Tommy Tubesocks left Texas Tech in 2012, two years before Mahomes arrived,” one post read.\nThe quarterback unequivocably told the Philadelphia Inquirer Thursday: “He did not recruit me at the time. I don't remember if I ever got to meet him or not.”\nPatrick Mahomes today: “He did not recruit me at the time. I don't remember if I ever got to meet him or not.” https://t.co/3yAHFpLnLt\n— Gabriela Carroll (@gablcarroll) February 6, 2025\nTuberville appeared to attempt to clarify the men’s relationship in a post on X, yet continued to imply that the two of them had a history. “As a coach, you start recruiting and working with players years before they get to college,” he wrote.\n“Patrick Mahomes was one of the best players I ever had the opportunity to recruit and get to know. Looking forward to cheering him on this weekend when I join President Trump at the Super Bowl,” he added.\nTrump announced on Tuesday that he would be attending this year’s big game at Caesars Superdome in New Orleans, making him the first sitting president to watch the Super Bowl in person.\nMahomes commented in a press conference about Trump’s attendance, telling reporters: “It’s always cool to be able to play in front of a sitting president – someone that is at the top position in our country.”\nMahomes was also asked about Trump’s previous comments when he called the Chiefs quarterback “a good winner.”\n“I don’t want to say, but there’s a certain quarterback that seems to be a pretty good winner,” Trump said when asked what team he would be rooting for.\nMahome said: “It’s cool to hear that he's seen me play football and respects the game that I play.”\nTrump also congratulated Mahomes and his wife, Brittany, on the birth of their third child, one month after the two of them shared the news.\n“Congratulations to the Chiefs GREAT Quarterback, Patrick Mahomes, and his very beautiful and BRILLIANT wife, Brittany, on the birth of their new baby daughter, Golden Raye,” he wrote on his Truth Social platform Thursday.\n“This is what I call a baby with great genes, both mother and father. It’s happy times in the wonderful Mahomes family. See you all on Sunday!”\nJoin our commenting forum\nJoin thought-provoking conversations, follow other Independent readers and see their replies\nComments",
  "word_count": 622,
  "scraped_at": "2026-02-14T14:15:53.595665"
}