{
  "article_id": "d9b154a8cc74",
  "url": "https://www.curacaochronicle.com/post/entertainment/ffk-clarifies-ticket-sales-for-curacaos-2026-world-cup-matches",
  "title": "Curaçao Chronicle | FFK Clarifies Ticket Sales for Curaçao 2026 World Cup Matches",
  "date": "20251217T160000Z",
  "domain": "curacaochronicle.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "WILLEMSTAD – In recent days, confusion has arisen regarding the availability of tickets for Curaçao’s matches at the 2026 FIFA World Cup. In response, the national football federation FFK issued a press release on Tuesday evening to provide clear and accurate information to supporters.\nAccording to the federation, tickets for Curaçao’s World Cup matches during the group stage can currently only be obtained through FIFA’s official ticketing portal. FFK stressed that travel company Corendon does not sell individual match tickets, but exclusively offers travel and accommodation packages.\nEarlier this week, Corendon announced that it would deploy a large number of aircraft to transport supporters to the match venues in Houston, Kansas City, and Philadelphia in June next year.\nFFK emphasized that any interpretation or reporting suggesting that match tickets are being sold through Corendon or via an FFK ticket booth is incorrect. FIFA allows a maximum of four tickets per household.\nDue to increased demand, an “FFK tickets booth” will be present today at Capital Ç, where supporters can register interest in additional tickets beyond the FIFA-imposed limit. FFK clarified that this concerns registration only and not the sale of tickets.\nBased on information received so far, FFK expects to receive a limited number of complimentary tickets from FIFA: two VVIP tickets, eight VIP tickets, 20 technical seats for staff, and 50 Category 1 tickets. In addition, FFK will be able to purchase 1,050 tickets under the Football Community Allocation, of which 852 will be made available to fans traveling with a Corendon package.\nThe allocation, as determined by FIFA, consists of 700 Category 1 tickets, 200 Category 2 tickets, and 150 Category 3 tickets. In consultation with Corendon, FFK will explore whether this distribution can be adjusted to increase the number of Category 3 tickets, which are the most affordable.\nA fourth category concerns Ticket Allocation Groups (TAGs). Under FIFA rules, at least 30 percent of supporter allocations must go directly to supporters, while a maximum of 70 percent may be allocated to TAGs. These groups must be football-related organizations rather than commercial entities and include clubs participating in local competitions, women’s or youth leagues, and referees’ associations.\nFFK announced that it will hold a video meeting on Wednesday morning, December 17, with the FIFA official responsible for ticketing. A press conference is scheduled for Thursday, December 18, during which the federation will provide the latest updates on World Cup ticket distribution through FFK.",
  "word_count": 405,
  "scraped_at": "2026-02-14T12:37:43.258755"
}