{
  "article_id": "d9cbcca1a9e0",
  "url": "https://www.westmeathindependent.ie/2023/09/29/republic-of-ireland-captain-katie-mccabe-signs-new-arsenal-contract/",
  "title": "Republic of Ireland captain Katie McCabe signs new Arsenal contract",
  "date": "20230929T110000Z",
  "domain": "westmeathindependent.ie",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Republic of Ireland captain Katie McCabe signs new Arsenal contract\nPA Sport Staff\nKatie McCabe has signed a new contract at Arsenal, the Women’s Super League club have announced.\nThe versatile Republic of Ireland captain, 28, has made 193 appearances for the Gunners, scoring 31 goals, since joining them in December 2015.\nMcCabe has helped Arsenal win the 2019 WSL title, one FA Cup and two League Cups.\nDuring the summer she skippered the Ireland team at the World Cup in New Zealand and Australia, the first major tournament finals in their history, and scored their only goal of the campaign, direct from a corner against Canada.\nMcCabe, who is on the 2023 Ballon d’Or shortlist, said: “Arsenal is home for me and I’m excited to have committed my future to this football club.\n“I’ve grown up here as a player and a person and developed a really special bond with our supporters, which means a lot to me.\n“Over the years, I’ve experienced some amazing moments here – but I believe that the best is yet to come and I know the aim here at Arsenal is to compete for the highest honours.”\nArsenal boss Jonas Eidevall said: “Katie McCabe brings us so much on and off the pitch, so we are delighted to say that she has signed a new contract here with us.\n“She has been one of the top performers in world football over the past few years and her quality and character are integral to what we do here.\n“We were very proud to see how she stepped up as captain when called upon last season and I’m looking forward to seeing what we can achieve together moving forward.”",
  "word_count": 284,
  "scraped_at": "2026-02-14T12:39:47.119609"
}