{
  "article_id": "d9dfdf04559d",
  "url": "https://thestandard.org.nz/how-not-to-win-votes-and-influence-people/",
  "title": "How not to win votes and influence people",
  "date": "20230613T000000Z",
  "domain": "thestandard.org.nz",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Written By:\n- Date published:\n8:45 am, June 13th, 2023 - 172 comments\nCategories: brand key, Christopher Luxon, climate change, john key, national, same old national, science -\nTags:\nWhen Don Brash strode the country seeking to be its next Prime Minister he divided, abused minority groups, got caught trying to hop into\nWhen John Key strode the country seeking to be its next Prime Minister he did the opposite, he brokered a deal to get the anti smacking legislation through, he took Aroha Hudson to Waitangi and he talked about dealing with the causes of poverty. He was surprisingly for National a positive future looking leader, at least that is the impression that he created.\nIt is interesting to see who Chris Luxon models himself on. And it is clearly Brash.\nYesterday’s incident where he was filmed describing New Zealand as a negative, wet, whiny, inward looking country that’s lost the plot displays a level of negativity about the country and its people that will present a real problem.\nAnd he should be thinking about the attitude shown by his own MPs.\nAfter all complaining bitterly about road signs in Te Reo suggests a fixation with stoking culture wars at a time when climate change should be dominating political discourse.\nNot only are they negative, whiny and inward looking but they have recently displayed a remarkable ability for magical thinking.\nIn the midst of a global crisis they have decided to appease the farming lobby by delaying agriculture’s entry into the Emissions Trading Scheme.\nAnd Luxon has accused the Government of blowing up the He Waka Eke Noa arrangement. Think of Luxon saying that in a whiny voice for full effect.\nLuxon’s statement is actually quite accurate. As long as you replace “New Zealand” with “National”.\n- Comments are now closed\n-\nIs there an edit needed in that first sentence?\n[Oops now corrected – MS]\n-\nMight refer to Brash’s awkward attempt to step into a speedway car which was shown on media channels at the time.\n-\nor when he tried to walk the plank to a boat. What he did hop into was a secret deal with the Exclusive Brethren to massively try and avoid election advertising rules and then hopped into a huge controversy as he tried to cover it up.\n-\n-\n-\nIf Luxon's latest blurt doesnt gain any %, will Willis again jump in to say it was just jokes?\nHe is desperate…(well thats a given), to claw back from Act. Desperation leads to error. He aint clever…or quick thinking. He will be tripped up by pressure from Green and Labour : )\n-\nIt's not even a slip of the tongue. Anybody can do the old \"foot in mouth\" gaffe and apologise afterwards but this is a deliberate, scripted line.\nWe know this because he's said the very same words before. It is – without question – what he believes, and wants to say, about the people, to the people.\nhttps://twitter.com/StrayDogNZ/status/1668161896175009793\n-\nIf this statement is going to be commented on, it should be stated in its context. I suspect I would be banned if I used a quote that way.\nHere is the statement in its context.:\n\"We have become a very negative, wet, whiney, inward-looking country and we have lost the plot and we have got to get our mojo back,\" Luxon said to one farmer.\nNotice, for a start, he used the inclusive word \"We\" meaning he was including himself in that description.\nAnd, I agree with him. The likes of Sir Ed would probably be ashamed of the way our society has become. We have become so needy, and so dependent on others to do things for us, and then complain if they don't.\nWe need to regain some of that \"can do\" attitude that kiwis used to pride themselves on.\n-\nhe used the inclusive word \"We\" meaning he was including himself in that description.\nNice try, but clearly contradicted by Luxon's own words, quoted in my comment above yours.\nWas Luxon born 6 years ago?\n-\nI suspect Luxon is quietly very pleased the left are getting themselves so off on this statement. It speaks directly to the divisive society created under Aderns leadership and ably carried on by Hipkins. Bit it also talks to the ability to bring back the kiwi can do on October 14.\n-\nI am thinking this also. I think there may be a plan to allow the media etc to froth at the mouth at these sort of statements, and show themselves as totally unhinged.\nThen, Willis steps in and counter-attacks like she did the other day.\n-\n-\nI am not sure if it is making a fool of himself.\nThe sort of comments he has made have been blown way out of proportion and distorted by the media. Look at the headlines for this. They all place it way out of context, and try to display it as something shocking and terrible, likely to grab headlines.\nBut the comments themselves have been throw-away comments of the type that most of us probably make every day in one way or another. And, I think the average person realises this.\nIf the media are going to behave in this way, and examine the minutiae of everything said in order to manufacture scandals, then, it is probably good to have a strategy to counter it.\nRather than snivel and apologise at every turn, it is probably better to fight back and point out how stupid and precious the media is being over this sort of stuff.\nNote, that trust in the media is continuing to decline. So, pointing this sort of stuff out probably has a lot of people nodding in agreement.\nhttps://www.aut.ac.nz/news/stories/trust-in-the-news-slips-further\n-\n-\nI heard HDPA saying virtually the same as me on the way home tonight, because, it appears that Luxon had doubled-down on his comments rather than walking away from them, and used it as an opportunity to launch an attack on Labour.\n\"I'm calling the Labour Government wet and whiny,\" Luxon replied. \"There's nothing wrong with New Zealand or New Zealanders. It's the best country on planet Earth and we have endless potential.\"\nThe National leader said New Zealand had gone backwards under the current Government and it would be \"positive\" under an \"ambitious\" National Government.\nContrast that with the snivelling apologising that was going on last year.\n-\n-\nIncognito.\n-\n-\nLuxon has not doubled down, he is desperately trying to walk back from \"We have become a very negative, wet, whiny, inward-looking \"country\" Clearly he wasn't referring to Labour at the time, unless he sees Labour and the country as one, and the same.\n-\n-\nIncognito.\n-\n-\n-\n-\nIMO you and Jack are in denial, others are not to blame for Luxon's constant foot-in-mouth syndrome. How long before this gaffe is 'clarified' and walked back?\nThe media defended another Luxon gaffe just recently.\n\"Jack Tame: Luxon wasn't seriously urging us to have babies\"\nhttps://www.1news.co.nz/2023/06/09/jack-tame-luxon-wasnt-seriously-urging-us-to-have-babies/\n-\n\"Jack Tame: Luxon wasn't seriously urging us to have babies\"\nThat is true. And Jack Tame is one of the more sane ones. But, Cushla Norman equating Luxon's views with Nazi experiments?\nThis is the sort of unhinged, frothing at the mouth sort of stuff I am referring to. I don't think anyone should complain about ratonal media investigation. But, beat-ups like the one mentioned above, shouldn't be tolerated, and should be pushed back on as hard as possible. And the people asking such stupid questions need to be publicly shamed.\n-\n-\nAgain, comments that are blown out of proportion by the media in the context they were given. But from early last year.\nIt looks like Luxon had a different strategy back then, focusing on explaining or justifying, which just made him look weak.\nIt looks to me that the strategy has changed. Had that same line of questioning been given today, I expect the response would be more along the lines of:\n\"Stop deliberately blowing things out of proportion to make an issue out of a non-issue. Most kiwis would understand exactly what I meant. If you can't, then I really can't help you.\"\n-\nLuxon has not said that though and his strategy hasn't changed, he keeps putting both feet firmly in his mouth.\n-\nI think his inexperience as a politician is showing through a bit. But, also, I think the media is continually shreiking about various inconsequential statements and trying to paint some sort of picture they want to represent, rather than reporting reality.\nAsk Chat GPT why the trust in media is declining. One of the reasons given is:\nSensationalism and clickbait: Some media outlets prioritize sensational stories and headlines to attract attention and increase viewership or readership. This emphasis on generating attention-grabbing content can create a perception that media organizations prioritize entertainment value over accuracy and in-depth reporting, which can erode trust.\n-\n\"his inexperience as a politician is showing through a bit\" A bit?\nA number of Luxon's gaffes haven't been inconsequential though. Do you think the media should ignore whatever comes out of Luxon's mouth, even when they can get some headlines out of it?\nHow ChatGPT reacted to Nicola Willis' idea that AI could write Kiwis' tax receipts\n\"It would be impossible for me to provide tax receipts for every New Zealander,\" it replied\"\n-\n-\n-\nin the context they were given.\nThe nature of the audiences he was addressing made it pretty damn clear what the context was; to the party faithful high calibre Māori were deserving folk like you and I and to McIvor's rabid listeners bottom feeders were undeserving folk not like and you and I.\n-\nMy tuppence: correct English is \"like you and me.\"\n\"Like you and I\" is utterly wrong when 'like' is a preposition.\nLooks like he needs to spend some of his huge election funds on some grammar consultants. (In that sentence, \"like\" is a conjunction, not a preposition.)\nJust saying.\n-\n51% in SC English. That's my excuse and I'm sticking to it….\n-\n-\n-\n-\n-\nThe media often ask dumb, inflammatory questions over something that has been said or done. If memory serves, Cushla Norman, like several reporters, is highly critical of the Labour govt.\nLuxon, who makes way too many gaffes and flip-flops, should consider thinking first before opening his mouth.\n-\nAs someone said, there needs to be a couple of speed bumps between his brain and his mouth!\n-\n-\n-\n-\ntsmithfield # 4.3.1\n” think there may be a plan”\nLol….you are taking the piss?. Except… its a plan…so cunning\n\"I have a cunning plan\"\nJust lmao : )\n-\nI think there is a plan to deal with media misrepresentation. That is by pushing back strongly against that nonsense rather than wimpering and apologising.\nNot a plan around deliberately making gaffs or any such thing.\n-\nIf there is a plan, the National Party doesn't appear to be following it. Do you feel the same when the media misrepresents govt or any other party that is not National?\n-\nYeah, I do, actually. It all gets a bit tiresome, and it is never clear if it is just a media beat-up or not.\nOh for the days of true investigative and balanced reporting.\n-\nI haven't seen any comment from you in defence of Labour and the Greens.\n-\nAnd please, tsmithfield, the word is 'gaffe', not gaff, which is a nautical term basically for a pole with a hook on the end.\nMind you, you could have been deliberately making a gaffe, couldn't you?\n-\n-\n-\nThis plan trope is getting tired.It is a Crosby Textor, very old card trick.Sheesh I cannot believe right wing numbskulls are still paying for this low rent electioneering.It first blew up on Campbell Newman here in Queensland years ago,he lost the premiership in a landslide after just one term.The Tories tried it,look at the local body elections there.Keep asking for details,you will flummox him.\n-\n-\n-\n-\nCouner attacks!!!???\nIs that what they call clean up in aisle 7 these days.\nHow long since your say willis standing next to luxon?\nThey ain't no team\n-\n-\nDisagree with you, Jack. NZ was divided long before the global pandemic.\n-\n-\nWe need to regain some of that \"can do\" attitude that kiwis used to pride themselves on.\nNumber 8 wire and that \"can do\" attitude meant settling for on the cheap fixes, short-termism, shitty, poorly designed houses fit for neither purpose nor climate, shoddy, over priced consumer goods, Thames-assembled motorcars, and the Trekka.\nBecause that was all there was.\n-\n'We need to regain some of that \"can do\" attitude that kiwis used to pride themselves on.'\nYou mean like 'Make NZ Great Again' ?\n-\nI have a bit of time for number 8 wire.\nBack in the day. I had a Cockies' Roller – a Triumph 2.5 – lovely ride. But low-slung. Nearly every time I did a dirt road the muffler would cop it – $50 – $100 for a new shitmetal bracket. One day, a mate & I (a Coaster) drove up to Lake Onslow, where the ridged road did the usual. Dave was off out the door and back from a strainer post with a bit of spare wire in minutes. He did a Spanish Windlass around the muffler with it, and not only were we good to go, but I never had to buy another shitmetal bracket.\nWe caught a few fish too – 'twas a bloody good outing, right down to the cold roast ducks I'd brought along for lunch. If you're ever at Onslow, and the wind is annoying – try the Teviot River – used to be a lot of hungry browns in it.\n-\nDuring development of the central north island's SWER system #8 wire was routinely used as an overhead high/low voltage conductor. And often as not it was carried on railway track poles. Encountering either was the stuff of nightmares for a distribution liney. Bouncy, brittle, and terrifying.\nSo no, I don't share your fondness for #8 wire and the \"can do\" attitudes that once prevailed.\n-\n-\n-\nWe have become so needy, and so dependent on others to do things for us, and then complain if they don't.\nI see it more this way – some of us have become so corrupted by an ideology that insists we are not all mutually dependent, that they scream and fight like rats in a hole whenever they are reminded of the fact.\n-\nNotice, for a start, he used the inclusive word \"We\" meaning he was including himself in that description.\nYou could be right – maybe would-be PM Luxon feels that he himself has \"become a very negative, wet, whiney, inward-looking\" person who has \"lost the plot\", and that he needs to get his \"mojo back.\"\nThis would make sense, given he isn't a particularly positive political figure – but Luxon/Luxoff will no doubt clarify his comments in due course.\nLuxon's polls 'abysmal' but National leadership change unlikely\n[21 May 2023]Kiwis unsure on Luxon five months out from NZ election – poll\n[15 May 2023]\nNewshub also polled on whether the leaders were seen as \"in touch or out of touch with the issues facing New Zealanders today\".\n…\nDespite his protestations, Luxon was 9.8% in the negative, with 37.2% in touch and 47% out of touch.\n-\nI've lived in alternative Aotearoa since I first became averse to the neocolonial ambience of the 1950s as a child. Everyone assumed being part of the empire was normal. They got a scared look in their eyes when I talked to them, so I realised I wasn't normal.\nOur electorate contains a tertiary independent component: folks who transcend the ancient binary. While left-wingers & right-wingers remain attached to NZ, the positive alternative to that antiquated pile of shit grows steadily stronger by including all those who are neither left nor right in their political stance.\nLuxon's reluctance to acknowledge National's role in perpetuating historical crap probably just indicates his lack of interest in learning from history. Nonetheless, trashing one's home country is a political tactic unlikely to impress other neanderthals. Also, crucial swing-voters will likely see his display as a pathetic attempt to blame the people for how they feel about things currently. Blaming humans for human nature seems irrational.\nI saw a gallup poll recently which measured the US electorate as 40% independent, with 30% each self-identifying as either left or right. The disaffected are trending towards a majority. The traditional political terrain has been morphed by neoliberalism, producing a challenging context for political operatives; how to market to this emerging group? Brand psychology suggests that a nifty label usually works. Watch this space!\n-\n-\nAloha!\n-\n-\nhttps://teara.govt.nz/en/political-values/print\nGoogling views on New Zealanders by politicians I found the above article by Stephen Levine. It looks at how we Kiwis see ourselves from colonial times onwards uptil 2012 when the article was written.\nLuxon's 'losing the plot' remarks are not in line with Levine's historical findings which were positive about our values of being 'good neighbours', equality and inclusiveness.\nHave we changed and is Luxon tapping into some well of despair, or is this more like his version of MAGA Trump wanting to make NZ great again?\nFirst describe our society as destroyed and then propound yourself as the one who wants to rebuild. Is this Luxon the redeeming prophet, the one to lead us from the wilderness, who will part the waters and lead us to better pastures?\nI believe that there is a fundamentalist side to Luxon and that his way of searching for enough votes to take power will part the social waters and leave them divided.\n-\nA mass are whiny. About anything, everything. If there was nothing to whine about they’d whine about that.\nAll Luxon has to do is harness that to the serious Act mob and he’s PM. Actual polls which have him not riding high are how important? I’m sure many will overlook Doofus in the rapture of their whinefests.\n-\nWell so Media would have us believe.\n-\n-\nI think he's still preoccupied with making babies and has been misquoted, he actually said \" wet and winey\" not giving a thought to foetal alcohol syndrome in the coming generation.\n-\n\"We have become a very negative, wet, whiney, inward-looking country and we have lost the plot and we have got to get our mojo back,\" Luxon said to one farmer.\nWell before we throw everything out because it is said by someone from the right ie kneejerk then let's look.\nI, for one, have long said that NZ as a nation seems to have turned into a nation of whiners. Though I have called them 'Moaning Minnies' and have long pondered (tongue in cheek) if this trait came in with Covid and it was a little known component called the 'Moaning Minnie virus'.\nNow of course we are fiercely trying to backtrack on the Covid measures that were taken too much, too soon, not enough, took away rights, etc etc. We lived for a time when there was no vaccine. So we moaned all the way through about measures to save lives. We moan about Maori issues, we moan about water issues.\nInward looking goes part & parcel with moaning.\n'Wet' is the piece I think he has got wrong. Having worked through the late 1980s 1990s neo lib restructuring, in comparison with Drys of that era such as David Caygill, Richard Prebble and Ruth Richardson we are 'wettish'. We had a phrase 'she is so dry she is almost combustible'. I don't think we have anyone on the left that is the opposite of that.\nI think the Nats/Labour are clustered around the middle in the 'Damps' category. Act is probably the 'cold damps' (the type of washing you need to bring inside and warm them up before you can work out if it is dry or damp'\nWe have been drawn into dark places by issues that were imported and not pressing ie the self ID, no debate. Some of the rhetoric around Covid falls into this category.\nOur politicans seem dour even Hipkins has passed his powerful 'man of the people' sausage roll lover/spreading your legs twinkle' peak and has become an anonymous man in a suit. He has entered the dreaded charisma-free zone.\nOur lack of mojo is apparent with Labour seemingly timidly squandering a large majority and goodwill by tinkering. How are we to make NZ a better place if we don't spend some 'capital' to do it? Our capital is for the people stuff.\nRelative to the world we are a poor country $$$$$. Our citizens are poorly paid and some of organs of state don't work well for us eg tax rates. We have built up wide disparities of income/wealth.\nWe are rich in landscape, fresh air & water but we cannot live on them. In fact we have let some of our citizens squander even those benefits to enrich themselves eg industrial dairying on sensitive soils, leaching nitrates into aquifers etc.\nSo let us have a look at what Luxon has said. We surely have more integrity and self knowledge not to rail at someone who may be telling the truth as he seees it and whose words/thoughts may actually be correct or partly correct.\nSurely we are not so tribal?\n-\nBut Luxon's claim is …\nIt's only happened in the last six years.\nAnd the issues you mention (\"wide disparities of income/wealth\", \"rich in landscape, fresh air & water but we cannot live on them\", etc) are the very opposite of what Luxon cares about, or wants to do something about.\n-\nWell the Moaning Minnie stuff definitely started for me in the last 6 years. Now in our backtracking we are in full moan about the measures that were taken to keep us from dying prior to the vaccine being widely available. PM Ardern is still a handy moan/whine starter if we run out of something current.\nSome of the policies that have been shelved are because as part of an election build-up people would be moaning/whining about them and we might lose the election.\nLet us see if we can glean something that we can use, out of this perhaps off the cuff, porhaps not, comment by Luxon.\n-\nLuxon is tapping into the latent frustration of worldwide after effects of covid for his personal and political gain… nothing else.\nHe is shark like, wanting to hunt bargains in the fire economy. He belongs to the same evangelical marketing school as Morrison.imo\n-\n-\n-\nPerhaps Hipkins more serious side is a result of knowing how NZ will be buffeted by International events, where Luxon seems to blame us, without any warmth or assurance about our future. Have you not noticed that lack?\n-\n-\nGoodness me election snarling has come early to a blog near me.\nHe said it to a farmer and the Nats are traditionally the farmers' friend. Anyway no matter who he said it too, whether he meant the poor farmer he was talking to or NZ as a place, surely we could look at it and learn from it if need be. So you like your medicine from Nanny state's left teaspoon, others might be willing to take a look at the teaspoon in Nanny's right hand.\nIf the Nats are going to run a campaign on sunshine and sprinkles my pick, on the amount of fed-upness and grumpiness about at the mo', is that could be a sure fire winner. So he may be giving us a head's up on a part of their campaign to set out how down we are so Sprinkles Nats can bring our smiles & $$$$ back. At least I hope the people running the campaign for Labour are looking at this possibly inadvertent look into a campaign strategy.\nIn one of those tiresome Stuff polls I saw earlier today (but now cannot find) about 62% felt he had got the mood of the country about right.\nAnne also linked to it\nhttps://www.stuff.co.nz/national/300903899/yeah-nah-is-nz-a-negative-wet-whiny-inwardlooking-countryI do not resile from using the word tribal. When you follow the leader through thick and thin through good and bad places without thinking, without being able to see that someone else might have a point then we have become a very sorry place to be. We were so tied up in the Moaning Minnie virus that came in, in my view with Covid, that some moaned at restrictions designed to save our lives……\nReal whiny +++++++ and squared.\n'Jees Wayne' as they say.\n-\n-\nHow do you know the farmer was poor?\nSolely on the basis that a earbashing from Luxon would put you on the back foot. Also not all farmers are lining up to vote National……\nI like to see for myself and make my mind up about uttterances, hence the reference to 'tribal', earlier on. I don't have the mind that says something from a right wingers BAD, anything from a left winger GOOD. Both are able to supply a good thought just as they boith are able to supply a nutty thought.\nAnd the fact that I have a view that whining is fast becoming or has become, a noticeable trait goes back to the very start of the Covid response.\nNice deflection though about ACT. Not my point at all.\nMy point was that perhaps the idea of naming the problem – whining and moaning – and then making sure that subsequent utterances are about solutions that would put a smile on the dial could be worth looking at.\nAs I said the Stuff silly poll does seem to indicate that he has struck some sort of recognition.\nThen we have Luke Malpass in Stuff today\nThe gloom and pessimism is something Labour needs to counter. Altough you may not believe this needs to happen, I am sure/hopeful that those working on the campaign from the Labout side will be following this.\nFinally can you actually respond to what I am saying rather than barely hidden ad homs and criticism of a writing style. Thanks.\n-\n-\n-\n-\n-\n-\nYou don't blame others though.. there in lies a fundamental difference. You have self awareness\n-\n-\n-\n-\n-\nLuxon represents a significant strand of Pakeha settler thinking that really hasn't moved on from the days of the 19th century pastoralists, kauri harvesters and gold miners. Go to the far flung colony, extract as much wealth as you can, and then retire to a more bucolic and civilised corner of the world.\nThese are the people who don't like Maori language, who think NZ was \"prison\" during the covid lockdowns and long to live in a village in Provence.\nIn any event – this comment fails the most important test of anyone who aspires to lead us. Like Caesars wife, the PMs loyalty must be above question. As it stands you suspect that if Russia ever invaded NZ, Luxon and his mates would be the ones Googling flights out of here, not how to make Molotov cocktails.\n-\nSo succinct and so correct. Sanctuary\n-\n-\nWell, the red-necked retired boomers are getting on to Luxon's nonsensical bandwagon boots' n all:\nhttps://www.stuff.co.nz/national/300903899/yeah-nah-is-nz-a-negative-wet-whiny-inwardlooking-country\nCurrently 60% for Luxon, 40% against.\n-\nGood numbers. He only needs to resonate with 51% of the country. To resonate with 60% is great. Rather that than having to be a PM explaining why gangs in rural towns can dictate when kids can go to school or why 10000 complaints about antisocial behaviour in state houses results in only 3 evictions.\n-\nWhat about the anti-social behaviour of tenants in private rentals? Why are state housing tenants singled out when the majority are not a problem?\n\"gangs in rural towns can dictate when kids can go to school\" Do you have a link please?\nThose polls on Stuff and Newshub are easily rigged. People can vote as many times as they like by deleting their browsing history after each vote.\n-\nI think you can pretty much guarantee that anti-social behaviour of tenants in private rentals will result in swift eviction.\nThat kind of behaviour is likely to result in damage to the house (about which the landlord cares a great deal) and/or a high administrative burden for the letting agent in dealing with complaints (about which the agency cares a great deal).While a great number of state housing tenants are great tenants – the minority who are not, are not being effectively dealt with by HNZ/KO.\n-\n\"Landlords eye up lucrative holiday rental market, others sell up as bad tenants hard to move on\"\n-\nI'm unable to read your link – since it requires a subscription.\nAlthough, if the landlord is putting the property on the Air BnB market – they’ve clearly already got rid of the problem tenants.Problem tenants, will never get another open-market tenancy ever.\nIf you're not aware that there is a massive shortage of rental property, and that tenants are bending over backwards to be seen as good tenants to retain the tenancy or get a new one – then you've clearly not been living in NZ for the last 5 years.\n-\nOnly some are choosing to put their rentals on the holiday rental market. For many years landlords have often complained about how difficult it can be to get rid of problematic tenants. National broke NZ's housing market and left a housing crisis, so of course I am well aware of the consequences of that, but badly behaving tenants, which includes the private rental market is not new and certainly predates this govt. It's as though you weren't living in NZ prior to the 2017 election.\n-\nYes, of course there are badly behaved tenants in both private and state rentals. The difference is that the private landlords take action to remove the tenants, the state…. not so much…..\nWe have had story after story in the media of appalling behaviour, intimidation, threats, and making life unendurable for neighbours of problem KO tenants.\nWe've even had IRL examples provided on TS.\nYes, of course, it's only the worst examples that make the news. But it's also the worst examples which should spur KO into effective action.\nDon't hold your breath.\nAfter thousands of documented complaints (and we also have evidence that 'documentation' requires some considerable effort from the complainant) – a grand total of 3 have been removed from the KO tenancy (and no doubt, relocated to make someone else's life a misery).\n-\nMedia single out Kāinga Ora, it makes good clickbait, much like benebashing, when the same kind of instances that you have described occur in the private rental sector as well. Media do not report on the complaints private landlords and property managers receive. This is not a new issue that has suddenly occurred in the last 5 and half years like you seem to think.\n“One of the provisions in particular will enable Kāinga Ora to implement a warnings process, allowing us to apply to the Tenancy Tribunal to end a tenancy should there be three separate, and evidenced, incidents of a serious nature within a 90 day period.\n“Of course, it is important to note that this course of action will only be used for the very small number of cases where severe and persistent disruptive behaviour is apparent.\n“We also do not want to make a customer homeless; we will move them to another Kāinga Ora home and continue to provide them with the intensive support they need to address the causes behind their behaviour. Making people and whānau homeless creates a revolving door for housing which only sees problems compound and perpetuate.”\nhttps://kaingaora.govt.nz/news/kainga-ora-implements-new-tools-to-manage-disruptive-behaviour/\n-\nNope. I think that any private landlord who persistently ignored \"severe and persistent disruptive behaviour\" would also be 'featured' in the media.\nCan you give a single example of this happening? I sincerely doubt it, since private landlords have an incentive to only retain 'good' tenants; and private tenants have an incentive not to be seen as troublemaking – as pointed out above.\nThere are literally dozens of KO ones in the last year. Like this one.\n90 callouts by police over the last 5 years.\nAnd, to actually get the police to turn up – you're talking a serious incident – they're not going to to show up because you're squabbling over the back fence.\nIt makes you wonder just what the criteria for \"severe and disruptive behaviour\" is for KO. What does it take? A murder?\nIt's noteworthy that the number of reported issues (which the rest of the community would regard as 'serious') – for KO haven't diminished significantly in the last year – which indicates that their vaunted tools for managing disruptive behaviour just aren't working.\n-\nThat is your opinion. Already gave you a link where private landlords have struggled to have tenants removed. It can be a complicated process. Landlords can and do remove 'good' tenants' if it means they could charge a higher rent to someone else.\nDo you think troublesome tenancies never occurred before the Labour govt? Do you also think there has never been a police call out to a private rental? If so, that's pretty deluded.\nHow many complaints turn out to be a case of nimbyism? Kainga Ora has a better grasp on what's going on than you do.\n-\n-\n-\n-\n-\n-\n-\nJack seriously believes that the local election turnout was 71%! Must be true, because an online Stuff thingy said so.\nThe actual turnout was 36%.\nThere's a good reason why there are constant complaints against these \"polls\" to the Media Council. They are not polls, they are bot-fests. You can literally watch them being rigged in real time.\nBut you don't have to believe me, just ask woke leftie David Farrar, who complained to Stuff about these polls that poor old Jack is fool enough to believe.\nMr Farrar says the statement that only one vote per computer was allowed is factually wrong and that it is “trivial” for internet users to get past restrictions.\nhttps://www.mediacouncil.org.nz/rulings/david-farrar-against-the-dominion-post/\n-\nYesterday I asked if you where thick when you completely misquoted my post.\nToday I ask the same question again, given your understanding of statistics seems equally astray. Turnout relates to a population, a poll to a sample. Ask 100 people in my local area if they like pizza and 70% say yes. It doesn’t mean the local pizza shop is going to sell 0.7 times the population in pizzas tonight!\n-\nI'll back a professional pollster's understanding of psephology stats over your deliberate misunderstanding.\nTroll less, read more. I already provided the links for you.\n-\nYou provided a link to a complaint that was declined. Bit like your mis-quote yesterday. Keep up the good work. You add great comedic value to this site. You’re one of my favourites.\n-\nAre you Christopher Luxon? Same MO … every time you get caught out you resort to bluster.\nLet's try once more. Yesterday you said (incorrectly) that National had announced its tax policy for the election.\nI asked you to link to it. You didn't (because there has been no such announcement).\nCan you link to it now?\n(or just say \"I got it wrong\", a much better answer than Luxony bluster, but that's up to you).\n-\nNow, now observer- you are beginning to take up sword to dispatch small fry. Not very quaker of you!\n-\n-\n-\n-\n-\n-\n-\nI think the '\"gangs in rural towns can dictate when kids can go to school\"\nComes from here.\n-\n\"Ōpōtiki’s mayor has denied his town is being “held to ransom” by gang members\"\nhttps://www.stuff.co.nz/national/132301628/ptiki-not-held-to-ransom-amid-gang-tensions-mayor-says\n-\nSo the schools were wrong to close, then…..\n-\nDid you not read the article?\n-\nOh yes, I read the article you posted. Did you read the one I posted?\nSchools are closed because of gang presence in the town; vs Mayor says there's no issue.\nOne of them has to be wrong.\nOr, are you saying that the town is safe for grown men walking their dogs – but not for school kids?\n-\nI believe the mayor over National's Mark Mitchell.\n@link 12.1.1.3.1 “It was their call to close those, there’s a school that thought they should have been open and carried on as normal \"\n“If they’re closing that’s their choice, we can’t get involved in that side of it. The schools that were open yesterday, large numbers of children were away anyway\"\n\"The gulf in this report between Mark Mitchell's inflammatory rhetoric and what local people and police in Ōpōtiki say is extraordinary\"\nhttps://twitter.com/publicaddress/status/1668778094726107136\n-\nSeems to be no doubt that many schools are closed – for the gang related reason, rather than teacher strike action (the other reason that secondary-school kids are out of school this week).\nhttps://www.neighbourly.co.nz/public/opotiki/opotiki-district/message/70074265\nYou may not like Mitchell's messaging over this – but you can't deny the facts.\n-\n“but you can’t deny the facts” lol that’s rich.\n\"The schools that were open yesterday, large numbers of children were away anyway\"\nAs the link posted to you showed, the Mayor, the police, and the local people disagree with you, Mark Mitchell, and Chris Luxon.\n\"Yeah, I'm sorry for being a pill about this but an awful lot of my family live in and around Ōpōtiki. This bullshit posturing from politicians who basically said \"fuck you, drop dead\" to the East Coast decades ago is… not amusing\"\nhttps://twitter.com/CMRanapia/status/1668421804665499648\n-\nI see, you clearly can deny the facts.\nIn your world, all schools were open.\n[Where did Louis say or imply that “all schools were open”?\nLink and quote the exact words or retract & apologise for twisting words to win an argument.\nYou’re in Pre-Mod till then – Incognito]\n-\nNow Hipkins is commenting on the situation in Opotiki\n\"I think communities are entitled to feel safe and it's not okay that schools had to be closed and members of the community were feeling intimidated and unsafe,\" Hipkins said.\n-\nRawiri Waititi was wrong about the PM. Unlike National Mitchell and Luxon, Hipkins didn't attack iwi.\nPeople are entitled to their opinions, even though locals and those who were there have a different view.\n\"Award-winning Māori film-maker and director Kim Webby says the picture painted of her hometown being held to ransom by gang members was point-scoring by Opposition MPs using Ōpōtiki as a political football and a gang tangi as the cue for outrage\"\n\"The worst offending during the day yesterday were a few burnouts\n\"Top cop lashes out at 'mainstream media' over Ōpōtiki Mongrel Mob funeral, says most locals 'happy\"\n-\n-\n-\nWell, I apologize for claiming that you said \"all schools were open\"\nYou did not say this.\n-\nApology accepted.\n-\n-\n-\n-\nGangs in east Auckland dictate who can live in the Grammar zone…\n-\nYes its those definitions again especially when the definitions have a pejorative meaning!\n-\n-\n-\n-\n-\nYes Anne, sad isn't it. Again people want to align themselves with the \"Top Table\" not realising they will get only the trickle down crumbs.\nTo have lived long enough to see the pattern repeated three times in 82 years.\n-\nNot necessarily boomers, rednecks or not…..could be a new \"Answer Bot\" in action generating numerous ISP IPA's.\nLuxon and Willis are fond of AI remember……\n-\nYeah, that's your opinion on what that survey means, and it's a stretch to come to the conclusion you've come to, for two reasons.\n1) It's a totally unrepresentative stuff survey and\n2) You have no idea how many people are saying that NZ is \"negative, wet, whiny, etc\" because they think the Nats and CL are \"negative, wet, whiny, etc\"\n-\n-\nLabour ministers seem to be doing a great job of not winning votes: Stuart Nash, Jan Tinetti, Michael Wood …\nChris Hipkins must be fearful that more bumblers will emerge pre-election.\n-\nHunter, you may need a wee reminder of National's recent history with their some of their dubious MPs, candidates and a person called Michelle Boag, and their fake talk back callers. People in glasshouses…. Humans are not perfect, even in National's ranks.\n-\nSome people have very short memories when it comes to the National Party.\n-\nSlate memory even!!!\n-\nYes, true. It is as though there had never been a National govt prior to 2017.\n-\n-\n-\n-\nI'm sure the sentiments went down well with the crowd he addressed them to – the privileged minority that imagine the Key years were something other than an epic clusterfuck mislabeling property inflation as growth while overall wealth and productivity declined.\n-\nI think Chris Luxon lacks emotional and social intelligence.\nHe does not keep agreements where they impinge on his interests regardless of impacts.\nHe has no time for people's fears or anxieties, and all of his suggestions would trample others rights and stand to enrich him and his supporters.\nHe has regularly dismissed his teams short comings while pouncing on left slips.\nNZ has been hit by extreme weather recognised as part of climate change effects. His answer, to call us \"wet moaners\". Wow!! Unfeeling clod.\nFurther, does he have a plan to meet climate change? No no!! Let's kick that can down the road for another 5 years.\nAs the right ever have, investing in short term return, rather than develop resilience, then blame the very people who live with the resulting fallout. \"The wet moaners\", while the \"Dry right are insulated by their wealth and choices.\nChris Hipkins fired back, \"Well he badmouthed us overseas, now he is now doing it at home.'\nIt is worse than that. He has promised to walk back all things bought in by the Labour and Greens, supported by Act to do that.\nWhat does that mean? No wage rises apart from an occasional 50cents an hour. Charges instituted under the old user pays (or goes without). The $5 on prescriptions just the beginning.\nThe Policies produced appear rather ad hoc and no explanation of costs. That might be to avoid budget booboos which affected their past efforts. But believe money is their centre, not us.\nWhile our PM and the Trade delegation are “Hustling” in China he is moaning to farmers we are doing nothing.\nHe is so like Trump Johnson and Morrison in his \"I have the answers to making Kiwi can do come back\" it really worked for them didn't it?\nSimple solutions for complex problems offered by buffoons.-\nPatricia.\nI do not recall any previous National govt securing 7 new/upgraded FTAs like Labour has achieved. Farmers are doing exceptionally well under this govt.\n\"While times are challenging for the agriculture sector, it continues to forecast positive years ahead for our farmers and our growers. That growth outlook is assisted by the significant expansion in free-trade agreements since we became the Government—seven new or upgraded free-trade agreements in total, with nearly 75 percent of all our exports now covered by a free-trade agreement, compared to around 50 percent when we became the Government\"\n-\nYes Louis, just so.\n-\n-\n-\nSounds a chunk more real than Chippie's perpetual hedging and shuffling.\n-\nDoes feel like it is on a loop\n-\nI don't think this is the gotcha that MS thinks it is.\nThere are many disgruntled kiwis out there frustrated with the lack of progress under this government. The lofty ambitions of 2017 have never come close to being realised.\nLuxo is tapping into that sentiment.\nHis prescription is not the answer, but I completely understand where he is coming from.\nThe Green Party has the best policies to move this country ahead.\n-\n-\nAct would push National and Luxon further right and we would lose all that.\n-\n-\n-\nDonate Ad, so we can publish what we are doing. I noticed back page treatment for your mate Robertson when he and Shaw had a meeting in Australia with their counter parts. More \"clicks\" in Luxon bad mouthing. Working Government is ho-hum to our media, so donate so we can show our \"hustle\".\n-\n-\nAs predicted (because Luxon is very predictable), today he has \"clarified\" his comments and pretends that he didn't say what he said.\nSo, we're actually a great country, but wet and whiny, thanks for clearing that up Chris.\nhttps://www.1news.co.nz/2023/06/13/i-am-a-big-patriotic-kiwi-luxon-clarifies-whiny-comments/\n-\nSnap! just posted on that too.\n-\n-\nThat was quick. Luxon has 'clarified' and walked back on his negative comment. He now claims he was referring to Labour, despite initially saying \"very negative, wet, whiny, inward looking \"country\"\nhttps://twitter.com/rugbyintel/status/1668440018556420097\n-\nSo, he's either \"clarifying\" what he meant or he's claiming \"I was only joking\". How are we supposed to know which is which?\n-\n-\nHow do YOU know? 😉\n-\n-\nYou are correct. I'm not a Nat voter.\nVoted Green last time. Probably Labour this time around. 🙂\n-\n-\n-\n-\n-\nIt was walking back by attacking. Much more effective than whimpering apologies over minor transgressions.\n-\nThat lie is cold comfort to you, tsmithfield.\n-\nPeople don’t like him because he’s a BS artist who has made it very difficult to know what he’s genuinely about.\nReligion isn’t normally the sort of thing people can dispense with in NZ for the convenience of a political campaign. Bill was a sincere Catholic who didn’t want to talk about it and the others said they didn’t believe in a God and no one really was that fussed.\nBut someone who can’t be understood at any time because he’s all over the map, well who the bloody hell is he?\n-\n-\nBut wait, there's more … Luxon walk-back story number 479:\nQuote:\n“The episode has led to some raised eyebrows in the National Party at Luxon’s inability to see an obvious political risk.”\nWhen will Nicola insert the knife?\n-\nWillis has done her stint on clean ups too well, so others are stepping forward like Judith, Uffy and the Tobacco guy Chris number 3? (Bishop)\n-\nthink Nicola did too well. So is \"back in the kitchen\"\n-\n-\nLol it just gets worse!\n-\nThe knifing will be Judith's task, then she'll lead the Party to the inevitable defeat before her well rewarded retirement.\nNicola will then become leader for a go in 2026, maybe\nLuxon’s humiliation will be complete, Key’s work will be done.\n-\n-\nLet’s face it, the guy is a fucking idiot and too rich to care.\n-\nAccording to a Stuff poll 62% of respondents actually agree with Luxon on the Wet, Whiny comment.\n-\nWe've already talked about that nonsensical unscientific so-called polling where bots and browsers can distort the outcomes.\n-\nIt is what it is, I guess. But 28000 responses according to the poll.\n-\nOr you could read the comment at 12.1.1.2.\nFarrar is a professional pollster. He knows bot BS, you should learn about it too.\n-\nI am not taking the poll seriously. I fully realise it is nothing like a scientific survey. But, for all its limitations, there it is.\n-\nYour post @22 showed that you did take it seriously though.\n-\nBit like the online Horizon poll that had the Nats at 24%?\n-\nEmperor Joseph?\n-\n-\n-\n-\nIt doesn’t even need to be bots. Just 100s of white boomer nut jobs with nothing better to do than, like Luxon, complain about the country.\n-\n-\n-\nIf anyone has lost the plot it is National.\nThey are so busy sucking up to the rich old pricks and the farming lobby that they have ignored their other potential supporters – rich yuppies – who now go to someone that acknowledges their imagined suffering.\nDavid Seymour.\n-\nPossibly yes. However, that is not necessarily good news for people who would like a left wing coalition government.\nACT with a greater degree of the vote share, taken from National, is only beneficial if National are not also poaching a chunk of central voters from Labour.If the centre-right has the numbers – ACT with a stronger position is seriously bad news for centre-left voters. The greater your vote share, in the government, the greater your bargaining power.\n-\nThat's what frightens me.\nIf the NACT coalition wins this year, and to be frank I think they will, it will be ACT in charge. Luxon (or his successor if he panics and bails out shortly) will nominally be PM but Seymour will be the real PM. The new government's policies will largely be driven by ACT's war on the poor and disadvantaged.\nInflation at 15%, home mortgage rates at 16% – this is what we had when the founders of what would become the ACT Party were last in government.\nNew Zealanders need to be made aware of this, but Labour won't mention it because it makes them look stupid because it happened when THEY were in government but allowed the free market wankers to take control.\n-\nThese are thoughtful and realistic responses from Belladonna and Mike the Lefty. For all the failings of the Stuff poll it does seem that the concern about the fragile and grumpy NZ psyche made, possibly inadvertently, by the Bumbler in Chief Luxon, may have struck a chord.\nWe on the left have to hope that the chord does not morph into an orchestra of negativity. We also have to hope that we don't fall intot the trap as Labour has done before of ascribing more discernment and knowledge to the electorate than it actually has. We saw this happen, in my view, in the Three Waters debacle. We left the electorate behind and that left a gap in which others made mischief.\n-\n-\n-\n-\nPretty sure the repeated ‘inward-looking’ comment from Luxon references the embracing of Te Ao Māori. It’s all navel gazing mumbo-jumbo to them who would rather an identityless homogenised society indistiguishable from any other society (see the racist David Seymour’s crusade to abolish cultural acknowledgement and support).\nit’s the road signs and Wanaka Kotahi and all that inward looking useless stuff. Be more like America!\n-\nIt is almost comical that the media chooses to put a microscope on every throw-away comment Luxon makes, misrepresent the statement, and then shriek in faux outrage at the implication they choose to put on it. All this, when there is so much meatier stuff they could be focussing on such as inflation, cost of living, crime etc.\nSo, good on Luxon if he starts to counter-attack rather than whimper and apologise for offences that were never intended in the first place. A lot of voters like to see a bit of mongrel in politicians.\nI predict his popularity will have a boost after all this has washed through.\n-\nEven if that is the right tactic, the problem is … he's still Luxon.\nA “mongrel” Luxon \"counter attack\" would be him no longer saying \"look, what I\"m saying to you, let me be clear, [and same old empty waffle …].\nIt would be him saying \"screw all this hiding, screw my advisers telling me to say nothing and follow the small target strategy, I'm done with that … so listen, this is what I really believe.\"\nAnd if he does that, he's toast.\nLabour and the Greens would be thrilled if he finally took off the mask. It's slipped occasionally, but sure, let him rip it off completely. Game over.\n-\nLuxon is the biggest whiniest bitch of them all, must be drawing energy from whom he is surrounded by, like attracts like as they say. I can’t think of another politician that has publicly spouted so much negative drivel about his fellow country/people, apart from his fellow journeyman in the wet and of the whiny, Chris Bishop.\n-\nHe's not wrong though. NZ is a negative place. Though none of his policies will make us less negative.\nWe chased out one of the most optimistic positive leaders we've ever had because we're so negative.\nUs kiwis love nothing more to bitch and moan and whinge and cut people down to size.\nThis is a great country, it's people from the biggest cities to the smallest towns throughout the north and south, are all some of the most kindest, tolerant, innovative, down to earth people on the planet, but boy can we act like a negative backwater sometimes.\nAnd we love nothing more than to run down people who try to do something, be they artists, athletes, scientists or even leaders (of all political persuasions) anyone who tries to do something, is in for a world of negativity.\nI'm guilty of it. We all are\nNZ can be unbearably negative sometimes.\nLuxons not going to change any of that\n-\nI think Givealittle shows us. Generous caring and pretty good folk. (Always exceptions)\nPeople like Luxon should not moan, after all he is secure whether he wins or not. He won't lose his home car or furniture.\nPeople who label others want them to be belittled.\nWhen Luxon said \"We don't want bottom feeders\" I thought \"Which group are they in his mind\".?\nNow he is Labelling again…in quite general terms, then back tracking on the unfortunate bits.\nIf he is ever Leader, imagine him back tracking on something he blurted overseas!\nHe is not suitable.\n-\nLuxon doesn't appear to mind top feeders though.\nLike Steven Joyce, pocketing upwards of $600,000 for doing \"various roles\" for Massey University.\nAnother way of saying \"consultant\"'\nSomething National rail against except when it is one of their old cronies.\n-\nOf course he is not suitable. We know this. We don't want the Nats etc to ride in on something that the electorate may identify with.\nFWIW I thought the PM was weak in his response, bad mouthing us/unpatriotic…..played into yet another NZ trait of sticking up for the person who has been misstated. I am sure the 62% who felt that there was a kernel of truth in what Luxon said are not going to be convinced that Luxon was bad mouthing.\nSurely the PM is not going to say anyone who is actually concerned with the negativity is bad mouthing or unpatriotic. Some of us are concerned that it might lead to a ride to govern by the Nats.\n-\n-\nAgree and it appears to me the rw are among the guiltiest of this. The news is full of the opposition whining, negative business leaders, farmers, teachers, nurses, you name it. National have actively pursued this route during and after covid and I became increasingly depressed about what I was hearing. NZers are increasingly what Luxon has described because as a party they have encouraged it, pushing their rhetoric during some of our hardest years whilst the Labour Party tried their hardest to support us and be positive. Jacinda barely said a negative word except for her accurate comment about David Seymour. Luxon may have been somewhat accurate but as a politician aspiring to lead the country he should have the intelligence and decorum not to have said it, but he has neither. Also incredibly on the nose to say wet as many are suffering the fallout and trauma of recent weather events. On the subject of inward looking, why not? We live here, why shouldn’t we focus on our immediate environs and situation. He is wrong anyway, much of our trade is very outward looking and global – to our detriment in many cases. Many of us travel and live overseas at some point, rely on importing/exporting for an income. I’ve said it once and I’ll say it again, he is an idiot and just a figurehead, he’s in it for his ego full stop. No desire for an egalitarian society or better environment. We won’t need to be like Australia but we could be more akin to the Scandinavian countries. Unfortunately many here think like him and cannot rise above their own interests.\nOn another note this Bill Bailey skit is pretty accurate when applied to NZ:\n-\nGood points Corey.\nBy stating it Luxon is not necessarily going to do anything about it. But I think Labour tacticians ignore this thought/idea, now brought to light, at their peril.\n-\n- Comments are now closed",
  "word_count": 9470,
  "scraped_at": "2026-02-14T13:47:13.862389"
}