{
  "article_id": "da13cbc61285",
  "url": "https://thenff.com/communique-of-the-meeting-of-nff-executive-committee-held-at-the-nff-secretariat-on-monday-17th-march-2025/",
  "title": "COMMUNIQUE OF THE MEETING OF NFF EXECUTIVE COMMITTEE HELD AT THE NFF SECRETARIAT ON MONDAY , 17TH MARCH 2025 – The NFF Official Website",
  "date": "20250318T051500Z",
  "domain": "thenff.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "The Executive Committee of Nigeria Football Federation held a meeting at the NFF Secretariat, Abuja on Monday, 17th March 2025 to deliberate on important issues in Nigeria Football and resolved as follows:\n1) The Executive Committee commended the Federal Government, through the National Sports Commission, for its support and encouragement of the activities, events and programmes of the NFF and the National Teams in the past year, and respectfully pleaded for even greater support and encouragement in a loaded year 2025.\n2) Further to (1) above, the Executive Committee resolved to work even harder at brokering partnerships and sponsorships with Corporate Nigeria and even from interested overseas establishments for the various National Teams, given commitments to Super Eagles’ potentially-explosive six FIFA World Cup qualifying matches; the Super Eagles preparation for, and participation, in the 35th Africa Cup of Nations finals in Morocco; the Super Falcons’ preparation for, and participation in, the 13th Women Africa Cup of Nations finals in Morocco; the Super Eagles’ B preparation for, and participation in, the 8th African Nations Championship; the Flying Eagles’ preparation for, and participation in, this year’s Africa U20 Cup of Nations in Cote d’Ivoire; the Flamingos’ final qualifying round and eventual preparation for, and participation in, this year’s FIFA U17 Women’s World Cup finals in Morocco; the Falconets’ qualification race for next year’s FIFA U20 Women’s World Cup; and various developmental programmes.\n3) After a presentation by the General Secretary on the logistics and general support services that have been put in place for the Super Eagles ahead of their upcoming 2026 FIFA World Cup qualifying matches against Rwanda in Kigali (Friday, 21st March) and Zimbabwe in Uyo (Tuesday, 25th March), the Executive Committee charged the players to go all out for the six points in both matches to boost Nigeria’s qualification hopes. It also called on all Nigerians to support and encourage the team in whatever fair and proper way they are competent to, in order to guarantee victory in both matches.\n4) The Executive Committee praised world football-governing body, FIFA for approving the proposal of the Committee for Nigeria’s FIFA Forward 3.0 funds to be committed to the building of a befitting players’ hostel, two new training pitches and the reconstruction of the existing synthetic pitch, complete with spectators’ terraces and dressing rooms for players and officials. The Committee expectantly looks forward to the ground-breaking ceremony, which takes place in Abuja on Tuesday, 18th March 2025, and for which FIFA officials have arrived in Abuja and many distinguished Nigerians across the political, business and football realms have been invited.\n5) The Committee praised the U17 Girls’ National Team, Flamingos, for their impressive aggregate victory (5-1) over their South African counterparts in the penultimate round of the FIFA U17 Women’s World Cup qualification series, but equally charged the players to work even harder in order to prevail over their Algerian opponents in the final round of the qualification series slated for next month.\n6) After a presentation by the General Secretary on the preparation of the U20 Boys’ National Team, Flying Eagles, for this year’s Africa U20 Cup of Nations in Cote d’Ivoire (26th April – 18th May), the Executive Committee thanked Governor Dikko Umar Radda for accepting to foot the bill of the team’s first-phase camping in Katsina State, while directing the NFF secretariat to arrange the best possible final-phase camping for the team before the championship.\nIN ATTENDANCE: Ibrahim Musa Gusau (President); Gbenga Elegbeleye (2nd Vice President); Yusuf Ahmed (Member); Babagana Kalli (Member); Sharif Rabiu Inuwa (Member); Sunday Dele-Ajayi (Member); Ganiyu Majekodunmi (Member); Nse Essien (Member); Margaret Icheen (Member); Timothy Heman Magaji (Member); George Aluo (Member); Mohammed Sanusi (Secretary).",
  "word_count": 610,
  "scraped_at": "2026-02-14T12:34:58.697488"
}