{
  "article_id": "da611c13eaf9",
  "url": "https://www.inforum.com/news/moorhead/mcfeely-in-q-a-msum-president-tim-downs-says-were-actually-in-a-better-position-than-a-lot-of-places",
  "title": "McFeely : In Q & A , MSUM President Tim Downs says ,  Were actually in a better position than a lot of places  ",
  "date": "20240320T034500Z",
  "domain": "inforum.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "MOORHEAD — Minnesota State University Moorhead has shed more than half of its enrollment since reaching a record high of 9,151 in 1990. The school recorded 4,379 undergraduate and graduate students enrolled last fall, continuing a downward trend. It's a narrative that's engulfed news about the school in recent years.\nThe school's new president, Tim Downs, accurately points out almost every school in the Upper Midwest is facing enrollment challenges for various reasons. Cost, changing demographics, political narratives that diminish the value of a college degree. They all play a role.\nADVERTISEMENT\nIt's up to Downs to figure out a way to stop and reverse the slide. He took over as MSUM's president last July after the retirement of Anne Blackhurst, being officially inaugurated in October. Downs sounds positive that MSUM can again grow enrollment.\n\"We're actually in a better position than a lot of places,\" Downs said.\nDowns is best known in this region for being the CEO and President of Northern State University in Aberdeen, South Dakota, from 2016 to 2021. He resigned that position after facing pressure for supporting athletes who kneeled during the national anthem in the wake of George Floyd's murder in Minneapolis and for advocating to retire the name \"Gypsy Days\" as the school's homecoming celebration.\nDowns recently sat down with me for an hour-long question-and-answer session. Topics included enrollment, budgets, the place of higher education in modern American society and athletics. The interview was lightly edited for length and clarity.\nQ: So you've been here for about eight months now. Your impressions of Minnesota State Moorhead, the community and the people are what? Are you going to stay here for a while?\nTim Downs: Absolutely. Yeah, we built a house. So that's a commitment. We really like the community and the people. Because it's really about the people, wherever you are, where you live and work. If you have really good people with really good sense of moral compass and philosophy of what is right for people, then you're in a good spot. And I really feel that here. I felt that when I interviewed. Every time I had an interview session, I would get off Zoom and tell my wife, \"I really hope we get this job.\" And I still feel that way, because of the people. The consciousness in the community and the state is really high, because you look at the investment that's being made to level the playing field for anybody that wants to go to college, that's huge. So if you are smart enough and have enough ambition, and you want to go to college in this state, you're going to college. That creates a scenario where education should be able to level the playing field for opportunity. And that's really my philosophy.\nQ: That's been the classic view of higher education and public education in general, right? It's the great equalizer. And that was the purpose of public education, in my view, from the start.\nADVERTISEMENT\nTD: Yes. I'm a product of public education and went to Sacramento State and I paid my way through school. All 10 years, I paid my own way. I had times where ... I remember one time I had $1.69 in my checking account. Thankfully, it was payday. The only reason my checking account wasn't closed — because if you went below $5, they'd close your account — was that I worked for the bank. So they knew I was getting paid. Yeah. So they knew my paycheck was en route. So I understand. I understand who our students are. They're pretty gritty. They're here for a reason. And they have a lot of needs. They have to work. It's our job to find that balance and help them learn how to move forward. That's what I love about higher ed. The classroom is important, but what they learn out of the classroom, how to comport themselves, how to survive, how to come up with a plan. That's the magic.\nQ: Before I turned on the recorder, we were talking about our mutual friend Saul Phillips (former North Dakota State men's basketball coach now at Northern State). One of the things that Saul told me many, many years ago was whenever you take a new job, at least in the coaching world, it's always way worse than they tell you it is when they're trying to sell you on the job. Is that the case for you? What's your view of the job here at Minnesota State Moorhead now that you've had a chance to look at it for several months?\nTD: Well, the challenge that we have is what challenge everybody has. It's about enrollments. The state does a fantastic job providing support because 44% of our budget comes from the state and 56% from tuition and fees. Forty-four percent is a high percent in comparison to a lot of other states. So I'm very thankful for that. But the reality is, we don't have enough students. And this has been a problem that's persisted for a while. I didn't understand how long it had persisted, but now I do. And that's fine. I just met with everybody across campus. I had 10 different sessions. We talked about the budget and how we need to create more revenue, which means we have to have more students. We have to retain those students. The whole plan. And I said, \"So, I believe we can do this because we're a great institution. We have great faculty and staff, and we have students that are awesome. So let's do this.\" So people are now repositioning their thinking to it's time now to make our enrollments go back up, and then get ourselves to being in what I would call a more sustainable model. So that's what we're working on. It's a work in progress and it's early, because I haven't even been here a year. But the sentiments and the receptivity to it is very high. People are like, \"OK, yeah, let's do that.\" Not sure how we're going to do it, but we're working on it.\nQ: What's the enrollment at MSUM right now?\nTD: The fall was 4,379 (MSUM lists its record-high enrollment as 9,151 in 1990). In reality, we need to be over 5,000. The higher you go over 5,000, the more sustainable we are. But the business plan includes other sources of funding that we haven't had for, well, ever. Some of them are grants, for example. We really didn't have many grants. Well, then the provost, Dr. Arrick Jackson, he sees this as a way forward and he's built a grant enterprise and we'll end up with almost $20 million in grants at this institution at the end of this fiscal year. This is great, because it can pay for some positions and it can pay for some programs, because that's what the grants are supposed to do. So it'll give us a little budget relief, but then it will also enhance our services. So it's optimal. So we're looking at different sources of revenue, not just tuition.\nQ: So let me go there since you brought up faculty positions. I live in Moorhead. I went to school here. I know people on campus. I talked to some of your faculty members, just to get a sense of what they would ask if they had the opportunity. And generally, the questions all kind of centered on the same thing, which is: What's the long-term future of MSUM? If you're looking at shrinking budgets and shrinking enrollment and revenues, then how can they keep doing the same things that they're doing now? Or what they did in the past?\nTD: All of higher ed is having to pivot. So you want to keep the faculty and staff intact, but what they are doing in the future is probably going to be a little different. So if you look at some disciplines, like in the arts and humanities, we have to make sure that we can sustain enough students. So it's not always majors. That's one of the anomalies. You might not have a whole bunch of majors out of this department, but if you have produced a lot of credit hours, then you turn that into full-time equivalents, and that's like you had a bunch of majors. So we have to figure out this business plan, how many credit hours do they need to produce in comparison and matched to how many faculty and staff you have dedicated to that program or that department? It's a business plan. If something gets off kilter, we have to adjust it. And that's happening. It has happened here, and it continues to happen. We can't live in a vacuum. We have to look at what we're offering. We have to ask, are there students interested in that? If the answer is no, then we have an issue. And then if the students are interested, but there's really no way forward how to use that for employment or their careers or advanced studies, then we have a problem. So we have to look at all the variables and say, 'Is there demand? Is it viable? Can it help them move forward with their lives and careers?' And if the answers are yes, yes and yes, then we're in a good spot. Now we have to market it and tell people it's here, why it's viable and how it can help them move forward. So it's multiple processes have to happen all the time. And you constantly have to assess it to make sure you're still on point because markets change, job career fields disappear. The whole world is very malleable right now.\nADVERTISEMENT\nQ: MSUM historically is known for education, elementary education, journalism, theater, English, arts. All of these things that are frankly in some circles under attack. What's a kid going to do with a humanities degree? Journalism sucks. Fake news. Those types of things. You've heard them all. I've heard them all. So if that's the base of MSUM, how can a school like this pivot?\nTD: You mentioned journalism and communication. So how do you use all the skills of a journalist in, say, professional communication? Does industry need those people? Absolutely. But you have to show a way forward. How are they going to use the skills and abilities and all that knowledge they've accrued in four to six years in college? How do we make sure that they're positioned for employment? We have to ask industry, \"What do you want?\" Industry wants people that can write and think and communicate. What is that? That's the liberal arts. So we can't ever give up our liberal arts tradition. It has to be the core of learning. And then you build around that. And the students can choose to spin off and end up in the business school and become an accountant, which is a professional certification, a CPA. That's great. Or they can say, \"You know, I want to be in public relations.\" Well, how do you do public relations where you learn how to write and think and communicate? You may be on the writing side, and may be on the presentation side. You might be an ambassador for a company going out in the community and, you know, extolling the virtues of why this company is valuable to the community. You have to show a way forward. But we can never give up the liberal arts. It's the foundation of all learning. Every student should have that. We can't be hyper-vocational to the point where we forget the real traditional baseline of learning.\nQ: You've already answered the question, but I'm going to ask you anyway. I ask this question of every university president that I interview. Are our universities, our institutions of higher education, becoming too much of a vocational direction as opposed to an educational direction? I'm of the old school that you need to learn lots of different things to be a well-rounded human and know how to interpret and read and analyze. It's not just about job training. It's about education, in my opinion. Your thoughts?\nTD: We shouldn't become too vocational, although some people will prepare themselves for a vocation. But the baseline of learning needs to be there. Because if let's say you go in and you became, you know, the CPA, and you got an MBA, and you're great at that, you can run numbers and spreadsheets and tell somebody how to sustain a business. But if you can't go out and present and say these are my business services, and let me help you, then you're probably not going to have a good firm. So we need people that can do both. So we have to make sure they're prepared. ... We have to always ask industry, \"What do you want and what do you need?\" And then we need to attenuate it so we don't compromise things like critical thinking, communication and writing. It has to be threaded in there. That's our job to create the balance of how industry will want it just to be vocationally directed.\nQ: How do you grow enrollment? It's a simple five-word question that probably could be a six-hour answer. But as you know Bemidji State, St. Cloud State, Winona State, Minnesota-Duluth, Southwest Minnesota State, Northern State, NDSU, Concordia — they're all going after the same shrinking pool of high school graduates, right?\nTD: You have to understand the psychology of the people you're recruiting, who are they and what are they interested in? And you also have to be able to tell the story of who you really are. So the story of MSUM is ... we started this teacher's college, but we always had the liberal arts. So we were a regional university, teacher's college with the liberal arts, but then we started to build around it. And now we have a really outstanding business school. We have an outstanding nursing program. And we're going to keep building some of these more professionally ordered programs, but we're not going to give up the core of who we are. But we have to tell the story of what happens here. So what happens here is, our premise is, we support everyone for who they are and who they want to become. And that's faculty, staff and students. So you're a person and you want to be here, you want to be part of our learning community. Great. Let us help you develop and then reach your goal. And maybe it's just today's goal, because as life goes on your goals change. You can pivot and end up in a whole different career field. But if you have a baseline of knowledge and skills and learning, you'll be adaptable. It's really about selling people on the culture here. And the culture is very receptive, people feeling like they belong, that they're supported. We're going to create an experience where you're going to become the person that you you think you are, we think you want to be. That's what we do, and we do an awesome job with that. We have to tell that story, though. We have to tell it more. And we have to be consistent. We have to almost be loud, a little bit of screaming, because sometimes you sit in the shadow of another institution that may have other means to get more attention. Like Division I sports, just to put it candidly. And that's OK. NDSU has a lane and I wish them every success. I have a different lane and I hope they wish me every success. But we're going to compete for every student that has the choice that this could be a good fit, or that can be a good fit. And we're going to get fairly aggressive with our marketing.\nQ: But the pool of students isn't growing though, is it? The pool of potential students — whether it's MSUM or NDSU or Bemidji or Northern — it's not getting bigger.\nADVERTISEMENT\nTD: Locally in our backyard, the Fargo and West Fargo school districts are growing and that's a good thing because Fargo is growing. So Fargo and Moorhead and this region are in a growth mode. So we're actually in a better position than a lot of places. Other schools in the region, their town is not growing and the population of prospective students isn't growing. So they're in a different difficult predicament. The other thing is that it's not all about undergraduates. We want to grow out our graduate offerings as well. Because you know, 25 to 30 or 35 years old and they want to do that pivot, you want to take their career to that next level. We're here to provide graduate education as well. So it's not all about the undergraduates that is going to get us over that 5,000 number.\nQ: Where does online fit into this? I've had this debate with university presidents as well. I'm old-school and believe college should be a place where you go to meet other human beings and have experiences and maybe drink too much beer once in a while. But there are some schools going hard after the online students because that grows the enrollment number ...\nTD: There's a little school in New Hampshire ...\nQ: I see TV commercials all the time for Southern New Hampshire University ...\nTD: They have maybe over 100,000 people online, but they're about the same size as Minnseota State Moorhead on the ground. So their strategy is, \"Let's build up this enterprise to then underwrite our on-ground enterprise.\" And it's worked. We don't have aspirations to become that. But online supplements another modality of learning that people desire. So if you don't have the ability or the time to come every Wednesday night to a graduate class because your work and your travel or whatever's going on in your life, then this is another modality of learning. We're strategically providing that. But we're also for example, our MBA has been online. We're going to have an on-ground MBA in the fall, because some people said, you know, I'd take your MBA if it was sitting around the table. The reality is, we have to listen to our prospective students. And we did, so we're pivoting. So we'll have both. So if you can have both, that's great. And some you'll only have one or the other. So you just have to constantly look at your market and who you're serving. So it's a component of our enrollments that we'll always have, but we don't anticipate becoming this big online enterprise in order to just underwrite our on-ground enterprise.\nQ: You said 5,000 is the number you want to get to, that's kind of the sweet spot to be ...\nTD: It's more than that, actually, but the first real benchmark is 5,000.\nADVERTISEMENT\nQ: And so things have been going the other direction for some time. Do you expect it to keep going the other direction or is this going to be it? Is there a floor you're going to hit?\nTD: When you look at enrollments, think of it as several lanes. You got the freshmen, sophomores, juniors and seniors and then sometimes you get a super senior because they want the extra lap. What we have right now is our junior and senior population are large classes, so I'm hopeful that we graduate all of them, but then it leaves a larger gap. So that means the freshman class almost would have to be exactly the same as the senior class. You get it? That's why enrollment management is more than just the freshman class. You have to look at the freshman class and see how well they did their freshman year. Great news there. We've had about 87% to 88% of our freshmen start in the fall, and they show up again in January to continue in the spring. That's a really good number. The best news is that that number went up 2.92% this year. So we're doing something really well in this retention model that we have. It's one of the better retention models in the country. So that means that if you keep them to the spring, then you have a better chance and a larger population that you're dropping in as sophomores into your spreadsheet. That's one of the pieces. It's also really important, and the other thing we're telling our undergraduates is, you're graduating but if you want a graduate degree, we have those, too. Keep them on. Don't let them leave. They already bought one degree from you, and they loved you because they stayed. So put that on the agenda, and maybe they don't do it right away. Maybe it's a year or two. Maybe they do it part-time while they go start their career. It doesn't really matter. We've got to create a consciousness of \"we can continue to provide education for you beyond your bachelor's.\" I don't think we've been doing that enough. So it's very complex. There's multiple strategies to actually get this boat to rise to the next level.\nQ: Are there more cuts coming? It seems like for years we've been hearing about cuts. It's been a long time since there's been good news, it seems. I get that the old adage is \"It's not news if the sun rises in the east, it's only news if it rises in the west.\" But it's been a lot of years of cuts.\nTD: My goal is to avoid cuts. So I'm approaching this as, \"Let's be optimistic.\" Let's tell our story. Let's tell about how good we are. Let's look at every strategy possible to raise money, whether it's tuition and fees, whether it's grants, whether it's more transfer students. There's different types of students. We need more transfer students to come 1 or 2 miles down the road from M State and finish their four-year degree here. So it's being very tactical. I've been telling everybody my goal is to increase revenues, and then look for areas where we might create efficiencies in our budgets like operations and spending. So let's look at those as the first two options. And then if we have to reposition staffing, that's the third priority and it's the lowest priority of the three. We're in the middle of this conversation as we speak. I mean, all the deans and all the directors are meeting with all their people looking at how can we be more efficient with our funding, and how can we increase our revenues? So those are the 10 groups I met with the past three weeks, and I consider myself ... at times I have to be almost evangelical. You know, to get people to see, \"Look, I believe in you. I came here for a reason.\" It's to help lead the institution forward to this place where we all look up and go, \"Wow, how'd that happen?\" It's gonna take several years. You don't turn that boat in the harbor in 30 minutes. You've got to get three or four tugboats and you just keep positioning and moving and positioning and then we'll find that direction and go. People seem to believe we can do it. I know we can. Exactly what we do remains to be seen.\nQ: If cuts come, where do they come from?\nTD: Yeah, that's the conversation that everybody's having. Where do we right-size our budgets? And then where do we put our energies? For example, yesterday somebody said, \"I want to get a master's degree in history.\" I said, yeah OK. I don't know if we have the demand for that. Because you can't run a master's degree with four students. And this gentleman said, \"OK, I see that.\" I said, well, what are you interested in? Maybe we have courses from several departments that we can pull together, so we're not adding a new resource. We're being interdisciplinary. And he said, \"Oh.\" And the faculty are talking about that right now. What are things that we can do, collectively, that will attract people and not be thinking additive? Like some people said, \"Why don't you start a program in physical therapy?\" Well, nowadays, the terminal degree is a doctorate in physical therapy. And it probably takes between four and six faculty members, and they're not inexpensive. And you have to take about three years to put together the curriculum to get it approved by the accrediting agency and in those three years, you probably carried the salary and benefits of at least two faculty. And then if they approve it, then you could admit the first student. In the meantime, it's pretty much been a heavy expense. So you have to be able to take on that expense, knowing the long view, and then it's hard to find faculty. And the market is actually saturated in physical therapy programs. So therefore, bad idea. Twenty years ago, great idea, because there wasn't programs. So it's all about timing, you know, so we have to look at the realities. Even if we do it, is it going to yield enough for it to be sustainable?\nQ: I'm in the newspaper industry and follow it closely so I know about shrinking resources. I hate to use words \"death spiral,\" but if you're constantly cutting or finding efficiencies, how do you remain attractive enough to attract people? You're not offering as much, but you're still asking them to come here. Does that make sense?\nADVERTISEMENT\nTD: If you're looking at students, we need to explain to them the things that we have and why it's viable. So here's one that we're gonna start to position ourselves to create awareness, which we think will help with enrollments — supply chain management. It's a great area. I mean, great jobs with huge distribution companies, the brown trucks or whomever you want to point to, it's a big industry. We have this program and it's not sufficiently enrolled. I don't know if people know we have the program. It's out of the School of Business, which is accredited, and it's the highest level of accreditation nationally and internationally. Why don't we have more students? So we need to actually push that out there and explain to students, this is actually an industry that has really good jobs, and oh by the way, they pay quite well. Students don't know that. They just see the blue and the brown trucks driving around and they don't think about that as an industry. It's a really good industry to actually start your career. So we have to create that awareness and say, \"did you know\" and then get them to come visit campus and they look at everybody and they meet people and they say, \"That's a nice place. I like the people and that degree program is lights out. Awesome. Maybe I should go to school at Moorhead.\" You know, we have to kind of show them how all the pieces fall in place. You can't expect them to just figure it out on their own.\nQ: So are you talking about marketing people that you need to tell the story or are you talking about a recruiting coordinator, to use a sports term?\nTD: We just hired a new vice president and so we reorganized. One of the first things I did, the person that had been serving as Vice President of Enrollment Management and Student Affairs, we split those two areas out. So it's now Vice President of Strategic Enrollment Management. That's what they do. And under them is marketing. Shock. So we're pairing them directly together now. They're starting to build these marketing messages and strategies, examples just like I gave you. So we've got to really get dialed in to make sure that we're messaging people so they see the way forward and why we're the place they should be. You can't assume that they're going to connect the dots, you have to connect the dots for people. So that's what we're going to do. We have this new vice president, his name is Jason Trainer. He's actually from Minot. Worked at UND. Worked at Northland Community College. We got him from Indiana State. He was out there running their enrollments. He wanted to come back to the region.\nQ: Is it the different being a university president in Minnesota than it was in South Dakota?\nTD: Yes.\nQ: How?\nTD: Just right off the bat, South Dakota, I'm not sure if they see the value proposition of four-year and graduate degrees. They are very much supportive of two-year and technical education. Here, it's all of it. It depends on what you want in the state. So the Minnesota state system has 33 institutions, and they're very well-funded and very well-supported by the Legislature and the governor. And that is very refreshing.\nQ: I just read this morning about a Division II school. It was a private in Ohio that's going to close its doors after spring semester. It's not the first time that I've read about an institution of higher education closing. You mentioned the 33 institutions Minnesota. Is that too many in the 21st century? And is there ever a scenario where — and I know you're the new guy here — where an institution of higher ed in Minnesota shuts down?\nTD: In the Minnesota state college and university system, I mean, 26 of them are the two-year institutions. So they're a very different lane. And they have students for a shorter span of time. A lot of what they do, they prepare students to transfer to a four-year but a lot of it is, you know, the two years are the certifications to work in industry. So I think it's good to have both. I don't know of any today that are not viable. But every one of us has to make the case why we are viable. That's why you have a leadership team and faculty. That's our job to make sure that we're sustainable and viable. And every day we've got to ask the question, \"So what's next?\" Because the world just keeps changing. It's like being on a sandbar. You go to the beach and you get on a sandbar and then 15 minutes later you're about a foot shorter because the sandbar shifted. That's higher ed. It just constantly shifts so you have to keep shifting and pivoting and moving to make sure you stay on point.\nQ: Is enrollment in higher education dropping strictly because of population and demographic trends, or is it because Americans don't see as much value in a degree anymore?\nTD: I think the one thing you mentioned is the narrative that some people use to describe higher education. That narrative devalues it. And that's a concern. I think if someone wants to pursue higher education, that's their value. We shouldn't detract them from that. What type of higher education you pursue that's, again, what's matching you, your interests and your goals in life? So if the student wants to go to a two-year, I'll just look at him and say that's great. What are you going to do? And then once they get that done, ask them, \"Is there another learning or more learning that you need?\" Maybe they come later after working for a while and get a four-year because they wanted to start a business. So I think person by person. But this devaluing of higher education is concerning because I think you need to learn to think and write and become more mature and develop as a person. And you'll pick a degree and you'll find a way forward. I think that process, the transformation of lives, the earning potential for students — it's almost two times — but if that's not what you want, then don't do it. It probably won't be a good experience. And your heart's not in it. So I think you have to look at the individual and where their heart is at that moment. Age 18 isn't who you are at age 58.\nQ: Oh, I know some guys that are pretty close ...\nTD: Every high school reunion has them. So I always look at it as a continuum, this human development and where do you need to develop? What are you interested in? And that's what we're going to do today. Then five years from now, it may be very different. I didn't go to my undergraduate expecting to be a PhD and a university president. It happened quite accidentally. I just suddenly got the bug on learning. And then I ended up in graduate school and then there was a recession and I couldn't get a job with my master's. So I continued for my doctorate. And suddenly, I'm a professor. And then I decided, \"Wow, I like this.\" And then the administration thing looked pretty cool. So I pivoted and started moving up that track. So my evolution is a perfect example. I went to high school, out of high school to college to be a football player and get a degree and go to work. Football didn't work because I started getting concussions. And then I started to put that energy into studying and that's what happened. So you just don't know. So the devaluing of education is extremely concerning because I think education of any sort has value.\nQ: You mentioned athletics. Something that you mentioned earlier, before we started recording, was about all the athletics facilities you helped build at Northern State. Like, tens of millions of dollars worth. So athletics matter to you and they're going to matter at this institution?\nTD: Oh, yeah. It's one of the enrollment drivers. It's a marketing and visibility machine. Because you can really showcase that dimension of the institution, but then you have to turn it and say, \"But let's tell you about all the academic programs of why these students came here. Let's talk about the whole student experience.\" So it's just another way to showcase an institution and, if you do it right, the student-athletes have a great experience. Most of them, 99-point-whatever percent, will not end up in a professional athletic career because we're Division II and that's just the reality. But if they get a degree and they've learned things like goal-setting, leadership, being part of a team, you know, all these things are good things. The NCAA is even driven to talk about some of this ... talking about life in the balance and the psychology of it and learning how to fail and how do you respond? These are all phenomenal things. I mean, I'm really proud of our student-athletes. Our GPA for our student-athletes right now is 3.31. That means we're doing something right.\nQ: Higher than the student body in general, I would bet.\nTD: Yes, it is. Because they are goal-driven, organized. They know what they're doing at 2 o'clock every day. And that structure really prepares them well for life. So I love athletics. I mean, my track coach taught me goal-setting at age 17 and I've used it ever since.\nQ: There's a lot of ways we can go with athletics, but I'll go here because I want to. A couple presidents ago, Edna Szymanski started the hockey thing. And she was going to try to get a men's and women's hockey team. They came up short. From what I understand they weren't that far away from getting it done, but they came up short. You talked about the importance of athletics. Would you ever consider adding a men's hockey team. Just men's. Augustana recently added just men's hockey in Division I. It's gotten them some visibility. That's a private institution and it's a whole different deal. They have Sanford money. But is that something you would ever consider, making that bold of a step?\nTD: I would, but .... There's a huge following for hockey. This is regional, and hockey has actually become very popular nationally. I mean, we have professional hockey in Florida. Who would have ever predicted that? ... But regionally, hockey is very popular. Hockey could become a draw for us and another reason for students to come here not just to play hockey, but because they want to go watch hockey. If we were going to add hockey, the goal would be to make it budget-neutral. So I need somebody or a lot of somebodys to help underwrite the cost, because it's not an inexpensive venture. But if it would help expand our visibility, if it could draw more students here, then absolutely. There has to be some kind of return on investment. So if we had people who said, \"I'm willing to invest\" and we look at the cost .... If we didn't have to build our own facility then that would be awesome, because they are not inexpensive. So then it's where would you play? And then who would you play? But I think we'd have that solved even though there's two divisions in hockey. Bemidji State's in one. We'd have to position ourselves so then you have rivalries, and that would be neat. So it's a very multi-faceted question. But absolutely, if we could get some people to invest in it and help us make this happen. But if we had to do it and it took a drawdown of our base budget and expense line and added about a million or $2 million, I'm going to go a pretty hard no. I have to be a pragmatist. If I could get the partners that said, \"If you do this then we'll underwrite it,\" then I'm very excited and we're going to have a conversation.\nQ: That sort of leads to my next question, which is when you were in Aberdeen, Northern State was the thing for that area. They have a beautiful football stadium, nice basketball arena. All the things that a Division II school wants to have in 2024. In this community, North Dakota State is the athletics king, because of what they are and what they've accomplished and all those things. So how do you carve out a niche for MSUM in this community?\nTD: Well, I don't want to compete with NDSU. They're in Division I, they're in a different lane. But if you look at Division II, I think there we have opportunities to really be quite viable and competitive. We have to constantly push ourselves to say, \"Which programs can we grow and develop and make them more viable?\" Football has done really well this year. I mean, when you lose to Minnesota State Mankato by three and they had to kick a field goal with four seconds left, I think it's a pretty good testament because Mankato is pretty much always in the playoffs. So we're on the verge of moving football to that next level. So for me, we have to keep looking at how we can invest in it and figure out what works for us and where we can grow programs that are going to give us more visibility.\nWhat athletics does is it affirms that an institution is viable. It just says, wow, look at this program and this program. Like our track athletes right now. We have four that are going to nationals. That's pretty awesome. So it just showcases that good things are happening here. We have good coaches. We can always put more money into facilities. That's just a never-ending chase-your-tail. Because as soon as you do something, then the other school 200 miles away that's in your footprint that you compete head-to-head with for students puts in one bigger. Look at high school football in Texas. You ever seen those stadiums? Stadiums that cost $70 million for a high school football team. And then there's another one that's 100 seats bigger at $75 million. That may be a little out of control. You have to manage it and know how it fits in the landscape of who you are as a university. I'd love to keep doing that. Building programs and then how do we grow the facilities? Improving the facilities, that's something that's in our plans.\nQ: The basketball arena, that's going to be state bonding money eventually. It's on the list. You said you facilitated the building of a new football stadium in Aberdeen. When does that come to Moorhead State, because Nemzek Stadium has not changed one iota since I went to school here 40 years ago. I think it's time for a new football stadium for the Dragons.\nTD: We're building a new comprehensive facilities plan to look at all that. Then once you build the concept out, then you cost out what would each piece be? And then which one do you do first? Unless you just get a huge windfall, you have to do a hierarchy. Which one goes first, second, third. So that's the conversation we're having. We're lucky that the state of Minnesota actually puts resources in the facilities. So this year, we don't have Nemzek in the budget for facilities in the state. We were fortunate to get Weld Hall funded. So Weld Hall, you might call it the blocker, and as soon as Weld Hall got funded now that created daylight for Nemzek to come to the top of our list, which is where it is and the plan is to put it into the 2026 facilities plan with funding from the state. We have to start submitting information to the state this year. So it's about an 18-month runway to get it up to the legislative docket, which we are hoping and praying for. So that's the process we're in because that is kind of the showpiece for winter sports. Whether it's women's and men's basketball, wrestling. In the fall, we have volleyball, I mean, it's a big place. And so it could be one of our showpieces, but it does need some help. I'm not going to even try and contest that.\nQ: So when does the football stadium come then? Because the football stadium isn't part of that.\nTD: It isn't. That's part of that comprehensive facilities plan. There's the football piece. And there's track and softball, all the sports. So it's like having chess pieces, but it's all the different facilities we could have. Where would they be and what would be the scope and what's the cost of each one and we're getting closer to having all that figured out.\nQ: And it'll be state funding?\nTD: Absolutely. We're going to need some private funding. And then also, one of the things about a school like Moorhead State is that we sit in a community, and what's the value to the community of us having better facilities? And is there an opportunity for a partnership with people like the city or Moorhead school district? Why should we all build duplicative venues when we might be a little bit smarter and stretch our money? So I've had those preliminary conversations with the school district and the mayor, just conceptual, and nobody's pushed back. So I'm very hopeful that we can build what I would call a consortium of funding. So it's less impactful on any one of those but accessible by more of us.\nQ: That's what the Dragon Dome (a multi-purpose indoor facility in the conceptual stages) was supposed to be, a collaboration. I don't know if you refer to it as that. Is that something that's going to happen?\nTD: We're looking at the potential for an indoor facility. We would not call it the Dragon Dome. We think \"dome\" is kind of the name that is owned across the river. But we would call it something. That's a work in progress, but having something that's an indoor facility for our students, and what if the community had access to it? That'd be kind of neat.\nQ: That was the plan originally, to make it some sort of partnership with the city to make it a community-friendly building.\nTD: Projects like facilities, facilities planning, getting state funding, private funding, partnerships in the community. That's a high-level chess game in terms of strategic planning and sharing your vision and what your priorities are and see if they aligned with others and all of a sudden, if you get that alignment, things are going to move.\nQ: You've been kind to me by referring to this school as Moorhead State, which is what my degree from here says. Would you ever consider going back to calling this place Moorhead State? Because I would personally build a statue for you. Might not be an expensive statue. It might be a bad statue. But I would build a statue for you if you change the name back to Moorhead State.\nTD: Well, here's the thing: That's who the institution is known as. I mean, I've actually met some alum earlier in the year, and they said it was Moohead State Teachers College. So they even went beyond the Moorhead State University. ... When people say Moorhead State University to me, then they apologize. And my answer is, please don't apologize because that's our history. That's who we are. So if they ask if it's OK to say that I tell them absolutely. If that's the affection that you have for the institution, then please feel free to refer to us as Moorhead State University. I actually, you know, inquired kind of informally with the chancellor's office and they said they didn't have a problem with it. It's kind of our nickname. So why should anybody feel apologetic for calling it the place it was called when they were there. And that's their affinity and that's their affection. Why would they ever want to defer people to not do that? If people call it Moorhead State, I'm just gonna smile and say, 'Yes, we are.' Because that's who we are.\nQ: Is there anything I didn't ask you about that you wanted to get out there?\nTD: I'm thankful for support that the institution has, because not everywhere is that the case. Some places they look at the institution or the students or the whole enterprise of the university in their community as kind of a problem or a challenge that they really don't celebrate. This town, this community really is happy that we're here. And for me, we have to make the commitment to help the community be even better. Just like we're challenging ourselves everyday to be even better. So how do we support the community, community initiatives, be there for people? That's a big part of our job. One of our strategic objectives is community engagement. So every day we need to be doing something that says to the community, \"We're here as your partner.\" And then the hope is that when we go to them and say, \"We can use your help, your partnership with this project,\" that they will be receptive, and then we support each other. So I feel that this community is that and I'm already very thankful for that.",
  "word_count": 7935,
  "scraped_at": "2026-02-14T13:10:59.944088"
}