{
  "article_id": "da61253265a2",
  "url": "https://www.90min.com/posts/barcelona-vs-wolfsburg-uwcl-final-preview-tv-channel-live-stream-team-news-prediction-3-6-2023",
  "title": "Barcelona vs Wolfsburg - UWCL final preview : TV channel , live stream , team news & prediction",
  "date": "20230602T100000Z",
  "domain": "90min.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Barcelona vs Wolfsburg - UWCL final preview: TV channel, live stream, team news & prediction\nBarcelona and Wolfsburg will bring down the curtain on a record-breaking season of Women's Champions League football when they meet in the 2022/23 final in Eindhoven.\nBarcelona are appearing in the final for the third straight season, seeking to avenge last year's defeat to Lyon and build on the first European title they won by thrashing Chelsea in 2021.\nThe Catalans made light work of the group stage, albeit suffering a rare defeat at the hands of Bayern Munich, before comfortably thrashing Roma in the quarter-finals and then overcoming Chelsea in a much closer semi-final contest.\nWolfsburg, meanwhile, remain one of Europe's giants but are searching for their first Champions League title in nine years since back-to-back wins in 2013 and 2014. The She-Wolves did make it to the 2020 final but were beaten by Lyon.\nLike Barcelona, they too faced English opposition in the semis, eventually seeing off Arsenal in a titanic tie that finished 5-4 on aggregate and wasn't decided until extra-time. There was also a slender quarter-final win over Paris Saint-Germain, having initially topped their group ahead of Roma.\nWhere to watch Barcelona vs Wolfsburg on TV/live stream\n- When is kick off? Saturday 3 June, 15:00 (BST)\n- Where is the match being played? PSV Stadion\n- TV channel/live stream? DAZN UEFA Women's Champions League YouTube\n- Referee? Cheryl Foster (WAL)\nBarcelona team news\nAlexia Putellas has made five substitute appearances since making her return to action from 10 months out with an ACL injury at the end of April, building her match fitness.\nCaroline Graham Hansen hasn't played since 13 May because of illness, while the influential Fridolina Rolfo was last on the pitch in the semi-final second leg against Chelsea in April. But both should start, while Lucy Bronze could also be back after recovering from minor knee surgery.\nCoach Jonatan Giraldez will have a choice to make up front between Asisat Oshoala and Geyse.\nRead the latest Women's Champions League news here\nWolfsburg team news\nThe She-Wolves are arguably coming into the final in slightly better shape than Barcelona, with coach Tommy Stroot able to make good use of his squad for the final Bundesliga game of the season last weekend in order to get minutes into as many legs as possible.\nCentre-back Marina Hegering missed each of the final two league games.\nBarcelona vs Wolfsburg score prediction\nPSV Stadion is sold out, while views on broadcaster DAZN's dedicated YouTube channel in 2022/23 are up 17% on the previous campaign and will surpass 50m for the season. This is a fitting match to end what has been an incredibe European adventure and a tough one to call.\nBarcelona have been in preservation mode ever since sealing their latest Liga F title in April, which contributed to dropping their first domestic points since 2021 and soon after thier first defeat in that period too. But the potential return of Putellas from the start could be a huge psychological boost.\nIn Ewa Pajor, Wolfsburg have this season's Champions League top scorer with eight goals, while Alexandra Popp is having an exceptional campaign after injuries hampered her earlier career. But they will have to bounce back from the disappointment of seeing Bayern Munich win the Bundesliga, which could either serve to galvanise them for this final or dampen their spirits.",
  "word_count": 569,
  "scraped_at": "2026-02-14T12:54:45.456115"
}