{
  "article_id": "da7a7f6110ee",
  "url": "https://www.justarsenal.com/what-went-wrong-with-the-arsenal-women-against-tottenham/356037",
  "title": "What went wrong with the Arsenal Women against Tottenham ? ",
  "date": "20231219T160000Z",
  "domain": "justarsenal.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "What went wrong against Spurs for Arsenal Women?\nJonas Eidevall and his Arsenal Women’s squad walked away from the North London derby on the weekend defeated 1-0 after a shock result for our Arsenal Women. Spurs walked away with their first ever win against us and our Arsenal Women were given a set back on which could have been a very important 3 points going into the new year.\nWomen’s football now comes to a halt for a few weeks and Eidevall and his Arsenal Women would have been hoping to go into the break in winning form and keeping up with Chelsea, but with the loss against Spurs it’s put us back behind them and now Manchester City on goal difference.\nEidevall picked, on paper, a very strong squad that should have been able to get the job done, and after the mid-week win against Spurs in the Continental Cup, I think Eidevall and most of the Arsenal Women’s fans were expecting Arsenal to come out and have a dominant performance but Spurs really brought the game to us and even our “strongest” of sides could see it through, missing heaps of chances and just again were simply not clinical enough.\nArsenal have been unreal this season and the loss against Spurs is our first loss since we lost to Liverpool on the opening day of The Women’s Super League, and with such a little amount of games all season in the WSL, every single point counts, and because were competing with a team like Chelsea who have been incredible for the pas few years, losses like this can come back to bite you.\nFor me, the problem on the weekend was we looked to be doing too much and not just playing how we normally would play, I’m not sure if it was because of the importance of the day, being a derby and also in with the chance to get comfortable on top of the League going into the break, I think the pressure got to our women and maybe we went into the game perhaps overconfident. Spurs showed us mid-week they meant business, yes, we had a heavily rotated side, but they still showed up and kept us level until the penalties and we should have expected them to come out and do the same on the weekend.\nFor me, the subs were made at the wrong times, and I probably would have started Cooney-Cross and Pelova next to each other, I think taking Pelova off for Cooney-Cross was also a mistake as when they’ve played side by side, they’ve looked dangerous. Although Pelova wasn’t having her best game, I think Cooney-Cross could have brought that out of her.\nAgain, getting the ball on target and making our chances clinical became a common problem and for a game that had so many chances, I almost can’t believe we didn’t get one in the back of the net.\nThe Spur’s keeper had an incredible game also and our women just couldn’t seem to get past her. A hard loss and a lot of lessons to take away from it.\nIt hurts that we go into the break with a loss, but Arsenal Women fans will be expecting to bounce back against Watford in the FA Cup in the new year.\nWhat do you think went wrong against the Spuds, Gooners?\nDaisy Mae\nFollow JustArsenal’s Gooner Women on Just Gooner Women on Twitter for regular updates on the Arsenal Womens Team!\nDo you want to read more about the Arsenal Women’s Team? Click here….",
  "word_count": 596,
  "scraped_at": "2026-02-14T12:22:09.541959"
}