{
  "article_id": "da9bdbd14b90",
  "url": "https://punchng.com/oshoala-sets-four-bay-fc-records-in-nwsl-debut-season/",
  "title": "Oshoala sets four BAY FC records in NWSL debut season",
  "date": "20241112T014500Z",
  "domain": "punchng.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Asisat Oshoala is synonymous with records and her first National Women’s Soccer League season with Bay FC has left a litany of remarkable feats in its wake.\nThe 30-year-old Nigeria striker capped off the campaign in style on Sunday, scoring the club’s first goal in their NWSL play-off’s 2-1 extra-time defeat to Washington Spirit at Audi Field, Washington, District of Columbia. She had put her team in the lead in the 82nd minute; Tara McKeown pulled the victors level four minutes later, while Caprice Dydasco’s extra-time own goal sealed the victory for Washington Spirit and eliminated Bay from the series.\nBay signed Oshoala in January after her contract with Barcelona expired and also acquired the services of Zambian forward Racheal Kundananji from Madrid CFF for $860,000, a new record for the most expensive transfer in women’s soccer history the following month in their quest for a bold impression in their debut NWSL campaign. The first women’s professional soccer team based in the Bay Area since the San Jose CyberRays and FC Gold Pride did made history, finishing 7th in the 14-team standings of the regular season to qualify for the playoff quarterfinals.\nOshoala, who has become a household name at PayPal Park, the club’s 18,000-capacity home ground in San Jose, California, which is also home to the San Jose Earthquakes of MLS, made a flying start to her stint with the club founded on April 4, 2023, as one of the expansion teams.\nAgba Baller, as the former Robo Queens player is fondly called, Oshoala’s official debut was remarkable, scoring the club’s first NWSL goal in their 1-0 win over Angel City FC at BMO Stadium, Los Angeles, California, on March 18. Incidentally, the 17th-minute effort was the club’s first away goal in the league.\nSince registering the dockbreaker, Oshoala was consistently among the goals, leading the team’s chart with seven in the regular season before their solitary playoff goal, her eighth of the season, which sealed her pole position of the team’s scoring chat.\nBay FC may have crashed out of the playoffs, but Oshoala lived up to her billing as Africa’s most potent female striker in the last decade despite being low on speed and physicality, which stood her out at previous clubs and internationally.\nThe Ikorodu-born player’s romance with history dates back to 2013, when she won the Women’s FA Cup with Rivers Angels, which they defended in 2014 and added the Nigeria Women’s Football League title.\nShe won the FA Women’s Cup with Arsenal in the 2015/16 season, two Chinese Women’s Super League titles with Dalian Quanjian (2017-2018), five Spanish Primera División, three UEFA Women’s Champions League, four Supercopa de España Femenina, three Copa de la Reina, and one Copa Catalunya with FC Barcelona.\nOshoala has also scooped honours internationally, having won the Africa Women’s Cup of Nations with Nigeria in 2014, 2016, and 2018 and was a key member of the team that finished as runners-up at the 2014 FIFA U-20 Women’s World Cup.\nShe has scored whooping 105 goals in 156 club career matches and has won the African Women’s Footballer of the Year award a record six times.",
  "word_count": 525,
  "scraped_at": "2026-02-14T12:42:44.757256"
}