{
  "article_id": "dac45b9c0073",
  "url": "https://www.sbs.com.au/news/article/matildas-womens-asian-champions-league-finals-arsenal-melbourne-city/wofovheff",
  "title": "Nine Matildas set to compete in Champions League finals",
  "date": "20250524T090000Z",
  "domain": "sbs.com.au",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Set your alarms and prep the coffee — Australian women's football is about to have one of its biggest nights since Matilda fever gripped the nation during the 2023 Women's World Cup.\nAcross two cities, nine Matildas players will be taking part in what's set to be a big night of women's football as two teams compete in the Champions League finals.\nThe first match will start on Saturday night at 10pm AEST, where Melbourne City will face Wuhan Jiangda in the final of the first full Women's Asian Champions League tournament.\nSix Australians — including current Matildas Holly McNamara, Bryleeh Henry and Leah Davidson, plus Laura Hughes, Karly Roestbakken and veteran keeper Melissa Barbieri — will be chasing the title and a slice of the $2 million prize pool.\n\"It's so exciting, for it to be the first structured Asian Women's Champions League,\" McNamara told AAP.\n\"To get all the way to the final as an Australian team is a really good credit to us, and it's something that we've been working towards as soon as we found out about the competition.\n\"Obviously, playing for your country is such a huge milestone, so those games were pretty big in my career. But in terms of club, this is the biggest game by far.\"\nAustralians look to grasp European Champions League trophy\nThen, four hours later at 2am AEST Sunday morning, three of the Matildas' biggest stars — Steph Catley, Caitlin Foord and Kyra Cooney-Cross — will run out in the European Women's Champions League final.\nTheir club, Arsenal, is aiming to upset reigning champions Barcelona in front of a packed crowd in Lisbon.\nIf Barcelona is successful, it would be their third consecutive championship win.\nMeanwhile, underdogs Arsenal are hoping for an upset and are vying to win their second-ever European title.\nIt's the first time all three women will contest a Champions League final — and they'll be hoping to join the likes of Ellie Carpenter, who is the only Australian woman to lift the trophy after 2020 and 2022 wins with Lyon.\nThe only other Australian to win the tournament is Harry Kewell, who won the 2005 final of the Men's Champions League with Liverpool.\nThis week, Ange Postecoglou became the first Australian coach to win a major European football trophy with Tottenham Spurs.\n'Anything can happen'\nCatley said Arsenal had \"put ourselves in such an incredible position\".\n\"A one-off final. Anything can happen, two amazing teams going at it.\"\n\"It's the best thing about Champions League football. And there's no place I'd rather be.\"\n\"Obviously, for Australians that follow Arsenal and that follow us, it's a massive occasion.\"\nCatley said the barriers to Australian women's footballers succeeding on the world stage made the feat even sweeter.\n\"There is something special about Australians doing well on the world stage, and I think in particular in European football,\" she said.\n\"Because anyone that knows world football knows how hard it is to be successful over here, especially in the Champions League, and in European competitions in general.\"\n\"Playing in a Champions League final is, along with probably a World Cup final, as high as you can get.\"\nShe believes it can also inspire young Australian footballers.\n\"If you see there's three Australians playing in this Champions League final, then it's definitely possible for them,\" Catley said\n- With reporting by Australian Associated Press.\nFor the latest from SBS News, download our app and subscribe to our newsletter.",
  "word_count": 579,
  "scraped_at": "2026-02-14T12:50:26.508211"
}