{
  "article_id": "dadf39e14a43",
  "url": "https://www.90min.com/sonia-bompastors-dream-chelsea-starting-xi-naomi-girma-signs",
  "title": "Sonia Bompastor dream Chelsea starting XI if Naomi Girma signs",
  "date": "20250125T114500Z",
  "domain": "90min.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Sonia Bompastor’s dream Chelsea starting XI if Naomi Girma signs\n- Chelsea are reportedly close to signing USA international Naomi Girma\n- The defender has been hailed as one of the best in the world by USWNT boss Emma Hayes\n- 90min have looked at how Chelsea could line up for the rest of the season if Girma signs\nChelsea are rumoured to be closing in on a world record transfer for San Diego Wave defender Naomi Girma.\nThe 24-year-old has been hailed by former Blues boss Emma Hayes as the best defender she’s ever seen, which is quite the statement coming from one of the most experienced figures in the game. Chelsea’s need for centre back cover intensified earlier in the season when Canada international Kadeisha Buchanan sustained an ACL injury, but Girma’s reported arrival is one that will send shockwaves through the league and European football.\nChelsea are already well primed to make it six WSL titles in a row as they sit seven points clear at the top of the table. But, the additional, and arguably more pressing, focus for new manager Sonia Bompastor this season is success in Europe.\nIt is hoped that Girma’s arrival will give the London club that extra push in their pursuit of a first Champions League trophy, not least because they are set to beat the likes of Lyon and Arsenal to Girma’s signature.\nWith that being said, 90min have assessed Chelsea’s current starting lineup under Bompastor, who Girma will replace and what the manager’s dream XI will look like once the transfer is formally completed and announced.\nGoalkeeper\nChelsea boast plenty of competition in the goalkeeping department, but Hannah Hampton is their unrivaled number one. Sweden international Zecira Musovic has deputised expertly at times this season, but Hampton is the one called upon in the biggest games.\nDefenders\nLucy Bronze was signed as a free agent from Barcelona in the summer and has been a regular figure under Bompastor this season. On the opposite flank, the manager has used a number of different faces including Ashley Lawrence and Sandy Baltimore.\nHowever, Niamh Charles’ recent return to fitness after an injury lay-off places her back at the forefront of the conversation. As a result, Eve Perisset has had very limited minutes this season with just a couple of appearances in the WSL.\nKadeisha Buchanan was the starting centre-back alongside Millie Bright at the start of the season, but after she sustained an ACL injury in November, Nathalie Bjorn has had to step up in recent games. That will likely change if Naomi Girma is to come through the door this month as she will undoubtedly by the standout candidate to partner Bright in the middle.\nMidfielders\nSjoeke Nusken has been a regular starter for Chelsea since her arrival from Eintracht Frankfurt in the summer of 2023. She regularly starts alongside Erin Cuthbert as part of a double pivot in a 4-2-3-1 under Bompastor.\nOn the flanks, Guro Reiten and Johanna Rytting Kaneryd would likely be first choice with everyone fit. The latter, in particular, has been one of Chelsea’s standout performers this season apart from minor injury problems.\nWithout injury problems, Lauren James would likely be one of the first names on the team sheet. However, Wieke Kaptein appears to have grasped the number 10 spot this season, with Catarina Macario also featuring on occasion.\nForwards\nChelsea have a wealth of attacking talent at their disposal but Mayra Ramirez has been the standout since her January move last year. Sam Kerr and Mia Fishel are both approaching a year out with ACL injuries, which means they are unlikely to slot back in as first choice right away.\nThis season, the Colombia international has already scored six goals and registered four assists across all competitions for the Blues and is one of their most productive, threatening players.\nChelsea’s expected starting lineup if Girma deal is completed\nChelsea’s expected starting lineup after Girma deal (4-2-3-1): Hampton; Bronze, Girma, Bright, Charles; Nusken, Cuthbert; Kaneryd, Kaptein, Reiten; Ramirez",
  "word_count": 673,
  "scraped_at": "2026-02-14T12:23:13.860203"
}