{
  "article_id": "db0a9c5639b8",
  "url": "https://collider.com/bottoms-marshawn-lynch/",
  "title": "Marshawn Lynch in  Bottom Is Way More Than Stunt Casting",
  "date": "20230912T014500Z",
  "domain": "collider.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Summary\n- Marshawn Lynch's casting as Mr. G in Bottoms was a surprising choice with a lot of heart behind it.\n- Bottoms creates a reality that is dystopian and utopian at the same time.\n- Lynch's role in Bottoms allowed him to rewrite a mistake he made when his sister came out to him.\nShiva Baby writer-director Emma Seligman's follow-up feature Bottoms, now available on Prime Video, was a groundbreaking hit for many reasons. The raunchy teen comedy follows Rachel Sennott and Ayo Edebiri's PJ and Josie, two lesbian high schoolers at the \"bottom\" of the social hierarchy who desperately want to have sex, particularly with cheerleaders Isabel (Havana Rose Liu) and Brittany (Kaia Gerber). They decide to start a high school fight club in an attempt to get closer to girls and hopefully get some romantic action along the way.\nOne of the most determinedly iconoclastic choices was the casting of football player Marshawn Lynch, the all-star running back who won a Super Bowl with the Seattle Seahawks, as history teacher Mr. G. But this is more than just stunt casting. Lynch has one of the most important roles in the film, and though the part wasn't written for him, it was reshaped to suit whatever he chose to bring as a performer. Lynch takes his work here seriously, both as an artist and as a person with a deeply personal connection to the material.\n- Release Date\n- August 25, 2023\n- Runtime\n- 92 Minutes\n- Director\n- Emma Seligman\n- Writers\n- Emma Seligman, Rachel Sennott\nCast\n-\nRachel Sennott\nTwo unpopular queer high-school students start a fight club to have sex before graduation.\nMarshawn Lynch's Mr. G Saves the Day in 'Bottoms'\nBottoms takes place in a funhouse mirror reflection of our own reality. \"Funhouse\" is the only word you can really use because, depending on the scene, the film is warped along different axes. Sometimes, the Bottoms reality appears dystopian, as random horrifying announcements over the PA indicate that reading is banned for the school year. But other times, it's utopian. At PJ and Josie's high school, we are frequently reminded that homophobia doesn't exist, and the only reason the two of them are unpopular is that they're \"ugly\" and \"untalented.\" The reality in this movie isn't governed by any rules, and the only real constant is our protagonists' horniness.\nPJ and Josie both have crushes on cheerleaders. Ayo Edebiri's Josie, the more grounded of the two, loves Isabel, who is dating the school's stereotypical star quarterback, Jeff (Nicholas Galitzine). One night, Jeff and Isabel get in a fight, and Josie and PJ are in the right place to rescue her. As Jeff, rampaging, attempts to block their car, they tap him with their bumper, getting a brief but satisfying revenge. One thing leads to another in Bottoms, and soon PJ and Josie have started a \"female self-defense class\" in order to spend time with their crushes. But, because the two of them have lied about their combat training, it becomes little more than a no-holds-barred violence fest for women, with faint feminist undertones. They need a faculty sponsor, and so they choose Mr. G — who openly reads pornography in class — as the teacher they deem least likely to care about enforcing the rules.\nMarshawn Lynch Takes His Role in 'Bottoms' Very Seriously\nAmerican football players wear helmets that cover their faces, so it's possible for even star players like Lynch to remain somewhat anonymous to those unfamiliar with the sport. Over his twelve-season career, he became one of the best-known players in the NFL. His personality came through in many ways. His style of play was transcendently cool and expressive. He had the best nickname, \"Beast Mode,\" and his best play, \"Beast Quake\" is impressive for even those unphased by the sport. While other stars became the spokespeople for random brands of car insurance, Lynch sponsored Skittles, a product he was known to love. One of his most famous (or infamous) moments was when he refused to answer any questions during a press conference, instead saying, \"I'm just here so I don't get fined.\" This defiance was surprisingly embraced by fans, at least relative to the punishing disapproval the sports world usually reserves for athletes who don't play along with every rule. Some of this is because people were beginning to hear athletes when they explained that their \"disapproval\" was often from having to deal with thinly veiled racism.\nBefore 'Bottoms,' Ayo Edebiri and Rachel Sennott Starred in This Short-Lived Comedy Central Series\n“I have no flaws and neither do you, and that’s what feminism is.”\nIt isn't that unexpected that Lynch is pursuing an acting career now that he's retired from sports. But it's somewhat of a shock how little his first major role has to do with the persona he projected as a player. As Josie and PJ's history teacher, he has mostly given up. But, after being recruited to oversee their fight training class, he turns out to be as close as this movie comes to a responsible adult and is disappointed to discover that the entire project is just a scheme to meet girls. Yet, this description doesn't quite capture Mr. G as a character either, because, really, Bottoms is beyond the idea of straightforward characters. It's a big silly comedy, and creating characters that make sense isn't a big part of the plan.\nThe scene where Mr. G tells PJ and Josie that he's disappointed in them explains the idea of Mr. G better than words can. He starts out by telling them that he originally felt that sponsoring their women's self-defense class was a great chance to be an \"amazing ally.\" But this spins off into a bizarre segue about his ex-wife seeming to be on board with his plans for a mint green backsplash in the kitchen before leaving him, and \"suddenly, the kitchen is lime green.\" This scene's roller coaster ride fits the film's overall template. Everything is fine — no, wait, everything is terrible. A different movie might find some way to heal this contradiction in Mr. G. But this isn't that movie. Although Mr. G cheers the girls on in their final triumph, he remains a conundrum.\nBefore 'Bottoms,' Emma Seligman Didn't Know Who Marshawn Lynch Was\nAside from being a hilariously perfect fit for Bottoms, Marshawn Lynch actually had a personal connection to the film. His sister came out to him when he was 16, and he still has regrets over the way he responded. Playing Mr. G, the mentor to two lesbian teenagers, he said felt like a way to \"rewrite one of my mistakes.\" Later, Seligman and Lynch's sister, Marreesha Sapp-Lynch, were able to elaborate on how much the role meant to Lynch as a way to feel closer to his sister. Seligman has told some great stories about working with Lynch, painting a picture of a performer dedicated to his craft.\nSeligman didn't know who he was before he was suggested to her during casting, and in part she chose him as a way of catching audiences off guard:\n\"It took a few conversations for him to feel comfortable. In our first conversation, he told me that his sister is queer and when they were in high school, he didn’t necessarily handle it super well. He felt like this movie coming into his hands was the universe giving him a chance to right his wrongs.\"\nAfter Lynch was brought on, he was expected to improvise much of his character (as he memorably did on Netflix's improv-detective-comedy Murderville). This doesn't seem to be what Lynch himself anticipated or hoped for, instead expecting to be directed with a firmer hand by a director who knew what she wanted from the character. But Seligman was after something more spontaneous. That's how the movie ended up containing a reference to \"42 Fake,\" a Mac Dre song that Seligman had never heard of. After the climactic brawl, every character in Bottoms ends up personally and romantically where they were meant to be. Rachel Sennott's unfiltered PJ and Ayo Edebiri's mild-mannered Josie are perfect as two horny queer teens, but casting NFL superstar Marshawn Lynch as the simultaneously aloof and self-aware history teacher Mr. G proved to be not only a surprising choice, but one with a lot of heart behind it, too.\nBottoms is available to watch on Prime Video in the U.S.",
  "word_count": 1412,
  "scraped_at": "2026-02-14T14:07:37.417115"
}