{
  "article_id": "db134f4692c8",
  "url": "https://deadline.com/2023/12/charlie-sheen-two-and-a-half-men-firing-chuck-lorre-interview-1235669054/",
  "title": "Charlie Sheen Talks  Two And A Half Men  Firing , Chuck Lorre Reunion – Deadline",
  "date": "20231215T201500Z",
  "domain": "deadline.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "EXCLUSIVE: I sit down for breakfast with Charlie Sheen not exactly knowing what to expect. His bookend episodes of Bookie that reunited him with Two And a Half Men‘s Chuck Lorre remind of what was lost after the actor’s inexplicable, substance-fueled “Tiger Blood” meltdown led to an abrupt parting of the ways and separating him from one of sitcom TV’s highest-ever salaries at a reported $1.8 million an episode. It has been a dozen years since then, and I come in harboring my own feelings. Basically, Two And a Half Men (the Charlie Harper Years) have been my reliable go-to at the end of most long days in the trenches. I can practically recite the dialogue along with Sheen, Jon Cryer, Angus T. Jones, as well as Holland Taylor (their mom), Melanie Lynskey (Charlie’s stalker), Marin Hinkle (Alan Harper’s ex), and the late Conchata Ferrell, who played the housekeeper Berta. It was sad watching those final episodes, as you saw the suave ladies man Charlie Harper’s face grow gaunt and know the final implosion was near.\nWe met because I’d been supportive of The Way, the inspiring road-trip film his brother Emilio Estevez wrote and directed and their father Martin Sheen starred in. What I didn’t expect was to find myself sitting across from the old Charlie Sheen, and how much he hopes this trial run playing himself in Bookie — a Max sitcom led by Sebastian Maniscalco and Omar J. Dorsey (Sheen is back for the Season 1 finale next week) — leads to a chance at redemption with Lorre, who created Bookie with Nick Bakay and Men with Lee Aronsohn.\nWatch on Deadline\nSheen would like nothing more than another shot in the sitcom ring, to show that last time was an aberration. He is serious enough that after watching his Bookie scenes, Sheen booked himself for a bit of cosmetic surgery to fix some sagging skin on his neck he worried would be distracting to viewers. Here, he discusses that, his career and future hopes, sadness over Matthew Perry, sports betting and the time he went on a losing streak for the ages with the bookies.\nDEADLINE: It was an easy yes when Chuck Lorre asked you to return?\nCHARLIE SHEEN: Yeah. I mean, save for asking Chuck to not have me actually in rehab, as a patient. I felt like that would be looking back and he totally agreed. And then he came up with, well, let’s create a mislead. You’re still going to a rehab, but you’re not a client; but membership has its privileges because you’re allowed to use the room for the game. I actually pitched the card game and then he turned it into an homage to the Two And a Half Men card game in that pilot episode, with Angus there and all. And it happened almost 20 years to the day we shot that.\nDEADLINE: I am surprised Jon Cryer wasn’t lurking in the background…\nSHEEN: It was all a cosmic trip; Jon’s there in spirit and he’s mentioned.\nDEADLINE: I’ve watched your seven seasons on that show — I could recite the jokes. It felt like you guys could have just gone on for 10 years if you wanted to.\nSHEEN: Yeah, if I hadn’t f*cked everything up, we could have done it as long as we wanted to. So they say, don’t live in regret, but you have to honor it. You have to learn from it. Well…\nDEADLINE: When you look back and you replay everything in your mind, does Two And a Half Men play back as great years? Or is that eclipsed by, how could I have f*cked this…\nSHEEN: Up? Yeah, there are a lot of great memories. Years of great memories, when we were cooking with gas and we were delivering something that people were really invested in, really enjoying, and were really connected to. And we didn’t phone it in. I mean, we were working really hard on that show, in every aspect of the production, from the writers room to the crew, to the cast. Everybody. We knew what we had, and the value of taking the time to create it properly.\nAnd I knew the rules, from day one. Well, when I say I knew the rules is just what was required of me to contribute to this workplace, what was expected of me. And so when I started butting up against those, the rules never changed. I would look at it from an athletic point of view. It’s like we practice all week and then Friday night was game night and you got to play for the name on the front of the jersey, not the back. And then, somewhere along the way, I decided that the rules no longer applied to me. And that was not fair to the system that was in place.\nDEADLINE: If I’m being honest, in those later episodes you can see your face changes and gets gaunt. We could see you going down a dark road and maybe being unable to say, I need help…\nSHEEN: There was a couple of times when I did pull myself out of it. I went and sought help and got better and came back and then … yeah, I don’t know why I was unable to maintain that. And anytime external elements contaminate the main thing, I would look for someone to blame. And that’s not fair. It’s not fair to Chuck. It’s not fair to the show. I went through two divorces, had four kids during that show. There was a lot of sh*t in my personal life that was a little bit distracting. But you got to leave that stuff at the doorstep of the stage door, right? That’s hard, but you got to park it. It is hard. It is hard. But yeah, there was a moment when I was in rehab and I guess we’d finished Season 7, or we were trying to finish Season 7 and we got the call for the renegotiation. And I was on the phone with my manager and I think one of the agents. And I said, I don’t know, man. I feel like we might’ve reached our limit here. And I’m hearing no, no, no, man, there’s so many more stories to tell. Translation: money to be made for them.\nDEADLINE: Reports ballparked your pay for that season as $1.8 million per episode or better…\nSHEEN: I mean, sure, sure. It’s a lot of money. And I said, I don’t know guys. My gut is screaming that if I go back, it’s going to go horribly wrong. I actually said that, and they were like, well, I can also go perfectly fabulous. I’m like, yeah, but that’s not the message I’m getting from my gut. So did I manifest that or did I just get a signal from the future? Maybe it was time. So, do you bow out? No! We cut the new deal and everybody was happy and then everything went horribly. Everything went horribly.\nDEADLINE: You always had that mischievous bad boy gleam in the eye, from Ferris Bueller’s Day Off to Spin City when you replaced Michael J. Fox when he left for health reasons. Were you surprised at how quickly you took to the sitcom format, when Two And a Half Men launched so seamlessly?\nSHEEN: It’s what I grew up watching. It’s what I grew up really invested in as a form of entertainment. That was very comforting for me. You got to see the same people in the same environments, trying to navigate their fictional lives, and there was always something that you could find in your own life that connected to it. That connected to the themes on the shows I was watching. It was just part of my childhood. When I finally got the opportunity to do it, it was terrifying. I had done one episode of Friends, and that was a really long week for me. I remember finishing that and the people were great, from the showrunners to the cast and the audience. It was a great night. But I left there thinking, okay, I checked that box.\nDEADLINE: Harder than drama?\nSHEEN: I’d never done theater. I had no sense of interacting with an audience or letting them be part of it.\nDEADLINE: But an episode of Friends would seem like nothing compared to what you’d been through hard ones including Platoon, which had to be your version of what your dad went through in Apocalypse Now…\nSHEEN: That was tough, but this was uncomfortable because there was nowhere to hide. At least on Platoon, you could always find, I don’t know, a foxhole or a tree, to duck behind, and there was no chicken exit here. There’s usually a chicken exit making a movie, unless you’re running into a battlefield and it’s like they’ve prepared it the entire day and you’ve rehearsed it 20 times, and it’s go time. But man, once the lights go down on a sitcom stage and you hear that bell…you got to get that breath that settles vitals, and just kind of do it. I could usually tell three lines into the first scene pretty much how the whole night was going to go, if I was riding that wave, if I was a part of it, or if I was just swimming for my life. It took Spin City for me to figure it out. I think Spin City was the perfect opportunity for me to really experience that medium in a way that I was able to get pretty comfortable with an audience, with that kind of material where it’s pretty clear what your responsibilities are, and as long as you don’t get in the way of the material and just know your role.\nI’ve always been a fan of being the anchor, and I’ve been fortunate enough that the people that have written for me saw that as my strength. It’s important to have an anchor because all the craziness that goes on around that, I’m able to center things or at least do my darnedest to.\nDEADLINE: Charlie Harper was some dysfunctional anchor…\nSHEEN: I was an anchor that was adrift. But I had the benefit of, geez, the greatest co-star, a guy could ever ask for. I say co-star, but I mean teammate. You know what I’m saying? Playing with Jon, playing off of the things he was doing, it was magical. When they said they were auditioning him, I was like, but he’s got a resume for decades. And they said, well, we need to see you guys together. I’m like, just watch Hot Shots. But that first time, it was Chuck, Jon and myself, and for the first time, we ran a scene together pretty much cold.\nIt was a moment that people speak of. You’re like, really? Yeah. I felt it. Chuck felt, I know Jon felt it.\nDEADLINE: Was it a particular scene?\nSHEEN: I think it’s in the living room, when I give the speech on the stairs and then talking about that he has his own sheets. It’s the scene that really defined who these guys are, early on.\nDEADLINE: What made it exceptional?\nSHEEN: There was never a moment where Jon said, ‘Hey, if you can do this moment like that, I’m going to do the next one.’ Nobody planned anything. I didn’t say, Hey Jon, can I get a longer beat here? No. We just read it and it was perfect. Instantly perfect, like the moment when I left Chuck’s office after our first meeting, and I just said, Hey, I need to see the script. He said, we’ll have it over in a week. And then as I was leaving, I stopped and asked, is there a title? He said, we’re thinking of calling it Two and a Half Men. And I said, wow, that sounds like a hit. And I left. So there’s those magical moments in the early part of the journey.\nBut yeah, working again with Chuck, it has really helped me not focus so much on what went wrong, or why it went wrong, or how much damage I did, or the pain I caused. It’s been cathartic for me. It’s been therapeutic to really think about, look at the stuff that me and this gentleman did for so long before. What are you going to do? Beat yourself up for your entire life? No, no, I can’t do that. I can’t do that. You’re not going to go forward. It’s counterproductive. Yeah. But it’s important for me to own it and make demands on myself, do whatever I can do to just not dismiss any part of it. I wish I could answer really what people ask. What happened? I don’t know. I don’t truly know. Something in my mind shifted, and I was no longer the person that I liked to present in all situations…\nDEADLINE: When Matthew Perry passed away, he seemed like a good guy in our conversations, and I read Sean Penn say something about that it was a shame that his struggles took too much out of his body. I thought, I’m glad Charlie pulled out of his nosedive before there was no pulling…\nSHEEN: Himself out of that. You and me both. Yeah. I felt something similar when he died about, wow, you could easily be reading about me instead. That was really sad when that happened. I just read his book. About six weeks ago, and I read it in a day. No kidding. Yeah, I turned off my phone. It was so instantly accessible and engaging that I just said, this is all I want to do today. I just stayed in it and it wasn’t like I finished at 2 in the morning. I finished at 8:15.\nDEADLINE: What made you not be able to put it down?\nSHEEN: Because I can relate to it so much of it. Because I was reliving or I was experiencing it with him. A lot of the struggle, a lot of the obsession. When you’re at that fork in the road when there are 76 really good choices, and you go with number 77. A lot of it really spoke to me, and I knew him a little bit from out in the world, from AA occasionally, and he was lovely. He was smart and funny, and yeah, he was charming and it wasn’t always about him. He included people. He was a special cat. I wish I knew him better. I’m not saying I could have influenced some change or helped him in any way, but yeah, I just wish I knew him better.\nDEADLINE: I remember doing a Playboy interview years ago with Robert Downey Jr at a time when he was trying to straighten out his life, and my, has he proven that a talented actor can do that. He mentioned being part of your crowd. Was he in your short film group?\nSHEEN: I haven’t seen Oppenheimer yet, but I heard he just nailed it. We were in the same high school. But no, he wasn’t part of the home movie group that we established. That was Sean and Chris Penn, Rob and Chad Lowe, Emilio and myself. I don’t know if he grew up in Malibu or what.\nDEADLINE: You all had parents in the business. Were you thinking this is where you would go?\nSHEEN: Nah, we made Super 8 films, and Sean was the first to graduate. He was taking things a lot more seriously than any of us realized, because he’s out there auditioning, and then he’s suddenly working a lot, and then comes Fast Times at Ridgemont High, and Bad Boys and then, boom.\nDEADLINE: Were you all thinking, we’re the next generation?\nSHEEN: No, no, we were just having fun. We were just trying to emulate or impersonate a lot of the stuff we were watching our parents do. Me, out growing up on sets around the world with dad, my parents gave us a Super 8 camera expecting us to go film the countryside. No, we had stories we wanted to tell. We kind of wrote them on the fly. If something worked, then we’d build on that. If it sucked, we’d start over. It just progressed like any hobby does when you’ve got…\nIs that Arnold? Is that Arnold that just passed?\n[Indeed, Arnold Schwarzenegger passes by outside the restaurant window.]\nSHEEN: That’s pretty cool. I saw him in the mirror.\nDEADLINE: He looks like he could kick both our asses…\nSHEEN: Him? Yeah. But I’m going to go low. You go high. Yeah…\nDEADLINE: How about you go low, and I’ll run that way toward the exit.\nSHEEN: Okay. But yeah, a lot of the kids were surfing and we were making movies. It was pretty cool.\nDEADLINE: It’s funny when you say, yeah, we were just doing this. I asked Sean Penn about his memory of Tom Cruise and Taps, and he said he thought Cruise was never going to make it because he was just too nice a guy.\nSHEEN: He is really nice; really nice. He stayed with us for a while at my parents’ house when him and Emilio were auditioning and then preparing for The Outsiders. Tom was great, man.\nDEADLINE: It happened fast for him. Was there something you saw in him that early?\nSHEEN: Yeah. He had that thing. Women want to be with him, and guys want to be like him. He had that and there was an innocence that he had. So I think when the massive talent emerged, I think it caught people off guard. I think they were suddenly really pleasantly surprised at how complex the talent is within him. I know he has gone full action mode now, but there’s some performances where you want to talk about some Oscar snubs. He’s got three of them and they’re glaring: Jerry McGuire, Born on the Fourth of July and Magnolia. Those are great performance. Oh, I’m sorry. It’s four. Rain Man. There’s probably a fifth one I’m forgetting.\nDEADLINE: When he got Risky Business, the first where one of you guys had a picture built around you, do you feel competitive?\nSHEEN: No, I had the benefit of meeting a therapist when I was 15, somebody my mom was working with. I mean, who wants to be in therapy at 15? No one. And I remember having one session with this guy. I wasn’t even acting yet, maybe I was 16, thinking about it. And he said, unless you celebrate other people’s successes, you will never have any of your own. I was like, oh, okay. That’s the only thing I remember from the 51 minutes we spent together. So I was rooting for everyone. Yeah. I wasn’t bitter. I always felt, there’s enough jobs to go around for everybody back when meritocracy was something that mattered. Yeah.\nDEADLINE: When John Hughes was making his movies, did you try out for leads in all of those?\nSHEEN: No, I was in high school when Emilio invited me to the screening of The Breakfast Club. Ah, yeah. Film’s a masterpiece. Terrific film. It’s a masterpiece. And then I’d worked a little bit, I’d worked enough for Hughes to maybe have seen something, or he knew that I worked with Jennifer Grey on Red Dawn. And so she read the Ferris Bueller script. The only exposure I had of the Bueller script was sides that C Thomas Howell was rehearsing his audition. It was the shower scene, the monologue. So he was out of the room one day and I kind of just read it and thought, oh, this looks really complicated.\nDEADLINE: What role was Howell up for?\nSHEEN: Ferris Bueller, before Matthew Broderick got it. I had never auditioned for John Hughes. I drove down to the set one day a couple weeks before that scene was going to be shot, and I threw on a biker jacket I borrowed from my brother Ramon. He was a smoker, so I put some cigarette ash under my eyes. I knew the scene. I drove all the way down there, and I see John Hughes walking across the parking lot. He’s leaving his trailer. He is heading to set. He was right around dusk, and he’s starting to walk past me. I hear “Mr. Hughes, I’ve got Charlie Sheen.” I’m expecting him to then say, “Oh, great, you’re here. Okay, let’s go read the scene.” Instead, he doesn’t break stride. He’s like, “Oh, hey, okay, you look great, kid. I’ll see you in a couple weeks.” And he kept going. And I was like, okay, I guess that means I got the job. That was my audition. The morning we shot, I overslept. I was up super late, not even partying, just I’m wanting to look tired for this role. These days, that requires no effort. I got single-dad eyes, and that’s a whole other chapter. So I was up to late at the time for me, it was 1 a.m. I had to get up at 5, get on the road by 6, and I woke up and it was 6:30. I woke in a panic, jumped in the car, sped down there. Jennifer Grey is in front of her trailer, staring at her watch. She’s like, “How could you fucking do this to me? I went out of my way. I put my neck on the line for you. How could you do this to me?” I go, hey, hey, hey, everybody. Breathe. Slow down. And so I go through makeup. I’m trying to just review the scene and now I know I’m doing a scene of someone that’s pissed at me in the scene and in real life, and I’m on the set and I see John Hughes. He says, “Oh, good. Okay. You’re here. Let’s get started.” He wasn’t like, you amateur, you slacker, how dare you? Don’t you know who I am? No, it was, you’re here. Let’s get started. I guess that’s a pretty cool example of a guy that just is interested in the reality of things as they’re happening. Interesting way to live life, isn’t it?\nDEADLINE: Got a similar story on your Platoon director Oliver Stone. I was a cub reporter at New York Newsday, and my first big feature was on Born on the Fourth of July, which he directed with Tom Cruise as Ron Kovic. I’m 20 minutes in. I guess he sees the color drain from my face. The tape recorder isn’t taping. He says, what’s the matter? I tell him. Without a beat, he says, can you get it to work? I did. And he said, let’s start again. Now, representing that film to the Long Island paper of record was important; that’s where Kovic grew up. But I have never forgotten how gracious he was to a young reporter ready to melt through the floor. Sounds like Hughes showed you the same kind of grace.\nSHEEN: That was around 39 years ago, and that’s the story I’m telling all these decades later. As opposed to a story I’m not excited to share. And that role, it was life-changing. One day you’re auditioning, the next day you’re not. It was just…cool. It shifts your focus. It doesn’t really change anything in what your goals are, what your process is, how you prepare. But yeah, it makes it a lot more fun. Can’t lie about that. To be doing something where you feel suddenly appreciated, recognized, where you feel like people value you. That’s pretty cool. It’s a pretty good thing. I think it was good to have the Bueller moment; I think the universe was kind of giving me a little peek at what might be coming. Platoon and then Wall Street. There’s BP and AP, before Platoon and after Platoon. Everything changed, like overnight.\nDEADLINE: In the jungle, stuff blowing up all around you. What was the hardest thing about making that movie?\nSHEEN: Just the endurance. It wasn’t like the scenes were so long to memorize. It was the physical endurance and trying to find, there’s a couple of moments that get super emotional and just trying to get inside of those, and whether your process is pretend that what I’m doing makes me sad enough to show that, or I got to exhume a loved one to get to that place. Whatever that is written, it’s what the moment needs or what’s required.\nDEADLINE: What was your relationship with Oliver? Your character Chris was channeling his experiences in Vietnam, where he volunteered much to the surprise of his platoon mates who were drafted and just trying to survive the carnage and insanity…\nSHEEN: That scene was with Keith David and Chris Patterson.\nDEADLINE: How did Oliver Stone help pull this coming of age stuff out of you? Clearly he knew what he wanted…\nSHEEN: We had to somehow develop a shorthand. We had done a full cast read-through while we were still in training camp. So he had kind of a baseline to work from just to see how far people were willing to go in a non-shooting moment. But no, the way he would speak about it, I didn’t want to put the pressure on myself that I’m playing the guy who’s standing right there, because then everything is measured, and uncomfortable. I just wanted to, if that was the case and I was playing a version of his experience, I wanted to make him proud. I wanted to please him first and me second, whatever that’s worth. And there were a lot of times in the middle of a scene or something that was really complicated, I could see him out of the corner of my eye having physical responses that he couldn’t obviously yell. He’d ruin the take. But I saw him having a joyous physical responses, he was so excited. He was rooting for his favorite team, down by five with a minute left inside the five. It was kind of cool to go home certain nights on that film and know that I was able to create a sense of satisfaction, a sense of joy, whatever he experienced by what I chose to do.\nBut man, we were so young, it’s really hard to, there’s the, what’s that thing they talk about? When you give a speech? There’s the one you give in your car on the way there, the one you give there and the one you give on the way home. It’s kind of the same thing with acting. There’s the scene you prepare at home, the one you do on set, and then there’s the one you do driving home. You’re never quite sure of the three. It’s like a shell game. Which one you should have gone with? I just wish that that had at had spilled over into Wall Street, the camaraderie and the connection. We were almost spiritually connected on Platoon.\nDEADLINE: How was it different on Wall Street?\nSHEEN: A lot different. That was a really difficult shoot, harder than Platoon in some ways. The amount of dialogue, the amount of locations, the amount of pressure that he had heaped upon himself because of the Oscars from Platoon. There was energy deep in the details. And the scene where I meet Michael Douglas…we shot that over two days, and it was 56 setups in two days. And at one point Michael kind of leans in. I’d known him for a week now. He’s like, can you think of anything different that we should do with this? He was basically saying, I’m out of ideas. I’m at the end of my rope. And I was like, I got nothing, boss. He was like, yeah, me neither. We bonded through the struggle. In Oliver’s defense, we were up against the director’s strike toward the end of the movie. So we had to shoot 16 days, in eight. This wasn’t second-unit pickups, We had to do twice the work in half the time.\nDEADLINE: Michael Douglas is another guy who comes from a storied acting family. What kind of kinship forms from that?\nSHEEN: You just brought something I never thought to engage him on because the workload was so intense. I never wanted to be that guy. It was like, “Hey, let me bring something up that makes you think about anything but what we’re supposed to be doing, because people did that to me.” I felt like I was in a dinghy in the Indian Ocean. So we never really even got into that stuff. And I don’t care, maybe if you’re De Niro, Pacino, my dad, there is something you have to work through when you first start working with someone that might make you starstruck. It doesn’t matter what you’ve done, how cool and important or famous you think you are, or people tell you you are. When you’re with someone you’ve grown up watching or whose work you really appreciate, there’s a mystique that comes with it that you can’t ignore. And I know that a lot of people won’t admit that, but I know that it happens to almost everyone. I think it’s okay to honor that, to recognize it. It’s like, you meet Roy Scheider. How do you not go back to Jaws being a 10-year-old in the summer of ’75, watching that change your life forever? Yeah.\nDEADLINE: Sounds like a story there…\nSHEEN: It’s funny. I do have a regret about Scheider. I was 12 years old. Jaws had been in the theater for almost a year at that point. We had been in the Philippines. Dad drops me at a diner in Malibu that no longer exists. He says, I got to run to the post office. I’ll be right back. Right. At that point, I’ve seen Jaws probably 50, 60 times, no joke. In a movie theater. I probably ended up seeing it a hundred times in a movie theater, and who knows how many times at home. It was an obsession. I have tattoos. Anyway, it’s madness. So he goes to the post office, and I’m sitting there and I sense a figure sitting right next to me, and I just threw a quick glance. It’s Chief Brody, it’s Roy Scheider. And I’m frozen. I could easily said, “Hey, I’m sorry to bother you, Mr. Scheider, my dad’s Martin Sheen. You guys probably have met in New York. He’s across the street. I just wanted to say hello.” I was frozen. I didn’t say a fricking word. And then I guess he was just having coffee, and he left, and dad came back. Had dad come back a minute earlier, he would have said, “Hey, Roy, this is my kid.”\nDEADLINE: Sounds like this haunted you.\nSHEEN: I lived with this for years and years and years. So we do Two And a Half Men. Holland Taylor, who played my mom, is really good friends with Roy Scheider, so I tell her the story and she tells it to Roy. So at least the circle was closed, by mom. At least he knew. And he was tickled by it, thought it was the coolest thing. Yeah. Isn’t that something? But damn, it’s like there’s another thing we talk about regrets. I had all those years to reach out to someone and never did.\nDEADLINE: I watch that movie obsessively. I could listen to Robert Shaw’s soliloquy about the USS Indianapolis right now and be shaken. What stands up for you?\nSHEEN: All that, and, well, there were no computers. Everything they did had to be done practically. And that blows my mind. Much like Apocalypse, there were no computers. These days you can do anything. Most times, the actors leave the set, go on vacation and on to the next project. I dunno, Jaws touched something in all of us. It touched the vulnerability. And I think we could, in different viewings, see ourselves in more so in a different character than another. Yesterday, I was Quint. Today, I’m Hooper. Star Wars had a similar effect. I didn’t see it a hundred times, but as far as being taken somewhere, it just changed the way that it altered expectations forever. Talk about raising the bar. Jesus.\nDEADLINE: I interviewed Ridley Scott for The Martian, when JJ Abrams was reviving Star Wars. I asked what the first one meant to him, and he said he had a movie set, and went to see Star Wars with its producer. He exited and told the guy he couldn’t do his movie, he had to do something in space. That led him to Alien.\nSHEEN: And George Lucas was supposed to work on Apocalypse Now, and when that did not happen, he used the Vietnam War as the symbology for the Rebels and the Evil Empire. No kidding. Yeah. So these films that change things forever have this ear-woven, connective DNA. Also, it was Brian De Palma that told Lucas to put that scroll in the beginning. He screened it and he was like, okay, it’s great. But we don’t know who anybody is. We don’t know where we are. We don’t know why we are there. We’re fully confused. We love it, but it’s super confusing. He said, why don’t you just tell everybody, just write it out. Just say, all right, here’s what’s going on. And then start the movie. And he did. How about that?\nDEADLINE: Speaking of mythology, you’re back with Chuck Lorre, at least in two episodes of The Bookie. It’s fun seeing you back. How did you like seeing yourself back?\nSHEEN: It was all a surprise. I didn’t read any script I wasn’t in, so after the first one, when I finished fricking flop-sweating … watching yourself the first time with people is a nightmare. I have a fun story about that in one second. So I’m just an audience member from two through seven, actually two through eight. Usually, I’ll read the whole script, but I’m not going to micromanage, break it down like I usually do. I’m concerned with my stuff, and the other isn’t my business unless it’s mentioned in the scene I’m in. I’m along for the ride.\nDEADLINE: Do you want to star in another sitcom? Would that be too much, considering how it unraveled last time?\nSHEEN: So you’re asking would I do another sitcom?\nDEADLINE: Yeah.\nSHEEN: Yes, I would. And it wouldn’t be too much on me. It would be insanely satisfying and enjoyable. I think people would really, really get a kick out of it.\nDEADLINE: Would you want do it with Chuck Lorre?\nSHEEN: Yes, absolutely. Yeah. If he decided, “Hey man, let’s finish how we started,” if he said that, I’m asking where and when. I’ll read the script when it gets there, but it’s as simple as that. Because it goes back to give the people what they want. Nobody comes up to me in the street and says, “Hey man, I can’t wait to see you in a gritty drama.” Nobody says that. So I’m just basing it on what the vibe is out in the world. And everybody wants to talk about Two And a Half Men, but also Major League and the Hot Shots and Men at Work and Young Guns.\nDEADLINE: A lot of actors probably get stopped but that doesn’t mean they’d be on top of the heap like you were before it all went bad. Is there more to your ambition?\nSHEEN: Yeah, I owe it to myself, first and foremost. And then whatever happens after that, whatever the results are, and if people love it or hate it, that’s out of my hands. But just on my observations, I have it on pretty good authority that they would enjoy it.\nDEADLINE: But maybe you want to show you can be a good soldier again, and that others won’t have to worry not someone others have to worry about. Success takes discipline.\nSHEEN: Me. Thank you. And that’s what part of doing Bookie was all about. It was an audition for accountability, responsibility, professionalism. Yeah. I was always the guy who was first to arrive and last to leave. I went in overprepared…\nDEADLINE: You want to be that guy again?\nSHEEN: Yeah. I want to be that guy again. And so coming back to do Bookie, I checked all those boxes. I was there to prove I would do what was asked of me and do it in a way that I’ve been programmed to do for a very long time. It was really refreshing to reactivate those muscle groups. And again, it was, right back where we were. The shorthand between Chuck and I. We were right back to having a shorthand that was there once.\nHe doesn’t give a lot of notes. He lets a performer do what he’s doing because that is the reason he got the job. He honors that and he’ll come in with one very specific thing. And, he’s always right. It’s kind of annoying. He’s always right. And you do that thing, you’re like, of course. Okay, well that makes sense, how did I miss that? But you can’t think of everything all the time, right? I think he was experiencing the same thing. I was just us feeling the energy again of how it was, before it wasn’t. So that was exciting. That was exciting.\nBut I did something, I think I need to talk about it because nobody else does these days. So leave it to this guy.\nDEADLINE: Have at it.\nSHEEN: So I saw the show on a giant screen on the Warner lot with a cast and crew. And, much as I felt at the table read, when you come in on page 38, you’ve got a long time to stay nervous. So when you’re watching it, you had just as much time to stay nervous. I thought I did pretty good. I thought the scene was really good. I thought the show was terrific. All the other actors were spot on, and I think it was so big.\nDEADLINE: What?\nSHEEN: I’m focused, laser-focused … on a physical trait of mine. And I’m like, I need to fix that. It was my neck.\nDEADLINE: Your neck?\nSHEEN: Yeah. I’m looking at it and I look like when a really heavy person loses all the weight and their neck is still kind of a … turkey gobbler. It’s a saggy, flappy thing. I’m looking at that going, holy f*cking sh*t. It looks like that. This is Monday night.\nDEADLINE: What did you do?\nSHEEN: I could have stayed upset about it or I could get right into solution. So I see this on Monday night, and Tuesday morning, I’m on the phone with a doctor scheduling this thing.\nDEADLINE: You’re having it fixed?\nSHEEN: It was either that or go shopping for turtlenecks. I’m doing it in two weeks. In two weeks. But the next morning I was like, I didn’t want to see that again. And people shouldn’t have to look at that. It’s the disadvantage of not being on camera for 10 years. I see myself in the mirror every day and I’m like, alright, things have held together. This is the dialogue we have with ourselves in the morning. Yeah, this’ll have to do. But I saw that and I was like, wow, the last decade, not so friendly. So…\nDEADLINE: If we were on Two And a Half Men, in the words of your mother, you’d be able to say, of course my new neck looks great…\nSHEEN: It’s a Schenkman. Exactly. And if people are like, well yeah, I said I was going to do it, and I did.\nDEADLINE: Can it be vanity if you are trying to remove something that might distract viewers?\nSHEEN: And I’m not implanting anything. I am smoothing some sh*t out. Yeah. It really bothered me.\nDEADLINE: Something that really bothers me. I’m like a huge pro football fan, I watch SportsCenter every day, but now with FanDuel and other legal betting sites, every ad is sports betting, and even the hosts and players are touting bets. Bookie is about sports betting. This something you are big into? I never bet and I’m not sure there’s a question here, but it seems this can’t end well.\nSHEEN: No. I don’t bet, but I lived in that world. I was 2, 5, 7. Mr. Green. When [Sebastian Maniscalco] is taking those calls and they got the number and the code name, that was me. I retired in 2009. When [Manny] Pacquiao beat [Oscar] De La Hoya, I went out on a win.\nDEADLINE: Why did you stop?\nSHEEN: I got to a place where I felt nothing on the wins. So I had one of those moments where I sat down with myself and I said, okay, unless my own kids are the wager, if it has to be that for me to feel it again, I think we’ve reached the end of the internet. And no, I didn’t go through GA. I’m not a recovering degenerate gambler. I am a retired degenerate gambler. I got beaten into retirement, so I can’t help but pay attention to what you said. Everybody knows the lines of everything before it happens. It blows my mind to this day; there’s a couple minutes left, and you’re sitting on the number, and a lot of people are. What I do have an issue with is when the camera follows most field goal attempts from that angle, the backdrop is usually a giant advertisement for a gambling site. FanDuel, Caesars. It’s everywhere in the stadium. As you say, you can’t avoid it.\nBut the players, if they’re caught doing it, are penalized severely. It’s the greatest external revenue source for the NFL, maybe ever, outside of TV rights. But no, no, no, no, the players mustn’t bet. We support it to a point, to there’s a line. I just find that to be a little hypocritical.\nDEADLINE: What I always think is that the reason why they can spend so much money on advertising is not because of the people who win, but all of them that lose. And what is this going to look like in five years? Degenerate gamblers are not going to have their legs broken like they did back in the days of illegal bookmakers who thrived like the ones in Bookie. But there will be a lot of incidents like the first scene, where we see a perpetual loser played by Ray Romano get thrown out of his house that’s about to be foreclosed. As he waves bye to his heartbroken kids in the window and throws his luggage in the car trunk, he pauses to call in a bet on a game.\nSHEEN: First episode. Exactly. I think a lot of the reason why it was rejected in California on the ballot, and people said, I’m not having it, even if it would’ve subsidized a lot of programs that are hurting, they were more worried about all the kids that were going to get addicted. I don’t know. I know how bad it can go, but I also know people who are fine, celebrating a $100 parlay. I think there’s more of them than me.\nDEADLINE: Did you get too far in?\nSHEEN: Yeah. I approached gambling like I approached drugs. It was the same thing. It was the same energy. It was the same vibe. Calling the bookie was like calling a dealer, waiting on the game was like waiting for the delivery. And it was never about the result. I finally decoded it one day. It was all about that moment, right before the kickoff, the tip off of the puck dropping at the opening bell. The first pitch. It was that moment. And once any of those four things, five things happen, you’re in. There’s no chicken exit. It’s like, okay, it’s on. And that’s the feeling I got addicted to, everything that led up to it.\nDEADLINE: You were making so much money on Two And a Half Men…\nSHEEN: That much, it was a bad combo.\nDEADLINE: Did it noticeably cut into your earnings?\nSHEEN: Yeah, at one point it did.\nDEADLINE: The avoidance of bookies is the source of some of the funniest scenes in Bookie. Ever had to avoid one of these guys when you lost big?\nSHEEN: I had to borrow, once, and that crossed the line for me. The rule I always abided by was never make a bet you can’t pay if you lose. And I did.\nDEADLINE: How big a bet?\nSHEEN: It was a lot. It was a lot. Yeah. It was a couple weeks’ salary, but this was before the big deal. It was enough to really have to scramble.\nDEADLINE: Can you say which team let you down?\nSHEEN: What I can say is, I had a run that if you put it in a movie, nobody would believe it. It was that one point in the season when a few sports cross over, I think it’s October. No, I’m sure of it. And I lost 21 plays in a row. You know what the odds of doing that are?\nDEADLINE: You mean you lost 21 bets in a row?\nSHEEN: Individual bets, Yeah. In a row. You have to take the age of the universe squared, to come up with the odds for that happening.\nDEADLINE: These betting sites warn you should not chase your losses…\nSHEEN: Yeah, you get to nine, you get to 12, you’re like, alright. It’s like you’re flipping a coin. At some point it’s going to come out 50/50, right? And it didn’t, man. It didn’t. And it got to the point where the book would take my play and then put out the other side to all the sharps, to all the pros. They’re like, this guy’s on a run you can’t believe so here’s what he’s on. You take the other side, and I guarantee you’re going to win.\nDEADLINE: So you got to the point we see in Bookie, where the guy doesn’t want to take the bet and says, if it’s Monday and you’re betting on tomorrow’s being Tuesday, don’t make that bet. There’s got to be fodder here for a Season 2 storyline, where you are losing so badly the bookies are laying odds against your bets.\nSHEEN: Yeah, I was giving them the Monday sports page, on Sunday, when I made a play. I can laugh about it now. It wasn’t funny then though. No, I was talking to myself. People couldn’t believe it. I had friends saying, Hey, why don’t you take a day off? And I’m like, because that day I’ll go three and oh, and that’s the day I’ll get everything back. The gambler’s logic. So being in a show and then Chuck and Nick Bakay crafted this show and thought, who should some of the clients could be? And Chuck was like, what about Sheen? He knows a lot about this world. I witnessed it firsthand.\nThere was a producer on Two And a Half Men, and we were gambling partners. We’d go through the games all week and then we’d land on a few. And so, on show night, I’d do a scene. I couldn’t track the scores. So in the middle of getting notes, Lee [Aronsohn]’s there, Chuck’s there, some of the writers are there and we’re trying to fix the scene or make it better or whatever. I would glance up to see one guy, and he would find my field of vision and he would give me a thumbs up or a thumbs down, depending on how our bet was doing. And if the game had ended, he might do this [mimics dragging a razor across the throat]. So when I got the thumbs down, the neck drag, I had to fight through feigning excitement to keep doing the show that night. It is karmic and ironic I wind up in a show about that, having lived in that world pretty deeply, and then coming out the other side.\nDEADLINE: As a fan of your work and especially on Two And a Half Men, I gotta say, I missed that guy.\nSHEEN: Yeah. Thank you. Thank you. For a while, I missed that guy too.\nMust Read Stories\n14 Comments\n-\nAnonymous\nThat was a very lovely interview.\n-\nAlex\nChuck, thank you for reminding us that forgiving is the greastest power. Bravo Chuck.\n-\nMark Burg\nOnce a star, always a threat…. Whoever takes a chance on Charlie Sheen will have a giant win.\n-\nDo Better\n“I know he has gone full action mode now, but there’s some performances where you want to talk about some Oscar snubs. He’s got three of them and they’re glaring: Jerry McGuire, Born on the Fourth of July and Magnolia.”\nJerry *Maguire -\nKDD\nCharlie Sheen is a true talent. I have enjoyed 2-1/2 men and still do. He has been amazing in all his movies. I am glad he is on a positive path in recovery and I hope it continues. Thankful to the mended relationship with Lorre. Can’t wait to see what they do together. In a world of crappy new TV, I am excited to see some funny talented shows re-emerge. Great article.",
  "word_count": 8330,
  "scraped_at": "2026-02-14T12:40:26.208844"
}