{
  "article_id": "db1bf408c6a2",
  "url": "https://www.pastemagazine.com/movies/richard-linklater/what-we-talk-about-when-we-talk-abouteverybody-wants-some",
  "title": "What We Talk about When We Talk about Everybody Wants Some !! ",
  "date": "20240820T211500Z",
  "domain": "pastemagazine.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "What We Talk about When We Talk about Everybody Wants Some!!\nThe recent “Glenaissance” has everyone’s sights firmly set on the box office’s latest slam-dunk Glen Powell, but let’s not forget his first turn toward movie-stardom: Richard Linklater’s very good, very charming and very rewatchable 2016 box-office bomb.\nI am a compulsive person, someone who gets caught up in the oft-annoying routine of digesting the same thing over and over and over again. I’ve been this way since high school, when I spent one summer constantly hitting the “play” button on my DVD player every time the Walk the Line menu would reappear. This was before Letterboxd was at our disposal, tracking our every waking moviegoing move, but I think I totaled at least two to three-hundred viewings of the Johnny Cash biopic before school started again that August. Every year, from Black Friday until Boxing Day, I watch both Home Alone and Home Alone 2 at least one time each per day. I sleep with one song constantly playing on loop. Last night, it was “Charlie Don’t Surf” by the Clash. Previous culprits have been anything from “Hard Drive” by Cassandra Jenkins to “True Blue” by Dirty Beaches to “I’m On Fire” by Bruce Springsteen to “Oysters in My Pocket” by Royel Otis—the latter of which, according to my Airbuds account, I listened to over 300 times in one week last month. I bring all of this up because no film has ever been the subject of my media-centric OCD more than Everybody Wants Some!!, the 2016 flick made by Richard Linklater, the only director in my Letterboxd log with no films rated below four stars.\nSubconsciously, my movie taste has taken shape through the lens of Linklater’s world. He is my Scorsese, someone whose filmography—whether it’s an animated movie like Apollo 10 ½ or a more by-the-book comedy like the recently released Hit Man—exists in service to making sense of the act of living through nonsensical, non-linear storytelling. Many of his films have no rising action or real, bona fide climax. They just are. A film like Paris, Texas likely stirred Linklater’s fascination with finding a glow in a mundane snapshot and studying the dimensionality of time, and it makes sense that some of the movies I hold closest are Boyhood, the Before trilogy and, of course, Everybody Wants Some!!, the spiritual-but-not-explicit sequel to Dazed and Confused.\nIn the show Friends, there is a moment where Rachel is on a date with a man named Michael. At one point, Michael says that he’s been keeping himself occupied on their date by watching the movie Diner in his head. When I first binge-watched Friends, which was done in increments because my only access to the show was through those $20, two-seasons-at-a-time DVDs you could buy at Walmart, that Diner joke never stuck out to me. But now, as I’ve shifted through countless films that, at the mercy of my own brain-drain, I’ve watched over and over again, I get it. I can watch Everybody Wants Some!! from start to finish in my head; I can recite every line of dialogue like it’s my own personal Rocky Horror Picture Show.\nEverybody Wants Some!! came out just four days after my 18th birthday. I’d already seen Dazed and Confused countless times, which had me excited about the possibility of it having a sibling—even though that sibling that did arrive was more like a continuation of Boyhood but set over 30 years in the past instead. While Dazed and Confused was the perfect film for my father’s generation—the men who went to high school in the 1970s, loved rock ‘n’ roll and thought football and girls were the only things that mattered—I was the perfect target demographic for Everybody Wants Some!!, especially since I was, like Jake (Blake Jenner), on my way to my first semester of college with a car loaded with more vinyl records than articles of clothing.\nAs somebody who hasn’t worn a T-shirt made in the 21st century in six months (at least), I resonate with any attempts at capturing the magic of yesteryear in a modern era. Growing up, baseball was my bag and so was the period of music where rock ‘n’ roll was subsiding under the weight of new wave’s ever-growing popularity. It’s why the film’s opening song, “My Sharona” by the Knack, is the perfect segue from Dazed and Confused to Everybody Wants Some!!; it’s why a soundtrack that juxtaposes Van Halen with Blondie and Gary Numan properly captures music’s grab-bag metamorphosis when the 1970s became the 1980s. Funnily enough, I sat down to show my dad Everybody Wants Some!! earlier this summer—because his favorite movie ever is Dazed and Confused and he graduated high school in 1981—and we barely got 20 minutes into it before he asked to turn it off, on account of “nothing happening.”\nThere’s a bit of irony in that, in how, to him, “something” happens in Dazed and Confused but “nothing” happens in Everybody Wants Some!!—even though both films are built on the foundation of capturing a very condensed, fleeting chunk of time where everyone is in motion but their contours are not always defined. The former takes place across one night, while the latter chronicles the weekend before college classes begin. “It’s supposed to be a baseball movie, but there hasn’t been a single second of anyone playing baseball,” my dad griped. “All they’ve done is drink beer and dance.” Now, his measurement was not wrong. All of that is exactly how the first 20 minutes of the movie go. It’s also how most of the last 90 minutes go too, except for one very funny baseball practice sequence. I don’t think it would be presumptuous to assume that, if I were to challenge him to watch Linklater’s Before trilogy, he would not make it through the first half of Before Sunrise. But I digress.\nIt should go without saying that I was not a member of the Paste staff when Everybody Wants Some!! came out. I certainly do not agree with this site’s 6.0/10 rating, but reviews and review scores age poorly all the time. Hell, there are some reviews of albums from 2023 that I wrote that I already disagree with in retrospect. It happens. I don’t think Everybody Wants Some!! is perfect, especially not by any cinephile’s standards, even if I do think it’s a five-star hit and it is in contention for my most-rewatched movie ever. It was never going to win an Oscar, and it’s far from the most “prestige” entry in Linklater’s catalog. But, it’s better than Dazed and Confused and, by my account, might be the fifth or sixth-best thing the Texas director has ever done—slotting in nicely behind the Before trilogy, School of Rock and, depending on the day and depending on my mood, in front of or behind Boyhood.\n2016 will never go down as one of the best years in film history. It’s not even good enough to exist in the same room as 1974, 1939 or 1968. But flicks like Manchester By the Sea, Your Name., Arrival, Moonlight and a bunch of not-great MCU titles overshadowed Everybody Wants Some!! from the jump—even though it should hold the same staying power as The Nice Guys. It was a box-office bomb, grossing just $5.4 million on a $10 million budget. Critics loved it (except for Paste), but it hasn’t quite caught the “cult classic” status that Dazed and Confused garnered after its post-theatrical physical release 30 years ago. It’s not like kids my age were going to see a movie that was spiritually tethered to a movie that came out 5-10 years before we were born and take place 20 years earlier than that, either. But there’s a reason that I’ve been thinking about Everybody Wants Some!! in a larger cultural context lately, and it’s because of one member of its cast: Glen Powell.\nIt’s no secret that Powell is, quite possibly, the most in-demand leading man in the film industry right now—or, at the very least, he’s about to be. The “Glenaissance” began in earnest two years ago, when he nabbed a top-billing in Top Gun: Maverick and then, in 2023, stole our hearts in the unlikely smash-hit rom-com Anyone But You (starring alongside Sydney Sweeney). Now, as 2024 is chugging along through its second-half, he’s delivered back-to-back victory laps in Hit Man and Twisters. It doesn’t hurt that he also seems like one of the most down-to-earth, up-and-coming hotshots in Hollywood. From his dog Brisket becoming a viral sensation to him and his Twisters co-stars hopping onstage with country star Luke Combs and chugging beers, Powell is everything Ryan Reynolds wishes he was.\nAnd from the first moment we see Powell onscreen in Everybody Wants Some!!, he commands every inch of it. Playing a senior named Finn, he is a bronze god who reads Jack Kerouac, smokes out of the same pipe Milburn Pennybags uses and wears a floral-pattern shirt/cut-off jean shorts combo that, when paired with a porn star mustache and beach-frizzed blond locks, puts your attention in a chokehold. Everyone around him is really trying to play up their character—likely the result of a cast of unproven, unknown actors trying their damnedest to linger in our hearts beyond the final credits roll—but Powell makes his persona work without doing much leg work. This is the reward of being terminally charming. When the camera pans to Finn at a club picking up women simply by being honest about his not-so-well-endowed package, Powell is the only actor alive who can make that scene work so well. As he attempts to score a hook-up at the country bar in town by talking about his major, he calls himself a “cunnilinguist” who is “buried in his work.” It’s a masterclass in charisma.\nIn fact, Powell is such a force in Everybody Wants Some!! that you may have forgotten that he isn’t even top-billed in it. That honor went to Blake Jenner, who had caught popularity during his turn on Glee but has since gotten himself kicked out of casting calls because he’s a domestic abuser. In a lot of ways, we ought to remain thankful that Powell’s very obvious star power was insuppressible throughout Everybody Wants Some!!—having to consider Jenner’s presence for even a moment is a tooth-pulling affair I often try to avoid, and thank goodness his character is the least interesting out of the whole ensemble.\nBefore Everybody Wants Some!!, Powell’s filmography wasn’t very impressive. He was in a bunch of sequels—The Dark Knight Rises, The Expendables 3, Ride Along 2—but in pretty uninteresting ways (the gigs you take to climb the ladder, etc.). For me (and most of my generation), I knew him best as the “Long-Fingered Boy” in Spy Kids 3-D: Game Over.\nVery rarely do we get to experience star-making performances right before our very eyes. Powell’s turn in Everybody Wants Some!! seems like one-in-a-million, because it happened in a movie that was a commercial failure and, if accolades are a strong measurement of anything, was a “disappointing” follow-up to the movie that should have nabbed Linklater his first-ever Best Picture Oscar. If you haven’t revisited the film since before Powell had his Top Gun: Maverick blow-up, I implore you to spend an afternoon with it. His performance is the most enjoyable third- or fourth-fiddle turn in any movie from the last decade. As far as heat-checks go, Powell was the Hollywood equivalent of Klay Thompson putting up 37 points in a single quarter. Even in that Paste review eight years ago, writer Nick Schager noticed something peculiar and memorable in Powell, noting that Finn is “the most true case” of the film’s “smug louts, hyper-gonzo wild cards, dim-bulb doofuses or insane hillbillies slowly develop[ing] semi-distinct personalities of their own.”\nIf Linklater is the Godfather of the Hangout Movie, then Everybody Wants Some!! is his magnum opus—the act of “living in the moment” zoomed out into a 110-minute feature. At the end of Boyhood, Mason (Ellar Coltrane), while running on the fumes of a pot brownie in the company of Big Bend’s majesty, has a sudden realization: “The moment seizes us.” Everybody Wants Some!! singlehandedly acts as Linklater’s term paper on that one sentence.\nThe men run around in crop tops and tight denim, drink from sunup to sundown, make $5 bets with each other, play “knuckles,” ping-pong and mini-hoop basketball, watch soap operas, play card games with fake rules, swim in rivers and talk copious shit on the team’s country bumpkin Beuter (Will Brittain). One night, they’re at a disco getting free drinks and having sex in cars, closets and on top of half-full waterbeds. 24 hours later, they’re in kicker attire hitting on women at a honky-tonk bar. The next day, they’re kicking up a fuss at a punk show mere hours before retreating to a party at their house just off campus.\nOver the course of 72ish hours, we get a glimpse into the lives of half of the baseball team—getting the same kind of surface-level idea of who they are that Jake and his fellow freshman also got. Finn is the confident flirt; McReynolds (Tyler Hoechlin) is the blunt, egotistical team captain who’s likely going to go pro; Roper (Ryan Guzman) is the attractive upperclassman with a cocky attitude and “the best cheese on campus”; Douglas (J. Quinton Johnson) is the level-headed mentor figure who still lets loose; Willoughby (Wyatt Russell) is the coastal stoner who loves “Fearless” by Pink Floyd, the planetary musings of Carl Sagan and is, in fact, lying about his age; Nesbit (Austin Amelio) can’t stop making wagers he’ll never win and dresses like a hippy Tom Selleck; Plum (Temple Baker) is the annoying freshman who wants to be chill and fit in and, in the process, hasn’t yet formed his own taste for anything (though the delivery of his “I wish I had a tail. Fuck, that would be awesome” quote is great); Jay Niles (Juston Street) is the hot-head transfer pitcher who thinks he’s the second-coming of Nolan Ryan but will likely get divorced four times before he kicks the bucket. Jake is the Walt Whitman-reading, not-yet-corrupted jock who quotes the Myth of Sisyphus and will date the same woman all four years of college (in this case, it’s Beverly, played by the underutilized Zoey Deutch).\nBut Everybody Wants Some!! is not just a character study. Jake mentions something to Finn about them hopping in and out of costumes and different-themed bars, how it all feels so performative and phony. “It’s not phony, it’s adaptive,” Finn replies in assurance, before motioning to his teammate that they should, in fact, go jump in the mosh pit while the band onstage covers the Gilligan’s Island theme song. Those moments, when the athletes leave the baseball house and challenge their own comfort zones, are what makes Everybody Wants Some!! so readable and so lovable. And that small moment of worry that Jake brings to light, that he and his friends are lacking an identity, is a good representation of Linklater’s view on how Texas—and America—was changing in the wake of Reagan’s incoming presidency.\nContemporary culture was still stuck in a post-Vietnam purgatory; disco had died, country music was nose-diving into a commercialization that would eradicate outlaw music and punk had not yet seen its roots carry favorably into hardcore scenes. Jake’s love for the Cars and Devo is anomalous; too many of his teammates can’t fathom how any of the non-baseball-playing students even carry on through life. It’s all painfully uncertain and, sometimes, laughably funny because you can sense that, in time, they will all find their place once the growing pains even out.\nBut that’s also why a performance like Powell’s in Everybody Wants Some!! is so memorable. Underneath all of that charm, he eventually reveals that, like most adults whose lives aren’t consumed by college baseball, he is on a quest for companionship. Finn is not just the charming pick-up artist of the crew; he’s the emotional anchor of the entire cast, very subtly sharing his all-too-familiar case of loneliness through a hunger for intimacy that can’t be satiated by casual sex. “Have you noticed that, whenever we’re around baseball, all we talk about is pussy,” he hurls at his teammates outside a party at the theater house. “Now, we’re actually around a few potentially interesting young women and all you talk about is baseball. It’s a little fucked up!”\nThere’s a concerted effort from Linklater to really gnaw away at the question of what it means to be young and tumbling at full speed toward an adult life that demands you break away from the things that defined your high school essence. My dad graduated high school and went straight into the workforce. Maybe that’s why he watched the first 20 minutes of Everybody Wants Some!! and declared it to be a waste of time. But that’s why the film’s final act, in which Jake pursues Beverly and finds that her radiance demands he step out of his own stereotype, is the only proper conclusion that a lesson in time like Everybody Wants Some!! could possibly have—an ending with no real closure but a sense of bliss.\nA question then arises: Where do Jake, Finn, McReynolds, Roper, Beuter, Nesbit and Plum go next once the credits start rolling? To their next class, I’d imagine. They go into tomorrow and the day after and the day after that. That’s the thing about Richard Linklater’s filmography, that all of his characters continue to exist and grow up even after we’re finished with them. I’ve been like every one of those guys at one point in my life, rollicking through a still-green, identity-less personhood spoken in different languages of ego, horniness, loneliness and doubt. It’s so easy to watch a movie like Everybody Wants Some!! over and over in your head if you’ve lived its story, too.\nMatt Mitchell is Paste’s music editor, reporting from their home in Northeast Ohio.",
  "word_count": 3013,
  "scraped_at": "2026-02-14T13:15:47.620312"
}