{
  "article_id": "db2df84df076",
  "url": "https://www.oregonlive.com/ducks/2024/12/sure-dillon-gabriel-and-marcus-mariota-share-a-no-8-oregon-jersey-but-their-connection-runs-much-deeper.html",
  "title": "Sure , Dillon Gabriel and Marcus Mariota share a No . 8 Oregon jersey . But their connection runs much deeper",
  "date": "20241228T144500Z",
  "domain": "oregonlive.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "EUGENE — The story has been told so many times in so many ways, it’s already become part of Oregon football lore.\nDuring his recruiting visit to Eugene last December, Dillon Gabriel discovered, to his great surprise, that Marcus Mariota’s famed No. 8 uniform had not been retired. The Ducks had tried, more than once, to enshrine it, but the only Heisman Trophy winner in program history had always refused.\nThat meant Gabriel, who had worn No. 8 the previous two seasons at Oklahoma, could do so again for the Ducks.\nBut it wasn’t that simple for Gabriel.\nHe grew up idolizing Mariota, who, just like him, was a star quarterback from Oahu, Hawaii. When Gabriel was a kid, he spent Saturdays watching Mariota and the Ducks on television, wearing an Oregon jersey. Sporting the real No. 8 would require Mariota’s permission.\nSo, standing in the Oregon football equipment room, a giddy Gabriel pulled out his cell phone and dialed up his hero to ask a question that once seemed inconceivable … and the call went to voicemail.\n“He couldn’t answer because he was putting his daughter to sleep,” Dori Gabriel, Dillon’s mother, said. “So he texted back and said, ‘Hey Dillon, just text me.’”\nAnd so one of the most unique and memorable requests in program history went down via text message.\n“I told him I would be honored if he wore the number,” Mariota said. “It meant a lot that he took the time to do that and it was a gift to have those conversations. It’s led to a great friendship.”\nBut the No. 8 isn’t just a random digit connecting a cherished part of Oregon’s past. It’s symbolic, representing the eight main islands of Hawaii, which connects a pair of Hawaiian boys to the culture, aloha spirit, Ohana and brotherhood they were raised with. As Gabriel has carried the Ducks to the brink of their first national championship, he has done so with an island — and Mariota — watching.\nSince that first text last December, the two have communicated regularly, with Mariota sending text messages of support, encouragement and congratulations, often before and after big games. What started out as a plea for a uniform number has turned into a friendship.\n“With Marcus, I think it’s a different relationship,” Gabriel said. “That was a guy I looked up to. A role model. So I’m very appreciative of him and how he represents himself, his family, his university, everywhere he’s been. And Hawaii. He’s a guy who’s done it right the whole way. What a guy to look up to. People say not to meet their heroes or whatever. But, gosh, I met mine and I’m very appreciative of him. Because he’s the same guy and represents the right things. So I’m very blessed and grateful for that. I’ll never take that lightly because I’m lucky to have it.”\nCFP quarterfinal at the Rose Bowl\n- Who: No. 1 Oregon Ducks (13-0) vs. No. 8 Ohio State (11-2)\n- When: Wednesday, Jan. 1\n- Time: 2 p.m. PT\n- Where: Rose Bowl, Pasadena, California\n- TV channel: ESPN\n- Stream: You can watch this game live for FREE with Fubo (free trial) or by signing up for Sling (cheapest streaming plans, $25 off your first month). If you already have cable, you can also watch this game live on Watch ESPN with your cable or satellite provider login information.\n- Oregon Ducks football 2024 season schedule, scores\n- Sign up for The Ducks Beat newsletter\n• • •\nThe seeds of Mariota and Gabriel’s friendship actually started from an unexpected source: Their mothers.\nDori Gabriel and Alana Deppe-Mariota had known each other casually for several years, meeting after a mutual friend connected them. The friend knew Gabriel was about to leave the island to play football at Central Florida and she thought Alana — who had seen it all during Mariota’s time at Oregon — would be a valuable resource for Dori.\nThey chatted briefly about recruiting, the challenges of moving their sons across the world and life for teenagers away from the island. Gabriel went on to star at UCF and Oklahoma, distinguishing himself as a dual-threat force, humble leader and prolific college quarterback. Mariota continued to navigate the NFL and build a family.\nThen last year, when Alana heard that Gabriel was looking to transfer from Oklahoma — and Oregon was a possible destination — she reached out to Dori, offering her thoughts on Mariota’s experience, the campus and Eugene in an impromptu hourlong phone conversation.\n“She raved about the program and said it was a place where you could accomplish amazing things,” Dori said. “She talked about the culture and the vibe of Eugene. Being island people and raising our kids a certain way, that was very important for me. Dillon needed to be somewhere that would help him unlock his potential, not just as football player, but as a human being.”\nIt’s indicative of how things work on Oahu.\nDori jokes that her island is divided by two degrees of separation: If you don’t know someone, you probably know someone who does. That familiarity, combined with the aloha spirit and the makeup of a community that features a “melting pot” of different cultures, has created a vibe unlike anywhere else.\n“Island people are just a little different,” Dori said. “We lead with our hearts. We’re not afraid to understand people’s life perspectives. When you grow up on the island, there is a high level of accountability to your name and how you present yourself. You never want to shame your name. And you’re always looking to help other people.”\nIn the months since that hourlong chat last year, Alana has become a comforting ally for Dori, texting weekly words of encouragement and reaching out to lend an empathetic ear. They are part of an exclusive club of women who know what it’s like to have a Hawaiian-born son play quarterback for the Ducks, earn Heisman Trophy buzz and guide the team to the cusp of a national championship.\n“She has been a great confidant for me to bounce things off of,” Dori said.\n• • •\nIt was at a garage sale, before Gabriel blossomed into a star at Mililani High School, when Dori Gabriel grasped the depths of her son’s gracious spirit.\nAs she scoured the sale, rummaging through trinkets and someone else’s old treasures, Gabriel blurted out a surprise.\n“Hey mom, I need $10,” he said.\nShe looked up, eyeballed her son holding a pair of size 10 football cleats, and raised an eyebrow. He did not wear size 10 shoes. And even if he did, Gabriel already owned football cleats.\n“What do you need it for?” she asked.\n“I’m going to buy these cleats,” Gabriel replied. “I want to give them to someone on the team. He doesn’t have any.”\nGabriel’s generosity has only increased as his star has risen.\nTwo years after he left Oahu for UCF, Gabriel donated new shoes to the Mililani boys basketball team, which ignited years of giving to his former school, as if he was back at that garage sale.\nHe reached out to a local distributor to forge a relationship with Nike, using his college football success as a means to make Mililani a Nike school. And, when college athletes were finally given a chance to make money off their name, image and likeness, Gabriel cashed in — and not just for himself.\nHe’s used his notoriety to solicit sponsorships from companies to fund his charitable projects at Mililani. More than once, when a company has approached Gabriel with an NIL opportunity, he has asked that they fund his cause rather than his personal bank account.\nIn the four years since he donated those basketball shoes, Gabriel has helped a surplus of Mililani teams score new gear, including boys and girls basketball, volleyball, softball, boys and girls soccer and, of course, football. His giving reached its apex earlier this year, when he held a benefit dubbed “I’m Inspired” at Mililani.\nThe event, which included a donors dinner, free concert, photo booth, free food and games, culminated in the unveiling of new uniforms and equipment for the football team. Thanks to donations from brands like Nike, Riddell, EvoShield and VICIS — which donated 60 state-of-the-art helmets to the team — the Trojans were outfitted with new home and away uniforms, shoulder pads, helmets and other gear.\nGabriel raised $250,000 for the event, luring donations from Fortune 500 companies, local businesses and anyone else who would help. Even professional boxer Manny Pacquiao wrote a $5,000 check.\n“I represent more than myself and my family and Oregon,” Gabriel said. “It’s also Hawaii. I don’t take that lightly.”\nThe next phase of Gabriel’s philanthropy is upgrading the school’s training and weight rooms, which he hopes to do in stages over the next two years. It’s no wonder that, during the event, the mayor proclaimed that May 3, 2024, would forever be known as Dillon Gabriel Day in Mililani.\nFor a kid who was born in his house, not all that far from the ceremony, it was a memorable moment. It was also a full-circle moment, evoking memories of a day Gabriel once spent with his hero and future friend, Mariota.\nWhen Gabriel was in elementary school, Mariota once visited as a celebrity volunteer for Jump Rope for Heart, an event designed to raise money and awareness for heart disease. Mariota spent an afternoon playing with kids, posing for pictures and signing T-shirts. One of the shirts belonged to Gabriel, and Dori says there’s a photo of the pair tucked away somewhere in the Gabriel house, offering a reminder that Mariota has inspired her son in ways that cannot be measured on a football field.\n“Marcus is such a selfless person and he has always been an inspiration to him,” Dori said. “What Marcus was able to accomplish really showed Dillon that anything was possible.”\nAdded Rob York, Gabriel’s high school football coach: “The saying goes: 808 all day. We always help each other, cheer for each another. Guys like Mariota helped set the stage for guys like Dillon. He was humble even through all the adversity he’s been through. He’s been a great role model for everyone. And Dillon saw that. Dillon was inspired by that. If you didn’t know he was a football player and if you were to take away all the football accolades, you would just think he’s a great guy. He doesn’t act like he’s a Heisman finalist or playing on the No. 1 team in the nation. He doesn’t act entitled. He’s just so humble and so kind. He’s the same dude he was in high school and youth football.\n“I hope Mariota becomes governor one day. He could if he wanted to. The guy is that amazing. And Dillon is just like Mariota in his attitude and perspective. He’s always positive, always giving back. He values the importance of representing the islands and Ohana.”\nIt’s been one year since Gabriel stood in that equipment room at Oregon and texted his idol for permission to wear Oregon’s famed No. 8.\nAnd while the conversation was one that Gabriel will never forget, it was pretty special for Mariota, too.\n“It’s surreal for me, because it’s such a compliment to hear someone say they wear a number because of you,” Mariota said. “It’s truly an honor. And it’s been fun for me to watch. It’s been a bit nostalgic seeing the No. 8 in Autzen and it’s been exciting to see Dillon have such a successful season.”\n-- Joe Freeman covers the Oregon Ducks. Reach him at 503-294-5183 or @BlazerFreeman. Listen to the Ducks Confidential podcast or subscribe to the Ducks Roundup newsletter.",
  "word_count": 1970,
  "scraped_at": "2026-02-14T13:16:22.220932"
}