{
  "article_id": "db635fe032eb",
  "url": "https://www.bbc.com/sport/cricket/articles/c3rj45ylez9o",
  "title": "Women World Cup 2025 : Have England improved under Charlotte Edwards ? ",
  "date": "20251030T033000Z",
  "domain": "bbc.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Same old story or have England improved under Edwards?\n- Published\nOn the surface, England's World Cup exit at the semi-final stage is the same old story.\nRelatively smooth sailing through the group stage, resulting in an increase in confidence, only for it to fall apart under pressure once more.\nWe've been here before: Birmingham 2022, Cape Town 2023, Dubai 2024, Australia 2025.\nSouth Africa's glory in Guwahati can be added to the list, but it will need an asterisk next to it.\nEngland were outplayed rather than buckling under the pressure - the headline act being Laura Wolvaardt's staggeringly brilliant 169 from 143 balls, a captain's innings of class that we will be gushing over for years to come.\nIt was chanceless, and though England were guilty of bowling too wide in the powerplay to allow her a flying start, Wolvaardt never faltered, even when the bowlers improved and tightened their grip.\nInstead, the Proteas skipper settled in and made sure she was there at the end to help her side pummel 117 runs in the final 10 overs against a weary attack wilting in the hostile humidity.\nIt was a masterclass with echoes of Alyssa Healy's 170 in Christchurch four years ago. This was Wolvaardt's day, and nobody was stopping her.\nWas this result really a surprise?\nCharlotte Edwards has been England's head coach for six months, and she inherited a team drained of confidence after the 16-0 Ashes drubbing.\nIt was never going to be a quick fix, as she admitted after the game while cutting a despondent figure in her media duties.\nWas Edwards scrambling for excuses when faced with television, radio and written journalists moments after the biggest disappointment of her short tenure?\nAbsolutely not - she was more than willing to display her disappointment. In fact, she was keen to let the sinking feeling she felt sit uneasily with her players too.\n\"I haven't spoken to the players, I'm keeping away from them at the moment,\" she said.\nBut while there are caveats to England's general direction, this particular game was another example of a sub-par performance in a crunch situation, and in a match where many had them as clear favourites.\nThey had beaten South Africa in their tournament opener by skittling the Proteas for 69, and have an exceptional record against them in ODIs - it was 36-10 in England's favour before this, including two semi-final wins at the two previous World Cups.\nEngland came into the game confident after thrashing New Zealand, while their opponents had been bowled out for 97 by Australia.\nIt was set up for them nicely, even more so when they won the toss and got the chance to try to pick at raw South African batting wounds by bowling first.\nStill, even considering all of that, perhaps the biggest disappointment is the result - and convincing margin of defeat - did not come as a surprise.\nWas England's World Cup a success?\nEdwards said before the tournament the semi-finals were her minimum expectation, so by that metric it is a tick in her box.\nBut, ultimately, finishing second in the group-stage table flattered England.\nThey lurched from the brilliant to the baffling. The aforementioned demolition of South Africa was followed by the stuttering win over Bangladesh, largely thanks to rain and DRS.\nRain again spared their blushes against Pakistan, the worst team in the tournament, before they impressively edged a closely-fought tie against hosts India.\nThe bubble was popped soon after though, when Australia waltzed to another crushing win.\nThroughout, the same trend has unfolded - their bowling, particularly the spinners, has been excellent but their batting has been horribly exposed.\nThey were 78-5 and 78-7 against Bangladesh and Pakistan respectively, with an edgy win and a washout papering over concerning cracks.\nThe dependency on Heather Knight and Sciver-Brunt remains, with added concerns around the batting depth coming through the ranks to challenge them.\nIt is most likely this will be the last 50-over World Cup for Knight, Sciver-Brunt, Amy Jones and Tammy Beaumont. Who are the names knocking down the door to replace them?\nHaving been on the receiving end of Wolvaardt's onslaught, it was understandable for the batters' minds to be a little frazzled.\nThere was some sympathy for Jones, having kept wicket in the heat for 50 overs and now tasked with chasing a record 320 - only to get a beautiful nip-backer from the warrior-like Marizanne Kapp second ball.\nBut England, don't forget, chose to bowl first.\nKnight and Beaumont flirted outside the off stump, Sciver-Brunt gave some hope with a fluent 64 but the game went with her, and therein lies the gulf between England and the best.\nHad Australia been in that position, they would still have been favourites to win.\nHowever, it is also a fair argument that South Africa are similarly dependent on their big players.\nThe difference is theirs stood up when the team needed them.\nHas Edwards improved England?\nIt is a tough ask for a coach to put the pieces of a scarred team back together and take them to a 50-over World Cup in India as a first major assignment.\nEngland have won 14 of their 21 completed matches under Edwards, which started with the thumping of a weak West Indies side before a 2-1 series defeat by India.\nA key area where England needed to improve was their fielding and athleticism, which has been notably different. They ended the group stage with the best catch percentage after some sloppy performances in the field against India in the home summer.\nLinsey Smith has been a revelation as an Edwards pick, despite a poor semi-final. The spinner finished with 12 wickets overall and seven in the powerplay where she benefited from a clear role and a simple gameplan of keeping the stumps in play.\nAlice Capsey is another who looks a different player, helped by having a clear purpose in the middle order.\nContrastingly, the experiment with Emma Lamb, picked on domestic form as an opener but asked to bat at number six, did not work as she managed 36 runs in five innings, while Sophia Dunkley also looked out of sorts with 68 from six knocks.\nEdwards has mostly been working with the same group of players from that Ashes series, and while it was always unlikely she would immediately turn them into world-beaters, it was also probably the only squad she could have picked considering the difficulty of the task at hand and the lack of alternatives.\nThere was little expectation for England to win this World Cup and Edwards had called for people to \"judge next summer\" in the aftermath of the home T20 series defeat by India.\nThis missed opportunity might be easier to accept than the rest, but next year - with a home T20 World Cup on home soil - it will not be.\nThe English public has been spoiled by women's sport in recent summers, with football's Lionesses and rugby's Red Roses igniting a feelgood spirit which may inspire a generation.\nCricket has its opportunity in less than a year's time. England cannot afford to let it slip away again.\nRelated topics\n- Published16 August 2025",
  "word_count": 1208,
  "scraped_at": "2026-02-14T13:06:51.088474"
}