{
  "article_id": "db901f71983c",
  "url": "https://www.mpnews.com.au/2023/04/17/derby-delight-for-strikers-aspy/",
  "title": "Derby delight for Strikers , Aspy",
  "date": "20230417T053000Z",
  "domain": "mpnews.com.au",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "SOCCER\nPENINSULA Strikers and Aspendale were last weekend’s big derby winners while Baxter and Somerville Eagles had to settle for a share of the spoils at Baxter Park.\nStrikers overcame the send-off of Huss Chehimi in the 28th minute to emerge 1-0 winners over neighbour Frankston Pines at Monterey Reserve on Friday night.\nChehimi reacted to a late Aaran Currie challenge and was shown a straight red for violent conduct.\nNine minutes later the 10 men went in front.\nPines keeper Colby Jones slipped and his attempted clearance was won by Campbell Steedman who teed it up with one touch then sent a stunning left-foot volley past a helpless Jones.\nSteedman’s pace and guile troubled Pines throughout this contest.\nHe should have iced the outcome early in the second half but skied his shot and teammate Nathan Tsimis emulated him shortly after.\nEven though Pines lack a cutting edge they still fashioned chances but Strikers keeper Nathan Brown made some superb reaction saves.\nPines best chance fell to substitute Antonio Marcuccio in the 75th minute.\nJoey O’Connor played him in and although Marcuccio successfully lobbed the advancing Brown defender Andy McIntyre had tracked back and was able to head out for a corner.\nWith time running out for the home side Jones charged forward to attack a set piece only for Strikers to break quickly but substitute Cassius Delaney shot wide from distance with the unguarded goal at his mercy.\nAspendale moved into second in State 5 South with a 2-1 win over Mentone at Jack Grut Reserve on Saturday.\nKeiran Hughes put the home side ahead two minutes before the interval after a quick break sent him through into a one-on-one with Mentone keeper Daniel Goy.\nMentone hit back in the 61st minute through Dean Gerszonovicz but three minutes later a quick passing exchange between Jack Runciman and Taylan Yildirim set up Hughes who steered his shot into the bottom right corner for the winner.\nBaxter and Somerville drew 2-2 on Saturday in a seesawing contest that saw the visitors to Baxter Park finish with 10 men after Ronnie Krishnan’s second caution in the 71st minute.\nSomerville broke through four minutes into the second half when Conor McFall caught Baxter defenders on the hop rolling his free kick to Tom Simmons on the right of the area.\nTwo defenders charged towards Simmons who neatly cut inside them as they slid to the deck then he struck a low left-foot shot that deflected past Baxter keeper Jarrod Nardino.\nBaxter hit back in the 61st minute when Somerville failed to clear following a corner and central defender Danial Taylor spun and thumped the loose ball low past Nick Bucello to make it 1-1.\nKrishnan’s dismissal should have given the home side a decided edge but Somerville substitute Xavier Apela had other ideas.\nIn the 79th minute he broke into a one-on-one with Taylor and cut inside the big defender who chose to go to ground then Apela smacked a superb strike past Nardino and inside the far post to make it 2-1.\nIt looked like the visitors would hang on until the 85th minute when Baxter fashioned a fine move down the left with Brodie Jones playing the ball to Keegan Myatt.\nThe winger played it inside to captain Aleks Dukic and he curled a precise shot into the far corner to split the points.\nWhile Somerville will be satisfied with its start to the season and sits in third place Baxter is yet to win and is now second bottom.\nHowever help is on the way in the form of strikers Liam Baxter and Dylan Murchie.\nBaxter is set to return from Scotland this week while Murchie’s visa situation is expected to be resolved shortly allowing him to return from South Africa.\nIn NPL2 Langwarrin had one of its best wins of the season when it beat league leader Western United 1-0 at Lawton Park on Saturday.\nBoth sides spurned great chances in the opening minutes.\nWestern broke quickly in the 5th minute with Noah Holmes sending Abel Walatee down the right and his cutback presented Josh Divin with a tap-in only for the ball to slew off his boot and go wide.\nThree minutes later Josh Varga picked out Brad Blumenthal at the far post and his header back across goal was headed straight at Western keeper Lucas Trenkovski by Langy striker Archie Macphee.\nThe goal that was to decide this contest came in the 34th minute and it was a cracker.\nTrenkovski overplayed his sweeper’s role coming way out of the penalty area to near his left touchline then slid in and knocked the ball out.\nTommy Youngs took the throw-in quickly the ball falling to Macphee and from outside the area he unleashed a curling left-foot strike over Trenkovski and into the top far corner.\nBut the Western keeper’s day went from bad to worse a couple of minutes before half-time after Blumenthal clattered into him in mid-air forcing Trankovski to be stretchered off.\nWestern couldn’t break down Langwarrin in the second half.\nTeenage goalkeeper Nathan Lynders was deputising for James Burgess who was unavailable and Lynders had a fine game later being named by Langy as player of the match.\nIn State 1 Mornington had its biggest away win in two years when it thrashed Old Scotch 5-0 last weekend.\nTwo goals in the onslaught stood out – second-half strikes from 19-year-old Brady Pollard and Adam Hester.\nPollard hammered the ball into the top corner from outside the area while Hester beat two opponents cutting in from the right before hitting a curling left foot strike that transfixed Old Scotch keeper Hugh-James Thomas.\nOther scorers were David Stirton, Rhys Craigie and Rory Currie.\nTeenage central defender Casey Dudley made his senior debut for the Seagulls and is held in high regard at Dallas Brooks Park.\nThe result takes Mornington into fourth one point behind the three joint leaders.\nIn State 2 Skye United salvaged a point at home against Hampton East Brighton on Saturday in a 1-1 draw.\nBrighton went ahead in the 54th minute when skipper Marco Francese headed home from a corner. However Skye captain Marcus Collier returned serve in the 85th minute when his header hit the target following a Mark O’Connor corner.\nIn State 4 Chelsea lost 5-2 at home to Sandown Lions on Friday night.\nCarlo Melino’s side had a mountain to climb after going down 3-0 in the first half.\nChelsea’s second half goals came from a Marshall Dobson volley and an Adrian Pace header.\nThe big news at Chelsea is that experienced striker Piers Brelsford has come out of retirement and scored a hat-trick in the reserves while vice-captain Connor Scott is available again after an eight-week spell recovering from a calf injury.\nIn State 5 Rosebud lost its top-of-the-table clash with Hampton Park United 1-0 at Olympic Park on Saturday evening.\n“The referee was poor for both teams,” Rosebud head coach Paul Truman said.\n“He could not keep up with play and gave baffling decisions.\n“This is not sour grapes as we lost to the better side on the night.”\nMt Martha came from behind to win 2-1 away to Barton United on Saturday.\nMasih Yaghoubi put Barton ahead in the 64th minute but Ethan Sanderson outpaced the last defender and levelled six minutes later.\nSanderson turned provider in the 84th minute with a pass to 18-year-old Eli Masterson who beat three players inside the area before scoring his first senior goal.\nSeaford United went down 4-3 away to Casey Panthers on Saturday evening.\nCorio Osorio from the penalty spot, Josh Vega and Callum Norton scored for Seaford.\nIn Australia Cup news Skye United is the only local club remaining in the national competition after Langwarrin lost 2-0 to Brandon Park last week.\nLangwarrin fielded an under-21 side at Lawton Park against an opponent three divisions lower but goals from Reece Robic in the first half and Masee Namdar in the second sealed the NPL2 side’s fate.\nLangy’s Nicholas Corbett was sent off in the 84th minute.\nSkye’s fifth round cup opponent is State 1 North-West outfit Yarraville and they will meet on Tuesday 9 May at Skye Recreation Reserve at 7.30pm.\nMeanwhile fixtures for the women’s State Leagues were released last week.\nThe highlights of the first round of league action are the derbies featuring Baxter against Mentone at Baxter Park on Sunday at 1.15pm and the clash between Frankston Pines and Seaford United at Monterey Reserve at 7.45pm on Monday 24 April.\nNEXT WEEK’S GAMES\nFriday 21 April, 8.30pm:\nSpringvale White Eagles v Mornington, Serbian Sports Centre\nFC Noble Hurricanes v Chelsea, Alex Nelson Reserve\nSaturday 22 April, 3pm:\nManningham Utd Blues v Langwarrin, Pettys Reserve\nFrankston Pines v Mooroolbark, Monterey Reserve\nSkye Utd v Mazenod, Skye Recreation Reserve\nBaxter v Endeavour Utd, Baxter Park\nSomerville Eagles v Keysborough, Tyabb Central Reserve\nMount Martha v Mount Eliza, Civic Reserve\nBarton Utd v Rosebud, Barton Recreation Reserve\nBunyip District v Mentone, Heatherbrae Recreation Reserve\nHampton Park Utd v Seaford Utd, KM Reedy Reserve\nSaturday 22 April 6pm:\nCasey Panthers v Aspendale, Prospect Hill Reserve\nSunday 23 April 3pm:\nPeninsula Strikers v North Caulfield, Centenary Park\nFirst published in the Mornington News – 18 April 2023",
  "word_count": 1548,
  "scraped_at": "2026-02-14T12:15:16.466129"
}