{
  "article_id": "db98984e83fd",
  "url": "https://www.90min.com/emma-hayes-warns-chelsea-perfect-overcome-barcelona-reach-champions-league-final",
  "title": "Emma Hayes warns Chelsea must be  perfect  to overcome Barcelona & reach Champions League final",
  "date": "20240426T223000Z",
  "domain": "90min.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Emma Hayes warns Chelsea must be 'perfect' to overcome Barcelona & reach Champions League final\n- Chelsea hold a one-goal lead over opponents Barcelona heading into the second leg of their semi-final clash\n- Barcelona suffered their first home defeat in five years last weekend against Chelsea\n- Emma Hayes has outlined what her side must do to overcome the Catalan giants a second time\nChelsea boss Emma Hayes has warned her side must be \"perfect\" if they're to get the better of Barcelona for a second time in the space of a week and progress to the Champions League final.\nErin Cuthbert scored the only goal of the game in the first leg in Spain last Saturday as Barcelona suffered their first defeat on home turf in five years. It was one of Hayes' best moments as Chelsea boss as her side put in a heroic defensive display, but the manager knows it's only half-time in the tie.\nThe London club know all too well how dangerous Saturday's opponents can be as Jonatan Giraldez's side have twice ended Chelsea's hunt for European glory in 2021 and 2023. Barcelona, the current holders of the competition, will be hoping to reach their fourth consecutive Champions League final but will need to be far more clinical in front of goal if they're to break a resilient Chelsea team down.\nHayes has also been boosted by the returns of defenders Millie Bright and Nathalie Bjorn to training. Maren Mjelde is also back in contention, giving Chelsea a major boost in squad depth heading into the second leg.\nSpeaking to the media ahead of Saturday’s clash at Stamford Bridge, Hayes outlined what her side must do if they’re to reach the final in Bilbao.\n\"No matter what they throw at us, whether it's bringing a false nine lower, overloading the right hand side, drawing us out of position, Barcelona can hurt you in so many different ways,\" the Chelsea boss said.\n\"For us, as a team, we have to be so mindful that you can't switch off for one second. This is a game that's played in the head, first and foremost. We know we have to be perfect to be able to progress.\"\nBarcelona were in league action midweek as they extended their lead at the top of Liga F to 12 points with a 4-2 win over Levante Las Planas. However, Giraldez was able to rest a number of key players, including Ballon d’Or winner Aitana Bonmati, ensuring his squad is fresh for Saturday’s clash.\nChelsea, on the other hand, had a clear midweek and ample time to prepare for the second leg, with their next league game against Liverpool taking place on Wednesday. They'll be hoping to reach their second ever Champions League final and take a step closer to securing the one trophy that has always evaded them.\nPlenty rests on this game for Chelsea, not least because it could be Hayes' last European game in charge of the club. The manager will depart at the end of the season after more than a decade at Chelsea, but she played down the emotion of the tie, insisting it's just external noise.\n\"I don’t think about it emotionally,\" Hayes said. \"I'm with my football family and I like being in the trenches with them and, as always, I look forward to watching them play tomorrow.\n\"Our players play for the badge, they play for their family and they play for each other. I'm part of that. I'm in a team. It's not me, it's us.\n\"These players play at this football club to play in every game for Chelsea. Not just the one tomorrow.\"",
  "word_count": 613,
  "scraped_at": "2026-02-14T12:52:31.678155"
}