{
  "article_id": "dbe342aa7331",
  "url": "https://www.leicestermercury.co.uk/news/leicester-news/bhim-kohlis-killers-teenagers-court-10619668",
  "title": "Bhim Kohli killers and other teenagers in court in 2025",
  "date": "20251224T050000Z",
  "domain": "leicestermercury.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Bhim Kohli's killers and other teenagers in court in 2025\nSome of the year's court stories involving youths\nThroughout 2025, there have been several crimes committed by teenagers in the courts. They ranged from driving offences to manslaughter, with the one of the highest profile cases of the year being the killing of pensioner Bhim Kohli by two youngsters.\nThe youths were aged 13 and 15 when they appeared at Leicester Crown Court accused of killing the 80-year-old dog walker in Franklin Park, Braunstone Town, in a case that generated national, as well as local, headlines.\nAnother teenager was locked up for killing a man at his home in Braunstone Frith. The boy, who was 16 at the time of the fatal stabbing, was convicted of manslaughter and sent to youth detention for 21 months.\nOthers convicted of crimes included sex attacker James Clarke, who was 19 when he attacked a woman, and a 16-year-old boy from Leicestershire who stabbed another 16-year-old in Portsmouth.\nBelow are many of the year's cases involving crimes committed by teens over the past 12 months\nUnnamed teens convicted of Bhim Kohli manslaughter\nA boy and a girl were convicted for the killing of pensioner Bhim Kohli in a case that was widely reported across the country. The 80-year-old had been taking his dog, Rocky, for his morning walk and was just minutes from his house when he was approached by the boy, who went on to slap him in the face with his shoe and beat him, causing fractured ribs and a broken neck.\nMr Kohli was still conscious when others arrived at the scene and he spoke about being racially abused and attacked by the boy, who had punched and kicked him. The boy was given a seven-year sentence in youth custody while the girl was given a three-year supervision order.\nThe girl - who encouraged the boy and filmed the attack - was 12 and the boy 14 when they were arrested days after the fatal attack in September 2024. Both defendants, who cannot be named because of their ages, were convicted of the manslaughter of the 80-year-old at Leicester Crown Court.\nUnnamed boy who stabbed Louis Howard to death\nA teenager who killed a man with a 'zombie knife' was locked up after admitting manslaughter.\nThe boy, who cannot be named due to his age, was 16 when he stabbed Louis Howard at his house in Braunstone Frith, Leicester, at about 10.30pm on Wednesday, April 9, 2025. Mr Howard, who was 35, had been let into the boy's family home and was trying to grab a phone from the boy's mother's pocket when he was fatally stabbed in the heart.\nThe 16-year-old was charged with murder and the trial took place at Leicester Crown Court, with the youth appearing alongside his mother and a neighbour, who later admitted one charge each of assisting an offender.\nBoth the boy's mother and her friend lied to the police to protect the boy, with the mother telling officers Mr Howard had arrived at the house with the knife in his chest, while the neighbour pretended she had not seen the boy after the stabbing when she had really given him a change of clothes.\nThe boy was sentenced to 21 months youth detention, his mother was jailed for 15 months and their neighbour was jailed for 21 months.\nJames Clarke\nA teenager sexually assaulted a woman in her 60s while she was sleeping. James Clarke was 19 when he attacked the woman at a property in Loughborough, leaving his victim \"shocked and confused\".\nThe victim \"pulled away\", before Clarke, of Station Street, Wigston, sexually assaulted her again. Officers from Leicestershire Police said the victim told Clarke to stop, and he complied.\nAt Leicester Crown Court in January 2025, Clarke was sentenced to 30 months in prison for the offence, which took place in October 2020. He had earlier been found guilty of two counts of sexual assault following a trial in November 2024.\nUnnamed Leicestershire teen who stabbed boy in Portsmouth\nA teenager from Leicestershire stabbed another boy in the street in Portsmouth town centre. The attacker, who cannot be named due to his age, admitted causing grievous bodily harm (GBH) with intent and possessing a blade in a public place. He was arrested shortly after the attack happened in the Hampshire town.\nHe was initially arrested on suspicion of attempting to murder the other boy, but his plea to the lesser charge of GBH was accepted by prosecutors during a hearing at Portsmouth Crown Court.\nThe boy was sentenced to two years and four months in a young offenders institution.\nBoy locked up for sex attacks when he was just 13\nA 'predatory' boy sexually assaulted two women while armed with a knife in Leicester. The child, who cannot be named because of his age, targeted multiple victims in the Newfoundpool area during a three-week crime spree which also included an attempted robbery and multiple other offences.\nLeicester Crown Court heard that in the first attack the boy followed behind a woman before pushing her to the ground while holding a knife to her face. He then sexually assaulted her.\nLater he attempted to rob a woman in Stephenson Drive while he was believed to be armed with a knife. He followed the victim onto a driveway before she managed to scream, causing him to run away.\nThe third attack took place in Rowan Street, where a woman became aware of someone following her. When she turned to confront the person, the boy, armed again with a knife, told her not to scream or he would kill her. He indecently exposed himself to her before sexually assaulting her. Disturbed by people leaving a nearby house, he ran off.\nThe boy, who was 13 at the time of the assaults, was sentenced to three years and six months at a Young Offender Institution.\nEmmanuel Afful\nA student was caught with a \"Rambo knife\" following a fight in Leicester. Emmanuel Afful was arrested after police were called to reports of multiple altercations at a student accommodation block.\nLeicestershire Police had been called to The Tannery in the city centre's Bath Lane to reports of two separate fights involving people in the block. Afful matched the description of one person who had supposedly been involved in the violence.\nAfful, 19, was searched by police who found the weapon, described as a \"small Rambo knife\", in a sheath in his pocket. He was arrested and pleaded guilty to possessing a blade in public.\nAfful was given a 12-month community order with 250 hours of unpaid work. He was also ordered to pay £40 court costs and a £114 victim surcharge.\nAbdurrahmaan Zanan\nA teenage biker reached speeds of 130mph during a police chase through Loughborough and down the M1. Uninsured Abdurrahmaan Zanan had a pillion passenger on his bike at the time of the high-speed pursuit.\nThe 19-year-old, who also only had a provisional licence for the 600c Honda bike, was spotted by police just after midnight on Tuesday, December 10, 2024, in Loughborough's Ashby Road.\nAfter being followed by police for some time, Zanan then sped up and broke the 40mph speed limit before the pursuit was authorised.\nProsecutor Sally Bedford told Leicester Magistrates' Court in January that Zanan, of Prospect Hill, Spinney Hills, Leicester, did not stop. She said: \"The bike didn't pull over and now it was a police pursuit. It went at least 80mph in Ashby Road, which has a 50mph limit, and went through a red traffic light approaching the roundabout at Junction 23.\"\nShe said the bike jumped another red light before joining the M1 motorway. Here, it reached speeds of 130mph, speeding past other traffic on the M1 while the police car continued to follow the bike.\nAt court, Zanan admitted dangerous driving and having no insurance or proper licence for the bike. Magistrates decided to adjourn sentencing until a pre-sentence report about Zanan could be completed. He was given an interim ban, forbidding him from driving any powered vehicles on public roads.\nChad Roberts-Richards\nBus passengers looked on in shock as a teenager broke another man's finger before he headbutted and kicked him following an argument that had started online. The fight at St Margaret's Bus Station in Leicester city centre was all captured on CCTV.\nThe incident happened when Chad Roberts-Richards attacked the man who had been standing close to him. The 19-year-old kicked the victim while he was down before a woman appeared to confront him and he walked away.\nMoments later the victim - who was not charged with any offence - picked up an A-board from outside a business and went towards Roberts-Richards before putting it down and walking away.\nRoberts-Richards, of Link Road, Anstey, pleaded guilty to assault occasioning actual bodily harm.\nTyler Masters\nA drink-driving teenager rolled his car onto its roof after travelling through a Leicestershire village. Several residents came to the scene of the crash which landed Tyler Masters in court.\nMasters had been travelling along Cambridge Road in Cosby, south of Leicester, when his Volkswagen Polo rolled onto its roof. Masters, 19, had a passenger in the car with him at the time, while the severity of the crash wrote off the Volkswagen Polo.\nCambridge Road residents had come out onto the pavement after the crash and pointed police in the direction of Masters, who failed a roadside breath test and was arrested at the scene. He was taken to a police station where he gave a reading of 45 microgrammes of alcohol per 100ml of breath - the legal limit is 35 microgrammes.\nMasters, of Leicester Road, Lutterworth, appeared before Leicester Magistrates' Court and pleaded guilty to drink-driving. He was fined £415 and ordered to pay £85 court costs and a £166 victim surcharge. He was banned from driving for 14 months.\nIsaiah Summerland\nA teenage driver led police on a 90mph chase through Leicester before crashing into a roundabout. Isaiah Summerland and his three passengers fled the scene in the wake of the collision.\nThe 18-year-old was driving his Volkswagen Golf through the Braunstone estate in Leicester in the early hours of the morning when it made off at \"excessive speed\" after police had seen it. A 10-minute pursuit followed before it ended in the collision.\nThe 18-year-old was arrested later that day and admitted being the driver of the VW.\nSummerland, of no fixed abode, pleaded guilty to dangerous driving. He was given a sentence of nine months, suspended for 12 months, with 10 days on programmes recommended by the Probation Service.\nHe was ordered to pay a £187 victim surcharge and banned from driving for 12 months. He won't be able to drive again until he has completed an extended re-test.\nBilly Smith\nPolice who stopped a teenager for riding a motorbike one-handed while on the phone discovered the bike was stolen and that he was banned from driving. Billy Smith, 18, was in Eyres Monsell, Leicester, riding an Aprilia Pegaso 660 that had been stolen from the owner's home two days earlier, when he was stopped.\nThe Leicestershire Police officers then went to conduct a search at his home address in Mallory Place, Northfields, Leicester, and found two packs of cocaine. At Leicester Magistrates' Court Smith pleaded guilty to riding a motorbike while using a phone, driving whilst disqualified, driving a motor vehicle that had been taken without the owner's consent and possessing a class A drug.\nThe magistrates heard from the Probation Service that Smith was already subject to a community order from a conviction before he turned 18, for which he had already been fined for breaching.\nThe magistrates gave Smith a 12-month community order that will run alongside his ongoing community order. He will have to spend 15 days on programmes nominated by the Probation Service.\nHe was also fined £80, ordered to pay a £114 victim surcharge and had his driving ban extended by a further six months, meaning he will not be able to drive until late April 2026.\nEwan Clarke\nA teenager out with friends for a birthday celebration got into a fight with them after drinking too much. When the police confronted Ewan Clarke, he threatened them.\nClarke was taken to a police station, where he kicked one police officer and used a homophobic slur towards another officer. Leicester Magistrates' Court heard that Clarke, 19, was involved in a fight in St George's Way, in Leicester city centre, on the night of Friday, October 18.\nProsecutor Tracy Lovejoy told the magistrates about the confrontation with the Leicestershire Police officers. She said: \"He became argumentative and started making threats and officers had to restrain him.\n\"The defendant was uncooperative and threatened the officer, saying he would 'bloody' him.\" She said Clarke then lunged towards the officer and was taken to the ground.\nAt Euston Street Police Station, he physically resisted the officers who were trying to get him to the custody desk, the court heard. And when he was taken to a cell, he kicked a male police constable in the chest.\nClarke, of Locke Avenue, Rushey Mead, Leicester, pleaded guilty to using threatening behaviour and a further charge of assault by beating at the police station, and to common assault for the incident in St George's Way.\nJake Aspinall\nA man suffered a broken spine after a teenage driver crashed into his car at a Leicestershire T-junction. The incident injured seven people and nearly killed one of Jake Aspinall's friends.\nAspinall was 17 at the time of the crash which saw his new Citroen C1 collide with the other car at Clawson Lane's junction with Waltham Lane, between the villages of Hose and Scalford, near Melton. Aspinall was travelling with three friends at the time, having only picked up the Citroen hours earlier.\nThe C1 collided with a car containing a married couple and their son. The severity of the impact caused the husband to suffer a broken spine and broken ribs, while one of Aspinall's friends who was a passenger in the car suffered a life-threatening injury that required open-heart surgery.\nAspinall himself was also badly hurt in the crash and suffered a brain injury, while another of his passengers was seriously injured. In all, seven people were injured in the incident.\nAspinall, who's since turned 18, of Whitelands in Cotgrave in Nottinghamshire, pleaded guilty to three counts of causing serious injury by careless or inconsiderate driving, relating to the other driver and two of his friends.\nEdward Seabrook\nA teenage driver going too fast around a blind bend smashed into a cyclist coming in the opposite way. Edward Seabrook had only passed his driving test 12 weeks before the collision, which left cyclist Peter Taylor with life-threatening injuries.\nMr Taylor, 66, was cycling along a narrow road at Saddington Reservoir, near Kibworth, with his wife cycling behind him when he was struck head-on by a black Volkswagen Polo being driven by Seabrook. Mr Taylor's wife feared he was dead after seeing her husband flying through the air and landing on the ground.\nSeabrook, who had only turned 18 the day before the crash in October 2023, had been on his way to a football match when the collision happened.\nSeabrook, of Springfield Crescent, Kibworth Beauchamp, pleaded guilty to causing serious injury by careless or inconsiderate driving and was given a 12-month community order with 180 hours of unpaid work. Seabrook was ordered to pay £85 court costs and a £114 victim surcharge.\nHe was banned from driving for 12 months and will have to take an extended retest before he can drive unsupervised and without L-plates.",
  "word_count": 2620,
  "scraped_at": "2026-02-14T12:12:52.404170"
}