{
  "article_id": "dbe9d1acfd08",
  "url": "https://azbigmedia.com/business/champions-of-change-finalists-philanthropic-business-leader-of-the-year/",
  "title": "Champions of Change finalists : Philanthropic business leader of the year",
  "date": "20240513T174500Z",
  "domain": "azbigmedia.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Each year, Az Business magazine, a publication of AZ Big Media, presents the Champions of Change Awards to recognize those dynamic innovators and trailblazers who are changing Arizona’s business landscape through leadership, visionary thinking and philanthropy. The Champions of Change Awards honor both individuals and organizations. The Champions of Change Awards will be held Thursday, May 16, 2024. Each day leading up to the event, we will preview one category of finalists. Today, meet the Champions of Change finalists for philanthropic business leader of the year.\nSponsors of the Champions of Change Awards include BOK Financial (impact sponsor), Habitat for Humanity Central Arizona (spotlight sponsor), Stearns Bank (step-and-repeat sponsor), Maricopa Corporate College at Maricopa Community Colleges (photo booth sponsor), Lerner & Rowe Gives Back (name tag sponsor), REDW Advisors and CPAs (floral sponsor) and Center for the Future of Arizona (dessert sponsor).\nTo learn more about the Champions of Change Awards, click here.\nPhilanthropic business leader of the year\nRiczer Desvaristes\nPresident and CEO of // HypaMark\nAs a dynamic innovator and trailblazer, Desvaristes has dedicated himself to reshaping the landscape of youth and high school sports, particularly in the realm of women’s sports and girls’ flag football, providing a platform for female athletes to showcase their talents.\nPhilip Francis\nPetSmart Charities\nA passionate philanthropist, Francis has been an exemplary board leader for the Sandra Day O’Connor Institute for American Democracy. He was paramount in the board’s diversity initiatives and led the organization’s pursuit to honor Frederick Douglass at the Institute’s annual History Dinner in 2023.\nDoug Fulton\nCEO // Fulton Homes\nFulton continues to recognize the service and sacrifice of America’s heroes through programs designed to encourage patriotism and support the veteran community. “Supporting our military veterans (through Fulton Homes’ Fly the Flag campaign) has always been a core value at Fulton Homes,” Fulton says.\nPhil Gallagher\nCEO // Avnet\nIn March, Gallagher received the Lee T. Hanley Community Leadership Award from the Arizona Diamondbacks Foundation for his philanthropic endeavors to assist Arizona charities and the community. This accolade acknowledges leaders in Arizona who revolutionize the “landscape of business and philanthropy.”\nJim Manley\nCEO // Manley Creative\nManley has a prominent role in organizations that drive awareness and business to the local arts community that include being chairman of the board at The Phoenix Theatre Company, where he currently oversees a $45 million expansion and support for The Phoenix Film Festival.\nDan Puente\nFounder and CEO // DP Electric\nEarlier this year, DP Electric announced its transition to 100% employee ownership. This signiﬁcant milestone marks a major advancement for the company, solidifying its dedication to providing opportunities for its employees and being a top place to work in Arizona.\nBrandon Rafi\nFounder // Rafi Law Group\nIn March, Brandon and Paige Rafi pledged a $500,000 gift to support the pediatric intensive care unit at the new Valleywise Health Medical Center, which will revolutionize the care provided by Valleywise Health with state-of-the-art facilities and technology specially designed for pediatric patients.\nKevin Rowe\nFounder // Lerner & Rowe Gives Back\nThrough Rowe’s leadership efforts, Lerner & Rowe Gives Back has raised and donated over $3.34 million. 100% of those funds were used to positively impact four community pillars of focus: youth programs, health and human services, animal welfare, and public safety.\nPresident // Sharpe & Associates\nSharpe serves as a board member for the Banner Health Foundation, where he is leading the effort to build a $3 million Play Zone at Diamond Children’s Medical Center. He is also a board member of the Jewish Philanthropies of Southern Arizona.\nStacey and Mike Steele\nThe Steele Family Foundation\nThe Steele Family Foundation has built the world’s first digitally driven social scholarship with a view to finding those seeking our help to develop their minds and talents to the next level through advancement in post-secondary education.",
  "word_count": 642,
  "scraped_at": "2026-02-14T13:39:48.597019"
}