{
  "article_id": "dbfa03bfb638",
  "url": "https://openthemagazine.com/cover-story/revolutionary-road-2/",
  "title": "Revolutionary Road - Open The Magazine",
  "date": "20230303T044500Z",
  "domain": "openthemagazine.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Last Updated:\nWomen’s cricket in India has come a long way since the 1930s. It is now ready to take another leap with WPL\nWHEN A SPORT BECOMES CENTRAL to national life and a sustained symbol of national unity, as it has been for women's cricket in recent times, its players are some of the most-written about and sought after women in the country. Mithali Raj or Harmanpreet Kaur are cases in point. A history of Indian women's cricket can only be complete with an appraisal of the cricketers, women who have been pivotal to the game's emergence as a kind of national obsession, one that drives millions to ecstasy and fury. When the national team wins a game, the euphoria of the fans skyrockets. When they lose, the world crumbles.\nSign up for Open Magazine's ad-free experience\nEnjoy uninterrupted access to premium content and insights.What is significant in this history of iconicity are the varying registers of stardom in colonial and post-colonial India, more so in the years following the 2017 World Cup final appearance and women cricket's commercial revolution. While the player was often applauded as 'performer' per se in immediate post-colonial India, and roughly till the early 2010s, the 2017 effort saw the rise of a stardom rooted in hyper-nationalist sentiment. Earlier, in the pre- 1980s period, for example, there are several examples of individual performances being lauded countrywide, even if India lost. These individual performances are as much part of Indian cricket lore as are the famous victories of recent times. It is interesting to note that some of the early icons, Diana Edulji, Shantha Rangaswamy, key to India's first Test victory in 1978, have hardly been given their due in conversations surrounding the sport in India.\nOpen Magazine Latest Edition is Out Now!\n06 Feb 2026 - Vol 04 | Issue 57\nThe performance state at its peak\nRead Now\nThe nationalist imagination around women's cricket has varied with changing socio-political and economic structures. In colonial India, the men's game generated patriotic or anti-colonial sentiments, even when cricketers distanced themselves from the nationalist movement and were often passive supporters of colonial rule. The women's game, not as popular, remained restricted to pockets of Maharashtra and Bengal with women playing in saris. Women spectators, however, were a feature of the Indian game from the 1890s, with elite women watching the game at Lord's when India played its first Test match in 1932. Contemporary magazines like Indian Cricket, published by the Cricket Club of India in the 1930s contain regular reportage on the women's game, including photographs and illustrations.\nIn colonial or immediate post-colonial India, till the 1970s, it did not seem to matter if the sides won or lost. Nationalism on the sporting field, as in the political arena under Mahatma Gandhi, Jawaharlal Nehru or Subhas Chandra Bose, was generated by men who in their persons held out the prospect of challenging the British. Thus, it did not matter to the cricket enthusiast if Vijay Merchant had fought all by himself in the 1936 series of England, a disastrous tour otherwise, or women just played for the sake of recreation in Mumbai and Pune. It was enough that they were Indians who captured the imagination of the West and put India on the world cricket map.\nAlso, with India leading the world in a team sport, hockey, winning all the Olympic golds between 1928 and 1956—and with football and hockey being equally, if not more, popular than cricket in large parts of the country—a victory in cricket often took a backseat. In post-colonial India, the nationalist imagination centring on the sport underwent a gradual transformation. With anti-colonial nationalism becoming redundant, it moved from patriotism to a very gradual commercialism in recent times. This may be ascribed to the game's successful monetisation, particularly after 2005 when India made the World Cup final and subsequently when the women's game came to be governed by the Board of Control for Cricket in India (BCCI) in 2006-7. The other key step in this regard was the introduction of central contracts for the women in 2015.\nWith the failure of economic planning and disillusionment with the nationalist project, the masses came to see in international sporting victories, both for men and women, the nation's assertion in the global arena. This explains why words like \"spectacle\" actually started to be associated with cricket matches.\nThe mass psyche was further shaped by failures in other team sports like hockey and football, central to nationalist sensibilities focused on sport in colonial India. Accordingly, individual performance was gradually outshouted by the clamour for national victory. Players came to be worshipped not for fantastic innings per se but for those performances that proved decisive. Harmanpreet Kaur's 171 or Jhulan Goswami's delivery against Meg Lanning in the World Cup semi-final against Australia in 2017 had reams of newsprint being dedicated to them.\nStars were made on the basis of match-winning play. Thus, a young Mithali Raj, a relative newcomer in 2000, became a star with her early heroics which included a record-breaking double hundred against England in 2002.\nThis was a match I had the privilege of following as a student in Oxford. Soon after Raj got to her double hundred, a few of us were swept by a sense of euphoria. It was a kind of \"yes, we can\" moment. By then, what mattered above all else was victory. India's failure to win the World Cup in 2005 under Raj was thus an opportunity lost. This is because we did not win a single medal at the Barcelona Olympics in 1992, a solitary bronze in Atlanta and Sydney in 1996 and 2000, and also suffered repeated drubbing in international football and hockey, explaining why cricket was seen as the only ray of hope. The public gradually became accustomed to leaning on the cricket teams, men and women, for they were the only ones considered safe to lean on. Finally, growing communal strife in the 1990s imposed on the cricketers the burden of representing their own communities and holding out before the nation a picture of unity amid diversity.\nThe single-most important factor in the congealing of a cricket culture was the opening up of the Indian economy in the 1990s, and the role of the new media. The opening of Indian skies as a result of the Supreme Court judgment of February 1995 saw the phenomenal influx of corporate finance into Indian cricket. While this wasn't so for the women's game till much later, it did make the contrast with the men's game stark. With names like Sachin Tendulkar and Sourav Ganguly promoting Pepsi and Coke, at a time when the average Indian was being drawn into the global economy, men's cricket became inseparable from brand names. Products the cricketers endorsed, though an indulgence for most Indians, became integral to the cricket enthusiast's participation in the game. Off the field, drinking a particular beverage became symbolic of participation in national triumphs. The 1996 World Cup, for example, is remembered as much for being an organisational success as for the war between the two cola giants, Pepsi and Coke. Losing out to Coke in the race for 'official drink', Pepsi flooded the country with billboards of a smiling Tendulkar announcing, \"There's nothing official about it.\" Indian players endorsing Pepsi were seen moving away from the Coca-Cola drinks trolley serving the teams on the ground for fear of being photographed with a rival beverage. Men cricketers, from simply glamour icons, became part of the entertainment economy.\nFor the women, however, this process had to wait 20 more years. Even after the 2005 World Cup final appearance, the economy of the game did not change. To quote Raj and Goswami: \"We had to travel in unreserved compartments sitting next to toilets even after playing a World Cup final.\"\nFor them, it was never about money. In fact, there was no money. It was all about playing for the country and making a mark. Coming from middle-class backgrounds, it was about choosing a career fraught with uncertainty. But that's what makes them pioneers in the true sense. Raj, an accomplished dancer, could have easily chosen a career in dance. She did not, to cricket's gain.\nIt can be argued that an assessment of a player's contribution to India's cricket history, both in immediate post-colonial India and in more recent times, cannot be done simply on the basis of runs scored or wickets taken. Although iconicity in early women's cricket was largely based on numbers, such performances became significant only in cases when leading cricketers like Edulji were able to influence the national imagination.\nThe first set of cricketers who stirred nationalist imagination were Diana Edulji, Shantha Rangaswamy and Shubhangi Kulkarni, and this explains the formation of the women's association in 1973. These players dominated first-class cricket in India till the late 1980s, as borne out by their performances in the limited number of international matches they played. Following in the footsteps of Edulji and Kulkarni were Anju Jain, Neetu David, Anjum Chopra, Mithali Raj and Jhulan Goswami.\nHowever, in the absence of developed newspaper coverage on the game, few knew about these icons in detail and even when the players were doing well they got little recognition in comparison to their men counterparts.\nAll this changed in 2017 when the team under Raj made the final. Let's sample this statement from her: \"When we left Mumbai to play in the World Cup there were hardly any journalists who had come to the airport to see us off. But when we returned to India on July 25 having made the final, there were close to a hundred journalists at 2.30AM. I was surprised to see so many journalists and the flashes just did not stop. This was something totally new. Since then, all of us have been flooded with interview requests and offers. We have been invited to events, have been felicitated and celebrated the country over. Today, people stop to recognise and greet us. I have been playing for India for 18 years and this had never happened before. So in that sense 2017 has made a huge difference to our sport.\"\nThe nationalist imagination around women's cricket has varied with changing socio-political and economic structures. In colonial India, the men's game generated patriotic or anti-colonial sentiments. The women's game, not as popular, remained restricted to pockets of Maharashtra and Bengal\nBarely a dozen journalists were present at the press conference where Mithali Raj had outlined her plans for what was to be the biggest tournament of her career before leaving for England in June 2017. On July 26, more than 60 journalists and cameramen flocked to the Grand Ballroom of the JW Marriot in Mumbai where Raj and her girls fronted the felicitation presser, less than three days after coming second-best to England in a closely contested World Cup final.\nThat's right: in the dead of night, the Mumbai airport was teeming with fans, junior cricketers, policemen and the media, who couldn't seem to get enough of the Indian team.\n\"Obviously, it's quite overwhelming to see such kind of reception. It's a first of its kind for all of us,\" Raj had said. \"I did face something similar [in terms of our performance in the final], not exactly similar but a little less in 2005. But then there was no BCCI. At that time, I was wondering had we been under BCCI, what kind of reaction we would have had or what kind of feedback we would have got back home. But today, I can actually feel it's such a huge thing. It's just the beginning of good times for women's cricket.\"\nEven when Jhulan Goswami landed in Kolkata the next day, there were no fewer than 50 journalists present at the airport. The team was awarded `50 lakh each by BCCI and other hefty monetary rewards and commendations were subsequently conferred on them by the state associations and the Indian Railways.\nThe build-up to the final on July 23, 2017 had started early in the morning. Queues of Indian fans began making their way into the stadium well in advance of the start of play—a sight so very common whenever India plays at Lord's. Only this time it wasn't Rohit Sharma, Virat Kohli and the boys. It was Raj, Goswami, Harmanpreet and 11 other women who had finally forced the Indian cricket fan in London and beyond to come to Lord's waving the Tricolour and hollering for the blue brigade. Back home, the build-up was no less momentous. All India Radio (AIR), in a rare gesture, had organised live commentary in multiple languages and the host broadcaster was showing the match across eight different channels. Not to be left behind the news channels, which play a key role in generating buzz, all of them had multiple shows right through the day. Suffice to say, it was the biggest news event in the country on that day.\nFurthermore, even when the team lost, the buzz did not diminish. From the prime minister down to other high-profile politicians, sporting stars and Bollywood celebrities, social media was a rage, celebrating the achievement of Raj and her team. The women's sport, it was apparent, was no longer an also-ran. The team had done enough to lift it out of oblivion and thrust it right at the centre of the public discourse. Each of the players, stars in her own right, has been celebrated since.\nThere were no television cameras in 1983 when Kapil Dev smashed that 175 against Zimbabwe and rescued India from the depths of despair. While the world missed out on seeing the heroics, for his teammates the knock had the effect of making them feel that a miracle was indeed possible. A dream that few dared to even think or speak about turned into a reality in the next two weeks. Prior to the 1983 World Cup triumph, India's victories, few and far between, were hardly accorded the recognition they merited. With 1983, it all changed.\nHarmanpreet Kaur's unbeaten innings of 171 against Australia in the semi-final in 2017, broadcast live across the world, had equal potential and more. Kaur was trending ahead of the newly elected president of India, Ram Nath Kovind, and had broken through as the emblem of a blue billion that dared to believe. Every six that came out of Kaur's bat was a statement in itself—pushing the need for more recognition and better pay, telling corporate honchos what this team was capable of, stating in unequivocal terms that BCCI needed to do more for women's cricket in the country and immediately. So what if the opposition had Meg Lanning and Ellyse Perry, Raj and her blue brigade were out there to seek immortality. The anger Kaur vented at 19-year-old Deepti Sharma for running slowly towards the non-striker's end was not so much because Kaur's 100th run was at stake but, as she later explained, due to the significance she attached to Deepti's wicket in the context of the game. Kaur, the vice captain, was aware of the enormity of the occasion. Her outburst was as much a testament to the currency she attached to every run that was to be scored or conceded in the match by India as it was an outpouring of the collective angst of Indian sportswomen who, for the longest time, have been discriminated against. The World Cup, for Kaur, Raj, Goswami and the other girls was an opportunity they couldn't afford to let go of. Even though they fell nine runs short of lifting the trophy, they had done enough to ask for equal treatment and demand what was their fair share.\nHarmanpreet's innings of 171 had done far more than just take India to the final of the World Cup. It had given the women's game a new identity it badly needed. More importantly, others who nurtured a silent ambition to be the next Kaur or Raj, but stopped short of saying so for familial and other pressures, found a new voice.\nOn July 23, 2017, 11 Indian girls stepped onto the hallowed turf at the Lord's cricket ground, knowing they were on the cusp of history. Rather, they were shaping history.\nHow best to explain to readers how difficult it was for these girls? I have to go back to the 1994 football World Cup or to the penalty shootout involving Argentina and Lionel Messi a few years earlier. In 1994, in front of a legion of Italian fans, Roberto Baggio stepped up to thunderous applause to take a key penalty. He had won hearts that tournament and was the big Italian superstar. Baggio, most felt, could never miss. He did. And so did Italy. Can Baggio ever come to terms with what had happened that instant as he took that shot? Does he replay it in his mind? It will be a huge surprise if he doesn't.\nAnd then there is Messi. The Argentine superstar has come close to achieving immortality numerous times in his career. He came close in 2014 against a raucous German side that had thumped Brazil 7:1 in the World Cup semi-final. Could he go past them and, once and for all, close out the comparison with Diego Maradona? Could he prove to the world that he was as good as the Argentinian legend? Unfortunately for Messi, he wasn't able to back then. The trauma was such that he had even contemplated retirement. While Raj and Goswami have gone away from the game knowing they were as close as one could possibly get, Harmanpreet, Deepti, Smriti Mandhana and Richa Ghosh will have more opportunities in future with the Women's Premier League (WPL) now a reality.\nMessi found redemption and immortality. Will the girls too, in the near future?\nWith WPL a reality, it is time to get behind the blue brigade. Not the Indian women's cricket team. Rather, the Indian team. Harmanpreet, the captain, led an Indian team out in South Africa and it yet again galvanised the nation and corporate India was forced to take notice. The women, lest we forget, are equal stakeholders in decision-making as the men.\nThere is indeed enough momentum for a revolution.",
  "word_count": 3046,
  "scraped_at": "2026-02-14T12:52:00.248305"
}