{
  "article_id": "dc052b957620",
  "url": "https://www.the42.ie/womens-super-league-6-6233467-Nov2023/",
  "title": "Liverpool captain Niamh Fahey makes WSL return after injury",
  "date": "20231126T204500Z",
  "domain": "the42.ie",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "LAST UPDATE | 26 Nov 2023\nLIVERPOOL CAPTAIN NIAMH Fahey made her first Women’s Super League appearance of the season as they cruised to a 4-0 win over Brighton.\nThe Republic of Ireland defender featured in the Continental Cup during the week after a calf injury had ruled her out for the last couple of months.\nFahey came off the bench in the 87th minute when the Reds were already leading 3-0. Her international teammate Leanne Kieran was also introduced as a second-half substitute and it was the Cavan native who notched an assist for Sophie Roman Haug to net Liverpool’s fourth in injury time.\nNeither of the Merseyside duo have been included by interim Ireland manager Eileen Gleeson in the squad for the final two Nations League games with Hungary and Northern Ireland.\nThe Girls in Green have already secured top spot in their League B campaign and will join up in Dublin tomorrow.\nPeamount United teenager Freya Healy will be among those Ireland players after the forward was called up to replace the injured Emily Healy.\nPeamount United attacker Freya Healy earns first WNT call-up for UEFA Nations League double header.\n— Ireland Football ⚽️🇮🇪 (@IrelandFootball) November 26, 2023\nEmily Whelan drops out due to injury.#COYGIG pic.twitter.com/CzL3lv901U\nMidfielder Megan Connolly is one player set to feature for Gleeson and the Bristol City star arrives into camp on the back of a 2-0 home defeat at the hands of Manchester United.\nSecond-half goals from Hinata Miyazawa and Nikita Parris kept United in third spot, one point clear of rivals Liverpool.\nArsenal are still in second after their 3-0 win over West Ham United kept both United and Liverpool at bay.\nKatie McCabe wore the captain’s armband and played just over an hour for the Gunners as England international Beth Mead netted her first WSL goals in over a year following a knee injury.\nShe struck a first-half brace on an afternoon when Irish pair Jess Ziu and Izzy Atkinson both made sub appearances for the Hammers.\nElsewhere, Chelsea made light work of Leicester City with a 5-2 win, inspired by a Lauren James double, while Manchester City host Tottenham Hotspur in the evening kick-off.",
  "word_count": 365,
  "scraped_at": "2026-02-14T12:22:14.509208"
}