{
  "article_id": "dc222ba42b81",
  "url": "https://observer.ug/lifestyle-entertainment/arsenal-fan-namirembe-bitamazire-puts-her-chalk-board-away-for-good/",
  "title": "Arsenal fan Namirembe Bitamazire puts her chalk board away for good",
  "date": "20260126T203000Z",
  "domain": "observer.ug",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "GERALDINE NAMIREMBE BITAMAZIRE, 84, quietly checked out a day before the general election, on January 14, typical of a woman who did not desire pomp or spotlights – just results-oriented work.\nRest in peace, Honourable. She was one of the longest-serving ministers of Education and Sports before she exited the sector in 2011. A former woman member of parliament for Mpigi, Bitamazire was an icon in education.\nShe never regretted retiring from active public service to happily enjoy valuable time with her children and grandchildren. In May 2024, she agreed to a Quick Talk interview with The Observer at her humble residence in Kansanga-Kiwafu Estate, where she lived for about 40 years.\nIn memory of the revered educationalist, we reproduce that conversation.\nIt is a pleasure meeting you, Honorable. Wow! You are looking good.\nI am glad to meet you. [As she ushers Quick Talk into the house where one of her grandchildren is watching cartoons on TV. She asks him to switch off the TV and exit the living room.] I love interacting with young people nowadays.\n[Quick Talk kneels to greet her…]\nNo, no, no, please stand up. I don’t believe in kneeling as a sign of respect for a visitor. I would only allow that for my biological children. Just give me a hug.\nYou must be having a good time with your grandkids now!\nOh, yes. I am attending to the second generation of grandchildren. Isn’t that a beautiful thing to thank God for?\nI have seven children [three girls and four boys] and more than 10 grandchildren.\nI contemplated doing this interview in Luganda. Should we proceed in English?\nMy dear, I have a whole Master’s degree. I am an educated and liberated woman. I am one of the founders of Uganda Martyr’s University, Nkozi.\nIt’s unlikely that I forgot the English language because I have been to 38 English-speaking countries. I read newspapers daily and I can’t forget English. After all, you will publish this work in English.\nDo you use English or Luganda with your grandchildren?\nUnfortunately, they don’t speak Luganda, because we mostly use English. As a Muganda woman, I feel guilty, sometimes, but I can’t do much about it.\nWhen I got married to my late husband, a Munyoro, it brought some confusion about the language to use at home. We settled for English as a language that binds us all.\nYour house is tidy… but it looks like you have no house help around.\nYou have a keen eye!\nTrue, I have no housemaid and I do my own chores. When I am expecting visitors, sometimes, I call my daughter to assist me. If I started sleeping and doing nothing, I would be weak yet my body needs to be active.\nYou still have the signature afro, though slightly shorter today…\nThat’s called branding. Some of us have gone through a lot of induction courses. I remember someone who told me to have a professional brand so that no one mistakes me for somebody else. I have largely lived a busy life and didn’t have the time to comb my hair and visit saloons.\nNo offense intended, but is it your natural hair or… a wig?\n[Laughs] It is a wig that resembles natural hair. It is my professional brand. I am not saying this in bad faith, but today, you find young people wearing all sorts of clothes and changing hair to different colours.\nWhat is that? How shall people identify you? Maybe, they are following trends…\nWhen I was in a teacher training college, we were encouraged to be smart and wear some high heels with not-so-long pointers. This means that when you are going to class, children hear you from a distance and get ready for lessons.\nA teacher will not waste the first minutes telling children to keep quiet because they will have heard you walk to the classroom. Children will confuse you for fellow students entering a classroom unnoticed. You don’t need to have many dresses, shirts and trousers. Have like three shirts or dresses but keep them clean.\nInteresting…\nDuring my time, even men with big beards were not allowed in classrooms. They would scare children. Male teachers needed a well-trimmed beard. By the way, I have never seen a photo of you with makeup or nail polish.\nI have never put makeup on my face or painted my nails; not even on my wedding day at Christ the King Church, Nakasero in 1971. I am a typical, proud village woman. My village must be one of the deepest in Butambala.\nBut there was hot-combing of hair\nNo…. those things came around the late 1960s or 70s.\nWhen you have so much work to do, and you have to paint your nails, how many times will you change your nails?\nThose are not my things, nedda! I am a rural woman. Although I have lived in the modern world, I found it unnecessary to change my looks.\n[Several years ago, Maama Miria Obote showed The Observer a photograph of her with Namirembe Bitamazire from their 1960s heydays, and Bitamazire was a stunningly beautiful young woman; no wonder, she never felt the need for makeup.]\nHow did you pull off your wedding day without makeup?\nOh, I looked so beautiful. I wore a very nice white bridal gown hired at Shs 150, smeared my body with Vaseline, and then went to church. My sister was the matron but she also had no makeup on.\nThey twisted my hair a bit but it didn’t take away my natural looks. The wedding reception was at Lugogo indoor stadium and we had fun. Today, I see young girls with artificial eyelashes, lipstick, etc. I have no problem with them, though. That’s modernity.\nAre you also particular with your dress code? Why not?\nIf you are going to Church, wear something that doesn’t fully display your curves to other congregants. Just simply be decent. When I was a head teacher during Amin’s regime at Tororo Girls School, he banned miniskirts.\nSo, I learned to wear dresses that lie between my feet and knees. I hate miniskirts, I don’t like half dresses. In my home, I wear my kitenge like you see and at weddings, I wear a nice dress that covers my shoulders. During my ministerial days, I used to wear suits to work. I would walk around and feel the smartness all over me.\nHave you tried trousers? [Raises eyebrows in shock]\nEh! Noooo. I have never worn trousers. I am a Muganda and village woman.\nBut you said you are a liberated woman?\nThat’s true. I am not conventional anymore. When women’s emancipation came, I was one of those women who spearheaded that movement. It was not about feminism but empowering women through education and other things. I walked away from the traditions of being a woman who sits on the floor.\nYou pride in being a Muganda. What attracted you to a man from Bunyoro?\nI studied with Baganda men at university, but some of us were disciplined, church-going young girls from [Trinity College] Nabbingo. We would even abuse men who approached us at the time.\nHowever, there’s a time when you don’t love someone because of their tribe but [for] other things. I chose a Munyoro and asked God to help the marriage work.\n[Yes, the marriage worked until God called her husband, Alphonse Bitamazire, home about six years ago].\nSo, Mr Bitamazire was your first cut?\n[With shy face and smile] Yes. For us at Nabbingo, life was about books, not boys. We would be thinking about Church, fasting, and sisters taught us how to walk like women of class.\n[She stands to demonstrate how a lady makes her first step with her toes, then follows it with the heel].\nYour husband got his ideal woman?\nExactly. He once told me that he was looking exactly for such a woman with my qualities. [Bitamazire pauses to introduce Quick Talk to her daughter, Clare Kabonesa, who doubles as her personal assistant. Kabonesa says social media has been unfair to the family with unfounded talks about her mother’s life.]\nPeople may think I walk on crutches but here I am, on my two feet. I can’t be out there to explain myself, but I am doing well [when Quick Talk met her, she had not left her home in two years].\nAre you on social media?\nNo. My children keep showing me those things online but I don’t follow any social sites. I have a smartphone strictly for calling and receiving calls.\nWhat type of music do you listen to?\nGospel Music. [She sings a chorus of her best song, Yesu Beera Nange, by Judith Babirye].\nI also like this other young pastor in Nansana, Wilson Bugembe. [She sings Katonda Y’abadde Mu Eno Ensonga, one of his hits]. I watch many others on TV every Sunday but those are my favourite.\nYou don’t follow our secular artistes?\n[She shakes her head.] During my youthful times, we used to call them Biduula. But, I have no problem with those artistes and the people who follow them.\nDo you attend any gospel concerts or outdoor events?\nUhmm, not at this age. Remember, whenever I have to go out, I must move with my daughter Clare. I can walk in my house, but if we’re out, she must be by my side to offer support.\nSometimes, my muscles twist a bit. I end up not going out because I don’t enjoy those things.\nHow about when you joined campus?\nWhile at Makerere University in the 1960s, I didn’t change much from my village life. Firstly, the student population was low. I remember around 1964, there were only 60 females on campus and we focused mainly on our education.\nMy father used to take me straight to Mary Stuart hall, lay my bed, and then go home. Unfortunately, my father died just after I’d completed at Makerere, while my mother followed him in 1994.\nDid you do the same for your children?\nI have always picked and dropped my children at school and university. For those who went to Makerere, it was a rule to have lunch with us at home on Sundays.\nYou are such a protective parent!\nOhhh… So much, to the extent that I still follow up on my children. I make a call to ask if they are back from work and at home.\nI have never heard a daughter- in-law complaining that my son went back home after 10pm. I visit their homes occasionally and I have not received those complaints. In my home, everyone must be home by 8pm, regardless of your age.\nHow do you spend your free time?\nI read a lot of books and newspapers, and clean my house, compound, and flower garden. When I was still very active, I would attend to my banana plantation in Bbunga.\nDo you follow sports?\nI like football and I am an Arsenal fan. My love for Arsenal led me to a photo moment with Arsenal’s greatest coach, Arsene Wenger during the 2010 World Cup hosted by South Africa.\nI also watched all the games in the 2022 World Cup in Qatar, even late at night.\nHow did you meet Wenger for a photo moment?\nWe slept at the same hotel. While chatting at the hotel, I introduced myself as part of Uganda’s delegation from the Ministry of Education and Sports. I quickly asked for a photo moment and he accepted.\nDo you think Arsenal is winning the trophy this [2024] season?\nHaaaa, the Premier League trophy is still a tricky one. When they started losing some crucial games, I got worried. But, we are now doing well and God willing, we shall see the future.\n[She makes a fist to celebrate Arsenal’s results.] Some of my children support Manchester United and they tease me whenever they win a game, and I laugh when they lose. Just imagine someone giving you a call just to say Man U won, yet they know I support Arsenal! Naye abaana abo?\nAny last word?\nThank you for coming through. You know, I fear interacting with journalists for more than 15 minutes, but I know you will do a good job.\nyudaya92@gmail.com",
  "word_count": 2054,
  "scraped_at": "2026-02-14T12:38:38.667583"
}