{
  "article_id": "dc44287b2cad",
  "url": "https://www.pasadenastarnews.com/2025/08/20/uscs-practices-at-coliseum-have-been-very-meaningful/",
  "title": "USC practices at Coliseum have been  very meaningful  – Pasadena Star News",
  "date": "20250821T074500Z",
  "domain": "pasadenastarnews.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "LOS ANGELES — The Spirit of Troy marching band, though inside Howard Jones practice field, could be heard across campus.\n“We have the best band in the universe,” cornerback Braylon Conley said.\nWednesday marked 10 days until USC football’s home opener against Missouri State and the final practice of fall training camp that was partially available to the media. The band performance provides a game day feel, and the off-site practices add to the anticipation for the players.\nUSC has held multiple practices off campus during fall training camp, which could prove beneficial to the team.\n“(It’s important) just to see the stadium, to know what stretch is going to be like,” defensive coordinator D’Anton Lynn told reporters after practice on Wednesday.\n“To get that feel, so you’re not in that stadium for the first time on game day. We’ll go through things like what’s it going to be like pregame? What’s halftime going to be like? What’s the locker room like? Just so on game day, there’s nothing new.”\nUSC went 4-2 at home last season and last finished unbeaten at home in 2022 while still playing in the Pac-12.\nThis season’s home opponents are Missouri State, Georgia Southern, Michigan State, Michigan, Northwestern, Iowa and UCLA. Michigan is the only one of those teams ranked in the AP Top 25 preseason poll, and will likely give USC its stiffest challenge out of the group.\nGetting dominant wins at home will be critical to boosting the Trojans’ playoff chances. But beyond that, honoring the Coliseum has become a theme this season.\nDirector of Sports Performance Trumain Carroll, who is in his first year with the team, told players that he wanted them to earn the right to run the steps and represent USC in the Coliseum because he sees it as “such a sacred place.”\n@haleymsawyer USC football head strength and conditioning coach Trumain Carroll explained why his players need to earn the right to run the stairs at the Coliseum. #ncaafootball #ncaa #football #bigtenfootball #sports #usc #uscfootball #collegefootball\n“Whether it is jam-packed with fans, or whether there’s not a single person sitting in the stands and we’re just in there scrimmaging, it has that vibe,” head coach Lincoln Riley said. “And this team’s talked a lot about protecting that, playing very well at home, having an appreciation for where we play and who we play for. Those practices have been very meaningful.”\nTransfer linebacker Ta’mere Robinson played a game in the Coliseum while at Penn State, but the redshirt sophomore is embracing his time at the venue as a Trojan.\n“Just going over there, just seeing the sighting, being on the field, getting the smell for the grass over there, just knowing what it’s going to be like on game day,” Robinson said.\n“I played in there last year when we played, but actually being on the team and being over there, and calling that my home stadium is amazing. It’s beautiful.”\nColiseum pays homage to running history\nThe Coliseum hosted nealry 500 runners for the Nike Victory Relay 2.0 two weeks before USC’s home opener against Missouri State. Run clubs from around Los Angeles converged and formed relay teams to try and collectively beat Joan Benoit Samuelson’s Olympic gold medal-winning marathon time, which she recorded at the Coliseum during the 1984 Summer Games.\n“It means a lot to us to go back to the finish line of where Joanie finished that 1984 race,” Ian Sheppard, head of marketing for Nike LA, said of the Coliseum.\n“And then to be able to hand that down to the next generation of runners and give them a forum to compete and run as a team, there’s no other place that we probably could do it. It’s just such an iconic piece of Legacy.”\nWomen’s first-place winners included Quick Track Club, Corona High School and FastHER and men’s first-place winners were Quick Track Club, Redondo Premiere Track Club and Good Vibes Track Club.",
  "word_count": 661,
  "scraped_at": "2026-02-14T13:22:54.865949"
}