{
  "article_id": "dc5e88d24845",
  "url": "https://statenews.com/article/2025/04/column-in-a-winter-of-promise-msu-was-good-but-not-good-enough",
  "title": "COLUMN : In a winter of promise , MSU was good but not good enough",
  "date": "20250417T184500Z",
  "domain": "statenews.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "The excited chants of \"Go Green, Go White\" have once again been silenced by defeat.\nIt began with MSU hockey’s collapse in the first round of the NCAA Tournament. In a tie game against Cornell late in the third period, one flick of the stick by the Big Red sent Spartan fans to their knees in a heartbreaking 4-3 loss — an upset for the ages, and one I hope to soon forget.\nThat loss was quickly followed by another, as MSU women’s basketball fell in the second round of the NCAA Tournament. The Spartans didn’t get the memo that upsets are possible, and what followed was an 83-49 bludgeoning at the hands of NC State.\nSoon after, MSU men’s basketball joined the defeat parade, collapsing in the Elite Eight. Facing the brilliance of Johni Broome and plagued by self-inflicted wounds, the Spartans limped back to East Lansing after an unsatisfying 70-64 loss to Auburn.\nWatching these three losses unfold, one question kept echoing in my head: is it okay to just be good — but not good enough?\nI thought long and hard about it. After days of pondering, I woke from a deep sleep with the answer clear in my mind — and rushed to my keyboard to type this very sentence: It is unacceptable to just be good.\nThat’s exactly where MSU athletics stands today. Not bad. Not great. Just good. And that’s the agonizing reality Spartan fans like myself have to endure.\nBecause it feels like MSU is so close — so close to that elusive national championship that would elevate the program from good to great, and finally satisfy millions of hopeful fans.\nOne of those fans is sustainable parks, recreation and tourism sophomore Brady Dillon. A lifelong Spartan supporter, Dillon believes a national title would be the ultimate reward.\n\"I’ve watched MSU sports with my family for as long as I can remember, and it would be so rewarding if they could finally bring home a national championship,\" Dillon said. \"After so many years of watching them get so close, especially in basketball, it would be great to finally see them jump the hump.\"\nDillon says the last time he watched a truly great MSU team was in 2013 with football and in 2019 with men’s basketball. Yet, despite how good those teams were, both fell short of winning it all.\nThe last time MSU won this grand prize (the national championship) in a major sport was in 2007. Before that was in 2000. Within this new bloodcurdling drought of the coveted national championship comes persistent competition, as MSU usually finds itself atop the top 25. And what are the results? Some meaningless bowl game or some not good enough March Madness run or some pitiful first round exit. Not being able to take home a national championship is what separates good from good enough.\nFor a university with thousands of alumni, millions of supporters and billions in resources, consistently falling short is a failure. Expectations are high, as they should be. With what MSU has, there’s no excuse for not winning a national championship in at least one major sport every few years.\nBut MSU just can’t seem to do it.\nMSU women’s basketball reached the national title game in 2005 and has made 14 NCAA Tournament appearances since. But with just 12 tournament wins to show for it, they’ve lingered in the \"good, not great\" tier ever since.\nMen’s basketball might feel like a national contender every year, but reality says otherwise. In the past 24 tournaments, the Spartans have earned 47 wins — impressive, but none leading to a championship. What do those 47 wins mean if they don’t produce a banner?\nMSU hockey has been a rollercoaster. Great in 2007 (national champs), disappointing throughout the 2010s (132–201–37), and now firmly back in the \"good\" zone — falling just short of the Frozen Four.\n\"With their history, the standard for men’s basketball should be constantly progressing in each NCAA tournament, with a few Final Fours and National Championships sprinkled in there,\" Dillon said. \"For hockey, with how they have been playing, I expect Frozen Fours to be the new trend. For women’s basketball, advancing into the Sweet 16 and beyond is also feasible. There is no reason why these teams can’t be national championship winning programs.\"\nIt’s the repeating reality of suffering from mediocre success. Whether it be a lack of manpower, substandard play when it matters the most or just some great Spartan curse that has shaken this athletic program, MSU is just good, and will remain this way until someone, or something, steps up and produces change.\n\"I don’t believe we’ve done a good enough job with recruiting,\" Dillon said. \"The SEC gets all the big guys, as does Michigan and Ohio State. Then there’s the lack of talent being produced in the professional leagues, which could push away the stars. Sure, there’s guys like Jaren Jackson Jr. and Kirk Cousins, but for being a top tier program, the pro talent isn’t where it should be. I also believe some of the recent scandals over the years have driven away some of the athletes, which would make sense.\"\nSupport student media!\nPlease consider donating to The State News and help fund the future of journalism.\nMy take? Dillon’s right. Being good enough starts with acquiring the talent to get there. And in today’s college sports landscape, the transfer portal offers more opportunity than ever to build quickly. With the size and resources MSU has, landing top-tier players shouldn’t be difficult.\nSo far, hockey has made some strides — adding St. Cloud State transfer Colin Ralph. But men’s and women’s basketball have been losing more than they’re gaining. That’s a problem.\nTo escape this cycle, MSU needs to be more aggressive — in the portal and in high school recruiting. Only then will \"not good enough\" stop being the program’s quiet, painful motto.\nUntil that change comes, one truth remains: MSU is good. But not good enough.\nDiscussion\nShare and discuss “COLUMN: In a winter of promise, MSU was good — but not good enough” on social media.",
  "word_count": 1028,
  "scraped_at": "2026-02-14T13:21:30.971757"
}