{
  "article_id": "dc7a4fa84603",
  "url": "https://www.thenationalnews.com/news/mena/2025/09/28/hamas-lost-contact-with-two-hostages/",
  "title": "Hamas armed wing calls on Israel to halt strikes in Gaza city after contact lost with two hostages",
  "date": "20250928T150000Z",
  "domain": "thenationalnews.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Hamas's armed wing on Sunday called on Israel to halt air strikes for 24 hours in part of Gaza city to reach hostages after contact with them was lost.\nAl Qassam Brigades said it had lost contact with two hostages, Omri Miran and Matan Angrest, “as a result of the brutal military operations and violent targeting” in the city's Al Sabra and Tal Al Hawa neighbourhoods over the past 48 hours.\n“The lives of the two prisoners are in real danger. The [Israeli] forces must immediately withdraw to the south of Street 8 and halt air raids for 24 hours, starting at 6pm today [Sunday], until an attempt is made to get the two prisoners out,” it said.\nEarlier in the day, Hamas said it had not received any new proposals from mediators for a ceasefire in Gaza, after US President Donald Trump said a deal was close to being clinched.\nThe Palestinian group said negotiations have been suspended since a failed assassination attempt on its leaders, in an Israeli strike on Qatar's capital, Doha, on September 9.\nHamas's statement came after Israeli media reported the group had agreed in principle to release all the hostages in return for hundreds of Palestinians held in prison and the gradual withdrawal of Israeli troops under Mr Trump's plan.\nIt expressed “readiness to consider any proposals it receives from the mediators positively and responsibly, while preserving the national rights of our people”. The US, Egypt and Qatar have been acting as go-betweens in peace talks.\nMr Trump met leaders and officials from Muslim-majority countries last week to discuss the situation in Gaza, which is under a mounting assault from US ally Israel. Gaza officials raised the death toll to 66,005 on Sunday.\nUS special envoy Steve Witkoff said Mr Trump presented proposals to those leaders that included a 21-point Middle East peace plan.\n“We're hopeful, and I might say even confident, that in the coming days we'll be able to announce some sort of breakthrough,” Mr Witkoff said during the UN General Assembly. The plan “addresses Israeli concerns, as well as the concerns of all the neighbours in the region”, he added.\nSources told The National that Mr Trump's plan includes a pledge that Israel will not annex the occupied West Bank and that it will freeze building new settlements there. Hamas leaders, meanwhile, would be allowed to leave Gaza and live in exile abroad.\nThe governments involved in the US-Arab meeting said they had “reiterated their commitment to co-operate with President Trump and stressed the importance of his leadership to end the war”.\n“Intense negotiations have been going on for four days and will continue for as long as necessary in order to get a successfully completed agreement. All of the countries within the region are involved,” Mr Trump wrote on Truth Social on Friday.\nMr Trump had promised a quick end to the war but a resolution remains elusive eight months into his term. Mr Trump's second presidency began with a two-month ceasefire between Israel and Hamas but that ended when Israeli strikes killed 400 Palestinians on March 18 in a resumption of hostilities.\n“Hamas is very much aware of these discussions and Israel has been informed at all levels,” Mr Trump wrote. He called the talks “inspired and productive”.\n“We want to get Gaza over,” he said on Thursday as he welcomed Turkish President Recep Tayyip Erdogan to the White House.\n“I had a great meeting with the leaders of that area, of that region, generally speaking, the Middle East, meeting the other day. I think we're close to getting some kind of a deal done.”\nMr Trump is due on Monday to meet Israeli Prime Minister Benjamin Netanyahu, who heads a hard-right governing coalition opposed to ending the Gaza war until Hamas is destroyed.",
  "word_count": 635,
  "scraped_at": "2026-02-14T12:13:22.491102"
}