{
  "article_id": "dc7eb534a938",
  "url": "https://www.rnz.co.nz/news/sport/520651/olympics-2024-morgan-left-out-of-us-football-squad",
  "title": "Olympics 2024 : Morgan left out of US football squad",
  "date": "20240626T201500Z",
  "domain": "rnz.co.nz",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Alex Morgan, one of the last links to the great US women's football team dynasty, was left out of the Paris US Olympic squad, likely signalling the end of her international career.\nIt will be the first time since the 2008 Olympics that forward Morgan will not suit up for the US in a major competition.\nRecovering from an ankle injury, the 34-year-old had been fighting for fitness but the twice World Cup winner has had limited playing time with her NWSL club the San Diego Wave and has no goals and just one assist from eight games.\n\"Today, I'm disappointed about not having the opportunity to represent my country on the Olympic stage,\" posted Morgan on social media. \"This will always be a tournament that is close to my heart and I take immense pride an time I put on the crest.\n\"In less than a month I look forward to supporting this team and cheering them on alongside the rest of our country.\"\nWith only 18 roster spots for the Olympics, coach Emma Hayes was forced to make some hard choices.\n\"It was a tough decision, especially considering Alex's history and record with this team, but I felt I wanted to go in another direction and selected other players,\" Hayes told reporters on a call.\nHayes, the highly successful Chelsea manager who has been charged with returning the four-time gold medallists to glory, said she needed an adaptable squad given the tight turnaround between games.\n\"I think it's a balanced roster,\" she said.\n\"I've considered all the factors that we're going to need throughout the Olympics and it's one that I'm really happy with.\"\nEven without Morgan, the US will not lack for experience with eight players back from the 2020 Tokyo Olympics where they won bronze.\nFamiliar names returning to the roster include veteran goalkeeper Alyssa Naeher, midfielder Lindsey Horan and forward Crystal Dunn.\nThe US head to Paris eager to move past their worst-ever World Cup campaign last year when they exited in the round of 16.\nThe US team will come together on 8 July to face Mexico in a friendly in New Jersey, and will take on Costa Rica on 16 July in Washington in their final Olympic tune-up.\nThe US open Group B play at the Games on 25 July against Zambia at Stade de Nice in Nice.\n- Reuters",
  "word_count": 397,
  "scraped_at": "2026-02-14T12:32:19.564507"
}