{
  "article_id": "dc7fa9da2986",
  "url": "https://www.arsenal.com/news/young-gun-sophie-harrison",
  "title": "Young Gun : Sophie Harrison",
  "date": "20241210T141500Z",
  "domain": "arsenal.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Follow our 2024/25 Young Gun series as we get to know the academy youngsters kicking off their careers at Sobha Realty Training Centre.\nSophie Harrison has been a key part of the success of our women's academy team in recent years. She spoke to us about adapting from midfielder to full back, winning the FA Youth Cup and her biggest inspirations in football.\nFor more features like this, subscribe to the Arsenal Women programme for 2024/25!\nI’ve been playing football from a very young age when my brothers and I were kicking a ball in the garden and competing with each other. That was what spurred me on to join a team as early as I could. There weren’t many girls’ teams locally so my mum got me into Oakley, a boys’ grassroots side and Flitwick, a Sunday league team, where I stayed until under-15 level.\nMy time in grassroots taught me a lot, particularly how to be physical and not take too long on the ball, because the boys would tackle you quickly. Physicality and speed are very important to my game so I’ve taken those attributes with me. Being the only girl on the team, lots of people doubted my ability at first, but I just showed them on the pitch what I could do. I wanted to prove the boys wrong and once the football got talking, they went pretty quiet.\n\"I’m trying to emulate Emily Fox, not just because she's in my position but also because she’s very attacking-minded like me\"\nThe coaches were always brilliant. They always believed in me and pushed me on to new heights and they’re also the people who first got me the trial at Arsenal. They reached out to the academy and set up a match between our boys’ team and the under-16s. I just tried to show off what I could do and later I got a phone call saying that Arsenal wanted me to come in for a trial. That turned into three training sessions and then I was told that I’d been accepted into the academy, which was an unbelievably good feeling.\nMaking the transition from grassroots to academy football was a really interesting one. At the start, it felt like I was thrown in at the deep end because I was surrounded by such technical and talented players but that only helped me grow as a footballer. Being in that set-up drives you on every single day. It’s been quite a steep learning curve but one that’s definitely helped me. It can be hard coming into an environment where lots of people have been there for years but everyone has been so lovely and welcoming.\nThe academy focuses a lot more on the technical aspects than we did at the grassroots level. At Arsenal, we have post-match analysis and for every game, there are tactical changes. One of the biggest learnings for me so far has been around the press: when to trigger it and who’s the right person to press at each moment. In training, we have very specific drills to help us against our specific opponents and I can feel the benefit that’s had on my overall game.\nOutside of Arsenal, I also received my first-ever England call-up in February this year which was a surreal experience. Making my international debut gave me that extra boost of confidence, because now I’ve broken through, I need to keep pushing to try and achieve the dreams I’ve had since I was a little child.\nSince joining the academy, I’ve also shifted my position. I'd always been quite a defensive central midfielder, so when they moved me to full back, I adapted quickly. Being a full-back allows me to combine my 1v1 defending with my attacking threat, so the transition was fairly easy in the end. On the pitch, I love sending crosses into the box and making sure they’re as accurate and varied as possible, so I think full-back suits my strengths more than centre mid did!\nThere are always things to learn, of course, and I’ve been working on my positional play, long balls over the top and making sure I win first contacts. Last season was my first full season in that position but I haven’t looked back since.\nGrowing up, Fran Kirby was a big inspiration. I even had posters of her on my wall. She’s such a technical player and will make passes that no one else on the pitch can see. Nowadays, I’m trying to emulate Emily Fox, not just because she's in my position but also because she’s very attacking-minded like me and combines so well with the wingers.\nOne of my highlights since joining the club is winning the FA Youth Cup in 2023. It was an incredibly intense match that went to penalties after a 2-2 draw and the moment our final penalty went in, it was such a great feeling for all of us. This season, we’re putting all our efforts into trying to win the league and working together as a team. It’d be amazing to have that achievement.\nUltimately, I want to make it as a professional footballer but I also want to make sure I study on the side, as I’m into my education and it keeps my mind busy! If I could have something alongside football that I could do after my career, I’d feel successful.\nCopyright 2026 The Arsenal Football Club Limited. Permission to use quotations from this article is granted subject to appropriate credit being given to www.arsenal.com as the source.",
  "word_count": 930,
  "scraped_at": "2026-02-14T13:44:14.285612"
}