{
  "article_id": "dc8bf1f920db",
  "url": "https://www.armidaleexpress.com.au/story/8312080/how-matildas-players-hope-this-world-cup-is-just-the-beginning/?cs=472",
  "title": "How Matildas players hope this World Cup is  just the beginning  ",
  "date": "20230817T043000Z",
  "domain": "armidaleexpress.com.au",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "The Matildas' World Cup dreams may have ended but past and present players hope the giant strides that have been taken in a short amount of time are \"just the beginning\" for women's sport in Australia.\nSubscribe now for unlimited access.\nor signup to continue reading\nSpeaking out after the heartbreaking 3-1 semi-final loss to world No.4 England at Stadium Australia on Wednesday night, Newcastle's Emily van Egmond called for the unprecedented support of the Matildas to continue long after the World Cup is over.\n\"I don't think if you'd asked any of us that we would have ever imagined it would have got this big, and we're so humbled and thankful for the entire nation to get behind us,\" van Egmond, playing at her fourth World Cup, said.\n\"It has been massive for us, and it's been really enjoyable to be here at home playing in front of our home fans.\n\"My message is, I hope that this is just the beginning and that they continue to support this team because, like you see, if you invest in women's football you can see the growth of it and hopefully it's just the start.\"\nDefender Steph Catley, who has played every minute of every match this tournament and stood in as captain during Sam Kerr's absence due to injury through the group stages, said leaving a legacy has been a driving force for the Matildas.\n\"We wanted to do something amazing and sort of wake up the public to what we were doing in women's football, and I think we've done that,\" Catley said.\n\"The buzz and the people that have interest and the support that we've had has gone to another level. I can't name one game coming into this tournament where I didn't feel emotional looking out onto the streets and seeing the people flocking out like there was nothing else happening in the world other than our game.\n\"So, it's been incredible and game-changing for women's football, women's sport, women in general. It's been very special. I'm hopeful in general that this is just the beginning.\"\nThe tournament has dramatically changed the landscape of the game in a short amount of time, but investment is needed at all levels to continue what has been started.\nThere is the skyrocketing grassroots playing fees, the paltry minimum wage of $25,000 for a 35-week A-League Women's season to the pay gap at the highest level.\n\"When you look at football in general in Australia, football is very much not funded the way it should be and I think that there's no argument now that people aren't interested,\" Catley said.\n\"People are interested. The numbers are there. Kids are playing, people want to be watching the sport, so hopefully this has just been enough to prove that and to create the argument and to improve facilities, improve standards for women in football, for football in general.\"\nMatildas cap No.26 Renaye Iserief was a pioneer of the game, paying to play in a time when soccer was seen to be \"not something that a women's team did or did well\".\nThey weren't known as the Matildas then. They were the \"Soccerettes\" and \"Soccer Shes\".\n\"We were everything bar taken seriously,\" the now 60-year-old, who represented Northern NSW and was the Central Coast's first representative in the Australian women's soccer team, said.\nTo see the Matildas and female football become the topic of conversation in the past few weeks has left Iserief and the Matildas alumni lost for words.\n\"It's been overwhelming to be honest,\" Iserief said.\n\"The crowd I've been travelling with, the former players, the conversations we've had and the experiences we've shared, and the euphoria of what the World Cup has brought to our nation and the people and sport in general has been next level.\n\"The schools, the public and workplaces, it's just united everyone. And what it's meant to us, the alumni who have travelled together, it's been quite emotional standing together for the anthem with tears of how proud we felt for our girls and of the part we've played as well. To be there to celebrate has been fantastic.\"\nThe narrative around the sport has quickly changed.\nNot only are young girls dreaming of being Sam Kerr or Mary Fowler, young boys are too.\n\"I hope that moving forward that our young girls and boys can see how amazing our game is and that it's more than a game of football, it's the people that we all connect with and share with,\" Iserief said.\n\"How well we've done is only going to build our sport and give it next-level participation. The country has embraced it. I've heard little boys say, 'The Socceroos, are they the boy Matildas?'.\n\"That's outstanding. It was just, 'Wow'. I never would have imagined that. That's what it's done out there.\n\"Now the government needs to not just be a face in the crowd. They need to invest and allocate money and funding to make things better for our women footballers. Better facilities and better lighting. It's been fantastic to see the support but put your money where your mouth is.\"\nThe Matildas' dreams of World Cup glory may be over but they still have plenty to play for when they battle Sweden in Brisbane on Saturday night in the third-versus-fourth play-off.\nRegardless of the result, it will be the highest placing an Australian soccer team has ever recorded at a World Cup.",
  "word_count": 911,
  "scraped_at": "2026-02-14T12:16:25.806282"
}