{
  "article_id": "dc9930914824",
  "url": "https://www.walesonline.co.uk/lifestyle/tv/full-list-bbc-colleagues-celebrities-26456653",
  "title": "The full list of BBC colleagues and celebrities supporting Gary Lineker",
  "date": "20230313T111500Z",
  "domain": "walesonline.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "The full list of BBC colleagues and celebrities supporting Gary Lineker\nThe broadcaster is reportedly set to make an apology to the presenter\nMatch of the Day host Gary Lineker is reportedly set to return to the show this coming weekend amid speculation he and the BBC are close to resolving their impartiality row. According to various reports there is \"growing confidence\" he will be back.\nIt follows a weekend which saw the broadcaster's sports coverage suffer severe disruption as a host of presenters and celebrities came out in support of the former England footballer. The 62-year-old did not appear on the football highlights programme after he was told to stand down from the role when he compared language used to launch a new Government asylum seeker policy with 1930s Germany in a tweet.\nHe said: \"There is no huge influx. We take far fewer refugees than other major European countries. This is just an immeasurably cruel policy directed at the most vulnerable people in language that is not dissimilar to that used by Germany in the 30s\".\nThe corporation is expected to announce it is reviewing its social media guidelines following the controversy and it is believed the sports broadcaster will agree to be more careful about what he tweets, the Telegraph said.\nFootball coverage on BBC TV and radio shows was hit across the weekend as fellow pundits, presenters and reporters - including Alan Shearer, Ian Wright and Alex Scott - walked out in \"solidarity\" with Lineker. Read more on Gary Lineker's BBC salary, net worth and 'unusual' relationship with ex-wife here.\nMatch Of The Day aired for only 20 minutes on Saturday without accompanying commentary or analysis from presenters, with Sunday's edition following a similar format and running for a reduced 15 minutes. Coverage of the Women's Super League match between Chelsea and Manchester United aired without a pre-match presentation on Sunday, and Radio 5 Live replaced much of its usual live sports coverage over the weekend with pre-recorded content.\nLineker has not publicly commented on the situation since he was taken off air on Friday, telling reporters that he \"can't say anything\" as they questioned him on the future of his presenting career when he left his home in Barnes, south-west London, to walk his dog on Sunday morning. The broadcaster's highest-paid presenter spent his Saturday afternoon supporting his home club Leicester City as they played Chelsea.\nBBC director-general Tim Davie apologised for the disruption to the sporting schedule this weekend, but said he will not resign. It is believed Mr Davie will be back at Broadcasting House on Monday after he had been in Washington, DC on Saturday.\nHere is the full list of colleagues and celebrities who backed Gary:\nIan Wright\nThe former footballer was one of the first to come out in support of his colleague.\nThe 59-year-old, who often appears as an expert on Match of the Day, tweeted: \"Everybody knows what Match of the Day means to me, but I've told the BBC I won’t be doing it tomorrow. Solidarity.\"\nIn an episode of his podcast Wrighty's House. He said: \"Let me tell you something if the BBC do get rid of Gary Lineker I am out. I am gone, I am not staying there. On his own platform, he should be able to say what he wants to say.\"\nAlan Shearer\nFellow pundit Alan Shearer also pulled out of Saturday's show. The 52-year-old simply tweeted on Friday: \"I have informed the BBC that I won't be appearing on MOTD tomorrow night.\"\nJason Mohammad\nThe Welsh television and radio presenter stood down from hosting Final Score on Saturday evening.\nHe wrote on Twitter: \"As you know, Final Score is a TV show very close to my heart. However - I have this morning informed the BBC that I will not be presenting the show this afternoon on BBC One.\"\nAlex Scott\nThe former footballer pulled out of hosting Football Focus as the weekend.\nThe 38-year-old tweeted on Saturday morning: \"I made a decision last night that even though I love doing football focus and we have had an incredible week winning an SJA award that it just doesn’t feel right going ahead with the show today. Hopefully I will be back in the chair next week\".\nThe show wasn't aired after her announcement.\nJermaine Jenas\nThe fellow pundit and former footballer also came out in support of Gary.\nThe 40-year-old tweeted: \"I wasn't down to be doing match of the day tomorrow, but if I was I would of said no and stood with my fellow pundits and (Gary).\"\nMark Chapman and Colin Murray\nThe BBC was forced to cancel their radio coverage of Saturday's football after Chapman and Colin Murray puled out.\nChapman has not commented on the matter, but Murray - who presents boxing show Fighting Talk - has. He tweeted, \"No Fighting Talk today, for obvious reasons. In the interest of transparency, this was a decision taken by the entire FT team and myself.\"\nDion Dublin\nThe pundit and former footballer suggested that he is standing in solidarity with BBC colleague Gary this weekend.\nDion, who features on Match of the Day and BBC Radio 5 Live, said he wouldn't be on air on Saturday. He tweeted: \"In solidarity with my BBC Sport colleagues NO 5live for me today!\"\nJermain Defoe\nThe 40-year-old stood down from his punditry duties at the weekend. The former footballer and pundit made the announcement in a tweet on Saturday.\nHe tagged Gary in a tweet which read: \"It's always such a privilege to work with BBC MOTD. But tomorrow I have taken the decision to stand down from my punditry duties.\"\nCarol Vorderman\nIt is not just sport pundits and presenters. Other celebrities came out in support of the Match of the Day host. Welsh presenter Carol Vorderman, who regularly tweets criticism of the UK Government, posted a message using the hashtag #IStandWithGary.\nShe shared footage from BBC's headquarters in London on Saturday which featured a quote from George Orwell. It read: \"If Liberty means anything at all, it means the right to tell people what they do not want to hear.\"\nDawn French\nThe actress and comedian retweeted a post from a Twitter user which read: \"Shakespeare saying stand with Gary Lineker. As only he can\".\nThe post quoted a passage from Shakespeare's play Sir Thomas More. Alongside the retweeted post, French added: \"This. #IStandWithGaryLineker.\"\nPiers Morgan\nThe presenter said that he \"didn't agree\" with Gary's tweet, but has expressed support over him being able to express such views.\nIn one tweet about the situation, he wrote: \"Gary didn't say any of it on the BBC, and isn't even a BBC employee… I didn't agree with what he said, but so what? It's HIS opinion.\"\nIn another post, Piers said: \"Free speech is the cornerstone of democracy - the moment Britons agree to be told what we're allowed to say or think, democracy dies.\"\nFatboy Slim\nThe DJ shared a video which showed performing at a gig, with a photo of Gary on a screen behind him.\nThe record producer wrote in the accompanying caption of the post on Twitter: \"Enough respect #ImWithGary\". He also tagged the TV presenter in the tweet.\nGeorge Lineker\nHe also has support from his family, with his son George tweeting: \"Proud of the old man after a busy few days. Shouldn’t need to apologise for being a good person and standing by his word. The reaction of the public has been overwhelming. Thanks for the support\"\nRead next:\n- Met Office issues weather warning for snow and ice in parts of Wales\n- Body found in search for man missing for three years\n- 18 female prison officers fired for having flings with prisoners at Welsh jail\n- Violence with weapons' reported at Welsh seaside resort",
  "word_count": 1311,
  "scraped_at": "2026-02-14T12:54:39.579850"
}