{
  "article_id": "dca98238be20",
  "url": "https://www.90min.com/posts/wsl-players-most-assists-all-time",
  "title": "WSL players with most assists of all time",
  "date": "20230113T171500Z",
  "domain": "90min.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "WSL players with most assists of all time\nBy Euan Burns\nThe WSL's debut season took place in 2011 and the league has been home to an assortment of creative players in the intervening years.\nFrom tricky wingers with a wicked delivery from either flank, to technically gifted midfielders who can split a defence with a pinpoint pass, the league has been graced with some of the most creative players in world football.\nBut who has the most assists in WSL history? Here are the WSL's all-time top assist makers.\n=19: Bethany England (22 assists)\nBethany England has racked up her WSL assist tally across spells with Doncaster, Chelsea, Liverpool and Tottenham.\nThe striker enjoyed a watershed season in 2019/20, scooping the PFA player of the year award as she helped inspire Chelsea to the WSL title with 14 goals in 15 games. She joined Tottenham in January 2023.\n=19: Jo Potter (22 assists)\nJo Potter was ever present for the first nine years of the WSL prior to her 2021 retirement.\nThe England international plied her trade at Birmingham, Notts County and Reading, and notched up an impressive 22 assists despite often playing in a defensive midfield or centre back role.\n=19: Ella Toone (22 assists)\nElla Toone really made her mark on the WSL during the 2020/21 season, and has been one of the league's most creative players ever since.\nThe Manchester United midfielder is famed for her low, defence splitting through balls, and was an important part of England's Euro 2022 winning squad.\n=17: Chloe Kelly (23 assists)\nChloe Kelly has reached her assist tally through stints at Arsenal, Everton and Manchester City.\nThe Euro 2022 hero enjoyed a breakthrough season with Everton during the 2019/20 campaign, earning her a move to City the following summer. With Kelly on one flank and Lauren Hemp on the other, City are a frightening prospect going forward.\n=17: Kim Little (23 assists)\nKim Little has had two spells at Arsenal, winning two WSL titles in her first before enjoying stints at Seattle Reign and Melbourne City.\nThe silky midfielder returned to north London in 2017 and added a further WSL title to her collection in 2019.\n16: Alex Greenwood (24 assists)\nIt is her superb set-piece-taking abilities that make Alex Greenwood high in the assist charts. The defender began her senior career at left back, but has since transitioned into a centre half since joining Manchester City.\nThere also aren't many footballers who can say they have played for Everton, Liverpool, Manchester United and Manchester City.\n=12: Erin Cuthbert (25 assists)\nErin Cuthbert moved to the WSL in 2017 when she joined Chelsea from Glasgow City. She has gone on to win three league titles during her time in the top flight.\nThe Scotland international has played here, there and everywhere for the Blues, but nailed down a starting central midfield role during the 2022/23 campaign.\n=12: Guro Reiten (25 assists)\nGuro Reiten moved to Chelsea from LSK Kvinner in her native Norway in 2019 and has been a constant source of creativity for the Blues since her arrival.\nThe winger is renowned for her wicked deliveries from the left. Four of her WSL assists came in one devastating first half performance alone against Leicester in December 2022.\n=12: Jill Scott (25 assists)\nJill Scott was a WSL stalwart prior to her retirement in 2022, recording 25 assists in 175 appearances for Everton, Manchester City and Aston Villa.\nEngland's second most capped player signed off from her professional career by winning Euro 2022 and I'm a Celebrity Get Me Out of Here.\n=12: Gemma Davison (25 assists)\nGemma Davison remains one of the most skilful players to have graced the WSL.\nThe tricky winger notched up her 25 assists across spells with Arsenal, Liverpool, Chelsea, Reading, Tottenham and Aston Villa, collecting four WSL winner's medals in the process.\n=9: Fara Williams (28 assists)\nAnother retiree who has recorded their final WSL assist, Fara Williams had a hugely successful career with Everton, Liverpool, Arsenal and Reading before hanging up her boots in 2021.\nEngland's most capped player is a two-time WSL champion, winning back-to-back titles with Liverpool in 2013 and 2014.\n=9: Nikita Parris (28 assists)\nDespite spending two seasons away at Lyon in France, Nikita Parris is still high on the assist list.\nThe forward has tallied up her assists across spells at Everton, Manchester City, Arsenal and Manchester United, while she is also one of the WSL's all-time top scorers.\n=9: Caroline Weir (28 assists)\nAlthough Caroline Weir is best renowned for her stunning solo goals, she's got a strong assist record to match.\nThe Scotland international tapped out on 28 WSL assists - registered during spells with Arsenal, Bristol Academy, Liverpool and Manchester City - when she moved to Real Madrid in the summer of 2022.\n=7: Jordan Nobbs (29 assists)\nJordan Nobbs has firmly cemented herself as an Arsenal legend, having played for the North London side between 2010 and 2023 and racking up almost 300 appearances and a series of spectacular goals for the Gunners.\nShe moved to Aston Villa in January 2023 for a new adventure.\n=7: Ji So-yun (29 assists)\nShe may not be in the WSL anymore, but former Chelsea midfielder Ji So-yun racked up a seriously impressive 29 assists during her time with the Blues.\nOne of the league's all-time greats, she secured five WSL titles, before heading back home to South Korea to play for Suwon FC in the summer of 2022.\n6: Ellen White (30 assists)\nAn undisputed legend of English women's football, Ellen White is high up on both the WSL goals and assists charts.\nThe Lionesses all-time top scorer registered 61 goals and 30 assists across spells with Arsenal, Notts County, Birmingham and Manchester City, before hanging up her boots after England's Euro 2022 triumph.\n5: Fran Kirby (31 assists)\nOne of the shining lights of the WSL, Fran Kirby is a contender to get to the top of this list before her career is over.\nThe forward joined Chelsea from Reading in 2015, and has gone on to win five WSL titles with the Blues, playing a particularly influential role in their 2020/21 triumph.\n4: Katie McCabe (32 assists)\nOne of Ireland's most prominent sporting stars, Katie McCabe is rightly towards the top of the list and is set to keep on climbing.\nCapable of playing at full-back and as a winger and blessed with a devastating left footed delivery, she is a constant source of creativity for Arsenal\n3: Vivianne Miedema (34 assists)\nOne of the best in the WSL, if not the world, Vivianne Miedema has been breaking records since her arrival in the WSL in 2017.\nThe Dutch forward is the WSL's all-time top scorer, and won successive golden boots in 2019 and 2020.\n2: Karen Carney (35 assists)\nA key part of the growth of women's football in the UK, Karen Carney rightly sits towards the top of the assist list.\nHer time at Arsenal, Birmingham City and Chelsea saw her register 35 WSL assists and also lift the WSL title in 2018.\n1: Beth Mead (42 assists)\nBeth Mead rose to the top of the WSL assist charts in April 2022 as part of a stunning individual year for the forward, seeing her inspire England to Euro 2022 glory and becoming the first female footballer to win BBC Sports Personality of the Year.\nMead reached her assist tally via spells at Sunderland and Arsenal, and is also right up there when it comes to WSL all-time top scorers too.",
  "word_count": 1267,
  "scraped_at": "2026-02-14T12:21:39.854500"
}