{
  "article_id": "dccc4e1f366a",
  "url": "https://www.express.co.uk/showbiz/tv-radio/1921720/itv-good-morning-britain-viewers-switch-off-euros",
  "title": "Good Morning Britain viewers  switch off  as Euros coverage sparks backlash",
  "date": "20240711T110000Z",
  "domain": "express.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Good Morning Britain viewers 'switch off' as Euros coverage sparks backlash\nEd Balls and Kate Garraway kicked off Thursday's instalment of Good Morning Britain headlining England's huge win against the Netherlands in the Euros.\nKate Garraway weighs in on bank holiday debate\nGood Morning Britain viewers were furious with the ITV programme's coverage of the Euros.\nOn Wednesday evening (July 10), Ollie Watkins scored a 90th minute winner against the Netherlands, sending England through to the 2024 Euros final.\nThe huge win was the main headline on Thursday's edition (July 11) of Good Morning Britain, hosted by Ed Balls and Kate Garraway.\nDuring the broadcast, a poll was created on the Good Morning Britain X account, asking fans to vote on whether there should be a bank holiday on Monday, regardless if England beat Spain in the final.\nDespite it likely costing the economy around £2 billion, Ed and Kate seemed on board with the idea. While Tre Low and Bobby Seagull were debating the idea, the 57-year-old interjected: \"What about the feel-good value? Surely that's an economic boost?\"\nThis infuriated viewers, who took to social media to slam the idea. One wrote: \"I now think Ed Balls has lost his marbles if he thinks Monday should be a bank holiday if England win the Euros.\"\nA second fumed: \"Why are you obsessed with us having a Bank Holiday to celebrate anything England wins? (& we haven’t won yet) Don’t you realise Bank Holidays are taken out of a lot of workers allocated annual leave, so it’s robbing people of yet another precious leave day. Ridiculous idea!\"\nOthers shut down the prospect as they compared it to other sports, including the Lionesses winning the UEFA Women's Euro in 2022. One declared: \"Nope, ridiculous and I suspect many will just call in sick anyway if we win & they’ve over celebrated. Did we get a bank holiday when England Women won?\"\nDon't miss: Good Morning Britain star fumes as Andi Peters leaks major ITV show spoiler\nDon't miss: Good Morning Britain star brutally mocked by co-star over outfit choice\nDon't miss: Good Morning Britain host bids 'emotional' farewell as presenter quits ITV\nAnother asked: \"Did we have a bank holiday when the ladies won, the men’s cricket World Cup, the men’s rugby World Cup, no no no so no to a bank holiday IF England win.\"\nMeanwhile, further viewers issued complaints about the coverage in general, with one posting: \"@GMB Congratulations England on qualifying for the final. But remember the show us called Good Morning Britain. Too much time spent on the victory. Not everyone in the UK wants to hear this for a disproportionate time of the program. I've now turned off.\"\nA second echoed: \"Fed up of bloody hearing about England football! They won lovely! Last Sunday the papers were full of it, 11.5 pages of England football, 1 page about the new government! God help is now!\"",
  "word_count": 489,
  "scraped_at": "2026-02-14T13:05:10.538790"
}