{
  "article_id": "dd089a1f4854",
  "url": "https://mlsmultiplex.com/angel-city-fc-shakes-up-the-nwsl-signs-top-young-defender-01jk91c4b3gz",
  "title": "Angel City FC shakes up the NWSL , signs top young defender",
  "date": "20250204T221500Z",
  "domain": "mlsmultiplex.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Young defender Savy King signed with Angel City FC in a deal from Bay FC. The Los Angeles-based side sealed the deal by sending $200,000 in intra-league transfer funds and another $100,000 in 2026.\nFollow MLS Multiplex on X (Twitter).\nThe California-born 18-year-old arrives in Angel City with an already strong résumé. King was selected as the second overall pick in the 2024 NWSL Draft, playing in 20 games in her rookie season and leading Bay FC into the playoffs their inaugural year. Now, she returns to her hometown ready to represent the club that represents her community.\n\"Joining Angel City is a full-circle moment for me. This is my home, my community, and where I fell in love with the game. I'm ready to give my all for this club and these incredible fans.\"\nKing's enthusiasm is also well-received at the helm of Angel City management. Sporting Director Mark Parsons elaborated on King's potential to make a marked difference in their future.\n\"Savy is an exciting talent with a huge future ahead, and we're thrilled to welcome her to Angel City. She has already shown at the collegiate level, with the U-20s, and in her NWSL rookie season that she's ready to make an immediate impact. We believe our environment will push Savy to new heights, and I'm excited to see her help us reach our goals for years to come.\"\nThe talent of Savy King and the vision of Angel City FC\nThe decision to invest in King wasn't some random choice. Since her time with the North Carolina Tar Heels, where she played 23 matches and logged an impressive 2,030 minutes on the field, she has been a high-level player. Performances in the NWSL with Bay FC also caught the eye-20 appearances, two assists, and a key role in a team that made the playoffs in its debut season.\nThe budding star of U.S. women's soccer — While King isn't only considered talented on the club level. Alongside Gisele Thompson, another defender for Angel City FC, King is considered one of the nation's top young defenders for the U.S. Youth National Team. In 2024, she helped the U.S. U-20 team capture bronze in the FIFA U-20 Women's World Cup.\nBefore that, she had taken part in the 2022 FIFA U-17 Women's World Cup and played a key role in their 2022 Concacaf U-17 Women's Championship title. Her swift rise then saw her no less than be included among the nominees for U.S. Soccer's Young Female Player of the Year award in 2023.\nAnd now, with a call-up to US Futures Camp courtesy of USWNT head coach Emma Hayes being the latest push, King just seems closer than ever to eventually breaking into that senior national side.\nReturning back home to cause impact\nA native of Santa Monica, California, King grew up in West Hills, and her ties to LA soccer run deep. She went to Agoura Hills High School and was developed through Slammers FC. That is where King made a name for herself as one of the top youngsters around. She represented the ECNL San Diego National Selection Games U-16/17 West All-Star Team in 2021, an indicator of her promise at the early stages.\nOther than soccer, King was a fantastic track and field athlete back in her high school days as she claimed the best athlete in both her team and school. She also played as a wide receiver on her school's girls' flag football team, broke records, and won team MVP honors after recording six interceptions and four touchdowns in one game to showcase her all-round sporting talent.",
  "word_count": 604,
  "scraped_at": "2026-02-14T13:19:33.004153"
}