{
  "article_id": "dd1019208cbc",
  "url": "https://www.webwire.com/ViewPressRel.asp?aId=334620",
  "title": "Club América and adidas announce multi - year agreement",
  "date": "20250221T183000Z",
  "domain": "webwire.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Club América and adidas announce multi-year agreement\nToday, Club América and adidas have agreed to a multi-year partnership that will make the sports brand the official partner of the club starting from the 2025-2026 season. This agreement marks the return of a historic collaboration between two leading institutions in football that have shared unforgettable moments in the past, and now, together, they aim to continue building a successful future.\nClub América is an icon of Mexican football, with a large and passionate fanbase. Its historic success is unique, and the current achievements of both the mens and womens teams have added to its status in the sport. The mens team has 16 titles in its history, while the womens team has 2, starting in 2017, when the Womens League began.\nStarting in July 2025, Club América will wear adidas, continuing the role it played as the shirt supplier in the 1980s and 1990s. It will provide match and training gear for all teams in the Club América structure at the start of the new season in Mexican football.\nThe partnership positions Las Águilas as a leader in continental football, both on and off the field, and reintroduces them among the elite clubs worldwide. It also highlights adidas leadership in sport and its commitment to Mexico and the region.\nSam Handy, General Manager of adidas Football, said: \"The incomparable history of Club América in Mexican football is something we deeply admire and respect. Bringing adidas and Las Águilas back together at a time when the eyes of the world will be on the sport of the continent and the region fills us with ambition and excitement\"\nEmilio Azcárraga, President of Club América, stated: \"We are very happy with this new agreement with adidas. It is a financially positive deal for Club América. Additionally, we are confident it ensures fans greater access to all Club América products\"\nAbout adidas\nadidas is a global leader in the sporting goods industry. Headquartered in Herzogenaurach (Germany), the company employs more than 59,000 people worldwide and generated sales of 21.4 billion euros in 2023.\nAbout adidas in Football\nadidas is the global leader in football. It is the official supplier for the worlds most important football tournaments, such as the FIFA World Cup, FIFA Womens World Cup, UEFA Euro, UEFA Champions League, and UEFA Womens Champions League. adidas also sponsors some of the worlds biggest football clubs, including Real Madrid, Manchester United, Arsenal, FC Bayern Munich, Juventus, and Tigres. Additionally, adidas partners with some of the best football athletes, such as Leo Messi, Jude Bellingham, Mohamed Salah, Pedri, Florian Wirtz, Alessia Russo, Paulo Dybala, Gabriel Jesus, Lamine Yamal, Aitana Bonmatí, Serge Gnabry, Mary Fowler, Wendie Renard, Santiago Giménez, Edson Álvarez, Henry Martin, Kevin Álvarez, Alejandro Zendejas, Israel Reyes, Jana Gutierrez, Alice Soto, among others.\n( Press Release Image: https://photos.webwire.com/prmedia/8/334620/334620-1.jpg )\nWebWireID334620\nThis news content was configured by WebWire editorial staff. Linking is permitted.\nNews Release Distribution and Press Release Distribution Services Provided by WebWire.",
  "word_count": 498,
  "scraped_at": "2026-02-14T12:49:44.520901"
}