{
  "article_id": "dd46af351822",
  "url": "https://www.montereyherald.com/2024/11/25/clipboard-bouyea-making-a-case-to-get-back-into-the-nba/",
  "title": "Clipboard : Bouyea making a case to get back into the NBA",
  "date": "20241126T033000Z",
  "domain": "montereyherald.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Re-signed by the San Antonio Spurs in training camp and assigned to their G-League team in Austin, Jamaree Bouyea is tearing up the league through six games.\nThe 6-foot-2 Palma graduate and Marina native is leading Austin in scoring at 19.2 points a game and in steals at 3.0, while logging a team-high 37.4 minutes a night.\nBouyea, who honed his basketball skills with Seaside’s Finest as a youth, is second on the team in assists at 4.5 and blocks at 1.5, while pulling down 4.3 rebounds from his guard position.\nUndrafted out of the University of San Francisco in 2022, Bouyea spent the end of last season with San Antonio and played with its Summer League team.\nIn his first two professional seasons, Bouyea has spent time in the NBA on 10-day contracts with the Miami Heat, the Washington Wizards, the Portland Trail Blazers and San Antonio.\nIn 14 career NBA games, the 25-year-old is averaging 2.6 points and 1.1 rebounds in 11 minutes on the hardwood.\nBouyea was named to the NBA G-League All-Rookie Team in 2023 at Sioux Falls and was a second-team G-League selection.\nPrior to leading USF to its first NCAA tournament appearance in 25 years, Bouyea took Palma to its first state title appearance in 24 years in 2016.\nLaporte racking up minutes\nMakenzi Laporte has started all four games this year for the Chico State women’s basketball team, leading them in minutes played at 30.8 a game.\nThe former Salinas High four-sport standout shares the team lead in assists with nine, while averaging 13.5 points and 4.3 rebounds a contest.\nThe senior forward has shot 75 percent from the field in two games this winter, dropping in a season-high 19 points last week against Menlo.\nIn 60 career games for the Wildcats, Laporte has scored 604 points, pulled down 323 rebounds, has 74 assists and 40 steals.\nLaporte is also a member of the Chico State women’s golf team, finishing 30th last year at the CCAA championships.\nThe Herald’s Athlete of the Year in 2021, Laporte was an all-leaguer in golf and basketball at Salinas High and played softball and lacrosse.\nDale brothers gearing up\nJasper and Wyley Dale have been key components off the bench for the nationally-ranked UC Irvine water polo team, which took part last weekend in the Big West Championships.\nDespite missing three games with a concussion, the 6-foot-8 Wyley has produced 16 goals in 26 matches for UC Irvine, which is ranked No. 8 in the nation.\nThe 6-foot-6 Jasper has served as a distributor as well as a scoring threat, producing 11 goals and nine assists, giving him 20 points on the season.\nThe Anteaters went into last weekend’s Big West Championships having won nine of their past 10 matches, improving to 18-8 overall.\nListed as a utility player, Jasper has compiled points in 11 matches this year, collecting a season-high three goals against Whittier.\nA member of the U.S. Youth National team in 2019 and 2023, Wylie has scored 27 goals in two seasons at UC Irvine.\nThe Stevenson graduates are both former Pacific Coast Athletic League Gabilan Division Most Valuable Players in water polo, with Jasper winning the award in 2021 and Wylie in 2022.\nMontano should get NFL consideration\nAbraham Montano has established himself as one of the more complete kickers in college football at New Mexico State, leading the team in scoring with 57 points.\nThe left-footed kicker has converted 13-of-16 field goal attempts with two of his misses being from beyond 50 yards.\nMontano, who kicked a career-best 57-yard field goal earlier this year, is a perfect 17-of-17 in extra points and has 25 touchbacks among his 38 kickoffs.\nA former Alisal High soccer standout, Montano’s leg strength and accuracy this fall should put him on NFL teams’ radar.\nOwner of a school record 50-yard field goal at Hartnell College, Montana spent two years at Fresno State before entering the transfer portal and going to New Mexico State.\nMontano was a part of Alisal’s Northern California Division II title team in soccer in 2018, earning all-Gabilan Division first-team honors.\nCSUMB fall sports all-conference\nJennifer Limon was named the California Collegiate Athletic Association Defender of the Year for the Cal State Monterey Bay’s women’s soccer team.\nThe first player from the Otters to earn the prestigious award, Limon was also a first-team selection for CSUMB, which made its first CCAA tournament appearance in school history.\nTeammate Danielle Castro was a second-team selection, while Nylah Mirshafiei, Audrey Reyna, Tiger Rendon and Evelyn Sandoval were honorable mention picks.\nHugo Vargas-Rios and Mason Ward were both named to the CCAA first team for the Otters men’s soccer team.\nJack Blickenstaff, Janos Kommerling and Soledad High graduate Alexis Sanchez were second-team selections, while Kane Ritchie earned honorable mention honors.\nJackie Wahl closed a chapter for the Otters volleyball team, earning second-team honors in the CCAA. Teammate Ruby Ennis was an honorable mention selection.\nCoaches needed\nMarina is looking for a varsity boys volleyball coach and a varsity baseball coach. Go to www.edjoin.org/MPUSD.\nSeaside is looking for head coaches for varsity baseball, softball and boys and girls swimming. Contact athletic director Steven Vasquez at stvasquez.mpusd.k.12.ca.us\nSalinas is looking for head coaches in boys’ volleyball and field hockey. Go to https://salinashscowboysathletics.com\nOfficials needed\nPeninsula Sports Incorporate is looking for high school and middle school officials for all sports this season. Varsity officials are paid $100 a game. There is an immediate need for officials in the winter for boys’ and girls’ basketball, soccer and wrestling. Training is provided. Call Tom Emery at (831) 241-1101.",
  "word_count": 935,
  "scraped_at": "2026-02-14T13:17:48.356404"
}