{
  "article_id": "dd6a113e65c1",
  "url": "https://www.texasobserver.org/kelly-siegler-jeffrey-prible-true-crime/",
  "title": "Kelly Siegler : Trading Favors",
  "date": "20231228T014500Z",
  "domain": "texasobserver.org",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "This is Part 2 of a three-part series originally published by The Intercept. Read Part 1 and Part 3 on our site.\nChapter 1: Invisible Man\nHermilo Herrero, 35, had been stuck inside the Harris County jail for months. He was bewildered and angry. He’d been serving a drug sentence at the federal correctional institution in Beaumont, Texas, when he was indicted for a cold case murder he swore he did not commit, then dragged to Houston to face trial. There was no evidence linking him to the crime save for a pair of informants enlisted by prosecutor Kelly Siegler. On the stand, they claimed that Herrero had confessed to the 1995 murder of his friend Albert Guajardo. In April 2002, Herrero was sentenced to life.\nHerrero was awaiting transfer back to FCI Beaumont when he saw that a man named Jeffrey Prible was about to stand trial down the road for murdering a family in Houston. The case was familiar—Herrero had read about it in the Houston Chronicle. Prible was charged at almost the exact same time as Herrero, and both cases involved murders gone cold. But the more Herrero learned about Prible’s case, the more disturbed he was by the parallels. As in Herrero’s case, an informant claimed Prible had confessed to him at Beaumont. And as in Herrero’s case, the informant made a deal with Siegler that could get him out of prison early.\nHerrero had seen his share of legal trouble. But Siegler turned him into a cartoon villain at trial, comparing him to the notorious mobster John Gotti. Siegler told jurors that after running into Guajardo at a bar, Herrero had attacked him from the backseat of a moving van, slitting his throat and beating his head with a hammer. He rolled Guajardo’s body in a rug, Siegler said, and threw it on the side of the road. Although the lead investigator, Harris County homicide detective Curtis Brown, bluntly conceded on the stand that he’d found no evidence implicating Herrero, Siegler and her snitches convinced the jury that he had committed the brutal murder.\nThe informants who testified against Herrero were also at Beaumont on drug crimes. Their convictions came out of a tough-on-crime era that saw the federal prison population explode. Spurred by the war on drugs, sentences grew longer, and for those convicted after 1987, the sweeping Sentencing Reform Act eliminated federal parole altogether.\nFor people serving long sentences with no end in sight, providing information to the government became one of the only ways to win early release. Although Rule 35 had been part of federal criminal procedure for decades, the drug war transformed it from a provision that merely gave judges a chance to show mercy to one that required incarcerated people to provide “substantial assistance” to prosecutors for any chance at leniency. Informing on their peers was a deal many were willing to make—even if it meant lying on the stand.\nWithin such a population, men like Herrero and Prible were sitting ducks. Not only were they facing new charges while in federal prison, but both had been charged with murder—the kind of high-stakes prosecution that could yield significant benefits for anyone who offered intel.\nHerrero knew the men who testified against him: Jesse Moreno and Rafael Dominguez. Moreno was the star witness, “pretty much the crux of this case,” Siegler said in her opening statement. Although she told jurors that she would only vouch for Moreno’s Rule 35 motion if he told the truth, to Herrero, this was a cruel joke. Like Prible, he swore the case against him had been blatantly fabricated.\nIt was only when Herrero was finally being transferred out of Houston, waiting in the holding tank to go back to Beaumont, that he happened to meet someone who had insight into just how connected the two cases were. The man was Black, in his late 20s, stocky and bald. He went by Brother Walker.\n“He told me he knew everything about what happened to me and a guy named Prible,” Herrero recalled. According to Walker, Beaumont was home to a ring of informants who gave Siegler information to use against defendants in state cases in exchange for her help in their federal cases. Moreno and Dominguez were part of this ring, as was Michael Beckcom, the star witness against Prible. The head of the operation was a man who lurked in the background of both Prible’s and Herrero’s cases, someone who supposedly heard both men confess yet was conspicuously absent from both trials: Nathan Foreman.\nA relative of the legendary boxer George Foreman, Nathan Foreman arrived at FCI Beaumont in early 2000 for federal drug crimes. He was placed in the Special Housing Unit, nicknamed the SHU, where he worked as an orderly. The job gave him some freedom of movement, allowing him to visit different cells. Some knew him as “Green Eyes.” Others called him “Bones.” To Herrero, Foreman was the “invisible man.” He was convinced he’d never seen him. Yet at trial, Siegler repeatedly characterized Foreman as one of Herrero’s associates in prison.\nWalker told Herrero that he had firsthand knowledge of the Beaumont snitch ring: Foreman had recruited him too.\nHerrero asked if he would be willing to put what he knew in a statement. But Walker was hesitant to get involved. Not long after their return to Beaumont, Herrero was transferred to a different prison. Although he lost touch with Walker, Herrero was determined to share what he’d uncovered with Prible.\nTexas death row is located at the Polunsky Unit in Livingston, some 70 miles north of Houston. The state has long been notorious as the execution capital of the country. By the time Prible arrived in November 2002, 29 men had been executed that year alone. Four more would be killed before Christmas.\nAs Prible tells it, he arrived on death row convinced that it was only a matter of time before somebody realized a mistake had been made. “As bad as this place was, I thought this would all get straightened out,” he said. Growing up on the border of Houston’s north side, Prible had not been raised to mistrust the criminal justice system. His parents were “just middle class, working people,” Prible’s aunt, Cheryl Peterson, said. “We used to believe the police were all righteous and good.”\nNevertheless, Prible would be the first to say that he wasn’t a model citizen. As a teenager, he partied and ran from the cops. “We were stupid as fuck when we were young but goddamn we had fun,” he said. Things got more serious as he got older. At the punishment phase of his trial, his ex-wife said he used cocaine and steroids, which compounded his mood swings. “He could be happy, completely happy one minute, and completely hysterical, crazy mad the next.” At his worst, she said, he was physically and emotionally abusive, threatening to hurt himself or her.\n“Jeff was a handful from the time he was little,” Peterson recalled. She said there was a history of bipolar disorder in their family, which she suspected Prible shared, although he was never diagnosed or treated. This was the kind of mitigating factor that might have persuaded a jury to spare his life. But Prible’s lawyers focused instead on portraying him as a loving son, father, and uncle who would never hurt a child. That much was true, according to Peterson, who never believed Prible committed the murders.\nPeterson carried guilt over her own unwitting role in the case. While awaiting trial, Prible asked her to send him a copy of the probable cause affidavit laying out the state’s evidence against him. He then recklessly showed it to his neighbors at Beaumont. “That helped set him up,” Peterson said. One man who was incarcerated alongside Prible testified at trial that he’d warned Prible to stop discussing it. “I told him to shut up.”\nNot long after Prible arrived at Polunsky, a neighbor on death row named Jaime Elizalde asked him if he’d ever done time in federal prison. Prible said yes, he’d been at Beaumont. Elizalde responded that his good friend, Hermilo Herrero, was locked up at Beaumont. Herrero was innocent, Elizalde told Prible, and he knew this for a fact—because he was the one who had murdered Guajardo.\nHerrero’s wife had recently visited Elizalde at Polunsky, and she recognized Prible in the visitation room. Prible said he almost fainted when Elizalde showed him paperwork from Herrero’s case and he saw the people involved: Kelly Siegler, Curtis Brown, and a pair of informants from Beaumont. Elizalde also shared a letter from Herrero, who described meeting a man who knew the whole story of how he and Prible had been set up. Herrero did not know much about the man, only that he was Black and went by Walker.\nCorrespondence between people incarcerated at different facilities is strictly forbidden. Most communication happens illicitly or by word of mouth, so there is no record of the information Herrero shared. Nor was there a way for Prible to write Herrero directly—any letters would be swiftly confiscated. Nevertheless, from his death row cell, Prible set out to find Walker.\nIt would not be easy. For one, he didn’t know Walker’s first name. And he got nowhere when he tried to tell his lawyers what he’d learned. After his direct appeal was rejected in 2004, Prible was assigned a new attorney to represent him in state post-conviction proceedings: longtime Houston criminal defense lawyer Roland Moore III. It might have been a reason for optimism; Moore had just won a new trial for a man who was misidentified by a woman coming out of a coma.\nPrible was certain that Walker was the key to exposing the conspiracy against him. But to his dismay, Moore seemed unmotivated to find him. Instead, the attorney set about proving that Prible’s trial attorneys had been ineffective, often the most promising path to relief for people on death row.\nAmong Moore’s claims was that the lawyers had failed to challenge the state’s forensic evidence. A well-respected DNA scientist named Elizabeth Johnson provided a declaration disputing the testimony of Bill Watson, the analyst who claimed that sperm found in Nilda Tirado’s mouth must have been deposited right before she died. Watson did not conduct the microscopic examination necessary to support his conclusions, Johnson wrote. Nor was he apparently aware of studies showing that sperm could be found in oral samples of live individuals many hours after being deposited, including those who rinsed their mouths. Had Prible’s attorneys challenged Watson’s unscientific testimony, it could have been kept out of the trial.\n“If the ideal witness came forward like you would dream up in a movie and said, ‘Yes, Kelly Siegler told me to say all those things about Prible’s confessing,’ … then we could have a hearing where this dream witness would say all that. But nobody would believe it. I mean nobody.”\nMoore included Johnson’s declaration in a state writ challenging Prible’s conviction. But Prible was furious upon learning that Moore had filed the writ without finding Walker.\n“What I don’t understand is what anybody could say that would help,” Moore wrote in a letter to his client. “If the ideal witness came forward like you would dream up in a movie and said, ‘Yes, Kelly Siegler told me to say all those things about Prible’s confessing,’ … then we could have a hearing where this dream witness would say all that. But nobody would believe it. I mean nobody.”\nPrible decided to take matters into his own hands. It was one of his neighbors, after all, who provided the tip that could break the case open. Now he just needed someone on the outside to run it down.\nChapter 2: Stroke of Luck\nWard Larkin doesn’t remember exactly when he received the first letter from Prible. As an activist involved in leftist causes, Larkin had been visiting Texas death row for almost a decade by the time they met. Some of the men just wanted someone to talk to. But from the beginning, Prible insisted he was innocent.\nLarkin knew better than to roll his eyes. By that point, he’d grown close to a number of condemned men he believed were innocent. At least one had already been executed. Others would eventually be released.\nPrible told Larkin that he needed help with something specific. There was a man in federal prison with the last name Walker. He was Black. And he had been incarcerated at Beaumont around 2001. That was all he knew.\nLarkin, a computer programmer, scoured the Bureau of Prisons’ public database. He put together a list of men with the last name Walker. One of them, Larry Walker, seemed like a promising match. Larkin sent the man several letters but did not hear back.\nHe had found the wrong Walker. But by a stroke of luck, his letters made their way to the right man anyway. In 2005, Hurricane Rita pummeled the Texas coast, forcing the Bureau of Prisons to relocate hundreds of people previously housed at Beaumont. Carl Walker ended up at the federal lockup in Yazoo City, Mississippi. It was there, on the rec yard, that he spotted a friendly acquaintance he knew as Smiley. Smiley said that his cellmate, Larry Walker, had been receiving letters from someone trying to help a man on Texas death row. Smiley suspected the letters might actually be meant for him. Carl Walker said he immediately guessed what this was about. “I knew the whole thing.”\nAs 2007 came to a close, so did Siegler’s final cold case murder prosecution for Harris County, with the conviction of David Temple, a high school football coach accused of killing his pregnant wife, Belinda.\nThe investigation into Belinda’s murder had been dormant for years before Siegler dusted it off and, without any new evidence, got a grand jury to indict Temple, who was sentenced to life in prison. It was business as usual for Siegler, but that was about to change.\nSiegler’s longtime mentor, Harris County District Attorney Chuck Rosenthal, who had announced his intention to run for reelection in 2008, became embroiled in a scandal after the release of emails from his work account, which included intimate messages he’d sent to a co-worker. Rosenthal withdrew his candidacy at the request of the local GOP. That same day, Siegler tossed her hat in the race, casting herself as a reform candidate. A campaign ad billed her as a “bulldog in a chihuahua’s body.” During a candidate forum at the Old Spaghetti Warehouse, Siegler acknowledged there were problems in the DA’s office but insisted that she was the one to fix them. “I am the only one who has worked there for the last 21 years,” she said. “I know how it operates.”\nReminders that she was part of the office’s entrenched culture peppered her campaign. Days after she announced her run, a new cache of Rosenthal’s emails, some involving racist jokes and explicit images, made headlines. A video of men forcibly stripping off women’s shirts in public had been sent by Siegler’s husband, who was Rosenthal’s doctor. Siegler brushed it off. “His sense of humor is crude, to put it mildly,” she said of her husband, but he could do what he wanted on his own computer because “he’s the boss.” She dismissed the incident as a distraction: “I would hope the voters are more concerned about qualifications of their DA than some inappropriate emails.”\nSiegler’s qualifications were impressive, but the emails weren’t the only problem. Early in her career, she’d apologized for using the word “Jew” as a synonym for “cheat” in front of prospective jurors. She said she didn’t know it was a slur because she hadn’t grown up around many Jewish people. There was also an allegation that she’d struck a juror in a death penalty case because he was Black. Not true, she said; she’d struck the man because he was a member of the megachurch led by televangelist Joel Osteen. Its congregants were “screwballs and nuts,” she explained. She later apologized and said that by striking the juror, she was just trying to weed out those who would shy away from imposing a death sentence. “You don’t think an aggressive prosecutor hasn’t offended just a few people?” she asked.\nSiegler’s campaign amassed a number of law enforcement endorsements, which pushed her through a crowded four-way Republican primary and into a runoff. But it wasn’t enough: She lost to the former chief judge of the county’s criminal courts. On the heels of defeat, Siegler resigned from the DA’s office. “All that this office stands for will always be a part of my heart,” she wrote in her resignation letter. She left her job feeling beaten up, she later told Texas Monthly. She’d imagined spending her career at the DA’s office, and now she was wondering if there would be a second act.\nFor a while, Siegler maintained an uncharacteristically low profile before blasting back into the headlines in 2010, when she was appointed special prosecutor in the case of Anthony Graves, who’d spent 12 years on death row for a crime he swore he did not commit. After years of legal wrangling, Graves’s conviction was overturned; Siegler was hired to determine whether the state should retry him. That October, she declared that Graves had been the victim of prosecutorial misconduct, “the worst I’ve ever seen.” It was an unexpected conclusion from a woman who for so long had been a poster child for the state’s aggressive and unreflective criminal justice system. And it came just as things were beginning to heat up in the case of Jeffrey Prible.\nChapter 3: Birthday Cake\nAs an attorney in Houston, James Rytting was familiar with Siegler’s courtroom theatrics. Her most famous stunt, tying her colleague to the headboard of a victim’s bloody bed, expanded her brand beyond Texas’s borders. A TV crew shadowed her during the trial, and the bed scene was reenacted in “The Blue-Eyed Butcher,” a Lifetime movie about the case. “I was actually surprised that the scene caused as much uproar as it did,” Siegler said. “It was just something that seemed to be the right thing to do at the time.”\nRytting taught university-level classes in philosophy and logic before turning to law. Gracile in appearance and earnest in demeanor, he quickly developed a reputation for taking on some of Texas’s most difficult death penalty appeals. In 2008, Rytting was appointed to represent Prible as the case moved into federal court.\nPrible had long stopped trusting his appointed attorneys. He’d filed a series of unsuccessful motions on his own behalf arguing that Siegler had colluded with a ring of informants to send him to death row. He sought material in the state’s file related to Beckcom, Foreman, and Walker, along with one of the informants in Herrero’s case. “Siegler went to great lengths to hide her ties to jailhouse informants in Beaumont,” Prible wrote.\nOn their own, Prible’s motions sounded desperate and conspiratorial. But Rytting took his new client’s claims seriously. “James Rytting was the first one that ever gave us hope,” Peterson, Prible’s aunt, recalled.\nPrible’s trial featured some of Siegler’s dramatic charms, which Rytting equated to the talents of a B-rate actor. She’d played up what little evidence she had in a prosecutorial style equivalent to a radio shock jock, all while apologizing for being crude. To believe Prible’s claim that he and Tirado had engaged in consensual sex, Siegler said, “you’ve also got to believe that his semen is so tasty that she walked around savoring the flavor of it in her mouth for a couple hours.”\nBut as Rytting prepared to challenge Prible’s conviction, he saw beyond the cinematic reenactments and blustery rhetoric to something far more insidious.\nAlthough several years had passed since Carl Walker learned Prible was looking for him, he remained reluctant to get involved. In early 2009, however, Rytting’s investigator managed to get Walker on the phone, documenting their conversation in an affidavit. Prible had been set up, Walker confirmed, and he believed Siegler was in on it. According to Walker, Siegler fed information about the crime to Foreman, who passed it to Beckcom, Walker, and others. As Walker understood it, Siegler was concerned about getting around Prible’s alibi: the next-door neighbor who saw Steve Herrera drop Prible off at home several hours before the murders.\nInterviews Rytting conducted with other defendants Siegler had prosecuted in the early 2000s revealed additional allegations that supported Prible’s theory and suggested that Siegler’s reliance on jailhouse informants extended beyond Beaumont.\nWilliam Irvan was housed next to Prible at the Harris County jail while they were both awaiting trial. In an affidavit, he said that Siegler had offered him a deal via his lawyer: If he informed on Prible, she would agree to a 35-year sentence. Irvan refused. Siegler went on to deploy an informant at Irvan’s trial to help convict him of a cold-case rape and murder, sending him to Texas death row, where he remains.\nIn a separate affidavit, Tarus Sales told Rytting that while in jail, he was repeatedly placed in proximity to a man he didn’t know. At Sales’s trial, the man testified for Siegler that he and Sales were great friends and Sales had confessed to murder, all of which Sales denied. Sales was also sent to death row, where he remains.\nA third man, Danny Bible, recalled seeing Beckcom at the Harris County jail in advance of Prible’s trial. Beckcom approached various men to ask about their cases, gathering notes in a folder, Bible said in an affidavit. He watched as Beckcom talked to Siegler outside court one day, handing her some papers from his folder. Bible, a serial killer who confessed to a 1979 slaying in Houston, was executed in 2016.\nAnd then, of course, there was Herrero, who was serving a life sentence based on the dubious testimony of two informants from Beaumont. Were it not for Herrero’s efforts years earlier to alert Prible to what he’d learned about the snitch scheme, Rytting might never have gone looking for information about Siegler’s use of informants.\nWith the new intel in hand, Rytting filed a petition in federal court challenging Prible’s conviction. He argued that a band of snitches inside FCI Beaumont, seeking to reduce their prison terms, had conspired to frame Prible using information that Siegler provided to Foreman. But because a state court had never addressed Prible’s informant claims, U.S. District Judge Keith Ellison paused the federal action to allow the Texas courts to weigh in. The case landed back in front of the judge who had presided over Prible’s 2002 trial.\nIn the meantime, Rytting finally arranged to meet Walker in person. On an August morning in 2010, he waited in a room at a low-level federal prison in Oakdale, Louisiana, tape recorder in hand. Walker, wearing his prison-issued khakis, strode in, sat down, and laid it all out.\nWalker was just 26 when he got popped on federal crack charges. Thanks to the racist sentencing disparity between powder and crack cocaine, he was sentenced to 30 years in prison. When Walker arrived at Beaumont in the summer of 2000, he was scared and depressed, he told Rytting, according to a transcript of their meeting. “That’s more time in prison than I’ve actually been alive.”\nSeeking solace, Walker gravitated to the prison church, where he sang in the choir. His devotion earned him the nickname “Brother Walker.” Being pious, a Houston native, and in prison for the first time put Walker on Foreman and Beckcom’s radar. It was a choice mix of factors that would signal credibility to a prosecutor vetting an informant. Foreman and Beckcom approached Walker with an opportunity, a “blessing,” he said. A guy named Jeff Prible would be coming to their unit. If Walker informed on Prible, he’d likely be able to get his sentence reduced. “That’s the pitch,” Walker explained.\nRytting intervened: Foreman and Beckcom knew Prible was coming to the unit before he arrived? “How could they possibly have known that?” he asked.\nWalker replied that he didn’t know for sure, but “from what I understand, they were all in cahoots with the prosecutor.” Foreman handed out Siegler’s number to guys at Beaumont like mints after a meal. Walker wrote the number in his address book. Siegler was worried about the case, Foreman and Beckcom told him; where evidence was concerned, she had “little to none,” and she needed a confession to link Prible to the murders.\nForeman and Beckcom gave him details of the crime, Walker said, including where the bodies were located and the fact that DNA was found in Tirado’s mouth. They also told him that while Prible had an alibi, he had supposedly returned to Herrera’s house to slaughter the family.\n“All of this was discussed before you even laid eyes on Prible?” Rytting asked.\n“Before I even seen the man,” Walker said.\nWalker was conflicted. Having been ratted on himself, he had little respect for informants, and being tagged a snitch in prison could be dangerous. At the same time, the crime Prible was accused of was heinous. If he was behind the deaths of three kids, then he deserved what was coming to him.\nWalker decided to go along with the scheme. He joined Foreman, Beckcom, and several others in befriending Prible. They staged photos with him during visiting hours. Seven of them surrounded Prible in one shot, standing in front of a backdrop illustrated with palm trees and fluffy white clouds. In another, Foreman and Beckcom smiled broadly alongside Prible, all three accompanied by family members. The idea was to show how chummy they were—evidence that could go a long way toward corroborating their account of Prible’s confession.\nBeckcom also scored some wine, expensive contraband made from commissary grape juice, and they got Prible drunk on the rec yard, trying to loosen his lips. It didn’t work; Prible got so inebriated they had to help him back to his cell. As far as Walker knew, Prible never did confess to the crime. But it didn’t really matter. They had enough details to sink him without Prible ever saying a word. “That’s the thing,” Walker told Rytting. “If I know your favorite color is blue, and I go through all this trouble to make you tell me blue, whether you tell me blue or not it still don’t change the fact that I know what your color is.”\nForeman and Beckcom instructed Walker to send Siegler a letter expressing his willingness to testify against Prible. Walker didn’t write the letter, which someone else typed up for him in the law library, but he did sign it. He didn’t know if it was ever sent because in the end, he decided to withdraw from the plot. “Can I live with knowing that I am going to openly lie about information I have no idea about and send this man to death?” Walker asked. “I concluded that I could not do that.”\nRytting told him that in Beckcom’s version of events, Prible had confessed to Beckcom and Foreman on the rec yard. “That’s bullshit,” Walker replied. There are only three things to do in prison, he said: Watch, listen, and do your time. Private conversations are generally confined to cells, not public spaces. For Foreman and Beckcom, that posed a problem, Walker said. They lived in a different housing block than Prible, so there was no way to allege they’d ever had an intimate conversation with the man. Instead, they’d have to say Prible confessed in the open, among a throng of others, which, Walker said, was nuts to anyone with any clue how prison works. “Who talks about murdering somebody when any ears in the surrounding area could hear? It’s just not logical.”\n“Prible was dead the day he hit the yard. They had already baked a cake for the man. He just didn’t know it was his birthday.”\nWalker said he’d been apprehensive about coming forward, but the situation still weighed on him. He knew there could be serious repercussions for helping someone who might be guilty—and he didn’t have any idea if Prible was guilty. “Nobody’s going to give you a pat on the back for releasing somebody who was suspected of such a horrendous crime,” he said. “And it’s not that I am looking for a pat on the back. I just don’t want something else in the back.” But the bottom line was that he believed Prible had been set up, and that was wrong. “I just know these guys is guilty of conspiring against him,” he told Rytting. “I know that for a fact. I do know for a fact that Kelly Siegler was involved.”\n“Prible was dead the day he hit the yard,” Walker said. “They had already baked a cake for the man. He just didn’t know it was his birthday.”\nBack in Houston, Rytting asked Mark Kent Ellis, the state judge who presided over Prible’s trial, to inspect Siegler’s files for any materials that should have been disclosed to defense lawyers. Among the items Harris County prosecutors handed over was a sealed envelope marked “attorney work product.” Inside were three letters from would-be Beaumont informants, including Walker.\nThe sequestered letters were strikingly similar. Each referenced previous communications with Siegler and reinforced the idea that Prible had killed Herrera in a dispute over money. The formatting was identical, and all three contained the same misspelling of Prible’s name as “Pribble,” suggesting a common author.\nAs Siegler might remember from “previous conversations with Nathan Foreman,” Walker’s letter began, he and several other guys from Houston had grown close to Prible; sharing a hometown put Prible at ease. “At first Jeff would only talk about the bank jobs he had pulled, but later he began to open up about the murders and how he did what he thought he had to do. It was business, not personal,” the letter read. “I’m more than willing to testify to these things in court. … I will help you in any way I can and would appreciate any help you could give me.”\n“Steve had screwed him out of some money so he did what he had to do,” read a letter signed by Jesse Gonzalez, who enclosed a photo of himself with Prible.\n“Pribble confided in me of Steve owing him some money from the banks they were robbing together, and how he had gone back that night to get what belonged to him,” the third letter, from a man named Mark Martinez, read. “I am more than willing to testify to these things in court.”\nMartinez later told his prison counselor that “some dudes” at Beaumont had “been pressured” to write letters to Siegler. He neither wrote nor signed the letter, he said, but would not elaborate. The counselor confirmed that Martinez’s signature did not match the one on the letter he purportedly signed, according to a defense investigator’s affidavit.\nRytting tried to persuade the judge that the state had gone to great lengths to conceal the plot to frame Prible. Only now, with the information Walker provided and the documents discovered in Siegler’s files, were facts emerging that could prove the conspiracy. But Ellis was unmoved. While he concluded that Walker was “present during the planning of the alleged conspiracy” to inform on Prible, he quickly dismissed the revelation. Prible’s allegations were “unpersuasive” and full of “speculation,” he ruled, noting there was no evidence that Beckcom had recanted his account of Prible’s confession.\nAfter an unsuccessful appeal, Rytting prepared to revive his case in federal court.\nChapter 4: Show on the Road\nTNT aired the inaugural episode of its first reality show, Cold Justice, in 2013, starring Siegler and former crime scene investigator Yolanda McClary. Produced by Law & Order creator Dick Wolf, the pilot investigated the case of a woman in Cuero, Texas, who died of what appeared to be a self-inflicted bullet to the head. In the span of a week, Siegler and her co-stars concluded that the woman had actually been killed by her husband; he was charged and pleaded guilty to murder.\nCold Justice was a hit. Fans were drawn to Siegler and McClary for their gumption, expertise, and empathy toward victims’ families. Critics liked that the series focused on small towns rather than big cities. “Siegler and McClary are attractive and photogenic, yet never ham it up on camera or glamorize their jobs,” one reviewer wrote. “They’re eminently professional.”\nThe show was Siegler’s idea. In her years as a Harris County prosecutor, she had served on a committee that reviewed cold cases across the state. “I realized that a lot of these agencies have cases that are really close to being solved,” she told Texas Monthly. “That’s where the idea started, and after I left the DA’s office, I tried to sell it to a couple of people out in the LA world, and one day I got hooked up with Dick Wolf. … He immediately loved the idea.”\nThe real-world impact was mixed from the start. After the pilot aired, an article titled “Lukewarm Justice” was printed in the professional journal of the Texas District and County Attorneys Association. Authored by the DA who handled the Cuero case, he described how the publicity created a nightmare when it came to selecting a jury, leading to a mistrial. While he praised Siegler and her co-stars, he was disgusted with the producers, who refused to push the air date until after the trial. “‘Justice’ was out the window and ‘cold’ was all that remained,” he wrote.\nCoverage of the show steered clear of such controversies. In interviews, Siegler pushed the lesson she wanted audiences to take from her work. If Cold Justice had a mantra, she said, it was: “There is nothing wrong with circumstantial evidence cases, oh my God! People, would you quit thinking that!”\nBy the time Cold Justice finished its third season, however, Siegler and TNT were facing the first of several defamation lawsuits. A man Siegler accused of murdering his wife, who was later acquitted, alleged that the show used coercive tactics by telling the local DA’s office that the episode would not be televised if the DA declined to seek an indictment. The producers denied the allegation, and the lawsuit was eventually dismissed. (To date, the other defamation suits have also been unsuccessful.)\nIn another episode, a Georgia prosecutor decided to move forward with the case Siegler assembled only for a judge to issue a scathing ruling years later, dropping all charges against the defendants and barring the state from pursuing them in the future.\n“It is doubtful defendants would have ever been charged based on the record of this case in the absence of interest from a California entertainment studio 10 years after the crime was committed,” the judge wrote. The studio profited from the “scandalous allegations” but had “no burden of proof in a court of law,” he continued. “This order is the outcome that results naturally when forensic inquiry and the pursuit of truth are confused with entertainment.”\nTNT canceled Cold Justice after the third season. After a brief hiatus, the show found a new home on Oxygen as part of the network’s pivot to true-crime programming.\nIn the meantime, Siegler’s record in Texas started to come under scrutiny for the first time. In July 2015, a district court overturned the conviction of David Temple, the high school football coach Siegler had put on trial for killing his pregnant wife. The judge found that Siegler had withheld evidence dozens of times in violation of Brady v. Maryland, a landmark Supreme Court decision requiring prosecutors to turn over exculpatory evidence to the defense.\nSiegler’s justification of her conduct was almost as stunning as the violations themselves. “Of enormous significance,” the judge wrote, was her testimony insisting that she was only obligated to turn over exculpatory evidence that she believed to be true.\n“If Kelly’s bizarre interpretation … were ever to be the law, then all a prosecutor would ever have to do to keep any witness statement away from the defense is say, ‘Well, I didn’t believe it,’” Paul Looney, an attorney who worked on the Temple case, told the Houston Press. “If Kelly Siegler’s a lawyer in five years, I’ll be shocked.”\nBefore long, Siegler’s conduct in other cases was being questioned. The Houston Chronicle published a story citing similar allegations in the death penalty case of Howard Guidry. “Here it is—the same patterns and practices,” Guidry’s lawyer told the paper. She argued in court that Siegler had withheld critical evidence from Guidry’s trial attorneys, including fingerprints found at the crime scene that belonged to someone other than their client. Guidry’s appeals have since been denied.\nFor Prible and his neighbors on death row, the questions suddenly swirling about Siegler’s conduct were woefully overdue. While Siegler was promoting Cold Justice to a friendly press, an incarcerated writer at Polunsky named Thomas Whitaker published a sprawling series about Prible’s case on his blog, Minutes Before Six, with the help of supporters on the outside. Drawing on case records as well as conversations with Prible, Whitaker wrote in exhaustive and vivid detail about Prible’s legal saga.\nWhile Siegler was basking in TV stardom, Prible was languishing, talking about his case to anyone who would listen. “I’ve watched his mental state deteriorate over the years,” Whitaker wrote. He recalled hearing thumping from outside his cell, only to discover that Prible had been slamming his head against the wall. “That is how I see him in my mind’s eye these days, alone, on his hand and knees, the wall splotched crimson, a dull knocking sound echoing down the run. And no one, no one, is listening.”\nChapter 5: Ticket Out of Jail\nAs Rytting peeled back the layers in Prible’s case, he became convinced that it was inextricably linked to that of Hermilo Herrero. Herrero’s innocence claim had gotten a temporary boost in 2005, when Jaime Elizalde, Herrero’s friend on Texas death row, gave a sworn statement confessing to being the real killer in the case. Elizalde later pleaded the Fifth, refusing to answer questions on the matter in court. He was executed in 2006. But the records Rytting obtained supported what Herrero had long suspected: that he and Prible were set up by the same ring of Beaumont informants. Rytting took on Herrero’s case pro bono.\nSome of the most important records were related to Jesse Moreno, the star witness at Herrero’s trial. As it turned out, it was Moreno who gave Siegler Foreman’s name in the first place. Moreno had a history of cutting deals with the state. In 1997, while he was serving a federal sentence for drug crimes, Siegler put him on the stand to testify against another man on trial for murder. Siegler wrote a Rule 35 letter on Moreno’s behalf, but it did not result in a sentence reduction.\nIn 2001, Moreno got back in touch with Siegler while at Beaumont, reminding her of his previous assistance, which he felt had gone unrewarded, and offering “some info that can be helpful for you on an unsolved case.” In a tape-recorded, in-person conversation that July, he told Siegler that Herrero had confessed to him more than a year and a half earlier, in 1999. Foreman and Rafael Dominguez were both present for the confession, he said. There was one problem: Foreman wasn’t at Beaumont in 1999.\nBy the time Moreno took the stand at Herrero’s trial, Foreman had disappeared from his account of Herrero’s confession. Meanwhile, Dominguez, the second informant Siegler called as a witness, testified that Foreman was present for two subsequent confessions by Herrero.\nAlthough Siegler told jurors that Moreno had put his life on the line to share what he knew, Moreno testified that he didn’t have much of a choice: Herrero had put a hit on him after discovering that he had assisted authorities in other cases. The threat was so dire that Moreno was put in protective custody and eventually transferred away from Beaumont. Cooperating with Siegler in the hopes of receiving a time cut was the only way to get out of federal prison alive, Moreno said. “Either that or I’m dead.”\nBut memos Rytting obtained from the Bureau of Prisons dismantled this story. Records documenting Moreno’s transfers made no mention of Herrero, suggesting instead that Moreno feared for his life because he’d crossed a prison gang for which he’d been smuggling drugs. He was shipped out of Beaumont after cooperating with officials investigating the illicit activity. As Rytting later argued, Siegler allowed “false and misleading testimony from Moreno about when and why he decided to turn state’s witness against Herrero.”\nAs he worked to untangle the web of informants, Rytting realized he needed help and enlisted a civil lawyer named Gretchen Scardino. Born and raised in Texas, Scardino had worked on death penalty litigation as a summer law clerk at the California State Public Defender’s Office. “My eyes were opened enough to know that I didn’t know what I was doing and that I might be getting in over my head,” she recalled. After graduating law school, she turned to civil practice.\nBut the desire to return to capital litigation didn’t go away. She had never understood the logic behind the death penalty, that punishing someone for murder should mean committing murder in response. She’d also learned from a young age that deadly violence was rooted in complex problems, and those who killed were often vulnerable themselves. A family friend had murdered his parents after becoming schizophrenic. “Knowing him before he became mentally ill and before he did this crime probably had a pretty big effect on me as a young person,” she said.\nPrible’s case was Scardino’s reintroduction to death penalty work. She started out by reading the case record and trial transcripts. “I really thought that there must be a volume of the transcript missing,” she recalled. “I couldn’t believe that someone could be convicted of such a horrible crime and sentenced to death based on what I had seen.”\nAlthough the Prible case presented a steep learning curve, her lack of experience also served her well: Unlike civil litigation, which involves obtaining large amounts of discovery as a matter of course, in federal death penalty appeals, “you don’t automatically get discovery,” she said. A judge has to grant permission every step of the way. But Scardino didn’t know this at the time. “I just approached it as, ‘Let’s ask for everything that we would ask for if it was a regular civil case,’” she said. “And that’s kind of what broke it open.”\nIn early 2016, a critical piece fell into place. After leaving Beaumont, Foreman had been sentenced to decades in state prison. Thirteen years after his role in the snitch ring first came to light in a chance encounter between Walker and Herrero, Foreman decided to talk. The result was a pair of affidavits, one in Prible’s case and one in Herrero’s.\nThe affidavits did not address whether Foreman had been the leader of the snitch ring, as Walker described. But contrary to the claims made by the informants in both cases, Foreman said he never heard either man confess. “Prible did not brag in my presence about killing an entire family,” Foreman said. “Prible did not tell me that he was the kind of man who can go in a house and take out a whole family and come out clean or say that he was a bad motherfucker.” When Prible talked about Steve Herrera, “he talked about him like he was a friend he had lost.”\nForeman confirmed something Walker said: that men incarcerated at Beaumont joked about how Prible would be their “ticket out of jail.” Although Prible discussed his case with Foreman, “I learned information about his case from Kelly Siegler too,” he said in his affidavit. She “knew that FCI inmates wanted to testify against Prible in return for help getting their federal sentence reduced.” According to Foreman, his first meeting with Siegler took place in August 2001. “I think it was before I even met Prible,” he said.\nSoon afterward, Prible’s attorneys asked U.S. District Judge Keith Ellison to order the Harris County DA’s office to hand over any trial material that was “withheld from the defense on the basis that it is work product, privileged, or otherwise confidential.” The DA’s office eventually agreed to submit hundreds of pages to Ellison for a determination on whether they should have been disclosed.\nAlmost five months later, Ellison issued his order. He had identified a number of records that “possibly contain exculpatory information,” including 19 pages of handwritten notes. The notes were written by Siegler and her investigator Johnny Bonds. Some were hard to decipher, but a few things jumped out immediately. The notes confirmed that Siegler and Bonds had met with Foreman to discuss the Prible case on August 8, 2001. At the meeting, Foreman had positioned himself as an informant, offering intel about an apparent confession by Prible. One note said Prible showed “Ø remorse.”\nThe notes suggested that Foreman might not have had his facts straight. He seemed to be under the impression that Prible’s own family had been murdered. But if Siegler was skeptical at the time, there was no hint of it in the records, which showed that she met with Foreman again in December.\nThe notes dramatically undercut the scenario Siegler presented at Prible’s trial, in which Beckcom and Foreman met Prible through a casual encounter on the rec yard. In reality, Siegler had discussed the case with Foreman before Prible was even indicted. “Oh my god. I cannot believe that this has been hidden,” Scardino remembers thinking. “This puts the lie to the whole story about Beckcom and Foreman just coincidentally coming into contact with Jeff.”\nJust as damning were notes that appeared to undermine key forensic evidence Siegler presented at Prible’s trial. Prosecutors had elicited testimony from a DNA analyst who claimed that the sperm found in Tirado’s mouth had to have been deposited shortly before she was murdered. But the notes showed that Siegler had consulted a different forensic expert, the director of the police crime lab in Pasadena, Texas, whose analysis did not support the inflammatory theory she presented at trial. “Pamela McInnis—semen lives up to 72 hours,” Siegler had written.\n“So much of the trial was just this really horrific narrative spun by the prosecution,” Scardino said. In her closing argument, Siegler asserted that Prible had shot Tirado moments after forcing her to perform oral sex. But Siegler’s own notes made clear that the evidence didn’t support this.\nTo Scardino, the revelations were a bombshell. “I thought, ‘Oh wow. We’re gonna win this case.’”",
  "word_count": 7836,
  "scraped_at": "2026-02-14T13:10:07.896227"
}