{
  "article_id": "dd7da46663a5",
  "url": "https://www.thenationalnews.com/arts-culture/2025/09/15/palestine-gaza-emmy-awards-javier-bardem/",
  "title": "Gaza at Emmy Awards : Javier Bardem wears keffiyeh and Hannah Einbinder calls for  free Palestine  ",
  "date": "20250915T070000Z",
  "domain": "thenationalnews.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Spanish actor Javier Bardem made a powerful statement for Palestine by wearing a keffiyeh at the Primetime Emmy Awards.\nThe acclaimed actor, who has been outspoken about Israeli atrocities in Gaza, was nominated for Best Supporting Actor in a Limited or Anthology Series for the Netflix show Monsters: The Lyle And Erik Menendez Story.\nWhile he lost out to British actor Owen Cooper, who won for Adolescence, Bardem ensured his message was heard loud and clear.\nAsked on the red carpet by what he felt about his nomination, the actor told USA Today: “It feels good to be able to bring attention to what is really needed right now, which is Gaza.”\nPressed on why he was so resolute in his activism with regards to Palestine, he answered: “The question is, why are not we? How many hundreds and thousands of dead children do we need to see for people to wake up?”\nBardem also spoke about the advocacy group, Film Workers for Palestine, which now comprises of more than 4,500 actors, directors and producers who have pledged not to work with Israeli film institutions they say are “complicit in genocide and apartheid against the Palestinian people”.\nThe signatories also include Academy Award winners Olivia Colman, Mark Ruffalo, as well as actors Josh O’Connor, Ayo Edebiri, Riz Ahmed and Tilda Swinton.\nSunday night winner Hannah Einbinder, who won the Best Supporting Actress in a Comedy for Hacks, is also a signatory.\nThe actress, who has been nominated for all four seasons of Hacks but never won, said she had become committed to a bit where “it was cooler to lose”.\n“But this is cool too!” she shouted, then ended her speech by cursing the US Immigration and Customs Enforcement agency and saying “free Palestine!”\nEinbinder, who wore a one-shoulder sequinned Louis Vuitton dress, finished her look with an Artists4Ceasefire pin.\nSpeaking in the press room following her win, Einbinder was asked about her speech.\n“I thought it was important to talk about Palestine because it's an issue that's very dear to my heart,” she said. “I have friends in Gaza who are working as front-line workers, as doctors right now in the north of Gaza, to provide care for pregnant women and for schoolchildren to create schools in the refugee camps. And it's an issue that's really close to my heart for many reasons.\n“I feel like it is my obligation as a Jewish person to distinguish Jews from the State of Israel, because our religion and our culture is such an important and long standing institution that is really separate to this sort of ethno-nationalist state,” she added.\nEinbinder's Hacks co-star Megan Stalter also wore an Artists4Ceasefire pin. Walking the glamorous red carpet in casual jeans and T-shirt, the comedian and star of Netflix show Too Much also had “Ceasefire!” pasted on her bag.\nOther stars who were spotted with the Artists4Ceasefire pins include Presumed Innocent star Ruth Negga, The White Lotus actress Aimou Lou Wood and Abbott Elementary actor Chris Perfetti.",
  "word_count": 503,
  "scraped_at": "2026-02-14T12:12:09.976286"
}