{
  "article_id": "dd96bb28284f",
  "url": "http://www.china.org.cn/world/Off_the_Wire/2023-02/21/content_85118210.htm",
  "title": "Women World Cup hosts Australia to warm up with European champions England",
  "date": "20230221T034500Z",
  "domain": "china.org.cn",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "- 0 Comment(s)Print E-mail Xinhua, February 21, 2023\nCANBERRA, Feb. 21 (Xinhua) -- FIFA Women's World Cup hosts Australia will play reigning European champions England in a warm-up game at Brentford Community Stadium in London on April 11.\nFootball Australia (FA) on Tuesday announced that the Matildas will play the Lionesses at Brentford Community Stadium in London on April 11.\nIt will be the first time for the two teams to meet since their 1-1 draw in 2018 and will be one of the last opportunities for Australia to take on a top opponent before the World Cup, to be played in Australia and New Zealand from July 20 to August 20 this year.\n\"We are delighted to have secured a high caliber side in the Women's EURO champions, England, as part of the final phase of our preparations for the FIFA Women's World Cup 2023,\" Australia head coach Tony Gustavsson said in a media release.\n\"As one of the best teams in the world, it's a chance for us to continue to gather crucial information on our style, our play and what we will need to continue evolving ahead of July's kick off,\" he added.\nAustralia are on a six-game winning streak, including a 4-0 victory over third-ranked Sweden in November and Sunday's 3-2 win over seventh-ranked Spain.\nIn addition to the women's friendly game, Football Australia announced that its men's national team, the Socceroos, will also play England at Wembley Stadium on October 13.\nRecently reappointed Socceroos manager Graham Arnold, who will become the first Australian to coach against England at Wembley, said he was relishing the challenge in the lead-up to the 2024 AFC Asian Cup.\n\"As an Australian footballer and coach, playing England at Wembley is something all footballers dream of,\" he said. Enditem\nNo comments.",
  "word_count": 300,
  "scraped_at": "2026-02-14T13:03:19.607754"
}