{
  "article_id": "dd9899b6a976",
  "url": "https://www.mercurynews.com/2024/08/28/bay-fc-makes-move-to-shore-up-depleted-goaltending-position/",
  "title": "Bay FC acquires Jordan Silkowitz from Kansas City for Kayla Sharples",
  "date": "20240828T224500Z",
  "domain": "mercurynews.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "SAN FRANCISCO — Two days before the NWSL closes its trade window, Bay FC moved to shore up its depleted goaltending position, acquiring netminder Jordan Silkowitz and $15,000 allocation money from the Kansas City Current on Wednesday for defender Kayla Sharples.\nBay FC also announced that it is attempting to sign Silkowitz, 24, to a contract extension.\nEarlier this week, Bay FC transferred goalkeeper Lysianne Proulx to Juventus Women for an agreed-upon transfer fee. In March, the club announced that Melissa Lowder had suffered a torn anterior cruciate ligament and would miss the rest of the season.\nThe NWSL’s trade window, which had been open since Aug. 1, closes on Friday. Bay FC acquired defender and Bay Area native Abby Dahlkemper, a 2019 World Cup winner, in a trade with San Diego Wave FC on Monday. Dahlkemper then signed a contract with Bay FC through the 2026 NWSL season, with an option for 2027.\nWith Emmie Allen and Katelyn Rowland splitting goalkeeping duties, Bay FC lost 5-2 to FC Barcelona Femení on Tuesday night at PayPal Park.\nIn its first 18 NWSL games this season, Bay FC has allowed a league-high 30 goals. Rowland has started 11 NWSL games for Bay FC this season after she took over starting duties in early May.\nWith a 6-11-0 record in NWSL play, Bay FC enters its game Friday at Portland in 10th place in the league standings with 18 points, one point back of the eighth and final playoff spot.\n“With the window closing this week, the club identified key players and positions that we believed were important to develop and strengthen our roster,” said Matt Potter, Bay FC head of football and interim sporting director, said in a statement. “With the departure of (Lysianne) Proulx and Melissa (Lowder) on season-ending injury, we needed to solidify our goalkeeping core.\n“With the acquisition of Abby (Dahlkemper), we now have an incredibly strong group of center backs, which contributed to this move.”\nSilkowitz was the 18th overall pick in the 2023 NWSL Draft out of Iowa State, becoming the first player from that school to be drafted into the NWSL.\nSilkowitz was loaned to Brisbane Roar FC of the A-League in Australia last season and made her professional debut in the club’s season opener against the Melbourne Victory on Oct. 15, 2023. With the Roar, Silkowitz appeared in 18 matches, earning five wins and three shutouts with 71 saves. She was recalled from her loan on March 8, 2024, ahead of the current NWSL season.\nSharples signed with Bay FC as a free agent before the 2024 season. She made her club debut in the team’s inaugural match against Angel City FC on March 17. In regular season play, Sharples appeared in 15 matches (12 starts), recording a pair of goals. She tallied her two goals in consecutive matches on April 14 against Seattle Reign FC and on the road against Kansas City on April 20.",
  "word_count": 492,
  "scraped_at": "2026-02-14T13:15:16.511418"
}