{
  "article_id": "ddc5ae05be98",
  "url": "https://www.theleader.com.au/story/9164647/foreveroos-crowned-champions-at-2025-grassroots-awards/",
  "title": "Foreveroos crowned champions at 2025 Grassroots Awards | St George & Sutherland Shire Leader",
  "date": "20260201T024500Z",
  "domain": "theleader.com.au",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "The Foreveroos, Australia's national Walking Football representative teams, have been named International Country Winners at the 2025 Grassroots Awards after competing at the World Nations Cup for Walking Football.\nSubscribe now for unlimited access.\nor signup to continue reading\nA total of 67 Australian players and more than 40 \"Roo Crew\" supporters represented Australia at Torrevieja, Spain last October, competing against 70 teams from over 30 nations.across all six categories at the World Nations Cup.\nThey included Bayside residents Steve Wade and Betty Servis who play for WalkSoccer Rockdale, one of almost 30 Walking Football hubs across NSW.\nBetty brought home silver after her team, the women's 60s, came second in the World Nations Cup against England.\nIn its citation, the WFA said, \"The Foreveroos competed in all six categories at the World Nations Cup for Walking Football. Their attitude towards the game was first class. They produced and wrote their own song and and video. In such a big country to get such a diverse group is a great achievement.\"\nWalking Football NSW Director, Nick Constantinou said. \"Not many countries filled all six categories. To field six full teams from a country so vast as ours is a massive achievement and that's why we have been recognised.\"\nWalking Football Federation of Australia (WFFA) and Walking Football NSW was formed for the purpose of promoting and developing Walking Football amongst older Australians.\n\"Walking Football is vital in getting seniors out of the house and away from the pokies; to feel part of something, sharing community values in sport, having social interaction and a yarn and a joke,\" Nick said \"It's a community sport that men and women can play together and all are equal - something that was never considered in our youth.\"\nWalkSoccer meets every Wednesday at the Jim Graham Field, McCarthy Reserve, Farr Street, Rockdale.\n\"We are up and running again this year. It's just going gangbusters,\" Nick said.\n\"We will also be holding a Seniors' Week come and try at Barton Park, on Thursday March 5. Everyone is welcome.\"\nFor details, email: rockdale@walksoccer.au",
  "word_count": 346,
  "scraped_at": "2026-02-14T12:38:25.868744"
}