{
  "article_id": "ddccadf845a9",
  "url": "https://theboar.org/2024/04/england-v-sweden/",
  "title": "The Lionesses first 2025 Euros qualifying game ends in a draw",
  "date": "20240407T094500Z",
  "domain": "theboar.org",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "The Lionesses first 2025 Euros qualifying game ends in a draw\nThe Lionesses’ first Euros 2025 qualifying match ended in a 1-1 draw, leading them to take home one point and sit in the middle of their group table.\nOn Friday 5 April, England played Sweden at Wembley Stadium. 63,428 fans attended the game with the hope of watching the Lionesses begin their qualifying campaign with a strong victory. Unfortunately, the hoped result was not achieved.\nThe England players came out to warm up in a set of training tops which had each footballer’s name in the British Sign Language (BSL) fingerspelling alphabet printed on the back. These shirts were created in partnership with the FA and aimed to remind fans of how football can be made more accessible.\nAt half time, players from the England women’s deaf football team walked out onto the pitch and were interviewed. Their achievement of winning the bronze medal at the 2023 World Deaf Championships in Brazil was recognised.\nKeira Walsh led out the Lionesses for the first time in her senior career\nKeira Walsh led out the Lionesses for the first time in her senior career. She was followed by the rest of what was a very strong starting eleven which included Lotte Wubben-Moy and Grace Clinton. Wubben-Moy has had an impressive season at Arsenal and Clinton, at just 21 years old, has caught the attention of Sarina Wiegman following her successful current loan spell at Spurs.\nFollowing the national anthem, the English players were seen congratulating young mascots who were signing the national anthem in BSL.\nThe match began dramatically; just four minutes in Arsenal’s Alessia Russo received medical treatment. She’d received a nasty cut to her shin which bled through her sock. This was quickly dealt with, however, and England went on to hold possession at their attacking end.\nAt 24 minutes Russo powered a header into the back of the net. Russo’s first goal at Wembley was assisted by a beautiful cross from Lauren James whose impressive skills were showcased throughout the match.\nThe second half disappointed English fans. The Swedish side came out strong and at 64 minutes Fridolina Rolfö equalised by utilising empty space that the Lionesses had left around the goal.\nEngland seemingly struggled to control possession – Sweden had numerous chances and fans were extremely relieved when a shot from Stina Blackstenius was just wide of the goal.\nThe match ended in a disappointing deadlock\nThere was hope that Leah Williamson would make her return to international football at Wembley, although this was not the case. This April camp is, however, Williamson’s first England camp back since her ACL injury.\nThe match ended in a disappointing deadlock; the 1-1 draw earnt both teams one point putting them behind France, but in front of the Republic of Ireland, in their group.\nThe Lionesses’ group for the Women’s European Championship qualifiers has been coined as the ‘group of death’. Their group, Group A3, includes Sweden, France, and Ireland. France and Sweden are ranked third and fifth respectively in the Fifa rankings.\nThe tens of thousands of fans that flocked to Wembley witnessed a disheartening performance from England. The last time that the Lionesses played Sweden was in the semi-finals of the 2022 European Championships; this encounter saw England win 4-0 and featured Russo’s famous backheel goal. Those in the crowd were hoping to witness a similar performance from England, but the play by the English girls was not reminiscent of that memorable 2022 game.\nFans attempted to keep spirits up – in the second half many waved their phone torches and paper aeroplanes were thrown through the stands during the game.\nPost match, England’s sole goal scorer, Alessia Russo, said that her team “must demand higher of each other”. She added: “We did get a draw. Every result and every point counts.”\nThe point on the board is somewhat of a success for England but fans were hoping for more\nWiegman echoed the words of Russo saying: “Of course I’m disappointed – because we always want to win”. She summarised the match with the comment: “I think the draw reflects how the game was.”\nThe point on the board is somewhat of a success for England but fans were hoping for more. This match has put pressure on the squad who are now preparing to face Ireland in Dublin on Tuesday 9 April – they will aim to take home three points at next week’s game and remind fans what they are capable of.\nComments (1)\n-\n2nd time:\nCaptained England at 21.https://www.englandfootball.com/england/womens-senior-team/squad/keira-walsh",
  "word_count": 765,
  "scraped_at": "2026-02-14T13:01:31.319770"
}