{
  "article_id": "ddec5ac89189",
  "url": "https://www.starsandstripesfc.com/uswnt-news/2023/11/30/23981301/usa-vs-china-2023-friendly-scouting-united-states-womens-national-team-uswnt-live-streaming-watch",
  "title": "2023 USWNT Friendly : Scouting China",
  "date": "20231130T190000Z",
  "domain": "starsandstripesfc.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "After a disappointing showing at the 2023 FIFA Women’s World Cup, the United States Women’s National Team looks to end the calendar on a positive note. Over the course of two friendlies, the program renews the rivalry with China for the first time in over five years. While the opponent is no longer at the soaring peak of yesteryear, there are some signs of an eventual return to prominence despite recent setbacks. The first match is scheduled for DRV PNK Stadium in Fort Lauderdale, Florida, a 19,100-seat facility with a Latitude 36® Bermudagrass surface; the second fixture will take place at Frisco, Texas’ Toyota Stadium, a venue that seats 19,096 spectators with drought-tolerant bermudagrass that was installed during the summer.\nUSA vs. China, 2023 Friendly: Scouting China\nThe USWNT faces off against the resurgent rival.\nThese are the 59th and 60th all-time meetings between the two teams, with the USWNT holding a 36-9-13 advantage. Ranked 15th internationally by FIFA, China crashed out of last summer’s World Cup in the group stage, losing to Denmark (1-0), defeating Haiti (1-0), and falling to eventual runners-up England in the crucial third fixture (6-1). In a more encouraging trend, Kēngqiāng Méiguī (Steel Roses) finished at third place at the Asian Games, storming through Group A with shutout victories over Uzbekistan and Mongolia, taking down Thailand (4-0), dropping the semifinal to Japan (4-3), and claiming the bronze with a 7-0 romp over Uzbekistan. However, recent Olympic qualifying results were a 2-1 loss to North Korea, a 3-0 win over Thailand, and a 1-1 draw with South Korea as the squad failed to advance to the third round.\nThe Chinese Football Association moved quickly, with head coach Shui Qingxia’s and her staff’s contracts being terminated, ending a two-year tenure. The 2022 Asian Football Confederation Women’s Coach of the Year was replaced by an “interim coaching team” for the friendlies against the United States; her successor will be selected with “careful consideration.” Wang Jun, the U-20 manager, is serving as caretaker – he recently led the U-20 team to qualification for the 2024 AFC U-20 Women’s Asian Cup.\nJun initially named a 21-player roster for the pair of friendlies, featuring a mix of familiar talents and burgeoning prospects. Five of the call-ups are based abroad, while the majority of the squad competes in the Chinese Women’s Super League. Four-time Chinese Women’s Footballer of the Year and Racing Louisville midfielder Wang Shuang remains out with an injury, having missed Olympic qualifying due to “severe” plantar fasciitis. Yang Lina was unable to join, reportedly due to COVID-19. Wu Chengshu was replaced by Celtic’s Shen Menglu.\n***\nGOALKEEPERS (3): Gao Jingyao (Changchun), Xu Huan (Jiangsu), Pan Hongyan (Beijing)\nDEFENDERS (5): Li Mengwen (Brighton & Hove Albion), Yao Wei (Wuhan Jianghan University), Wang Linlin (Shanghai Shengli), Dou Jiaxing (Jiangsu), Chen Qiaozhu (Meizhou Huijun)\nMIDFIELDERS (5): Yan Jinjin (Shanghai), Huo Yuexin (Jiangsu), Shen Mengyu (Celtic), Shen Menglu (Celtic), Wang Affang (Liaoning)\nFORWARDS (7): Wang Shanshan (Wuhan Jianghan University), Wang Yanwen (Beijing), Zhang Linyan (Tottenham Hotspur), Wurigumula (Central Coast Mariners), Tang Jiali (Levante Las Planas), Jin Kun (Jiangsu), Li Tingyingge (Shanghai)\n***\nThere are several formation options, as the front line features multiple versatile talents who can be deployed at different positions. Prior to the World Cup, Chinese players noted a physical gap between opponents and have been working on strength training, although set pieces are a regular source of dangerous scoring opportunities. Under the previous manager, the team pressed the opponent and looked to counter-attack, but Jun reportedly employs a “delicate style of play” while “not messing with the high ball.” In a recent match, North Korea was able to expose the defense with long passes and field switches in transition, finding acres of available space before crossing to open players.\nWith the absence of World Cup starter and regular number one Zhu Yu, the goalkeeper duties should fall to Xu Huan of Jiangsu, one of the top shot-stoppers in the domestic league. Standing 5’11”, the 24-year-old has quick reactions and is comfortable coming off of her line to corral crosses. Her passing is accurate from all ranges, with surprising success on balls beyond 40 yards.\nNormally a striker with more than 50 senior international goals, Wang Shanshan is also one of the country’s best centre-backs due to her size and speed. She wins headers and uses her physical superiority to keep pace with the opponent while also intercepting several passes per match. Wuhan Jiangda defender Yao Wei is an active presence who forces frequent turnovers and avoids errors when operating in possession. The 26-year-old wins a significant percentage of duels but is often beaten in the air.\nDomestic talent Chen Qiaozhu started all three matches at the summer’s World Cup. The 24-year-old covers the length of the field, being a real nuisance on defense and elusive when charging into the opponent’s box. Brighton & Hove Albion’s Li Mengwen is “a constant source of danger down the right flank,” demonstrating comfort in both phases of the game. She is a highly active attacker in the final third, advancing possession into the box with diagonal passes.\nAdding grit to the center of the formation is Shen Mengyu of Celtic, providing “seamless transition from defense to attack” while “orchestrating the rhythm of the game with deft touches and impeccable vision.” The 22-year-old wins the majority of her tackles and contributes in the final third with the occasional successful run toward the net. Her club teammate and fellow recent inductee into the senior level, Shen Menglu, has three goals and three assists this season in the Scottish Women’s Premier League. The “speedy technician” settles the ball with impeccable control and looks to break toward the middle of the field.\nTang Jiali is on loan with Levante Las Planas from Shanghai Shengli after stints with Tottenham and Madrid CFF. The 28-year-old attacker is ferocious in her pursuit of 50/50 balls and provides superb distribution in the final third, playing dangerous passes between opposing defenders. Shanghai winger Yan Jinjin is far more successful at driving deep into the box and centering instead of playing in crosses from the wing. She has found the back of the net several times over the past few months, capable of scoring in a variety of ways.\nRelative youngster Zhang Linyan joined Tottenham on loan this season from Wuhan Jianghan University, a few months removed from claiming the Golden Ball in the Swiss Super League with Grasshoppers. Described as an “accomplished dribbler who is happiest on the left-hand side” of the formation, the diminutive 22-year-old forward displays agility when darting around opponents and latching onto long balls played behind the back line. Coming off a goal against Thailand during Olympic qualifying, there could also be an opportunity for Central Coast Mariners striker Wurigumula to make an impact. Coaches cite her as someone who “gets on the end of passes and is clinical around the box.”\nThe rivalry lacks the vim of past decades, as both programs are far from their respective peaks. However, a resurgence is always right around the corner in international football, particularly for a USWNT with a new manager to impress. The two friendlies should provide both squads with the opportunities to test out different players and lineup combinations, although only one has an eye on the upcoming Olympic Games.\nThe first match is scheduled for Saturday, December 2nd at 3:00 p.m. Eastern, 12:00 p.m. Pacific. Viewing options include TNT, Telemundo, Universo, Max, Peacock, and FUBO TV (free trial).\nThe second match is scheduled for Tuesday, December 5th at 8:00 p.m. Eastern, 5:00 p.m. Pacific. Viewing options include truTV, Universo, Max, Peacock, and FUBO TV (free trial).",
  "word_count": 1278,
  "scraped_at": "2026-02-14T12:40:33.350158"
}