{
  "article_id": "ddf2ad092f45",
  "url": "https://punchng.com/netanya-win-after-ebis-u-turn-on-penalty-decision/",
  "title": "Netanya win after Ebi U - Turn on penalty decision",
  "date": "20240424T001500Z",
  "domain": "punchng.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Nigerian legend Onome Ebi had to change her mind about not taking penalty kicks as she converted one to secure a win for Bnot Netanya against Ironi Nir Ramat in an Israeli Ligat Al Women match at Shapira Training Ground, Netanya over the weekend.\nThe 40-year-old clinically slotted home from the spot with four minutes left of regulation in the relegation playoff and took to her Instagram page to share her excitement and experience of taking the bull by the horns.\n“A decisive penalty kick yesterday. After a very long time of deciding not to take penalty kicks, I just had to do it yesterday (Saturday) for the team,” the Super Falcons captain said, alongside pictures of her celebrating the goal with her teammates.\nBnot Netanya are currently trying to save their season in third place in the four-team standings with 13 points, just two points more than Hapoel Ra’anana in last place. Maccabi Kishro is in pole position with 25 points, while Ironi Ramat is second with 17 points.\nNext for Ebi and her teammates in the Israeli women’s topflight is a home game against Hapoel Ra’anana on Wednesday at the Shapira Training Ground.\nEbi joined the club recently from Naija Ratels, the Nigeria Women’s Football League club with whom she started the season, playing a leading role.\nThe Delta-born, who in 2023 became the first African footballer, male or female, to play in six FIFA World Cup Tournaments, is saddled with same responsibility at her Israeli club, which is why she had to take the decisive penalty in Friday’s game.\nShe joined the club with a wealth of experience from playing for Omidiran Babes, where she started her professional career, and played from 2001 to 2008 before also donning the colours of Piteå, Djurgården, Düvenciler Lisesispor, Ataşehir Belediyespor, Sunnanå SK, FC Minsk, Henan Jianye and Levante Las Planas.\nShe has been capped 109 times by Nigeria since 2003, mustering three goals.",
  "word_count": 323,
  "scraped_at": "2026-02-14T12:41:57.543632"
}