{
  "article_id": "de0c7b5a82a5",
  "url": "https://www.jdsupra.com/legalnews/gold-dome-report-legislative-day-31-5417478/",
  "title": "Gold Dome Report - Legislative Day 31 - March 2025 | Nelson Mullins Riley & Scarborough LLP",
  "date": "20250315T014500Z",
  "domain": "jdsupra.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Blood rolled in the streets at the Georgia State Capitol on Thursday — the LifeSouth Bloodmobile, to be exact. While some lawmakers and lobbyists chose to voluntarily give the gift of life, for others, it was a painful reminder of the involuntary bloodletting often experienced as the legislature speeds toward Sine Die. With the increasing evisceration of agendas to gutting of bills, the Ides of March are always feared under the Gold Dome. And no one is safe or happy about it, save the wacky waving inflatable arm-flailing tube man out front.\nThe House and Senate took up short Rules Calendars on Legislative Day 31 before departing for a four-day weekend. Catch up on the floor action and start of the Senate Appropriations Committee’s review of the FY 2026 State Budget in this #GoldDomeReport.\nIn this Report:\n- Floor Action\n- Committee Notes\n- New Legislation\n- What’s Next\nFloor Action\nThe House took up the following measures on Legislative Day 31:\n- SB 81 - Motor Vehicle Franchise Practices; protection of consumer data in motor vehicle sales; provide (RegI-Powell-33rd) Brass-6th - PASSED 165-5\n- SB 138 - Incorporation of Municipal Corporations; transition of certain services related to newly incorporated municipalities in certain counties; provide (IGC-Efstration-104th) Dixon-45th - PASSED 96-69\n- SB 139 - City of Mulberry; change the corporate limits of the city (IGC-Efstration-104th) Dixon-45th - PASSED 96-74\n- SB 144 - Fertilizers or Pesticides; a manufacturer cannot be held liable for failing to warn consumers of health risks above those required by the United States Environmental Protection Agency; clarify (A&CA-O'Steen-169th) Watson-11th - PASSED 101-58\nThe Senate took up the following measures on Legislative Day 31:\n- HB 81 - Interstate Compact for School Psychologists; enter into (ED&Y-20th) Ballard-147th - PASSED 48-2\n- HB 167 - Game and fish; authorize fluorescent pink hunting outer garments (NR&E-49th) Hagan-156th - PASSED 50-0\nCommittee Notes\nHouse Agriculture and Consumer Affairs Committee\nChairman Robert Dickey (R-Musella) and the Agriculture and Consumer Affairs Committee met on Wednesday morning and among the items discussed were the following:\n- SB 98, authored by Senator Bill Cowsert (R-Athens), amends Titles 29 and 53 to address responsibilities of county guardians and county conservators. It corrects a “glitch” in law so that rather than the guardian overseeing financial affairs it will allow a county administrator to serve as an ex officio as a county conservator. There were no questions and the legislation received a DO PASS recommendation, moving it forward to the House Rules Committee.\n- SB 201, authored by Senator Larry Walker, III (R-Perry), addresses recovery efforts that consumers/Georgians encountered after Hurricane Helene — particularly around individuals who offered services through unscrupulous contracts. His legislation amends O.C.G.A. 10-1-393 and addresses contracts consumers may enter into after disasters are declared. It seeks to allow a homeowner the ability to cancel a contract within one year of a natural disaster when the contractor has failed to substantially commence work on the contracted services within one year of the execution of the contract; completing all or a portion of the agreed upon services in a substandard manner; or entered a contract with the homeowner whereby the homeowner assigned insurance proceeds to the contractor. This legislation received a number of comments, particularly from lawmakers who have districts in the area of the state most impacted by Helene, and then received a DO PASS recommendation, moving the legislation forward to the House Rules Committee.\nHouse Regulated Industries Committee - Occupational LIcensing Subcommittee\nRepresentative Buddy DeLoach (R-Townsend) and the Occupational Licensing Subcommittee swiftly took action on these measures on Wednesday:\n- SB 125, authored by Senator Larry Walker, III (R-Perry), decouples the experience and licensure exam requirements for professional engineers in O.C.G.A. 43-15-9. It will allow engineers to sit for their professional engineering exams before completing their field experience requirements. This bill also received a DO PASS recommendation by the subcommittee, moving it forward to the House Rules Committee.\n- SB 131, authored by Senator Mike Hodges (R-Brunswick), addresses the establishment of a healthcare data system within the Georgia Board of Healthcare Workforce. Chet Bhasin, the executive cirector for the Georgia Board of Healthcare Workforce, spoke to the measure outlining that the data to be captured and posted will provide more information to healthcare planners. Among data points will be age, gender, ethnicity, license type, and location of practice. It will be established in O.C.G.A. 49-10-8. There will be no personal information posted, but it will allow the Georgia Board of Healthcare Workforce to collaborate with the various licensing professional boards to obtain this information. Representative Lee Hawkins (R-Gainesville) asked about geo access as it relates to provider networks (he asked if perhaps an identifier could be used when providers may have multiple office locations). There were no public comments, and the legislation received a DO PASS recommendation, moving it forward to the House Rules Committee.\nSenate Health and Human Services Committee\nThe Senate Health and Human Services Committee, chaired by Senator Ben Watson (R-Savannah), met on Wednesday afternoon to consider the following measures:\n- HB 329, authored by Representative Scott Hilton (R-Peachtree Corners), amends Title 43 to authorize certified nurse practitioners and physician assistants to perform artificial insemination. Under the bill, certified nurse practitioners and physician assistants are permitted to perform this procedure only if they have been delegated the authority by a supervising physician or surgeon, who must be physically present during the procedure.\nRepresentative Hilton presented the bill to the committee, which recommended the bill DO PASS and be sent to the Rules Committee without discussion. Senator Kay Kirkpatrick (R-Marietta) will carry the bill in the Senate.\n- HB 506, authored by Representative Scott Hilton (R-Peachtree Corners), amends Title 49 to provide Medicaid coverage for tobacco cessation treatment. This includes coverage for any FDA-approved medications for tobacco cessation when prescribed, as well as individual, group, and telephone counseling as recommended by the United States Public Health Services Guidelines or the United States Preventive Services Task Force.\nRepresentative Hilton presented the bill to the committee, noting that the cost to the state will be de minimis. Senator Larry Walker (R-Perry) asked about exactly how much cost is expected. Brandy Sylvan of the Department of Community Health said that Medicaid already covers most of these products but the bill resolves some prior authorization issues, and the total statewide spend for tobacco cessation is currently around $200,000 and not expected to increase dramatically. In response to a question from Senator Chuck Hufstetler (R-Rome), Chairman Watson pointed to a supporting document that stated that smoking causes $700 million in direct costs to Georgia Medicaid each year. The committee recommended the bill DO PASS and be sent to the Rules Committee. Senator Shawn Still (R-Johns Creek) will carry the bill in the Senate.\n- HB 584, authored by Representative Jesse Petrea (R-Savannah), amends Titles 26, 31, and 37 to reassign licensing and oversight of drug abuse treatment and education programs, narcotic treatment programs, community living arrangements, and adult residential mental health programs from the Department of Community Health to the Department of Behavioral Health and Developmental Disabilities (DBHDD).\nRepresentative Petrea presented the bill to the committee as a substitute which amends existing law about where complaints are filed for the services for which licensure is being moved, which was missed in the version of the bill that passed the House. In response to questions from Senator Larry Walker (R-Perry), Melanie Simon of the Department of Community Health (DCH) noted that DCH will continue to be the fiscal agent for any of the moved services that are Medicaid providers, but DCH will not conduct any facility inspections — those will be handled by DBHDD. The FY 2026 Budget, as passed by the House, reflects the movement of these entities to DBHDD. The committee recommended the bill DO PASS and be sent to the Rules Committee. Senator Bo Hatchett (R-Cornelia) will carry the bill in the Senate.\n- HB 645, authored by Representative John LaHood (R-Valdosta), amends Title 31 to repeal certain provisions requiring COVID-19 testing of staff members in long-term-care facilities. Specifically, the bill repeals Code Section 31-7-12.6, which requires SARS-CoV-2 testing for both residents and staff in long-term care facilities. The argument for this repeal is that the Centers for Disease Control no longer recommend these tests for all new hires and move-ins in these facilities.\nRepresentative LaHood presented the bill to the committee, which recommended the bill DO PASS and be sent to the Rules Committee without discussion. Senator Ben Watson (R-Savannah) will carry the bill in the Senate.\nSenate Education and Youth Committee\nChairman Billy Hickman (R-Statesboro) convened his committee on Wednesday’s committee work day. They acted on two House bills.\n- HB 105, by Representative Will Wade (R-Dawsonville), was presented by Senator Bo Hatchet (both are Governor’s Floor Leaders). This bill was brought on behalf of Governor Brian Kemp, relating to the GA State Indemnification Fund program for public school personnel and public officers. The primary provision of this legislation is to increase the indemnification award from $75,000 to $150,000 for the estate of eligible individuals. Senator Sonya Halpern (D-Atlanta) asked where the additional money came from. It’s a trust fund, and there is over $3 million in it now, so no additional funding will be required to raise the award amounts. It is rarely used. Robert Aycock spoke in favor on behalf of PAGE. The committee voted DO PASS.\n- HB 235, by Representative Rick Townsend (R-Brunswick) provides 30 days of PTO for teachers to donate organs. Other state employees were already provided for, but not teachers. Representative Townsend said that basically anyone who is eligible for TRS or ERS will now be covered. The committee voted DO PASS.\nHouse Education Committee - Curriculum Subcommittee\nThe Curriculum Subcommittee, chaired by Representative Bethan Ballard (R-Warner Robins), met on Wednesday to consider three Senate bills.\n- HB 674, by Miriam Paris (D-Macon), would have the State Board of Education adopt content standards for instruction in financial literacy and money management for grades four and five. This initiative aims to equip young learners with essential financial skills early in their education. Local boards of education are tasked with implementing this instruction starting in the 2025-2026 school year, with the flexibility to integrate it into existing courses. This was a hearing only, so no vote was taken.\n- SB 82, by Clint Dixon (R-Gwinnett) is the \"Local Charter School Authorization and Support Act of 2025.\" It aims to incentivize the approval of new local charter school petitions by local boards of education through the State Charter Schools Commission and penalizes them for denying approval of good applications. In the past five years, only one school has been approved locally, but 30 have been approved by the state. The act introduces incentive grants for local boards that approve new charter school petitions, with each approved petition eligible for a $250,000 grant annually for three years, contingent on appropriations. These grants are intended to support expenses related to charter school authorization, such as hiring personnel and providing oversight. The legislation also mandates local boards to provide written statements when denying charter petitions, detailing reasons for denial and existing school choice options. It introduces accountability measures for local boards that repeatedly deny petitions subsequently approved by the State Charter Schools Commission, potentially affecting their eligibility for charter system status renewal. The act revises existing laws, including Code Section 20-2-2064, to require local boards to act on petitions within 90 days and provide detailed denial statements within 10 days. It also amends Code Section 20-2-260 to adjust capital outlay entitlements based on approved charter petitions. Additionally, the Office of Charter School Compliance is tasked with implementing the incentive program, providing technical assistance, and preparing guidelines for evaluating charter petitions. The legislation requires the Office of Student Achievement to develop and rate public school choice options, incorporating these ratings into local school system report cards.\n14 people signed up to speak to the bill. All spoke in favor, none opposed. The GA School Superintendents Association doesn’t oppose the bill but is opposed to the language that punishes local officials for making the decisions that they want to make. Their position is that we should keep the carrot but not the stick. The committee voted DO PASS.\n- SB 123, by Senator John F. Kennedy (R-Macon), relates to compulsory school attendance, amending the law to ensure that no student is expelled solely due to absenteeism. It mandates that student attendance and school climate committees meet by November 1, 2025, and at least twice annually thereafter, with protocols to be adopted by June 1, 2026. These committees are authorized to address chronic absenteeism and are required to report on their activities. The legislation requires local boards of education to establish policies for attendance review teams and intervention plans for chronically absent students. It also revises existing statutes to replace \"mandatory\" with \"compulsory\" in attendance requirements and clarifies the roles of parents and guardians. The bill introduces a new definition for \"chronically absent\" students and mandates the creation of attendance review teams in school systems with high absenteeism rates. These teams are tasked with developing intervention plans for students and their families. Additionally, the bill provides that students taking tests and physical exams for military service are credited as present and not counted as absent. The committee voted DO PASS.\nHouse Education Committee - Policy Subcommittee\nThe Policy Subcommittee of the House Education Committee, chaired by Representative Scott Hilton (R-Peachtree Corners), convened on Wednesday afternoon to consider the following measures:\n- SB 17, by Senator Jason Anavitarte (R-Dallas) is known as \"Ricky and Alyssa's Law,\" which mandates that by July 1, 2026, all public and private schools in Georgia must implement a mobile panic alert system, known as \"Alyssa's Alert,\" to facilitate real-time coordination between various state and local first responder agencies during school security emergencies. This system is required to integrate with existing emergency services technologies, including Next Generation 9-1-1, and must be compatible with school mapping data. Schools are also required to procure detailed school mapping data, which includes building information, floor plans, and aerial imagery, to assist emergency responders. This data must be in formats that integrate with local, state, and federal emergency response software without necessitating additional purchases by these agencies. The mapping data must be verified annually for accuracy and include detailed labeling of access points, critical utilities, and emergency response aids. The Georgia Emergency Management and Homeland Security Agency is authorized to establish rules and regulations regarding the use, encryption, and secure transmission of this data. The legislation provides immunity from civil liability for schools and related entities concerning the creation and use of school mapping data, except in cases of gross negligence or bad faith. The committee voted DO PASS.\n- SB 44, by Senator Sam Watson (R-Moultrie), relating to Equalization Grants, revising the definition of \"qualified local school system\" by reducing the minimum required millage rate by reducing the minimum required millage rate from 14 mills to 10 mills. This adjustment aims to broaden the eligibility for equalization grants, which are designed to support school systems with lower property tax revenues. Additionally, the legislation stipulates a 25% reduction in equalization grant awards for local school systems that do not meet the new minimum millage rate requirement. To ensure transparency and accountability, the Department of Education is mandated to prepare an annual report detailing the initial equalization grant amounts, any midterm adjustments, and the total grants received over the previous ten years for each local school system. This report must also identify systems that received grants while having a millage rate below 10 mills. The committee voted DO PASS.\n- SB 154, by Senator Bo Hatchett (R-Cornelia), would revise references to the United States Department of Education in the Official Code of Georgia Annotated by adding the phrase “or its successor” after each reference. Representative David Wilkerson offered an amendment to make the effective date contingent upon the abolishment of the U.S. Department of Education. The author accepted the friendly amendment because it could possibly move up the effective date if the department is abolished sooner than the original effective date of July 1, 2025. The committee voted DO PASS as amended.\nHouse Special Rules Committee\nThe House Special Rules Committee, chaired by Representative Mitchell Scoggins (R-Cartersville) met on Wednesday afternoon to hear two resolutions.\n- HR 347, by Representative Brent Cox (R-Dawsonville), is a resolution urging all high schools in Georgia to establish flag football programs specifically for girls. The resolution highlights the rapid growth of flag football as a sport in the United States and emphasizes its benefits, such as fostering teamwork, leadership, and confidence among participants, while also promoting physical activity. It notes that flag football is a low-contact sport that is inclusive, with no restrictions on height or weight, making it accessible to girls of all skill levels. The resolution also points out that over 100 colleges have already established varsity flag football programs for women and girls, suggesting a growing acceptance and support for the sport at higher education levels.\n- HR 463, by Representative Sylvia Wayfer Baker (D-Douglasville), seeks to establish the month of March as Autoimmune Disease Awareness Month. This initiative aims to raise public awareness about autoimmune diseases, which affect thousands of Georgians annually, with a disproportionate impact on women and people of color. The resolution seeks to encourage early detection and diagnosis, as well as to support research and policy initiatives that improve patient outcomes. The committee voted DO PASS.\nSenate Finance Committee\nChairman Chuck Hufstetler (R-Rome) convened his committee on Wednesday’s committee work day to consider six House bills.\n- HB 111, by Representative Soo Hong (R-Lawrenceville, a Governor’s floor leader), cuts the income tax rates by 20 basis points, from 5.39% to 5.19%, effective July 1, 2025. This is a follow-up to HB 1473 from 2022, described as the largest tax cut in history, which established a schedule to cut the rate by 10 basis points each year, to reach 4.99% by 2029. This bill accelerates that to establish 5.19% as the rate for 2025 and adjusts the schedule so that the rate of 4.99% will be reached by 2027. The committee voted DO PASS.\n- HB 112, by Representative Lauren McDonald (R-Cumming), is the governor’s bill to provide income tax rebates, courtesy of the State’s $16 billion budget surplus currently on hand, $1.1 billion of which is being returned to taxpayers. Those filing jointly will receive a $500 refund, $375 for heads of household, and $250 for individual filers. The bill received a DO PASS recommendation.\n- HB 165, by Representative Lehman Franklin (R-Statesboro), amends Title 48 of the Official Code of Georgia Annotated, relating to revenue and taxation, so as to repeal and reserve an income tax credit for business enterprises for leased motor vehicles; to exempt from sales and use taxation property used in construction, renovation, and rehabilitation of affordable housing by nonprofit organizations; to repeal sales and use tax exemptions for certain admissions to view film or videotapes and the sale of certain machinery and equipment used to improve air quality. The committee voted DO PASS.\n- HB 266, by Representative Steven Sainz (R-St. Marys), allows all military retirement income to be free of state income tax. The committee voted DO PASS.\n- HB 511, by Representative Eddie Lumsden (R-Armuchee) provides for deductions from taxable income for contributions by taxpayers to catastrophe savings accounts and interest earned on such accounts. This is basically the same structure as Health Savings Accounts Works (HSA) but for homeowners of primary residences to have emergency funds to spend on disaster repairs. The committee voted DO PASS.\n- HB 586, by Representative Williamson (R-Monroe), revises the conditions under which intangible recording tax is imposed, specifically focusing on the definition and treatment of long-term notes secured by real estate. The bill modifies the existing law by extending the period for which a note is considered long-term from three years to 62 months. The committee voted DO PASS.\nHouse Energy, Utilities, and Telecommunications Committee - Energy Subcommittee\nThe Energy Subcommittee, chaired by Representative Chuck Martin (R-Alpahretta) met upon adjournment of the House Floor Session for a quick meeting to hear one Senate bill before members left for a long weekend.\n- SB 13, by Senator Carden Summers (R-Cordele), will allow the Georgia Environmental Finance Authority to finance and manage projects related to natural gas facilities. This includes revising definitions to encompass natural gas facilities within the scope of \"environmental facilities\" and \"environmental services,\" thereby allowing for the storage, supply, and distribution of natural gas through pipelines, storage tanks, and related infrastructure. The bill introduces a new definition for \"natural gas facility\" and modifies existing definitions to include natural gas alongside water, sewerage, and solid waste facilities. The subcommittee voted DO PASS, and the bill will move on to the full committee.\nSenate Insurance and Labor Committee\nChairman Larry Walker III (R-Perry) convened his committee on Thursday afternoon for the final meeting of the week before the halls emptied for the long St. Patrick’s Day weekend. They heard four House bills.\n- HB 196, by Representative Trey Kelley (R-Cedartown), relates to pharmacy benefit managers (PBMs). Representative Kelley presented the substitute to his bill (LC 57 0274S). This is a measure that the General Assembly has taken up before. It helps independent pharmacists as they are dealing with PBMs. The last measure was vetoed because no appropriation was made to cover the additional cost to the state health benefits plan. We are losing rural independent pharmacies due to business practices of PBMs. The bill creates a formula for reimbursement that will be consistent across the board for PBMs and local pharmacies by creating a ceiling and a floor. The primary objective is to ensure that reimbursements are based on a transparent, index-based pricing model, which includes the National Average Drug Acquisition Cost or, if unavailable, the Georgia Estimated Acquisition Cost and Select Specialty Pharmacy Rates, or the Wholesale Acquisition Cost. Additionally, a professional dispensing fee, not less than the fee paid by the state under Title XIX of the Social Security Act, is mandated. The legislation stipulates that insurers must calculate a beneficiary's cost share or deductible solely on the ingredient cost of a prescription drug, prohibiting the transfer of the dispensing fee cost to the beneficiary. Insurers are also restricted from bypassing these reimbursement requirements through alternative means, such as prescription drug discount cards.\nThe changes in the substitute include the addition of a definition of independent pharmacy, provisions requested by DCH for some flexibility of the floor and ceiling model, and the removal of a private right of action for enforcement. Instead, the enforcement will be with the commissioner, as with other plans. Senator Kay Kirkpatrick (R-Marrietta) asked how the enforcement mechanism will work if there is no reporting requirement [to the Commissioner] in the bill. Enforcement will be triggered by complaints. Due to the late introduction of a substitute, this meeting was hearing-only, and no vote was taken.\n- HB 197, by Representative Lee Hawkins (R-Gainesville), addresses the interaction between healthcare providers and private review agents or utilization review entities. The primary objective is to ensure that before any adverse determination regarding the medical necessity of care is made, an effort must be made to discuss the patient's treatment plan with the treating healthcare provider or their qualified designee. This discussion must occur with a clinical peer trained in a related specialty during normal working hours. The legislation specifies that efforts to contact the provider should include direct contact, implementing a callback system, or using a public website to schedule a communication if a clinical peer is unavailable. In cases where an adverse determination is made, the provider must be notified with specific reasons for the decision. Jesse Weathington spoke in favor of the bill on behalf of the Georgia Association of Health Plans. The committee voted DO PASS.\n- HB 348, by Representative Bruce Williamson (R-Monroe), was presented by Jeremy Betts, executive counsel to Insurance Commissioner John King. The bill expands lines of insurance or reinsurance in which a limited-purpose subsidiary and captive insurance company may engage. A captive insurance company is an insurance company that is wholly owned and controlled by the business or businesses it insures. This measure permits captive insurance companies to engage in any insurance or reinsurance business deemed reasonable by the commissioner, removing previous specific limitations. Senator Bill Cowsert (R-Athens) asked why captives were ever originally limited to the types of coverage they were limited to. As captives have become more sophisticated, the scope has expanded over time. This bill will allow future changes to occur at the discretion of the Insurance Commissioner versus having to continually update the code. Roughly $3 billion in premiums is paid to captive insurance companies. The committee recommended DO PASS.\n- HB 422, by Representative Derrick McCollum (R-Chestnut Mountain), requires the state employees’ health insurance plan to include high-deductible health plans and allow for payroll deductions for health savings accounts (HSAs). Representative McCollum presented the substitute to the bill, LC 55 0597 S. The committee voted DO PASS by substitute.\nNew Legislation\nThe following new legislation of interest has been introduced:\nH.B.765\nMedical Debt Protection Act; enact\nRep. Lisa Campbell (D-035)\nhttps://www.legis.ga.gov/legislation/71313\nWhat’s Next\nThe General Assembly is in adjournment on Friday, March 14 and Monday, March 17. The legislature will reconvene for Legislative Day 32 on Tuesday, March 18.\nThe House has not yet set a Rules Calendar for Legislative Day 32.\nThe Senate is expected to consider the following on Legislative Day 32:\n- HB 89 - Public Health, Department of; require healthcare providers, facilities, and pharmacies to provide the Maternal Mortality Review Committee with psychiatric or other clinical records (H&HS-50th) Cooper-45th\n- HB 223 - Revenue and taxation; exclude from the calculation of taxable net income certain disaster relief or assistance grant program payments for agricultural losses suffered due to Hurricane Helene (Substitute) (FIN8th) Burchett-176th\n- HB 90 - Revenue and taxation; increase maximum acreage to qualify for assessment and taxation as a bona fide conservation use property (FIN11th) Efstration-104th\n- HR 32 - General Assembly; increase maximum acreage to qualify for assessment and taxation as a bona fide conservation use property - CA (FIN-11th) Efstration-104th\n- SR 148 - Taiwan; recognize (Substitute) (RULES-33rd)\n- SR 245 - Collins, Doug; commend (VM&HS-51st)\n- SR 246 - President Donald J. Trump; commend (RULES-51st)",
  "word_count": 4409,
  "scraped_at": "2026-02-14T13:18:44.828968"
}