{
  "article_id": "de19b4141a7d",
  "url": "https://www.independent.co.uk/arts-entertainment/theatre-dance/features/james-graham-tories-boys-gareth-southgate-weinstein-b2563425.html",
  "title": "Playwright James Graham :  Were still living in Thatcher country  ",
  "date": "20240616T144500Z",
  "domain": "independent.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Playwright James Graham: ‘We’re still living in Thatcher’s country’\nAs his stage adaptation of ‘Boys from the Blackstuff’ transfers from the National to the West End, Britain’s leading political playwright – and busiest writer in the country – talks politics, football, Harvey Weinstein and work addiction with Ellie Harrison\n- Bookmark\n- CommentsGo to comments\nJames Graham’s output makes your head spin. More than 30 plays in the past 18 years, three TV dramas, a few films, oh, and a Broadway musical or two. There was the break-out hit This House. The lid-lifting Rupert Murdoch tale Ink. The “did he cheat?” “coughing major” drama Quiz. The Olivier-winning comedy Labour of Love. His enthralling study of media and politics Best of Enemies. This year, he’s had two plays on already: Punch, about a one-punch killing, and Boys from the Blackstuff, an adaptation of Alan Bleasdale’s agenda-setting 1982 unemployment drama. In autumn, his Nottingham-set series Sherwood is returning to BBC One. In the days after we meet, he’s flying to Germany to watch England compete in the Euros as research for Dear England, his football play (another Olivier winner) that he’s bringing back to the stage and adapting for television. Phew. Somehow, in the middle of all of this, I snatch an hour with him, aptly, in one of London’s busiest places: Piccadilly Circus. He seems to be everywhere, all at once. But his state-of-the-nation dramas are always so even-handed, so undidactic, that I’m left wondering: who is James Graham? What makes him cry? What makes him angry…?\n“Oh, I get angry all the time,” the 41-year-old says, sipping on a pint of coke and looking miraculously untired with a fresh, open face. A crisp blue shirt encases a svelte frame. “The desire to be even comes from humility – I know there must be contradictions or kinks in my logic that I don’t see, that maybe the other side do. And it’s a genuine thrill for me to be devil’s advocate and go, ‘Imagine that Dominic Cummings [who he examined in the TV film Brexit: The Uncivil War] was completely right about the European Union – what are his best arguments?’, or, ‘I think the benefit that Rupert Murdoch had on the newspaper industry is dot dot dot…’ I find myself going down some dark holes with that.”\nGraham says he’s not as easygoing as all this might imply. “I think the country’s in a terrible state,” he says. His brown eyes are glistening with feeling. “I’ve been really angry the past couple of years about the behaviour of our government, and Boris Johnson and Liz Truss, in particular, in terms of the collapse in basic standards and lying at the despatch box, which is unforgivable to me. And watching Liz Truss deteriorate into this conspiracy theorist whacko, promoting nonsense theories about why her own limited abilities are in fact to do with some left-wing conspiracy – I find the assault on truth and objective reality, for short-term political gain, very worrying and upsetting.”\nThe openness of his emotion is striking. And it cuts through when he talks about Boys from the Blackstuff, too. Bleasdale’s story follows a group of Liverpudlian road layers desperate for work, living hand to mouth. They’re hunted down by “sniffers” from the employment office who are implementing Margaret Thatcher’s crackdown on benefits. At its heart is Yosser, a father whose lack of purpose blurs into a mental health crisis, a character who became famous for his tragi-comic catchphrase, “Giz a job.”\n“Yosser is basically a right-wing Thatcherite,” says Graham. “He believes that if he works hard, he will be rewarded. When he’s instead actually punished by the system, he can’t get his head around it.” He sighs. “I find it really tragic, the more I think about it, the cruelty of Thatcher’s system.” With Rishi Sunak’s recent assault on “sicknote culture”, he says, the same “scrounger” narrative continues. “Rishi was talking about it last week, skivers versus strivers. In Boys from the Blackstuff, you have a group of people who turn up every week and say, ‘I want a job. Do you have one?’ They go, ‘No, but you need to get one, and you’re f***ing lazy and we don’t trust you because you don’t have one.’ It is national gaslighting. And that’s what sends Yosser mad.”\nLike a lot of Graham’s work, the play is rooted in the scars of Thatcherism. The writer, who grew up in a former mining village in Nottinghamshire, has found it depressing to see modern politicians fetishising the former prime minister. He says she won’t go away until we find “a new idea to replace her”. “The country started glitching when Liz Truss emerged – she was unapologetically cosplaying her in her outfits and her hair. And so was Penny Mordaunt in the debate last week. Thatcher looms large, we’re still living in her country, and there’s not been any ideological, intellectual reset from her. I’m sure when, or if, the Conservatives lose the next election, and there’s a leadership battle, they’ll still be defining themselves around whether they move closer to her legacy or try to break it. But I suspect the influence of Farage and everyone else will make people return more purely and extremely to her ideas.”\nDoes he think the Tories can recover from weeks of doomy polls and a campaign laden with PR disasters? “Anyone who writes off the Conservatives is probably a fool, because it’s the most successful political machine in the history of the world, and it will come back. I have no doubt. But it could be a really interesting slash dangerous moment. It will be hard for them to resist populism.” If they don’t, he says, they will be “uglier and more unpredictable”.\nTwo of Graham’s great loves – politics and football – are colliding this summer, with the Euros having kicked off in Germany this week. He recently announced he will update the ending of his Olivier-winning National Theatre play Dear England, about manager Gareth Southgate’s attempt to reinvent the team – and, simultaneously, its values – so is hoping, perhaps more than any other fan, that England finally bring it home this tournament. We all get a surge in blood pressure when watching penalties, but Graham’s will be through the roof.\n“It’s quite frightening,\" he admits, rubbing his brow. \"I’ve promised a new ending, and I need it to be as beautiful or more beautiful than how the World Cup ended.” The play’s original narrative focused on England getting to the quarter-finals, with captain Harry Kane missing the crucial penalty against France and “repeating the fate of his mentor” Southgate. But if we flop out in the group stages, it will be hard to find a great story in that. Graham can confirm, though, that he will be swapping Southgate’s signature waistcoat for a cardigan (Southgate recently revealed his penchant for the beige, cashmere variety in an interview with GQ). Graham jokes that he’s “been trying to make sense of the cardigans – what do they mean? Has he got softer?”.\nSouthgate didn’t go to see Dear England, in which he was played by Joseph Fiennes. “He said he couldn’t think of anything worse than watching himself played by a famous actor, which I totally get,” says Graham. But the manager did support Graham in his research, and the pair have met numerous times. “I went in hard with questions about culture and philosophy, and one of the things that Gareth instilled in me was that it is still all about winning, in the end. It’s not just, ‘Oh, let’s deal with men’s mental health because it’s a good thing to do, and it makes us feel nice, and let’s talk about history in the changing room because that’s important.’ He’s still f***ing ruthless and uncompromising. He’s said he knows if he doesn’t get a trophy he’ll have failed, and, quote-unquote, ‘all the warm and fuzzy stuff’ would pale into insignificance if they don’t win.”\nGraham has covered so much ground in his work, all in his characteristic empathetic, fair-minded way – but which project has felt the most personal? He says it has to be Sherwood. The first season of the BBC drama in 2022 centred on real murders that took place in his hometown of Ashfield, Nottinghamshire. “It felt brilliant to put the literal streets I grew up on, on screen, and people’s voices, outlook, humour and turns of phrase,” he says. “But I had to get inside the head of the person who killed my neighbour, and I was working with the real families it was based upon. They were very worried about returning to the pain of that, and not unreasonably asking questions about what the value of it was.”\nWhile he worried endlessly about whether putting Sherwood on screen was the right thing to do, Graham loved working on the show because it brought him home. On the other end of the spectrum, some seven years earlier, he had found himself in New York, in Harvey Weinstein’s office, working on a musical called Finding Neverland. The play ran on Broadway in 2015 and 2016, ending a year before the #MeToo tidal wave hit. In interviews at the time, when asked to describe what working with the disgraced movie mogul was like, Graham, politely, said Weinstein was “passionate”. Now, he struggles to find words.\nHe tugs anxiously at his left ear for a while, before eventually opening up. “I found myself, at a young age, suddenly getting commissions and writing jobs, and there was this mythology around Weinstein – he basically was Hollywood to me – so I didn’t know there was any other choice. But the first time I entered his environment, I felt a huge unease and anxiety, and I only really started to process that after the event, when he was no longer going to pop up on my phone. Once you’re liberated of that feeling, you go, ‘Oh my God, I was carrying that around. Is that why I was struggling the way I was struggling?’ And I’ve only got a small reason to feel that compared to the women.”\n“There were loads of things,” he continues, “tone, pressure, a complete lack of boundaries.” He says it was “an environment where you were never completely safe” from late-night calls and impossible deadlines. After the comparatively cosy world of London theatre, he’d assumed that “when you get to that level” and are working in New York, “you start to feel a bit bad”. “That’s definitely not the case, because there are loads of people who operate at a prestigious level who are supportive and gentle.” He says he has a strange association with the city now. “I’m like, why does everyone love New York? It’s really lonely, really hard, really tough.”\nThe last time they had any contact was after Weinstein had been charged, in 2018, but before his trial began. “I remember getting some strange group emails from his address, which I wasn’t quite sure were authentic or not, about his perceived innocence from his own point of view. Obviously, I didn’t respond to any of them.”\nIt’s easy to be dazzled by Graham’s prodigious work rate, but he recently spoke movingly on Desert Island Discs earlier this year about being a diagnosed workaholic. He revealed at one stage he had been laser-focused on work to the extent that he’d forgotten to get himself a winter coat. So intense was his schedule the year the Weinstein allegations came out, in 2017, that his plays Ink and Labour of Love were both on in the West End, at the same time, at theatres 100 metres apart. How is he coping now? “Being conscious of it is the most important thing – but just because I can intellectualise it, doesn’t mean my habits always change. I do notice still my balance is definitely not completely right in terms of allowing myself rest and relaxation, and time for people. That’s in constant flux. And maybe it will always be the case, and I just have to be accepting of that.”\nHe says the problem is that he loves writing, and it pays the bills. “It’s like being a bartender and an alcoholic. What can I do?” Later, he adds, “It can come close to killing you and certainly to destroying some of your relationships.”\nGraham, who has had relationships with men and women, would love to write more queer stories – the problem with historical and political plays, he says, is “you do end up writing about lots of very straight men in suits shaking each other’s hands”. He is sure there are stories with “radical queer politics” to dive into, but he doesn’t feel as confident writing them, “possibly because I’m such a workaholic – I’ve had such a boring life of going to bed early with my cup of cocoa”. He sits back. “But I feel lucky, I feel OK. I had a holiday in January where I did take my laptop, but I only worked like two hours most mornings…”\n‘Boys from the Blackstuff’ is on at the Garrick Theatre until 3 August\nJoin our commenting forum\nJoin thought-provoking conversations, follow other Independent readers and see their replies\nComments",
  "word_count": 2218,
  "scraped_at": "2026-02-14T12:32:46.280001"
}