{
  "article_id": "de1d908c41af",
  "url": "https://www.globalsecurity.org/wmd/library/news/russia/2024/08/russia-240821-russia-mfab01.htm",
  "title": "Briefing by Foreign Ministry Spokeswoman Maria Zakharova , Moscow , August 21 , 2024",
  "date": "20240824T114500Z",
  "domain": "globalsecurity.org",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Briefing by Foreign Ministry Spokeswoman Maria Zakharova, Moscow, August 21, 2024\n21 August 2024 19:15\n1562-21-08-2024\n- Sergey Lavrov to take part in the 10th Territory of Meanings National Educational Forum\n- Outcomes of Russia's BRICS chairmanship in the first half of 2024\n- The 6th BRICS Plus Forum of Young Diplomats\n- BRICS Solutions Awards\n- Uzbekistan's intention to join BRICS\n- AUKUS bloc\n- Ukraine update\n- Italian authorities refuse to repatriate Ukrainian children\n- Marking 80 years since Moldova's liberation from German and Romanian occupation\n- Japan marks \"end-of-war day\"\n- Statement of the German Foreign Ministry's spokesperson on the investigation of terrorist attacks at the Nord Stream 1 and Nord Stream 2 gas pipelines\n- Personal sanctions against representatives of UK think tanks\n- Some results of the completed Olympics in Paris\n- WADA criticises USADA for allowing US athletes to compete in international events\n- Prague's decision not to recognise Russian passports without biometrical chips in the Czech Republic\n- Developments in Venezuela\n- Humanitarian situation in Gaza\n- Humanitarian aid to Afghanistan\n- SCO National Centre for Public Diplomacy opens in Chelyabinsk\n- Non-Profits Without Borders comprehensive educational programme\n- The Architecture of Diplomacy photo exhibition\n- The 25th Summer Diplomatic Games\n- Day of the State Flag of the Russian Federation\n- The 16th International Military Music Festival \"Spasskaya Tower\"\n- The 9th All-Russian Cinema Night event abroad\n- Finland's military exercises\n- Remarks about the Russian Orthodox Church by the foreign minister of the Czech Republic\n- The use of Danish weapons in attacks against Russia\n- The UK boosts its military support for Kiev\n- Russia's interaction with the IAEA on the situation at the Zaporozhye and Kursk NPP\n- Latvia sells Moscow House in Riga\n- The West's support for Ukrainian terrorist attack on the Kursk Region\n- Germany's investigation into the Nord Stream blasts\n- Armenian foreign ministry's response to Sergey Lavrov's remarks\n- Vladimir Putin discusses Armenian-Azerbaijani settlement during his visit to Azerbaijan\n- Russia's mediating efforts towards signing a peace treaty between Armenia and Azerbaijan\n- Armenia's participation in the CSTO events\n- Azerbaijan's bid for BRICS membership\n- Normalising Türkiye-Syria relations and Russia's contribution to the process\n- The SCO and CSTO response to the terrorist attack against the Kursk Region\n- Power of Siberia-2 gas pipeline\n- Celebrating Victory over Militarist Japan Day End of WWII\n- Official visit by Premier of the PRC State Council to Russia\n- EAEU renouncing the dollar\n- Presidential Executive Order on support for foreign citizens sharing traditional spiritual and moral values\nSergey Lavrov to take part in the 10th Territory of Meanings National Educational Forum\nOn August 23, Foreign Minister Sergey Lavrov will take part in the 10th Territory of Meanings National Educational Forum. Let me remind you that this is an annual event, held at the Senezh Management Lab in Solnechnogorsk, the Moscow Region.\nIn his presentation, Sergey Lavrov will talk about the Russian Federation's foreign policy priorities, as well as efforts to forge deeper ties with the EAEU, the CSTO, the CIS, the SCO and BRICS and preserve the World Youth Festival's legacy. He will also have a question-and-answer session with the forum participants. We expect this to be a very interesting debate.\nThe 10th Territory of Meanings National Educational Forum offers a networking platform for motivated and talented young people from many countries, who are ready to contribute to strengthening Russia's direct ties with other countries.\nWe attach great importance to expanding youth contacts and promoting our moral values within the younger generation.\nOutcomes of Russia's BRICS chairmanship in the first half of 2024\nThe year 2024 is a special year for us with Russia acting as BRICS chair. Our chairmanship has entered a decisive phase. More than 130 events have been held at various levels across the three main cooperation areas, including politics and security, the economy and finance, and cultural and humanitarian contacts.\nA number of specialised meetings have been held as part of the political bloc, primarily, the meeting of the BRICS foreign ministers in Nizhny Novgorod on June 10-11. An extended session with the participation of representatives from the Global South and the Global East countries, as well as the countries chairing regional organizations, including Bahrain, Bangladesh, Belarus, Cuba, Kazakhstan, Laos, Mauritania, Thailand, Türkiye, Sri Lanka, Venezuela and Vietnam, was held as part of the meeting.\nOn July 12, Moscow hosted consultations between the heads of information departments of the foreign ministries from our respective countries. Prospects for deepening cooperation with an eye towards strengthening the high standing of BRICS and popularising it came under review.\nCoordination between the BRICS countries at international forums, primarily at the UN, continues to make strides. The joint theme-driven statement by the BRICS delegations on the sidelines of the sixth session of the UN Environment Assembly (Nairobi, February 26-March 1) offers a good example.\nThe BRICS Council on Anti-Money Laundering and Countering Financing of Terrorism (April and June), the BRICS Anti-Corruption Working Group (April and June), the BRICS Working Group on ICT Security (April), and the BRICS Counter-Terrorism Working Group (CTWG) ( July 22-24) were actively engaged in work on other tracks. A position paper containing recommendations for expanding cooperation on these matters was agreed upon following the CTWG meeting.\nAn international inter-party BRICS and Partner Countries- format forum with the participation of the political forces of the BRICS countries and developing countries was held in Vladivostok on June 17-18.\nThe 10th BRICS Parliamentary Forum took place in St Petersburg on July 11-12. Its extended sessions were attended by representatives from the CIS Interparliamentary Assembly member states and Chairman of the Interparliamentary Union and Speaker of the Parliament of Tanzania Tulia Ackson. The event revealed great interest in further strengthening the parliamentary component of cooperation within the association. A Protocol to the Memorandum of Understanding on the BRICS Parliamentary Forum was signed and a joint declaration was adopted.\nIn the economic sphere, the BRICS countries are discussing ways to promote sustainable development, to support the multilateral trading system, and to improve the global financial architecture.\nA number of ministerial meetings were held, including meetings of the ministers of tourism (June 20-21), sports (June 22-23), environment (June 28), youth (July 25), economy and trade (July 26), industry (August 16), as well as meetings of the presidents of supreme courts (June 19), senior officials from the prosecution services (June 18-19), heads of space agencies (May 23-24) and heads of emergencies agencies (July 10-11).\nPursuant to the decisions of the 2023 Johannesburg BRICS Summit, the BRICS countries are working on ways to create financial facilities for mutual settlements that are immune to external risks and to increase the share of national currencies in trade and investment transactions. In particular, these issues were discussed at the meetings of BRICS finance ministers and central bank governors on the sidelines of G20 events.\nThe BRICS Committee of Senior Energy Officials met in February and July to discuss promising areas of cooperation in conventional energy areas and initiatives on energy security and technology cooperation, including the exchange of best practices.\nThe first meeting of the BRICS Contact Group on Climate Change and Sustainable Development initiated by the Russian Chairmanship was held in early April, and its participants confirmed interest in establishing the BRICS Climate Research Platform spearheaded by Russia.\nAt a meeting of the BRICS Ministers of Agriculture held on June 28, the Russian initiative to create a grain trade platform was presented for consideration by the partners. It is designed to help ensure food security of the BRICS countries and, more broadly, the developing countries.\nSpecial focus goes to strengthening BRICS healthcare partnership: the first meeting of the BRICS Working Group on Nuclear Medicine was held in Moscow on February 13, and an expert meeting on launching a Comprehensive Early Warning System for the Risks of Mass Infectious Diseases in BRICS Countries was held on March 27. On June 20-21, the first BRICS Nuclear Medicine Forum was held in St Petersburg. On July 18-19, Rospotrebnadzor held an international conference, Bio-Threats and Pathogens. BRICS Response.\nOther significant results include an agreement reached during the first meeting of transport ministers on June 6 to launch a regular interaction mechanism in transport. The first meeting of the heads of geological services from the BRICS countries (July 15-17) discussed prospects for forming the BRICS Geological Platform.\nAs is customary, cultural and humanitarian cooperation was highlighted. The BRICS International Film Festival (April 19-23), the Academic Forum (May 22-24), the Civic Forum (July 3-4) and many other events with the participation of experts, civil society representatives from our countries, and cultural figures have taken place on this track.\nOn June 12-23, Kazan hosted the open-format BRICS Sports Games for the first time with the participation of athletes from nearly 90 countries. The sports programme included 27 sports.\nThe BRICS summit in Kazan on October 22-24 will be the high point of the Russia Year in BRICS. We plan to continue the tradition of holding an expanded BRICS Plus/ Outreach format meeting with the participation of top officials from the leading developing countries.\nWe expect that, with the active support of our partners, the Russian chairmanship will be marked by outstanding practical results and will make a significant contribution to strengthening the position of BRICS in the international arena.\nThe 6th BRICS Plus Forum of Young Diplomats\nOn August 27-31, 2024, Ufa will be hosting the 6th BRICS Young Diplomats Forum. The forum, The Role of Youth Diplomacy in Strengthening Multilateralism for Fairness in Global Development and Security, will be held as part of the Action Plan of Russia's BRICS Chairmanship.\nOrganised by the Russian Foreign Ministry's Council of Young Diplomats, Roscongress Foundation and the Government of Bashkortostan, the event is designed to promote youth cooperation, friendship, and trust between the countries of the Global South and East and the peoples living there.\nThe participants will benefit from a rich business and cultural programme of the event. During the sessions, they will have profound discussions on international cultural, humanitarian and youth cooperation within BRICS, the group's role in the global political, financial and economic system, the global security architecture and the evolution of multipolarity.\nAbout 110 delegates from 30-plus countries are expected to attend.\nThe event will include meetings with senior officials from the Foreign Ministry and the government of Bashkortostan, prominent politicians, economic experts and public figures, winners of the BRICS Olympiads and Games, as well as opportunities to explore the history and culture of this unique region of Russia.\nOn the last day of the Forum, an official ceremony will be held to admit new members to the International Association of Young Diplomats, established in 2017 at the initiative of the Foreign Ministry's Council of Young Diplomats. The association aims to strengthen cooperation among young activists of the foreign ministries around the world, and includes more than 150 diplomats.\nAs part of Russia's BRICS Chairmanship in 2024, the Agency for Strategic Initiatives, the National Technology Initiative Platform and the Chamber of Commerce and Industry of the Russian Federation are holding BRICS Solutions Awards - a contest of technological solutions and best practices in various fields among the BRICS countries. The first contest took place in 2020 in the country chairing BRICS, and has been an annual event since.\nThe purpose of the competition is to develop a system of independent and multipolar cooperation. To do this, it is essential to create, improve and implement new technologies that meet the needs and interests of the BRICS countries.\nParticipants are to submit their projects in eight categories: New Industry and Energy, Biotechnology and National Health, Sky, Space and Communication Technologies, Artificial Intelligence and Digital Services, Climate and Environmental Technologies, Platforms and End-to-End Solutions for Government and Public Administration, Competencies and Personnel Development, Cognitive Technologies and Creative Economy.\nApplications have already been received from Brazil, Egypt, India, China, and South Africa. The New Industry and Energy category seems to be of interest to the majority of contestants, followed by Platforms and End-to-End Solutions for Government and Public Administration.\nApplications are accepted until August 30, 2024 at bricsawards.tech. Finalists and winners will be invited to a ceremony at the BRICS Business Forum, which will be held in Moscow in October 2024. The information on the winning projects will be available at the contest organisers and partners' resources.\nUzbekistan's intention to join BRICS\nThe Foreign Ministry has been monitoring statements by various countries expressing their desire to join BRICS and take part in its activities. We are receiving many questions to this effect, and there were quite a few statements on this topic as well.\nWe treat the sovereign desire by like-minded countries to deepen their cooperation with BRICS with a proper sense of respect. This forms the gist of our position on this matter, and we have openly stated that on numerous occasions.\nCommitted to strengthening its ties with the representatives of the Global Majority, BRICS follows an open-door vision. As of today, more than 30 countries have expressed interest in forging system-wide ties with BRICS, which offers a vivid example of the fact that the principles governing this format - mutual respect, balance of interests and a consensus-based approach - are very appealing.\nNew participants joined this association on January 1, 2024, and in this context we are paying special attention to ensuring that they organically integrate in all the strategic partnership mechanisms while enabling BRICS to keep moving forward at the same pace and effectively promote our cooperation.\nIn keeping with the resolutions as adopted by the BRICS leaders in Johannesburg on August 22-24, 2023, we are coordinating modalities for creating a new category for state partners and compiling a list of potential candidates for this status. The BRICS leaders will hear a report on these efforts at the Kazan Summit on October 22-24, 2024.\nLet me remind you that the agenda of the Kazan Summit includes an expanded session in the outreach / BRICS-plus format, and senior government officials from the leading developing countries will be invited to attend it. It is our hope that this event offers a good opportunity for discussing urgent international matters, including the emergence of a new world order with better justice for all, and efforts to strengthen cooperation between BRICS and the countries of the Global South and East, while enhancing their international role.\nI would like to set this vision against bloc-based discipline, mindset and framework. Why is there so much setting these two visions apart? As an association of states, BRICS is guided in its efforts by the principles of mutual respect and consensus, which rules out any attempts to dictate one's will or impose any totalitarian administrative and oversight practices. That said, there is a different kind of approach to international relations.\nFrom the outset, the creation of AUKUS, a trilateral partnership, was a malicious and dangerous undertaking, and the way it has been developing, including in terms of its submarine component, proves this.\nWe must remember that the AUKUS project is more than just a military and technology platform. I must emphasise that it offers a bloc-based framing for enabling NATO to gain a permanent foothold in the Asia-Pacific Region which will have far-reaching consequences in terms of regional stability and security. Other so-called small-geometry or exclusive associations created by the West are pursuing the same mission in this part of the world, including four so-called Indo-Pacific countries - Japan, Australia, New Zealand and South Korea. Its participants have said that they were very interested in joining AUKUS.\nThis trilateral Anglo-Saxon alliance forms the backbone for various multilateral military and political tracks as part of the US-branded concept of an Indo-Pacific Region. One thing to note here is that these formats include NATO's official representatives.\nDestructive frameworks of this kind clearly undermine and reverse the positive momentum and constructive cooperation this region has been demonstrating over several decades of peaceful development based on ASEAN-centric mechanisms for promoting stability, security and cooperation.\nIt is obvious that the AUKUS countries de facto follow a principle whereby those who are with them get everything, while all the others must abide by the law. This is not about taking decisions by consensus. Instead, they want the world order to play by their own rules, which are designed to fulfil their interests and suit their international commitments in terms of nuclear non-proliferation and export controls. This partnership raises concerns in terms of Australia's compliance with the South Pacific Nuclear Free Zone Treaty (Treaty of Rarotonga). By acting this way, Canberra effectively undermines trust towards the very concept of creating a nuclear-weapons-free zone.\nIt is quite telling that thinking experts from the AUKUS countries, who are also probably well-informed on these matters, have started voicing their concerns. There is a growing awareness that this is a major geopolitical challenge which has every chance of escalating into an unsurmountable threat to international peace and security.\nThe Kiev regime is looking for excuses that could justify its terrorist foray into the Kursk Region but can only find ever new spurious arguments, each one more absurd than the other. It does not matter that these are mutually contradictory. This is of no importance for them. They are trying to cover up the atrocities perpetrated by the Armed Forces of Ukraine (AFU) with their empty rhetoric.\nAt first, the Ukrainian officials from Bankovaya Street said they wanted to reinforce the Kiev regime's bargaining position [at would-be talks with Russia]. (In all evidence, they prefer to leave unanswered the question as to who would consent to negotiate with them after the Ukrainian outrages and acts of terror committed against Russian civilians and civilian infrastructure.) The AFU's attempt to invade Russian territory a priori precludes any possibility of talks with this junta of bandits. Yet, they were trying to impose their propaganda on the international community all the same. However, this did not last long.\nNext, Zelensky cynically declared that Ukraine's goal was to create a \"buffer zone\" in the Russian region. There was not a single Western journalist (US, UK, German, Italian, French, etc.), who would inquire, how one thing (the \"buffer zone) hang with the other (the strengthening of the bargaining position). Obviously, Zelensky wanted these \"appeals to the nation\" to boost his plummeting popularity ratings, prove his legitimacy, and get even more Western funding. Of course, all these statements are mutually contradictory and the Kiev regime's criminal scheme was doomed to a crushing defeat from the very beginning.\nIn the meantime, the US-led collective West continues to express strong support for the Kiev regime instead of sympathising with women, children and old people affected by the AFU atrocities. These expressions vary. Some allocate even more funds for the Kiev regime's continued terrorist activities, for the officials from Bankovaya and all current Ukrainian leaders. Some openly applaud to the actual terrorist attacks. Yet, it is unclear how all of this tallies with numerous laws, legislative acts and norms banning sponsorship of terrorism. The term \"sponsorship\" implies both the financing of terrorism and its political and information support.\nOn August 14, 2024, Prime Minister of Poland Donald Tusk went as far as to describe Kiev's crimes in the Kursk Region as \"self-defence\" and recognised its right to \"pursue the war in such a manner as to paralyse Russia as effectively as it can.\" This seems to echo George W. Bush's idea, which he expressed in a recent conversation with two Russian prankers, that the Kiev regime's goal is to kill as many Russians as possible.\nPresident of Finland Alexander Stubb has suggested that Ukraine had the right to defend itself without any limits using the weapons delivered by his country. On August 16, 2024, Spokesperson for Canada's Department of National Defence, Andrée-Anne Poulin, said that there were no geographical limits for the Kiev junta when using the supplied weapons. In his August 19, 2024, interview with the media, Denmark's Foreign Minister Lokke Rasmussen effectively gave the green light to Ukrainian Banderites to use Danish weapons for targeting Russian territory. By acting this way, these and other Western leaders de facto approved the bloody crimes and terrorist attacks perpetrated by the Kiev regime against civilians in Russia.\nMoreover, Kiev's curators have been pushing forward with their obsessed determination to inflict a strategic defeat on Russia, no matter the cost. According to Western media reports, British ministers have been trying to persuade their NATO allies to authorise Ukraine to use Storm Shadow cruise missiles with a 250 km range when targeting Russian territory. There have been reports saying that President of the United States Joe Biden is open to sending Kiev the JASSM cruise missiles which have a range of 400 km, while the Pentagon is allegedly working out options for using the F-16 bombers to launch these lethal weapons.\nThe fact that they have publicly encouraged terrorists operating in the Kursk Region, and the presence of foreign military hardware and mercenaries speak volumes about the direct involvement by the Kiev regime's Western allies and sponsors of this terrorist group in neo-Nazi crimes.\nAgainst this backdrop, we can understand why the Western media, for example, The Wall Street Journal, have started publishing articles with references to specific titles and offices, pretending that NATO countries have not shared any intelligence with Kiev about targets in Russia. Moreover, there were articles saying that the West did not even know anything about Vladimir Zelensky's plans. It is obvious that this is not how things stand. It does not matter how you call this. It is up to you to decide whether these were just fakes or far-fetched allegations, an outright lie or misinformation.\nAs a matter of fact, the West has landed its all-round support and authorised the invasion of the Kursk Region. NATO and primarily the Anglo-Saxons engineered these informational campaigns in the Western media in order to absolve themselves of any responsibility for the terrorist attacks perpetrated by the Kiev regime. Let me remind you that the Anglo-Saxon case law includes acts which are entirely devoted to banning the sponsoring of terrorism. Anything dealing with sponsoring, supporting or encouraging terrorism is banned for both individuals and entities, including states. Moreover, the West relied on these very provisions, wordings and definitions for many decades in order to invade other sovereign countries. I am referring to supporting terrorism by anyone. But in order to distance themselves from the Kiev regime's terrorist actions, they are using the media to create a narrative pretending that they were not involved. Of course, this does not hold water.\nIn this context, we took note of media reports published in late July 2024 on efforts by the Ukrainian government to draft a law on private military companies. It effectively offers legal status to private military companies involving foreigners. According to these reports, these proxy-structures are expected to be able to register only in regions bordering our territory. Among other things, this document will enable NATO countries to send pilots for the F-16 fighters without becoming directly involved in the conflict. Same old story. The West starts by using the Kiev regime as a tool for achieving its goals, and then does everything it needs to change the Ukrainian law in order to cover up its tracks.\nBy doing so, the West found a new way of taking part in Kiev's war crimes. If adopted, this law would contribute to further escalating the conflict and encouraging Vladimir Zelensky's regime in its terrorist activity. We cannot rule out that the Ukrainian neo-Nazis view this law as an act of absolution when using private military companies in Africa and elsewhere across the Global South. We would like to warn everyone that all foreign fighters who perpetrate terrorist attacks against our regions, and the military hardware they use, are legitimate targets for the Armed Forces of Russia. They will be destroyed. The Kiev regime's domestic laws will not shield them from this retribution in any way.\nRepresentatives of the Western media who are actually interested parties - not journalists, but players directly involved in every propaganda campaign - are currently present on Russian territory, accompanied by Ukrainian militants, in violation of the procedures prescribed in Russian laws. This is what Russian law enforcement agencies say. They have been initiating criminal proceedings against journalists who have entered Russia illegally and whose presence on Russia's territory has been confirmed by evidence and facts. In particular, reporters with the Italian state media Rai News have been caught doing this and criminal proceedings against them have been initiated. Their reports sought to create an information curtain for Kiev's terrorist activity. They interviewed a Ukrainian army serviceman, who stood in front of their cameras wearing SS stripes on his uniform (not symbolic, but very real ones). In their reports, Western journalists talked about the Armed Forces of Ukraine allegedly showing \"concern\" for the civilian population of the Russian regions. However, they failed to mention the numerous cases of residential buildings destroyed by terrorists with anti-tank mines dropped from UAVs, or the attacks on families with children who tried to leave in civilian cars. Those uninvited \"guests\" who broke into the territory of our country without appropriate documents, accreditations or visas never said a word about the true purpose of the invaders' presence on Russian soil - which is terrorism. This is not the only foray carried out by such \"journalists.\" As I said, Russian law enforcement agencies have instituted criminal proceedings on charges of illegal crossing of the state border and assured that they will continue to prosecute similar offenders.\nWe would like to warn foreign journalists that to visit Russia legally, they are required to obtain the appropriate type of visa (for foreign nationals) and be accredited by the Russian Foreign Ministry.\nAt the same time, international agencies and the media are ignoring the atrocities of the followers of Bandera who are engaged in a manhunt in Russian regions, targeting civilians including women and children, harassing them. Everyone seems to look the other way when this happens. We will do everything to make this public as widely as possible.\nOn August 15, two ambulance crew members were injured in the Belgorod Region in a targeted attack by a Ukrainian drone.\nOn August 16, the Armed Forces of Ukraine attacked a packed shopping centre in Donetsk, Galaktika. The missiles hit the building putting it on fire and injuring 11 people. The terrorists continued shelling the area, preventing firefighters and rescuers from doing their job. However, the well-coordinated work of our specialised services helped avoid casualties. On the same day, two civilians were injured by a kamikaze drone that hit a civilian car in Donetsk. Residential buildings and civilian infrastructure were damaged by shelling. On August 17 alone, 10 people were injured in the region, including two children, as a result of massive attacks by barrel artillery, and a pregnant woman was killed by a targeted strike on a public transport stop.\nOn August 16, an attack on the bridge over the Seim River in the Glushkovsky District of the Kursk Region killed two young Russian volunteers who were selflessly helping the local population to evacuate.\nOn August 18, two women were seriously injured in Shebekino and Vyazovoye in the Belgorod Region due to a drone attack. On August 19, one civilian was injured by drone strikes in the village of Borisovka, and two more people in the village of Malomikhaylovka.\nThe recent attack on a civilian car in Sudzha with an unmanned aerial vehicle proves that Ukrainian terrorists are intentionally targeting Russian civilians. A man and a woman, accompanied by their two nephews, were attempting to evacuate when the attack occurred. As a result, the children sustained injuries from a charge filled with metal beads. The boy suffered a severe skull injury, requiring an eight-hour surgery, due to shrapnel penetration. It is disheartening to wonder where international non-governmental organisations and intergovernmental structures focused on human rights, protection of children's rights, and safeguarding their health are in this situation. The girl sustained a knee injury but was fortunate to have a toy that helped protect her from more serious harm or even death. It is puzzling why the international community and the Western media, who often put photographs of suffering children on their covers, but for some reason do not see the suffering of our children and children of other nationalities. What kind of segregation is this? What kind of inhuman division of people into classes, categories and subgroups is this? The man received multiple shrapnel wounds. This is what the Kiev regime's neo-Nazism looks like.\nMeanwhile, it is not just Russian civilians who are victims of atrocities; Ukrainian neo-Nazis have long been committing heinous acts against Ukrainians as well. Recently, the Russian military documented another cynical murder of two exhausted civilians in Volchansk by the Ukrainian Armed Forces, one of whom was wounded. Instead of ensuring their safety, Ukrainian militants callously threw mines at them from an UAV when they were trying to leave the damaged building.\nThese monsters from the Ukrainian Armed Forces not only wore Nazi symbols but also racially insulted an elderly resident of the Kursk Region who had lost his way and needed assistance. Their insults were delivered in the manner of SS speech, as if the atrocity they had committed was not enough; they sought to amplify the impact. It is truly monstrous and one can only hope that such acts never occur again. However, it is disconcerting that cities like Paris, London, Rome, Brussels, Washington, New York, Ottawa, and Canberra continue not to believe that we are dealing with real murderers and terrorists. These individuals have abandoned their humanity and embrace fascist and Nazi ideologies, racism and xenophobia at their core. Only when videos showcasing these acts are widely shared on the internet, do people begin to grasp the true extent of the animalistic hatred these individuals hold towards people of other nationalities who speak their native language. These videos serve as evidence, allowing us to identify the perpetrators and their whereabouts.\nRussian investigative bodies meticulously document evidence of the numerous barbaric crimes committed by Ukrainian militants against civilians in the Kursk Region. These crimes include murder, destruction of residential buildings, capturing Russians as prisoners, physical abuse, looting, as well as terrorist attacks in other regions and strikes on the Zaporozhye Nuclear Power Plant. Those terrorists who escape the retribution they deserve in combat will be prosecuted without any statute of limitations until they suffer the inevitable punishment.\nLuckily, not all Ukrainian military personnel are blindly following the Zelensky regime's criminal orders. It transpired recently that one more group of Ukrainian prisoners said they were willing to fight Kiev as part of the Khmelnitsky Volunteer Battalion manned by former Ukrainian military personnel. Their choice to disassociate themselves from the Kiev criminals and to get on the right side of history can only be welcomed. Indeed, it is a tragedy of the Ukrainian people, but it is also a chance to rehabilitate oneself before the forefathers who defended this same land from the Nazi and fascist fiends. This is an opportunity to rehabilitate oneself before future generations.\nA recent visit to Ukraine by US senators Richard Blumenthal and Lindsey Graham has come to our attention. Following a meeting with the Kiev-based neo-Nazis and their ringleader, they told the media that the latter was \"ready to reach a strategic agreement with the United States regarding rare earth metals worth more than a trillion dollars owned by Ukraine.\" However, they failed to mention that in return for the above promises, Zelensky received proposals that got his attention, but they would be implemented at the expense of Ukrainian citizens who simply would not return home from war. This is another story about the US political elite, corruption and the Kiev regime. This is another stark demonstration of the Kiev junta's true nature, whose efforts stripped Ukraine of its sovereignty and independence, and almost all of its natural resources.\nInterestingly, at the same time the Ukrainian Rada is considering a draft law to relieve corrupt officials from punishment in the form of imprisonment in exchange for the \"compensation for losses.\" The issue is about legalising payoffs for their criminal ransacking of the country.\nThe Kiev regime continues to rewrite history like there's no tomorrow. On August 13, following Poltava, a memorial plaque was unveiled (this time it was not the American figures, not the elite alien to the history of Ukraine) in Ivano-Frankovsk in honour of Djokhar Dudayev, whose hands are wet in blood up to the elbows as a result of the armed conflict he stoked in Chechnya and large-scale terrorist activities against Russian civilians, including women and children. What will come next? Now, there's a plaque commemorating Dudayev in Ukraine. What is to be expected after that? A public garden in a Ukrainian city named after ISIS or a café named after al-Qaeda? What's next? A dead-end street name after Osama bin Laden? How low will they sink next time?\nZelensky's \"team\" is frantically looking for more bloody \"heroes\" to induct them in the \"hall of fame\" of ruthless Nazi murderers. They use just one criterion when they go about the selection. It's hatred of Russia, Russians, our history, culture, and victories. The Ukrainian Banderite regime is prepared to immortalise not just thugs, but terrorists as well, thus revealing its true nature.\nOver the past seven days alone, about 10 memorial sites to Soviet liberator soldiers were torn down in Ukraine. How about them having fought against Nazism and fascism alongside the Ukrainian heroes of the Great Patriotic War? How about their forefathers standing in these ranks alongside other heroes, or these monuments been built by Ukrainian citizens? The neo-Nazis have likewise destroyed the memorial plaques in Kharkov commemorating those who made a decisive contribution to liberating Ukraine from Nazism, including Rodion Malinovsky and Ivan Konev, as well as a monument to Alexander Pushkin in the town of Belgorod-Dnestrovsky, Odessa Region. The Ukrainian military is practicing vandalism in the Kursk Region. They will face retribution on the battlefield and criminal prosecution in court.\nOn August 13, the Ukrainian Postal Service hurried to present a stamp dedicated to the Ukrainian army's acts of terrorism in the Kursk Region which features a moment of captured Russian soldiers brought to their knees at gunpoint with the following caption \"Kneel before Ukraine.\" Importantly, the demeaning actions to humiliate our servicemen, as well as publishing these images, violate the Geneva Convention relative to the Treatment of Prisoners of War of August 12, 1949. Let me remind you that its Article 13 guarantees them protection against violence, intimidation and insults, and Article 14 guarantees the right to respect for their person and honour \"under any circumstances.\"\nThe neo-Nazi regime led by Zelensky, now past his presidential term, continues to use radicals and schismatics to carry out reprisals against the clergy of the canonical Ukrainian Orthodox Church (UOC), the largest canonical church in that country in terms of the number of its followers. Violent seizures of its religious sites continue unabated. Metropolitan Arseny, the vide-rector of the Sviatogorsk Lavra, has been held in custody for almost four months now on charges of \"espionage\" most likely \"in the interests of God.\"\nEmboldened by the silence of the specialised human rights organisations, the junta has used the entire set of dirty methods to push through the adoption in the final reading of a discriminatory law banning the UOC. Let me remind you that this is the canonical Orthodox Church. This is the true Orthodoxy. Representatives of other denominations who, in fact, serve the puppet regime - are involved in this truly satanic move authorised by Zelensky which is aimed at destroying canonical Orthodoxy by any means and expanding the gaping split in Ukrainian society along religious lines. This heinous move by the illegitimate Kiev usurpers violates the provisions of a number of international human rights documents and the laws of Ukraine. Every right of the UOC and millions of Orthodox believers in that country must be restored and the perpetrators punished. A detailed commentary on this matter was posted on the Foreign Ministry's website yesterday.\nThe above facts once again reiterate the importance of the goals of the special military operation to denazify and demilitarise Ukraine and to eliminate the threats emanating from its territory. Without a doubt, all of them will be fulfilled.\nItalian authorities refuse to repatriate Ukrainian children\nThe Kiev regime has been increasingly putting children's issues at the forefront of its foreign policy. In particular, they have been using some far-fetched stories to accuse our country of allegedly kidnapping Ukrainian children. I suggest we look at a real story involving children instead, which clearly demonstrates the Kiev regime's extreme cynicism and total disregard for the lives, health or future of its own underage citizens.\nI am referring to Kiev's decision to bring back to Ukraine the 115 children aged 6 to 17 now placed with educational centres in Bergamo (Lombardy, Italy), who were taken from orphanages in Berdyansk and evacuated to Italy in March and April 2022. The local child protection services and juvenile court appointed guardians to the Ukrainian pupils from among local residents, and took care of their education and integration in the local community. Not to mention the compassionate Italians who donated money, food and clothing.\nUkraine's Consulate General in Milan has managed to obtain an approval for the children's return to Ukraine. You might think they were going to be reunited with their families or offered some excellent opportunities, better educational or medical services. Don't hold your breath! Vladimir Zelensky's regime is a Nazi regime. As it turned out, the orphans from Berdyansk (again, they're orphans, meaning they have no parents) were supposed to be accommodated in reception centres even without basic amenities, to be subsequently transferred -\nI cannot talk about this calmly. This is not hypocrisy, this is not even dehumanisation - this is an unimaginable level of ugliness.\nRepresentatives of the Kiev regime are trying to bring these children from Lombardy back to Ukraine, to place them in substandard temporary facilities, unsuitable for children, and subsequently transfer them to the United States. This is another outrageous and hideous crime committed by the Kiev regime, which is always grandstanding for children's rights. Even the inveterate propagandists from the Italian media who have unconditionally supported the Kiev regime for years could not remain indifferent. They have not yet experienced this monstrous dehumanisation. Until now, Italians (and representatives of other countries have it coming, too) could not relate to what we have been talking about all these years because they did not have relevant experience. I wonder if this International Criminal Court - which has been issuing \"warrants\" and \"orders\" with no legal weight or grounds, linking them to Russia's alleged actions against Ukrainian figures - if it is even aware of what is happening there.\nUnder pressure from the outraged Italian public, on August 14, the local court ruled to keep the children in the reception centres where they are now while their applications for international protection are being considered. The repatriation procedures in relation to three 17-year-olds were cancelled entirely because the teenagers may face conscription for military service in Ukraine, which has been repeatedly lowering the conscription age - the Italians finally grasped the idea. We have been pointing this out since 2022.\nThis is not the first such case. The competent authorities of Catania (Sicily) are investigating a Ukrainian citizen authorised by the country's Consulate General in Naples to represent its interests regarding the repatriation of the children. She is being charged with extortion (she offered the children's guardian families her services to make the Consulate General drop the repatriation requirements for a remuneration of 2,000 to 3,000 euros) and threatening harm to their lives and health. This is what the Kiev regime is like. This is not an exception, but a hard fact confirming its essence and nature.\nIt is telling that there still has been no official reaction to these outrageous facts from the Italian authorities. Why? Ukraine has become the main story for the current Italian government. Their policy at international organisations is dominated by the help Ukraine rhetoric. Why not comment on what is happening to the Ukrainian children?\nI remember Italian officials commenting on the ICC decisions. I recall Italian state agencies' outrage at Russia's actions that allegedly wronged Ukrainian children. Well, these are Ukrainian children, too. Italian officials, please speak out. This is actually happening in your country.\nFor some reason, there have been no comments about the stories aired by Rai, one of the largest television corporations in Italy, where an Italian journalist interviews an adherent of Nazi ideology like it's normal, just talking to him as if it's no big deal, without any footnote or asterisk. There has been no reaction whatsoever. Has Italy forgotten about the atrocities the Nazis committed against Italian anti-fascists?\nI understand perfectly well why official Rome has nothing to say on this matter. Their Western bosses do not allow them to speak up. But one really has to man up and do something! Apparently, they know that all things anti-Russian are, as they say in the West, the main narrative maintained by Washington, London, and NATO as a whole. But that really needs to be changed.\nApparently, the Italian leadership is more comfortable with supporting the neo-Nazi clique in Kiev - including by sending increasingly lethal weapons and malicious propagandists to the theatre of hostilities (after all, the Rai state channel was sent there) - than with protecting the rights of underage Ukrainian children in its own country. It is high time they opened their eyes and saw what is happening.\nMarking 80 years since Moldova's liberation from German and Romanian occupation\nBut just how contagious is neo-Nazism, coupled with the Western support?\nAugust 24 marks 80 years since Chisinau's liberation from German and Romanian invaders as part of the Jassy-Kishinev (Iași-Chisinau) offensive, which took place on August 20-29, 1944. During this operation, the Soviet troops liberated the entire territory of the Moldovan Soviet Socialist Republic and went on to advance into Romania's central regions, making it impossible for Bucharest to keep fighting alongside Nazi Germany.\nBrilliant in terms of its planning and execution, this operation made it into military science textbooks. At the end of the second day, on August 21, 1944, the 2nd and 3rd Ukrainian fronts, supported by the Black Sea fleet, broke through the layered enemy defences. On August 24, 1944, they completed the encirclement of the Army Group South Ukraine, which formed the core of the German and Romanian force there. In the nine days of the operation, the Soviet troops defeated an almost million-strong enemy group and shattered the enemy defences on the southern flank of the Soviet-German front. This enabled the Soviet liberator soldiers to advance further and ultimately push the adversary out of the Balkans.\nSoviet troops demonstrated their excellent combat skills, as well as their high morale and a sense of self-sacrifice. For example, Lieutenant Alexey Shemigon and Sergeant Alexander Shevchenko replicated Alexander Matrosov's feat. Privates first class Alexander Gusev and Kuzma Gurenko died by throwing themselves under the German tanks with their grenades. All four were awarded the Hero of the Soviet Union title, posthumously.\nMoldovans went to great lengths to help the Soviet troops. From May until August 1944, guerilla groups operating in Moldova killed over 11,000 enemy soldiers and officers, destroyed 25 enemy tanks and armoured vehicles, and derailed 13 military trains.\nUnfortunately, Moldova's current regime is seeking to impose its historically revisionist vision by erasing the heroic past of the Moldovan nation. They want people to forget all about it, as if these events never happened. Maia Sandu's team keeps intimidating people by speaking about all the \"Soviet-era horrors,\" while consistently seeking to whitewash the Nazi accomplices. The republic unveils monuments to Romanian heroes, as it calls them, with military honours, while banning the St George ribbon and films about the Great Patriotic War. There has been an increase in the number of desecrated monuments to Soviet liberator soldiers, with many of them left unpunished.\nMost Moldovans view these attempts to alter the historical memory of their nation as an insult. They hold the feats accomplished by their fathers, grandfathers and great grandfathers as sacred and are not ready or willing to accept the alien ideological tenets.\nActivities by volunteer patriotic movements prove this point. They have been relying on their own resources to restore Soviet-era memorials, undertake search operations and hold commemorations. They have literally joined the ranks of those who fought fascism as guerilla fighters and civilians who resisted the Nazi occupation, and the Romanian occupation backed by the Third Reich. Today, in the 21st century, Moldovans have to assume this role as antifascist activists, even if they live in what some believe to be peaceful times.\nTo prepare the celebrations of Moldova's liberation, local volunteers cleaned up and renovated a military cemetery at the Șerpeni Bridgehead Memorial Complex, as well as several other memorials across Moldova.\nThere will be a series of commemorations to mark the anniversary of the Jassy-Kishinev (Iași-Chisinau) offensive, culminating with the Liberation March. It is scheduled to take place in Chisinau on August 24 with people marching through its streets to the Eternity Military Glory Memorial.\nThe Moldovan diaspora in Russia has been taking part in these commemorations. On August 17 and 18, 2024, a commemorative motor rally took place in Moscow, St Petersburg, as well as in the Moscow and Leningrad regions. Its participants organised flower laying ceremonies at the Moldova's Liberation monument in Moscow's Patriot Park, as well as at the Piskaryovskoye Memorial Cemetery near a monument devoted to the people from Moldova who fell while defending Leningrad during the siege.\nThe memory of the Great Patriotic War lives on in the hearts of the Moldovans. We can see this and do everything we can to support these aspirations. For many years, people thought that nothing could erase or suppress this memory. However, we now understand that sometimes you cannot do good without using your fists. This resolve among the people of Moldova means that any attempts to stage a neo-Nazi revanche in this country are doomed to fail.\nWe took notice of events held in Japan on August 15 in connection with the so-called \"end-of-war day,\" which predictably demonstrated once again Tokyo's deep-rooted revanchist sentiments.\nThe high-sounding speeches delivered by the leading Japanese politicians again failed to show even a hint at a sincere repentance (while there is so much to repent) for the aggression launched by Japan or apologise for the suffering caused to and considerable material damage inflicted on Asian states' citizens. Instead, there were just praises for their fellow countrymen, who had fallen \"on the battlefield.\"\nExploiting this highly dubious date - because, as everyone knows, World War II ended on September 2, 1945, when Japan signed the Instrument of Surrender - Japanese politicians, including three cabinet ministers and over 70 members of parliament, organised yet another mass pilgrimage to Yasukuni, a Shinto shrine and an odious symbol of militarism, where Class A military criminals convicted to death by the International Military Tribunal for the Far East are worshipped. Prime Minister Fumio Kishida again sent a sacrificial offering to the temple.\nHow similar is it to what is going on in Germany. On the same days, the FRG Defence Ministry updated the instructions on how to venerate traditions of German militarism. German servicemen have been given biographical reference on former German officers and men to be looked to. The world was aghast and terrified, when the Russian Foreign Ministry, among others, published photographs and brief biographical notes on those whom the current German military, according to the FRG leadership, should emulate. All of them are SS-men or representatives of the Third Reich, who both issued and implemented criminal Nazi orders. These are the \"heroes\" of Germany, who were awarded their iron crosses for excellence on Eastern Front battlefields. They killed Russians.\nBut let us go back to Japan. We resolutely condemn these practices. We have repeatedly emphasised that thereby Tokyo is hurting the feelings of people in neighbouring countries, who had been affected by its barbaric expansionist campaign, and shows graphically the essence of the Japanese administration's present course for an accelerated remilitarisation.\nWe would like to reiterate that by building up its military potential, Japan actually violates the effective legislative restrictions in this sphere. We also follow closely Tokyo's steps to expand its naval activity in vicinity of the Russian borders in the Far East, involve into it some extra-regional players from among NATO member states, and promote Washington's initiatives to create closed bloc associations aimed at the \"dual containment\" of Russia and China in the Asia Pacific Region.\nThere is no doubt that this Japanese foreign policy is fraught with obvious risks for regional stability and security. A matter of particular concern are the Japanese plans to \"dilute\" the national non-nuclear status by joining US \"joint nuclear missions,\" participating in multilateral military exercises involving the use of allied strategic aircraft certified to perform flights with nuclear weapons on board, or discussing the possibility of deploying US medium-range missiles on the Japanese soil.\nJapan's departure from its peaceful development posture that was reaffirmed by generations of Japanese politicians will inevitably generate new challenges to security and lead to a rise in tensions in the Asia Pacific Region, including to a new stage in the arms race.\nWe again urge Tokyo to draw lessons from the inhuman pages of its own history, recognise the results of World War II in their entirety, and renounce revanchism and the new militarisation, which once brought sorrow and suffering to world nations and Japan itself.\nNord Stream is now in the spotlight. Once again, there were a number of publications in the Western media. The UN Security Council also discussed this topic. Strange statements were made by official Berlin.\nWe cannot leave uncommented a statement the German Foreign Ministry's Spokesperson Sebastian Fischer made during the weekly news conference of the German government on August 19. He said that Berlin was exchanging with the Russian side certain information about the terrorist attacks on the Nord Stream 1 and Nord Stream 2 gas pipelines committed in September 2022. This comes as no surprise, considering that recently his boss Chancellor Olaf Scholtz said that it was Russia who stopped supplying gas to Germany, though exactly the opposite happened. As we have said many times, including in interviews with the German media (after which there were attempts to close them down), that Russia has never stopped the supply of its natural resources, meaning energy resources and gas to Germany. Moreover, even if the relevant decisions are made, it will take a month to do this technologically. Therefore, any absurdity coming from German official representatives already seems quite predictable. But we will still comment.\nPerhaps the German side made this statement to cast doubt on the validity of the claims Russia made against the German authorities, regarding their refusal to cooperate in the investigation of this crime of pan-European scale, thus (both the crime itself and Germany's refusal to cooperate) violating the relevant UN anti-terrorist conventions.\nIt must be emphasised that Sebastian Fischer's words are completely untrue. Let us put is simple, so that it would be easier to translate into German. This is a lie. For almost two years, the German side has responded to all inquiries from the Russian competent authorities regarding the bombing of the Nord Streams with nothing more than empty excuses and formal replies. Not a single paper they sent us contains any facts. It is not the first time that Berlin has tried to convince the public and the world diplomatic community that it is allegedly fulfilling all its bilateral obligations of an international nature. It is trying to \"feed\" the international community this unleashed bureaucratic red tape as proof of fulfilling its international legal obligations. This is a lie. They do not provide the Russian side with any facts they have on this investigation, although they are obliged to.\nRussia insists on holding official bilateral consultations in accordance with the current procedures envisaged in the UN anti-terrorist conventions. We would like Sebastian Fischer or his bosses, Foreign Minister of Germany Annalena Baerbock or Chancellor Olaf Scholtz, to declare their commitment to observing and implementing the UN anti-terrorist conventions. If so, then please comply with them.\nThe German Foreign Ministry spokesperson's statement only strengthens our suspicions that Berlin intends to muddle the investigation, which is being conducted in total secrecy, by not allowing it to identify the true masterminds of the attack on the largest trans-European energy infrastructure facility, which is of the utmost importance for Germany itself.\nI believe the persecution of German media outlets for trying to establish the truth about Germany's energy security shows that Berlin has something to hide. Apparently, it is not interested at all in conducting a real investigation or having the truth made public.\nPersonal sanctions against representatives of UK think tanks\nOn August 19, the Russian Foreign Ministry posted information on its official website on including representatives of nine UK think tanks in its stop list. These organisations disseminate misinformation discrediting Russia in the world information space via publicly available media and the Internet, thereby trying in vain, over many years, to create conditions for destabilising the internal political situation in Russia and the countries friendly to it. They are consistently taking part in the information campaign to support the neo-Nazi regime in Kiev.\nWe go on monitoring the subversive activities of UK authorities against our country and adding top managers of the most aggressive British propaganda outlets to the Russian countersanctions list. In response to London's hostile policy, work on expanding the Russian stop list will continue.\nSome results of the completed Olympics in Paris\nWe have received many questions regarding the Olympic Games 2024 in France. They concern the refusal to participate in them for various reasons, the segregation of athletes, the monstrous performances during the opening and closing ceremonies of the Olympic Games, and discrimination against athletes and journalists covering the Olympics. We commented on all this regularly. Summarising the questions we received, I would like to revisit this topic now.\nMillions of people on the planet were shocked by the scandalous Olympic Games 2024 held in Paris. This is how it will be remembered and go down in history, exactly as scandalous.\nYou know, the main question that politicians, leaders, heads of state and guests of honour asked themselves, among other people: why has sport (and the Olympics is indeed a holyday of sport) given way to ideology? No one even asks anymore what kind of ideology it is. It's clear that what we see is liberal dictatorship. Why was this major sporting event completely permeated with ideology? The evidence is abundant: from the denial of access to the Games for some athletes based on nationality to insults against the feelings of believers, from segregation of journalists to the politicised ideological approach linked with the invented gender issue.\nThe Games were held with serious violations and shortcomings. Everybody saw with their own eyes that the water in the Seine was unfit for swimming. On the opening day of the Olympics, there were transport disruptions, athletes complained about unreasonably Spartan living conditions in the Olympic Village and low-quality food. Scandals followed one after another.\nAs for Russian participation, many sports experts and fans agree that in the absence of the Russian Olympic team, most sports have lost their entertainment value and level of competition. The injustice, bias, ideological approach, and segregation that permeated the IOC's decisions to remove Russia from the Olympics, are evident to everybody now.\nThe IOC President Thomas Bach strictly followed the standards set by his Western supervisors. His actions have split the world sports and seriously damaged the world Olympic movement, undermined its foundations and distorted the image of the genuine Olympic movement. The IOC has deprived Russian and Belarusian athletes of their dream - to take part in the Olympic Games and represent their countries there.\nThomas Bach, together with Ukrainians, monitored Russian internet users in social networks with a view to find compromising statements. The IOC exerted psychological pressure on our athletes and subjected them to outright discrimination. There were instances when IOC representatives offered Russian sports federations to replace athletes that had received Olympic licenses with non-qualified athletes without any explanations whatsoever.\nOn top of this, Thomas Bach, a protagonist of \"new normal\" or \"neo-inclusivity\", offered anti-science, anti-social and controversial comments on gender issues, as well as dubious decisions on the admission of female boxers, who failed gender tests, and outright lies against the International Boxing Association. The admission of male and female athletes to competitions should be dealt with by specialists. However, politicised decisions and the IOC's disregard for the position of sports federations, in the opinion of many observers, created a threat to the health of some athletes, female boxers in particular. This is an outrageous case. It can be summarised that further deviation from Olympic ideals and principles will result in an even greater degradation of the world sports. This is exactly what our country talked about.\nRussia will continue efforts to develop sports and international sport cooperation, and create conditions for the participation of Russian athletes in international competitions. We will continue to insist that the IOC leadership give up its destructive anti-Russia approach and unfailingly observe the basic principles of the international Olympic movement.\nWADA criticises USADA for allowing US athletes to compete in international events\nThe Paris Olympics with all its resonance may have ended, by the turmoil surrounding the US Anti-Doping Agency (USADA) continues. WADA, the World Anti Doping Agency, has voiced serious allegations against USADA's operations.\nWADA claims that USADA violated the World Anti-Doping Code systematically by relying on a scheme whereby the athletes who failed a doping test continued to compete in exchange for reporting on other violators. According to the available information, this happened at least three times. I do not know what is actually worse: enabling athletes who breach the doping rules to compete, or forcing them to report on others, which effectively legitimises villain practices and perfidy. What is worse? There is no best option here.\nMoreover, according to the international anti-doping watchdog, 90 percent of the US athletes operate outside of the Anti-Doping Code, while a third of those who are covered by it have not been tested. In 2023, USADA collected fewer samples than the anti-doping agencies in Russia, China, Germany, France, Italy and the United Kingdom. By acting this way, USADA threatens the integrity of sporting events.\nTherefore, if all this is true, this means that there is no such thing as clean sports in the United States as far as doping is concerned and that the American athletes did not play fair when earning their titles.\nWe believe that all countries must have equal rights to develop sports and compete free from any discrimination or double standards.\nPrague's decision not to recognise Russian passports without biometrical chips in the Czech Republic\nThe Czech authorities decided not to accept Russian passports which lack a biometrical chip, adding one more item to the list of discriminatory measures targeting Russia and once again demonstrating their openly Russophobic approaches. In this case, ordinary Russians who do not perform any official duties or enjoy any additional preferences as holders of official or diplomatic passports, were the primary target.\nAccording to the Czech Foreign Ministry's explanations, the local authorities have initially designated September 15, 2024, as the deadline for the Russian citizens who are in their country to obtain Russian international biometrical passports. They have now extended this deadline until December 31. However, Prague made this move with the intention to create additional problems for many Russians facing this issue.\nIn fact, the Czech Republic has gone to great lengths over the past years to make it harder for Russian foreign missions to work in the country by ordering us to close two consulates general and to significantly reduce the headcount at the Russian Embassy in the Czech capital. Of course, all this affected consular services.\nThe Russian diplomats and consular workers have been doing everything to shield from these negative developments Russian citizens and nationals from other countries who need consular services, visas, to certify their documents or get timely assistance for addressing their pressing needs. However, as you can imagine, the purposeful effort to reduce the headcount, including at the consular missions, could not fail to impact our ability to work in a timely and effective manner. And impact it did. This much is obvious.\nWe continue to closely monitor the developments inside and around Venezuela after the presidential election held on July 28. According to objective data, the situation in the country remains generally stable, the post-electoral process is developing within the legal framework, and the Bolivarian authorities ensure the protection of the constitutional and public order.\nAgainst this background, we can see coordinated external pressure on Caracas increasing, with the use of a wide range of tools to delegitimise the voting results. Is this happening for the first time? Of course not. As Jorge Rodriguez, President of the National Assembly of Venezuela and head of President of Venezuela Nicholas Maduro's election campaign remarkably said, it is not the election in Venezuela that displeases the West, but its results. You can hold elections as many times as you like, but until the West gets the result it needs, it will not calm down.\nTo be displeased with the results is a typical reaction of those who lost. However, it is a completely different scenario when it comes to not recognising the results of the vote and encouraging aggressive actions and clashes with law enforcement agencies in order to change power, which the world has seen many times. This is the scenario of a colour revolution. The practice is not new. Similar events took place in the post-Soviet space, for example, in Ukraine back in 2004, and in many other countries. Not long ago, Venezuela was confronted with a similar challenge: the parallel government project and the legalisation of the alleged president Juan Guaido. We remember very well how it all ended.\nThe recent US-initiated Santo Domingo Declaration, the resolution of the Organisation of American States and calls for an intra-Venezuelan split and disobedience of the armed forces to the country's legitimate authorities are all directly inciting destabilisation, the creation of a controlled chaos in Venezuela, which the US loves to do so much, and provoking new waves of emigration.\nThose who are now mounting pressure on Caracas must understand what consequences will be like. Another dangerous precedent is being created, when external forces try to dictate their will to a sovereign state, its lawful authorities, and electoral bodies. Any other country could end up in Venezuela's place in the future.\nIn this regard, it is worthwhile to note that the Inter-American Democratic Charter signed in 2001 by the Western Hemisphere heads of state does not contain any provisions that would allow for some independent verification of the election results in a particular country, changing them at someone's whim from the outside.\nWe believe that the will of the people, who have made their choice, remains the foundation for Venezuela's peaceful and sustainable development. We welcome the Venezuelan authorities' determination to consistently defend the sovereignty of their country, ensure constitutional order, and continue dialogue with stakeholder political forces in the interests of finding ways to resolve disagreements within the legal framework. It is fundamentally important that such efforts be supported by all those interested in a stable and independent Latin American region.\nRussia is among the supporters of this approach. We stand with the brotherly Venezuela and its government.\nWe would like to ask those who are trying to say now that a different candidate has won and not the real winner (among them the United States and other countries): all these years you believed that some impostor, Juan Guaido, was the president of Venezuela. At what stage and in what way did their countries, first of all the US, formalise legislatively or politically that Juan Guaido is no longer the president of Venezuela? Where was it written or said? Did you recognise him as president back then? Have you now renounced him? This needs to be formulated, formalised, written in some document that the current White House administration believes that Juan Guaido is no longer the president. It would all be funny if it were not so sad and dangerous.\nHumanitarian situation in Gaza\nThe atrocious humanitarian situation in the Palestinian enclave raises particular concerns. The civilian population is in a dire situation caused by the ongoing Israeli military operation and the sea, air and land blockade of Gaza that has almost completely cut it off from the outside world.\nThe civilian infrastructure is on the verge of collapse: the locally displaced people are crammed in the few overcrowded schools and hospitals that have survived, and the water supply system is barely functioning.\nAccording to the UN agencies involved in the implementation of various assistance programmes for Palestine, supplies of food to the Gaza population have been increasingly constrained. Food stocks are at a critical level. According to reports, there is only one UN World Food Programme warehouse operating in Gaza. At the same time, the conditionally safe area is shrinking as Israel steps up military operations, and the mass evacuation of thousands of civilians impedes the movement of humanitarian convoys and the provision of the necessary assistance.\nTrucks carrying humanitarian supplies from Jordan and Egypt, as well as aid flowing through the Israeli port of Ashdod, can only enter Gaza through three checkpoints. In July, the World Food Programme successfully delivered 11,500 tonnes of food, a negligible amount for the over 2 million people trapped there.\nThe health situation in Gaza has significantly deteriorated due to the non-existent medical services and shortages of hygiene products, as well as poor water quality. An outburst of polio has been reported in the enclave, and the incidence of hepatitis A has now exceeded 40,000 cases.\nRussia is making a fair contribution to the efforts to alleviate the suffering of civilians. Since October 19, 2023, Russian Emergencies Ministry aircraft have delivered more than 700 tonnes of goods for various purposes to Egypt for subsequent shipment to the besieged Palestinian enclave, assisted by the Egyptian Red Crescent Society.\nThe enormous human tragedy unfolding before the eyes of the world could not have left many of our compatriots indifferent. Along with state agencies, numerous Russian non-governmental and public organisations and individuals are active in collecting humanitarian aid for Palestinians in need. Through their efforts, hundreds of tonnes of food, medicines, and basic necessities have been collected throughout the country. This work continues.\nOnce again, we have to emphasise that the disastrous situation in the Gaza Strip is a direct consequence of more than ten months of hostilities in the enclave. In this regard, we reiterate the need for the immediate implementation of the UN Security Council and General Assembly resolutions demanding a ceasefire and unhindered humanitarian access to Gaza. This would pave the way for long-term normalisation in the Palestinian-Israeli conflict area and help transfer the efforts to resolve it to the political and diplomatic plane.\nDonation of 50 ambulances to Angola\nOn August 10, Russian Ambassador Vladimir Tararov handed over 50 GAZ Business ambulances to Angola in a ceremony in Luanda hosted by Angola's Minister of Health Sílvia Lutucuta. The vehicles were donated as part of our country's humanitarian aid to the fraternal Angolan people following an appeal that Angolan President João Lourenço made to President of Russia Vladimir Putin.\nThe gift was highly appreciated by our Angolan partners at the level of the country's top officials, and caused a wide public response in the republic.\nThe donation of ambulances to Angola is in line with the strong bond of friendship, cooperation and mutual support, which has long been in place between our nations.\nHumanitarian aid to Afghanistan\nOn August 20, 2024, a special flight operated by Russia's Ministry of Emergencies delivered about 25 tonnes of wheat flour as humanitarian aid to Kandahar in southern Afghanistan.\nIt was the Friendship House, a not profit from the Volgograd Region with a mission to promote culture, which provided this assistance as part of the People's Through Ages and Russia Stands With You international projects. Both are supported by Rossotrudnichestvo, the Federal Agency for the Commonwealth of Independent States, Compatriots Living Abroad, and International Humanitarian Cooperation.\nEfforts to provide humanitarian aid to the friendly Afghan nation will continue.\nSCO National Centre for Public Diplomacy opens in Chelyabinsk\nOn August 14, 2024, the SCO National Centre for Public Diplomacy opened its branch in Chelyabinsk. It will host business, cultural and sporting events, as well as educational and outreach programmes, and also contribute to perfecting lasting and comprehensive ties with our partners within the Shanghai Cooperation Organisation in trade, economics, research and technology. The roundtable discussion titled \"Regional public diplomacy across the SCO space\" was part of this agenda.\nLet me remind you that the presentation of the Russian SCO National Centre for Public Diplomacy took place on June 30, 2023, in Moscow. Foreign Minister Sergey Lavrov attended it.\nThis centre has a mission to strengthen friendship and promote cooperation by reaching out to the general public in the SCO countries in an effort to build an objective vision of Russia both within and beyond the SCO space.\nThe centre relies on the fundamental SCO principles, including inclusivity, mutual trust, equality, refraining from targeting third countries, respecting cultural diversity and working together on a positive and forward-looking development agenda.\nThe Foreign Ministry does everything to support and accompany this mechanism in its development. We stand ready to work closely together with all the SCO participants to enable it to gain even more prominence in international affairs and promote the ideals of a just, democratic and multipolar world order.\nNon-Profits Without Borders comprehensive educational programme\nNon-Profits Without Borders is a comprehensive educational programme by the Federal Agency for the Commonwealth of Independent States, Compatriots Living Abroad, and International Humanitarian Cooperation (Rossotrudnichestvo) and the Alexander Gorchakov Public Diplomacy Foundation, as well as the Institute of Social and Creative Development, the Association of Volunteer Centres and the Agency of Social Information. It has benefited from expert support from the Presidential Grant Foundation since 2023. This initiative targets senior executives, managers and activists from Russian and foreign non-governmental and non-profit organisations who work on international social projects.\nThe programme's mission consists of building a network of NGOs which are interested in undertaking international cooperation projects, as well as building a portfolio of initiatives which are likely to benefit from grants.\nAbout 600 NGO representatives from 34 countries and various domains took part in the programme's first stage in 2023, including executives from sports and creative projects, community service entities and volunteer groups. The final stage included 32 participants who were invited to Moscow to be able to attend in-person events.\nThis year's agenda in terms of developing this project includes targeted efforts to offer participants mentoring services and accompany NGO representatives at the project's second stage, as well as enabling the finalists from the in-person stage to work on their joint endeavours.\nThis programme is designed to test and scale-up system-wide approaches to dealing with the target audiences and coordinating efforts by the NGOs as part of international humanitarian policy.\nThe Architecture of Diplomacy photo exhibition\nAugust 21 saw the opening of the Architecture of Diplomacy photo exhibition dedicated to the 103th anniversary of the Main Administration for Service to the Diplomatic Corps under the MFA of Russia (GlavUpDK).\nThe exhibition presents 32 photo-canvases on the history of GlavUpDK and its efforts to preserve cultural heritage sites and 22 architectural monuments in Moscow. Historian, guide and expert in Moscow studies Vitaly Kalashnikov has taped audio guides with unique historical facts for each of the mansions on display.\nLet me remind you that on August 24, 1921, the Government signed a decree on establishing the Central Bureau for Service to Foreigners in Moscow (Burobin), whose mission was to cater to diplomats working in Moscow and supply them with everything they needed. The Bureau was allowed to have 38 mansions in its possession, most of which currently house foreign embassies.\nToday, GlavUpDK is in charge of over 100 architectural monuments in the capital of Russia, including a number of masterpieces by world-famous architects Fyodor Shekhtel, Leo Kekushev, William Walcot, and others. Their architectural styles range from the Neo-Baroque, to Neo-Classicism, to Neo-Gothic, to Eclecticism, to Russian Art Nouveau. The GlavUpDK maintains these invaluable monuments in a proper condition and seeks to familiarise lovers of architecture with their specific features and history.\nGlavUpDK Chief Architect Alexey Ochnev and Vitaly Kalashnikov organised a guided tour for participants in the opening ceremony and a visit to see the interiors in General Alexey Yermolov's House (20 Prechistenka Street).\nThe exhibition will run until September 8 of this year. We invite everyone to visit it.\nThe 25th Summer Diplomatic Games\nOn August 24, the Main Administration for Service to the Diplomatic Corps under the MFA of Russia will hold the anniversary 25th Summer Diplomatic Games at its branch, the Zavidovo rest and recreation facility.\nThe sports festival will involve heads and employees of diplomatic missions accredited in Russia and their family members. By tradition, the teams will vie for prizes in eight sports: lawn tennis, billiards, fishing, cross-country race, trap-shooting, arena football, volleyball, and basketball. Members of the Russian sports movement, including champions of Olympic Games and other world-level competitions will act as referees.\nThe Games will be opened by GlavUpDK chief Vyacheslav Fatin, three times Olympic fencing champion Galina Gorokhova, First Deputy Chair of the State Duma Committee on International Affairs and Olympic Champion Svetlana Zhurova, and others. The musical accompaniment will be provided by the Military Model Orchestra of the Guard of Honour.\nThe participants in the event will be able to enjoy a programme of outdoor activities and the My Country - My Family gastronomic festival sponsored by the Gastronomic Map of Russia project that will feature traditional meals from regions of Russia.\nWe invite media representatives to take part in this event.\nDay of the State Flag of the Russian Federation\nAugust 22 marks the Day of the State Flag of the Russian Federation. This date was approved by Presidential Executive Order 1714 dated August 20, 1994 \"in connection with reinstituting, on August 22, 1991, the historic Russian tricolour flag which glorifies many generations of Russians, and in order to instill respect for the state symbols in the current and future generations of the Russian citizens.\"\nThe first mention of the white, blue and red flag dates back to 1668 when it was hoisted on the first Russian ship \"Oryol\" during the reign of Tsar Alexei Mikhailovich. In 1693, it became the personal imperial banner of Tsar Peter the Great. In April 1883, Alexander III ruled as follows: \"On those solemn occasions when it is deemed possible to allow decorating buildings with flags, use exclusively the Russian flag consisting of three stripes: upper white, middle blue and lower red.\" In 1896, a special meeting at the Ministry of Justice convened by Emperor Nicholas II determined that the flag should \"finally become white, blue and red and none other.\"\nThe Federal Constitutional Law of the Russian Federation 1-FKZ \"On the State Flag of the Russian Federation\" of December 25, 2000 is the fundamental document describing the State Flag and regulating the rules for using it. In particular, Article 1 states that \"The State Flag of the Russian Federation is a rectangular cloth of three equal horizontal stripes: the upper one is white, the middle one is blue and the lower one is red\", and the width/length ratio is determined at 2:3.\nThere is no official interpretation of the colours of the flag, but the most common is the following description of its symbolical meaning. White symbolises purity, independence and peace. Blue is the color of faith, loyalty and justice (also reminiscent of the blue colour of the mantle of the Virgin Mary, who is considered a symbol of Russia). Red is a symbol of courage, strength and bravery, and serves as a reminder of the compatriots who gave up their lives in defence of the Motherland.\nThe 16th International Military Music Festival \"Spasskaya Tower\"\nThe 16th International Military Music Festival \"Spasskaya Tower\" will be held in Moscow from August 23 to September 1.\nOver the past years, this contest has gained well-deserved respect and has become one of our country's landmark events. The compelling musical and theatrical show will include performances by the best Russian and foreign military orchestral and creative groups. Their march on Red Square is an unparalleled in its size and colours.\nThe festival promotes strengthening of international cultural ties, plays an important role in popularising musical art and presenting domestic and international military musical groups.\nThis year, groups from Belarus, China, Egypt, Guinea, Thailand, Türkiye, South Africa and Venezuela will showcase their talent.\nOver 15 years of its existence, the festival \"Spasskaya Tower\" has hosted more than 160 groups from 57 countries with over 860,000-strong audiences. More than 50 million viewers enjoyed live streams of these performances.\nThis year, \"Dedicated to the Defenders of the Fatherland!\" was the festival's dominant semantic and musical theme.\nThe 9th All-Russian Cinema Night event abroad\nThe 9th All-Russian event titled \"Cinema Night\" will take place on August 24. It has become a colourful annual film event in our country. The event is sponsored by the Ministry of Culture and the Cinema Fund. The operator is Roskino which is the legal successor of the All-Union Association \"Sovexportfilm\" which celebrated its 100th anniversary this year.\nThis year's events will be held abroad at Russian foreign missions for the first time. Russian embassies and offices of Rossotrudnichestvo in the CIS (Armenia, Azerbaijan, Belarus, Kazakhstan, Kyrgyzstan, Moldova, Tajikistan, Turkmenistan, and Uzbekistan) and BRICS countries (Brazil, China, Egypt, Ethiopia, and India) will take part in the Cinema Night which will include screenings of new domestic films.\nThe vigorous activities of Russian foreign missions make it possible to bring this event to an international level and to let wide foreign audiences discover Russian cinema.\nWithout a doubt, the Cinema Night events will be widely popular with foreign audiences.\nQuestion: There is news that Finland's land forces are to be engaged in a series of military exercises from August 31 to September 6 in various regions of that country, including close to the Russian border. Could you comment on holding such exercises?\nMaria Zakharova: Russia has always recognised and is ready to recognise the sovereign right of any country to stage any, including military events, in its territory that are regarded by the authorities of those countries as necessary for upholding their security, subject to the observance of the rules prescribed by international conventions.\nAt the moment, a real hybrid war has been waged against our country by the countries of the collective West.\nWe can see a noticeably increased military activity in Finland after it joined NATO. We have noted on many occasions that the foreign policy of the Finnish leadership is pursued in line with the course of the collective West aimed at inflicting a \"strategic defeat\" on Russia. The statements made recently by Finnish Prime Minister Petteri Orpo and Minister of Foreign Affairs Elina Valtonen, which essentially justify the terrorist attack of Ukrainian neo-Nazis against the Kursk Region, have also not gone unnoticed.\nWe regard the above mentioned military exercises of the Finnish land forces near the Russian border in the same context.\nQuestion: Could you comment on the decision by the Czech authorities with respect to the Father Superior of the Russian Orthodox Church compound in Karlovy Vary, demanding that he leave the Czech Republic, as well as statements by the Foreign Minister of that country, Jan Lipavsky, against the Russian Orthodox Church?\nMaria Zakharova: Such verbal activity from the head of the Czech Foreign Ministry is quite understandable: in general, it has long looked like Prague officials would have nothing to do without Russian, or to be more precise, anti-Russian agenda.\nAs for the specific situation regarding the Russian Orthodox Church in the Czech Republic and the Father Superior in Karlovy Vary, we can see that it is indeed a war waged against God by those who seem to preach Christianity on a civilisational level, but in reality are persecuting it.\nIn addition, it is always tragic to be confronted with ignorance of national history and culture, whose development in the Czech Republic was largely brought about by the Russian Orthodox Church. We got used to the fact that in Western countries people know less and less about their own history and less and less educated people come to power there. Let's help by giving facts from Czech history.\nIt is a paradox that the attacks on the Russian Orthodox Church are initiated by the country, which sees itself as the successor to Great Moravia, where enlightenment activities of Saints Cyril and Methodius began for the entire Slavic world. The country, which insistently positions itself as a champion of democracy and defender of rights and freedoms, is now resorting to political persecution of the Church. This is how it can and should be qualified.\nIn general, we can see how the liberal dictatorship and those who position themselves as its protagonists are carrying out a real aggression against world religions, including Christianity. This is evident in all its manifestations.\nQuestion: Danish Foreign Minister Lars Lokke Rasmussen said that Ukraine was free to use Danish weapons for targeting the territory of the Russian Federation with its strikes. What does the Foreign Ministry think about statements of this kind?\nMaria Zakharova: There is nothing new about these statements. Copenhagen's policy since the very start of the special military operation consisted of inflicting as much damage on us as possible and maximising our losses on the battlefield by supplying weapons and military hardware to the Ukrainian Armed Forces for targeting Russian civilian sites and infrastructure in the Donetsk and Lugansk people's republics, Zaporozhye and Kherson regions, as well as in the Republic of Crimea and Sevastopol. They are now using Danish weapons for shelling civilians in the Kursk Region.\nOn August 16, 2024, Denmark's Defence Minister Troels Lund Poulsen said that there are no geographical restrictions in terms using the weapons his country sent to Ukraine. In his statement on August 19, 2024, Danish Foreign Minister Lars Lokke Rasmussen approved and justified the terrorist attacks perpetrated by the Ukrainian Armed Forces.\nIf there is anything more that you need in terms of our assessment, I can say that by acting this way, Copenhagen continues to demonstrate its Russia-hating nature for the whole world to see, as well as its commitment to propping-up Vladimir Zelensky's neo-Nazi regime coupled with supporting and seeking to fully absolve regimes and entire states of their terrorist activity.\nAll this proves once again the urgency of the special military operation's goals. They will be achieved and performed, as Russia's senior government officials have said so many times.\nQuestion: UK Prime Minister said the other day that he intended to provide Kiev more military support, as well as persuade his allies - the United States and France - to authorise Kiev to use the Storm Shadow cruise missiles for targeting military sites inside Russia. Why is the UK doing everything to escalate the Ukraine conflict even more, and why then the United States and France have maintained their neutrality on this matter?\nMaria Zakharova: Together with the United States, London has claimed the role of the mastermind behind what they called the Russia containment policy, before rebranding it as the policy of inflicting a strategic defeat on Russia. Let me remind you that London and Washington held joint exercises within NATO, as well as separately, to practice their manoeuvres while using an entity called Russia as their hypothetical target. In particular, in 2021, even before the special military operation started, British destroyers crossed our state border in the Black Sea.\nThe Anglo-Saxons were also the ones who launched a crusade against Russia's sovereign assets. Truth be said, they learned to target other countries with these measures as well by stealing and illegally confiscating things which do not belong to them. This is what their ideology is all about. They have done this many times without anyone offering them any resistance. Anglo-Saxons use these methods to overcome the crisis situations they face domestically and internationally.\nThe UK parliamentary election transformed the country's political elite in July 2024 but the fact that this did not result in London changing the way it deals with our country did not come as a surprise. They still stick to the same old operational mode, which I have just described.\nThe new British authorities' public statements, which represent anti-Russia points, confirm that the local establishment plans to follow the path of further escalation. They say this not only as specific steps, but also as an ideologeme. They seek escalation in bilateral affairs as well, intending to follow the general Western course in the anti-Russia direction. This is their conceptual, basic position. They have not abandoned it.\nThe instrumentalised and tame Kiev regime is the major instrument the British Russophobes choose to implement their plans for the long-term containment of Russia.\nAll kinds of assistance to Vladimir Zelensky and Bankovaya Street, along with the demonstration of British leadership in mobilising foreign aid to the Armed Forces of Ukraine and countering Russia in the international arena, obviously remain among the priorities of the Labour Party's foreign policy. It is possible that the confrontation with Moscow over the Ukrainian issue is of a completely practical purpose for Keir Starmer's cabinet, considering its announced plans to reset relations with the European Union.\nWe have noticed the British side's rhetoric regarding the Ukrainian militants' attack on the Kursk Region is gradually changing. The other day, in response to a media question, the official spokesperson of the UK Defence Ministry did not rule out the use of military equipment transferred by London during operations by the Kiev regime on Russia's territory. As before, such statements intentionally retain a certain veil of uncertainty, apparently on the \"highly likely\" scale. We have already cited it. You may remember that there are about 10 uncertain points, in particular, regarding the use of the Storm Shadow long-range cruise missiles by the Ukrainian Armed Forces. It should apparently leave London with room for political maneuver. As I have said, the main thing is that the Kiev regime is not only used as an instrument of hybrid war and aggression against Russia, but also as a screen, a cover for the fact that the ideologists are Anglo-Saxons.\nFor my part, I would like to once again remind British strategists that a deliberate escalation only strengthens actual security threats for all the parties involved. We have never underestimated London's military involvement in the Ukrainian conflict; the burned Challenger 2 tanks are clear evidence of this. Obviously, they have disgraced themselves by directly participating in terrorist acts. Great Britain is taking part in terrorist attacks against our country. This is their global historical mistake and crime.\nQuestion: What is Moscow's assessment of the IAEA's work, considering the Ukrainian army's most recent attempt to sabotage the Zaporozhskaya Nuclear Power Plant and the threats to attack the Kursk NPP?\nMaria Zakharova: We regularly comment on each incident and give our assessment of every specific action or inaction.\nI would rather tell you what we are doing to encourage the IAEA to step up efforts under its mandate. We keep in touch with the IAEA Secretariat and personally with Director General Rafael Grossi on the Kiev regime's repeated provocations against Russian nuclear facilities, the Zaporozhskaya NPP and the Kursk NPP.\nWe are making every effort to let the IAEA officials see an objective picture of the state of affairs at these nuclear power plants and assess the criminal actions of the Vladimir Zelensky regime, which could lead to a global man-made disaster. Rafael Grossi has repeatedly said that attacks on nuclear facilities are unacceptable. Unfortunately, the agency is still puzzling over the source of the attacks. Which side is the fire coming from?\nWe very much hope that once the IAEA leaders realise the danger posed by Ukrainian provocations against Russian nuclear facilities, they will start taking steps to provide stronger safety and security of the Zaporozhskaya NPP and the Kursk NPP.\nThe IAEA director general has confirmed his readiness to visit the Kursk Nuclear Power Plant at the end of August. The sides are currently discussing the modalities for his visit. Rafael Grossi also plans to lead the team of experts at the next rotation of IAEA Secretariat staff at Zaporozhskaya NPP in early September.\nQuestion: The authorities in Latvia plan to auction off Moscow House, a nationalised cultural centre in Riga, on Tuesday. The proceeds from the sale are going to be sent to Ukraine. Could you comment on this?\nMaria Zakharova: Are you familiar with the term 'fence,' meaning a dealer in stolen goods? This is very similar.\nLet me remind you that on December 21, 2023, representatives of the Latvian security services broke into the Moscow House cultural and business centre in Riga. They confiscated employees' devices and interrogated them. Later, on January 11, the country's Saeima passed the bill on its expropriation in the final reading. It is clear that this had nothing to do with legality, with national or international law. The move was entirely political. I must point out that the confiscated property was never owned by any private, public or state entity in Latvia. It was the property of the Moscow Government.\nWe have previously qualified that move as raiding, stealing, thieving on a national scale, while grossly violating the norms of international law that guarantee the inviolability of other countries' property.\nOn the other hand, the countries that Riga sees as ideological role models (the United States and Britain) have been doing the same. They take away sovereign assets and private assets. They expropriate assets that never belonged to them. They have been encroaching upon property for a long time. Remember how many Russian properties, including diplomatic properties, which must have immunity, and have had it for years, have been taken away and stolen by the United States. That has clearly emboldened Riga.\nAs I said, we have already given our assessment of this. We hold the Latvian authorities and the country's top officials fully responsible and financially accountable for such lawless actions. Retaliatory steps will be taken.\nAs for Latvia's plans to send the proceeds from the sale to the Kiev regime, this step fully aligns with their policy of supporting neo-Nazis and terrorists in the form of the Kiev regime.\nThe official authorities in Riga (in fact, the neo-Nazi government) have long supported the neo-Nazi regime in Kiev, providing it with weapons and finances. With the rampant corruption Vladimir Zelensky and his clique are known for, this money - the proceeds from the sale of property stolen from Russia - will be probably embezzled as well. Perhaps some people in Riga will line their pockets as well. I cannot rule this out.\nOne would expect that - with Moscow House in Riga raided by the Latvian authorities who plan to raise money for Ukraine this way, and with the world seeing what the Kiev regime is doing, in particular, in the Kursk Region - Latvia's actions should have set in motion US laws on combating the financing of terrorism by other states. By now, Latvia would have been under a barrage of warrants, lawsuits and decisions to list them as sponsors of terrorism, which is actually true. But because the United States itself sponsors terrorism, well, as they say, a wolf won't eat wolf.\nQuestion: Combat actions have been taking place in the Kursk Region for two weeks now. The Wall Street Journal reported that the US is not sharing intelligence on targets in Russia with Kiev, while another source in the same media outlet said that a significant portion of the military personnel were deployed from the reserve forces that Ukraine formed with the support from the West. Would you comment on this?\nMaria Zakharova: I have already mentioned it in the introductory part of the briefing. We have talked about this for over two years.\nThe US, Great Britain and other NATO members - but primarily the Anglo-Saxon duo - are not simply ideological inspirers and financial sponsors but literally pointers who indicate targets in the Russian Federation to the Kiev regime. The latter's statement claiming that it is happening without Western support is a lie.\nQuestion: Two years after the explosions on Nord Stream gas pipelines, Germany has issued the first warrant to arrest a suspect. Russia has officially filed claims against Germany regarding the investigation into Nord Stream explosions. Has Moscow received a corresponding response? What does Russia expect from the subsequent investigation?\nMaria Zakharova: I have already responded to the comment of the German Foreign Ministry's spokesperson. First, we have not received anything from Germany, except for insignificant formal replies and some empty chatter recorded on paper that has nothing to do with the case. These are formal replies saying that the investigation is underway, and that's it. Second, we have said repeatedly, including at UN Security Council meetings, that Germany is obliged to provide materials, but is not doing so. This was repeated once again today.\nI can add that Russia, as we have repeatedly mentioned, regards the attack on a critical infrastructure facility as an act of international terrorism that has inflicted immense economic damage, perhaps above all to Germany itself.\nOnce again, the German authorities have not fulfilled any request from the Russian side regarding legal assistance in investigating this crime. The investigation, which has been underway for nearly two years, has not provided any tangible results. The German side failing to comply with requests for legal assistance and the lack of an effective investigation into the terrorist attack is a flagrant violation of Germany's obligations, which we have regularly referred to. I can repeat once again everything that Germany must comply with. These are the 1997 International Convention for the Suppression of Terrorist Bombings and the 1999 International Convention for the Suppression of the Financing of Terrorism. The corresponding legal claims on this matter have already been made against Germany: Russia is demanding negotiations, a necessary condition before appealing to the International Court of Justice. Berlin is avoiding these talks.\nAs to the recent publications as regards Germany requesting Poland to extradite the Ukrainians suspected of committing this crime, the Russian side was not notified by Berlin about these suspects despite the fact that this information would definitely be essential for the investigation carried out by Russian law enforcement agencies.\nWe have noted that, according to the statements made by the Polish prosecutor's office, a person on the extradition request, a Ukrainian national named Vladimir Z., was indeed in Poland but managed to leave the country because Germany did not include his name in the list of wanted persons. I wonder if this was Vladimir Zelensky.\nPoland is also a party to the abovementioned conventions and has similar obligations to cooperate in the investigation of the terrorist attack on Nord Stream pipelines, as well as to identify and bring terrorists to justice. There is no doubt considering that the entire world has reached consensus to recongise this as a terrorist attack. In this regard, the recent statement by Prime Minister of Poland Donald Tusk urging everyone who raises the question of investigation into the Nord Stream explosions to 'keep quiet' is shocking. Why? I am not asking why the Prime Minister of Poland uses such a tone and such words. I wonder why. Where are the norms, laws, or by-laws that forbid discussing the topic of crime and punishment, especially committed on an international scale? What do they refer to? Or are they simply carried away by the concept of a rules-based world order? Perhaps this is so. As you know, we will not let this matter drop.\nQuestion: You may be familiar with the statement made by the Armenian Foreign Ministry Spokesperson yesterday regarding what Sergey Lavrov had to say in Baku. Could you please provide your comment on this statement, particularly on the fact that not a single paragraph, other than paragraph 9 of the agreement on unblocking transport links in the Syunik region, has been implemented, and the remark that \"the Russian Foreign Minister's statement is not only regrettable, but also calls into question the constructive involvement of the Russian Federation in the process of settling relations between Armenia and Azerbaijan.\"\nMaria Zakharova: We've seen the Armenian Foreign Ministry react to what Foreign Minister Sergey Lavrov had to say. Their reaction is yet another case of official Yerevan's policy of pinning the blame for its own mistakes and strategic miscalculations on others, Russia this time.\nWe see that their policy comes down to finding the guilty party (whoever it may be) in order to accuse it of their own failures and thus get things back on track.\nLet me remind you the contents of paragraph 9 of the Statement of the leaders of Russia, Armenia and Azerbaijan of November 9, 2020, to which Foreign Minister Sergey Lavrov referred. \"All economic and transport links in the region are unblocked. The Republic of Armenia guarantees the safety of transport links between the western regions of the Republic of Azerbaijan and the Nakhichevan Autonomous Republic in order to organise the unimpeded movement of citizens, vehicles and goods in both directions. Control over transport communication is carried out by the bodies of the Border Guard Service of the FSB of Russia.\"\nMuch work has been done in this area within the framework of the Trilateral Working Group on Unblocking Economic and Transport Links in the South Caucasus co-chaired by deputy prime ministers of Russia, Azerbaijan and Armenia. A total of 12 meetings have been held, which led to significant progress. For example, at the request of the Armenian side, it was decided not to tie the opening of rail connection in with the motor traffic. At the most recent meeting in Moscow on June 2, 2023, the principles of sovereignty and jurisdiction of the parties with regard to the routes passing through their territories, which Yerevan insisted on, were reinforced. I hope that those who released the commentary you mentioned will have enough time to comment on this as well. The international transit of goods and their customs control have been settled.\nNevertheless, conclusive agreements on launching rail service couldn't be reached precisely because of the Armenian side's intransigence with regard to border control matters. Yerevan departed from the previously agreed positions and began to insist on the principle of \"reciprocity\" with regard to the presence of Russian border guards, demanding their presence not just on the Armenian side, but on the Azerbaijani side as well. It remains unclear what they were referring to since I just gave you a quote from the agreement.\nContrary to paragraph 9 of the trilateral statement by the leaders of November 9, 2020, signed (I must mention that, because the Armenian Foreign Ministry may go back on it later) by Prime Minister Nikol Pashinyan among other signatories, the representatives of Armenia refused to make arrangements concerning control over the transport links by the Border Guard Service of the Federal Security Service of Russia. Other than that, Yerevan did not assume any commitments regarding the time when the automobile route between Azerbaijan and Nakhichevan should open to traffic.\nLater on, the Armenian authorities went along with their new Western \"friends\" and have in fact \"frozen\" the joint work in the Trilateral Working Group. However, this failed to yield practical results in terms of unblocking transport links in Armenia's interests. Unfortunately, this time again, acting on the orders of the West, official Yerevan is missing an opportunity to not only establish transport links with its neighbours which would be beneficial for its economy, including through implementing its idea of \"the crossroads of peace,\" but also to contribute to bringing the situation in the region at large back to normal.\nFor our part, we remain committed to the 2020-2022 trilateral summit statements. These agreements remain the only available basis for the Armenian-Azerbaijani settlement and the overall achievement of stability, security and prosperity in the South Caucasus.\nWe urge the Yerevan authorities not to allow the West to derail the many years of efforts seeking to establish sustainable peace in the South Caucasus. This appears particularly important given the United States and the EU's obsession with the idea of squeezing Russia out of the South Caucasus and driving a wedge into our relations with Armenia and other countries in the region.\nQuestion: President Vladimir Putin was in Baku on a state visit on August 18-19. The main topic for discussion was the Azerbaijani-Armenian settlement under trilateral statements. However, on the same dates, the Armenian side attempted provocations - shelling in the Nakhichevan direction. How can you comment on this?\nMaria Zakharova: Presidents of Russia and Azerbaijan Vladimir Putin and Ilham Aliyev have thoroughly discussed the subject of reconciliation between Baku and Yerevan during the state visit of the President of Russia to Azerbaijan. The leaders discussed this issue in detail during their joint news conference.\nAll our efforts on this track are in keeping with the spirit of special allied relations with both Baku and Yerevan, which are based on the deep historical and cultural ties between our peoples and the joint aspiration to build a stable security system in the region.\nAs for the possible increase of tensions on the Armenian-Azerbaijani border, we regularly call on Yerevan and Baku to show restraint and avoid any actions fraught with deterioration of the situation. All disputed issues must be resolved exclusively through peaceful, political and diplomatic means.\nQuestion: Does Moscow plan to invigorate its efforts as an intermediary in the Azerbaijani-Armenian settlement after the visit of President Putin to Baku? The Russian leader has confirmed that he would be glad to help in signing a peace treaty between Baku and Yerevan.\nMaria Zakharova: The conclusion of a peace treaty is an essential condition for restoring peace and stability between Azerbaijan and Armenia, as well as in the South Caucasus in general. Russia has an abiding interest in seeing this happen as soon as possible. In practical terms, everything has been done for this purpose. Our intention to continue our assistance to our Armenian and Azerbaijani partners was personally confirmed by Vladimir Putin at the above-mentioned news conference. The President of Russia also expressed his intention to contact Prime Minister of Armenia Nikol Pashinyan after his visit to Azerbaijan to continue the dialogue on normalisation.\nWe are still ready to assist the sides in all tracks of the trilateral agreements reached at the highest level in 2020-2022, which in addition to the peace treaty includes border delimitation and demarcation, unblocking of transport communications and development of contacts within the civil community.\nWe also welcome the efforts of such our neighbours as Kazakhstan in this area.\nQuestion: Is the West persisting in its attempts to open a new political front against Russia in the South Caucasus? According to the Armenian media, President of France Emmanuel Macron is expected to visit Armenia in a month, on September 21. Meanwhile, Yerevan has once again refused to take part in CSTO exercises.\nMaria Zakharova: There is no getting away from the Russia-hating Western aspirations you have just mentioned, including in the South Caucasus.\nWe have covered the destructive Western activities in the region many times, with facts at hand. In particular, we released a detailed comment on this topic during the July 18, 2024, briefing. Emmanuel Macron's expected visit to Armenia falls within the same paradigm too.\nAs for Armenia's participation in CSTO events, the republic is always welcome to resume its full cooperation. After all, this country does not have any alternative to the CSTO and Russia in terms of guaranteeing its stability. This centuries-old principle has passed the test of time, and the people of Armenia have come to appreciate it. In addition, this is part of Armenia's history. It cannot be re-written, regardless of any would-be history textbooks which may be published nowadays.\nQuestion: What does Moscow think about Azerbaijan's decision to apply for joining BRICS?\nMaria Zakharova: I started my introductory remarks during this briefing by summing up the outcomes of an important part of Russia's BRICS chairmanship, as we are entering its final stage and preparing for its culminating event, the Kazan Summit.\nIn particular, I talked in general terms about how Russia and the entire BRICS family view the multiple requests we have been receiving for joining our association or working with it.\nQuestion: What do you think about the ongoing attempts by Türkiye and Syria to normalise their relations?\nMaria Zakharova: As far as we can judge, both Türkiye and Syria believe that bringing the relations between the two countries back to normal is a major priority. Both countries have been proactive in signalling their readiness to go down this road, including at the highest level. As for Russia, we also believe that normalising relations between Ankara and Damascus would be instrumental for promoting a comprehensive settlement for Syria and strengthening regional security.\nIn 2023, we organised a series of quadrilateral meetings in Moscow in the Russia-Iran-Syria-Türkiye format, including at the level of foreign ministers and their deputies, defence ministers and heads of special services. This effort created a solid foundation for promoting dialogue and paved the way to a conversation on all matters related to improving the Türkiye-Syria relations and the high and the highest levels.\nWe are committed to further coordinating our efforts as much as possible in an effort to help Ankara and Damascus restore their relations. This primarily means working together with the participants in the Astana format, which has demonstrated its effectiveness and relevance many times.\nQuestion: What were the attempts to normalise relations in 2024?\nMaria Zakharova: As I have already said, we organised a series of events, including in Moscow, and both Türkiye and Syria took part in them. This offered them a platform for contacting each other during a multilateral forum. Among other things, we also have an ongoing dialogue with the two capitals. This is also a way for us to facilitate efforts to bring the relations between these two countries back to normal.\nQuestion: What are Russia's proposals for bringing the relations between Syria and Türkiye back to normal?\nMaria Zakharova: As we have been saying from the outset, it was a mistake to try and isolate Syria, expel it from regional structures and stop talking to Damascus. Back in 2015 and 2016 we predicted that this process would come full circle - Syria would once again work with its neighbouring countries in the region, it would reset or resume its relations with many of those who refused to engage with Syria a decade earlier. This much was obvious.\nEverything that happened to Damascus was engineered rather than occurred on its own. It was the so-called collective West which caused this conflict. Of course, there was no way Russia would allow Syria to crumble from the Western onslaught. It was clear that Russia would help Syria fight international terrorism and would do everything to enable it to restore its contacts with the countries that temporarily turned their backs on the Syrian Arab Republic.\nQuestion: My question concerns the attempted invasion by the AFU and foreign mercenaries into the Kursk Region. Did foreign journalists apply to the Foreign Ministry of Russia for an accreditation to work in the Kursk Region and other western regions of Russia? Was there a response to this terrorist attack from the member states of the SCO and the CSTO?\nMaria Zakharova: What journalists do you mean? Those accused of illegal border crossing did not apply for visas or accreditations.\nIf you are referring to foreign journalists in general, who are now in the regions, there are many of them. They work legally. We insist that all foreign correspondents obey Russian laws: they need visas and Foreign Ministry accreditations.\nAs for the reaction from the SCO and the CSTO member states, the countries friendly to Russia are following the developments in the Kursk Region closely and note the comprehensive measures taken by Russia for the protection of civilian lives and elimination of the consequences of yet another terrorist attack launched by the Nazi Kiev regime.\nThe member states of the Shanghai Cooperation Organisation, some of which are also CSTO members, are no exception in this regard, as evidenced by signals coming in via bilateral channels. The reason can be easily understood because fighting terrorism is, as everyone knows, an invariable priority for the SCO and its specialised bodies. Consolidated approaches to interaction in fighting these threats are enshrined in the SCO's political and related documents, including the Declaration by the SCO Heads of State Council, approved in Astana on July 4 of this year.\nAs for the CSTO, we use bilateral channels to provide our closest allies, at their request, with objective information on the situation in the Kursk Region as related to the terrorist actions by the Kiev regime, as well as on the Russian approaches to Ukraine crisis settlement as a whole. All the CSTO member states have a vested interest in neutralising the security threats in our common space as soon as possible.\nSpecifically, the Belarusian Foreign Ministry came up with a strong denunciation of the AFU's \"senseless gamble\" on August 10. Its statement stressed that attacks on civilians and civilian infrastructure were unacceptable, qualified these as acts of terrorism, and expressed support for and solidarity with the residents of the Kursk Region. Moreover, our Belarusian allies have taken resolute military measures to tighten the defence of the Belarusian-Ukrainian stretch of the Union State's border lest Russia gets a stab in the back from other directions.\nThe CSTO's working bodies have data collection and analysis mechanisms that also carry out information exchanges towards an all-out assessment of the situation on the ground. As the press service of the CSTO Secretariat commented on August 16, experts of the CSTO analytical service are working round the clock in coordination with the Russian side. We will continue to maintain close contacts with our allies.\nQuestion: Mongolia has not included Gazprom's Power of Siberia-2 gas pipeline in its national development plan until 2028. How are the negotiations on this project going?\nMaria Zakharova: We consider the construction of the new Power of Siberia-2 gas trunk line (officially, the Soyuz Vostok project) as one of the most significant regional energy and infrastructure projects, which meets the interests of all its participants and will become an important part of the Russia-Mongolia-China economic corridor in the future.\nThe initiative to build a gas pipeline from Russia to China across Mongolia was originally put forward by Ulaanbaatar almost 15 years ago as part of its Steppe Road national programme aimed at expanding the country's transport capacity. Let me remind you that the Trans-Mongolian route was contemplated as one of the alternatives when the Power of Siberia pipeline was being designed. Subsequently, all Mongolian leaders, regardless of their party affiliation, have repeatedly revisited this idea in bilateral contacts, as well as in a trilateral format with Chinese representatives since 2014.\nThe decision to start preparations for the project was taken by the leaders of Russia and Mongolia in 2021. A special-purpose commercial vehicle named Gazoprovod Soyuz Vostok was established. The company is carrying out design and survey works according to the approved schedule. In January 2022, a feasibility study for the project was approved by the Russian and Mongolian sides, as well as the route, and the necessary engineering surveys and studies were carried out. At the end of December 2023, the design documentation was finalised. The total length of the new pipeline across Mongolia will be 962.9 kilometres and will include five compressor stations. The new infrastructure is supposed to pump up to 50 billion cubic metres of natural gas a year.\nThe project has made significant progress by now. The construction proper will begin as soon as prices and supply volumes are agreed with the Chinese party, and binding documents are signed. Russia's Gazprom and China National Petroleum Corporation are currently in talks on the matter.\nIn fact, whereas initially, our Mongolian partners wanted to go with the limited role of a transit country, today, they are considering the possibility of using part of the cheap pipeline gas for the development of their own economy, industry and infrastructure.\nTaking into account the partners' interest in gradually installing a public gas supply system in the regions, Gazprom has offered consultancy services to Mongolia for the elaboration of the general plan of its gas industry development, as well as prompt training of specialists for the Soyuz Vostok project. At present, 34 Mongolian students are studying at Tomsk Polytechnic University in the required specialties.\nQuestion: How will the Day of Victory over militaristic Japan and the end of World War II, September 3, be celebrated this year?\nMaria Zakharova: We are currently making appropriate preparations for this important memorial milestone - the Day of Military Glory of Russia. We believe its commemoration to be of great importance for the correct interpretation of major 20th century events, for the fulfilment of our human duty to the participants of WWII military operations in the Far East and representatives of public and veterans' organisations, as well as for the patriotic education of the younger generation.\nThe name of this commemorative date, updated by the Presidential Executive Order of June 24, 2023, fully serves these purposes. It fairly and accurately reflects the historical truth and underlines the enduring significance of the great feat of the Soviet army, which played a crucial role in bringing about Japan's surrender and the long-awaited peace in the world.\nAs far as we know, this year's celebrations will be held on a bigger scale. In particular, a solemn meeting is scheduled to be held in Moscow on September 3, with the widest possible participation of state and public representatives. The discussion will specifically focus on the programme of preparations for the 80th anniversary of the Victory over militaristic Japan and the end of World War II, which will be marked a year from now.\nThe Archive Service section of the Foreign Ministry's website regularly publishes unique materials on this subject, for example, The Year of Victory. Soviet Diplomats in Tokyo series.\nQuestion: Premier of the State Council of the People's Republic of China Li Qiang arrived in Russia on an official visit on August 20. The programme includes holding the 29th meeting of the heads of government of Russia and China and a meeting with President Vladimir Putin. What does the Russian side expect from this visit in terms of deepening trade and economic relations and political dialogue between our countries?\nMaria Zakharova: I'm not going to discuss the schedule of meetings since everyone is aware of it. I will focus on the main thrust of the visit instead.\nThe mechanism of regular meetings of heads of government has been functioning steadily for almost 30 years now. It includes five intergovernmental commissions headed by deputy prime ministers and over 80 different sub-commissions and working groups. The very fact of holding regular high-level talks without fail over such a long time showcases the unique nature of stable Russia-China relations of strategic importance.\nToday's productive talks focused on the most pressing practical and humanitarian bilateral issues, and its participants delved deep into matters of cooperation in trade, the economy, finance, energy and other key sectors. Steps were outlined to promote interaction across various spheres, as well as ways to overcome difficulties that some Western countries have thrown our way.\nWe are convinced that the agreements reached during Premier Li Qiang's visit will be successfully implemented and further boost the Russian-Chinese economic cooperation. They will effectively contribute to the strengthening of relations of comprehensive partnership and strategic cooperation between our countries.\nQuestion: Director of the Foreign Ministry's First CIS Department Mikael Agasandyan stated that about 90 percent of settlements in the Eurasian Economic Union were made in national currencies. How sustainable is the process of the Union forgoing the US dollar? Will this process help reduce the adverse impact of Westerners, primarily the United States, on the EAEU countries?\nMaria Zakharova: Your quote from the interview with Mikael Agasandyan is absolutely accurate.\nThe EAEU member states' joint efforts made it possible to attain this impressive figure. We will not stop there, but will keep on working in this area. We sense that our EAEU partners have demand for it. Importantly, the interest is not limited to boosting the role of national currencies in mutual settlements. It also includes using the currencies of friendly countries whenever there is mutual interest.\nWe use this arrangement to boost the stability of our own financial systems, to guarantee the continuity of daily mutual settlements between member states, and to create comfortable environment for business to secure contracts and do business on the stock exchange.\nImportantly, this is an absolutely voluntary process. Unlike Westerners, we are not forcing anyone to do anything, or blocking the use of other countries' financial tools. Other Union members are within their right to make payments in dollars or euros as they see fit, or when alternative payment methods are unavailable. However, we have before our eyes more than one example of how Western financial systems have become a tool for exerting political pressure and even theft, blackmail or racketeering, and the countries that conduct their financial, economic and business affairs responsibly cannot let it go unnoticed. We can no longer rely on Western financial tools since they are no longer credible. At some point, there were touted as a peaceful element of international cooperation, a convenient tool that Western countries were willing to provide to all for the common good. It turned out eventually to be a trap with a noose at the end that the West weaponised and turned against the countries that did not submit to its will.\nQuestion: In connection with President Vladimir Putin's Executive Order on supporting foreign citizens who share traditional spiritual and moral values, more information has come through recently about foreign citizens and their families who apply for relocation to Russia in an effort to flee the satanic dictatorships that have taken root in a number of countries. Do you have any statistics in this regard?\nMaria Zakharova: We do not keep separate statistics.\nThe Presidential Executive Order that you mentioned came into force on August 19. The Foreign Ministry was assigned with a number of tasks, among them to draw up \"a list of foreign countries implementing policies that impose destructive neoliberal ideological paradigms that contradict traditional Russian spiritual and moral values\" and to issue visas to foreigners willing to relocate to the Russian Federation from such countries.\nWhen applying for such visas, foreign nationals will submit special applications indicating the stated motives for relocation. Ultimately, the number of visas issued under these arrangements can be used as statistics.\nQuestion: It is good to see you again. We have noticed a pattern that whenever you go under the radar, bad things happen around the world (for example, the Satanic Olympic Games). Your return brings back hope for a better world.\nMaria Zakharova: I take this as an emotional and ironic compliment that doesn't need my comment other than refuting the global role you have assigned to me.\nWith regard to the \"global Satanism,\" it is necessary to crush it not just as a nation, as we are doing, but as the whole world. Have your compatriots step up, and then use them to \"wake up\" everyone else around you. At some point, it will be too late to do so. I do not want to see it happen.\nJudging by the developments during the opening and closing of the Olympic Games in Paris, those who profess liberal diktat are not even hiding their intentions. On the contrary, they are showcasing, declaring and stating them.",
  "word_count": 20143,
  "scraped_at": "2026-02-14T13:15:13.183705"
}