{
  "article_id": "de3173c0443c",
  "url": "https://www.citizensvoice.com/2025/09/08/commentary-how-the-english-premier-league-is-globalizing-americans/",
  "title": "Commentary : How the English Premier League is globalizing Americans",
  "date": "20250908T063000Z",
  "domain": "citizensvoice.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "The most-followed professional sports league on Earth is increasingly an American one, but it’s not the NFL, NBA or Major League Baseball. Despite their impressive strides in growing global audiences and reach, homegrown U.S. sports aren’t the world’s biggest draw. Instead, American teams are buying into the world’s most popular sport — the other football — via the global all-star English Premier League.\nThe Premier League kicked off its 2025-2026 season Aug. 15 with 11 of its 20 clubs under U.S. ownership (only four teams in the league are British-owned. It promises to be a crackling season.\nWill thrice runners-up Arsenal (which shares owners with the Los Angeles Rams) be able to dethrone Liverpool (owned by the Red Sox’s Fenway Sports Group)? Will heavy spenders Chelsea (which shares owners with the Dodgers and the Lakers) once again vie for the league title, fresh off its improbable FIFA Club World Cup win this summer? And will San Francisco 49ers-owned Leeds United gain a permanent foothold in the league after being promoted from the lower division last season?\nPerhaps the most compelling Premier League storyline is the fast-accelerating American takeover of soccer/football and what it tells us about the globalization of American culture. Suddenly, Americans are far more connected to the rest of the world than previous generations were, thanks to sport, our age’s leading pastime and most important form of media.\nWhen I first moved to the United States as a teenager in the 1980s, Americans didn’t play much with others. We had our sports and proclaimed the winners in our domestic leagues “world champions.” Sport was the exception to the rule that all things American were the world’s cultural lingua franca. Indeed, as a result of the great 19th century footballing schism, the U.S. is the only major country where the stars of our most popular sports leagues never get to represent their country in international competition.\nTom Brady never got to wear a Team USA jersey because, well, only other Americans play his kind of football. Moreover, although a Hollywood blockbuster might make three-quarters of its box office outside the U.S., and Taylor Swift scheduled two-thirds of her Eras Tour in nations other than America, our biggest sporting production — the Super Bowl — is still watched by far more people inside the U.S. than outside it.\nYet things have changed dramatically over the past generation. It used to be common to hear sports pundits and American politicians (especially conservative ones) vilify soccer with the same xenophobic fervor reserved for such dastardly foreign schemes as the metric system and socialism. But now our “America First” President Trump is fast friends with FIFA’s leader Gianni Infantino, and Trump’s enthusiasm for the recent Club World Cup was such that he famously overstayed his welcome on stage during Chelsea’s post-match celebrations last month at MetLife Stadium.\nWe can thank the girls and women of America, and Title IX, for putting an end to America’s sporting isolationism, along with immigrants, who were often the first to introduce the sport across American communities, and the marketing departments and aspirations of multinational corporations.\nCoca-Cola was FIFA’s first global sponsor not because it was already a powerful American company, but because FIFA could help push the brand to every corner of the world. Electronic Arts could have simply created its Madden video game for NFL aficionados, but it was its FIFA game that made it a global player (and in turn helped popularize the sport among millions of American kids).\nIn 2026, the men’s World Cup, which the United States will co-host with Mexico and Canada, will further ratify the end of America’s sporting isolationism. Ours is now a nation where soccer practice is a staple of most kids’ lives, the game’s best player ever joined our top domestic league (which didn’t exist until 1996), and we can watch every other league on the planet. Thanks to NBC’s masterful coverage, England’s Premier League is as avidly followed in this country as many of our domestic leagues.\nIt wasn’t that long ago that I could wear my Arsenal sweatshirt out and about without eliciting much of a response, but no more. A couple of seasons ago in Phoenix, I had taped a midday match to watch after work and was scrupulously avoiding any source of spoilers. Then I ran into my gym for a quick workout wearing my Arsenal cap.\n“Tough loss,” the guy at the front desk said.\nI guess so, but an oddly satisfying spoiler too, for what it represented.\nAndrés Martinez is the co-director of the Great Game Lab at Arizona State University, a fellow at New America and author of the forthcoming book, “The Great Game: A Tale of Two Footballs and America’s Quest to Conquer Global Sport.”",
  "word_count": 795,
  "scraped_at": "2026-02-14T12:20:12.789453"
}