{
  "article_id": "de6ceb62007f",
  "url": "https://www.aa.com.tr/en/world/morning-briefing-august-23-2023/2973997",
  "title": "Morning Briefing : August 23 , 2023",
  "date": "20230823T063000Z",
  "domain": "aa.com.tr",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Morning Briefing: August 23, 2023\nAnadolu’s recap of top stories from around the globe\nISTANBUL\nHere’s a rundown of all the news you need to start your Wednesday with, including, the latest on the BRICS summit in South Africa, India’s lunar mission and the wildfires in Greece.\nTOP STORIES\nThe use of the US dollar in trade among BRICS member states is decreasing as they move toward national currencies, Russian President Vladimir Putin said Tuesday.\nAt the start of the three-day BRICS Summit in Johannesburg, South Africa, Putin via video link said the objective and irreversible process of de-dollarization of BRICS economies is gaining pace.\nThe bloc includes Brazil, Russia, India, China and South Africa and makes up a quarter of the global economy.\nIndia's third lunar exploration mission is set to make a landing attempt on the Moon today as the country aims to become the first to land on the lunar south pole.\nThe country last month successfully launched its lunar exploration mission Chandrayaan-3, aiming to land a rover on the Moon.\nIts attempt comes days after the failure of Luna-25, Russia’s first moon mission in 47 years, when the spacecraft, which was expected to land on Monday, spun out of control and crashed.\nEighteen charred bodies, including two children, suspected to be irregular migrants, were found in a forest area in Greece’s wildfire-struck Evros region, media reports said Tuesday.\n“Charred bodies, all of them males and two of them little children. They were found in groups of two or three and at a distance of 500 meters, obviously as they were trying to escape, and some of them had burned to death inside a sheep hold,” Alexandroupolis’ coroner Pavlos Pavlidis was quoted by state-run AMNA news agency.\nNEWS IN BRIEF\n- Türkiye expects Iraq to officially recognize PKK as a terrorist organization, Turkish Foreign Minister Hakan Fidan said at a joint press conference with his Iraqi counterpart Fuad Hussein in Baghdad.\n- All eight passengers mostly school children were rescued from a cable car dangling above a ravine in northwest Pakistan in a 15-hour \"complicated and difficult\" operation, the military said Tuesday.\n- Spain’s King Felipe VI announced late Tuesday that he was nominating Popular Party candidate Alberto Nunez Feijoo to try to form a government.\n- The Defense Department denied Tuesday that it is tipping billionaire Elon Musk about journalists’ inquiries about him, one day after a report chronicled the sweeping influence he wields within the US government.\n- The interim Afghan government on Tuesday denied a UN report of 800 cases of extrajudicial killing, arbitrary arrest, torture, and forced disappearance by the Kabul-led administration since its takeover in 2021.\n- At least six villages were evacuated in Türkiye’s western province of Canakkale due to wildfires, the Turkish Agriculture and Forestry Minister said Tuesday.\n- The African Union suspended Niger from various institutions and activities Tuesday until the restoration of constitutional order following a recent political upheaval that saw the ousting of President Mohamed Bazoum.\n- Tropical Storm Harold became the first storm to make landfall in the US during the 2023 Atlantic hurricane season Tuesday in the state of Texas.\nSPORTS\nSpain’s acting Prime Minister Pedro Sanchez received the women's national football team at his official residence, Moncloa Palace in Madrid.\nSanchez stressed that women's football and women's sports have a bright future.\nSanchez added that the team members will be awarded Spain's golden medal of sports achievement in honor of their victory.\nUEFA Appeals Body announced Tuesday it banned Fenerbahce because of incidents during a UEFA Europa Conference League match against Maribor.\nThe Istanbul club was fined €30,000 ($32,992) and received a ban from selling tickets to away supporters for their next match.\nThe disciplinary action was for \"lighting of a firework, throwing of objects, acts of damage and crowd disturbances,\" according to a statement.\nBUSINESS & ECONOMY\nReceiving 22 membership applications, the BRICS group of emerging economies is expected to create a new common currency that will be able to challenge the US dollar's global reserve status.\nIncreasing the number of its members, expanding its overall population and economic power and strengthening alternative institutions such as the New Development Bank (NDB), the BRICS, Brazil, Russia, India, China, and South Africa, aims to topple the US hegemony over the global economy.\nUS Commerce Secretary Gina Raimondo will travel to China later this month.\nThe three-day visit starting on Aug. 27 comes at an invitation of Chinese Commerce Minister Wang Wentao.\nRaimondo will be traveling to China’s capital Beijing and Shanghai to have discussions with high-ranking Chinese officials and US business leaders, said a US Commerce Department statement.\nAnadolu Agency website contains only a portion of the news stories offered to subscribers in the AA News Broadcasting System (HAS), and in summarized form. Please contact us for subscription options.",
  "word_count": 804,
  "scraped_at": "2026-02-14T12:05:09.498948"
}