{
  "article_id": "de6c258fbbbf",
  "url": "https://screenrant.com/ballers-nfl-player-athlete-cameos/",
  "title": "22 Real NFL Player & Athlete Cameos In The Rock Ballers",
  "date": "20230818T234500Z",
  "domain": "screenrant.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Summary\n- Ballers incorporates real-life athletes, including Stephen Curry and Antonio Brown, to give an authentic depiction of the sports industry.\n- Athletes like Julian Edelman and Terrell Suggs make appearances in multiple episodes, adding depth to the show's storyline.\n- The inclusion of non-football athletes like Giancarlo Stanton and Caroline Wozniacki shows the broad reach of the series beyond just football.\nThere are many real athlete cameos in the HBO series Ballers starring Dwayne \"The Rock\" Johnson. The Rock himself had hopes of playing professional football before an injury kept him sidelined which changed the course of his career. The Rock's character in Ballers, Spencer Strasmore, follows a similar path of being a former player whose career is impacted by an injury. Strasmore rises in the field as a financial manager who builds meaningful relationships with his clientele full of top athletes and sports stars.\nDrawing similarities to HBO's Entourage, Ballers relies on the inclusion of real-life athletes to help legitimize its projection as an authentic depiction of the behind-the-scenes aspects of a lucrative entertainment-based industry. Many athletes, particularly current and former NFL stars, have appeared in brief roles as themselves in the series, with some even getting involved in the show's overall story. Here are 22 real-life athlete cameos in HBO's Ballers.\n22 Stephen Curry\nNBA star Stephen Curry and his wife Ayesha appeared in Ballers season 3, episode 1 titled \"Seeds of Expansion\". The 2017 episode features the NBA icon talking to Spencer on the phone after getting off a private jet. Curry has won four NBA Championships as a member of the Golden State Warriors.\n21 Antonio Brown\nNFL star wide receiver Antonio Brown appeared in the pilot episode of Ballers in 2015. The eccentric NFL player appears as a member of the Pittsburgh Steelers in the HBO series alongside DeSean Jackson. Brown won a Super Bowl as a member of the Tampa Bay Buccaneers in 2021 and is currently on the Baltimore Ravens.\n20 Alvin Kamara\nNFL running back Alvin Kamara appeared in Ballers season 5, episode 5 in 2019. Kamara plays himself as he gets fictionally recruited by the Los Angeles Rams in the series. Kamara has played six NFL seasons with the New Orleans Saints and was selected for the Pro Bowl five teams.\n19 Von Miller\nNFL linebacker Von Miller appeared in Ballers season 5, episode 8 titled \"Players Only.\" Miller gets a call from Spencer in the series finale of Ballers before the big owners meeting. Miller has played 12 seasons in the NFL and has won one Super Bowl with the Los Angeles Rams in 2022.\n18 Julian Edelman\nFormer NFL wide receiver Julian Edelman appeared in two episodes of Ballers, season 1, episode 9 \"Head-On\" and season 2, episode 10 \"Game Day\". Edelman is seen working out with Ricky Jerret in one of the episodes. Edelman retired in 2021 and won three Super Bowls with the New England Patriots.\n17 DeSean Jackson\nDeSean Jackson appeared in the pilot episode of Ballers alongside Antonio Brown. He is currently the oldest active wide receiver in the NFL, having started his career in 2008 and playing for sixteen seasons with multiple NFL teams including the Philadelphia Eagles and the Baltimore Ravens.\n16 Don Shula\nDon Shula appeared as himself in the pilot episode of Ballers. Shula was the head coach of the only undefeated team in NFL history, The 1972 Miami Dolphins. Spencer played for the Dolphins in the HBO series.\n15 Jarvis Landry\nNFL wide receiver Jarvis Landry appeared as himself in the Ballers season 2 premiere titled \"Face of the Franchise.\" Landry was a member of the Miami Dolphins when the episode was first released. He currently plays for the New Orleans Saints.\n14 Larry Csonka\nLarry Csonka appears alongside Don Shula in the Ballers pilot episode. Csonka played a fictionalized version of himself in the series in which he was named the head coach of the Miami Dolphins. He was inducted into the Pro Football Hall of Fame in 1987.\n13 Jason Taylor\nFormer Miami Dolphins linebacker Jason Taylor appeared in the Ballers season 2 season premiere. Taylor was inducted into the Pro Football Hall of Fame in 2017 after playing 15 of his 15 NFL seasons with the Dolphins between 1997 and 2011.",
  "word_count": 715,
  "scraped_at": "2026-02-14T13:26:15.658089"
}