{
  "article_id": "de6dad081b5d",
  "url": "https://www.thepinknews.com/2025/06/09/lionesses-players-euros-2025-lgbtq/",
  "title": "Who are the LGBTQ+ Lionesses players on the 2025 Euros squad ? ",
  "date": "20250609T221500Z",
  "domain": "thepinknews.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "These are the out LGBTQ+ England Lionesses at the Women’s Euro 2025\nWithin the 23 Lionesses recently confirmed to be officially making up the England Women’s football team heading to the UEFA Women’s Euro 2025, there are a number of LGBTQ+ footy stars.\nAfter lifting the trophy in 2022, Sarina Wiegman has assembled her team, who will travel to Switzerland next month. However, there have already been several surprises with Mary Earps, Fran Kirby and Millie Bright withdrawing from selection.\nSpeaking about her team, Wiegman said: “This group is a very well-balanced mix of players with multiple tournaments on their CVs and also those that will make their tournament debuts. I am excited to see what we are capable of this summer.\n“At the same time, I do feel for those that have just missed out. I can only name 23 but there are more players who have been so important to us on our journey to Switzerland. We would not be here without them.\n“As we look forward, we still have a month to go until we play the first game. After some important rest, we will all be working really hard to make sure we are ready to go on July 5.”\nEngland’s first match of Euro 2025 is against France on July 5 in Zurich. The team are in Group D with France, Netherlands and Wales.\nThe semi-finals take place in Zurich and Geneva on July 22 and 23; the final is in Basel on July 27.\nWomen’s professional football has proven time and time again to be well ahead of the men’s game when it comes to LGBTQ+ representation.\nThe 2023 Women’s World Cup and Euro 2025 qualifiers were no exception, with a record number of out LGBTQ+ footballers taking to the pitch.\nHere’s a guide to the out LGBTQ+ players on the Lionesses’ 2025 Euros squad:\nLucy Bronze\nDefender Lucy Bronze plays as a right-back for Women’s Super League club Chelsea and the England women’s national team.\nThe 33-year-old was also on the Euro 2022 England team and will set out to lift the trophy again this year.\nThough she doesn’t talk widely about her sexuality, Bronze is known to be a queer athlete and it was rumoured that she previously dated fellow England team member Keira Walsh. However, they never made their relationship official.\nThough Bronze may not have spoken about her personal life extensively, when Iker Casillas and Carles Puyol joked about being gay on Twitter, she stated that their comments show football still needs better education on sexuality.\nCommenting on the “joke”, Bronze said: “‘But I think the reaction that has been had on social media in general, from not knowing what it was to thinking it was a joke to being hacked…the reaction just shows that there still needs a lot of education, openness on these kind of subjects because that kind of reaction wasn’t normal.”\nJess Carter\nWarwick-born defender and midfielder Jess Carter has been in the England squad since 2017, when she was 20 years old. At 24, she remains one of the youngest players on the England team. Carter was also part of the 2022 squad that secured the Euros victory, so she’ll be hungry for another win!\nSince 2017, Carter has been dating her Chelsea teammate and Germany national squad member Ann-Katrin Berger. In May 2024, the pair announced their engagement on Instagram: “7 years down forever to go.”\nCarter and Berger (who plays as Germany’s goalkeeper) went head to head in the 2022 Women’s Euros.\nCarter reflected on her relationship with Berger and LGBTQ+ issues in football in an op-ed for England Football to support Stonewall’s Rainbow Laces campaign in 2021.\n“I think I was – and probably still am – more comfortable than Ann is with publicising our relationship”, Carter said at the time. “But that is just because Ann is a very private person whereas I am more of a ‘the whole world could know and I wouldn’t really care’ kind of person.\n“Over time and because I will say whatever, she has kind of got used to it and goes with it. She doesn’t shout from the rooftop about it but equally when she is asked it is not a secret either.”\nLauren Hemp\nNorfolk-born forward Lauren Hemp was in England’s under-20 team when they finished third at the 2018 FIFA U-20 Women’s World Cup.\nHemp has been an integral member of the Lionesses squad and was central to the 2-1 win, which saw England lift the 2022 Euros trophy.\nIt was Hemp’s corner that set up Chloe Kelly to score the winning second goal.\nAs of 2022, Hemp is believed to be in a relationship with another professional footballer, Ellie Butler, who plays as a forward for Women’s Championship club Coventry United.\nBeth Mead\nForward Beth Mead is a very decorated member of the Lionesses team: at the 2022 Euros, she became the Golden Boot winner, Player of the Tournament, and top assist provider, as well as being named BBC Sports Personality of the Year, becoming the first women’s footballer to win the prestigious award.\nMead is reportedly in a relationship with former Arsenal teammate Vivianne Miedema, who currently plays for Manchester City.\nIn talking about her experiences as a bisexual athlete, Mead has shared that she struggled growing up without knowing many openly gay or bisexual people.\n“My parents maybe struggled in the beginning and it was something that was hard for me to say whether it was a phase or something I wanted to act upon,” Mead shared about her coming out experience.\n“In the women’s game it is more norm. Actually, I’ve never physically come out and said I’m gay, I’m with a girl because I’ve not had to. I’ve just been me.\n“I’ve put pictures with my partner on social media. To me, I’ve tried to make it the normal rather than make it a statement.”\nKeira Walsh\nKeira Walsh plays as a midfielder for Women’s Super League club Chelsea and the England women’s national team.\nThe 28-year-old will be one to watch at the 2025 Euros, having represented England for age-group teams since she was 12.\nAs of 2024, Walsh is believed to be in a relationship with Austrian footballer Laura Feiersinger. The pair have posted together on Instagram, and in May 2024, images were shared of them embracing on the sidelines.\nLeah Williamson\nLeah Williamson plays for Women’s Super League club Arsenal and captains the England women’s national team. The 28-year-old is recognised as a versatile player, playing in central defence or midfield.\nWilliamson is a bisexual athlete. She came out in 2022 and has been an activist and supporter of the LGBTQ+ community.\nShe wore a Stonewall rainbow captain’s armband throughout the 2022 Euros in a visual support of LGBTQ+ rights to be broadcast all across the globe.\nShe’s currently rumoured to be a relationship with former Miss USA and American model Elle Smith.\nThe UEFA Women’s Euro 2025 tournament will be played in Switzerland from 2 to 27 July 2025.",
  "word_count": 1176,
  "scraped_at": "2026-02-14T12:35:21.378543"
}