{
  "article_id": "de6e8601629c",
  "url": "https://katv.com/news/local/why-the-2025-ncaa-wrestling-championships-can-be-the-catalyst-for-wrestling-growth-in-us-wyatt-hendrickson-gable-steveson-president-donald-trump-nations-face-off-fifa-world-cup",
  "title": "Why the 2025 NCAA Wrestling Championships can be the catalyst for wrestling growth in U . S . ",
  "date": "20250325T043000Z",
  "domain": "katv.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Why the 2025 NCAA Wrestling Championships can be the catalyst for wrestling growth in U.S.\nLITTLE ROCK (KATV) — The following is an editorial with analytics.\nThe 2025 NCAA Wrestling Championships was a spectacle to behold.\nWith the sport's first-ever five-time champion, a monumental upset in the tournament's finale, President Donald Trump, and famed billionaire Elon Musk in attendance, the exposure and spotlight on the sport of wrestling after Saturday night was positively unfathomable.\nAt around 9:30 p.m. CST on March 22, the social media sports world exploded after Oklahoma State heavyweight wrestler and 2nd Lieutenant in the United States Air Force, Wyatt Hendrickson, took down Gable Steveson to win the heavyweight national title at the Wells Fargo Arena in Philadelphia. The win caused immediate ripples in the sports world. ESPN, Sports Illustrated, Fox Sports, Barstool Sports, and Fox News all shined on Hendrickson's incredible feat.\nIt all built on conspicuous efforts by broadcasting outlets, national and local media and marketing to promote the sport at a level it hasn't seen in years.\nIf you watched the championships live, you bore witness to history. But, what was the significance of Hendrickson's victory? Why is a No. 2 seed beating a No. 1 seed so monumental? To understand that, you must understand who Gable Steveson and Wyatt Hendrickson are respectively, and their history as highly competitive athletes.\nDavid slaying Goliath\nSteveson is a two-time NCAA DI champion from the University of Minnesota and is widely regarded as one of the most dominant NCAA wrestlers of all time regardless of weight class.\nSteveson finished his college career with a 101-3 record, a 97.1% win percentage, and a 75.6% bonus-point percentage, awarded for winning a match with a significant margin of victory, such as by fall, technical fall, or major decision. Steveson entered this year's finals on a winning streak of 70 matches.\nIf not for the 2020 wrestling season cancellation due to the COVID-19 outbreak, Steveson would likely be trying for his fourth NCAA title.\nSteveson is a 2020 Olympic Gold Medalist, beating Georgian heavyweight, Geno Petriashvili with a takedown in the closing seconds to win gold, 10-8 in Tokyo (The 2020 Olympics were postponed to 2021 due to COVID-19).\nAfter it was thought Steveson had officially left college wrestling, he was selected to the WWE NXT rookie program and made multiple appearances in WWE matches.\nSteveson never fulfilled his time with the WWE, which led him to try out for the NFL and get a shot with the Buffalo Bills in training camp before ultimately being released.\nPopularity does not equal talent, but through his endeavors, he became one of the most well-known active wrestlers in the country with a large fanbase. When he announced his return to Minnesota, many thought he was guaranteed to win the NCAA title.\nSteveson was aiming for his third individual title against Hendrickson in 2025 and earned his fifth All-American honors this year. Steveson is a two-time Dan Hodge Trophy winner, awarded each year to the best college wrestler in America.\nHe is only one of six wrestlers to win the award multiple times, and the only heavyweight to do so, making him one of the most decorated wrestlers in NCAA wrestling history.\nAfter transferring from the United States Air Force Academy, Hendrickson earned his third All-American honors this year in his final year of eligibility with the Oklahoma State Cowboys. He posted a 123-11 record in his career with a 91.8% winning percentage and a 78.2% bonus win percentage.\nHendrickson has been a national favorite among wrestling fans for his high pace and electrifying offense which usually often result in the most exciting call in wrestling: pinfalls.\nHe's also become a fan favorite because he represents the sport, his service academy, Oklahoma State, and himself with the utmost class.\nIt's worth noting that service academies did not provide athletes with an extra year of eligibility. Those who wished to compete an extra year had to apply for a waiver to compete elsewhere.\nWhen he got his waiver, Hendrickson chose Oklahoma State, a program he claimed he would have chosen out of high school if it weren't for his love of serving his country.\nThe 2025 heavyweight finals was a rematch from when the two last met in 2021, when Steveson beat Hendrickson, then a freshman, by an 18-2 technical fall.\nThis year's results against similar foes showed Hendrickson made positive strides toward being the top heavyweight:\nCohlton Schultz, Arizona State: Steveson beat Schultz by a 20-5 tech fall. Hendrickson beat Schultz twice by 11-5 and 8-5 decisions.\nGreg Kerkvliet, Penn State: Steveson beat Kerkvliet by a 10-3 decision. Hendrickson beat Kerkvliet by an 8-2 decision.\nBen Keuter, Iowa: Steveson beat Keuter by a 19-3 tech fall. Hendrickson also teched Keuter 18-3.\nOutside of the matches with Schultz, both wrestlers beat mutual opponents similarly. Nonetheless, not many thought Hendrickson, or anyone, was on Steveson's level.\nCompiling Steveson not losing a collegiate match in over six years, his popularity, with all the accolades he'd earned, it was a true David vs. Goliath matchup. Gable Steveson and losing do not go in the same sentence, not in the last six years, at least. That changed Saturday night at the NCAA finals.\nBefore the match, the only faction giving Hendrickson a chance of victory was the Oklahoma State fanbase. The \"Loyal and True,\" displayed their belief in Hendrickson all season leading up to the tournament.\nEven then, there was still doubt. You could count on one hand the number of prominent media, former wrestlers and coaches who picked Hendrickson to beat Steveson.\nIt was no slight to Hendrickson. Both wrestlers put together outstanding 2024-25 seasons. Hendrickson beat opponents he'd never beaten nor faced before, and Steveson showed no signs of regression despite a two-year hiatus from NCAA wrestling.\nBut, it kept going back to the proverb, \"Gable is Gable,\" and what Hendrickson was trying to accomplish was almost taboo.\nWhen Steveson announced his return to college wrestling, he immediately became the favorite to win the heavyweight title. Nobody else was given a chance.\nIt was evident when Hendrickson walked out with Ol' Glory draped over his shoulders that Hendrickson won the hearts of the fans. But in everyone's mind, the man many call \"Captain America\" would fall at the hands of Steveson. For years, Steveson was above and beyond the next-best competitor at heavyweight.\nHendrickson made it clear he was ready to battle from the whistle.\nHendrickson gave up an early takedown to Steveson which gave him three points on the board.\nHe battled for two more periods and gave himself a winning chance with the score at 4-2. He needed three points and with 30 seconds left in his collegiate career, Hendrickson shot to Steveson's legs in and drove his feet until he brought down the Olympic Gold Medalist. Steveson had not allowed a score all season. Hendrickson won the match to claim his first and only individual NCAA title, 5-4.\nDavid slaying Goliath.\nHendrickson said he channeled David all week.\nIn the story, David had a vision of victory,” Hendrickson said. “I kind of carried that with me all week. Even though he went after Goliath and everyone was like, ‘This can’t be done,’ he had the mindset of a champion.\nThe first five-timer\nThis year's wrestling championships were historic and the lineup began with it. Penn State's Carter Starocci was going for his fifth individual NCAA DI national title, a feat never accomplished in DI history. Last year, Starocci won his fourth NCAA DI championship, all at 174 pounds. He joined five others before him, and six in total after his teammate, Aaron Brooks, won his fourth championship.\nStarocci is in rare territory. No other wrestler has had the chance to compete for five championships. Granted, none except Brooks and Starocci experienced the COVID-19 pandemic during their competition careers. But, Brooks was out of eligibility and that left Starocci to win his fifth title this year.\nStarocci was matched up with Northern Iowa's Parker Keckeisen, a 2024 NCAA Champion at 184 pounds, the weight Starocci bumped up to this year. Keckeisen is also a five-time All-American who never finished lower than 3rd place at the NCAA Championships.\nThe only meeting between the two was in the 2024 NWCA All-Star Classic. Starocci took the win over Keckeisen in sudden victory, 4-1. It led many to believe it would be another close contest with Starocci as the favorite.\nThe many were correct. Starocci scored the lone takedown in the match and beat Keckeisen 4-3 to become NCAA DI wrestling's first-ever five-time champion. Starocci was long a prominent face of college wrestling, and he will look to continue representing Penn State and the Nittany Lions along with the sport of wrestling in the MMA.\nThe catalyst for growth\nESPN, the network airing the championships, also made conscious efforts to promote wrestling ahead of this year's tournament. For years, wrestling has been one of the best-kept secrets at the youth and college level. But, it has struggled to become mainstream for a multitude of reasons.\nLet's think of the traditional sports in America. Football, basketball, and baseball have long dominated the television screens of sports fans, and a 2023 poll by Gallup confirms.\nOf the poll, only 1% of sports fans said wrestling was their favorite sport to watch. Also, the poll doesn't specify if it means actual folkstyle and freestyle wrestling or professional wrestling like WWE and AEW, etcetera. Now, will wrestling ever overtake the traditional three U.S. sports? Very likely not. But, it isn't uncommon to see spikes in viewership after significant sporting events bring to light rather underrated and underappreciated sports in America.\nIn 2022, the FIFA World Cup in Qatar captivated sports fans across the globe, but especially in the United States. After the World Cup, soccer viewership in America skyrocketed.\nA 2024 study by For Soccer, a media and marketing company, showed that there was a 57% increase in people who have been soccer fans for five years or fewer. The number of first-time fans is up 400% year-over-year.\nTake ice hockey for example. Hockey has a large following in America. Even so, viewership is on a downward trend. The 2024 opening tripleheader saw a 39% decrease in viewership from last year, and it didn't stop there.\nA record-low audience for the Winter Classic with low audiences for individual games continued throughout the season. Then, in February, a boost in popularity was attributed to one event. The 4 Nations Face-Off provided a much-needed jolt to the popularity of hockey in America. The championship game of the best-on-best international tournament between the United States and Canada garnered 16.1 million viewers, 9.3 million of them residing in America.\nIt proves viewership can reach record lows, but the way to raise audience numbers and get people interested is good promotion and coverage of one main event in any respective sport.\nWhile the NCAA Wrestling Championships is an annual affair, its presence on social media seemed larger than it's been in the past. The newly released E:60 on ESPN highlighting college wrestling less than a week before the first match helped bring awareness to the sport.\nThe ratings have not yet been released on ESPN's NCAA Wrestling Championships. And, they will always be considerably low given the crossover with men's and women's NCAA March Madness. Nevertheless, there is still reason to anticipate ratings increased this year.\nPolarizing personalities\nTwo of the biggest names at the NCAA Wrestling Championships weren't a coach, a celebrity, or a wrestler. It was the President of the United States, Donald Trump, and billionaire CEO, Elon Musk.\nWells Fargo Arena erupted in unison as the President made his scheduled entrance and took his seat.\nBut when it was announced he would be in attendance, wrestling fans took to social media to express their mixed feelings. Some felt like it was an opportunity for President Trump to politicize the sport. Others felt like his presence was taking away the spotlight from the wrestlers. Some simply just want anything or anybody with politics to stay away.\nIn contrast, what if it brought growth to a sport that desperately needed it?\nMusk's post about the heavyweight finals was nearing 53 million views on the X platform.\nThe individual match on YouTube is nearing one million views.\nNearly 54 million views on two platforms on two posts alone. For the die-hard wrestling fan who preaches about growing the sport — this is it.\nWhile he's a political figure, there is nothing seemingly political about expressing his thoughts on the captivating heavyweight finals match. From that perspective, it accomplishes the mission of exposing wrestling to the casual sports fan at home and abroad.\nPolarizing figures and celebrities appearing at sporting events you'd never imagine them at, happens more often than one might think.\nHarry Styles, the internationally known superstar, is a Green Bay Packers fan.\nTaylor Swift is a worldwide phenomenon. When news publicly broke she and Kansas City Chiefs All-Pro NFL tight end, Travis Kelce were dating, the NFL tapped into a fanbase it otherwise may never have reached: the Swifties.\nAnyone, someone famous or infamous, can show up to an event and it will make headlines. In this case, those headlines had to say where Trump and Musk were — The NCAA Wrestling Championships.\nFuture growth in viewership and participation\nGiven the aftermath, it's a safe bet that ratings are up from last year, which saw a continued downward trend in audiences for the NCAA Wrestling Championships.\nNonetheless, in the U.S., If the viewership isn't up, the participation is.\nLast year, the NFHS released its High School Athletics Participation Survey, which saw wrestling boast an upward trend in participation.\nFor boys wrestling, 291,874 high school boys wrestled last year. Wrestling is the No. 6 sport for boys in terms of participants, trailing football, outdoor track and field, basketball, baseball, and soccer. Boys wrestling is the No. 8 sport in terms of schools.\nFor girls, there were 64,257 participants last year, which ranks No. 13 in the nation across all girls' sports.\nIn total, that's 356,131 participants in high school wrestling, and it only anticipates to get larger.",
  "word_count": 2370,
  "scraped_at": "2026-02-14T12:34:45.295006"
}