{
  "article_id": "de6e0300562f",
  "url": "https://variety.com/2025/tv/news/betsy-riley-nbc-primetime-olympics-show-1236352912/",
  "title": "Betsy Riley Will Lead NBC Primetime Olympics Show",
  "date": "20250331T210000Z",
  "domain": "variety.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Looks like NBC’s new pop-culture primetime Olympics show is becoming permanent.\nNBC Sports said Monday that it had lured Betsy Riley, a one-time NBC Sports veteran, to return to the company from Amazon’s Prime Video in order to oversee production of its primetime Olympics program. Riley, who was named a senior vice president and coordinating producer, helped launch Amazon’s “Thursday Night Football” broadcast and led its recent “Black Friday”; football game in 2023. She also oversaw Prime Video’s launch of its National Women’s Soccer League telecasts.\n“I’ve worked with Betsy for more than two decades, and her experience producing the Games’ highest-profile sports makes her the perfect person to oversee the Primetime Show. She brings the unique combination of a live-event producer’s instincts and an Olympic veteran’s expertise,” said Molly Solomon, executive producer and president of NBC Olympics Production, in a statement. “Betsy is a terrific leader and innovator whose creativity will be vital as we continue to build off the success of Paris and reimagine how NBC presents the Olympics in Milan, L.A., and beyond.”\nPopular on Variety\nRiley’s hire comes as a direct result of NBC diving more deeply into sports in the months ahead. Rob Hyland, the NBC Sports producer who led Olympics primetime in 2024, is assigned to oversee NBC’s Super Bowl telecast in 2026, which takes place at nearly the same time as the company’s Winter Olympics from Milan.\nNBC is clearly planning to keep many elements of its recent primetime efforts for last year’s Paris Olympics, which curated the events of the day and used deeper analysis and feature reporting along with celebrity guests. Meanwhile, live coverage was available via the company’s Peacock streaming service. NBC and its parent company, Comcast, recently won an extension of its current U.S. Olympic rights deal through 2036 for $3 billion.\nDuring past work for NBC, Riley took part in the production of nine Olympic Games. At the 2016 Rio Olympics, she was the first woman to produce Olympic track & field, and then produced all track & field at Tokyo in 2021.\nA 2003 graduate of the University of Notre Dame, Riley started working football broadcasts for NBC while still a student. During her four years as a student she was also a member of the track & field team, and held school records in the pentathlon and heptathlon.",
  "word_count": 392,
  "scraped_at": "2026-02-14T12:19:58.289328"
}