{
  "article_id": "de6e1a9a5f55",
  "url": "https://thenationonlineng.net/ismaila-mabo-15-july-1944-13-march-2023/",
  "title": "Ismaila Mabo ( 15 July 1944 - 13 March 2023 ) | The Nation Newspaper",
  "date": "20230317T060000Z",
  "domain": "thenationonlineng.net",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Editorial\nMarch 17, 2023 by Editorial\nIsmaila Mabo (15 July 1944 – 13 March 2023)\n•Winner or loser, he was the quintessential athlete and unassuming coach nurturing stars\nNot a few still savour the winning start of Ismaila Mabo, the young schoolboy international and his fellow Nigeria Academicals, in 1966. For the first time, the Nigerian Cadet Internationals went to Accra to beat their Ghana counterparts, 1-0. In the return leg in Lagos, they would repeat the same feat, beating Ghana, 2-1.\nIt was the first time ever any Nigerian national side would beat Ghana — and it was fine augury for the glittering club career that awaited the young lad who, straight from school in 1966, joined the formidable but ill-fated Jos XI (later, Mighty Jets of Jos), the township darling club of his native Jos.\nMabo’s schoolboy jump into a Nigerian side would open the doors for many fledgling ex-school boys that later would “breeze” into the national team, by the sheer audacity of their skills: Haruna “Master Dribbler” Ilerika, Stephen “Big Boss” Keshi and Henry Nwosu, the youngest lad in the Green Eagles that won the African Cup of Nations, for the very first time in 1980, in Lagos.\nSadly, however, Mabo’s winning start with Nigeria would not translate into club glory, with the Mighty Jets, perhaps the most ill-fated club in the Nigerian football firmament.\nMighty Jets (as Jos XI) first reached the final of Nigeria’s FA Cup (now the Aiteo Federation Cup, then popularly known as Challenge Cup) in 1951. Jos lost 2-3 to Lagos Railways, then the Lagos powerhouse of Nigerian football.\nThen, from 1962 to 1967, Mighty Jets reached six straight FA Cup finals and lost all! — 1962: 0-1 loss to Nigeria Police FC; 1963: 0-1 (Port Harcourt FC); 1964: 1-3 (Lagos Railway FC); 1965: 1-3 (Lagos ECN FC); 1966: walk-over loss to Ibadan Lions (since pre-Civil War tension prevented the Jos club’s many Igbo players from travelling to play the final in Lagos); 1967: 1-3 (Stationery Stores FC of Lagos).\nThe young Mabo joined Mighty Jets in 1966, and but for the walk-over, would have played in that 1966 final loss. But he would suffer two further future FA Cup final losses with the team: 1970: 1-3 (Lagos ECN) and 1972: 2-3 loss in the Ibadan replay, after a 2-2 draw in Lagos, a week earlier (Bendel Insurance FC).\nBy that time, the Lagos sporting press had dubbed Mighty Jets the “Soroye” (Yoruba regal quip for near-miss: one who ‘sees’ the throne but would never mount it!). That was the perennial fate of the Jets, even with talented defender, Mabo and iconic attackers, Sam Garba Okoye and Layiwola Olagbenro in their ranks!\nBesides, the Jos quest as the first northern side to win the FA cup eluded them. BCC Lions of Gboko, Benue State (ironically from the old Benue-Plateau corridor), would earn that record in 1989.\nMabo’s FA Cup crashes with Mighty Jets would rank among the epochal failures of Nigerian club football. But that was as depressing as Mabo’s success with the Super Falcons, Nigeria’s women national team, was spectacular.\nIn 1998, Coach Mabo propelled the Falcons to their first African Women’s Championship (AWS) title in Lagos, with his girls scoring 28 goals and conceding none, at that inaugural championship on home soil. He would boss that team till 2001/2002, when the Falcons were well-neigh invincible, thrashing all comers.\nWhat is more? During his reign as Falcons boss, he produced two African Women Players of the year, in Cynthia Uwak and Perpetua Nkwocha. During that era too, the Falcons’ safest pair of hands was reported to have hidden an advanced pregnancy just to be between the sticks!\nMabo would also drive Falcons to the quarter-final of the 1999 FIFA Women’s World Cup — the farthest any Nigerian or African side has so far gone — only stopped by Brazil by a lone golden goal, in extra-time, after a 0-0 draw at full-time.\nThe Falcons would build on that mighty Mabo foundation to annex nine AWC titles — a record by miles, compared with their other African female rivals. Besides, that foundation has produced the likes of Barcelona FC of Spain’s Asisat Oshoala, current African women footballer of the Year.\nSomething remained constant with Ismaila Mabo — at the dale of club cup failure with Mighty Jets and at the peak of sterling coaching success with the Super Falcons: he was the quintessential athlete and coach, totally devoted to his craft on the pitch and to his stupendous nurturing of his girls, turning many of them into African champions and world beaters.\nMabo lived the conclusive phase of his long life in ill health. He died reportedly after a bout of illness.\nThe epigram on his grave may well read: Here lies the athlete, true to his craft and to his sporting country, in seasons of club adversity and national team glory, without a shred of scandal to his name.\nHe died a hero and fit road model for up-coming footballers, coaches and sundry athletes. His family should take huge comfort in that stellar image, as they mourn his passage in ripe old age.",
  "word_count": 863,
  "scraped_at": "2026-02-14T12:51:51.640153"
}