{
  "article_id": "de6fee0b3da3",
  "url": "https://www.centralwesterndaily.com.au/story/8250981/the-mp-didnt-believe-wed-get-it-meet-the-man-who-brought-sbs-to-orange/?cs=103",
  "title": "Mario Ruggiero brought SBS to Orange and has Women World Cup fever | Central Western Daily",
  "date": "20230629T033000Z",
  "domain": "centralwesterndaily.com.au",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "With the ability to watch hundreds if not thousands of television shows at the click of a button, gone are the days of wiggling the 'bunny ears' in an attempt to get a crystal clear view.\nSubscribe now for unlimited access.\nor signup to continue reading\nBut one man who knows all too well about the struggle that came with the early days of TV is Mario Ruggiero.\nBorn in Italy, he moved to Australia in 1960 and a year later, came to Orange where he would meet the woman he would eventually marry.\nOver the next decade, the pair would live in Sydney and Bathurst, before a full-time move to the Colour City came in 1970.\nMr Ruggiero worked at Orange Base Hospital for 27 years, but that career was nearly over soon after it began.\n\"I started in the kitchen and I didn't like it,\" he said.\n\"But they knew I was a good worker and they asked me if I would stay if I could get a different job. I asked where they would put me.\"\nHe would become store manager and purchasing officer before a back injury sent him into early retirement.\nBut it's not his time at the hospital for which he became most known for.\nHaving grown up in Europe for the first 22 years of his life, it would come as no surprise to anyone that Mr Ruggiero was an avid soccer fan and player.\n\"There was soccer galore,\" he said.\nWhile he has loved the 50-plus years living in Orange, there was one point in the early 1990s where he became quite annoyed with life in the Central West.\nSBS launched on October 24, 1980 and slowly expanded it viewing capabilities over the next two decades.\nDuring this time, SBS acquired exclusive TV and radio rights to cover the 1990 FIFA World Cup. Much to the dismay of Mr Ruggiero, he would not be able to watch the sport he loved so dear.\n\"I did want to watch the soccer matches and the only ones we got were when, very rarely, the ABC would put on the FA Cup,\" he said.\n\"The SBS had all the soccer matches on. I wondered why we couldn't get it.\"\nThis is when he decided to take action.\nMr Ruggiero started up a petition to bring SBS to Orange. It garnered thousands of signatures and he brought it to the attention of David Simmons, the acting Member for Calare at the time.\n\"He took it, but didn't believe we'd get it,\" he said.\nHe was told that in order to make SBS available, he would need to raise $40,000 to cover the costs to construct the necessary equipment atop Mount Canobolas.\nWith the help of \"quite a few\" Italians and Greeks who were living in town, they managed to raise just over half the funds, with Orange City Council chipping in to cover the rest.\nSo in the early 1990s, he had accomplished his goal and on January 4, 1994, was officially honoured by the council for his hard work and dedication.\n\"This certificate recognises the valued contribution to the Orange City Council SBS Broadcasting Contribution Fund made by Mr M. Ruggiero,\" the certificate read.\n\"This contribution has allowed the citizens of Orange to receive the SBS television service.\"\nFair to say, he felt very chuffed with himself after it was all said and done.\n\"I could also watch the Italian news and now there were all kinds of soccer games on TV that I could watch,\" he said.\nNow, life has come full circle, with Australia set to host the Fifa Women's World Cup beginning in July.\nHe was pleased the country he had come to call his own was finally getting recognised for its involvement in the World Game.\n\"Before, Australia was just an ordinary thing, but now we're starting to make a name for ourselves,\" he said.\nAsked who he would barrack for in a potential clash between Australia and Italy, he was unwavering with his response.\n\"I go for Australia,\" he said.\n\"Let's put it this way, the place where you are born is always a part of your heart, nobody can deny that. But I will go for Australia.\"\nThe icing on the cake for the die-hard soccer fan is he already has tickets to the World Cup final secured.\nNow he just needs the Matildas to deliver on the big stage.\nReading this on mobile web? Download our news app. It's faster, easier to read and we'll send you alerts for breaking news as it happens.\nDownload in the Apple Store or Google Play.",
  "word_count": 774,
  "scraped_at": "2026-02-14T12:14:33.978294"
}