{
  "article_id": "de7a52db45bb",
  "url": "https://www.springfieldnewssun.com/news/nation-world/ousmane-dembele-and-chloe-kelly-nominated-for-mens-and-womens-ballon-dor-awards/LZJ72HUN3JLZXEII27N2PFJKHU/",
  "title": "Ousmane Dembélé and Chloe Kelly nominated for men and women Ballon dOr awards",
  "date": "20250807T161500Z",
  "domain": "springfieldnewssun.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "The 28-year-old Dembélé was inspirational in leading PSG to its first Champions League title after years of falling short and helped the French club complete a treble. He scored a career-high 35 goals overall for PSG last season.\nTeenage star Lamine Yamal, whose mesmerizing performances lit up the Champions League and helped Barcelona win the Spanish league title, is among the other men’s nominees.\nKelly starred for England at Euros\nWhen England won the women's European Championship last month, the 27-year-old Kelly blasted home the decisive penalty in the final against World Cup winner Spain. She also played a key role earlier in the tense knockout stages.\nLast season, Kelly played on the right flank as Arsenal won the women’s Champions League with another against-the-odds win over powerhouse Barcelona.\nShe faces competition from defender Lucy Bronze and goalkeeper Hannah Hampton — her England teammates who both play for Chelsea — and from Barcelona midfielder Aitana Bonmatí, the winner of the past two awards.\nBarcelona players have won the past four women's awards. Bronze was runner-up in 2019 to U.S. forward Megan Rapinoe.\nPSG players in the spotlight\nDembélé was one of nine PSG players nominated for the men's award, including goalkeeper Gianluigi Donnarumma, forward Désiré Doué, who scored twice in the 5-0 rout of Inter Milan in the Champions League final, and inspirational winger Khvitcha Kvaratskhelia, who joined from Napoli in the January transfer window.\nThe other men's nominees include Egypt striker Mo Salah, whose 29 league goals helped Liverpool win the Premier League, and prolific Real Madrid striker Kylian Mbappé, who netted 44 times for Madrid last season.\nMidfielder Rodri won the Ballon d'Or last year after impressing with Manchester City and Spain but missed most of last season with a knee injury.\nReal Madrid snubbed the star-studded ceremony last year in apparent protest because its forward Vinícius Júnior finished in second place. After staying away, Madrid and its players then vented their feelings on social media.\nThe voting system\nThe Ballon d’Or was created by France Football magazine and has been awarded since 1956 for men, and since 2018 for women. It is voted for by journalists from the top 100 countries in the FIFA rankings for the men's award and the top 50 FIFA-ranked countries for the women's award.\nEach journalist, one per country, selects players in ranked order with points attributed to each position. The winner is the player who receives the most points.\nOther nominations\nPSG coach Luis Enrique was among the nominees for best men's coach and England's Sarina Wiegman best women’s coach.\nDonnarumma, whose shot-stopping in the knockout stages proved crucial to PSG's success, is favored to win the Lev Yashin award for best men's goalkeeper, while Hampton is among the five women's candidates for that award.\n___\nAP soccer: https://apnews.com/hub/soccer",
  "word_count": 468,
  "scraped_at": "2026-02-14T13:23:07.171223"
}