{
  "article_id": "de80d0bf49f4",
  "url": "https://www.pilotonline.com/2025/05/22/virginia-wesleyan-shuts-out-gettysburg-in-softball-super-regional-game-1/",
  "title": "Virginia Wesleyan shuts out Gettysburg in softball Super Regional Game 1",
  "date": "20250523T014500Z",
  "domain": "pilotonline.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "COLLEGE SOFTBALL\nVa. Wesleyan rolls in Super Regional opener\nVirginia Wesleyan dominated Gettysburg 8-0 in the opener of a best-of-three NCAA Division III Super Regional at the Marlins’ field in Virginia Beach.\nLauren Bible (25-1) pitched a two-hit shutout for the Marlins (45-3-1) in a game shortened to five innings because of the eight-run rule. She walked two and struck out three in VWU’s 14th consecutive victory.\nBullets starter Paige Forry (30-6), a three-time Centennial Conference Pitcher of the Year, shut out VWU for the first two innings, but the Marlins — ranked fifth nationally before the 64-team tournament began — scored four unearned runs in the third. Haley Sadler scored on Laci Campbell’s fielder’s-choice grounder, Sarah Prosser came home on Morgan Tucker’s groundout to second, and Mackenzie Myers hit a two-run single.\nIn the fourth, Olivia Knight homered, Sadler scored on Prosser’s groundout and Campbell hit an RBI single.\nIn the fifth, needing just one run to end the game, the Marlins got it when Jenna Laird scored on a throwing error by the Gettysburg shortstop.\nGame 2 is set for 1 p.m. Friday, and if the No. 17 Bullets (41-7) even the series, the decider will follow at about 3:30.\nNo. 24 Randolph-Macon and No. 18 Moravian postponed their Super Regional opener in Bethlehem, Pennsylvania, to 1 p.m. Friday because of weather. Game 2 will follow at 3:30 Friday, and Game 3, if necessary, will be at 11 a.m. Saturday.\nCOLLEGE FOOTBALL\nNSU signs linebacker, lineman via transfer\nNorfolk State signed Tulsa transfer linebacker Daniel Ademisoye and Union Commonwealth transfer offensive lineman Kamren Reese to its recruiting class, joining more than 30 signees.\nReese, from Stockbridge, Georgia, excelled as a freshman for Union Commonwealth. The 6-3, 240-pounder racked up 21 tackles, eight for loss, and five sacks.\nAdemisoye, from Canoga Park, California, spent his last three years with Tulsa.\nEx-Oscar Smith TE transfers to Southern Miss\nFormer Oscar Smith High standout Tory Johnson Jr. has transferred to Southern Mississippi.\nJohnson, a 6-foot-3, 225-pound tight end, played two seasons at Marshall. He redshirted his first year and played in three games last season, primarily on special teams.\nODU to host football clinic for women\nCoach Ricky Rahne will launch his first ODU Football Women’s Clinic on June 20, beginning at 3 p.m. The clinic is $100 per person.\nA tour of the L.R. Hill Sports Complex and S.B. Ballard Stadium will take place, as will instruction from ODU’s coaching staff on a variety of areas, including strength and conditioning and a breakdown of offense, defense and special teams.\nThe clinic will include offensive and defensive field work and a Q&A session with women who work in ODU athletics. The night will conclude with a social hour in the Priority club of S.B. Ballard Stadium.\nLOCAL SOCCER\nLionsbridge dominates division foe in Maryland\nLionsbridge FC (2-0-1) routed Patuxent Athletics 8-1 in Maryland in a USL League Two Chesapeake Division match.\nFelix Ewald and Denis Krioutchenkov both scored three goals, the first time in club history that two Lions scored a hat trick in the same game. Ewald was subbed out at halftime.\nAndrew Bennett had three assists. Gabi Rodriguez and Sam Hall added the Lions’ other two goals. They led 6-1 at halftime despite yielding a goal in the fifth minute.\nVirginia Beach United’s USL W League team beat the Richmond Ivy 2-0 at Virginia Beach Sportsplex. VBU gained payback from a 3-0 earlier loss to the Ivy.\nCOLLEGE WOMEN’S BASKETBALL\nNorfolk State adds ex-Va. State standout\nNorfolk State coach Jermaine Woods announced the addition of transfer forward Carmen Kweti, a 6-foot senior from Virginia State.\nKweti, a native of Frederick, Maryland, received CIAA Defensive Player of the Year honors. She averaged 6.7 points and led the CIAA with 11.8 rebounds per game, which ranked fourth nationally in Division II.\nBefore going to VSU, she spent two seasons with Division II Adelphi.\nPRO TENNIS\nFormer ODU star wins twice in French qualifying\nFormer Old Dominion star Yuliia Starodubtseva of Ukraine has gone 2-0 so far in French Open qualifying on the Roland Garros clay in Paris. Ranked 86th in the world, she will face 193rd-ranked Sara Bejlek, a 19-year-old from Czechia, on Friday morning for a spot in the draw of 128.\nStarodubtseva, 25, who made all four majors in 2024 via the qualifying bracket and also was in this year’s Australian Open, has beaten No. 196 Hanne Vandewinkel of Belgium 6-3, 6-1 and No. 154 Tamara Zidansek of Slovenia 3-6, 6-2, 6-3 so far in qualifying in Paris.\nStarodubtseva is ranked 86th in the world, tops of any player in the qualifying bracket.\nGOLF\nBeck, partner win U.S. Amateur Four-Ball\nReigning U.S. Mid-Amateur champion Evan Beck of Virginia Beach, added yet another accomplishment to his long list, joining Dan Walters of Winston-Salem, North Carolina, to win the U.S. Amateur Four-Ball in Edison, New Jersey.\nAfter tying for 22nd among 128 tandems in qualifying with a 1-under-par 139 and being seeded 25th in the field of 32 tandems, Beck, 34, and Walters, 40, won five matches. That culminated with Thursday’s 3-and-1 victory over teenagers Will Hartman of Charlotte, North Carolina, and Tyler Mawhinney of Fleming Island, Florida, at Plainfield Country Club.\nBeck and Walters won by fairly lopsided 5-and-4 margins in their first three matches, knocking off the pairs of Ryan Ford/Connor McNeely, Zach Healy/Jack Larkin Jr. and Chad Wilfong/Davis Womble in clashes that all finished on the 13th hole.\nThe semifinal was the closest test for Beck and Walters, a 1-up triumph over Charlie Forster and Steen Zeman.\nBeck competed in the 2025 Masters and will play in the U.S. Open this summer.\nCOLLEGE LACROSSE\nUVA, JMU star named All-Americans\nVirginia sophomore Kate Galica and James Madison’s Maddie Epke made the All-America first team as chosen by the Intercollegiate Women’s Lacrosse Coaches Association. UVA sophomore Madison Alaimo earned third-team honors.\nIn men’s selections by the U.S. Intercollegiate Lacrosse Association, UVA long-stick midfielder Ben Wayer was a third-team choice and offensive midfielder Griffin Schutz gained honorable mention.\nCOLLEGE TENNIS\nW&M players capture academic honors\nWilliam & Mary women’s seniors Emma Fernald, Hedda Gurholt and Ine Stange and junior Sia Chaudry were selected to the College Sports Communicators Academic All-District Team, which requires at least a 3.5 grade-point average for starters or important reserves.\nW&M men’s senior Sean Joseph, junior Albert Hansen and sophomore Nikita Bortnichek also gained those honors.",
  "word_count": 1069,
  "scraped_at": "2026-02-14T12:43:25.711347"
}