{
  "article_id": "de8106db02fa",
  "url": "https://theathletic.com/4153169/2023/02/05/leydi-urbina-pregnant-venezuela/",
  "title": "Leydi Urbina , the striker who played for six months while pregnant – without realising",
  "date": "20230205T054500Z",
  "domain": "theathletic.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "By the time Leydi Urbina realised she was six months pregnant, she had finished as the top scorer in the Venezuelan women’s top flight, been named in the team of the season, and reached the second leg of the league semi-final and the final of a futsal tournament she competed in during her spare time.\nAdvertisement\nThere had been few signs she was pregnant and no tailing off of the form that had just led her to score 14 goals in as many games for Deportivo La Guaira. Weight gain was the only clue and the one that, in the end, prompted Urbina to take a test.\n“I was amazed because there are so many people who protect themselves and don’t get pregnant,” Urbina, 25, says, speaking from Caracas in Venezuela via a translator and accompanied by Jordan Florit, a Venezuelan football specialist who spotted Urbina while working with one of her former team-mates.\n“I found out and it was a shock, but thanks to God I achieved what I wanted to afterwards. Babies are a blessing. If they arrive in someone’s life, you have to go on and keep fighting for them.\n“But at the beginning: nothing. It was like nothing had happened to me, like I didn’t have anything there. Physically, I was super good. I reached every ball. I was running for every one.” She jokes that in her previous four seasons in the league, she had always narrowly lost out on winning the Golden Boot. “This time I achieved it and look: I was given two blessings.”\nView this post on Instagram\nFlorit told a women’s football agent in England of Urbina, the No 10 who was controlling games with a first touch like a dream. “The girls here don’t have highlights videos or easy access to their match footage to sell themselves to foreign clubs,” Florit explains, adding that he sent the agent a link to Urbina’s Instagram page.\n“Every time I spoke to my colleague in England, she said, ‘We are going to struggle with getting her into Europe as she’s a chunky girl’. Throughout the season, I said, ‘You need to look past this — Leydi is technically superb and she’s scoring’. And then when I found out that she’d been pregnant (and getting bigger) as the season went on, I was like, ‘OK – this makes sense’. It was incredible. It blew my mind that she could achieve all that while pregnant.”\nView this post on Instagram\nUrbina’s team-mates were similarly startled. “I told my team-mates and everyone was amazed,” she says. “They still say they don’t believe it because I played tough. Everything’s perfect — the pregnancy, the placenta. It was a miracle, a blessing.”\nIt is an extraordinary story — the pregnancy, you will learn, is not even the reason she missed out on the aforementioned semi-final second leg — but one that also underlines the fragility of the women’s football ecosystem.\nAdvertisement\nFootballers, including the USWNT’s Alex Morgan and Chelsea’s Melanie Leupolz, have demonstrated that it is possible to return to football after pregnancy and Urbina, too, has already done so once, having given birth to her son six years ago.\nEach will have faced their fair share of trials: Morgan in being one of the first, and certainly the most high-profile, professional footballing mothers and Urbina in a country where female footballers can barely scrape a living if they choose to remain there.\nIndeed, Venezuela’s biggest success story, Deyna Castellanos, left South America for Florida as a teenager and signed for Manchester City last summer.\nUrbina’s interview is also timely given recent events. In January, Iceland captain Sara Bjork Gunnarsdottir won a landmark maternity pay claim against her former club Lyon. Days earlier, the Reading defender Emma Mukandi told Off The Ball’s COYGIG podcast how she would have to breast pump in a cupboard at the club.\nThe English Football Association announced a new maternity policy in 2022 that made it mandatory for WSL players to receive 14 weeks’ maternity pay. Reading say they gave Mukandi eight and a half months of full pay but Mukandi pointed out that if they hadn’t, she would have been stuck. She did not feel ready to play less than four months after giving birth.\nUrbina, meanwhile, is in the process of not only planning the birth of a child due at the end of this month but also her own return, and specifically how she will make it a swift one. After learning of her pregnancy, she continued to exercise gently and trained with a softer ball.\nShe wants a natural birth, because a caesarean section would make for a longer, more difficult recovery. “With a caesarean, I can’t play the next month because it’s dangerous,” she says. “It could hurt my health. But if I give birth, in a month and a half I can recover: training on the outside for a start, keeping in shape and then going in 100 per cent. Various managers have told me, ‘You’re a warrior. You’ll recover’.”\nAdvertisement\nShe has not entertained the thought that she might lose fitness. You wonder, reading between the lines, if she has been able to. “Here, there aren’t contracts; there are agreements,” Urbina explains.\n“You’ve got a competition in two months and they do (the agreement) a month before. It’s not something stable where you’re going to be paid your salary the whole year.”\nUrbina’s agreement, Florit says, is likely to have run from April to October. “Sometimes, they don’t pay you and then December arrives and that’s when they pay you everything,” Urbina says. “If you become pregnant, there’s a fine because it’s breaching your contract.”\nMaybe all this is why she is slightly taken aback when asked what kind of support would make life as a mother in football easier. Her manager has promised to raise her wage slightly and in Urbina’s mind, little else is likely to be forthcoming. “What do you mean?” she asks. “That they would give me more money for being a mum and so on?”\nThe translator reframes the question: what would make her life easier as a mother in football? “Nothing,” she replies. “Here, you play for passion more than anything else. Men’s football is obviously much better paid than the women’s game and they take more notice of them.\n“They don’t take a lot of notice of us. You have to make other sacrifices to be able to support yourself, to be able to have your food. We train but if we don’t have good nutrition, we won’t perform in a match. We won’t go far. If we didn’t love it, nobody would have withstood all these types of situations.”\nThe new season begins in March, just after the baby will have arrived. “She’s intending on playing from the very beginning,” says Florit. “I can’t judge a woman’s body for her, but my wife and I have two kids. My wife wouldn’t have been playing football a month after giving birth.\nAdvertisement\n“The season ended in October when Leydi was six months pregnant. She hasn’t been training (fully), but then she’s going to start playing again when the baby is only a month old. For me, that’s a financial choice because it’s not like she’s now going to have maternity pay or any medical insurance.”\nThe league professionalised several seasons ago but that has always been a tricky term in women’s football. CONMEBOL regulations require clubs to have a women’s team to obtain their licence. In practice, this means that “there are clubs in this division that only exist out of obligation”, Florit says.\n“When Leydi says she plays out of love and passion, that’s admirable and a soundbite that people love to hear — but it reflects the sad reality of an aspect of Venezuelan football. They are doing it out of love and passion, but that’s more because they know that they can’t rely on football to provide them with a life.”\nFlorit believes the majority of Urbina’s team-mates will be earning less than $250 (£207) a month. “It’s good and charming to say these players are warriors, but she shouldn’t (have to) be a warrior because she’s now going to be a mother to a newborn with no additional support.”\nUrbina supplemented her earnings playing professional volleyball, including for the Venezuelan national team, where she could earn twice as much as she did playing football. When La Guaira’s assistant manager found out about this double life, Urbina was benched for the league semi-final second leg (the champion is determined via a play-off system at the end of the season). “Everyone in the stands was calling, ‘Bring Leydi on because we need to win!’,” Urbina says.\n“Because football is badly paid here, players do other things as well. For example, they preferred to work than go to training because if they don’t pay you, you have to sustain yourself.”\nLa Guaira lost that match on penalties. Nine of Urbina’s previous 14 goals had been from the spot.\nAdvertisement\nNonetheless, the club is ready to welcome her back, and Urbina has fielded calls during the off-season from other interested parties. Three years ago, she had an offer to play abroad. She wouldn’t be averse to doing so, even as the Venezuelan league improves with the addition of women who have played in Spain and Brazil.\n“Having the doors open and (giving) a future to my children gives the best motivation to demonstrate to them that despite everything, they have a mother who is a warrior,” Urbina says.\n“(Someone) who is determined to show them that the best thing in the world is studying, having a job and sport. Which is the most beautiful thing. Imagine playing for six months while pregnant and everything is perfect. That’s a miracle from God and it will be my next blessing and to go on afterwards. That doesn’t take away my dream.”\nTranslation by Tomas Hill Lopez-Menchero\n(Top photo: Leydi Urbina’s Instagram)",
  "word_count": 1670,
  "scraped_at": "2026-02-14T13:01:55.206175"
}