{
  "article_id": "deae62f2bc2f",
  "url": "https://liverpooloffside.sbnation.com/liverpool-fc-women-news-results/76628/spurs-2-liverpool-fc-women-1-0-points-yet-again-for-the-reds-wsl-25",
  "title": "Spurs 2 , Liverpool FC Women 1 : 0 Points Yet Again For The Reds",
  "date": "20251102T174500Z",
  "domain": "liverpooloffside.sbnation.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Spurs 2, Liverpool FC Women 1: 0 Points Yet Again For The Reds\nBeata Olsson scored her first goal for the Reds, but Liverpool could not retain a lead or a draw as they lost again.\nLiverpool: Olsson 11’\nPre-Match\nThe Liverpool FC Women return to from the international break still in search of their first points of the season. The club has endured tragedies, injuries, and just plain poor play through the opening five matches under new manager Gareth Taylor. Spurs, meanwhile, have had a hot start to the season, sitting fourth in the table.\nGareth Taylor finally has the ability to field two natural fullbacks for the first time this season, starting Risa Shimizu on the right and Lily Woodham on the left. Gemma Bonner misses out through a short-term injury, so Grace Fisk and Gemma Evans start in the center of the defense. With Marie Höbinger and Sophie Roman Haug missing due to ACL tears just before the international break, Taylor has had to shake up his midfield and attack. Ceri Holland drops into her natural central midfield role while Beata Olsson is given a chance to lead the line. Mia Enderby will move out to the right attacker role to replace where Holland had played and to accommodate Olsson. One last wrinkle for the Reds is Faye Kirby starting in net. Rafaela Borggräfe is on the bench, as is Rachael Laws for the first time this season.\nFirst Half\nLiverpool recycle possession from high up the right wing all the back to the goalkeeper, and then build back up down the left wing. A nice give and go sees Lily Woodham set free to charge forward, but she is pulled back by Jessica Naz. A foul is quickly called and Naz kicks the ball away. Both infringements could have easily been yellow cards, but the referee decides to give her a talking to in just the second minute of play.\nAfter retaining possession with a series of backwards passes while in the attacking half, Liverpool finally look to make an incisive pass for Ceri Holland down the right channel. Holland earns a corner after her cross is blocked out. Liverpool attempt to take it short to Cornelia Kapocs, and the Swede loses the ball and the opportunity is wasted.\nIn the early going, it has surprisingly been Cornelia Kapocs, a striker by trade playing in midfield. Ceri Holland, a midfielder by trade, is playing as the right sided attacker. Mia Enderby is on the left, with Beata Olsson through the middle. Kapocs is a bit of a turnover machine, losing a high percentage of duels, so this seems to be a\nGOAL LIVERPOOL!!! The Reds may have just gotten a break as Beata Olsson stuffs the ball in from close range after receiving a ball from what looked like a clearly offside position. The sequence started out left with Grace Fisk driving forward before cutting the the ball back on the ground into the box. Ceri Holland charges in and gets her foot to the ball to pass to Olsson, who turns and slides the ball into the net from a yard out. A wider view shows the Spurs left back standing just on the end line, so Olsson was actually onside. Either way, Liverpool will not complain as the Swedish striker gets her first goal for the club!\nLiverpool look to double their lead quickly after scoring their first. It’s Olsson again, picking the ball up in a pocket of space at the top of the box. She quickly turns and drives a shot on goal, but it is well saved.\nSpurs attack down their right side, getting the ball to the end line and try to get a cross in. Lily Woodham slides in and blocks the cross, but takes a ball to the face, getting a bloody nose for her efforts. While she is getting checked out, Spurs take their corner kick.\nGoal Spurs. The hosts play the ball on the ground to the top corner of the box for Olivia Holdt. The forward easily carries the ball past a couple of defenders as she drives to the end line. Her cross is partially blocked by Grace Fisk, causing the ball to loop up over Faye Kirby and falls for Toka Koga to smash the ball into the net from just a couple inches out.\nLiverpool have put themselves in a world of trouble several times now trying to play the ball backwards with not enough pace on the ball or not recognizing there is an attacker very close to where the pass is going. Faye Kirby is put in a terrible position by a poor back pass and does just enough to poke it away. At some point, Liverpool will have to actually play the ball forward.\nSpurs have carved through the Liverpool defense several time now with defenders heavily overcommitting. Gemma Evans is the latest such player, getting beat all too easily from a simple cut back. Thankfully the resulting shot is easily held by Faye Kirby.\nLiverpool with a little bit of actual positive attacking play. Lily Woodham intercepts a ball and quickly passes it to Cornelia Kapocs at the top of the box. The Swede slips a pass into her compatriot, Beata Olsson, but the striker puts her shot wide from a tight angle as a defender slides in. That will count as the third shot from Liverpool so far, with all coming from Olsson.\nFaye Kirby is down on the other end of the pitch after the Liverpool attacking sequence. She receives treatment on her knee for a couple of minutes before play resumes.\nLiverpool press high and earn a corner kick on their attacking right. Lily Woodham sends an inswinger into the box and Grace Fisk flicks the ball into a scrum in front of net. The ball gets cleared before Liverpool regain possession and look to start the attack again. A poor pass sees Spurs take possession back.\nLiverpool look to find a second goal before halftime. Mia Enderby receives the ball in a pocket of space and drives forward towards the box. She unleashes a shot from outside the box to try and catch Lize Kop unawares, but the Spurs goalkeeper is able to comfortably catch the ball as it swerves in towards her at a comfortable height.\nSpurs earn a corner kick in added time of the first half. Liverpool partially clear the ball, but Gemma Evans is down holding her face after challenging for a headed ball. She gets checked out by the medical staff and is ushered off the field of play after a couple of minutes. Play resumes with a drop ball to Spurs 25 yards from goal and they quickly shift it to the left flank. The ball is clipped inside for Drew Spence and Faye Kirby has to make a good diving save on the headed shot.\nThat’s the last significant action of the first half of a fairly balanced match. Liverpool have looked more lively over all, with some decent ball movement and passing sequences to generate a handful of chances.\nSecond Half\nMia Enderby with a great bit of play starting deep in the Liverpool half, winning a ball and bursting past two players before sliding a great ball forward for Cornelia Kapocs in the left channel. The Swede carries the ball forward and passes it inside for Ceri Holland who attempts to combine with Beata Olsson. Spurs block out the return ball, but it was a nice sequence.\nGoal Spurs. It’s just too easy for the hosts as Olivia Holt plays a ball over the top for Amanda Nildén down the left flank. The Swede gathers the ball and plays a square ball into the box for Bethany England to slam into the net. England ran between two defenders to get to the ball.\nLiverpool look to strike right back after conceding. Lily Woodham plays a good ball inside for Ceri Holland at the top of the box. The Welshwoman quickly turns and slips the ball through for Mia Enderby in the box. Enderby gets a first time shot away after running onto the ball, but it is just wide of the near post.\nLiverpool earn a corner kick on the right after Ceri Holland carries the ball forward and plays a ball off a defender. Lily Woodham sends the ball in, but it is claimed by Lize Kop as it curls in towards the crossbar.\nCeri Holland is shown a yellow card for what seems like a pretty minor foul. She just catches the toes of Amanda Nildén after challenging for a ball. There was nothing in it, but the Swede rolls around and yells at the referee until the referee gives a yellow card to Holland.\nGareth Taylor makes his first change in the 62nd minute. Jenna Clark comes on for Lily Woodham, meaning we will yet again have a center back playing at fullback. Woodham is coming back from an injury layoff, so probably best for the long term to manage her minutes. She was very good down the left flank for the Reds today, however, and her attacking output will be missed.\nMia Enderby is clearly fouled right in front of the referee in the defensive half, but the referee ignores the foul. Liverpool regain the ball and Cornelia Kapocs shows some nice footwork to turn past a player before spraying the ball wide to Ceri Holland. She drives forward with the ball and gets near the edge of the box. Holland tries to get the ball to Beata Holland in the center of the box, but she gets the pass all wrong and lets Spurs off the hook.\nGrace Fisk with a brilliant tackle facing her own goal just at the top of the box. She gets a toe to the ball just ahead of Bethany England to deny a 1v1 situation. The ball goes out for a corner, which Faye Kirby is forced to punch out for a second corner. The second ball in gets redirected towards goal but floats over the crossbar. Faye Kirby crashes into the goal post as she tries to track the ball and looks to have injured her ankle.\nGareth Taylor brings on Sofie Lundgaard during the injury break. She comes on for Sam Kerr in midfield.\nMia Enderby does well to carry a ball through the middle and then find Ceri Holland out right. Holland again is isolated in a 1v1 situation and cuts the ball back to beat her defender. She sends in a dangerous cross into the middle, but Beata Olsson can’t get to the end of it ahead of a defender.\nCeri Holland earns a free kick on the right wing after getting hauled down. She takes the free kick herself, lofting the ball into the box. The ball has no swerve on it, allowing Lize Kop to come claim it.\nWith Liverpool down a goal in the 85th minute, Gareth Taylor takes off his best player in Ceri Holland. She may have taken a knock when she was fouled a few minutes earlier. Kirsty Maclean is the player who comes on for Holland.\nMia Enderby again gets walloped by a defender, and the referee decides not to call a foul. Enderby stays down behind the play in great discomfort. Gemma Evans heads the ball out eventually so Enderby can be seen to. She is in tears as the medical staff check out her head and neck. Hannah Silcock is readied on the bench as the delay goes on for over 10 minutes. Enderby is stretchered off the field with her head strapped in to the back board. Let’s hope she will be ok.\nCornelia Kapocs has a chance in the box after cutting inside a defender. She can’t keep her balance as she shoots, however, and the shot goes over the net.\nBeata Olsson does some hard work down the right to get on the end of a pass to the touch line and then carry it between two defenders and earn a free kick outside the right side of the box. Kirsty Maclean sends the ball in, but it is headed away. Liverpool regain possession and look for an opening, but a ball in is claimed by Lize Kop.\nTwo Liverpool defenders stand and watch a ball as it rolls over the end line near the corner flag to get a goal kick. The referee awards a corner kick. Spurs keep the ball just long enough to kill off the rest of the time on the clock and that’s the end.\nFinal Thoughts\nLiverpool looked better in general, but there are no moral victories to be had when the club still have yet to register a point after six matches. There were more opportunities created on the day than the previous few matches, but the Reds still are not providing any sort of a consistent threat in attack. Fuka Nagano was fantastic in midfield, but the club needed more from Sam Kerr and Cornelia Kapocs to stamp some sort of authority in the middle of the pitch. Kapocs playing in midfield while Ceri Holland played as the right sided attacker was a very odd choice.",
  "word_count": 2216,
  "scraped_at": "2026-02-14T12:44:16.725365"
}