{
  "article_id": "deb5c98a1a3d",
  "url": "https://edition.cnn.com/2024/04/09/politics/biden-japan-state-visit-dinner/",
  "title": "Bidens roll out the diplomatic – and literal – red carpet for Japan state visit",
  "date": "20240410T011500Z",
  "domain": "edition.cnn.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "President Joe Biden and first lady Dr. Jill Biden will roll out the diplomatic – and literal – red carpet Wednesday for Japanese Prime Minister Fumio Kishida and his wife, Yuko Kishida, welcoming them to the White House for a meticulously planned official visit intertwining and highlighting American and Japanese cultures, including the music of Paul Simon and towering cherry blossom branches.\nThe White House will lean into the full pomp and circumstance of a state visit as the president seeks to emphasize the strong alliance between the two countries. Biden has made his Indo-Pacific strategy and efforts to serve as a counterweight to China a key plank of his foreign policy, even as wars in Ukraine and Gaza have captured much attention during his first term.\n“We celebrate the flourishing friendship between the United States and Japan,” Jill Biden said at a media preview of the event Tuesday evening.\nShe continued, “Our nations are partners in building a world where we choose creation over destruction, peace over bloodshed, and democracy over autocracy,” underscoring the importance of the alliance.\nThe Bidens welcomed the prime minister and his wife to the White House on Tuesday evening, hosting the couple for a casual dinner at BlackSalt, a local seafood restaurant. The formalities will kick off Wednesday morning with an official arrival ceremony on the South Lawn, which includes a military review, a performance of both countries’ national anthems and remarks from both heads of state. The leaders will then retreat to the Oval Office for bilateral meetings. They will hold a joint news conference in the afternoon.\nIn the evening, 230 guests will arrive for a glitzy, black-tie dinner, the result of weeks of planning by the White House social team, the East Wing, the State Department and event planner Bryan Rafanelli.\n“Every detail,” Jill Biden said Tuesday, “has been thoroughly planned by an incredible team of people from across our government.”\nThe first lady worked closely with White House executive chef Cris Comerford and White House executive pastry chef Susie Morrison on Wednesday’s menu, which blends American and Japanese flavors.\nGuests will dine on a colorful first course inspired by a California roll: house-cured salmon with avocados, grapefruit, watermelon radish, cucumber and shiso leaf fritters.\nFor the main course, it’s dry-aged ribeye steak, shishito pepper butter and a fricassee of fava beans and morels.\nAnd a pink and green dessert course will complement the color scheme: a salted caramel pistachio cake, matcha ganache and cherry ice cream with raspberry drizzle.\nThe White House will serve wines from the Willamette Valley and Columbia Valley in the Pacific Northwest.\nThe first lady also took special care in designing the evening’s décor, which celebrates spring and a key symbol of the US-Japan relationship: cherry blossoms.\nGuests will dine in an East Room “garden,” a floral-forward design filled with sweet peas, roses, peonies, hydrangeas and cherry blossom branches. They will sit on light pink velvet chairs with metallic pale green and white table coverings adorned with florals, pink glassware, china from the George W. Bush and Lyndon B. Johnson collections, and custom place cards and menus designed by the White House calligraphers’ office.\nThe fan will be a prominent symbol throughout the décor – the motif “representing the beginning of life and each pleat representing the many paths our lives can take,” said social secretary Carlos Elizondo – and will serve as a backdrop for the leaders’ toasts.\nAs guests walk the Cross Hall to the State Dining Room for a post-dinner performance, they will traverse a vinyl floor covering that will mimic a koi pond.\nPaul Simon is expected to perform “a selection of his iconic songs” for guests, Elizondo said.\nThe fine attention to diplomatic detail was also evident in Tuesday’s official gift exchange. The Bidens presented their counterparts with a three-legged black walnut table handmade by a Japanese American owned company in Pennsylvania, the White House said. The table features a special plaque commemorating the visit.\nThe president also gifted the prime minister a custom framed lithograph and a two-volume LP set autographed by the musician Billy Joel, plus a vintage vinyl record collection. The first lady gifted Yuko Kishida a painting of a cherry tree they planted together and an autographed soccer ball signed by the US Women’s National Soccer Team and the Japanese Women’s National Football Team before a SheBelieves Cup semifinal match last weekend, the White House said.\nWednesday’s festivities will mark the fifth time the Biden administration has hosted a state dinner. The Biden White House has previously hosted the leaders of Australia, India, France and South Korea for state visits.\nCNN’s Arlette Saenz, Kayla Tausche and Sam Fossum contributed to this report.",
  "word_count": 785,
  "scraped_at": "2026-02-14T13:40:10.935018"
}