{
  "article_id": "debb17fa6210",
  "url": "https://goutsa.com/news/2025/02/3/lisa-campos-our-bold-approach-to-the-future",
  "title": "Lisa Campos : Our Bold Approach To The Future",
  "date": "20250204T153000Z",
  "domain": "goutsa.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Dear Roadrunner Family,\nAs we kick off 2025, I want to express my immense excitement about the future of UTSA Athletics. It’s no secret that college athletics is experiencing significant change at a rapid pace. While this transformation may bring challenges to programs across the nation, the opportunity to directly support our student-athletes on their academic journeys has never been greater.\nSpecifically, NIL (Name, Image and Likeness), conference realignment, the transfer portal and the House v. NCAA proposed settlement have – and will – all dramatically modify the ways in which we operate. If the House settlement is fully approved this spring, which we anticipate, it will change the collegiate model.\nUTSA Athletics is well prepared for this moment and we will continue to be proactive in our efforts to adapt and thrive in this new landscape.\nThroughout my tenure as UTSA’s Vice President for Intercollegiate Athletics, we have been committed to providing the best environment possible for our nearly 400 student-athletes, as we fully fund each of our sport programs, provide first-class programming in student-athlete development, and focus on excellence in the classroom, in the community and in competition.\nThat emphasis will not change, but the way in which we deliver it will evolve. New legislation will allow us to provide additional financial arrangements to our student-athletes, while offering increased roster opportunities and additional scholarship support. This approach, which we will take along with our American Athletic Conference peers, will be critical as we move into a new future of college athletics. Simply put, we will have to change the way we operate and will need your continued increasing support to generate additional revenue.\nBelow, you will find two important updates: (1) A summary of the changes we anticipate from the House v. NCAA proposed settlement and (2) A roadmap of our BOLD approach to the future. These updates will provide the latest information about our commitment to the development of our student-athletes and their future success.\nAs I have said before, for us to achieve our ambitious goals, it will take each and every one of us coming together to provide support. Please know that while we are committed to our approach, we are also prepared to make any necessary adjustments as the landscape continues to evolve.\n---\nWhat Changes Are We Anticipating?\nHouse v. NCAA Settlement: House v. NCAA is the consolidation of class action lawsuits filed by former student-athletes against the NCAA and the Power Five conferences, regarding rules that prohibited student-athletes from earning compensation for the commercial use of their Name, Image and Likeness (NIL). In the simplest terms, the House vs. NCAA proposed settlement will conclude three active lawsuits that challenge current NCAA rules regarding payments to student-athletes. The hearing on final approvement of the settlement is set for April 7. We expect, and are planning for, the settlement to be approved.\nPast Damages: As part of the House settlement, the NCAA will pay approximately $2.8 billion over 10 years to more than 14,000 former and current student-athletes, dating back to 2016, who were not able to participate in Name, Image and Likeness activities that are now permissible. While the lawsuit only focuses on student-athletes at Power Four institutions, the settlement calls for all NCAA Division I institutions to contribute to past damages. It is difficult to precisely estimate the full financial impact but we project that UTSA will pay close to $5 million over the 10-year period via reduced revenue distribution from the NCAA.\nRevenue Sharing: Under the terms of the House settlement, institutions would be allowed to share revenue directly with student-athletes. I know there have been many questions about revenue sharing models, financial figures and the support we will be able to provide to our student-athletes. We have been diligently planning for revenue sharing with student-athletes and I look forward to detailing this plan in the near term. We are closely coordinating with the American Athletic Conference and our colleagues across the conference on establishing revenue sharing thresholds. All of the conference members will observe and coordinate their plans around these developments. As a state agency, UTSA uses annual budget-setting processes and protocols that are approved by the UT System and are part of discussions held with the State and legislature during legislative sessions. Budgets set for Athletics follow this annual cycle during the September 1 to August 31 fiscal year. As we build the Athletics budget, all sources available for revenue sharing are being evaluated.\nTitle IX Implications for Revenue Sharing: We are committed to Title IX and gender equity at UTSA and in our Athletics program. Earlier this month, the United States Department of Education Office for Civil Rights offered guidance that NIL money paid to college athletes should be held to the same gender-equity standards as athletic scholarships. We will be closely monitoring these developments.\nRoster Limits: The NCAA currently places limits on the number of scholarships that may be awarded in each sport - but does not limit a sport’s roster size. As part of the House settlement, there would be limits on each sport’s roster size, but institutions will now be permitted to award as many scholarships as there are roster spots. While we are still evaluating the impact on our 17 sports programs, we are committed to creating more opportunities for student-athletes by increasing scholarships and roster sizes. Your support of the Roadrunner Athletic Fund is critical in creating these additional scholarship opportunities.\nName, Image and Likeness: UTSA student-athletes will continue to benefit from additional Name, Image and Likeness opportunities. The House settlement sets new rules for NIL activities, which includes a national clearinghouse that will evaluate NIL opportunities greater than $600 and will also monitor the NIL process. I am a proponent of this greater transparency, as I believe it will provide standardization to a currently ambiguous process, and hopefully provide a more level playing field across institutions, conferences and states. Our student-athletes will benefit from your support of their Name, Image and Likeness activities through Runners United and the Runners Go Bold Exchange.\n---\nOur Bold Approach To The Future\nWhen UTSA transitioned into the American Athletic Conference in the summer of 2023, we challenged each and every person associated with our program to BE BOLD about our aspirations and the ways in which we operate. We will need your continued increasing support to generate additional revenue.\nHere’s a look at our approach:\nRoadrunner Game Plan: Soon after my arrival at UTSA, we put our energy into the Roadrunner Game Plan, a comprehensive strategic plan that has helped us create a culture of excellence for our student-athletes in academics and athletics, and has unified the San Antonio community in support of our Roadrunners. The Roadrunner Game Plan focuses on three winning values – Excellence, Integrity and Unity – to enhance our student-athlete experience and a core set of pillars and priorities. Over the past year, our administrative leadership team has been revising and refining the pillars of the Roadrunner Game Plan to prepare for our new reality. We have been evaluating every aspect of our operating procedures and structure with the terms of the House settlement in mind, streamlining our approach for a successful future.\nInstitutional Support: President Eighmy has been an incredible supporter and advocate of UTSA Athletics. Along with Veronica Salazar, Executive Vice President for Business Affairs and Chief Enterprise Development Officer, he has been committed to maximizing institutional support of our athletics program. Since I arrived in the fall of 2017, our athletics budget has increased from $24.5 million in FY18 to $48.3 million in FY25, a nearly $24 million increase, with the majority of that funding coming from institutional support. During that time, we have also invested approximately $50 million into the creation of the Roadrunner Athletics Center for Excellence and the Park West Field House with the tremendous partnership of Bexar County and the City of San Antonio, and with the support of our loyal donors. This past February, in collaboration with the University, I announced the commitment of an additional $57 million into athletics facilities with much of that funding coming from the institution. This includes a Basketball and Volleyball Training Facility and player development centers for baseball and softball. Dr. Eighmy and EVP Salazar’s innovative approach to providing institutional support, including the sale of university land at Park West, has been invaluable to UTSA and UTSA Athletics. I am also grateful for the support of the Roadrunner Foundation and President Gene Dawson for their leadership in this area.\nCollectives: In October 2024, we announced the formation of Runners United, which brought together our three key collectives – City Fans 210, 210 Inspired and Runners Rising – to create a community-focused, sustainable approach to NIL. By uniting these collectives, Runners United is able to provide UTSA student-athletes with greater opportunities for NIL compensation, engage the San Antonio community and foster philanthropic support. I am grateful to the three collectives for working collaboratively to support our student-athletes in this unified approach. We will all benefit from the formation of Runners United. To learn more about Runners United and our NIL efforts, visit this comprehensive website.\nNIL Management: Changes in legislation over the past year allows universities and athletics departments to be more directly involved in NIL efforts. I am grateful that we have been able to be more hands-on in working with our collectives, creating Runners United and being able to promote and support our student-athletes’ NIL efforts. Over the next few months, we are hiring an NIL General Manager dedicated to managing NIL engagement with our student-athletes in all sports.\nExpanded Donor Opportunities: The Roadrunner Athletic Fund provides critical scholarship support to our student-athletes in all 17 sports. With the launch of Runners United, contributors to the three collectives now earn RAF Loyalty Points, allowing donor NIL contributions to be even more rewarding. Supporters now receive two RAF Loyalty Points for every $100 donated to Runners United collectives. Additionally, this past summer, UTSA Athletics launched the McCombs Society, our official leadership giving society. Supporters can join the McCombs Society with a minimum pledge of $25,000 over a five-year period or an annual cash gift of $25,000 or more. I am especially grateful to Marsha Shields and the McCombs Family for their initial gift of $100,000 to the Bold Champions Campaign as part of the McCombs Society.\nCorporate Partnerships: Our partnership with our official multimedia rights holder, Playfly Sports, which became effective in the summer of 2023, has brought expanded sponsorship and corporate partnership opportunities to UTSA Athletics. It has greatly enhanced UTSA’s brand identity and sponsorship opportunities on the local, regional and national level. The partnerships will only continue to grow and I am grateful to Playfly and General Manager Robert Stockhausen for their support and work on behalf of UTSA student-athletes. If your business is interested in partnering with UTSA Athletics, click here to learn more.\nTicket Models: Through our partnership with Playfly, we are working with Aspire to examine ticket pricing and new ticketing opportunities for football, including ways that will support revenue sharing with our student-athletes. We are evaluating pricing models, including potential increases for the upcoming season, that would generate additional revenue. In addition, over the past year, we have installed chairback reserved seats at our baseball and softball facilities that include seat contributions to the Roadrunner Athletic Fund. We have also implemented seat contributions to reserved season tickets at men’s and women’s basketball games, as well as courtside seating at volleyball. These contributions directly enhance the resources we are able to provide to our student-athletes. Premium opportunities at the Alamodome will be expanded starting with the 2025 season. New suites, along with club and premium areas, will open in the South End Zone in addition to renovations to existing suites throughout the Alamodome.\nFiscal Review: Sound fiscal management has always been a priority and all of our staff has been deeply committed to the most efficient use of our operating budgets to provide resources that support our student-athletes. We continue to regularly evaluate our budgets and our spending to ensure our dollars are being used effectively.\nGame Day Experience Enhancements: This past football season we created fun game day experience enhancements for our fans that allowed you the opportunity to be part of the action. This included early-bird access and sideline access to the Alamodome, as well as the opportunity to put your special message on the video boards at the Alamodome and Convocation Center. The revenue from these experiences goes to directly support our student-athletes. The offering of these types of experiences will only increase in future years.\nConcessions Roundup: This football season, we partnered with our food and beverage provider, Savor, and the Alamodome to directly support our student-athletes through a concessions round-up program. At participating Alamodome concession stands, fans were able to round up their total to the nearest dollar to support our student-athletes. This was a great and convenient way for all fans to provide support. We’ll continue to seek these types of opportunities moving forward. It may sound cliché, but every cent really does make a difference.\nSpecial Events: We will continue to work with our Runners United collectives to create events within the next year that support NIL efforts, such as luncheons, golf tournaments, concerts and more.\nWe’ve proven many times before that, together as a Roadrunner Family, we are unstoppable. I have no doubt the future is bright as we collectively create the very best experience for our student-athletes. Thank you for your continued support!\nBirds Up!\nLisa Campos, Ed.D.\nUTSA Vice President for Intercollegiate Athletics",
  "word_count": 2271,
  "scraped_at": "2026-02-14T13:19:34.389955"
}