{
  "article_id": "ded1fccda3d2",
  "url": "https://thestandard.org.nz/the-great-policy-bonfire/",
  "title": "The great policy bonfire",
  "date": "20230313T220000Z",
  "domain": "thestandard.org.nz",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Written By:\n- Date published:\n10:44 am, March 14th, 2023 - 45 comments\nCategories: act, chris hipkins, climate change, Environment, labour, michael wood, national, public transport, science, transport -\nTags:\nChris Hipkins continues with his shock and awe campaign and has torched a number of policies that National and Act were using to foment unrest.\nAmong the torched policies are the following:\n- $1 billion in savings which will be reallocated to support New Zealanders with the cost of living\n- A range of transport programmes deferred so Waka Kotahi can focus on post Cyclone road recovery\n- Speed limit reduction programme significantly narrowed to focus on the most dangerous one per cent of state highways\n- Second part of alcohol reform that relates to issues such as sponsorship, advertising and pricing deferred\n- Not introducing legislation to lower the voting age to 16 for general elections. Instead, we will shift focus to lowering the age for voting in local body elections, which has stronger support in Parliament\n- Auckland transport solutions to reduce emissions and congestion will be rolled out in stages\nThere is lots to unpick.\nAuckland’s light rail project is going to be staged rather than built as one project. They could save money by opting for a surface option rather than tunnelling and there is also the option of a route along Manukau Road. But both should be proceeded with. And with the need to urgently get people out of cars to address greenhouse gas emissions continuation of the project should not be delayed.\nThe limitation of speed limit reductions is clearly to take away right wing talking points. There is an environmental and also a safety aspect to the projects but the temptation for the right of making it a campaign rallying issue is now blunted. Just remember light bulbs and shower heads from 2008 to get a sense of what was possible. Totally rational and justifiable policies can get blasted in talkback radio land.\nScrapping the clean car upgrade scheme will save $568 million but will also mean that the transitioning of the vehicle fleet in a more sustainable way will be hampered. Admittedly there may be better options. For instance I have thought the Government could purchase and hand out ebikes with the funds. Money in the car upgrade scheme could afford 200,000 ebikes. This would have a significant and immediate effect on green house gas emissions.\nAnd comments this morning on Radio New Zealand by Chris Hipkins were not helpful. He did not rule out as part of the repriortisation that the funds would not be used for purposes not related to climate change. The money is part of the Climate Emergency Response Fund that, according to Treasury, is only to be used for climate spending. The money is from revenue collected by the Emissions Trading Scheme.\nStopping the introduction of legislation designed to test support for lowering the voting age is disappointing. I believe that 16 year olds should be able to vote. They are bright enough and they have more at stake in the future than the rest of us. The right would hate it of course because having a new voting block focussed on the long term and wanting to address environmental degradation would run counter to their interests.\nThe changes primarily affect Michael Wood (Transport, Workplace Relations and Auckland Issues) and Kiritapu Allen (Justice and Associate Transport).\nIn a Blairite third way sense the changes are good politics. But at this stage of the climate crisis you have to wonder if these decisions are in our best interests.\n- Comments are now closed\n-\nTo paraphrase George Clemenceau (French president during WW1):\nWhat is my domestic policy? To win reelection! What is my foreign policy? To win reelection! All the time I seek reelection!\n-\nAnything that keeps act out of government is OK with me, the greens are supposedly the eco warriors of government so getting them as big as possible should be any one unhappy with chippies work focus\n-\nAnything that keeps act out of government is OK with me.\nx100. Pulling back a little on bold reform in order to save NZ from certain regression is the prudent thing to do.\nLet's get through the post pandemic and post cyclone era intact and restart reform later.\n-\n-\n-\nIt seems to me that a lot of those policies been put into the freezer for later use rather than onto a bonfire. A point which should not be lost on the electorate.\n-\nI personally hope that is the case.\n-\nSure. Certainly that cuts both ways.\n-\n-\n-\nThese changes seem extremely reasonable.\nNone of these policies seemed like anything more than expensive window dressing and nice to haves that wouldn't make a much of a difference.\nI actually think it's brilliant and total common sense that they are focusing on changing the voting age only for local elections, noone outside of the most tragic of political tragics cares about local government elections, so changing the voting age for local elections won't cause much of a fuss, if the sixth labour govt changes local elections to 16 years and older and the sky doesn't fall, the seventh labour government will be able to change the voting age to 16 in general elections.\nGolly, how long is that light rail gonna take, Ill be eligible for the pension in 2060 and I feel like I'll be using a gold card by the time it's opened for use.\nThe speed limit reductions screamed light bulb and shower heads, labour actually does extremely well with the bogan/car enthusiast vote and getting rid of this is just good politics because the right would use it as proof of the \"nanny state\"\nWith the pensions/benefit rises I bloody hope labour have changed thresholds so people don't lose money from other benefits everytime the main goes up through msd's heartless clawbacks. There's no excuses for not doing it since the deputy pm is minister of MSD and knows full well this is what happens.\nGetting reelected and stopping a national/act govt taking us back to ruthenasia era economic hell is priority number one.\n-\nNew light rail or motorway projects aren't targeted at old people, because they are multigenerational projects.\nFrom start of City Rail Link construction to completion is 10 years. Plus about 80 years of planning and argument.\nWaikato Expressway was started in mid 1990s and completed in 30 years.\nWhangarei to Marsden Point rail has been in planning for 10 years and will take easily 10 to complete.\nAuckland Airport second runway and integrated terminal has taken 20 years of planning, 2 false starts, and will take a further 15 years.\nOld people need to respect that these are multi-term, multi-generation country-altering projects and just step back for the next generation to complete.\n-\nYes, in pruning terms this is crown raising.\nRemoving lower limbs to clearly see the structure.\nThe structure is enough left leaning vote to stymie the Nat/Act knives.\nThen we do under planting.\n-\n-\nOne \"tick\" he needs to do is sort out the Banks, weak of Labour to say the Commerce Commission \"might\" do something\n-\nPretty much commonsense politics.\nHe has to be seen to be doing something about the cost of living. Without creating more debt and pumping too much money into the economy, and fuelling inflation. And right wing memes.\nAs commentators above have said, most are on ice rather than out the window. Anything to stop Luxon? and Seymour getting their hands on govt.\n-\nNeeding the money for cyclone recovery is convenient cover for axing things that the Tories can make mischief over. As you say – if they could make effective mischief in 2008 over something as inoffensive as energy-efficient light bulbs, then just about anything is possible on this score. That is – until the electorate has moved on to a more balanced sense of individual rights during an environmental crisis. This has to happen much more quickly than is really likely, so the dilemma and the resulting inaction will will continue while the climate deteriorates. That's not to say that the fiscal pressures on the government aren't real though.\n-\nTreasury must be going insane preparing Budget 2023.\nMickey don't forget we are going to get more and more of these policy firing squads as different Ministries and Departments report their savings up to Ministers, then to Cabinet for the PM to announce. These are now line-by-line reviews straight out of the Bill English playbook.\nThe health CAPEX for new builds will be obvious targets, to shift more resource to frontline staff constraints.\nHolding the line on further teacher pay increases is also obvious.\nI'll be impressed if NZBattery detailed business case survives for Transpower.\nBut surely the biggest gravy train around is the egregious capital subsidies to local government for their water supply and wastewater work, through the 3 Waters debate. Hipkins has got to call time on those ungrateful fools and pull the cash back.\nIn that vein the Hutt Valley RiverLink programme will be defending hard for itself as flood mitigation.\nThe public servants who burnt 5 years thinking they had another term to get their rollouts complete and contracts signed are in for a real shock. It's too late.\n-\n\"These are now line-by-line reviews straight out of the Bill English playbook\"\nIndeed. Which makes this very depressing. I understand the politics behind it. National must be kept out at all costs. But it seems to me that we have a Prime Minister conceding to the right on so much of what we have battled for over the past 5 years.\nRemember Labour currently has an absolute majority and can pass any piece of legislation it damn well pleases. That is unlikely to ever be the case again. But rather than taking advantage of that we see them essentially dancing to National's agenda.\nIs the only point of a Labour government to keep National out?\n-\n“Remember Labour currently has an absolute majority and can pass any piece of legislation it damn well pleases”\nStill has to 'please' the electorate. 100,000 voters opposed here and a few more 100,000 opposed there soon add up to lost seats and lost party vote. I doubt that Labour see a drift to Green as a plus as that dilutes their party and increases leverage for a future needed coalition/supply partners. Bleeding to National is very counter productive.\nRemember the old Kiwi adage – governments are voted OUT not IN\n-\nWell, the only point of a National government is to keep Labour out ….\n-\nNo. Its to make the rich richer\n-\n-\n-\n-\nThey may pass any piece of legislation they like James but with only months to go to the possible loss of the election and the Nats Putinacation of legislation that’s not theirs would have it all invaded and buried in weeks.\nMickey, I think they realise that maybe the car upgrade scheme isn’t as effective as the hopeful assumed, at a full price assistance it’s only about 11,000 cars or 1/2 price around 22,000 to no doubt swap a shitter for a teenager school run conveyance, or the best part of 200,000 e- bikes lying around in garages with flat batteries all winter gathering cobwebs.\nI’m sure there are more effective options, speeding up Govt and Council vehicle fleet electricification and forcing lease and rental companies to only buy electric, all these options feed the 2nd hand market.-\nI’m sure there are more effective options, speeding up Govt and Council vehicle fleet electricification and forcing lease and rental companies to only buy electric, all these options feed the 2nd hand market.\nYep. Affordability of an upgrade to a less carbon use vehicle in this way works for both government and public.\nAnd more E bikes (so more one car families, or flatmates with car and ebike), and low cost train/bus options.\nMaybe have the budget announcement about subsidy for e bikes from 1 September (spring use).\n-\n-\n-\nNot that I'm thoroughly familiar with SH6 (other end of the country to me) – but this article would indicate that deaths and/or injuries in Southland, at least, have little to do with the official maximum speed. [Speeding in this context, is usually driving at well-above the maximum speed limit – not in the 90-100 km/h range that the downward shift would impact]\nSpeeding, failing to wear a seatbelt – causing more serious or fatal injuries, driving while impaired by drugs or alcohol and driver inattention were the four main issues police remain concerned about.\n“[It] appears distraction or inattention is causing drivers to fail to stop at intersections particularly on the open road in rural parts of Southland.”\nWhile police weren’t noticing more people breaking these rules than normal, the “outcomes [death] were more pronounced recently”, Ure said.\n-\n-\nFrom the 'let's stay in power at any cost ' school of politics\n-\nThe cost of not doing it is far worse.\n-\n-\nThe message from the voters is pretty clear. If a climate policy is postponed/deleted, it needs to be replaced with stronger ones.\nhttps://www.1news.co.nz/2023/03/14/poll-after-cyclone-do-voters-want-urgency-on-climate-change/\nHipkins has hinted that is going to happen (\"watch this space\" were his words at post-Cab presser yesterday). Until we see that, the Greens will and should be pushing him and picking up support themselves.\nOverall, the prospects for a Lab/Green gov't in October are looking brighter than a few months ago.\n-\nThe good thing about all the delays on planning light rail is that technology is improving all the time. There are solutions now that weren't there before, like trackless trams that could reduce the cost and time of an above ground layout.\nI could never see the below ground working because if it is intended to run to the North shore one day, how do you get your lower queen St tunnel below the underground heavy rail tunnels, esp when lower queen Street is semi liquid.\nThen, when you get out to the burbs, how do you cope with the cost of digging enough tram stops to make the service viable?\nI always wondered how many weet Bix Twyford had for breakfast after he went for the below ground option like he'd just found the Lost Dutchman mine..\n-\nThe great policy bonfire\nWritten By: MICKYSAVAGE\nChris Hipkins continues with his shock and awe campaign and has torched a number of policies that National and Act were using to foment unrest…..\nFomenting unrest against these policies when in opposition?\nNational and Act will be putting a torch to them when in government.\nSo let's do it to ourselves first. Yeah that makes sense.\nPolicy is not the only thing going on the bonfire.\n-\nGST has been removed from e bike purchases – just yesterday in Tax Bill.\n-\nNote to self: Must get the stock and station agency to record ALL my purchases as …\nE Bike – no GST\nand only list any Invoice as an E Bike purchase!\n-\nSorry not quite right ; Here's the tweet from the Greens : \"Thrilled the Govt has just picked up my proposal to exempt bikes/scooters (including electric) from fringe benefit tax. This means employers can offer subsidies for e-bikes/scooters for commuting tax-free. When employers support active and public transport, it makes it easier and more affordable for people to get around in lower-emissions ways, resulting in cleaner air, a stable climate, health benefits, and less traffic. A win for people & the climate! Thanks to the hundreds of ppl and organisations who submitted to select committee!\"\n-\n-\nDirectly from Parker's news release\nBikes, electric bikes and scooters will be added to the types of transport exempted from fringe benefit tax under changes proposed today.\nhttps://www.beehive.govt.nz/release/bikes-and-scooters-be-exempt-fbt\nCows on bikes!\nNow can my farm trust supplied V8 diesel ute self identify as an E bike to escape FBT?\n-\n-\n-\n-\nFor the next election the main choices will be National or National-lite. It will be the two support parties The Greens and ACT that will dictate whether the country moves forward – very slowly – or regresses.\n-\nAll he has to do now is reinstate tax deductibility on rental properties and he will win\n-\nHow many people own rentals?\nNew evidence from the Ministry of Business, Innovation and Employment (MBIE) shows that the vast majority of residential landlords own just one rental property each.\nThe total number of active landlords with bonds lodged, as of February 9, 2021, was 120,330, the ministry said.\nOf those landlords, the number who lodged just one bond, which would generally but not always be for one property, is 93,706. That equates to about 77.9 per cent of the total.\nThen there is this\nThe analysis, which cross-referenced names on roughly 1.7 million publicly available property titles, shows investors with up to two properties only own just over a third of investment properties.\nInfometrics principal economist Brad Olsen says Valocity’s findings present “huge challenges” to the mum and dad narrative, with over 20 per cent of investor stock – or over 118,000 homes – owned by people with six or more properties.\n“Again and again we make those refrains, but we also know there’s a lot of property here being held by an increasingly concentrated group,” Olsen says.\n-\n-\nJust in case we're wondering how Auckland Council got itself into such a financial hole and proposes to slash budgets so hard:\nThis is a 51-49% cost share between central and local government, so Auckland Council are in a world of financial pain on it.\nAnd also makes more sense to why Treasury made such a wide variation of costs for light rail: if it blows out in 3 short years on a smaller project, the risk of it blowing out on a much longer and larger project is even higher.\nCan't imagine any future government wanting to take on major urban rail jobs for a while after the late-2025 opening of CRL.\n-\nnats = bullshit economics gone mad\nact = bullshit economics going totally bat shit\nlabour = economics now a bit of them both, act and nats.\nWhat a great time we live in, have to feel for the greens, getting stabbed in the back over this policy shift. Mind you, the greens should be use to it by now from labour.\n-\nadam. You have got tunnel vision on GREEN and everything else is bad. That is a sad thing to read considering we should ALL be open-minded enough to not trash so much of that around us.\n-\nClive Macann no idea what your talking about.\nYou get that labour is the one doing the trashing right?\nAll under the guies of far right liberal economics, oh wait there's no guies – they really are now far right economic carpetbaggers.\n-\nYou had noticed that many were in no position to buy motor vehicles given their living cost issues? And the government had some unexpected costs after floods etc?\nBikes, electric bikes and scooters will be added to the types of transport exempted from fringe benefit tax under changes proposed today.\nRevenue Minister David Parker said the change would allow bicycles, electric bicycles, scooters, electric scooters, and micro-mobility share services to be exempt from fringe benefit tax where they are being used for commuting to and from work.\nhttps://www.beehive.govt.nz/release/bikes-and-scooters-be-exempt-fbt\n-\nOh noes, a crisis, lets blame that so we can move even further to the right economically.\nYeah a bit sick of that dumb ass argument, got anything better?\n-\n-\n-\n-\n-\nA great policy bonfire? Oh, I get it now, it's the bonfire that is referred to as great, not the policies, so they can be dumped.\nExpect some very fancy footwork soon from the PM over Three Waters. The late John Armstrong had it right; it's all about power.\n-\nWayne Hope writing at the Daily Blog gives a balanced appraisal, hi-liting the PM's success in crisis management, but writing that climate mitigation is not an add on, but a must have.\n–\n….Our Prime Minister grasps the short-term imperatives as Christopher Luxon flounders. But, ruthless short-term pragmatism is only a palliative; joined-up thinking is required. Playing off the cost-of-living crisis against the expense of global warming countermeasures is myopic. Already we have seen that climate crisis effects worsen our cost-of-living crisis. This causal linkage will tighten, regardless of who wins the 2023 general election. A low-carbon future is not a nice-to-have.\nhttps://thedailyblog.co.nz/2023/03/16/polycrisis-polls-and-the-election-cycle/\n-\nAnother climate change disaster.\nMass fish die off in Darling river due to warm water temperatures and flooding deoxygenating the water.\nLet's hope the Australian government doesn't take it's cue from Chris Hipkins. And postpone all climate change mitigation to concentrate on the clean up.\n- Comments are now closed",
  "word_count": 3499,
  "scraped_at": "2026-02-14T13:07:49.957412"
}