{
  "article_id": "def28be50b7a",
  "url": "https://www.yahoo.com/entertainment/engadget-podcast-pixel-9-reviews-and-gamescom-2024-113003049.html",
  "title": "Engadget Podcast : Pixel 9 reviews and Gamescom 2024",
  "date": "20240823T134500Z",
  "domain": "yahoo.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Engadget Podcast: Pixel 9 reviews and Gamescom 2024\nGoogle may have finally crafted its ideal Android phones.\nThis week, Devindra and Cherlynn dive into Engadget's reviews on Google's Pixel 9 and 9 Pro phones. Are they really a step up from last year's devices? And how do they compare to Samsung's latest? Also, we chat about a few stories from Gamescom 2024, including Microsoft's Indiana Jones game heading to the PS5, as well as the wild launch of Black Myth: Wukong.\nListen below or subscribe on your podcast app of choice. If you've got suggestions or topics you'd like covered on the show, be sure to email us or drop a note in the comments! And be sure to check out our other podcast, Engadget News!\nTopics\nGoogle approaches smartphone perfection with the Pixel 9 and Pixel 9 Pro – 0:58\nGamescom highlights: Indiana Jones, AI NPCs and Black Myth: Wukong – 22:15\nxMEMS’ 1mm ultrasonic ‘fan on a chip’ breakthrough could enable super-thin devices – 49:31\nSan Francisco city attorney takes aim at AI deepfake pornography – 52:29\nChik-Fil-A wants to start a streaming service. Yes, you read that correctly – 52:52.\nBritish Billionaire Mike Lynch, founder of tech firm Autonomy, found dead in the wreckage of his yacht – 55:48\nPop culture picks – 1:00:18\nSubscribe!\nLivestream\nCredits\nHosts: Devindra Hardawar and Cherlynn Low\nProducer: Ben Ellman\nMusic: Dale North and Terrence O'Brien\nTranscript\nDevindra: [00:00:00] What's up, Internet, and welcome back to the Engadget Podcast. I'm Senior Editor Devindra Hardawar.\nCherlynn: I'm Deputy Editor Cherlynn Low.\nDevindra: This week, we've got reviews for the Pixel 9 and 9 Pro and XLs and all the various Pixel 9 models, except for the Fold that's not out yet. So that's very sad. That's gonna be a couple weeks away.\nAnd we've also got some news from Gamescom 2024, which is, I guess, still happening. But most of the major news has already happened from the opening night and some followup events. And yeah, got some weekly news as well. As always, folks, if you're enjoying the show, please be sure to subscribe to us on iTunes or your podcatcher of choice, leave us a review on iTunes and drop us an email at podcastengadget.\ncom and join us Thursdays, typically around three. 10 45 AM Eastern on our YouTube channel where we live stream the show and you can talk to us. We'll show off some gadgets. I know Sherilyn has something she wants to show off soon during our Q and A's and it's fun time. We've also got a good group of people here.\nSo join us. We've got the pixel phones now, Sherilyn. I'm sure [00:01:00] you've been like in editing hell for the past week. Can you broadly tell us, so how do we feel about the, let's focus on the pixel nine right now. How do we feel about the pixel nine?\nCherlynn: The pixel nine, I wasn't expecting it to get a super high score, but Sam, who reviewed the pixel nine for us seems really impressed.\nI mean, like Sam likes\nDevindra: it. Sam Rutherford, Sam Rutherford\nCherlynn: is our like Android main person. And he is also our foldables person. So, so having him review like the most standard pixel nine, I was just like, it's a, he's going to be bored. Right. I was like, this man's used to his big foldable screens, but Sam really enjoyed the pixel nine and like to contextualize it for everyone.\nI went from reading Matt's review first of the pixel nine pro and pro XL. So Matt Smith, our UK bureau chief I went from editing him and then going on to Sam, whose review went up the next day. And again, you, you read the pro review, you're like, of course, it's good. [00:02:00]Of course, everyone liked the pro.\nMeta scored the pro\nDevindra: very, very high. That is surprising. Well,\nCherlynn: let's get to that. I wanted to talk about that. But you, I mean, you asked to start with the nine. So we'll start with the nine, the basic baby. Well, if you, if\nDevindra: you feel more interested in the pro, you can start there. It's up to you.\nCherlynn: We can. I've just started talking about the nine.\nLet's finish this thought. So, so after I went from Matt to Sam, I wasn't expecting, I was expecting like, I wish this was the pro, you know, kind of that vibe. I didn't get that. I actually got Sam going At the end, he said truly, if you don't need the Gemini advanced AI, if you don't need like a telephoto, like a dedicated telephoto camera, you may even be very happy with the Pixel 9, which is again, what we always differentiate between the pro and the regular flagships.\nIs that it's the\nDevindra: iPhone and. iPhone pro situation too, right? Exactly. It's the\nCherlynn: same situation now. So I think it used to be though in previous years that because there was never a smaller pixel pro, it was always like a larger pixel pro is always a [00:03:00] larger phone. We had more reason to recommend. The nine because of size, but now it's no, even if there's like an alternative size in the premium, like premium top end, like sort of a variant, we still are like the nines pretty freaking good.\nSo I was just surprised by that. Now. Back to your point the more interesting review in my opinion is the, the, the fact that Matt decided to award the Pixel 9 Pro and 9 Pro XL respectively, like really high scores for any, I think even any Android handset ever for us, 94 and 92 is where we landed with the 9 Pro and 9 Pro XL respectively.\nAnd again, to contextualize and give you all like a little bit of behind the scenes. He candidly, he scored them a little bit higher at first. And I was like, Whoa, We're\nDevindra: not going to have a 100 out of 100 math. Yeah. I just was\nCherlynn: like, I think we might need to tamper this a little bit. I feel like we're very [00:04:00] excited, but we need to give ourselves some.\nSome a a little bit of wiggle room like what are they they're not perfect, right? So I think we tweaked and in the tweaking we tweaked the original scores for both devices both went down a little bit I think if you look at our score for last year's pixel 8 Pro It was 93 and again This is like way too in the weeds and both Matt and I will be like we hate Arguing over one or two points, but here's the reasoning 93 for last year's.\nAnd usually we're like, this is just as good if not better. So maybe we'll go to 93 or 91, but then we brought the pixel nine pro Excel down a point, and that is in part because. Matt still wanted to have a big enough gap between the nine pro and the nine pro XL. And so 93 just was good. Wasn't giving us a lot of room.\nAnd then the other reason is that the nine pro XL actually, even though it has is the same size is screen is 0. 1 inch bigger this year, which like. doesn't sound like much when you're talking about a [00:05:00] frame that's still the same size, but the screen for Matt, who boldly claimed he had larger than average hands or average or whatever, not too small hands.\nI don't know what he's telling us there, but he was all like, It was already hard. Be humble brag.\nDevindra: Thank you Matt.\nCherlynn: Yeah, it was a very humble brag, but even for Matt, it was like hard to reach the corners. And so with that we were like, alright, it's worth like saying it is unwieldy. It is a more expensive phone than last year.\nThese AI features don't do enough for us to be like, yeah, it's worth that, that, you know, keeping it same score sort of situation yet so. We brought it down a point, but that's not a bad thing because why? The 9 Pro, holy crap, we it's arguably one of our highest scored phones around 94. So, obviously you've read these reviews, Davindra were you shocked at the scores we gave?\nDevindra: I'm really, I was shocked at the score of the 9 Pro. The XL, you know, being a little more unwieldy, I was not surprised there, but, It does seem I don't know, I was talking about this with Sam a little bit too around his review. It is [00:06:00] funny to see Google's journey on like the way it's thinking of Android phones, right?\nCause they launched with. Let's go back in history, right? They launched with the HTC G1, right? And some of the like early Motorola's like stuff from third parties. Then third party started making a lot of garbage and putting a lot of stuff into Android software. So Google was like, okay, okay, hold up.\nLet's have these Nexus phones, which are just pure Android, which run all our stuff and doesn't have any of your third party garbage. And at that point. That never, that was never a big seller, right? That was for the fans, the super fans, the people online, the super nerds. Pixel was their attempt to be like, okay, let's screw it.\nLet's just go iPhone. And I feel like nine generations in they finally done it. The camera bar has been chopped up. The design looks a little spiffier. I'm not too surprised. I do feel like it seems like Google knocked this one out. So. I was shocked by the score number, but yeah, I feel like Google, it's been a long road for Google to get to this point to make like the [00:07:00] ideal Android phone, I'd say.\nCherlynn: It has. And I, I mean, I don't know if I would call it the ideal Android phone, even if I think it is. It's a very significantly improved device over, let's say the earlier pixels, even though it feels like over the pixel eight, which I also have here, right. And for those of you on the stream, I'm holding up side by side so you can kind of look right.\nThe design felt nice on the pixel eight pro, you know, the colors, you know, Google's always nailed the color combo. It feels very different this time. I think you've seen all our reviews. I just mentioned this independently, Matt Smith in the UK and Sam in New Jersey were both all this feels like an iPhone.\nMatt almost picked it up and was like, this feels like the iPhone. And it looks like an iPhone, and that's not a bad thing, right? Because they still have enough of a distinction, like the camera bar is different enough, there's the G logo I guess. Is that a, that's a, that's a good thing in the sense that it feels premium.\nIt feels solid. It feels like a good real phone. And I'm sure there are people who won't be happy about that. They're like, you know, don't keep [00:08:00] copying Apple phones are so boring now. They're all the same because don't forget the Samsung S24 series. Also feel like iPhones I've got a Samsung S24 in the hand as well.\nAnd it's they've all become more or less the same. And whether it's a good or bad thing is really up to you to decide. But for Google though, the design. It's a huge step up, right? Like they don't feel the need to differentiate. They don't feel the need to do these like incredibly like slimmy, curvy sides anymore to achieve a slider, slightly thinner profile.\nIt's, it feels very grown up. And I wrote a blurb for our best smartphones guy about the Pixel 9 Pro saying that this feels like a grown up phone and to Matt's point in his review. a showcase for Gemini AI. And I think that that's what these phones are all about. Pixel phones have always been about the camera, but like these are like camera plus, you know,\nDevindra: Are we liking the AI features?\nAnd we should also differentiate between the local stuff, which you don't have to pay for, and then there's the fancier stuff, which comes free with the pro devices for a year, but [00:09:00]you will have to pay for that eventually, at least 20 bucks a month. Is the AI stuff any good?\nCherlynn: I mean, the capability and the like actual good of it.\nLike The, the, the, how well it works. Right. Seems like pretty good. I mean, add me, everyone's been having fun with again, independently, both Sam and Matt were like, we use add me to clone ourselves. In the, and add me to be clear is the feature on the camera where you can have. You know, you're taking a group shot and then you can hand, someone takes a photo first and then hand the phone off to someone else.\nAnd then you, the photographer can go and take your place in the picture. And the phone will give some AI guide, AR guidance to show you where to, you know, frame up the shot and to make your, make you in the picture. So that seemed impressive enough and fun enough that they both were like playing around with it.\nBecause it's only been what, like a week since these phones were launched. It's a not enough time to say how much we'll use this in the real world. Things like the pixel screenshots app. I think there are problems here and there where Sam enjoyed it. Sam really found it useful. Matt had issues with it.\nLike he points [00:10:00] out that like you can't. Automatically back up your entire Google photos history on setup. So it'd be like, you will go to, you will have to manually import pictures one by one. And it's just not, yeah, I mean, not, there's nothing wrong with like manually importing pictures and this is a huge privacy thing because some people's yeah,\nDevindra: it's definitely a privacy thing.\nCherlynn: Yeah. It's like Google photos. My, mine is like so many years in history and I don't want to give it access to everything at once. So anyway, there's also the pixel studio app, which I think both of Sam and Matt liked because it was fun, but both of them were also like, eh I think this is more of a criticism of image generators like that in general, where like you feed mid journey a prompt and it comes up, how much are you going to use this?\nWe're not really gonna do that all day. It's not. That much useful. So those are the main AI features. I mean, the rest of the stuff, like your typical Gmail summary things or like your, even Apple [00:11:00] intelligence is trying to do some of these things. I, I didn't get a real big sense that they were that like crazy good.\nI mean, Sam mentioned call notes in his piece, but I think none of us have really put it to through the ringer through like really difficult calls to see if it works that way. Through all those situations as well. So,\nDevindra: and that's the thing that will summarize your call and give you notes, like the thing in text.\nThat's cool. Yeah. A\nCherlynn: transcript and a summary, which is cool. I think. Yeah.\nDevindra: Okay, cool. So, but I mean, overall I guess any surprises, any, any surprising highlights from the Israelin or any like surprising disappointments.\nCherlynn: Zoom enhance on videos is a weird, like it take, it took them one year to actually bring it out to a device.\nBen: Yes.\nCherlynn: And then the, the fact that it's not on the nine, you have to have a nine pro to use it was what Sam pointed out in the night, which is, you know, I would expect that from Sam, right. Who's used to reviewing pro phones. And then for Matt, I think he, but they both pointed out in low light, Google's cameras still far and away better than the competition.\nThey both. [00:12:00]meticulously put it through his paces in the camera front. I think we all really enjoy camera testing and it still came up tops, right? Google still came up tops on camera. And Matt, our review almost didn't get up on time because he had to run the battery test for the Pixel Pro XL. Well, the Pro arrived a little later than the Pro XL did so he didn't have as much time, but also the Pro ran for so long.\nIt lasted 25 hours on our battery test. That's a lot. I mean, the Pro XL got 23 hours thereabouts. Wait, that's already longer. The 25 hour mark is longer than our next closest number, which is the OnePlus 12, I believe. So, all around just incredibly impressive phones. I'm surprised. And I think that that's what's surprising, right?\nWe're like, whoa, these are good?\nDevindra: What? These are good? Well, there were a lot of shocks early on. It's these are stylish? These seem capable and good? I know I think that's going to be a big compelling factor for a lot of people, Shirley. I'm like, Google for a long time has been like, we're making phones for nerds and for people who don't care as much about [00:13:00] Samsung bling and whatever.\nAnd now it's just no, Google's no, we're just, we're just going to do the same thing. We're going to do iPhone type stuff. How does this compare to the current Samsung stuff, Cherlynn?\nCherlynn: I mean, I think Google has the upper hand in AI, for sure, and cameras, so I think that's what I was seeing across the board, that like the S24's cameras were good, but in some situations not as good, although one, in one occasion, like Samsung did better on the Pro XL or something, and then I want to address some of the questions in the chat really quickly, so, MiniMeA1231 asks if we will be comparing the Google AI versus the Apple AI.\nObviously we can't right now because the Apple intelligence stuff isn't out. We could compare Samsung's to your point of interest, Samsung's Galaxy AI to Google's Gemini AI, but like I said, it's just Different applications, different things like Samsung's AI, Galaxy AI feature in the Z Flip 6 and the Z Fold 6, which are its latest to feature like new Galaxy AI features came with you can draw onto a picture and it'll add a cat, you know?\nYeah. That sort of thing to me is really fun, but the actual use of it, IDK, right? Meanwhile, [00:14:00]Google's got no equivalent feature. It's got auto frame and reimagine, and it's got like pixel studio. And so there's no easy way to do an apples to apples comparison. But I also want to address that CUD or CUT who is a familiar name from our chat says that whole add me feature.\nIs this something that people want? Because it's a bit weird if it becomes the norm, people would just be adding in all their friends and family and photos when they were never there. Might as well add your cat and dog while you're at it. I don't think you can, after the fact, add people, FYI. So for add me, it's like you're holding up the phone.\nAnd then, for example, I've had family visiting this past couple weeks or so. And if I'm sounding ragged, that's why. And we've been taking like family pictures, right? So it's four of us. And we try not to bother people. So we don't ask them. Stranges also, you don't always feel safe, right when you're on the street and like standing in front of a museum and take a 4, 4, 4 of us please.\nWho's to say they won't just run? So I could have my cousin, you know, hold up the phone and take the initial picture while I pose with his mom and dad. And then he comes [00:15:00] into the picture. I hold up the phone and he go, I think if there are a lot of. Specific use cases where it'll be helpful. And I don't think you can add a cat and dog in because you'll never get the cat and dog to stay in the place they need them to.\nSo CD cut, I am sorry but I don't think you can. And I think I would I could see some use for this add me feature.\nDevindra: I'm sure people will figure out ways to hack it, but it does seem from the demos they did. Like it creates like an AR situation of where you are right now. Yeah. If you break that.\nEnvironment like where it is. I don't think you can actually even stitch something into that. I think the bigger issue is just it is weird to have some features locked into just Google's phones when Google is both, you know, a company making phones, but also the company providing the software to everybody else.\nThis is very much like Inter Explorer on windows, you know, or Apple locking down some features just to its devices. Like it feels if this goes on. People can chat Monopoly or something going on here. Do you feel weird about that, Trillian? Like some of these just being on Google stuff for so far?\nCherlynn: [00:16:00] I, I don't know that they're going to always be that way. I think that like for some things, because Gemini Advanced is something that you can apply for and get with any other. Like phone, right? Like you can apply for and so some of these features might come out to a future android phones or other branded Android phones and then with pixel there have been a few things that have been locked into pixel for a very long time like pixel ui things pixels, call screening pixels like general like call assistance things have been very pixel phone centric and I feel like that's because it's been Built so deeply into the U S as opposed to it's an app, right?\nThe pixel screenshots at pixel recorder. Those things have eventually opened up to some other maybe Samsung, maybe I don't even think there's other Android players really, but yeah, but Samsung, right. And they work closely enough with Samsung to be like eventually maybe right. Circle to search is a feature that launched first on Samsung, even though it was a Google feature.\nSo I feel like it's not necessarily super locked in. And even if it were. To answer that part of your question, I don't [00:17:00] know if that is such a huge deal. I think maybe Google does need to keep some of this for itself, right? Like we, we know that Android is supposed to be like the most open ecosystem. It's supposed to be like welcoming and like whatever, but Google at this point needs to be able to play the game the way Samsung, Apple.\nEspecially Apple. Does it? Does it though?\nDevindra: It's, it's inherently unfair to be both the software vendor doing it and also be like, oh, also, hey partners, we're also going to directly compete with you in hardware and also keep features to ourselves that you can never touch. Like that, that is where anti competitive stuff like starts to arise, I guess, yeah.\nI\nCherlynn: mean, I think Google has its feet and toes in so many things that like it's anti competitive in a lot of other areas. But I think on the pixel front, like it's generally been trying to bring pixel first or pixel only features to more devices. But then you know, when you said the whole like, Oh, you're talking about the software and the hardware.\nI was like at first really readying to reply being like, Apple does that. But then you were saying that it's not fair because Google competes with its own customers. So I get [00:18:00]that. I don't know. I don't know that I don't know how they're going about it, really.\nDevindra: The US government has declared them a monopoly.\nYep. Right. Or at least the US judge has. Anti trust. Anti trust. So search there. They are a search monopoly. Android is such a open ecosystem that everybody supports. I just feel like Google is going to start to be worried about this because we already talked about the potential repercussions from the search monopoly thing, like could, could be like, Hey, maybe you should split up a little bit.\nMaybe we should take out some of these parts of Google and make them separate companies. I wonder if. The company itself is a little afraid of that because it's not just Oh, we're going to slap a five or 10 million fine on you, which is like the money Google, you know, that it's in their couch cushions.\nIt's like more serious things could happen.\nCherlynn: Can I quickly go back to the chat for specific to pixel questions to the pixel nine, I mean, so, has Sam. Maybe Sam in an alternate timeline is would love to hear about the heat management of the Tensor four. And this is something that did come up in our pixel nine Pro review.\nSo Matt noticed that the Tensor G four actually runs a [00:19:00] lot cooler than older pixel phone. So sorry. It's very weird to be like the Tenser G four runs cooler than the Pixel eight Pro because like, where else is the Tenser G three? The Tenser G three gonna be obviously the Pixel eight Pro. But I think it's important to focus on the phone than just the chip because even though the chip does supposedly run cooler, it's also the fact that like to depro9's point in the chat, Pixel 9 series has a better like thermal dissipation system, so like it's a lot cooler.\nI did notice that yes, the Pixel 8 Pro that I was using would run really hot. I haven't, I think, pushed the 9 Pro XL enough to feel like it would in, you know, You know, that circumstance otherwise be hot but I've never felt it run hot. Right. So like to that point, it certainly seems to run cooler.\nAnd Matt definitely pushed it harder in his review and was like, it was cooler. So, has Sam, I hope that answers your question. And I mean, But I think the fact that the phone's a little bit thicker of a, of a profile is partly because it needed to build in some sort of like better cooling [00:20:00] system.\nGotcha.\nDevindra: Gotcha. Okay. Well, any other thoughts on these things? I would want to point people to our reviews, go check them out on the site.\nCherlynn: Go check out our site. Pixel 9 Pro reviews been up since yesterday and our Pixel 9 reviews up today. The on sale date for that series of phones is up today. And then we have so many other Pixel devices coming in.\nSend me your questions about them. I'm like. What do you want to know most about the 9 Pro Full, the Pixel Watch 3, and the Pixel Buds Pro 2? Last week also on Saturday I did a quick Engadget review recap, and I will be doing one of these for the Pixel, all the Pixel products at some point.\nSo, again, I really want to know your thoughts on the upcoming devices before we review them so that I can go into them looking for those questions. So send them our way, podcast. engadget. com. You can always email me. C H E R at Engadget. com as well.\nDevindra: Let's move on to some news from Gamescom 2024, which is happening right now [00:21:00] in Cologne, Germany. We are not there in person, I believe, but we're covering a lot of news from the event. And some highlights here and joining us for this discussion is our podcast producer, Ben Ellman. Hey, Ben.\nBen: Cause when we're talking about video games, it's Ben time.\nDevindra: It's Ben time. And we don't, we don't want to break Sherilyn's brain with some of this game stuff, because I'm sure Sherilyn does not care about the Indiana Jones game coming to Xbox. I don't know. Do you, Sherilyn?\nCherlynn: I have heard that young Indiana Jones.\nDevindra: What?\nCherlynn: Who, who, who was the actor? Shit. You\nBen: mean Shia LaBeouf?\nYou mean River Phoenix? No, no, no, no.\nCherlynn: Young, what's his face? Young crap. This older man.\nDevindra: Okay, this is why, young Harrison Ford?\nCherlynn: Harrison Ford! Young Harrison Ford! This is why Ben is on this segment. This\nDevindra: is why Ben is helping us out. Anyway, I've\nCherlynn: heard that young Harrison Ford is hot. Anyway, that's all.\nThat's all. Go for it. It\nDevindra: doesn't, but it doesn't look like Harrison Ford. It's it's a totally different I\nCherlynn: know I'm just saying that when I hear Indiana Jones, I think okay So Shulman\nDevindra: is talking about the CG version of young Harrison Ford. No, I've been [00:22:00] sent\nCherlynn: pictures of him on his heyday\nDevindra: AI okay. Well, yes, he was hot.\nYes, but also in the most recent movie they use AI to de age him Yeah, you get a glimpse of that that old hot Harrison Ford face anyway We're talking about the game here. This game is one of the like rare exclusives that Microsoft has. And there was a lot of talk about this thing. This is Indiana Jones and the great circle.\nIt's coming from it's developed by Xbox subsidiary machine games. I believe. It, this came as part of the the whole ZeniMax acquisition. So when Microsoft bought id Software, Arcane, Bethesda machine games came alongside that. And I believe there was a deal to get this game to Sony's eventually.\nSo here's what we learned is that this game is coming to Xbox and PC on December 9th. It's coming to the PlayStation 5. A couple of months later in spring 2025 and the nerds, especially the Microsoft nerds, the Xbox fans have gone a little crazy because they're like our exclusive. What's happening now?\nDo you have thoughts about this [00:23:00]Trillian or Ben?\nBen: This is Microsoft admitting that not very many people have Xboxes and they don't want this to just be a PC game.\nDevindra: Microsoft is a business and they like to sell games and unfortunately their hardware. Has not done a good job of that. So I think that's the basic thing here.\nDoes this feel odd to you, Sherilyn? Or is this just like weird fanboy inviting at this point?\nCherlynn: I always think of it as strange fanboy infighting because I don't pay attention as much to this news. Doesn't really matter to me.\nDevindra: It's funny, like, when you tune what are the gamers up to? They're mad about Indiana Jones.\nThey're mad about this lady character starring in a game. The gamers are not okay. Yeah.\nCherlynn: Every now and then there's this big Controversy in gaming, right? Oh, well, what trans characters, sexism, violence. There's always kind of up, you know, like public outcry over a lot of these things. I think I'm more concerned when it's like when blizzard Activision and all, they have all that stuff, right?\nSexism at the workplace, toxic environment, like that sort of we'll talk\nDevindra: about that [00:24:00] soon. Even more harm. Yeah, so we'll get to that. Don't worry. We've got that. So anyway,\nCherlynn: I was looking forward to it. Awesome.\nDevindra: There is news here.\nBen: Okay. So Devindra, one of my big questions was, you know, as I was watching the trailer for this game and reading Jess's first look,\nDevindra: the game, which looks sick as hell, by the way, I do think this game looks fantastic.\nBen: Yeah. So I was wondering, okay, with the Uncharted series and everything, like why isn't this a third person game? But then after watching the trailer, I realized, okay, I think they want to make it really visceral. There's a lot of hand to hand combat in this game. They want to make it feel like the movies did.\nThe fight choreography in the Indiana Jones movies back then, just fight choreography overall, was okay. It was fine. Yeah. And Indiana Jones was never known for huge martial arts maneuvers like Batman or anything. Oh no, he's known for shooting the guy swinging the sword. Yeah, exactly. So you can't really have an Arkham Asylum, you [00:25:00]know, third person style Indiana Jones game where Indy is like breaking a Nazi's back over his knee.\nDevindra: They, they could have done some, I, I honestly prefer third person, like angles, like games too. Cause I like to see my characters when I'm running around, but I think that mostly this comes from machine games, right? And machine games, they did those the Wolfenstein the most recent, like Wolfenstein games, which are fantastic and good.\nAnd also I did not really care to play like a modern Wolfenstein shooter, but they did great stuff when it came to like environmental storytelling, good writing. They, they did some interesting stuff with first person shooters. So I think it's just a, an interesting choice to do this. I think the camera pans out sometimes.\nSo you do see the character and in cut scenes, you see him too. We'll, we'll see how this goes. Go read Jess's, Jess Condit's hands on with this thing. The title is Indiana Jones and the Great Circle has a Nazi slapping mechanic and gotta love it to see gotta love it Shout out to this game for doing that.\nAlso in Microsoft news, there's a couple assistive tech things that they announced. [00:26:00] There's a new Xbox adaptive joystick, which is a single stick type of thing, which looks like, honestly, it looks a lot like a VR controller, like something with the Oculus Headset or something, but you can plug this into an existing xbox controller the adaptive controller and gives you a bunch of controls They can handle with just one hand let me see here.\nThere are also some 3d printable files for Adaptex thumbstick toppers so you can download these files. They're free. You have to get access to the 3d printer Talk to your local library because often they will have some of these devices. But you can print out these things to get like better grips on your phone too, for people who have trouble with with, you know, very typical gripping.\nThere's also this cool thing. Let me see here in partnership with 8BitDo that. Controller company. There's the light S E 2. 4 G wireless controller, which is a game pad with all the inputs on the top has low resistance buttons and Hall effect joysticks also has those like giant eight, but do the super buttons that they put on their mechanical keyboards.\nJust like a big ass button [00:27:00]you can hit. And I guess program things too. So a lot of interesting options here too. I'm seeing CUD in the chat\nBen: saying that it looks like a Wii nunchuck. That is not wrong. It\nDevindra: is not wrong, but more specifically, if Microsoft were to be like, Hey, maybe we should do a VR headset or something.\nThis kind of looks like what a VR control looks like, maybe without the motion controls. So that is cool. Also, also the all digital Xbox series X, which we thought was kind of a joke when Microsoft announced it a couple of months ago, you can pre order that now it's 450. It's going to be coming to the U S on October 15th.\nIt's only 50 cheaper than the disc version, that disc version, which by the way, often goes on sale for 400. sometimes even less. So I'm still a little baffled by this thing. I'm even more baffled by the 600 special edition, which has a two terabyte drive and the disk drive, but it's 600. I don't, I don't know.\nAnd we were just talking\nBen: about how Xbox is Only doing okay. They're only doing so\nDevindra: rather than lowering the prices [00:28:00] to ship more boxes or I don't know, man, people like us. We'd rather sell more games through Sony than make our boxes cheaper. So a really interesting calculation Microsoft is making there.\nDid you ever decide on the next box? Did you ever get the series S? Cause we've talked about that for a couple of years.\nCherlynn: Never, baby, never get a PS five pro or whatever.\nDevindra: That was a good time to avoid that but I don't know more steam deck stuff for you or those PC handhelds I know you've been playing around with yeah I\nBen: think that actually the PC handhelds are probably the best option for Cherlynn\nDevindra: as they get smaller too because they're still big and yes\nCherlynn: smaller is better.\nThey're a bit big and heavy right now I mean I played a lot with the I think I knew, I mean, I played a little bit with the steam duck. And my switch is still a beautiful ornament. You can,\nDevindra: you can honestly play most of the like good indie games right now on switch. So you're not missing out\nCherlynn: pretty old switch.\nGot it like right before the pandemic. So, but\nDevindra: you probably had the updated battery at least if that was 20, better battery\nCherlynn: for sure. [00:29:00] I had that. I mean, I think I'm interested in these games, I like the handheld games, but like my, I don't know, my habits have changed so much over the last few years, it's oh, I got into crocheting a lot, and now I just sit around drawing.\nDevindra: You got into Vampire Survivors on your phone, right? And that made you a little crazy, so I think you can do that on Switch.\nCherlynn: I am a beast at vampire survivors. I don't know what y'all talking about. I'm a gamer.\nBen: Borderlands\nDevindra: 4 is coming, which feels like a threat. Gearbox and 2k games announced it's coming in 2025, which I think the impact of this announcement would have been maybe they were planning for the movie to go a little better.\nMaybe they were being like, oh, yeah, people are hyped for Borderlands right now. Let's announce our next game no, everybody hates the Borderlands movie. I called it a disaster. It is it's a huge mess So I don't know who's excited for this thing But hopefully it's better than Borderlands 3 which I recall being a little disappointing\nBen: In retrospect Could we have said that the Borderlands, we knew that the Borderlands movie was not going to be that great when we saw that Kevin Hart was cast in it?[00:30:00]\nDevindra: He's not the problem. He's not the problem in that movie. The problem is that you know, the script is bad. A lot of things are bad in that movie.\nBen: So talking specifically about Borderlands 4, I just wish that I had more of a squad to play it with, because I have been playing 2. I got those on sale as part of a, kind of like, buy the whole collection deal a couple of years ago.\nAnd I was having a good time playing it by myself, but I was like, eh, I feel like I need more people. And, like, when I started playing this was a time Kind of like I had taken a sabbatical from like online kind of squad based games. And now that I have been playing Helldivers so much, I've got like 125 hours in on there.\nGod damn it. Yeah. Now I'm thinking, okay, yeah. I really want to find a squad of people to do other like squad based games with.\nDevindra: I mean, you've got a lot of options, Sam. You've got all the, all the other sorts of what Valorant? And whatnot. So I don't know. There's so many squad based games [00:31:00] right now.\nThis is I do wonder wouldn't the actual like evolution of Borderlands be like, let's do a destiny type of thing where you're actually going on, you know, multiplayer missions and stuff with people. I think, cause you could do co op play and just dick around in Borderlands, but it was never as robust as something like destiny.\nSo I don't know. That could be the thing. Did you see the story, Ben and Cherlynn about the NVIDIA ACE virtual humans? I got a lot\nBen: to say about this, but go on. A lot to\nDevindra: say. These are, these are, so last year, I believe, NVIDIA showed off, it's an avatar cloud engine technology, Ace technology that's powering characters in some games.\nSo basically, creating NPCs that will react to you the way like ChatGPT does, so that they would speak if to you If you ask them a question or if you choose a certain prompt or something, they could react to what you're saying, or maybe react to your clothing, but also their model will like, look like it's talking properly.\nThey will have a semi AI conversation. A lot of people were criticizing this as a way to be like so you, this means you're not, you don't need as many [00:32:00] writers, right? This means you could just populate your games with this weird. AI spouting avatars and not actually write dialogue for them or storylines or anything.\nThat's the controversy. The news is that it's actually coming to a multiplayer mecha game called Mecha Break. I've not heard too much about this game, but it is actually happening. It's, it's totally real. What did you think about this news Ben?\nBen: I watched the video where, you know, you're basically in kind of like a cyberpunk esque world and like you're going into a sushi shop and you're talking with the like sushi shop owner.\nAnd I think it's cool that you can use your voice to interact with this AI character. I think that that's a really cool feature. cool like method of input and something that's probably going to pop up in a lot more games. But, when the character started talking, it felt very wooden. It felt like you were talking to a robot.\nThe voice didn't have very much color to it. And [00:33:00] hey, I'm a voice guy, so. Oh you can tell. Really? Yeah, I really want that to feel more alive. And so I was thinking, how would we end up using this technology? Because I think that it could be useful in some cases, but definitely not as the main player character.\nDefinitely not. As you know, the next rung of NPCs. Yeah, these are like NPCs in weird\nDevindra: submissions off at the end of the map or something. Yeah, should\nBen: probably like the most important, you know, five or so NPCs should probably still be written and acted. But. Where this could end up being really useful is if you have a big open world game I'm thinking about like Assassin's Creed or something where you're like always Running through these like crowded marketplaces or something and you just hear people like yelling things That if you have a couple of [00:34:00] people doing background editing Acting like lines and then the rest of it generated by NVIDIA ACE, then that could be a good way of stretching your budget a little bit further and making the overall world feel a bit more alive.\nDevindra: Yeah. Yeah. You are absolutely right, Ben. That's I'm sure what they're all thinking. I hate that idea because especially like when I was playing the latest, like Assassin's Creed game, which is set way back in I don't know, it's, it's in the Middle East thousands of years ago and walking through the towns, like walking through the villages and seeing the way they constructed it and seeing like people interact with dialogue that has been recorded by humans and written by humans.\nLike it felt so alive. I was kind of astounded by that. And if you replace that ambience with, with AI stuff, you know, like that's that to me will kill the realism of the game. And I'll just feel like I'm, Oh, I'm just walking through the simulation right now. I'm not walking through ancient Baghdad or anything.\nRight. It's I feel like that'll kill [00:35:00]it more. So I'm sure you all have thoughts podcasting gadget. com. Listen to what you think about this. I'm not a huge fan. Not a huge fan of yeah. I just hope it\nBen: doesn't kill the art of the like, little in joke kind of world building thing. One of my favorites from Mass Effect was, there was that one race of aliens that felt like it needed to, or in order to communicate with other species, it needed to preface the emotion that it was putting into its sentence.\nIt had to like,\nDevindra: yeah, say it in words. It's amazing. I love it.\nBen: Yeah. Like, when you're in an elevator or something, there's a little ad for a all that alien species production of Hamlet or something. So it's that's very funny, and if we lost that, I would feel like we're losing so much from I don't know, quirky little world building things in video games.\nDevindra: Quirky little things? I mean, that's just good writing. That's human ingenuity and creativity. There is maybe something interesting that will happen with Hey, [00:36:00] emergent AI is avatars. That is we love like game systems. You see what people do with the, just the systems in breath of the wild and tears of the kingdom, or think back to far cry two, where people are just like having a lot of fun with the rules and the mechanics of that world.\nI'm sure it's going to lead to some of that stuff. I'm just worried that. Some of these companies will over rely on all of it. Let's move on to Black Myth Wukong though, which is a game that is totally killing it. Cherlynn, I feel like this may be up your alley too, because this is a journey to the West game, basically.\nIt's sort of like an adaptation. I mean, I\nCherlynn: love the idea. Is it a fighting game? Do you like fight? It\nDevindra: is very much, it's like a Dark Souls game. It's like God of War meets God of Dark Souls. Okay, but it isn't actually a Souls like game. That's the thing. It looks like a Souls like game, but it isn't. It has the mechanics.\nIt has the healing. It has the crazy ass bosses. What I'm saying is it is very much God of War, the sort of like adventuring around, not as open as like the way Elden Ring was, but very like in specific spaces. It feels like Dark Souls. It feels like [00:37:00]actually playing early Dark Souls, but also with the big ass bosses from Elden Ring and even God of War, the newer games ended up doing a lot of that.\nSo that's what this game is.\nBen: In trying to get myself up to speed on this game, I was watching a lot of videos, watching some streamers and stuff. And the thing that I saw first from so many of the YouTube videos is saying that this isn't a Souls like game. And then when I watched actual gameplay, it showed, you know, big bosses, like when you hit a boss or when you hit one of these like larger enemies, all you're doing is chip damage.\nAnd like the fights are pretty long, which makes me feel like it is kind of more Souls like than not. I\nDevindra: don't\nBen: understand.\nDevindra: It is more Souls like than it isn't. I think some people are being weird and precious because gamers are weird. But no, you have to walk around and light like lanterns. And this is where you respond.\nWhen you die. The big thing is you don't lose all your stuff. You don't lose all your experience in your items when you die. So you can just go back and keep hammering at a boss, which is something you cannot do in souls game very [00:38:00] easily. I guess it's more like when you're exploring somewhere and you die from some stupid enemy and you lose like a lot of good experience.\nThat's the stuff that breaks my heart. That just doesn't happen in this game. You can explore and do whatever. Anyway, the news is that it was released this week and it broke Steam's concurrent single player record launch within hours of its launch. So that is an insane thing for, for it to happen.\nI think the numbers we saw.\nBen: Not so much of an asterisk though, the concurrent players, so many of them were in China. This is\nCherlynn: people being really\nBen: enthusiastic. Ask Nick about it in China and then a small minority of people single digit percentage of people in the US were playing this game.\nCherlynn: What's up, and they were all Chinese to\nChinese people in Asia in America. No, I I mean, I, I'm not surprised by the numbers. I think the Wukong title is interesting. Like I wanted to ask you about you know, cause y'all both delve into the similarities to dark souls and talk about the mechanics a [00:39:00]lot and the like components of the story, but I'm like, are the story characters.\nI like from grow growing up. Are they there? You know, are does the monkey king fall in love with the spider demon? Does like the sea I I've bring around get tighter. I've, I know. So that's, that's what I would be curious to see if they've like faithfully adapted the sort of story. Things that me, and I'm sure those concurrent streamers who are hugely Chinese are looking for, that's the sort of like vibe we're looking for.\nMaybe\nDevindra: you, you plays the monkey king, so I'll give you that. You got the staff, you got the, the cloud. He flies on. What is funny though is that I started watching OG Dragon Ball with my daughter and she's very much into original Dragon Ball. I'm like, look Monkey King, there's the staff, there's this clown, he's here.\nTail. So here's my thing too.\nCherlynn: There have been a lot of not that, I'm not talking about specifically Dragon Ball, but there have been like a lot of other adaptations, maybe even western adaptations of the Monkey King story that don't feel as faithful. I remember Monkey King appearing somewhere as a playable character or like in some other smaller movie type thing as [00:40:00] a baddie or something, right?\nAnd I'm just like, that's not what the Monkey King story is. It's a story about redemption. It's\nDevindra: about redemption, yeah. And the wily monkey. Anyway! I just want to point out that that crazy numbers from the game, what we were seeing is 88 percent of the players were in China. So U. S. was in\nCherlynn: America. What a nice coincidence.\nWe love the number 8. Yeah,\nDevindra: I was wondering\nBen: about that. Very lucky. How is it that it was 88%? Very lucky. That just seems like the books were cooked up. We gamed\nCherlynn: it, y'all. That's all.\nBen: Let's be clear. I am not accusing them of cooking the books on this, but it just seems like a\nDevindra: really interesting coincidence.\nWell, let me put the context down here. So this is essentially China's first triple A game. The first game that is on the level of something like God of War. So, yeah. I'm pretty sure if if the government was\nCherlynn: probably well adapted. Yeah.\nDevindra: If also, but if the government was like, we really gotta get the numbers on this game, like what\nCherlynn: can we just turn on everyone's gaming consoles, [00:41:00]those\nDevindra: consoles that are turned off because of gaming lockdown time you know, the government's yes, please, please.\nAll you got all get free copies of the game. I don't know. No, no, we don't know. If they do that, they were like,\nCherlynn: we're good. We're done.\nDevindra: I think. A lot of people in China definitely want to play this game. I'm playing through it right now. A couple of things worth mentioning because the developer game science was like in the news too, because apparently.\nThere was a document that went out to some streamers, or not streamers, but people who were got the first\nBen: look at the game or something.\nDevindra: The people who were covering the game, mainly in China, but apparently this went out to other countries, like a couple of other European countries too there was a list of forbidden subjects in their review agreement, which include, do not mention politics.\nDo not mention. Feminist propaganda. Do not mention COVID 19 or China's video game industry policies, the stuff we're talking about right now and other content that instigates negative discourse also believe like violence was one thing, even though this is a game about the monkey king, [00:42:00] like bashing giant gods in, in their heads with his stick.\nJust kind of funny. There is that whole thing. Game science did not respond to an email. I'm looking at the New York times reporting here. But this is not too surprising. Right. Cause we, we deal with all sorts of limitations when it comes to when we cover games, it's mainly just like it's embargo Hey, please don't spoil all the storylines.\nIt's just like a, an agreement to not spoil all the big surprises in the game, please. An embargo is okay, everyone is going to try to. Publish it this time or sometime after that's like the general agreement. We'll go to but certainly not content of our reviews Not like avoiding certain topics yeah,\nBen: also the leader of game science has I don't know.\nHe's just a poster like imagine This most whacked out stuff that Elon Musk has been posting about recently. This comes back to the idea of, are gamers okay? Gamers are not\nDevindra: okay. I don't even\nBen: want to mention it. It's just kind of nasty fratty [00:43:00]culture. You know, in a Chinese design studio.\nWhich makes me think, oh man, are all gamers the same? That's kind of sad. I think a lot, it's\nDevindra: in, it's in, Especially if you use it mostly consists of dudes and industry that is very dude heavy like unfortunately it leans to that There is a great reporting over at IGN last year It's called how black myth Wukong developers history of sexism is complicating its journey to the West Written by Rebecca Valentine and Kihun Chan This is a good piece Worth worth reading because yeah, essentially the culture of the studio does not seem great.\nIt seems very, very fratty, very much like a boys club. I will tell you all this I'm 10 hours into this game and now I do feel guilty about like playing it because I did not realize how fully shitty they were. Yeah. But Not a single woman, 10 hours of me playing this game, talking to other creatures, talking to gods, talking to you know, other people I'm fighting or people like living on the mountain, not a single [00:44:00]female character.\nSo Laura question for sure.\nCherlynn: I'm sure that's what you're about to ask Ben, which is, let me just tell you, the story itself is heavily male dominant, right? It, the story of the journey to the West is this monkey King, this monk, and like his three disciples, including the monkey King. So there's a pig boy\nBen: and,\nCherlynn: Tang San Zhang is the monk.\nAnd then he has Dude with the burly facial hair, that's one of his disciples. And then the Monkey King is like the second disciple, right? Or the third. And along the way, they go all the way to the west to retrieve something. I forget what. The key, the key point of the whole entire story and I forget.\nBut! Along the way they encounter demons and you know things that are meant to like they want to eat the monk's flesh Basically because it will give them immortality or something and they're demons and they're lesser beings in the lore, right? so two of the demons that they encounter or three the spider demon and The nine tailed fox or the fox demon or whatever.\nThese are both [00:45:00] women I haven't encountered these characters\nDevindra: yet, so I don't know. So\nCherlynn: probably you have encountered them because they might be like bigger, like enemies to fight. But I also will point out that in the historic telling of the story, that these two are known to seduce the, the monkey king and the, the monk, their attempt to, and it's very sexualized that way.\nAnd also it. into like slang. I wouldn't say slang, but like the vernacular where in Mandarin, the words spider demon or fox demon mean women who are like, I don't want to use the S word, but you know what I mean? Like they're a little promiscuous or they're a little, More out there, right? So you're saying like the story itself is\nDevindra: like inherently sexist too?\nYes. Yeah. I am not surprised. Not at all surprised. But it does seem like the game is reflecting that. Listen I think a modern developer could be like, well, screw that, right? Like we could, we could change things up because we are retelling the story. Could be.\nCherlynn: It would have been so cool.\nDevindra: Would it be so cool?\nBut it is\nCherlynn: also China.\nDevindra: It is also China. Where like you\nCherlynn: mentioned those stipulations and in media and [00:46:00]in entertainment, they're very careful about the messaging, which is why I was like nodding along when you said those things that they've stipulated because it tracks.\nDevindra: It tracks. Anyway game is okay so far.\nLike I'm, I'm enjoying at least, but it does suck that this company has a history of this. I feel like this is like something, if they cared, if they cared at all, Just the thing they could have noted, but no, it doesn't seem like they're, they care at all. Also rewatching original Dragon Ball you learn pretty much like Bulma is the goat, but nothing would happen in Goku's story without Bulma.\nSo shout out to Bulma. My daughter, Sophia loves Bulma. She's Bulma has all these like capsules. She's got all these vehicles. She's cool. Bulma is super cool. Shout out to Bulma. Okay. So that's Gamescom. Go take a look at all of our coverage from that event. And and if you're playing Black Myth Wukong, let me know what you think.\nLet's move on to some other news real quick. A couple of things I wanted to shout out. I wrote up something that is so deeply nerdy, but I'm very proud that we put it [00:47:00] on the site because this is, this isn't gadget. Okay, X mems, the company that Billy Steele has written about, which has produced solid state solid state drivers for earbuds and things like that.\nSo not like traditional speakers with the coil and the magnet, all that stuff, solid state silicon that can, that can work as your earbud driver. This company. He has used that same technology to produce a one millimeter tall fan on a chip. So this is one millimeter tall, essentially a chip that can work as a fan.\nIt's using ultrasonics to move air around within it. So\nBen: that's really interesting. It's really cool.\nCherlynn: Crazy. So the\nBen: whole idea is I was wondering like, where are the moving parts? Where are the fan blade? Really, really tiny ultrasonics,\nDevindra: Ben ultrasonics. So anyway, this company and they're using MEMS.\ntechnology, which is micro electromechanical systems technology. That is essentially like really, really, really small machinery, but in this case with no moving parts but essentially like you could put one or two or a [00:48:00] couple of these fans inside a future smartphone, inside a tablet, inside a device like the Mac book air M two, which died on me at Apple's campus because I was working in the sun and that computer has no fan.\nSo when you have no fan. You're the heat from all your work is just kind of trapped in there. So I just think this is really cool. This is something that could end up being in devices in the future. Could really change the way like ultra thin devices are made. If the rumors about Apple wanting to do that crazy ultra thin iPhone are true, like maybe we've got to get some airflow in that.\nAnd I just think that idea. Is, is, just think it's neat. What do you guys, what do you guys think?\nBen: I really hope that this doesn't drive dogs crazy.\nDevindra: It's\nBen: they say it's silent, but yeah. Ultrasonic, yeah. So it has to be like way outside of the hearing range of any creature, hopefully.\nDevindra: It could. Cherlynn, thoughts?\nCherlynn: I mean, I think the technology, the idea itself is really cool. I think Fan on a chip, like just that alone. Like we were all like, Devon, you got to look at this one. And then you were like, [00:49:00] yeah, it's just I think we all nerded out like a group as a group nerded out about this. Good\nDevindra: nerd stuff.\nDo you want to point out there is like a competing product for, I hate saying it out loud, for they are producing the air jets mini, which I believe the verge and other sites have have covered and forest thing is 2. 5 millimeters to 2. 8 millimeters thick. So, you know. A couple, couple millimeters taller and it also looks like a bigger package in this thing.\nLike the thing about XMEMS technology, it looks like a tiny little chip, so it could easily go inside your iPhone where there's this little space on real estate. It's the sort of thing you could put it right on the GPU, right on the APU. Looks cool, could change the way our devices are designed. So check out my coverage of the XMEMS chip.\nWe wrote a story in San Francisco. Real quick is aiming to take down AI undressing websites and a new lawsuit. This is just good news because the fact that there is a prevalence of these apps both on the web and an app source is absolutely disgusting. And we are like fully unequipped to deal with them right now.\nSo, it's, it's a good thing. [00:50:00]Hopefully we see more of this on a federal level too, not just a San Francisco. And something I wanted to ask Cherlynnn, because we saw this news drop Chick fil A. The chicken sandwich place is launching a streaming service for reality TV and tone programming. What do you think of Chick fil A's streaming service?\nCherlynn: Okay, first of all,\nDevindra: you should have\nCherlynn: paid better attention to our show notes. Yes, you should. Or not.\nBen: No, that's actually, no, that's actually great. Yeah. That's really funny that you weren't aware of this because now we're getting your real reaction. Yeah,\nDevindra: what are your first impressions on this news? What?\nThis is weird.\nBen: Why? What are\nCherlynn: they going to show me? It feels to me like these\nBen: executives are like channeling an idea, like they they took out a Ouija board, but instead of communicating with spirits, they're communicating with the spirit of 2015, and they're like, okay, what is the best business logic for growing our National [00:51:00] company.\nLet's just do a streaming service because streaming services are really hot, right? No, dude they're all consolidating because Piper has asked to be paid in terms of streaming\nCherlynn: There's a paradise in the chest. Are the cows the pigs? Producers cut a CD is like chicken dating show. I'm sorry if this is the actual content we're expecting.\nHell yes. I mean,\nBen: has like puppy football. Like we, we have a lot of love Island. It could be love pasture.\nCherlynn: Listen, listen, if they do like chicken farm content and then they slaughter the chickens and fry them, I think that is kind of concerning, but I will also say that have they, have y'all seen the KFC like Hallmark movie?\nDevindra: I've not seen it. I know it exists.\nCherlynn: Oh my god, where Mario Lopez plays Colonel Sanders, and then he falls in love with a woman. I think maybe that\nDevindra: was their inspiration. We gotta, we gotta out chicken KFC. We gotta, we gotta do something here. It was so good.\nCherlynn: I'm sorry if I've gone ultrasonic. I'm feeling [00:52:00]pitched.\nI think Chick fil A\nDevindra: is flying too close to the sun. I think that's what it is. They are doing really well. It's got all this money. You can do all this stuff. Also,\nBen: Chick fil A is notorious for you know, did a cow write this sign? It's like E E T, more chicken. Yeah. Like, all spelled wrong. It's quite funny.\nSo I can only imagine what the closed captions would look like. Oh, man. But also,\nDevindra: Chick fil A is notoriously a a very religious, religiously leading company. Yes, that's what I was thinking, too. Again, the Hallmark movie may actually\nBen: be a good,\nCherlynn: Maybe.\nBen: Yeah. No, that's what I was thinking about. It could be kind of like Hallmark or it could be like, what if we had our own Hallmark?\nYeah. Yeah.\nCherlynn: Right. But what if they bought farmers only, which I don't know if y'all know is like a farmer's only dating website.\nDevindra: Yeah.\nCherlynn: And then they were like chicken farmers only. And then they put them on a show.\nDevindra: Okay. So we had funny news. How about some WTF news? Because this is a crazy story and I'm just bringing it up because it is fricking wild.\nIt's also basically the plot of industry season three British [00:53:00] billionaire, Mike Lynch was recently found dead after his yacht sank several days ago, or it may have been a week ago at this point. I'm mentioning this. Because this guy is involved in a lot of shady stuff. Like back when I was covering HP stuff he was the CEO of autonomy and HP bought that for 11 billion and not too long after HP was like, Oh crap, we made a huge mistake, 8.\n8 billion right down. Just for buying autonomy. He and his former VP of finance were basically I believe San Francisco was charging them for a while. They were recently acquitted in June on he was acquitted on 15 counts of fraud. This is a guy was just a bonkers bonkers life. So he disappeared from his boat now proven to be dead.\nWe think, oh, this is a kind of a weird story, right? His former VP of finance, Stephen Chamberlain. Died mysteriously this week after being hit by a car.\nCherlynn: Extremely mysterious. Extremely.\nDevindra: Extremely like bank who's very [00:54:00] pissed off about the billions of dollars that they probably lost because of your deal or your business practices.\nExtremely Oh, you just, we're going to make you go bye bye now. Anyway, that is purely conjecture, purely conspiracy theory.\nBen: Yeah. Remember that episode of breaking bad where they coordinated a hit. On five different possible witnesses in different prisons all in the same five minutes.\nDevindra: Yeah, I mean, it's just, it is wild.\nThere are some things that happen in real life that is totally freaky. I don't know, there are reports about what like ExxonMobil does to reporters. Like when they co cover oil fields or stuff somewhere. Reporters have said my hotel reservation was cancelled. Things are just really weird, like weird shit that these companies have the power to do folks.\nLike we see stories about the mobs and stuff, but don't forget who has all the money and all the power. Just dropping that weird story right there. Anyway, watch Industry if you want another angle or another type of story like this. Cherlynn, again, you should watch that show. [00:55:00] I think you'd enjoy it.\nCherlynn: I just want to point out that Davindra, I, I, you know me, I like to re watch Schitt's Creek until the day I die before I like even start a new show, so.\nDevindra: Well, it's more you want some nice drama, nice steamy drama in your life. When I do\nCherlynn: want some nice Non-science fiction, drama, non-science fiction drama\nDevindra: with like human characters who have flaws, who are very ambitious. Like I think you would does\nCherlynn: it sound like this? Mm-Hmm. other show.\nThis succession. It's\nDevindra: very, in fact, I wrote a whole piece about that Sherly. So you should go, you should go read that review. I know. Flying Lotus. The artist, one of my favorite artists, has confirmed that he composed two Apple ringtones, Daybreak and Chalet, which have been on iPhones since 2019. So I'm just, that's cool.\nIt's cool to me. Is it cool to you, Ben? Must've\nBen: been a nice bag. Must've been a really nice bag. And this is also has a, podcast connection because the podcast 20, 000 Hertz, which is a podcast all about sound design. So they were doing a little series called The Sound of Apple [00:56:00] and they talked about it.\nAnd so now Flying Lotus was like, okay, I didn't just ghost produce these. I can say, yes, I produced these two ringtones and I'll drop these two ringtones in on the audio version. So here's Daybreak.\nAnd here's Chalet.\nDevindra: I, I've switched back to daybreak, but they have the same layers and vibes of flying Lotus's stuff. So I'm like, okay, we should have sure. Probably told that this is the rumors about Michael Jackson working on the Sonic three soundtrack. [00:57:00] This is like that level of geek and artistry kind of, combining, which I don't think was ever fully confirmed.\nLike maybe he did some consulting or something, but that soundtrack did slap. So there's that. Let's move on to some pop culture pics for the week. What do you got? Show one.\nCherlynn: So I, when I thought I had pop culture pics this week, I realized I might've already shared it with the, the, this podcast, but no, but, but, but, but, but just reminder that I still watch scary interesting till I die because it's hilarious.\nI mean, hilariously morbid it's just hilarious that I listened to those stories. If people getting stuck in caves and underwater diving accidents. Why would you do this to yourself? Okay. Because I enjoy it somehow. But so I think I have mentioned this right on the podcast. I think Ben or Dove, you might remember scary, interesting, cave exploring gone wrong. Anyway. So instead of that sort of pop culture pick, I'm going to give y'all a different one, which is I recently discovered because it's surfaced on my app, YouTube has these games. Now, have y'all, have y'all seen these? I don't know. Maybe I'm aware\nDevindra: that they're game.\nCherlynn: Yeah. So it's not like new information.\nIt's not brand new [00:58:00]information as Phoebe buffet would say, but I just started playing some of them and they're quite hilariously not great, and but also somewhat addictive in classic me. Classic Sherline?\nDevindra: Yes. Classic air. The game included on the airplane TV Sherline? Yes. Yeah.\nCherlynn: Okay. There is a, there is a a game that I've been playing on YouTube games called a Phone Case Designer.\nDevindra: Okay, yeah,\nCherlynn: that's my recommendation.\nDevindra: Thank you for that Cherlynn. Actually Ben, do you want to shout anything out? Cuz I got a I need to run to the bathroom. Yeah, I think so. Okay, go for it Yeah, yeah,\nBen: I get to do a producer pick that's cool Okay, so a couple of years ago, there was a book that came out called uncanny valley by Anna Weiner or Weiner I think it might be Weiner and it's generally like a A Story that I am very familiar with which is like this is a non fiction book It's about a woman's experience [00:59:00] going from the publishing world to working in startups in the early 2010s She started out working for this like big data company when big data was first rising and then moved over to github and Is just talking about her personal experience with the weird culture of the bay area during that time Because in that time of the early to mid 2010s, was when like the population of the Bay Area, especially like San Francisco Oakland area, was really Turning over.\nThere were a lot of people, a lot of young professionals coming from all over the country to work at these startups, making a lot of money, like talking about doing ayahuasca trips and how even when they're tripping, they're thinking about like B2B business solutions. It's strange. It's not something that I wasn't already aware of, but it was, it's just [01:00:00] fun to Listen to I'm listening to the audiobook.\nCherlynn: Yeah. I mean, that's why we all do the pop culture picks from different people because different people have different tastes and you have your taste and I love to play silly little YouTube games. So there you go. Simon B in the chat says YouTube games are too addicting. So I feel like I feel supported.\nWhere were you back in the Facebook games\nDevindra: era, Sherilyn? Were you deep in Farmville\nCherlynn: or not? Yeah. PVZ? No, I didn't play Farmville, even though I think I could have. And I think a lot of people in my circles did play them. It feels\nBen: Okay. Okay. So, Dev, do you have a pick? Yeah, I'll\nDevindra: do real, real quick.\nI do want to shout out that one of the greatest TV shows ever made, which has been inaccessible for a long time, Homicide Life on the Street. One of the best cop shows ever made is it's now wire before the wire wire before the wire based on david simon's book with a lot of people who went on to produce other tv shows like bosh it is now streaming on peacock.\nIt's an incredible show starring the late great andre brauer so You miss Andre Brower from Brooklyn [01:01:00]Nine Nine. A lot of great actors, like characters that were established in Homicide went on to Law and Order and other things. So it's a fantastic show. You should check it out. Especially the first few seasons.\nIt's streaming right now. I have the DVD set, which was great. It's just on sale, but I don't, I'm still happy to have that because I feel like the digital version can go any, any time you get to buy the things you love. So that's what I've got for this week.\nCherlynn: Well, that's it for the episode this week, everyone.\nThank you as always for tuning in. Our theme music is by game composer, Dale North. Our outro music is by our former managing editor, Terrence O'Brien. The podcast is produced by Ben Elman. You can find Dev or Davindra online at\nDevindra: And Devindra on Twitter, Blue Sky, Mastodon, the usual places. And I chat about movies and TV at the Filmcast, thefilmcast.\ncom.\nCherlynn: If you want to hit me up, I am occasionally on Twitter. Still, I am at Cherlynn Lowe there C H E R L Y N N L O W. But you can hit me up on threads where I am posting [01:02:00] engagement bait at C H E R L Y N N S T A G R A M. Always email us your thoughts about this podcast at podcastatengadget. com. Leave us a review on iTunes or whatever you're getting your podcast on because that helps people discover us.\nAnd subscribe on anything that gets podcasts.\nBen: Were you deep in Farmville or not?",
  "word_count": 13030,
  "scraped_at": "2026-02-14T14:23:03.316741"
}