{
  "article_id": "deffdf80877a",
  "url": "https://www.dailymail.co.uk/news/article-13722709/inside-fake-news-website-accused-fuelling-riots-claiming-southport-asylum-seeker.html",
  "title": "Inside shady fake news website accused of fuelling riots by falsely claiming Southport suspect was an asylum seeker",
  "date": "20240808T110000Z",
  "domain": "dailymail.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Inside shady fake news website accused of fuelling riots by falsely claiming Southport suspect was an asylum seeker\nA Pakistani father, an amateur Canadian hockey player and a man named Kevin from Texas have been identified as some of the figures involved in a shadowy fake news website that fuelled lies about the Southport stabbings.\nChannel3Now, which masquerades as an American news website, published a false story claiming the stabbing suspect was an asylum seeker called Ali Al-Shakati who arrived in the UK on a small boat and was 'on the MI6 watchlist'.\nA social media post about the story on July 29 received millions of views and was widely shared on X by far-right influencers, who leapt on the false suggestion that the suspect - in reality a 17-year-old called Axel Rudakubana - was Muslim.\nThe online lies spread so far and so quickly that Merseyside Police was forced to take the unusual step of releasing a statement saying the name circulating on the internet was 'incorrect' and that the suspect was in fact born in Cardiff.\nBut that did not stop hundreds gathering outside a mosque in Southport, throwing missiles and shouting slogans such as 'No surrender' and 'English till I die', before setting a police van on fire. Six days of far-right rioting would follow.\nOne of Channel3Now's employees has been identified as Farhan, a father from Lahore in Pakistan. There is no suggestion he had anything to do with the Southport story\nFAKE NEWS: A screengrab of the story as it was originally posted on the Channel3now site\nAn investigation looking into the origins of Channel3Now by BBC disinformation and social media correspondent Marianna Spring identified two of its contributors as an amateur hockey player called James - who lives in Nova Scotia in Canada - and Farhan, a father from Lahore, Pakistan.\nThe two men, neither of whom were named as authors of the Southport story, were verified as real people by friends or former colleagues.\nThe BBC was also contacted by a man called Kevin, from Houston in Texas, who claimed he was speaking from the site's 'main office' in the US.\nHe claimed there are 'more than 30' people in America, the UK, Pakistan and India who work for the site and said these were usually freelancers, including Farhan and James.\nKevin said the site was a business and that 'covering as many stories as possible' helped to make money. Many of its stories are accurate and copy crime reports in the US media.\nKevin refused to name the owner of the operation, saying he was worried 'not only about himself but also about everyone working for him'. He said Farhan in particular had nothing to do with the Southport story.\nChannel3Now has issued a 'sincere apology' for the story and blamed its 'UK-based team'. The fake news site claimed it had 'fired' those responsible.\nThe apology contained several errors, and when the Mail ran the wording through five separate AI language checkers, four said that 100 per cent of it had been written by an AI programme such as ChatGPT.\nChannel3Now started life 11 years ago as a Russian YouTube channel that posted videos of rally-driving in the snow in Izhevsk, a Russian city about 750 miles east of Moscow.\nThe drivers named in the videos have connections to the country's defence and IT industries, including a man who appears to be a former KGB operative who has since served in Russia's parliament.\nIts origins as a Russian YouTube channel have drawn claims the site could be linked to the Russian state. But speaking to the BBC, its employee Kevin said: 'Just because we purchased a YouTube channel from a Russian seller doesn't mean we have any affiliations.'\nFAKE NEWS: A social media post about the fake news story on July 29 received millions of views and was widely shared on X by far-right influencers\nChannel3Now issued a 'sincere apology' for the story and blamed its 'UK-based team'. The fake news site claimed it had 'fired' those responsible\nA police van was set on fire near a mosque in Southport on Tuesday evening as riots broke out\nTrouble flares during a protest in Southport, after three children died and eight were injured in a knife attack\nChannel3 Now was inactive for six years before it suddenly began posting bizarre videos in English in 2019, including one about a tiger being beaten to death and a match report on the Manchester City women's football team.\nTwo years ago, the videos began to look like the output of a professional news channel and, in June last year, Channel3 Now set up its website, which has been accused of sharing 'racially motivated click-bait'.\nThe website has routinely changed its name and has gone by 'Fox3 Now' and 'Fox3 News' in an apparent attempt to copy the names of legitimate news organisations. It appears to be using internet servers in the US and is registered with an online hosting company in Lithuania, but has privacy features that hide its owner's identity.\nIn its online report of the Southport stabbings, Russia Today – Vladimir Putin's state broadcaster – repeated Channel3 Now's lies. It later put an 'editor's note' on the article saying 'the outlet later retracted the claim'.\nThe first mention of the suspect's false name appears to have been shared to the near 50,000 followers of well-known UK anti-lockdown activist Bernadette Spofforth.\nBefore the victims had been identified, Mrs Spofforth, 55, wrote at 4.49pm: 'Ali Al-Shakati was the suspect, he was an asylum seeker who came to the UK by boat last year and was on an MI6 watch list. If this is true, then all hell is about to break loose.'\nIt came at 4.49pm on Monday, around five hours after the attack that left three primary school girls who were attending a Taylor Swift-themed dance event dead.\nTwo minutes later, the details appeared on Channel3 Now, where they were amplified to millions of people across the internet.\nThe tweet was later deleted, and Ms Spofforth told MailOnline: 'My post had nothing to do with the violence we've seen across the country. But I acknowledge that it may have been the source for the information used by a Russian news website.'\nBritish businesswoman Bernadette Spofforth has been accused of being the first person to post false information that the Southport stabbings suspect was an asylum seeker who had arrived in Britain by boat\nMs Spofforth posted on X the wrong name of the boy accused of carrying out the attacks just hours after three girls were murdered at a Taylor Swift dance workshop last Monday\nMailOnline was able to establish her identify after conducting an extensive trawl of X posts featuring the name Ali Al-Shakti which showed that hers was the first.\nWhen challenged about this, Ms Spofforth claimed that she had seen someone else post the name on X but was unable to provide any evidence.\nThe activist is the managing director of a clothing company and lives in a £1.5million farmhouse in Cheshire.\nSouthport suspect Axel Rudakubana, 18, was one of two brothers born in Cardiff to Rwandan parents who had migrated to the UK in 2002.\nBebe King, six, Alice Dasilva Aguiar, nine, and Elsie Dot Stancombe, seven, died after a Taylor Swift-themed dance class at the Hart Space on Monday July 29.\nToday, police launched dawn raids targeting 'seriously violent' thugs who took part in far-right rioting after last night passed off largely peacefully despite fears of more chaos.\nSir Mark Rowley said his force had smashed its way into the homes of the 'most violent' members of last weeks protests in Whitehall and branded them 'criminal thugs'.\nA total of 10 people were arrested, with the chief of the Metropolitan Police joining officers in south London as they took the suspects into custody.\nThe head of Britain's largest police force said it was 'nonsense' these people are patriots and hailed a 'show of unity from communities' which saw thousands of anti-racism demonstrators flood streets around the country.\nIt was reported around 100 hate-filled protests had been planned across England outside immigration centres, organised on secretive far-right channels on social media app Telegram.\nHowever, come 8pm many of those did not even turn up and those that did were dwarfed in size by counter-demonstrations, with up to 25,000 anti-racist activists turning out in force in cities across the UK.\nMailOnline has contacted Channel3Now for comment.\nMost watched News videos\n- Extraordinary moment mass brawl breaks out between Brits on flight\n- Finance expert's TV interview interrupted by adorable granddaughter\n- Moment driver veers to target e-bike riders before killing teen\n- Moment Swiss bar fire owners collapse after being confronted\n- Astonishing moment a street is swallowed by a sinkhole\n- Chilling police interview of ISIS fanatic plotting UK attack\n- Food vlogger dies after 'eating toxic devil crab'\n- Spy cam shows woman on her knees next to Jeffrey Epstein\n- Deepak Chopra confronted over his relationship to Epstein\n- Toddler opens car door in traffic and sends biker flying\n- New video shows man with backpack similar to Guthrie kidnapper\n- Israeli hostage reveals how she survived being tortured",
  "word_count": 1540,
  "scraped_at": "2026-02-14T12:09:24.070513"
}