{
  "article_id": "df12327a04f2",
  "url": "https://www.ok.co.uk/royal/prince-william-couldnt-walk-week-29953081",
  "title": "Prince William  couldnt walk for a week  after football amidst Coronation celebrations",
  "date": "20230511T144500Z",
  "domain": "ok.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Prince William 'couldn't walk for a week' after football amidst Coronation celebrations\nWilliam, Prince of Wales, discussed his footballing exploits with former England player Luther Blissett as the royal handed out honours at Windsor Castle on Wednesday\nPrince William “couldn’t walk for a week” after playing football, ex-England striker Luther Blissett has revealed.\nThe Prince of Wales, 40, discussed his footballing exploits with the former Watford player as he handed out honours at Windsor Castle on Wednesday.\nBlissett, who was one of the most prominent black English footballers in the 1970s and 80s and the first black footballer to score a hat-trick for England, received an OBE for his services to the sport and for his charity work.\nThe 65 year old, discussing what he and William spoke about during the ceremony, said: “We had just a couple of little words. I did ask him if he would love to come and join us on the (Watford former) players club and he said yes, he would love to.\nREAD MORE: Peter Phillips took his girlfriend to King's Coronation concert following divorceREAD MORE: Kate Middleton's clever parenting tricks used to keep son Louis in check at Coronation“He said he was playing (football) last week and he said he couldn’t walk for a week afterwards. He says he still plays 11-a-side.”\nBlissett also spoke to the prince about his charity work and shared his well-wishes following King Charles’ Coronation at the weekend.\nIt has been well documented that William is a big football fan. He is President of the Football Association (FA), a role he has held since 2006 after taking over from uncle Prince Andrew.\nAnd perhaps surprisingly for a London born prince, William is a keen supporter of Midlands club Aston Villa.\nDiscussing the reasons for his Villa allegiance with BBC presenter Gary Lineker in 2015, the Prince of Wales said: “A long time ago at school I got into football big time. I was looking around for clubs. All my friends at school were either Man United fans or Chelsea fans and I didn’t want to follow the run of the mill teams.\n“I wanted to have a team that was more mid-table that could give me more emotional rollercoaster moments.\n“Aston Villa’s always had a great history. I have got friends of mine who support Aston Villa and one of the first FA Cup games I went to was Bolton v Aston Villa back in 2000. Sadly, Villa went on to lose to Chelsea.\n“It was fantastic, I sat with all the fans with my red beanie on, and I was sat with all the Brummie fans and had a great time.\n“It was the atmosphere, the camaraderie and I really felt that there was something I could connect with.”\nWilliam regularly attends football matches - including the Women's Euros finals in 2022.\nHis children, Prince George and Princess Charlotte are fans of the beautiful game too, with Charlotte recording a sweet message of support for the Lionesses ahead of the Euros final.\nAnd after the match, Prince William surprised spectators by hugging the Lionesses as he celebrated victory with them.\nREAD MORE:\n- Click here for today's top showbiz news\n- Charles 'crushed' after finding out about Harry's Meghan bombshell minutes before public\n- Meghan Markle's casual hike in $157k of jewels - first pic after skipping Coronation\n- Royal aide who wrote Meghan Markle 'bullying' letter is given huge honour\n- Princess Charlotte's failed curtsy and sweet way Queen Camilla reassured her",
  "word_count": 586,
  "scraped_at": "2026-02-14T12:55:30.053264"
}