{
  "article_id": "df12f1a12458",
  "url": "https://www.telegraph.co.uk/tv/0/welcome-to-wrexham-series-2-disney-review/",
  "title": "Welcome To Wrexham series 2 , review : The footballing fairytale now comes by royal appointment",
  "date": "20230906T153000Z",
  "domain": "telegraph.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "“So the King of England called…” These are the opening words as Welcome to Wrexham (Disney+) returns for a second series. Already nominated for six Emmys, causing “Wrex-mania” worldwide and catapulting the neglected North Wales football club to cult fame, the hit docuseries has become a bona fide phenomenon. Now it also comes by royal appointment.\nLast year’s debut run followed Hollywood actors Ryan Reynolds and Rob McElhenney’s unlikely takeover of non-league Wrexham AFC - the world’s third oldest professional football club - and their burgeoning relationship with the local community. As we return, the duo are undergoing etiquette training ahead of meeting the King and Queen on a royal tour to mark Wrexham’s upgrade to city status. Now all it needs is a big-time team to match.\nAfter play-off heartbreak, which wasn’t in the script, season two continues to track Wrexham’s fight for promotion. The figurehead co-chairmen hope a royal visit will help raise the £20m needed to redevelop the run-down Racecourse Ground. They’re foiled again when their application to the Levelling Up fund is rejected. Such setbacks keep the show rooted in reality. Frustrated by British bureaucracy, Reynolds offers to sell his own children instead. Well, he’s got four so can spare a couple.\nFour episodes of 15 were made available for preview. They skilfully interweave the team’s fortunes with those of its devoted supporters. It’s a vivid portrait of a working-class region’s worries and dreams, and how this footballing fairytale has restored its pride. One emotive instalment connects autistic super-fan Millie Tipping with talismanic striker Paul Mullin’s non-verbal son Albie. Manager Phil Parkinson’s rousingly potty-mouthed team talks are another highlight.\nIt’s still clearly aimed at an American audience but on this evidence, elements that jarred with UK viewers – patronising baseball analogies, broad accents being subtitled – have wisely been toned down. A standalone episode introduces the Wrexham AFC Women’s Team. Another canny move, given the Lionesses-inspired explosion in popularity of the women’s game. Do we detect a potential spin-off?\nThe rags-to-riches premise might now feel flawed – Wrexham stopped being scrappy underdogs when the cash and cameras arrived – but it remains heartwarming and full of earthy humour. Anyone with a passing interest in lower-league football also knows the outcome, as the show lags 12 months behind the real world. Such quibbles soon fade in the face of an irresistible charm assault.\nIt’s often compared to a real-life Ted Lasso, thankfully without the soppy bits. One of the Apple comedy’s catchphrases was “Football is life”. Welcome to Wrexham is proof that’s true. The spirited, soulful series is testament to hope, community and the transformative power of sport. TV fit for a King.\nOn Disney+ now",
  "word_count": 449,
  "scraped_at": "2026-02-14T13:03:57.780143"
}