{
  "article_id": "df181d699fb3",
  "url": "https://www.poynter.org/commentary/2024/steve-kornacki-polls-how-to-read/",
  "title": "What should we make of all these polls ? NBC New Steve Kornacki breaks it down",
  "date": "20241021T143000Z",
  "domain": "poynter.org",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Every day, it seems, there’s a new political poll to dissect.\nKamala Harris leads this state by two points. Donald Trump leads that state by a point. Harris leads this national poll. Here are Trump’s odds to win the election.\nThen again, all the polls are within the margin of error.\nWhat does it all mean? Does it mean anything? With just over two weeks until election day, how should we look at polls?\nI went directly to the guy who knows all about polling — NBC News and MSNBC national political correspondent Steve Kornacki.\nKornacki has become a staple of preelection and election night coverage. He stands in front of a big map — with his rolled-up sleeves, tie with no jacket, and khakis — breaking down polling and voting down to the very neighborhoods that could ultimately decide the election.\nAnd he is my guest on the latest episode of The Poynter Report Podcast. The new episode drops today. (Listen on Apple Podcasts, Spotify or Amazon Music, and don’t forget to leave us a rating and review.)\nSo, back to the question: What should we make of all these polls?\nKornacki told me on the podcast to look for trends in polling. Take them all in, look at the trajectory of the polls and see if they are trending one way or another. That is always a good indicator.\nThen Kornacki said, “There’s some very big questions that kind of hang over the election and hang over the polling that it really won’t be resolved until election night. The biggest one is we saw state-specific — big state-specific — polling misses in 2016 and 2020 that particularly affected the Big 10 States: Pennsylvania, Michigan, Wisconsin. Does the issue persist for a third straight election? And if it does, then the polling right now is actually a lot more favorable for Trump than it looks. And if it doesn’t, the Democrats are probably happier right now with where they stand.”\nOur 25-minute conversation includes how Harris’ late entry into the race impacted polling, what election night is like for him, and what he prefers: the chaos of election night, working on “Sunday Night Football” or helping out on NBC Sports’ Kentucky Derby coverage. (The answer might surprise you. Or maybe it won’t, if you know Kornacki.)\nI also asked Kornacki about a possible election night surprise. We all know the election figures to come down to the swing states Pennsylvania, Michigan, Wisconsin, Georgia and Arizona, and perhaps North Carolina. But Kornacki actually has another state that could deserve our attention. It might not flip from one party to the other, but it could give us all a hint as to how the election might turn out based on its early election night results.\nAnd that state, I bet, will be a surprise to you.\nSo be sure to check out our podcast.\nKurtz’s fact checks\nI’ve never been a fan of Howard Kurtz’s Sunday morning show, “MediaBuzz,” on Fox News, mostly because it really doesn’t focus as much on media news as the title of the show suggests. It certainly does not zero in on media issues the way CNN’s former media show, “Reliable Sources,” once did.\nBut Kurtz deserves a little credit for at least attempting to fact-check Donald Trump while interviewing him on Sunday’s “MediaBuzz.”\nTrump continues to push the debunked and racist theory that Haitian immigrants ate people’s pets in Springfield, Ohio. Kurtz, at one point, asked Trump, “But why not say now, ‘Well, look, that turned out not to be true.’”\nTrump, however, said, “I don’t know. I don’t know if it’s true or not true.” He then started talking about geese: “What about the goose, the geese? What about the geese? What happened there?”\nAfter an exchange, Kurtz clarified to Trump, “Well, I think it’s been debunked by local officials.” To which Trump said, “I don’t think it’s been debunked at all. I think nobody talks about it, except you.”\nTo be clear: It has been debunked repeatedly by local officials.\nAt another point during the taped interview, Kurtz told the audience after a segment that discussed Jan. 6: “To clarify, police did not usher protesters into the Capitol. They were totally overrun, though in some cases they may have made a tactical retreat. Trump’s claims that the last election was rigged has never been proven in any of the lawsuits filed.”\nIn fact, the Harris campaign actually tweeted out Kurtz’s fact check.\nSpeaking of Trump …\nWe can’t let the weekend pass without discussing Trump’s utterly bizarre Saturday rally in Latrobe, Pennsylvania — the hometown of the late golfer Arnold Palmer. I bring up Palmer because Trump talked about him in a way that is unhinged and gross for a presidential candidate.\nThe following was actually said by Trump: “Arnold Palmer was all man. And I say that in all due respect to women, and I love women. But this guy, this guy, this is a guy that was all man. This man was strong and tough. And I refused to say it, but when he took showers with the other pros, they came out of there, they said, ‘Oh my God, that’s unbelievable.’ I had to say it.”\nThe Washington Post’s Marianne LeVine and Isaac Arnsdorf reported, “At about 10 minutes, the digression about Palmer lasted roughly as long as Vice President Kamala Harris’s entire speech at a get-out-the-vote event earlier Saturday in Detroit. Trump’s speech was filled with asides, abrupt changes of subject and profane and personal attacks.”\nThe New York Times headline of the speech read, “At a Pennsylvania Rally, Trump Descends to New Levels of Vulgarity.” The Times’ Michael Gold wrote that Trump “spewed crude and vulgar remarks.”\nThose R-rated remarks also included insults of Kamala Harris, including calling her a “s*** vice president.”\nGold added, “The performance, 17 days before the election in a critical battleground state, added to the impression of the Republican nominee as increasingly unfiltered and undisciplined. It comes as some of Mr. Trump’s allies and aides worry that Mr. Trump’s temperament and crass style are alienating undecided voters. It was unclear if the outbursts and insults were an expression of his frustration as the campaign grinds on or of his reflexive desire to entertain his crowds.”\nThe Latrobe rally is just the latest example of Trump’s spiral into obscene, tasteless and crude remarks in speeches.\nEarlier this month, The New York Times’ Peter Baker and Dylan Freedman wrote, “He rambles, he repeats himself, he roams from thought to thought — some of them hard to understand, some of them unfinished, some of them factually fantastical. He voices outlandish claims that seem to be made up out of whole cloth. He digresses into bizarre tangents about golf, about sharks, about his own ‘beautiful’ body. He relishes ‘a great day in Louisiana’ after spending the day in Georgia. He expresses fear that North Korea is ‘trying to kill me’ when he presumably means Iran. As late as last month, Mr. Trump was still speaking as if he were running against President Biden, five weeks after his withdrawal from the race.”\nBaker and Freedman added, “With Mr. Biden out, Mr. Trump, at 78, is now the oldest major party nominee for president in history and would be the oldest president ever if he wins and finishes another term at 82. A review of Mr. Trump’s rallies, interviews, statements and social media posts finds signs of change since he first took the political stage in 2015. He has always been discursive and has often been untethered to truth, but with the passage of time his speeches have grown darker, harsher, longer, angrier, less focused, more profane and increasingly fixated on the past.”\nAccording to computer analysis, The Times wrote, “Mr. Trump’s rally speeches now last an average of 82 minutes, compared with 45 minutes in 2016. Proportionately, he uses 13 percent more all-or-nothing terms like ‘always’ and ‘never’ than he did eight years ago, which some experts consider a sign of advancing age. Similarly, he uses 32 percent more negative words than positive words now, compared with 21 percent in 2016, which can be another indicator of cognitive change. And he uses swearwords 69 percent more often than he did when he first ran, a trend that could reflect what experts call disinhibition.”\nMeanwhile, Anne Applebaum’s latest piece for The Atlantic is “Trump Is Speaking Like Hitler, Stalin, and Mussolini.”\nApplebaum wrote about the language Trump has used, saying, “Several generations of American politicians have assumed that American voters, most of whom learned to pledge allegiance to the flag in school, grew up with the rule of law, and have never experienced occupation or invasion, would be resistant to this kind of language and imagery. Trump is gambling — knowingly and cynically — that we are not.”\n‘60 Minutes’ response\nRecently, “60 Minutes” invited both Harris and Trump to be interviewed on their show. Harris accepted the invite, while Trump did not.\nAfter Harris’ interview aired, Trump accused CBS News of deceitfully editing an answer Harris gave about Israel. Trump has made a bunch of threats about CBS and how it should lose its license and how he’s going to sue them and so forth.\nThe Associated Press’ David Bauder reported at the time, “Portions of the Harris interview ran Monday on the newsmagazine and on the Sunday morning political show ‘Face the Nation.’ On two occasions, it depicted Harris giving different answers to questions posed by correspondent Bill Whitaker on the Biden administration’s efforts to stop the war in the Mideast. For CBS News, it was considered part of the typical editing and cross-promotion process that takes place for a big interview. Yet to those unfamiliar with journalism and television production, the effect can be jarring.”\nBauder added, “The network would not respond to Trump’s criticisms on the record but privately insisted nothing was done with the intention of benefiting Harris. The network has pointed out that the same process was in place when Trump was interviewed for the show several times earlier.”\nBut on Sunday, after Trump continued his attacks on his “MediaBuzz” appearance, “60 Minutes” put out a statement that said:\nFormer President Donald Trump is accusing 60 Minutes of deceitful editing of our Oct. 7 interview with Vice President Kamala Harris. That is false.\n60 Minutes gave an excerpt of our interview to Face the Nation that used a longer section of her answer than that on 60 Minutes. Same question. Same answer. But a different portion of the response. When we edit any interview, whether a politician, an athlete, or movie star, we strive to be clear, accurate and on point. The portion of her answer on 60 Minutes was more succinct, which allows time for other subjects in a wide ranging 21-minute-long segment.\nRemember, Mr. Trump pulled out of his interview with 60 Minutes and the vice president participated.\nOur long-standing invitation to former President Trump remains open. If he would like to discuss the issues facing the nation and the Harris interview, we would be happy to have him on 60 Minutes.\nAfter the statement, the Trump campaign continued with more attacks, saying in part, “Their statement is not a denial, it is an admission that they did exactly what they were accused of.”\nMedia tidbits\n- The Guardian’s Hugo Lowell reports that data suggests canvassers linked to Elon Musk’s America PAC falsely claimed to have visited homes of potential voters.\n- And on the topic of Musk, The New York Times’ Theodore Schleifer with “Musk’s $1 Million Offer Raises New Legal Questions.”\n- Here’s a story that could keep you up at night. Politico’s Kyle Cheney, Heidi Przybyla, John Sakellariadis and Lisa Kashinsky with “The Very Real Scenario Where Trump Loses and Takes Power Anyway.”\n- NBC News anchor and senior Washington correspondent Hallie Jackson will interview Kamala Harris on Tuesday. The interview will first air on “NBC Nightly News” on Tuesday, and then on NBC News NOW, NBCNews.com, TODAY and MSNBC. The full interview and transcript will be available on NBCNews.com and the NBC News app.\n- Just to clarify something from last week: NewsNation will host a town hall with Republican vice presidential candidate JD Vance on Thursday. The town hall will be streamed on X, as well as aired on NewsNation at 8 p.m. Eastern. Chris Cuomo will moderate.\n- NBC News’ Andrea Mitchell and Julie Cerullo with “Paul Whelan was devastated at being left behind in a Russian labor camp as other Americans were released.”\n- The Washington Post’s Will Sommer with “John Grisham poached material for new book, media outlets say.”\n- In case you missed it, a pretty good political cold open from “Saturday Night Live” with former cast member Maya Rudolph playing Kamala Harris being constantly interrupted by Alec Baldwin, who was playing Fox News anchor Bret Baier.\n- Mentioning this story again in case you missed it. For Poynter, Pete Croatto with “How Sellout Crowd, the Oklahoma sports website, went from anticipated startup to heartbreaking disaster in 8 months.”\nHot type\n- For “CBS News Sunday Morning,” contributor Christian Cooper with “The secret life of pigeons.”\n- For “60 Minutes,” Sharyn Alfonsi with “Families in western North Carolina rebuild in the wake of Hurricane Helene: ‘This is home.’”\nMore resources for journalists\n- Transform your crime coverage while helping your community.\n- Encourage an outstanding colleague to apply for Leadership Academy for Women in Media.\n- Are you an upcoming-and-coming newsroom manager?\nHave feedback or a tip? Email Poynter senior media writer Tom Jones at tjones@poynter.org.\nThe Poynter Report is our daily media newsletter. To have it delivered to your inbox Monday-Friday, sign up here.",
  "word_count": 2293,
  "scraped_at": "2026-02-14T13:44:15.844091"
}