{
  "article_id": "df48603f643e",
  "url": "https://www.theguardian.com/technology/2026/jan/03/reddit-overtakes-tiktok-uk-search-algorithms-gen-z",
  "title": "Reddit overtakes TikTok in united kingdom thanks to search algorithms and gen z",
  "date": "20260103T081500Z",
  "domain": "theguardian.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Reddit, the online discussion platform, has overtaken TikTok as Britain’s fourth most visited social media service, as search algorithms and gen Z have dramatically transformed its prominence.\nThe platform has undergone huge growth over the last two years, with an 88% increase in the proportion of UK internet users it reaches. Three in five Brits online now encounter the site, up from a third in 2023, according to Ofcom.\nIts popularity is rising fastest with younger internet users. It is now the sixth most visited organisation of any kind by UK users aged between 18 and 24, up from 10th a year earlier. More than three-quarters of that cohort now visit it.\nThe rapid growth marks a shift in the site’s standing, with its numerous forums once seen as arenas for hostile exchanges between largely anonymous users. The UK is a boom market for the platform, with the second largest user base behind the US, according to company records.\nA series of factors are behind its rise. However, a change in Google’s search algorithms last year to prioritise helpful content from discussion forums appears to have been a significant driver.\nA recent deal with Google that allows the company to train its AI model on Reddit’s content also appears to have provided a boost. Reddit is the most-cited source for Google AI overviews, which is likely to see more people directed to its forums. It has a similar deal with OpenAI, which owns the most popular AI chatbot, ChatGPT.\nThe company believes it is also benefiting from shifting internet habits, as younger users seek out human-generated reviews and opinions on issues including parenting, skincare and sports.\nMore than half its UK users are women. Internal company research suggests 71% of women on Reddit in the UK have a personal interest in skincare, beauty and cosmetics, prompting higher traffic for specific UK Reddit forums on those issues, known as subreddits.\n“Reddit started with this perception, rightfully so, for a male skew – gaming and tech as the anchor,” said Jen Wong, Reddit’s chief operating officer, who said she spent a lot of time in the UK gardening subreddit. “Reddit has become very diverse – it is gender-balanced in the UK now … what’s interesting is that one in three are gen Z women on the platform.\n“Gen Z are very open to looking online for advice around these life stage moments, like leaving home and renting for the first time, which happens a little bit later for some of this generation. It’s a very safe place to ask questions about balancing a cheque book, or how to pay for a wedding.”\nUK subreddits on pregnancy and parenting have doubled in size over the last year.\nThere is also a growing trend for supporters of Premier League clubs to watch games while logged on to their team’s subreddit. The Premier League subreddit has grown by more than a billion views in the last year, according to company records.\nIt also appears to be a popular discussion ground for women’s football, which has less dedicated coverage than the men’s game. There has been a doubling of views for subreddits covering Arsenal’s women’s team and the Lionesses in the last year.\nWong said the company was focused on convincing users to come straight to the platform, rather than via a search result. She also touted Reddit as an antidote to AI-generated content.\n“You see these accidents of AI slop and AI advice – Reddit doesn’t have that,” she said. “It’s not clean. It’s messy, in that it has lots of different pieces of advice that you have to sift through. It’s not manicured down to one answer for you, but that’s kind of the point.”\nAmid the rise in prominence of the site, the UK government has launched its own account, UKGovNews, in the last year. It has posted about the cost of living, rail ticket prices and immigration. Steve Reed, the housing secretary, recently held an “ask me anything” session.\nConfrontational exchanges are still easy to find on the platform. Wong said it was part of the site’s culture but that all subreddits had their own rules and moderators.\n“Reddit is really honest and I think that’s one of the things that makes Reddit,” she said. “Every person who joins Reddit is a moderator, because you get to vote up or down on a post – and a down vote is incredibly powerful. ‘Be civil’ is one of the most common rules in communities.”",
  "word_count": 751,
  "scraped_at": "2026-02-14T13:01:53.243634"
}