{
  "article_id": "df91a827cf78",
  "url": "https://www.godisageek.com/2024/09/matchday-champions-is-aiming-to-be-primarily-a-social-activity-hands-off-preview/",
  "title": "Matchday Champions is aiming to be primarily a social activity | Hands - off preview",
  "date": "20240920T154500Z",
  "domain": "godisageek.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Matchday Champions is aiming to be primarily a social activity | Hands-off preview\nMatchday Champions is now out on all popular mobile platforms, and promises to change the way people look at mobile football videogame experiences. But just why should we be playing Matchday Champions? Ahead of it’s launch and to mark the global early access, I was present at a webinar during which the guest speaker was Sebastien de Halleux, a veteran in the tech industry who since 2022 has been part of a new development team at Matchday, a company spread across a staggering 22 countries and all working on this intriguing, brand new casual football mobile game Matchday Champions.\nSebastien began by pointing out that football is a “force”. Five billion fans watched the World Cup in 2022, and 3.5 billion people currently play video games. Therefore, there must be a link, some common ground between the two demographics. That common ground is that football and videogames are fuelled by emotion. Matchday Champions is trying to be a “category defining” experience and aims to cater for an ambitious 5 billion fans, hoping that the dual love football and gaming will entice them to its wares.\nEight time Ballon D’Or winner Lionel Messi and multi time Women’s Ballon D’Or winner Alex Putellas are ambassadors and friends of the game and are both included in Matchday Champions, a deck-building PvP experience as well as a multitude of co-gendered licensed FIFA squads. How exactly is Argentine legend Messi involved? He is an investor and ambassador through his firm called Playtime. He has never invested in anything like this before and says he feels it is a game in line with his values, particularly around accessibility. It promises a “Delightfully crafted” experience with the developers love of football shining through.\nThe Matchday commitment to football authenticity is key. It is a card game, but the developers wanted those cards to be the real deal – so they have tried to get as many actual ballers as they can thanks to the FIFPRO license. The AI-powered game engine enables players to create a “football identity” and build a squad that feels intuitive and a match experience that is based on real world, dynamic stats, as well as a uniquely emotional experience. They want players to own and treasure their cards forever, the same way old timers like me still keep their 1980s Panini sticker albums.\nYou manage a fantasy squad and depending on what packs of cards you receive, choose who goes on your team. You can mix it up between male and female licensed players. The cards evolve over time as you accumulate XP. The statistical engine is based on events in real life including dynamic changes if players are doing well in their actual career, but equally their performance may decline if they are injured. At the moment, a Haaland card is going to be much more valuable than a Solanke one.\nStats are kept simple so as to not seem overwhelming. But there is nice bit of depth that will appeal to those used to playing more complex footy management sims. Like real life teams, cards and their assigned players have to interact together effectively to win. There are traits. For example, if you put five players less than 23 years old in your squad then you get a “Rising Star” trait and there are loads of other traits linked to different combinations to discover.\nYou can play with real life friends and Matchday Champions is seen as primarily a social activity – but even if you are playing a stranger the game is always PvP – and always against a real person. The game mimics the highs and lows of football. The goals scored, the passing moves, and of course conceding goals, and connecting your squad effectively and making choices affects what happens on the “pitch”.\nThe meta game is to lead your club to glory. You can review key moments after each match and XP is distributed to your cards; a star player is identified and as you climb the ladder in your division you get more packs to open and better rewards. You can discover new up and coming players – there is a talent scout function which sounds like it will appeal to Football/Championship Manager old heads. You can also gift player cards to your friends, which is a nice touch for the more benevolent managers out there.\nMatchday Champions is always free to play but there is an in-game store, and events linked to certain times of the football season, even off-screen events on platforms like Discord. You can play for nowt – but like other addicting mobile games it does sound like it will make may people want to cough up some readies.\nThere will be an inaugural Copa Alexia event on Friday 20th September where Alexia Putellas will go head to head with Celine Dept, a popular football influencer. Players will choose one of the two ladies and participate in challenges, with wins counting toward one side or the other. This is a bit like the Global Challenges that happen on Pokemon Go with different teams facing off against each other. Putellas and Debt will be churning out lots of social media activity to encourage players to join up and root for their favourite star. Sebastien sees this as much more than just a mobile game – it is helping to create a bridge between real football and Matchday Champions.\nGlobal early access for Matchday Champions is from 20th September, but there is a lot more to come and many, many new features to come in the coming months.",
  "word_count": 947,
  "scraped_at": "2026-02-14T12:33:16.104607"
}