{
  "article_id": "dfa235a6577c",
  "url": "https://www.irishnews.com/gaa/gpa-report-on-cost-to-players-should-be-taken-with-a-bucket-of-salt-LSNJVJYRV5E2BJBXEXPP57BAKQ/",
  "title": "GPA report on cost to players should be taken with a bucket of salt",
  "date": "20250213T044500Z",
  "domain": "irishnews.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "WHEN Facebook released its annual report in late 2014, its authors Deloitte had magicked up a claim that its “global economic impact” amount to $227bn and that it was responsible “directly and indirectly” for 4.5m jobs worldwide.\nThe report came with a disclaimer. Deloitte had “neither sought to corroborate…nor to review its overall reasonableness” of the information it used, which came directly from Facebook and third-party sources.\nIn other words, the report said what Facebook wanted it to say.\nThere are plentiful examples of similar paid-for advocacy in the world of business.\nThis morning, the Gaelic Players’ Association took its biggest step into the shiny world of big numbers that nobody can question.\nInter-county players, it tells us, contribute €591m in “economic impact”. That figure is labelled in the report as “direct, indirect and induced”.\nWhen Huawei claimed in 2018 that they contributed £1.7bn to the UK economy, the very same report detailed that their direct contribution was £287m.\nThe rest, the indirect and induced bit, they were calculating off things like 15,000 jobs in companies that supplied Huawei or the 9,000 jobs “apparently stimulated by Huawei employees’ spending. In other words, it tots up jobs supposedly created in Frankie & Benny’s and Cineworld as Huawei staff enjoyed themselves in leisure time,” wrote Fraser Nelson in The Spectator.\nThese reports are generally to be taken with a bucket of salt.\nThe GPA have a justifiable claim in the sense that expenses given to inter-county players have not risen anything close to in line with inflation since 2018.\nBut that is where it starts and ends. Whatever sum of money they’ve taken out of their annual budget to pay Indecon to produce a report that has absolutely zero independence and therefore very little credibility was not worth it.\nIf anything, the report’s lack of balance has weakened their argument.\nIt is wilfully difficult in its language.\nTake this excerpt: “Table 2.12 shows that the total level of expenses claimed by inter-county male players in 2023, in terms of mileage and nutrition, was almost €8 million. The level of expenses claimed by the players varies according to a number of factors, including location of training and matches, level of competition, length of season and any injuries that a player might incur. The median level of expenses claimed for mileage was €2,378, while for nutrition it was €580.”\nIt pits a figure of €8m against a figure of €580. Apples, meet oranges.\nWhere the report wants to highlights big sums that it feels strengthen the GPA’s argument, such as how much the GAA has earned in revenue each year, it does so. It takes the biggest number it can find and lines it up against the average of the player who is presented as poor and downtrodden.\nThis report got some attention in the media. The impact is almost certainly a overestimate (typical for this type of report).\n— Edgar Morgenroth (@MorgenrothEdgar) February 12, 2025\nFor example, they assume that the players would spend nothing if they did not attend a match, which is clearly not true. pic.twitter.com/JMKWBSrfgR\nThe report claims a loss of €13m in lifetime earnings for GPA members who weren’t able to obtain a degree qualification because they were playing inter-county GAA.\nYet in another section it notes that 86 per cent of current inter-county players either have a third-level degree or are currently in full-time education, a figure that’s significantly above average.\nAnother claim is that playing inter-county leads to lower incomes, yet for female players from ages 15-29, their incomes are actually above the national average.\nMale players from 15-24 also earn above average, with men from 25-29 earning around €2,000 less (€43,442 v average of €45,316).\nThe morning’s headline figure arising from the report is that the average inter-county player is out of pocket to the tune of £3,835 (€4,602).\nBut despite responses from over 1,300 female players, whose average annual grant is around €900 compared to €1,470 for male players, there is no breakdown of how much more greatly affected they are than male players.\nNone of that is to say either way that players deserve or don’t deserve this, that or the other.\nIt’s just that this 80-page report isn’t the flex the GPA thinks it is.\nHobbies cost money. Playing club football costs money. It lays no golden eggs but in terms of the value of gate receipts from club championship, it is comparatively quite valuable to county boards.\nA good proportion of what a club makes in a year is from the gate at home games.\nThat is not to suggest for a second that club players should be paid. Nobody expects to be.\nThese are things you do of your own free will.\nClub players at every level are taking supplements, eating well, going to the gym, buying three pairs of boots a year, all at their own expense.\nThe GPA are looking at those things as costs to players yet making nothing of the huge benefits for young men and women of being around a setup where your gym is free and you have physio and nutritional advice and access to things they would not otherwise have.\nIf the cost of playing has grown to the point where it becomes unaffordable, do you move towards payment of players and butchering the entire association as a result, or do you look at reducing the demands and therefore the cost?",
  "word_count": 907,
  "scraped_at": "2026-02-14T12:11:05.878685"
}