{
  "article_id": "dfe71d0bf205",
  "url": "https://newsday.co.tt/2025/12/07/pleasantville-power-into-girls-national-intercol-final/",
  "title": "Pleasantville power into girl national intercol final - Trinidad and Tobago Newsday",
  "date": "20251207T101500Z",
  "domain": "newsday.co.tt",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Pleasantville power into girls’ national intercol final\nPLEASANTVILLE Secondary made light work of 2024 champs St Joseph’s Convent Port of Spain (SJCPoS) when they advanced to the national final of the 2025 Secondary Schools Football League’s (SSFL) girls’ intercol competition with a convincing 5-0 victory at the Hasely Crawford Stadium in Mucurapo on December 6.\nThe national intercol semis clash was a grudge match in some respects for Pleasantville, as SJCPoS beat them to last year’s national intercol trophy with a tense penalty shootout victory in the finale.\nThis year, the Brian London-coached Pleasantville team left nothing to chance as reigning SSFL Girls’ Player of the Year Nikita Gosine scored an early first-half brace, before they added three goals in a second-half romp after being put under a sustained spell of pressure by SJCPoS.\nGosine, who represented the TT women’s team in their opening Concacaf W Qualifier against Barbados on December 1, opened the scoring in the second minute before making it 2-0 in the 13th minute.\nPleasantville took a healthy 2-0 lead to the half and appeared to be momentarily out of gas to start the second half, as SJCPoS made raid after raid without much success. The Pleasantville defenders and goalie Akeila Marryshow were kept busy in the early stages of the second period, with two great chances falling to SJCPoS winger Emma Nieves.\nFirst, Nieves led a three-on-one sequence down the right. And with two SJCPoS players free to her left in the penalty box, she opted to shoot but sent a right-footer into the side-netting. Moments later, Nieves got into another favourable position, but had her right-footed shot quickly charged down by Marryshow after being played through on goal.\nIn the 65th minute, SJCPoS were penalised for their inability to make good on their strong second-half start as Kaeley Martin swept into the net from point-blank range to make it 3-0 for Pleasantville after being fed on a platter by some tricky right wing play.\nStill in search of a goal in a bid to keep the game alive, SJCPoS were desperately unlucky when standout player Kaitlyn Darwent shot the ball off the base of the post after evading a couple of tackles on the edge of the area.\nIn the 69th minute, the game was effectively put to bed when Zara Chase, a hat-trick hero from Pleasantville’s zonal final victory over St Joseph’s Convent San Fernando, finished clinically past goalkeeper Alexia Dolland to make it 4-0.\nIn the 77th minute, the girls’ Big 5 holders Pleasantville put the icing on the cake when midfielder Natalia Gosine scored with a beautiful right-footed curler from outside the area, which dipped and swerved before beating Dolland.\nIn the national intercol finale on December 10, Pleasantville will have the chance to regain the crown when they meet east zonal champions Five Rivers Secondary. In their December 6 semi, which was played simultaneously at the Hasely Crawford training field, Five Rivers edged Tobago champions Signal Hill Secondary 1-0 thanks to an eighth-minute goal from national youth team player Hackeemar Goodridge.",
  "word_count": 510,
  "scraped_at": "2026-02-14T12:50:47.805238"
}