{
  "article_id": "dfe76842de52",
  "url": "https://www.eonline.com/news/1409029/sydney-sweeneys-intense-new-role-the-incredible-true-story-of-boxer-christy-martin",
  "title": "Sydney Sweeney New Role : The Incredible Story of Boxer Christy Martin",
  "date": "20241026T124500Z",
  "domain": "eonline.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Sydney Sweeney's latest role packs a heck of a punch.\nThe 27-year-old is going the unrecognizable route to play boxer Christy Martin, the barrier-smashing American pugilist who survived being brutally attacked by her husband, in an upcoming biopic.\n\"Her journey is a testament to resilience, strength, and hope,\" Sweeney posted on Instagram Oct. 16, \"and I'm honored to step into her shoes to share her powerful story with you all.\"\nThe Euphoria actress—who shared a pic showing off her muscular arms—also took a light swing at the \"paps in bushes\" who snapped her on set, thereby letting the cat out of the bag about her training for the as-yet untitled project being directed by David Michôd and costarring Ben Foster.\nAnd the drama is so much more than an against-all-odds sports saga about the first woman boxer to become a celebrity in her own right, while going 49-7-3 with 32 knockouts over the course of her 22-year career.\nThese are the details of Christy's simultaneously harrowing, heartbreaking and inspiring story:\nWho is Christy Martin?\nBorn on June 12, 1968, in West Virginia, Christy Salters didn't shy away from playing with the boys—not least because, growing up in the 1970s in a tiny coal-mining town, there weren't many robust local sports programs for girls.\n\"Itmann was a coal camp,\" Christy told ESPN of her hometown in 2020. \"A tiny little speck of a nothing town. Mountains and hills and everyone you knew, they're either miners or railroaders or teachers. I love West Virginia, I love the people there. But I never for one day thought I was going to stay.\"\nShe played Little League, basketball and football as a kid, then attended Concord University in Athens, W.Va., on a women's basketball scholarship while earning her degree in physical education.\nThe 5-foot-4 powerhouse only climbed into the boxing ring on a dare, when friends challenged her to enter a local Toughwoman contest during her freshman year She won $1,000, but didn't plan on making a career of it.\nWord got around, though, and in 1989 she was approached by a promoter who was looking for an opponent for a more experienced fighter to round out a women's bout in Bristol, Tenn.\nWhen that match ended in a surprising draw, Christy was determined to do better next time and duly won a rematch three weeks later, according to her bio from the Women Boxing Archive Network.\nAfter graduating from college, she moved to Bristol to train professionally in 1991.\n\"She talked about being a coach,\" Christy's mom, Joyce Salter, told ESPN in 2020. \"We never thought she'd end up being a boxer. She did have this Smurfette poster in her room that said 'Girls Can Do Anything!'\"\nAs \"sort of a macho guy\" who \"didn't think women belonged in the fight game,\" trainer James \"Jim\" Martin was unimpressed—and actually downright hostile—when he first spied Christy and Joyce in his Bristol gym.\n\"So I had it all set up to have her ribs broke,\" he admitted to Sports Illustrated in 1996, when his then-wife became the first female boxer to appear on the magazine's cover. \"A couple of ribs, anyway. But the boss shows up, the guy who invited her out to the gym, so I thought I'd put that off for a couple of days. How would it look if I had her ribs broke right away?\"\nThrown off his plan by the persistent presence of the boss, Jim said, he soon realized Christy—who's 25 years his junior—was a better listener than most of his fighters. Plus, she was tough, seemingly fearless, a quick study and skilled beyond her training level, so much so that Jim recalled thinking to himself, \"Maybe this woman can make me some money.\"\nBut before Jim changed his mind, Christy recalled to ESPN, \"He hated me. I walked out. My mom encouraged me to go back and let him train me.\"\nThey married at City Hall in Daytona Beach, Fla., in 1992 and settled in Orlando.\nLooking back on what brought them together romantically, Christy told the New York Times in 2011, \"I think it was just I was young, it was just a time in my life. I don’t know what the attraction was, especially now. It’s hard to say.\"\nBilled as \"The Coal Miner's Daughter,\" Christy was winning but not making much money. Her profile—and purse— grew after she persuaded legendary boxing promoter Don King to sign her after he caught one of her fights.\nHer breakthrough to another tier of celebrity came in March 1996, when she fought on the undercard of a Mike Tyson bout on pay-per-view. She was paid $15,000 to Iron Mike's $30 million, per Sports Illustrated, but the visibility propelled her next purse to $75,000.\nAnd yet the boxer known for her all-pink ensembles in the ring wasn't interested in using her growing platform to advocate for fellow female athletes, telling SI after her PPV bout she \"would never\" fight on an all-woman card, either.\n\"I'm not out to make a statement about women in boxing, or even women in sports,\" Christy, then 27, told the publication. \"I'm not trying to put women in the forefront, and I don't even think this fascination [with me] has much to do with that. This is about Christy Martin.\"\nWhat happened when Christy Martin married Jim Martin?\nIn hindsight, \"I wasn't very worldly,\" Christy told ESPN in 2020. \"I believed in people, believed a lot of bulls--t.\"\nJim made sure she fought with a chip on her shoulder, she explained, keeping her isolated from friends and family and telling her everyone was out to get her—except him. He criticized her appearance and made her weigh herself multiple times a day. He belittled her intellgence.\n\"Jim would say, 'Everybody hates you, you are out here alone,'\" Christy said. \"He made me feel it's me against the world...It was evil, but it wasn't altogether a lie. It was me against the world in a lot of ways.\"\nAnd while her per-fight fee climbed as high as $350,000 (en route to $4.5 million in career earnings), Jim helped himself, buying expensive clothes, jewelry and cars. According to details shared by the prosecution during his 2012 criminal trial, Jim was secretly recording her phone calls, reading her messages, and filming her in the house, including in the bathroom and bedroom. He threatened to send embarrassing footage to her parents and people who could influence her career.\n\"Jim controlled every aspect of Christy's life,\" Florida state attorney Deborah Barra, who prosecuted Jim for attacking his wife, told ESPN. \"He was vindictive. He told her nobody would love her but him. She believed she owed him everything.\"\nMoreover, Christy told ESPN, \"For 20 years, he told me he was going to kill me if I ever left him. At first, I didn't think he was serious. But then time went on. And I realized.\"\nAll the while, she kept fighting, becoming increasingly famous—appearing on numerous talk shows, making a cameo on Roseanne—as she racked up victories.\nAs she cracked to SI in 2016, \"I felt threatened from the day of the marriage. I'd never been knocked out except by Jim.\"\nBut her dominance started to wan in 2003, when she was knocked out for the first time by Laila Ali, after which four more of her career losses came in the next three years.\nAfter eking out a victory over Dakota Stone in September 2009, Christy retreated from the circuit, spending time closer to home in Apopka, Fla., working with young boxers at a nearby gym and caring for her husband, who underwent open-heart surgery in early 2010 and spent two weeks in a coma, according to the NY Times.\nTheir marriage \"had been over for a very long time,\" she told the NY Times in 2011. \"But I’m a human being, a very compassionate human being, I think you can love somebody but not be in love with them.\"\nAnd Jim \"was still my trainer,\" she said. “We still lived in the same house like we had been, but it really wasn’t a marriage. I did what I thought was the right thing for me to do as a person. And I thought that maybe when he woke up that maybe things would change.\"\nBut it was ultimately Christy who decided it was time for a change. She had reconnected with her high school girlfriend online (she told ESPN their romance back then was a secret she kept from her entire family), and in November 2010 she told Jim she was leaving him, according to court documents reviewed by the NY Times.\nWhat did Jim Martin do to wife Christy Martin?\nOn Nov. 23, 2010, Christy told her longtime hairdresser that her marriage was over. She said they had agreed to keep living together until her next fight, then split the purse and separate.\n\"Christy looked really good and happy and peaceful,\" salon owner Deana Gross testified during Jim's trial, per ESPN. \"When she left, she was walking away and she told us that she loved us.\"\nWhat Christy was doing was saying goodbye, the athlete told ESPN, recalling how that was her plan but she knew all too well that Jim might not let her go.\nShortly after 5:30 p.m. that night, as Christy later testified during Jim's trial, she was in their bedroom putting on her shoes to go for a run when Jim, hands behind his back, said he had something to show her.\nHe proceeded to stab her four times in the torso and wound her in the leg, according to the police report prosecutors read from at trial. She fought back but, during the struggle, she realized that he had the pink 9-millimeter Glock she usually kept hidden under the mattress in his pocket. After getting the upper hand again, Jim shot Christy in the chest. She reached for the phone, Christy said, but Jim had unplugged it.\nThen, she detailed on the stand, Jim went into the bathroom and she heard the shower running. She said she managed to make it out the front door and into the street, where she flagged down a passing car and the obliging motorist drove her to the emergency room.\nThe reigning World Boxing Council female super-welterweight champion was hospitalized for 10 days. \"She had tubes running everywhere, stitches all over her head, on her face,\" mom Joyce told ESPN. \"It's something you never forget.\"\nShe recalled the first thing her daughter told her when she was finally able to speak again: \"I told you he was crazy, Mom.\"\nPolice arrested Jim a week later after finding him hiding in a neighbor's shed, authorities said at the time.\nAnd the first place Christy went after being discharged from the hospital was the gym. It was \"where I felt safe,\" she told TODAY in 2019, \"so that's where I went back to.\"\nAnd barely two months after the attack, Christy announced at a Jan. 19, 2011, press conference in Manhattan that she planned to fight again that March.\n“I've been through a lot in the last few weeks that I’m sure most of you know about,\" the 42-year-old said. \"But God’s given me the opportunity to start again. I just want to say this life gives us all hurdles. Life gave me some lemons and I have definitely made pink lemonade.\"\nAs for why she wanted to get back in the ring right away after being so badly hurt, she told the New York Times, \"I'm in the hurt business.\"\nWhat happened at Jim Martin's trial on attempted murder charges?\nJim pleaded not guilty to charges of attempted first-degree murder, attempted manslaughter and aggravated battery. During his bail hearing, his attorneys told the judge he was \"a frail 67-year-old man with a heart condition and diabetes\" and no evidence could say for sure \"who’s the aggressor, who's acting in self-defense.\"\nTaking the stand during his 2012 trial, Jim denied stabbing Christy and maintained the gun misfired as they struggled.\n\"It's my truth,\" he said under cross-examination. \"We were together 24/7. Nobody stays with anybody 24/7 unless they love each other.\"\nJim's attorney Bill Hancock alleged at trial that Christy attacked the defendant because he'd started telling people in the boxing world that she was leaving him for a woman.\n\"Some people received compromising photographs of Mrs. Martin,\" the defense lawyer said in court, per NBC affiliate WESH. \"At that point in time Christy Martin felt threatened, her life felt threatened and her career felt threatened.\"\nChristy testified for three hours, detailing the physical and psychological abuse her husband allegedly inflicted on her over the 20 years they were together, as well as the harrowing events of the night she almost died. After she stepped down from the witness stand, she reportedly approached the defense table, put her face close to Jim's and said, \"I hope you rot in hell, you motherf---er.\"\nConsider the prosecution gobsmacked. \"In 115 trials I've done,\" state attorney Deborah Barra told ESPN, \"the victim has never done that. Everybody was stunned.\"\nJim was convicted in April 2012 of attempted second-degree murder and sentenced to the mandatory minimum of 25 years in prison.\nAddressing the court during his June sentencing, he said, \"I guess I made a mistake by not entering a plea of self-defense.\"\nWhere is Jim Martin now?\nJim, 77, is serving his sentence at Graceville Correctional Facility in Jackson County, according to the Florida Department of Corrections. He's due to be released Nov. 22, 2035.\nIn a 2023 episode of the Netflix docuseries Untold: Deal With the Devil, Jim maintained he was just trying to defend himself from Christy on the night in question.\n\"I wasn't even trying to hurt her,\" he said in the series. “When they announced my sentence, I didn’t flinch. It says in the paper I didn’t flinch. I wasn’t going to show any weakness. She’s the worst thing that ever happened in my life, if you would look at where I'm at. But I lived a pretty good life. I was happy.\"\nWhere is Christy Martin now?\nChristy's comeback fight, postponed to June 2011, ended after she broke her hand in the fourth round and couldn't continue.\nAfter she retired from the sport, she taught school and launched Christy Martin Promotions. She remains a regular on the fighting circuit, as well as advocates for abuse survivors through her foundation Christy's Champs.\nShe was the first woman inducted into the Nevada Boxing Hall of Fame in 2016, and was among the inaugural group of women inducted into the International Boxing Hall of Fame in 2020 (albeit in a pandemic-delayed ceremony in 2021), the first year the ballot was opened to women.\nStill, Christy just saw herself as a boxer, period.\n\"When people left [my fights], I wanted them to say, 'Wow, that was a good fight!'\" she told ESPN in 2020. \"Not 'That was a good woman's fight.' I didn't want to be a good woman fighter. I wanted to be the best.\"\nShe also started going by Salters again, though she acknowledged Martin was the name everyone knew.\n\"The name thing is touchy because Jim would always tell me, 'I don't care what happens, you can divorce me, you can leave, whatever. You'll always be Christy Martin,'\" she said on TODAY in 2019. And he was right, in a way, she noted, because \"Christy Martin is the boxer that made the name. But I made the name. He didn't.\"\nOn the personal front, Christy has been married to former boxer Lisa Holewyne since 2017. While they had a whirlwind courtship, they've known each other since 2001, when Christy bested Lisa in the undercard for the heavyweight bout between Hasim Rahmanand and Lennox Lewis.\n\"She boxed circles around me,\" Lisa recalled to ESPN. \"It was aggravating.\"\nRegarding her sexuality, \"I've been hiding who I truly am since I was 12,\" Christy reflected. Afraid of being rejected by her parents—and, she said, assured by Jim that they would—\"I didn't really have a choice.\"\nAs for her ex-husband, \"I wish I wouldn't have ever met him,\" Christy said. \"But then I would never have been the boxer I am.\"\nMeanwhile, count her among the fans who's excited to see what Sydney Sweeney does with the role of Christy Martin.\n\"I think she is young, hot, talented and about to make a movie that in 20-plus years, fathers will watch with their daughters to make them aware of domestic violence,\" Christy told TMZ in May.\nAnd when Sydney shared the fruits of her training labor earlier this month on Instagram, Christy reposted with a caption saying she was \"beyond excited and grateful\" to have the actress bring her story to life, \"the battles I faced both inside and outside the ring.\"\nChristy continued, \"Her talent, passion, and dedication to her craft are unmatched, and I couldn’t ask for a more amazing artist to portray me. It’s incredible to see how she embodies not just the fighter in me, but the woman who overcame it all. Sydney, thank you for diving deep into my journey—can’t wait for the world to see this.\"",
  "word_count": 2870,
  "scraped_at": "2026-02-14T12:10:34.177970"
}