{
  "article_id": "dfea10a38d9a",
  "url": "https://pqbnews.com/2026/01/21/pqb-news-year-in-review-september-to-december-2025/",
  "title": "PQB News Year in Review : September to December 2025 | Parksville Qualicum News",
  "date": "20260123T020000Z",
  "domain": "pqbnews.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "PQB News Year in Review: September to December 2025\nPublished 10:00 pm Wednesday, January 21, 2026\nA look back at some of the major stories and issues in the PQB News from September to December of 2025. Visit www.pqbnews.com for expanded year-in-review coverage.\nSept. 3\nNew task force forms\nA new Oceanside Homelessness Task Force has been formed after a similarly named task force was disbanded in May.\nShayla Day is the new chair of the task force, as well as an outreach worker with Island Crisis Care Society and founder of DayHomes Society. Day told the PQB News most of the board members have agreed to come back and the task force will meet the first Friday of each month to work on goals for housing and homelessness in the community.\nNorth Island Wildlife Recovery Centre officially opens bear pavilion\nCentre has officially opened its new bear pavilion, an educational building that features black bears, with a focus on old-growth forests.\nA ribbon-cutting ceremony was held to mark the opening of the new building, which cost approximately $200,000.\nThe honour was given to Peter Karsten, who has dedicated his life to conservation work and artistic endeavours.\nSept. 10\nPublic will have its say\nParksville residents will have a chance to let council know how they feel about a proposed development which will include a large grocery store on Resort Drive.\nCouncil voted to schedule a public hearing on the question of a mixed commercial residential development at 1180 Resort Dr., adjacent to the Island Highway.\nPrimex Investments is seeking an amendment to allow the subdivision of a large parcel of land and is requesting the density be calculated based on the total area of the entire site, rather than the area of land within the parcel.\nRDN plans $30M purchase of Hamilton Marsh\nThe Regional District of Nanaimo and Mosaic Forest Management have signed a conditional contract of purchase and sale for approximately 360 hectares of land known as Hamilton Marsh.\nAn offer of $30 million was accepted. The sale is anticipated to be completed by March 31, 2026 if all conditions of the purchase and sale contract are met. To acquire the lands as regional parkland and conservation area, the RDN needs to secure a minimum of $7.5 million.\nNanoose Bay golfer wins national championship\nThe local favourite ended up as the big winner at a national championship golf tournament in Nanaimo this week.\nNanoose Bay’s Shelly Stouffer won the Golf Canada women’s senior championship, held Tuesday through Thursday, Aug. 26-28, at the Nanaimo Golf Club.\n“It’s awesome to win the Canadian Women’s Senior Championship,” said Stouffer in a Golf Canada press release. “It’s been a couple years since I’ve been out of it but I’m happy to be back in the winners circle.”\nSept. 24\nPickleball proposal\nQualicum Beach council is considering converting the third tennis court on Veteran’s Way into four pickleball courts.\nCoun. Anne Skipsey informed council, at its regular meeting on Sept. 17, the cost to construct new pickleball courts adjacent to the Qualicum Beach Skatepark would be double the original estimate of $170,000 first quoted in 2024. They will face an estimated cost of $351,000 or more down the road.\nCouncil has already allocated $87,000 to build the courts with the condition the Qualicum Beach Pickleball Club would raise a matching amount before the project could be proceed.\n2 scams result in combined $220K lost to PQB residents\nOceanside RCMP are asking people to be cautious when it comes to unsolicited phone calls or advertisements for cryptocurrency.\nTwo PQB residents recently lost a combined $220,000 after being snared in a pair of scams such as these, according to police.\nThe first incident started with an unsolicited phone call from someone purporting to work for a phone provider, and ended with a resident being defrauded of more than $132,000.\n‘Charlie’ tops list of popular dog names in Parksville, Qualicum Beach\nIt’s no secret that people love their dogs in the Parksville Qualicum Beach area, and they also love to name their canine companions Charlie, which topped the lists of both Parksville and Qualicum Beach.\nThere are 17 dogs registered with that name in Parksville and 12 in Qualicum Beach, according to information provided by the two municipalities.\nQualicum Beach hip-hop and pop artist ready for fall tour\nQualicum Beach’s Martin Rupprecht is getting ready for his first-ever tour, which will seem him join Jamie Fine for three shows this October.\nThe hip-hop and pop artist, whose stage name is Amarii, will open for four-time Juno nominee Fine at dates in Edmonton, Calgary and Vancouver.\nOct. 1\nPool plan redesigned\nThe Regional District of Nanaimo has come up with a new design for the Ravensong Aquatic Centre Expansion project, which they hope will be eligible for a $7-million federal grant awarded to the project earlier this year.\nFaulknerBrowns Architects, with the help of RDN staff, revised the scope of the project that Manager of Recreation Service Graeme Donn presented to the Oceanside Services Committee on Sept. 18.\nCommunity celebrates new all-season track in Parksville\nThe new Oceanside Community track held its first event, a Jurassic race that featured runners dressed in T-Rex costumes.\nIt was one of the fun events featured in the Celebration Day on Saturday, Sept. 20, aimed at thanking a host of people, local governments, businesses, organizations and athletes, who all played a part in making the all-season rubberized six-lane track at Ballenas Secondary School a reality.\nParksville swimmer Bennett earns bronze at World Para Swimming Championships\nParksville’s Nicholas Bennett kicked off his World Para Swimming Championships campaign with a bronze medal win in the\nmen’s 200-metre freestyle S14 in Singapore.\nIt was Bennett’s sixth medal (three goal, two silver and a bronze) in three career appearances at worlds.\nOct. 8\n$2.125M donation\nThe Town of Qualicum Beach has signed a conditional donation agreement with a private donor that could contribute 25 per cent of the purchase price for the Eaglecrest Golf Course lands, up to $2.125 million.\nAccording to a press release, if the acquisition proceeds, the donation will be received in late 2025 and directed to the purchase of the golf course with the requirement for long-term preservation of approximately 40 acres of parkland.\nTour de Rock rolls through PQB\nThe Tour de Rock passed through Parksville and Qualicum Beach on Sept. 25 as they raise thousands in support of childhood cancer research and support services at the Canadian Cancer Society.\nThe team stopped at First Credit Union in Bowser before heading on to Glassford Square, the Village Eatery, Kwalikum Secondary School and Arrowview Elementary School in Qualicum Beach. From there they cycled to Parksville stops at Thrifty Foods, where $660 was donated and Berwick Parksville, who pitched in $1,838.\nButterfly World in Coombs up for sale for $2.25M\nThe popular Butterfly World in Coombs is up for sale.\nThe tourist attraction, located at on Highway 4A in Coombs, has been listed for sale on Unique Properties and Colliers Canada, priced at $2.25 million.\nButterfly World has more than 50,000 visitors every year. It operates seasonally from mid-March to October.\nOct. 15\nPQB News picks up 3 national awards\nThe PQB News has picked up some national honours.\nNews Media Canada recently announced the winners of this year’s Canadian Community Newspaper Awards, recognizing work published during 2024. The PQB News was named as having the best front page in the nation in its circulation class.\nLongtime photographer Michael Briones earned a pair of honours. Briones picked up a third-place showing in the Best News Feature Photo category, for his shot as the North Island Wildlife Recovery Centre released a year-old bald eagle back into the wild after nursing it to health.\nParksville fire chief honoured for 35 years of service\nParksville fire chief Marc Norris received the 35-year long service award on behalf of the Office of the Fire Commissioner of British Columbia and the 35-year Provincial Long Service Bar, in recognition of his outstanding commitment to fire safety in the community.\nParksville Career Centre celebrates opening of facility\nThe Career Centre, an initiative of the Central Vancouver Island Job Opportunities Building Society, opened its new, fully accessible location at No. 3-187 Bagshaw St. in Parksville on Sept. 25.\nThe space, located within the WestWave Building, represents a major milestone in the centre’s ongoing commitment to creating inclusive and welcoming environments for all, according to a news release by the Career Centre.\nThe new location features barrier-free entrances and interior doors, multiple meeting rooms and restrooms, dimmable automated LED lighting and sensory-friendly workspaces equipped with assistive technologies.\nOct. 22\nHome near Bowser destroyed by fire after vehicle crash\nOne person was arrested after a vehicle was driven into a home in the Nile Creek area south of Bowser on Oct. 13.\nWhile Oceanside RCMP were en route to the scene, police were updated that the home was “engulfed in flames,”\naccording to Const. Tim Kenning.\nParksville council approves temporary shower use for unhoused\nParksville council has approved temporary use of the shower facilities at Orca Place during the Christmas season for unhoused people living in the area, while the Society of Organized Services shower program is closed for the holiday season.\nQualicum Beach to expand noise-sensitive areas to mitigate noise from airport\nThe Town of Qualicum Beach has been looking for ways to address the concerns of residents regarding noise coming from the Qualicum Beach Airport.\nThe town has received numerous complaints, citing a variety of sources that include flight training circuits, helicopter training and flight paths. A petition with 89 signatures was presented to the town calling for council to restrict aircraft circuit over residential areas, prohibit helicopter training over residential areas and to charge landing fees like other provincial municipal airports.\nOct. 29\nQualicum Beach denies zoning for health care facilty project\nQualicum Beach council has rejected a zoning and official community plan amendment application to allow a health care\nfacility to be built on a property in College Inn Road.\nCouncil voted 3-2 to deny the application during its regular meeting on Oct. 22.\nThe proponents of the project wanted to build a 125-bed, longterm care facility that includes assisted living and memory care.\nThe property, located at 431 College Rd., is currently zoned Residential 12 and is designated in the OCP for multi-family residential.\nCost and housing 2 most common reasons for Parksville pet surrenders\nParksville-Qualicum Beach BC SPCA took in and cared for 43 stray and surrendered animals from within the Parksville city\nlimits in 2024.\nOf those, 25 were stray and the rest were surrendered, according to a presentation by Janelle Hill, centre manager, who spoke to Parksville council on Oct. 6.\nOceanside senior athletes shine at BC 55+ Games\nAthletes in the Parksville Qualicum Beach area turned in some outstanding results at the 2025 BC Senior Games in Nanaimo.\nThe five-day event drew close to 3,000 competitors that included those from District 69, who represented Vancouver Island North Zone 2 region and helped the zone finished first overall with a total of 421 medals (193 gold, 145 silver and 83 bronze).\nTwo District 69 athletes made a big splash in the swimming competition. They were two of the most senior members of Zone 2, Harry Keen of Nanoose Bay and Linda McPherson of Qualicum Beach. They each took home six glittering gold\nmedals.\nNov. 5\nParents concerned\nParents in the Qualicum School District are looking for answers after finding out the program lead in the area’s Integrated Child and Youth team was terminated. The provincially funded ICY teams are an initiative designed to connect children, youth and families to mental health and addiction services. The District Parent Advisory Council (DPAC) wrote a letter which expresses its “surprise and disappointment” to Minister of Health Josie Osborne and Kathy MacNeil, president and CEO Island Health.\nQualicum Beach completes purchase of Eaglecrest Golf Course lands\nThe Town of Qualicum Beach now owns the Eaglecrest Golf Course lands. Following community engagement and detailed review, council finalized the purchase of the property that was valued at $8.5 million.\n“This is a once-in-a-lifetime opportunity for our community,” said Mayor Teunis Westbroek.\nGolden Sand Dollars fundraiser raises $5.1K for Hands & Hearts Food Program\nThe winners have cashed in their golden tickets. The inaugural PQB News Golden Sand Dollars fundraiser proved a big success, with all proceeds (more than $5,100) going to the Hands & Hearts Food Program, a local non-profit, formerly SD69 Backpack Program. The program offers children at risk of hunger a bag of food that is child-friendly, nutritious and non-perishable. The PQB News worked with Coombs Country Candy, Fireside Books and other generous business sponsors in the community to launch the fundraiser. Coombs Country Candy created 1,000 handmade chocolate sand dollar-shaped bars wrapped in gold foil. Inside three of the bars was a golden ticket. Each of those three tickets represents a prize valued at $500.\nNov. 12\nSale of the commons\nQualicum School District will ask for approval from the province to sell the Craig Street Commons building, which is planned to close on Jan. 1.\nThe Board of Education voted unanimously both to confirm the property will not be required for future educational purposes, and to seek approval from the Ministry of Infrastructure to proceed with the disposition of the land.\nWhalers fall\nBallenas Whalers suffered a heartbreaking 7-6 loss to the John Barsby Bulldogs in the 2025 ‘Border Battle’.\nThe senior varsity game, played under wet and muddy conditions at Kwalikum Secondary field on Oct. 31, was also the final BC High School Football League regular season game.\nNov. 19\nE-bike and scooter rental pilot project approved for Parksville\nElectric bike and e-scooter rentals will roll out in Parksville this coming spring.\nCouncil approved a three-year pilot project that will allow City of Parksville property to be used for parking and renting the vehicles, after a presentation by David Holzer, business development manager for BCAA’s Evolve E-Bike and E-Scooter Share Program.\nHolzer said the plan is to start with 50 to 70 “devices”, bikes and scooters, at 13 parking zones spread around Parksville. The vehicle trips, started with the use of an app, can only start and end in designated zones.\nQualicum Beach grad off to COP30 conference in Brazil\nKwalikum Secondary School grad Elena Sales is attending the COP30 UN Climate Change Conference in Brazil and will run a side event that helps people understand the language used in the proceedings. Sales recently attended a COP simulation at the British University of Egypt in Cairo, where she represented Canada as its head of delegation, put forward its positions throughout the negotiations and helped shape the final declaration.\n“We negotiated over it, and spent 14 hours in these rooms one day,” said Sales, a fourth-year mechanical engineering student at McGill University. “We were there until like midnight coming up with all the fine print, fixing all the brackets. And then the very end, we presented some of the key outcomes.”\nFive Ballenas Whalers named as Island Division Football All-Stars\nFive Ballenas Whalers senior varsity players were named to the B.C. Secondary Schools Football Island Division All-Star\nteam.\nOffensive linemen Draeden Jones and Matt Crowie, receiver Riley Wilson, linebacker Bennet Switzer and defensive back\nMalcolm Williams were recognized for their performance during the regular season, assisting the Whalers to advance to\nthe quarterfinals of the provincial playoffs.\nNov. 26\n$160,000 deficit for ASAR\nArrowsmith Search and Rescue is facing a $160,000 deficit in its budget and has sought help from the Regional District of Nanaimo.\nIn order to continue operating at high level, they need to cover this gap, said ASAR president Nick Rivers, who appeared as a delegation at the RDN regular board meeting on Nov. 18.\nThe ASAR and the RDN has a funding agreement in place set to expire next year.\nRegional District of Nanaimo to take away $50K grant for INfilm\nThe Vancouver Island Film Commission, known as INfilm, will no longer get any funding support from the Regional District of Nanaimo this year.\nThe RDN board voted to remove the $50,000 grant allocation to INfilm from its 2026-2030 financial plan and instead plans to redirect the funds to the Arrowsmith Search and Rescue.\nFill the Boots a big success\nParksville Fire Rescue’s Fill the Boots for Food drive was once again a huge success because of the community’s generosity.\nA total of $98,714.56 in cash for the Salvation Army food bank was collected over the weekend along with more than 60 new unwrapped toys for the Society of Organized Services, according to a news release by the fire department.\nCraig Bay residents continued their generosity this year, donating 2,941 pounds of food and grocery items to fill food bank shelves and a record $76,510 in cash donations to help keep the shelves filled in the coming months.\nCeltic Chaos plan 25th anniversary show in Qualicum Beach\nCeltic Chaos will celebrate 25 years of musical performance with a show in Qualicum Beach on Nov. 30. The afternoon ceilidh dance at Rotary Hall happens to fall St. Andrew’s Day, the patron saint of Scotland.\nAt first, Celtic Chaos was an instrumental group, according to fiddler Joyce Beaton, but over time the band evolved and added vocals.\nDec. 3\nDuelling petitions\nThe Town of Qualicum Beach received a petition calling for the protection of the Qualicum Beach Airport against residents complaining about the noise.\nA correspondence from a resident living near the airport was presented at town council’s special meeting on Nov. 26 that included a petition representing almost 3,000 signatures. This opposes the petition received by the town a few months ago, from nearly 90 residents who raised concerns about the noise coming from the airport, calling to restrict flights over residential areas, prohibit helicopter training and to change landing fees.\nTigh-Na-Mara Toy Drive raises a record $36K\nThe 17th Tigh-Na-Mara Toy Drive was a huge success and raised $36,307.55 as well as more than 3,000 toys and gifts on Nov. 26 in Parksville.\nThe community showed its support for the SOS Christmas program with $26,037 in cash and cheques; $8,870 in gift cards, 3,072 toys and gifts, as well as a $1,500 grant from RBC. The fundraising event smashed the previous year’s record of $30,320, which was itself a record.\nWhalers clip Kondors 75-57 in North Island hoops matchup\nHigh school basketball season has begun.\nThe Ballenas Whalers and Kwalikum Kondors senior boys teams opened their 2025-26 North Vancouver Island League with their annual derby. The clash, hosted by Kwalikum, was their first league game of the season and it drew quite a crowd.\nIt was the Whalers who settled down first as they got their inside game going, using their big power forwards to score, while the Kondors tried to get their transition game going. In the end, the Whalers came away with a 75-57 decision.\nQualicum Beach One Act Play Festival a ‘dramatic success’\nTheatre lovers were treated to some exceptional performances at the 2025 Vancouver Island One Act Play Festival, an annual competitive event hosted by ECHO Players at the Village Theatre in Qualicum Beach from Nov. 5 to Nov. 9.\nThis year’s eight entries played to several sold-out audiences, with theatre groups from as far as Campbell River and Yellow Point competing for the top awards.\nDec. 10\nNew medical clinic in 2026\nThe Mid Island Health Alliance is set to open the Primrose Medical Centre in September 2026.\nAfter a year of planning, collaboration and recruitment, four physicians have now been secured to launch the clinic, with space for two to five more to join, marking a major milestone in addressing the critical shortage of primary care providers in\nthe region, according to a news release by MIHA.\nParksville mourns the loss of community leader Duane Round\nThe Parksville community is mourning the passing of Duane Round, who died on Nov. 15 at age 66.\nRound was the president of the Parksville Community Centre Society, in addition to service with the Lions Club and many others over the years.\n“A lifelong advocate for community service, Duane left a profound legacy of dedication to inclusion, affordable housing and local development in the Oceanside region,” stated a news release from the PCCS.\nBenchmark home price above $920K\nThe benchmark price for a single-family home in Parksville Qualicum Beach is up five per cent over the same period in 2024, sitting at $920,800.\nAccording to the latest numbers released by the Vancouver Island Real Estate Board, last month, the benchmark price in the PQB area was $920,700.\nDec. 17\nHilliers residents upset with noise coming from chipping mill operations\nResidents in the Hilliers area are upset about what they deem excessive noise coming from a wood chipping operation.\nThey raised their displeasure with the noise pollution at an Electoral Areas Services Committee meeting on Dec. 4.\nTroy Hansen said the problem started when the mill owner started a chipping operation last August. The noise, he said, caught residents by surprise.\nAirline opposes proposed fee hikes at Qualicum Beach Airport\nThe Town of Qualicum Beach plans to increase airport fees starting in 2026 and has met strong opposition from the primary airline that provides scheduled flights to Vancouver Airport and back.\nTown council are close to amending a bylaw that will see all rates at the Qualicum Beach Airport go up and projected to provide the town a three per cent revenue.\nGens part of VIJHL all-star festitivites\nThe Oceanside Generals will be well-represented at the Vancouver Island Junior Hockey League All-Star and Prospect games.\nThe event will be held on Jan. 16 and Jan. 17 in Spruce Grove, Alta., in conjunction with the BC Hockey League All-Star Weekend.\nThe Generals, who lead the North Division, will have seven participants. Players who will see action in the All-Star game with the North Division team are goalie Ethan Suhr, defencemen Braeyen Newans and Levi Green and forward Kaiden Day.\nSuhr and Newans were also included in the North Division Prospects game along with forward Ryder Bradford, Braylon Becker and Jacob Leamy.\nGenerals head coach Garrett Dunlop will be the bench boss of the North Division side.\nWhat’s in a name?\nTwo major Parksville roads could be due for a name change, with council mulling options for the renaming of both Alberni Highway and Highway 19A, within the city’s limits.\nThe changes would see Ocean Boulevard replace Highway 19A and Mountainview Boulevard replace the Alberni Highway, but for now council is only asking for a staff report due in mid-2026.\n“Basically we’re taking the name ‘highway’ out of our roads, our two main roads in the City of Parksville,” said Mayor Doug O’Brien, who brought up the motion on Dec. 15.\nBallenas Whalers senior girls win 3 of first 4\nThe Ballenas Whalers senior girls basketball team is off to good start.\nThey won their first three league games before losing to the Wellington Wildcats 81-48 on Dec. 16. Meelah Mentlen led the Whalers offence, scoring 24 points, with Angela Riocio netting 22.\nDec. 31\nWinter arrives with no shelter\nUnhoused people in the Parksville Qualicum Beach are looking at another cold, wet winter season without an overnight shelter.\nMany of the area’s unhoused are working people who simply cannot afford market rent, according to Shayla Day, chair of the Oceanside Homelessness Task Force, who hopes to change the assumptions that often accompany the conversation around shelters.\nQualicum Beach officially seals $8.5M purchase of Eaglecrest Golf Course lands\nThe Town of Qualicum Beach is now the official owner of the Eaglecrest Golf Course lands after finalizing the purchase of the 42.5-hectare (105 acres) property.\nThe $8.5-million purchase price was financed in part by a $2.125-million contribution from the Christopher Foundation, ensuring approximately 40 per cent of the property, some 40 acres, will be preserved as forested parkland with walking trails and habitat restoration.\nThe nine-hole golf course will continue to operate, with the town engaging a short-term contractor to maintain the course, park areas and general grounds until a permanent operator can be secured.\nBallenas Whalers senior girls volleyball shines at provincials\nThe Ballenas Whalers senior girls volleyball team capped off an incredible season with a strong showing at the AAA provincial championships in Vernon.\nThe team finished second in their pool before advancing to the crossover matches, ultimately securing 12th place in the province.",
  "word_count": 4073,
  "scraped_at": "2026-02-14T14:22:10.734361"
}