{
  "article_id": "e008bea9ded8",
  "url": "https://www.nzherald.co.nz/lifestyle/society-insider-all-black-damian-mckenzie-buys-35m-waikato-home-jodie-dick-and-olivia-carter-celebrate-milestone-birthdays-auckland-fcs-new-hospitality-plans/TAEZUNSLUVGDDEZNNRPR7JPSFY/",
  "title": "Society Insider : All Black Damian McKenzie buys $3 . 5m Waikato home ; Jodie Dick and Olivia Carter celebrate milestone birthdays ; Auckland FC new hospitality plans",
  "date": "20250806T173000Z",
  "domain": "nzherald.co.nz",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Man about town Ricardo Simich brings you Society Insider. This week, Damian McKenzie has bought a $3.5 million home with his parents; Jodie Dick and Olivia Carter celebrated milestone birthdays with glamorous parties; Auckland FC and Foley Hospitality execs are working on new benefits for football fans.\nSociety Insider: All Black Damian McKenzie buys $3.5m Waikato home; Jodie Dick and Olivia Carter celebrate milestone birthdays; Auckland FC’s new hospitality plans\nSubscribe to listen\nIn April, the Chiefs’ player purchased the property south of Hamilton. He is understood to have officially taken ownership in May, with O’Sullivan believed to have moved into the house in June.\nO’Sullivan’s parents, Waikato-based legendary jockey Lance, and wife Bridgette, have already visited with a housewarming gift, with Bridgette also popping over last week to help with gardening. Luckily, McKenzie and O’Sullivan’s new home is just a 40-minute drive north from O’Sullivan’s parents’ sprawling 200ha dairy farm and estate, Rockspring in Piarere, between Cambridge and Matamata. Lance’s Wexford Stables is based in Matamata.\nThe home has won numerous awards for its architecture, which draws on Japanese influences. During McKenzie’s stint playing for the Tokyo Sungoliath team during the 2022 season, he seems to have formed an affinity with Japanese culture and architecture.\nThe house is owned in an equal third split between McKenzie and his parents, Moana and Brent. The trio also own two houses in Wānaka with the same investment structure. The first property was purchased in 2018 for $1.1m, and the family paid just under $1m for the second in 2019.\nSitting on an expansive section, the property is surrounded by beautiful oak, elm, and ash trees, while boundary hedges offer plenty of privacy for the couple.\nThe home is made up of three interconnected cedar-covered buildings, with an internal courtyard, and has a footprint of about 440sqm. It features open-plan living, spacious dining and living areas, including a 1970s-style sunken lounge, as well as a home office, a children’s lounge, and state-of-the-art bathrooms.\nThe main house looks out on a Palm Springs-style pool, which flows onto an elegant outdoor dining area.\nAnd for visitors, there is a 93sqm cabin - described as an architectural retreat – a short walk away.\nWhile McKenzie was raised on a more than 400ha dairy farm near Waikaka, close to Gore, O’Sullivan is a Waikato local. She grew up on her parents’ estate, which is also the home of The Red Barn, one of New Zealand’s leading wedding and events venues. Her older sister Caitlin married her long-term partner, Tom Doyle, there earlier this year, and the newlyweds are currently enjoying the best of Italy and Greece on their honeymoon.\nThe month before buying the house at auction, McKenzie re-signed with New Zealand Rugby (NZR) and is committed to playing for the All Blacks until 2029, estimated to be earning well over $1m per year outside of sponsorship deals.\nBut the versatile player is building a career off the field, too. Society Insider has previously reported on Grins, the RTD business McKenzie owns with former All Black Stephen Donald and current teammate Anton Lienert-Brown.\nHe is also in business with Donald, former All Black Richard Kahui, and two others, as a director and shareholder in Horsham Developments Ltd, which is listed as a residential property operation.\nAnd McKenzie will be making O’Sullivan’s racing legend dad proud; he has long had an interest in horses and owns a racehorse, My Chablis, with fellow All Black Jordie Barrett as part of a syndicate. The four-year-old is said to be a profitable mare with a 168% return on investment, and reportedly more than $26,000 in winnings to date.\nO’Sullivan is also putting the couple’s new home to work. The house has plenty of space to work from home with her digital marketing and social media management company, 26 Impressions. And it’s understood she has already filmed content at the house. 26 Impressions does social media management and marketing for healthy pre-made meal service Clean Eats, as well as for Red Barn.\nMcKenzie, 30, and O’Sullivan, 27, are believed to have met more than a decade ago, when McKenzie was doing a Bachelor of Communications in between his rugby, at the University of Waikato. Society Insider first reported the pair were dating last September, and since going public with their relationship, O’Sullivan has cheered McKenzie on from the rugby sidelines, and he has attended a few horse races with her, too.\nThe pair have attended friends’ and O’Sullivan’s sister’s weddings together, played golf in Te Arai, north of Auckland, and enjoyed time at the O’Sullivans’ impressive Mount Maunganui beachside retreat.\nWith the latest move, there are engagement rumours swirling, but neither O’Sullivan nor McKenzie would comment.\nBirthday Belles Shine\nTwo Society Insider regulars celebrated milestone birthdays on Saturday night.\nRich Lister Jodie Dick had her 50th birthday at The Northern Club, while Soul Bar and Bistro general manager, Olivia Carter, celebrated turning 40 with a 60-person dinner party - at her restaurant, of course.\nDick hosted more than a hundred of her friends and family at the Northern Club’s Winter Garden.\nIn May, we reported Dick was in Paris on the Rue de Marignan for the final fitting of her Oscar de la Renta gown that was being specially crafted for the occasion. Highly personalised gowns from de la Renta can cost tens of thousands of dollars.\nThe final result was a stunning, ornately beaded silver gown with floral detailing cascading down into the draping of the silver fabric. The bodice was boned with a winged effect.\nThe owner of Hartfield Jewellers in Parnell, Dick accessorised with pieces from Italian fine jeweller Pasquale Bruni - a diamond necklace with the signature floral design and a matching ring. Dick’s husband, CallPlus founder Malcolm, who has an estimated wealth of more than $250m, complemented his wife in a silver dinner jacket and bow tie.\n“It was a beautiful evening,” Dick tells Society Insider.\nGuests adhered to the strict dress code, with men in black tie and women in black gowns.\nFormer Real Housewives of Auckland Gilda Kirkpatrick and Anne Batley Burton were on point with the dress code, as were their other halves. Kirkpatrick was joined by her partner in life and business, James Polhill, who is the director of marketing firm Hello, and Batley Burton by her husband, investment manager Richard Burton.\nAlso looking glamorous were Sofia Ambler and Scarlett Wood, from marketing group The Luxury Network.\nThe Dicks’ neighbour, tech multimillionaire titan Carmen Vicelich - who celebrated her own 50th last November in Rio carnival style - chose a black shimmering dress for the Northern Club.\nGuests arrived at the Winter Garden room through draped silks and lighting created by specialists La Lumiere, with fragrant floral arrangements of orchids, roses, and hyacinths, by Michele Coomey Floral.\nThe main room was equally impressive with abundant silk draperies, lighting, and flowers. Guests enjoyed Perrier-Jouët Grand Brut Champagne and a range of cocktails, including classic margaritas and mojitos.\nCanapés were followed by walk-and-fork bowl food, which included salmon on rocket, beef on potato gratin, and risotto.\nThe birthday girl’s speech was set in front of lilac draping and staging by La Lumiere, and Dick spoke of the gratitude she felt for friends and family while she walked the Camino Trail in Europe earlier this year.\nEagle-eyed guests had been admiring the stunning cake positioned by the stage all evening and after blowing out her candle, Dick was given a stylish hammer to crack it open, with silver confetti blown into the room from a fan inside the cake.\nWearing that heavily boned bodice was not ideal for dancing, so when the Dicks were ready to hit the dance floor, where singer Phil Madsen and his band had guests dancing until late, Jodie changed into a satin chartreuse pleated Gucci gown.\nAnd the celebrations aren’t over for the Dicks. Next week, the pair will be renewing their marriage vows at the Graceland Chapel in Las Vegas.\nDown at Viaduct Harbour, Carter’s 40th was also a black-tie affair. And it was time for the woman Society Insider crowned the “hostess with the mostest” in our annual awards last December to enjoy a party of her own.\nThe side deck of Soul Bar & Bistro was closed off and transformed into an intimate dining room featuring one long table.\nCarter called in Atmosphere Events and Total Events to help raise her guests’ dining experience to the next level.\nCurtains were hung along the restaurant windows to create intimacy, with a light installation creating a pink ambience. The tables were decorated with red grapes and dark red anthurium flowers, accentuated by black place settings.\nLike Dick, Carter stood out from her guests, with everyone but the birthday girl in black and white.\nCarter chose to wow in a custom pink tulle Trelise Cooper gown, from her good friend designer Julia Leuchars, and Carter’s husband Steve wore a classic black suit.\nAmong Carter’s guests were Rich Listers Natalie and Greg Norman, and Anna Mowbray with her husband Ali Williams, who wore a top hat; restaurateurs Josh and Helen Emett; interior designer Shelley Ferguson and husband, former Olympian Steven; Entain’s Pip Eriksen and her husband William, of The Neat Meat Company.\nCarter’s favourite tipple, Champagne Mumm RSRV, was on free pour along both tables, with chicken nuggets topped with caviar to start. A three-course dinner followed, featuring tuna, grilled scallops, scotch fillet, greens, mini fries, and pomme puree.\nThe birthday toast was made with RSRV LaLou Cuvee 2008, followed by a playful group game of paper, scissors, rock.\nDJs the Sweet Mix Kids kept the dance floor full after dinner to midnight, while a fabulous, large-scale cake made in-house was the cherry on top, as Carter cut and served slices of strawberry and rose water pavlova to guests as they danced the night away.\nAuckland FC gearing up for bigger and better second season\nAfter an incredible inaugural year, Auckland FC is getting ready to kick off the new season in style, on and off the pitch.\nThe A-league football club is co-owned by US billionaire Bill Foley, founder of Foley Entertainment Group (FEG), and this season there are plans for “more synchronicity” between the team and his Foley Hospitality NZ group’s offerings.\nFoley’s NZ businesses include Wairarapa luxury lodge Wharekauhau Estate, wine brands including Te Kairanga, Mt Difficulty, Dashwood and Te Tera, and 10 venues, including Andiamo, Soul Bar and Bistro, and The Jervois Steak House.\nFoley Hospitality NZ CEO Mike Higgins, 49, says Foley, 80, who has an estimated net worth of more than US$2.5b, has challenged him and Auckland FC CEO Nick Becker to bring the wider group closer together.\nHiggins tells Society Insider Foley wants the pair to “provide exceptional experiences to those that engage” with its businesses and interests.\nThat will begin later this month, with an Auckland FC fashion show on August 28 at Soul as part of NZ Fashion Week, where the club’s new kit will be revealed.\n“The show will weave in New Balance’s newest footwear and apparel and showcase the cutting-edge Auckland FC Kit Couture collection,” Becker tells Society Insider.\n“Our lads will be modelling with professional models, and we are hoping players such as Logan Rogerson, Callan Elliot, Hiroki Sakai, and Dan Hall show the same finesse on the runway as they do on the pitch.”\nThe idea is reminiscent of past Fashion Week runway shows that saw All Blacks players walk the catwalk in Jockey underwear.\nThe Soul show will come the day after the new eight-part docuseries Forever Auckland FC premieres on a raft of Sky TV platforms, including Sky Open, Sky Go, Neon, and Sky Sport.\nThe “black and blue themed” VIP screening takes place at Event Cinemas in Newmarket next week, with Becker, his team, and players expected to attend, alongside FC co-owners Ali Williams and Anna Mowbray, and the series executive producer, Dame Julie Christie.\nThe premier season kicks off in two months, so Higgins and Becker are making plans for special hospitality offerings for AFC’s loyal fans. They’re hoping this will help attract new fans, too.\n“AFC members and season ticket holders will have some fantastic Foley wine, bar and restaurant deals, which we will soon reveal to them,” says Becker.\nThis includes making an even better home for The Port (AFC’s hardest core fans) at the Foley group’s Tyler Street Sports bar at Auckland’s Britomart this season. For away games in Wellington, Becker says there will be deals available at Foley venues Shed 5, Crab Shack and The Runholder.\nBecker shared another secret with Society Insider: they are looking to bring the Soul Bar experience to Go Media Stadium in Penrose this season.\n“We have a VIP lounge nicknamed The Black Knight Club, which holds 500 people,” says Becker. “This season, Soul’s Group Executive Chef, Gavin Doyle and his team, will offer up a few surprises, both culinary and beverage.”\nSponsors and high-rolling members are known to fork out more than $5000 to be part of the Black Knights, and Soul’s infusion of hospitality will take things up a notch from the standard fare. Mowbray and Williams enjoy hosting the room; Prime Minister Christopher Luxon, Dame Lisa Carrington, and a number of other sporting greats attended last season.\nHiggins had a 23-year career at leading advertising group Clemenger and was contemplating his semi-retirement years when Foley came into his sphere, through mutual friends in sport.\nHe and Becker played a pivotal role in launching Auckland FC and getting a blue-chip group of sponsors on board.\n“Nick and I were in a privileged position to set up a professional sports team from scratch with enviable support and resources coming from Bill Foley’s sporting world in Las Vegas and Bournemouth,” Higgins tells Society Insider.\nThe connections between the Las Vegas arm of the business are now even stronger, with Kiwi expat Shane Green taking over as Foley Entertainment Global CEO.\nHe is opening access to Kiwis to all the best of the Foley offerings in the US, with sponsors and suppliers in New Zealand being offered luxury adventures stateside.\n“It certainly helps having a Kiwi in charge, looking out for us down here,” says Higgins.\nGreen and Higgins are working together to provide opportunities for their hospitality talent in NZ to work across the US portfolio, and vice versa.\nThe group’s interests may be expanding even further in NZ - there has been speculation that it is looking to extend its Queenstown offerings, with the establishment of a sister luxury lodge to Wharekauhau Estate.\nHiggins could not confirm but told Society Insider, “Watch this space.”\nParty people of the week\nSamsung’s SPY Bar Revival\nIt was a night of nostalgic throwbacks as Samsung brought Auckland’s 2000s nightclub scene back to life with a one-weekend-only revival of SPY Bar. The exclusive preview evening was recently held at 204 Quay St, with the reimagined space - now known as Cellar Bar - transformed into a neon-lit time capsule to celebrate the launch of two new mobile phones.\nSPY was iconic on the Auckland party scene from the very late 1990s to when it closed in 2016. High-profile guests in its earlier years included Nicola Robinson Evans, Eric Watson, Aja Rock, Lana Cockroft, and a host of sporting names of the time, including Matthew Ridge and Marc Ellis.\nThe night kicked off with a welcome note from Samsung New Zealand’s Morgan Bunt, who welcomed guests and got the crowd warmed up for the crescendo of the night: an epic dance battle worthy of the early 2000s.\nThemed cocktails flowed as media, influencers, and longtime club kids dressed in 2000s-themed outfits danced to nostalgic beats by DJ Grant Marshall on the decks amongst the Y2K-themed décor.\nAmong the revellers were ZM’s Clint Roberts, The Hits’ Matty Mclean, Remix magazine publisher Tim Phin, Miss World New Zealand, Samantha Poole, actor Vinnie Bennett, make-up artist Kylee De Thier, DJ Arii Jade, and fashion influencer Jess Molina.\nDiscovering the Cellar\nOn Wednesday, The College Hill Wine Room hosted an intimate, invitation-only evening to showcase new, state-of-the-art subterranean storage cellars, available onsite for private collectors and aficionados of fine wine.\nThe evening featured a panel discussion on The Rewards of Cellaring led by The Wine Room’s David Nash, Jean-Christophe Poizat of fine wine merchants Maison Vauron, and Paul Brajkovich of Kumeu River – some of the country’s most prominent names in wine.\nGuests were treated to tastings of perfectly cellared wines from Kumeu River as well as prized bottles of Burgundy and Bordeaux, which mixed nicely with jazz from the George Brajkovich Trio.\nCanapés from executive chef Ryan Moore’s kitchen were circulating, and below ground, a raw oyster bar greeted guests in The Residences’ Barrel Room, with guided tours through the private cellars.\nThe secure cellars are temperature and humidity-controlled and offer members a full concierge service and 24/7 access to their collections, with the ability to drink their own wines in the Wine Room’s restaurant with no corkage.\nWine aficionados in attendance included Scarborough Group director, Ulrik Olsen, and wife Aisling; Ray White New Zealand CEO Daniel Coulson and wife Maddy of respected Ponsonby advertising firm Magnum; and Centuria NZ head of investor relations and communications, Matthew Butt.\nRicardo Simich has been with the Herald since 2008 where he contributed to The Business Insider. In 2012 he took over Spy at the Herald on Sunday, which has since evolved into Society Insider. The weekly column gives a glimpse into the worlds of the rich and famous.",
  "word_count": 2923,
  "scraped_at": "2026-02-14T13:43:16.486139"
}