{
  "article_id": "e0094d36d2eb",
  "url": "https://toffeeweb.com/season/24-25/comment/talkingpoints/46655.html",
  "title": "Everton Women hammer Liverpool at Anfield",
  "date": "20250907T160000Z",
  "domain": "toffeeweb.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Return to Talking Points index : Add your Comments »\nReader Comments (228)\nNote: the following content is not moderated or vetted by the site owners at the time of submission. Comments are the responsibility of the poster. Disclaimer ()\n1 Posted 07/09/2025 at 13:22:02\n2 Posted 07/09/2025 at 13:24:46\n3 Posted 07/09/2025 at 13:29:37\nStruggling at the moment as only 4-1 up on the Shhh.\n5 wins on the bounce looking good, but they have let in a goal - unforgiveable.\n4 Posted 07/09/2025 at 13:33:25\n5 Posted 07/09/2025 at 13:58:15\n6 Posted 07/09/2025 at 14:14:00\nVignola scores the first Everton hat-trick at \"that place\" since William Ralph Dean\".\n7 Posted 07/09/2025 at 14:14:54\nI think that’s the last five games, possibly seven, we have beat the Red Ladies, can’t call them Red Shites can we?\n8 Posted 07/09/2025 at 14:32:46\n9 Posted 07/09/2025 at 14:34:25\nWomen's soccer is on the up and I can see many EFC fans who can't get tickets to HD turning up at Goodison to see the girls.\nCOYBs\n10 Posted 07/09/2025 at 14:42:55\nCome oooooonnnn… it's not the same as the men's team doing so!\nI'm trying not to be sexist or belittling, it's just that I support Everton FC, which competes in the English Premier League. It's great to see the Women's Team doing so well, and I'm planning to go and see them a few times this season, but to crow about them winning over at the shite like it was the men's team is embarrassing and would make us a laughing stock to them lot.\nAs I say, not to detract from what's been achieved today, but let's not trot out stats involving Dixie Dean. That stat still stands (until Grealish puts three past them in due course).\n11 Posted 07/09/2025 at 14:49:03\n12 Posted 07/09/2025 at 15:00:29\nVignola, of course, looked like a special player. The new signing, Mace, was impressive in the second half, also, with good first touch passing and strength.\n13 Posted 07/09/2025 at 15:30:08\n15 Posted 07/09/2025 at 15:32:28\nTake note, Moyes, and do the same in 2 weeks time. We have the players now that can get behind their defence. We'll never have a better chance, do not bottle it going safety first.\n16 Posted 07/09/2025 at 15:41:32\nThe game was televised wasn’t it? Hopefully there will be a highlights package available at some point.\nTried to follow it on the Red Echo site. The kopite who was giving the updates obviously lost interest when our second goal put us (undeservingly) in front.\nThe Echo site is confusing. One piece reckons a super-computer says our ladies won’t finish above our city rivals, but their correspondent reckoned we were clear favourites to win before the kick-off.\nLooks like we have recruited well. No doubt the Red Echo will have some piece about how buying in good players is wholly unsporting if we do well this season.\nScott, more than one thing can be true at the same time. This is the first time an Everton player has scored a hat-trick since Dixie, but the next bloke that does it will still be the first male Everton player to do it since Dixie. The fact changes nothing about Dixie’s achievements in any case unless you count being the latest occurrence of something as an achievement.\n17 Posted 07/09/2025 at 16:31:14\n18 Posted 07/09/2025 at 17:12:02\nIt doesn’t change the fact that it’s a completely different competition and stats from a different one are irrelevant. If Jagielka got a hat trick there in a ‘Legends’ game is it significant? What about the U21s?\nThere’s lots of talk about how we define ourselves too much as a club by what happens in relation to the red side of Merseyside. Many of the comments in respect of today’s match just highlight this.\nAgain, that’s no disrespect to Everton Women’s Team. What they did today was fantastic. But it was in a different competition, and one without the depth of history.\nMan Utd used to have a basketball team, as did Barcelona. They may still do (I can’t be arsed Googling it). They were completely different competitions to the Champions League and I’m sure fans of neither club puffed their chests out and saw victory over the other as significant, other than in the context of the specific competition it occurred in. The same goes for today. Someone can stick 12 goals past the shite at Anfield but it does not have anywhere near the same significance as Everton FC, founder members of the PL and purveyors of varying degrees of football since 1878, beating them lot at their home, and one of OUR team scoring a hat-trick.\n19 Posted 07/09/2025 at 17:24:50\nPlease please please replicate the lads result in a few weeks!\nA last minute own goal will do as long as it’s a win!!!!\n20 Posted 07/09/2025 at 18:37:11\n21 Posted 07/09/2025 at 19:40:24\n22 Posted 07/09/2025 at 20:27:49\n23 Posted 07/09/2025 at 21:02:44\nA stat (in this circumstance) is just a comparison, a way of linking one fact to another. It has no innate significance.\nThis was, however, a competitive top-level game and Vignola is the first professional representative of Everton Football Club to score a hat-trick at their place since Dixie. I’d enjoy it at any level in any sport the club chose to have representatives in.\nNo one is saying this is as, or more, significant than the men’s game. It’s different in many ways and relative in a few. Plenty of kopites would be mentioning it in their encounters with blues if the shoe was on the other foot.\nNothing for anyone to get worked up about, but still brightens your day.\n24 Posted 07/09/2025 at 00:04:32\nCouldn't agree more with Dave's post and I think it's pretty weak that an Everton fan site would not cover this more or make excuses about how it's not relevant.\nThe women's game is obviously not at the same level as the men's, but it is growing super quickly. The female England's team have more stars on their shirts than the their male counterparts, (and not from 60 years ago either!), and those running the top clubs are taking it very seriously indeed, as should we. Chelsea managed to directly boost their transfer budget thanks to sell-buying the Chelsea women's team, and it looks like the Friedkin group are taking notes.\nTop Champions League level teams like Chelsea, Arsenal, Barcelona, Real Madrid, Bayern Munich, PSG etc are investing in their teams, and if we aspire to that table we should do the same.\nWhat's more, Everton women are going to keep Goodison alive as a football ground, (for a couple of seasons at least), they've stuffed that shower across the park and fans of the club should surely celebrate success on any front.\nLegendary sporting clubs like Barcelona have all manner of teams bearing the crest, from mens, womens and junior footballers to Futsal, Handball, Basketball, Rugby and even Ice Hockey! Not saying we have to get behind Everton FC Crown Green Bowls just yet, but it's surely not much of a stretch to support female professional footballers wearing the royal blue jersey? Especially ones that score hat-tricks at Anfield!!!\n25 Posted 08/09/2025 at 07:21:38\nEvertonian mothers will influence their children (like fathers do) – male and female. Really important for future generations of Evertonians that both teams do well – it is not an and/or!\n26 Posted 08/09/2025 at 08:45:53\nA big win away from home for any team is always good news and I think I am right in saying that our Under-18 Team had a similar result at the end of last season.\nSadly I expect a very tough game there in a couple of weeks, still for EFC yesterday was a Good News Day, and something to celebrate.\n27 Posted 08/09/2025 at 10:57:55\nThe same might work for ToffeeWeb. Generate more content about the women's game, and you might increase the number of (women) readers of, and contributors to, this site.\n28 Posted 08/09/2025 at 11:27:07\n29 Posted 08/09/2025 at 12:05:39\nThis is not to be sniffed at.\nI like the fact that the women are doing well but don't really follow them as such. Maybe I will at some point as the women's game develops. I do follow the England games now to some degree and enjoy it too.\nBut certainly presenting them as part of the club is good. I have been really impressed at how Barca and Bayern do this on recent stadium tours. It all comes together well, the club as a whole benefits from the profile and it helps us look like a modern successful club.\n30 Posted 08/09/2025 at 12:14:06\nFor what it is worth, I'm not so massively fussed - used to follow them back in the days of Mo Marley when they were the second best team in the land (behind Arsenal) and more 'local'. However, an influx of money from the likes of Man City saw all the best players leave (or they went to the States) and a relegation ultimately followed. I pessimistically thought money would ruin their game too.\nThat said, I enjoyed the goals against the RS and the crowd was decent. If TFG do them justice at Goodison, I agree it will generally raise the profile of the club and that's no small thing.\n31 Posted 08/09/2025 at 12:48:57\nHowever, the women's game is part of the politicisation of footy. With it comes clarion calls for equal pay, misogyny, feminism, LGBT, and Kick it Out. It's part of the authoritarian wagging finger in the fans' faces. Buckle up for endless nonsense about 'racist, sexist, homophobic abuse' left on the accounts of various social media lionesses every few weeks, which will then be weaponised by our dear leaders to hem us in, lecture us all and curb our freedoms.\nIt's a very sneaky but effective way to keep this oppressive progressive agenda constantly on the front foot and in the headlines.\n34 Posted 08/09/2025 at 13:19:10\n37 Posted 08/09/2025 at 13:38:45\n38 Posted 08/09/2025 at 13:38:54\n39 Posted 08/09/2025 at 13:46:37\nAnd if you say 'hang on, there's something funny going on here' you are then denounced as a sexist etc.\n40 Posted 08/09/2025 at 13:51:35\nCircles and roundabouts.\n41 Posted 08/09/2025 at 13:57:04\n42 Posted 08/09/2025 at 14:02:11\nThere's a huge potential audience out there for women's football - and huge revenues to be gained by doing just that. My daughter loves it. Should she not be allowed to watch on tv until each club has managed to get regular attendances in the ground of 20,000 plus?\nIf you don't want clubs and TV and advertising to tap into that potential audience just because the players are women then it does sound pretty sexist tbh.\nYou're under no obligation to watch if you don't like it.\n43 Posted 08/09/2025 at 14:07:42\n44 Posted 08/09/2025 at 14:08:08\nAnd the point I am trying to make is it's not that I have this aversion to women's footy, it's that I don't like the boosting of it, and all the endless garbage that goes along with it. As an experiment check out the Guardian's coverage of the recent women's finals. See how many articles were about the game, and how many articles were on the agenda. I think you'll be surprised.\nRon yes it's an interesting footnote. And that WAS organic, not boosted. More power to them. It was a different world.\n45 Posted 08/09/2025 at 14:18:29\nTV, advertising etc, is not promoting the game out of the goodness of their hearts. They expect a huge return. They also seem to be getting it as audience figures are holding up well.\nAnd as for the sensationalist boosting of the game - again presumably the same principle applies to the men.\nWhen I was a kid there was a bit of noise on TV, but not much. I watched the (presumably EU promoted) Football Italia avidly because I couldn't watch anything else much and it was really good.\nBut now I have radio, TV, YouTube etc – ramming men's football down throats pretty much 24/7.\nWhy is that development okay? But not the same sort of promotion of women?\n46 Posted 08/09/2025 at 14:33:32\nNow, the women's game is occupying between 25 and 50% of the footy headlines, when there is nowhere near that requirement for a profile like that. I don't discount that they could be playing some sort of long game — sort of, if you show it they will come, and pay (eventually). But I don't think that's it (my opinion).\nI think the agenda is where it's at. I don't think at this point that it's about the money. It's about control. Footy is a very useful tool to promote the progressive agenda as I've outlined above.\nAn agenda that maintains that women are oppressed, men are given to sexism, racism, and homophobia, and to safeguard against that, the State needs to take an increasingly heavy hand in all our affairs. And footy, with its high profile, keeps this message fresh, and with social media easy to demonstrate.\n'Look at the abuse our brave forward took after she missed the penalty! Something must be done!!' — and on it goes.\n47 Posted 08/09/2025 at 14:36:44\n48 Posted 08/09/2025 at 14:36:58\nAnd 49,372 empty seats in a cavernous Anfield.\nObviously, the game has a long, long, long way to go. My personal view — perhaps shared by a few others judging by that attendance — is that it's not very good.\nKevin might actually have a valid point for once. Coverage certainly seems to be heavily overdone by the BBC and The Guardian...\n49 Posted 08/09/2025 at 14:45:40\n50 Posted 08/09/2025 at 14:48:50\nKevin's talking about the disproportionate boosting of the women's game, far beyond its actual popularity.\n51 Posted 08/09/2025 at 14:49:05\n52 Posted 08/09/2025 at 14:53:10\n53 Posted 08/09/2025 at 15:11:28\n\"However, the women's game is part of the politicisation of footy. With it comes clarion calls for equal pay, misogyny, feminism, LGBT, and Kick it Out. It's part of the authoritarian wagging finger in the fans' faces. Buckle up for endless nonsense about 'racist, sexist, homophobic abuse' left on the accounts of various social media lionesses every few weeks, which will then be weaponised by our dear leaders to hem us in, lecture us all and curb our freedoms.\"\n54 Posted 08/09/2025 at 15:20:59\n55 Posted 08/09/2025 at 15:23:51\nMichael was just pointing out that I never said women were only allowed to play footy so the left can politicise it.\nI was saying that the boosting of women's footy is part of an authoritarian program (which spans both tory and labour) to oppress the people. You are free to disagree, but if you are confident in your arguments is there really a need to imply I hate women, or that I am talking BS? I realise that some of the issues I am covering such as racism and sexism may be totemic. To be clear, I am opposed to racism and sexism, I am also opposed to the weaponisation of the same. It is very handy if a State with oppressive tendencies can characterise its people as racist and sexist, as this then justifies 'clampdown'. and extreme measures.\n56 Posted 08/09/2025 at 15:34:53\n57 Posted 08/09/2025 at 15:36:48\n\"I was saying that the boosting of women's footy is part of an oppressive authoritarian program (which spans both tory and labour) to oppress the people\".\n58 Posted 08/09/2025 at 15:37:18\n59 Posted 08/09/2025 at 15:40:02\nIf it is at the point where more coverage is warranted then surely we'd be seeing an influx of user generated articles and talking points dealing with it? In which case it would grow naturally. But right now we get the occasional comment of \"oh I heard the women's team won the other night,\" and usually it only happens when they play the RS.\nSo I imagine if the game the team becomes more popular then over time we will see more and more people on here submitting articles that include actual insights into the team/game and over time there will be more representation on here.\n60 Posted 08/09/2025 at 15:40:53\n61 Posted 08/09/2025 at 15:45:01\nI can quite safely say that is probably the biggest whopper I think I’ve ever read anywhere. It would be laughable if it weren’t for the fact that someone actually believes that. It is category A BS. Extreme, right wing conspiracy theory dribble at its worst.\nOh and your proclamation that you’re “against racism” is shown up to be a downright lie when you follow it up by announcing that leaving online racist abuse (and the rest) is some sort of fundamental human right. It’s not, it’s hate speech, it always has been and always should be.\n62 Posted 08/09/2025 at 15:57:12\nJust wondering Kevin if you have a wife or daughter?\n63 Posted 08/09/2025 at 16:06:06\nI'm not sure you've quite got my point.\nI am suspicious of a state which allows a virtual graffiti wall which anyone can write upon, and then the whole of society is encouraged to gaze upon it, and say 'Oh, How Shocking! Look at what we've become'. A sensible society would not treat such utterances with any weight. Prosecute the offenders by all means, but why amplify it? It's like if the world's media was camped outside nogsy swimming baths to see what was the next offensive thing to get written on the wall, it's not sensible behaviour. Unless, you have an agenda you wish to exploit.\n64 Posted 08/09/2025 at 16:06:32\nIf you don't enjoy the women's matches, fine. For you to state that the coverage is unjustified requires some work not provided in your posts. These are commercial interests' broadcasts and publications.\nDo you have specific claims to make about their interests in some progressive agenda? I would be very surprised to see editors, who are typically conservative, doing this out in the open.\n65 Posted 08/09/2025 at 16:19:54\nBut please do insult our intelligence in response by explaining that we’re controlled by Jewish space lasers.\n66 Posted 08/09/2025 at 16:25:58\nand I'm also dog whistling for use of the N word? and I believe the world is controlled by Jewish space lasers?\nI see your not entirely holding it together on the debate front, so will leave it there.\n67 Posted 08/09/2025 at 16:37:30\n68 Posted 08/09/2025 at 16:46:24\n69 Posted 08/09/2025 at 17:06:42\n70 Posted 08/09/2025 at 17:06:45\n2. 49,372 empty seats - of course, who is going to fly over from Norway to see the ladies play, or drive up from London?\nAnyway, we are going to WHU in Feb with granddaughter in her new kit, grandson in his, two sons in their shirts and granddad crying his eyes out when the memories made at Goodison Park come flooding back.\n71 Posted 08/09/2025 at 17:37:56\nAttendances at the last 3 Anfield derbies starting with the more recent one were approx 12k, 15k and 27k so it does appear the attendances have declined for whatever reason.\nProbably because the Liverpool fans are getting fed up at watching their team lose...\n72 Posted 08/09/2025 at 19:00:56\nAttendances at the previous 3 Anfield Derbies before yesterday's game were approx 15k, 23k and 27k so it does appear the attendances have declined for whatever reason...\nThat makes more sense.\n73 Posted 08/09/2025 at 19:43:23\nRicky Jones was cleared by a jury and therefore must be completely innocent because, in a country like England, there is just no such thing as corruption?\nWell done to Everton Ladies, and who wouldn't accept our Number 18 being two-thirds as successful as Vignola was yesterday when we play at our old ground on Saturday week?\n74 Posted 08/09/2025 at 20:29:35\nThat political enough for you?\n75 Posted 08/09/2025 at 20:49:34\nWhat is obvious is that it is hugely expanding now in terms of popularity and commerciality. Your luddite attitude does you no credit.\n76 Posted 08/09/2025 at 20:53:02\nI’m having a little lie down until I get over it…\n77 Posted 08/09/2025 at 20:56:12\n78 Posted 08/09/2025 at 20:57:47\nCock off.\n79 Posted 08/09/2025 at 20:58:18\n80 Posted 08/09/2025 at 21:02:47\nSo, very similar to the existential threat we face with the evil rise and domination of female togger.\n81 Posted 08/09/2025 at 21:06:45\n82 Posted 08/09/2025 at 21:08:55\nThe last few England Lioness games there has been online abuse of some of the girls after the game. Only a handful of idiots online, but it has garnered national headlines.\nNow for me, that is as I've said before like the world's press lining up inside a gent's bogs somewhere taking photos of the scrawl and then bewailing the implications for society. It's a nonsensical magnification of idiotic behaviour, but it's done with a purpose in mind.\nso, to sum up, that does not mean that sexism or racism is good, what I'm objecting to is the weaponisation of these happenings, which I think is being done deliberately, and I think women's footy provides a very convenient vehicle for the same, hence it's boosting.\n83 Posted 08/09/2025 at 21:11:03\n84 Posted 08/09/2025 at 21:13:13\nWhat's that say about you, Tony?\n85 Posted 08/09/2025 at 21:14:02\nTo many, women's football is a pale shadow in comparison to the men's game. Does it deserve the recognition it gets? Absolutely, is it comparable to the men's game? Yes but with a few riders. As yet, it doesn't have the depth of quality players compared to the men's game, yet.\nBut it is entertaining to a significant base both male and female especially young girls. They have their own female player idols they want to aspire to be.\nThat the likes of Sky promote it because they see the commercial opportunity to reach half the population, The Guardian or the BBC just report it.\nNowt to do with politics, so please let's leave it out of the discussion? Some hope.\n87 Posted 08/09/2025 at 21:16:49\nEssentially they were just fellas in the pub getting wasted and deciding to smash stuff up because it threatened their livelihood.\nThe reports from those spying were actually quite funny - 'old Albert said e wasn't happy with these machines and if the King was here he'd bop him on the noggin'\nThere will always be resistance to change. Both justified and unjustified.\n88 Posted 08/09/2025 at 21:20:15\nI think we can all work out what you are and what you stand for.\n89 Posted 08/09/2025 at 21:22:16\nMy prime motivation is I just can't stand women's footy. You got me!\n90 Posted 08/09/2025 at 21:24:12\n91 Posted 08/09/2025 at 21:29:03\nFortunately, the future is in the hands of younger (and I dare say wiser) generations who will look back on debates like this and shake their heads!\n92 Posted 08/09/2025 at 21:36:12\n93 Posted 08/09/2025 at 21:39:59\n94 Posted 08/09/2025 at 21:47:42\nSo, we had the Euro final, with the whole nation watching. Sancho and Saka were abused online after the game by a handful of idiots (5-10 were prosecuted in the end). And yet, it was this event which carried all before it for days after the game.\nAnd in this way, the weaponisation of footy is used to propagate the lie that England is somehow a racist country and that we need a strong state to protect us from the Far Right.\n95 Posted 08/09/2025 at 21:51:32\nI compared her getting 31 months to Ricky Jones getting a not guilty as absolutely disgraceful, but some clever people on these pages pointed out that Jones was acquitted by a jury.\nI said that, when it came to VAR, then Everton seemed to get treated like Lucy Connolly whilst certain clubs seem to get treated like Ricky Jones.\nIt was said with my type of ironic black humour, Jake, but the irony to some people was that it wasn't funny, which is exactly how I felt when Ricky Jones was acquitted.\nHow anyone who is against hate speech could agree with Ricky Jones getting acquitted is beyond my comprehension, Jake, and having this view should tell you more about exactly the type of person I am.\n96 Posted 08/09/2025 at 22:02:50\n97 Posted 08/09/2025 at 22:10:47\n98 Posted 08/09/2025 at 22:16:27\n99 Posted 08/09/2025 at 22:21:13\nHowever, I suspect we will need to move to a PR system in the near future to fully reflect the spectrum of opinion in the UK, as both traditional parties of government seem to have lost touch with their base voters.\n100 Posted 08/09/2025 at 22:29:11\nCan't imagine the direction it would have gone if the Everton women's team had lost!\n101 Posted 08/09/2025 at 22:29:39\n102 Posted 08/09/2025 at 22:55:33\nConnolly incited attacks on a specific identifiable minority...attacks which were actually happening and she was asking for more of the same.\nJones's comments, whist vile, were made against people who weren't readily identifiable nor being attacked.\nThat matters.\n103 Posted 08/09/2025 at 23:05:21\nAnd had previous for sending racist tweets.\n104 Posted 09/09/2025 at 00:45:53\nAs part of my undergraduate studies, I read Samuel Bamford's \"Passages in the Life of a Radical\" from those times.\nFair bit of time was spent on licensed premises. Seemed a decent bloke.\n105 Posted 09/09/2025 at 01:24:14\n106 Posted 09/09/2025 at 08:09:40\nI don't even know what she wrote, and because she herself took the post down, it was obviously written in anger after the inexplicable murder of three young children by a person who should not have been free to do what he did, if the relevant authorities had been doing their jobs properly.\nThe obvious lesson is don't plead guilty, which is something that the wise politician already knew.\nFreedom is slowly getting eradicated, even pensioners are being arrested for protesting about mass genocide nowadays, but how many times have you looked at pictures featuring VAR and thought How have they got away with that?\nRicky Jones got bail and his trial was an obvious (to me) left-wing fix-circus (1½ hours, nothing to discuss here) and Connolly got 31 months, after receiving a third off for her guilty plea and her feet never touched the floor.\nIt's all water under the bridge but, for anyone who hates injustice, then it obviously leaves a bitter taste.\nIt will be intriguing to see how long the people get for attacking the police in Manchester airport, especially because they won't be receiving any remission for a guilty plea. (I include this because do you think a couple of scouse lads attacking police in Manchester airport would have been afforded bail?)\nChristine, I have no intention of watching Everton Ladies play, unless it's something my daughter wants to do, but I honestly enjoyed watching the Lionesses in the summer more than I enjoy watching a lot of football nowadays, simply because every single player on the pitch wasn't just trying to cheat.\n108 Posted 09/09/2025 at 08:46:45\nWilliams, because she just carried on going, fighting for justice through the endless lies, and O'Connor, because she suffered a lot of ridicule and a massive amount of abuse (especially from a lot of the American mainstream media, and people in high society) when she ripped up a poster of Pope John Paul II.\nIt took some guts doing that, and how Sinaed O'Connor suffered for highlighting the disgusting behaviour of so many members of the Catholic Church.\nCorruption has always been rife, but I believe it to be completely off the scale right now. You only have to look at the list of names on Peter's list@74, to understand this.\n109 Posted 09/09/2025 at 08:59:16\nThey are definitely luckier, but not for one minute do I think they are wiser.\n110 Posted 09/09/2025 at 09:03:08\nAnd I say that as a father who went to wake his son up last January 22nd and found him dead. I can't even begin to think of putting anyone else through the agony that myself and my family have gone through in the last year.\n111 Posted 09/09/2025 at 09:07:47\nI have watched a very good friend who lost his daughter suffer immensely, and my experience of life is that grief makes people react in so many different ways.💙\n112 Posted 09/09/2025 at 09:19:54\nWhen I see families of the Hillsborough victims go to a football match - that's true courage because that's really triggering. I wouldn't have the bottle.\n113 Posted 09/09/2025 at 09:23:41\nI remember Sinead's backlash at that action but thought it was also something to do with the then Pope ruling that an Irish girl that had been raped should not be allowed to have an abortion. It was something being discussed in the Irish parliament or courts at the time.\nI thought the kiddy fiddling of the church was exposed later than that, especially the Oscar winning movie \"Spotlight\".\n114 Posted 09/09/2025 at 09:33:13\nI'm struggling to find the right words here but wish you and your family well. Take care\n115 Posted 09/09/2025 at 09:49:34\nPersonally, I am very happy when disgusting attitudes are publicly outed and pilloried. It's much better than the way such things have been played down for centuries.\n116 Posted 09/09/2025 at 10:08:30\n117 Posted 09/09/2025 at 10:23:43\n118 Posted 09/09/2025 at 10:26:23\n119 Posted 09/09/2025 at 10:31:10\nGive me Stalin any day. He sorted things out. Right!\n120 Posted 09/09/2025 at 10:36:39\nI don't think there are any words to console parents who have lost a child. I can only imagine the never-ending grief they go through.\n121 Posted 09/09/2025 at 10:37:38\nI don't know you, Jake, but I'm glad you have started slowly getting things back together again, even though I'm sure that dark cloud must be making things extremely difficult.\nThere will always be that longing to share, and trying to choose my words carefully, I hope you continue to find the strength to keep moving forward, because I'm sure this is something your son would definitely want for his father💙\nI spoke to the father of Michael Jones outside Goodison before the Southampton game. Through his obvious heartbreak ,I also think that going to the match to watch Everton with our friends and our family is a big part of what has defined us over the years.\nWe shall not be moved… not when you have got the spirit of an Evertonian, even though we argue like fuck! 🤷♂️\n122 Posted 09/09/2025 at 10:48:53\nVery moving posts.\n123 Posted 09/09/2025 at 10:59:41\nIn what way? They are inheriting a shit storm in my view – they will be less wealthy, less healthy, and live less long than previous generations.\nThey have had their education and younger lives massively disrupted by a once in a hundred year event (the pandemic). Their opportunities for entry-level jobs and careers are being swallowed by the AI revolution and being replaced with anything other than gig economy jobs.\nPretty much everything they do and say will be monitored and monetised, not just by governments but by mega wealthy corporations and individuals who will try and exploit them to make even more money (which they can't possibly spend in their lifetime).\nClimate change and war is rife and likely to get worse. I think we are living in a very dangerous world – perhaps the most dangerous since the 1930s.\nThe kids are definitely not lucky.\n124 Posted 09/09/2025 at 11:19:38\nOne of my coping mechanisms now is following Everton, probably more intensely than ever. It shuts out everything else.\nIs it too early to predict the Villa result? I'm going 3-2 to us.\n125 Posted 09/09/2025 at 13:00:25\nAny benefits they can get their minging hands on. Raiding the food banks while their fatherless offspring are sat waiting in 4x4s. Full plastic facelifts, designer clothes, holidays abroad.\nGood young ones want to work. They are the ones I feel the most for. What is the answer? Communist, Islamic etc government? I feel this system is going to collapse. Dark days.\n126 Posted 09/09/2025 at 13:18:11\nAre benefits that great these days? Should I go back and sign on?\n127 Posted 09/09/2025 at 13:40:52\nIt is hard to fathom why life makes us suffer so much at times.\n128 Posted 09/09/2025 at 13:49:09\nWrote it, read it and deleted it. It had no place on a football site, I was just another stupid woman who should never have left the sink.\n129 Posted 09/09/2025 at 14:48:26\n130 Posted 09/09/2025 at 14:52:33\nCant get on the housing ladder\nFood prices through the roof\nInflation nearly double the target of 2%\nEnergy prices going higher\nWages stagnant\nStudent debt\n132 Posted 09/09/2025 at 15:25:01\nI grew up in Thatcher's Britain, when we didn't have nowhere near as much butwe learned to live on our wits.\nMy wit tells me that, if digital currency had been around, my city would have never survived the onslaught from our own Government, and yet I see people who grew up in Thatcher's Britain tapping their card wherever they go and I find it very depressing.\n133 Posted 09/09/2025 at 15:31:32\nIt is all getting a bit out of hand on here.\n134 Posted 09/09/2025 at 15:35:27\nEric, I don't know how they do it. I see it every day where I live. I try and just ignore the skanks.\n135 Posted 09/09/2025 at 15:42:28\nMeanwhile, the captains of industry bleat on about how there aren't the workers – from the same companies that have rejected my 2 and many of their mates without even the courtesy of an acknowledgement of their applications!\nHuge debt, no prospects, and desperate to work. Something has gone very wrong with the world.\n136 Posted 09/09/2025 at 15:56:09\nPrint out the receipt and take ID, wonderful. Hopefully on Sunday evening we will bask in two good weekend wins.\n137 Posted 09/09/2025 at 16:17:07\nComing home from West Ham a few seasons ago, I was listening to a few young local cockneys having a conversation about having to go to places like Wigan if they wanted to get on the property ladder. I think it's clear what has gone wrong, because the only one true religion for 99% of the population is money.\nIt all makes perfect sense; Roger Waters was on it years ago.\n138 Posted 09/09/2025 at 16:27:27\nAnd how many has this had?\n139 Posted 09/09/2025 at 16:31:21\nIt's only Tuesday, and I'm already looking forward to going to Bramley-Moore Dock on Saturday, I can see it now... V-A-FUCKING-ARRRRRRGGGGGGHHHH.\n140 Posted 09/09/2025 at 16:36:40\nRoll on Saturday!\n141 Posted 09/09/2025 at 16:37:18\nSuppose it depends on the editorial side of the bed.\n142 Posted 09/09/2025 at 19:13:56\nPeople on here talk nonsense about 'weaponisation' to drive some agenda to steal your freedoms... what freedoms that you wish you still had have been stolen, exactly?\nIf people think coverage of the women's game is somehow disproportionate to their popularity, perhaps they should have a go at counting the number of hours of men's football pumped out in any given week across the channels. Not to mention Talksport, online... I mean, anyone lacking men's football content is living on another planet. The content on women's football is, in fact, disproportionately low (and only likely to grow).\nAnd Everton Women's attendances were obviously so low as they were based at Walton Hall Park... we'll see how it goes in the next few years at the Grand Old Lady!\n143 Posted 10/09/2025 at 09:26:11\nSixteen candidates have died in Germany, with the police already ruling out unnatural causes in four of the cases, including seven far right AfD nominees, which is the only party, to have more than one candidate die.\nEurope is eating itself up from within is something I remember seeing quoted by Vladimir, at least a couple of years ago, and it was intriguing that the first person to respond to this drone attack, is the person that is having the most problems at home.\nMy view is that European Politicians, have been bought and polluted, I’m just still trying to work out by whom!\n144 Posted 10/09/2025 at 09:54:01\n145 Posted 10/09/2025 at 10:24:22\n146 Posted 10/09/2025 at 10:27:38\n147 Posted 10/09/2025 at 10:33:55\n148 Posted 10/09/2025 at 11:19:55\nI suppose it depends on the sport.\nSince I can remember and followed athletics, including the olympics, it’s been pretty much equal coverage.\nSimilarly, Skiing. I go every year and tune into Ski Sunday weekly. Again, equal coverage and both equally as popular.\n149 Posted 10/09/2025 at 12:02:35\n150 Posted 10/09/2025 at 13:11:59\n151 Posted 10/09/2025 at 13:20:14\nVery interesting Kevin. I used to pick up a lot of students and when it got round to me asking what they studied, I always used to ask the history students, what good would that do them after they had graduated and were looking to get a job.\nI was being serious, because this modern world seems to be in fifth gear, full of salmon, trying to swimming upstream, even though the only thing we can genuinely learn from is history.\nI’ve just graduated in politics myself after finishing watching The House Of Cards, on Netflix, so it doesn’t surprise me that Macron, is focussing on Russia, whilst his countrymen are protesting in Paris!\n152 Posted 10/09/2025 at 13:55:39\n153 Posted 10/09/2025 at 14:12:07\nOh, bring back football!!\n154 Posted 10/09/2025 at 14:22:12\nAndy yes, this current crop of politicians is the worst I can remember in terms of talent.\n155 Posted 10/09/2025 at 14:28:37\n156 Posted 10/09/2025 at 14:33:15\n157 Posted 10/09/2025 at 15:00:03\nCOVID hasn’t cost me a penny that I’m aware of.\nBoth towers were hit independently by aircraft, so why do you say one (or both?) fell without anything hitting it?\nTony (various), unfortunately technological advancement and ‘modern’ thinking doesn’t necessarily add up to progress, although a lot of people seem to assume it does (especially if it’s apparent some people are able to make a lot of money from whatever ensues). The outrageous manoeuvring of the housing market so that it has become just another massive cash cow for a fraction of the population is just one part of it.\nNot sure about the ‘swimming upstream’ analogy if I understand what you are trying to say (something about futility and herd mentality?). The process ensures that only the best produce the next generation, which is great for the species, and the isolation of the breeding grounds helps to ensure that ultimately sufficient numbers will survive to make it to be adults and able to attempt that momentous journey as a finale to their lives. It’s a great example of evolution and filling a niche.\n158 Posted 10/09/2025 at 15:25:36\nWait to the next lot get in power they will make this lot look marvellous.\nThe world/our country is in a dangerous place.\n159 Posted 10/09/2025 at 15:30:21\n160 Posted 10/09/2025 at 15:36:45\nPre those you weren't under constant pressure to buy this and own that.\nI was raised in a working class family, apart from a paper and the odd magazine we were not exposed to rampant commercialism and 24 hr news.\nI'm 80 now with sons and grandchildren and I was hoping to die contented and happy for their futures, but the outlook seems to me to be grim and as unstable as it ever was. Things need to change radically.\n161 Posted 10/09/2025 at 15:41:22\nOther countries are not so fortunate to have a NHS and their citizens had to pay for Covid related measures, and are prosecuting perpetrators of the pricing scams, some getting a death penalty. But maybe you think those same scams were not perpetrated in UK?\nI think you are getting mixed up with the towers and the third building that fell during 911. That was never hit by a 'plane and according to conspiracy theories was the command and control centre for the attack.\n162 Posted 10/09/2025 at 15:45:56\nThe plans have been kept from the public by an authoritarian cabal who are in the process of destroying democracy and now based the Republic of Micronesia.\nIf you enjoy football, it is something you should be aware of.\n163 Posted 10/09/2025 at 15:53:22\nIt feels like a racket to me, and I’m convinced that the certain chosen few, will be making plenty of money out of this, and not just the gangs, and that laughable slogan, about smashing them.\nI was being sarcastic with regards to technological advancement being all about progress, and refer to a quote by that war criminal Tony Blair, who said most people would be prepared to lose their privacy, for efficiency, Si?\nI suppose my comment about Salmon, is partly about herd mentality mate, but it’s more about people just working that hard nowadays, only to realise that they are all going to die, one day anyway, and instead of worrying less about ways to pay their mortgage quicker so as to live with less stress, I just feel that a lot of people are swimming up stream, with blinkers, because life, just seems to have become a race to the end.\nGrowth, growth and control, unless people start taking a little bit more notice about where this is all going to eventually go?\nDriverless cars, is one of the latest inventions, but can anyone tell me why they are even needed?\n164 Posted 10/09/2025 at 15:54:43\nAndrew, the next lot in power? Islam? Communism? Take your pick. Better than what is in now.\n165 Posted 10/09/2025 at 16:12:59\nWorld affairs are depressing.\nI’d rather talk about Everton.\n166 Posted 10/09/2025 at 16:16:05\nThose dinghy sellers must be raking it in, I couldn't even get one in Ha Noi to get to my local for a pint in the floods 'cos they're all in France and UK!\nWhat I keep wondering with all this new-fangled technology like driverless cars and AI is... how much tax and NI will these machines pay? After all, that's what funds our police, military, hospitals, etc, isn't it?\n167 Posted 10/09/2025 at 16:17:53\n168 Posted 10/09/2025 at 16:32:00\nRoll on Saturday. I was flicking through my iPad before and ended up watching a little 10-minute video of our game against Brighton, and the stadium looked absolutely brilliant. Even if it was built with a Russian oligarch's money!!\n169 Posted 10/09/2025 at 16:33:36\nYeah, Covid was just a scam. And those 7,000,000 deaths just keeps the food and water available a bit longer.\nI'm trying to work out who organised the 50,000,000 deaths (1 in 37) from the Kansas Flu outbreak of 1917.\nNeil Armstrong and Buzz Aldrin — you frauds.\n170 Posted 10/09/2025 at 16:35:38\n171 Posted 10/09/2025 at 16:42:03\nA better example though is somewhere which did not bother with lockdown or vaccines, like Africa. See what their death rate is like for the last five years. See how much it went up being exposed to this 'deadly virus'.\nSi, the people we borrowed the half trillion from made a fortune, as did big Pharma with their 'vaccines' and the suppliers of all the 'essential equipment'. and have a look at Building 7 coming down, and just ask yourself 'what' happened there exactly'\n172 Posted 10/09/2025 at 16:45:05\nAnd the current lot are getting pants for not being able to fix the mess the last lot left.\nSo who else is there? (Is there such a thing as a Liberal Party anymore?)\n173 Posted 10/09/2025 at 16:46:49\nOn to Saturday and back to football and another marvellous Moyes victory match!\n174 Posted 10/09/2025 at 16:52:50\n175 Posted 10/09/2025 at 16:57:41\nI know! I know! (holding hand up).\nBut I won't spoil Phil's enjoyment of looking it up.\n176 Posted 10/09/2025 at 16:59:41\nAnd for those posters who like to start at the bottom of a thread and work their way up - well, you're in for quite a treat. Because in addition to the main focus (the 4–1 win at Anfield), the conversation somehow manages to cover all of this too…\nThe Match (Everton Women 4–1 Liverpool at Anfield) - thought it should get another mention.\nEverton Women's Form & History\nComparison to Men's Team/Records\nMedia Coverage\nSupport & Attendances\nFuture Fixtures/Stadium Links\nGrowth of Women's Football (Global & Commercial)\nEverton's Strategy & Identity\nFan Attitudes to Women's Football/Debate on Importance\nPolitics & Society (Sexism, Equality, Freedoms)\nHistorical Context\nLucy Connolly & Ricky Jones Cases\nPersonal Grief & Loss\nWomen Admired / Cultural Icons\nGenerational Divide\nConspiracy Theories & Geopolitics\nTechnology, Money & Modern Life\nDiscussion about ToffeeWeb Threads\nArguments & Insults\nHumour & Sarcasm\nSo buckle up. What starts with goals, tackles and bragging rights ends up taking in politics, global conspiracies, Stalin jokes, and even the odd tiddlywinks reference. A thread that really does have it all.\nAnd finally - a big shout-out to Jake, who shared the heartbreaking news of his son's tragic death. The compassion shown in the replies was a reminder that, for all the arguments and tangents, this community can rally together when it matters most.\n177 Posted 10/09/2025 at 16:59:49\n178 Posted 10/09/2025 at 17:00:31\nI did exactly the same then deleted and replaced it with just the word “Nah” @98.\nNo more politics from me on here!\nMurph - proud Catholic\n🫣\n179 Posted 10/09/2025 at 17:05:12\nI replied to that post by Christine but it was deleted, hope I never upset anyone, especially Christine!\n180 Posted 10/09/2025 at 17:07:31\nOn behalf of Tony, I think it's important that people should know he is a taxi driver.\n181 Posted 10/09/2025 at 17:17:23\nHave you seen the population density in Africa? But I agree, not as dense as the population here in the UK.\nOur charity did send our money for facemasks and soap and you should have seen the classrooms with 15 kids rather than 75. Sadly you can never post photos on ToffeeWeb (or graphs or charts).\nWonder if the world death rate was the same in 1920 compared to 1924?\n182 Posted 10/09/2025 at 17:32:37\nTbh, I missed most of the thread as I've been busy fighting to get our freedoms back by putting Union Jacks up on bridges on the M62 and decorating mini roundabouts.\nNext international break, I'll focus on disrupting the deep state influence of women's footy. I plan to start preparing on Tuesday when I have my first coaching session with the girls U10s at my local club. Free the People!\n183 Posted 10/09/2025 at 18:16:03\nApologies, I can't disclose where I heard these rumours. We've had shithousery, now it's orangery. I'd go with Toffee Apples.\n184 Posted 10/09/2025 at 18:20:20\nScurvy was good enough for girls back when Britain was Great. It'll be good enough for them now as we get our country back.\n185 Posted 10/09/2025 at 18:26:57\n186 Posted 10/09/2025 at 18:28:59\n187 Posted 10/09/2025 at 18:29:30\n188 Posted 10/09/2025 at 18:42:13\n189 Posted 10/09/2025 at 18:44:18\nThe truth is out there if you look closely enough.\n190 Posted 10/09/2025 at 18:53:22\nThe ability of TW to take it to the next level is what always amazes me.\nOh fuck, i just now saw it downgraded to a salmon.\nExcellent Lizarazu reference by the way!\n191 Posted 10/09/2025 at 19:00:47\n192 Posted 10/09/2025 at 19:49:14\nThere was nothing tame about Frank Underwood and going by that old adage about truth being stranger than fiction, then it's a very murky world in the White House, that's for sure.\nI've just read another name for a salamander is a newt or a siren, and although I've seen a few people saying that we should get rid of it, on Danny's thread about songs, I personally can't wait to hear the siren followed by Z-Cars, on Saturday afternoon!\nIt was also interesting seeing what Michael Ball, was relaying about Merlin Röhl, with him apparently already impressing a lot of people inside Finch Farm, Liam.\n193 Posted 10/09/2025 at 20:01:17\nI like Röhl a lot Tony. Was impressed by him in the U21s Euros in the summer and a couple of Bundesliga games I caught last year.\n194 Posted 10/09/2025 at 20:19:21\nThe smart money will probably be on him playing him further forward in a more advanced role, considering we tried to sign the kid, who usually scores against us for West Ham, and this is where he probably operates best?\nMy own view is that we need a very disciplined midfielder, to sit in front of the back four, so we can reverse the triangle and play with the two other midfielders, working the middle of the park a little bit higher, which should enable them to link with our striker and our wide players, and having discipline is something I always associate with German footballers?\nIt sounds like he’s versatile, so I hope he adapts quickly wherever he plays🤞\n195 Posted 10/09/2025 at 20:26:18\nHe fits the profile – young, technically proficient, versatile – that we should be looking at. I think he's got more about him than James Garner but he's similar to him in some ways in that he can play in numerous positions.\nI may be wrong, but I think we have a good one in this kid.\n196 Posted 10/09/2025 at 20:38:36\nLooking forward to the return of the EPL this weekend and actually found myself enjoying the England match yesterday, for once!\n197 Posted 10/09/2025 at 20:45:11\nWhat I saw was that, except for a few lapses in concentration, I was very impressed because I don't think I've ever seen an England team look after the ball as much as they did last night.\n198 Posted 10/09/2025 at 22:15:38\n199 Posted 10/09/2025 at 23:02:09\nAre they the same people who put loose cannons Putin and Trump in power so we are all now losing a larger chunk of our disposable income?\nWhere Kevin (and you?) see collusion and subterfuge I just see ithe standard scummy human beings taking advantage of situations to feather their own nests that have existed throughout our history.\nNobody serious ever called COVID ‘deadly’ (it was never classed as a Grade 4 pathogen) but it was a huge unknown, both novel and readily transmissible. Governments took steps to protect people - some were more appropriate than others. What was really exposed was the lack of quality in our political establishments.\nBecause of the lockdowns and increase in hygienic measures many other nasty diseases were also suppressed. Sweden found it really difficult to get the numbers infected to generate the herd immunity they were after even without lockdowns. Therein lies a possible answer as to why the excess deaths total didn’t go up; less people than usual died of things like the flu.\nIt’s really easy to evoke strong enmity by using the Big Pharma trope. Rampant capitalism has (and ever will) created monsters in many otherwise worthwhile disciplines. I’m not aware that it necessarily requires someone to create a false calamity.\nApparently dozens of buildings in the vicinity of the WTC were destroyed on 9/11. The twin towers dwarfed everything around them and would have shed tonnes of flaming debris. Is it really completely unbelievable that a 50 storey building only 400 metres away wasn’t simply set alight and so suffered the same fate as the twin towers due to the same phenomenon of progressive collapse?\n200 Posted 10/09/2025 at 23:15:11\nI still think the salmon should be rightfully proud of their ultimate sacrifice.\n201 Posted 11/09/2025 at 00:27:26\nAnd Tony, don't take that one seriously. I just knew Liam had another line or two, and he did.\n202 Posted 11/09/2025 at 02:42:23\n9/11 happened and Al-Qaeda did it.\n7 million people died from Covid.\nDigital payment does allow companies to collect your data, so don't use it if you don't want that.\nPeople who post racist or violent social media posts are criminals.\nCriminals go to prison after a trial, especially if they plead guilty.\nReform have 4 MPs.\nWomen's football is not a global plot to psychologically castrate men.\n16-year-olds should be allowed to vote, given they can serve the country and pay taxes.\nThe earth is round.\nGravity exists.\nEverton are magic, Liverpool are tragic.\nRoll on Saturday.\n203 Posted 11/09/2025 at 05:42:09\nBest post on the thread.\n204 Posted 11/09/2025 at 06:02:16\nAt the time it was definitely touted as deadly, the narrative at the time being that it was a death sentence, and not only you were going to die but you were going to kill your granny too. Were those 'serious' people who knew it was not deadly the ones that were partying in Downing Street I wonder?\nLess than 1% of the UK populace reported as having Covid are reported as having died from it. Considering the under-reporting of cases and the over-reporting of deaths, it really was only comparable to the usual annual 'flu figures, although it lasted longer than the excess winter deaths reporting period.\n205 Posted 11/09/2025 at 06:06:13\n206 Posted 11/09/2025 at 06:23:06\nWhen Covid broke out there were no treatments, no vaccines, and nobody really knew what it was. In China people were dying in hours, in the streets and hospital lobbies. Thousands of deaths there before the virus was even identified or appeared in other countries. Seemingly unlimited potential for spread and death.\nThat's why the lockdowns for Covid but not the flu.\n207 Posted 11/09/2025 at 07:22:43\nDid Hansen handle the ball in the League Cup Final in 1984?\nJust to clear things up…\n208 Posted 11/09/2025 at 07:26:31\nEric @202. They did exist. I know this from that period. We used to use the footage for training of use of them by Saddam on his own people (well, his Kurds). Hot topic as we built up for the Gulf “black gold” conflicts. I also was aware of the background of the fudged intelligence dossier.\n209 Posted 11/09/2025 at 08:27:22\n210 Posted 11/09/2025 at 09:00:44\nAs for excess deaths, I suggest you read the accepted worldwide evaluation of worldwide deaths from Covid from The Economist:\nThere have been 7m-13m excess deaths worldwide during the pandemic\nI had family (Health Journalist) in China when Covid happened, where they sealed up residents in an apartment block where Covid was found:\nCoronavirus: Welding Doors Shut\nI suppose too, the latest Trump nut, Kennedy, the vaccine skeptic, is on the ball with his approach to medicine.\nRemoving foreign aid won't harm anyone I suppose..\n211 Posted 11/09/2025 at 09:04:58\nThe salmon was obviously a selfless species (probably not) whereas the human salmon, is just swimming upstream to the detriment of humanity, and to help the greedy bastards, who I believe have got it all wrong.\nNo thread of this kind, which has covered almost everything, would be incomplete without me mentioning Bill Kenwright. He died a very rich man, but he left his Everton legacy in tatters.\nDale, get on it man, the first thing I tried to do, was have a little laugh mate, because I think I know the people, that don’t take everything serious, on ToffeeWeb👍\nHow can you believe that Jeff, when it’s obvious (to me) that Steve purposely left Ricky Jones, out?\n212 Posted 11/09/2025 at 09:16:39\nDo you know what has just given me a big smile Christine? Funny, after reading the first line on your post@210, I genuinely thought you was replying to Alan Mc@207😂🤦♂️\n213 Posted 11/09/2025 at 09:25:24\nIt would have been a better post!\n214 Posted 11/09/2025 at 09:58:18\nHe had reffed a few of our pre-season games and I’d found him to be okay, because he let you have a little go at him, and he gave a bit back (which takes away a layer of what I’d describe as an obnoxious authority, that a lot of referees, seem to be born with) and he suddenly asked me who I supported.\nI told him I was an Evertonian, and he told me he was the ref, when Everton played Liverpool, at Wembley.\nI remember (think I remember!) saying fuck off mate, you’re winding me up aren’t yer? No I was the ref, I’m being honest he said.\nI thought you was alright, but how the fuck could you miss that handball? I'm not being funny, I know you’re not the best, but I didn’t have you down as being a cheating bastard as well, that decision was a fuckin disgrace.\nHe’d been okay but he suddenly changed and said to me, I’m going to make sure that your manager, knows that you’re a mouthy fucker, knowing full well how much Clough, (so therefore every member of the coaching staff) hated anyone disrespecting the referee.\nI remember saying something like, so not only are you a cheating bastard, you’re also a fucking grass… I used to fucking hate referees!\n215 Posted 11/09/2025 at 10:04:41\n216 Posted 11/09/2025 at 11:13:17\nDanny, I know WMDs existed, I have a Marine mate who was delivering them. Funny how they never found any though. Saddam must have used them all?\n217 Posted 11/09/2025 at 11:43:12\n218 Posted 11/09/2025 at 12:00:10\n\"Alright, this has become far too silly, let's end this before it becomes sillier\"\n219 Posted 11/09/2025 at 12:05:12\n220 Posted 11/09/2025 at 13:45:27\nI remember reading about how loads of hippies turned up at David Icke's house and started re-enacting a few of those very funny scenes from Monthy Phython, because everyone was laughing at poor David and thought he had completely lost the plot.\nIt would have been funny watching those hippies, probably tripping or just off their heads on Ecstasy, asking Icke how they should just “Fuck off” The End!\n221 Posted 11/09/2025 at 16:34:09\nInfluenza viruses are a very particular virus group. Influenza viruses commonly infect humans, chickens and pigs. I’ve not read anywhere that covid is likely to infect chickens or pigs, nor that any of the vaccines against covid were made using the same technology as the majority of flu vaccines.\nI can outline flu vaccine manufacture for you, which should explain that particularly bad flu season you are fixated on.\nThere is a certain amount of educated guesswork in the bespoke annual vaccine. It has to be bespoke because the flu virus is massively variable and so each years flu season is (unpredictably) dominated by a particular variant.\nHistorically flu viruses often first ‘emerged’ in South East Asia (due to the high population density of humans in relatively close contact with pigs and chickens) and then spread globally from the origin point. This makes flu both annual and seasonal as it tends to successively hit different parts of the world at specific times of the year.\nThat allows the vaccine manufacturers to make a tailored flu vaccine each year, but the same level of efficacy for each year’s vaccine cannot be guaranteed.\nWHO experts continually collate information on any outbreaks of flu that lead to hospitalisation and compare the burgeoning variants to their stock of historic variants. Their assessment of what the prevalent variant is most likely to be that year, and which three of the stocked historic strains should be blended to give the best possible level of immunity, is shared with the vaccine manufacturers (who also have a stock variants) who then start their annual manufacturing cycle.\nThe vaccine manufacturers have to produce the three variants that are ultimately to be blended. The seed virus has to be generated from the stock variants. Some strains are just more problematic to cultivate.\nSo the annual flu vaccine simply may not always be as effective as the previous year’s vaccine was, but influenza is a potentially very nasty and highly contagious disease and is a real threat to vulnerable parts of the population. It is better for those people to take what is available rather than just trust to luck that they don’t catch it. Some protection is better than none.\n222 Posted 11/09/2025 at 17:16:12\nStarmer is a wanker.\nStop the boats.\nThe media have lied to us for years.\nThat's my political view for the day.\nWell done to the Everton ladies. I watched some of it.\nRoll on Saturday and COYB\n223 Posted 11/09/2025 at 17:25:21\n224 Posted 11/09/2025 at 17:36:00\nCan I suggest we all meet up instead and deface a chalk horse on a hillside?\n225 Posted 11/09/2025 at 17:41:03\nCan we go with – it was known Everton were going to dominate Europe so let us get all English clubs thrown out for long enough that the team is broken up?\n226 Posted 11/09/2025 at 17:42:53\nSteve #202 - that would make a very good manifesto. I'd vote for that.\n227 Posted 11/09/2025 at 17:49:25\n228 Posted 12/09/2025 at 02:07:49\nI'll just end by adding my condolences and best wishes to Jake and his family to everyone else's.\n229 Posted 12/09/2025 at 06:41:38\n230 Posted 12/09/2025 at 10:52:32\nOut of interest, Everton Women have a player called Kenzie Weir who is David Weir's daughter.\nJust wondering if Neville Southall has a daughter… :)\n231 Posted 12/09/2025 at 10:55:40\nNeville Southall has a daughter.\n234 Posted 12/09/2025 at 11:11:10\n235 Posted 12/09/2025 at 12:31:49\n236 Posted 12/09/2025 at 12:43:59\n237 Posted 12/09/2025 at 19:37:19\n238 Posted 28/09/2025 at 22:31:53\nLooks like the curse of Goodison Park has rubbed off on them. This keeps up they may need to go back to Walton Hall Park!\nAdd Your Comments\nIn order to post a comment, you need to be logged in as a registered user of the site.\nOr Sign up as a ToffeeWeb Member — it's free, takes just a few minutes and will allow you to post your comments on articles and Talking Points submissions across the site.\nHow to get rid of these ads and support TW",
  "word_count": 10345,
  "scraped_at": "2026-02-14T12:43:44.938230"
}