{
  "article_id": "e01ce09df761",
  "url": "https://saturdayblitz.com/uga-teammate-reacts-to-carson-beck-leaving-athens-transferring-to-miami",
  "title": "UGA teammate reacts to Carson Beck leaving Athens , transferring to Miami",
  "date": "20250315T150000Z",
  "domain": "saturdayblitz.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Carson Beck’s time in Athens has officially come to an end, and Georgia fans are still processing the news.\nBeck entered the transfer portal and is now in Miami for his final year of eligibility. While the move caught some by surprise, it didn’t take long for speculation to swirl about his motivations—including a connection to his girlfriend at the time, Miami women's basketball player Hanna Cavinder, though there are rumors the two have broken up now.\nWhile Georgia moves forward without him, one of Beck’s former teammates and close friends, offensive lineman Tate Ratledge, shared his perspective on the departure.\n“Carson has the opportunity to be the top quarterback coming out next year,” Ratledge said via Athlon Sports. “I mean, he’s shown it before. He just had a little bit of an off year this year, and that’s nothing against him. But I think him going down there is a great place for him to go rebound from what happened last year and have a great season.”\nIn 2023, Carson Beck threw for 3,941 yards with 24 touchdowns and six interceptions. His 2024 season, however, saw some regression—3,485 yards, 28 touchdowns, and 12 interceptions, with his passer rating dipping to 145.3.\nHis final game in a Georgia uniform ended in disappointment after suffering a UCL injury in the SEC Championship, forcing him to miss the College Football Playoff. Gunner Stockton stepped in for the Bulldogs, and with Beck now gone, the quarterback room in Athens will look very different heading into next season.\nMeanwhile, Miami is welcoming Beck with open arms, hoping he can revitalize his game and get health this season.\nHis former teammate has no doubt he’ll thrive in his new environment. “I think him going down there is a great place for him,” Ratledge added. “I expect a great season from him.”\nRight now, we'll be interesting to see just how much work Carson Beck does in the spring in Miami. Though coaches have said that he is on the road to recovery, there are still reasons to believe he might not even be cleared to throw or do anything significant this spring, which — for obvious reasons — would not be ideal for Miami in trying to break in a new quarterback.",
  "word_count": 377,
  "scraped_at": "2026-02-14T13:18:44.809473"
}