{
  "article_id": "e02fb0e3c2d5",
  "url": "https://www.cardchronicle.com/2023/1/20/23564069/friday-afternoon-cardinal-news-and-notes-louisville-cardinals",
  "title": "Friday afternoon Cardinal news and notes",
  "date": "20230120T221500Z",
  "domain": "cardchronicle.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "—Here’s the CJ’s recap of the U of L women’s basketball team’s Thursday night triumph over Boston College.\nFriday afternoon Cardinal news and notes\nGame one in Atlanta can’t get here soon enough.\n—Highlights from the win over BC are here.\n—ESPN’s Leonard Solms gives us some background on new Cardinal Emmanuel Okorafor, who had to travel a ridiculous amount of distance to jumpstart his basketball career, and who picked Louisville in large part because he was inspired by Jordan Nwora.\n“Jordan Nwora is a Nigerian, so he left a big legacy there in Louisville and him being a Nigerian makes me realise that I can do great things at Louisville... He influenced me and inspires me to do good also,” Okorafor told ESPN, also highlighting the experience of coach Kenny Payne as a decisive factor in his choice.\n...\nOkorafor is no stranger to taking the road less travelled. In 2019, when he was growing up in Festac, he was noticed by Educational Basketball, a program run by brothers Iseolupo and Olutobi Adepitan.\nIt often took up to three hours for Okorafor to travel to Victoria Island by motorbike and then bus - and he still had to complete the journey to the courts on foot. However, he had made his mind up about what he wanted and nothing could stand in his way.\n“From my house to where we train is up to three hours. We practiced, I think, four times in a week. Because of how far it was, I would leave my home at six o’clock [in the morning]. I had to take multiple buses to get there... up to three buses,” Okorafor recalled.\nBalancing this with school was naturally a challenge. Thankfully, Okorafor was able to move into a highly structured learning environment at the NBA Academy in Saly, Senegal, reaching heights that the Adepitan brothers never doubted he could scale.\nWhen asked what set Okorafor apart at Educational Basketball, Olutobi Adepitan told ESPN: “First and foremost, we definitely have to commend his resilience.\n“He was coming from Festac two hours and 30 minutes away on days when there was not really traffic - and on days there was traffic, he was coming from three hours away. We would typically finish workouts at around 5:30 [or] 6 [pm], so he wouldn’t get home until 10.\n“Outside of that, his skillset, his versatility, his skillfulness with the ball at his feet. We just saw him and knew that he was going to use basketball as a tool to bless his family and take his life forward.”\nI’m not sure how much of a difference Okorafor can make in these last 12 games, but that’s one hell of a story and I hope he crushes it here.\n—Notre Dame men’s basketball coach Mike Brey officially announced at a press conference this morning that he’ll be stepping down at the end of this season.\nHe kicked off the presser in vintage Brey form.\n—Chris Holtmann and Micah Shrewsberry are among the names being tossed around as Brey’s potential replacement.\n—Rick Pitino is also receiving some buzz in South Bend ... assuming he can be absolved of sin before signing a contract.\n—Kenny Payne has extended a scholarship offer to Milwaukee Wisconsin Lutheran small forward Kon Knueppel, billed as one of the best shooters in the class of 2024. The 6’5 guard/forward is the No. 72 overall player in the class according to 247 Sports.\n—The San Antonio Spurs have signed Gorgui Dieng to a second 10-day contract.\n—The full list of underclassmen declarations for the 2023 NFL Draft has been released.\n—HVL is the queen of the DHO.\n—Three-star Taylor County offensive tackle Hayes Johnson (2024) will announce his college decision next Thursday. Johnson is down to Louisville, Kentucky, Tennessee, Michigan State and Baylor.\n—Kenny Payne has offered four-star guard Jasper Johnson (2025) from Woodford County High School.\n—The U of L swimming teams will take on Kentucky this weekend.\n—Jeff Walz gets it.\nWalz also confirmed after last night’s win that upper level tickets will be sold for Sunday’s showdown with new ACC rival NC State.\n—Louisville has offered Desmond Jackson (2024), an offensive tackle from North Carolina.\n—Five-star guard Trentyn Flowers (2024) says Louisville’s culture and long history are what have him the most interested in potentially playing for the Cardinals.\n—Friday Irrelevance, triple (quadruple?) helping:\n—Mark Wahlberg will be in town signing tequila bottles this weekend.\n—The Ringer’s 2023 NBA Draft guide is already out.\n—The U of L hockey team is hosting Kentucky this Saturday at Iceland. If you can’t make it to the game, you can catch a live stream with Sean Moth and Nick Valvano on the call.\n—Racing Louisville has extended the contract of goalie Katie Lund.\n—Eric Crawford shares his thoughts on U of L’s win over Boston College.\n—Five-star class of 2024 wing Karter Knox talks about the schools currently recruiting him the hardest, including Louisville.\nKentucky: “I got a good relationship with Coach Cal (John Calipari). He coached my brother, you know, he was able to get Kevin out of his comfort zone and develop. So it’s like family. That offer was important, I was happy and excited when it came through, through the roof.\n“Our talks now are like family; he’s known me since I was eight or nine years old. So it’s good whenever I get to see him and talk to him.”\nLouisville: “It’s a good program with a lot of history. They’re not doing great this year, but they have great facilities, and their fan base is great. Things are looking up over there. Me and Coach (Kenny) Payne got a really close relationship. You know, he coached my brother at Kentucky and with the Knicks, so we are kind of close like family.”\n—The Baltimore Ravens are getting a new offensive coordinator, and if they want to keep Lamar Jackson and keep him happy, it needs to be an OC that Jackson sees eye to eye with.\n—And finally, the Mike Rutherford Show will wrap up the week from 3-6 this afternoon on 1450/96.1. You can stream the show here.",
  "word_count": 1027,
  "scraped_at": "2026-02-14T14:22:53.178687"
}