{
  "article_id": "e068fbb3a61b",
  "url": "https://nationalnetworkonline.com/2023/05/29/governor-wike-eight-years-of-unparalleled-leadership-and-birth-of-new-rivers-state/",
  "title": "Governor Wike : Eight Years Of Unparalleled Leadership And Birth Of New Rivers State",
  "date": "20230529T090000Z",
  "domain": "nationalnetworkonline.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Governor Wike: Eight Years Of Unparalleled Leadership And Birth Of New Rivers State\nIn every dispensation, there are men, women and even child prodigies whose names are etched on the marble.\nThey are celebrated by posterity long after they are gone.\nThey call them world changers!\nThe list is endless but mentioning a few would suffice.\nMohandas and Gandhi, popularly known as Mahatma Gandhi, was a political and spiritual leader who played a pivotal role in India’s struggle for independence from British rule. His philosophy of non-violence and emphasis on truth, justice, and equality continue to resonate globally.\nNelson Mandela was a South African anti-apartheid revolutionary and politician who served as the President of South Africa from 1994 to 1999.\nHe played a pivotal role in ending the apartheid regime and promoting racial reconciliation in South Africa.\nMandela’s leadership and commitment to non-violence were instrumental in bringing about a peaceful transition from minority rule to a multi-racial democracy.\nSir Winston Churchill was a British statesman who served as the Prime Minister of the United Kingdom during World War II. Churchill’s leadership and oratory skills played a crucial role in rallying the British people during the darkest days of the war and inspired them to stand firm against Nazi aggression.\nThese are some of the men who entered history books for the right reasons – significant impact in the society.\nAs Nigeria embarks on another ‘Change of Guards’ on Monday, May 29, 2023, it behoves on the citizenry to take a moment and separate the wheat from the chaffs.\nAt the end of the day, it will be discovered that while some of the outgoing governors who masqueraded as leaders, very sadly, added to the miseries of their people, some others defended their mandate by making the desired impact.\nThe people of Rivers State are blessed to be counted in the category of states whose Governor falls in the latter.\nIt is no gainsaying that Chief Barr Nyesom Ezenwo Wike, CON, GSSRS, LIFE BENCHER who piloted the ship of the state from 2015 – 2023, delivered unparalleled leadership to Rivers people.\nHis eight years tenure has been marked by numerous achievements and positive changes that have immensely benefited Rivers people in various ways.\nHere are some examples of his exceptional leadership:\nUnder Governor Wike’s leadership, the State has experienced remarkable economic growth.\nHe implemented policies and initiatives that attracted businesses, stimulated job creation, and boosted investments.\nAs a result, unemployment rates decreased, and the state’s economy flourished.\nObviously, infrastructure development is the hallmark of Governor Wike administration. The governor recognized the importance of modern infrastructure for the State’s progress and took significant steps to improve it.\nHe launched ambitious infrastructure projects like constructing a whooping thirteen flyover bridges, road constructions, expansions, bridges and innovative public transportation systems.\nThese initiatives enhanced connectivity and improved the overall quality of life for Rivers people.\nNo wonder these efforts paid off and earned him recognition from Vice President Yemi Osinbajo who named him “Mr. Projects” with a recent presidential award of “Infrastructural Icon of Nigeria” from the Presidency.\nGovernor Wike is a proud recepient of the prestigious Power of Sports (Africa) award, a testimony to his passion in sports infrastructure which received a major boost in the eight years of his administration.\nTo ensure that Rivers State stamps its authority in Nigerian football, the two professional clubs namely: Sharks FC and Dolphins FC were merged into Rivers United FC.\nThe result was an impressive dominance in the Nigerian Professional Football League that has seen “The Pride of Rivers” (as Rivers United is known) winning the NPFL in 2011, the first NPFL title by a Rivers based side since the Dolphins won in 2011.\nWith adequate funding from government, Rivers Angels of Port Harcourt has also won the National Women League a record five times and 8 times as Federation Cup champions.\nGovernor Wike has prioritized the development of sports by partnering with Spanish Giants, Real Madrid FC and established the Real Madrid Football Academy in Port Harcourt to train budding youths to become future soccer kings.\nTo ensure that other sports are also developed in the state, Governor Wike has breathed life into Rivers Hoopers Basketball Club and the club has become a major player in the nation’s basketball league.\nGovernor Wike prioritized education and worked tirelessly to improve the state’s education system.\nHe increased funding for all the tertiary institutions in the states, introduced innovative programmes, and implemented policies to raise academic standards.\nTheir efforts resulted in higher graduation rates as Rivers owned schools do not participate in nationwide strikes, improved student performance, and better opportunities for the youth.\nThe governor championed healthcare initiatives that aimed to provide better access to affordable and quality healthcare for Rivers people.\nHe also invested in healthcare infrastructure by providing doctors with standard residential quarters\nThese efforts improved healthcare outcomes, reduced healthcare disparities, and increased the overall well-being of the state’s population.\nGovernor Wike was committed to environmental protection and sustainability. He implemented policies to reduce carbon emissions, promote renewable energy sources, and conserve natural resources.\nHe most recently tackled the case of black soot which threatened the lives of residents by issuing marching orders to Local Government Chairmen where illegal oil bunkering was being carried out.\nThese initiatives led to cleaner air, improved water quality, and a greener future for the state.\nThroughout his 8 years tenure, Governor Wike demonstrated fiscal responsibility by managing the state’s budget effectively.\nHe implemented measures to reduce wasteful spending, streamline government operations, and improve financial accountability.\nHis prudent fiscal management ensured that taxpayers’ monies were utilized efficiently and effectively.\nDuring his time in office, Governor successfully navigated through various crisis, such as inter-communal crisis, economic downturns, and public health emergencies. His proactive approach, effective coordination with relevant agencies, and swift response to emergencies helped minimize the impact on the state and ensure the safety and well-being of Rivers people.\nTo mitigate the tide of chieftaincy agitations and bring lasting peace in rural communities, Governor Wike upgraded and recognized many chieftaincy stools to first and second classes respectively.\nGovernor Wike implemented policies to attract businesses and foster a favourable environment for job creation.\nHe provided a peaceful environment for companies to invest in the state, streamlined regulations, and offered resources to support entrepreneurship and small business growth.\nAs a result, new job opportunities were generated, and the state’s economy thrived.\nUnder Governor Wike many gained employment, and salaries and entitlements of civil servants were promptly paid.\nGovernor Wike is bowing out after 8 successful, remarkable, memorable and glorious years in office happy, and without owing civil servants.\nOn the Legislature and Judiciary, Governor Wike built standard quarters for Judges as well as members of the State House of Assembly.\nThe governor who received several awards for excellent performances from within and outside the country touched on other sectors that time and space may not permit their mention.\nChief (Barr) Nyesom Ezenwo Wike”s eight years of unparalleled leadership has left a lasting impact on the state.\nHis achievements in economic growth, infrastructure development, education reform, healthcare initiatives, environmental stewardship, fiscal responsibility, crisis management, and collaborative governance have made a positive difference in the lives of the Rivers people and positioned the state for a prosperous future.\nOverall, Governor Wike’s unwavering dedication, visionary leadership, and remarkable achievements over the course of eight years have transformed the state in various domains.\nHis legacy will be remembered as a period of progress, inclusivity, and prosperity for the state and its people.\nWritten by Bro Felix Obuah, the immediate past PDP Chairman, Rivers State/Sole Administrator, Rivers State Waste Management Agency and also served as Director General, New Rivers PDP Campaign Council.",
  "word_count": 1284,
  "scraped_at": "2026-02-14T12:14:56.533514"
}