{
  "article_id": "e07e93359cfe",
  "url": "https://www.lusakatimes.com/2024/11/14/faz-player-status-and-transfer-committee-orders-trident-to-pay-ex-coaches-for-breach-of-contract/",
  "title": "Zambia : FAZ Player Status And Transfer Committee Orders Trident To Pay Ex - Coaches For Breach Of Contract",
  "date": "20241114T034500Z",
  "domain": "lusakatimes.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "The Football Association of Zambia (FAZ) Player’s Status and Transfer Committee has made multiple rulings on outstanding cases concerning players and coaches among them the case involving former Trident FC coaches Albert Kachinga and Joseph Musonda.\nAccording to the decision by the full bench of the committee headed by Mwansa Kapyanga, Trident FC was found guilty of terminating the contracts of the two coaches without just cause and ordered that they be compensated for the\nfull value of their contracts of employment.\nFacts of the matter were that Kachinga and Musonda entered into contractual agreements with Trident F.C to serve as Head Coach and assistant for the respondent respectively.\nThe contracts were for a duration of One (1) year nine (09) months from 5 th October, 2023 to 30 th July, 2025.\nIt was unilaterally terminated on March 11, 2024 citing poor performance.\nHowever, before the expiry of the contracts the respondent terminated the contracts on the basis of the alleged poor performance by the coaches.\nThe committee considered whether the complainants had been engaged by any club to work as professional coaches after the termination of their contracts by Trident Football Club at the time of their complaint and adjudication of the\nmatter.\nIt was found that they had not signed any other professional contracts with any club since termination and ordered that they be compensated for the total sum of the remainder of their contracts which were terminated prematurely.\nIn another matter, the Football Association of Zambia Player’s Status and Transfer Committee also ruled that player Bertha Kashinga, was free to join a professional club of her choice after winning her case against ZISD Women FC\nwho were hindering the movement of the player to a professional club of her choice as an amateur.\nThe committee also ruled that Priscilla Namwiinga was granted her right to leave Elite Ladies and join a club of her choice.In the case of Joseph Chewe versus Indeni where the player reported the club for unfair termination of employment, the Player’s Status Committee ruled that they could not adjudicate on the matter as the player had already taken the\nmatter to an ordinary court of law which abrogated the FAZ and FIFA statutes.\nThe committee directed the player’s representative to advise its client of the infringement of FAZ constitution in reference to Article 6l and 62 of the FAZ Constitution.\nIn the case of Paul Banda versus Forest Rangers the committee threw out the claim for gratuity by the player from Forest Rangers where he was engaged on loan from Power Dynamos.\nForest Rangers were found not guilty of failure to meet its financial obligations as the player negotiated a separate deal after the club-to-club arrangement was finalized. The said loan deal had no provision for gratuity.\nOn the case of Mike Banda who invoked action against Lumwana Radiants for unfair termination, the committee ordered the club to compensate the player for the remainder of the contract that was prematurely terminated. The player\nreceived neither warning nor notice prior to termination of the contract.\nIn its ruling, the committee ruled that the demanded K230, 000 be awarded to the player covering the remaining period of the contract.All parties have a right of appeal on the rulings by the committee.FAZ general secretary Reuben Kamanga has paid tribute to the committee for making sure that cases are cleared within time.\n“The committee deserve commendation for making sure that cases that border of players and coaches are cleared within time. This is the standard we want to uphold for all our judicial bodies,” says Kamanga.\nFor and on behalf of:\nFOOTBALL ASSOCIATION OF ZAMBIA\nSydney Mungala\nCOMMUNICATIONS MANAGER",
  "word_count": 612,
  "scraped_at": "2026-02-14T13:18:07.315442"
}