{
  "article_id": "e08823b5671a",
  "url": "https://www.irishtimes.com/politics/2025/12/27/miriam-lords-political-awards-of-2025/",
  "title": "The brass neck , the survivor , the cringe event : Miriam Lord 2025 Political Awards – The Irish Times",
  "date": "20251227T070000Z",
  "domain": "irishtimes.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Is it over already?\nThis has been a strange political year, dominated in the opening months by a huge row over the Opposition’s speaking rights in Dáil Éireann.\nThe ongoing drama of the presidential election sucked much of the oxygen out of the rest of it.\nOireachtas committees didn’t get going for months, reducing the usual unhurried pace of work to a slow crawl.\nREAD MORE\nWith so much distraction happening outside the chamber, the new intake of TDs following the November 2024 general election had little chance to shine.\nLeaders’ Questions was a hit-and-miss affair, with Taoiseach Micheál Martin and Tánaiste Simon Harris (minister for foreign affairs for most of the year) frequently unavailable for duty due to commitments overseas.\nThe same issues depressingly dominated: housing, the cost of living, and health.\nThe Government will be glad to see the back of this year.\nFine Gael suffered a humiliating presidential election, but it was nothing compared to Fianna Fáil’s unmitigated catastrophe.\nThe Opposition will be happier, closing out the season with a President in Catherine Connolly now settling into the Phoenix Park, supported by a rare alliance of the left, and an unpopular Fianna Fáil-Fine Gael Coalition battling to come off the ropes on the bread-and-butter issues.\nAnyway, here’s a few awards to round it all off.\nPolitician of the Year\nThere are no obvious winners. But Fianna Fáil Minister for Justice Jim O’Callaghan gets the nod.\nThe barrister from Dublin Bay South had a good year, emerging as a credible leadership contender, while the close involvement of deputy party leader Jack Chambers in the fiasco around Jim Gavin’s presidential candidacy for the party threw his prospects of succeeding Micheál Martin hugely off-course.\nAn understated politician, O’Callaghan kept his counsel on Gavin’s candidacy, and was the last senior Fianna Fáil Minister to give him his backing.\nHe held the line, but that delay spoke volumes.\nO’Callaghan performed well when standing in at Leaders’ Questions, answering questions directly and with a minimum of jargon, and he hasn’t shied away from the thorny issue of immigration.\nHis statements have drawn a very mixed political reaction but are likely to hit home more favourably with voters.\nThen there was his entertaining speech at the annual journalism awards, showing that he isn’t afraid to poke fun at himself (or his famous sister, Miriam O’Callaghan) or the hacks who write about him.\nHonourable mention goes to Minister for Health Jennifer Carroll MacNeill, who isn’t afraid to make waves in the notoriously difficult Department of Health.\nSinn Féin leader Mary Lou McDonald was right when she said her party’s role in the presidential election would be a game-changer. The party didn’t field a candidate, but embracing the Connolly campaign to complete an alliance of the left really was the clincher for Connolly.\nBest Political News\nThis was Richard Boyd Barrett’s return to the fray after his successful cancer treatment.\nAll sides welcomed the People Before Profit–Solidarity TD for Dún Laoghaire back.\n“We never thought we’d miss you so much,” smiled Minister of State Michael Healy-Rae, who very seldom agrees with anything RBB has to say.\nDealmaker of the Year\nThis award goes to veteran Tipperary Independent TD Michael Lowry. He’s the bad penny of tribunals past, who was once described by Micheál Martin as unfit to be a TD (until he proved indispensable to him in January by providing a bulwark of loyal Independents who signed up to keep his Government comfortably in power in return for unspoken constituency goodies).\nHe also swung the Ceann Comhairle’s job for Verona Murphy, the Independent TD for Wexford, in return for the group’s backing.\nBrass Neck Award\nThe winner here is Michael Lowry (again), for cooking up a wheeze whereby those members of the Regional Independent Group who didn’t bag a junior or super-junior ministry would be allowed to ask questions of the Government during Opposition speaking time, even though they were nailed-on supporters of the Martin-Harris Coalition.\nGesture Politics Masterclass of the Year\nIt’s Michael Lowry, for arrogantly giving the two fingers to Paul Murphy of People Before Profit-Solidarity when his speaking rights concession was pushed through by the Government in the face of Opposition fury. He explained unconvincingly that he was “beckoning” at him to sit down, by sticking up the V sign.\nSurvivor of the Year\nAt the beginning of 2025, Taoiseach Micheál Martin was in a good place, leading his party back into Government with a 10-seat cushion over Coalition partners, Fine Gael. After 14 years at the helm, his position at the top of the Fianna Fáil tree seemed unassailable.\nCome the year’s end and he is embroiled in an internal controversy over the party’s (his) disastrous decision to run Gavin, the former Dublin GAA supremo, as Fianna Fáil’s candidate for president.\nAnother survivor is Verona Murphy, the Dáil’s first woman Ceann Comhairle. She endured a baptism of fire when she ascended the Chair, faced with an Opposition in open revolt over the Lowry speaking rights stroke. At the height of the mayhem, questions were asked about her suitability for the role and there were even whispers that she might throw in the towel.\nShe has settled nicely into the job now.\nDodge of the Year\nSinn Féin leader Mary Lou McDonald and her party.\nThe annual trip to America is a big-bucks big deal for Sinn Féin. And no better woman than Mary Lou and assorted republican heroes to schmooze the moneybags Irish-American business bosses who want to reunite Mother Ireland with her fourth green field.\nShe was happy to lambast a clearly uncomfortable Taoiseach for playing along with Trump’s simplistic take on Ireland’s housing crisis during his visit to the Oval office, and for not confronting him about his stance on the war in Gaza.\nBut she wasn’t so pleased when Micheál Martin hit back by saying that at least he had the gumption to travel to America for the St Patrick’s Day events in Washington, when she didn’t take the same opportunity to tackle her party’s conservative-minded benefactors about Gaza.\nCringe Event of the Year\nThat would be Micheál’s aforementioned US visit, tiptoeing on eggs into the Oval Office and gingerly perching himself on the seat next to President Trump, hoping he wouldn’t upset his volatile host and assembled sycophants.\nWith memories of the disgraceful bullying of Ukraine’s Volodymyr Zelenskiy still fresh, we watched through splayed fingers as the awkward meeting played out and heaved a sigh of relief when the Taoiseach finally escaped unscathed, his dignity – if not his nerves – intact.\nSenator of the Year\nLynn Ruane, the Independent Senator, for throwing the most magnificent strop in the Seanad chamber when calling out the Government side for its creative interpretation of the voting rules during the debate on the Defamation Bill.\nVotes are strictly timed, with Senators given a set number of minutes to get to the chamber and cast their vote. Those who arrive late find the doors closed and locked, as Senators such as Lynn frequently find out to their cost.\nBut Lynn spotted what she believed were Seanad shenanigans when she saw Government Senators arriving in for the vote after the time limit. The excuse eventually given was that there was nobody in the Chair to conduct it.\nLynn vigorously argued that the absence of Maria Byrne, the Leas-Chathaoirleach, allowed Government reinforcements to arrive in the chamber to win the vote.\nNonetheless, why hadn’t the doors been locked? Maria could have made her way in through a different door.\nThis was unprecedented, thundered Senator Ruane, backed by the equally incandescent Alice-Mary Higgins and Eileen Flynn.\nSuch a “mix-up” is unlikely to happen again.\nGastronomist of the Year\nKen O’Flynn, the Independent Ireland TD for Cork North Central, caused consternation among the hard-working catering staff in Leinster House when his guest – a social media big hitter who runs a food truck in Cork and has a huge audience for his online reviews of fast food establishments – filmed his trip to Kildare Street and posted it online.\nDeputy O’Flynn’s party, including social media star Richie Herlihy, toured Leinster House before dining in the Members’ Restaurant.\nFilming is not allowed in public areas, although visitors often take discreet photographs to mark their visit. Ken’s guests brought a camera, microphone and tripod, and set it up at their table.\nAmong other pronouncements, Richie Herlihy described the food as “absolute garbage” and “absolute s***e” and said the chicken was as tough as a badger’s arse.\nHe said while the politicians he met during his visit were very nice, “I’ve to wash the smell of vermin out of my f***ing suit after being in there because of all of the other rats that do be in there.”\nMattie McGrath brought the incident to the floor of the Dáil, calling on an unrepentant Deputy O’Flynn to apologise to the staff, while the Regional Independents Group lodged a complaint with the Oireachtas authorities.\nEven the Taoiseach got involved. “People who visit the Oireachtas should respect the institutions of the House,” he remarked.\nAsk us anything: presidential nominations, a Minister for Defence and the centre holding\nFashion Awards\nTánaiste Simon Harris’s bucket hat at the Oasis concert.\nSinead Gibney of the Social Democrats underlining her commitment to the Palestinian cause by disclosing that she gets the Palestinian flag painted on her nails, leading to some wags dubbing her “Nailson Mandela”.\nThe lovely dickie bow worn by her party colleague Eoin Hayes at a social protection committee meeting.\nThe women Senators and TDs from Sinn Féin who wore shorts in the Dáil and Seanad in solidarity with the women camogie players who launched a successful campaign to scupper the ridiculous rule that they must play in presumably more ladylike “skorts”, when they actually wanted to wear more comfortable, practical, shorts.\nThe Bad Winner and President for All of Ireland Award\nThis goes to socialist Ruth Coppinger, who was disgusted by the sight of Government politicians queuing up to have their photograph taken with President Connolly after her inauguration at Dublin Castle.\nShe was the left’s candidate. How dare they?\nThe How to Do it Properly and Lose Gracefully Award\nBeaten Fine Gael candidate Heather Humphreys, who wasn’t up to the cut and thrust of a bruising presidential election and wasn’t helped by her party’s lacklustre campaign, was the epitome of graciousness when congratulating “my President” Catherine Connolly.\nThe president-elect was equally gracious and magnanimous in victory, inviting her erstwhile rival to the Áras for gin and elderflower tonic.\nThe Best Welcome Back to Work Award\nThis goes to Eoin Hayes of the Social Democrats, who was finally repatriated following a long spell on the Independent benches after he was cast out for giving the wrong information about when he disposed of shares in a tech firm with business links to the Israel Defense Forces.\nWhen party leader Holly Cairns returned from maternity leave in the autumn, her first public outing at the party’s think-in for the forthcoming Dáil session was overshadowed by questions about Eoin’s embarrassing blackface incident from 16 years ago when he dressed up as Barack Obama for a Halloween party.\nDancing with the Tsars\nThe Taoiseach never tires of telling the people that housing is the biggest issue facing the Government today and its number one priority, so there was some puzzlement when he entrusted the housing portfolio to the inexperienced James Browne in his first Cabinet job.\nBrowne has action plans coming out of his ears. One of his biggest projects is the Housing Activation Office, which “will do what it says on the tin” with the “agility to troubleshoot” and get shovels into the ground.\nIt would be headed up by a housing tsar. The Minister said on radio that his choice to run it was Brendan McDonagh, the handsomely remunerated head of National Asset Management Agency (Nama).\nBut why hire a fancy tsar when he is the boss of a whole Government department dedicated to fixing the housing crisis? And how could he be on such a big salary when people are scrimping and scraping to put a roof over their heads, and why wasn’t Fine Gael properly consulted before he spoke out of turn on radio?\nOnce the row got going, wise owl Brendan surveyed the scene and sensibly withdrew.\nStand Clear... it’s a Gusher!\nOne of the most mortifying aspects of the Jim Gavin debacle was the way Fianna Fáil’s senior Ministers rushed out to support their leader’s, eh, inspired choice and laud an untested and ill-equipped candidate as a star in the making.\nMinister for Children Norma Foley, a Kerry woman, outdid them all with her effusive welcome for the former Dublin GAA manager.\n“We would be blessed beyond measure to have him as a Fianna Fáil candidate and ultimately as president,” she gurgled of the former Air Corps pilot. “Service is the hallmark of a good president… We need a president of the time and of the now.”\nAnd that wasn’t Jim.\nMost Memorable Phrases of the Year\nAg Insint Bréaga.\nThat was when Sinn Féin went ballistic over the Taoiseach accusing Mary Lou McDonald of telling untruths. He said it in Irish, so it took a took a while for the penny to drop.\nSmear the bejaysus out of her!\nPodcaster and professional big mouth Ivan Yates, a Fine Gael minister in a long-gone former life, suggested what tactic the party should adopt to halt the runaway popularity of Independent presidential candidate, Catherine Connolly. Her team immediately accused Fine Gael of launching a smear campaign, even though the party had nothing to do with it.\nCab Rank Rule\nThis is when everyone became an expert on rules governing lawyers’ conduct. Did ardent socialist Catherine Connolly act for banks evicting people from their homes when practising as a barrister and, if she did, could she have found her way out of accepting these briefs?\nOr was she absolutely bound by the “Cab Rank Rule”?\nThe winner is Ceann Comhairle Verona Murphy, at the end of her tether at the height of the Dáil furore over Michael Lowry’s speaking rights stroke, as Opposition and Government TDs took lumps out of each other.\n“You’re making a holy show of yourselves!” she said.\nBest Oireachtas Bike Shed Tribute Act\nThe 14 steps and fancy ramp at the entrance to Deer Park in Mount Merrion, south Dublin. (More than €750,000, it cost).\nLast minute dot-com\nCatholic campaigner Maria Steen and Iona Institute spokeswoman Maria Steen pitched up in the dying days of the presidential campaign, expecting to secure the 20 signatures required from Oireachtas members to get on the election ballot.\nA feverish telephone and email blitz of possibly sympathetic politicians didn’t produce the goods, despite the concerted efforts of people such as Aontú’s Peadar Tóibín and Senator Rónán Mullen.\nThis disgraceful outcome was apparently everyone else’s fault – and not Maria’s.\nHer failure to put in the preparatory work was her undoing. And it did not constitute, as some more hysterical acolytes would have it, the death of democracy.\nInanimate Object of the Year\nMaria Steen’s massively expensive blue Hermès Kelly handbag. She carried it on her arm during her press conference outside the Dáil while expressing her hurt and disappointment at being denied a place on the ticket.\nClever Maria apparently knew that the left-wingers would pick up on the cost of her bag (as opposed to reading tweets about it from drag artist Panti and others in the know).\n“The handbag was deliberate,” she told Irish Times political correspondent Ellen Coyne in an interview. “I wanted to expose the hypocrisy of the left who don’t love the poor; they just hate the rich.”\nKeepy Uppy/Fancy Footwork Award\nPresident Catherine Connolly, despite predictions to the contrary, hasn’t said anything controversial yet.\nThe video of her showing off her football skills went viral during the presidential campaign, but her fancy footwork when it came to smoothly and articulately avoiding hard questions again and again also stood to her.\n“I’ve never avoided a question in my life,” she said during one of the TV debates, a line which caused much hilarity among reporters waiting outside RTÉ for the usual post-debate comments, only for her to ignore their questions and walk straight past them.\nForgotten Election of the Year\nSeanad elections – with every twist and turn followed by hardly anyone.\nPhoenix Award\nFormer Labour leader Alan Kelly had something of a renaissance this year, scoring well with Garda-related issues and clearly enjoying his chairmanship of the lively Oireachtas media committee.\nHis robust rejection of Labour’s support for former member Catherine Connolly will have pleased the old guard within the party, but Ivana Bacik’s backing of the independent TD saw her on the winning side, which is always the place to be in politics.\nWinners of the Year\nThe standout here has to be President Connolly.\nBut Fianna Fáil MEP Billy Kelleher bucked the miserable trend for his party by having a great presidential election. He spoke out against the leadership’s lack of consultation with the parliamentary party over candidate selection. When Jim Gavin was presented as the Taoiseach’s choice, he offered himself as an alternative and performed strongly in the run-off against the former Dublin GAA manager.\nWhen the Gavin campaign imploded early on, Billy resisted the urge to crow – his enhanced reputation within the party was consolation enough.",
  "word_count": 2904,
  "scraped_at": "2026-02-14T14:19:20.433872"
}