{
  "article_id": "e09dbce26052",
  "url": "http://www.bignewsnetwork.com/news/278838402/lunchbreak-the-athletic-ranks-vikings-positions-of-need-for-2026",
  "title": "Lunchbreak : The Athletic Ranks Vikings  Positions of Need  for 2026",
  "date": "20260129T191500Z",
  "domain": "bignewsnetwork.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Lunchbreak: The Athletic Ranks Vikings 'Positions of Need' for 2026\nLindsey Young\nThe Panini Senior Bowl practices are wrapping today ahead of Saturday's game in Mobile, Alabama, the East-West Shrine Bowl took place Tuesday in Texas, and in a few short weeks the NFL Combine will kick off in Indianapolis.\nAs the Vikings brass is hard at work evaluating NFL hopefuls, Alec Lewis of The Athletic weighed in on Minnesota'sbiggest NFL Draft priorities. Worth noting is the article focuses solely on draft options, meaning Lewis' list isn't necessarily his overall ranking of need.\nThat being said, in looking at options in this year's draft, Lewis called cornerback the most important and wrote the following:\nFinding a young cornerback is paramount this offseason. Byron Murphy, Jr., is under contract for the next two seasons, and Isaiah Rodgers is secured through 2026. Behind them, the depth is a complete question mark.\nBecause [Defensive Coordinator] Brian Flores tends to play with multiple safeties, the Vikings can get away with less talent at this position. But they would stand to benefit from incorporating more man coverage and match concepts.\nMinnesota was fortunate with the health of Murphy and Rodgers in 2025. Expecting both to start all 17 games next season would be taking a big risk.\nCornerback is certainly a spot that could make sense near the top of the draft, where the prospects are most explosive.\nAfter corner, Lewis looked at interior defensive line.\nMinnesota last spring added two veterans to the position group in free agency, signing Jonathan Allen and Javon Hargrave, but Lewis noted \"neither became the dominant force the franchise hoped they'd be.\" He opined the Vikings should use the draft to find \"more depth and playmaking\" for the d-line.\nLewis put safety next on the list but acknowledged Minnesota could also address the position in free agency.\nFrom a sheer positional need perspective, this could be higher on the list. But, as we've documented over the last few years with Flores manning the operation, the safety spot is the hub of communication for the Vikings defense. Safeties make calls on the field. Safeties orchestrate coverages on the back end. Asking a rookie to do that would be a tall order.\nThere are a handful of experienced safeties available in free agency. When the Vikings clear up cap space, that's one of the more likely free-agent priorities.\nThat said, in the long run, Minnesota would benefit from getting a younger, more explosive prospect in the pipeline. Jay Ward, who had some positive moments at the end of the season, will be entering the final year of his rookie contract. Another safety waiting in the wings would be nice.\nAfter safeties, Lewis said the Vikings should prioritize the following positions in this order: tackle, edge rusher, center, running back, tight end.\nLewis expects Minnesota to have a new center in 2026 after Ryan Kelly missed significant time with concussions but isn't confident this year's addition will be found in the draft.\nThe Vikings haven't drafted and developed a late-round, multiyear starter on the offensive line since Brandon Fusco in 2011 and John Sullivan in 2008. Turning the tide on that front would go a long way toward helping the Vikings build an optimal roster.\nClick hereto read Lewis' full article.\nJared Allen, T.J. Hockenson & George Kittle backing new pro curling league\nFollowing his Hall of Fame football career, Vikings Legend Jared Allen picked up a new sport in curling, trading in the gridiron for an icy playing surface.\nNow, Allen is bringing along two of his Nashville-area neighbors to back a new pro curling league aiming to engage fans beyond the Winter Olympics every four years.\nBen Steiner of Sports Illustrated spoke with Allen about tackling the new endeavor with Vikings tight end T.J. Hockenson and Niners tight end George Kittle. Steiner wrote:\nIn a sport often known for its quiet crowds, knitting fans and sudden popularity every four years at the Olympics, Allen has become one of many who see curling as having greater potential. He's bought into a vision, too, led by Canadian entrepreneur Nic Sulsky, CEO of The Curling Group (TCG), which looks to modernize and professionalize curling.\nWhile Allen and the other football players may not be on the ice for it, they're at the forefront of the world's first professional curling league, called \"Rock League,\" which they hope can draw a younger, wide-ranging audience from around the globe.\n[]\nRock League will see six global franchise teams compete, with an equal split of five men and five women, including mixed play. The captains for the teams include Milan Cortina-bound Team USA mixed-doubles curler Korey Dropkin, Olympic gold medalist Brad Jacobs (Canada) and world champions Bruce Mouat (Scotland), Alina Ptz (Switzerland), Rachel Homan (Canada), as well as Chinami Yoshida (Japan).\nThe league is scheduled to kick off in April, with a seven-day launch event in Toronto. It will then expand to a five-stop 2027 season and aims for a world-wide schedule in 2028.\n\"It's an addictive sport, there's so many nuances, so if you're a detail-oriented person, and you like challenges and you like to push yourself, curling is the greatest sport, because there's constant challenges, even for the best players,\" Allen told Steiner. \"It never gets easy, right? Your willingness to take difficult shots goes up, you're paying more attention to the ice and you're totally over analyzing all the ice changes. There's just so many details.\"\nRead Steiner's article in its entiretyhere.\nDownload for iOS\nDownload for Android\nFormer Vikings DE to be featured in Sundance Festival for indie series\nJalyn Holmes has always been interested in activities beyond the football field.\nWhen Holmes played as a defensive end in Minnesota (2018-20), helaunched a trucking companyin his home state of Virginia. Now having spent the past two seasons with the Commanders, Holmes is dabbling in the film industry and finding success.\nHolmes is currently in Park City, Utah, to attend the acclaimed Sundance Film Festival, where his work as an associate producer on an independent series, Freelance. He recentlyspoke with Melissa Kimof WUSA9, noting he's thrilled to \"be in the film version of the NFL Combine.\"\nAccording to Kim, the series \"follows a young filmmaker who has dreams of making it in Hollywood, not too far from where Jalyn and the directors, Justin and Julian Turner, want to be.\"\n\"We were always in it for the right reasons, and we were all in it for the love of it,\" Holmes told Kim.\nLearn more about the project and see how it fareshere.\nSee the Vikings2026 Opponents.\nCheck out the Vikings2026 Draft Picks.\nViewfuture opponentsfor the Vikings.\nBuysingle game tickets.\nDownload the officialVikings App.",
  "word_count": 1119,
  "scraped_at": "2026-02-14T12:51:14.601554"
}