{
  "article_id": "e0a79f0ce149",
  "url": "https://metro.co.uk/2026/01/02/anthony-joshuas-driver-charged-car-crash-killed-boxers-two-friends-26013053/",
  "title": "Anthony Joshua driver charged after car crash that killed boxer two friends",
  "date": "20260102T183000Z",
  "domain": "metro.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "The driver of the car involved in the fatal crash that injured Anthony Joshua and killed two of his friends and team members has been charged by Nigerian police.\nAdeniyi Mobolaji Kayode was charged on four counts including causing death by dangerous driving and driving without a licence at the Sagamu Magistrate Court on Friday.\nTwo-time heavyweight champion Joshua was a passenger in a Lexus SUV which hit a stationary truck on the Lagos-Ibadan Expressway in Makun, Nigeria on Monday, December 29.\nWhile the British boxer escaped with minor injuries and has since been discharged from hospital, his close friends and long-term members of his team, Latif ‘Latz’ Ayodele and Sina Ghami, were killed in the accident.\nProsecutors confirm the charges against Kayode, 46, are causing death by dangerous driving, reckless and negligent driving, driving without due care, and driving without a valid driver’s licence.\nThe case has been adjourned until January 20 for trial.\nWho were Anthony Joshua's friends Latif Ayodele and Sina Ghami?\nThroughout his time in boxing, Anthony Joshua has kept a close-knit circle of friends and associates around him, plenty of those working silently behind the scenes during his ascent to the summit of the sport.\nBoth Ghami and Ayodele were part of that group, considered good friends having worked closely with him for years.\nWho is Latif ‘Latz’ Ayodele?\n‘Latz’ is a long-time friend of Joshua’s and has been part of the AJ team going all the way back to his maiden world title victory over Charles Martin in 2016.\nAyodele was Joshua’s personal trainer and a dedicated Muslim having converted to Isam in 2012.\nHis Instagram feed is littered with images and videos of him alongside Joshua in the gym and relaxing away from it.\nJust hours before the crash, he shared a video on Instagram of him and Joshua smiling and laughing over a game of table tennis.\nLatif worked with a number of other prominent sports men and women with New Zealand rugby legend Sonny Bill Williams among those paying tribute.\nAccording to his Facebook profile, he attended St Joan of Arc Catholic School in Rickmansworth, a few miles from Joshua’s hometown of Watford.\nWho is Sina Ghami?\nGhami was Joshua’s strength and conditioning coach, a role he held for more than a decade.\nHe was also the co-founder of Evolve Gym in London. Their website states Ghami was a qualified sports and exercise rehabilitator who specialises in musculoskeletal injuries and corrective exercise.\nGhami was at Joshua’s side throughout his career, including his crowning moment against Wladimir Klitschko at Wembley Stadium in 2017.\nHis last Instagram story appeared to be a shot of Joshua’s motorcade through Lagos.\nKayode was granted bail in the sum of 5,000,000 Naira (£2,578) and was remanded pending his bail conditions being met.\nMore Trending\nOn Thursday, New Year’s Day, it was reported that police were on the hunt for the driver of the truck that Joshua’s car had crashed into.\nOn New Year’s Eve, after leaving hospital, Joshua and his mother, Yeta Odusanya, visited the funeral home in Lagos to pay his final respects to his two close friends.\n‘Rest in peace Latz and Sina. Your energy and loyalty among so many other great qualities will be deeply missed,’ Joshua’s promoter Eddie Hearn wrote.\n‘Praying for strength and guidance for all their family, friends and of course AJ during this very difficult time.’\nFor more stories like this, check our sport page.\nFollow Metro Sport for the latest news on Facebook, Twitter and Instagram.\nMORE: Anthony Joshua may not fight again after devastating car crash, Tyson Fury’s promoter fears\nMORE: Anthony Joshua says ‘I feel pain all over my body’ after car crash that killed two friends\nMORE: Police confirm what caused Anthony Joshua car crash that killed two friends",
  "word_count": 633,
  "scraped_at": "2026-02-14T13:24:14.664288"
}