{
  "article_id": "e0ab1161ea4c",
  "url": "https://wjla.com/newsletter-daily/kamala-harris-to-formally-accept-democratic-presidential-nomination-as-convention-wraps-2024-election-tim-walz",
  "title": "Kamala Harris vows to be president  for all American and warns of dangers of Trump",
  "date": "20240823T071500Z",
  "domain": "wjla.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Kamala Harris vows to be president 'for all Americans' and warns of dangers of Trump\nCHICAGO (TND) — Vice President Kamala Harris vowed to be a president for all Americans regardless of political affiliation as she pushes to chart a \"new path forward\" to the country as she accepted the Democratic presidential nomination on the final night of the party's national convention, marking the start of a 75-day sprint to Election Day.\nHarris’ acceptance of the nomination kickstarts the campaign into the crucial closing stretch as she tries to continue the positive momentum from her ascension to the top of the ticket with President Joe Biden opting against sticking out a reelection bid. She emphasized the unlikely nature of her becoming the Democratic nominee with Biden's sudden decision to drop out, catapulting her to the top of the ticket but said she is “no stranger to unlikely journeys.”\n“I will be a president who unites us around our highest aspirations,” Harris said. “A president who leads—and listens, who is realistic, practical and has common sense. And always fights for the American people. From the courthouse to the White House, that has been my life’s work.”\nIn her speech, she described her background coming from a middle-class household and moving on to become a prosecutor, senator and the vice president of the United States. Leaning into her long career of public service, Harris said she's only had one client her entire career as an attorney.\n“My entire career I’ve only had one client: the people,\" she said.\nHarris painted a grim picture for the future of America if Trump were to go on to win the November election. Democrats have frequently warned a second Trump administration would be more extreme, with loyalists likely to be appointed to top positions in the government who would not check any of his impulses.\n“Just imagine Donald Trump with no guardrails, and how he would use the immense powers of the presidency of the United States, not to improve your life, not to strengthen our national security, but to serve the only client he has ever had: himself,” Harris said.\nHer speech clearly had Trump's attention, as he was posting in real time on his social media platform Truth Social rebutting her talking points, accusing her of lying about him and his agenda and saying she is failing the country as vice president.\n“No specific programs, ALL TALK, NO ACTION — Why didn’t she do it three and a half years ago?” Trump wrote in one post.\nHarris also went on offense against Trump and Republicans in her speech, blasting them for abortion restrictions and bans that have been put into law in GOP-led states across the country since Roe v. Wade was overturned by the Supreme Court. She said Trump would pursue extreme policies like a nationwide abortion ban and further restrictions on women's health care like birth control.\n“Simply put, they are out of their minds,” she said.\nWhile Harris has name recognition as the current vice president, but many Americans are not aware of what she envisions the future of the country. Her campaign has just started to roll out her policy proposals for a Harris administration, while Trump and other Republicans have tried to paint her and Walz as radical liberals who would steer the country toward socialism.\nShe offered several policy pledges to pursue if she becomes president like overhauling the nation's election laws, codifying the right to an abortion into federal law, addressing the housing shortage through more building and tax credits for first-time buyers, continuing to stand with Ukraine in its fight against Russia's invasion and working to secure the southern border.\nThe border is a difficult issue for Harris and Democrats against Republicans, who have criticized the Biden administration's handling of illegal immigration and accused him of enacting problems that have endangered Americans. Democrats have sought to rebut those attacks by pointing to Trump's influence in Republicans rejecting a bipartisan Senate bill that would have added more Border Patrol officers and expanded funding for new technology to secure the border.\nShe vowed to bring back the bipartisan Senate deal if she becomes president.\n“After decades in law enforcement, I know the importance of safety and security, especially at our border,” she said. “I will bring back the bipartisan border security bill that he killed and I will sign it into law.”\nHarris also addressed another precarious issue that has divided Democrats in the U.S. support for Israel and the war in Gaza that has claimed the lives of tens of thousands of Palestinians. Pro-Palestine demonstrations have taken place all over the country, including outside the United Center in Chicago, as protesters have continued to demand Israel agree to a cease-fire to end the fighting.\nShe tried to balance supporting Israel's right to self-defense in the wake of the Oct. 7 terrorist attack perpetrated by Hamas while saying she was working with Biden toward a cease-fire “such that Israel is secure, the hostages are released, the suffering in Gaza ends, and the Palestinian people can realize their right to dignity, security, freedom, and self-determination.\"\nDelegates at the convention had heard from Harris in pieces during the week. On the first night, she made a surprise appearance to thank Biden for his service to his country during an evening dedicated to honoring him. Her remarks from a rally in nearby Milwaukee were also played in part to the crowd.\nOther speakers on Thursday were Michigan Gov. Gretchen Whitmer, North Carolina Gov. Roy Cooper, former Republican Rep. Adam Kinzinger, and Gabby Giffords, a former Democratic House lawmaker who was nearly killed in a mass shooting in 2011.\nKinzinger was the last of a string of Republicans who spoke at the Democratic convention this week urging their fellow party members to vote against Trump. Democrats have been hoping to court anti-Trump GOP voters for months and made appeals to people who backed former United Nations ambassador Nikki Haley in the Republican primary to support the Democratic ticket.\n“Democracy knows no party,” Kinzinger said. “Vote for our bedrock values and vote for Kamala Harris.”\nHarris also appealed to voters outside the Democratic Party, promising to work for the best interests of all Americans regardless of their politics or whether they voted for her.\n“I know there are people of various political views watching tonight, and I want you to know I promise to be a president for all Americans,” Harris said. “I promise to be a president for all Americans to hold sacred America’s constitutional principles, fundamental principles, from the rule of law and fair elections to the peaceful transfer of power.\"\nCivil rights leader Al Sharpton noted the historic nature of Harris' nomination, as she would become the first woman to be president, the second Black president and is the first Black woman and first person of South Asian descent to receive a major party's presidential nomination. He also introduced the exonerated members of the Central Park Five, who spoke and said Trump \"thinks that hate is the animating force in America.\"\nThe former president took out full-page ads in New York after the assault that led to their conviction calling for the state to adopt the death penalty, which he said was inspired by the attack. He has refused to apologize to the five men, who were teenage boys at the time of their conviction.\n“Forty-five wanted us un-alive. He wanted us dead. Today, we are exonerated,” saidYusef Salaam, who is now a New York City Council member. “He has never changed, and he never will.\nSeveral Democratic senators and Senate hopefuls in crucial swing state races spoke at the DNC on Thursday as the party tries to hold its tenuous hold on control of the Senate in a cycle that heavily favors Republicans with more Democrats on defense and few flip opportunities.\nOne of those candidates, Rep. Elissa Slotkin of Michigan, told the crowd to embrace patriotism and elect a leader who will move the country forward.\n“Let’s elect a president who will lean forward to embrace the future,” Slotkin said. “Because America doesn’t follow. We do not retreat. We are the damn United States of America. We lead.”\nTrump's apparent fixation on crowd sizes has been the punchline of several jokes by Democratic speakers throughout the four-day event, including former President Barack Obama.\n“As a computer science major, I am so impressed by how large this AI-generated crowd looks tonight,” Lieu said in reference to Trump’s claim that the Harris-Walz audiences are being artificially inflated.\nWalz had his big moment in the spotlight on Wednesday night, where he gave a mostly biographical speech about his background growing up in Nebraska before serving in the National Guard for 24 years, working as a teacher and football coach before heading to Congress and later serving as Minnesota’s governor. He is still working to build name recognition, as he rose from a relative unknown as a Midwestern governor to potentially the next vice president of the United States.",
  "word_count": 1507,
  "scraped_at": "2026-02-14T13:15:29.343020"
}