{
  "article_id": "e0af554010de",
  "url": "https://www.walesonline.co.uk/news/health/our-daughter-diagnosed-cancer-11th-31757162",
  "title": "  Our daughter was diagnosed with cancer on her 11th birthday  ",
  "date": "20250530T151500Z",
  "domain": "walesonline.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "'Our daughter was diagnosed with cancer on her 11th birthday'\nIt was when a knock Millie picked up playing football took a long time to heal that parents Gordon and Gemma Blair started to worry\nA family says they are in \"a living nightmare\" after their seemingly \"fit and healthy\" daughter was diagnosed with cancer - on her 11th birthday. Gordon and Gemma Blair first noticed something was wrong with then 10-year-old Millie when she took a \"knock\" to her left leg during a football match last summer.\nThe sports-mad youngster would usually recover from injuries quickly, her parents said. But the pain persisted and she started \"limping\" - so Gordon and Gemma took her to hospital.\nDoctors initially thought she may have broken her leg but a series of tests soon confirmed that Millie had osteosarcoma - a form of bone cancer that usually affects children.\nShe received the devastating diagnosis on her 11th birthday. Since then, Millie, from Cambridge, has spent more than 100 nights in hospital, endured seven operations, and even had her left leg amputated above the knee.\nHowever, she is insistent that her diagnosis won't stop her pursuing a career in sports - and has said she is now aiming for the Paralympics. To help her get there, dad Gordon is taking on an 88-mile walk to raise the £130,000 needed for a specialist prosthetic leg - which he hopes will give Millie \"the power to dream again\".\nGordon, a detective inspector for Cambridgeshire Police, said: \"Finding out your kid has cancer is the worst feeling imaginable. Your whole world implodes in an instant. It’s something no parent should have to go through.\n\"Suddenly, we were thrust into this scary world of unknowns, spending our days in hospitals with tubes and machines and procedures. It’s an awful place to be. This time last year we were just a normal, loving family and life was good, life was easy- so easy, I was considering going for promotion and we even got a puppy, that’s how easy life was.\n“I cannot tell you how badly I wish we could go back to that normal. I’d do anything to be back at work, dealing with the daily grind and all that comes with it just to get some normality back.\n\"We should be sitting around the dinner table together on an evening, laughing, joking, arguing – doing what families do. Instead, we’re separated in a living nightmare.\"\nGordon says the diagnosis came as a huge shock to the family - as Millie, a talented horse rider and promising young footballer who played for Oundle Town and Peterborough United Academy, was rarely ill. Gordon said: \"We first knew something was wrong when Millie took a knock to her left leg during a football match last summer.\n\"That in itself wasn’t unusual. She was in pain but still managed a full 90 minutes for the boys’ team the next day – she’s a human dynamo. However, the pain seemed to worsen over the coming days and she started to limp, so we took her to the doctors.\n\"The diagnosis was a huge, huge shock. Millie had been an otherwise healthy kid, with a 100 per cent attendance record at school. She was fit and active and rarely ill.\"\nAs part of Millie's ongoing treatment, she had her left leg amputated above the knee in January this year. This means she needs a prosthetic leg - but the NHS does not provide specialist ones which allow people to pursue high-performance sports careers.\nAs a result, Millie's parents Gordon and Gemma, a Cambridgeshire Police intel operative, and her older sister Jessica, 15, have launched a fundraiser to give her \"the opportunities she deserves\".\nGordon said: \"Finding out your kid has cancer is horrendous enough, but finding out they’re going to lose their leg as well – it’s soul destroying. I’ve faced the most harrowing murder scenes in my career and dealt with many awful crimes, but this has truly broken me. I cry every day.\n\"But Millie has been absolutely phenomenal. I find it hard to put into words how strong she’s been. Despite the unimaginable pain and trauma, she refuses to let the cancer and the loss of her leg define her future.\n\"She’s determined to play for England Women’s Amputee Football Team and even compete in the Paralympics. We don’t mind what she does - we just want her to be happy and to be able to get back to running around with her friends. To do that, she’ll need the right support.\"\nThe NHS provides prosthetics but most aren't suitable for someone as active as Millie - and she'll continue to need new ones, as well as specialist rehabilitation treatment, as she grows.\nThe cost of these things combined is over £130,000. Gordon said: \"I don’t feel comfortable asking for anything. It’s not in my nature or our nature as a family.\n\"But we want to give Millie the opportunities she deserves. We just want to give her the power to dream again and to give our family some normality.\n\"Millie’s cancer is something we will carry with us and worry about for the rest of our lives. The world is hard enough, so anything we can do to make things easier for her, we will do.\n\"We also want to raise as much awareness as possible around children’s cancers because I don’t believe they get anywhere near the attention or funding they deserve and desperately need. The NHS is full of truly wonderful people, but the system is woefully broken, as we have sadly discovered.\"\nTo raise the money, Gordon is joining a team of 30 people to complete an 88-mile walk from Peterborough United’s football grounds to Stamford Bridge in London, the home of Chelsea FC - where Millie always dreamed of playing. The walk, organised by Gemma’s boss detective sergeant Adam McCluskey, is estimated to take around three days in total.\nTo donate to Millie's fundraiser, visit her Just Giving page here: https://www.gofundme.com/f/making-millie-mobile-help-her-take-her-next-steps\nFor more information on bone cancer, visit the NHS website: https://www.nhs.uk/conditions/bone-cancer/",
  "word_count": 1018,
  "scraped_at": "2026-02-14T12:58:14.363560"
}