{
  "article_id": "e0c44de7e3e0",
  "url": "https://www.bbc.com/sport/football/articles/cpv7ryppx1vo",
  "title": "Georgia Stanway to leave Bayern Munich at the end of the season",
  "date": "20260110T150000Z",
  "domain": "bbc.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "England's Stanway to leave Bayern in summer\n- Published\nEngland international Georgia Stanway will leave Bayern Munich upon the expiry of her contract at the end of the season.\nThe 27-year-old moved to Bayern from Manchester City in 2022 and has won three league titles.\nDuring her time in Germany, she has won two European Championships with the Lionesses and has become recognised as one of the best midfielders in the world.\nStanway, who has 87 caps for England, is permitted to sign a pre-contract agreement with another club this month with a view to joining in the summer.\nIt is understood Arsenal have emerged as the frontrunners and have been in talks with Stanway over a potential agreement, though other clubs have shown interest.\n\"I am incredibly grateful to Bayern. Thankfully, my time here isn't over yet,\" Stanway said in a club statement on Saturday.\n\"The decision to leave was incredibly difficult. I definitely didn't make it lightly. I've made friends and memories here that will last a lifetime, and I've been able to develop enormously as both a player and a person.\n\"I will give absolutely everything for Bayern and our sporting success until the very last day - just as I have for the past three and a half years.\"\nShould Arsenal agree a deal with Stanway, it would be regarded as one of the biggest transfers of the January window.\nArsenal are looking to build a squad capable of winning the Women's Super League, having lifted the Champions League trophy in May, and are working to secure additions for the summer.\nManager Renee Slegers also signed a new three-year deal this week.\nBen Haines, Ellen White and Jen Beattie are back for another season of the Women's Football Weekly podcast. New episodes drop every Tuesday on BBC Sounds, plus find interviews and extra content from the Women's Super League and beyond on the Women's Football Weekly feed",
  "word_count": 321,
  "scraped_at": "2026-02-14T12:51:42.539353"
}