{
  "article_id": "e0d672608270",
  "url": "https://www.90min.com/posts/chelsea-vs-liverpool-wsl-preview-tv-channel-live-stream-team-news-prediction-3-5-23",
  "title": "Chelsea vs Liverpool - WSL preview : TV channel , live stream , team news & prediction",
  "date": "20230501T170000Z",
  "domain": "90min.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Chelsea vs Liverpool - WSL preview: TV channel, live stream, team news & prediction\nChelsea and Liverpool saw this game abandoned due to a frozen pitch when it was originally scheduled back in January, something which shone an enormous spotlight on the often inadequate facilities that women's football regularly still has to contend with.\nThe game was allowed to start that day after efforts had been defrost the playing surface, but that decision was reversed owing to safety concerns only six minutes later.\nDelayed until this late stage of the season, it arguably takes on vastly more significance because of potential implications on the title race. Chelsea fell seven points behind leaders Manchester United on Friday night, but have three games in hand to make up on their most dangerous title rivals.\nVictory for Chelsea would cut into that gap, with further games in hand against Everton and West Ham to follow as additional midweek kick-offs in a heavily congested May.\nFor Liverpool, they have almost certainly done enough to avoid an immediate relegation back to the Championship following last season's promotion. But with games against Manchester City, Aston Villa and Manchester United to follow this one, the end of the campaign could hardly be tougher.\nWhere to watch Chelsea vs Liverpool on TV/live stream\nWhen is kick off? Wednesday 3 May, 19:15 (BST)\nWhere is the match being played? Kingsmeadow\nWhat time does TV coverage start in the UK? 19:05 (BST)\nReferee? Abigail Byrne\nChelsea team news\nChelsea's recent exertions in the Champions League and the busy fixture schedule to come could see some siubstantial rotation from Emma Hayes in this one, which is one of their most favourable remaining fixtures.\nLauren James will likely start after being sacrificed for defensive stability in both Barcelona games, while there could be game time for Jelena Cankovic, Niamh Charles and Sophie Ingle.\nFran Kirby at least made the trip to Barcelona even if she wasn't actually in the matchday squad, but Millie Bright, Kadeisha Buchanan and Katerina Svitkova all stayed at home.\nRead the latest Women's Super League news here\nLiverpool team news\nLiverpool are hoping to have last season's top scorer Leanne Kiernan back in training this week, having suffered a long-term ankle injury in the reverse fixture against Chelsea.\nMegan Campbell and Melissa Lawley have both been missing in recent weeks.\nChelsea vs Liverpool score prediction\nLiverpool sprung an almighty shock on Chelsea on the opening weekend of the season when two Katie Stengel penalties gave Matt Beard's newly promoted side an extremely unlikely win. But the Reds have lost every game they have played against one of the top four since then.\nBeard's team are also much better at home than they are on the road, as shown by a surprise 4-0 thrashing by struggling Leicester, which suggests this may be too much for them.",
  "word_count": 477,
  "scraped_at": "2026-02-14T12:55:31.551776"
}