{
  "article_id": "e0e8f25db372",
  "url": "https://advanced-television.com/2024/03/28/forecast-snapchat-ad-revenue-at-5-2bn-in-2024/",
  "title": "Forecast : Snapchat ad revenue at $5 . 2bn in 2024",
  "date": "20240328T140000Z",
  "domain": "advanced-television.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Forecast: Snapchat ad revenue at $5.2bn in 2024\nMarch 28, 2024\nHaving suffered consecutive quarterly revenue declines in 2022, Snapchat saw advertising revenue steadily bounce back in 2023 – albeit at modest levels compared to Big Tech peers.\nAccording to WARC Media forecasts, the company will see +13.7 per cent year-on-year advertising spend growth this year to reach $5.2 billion (€4.8bn), with marketers in APAC having a higher intention to invest in the platform. This compares to just a 0.1 per cent increase in 2023. It comes as the platform pivots to a new strategy.\nAlex Brownsell, Head of Content, WARC Media, commented: “It’s easy for brands to overlook Snapchat in the context of giants such as Meta and TikTok. However, in an era where social media apps are evolving into mass entertainment platforms, and social communication has retreated to group chats, Snapchat is betting that a laser focus on enabling real connection and community will breathe new life into the platform.”\nProviding evidence-based insights on the challenges and opportunities Snapchat has to offer, this latest Platform Insights report from WARC Media provides an overview of the key data points about the platform spanning investment, consumption and performance.\n- Investment: Snapchat’s annual advertising revenue to reach $5.2bn this year, up 13.7%\nWARC’s annual Marketer’s Toolkit survey found that 21 per cent of advertisers plan to increase investment in Snapchat, while 29 per cent expect to decrease spend. APAC marketers showed the highest intention to increase investment (23 per cent), while Europe has the lowest (20 per cent).\nAccording to WARC Media forecasts, the company will see +13.7 per cent year-on-year ad growth in 2024, compared to just 0.1 per cent increase in 2023.\nThe platform’s latest earnings call revealed a change in strategy with the company moving away from augmented reality and instead prioritising AI for ad optimisation, content experience and user growth.\nHowever, there is scepticism about its ability to compete for ad dollars at scale, especially in a climate where the number of eyeballs still comes first for major advertisers.\nBusiness and industrial is forecast to be the biggest spending category on Snapchat in 2024 ($756.8 million), while political ad spend is expected to increase 85 per cent, owing in part to the upcoming 2024 US presidential elections.\nAlthough dwarfed by the billions using platforms like TikTok and Instagram, Snapchat has seen its base and reach expand, especially regarding unique audiences among younger cohorts.\nSnapchat’s latest earnings revealed a 10 per cent year-on-year growth of its global daily active users (DAU), tallying 414 million. We Are Social estimates that Snapchat has an advertising audience of more than 677 million, 6.8 per cent higher than last year’s total.\nDAU growth in North America remained flat while the rest of the world users grew 19 per cent. India leads as the country with the largest Snapchat advertising audience, ahead of the US, Pakistan, France and the UK.\nThe company’s recent engagement figures reported over 5 billion Snaps are created on a daily average, and over 250 million users engage with AR every day. It launched its AI powered chatbot in early 2023 and reported over 200 million users in Q3, with football being the most popular conversation.\nThe average monthly time spent on Snapchat is three and a half hours, while average app session duration is one minute and 23 seconds, versus two minutes 44 seconds for Instagram and five minutes and 56 seconds for TikTok.\nOne fast growing market is Australia, with users spending up to 17 hours on the Snapchat app per month. Australian Snapchatters also reportedly open the app 40 times per day.\nMost teens in the US say they use TikTok (63 per cent), Snapchat (60 per cent) and Instagram (59 per cent), according to a 2023 study by Pew Research. Among the 60 per cent of teens who Snapchat, 14 per cent say they almost constantly visit or use the app. Younger cohorts appreciate ‘visual communication’ and deem it more personal and expressive.\nAs social media becomes a place to discover products and brands, We Are Social reports that just over one in five consumers choose Snapchat for brand search.\n- Performance: Snapchat has 99% brand safe content on Spotlight, and 100% safe creator content\nAs digital platforms undergo heavy scrutiny, an advantage of Snapchat lies in its high levels of brand safety. Data from Snapchat shows close to 99 per cent brand safe content on Spotlight, and 100 per cent safe creator content.\nSnapchat’s change of platform strategy signals a move to a new kind of digital future: a return to the more literal ‘social’ element that channels originally aspired to. With monthly users at 800 million, Snapchat has a unique audience base that focuses on connection, messaging, having fun, and communicating visually.\nThere are opportunities in brand funded creator content. Snapchat is actively launching products to help brands partner with its creator community, including its Creator Collab Campaigns.\nFollowing its role in recent large live events – the 2023 FIFA Women’s World Cup, the Grammys and the Super Bowl – and its upcoming 2024 Paris Olympics partnership deal, Snapchat aims to enable advertisers to tap into cultural moments to reach and engage with audiences.\nSocial commerce is growing on the platform thanks to its focus on lower-funnel objectives, AR and AI assisted tools, creator content, and high reception among users due to the ‘close circle effect’. The recent Amazon and Snap deal is a step to benefit both players as they compete with the likes of TikTok.\nOther posts by :\n- SES predicts end of ‘big’ Geo satellites\n- Amazon Leo gets approval for 4,504 extra satellites\n- SpaceX gets a portion of India\n- TerreStar wants to build LEO network\n- Musk: “No Starlink phone”\n- Russia accused of eavesdropping on satellites\n- FCC welcomes Musk’s 1m satellite plan\n- Telesat has problems with an LEO\n- Orbital debris a real danger",
  "word_count": 991,
  "scraped_at": "2026-02-14T12:31:43.723691"
}