{
  "article_id": "e0f0da5c13d1",
  "url": "https://www.90min.com/posts/marc-skinner-hopeful-man-utd-contracts-sagas-become-distraction",
  "title": "Marc Skinner hopeful Man Utd contracts sagas wont become a distraction",
  "date": "20230307T171500Z",
  "domain": "90min.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Marc Skinner hopeful Man Utd contracts sagas won't become a distraction\nManchester United manager Marc Skinner has expressed optimism that the ongoing contract uncertainty surrounding several key players won’t become a distraction during the crucial final portion of the season - the Red Devils lead the WSL with eight games to play.\nAlessia Russo is on course to become a free agent in the summer. The same is true of Ona Batlle, with both players already having 12-month extensions triggered as their original terms were due to expire in 2022. Mary Earps is out of contract this coming summer but has an option to 2024 – Skinner has previously confirmed talks over a new deal are ongoing with her regardless.\nRusso is both a supreme talent and one of English football’s most marketable stars, while Batlle is arguably the best right-back in the world. There can also be no denying Earps’ world class status now in the wake of her recent Best FIFA Women’s Goalkeeper award.\nAll three deserve to be playing Champions League football and fighting for top honours. At least getting into Europe for the first time has often been talked about this season as a way that United will convince their biggest stars to stay for the long-term.\n“That’s always going to be a factor,” Skinner said in the week leading up to United’s huge WSL clash with Chelsea, but added, “I wouldn’t say it goes hand in hand.”\n- Alessia Russo rising above the noise about her future with Man Utd performances\n- Man Utd in 'heavy' contract negotiations with Alessia Russo & Ona Batlle\n- Man Utd Women contracts: When every player's current deal expires\nAsked specifically about England duo Russo and Earps, the United boss explained, “We have two top players who want to be competing [at the highest level]. But the whole reason I’m here is to try and achieve that anyway. There is nobody in this club that isn’t trying to aim for that.\n“If you ask both players, I think they’re very happy at Manchester United and with the way we’re performing and what we’re doing. There are other factors within that. That is always going to be our aim and those two players, especially, will have a big say in whether we achieve those targets.”\nEarps has publicly spoken about her uncertain future and Russo rejected the offer of a new contract last summer shortly before a breakout international display at Euro 2022. But while the lack of certainty beyond this season is far from ideal, so far it hasn’t proven to be problematic on the pitch.\nRusso was the subject of two world record bids from Arsenal at the end of the January transfer window but has scored four times in her last two appearances – including United’s first ever WSL hat-trick against Leicester on Sunday. Earps, meanwhile, continues to shine and Batlle is another example of a standout performer, nominated for PFA Vertu Motors WSL Fans' Player of the Month.\n“The [transfer] window, people could have said was a distraction and it really wasn’t,” Skinner said.\n“We’re working hard behind the scenes [on contract talks] and we have been for a while. It just takes time. The women’s game is entering a new era and it just becomes a little bit more difficult.\n“What I’ve always known from any player who is out of contract [in 2023], they are giving absolutely everything in training. There is no distraction in training and I think, as a coach, that is all I can ask for. I let the business people do the business conversations and I make sure the players are in a good frame of mind. At the minute, they’re in very good frames of mind and long may that continue.”\nFor more from Jamie Spencer, follow him on Twitter!",
  "word_count": 641,
  "scraped_at": "2026-02-14T12:21:23.356329"
}