{
  "article_id": "e0f51799041d",
  "url": "https://www.thezimbabwean.co/2023/03/robin-palmer-the-original-land-campaigner-and-scholar-activist/",
  "title": "Robin Palmer – the original land campaigner and scholar activist",
  "date": "20230327T123000Z",
  "domain": "thezimbabwean.co",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "The large numbers of tributes that have been shared on many platforms (see here and here) are witness to his influence on many over several decades.\nI first encountered Robin via his academic work and his brilliant book Land and Racial Domination in Rhodesia, alongside the collection edited with Neil Parsons, Roots of Rural Poverty in Central and Southern Africa. Both books came out in 1977 at the encouragement of James Currey and I read them as I started working in Zimbabwe in the mid-1980s. I did not meet Robin physically until some years later when he was working with Oxfam on the southern Africa desk. With Peter Baka Nyoni who was working with Oxfam in Zimbabwe (and of course Sithembiso Nyoni at ORAP), he was very supportive of the establishment of Zvishavane Water Projects by my great friend and colleague, the late Zephaniah Phiri.\nRobin travelled to what was then Southern Rhodesia in 1960 to pursue an undergraduate degree at University College of Rhodesia and Nyasaland, then an affiliate of the University of London. His experience of life in Southern Rhodesia exposed him to the violence and injustice of racial segregation. He was keen on sport and, as he recalls in an essay on his life and work experience prepared for the symposium celebrating Lionel Cliffe’s life in 2014, he played football with blacks in the ‘African’ areas and cricket with whites in the ‘European’ areas. After his undergraduate degree he continued with a PhD. His academic work delved into the history of land in the country. Land and Racial Domination was originally his PhD thesis, awarded in 1968 after he was expelled from the country following UDI.\nNow out of print, it is an amazing book. Full of detail (as any good history text the footnotes are a book in themselves), it tells the story of how Rhodesia was settled and how land was expropriated. Packed with well-researched facts and dispassionately presented, it is devastating. Along with Terry Ranger’s Peasant Consciousness and Guerrilla Ward in Zimbabwe, it was one of the books that really influenced me early on in my career working in Zimbabwe.\nEveryone should read it – and someone, somewhere must digitise it and make it available for free! It is incredible how few people – including in Zimbabwe and despite all the political rhetoric about land – know the full story. It is not just a dry history, as so much remains relevant today with debates from nearly a century ago being repeated. Just as now, the government of the day complained that white settler commercial farmers were underutilising the land, that peasant agriculture was causing land degradation and so on.\nAfter finishing his thesis in London, Robin had the choice of jobs – go to the US and teach history at California State University or take up a post at the University of Malawi. You can guess where he chose. After three years at the University of Malawi, in 1971 he moved to the University of Zambia where he stayed until 1977. After a brief attempt to retrain as a schoolteacher in the UK, he landed a job at Oxfam in 1986 and joined its southern Africa desk. In the coming years he would spend a lot of time in the region, working with many different partners.\nA particular insight comes from his book, A House in Zambia, Recollections of the ANC and Oxfam at 250 Zambezi Road, Lusaka, 1967-97 (Lusaka, Bookworld Publishers, 2008), which offers a fascinating reflection on the interactions between ANC exiles and ‘development’ professionals. In southern Africa, the politics of struggle and national liberation had a huge influence on development thinking at that time, and Robin’s historical insights into colonialism’s impacts were crucial.\nIn the 1995, Oxfam GB created a new post – land rights adviser – and Robin took up the role. This was an inspired move and represented an important era for Oxfam. With a wider campaign mandate, Robin used this opportunity to network and build. His activist sensibilities were put to great use, with significant impact. A number of important conferences and meetings followed. He worked with Kaori Izumi (who sadly passed away too early in 2013) at FAO, with Julian Quan at NRI and Camilla Toulmin at IIED, among many others on land rights and tenure in Africa. A particular focus was on women’s land rights, and the collaborations with Liz Daley and Birgit Englert were significant, not least around the book/special issue on women’s land rights in eastern Africa. Following an invitation by Peter Nyoni to review the land debate in Zimbabwe, Robin produced a report – which later became an enormously influential paper in African Affairs, Land reform in Zimbabwe, 1980-1990.\nIn 2000, Robin started the Land Rights in Africa website. Increased access to the internet and the ability to store and share materials allowed his skills as an historian archivist to be used for wider activist purposes. The website was a carefully curated collection and has proved invaluable for many, whether land scholars, practitioners or activists. He managed this resource for over 20 years first at Oxfam and then at Mokoro, before handing it over to Chris Tanner in 2022.\nThat Robin was an avid collector and passionate archivist was illustrated in an exchange we had a few years ago when he shared some documents from 1984 when he went to the archives in Zomba, Malawi and found a set of colonial era films in disarray. He made a list – including a list of those that were on the floor in a certain corridor, listing them from left to right! A treasure trove was documented, and I do hope that someone in Zomba took note and that they remain safe and useable today.\nThe Mokoro consultancy company was Robin’s last base. He moved there in early 2007 on what he describes as a ‘free transfer’ as Oxfam restructured once again and in its great wisdom got rid of the land campaign (and much more besides, including crucial work on pastoralism that was also hugely influential in East Africa in particular). Such was Robin’s magnanimous diplomacy, he barely commented on all this. Institutions were less important than ideas and networks – and he continued his work with typical energy and enthusiasm. This was a moment when land issues were again rising up the agenda, not least in Zimbabwe.\nWith support from NOVIB in 2003 he was able to initiate support for research on the ‘fast track’ land reform. Working with Prosper Matondi and team and facilitating the emergence of the very effective Ruzivo Trust, work on land in different parts of the country was started. This complemented the work by Sam Moyo and team at the African Institute of Agrarian Studies and our work with PLAAS, initially in Masvingo. Robin was central to supporting younger (and some older) Zimbabwean researchers across these research groups, bringing them together, for example at the UK African Studies Association held in Oxford in 2010.\nHis deep knowledge, openness and generosity were amazing. When they met him, colleagues were astonished that he was the Robin Palmer. On his passing my long-time collaborator, Felix Murimbarimba, wrote he was “such a jovial, accessible and influential researcher”. Prosper also wrote an impassioned tribute to Robin, noting how he was “truly a Zimbabwean and a hero for identifying land tenure as a basis for Zimbabwe’s inequalities that had strong racial undertones that he never liked.”\nComing back to Zimbabwe and investing in a new generation of land researchers at a crucial moment was important to Robin – and we all benefitted massively from his kind, unassuming support over years. When our book – Zimbabwe’s Land Reform: Myths and Realities (which I later discovered he was one of the reviewers for) – came out, there was much controversy and lots of backlash. Having Robin around as one of the advisers to the Livelihoods after Land Reform project to support and assure us was important when the flak became vicious. He attended many meetings and came to the field with us to learn more about what we were finding, always asking helpful probing questions.\nFollowing the financial, food and energy crises of 2007-08, ‘land grabbing’ became a major global issue. Robin was of course central to the debate. When we formed the Land Deals Politics Initiative around 2010, he was enormously encouraging. In 2011 we held an amazing event at IDS at Sussex, when over 150 people came from 70 countries and presenting 120 papers on the emerging phenomena of land, green and water grabbing. Robin shared his paper, typically linking historical insight with contemporary issues – ‘Would Cecil Rhodes have signed a code of conduct?’. As he reported in a piece for the Mokoro newsletter – mischievously titled ‘Land grabbing in Brighton’ – it was a ‘hugely energising event’.\nSince then I saw Robin regularly at meetings and events. Always offering important comments, never imposing or arrogant; always modest, self-effacing and supportive. So unlike many elderly white men of his stature and reputation. He was an avid reader of this blog, frequently sending me an email when he found something exciting and interesting. When the blog celebrated its 10th anniversary he sent an encouraging email, subtly pointing out that he had passed the 20th anniversary of the land rights website and that (by implication) I should carry on!\nSo, when I heard that he had died, as for many it was a terrible shock. His legacy is enormous and I hope that the Land Rights in Africa website will continue to inform, inspire and encourage others as he did to so many. Thank you, Robin.\nThis blog was written by Ian Scoones and first appeared on Zimbabweland (photos from Mokoro.co.uk)\nPost published in: Agriculture",
  "word_count": 1631,
  "scraped_at": "2026-02-14T13:07:25.018571"
}