{
  "article_id": "e1013f90b91c",
  "url": "https://www.bbc.co.uk/sport/football/articles/c5yklp550yno",
  "title": "Euro 2025: England's win over Spain in final to retain title creates history",
  "date": "2025-07-27T22:20:18.987Z",
  "domain": "bbc.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_bbc",
  "body_text": "Lionesses defy odds to create English football history\n- Published\n\"This year it was meant for England.\"\nLucy Bronze, England's most decorated footballer, the one player who epitomises what it is to be a Lioness, just had a feeling all along.\nEven with a fractured tibia throughout the tournament, Bronze would not give up. She would not miss this moment, as her side defended their European title and overcame the world champions on foreign soil.\nThe 33-year-old more than played her part. She only came off when she could no longer run through the pain, tears forming in her eyes during the Euro 2025 final against Spain, as she finally allowed someone to take her place in extra time, before England's penalty shootout victory.\nSarina Wiegman's side defied the odds, silenced the doubters, came back from the brink over and over and over again.\nThey simply won at any cost.\nAt the end of it, there can be no doubts. This was the greatest achievement in the history of English football.\n'Tough times don't last' - Kelly and Hampton shine after adversity\n- Published28 July 2025\nBronze played entire Euros with fractured leg\n- Published27 July 2025\n'We'll remember this forever': England fans jubilant as their heroes win again\n- Published27 July 2025\nIt is the first time an England team have won a major trophy on foreign soil after Wiegman's side delivered at home in 2022, and the men's 1966 World Cup victory took place at Wembley Stadium.\nThe Lionesses also became the first senior English side to defend their title - and they did it by coming from behind at half-time - the first time that had been done before in the women's Euros.\nIt cemented manager Wiegman's status as one of the world's greatest with her third successive European title - achieved with two countries.\nIt was her fifth major final in a row and Wiegman has won three of them, a remarkable feat.\nShe could barely believe it as she danced, arm-in-arm with captain Leah Williamson, allowing the mask to slip as England's understated and composed leader.\n\"I actually can't believe it myself. I was like 'how can this happen?' But it happened. I'm so incredibly proud of the team. I'm so happy,\" she said afterwards.\nWiegman's watch notification during her news conference reminded her of a workout she was due to have. \"I won't be doing that any more,\" she joked. And you can understand why.\nShe had already exhausted herself, going through every emotion imaginable in what she described as the \"most ridiculous and chaotic\" tournament of her career.\nThe players had not made it easy for themselves, acknowledging the stress they had put their families under and how they \"almost killed\" Wiegman off - at least twice.\nEngland led for just four minutes and 52 seconds in the knockout stage of the tournament and yet somehow had their hands on the trophy in Basel, surrounded by gold confetti, with Queen's We Are The Champions playing in the background.\nBefore kick-off, England were written off.\nIn fact, they were written off before Euro 2025 started when Mary Earps and Fran Kirby retired out of the blue and World Cup captain Millie Bright withdrew from selection.\nSurely that would be unsettling? Their poor defeat by France in the opening game only strengthened that narrative.\nBut England bounced back. They beat the Netherlands and Wales comfortably to reach the knockout stages.\nThey were 2-0 down to Sweden in the quarter-finals and came back. Sweden only scored two of their seven penalties, so even when goalkeeper Jennifer Falk saved four of England's, it was not enough. Luck was on England's side.\nThat was the moment Wiegman admitted the thought \"hmm, we might be going home tomorrow\" had crossed her mind.\nThey were 1-0 down again to Italy in the semi-finals before teenager Michelle Agyemang scored a 96th-minute equaliser and Kelly netted the extra-time winner in the 119th minute.\nSpain had not lost in 10 games, they were the world champions and they were the pre-tournament favourites.\nWhen they went 1-0 up in the final, England were on the ropes. They looked down and out. But that was not how the script had been written. England had decided that.\nSo calm was Wiegman, that as her players looked around St Jakob-Park before kick-off, the Dutchwoman waved to members of the media in the stands.\nShe strolled around with her hands in her pockets. She had been here before, England had been here before and they had an unwavering belief.\nSpanish journalists were positive about the Lionesses chances' at half-time - \"England can come back from 1-0 down\", \"Michelle Agyemang will come on\" - but doubt lingered.\nThe 'super subs' had done the job in 2022. Kelly, Alessia Russo and Ella Toone all shone in their roles as Wiegman stuck with the same starting XI throughout and trusted those coming on off the bench to make an impact.\nShe did not waver from the formula in 2025, instead renaming the substitutes as 'finishers' and entrusting them with the same responsibility.\nThe togetherness of the squad was apparent. Bronze's willingness to play through pain, the players' reaction to team-mate Jess Carter receiving racial abuse was impactful and Williamson's act of pushing Agyemang towards fans to receive adulation following their semi-final win was deliberate.\n\"It is ridiculous. Every time we came back from behind. Of course we have players that have talent. But the togetherness of this team is incredible,\" said Wiegman.\n\"Also, the belief that we can come back. The players say they can come back by any means and they just never give up.\n\"Every player is ready to come onto the pitch and show up straight away. That is not easy. I'm just really grateful that I'm part of this team.\"\nThe magnitude of what the Lionesses were on the cusp of achieving was clear before kick-off as cameras turned to the stands.\nWatching on were Prime Minister Keir Starmer, Prince William with Princess Charlotte, along with Spain's Princess Leonor and Uefa president Aleksander Ceferin.\nFootballing stars from other nations had come to watch, including Switzerland's Lia Walti and the USA's Catarina Macario, supporting their Arsenal and Chelsea team-mates in white.\nEngland men's international Reece James flew out to support his sister Lauren and Football Association chief executive Mark Bullingham was with them throughout their journey in Switzerland.\nBullingham has already made it emphatically clear that Wiegman, who is under contract until the 2027 World Cup, is \"not for sale at any price\".\nWith this generation of players, some who were on the fringes in 2022, and others more experienced, such as Bronze and Alex Greenwood, Wiegman has turned the Lionesses into a team of serial winners, one feared in major tournaments.\nWhere past England teams have faltered, this squad proved they could succeed, even when many thought they could not.\n\"From the first game it was chaos. Losing your first game and becoming European champions is incredible. Football is chaos,\" Wiegman said to BBC Sport's TV cameras while Bronze was being piggy-backed by goalkeeper Anna Moorhouse in the background, celebrating with fans.\nBronze knew what England were capable of. Now everybody else knows.",
  "word_count": 1206,
  "scraped_at": "2026-02-14T11:17:43.628175"
}