{
  "article_id": "e11cbd65d750",
  "url": "https://www.espn.co.uk/espn/story/_/id/47033710/did-caf-awards-voting-panel-get-right-choosing-achraf-hakimi-ghislane-chebbak",
  "title": "Did CAF awards voting panel get it right by choosing Achraf Hakimi and Ghislane Chebbak ? ",
  "date": "20251120T143000Z",
  "domain": "espn.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "The Confederation of African Football revealed the winners of the annual CAF Awards at a glitzy ceremony in Rabat on Wednesday, with Morocco, predictably, dominating proceedings and winning six prizes on the night.\nAchraf Hakimi became the first Moroccan player since Mustapha Hadji in 1998 to be crowned African men's Footballer of the Year, while Ghizlane Chebbak is the country's first ever winner of the women's award after seeing off stiff competition from Nigeria's Rasheedat Ajibade.\nBut did CAF's expert voting panel get it right?\nHard to deny Achraf Hakimi's win\nHaving finished second in the voting over the last two years, Paris Saint-Germain's Hakimi finally got his hands on the most prestigious individual prize in the African game when he was crowned in his home country.\nDespite stiff competition from 2023 winner Victor Osimhen and, particularly, two-time winner Mohamed Salah, it's difficult to argue that this wasn't the right year for Hakimi.\nThe 27-year-old, in his prime, and having established himself as the best player in his position in the world game, is an absolute joy to watch, and has taken his game to new levels over the last year.\nOf course, the highlight came in the Champions League final, where he starred as PSG eviscerated Internazionale, opening the scoring for Luis Enrique's side en route to become the second African player to win the UCL with two separate clubs (the other being Samuel Eto'o).\nHakimi's 12th-minute opener set the tone for a mesmerising PSG display, and while the fullback opted not to celebrate against his former club out of respect, there would be plenty more celebrating that evening as Hakimi - in tandem with Désiré Doué, operating down his flank - repeatedly prised open a beleaguered Nerazzurri backline. Here was yet further proof that Hakimi is not only unfazed by the big occasion, but he actively relishes being able to leave his mark on the toughest fixtures in the football calendar; no one took more touches than Hakimi's 93 in the final, while he also created two goalscoring chances and was a firm contender for Man of the Match.\nDuring that 12 months, he also won Ligue 1, the Cope de France, the Trophee des Champions and picked up an Olympic bronze medal with Morocco at the Paris Games.\nHis goal in the UCL final came after he'd already scored PSG's winner in the semifinal second leg against Arsenal, as well as in the quarterfinal against Aston Villa. For context, only Sadio Mané has ever previously achieved this feat at the true business end of Europe's premier club competition.\nIn total, he had a hand in 19 goals across the UCL last season, while also scoring in PSG's French Cup final triumph over Reims.\nHe was rewarded by inclusion in the Ligue 1 and Champions League Teams of the Season, and while his defensive qualities continue to improve, his adventurous displays up and down the right flank for club and country make it easy to forget that he is a defender... nominally at least!\n\"A recognition that crowns years of hard work, success, and unforgettable moments,\" the 27-year-old posted on his social handle on Thursday. \"My gratitude goes to my family, my teammates, and everyone who works with me every day, on and off the field. Your trust, dedication, and support make me stronger and allow me to grow.\n\"Thank you to all the Moroccan people for always standing behind me,\" he added. \"I hope this moment inspires every child in our country and across our continent to believe in their dreams and fight for them.\"\nSince that memorable Champions League success, Hakimi has been influential as Morocco qualified for next year's World Cup with a 100-percent record - the first African side ever to win every single qualifying fixture - although PSG's lethargic performances so far this season ought to sound a note of caution.\nNonetheless, with an Africa Cup of Nations on home soil to come next month, as well as next year's World Cup with a strong Moroccan side, don't be surprised if Hakimi makes it back-to-back POTY wins in 12 months' time.\nIn making the podium three times, as well as now winning the prize himself, he puts himself in a rarefied class of African greats, not to mention, the first African defender to win the award in 52 years, since Zaire's Bwanga Tshimen in 1973.\nWas Salah snubbed?\nCould a case be made that Mohamed Salah should have won the award ahead of Hakimi? Certainly, the Egypt legend would have been a worthy winner given his exploits over a year at Liverpool that was, at times, overshadowed by his ongoing contractual impasse with the club.\nNonetheless, Salah was the outstanding individual in the Reds' unexpected Premier League triumph under Arne Slot, helping the Dutch coach succeed Jurgen Klopp with elite numbers during the campaign -- 29 goals and 18 assists -- as they romped home to victory.\nMaybe there were none of the virtuoso performances of late 2021, nor were his pure goalscoring numbers as eye-catching as they were during that maiden season at Anfield, but Salah broke his career-best for assists in a campaign, which tells its own story of how he's adapting his game.\nIndeed, only three players in Premier League history have ever bested the 18 assists Salah registered last term; this was one of the most exceptional seasons by a creative player that we've ever seen in this era....a fact which has gone a little under the radar.\nAn argument could be made that Salah was more central to Liverpool's title success than Hakimi was to PSG's title successes - despite the goals in the latter stages of the UCL - while Salah was also performing in a tougher domestic environment.\nPerhaps what lets the forward down were his performances in key matches - notably the Champions League exit at the hands of PSG, as well as the EFL Cup final defeat by Newcastle United - while his struggles so far this season may be fresh in the minds of the voters.\nUltimately, while Salah's performance in the Premier League alone could have been enough to have secured him the gong in a different year, Hakimi's titanic trophy haul, the individual recognition he received, his outstanding attacking numbers - for a defender - and his impact in some of PSG's major fixtures make him a worthy 2025 African Footballer of the Year.\nHow did Chebbak beat out Nigeria stars?\nMorocco made it two out of two for the POTY awards -- not to mention the four other prizes the nation collected during the evening -- as Chebbak was named Women's Footballer of the Year.\nThis was arguably a more controversial choice than the men's prize, although when it was announced that Nigeria's WAFCON star Esther Okoronkwo had not even made the three-woman shortlist, Chebbak's crowning had appeared to be on the cards.\nShe's not undeserving either, following a fine year in which she scored five at the Women's Africa Cup of Nations on home soil - including a hat-trick against the Democratic Republic of Congo in the group stage and the opener in the final against Nigeria before the hosts' collapse - to clinch the Golden Boot. She was also the Lionesses' inspirational captain and leader throughout the competition.\nHer move to Al Hilal also represents a new landmark for the pioneering 35-year-old -- previously the first Moroccan player to leave the Moroccan Women's Championship for a European league -- while she was also voted into the FIFPro Women's World XI for 2025 by her fellow players.\nShe was one of only two African players, alongside Zambia's Barbra Banda, to make the cut for this selection, although her club performance through the year was unremarkable.\nBefore moving to Saudi Arabia, Chebbak made only 10 starts for Levante, scoring just once during the calendar year, so it's not immediately clear to see why - beyond that hat-trick against Congo's ladies - she received such a prestigious award for this season alone.\nBy contrast, her nearest contender for the award, Rasheedat Ajibade, could have been a natural pick for the gong after she won the Player of the Tournament prize at the WAFCON as she inspired the Super Falcons to the title.\nShe made decisive contributions in several matches and was named Player of the Match on three separate occasions, subsequently being rewarded with a move to Paris Saint-Germain's women's team after the tournament.\nAjibade featured more, and scored more, for an Atletico Madrid side who finished third in Liga F last season, 10 places higher than Chebbak's Levante Badalona.\nThen there's Esther Okoronkwo who was arguably unfortunate to have been eclipsed by Ajibade for the WAFCON POTY award, and was again unlucky to miss out here.\nWhen was the last time an African player -- male or female -- dragged their team to a major continental honour like Okoronwko did in Morocco? She was the architect of the 5-0 demolition of fancied Zambia, scoring one and contributing two further assists and was the Super Falcons' saviour in the final.\nHer second-half showing, as she pulled one back from the penalty spot and then assisted Nigeria's equaliser and winner to realise Mission X.\nOkoronkwo brought both substance and style, with her languid style, magnificent left foot and composure in tight situations setting her a cut above the other top competitors at the WAFCON.\nAdmittedly, playing in the Canadian league with AFC Toronto didn't give her the same visibility as some of her rivals in the voting, but she still won the NSL 2025 Shield, topped the league for assists and had a hand in 28 goals and assists across 20 appearances during the period in question.\nSurely, she ought to have been rewarded for her outstanding year with the top individual prize in the continental sphere.",
  "word_count": 1645,
  "scraped_at": "2026-02-14T12:44:12.161429"
}