{
  "article_id": "e12d09f1f720",
  "url": "https://www.mcall.com/2025/10/31/college-notes-easton-grad-trey-rhinehart-running-well-for-misericordia-cross-country-team/",
  "title": "College notes : Easton grad Trey Rhinehart running well for Misericordia cross country team",
  "date": "20251101T130000Z",
  "domain": "mcall.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Trey Rhinehart will have something to prove when he leads Misericordia’s men’s cross country team into the Middle Atlantic Conference Championship Saturday in New Britain.\nThe graduate student from Easton and an Easton Area High graduate finished 22nd with an 8,000-meter time of 27:32.9 last season. He rebounded to finish fifth in the Division III Mid-Atlantic Regional with a time of 25:30.2.\nThis fall, Rhinehart has been outstanding. He was named MAC Runner of the Week twice after posting back-to-back times of 25:51.3, which is one second short of the program record. He was fourth out of 213 entrants, the third collegiate finisher, at the Highlander Invitational on Oct. 11 in Houghton, N.Y., and followed that up by finishing 40th out of 264 runners at the strong Connecticut College Invitational on Oct. 18 in Waterford, Conn., the field including 12 nationally ranked Division III teams.\nRhinehart will be one of the top runners in this year’s conference championship. His time in the two meets would have easily won last year’s championship.\nAubrey Semler – Penn State field hockey (Parkland)\nThe senior forward scored the fourth goal and assisted on the third for the Nittany Lions in an 8-0 victory at Lock Haven last Friday, the team going to 7-8 overall and 2-5 in the Big Ten Conference. Samler has three goals and two assists playing in all 15 games with 13 starts. She had the game-winning goal in a 5-2 triumph over Kent State on Sept. 9. She has taken 20 shots with 13 on goal.\nAbby Burnett – Michigan field hockey (Emmaus)\nThe junior midfielder has played in 13 games with 9 starts for the Wolverines who are 8-6 overall and 3-4 in the Big Ten Conference after a 2-0 loss at 10th-ranked Iowa Sunday. All six losses have come against nationally ranked teams. Burnett has picked up four assists, giving her 10 in 50 games for her career. She also helps out on the defensive side, Michigan giving up 18 goals in the 14 games with three shutouts.\nMario Landino – Indiana football (Emmaus)\nThe 6-foot-4, 284-pound sophomore is seeing action with the Hoosiers who are 8-0 and ranked second in the Associated Press poll. Landino has seen action in all eight games and has 16 tackles, six unassisted, with four sacks which ranks fourth on the team. He saw action in all 12 games last season as a true freshman and was one of five first-year players who weren’t redshirted.\nPatrick Shupp – Delaware football (Easton)\nThe graduate student and sophomore Noah Rosahac (Jim Thorpe High) both start on the offensive line for the Blue Hens, who are 4-3 overall and 2-2 in Conference USA play after a 31-28 conference victory over Middle Tennessee last Wednesday in Newark, Delawaare. The duo helped the team post 377 yards in total offense. On the season, Delaware is averaging 419.7 yards in total offense, including 299.4 passing.\nMaura Lenhart – Kutztown women’s cross country (Southern Lehigh)\nThe junior finished 10th out of 158 runners to lead the Golden Bears to a fifth-place finish at the PSAC Cross Country Championship last Saturday in Edinboro. She had a 6,000-meter time of 23:03.4. Redshirt senior Jack Hollar (Pocono Mountain East) was the top runner for the Kutztown men’s team which finished third. He was 14th out of 166 entrants with a personal best time of 25:35.2 over the 8,000-meter course.\nEmma Bonshak – Rider (N.J.) field hockey (Whitehall)\nThe junior forward has started all 16 games for the Broncs who are 7-9 overall and 4-4 in the Northeast Conference after a 2-1 non-conference loss at Lehigh last Sunday. Bonshak has scored five goals on nine shots and three assists and had her best game of the season in a 6-2 victory over Long Island on Oct. 17 when she had two goals and an assist. She leads the team in minutes played with 987.\nMatt Clark – Duquesne football (Easton)\nThe senior placekicker had a big game for the Dukes in a 37-0 Northeast Conference victory over Mercyhurst on Oct. 18. Clark had field goals of 31, 27 and 26 yards and was 4-for-4 kicking extra points. He’s sharing the placekicking duties, and has hit 3-for-4 in field goals and is 13-for-14 in extra points. His field goal miss was from 49 yards in a 24-13 loss to Wagner last Saturday. Duquesne is 5-4 overall and 3-1 in NEC play.\nJake Haberstumpf – Drexel men’s golf (Freedom)\nThe junior led the Dragons to their third straight Temple Invitational on Sept. 22-23 in Philadelphia. Haberstumpf finished third out of 72 goals with a three-round total of 212. He had back-to-back 1-under rounds of 69 but had to settle for a 74 in the final round to end up 2-over-par. He was named Dragons’ Male of the Week on Sept. 29. Junior John Keba (Central Catholic) is also on the squad and had a two-round 152 in the Georgetown Intercollegiate on Oct. 13-14.\nWilliam Salivonchik– Marist (N.Y.) men’s soccer (Nazareth)\nThe 5-foot-9, 160-pound freshman has played in 11 games with 10 starts on defense for the Red Foxes who are 7-3-3 overall and 3-3-1 in the Metro Atlantic Athletic Conference after a 3-1 conference victory over Rider last Friday. Salivonchik has been on the field for 687 minutes and played all 90 minutes in three games. He hasn’t had a shot on goal but has helped Marist hold foes to 19 goals (1.46 goals against average with three shutouts. The team has given up just one goal in five other contests.\nBrady Thompson – Bloomsburg football (Upper Perkiomen)\nThe 6-foot-1, 235-pound linebacker had nine tackles, eight unassisted, and a sack to help the Huskies score a 37-21 decision at Millersville last Saturday, the team moving to 2-6 overall and 1-4 in PSAC East play. The redshirt junior is second on the team in tackles with 57, 31 solos, with two sacks. He had 14 tackles in a 41-40 overtime loss to Fairmont State in the season opener. Thompson has 209 tackles in 29 career games with five sacks and 18 hits for losses.",
  "word_count": 1018,
  "scraped_at": "2026-02-14T14:21:27.381957"
}