{
  "article_id": "e130dee43a8d",
  "url": "https://www.afl.com.au/news/1075814/afl-reveals-2023-financial-result",
  "title": "2023 AFL Financial Results",
  "date": "20240212T074500Z",
  "domain": "afl.com.au",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "The AFL has today forwarded its 2023 financial results to the Presidents and Chairs of the 18 clubs, in the lead-up to next month’s Annual General Meeting.\nThe AFL reported an underlying operating surplus of $27.7 million in 2023, compared with an underlying operating surplus of $20.7 million in 2022 - an increase of $7 million. This result includes the AFL’s controlled state subsidiaries, Marvel Stadium and Champion Data.\nIn his review of the year, AFL Commission Chair Richard Goyder thanked the collective industry, including the 18 AFL clubs and the game’s fans, for delivering a record year across all major metrics.\n“The collective effort from our football community, from our clubs, our players, coaches and officials, our committed broadcast and corporate partners and especially our football fans, delivered one of our best and biggest football calendar years on record,” Mr Goyder said.\n“The AFL season was nothing short of remarkable, both in the quality of the football played on the ground and in the support of it, and the incredible momentum built through the year culminated in one of the greatest premiership seasons and final series the game has seen. I want to congratulate everyone who played a part.\n“The same was true of our AFLW season where the football was the best we have witnessed with an amazing finals series that enthralled all and we are committed to working with the AFLPA and players and clubs to continue to expand the numbers of those watching and attending.\n“The inaugural Gather Round was a highlight and was the best of our game on so many levels and the interest in the round this year – and booming ticket sales – demonstrates how much fans and football families are looking forward to returning to South Australia in April to share in the experience again.\n“This year we saw the announcement of a new team for Tasmania, and a new and historic joint Collective Bargaining agreement with the players which saw, for the first time, both the AFL and AFLW players part of a joint agreement. AFLW players received an additional 29% uplift on top of the 94 per cent jump in 2022 and all AFL players a 10 per cent uplift.\n“We also achieved a record number of participants, off the back of the Commission’s 2022 commitment to enshrine at least 10 per cent of all football revenue to invest back into game development and community football – a move that acknowledged the importance the grassroots level powered by the tens of thousands of volunteers have on not only the success of the elite game but the ability to bring communities together and provide a sense of belonging. Almost $90 million was spent on Game Development initiatives in 2023 – up by nearly $29 million.\n“I want to thank the boards and staff of the 18 clubs, our players, umpires and our own AFL Executive and team, for the work they did, and the decisions they made, to ensure football prospered around the country, and the game remained accessible and affordable to all at a time when cost of living pressures increased.\n“Most of all, I want to thank our members and supporters for their passion and commitment to their clubs and everyone who watched the games and supported us collectively across both the NAB AFL Women’s Competition and the Toyota AFL Premiership Season.”\nThe all-time AFL attendance record was broken in 2023 with 7,475,145 fans attending a home and away match during the 2023 Premiership Season. This was 523,841 more than the previous record set in 2019 (6,951,304). The average crowd per round was 311,464 fans.\nThere were more blockbuster crowds in 2023 than any other home and away season in the history of the game, five times a single match had more than 85,000 fans attend, nine time more than 80,000.\nTotal AFL Club membership reached an all-time record 1,264,952 members in 2023, surpassing the record of 1,190,671 that was set in 2022 – a jump of 6.2 per cent growth.\nOne in every 21 Australians is currently a member of an AFL club.\nAFL Chief Financial Officer Matthew Chun said the financial results were a testament to the planning and discipline of the industry.\n“As an industry, we have worked hard to recover from the covid years and rebuild the revenue base to ensure a surplus while at the same time increasing distributions to clubs, players, investment in game development and the running of AFLW,” Mr Chun said.\n“Our cash position was significantly boosted by the final instalment of the $225 million Government grant for the Marvel Stadium redevelopment which was completed at the end of 2023 and will provide ongoing benefits and opportunities for the tenant clubs, our fans, the wider AFL industry and the Victorian community.\n“Our balance sheet remains strong. The co-ordinated effort to reduce the industry cost base and protect revenues means the AFL was able to report a cash surplus for the financial year.\n“The focus remains on the rebuilding and strengthening of the industry balance sheet that will enable future investment in the growth and development of our game from grassroots through to the elite platforms while still investing significant funding into important initiatives such as player mental health and welfare.\n“It is important that we continue to drive cost discipline in 2024 ahead of the new broadcast deal in 2025 to ensure that we are able to continue to invest in all levels of our game and ensure it remains affordable and accessible for everyone to enjoy our game.”\nIn line with this objective, the AFL has again this year frozen the price of all GA ticket prices at the MCG and Marvel Stadium for the sixth season in a row.\nKey AFL financial summary\nThe AFL’s operating revenue increased by $104.5 million due to a combination of improved commercial returns from Marvel Stadium and commercial partnerships, the introduction of Gather Round and contractual increases in broadcast revenue.\nThis revenue was used to fund the following investments:\n* $393.8 million to AFL clubs (up from $337.5 million in 2022)\n* $89.7million to Game Development (up from $60.8 million);\n* $57.2 million in running the AFLW competition (up from $45.3 million);\n* $41.5 million to the AFLPA (up from $27.1 million);\n* $14.4 million to infrastructure comprising of elite and community facilities and contributions for stadia redevelopments (down from $17.4 million); and\n* $0.9 million to corporate and social responsibility initiatives (up from $0.7 million).\nOperating expenditure increased by $10.6 million due to a combination of revenue-related Increases, while distributions to Clubs increased by $56.3 million.\nDistributions increased by $96.7 million, largely due to the new Collective Bargaining Agreement across Men’s and Women’s and increased Game Development investment following the Commission’s resolution to commit a minimum of 10% of assessable football revenue to community football.\nThe AFL’s cash balance at the end of the financial year decreased from $178.2 million to $164 million. This movement is due to a payment made to the AFLPA for $55 million for their share of revenue accrued from 2017 to 2022; offset by operating result of +$27millon and an improved working capital position of +$14millon.\nThe total payments to AFL Executives equated to $13.6 million, compared to $11.8 million in 2022. This figure accounts for the change in executive structure and transition costs associated with the departure of former CEO Gillon McLachlan on 2 October 2023, after 23 years at the AFL, and the appointment of new CEO Andrew Dillon on 1 May 2023.\nAfter all revenue, operating expenditure and distributions, the AFL recorded an underlying operating surplus of $27.7 million, compared to an underlying operating surplus of $20.7 million in 2022.",
  "word_count": 1287,
  "scraped_at": "2026-02-14T12:07:39.053808"
}