{
  "article_id": "e160be6061e8",
  "url": "https://www.yahoo.com/news/gary-lineker-interview-silent-gaza-103000789.html",
  "title": "Gary Lineker interview : If you are silent on Gaza , you are complicit",
  "date": "20250515T123000Z",
  "domain": "yahoo.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Gary Lineker interview: ‘If you are silent on Gaza, you are complicit’\nThe key event in Gary Lineker’s week should have been presenting Saturday’s FA Cup final on the BBC, a week before he hosts Match of the Day for the last time. Instead he has found himself fighting for his reputation and career after sharing a pro-Palestine post on his Instagram account that featured a rat emoji historically used as an anti-Semitic slur.\nThe backlash was swift; the Board of Deputies of British Jews called for him to be sacked rather than leave on his own terms, there was uproar among Jewish staff at the BBC and Lineker himself offered an unprecedented and unreserved apology after claiming ignorance over the symbol’s meaning.\nWhen I met Lineker last Friday such a furore may have seemed unlikely but not impossible – after all, in the past few months he has reposted increasingly incendiary verdicts on the Israel-Hamas war.\nWhat Lineker has not done, until now, is explain why he acts as he does, making public comments on Gaza when many would argue he is ill-informed. This is his reason.\n“We’re seeing it live-streamed into our own phones – I’ve never seen that before,” he says when we meet at the Football Business Awards (where he collected an award for outstanding contribution to the game) three days before reposting the video featuring the rat emoji.\n“It’s beyond depraved, what they’re going through, unimaginable. I’ve got kids. They’re grown-up now, but every day people are losing their children, their brothers and sisters. I don’t know how the world thinks this is OK. We still seem to be on the side of the people who are doing this. We’re still supplying arms. And you think, ‘Wow, how?’ The vast majority of people see it for what it is now. Unfortunately, the Government’s not doing much about it. It comes down to power and money. But what we’re allowing to happen is beyond the pale.”\nLineker risks being portrayed as having selective sensitivity, only reacting to one side of the story. For example, on October 7, 2023, when Hamas launched an attack of psychopathic brutality that ended in 1,141 deaths, the worst single-day massacre of Jews since the Holocaust, he apparently had nothing to say, his only tweet declaring: “Super Spurs are top of the league.” Journalist Nicole Lampert later confronted him in person over this, reflecting that his failure to address the dozens of Israeli hostages in Gaza left her “shaking with anger”. Some 19 months on from those atrocities, he is still in no mood to adjust the balance of his commentary.\n“It has been completely out of proportion to what happened,” he says of the Israeli response. “Obviously October 7 was awful, but it’s very important to know your history and to study the massacres that happened prior to this, many of them against the Palestinian people. Yes, Israelis have a right to defend themselves. But it appears that Palestinians don’t – and that is where it’s wrong. Palestinians are caged in this outdoor prison in Gaza, and now it’s an outdoor prison that they’re bombing. Israel say it’s self-defence, but really? Self-defence against what now? Yes, I understand that they needed to avenge, but I don’t think they’ve helped their own hostage situation at all. People say it’s a complex issue, but I don’t think it is. It’s inevitable that the Israeli occupation was going to cause massive problems, and I just feel for the Palestinians.”\nWhen I stress to him that he is bound to spark a backlash with these remarks, he shoots back: “I don’t really care about the backlash. I care about doing the right thing, or what I think is the right thing. Some people can disagree, that’s fine. But I have to look at myself in the mirror. I think if you’re silent on these issues, you’re almost complicit.”\nWhat about the fury he had already unleashed within the Jewish community, even before this week? “Well, even some of their people have changed lately,” Lineker says. “The real heroes are the Jews who have spoken out against it. It’s the Israeli government I’m critical of, not Jewish people. Most Jewish people recognise this for what it is now, that it’s wrong.”\nAnd for Lineker, the subject of right and wrong is simpler than it may be for others.\n“You either have empathy or you don’t,” he says. “It’s more important now than ever before that people raise their voices, because we live in dangerous times. I’ll definitely continue pushing humanitarian issues. Sometimes they cross over with politics, although I’ve never been overly loud with my politics. Nobody knows who I vote for – I’ve voted for lots of different parties over many years. You feel sometimes like you’re fairly helpless, like you can’t really do anything. But you have to live with yourself. That’s the important thing.”\nMore in Sports\nThis sharp binary means he is sometimes seen, I put it to him, as posturing as some moral arbiter. “Oh, that’s the Daily Mail,” he snorts derisively. “What do they know about morality?” Well, James O’Brien, the radio presenter and fellow high priest of London’s bleeding-heart liberals, christened his book How to be Right. “James can speak for himself,” he grins. “And he does it very well.”\nIs Lineker confident he absorbs the fullest range of beliefs, even those that contradict his own? “Definitely. That’s very important, when all we hear now is one side or the other shouting loudly. Most of us are somewhere in the centre.”\nThere is little doubt that the latest furore will overshadow Lineker’s exit from Match of the Day, a show he has helmed since 1999. Perfecting this laconic shtick has made him comfortably the BBC’s highest earner, on £1.35 million a year, even if he is not quite sure how.\nAt the age of 64 he has negotiated a curious half-in, half-out epilogue to his BBC career, which involves him relinquishing MotD but staying on as host for next season’s FA Cup and the 2026 World Cup.\nBut is he truly happy about departing at all? He stirred much intrigue when, speaking to the BBC’s Amol Rajan last month, he said people within the organisation “ wanted me to leave”. Who did he mean? Was he referring here to Alex Kay-Jelski, the BBC’s director of sport? Unlike his predecessor Barbara Slater – so gushing in her praise of Lineker that she told MPs in 2023: “We love Gary and Gary loves the BBC” – Kay-Jelski, former editor-in-chief of The Athletic, has offered no such lavish endorsement of the star man since his appointment in April last year. Has it seemed a dramatic change of regime?\n“I think it has, and that’s what I was alluding to,” Lineker confirms. “He has his reasons, he wants to change Match of the Day a bit. Ultimately, I don’t think they will, because I don’t see how you move a highlights show away from being about highlights. I think he wants more journalists – he has come from that background. He has got no television experience.”\nAt one stage, a radical career change was mooted by his employers. “It’s funny, when I was talking to the Beeb and they told me they didn’t want me to do another three years, they said, ‘We think you could do a cooking show’,” he recalls, rolling his eyes. “Are you kidding? I thought it was hilarious.”\nLineker is desperate to protect the brand he has so meticulously created. When I ask if MotD should retain the elements he has introduced – the blokeishness, the badinage with his fellow pundits, the folksy asides to the camera – he says, with a wry chuckle: “I suspect, for all the thoughts of change, that the show will pretty much stay as it is. That’s my gut feeling. I think they’d be mad, absolutely mad, to mess around with Match of the Day. It has taken years and years to get the right balance. I would be nervous if they fiddled with it too much. It’s that old adage, ‘If it ain’t broke, don’t fix it’.”\nWhile amiable to the point of insouciance, Lineker has an acute sense of his own worth. Over 26 years, he has turned MotD into a ratings juggernaut, watched by more than five million viewers across BBC One and iPlayer. “The sort of numbers,” he says, proudly, “of which Sky would dream.” This explains why Lineker, protecting the sense of leaving on a high, will not countenance any equivalent role beyond his final major tournament next summer. “Once I’ve done the World Cup, I won’t be a football presenter again,” he reveals. “I’ll focus more on my podcast empire.”\nHe emphasises the word “empire”, relishing his position as undisputed doyen of digital audio. Lineker’s production company, Goalhanger Podcasts, boasted more than 400 million downloads last year, while live shows at the Royal Albert Hall with The Rest Is Politics hosts Rory Stewart and Alastair Campbell sell out within minutes. As he enters his imperial phase, Lineker has acquired a reach so vast that it appears sometimes as if he is dictating the news agenda all by himself.\nOn The Rest Is Football, where he has belied his squeaky-clean BBC image with the odd profanity, he described England’s performance against Denmark last June as “s--t”. The remark dominated headlines for a week, stirring even captain Harry Kane to defend his team’s honour in the face of ex-player critics. “There’s an obsession at one or two newspapers with me, which I’ve always found slightly bizarre,” he says. “But they were giving us incredible publicity, so I’ll be eternally grateful.”\nLineker is not quite sure what he will do next, or where he will go. He discusses a wish to travel to India to watch cricket, and to return to Mexico for the first time since the World Cup in 1986, where he won the Golden Boot for England.\nHe also promises to resist any inclination to move into the political sphere. “I won’t get involved in politics, I never really have. Apart from the Brexit vote, because I did a lot of research on that and decided, ‘This could be worse than we think’. I never back a government. I might criticise Sir Keir Starmer on Israel. But nobody knows my politics.”\nOne other area where Lineker has been noticeably silent is a subject where centrist-dad equivocations are difficult: men masquerading in sport as women. This has been front-page news in his own realm, with the Football Association forced this month to ban males from all levels of the female game, honouring the Supreme Court’s ruling that the definition of a woman was based on biological sex. And yet Lineker has consistently swerved it. When his podcast, The Rest Is Football, tried a public question-and-answer experiment last November, Martina Navratilova, Sharron Davies and hundreds of other women asked him what he thought of the FA banning a teenager – revealed by The Telegraph last weekend as Cerys Vaughan – for asking a transgender opponent: “Are you a man?” Even under pressure from a nine-time Wimbledon singles champion and a celebrated Olympic swimmer, he neglected to engage. Why?\n“Ugh,” he sighs, slumping so far forward in his chair he nearly hits the table. “You can’t cover that subject properly in a post. It’s too nuanced. I don’t actually think, in terms of sport, that it will ever be a real issue. Sport, as it’s already doing, will sort it out and work out rules. Like they did in boxing, when they realised they couldn’t have heavyweights against little fellas.”\nIs it not blindingly obvious, however, that sport will not simply “sort it out”? It has taken many determined female campaigners a punishingly long time to undo the damage of gender ideology, compelling sports to prioritise fairness for women rather than vacuous mantras about inclusion. Amid broad acceptance that the rights of half the population should trump the view of a small, vocal minority of men that they are entitled to colonise women’s sport, Lineker makes it clear where his sympathies lie. “They’re some of the most persecuted on the planet, trans people. You’ve got to be very careful not to have bigoted views on that. I genuinely feel really badly for trans people. Imagine going through what they have to go through in life. Is there even any issue? It’s the same swimmer, the same weightlifter, the same boxer. They’re the only people I ever see.”\nLineker’s perspective here is myopic. The three examples he raises – American swimmer Lia Thomas, New Zealand weightlifter Laurel Hubbard, and Algerian boxer Imane Khelif, not transgender but permitted to win gold as a woman at the Paris Olympics despite sex tests indicating the presence of male chromosomes – are indeed well-publicised. But they are far from the only ones he could cite, with a recent report by Reem Alsalem, the United Nations special rapporteur on violence against women and girls, documenting how governing bodies’ failures to act had led to more than 600 female athletes around the world losing 890 medals in 29 different sports.\nIn his eyes, only cases at elite level matter. “We’ve got the Women’s Euros in the summer. Let’s see if there’s one issue – I don’t think there is. Are you telling me that there are many people who pretend to be women just so they’re going to be good at sport?” The desire of some males to receive affirmation as female can be a powerful motivating force, I argue. “It’s so complex,” Lineker says. “I see both sides to a degree.”\nAn irony of Lineker’s latest storm is that he had been talking to me days before about how he had moderated his posts on Twitter/X, previously his platform of choice, in response to the coarsening of the platform under the stewardship of Elon Musk. “I was open-minded at the start,” he says. “But now it’s like you’ve got Bond villains in charge of America.”\nYou wonder if Lineker will be so bold as to say that for his swansong, when he leads the BBC’s coverage of the World Cup from the US. “Yes,” he says. “If they let me in.” He has form, after all: at the last tournament in Qatar, in 2022, he opened with a monologue decrying the Gulf state’s draconian laws on homosexuality and its record of human rights abuses. The one imponderable, after the firestorm he has ignited this week over his Gaza post, is whether he will still be in position to deliver the speech he intends. Either way, Lineker seems implacably committed to going down in flames.",
  "word_count": 2459,
  "scraped_at": "2026-02-14T12:11:31.929704"
}