{
  "article_id": "e16a7640dd13",
  "url": "https://www.insidermonkey.com/blog/nike-inc-nysenke-q3-2025-earnings-call-transcript-1489278/",
  "title": "NIKE , Inc . ( NYSE : NKE ) Q3 2025 Earnings Call Transcript",
  "date": "20250322T150000Z",
  "domain": "insidermonkey.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "NIKE, Inc. (NYSE:NKE) Q3 2025 Earnings Call Transcript March 20, 2025\nNIKE, Inc. beats earnings expectations. Reported EPS is $0.54, expectations were $0.3007.\nOperator: Good afternoon, everyone. Welcome to NIKE, Inc. Fiscal 2025 Third Quarter Conference Call. For those who want to reference today’s press release, you’ll find it at investors.NIKE.com. Leading today’s call is Paul Trussell, Vice President of Corporate Finance and Treasurer. Now I’d like to turn the call over to Paul Trussell.\nPaul Trussell: Thank you, operator. Hello, everyone, and thank you for joining us today to discuss NIKE Inc’s Fiscal 2025 Third Quarter Results. Joining us on today’s call will be NIKE Inc. President and CEO, Elliott Hill; and our CFO, Matt Friend. Before we begin, let me remind you that participants on this call will make forward-looking statements based on current expectations, and those statements are subject to certain risk and uncertainties that could cause actual results to differ materially. These risks and uncertainties are detailed in NIKE’s reports filed with the SEC. In addition, participants may discuss non-GAAP financial measures and non-public financial and statistical information. Please refer to NIKE’s earnings press release or NIKE’s website, investors.NIKE.com, for comparable GAAP measures and quantitative reconciliations.\nAll growth comparisons on the call today are presented on a year-over-year basis and are currency neutral, unless otherwise noted. We will start with prepared remarks and then open up for questions. We would like to allow as many of you to ask questions as possible in our allotted time, so we would appreciate you limiting your initial question to one. Thanks for your cooperation on this. I’ll now turn the call over to NIKE Inc. President and CEO, Elliott Hill.\nElliott Hill: Thank you, Paul. Good afternoon, everyone. I’ll start by saying I’m proud of the progress we made against the key actions we committed to 90 days ago. While we met the expectations we set, we’re not satisfied with our overall results. We can and will be better. For the quarter, the big takeaway for me was clear. When we lead with sport, we create impact for NIKE. We told inspiring athletes stories, we brought more energy to sports biggest moments, and we introduced performance product across an integrated marketplace. We delivered something new to the consumer week after week and that’s exactly the kind of sustained pace we need to strengthen our business. Last quarter, I shared my initial observations and where we need to focus.\nThe last 90 days only reinforced my early assessment of the areas that are most important. Since our last call, I continued to meet with wholesale partners to discuss the distinct role each can play with NIKE. I also had an incredibly inspiring trip to visit factory partners and NIKE teammates in Asia to see how we’re executing in our supply chain with a focus on production for our new innovation. Most importantly, I continue to spend meaningful time with our NIKE teammates. We focused in two areas: strengthening our culture; and committing to our top priorities. In fact, right after my first call with you in December, we met with our teams and shared the five priority actions we outlined on the call, with a sharp focus on five fields of play, three countries, and five cities.\nWe call these strategic priorities Win Now. We have a clearer picture on our path forward, and despite the global economic uncertainty, I believe our priority actions will continue to drive progress. The first action is to ignite our winning culture. As I mentioned, our teams are building momentum. We’re hustling and being opportunistic. The next action is shaping our brand for distinction. This is about lining up storytelling power of NIKE to celebrate the passion and emotion of sport. In February, I attended the Super Bowl and the NBA All-Star weekend to see firsthand the kind of impact we make when we line up all of our advantages towards one moment. Our third action is to accelerate a complete product portfolio. We’re fully committed to creating a more breadth and depth season after season.\nWhile we added innovation across our five key fields of play this quarter, it’s not enough to offset the continued headwinds of our classic franchises. Elevate and grow the marketplace, the fourth action is a balanced approach where we’re supporting wholesale partners to drive healthy growth and returning NIKE Direct to a premium destination. We’re in the early stages of repositioning NIKE Digital and we’re restoring our sales organization and go-to-market processes. The final action, Win on the Ground, is where we celebrate local athletes, make cultural connections, and support grassroots communities. A big reason for our running product success this quarter was the resources we put into building energy through the ground game. Of all the priority actions, we knew we could move quickest on investing in our brand.\nYou saw that in several defining moments this quarter. I’ll start with the Super Bowl in New Orleans. It was a course. It starts with our close partnership with the NFL and our high performance uniforms, cleats, and gloves that everyone sees on the field. Our product visibility goes well beyond four quarters. From Jalen Hurts wearing his red and black unbannable Jordan cleats during warm-ups, to Kendrick’s halftime show wearing Deion Sanders’ Retros, and Serena Williams and SZA wearing Chuck Taylors. Our three iconic brands were front and center. We, of course, also debuted So Win, our first Super Bowl ad in 27 years where we celebrated the winning mindset of the top athletes in the world. We also showed up on the ground in New Orleans to support flag football with a sharp focus on girls and a commitment to increasing their participation in the game.\nWe created pop-up retail spaces across the city with partners like Dix, Sneaker Politics, and Hibbett, and built NIKE and Jordan houses to connect with athletes, influencers, partners, and wholesale retailers. After the win, we followed up with strong, reactive campaigns. The NIKE brand created it’s Good to Be Green for the Eagles win, and for Jaylen’s MVP, the Jordan brand aired its first Super Bowl ad in history, Love Hurts. That is how we create impact and that is NIKE being NIKE. We transitioned from one amazing weekend right into another for the NBA All-Star weekend in the Bay area. Our brands, in one word, dominated. On both sides of the Bay, NIKE, Jordan, and Converse owned performance and the culture of the game, connecting with young athletes and fans through unique experiences.\nNIKE celebrated the future of basketball, hosting games with top high school prep stars. At the Alameda Navy Yard, the Jordan Fam Fest celebrated the brand’s biggest moments for its 40th anniversary with thousands of fans. And Converse unveiled the first signature shoe for Shai Gilgeous-Alexander, the Shai 1, designed by Shai himself as the new creative director for Converse basketball. His shoe will launch this fall. All told, NIKE Inc. lit up the marketplace on the ground. Our NIKE San Francisco flagship store had its best commercial day in 10 years. And just down the street, we created energy and buzz with our wholesale partners, Foot Locker and Shoe Palace. One thing it was great to see, for the right product drops, like the NIKE Black Label collection, the Kobe Protro’s, Jordan Red Wands, and Jordan [Forest Cements] (ph), the passion of sneaker culture is alive.\nI saw lines down the block all weekend. An important part of our strategy moving forward will be to harness the full power of our portfolio of brands. We made significant progress in elevating the voices and distinct position of our brands at the Super Bowl and All-Star weekend. Shifting to products, we’re beginning to drive a more diversified portfolio. It will take time to reach the volume to replace the handful of classic franchises we over-indexed on. But our approach is simple. Help consumers fall in love with something new from NIKE, and that something is not replacing one icon for another. It’s about building a supporting cast of multiple styles, some that are gaining interaction with men and others with women’s. Segmenting and differentiating our wholesale partners across the integrated marketplace, investing in the presentation of our products at point of sale, digital and physical, and having an intentional ground game in influential cities.\nAnd we will lead with performance, with a disciplined approach that balances product that’s seeding with product that’s scaling. Running with the standout field of play for the quarter, growing mid-single digits, the PEG-41 is continuing to drive healthy volume in all geos. And two innovations that have just begun to seed are the Pegasus Premium and the Vomero 18. The Peg Premium is NIKE bringing something totally unique to the market, a full, visible air zoom unit that, for the first time, we sculpted to the foot so it springs back for better energy return. It’s a great ride and a beautiful looking shoe. Early seed pairs nearly sold out across the North America marketplace, and the Peg Premium will scale through fall 2025. This quarter, we launched the Vomero 18, created for the everyday runner.\nWe aligned the storytelling of the Vomero 18’s big foam and maximum cushioning across over 1,800 doors in the integrated marketplace, RSG, sporting goods, NIKE Direct, the results have been outstanding. We plan to build on the momentum and double the distribution of a Vomero 18 by mid-April, supported by a large-scale running campaign. You can expect new additions to the franchise to release in our next fiscal year. In running, we’re on the path to meeting our high standards of execution end-to-end. Turning to sportswear, our life’s largest icons, NIKE and Jordan Streetwear, are in different states of transition. With Air Force 1, Donk, and Air Jordan 1, it’s about right sizing, not sun setting. Each franchise will always have a place in our stable of products.\nThey’re timeless staples with loyal fans. Our best example of healthy diversification in sportswear, footwear right now is our look of running. The Vomero 5 doubled its revenue this quarter. NIKE Shox has grown its revenue by over 10 times in the last three quarters. And while in the seeding stage, recently released shoes like the Air Superfly and the LD1000 are getting a lot of positive interest in the media and on social channels. Air Max, a brand in itself, is a platform that consumers expect us to reinvent. This quarter we brought fresh energy with the new DNA, which is resonating well with consumers in Japan and Korea, and women’s silhouette in the Air Max Muse. Look for another new innovation platform with Air Max in FY 2026. Diversifying our sportswear apparel offense is equally important.\nWe want to minimize our reliance on fleece and push the edges to build new businesses. And that doesn’t have to fit neatly into the sportswear category either. This quarter’s new 24/7 collection brings performance materials to high-style training apparel. The new impossibly soft and perfect stretch fabrics gave us the opportunity to tell a deep technical apparel story. The first month of sales in 24/7 had exceeded our expectations and were ramping up capacity to meet the demand. We also made some noise with the announcement of a new brand this quarter, NIKESKIMS. Together we identified a consumer need and are creating a new market of style-led product that sculpts and performs. Our first comprehensive collection launches next quarter in North America through both NIKE and SKIMS Direct channels and we will scale globally over multiple seasons.\nThe apparel space is right for fresh thinking, and I’ve asked our team to keep innovating across the spectrum of performance and style, and to seek out white space in the market to complement our brands and product portfolio. Our responsibility is to grow the overall market, and one of the most powerful ways we do that is through a relentless flow of coveted and innovative product through our powerful brands in both performance and sportswear for men, women, and kids across footwear, apparel, and accessories, and up and down price points. We’re moving with focus and urgency to get back into a rhythm of delivering across all dimensions. The final topic I’d like to discuss in detail is the integrated marketplace, where we create consumer-led experiences across NIKE Direct or our wholesale partners, physical or digital.\nIn the almost 190 countries in which we do business, we have over 40,000 points of distribution and a digital business with massive reach. Our footprint is an unbeatable competitive advantage. That means that a lot of change is in motion, because we want to be great at all touch points. And I’m playing an active role in this one, leveraging my years of experience and relationships in the marketplace. Here’s what we’re going to prioritize. First, I mentioned, we’re restoring our sales organization and go-to-market processes. Partnering with NIKE must feel like a world-class experience. That means, building growth plans together, creating distinct consumer positions and consumer-right assortments, engaging way earlier in the process and asking for product feedback, delivering our assortments at the right time, right place, and at the right depth.\nEducating their teams on new innovations, providing marketing support, and making certain their NIKE presentation is premium so we capitalize on every sale opportunity. In NIKE Direct, Digital will feel the changes more quickly. We’re already reducing the promotional days and discounting at lower rates. In fact, comparing last year’s January and February to this year’s, NIKE Digital in North America went from over 30 promotional days to zero. In our ecosystem, the consumers are already seeing a more elevated content and storytelling with a greater focus on our performance fields of play. Now that I’ve had the opportunity to visit each geography, we’re clear where we will focus to make an immediate impact. Through our Win Now strategic priorities, we’ll start with three key countries, the United States, China, and the United Kingdom, and five key cities, New York, Los Angeles, London, Beijing, and Shanghai.\nWe’ll invest to make sure each has innovative and coveted products, a loud and proud locally relevant brand voice, a consumer-led and balanced integrated marketplace, and passionate NIKE teammates on the ground. Each country has unique dynamics and is in a different state of development. China specifically is where we’re being the most proactive and cleaning up the marketplace. And we’ll get back to inspiring the Chinese consumer in a more meaningful way. To close, our consumers and partners felt a different pace from NIKE this quarter. We’re off to a solid start. And where we are making progress in our five priority actions, it’s mostly through serving athletes, through the lens of sport and performance. That’s exactly where we want to be.\nThe bottom line is we are looking for opportunity on all fronts. Now, it’s up to us to be consistent. Some of the bigger shifts I have covered will take multiple seasons of excellent execution. Our teams are moving with focus and urgency and are up to the challenge of writing the next great chapter for NIKE. I’ll pass it to Matt to provide initial thoughts on the building blocks to return to sustainable and profitable growth, and I’ll be back to close out the call.\nMatt Friend: Thanks, Elliott, and hello to everyone on the call. The team is moving aggressively to reignite brand momentum through sport and stabilize our business. Our third quarter financial results reflect the headwinds from the Win Now actions we identified for you last quarter. Today I will review our third quarter results and provide context on the progress we have made. Then I will share additional insight for how we expect our Win Now actions to shape our business performance over the near term. This quarter, revenues were down 9% on a reported basis and down 7% on a currency neutral basis. The quarter benefited from strong holiday results in December, including a non-comp benefit from Cyber Monday, followed by double digit declines in January and February.\nNIKE Direct was down 10% with NIKE Digital declining 15% and NIKE Stores declining 2%. Wholesale was down 4% largely due to declines in Greater China. Gross margins declined 330 basis points to 41.5% on a reported basis, due to higher markdowns on NIKE Direct, higher wholesale discounts, inventory obsolescence, and product costs and channel mix headwinds. SG&A was down 8% on a reported basis, as increased investments in brand marketing and sports marketing were more than offset by declines in operating overhead. Our effective tax rate was 5.9% compared to 16.5% for the same period last year, primarily due to a onetime tax benefit from US tax regulations related to foreign currency gains and losses. Earnings per share was $0.54. Now let me provide additional insight into our progress against our Win Now actions this quarter.\nLet’s begin with our product portfolio. Our performance business grew in the third quarter, led by improving brand and business momentum in training and running, with new product launches, strong sell through of innovation, and a more complete offense across price points in footwear and apparel. This momentum is encouraging since these two sports represent our largest performance businesses. For Q3, this momentum was more than offset by declines in NIKE sportswear and the Jordan brand, led by a double-digit decline in our classic footwear franchises. These franchises again decelerated faster than the overall business, with a more pronounced impact on NIKE Digital. Turning to our marketplace, our teams have taken the initial steps to reposition NIKE Digital as a full-price business.\nWe remained competitive and promotional in December, finishing with strong holiday results. However, in January and February, we significantly reduced days of promotion in North America and EMEA. This resulted in a several percentage point improvement in demand at full price. With regards to wholesale, since Elliott has returned, we are working as closely with our partners as ever. We are creating confidence through the investments we are making in product engagement, commercial terms, and rebuilding the scale, talent, and capabilities of our sales organization. Within our fall order book in North America, EMEA, and APLA, we see the declines in classic footwear franchises almost being offset by growth in performance dimensions of our portfolio, such as running, training, and basketball, as well as newness in sportswear.\nNow let’s talk about the health of our brands. Elliott mobilized our teams this quarter to go bigger and bolder in sports biggest moments. As a result, we supported several new product launches across all three brands. And also delivered outsized brand impact with emotional storytelling in the air and on the ground in key cities. And you felt it. To support this action demand creation expenses grew high single digits versus the prior year. Last, let’s discuss inventory. Inventory declined 2% versus the prior year. But as I said last quarter, inventory remains elevated across all geographies as we implemented our Win Now actions after inventory was purchased and in transit. While we are seeing some increases in customer cancellations, the larger driver of our inventory is the buys for NIKE Direct.\nIn addition, across the marketplace, we are beginning to see Air Force 1 inventory stabilized with current retail sales, while Air Jordan 1 and Dunk remain elevated with continued actions planned ahead. With that, let me turn to our operating segments. I will focus my commentary on the progress we have made in each of our geographies on our Win Now actions. In North America, Q3 revenue declined 4%. NIKE Direct declined 10%, with NIKE Digital down 12%, and NIKE Stores down 6%. Wholesale increased 3%, due primarily to favorable shipment timing and increased shipments to our value partners in the third quarter. EBIT declined 21% on a reported basis. Throughout the quarter, we delivered bold and inspiring storytelling and key sports moments, as Elliott mentioned, which drove heat and energy for our brand.\nTraining led performance growth this quarter, and running grew high single digits. In Q3, we hosted dozens of key partners for product engagement and future growth planning, including a summit for partners serving core price points. We have taken initial steps to expand distribution to support our expanded core product offering, which is a meaningful market opportunity for NIKE. In EMEA, Q3 revenue declined 6%. NIKE Direct declined 12%, with NIKE Digital down 25%, and NIKE Stores up 9%. Wholesale declined 3%. EBIT declined 35% on a reported basis. In Q3, performance dimensions continue to build momentum, fueled by the Mercurial and Global Football and new product launches in running. We celebrated Zinni Jr’s Best FIFA Men’s Player Award with a short video, Can’t Stop the Dance, featuring the Chrome Mercurial, and we amplified the Peg Premium launch with a unique activation at the London Eye featuring NIKE athletes.\nIn the marketplace, in addition to taking steps to reposition NIKE Digital, we also started a journey with JD Sports, Sports Direct, and [indiscernible] to elevate our brand physical retail with improved product positioning and visual merchandising. In Greater China, Q3 revenue declined 15%. NIKE Direct declined 11%, with NIKE Digital down 20%, and NIKE Stores down 6%. Wholesale declined 18%. EBIT declined 42% on a reported basis. In Q3, traffic declined double digits, and retail sales underperformed our plan. While the macro environment is challenging, sport is growing in China, and we must accelerate our pace. The market continues to be promotional, especially in consumer moments and in the digital channel. And we are taking aggressive steps to clean up the marketplace, with the priority being the health of our partners.\nThese steps had a negative impact on our revenue and gross margin this quarter. At the same time, our team is focused on creating brand distinction through sport and serving consumers with new innovation and hyper local product. We saw strong consumer response to the Peg Premium and Vomero 18 in running. And in basketball, we launched the year of the Mamba with strong growth in Kobe Protro. We continue to see locally designed Express Lane product resonate with strong sell-through of our Chinese New Year product. The opportunity in Greater China continues to be significant for NIKE, notwithstanding the highly competitive and fast-moving dynamics in this marketplace. Our brand remains strong, but our actions to energize the marketplace will take some time.\nIn APLA, Q3 revenue declined 4%. NIKE Direct declined 4%, with NIKE Digital down 8% and NIKE Stores up 1%. Wholesale was down 4%. EBIT declined 27% on a reported basis. While we saw mixed performance across territories in APLA, Japan and Latin America each returned to growth this quarter. In Q3, we created energy on the ground in running communities. We launched the After Dark Tour with incredible response from female runners and executed disruptive race takeovers at the Hakone Ekiden in Japan, the Mumbai Marathon, and the Thailand Marathon. This fueled continued momentum in running with growth across footwear and apparel. Now let’s look forward. Elliott said earlier that we are even more confident that the five Win Now actions are the right moves to create better balance in our business and reignite brand momentum.\nSo as we begin to have greater clarity and confidence in the steps that we are taking, I will provide some additional thoughts on our path forward over the next several quarters. First, we are accelerating our product portfolio transition. We expect sport performance dimensions to lead our growth with a relentless flow of newness across each field of play. We are focused on increasing the contribution of newness as a percentage of our overall seasonal assortment, including new models, new colors, and new materials. At the same time, we are moving fast to right-size the contribution of our classic footwear franchises. In regards to this transition, we are making progress. In the last quarter of this fiscal year, we expect our classic footwear franchises will be down by more than 10 points as a percent of our total footwear mix.\nWe intend to drive this mix lower in fiscal 2026 with total units planned down double digits with the most aggressive actions on the Dunk. Second, we are repositioning NIKE Digital within an integrative marketplace. To do this, we are reducing promotional days, reducing markdown rates, and shifting closeout liquidation to our NIKE factory stores. Due to these actions, and as we continue to reduce investment in paid media, we expect digital traffic to be down double digits in fiscal 2026. Gradually, we expect organic traffic to stabilize and grow with new product launches and our increased brand marketing investments. Third, we are cleaning up the marketplace. For NIKE Digital, we are tightening our buys to support a full-price business model.\nFor NIKE factory stores, we are increasing markdowns to drive velocity of higher volumes of closeout inventory. And for our wholesale partners, we are making investments in sales-related returns, reducing forward supply, and providing higher wholesale discounts to liquidate aged inventory. We expect these actions will continue through the first half of fiscal 2026. Last, when we get back to a steady flow of new product at scale, improve brand engagement, reposition our NIKE Digital business to complement our wholesale partners, and return to a healthy and clean marketplace. We expect our wholesale business to return to growth. Each of our geographies have made varying levels of progress on each of these actions, and as a result are working against different timelines.\nBut when taken all together, these are the building blocks for NIKE to return sustainable, profitable growth. Now, I’ll turn to our fourth quarter guidance. Our second half plan is in line with what we communicated last quarter, with some shifts occurring between Q3 and Q4. Looking ahead, we believe that the fourth quarter will reflect the largest impact from our Win Now actions and that the headwinds to revenue and gross margin will begin to moderate from there. We are also navigating through several external factors that create uncertainty in the current operating environment, including geopolitical dynamics, new tariffs, volatile foreign exchange rates, and tax regulations, as well as the impact of this uncertainty and other macro factors on consumer confidence.\nOur fourth quarter guidance includes our best assessment of these factors based on the data we have available to us today. We expect Q4 revenues to be down in the mid-teens range, albeit at the low end. This includes several points of unfavorable shipment timing in North America, as well as 2 points of negative impact from foreign exchange headwinds. We expect Q4 gross margins to be down approximately 400 basis points to 500 basis points, including restructuring charges during the same period last year. We have included the estimated impact from newly implemented tariffs on imports from China and Mexico. We expect Q4 SG&A dollars to be up low to mid-single digits, including restructuring charges in the prior year. We will continue to tightly manage expenses, while we increase investment to fuel our win now priorities, most notably demand creation.\nWe expect other income and expense, including net interest income, to be $45 million to $55 million for Q4. And we expect the tax rate for the full year to be in the mid-teens range. We are focused on what we can control. And for NIKE at this moment, serving athletes with new product innovation and reigniting brand momentum is what matters most. Our collective experience, as well as the early signals we are seeing with consumers, gives us confidence in the path ahead. With that, I’ll turn it back over to Elliott.\nElliott Hill: Thank you, Matt. I’ll close by taking a minute to talk about my teammates at NIKE. Look, it’s been a tough couple of years. We’ve been through a lot of change, but what’s encouraging is that in the 150 days since I’ve been back, we’ve reclaimed our identity. We know who we are. NIKE Inc. is a sports company. We inspire through iconic brands and create innovative products for all athletes. It may seem like an obvious direction, but we needed to say it out loud to reawaken the fire in our teams and I have been unrelenting in that message. One of the things that makes it special to work at NIKE is we invite athletes, coaches, and teams to our business meetings to spend time with our teammates. One conversation that stirred something up in me this quarter was with Coach Ryan Day, coach of the National Champions, the Ohio State Buckeyes.\nHe had an answer to the question that really connected with how I’m thinking about our team right now and the tone we’re setting. The question to him was, how do you stay on the offense and what’s the key to keeping your program moving forward? His answer was that Ohio State applies pressure constantly in all three phases of the game, no matter who he’s playing. Get vertical down the field on offense. Play suffocating man coverage so no throw is easy, go after punts, and have his best athletes returning kicks. He just painted this picture of a team that is relentlessly pushing and challenging, being aggressive and making it uncomfortable to play against. I love that attitude. And that’s how I think about NIKE when we’re at our best. Success for NIKE has never been about protecting our turf.\nWe force others to play our game. We drive trends, grow markets we lead. Coach Day made it clear that it takes complete buy-in to be a championship team. That’s exactly what we’re asking of our teammates right now, to keep up the intensity, to move with focus and urgency, to have passion and take pride in all that we do, and to win as a team. With that, I’ll turn it over for questions.\nQ&A Session\nFollow Nike Inc. (NYSE:NKE)\nFollow Nike Inc. (NYSE:NKE)\nReceive real-time insider trading and news alerts\nOperator: Thank you. And we will now begin the question-and-answer session. [Operator Instructions] And your first question comes from the line of Lorraine Hutchinson with Bank of America. Your line is open.\nLorraine Hutchinson: Thank you, good afternoon. Elliot, can you provide a timeline on when you think classic shoe inventories will be clean in the wholesale channel? And then same question for the direct channel as well.\nElliott Hill: Thanks for the question Lorraine. Before I dive too deeply into the specific question, I do want to start really quickly because I think it’s important to set the tone here on the call for these types of questions, that 90 days ago, we declared five actions to return to growth. And what we’ll say 90 days later, I’m even more convinced that these are the right actions to move our brand and business forward. And these Win Now actions really start with our culture, our product portfolio, which is a question that you’re asking here, and I’ll dive into that here in just a second, shaping our brand for distinction, elevating and growing the marketplace, and winning on the ground. And what we did add to our teams after coming off the call was providing them a sharp focus on which sports.\nWe have five sports, running, basketball, football, training and sportswear, three key countries I outlined for you, and then the five cities. So the teams are really rallying around this Win Now priorities and even calling it the [5535] (ph). So now let me let me jump more specifically into product for you and I will also start a little higher level before I dive into the specific question around the key franchises. We are going to run a balanced and complete portfolio. I want to make sure everybody on the call hears that. We’re going to run that through all three brands, NIKE, Jordan, Converse, across performance and sportswear, men’s, women’s, kids’ footwear, pair of accessories, and up and down price points. And we’re going to be sharper on specific sports.\nAnd I’ve touched on those already, so I won’t dive too deeply on those five sports, but we have set teams up against each of those, sport times gender, and we have small teams, cross-functional teams taking the insights from those sports and those consumers and driving innovative products. So I feel good about where the team’s heading on the performance side of the business. And we’re starting to see some great success and I’m sure we’ll hit on that here in a moment. What I’d say about franchise management to answer your question specifically is that, we have decade long experience of managing franchises. And I will also say this, we have the three, Air Force 1, Dunk, A.J. 1, they are still beloved silhouettes. So it’s not about sun setting these, it’s about right sizing them.\nAnd we asked our teams to accelerate our actions, as Matt spoke to in his prepared remarks of right sizing that inventory so that we can get back to running that complete and balanced portfolio. And so we’re confident that we’re making the right moves from a performance perspective and we’re seeing some wins there, running and training that Matt touched on. And we’re right sizing the three key franchises. And at the same time, starting to plant some newness in the sportswear side of our business with the Vomero 5, P6000, Shox. We touched on some of these Superfly, Air Max Muse, and Air Max 95. So, I feel like the teams are taking all the right actions against those key footwear franchises, right sizing the inventory, and getting back to running a relentless flow of innovative and coveted products.\nMatt Friend: Hey Lorraine, I’ll just add that what I said in my prepared remarks was that, we intend to drive — we’ve made really good progress over the past year and as Elliott came in, he challenged the teams to increase the pace at which we reduce the supply of those three franchises in the marketplace. And as a result of that, it had some impact on our Q4 headwinds that we talked about, but it will continue to be a headwind in fiscal year 2026. By the time we execute Q4, we expect that we will have reduced the contribution of those franchises by 10 percentage points as a percent of our overall footwear mix. And we intend to drive that down more in fiscal year 2026. When I think about it through the lens of channels, what I would say to you is that on the NIKE Direct side and the Digital side in particular, we’re already taking action, as Elliott and I both outlined, to reduce the number of promotional days and to reducing the discounts that we see in the marketplace.\nThe challenge we have in the near term is that, we were buying against a different plan. And so we’ve tightened the buys against NIKE Digital, but we really did that towards the end of summer and heading into fall. That inventory will not end up in the digital channel. We will directly transition it to our factory stores and we will clean it in a value channel like we typically do as we clean up the season. On the wholesale side, we’re making investments and I talked about us needing to use the first half of fiscal year 2026 in order to be able to clean up the marketplace. And what I would tell you there is that, the combination of the actions that we’re taking in digital, plus the actions that we’ve communicated and worked through with our partners, we’re already starting to see fruit.\nAnd what I mean by that is, one, inventory of Air Force 1 is beginning to stabilize with retail sales for Air Force 1. But secondly, when you look at the order book in wholesale for our partners in North America, Maine, and APLA, we’re seeing growth in the performance dimensions of our business plus newness in sportswear almost offset the declines we’re managing in the classic footwear franchises. And that gives us a lot of confidence that our partners are coming behind us and that we are moving down the right path to affect the cleanup.\nOperator: And our next question comes from the line of Brooke Roach with Goldman Sachs. Your line is open.\nBrooke Roach: Good afternoon, and thank you for taking our question. Elliot, I was hoping to get your latest thoughts on innovation within NIKE. How do you feel about the strength of your innovation team and the pipeline ahead? And how are you thinking about innovating into some of the sportswear franchises as we look into fiscal 2026? Thank you.\nElliott Hill: Yes, thank you, Brooke. Let me first start on innovation. When we think about innovation, we think about it really in two forms. We have long term, let’s call it three to plus five years, and we have a dedicated team against that over at our LeBron James NIKE Sports Research Lab and what I would say a really confident in the team that we have there and not only the team but the work that they are doing long-term creating new innovation for our team. So that’s a little longer term. I spent a lot of time with [John Hoke] (ph) and his team over there and excited about some of the products that are coming through the NIKE Sports Research Lab. Shorter term and more near term, again, I touched on it in my first answer and it’s really coming back to driving newness and freshness against Performance and sportswear, men’s, women’s, kids, footwear, apparel, and accessories, not just footwear.\nWe’ve got some really interesting innovation coming from apparel. I touched on it briefly in my prepared remarks around 24/7. And it comes out of our training line, but it is also viewed as sportswear. And there’s some innovation there. And I’m really pleased with the sell through on 24/7 and the reorders that are coming on that from an apparel perspective. And then on a footwear perspective, we’ll continue to right size the three franchise that I touched on. We still believe all three of them are meaningful products. And then you’ll see us continue to invest in innovation around sportswear. And I touched on some of those products. The Vomero 5, P6000, Shox. Shox is having a really built into momentum. Air Max 95, etc. And I’ll just close out here, Brooke.\nThis week we had our Spring 26 product review where we bring all of our Geo partners here to the campus to go through our Spring 26 line. And what I’ll tell you is, we are all excited about the products that are coming for Spring 26. We’re starting to see our Win Now focus on accelerating our product portfolio against these five sports, running, basketball, football, training, and sportswear, paying dividends. I’m really excited about the work I saw there. And while I have you, I’ll just add one other thing that I saw that I was excited about. We are also working on elevating the marketplace and the retail team’s done some phenomenal work around elevating our presentation at both wholesale and physical retail. And so excited about some of that work.\nSo overall, I’m confident that our innovation pipeline is there. We just now have to flow through it to get back to building the brand and the business.\nOperator: And to our next question comes from the line of Aneesha Sherman with Bernstein. Your line is open.\nAneesha Sherman: Thank you so much. Elliot, I just want to follow up on the comment that you just made about the Spring 26 product review. Based on some of the comments earlier from Matt around performance growth almost offsetting classic declines, do you expect that inflection point to be in Spring 26? I know you don’t have the orders yet, but is that when you expect performance growth to more than offset classics in your total wholesale order book to grow? And then, Matt, a follow-up on your comments on gross margins. You talked about wholesale liquidations at H1. I know you’re not giving margin guidance for next year, but are you generally expecting gradual progression of gross margins through the year as some of those liquidations roll off and then you get a stronger order book in the second half? Thank you.\nElliott Hill: Let me — here’s — we’re absolutely gaining confidence in the product pipeline. In the fall, Matt already touched on some of the order book on fall in North America, APLA, and EMEA. So definitely gaining confidence around the order book fall holiday and then like I said this sneak peek into 2026. The key here though is how quickly we can clean up the marketplace. That’s why you see some of the results that we have in Q4 and then resetting both the digital and physical marketplaces to receive this innovation, making certain that we present it in the way that we believe we need to present the product at point of sale, digital, physical, so that we drive the sell through. And so that’s where we have the team’s focus right now.\nThe brand, I believe we’ve already started to invest in, we did that early. I see product coming now and that excites me and so I feel good about that. Now we’ve got to reset the marketplace and make sure that we get the sell through and it’s that sell through that’s going to continue to drive the order book and get us back to profitable sustainable growth.\nMatt Friend: Yes, and I just would add that, last quarter we said that the fourth quarter was going to have the largest, the greatest impact from the Win Now actions that Elliott outlined. And we continue to believe this is true and it’s on our plan. But what we can also tell you is that we now expect Q4 to reflect the largest impact from these Win Now actions. And that the headwinds to revenue and margin we expect to moderate from there. And so, how I think you translate that, Aneesha, as you start to look forward is, we’ve tried to lay out each of these actions and the implications that they have as we start to think about heading into 2026. And we expect that these headwinds will continue in 2026. And as Elliott referenced, while we’re going to have positive things beginning vis-a-vis greater full price selling in digital, and we’re going to have a clean and full price order book with our wholesale partners, we are going to continue to be liquidating inventory.\nAnd we expect that that’s going to take us several quarters to work through. But the reason why we’re confident in it is because we know we’ll be liquidating it through the channels where we’re used to liquidating that inventory. So we will continue to be transparent as we’ve got greater visibility as we get into fiscal 2026. But we’re still in the early days of executing against these partnerships. And I’m sorry, we’re still in the early days of executing against these priorities. And we remain committed to providing guidance and financial updates every 90 days.\nOperator: And your next question comes from the line of Simeon Siegel with BMO. Your line is open.\nSimeon Siegel: Thanks. Hey, everyone. Good afternoon. Elliott, I’m curious, how are you going to balance the promotional, just like as you think about the presentation and bringing out promotions at the same time that it’s clear we can hear your excitement around the new product and your amplifying storytelling, just from a consumer’s perspective, how do you tell them this exciting story while still clearing the product? So how are you going to protect that and maybe segment that? And then Matt, it seems operating overhead versus demand creation trajectory flipped in recent years. So as you’re re-embracing wholesale, as you’re re-embracing elevating, any thoughts as to just the right level, long-term of overhead versus demand creation as the rate of sale. Thanks, guys.\nElliott Hill: Yes. Simeon, I think I’d be fairly brief here. Matt touched on some of the headwinds to the P&L, and one of them is us taking products — we’re returning products from our wholesale partners. So we’re bringing the product that’s not selling out of the market and then we will liquidate that to our value stores, NIKE value stores, to make room for the new innovation. And so — and it’s already starting — and by the way, we’re doing the same thing not only in a physical space, but we’re also doing it — excuse me, we’re doing it in a digital space as well. We touched on how we’ve already moved NIKE Direct, Digital to a full price presentation, really elevating the assortment, the presentation, the user experience.\nAnd so, we’re moving the — both digital and physical owned and partnered retail floor sets to full price as quickly as possible. And then we’ll use the value channels to move through the excess inventory. I think the last — I’ll just kind of finish here, the best example of that is how we’re going to reset running. We’ve had some great examples of Peg Premium this quarter, Vomero 18 this quarter, both new innovations with great storytelling, great presentation. And we’ve had wonderful sell-throughs on those. And then you’ll see that Simeon continue to flow into fall and holiday of Q1, Q2 of 2026 with a full range of product in running across three different silos of running, Vomero, PEG, Structure, three different price points, trail running, and then of course our racing flats.\nAnd that was one of the floor sets that I saw over at the Spring 26, And again, it looks amazing. So we’re trying to get our marketplace to full price as quickly as possible and feel like the teams are moving with a sense of urgency.\nMatt Friend: Yes. And on the SG&A side, I’ve said for a couple quarters that we continue to manage our expenses and what I meant by that specifically was overhead tightly. While we accelerate investment in demand creation and so our demand creation being up high single digits, 8% this quarter, is truly a reflection of Elliott coming in and challenging the team to elevate our storytelling with impact. And it’s the easiest lever for us to pull. And the team mobilized around the Super Bowl and the All-Star weekend and the product launches for Peg and Vomero, but also the way that they executed on the ground those activities in the cities in which we were focused. As we look forward, I think we’re going to continue to manage expenses tightly.\nI think that part of what you’re seeing this quarter in the double digit decline in operating overhead is some of the variable expense from Direct coming down, flowing through the P&L. You’re also seeing the great work our teams have done from a productivity perspective in managing against some of the productivity goals that we had set several quarters ago. If you look at our operating overhead growth, excluding the restructuring impact in the prior year, it was down 3%. And we’re focused on ensuring that we invest behind our sales organizations, our key city teams on the one end and on the other end making sure that we’ve got the right resources and product and in innovation. And so we’ll continue to do that and we’ll continue to try to do it while we manage expenses tightly as we look forward to returning to growth.\nOperator: And your next question comes from the line of Alex Straton with Morgan Stanley. Your line is open.\nAlex Straton: Thanks so much for taking the question. I just wanted to focus on wholesale here. And maybe for Elliott, as you’ve kind of returned to that channel and gotten back in the mix, I’m just curious, your biggest learnings there, any surprises of the upside or downside versus how you’ve historically operated there with all your knowledge? And maybe then for Matt, you just mentioned wholesale discounts as a headwind, which should continue. Are historical wholesale margins still in view? Are those structurally lower? Just curious for your latest thoughts there. Thanks a lot.\nElliott Hill: Yes, thank you, Alex. It’s maybe a surprise. We were probably working probably two siloed, direct versus wholesale. And again, I think to really drive the potential of our brand and our revenue and to meet consumers’ needs, it’s got to be integrated. It’s got to be an aligned approach to both direct and wholesale, digital and physical. It all has to work together in a consistent ecosystem. And so, I’m really driving hard [indiscernible] integrated consumer-led marketplace, let the consumer decide where they want to choose to shop. May 2 moves, Craig Williams and I, we’ve put in place two new leaders, one in NIKE Direct, Shannon Glass, and then the other one in sales, Erica Bullard, both long-term industry veterans and NIKE veterans.\nIn fact, we put them sitting next to up on our floor together. They have offices right outside of one another and they walk hand-in-hand and making certain like literally almost physically. So I told them those two have got to walk together everywhere they go and make certain that we stay aligned. And I think they’re doing a tremendous job of really making certain that we have an integrated approach to the overall marketplace. So I’d say that’s probably number one. Number two, we just got out of a rhythm of working closely with our wholesale partners. That was a bit of a surprise, and we are quickly getting back to — we’ve got cross-functional teams, we’re having key account planning meetings now with our wholesale partners. We’re working through unaligned growth plans.\nWe’re working on consumer right assortments in the right depth. We’re working now to elevate the presentation of our brand. And you know all too well when we have beautiful, innovative product and we elevate the presentation, it really helps sell through the product and marketing support. So again, I’m confident in the progress we’re making. It’s going to take time to build back all of the teams around the world. And that’s why we have the three key countries where we’re trying to focus, United States, China, and the UK, so that our teams know where we’re going to focus our investments and resources. So all in all, the wholesale partners, they want and need us to get back to be a NIKE.\nMatt Friend: And from a margin perspective, what I would say is that, over the past several years, Alex, the profit pool in wholesale has been relatively volatile. There’s been a lot of things that have happened with supply chain disruption, ocean freight rates moving, the supply demand imbalances. And as a result of that, we’ve all navigated through many things in order to be able to manage the profitability of the channel. I think one of the things that we did a couple of years ago as we were seeing a significant demand versus supply imbalance, meaning an incredible amount of demand and less supply, is we actually lowered our wholesale discount rates in order to offset other headwinds that we were dealing with from a freight and transportation perspective.\nAnd so we are investing in commercial terms, but we’re putting them back to historical levels. And so — and we believe that by doing that, we’ll be competitive. It will enable us and our partners to have mutually profitable businesses and also have the capacity that we need in order to be able to invest in the presentation of our brand at retail, which is ultimately what wins at the end of the day.\nOperator: And your final question comes from the line of Randy Konick with Jeffries. Your line is open.\nRandal Konik: Yes, thanks a lot and good evening. I guess Elliott, maybe give us some perspective. I think you spoke about a lot of things you’re doing with urgency in China, but maybe give us a progress report on where you see the different geos from all these strategies you’re undertaking. Give us some perspective where you’re furthest along — we’re furthest along. That’d be very helpful. Thanks.\nElliott Hill: Yeah. I think the key here, Randy, is as we think about our overall portfolio, is that we have 190 countries that all roll up to four different geographies. And we’re working closely with the leaders of each of the geos and countries to implement the Win Now strategy. Because again, the strategy works no matter if you’re in the United States or in Japan. It all goes back to putting the consumer at the center, right products, storytelling, marketplace. And so, Matt in his prepared remarks touched on APLA, EMEA, and North America being where they are in almost — in terms of futures in performance and looks of sportswear offsetting. And so, we’re, I think, making progress in each of those three geos. In terms of China, here’s what I’d say about China.\nWe remain committed to China. We see the long-term opportunity there. There’s 1.3 billion consumers, and it’s our opportunity. And what we’ve always done there is to invite and inspire those 1.3 billion consumers into sport, fitness, and the lifestyle of sport. And our team is doing a good job there. We’ve also made some significant investments in China, whether it’s around some of the big teams like the national basketball team, the track and field team, and the football team. So we’ve made big investments there. We’ve got now a product creation arm that we call Geo Express Lane in China. So overall, I think we’ve made the right investments. What I will say, I spent some time over there in December. I hadn’t been over there in a while. The competition is a bit more aggressive than I had — when I remembered it four and a half years ago.\nAnd so we’ve just got to accelerate our pace. Good news is, we’re starting still as the number one brand there. We’re working closely with Angela and her team to implement these Win Now strategies. We’re cleaning up the promotional marketplace just like we’re doing everywhere to make room for new innovation. We’re getting back to elevating NIKE Direct and Digital, and then working closely with our two big partners to make certain that we’re investing in consumer-led concepts with a focus on performance, running, training, basketball, Jordan, ACG, put the right assortments, depth, presentation, all the things that I’ve talked a lot about. But in the end, I believe we’re taking all the right actions and we’re confident in the long-term opportunity in China.\nMatt Friend: And when you look at the financial performance for China in the quarter, what I tried to highlight was the amount of actions that we took in the quarter between marketplace returns, rebates, and also some investments that we’re making to liquidate inventory. And given that it’s a mono-brand market, as Elliott mentioned, it’s going to take us time to execute the Win Now in China. So we went aggressive because the faster we can clean up the marketplace and create the capacity and the space to present the new product stories, the new product assortments that we’re excited about that are coming, the quicker we’re going to create energy with consumers, that’s when we should see traffic start to improve and we should start to build more momentum in that marketplace. So as we look at that, we just expect it’s going to take us some time to be able to execute this.\nOperator: And ladies and gentlemen, that concludes our question-and-answer session as well as today’s conference call. We thank you for your participation and you may now disconnect.\nFollow Nike Inc. (NYSE:NKE)\nFollow Nike Inc. (NYSE:NKE)\nReceive real-time insider trading and news alerts",
  "word_count": 9394,
  "scraped_at": "2026-02-14T14:15:20.120894"
}