{
  "article_id": "e176e399b6b6",
  "url": "https://www.pleasantonweekly.com/cover-story/2025/12/18/tri-valley-year-in-review-2025/",
  "title": "Tri - Valley Year in Review 2025",
  "date": "20251219T023000Z",
  "domain": "pleasantonweekly.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "2025 was a banner year for the Tri-Valley.\nThe Pleasanton Weekly, Livermore Vine and DanvilleSanRamon.com were there to cover the local people and issues that generated national headlines and the national news that spurred local action.\nAfter 13 months of fighting for public records, we were finally able to tell the story of why Amador Valley High School’s principal was removed from the campus last year, revealing sordid allegations (which he vigorously disputes) that became fodder for coverage across the country.\nA local congressman is making hay in the California governor race. A Dublin sportswriter was inducted into the Naismith Basketball Hall of Fame. Pleasanton mourned the loss of an International Drag Racing Hall of Fame member. Perhaps Foothill’s most accomplished athlete alumnus was celebrated for his San Francisco Giants’ career – although a current Falcon swimmer, who just shattered an age group record at the U.S. Open, could have something to say about that unofficial title in a few years. The world’s fastest supercomputer was unveiled (and then put to work) at the lab. And with its signature varietal selection and other moves, the Livermore Valley wine industry is leveraging Cabernet Franc as the face of its global identity.\nNational political discourse also compelled some (but certainly not all) residents here to rally shouting “Hands Off!” and “No Kings”, to protest loudly against ICE reopening the scandal-ridden former federal women’s prison in Dublin as an immigration detention center, and to support a Livermore family ripped apart by a father’s unexpected deportation.\nBut what truly captured Tri-Valley readers’ interest the most – and filled our pages in print and online – were the local stories closest to home day in and day out.\nBusiness openings and business closings. Coverage of crimes, convictions and crashes. Development debates. Tough budget discussions for cities and schools, including some union unrest. Lawsuits and layoffs. Executive shakeups in the public and private sectors. The ups and the downs for nonprofits. Concerts, art exhibitions, plays, new books and a county fair without horse-racing. Oh, and a certain newspaper commemorating 25 years.\nOur editorial team project, the Downtown Series, examined the commercial and communal hearts of each Tri-Valley city and town through interviews, research and images all year long.\nLet’s look through our top storylines and photographs from 2025. We’ve also brought back two special features in our Tri-Valley Year in Review section: A list of our Top 25 stories from 2025 according to PleasantonWeekly.com data, and our editorial team’s personal picks for their own favorite story and their own best story of 2025.\nEnjoy!\nJanuary\nWith the plug pulled on Golden State Racing after a lackluster fall slate at the Alameda County Fairgrounds, optimism remains that horse racing will return for the summer fair in Pleasanton.\nThomas Rossberg is the new police chief in Danville.\nC Casa, a popular Bay Area taqueria with a location in San Ramon that served as a linchpin of dining opportunities at City Center Bishop Ranch, has been shuttered after being fined for child labor law violations at a different location.\nAll Party City stores in the U.S. are closing permanently soon, with the Pleasanton location joining its peers nationwide in winding down operations.\nFormer Alameda County judge and longtime Pleasanton community member Ron Hyde dies from COVID-19. He was 81.\nFoothill High School student Daniel Hernández Alvarado is killed in a car crash on Del Valle Road. He was 17.\nIconic Barone’s Restaurant in downtown Pleasanton will soon be gone for good after the City Council unanimously approved the design plans to redevelop the area into new housing and commercial space.\nAfter some back and forth, the Pleasanton council eventually compromises on how the city will develop its two-year budget by approving two related items — a budget development plan and a Budget Advisory Committee (BAC).\nTracy Avelar is sworn in as the new police chief in Pleasanton.\nThe world’s fastest supercomputer, El Capitan, located at the Lawrence Livermore National Laboratory, receives a warm welcome from National Nuclear Security Administration officials and industry partners at a grand dedication ceremony.\nLos Vaqueros Reservoir Joint Powers Authority, which oversees the proposed reservoir expansion, votes to dissolve itself — meaning agencies like Zone 7 will have to look elsewhere for places to store more water in the future.\nMonths after a weeks-long outage spurred by a ransomware attack last summer, Dublin-based Patelco Credit Union is continuing to face aftershocks from the incident in the form of multiple lawsuits in federal court, one of which could go to trial in 2027.\nThe Kohl’s department store that has been a centerpiece of the Metro 580 shopping center in Pleasanton for more than two decades is set to close by April.\nCelebration of life held for Jim Walker, former city manager of Pleasanton (1980 to 1990). Walker, 85, died on Christmas Eve while in hospice care in New Mexico.\nAlameda County Board of Supervisors will have a list of 15 applicants to choose from when they take up the task of picking who should run the District Attorney’s Office following the recall of Pamela Price.\nJohn Muir Health has more than doubled its presence in San Ramon with a 52,000-square-foot space in the newly renovated Bishop Ranch Medical Center.\nEnvironmental assessment for the Valley Link rail project is released for the public to view and provide input.\nAnnual Make A Difference for Pleasanton Festival is held, helping residents kick off the new year by getting their resolutions to volunteer more going on the right note.\nLong-awaited Patterson Ranch Trail is officially open to the public.\nTri-Valley Theatre Company presents “Rock of Ages” for a three-weekend run at the Bankhead Theater.\nFoothill High dedicates “Randy Isaacs Court” in honor of the late former coach and teacher.\nPleasanton Unified School District Board of Trustees unanimously approves a roughly $85 million design-build agreement to construct the new athletic and performing arts facilities at Amador Valley High School.\nThe chef who founded San Francisco’s beloved Slanted Door that expanded to include a prominent location in San Ramon has died after being hospitalized over the weekend. Charles Phan was 62.\nPleasanton City Council receives several updates regarding the city’s emergency preparedness in response to the recent wildfires that have been ravaging Southern California.\nThe highly anticipated new Axis Community Health integrated care facility in Livermore is officially open to patients, bringing primary medical care, dental services, behavioral health support and enrollment assistance under one roof.\nTeachers, school staff and other community members at the San Ramon Valley Unified School District gather outside a number of schools to protest more than $26 million in budget cuts currently underway.\nLivermore Downtown Inc. Executive Director Ruby Lopez-Villarreal is stepping down. Livermore native Kara Klotchman is later hired away from Martinez to lead LDI.\nCalifornia Authority of Racing Fairs announces it will not pursue any horse racing meets during 2025, canceling its familiar county fair circuit in destinations like Pleasanton.\nAlameda County supervisors select Superior Court Judge Ursula Jones Dickson as the county’s new district attorney at the end of a nearly four-hour special meeting.\nNew details emerge in the sex abuse allegations against former San Ramon Valley teacher and coach Nicholas Moseby, with the girls involved filing a civil lawsuit as the trial date in the related criminal case approaches.\nNewly appointed Dublin Unified School District Trustee Carolina Martinez can complete her two-year term following the dismissal of a petition seeking to force a special election to fill her Area 3 seat.\nAfter Bay Area cities see federal agents conduct operations, law enforcement agencies in the Tri-Valley recommitted their stances on not aiding the U.S. Immigration and Customs Enforcement in light of policies in place that prohibit officers from sharing information or enforcing any national immigration laws.\nStanford Health Care Tri-Valley is under new leadership following the promotion of its former CEO, Rick Shumway, to the role of chief operating officer for Stanford Health Care. Mino Sastry is serving as the interim CEO of the Tri-Valley health care network.\nPleasanton Weekly celebrates its 25th anniversary.\nMore choices, more time to shop and stabilizing prices could be coming to the Tri-Valley real estate market during 2025, according to the Bay East Association of Realtors.\n“Morale is low” as PUSD plans $6.3 million in budget cuts.\nCity Council has some difficult conversations about downtown Pleasanton that ultimately ended with a request from the dais — downtown property owners and businesses will need to team up with the Pleasanton Downtown Association to come up with ideas to reinvigorate Main Street.\nCornerstone, offering over 100 affordable-rate apartments, is on track for development following a favorable vote by the majority of Livermore City Council. The vote is 4-1, with Councilmember Ben Barrientos in dissent.\nAmador Valley wrestling team does something not many local teams have done in the last 15 years, and that is beat De La Salle.\nThe Grille at Blackhawk, perhaps the most prominent restaurant space in the Blackhawk Plaza, abruptly closes its doors for good.\nJoe Callahan, Jerri Long and W. Ron Sutton receive 2025 History Maker Awards at Museum on Main’s annual gala.\nPleasanton Weekly, Livermore Vine and DanvilleSanRamon.com announce our 2025 team project, the Tri-Valley Downtown Series.\nFebruary\nAfter nearly eight years of expired permits, a mostly empty building and hundreds of residents online seemingly giving up hope, Cook’s Seafood might finally open its doors in Pleasanton — what exact day, however, remains a mystery.\nThe ongoing wave of tech layoffs throughout the Bay Area has now come to Pleasanton-based Workday, which announces plans to cut its workforce by 8.5% (1,750 jobs) amid an increasing focus on artificial intelligence.\nAs the Livermore Valley wine region has worked to establish and strengthen its identity in recent years, the latest milestone in that process is conferring Cabernet Franc and Sauvignon Blanc as the area’s signature varietals.\nPleasanton City Council increased a professional service agreement by $175,000 so a consultant could continue working with the city to develop its first-ever asset management plan, which staff said will help them be more proactive when it comes to managing the city’s property.\nBASIS Independent Schools is scheduled to open its third private institution in the Bay Area for grades sixth through 12th in Dublin by fall 2026.\nAssemblymember Rebecca Bauer-Kahan proposes two new pieces of legislation aimed at increasing regulation and transparency around AI technology.\nSt. Michael School in Livermore is currently renovating three of its 10 classrooms as part of a campus-wide improvement project.\nMitchell Joseph Allan, a 28-year-old man originally from Danville, is jailed on suspicion of indecency with a child after police allege he abused a youth basketball player he coached near his new hometown in Texas.\nNaturopathic doctors and local business owners Cristina Romero-Bosch and John A. Robinson open up about their new podcast, “Longevity Protocol”, using the platform to shine a light on topics related to hormone optimization, nutrition, mental health and sexual wellness.\nFormer San Ramon Valley High coach Hans de Lannoy dies at home after a years-long battle with cancer at the age of 72.\nLong-awaited Belmont Village Senior Living with 177 housing units opens in Bishop Ranch.\nThree Valleys Community Foundation is further making its imprint on the Tri-Valley and surrounding cities through its new “925 Gives” initiative.\nPleasanton City Council unanimously votes to move forward with the process of annexing properties in East Pleasanton where two large housing developments are being proposed for construction.\nAn independent accounting firm publishes its assessment of Pleasanton’s 10-year financial forecast and the results show that while there are areas where the city could do better in terms of communicating information to the public, the overall assumptions in regards to the city’s ongoing budget deficit seem to be correct.\nLLNL closes an internal office amid federal anti-DEI crackdown.\nJOANN in Dublin is poised for imminent closure, amid the craft company’s second bankruptcy.\nLivermore promotes Benny Stuth to permanent airport manager.\nTequila Bar & Grill settles into Hacienda Crossings Shopping Center in Dublin.\nChevron confirms layoffs following move out of San Ramon; energy giant looks to “simplify organizational structure” by cutting workforce by 15% to 20% to cut billions in costs.\nTaste Tri-Valley Restaurant Week is here: 10-day event showcases best in food and drink in Pleasanton, Livermore, Dublin and Danville.\nICE eyes vacated Dublin prison; Democratic U.S. representatives send stern opposition letter raising concerns.\nOyo, a melting pot of South American cuisine, expands its restaurant in downtown Pleasanton after years of success.\nLivermore Valley Joint Unified School District Board of Education agrees to eliminate about 40 full-time equivalent jobs in attempts to address a $6 million general fund deficit.\nFull-service afternoon tea is now available in Livermore at The Burgundy Rose Tearoom.\nDublin High School is locked down after a fight involving three students sent two of them to hospitals and attracted a crowd of 50 to 100 students.\nAnti-hero Don Giovanni springs into mischief and a heap of trouble in Livermore Valley Opera’s upcoming production of his namesake opera.\nDublin High students Anish Ummadi, Josh Zeng, Vikrant Ganesan and Sudith Thota win the 2024 Congressional App Challenge in California’s 10th District for their Neurochess app.\nFairgrounds horse trainers face eviction after cancellation of Northern California racing. Workers also express concern for families who live in RVs and might have to leave by March 25.\nCal High mock trial team is headed to state finals after winning county for eighth year in a row.\nSan Francisco Bay Regional Water Quality Control Board says detected PFAS levels at the Livermore-Pleasanton Fire Department’s training center warrant further investigation.\nChanting, cheering and honking can be heard from blocks away at the intersection of Dublin Boulevard and Arnold Road as hundreds of community members organized by activist groups — and a handful of counter-protesters — gather to protest ICE’s reported plans to reopen and repurpose the scandal-ridden federal women’s prison that was shuttered last year after findings of widespread abuse and mistreatment.\nFoothill High’s competitive civics team is once again heading to the national We the People finals in Washington, D.C. after winning the state championship.\nParkwest Casino 580 in Livermore appears on course to operate 24/7 with 16 tables and betting limits of $1,000, an increase from its current 10-table and $200 limit.\nPleasanton Downtown Association promotes events director Gabrielle Welk to executive director.\nMidday robbery at Optical Illusions in City Center Bishop Ranch nets thousands of dollars worth of stolen merchandise.\nLivermore Valley forms worldwide wine partnership: The Global Artisan Vintners Alliance.\nCity Center highlights newest tenant leases: restaurant Alora, fashion store Gorjana, indoor playground Kidplex.\nGoodness Village in Livermore appears on track to build a community center, following unanimous approval of the project by the Livermore Planning Commission.\nSRVUSD board votes to ax nearly 200 jobs as part of $26 million spending reduction package.\nAviation Innovation Center proposed for the Livermore Municipal Airport. New facility would serve as a hub to develop, assess novel aviation and advanced air mobility tech.\nBalls will be rolling down the lanes for just one more month at Danville Bowl after more than six decades, with the property near downtown recently changing hands and the new owners ready to redevelop the parcel as soon as possible.\nLivermore police arrest 36-year-old Oscar Barcenas Gonzalez of Oakland, whom they say is responsible for a major burglary ring with more than 40 targets since last September.\nCommunity rallies behind Emerald High basketball coach: Parents, players and colleagues urge Board of Trustees to keep Jason Rockwell after unspecified complaint and administrative leave.\nTerri Terry, a longtime Pleasanton restaurateur who founded Cellar Door and served as the downtown association president during the COVID pandemic, dies after a years-long battle with breast cancer. She was 62.\nMarch\nSandy Hall (57, of San Leandro) is killed and two other people are injured in a crash at the intersection of Sycamore Valley Road and Camino Ramon in Danville. The driver of the other vehicle, 72-year-old Andrew Chao, would later be charged with felony vehicular manslaughter.\nPleasanton council tells staff to plan on withdrawing $2 million over the next two years from the Section 115 Pension Trust and use that money to help pay off its employee retirement costs as the city continues to develop its next budget.\nOutpatient laboratory at Kaiser Permanente’s Dublin Medical Offices and Cancer Center will shut its doors due to low usage, according to the health system.\nSunol Repertory Theatre presenting “Robin Hood & His Merry Men”.\nCrowd of nearly 300 people rallies in downtown Livermore to advocate for LGBTQIA+ students and immigrant families as well as the U.S. Department of Education amid recent threats of its dismantlement under the Trump administration.\nDowntown Series – Keeping the heart of Livermore healthy: Residents, business owners, officials reflect on how far downtown has come and the direction it’s headed.\nJoseph Castro makes his public debut as artistic director of Valley Concert Chorale.\nWhat a season for Amador Valley girls’ soccer: Midyear turnaround propels Dons all the way to CIF NorCal semifinals.\nJason Rockwell will not be reinstated as head coach of junior varsity boys’ basketball at Emerald High School for unspecified reasons, sparking concern among his supporters in the community.\nPleasanton Weekly partners with Tha Town on a grant-funded project for junior journalists to cover the opioid crisis in Alameda County.\nFutsal dream becoming reality: Ballistic United’s new facility at the fairgrounds looks to change the culture of soccer in the Tri-Valley.\nDozens of Pleasanton residents of various ages flood the library meeting room where the city’s Budget Advisory Committee would set the list of 28 potential budget reductions for the city manager to review and present to the City Council in a few months.\nPUSD confirms principal Jonathan Fey, who has been on admin leave since August, will not be back next year and the search for a permanent successor has begun.\nFair Political Practices Commission investigates Livermore City Councilmember Ben Barrientos for allegedly violating conflict-of-interest laws last year when voting on the Garaventa Hills housing project near property he owns.\nFight at Monte Vista High in Danville leaves a teacher hospitalized and a student under arrest.\nNewly revamped, The Syndicate opens in downtown Livermore after shedding its former identity as The Last Word.\nDistrict hires Dublin native Monica MacDonald as new principal of Wells Middle School for 2025-26.\nSandia National Laboratories is welcoming Laura J. McGill as its new director this spring.\nHayward schools Superintendent Jason Reimann, who held high-profile roles in SRVUSD earlier in his career, resigns amid an ongoing investigation into an unspecified incident. Reimann also worked high up in ex-PUSD superintendent Parvin Ahmadi’s administration in Castro Valley Unified.\nLas Positas College, in collaboration with the college’s Actor Conservatory program, debuts a brand new production, “Sueños: Our American Musical”, which follows the story of a young Mexican American composer from San Francisco with dreams of going to Juilliard.\nTri-Valley residents Bisa Grant, Monya Lane and Jennifer Pett-Ridge are elected to Alameda County Women’s Hall of Fame.\nTensions stay high as settlement stalls between county, Castlewood board: Association opposes owners taking on more debt to rescue service area’s operating budget.\nPleasanton council has lengthy discussion regarding the East Lakes housing project that is being planned for development in East Pleasanton, with members expressing differing outlooks on age restriction and number of units, among other aspects of the proposal.\nHorses, trainers vacate stables at fairgrounds in Pleasanton: County, fair leaders commit to helping families who face housing insecurity due to loss of jobs.\nStampede headed for downtown Livermore: New restaurant to take over former Buffalo Wild Wings location this summer.\nNew York-based NorthStar acquires Vallecitos Nuclear Center, looks to restore the Sunol site for potential “commercial or industrial purposes”.\nTri-Valley Cobbler, J & R Sports Supply and Pierson’s Livermore Auto Stereo face displacement as their building’s owner plans to sell the three-tenant center at 2558 Old First St. in Livermore.\nThe beat goes on at The Golden Skate (for now): Delayed housing project in San Ramon looms over one of the Bay Area’s last remaining roller rinks.\nSanta Rita Jail inmate Elias Angel Rivera, 37, dies after being found critically injured in his cell. Deputies investigate as a homicide and cellmate Paula Faaui, 22, is later charged with murder.\nJunior Max Cory, a 2022 graduate of Dublin High, breaks the NCAA Division III record in the 100-yard freestyle and wins first national championship in Bates College swimming history.\nRedevelopment project aimed at replacing the Livermore Town Center shopping plaza with townhomes draws a group of concerned residents to the Livermore Planning Commission meeting.\n2024-25 Pleasanton Weekly Holiday Fund raises $77,776, split evenly among 10 local nonprofits.\nState appellate court rules that workers’ compensation benefits are the sole remedy for the family of late Dublin school trustee Catherine Kuo, who was fatally wounded by a car while volunteering in a food distribution event at Fallon Middle School in 2021.\nPleasanton Planning Commission unanimously approves the vesting tentative map for 27 single-family homes and a park to be built along Vineyard Avenue between Thiessen Street and Manoir Lane on land formerly owned by PUSD.\nLivermore’s Kevin Leung reflects on his experience competing on “Survivor”. The 34-year-old finance manager was the second contestant eliminated from Season 48, hampered by a shoulder injury early in the competition.\nPUSD’s budget is able to meet the required positive certification prior to submitting its second midyear status report to the Alameda County Office of Education.\nStable Cafe decides to remain open despite having lost a significant portion of its clientele due to the recent closure of the stables and horse racing at the fairgrounds.\nLivermore Area Recreation and Park District files a claim against East Bay Regional Park District for allegedly violating a tax-sharing agreement, including misappropriation of tax revenue since 1992. EBRPD denies allegations.\nPUSD trustees approve a roughly $2.35 million insurance payout, which comes as a result of a fire that broke out last year in the Amador Valley High School small gym.\nLivermore resident Noorullah Amiri, 29, is taken into custody by county sheriff’s deputies for allegedly burglarizing a popular comic book store in Castro Valley — with sleuthing employees from the shop helping connect the dots emerging across the East Bay comics community.\nDanville middle schooler Aria Karayil is celebrating her fifth-place finish on “Kids Baking Championship”.\nApril\nMalcolm Tilley, 31, is charged with first-degree murder and other allegations for the brutal stabbing death of his mother at the home they shared on Alvarado Street in Pleasanton. Marjory Tilley, 71, was remembered as a devoted senior services provider and a quiet woman of faith. Malcolm Tilley later pleads not guilty to all charges.\nNow that Alameda County and Castlewood Property Owners Association have settled their legal dispute, the next step will be a special election on the $7,000 assessment per property assessment proposed to make up a shortfall in the maintenance budget for water.\nProtesters in Livermore and San Ramon join nationwide Hands Off! mobilization to decry recent actions by the Trump administration.\nAdvocates call for change to Santa Rita Jail medical provider; county supervisors review audit of Wellpath’s allegedly subpar performance as company navigates financial and legal woes.\nJudge sentences notorious kidnapper and rapist Matthew Muller, whose case was originally cracked by Dublin police, to life in prison for 2009 crimes on the Peninsula.\nPleasanton’s only professional ballet company, Ballet Roots Dance Company, celebrates its fifth anniversary with two nostalgic shows featuring all-time fan favorites.\nAfter two lengthy meetings and receiving hundreds of resident emails in addition to the dozens who spoke during public comment, Pleasanton City Council gives formal direction on what services, staff positions and amenities to reduce or eliminate as part of budget cuts.\nMisty R. Jones is selected as the new permanent CEO for Stanford Health Care Tri-Valley.\nLivermore’s The Wine Group is set to acquire several wine brands and associated assets through a mutual agreement with Constellation Brands, including Cook’s, J. Rogét, Meiomi, Robert Mondavi Private Selection, SIMI and Woodbridge.\nChevron is laying off hundreds of workers at the San Ramon offices that formerly served as its headquarters in the latest step of an ongoing downsizing of their operations locally.\nCalifornia State Controller’s Office and Department of Technology are facing a lawsuit from Workday, with the Pleasanton-based company alleging it was unfairly rejected in the bid process for a new payroll system aimed at updating the state’s existing, decades-old system.\nTwo Alameda County Classified Employees of the Year are from Tri-Valley: Harvest Park Middle School’s Lisa Libert for paraprofessional and Emerald High’s Karen Chamberlain for security services.\nMore than a dozen juveniles are treated for shortness of breath or lung irritation after exposure to chlorine at the pool at The Club @ Livermore.\nU.S. marshals arrest Demarionte Smith, 26, in Seattle on suspicion of committing a road-rage shooting in Livermore weeks earlier.\n“A generational talent”: Foothill sophomore Luka Mijatovic focusing on the little things as he captures the attention of the swimming world.\nDublin Police Services is facing two lawsuits alleging that officers with the agency falsified affidavits in order to obtain arrest warrants without sufficient evidence for two different arrests, one in 2018 and another in 2023.\nLongtime Hacienda Business Park leader James Paxson receives Pleasanton Mayor’s Award.\nDriver is killed after pickup is hit by a loose wheel that hopped median on I-680 in Alamo.\nCommunity rallies around Aman Deshmukh and his family after the Foothill sophomore is paralyzed during Falcons’ pole vault practice. He is granted a transfer to Craig Hospital in Colorado – insurance company canceled initial denial after Weekly runs article about saga.\nRich Guasco, an International Drag Racing Hall of Fame inductee known for his “Pure Hell” car and racing team and a lifelong “proud Pleasantonian”, dies in hospice care at home from complications from aspiration pneumonia and cancer.\nEleven members of an Antioch-Pittsburg street gang are charged in the organized theft of millions of dollars in goods from Sunglass Hut and other merchants, including in San Ramon.\nIn the face of serious budget difficulties, the Pleasanton, Livermore Valley and San Ramon Valley school districts are all cutting multiple positions in their comms departments, including two directors well-known in the community.\nFormer Foothill vice principal Malcolm Norrington is returning to Pleasanton next year to serve as Amador’s new principal.\nCity officials plan to move forward with new hangar development at the Livermore Municipal Airport this year, following recent completion of the airport’s land use and development study.\nPleasanton council has a lengthy discussion about the signage changes to a former Shell gas station after it rebranded to Gulf where several councilmembers voice concerns about the overall aesthetic of the new signs and the process for how those changes were installed prior to the public hearing.\nJoe Callahan and Patrick O’Brien are the 2025 Ed Kinney Community Patriots.\nDanville Town Manager Joe Calabrigo plans to retire in June after 32 years in the position.\nTwo people die after their vehicles collided on Highway 84 near the Ruby Hill gated community early in the morning commute.\nDowntown Series – Making it on Main Street: Facing modern-day ups and downs, stakeholders say future remains bright for historic downtown Pleasanton.\nPleasanton Planning Commission unanimously approves the Villages at the Quarry project, which aims to develop over 400 housing units at the corner of Busch Road and Valley Avenue.\nPolice in Lafayette investigating thefts at a local school allegedly uncover a pattern of burglaries across the Bay Area by the same suspect, including in Danville and Dublin.\nDumpling Time closes in City Center Bishop Ranch; Meyhouse is tapped to take its place.\nLas Positas Vineyards’ 2024 Estate Reserve Verdelho is a star at the California State Fair’s 2025 Commercial Wine Competition, winning the coveted Best of Show White award.\nDublin resident and Dougherty Valley alum Filo Ebid leaves imprint on “American Idol” after advancing to the Top 14 in the singing competition show.\nSunol Glen School community celebrates the 100th anniversary of the main school building with festivities including a parade featuring antique cars, student-led tours of the school and an old-fashioned, small-town picnic.\nSan Francisco Giants honor retired shortstop Brandon Crawford in a pregame ceremony. The Pleasanton native played 13 seasons with his hometown team, winning four Gold Gloves and two World Series titles.\nMay\nThe real story behind Emerald High principal’s shocking resignation last fall finally comes out: Exclusive interview with Francis Rojas, new public records and sources on the ground shed light on what happened — and how school moved forward.\nA culinary incubator: Amuse Kitchen provides space and sense of community for burgeoning food businesses.\nHomes in unincorporated Remen Tract are left without water after line break. City of Pleasanton cuts off temporary remedy due to system risk, says public funds can’t be used to fix private pipe.\nApt for Mother’s Day weekend, the 85th annual Pleasanton Rose Show is held at the Senior Center — and it could well be the last time for the spring tradition.\nEmerald High names longtime East Bay coach Ron Pangilinan as the school’s first varsity boys’ basketball head coach, amid some parental unrest regarding the hiring process.\nLivermore council approves rezoning for approximately 27 acres in the city’s Isabel neighborhood from business park to residential transition as well as a development agreement for an approximately 450-unit housing project on-site.\nMurray Elementary assistant principal Erin Magill is named inaugural principal of Shamrock Hills TK-8 School, now under construction in Dublin and expected to open in fall 2026.\nTri-Valley accounting and business advisory firm Sensiba – which recently moved from Pleasanton to Bishop Ranch in San Ramon – acquires Australian cybersecurity company AssuranceLab with the goal of expanding privacy and security services for its clients.\nPolice have now arrested all eight males they believe are responsible for a January carjacking in San Jose, including one teen just apprehended in Livermore.\nLong-awaited Cook’s Seafood welcomes customers with a soft opening after taking nearly eight years to bring its new Pleasanton restaurant to fruition.\nPleasanton Weekly wins 14 California Journalism Awards at annual CNPA gala, including first place for Audience/Community Engagement Award, Editorial Comment and Print Front Page Layout & Design.\nLivermore activist and projection artist Alan Marling settles his lawsuit against the city of San Ramon stemming from a 2021 incident in which he was detained for displaying digital projections on City Hall. The deal includes $120,000 to Marling; city admits no wrongdoing.\nPleasanton-based Alan Hu Foundation is named the 2025 California Nonprofit of the Year in Assembly District 16.\nNews comes to light that a 2-year-old boy died last month after becoming unresponsive during nap time at day care at Building Kidz of Dublin. State authorities are investigating the death.\nChevron station on North Vasco Road in Livermore sells Daily Derby ticket worth $432,553. Win comes less than a month after a Shell station in the city sold a Fantasy 5 ticket worth $183,278.\nAlameda County launches a $5.8 million Diaper Bank program to provide monthly access to diapers and baby wipes for families with young children over a three-year period.\nFans of the famed Dilbert cartoon strip endure bad news when its creator, longtime Tri-Valley resident and political commentator Scott Adams, announces he has the same type of prostate cancer that former President Joe Biden has and it also has spread to his bones.\nPleasanton Planning Commission unanimously approves the permits and design review for Danville Brewing Company to construct and operate a brand-new microbrewery on a vacant lot at the intersection of Wyoming and Utah streets.\nBackers of a campaign to remove Contra Costa County District Attorney Diana Becton say their recall petition has been approved by election officials, clearing the way for signature gathering. The effort would fizzle out by fall without qualifying for the ballot.\nBalancing the books in Pleasanton: After resident pushback, council directs staff to reassess reduced library hours — but not monetary cuts.\nPleasanton’s Cowbell, Livermore’s GILLIG among winners of Innovation Tri-Valley’s 2025 #GameChangers Awards.\nLuka Mijatovic, the standout sophomore swimmer from Foothill, brings home CIF State Swimming titles in the 200 freestyle and 500 freestyle – breaking the national high school record by almost four seconds in the latter.\nDowntown Series – Reviving Blackhawk Plaza: Tenants, patrons of “ghost town” retail center hopeful for theater reopening, more restaurants and service-based businesses.\nPoppy Ridge blooms anew: NCGA-owned golf course in Livermore opens its redesigned 18-hole track after a remarkable 13-month overhaul project.\nEmbattled Sonoma real estate mogul Ken Mattson, known in the Tri-Valley for owning a now-shuttered specialty car consignment shop in downtown Pleasanton, is arrested by federal agents and accused of operating a Ponzi scheme.\nDowntown Livermore’s Wingen Bakery + Restaurant expands into a full-service restaurant with a renovated space and even takes a new name to better reflect its current offerings.\nPleasanton-based 10x Genomics is laying off 93 employees.\nClock seems to be ticking on Pleasanton’s lone Rite Aid amid the corporation’s bankruptcy proceedings, but for now the store and its pharmacy on Hopyard Road remain open.\nSanta Rosa police arrest two boys, including one from Danville, accused of breaking into a church and defecating on its bathroom floor over the weekend.\nPleasanton Planning Commission OKs an application for Stanford Health to move forward with plans to expand its facility in Pleasanton and construct a new “East Wing”.\nPUSD is continuing deliberations toward hiring its next permanent superintendent, but the process hit a bit of a snag and the timeline for identifying a finalist remains unclear.\nPleasanton finds itself as the lone Tri-Valley city on the U.S. Department of Homeland Security’s new list of obstructive sanctuary jurisdictions — and the city administration is unclear exactly why.\nRecent search-and-rescue effort in Arizona ends in tragedy when the body of 31-year-old Livermore native and social media influencer Hannah Moody is discovered near a nature preserve trailhead.\nConstruction begins on Regional Street Apartments, 113-unit affordable housing project on St. Patrick Way in Dublin.\nLawsuit against Workday is continuing to make its way through the courts, with the case now being considered a collective action following a judge’s order.\nIn a 3-2 vote, Pleasanton City Council maintains the current police policy of allowing the chief to decide if the department should display its armored rescue vehicle during community events such as National Night Out.\nHigh school seniors in the Valley are set for their graduation ceremonies.\nLivermore pub owners open Honeycomb Cocktail Lounge; husband-wife team behind Sons of Liberty welcome public into formerly private speakeasy.\nThe Lopez family in Livermore has one request — to be reunited with husband and father of three Miguel Lopez, who is currently being held in an immigration detention facility in Southern California. Unexpectedly detained while reporting to an immigration office in San Francisco for a scheduled visit, Miguel Lopez would be eventually deported to Mexico.\nJune\nLARPD sues EBRPD, seeking to exit a longstanding tax-sharing agreement between the two entities on allegations that the latter has failed to uphold its end of the deal.\nLivermore Rodeo riding high into 2025: 107th year arrives fresh off organizer’s election to ProRodeo Hall of Fame.\nPleasanton council accepts the final study for the city’s water and drought rates along with its connection as part of the city’s ongoing rate-setting process, set to be finalized in the fall.\nResidents turn out to council meeting to call for a railroad quiet zone in Pleasanton.\nInaugural Global Artisan Vintners Alliance Summit is coming to Livermore Valley wine country.\nPleasanton Military Families, a nonprofit known for organizing homecoming events for local soldiers and sending care packages to those deployed abroad, plans to formally disband by the end of 2025.\nLongtime Livermore city attorney Jason Alcala is retiring.\nResidents of San Ramon enjoy the highest quality of life among the largest cities in the country, according to a recent ranking that also positioned nearby Pleasanton in second place.\nAlameda County supervisors vote for nearly $270M in jail repairs – five-year project will focus on deferred maintenance and other vital renovations at Santa Rita in Dublin.\nDanville Town Council promotes assistant town manager Tai Williams to town manager.\nPleasanton welcomes a county fair like no other: Summer showcase brings familiar rides, food, concerts, exhibitions and shows – but there’s one notable scratch from the lineup, with horse racing now a thing of the past.\nIntroducing Zippy: Pleasanton’s first-ever library with wheels seeks to spread the word around the community.\nSanta Rita Jail medical provider Wellpath agrees to a $2.5 million settlement in a federal civil rights lawsuit filed by the family of Maurice Monk, an inmate who was dead in his cell unnoticed for three days in 2021.\nLivermore resident Ryan Bally Lance, 27, dies in chain-reaction crashes on I-580.\nLuka Mijatovic earns spot among world’s best swimmers: After second place at nationals, Foothill junior headed to Singapore with U.S. men’s team\nProfessional cricket has found a new home in the Tri-Valley, as a Northern California minor league men’s franchise is moving into the region and rebranding as the San Ramon Grizzlies.\nPleasanton council adopts final two-year budget marked by millions in cuts, most notably decreased library hours and two employee layoffs.\nProperty owners in Castlewood County Service Area turned in sufficient protests to stop the county’s $6,829.27 per household special assessment.\nFormer Amador coach and teacher Steve Mortara dies in an accidental drowning. He was 76.\n“I’m stressed. Seeing my wife crying all day makes me feel bad. I’m trying to be strong, but on the inside I’m struggling,” Livermore’s Miguel Lopez tells the Weekly in a phone interview after he is deported to Mexico as one of thousands swept up in ICE actions against non-violent immigration offenders across the U.S.\nPatelco agrees to settle suit over cyberattack for $7.25 million: Dublin credit union also hires a chief audit executive as fallout from last year’s security breach continues\nPleasanton assistant city manager Pamela Ott retires; Alexa Jeffress is promoted as successor while the deputy city manager position is going away as a cost-saving move.\nWorkday is selling one of its office buildings on Stoneridge Mall Road; company vows headquarters is staying in Pleasanton amid reinvestment strategy.\nEstimated 5,000 people demonstrate their displeasure with President Donald Trump’s administration at the “No Kings” rally in Dublin, joining millions of their peers in cities across the country in a day of protest of federal actions and policies.\nSandia National Laboratories Livermore campus is under new leadership, with Toby Townsend promoted to associate labs director.\nLVJUSD’s $5.7 million school-based mental health grant from the U.S. Department of Education is set to end prematurely, spurring the district to appeal the federal agency’s decision.\nSue Kuipers, chaplain for the Alameda County Sheriff’s Office, is named Chaplain of the Year by the National Sheriffs’ Association.\nCommunity response to police social media alerts is being credited with helping locate an 8-year-old Dublin boy who was lost for almost four hours after walking away unnoticed from Frederiksen Elementary School’s special education summer program.\nLivermore Police Department and East Bay SPCA announce a partnership to provide care and shelter for stray and abandoned animals.\nSanta Rita Jail inmate Daniel Lavi, 78, of Livermore, dies following a rapid decline in health, prompting an ongoing investigation.\nLocal Realtors advocate in Washington, D.C. – capital gains, housing affordability and mortgage access among key discussions with East Bay legislators\nThe county’s grand jury? The 2024-25 Alameda County Civil Grand Jury releases its final report, revealing that five of its six investigations pertained exclusively to Oakland. The sixth subject, a countywide agency based in, you guessed it, Oakland.\nPleasanton settles with the Housing Action Coalition, an affordable housing advocacy nonprofit. Deal stipulates the city will consider rezoning three additional commercial properties for residential use as part of the city’s sixth Housing Element.\nIn a stunning twist, PUSD Board of Trustees names Interim Superintendent Maurice Ghysels as the top choice for the district’s new permanent leader, following two months of candidate interviews and nearly a full year since former superintendent David Haglund left his post. Ghysels, who had been expected to return to retirement this month, inks a two-year contract.\nSutter Health patients can now seek primary care and select specialty services at the organization’s new facility on Southfront Road in Livermore.\nLVJUSD hires Berkeley Unified’s Jessica Bonduris as new assistant superintendent of human resources.\nJury sides with doctor in pregnancy malpractice case: Former Pleasanton resident Jessica Perry sought damages after a Stanford Tri-Valley doctor incorrectly diagnosed her with miscarriage in 2021. (Baby Hudson would be born healthy six months after the jarring ER visit.)\nArmadillo Willy’s shutters in Dublin; only one Bay Area location remains amid company’s financial struggles.\nThree children — ages 12, 14 and 15 — are arrested in connection with 49 auto burglaries in Livermore, police say.\nDublin Leprechauns independent league baseball team makes headlines by bringing in reliever Marika Lyszczyk, the first woman to play in Pecos League history. It’s no gimmick signing as Lyszczyk would pitch effectively in multiple games for the upstart Leprechauns.\nLivermore is among the finalist locations being considered by Pacific Fusion for its new billion-dollar research facility.\nPleasanton celebrates reopening of renovated Lions Wayside Park.\nThere is more turnover near the top of Livermore’s city administration, as Weekly learns deputy city manager Marie Weber quietly resigned in recent weeks after just over two years in the position. She would start a job in Prince William County in Virginia the next month.\nExecutive Director Stacey Mortensen is stepping down from the San Joaquin Regional Rail Commission, the regional agency that operates the Altamont Corridor Express train that runs through the Tri-Valley.\nRabbi Raleigh Resnick reflects after he recently took a group of about two dozen people affiliated with Pleasanton’s Chabad of the Tri-Valley on a visit to Israel that ended with a 43-hour journey home due to the conflict taking place at the time between Israel and Iran.\nCounty expands conditional uses in South Livermore: tasting rooms, inns and food-and-drink stores related to agriculture among permitted facilities.\nNew restaurants bring more international flavors to Dublin: Lineup includes Baithak, Raya, Mom’s Pho & Banh Mi, Joe’s Pho, Bodrum Mezze & Cocktails and bb.q Chicken.\nTwo more former correctional officers (Jeffrey Wilson and Lawrence Gacad) at the Federal Correctional Institution in Dublin have been charged with sexually abusing female prisoners, bringing the number of guards charged with sex crimes at the now-closed women’s prison to 10.\nEast Bay Parks welcomes more than 3.5 miles of new trails in the 381-acre Magee Preserve in Danville.\nJuly\nStarbucks in downtown Pleasanton is set to permanently close after almost a decade of serving coffee to Main Street patrons.\nWhistleblower lawsuit against city of Pleasanton marches forward: Ex-employee Dan Repp claims City Manager Gerry Beaudin fired him for daylighting illegal, unsafe practices within utilities.\nFormer Amador principal Jonathan Fey, who was on a mysterious leave of absence for almost a full year, is poised to participate in a slew of administrative hearings against the district slated to start in August and end in October.\nAlcohol distributor Republic National Distribution Company is exiting Pleasanton (and California at large).\nZachary’s Chicago Pizza is set to open its first Livermore location this fall, taking over the former Patxi’s Pizza spot downtown.\nPleasanton police arrest two juveniles in connection with the recent string of ATM robberies at various banks across the city, including one 12-year-old boy previously linked to dozens of car break-ins in Livermore.\nDowntown Series – Build it and they will come: A walk through San Ramon’s nascent downtown.\n“Cinderella” arrives for the ball: Tri-Valley Theatre Company performances run three weekends at Bankhead.\nDublin High’s Maegha Ramanathan, founder of Girls4Sports, is selected by ESPN among three national winners of the Billie Jean King Youth Leadership Award at the ESPYS.\nCity of Pleasanton confirms library’s reduced hours, Sunday closure and service changes.\nJohn Concannon, the fourth-generation vintner and former leader of the historic winery in the Livermore Valley that bears his family’s name, has died.\nPop Mart arrives at the Stoneridge Shopping Center.\nPleasanton native Ani Kandada is facing a felony vandalism charge in Los Angeles County for supergluing his hand to the poultry section of a Trader Joe’s in Pasadena as a form of protest against the grocery chain selling chicken from a supplier accused of animal cruelty.\nPleasanton residents can now fulfill their rockstar dreams with the city’s first-ever School of Rock, offering opportunities for both children picking up an instrument for the first time and adults aspiring to perform on stage.\nOld Mexico in Livermore shutters for good: “Bittersweet” farewell from operators of restaurant and bar on Portola.\nA woman who was shot in the head near Interstate 680 in Alamo is in stable condition and is expected to survive, per CHP.\nNotorious kidnapper and rapist Matthew Muller, who was already serving multiple life sentences for his crimes in other parts of the state, is sentenced to seven years to life after pleading no contest for a 2015 ransom incident in San Ramon that came to light last year.\n50 years filled with laughter: Pleasanton’s Balloon Platoon has marched across the country and around the world delighting crowds with precision drills.\nDanville and San Ramon rank high on the latest tax roll: Assessed property value across Contra Costa County increases to record-high $290.66 billion.\nOpen Heart Kitchen just keeps beating: Nonprofit reduces community meals, deploys hiring freeze and dips into reserves amid dearth in federal funding.\nPleasanton will not become a charter city anytime soon after a City Council majority presses pause on staff’s efforts to continue exploring the possibility of becoming one.\nZone 7, Pleasanton reach settlement in lawsuit over collection of water connection fees.\nFair sees upticks in attendance, food sales in 2025: Despite lack of horse racing, new attractions, concerts and other entertainment drew 400,000-plus people.\nFire sparks Zephyr Grill & Bar closure. Downtown Livermore restaurant was slated to reopen under new name sometime after August – but the renovations would take until November and they would keep the original name.\nAn otherwise quiet Saturday in Dublin is marked by a sizable crowd at Don Biddle Community Park as local residents and activists from throughout the Bay Area gather to continue pushing back against proposed plans to reopen a scandal-ridden prison in the city as an ICE detention facility.\nTri-Valley nonprofit Sunflower Hill names Melissa Hernandez and Lynn Monica as the recipients of its 2025 Rainmaker Awards.\nOne of San Ramon’s few remaining relics from the area’s Gold Rush days is severely damaged in a fire, delivering blows to local history buffs as well as the property owner who had been seeking to renovate the building as part of a proposed senior housing project at the site. The Harlan House fire is being investigated as potential arson.\nContemporary “Prisontown” is selected alongside classic “The Hairy Ape” as the plays to be featured at 26th Eugene O’Neill Festival in Danville.\nBurglars detonate an improvised explosive device to gain access to an ATM at the Target store in San Ramon in the wee hours of the morning.\nSan Jose resident Rohith Sunil, 21, is accused of gunning down a woman walking her dogs in San Leandro and is ultimately captured in Dublin after following someone suspiciously in his car, prosecutors say.\nThe driver who caused the fatal head-on collision on Highway 84 in Livermore lost control while racing a pickup truck that fled the scene and remains at-large, the CHP says in a case update. The victim is ID’d as Ryan Joshua Aquino Amigable, 22, of Oakley.\nJudge rules against Danville in builder’s remedy case: Application for 38-unit housing project in Anderson Ranch now deemed complete, held to rules that were in place in 2023.\nA former executive of a Livermore insurance brokerage, 69-year-old Jasbir Thandi, pleads guilty to his role in fraud schemes that led to the collapse of two firms and more than $20 million in losses.\nEdwin Lickiss, Jr., 77, a former financial adviser in Danville and Alamo, is indicted for an alleged investment fraud scheme that netted nearly $10 million from investors.\nDolores Bengtson Aquatic Center 50-meter pool is temporarily closed due to a “critical boiler component failure which shut down the heating system”, the city acknowledges.\nPredevelopment work is underway for a potential senior housing project at the old Victory Baptist Church site in Livermore.\nSunol dog trainer Joshua Kaplan is facing multiple charges, including attempted murder, after allegedly shooting a Pleasanton man during a confrontation over a report that the victim was beating his dog. Police said they found no evidence of alleged dog abuse. Kaplan pleads not guilty, saying he acted in self-defense.\nGov. Gavin Newsom signs a bill championed by the local Neev Kolte & Brave Ronil Foundation that gives Californians the option to donate a portion of state tax return to childhood cancer research.\nDublin City Council rejects two of Mayor Sherry Hu’s appointments to advisory bodies, citing a conflict with seniority norms and a lack of transparency surrounding applications. Alternates are ultimately elevated on the Heritage and Cultural Arts Commission, and Senior Center Advisory Committee.\n“Ratify, reaffirm and readopt”: Livermore council again endorses Eden Housing project provisions: Developer permitted to secure final construction financing for 130 affordable units downtown.\nPUSD agrees to use the majority of the $30 million proceeds from the sale of its Vineyard Avenue property to pay down the certificate of participation that helped finance the purchase of its new headquarters site. The board also sets aside $11 million for general fund reserves.\nBriarhill Cabana Club in western Dublin must upgrade its pool prior to next year’s swim season in order to abide by Alameda County health and safety codes.\nNew gallery, cafe creating community hub for the arts: Latte Da Vinci celebrates grand opening on Main Street with first exhibit and competition.\nComedy legend Vicki Lawrence reflects on her career in an interview with the Weekly before her “Vicki Lawrence and Mama: A Two Woman Show” at the Bankhead.\nDelta Airlines co-pilot Rustom Bhagwagar, 34, is arrested on suspicion of child sexual abuse after his plane landed at San Francisco International Airport. The case, which sparks national headlines, has San Ramon Valley ties. His ex-girlfriend would later be charged.\nThe city of Pleasanton files a motion for summary judgment, asking Alameda County Superior Court to rule in its favor in a whistleblower case brought by former employee Dan Repp. The city would like a decision before the case goes to a jury trial in November because “there are no triable issues as to any material fact against the city”.\nPleasanton Planning Commission unanimously approves a conditional use permit for Ballistic United Soccer Club to operate a new futsal facility at the Alameda County Fairgrounds.\nTri-Valley Conservancy announces that 1,168 acres of land between the cities of Dublin and Livermore is established as permanently protected open space.\nAlameda County supervisors vote on how to allocate $810 million generated from Measure W, a sales tax passed in 2020 originally earmarked for issues surrounding homelessness – 80% of the funds will go toward homelessness and 20% will go toward other support services.\nCivil lawsuit by two “Jane Doe” plaintiffs against SRVUSD alleging that it failed to protect two former students from sexual abuse at the hands of former teacher Ryan Weible (who denies wrongdoing and was dismissed from the lawsuit) is quietly settled for $6,999,900.\nAugust\nDish n Dash is taking over old Applebee’s spot; remodel is underway to bring the Middle Eastern restaurant to Hacienda Crossings in Dublin.\nRite Aid is marking its final weeks in Pleasanton and Alamo, with the stores set to permanently shutter later this month amid the bankruptcy proceedings at the corporate level.\nFostering stability and strengthening community: Superintendent Maurice Ghysels outlines plans to address PUSD’s financial challenges, improve academic performance ahead of the start of the 2025-26 school year.\nPleasanton residents have expressed their growing frustration with what seems to be a recurring trend during the hot summer months: power outages.\nBurlington is closing its store in Dublin Place after the company sold the building to American Realty Advisors, which owns the overall shopping center and wants to reinvent the prominent Amador Plaza Road property.\nThree defendants in the murder of a Pittsburg husband and father are sentenced in a plea deal struck with prosecutors to resolve the case purportedly precipitated by a romantic triangle at the San Ramon senior home where they all worked.\nContra Costa County judge denies motion from former sheriff’s deputy Andrew Hall to expunge his record of the felony assault conviction he received in the fatal on-duty shooting of Laudemer Arboleda in 2018. Hall was released early from prison back in March.\nIn just their third season, the Dublin Leprechauns vault into the upper tier of the Pecos League by winning a road playoff series before falling to San Rafael in the Pacific Division finals.\nGrammy winner LeAnn Rimes headlines Brilliance at the Bankhead gala.\nPUSD begins grappling with a projected deficit of $8 million to $9 million, in part due to an error in accounting salaries and a state deferral in funds that could leave the district short of money to pay employees.\nLPFD Fire Chief Joe Testa retires. Deputy chief Aaron Lacey is elevated to interim chief and later earns the permanent job.\nDublin dealership is taking over the former Specialty Sales Classics shop in downtown Pleasanton that shuttered amid ongoing fraud allegations against the owner.\n“Hope, not handcuffs”: New jail diversion center Horizon Treatment Services opens in Pleasanton.\nPleasanton resident Lucas Chan, 28, is charged with killing his father, 61-year-old Lance Chan, following a verbal dispute.\nApple Cinemas postpones Blackhawk opening until next year as the movie theater chain is embroiled in litigation with Apple Inc. over copyright infringement claims.\nTotal of 45 employees at Oracle in Pleasanton face layoffs.\nDowntown Series – Polishing the secret gem of Sunol: Residents, community leaders want to improve Main Street while maintaining its unique charm.\nLivermore’s SPARC Theater is embracing its hometown’s reputation for scientific and technological innovation in a new way next year that promises to challenge the old guard and contemporary creators alike: producing a play penned entirely by artificial intelligence.\nCity of Pleasanton to explore hotel tax increase amid ongoing financial uncertainty; council declines to poll voters on other revenue measures such as sales tax increase or parcel tax.\nIn a split vote, the Pleasanton City Council approves staff’s recommendation to pause casket burial services at the Pioneer Cemetery and only offer cremation services while the city updates how the cemetery is operated.\nPDA outlines efforts to improve downtown economy: New foundation, redrawn boundaries and associate member program among goals for the next two years.\nYonston Vazquez, the man suspected of killing two people at a hotel in Livermore last year, is apprehended in Mexico, following a nearly 16-month-long investigation.\nSome 30 instruments are stolen from Dublin Elementary over summer break, and a crowdfunding campaign is underway to help replace guitars and ukuleles for students.\nWomen’s health summit shines light on industry opportunities. Organizer Startup Tri-Valley is set to start a quarterly series next year to continue featuring underrepresented topics.\nConstruction begins on Springtown Open Space – community park and disc golf course in Livermore are expected to be finished in a year.\nEBRPD Police Department has reached full staffing levels at the sworn police officer rank for the first time in over 18 years.\nAlameda County District Attorney Ursula Jones Dickson drops all charges against most of the 11 Santa Rita Jail guards and staff accused in the 2021 death of inmate Maurice Monk.\nPolicy across Tri-Valley school districts make it abundantly clear — students have state-supported protections for attributes including their identities, even as federal civil rights law dissipates.\nLivermore dog Ziya wins insurer’s Hambone Award: Injured while protecting owners from bull, voted as most unusual claim of the year for Nationwide.\nPleasanton Planning Commission uncertain on downtown project pitch: Staff, applicant must figure out commercial vs. residential aspects of Old Bernal Avenue development.\nThe staple pizzeria at the gateway to downtown Danville has changed hands this summer — and while the new owners vow not to change Primos’ soul, they say they are working on a few tweaks to breathe new life for the future.\nHappy 25th! Pleasanton Weekly celebrates big anniversary with community at Concert in the Park.\nSeptember\nWalmart closing Neighborhood Market on Santa Rita Road next month.\nMain Street Brewery to shutter after nearly 30 years in downtown Pleasanton. Owner says “the time has come”, with final day in business set for Sept. 21.\nHoping to score fusion research facility, Livermore gives early project approval while waiting for Pacific Fusion to decide on the final location.\nPRIMM’s plight leads the owner to close up shop in downtown Pleasanton. Boutique is moving to Paso Robles after structural issues forced the store out of its original Main Street building.\nLivermore poaches Pleasanton’s assistant city attorney Kimberly Cilley to become its next city attorney – albeit she left Livermore for Pleasanton just 16 months prior.\nAmador alumna and former Cal swimmer Catherine Breed is set to swim the length of the state, planning to document her journey for a good cause.\nA taste of Peru on Main Street with new Bravazo: Local chef who went viral for cheese-wrapped burrito takes over former Downtown Cafe location.\nLVJUSD unveils renovated Marylin Avenue STEAM Academy.\nAlameda County seeks to cut red tape from affordable housing; SHIFT initiative is hailed by officials as “a first-of-its-kind pilot program”.\nCalifornia Lottery confirms that two Powerball tickets across the state won $1,564,348 each, including one sold at the Circle K convenience store at 7850 Amador Valley Blvd. in Dublin.\nLongtime businesses vacate Old First Street shopping center in Livermore: Cobbler, gun store and auto stereo shop leases are not renewed under property’s new ownership.\nAll Gas, no brakes: Longtime Gay Nineties Pizza employee Conner Close takes a chance at bottling and selling his own Green Gas Hot Sauce.\nApproximately $34,000 in cash and jewelry is stolen from the Sri Panchamukha Hanuman Temple on Village Parkway in Dublin during an early-morning burglary.\nDublin’s own Michelle Smith, a pioneering writer and reporter known best for her coverage of women’s professional and college sports, is etched forever into hoops history with her induction into the Naismith Basketball Hall of Fame.\nPleasanton City Council holds a joint workshop with the city’s Planning Commission where members of each one provide high-level feedback on the overall approach staff is taking on planning for the future of East Pleasanton.\n“A great partnership between the city and the U.S. Army”: Revival project underway for historic Camp Parks sign and guard booth in Dublin.\nAs EBRPD and developers move forward with plans to redevelop the site of Danville’s last walnut orchard into housing and an agricultural park, the Town Council discusses what to do with a portion of the Borel property that has been under the town’s ownership for decades.\nPublic meetings kick off in San Ramon on a proposed housing project that would take the place of the sprawling tennis facilities and landscaping at ClubSport with 82 townhome units and seven ADUs.\nPleasanton school board authorizes staff to borrow up to $15 million from the county treasury in order to make up for state money the district doesn’t have yet but is set to receive down the line.\nAlameda County to restart Castlewood steering committee. LAFCO advances annexation feasibility study, but homeowners lament current services in meantime.\nBART Board of Directors issues a public apology after two recent major service disruptions that left one of the Bay Area’s most expansive transit agencies paralyzed and stranded hundreds of thousands of riders across the region.\nThe final throw: Limitless Axes & Ales closes ‘flagship’ Pleasanton location. Meanwhile, the company’s escape room next door “remains open and is doing great” in Valley Plaza, the owner says.\nAlameda County officials say they anticipate moving ahead with a new plan to revitalize and reopen the 20-year-old Martinelli Center on Greenville Road in Livermore.\nPolice have arrested five boys in Livermore in connection with a June armed robbery and assault outside a San Jose casino that left a man injured.\nSan Ramon Police Chief Denton Carlson announces upcoming retirement from the department.\nBeer is officially flowing at Del Cielo Brewing Company’s new brewery and taproom in Livermore.\nMajor League FootGolf is making its debut at Las Positas Golf Course with a season-opening tournament that has $5,000 at stake for players from across the country adept at the hybrid sport.\nWesley Katz confirms the difficult duality of the moment: The Mitchell Katz Winery property on South Vasco Road is listed for sale for $4.2 million, and he hopes to keep the now-second-generation winery working “forever”.\nTensions flare during the Pleasanton City Council’s discussion regarding the future of the city’s two utility discount programs as Mayor Jack Balch and Councilmember Julie Testa engaged in a heated exchange that culminated in Balch banging his gavel and calling for a recess before briefly departing from the dais.\nBarone’s Restaurant is demolished as redevelopment plans forge ahead; new homes and commercial space are set to replace the downtown Pleasanton staple.\nLargest Workday Rising to date: Company seeks to strike optimistic tone on future of AI and work at annual conference.\nDowntown businesses to see assessment fee changes as Pleasanton City Council supports proposed increase that stakeholders say will bring more revenue to Main Street.\nLVJUSD mourns recent deaths of staffers: Colleagues honor the memories of two longtime district employees, Brett Francois and Marilyn Burns, who died weeks apart.\nPleasanton students with intellectual disabilities and other special needs will now have the chance to improve their skills in the workplace thanks to the recent opening of the district’s CVS Health Skills Lab.\nLongtime Pleasanton resident Meera T. Parikh, a career lawyer and former member of the city’s Human Services Commission, reaches a new professional height when Gov. Gavin Newsom appoints her as a judge in the Alameda County Superior Court. The governor’s selections statewide also included former Danville planning commissioner Andrew R. Verriere to the bench in Contra Costa County.\nThe Firehouse lineup: City-run theater unveils schedule of fall shows – spring slate still under construction.\nHeller Jewelers in City Center Bishop Ranch is hit in an armed takeover-style robbery in the middle of a Monday afternoon.\nDarin Chuck Ming Chan, 37, of Livermore is killed in a motorcycle crash at the intersection of Airway Boulevard and Isabel Avenue.\nWith dwindling roster, Dougherty Valley decides to stop football season after non-league games: “Student athlete safety is our No. 1 priority. This is the reset that we need as a program,” the acting athletic director says.\nA Stockton man is taken into custody on suspicion of fatal DUI after authorities allege he killed another driver – 66-year-old Akram Ghazal from Tracy – in a crash on I-580 east of Livermore.\nFormer U.S. Men’s National Soccer Team player Kevin Crow, an Amador alumnus, is inducted into the Cal North Soccer Association Hall of Fame in a ceremony at PayPal Park in San Jose.\nPleasanton’s Goal Line Studios, the media production space created by late football legend John Madden, becomes the new home of pregame, halftime and postgame shows for the Pac-12 as the sports conference gears up for the next stage of its rebirth next year.\nNew developers take over townhome project: IHP Capital Partners, The Grupe Company acquire 2.5 acres in San Ramon to build 57 units.\nHarringtons out: Philanthropists behind Pleasanton’s public art program open up on “surprise” move to Washington.\nBeach retreat: An off-site summer summit for LVJUSD leadership attracts negative attention, leading to criticism over the agency’s spending.\nTrustees support parcel tax polling, but formal action as PUSD weighs viability of 2026 ballot.\nPacific Fusion picks Albuquerque as the home for its planned billion-dollar fusion research facility, passing over Bay Area finalists Livermore and Alameda after receiving a nearly $800 million incentive package in New Mexico.\nDowntown Danville, City Center Bishop Ranch in San Ramon and Republic Square in Livermore are among the six locations in the Tri-Valley where Starbucks stores shut down for good as part of a major restructuring for the coffeehouse giant. As three closures hit Livermore, work is underway to open a new drive-thru Starbucks in the old Burger King restaurant in Arroyo Park Shopping Center.\nBART officials, elected representatives and other public transit stakeholders gather at the West Dublin-Pleasanton BART Station to commemorate the completion of the transit agency’s years-long effort to install new fare gates at all 50 stations across the Bay Area.\nSeven-year-old Pleasanton chess prodigy Varun Karthik Turaga prepares for the World Cup in Europe.\nCity of Livermore agrees to credit a total of $3,783,000 to water and wastewater utilities to settle a lawsuit from the Alameda County Taxpayers’ Association alleging the agency’s overcharging and misuse of utility fees.\nAlameda County Public Defender’s Office is urging local law enforcement agencies to help protect courthouses from immigration sweeps after one of its clients was picked up by U.S. Immigration and Customs Enforcement agents.\nLARPD trials cattle mowing at Sycamore Grove Park.\nCommunity mourns Bob Widmer, longtime Pleasanton resident and creator of the popular Widmer World holiday light display.\nAlameda County DA’s Office drops criminal charges against two Santa Rita Jail guards accused of falsifying records related to an inmate death in 2021.\nContra Costa County DA’s Office has filed the first charges against three suspects in a prominent armed robbery at City Center Bishop Ranch, as police continue searching for the numerous suspects that remain at large.\nOctober\nIs Cab Franc the future of the Livermore Valley wine industry? The logic – and hope – behind the region leaning into the newly anointed signature grape.\nPleasanton-Tulancingo Sister City Association finds itself at a crossroads, with the new need for new members and leaders to sustain the organization on the Pleasanton end.\nCity of Pleasanton scores a decisive legal victory when a judge dismisses the lawsuit brought by a former employee over his firing in 2023, finding the allegations of whistleblower retaliation and age discrimination didn’t hold water. Dan Repp would later appeal the decision.\nLivermore teachers union declares impasse at the bargaining table with the district.\nResidents demand answers from PG&E on frequent outages: Power company shares plans to address infrastructure issues, but many Pleasanton customers remain skeptical.\nMath educator John Thayer of Granada High School is named 2025 Alameda County Teacher of the Year.\nFree Range Flower Winery closes in Livermore after nearly four years.\nCity Center welcomes new restaurant tenants: KHAKI opens on the second floor; Meyhouse, Palmetto Superfoods and Rico Rico Taco due in coming months.\n“Smoke shop smackdown”: Authorities sting two Dublin businesses for banned products – to the tune of nearly $200,000 in fines combined.\nDanville police are reminding residents of all ages about the rules for electric motorbikes after an incident in which two juveniles reportedly tried to elude an officer after being caught riding recklessly.\nDowntown Series – Change afoot in Alamo: Small town grapples with maintaining character amid new housing requirements, business shakeups.\nAmador football coach Danny Jones, who led the Dons to the state championship game last season, is leaving the Pleasanton school after this year and moving to Idaho with his family.\nPleasanton council OKs water rate increases as part of new utility fee structure: 2.7% COLA approved for wastewater service too, but full sewer rate study coming down the line.\nYearslong journey to build a 130-unit affordable housing complex in downtown Livermore forges ahead following the state appellate court’s ruling that favored actions by the city aimed at moving the project forward.\nDublin San Ramon Services District appoints familiar face Ed Duarte to serve on the Board of Directors after Ann Marie Johnson’s early resignation.\nRare plant discovered after 68 years: EBRPD confirms caper-fruited tropidocarpum in Vasco Hills Regional Preserve.\nConstruction of a new all-wheel pump track is underway at Sunken Gardens Skate Park, following a years-long delay spurred by additional project requirements, LARPD says.\nThe Weekly learns that Joan and Joseph Patti, a Pleasanton couple in their 90s, died from injuries sustained after their vehicle crashed through an Interstate 580 interchange and landed perpendicular to the ground a month ago in Dublin.\nFatal collision involving a pedestrian on I-580 east of Foothill Road in Pleasanton remains under CHP investigation. The victim still has not been identified.\nJohn Domanico, 68, is found dead inside a vehicle during a garage fire after reportedly crashing into the building on Oneida Court in Danville.\nTwo people are killed and three are seriously injured, including two CHP officers, after a pursuit that started on I-580 west of Pleasanton ends with two crashes in San Leandro.\nOriginal cast member Nell Campbell appears at Bankhead Theater for a screening of “The Rocky Horror Picture Show” upon the movie’s 50th anniversary.\nFirst homes in Francis Ranch community open in East Dublin; development will include 573 new single-family houses and townhomes at completion.\nDowntown Series – Dreaming of downtown Dublin: Timeline to create “Main Street experience” uncertain amid pullback of Dublin Commons proposal.\nPleasanton school board takes first look at potential $13 million-plus in budget cuts: “We’ve been deficit-spending, and we have to correct our structural deficit,” Superintendent Ghysels says.\nPleasanton Middle School celebrates its newly renovated sports field. The Measure I project features synthetic turf, new play courts and more.\nCity Council votes 4-1 to discontinue Pleasanton’s two current utility discount programs and adopt a new, single-tiered structure where the city will now offer a 30% discount to residents who qualify for low-income under the PG&E CARE program.\nTri-Valley turns out to spread the message of “No Kings”: Weekend rallies among nationwide day of demonstrations against the Trump administration.\nIKEA scraps plan to build Dublin store: Company selling 28-acre parcel as it shifts focus to smaller-format stores.\nMichelin-star chef Torsten Schulz opens L Campo restaurant in Livermore, serving “simple and rustic” Spanish plates at the intersection of local and international products.\nCalifornia Music Educators Association Bay Section awards 2025 Rising Star Educator Award to Amador’s new director of orchestral and choir music, Brittany Shankle\nAlameda County supervisors unanimously approve $3.57 million in emergency funding to bolster services for immigrants and refugees as federal immigration enforcement increases across the country.\nPleasanton workers hit by a new round of Kaiser layoffs; local admin and IT positions among the more than 150 cuts.\nNighttime fire causes heavy damage to a strip mall-style commercial building on East Prospect Avenue in downtown Danville, closing a handful of local businesses indefinitely.\nJury finds former San Ramon Valley teacher and cheer coach Nicholas Moseby guilty of felonies and misdemeanors for child sex abuse.\nLivermore High School alum Jeremy Wayne Jones, 53, and his girlfriend Christina Lyn Garner are convicted of murder and other charges for killing 30-year-old Justin Peoples during a confrontation among strangers at a Tracy gas station more than three years ago.\nPleasanton councilmembers voice their initial support for a pre-annexation and development agreement between the city and the applicant behind the Arroyo Lago project set to bring nearly 200 single-family homes to East Pleasanton.\nParents of 2-year-old Matthew Bonneau Jr. file a lawsuit against Building Kidz of Dublin for the toddler’s April death. Day care rep denies allegations of negligence.\nSRVUSD buys Canyon Commons office building in San Ramon for $18 million, which will eventually be funded by the future sale of the district’s current headquarters in Danville.\n“Hoxie Hall”: Sunol Glen School community commemorates the renovation of its cafeteria building, a Measure J project.\nHistoric Harlan House is demolished after fire damage – juveniles were arrested in the suspected arson, and the assisted living facility project proceeding at the site in San Ramon.\nWith a glowing performance review, Livermore City Manager Marianna Burch sees her salary go up to almost $400,000 per year.\nSlice House expanding to Tri-Valley: New pizzeria in downtown Livermore is set to open early next year.\nChevron axes another 68 jobs in San Ramon: Downsizing continues at former headquarters after move to Texas.\nRichard Simion Sajor Jr., 47, of Livermore dies in a motorcycle crash at the intersection of Paseo Laguna Seco and Portola Avenue.\nPFAS contamination is discovered in the Livermore Municipal Airport’s groundwater and soil. The San Francisco Bay Regional Water Quality Control Board says further investigation is required before determining next steps.\nDublin residents Richard Lund and Asia Morton are arrested by Santa Rosa police in connection with the shooting death of San Francisco strip club boss Mark Calcagni.\nRegional officials raise alarm alleging a lack of leadership and sense of urgency in Alameda County following a scathing audit of the county’s child welfare department.\nIsaiah Jamon Andrews, a suspect in a homicide in Washington state, is arrested in Contra Costa County but mistakenly released from jail. His whereabouts remain unknown.\nSan Ramon approves 200 affordable housing units. Eden Housing is poised to be the city’s first-ever “100% affordable” complex amid expansive redevelopment in Bishop Ranch.\nNovember\nAfter being left in the dark for over a year, the Amador community now have confirmation on why their principal suddenly went on a mysterious leave of absence last year: A third-party investigation sustained allegations that Jonathan Fey had inappropriate conversations with two Amador alumni on Grindr (including during one’s senior year) between late 2023 and August 2024, which led to Fey’s removal from the school and ultimately his departure from PUSD. Fey, a married father who lives in Pleasanton, adamantly denies the allegations to this day.\nAdditional reporting on the Fey case, which occurred in the aftermath of the district agreeing to turn over documents to the Weekly 13 months after our initial public records request, includes that the two sides settled Fey’s administrative challenge against the district in exchange for $254,000 and the ability to resign, among other terms.\nNewport Academy shutters Tri-Valley locations: Teen rehab facilities laying off 28 staffers as company shifts.\nPhilz Coffee opens in Pleasanton: Coffee chain welcomes customers to its first drive-thru store in Northern California.\n“Food is a human right. No one should go hungry.” Alameda County officials announce plans to help families affected by SNAP benefits freeze.\nLivermore restaurant revived after summer fire; Zephyr Grill & Bar welcomes diners back following nearly four months of restoration.\nNeighborhood disagreement over a family’s application to install six, 15-foot-tall tennis court lights in their backyard comes to an end after a split Pleasanton City Council votes not to uphold the Planning Commission’s previous approval of the project on Martin Avenue.\nCalifornia voters approve Proposition 50, redrawing congressional maps to favor Democrats in response to national redistricting fight.\nAuthors’ canceled Country Club Elementary visit causes a stir – “The Day the Books Disappeared” writers allege censorship; SRVUSD points to “concerns” about material from prior visits.\n“These are all painful cuts”: PUSD board refines priority list of reductions, seeks to minimize direct impact on students.\n“Constructively terminated”: EBRPD General Manager Sabrina Landreth resigns two days after performance evaluation, later claims the board left her no option. Deputy Max Korten appointed acting GM at a sudden Saturday morning meeting.\nTotal of 40 earthquakes are recorded on the same day with epicenters in the Valley, with nearly all located within the city limits of San Ramon. The largest is 3.8 magnitude.\nPleasanton resident Rowena Coronel, 56, dies after being hit by a car at the intersection of Main and Neal streets in downtown Pleasanton.\nPleasanton council authorizes City Manager Gerry Beaudin to sign an agreement with a consultant to develop a comprehensive citywide assessment designed to streamline the city’s organizational structure and identify cost savings.\nLivermore High is recognized as 2025 Peggy Kubert Model School in Mental Health Excellence.\nPair of proposals designed to protect Alameda County residents from President Donald Trump’s aggressive mass deportation policies will remain in the development phase for at least the next month or so.\nVisit Tri-Valley unveils new visual branding, aiming to depict region as “warm, welcoming, adventurous and authentic”.\n7 authors, 1 book: Pleasanton neighbors chronicle their journeys in respective industries to inspire others in “Success Beyond the Backyard”.\nFairfield man accused of trespassing on several school campuses and stealing items throughout the Bay Area, including recently in Livermore, has been arrested. Christopher Britton was also charged back in April for similar crimes in other communities, including Danville and Dublin.\nDublin’s Courtney Alford, suspected of prowling and stealing personal items from a sorority house at UC Berkeley, is arrested by police on suspicion of multiple crimes.\nPUSD is facing a lawsuit from former Foothill pole vaulter Aman Deshmukh and his father stemming from the serious spinal injury the teenager suffered at practice last academic year.\nPleasanton Connects debuts: City partners with Workday, TogetherUp on “civic hub” network.\nAll signs point to the Pleasanton City Council finally being done debating the Gulf gas station, as the members review and approve modifications made to the monument signage/canopy following the council’s previous directions at past meetings.\nPleasanton council expresses strong support for the initial concepts of a proposed high-density residential development at the Dublin-Pleasanton BART Station, which could produce as many as 1,300 new rental units.\nPleasanton Planning Commission approves an application and related items to allow the demolition of a commercial building at 4400 Black Ave. and the construction of 59 condos and seven ADUs on the property.\nAlameda County Fair announces The Beach Boys will headline the 2026 Big O Tires Concert Series.\nLivermore and Granada high schools add badminton to their sports slate.\n“A safer, more efficient route”: Highway 84-Interstate 680 interchange improvements are complete as the $244 million project finalizes the expressway through the Tri-Valley.\nTri-Valley Congressman Eric Swalwell announces bid for California governor: Campaign priorities include fighting Trump policies while focusing on affordability, economic growth and modernizing state government.\nLivermore High School sophomore Zoe Zabrowski, whose parents own Much Ado About Pizza in Pleasanton, wins 2025 Young Pizza Maker of the Year honor during the Florida Restaurant Show/Pizza Tomorrow Summit for her unique pizza she dubbed “Pigs in Paradise”.\nJudge orders the city of Dublin to revoke Measure II for failing to conduct a required environmental review ahead of placing the measure on the November 2024 ballot. City loses voter-approved authority to greenlight limited development along future Dublin Boulevard extension.\nAs city’s current franchise agreement with Pleasanton Garbage Service is set to end in a few years, the council unanimously agrees to give city staff six months to continue negotiating an extension of the current agreement with the waste service provider\nLocal young innovators honored with the 2025 DreamMakers and RiskTakers awards from Innovation Tri-Valley Leadership Group.\nLivermore Amador Valley Transit Authority is awarded a $63.95 million grant from the Federal Transit Administration for the construction of a new agency campus and eight hybrid buses.\nThe Weekly learns that veterinarian Surya Chaudhri of Animal Medical Center of Pleasanton could be facing disciplinary action by the state for allegedly diverting prescription medication from the practice for personal use.\nThe Gateway Centre shopping center anchored by Lucky, Dollar Tree and McDonald’s is now listed for sale at an undisclosed price near the border of San Ramon and Dublin.\nLivermore celebrates Flagpole Plaza renovations – sidewalks, dining areas and landscaping among features renewed downtown.\nCity of Pleasanton finished last fiscal year with a $7 million surplus, according to unaudited year-end actuals. Staff point to developer fees, business revenue increases among unbudgeted funds.\nXiaojie Zhang, 40, of Union City is taken into custody after police allege she shot a 17-year-old boy in San Ramon.\nMove Eden Housing continues to challenge the affordable apartment complex proposed for downtown Livermore — this time petitioning the California Supreme Court to review a recent ruling by the state appellate court in favor of the project’s progression.\nPleasanton resident Badal Dholaria, 27, is charged with murder and other counts for allegedly driving over 150 mph while drunk and crashing into another car on Crow Canyon Road in San Ramon, killing 41-year-old Alix Sparks of Castro Valley. Dholaria pleads not guilty.\nLivermore council greenlights 13-unit townhome project on East Avenue.\nBrown vote violated Brown Act: Judge rules Alameda County and its Board of Supervisors did not follow procedure when it appointed former interim supervisor Dave Brown in 2021.\nPleasanton school board completes its months-long budget cut process, approving just over $11 million in reductions. Staff will begin meeting with labor unions to discuss negotiable items over the next few weeks.\nDecember\nBecky Chestnut is sworn in as new San Ramon police chief.\nLARPD is not pulling out of its campground located near the south shore of Lake Tahoe, the agency’s Board of Directors confirm during a special meeting — an explicit correction to rumors circulating about Camp Shelly’s future.\nHateful, racist graffiti is scrawled in a restroom at Amador, the third such incident in just over a month.\nBrayam Chirinos, 30, is charged with murder for allegedly stabbing his roommate, who was found dead at home on North P Street in Livermore during a welfare check after not having been seen in several days.\nAmador alumnus and aspiring nurse Scott Renton, 25, dies in motorcycle crash on I-580 west of Pleasanton.\nBottleTaps, a bar and restaurant in Pleasanton for nearly a decade, closes for good.\nDublin school district and teachers union are at an impasse in labor negotiations.\nThe Golden Skate roller rink is shut down indefinitely – and possibly permanently – after the death of longtime manager Manuel Duarte.\nT’s Nail Bar owner Tammy Nguyen opens Fusion Wine Bar in the unit next door in Pleasanton.\nJCPenney is shuttering its store in Stoneridge Shopping Center in February: Retailer cites lease issues as main reason for exit; building owner teases “new-to-market tenant” on tap.\nSanjani Ramkissoon reflects on opening new yarn store Stitch & Revel in Livermore.\nPamela Price, the former Alameda County DA who was recalled by voters last year, enters the race to get her old job back in the 2026 election.\nFoothill junior Luka Mijatovic crushes the national age group record in the 800-meter at U.S. Open Swimming Championships.\nDowntown Series – Home in Danville for the holidays: Small businesses welcome winter shopping season as economic bright spot – but long-term challenges loom.\nThe Brass Door is shuttering after nearly 80 years: Christmas Eve will mark the final day for storied San Ramon steakhouse.\nPolice investigate after eight trees are cut down overnight at Dublin High School.\nNewly released investigatory documents on former Amador principal Jonathan Fey claim that — apart from allegedly grooming and seeking sexual relationships with recent-former students — Fey had created a toxic workplace environment, gave a student a lottery ticket for their 18th birthday and violated his leave of absence directives by judging a color guard competition.\nSuperintendent Chris Funk announces his retirement from Dublin Unified, effective in June.\nFirst domino falls in a difficult year of teacher negotiations in the Tri-Valley. Livermore Education Association, which declared impasse two months ago, reaches tentative agreement with LVJUSD after a 14-hour mediation session. The deal centers around two salary increases during the 2026 calendar year and additional health and welfare benefits.",
  "word_count": 13862,
  "scraped_at": "2026-02-14T12:20:37.137225"
}