{
  "article_id": "e184bbf93cb5",
  "url": "https://www.yahoo.com/news/articles/2026-bring-toll-hikes-projects-092228187.html",
  "title": "2026 will bring toll hikes , projects on NJ transportation front",
  "date": "20251224T101500Z",
  "domain": "yahoo.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "2026 will bring toll hikes, projects on NJ transportation front\nThe Garden State transportation universe that Gov.-elect Mikie Sherrill will inherit in 2026 is nothing short of busy.\nBig events such as the FIFA World Cup are nearing, and massive infrastructure projects are underway like the Port Authority bus terminal and Gateway rail tunnel projects. And the new Portal Bridge will open later in the year.\nControversial policies will also be top-of-mind, including a bid protest over the New Jersey Turnpike Authority’s E-ZPass program and the 3% annual fare increases at NJ Transit. The Manhattan congestion pricing plan is also still in court.\nHere’s an overview of some of the big transportation issues to keep an eye on this year.\nStory continues below photo gallery\nCongestion pricing\nThe congestion pricing program, which charges drivers $9 to enter Manhattan below 60th Street, is expected to continue unabated in 2026 – even as patience from the Trump administration is wearing thin.\nThe Metropolitan Transportation Authority got the green light to proceed with congestion pricing from a federal judge in a case lodged by New Jersey trying to kill the program, and collections started on Jan. 5, 2025.\nBut in February, U.S. Transportation Secretary Sean Duffy claimed to “terminate” the program.\nThe MTA responded by suing the U.S. Department of Transportation to prevent the federal agency from withholding federal funds and project approvals as retaliation while the case plays out.\nJudge Lewis Liman has not yet issued a decision in the case — and has said he would do so before the end of December. The Trump administration sent a letter to Liman on Dec. 2 nudging him to issue a decision “as soon as it is able.”\nFare and toll increases\nOne of the legacies of Gov. Phil Murphy’s administration is guaranteed 3% increases to tolls and fares, policies implemented at NJ Transit and the New Jersey Turnpike Authority during two terms in office.\nAssuming the Turnpike Authority board signs off on its 2026 budget, tolls on the Turnpike and Garden State Parkway will rise 3% in January, as it has done for the four years prior (except in 2024 when tolls went up in March).\nNJ Transit riders’ fares are expected to increase 3% on July 1, raising ticket costs 21% since July 2023 after going nine years without a hike.\nBoth of these policies could change if Sherrill makes it a priority and ensures support from the boards for both entities. Sherrill told NorthJersey.com she’d like to “move away from” the annual 3% fare hikes at NJ Transit, but said it would require planning.\nPort Authority projects\nMultiple large and small projects overseen by the Port Authority of New York and New Jersey will be getting underway or wrapping up in 2026.\nOverseeing those projects will be a new executive director, Kathryn Garcia, who was tapped by New York Gov. Kathy Hochul. If approved, Garcia will fill the role held by Rick Cotton for the last 8½ years, where has worked well with board Chair Kevin O’Toole, of New Jersey.\nHere’s a brief overview of some of those projects:\nThe $10 billion Port Authority bus terminal makeover will embark on heavy construction in 2026, beginning with a rebuild of the ramps between the depot and the Lincoln Tunnel and reconstructing the staging and storage area that will house buses during Phase 2. Construction is expected to last until 2032.\nConstruction on the new $3.5 billion Newark AirTrain got started in October and will be well underway in 2026. Its expected completion date is in 2030.\nThe Newark Airport Railroad Station access project has been under construction since June and is expected to be completed before the end of 2026. This $160 million project will give residents in Newark’s South Ward access to Amtrak, NJ Transit and PATH via the expansion of a station that has existed for 24 years but was never accessible to the neighborhood.\nGateway tunnels\nPlans to advance a $16 billion program to build a new two-track rail tunnel under the Hudson River between North Jersey and Manhattan — and then repair the old one — are slowly getting back on track after a tumultuous fall.\nFederal funding reimbursements to the Gateway Development Commission, the bistate agency that is overseeing construction, were paused Oct. 1 after the Trump administration announced it would be conducting a “review” of the agency's procurement practices involving small, minority- and women-owned businesses. President Donald Trump also threatened to “terminate” the program.\nThe review coincided with the federal government shutdown and was believed by many to be a form of retribution against New York’s Democratic leaders who were in tough negotiations with Republicans over the federal budget.\nAlso during that time, a construction worker died on a project site in Manhattan and the Gateway commission's CEO and president was hospitalized after suffering a cardiac event in October.\nMore in U.S.\nThe U.S. Department of Transportation sent a letter to the Gateway commission in December detailing its initial findings from the review and how to “eradicate these discriminatory practices” in order for federal funds to resume.\nMeanwhile, five out of 10 projects in Gateway’s first phase are in construction and tunnel boring machines will be delivered in January.\nFIFA World Cup\nThe day after the New York Giants' last regular-season NFL football game is played at MetLife Stadium in January of 2026, NJ Transit’s team will be on-site to prep for construction of a temporary bus terminal there to handle crowds for the World Cup matches that MetLife will host in the summer of 2026.\nConstruction on the terminal and other supporting infrastructure will begin later in January as the agency and officials across the region prepare for the world’s biggest sporting event — with eight World Cup matches, including the final, being played in East Rutherford in June and July.\nA larger media briefing about NJ Transit’s mobility plan for the event will take place Jan. 15, 2026.\nThe agency also dedicated funding for planning a more permanent dedicated bus route between Jersey City and the stadium that could improve future service for big events at the stadium and even connect to the Hudson-Essex Greenway project that got underway in the summer of 2025.\nNew Jersey Turnpike Authority\nThere are at least two big issues at the New Jersey Turnpike Authority to keep an eye out for in 2026.\nConstruction has begun on the Newark Bay Bridge. This is the $6.2 billion first phase of a highly controversial project that will replace the current four-lane bridge with a twin-span, eight-lane bridge from Exit 14 to 14A, connecting Newark and Bayonne along Route 78.\nThe full plan would expand the size of the eight-mile elevated highway from the Holland Tunnel through Jersey City, Bayonne and Newark and also requires replacing 29 bridges.\nSecond, a court case involving bidders seeking to take over the Turnpike’s E-ZPass program could spill into 2026.\nLast year, the Turnpike awarded a $1.7 billion contract to TransCore to manage call centers and other back-office duties related to the toll program. TransCore’s bid was $250 million more than the lowest bidder, Conduent. Conduent ranked lower in the agency’s technical scoring.\nConduent unsuccessfully protested the bid and the matter has now landed in the state Appellate Division.\nPortal Bridge\nBig disruptions on NJ Transit rail lines will take place in early 2026 — most likely in February and March — as workers begin to complete the alignment of the old Portal Bridge with the new Portal North Bridge.\nThis process, known as the “cutover,” will cause some trains to be rerouted or canceled for about six weeks, agency officials estimate. The cutover is a complicated process of aligning tracks, wiring, signals, communication systems and other technology pieces to the new bridge.\nThe 450 or so daily NJ Transit and Amtrak trains that travel on the old bridge are expected to start using one track of the new two-track bridge shortly after the February-March cutover process is complete.\nThis article originally appeared on NorthJersey.com: 2026 will bring toll hikes, projects on NJ transportation front",
  "word_count": 1351,
  "scraped_at": "2026-02-14T12:37:16.340382"
}