{
  "article_id": "e185aaa55191",
  "url": "https://baysidenews.com.au/2025/07/15/somerville-mounts-impressive-comeback-bombers-win-again/",
  "title": "Somerville mounts impressive comeback , Bombers win again",
  "date": "20250715T013000Z",
  "domain": "baysidenews.com.au",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "MEN’S DIV TWO\nSomerville picked up a vital win over Devon Meadows on Saturday afternoon. Both sides came into the match at Glover Reserve in the mix for finals spots.\nSomerville struck the first blow and went into the quarter-time break ahead by a goal. Devon Meadows held Somerville goalless in the second term, opening up a three-goal lead. Somerville whittled the lead back but still needed to close a 16-point gap in the last quarter.\nSomerville mounted an impressive comeback in the closing stages. Devon Meadows failed to kick a goal in the final term, which handed Somerville an opportunity to regain momentum. Somerville raced home to a come-from-behind seven-point win – 10.10 (70) to 11.11 (77).\nMitch Mantell, Lachlan Haskett, Lachlan Gill-Renouf, Oliver Heavey, and Thomas Roberts were named Somerville’s best.\nThe result leaves both sides equal on the ladder on 28 points, with Devon Meadows ahead on percentage. Bonbeach also has 28 points – the Sharks were beaten 14.12 (96) to 9.9 (63) by Chelsea on Saturday.\nUndefeated Frankston Bombers dispatched Karingal with ease last weekend, winning 18.13 (121) to 6.1 (37).\nTyabb pushed hard for a third win of the season on Saturday but fell short against Seaford. The Tigers beat the Yabbies in a shootout 19.17 (131) to 16.8 (104). Matthew Clark was impressive for the Yabbies, booting seven goals.\nPearcedale beat Hastings away from home by 41 points and Rye beat Crib Point by 14 to close out the round.\nWOMEN’S DIV ONE\nWarragul Industrials survived a mighty scare at home against Karingal on Saturday. Warragul came into the match in red-hot form. Karingal proved they were up for the fight though, going into the first break equal and pulling ahead by four points by half-time.\nWarragul fought back in the third term to go ahead by three points. Despite not kicking a goal in the final term, the Industrials held on for dear life to claim a narrow one-point win. Warragul beat Karingal 4.8 (32) to 5.1 (31). Carly Bury booted three goals for the Bulls.\nMornington returned to the winner’s list on Saturday with a dominant victory over Bonbeach. After an undefeated start to the season, the Bulldogs had lost two in a row heading into Saturday’s clash. They corrected course with a 14.18 (102) to 2.0 (12) win.\nGeorgia Templeton kicked four goals for the Bulldogs, and Laura Noonan kicked three.\nFrankston were also 90-point winners last weekend. The Dolphins held Pearcedale scoreless on Saturday afternoon.\nNEXT WEEK’S GAMES\nDIVISION ONE MENS\nSaturday 19 July, 2pm:\nLangwarrin v Edithvale-Aspendale – Lloyd Park\nMt Eliza vs Dromana – Emil Madsen Reserve\nMornington v Frankston YCW – Alexandra Park\nRed Hill v Rosebud – Red Hill Recreation Reserve\nSorrento v Pines – David Macfarlane Reserve\nDIVISION TWO MENS\nSaturday 19 July, 2pm:\nPearcedale v Frankston Bombers – Pearcedale Recreation Reserve\nSeaford v Chelsea – RF Miles Reserve\nCrib Point v Tyabb – Crib Point Recreation Reserve\nKaringal v Hastings – Karingal Football Club\nSomerville v Bonbeach – Somerville Football Club\nDevon Meadows v Rye – Glover Reserve\nDIVISION ONE WOMENS\nSaturday 19 July, 10am:\nKaringal v Frankston – Karingal Football Club\nSaturday 19 July, 1pm:\nBonbeach v Warragul – Bonbeach Reserve\nSaturday 19 July, 4.40pm:\nPearcedale v Mornington – Pearcedale Recreation Reserve\nDIVISION TWO WOMENS\nFriday 18 July, 7pm:\nTyabb v Bass Coast – Bunguyan Reserve\nSaturday 19 July, 12pm:\nMt Eliza v Frankston (Reserve) – Emil Madsen Reserve\nRed Hill FNC v Warragul (Reserve) – Red Hill Recreation Reserve\nRed Hill FNC/Balnarring Thunder FC v Edithvale-Aspendale – Balnarring Reserve\nSaturday 19 July, 2pm:\nKaringal (Reserve) v Mornington (Reserve) – Karingal Football Club\nDIVISION THREE WOMENS\nSaturday 19 July, 11am:\nPearcedale (Reserve) v Chelsea – Pearcedale Recreation Reserve\nBonbeach (Reserve) v Pines – Bonbeach Reserve\nSaturday 19 July, 12pm:\nCrib Point v Tyabb (Reserve) – Crib Point Recreation Reserve\nLangwarrin v Rye – Lloyd Park",
  "word_count": 652,
  "scraped_at": "2026-02-14T12:58:43.169149"
}