{
  "article_id": "e186db6be57e",
  "url": "https://www.independent.ie/regionals/wicklow/arklow-news/local-notes/around-the-districts-aughrim-carnew-coolgreany-and-tinahely/a406212377.html",
  "title": "Around the Districts : Aughrim , Carnew , Coolgreany and Tinahely",
  "date": "20250115T034500Z",
  "domain": "independent.ie",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Around the Districts: Aughrim, Carnew, Coolgreany and Tinahely\nAUGHRIM\nLotto\nThe numbers drawn in Aughrim Sports Club lotto on Monday January 6th were 1, 9, 10 and 14. There was one match three winner: Leanne Quigley online. The jackpot for Monday January 13th is €10,000. The reserve jackpot is €5,900. Tickets can be purchased online up to 9pm on the night of the draw. Thanks to everyone who supports our local lotto.\nYoga Classes with Yvonne\nNew 6 week courses have started at Aughrim Sports Complex – Mixed level class on Mondays at 9.30am and Wednesdays at 8pm. Beginners class on Wednesdays at 6.45pm. All classes are also live-streamed and a recording of the class is provided if you’ve signed up and you miss a class. Classes will go ahead provided there are sufficient numbers. Please get in touch with Yvonne on 087 6778733 to enquire/book or visit yvonnedoyle.com.\nGAA club news\nCongratulations to club player Joe McGuckian who was awarded Junior A footballer of the year last Friday night. Congratulations also to club player Oisin Keegan who was also nominated for this award. Also long time club member Johnny Dunne was awarded a Lifetime Achievement award well deserved. Finally a big shout out to Aughrim Camogie player Aoife Connolly who was awarded Camogie Player of the year.\nThe sympathy of the club is extended to the Keogh and Keegan families on the sad passing of Sheila. Also our sympathies are extended to Jamie and Louise O’Connor on the passing of Jamie’s grandad and Louise’s dad Denis Collins. May they rest in peace.\nTown & Country Market\nThere are a lot of marketeers with fantastic products and produce offerings from barista coffee, fresh biscuits, home baked cakes, artisan breads, frittatas and sausage rolls, plus freshly made garlic pesto, handmade clothing for babies, flower arrangements to beautify homes and workplaces.\nWe have wooden products and hand painted signs, bird boxes and natural healing products plus hand crafted cushions and hand-crafted jewellery and cards. Artisan bread and home bakes plus a beautiful setting to enjoy with the whole family and even to bring along the dog for a walk. The playground is a fantastic place for the little ones while the New to you Thrift shop offers bargains of all kinds for the whole family. The fishing facility is open and stocked so if fishing is your passion this is the place to be. Bowling green is looking stunning, chat to any member for more information.\nPlease see @aughrimtownandcountry on Facebook for weekly updates or contact Linn on 087 6836278 if you want to become a Marketeer or need any information regarding the market. We look forward to seeing you all on Saturday between 10am and 1.30pm. We are at the Pavilion, Rednagh Road - if you are not sure where to find us, put Y14WK38 into your Google maps and it will bring you right to our front door.\nNotes deadline\nItems to be included in the Aughrim notes should be emailed to aughrimnotes@gmail.com before 8pm on Sundays. Do not send attachments.\nCARNEW\nTable Quiz\nJim Kirwan, Gorey and formerly of Brideswell, is organising the quiz in the Loch Garman Arms, Gorey on 23rd January at 8pm. This is a fundraiser in aid of a Syrian family (whose son lived with Kirwans for a number of years) whose home was demolished in the recent war. Cost to enter the quiz is €40 per Table of 4. Your support will be greatly appreciated.\nSplit the Pot\nThe lucky winner of the split the pot draw for Scoil Aodan Naofa Carnew was Liz Driver who won €235. Congratulations. Seller prize winners–Panto Tickets–Conor Kearney and George Lynch. Lucky Dip winner: Rebecca Byrne. Many thanks for your continued support. Our next draw takes place on Friday 17th January.\nBallyellis NS Split the Pot\nWinner of Split the Pot on Friday 10th January was Saoirse Kenny, Kiltilahane, Gorey - winning €120. Well done. Split the Pot envelopes can be had from any parent in the school or by calling into the school. Many thanks to everyone for your support. It is much appreciated.\nBingo\nThe next drive in bingo is on Sunday 19th January at 2pm in Carnew mart.\nSympathy\nSincere sympathy is extended to the family and relatives of Sheila Murray (nee Brophy), Mill Lane, Carnew who died recently, and was buried on Monday in Tomacork cemetery.\nAskamore Community Centre\nThe “Spring into Action” programme will begin in Askamore Community Centre in early February. Courses include Creative Writing, Sewing Machine Skills & Dress Making, Art & Printing, DIY for Men, DIY for Women Contact 085 2156848\nBowls will take place on the first Tuesday of every month, in Askamore Community Centre at 8pm. Come along for a fun way to spend an hour or two. All are welcome including beginners, so why not give it a try. Contact Margaret on 087 7628839\nJoin our Gym: State of the Art Gym and full time Instructor in Askamore Community Centre. Join our 8 week exercise program starting in September, see our Metcon Fitness Facebook page. Enquiries to Colm on 085 7334076.\nPilates with Finch: Wednesday mornings 9am–10am. Enquiries to Finch on 086 8468165.\nNew Year, New You\nNights of stimulating talks continue in January in Askamore Community Centre.\nNight 3: Tuesday January 21st at 7.30pm. Christopher Joyce (Coach Wicklow Football Team): Alcohol Addiction; John Kinsella, Ger Byrne and Pat Lacey (Chairman Wexford Parkinson’s Association, Parkinson’s Local Insights.\nNight 4: Tuesday January 28th at 7.30pm. Catherine O’Leary and Laurence Cullen (Alzheimer’s Association): Challenges of Dementia Michael Fortune: Local Folklore, Songs from Alyth McCormack.\nNight 5: Tuesday February 11th - Bishop Ger Nash on Kindness and other guests, (not yet confirmed).\nAdmission for each night is €10 or €25 for all four nights. Refreshments Served. Contact 085 2156848.\nJoin Tomnafinnoge AC\nTrack & Field Coaches and New Members Wanted! Are you inspired by the recent Olympic Games? Do you want to unleash your potential in track & field? Tomnafinnoge Athletics Club is recruiting across all age groups and skill levels!\nWe are seeking: Juveniles (8-18 years); Seniors (18+ years); Masters (35+ years).\nPlus, we’re looking for Coaches with a passion for developing the next generation of athletes!\nWhether you’re aiming for your personal best, the podium, or simply enjoying the sport, there’s a place for you at Tomnafinnoge Athletics Club. Training includes: Sprints, Distance running, Jumps & throws, Strength & conditioning.\nAll levels welcome! From beginners to experienced athletes.\nJoin us now and be part of something extraordinary! For more details and to register, contact us via our Facebook page or email us tomnafinnogeac@gmail.com\nTinahely Craft market\nTinahely Craft market will be open on Saturdays only for the month of January then business as usual in February we will be open Thursday, Friday and Saturdays. Opening hours will be 10am-4pm.\nOur delicious range of biscuits are back in stock along with all the fabulous locally produced crafts including a new range of Clever Cow ceramics.\nTinahely Craft market is situated in the middle of the village opposite the butchers shop.\nCOOLGREANY\nCommunity Alert\nA burglary took place in the Rathpierce area on last Saturday evening. If you anything suspicious in the area please report to Gorey Gardai at 053 9430690\nBirthday\nBirthday greetings to Ann Bracken, Thomastown who celebrates her 13th birthday on 16th January, have a lovely day.\nCommunity Alert.\nAlthough the weather has improved please remain on the lookout for our neighbours who maybe alone and need our support.\nGood wishes to all members of our community who maybe in hospital or are convalescing at home at present, we wish all of them a speedy recovery to full health.\nScoil Íosagáín enrolments\nCoolgreany National School are now accepting enrolments for September 2025. We are a vibrant, welcoming school community who advocate a growth mindset for all. Check out our Facebook page at Scoil Íosagáin Coolgreany to see the great work that happens in our school each day. Our annual Admissions Notice, our Admission Policy and our enrolment forms are available on our website www.coolgreanyns.ie.\nIf you would like to enrol your child or know of any parents looking to enrol their children in our school please contact us by phoning 0402) 37246 or 085) 8570276 or email us at office@coolgreanyns.ie and we can send an enrolment form home. The enrolment form can be completed and should be returned to the school as soon as possible to guarantee your child’s place.\nCastletown Liam Mellows GAA\nIreland Lights up started 8th January on the walking track in Castletown 7-8pm. 100 days of walking self motivated also starts 8th for those who want to work on their own but would like to join a WhatsApp group for accountability & that little bit of motivation.\nLocal notes\nPlease forward all notes for the local papers to Dan by 6 p.m. on Sunday evening. Email danken9@gmail.com or phone 087 4605166.\nTINAHELY\nTinahely Toastmasters\nHone your Public Speaking, Communication & Leadership skills with us! We are an official Toastmasters International Club. Join our next meeting free as a guest. We meet 7.45pm to 9.45pm on the 2nd & 4th Thursday of every month. Contact 087 2786503 for more information.\nFairgreen Resource Centre\nThe Fairgreen Resource Centre is located to the rear of the Courthouse and is a purpose built social centre where you can relax and meet new people.\nTinahely Active Retirement Association meets every Tuesday morning from 10.30 am to 12.30 for coffee and a chat. The group runs a variety of activities and courses during the year along with annual outings. All are welcome to join.\nAdult Art Classes are held on a Friday morning running from 10 am to 1pm. All levels are welcome from beginners to advanced. Drawing, water colour, oil and acrylic mediums are explored. For further information contact Tina on 087 6561303.\nVincent’s Community Shop\nVincent’s Community Shop is located on Barton Street to the front of the Fairgreen Resource Centre, the shop opens Tuesday to Saturday from 11am to 4pm daily.\nIt offers a wide range of household goods, quality clothes, along with a host of other items ranging from giftware to books and vintage items.\nTinahely Craft market\nTinahely Craft market will be open on Saturdays only for the month of January then business as usual in February we will be open Thursday, Friday and Saturdays. Opening hours will be 10am-4pm.\nOur delicious range of biscuits are back in stock along with all the fabulous locally produced crafts including a new range of Clever Cow ceramics.\nEvents at Tinahely Library\nWriters’ Group - Meeting Wednesdays 8th January and 22nd January at 11am. Are you interested in writing? Are you a writer who’s looking for a little companionship, encouragement, feedback and advice from likeminded people? Then come and join our Writers’ Group at Tinahely Library. Any skill level welcome.\nAdult Book Club - Meet first Tuesday and first Thursday of the month at 7pm. Discover new books – chosen by the members. Relax and enjoy the discussion.\nBaby & Toddler Storytime - Every Wednesday at 10 a.m. Stories, rhymes, songs, play and colouring.\nYour news\nIf you have an upcoming event in the Tinahely area and surrounds. Please email details to us at tinahelynotes@gmail.com. It’s a great way for people to see your event.",
  "word_count": 1888,
  "scraped_at": "2026-02-14T12:11:15.218116"
}