{
  "article_id": "e18b1386e2aa",
  "url": "https://menafn.com/1105724843/Uefa-To-Refund-Liverpool-Fans-For-Paris-Champions-League-Final-Chaos",
  "title": "Uefa To Refund Liverpool Fans For Paris Champions League Fin ... ",
  "date": "20230308T000000Z",
  "domain": "menafn.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "(MENAFN- Khaleej Times) Published: Tue 7 Mar 2023, 3:54 PM Last updated: Tue 7 Mar 2023, 7:50 PM\nUefa will refund Liverpool fans who attended last year's Champions League final in Paris, Europe's football governing body said on Tuesday after an independent report said they were responsible for the chaos outside the stadium.\nThe final was delayed by 36 minutes after thousands of Liverpool supporters were unable to get into the Stade de France for the match on May 28, which Real Madrid won 1-0.\nFrench police were filmed using tear gas on fans, including women and children. Although Uefa initially blamed the Merseyside club's fans for the mayhem, the governing body later apologised following the release of an independent review.\n'We have taken into account a huge number of views expressed both publicly and privately and we believe we have devised a scheme that is comprehensive and fair,' Uefa General Secretary Theodore Theodoridis said in statement.\n'We value the input from the Liverpool FC supporter organisations Spirit of Shankly (SOS) and Liverpool Disabled Supporters Association (LDSA) as well as the open and transparent dialogue throughout this period.\n'We recognise the negative experiences of those supporters on the day and with this scheme we will refund fans who had bought tickets and who were the most affected by the difficulties in accessing the stadium.'\nUefa said refunds would be available to all fans with tickets for gates A, B, C, X, Y and Z which was where 'the most difficult circumstances were reported'. Liverpool fans had 19,618 tickets allocated for the final.\nThe two fan groups, SOS and LDSA, welcomed the announcement with a joint statement but said it does not let Uefa off the hook.\n'With a promise to reimburse supporters, Uefa have gone some way to acknowledge their part in the fiasco,' they said.\n'But it does not excuse Uefa, exempt them from criticism or lessen the need for them to implement all of the recommendations made by the independent inquiry.'\nTickets for the final cost between 62 pounds ($74) to 610 pounds ($733).\n'In addition, all fans who according to the access control data did not enter the stadium before 21:00 CET (the originally scheduled kick-off time) or who were not able to enter the stadium at all, will be eligible for a refund,' Uefa added.\n'Due to the nature of the original ticket sales process, whereby Liverpool fans purchased tickets from Liverpool FC and not directly from Uefa, Uefa has requested that the club implements the refunds to ensure personal data protection and for ease of process.'\nUefa said Real Madrid fans and neutral supporters who meet the refund criteria will be processed via their customer service.\nALSO READ:\nfootball world bids adieu to just fontaine with service in toulouse\nchampions league: chelsea's expensive recruits face moment of truth\ncreating opportunities for tomorrow's footballers: maclovio yanez's inspiring initiative",
  "word_count": 482,
  "scraped_at": "2026-02-14T11:59:32.279500"
}