{
  "article_id": "e1a56a9d2400",
  "url": "https://www.telegraph.co.uk/boxing/2024/05/30/eddie-hearn-boxing-interview-britain-children/",
  "title": "Eddie Hearn interview :  Im not a genius – I just have an incredible engine  ",
  "date": "20240530T214500Z",
  "domain": "telegraph.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Saudi Arabia feels as apt a place as any to be sitting down with Eddie Hearn. The kingdom’s insatiable appetite for using sport as soft power mirrors his own ravenous quest to become the dominant boxing promoter of his age. He practically commutes here, flitting between tête-à-têtes with local royalty and drinks receptions on the lawns of the British Embassy. It is quite the red-carpet ride for a man who, as the only son of Barry Hearn, the impresario behind the successes of everybody from Steve Davis to Lennox Lewis, has spent his life lampooned for growing up with a silver spoon in his mouth. But at 44 he has, as he never tires of telling his critics, turned it into gold.\nWe meet in a quiet corner of the Fairmont Ramla, a hotel on Riyadh’s northern outskirts. On Saturday night, he will preside over his latest lavish Saudi production, “5v5”, pitting five of his finest fighters against those of Frank Warren, his long-time nemesis. By his own admission, Hearn has not slept much: a consequence of jet lag, construction noise across the street, and scrolling on his phone half the night trying to buy his daughter a pair of football boots. All told he has been asleep for just three hours and 38 minutes. Courtesy of a fitness tracker on his wrist, he can talk obsessively about his circadian rhythms.\nWith a history of cardiac issues in the family – three generations on his father’s side have suffered heart attacks young – he is not inclined to take any shortcuts with his health. In just four years, Hearn has gone from feeling a creeping discomfort at “my belly overhanging in a tight suit” to losing two stone, evangelising about his fitness regime and becoming a cover star for Men’s Health magazine. Today he is noticeably trimmer in a dressed-down, hot-climate ensemble of midnight-blue shirt and shorts: “My mindset has changed quite a lot,” he acknowledges.\nIt is rare to carve out an hour in Hearn’s schedule where he will not be disturbed. His existence is one long, hard sell, hawking his fighters for all they are worth as an army of YouTubers hangs on his every word. Not that he has too many competitors in his field any longer. Anthony Joshua, the superstar of his stable, has twice filled Wembley Stadium. Even Warren, has fewer followers on X, formerly Twitter, than “No Context Hearn”, a parody account devoted to capturing him in all his madcap guises, whether downing a beer in one or barging into a dressing room post-fight to ask, “How did you fluke that one?”",
  "word_count": 438,
  "scraped_at": "2026-02-14T13:12:41.530825"
}