{
  "article_id": "e1b15fdcc401",
  "url": "https://www.centralwesterndaily.com.au/story/8580264/kerr-in-high-spirits-as-matildas-prepare-for-mexico/",
  "title": "Kerr  in high spirit as Matildas prepare for Mexico",
  "date": "20240404T014500Z",
  "domain": "centralwesterndaily.com.au",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Sam Kerr is \"in high spirits\" according to Mackenzie Arnold as the Matildas gather for their first match since charges were laid against their talisman and captain.\nSubscribe now for unlimited access.\nor signup to continue reading\nThe Matildas are in the United States this week preparing for a friendly match with Mexico on Wednesday (AEST).\nThey are without Kerr - who suffered the dreaded anterior cruciate ligament injury in January - as they will be for their next big challenge: the Paris Olympics, beginning in July.\nLast month, Australia's highest-profile footballer was charged under the Public Order Act with a racially aggravated offence after reportedly telling a police officer he was a \"stupid white bastard\" or \"stupid white copper\".\nThe incident took place a day after Kerr scored a hat-trick in Chelsea's FA Cup win with Liverpool in January 2023 and she is due to appear in court later this month ahead of a February 2025 trial.\nArnold, a good friend of Kerr's as well as a long-term Matildas teammate, said Kerr's plight wasn't a subject of discussion in camp.\n\"Honestly, we haven't really spoken about it at all,\" she said.\n\"Sam's just really concentrating on her knee rehab back in London and she's in high spirits and just pretty much carrying on with normal.\n\"We haven't really conversed with the team and her at all.\"\nThe nature of the alleged comment has led some to call for Kerr to stand down as national captain, which is something of a moot point given her injury.\nArnold said there was no move on Kerr's captaincy from the team, with regular vice captain Steph Catley would assume the armband in San Antonio.\n\"I don't believe so,\" she said.\n\"I haven't really had that conversation. It's just not really in the team environment right now.\"\nKerr kept the incident from national team bosses, though it's unclear if teammates knew.\nTony Gustavsson's side are enjoying the relative luxury of an week-long training camp in Melbourne, Florida before heading to Texas for the friendly next week.\n\"I wouldn't know if I'd call it luxurious ... but it gives us probably the best chance to sort of prepare on how we want to play,\" Arnold said.\n\"We're making a couple of changes to how we want to play and this probably comes at a perfect time just to really get a solid seven days together really working on that.\"\nAnd those changes?\n\"That's what you'd have to find out ... different playing styles, experimenting with different positions.\"\nArnold comes into camp from her club home with West Ham, 11th in the 12-team Women's Super League and just above relegation.\nDespite their gloomy position, the 30-year-old was upbeat on the Hammers' form, which includes a win over Arsenal and draw with Manchester United, both top four sides, in their last six outings.\nAs one of the best goalkeepers in the world, she has been tipped to explore free agency this summer, but Arnold said that wasn't currently in her thinking.\n\"I feel that we're actually probably playing the best football that we've played since I've been there,\" she said.\n\"We're really taking positive strides.\n\"We're trying to get points and stay above relegation so that's my main focus at the moment and we'll see at the end of the season.\"\nAustralian Associated Press",
  "word_count": 557,
  "scraped_at": "2026-02-14T12:57:39.521032"
}