{
  "article_id": "e1b65d589596",
  "url": "https://www.90min.com/who-is-newco-the-governing-body-wsl-championship",
  "title": "Who is NewCo ? The governing body tasked with leading WSL and Championship into new era",
  "date": "20240629T090000Z",
  "domain": "90min.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Who is NewCo? The governing body tasked with leading WSL and Championship into new era\n- It was confirmed in November that clubs voted unanimously to form a new organisation\n- NewCo will be led by chief executive Nikki Doucet\n- Plenty of questions will need to be answered as WSL enters new era\nThe professional women’s game in England will enter a new era this summer ahead of the 2024/25 season as they split from the previous governance of the Football Association.\nThe FA has been one of the key driving forces behind the progression and professionalisation of women’s football on English soil for more than a decade, but now a new, independent company will assume control under what is currently known as ‘NewCo’.\nIn 2010, the Women’s Super League (WSL) was established and the inaugural campaign in 2011 saw eight teams competing in the competition. It was expanded in 2014 to 10 teams and eventually to the current 12-team format ahead of the 2019/20 season.\nNow, a new organisation is in place and ready to dedicate all its time and resources to drive the growth of the women’s game both on and off the pitch. 90min has taken a look at who NewCo are and what they will need to address in the not so distant future.\nWho is NewCo?\nMoving ownership of the WSL and Championship away from the FA has been discussed for a number of years, but it is a process that hasn’t been rushed. Baroness Sue Campbell told the Guardian in 2022: “We don’t want to launch an independent company until we’re sure of its sustainability financially. To be honest, that won’t come until we get the next broadcast deal. That’s a couple of years away.”\nPlans ramped up last year and by November 2023, it was confirmed that clubs had voted unanimously to proceed with the formation of a new organisation (NewCo) to lead the game into a new era. NewCo is an independent body in which clubs who compete in the WSL and Championship are stakeholders.\nDue to the FA’s commitment to the amateur and professional game across the entire country, it became clear an independent body was needed to accelerate the growth of the game. However, the FA will continue to have a share in the new company, as it does in the men’s professional game and the Premier League.\nWho is Nikki Doucet?\nNikki Doucet was appointed as the CEO of NewCo and both the Barclays Women’s Super League and Barclays Women’s Championship late last year. She started the role with immediate effect and is responsible for overseeing the transition away from the FA’s governance.\nDoucet, who was born in Canada, began a consultancy role with the FA early last year and her background in business management, commercial and marketing made her the standout candidate to assume the role of chief executive of NewCo. She boasts experience in banking, but also spent eight years at Nike, initially as a Finance and Strategy director and later as general manager of NikeWomen.\nSpeaking to the FA in January, Doucet outlined her vision for NewCo and insisted they will have a new name at some point in the future.\nShe said: “In ten years from now, I hope you’re asking me questions around things like how do I get off the waiting list for tickets to WSL games, so we’ll have stadiums at top capacity, all the top players wanting to come here and I want to be answering questions around elite female athlete health and how that has transformed the high street physiotherapy.\n“I want you to look at an all-female team and the first thing that goes through your head is ‘wow, that’s a high performing team’ with no hesitation.”\nNew broadcast deal\nOne of the first points of business for NewCo was establishing a new broadcast deal as the initial three-year agreement signed by the BBC and Sky Sports ahead of the 2021/22 season was due to come to an end this year.\nIn April, it was announced that the two broadcasters had extended for the 2024/25 campaign, with a long-term deal delayed as NewCo navigates the transitional period. Next term, Sky will show 44 matches, which is an increase on the 35 games in the last deal, while the BBC will show 22 live games and the FA Player will continue to show a selection of matches.\n“We’re very pleased that Sky Sports and BBC Sport are continuing their broadcast rights partnership with us for a further season,” Doucet said, when the deal was announced two months ago. “The past three years have been incredibly exciting for the women’s game — each broadcaster’s coverage of the Barclays Women’s Super League has helped to take the game to another level and open it up to new audiences, and we’re looking forward to seeing that continue and momentum build as we move into a standalone entity.”\nWhat else needs to be addressed?\nDespite calls from some sections of the women’s game for the WSL to adopt a format similar to that of the NWSL, Doucet confirmed earlier this year that the top flight and Championship will keep their current formats of promotion and relegation.\nDoucet also explained that it is unlikely they will be able to implement any major changes before the start of the 2024/25 season. Speaking to the BBC, she outlined the legal processes they have to work through and insisted it will take time.\nIn the longer term, an independent fan-led review chaired by former Lioness Karen Carney put forward 10 major recommendations to further strengthen the future of the women’s game. It has been backed by the UK government and in the same interview with the BBC, Doucet expressed NewCo’s agreement with all the recommendations.\nAmong the suggestions put forward by Carney is the restoration of the talent pathway for future Lionesses, as well as the professionalisation of the top two tiers. At the moment, it is only a requirement for WSL clubs to have full-time operations. In the Championship, many teams do have a full-time structure, but others operate part-time.\nAlso set to be addressed in future broadcast deals is the widespread calls, including in Carney’s review, for the women’s game to have a designated time slot. This could be the current Saturday 3pm “blackout”, which prevents live matches from being broadcast at that time in a bid to safeguard attendances at lower league football games.\nDoucet and NewCo will also be tasked with attracting new audiences to the women’s game and ensuring financial sustainability both in the short and long-term.",
  "word_count": 1105,
  "scraped_at": "2026-02-14T13:04:37.163187"
}