{
  "article_id": "e1b8a19cd538",
  "url": "https://www.smh.com.au/sport/dog-racing-is-on-its-last-legs-and-here-s-another-hammer-blow-20250814-p5mn38.html",
  "title": "Dog racing is on its last legs … and here another hammer blow",
  "date": "20250815T213000Z",
  "domain": "smh.com.au",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "This was published 5 months ago\nOpinion\nDog racing is on its last legs … and here’s another hammer blow\nPeter FitzSimons\nColumnist and authorFor serious people who oppose the barbarous sport of greyhound racing – but I repeat myself – there was great news this week out of Tasmania. The Liberal government down there has announced the forthcoming end of dog racing in the Apple Isle, putting it in line with the ACT, which has also banned it, and indeed most of the world.\nAgainst this trend, NSW remains completely out of step. The Baird government announced back in 2016 it would ban the sport, only to perform a stunning backflip less than a year later. Successive administrations have baulked at implementing a ban and still greyhound racing goes on – despite the imminent closure of the infamous Dapto dogs track.\nHowever, here’s another hammer-blow coming for the industry nationwide. I don’t really do “exclusives,” but I guess this is one. Andrew Wilkie, the Tassie MP who holds a lot of sway on the crossbench and in parliament, sent me this statement on Thursday:\n“I intend to move an amendment to the Interactive Gambling Act that would prohibit online gambling on greyhound racing in Australia. This would in effect put an end to the disgusting industry. In any case, the cruel industry’s days are clearly numbered ...”\nExcellent.\nTerry’s Boks of delights\nThe last time the Wallabies last defeated the Springboks at Ellis Park, your humble correspondent was just two years old. It was 1963, and the goodies came good for a massive 11-9 Triumph For the Ages. The star of the show was our fullback, Leeton’s own Terry Casey who, after the Springboks’ five-eighth failed to find touch with a clearing kick, first kicked a 45-metre field goal, followed by a penalty goal, and then converted the John Williams try in the corner with a kick from the sideline!\nThe other highlight was our late, great, halfback Ken Catchpole making a match-saving, last-ditch, ball-dislodging tackle on Springbok winger Gert Cilliers as he was about to score – similar to the famous George Gregan 1994 Bledisloe Cup winning tackle on All Black winger Jeff Wilson in 1994.\nBut here’s the best part.\nAfter the Wallabies historic victory, the South African crowd gave them a standing ovation, before the Springboks came into the Wallabies’ dressing room and sang “For they are jolly good fellows”.\nAnd so say all of us.\nThese days, Terry Casey is 87, and facing the odd health issue, but follows the Wallabies closely and will be watching tonight. He reckons, “the Wallabies have a good chance this year to end the 62 year drought.”\nHe has, of course, fond memories of that match, all those years ago.\n“It was a day when every player was really focussed and turned on,” he told me this week. “It was an excellent game. The Australian scrum stood up to the Springboks. The lineout with Peter Crittle and Rob Heming won a lot of ball. The breakaways, Greg Davis and Jules Guerassimoff, continually harassed the Springbok halves, one result being that the Springbok five-eighth on one occasion failed to find touch with a rushed kick which I caught and dropped a field goal. Ken Catchpole played his usual wonderful game. After the match, the Springbok fullback, Lionel Wilson, came up to me, and we walked from the field together.”\nThe two kept in close touch until Wilson’s death in 2017.\nNearly all of Terry Casey’s own mates from that mighty team are gone now but, 62 years on, that match still warms the cockles of his soul.\nShip of fools\nThe America’s Cup? Put a fork in its arse, and turn it over. It’s done. Yes, it used to be a very big deal and I still maintain that the win by Australia II back in 1983 was the most exciting sporting moment of my lifetime.\nThe problem is, once we’d broken the American domination – they had held it for 132 – we quickly lost interest. Other nations won it from time to time, but, in the end, sailing is pretty much a dud spectator sport unless you took sea-spray with your mother’s milk.\nThe latest iteration, as organisers try to make it interesting, beggars belief. In 2027, each 76-foot America’s Cup boat will carry a sixth “guest” crew member who could be a celebrity, VIP, sponsor, influencer or dignitary. This, we’re told, is to maximise commercial, media, and fan engagement by reporting exactly what it is like to race onboard the most technological boats in the world.\nGet it? It was always a rich man’s sport, where you needed tens of millions to even get to the starting line, but it seems to have now morphed into marketing nonsense. You’ll recall a few years ago, when the Sydney to Hobart started being won by the owners with the deepest pockets, often by boats filled with celebrities – that it started to feel less and less like a sailing contest. Ditto this.\nI am guessing that, just before the finish line there will be a shark that each boat must jump over, before finally getting to lift the Cup.\nFitzy don’t surf\nSigh. How quickly they forget.\nThis was the question asked on Tipping Point last week.\nA fine young woman from South Australia, who clearly does not know the grass grows greener at Hindmarsh Stadium for the blood I spilled there, not all of it mine, playing against the All Blacks, answered, “Surfing”.\nI am going outside, and should be some time.\nIt at least allowed one of my kids to do up this picture with AI – the only time, I hope, an AI image will appear in this space.\nWhat They said\nCricket fan Harry Gill got his 15 seconds after he caught a ball at the Darwin T20 while holding two drinks in the other hand: “I had a bit of time, but it was just coming straight for me. I was praying I didn’t drop it like [Broncos star] Ben Hunt did in the 2015 grand final ... I wish I had a durry in my mouth.”\nDavid Campese, in his weekly acidic rant, the week after the Wallabies coach guided his charges to a fabulous win over the Lions: “I can see why Joe Schmidt has never won a RWC. He has no idea about rugby. Clueless.” The whole Campo thing gets sadder every year.\nUS soccer player Christian Pulisic is unimpressed with rent-a-quote former stars: “The most annoying thing – and for me, the biggest cop-out of all time – is when … all pundits want to say [is]: ‘They didn’t want it. They didn’t have the heart. You know, back in our day, we would fight and we would die on that field’.”\nTom Brady after the New England Patriots made a 3.5m statue of him: “This is quite overwhelming to me. I feel extremely honoured, deeply grateful and, if I’m being honest, kind of old. I never dreamed I’d be standing here two-and-a-half decades later made of bronze and frozen in time.”\nRabbitohs coach Wayne Bennett on a club coach not being the Kangaroos coach: “They must think coaches don’t do anything for teams. They think we just get the sack. It’s nonsense that a club coach can’t handle the Australian job. We only play a few Tests a year, it’s not a full-time job.” That’s one of those quotes where everyone reads it and goes, “He’s right, you know!”\nSouth African Dewald Brevis after scoring a century in the T20 against Australia: “Just when I reached that century, the most important thing for me, it wasn’t me. It’s all God. I give it all to him, all the glory, and he blessed me with a talent to play like that.” To say the bleeding obvious, a pity he wasn’t focused on the kids in Gaza, instead.\nMarnus Labuschagne on how he can’t be dropped if he already has been: “This has given me an opportunity to reflect and not having the pressure of the media saying, ‘Marnus has got to go’.”\nBen Cousins talks of the concussion he suffered after he first left West Coast Eagles to start playing for Richmond in 2009: “It was one of the first games that I played, it was a pre-season game, and I came off halfway through the first quarter ... I sat on the bench and had no memory whatsoever of the previous two or three years, and I was like a goldfish … every 30 seconds to a minute, I would have no memory of the conversation that I just had, and kept going, ‘Why am I playing for Richmond? What’s happened?’”\nUFC boss Dana White speaking to US channel CBS about Donald Trump’s plan to host a match at the White House next year, to celebrate the 250th anniversary of the country’s independence on July 4, 1776: “It is definitely going to happen.” The barbarians are at the gate, ushered in by the Barbarian-in-Chief in the Oval Office.\nThe renowned melanoma researcher and former Australian of the Year Richard Scolyer, who was diagnosed with terminal brain cancer in 2023, was among the 90,000 people who ran the City2Surf in Sydney on Sunday: “I figure I’m only here for a short time, so I’ll make the most of it. I’m not giving up now.”\nTasmanian Premier Jeremy Rockliff, announcing his state would become the second jurisdiction after the ACT to pull all government funding for greyhound racing: “I can confirm that we will be phasing out greyhound racing by June 30, 2029 ... With participation in the sport down considerably and animal welfare concerns continuing, it’s time to draw a line in the sand.” [See item.]\nTeam of the Week\nWallabies. Take on Springboks at Ellis Park on Saturday (Sunday 1.10am AEST).\nJen Pawol. First woman umpire to work a regular-season game in Major League Baseball.\nAustralia and South Africa. Taking part in meaningless white-ball cricket in Darwin, Cairns and Mackay.\nArchie Wilson. Footage of the Australian teenager who moved to America to be a punter for the Nebraska Cornhuskers went viral after his tearful press conference.\nChris, Max, Hugo, Archie and Genevieve Benness. Five members of the one family were all spotted playing for the King’s Old Boys’ Club, on JS White Oval, last Saturday. The last time Chris Benness played there was 53 years ago! Genevieve was playing for the women’s team. Bravo.",
  "word_count": 1755,
  "scraped_at": "2026-02-14T12:20:24.259042"
}