{
  "article_id": "e1e4fe98e3f2",
  "url": "https://keyt.com/news/2024/07/18/aaron-rodgers-and-russell-wilson-are-among-several-nfl-stars-with-something-to-prove-this-season/",
  "title": "Aaron Rodgers and Russell Wilson are among several NFL stars with something to prove this season",
  "date": "20240718T183000Z",
  "domain": "keyt.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Aaron Rodgers and Russell Wilson are among several NFL stars with something to prove this season\nAP Pro Football Writer\nNEW YORK (AP) — Aaron Rodgers knows all eyes are on him. That’s nothing new for the four-time NFL MVP.\nBut the 40-year-old New York Jets quarterback enters this season, his 20th in the league, with plenty to prove after missing all but four snaps last year because of a torn Achilles tendon.\n“I think if I don’t do what I know I’m capable of doing, we’re all probably going to be out of here,” Rodgers said of the lofty expectations on him and the Jets, who are trying to end the NFL’s longest active playoff drought at 13 seasons.\n“I like that kind of pressure, though,” he said. “It’s a tough market to play in, it’s not for everybody. I relish that opportunity, but that’s the way the NFL is.”\nHe certainly isn’t alone in the spotlight as training camps open.\nPittsburgh’s Russell Wilson, San Francisco’s Christian McCaffrey, Cleveland’s Deshaun Watson, Jacksonville’s Trevor Lawrence and Philadelphia’s Saquon Barkley are among a handful of NFL stars with something to prove because of injuries, mediocre play or needing to justify big contracts.\nAaron Rodgers, QB, Jets\nRodgers’ much-hyped arrival in the Big Apple quickly went sour when he was injured in the season opener and New York couldn’t recover. He was in the headlines again this offseason when he was mentioned as a potential running mate for Robert Kennedy Jr. and when he skipped mandatory minicamp to go on a previously planned trip to Egypt. But he’ll get another chance to turn around the franchise’s fortunes — and perhaps save the jobs of coach Robert Saleh and general manager Joe Douglas in the process.\nRussell Wilson, QB, Steelers\nWilson went from being a touchdown-tossing machine during his 10 seasons in Seattle, where he helped the Seahawks win a Super Bowl, to an underwhelming two-year stint in Denver. The 35-year-old QB was released by the Broncos in March after looking like a shell of his playmaking self, signed with the Steelers for the veteran minimum of $1.2 million and will have to beat out Justin Fields for the starting gig.\nChristian McCaffrey, RB, 49ers\nAll McCaffrey has done in his first seven NFL seasons is prove himself, overcoming a few injuries along the way to establish himself as perhaps the league’s most dynamic player. But last season’s AP NFL Offensive Player of the Year reset the market for running backs this offseason by signing a record-setting contract extension worth $38 million over two years and will be featured on the cover of EA Sports Madden NFL 25. The 28-year-old McCaffrey will have to keep playing at that video game-like level as the 49ers seek a Super Bowl return.\nDeshaun Watson, QB, Browns\nAfter being acquired from Houston and getting a five-year, fully guaranteed $230 million deal from Cleveland in 2022, Watson has made just 12 starts. He was suspended by the NFL for 11 games in 2022 for violating the personal conduct policy after being accused of sexual assault and harassment by two dozen women. He missed 11 games last season after breaking a bone in his right shoulder. Joe Flacco became a fan favorite while leading Cleveland to the playoffs and Watson will be expected to do at least that this season.\nTrevor Lawrence, QB, Jaguars\nThe 2021 No. 1 overall pick got a five-year, $275 million contract extension last month that includes $142 million guaranteed and a $37.5 million signing bonus — making him one of the highest-paid quarterbacks in NFL history. While Lawrence insisted his new deal doesn’t add pressure, he’ll need to continue to make significant progress on the field while trying to lead the Jaguars back into the playoffs after narrowly missing out last season.\nSaquon Barkley, RB, Eagles\nA two-year contract dispute ended with Barkley leaving the Giants and heading to the NFC East-rival Eagles on a three-year, $37.75 million deal. The dynamic playmaker can dominate when healthy, but that has been an issue in recent seasons. Barkley will get a chance to prove he’s still a top running back in the Eagles’ Jalen Hurts-led offense. And he’ll get to face the Giants twice a season.\nDaniel Jones, QB, Giants\nSpeaking of the Giants, the quarterback they hoped would be the face of their franchise heads into the season with lots of uncertainty. Jones has shown flashes of what made him the No. 6 overall pick in 2019, prompting New York to give him a four-year, $160 million contract extension in the 2023 offseason. But a neck injury and a torn ACL limited him to six games. GM Joe Schoen said on a recent episode of HBO’s “Hard Knocks” that “this is the year” for Jones to show whether he’s the Giants’ long-term solution.\nTee Higgins, WR, Bengals\nAfter failing to reach an agreement on a contract extension, Higgins is set to play this season on the $21.8 million franchise tag he signed last month. He’ll now try to set the market for himself for next offseason in free agency. But he’ll have to bounce back from an injury-plagued 2023, when he had 42 catches for 656 yards and five TDs in 12 games — all career lows.\nChase Young, DE, Saints\nThe 2020 AP Defensive Rookie of the Year while with Washington hasn’t developed into a consisting game-altering player, with injuries playing a large part. The Saints are his third team in his five NFL seasons, including a nine-game stint last season with the 49ers after a midseason deal. Young, who had offseason neck surgery, will be counted on to boost New Orleans’ pass rush after signing a one-year deal.\nTua Tagovailoa, QB, Dolphins\nTagovailoa could play this season on the final year of his rookie deal after the QB said last month he was “antsy” about getting a new contract done. He led the NFL with 4,624 yards passing last season, bouncing back from two concussions that cut short his 2022 campaign. But he might need another prove-it season with a return to the postseason before he cashes in next offseason — with Miami or elsewhere.\n___\nAP NFL: https://apnews.com/hub/nfl",
  "word_count": 1036,
  "scraped_at": "2026-02-14T13:31:03.630859"
}