{
  "article_id": "e1ef9389eac6",
  "url": "https://www.sun-sentinel.com/2024/09/16/door-knocking-tv-ads-websites-the-abortion-battle-heats-up-in-florida-and-its-getting-ugly/",
  "title": "Battle over abortion amendment heats up in Florida . It getting ugly",
  "date": "20240916T113000Z",
  "domain": "sun-sentinel.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "When Lucy Rodriguez knocks on a front door in West Palm Beach, she connects with the Hispanic resident about Florida’s proposed abortion protections in a way they can relate.\n“I’m from the Dominican Republic and I fled for freedom,” she says. “I don’t want my freedoms taken away from me by the government.”\nThe Dominican Republic is not the only Latin American country where abortion is a crime or where oppressive governments have triggered residents to flee to South Florida, and that’s what Rodriguez hopes to tap into as she rallies support for Florida’s abortion rights amendment.\nCampaigns for and against an amendment enshrining abortion rights in Florida’s constitution are heating up, with election day less than two months away. Organizations are holding news conferences, volunteers are going door-to-door, church leaders are denouncing the amendment from their pulpits, groups are slamming the airwaves with advertisements, and phone banks are reaching out to voters.\nThe intensity of the battle reflects what’s at stake in Florida, where a six-week abortion ban went into effect May 1. In November, Florida voters will either vote yes on Amendment 4 to allow abortion up to the time of viability through a change to the state constitution or no to keep Florida’s six-week abortion ban passed by the state Legislature and signed into law by Gov. Ron DeSantis. Abortion protections have become one of the most hotly contested and controversial issues in this year’s elections, with several states, including Florida, voting on similar constitutional amendments.\nNationwide, every ballot measure for abortion rights since the fall of Roe v. Wade in 2022 has been approved by voters, including in red states like Ohio. The challenge with Amendment 4 in Florida is that it needs a supermajority of votes to pass — 60%.\nGroups on both sides are campaigning aggressively, using various tactics to sway voters.\n“When I talk about Amendment 4, I explain it’s not about abortion,” Rodriguez said. “I am a Christian woman and abortion is a sensitive decision, but it’s my decision. The government doesn’t have to interfere in my decision.”\nRodriguez is a canvassing supervisor with Mi Vecino, a Florida organization that educates, registers, and mobilizes Hispanic voters. Mi Vecino’s efforts now focus on securing Hispanic support for Amendment 4, including targeting 233,000 young and Hispanic voters in Palm Beach County. Devon Murphy-Anderson, co-founder of Mi Vecino, says her organization wants to persuade the people that bigger campaigns overlook.\nAs Rodriguez and her Mi Vecino volunteers canvassed Palm Beach County residents on Sept. 11, groups like Vote Yes on Amendment 4 and Florida Physicians Against Amendment 4 held news conferences to push out information on why voters should or should not approve the amendment. More news conferences and rallies were scheduled around the state last weekend.\nThe ‘extreme’ strategies tap into fear\nGroups for and against Amendment 4 seek to convince voters by using the word “extreme” to describe what’s happening with abortion rights in Florida.\nThe Yes on 4 campaign has launched a multimillion-dollar statewide ad blitz telling voters that Florida’s current six-week abortion ban is “too extreme.” The ads are airing across Florida’s top media markets.\n“Before many women know they’re pregnant, before their first appointment, before a doctor can see anything on an ultrasound, this is when the government in Florida has banned abortion — an extreme ban with no real exceptions, not for her health, not even for rape,” the 30-second advertisement says. “That’s why Florida must vote ‘yes’ on 4 to stop the dangerous ban because the government will never know better than a woman and her doctor.”\nThe campaign emphasized the same argument to the media on Sept. 11: “Our initiative is simple. It’s about ending Florida’s extreme abortion ban,” said Lauren Brenzel, campaign director for Floridians Protecting Freedom/Vote Yes on 4.\nPlanned Parenthood is making the same argument about the “extreme” nature of the abortion ban. It announced a new awareness campaign with two billboards along Miami’s Golden Glades interchange and street panels in downtown Miami, submitting that the near-total abortion ban puts medical decisions in the hands of politicians instead of patients.\nOn Wednesday, Physicians for Human Rights will hold a media call with Yes On 4 campaign leaders to highlight a new report finding that Florida’s six-week ban is “endangering patients’ health and survival and impairing clinicians’ ability to comply with their ethical obligations and medical standards of care.”\nThe Vote No on 4 campaign is aggressively fighting to defeat the amendment, bringing out medical professions, too. The organization is targeting the vague language and spending millions on ads to tell voters that Amendment 4 is not what it seems and is “way too extreme.”\nThe wording of Florida’s ballot initiative, Amendment 4, would protect abortion until fetal viability or “when necessary to protect the patient’s health, as determined by the patient’s health care provider.” The wording does not define fetal viability, but it is usually considered to be about 24 weeks into a pregnancy.\nThe Vote No ads, which have been airing during football games and morning shows, say, “Amendment 4 goes TOO FAR … It pretends to just bring things back to how they were with Roe v. Wade — but it actually goes much further — creating a constitutional right to abortion throughout all nine months with no protections for the unborn baby.”\nThat’s the same message echoed by a group of pro-life doctors called Florida Physicians Against Amendment 4, who held a news conference on Sept. 11.\n“Amendment 4 fails to define critical terms such as ‘viability,’ ‘healthcare provider,’ and ‘women’s health,’ and will only lead to unregulated, risky abortions, putting the lives of women, my patients, at risk. That’s why I urge you to vote NO on Amendment 4,” said Dr. Angeli Akey, an internist practicing in Gainesville.\nAkey acknowledged that improvements may be needed to the current six-week ban. “The right way to fix that is to go back through the legislative process, not by trying to do something this radical to our state’s founding documents,” she said.\nMurphy-Anderson of Mi Vecino said that’s precisely why her organization is canvassing voters to approve the amendment. In January, state Rep. David Borrero, R-Sweetwater, proposed a full abortion ban. The bill died before going to a vote. “That was a real bill that was sponsored by real legislators in this state who are elected by real Floridians,” she said. “If we put this in the hands of the legislators, they have shown us what they’re going to do with that.”\nTrust the politicians?\nWhen the U.S. Supreme Court overturned Roe v. Wade in June 2022, individual states gained the right to determine their abortion laws. In Florida, the Legislature approved a 15-week ban and a year later restricted the law further to ban abortion after six weeks.\nNow, politicians at all levels of state and local government are engaged in the battle over Amendment 4.\nThe governor publicly has opposed Amendment 4, and on Sept. 9 demanded that elected Florida Republicans join him.\nEarlier this month, DeSantis tried to cast doubt on whether the amendment should even be on the ballot by sending the state’s election police to question some signatures on the official petition. Then, in a move that was met with outrage from Amendment 4 supporters, DeSantis’ administration created a website that features a banner headline stating “Florida is protecting life” while telling visitors that “Amendment 4 is dangerous to women.” And Florida’s Agency for Health Care Administration posted a 30-second video on social media that casts the state’s six-week ban as proof that “Florida cares about women and families.” The post links to an agency website that claims that the abortion rights measure, known as Amendment 4, “threatens women’s safety.” It adds: “Don’t let the fear-mongers lie to you.” This week, the state health care agency began airing its social-media video as a commercial on Florida television.\nOn Sept. 11, Jason Weida, DeSantis’ secretary of the Florida Agency for Health Care Administration, spoke at a news conference and touted the website: “My major message to you is when you are thinking about these issues, just make sure that you are looking at what the law says We have created a transparency website. This provides facts people rely on when thinking about these important issues.”\nFloridians Protecting Freedom, which is campaigning for the amendment, is fighting back. The American Civil Liberties Union of Florida filed a lawsuit on its behalf in state court contending that the state agency is spending taxpayer dollars for its website to spread false and misleading statements about Amendment 4.\nMeanwhile, local government officials are getting into the debate, too. The Sarasota County Commission voted 4-1 on Tuesday to pass a resolution opposing the constitutional Amendment 4 measure on November’s ballot. The resolution said the commission believes “that the passage of Amendment 4 would be detrimental to the health, safety, and welfare of the citizens of Sarasota County and the State of Florida.”\nIn Miami-Dade, local politicians participated in a Rally for Reproductive Rights on Sept. 14. Miami-Dade County Mayor Daniella Levine Cava and Miami-Dade Commissioners Danielle Cohen Higgins and Eileen Higgins attended to support Amendment 4.\nIs the battle about religion?\nCatholic organizations are putting hundreds of thousands of dollars into defeating Florida’s ballot initiative to protect abortion rights. The Florida Conference of Catholic Bishops has funded the No on 4 campaign and used its website to share anti-abortion resources with parishes. And around the state, churches are holding events such as Vote No on 4 Day of Prayer and posting Vote No on 4 videos on their websites.\n“The church’s involvement reflects longstanding beliefs about abortion and its concern that Florida’s proposed amendment is too extreme and imposes too few restrictions on the procedure,” Kathleen Bagg, a spokeswoman for the Diocese of St. Augustine, told the Orlando Sentinel in July.\nBut not all Catholics agree with the Catholic Bishops’ position.\nCatholics for Choice is raising alarm bells over how much Florida Catholic bishops are spending to defeat Amendment 4, asserting that money could be better spent providing care to immigrants or addressing homelessness.\nCatholics for Choice has launched its own Florida campaign, holding house parties and reaching out to influencers to reach the “moveable middle.” Their message: Religious leaders should not have a say in personal health decisions.\n“We believe in religious freedom and letting women use their own consciences to make their own choices regarding their reproductive health,” said Florida Field Organizer Nicole Benton.\nIs it a gender issue?\nMale support is crucial when 60% of voters are needed to pass Amendment 4.\nAcross Florida, men are mobilizing and strategizing.\nGroups like Black Men for Reproductive Choice, Men4Choice and Mi Vecino are targeting male support for Amendment 4.\n“When we talk to men, they are more persuadable on this issue,” said Alejandro “Alex” Berrios, co-founder of Mi Vecino. “It’s not something that directly happens to us as men, but it happens to our families. It happens around us. We’re open to different arguments and open to supporting this issue.”\nBerrios says he personally goes out into neighborhoods in Florida, educates registered male voters on the existing abortion ban, and explains the amendment. Then, he encourages them to reject “government interference” in health decisions. Mi Vecino will follow up with information on voting by mail, early-voting locations and voting reminders. Berrios says residents who he interacts with are not voters who would be swayed by TV commercials.\n“When we’re looking at creating the path to 60%, we know those strategies don’t work for these voters,” he said. “What does work is when we go knock on their door and we have conversations, and that’s how we get them to the polls.”\nIn Miami-Dade County, Aaron Bos-Lun, deputy executive director of Men4Choice, is mobilizing men who were once passively pro-choice. Bos-Lun said Men4Choice staff and volunteers in Central and South Florida participate in phone outreach, canvass in communities and hold education workshops to convince men to vote yes on 4. “We are working to get them off the sidelines and into the fight.”\nWith eight weeks until the election, Men4Choice is stepping up outreach. It has launched billboards and mobile billboard trucks in Miami, Tampa and Orlando as well as digital ads on social media and YouTube featuring men in everyday settings where harm caused by abortion bans became part of the conversation.\n“It’s a call to action to get men to think differently,” Bos-Lon said. “New funding just came in so we are able to expand our efforts.”\nThe key to success, he said, is direct contact with male voters at the highest volume possible. “We need to get ahead of misinformation and address the general lack of knowledge about the amendment,” Bos-Lon said.\nAnd, like other groups, his, too, will use “extreme” to land its message.\n“Our job is to show how extreme this abortion ban in Florida is and tell voters they have the opportunity to restore abortion rights to the place it was before.”\nSouth Florida Sun Sentinel health reporter Cindy Goodman can be reached at cgoodman@sunsentinel.com.\nThe full text of proposed constitutional Amendment 4\nBallot Title: Amendment to Limit Government Interference with Abortion\nBallot Summary: No law shall prohibit, penalize, delay, or restrict abortion before viability or when necessary to protect the patient’s health, as determined by the patient’s healthcare provider. This amendment does not change the Legislature’s constitutional authority to require notification to a parent or guardian before a minor has an abortion..",
  "word_count": 2255,
  "scraped_at": "2026-02-14T14:14:50.678222"
}