{
  "article_id": "e22252979eb7",
  "url": "https://nypost.com/2023/08/24/us-open-should-make-schedule-change-to-tournament/",
  "title": "US Open should make schedule change to tournament",
  "date": "20230825T030000Z",
  "domain": "nypost.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "The disappointing aspect of it all is that this is such an easy fix. This isn’t like the (one of many) amazing scenes from “Veep.”\nJulia Louis-Dreyfus as Selina Meyer: “You said that everything was movable. And that’s not movable. That’s IM-movable.”\nHer dopey assistant: “Surely, nothing is immovable.”\nLouis-Dreyfus (turning to her chief of staff): “Amy, this is like explaining gravity to a chicken.”\nThe U.S. Open begins next week, and every year we’re struck with the same scheduling problem that accompanies it — the men’s championship match is played on the final day of the tournament, the second Sunday. And that day happens to be the same day as the first NFL Sunday of the season, Week 1 of the schedule.\nSo, if you’re a football fan and a tennis fan, and you have interest in watching both a highly anticipated Week 1 NFL clash and also the biggest men’s tennis match of the tournament, you cannot do that.\nThis really shouldn’t be this way. The U.S. Open is a wonderful event to follow, and the championship is (obviously) its pinnacle. The NFL is a spectacular league to follow, and Week 1 is (literally) its kickoff. To have to choose one and skip the other is a killer.\nIt’s a very unfortunate scheduling quirk — but it’s also very solvable.\nNow, as far as I’m aware, the two most prominent suggestions on this have been:\n- Play both the women’s championship and the men’s championship on Saturday — one in the afternoon, one at night\n- Move the men’s championship to Monday afternoon or evening (which I guess leaves the preceding Sunday dark? Not sure).\nFrankly, if need be, both of those are fine. But I think I have a better proposal that I haven’t seen anywhere:\nThe tournament shouldn’t start on a Monday and end on a Sunday. Rather, start the tournament and end the tournament one day earlier — so you start the 14-day event on a Sunday and end on a Saturday.\nThis accomplishes several objectives:\n— The Open gets three weekends out of the 14-day run instead of two. True, it’d be the same number of weekend days (you’d add a Sunday at the start and lose a Sunday at the end), but the advantage of a three-weekend schedule is you’d offer the opportunity for a wider audience to attend since now you’re providing fans three different weekends from which to choose.\n— You don’t lose any of your audience due to the NFL. In fact, you’d probably gain substantially because you’re now starting on a Sunday in late August. Sports-wise, what’s happening on a Sunday in late August anyway?\n— There’s been a theory that moving up the tournament by a full week would also accomplish the “avoid the NFL” goal, but the counter to that has been it’s hot in August, and you’d now be moving the whole tournament basically into late August. So forget that one. Instead, just move things up by a day, which is negligible.\nAre there hurdles to this? Somewhat, but nothing that represents a deal-breaker. Since we’re moving everything up a day, then the women’s championship would presumably move from Saturday to Friday, probably with a late-afternoon start due to international TV responsibilities. (Though again, you could indeed create the Super Saturday and have either the men’s championship at noon and the women’s championship at 7 p,m, or vice versa.)\nThe tours would also have to do some rearranging with player scheduling for a Sunday start as opposed to a Monday one. Again, though, we’re not talking about major restructuring — it’s just a 24-hour push ahead.\nThere’s momentum right now for men’s tennis after the sensational Wimbledon’s final between Carlos Alcaraz and Novak Djokovic — per ESPN, it was the highest-rated Wimbledon match in four years. Let’s not force people to choose between a potential rematch at the Open and the NFL.\nNo need for that. Bump the U.S. Open’s start ahead by 24 hours. It’s an easy fix. No need to explain gravity to a chicken.\nMark Hale is The Post’s Deputy Sports Editor.",
  "word_count": 689,
  "scraped_at": "2026-02-14T12:39:59.210403"
}