{
  "article_id": "e2299f3c67d8",
  "url": "https://www.cnbcafrica.com/2023/morocco-finally-succeed-in-sixth-attempt-to-host-the-world-cup/",
  "title": "Morocco finally succeed in sixth attempt to host the World Cup",
  "date": "20231005T111500Z",
  "domain": "cnbcafrica.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Rabat, Oct 4 (Reuters) – After five failed attempts to become World Cup hosts, Wednesday’s announcement that Morocco will share the honours with Spain and Portugal in 2030 will lift spirits in the north African country a month after the devastating earthquake that killed nearly 3,000 people.\nThe World Cup may also provide a boost to the Moroccan economy, which was already under increasing pressure due to a severe drought and high inflation rates, according to a World Bank report.\nFIFA, in a surprise announcement a year earlier than planned, said Morocco, Portugal and Spain — the sole bid put forward — would host the 2030 tournament but added that Uruguay, Argentina and Paraguay would each host a match to mark the tournament’s centenary.\nObservers said the ease of travel between Morocco and the two Iberian countries was important in the bid.\n“The geographic proximity between them contributed to the decision to organise jointly, and in the recent period joint organisation has become commonplace and this indicates that football brings us together more than it divides us,” said Muhammad Suhail, an analyst at BeIN Sports.\nMorocco lost bids to be sole hosts in 1994, 1998 and 2006. FIFA’s decision to limit the bids to Africa for the 2010 finals raised Moroccan hopes but in the end South Africa became the first country on the continent to host the World Cup.\nMorocco tried again for 2026 but the tournament was awarded to a joint bid by the United States, Canada and Mexico.\nJoining forces with Spain and Portugal will have increased their chances of hosting the tournament, in addition to the support of Saudi Arabia who decided to focus on a 2034 bid instead of 2030.\nMorocco also successfully hosted the Women’s Africa Cup of Nations last year, with its team reaching the final where they lost 2-1 to South Africa.\nLast year’s performance by Morocco’s men in the Qatar World Cup, when they became the first African side to reach the semi-finals, will have done them no harm either.\nOn their way to fourth place, Morocco defeated Spain on penalties in the last 16, then beat Portugal 1-0 in the quarter-finals.\n“There is a football competition between the three teams, and instead of the struggle to qualify from the group stage, there will be a collective effort to make the tournament a success; from competition to love and cooperation,” Suhail said.\n(Additional reporting Mohamed Msiyeh in Rabat, editing by Clare Fallon)",
  "word_count": 411,
  "scraped_at": "2026-02-14T12:07:08.431067"
}