{
  "article_id": "e232567a5b25",
  "url": "https://www.rri.ro/en/news-and-current-affairs/today-in-the-news/march-5-2025-id868293.html",
  "title": "March 5 , 2025 - Radio Romania International",
  "date": "20250305T141500Z",
  "domain": "rri.ro",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "March 5, 2025\nA roundup of local and world news\nNewsroom, 05.03.2025, 13:55\nPROPOSAL – Romania’s Prime Minister Marcel Ciolacu has hailed the proposals announced by the European Commission president, Ursula von der Leyen, regarding the exemption of defense spending from the EU limitations on government borrowing. Marcel Ciolacu claims that Romania has constantly advocated for this solution. Von der Leyen proposed the creation of a new fund, which could mobilize almost €800 billion for defense investments at EU level, as well as for military aid for Ukraine.\nINVESTIGATION – The Florida Attorney General’s Office is officially investigating the British-American influencer Andrew Tate and his brother Tristan, after the two arrived in Florida last week, dpa reports. The Tate brothers are also being investigated in Romania for human trafficking and exploitation of young women. They were arrested in Romania in December 2022 and were initially subject to a ban on leaving the country. However, Romanian authorities eventually allowed them to leave, and the two went to Florida. According to the German news agency, their release is rumored to have been brokered by the Trump administration, but the White House leader has denied any involvement. Andrew Tate, a former kickboxer, has become a symbol of online misogyny in recent years, along with his brother Tristan. Romanian prosecutors accuse the two of coercing women to produce commercial videos with sexually explicit content. Investigations have revealed at least 34 alleged victims, including a 15-year-old girl. Both brothers deny any wrongdoing.\nPROTEST – Union members at the Damen Shipyard in Mangalia (southeast), an insolvent company, will protest on Friday in front of the Dutch embassy and the headquarters of the judicial administrator in Bucharest. The announcement was made by the local trade union, which stated that the action seeks to draw attention to the major crisis facing the shipyard, so that the conflict between the company’s shareholders is settled. The Romanian state owns the majority 51% package of the shipyard in Mangalia. The shipyard went insolvent in June 2024, and its activity has been suspended for over nine months, with most employees being put on furlough.\nAPPEAL – The appeal filed by the former presidential candidate, pro-Russian extremist Călin Georgescu, against the prosecutors’ decision to place him under judicial control as part of an investigation where he faces six separate charges, including incitement to actions against the constitutional order, was heard today in Bucharest. The Prosecutor General’s office last Wednesday placed Georgescu under judicial control for 60 days, during which time several interdictions apply.\nTRAVEL FAIR – Romania’s tourist offers are promoted over March 4-6 at ITB Berlin, the world’s largest travel trade fair. Germany, Romania’s number one trade partner, is also the largest market for Romanian tourism, Economy Minister Bogdan Ivan says. Last year, Romania reported a 10% increase in the number of German tourists, totaling some 240 thousand. At ITB Berlin, Romania is promoted by means of cultural circuits, active and adventure tourism, holidays on the Black Sea coast and in the Danube Delta, rural tourism and city breaks. One of the top attractions this year is also the “George Enescu” International Festival. The 27th edition will be held over August 24 – September 21 in Bucharest, bringing together 4,000 musicians, reputed orchestras, conductors and soloists which are bound to turn Bucharest into the capital of classical music.\nFOOTBALL – Romania’s football champions, FCSB, on Thursday will take on Olympique Lyon of France at home in the round of 16 of Europa League. The return leg is scheduled for March 13 in France. The Bucharest club advanced to the round of 16 of Europa League after a two-leg win over PAOK Thessaloniki of Greece coached by Romanian Răzvan Lucescu. (VP)",
  "word_count": 618,
  "scraped_at": "2026-02-14T12:49:33.445940"
}