{
  "article_id": "e236e93e7a02",
  "url": "https://www.winnipegfreepress.com/opinion/columnists/2023/03/24/time-for-canada-to-write-a-new-chapter",
  "title": "Time for Canada to write a new chapter – Winnipeg Free Press",
  "date": "20230325T024500Z",
  "domain": "winnipegfreepress.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Time for Canada to write a new chapter\nMen’s soccer team must approach upcoming matches with renewed vigour\nAdvertisement\nTo continue reading, please subscribe:\nMonthly Digital Subscription\n$1 per week for 24 weeks*\n- Enjoy unlimited reading on winnipegfreepress.com\n- Read the E-Edition, our digital replica newspaper\n- Access News Break, our award-winning app\n- Play interactive puzzles\n*Billed as $4.00 plus GST every four weeks. After 24 weeks, price increases to the regular rate of $19.95 plus GST every four weeks. Offer available to new and qualified returning subscribers only. Cancel any time.\nMonthly Digital Subscription\n$4.99/week*\n- Enjoy unlimited reading on winnipegfreepress.com\n- Read the E-Edition, our digital replica newspaper\n- Access News Break, our award-winning app\n- Play interactive puzzles\n*Billed as $19.95 plus GST every four weeks. Cancel any time.\nTo continue reading, please subscribe:\nAdd Free Press access to your Brandon Sun subscription for only an additional\n$1 for the first 4 weeks*\n*Your next subscription payment will increase by $1.00 and you will be charged $16.99 plus GST for four weeks. After four weeks, your payment will increase to $23.99 plus GST every four weeks.\nThink back to a year ago.\nRead unlimited articles for free today:\nor\nAlready have an account? Log in here »\nHey there, time traveller!\nThis article was published 24/03/2023 (1058 days ago), so information in it may no longer be current.\nThink back to a year ago.\nLast March, on a chilly afternoon at Toronto’s BMO Field, Canada’s men’s national soccer team beat Jamaica 4-0 and secured qualification to a first World Cup since 1986.\nNearly 30,000 bundled-up fans celebrated with players, retired internationals and pretty much anyone within hugging distance. Across the country, more than 1.65 million viewers cheered from considerably cozier environs as Jonathan Osorio banged a drum in front of the south end supporters’ section.\nIn retrospect, that victory — which also clinched top spot in CONCACAF qualifying — might have marked the high point to date for manager John Herdman’s squad, at least as performance is concerned. Yes, Canada showed well versus Belgium in Al Rayyan, despite losing, and then there was that blistering start in which Alphonso Davies scored this country’s first World Cup goal and established a 1-0 lead on Croatia in the process.\nWe know how that ended — as well as the amateurish off-field conduct that was, at best, embarrassing and, at worst, an assist in the Blazers’ 4-1 triumph. All told, the brief spell in Qatar revealed those gaps in coaching and professionalism that tend to separate serious teams from the ones just happy to be there.\nAnd that’s fine. It might’ve even been inevitable. Which is why what happens next is so important.\nSaturday night, on the northern edge of Willemstad, the Canadian men will visit Curaçao in their first outing since losing 2-1 to Morocco in Doha (8 p.m., OneSoccer & FuboTV).\nWhat will be their reaction?\nWill key players carry over their club season form? Will new ones get meaningful chances? What changes, if any, has Herdman prepared that can demonstrate an ability to take this group to the next level?\nThe current international break, in which Canada will also face Honduras (Tuesday, 7 p.m., OneSoccer/FuboTV), should provide at least preliminary answers to those questions. With a berth in June’s CONCACAF Nations League Finals at stake, each match is meaningful. And with the exceptions of Kamal Miller and Junior Hoilett, both injured, Herdman will have full-strength line-ups at his disposal.\nIn fact, one could argue the team that reported for training in Fort Lauderdale is in better nick, man for man, than the one that prepared for Belgium in November.\nCyle Larin, for starters, is back amongst the goals with Real Valladolid after being frozen out at Club Brugge, and fellow striker Jonathan David is joint-top scorer in Ligue 1 alongside Kylian Mbappé.\nMidfielders Stephen Eustáquio and Jonathan Osorio, don’t forget, weren’t anywhere near 100 per cent fit at the World Cup, but Eustáquio has since established himself as a leading contributor at Porto while Osorio has hit the ground running to begin the season with Toronto FC.\nDavies, who’d arrived in Qatar amidst recovery from a hamstring strain, has successfully fought off João Cancelo’s challenge for his position at Bayern Munich, and he also scored against Augsburg earlier this month. The 22-year-old is playing some of the best football of his career right now.\nThen there’s right-back Alistair Johnston, who transferred to Celtic in January, and goalkeeper Milan Borjan, whose Red Star Belgrade side remains unbeaten in the Serbian SuperLiga. The list goes on.\nThis is all to say that the best Canadian footballers, enjoying some of their best campaigns, have reported for duty, which means — or should mean — that nothing short of two wins and first place in Nations League Group C is acceptable. That’s the starting point. Anything less, and the set of questions alters dramatically.\nIn the short term, Canada should be targeting the Nations League title and a first trophy since 2000. Given Mexico’s downcycle and chaos in the American camp, they’ll surely see the opportunity in front of them. First they must dispatch Curaçao and Honduras.\nInterestingly, the men’s national team has never played in Willemstad, and what they’ll find, in addition to a pleasantly warm, slightly humid evening, is a competitive XI that includes Columbus Crew goalkeeper Eloy Room, NAC Breda defender Cuco Martina, Watford midfielder Leandro Bacuna and former Ajax striker and Netherlands youth international Richairo Živković.\nThe island outfit beat Honduras in San Pedro Sula last June, and with former Herdman assistant Remko Bicentini at the helm they’ll be well prepared for tonight’s opponents.\nThe Honduras match — Canada’s first at BMO since that memorable day almost exactly 12 months ago — looks likely to be a 90-minute showdown for Nations League Group C and progression to the competition’s final round.\nLos Catrachos hardly need an introduction. They beat Canada 2-1 in the reverse fixture and have won four of eight under current boss Diego Vasquez. They’ve inflicted considerable pain on this country before and will look to do so once again on Tuesday. It’ll be a useful test of what Herdman & Co. have learned since Osorio was banging that drum.\nSomehow, those triumphant scenes of last March, those optimistic aspirations ahead of the World Cup, seem rather distant, perhaps even innocent. With everything that’s transpired in Canadian soccer since — the cancelled Iran friendly, the Vancouver protest, the treatment of the women’s team, the behaviour and resignation of the association president, the revelations of Canadian Soccer Business, the parliamentary hearings — it’s impossible to not feel at least somewhat disappointed, discouraged, cynical.\nTo say nothing of the concern with the on-field record. Since sealing qualification, the men’s national team has won three matches of ten.\nSo, think back to a year ago. And hope that it wasn’t as good as it gets.\njerradpeters@gmail.com\nTwitter @JerradPeters\nOur newsroom depends on a growing audience of readers to power our journalism. If you are not a paid reader, please consider becoming a subscriber.\nOur newsroom depends on its audience of readers to power our journalism. Thank you for your support.",
  "word_count": 1204,
  "scraped_at": "2026-02-14T12:26:23.990942"
}