{
  "article_id": "e24279f4a310",
  "url": "https://www.newyorker.com/culture/critics-notebook/trump-is-the-emperor-of-ai-slop",
  "title": "Trump Is the Emperor of A . I . Slop",
  "date": "20250426T120000Z",
  "domain": "newyorker.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "On February 19th, Donald Trump logged onto Truth Social to congratulate himself on vanquishing congestion pricing in his home state. “CONGESTION PRICING IS DEAD,” he posted. “Manhattan, and all of New York, is SAVED. LONG LIVE THE KING!” The message was amplified by the White House’s official X account, which tweeted it with an A.I.-generated image of Trump, golden-haired and golden-crowned, blotting out the New York City skyline.\nThe illustration, which was styled to look like the cover of Time magazine, displayed the President’s fondness for crude symbols of power and wealth. He is the lord of literalism, and this literalism defines much of what he’s done to amuse himself since retaking the White House. (See, for instance, his recent appearance at a mixed-martial-arts event in Miami with Elon Musk and other functionaries. They entered the stadium to Kid Rock’s “American Bad Ass.”) Trump has proposed a military parade with Humvees and helicopters on his birthday, and according to CNN he has been hard at work renovating the Oval Office for his second term, swapping out the wooden consoles for marble-topped decorative tables, hanging “gilded Rococo mirrors” on the doors, ensconcing golden cherubim in the pediments, and wrapping the television remote in shiny paper. (His “gold guy” had to be flown in from Florida.) He has installed a portrait of George Washington brandishing a sword across from an oil painting of a grinning Ronald Reagan, and both former Presidents may soon be able to look out at the former Rose Garden, which Trump plans to pave over. Nearby sits a bullion-like paperweight engraved with TRUMP, in all caps; at this rate of converting subtext into text, the President will soon use his TRUMP paperweight to bash in the head of a bald eagle.\nDuring Trump’s first term, the painter who seemed most tuned in to his aesthetic was Jon McNaughton, whom the art historian Jennifer A. Greenhill calls MAGA’s “court artist.” McNaughton’s depictions of the President—fantastical scenes rendered in a flat, hyperrealist style—regularly went viral on pre-Musk Twitter. Often, Trump is shown in the company of other POTUSes, who beam at him approvingly. He might be slinging a machine gun, playing football, cradling a flag, or composing a masterpiece upon his own easel. In “Crossing the Swamp,” from 2018, Trump, posed as George Washington, holds a lantern aloft as Nikki Haley, Ben Carson, and other first-term Cabinet members row over a brackish Delaware. There’s a kitschy, romantic, hero-worshipping nostalgia to the image, as if Norman Rockwell had undergone a lobotomy.\nIn The Atlantic, in 2019, Greenhill compared McNaughton’s portraits to “painted memes” and wrote that they are “shaped for digital consumption.” But advances in A.I. have allowed supporters to flood social media with even more partisan and on-the-nose images for Trump’s second Presidency. These include migraine-inducingly representational scenes of Trump riding a lion and shredding on an electric guitar. Like the old memes, the new memes allow no room for interpretive freedom. Trump is strong, so he is a bodybuilder. He is our savior, so he wears a white robe.\nNot surprisingly, Trump has taken to machine-authored propaganda. During his reëlection campaign, his Truth Social account collaged a series of fake photographs of Taylor Swift and her fans implying that Swift backed him for President. “I accept!” he wrote. The A.I. scenery surrounding the Trump Administration reflects Trump’s ideal world, as when he reposted a clip, created via Arcana Labs, of a Gaza emptied of actual Gazans and glowing with gilded effigies of himself. The illustrations seem to have obviated the need for a court painter: now Trump has dozens if not hundreds of people to conjure flattering representations of him on social media. He can even, if he wishes, cut out the middlemen and call up the images himself. It makes sense that a man who yearns for a reality untroubled by other humans would be drawn to art that is untouched by anything human. As Musk breeds a “legion” of children who can populate Mars one day, Trump seems to be finding his way back to asexual reproduction, clearing the field of every ego but his own.\nIf you squint, Trump has been imposing a bot-brained vision on America for years. At one of his inaugural balls in 2017, he displayed a cake that looked like a Seussian top hat, with nine tiers piled into a whimsical tower of pale blues and navies, the fondant set off by red stripes, silver stars, swagged banners, and a Presidential seal. The cake copied a design that Duff Goldman, a pastry chef and Food Network personality, had created for Barack Obama’s Inauguration in 2013. But there was one essential difference. Trump’s cake, which he cut into with a military sword, was mostly Styrofoam, with a three-inch wedge of edible crumb for the photo op.\nThe cake was a kind of koan, a dizzyingly empty concoction, like a stage prop after the show has left town. Its substance didn’t matter—try to eat it and you’d get a mouth full of Styrofoam—but on the other hand its surface didn’t matter, either. It was just a ripoff of Obama’s cake. A sham dessert is a perfect symbol for Trump’s Presidency, and this one underscored that the hollowness of his aesthetic is twinned to the nihilism of his politics. Because there is no content, everything is style, and the materials of that style are whatever happens to be lying around (even if those materials once belonged to someone you hate).\nIn this way, Trump and A.I.-generated imagery are well matched. Like a large language model, Trump takes in preëxisting work and uses it to create his own meaningless content. His taste often seems inconsistent: he-man rock, fast food, trucks, golf, mirrors, Andrew Lloyd Webber, golden bathroom fixtures, chandeliers, marble, Pepe the Frog, rocket boosters, military parades—a slurry of mass-cultural totems, wealth and status markers, and gender tells, much of it sourced from Trump’s eighties heyday and borne along by a maximalist, self-regarding sensibility that explains the President’s political actions better than ideology ever could. The common denominator, if there is one, is obviousness. Each thing serves as the cartoonishly exaggerated marker of an identity: berserker populist patriot, effete rich man, savvy dealmaker.\nTrump, seeking to project his power, can afford to be indiscriminate in his choice of signifiers; we already know what they refer back to. His careless personal style—the too-long ties and ill-fitting suits, the flyaway fake hair—reads as an expression of dominance, a guy passing around a collection plate for admiration that he doesn’t have the time, inclination, or ability to earn. Why should the emperor trouble himself to put on clothes?\nAnd yet there is, in Trump’s brain, an ideal Trump, a dream Trump, handsome, rich, and powerful. This Trump is the essence of luxury, and the buildings bearing his name are the most beautiful things you’ve ever seen. The responsibility for closing the gap between who Trump is and who he longs to be falls to us. We have to transform the casual shoddiness of his self-presentation into a splendid picture; he offers the prompt of a silly hat and we generate a fantasy of his greatness. Trump, after he announced his takeover of the Kennedy Center, tantalized his social-media followers with an A.I. image of himself conducting a symphony before a packed house. At his first board meeting five weeks later, he posed on a balcony in the center’s concert hall, arms outstretched, echoing the meme—digital slop imported into real life.\nSignalling their allegiance to Trump’s aesthetic, men in the G.O.P. have begun to wear oversized red ties, and, as Mother Jones reports, loyalists are undergoing a distinctive kind of plastic surgery to attain “Mar-a-Lago face.” Conservative women are plumping their lips with injectables and chiselling their cheekbones; what happened to Matt Gaetz is anyone’s guess. Meanwhile, R.F.K., Jr., and Joe Rogan are mincing ever closer to the uncanny valley, supplementing Trump’s brand of “reactionary camp” with a roided-up brawn.\nIn this sense, Trump does not just produce slop. He and his cronies force other people to generate slop, too. On February 22nd, Musk demanded that federal employees write e-mails explaining five things that they’d accomplished in the previous week. What could the results be but slop, meaningless to real people who understand how agencies function? According to the Washington Post, many government workers have been submitting the same boilerplate reply, over and over, furnishing a preview of the White House’s plan to replace the federal labor pool with digital assistants. It’s as if DOGE is forcing bureaucrats to conform to the cast of their leaders’ contempt, to become as faceless and pointless as Trump and Musk believe them to be.\nOn March 17th, White House social accounts posted a video of a man in shackles being prepared for deportation as “Closing Time,” by Semisonic, plays in the background. Captioning the screen are the lyrics “You don’t have to go home but you can’t stay here.” “Closing Time” is about endings and beginnings, about the early morning hour when bars are closing and revellers have to disperse, maybe in pairs or maybe alone. But the Administration’s clip stripped the words of their wistful energy and doubleness of meaning and prefigured its intent to impose a single, cruel interpretation on a human being.\nFor the most part, the deportation videos now circulating on social media are not A.I.-generated. They star real people having their heads shaved or getting chained up and loaded onto planes. But digital technology has been used to obscure and usurp the truth about their lives. On Monday, the President shared a photograph of a hand tattooed with what he asserted to be the insignia of a violent gang. Trump claimed that the hand belonged to Kilmar Armando Abrego Garcia, a twenty-nine-year-old who has no documented affiliation with MS-13 and who was wrongfully deported to El Salvador last month in violation of a court order. The image appears to have been doctored, recruited into Trump’s own semiotic sleight of hand—reducing a person to a body part and then stamping that body part with a sign of evil. Trump sees only one thing when he beholds an immigrant: a criminal. His post was a bid to print his vision over everyone else’s.\nThat the tools of digital-reality manipulation are proving useful to this President suggests, of course, that he intends to shape the way Americans see the world. But it also affirms a basic truth about how Trump views human beings: as fundamentally unreal. People exist to gratify his desires. When he’s done with them, they can just be turned off. Long before A.I. became a determining factor in the rest of our lives, Trump was an A.I. emperor, waiting for his lonely, looping, ego-driven fantasia to synch up with reality. The door to his bunker opens. He lifts the sword and cuts the cake. ♦",
  "word_count": 1817,
  "scraped_at": "2026-02-14T13:42:25.060966"
}