{
  "article_id": "e24f69256b53",
  "url": "https://www.politico.eu/newsletter/london-playbook/small-boats-ahoy-corporation-tax-freeze-rejected-tech-bro-fun/",
  "title": "London Playbook : Small boats ahoy Corporation tax freeze rejected Tech bro fun",
  "date": "20230306T104500Z",
  "domain": "politico.eu",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Good Monday morning. This is Rosa Prince — I’ll be your Tuesday writer too.\nDRIVING THE DAY\nSMALL BOATS: PM Rishi Sunak is expected to talk by phone with French President Emmanuel Macron today as he puts the finishing touches to his plan to effectively ban undocumented migrants arriving on these shores via small boats. They are due to speak ahead of a summit on Friday where they will discuss immigration policy. Home Secretary Suella Braverman is tipped to publish legislation likely to be called the Illegal Migration Bill as soon as Tuesday. No. 10 would not confirm timings of the Macron call — or even whether it will go ahead.\nAnother mission impossible: After his well-received Brexit deal, can Sunak next solve the conundrum of how to reduce the spiraling numbers of undocumented arrivals while abiding by the U.K.’s responsibilities under international human rights law? We are told he is not minded to heed calls from some Tory backbenchers to withdraw from the European Convention on Human Rights, but believes he can circumvent it, and that his plan is “legally watertight.” Little detail so far on how this will be achieved.\nWhat we do know: Briefing in the Sundays and into today’s papers suggests the bill will see the swift detention and deportation to Rwanda or a “safe third country” of all those detained on small boats or entering the U.K. via “irregular routes.” The Mail hears those deported will be subject to a lifetime ban, meaning they can never settle legally or gain British citizenship. The Times puts the cost of the scheme at £3 billion. The bill would put a duty on the home secretary to remove migrants as “as soon as reasonably practicable;” at present asylum seekers may stay in the U.K. while awaiting a hearing, with the backlog standing at 160,000.\nThe response: Plenty of outrage from human rights groups. The Refugee Council said the plans would “shatter” Britain’s commitments under the U.N. Refugee Convention, while in the Guardian, Sonya Sceats of Freedom from Torture described the proposals as “vindictive and dysfunctional” and Christina Marriott from the Red Cross called them “extremely concerning.” Labour’s Yvette Cooper produced a dossier the party said showed the plans were a rehash of the failed Nationality & Borders Bill. “Instead of learning lessons, it looks like they are still recycling the same rhetoric and failure,” Cooper said.\n**A message from SSE: We’re investing up to £24bn this decade into infrastructure projects across the UK, including building the world’s largest offshore wind farm. Actions, not ambitions are what’s needed to secure our energy future. SSE. We Power Change. Find out more at sse.com.**\nNot just the usual suspects: Both the Independent and Guardian hear from disgruntled Tories who are skeptical about the viability of the proposals, and predict the plans could get tied up in parliament and the courts, meaning they will have insufficient time to make a difference on the ground before polling day. Allies of Priti Patel, who tried and failed to address the problem as home secretary, sniff that the proposals are “window dressing.” A senior Tory MP tells the Independent that Sunak has “over-promised.”\nThe stats: Nearly 3,000 migrants have crossed the Channel already this year, on top of the 45,000 who arrived in 2022. With polls suggesting the issue of small boats is high on the list of voter concerns, many Tories have been pushing Sunak to come up with a plan to stem the tide. It’s no coincidence that tackling small boats was one of the PM’s five pledges earlier this year.\nReminder: The first deportation flight has yet to take off for Kigali, with the scheme gummed up in the courts.\nJOURNOS BREATH EASY: Separately on the home affairs beat, Playbook hears Braverman has backed down over attempts to protect journalists from being arrested while reporting on protests, following a rebellion in the Lords. The Public Order Bill returns to the Commons Tuesday, and the government has agreed to put forward its own amendment based on one forced on it by Labour peer Shami Chakrabarti along with Rosie Boycott and retired law lord David Hope.\nJustice for Charlotte: The original amendment was drawn up following the arrest of Charlotte Lynch, the LBC journalist who was detained along with other members of the press by Hertfordshire Police while covering a protest on the M25 last year. It was backed by, among others, unlikely rebels Michael Howard and Chris Patten.\nBUDGET BRIEFING\nRUH OH: The Treasury is not budging on corporation tax and will resist pressure from the Trussite Conservative Growth Group and papers including the Telegraph to cancel the scheduled increase from 19 to 25 percent. The i splashes that Chancellor Jeremy Hunt and Rishi Sunak are prepared to take on the backbenches over this one, and Playbook has separately confirmed that the hike is going ahead.\nThe Treasury view … is that at 25 percent, the tax will still be the lowest in the G7, with 70 percent of business unaffected, and that the public would not accept cuts to public services to pay for the increase to be canceled.\nDyson disagrees: Entrepreneur James Dyson has written to Hunt warning of the consequences of what he describes as “yet another tax grab,” adding: “It will do nothing for growth, domestic or international.” The Sun has the Dyson letter, and Trevor Kavanagh and the Sun Says leader both fulminate against the hike.\nThis might help: A poll by Redfield and Wilton Strategies for POLITICO finds 35 percent of voters approve of the move to raise corporation tax compared to 22 percent who disapprove. Another 43 percent say the rate should stay at the current rate.\nENERGY: Amid near-universal speculation that Hunt will announce that the energy support scheme will continue for another three months, the Redfield and Wilton Strategies poll also found 59 percent support the decision to cap average bills at £2,500, with 55 percent saying the scheme has not been generous enough.\nBAD NEWS FOR BEN: The Times’ Steven Swinford hears Defense Secretary Ben Wallace will get only £4-£5 billion of the additional £11 billion he had requested from the Treasury to keep up with inflation. The defense budget has proved particularly vulnerable to inflation, given the amount it spends — often having to pay using the strong dollar — on kit. Interesting to see if Wallace is asked about it at the ConHome defense gathering later.\nFUEL DUTY: A group of two dozen Tory MPs led by former Home Secretary Priti Patel has written to Hunt urging him to freeze or reduce fuel duty, The Sun reports.\nINFLATION BITES: The FT’s Sarah Neville and Jim Pickard report that Boris Johnson’s flagship pledge to build 40 new hospitals by 2030 has been hit by inflation, which has left the NHS capital budget with a shortfall of nearly £2 billion by 2027/8. They say the Treasury and DHSC have had a “difficult discussion” about the program’s future, with some projects likely to be put on ice while money is targeted on five hospitals with roofs on the brink of collapse. And health is just one of a number of areas which are likely to see cuts to capital investment as inflation bites.\nICYMI: Sunday Times suggested small and medium-sized workplaces will be supported to provide staff with health MOTs, as a means of preventing them from dropping out of employment.\nBACK TO BASICS: The Resolution Foundation holds a panel event speculating on what Jeremy Hunt’s budget has in store, starting at 10 a.m — register here to attend in-person or receive an online link.\nSCIENCE AND TECH\nTECH BRO: Rishi Sunak is in his happy place this morning as he and Science Secretary Michelle Donelan launch their plan to turn the U.K. into a “global science and technology superpower by 2030.” The plan includes £360 million in funding for infrastructure, investment and skills from such technologies as quantum and supercomputing and AI.\nPlan: Donelan and her number two George Freeman will shortly be hitting the airways to sell the package, in the form of a 10-point plan labeled “the Science and Technology Framework,” which the PM says will help Britain “stay ahead in the race.”\nHe’s keen: In words put out last night, Sunak said the “bold new plan” would “cement the U.K.’s place as a science and technology superpower by 2030 — bringing together the whole of government to use all its levers to drive forward 10 key actions.” You can read more in POLITICO’S snazzy new Morning Tech U.K. newsletter, which is free to sign up to for the first month.\nSCOOP: The Biden administration rebuffed the U.K.’s multiple requests to develop an advanced trade and technology dialogue similar to structures the U.S. set up with the European Union, my colleague Graham Lanktree reports.\nONLINE HARMS: The Telegraph hears Donelan is considering an amendment to the Online Safety Bill which would see social media bosses face up to a year in jail if they refused to provide bereaved parents with data relating to their child’s death. Merry Varney, a lawyer who supported the parents of Molly Russell, the teenager who took her life after being bombarded with inappropriate online content, has written to Donelan and Justice Secretary Dominic Raab urging them to take action.\nTIKTOK: Former Tech Minister Damian Collins has written an op-ed for the Telegraph in which he warns that TikTok is shortchanging artists.\nAnd speaking of TikTok: Governments around Europe have been slapping restrictions on the social media app — the POLITICO team has a handy interactive map setting out who has done what.\nLOCKDOWN FILES\nLOCKDOWN FILES LATEST: And still they come. The latest tranche of WhatsApps released by the Telegraph shows Matt Hancock resisted reducing the isolation period after being “pinged” as a coronavirus contact because it would “imply we’d been getting it wrong.”\nOMG: Lawyer Jonathan Coad’s absolute car crash of an interview with GB News over his link to Hancock is the most excruciating thing you’ll see today. FWIW Team Hancock says he’s not repping the swift-of-thumb MP.\nBest WhatsApp responses: #TomorrowsPapersToday legend Neil Henderson was delighted get a namecheck. Elon Musk also appears to be following developments.\nClean hands save lives: The Mirror reports DHSC spent £15,000 on top-of-the-range Dyson taps at the height of the pandemic. Emily Thornberry thunders: ”While care workers and NHS staff were having to use bin bags as PPE, Matt Hancock was focused on putting the best quality kit in his own office bathrooms.”\nCut through: A Labour campaign insider gets in touch with Playbook to say that activists are reporting significant “cut through” on both the lockdown stories and the return of Partygate.\n**On March 28 at 4:00 p.m. CEST, POLITICO Live is hosting an online event on “Protecting Europe: How the war in Ukraine changed Europe’s thinking on defense?”. Join the discussion with our expert panelists who will deep dive into Europe's thinking on how to best arm itself and where allies should focus their defense priorities in the coming years. Register today.**\nPLANET BORIS\nSHAMELESS: The Times’ Lara Spirit reports that Boris Johnson has put his dad Stanley forward for a knighthood, one of 100 names he is said to have nominated for honors in his resignation list — far more than his immediate predecessors. Giving Stanley a K is unlikely to go down well in all quarters, given he has been the subject of several complaints of inappropriate touching and domestic violence, which he denies.\nDeselections drama: In the Guardian, Peter Walker has an interesting piece discussing whether Tory activists are becoming more bolshy, following the effective deselections of Damian Green, Theo Clarke and Sally-Ann Hart. One anonymous MP tells Walker they are terrified they will be kicked out after helping remove Johnson last year.\nLABOUR LAND\nDESPERATELY SEEKING SUE: With no sign of the row over her appointment dying down, Sue Gray is today expected to formally submit her request to ACOBA to become Keir Starmer’s chief of staff. The quango will then rule on whether and how long she will have to spend on gardening leave, and any other conditions for her employment with the Labour leader. Reminder — ACOBA’s rulings are advisory, but it would surely be a bad look for Starmer to ignore them.\nWide eyes: The move comes as the Sunday papers report allies of Boris Johnson will put forward an urgent question today on the timeline and background to her recruitment by Labour. It’ll be up to Speaker Lindsay Hoyle to decide whether to accept the question, at around 3.30 p.m.\nSTARMER’S DAY: The Labour leader is starting the day with a Call Keir phone-in with Nick Ferrari from 9 a.m. before hosting a roundtable with Amnesty U.K. where he will meet nine Iranian and Kurdish women human rights activists ahead of International Women’s Day. He then takes part in the Turn the Tables charity event, where he will interview Emily Maitlis. No clips but pics will be released, and it’s all for charity — proceeds to Cancer Research.\nNever mind, United fans: The Sun and Mail have photos of Starmer captaining the Homerton Academicals to a 9-6 defeat at the weekend.\nNO ROOM: Women in labor were turned away from delivery wards at 60 hospitals due to a shortage of midwives last year, figures obtained by Labour show. Wes Streeting will discuss the stats, obtained via freedom of information requests, on the morning round, and the Mail has a write-up.\nPLP: Takes place as usual.\nBROKEN BRITAIN\nSTRIKES LATEST: The Unite union has called off ambulance strikes due to take place today and Wednesday while it enters pay talks.\nOff the rails: No sign of an end in sight to the industrial disputes on the railways, however. The Mail has obtained a letter from Steve Montgomery of the Rail Delivery Group to the RMT’s Mick Lynch suggesting that their talks should be discontinued if the union’s executive fails to put a 9 percent pay offer to members.\nIn breach: The government’s forthcoming legislation to curb strikes is in breach of human rights law, the joint committee on human rights has ruled. The Strikes Bill would clash with Article 11 of the European Convention on Human Rights, which guarantees free association for workers, the Guardian reports. The Morning Star splashes the news.\nWINCE: An astonishing 11 million of us were unable to access NHS dentistry last year, with 6.5 million finding it impossible to obtain an appointment, a million unable to afford it, and another 3.6 million giving up without trying, With dentists quitting the NHS droves, patients have resorted to yanking out their own teeth, The Mirror’s splash says.\n**Save the date – POLITICO Live’s virtual event “Power market reform approaching a snag?” will take place on March 22 to discuss how deep the reform of the power market should go, a few days after the publication of the Commission’s proposal. Register now!**\nTODAY IN WESTMINSTER\nDEFENSE OF THE NATION: The ConHome Defense and Security Conference kicks off at 9.30 a.m. Defense Secretary Ben Wallace is speaking and taking part in a Q&A. Other speakers include Defense Minister Alex Chalk, Chair of the Armed Forces Bill Committee James Sunderland and Chair of the Defense Committee Tobias Ellwood. The event takes place at a Westminster venue TBA, and is also being livestreamed. Tickets here.\nDO THE RIGHT THING: Social housing tenants are being urged to complain about substandard housing as part of the government’s new “Make Things Right” advertising campaign. Labour says Michael Gove’s advertising campaign comes exactly two years and a day after a rather similar “Make Things Right” campaign. Judge for yourself here.\nOMBUDS REFORM: The Institute for Government hosts a panel discussion on reform to Ombudsmen schemes, which includes Tory MP Bernard Jenkin. Register to attend the event in-person or online from 12.30 p.m. here.\nPROSPERITY FOR ALL: The Coalition for Global Prosperity launches a transatlantic essay collection on the U.K.-U.S. relationship in parliament’s Churchill Room at 3.30 p.m., featuring special guest speaker, former U.K. Ambassador to the U.S. Peter Westmacott. The details are here.\nSTUCK IN THE MEDIUM WITH YOU: Medium-sized businesses (MSBs) are often neglected by policy makers, according to a new Adam Smith Institute report. Describing them as the “Forgotten Medium,” the report claims attention is skewed toward the largest and smallest companies. To scale up MSBs and boost growth, the report recommends changing business support programs and liberalizing childcare and the planning system.\nIN THE HOUSE: The latest edition of parliament’s magazine The House is out today, including an interview by Sophie Church with former Victims Commissioner Vera Baird, in which she says Dominic Raab blocking her from standing for a second term. In addition, Vicky Ford writes on threats to MPs’ lives, telling how one colleague “spent her birthday ‘dealing with’ a constituent who was threatening to slit her throat and that of her staff.”\nHOUSE OF COMMONS: Sits from 2.30 p.m. with work and pensions questions … and then the main business is the remaining stages of the Social Security (Additional Payments) (No. 2) Bill and the consideration of Lords amendments to the Genetic Technology (Precision Breeding) Bill. The Alba Party’s Kenny MacAskill has the adjournment debate about health and safety on offshore windfarms on the U.K. Continental Shelf.\nWESTMINSTER HALL: Debates from 4.30 p.m. an e-petition relating to prescription charges for people aged 60 and over (led by Labour’s Tonia Antoniazzi).\nOn committee corridor: The Executive Director at the U.N. World Food Program gives evidence to the defense committee on the impact of climate change (2 p.m.) … The Scottish affairs committee hears from academics and analysts about defense in Scotland (3 p.m.) … and the permanent secretary at the Department for International Trade is among those giving evidence to the public accounts committee about supporting investments in the U.K. (4 p.m.).\nHOUSE OF LORDS: Sits from 2.30 p.m. with oral questions on encouraging businesses to employ disabled people, the role of carers in the economy and nuclear weapons … and then the main business is the fourth day at committee stage of the Retained EU Law (Revocation and Reform) Bill. Crossbench peer Richard Harries has a short debate on steps the government is taking to build peace between the Israeli government and Palestinian people.\nBEYOND THE M25\nOUR FRIENDS IN THE NORTH: Transport Secretary Mark Harper is in the north east to announce the reopening of the Northumberland Line next year, leading to journey times being halved and communities between Ashington and Newcastle reconnected. Harper will say: “Restoring lost railway connections will drive tourism, boost local business opportunities and encourage investment across our regions.”\nNext stop: Harper will join his oppo Louise Haigh plus, mayors Andy Burnham, Ben Houchen and Tracy Brabin at the Transport for the North conference, which takes place at the Crowne Plaza, Newcastle, from 10.30 a.m. The Mirror has a good write-up, with words from Haigh and Northern Powerhouse’s Henri Murison. Expect the focus to be the dire state of the railways in the region, and the future of HS2.\nAHERN ARRIVES: Former Taoiseach Bertie Ahern will address an inter-parliamentary body of British and Irish lawmakers in Stormont for a special sitting to mark 25 years since the Belfast/Good Friday Agreement.\nCOURT REPORT: The trial of Thomas Cashman, charged with the murder of 9-year-old Olivia Pratt-Korbel, begins at Manchester Crown Court at 10.30 a.m.\nHOW RED WAS MY VALLEY: Journalist Paul Mason is running for selection as Labour’s candidate in new constituency Mid and South Pembrokeshire.\n**A message from SSE: It’s time to make a shift. That’s why at SSE, we’re going big. £7 million a day, big. We’re investing right here, right now into infrastructure projects across the UK to accelerate the transition to net zero – from building the world’s largest offshore wind farm, to leading on new carbon capture and hydrogen technologies. Plus, by building new network links to connect places like Shetland to the mainland national grid, we’re harnessing more of Britain’s renewables potential. It’s because of this investment that we’re delivering 1000s of green jobs in communities across the country, developing enough renewable energy projects to power 2 in 3 UK homes and helping businesses become more sustainable. Visit sse.com to find out more about how SSE is investing more than it’s making in profits today, to build an energy system that’s cheaper, cleaner and more secure. SSE. We power change.**\nMEDIA ROUND\nScience, Innovation and Technology Secretary Michelle Donelan broadcast round: GB News (7.05 a.m.) … Sky News (7.20 a.m.) … BBC Breakfast (7.30 a.m.) … LBC (7.50 a.m.).\nScience, Research and Innovation Minister George Freeman broadcast round: Today program (7.30 a.m.) … Times Radio (7.45 a.m.) … 5 Live Breakfast (8.05 a.m.) … GMB (8.30 a.m.) … TalkTV (8.43 a.m.).\nShadow Health Secretary Wes Streeting broadcast round: BBC Breakfast (6.50 a.m.) … GMB (7.25 a.m.) … Times Radio (7.37 a.m.) … Sky News (8.05 a.m.) … TalkTV (8.20 a.m.) … Today program (8.30 a.m.) …Bauer media clip (playing out shortly after 8.35 a.m.) … LBC News (8.50 a.m.) … GB News (9.05 a.m.) … ITN media clip (playing out shortly after 9.20 a.m.).\nAlso on Kay Burley: Labour MP Stella Creasy (8.20 a.m.).\nAlso on TalkTV Breakfast: Author Laura Dodsworth (7.05 a.m.) … Migration Watch U.K. Chairman Alp Mehmet (7.20 a.m.) … Former Brexit Secretary David Davis (8.05 a.m.) … Former Deputy Minister of Justice of Ukraine Sergiy Petukhov (8.30 a.m.) … Professor of Evidence based medicine at the University of Oxford Carl Heneghan (9.05 a.m.) … Former Labour MP Shaun Woodward (9.20 a.m.) … U.K. Council for Psychotherapy Chair Christian Buckland (9.32 a.m.).\nAlso on Times Radio Breakfast: John Turner, former lawyer of Charles Bronson (8.35 a.m.).\nAlso on Nick Ferrari at Breakfast: Former U.K. Independent Chief Inspector of Borders and Immigration John Vine (7.05 a.m.) … Former Chairman of British Airways and Liverpool Football Club Martin Broughton (8.50 a.m.) … Labour leader Keir Starmer’s “Call Keir” phone-in (9 a.m. until 9.30 a.m.).\nAlso on GB News Breakfast: Former Brexit Party MEP Ben Habib (6 a.m. and 7 a.m.) … Mail on Sunday Deputy Political Editor Anna Mikhailova (6.30 a.m., 7.30 a.m. and 8.30 a.m.).\nPolitics Live (BBC Two 12.15 p.m.): Tory MP Brendan Clarke-Smith … Shadow Armed Forces Minister Luke Pollard … The Observer’s Sonia Sodha … The Telegraph’s Tim Stanley.\nTODAY’S FRONT PAGES\n(Click on the publication’s name to see its front page):\nDaily Express: Ending Channel migrant crisis can win election.\nDaily Mail: Boat migrants to get life ban.\nDaily Mirror: 11 million suffer in NHS dentist crisis.\nDaily Star: The big threeze.\nFinancial Times: Beijing’s five percent expansion target signals end to the era of ‘rip-roaring growth’.\ni: Budget 2023 — Hunt and Sunak head for new tax clash with Tory backbenches.\nMetro: The tide is turning.\nPOLITICO UK: Biden rebuffs UK bid for closer cooperation on tech.\nPoliticsHome: Tories Are Finally Rallying Behind Rishi Sunak, But He Still Has Big Problems Outside Westminster.\nThe Daily Telegraph: Hancock rejected plan to cut isolation.\nThe Guardian: Small boats clampdown unworkable, Sunak told.\nThe Independent: Sunak vow to end small boat crossings doomed to fail, senior Tories fear.\nThe Times: Migrants on small boats to be barred from Britain.\nLONDON CALLING\nWESTMINSTER WEATHER: Light rain throughout the day with a gentle breeze. Highs of 8C.\nNEW GIG … for Kezia Buckley, who is moving to Edinburgh to become Sky News’ Scotland news editor. The news is here.\nMOVING ON: Sian Norris moves to a part-time role at Byline Times, focusing on global rights, alongside freelancing. The details are here.\nCONGRATS TO … GB News presenter and former Northern Ireland First Minister Arlene Foster on gaining an expanded role at GB News, presenting throughout the week. Her announcement is here.\nCULTURE FIX: Political Party host Matt Forde interviews comedian, actor and Labour activist Eddie Izzard at the Duchess Theatre at 7.30 p.m. — tickets are available here.\nCAFFEINE HIT: Thomas de Freitas, who has spent the past five years working for Southport MP Damien Moore, begins a new role today as media and public affairs manager at the British Coffee Association — thirsty work!\nJOB ALERT: The Parliamentary Digital Service is recruiting two delivery managers who will be responsible for “working closely with the Programme team and colleagues across Parliament, ensuring that delivery is managed in a consistent manner.” The details are here.\nBIRTHDAYS: Unaffiliated peer Ian Austin … Edinburgh East MP Tommy Sheppard … Hastings and Rye MP Sally-Ann Hart … Hanbury Strategy director Joe Moor … Lord Speaker senior communications officer Andy Woodcock … Former Scottish Labour MSP Neil Findlay … Liberal Party co-founder and former leader Michael Meadowcroft … Labour peer Jim Knight … Centre for Social Justice CEO Andy Cook.\nPLAYBOOK COULDN’T HAPPEN WITHOUT: My editor Zoya Sheftalovich, reporter Noah Keate and producer Grace Stranger.\nSUBSCRIBE to the POLITICO newsletter family: Brussels Playbook | London Playbook | Playbook Paris | POLITICO Confidential | Sunday Crunch | EU Influence | London Influence | Digital Bridge | China Direct | Berlin Bulletin | D.C. Playbook | D.C. Influence | Global Insider | All our POLITICO Pro policy morning newsletters",
  "word_count": 4207,
  "scraped_at": "2026-02-14T13:46:03.551855"
}