{
  "article_id": "e2738b441270",
  "url": "https://www.rockmnation.com/2024/2/22/24079635/california-dreamin-of-15-0-mizzou-softball",
  "title": "Mizzou Softball Preview / Links : California Dreamin ... of 15 - 0 ? ",
  "date": "20240222T143000Z",
  "domain": "rockmnation.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Your 10-0 Missouri Tigers, who advanced in the polls this week to as high as no. 8 (Softball America) to no. 11 (D1, NFCA Coaches Poll) to no. 13 (USA Softball), have conquered the Sunshine State and the Lonestar State and now take their talents to the Golden State for the Mary Nutter Classic in Cathedral City-Palm Springs area, where they’ll face two teams RV in the Top-25 polls. (MUTigers primer)\nCalifornia Dreamin.... of 15-0?\nMizzou Softball Links for Thursday, February 22\nTOO BAD YOU WON’T SEE IT UNLESS YOU SHELL OUT $30 FOR FLO SOFTBALL. Want to know how they do? Follow me on social media (@KarenSteger), the Mizzou Softball twitter account (@MizzouSoftball), and statbroadcast. I’ll have takeaways for sure, and if it’s really exciting, probably a recap or two. Warning— Game 1 on Friday will probably be a bit dicey for me as it conflicts with my beloved Mizzou Gym.\nAs for last week, read my takeaways from the team’s second 5-0 weekend. A reminder: I wrote all these words by watching games entirely on statbroadcast. You’re welcome. Also #putgamesontvpleaseandthankyou\nTeam looks ready.\nMIZZOU STATS\nOffensive Stats\nOffensively, I have been particularly impressed with Maddie Gallagher, Katie Chester, Kayley Lenger, and freshman Stefania Abruscato. Lenger, while on the team last year, played in more of a pinch-runner role, so it’s been nice to see her get quality ABs and show off her bat. Chester smashed a two-out grand slam in Sunday’s game, her second moonshot of the year, and continues to put in good work at the plate. Gallagher has been my Player of the Year thus far, and leads the team in BA and OBP (among the starters). She also walks a lot, barely strikes out, and can be counted on to swipe a bag or two. She was 4-for-4 in the first North Texas game on Saturday and hit .500 on the weekend. Last on my list is Abruscato, owner of the coolest name on the team, and also now the starting DP? She started 4/5 of the games over the weekend, batted .333 and exhibited phenomenal plate discipline, drawing a crap-ton of walks. (It was 5. She had 5 walks.)\nHead Coach Larissa Anderson on the plate discipline:\n“When hitters are walking I know they’re seeing the ball, and they’re understanding that the ball is dictating what the result is. A lot of times hitters will go up there and they’re just too anxious so they feel that they have to hit or put the ball in play rather than have that quality at-bat. So it’s just reassuring to them. That walk is just as successful as the base. It doesn’t matter how you get on base.”\nSomething to watch— Can Mya Dodge get going? The UNI transfer had a pretty good first weekend, but not so much this past weekend against decidedly lesser competition. So far at least, she kinda seems feast or famine, with a lot of strikeouts, and a lot of ground outs to the infield (this is a case where it would actually be nice to SEE her play), oftentimes with runners on— in one game she herself stranded 7 runners.... yikes. Dodge was an offensive FORCE for Northern Iowa, and I expect she’ll get it together.\nPitching Stats\nCC Harrison is on fire so far this season, and has yet to allow a run (knocks on wood). She picked up her first career no-hitter against Texas A&M-Commerce over the weekend. Lilly Whitten, who sat out last year with injury, got her first career start, and I was impressed. She had 8 strikeouts, and seamlessly worked out of jams. Will we see her this weekend? We’ll see. Marissa McCann showed that she’s a work in progress, and I expect we’ll see the freshman in mainly lower-pressure situations this season. Move over CC, there’s a new midweek queen in town. Laurin Krings is still Krings, and she’s the ace of the staff. While Whitten actually handled the Jackrabbits better than she did, there’s no question that against the best competition, that’s who LA wants in the circle.\nLarissa on CC’s performance this weekend:\n“She comes through in clutch situations. She makes some really key pitches. And that’s what adds to it is her energy. She’s one of those types of players that when she’s on the mound, everybody just has a little bit more hop in their step because she brings so much energy out there.”\nLet’s check out the competition. Since people likely aren’t watching it, I’m not going to spend a ton of time on this.\nSan Diego State Aztecs (4-5)\nWhen: Thursday, February 22 at 7pm\nLive Stats: statbroadcast\nRankings: USA Softball & NFCA— RV (31) | D1 Softball & Softball America— NR\nHistory: Missouri leads the all-time series with San Diego State, 5-2. They last played in 2022, when Mizzou won 7-6 in 8 innings. (source: MUTigers)\nThis Season: The Aztecs has losses to #3 Stanford and #17 Oregon, as well as 2 losses to #13 Texas A&M. They have a win over #18 Kentucky, 2-1. The offense is led by Micaela Macario, who is batting .318 | 10 R | 7 BB | 8 SB | .484 OBP. Mac Barbara, the Mountain West Preseason POY, is hitting .310 | 2 HR | 13 RBI | .552 SLG% | .429 OBP. In the circle, the Aztecs are led by the defending Mountain West Pitcher of the Year, Allie Light, who is 2-1 with 1.01 ERA | 17 K | 6 BB | OppBA .240 in 27 2⁄3 innings.\nFun Facts: Per goaztecs.com, 8/10 of SDSU’s game so far this season have been against 2023 NCAA Tourney teams (SDSU is 3-5), and 5 have come against nationally ranked teams (SDSU is 1-4). San Diego State’s pitching staff has recorded a 2.10 ERA with 38K so far this season.\nWisconsin Badgers (4-6)\nWhen: Thursday, February 22 at 9:30pm\nLive Stats: statbroadcast\nHistory: Missouri has an 4-2 advantage all-time over the Badgers. They last faced off in 2022 with Mizzou winning, 8-1. (source: MUTigers)\nThis Season: Wisconsin has played a murderer’s row of a schedule thus far, with an extra innings loss to #4 Georgia, a 5-6 loss to #18 Kentucky, and then two more losses to #6 OK State and #5 Washington. At the recent Clearwater Invite, they were winless. Per UWbadgers.com, the Badgers held the lead in four of the five games, including a 6-5 lead over UGA, and a 5-3 lead over OSU. Losses be damned, the Badgers are a powerful offensive team. They hit 7 homers in the last 5 games, and have 16 on the season, which is tied for the nation’s 5th most. Brooke Kuffel already has 5 homers on the season. Freshman Alivia Bark has 3, and went 7/19 in Clearwater, with 2 HR, 5 RBI and 8 R. She’s leading in the team in most categories.\nPer D1 Softball: “This is one of the games to watch in Cathedral City— Both teams have caught attention and raised eyebrows in the season’s early goings, though with very different results in their win-loss records. Mizzou is 10-0 and off to their best start in fifteen years; Wisconsin is 4-6 but were one of the biggest surprises of Clearwater, taking Georgia to ten innings and losing close games to Kentucky and Oklahoma State. This win would be a solid one on both sides.”\nUCF Knights (6-2)\nWhen: Friday, February 23 at 7:30pm\nLive Stats: statbroadcast\nHistory: The Tigers have the overall lead over the Knights, 2-1,. The two teams squared off a really exciting battle last year, 11-8 in Orlando. (source: MUTigers)\nThis Season: The Knights has a loss to Carolina (2-1) and UConn (2-3) on its resume. They also beat Liberty, but only 7-5 (Mizzou run-ruled ‘em). Weather knocked out some games for the Knights last weekend, and so they just went 1-1 on the weekend at the Clearwater Invite. Johneisha Rowe is off to a great start, hitting .480, and so is RHP Sarah Willis, who threw a season-high 5 innings in UCF’s 2-1 loss to UNC. RHP Kaitlyn Felton (I think Mizzou faced her last year) has three wins in the 2024 campaign.\nFun Facts: On February 17, the Knights beat Wisconsin, 21-9. 21 RUNS!!!! This was apparently, per ucfknights.com, the third time in their history they’ve scored at least 20 runs, but it was the first since 2003. Infielders Shannon Doherty (not of Beverly Hills, 90210 fame) and Jada Cody are climbing the home run lists, as they currently sit 30th and 34th, respectively. The duo also recorded 4-hit games in the drubbing.\nCal-State Fullerton Titans (7-3)\nWhen: Friday, February 23 at 10pm\nLive Stats: statbroadcast\nHistory: Cal State Fullerton has the all-time lead in the series, 6-3. The last time they faced was 2019, and Mizzou was victorious, 7-4. (source: MUTigers)\nThis Season: The Titans have losses to Cal, Grand Canyon and BYU (in extras) on its resume. They beat Loyola Marymount on Wednesday at home before traveling to Mary Nutter. Megan Delgadillo is currently on a 10 game hit streak and was named Big West Field Player of the Week after batting .684 (13/19) in Arizona at the Littlewood Classic. Through 9 games, she’s batting: .645 | .656 SLG% | .774 OBP | 6 SB | 20 H | 4 2B\nFun Facts: Haley Rainey already has a perfect game this season, which she achieved on February 10 against UIC.\nBaylor Bears (3-3)\nWhen: Saturday, February 24 at 10pm\nLive Stats: statbroadcast? (might not be available, nothing showing up)\nRankings: USA Softball & Softball America— 22 | D1 Softball— 19 | NFCA— NR\nHistory: Mizzou leads Baylor in the all-time series, 32-19. The two teams last faced in 2020, and the Tigers run-ruled the Bears 9-1 in 5 innings. (source: MUTigers)\nThis Season: The Bears have faced two ranked teams thus far, and have lost all of ‘em, including two losses to #2 Tennessee, and another to #23 Louisiana. After a week of stale offense, they found it over the weekend, with 32 hits, inlcuding 7 doubles. Shaylon Govan went 9/14 while hitting .643 with 2 RBI and 0 strikeouts. Emily Hott is a player to watch, as she went 3-6 over the weekend, with a double, hoomer, and a 1.167 SLG%.\nFun Facts: Per baylorbears.com, this is a veteran-laden squad that has 7 seniors and 17 upperclassmen. They return all but one senior from the roster, and won 40 games a season ago. Govan was unanimously named preseason All-Big 12, while pitcher Dariana Orme was named to USA Softball’s Top 50 POY watch list. She had a 1.92 ERA and 126 strikeouts last season. The Bears are quite good defensively, and turned 31 DP last season. They’ve already turned 8 this season, including 5 over the weekend.\nOn to the Links!\nHope you had a happy birthday, Tamar!\nYesterday at Rock M\n- Josh identifies Six candidates to replace Desireé Reed-Francois as Missouri’s Athletic Director\n- Prof. Snelling has a new Study Hall: Tennessee 72, Mizzou 67\n- Nate’s talking reviews, 2023 Position Postmortem: Running Backs\n- Kortay’s in baseball mode: Three things we learned about Mizzou baseball from opening weekend\n- Jaden’s sidebar looks at the bright side: How Missouri was largely able to hold No. 5 Tennessee’s offense in check\n- From Cal, the Camera Guy:\n- IN CASE YOU MISSED IT: Please read Nate’s absurd and absolutely ridiculous piece— The Board of Curators plots its next dastardly deed | And read Sam’s take— The Board of Curators and their insistence on meddling\nMore Links:\nAD Search Stuff\n- St. Louis Post-Dispatch: Who will be Mizzou’s next athletics director? Here are 7 names to consider (Hoff, from 2/20) | 3 questions facing Mizzou as it seeks new AD to replace Desiree Reed-Francois (Hoff, from 2/20)\n- Columbia Tribune: What are the 4 most important things facing Mizzou’s newest AD? (Jaden Lewis)\n- MizzouCentral (SI Fan Nation): All Things Mizzou: A Deep Dive Into Desireé Reed-Francois’ Departure (Megan Dorr)\n- PowerMizzou: ($$) What does an AD change mean for Mizzou’s coaches? (Gabe DeArmond) | Watch: State of the Tigers Episode 26 (DeArmond) | ($$) Reacting to Desiree Reed-Francois’ departure from Mizzou\n- Columbia Missourian: Candidates to take over for Mizzou athletics following Reed-Francois’ abrupt exit (Adam Busack, Davis Wilson)\nFootball\n- St. Louis Post-Dispatch: With backup Sam Horn hurt, what’s next for Mizzou’s quarterback room? (Eli Hoff) | BenFred’s 5: City SC starts Season 2 with sizzle, Gates goes unfiltered and Drinkwitz steps up\n- PowerMizzou: Missouri Spring Football Position Preview: Running backs (Jarod Hamilton)\n- Brady was named a PFF College Top 10 QB:\n- The TEAM.\nHoops\n- ABC 17: Trent Pierce set to return to practice next week\n- Columbia Missourian: Trent Pierce expected to return to practice next week\n- Trent Pierce update from Eli Hoff:\n- Important to remember through this tough season (from trainer Pep Stanciel):\n- Women’s Hoops is in the Sunshine State to take on the Gators. Also, where can I get this tee and hoodie?\n- Look at KOBEEEEEEEEEEEEEEEEEEEEEEEEEEEE!!!! A paid promo with Lexus? So cool.\nOther Mizzou Sports\n- TENNIS: Canete Sisters Sit At No. 24 In ITA Rankings (MUTigers.com)\n- GYMNASTICS: As I wrote in my recap, Maya posted her best beam score by a full tenth on Friday night in The Lou.\n- SWIM & DIVE: Season-Bests Highlight Third Day of SEC Championships (MUTigers.com) | Mizzou swim and dive stays off the podium during Day 3 of SEC Championships (Missourian staff reports)\n(check out their social media for more places)\n- BASEBALL: Baseball Concludes West Coast Swing at Tony Gwynn Legacy (MUTigers) | Mizzou baseball stays on the West Coast for the Tony Gwynn Legacy tournament (Seth Schwartzberg, Missourian)\n- Big TigerStyle updates (more on the signing here at MUTigers):\n- TRACK & FIELD: Congrats to thrower, Mitch Weber! (read more at MUTigers.com) | Weber named SEC Men’s Co-Scholar-Athlete of the Year Award (Missourian Staff Reports)\n- And way to go, Mizzou Club Hockey!!! Read more at KOMU 8/Missourian.\n- If you’re looking to sign up for ESPN+, Rock M Nation now has an affiliate link: click Here for ESPN+ Now! (** RockMNation has affiliate partnerships. These do not influence editorial content, though RockMNation may earn commissions for products purchased via affiliate links.**)",
  "word_count": 2397,
  "scraped_at": "2026-02-14T13:11:12.847289"
}