{
  "article_id": "e2942eac4a2f",
  "url": "https://news.yahoo.com/fifth-star-tells-story-ohio-100202613.html",
  "title": "  Fifth Star  tells story of Ohio fight for women right to vote",
  "date": "20230319T121500Z",
  "domain": "news.yahoo.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "‘Fifth Star’ tells story of Ohio’s fight for women’s right to vote | Book Talk\nBefore Ohio was even 30 years old, its women were advocating for the civil rights of others. The Indian Removal Act of 1830 stole land from Native Americans and displaced them, and 62 Steubenville women filed a petition voicing their objections to the injustice. In “The Fifth Star: Ohio’s Fight for Women’s Right to Vote,” Jamie C. Capuzza studies more than suffrage.\nThe landmark 1848 Seneca Falls Convention, at which Frederick Douglass, Elizabeth Cady Stanton and Lucretia Mott spoke, took on temperance and the rights of women to own property and hold employment. Others followed, notably the larger event in 1850 in Salem and at Akron in 1851, at which Sojourner Truth famously gave her “Ain’t I a Woman” speech.\nCapuzza follows through with every petition, ballot, conference and campaign. This stirring and necessary book ends with the “fifth star” — Ohio as the fifth state to pass the 19th Amendment.\n“The Fifth Star” (344 pages, softcover) costs $28 from Kent State University Press. Capuzza is a professor in the Department of Literature and Communication Arts and directs the Gender and Sexuality Studies program at the University of Mount Union.\n‘The Note Who Faced the Music’\nHalf Note feels underappreciated. On the music staff, Eighth Note gets to jump around, Whole Note “can fill a whole measure.” In “The Note Who Faced the Music,” a storybook by North Canton children’s author Lindsay Bonilla, Half Note learns that every note is needed to make a melody.\nThough the other notes offer some consolation, Half Note decides to walk out, leaving Composer short-staffed. He tries to make do with the other notes but it’s terrible. Half Note hears the awful racket and knows that a missing note leaves everything flat.\n“The Note Who Faced the Music” (32 pages, hardcover), recommended for readers ages 4-8, costs $18.99 from Page Publishing. Lindsay Bonilla also is the author of the delightful inclusivity-themed “Polar Bear Island.” The illustrations are by New Hampshire artist Mark Hoffman.\n‘Coach Geoge Allen’\nIn his preface to “Coach George Allen: A Football Life,” Tallmadge writer Lee Elder says that the Pro Football Hall of Fame inductee was the “first modern NFL coach.” His book, which he calls the first full-length biography of the Michigan native, covers Allen’s childhood, during which he had to leave school occasionally to support his family while his father suffered from ill health.\nAllen coached at small colleges in Iowa and California before moving up to the Rams, then to the Bears and back to the Rams. He followed those tenures with a stint at the Washington Redskins (now Commanders) and then back to the Rams. “Why was Allen fired four times by the Rams?” Elder asks.\nElder points to Allen’s innovative use of game films and his determination to acquire the most advanced technology for his teams, and adopted an early form of personality testing to determine his communication style. Though accounts vary, Elder cites Hall of Fame coach Marvin Levy, who gives credit to Allen for coining the term “sack.”\n“Coach George Allen” (268 pages, softcover) costs $35 from McFarland Books. Elder is the executive director of the Professional Football Researchers Association and worked as a publicist for Goodyear Racing.\nEvents\nCuyahoga County Public Library (South Euclid-Lyndhurst branch, 1876 S. Green Road, South Euclid): Mark Dawidziak talks about “A Mystery of Mysteries: The Death and Life of Edgar Allan Poe,” 6:30 to 7:30 p.m. Monday. Register at cuyahogalibrary.org.\nStow-Munroe Falls Public Library (3512 Darrow Road, Stow): Chas Madonio talks about “Bars, Bands, and Rock ‘n Roll: The Golden Era in Kent, Ohio,” featured March 5 in Book Talk, 7 to 8:30 p.m. Monday. In a virtual event at 4 p.m. Tuesday, celebrity chef Jernard A. Wells, author of “Southern Modified” and “Southern Inspired: More Than 100 Delicious Dishes From My Table to Yours,” joins the Online Author Talk Series. Register at smfpl.org.\nMore in U.S.\nLearned Owl Book Shop (204 N. Main St., Hudson): Rob Buyea, author of the children’s Mr. Terupt series, signs “What Comes Next,” 4 to 6 p.m. Tuesday. From 4 to 6 p.m. Wednesday, Troy Cummings (“Notebook of Doom” series) signs “Is This Your Class Pet?”\nAkron-Summit County Public Library (Northwest branch, 1720 Shatto Ave.): Mark Dawidziak talks about “A Mystery of Mysteries: The Death and Life of Edgar Allan Poe,” 6:30 to 7:30 p.m. Wednesday.\nCuyahoga County Public Library (Bay Village branch, 27400 Wolf Road): Former Big Ten and NCAA basketball coach Phil Bova talks about his memoir “Throwing Back the Chair,” 7 to 8 p.m. Wednesday. Register at cuyahogalibrary.org.\nCuyahoga County Public Library (North Olmsted branch, 27403 Lorain Road): Elizabeth Berg discusses her novel “Earth’s the Right Place for Love,” 7 to 8 p.m. Wednesday. Register at cuyahogalibrary.org.\nCuyahoga County Public Library (Beachwood branch, 25501 Shaker Blvd.): Alex Shaland (“Suburbanites on Safari” talks to children in grades 2-5 about writing, 4 to 4:45 p.m. Thursday. Register at cuyahogalibrary.org.\nLoganberry Books (13015 Larchmere Blvd., Shaker Heights): Kate Kelly, author of “Ordinary Equality: The Fearless Women and Queer People Who Shaped the Constitution and the Equal Rights Amendment,” joins the online Peculiar Book Club, 7 p.m. Thursday. Advance notice for an event sure to be popular: At 7 p.m. April 5, Shaker Heights native Carter Bays, creator of Emmy-winning sitcom “How I Met Your Mother,” talks to Cleveland novelist Susan Petrone (“The Heebie-Jeebie Girl”) about his new comic novel “The Mutual Friend.” The $25 admission includes a copy of the book. Register at loganberrybooks.com.\nElizabeth’s Bookshop & Writing Center (647 E. Market St.): A Young Writers Workshop features Kamille Smith (“Girls Fall Down Sometimes”) and her sister Kamryn Smith (“Be Free! Just Do It Your Way”), noon to 2 p.m. Saturday.\nFireside Book Shop (29 N. Franklin St., Chagrin Falls): Physician Sylvia Mustonen signs “New Medicine for a New Millennium,” 1 to 3 p.m. Saturday.\nVisible Voice Books (2258 Professor Ave., Cleveland): Cleveland native Megan Buskey reads from “Ukraine Is Not Dead Yet,” her family’s history of oppression and deportation, 4 p.m. Saturday.\nEmail information about books of local interest, and event notices at least two weeks in advance to BeaconBookTalk@gmail.com and bjnews@thebeaconjournal.com. Barbara McIntyre tweets at @BarbaraMcI.\nThis article originally appeared on Akron Beacon Journal: ‘Fifth Star’ by Jamie Capuzza chronicles Ohio voting rights",
  "word_count": 1059,
  "scraped_at": "2026-02-14T13:45:02.415083"
}