{
  "article_id": "e298c2585700",
  "url": "https://punchng.com/just-in-premier-league-appoints-first-female-referee/",
  "title": "JUST IN : Premier League appoints first female referee",
  "date": "20231214T180000Z",
  "domain": "punchng.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "The English Premier League has appointed Rebecca Welch as its first female referee.\nThe Professional Game Match Officials Limited announced on Thursday via the league’s website.\nHer first official match as a central referee will be Fulham host Burnley on Saturday, December 23.\nWelch, a Washington native, became a referee career in 2010 while working in the National Health Service. She later quit the service to focus on her referee role on a full-time basis.\nIn 2021, she became the first woman to be appointed to referee an EFL match when she took charge of the League Two fixture between Harrogate Town and Port Vale.\nDuring her career, she has also officiated high-profile matches in the Women’s Super League, while she was referee for both the 2017 and 2020 Women’s FA Cup finals at Wembley Stadium.\nIn December 2020 she was added to FIFA’s Elite List of International Match Officials, going on to take charge of matches at the 2022 UEFA Women’s European Championship and the 2023 FIFA Women’s World Cup.\nWelch, who hails from Washington in Tyne and Wear, was the first woman to referee matches in the Championship and FA Cup third round, and last month she became the first woman to act as fourth official in a Premier League match when she formed part of the officiating team for the fixture between Fulham and Manchester United.\nIn an interview with the Independent, Welch said, “I played football and didn’t even think about refereeing until one of my really good friends, who is a referee, refereed us.\n“I spent the whole game telling her how to do her job! Her response was, ‘If you think it’s that easy, give it a go.’ That’s how it happened and 10 years later here I am.”\nAlso, POGMOL disclosed that Sam Allison will become the first black referee in the league since Uriah Rennie, who officiated in the competition for 11 years until 2008.\nAllison, 42, will be in charge of the match between Sheffield United and Luton Town on Boxing Day – Tuesday, December 26.\nAllison, who had worked as a firefighter, enjoyed a successful playing career before turning his attention to refereeing.\nHaving started his journey with Swindon Town, Allison moved on to Bristol City, AFC Bournemouth and Exeter City, even making a handful of appearances for England schoolboys and representing Great Britain.\nAfter the introduction of the Elite Referee Development Plan, Allison started officiating on a full-time basis.\nFollowing his promotion in 2020, he became the third black referee to officiate in the EFL, following in the footsteps of Rennie and Trevor Parkes. He has taken charge of over 100 matches in the EFL.\nSpeaking in March, he said, “I love football so much; it’s in my blood and it’s innate. I’d do anything to be involved in the game. Unfortunately, I didn’t reach the pinnacles as a football player but hopefully one day I can do it as a referee.”\nSam’s first taste of Premier League action came in October 2022, when he was the fourth official in the fixture between Brighton & Hove Albion and Chelsea.\nHe was promoted to officiate in the Championship for the 2023/24 season.\nThe pair will be the fourth and fifth referees from PGMOL’s Select Group 2 to take charge of a Premier League fixture this season, following in the footsteps of Sam Barrott, Bobby Madley and Josh Smith.",
  "word_count": 568,
  "scraped_at": "2026-02-14T12:56:47.663127"
}