{
  "article_id": "e2bc0080cd6f",
  "url": "https://www.standard.net.au/story/8168277/ladder-leaders-outlast-cross-town-rivals-in-physical-contest/?cs=10266",
  "title": "South Warrnambool remain undefeated after six - goal win against Warrnambool | The Standard",
  "date": "20230422T114500Z",
  "domain": "standard.net.au",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Hampden league ladder-leaders South Warrnambool showcased its ability to withstand a pressure situation, holding off a plucky Warrnambool outfit at Reid Oval on Saturday.\nSubscribe now for unlimited access.\nor signup to continue reading\nIn a physical encounter, 16 points or less separated the two sides for the first three quarters, though it was South Warrnambool's execution in the final term that proved the difference in the 14.6 (90) to 6.15 (51) win.\nRoosters coach Mat Battistello was pleased by his side's ability to overcome challenges as the Blues tested them in a variety of ways.\n\"Overall they've (Warrnambool) got some outstanding players out there and they're going to be very competitive all year,\" he said. \"They put us in some different situations and I thought the boys were able to learn from them and work through it. That was the most pleasing part.\"\nSouth got off to a strong start, with key forward Sam Kelly getting on the end of some early goals, while Paddy Anderson looked dangerous against his old side with three majors.\nA goal on senior debut for teenager Bailey Osborne was another highlight for the Roosters.\n\"He had another look at a few and he jumped at the ball in the last quarter and took a spectacular mark, it was a pretty spectacular effort by a 16-year-old,\" Battistello said.\nRicky Henderson finished the second half on the bench with a tight hamstring, though the coach said it was only precautionary, with the club heading into a two-week break.\n\"He's played up the ground a bit more this year, so we decided at half time, he was playing well and could have gone back on, but with that two-week break it was a no-brainer, he's super important to us,\" he said.\nBattistello said four rounds in his unbeaten side was far from a finished product.\n\"We didn't really have a pre-season game because we knew we had this four week block with the two week bye,\" he said. \"We really did delay our start so to get the four wins when we're a little underdone conditioning wise as well, we're really pleased.\"\nBlues coach Dan O'Keefe said he took several positives out of the match, with the biggest being his team is good enough to match it with the best.\n\"We had more scoring shots than probably the best team in the competition,\" he said. \"All the numbers and stats we want to take, we were up in them, but unfortunately we couldn't convert and they kicked really straight in the last quarter.\n\"It's hard to swallow now, but there are lots of positives to take from it.\"\nThe Blues were without midfielder Mitch Bidmade, though new recruit Nick Hooker impressed with his abilities by foot out of defence, as did Will Lord on the wing while Luke Cody impacted up forward.\n\"He's been a super recruit for us,\" O'Keefe said of Hooker. \"He can get the ball to half way from deep in the backline and hits targets. He certainly helps our momentum.\"\nThe Blues will play Camperdown at Leura Oval during next weekend's split round.\nOur journalists work hard to provide local, up-to-date news to the community. This is how you can access our trusted content:\n- Bookmark https://www.standard.net.au/\n- Make sure you are signed up for our breaking and regular headlines and newsletters\n- Follow us on Facebook, Twitter, Instagram and LinkedIn\n- Tap here to open our Google News page\n- Join our Courts and Crime Facebook group and our dedicated Sport Facebook group\n- Subscribe",
  "word_count": 594,
  "scraped_at": "2026-02-14T12:39:40.809454"
}