{
  "article_id": "e2cc9a645671",
  "url": "https://tide1009.com/what-does-greg-byrne-look-for-in-a-coach/",
  "title": "What Does Greg Byrne Look For in a Coach ? ",
  "date": "20240217T050000Z",
  "domain": "tide1009.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "What Does Greg Byrne Look For in a Coach?\nAlabama athletic director Greg Byrne has made several hires during his time as Alabama's AD. From reviving a basketball program to an NCAA powerhouse to finding the coach who will try to fill the shoes of Nick Saban, Byrne has had no shortage of coaching searches during his time at Alabama.\nIs there a certain quality Byrne looks for in a coach? Is he searching for an elite gameday coach, a top-notch recruiter, or something else?\nByrne spent time on The Game with Ryan Fowler Friday afternoon, and he provided a quick view into what he searches for when he's hiring a coach to represent the script A,\nI’ll tell you, and again, it relates to Coach Oats, too. One of the things I tried to do when we hire coaches is I want to find somebody that is obviously a great coach, excellent recruiter, a strong ethic and how they're going to manage the young people in the program. Somebody that the young men and young women of today can relate to the coach and the coach can relate to them.\nByrne also mentioned something else he searches for in a coach,\nOne of the things, you know, I'm in my 17th year now being an AD, you know, I haven’t batted 1,000 hiring coaches, but I've been fortunate to hire a few good ones here and there, and the one thing that all of them have in common, besides the things that I said, those who have success are very smart. Coach DeBoer I can tell already, is really smart. He's very thoughtful. You know, sometimes in today's world, we all want instant answers and responses, but in reality, he's very thoughtful already, I can tell. And how he's approaching the staff, how he is approaching just managing the roster and connecting with the kids. And I can tell you that that has gone very well. We're pleased about that.\nByrne continued to sing the praises of his new football coach,\nThere's no doubt from his track record, the man can coach football and he surrounds himself with others who are really good coaches. I'm really impressed with what his culture has been in the past. And then at Washington, Fresno, and, you know, all the way back to his NAIA days. But also I can see that happening here. Coach Saban had an incredible culture in his program. And I think we have an opportunity to have a very good culture with Coach DeBoer and his staff and what's ahead for Alabama football. So we're really, really proud of the job that he's already doing. There probably has never been a transition like this in the history of college sports.. You know, back when John Wooden or Coach Bryant or somebody like that retired, he didn't have the transfer portal. You didn't have NIL. You didn't have that same dynamics of what we're having today. Not to say that they weren't equally huge transitions. They were. But to go from Coach Saban, what he means to our university and college football and everything else in between today, this is a really challenging transition. But I've been extremely impressed with his approach from it. From the second he's gotten here and embracing our culture at Alabama and embracing Coach Saban. And I think he's he's done a really nice job with that and excited to watch him get out on the practice field with the team here for spring ball, too.\nCoach DeBoer's ability to build relationships was something that was highlighted in the conversation between Fowler and Byrne on Friday,\nI think that's always been important. Coach Saban did such an incredible job with that. It's just as important today if not more important because of all the things I mentioned earlier with the transfer portal. You want to have a culture within your program or relationships within your program that kids are going to say, Man, do I really want to go somewhere else? And one of the things we talked to and you know, I think it's been pretty public. A lot of what I said is that we had a very, hopefully, thoughtful plan on the transition and trying to manage the roster, knowing that we wouldn't necessarily bat 1,000. You know, one of things we reminded the young men and their families, Alabama's a very special place and that's not going to change. Now, who the head coach is was changing, but the foundation that Coach Saban laid for the future, it puts us in an incredible position to capitalize that for the future. And that was very much part of our messaging to the young men and their families is, you know, you may see some bright lights and some things being said to you. At the same time, everything we've said to you at Alabama, we backed up and delivered upon.\nGreg Byrne talked more about the roster turnover after the retirement of Nick Saban,\nObviously we've had some turnover in the roster. We didn't want to necessarily, but if you would have said to me when on a Wednesday, when Coach Saban announced the team that he was retiring, that we'd end up with the numbers that we have, I'd say, you know what, I will probably take that, be pleased with that. So that doesn't mean that we didn't work hard, because we did. But you know, I think that culture that you have heard from his former players is already coming through just on a daily basis in the short time that he's been here.\nYou can listen to Greg Byrne's full interview with Ryan Fowler on the Tide 100.9 app. Catch The Game With Ryan Fowler on weekdays from 2-6 p.m.\nAlabama Basketball vs Mississippi State\nGallery Credit: SEC Media Portal",
  "word_count": 983,
  "scraped_at": "2026-02-14T13:11:19.232054"
}