{
  "article_id": "e2e41a589888",
  "url": "https://www.canberratimes.com.au/story/8655942/sam-mostyn-appointed-a-companion-of-the-order-of-australia-ac/?cs=14329",
  "title": "Sam Mostyn appointed a Companion of the Order of Australia ( AC ) | The Canberra Times",
  "date": "20240610T013000Z",
  "domain": "canberratimes.com.au",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "From school captain at Curtin South Primary School to the next Governor-General of Australia - Sam Mostyn's life is already remarkable, and undoubtedly shaped by being born and raised in Canberra, where she was close to opportunity but also moulded by the less highly-charged, more grounded side of the national capital.\nSubscribe now for unlimited access.\nor signup to continue reading\nMs Mostyn, 58, who on July 1 will be sworn in as the 28th Governor-General of Australia, and the first to be born in Canberra, has been appointed a Companion of the Order of Australia (AC) in the King's Birthday 2024 Honours List, revealed on Monday.\nShe was honoured for her \"eminent service in the social justice, gender equity, sporting, cultural and business sectors, to reconciliation, and to environmental sustainability\".\nThe AC is also a bit of constitutional paperwork - she must hold an AC, the highest honour in Australia, to become governor-general and it is likely to be bestowed upon her in a ceremony earlier than the other King's Birthday recipients to avoid having to give it to herself.\nMs Mostyn has not been able to respond to the honour, Prime Minister Anthony Albanese previously saying she would not be making any public statements until she was sworn in.\nIn the long line of governors-general, the first born in Scotland, the most recent born in Wollongong, Ms Mostyn is the first to be born in Canberra, growing up in Curtin, the suburb over from Government House.\nMs Mostyn, who will be the second woman to hold the position of governor-general, was born at the old Canberra Hospital, as the new family home was being built in Curtin. The family were living in Blacket Street, Downer, while the new house was being built.\nShe is the oldest of four girls. Her sisters are Suzanne, Alex and Sally. Suzanne lives in Canberra with her husband, Channel Seven political editor Mark Riley.\nHer father William Mostyn, a Royal Military Duntroon graduate and major in the Australian Army, still lives in Deakin.\n\"In my very early years, my dad's military service took us to the United States and Canada before returning to Australia and living in Adelaide and Melbourne, including time spent with my grandmother when my father served in Vietnam,\" Ms Mostyn said at a press conference at Parliament House in April to announce her appointment.\n\"We learned to be resilient. By the early 1970s, we had returned to Canberra, where I was the beneficiary of the public education system and then later completing an arts law degree at the Australian National University while working as a researcher for the chief magistrate of the ACT (Ron Cahill).\n\"My memories are of deep service, community involvement, education and learning, sport and music, volunteering and engaging in the disability sector. I also clearly and fondly recall our annual attendances at Anzac Day dawn services and marches and standing patiently with my sisters in the crowds on Dunrossil Drive at Yarralumla, waiting to catch that glimpse of Her Majesty The Queen on her visits to Canberra in the 1970s.\"\nMs Mostyn finished primary school at Curtin South and went on to Woden Valley High School and Narrabundah College.\nWhile completing her law degree at the ANU, she would walk across to the courts building to work as a researcher for chief magistrate Ron Cahill, the magistrates and children's courts showing her another side of the city and the law in action.\nMs Mostyn's Canberra as a child and teenager was of an emerging city. Around Curtin, there was not much else but the local shops and Woden Plaza. Playing in the then bush around Curtin and riding bikes was what every kid did. The family also did a lot of volunteering.\n\"My parents instilled in us the values that they lived so consistently. Generosity, care for others, respect, curiosity, being of service to society and always humility,\" she said, in April.\nWhile she went on to work as an associate to Justice Michael Kirby in the NSW Court of Appeal, Ms Mostyn returned to Canberra in 1994 to work as a senior policy advisor on communications to then Labor minister Bob Collins and later Michael Lee and then finally prime minister Paul Keating.\nIt was during this time she met her husband Simeon Beckett, who was also a policy advisor to the government. Their first date was at Chairman and Yip in Dickson. Mr Beckett SC is now a public law barrister and the couple have a daughter, Lottie.\nMs Mostyn has said her family will be central to her role as governor-general.\nMs Mostyn went on to a career in business and advocacy, with a long history of executive and governance roles across business, sport, climate change, the arts, policy and not-for-profit sector.\nShe served as a commissioner with the Australian Football League, the first woman appointed to the role, and was the non-executive director of the Sydney Swans from 2017 to 2021.\nHer roles have ranged from chair of Beyond Blue to director of Reconciliation to chair of Ausfilm to non-executive director of property group Mirvac for almost the last decade. She was also the inaugural commissioner of the the National Mental Health Commission and deputy chair of the Diversity Council of Australia.\nShe was awarded an honorary doctorate of laws from the ANU in recognition of her work as a pioneer of gender inclusion and equity and leadership in sustainability and climate change.\n\"I am ready to serve with integrity, compassion and respect,\" she said in April of her latest role as governor-general.",
  "word_count": 932,
  "scraped_at": "2026-02-14T14:13:06.929387"
}