{
  "article_id": "e2fec1e4b592",
  "url": "https://www.aol.co.uk/news/us-condemns-hezbollah-horrific-rocket-043957054.html",
  "title": "US condemns Hezbollah for  horrific  rocket attack",
  "date": "20240729T051500Z",
  "domain": "aol.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "US condemns Hezbollah for ‘horrific’ rocket attack\nThe US has condemned Hezbollah for a rocket strike that killed 12 children in the Golan Heights and says it is working on a “diplomatic solution” to prevent similar attacks.\nAdrienne Watson, the National Security Council spokesman, said: “This attack was conducted by Lebanese Hezbollah. It was their rocket, and launched from an area they control. It should be universally condemned.”\nKamala Harris, the US Vice President who is running to become president, called Saturday’s attack “horrific” and is said to be closely monitoring the situation.\nUS diplomats are thought to be working furiously to prevent the incident from spilling over into a regional war, exchanging messages with counterparts in Israel, Lebanon and Iran.\nIsraeli defence officials reportedly believe a strike on Beirut, the Lebanese capital, could be escalatory but have not ruled it out as they weigh responses to the Golan Heights attack.\n05:39 AM BST\nThis live blog is now closed\nFollow the Monday live blog for the latest updates.\n04:38 AM BST\nFlights cancelled and delayed\nSome flights at Beirut airport have been cancelled or delayed as tensions escalate between Israel and Hezbollah.\nLebanon’s Middle East Airlines (MEA) said disruptions to its schedule were related to insurance risks.\nLufthansa and Lufthansa’s Eurowings have cancelled three flights to Beirut scheduled for Monday afternoon, according to the information board at the airport and flight tracking website Flightradar24.\nTurkish Airlines also cancelled two flights overnight on Sunday and Turkey-based budget carrier SunExpress, Turkish Airlines subsidiary AJet, Greek carrier Aegean Airlines, Ethiopian Air and MEA have also cancelled flights scheduled to land in Beirut on Monday, Flightradar24 showed.\nThe airlines did not immediately respond to requests for comment.\n03:46 AM BST\nAirstrikes hit Lebanon\nIsrael has carried out several air strikes on southern Lebanon and a drone strike on eastern Lebanon in recent hours, Al Jazeera reports, but no casualties have been reported so far.\nHezbollah is also reportedly targeting Israeli positions.\nIt comes as Israel vowed to retaliate after Saturday’s deadly rocket strike, leaving the world on edge as a potential escalation in the war looms.\nUN Secretary-General Antonio Guterres has called on all parties to “exercise maximum restraint”.\n01:21 AM BST\nAnother child victim named\nThe 12th victim of the Golan Heights attack has been named as 11-year-old Jifara Ibrahim.\nIbrahim and 11 other children children had been playing football when the rocket hit. After his body was not immediately recovered after the blast, his family held hope that he had run from the scene.\nTheir worst fears were confirmed on Sunday night following testing of body parts found at the football field.\nThe victims were: Alma Ayman Fakher Eldin, 11; Milad Muadad Alsha’ar, 10; Vinees Adham Alsafadi, 11; Iseel Nasha’at Ayoub, 12; Yazan Nayeif Abu Saleh, 12; Johnny Wadeea Ibrahim, 13; Ameer Rabeea Abu Saleh, 16; Naji Taher Alhalabi, 11; Fajer Laith Abu Saleh, 16; Hazem Akram Abu Saleh, 15; and Nathem Fakher Saeb, 16.\n12:43 AM BST\nBen-Gvir ‘did not receive torture video’\nThe IDF has reportedly denied that Itamar Ben-Gvir, Israel’s national security minister who controls prison policy, received footage of Israeli hostages being tortured.\nEarlier, The Telegraph revealed that Hamas is filming the torture of hostages in an attempt to force Israel to ease conditions for Palestinians held in Israeli jails. Investigations have found that Palestinian prisoners have been blindfolded, beaten and held for months without having their cases heard.\nMr Ben-Gvir, who leads the hard-Right Jewish Power party, has made it a priority to worsen conditions for Palestinian prisoners since taking office in December 2022, causing him to clash repeatedly with the Shin Bet intelligence agency who feared it would ignite another violent conflict with Hamas.\nHe has been a source of friction between Israel and its closest allies due to his extreme views on the Palestinians as well as his opposition to a ceasefire deal.\nCiting Hebrew media and Channel 12 News, The Times of Israel said the army informed families of hostages that Mr Ben-Gvir was not sent any videos of hostages being tortured.\n11:08 PM BST\nIsrael vows to ‘hit enemy hard’ in strikes\nIsraeli Defence Minister Yoav Gallant has vowed to “hit the enemy hard” in retaliatory strikes, raising fears that the war in Gaza will spread.\nMeanwhile, Iran has warned Israel any new military “adventures” in Lebanon could lead to “unforeseen consequences”.\nRead our front page story here\n10:06 PM BST\nTake ‘immediate steps’ for ceasefire in Gaza, Starmer tells Israeli president\nSir Keir Starmer told Isaac Herzog, the Israeli president, that there must be “immediate steps” towards a ceasefire in Gaza to secure the release of Israeli hostages.\nAccording to a No 10 readout of the meeting between the two men in Paris, the Prime Minister “said there must be immediate steps towards a ceasefire, so that hostages can be released and more humanitarian aid can get in for those in desperate need”.\nSir Keir is also said to have reiterated his commitment to the “historic friendship” between Britain and Israel, along with his “ongoing support for Israel’s right to self-defence in accordance with international law”.\n09:47 PM BST\nIsrael expected to approve Hezbollah retaliation\nIsrael is expected to order a major retaliation on Hezbollah in Lebanon for a rocket strike that killed 12 children in the Golan Heights on Saturday, Daniel Hardaker writes.\nAccording to the Times of Israel, officials have said that the Israeli government is set to launch a significant response, although its extent remains to be seen.\nLBCI, a Lebanese news channel, earlier cited diplomatic sources in Washington and Beirut as saying a strike on Lebanon was “certain” but that efforts were being made to keep it limited in scale.\nIsraeli officials later clarified that they intended to strike Hezbollah without triggering a full-scale conflict, according to a radio station operated by the Israeli military.\n“We want to hurt Hezbollah, but without being dragged into a wide regional war,” the officials were quoted as saying.\nIsrael was ready to implement the attack plan immediately, the station added.\n09:40 PM BST\nNetanyahu and Gallant authorised to decide response to attack\nIsrael’s security cabinet has authorised Benjamin Netanyahu, the Israeli Prime Minister, and Yoav Gallant, the defence minister, to decide the “type” and “timing” of the response to Saturday’s attack.\n09:27 PM BST\nHarris condemns Hezbollah for Golan Heights strike\nKamala Harris, the US Vice President, has condemned Hezbollah for the attack on Golan Heights and pledged “ironclad” support for Israel.\nPhil Gordon, her national security adviser, said she “has been briefed and is closely monitoring Hezbollah’s horrific attack on a soccer field in Majdal Shams in northern Israel yesterday which killed a number of children and teenagers.”\nHe said Ms Harris, who could become US President if she beats Donald Trump in November, “condemns this horrific attack and mourns for all those killed and wounded.”\n“Israel continues to face severe threats to its security, and the Vice President’s support for Israel’s security is ironclad,” he added.\n09:01 PM BST\nReports: Israel has not ruled out strike on Beirut\nIsrael’s defence officials have reportedly not ruled out a strike on Beirut as they weigh the possible responses to Saturday’s attack.\nSenior figures believe that an attack on the Lebanese capital will provoke a response from Hezbollah and days of escalation, according to Haaretz.\nThey are concerned that retaliating could mean a war which Israel is ill-prepared for after months of combat in Gaza, and jeapordise a potential hostage deal with Hamas.\n08:35 PM BST\nHamas sends hostage torture video with warning to Israeli minister\nHamas is filming the torture of Israeli hostages in an attempt to force Israel to ease conditions for Palestinian prisoners.\nIn one video, members of the terrorist group directly address Itamar Ben-Gvir, Israel’s national security minister who controls prison policy, two Israeli officials told The Telegraph.\nThe video shows hostages being tortured while Hamas warn that harsher conditions for Palestinian prisoners held in Israel are affecting the well-being of hostages in Gaza.\nRead the full story from Jotam Confino here.\n08:08 PM BST\nPictured: Israel’s security cabinet meets to discuss response to rocket attack\n07:48 PM BST\nDiplomats ‘working to avert Israel-Hezbollah war’\nUS diplomats are working furiously to prevent a war breaking out between Israel and Hezbollah, according to the Wall Street Journal.\nOfficials are said to have reached out to counterparts in Israel and Lebanon while trading messages with Iran, in an attempt to defuse the situation.\nAlthough both sides have indicated that they do not intend to escalate the conflict, there are fears that a miscalculated response could provoke an all-out war.\n07:24 PM BST\nReports: Rising tensions between Netanyahu and defence minister\nThe Golan Heights attack has reportedly exacerbated long-running tensions between Benjamin Netanyahu, the Israeli Prime Minister, and Yoav Gallant, the defence secretary.\nMr Netanyahu was irritated by Mr Gallant’s statement that he met with security chiefs and had “determined the courses of action” following the deadly rocket strike on Saturday, according to the Kan public broadcaster.\nHis office is said to have issued messages to ministers that he is angry with Mr Gallant and believes he wants to manage the war on his own.\n07:07 PM BST\nIsraeli cabinet expected to discuss response to attack\nA meeting of the Israeli cabinet is underway in Tel Aviv, where ministers are expected to discuss the response to the Golan Heights attack, according to Israeli media.\n06:35 PM BST\nUS blames Hezbollah for rocket attack\nThe US has condemned Hezbollah for the Golan Heights rocket strike and says it is working on a “diplomatic solution” to prevent similar attacks.\nAdrienne Watson, the National Security Council spokesman, said: “This attack was conducted by Lebanese Hezbollah. It was their rocket, and launched from an area they control. It should be universally condemned.\n“Hezbollah started firing on Israel on October 8, claiming solidarity with Hamas, another Iranian-backed terrorist group.\n“Our support for Israel’s security is ironclad and unwavering against all Iran-backed threats, including Hezbollah.\n“The United States is also working on a diplomatic solution along the Blue Line that will end all attacks once and for all, and allow citizens on both sides of the border to safely return to their homes.”\nIt comes amid reports that Washington is pushing Israel to limit the scale of its response, to avoid tipping the region into all-out war.\n06:28 PM BST\nIDF releases pictures of shrapnel from rocket attack\nThe Israel Defence Forces has released what it says is evidence that the rocket that killed 12 children in the Golan Heights came from Hezbollah.\nIt published a comparison between shrapnel found at the scene of the attack, at a football field in Majdal Shams, and the Iranian Falaq-1. In Lebanon, it is used exclusively by Hezbollah, according to the Times of Israel.\nIt comes amid reports that Israel is expected to order a major retaliation on the group following the attack on Saturday.\n06:06 PM BST\nPictured: Israeli air strike on Lebanese border village\nSmoke billows from buildings after an Israeli air strike on the southern Lebanese village of Chihine on Sunday.\n05:58 PM BST\nLebanese airline delays Beirut flight arrivals amid Israel tensions\nMiddle East Airlines (MEA), Lebanon’s national carrier, has delayed some flights to Beirut from Sunday night until Monday morning.\nThe airline did not give a reason for the schedule changes, but the move comes amid mounting tensions between Hezbollah, the Lebanon-based terror group, and Israel after a Hezbollah rocket strike killed 12 children on Saturday.\nMEA said that six flights to Beirut from London, Copenhagen and other cities in the Middle East would have their departure times moved to Monday.\nIsrael is expected to launch a retaliation on Hezbollah for Saturday’s strike, with officials quoted by Israeli media as saying they want to hurt the terror group without triggering a full scale war.\nBeirut’s Rafic Hariri International Airport is located in the Hezbollah-dominated southern suburbs of the city.\n04:54 PM BST\nPictured: Hezbollah supporters carry coffin of fighter killed in Israeli air strike\n04:31 PM BST\nNetanyahu ‘expected to order retaliation on Hezbollah’\nIsraeli media has said that Benjamin Netanyahu, the Israeli prime minister, is expected to order a major retaliation on Hezbollah for a rocket strike that killed 12 children in the Golan Heights on Saturday.\nAccording to the Times of Israel, officials have suggested that the prime minister will order a significant response, though its extent remains to be seen.\nMr Netanyahu convened an emergency security cabinet meeting immediately after returning to Israel after his visit to the US.\nWestern officials, including British foreign secretary David Lammy and US secretary of state Antony Blinken, have cautioned against an escalation in the conflict.\nChuck Schumer, the US senate majority leader, said Israel “has every right to defend itself against Hezbollah like they do against Hamas”.\n04:18 PM BST\nIDF tells Palestinians to evacuate Bureij in central Gaza\nThe Israel Defence Forces (IDF) has urged Palestinian civilians to evacuate Bureij, a refugee camp in central Gaza, and head towards the designated humanitarian zone.\nCol Avichay Adraee, the IDF’s Arabic-language spokesman, said that the IDF would “forcefully operate” against militants in Bureij after rocket attacks were reported in the area.\n04:04 PM BST\nIsraeli tanks make advances in southern Gaza\nIsraeli tanks pushed deeper into several areas of southern Gaza on Sunday, with the Reuters news agency reporting that the advance caused civilian casualties and forced thousands of residents to flee their homes.\nThe armoured troops moved further into the towns of Al-Karara, Al-Zanna, and Bani Suhaila, where locals said fierce fighting could be heard.\nResidents told Reuters that an Israeli air strike in the Mawasi district, a designated humanitarian area that locals had been told to flee to, killed five people including a four-month-old girl.\nThe Israeli military said it was checking reports of the strike.\nThe IDF said an officer and a soldier from the 7th Armored Brigade’s 82nd Battalion were seriously wounded during the fighting.\nGazan health authorities said that Israeli strikes had killed 66 Palestinians across the territory in the past 24 hours.\n03:39 PM BST\nHezbollah fires two rockets at Israel, IDF says\nHezbollah has fired two rockets at the settlement of Shtula, the Israel Defence Forces said.\nThe salvo struck a house but no injuries were reported, local media said.\nHezbollah has claimed responsibility for the attack on the village, which was once home to 300 people before being evacuated in late-2023 due to border clashes between Israeli forces and Hezbollah militants.\nTwo rockets were launched from Lebanon at the northern border community of Shtula a short while ago, the IDF says.\nOne of the rockets struck a home. There are no reports of injuries.\nHezbollah takes responsibility for the attack, as well as earlier fire at the Manara area. pic.twitter.com/qQKi0Kfnv3— Emanuel (Mannie) Fabian (@manniefabian) July 28, 2024\n03:14 PM BST\nHezbollah says it has attacked an Israeli kibbutz\nHezbollah has said it has attacked the Manara kibbutz on the border between Israel and Lebanon.\nThe Lebanon-based group said it did so with “appropriate weapons and directly hit it”.\nIn a statement, Hezbollah added that the attack led to the “burning and the injury of those inside it”.\nThe action was taken “in support of our steadfast Palestinian people in the Gaza Strip and in support of their valiant and honourable resistance”, the terror group said.\n02:24 PM BST\nUK condemns Golan Heights strike, says David Lammy\nIn a post on X, David Lammy, the Foreign Secretary, said that the UK “condemns the strike in Golan Heights that has tragically claimed at least 12 lives”.\nHe also said the UK was concerned about further escalation and that Hezbollah must cease its attacks.\nThe UK condemns the strike in Golan Heights that has tragically claimed at least 12 lives.\nWe are deeply concerned about the risk of further escalation and destabilisation.\nWe have been clear Hizballah must cease their attacks.— David Lammy (@DavidLammy) July 28, 2024\n02:04 PM BST\nLebanon as a whole has to pay the price, says Israeli finance minister\nIsrael’s finance minister has said that Lebanon “as a whole” has to pay the price for a Hezbollah strike on the Golan Heights that killed 12 children.\nIn a post on social media, Bezalel Smotrich said: “For the death of small children, Nasrallah [Hezbollah’s secretary general] should pay with his head. Lebanon as a whole has to pay the price.”\n“My position regarding the necessary steps is known,” he added.\nMr Smotrich is the chairman of the ultranationalist National Religious Party–Religious Zionism and was appointed as finance minister in 2022.\n01:47 PM BST\nWatch: Funeral for children killed in Hezbollah rocket attack on Golan Heights\nA funeral for children killed in Saturday’s Hezbollah rocket strike on the Golan Heights was held on Sunday in the town of Majdal Shams, the site of the attack.\nMajdal Shams is a predominantly Druze settlement and many of the mourners can be seen in traditional red and white Druze religious headwear.\nThe Druze, an Arab minority whose faith is heavily influenced by Islam, make up more than half the 40,000-strong population of the Golan Heights.\nThe attack on Majdal Shams hit a football pitch and killed a total of 12 children. Hezbollah has denied that it carried out the strike, but Israel has vowed that the Iran-backed terror group “will not go unpunished”.\nההלוויה קורעת הלב במג'דל שמס pic.twitter.com/kRXH4o8TIT\n— yayafink (יאיא פינק) (@yayafink) July 28, 2024\n01:32 PM BST\nPictured: Israeli military chief meets general staff amid spiraling tensions\n01:21 PM BST\nHezbollah on high alert, clears out key sites\nHezbollah is on high alert and has preemptively cleared key sites of personnel, the Reuters news agency reports citing two security sources.\nThe terror group evacuated locations across southern Lebanon and the eastern Bekaa Valley, the sources added.\nThe move comes amid spiraling tensions that were triggered when Hezbollah killed 12 children in a rocket strike on a football pitch in the Israeli-occupied section of the Golan Heights on Saturday.\nIsraeli retaliatory airstrikes hit Hezbollah targets across southern Lebanon overnight, with the Israeli defence minister saying that the Iran-backed group “will not go unpunished”.\n01:06 PM BST\nFrance condemns deadly Hezbollah rocket attack\nFrance has condemned “in the strongest possible terms” the Hezbollah rocket attack that killed 12 children in the Israeli-occupied sector of the Golan Heights on Saturday.\nThe country also urged restraint to prevent further escalation in the conflict.\n“France calls for everything to be done to prevent a further military escalation and will continue to work with the parties to this end,” the French foreign ministry said.\nFollowing the deadly attack on the Golan Heights and Israeli retaliatory strikes on Hezbollah in Lebanon, France has reiterated its advice that its citizens should not travel to Lebanon, Israel or the Palestinian territories.\n12:42 PM BST\nHezbollah will face consequences, says Israeli defence minister\nHezbollah will face consequences for carrying out a rocket attack on a football pitch in the Golan Heights that killed 12 children, the Israeli defence minister said.\nYoav Gallant rejected Hezbollah’s claim that it did not carry out the attack, saying it “will not go unpunished for this incident, even with its ridiculous denials”.\nThe Iran-backed terror group “will bear the price and will pay a heavy price for its actions”, he added.\nMr Gallant earlier vowed to “hit the enemy hard” in response to the Golan Heights strike.\n12:35 PM BST\nPictured: The children killed in Hezbollah strike on Golan Heights football pitch\nIsraeli media has released a photograph of 11 of the 12 children killed by Saturday’s Hezbollah rocket strike on the predominantly Druze town of Majdal Shams in the Golan Heights.\nThe children were earlier named as Alma Ayman Fakher Eldin, 11; Milad Muadad Alsha’ar, 10; Vinees Adham Alsafadi, 11; Iseel Nasha’at Ayoub, 12; Yazan Nayeif Abu Saleh, 12; Johnny Wadeea Ibrahim, 13; Ameer Rabeea Abu Saleh, 16; Naji Taher Alhalabi, 11; Fajer Laith Abu Saleh, 16; Hazem Akram Abu Saleh, 15, and Nathem Fakher Saeb, 16.\n12:28 PM BST\nNorway urges its citizens to leave Lebanon\nNorway has urged its citizens to leave Lebanon amid fears of an escalation of conflict between Israel and Hezbollah.\n“Norwegian authorities remind you of travel guidelines that encourage all Norwegian citizens to leave the country.” the country’s embassy in Lebanon said.\nIt added that if the situation worsened, opportunities to leave Lebanon may become limited and that the embassy would have “limited resources to assist Norwegian citizens in leaving the country”.\n12:07 PM BST\nWatch: Ambulances attend scene of Israeli retaliatory strike in Lebanon\nAmbulances rush to the scene of an Israeli strike on the Tyre district of southern Lebanon.\nIsrael struck Hezbollah targets in Lebanon overnight after a rocket attack by the terror group killed 12 people in a town in the Golan Heights.\nSeveral Ambulances are on-scene of the Israeli Airstrike earlier in the Tyre District of Southwestern Lebanon. pic.twitter.com/5bkLI3UAbj\n— OSINTdefender (@sentdefender) July 27, 2024\n12:03 PM BST\nPictured: Israeli defence minister visits site of Golan Heights rocket attack\nYoav Gallant, the Israeli defence minister, visits a football pitch in the Golan Heights that was hit by a Hezbollah rocket attack on Saturday.\nThe strike killed 12 children.\nMr Gallant has vowed to “hit the enemy hard” amid frantic efforts to prevent a major escalation of the conflict.\n11:40 AM BST\nUS does not want escalation after Golan Heights rocket attack\nAnthony Blinken, the US secretary of state, said he does not want to see an escalation of conflict after an apparent Hezbollah strike killed 12 people in the Israeli-occupied section of the Golan Heights.\nThe US was in talks with Israel about the incident, Mr Blinken said, after Israel vowed that it would strike hard against Hezbollah in retaliation.\nHe said: “We’re in conversations with the government of Israel. And again, I emphasise its right to defend its citizens and our determination to make sure that they’re able to do that.\n“But we also don’t want to see the conflict escalating. We don’t want to see a spread. That has been one of our goals from day one, from October 7 on, and we’ll continue to do that.”\n10:54 AM BST\nLebanon asks US to urge restraint from Israel\nLebanon has asked the US to urge restraint from Israel after a Hezbollah rocket attack on a town in the Golan Heights killed 12 people.\nAbdallah Bou Habib, Lebanon’s foreign minister, said that a significant Israeli attack on Lebanon would lead to a “regional war”.\nThe foreign minister went on to say that the US had asked the Lebanese government to request that Hezbollah show restraint as well.\nHezbollah, which is backed by Iran, has significant influence within Lebanon. The group holds seats in the Lebanese parliament and its armed wing is believed to be stronger than the Lebanese army.\n10:38 AM BST\n‘You abandoned us for nine months and now you’re here’\nMourners at a funeral for children killed in Saturday’s Hezbollah rocket strike on the predominantly Druze town of Majdal Shams have reacted angrily to the presence of Israeli ministers, local media reports.\nAccording to The Times of Israel, people at the funeral accused the ministers of having “no shame” and of abandoning the community to months of Hezbollah strikes.\n“You abandoned us for nine months and now you are here?” a man was reported to have shouted at economy minister Nir Barkat and environmental protection minister Idit Silman, which was met by applause from the crowd.\n“You have no shame. A boy went to play football and didn’t come home,” the man added.\n“Get him out of here! We don’t want him!” Another mourner told Bezalel Smotrich, the Israeli finance minister.\n10:08 AM BST\nHezbollah denies that it carried out rocket attack\nHezbollah has denied that it carried out Saturday’s rocket attack on a predominantly Druze town in the Golan Heights that killed 12 people, saying it had “absolutely nothing to do with the incident, and categorically denies all false allegations in this regard”.\nIsrael has rejected Hezbollah’s claim that it was not responsible for the attack.\n“Contrary to its denials, Hezbollah is the entity that is unequivocally responsible for yesterday’s massacre,” Israel’s foreign ministry said.\n“The rocket that murdered our boys and girls was an Iranian rocket and Hezbollah is the only terror organization which has those in its arsenal,” it added.\nAn Israeli military spokesperson earlier said that forensics showed the rocket was an Iranian-made Falaq-1. Hezbollah had announced firing a Falaq-1 missile on Saturday, saying it had aimed at an Israeli military headquarters.\n09:52 AM BST\nChildren killed in suspected Hezbollah rocket attack named\n11 of the 12 children killed in what is believed to have been a Hezbollah rocket attack on a football pitch in the Golan Heights have been named by Israeli media.\nThe victims were Alma Ayman Fakher Eldin, 11; Milad Muadad Alsha’ar, 10; Vinees Adham Alsafadi, 11; Iseel Nasha’at Ayoub, 12; Yazan Nayeif Abu Saleh, 12; Johnny Wadeea Ibrahim, 13; Ameer Rabeea Abu Saleh, 16; Naji Taher Alhalabi, 11; Fajer Laith Abu Saleh, 16; Hazem Akram Abu Saleh, 15, and Nathem Fakher Saeb, 16.\nThe attack took place in the town of Majdal Shams, which is home to a large Druze community, on Saturday.\nThe Israeli military said that the rocket was an Iranian-made Falaq-1 with a 53 kilogram warhead.\n09:45 AM BST\nUS officials have ‘no doubts’ that Hezbollah carried out deadly rocket strike\nUS intelligence officials have no doubts that Hezbollah carried out a rocket strike on a football pitch in the Israeli-occupied sector of Golan Heights that killed 12 young people, US media reports.\nIt was not clear whether the terror group intended to hit the pitch or if the strike was the result of a rocket misfiring, an anonymous US intelligence source said.\nThe strike hit the Druze village of Majdal Shams in the Israeli-controlled part of the Golan Heights.\nA local in the village told The Telegraph the attack was “horrible”, with dead children lying on the football field. Idan Avshalom, a rescue worker from the MDA emergency unit in Israel, witnessed “severe scenes of casualties and fatalities, destruction, and burning objects” on the soccer field.\n09:38 AM BST\nPictured: Israeli Druze women mourn after deadly suspected Hezbollah rocket strike\n09:35 AM BST\nThousands gather for funeral of young people killed in Golan Heights strike\nThousands have gathered for funerals of young people killed a suspected Hezbollah rocket attack on a football pitch in the Golan Heights, Israeli media reports.\nThe rocket barrage killed 12 people, including three children, and wounded 29 others, making it the deadliest single attack in Israeli territory since Oct 7.\nThe IDF said Hezbollah was behind the strike, which hit the Druze village of Majdal Shams in the Israeli-controlled part of the Golan Heights.\nIsraeli aircraft have carried out retaliatory attacks against Hezbollah, hitting weapon depots and other infrastructure in south Lebanon.\nעצב כבד במג'דל שמס: מאות בני אדם צועדים ונפרדים בדברי שבח מ-12 הילדים שנרצחו >>@einavkerner pic.twitter.com/eUAgycxqj6\n— גלצ (@GLZRadio) July 28, 2024\n09:30 AM BST\nWelcome to our live coverage\nWelcome to our live coverage. We’ll be providing updates as Israel strikes Hezbollah in Lebanon after a deadly rocket attack on a football pitch in the Golan Heights that it says was carried out by the terror group.",
  "word_count": 4568,
  "scraped_at": "2026-02-14T13:01:36.306355"
}