{
  "article_id": "e339e4103c1a",
  "url": "https://cartilagefreecaptain.sbnation.com/2023/5/15/23723879/tottenham-hotspur-transfer-news-rumors-dejan-kulusevski-loan-option-obligation-doubts",
  "title": "Stop worrying about Dejan Kulusevski loan - Cartilage Free Captain",
  "date": "20230515T173000Z",
  "domain": "cartilagefreecaptain.sbnation.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "OK, admittedly there’s a LOT of options if you’re a Tottenham Hotspur fan looking for something to freak out about. Pick one: the lack of a manager, the lack of a women’s team manager, the lack of a director of football, Harry Kane’s contract, not much connection between the academy and the first team, a rudderless team adrift in a sea of misery, etc. That’s a lot! It’s no wonder Spurs fans are grumpy!\nStop worrying about Dejan Kulusevski’s loan\nIt’s going to be fine.\nBut one thing you probably don’t need to worry about is Dejan Kulusevski. Last week a few spurious rumors, originating in the Italian media and amplified beyond all reason by context-free aggregator accounts, suggested that Tottenham were considering not making Deki’s loan permanent this summer after all. Deki was brought to the club by now-departed DoF Fabio Paratici a year and a half ago on what was essentially an 18 month loan with a purchase obligation of €35m should Spurs qualify for the Champions League this season. Well, they didn’t do that, and there were breathless reports that Spurs might opt not to go through with the purchase. Ryan Mason’s recent offhand comments in a post-match presser about not knowing about his status and that “he’s considered a Tottenham player” didn’t help matters.\nIt doesn’t sound like there’s much to worry about. According to Gazzetta dello Sport (via Sport Witness), this whole kerfluffle is because Tottenham’s purchase obligation has been converted to a purchase option instead due to their failure to finish top four. Which yes, technically means that they could walk away from the deal if they so choose sending Deki back to Juventus.\nBut they won’t do that. All that really means is that now Tottenham get to bargain with Juventus over the terms of his full purchase price. Juventus clearly doesn’t want Deki back — it’s why they sent him to Spurs in the first place! — and this actually provides an opportunity for Tottenham to see if they can negotiate Kulusevkski’s price down to something a little lower.\nAnd before you start yelling at Daniel Levy, this is actually quite normal. Player purchase options and other clauses are often retroactively renegotiated based on various conditions. Look at Marcus Edwards — Spurs have renegotiated his then-50% sell-on clause a couple of times over the years, most recently waiving a portion of it as part of the negotiations to purchase Pedro Porro from Sporting this January.\nThe Gazetta report states that there isn’t a ton of competition for Kulusevski’s services at the moment, and Juventus is actually afraid that some of their loan players might come back to them instead of being sold permanently. It’s quite likely that Spurs will be able to talk the €35m down a bit before all is said and done, because it’s in Juventus’ interest to do so. I have zero doubts that Dejan Kulusevski will be a Tottenham Hotspur player — in full — by the time the new Premier League season kicks off in August, and probably for cheaper than initially thought. Wouldn’t that be a win?",
  "word_count": 521,
  "scraped_at": "2026-02-14T12:01:21.908545"
}