{
  "article_id": "e38c028e321d",
  "url": "https://weaintgotnohistory.sbnation.com/chelsea-fc-women/2023/1/10/23548191/official-melanie-leupolz-extends-chelsea-contract-until-2026-wsl",
  "title": "Official : German midfielder Melanie Leupolz extends Chelsea contract until 2026",
  "date": "20230110T174500Z",
  "domain": "weaintgotnohistory.sbnation.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Chelsea FCW have been in Spain for a warm-weather training camp before returning to action versus Arsenal this Sunday, and one very welcome surprise was having Melanie Leupolz along with the team and in training gear.\nOfficial: Melanie Leupolz extends Chelsea contract until 2026\nAfter long covid and pregnancy, Melly is back, and not going anywhere\nThen Leupolz and Chelsea decided to one-up themselves by announcing a contract extension, keeping the midfielder at Chelsea until 2026.\nLeupolz had been away from the team since the start of 2022 as she was reportedly struggling with long covid, then was out indefinitely after announcing her pregnancy. Thirteen weeks ago Leupolz posted “Our newest Blue has arrived” on her Instagram account with a photo of her pushing a stroller.\nPrior to her absence, Leupolz had settled in and showed her quality with the team. She offered classic central midfield play that Chelsea sorely needed. She played an integral role in Chelsea’s capture of the league title in 2020-21, playing in 19 games, starting in 17. Prior to her absence, she made 7 appearances, 6 starts in 2021-22.\nGiving birth and returning to top flight football is a long road with very different challenges. Torn ligaments and broken bones heal or are surgically repaired then rehabilitated, but returning from pregnancy is a varied road. In a video accompanying her signing, Leupolz credits Chelsea’s work with her through her pregnancy and after as one of the key reasons she extended her contract.\n“So completing this journey, especially in women’s football, but I’m proud that I can do both and get a lot of support from the club. That’s also a big point why I signed again for Chelsea. That’s why it wasn’t a big choice to make, I just knew I want to stay here at this club.”\n-Melanie Leupolz; source: Chelsea FCW\nBecoming a mother is important for some players, and providing the support to allow them to do that without sacrificing the rest of their careers is important. It should be the standard, but it isn’t yet.\nChelsea have an exceptional track record in working with players through a multitude of recoveries. Fran Kirby was given the time and support to recover from pericarditis, marquee signing Lauren James required time and support to fully heal and build up from injuries, and now Melanie Leupolz in her return after pregnancy.\nOne of the reasons Chelsea remains patient with recoveries is because the standard is high, and the ambitions are higher. When players are ready, they return to the pitch on absolute fire. Fran Kirby had a career year during her return and James has re-introduced herself to the WSL and is already one of its most technically skilled and fun players to watch.\nWhen Melanie Leupolz is ready to return to match action, expect it to be well worth the wait. Until then, tide yourself over by rewatching this ridiculous strike.",
  "word_count": 487,
  "scraped_at": "2026-02-14T12:21:40.965603"
}