{
  "article_id": "e3b843aa039b",
  "url": "https://www.nytimes.com/athletic/6263501/2025/04/09/lucas-bergvall-tottenham/",
  "title": "How Lucas Bergvall went from the bench to Tottenham trusted  lump  in just a few months",
  "date": "20250409T181500Z",
  "domain": "nytimes.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Lucas Bergvall’s first appearance for Tottenham Hotspur nearly ended in disaster.\nDuring the opening fixture of the season, Spurs were drawing 1-1 at Leicester City and the then-18-year-old midfielder came off the bench with 12 minutes remaining.\nTowards the end of the game, Bergvall lost possession deep in his own half, leading to Guglielmo Vicario tipping Wilfred Ndidi’s header, which would have given Leicester a 2-1 lead, around the post. Vicario was incensed by Bergvall’s carelessness and charged up to him, screaming at the teenager.\nAdvertisement\nAny Spurs fan watching could be forgiven for thinking it would be a while before their young summer signing would establish himself as a first-team regular.\nEight months later, Bergvall has become integral to Ange Postecoglou’s starting XI. He is technically gifted and superb at wriggling out of tight spaces, but he works hard off the ball, too. In last week’s 1-0 defeat by Chelsea at Stamford Bridge, supporters booed Postecoglou’s decision to take him off in the 64th minute for Pape Matar Sarr.\nAfter slowly settling into life in north London, Bergvall has been one of Spurs’ best players this season and will play a crucial role in the Europa League quarter-final against Eintracht Frankfurt.\nTottenham technical director Johan Lange and chief scout Rob Mackenzie flew to Stockholm in January 2024 on a mission to persuade Bergvall to leave Swedish top-flight side Djurgarden.\nBergvall and his family were impressed by their presentation, which highlighted his strengths and weaknesses. A couple of weeks later, Bergvall travelled to London and was given a tour of the training ground, meeting Postecoglou and chairman Daniel Levy.\nOther clubs, including Barcelona, Newcastle United and Thursday’s opponents Frankfurt, were interested in signing him too. Bergvall’s family visited Barcelona and listened to a pitch from their sporting director, former Barca and Portugal midfielder Deco.\n“We were eating in the mountains with Deco, we looked outside and there were 150 people trying to get in,” Bergvall told The Athletic last May. “We got into a taxi, drove into the city and they were following us. We got into a garage and switched cars.\n“It was a crazy day. I came home and needed to decide, but my gut feeling was always Tottenham. They play really good football and it’s fun to watch.”\nBergvall agreed to join Spurs from Djurgarden on a five-year contract in February 2024 but did not officially arrive until pre-season.\nAdvertisement\nEncouraging pre-season performances from Bergvall and fellow 18-year-old summer signing Archie Gray softened the blow of Spurs missing out on more experienced midfield targets Conor Gallagher and Jacob Ramsey. The internal belief was that Bergvall and Gray were ready to be thrown into the Premier League straight away. They both made an appearance off the bench against Leicester in August but had to wait until December for their first starts in the competition.\nBergvall’s performances were mixed during the first half of the campaign. His first involvement after coming off the bench in September’s 3-0 victory over Manchester United at Old Trafford was to whip in the corner from which Dominic Solanke scored the third goal. He started five out of Spurs’ eight league-phase games in the Europa League, but those early performances gave the impression he was not yet quite ready to compete regularly against the very best.\nHe has been booked eight times in 40 appearances this season and at times, it has felt like he could not cope with the speed and physicality of English football. He would confidently charge into tackles, expecting to win the ball, only to wipe out his opponent.\nIn November, a bruising defeat against Galatasaray in front of a raucous crowd in Istanbul felt like a Sliding Doors moment. Bergvall looked lost and was constantly shrugged off the ball by stronger, older players but Postecoglou insisted the experience would benefit his development. Stepping up from Sweden’s top flight was always going to be difficult in such a short time, and the entire team struggled that night against Galatasaray. Bergvall’s vast potential was clear but he was only showing flashes of it.\nWhen Bergvall becomes frustrated or feels like he has a point to prove, he can be guilty of trying to do too much. The best example was in January’s 3-0 victory over Elfsborg. Postecoglou berated Bergvall on the touchline in the opening 10 minutes for attempting over-elaborate passes.\n“He is 18 and he is such an exciting player,” Postecoglou said afterwards. “Like all young players, he made a couple of mistakes early on and wanted to atone for those mistakes. He dug himself a bit of a hole where he was trying to do things a little bit too complicated. I just gave him the message to settle down and keep the game simple. Get his rhythm back.\nAdvertisement\n“Even when he is making those mistakes, he just works awfully hard and keeps running. It’s such a great asset to have. Probably in his mind it was a big game for him, playing against a club from his own country. That’s the reason we are exposing these guys.\n“The more experiences they have like that, the better they will be able to deal with them further down the track.”\nBergvall made his first league start in a 5-0 victory at Southampton at the base of midfield. It is a role he had been groomed for in training and he took notes on how Yves Bissouma and Rodrigo Bentancur approached the position. He took part in a special individual drill before kick-off with assistant coaches Mile Jedinak and Nick Montgomery to test his control under pressure.\nBergvall impressed against Southampton but he was still waiting for, and needed, a truly breakout moment. It arrived a few weeks later in controversial circumstances in the first leg of the Carabao Cup semi-final tie against Liverpool. Bergvall produced an excellent performance for the first hour and nearly set up Pedro Porro when he chased Cody Gakpo’s backpass to Alisson and robbed Liverpool’s goalkeeper.\nThen, the teenager’s inexperience took over. He was booked for a tackle on Luis Diaz and, a few minutes later, lunged at Ryan Gravenberch right on the touchline. Had Bergvall made contact with the Netherlands international, he would have surely been sent off.\nHe refused to learn his lesson and in the 84th minute, Bergvall wiped out Kostas Tsimikas when Liverpool counter-attacked but the referee played the advantage. Sixty seconds later, Solanke set up Bergvall to score the winner. Arne Slot and Virgil van Dijk went berserk while Liverpool’s assistant, Sipke Hulshoff, was booked for complaining. Bergvall darted past reporters after the game with his hood up, eager to avoid any awkward questions about whether he should have been on the pitch.\nThe Sweden international may not have been able to truly appreciate it at the time but there is no denying that it was a statement performance. Since then, he has started eight out of Tottenham’s 11 league games, replacing Bissouma at half-time on the three occasions he did not start. It was a switch that worked perfectly in the 2-2 draw with Bournemouth, as Bergvall assisted Sarr’s strike. He has usurped Bissouma, Mali’s captain, in Postecoglou’s pecking order and has been trusted more than Sarr recently. In total, he has played 1,072 minutes across 24 league appearances.\nAdvertisement\nTottenham’s domestic form has been awful and their season is drifting, which means Bergvall’s involvement in the Europa League is a better indicator of his importance. He started both legs of their 3-2 aggregate victory over AZ in the round of 16 and it would be a genuine shock if he did not start against Frankfurt. The lowest point in Bergvall’s debut season was the own goal he scored in the first leg against AZ when he tried to clear the ball from a corner but it bounced off his shin into the net. It speaks volumes about Bergvall’s character and mentality that, after that moment of poor fortune in the 18th minute, he was the only source of inspiration for Spurs in a miserable 1-0 loss.\nWhile Dejan Kulusevski recovers from a foot injury, Postecoglou’s first-choice midfield appears to be Bergvall, Bentancur and James Maddison. When Kulusevski is fully fit, Maddison is more likely to drop out than Bergvall. Maddison and other senior players, including Solanke and Son Heung-min, can produce game-changing moments but the only player who has matched Bergvall’s consistency in 2025 is full-back Djed Spence.\nBergvall’s ability to quickly drive Spurs up the pitch is crucial. He is fifth for take-ons attempted per 90 minutes (4.7), out of all central midfielders who have played at least 900 minutes in the Premier League this season, and has the fourth-highest average carry distance (six yards). The calibre of the players above him in the latter metric — Kulusevski (7.6), Manchester City’s Bernardo Silva (6.5) and Arsenal’s £105million ($134m at current rates) club-record signing Declan Rice (6.2) — is another indicator of his quality.\nBergvall suffered from a virus during the March international break that forced him to miss both of Sweden’s fixtures and it is why Postecoglou took him off early against Chelsea. Postecoglou believed Bergvall “didn’t look himself physically” and lacked “running power”, but it did not prevent the midfielder from embarking on a couple of runs where he slalomed in between Chelsea players.\nBergvall is second in the league among central midfielders, behind Bentancur, for interceptions per 1,000 opposition touches, highlighting his all-round ability. But Bergvall’s evolution into a No 6 presents Postecoglou with an awkward dilemma. Gray has played the majority of his minutes this season at centre-back or full-back but covets a role in midfield. The England Under-21 international earned his first start in that position in the 2-0 defeat by Fulham. Gray displayed good defensive awareness but was, understandably, conservative in possession, which should change with more exposure to the role. Gray and Bergvall only played together in midfield for around 15 minutes at the start of the second half until the former dropped into defence. The goal must be to have them start together and interchange positions when required.\nUnsurprisingly, Bergvall’s closest friend at Spurs is his international team-mate Kulusevski. They grew up in the Swedish capital and started their careers at Brommapojkarna along with Spurs Women centre-back Amanda Nilden. Bergvall was close friends with Nilden’s younger brother, Charlie, when they were in Brommapojkarna’s academy together. Kulusevski has become a mentor for Bergvall and they are rarely spotted without each other.\nThe first time they met was when Bergvall visited Juventus’ training ground during Kulusevski’s three-year spell with the Italian side. Kulusevski looked after Bergvall and invited him to his apartment afterwards. They remained in touch and Bergvall spoke to Kulusevski before he committed to Spurs. They spend time with each other away from the training ground and on international duty, play the role-playing game Mafia, which is sometimes called Werewolf and partially inspired the hit BBC television show The Traitors, with their team-mates.\nAdvertisement\n“He’s doing great,” Kulusevski said in January before Spurs faced Elfsborg. “It’s fantastic for him at that age to play so much. He’s had great performances, especially against Liverpool. I’m very proud of him and I’m trying to teach him. He’s learning and developing every day.”\nThe biggest influence Kulusevski has had on Bergvall is in the gym. When Tottenham’s squad work out before training, Kulusevski is always the last person to leave as he runs through extra sets. Bergvall was lean and lithe when he arrived at Spurs last summer but he looks stockier now.\n“I don’t think he’s left (Kulusevski’s) side since he’s been here and Deki (Kulusevski) is in the gym all the time,” Postecoglou said last month. “He’s a great role model for him and if nothing else, Deki has forced him to get in there and work hard on his game.\n“He’s also an outstanding technical player. His technical proficiency is still his greatest asset. He’s growing, you’ve got to remember he’s only just turned 19. He’s still a very young man and if he keeps building up physically as well, to the standard you need in the Premier League, particularly in that midfield position, if you have that physical ability and that technical proficiency, then you’ve got a decent player on your hands.”\nIt is this physical transformation that led to Maddison describing him as a “lump”.\n“Lucas is a fantastic talent and you can sometimes forget how young is he,” Maddison said in an interview for Tottenham’s website after the second leg against AZ. “I misinterpreted him as a player. I thought he was more of a between-the-lines, technical player but he is actually a bit of a lump.\n“He gets about. He is a big boy. He is powerful. He is technically very good. The (deeper) No 6 role suits him because he can drive forward and he is learning the discipline under this gaffer of what it takes to be a No 6. He is getting better game by game.”\nAdvertisement\nWhen The Athletic watched Bergvall play for Djurgarden against Elfsborg last year, his father, Andreas, suggested his son may need an extended adaptation period. “It’s a five-year contract but we talked about this as a two-year project,” Andreas said. “He has to be patient, listen and adapt. I don’t think he expects to play right away but he will do everything in his power to do that.”\nBergvall still has a long way to go to fulfil his potential but the progress he has made over the last 12 months has been remarkable.\nAdditional reporting: Conor O’Neill\n(Top photo: Catherine Ivill/Getty Images)",
  "word_count": 2276,
  "scraped_at": "2026-02-14T12:53:47.995463"
}