{
  "article_id": "e3c44e5ee60e",
  "url": "https://metro.co.uk/2025/03/31/everything-know-euromillions-winner-previous-winners-22821666/",
  "title": "Everything we know about the EuroMillions winner and about previous winners too",
  "date": "20250331T154500Z",
  "domain": "metro.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "The largest ever EuroMillions jackpot has been scooped by one lucky man in Austria.\nHe won £209,000,000 on Friday night after spending just €10 on online tickets, according to Austrian newspaper Kronen Zeitung.\nThe man’s identity hasn’t been revealed and it’s not yet clear if he’s chosen to remain anonymous.\nMany jackpot winners do, although UK couple Joe and Jess Thwaite, who won the fifth largest amount, €215 million (around £184 million at the time) in May 2022, did go public.\nThey said they didn’t want to burden friends and family with such a big secret.\nSign up for all of the latest stories\nStart your day informed with Metro's News Updates newsletter or get Breaking News alerts the moment it happens.\nMore about the Thwaites and others who have gone public\nJoe was 49 at the time of the win and working as communications sales engineer and Jess, was 44 and a business manager of a hairdressing salon.\nThe parents-of-two, from Gloucestershire, said the phenomenal win ‘gives us time to dream which we haven’t had before’.\nTheir first purchase was a chest of drawers and a wardrobe for their bedroom – but they said their number one priority was supporting family members after a ‘hard few years, just like many people and families across the country’.\nJoe said he normally bought a EuroMillions Lucky Dip ticket ‘because it’s easier’ and purchased the winning ticket on The National Lottery App.\nThey had no idea of the result until Joe woke up at 5.15am the next morning to tend to their dogs – and received an email saying ‘Good news, you’ve won a prize’.\nShowing extreme self control, Joe didn’t wake up his wife to share the news after seeing the nine-figure prize.\n‘I saw how much and I didn’t know what to do’, he said. ‘I couldn’t go back to sleep, I didn’t want to wake Jess up so I just laid there for what seemed like forever.\n‘I spent some time searching for property with no budget limit, which was a novelty!’\nWhen the alarm finally rang, Joe turned to Jess and said: ‘I’ve got a secret, I’ve got something to tell you.’\nHearing the news in disbelief, his wife thought he was joking, concluded that it wasn’t worth getting too excited about as it probably wasn’t true and got up to make a coffee.\nBut, after going about their normal morning routine, the pair called dedicated phone number when the lines opened at 8am and were told they had just become the UK’s then biggest-ever winners.\nWhile many of us would call our managers to say we weren’t coming in and crack out the champagne, Jess and Joe went about their normal day, doing the school run and settling down to work from home.\nUnable to keep the news in, Jess met her mum in a car park before work – with her screaming reaction bringing it home how life-changing the money would be and both breaking down in tears.\nThe couple have acknowledged their previous financial situation was ‘not horrendous’ but say the cost of living crisis had ‘affected our lives’.\nJess said: ‘Just like many people and families across the country, the last few years have been hard. My sister and I have tried to look after the business and the 20 staff, but times are difficult in hairdressing.\n‘Joe has been working hard and we have always tried to put everything into doing the best we can for the children.\n‘We’ve had one week to think about this and we now have time to share lots of experiences and go on adventures with our family and friends.’\nOne couple who scored a £115 million EuroMillions jackpot had given away more than half of their winnings to loved ones, charities and those in need during the coronavirus crisis within two years of wining.\nFrances Connolly wrote a list of 50 close friends and family to help as she was too excited to sleep on the night she and husband Patrick, 56, secured their fortune on New Year’s Day 2019.\nAlmost two years on, the pair had given away £60 million – extending their generosity to health workers on the Covid-19 frontline, care home residents, hospital patients and hundreds of other people.\nThe husband and wife, from Moira, County Down, vowed to not become part of the ‘jet set’ when they celebrated their win with a hug and a cup of tea.\nThey stayed true to their promise, laughing off the opportunity to live in a 15-bed stately home and deciding against flying first class to New Zealand to visit their daughter. They say they could have helped a young couple pay off a mortgage with the ticket price.\nAnother couple who went public with a EuroMillions win was Richard and Debbie Nuttall, from Colne, Lancashire.\nThey scooped £61.7 million share of a £123 million jackpot in January 2024.\nThey were in Fuerteventura celebrating their 30th wedding anniversary in January when an email from the National Lottery told them they had exciting news.\nMr Nuttall, a self-employed accountant, said when he checked his account online he saw a win of £2.60.\nHe said: ‘So I went through to Debs and I said we’ve won £2.60 on the lottery and she was like: “Woohoo, we’ll go and have a bacon butty or something with that.”‘\nBut he later realised the £2.60 was from a win in November and when he logged in again later that day, after another email, he saw a figure of £61,708,231.\nHe tried to call the National Lottery from Fuerteventura but a bad signal in the Canary Island meant four calls kept cutting out.\n‘I’m thinking, “this is a scam, someone’s trying to extract information out of me inch by inch,”‘ he said.\nHe said: ‘Obviously we were stunned but also very excited at the time, it was almost like Del Boy and Rodney when they come out of Sotheby’s and they start cheering and punching the air, the car was rocking.’\nAnd in 2016 Sonia Davies, then 53, and her family won £61 million on the EuroMillions after she asked her daughter to buy tickets because she was ‘on a roll’ days after having a potentially deadly tumour removed.\nThe mum was in the US for the pioneering surgery when she called her eldest daughter, Stephanie, 23, back home in Wales, and asked her to pick up some tickets for the family syndicate and said ‘we’re on a winning streak’.\nStephanie bought six lucky dips with 40 minutes to spare before the deadline, and one of those turned out to be very lucky.\nAdmin assistant Sonia said: ‘I felt cured by the Friday and was a multi-millionaire by the evening, it was just unreal.’\nWhat have EuroMillions winners bought in the past?\nIn the past, people who have gone public with lottery wins have chosen to spend their cash on new houses, cars, holidays and on their family and friends.\n‘The people who spend the money too quickly are a very, very small percentage,’ Andy Carter, who was a Senior Winner’s Advisor at former Lottery owners Camelot, previously told the Metro.\n‘The vast majority of winners are very conservative – they have been blessed with a huge amount of money and they want to protect it.’\nCan winning the lottery bring more misery than joy?\nAlthough many winners, like Andy said, are careful with their money history has a fair few examples of winners who haven’t been so cautious and their lives have taken a turn for the worse as a result.\nSome studies suggest lottery winners in the US are more likely to declare bankruptcy within three to five years compared to the average citizen.\nAround one-third find themselves in financial trouble – and it does not end there.\nThe pressure may force someone to spiral into depression, and lead to alcohol and drug abuse and problems with family and friends.\nOne such example in the UK is Michael Carroll, a bin man who won £9,700,000 on the National Lottery in 2002 – but declared bankruptcy nine years later.\nDubbed the ‘Lotto lout’, he gave £4 million to friends and family, including £1,400,000 to his wife Sandra Aiken.\nBut shortly after the couple wed in 2003, she decided she had had enough.\nOver the next few years, Carroll appeared in court more than 30 times while a mansion he bought in Norfolk fell into a state of disrepair.\nHe has admitted he wasted millions on cocaine, gambling, prostitutes and drinking two bottles of vodka a day.\nBy 2013, Carroll was broke and homeless, so he returned to Scotland and worked in a biscuit factory and then a slaughterhouse before landing a job as a coal man.\nThen there’s Adrian and Gillian Bayford, who won £148,656,000 in August 2012, but are no longer married.\nGillian now has a conviction for threatening her ex-boyfriend, domestic abuse charity worker Gavin Innes, who she pushed and shouted at in 2017.\nShe then married convicted fraudster Brian Deans, before ditching him because he begged for more and more money after blowing the monthly allowance she gave him on cars, watches and trips with friends.\nAdrian, meanwhile, turned to eating 50 Cornish pasties a day to cope with loneliness after being dumped by younger women, one of whom he dated while sending saucy messages to an ex.\nAnother jackpot winning couple to divorce after scooping big was Colin and Chris Weir, who won £161.6 million in 2011.\nThey split up some months before Colin died of sepsis and an acute kidney injury in December 2019, at the age of 71.\nBy then he had spent half his £80million share of the fortune on cars, property and a controlling stake in his favourite football club, Partick Thistle.\nThe former TV cameraman also donated millions to the Scottish National Party and the pro-independence Yes campaign ahead of the 2014 referendum.\nWhat actually happens when you win the EuroMillions?\nIf you find yourself in the almost impossible-to-imagine situation of having a winning lottery ticket, the first thing to do (once you’ve finished screaming into a pillow or jumping up and down) is to turn the ticket over and find the phone number to ring.\nAndy explained: ‘If you were to win the EuroMillions tomorrow night, you would check the ticket, ring the number on the back of the ticket and that would put you through to a lottery line. They would then get a member of my team to call you back.’\nThis first phone call to the National Lottery call centre is important, because it sets in motion the crucial steps that all lottery winners must follow to claim their prize.\nHow does the National Lottery contact winners?\nFrom the moment you realise you’ve won to actually getting the money, winners are looked after every step of the way by a dedicated team of National Lottery ‘Winner’s Advisors’ like Andy.\nIt is their job to support winners through the entire process so they can begin to enjoy their life-changing win.\nAndy, or one of his advisor team members, will call lottery winners back as quickly as possible once they receive news that a EuroMillions prize has been claimed.\nAfter the initial phone call with the winners’ advisor team, Andy or one of his colleagues will visit the winner, in person.\nIdeally, you’ll get a visit the next day, or failing that as soon as the winner can allow.\nHow long after winning the lottery do you get your money?\nDuring the home visit by the Winners Advisory team, a number of checks will be carried out to verify the winner.\n‘Within half an hour I can tell if someone has won the money,’ Andy revealed.\nAs well as checking the winning ticket is legit,the advisory team are there to answer any questions that the winners may have and, as you can imagine for someone who has just become a (sometimes multi) millionaire, they have more than a few.\n‘Sometimes we get to people’s houses and we don’t even open the computer for an hour because we just sit there and answer people’s questions,’ Andy said. ‘This could sometimes last all day.’\nAs soon as the winning ticket is verified and the ID of the winner confirmed, the Lottery can pay the winner their money on that very day.\nHowever, once the money is paid into an elected bank account, it takes two days for the money to process before it can be withdrawn.\nThis means that the longest you have to wait before getting the money is around three days between discovering you’ve won the lottery and actually being able to spend the cash.\nWhere do lottery winners put their money?\nWinners have no choice but to have their winning sum deposited in one, single bank account by the Lottery – so there’s no stuffing it under your bedroom mattress or locking it in your personal safe.\nThe winner can choose the bank they would like to hold the money with, but a brand new account with that bank is set up – usually with a private arm of that bank who specialise with dealing with large sums of money of this kind.\nThis bank account can be open for as long as the winner needs it to be, or they can move the money to other accounts once it has cleared after a couple of days.\nCan EuroMillions winners remain anonymous?\nYes and as we mentioned earlier, many people choose not to go public.\n‘All winners are anonymous,’ Andy confirmed, ‘This is the default position for all lottery winners.’\nAndy also impresses that any publicity surrounding a winner is a personal choice and there is no set media schedule – every winner is different.\n‘It’s entirely the winner’s decision if they want to share news of their win. We have an aftercare programme in place to ensure that all winners have access to legal and financial advice.\n‘Sometimes we go to a winner’s home and we’ve already had media enquiries before we even get there because the winner wants to celebrate their win and mark it publicly,’ Andy explained.\n‘Often the rule of thumb tends to be the higher the amount of money the more likely the winner will be to take publicity.’\nHowever, if a winner does choose to keep their newfound wealth a secret, then Andy and his team are the only ones to know about the win.\nHe says: ‘It’s often the case that when a winner decides to remain anonymous, we are the only people that know about their win so we keep in touch with them for as long as they want to. Often they like to talk to someone or just let us know what they have been up to.’\nIs your spouse entitled to your lottery winnings?\nWhen it comes to the decision to keep a lottery win a secret or tell the whole world, you’d think that either way, one of the people to definitely be in the loop would be the winner’s partner or spouse.\nBut, should you want to keep your newfound wealth entirely to yourself, the National Lottery certainly isn’t going to tell you otherwise.\n‘A National Lottery win belongs to the signatories of the relevant validation paperwork. How a winner(s) chooses to share (or not) winnings is their personal decision,’ Elanor Corbett, PR Executive at The National Lottery confirmed to Metro.\nAre EuroMillions winnings taxable?\n‘There is no tax on the win itself, but if the win produces an income through interest, then that will be taxed as part of your normal income tax,’ Andy explained.\nDoes EuroMillions money go to charity?\n‘The only way the EuroMillions jackpot would go to National Lottery Good Causes is if the jackpot is won in a draw but, for whatever reason, the ticket-holder does not then subsequently come forward to claim,’ Elanor told us.\n‘Unclaimed prizes have a maximum of 180 days to be claimed from the date of the winning draw. After that, the money plus the interest it has generated whilst it is held in trust, is passed over to National Lottery Good Causes.\n‘Each week, The National Lottery raises around £30 million for Good Causes because every time a National Lottery ticket is bought a proportion of the ticket sale automatically goes to National Lottery Good Causes.’\nWhich countries have had the most EuroMillions winners?\nPerhaps unsurprisingly, out of the nine countries that take part in the lottery, those with the highest populations have the largest number of jackpot winners over the years.\nMore Trending\nThe UK, with a population of almost 67 million, tops the table with 132 jackpot winners since the contest started in 2004, while France, which has a population of around 66.6 million, follows closely behind with 130 winners.\nSpain, with a population of 49 million, comes third with 122 winners.\nPortugal, meanwhile has had 86 winners, Belgium 45, Switzerland 26, Ireland 19 and the tiny country of Luxembourg, 4.\nGet in touch with our news team by emailing us at webnews@metro.co.uk.\nFor more stories like this, check our news page.\nMORE: Someone’s won $349,000,000 on the Mega Millions lottery and doesn’t even know it\nMORE: Full list of countries with most EuroMillions winners after £209,000,000 jackpot scooped\nMORE: Full list of biggest Lottery winners after someone wins £209,000,000 EuroMillions jackpot",
  "word_count": 2908,
  "scraped_at": "2026-02-14T13:32:31.745167"
}