{
  "article_id": "e3ce7addc3fd",
  "url": "https://www.express.co.uk/news/royal/1804390/royal-family-recovery-mode-prince-harry-spt",
  "title": "Royals in recovery mode post - Harry but have had  stellar win this summer",
  "date": "20230822T054500Z",
  "domain": "express.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Royal Family in recovery mode after tough patch — but have had 'stellar wins' this summer\nA royal expert has said the Firm has had some great moments this summer from the King's \"bromance\" with the US President to the Princess of Wales stealing the show at Wimbledon.\nPrincess Kate celebrates six months of the 'Shaping Us' campaign\nThis summer, the Royal Family have had several “stellar wins”, a royal expert has said.\nRoyal author and historian Dr Tessa Dunlop said the likes of King Charles meeting with President Joe Biden to the Princess of Wales’s appearances at Wimbledon have been successful moments for the Firm.\nThe past year has been turbulent for the Royal Family with Queen Elizabeth’s death rocking the institution — and the country — followed by the Sussexes releasing their Netflix docu-series Harry & Meghan and Prince Harry publishing his bombshell memoir Spare in January.\nIt has been a busy few months too. The Coronation and the Trooping the Colour took place within quick succession with there being several firsts for the Monarch and several of the royals.\nBut the author of the 2022 work Elizabeth & Philip believes that some specific events this year have helped the “magic” of the institution shine.\nKing Charles III Quiz: How well do you know the new monarch?\nKing Charles III will be crowned alongside his wife Camilla, Queen Consort, at Westminster Abbey on May 6, 2023.\nFrom his time at the University of Cambridge to his favourite type of tea, we’ve collected facts about the King which might surprise you.\nTest your knowledge and see how many you can get right in this royal quiz.\nSpeaking to American royal commentator Kinsey Schofield on the To Di For Daily podcast, Dr Dunlop said: “I thought it was really clear this summer where there were a couple of stellar wins for the Royal Family.\n“And one was King Charles albeit it very briefly but hosting your President Biden in Windsor Castle, the bromance moment, the arm on the shoulder, the Welsh first guards, the military music, the sunshine, this was optics of state.\n“This was the magic, the tinsel of Monarchy that America buys into, that Britain does well, that Harry left.”\nWhen the President visited the King last month, Mr Biden was seen patting Charles’s back with the pair laughing and chatting as they made their way around the quadrangle at Windsor before discussing climate change.\nAfter meeting with the Prime Minister, the US President headed to Berkshire where they inspected the Welsh Guards. The last time the pair spoke formally was at the COP26 climate summit in Glasgow two years ago.\nDr Dunlop, speaking in early August, continued that despite the number of celebrities — including the likes of Daniel Craig and Brad Pitt — attending Wimbledon this summer, Kate outstripped them all.\nShe said: “I would say whatever Meghan’s narrative has been, the takeaway from this summer is Kate Middleton, or Princess of Wales… outbox officing every Hollywood star at Wimbledon.\n“Can you even remember the names of the winners of Wimbledon? Because actually Kate was such a runaway success. And I think that we have to own when you’re part of the Royal Family, the building bricks that come with the institution means that you are greater than the sum of your parts.”\nDon't miss: King Charles's charity will face no further action over cash-for-honours scandal\nDon't miss: King Charles's fears over brother Andrew are a bigger problem than Sussexes\nDon't miss: Princess Kate wore random outfits while ‘partying in London in the 2000s’\nThe Princess, who is a huge tennis fan and patron of the All England Lawn Tennis and Croquet Club, was seen at SW19’s famous court three times this summer.\nAlthough there may have been “wins” for the royals earlier this summer, Prince William has come under fire in the past week as he failed to attend the Women’s World Cup final and see the Lionesses go head to head and ultimately lose against Spain in Australia.\nSports broadcaster Gabby Logan joined many others in expressing her “disappointment” that the future King, who is president of the Football Association, failed to head down under for the big game.",
  "word_count": 705,
  "scraped_at": "2026-02-14T13:04:28.377181"
}