{
  "article_id": "e3d6dc92aeb0",
  "url": "https://economictimes.indiatimes.com/news/international/world-news/have-irans-authorities-given-up-on-the-mandatory-hijab/articleshow/126059515.cms",
  "title": "Have Iran authorities given up on the mandatory hijab ? ",
  "date": "20251218T150000Z",
  "domain": "economictimes.indiatimes.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Listen to this article in summarized format\nUntil recently, such scenes would have been unthinkable in the Islamic Republic of Iran, whose strict dress code for women has required they wear the hijab in public since shortly after the 1979 revolution that ousted the pro-Western shah.\nBut while casually flouting the rule has become increasingly common, Iran's leadership insists the hijab is a legal obligation and is implementing a crackdown that has seen dissident figures who oppose the mandatory headscarf detained.\nThe tension has come at a critical moment for the clerical establishment, still recovering from the recent 12-day war with Israel and with supreme leader Ayatollah Ali Khamenei now 86.\nThe 2022-2023 nationwide protests, sparked by the custody death of Mahsa Amini who was arrested over alleged improper hijab, are still a recent memory.\nAnalysts and activists say authorities in recent months have indeed slackened off on imposing the mandatory hijab in daily life, but are far from abandoning an ideological pillar of the Islamic republic, warning a new wave of repression to re-impose it could come at any time.\nRoya Boroumand, cofounder and executive director of the US-based Abdorrahman Boroumand Center for Human Rights in Iran, said it was \"heartwarming\" to see images of women without the headscarf, calling it the result of social pressure from below rather than \"a reform granted from above\".\n\"What we see today is unquestionably the result of years of persistent civil disobedience by Iranian women and girls who have fought to carve out and defend a small space of freedom in public life,\" she told AFP.\nWomen sporting braids, curls and even bleach-blond locks have now become common sights in public, while more traditional women wear the hijab or chador.\nThe trend, which has grown more visible in recent months in Tehran and other major cities, now extends to all generations to varying degrees.\nSome women are also sporting tighter clothing and outfits that expose their shoulders, legs and midriffs, much to the dismay of conservatives who decry such \"nudity\" in public.\n- Hard to 'put the genie back' -\nBoroumand said enforcement of the mandatory hijab varied across the country and that authorities were still closing down businesses deemed to have failed to enforce the rule.\nAuthorities earlier this month arrested two people who organised a marathon event on Iran's Gulf island of Kish, viral images of which showed dozens of women running bareheaded through the streets. They also shut down a cafe that served as the start and finish point.\nArash Azizi, a postdoctoral associate and lecturer at Yale University, told AFP that \"the regime has given up on harshly enforcing mandatory hijab but it has not at all given up on it as a principle yet\".\n\"It would be a grand ideological concession that it is not prepared to make. We still see places closed down and even people fined and arrested due to lax hijab. But the regime knows that it will be very difficult to put the genie back in the bottle.\"\nOther recent incidents have also gone viral on social media: the grand opening of a mall in Tehran, for instance, saw young people dancing and swinging their arms to a DJ's beats.\nAnd a match this month in Iran's second football division was unusual not just for the presence of women -- albeit in a segregated area of the stadium -- but for the fact that many were bareheaded, brandishing scarves of the home team.\nEven the office of Khamenei, in power since 1989, came under fire last month from some ultraconservatives after it published in its newspaper a photo of Iranian woman Niloufar Ghalehvand, a pilates instructor killed during the Israeli attacks, wearing a baseball cap rather than hijab.\nA design week exhibition at Tehran University saw bareheaded women mingling freely amid boldly experimental art exhibits.\nBut it closed down early after objections from clerics in a sign of the authorities' readiness to hit back.\n- 'Very real risk' -\nHardline judiciary chief Gholamhossein Mohseni Ejei recently warned of a new crackdown, saying that intelligence agencies had been instructed to identify and report \"organised currents promoting immorality and non-veiling\", adding authorities would take action against those involved.\nKhamenei on December 3 defended the hijab in an address, saying Iranian women who respect Islamic dress \"can progress more than others in all areas and play an active role both in society and in her home\".\nNobel Peace Prize winner Narges Mohammadi, who had steadfastly refused to wear the hijab in public since her release from prison on medical grounds in December 2024, was arrested on December 12 along with dozens of other activists at a memorial ceremony for a lawyer who was found dead earlier this month.\n\"There is a very real risk of a renewed and harsher crackdown,\" said Boroumand.\nCampaigners warn that while the images of coffee shops and concerts can give the impression of freedom, repression has been cranked up in recent months in the wake of the war against Israel.\nThe arrest of Mohammadi was just the latest of a prominent dissident figure. There have also been more than 1,400 executions so far this year -- hundreds more than in 2024 -- and groups including the Bahai, Iran's biggest non-Muslim religious minority, are experiencing increased persecution.\n\"We are seeing an escalation of repression elsewhere, not a trade-off,\" said Bouroumand.\nThe mandatory hijab has been key to Iran's Islamic system and a response to what the authorities have traditionally termed \"Gharbzadegi\", or the \"West-toxification\" of Iran under the shah.\nBut the issue is a subject of division within the political establishment inside Iran, with less-hardline figures such as President Masoud Pezeshkian maintaining that women cannot be forced to wear the hijab.\n\"Khamenei insists on it but the future leadership of the regime, after he passes, will likely have to formalise what's already de-facto and give up on mandatory hijab,\" Azizi said.",
  "word_count": 989,
  "scraped_at": "2026-02-14T12:12:53.948554"
}