{
  "article_id": "e3e89c2f778a",
  "url": "https://www.90min.com/posts/who-will-win-wsl-title-2022-23",
  "title": "Who will win the WSL title ? ",
  "date": "20230423T151500Z",
  "domain": "90min.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Who will win the WSL title?\nThe 2022/23 WSL season has just over a month left to go and is close to impossible to predict at both ends of the table, with four teams still in with a chance of the title and four others separated by only two points at the bottom - one will be in the Championship next season.\nManchester United lead the way from Chelsea, Arsenal and Manchester City in the title race, but games in hand are still be played out that are expected to change things. Only three of them will get a place in next season's Champions League too.\nAt the bottom, it's Brighton, Reading, Leicester and Tottenham all in danger, with everything having the potential to change from one round of fixtures to the next and several 'six-pointers' still to come.\nHere, Jamie Spencer, Emily Keogh and Yara El-Shaboury from 90min's women's football team make their predictions at the top and bottom of the table...\nJamie Spencer\nChampions: Chelsea\nTop 3: Chelsea, Manchester United, Manchester City\nRelegated: Tottenham\nEven though Manchester United are top with a four-point lead over Chelsea, the title race is still not in their hands. Chelsea have two games extra that, when played, could put them clear by two points instead – regardless of whether United win out the season. And, if we know anything about the Blues, particularly this season, it’s that they know how to win and are capable of truly grinding results out. With the Champions League still at stake for them and an all to play for semi-final second leg against Barcelona, that ability is now more important than ever. Never count against Chelsea.\nBut United should still be secure in their efforts to finish in the top three and qualify for the Champions League for the first time, which was the primary target when the season began. Their recent win over Arsenal was huge in that respect because it opened up a vital buffer to fourth place.\nThe injury to Leah Williamson could now be one too far with Arsenal. They have managed to cope without Beth Mead and Vivianne Miedema, and even beat Manchester City without Kim Little. But City don’t have any problems of the sort and no other distractions, with Arsenal still trying to stretch themselves to compete in the Champions League as well.\nAny one of four teams could go at the bottom. Brighton showed a lot of promise when Melissa Phillips took charge of her first game against Manchester United in the FA Cup and Leicester recently won a huge six-pointer against Reading that could ignite something. Tottenham did beat Leicester but have slipped back into losing ways since – it’s 11 defeats in the last 12 - and remaining games against both Brighton and Reading will be make or break for them. Losing slumps are very hard to break.\nEmily Keogh\nChampions: Chelsea\nTop 3: Chelsea, Manchester United, Arsenal\nRelegated: Leicester\nIt’s hard to imagine anyone other than Chelsea lifting the WSL trophy. Even through a few rocky moments, they have have been on better form than most, while Emma Hayes is still gunning for a treble (WSL, FA Cup and UWCL titles). Sam Kerr and Guro Reiten aside, it has definitely felt like a team effort, with every player stepping up to keep the side in the title chase. Although four points behind Manchester United, their two games in hand give them the edge.\nUnited are still showing gaps in their development but will, for sure, be finishing the season with a Champions League spot. Even with the title likely to be just out of reach, United have solidified their place as a top three team and this feels like just the beginning for one of the most promising sides in England right now.\nAlthough it feels like Arsenal’s title challenge is in the dust after losing to United, the Gunner still have a shot at staying ahead of Manchester City to finish third, helped by their goal difference advantage. With injuries to Beth Mead, Vivianne Miedema, Kim Little and now Leah Williamson, other players have stepped up swiftly, many playing out of position. Credit where credit is due.\nAt the foot of the table, Leicester simply struggled to get going until it was a little too late. Top signings in January have boosted performances rather than results. With five games to go and only two points separating the entire bottom four, the Foxes could yet pull themselves free. But they remain most likely to drop through the trapdoor to the Championship.\nYara El-Shaboury\nChampions: Manchester United\nTop 3: Manchester United, Chelsea, Manchester City\nRelegated: Leicester\nThe WSL is so tight this year that it will somehow hardly be a shock if any of the top four nabs it. That being said, it’s Manchester United who will be champions. So far, they’ve been the best all-round team, with solidity at the back and fluidity in front of goal. They do have a Manchester derby coming up, but they can beat Manchester City at home on current form.\nThe other reason United will edge their first WSL title is the state of the teams around them. Chelsea not only have a bit of an injury crisis, but they are also still in the Champions League and Emma Hayes is determined to get her hands on the one trophy she has yet to win at the club. Their semi-final against Barcelona remains delicately poised after the first leg and the Blues will need to be at full strength in the second leg if they want any chance of going through. Arsenal are also in the Champions League and have also lost further key players in Kim Little and Leah Williamson, which dampens their end-of-the-season hopes. Manchester City have shown in games against Arsenal and Aston Villa that they struggle to see games out, but a lack of distractions should still see them pip the Gunners to the third and final Champions League spot.\nThe relegation battle is equally tight and hard to predict, but Leicester have had consistently poor results all season. Brighton only need to play one of the top four and have a game in hand, while Reading and Leicester each still need to play two of the best sides. It’s just tough to imagine where Leicester will get enough points from to beat the drop.\nWATCH NOW\nFara Williams and Girls on the Ball take at the look at the WSL title race in 90min Talks.",
  "word_count": 1091,
  "scraped_at": "2026-02-14T12:21:59.009628"
}