{
  "article_id": "e3ffd62c58c0",
  "url": "https://www.nytimes.com/athletic/6015933/2024/12/23/fifa-netflix-womens-world-cup-broadcast-rights/",
  "title": "Netflix FIFA Women World Cup deal feels like a page out of the pay - to - play book : Rueter",
  "date": "20241223T233000Z",
  "domain": "nytimes.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "For decades, American soccer has struggled to ensure it doesn’t price families out of signing their kids up for elite programs thanks to the prevailing pay-to-play model.\nWhile the landscape still struggles to break old habits, a new obstacle may be emerging following the latest deal between FIFA and Netflix to exclusively air the 2027 and 2031 Women’s World Cups on the streaming platform.\nAdvertisement\nIn its press release on Friday announcing the partnership, FIFA emptied its thesaurus and called the deal “landmark,” “unparalleled,” “top-tier” and “a truly historic day for broadcasting.” The new pact, which only involved the Women’s World Cups and will result in English and Spanish-language broadcasts, sees FIFA move on from its decade-long deal with Fox.\nHowever, it comes with the risk of harming the growth of women’s soccer as a (likely) unintended consequence.\nFolding the World Cup — long the final bastion of free-to-view soccer — into a subscription service could limit viewership and curb the number of public watch parties that are a staple of American sports culture in addition to harming the overall accessibility of the sport. Additionally, it risks gatekeeping domestic fans’ ability to watch the nation’s most competitive soccer team of any gender.\nFIFA is showing an awful lot of trust in an untested live broadcaster, too. Would it be as willing to award Netflix the rights to the men’s World Cup without a track record of success? Surely, it would have been sensible to have Netflix prove its mettle using the Club World Cups as a test next summer. For that tournament, FIFA signed a deal to air games on a different platform, DAZN, but is offering games free to view worldwide.\nAt face value, the deal carries obvious benefits for both parties.\nFrom FIFA’s side, it found a willing partner for the next two Women’s World Cups and a company that’s increasingly ubiquitous with disrupting stale industries while remaining sustainable — or, as sustainable as streamers have proven they can be to date.\nFor Netflix, it’s a cannonball into the sports landscape after a couple of well-advertised dips of its toe: first Mike Tyson vs. Jake Paul, then NFL on Christmas Day. One can only expect a greater catalog of live sports offerings to come before the Spain women’s national team works to defend its title in 2027.\nThe new partners seem confident that this will work out, too, despite Netflix’s lack of history in live soccer broadcasting, or covering tournaments rather than one-off events. Netflix announced that the pact “covers all languages and will include both English and Spanish telecasts,” ending FIFA’s previous approach that split the language rights to play to separate markets.\nAdvertisement\nBut viewership habits evolve rapidly. And while Netflix hasn’t been in the live sports arena for long, and therefore represents a level of risk in terms of properly packaging such a popular month-long event… it’s Netflix, not some unknown. It has the money and infrastructure to execute this with innovation and precision.\nAs my colleague Richard Deitsch wrote on Friday: “Netflix being any kind of player for upcoming live sports rights will change the landscape of sports consumption and cause consternation for the traditional linear powers given its financial might.”\nBut how will that impact soccer in the United States?\nFor the next two years, all we can do is monitor how Netflix gears up for its first major international tournament, both through its content plans and how other live events fare on the platform.\nThe streamer’s two most recent forays had clear issues. The Paul vs. Tyson fight was panned as a blusterous promotion without a truly substantive main event, although some of that is natural for gimmick matches. The real concern was a monsoon of complaints amidst buffering and freezing glitches, especially during the night’s best fight between Katie Taylor and Amanda Serrano.\nBloomberg’s Mark Gurman reported that Netflix’s chief technology officer addressed the criticism in an internal memo to employees saying, “We don’t want to dismiss the poor experience of some members and know we have room for improvement, but still consider this event a huge success.”\nThe event still drew 60 million households, according to Netflix. Using only the reported figures from Spain, England, Australia and the United States, the 2023 final, which didn’t include the U.S. women’s national team, drew an average audience of 35.2 million. The 2019 final drew a global average of 82.18 million live viewers and 260 million total viewers as the USWNT beat the Netherlands. Netflix has about 270 million subscribers globally, including 80 million in the U.S. and Canada. However, there’s no guarantee that those existing subscribers will tune into the event.\nAdvertisement\nMore events that can draw an audience like celebrity boxing and a holiday NFL game will hopefully help Netflix iron out the wrinkles and set them up for a successful tournament. In September, Netflix co-CEO Greg Peters stated plans “to Netflix-ify (NFL games) a bit” with “a little bit of stuff around the games with our talent, stuff like that, that’ll hopefully make it super fun.”\nIt’s far off to imagine that FIFA would “Netflix-ify” the World Cup by, say, kicking off all 16 group stage games of a round in unison (if the tournament is still only 32 teams, anyway). But then users might do something so quintessentially Netflixian: scroll through their options for 10 minutes before being overwhelmed and retreating to their endless rewatch of Arrested Development.\nThis partnership was likely inevitable. The business folks at FIFA know they need to remain ahead of the curve to maximize its revenue and reach as the entire entertainment industry reckons with consumer trends.\nThere has, however, been one notable holdout from this streaming revolution: the American sports bar. As a soccer fan in the United States, I know as well as anyone how hard it can be to find a venue that carries the game you want to watch.\nMLS’s decade-long pact with Apple TV has ended the local blackout but severely limited the ability to watch even its marquee matches in public. That same plight is felt if your Premier League or USL Super League match is on Peacock, your Serie A or Champions League fixture on Paramount+, your USMNT or USWNT friendly on Max, or your La Liga or Bundesliga contest on ESPN+. NWSL games are spread even further with matches on two streaming platforms, Amazon Prime and the in-house NWSL+ in addition to games on CBS, ESPN and Ion.\nA few bars have continued to whet the appetite by evolving their viewing capabilities, a process made easier as bartenders and servers are increasingly familiar with the many platforms’ varying interfaces. The majority, however, may not see a need when many traditional men’s and women’s sports still pop up in basic or expanded cable packages.\nThe ability for bars, restaurants and public squares to show these games ought to be of the utmost importance to Netflix and FIFA alike. The ability for families without lavish entertainment budgets to watch a World Cup should be equally important in the two partners’ priorities, either with generous free trial windows or several matches that are free to view.\nAdvertisement\nWhen games are primarily viewed on streaming platforms, it can be difficult for cable-reliant businesses to accommodate. According to CNBC, DirecTV declined to pay the six-figure licensing fee to distribute Netflix’s NFL double-header on Christmas. The alternative for “DirecTV bars” who want to show the games is to pay hundreds of dollars per month to subscribe to EverPass.\nUnderstandably, many owners balk at stacking payments to show games. That may limit the opportunities around a World Cup at a time when the women’s game has never been more competitive. The United States will want to avenge its shortcomings from 2023 and is back atop the world rankings after claiming Olympic gold. The world is teeming with worthy contenders, from reigning finalists Spain and England to Olympic runners-up Brazil to competitive nations Canada, Japan, and Germany.\nIt’s important to look at this partnership with a critical eye given FIFA’s history of not showing equal support to its women’s soccer tournament, only recently increasing prize money and paying attention to broadcast rights separate from the men’s tournament.\nThere’s also something rich about FIFA’s proactive approach to awarding the broadcast rights to the 2031 Women’s World Cup without having yet finalized its host. The United States and Mexico have established their interest in a joint bid, but FIFA said a decision won’t come until “the second quarter of 2025,” despite having already awarded the hosting rights to the 2034 men’s edition.\nThis deal is the latest that ensures access to the sport is fully ensnared by pay-to-view platforms. For a nation of immigrants that’s becoming increasingly infatuated with the world’s game, that’s a sobering reality that accompanies the announcement’s corporate-speak patting of backs. If you could already scarcely afford to play the sport, what does it say that watching its most hallowed tournament requires a costly subscription?\nAs irony would have it, FIFA president Gianni Infantino once called for the U.S. to end pay-to-play.\n“One of the things that shocked me here in America is that children have to pay in order to play. We have to stop this,” Infantino said at the 2024 Milken Institute Global Conference in Los Angeles.\nThe pay-to-watch model that this partnership brings about institutes the same roadblocks that Infantino was calling to end. But perhaps that’s what FIFA meant when it called this “a truly historic day for broadcasting.”\n(Casa de S.M. el Rey/Spanish Royal Household via Getty Images)",
  "word_count": 1600,
  "scraped_at": "2026-02-14T12:18:14.970482"
}