{
  "article_id": "e41074cc31d2",
  "url": "https://www.france24.com/en/live-news/20240517-departing-hayes-urges-chelsea-to-seize-second-chance-in-wsl-race",
  "title": "Departing Hayes urges Chelsea to seize  second chance  in WSL race",
  "date": "20240517T044500Z",
  "domain": "france24.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Departing Hayes urges Chelsea to seize 'second chance' in WSL race\nLondon (AFP) – Emma Hayes had given up hope of ending her spell at Chelsea with a seventh Women's Super League title but the Blues are back in control of the race heading into her final game in charge.\nIssued on:\nChelsea lead Manchester City on goal difference ahead of Saturday's shootout for the title after a remarkable series of twists and turns.\nHayes said her side's four-year reign as champions was over after a thrilling 4-3 defeat to Liverpool at the start of the month, which left City needing just four points from their final two matches.\nHowever, City conceded twice in the dying minutes to lose 2-1 to Arsenal on May 5 and watched in horror hours later as Chelsea smashed Bristol City 8-0 to bolster their goal difference.\nHayes's women enjoy a two-goal cushion in goal difference and have also scored six more goals, meaning City need a three-goal swing on the final day if they do not better Chelsea's result.\nBut City have on paper the easier fixture as they travel to Aston Villa, while Chelsea take on a Manchester United side fresh from celebrating their first-ever major trophy in the women's game in the FA Cup final.\n\"I said to everybody 'If you get a second chance in life make sure you don't need a third',\" Hayes said after Wednesday's 1-0 win at Tottenham.\n\"I love that we take it to the last game. No matter the outcome, I'm super proud of this team's ability to keep finding ways in the adversity we've faced this year.\"\nA seventh league title would be a fitting farewell for Hayes before she departs to take charge of the United States women's team.\nIn 12 years at the helm, the 47-year-old has made Chelsea the dominant force in the English game.\nA winner of five FA Cups and two League Cups, as well as six WSL titles, Hayes's reputation as an inspirational leader and shrewd tactician has earned her the most high-profile job in women's football -- in charge of the four-time world champions.\n\"As much as trophies matter, leaving something that's built to last is the most important thing to me,\" said Hayes, who was recently honoured with a permanent tribute on Chelsea's wall of legends at Stamford Bridge.\nHoughton eyes perfect send-off'\nHowever, City are hoping for a glorious send-off for a club great of their own as former England captain Steph Houghton will retire on Saturday.\nGareth Taylor's side had won 14 consecutive league games before being stung by Stina Blackstenius's late double for the Gunners two weeks ago.\n\"For us, it's so important to be in and amongst it but now it's the final step of going on and achieving that as well. I still believe it's possible and all the girls do as well,\" said City and England forward Lauren Hemp.\n\"Obviously, there's bits we need to look at from the Arsenal game where we can improve. Our sights are on the last game of the season and making sure we go out with a bang.\"\n© 2024 AFP",
  "word_count": 526,
  "scraped_at": "2026-02-14T12:22:33.108607"
}