{
  "article_id": "e4118f2dc208",
  "url": "https://www.vulture.com/article/oscars-luncheon-class-photo.html",
  "title": "Every Oscars Nominee Luncheon Class Photo From 1985 to 2024",
  "date": "20240215T184500Z",
  "domain": "vulture.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "This article originally ran on April 23, 2021, but has been updated to include new class photos.\nWhen this year’s movie-awards season reaches its conclusion on March 2 with the 97th Oscars, it will do so with another memorable class photo under its belt. For more than 40 years, the Oscar Nominees Luncheon — the high-profile, endearingly awkward gathering where a Best Actress nominee might be seated next to a film editor before everyone in attendance poses for a class photo — has been a mainstay of the award season. That streak was interrupted in 2021, when, for the first time since its inception in 1982, COVID-19 concerns prompted the Academy to officially cancel the event, and then again, this year, due to the L.A. fires. The luncheon was canceled on January 13, but luckily, we still got a class picture at the cocktail party and dinners held at the Academy Museum on February 25. It was an Academy luncheon in spirit.\n“I feel about the luncheon the way most of us feel about the institutions and activities that have been throttled and postponed because of the pandemic,” Richard Kahn, who served as president of the Academy in the late 1980s, said in 2021. “It was a labor of love for us.”\nIn fact, it was Kahn who initiated the tradition in the first place. Back in 1981, the monthslong buildup to the Academy Awards needed an overhaul. “This was when the show took place in late March, sometimes in April,” says Steve Pond, journalist and author of The Big Show: High Times and Dirty Dealings Backstage at the Academy Awards. Film blogs, of course, didn’t exist, so it was hard to sustain excitement. Pond adds, “People were not as ravenous for all information having to do with the Oscars as they are now.”\nKahn, then a member of the Academy’s Board of Governors and a longtime marketing executive, stared down the problem and came away with an idea: What if nominees gathered for a cordial, agony-free luncheon several weeks before the ceremony? It would bring publicity to the Oscars during the long slog between when nominations were announced and the show itself. It also seemed like a charming way to present the nominees with their nomination certificates, which had previously been sent by mail, usually in a leather-bound kit. Kahn was never a fan of that approach. “That was a rather staid and impersonal way of doing it,” he says.\nAnd so in early 1982, the first Oscar Nominees Luncheon took place in the grand ballroom of the Beverly Hilton in Beverly Hills. In a New York Times write-up, Fay Kanin, then the president of the Academy, said the goal was to launch “an event that pays proper tribute to the individual achievements of each and every Oscar nominee.” Yet during the lead-up, Kahn, despite it having been his idea, feared it would be a flop. “I worried, Would they come?” he recalls.\nOf course they came. “We were elated that 42 of the nominees accepted our invitation,” says Kahn, who distinctly remembers watching Steven Spielberg enter the room and exclaim, “Wow!” “I said to myself, Steven Spielberg just said ‘Wow’!”\nAt the event, the nominees were seated randomly, a tradition that continues today. “A sound mixer might be sitting next to a producer, and a supporting actor might be sitting next to a makeup person,” Kahn says. “It was based on the original mandate of the Academy, to be like the very definition of an academy: a place where people of various artistries and crafts join together.” Over time, the luncheon hardened into tradition: For the Academy, it became a convenient means of flexing its prestige muscles; for nominees, it was a way to congregate and schmooze away from the stress-heavy environs of the actual ceremony.\n“During the cocktail hour, you have stars and filmmakers talking: ‘Oh, I saw your film. It’s tremendous.’ You get a lot of that vibe,” veteran Los Angeles Times photographer Al Seib who died in 2022, told Vulture. For instance, Tom Hanks approached Frank Darabont at the 1995 luncheon and declared himself available to work with the filmmaker; Darabont soon sent him The Green Mile. “I don’t see that as much on the actual Academy Awards night,” noted Seib. “The tension is higher.”\nBut for Oscar obsessives on the outside, the luncheon is mostly significant for one reason: the class photo. Each year, it’s a glorious sight — a selection of nominees, gathered around an Oscar statue, beaming like members of a youth-soccer league. That particular tradition began in 1985, and as Kahn explains, “It grew into the most popular element of the luncheon — this wonderful gathering of all kinds of artists and craftsmen, all up there on the risers like they were graduating from middle school!”\nDuring the 1990s, the process of gathering for the group photo was chaotic. “They would just say, ‘Okay, all the nominees come up here and stand on the risers,’” recalls Pond, who has been attending the luncheon annually since 1994. “It was sort of a free-for-all. Everybody would go up there, jostle for positions.” After an endless barrage of camera flashes, the nominees would remain on the risers and be called alphabetically to collect their certificate of nomination and an official Oscar-nominee sweatshirt, which became a traditional swag item in 1989.\n“You had nominees whose names fall at the end of the alphabet standing up there forever,” Pond says. Film composer Hans Zimmer, who has received 11 Oscar nominations to date, was frequently the victim of this tradition. One year, the Academy decided to call the names in reverse alphabetical order and begin with Zimmer. “That kind of surprised him,” says Kahn.\nAround 2011, the Academy overhauled the procedure. Nominees’ names would be called before gathering for the photo, instead of remaining on the risers, and they would grab their nomination certificate on the way out. It’s a faster, more efficient process. “Once all the nominees are called, they take the class photo and then it’s, ‘Thank you very much. That’s it,’” Pond says. And these days, the Oscar-nominee sweatshirts are no more. In his decades of attending the luncheon, Pond only ever saw one actor wear the sweatshirt: Catherine Keener. (“She said, ‘I’m cold!’, and ripped open the bag and put on the sweatshirt.”)\nDuring the final Oscar season before the pandemic came a bigger change: In 2020, the luncheon was moved from the Beverly Hilton to the Ray Dolby Ballroom at Hollywood and Highland. As Deadline noted, “This was the first Oscar lunch ever to take place at the same facility where the show itself will be broadcast.”\nWithin the past half-decade, between COVID and the wildfires, there have been two separate interruptions , but the Academy preserves tradition. “There is a collegial sense inherent in the luncheon that goes back to the great academies in Europe and, even before that, to the age of Rome and Greece. All the great persons are gathered together where they share each other’s knowledge and skill.” He pauses. “That’s a highfalutin way of saying it, but it’s a great event.”\nBelow, you’ll find all 39 class photos along with details about that year’s major awards narratives and a guide to spotting notable luncheon attendees. Find the most recent year’s photo here.\n57th Academy Awards (Event held in 1985)\nOne of the biggest trend stories of the 1984 Oscars was its Best Actress race, in which three of the five nominees played so-called “farm wives” in their respective films: Sally Field in Places in the Heart, Jessica Lange in Country, and Sissy Spacek in The River. Field won, marking her second Oscar triumph in five years, and delivered her now famous/infamous “You like me!” speech. Neither Field nor the other farm wives were present at this year’s luncheon, though. Only Vanessa Redgrave (third row, second from the right) — who overcame visa troubles to film The Bostonians and then overcame an old-guard Academy still holding grudges for her notorious “Zionist hoodlums” speech when she won the Best Supporting Actress in 1977 — showed up to represent the Best Actress field, and she did so dressed like she was checking in for a sales conference in Phoenix. Also, this is the only class photo in which the Oscar statue stands to the side instead of center stage.\nAlso look for:\n➼ Prior to 2021’s Oscar nominations, with Riz Ahmed and Steven Yeun both nominated in Best Actor, the only other time two Asian performers were nominated in the same acting category was at the 57th Oscars, when The Karate Kid’s Pat Morita (second row, farthest left) lost to The Killing Fields’ Dr. Haing S. Ngor (back row, farthest left).\n➼ Ray Parker Jr. (second row, third from left) was a nominee for Best Original Song for the theme from Ghostbusters, the music video for which featured cameos from Oscar nominees Peter Falk, Danny DeVito, Carly Simon, and Teri Garr.\n➼ F. Murray Abraham (front row, second from right) and Tom Hulce (front row, farthest right) were both nominated for Best Actor for their performances as Salieri and Mozart, respectively, in Amadeus. It was the first time two lead actors were nominated in the same category for a Best Picture winner since Midnight Cowboy in 1969 and the last time that two performers from the same movie have been nominated in Best Actor ever.\n58th Academy Awards (1986)\n1985 was a banner year for the Best Supporting Actress category, with five complex characters: a scheming mafiosa (Anjelica Huston, back row, eighth from right, in Prizzi’s Honor), a mentally disturbed nun (Meg Tilly, third row, fourth from right, in Agnes of God), a bitter daughter (Amy Madigan in Twice in a Lifetime), a force-of-nature (Oprah Winfrey, back row, third from left), and an alcoholic singer (Margaret Avery, second row, sixth from left, in The Color Purple). It was also one of those blessed years where all five actresses were first-time nominees — the Academy could use more massive infusions of fresh blood — the shortlist was more diverse than Oscar ever got in the 1980s with one biracial nominee (Tilly) and two Black women nominated for Supporting Actress for the first time. The two biggest stories at the time focused on Winfrey’s film debut and Huston’s “comeback” of sorts. Written off as a bad actress following a disastrous debut in her father’s 1969 film A Walk With Love and Death, her career got a stunning makeover when she reteamed with her dad and shared the screen with her then-boyfriend, Jack Nicholson (back row, seventh from right), in Prizzi’s Honor, to massive critical acclaim. Her “narrative,” though we didn’t call campaign angles that back in 1985, was impossible for Oscar to resist, and she won in a presumed landslide.\nThe two weirdest historical nuggets from this race belong to The Color Purple actors. Oprah has since revealed that she had her bread roll from the luncheon bronzed (since she knew she wouldn’t win the Supporting Actress statue). And Avery, who had famously nabbed her role as Shug Avery when Tina Turner turned it down, launched her own bizarre FYC ad for Best Actress that took the form of a letter to God. She was pilloried for poor judgment, but maybe she was just ahead of her time? When Melissa Leo paid for her own ads for The Fighter 25 years later, all glammed up in fur with the single word “Consider” above her portrait, the initial response was similarly vitriolic. Just as quickly, those later ads became their own kind of weird and beloved meme — and Leo won the Oscar. If Avery had had the internet to both mock and embrace her, perhaps things would have turned out differently in 1985.\nAlso look for:\n➼ Amy Madigan (front row, fourth from right), Best Supporting Actress nominee for Twice in a Lifetime, came with a look — black leather skirt and pink heels — compared to this rather unremarkably dressed group.\n➼ Eric Roberts (third row, third from right), the Best Supporting Actor nominee for Runaway Train, and Meg Tilly (third row, fourth from right), the Best Supporting Actress nominee for Agnes of God, both share the distinction of being one half of Oscar-nominated sibling pairs. Meg’s sister Jennifer Tilly was nominated in 1994 for Bullets Over Broadway, and Eric’s sister is Oscar winner Julia Roberts.\n➼ EGOT icon Whoopi Goldberg (back row, fifth from left), part of The Color Purple contingent, grins in celebration of the first Oscar nomination of her decorated career — in this case, for Best Actress.\n59th Academy Awards (1987)\nLooking back on it, Marlee Matlin’s (first row, seventh from left) prime position near the hulking Oscar replica seemed to herald her victory. And yet few declared her the front-runner, perhaps because the spirited newcomer was nominated against four industry veterans (Jane Fonda, Sissy Spacek, Kathleen Turner, and Sigourney Weaver). Today, she remains the youngest Best Actress champion in history and the only deaf performer to win in any category. Matlin’s Oscar coronation offered a stark contrast to Paul Newman, who, circa 1986, was the Glenn Close of his day. Newman’s slick but unremarkable performance as a duplicitous pool shark in Martin Scorsese’s The Color of Money — a role he’d originated in 1961’s The Hustler opposite Piper Laurie (first row, seventh from right), who received a surprise Supporting Actress nod in ’86 for her brief appearance as Matlin’s mother in Children of a Lesser God — marked his seventh nomination. The Academy handed Newman an honorary Oscar the previous year, but he hadn’t won a competitive trophy until Money came along. And then he didn’t even show up to collect it! (He cited post production duties on The Glass Menagerie, which starred his wife, Joanne Woodward.)\nAlso look for:\n➼ David Lynch (fourth row, fifth from left) was the critical cause celebre of 1986 for his film Blue Velvet, for which he picked up his second career Best Director nomination (after 1980’s The Elephant Man). He had already won Best Director from the Los Angeles and National Society of Film Critics, and while he went on to lose the Oscar to Oliver Stone, he did share the luncheon stage with Best Supporting Actress nominee Laurie, who he’d cast only a few years later in Twin Peaks.\n➼ This year marked the only career nomination for Kathleen Turner (first row, eighth from right), who got a Best Actress nod for the Francis Ford Coppola movie Peggy Sue Got Married. Thirteen years later, she’d co-star in Francis’s daughter Sofia’s debut film The Virgin Suicides, where her on-screen husband was played by fellow 1986 nominee James Woods (third row, ninth from right), who was nominated in Best Actor for Salvador.\n➼ For his performance in eventual Best Picture winner Platoon, Willem Dafoe (back row, 11th from right) earned his first of four career Oscar nominations. Dafoe would also end up teaming with Lynch in a few years on the 1990 film Wild at Heart.\n60th Academy Awards (1988)\nHalf of the fun of poring over class photos is gasping at the most famous face tucked into the lineup. But when you search 1987’s picture, you somewhat surprisingly won’t find Cher gazing back at you. The Moonstruck Best Actress nominee was tragically a class photo no-show (lingering resentment over her 1985 snub for Mask, perhaps?) When Cher eventually won the trophy, her Best Actress competition Sally Kirkland (second row, seventh from right), who’s rocking a fuschia get-up, would notoriously be caught on-camera making a stink face at the envelope reveal, perhaps given high hopes by her surprise Golden Globe win for Anna.\nInstead, the biggest hitter of the bunch was Michael Douglas (front row, second from right), who would later take home Best Actor for Wall Street, a win solidified by the inescapability of Fatal Attraction. Though Douglas’s screen-wife, nominee Anne Archer (front row, third from right), stands beside him on luncheon day, Glenn Close is missing. Across the mass, Anne Ramsey (front row, second from left) celebrated her Supporting Actress nomination for Throw Momma From the Train following decades in the industry, and two years after what may have been her most enduring role, as criminal mastermind Ma Fratelli in The Goonies. Sadly, she passed away a few months after the photo was taken.\nAlso look for:\n➼ Diane Warren (front row, seventh from right) looked ’80s as hell for her first of 12 Oscar nominations for Best Original Song, this time for “Nothing’s Gonna Stop Us Now” from Mannequin.\n➼ Sherry Lansing (front row, fourth from right) was the first woman ever to head a Hollywood film studio. In 1987, she received her only competitive Oscar nomination, as a producer of Fatal Attraction, starring the two people to her right, Archer and Douglas.\n61st Academy Awards (1989)\nSigourney Weaver (third row, fourth from right), Dustin Hoffman (front row, fourth from left), and Kevin Kline (front row, fourth from right) certainly had a better time at the luncheon than they later did during the notorious Snow White opening number at that year’s Oscars, where all three were caught on camera scowling at the baffling production number that lives forever now in Oscar infamy.\nIn 1989, no one was trying to create viral moments at the Oscars. Back then, it was a dignified affair, the peak of Hollywood glamour, which is why few attendees were pleased with producer Alan Carr’s camp-tastic opening musical number featuring the Disney princess singing an off-key duet of “Proud Mary” with Rob Lowe. Carr wanted to bring Broadway verve and Vegas bombast to the Academy Awards, but the stunned looks on the faces of front-row nominees who were getting glad-handed by a Disney princess indicated that Carr’s vision was an immediate catastrophe. At least Martin Landau (front row, far right), up for Best Supporting Actor for Tucker: The Man and His Dream, looked charmed by it all, bless his heart, though given how cheerful he looks in the luncheon photo, maybe he was just feeling happy that whole season. The ceremony never recovered from its confusing start, and the show has since been dubbed by some as “The Worst Oscars Ever” thanks entirely to Carr’s well-intentioned calamity.\nAlso look for:\n➼ Five years after appearing together in the photo, Kline (Best Supporting Actor winner for A Fish Called Wanda and Weaver (Best Actress nominee for Gorillas in the Mist and Best Supporting Actress nominee for Working Girl) played President/imposter and First Lady in Dave.\n➼ River Phoenix (front row, sixth from right) didn’t look super thrilled to be celebrating his first (and, sadly, only) Academy Award nomination as a supporting actor in Running on Empty.\n➼ Celebrated composer Hans Zimmer (front row, third from right) got his first Oscar nomination this year, for Best Original Score for the Best Picture–winning Rain Man, starring Hoffman.\n62nd Academy Awards (1990)\nQuick shout out to Daniel Day-Lewis (front row, furthest right) for turning a look for the Oscars Luncheon. It’s the pomp and circumstance (that hair! That pattern!) the similarly stuffy event deserves. Lewis’s win for My Left Foot is also indicative of some of the Oscars’ favorite trends: awarding actors for performances based on real figures, and for portrayals of physical disabilities, and for doing the “most” acting, pushing the body to physical extremes. During this campaign, DDL’s grueling Method acting process was common knowledge: Off-screen, he insisted on being wheeled around and spoon-fed by the crew, and a rumor spread that he broke his ribs from the hunched position he maintained throughout filming.\nAlso look for:\n➼ Daniel Day-Lewis’s wife at the time, Isabelle Adjani (back row, third from right) was celebrating her Best Actress nomination for Camille Claudel by hanging with Anjelica Huston (back row, second from right)and Dan Aykroyd (back row, furthest right).\n➼ Conspicuously absent is Spike Lee, nominated for Best Original Screenplay for Do the Right Thing. Not absent? Lili Fini Zanuck and Richard Zanuck (third row, sixth and seventh from right), who won Best Picture that year for producing Driving Miss Daisy (whose star, Morgan Freeman, is front row, sixth from right). As Lee told New York in 2008: “Remember what Kim Basinger did? Onstage she said, ‘The best film of the year is not even nominated, and it’s Do the Right Thing.’ I didn’t even know her. But when Driving Miss Motherfucking Daisy won Best Picture, that hurt … No one’s talking about Driving Miss Daisy now.”\n63rd Academy Awards (1991)\nMuch of the discussion around the 63rd Oscars centered on one particular performer: Madonna, who was on hand to sing Dick Tracy Song nominee “Sooner or Later,” and brought as her date none other than Michael Jackson. (People dubbed them “the oddest couple.”) The strange juxtapositions continued in the nominations, which featured a grab-bag of bold-faced names making their first and only Oscar appearance: Shel Silverstein! Steven Sondheim! Jon Bon Jovi! (And that was just in Original Song.) Unfortunately, none of them showed up for the class photo, which is most notable now for the appearance of two Supporting Actress nominees: Ghost supporting actress Whoopi Goldberg (third row, ninth from right), who on Oscar night became only the second Black actress to win an Academy Award; and Annette Bening (back row, tenth from right) of The Grifters, whose loss would kick off a (criminal) winless streak that stretches to the current day.\nAlso look for:\n➼ Carmine Coppola (front row, furthest left) was celebrating his second Academy Award nomination for writing the score for his son Francis Ford Coppola’s film The Godfather Part III.\n➼ Andy Garcia (front row, sixth from right) was also a nominee for The Godfather Part 3 and opted for the men’s fashion scarf, an Oscar staple in the late ’80s and early ’90s.\n64th Academy Awards (1992)\n1991 was one of those years when Oscar seemed to buck key traditions. In previous years, particularly during the 1980s, the Best Picture race had usually gone to Meaningful Dramas, usually of the historical kind. Appropriately enough, these winners were often also the titles that had the most nominations. (Think Dances With Wolves, or The Last Emperor, or Out of Africa, or Amadeus.) For a while, the 64th Academy Awards seemed headed in a similar direction: Barry Levinson and Warren Beatty (front row, second from right) had Bugsy, a handsome, epic gangster period piece that earned the most nominations (ten) and had won a number of awards heading into the ceremony (including the Golden Globe). It had Hollywood connections, it had a real-life love story (Beatty and his co-star Annette Bening would soon get married), and all the necessary pedigree to march to victory on Oscar night. Think of Team Bugsy as the right side of this picture: There’s Beatty, standing next to screenwriter and close friend James Toback (front row, far right). Two rows behind them, beaming with a smile, is producer Mark Johnson (third row, fourth from right with glasses flare), standing next to costume designer Albert Wolsky (third row, fifth from right), and a row behind them is cinematographer Allen Daviau (fourth row, sixth from right).\nBut then, along came the left side of this photograph, Team Silence of the Lambs. There’s Jodie Foster (front row, third from left). One row behind her is producer Ron Bozman (second row, fourth from left), standing not too far from Anthony Hopkins (second row, seventh from left). Though critically lauded, Lambs was an unlikely winner: It had opened early in the year, it was already out on home video, it was a genre picture, and it was kind of controversial, as many LGBTQ activists were upset with the film’s depiction of its controversial serial killer villain, the woman-skinning Buffalo Bill. The Oscar race that year was tighter than it had been in years, and some pundits did predict Silence of the Lambs would win. But almost nobody suspected it would pull off a Big Five Sweep: winning Picture, Director, Actor, Actress, and Adapted Screenplay — only the third time in Academy history it had happened. No film has pulled the feat off since.\nAlso look for:\n➼ Laura Dern and Diane Ladd (front row, ninth and tenth from the right) became the first and, to date, only mother-daughter duo to both get Oscar nominations for the same film when they were nominated in Best Actress and Best Supporting Actress, respectively, for Rambling Rose.\n➼ Barbra Streisand (front row, seventh from right) was sporting her best statement hat as a nominee for producing Best Picture nominee The Prince of Tides, even though she was snubbed in the Best Director category.\n➼ Not to be outdone in the fashion department by Barbra’s hat, Best Actress nominee Geena Davis (second row, fifth from right) came dressed in a men’s suit to celebrate her Best Actress nomination for Thelma & Louise.\n65th Academy Awards (1993)\nThe 65th Academy Awards kicked up a furor and the Women’s Action Coalition protested when the theme of “Oscar Celebrates Women and the Movies” was chosen for a ceremony that offered a male-dominated slate of Best Picture contenders. Merchant Ivory’s Howards End was the only film in the category with a woman as the main character. The rest included The Crying Game, which starred Stephen Rea (not pictured); A Few Good Men, with Tom Cruise (not pictured); Scent of a Woman, centered on Al Pacino (not pictured); and Clint Eastwood (front row, seventh from the right)’s Unforgiven (the eventual winner). Where the current Academy Awards have been criticized for their lack of recognition of movies made by and centered on women, these nominees were seen as an indication of how poor the roles being offered to women by the industry were. Emma Thompson (not pictured), who’d go on to win Best Actress for her role as Margaret Schlegel, ended her speech by dedicating the win “to the heroism and the courage of women, and to hope that it inspires the creation of more true screen heroines to represent them.” Then-newcomer Marisa Tomei (third row, fourth from left) would go on to be the unexpected recipient of the Best Supporting Actress award — and would be dogged for years by rumors that presenter Jack Palance has mistakenly announced her name because he was unable to read that of the actual winner.\nAlso look for:\n➼ Robert Downey Jr. (second row, ninth from left) got his first Oscar nomination this year for playing Charlie Chaplin in Chaplin. Tomei co-starred in Chaplin, and two years later she and Downey starred in the 1994 rom-com Only You. (Then, more than 20 years later, they would flirt a bunch as Aunt May and Tony Stark in the Marvel movies).\n➼ The fashion champ of this year’s luncheon photo was definitely Paul Berry (back row, fourth from left), a nominee for Best Animated Short Film for The Sandman, stealing the show with his fuschia hair experience.\n➼ Much love to this untucked-shirt-and-jeans casual style from Denzel Washington (front row, tenth from right), unwittingly presaging the laid back style of the Zoom awards era.\n66th Academy Awards (1994)\nFront-row center was not only the place to be for the 1993 Oscars Luncheon photo, it was also an inadvertent tribute to director John Singleton. Two years prior, Singleton became the first Black man and also the youngest person ever to be nominated for Best Director for Boyz N the Hood. Two of his stars in that movie, Laurence Fishburne (third row, 13th from the left) and Angela Bassett (front row, eighth from right), were both denied acting honors despite (especially Fishburne) being decidedly worthy. Two years later, they would get Lead Actor and Actress nominations for What’s Love Got to Do With It?, playing Ike and Tina Turner. Meanwhile, Poetic Justice, Singleton’s follow-up to Boyz N the Hood, didn’t fare nearly as well with critics or awards voters, but Janet Jackson (front row, tenth from right)’s song “Again” got a Best Original Song nomination for herself and her longtime producers Jimmy Jam (front row, ninth from right) and Terry Lewis (who doesn’t appear in the picture).\nAlso look for:\n➼ Angela Bassett (front row, eighth from right) was nominated for playing Tina Turner in What’s Love Got to Do With It. Ralph Fiennes (second row, farthest right) was nominated for Best Supporting Actor for Schindler’s List. Two years later, they co-starred in Kathryn Bigelow’s dystopic Strange Days.\n➼ Future Survivor star Jonathan Penner (front row, fifth from right) was nominated in Best Live-Action Short Film with his wife, Stacy Title, for their film Down on the Waterfront. Title sadly passed away last year after a long battle with ALS.\n➼ A year after they co-starred in Bram Stoker’s Dracula, Winona Ryder (second row, second from left) and Anthony Hopkins (back row, fourth from right) were both nominated for period films: her for The Age of Innocence, him for The Remains of the Day.\n67th Academy Awards (1995)\nNepotism is a dirty word, so let’s just say Hollywood is a “family town.” Knowing the right people will help you in any industry, but showbiz takes it one step further and regularly keeps it in the gene pool. This particular class photo offers a few examples. Sean Astin (front row, furthest left) was born into the business as the first child of Oscar winner and child star Patty Duke (The Miracle Worker). Like his mom, he became famous as a teenager (The Goonies). Then, seven years or so before he reached his pop-culture peak as the most faithful of Hobbit friends in The Lord of the Rings trilogy, he dabbled in directing and followed in his mom’s footsteps yet again, becoming an Oscar nominee. His 1994 nomination was for a short film called Kangaroo Court.\nIn this same photo, you can also spot composer cousins Thomas (back row, sixth from left) and Randy Newman (back row, third from right). It was Thomas’s first year as an Oscar nominee (a double nominee, in fact, for Little Women and The Shawshank Redemption) but he’d soon become nearly as frequent a presence as his older cousin Randy. Music is in their blood, after all: Thomas’s father was the legendary film composer Alfred Newman, the all-time Oscar record holder for composing wins (nine). And look, there’s Jennifer Tilly (third row, third from left), who was a surprise nominee in Supporting Actress for her ingeniously abrasive work in Bullets Over Broadway (“Charmed. Charmed. Charmed”) Her big sister Meg had been nominated nine years earlier in the same category.\nAlso look for:\n➼ Quincy Jones (second row, third from right), who in 1968 was the first Black person to be nominated twice in the same year at the Oscars, this year received the Jean Hersholt Humanitarian Award. The next year, he would serve as producer of the Oscars telecast.\n➼ Best Costume Design nominees Tim Chappel and Lizzy Gardiner (front row, fifth and sixth from right) were dressed rather conservatively here at the luncheon, a marked contrast from Oscar night when Gardiner wore a dress made of American Express Gold Cards to accept the Oscar for designing the costumes for The Adventures of Priscilla, Queen of the Desert.\n➼ Documentarian Frieda Lee Mock (front row, ninth from left) is the most-nominated Asian woman in history. She’s been up for five Oscars, and when this photo was taken, she was on her way to her first and only win for the Documentary Feature Maya Lin: A Strong Clear Vision.\n68th Academy Awards (1996)\nDianne Houston (back row, ninth from left) was fortunate to even make it to this year’s luncheon photo — she was initially denied entry to the parking lot for the facility. A valet told Houston, nominated in Best Live-Action Short for her film Tuesday Morning Ride, that the lot was for nominees only, a snafu made all the worse for the fact that Houston was the only Black Oscar nominee (neither Angela Bassett in Waiting to Exhale nor Whitney Houston’s work on the soundtrack, not Denzel Washington in Devil in a Blue Dress, not Laurence Fishburne in Othello) in a historically terrible year for diversity in Hollywood.\nBefore there was #OscarsSoWhite, there was the Hollywood Blackout of 1996. Diane Houston (for 20 years the only Black woman to be nominated for an Oscar for a film she directed) was alone out of 166 nominees at the 68th Academy Awards, and the publication that called the Oscars out on its embarrassing business was … People? The celebrity-friendly magazine ran a scathing cover story, “Hollywood Blackout,” with a subhead that read, “The film industry says all the right things, but its continued exclusion of African-Americans is a national disgrace.”\nJesse Jackson’s Rainbow-PUSH Coalition called for an Oscars protest, setting him at odds with host Whoopi Goldberg and the ceremony’s music producer, Quincy Jones, who was ironically trying to put together “the most multi-ethnic Oscars show anybody’s ever seen” and ultimately persuaded the reverend to hold off on boycotting the ceremony at the theater itself. (Activists who did participate in Jackson’s action agreed to do so outside ABC affiliate TV stations, since that was the network airing the Oscars.) Jackson suggested that attendees — who that year included Leaving Las Vegas’s Nicolas Cage (back row, 12th from right) and Elisabeth Shue (front row, fifth from right) and Best Supporting Actor and Actress winners Kevin Spacey (second row, eighth from left) and Mira Sorvino (front row, ninth from right) — wear rainbow ribbons to draw attention to the overwhelming whiteness of the event, but only Jones did so, and he got basically no institutional support beyond that one gesture. (In her opening monologue, Goldberg said “Enough with the ribbons.”) Cut to a few decades later, and People’s industry call out presaged this era of loudly and continuously demanding better from the Academy — even if the needle has still barely moved in terms of actual representation among nominees and has only recently (and marginally) improved among its voting members.\nAlso look for:\n➼ The 1995 Oscars were a hotbed of another kind of cringe when viewed through a 2021 lens, with the slate including Toy Story writers John Lasseter (third row, tenth from right) and Joss Whedon (back row, tenth from right) and Best Supporting Actor winner Kevin Spacey (second row, eighth from left).\n➼ The ’90s were the heyday of actors getting Oscar nominations for short films. That year’s winner in Live-Action Short Film was former Supporting Actress nominee Christine Lahti (second row, tenth from left), who won for Lieberman in Love. She beat out fellow actors Griffin Dunne (third row, 13th from right; Duke of Groove) and Jeff Goldblum (front row, third from right; Little Surprises).\n➼ Best Actor nominee Anthony Hopkins (front row, eighth from left; Nixon) and Best Supporting Actor nominee Ed Harris (back row, third from right; Apollo 13) were both here, standing very apart, some 20 years before they would come together to co-star in the HBO series Westworld.\n➼. Celebrated cinematographer Emmanuel Lubezki (front row, fourth from left) was enjoying his first-ever Oscar nomination for his work on A Little Princess. Lubezki is now up to eight nominations and three wins.\n➼ Sharon Stone (second row, seventh from left) got her first and only Oscar nomination this year for Best Actress in Casino.\n69th Academy Awards (1997)\nThis Supporting Actor race is probably most famous for Cuba Gooding Jr. (back row, tenth from right)’s total lovefest of an acceptance speech for Jerry Maguire, but one (still) noteworthy nomination in that category went to Ed Norton (back row, sixth from right) for his role in Primal Fear. Norton pulled off the rare feat of getting nominated for his first-ever film performance, for a role that he nabbed off of the merits of an audition tape. Before playing Aaron Stampler in Primal Fear, his only previous onscreen credit was for an English as a Second Language instructional cassette.\nAt the 68th Oscars a year prior, the Academy split the Best Original Score category into two fields, “Dramatic” and “Musical or Comedy,” owing to the total category nomination of Disney Renaissance film scores in the early ’90s (for The Little Mermaid, Beauty and the Beast, Aladdin, and The Lion King). In that first year, Alan Menken and Stephen Schwartz won in the new category for Pocahontas. The 69th Oscars, though, were a Disney shutout for Hunchback of Notre Dame, including Schwartz (third row, eighth from left), pictured here in a chic vest with both eyes closed. Some quickly proclaimed the Disney Decade to be over, and were proven right, when Disney didn’t win a Score award for more than two decades; by 1999, the categories had merged back into one.\nAlso look for:\n➼ Billy Bob Thornton (front row, far right) is the only attendee wearing a hat, which is from John Deere.\n70th Academy Awards (1998)\nIt may seem like Matt Damon (fourth row, seventh from left) is only looking away from his Good Will Hunting co-star Minnie Driver (third row, tenth from left) because he’s engaged with acting legend and The Apostle star Robert Duvall (fourth row, sixth from left) — both men were up for Best Actor. But it may also have been because he and Driver were amid a very tense breakup, where Driver ultimately learned that they were split for good when Damon appeared on The Oprah Winfrey Show and matter-of-factly said he was single. Which explains why Driver always looked so exasperated in shots of her reacting to the Matt-and-Ben love-fest at the ’97s Oscars.\nAlso look for:\n➼ Robert Duvall (back row, sixth from left) and Matt Damon (back row, seventh from left) are clearly in mid-conversation, perhaps about their Best Actor nominations (for The Apostle and Good Will Hunting, respectively), or perhaps they were reminiscing over their time together on the set of 1993’s Geronimo: An American Legend.\n➼ Best Actress nominee Kim Basinger (third row, eighth from left; L.A. Confidential) and Best Actor winner Jack Nicholson (second row, 11th from left; As Good as It Gets) probably didn’t take a moment at the luncheon to reminisce about filming Batman, but they could have.\n➼ This was a year of firsts for Paul Thomas Anderson (second row, tenth from right) and Julianne Moore (second row, ninth from right), whose nominations for Boogie Nights in Best Original Screenplay and Best Supporting Actress, respectively, kicked off many more.\n71st Academy Awards (1999)\nThe idea of formerly notorious bachelor Warren Beatty (front row, center, on Oscar statue) having an actress on his lap wouldn’t be unthinkable in most contexts. In the context of the very formal Oscar Luncheon photos, it’s certainly … a choice. (Who approved these seating arrangements?) For what it’s worth, Kathy Bates looks much happier about this than her similarly posed neighbor Rachel Griffiths (on Roberto Benigni’s lap). Perhaps Beatty and Bates first became friends on the set of 1990’s Dick Tracy, which Beatty both directed and starred in and in which Bates had a bit role. The film had been huge for both actors, giving Beatty his last true blockbuster success (plus an affair with Madonna, preserved in absurd glory in the documentary Truth or Dare), and propelling Bates to stardom and an eventual Oscar win as Annie Wilkes in Misery. Eight years later, here they were back at the Oscars for Bulworth and Primary Colors, respectively. Bulworth provided Beatty with his fourth nomination for screenwriting which gave him the unusual movie star distinction of being nominated just as often for his writing talent as for his acting.\nAlso look for:\n➼ Four people to the right of Bates in the front row is Sir Ian McKellen (Gods and Monsters), the first out gay actor ever nominated. To make the historic breakthrough even sweeter, Gods and Monsters was a rare biopic of a queer historical figure not to cast a straight actor in the leading role.\n➼ Seemingly not that thrilled to be there is Griffiths’s Hilary and Jackie co-star Emily Watson (first row, farthest right), nominated for Best Actress.\n➼ Nominees Diane Warren (second row, center, left of statue; Best Original Song for “I Don’t Want to Miss a Thing”) and Marc Shaiman (second row, center, left of statue; Best Original Musical/Comedy Score for Patch Adams) have now, by 2021, combined for 19 Oscar nominations and zero wins. Fix it, Academy!\n➼ Steven Spielberg (back row, 13th from right) dressed casually in a grey V-neck and white undershirt is about to win Best Director for Saving Private Ryan, an award that has eluded him ever since.\n72nd Academy Awards (2000)\nThe dueling Best Picture frontrunners made their own little V.I.P. section in 1999: American Beauty’s director Sam Mendes (back row, 11th from left) and screenwriter Alan Ball (back row, tenth from left) cluster together here with their main competition, The Cider House Rules’ director Lasse Hallström (third row, 13th from left) and author and screenwriter John Irving (back row, ninth from left). Their opposing campaigns weren’t quite as civil, led between titans running their mini-studios: Dreamworks’ Steven Spielberg and Miramax’s Harvey Weinstein (neither pictured).\nThe Best Actor slate’s placement around the oversize Oscar is its own metaphor: winner Kevin Spacey (front row, center, right of statue; American Beauty) is at Oscar’s side, with the year’s original favorite Denzel Washington (third row, center, right of statue; The Hurricane) lagging behind. But right aside them is late-career comeback nominee Richard Farnsworth (front row, center, second to right of statue) for The Straight Story, the category’s then-oldest nominee who would pass away a few months later. At Spacey’s side is the year’s most discussed male performer and nominee, Haley Joel Osment (front row, center, in front of Spacey; The Sixth Sense). They were in the middle of filming their impending bomb for next season Pay it Forward.\nHollywood royal couple Annette Bening and Warren Beatty (together, front row, far left) had three reasons to celebrate: her Best Actress nod for American Beauty, his Irwin G. Thalberg Memorial Award for career achievement, and their then-unborn baby. Eight months pregnant at the time, people joked that Bening might go into labor on stage. What a time!\nAlso look for:\n➼ Check out Tom Cruise (third row, sixth from left) and Russell Crowe (third row, seventh from left), both acting nominees, for Magnolia and The Insider, respectively, perhaps in the early stages of planning the Dark Universe before co-starring in 2017’s The Mummy.\n73rd Academy Awards (2001)\nThis was the year of Steven Soderbergh, even though he was nowhere to be found at the luncheon. Neither were the performers who’d go on to win Oscars for his films, Erin Brockovich’s Julia Roberts and Traffic’s Benicio Del Tory. Both films were Best Picture nominees, however, receiving a combined ten nominations that led to five wins. Traffic was represented at the luncheon by writer Stephen Gaghan (second row, sixth from left), who’d later win for Adapted Screenplay, and editor Stephen Mirrione (back row, eighth from right), who also won. Soderbergh’s absence from the luncheon, combined with Ridley Scott not being there to represent Gladiator, plus Chocolat director Lasse Hallstrom not getting any individual nominations, meant that the only Best Picture filmmaker to be present for the photo was Crouching Tiger, Hidden Dragon director Ang Lee (third row, second from right), who was the favorite to win in the Best Director category. (Despite having directed a Best Picture nominee in Sense and Sensibility in 1995, Lee didn’t get his first individual Oscar nominations until this year, as producer and director of Crouching Tiger, Hidden Dragon.) Soderbergh got directing nominations for both his films, and while neither secured the top award of the night, Soderbergh beat himself in Best Director with Traffic — the first time there had been a double nominee in that category since 1938, and the only time ever a double nominee ever went on to win. To make a little more history, Soderbergh was the first director since 1948 to have actors from multiple nominated movies win Oscars in the same year. Not a bad night.\nAlso look for:\n➼ In this year’s competition for “corner of the photo where you’d most like to be a fly in the risers,” we present Juliette Binoche, Jeff Bridges, Ellen Burstyn, and Marcia Gay Harden (second row, seventh through tenth from right).\n➼ Tom Hanks (second row, second from left), a Best Actor nominee for Cast Away, and Laura Linney (third row, sixth from right), up for Best Actress for You Can Count on Me, would later play husband and wife in 2016’s Sully.\n74th Academy Awards (2002)\nOld buds David Lynch and Sting (together, front row, eighth and ninth from the left) got to have a moment side-by-side at the luncheon for the 2001 Oscars, perhaps for a moment or two pretending that they were there, at last, nominated for Dune, the 1984 misadventure where Lynch directed Sting as the scantily clad antagonist Feyd. In reality, Sting was there as a Best Original Song nominee for “Until …” from Kate & Leopold, while Lynch was a Best Director nominee. Strangely, that was the only nomination Mulholland Dr. got, the first time a film in that category went otherwise unrecognized since 1986, when it also happened to Lynch’s Blue Velvet.\nAlso look for:\n➼ Hey, that’s Bob Balaban (front row, furthest left)! The character actor was a nominated producer for the Best Picture nominated Gosford Park.\n➼ Sidney Poitier (third row, farthest left) received an honorary Oscar this year, the same year that Denzel Washington (second row, seventh from left) won Best Actor for Training Day, becoming the first Black actor to do so since Poitier won for Lilies of the Field.\n➼ Aussies Nicole Kidman (third row, fifth from left; Best Actress nominee for Moulin Rouge!) and Russell Crowe (third row, sixth from left; Best Actor nominee for A Beautiful Mind) are friends in real life, and the year after this she would shout him out in her Best Actress acceptance speech after winning for The Hours.\n➼ Jennifer Connelly (third row, seventh from left; Best Supporting Actress winner for A Beautiful Mind) and Ben Kingsley (front row, fourth from right; Best Supporting Actor nominee for Sexy Beast) would co-star two years later in The House of Sand and Fog, for which Kingsley would also be nominated.\n75th Academy Awards (2003)\nThe thing everyone remembers best about the 75th Oscars is Adrien Brody (second row, seventh from right) winning for The Pianist (whose director, Roman Polanski, couldn’t accept his Best Director trophy because he was fleeing a prison sentence for statutory rape): the history Brody made as the youngest Best Actor winner ever, that Halle Berry kiss, his emotional speech. It still works in clip form, but the whole context makes it so much more special. The impending invasion of Iraq, which the U.S. launched the week after the taking of this photo, was on everyone’s mind, and Hollywood’s ambivalence about even having an Oscar ceremony that year was a major topic at the luncheon. The Academy was worried about politics in speeches. They doubled down on their perennially ill-judged attempt to control the speeches and gave the attending nominees the rundown: name no more than five people, don’t pull out a sheet of paper, keep it to 30 seconds. Brody was clearly there, so surely got the memo, but he broke almost all of those rules on Oscar night. The result was perfect television.\nAlso look for:\n➼ It’s worth noting that Queen Latifah (second row, far right) looks far less relaxed than her photo neighbor, Harvey Weinsten (second row, second from right).\n➼ Just as Julianne Moore (front row, tenth from left) was situated next to one of her most frequent collaborators, Paul Thomas Anderson, in 1997, this year, Moore was next to her Far From Heaven director Todd Haynes (front row, 11th from left).\n➼ Please note that Martin Scorsese (front, center, second right from statue) is alone here, his regular leading man Leonardo DiCaprio nowhere in sight. DiCaprio wasn’t nominated that season despite an otherwise impressive ten-nod haul for Gangs of New York. Sound familiar? Last Oscar season, Martin Scorsese was back but his other regular leading man, Robert De Niro, wasn’t nominated despite an otherwise impressive ten-nod haul for The Irishman.\n76th Academy Awards (2004)\nWhat was absolutely certain at this year’s party? That The Lord of the Rings: The Return of the King was about to dominate. What was less than certain? Where the camera was.\nPeter Jackson (third row, 3rd from right) and his team would see the franchise’s multi-year gamble pay off by winning all in of its 11 nominated categories, Oscar’s biggest clean sweep ever (considering both Titanic and Ben-Hur missed on some of their nominations). Young Keisha Castle-Hughes (front row, center, right of statue) surprised by landing in Best Actress for her role in Whale Rider, despite a supporting campaign for Whale Rider - but that didn’t keep her from hanging close to her former competition, nominees Patricia Clarkson (front row, center, 3rd from right of statue) and Marcia Gay Harden (front row, center, 2nd from right of statue). Supporting Actress was long expected to be (luncheon no-show) Renée Zellweger’s for Cold Mountain, but a late surge for House of Sand and Fog’s Shohreh Aghdashloo (second row, 3rd from right) stoked Harvey Weinstein’s campaign fury. Meanwhile, both leading acting categories were highly competitive, but most of those male nominees sat this party out. The Best Actress frontrunners — Charlize Theron (third row, 6th from left), for Monster’s transformation, and Diane Keaton (back row, 5th from right), for her mid-Something’s Gotta Give comeback — both wore white.\nAlso look for:\n➼ Married songwriters Michael McKean and Annette O’Toole (second row, third and fourth from left) were nominated this year for writing “A Kiss at the End of the Rainbow” for Christopher Guest’s A Mighty Wind.\n➼ Almost everybody in this year’s class photo looks distracted by something, in particular Best Director nominee and Best Screenplay winner Sofia Coppola (front row, eighth from left) and Best Actor winner Sean Penn (front row, ninth from left).\n➼ Best Supporting Actor nominee Benicio Del Toro (back row, far right) wins the year’s best-dressed prize, a marked difference from his tortured 21 Grams character.\n➼ A big year for moms, according to an Los Angeles Times trend piece. Charlize Theron brought hers, as did Penn and Keisha Castle-Hughes.\n77th Academy Awards (2005)\nThe 77th Oscars gave us a continuation of a great modern micro-rivalry at the Academy Awards. That year Annette Bening (fourth row, 12th from left) earned her third nomination overall and second for Best Actress thanks to her turn in Being Julia. (To date, Bening has earned four nominations, but was inexplicably not given one for her swaggering, scene-stealing role in Captain Marvel.) The actress carried Being Julia as its titular character, and as the most classic sort of Hollywood star among the nominees it seemed like 2005 might finally be her year to break her tough streak. Unfortunately for Bening, she was up for the honor alongside Hilary Swank (second row, ninth from left), who had triumphed over her five years earlier on the strength of a landmark performance in Boys Don’t Cry. And the thing about Swank is: when she gets nominated for an Oscar, she wins.\nIt was a fantastic year for Best Actress overall, with Academy voters recognizing great work by Imelda Staunton (front row, center, second to right of statue) in Mike Leigh’s abortionist drama Vera Drake, Kate Winslet (fifth row, fifth from left) in the Charlie Kaufman (fifth row, far left) film Eternal Sunshine of the Spotless Mind, and a breakthrough performance by 23-year-old Colombian actress Catalina Sandino Moreno (second row, seventh from left) for the indie Maria Full of Grace. But it was the Million Dollar Baby star who made her Academy record two-for-two that year, beating out Bening once again for the little gold man.\nAlso look for:\n➼ Any time we can get a Titanic reunion, we’ll take it, so celebrate Leonardo DiCaprio (back row, seventh from left), a Best Actor nominee for The Aviator, and Winslet getting to pal around together for an afternoon.\n➼ Bening was situated next to Best Original Song nominee Adam Duritz (fourth row, 11th from left) from Counting Crows, who co-wrote the nominated Shrek 2 song “Accidentally in Love.” Perhaps that’s why she’s got both hands on the shoulders of Don Cheadle (third row, just to left of statue), ready to bail out of any ogre-related conversations as necessary.\n➼ This year’s set of “photo participants who we wish later collaborated on a heist movie” were Swank, Julie Delpy (third row, 8th from left; there for Best Adapted Screenplay, Before Sunset), Laura Linney (third row, center, third to left of statue; Best Supporting Actress, Kinsey), Cate Blanchett (second row, center, second to left of statue; Best Supporting Actress, The Aviator), and Sophie Okonedo (second row, center, left of statue; Best Supporting Actress, Hotel Rwanda).\n78th Academy Awards (2006)\nOn the left is Paul Haggis (second row, seventh from left), director and producer of Crash. On the right is his co-producer, Cathy Schulman (second row, eighth from left). Together, they would later pull off an infamous Oscars upset, winning Best Picture over presumed favorite Brokeback Mountain. The narrative throughout this Oscar Season was that the “gay cowboy” movie was a lock for a historic Best Picture win, having enjoyed wide critical acclaim and winning precursors from most major critics circles, the Writers Guild, Directors Guild, Producers Guild, and the Best Drama Golden Globe. In the end, the Academy split the vote, giving Lee Best Director and Crash Best Picture. The success, acclaim, and high visibility of Brokeback Mountain also represented the dominant narrative of 2005, that LGBTQ films were finally receiving recognition and consideration (Brokeback Mountain was nominated alongside Capote and Transamerica). The Oscars have come along way since 2005 in regards to nominating LGBTQ stories and openly gay creators, and Oscar voters largely regret the Crash Best Picture win.\nAlso look for:\n➼ Amy Adams (front row, second from left) got her first Oscar nomination this year for her supporting turn in Junebug. She didn’t win then, and she still hasn’t won now. But perhaps she got a chance at the luncheon to chat with future two-time co-star Joaquin Phoenix (back row, 12th from left), who was nominated this year for playing Johnny Cash in Walk the Line, and would later appear with Adams in Her and The Master.\n➼ It’s always bittersweet to see Michelle Williams and Heath Ledger (fourth row, ninth and tenth from right), both nominated for Brokeback Mountain, together.\n➼ Best Costume Design nominee Sandy Powell (front row, ninth from right), there for Mrs. Henderson Presents, and Walk the Line’s Best Actress winner Reese Witherspoon (front row, eighth from right) standing next to each other serves as a reminder that Powell has never done costumes for a Witherspoon movie, which is a shame.\n79th Academy Awards (2007)\nAt long last, the anointing of Martin Scorsese (third row, 3rd from right) would come! With onetime frontrunner Dreamgirls disappointing on nomination morning after a year-long campaign that wore its Oscar goals on its sequined sleeves, the runway was cleared for Scorsese to finally be awarded for The Departed — which wasn’t even originally thought to be an awards play at all. Together here with his nominated editor, Thelma Schoonmaker (third row, 4th from right) and supporting player Mark Wahlberg (back row, 2nd from right), it was looking like it would be smooth sailing for the master if Little Miss Sunshine’s tide could be kept at bay.\nAs unstoppable as the Scorsese train was, even more of an iron-clad lock was Helen Mirren (front row, 6th from right) as the living Queen Elizabeth in The Queen, a performance that remained unrivaled (not even by Meryl Streep’s Miranda Priestley) all season long. The steadily diminishing response to Dreamgirls did nothing to prevent Jennifer Hudson (back row, 3rd from right)’s much-expected win for her instantly storied rendition of “And I Am Telling You (I’m Not Going),” but her shine would affect her frontrunner costar. Eddie Murphy (second row, 11th from left) had taken all of the season’s precursor awards in a well-earned comeback legacy narrative, but voters looking somewhere to place their love for Sunshine resulted in a late surge of support for Alan Arkin (front row, far right). After losing, Murphy left the ceremony altogether.\nAlso look for:\n➼ Leonardo DiCaprio (third row, fifth from right) was actually not nominated for his lead performance in the Best Picture winner The Departed; he was nominated for his performance in Blood Diamond. That didn’t stop him from clustering with his Departed crew: director Martin Scorsese (third row, third from right) and editor Thelma Schoonmaker (third row, fourth from right), both of whom would win Oscars.\n➼ There’s no real significance to the fact that Melissa Etheridge (back row, tenth from right; Best Original Song winner for “I Need to Wake Up” from An Inconvenient Truth) and Steven Spielberg (back row, ninth from right; producer of Best Picture nominee Letters from Iwo Jima) are situated next to each other for the photo, but it’s worth noting.\n➼ Ten-year-old Abigail Breslin (front row, fourth from right), nominated for Best Supporting Actress for her role in Little Miss Sunshine, was spotted “trading high fives” with Leo at the luncheon.\n80th Academy Awards (2008)\nThe most pressing worry hanging over the event was the ongoing Writers Strike, which threatened to derail the Academy Awards. The nominated writers and several politically minded celebrities including George Clooney (second row, center, second to left of statue) and Michael Moore (fourth row, sixth from right) indicated that they would not attend the Oscars the following month if an agreement had not been reached, but the luncheon wasn’t considered breaking a picket line since it was a non-scripted celebration. Every nominated original and adapted screenplay writer showed up, which is rare for these functions. (Considering that achievement, how can we not point them all out? The original screenplay nominees were winner Diablo Cody (fourth row, 12th from right) for Juno; Nancy Oliver (third row, ninth from right) for Lars and the Real Girl; Tony Gilroy (back row, 13th from left) for Michael Clayton; Brad Bird (fourth row, eighth from right), Jan Pinkava (third row, third from left), and Jim Capobianco (fourth row, 13th from left) for Ratatouille; and Tamara Jenkins (second row, fifth from right) for The Savages. Your adapted screenplay nominees were winners Joel Coen (fourth row, tenth from right) and Ethan Coen (third row, ninth from left) for No Country for Old Men; Christopher Hampton (front row, furthest right) for Atonement; Sarah Polley (front row, fifth from left) for Away from Her; Ronald Harwood (front row, center, sitting on statue) for The Diving Bell and the Butterfly; and Paul Thomas Anderson (third row, tenth from left) for There Will Be Blood.)\nThe other hot topic of the day was the brightest new star in the room. Elliot Page (front row, second from left) was nominated for Best Actress for playing a pregnant teenager in the sleeper smash hit Juno. Thirteen years before they came out as trans, Page was already dodging the more gendered line of questioning actresses (not actors) always get at these events about ‘‘who they’re wearing.’ They deflected with jokes, “I took my old prison uniform and then just learned how to sew.” Clooney was asked about giving advice to the young star and said that Page was “too smart” to need it. Page was reportedly excited to meet the legendary Sissy Spacek (not pictured), who was there to support her husband, production designer Jack Fisk (back row, center, third from left of statue), nominated for his work on There Will Be Blood.\nAlso look for:\n➼ Best Original Song nominees (and eventual winners ) Glen Hansard and Marketa Irglova (back row, 15th and 16th from left) were enjoying their one and only experience with their indie hit film Once.\n➼ Julian Schnabel (back row, 18th from left), nominated for Best Director for The Diving Bell and the Butterfly, had a chance to reunite with Javier Bardem (directly in front of Schabel), who was a Best Supporting Actor nominee for No Country for Old Men). Schnabel directed Bardem to his first Oscar nomination in 2000’s Before Night Falls.\n81st Academy Awards (2009)\nKate Winslet (second row, fourth from left) spent the 2008-2009 award season trying to navigate around having two roles in serious contention by way of strategic category fraud (though she only shows up in the luncheon photo once). The part of miserable housewife April Wheeler in Revolutionary Road was clearly a leading role. The one of illiterate Nazi Hanna Schmitz in The Reader, though — that, one could argue, could go either way. And go either way it did! At the Golden Globes, Winslet successfully maneuvered her way into getting nominated for Lead Actress for Revolutionary Road and Supporting Actress for The Reader, a gambit that paid off when she won for both. At the BAFTAs, she ended up competing against herself when she was nominated for Leading Actress for her work in both films, ultimately winning for The Reader. But the Academy really didn’t go for Revolutionary Road, which received a Supporting Actor nod for Michael Shannon (back row, 11th from right) and desultory nominations for Art Direction and Costume Design but nothing for Winslet or her co-star Leonardo DiCaprio. That left Winslet’s shaky lead in The Reader as her only nomination. It didn’t seem to bother voters, who handed her the win.\nAlso look for:\n➼ Here’s Best Actor nominee for The Wrestler Mickey Rourke (center, two up from the Oscar statue) rocking an incredibly Mickey Rourke–esque lewk to celebrate his nod.\n➼ Meanwhile, Best Supporting Actor nominee for Tropic Thunder, Robert Downey Jr. (third row, ninth from the left) was also enjoying a career year for his debut as Marvel’s Iron Man. For the sequel two years later, he’d face off against a villain played by none other than … Mickey Rourke!\n➼ Doubt’s dual Best Supporting Actress nominees Amy Adams and Viola Davis (third row, seventh and eighth from right) truly said “we will bring the pop of color in this otherwise drab tableau.”\n➼ Aside from the posthumous Best Supporting Actor award that went to Heath Ledger, Richard King (back row, fourth from left) nabbing Best Sound Editing was the only win for The Dark Knight, which (alongside its director Christopher Nolan) was widely considered to have been snubbed in the big categories.\n82nd Academy Awards (2010)\nNot every Oscars innovation is a bad idea. After The Dark Knight’s Best Picture snub spurred a popular uproar, the Academy doubled the size of the category to ten nominees, hoping that big, mainstream hits could still be represented in the telecast. (The category later changed its rules again to feature up to ten nominees, which in practice always meant eight or nine, but next year it’s back to a guaranteed ten.) The first year of the expanded Best Picture field worked exactly as intended, as voters found room for box-office smashes like The Blind Side, District 9, and Up. The race came down to two films that exemplified each end of the commercial spectrum: Avatar, a CGI fantasy epic that made more money than any movie ever had before; and The Hurt Locker, a spartan war drama that earned less than $20 million at the domestic box office. To heighten the comparison even further, the films’ directors, James Cameron (back row, sixth from left) and Kathryn Bigelow (second row, third from right), just so happened to be ex-spouses. (Though they said all the right things about each other on the trail, for the nominee photo they were placed as far apart as humanly possible — Cameron stands in the top left corner next to George Clooney (back row, fifth from left), looking down, while Bigelow is near the bottom right corner, sandwiched between The Hurt Locker star Jeremy Renner (second row, second from right and Morgan Freeman (second row, fourth from right).\nAs Cameron predicted, it was Bigelow who came out on top. On Oscar night, The Hurt Locker won both Best Director and Best Picture, setting two different records: Bigelow became the first female directing winner, and her movie became the lowest-grossing Best Picture winner (adjusted for inflation) in Academy history. It was a fitting preview of the coming decade at the Oscars, which saw the Academy struggle to balance recognition, relevance, and representation.\nAlso look for:\n➼ Jason Reitman (second row, sixth from right) got a Best Director nomination for Up in the Air. He shared the Best Picture nomination with his father, the famous director Ivan Reitman (second row, fifth from right), since they were both producers.\n➼ This year’s photo placement that most makes us fantasize about a future collaboration: Lee Daniels (fourth row, second from left) (Best Director nominee for Precious) and Meryl Streep (fourth row, third from left) (Best Actress nominee for Julie & Julia).\n➼ This year’s Best Actor and Best Actress winners — Jeff Bridges (second row, furthest left) (Crazy Heart) and Sandra Bullock (second row, second from left) (The Blind Side) — are situated side-by-side here, a first for this collection of class photos.\n83rd Academy Awards (2011)\nBest Picture nominee The Fighter was director David O. Russell (back row, center, 2nd left of statue)’s third straight movie working with Mark Wahlberg (back row, center, left of statue). (Well, not counting the misbegotten Nailed, which was shelved for years and ultimately released pseudonymously as Accidental Love.) The Fighter was a huge breakthrough for Russell, who previously had been known for making dark comedies and feuding on set with the likes of George Clooney and Lily Tomlin. All major cast members on The Fighter were nominated except Wahlberg, with Christian Bale (not pictured) and Melissa Leo (back row, 16th from left) going on to win. But Wahlberg was a producer on the film, so he got to attend the luncheon and pose side-by-side with his director. Their happy moment in the spotlight wouldn’t last for much longer. When Russell cast Bradley Cooper over Wahlberg for Silver Linings Playbook, the friendship reportedly dissolved.\nAlso look for:\n➼ Christopher Nolan (center, two to the left of Oscar statue) got his first ever Best Picture nomination for Inception, nine years after his first Oscar nomination for writing Memento.\n➼ Best Actress winner Natalie Portman (center, directly left of Oscar statue; Black Swan) and Best Actor nominee Javier Bardem (center, directly left of Portman; Biutiful) are here enjoying a reunion for their 2006 movie Goya’s Ghosts. What, you don’t remember Goya’s Ghosts? Milos Forman! The Spanish Inquisition! Natalie Portman playing multiple characters! Get into it!\n➼ Here are nominees Jesse Eisenberg (fourth row, fourth from right) (Best Actor, The Social Network) and Mark Ruffalo (fifth row, fourth from right; Best Supporting Actor, The Kids Are All Right), clearly in the early stages of planning to make the 2013 film Now You See Me together. At the event, Eisenberg joked that it felt like Bar Mitzvah season: “I had to go to bar mitzvahs every weekend, and this is like the same feeling: putting on a suit every weekend to go meet with a lot of Jews.”\n84th Academy Awards (2012)\n2011 was the year of The Help. Whatever that blockbuster’s faults, it deserves major retroactive love for the simple fact that it made Viola Davis (second row, 6th from right) and Octavia Spencer (top row, 11th from right), two very talented actresses who Hollywood otherwise might have ignored, into big stars. Today, Davis and Spencer are two of the most nominated Black women of all time, along with costume designer Ruth E. Carter — Davis has four nominations and one win, while Spencer and Carter are both three-and-one. At the time of this photo, the nomination record was smaller. Viola and the songwriter Siedah Garrett (second row, sixth from right) (Dreamgirls, Rio), standing next to each other, were both enjoying their second nominations, something that, among Black women, had only ever been accomplished by Whoopi Goldberg (The Color Purple, Ghost) and costume designers Sharen Davis (Ray, Dreamgirls) and the aforementioned Carter (Malcolm X, Amistad) before them.\nAlso look for:\n➼ It’s always worth pointing out when Martin Scorsese (back row, fifth from right; Best Director nominee for Hugo) and Steven Spielberg (back row, fourth from right; Best Picture nominee for War Horse) are adjacent to one another. A not-yet-disgraced Harvey Weinstein (not pictured) would greet Scorsese by asking, “Sequel? Gangs 2?” the New York Times reported.\n➼ There’s no real connection here between Best Supporting Actor nominee Jonah Hill (fourth row, sixth from right; Moneyball) and Best Original Song winner Bret McKenzie (fourth row, fifth from right; The Muppets), but they definitely probably had a good time together, right?\n➼ This year’s side-by-side pair we’d love to see collaborate: Michelle Williams (back row, 14th from right; Best Actress nominee for My Week with Marilyn) and Aaron Sorkin (back row, 13th from right; Best Adapted Screenplay nominee for Moneyball).\n➼ Hey it’s future Thunder Force co-stars Spencer (back row, 11th from right) and Melissa McCarthy (fifth row, fourth from right; Best Supporting Actress nominee for Bridesmaids)!\n➼ Filmmaker Terry George (second row, center, right of statue) is known for the Oscar-nominated screenplays of heavy dramas Hotel Rwanda and In the Name of the Father, but he also holds an obscure and adorable Oscar record. He and his daughter Oorlagh (third row, center, right of statue), all affectionate joy here at the luncheon, are the only father-daughter duo ever to win an Oscar together, for their short film The Shore (2011).\n85th Academy Awards (2013)\nBeasts of the Southern Wild was the little engine that could, and its tiny star Quvenzhané Wallis (front row, center, in front of statue) takes center stage here, puppy purse and all. The 9-year-old actress broke the record (set by Keisha Castle-Hughes less than a decade prior with Whale Rider) for the youngest ever lead actress nominated. Emmanuelle Riva (not pictured), nominated for Amour, was the oldest ever.\nMeanwhile, Kathryn Bigelow (fourth row, second from right) returned to the Oscar fold with Best Picture nominee Zero Dark Thirty, missing out on another Best Director bid while the film was embroiled in controversy for its depiction of torture. Bigelow’s producer Megan Ellison (third row, second from right) had her first nomination via her production company Annapurna Pictures, which would produce several Oscar contenders in the years to come before fizzling out in 2019 due to financial issues. (She and the company are just now getting back on their feet.) Ellison would fund the follow-up project of one of the major Oscar nominees in the room: David O. Russell (front row, far right) and his Silver Linings Playbook co-stars Jennifer Lawrence (back row, 14th from right) and Bradley Cooper (front row, center, right of statue), who collaborated on 2013’s American Hustle. Playbook was the first film nominated in each acting category in more than 30 years, winning for the ascendant Lawrence. After famously tripping on her way to the stage, she would less famously wish a happy birthday to fellow nominee Riva.\nAlso look for:\n➼ Here’s Tim Burton (fifth row, eighth from left; director of Best Animated Feature nominee Frankenweenie), Amy Adams (fifth row, ninth from left; Best Supporting Actress nominee for The Master), and Christoph Waltz (back row, eighth from right; Best Supporting Actor winner for Django Unchained) a scant two years before they would collaborate for zero Oscar nominations in Big Eyes!\n➼ The luncheon brought together the future Bruce Wayne and Lois Lane of the Snyder-verse: Right above Adams is Ben Affleck (back row, ninth from left), who would win his Oscar as Argo took Best Picture this year,\n➼ Future Interstellar co-stars Anne Hathaway (center, two above Oscar statue; Best Supporting Actress winner for Les Miserables) and Jessica Chastain (third row, 13th from right; Best Actress nominee for Zero Dark Thirty) were each feteing their second Oscar nominations.\n86th Academy Awards (2014)\nThe Best Actress category in 2014 was the most stacked lineup in Oscar history. The nominees had a total of six trophies between them: one for Cate Blanchett (fifth row, 14th from right; nominated for Blue Jasmine), one for Sandra Bullock (back row, second from left; Gravity), one for Judi Dench (not pictured; Philomena), three for Meryl Streep (back row, 12th from right; August: Osage County) — and while Amy Adams (back row, fifth from left; American Hustle) hadn’t won before (or, in a great injustice, since), she came into the ceremony with five prior nominations. (Thanks to Meryl skewing the stats, the total number of acting nominations ever between those five actresses was a staggering 41.) There was no surprise newcomer, no young spoiler; the Best Actress contenders of 2014 were all about institutional staying power. Blanchett was the runaway frontrunner to win for her Blue Jasmine performance, showing up to the luncheon in resplendent silver, ready to do precious-metal battle with the gold coat worn by eventual Supporting Actor winner Jared Leto (fourth row, center, third to left of statue) of Dallas Buyers Club. When she ultimately won, Blanchett became one of just 13 (at the time) living actors with multiple performance Oscars.\nAlso look for:\n➼ Hey, it’s Bono (second row, farthest right)! Enjoying his second career Oscar nomination for co-writing the nominated Best Original Song from Mandela: Long Walk to Freedom.\n➼ Pharrell Williams (back row, fifteenth from right), a Best Original Song nominee for “Happy” from Despicable Me 2, made headlines at the previous month’s Grammy Awards for his high-riding hat, and it was back in full force here among all the Oscar nominees.\n➼ Not sure why Spike Jonze (third row, second from left), the Best Original Screenplay winner for Her, decided to wear a barn coat to the luncheon, but honestly, work.\n➼ Hollywood is full of old loves, and this year, Best Actor winner Matthew McConaughey (third row, seventh from left) and Bullock, who dated for a while after they co-starred in A Time to Kill in 1996, were both on hand to reminisce, or not.\n87th Academy Awards (2015)\nThere are a few people of color in the luncheon photo this year — Oprah Winfrey (back row, 8th from left), Common (fifth row, center, 2nd to right of statue), and Isao Takahata (third row, far right), for example — but the major narrative surrounding the 2015 Oscars was that for the first time since 1998, all 20 nominations in the acting categories went to white actors. Notably, David Oyelowo was snubbed in the Best Actor category and Ava DuVernay did not receive a Director nomination for Best Picture nominee Selma. (The film’s only other nomination was for Best Original Song.) Furthermore, there were no women nominated in directing, screenwriting or cinematography categories.\nTo add insult to injury, the Academy fawned and buzzed over Clint Eastwood (back row, center, left of statue)’s American Sniper, nominating it for six Academy Awards. The movie was seen by many as racist and jingoistic, and that’s before we even get into its weird fake baby. Its massive box office success and popularity with conservative audiences illustrated a major divide in Hollywood. Overall, the blatant inequities exposed at the 87th Academy Awards were something of a flashpoint, leading to the #OscarsSoWhite movement the following year.\nAlso look for:\n➼ Adjacent acting winners alert! Best Supporting Actor winner J.K. Simmons (fifth row, fifth from right; Whiplash) and Patricia Arquette (fifth row, fourth from right; Boyhood) probably talked about what shoo-ins they were to win.\n➼ Three years after Crazy, Stupid Love did not manage to rustle up any awards talk at all, that movie’s father-mother-daughter trio of Steve Carell (back row, ninth from right; Best Actor, Foxcatcher), Julianne Moore (back row, farthest left; Best Actress, Still Alice), and Emma Stone (front row, third from right; Best Supporting Actress, Birdman) were all nominated, and Moore won.\n➼ Oprah Winfrey (back row, eighth from left) was nominated as a producer on Best Picture nominee Selma, her first time competing for an Oscar since her Best Supporting Actress nod for The Color Purple in 1985.\n➼ Why is Best Actress nominee Reese Witherspoon (second-last row, fifth from left) making a face? Maybe because she has to be two rows removed from her Wild co-star (and future Big Little Lies rival) Laura Dern (back row, sixth from left).\n88th Academy Awards (2016)\nWith everything else going on at the 2015 Oscars — from Leonardo DiCaprio (fifth row, tenth from left)’s quest to finally win Best Actor, to Spotlight acting as David to The Revenant’s Goliath, to an #Oscars SoWhite controversy best exemplified by The Weeknd (back row, sixth from left; Best Original Song nominee for Fifty Shades of Grey) being the only black nominee in this entire group photo — it was also a cinematography heavyweight bout. Emmanuel Lubezki (back row, eighth from right; The Revenant) and Roger Deakins (back row, seventh from right; Sicario) represented (at the time) 21 nominations and two wins between them. Lubezki was on the eve of winning an unprecedented third consecutive Best Cinematography Oscar. He’d previously won for the effects-heavy Gravity and replicating a single-take in Birdman. This time, he’d be winning for the outdoor theatrics of The Revenant. Deakins, meanwhile, would lose this time around for Sicario but would get his big breakthrough win for 2017’s Blade Runner 2049 and took home his second last year for his own single-take magic in 1917.\nAlso look for:\n➼ This was the year of Lady Gaga’s (fourth row, fourth from left) first Oscar nomination, for co-writing “Til It Happens to You” from The Hunting Ground along with Oscar luncheon mainstay Diane Warren (second row, tenth from right). They lost to the James Bond song by Sam Smith (fifth row, fifth from right), somehow.\n➼ Best Actress nominee Charlotte Rampling (fourth row, seventh from left; 45 Years) and Best Supporting Actor nominee Sylvester Stallone (back row, tenth from right; Creed) previously starred together 40 years ago in the 1975 Raymond Chandler mystery adaptation Farewell, My Lovely.\n89th Academy Awards (2017)\nThis was the Oscars with the La La Land/Moonlight Best Picture debacle, which understandably obliterates memories of any other part of the ceremony. But it was also a notable year for the Best Documentary Feature category. In addition to Gianfranco Rosi (fourth row, center)’s Fire at Sea, the category featured the work of four Black filmmakers — Ava DuVernay’s 13th, Ezra Edelman (fifth row, 11th from right)’s O.J.: Made in America, Raoul Peck (fifth row, 4th from the left)’s I Am Not Your Negro, and Roger Ross Williams (top row, 15th from left)’s Life, Animated — all of whom but DuVernay made their way to the luncheon. It also tested the blurry boundaries between film and television when O.J.: Made in America nabbed the prize. Edelman’s O. J. Simpson epic technically qualified for the category, having premiered as a 467-minute epic (with a lunch break) at Sundance and played in theaters in New York and L.A. for the very committed. But most people experienced it as a five-part series, either on TV or streaming — which, you could make a very convincing case, is how it was always intended to be seen. While the film remains a record-holder as the longest one to win an Oscar, it also became the last of its kind. A few months later, the Academy passed a new rule banning multi-part and limited series from the category.\nAlso look for:\n➼ The Help reunion alert! Nominees Emma Stone (front row, fifth from left) (Best Actress winner for La La Land), Viola Davis (fifth row, fourth from right) (Best Supporting Actress winner for Fences), and Octavia Spencer (first row, eighth from left) (Best Supporting Actress nominee for Hidden Figures) were all nominated. Stone and Davis winning together was the first time that actresses who’d previously been co-stars won Oscars in the same year since The Gift stars Hilary Swank and Cate Blanchett won Actress and Supporting Actress in 2004.\n➼ Pharrell Williams (center, to the left of Oscar statue) was nominated once again, this time as a producer on the Best Picture–nominated Hidden Figures. Last time, he rocked that one hat, this time he showed love for NASA and the Black women spotlighted in his film.\n➼ Lion co-stars and nominees Nicole Kidman (fifth row, 14th from right) and Dev Patel (fifth row, 13th from right) had to stand next to Mel Gibson for the photo, but hopefully they snubbed him.\n➼ This year’s Adjacent Nominees We’d Like to See Co-Star in Something (Preferably a Romantic Thriller): Denzel Washington (fifth row, 11th from left; Best Actor nominee for Fences) and Isabelle Huppert (back row, ninth from left; Best Actress nominee for Elle).\n➼ Sound mixer Kevin O’Connell (second row, center, right of statue), seen here making a premonitory excited face, finally broke his record losing streak this year with an award for Hacksaw Ridge that he shared with Peter Grace (not pictured), Robert Mackenzie (third row, 11th from left), and Andy Wright (third row, 10th from left).\n➼ Casey Affleck (third row, fourth from left; Best Actor for Manchester by the Sea), dealing with sexual-harassment allegations that he denied but was “prohibited from discussing” as part of a settlement, looks moodier here than he seemed to be at the luncheon. A behind-the-scenes L.A. Times image (seventh one down) shows him cheerily embracing and kissing a grinning Spencer as they prepared for the group shot. He won in his category, she lost in hers.\n90th Academy Awards (2018)\nLet’s start with a face you won’t see amid the 2017 Oscar class: Tiffany Haddish, onetime supporting-actress hopeful for the breakout summer comedy Girls Trip. What started as a bit of wishful thinking on the media’s part felt like a genuine possibility by the time nominations rolled around, even though she had missed out on key precursors. If Melissa McCarthy could get recognition for her rowdy turn in Bridesmaids, why not Haddish, too? Alas, Universal Pictures was busy prioritizing Get Out, another mega-hit that became an unlikely awards darling. That campaign, thankfully, paid off. Jordan Peele (fifth row, 9th from right)’s directorial debut made him one of several crossover successes, including Greta Gerwig (back row, 12th from right), whose own behind-the-camera debut, Lady Bird, anointed her the fifth female Best Director nominee in the Oscars’ history. (While presenting at the Golden Globes that January, Gerwig’s pal Natalie Portman memorably called out the “all-male nominees” in that ceremony’s directing field.)\nIn the photo, Gerwig is sandwiched between her future Little Women actress Meryl Streep (back row, 12th from right) and documentarian JR (back row, 10th from right) holding a life-size cardboard cutout of the great Agnès Varda (they were nominated together in Best Documentary Feature for Faces Places). A few rows down stood Timothée Chalamet (third row, 4th to right of statue), immediately christened a major star following the triple punch of Call Me by Your Name, Lady Bird and his jawline. Elsewhere, you’ll spot Mudbound’s Mary J. Blige (back row, 2nd from left), who represented a significant breakthrough, becoming Netflix’s inaugural acting nominee at a time when streaming services were still striving for Hollywood prestige. Blige was also the first person ever nominated for an acting performance and Best Original Song in the same year.\nAlso look for:\n➼ Kobe Bryant (center, to the right of Oscar statue) became an Oscar winner this year, along with animator Glenn Keane, for the animated short film Dear Basketball. “It became very clear at the luncheon that there are movie stars, and then there are star stars, and everybody in that room wanted to get a picture with Kobe Bryant,” Pond says. “That includes all of the movie stars there.”\n➼ This trio of filmmakers is quite formidable: Steven Spielberg (back row, seventh from right) (producer of Best Picture nominee The Post), Luca Guadagnino (back row, sixth from right) (producer of Best Picture nominee Call Me By Your Name), and Peele. At the lunch, however, Spielberg insisted on sitting next to Gerwig, he told Vanity Fair. In a fit of merriment, he and del Toro wound up taking a selfie with her.\n➼ Attention should be paid to Emily V. Gordon (second row, second from left) (Best Original Screenplay nominee for The Big Sick) for bringing a much needed pop of color into this tableau.\n91st Academy Awards (2019)\nThe 2019 Oscars were particularly snakebitten. First, the Academy announced the invention of an award celebrating “popular film,” which kicked up such a fuss that the idea was withdrawn weeks later. Then, when months passed without a hosting announcement, the Academy revealed it was having trouble finding anyone who wanted to do it. This was followed shortly by the news that, actually Kevin Hart would host, but a PR kerfuffle over the comedian’s history of anti-gay jokes ended with Hart dropping out, and the show going host-less. The actual awards were hardly less controversial. The season’s most polarizing contender was Peter Farrelly’s Green Book, a buddy comedy about a gay Black pianist (Mahershala Ali, third row, 10th from left) and his white working-class chauffeur (Viggo Mortensen, front row, 5th from right) that depending on who you talked to was either an inspiring story about overcoming differences, or dated, tone-deaf claptrap. The movie spent the autumn stepping on rakes: Mortensen uttered the N-word during a Q&A, and the real pianist’s family revealed they had not been consulted on the film.\nNone of this dimmed Green Book’s awards fortunes, even when everyone remembered a bunch of gross stuff about Farrelly the week after his movie won big at the Golden Globes. The Cut noted that Farrelly used to habitually expose himself on film sets as a joke — a 1998 Observer item has him bragging about pretending his penis was a belt buckle “easily 500 times,” though his rep said he was “embarrassed” by his old behavior — and Twitter rediscovered screenwriter Nick Vallelonga’s tweets endorsing the debunked conspiracy theory about New Jersey Muslims cheering on 9/11. Despite — or perhaps, because of — the controversy, voters rallied around the film, handing it Best Supporting Actor, Best Original Screenplay, and finally, Best Picture. Suddenly, Moonlight’s win felt much longer than two years in the past.\nAlso look for:\n➼ Sam Elliott (back row, 15th from left; Best Supporting Actor nominee for A Star Is Born) looks about eight feet tall in this photo. Barry Jenkins (right in front of Elliott; Best Adapted Screenplay nominee for If Beale Street Could Talk) does not.\n➼ Diane Warren (third row, fifth from left; Best Original Song nominee for “I’ll Fight” from RBG) write a song for a Willem Dafoe (third row, fourth from left; Best Actor nominee for At Eternity’s Gate) movie challenge.\n➼ Spike Lee (back row, 14th from right; Best Adapted Screenplay winner for BlacKkKlansman) and Ruth E. Carter (back row, 15th from right; Best Costume Design winner for Black Panther) make a movie with Rachel Weisz (right in front of Spike; Best Supporting Actress nominee for The Favourite) challenge.\n➼ During this luncheon, Vanity Fair spotted Lee “holding what looked to be an excited, impromptu meeting” with Best Actor nominee Bradley Cooper (back row, seventh from left, two over from Lady Gaga; A Star Is Born). The men were gesticulating wildly and “Lee removed his glasses during the discussion to look Cooper directly in the eye.” (Two days earlier, at a Directors Guild event, Cooper stunned Lee by revealing that, when he still unknown, he had auditioned for a part in a Lee project years earlier.)\n➼ The New York Times caught Best Actress nominee Glenn Close (top row, third from left) mugging with Sam Elliott (top row, center, left of statue), Best Supporting Actor nominee for A Star Is Born and Closes’s professed “husband in another life.”\n92nd Academy Awards (2020)\nIt’s impossible not to be delighted by The Irishman costume designer Sandy Powell (second row, 13th from right) and Best Supporting Actress nominee for Richard Jewell Kathy Bates (second row, 12th from right) taking their place at the center of this photo, looking like a pair of time lords ready to send Bill and Ted (Taika Waititi, fourth row, 11th from right; Jojo Rabbit), and Bong Joon-ho, fourth row, tenth from right; Parasite) on an excellent adventure. The class of 2019 Oscar luncheon looks downright chaotic and unwieldy compared to the photo from 1984, and while we have a few extra Best Picture nominees these days, you can probably chalk up the expanding luncheon tableau to how much more seriously the Oscar campaigns are taken. Think of all those acting-category no-shows in ’84. In 2019, you practically need a doctor’s note to miss this important stop on the campaign trail. As much as it is an excuse to watch Hollywood’s brightest mix and mingle and swap sunglasses, the nominees’ luncheon is also one of the last chances for the Oscar nominees’ to get some good publicity in.\nAlso look for:\n➼ Robert De Niro (fourth row, fifth to left of center statue) wasn’t nominated for his lead performance in The Irishman, but he is here as a producer for the film, so maybe that’s why he’s throwing side-eye at someone.\n➼ Quentin Tarantino (fourth row, sixth to left of center statue) decided to wear a bowling shirt to commemorate his third career Best Director nomination, for Once Upon a Time in Hollywood.\n➼ Songwriters Robert Lopez and Kristen Anderson-Lopez (fifth row, center) had already won Best Original Song twice before their 2019 nomination for Frozen II, so maybe that’s why they’re clasping hands like they’re the goodwill ambassadors to Oscars Nation in this photo.\n95th Academy Awards (2023)\nMichelle Yeoh stands dead center with her hands clasped (fifth row, 14th from the right), awaiting the day the Academy picks their Best Actress with a posture made for magazines. After nearly 40 years in the film industry, and 25 years since her Hollywood debut, the Everything Everywhere All at Once star continues to radiate grace, long-overdue recognition from America’s preeminent film body notwithstanding. A different Best Actress nominee, Angela Bassett (first row, third from the right), smiles a little awkwardly, maybe because she’s underneath the arm of a beaming four-time nominee Tom Cruise (first row, fourth from the right). Pinocchio director Guillermo del Toro (first row, first from the right) faces the camera like a good kid at the mall photo studio, probably thinking about how he can free animation from the shackles of the form’s category and get it into the major leagues. The group photo has all the key elements of a senior-year class portrait taken in high-school auditorium — between the risers and the big curtain, the diverse smattering of faces and the polite smiles that look ready to tackle their next big challenge, it’s easy to forget that this is a portrait of a notable slice of the film industry. Let’s hope they all remember to take their picture-day slip home so their parents can order the wallet-size photos that sit unused in their family’s basement filing cabinet for posterity.\nAlso look for:\n➼First-time nominees Brian Tyree Henry (Best Supporting Actor nominee for Causeway) and Stephanie Hsu (Best Supporting Actress nominee for Everything Everywhere) stand next to 14-time nominee and composer Diane Warren (Best Original Song nominee for “Applause”), making a cool-kids corner out of the back row’s right side.\n➼Other first timers made a space for themselves in front of the group — Paul Mescal (Best Actor nominee for Aftersun) and the lauded Ke Huy Quan (Best Supporting Actor nominee for Everything Everywhere) sit center-left, the former in a good-boy pose that’s at odds with his chest-exposing collarless shirt, while the latter sports a cheerful grin.\n➼Cate Blanchett is tall in the back row, third from the left, knowing that her place in Oscars history is already secured with her record ten appearances in Best Picture nominees, eight nominations, and two wins. Today, she’s here for her Tár nod for Best Actress.\n➼Andrea Riseborough’s noticeable absence. She’s known for her controversial surprise Best Actress nomination for her performance in To Leslie, and did not attend the luncheon due to her shooting schedule, per reps.\n96th Academy Awards (2024)\nHenceforth known as the Year of the Sneeze. The 2024 luncheon portrait’s greatest feature comes courtesy of Best Original Screenplay nominee Arthur Harari (second row from the top, eighth from left; Anatomy of a Fall). He’s mid-sneeze (or perhaps mid-laugh?), and the reverberations throughout the pic are a joy to uncover. Anatomy of a Sneeze is sweeping the nation. Up a little to the right is Best Adapted Screenplay nominee Greta Gerwig (top row, 12th from left; Barbie), who has a fake smile that says, “I wasn’t nominated for Best Director again,” and eyes that are trained directly on Harari. Next to him is Best Actor nominee for The Holdovers Paul Giamatti, who is just attempting not to laugh. On Harari’s other side is the production designer for Poor Things, Shona Heath (second row from the top, sixth from left), who is fully laughing. They take a bunch of these pics every year, so it’s a little piece of magic that the best one for 2024 is the one with a sneeze. It’s a particularly easy photo to diagram because for once the nominees weren’t forced to pose in a semi-circle and are instead just grouped in straight lines. The luncheon photo has never felt more like school-picture day.\nAlso look for:\n➼American Fiction nominee Sterling K. Brown and Flamin’ Hot nominee Diane Warren (top row, second and third from right) posing next to each other. The two have worked together only once before, on 2017’s Marshall, but based on video evidence, Brown switched places to stand next to Warren. Unlikely animal friendships <3.\n➼Killers of the Flower Moon director Martin Scorsese (bottom row, third from right), flanked on all sides by a slew of powerful women, including Best Actress nominee Lily Gladstone (bottom row, fourth from right) and Best Supporting Actress nominee Da’Vine Joy Randolph (bottom row, second from right). A Scorsese Kill Bill starring these women could be something so powerful.\n➼Oppenheimer star Robert Downey Jr. (bottom row, first on left), the presumed winner of Best Supporting Actor, refusing to smile while he’s having the most prestigious year of his life.\n97th Academy Awards (2025)\nThe most notable thing about this photo, of course, is that it was not taken at a luncheon at all. The 2025 Oscar nominees luncheon was canceled on January 13 due to the L.A. wildfires. Instead, this photo was taken at a cocktail party and dinner that the Academy threw on February 25 at the Academy Museum. Notably not present in this photo is the first ever openly transgender performer nominated for an acting Oscar, Karla Sofía Gascón (not pictured), who was nominated for her work in Emilia Pérez. Following the Academy Award nominations coming out, many of Gascón’s old, offensive tweets resurfaced, and though she plans to attend the awards ceremony, she has not been seen at any of the lead-up events since. Still, her co-star Zoë Saldaña (bottom row, seventh from left) has soldiered on, sweeping the Supporting Actress categories at other awards shows and dancing her way toward a win.\nAlso look for:\n➼ Timothée Chalamet (third row from the top, first on the left), a second-time nominee for Best Actor in A Complete Unknown, sitting as far away in his seat as he can from A Complete Unknown’s sound designer Ted Caplan (third row from the top, second from the left).\n➼ The rest of the Best Actor category all sitting in the top row. Is this a Chalamet-less clique? One has to wonder. Specifically, Adrien Brody, Colman Domingo, and Sebastian Stan (top row, fifth, sixth, and seventh from the left) are all sitting together and probably tee-heeing about how weird Timothée Chalamet sits.\n➼Cynthia Erivo and Ariana Grande (bottom row, tenth and eleventh from the left), fresh off a pair of nominations for the first part of Wicked, are of course sitting together and of course the center of attention in the photo. What else would you expect from these two natural attention-grabbers?\n➼76-year-old Edward Lachman (bottom row, second from right) celebrating his fourth Oscar nomination, this time for Maria, by wearing a huge hat. Not pictured are Lachman’s eyes, because the hat is entirely covering them.",
  "word_count": 16166,
  "scraped_at": "2026-02-14T12:17:24.436457"
}