{
  "article_id": "e41ea3d39952",
  "url": "https://allafrica.com/stories/202509090259.html",
  "title": "Liberia : What Has Changed ? a Satiric Inquiry Into Liberia New Dawn",
  "date": "20250909T120000Z",
  "domain": "allafrica.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Liberia, the land where miracles often come disguised as road repairs and running water, is suddenly experiencing a new phenomenon: things are working. The lights stay on most of the time, the taps cough up water here and there, civil servants in most instances, actually get their pay on time, and brace themselves.\nMonrovia to the Southeast, including Zwedru, no longer feels like a near-death expedition. Instead of three weeks trapped in the mud, travelers now find themselves home in under a day.\nDriving from Browerville to Monrovia used to last from 90 mins to 2 hours plus depending on the situation. However, today, one spends less than 10-15 mins in Duala traffic and approximately 30 mins to get downtown. Why? Is this a miracle? Or perhaps just governance?\nThis naturally begs the question: what is President Joseph Nyuma Boakai doing that former President George Weah, Liberia's self-declared \"Bad Road Medicine,\" could not?\nKeep up with the latest headlines on WhatsApp | LinkedIn\nPresident Weah, the football legend who could conquer the world's toughest defenses who made Liberians proud- including folks from different political parties, (UP, CDD, NPP, LP, LAP and all the Ps) because of his exceptional soccer skills which kept the name Liberia on the world map, when the country was totally consumed by carnage and barbarism, somehow never managed to conquer Liberia's roads, especially the ones leading to his own home region. Under his watch, a journey to the Southeast was less travel and more pilgrimage.\nToday, thanks to Boakai's persistent push, the same roads are passable within 6-8 hours. Suddenly, Liberians can visit family without drafting their last wills and testaments. What has changed?\nHow come that King George with golden boots who conquered Milan, PSG, Chelsea, and the Ballon d'Or got defeated by roads and the lack of accountability? Imagine! Under his reign, traveling to the Southeast- even his hometown, Grand Kru, was less a journey and more an initiation ritual. Three days if you were lucky, two weeks if your ancestors were angry.\nUnder Boakai? Six to ten hours surprisingly during the raining season. People in Grand Gedeh, River Gee, Maryland, Grand Kru and Sinoe Counties now welcome visitors without them needing survival kits. Hopefully, River Cess will start enjoying similar experience.\nBut it is not only about seeing relative improvement in roads connectivity in Monrovia and rural Liberia, but electricity and water also seem to be the new national pride. What has changed? Liberian people are whispering that something unusual is happening lights are staying on, taps are trickling, and civil servants are smiling on payday, although UL adjunct instructors are still not receiving their salaries as the others. But Liberians are asking what this group is doing from the\nprevious government. For years, Liberians students studied by candlelight-sometimes leading to many houses being gutted by fire while communities fetched bucket water like Olympic athletes. Now, suddenly, electricity runs (almost) uninterrupted and water actually appears in pipes. Is this as a result of witch hunt, witchcraft activities or it's just leadership? Under Weah, Liberians lit candles and cursed power outages with the same frequency they checked the football scores.\nToday, however, the lights flicker less often, and piped water once the stuff of fairy tales is becoming a partial reality. Should we start handing out medals for ordinary services, or is this what leadership was supposed to mean all along? What is this group doing differently than its predecessors?\nCould this be about accountability with human face? Perhaps the real difference lies in Boakai's much-publicized performance report policy, where underperforming officials face punishment, suspension or outright dismissal. Could it be that this administration is engaging into witchcraft activities or witch hunting people? From the look of things, it seems that working with CSA to weed out ghost names from the payroll, placing astute technocrat as director of cabinet and former CSO activists and human right advocates in charge of governance can deliver real rime results.\nIt is about thinking about the wellbeing of Liberians and putting system in place while at the same time doing that little thing called accountability.\nJNB introduced a performance report policy while Manneh paid back 'passes' given by his buddies by allowing them to break public trust and go with impunity. Does it mean we are not seeing corruption under JNB's administration? Hell, yes, it is still around but it does not sound like the same old song. We still feel the impact and hear the drums of corruption beating. One thing though, Boakai at least seems to dance differently. The DJ is playing different rhythm with no more Buggar dance.\nThe 'Old Raise Car' rather than dancing is accelerating quickly suspending, dismissing and even embarrassing his own appointees when they betray public trust. That's the new music, which Manneh could possibly release in his well erupt studio. Are the current advisers and technocrats more patriotic and robust than their predecessors in handling the affairs of the country? What is this group doing differently?\nIn a country where government jobs were often lifetime trophies, the current approach is making some officials sweat more than usual. Underperform, and you're out. Liberia has long been considered transit country for drugs. In King George's Empire, a $100 million drug bust mysteriously dissolved into thin air, with suspects set free like doves on Independence Day.\nToday, DEA officers find themselves promptly punished for betraying the public trust. One might ask: is Liberia finally learning that accountability is not a suggestion but a practice? Truth be told, good governance is no witchcraft act at all and has nothing to do with witch hunting.\nOn the issues of Gender and Youth, former President Weah made more sweet promises, yes lovely ones. Deliver? Hummm, not so much. Women were often in their numbers at political rallies. Weah, self-declared 'feminist in chief', promised to prioritize the participation of more women in the electoral process. However, his administration saw one of the lowest rates for women in elective offices. Today, we see genuine attempts, women in decision-making spaces, not just in campaign jingles. In terms of Presidential nominations and appointments, women are\nincreasingly being appointed to ministerial positions, including the appointment of retired Brigadier General Geraldine Janet George as Liberia's first-ever female Minister of National Defense, marking a significant milestone in gender representation within the security sector. Women hold 35% of key decision-making positions occupying approximately 37.8% of cabinet posts (7 out of 19 ministers), a notable improvement over previous administrations) and county superintendent roles, as of JNB's State of the Nation Address (January 27, 2025). Hold on, this is not too huge, but could this be a good start? I think so.\nWhy is it that attempt to ensure equality and women political participation through the 30% quota was unfortunately vetoed under the presidency of Liberia's feminist in chief? Why Liberia's feminist in chief did not support any female candidate for the last senatorial election, given that the idea of feminism is about ensuring commitment to equal representation at all levels by reflecting the rights and needs of everyone, particularly women and girls? Another shift is Boakai's seriousness about gender inclusivity, long treated as political decoration in past administrations. Add to his administration's sharper focus on youth unemployment and the drug epidemic, and the contrast becomes glaring.\nOk, that is about gender and so what's about our poor youth, about jobs and drugs? Ah, our poor youth under the legend from Gibraltar were mostly an audience, used for votes, ignored afterward. The drug epidemic raged; unemployment soared. Now, at least, policies are being drafted, programs announced, and some seriousness is in the air. Will it solve everything? No.\nBut at least someone is acknowledging the problem instead of dribbling around it. It is reported that this administration sees the role of young Liberians as \"critical drivers of innovation, entrepreneurship, and social progress\".\nOn July 4, 2025, President Boakai launched the Presidential Vacation Enrichment Program and Community Service Projects giving over 400 students government scholarships across 20 universities and technical colleges.\nAdditionally, 100 young teachers were recruited from the scholarship pool to serve in schools, clinics, farms, and other community efforts. I understand that the Ministry of labour has recently employed more than 1200 students for vacation work.\nBut let's return to the bigger puzzle: why is Liberia witnessing relative improvements in governance now, under Boakai, when Weah had the same powers, the same resources, and arguably more public goodwill? Is it age, wisdom and a better team? Or simply the political will to say \"no\" to corruption and \"yes\" to accountability? Or perhaps it's a sobering reminder that fame from the soccer pitch does not automatically translate into success on the governance field.\nAfter all, managing a country is not like scoring goals, it requires rules, discipline, and the courage to bench underperformers and hunt the witches and the ghoststo mobilize resources for national development activities.\nAnd so we ask, half in jest, half in seriousness: What has changed in Liberia? Or maybe the real question is, why did it take this long for ordinary governance to feel extraordinary? A plausible guess is because our young people love for football (soccer) make them to not see beyond the harsh reality beyond the soccer field, hence could not listen or accept any other message from any leader. Manneh ruled with celebrity; Boakai governs with responsibility. Weah came with the\nglory of football but couldn't translate it to governance. Boakai came with age and wrinkles, yet somehow, he's making our roads smoother, our lights brighter, and our civil servants calmer. Strange, isn't it?\nShould Liberians start celebrating? No, No, No. Let's not get carried away. Liberia is 178 years old. Every president starts with \"change\" and ends with \"disappointment.\" But if basic things like electricity, water, and passable roads feel like revolutions, we can start embracing ourselves for real development. While JNB's efforts to govern properly is commendable, the recent U.S Department of State Human Right report noted significant human rights issues including- civil liberties, political rights, judicial independence, press freedom, and the protection of vulnerable populations.\nJNB assures both the Liberian people and the international community that the findings of the 2024 U.S. State Department Human Rights Report will be taken with the seriousness they merit and that necessary reforms will be pursued diligently to align Liberia's human rights environment with global standards. We will religiously monitor this commitment to track progress going forward.\nSo, let's not start celebrating too much because we have been fooled before. But if a government is committing itself to addressing the things that the report found and paying salaries on time, fixing roads, punishing corruption, and keeping the lights on feels like a revolution, then maybe, just maybe, our pooh should ask themselves why the ordinary still feels extraordinary.\nUnder Weah, darkness was our national anthem. 'Light gone oo', we will see it after weeks, by God's grace. But, under Boakai, our people can charge their phones and iron their clothes on the same day without needing a prayer warrior.\nOur youth can watch European league uninterrupted as students study their lessons without thinking when the candle will go off. Miracles or witch hunt?\nKing George was the \"Bad Road Medicine\" but never care much for roads beyond his comfort zones. The Southeast was a mud wrestling arena under him. Journeys lasted weeks, and only the strongest survived.\nUnder JNB, six to eight hours. Still rough, but at least travelers no longer need to rent overnight rooms in villages or sleep in the open air because \"bad road Medicine' did not fix the bad roads, although budgets were passed and allocated for those roads.\nCould it be that JNB is just lucky? Well, it seems that the Oldman invented something Weah thought was sorcery: performance reviews. He tells officials, \"Do your job, or pack your bags.\" His cabinet is not only obliged to deliver but his technicians are tracking deliverables and providing no none sense solutions to our perennial problems. Imagine under Weah, $100 million worth of drugs waltzed into thin air and suspects walked out free, smiling like lottery winners. Under Boakai, even DEA officers get suspended if they sneeze in the wrong direction.\nCorruption does not appear, to be out completely, but not like same old story. Corruption is still dancing but now at least the DJ changes the music. Boakai suspends people. Fires people. Embarrasses them publicly. It's refreshing, really. Under Weah, corruption was like a VIP guest, always present, always untouchable\nDoes this mean that JNB is doing more on Gender inclusivity than Manneh? Well, women under Weah were mostly campaign foot soldiers, clapping, dancing, and few will be accommodated. Under Boakai, some actually sit at the decision-making table. Not perfect, but at least they've moved from the photo backdrop to the policy front.\nFor our poor youth and the current drugs crisis, it's clear that under Weah, youth policy was basically football and free concerts without any sport academy. But at least Manneh constructed three sport parks. Thank you! However, now under the current administration, we are at least seeing that the drugs epidemic being given national attention and plans are being developed. Will it fix everything? Probably not. But at least the government admits drugs exist, instead of scoring own goals with silence.\nConclusion\nSo, what is this administration doing differently than the previous? In short, Weah governed like football, flashy, entertaining, but no goals scored in governance. Boakai governs like a school principal, strict, boring, but somehow the homework gets done.\nHe listens and acts, evident by the establishment of the War and Economic Crimes Court, which none of his post war predecessors did. He takes down party hierarchy, if caught in shaded deeds, he accounts for his external travels by publishing information. He knows that Liberia is far behind other African countries and wants to make change.\nBoakai may not be a miracle worker, but he is proving that governance is not witchcraft, it's discipline, systems, and accountability. And yes, we also owe Weah gratitude for conceding peacefully, a rare act in African politics. He preserved the peace; Boakai must now preserve the hope.\nIn all, Weah demonstrated sportsmanship and love for Liberia, when he said, \"This is a time for graciousness in defeat, a time to place our country above party, and patriotism above personal interest,\". May God bless Weah for preserving the peace that we now enjoy.",
  "word_count": 2416,
  "scraped_at": "2026-02-14T12:20:11.929170"
}