{
  "article_id": "e420aa30df36",
  "url": "https://www.marketscreener.com/quote/stock/HIGHLIGHT-EVENT-AND-ENTER-73825/news/Annual-Report-2022-HLEE-Group-increases-consolidated-sales-again-in-fiscal-year-2022-43684078/",
  "title": "Annual Report 2022 : HLEE Group increases consolidated sales again in fiscal year 2022",
  "date": "20230428T180000Z",
  "domain": "marketscreener.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Ad hoc release in accordance with Art. 53 of the Listing Rules\nPratteln, April 28, 2023\nAnnual Report 2022\nHLEE Group increases consolidated sales again in fiscal year 2022\n- Consolidated sales increased to CHF 524.0 million (previous year: CHF 508.9 million)\n-\nEBIT decreased to CHF -1.3 million (previous year: CHF 13.2 million)\n-\nConsolidated net result for the period was -21.1 million CHF (previous year: -2.1 million CHF)\n-\nThe equity ratio was stable at 28.2 % (previous year: 30.4 %). Consolidated total assets amounted to CHF 819.9 million (previous year: CHF 875.9 million)\nDevelopment of operating segments in 2022\nThere were eight in-house and co-productions in total in theatrical production. For example, shooting took place on the in-house productions “Manta Manta - Zwoter Teil” and “Rehragout-Rendezvous” in 2022. In addition to the international projects “Perfect Addiction” and “In the Lost Lands”, filming on “Hagen” began and will continue into 2023. In theatrical distribution, a total of seven films were released in German theaters in the financial year, including \"Guglhupfgeschwader\" from the Eberhofer series, \"Der Nachname\" with Florian David Fitz as well as \"After Forever\" from the successful After series. In the TV exploitation/license trading business area, numerous license sales of in-house and third-party productions were again realized in 2022, with both established and new partners. The first broadcast of \"Kaiserschmarrndrama\" achieved its usual high market shares, as did \"Der Vorname\".\nIn the Sports and Event segment, the TEAM group successfully launched the marketing of media and sponsorship rights for the UEFA Champions League, the UEFA Europa League and the UEFA Europa Conference League for the 2024-27 cycle. At Sport1, the focus in the 2022 financial year was again on consistent multimedia content use. In addition to strengthening the SPORT1 portfolio through the acquisition of new rights, such as in women's soccer, the extension of existing partnerships and the development of new content cooperations and business areas, the focus remains on cross-platform exploitation. In view of the still massively growing digital and cross-platform use of media offers, the digital diversification of the SPORT1 brand will also be further advanced. New content and marketing environments will be created at the same time - for example, evaluation on the digital platforms.\nOutlook for 2023\nDue to the continuing uncertain market situation caused by the inflation trend and the effects of the Ukraine crisis, the Board of Directors cannot rule out an impact on the Highlight Group's operating activities.\nAmong other things, the Highlight Group plans to return to a stable and commercially successful business with major growth potential in the Sports and Event segment with a strong theatrical program in the Film segment - such as \"Manta Manta-Zwoter Teil\" and \"Sonne und Beton\" - and the new Bundesliga rights such as women's soccer from the 2023/24 season.\nThe Annual General Meeting for fiscal 2022 is scheduled to take place in June 2023. The detailed 2022 Annual Report is available at https://www.hlee.ch/en/Interim-reports.\nContact:\nHighlight Event and Entertainment AG\nInvestor Relations\nNetzibodenstrasse 23b\n4133 Pratteln, Switzerland\nTel.: +41 41 226 05 97\nFax: +41 41 226 05 98\ninfo@hlee.ch\nhttp://www.hlee.ch",
  "word_count": 518,
  "scraped_at": "2026-02-14T12:15:06.050968"
}