{
  "article_id": "e45750482ffe",
  "url": "https://www.brentwoodlive.co.uk/news/24866981.caoimhe-bray-not-getting-cocky-despite-sterling-world-cup-debut/",
  "title": "Caoimhe Bray not getting cocky despite sterling World Cup debut",
  "date": "20250118T131500Z",
  "domain": "brentwoodlive.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "By Milly McEvoy, Sportsbeat\nCaoimhe Bray has announced herself on the world stage but insists she is keeping her head down in pursuit of the ultimate goal.\nThe 15-year-old all-rounder took three wickets for just one run and a stunning diving catch as Australia defeated Scotland in their opening match of the ICC U19 Women’s T20 World Cup 2025.\nHer exploits saw her win the Player of the Match award as her side began their quest for the title in near-perfect fashion.\n“It was pretty crazy, I wasn’t expecting that to happen,” Bray said on her Player-of-the-Match performance. “I am always happy with the win and glad to have that on top of it.\n“It is an awesome experience, getting out there, being able to sing the national anthem was really emotional and it was a really enjoyable experience.\n“I wasn’t expecting it to go that well, I will take it as it comes but it was a feel good, play good kind of a day and I just ended up hitting the stumps, so I will take it!\n“Today was almost literally perfect for the team. I think when we do that against an even stronger side in hopefully a semi or a final, we’ll hopefully almost definitely be winning it, and we’ll try to get that gold.\n“We played really well as a team today, we always gel well, we know each other well, we’ve got a lot of energy so I think that helps a lot.”\nAustralia were narrowly beaten by England in the semi-finals of the inaugural World Cup in 2023 and have retained several players from that tournament within their squad, including the leading wicket-taker in South Africa Maggie Clark.\nClark was the same age as Bray is now when she made her name in the tournament and Bray has relished being able to pick the brains of her more-experienced teammates.\nShe added: “There’s a few of them who have played in two World Cups now which is pretty cool and it is good to be able to ask them what was the last World Cup like compared with this one.\n“One of the things I ask is, do you reckon the chance is even bigger to win this year? And they are saying yes so that is good for us.\n“But we have just got to keep our heads down and don’t get too cocky and try and win those games and take it step by step.”\nBray is also able to tap into the experience of the Australia coaches, with former international Kristen Beams guiding the side through the campaign.\nIt is Bray’s goal to emulate Beams and current Australia superstar Ellyse Perry with whom she draws plenty of comparisons.\nPerry burst onto the scene as a 15-year-old and for the first few years of her career combined her cricketing exploits with football, or soccer.\nThe pair have now spent time on the same team after Bray made her Women’s Big Bash League debut for the Sydney Sixers last year.\n“I think a lot of people always said ‘ah Ellyse Perry’ to me because I play soccer and cricket,” Bray explained.\n“It is definitely coming up a lot more now and being able to play with her is even cooler.\n“The fact that she is not a cocky player at all, and is a really amazing person is what makes her the best person not just as a cricketer, and her humility.\n“But it is pretty cool to be compared to her playing both soccer and cricket but I am just trying to do my own thing.\n“I’d love to go far in both and it is definitely getting harder these days with more women in sport and it is getting more competitive.\n“I am just trying to do both as well as possible and they are both during different seasons so it is working out now.\n“The decision will have to come eventually but I am just trying to do for as long as I can because if I am enjoying it and I am loving it that is what is best for me.”\nAustralia are next in action on Monday when they will be seeking to get one over on Bangladesh, who beat them in the opening match of the World Cup in 2023.\nBangladesh also won their first game in Malaysia meaning the result on Monday could go a long way to deciding who tops the group.\nBray added: “It definitely will be a revenge match but our team is very strong and we won’t let that get in our mind.\n“It should still be a great match, no team is going under the radar and hopefully we can get the win over them this time.\"",
  "word_count": 796,
  "scraped_at": "2026-02-14T12:19:35.640812"
}