{
  "article_id": "e47be87fdc9b",
  "url": "https://www.testudotimes.com/maryland-news/86917/mm-1-2-maryland-womens-lacrosse-releases-2026-schedule",
  "title": "MM 1 . 2 : Maryland women lacrosse releases 2026 schedule",
  "date": "20260102T121500Z",
  "domain": "testudotimes.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Maryland women’s lacrosse has rung in the new year by officially announcing its schedule for the 2026 season.\nMM 1.2: Maryland women’s lacrosse releases 2026 schedule\nThis is the Maryland Minute, a short story followed by a roundup of Terps-related news.\nThe Terps haven’t returned to the NCAA’s championship game since winning the tournament in 2019, following a period where the Terps fought for the title in six of seven straight seasons.\nTheir schedule could turn out to be an important part of the team’s preparation — eight opponents finished in the final Division I top-25 media poll of last season.\nThe Terps begin the year at Syracuse on Feb. 6, opening their home slate in SECU Stadium against Virginia on Valentine’s Day. A home tilt against Princeton on Feb. 28 will be an important measure of the team’s progress.\nAn eight-game conference slate briefly begins at Oregon on March 14 but is interrupted by a game against Penn — which knocked Maryland out of the NCAA Tournament in double overtime — at home on March 19.\nMaryland’s last home game comes April 9 against last season’s national runners-up Northwestern, with its final game of the regular season nine days later against Ohio State in Columbus.\nIn other news\nMaryland women’s basketball dropped its first game of the season, a 73-70 defeat on the road against Illinois. Max Schaeffer covered the game and Ben Messinger gave his takeaways.\nWith the final weekend of the NFL regular season ahead, Justin Glenn recapped what Maryland alums did over the last 7 days.\nMaryland linebacker Daniel Wingate is returning to College Park for his senior season.\nMaryland football’s running back Nolan Ray, defensive back Kevyn Humes, tight end Leon Haughton and running back/wide receiver Josiah McLaurin have entered the transfer portal.\nMaryland football commit Zion Elee is set to play in the Under Armour All American game and could potentially see time on both sides of the ball.",
  "word_count": 325,
  "scraped_at": "2026-02-14T13:24:17.312511"
}