{
  "article_id": "e4924f22216a",
  "url": "https://www.rnz.co.nz/international/pacific-news/513740/pasifika-sipoti-wrap-and-results-from-the-weekend",
  "title": "Pasifika Sipoti - wrap and results from the weekend",
  "date": "20240408T054500Z",
  "domain": "rnz.co.nz",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Pacific taekwondo athletes secure Olympic spots\nTwo Pacific taekwondo athletes have qualified for the Paris Olympics following the Taekwondo Olympic Qualifier tournament in Honiara, Solomon Islands on 6 April.\nFiji and Papua New Guinea joined Australia and New Zealand by securing places for the end of July event.\nFiji's Venice Traill won her final match against Solomon Islands' athlete, Lyneth Maniasi to win gold and book her spot from the women's 67 kilograms.\nPapua New Guinea's Gibson Kaogo Mara defeated Fiji's Nipesh Prakash in the men's 80kg plus competition to win his ticket to Paris.\nAustralian athletes Saffron Tambyrajah in the women's 49kg, women's 57kg winner Stacey Hymer in the, Bailey Lewis competing in the men's 58kg and Leon Sejranovic, who claimed gold in the men's 80kg, have secured their spots from Oceania.\nNew Zealand will be represented by Eisa Mozdehjouybari and Jemesa Landers.\nAthletes competed in the eight Olympic weight categories (four men and four women) during the Olympic Qualifier, with the gold medal-winning athlete in each category winning a qualification place for their respective NOC.\nWorld Taekwondo said the achievements underscores the effectiveness of the intensive training and skill enhancement provided during training camps, made possible through the support of World Taekwondo and the IOC Olympic Solidarity Programme.\nVanutau duo claim volleyball title\nThe Vanuatu national women's beach volleyball team lifted the Queensland Beach Volleyball Tour trophy in Brisbane on Saturday.\nLinline Matauatu and Majabelle Lawac won the final 2-0 against a local Queensland team.\nVanuatu Beach Volleyball said the their team was the top seed at the event.\nVanuatu Volleyball Federation media officer Jill Scanlon said the team progressed through their opening matches with straight sets wins and continued that form into the semi-final.\nThe team won all their matches by two straight sets.\nScanlon said competing at the event is another step for Team Vanuatu's preparation for their final Olympic Games qualifier.\nThe Team Vanuatu squad of Lin Matauatu, Bella Lawac, Sherysyn Toko and Loti Joe, will head to Thailand this week to compete in the AVC Samila Open (13-16 April) in Songkla.\nThey will then travel to China in May for 2 FIVB Futures events, (9-12 May, Pingtan; 16-19 May, Wuhan), ahead of the two final Olympic qualifying phases in June.\nScanlon said VVF appreciates the opportunities the national players get to compete in Australia across the summer beach volleyball tour season and thanks all their sponsors and support from fans.\nNew Zealand retain Hong Kong titles as Fiji continue losing run\nNew Zealand have retained the Hong Kong Sevens rugby titles in the men's and women's competitions following final wins on Sunday night.\nThe All Blacks sevens pipped France 10-7 in the final to keep the title while the Black Ferns thrashed United States of America 36-7 in their final.\nAnd the Fiji men's team continues the run without any tournament title win, after New Zealand send them crashing out of the quarterfinals on Saturday night.\nNew Zealand won 19-12 in the quarterfinals, coming from behind to draw level at 12-all.\nTone Ng Shiu then crossed for a last minute try as New Zealand ran away for a well-deserved win.\nFiji had led 12-7 at the break thanks to tries from Ponepati Loganimasi and Joji Nasova, but the second half saw the All Black Sevens slowly break down the door of the Fijian defence.\nFiji finished fifth overall after they defeated South Africa 33-14 in fifth place playoff.\nThey collected 12 points, keeping them at third spot on the World Rugby Sevens series points table.\nCoach Osea Kolinisau told FBC Sports they wanted to win the last Hong Kong title in So Kon Po but they will take their learnings and focus on the next tournament in Singapore.\nHe said the game against New Zealand was theirs for the taking.\n\"12-12, kick-off we got the ball back and we just threw the ball away again,\" he told FBC Sports after the loss.\n\"You know New Zealand built from that. If we just got the ball back and build momentum we had them on the backfoot, that's something we need to learn as a team and to build, make sure we are there mentally.\"\nIn the women's competition the Fijiana Drua claimed fifth spot too, defeating Canada 19-15 in their play-off.\nThat sees the team move up the points table to fifth spot with 54 points overall to their name.\nCaptain Raijieli Daveua said they were happy with the improvement they made.\n\"I'm happy with the performance today, I told the girls we need points so that we can go up in Madrid,\" she told FBC Sports.\n\"I know it's not an easy job for us but we worked hard for it.\"\nOther big results in Hong Kong saw New Zealand defeating Australia on both the men and the women's semifinals.\nArgentina, the men's series leader, didn't make it into the quarterfinals but they claimed four points to stay on top.\nNew Zealand have moved to fifth position while Great Britain, Spain, Samoa and Canada are lying in the red zone on the points table, taking up the ninth to 12th spots currently.\nThey face the risk of playing in the promotion and relegation series in Madrid, Spain.\nIn the women's competition, New Zealand have tied Australia with 106 points at the top while Brazil, Japan, South Africa and Spain are on the bottom four.\nFijiana wins against Brumbies\nThe Fijian Drua women's team continue their push for a semifinal spot in the Super W competition with a strong 20-7 win over the Brumbies in Canberra on Saturday evening.\nThey will face the Rebels in Melbourne this weekend and if they win that would see them playing a home semifinal.\nSaturday's win saw them sit them at second spot on the points table behind the Waratahs.\nHead coach Mosese Rauluni told the media after the win he was happy overall with the result, especially in the players for being patient and making better decisions.\n\"They were really patient, they held their nerve and they didn't get offside or give away silly penalties to put them back in the game which could have cost us,\" he said.\n\"I think we just kept pressuring them.\"\nSuper W results: Drua 20 Brumbies 7, Reds 17 Rebels 15, Waratahs 45 Western Force 21.\nDisappointing results for Drua and Moana Pasifika\nThe Fijian Drua and Moana Pasifika recorded disappointing results at the weekend, losing their seventh round matches in the Super Rugby Pacific competition.\nThe Rebels defeated the Drua 41-20, scoring six tries and claiming a bonus win on the way.\nDrua fell apart in the second half in Melbourne on Friday night, after having led 20-15 at halftime.\nHalfback Frank Lomani (for elbowing a player on the back of his neck) and replacement prop Jone Koroiduadua (for head butting a player) were yellow-carded, reducing the Drua to 13 men in the second half.\nHead coach Mick Byrne told the media he was disappointed and there were no excuses for the two player's behavior.\nHe said ill-discipline has been a major worry for the team.\n\"I apologise to our people back at home for the two red cards and you know we talk about this week in and week out,\" he said.\n\"We need to do something about it, the players will have to find in within themselves to sort their discipline out if we want get our season back on track.\"\nThe two players are expected to miss at least five Super Rugby matches.\nMeanwhile, Moana Pasifika was on the receiving end of a big thrashing, this time going down 68-12 to the Chiefs in Hamilton on Saturday evening.\nFijian winger Emori Narawa claimed a hat-trick with returning flyhalf Damien McKenzie landed nine out of his 10 conversion attempts for the Chiefs.\nIt was a big turnaround by the Chiefs, who had suffered a loss to the Crusaders a week earlier.\nThe loss was the highest Moana Pasifika has suffered since the 59-0 thrashing they had received at the hands of the Hurricanes last year.\nHead coach Fa'alogo Tana Umaga said they were beaten by a champion side.\nHe added they will continue to look at improving their performance.\n\"It's a tough clash against the Chiefs always,\" he said.\n\"We will go back and re-focus, working on areas that we identified.\"\nThey host the Reds in Whangarei on Friday night.\nMeanwhile, the Blues romped home to another big win at the weekend, defeating the Force 50-5 at Eden Park.\nThat win also saw them jump to the top of the points table, ahead of the Hurricanes with a better points average.\nThe top eight teams going into the eighth round now are the Blues, Hurricanes, Chiefs, Brumbies, Rebels, Reds, Fijian Drua and the Highlanders.\nSuper Rugby: Blues 50 Force 5, Rebels 41 Fijian Drua 20, Chiefs 68 Moana Pasifika 12, Brumbies 40 Waratahs 16.\nNRL four share top spot\nThe National Rugby League competition see four teams sitting at the top after the fifth round of competition.\nDolphins sit at the top with a better points difference, ahead of the Cowboys, Storm and the Sharks.\nDolphins defeated West Tigers 26-16 at the weekend to maintain their lead at the top.\nNew Zealand's lone team the Warriors sit on sixth spot at the moment, with three wins and two loss so far.\nThey managed to beat the Rabbitohs 34-4 at the weekend.\nNRL results: Storm 34 Broncos 32, Bulldogs 30 Roosters 26, Knights 30 Dragons 10, Warriors 34 Rabbitohs 4, Sea Eagles 32 Panthers 18, Dolphins 26 West Tigers 16, Cowboys 35 Titans 22, Raiders 41 Eeles 8\nRewa leads in Fiji soccer\nRewa scored a last-minute goal through Tevita Waranivalu to defeat Navua 1-0 in a Fiji Football Association Premier League competition at the weekend.\nThe win also saw them keep their top of the table lead, with 13 points from four wins and a draw.\nNadi, who lost 5-1 to Lautoka, keep their second spot with 10 points.\nSuva FC registered its first win defeating Nasinu 2-1 at the Fiji FA Academy Ground in Suva.\nResults: Nadroga 1 Ba 0, Rewa 1 Navua 0, Labasa 2 Tailevu Naitasiri 1, Lautoka 5 Nadi 1, Suva 2 Nasinu 1.\n-Send your weekend sports results to iliesa.tora@rnz.co.nz be included in Pasifika Sipoti's weekly update published every Monday.",
  "word_count": 1726,
  "scraped_at": "2026-02-14T12:42:00.982662"
}