{
  "article_id": "e4b93333e274",
  "url": "https://www.nbcchicago.com/news/business/money-report/nba-and-nhl-broadcasts-are-coming-soon-to-immersive-shared-reality-domes/3264973/",
  "title": "NBA and NHL broadcasts are coming soon to immersive  shared reality  domes – NBC Chicago",
  "date": "20231031T161500Z",
  "domain": "nbcchicago.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "- An immersive-technology company called Cosm will open its first two venues in 2024, allowing sports fans to watch live games in domes filled with 8K screens.\n- Warner Bros. Discovery's TNT Sports has partnered with Cosm to allow select broadcasts of its games to be used for the Cosm domes.\n- Cosm's CEO hopes the buzz around Las Vegas' Sphere will help push people to try Cosm's technology.\nStream NBC 5 for free, 24/7, wherever you are.\nWarner Bros. Discovery and Cosm, a privately held company that specializes in immersive technology, are about to make \"shared reality\" a reality for sports fans.\nCosm plans to open two venues — a 65,000 square foot building in Los Angeles and a 70,000 square foot structure in Dallas — with seating areas for about 800 fans who will be able to watch select live sports that air on TNT in an immersive experience that mirrors being at the game.\nThe Cosm venues will feature domes with 360 degree, 87 foot diameter 8K LED screens that are similar in concept to James Dolan's Las Vegas Sphere, which debuted in September. But unlike the Sphere, which specializes in live entertainment, the Cosm venues will focus on repurposing broadcasts to give consumers immersed experiences such as a courtside view at NBA games or a rink-side angle for hockey games.\nNo headsets or glasses are needed to watch the games. Cosm uses multicamera productions to simulate the experience of sitting courtside at a basketball game or pitch side at a soccer match. The experience won't be 3D, but the effect of the dome viewing will make viewers feel as if they're in the arena.\n\"We buy into that same kind of notion of leveraging amazing technology to give the human experience something they've never seen before,\" Jeb Terry, CEO at Cosm, said in an exclusive CNBC interview. \"With the Sphere, it's big, huge, grand scale. Ours is more of a smaller format and really focused on live sports and live programing — like you're absolutely there.\"\nCosm venues will feature select games on TNT in the venues, including some National Basketball Association regular season and playoff games, the National Hockey League's Stanley Cup Playoffs and select U.S. Men's and Women's National Soccer Team matches.\nThe Cosm Los Angeles venue will open in the spring of 2024. The Dallas venue will open later next year. Each building will accommodate about 2,000 people. There will be standing areas similar to modern sports bars, with game broadcasts of all different sports, attached to the dome portion of the building. They will include lounges and other places to sit. Fans who buy a seat, which will be spread out rather than theater style, will have access to concessions and will be able to hear the TNT broadcast.\nCosm's history\nCosm was founded in 2020 by private equity firm Mirasol Capital, which specializes in real estate, technology and entertainment, through a series of acquisitions of spatial computing, engineering and immersive video production companies. Mirasol's founder is Steve Winn, a Dallas-based billionaire who sold his software company RealPage to Thoma Bravo in 2021 for $10.2 billion, including debt.\nTerry, Cosm's CEO, is a former National Football League offensive lineman for the Tampa Bay Buccaneers and Fox Sports executive. He's also a managing director at Mirasol. Cosm has more than 250 employees and is headquartered in Los Angeles.\nCosm's technology, through an acquisition of Evans & Sutherland, powers more than 700 planetariums around the world. The partnership with Warner Bros. Discovery is a revenue-sharing agreement and could eventually extend to other nonscripted entertainment content, such as concerts. There's even the potential for using the technology to enhance scripted shows, said Raphael Poplock, Bleacher Report senior vice president of business development and strategic partnerships.\n\"It has extension potential well beyond sports,\" said Poplock, who helped forge the partnership for Warner Bros. Discovery. \"When I was in there, I was like, I got this for the NBA, the NHL, for soccer, for all of our sports portfolio. But that was also when 'The Last of Us' was killing it on HBO and Max. And I was thinking, geez, if you did a premiere for season two and really had an immersive, post-apocalyptic world, that could look pretty badass.\"\nTerry's first priority is to use the TNT Sports deal as a template to get more live sports rights into the venues for fans. He also plans to build more domes in cities around the U.S.\n\"This Turner Sports deal is the first of its kind, but it's not going to be the last,\" Terry said.\nWATCH: Sphere Entertainment shares surge as U2 performs.\nDon't miss these CNBC PRO stories:\n- Want to retire in 5 years? Here's how to invest for it, according to the pros\n- Morgan Stanley says the average stock is breaking down, S&P 500 to fall to 3,900 by year-end\n- This highly profitable industry is booming as the population ages\n- This chip stock is getting a ton of love from Wall Street, and it's not Nvidia",
  "word_count": 846,
  "scraped_at": "2026-02-14T12:06:54.206612"
}