{
  "article_id": "e4be94d7d388",
  "url": "https://www.thenationalnews.com/news/uae/2025/09/14/emirati-girl-9-fulfils-matcha-stand-dream-after-life-saving-transplant/",
  "title": "Emirati girl , nine , fulfils matcha stand dream after life - saving transplant",
  "date": "20250915T070000Z",
  "domain": "thenationalnews.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Nine-year-old Mahra Al Blooshi's dream came true as she welcomed visitors to her matcha tea stand at Abu Dhabi Stem Cell Centre’s Yas Clinic this week.\nHoping to open her own business was something that kept her going during long weeks of hospital isolation after her bone marrow transplant.\nOn Thursday, Mahra finally stood behind her counter – hair just beginning to grow back after chemotherapy – celebrating life and sharing the drink she craved most during treatment with her family.\n“Why matcha? Because it was the one thing she wanted after her transplant,” her mother, Budour Al Blooshi, told The National.\nYears of unexplained illness\nMahra’s journey began years earlier with persistent fevers and infections.\nITK deficiency, a rare autosomal recessive primary immunodeficiency that causes repeated infections and frequent need for hospital treatment, was diagnosed when she was five.\n“This is our first case of bone-marrow transplanting ITK deficiency in the UAE,” said Mansi Sachdev, consultant paediatric hematology oncologist at Abu Dhabi Stem Cell Centre’s Yas Clinic.\n“There are many immunodeficiencies in the world, and we have done a lot of bone marrow transplants for different kinds, but for this particular ITK deficiency, it’s extremely rare.”\nGenetic screening\nGenetic testing traced the mutation to both parents, who are first cousins.\n“Back in the time when I was married, there was no specific marital test,” Ms Al Blooshi said. “But nowadays they have new rules of doing the marital test with genetic screening to avoid this kind of disease.”\nPremarital genetic screening is now mandatory across the UAE, a safeguard to help couples understand inherited health risks before starting a family.\nFurther testing for Mahra confirmed the need for a bone-marrow transplant. It also revealed that her older brother Abdulla, 14, carries the mutation, while her 12-year-old sister Mariam is a perfect donor match for both.\n“The brother also has the same genetic problem,” Dr Sachdev said. “So, the sister will donate for her brother, too. She donated for Mahra already, and now, once Mahra has recovered, the plan is to treat the brother and use Mariam again as a donor.”\nSuccessful transplant\nMahra’s transplant took place eight months ago. “It was done successfully,” Dr Sachdev said. “She was out of the hospital within six weeks from the time she came for the transplant, and she recovered from it.”\nA blood test confirmed that all her cells are now from the donor, which means the transplant has been successful. Today, Mahra is thriving and back at school.\nA mother’s faith and gratitude\nMs Al Blooshi described the experience as one of intense learning and unshakable faith.\n“For me as a mother, it is very important to address that this phase is really taking a lot of patience,” she said. “You have to be aware of what you are going through, and you also have to communicate with your family, with your kids and themselves – the patient – and you have to seek all the information that you need from your doctors.”\nMahra remembers the long stay. “I felt that I was tired and didn’t want to do anything,” she said. “But today I feel healthy and more active.” Her first day back at school was a celebration. “My friends were excited,” she said.\nMariam, the donor, spoke of her role.\n“I donated my bone marrow to Mahra,” she said. “I feel so proud to be a donor. I call January 16 a miracle day because when you see how God is giving you miracles, that was a miracle day for me.”\nExpanding treatment in Abu Dhabi\nDr Sachdev said Mahra’s case marks a milestone for the centre and the country.\nYas Clinic has carried out about 200 bone marrow transplants in total, around 50 of them for children.\n“We do transplants for thalassemia, sickle cell anaemia, immunodeficiencies, leukaemia, lymphomas. We have also done a few CAR-T cell treatments for patients who have leukaemia and lymphomas. There’s a lot on the horizon and I think this is just going to grow,” she said.",
  "word_count": 673,
  "scraped_at": "2026-02-14T12:12:10.133542"
}