{
  "article_id": "e4d1dbda4257",
  "url": "https://thenationonlineng.net/super-falcons-banyana-banyana-lock-horns-for-paris-2024-ticket/",
  "title": "Super Falcons , Banyana Banyana lock horns for Paris 2024 ticket",
  "date": "20240405T103000Z",
  "domain": "thenationonlineng.net",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Sports\nApril 5, 2024 by Tunde Liadi\nSuper Falcons, Banyana Banyana lock horns for Paris 2024 ticket\nIt will be a titanic battle when perennial African champions , Super Falcons of Nigeria and current WAFCON holders, Banyana Banyana of South Africa clash today at the MKO Abiola National Stadium, Abuja in the first leg of their decisive fourth round qualifiers towards a place at the Paris 2024, writes TUNDE LIADI\nSuper Falcons will hope to produce a magnificent performance before their fans at the MKO Abiola National Stadium, Abuja today in the first leg of the fourth round of the Paris 2024 Olympic Games Qualifiers against reigning African Champions, Banyana Banyana of South Africa.\nDespite dominating the Women’s African Cup of Nations Tournament with nine titles, Super Falcons will only be aiming at making a return to the Olympic Games for the first time since Beijing 2008 in China if they cross the hurdle of the Desiree Ellis’ inspired South African side over the two legs.\nWhile the Super Falcons are slight favourites, Banyana Banyana have proven in recent years that they are much closer to the West Africans than many actually realize. Nigeria have dominated women’s football for many decades now, but South Africa have caught up so fast, establishing themselves as a dominant force on the continent at both club and international levels.\nAlthough the Super Falcons remain the most successful African side, Banyana Banyana are the reigning champions of the Women’s Africa Cup of Nations (WAFCON) and impressively reached the round of 16 of the FIFA Women’s World Cup in Australia and New Zealand last year just like the Super Falcons and the Atlas Lionesses of Morocco.\nBased on current form too, Desiree Ellis’ side have momentum on their side, having won three of the last four games between both nations. So, while Nigeria have history on their side, South Africa are currently the team to beat and will be going into today’s game brimming with confidence after comfortably dispatching Tanzania in the previous round 4-0 on aggregate.\nRead Also: FULL LIST: Jail term, fine, other consequences for mutilation, abuse of naira notes\nDespite having two tough fixtures to negotiate with against the Banyana Banyana, the Super Falcons should be motivated to make a return to the Olympic Games having last done so almost 16 years ago in China.\nIncidentally, the Super Falcons have failed attempts in their last three attempts at qualifying for the quadrennial multi sports competition as such this upcoming fixture against the Banyana Banyana is all the more important.\nYears back , Nigeria failed to book their place at the women’s football event of the London 2012 Olympics after they were eliminated by rivals, Cameroon.\nThe Super Falcons had seized the momentum from the first leg after beating Cameroon 2-1 at home, but the Lionesses had a similar result in Yaounde to take the game to be penalties which they won 4-3.\nSimilarly, in 2015, Nigeria went into the qualification for the Rio 2016 Olympic football tournament as champions of Africa.\nHowever, they were shocked by Equatorial Guinea in the third round of qualifiers. Having been held to a 1-1 draw at home, the Super Falcons suffered a 2-1 defeat in the reverse fixture in Bata to crash out via a 3-2 aggregate loss after a late minute collapse.\nThe defeat saw Equatorial Guinea advance to the final round of qualifiers, where they were pipped to the Olympics ticket by South Africa 1-0 on aggregate.\nOctober 2019 also marked a dark period for women’s football in Nigeria when the Super Falcons failed to once again qualify for the Olympic Games for the third straight edition – via away goal rule.\nThis was after they were held to a 1-1 draw by Cote d’Ivoire in front of their home fans at the Agege stadium in Lagos. The nine-time African champions were huge favourites to advance having held the Ivorians to a goalless draw in Abidjan in the first leg.\nNew Sheriffs in Town\nThough, the Super Falcons dominated women’s football for most of the last four decades, winning nine of 11 African Championships and appearing at every edition of the World Cup, however, the baton appears to be changing hands, as South Africa have overtaken Ghana and Cameroon to become Nigeria’s biggest rivals.\nThe South Africans lost the 2018 WAFCON on penalties to Nigeria but returned stronger to claim the title for the first time in 2022 against the hosts, Morocco.\nThe Banyana Banyana impressively got to the knockout round of the World Cup last year and aim to qualify for the Olympics for the third time in the last four editions.\nThey have become a tougher nut to crack under head coach Desiree Ellis, with the 61-year-old tactician setting the team up to get the best out of star forward, Thembi Kgatlana.\nThe 27-year-old Racing Louisville FC striker has 13 goals in 34 games for South Africa and is a key reason why the Banyana have lost none of their last eight games.\nThat excellent run includes six victories and two draws, which will be why they will be full of confidence by the time the referee blasts the kickoff whistle today.\nAlthough in Nigeria, South Africa will meet a team that can match them power for power, talent for talent, and desire for desire.\nSaved for a penalty shootout loss to England at the World Cup, the Super Falcons have remained unbeaten in their last 12 matches in all competitions.\nDuring that brilliant run, Nigeria kept clean sheets against Canada, Republic of Ireland, England, and Cameroon (twice) and will fancy their chances of shutting out the South Africans on today.\nHead-to-head\nNigeria hold the advantage in previous fixtures against South Africa, with the Super Falcons winning six, drawing two, and losing four of the 12 encounters between the two.\nHowever, recent momentum is in favour of the Banyana Banyana. The South Africans have won each of the last three matches that have been decided in regulation time against Nigeria.\nThey claimed a 2-1 win in the group stages of the 2022 WAFCON after recording a 4-2 victory in Lagos in the 2021 Aisha Buhari Cup – the Super Falcons’ biggest-ever defeat to the Banyana.\nSuper Falcons Head Coach, Randy Waldrum who knows the enormity of the task at hand Insists that South Africa won’t stop Nigeria’s aspiration to qualify for the Paris 2024 Olympic Games.\nWaldrum described his team as a blend of young and experienced players that could be one of the best teams in the world and he tasked his players to play their best game in the two games to beat Banyana Banyana to the Olympic ticket.\nIn an interview with NFF TV, Waldrum stressed that Banyana Banyana cannot stop the Super Falcons from qualifying for the 2024 Olympics.\n“This team is a generational team, no disrespect to the other teams, the talent and the depth that is coming into the team, which we saw in Australia (FIFA Women’s World Cup) against some of the best teams around the world,” the Super Falcons coach said. “We can continue to move on and be a major player on the world stage.\n“This team is special and we can be one of the best teams in the world.”\nSpeaking in the same vein, Super Falcons Captain Rasheedat Ajibade revealed that she and her teammates have been motivated to go into today’s game with the mindset to get the goals needed to make the return leg in Pretoria easier for them.\nAjibade, who expressed confidence that Nigeria will beat South Africa at the Moshood Abiola Stadium, Abuja, reportedly told The News Agency of Nigeria : “Yes, we have dominated women’s football in the continent for a while now but we are not dwelling on past glory but what we can do now.\n“Picking the Olympic tickets is what really matters to us now. The mindset in camp is positive, although there is a little bit of stress, we are coping and are going to manage everything well professionally.\n“One word I will say to my team is, ‘let’s do it,’ let’s go all out to secure victory for the country. I am optimistic of a win on Friday.”\nPittsburgh Panthers midfielder Deborah Abiodun has stated that the Super Falcons won’t take Banyana Banyana for granted knowing the danger they can pose in the Olympic Games Qualifiers.\nAbiodun was arguably the standout player in Nigeria’s hard-fought 1-0 aggregate win over Cameroon in the third round of the Olympic qualifiers and the midfielder opined that they are in the country to relieve Nigerians the shame of missing out on three consecutive editions of the four year competition and their eagerness to correct that today with a good first leg result.\nAbiodun said: “We’ll not take our opponents for granted. We’d follow our coach’s instructions and follow how he wants us to play.\n“I’m sure by God’s grace and with the support of every Nigerian out there we would overcome South Africa.\n“Of course they are a strong side, every team is strong. Football is developing in every country so we’re not underrating anybody. We hope to qualify against South Africa.”\nDo-or-die affairs\nMeanwhile, the Banyana Banyana too are not keeping quiet ahead of the all-important Olympic Games final round qualifier with Banyana Banyana defender Lebohang Ramalepe tagging the game as a do or die affair for them.\nThe utility defender made the statement while speaking with IOL on the upcoming clash.\n“To be honest, this is going to be a tough game. Remember, both teams failed to qualify for the last Olympics. So, it’s a do-or-die.\n“But we are ready because we know how important the game is. It’s just a matter of going there and doing our best on the day,” she said.\nAlso, Banyana Banyana of South Africa midfielder Nomvula Kgoale insisted that the side will cope with the harsh weather conditions in Abuja ahead of their 2024 Olympic Games qualifier.\nKgoale claimed her side his ready for the task ahead despite the tough challenges.\n“It’s extremely important to be mentally tough. We know that Nigeria are a very tough opponent to play against…they’ve won WAFCON so many times and they’ve done well at the World Cups as well,” Kgoale told the Sowetan.\n“Back at home the air is much thinner and over here it’s much heavier but personally I’ve played in the United States for almost six years, and I know how to play in this kind of weather… you almost feel like you are breathing heat. The grass is also heavier but I am sure that in two days’ time we would’ve adjusted.”\nSpeaking to SABC Sport Banyana head coach, Desiree Ellis, highlighted the strategic importance of the high altitude at Loftus Stadium whilst pointing to a recent turning point for the Banyana Banyana at the Aisha Buhari Cup in 2023.\nThe 61-year-old also acknowledged the significance of the upcoming matches against the Super Falcons whilst emphasizing the ‘winner takes all’ nature of the doubleheader.\n“We looked at the altitude, we have to make sure that we take advantage of that and hopefully it can help us especially within the first 15 to 20 minutes into the game,” Desiree Ellis said.\n” I think our biggest turning point was the Aisha Buhari Cup and some of our key players were not available for that fixture, but with the type of football we played – belief set in, and this shows that this team is not afraid of anyone.\n“So, all of us know what a big game it is, having missed the 2020 Olympics same with Nigeria, but now who wants it the most?”\nBoth teams are hungry to qualify for the Olympics, with the reigning African champions, South Africa, missing out on the last edition in Tokyo.\nMeanwhile, the Super Falcons have endured a 16-year absence from the Games with their last appearance coming at the Beijing Olympics in 2008.\nThe winner of the clash will be in the same group as world champions, Spain, Brazil and Japan in Paris.",
  "word_count": 2021,
  "scraped_at": "2026-02-14T13:04:58.246797"
}