{
  "article_id": "e4e8aa58442f",
  "url": "https://www.marketscreener.com/quote/stock/BRERA-HOLDINGS-PLC-149905978/news/Brera-Holdings-Club-UYBA-Women-s-Pro-Volleyball-Update-Celebrating-Excellence-Global-Growth-48850834/",
  "title": "Brera Holding Club UYBA Women Pro Volleyball Update : Celebrating Excellence , Global Growth , and a New Era of Innovation in 2025 for a Sport Enjoying Unprecedented Private Equity Backing - January 23 , 2025 at 08 : 17 am EST",
  "date": "20250123T143000Z",
  "domain": "marketscreener.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "https://ml.globenewswire.com/Resource/Download/3970edaf-4ddd-451e-bc6f-58b7855d7087/brera-holdings-club-uyba-women-s-pro-v.jpg\" title=\"Brera Holdings’ Club UYBA Women’s Pro V.jpg\" width=\"624\"/>\nBUSTO ARSIZIO, ITALY - Serie A1 women 2024/25 match between UYBA Eurotek Volley Busto Arsizio (red) and Bartoccini-Mc Restauri Perugia (black) at E-Work Arena\nDublin, Ireland, and Milan, Italy, Jan. 23, 2025 (GLOBE NEWSWIRE) -- Brera Holdings PLC (\"Brera Holdings\") (Nasdaq: BREA), an Ireland-based, Nasdaq-listed, international holding company focused on expanding its global portfolio of men's and women's sports clubs through a multi-club ownership (\"MCO\") approach, is pleased to provide an update on the accomplishments from the ongoing 2024/2025 season of Unione Yamamay Busto Arsizio (UYBA), one of Italy’s premier women’s professional volleyball teams. Following a year of strategic growth and renewed energy, UYBA continues to set the benchmark for excellence in Italian volleyball.\nA Legacy of Excellence\nFounded in 1971, UYBA has a storied history in Italian and European volleyball, boasting an impressive six major trophies: 1 Scudetto, 1 Italian Super Cup, 1 Italian Cup, and 3 CEV Cups. This remarkable record underscores UYBA’s longstanding tradition of excellence on the court.\nIn July 2023, UYBA entered a transformative phase with Brera Holdings PLC acquiring a 51% majority stake in the team. This strategic partnership aligns with Brera Holdings' commitment to fostering social impact through sports, and unlocking new opportunities for UYBA on and off the court.\n“This acquisition has been a game-changer for our organization,” said Giuseppe Pirola, President and CEO of UYBA. “With Brera Holdings’ backing, we have not only strengthened our operations but also bolstered our ability to compete at the highest levels of the game.”\nBy August 2024 UYBA alumni performed at the highest level in the Paris Olympics gold medal final match of Italy against the USA. The Olympic champion Italians were led by former UYBA coach\nJulio Velasco and assistant coach Juan Cicchello, and the final featured five players from UYBA rosters over the years; 2 representing the USA, and 3 from Italy.\nUYBA has started the 2024/2025 season on a high note, achieving key victories that underscore the team’s potential to contend for the Serie A1 championship. The team currently features a roster of 14 players, supported by 8 technical staff members and 1 team manager, forming a cohesive and dynamic group of 23 professionals.\nEmpowering International Talent\nOver the years, UYBA has earned a reputation as a hub for nurturing world-class talent. This legacy is exemplified by former players like Jordyn Poulter, who advanced her career with Team USA after contributing significantly to UYBA’s success. With its commitment to player development, UYBA continues to empower athletes to excel on the global stage, a testament to the team’s dedication to excellence.\nPrivate Equity Investment Fuels Volleyball’s Global Growth\nVolleyball’s profile is rising globally, bolstered by increased private equity investment. In the United States, League One Volleyball (LOVB) launched its inaugural season on January 8, 2025. The first match featured Salt Lake defeating Atlanta 3-1, marking a strong start for the league with 3,000+ spectators in attendance. LOVB is also backed by prominent sports-dedicated investment funds, including David Blitzer’s Bolt Ventures and Verance Capital. The growth of U.S. volleyball is further demonstrated by events such as the NCAA showcase hosted by UYBA. In May 2024, UYBA hosted a friendly match featuring the University of Texas Longhorns women's volleyball team and two other elite NCAA women's volleyball teams: Tennessee and Minnesota– and UYBA had brought international audiences to watch. These developments highlight the growing appeal of volleyball as a commercially viable and globally engaging sport. UYBA and Brera Holdings are proud to be part of this dynamic evolution, contributing to the sport’s growth at both professional and grassroots levels.\nA Vision for the Future\nLooking ahead, UYBA aims to build on its storied history by further integrating innovation, strategic investments, and a focus on community impact. The team remains steadfast in its mission to inspire fans, foster talent, and maintain its position as a leader in women’s volleyball.\n“Our goal is not just to win matches but to create a legacy,” said Giuseppe Pirola, President and CEO of UYBA. “We’re excited to engage our supporters, expand our reach, and make meaningful contributions to the sport.”\nAbout UYBA Volley\nUnione Yamamay Busto Arsizio (UYBA) is a professional women’s volleyball team based just north of Milan in Busto Arsizio, Italy. Competing in Serie A1, UYBA has earned numerous accolades, including multiple CEV Cup titles and an Italian National Championship. With a strong focus on performance and community impact, UYBA continues to be a beacon of excellence in Italian volleyball.\nABOUT BRERA HOLDINGS PLC\nBrera Holdings PLC (Nasdaq: BREA) is dedicated to expanding its social impact football business by developing a global portfolio of emerging football and sports clubs. Building on the legacy of Brera FC, which it acquired in 2022, the Company aims to create opportunities for tournament prizes, sponsorships, and professional consulting services. Brera FC, recognized as \"The Third Team of Milan,\" has been crafting an alternative football legacy since its founding in 2000. The club also organizes the FENIX Trophy, a nonprofessional pan-European tournament acknowledged by UEFA. This tournament, which has been referred to as \"the Champions League for Amateurs\" by BBC Sport, has garnered significant media coverage, including from ESPN.\nIn its efforts to broaden its reach, Brera expanded into Africa in March 2023 by establishing Brera Tchumene FC in Mozambique, which quickly rose to the First Division after winning its post-season tournament. In April 2023, the Company acquired a 90% stake in the North Macedonian first-division team Fudbalski Klub Akademija Pandev, now known as Brera Strumica FC. Additionally, in June 2023, Brera made a strategic investment in Manchester United PLC, realizing a 74% gain. The Company has further diversified its portfolio by acquiring a majority stake in UYBA Volley, an Italian women's professional volleyball team, in July 2023, assuming control of Bayanzurkh Sporting Ilch FC, a Mongolian National Premier League team, which became Brera Ilch FC, in September 2023, and establishing a joint stock company for the North Macedonian women's football club Tiverija Strumica, now known as Brera Tiverija FC, a wholly-owned subsidiary of Brera Strumica FC, in June 2024.\nOn December 31, 2024 Brera signed of an agreement to acquire majority ownership of SS Juve Stabia srl, an Italian Serie B football club known as “The Second Team of Naples,” which will be conducted in a three-step process, and marks a significant expansion of the Company’s MCO model. As of January 10, 2025 Brera holds a 35% equity ownership interest in Juve Stabia, currently in a playoff-qualifying sixth place position in the Serie B standings. With a strategic emphasis on bottom-up value creation, innovation-driven growth, and socially impactful outcomes, Brera Holdings has established itself as a forward-thinking leader in the global sports industry. For more information, visit www.breraholdings.com.\nCautionary Note Regarding Forward-Looking Statements\nThis press release contains forward-looking statements that are subject to various risks and uncertainties. Such statements include statements regarding the Company's ability to grow its business and other statements that are not historical facts, including statements which may be accompanied by the words \"intends,\" \"may,\" \"will,\" \"plans,\" \"expects,\" \"anticipates,\" \"projects,\" \"predicts,\" \"estimates,\" \"aims,\" \"believes,\" \"hopes,\" \"potential\" or similar words. Actual results could differ materially from those described in these forward-looking statements due to a number of factors, including without limitation, the Company's ability to continue as a going concern, the popularity and/or competitive success of the Company's acquired football and other sports teams, the Company's ability to attract players and staff for acquired clubs, unsuccessful acquisitions or other strategic transactions, the possibility of a decline in the popularity of football or other sports, the Company's ability to expand its fanbase, sponsors and commercial partners, general economic conditions, and other risk factors detailed in the Company's filings with the SEC. The forward-looking statements contained in this press release are made as of the date of this press release, and the Company does not undertake any responsibility to update such forward-looking statements except in accordance with applicable law.\nCompany Contact Information:\nDan McClory, Executive Chairman, Brera Holdings PLC\nEmail: dan@breraholdings.com\nInvestor Relations Inquiries:\nSkyline Corporate Communications Group, LLC\nScott Powell, President\n1177 Avenue of the Americas, 5th Floor\nNew York, New York 10036\nOffice: (646) 893-5835\nEmail: info@skylineccg.com\nhttps://www.globenewswire.com/newsroom/ti?nf=OTMzNjU0MiM2NzA3MjMxIzUwMDExMzE2MQ==\"/>\nhttps://ml.globenewswire.com/media/NTA3MjQ2ZTYtMjZjMi00NGRiLWIwMDYtNDFhNDhlNWE1ZGI3LTUwMDExMzE2MQ==/tiny/Brera-Holdings-PLC.png\" referrerpolicy=\"no-referrer-when-downgrade\"/>",
  "word_count": 1369,
  "scraped_at": "2026-02-14T12:43:16.570956"
}