{
  "article_id": "e4e9c31e3733",
  "url": "https://allafrica.com/stories/202601080385.html",
  "title": "South Africa : Trump Watch - Ramaphosa Calls On Trump to Release Venezuela Maduro",
  "date": "20260108T214500Z",
  "domain": "allafrica.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Donald Trump matters a lot to Mzansi and the rest of the world right now. Trump is changing the way America works - and how the world's most powerful country deals with the rest of the world.\nWe'll track what he does and connect the dots to your daily life.\nRamaphosa calls on Trump to release Venezuela's Maduro\nPresident Cyril Ramaphosa has called on US President Donald Trump to release Venezuela's overthrown leader Nicolás Maduro, who is being held in the United States on drug-related charges.\nFollow us on WhatsApp | LinkedIn for the latest headlines\nRamaphosa said the US military action in Venezuela violated international law and the sovereignty of a United Nations member state.\nHe was speaking at the annual Joe Slovo memorial held at Avalon Cemetery in Soweto.\n\"It is our commitment to international law and the United Nations Charter that informs our deep concern about the actions of the United States in Venezuela,\" Ramaphosa said.\n\"We reject what the United States has done. We stand with the people of Venezuela and demand the release of President Maduro and his wife.\"\nHis comments follow a US military operation in Venezuela that led to Maduro's capture and transfer to the United States. The move has drawn criticism from several countries.\nRamaphosa said the African National Congress had also issued a statement rejecting the US action and calling for Maduro's immediate release. He urged the United Nations to play a stronger role in protecting peace and sovereignty.\nVenezuela's ambassador to South Africa, Carlos Feo Acevedo, also addressed the gathering. He described the US strikes and Maduro's arrest as humiliating but said Venezuela would not give up.\n\"Our president and his wife have been taken. Civilians have been killed,\" Acevedo said.\n\"But we are not defeated. Our institutions are still standing and our people remain strong.\"\nAcevedo thanked South Africa for pushing for an urgent UN Security Council meeting on Venezuela, which was held earlier this week.\nTrade union federation Cosatu also condemned the US action. President Zingiswa Losi said the world was being pushed back to a time where powerful countries acted without consequence.\n\"We cannot accept a world where might is right and the sovereignty of nations is ignored,\" Losi said.\nImage source: File\nTrump hints at taking control of Greenland after Venezuela action\nUS President Donald Trump has hinted that the United States could move to take control of Greenland, following the recent US operation that removed Venezuela's leader Nicolás Maduro.\nSpeaking to The Atlantic magazine, Trump said: \"We do need Greenland, absolutely.\"\nThe comment got a strong reaction from Denmark, which governs Greenland as part of the Danish kingdom. UK Prime Minister Sir Keir Starmer backed Denmark, saying the country alone has the right to decide Greenland's future.\n\"Greenland and the Kingdom of Denmark are to decide the future of Greenland, and only Greenland and the Kingdom of Denmark,\" Starmer said during media interviews in the UK.\nDenmark's Prime Minister, Mette Frederiksen, also rejected Trump's comments, saying the US has no right to annex any part of the Danish kingdom.\nTrump's comments came days after the US removed Venezuelan president Nicolás Maduro and took him to the United States to face charges linked to drug trafficking.\nSome of Trump's allies have openly returned to the idea of Greenland becoming a US territory. Katie Miller, the wife of senior Trump adviser Stephen Miller, shared an image of Greenland coloured like the US flag with the word \"soon\" on social media after the Venezuela operation.\nEuropean leaders have warned that any move on Greenland would threaten Nato unity and international law, as Denmark is a close US ally.\nImage source: File\nTrump threatens incoming Venezuelan president\nUS President Donald Trump has warned Venezuela's incoming leader Delcy Rodríguez that she could face \"very big\" consequences if she does not cooperate with the United States.\nTrump made the comments in an interview with US magazine The Atlantic after the removal of long-time leader Nicolás Maduro.\n\"If she doesn't do what's right, she is going to pay a very big price, probably bigger than Maduro,\" Trump said.\nMaduro, who ruled Venezuela for more than a decade, was recently removed from power and is now in US custody, facing charges linked to drug trafficking and weapons offences. He has denied the allegations.\nRodríguez, who previously served as Maduro's vice president, is due to be sworn in as Venezuela's new president on Monday. At her first cabinet meeting, she called for cooperation with the United States.\n\"We invite the US government to collaborate with us on an agenda of cooperation based on international law,\" Rodríguez said.\nDespite Trump's warning, Rodríguez remains backed by Venezuela's military and supreme court, and her government is expected to continue many of the country's existing policies.\nUS Secretary of State Marco Rubio said the United States is not at war with Venezuela, describing recent actions as law enforcement measures aimed at drug trafficking, not an invasion.\nTrump also issued threats toward Venezuela's neighbour Colombia, saying he would not rule out military action and accusing its leadership of allowing drug trafficking.\nImage source: File\nTrump says his health is perfect despite taking extra aspirin\nUS President Donald Trump has said he takes more aspirin than his doctors recommend but insists his health is \"perfect\", according to a new interview with the Wall Street Journal.\nTrump, 79, said the high daily dose causes him to bruise easily and that doctors have advised him to reduce it. He said he ignored that advice because he has been taking aspirin for about 25 years.\n\"I'm a little superstitious,\" Trump told the newspaper. \"They say aspirin is good for thinning out the blood, and I don't want thick blood pouring through my heart.\"\nTrump's comments come after the Journal raised questions about his health, adding to ongoing scrutiny because of his age.\nIn recent months, Trump has drawn attention after appearing drowsy at public events and being seen with what looked like make-up on his hand. His health has become a sensitive topic following similar concerns about former president Joe Biden during his time in office.\nTrump told the Journal he now starts his day early in an office inside the White House residence, before moving to the Oval Office around 10am. He said he works until 7pm or 8pm and has asked staff to reduce the number of meetings so he can focus on the most important ones.\nHe said aides have encouraged him to slow down, including spending more time at Mar-a-Lago over the festive period and trying to stay alert during public appearances.\nTrump also said he regretted undergoing advanced heart and abdominal scans during a routine medical check in October because it drew public attention.\n\"In retrospect, it's too bad I took it,\" he said. \"It made people think something was wrong, when nothing was wrong.\"\nTrump's doctor, Navy Captain Sean Barbabella, said the president was in \"exceptional health\" and fit to serve. The White House also released an AI-generated analysis suggesting Trump's heart age is 65.\nTrump acknowledged trying compression socks to deal with leg swelling but said he stopped using them because he did not like them. He said walking more had helped.\nHe also said he does not enjoy exercise beyond playing golf.\n\"I just don't like it. It's boring,\" Trump said, adding that his energy comes from \"very good genetics\".\nImage source: File\nTrump hints at possible war with Venezuela\nDonald Trump says he is not ruling out the possibility of war with Venezuela.\nIn a phone interview with NBC News, the former United States president was asked whether military action was still an option.\n\"I don't rule it out, no,\" he said.\nHis comments come as tensions remain high between the two countries over oil and sanctions.\nTrump also said there would be more seizures of oil tankers near Venezuela. The United States has been targeting ships it says are linked to Venezuela's state oil company.\nTrump promises major economic growth in White House speech\nUS President Donald Trump said the United States is \"poised for economic growth the likes of which the world has never seen\" during a rare address from the White House on Wednesday night.\nTrump had teased the speech for days, suggesting a major announcement was coming. Instead, the address largely repeated familiar claims, with Trump blaming the Biden administration for economic problems and accusing immigrants of driving the housing crisis and rising living costs.\nOne concrete announcement was that \"warrior dividends\" of $1,776 would be paid to more than 1.4 million US service members before Christmas. Trump suggested the money would come from revenue raised through his tariff increases.\n\"We made a lot more money than anybody thought because of tariffs,\" Trump said. \"Nobody deserves it more than our military.\"\nTrump also claimed that medicine prices would fall sharply from the new year, saying they would drop \"by numbers never conceived possible\", without explaining how this would happen.\nSome broadcasters aired the speech live. USA Today displayed a message throughout the broadcast stating that Trump's claims had not been independently verified.\nDuring the address, Trump made sweeping statements about foreign policy, including saying he had brought peace to the Middle East \"for the first time in 3,000 years\". Fighting and air strikes have continued in Gaza and elsewhere in the region despite a ceasefire agreement.\nTrump repeatedly attacked former president Joe Biden, blaming him for high inflation and high prices. He claimed grocery and fuel prices had fallen, although several of his figures have already been challenged by fact-checkers.\n\"Our nation is strong,\" Trump said. \"America is respected, and our country is back.\"\nThere was no mention of Venezuela, despite speculation the speech could include a major foreign policy announcement. Earlier this week, Trump announced a blockade targeting Venezuelan oil shipments.\nImage source: File\nTrump defends chief of staff after she says he has an 'alcoholic' personality\nUS President Donald Trump has defended his chief of staff, Susie Wiles, after she said he has the personality of an alcoholic, despite not drinking alcohol himself.\nThe comment was made by Wiles in a series of interviews with Vanity Fair, where she described Trump as having an \"alcoholic's personality\" because of his intense confidence, drive and belief that there is nothing he cannot do.\nSpeaking to the New York Post on Tuesday, Trump said he was not offended and agreed with her description.\n\"Oh, she's fantastic,\" Trump said. \"I've often said that if I did drink, I'd probably be an alcoholic.\"\nTrump explained that he believes Wiles meant he has an addictive and intense personality, not that he drinks alcohol.\n\"I have an addictive type of personality,\" Trump said. \"I've said that about myself many times. I'm lucky I don't drink.\"\nWiles, who is known for keeping a low public profile, made the remark while discussing her experience dealing with powerful personalities. She said her upbringing helped her understand figures like Trump.\nTrump also attacked Vanity Fair, saying the article was misleading and deliberately negative. He claimed the interviewer left out positive context to portray the White House as chaotic.\nIn response to the article, Wiles said it was a \"disingenuously framed hit piece\" and said her comments were selectively used to attack both her and the president.\nWhite House press secretary Karoline Leavitt said the administration fully supports Wiles and praised her leadership, calling her one of Trump's most trusted advisers.\nThe Vanity Fair interviews also included Wiles making blunt remarks about other senior figures in the administration, including criticism of how some policies were handled and how expectations were managed around the release of Jeffrey Epstein-related records.\nImage source: File\nTrump says Ukraine peace deal is closer than ever\nUS President Donald Trump has said talks with Russian President Vladimir Putin have brought a peace deal in Ukraine closer than at any point since the war began.\nSpeaking at the White House on Monday, Trump said he had held long discussions with European leaders and had spoken several times with Putin.\n\"I think we're closer now than we have ever been,\" Trump said. \"We've had numerous conversations with President Putin, and I believe we're closer than before.\"\nTrump also said the United States and Europe are working on security guarantees to protect Ukraine from future Russian attacks.\n\"In terms of security guarantees, we'll work on that,\" he said. \"Europe will be a big part of it.\"\nHis comments came after talks in Berlin between officials from Ukraine, Germany and the United States. While negotiators said progress had been made, they admitted major disagreements remain.\nUkrainian President Volodymyr Zelenskyy said Trump's envoy Steve Witkoff and Trump's son-in-law Jared Kushner had a clearer understanding of Ukraine's position after two days of talks.\nHowever, details of the guarantees have not been made public. One US official said about 90 percent of the issues had been resolved.\nRussia has already said it opposes any European peacekeeping force and insists its own demands be included in any deal.\nA major issue remains territory. Russia wants Ukraine to withdraw from parts of eastern Ukraine that Kyiv still controls. Zelenskyy said this is unacceptable.\nThe US has pushed for a deal before Christmas, but Ukraine has resisted giving up land.\nUS officials also confirmed talks about rebuilding Ukraine after the war, while Washington wants Russia to return to the global economy to reduce the risk of another conflict.\nImage source: File\nTrump tells American Jews not to fear after Australia attack\nUS President Donald Trump has said American Jews should not be afraid to celebrate Hanukkah following a deadly attack at a Jewish event in Australia.\n\"Celebrate proudly - be proud of who you are,\" Trump told Fox News on Sunday.\nHis comments came after a mass shooting at a \"Hanukkah by the Sea\" event at Bondi Beach in Sydney, where at least 11 people were killed and dozens were injured. Australian authorities described the shooting as a targeted attack on Jewish Australians.\nAustralian Prime Minister Anthony Albanese condemned the violence, calling it an attack on the country's values.\n\"An attack on Jewish Australians is an attack on every Australian,\" Albanese said. \"There is no place for this hate, violence and terrorism in our nation.\"\nPolice confirmed that a bystander intervened and disarmed the attacker, helping to prevent further deaths.\nIsraeli Prime Minister Benjamin Netanyahu criticised the Australian government, saying its failure to act against rising antisemitism had contributed to a dangerous environment. He said he had warned Albanese months earlier about growing hostility toward Jewish communities.\nJewish leaders also warned that the attack shows antisemitic violence is a global threat.\n\"Terror doesn't stop in one country,\" said Yael Eckstein of the International Fellowship of Christians and Jews. \"The answer to darkness is light.\"\nImage source: File\nTrump signs order stopping states from regulating AI\nUS President Donald Trump has signed an executive order that stops states from making their own laws to regulate artificial intelligence (AI).\nThe order, signed on Thursday, gives full control over AI policy to the federal government and sets up a new \"AI Litigation Task Force\" to challenge any state-level AI laws.\nTrump said tech companies would avoid investing in the US if they had to \"get 50 different approvals from 50 states.\"\nThe order is a win for big AI companies, who have lobbied against local regulation. But critics say it gives too much power to Silicon Valley while ignoring the risks of AI - including job losses, misinformation, and data abuse.\nCalifornia and Colorado, which have introduced their own AI safety rules, are expected to be the first targets of the taskforce.\nCivil rights groups accused Trump of siding with wealthy tech CEOs instead of protecting ordinary Americans. \"This is not about innovation - it's about handing control of AI to big tech,\" said Teri Olle of Economic Security California Action.\nTrump argued that his order would keep the US ahead of China in the global AI race. \"You can't go through 50 states,\" he said. \"You'll have one woke state and it'll ruin everything.\"\nImage source: File\nTrump launches $1 million gold card for fast track to US citizenship\nUS President Donald Trump has launched a new \"gold card\" programme offering a fast track to American citizenship - but only for those willing to pay $1-million.\nThe scheme, unveiled on Wednesday at the White House, replaces the existing EB-5 visa system designed to attract foreign investors.\nTrump said the new \"gold card\" will allow vetted applicants to live and work in the United States, describing it as \"basically a green card but much better.\"\nThe president said all funds raised would go directly to the US government and predicted \"billions\" would pour into the Treasury.\nTrump argued the programme would help American companies keep top international talent. \"You can't hire people from the best colleges because you don't know if you can keep them,\" he said.\nUnder the plan, individuals must invest $1-million, while companies hiring foreign workers must pay up to $2-million for each employee.\nMeanwhile, the US government is also proposing tighter entry requirements for tourists, including a rule requiring five years of social media history from visitors using visa-free entry.\nTrump dismissed concerns that the measure could hurt tourism, saying: \"We just want people to come here safely. We want security.\"\nImage source: File\nZelenskyy hits back at Trump and says Ukraine ready for election\nUkrainian President Volodymyr Zelenskyy says he is ready to hold an election within three months if parliament and allies approve, after Donald Trump accused him of \"clinging to power.\"\n\"This is a question for the people of Ukraine, not for people from other states,\" Zelenskyy said on Tuesday, clearly irritated by Trump's comments.\nHe added that if the US and European countries could help ensure security, Ukraine would be \"ready for elections in 60 to 90 days.\"\nTrump told Politico that Ukraine \"hasn't had an election in a long time\" and suggested it was \"not a democracy anymore.\"\nZelenskyy's five-year term expired in May 2024, but Ukraine's constitution bans elections during wartime. Opposition lawmakers have agreed that holding a vote under current conditions would be dangerous and help Russia.\nZelenskyy said the main challenge is finding a way for soldiers, displaced people, and those in occupied territories to vote safely.\nHe made the comments while returning from a tour of Europe, where he discussed Trump's peace plan with Western leaders.\nTrump and his son have accused Zelenskyy of prolonging the war to stay in power - claims Ukraine strongly denies.\nImage source: File\nTrump statue removed after visitors kept hitting it\nA wax figure of Donald Trump has been removed from display after visitors kept punching and scratching it at a museum in San Antonio, Texas.\nThe life-sized model, which showed Trump giving two thumbs up, was badly damaged at Louis Tussaud's Waxworks, forcing staff to pull it from the exhibit.\nMuseum staff said the figure had been \"assaulted\" too many times to stay on show. Photos showed visible scratches and marks on its face.\nRipley Entertainment, which runs the museum, said attacks on wax figures are not unusual. Spokesperson Suzanne Smagala-Potts said, \"Sometimes people take a swipe -- they did it with Obama, Bush, and other celebrities too.\"\nRegional manager Clay Stewart said the problem gets worse when a figure is \"highly political.\"\nThe museum hopes to bring Trump's figure back once a Joe Biden statue is ready, so both can be displayed together.\nTrump has often been the target of controversial art. Earlier this year, a student in Ohio made headlines with an artwork showing Trump's head on a spike.\nHe also criticised a Colorado artist whose portrait of him hung in the state Capitol, calling it \"the worst painting\" he had ever seen. The portrait was later removed after Trump's comments.\nImage source: @Grouse_Beater\nTrump says Zelenskyy not ready for peace deal\nDonald Trump says Ukraine's president Volodymyr Zelenskyy is \"not ready\" to approve a US peace proposal to end the war with Russia.\nSpeaking after three days of talks between US and Ukrainian officials in Florida, Trump said Zelenskyy \"hasn't read the proposal\" but claimed \"his people love it.\"\nThe talks ended on Saturday without an agreement. Zelenskyy described them as \"constructive, although not easy.\"\nTrump's peace plan, drafted by his advisers, aims to end Russia's invasion and includes conditions on territory and security guarantees. But key issues, including who controls occupied land, remain unresolved.\nTrump said Russia was \"fine with the deal\" but admitted he wasn't sure if Zelenskyy would accept it.\nThe Ukrainian leader is set to meet with UK Prime Minister Keir Starmer and the leaders of France and Germany in London to discuss next steps.\nThe Trump administration's top envoy, Keith Kellogg, said the peace effort was \"in the last 10 metres\" but confirmed that territory and the Zaporizhzhia nuclear plant were still major sticking points.\nTrump has been pushing for quick peace, arguing that \"too many lives have been lost.\" But Ukrainian officials insist any deal must guarantee full security and sovereignty.\nImage source: File\nTrump to attend 2026 Fifa World Cup draw\nUS President Donald Trump will attend the official draw for the 2026 Fifa World Cup, the White House confirmed on Monday.\nThe ceremony will take place on Friday at the John F. Kennedy Center for the Performing Arts in Washington.\nAccording to White House press secretary Karoline Leavitt, Trump is expected to be there in person.\nThe United States is co-hosting the 2026 World Cup alongside Canada and Mexico. The draw is seen as a major moment in preparing for the tournament.\nTrump has called the World Cup a highlight of his second term and a key part of the 250th anniversary of American independence.\nBut the road to the tournament hasn't been smooth.\nTensions are rising over Trump's hardline domestic policies, which are stirring political controversy ahead of the global event.\nHe has even suggested moving matches away from some US host cities, blaming crime and immigration problems in areas led by Democrats.\nTrump vows to ban immigrants from \"Third World\" countries\nPeople from more than 60 countries in Africa, Asia and the Pacific face a harsh new reality after United States president Donald Trump said he will shut them out for good if he returns to power.\nTrump posted the plan on his Truth Social account late on Thanksgiving Day.\nHe says blocking immigration from what he calls \"Third World\" countries will, in his view, fix the United States immigration system and reverse what he claims are \"millions of Joe Biden illegal admissions.\"\nHe also says that anyone already living in the United States who is not a \"net asset\" or who \"can't love the country\" will be removed.\nAccording to the World Population Review, countries on that list include places like Nigeria.\nMany others across Africa, Asia and the Pacific fall under the same label through human capital rankings.\nTrump's statement comes just after he confirmed the death of Sarah Beckstrom, a West Virginia National Guard soldier who was shot and killed near the White House.\nThe accused shooter is 29-year-old Rahmanullah Lakanwal from Afghanistan.\nSoon after the killing, the head of United States Citizenship and Immigration Services said he is now reviewing green cards already issued to people from countries seen as \"of concern.\"\nA United States immigration official told CNN that the list covers 19 countries named in a June presidential proclamation.\nThese are Afghanistan, Burma, Chad, Republic of Congo, Equatorial Guinea, Eritrea, Haiti, Iran, Libya, Somalia, Sudan, Yemen, Burundi, Cuba, Laos, Sierra Leone, Togo, Turkmenistan and Venezuela.\nTrump pushes Ukraine peace plan as Europe pushes back\nUnited States president Donald Trump says his plan to end the war in Ukraine is almost ready, but European leaders are not buying it.\nTrump says his team has \"fine-tuned\" the plan and that talks will go ahead in Moscow next week. He says Russia has already made some concessions, but he did not explain what they were.\nHe spoke to reporters on Air Force One and said his team is working with both Russia and Ukraine. He also wrote on Truth Social that he is sending envoys to Moscow and Kyiv to deal with the \"few remaining points of disagreement\".\nTrump's special envoy Steve Witkoff will lead the talks. The Kremlin says Witkoff and a group of senior United States officials will join the discussions in Moscow.\nUkrainian officials say they support the \"essence\" of the plan after talks with United States diplomats in Geneva.\nBut European leaders say they do not want to be left out. European Commission President Ursula von der Leyen says Ukraine's future must include joining the European Union as part of any peace deal.\nGerman Chancellor Friedrich Merz says peace will not last if Ukraine and Europe are pushed aside.\nHe says they want the war to end quickly, but peace must involve everyone at the table.\nThe leaders say no deal will work unless Ukraine has a real say in the plan.\nTrump's U-turn on Obama Care puts Republicans in a tight spot\nUS president Donald Trump is causing chaos in his own party with a surprise plan to extend health care subsidies under ObamaCare -- the very policy he and other Republicans have spent years attacking.\nAccording to The Hill, Trump now wants to keep the tax credits that help millions afford health care for another two years -- with a few strings attached. His proposal includes limiting eligibility and making people pay at least something towards their premiums.\nThat puts Republican leaders like House Speaker Mike Johnson and senate majority leader John Thune in a bind. Just last month, they refused to even talk to Democrats about extending the subsidies. Their refusal led to a 43-day government shutdown.\nBut the subsidies are set to end on 1 January. That could cause health care costs to shoot up for around 22 million Americans -- just months before key elections.\nRepublicans now face a painful choice: back a law they've called toxic for years, or let costs explode and risk losing voters.\nTrump's plan hasn't officially been announced. The White House reportedly delayed the rollout after backlash from conservative allies. \"Hoping this isn't true,\" posted Republican Congressman Bob Onder on X.\nBut more moderate Republicans are begging their party to reconsider. Former GOP adviser Brendan Buck warned that letting the subsidies expire could be political suicide.\nTrump's move is a major flip-flop. Just weeks ago he was slamming ObamaCare as a \"boondoggle\" and promising to send money \"back to the people\" instead of \"fat insurance companies\".\nDemocrats aren't buying his new tone. Some say the new proposal would still hurt poor families by cutting benefits. But others, like Senator Jeanne Shaheen, say Trump's support could help break the deadlock and get a deal done.\nEven some conservatives say the plan is at least a start. \"At least Trump's proposal does something,\" said Republican Tim Burchett.\nStill, there's no sign Congress is ready to act.\nTrump calls reporter 'piggy' - White House says he's just being honest\nThe White House has defended United States President Donald Trump after he called a female reporter \"piggy\" when she asked about his connection to convicted sex offender Jeffrey Epstein.\nDuring the exchange aboard Air Force One, which has since gone viral, Trump leaned toward the reporter, pointed at her and said: \"Quiet, piggy.\" She had asked him about an Epstein email where the late financier claimed Trump \"knew about the girls\".\nAsked about the insult, White House press secretary Karoline Leavitt told reporters on Thursday that American voters had re-elected Trump \"for his frankness\" and said reporters should \"appreciate his openness\".\n\"He calls out fake news when he sees it and gets frustrated with reporters who spread false information,\" said Leavitt, without giving any proof that the reporter's question was false. \"But he also provides unprecedented access to the press and answers questions on a near-daily basis.\"\nThis wasn't the only clash. Two days earlier, Trump called another female journalist \"a terrible person\" when she asked Saudi Crown Prince Mohammed bin Salman about the murder of journalist Jamal Khashoggi and questioned Trump about the Epstein files.\nLater, Trump signed legislation forcing the Justice Department to release the Epstein documents, after initially resisting.\nThe Society of Professional Journalists hit back this week, slamming Trump's language and accusing him of using insults to silence and discredit women.\n\"Targeting women reporters with humiliating insults should not be tolerated,\" said SPJ executive director Caroline Hendrie.\nThe White House declined to comment further on the \"piggy\" remark.\nTrump wants new district maps, but Indiana senators say not now\nUS president Donald Trump is demanding that Indiana lawmakers redraw the state's congressional map -- but they're not playing along.\nThe state's Republican-controlled Senate voted on Tuesday not to come back for a special session this year, defying Trump's public pressure to give the party a better chance of keeping control of the US House in 2026.\nTrump has been attacking Republican lawmakers who refuse to back him, especially Senate leader Rodric Bray. On Truth Social, Trump warned Bray would \"have a Primary Problem\" -- even though Bray isn't up for re-election until 2028.\nTrump and Indiana governor Mike Braun want to use the party's supermajority to shift district lines and strengthen Republican chances in future elections. Right now, Republicans hold seven of Indiana's nine seats in the US House.\nBut not everyone agrees. Some Republican senators say voters don't support changing the maps in the middle of the cycle, while others believe the party should focus instead on winning back Indiana's 1st District.\nGovernor Braun, who spoke with Trump the day before the vote, slammed lawmakers for rejecting the idea and said he would support challengers to Republicans who don't back \"fair maps\".\nEven so, the Senate voted 29-19 to hold off until January -- a big blow to Trump's plan. On the same day, a court in Texas blocked another Republican-drawn map, making the fight even tougher for the former president.\nIt's still unclear whether Indiana's House of Representatives will return in December, though members have been asked to keep their schedules open.\nTrump agrees to support release of Epstein files\nPresident Donald Trump has now agreed to support a plan in Congress to release all of the Jeffrey Epstein files -- but only after realizing he could no longer stop it.\nAccording to people close to him, Trump was told in recent days that the effort to release the files had too much support in the House of Representatives. If he kept fighting it, he risked an embarrassing defeat. This pushed him to suddenly change his position on Sunday night. On Monday, he said from the Oval Office that he would sign the measure if it reached his desk.\nTrump did not make this choice happily. He has been frustrated that the Epstein issue keeps coming up, saying it distracts from his agenda and gives Democrats another way to attack him. He also does not like being linked to Epstein at all and says he ended his relationship with him long before Epstein was charged with any crimes.\nJust two days before changing his stance, Trump even attacked Republican congresswoman Marjorie Taylor Greene for strongly supporting the release of the files. He pulled back his endorsement of her and called her a \"traitor.\"\nBut eventually, Trump's advisers convinced him that fighting the measure only brought more attention to the issue. They told him the vote would pass whether he liked it or not. So Trump switched to supporting it -- not because he wanted to, but because the fight was already lost.\nPeople close to him say this is a tactical move. By supporting the quick release of the files, Trump hopes the topic will fade faster so he can refocus on the policies he wants the public to pay attention to.\nTrump flips again as fight over Epstein records heats up\nPeople who have followed the Jeffrey Epstein story for years want the truth to come out. Now they are watching Donald Trump change his tune.\nTrump, who once called the Epstein investigation \"boring\" and a \"hoax\", is now urging House Republicans to release the files. He posted on his Truth Social account that \"we have nothing to hide\".\nHis sudden shift comes as more Republican lawmakers join Democrats to support the Epstein Files Transparency Act. The proposed law forces the US Justice Department to release all remaining records within 30 days.\nSo far, 218 members of the House of Representatives have signed on, which is enough to force a vote. Republican co-sponsor Thomas Massie told ABC News that around 100 Republicans might back the bill.\nTrump's change of heart is causing trouble in his own party. He clashed with former ally Marjorie Taylor Greene after she said the public deserves to know the truth about Epstein. Trump called her a \"traitor\" and a \"ranting lunatic\", and even threatened to support a rival against her.\nHe also phoned Republican lawmakers, including Lauren Boebert, after they supported the bill. At the same time, old emails have surfaced claiming Trump \"knew about the girls\" and spent time at Epstein's home with one of the victims.\nTrump had a long friendship with Epstein but denies knowing about any crimes. His name already appears in previously released records from the Justice Department.\nIn July, he attacked his own supporters who wanted more information. He again called it the \"Jeffrey Epstein Hoax\" and told the FBI to investigate his critics, including Bill Clinton and Larry Summers. Both men admit they knew Epstein but deny criminal wrongdoing.\nEpstein died in jail in 2019 while waiting for trial for sex trafficking. He had close ties to powerful people in politics, business and entertainment.\nTrump's Boycott overshadows South Africa's G-20 summit\nThe upcoming G-20 summit in Johannesburg is facing major problems, mainly because US President Donald Trump has decided to boycott the event.\nTrump says neither he nor any US officials will attend, accusing South Africa of mistreating White Afrikaners.\nHis decision removes the leader of the world's largest economy from a meeting meant to address global economic issues.\nTrump's boycott also comes at a time when other major leaders are pulling out.\nChina's President Xi Jinping will not attend and will instead send Premier Li Qiang.\nRussia's Vladimir Putin also cannot travel because of an International Criminal Court arrest warrant.\nTrump's absence adds to the pressure on South Africa, which is hosting the G-20 summit for the first time.\nWithout the US president there, the meeting loses significant political weight and global attention.\nWhile Xi has been limiting international travel since the pandemic, Trump's no-show is more of a political statement. His decision highlights rising tensions between Washington and Pretoria and deepens global uncertainty ahead of the summit.\nDespite the missing leaders, China has insisted the summit remains historically important, especially as the first G-20 gathering on African soil.\nPremier Li will represent Beijing, as he has done at other major events in recent years.\nDemocrats say Trump knew about Epstein abuse\nNewly released emails suggest that Donald Trump knew more about Jeffrey Epstein's sex-trafficking activities than he has admitted.\nThe messages, made public by Democrats in the US House of Representatives, include one in which Epstein told an associate that \"of course [Trump] knew about the girls,\" and another saying Trump \"spent hours\" with one victim at Epstein's house.\nThe revelations increase pressure on the White House to release the full set of so-called Epstein files, which reportedly contain more details of Trump's connection to the late financier.\nTrump responded on his Truth Social platform, calling the claims \"another hoax\" by Democrats trying to distract from the government shutdown. He urged Congress to \"focus on reopening the country.\"\nThe White House press secretary, Karoline Leavitt, dismissed the emails as \"a political stunt,\" saying they showed \"nothing improper.\" She identified the victim mentioned in one email as Virginia Giuffre, who worked at Trump's Mar-a-Lago resort as a teen and later accused Epstein and Ghislaine Maxwell of abuse. Giuffre died earlier this year.\nLeavitt said Giuffre had \"never accused President Trump of any wrongdoing.\"\nDemocrats, however, say the emails raise serious questions. Representative Robert Garcia said: \"The more Trump tries to cover up the Epstein files, the more we uncover.\"\nSeveral Democratic and Republican lawmakers are now calling for a full public release of the Epstein documents. A vote could happen within days as Congress reconvenes after the shutdown.\nEpstein, who ran a sex-trafficking ring involving underage girls, died in 2019 while awaiting trial. His associate, Ghislaine Maxwell, is serving a 20-year prison sentence.\nImage source: File\nTrump defends foreign visas saying Americans lack talent\nPresident Donald Trump has defended the US skilled-worker visa programme, saying the country lacks enough talent to fill specialised jobs.\nIn an interview with Fox News, Trump told host Laura Ingraham that while he agrees immigration can affect wages, the US still needs foreign experts.\n\"You don't have certain talents, and people have to learn,\" Trump said. \"You can't take people off an unemployment line and say, 'I'm going to put you into a factory where we're going to make missiles.\"'\nHe referred to a recent raid on a Hyundai battery plant in Georgia, where hundreds of South Korean contractors were deported. \"Making batteries is complicated and dangerous,\" he said. \"You're going to need that talent.\"\nTrump had earlier criticised the raid, calling it \"a mistake,\" despite his own immigration crackdown. In September, he also introduced a $100,000 application fee for H-1B visas, used by companies to hire foreign professionals.\nEconomists say the visas help US firms stay competitive and create jobs.\nIn the same interview, Trump also joked about France while defending Chinese student enrolments in US universities. \"They're not the French,\" he said when asked about spying concerns.\nImage source: File\nTrump threatens to sue BBC for $1 billion over \"doctoring\" allegations\nU.S. president Donald Trump has reportedly threatened to sue the BBC for a staggering $1 billion, claiming the broadcaster \"doctored\" footage of his speech to supporters ahead of the January 6, 2020 Capitol riots.\nAccording to reports, Trump's legal team has accused the BBC's Panorama programme of misleading editing and has demanded an apology, a full retraction, and what they call \"appropriate compensation\" to the tune of one billion dollars. The BBC has been given until Friday at 10 p.m. to respond to the threat.\nThe controversy has sparked widespread public reaction, with many mocking the former president's latest legal move. The UK's Daily Star captured the mood on its front page, comparing Trump to Dr. Evil, the parody villain from the Austin Powers films. In a famous scene from the 1997 comedy, Dr. Evil proposes holding the world ransom for \"one million dollars\", before realising the sum isn't quite as menacing as it sounds and upping it to \"one hundred billion.\"\nThe comparison struck a chord online, with many seeing Trump's $1 billion lawsuit demand as similarly over-the-top. Still, Trump's team appears intent on pursuing the case, framing it as a fight against media manipulation and bias.\nThe BBC has not yet publicly responded to the legal threat.\nImage source: File\nTrump booed at football game in surprise Washington appearance\nDonald Trump became the first sitting US president in almost 50 years to attend a regular-season NFL game when he watched the Detroit Lions beat the Washington Commanders on Sunday.\nThe president received a mixed reception at Northwest Stadium in Washington, with loud boos and some cheers when he appeared on the big screens. The crowd jeered again when Trump was introduced at halftime.\nDuring a break in play, Trump led a short ceremony on the field, reading an oath for military personnel as the jeering continued.\nArriving after kickoff, he told reporters, \"I'm a little bit late. We're gonna have a good game. Things are going along very well. The country's doing well. The Democrats have to open it up,\" referring to the shutdown.\nDetroit receiver Amon-Ra St Brown celebrated a touchdown with a \"Trump dance,\" saying afterward: \"I heard Trump was going to be here... I just decided to have some fun.\"\nFox gave Trump nearly ten minutes on air during the broadcast. He spoke about his high school football days, commented on the economy, and joked: \"At least you realise I never tell a lie.\"\nAccording to ESPN, the White House has told the Commanders' owners that Trump wants the team's new stadium to bear his name.\n\"They're going to build a beautiful stadium,\" Trump told Fox. \"You're going to see some very good things.\"\nThe Commanders lost 44-22, and Trump left before the end of the game.\nImage source: File\nFifa boss accused of breaking rules after praising Trump\nFifa president Gianni Infantino has been accused of breaking the football body's neutrality rules after publicly praising US President Donald Trump.\nSpeaking at the American Business Forum in Miami on Wednesday, Infantino said, \"We should all support what he's doing because I think it's looking good,\" calling Trump \"a close friend\" and praising his leadership.\nMiguel Maduro, a former chairman of Fifa's governance committee, said Infantino's remarks clearly violate Fifa's code of political neutrality. \"He endorsed Trump's political programme and argued others should support him too. That's not neutrality,\" Maduro said.\nFifa's rules state that the organisation \"remains neutral in matters of politics and religion.\"\nInfantino told the audience Trump \"does what he says\" and \"was elected based on his programme,\" adding that people should \"respect the results of the election\" and \"support what he's doing.\"\nFifa declined to comment on the allegations.\nIronically, Infantino's remarks came the same day Fifa announced a new \"Peace Prize\", which he suggested could be awarded to Trump later this year at the World Cup draw in Washington.\nImage source: File\nTrump says South Africa should be kicked out of G20\nUS President Donald Trump has said South Africa should be removed from the G20 and that he will not attend the group's upcoming summit in Johannesburg.\n\"South Africa shouldn't even be in the Gs anymore, because what's happened there is bad,\" Trump told the American Business Forum in Miami on Wednesday.\n\"I'm not going. I'm not going to represent our country there. It shouldn't be there,\" he said of the G20 meeting scheduled for 22-23 November.\nTrump accused South Africa of land seizures and human rights abuses, saying the country had \"treated certain classes of people very badly.\"\nIn February, he signed Executive Order 14204, directing US agencies to help resettle white South African Afrikaners, calling them \"victims of unjust racial discrimination,\" and to cut aid to South Africa.\nPretoria has rejected Trump's accusations, saying they are \"based on a premise that is factually inaccurate.\"\nImage source: File\nTrump says Republicans lost state elections because 'he wasn't on the ballot'\nUS President Donald Trump has blamed poor Republican election results on his absence from the ballot and the ongoing government shutdown.\nAfter a disappointing night for Republicans in several state contests, Trump took to social media late Tuesday to explain the losses.\n\"TRUMP WASN'T ON THE BALLOT, AND SHUTDOWN, WERE THE TWO REASONS THAT REPUBLICANS LOST ELECTIONS TONIGHT,\" he wrote, claiming unnamed \"pollsters\" had told him so.\nHe later called for sweeping changes to US voting laws, including the elimination of mail-in ballots and the Senate filibuster.\n\"Pass Voter Reform, Voter ID, No Mail-In Ballots. Save our Supreme Court from packing... TERMINATE THE FILIBUSTER!!!\" Trump said.\nDuring election night coverage, Trump also reacted to the projected victory of Democrat Zohran Mamdani in the New York City mayoral race, posting: \"...AND SO IT BEGINS!\"\nEarlier in the week, Trump had threatened to cut federal funding to New York City if Mamdani won.\nImage source: File\nTrump denies knowing billionaire he pardoned for money laundering\nUS President Donald Trump says he does not know who Changpeng Zhao is, even though he pardoned the billionaire founder of the cryptocurrency exchange Binance in October.\nIn an interview with CBS's 60 Minutes on Sunday, Trump was asked why he pardoned Zhao, who pleaded guilty to money-laundering charges linked to Binance's failure to report suspicious transactions involving groups such as Hamas and al-Qaida.\n\"OK, are you ready? I don't know who he is,\" Trump said. \"I've got no idea who he is, other than people told me he was being unfairly targeted in a witch-hunt by Joe Biden.\"\nZhao, known as \"CZ,\" had served nearly four months in prison before Trump pardoned him. He also paid a $50-million fine. The White House at the time said Zhao had been punished as part of Biden's \"war on cryptocurrency.\"\nAfter his release, Zhao thanked Trump and said on X that he would help \"make America the capital of crypto.\"\nTrump has said he wants the United States to lead the world in cryptocurrency. Zhao still owns part of Binance, which has done business with World Liberty Financial, a crypto firm linked to Trump's family.\nTrump's comments have drawn attention as his opponents accuse him of confusion and memory lapses. They come as Republicans continue to attack former president Joe Biden for allegedly using an autopen, a machine that replicates signatures, to sign documents and pardons.\nIt's not clear whether Trump's pardon of Zhao was signed by autopen. Some people who were pardoned by Trump after the 2021 Capitol riot have claimed that he did not sign their documents personally.\nImage source: File\nTrump threatens military action in Nigeria over attacks on Christians\nUS President Donald Trump has ordered the military to prepare for possible action in Nigeria, accusing the government of failing to protect Christians from Islamist militants.\nTrump made the announcement on social media on Saturday, saying he had instructed the Department of War to get ready \"for possible action\" and warned that US forces could move in \"guns-a-blazing.\"\n\"If we attack, it will be fast, vicious, and sweet, just like the terrorist thugs attack our cherished Christians,\" he wrote.\nUS Defence Secretary Pete Hegseth confirmed that preparations were under way, saying the military would act if Nigeria did not protect Christians.\nNigeria's presidential adviser Daniel Bwala told the BBC that the country would welcome US help in fighting jihadist groups, but said Nigeria was a \"sovereign\" nation. He added that Islamist militants had killed people of all religions, not just Christians.\nPresident Bola Tinubu rejected Trump's comments, saying Nigeria remained religiously tolerant and that violence in the country affected \"people across faiths and regions.\"\nRights groups and conflict monitors say there is no evidence that Christians are being killed more than Muslims in Nigeria, where the population is roughly split between both religions.\nBwala, a Christian pastor, said Trump had a \"unique way of communicating\" and that Nigeria was not taking his threat literally. \"We know his heart and intent are to help us fight insecurity,\" he said.\nTrump also announced that he had declared Nigeria a \"Country of Particular Concern\" over what he called \"an existential threat\" to Christians. The US designation allows for sanctions against nations accused of violating religious freedoms.\nTinubu responded that the label was unfair and did not reflect Nigeria's reality.\nImage source: File\nTrump orders US to restart nuclear weapons testing\nUS President Donald Trump says he has ordered the Pentagon to resume testing nuclear weapons which is something the United States has not done since 1992.\nSpeaking on Truth Social before meeting Chinese President Xi Jinping in South Korea on Thursday, Trump said the move was to put the US \"on an equal basis\" with other nuclear powers.\n\"Because of other countries' testing programs, I have instructed the Department of War to start testing our nuclear weapons on an equal basis. That process will begin immediately,\" Trump wrote.\nHe added: \"Russia is second, and China is a distant third, but will be even within five years.\"\nThe announcement follows Russian President Vladimir Putin's claim that his military had successfully tested a Poseidon nuclear-powered torpedo - a weapon said to be capable of causing massive radioactive ocean waves.\nPutin also recently oversaw nuclear missile launch drills and the test of a new Burevestnik cruise missile.\nNuclear testing allows countries to check the reliability and power of their weapons, but restarting such tests would mark a major break from decades of restraint by the US and could trigger global concern.\nThe US first tested an atomic bomb in 1945 in New Mexico, followed by the bombings of Hiroshima and Nagasaki, which ended World War II.\nImage source: File\nTrump says it's 'too bad' he can't run for third term\nPresident Donald Trump says it's \"too bad\" he can't run for a third term, admitting that the US Constitution prevents him from doing so - even though he would \"love to do it.\"\nSpeaking to reporters aboard Air Force One on Wednesday, Trump said he had read the rules and found them \"pretty clear.\"\n\"I'm not allowed to run,\" he said. \"It's too bad.\"\nHis comments came a day after House Speaker Mike Johnson told reporters that Trump understood he could not legally seek a third term. \"He and I have talked about the constrictions of the constitution,\" Johnson said.\nThe 22nd Amendment to the US Constitution limits presidents to two terms in office. Changing it would require years of political negotiation and approval from both Congress and the states.\nJohnson described Trump's occasional third-term talk as \"trolling the Democrats,\" saying there was no serious effort to extend his presidency.\nTrump has previously joked about staying in power and has handed out \"Trump 2028\" hats as souvenirs.\nAsked if he could run as vice president to return to power another way, Trump said the idea was \"too cute.\"\n\"You'd be allowed to do that, but I wouldn't do that,\" he said.\nTrump added that there were \"great people\" in the Republican Party who could run in 2028, naming Secretary of State Marco Rubio and Vice President JD Vance among them.\nImage source: File\nTrump gets Japan's backing for Nobel Peace Prize\nJapanese Prime Minister Sanae Takaichi says she will nominate US President Donald Trump for the Nobel Peace Prize.\nWhite House Press Secretary Karoline Leavitt confirmed the announcement after the two leaders met in Tokyo on Tuesday to discuss trade and security issues.\n\"In such a short period of time the world started to enjoy more peace,\" Takaichi told reporters. \"I was so impressed and inspired by you, Mr. President.\"\nTakaichi's nomination adds to a growing list of world leaders backing Trump for the prestigious award. Trump has often claimed credit for ending wars and brokering peace deals since returning to office in January.\nIsraeli Prime Minister Benjamin Netanyahu, Gabon's President Brice Oligui Nguema, and Cambodia's Prime Minister Hun Manet have all nominated Trump for the Nobel Peace Prize this year.\nIn July, Nguema said Trump \"brought peace back to a region where that was never possible,\" referring to an agreement between Rwanda and the Democratic Republic of Congo.\nOnly two former US presidents, Jimmy Carter and Barack Obama, have won the Nobel Peace Prize.\nWhile in Japan, Trump also met with families of people abducted by North Korea decades ago. He promised them that \"the US is with them all the way\" as they continue to search for their missing relatives.\nThe meeting came ahead of a possible summit between Trump and North Korean leader Kim Jong Un as part of the president's Asia trip.\nImage source: @WhiteHouse\nTrump says he had hospital scan but says the results were 'excellent'\nPresident Donald Trump has confirmed that he had an MRI scan during a recent visit to Walter Reed Medical Center, but did not say what it was for.\n\"It was perfect,\" the 79-year-old president told reporters on Air Force One while heading to Tokyo for his Asia tour.\nTrump did not specify which part of his body was scanned. MRIs are used to check many different health issues and do not necessarily point to anything serious.\nHe said the scan took place earlier this month at Walter Reed, the main military hospital used by US presidents. After the visit, his doctor declared that Trump was in \"exceptional health.\"\n\"The doctor said it was one of the best reports they've ever seen for someone my age,\" Trump said.\nIn July, the White House revealed that Trump had been diagnosed with chronic venous insufficiency, a common condition that can cause swelling in the legs.\nAt the time, press secretary Karoline Leavitt said tests found no signs of serious complications such as blood clots or artery disease. She added that Trump's heart and lab results were \"within normal limits.\"\nImage source: File\nTrump ends trade talks with Canada over fake Reagan ad\nDonald Trump says the United States is ending \"all trade negotiations\" with Canada after accusing the country of trying to influence American courts with a fake television ad.\nIn a post on his social media platform on Thursday night, the US president said Canada showed \"egregious behavior\" by using a fake video of former president Ronald Reagan speaking against tariffs.\n\"The Ronald Reagan Foundation has just announced that Canada has fraudulently used an advertisement which is fake, featuring Ronald Reagan speaking negatively about tariffs,\" Trump wrote.\n\"They only did this to interfere with decisions of the US Supreme Court and other courts,\" he said. \"Based on their egregious behavior, all trade negotiations with Canada are hereby terminated.\"\nThe ad was made by the government of Ontario. The Ronald Reagan Foundation said it was \"reviewing legal options\" because the ad used and edited Reagan's 1987 radio speech without permission. It invited the public to watch the original speech to see how it was changed.\nCanadian Prime Minister Mark Carney did not immediately respond but earlier said he planned to double Canada's exports to countries outside the US due to the threat of Trump's tariffs.\nMore than three-quarters of Canadian exports go to the US, with about $2.7-billion worth of goods crossing the border each day.\nOntario Premier Doug Ford defended the ad, saying it was part of a campaign against American tariffs. \"We'll never stop making the case against tariffs on Canada,\" he said.\nTrump and Carney met earlier this month to try to ease tensions as the US, Canada, and Mexico prepare for a review of the trade deal Trump negotiated in his first term.\nImage source: File\nTrump sanctions Russian oil giants after failed peace push\nThe US has hit Russia's two biggest oil companies, Rosneft and Lukoil, with new sanctions as President Donald Trump's administration toughens its stance against Moscow.\nThe move comes a day after Trump cancelled a planned summit with Vladimir Putin, saying he did not believe the talks would lead to progress on ending the war in Ukraine.\nThe sanctions are the first against Russia since Trump returned to the White House in January. They aim to cut off oil money that helps fund Russia's military operations.\n\"Now is the time to stop the killing and for an immediate ceasefire,\" said US Treasury Secretary Scott Bessent. \"Given President Putin's refusal to end this senseless war, we are sanctioning Russia's two largest oil companies that fund the Kremlin's war machine.\"\nSpeaking in the Oval Office alongside NATO Secretary General Mark Rutte, Trump confirmed the cancellation of his planned meeting with Putin.\n\"It didn't feel right to me,\" he said. \"It didn't feel like we were going to get to the place we need to get, so I cancelled it. But we'll do it in the future.\"\nThe Wall Street Journal reported that the US had lifted restrictions on Ukraine's use of British-supplied Storm Shadow missiles to strike targets deep inside Russia. Trump, however, called the report \"fake news,\" saying the US had nothing to do with those weapons.\nImage source: File\nTrump says he won't meet Putin for a 'wasted' talk on Ukraine\nDonald Trump has said he didn't want to waste time meeting Russian President Vladimir Putin after plans for direct talks about the war in Ukraine were put on hold.\nSpeaking at the White House on Tuesday, Trump said the main problem was Russia's refusal to stop fighting along the current battle line.\nLast week, Trump said the two leaders would meet in Budapest within two weeks. But a White House official now says there are \"no plans\" for such a meeting \"in the immediate future.\"\nThe delay follows growing differences between US and Russian peace proposals. A senior European diplomat told Reuters, \"The Russians wanted too much, and it became clear to the Americans that there would be no deal for Trump in Budapest.\"\nA planned meeting between US Secretary of State Marco Rubio and Russian Foreign Minister Sergei Lavrov was also canceled, though both sides said they had a \"productive\" phone call.\nTrump said he supports a plan backed by Ukraine and European leaders to freeze the conflict along the current front line. \"Cut and stop at the battle line. Go home. Stop fighting, stop killing people,\" he said.\nRussia has rejected that idea, saying it only wants a \"long-term, sustainable peace.\"\nUkrainian President Volodymyr Zelensky said freezing the front line was just \"the beginning of diplomacy,\" accusing Russia of trying to avoid real peace talks. He added that Moscow only pays attention when new weapons for Ukraine, like long-range Tomahawk missiles, are discussed.\nReports last week said Trump and Zelensky's White House talks were heated, with Trump allegedly pushing Ukraine to give up parts of the Donbas to Russia. Zelensky refused, saying Ukraine \"cannot surrender territory\" that could be used for future attacks.\nPutin's surprise phone call with Trump came soon after news broke that the US was considering sending Tomahawk missiles to Kyiv. Zelensky said that issue alone had forced Moscow back to the table.\nImage source: File\nTrump tears down part of White House to build $250 million ballroom\nConstruction has begun on a major new addition to the White House - a $250-million ballroom ordered by President Donald Trump.\nDemolition crews started tearing down part of the East Wing this week to make space for the project, one of the biggest renovations at the White House in more than 100 years. Photos published by The Washington Post and New York Post show sections of the building stripped bare.\nThe White House has not commented, but Trump confirmed the project on Truth Social, saying: \"Ground has been broken on the White House Ballroom.\" He added that the project is privately funded by \"generous patriots, great American companies, and, yours truly.\"\nTrump said the new hall will be \"the most beautiful ballroom in the country\" and promised it would not cost taxpayers a cent. He told a crowd in Washington on Monday: \"Right on the other side, you have a lot of construction going on, which you might hear periodically.\"\nPlans first revealed in July show a massive 90,000-square-foot ballroom that can seat up to 650 guests. Trump said it would be finished before the end of his second term in January 2029.\nAt a recent dinner for donors funding the project, Trump reportedly showed guests the construction site through the East Room windows. He told them the ballroom will feature bulletproof glass and space for up to 1,000 people - large enough to host a future inauguration.\nGuests at the event included executives from Amazon, Apple, Meta, Google, Microsoft, Palantir, and Lockheed Martin.\nFormer Republican congressman Joe Walsh described the work as an \"utter desecration,\" writing on X that he'd invite Americans to \"bring their own sledgehammers and crowbars\" to tear it down if he were president.\nDemocratic lawmaker Mark Takano proposed a bill to block White House construction during the ongoing government shutdown, now in its 20th day, unless it is for safety reasons.\nHuman rights lawyer Qasim Rashid added: \"Wealth and income inequality is at record highs in America, but glad we're spending $250m on a vanity project.\"\nImage source: File\nTrump says Israel and Gaza ceasefire still holds after attacks\nThe ceasefire in Gaza broke down on Sunday after fighting in the south of the territory. Israel said its forces were attacked near Rafah, an anti-tank missile and gunfire that killed two Israeli soldiers, and replied with air strikes across Gaza. Hospitals reported many deaths; one source said 44 people were killed that day.\nHamas said it did not know about any clashes in the area Israel named. The group insists it supports the ceasefire, but it also accused Israel of breaking the deal and warned that more strikes could cause the whole agreement to collapse.\nBy late evening, the Israel Defense Forces said it was \"resuming enforcement of the ceasefire.\" The army said it would keep the agreement in place but would hit back hard at any violations. It was not clear if Israel had reversed an earlier order to cut some aid into Gaza.\nUS President Donald Trump, arriving in Washington, said the ceasefire was still in effect. He called the attackers \"rambunctious\" and suggested they might be rebels inside Hamas. He added: \"Either way it's going to be handled properly. Toughly but properly.\"\nThe first phase of the US-brokered ceasefire began on 10 October. It stopped most fighting, pulled some Israeli troops back to a \"yellow line,\" and allowed more aid into Gaza. Under the deal, Hamas released all living hostages and some remains; Israel freed hundreds of Palestinian prisoners and detainees.\nIsrael said one senior Hamas commander was killed in the strikes. Gaza residents also reported heavy shelling, panic among families sheltering nearby, and fires and explosions across several cities.\nThe deal requires Hamas to give up weapons and for Gaza to be demilitarised. But on the ground, armed groups and local clashes make that hard to enforce. Some Gaza fighters reportedly clashed with other armed groups and came under tank fire, which Israel said led to the strikes.\nUS and Israeli officials have warned that any planned attack on civilians by armed groups inside Gaza would be a \"grave\" violation of the ceasefire. The US said it had reports of a possible plan but Hamas strongly denied planning such an attack.\nImage source: File\nPutin warns Trump against arming Ukraine\nUkrainian President Volodymyr Zelenskyy will visit the White House on Friday for key talks with Donald Trump - just hours after the US president said he had agreed to another meeting with Vladimir Putin in Budapest.\nAt the top of the agenda is whether the US will supply Ukraine with Tomahawk cruise missiles. Trump has repeatedly hinted he might send long-range weapons, which could reach Moscow, but his softer tone after a recent call with Putin has raised doubts.\nTrump said Putin \"didn't like\" the idea of Ukraine getting Tomahawks, adding, \"We need them too, so I don't know what we can do about that.\"\nThe possible deal comes as Trump pushes for an end to the war in Ukraine, now in its fourth year. He has vowed to pressure Moscow but has often backed down after speaking to Putin.\nThe US only has a limited number of Tomahawks, estimated at 20 to 50, and they are normally launched from ships or submarines, which Ukraine doesn't have. A new land-based version exists, but only two launchers are available.\nExperts say giving Ukraine even a small number of Tomahawks would be a powerful signal to Russia. One analyst said it would show \"Putin is losing Trump,\" something that worries Moscow more than the missiles themselves.\nRussian officials have warned that supplying the missiles would \"raise the conflict to a new level.\" But some in Moscow believe Trump is bluffing and only using the threat to pressure Putin into peace talks.\nZelenskyy said Russia was \"rushing to talk\" as soon as it heard about the Tomahawk discussion.\nTrump, fresh from brokering a ceasefire in Gaza, has said he wants to build on that success by pushing for peace in Ukraine, but whether that means arming Kyiv or cutting another deal with Putin remains unclear.\nImage source: File\nTrump says Israel can fight again 'as soon as I say the word'\nUS President Donald Trump says he might allow Israel to restart its military campaign in Gaza if Hamas does not follow through on the ceasefire deal.\nSpeaking to CNN, Trump said Israel could be back \"on the streets as soon as I say the word.\"\nThe president was responding to reports that Hamas has delayed returning the bodies of hostages as part of the ceasefire agreement. Israel claims the group is not fully keeping its promises, but the ceasefire has held so far.\nTrump's 20-point peace plan says Hamas must return all hostages, alive and dead, within 72 hours of Israel agreeing to the deal. All 20 living hostages have been freed, but only eight bodies have been handed over so far.\nTrump said rescuing the living hostages was \"paramount,\" and US officials believe Hamas is still trying to locate the remaining bodies buried under debris.\nThere have been reports of violent clashes in Gaza between Hamas and rival groups since the ceasefire began. Trump warned that Hamas must disarm or \"we will disarm them.\" His plan states that Hamas will have no role in ruling Gaza, which will be demilitarised and run by an international body.\nAsked what would happen if Hamas refused to give up its weapons, Trump said: \"I think about it. Israel will return to those streets as soon as I say the word. If Israel could go in and knock the crap out of them, they'd do that.\"\nTrump said he had to stop Israeli forces from resuming attacks but added he believed peace was possible, saying 59 countries were backing his agreement. \"We've never seen anything like this,\" he said. \"Now it's all happening.\"\nTrump also said he was working to end Russia's war in Ukraine, noting that peace in the Middle East and Europe were both close goals. \"One's been going on for three years, the other for three thousand,\" he said.\nImage source: File\nRussia accuses Trump of 'blackmailing' Putin\nRussian state media figures are accusing US President Donald Trump of \"blackmailing\" Vladimir Putin after Trump warned Moscow of more sanctions and suggested that Ukraine could receive Tomahawk missiles from the United States.\nDuring a public event in Dushanbe last week, Putin was asked about Ukraine's threats to fire Tomahawks at Russia, including the Kremlin. He replied: \"You misspoke - and there's show-off involved too.\"\nTrump, however, seemed unconcerned by Putin's comments. Speaking to reporters, he said: \"Maybe I'll tell him, 'If this war can't be solved, I'll send them Tomahawk missiles.\"'\nIn a televised address on November 21, 2024, Putin accused the US and NATO of \"pushing the world toward a global conflict\" by allowing Ukraine to use long-range Western weapons. He said such actions proved that \"it is not Russia, but the United States, that has destroyed the international security system.\"\nOn Russian state TV, pro-Kremlin commentators mocked Trump's comments and questioned his intelligence. Political analyst Andrei Sidorchik said on the talk show One's Own Truth: \"We have to stroke the ego of a man behaving like a cowboy or an infant. His intellect is not up to par.\"\nSidorchik compared Trump to \"pocket change,\" saying he was \"simple\" and \"believes Russia can be intimidated.\" The host added that about 50% of viewers polled during the show supported launching strikes against NATO countries in response to Trump's statements.\nImage source: File\nTrump jokes he might not make it to heaven\nUS President Donald Trump has admitted he's \"not sure\" he'll make it to heaven.\nThe 79-year-old made the remark while talking to reporters about his peace efforts between Russia and Ukraine -- countries still at war since Russia's 2022 invasion.\n\"If I can save 7,000 people a week from being killed, that's something,\" Trump said. \"I want to try to get to heaven if possible. I'm being a little funny,\" he added. Then he joked, \"I don't think there's anything that's going to get me in heaven. I may already be there as we fly on Air Force One.\"\nTrump was on his way to Israel to witness the exchange of hostages and prisoners under the new ceasefire deal between Israel and Hamas. He told journalists the deal was \"much harder\" to arrange because of what he called \"mistakes\" made by former president Joe Biden.\nAfter his visit to Israel, Trump is travelling to Egypt for a summit in Sharm El-Sheikh with Egyptian president Abdel Fattah al-Sisi, UK prime minister Keir Starmer, and Palestinian president Mahmoud Abbas.\nSpeaking to the BBC aboard Air Force One, Trump said he believed the Gaza ceasefire would hold. \"Everybody is happy,\" he said. \"I think it's going to stay that way. I'm good at solving wars. I'm good at making peace.\"\nBack in August, during a Fox & Friends interview, Trump made similar comments while talking about his hopes to end the Ukraine war.\n\"If I can save 7,000 people a week, that's a good reason to get into heaven,\" he said jokingly. \"But I'm hearing I'm not doing well -- I'm at the bottom of the list.\"\nImage source: File\nTrump says Gaza war is 'over' after ceasefire deal\nHamas released 20 surviving Israeli hostages on Monday as part of a ceasefire deal that could end the two-year war in Gaza.\nUS President Donald Trump, who helped broker the agreement, said the war was \"over\" and that more peace talks would follow. In return, Israel will free almost 2,000 Palestinian prisoners.\nIn Tel Aviv, large crowds cheered, cried, and sang when news broke of the first hostages being released. Families who have waited for months hugged and celebrated, though many also mourned those who did not survive.\nThe Israeli army confirmed that the Red Cross had taken seven hostages out of Gaza first, followed by 13 more later in the day. Under the deal, Hamas will also return the bodies of 27 hostages who died in captivity and one soldier killed in 2014.\nOn October 7, 2023, Hamas fighters kidnapped 251 people during an attack on Israel that killed more than 1,200 civilians. Most of the hostages have since been released.\nIn Gaza, people also welcomed the ceasefire after two years of war that destroyed entire neighbourhoods. \"Nothing looks the same,\" said Fatima Salem, who returned to her home in Gaza City to find it in ruins. \"We will pitch a tent and wait for rebuilding.\"\nTrump arrived in Israel for meetings with the families of freed hostages and Israeli Prime Minister Benjamin Netanyahu before heading to Egypt for a summit with regional leaders. He said, \"The war is over. People are tired of it. It's been centuries.\"\nTrump's 20-point Gaza peace plan, announced in September, includes a full ceasefire, hostage exchanges, troop withdrawals, and international rebuilding of Gaza. He said he would personally lead a new international body to govern Gaza \"very soon.\"\nThe war in Gaza has killed more than 67,000 Palestinians, most of them women and children, according to health officials. Over 170,000 people have been injured. Israel's strikes continue despite Trump's request to hold fire.\nTrump said he hopes the new deal will bring \"strong, lasting peace\" to the Middle East.\nImage source: File\nWhite House furious after Trump loses Nobel Prize\nThe White House has attacked the decision to give this year's Nobel Peace Prize to Venezuelan activist María Corina Machado instead of President Donald Trump.\nTrump's communications director, Steven Cheung, said the Norwegian Nobel Committee had chosen \"politics over peace.\"\nIn a post on X, Cheung said Trump \"will continue making peace deals, ending wars, and saving lives.\" He added that Trump \"has the heart of a humanitarian\" and that \"no one can move mountains like he can.\"\nTrump's team had strongly pushed for him to win the prize, saying he deserved it for trying to end the war in Gaza and other global conflicts.\nThe Nobel nomination process ended on 31 January this year, shortly after Trump began his second term in office. Former US president Barack Obama won the prize in 2009 under similar timing.\nThe White House also sent out an automated response blaming Democrats for the ongoing government shutdown when reporters asked about the award. The message said delays in communication were because of \"the Democrat Shutdown\" and added that \"this could have been avoided.\"\nImage source: File\nTrump says hostages will be freed as Israel backs off in Gaza\nIsrael and Hamas have agreed to the first phase of a ceasefire deal in Gaza. Fighting will pause as the sides work out the details of ending the war.\nOn Truth Social, President Donald Trump announced that all hostages in Gaza will be released soon, and Israeli troops will pull back to a pre-agreed line. He said this move begins the path to what he calls \"Strong, Durable, and Everlasting Peace.\"\nHamas confirmed it agreed to Trump's proposal. The deal includes Israeli withdrawal and a prisoner swap - 48 hostages in return for Palestinian prisoners held by Israel.\nIsrael said the agreement (called \"phase one\") was signed in Egypt and will take effect once its cabinet approves it, likely within 24 hours. After that, the 20 hostages believed still alive will be released within 72 hours. Israel will also free many Palestinian prisoners, but not some senior figures like Marwan Barghouti.\nTrump predicted the hostages would \"come back\" by Monday. Netanyahu welcomed the deal as a diplomatic win and pledged Israel will continue to defend itself if Hamas breaks it.\nIn Gaza and Israel, people celebrated. In Tel Aviv, families of hostages cheered and held released hostages. In Gaza, many described the news as a hope for ending the bloodshed.\nThe war has killed over 67,000 Palestinians, most of them civilians, and injured about 170,000. Hamas's October 2023 attack on Israel killed around 1,200 people and led to the hostages.\nEven with this agreement, many obstacles remain, like how to disarm Hamas, who governs Gaza, and making sure Israel's withdrawal is real. Past ceasefires have failed quickly.\nTrump also said the US will help rebuild Gaza and work to keep the peace.\nImage source: File\nTrump shown as a demon in India festival\nIn India, artists at a Hindu festival have made a statue showing President Donald Trump as a demon being defeated by the goddess Durga.\nThe statue was displayed during the Durga Puja festival in the state of West Bengal. The festival celebrates the victory of good over evil. Each year, artists design creative versions of the goddess fighting a demon. This time, the demon was made to look like Trump.\nOrganisers said the statue represents how people feel about Trump's trade actions against India. \"India and America had good relations before,\" said organiser Sanjay Basak. \"But since Trump came, he's trying to push India down. That's why we made him the demon defeated by Durga.\"\nIn recent years, Durga Puja artists have also shown figures like Osama bin Laden and China's president Xi Jinping as villains, CNN reported.\nTrump and India's Prime Minister Narendra Modi used to appear close. They hosted big rallies together in 2019. But their relationship has cooled since Trump returned to office. He called India's economy \"dead\" and added heavy tariffs on Indian goods. He also introduced a $100,000 fee for skilled worker visas, which mainly affects Indians.\nIndia called the new tariffs unfair and said the US and Europe still trade with Russia while criticising India for buying Russian oil.\nThe organisers worked in secret for months and revealed the statue just before the festival. Once people saw it, crowds formed to take photos.\nImage source: @KantInEastt\nTrump confirms Diddy asked him for a pardon\nPresident Donald Trump confirmed on Monday that Sean \"Diddy\" Combs has asked him for a presidential pardon.\nWhile speaking with CNN's Kaitlan Collins about a possible pardon for Ghislaine Maxwell, Trump said, \"a lot of people have asked me for pardons,\" and named Combs. Combs was recently sentenced to more than four years in prison after being convicted on two counts of transporting someone for prostitution.\nIn August, one of Combs' lawyers told CNN that they had reached out to the Trump administration about the pardon. \"We've reached out and had conversations in reference to a pardon,\" attorney Nicole Westmoreland said.\nTrump had earlier said pardoning Combs would be difficult. He said he got along with Combs but that the money mogul had been hostile under certain circumstances.\nWhen asked about the pardon request, a White House official declined to comment.\nAlso on Monday, Combs' lawyers asked the judge who sentenced him to recommend that Combs be sent to a low-security federal prison in New Jersey. They argued this would help him deal with drug issues and spend more time with family while serving his sentence.\nImage source: File\nTrump pushes for fast Gaza peace deal\nUS President Donald Trump has called on negotiators to \"move fast\" in talks to free hostages held by Hamas and to end the war in Gaza. Talks are taking place in Cairo, Egypt, with hopes that a deal could be reached this week.\nThe first step of Trump's peace plan is for Hamas to release the 48 remaining hostages in exchange for Palestinian prisoners held by Israel. If the deal is accepted, it would also bring an immediate ceasefire in Gaza.\nTrump said progress was being made quickly, adding that \"the first phase should be completed this week.\" But Israel's attacks on Gaza have continued, with 63 people killed on Sunday.\nTalks in Cairo include representatives from Israel, Hamas, and the US. Israeli media reported that US envoy Steve Witkoff will join the discussions. Israel's spokesperson said the talks would last only a few days.\nUnder Trump's plan, Hamas would release all hostages within 72 hours, give up its weapons, and hand over control of Gaza to an international authority led by Trump himself. In return, Israel would start pulling back its troops and release more than 1,000 Palestinian prisoners.\nTrump shared a map of Gaza showing how far Israel would withdraw its forces. He said if Hamas agreed to those terms, a ceasefire could begin immediately.\nHamas has said it wants to reach an agreement \"as soon as possible\" to end the war. Israel's prime minister, Benjamin Netanyahu, said he would support Trump's plan but warned that Israel would continue fighting if Hamas refused to cooperate.\nWorld leaders, including Germany's chancellor, have praised the plan, calling it the \"best chance for peace.\" However, Israel has continued airstrikes despite Trump's request for restraint.\nThe war in Gaza has killed more than 67,000 people, most of them civilians, and injured about 170,000, according to Gaza's health ministry. Israel began its offensive after Hamas's deadly attack on 7 October 2023, which killed about 1,200 people.\nImage source: File\nTrump and Epstein statue put back on Washington Mall\nA statue of Donald Trump and Jeffrey Epstein was placed on the National Mall in Washington on Thursday, while the US government remained shut down.\nThe bronze statue, called \"Best Friends Forever\", shows Trump and Epstein holding hands with one leg raised in the air. A plaque at the base reads: \"In honor of friendship month, we celebrate the long-standing bond between President Donald J. Trump and his closest friend Jeffrey Epstein.\"\nThe statue first appeared last week but was removed by park police on 24 September. On Thursday it was put back in place by a group calling itself The Secret Handshake, NBC News reported.\nThe National Park Service could not comment because of the government shutdown. The White House also did not respond to requests for comment.\nTrump's deputy press secretary Abigail Jackson dismissed the statue last week, saying: \"It's not news that Epstein knew Donald Trump, because Donald Trump kicked Epstein out of his club for being a creep.\"\nThe statue comes at a time when Trump is facing questions over his past friendship with Epstein. Earlier this year, Democrats in Congress released a birthday letter Trump allegedly wrote to Epstein more than 20 years ago. The White House denied the letter was genuine.\nEpstein, a financier convicted of sex crimes, died in jail in 2019 while awaiting trial for sex trafficking. Trump once described him in 2002 as \"a terrific guy\" but later said they had a falling-out years before Epstein's arrest.\nImage source: @jdpoc\nCop caught pretending to guard Trump at Ryder Cup\nAn NYPD detective has been suspended after pretending to be part of Donald Trump's security team at the Ryder Cup in New York.\nThe officer, 46-year-old Melvin Eng, was on sick leave but showed up at the golf event in full tactical gear. He told guards he was working for Trump's security detail as the president watched the tournament with his granddaughter.\nEng managed to get past the Secret Service and state police, but his plan collapsed when he dropped a gun magazine in front of real officers. That mistake exposed him, and he was taken away.\nPolice sources said it was a serious breach: \"He got in with his gun. What if he wanted to hurt someone?\" one officer said. Others added that Eng lied, got in for free, and put Trump and the public at risk, Times of India reported.\nEng, who leads the NYPD Asian Jade Society, is now suspended without pay and faces charges for theft of service.\nTrump's presence at the event already meant tight security. Snipers were on rooftops, drones flew overhead, and fans faced long checks. Even so, Eng still managed to sneak in.\nImage source: File\nUS government shuts down after Trump standoff\nThe US government has shut down because politicians in Washington could not agree on how to pay for its day-to-day running.\nA shutdown means that some services in America stop working. Many government workers will not be paid until the shutdown ends. Soldiers, police, and air traffic controllers will still go to work, but they also won't get their salaries on time. Poor families in America will still get food support, and pension money will continue.\nThis is the first shutdown since 2018. In the past, shutdowns have ended with workers later receiving their lost pay. But this time, President Donald Trump has threatened to use the shutdown to fire workers he does not like, mostly people he says are \"Democrats\". Experts say he is not allowed to do that, but his words have scared many.\nTrump told reporters that he thinks shutdowns can be \"good\" and that he might use this one to cut jobs and stop certain programmes.\nThe fight started because Democrats wanted the budget to include money for healthcare, while Republicans wanted a \"clean\" bill without it. Both sides voted down each other's plans, and so the money to run the government ran out.\nThis is the 15th shutdown in the US since 1980. The longest one lasted 34 days when Trump was president before.\nImage source: File\nTrump tells Hamas to take peace deal or Israel will 'finish the job'\nDonald Trump and Israeli Prime Minister Benjamin Netanyahu have given Hamas an ultimatum: accept their 20-point peace plan for Gaza or face the consequences.\nThe two leaders met at the White House on Monday and later told reporters that their proposal was a \"historic breakthrough\" for the Middle East. But Hamas had not been consulted, and its response remains uncertain. According to Reuters, Hamas only received the plan later in the day through Qatari and Egyptian mediators.\nTrump made it clear Hamas did not have much of a choice. \"If Hamas rejects the deal, Israel will have my full backing to finish the job,\" he said. \"But I hope we're going to have peace.\"\nNetanyahu added to Trump's warning: \"This can be done the easy way or the hard way, but it will be done. We didn't sacrifice so many lives to let Hamas continue threatening us.\"\nThe 20-point plan includes a ceasefire, the release of all hostages in exchange for Palestinian prisoners, an Israeli withdrawal from Gaza in stages, and the disarmament of Hamas. It also proposes a temporary international governing body for Gaza, which Trump said he himself would lead as part of a \"Board of Peace\" alongside former UK prime minister Tony Blair.\n\"If accepted by Hamas, the hostages will be freed within 72 hours,\" Trump said. The plan also promises amnesty for Hamas members who renounce violence and the option of safe passage abroad.\nThe proposal includes an economic development programme for Gaza, which Trump has previously described as turning the strip into the \"Riviera of the Middle East.\"\nNetanyahu praised Trump, saying: \"This plan meets Israel's war aims. Hamas will be disarmed. Gaza will be demilitarised. Israel will retain security responsibility for the foreseeable future.\"\nA senior Hamas ally, Ziad al-Nakhala of Palestinian Islamic Jihad, said the proposal was a \"recipe to blow up the region.\"\nImage source: File\nSouth Africa and United States edge closer to new trade deal\nThere is hope that the Africa Growth and Opportunity Act (AGOA) will be extended for another two years, keeping South Africa in the deal.\nAGOA, a 25-year-old free trade agreement, gives African countries duty-free access to the US market. While it makes up only about 1% of US imports, it is a lifeline for industries in South Africa and across the continent.\nWithout AGOA, South Africa could lose 100,000 jobs in sectors like cars, wine, citrus, and nuts. Lesotho's clothing industry would also be hit hard.\nLast week, President Cyril Ramaphosa confirmed that South Africa and the US have begun detailed talks on a separate trade deal. A long draft agreement is now being studied by government officials. It includes better US access to South African markets for poultry and pork, a pledge to buy American natural gas, and US demands for changes to how South Africa applies black economic empowerment rules.\nMeanwhile, momentum is building in Washington for a last-minute AGOA extension. A staffer in the US House of Representatives and a trade expert confirmed new support for a renewal. It could be attached to another bill and passed quickly.\nThe big question is whether US President Donald Trump will back it. His Africa advisor told the Financial Times that the administration supports AGOA's goals even if it has \"issues with some details\". Observers believe the extension now depends on Trump's approval.\nIn the past, attempts to extend AGOA failed after the White House signaled it was against the idea. But Trump's team has since softened its position, and analysts say there is now strong support in Congress to keep AGOA alive.\nImage source: File\nTrump and Melania caught arguing on helicopter\nDonald and Melania Trump were seen having what looked like a serious argument while flying back to the White House on Marine One after a long day at the United Nations General Assembly in New York.\nThrough the helicopter's window, the 79-year-old president was spotted pointing at his wife as they talked face-to-face. Melania, 55, seemed to disagree with him during the exchange on Wednesday evening.\nA few minutes later, the couple stepped off the helicopter holding hands and walking across the South Lawn, giving the press a calmer picture than what had been caught through the window.\nEarlier in the day, Trump delivered an angry speech at the UN. He claimed that he and Melania were victims of \"triple sabotage\" after an escalator suddenly stopped while they were riding it.\nThe president said the incident \"could have been a disaster\" and insisted those responsible should be arrested. Press Secretary Karoline Leavitt even suggested that UN staff may have cut the power to the escalator as a prank.\nTrump described the scare in detail, saying: \"It was amazing that Melania and I didn't fall forward onto the sharp edges of these steel steps, face first. We were each holding the handrail tightly, or it would have been a disaster.\"\nThe Trumps, who married in 2005 and share one child, Barron, have often faced public scrutiny about their relationship. Melania has been spotted brushing away Trump's hand when he tries to hold hers and wearing extra-wide hats that make it hard for him to kiss her on the cheek.\nTrump has even offered marriage advice to other world leaders. Recently, after a video appeared to show French President Emmanuel Macron's wife hitting him during a heated argument before they stepped off a plane in Vietnam, Trump told Fox News: \"Make sure the door remains closed. That was not good.\"\nHe added: \"I spoke to him. He's fine. They're fine. They're two really good people. I know him very well, and I don't know what that was all about. But I know him very well, and they're fine.\"\nImage source: @WhiteHouse\nSA doctors reject Trump's autism claim\nSouth Africa's top medical bodies have strongly rejected Donald Trump's claim that paracetamol (known as Tylenol in the US) causes autism in children when taken during pregnancy.\nThe South African Society of Obstetricians and Gynaecologists (SASOG), along with two partner organisations, said on Wednesday that Trump's comments have caused unnecessary panic among pregnant women and their families.\nAfter reviewing large international studies, the groups said: \"There is no evidence that taking paracetamol at recommended doses during pregnancy causes autism.\"\nThey added that early studies suggesting a link were weak and failed to account for family or genetic factors. Stronger studies, including a massive Swedish analysis of 2.4 million births, found no connection once those factors were considered.\nThe organisations stressed that paracetamol remains the safest and most effective first choice for pain or fever in pregnancy. They confirmed it is safe at normal doses of 500-1000 mg up to four times a day, to a maximum of 4 g in 24 hours.\nThe World Health Organisation (WHO) backed the statement, saying global research shows no proven link between paracetamol and autism. WHO urged pregnant women to keep following their doctors' advice and not be swayed by unfounded claims.\nImage source: File\nTrump says Ukraine can take back their land from Russia\nDonald Trump says he believes Ukraine can win back all the land Russia has taken since the 2022 invasion.\nIn a post on Truth Social after meeting Ukrainian president Volodymyr Zelenskyy in New York, Trump wrote that Russia is in \"big economic trouble\" and Ukraine, with European support, can \"fight and WIN all of Ukraine back in its original form.\"\nTrump called Russia a \"paper tiger,\" pointing to long fuel lines inside the country. He promised to keep supplying weapons to NATO allies \"to do what they want with them.\"\nStanding with UK prime minister Keir Starmer at Chequers, Trump said, \"Russia has been fighting aimlessly for three and a half years, a war that should have taken a real military power less than a week to win.\"\nZelenskyy welcomed the comments as a \"big shift\" from Trump and said the U.S. president could even pressure China's Xi Jinping to move against Moscow.\nTrump also urged NATO countries to stop buying Russian oil, warning he would impose harsh tariffs if Europe doesn't act. He mocked NATO allies for still purchasing Russian energy, saying: \"They're funding the war against themselves.\"\nHe later suggested NATO jets should shoot down any Russian aircraft entering their airspace, before adding that it \"depends on the circumstances.\"\nImage source: File\nTrump claims painkillers in pregnancy cause autism\nDonald Trump has made a new claim about autism that many doctors say is wrong. At the White House on Monday, Trump stood next to health secretary Robert F. Kennedy Jr. and said pregnant women should avoid taking the painkiller acetaminophen - known as Tylenol in the US and paracetamol elsewhere - because it \"causes autism in children.\"\nTrump told reporters, \"Don't take Tylenol. There's no downside,\" and said he has waited \"20 years\" to share these findings. He also said vaccines like the measles-mumps-rubella shot could be delayed or given in smaller doses, even though there is no solid proof this is needed.\nKennedy added that the government will push for warning labels on Tylenol and will study a cancer drug called leucovorin as a possible autism treatment.\nHealth experts immediately criticised the claims. The Autism Science Foundation said there is no good science linking Tylenol to autism.\nA large 2024 Swedish study of more than two million births found no link between taking paracetamol during pregnancy and autism. Doctors warn that this kind of message could scare pregnant women away from safe treatments.\nMost scientists agree autism is mainly genetic. The rise in diagnoses is explained by better screening and broader definitions of the condition - not by painkillers or vaccines.\nImage source: File\nTrump says 'I hate my opponents' at Charlie Kirk memorial\nDonald Trump told a massive crowd in Arizona that he \"hates\" his political opponents while speaking at a memorial for Charlie Kirk, the right-wing youth leader killed in a campus shooting earlier this month.\nTens of thousands filled State Farm Stadium for the event, which mixed church-style revival with Trump-style politics. Kirk's widow, Erika, said she forgives the accused shooter and urged \"love for our enemies,\" but Trump struck a different tone.\nQuoting Kirk's last words about loving his opponents, Trump interrupted his own eulogy: \"That's where I disagreed with Charlie. I hate my opponents, and I don't want the best for them.\"\nThe president drifted between tribute and campaign rally, joking on stage, promoting a White House announcement on autism, and boasting about using federal forces to police US cities. He claimed Kirk once asked him to \"save Chicago from horrible crime.\"\nVice-president JD Vance called Kirk \"a martyr for the Christian faith,\" while Trump's advisers and family promised to carry on Kirk's conservative mission. Trump Jr said, \"Charlie joined a long line of courageous men and women who were murdered for what they believe.\"\nSecurity was intense, with Secret Service protection similar to a Super Bowl. A man carrying a gun and knife was detained outside the venue but was not deemed a threat.\nKirk, 31, was shot while speaking to students in Utah. Prosecutors have charged 22-year-old Tyler Robinson with capital murder and will seek the death penalty. Officials say Robinson acted alone and found no ties to left-wing groups, despite Trump's claims blaming Democrats for a culture of violence.\nImage source: File\nTrump says 'Putin has let me down' as Ukraine war drags on\nDonald Trump says Russian President Vladimir Putin has \"let him down\" by continuing the war in Ukraine, but he still believes the conflict will end.\nStanding with UK Prime Minister Keir Starmer at Chequers during his state visit, Trump said he once thought stopping the Russia-Ukraine war would be \"the easiest\" because of his personal relationship with Putin.\nInstead, he admitted, \"He's let me down. He's really let me down... we'll see how that turns out.\"\nTrump claimed he has helped end \"seven wars\" since returning to the White House, but called the Ukraine conflict \"Biden's war,\" insisting it would never have started if he had been president earlier.\nHe said millions have died and that Russian soldiers are dying faster than Ukrainians: \"The soldiers are being killed at levels nobody's seen since the Second World War. I feel I have an obligation to get it settled.\"\nDespite his disappointment in Putin, Trump predicted that \"Russia and Ukraine will get it done,\" and said he also expects a deal soon in Gaza.\nHe added that war is unpredictable: \"Things happen the opposite way you think - you thought you were going to have an easy time or a hard time and it turns out it's the reverse.\"\nTrump said he warned Ukrainian President Volodymyr Zelenskyy that the conflict could have turned into a third world war but is now confident it will not.\nImage source: File\nObama hits out at Trump over 'dangerous' talk after Kirk killing\nBarack Obama has openly taken on Donald Trump after the killing of conservative activist Charlie Kirk, warning that Trump's words are making America more dangerous.\nSpeaking at an event in Pennsylvania, the former president said political violence \"is not new\" but is \"against everything a democracy stands for.\" He said Trump's quick move to blame the \"radical left\" for Kirk's death, before police named a suspect, was reckless and divisive.\n\"There are no ifs, ands or buts about it: we must be able to debate without violence,\" Obama said. He accused Trump of using the tragedy to paint political opponents as \"vermin\" and \"enemies,\" language Obama called part of a \"broader problem.\"\nObama warned Americans to watch Trump's new security moves, like using National Guard troops in Washington and federal ID checks in Los Angeles, saying they break long-standing rules meant to protect democracy.\nAlthough Obama said he disagreed with Kirk's far-right views, he insisted the killing was a tragedy and that debate must continue \"while we respect other people's right to speak, even when we strongly disagree.\"\nImage source: File\nProtesters shine Trump and Epstein images on UK royal castle\nFour people have been arrested after images of Donald Trump with the late sex offender Jeffrey Epstein were projected onto Windsor Castle, where Trump is staying during his UK state visit.\nTrump arrived in Britain on Tuesday night for a second state visit and will meet King Charles at the castle on Wednesday. Hours before the meeting, protesters displayed a huge banner of Trump and Epstein near the castle and later projected their images, and a letter Trump allegedly wrote to Epstein, onto one of the castle's towers.\nPolice said four adults were arrested for \"malicious communications\" after the \"unauthorised projection,\" calling it a \"public stunt.\" They remain in custody.\nThe projections included the alleged birthday letter released last week by US House Democrats. The White House has denied the letter's authenticity. It shows a sketch of a naked woman and a note where Trump reportedly calls Epstein a \"pal\" and writes, \"May every day be another wonderful secret.\"\nPhotos of Epstein's victims, news clips and police reports about Epstein's crimes were also projected.\nTrump and Epstein were once friends but fell out years before Epstein's 2019 death in a Manhattan jail while awaiting trial for sex trafficking.\nImage source: @CDP1882\nZelenskyy tells Trump to take a stand on Russia or the war won't end\nUkrainian President Volodymyr Zelenskyy has urged Donald Trump to take a strong and clear stance on Russia, saying the American president holds the key to ending the war.\nIn an interview with Sky News, Zelenskyy said Ukraine needs \"defined security guarantees\" and tougher US sanctions on Moscow before any ceasefire can happen. \"We need a clear position of President Trump,\" he said. \"I believe Donald Trump can give us air defence systems in quantity and apply enough sanctions to make Putin afraid of him.\"\nZelenskyy asked UK Prime Minister Sir Keir Starmer to raise the issue during Trump's state visit to Britain this week. He added that he wants a signed document backed by the US and Europe to secure Ukraine's future before the war ends.\nThe Ukrainian leader criticised Trump's recent summit with Vladimir Putin in Alaska, saying the meeting \"gave a lot to Putin\" without enough in return. He argued that if Ukraine had been included, \"we would have some result.\"\nTrump has called on Europe to stop buying Russian oil and has floated tariffs on China to pressure Moscow, but has said he wants European nations to act first before the U.S. adds new sanctions. Zelenskyy warned that this approach lets Putin \"test NATO\" and avoid serious punishment for invading Ukraine.\nTrump arrives in the UK on Tuesday for his second state visit, which will include meetings at Windsor Castle and Chequers and a military flypast by US and British jets.\nImage source: File\nTrump says foreign workers are welcome in America\nPresident Donald Trump says skilled foreign workers are \"welcome\" in the United States, even as his administration continues a tough immigration crackdown.\nIn a Truth Social post, Trump wrote that he doesn't want to \"frighten off or disincentivize investment\" and supports letting foreign experts enter the country \"for a period of time to teach and train our people how to make these very unique and complex products.\" He listed chips, semiconductors, computers, ships, and trains as industries where the U.S. still needs outside expertise.\nTrump added, \"We welcome them, we welcome their employees, and we are willing to proudly say we will learn from them, and do even better than them at their own 'game,' sometime in the not too distant future.\"\nHis comments came 10 days after a large immigration raid at a Hyundai-LG electric vehicle battery factory in Georgia. About 475 workers, mostly South Korean nationals, were arrested for visa violations or performing work not covered by their permits.\nImages of workers chained and handcuffed made many angry in South Korea, and President Lee Jae Myung warned the raid could hurt future investment. Seoul repatriated the workers on Friday.\nSouth Korean trade unions have demanded an official apology, but the U.S. decided not to deport the arrested workers.\nImage source: File\nTrump says Charlie Kirk 'could have been president'\nDonald Trump has praised Charlie Kirk as a future president and announced he will award the conservative activist the Presidential Medal of Freedom after Kirk's death.\nKirk, 31, was a close Trump ally and co-founder of Turning Point USA. He was shot in the neck while speaking at Utah Valley University on Wednesday and died soon after.\nSpeaking Thursday at a Pentagon ceremony marking the 9/11 anniversary, Trump called the killing a \"heinous assassination\" and said: \"Charlie was a giant of his generation, a champion of liberty and an inspiration to millions. Our prayers are with his wife, Erika, and his beautiful children.\"\nCNBC host Joe Kernen said Trump phoned him about another matter but quickly began talking about Kirk. \"He's devastated,\" Kernen said. \"He told me Charlie helped him greatly in the last election and could have been president someday.\"\nTurning Point USA issued a statement mourning its founder, calling him \"a natural builder and problem solver\" with \"an overwhelming passion for life\" who refused to \"squander a single day.\"\nAfter the shooting, threats forced Hampton University and Alabama State University to cancel classes and put Virginia State University on lockdown. Capitol Police also investigated a report of an incident near the Democratic National Committee but later said it was not credible.\nVice President JD Vance, a longtime friend of Kirk, traveled to Utah to pay respects and plans to accompany Kirk's casket and his wife Erika aboard Air Force Two to Arizona.\nImage source: File\nCharlie Kirk, Trump's 'youth whisperer,' shot dead at 31\nCharlie Kirk, a major force in drawing young voters to Donald Trump, was shot and killed on Wednesday during an event at Utah Valley University. He was 31.\nThough he never held public office, Kirk became the Republican party's \"youth whisperer.\" In 2012 he co-founded Turning Point USA to push conservative, anti-woke ideas on campuses, eventually creating chapters at more than 3,000 colleges. His shows on radio, YouTube, Instagram and TikTok gave him a huge following and made him a central figure in Trump's youth strategy.\nKirk's message mixed patriotism, populism and evangelical Christianity. He often promoted false claims about the 2020 election and Covid vaccines, rejected the idea of separating church and state, and used harsh rhetoric against Islam and LGBTQ+ people. Just a day before his death he wrote on X: \"Islam is the sword the left is using to slit the throat of America.\"\nKirk was a close ally of Trump. He chaired Students for Trump in 2019, helped organise buses for the January 6 rally, and in Trump's second term advised on administration hires while serving on the Air Force Academy board. His 2024 \"You're Being Brainwashed\" tour visited 25 campuses to boost Gen Z turnout for Trump.\nRaised in suburban Chicago, Kirk turned to conservatism during the Obama years and left college after one semester to focus on activism. By his mid-twenties he was a regular speaker at Republican conventions, mixing viral campus confrontations with calls for Christian political dominance.\nKirk leaves behind a wife, Erika Frantzve, and two young children. His Turning Point network is expected to continue shaping Republican politics and Trump's outreach to young voters even after his death.\nImage source: @WhiteHouse\nScrapbook claims Trump 'bought' woman from Epstein for $22,500\nA scrapbook made for Jeffrey Epstein's 50th birthday has been released, showing a photo of him holding a check signed by Donald Trump, along with a note. The caption suggests Epstein \"sold\" Trump a woman for $22,500.\nThe photo, released by Democrats on the House oversight committee, shows Epstein with Joel Pashcow, a Mar-a-Lago member, and a woman whose face is blurred.\nThe caption, apparently written by Pashcow, says: \"Jeffrey showing early talents with money + women! Sells 'fully depreciated' [redacted] to Donald Trump for $22,500.\" It adds: \"Even though I handled the deal I didn't get any of the money on the girl!\"\nThe check is signed \"DJ Trump\" in a style different from his usual signature. The Wall Street Journal reported that the woman was someone Epstein and Trump \"socialised with\" in the 1990s. Her lawyer said she had no relationship with either man, didn't know Pashcow, and called the note a \"disgusting hoax.\"\nPashcow, linked to Epstein's flight logs, lived near Mar-a-Lago and ran a real estate firm. He also sat on the Palm Beach police and fire foundation board. In 2020, when asked about Epstein, he angrily dismissed the question.\nThe scrapbook, compiled by Epstein's associate Ghislaine Maxwell, also contains explicit drawings and contributions from figures like Bill Clinton, Alan Dershowitz, Peter Mandelson, and Les Wexner.\nTrump, once close to Epstein before a falling-out in 2004, has since called Epstein a \"dead issue.\" He has also faced years of accusations of misconduct toward women, including civil court rulings finding him liable for sexually abusing and defaming writer E. Jean Carroll.\nImage source: @SpencerHakimian\nTrump denies writing note found in Epstein files\nHouse Democrats have released a letter they say was written by Donald Trump to Jeffrey Epstein, even though Trump has strongly denied ever writing it.\nThe letter was found in Epstein's leather-bound \"birthday book,\" which was put together for his 50th birthday. It was handed over by Epstein's estate after a subpoena from the House oversight committee. Inside a drawing of a woman's body, the letter shows a made-up conversation between Trump and Epstein and appears to carry Trump's signature.\nCongressman Robert Garcia, the top Democrat on the oversight committee, said: \"The committee has secured the infamous 'Birthday Book' that contains a note from President Trump that he said did not exist. It's time for the president to tell the truth and release all the Epstein files.\"\nThe White House did not comment directly but tried to discredit the letter. Trump's deputy chief of staff Taylor Budowich posted an image of a different Trump signature and wrote on X: \"It's not his signature. DEFAMATION!\"\nTrump has said the letter is fake, but experts point out that for years Trump often signed only his first name, with a style that looks similar to the note in the book. A 1995 Trump signature closely matches the one in question.\nThe \"birthday book\" contains dozens of other sexually explicit notes and drawings, including sketches by Epstein's girlfriends and photos of animals. It also includes contributions from powerful figures such as Bill Clinton, Leon Black, Alan Dershowitz, Peter Mandelson, and Les Wexner.\nTrump has repeatedly denied writing or drawing anything in the book, saying: \"These are not my words, not the way I talk.\" He has filed a $10bn defamation lawsuit against the Wall Street Journal and its parent company News Corp over their earlier reporting.\nThe Trump administration has also shifted its position several times on whether Epstein-related files exist or should be released, with Trump once dismissing them as a \"Democrat hoax.\"\nThe House oversight committee, made up of both Democrats and Republicans, continues to investigate Epstein-related records. Epstein died in prison in 2019 while awaiting trial on sex trafficking charges.\nImage source: File\nTrump gives Hamas his 'last warning' to accept Gaza deal\nDonald Trump has given what he called his \"last warning\" to Hamas, telling the group to agree to his deal to release hostages from Gaza.\n\"The Israelis have accepted my terms. It is time for Hamas to accept as well,\" Trump wrote on his Truth Social account on Sunday. \"This is my last warning, there will not be another one!\"\nSoon after, Hamas confirmed it had received new ideas from the United States through mediators. The group said it was discussing the ideas with those mediators, but did not give details. Hamas repeated that it is ready to negotiate the release of all hostages, but only if Israel announces a clear end to the war and fully withdraws its forces from Gaza.\nSpeaking to reporters later in the day, Trump said: \"I think we're going to have a deal on Gaza very soon.\" He added that he believed all hostages would be returned, \"dead or alive.\"\nOn Saturday, Israel's N12 News reported details of Trump's new proposal. According to the report, Hamas would release all 48 remaining hostages on the first day of a truce. In return, Israel would release thousands of Palestinian prisoners from its jails. The two sides would then use the ceasefire period to negotiate an end to the war.\nAn Israeli official told N12 that the country was \"seriously considering\" Trump's proposal but did not give more information.\nImage source: File\nTrump set to call Defence Department the 'Department of War'\nDonald Trump is set to sign an executive order on Friday to rebrand the Pentagon as the \"Department of War,\" the White House has confirmed.\nThe order will let Defence Secretary Pete Hegseth call himself \"Secretary of War\" and instructs officials across government to use the new name in all communications.\nSince Trump can't formally change a federal agency name without Congress, the title will be listed as a \"secondary name.\"\nTrump has argued the rebrand shows America as tougher and more aggressive, saying the US \"had an unbelievable history of victory when it was the Department of War.\" He brushed aside questions about Congress, saying: \"We're just going to do it.\"\nThe US dropped the \"War\" title after World War II, creating the Department of Defense in 1949. Trump, however, says going back to the old name marks the 200th day of his second term and reflects his legacy.\nImage source: File\nDemocrats fear Trump could use 'crisis' excuse to cancel elections\nWhen Donald Trump met Ukraine's President Volodymyr Zelensky in August, the focus was supposed to be Russia's war. But Trump turned the talk to US politics.\nAfter Zelensky explained that Ukrainian law bans elections during wartime, Trump joked: \"So if we're in a war, no more elections? Oh, that's good.\" The room laughed, but Democrats back home weren't laughing.\nSeveral leading Democrats now say Trump might try to cancel or control elections to stay in power.\nIllinois Governor JB Pritzker said Trump's use of federal troops in cities is part of a plan to interfere in voting. He compared it to how Adolf Hitler quickly turned Germany into a dictatorship.\nCalifornia Governor Gavin Newsom agreed, saying Trump doesn't even want another election. He warned Trump is building up ICE like his \"private police force\" that could be sent to polling stations.\nOther Democrats, including New York congresswoman Yvette Clarke and Philadelphia prosecutor Larry Krasner, also warned Trump could manufacture a \"crisis\" to shut down elections, CNN reported.\nTrump has often tested the limits of democracy. He tried to overturn the 2020 election, suggested delaying that year's vote, and has openly joked about serving a third term. He also wants to end mail-in voting and voting machines, even though he doesn't have the legal power.\nImage source: File\nTrump calls death talk \"fake news\" after quiet weekend\nDonald Trump has brushed off fresh rumours about his health, saying he spent the Labor Day weekend giving interviews and visiting his Virginia golf course.\n\"I was very active over the weekend,\" the 79-year-old president told reporters in the Oval Office on Tuesday. Asked about social media chatter that he had died, he dismissed it as \"fake news.\"\nTrump complained that the speculation started only because he did not hold public events for two days. \"It's so fake. 'Is he OK, how's he feeling, what's wrong?\"' he said.\nOver the weekend, posts on X claimed something was wrong because Trump had no public schedule. The talk grew after Vice President JD Vance told USA Today that Trump was \"in good shape\" but added he was ready to step in if needed.\nImage source: File\nTrump changes White House lights after camera makes him look bad\nDonald Trump has upgraded the lights in the Cabinet Room after reportedly complaining that the old setup made him look bad on camera.\nAccording to Politico, the president was unhappy with footage from a recent meeting where his hair appeared to glow oddly under the lights. Journalists and social media users mocked the \"strange\" look, and soon after, the fixtures were replaced.\nThe change is part of a wave of redecorations and building projects Trump has launched in his second term. The Cabinet Room and Oval Office are now filled with gold touches, and plans are in motion for a $200-million ballroom at the White House, due to open in 2028.\nAn unnamed aide said: \"He seems to wake up and say, 'What else needs to be improved?' Every day, it's something new.\"\nThe president has also suggested rebranding a golf course on the Potomac and promised to \"beautify Washington, D.C. in 12 months.\"\nSupporters in the White House say Trump is \"a builder at heart,\" while critics see the endless renovations as vanity projects. Either way, his quest for a \"golden age\" of America is now shining, literally.\nImage source: File\nTrump says he's 'never felt better' after death rumours\nRumours that Donald Trump had died spread quickly online last week after the US president was not seen in public for several days. His diary was empty, and people began to wonder if something was wrong.\nThese rumours followed weeks of talk about Trump's health, after bruises were seen on his hands and he appeared thinner in recent photos.\nOn Saturday, the gossip cooled down when photographers spotted Trump leaving the White House with his grandchildren to go play golf. But some people on social media claimed the man in the pictures was not really Trump, but a lookalike or body double.\nOn Sunday night, Trump posted on Truth Social: \"NEVER FELT BETTER IN MY LIFE.\" He also bragged that Washington, D.C. was now a \"crime free zone.\"\nDoctors say Trump has a condition called chronic venous insufficiency, which affects blood flow in the veins and can cause swelling and bruising. They say it is not life-threatening and that he is still in \"excellent health,\" though if it gets worse, it could be serious.\nEven so, the rumours keep spreading online, with conspiracy theorists zooming in on photos and questioning whether the man seen at the golf course was really the president.\nImage source: File\nSouth Park puts Trump \"in bed with the devil\"\nThe hit cartoon South Park has once again taken aim at Donald Trump, and this time, it may have found a legal loophole to keep the president from suing.\nIn the season opener, Trump is shown as an insecure leader who ends up in bed with the devil. The episode pokes fun at his character, showing him as needy and desperate for approval.\nLegal experts say this is part of a strategy often called the \"small-penis rule\": make the parody so exaggerated and silly that any lawsuit would only make the real person look worse.\nIf Trump sued, he'd have to argue that the cartoon version was close enough to reality.\nTrump has been busy suing media outlets, but creators Trey Parker and Matt Stone have a long history of mocking political figures. US law protects parody, and public figures like Trump face a high bar in court.\nThe White House dismissed the show as a \"fourth-rate production\" clinging to attention. At Comic-Con, Parker responded with a straight face: \"We're terribly sorry.\"\nImage source: File\nCalifornia governor warns Trump is serious about running for third term\nCalifornia governor Gavin Newsom has warned that Donald Trump is serious about trying to run for a third term as US president, even though the constitution only allows two.\nSpeaking at a Politico event in Sacramento on Wednesday, Newsom said: \"I don't think Donald Trump wants another election. This guy doesn't believe in free, fair elections. Wake up.\"\nNewsom said Trump's supporters had even sent him \"Trump 2028\" hats. He argued Trump's actions show he plans to stay in power, pointing to the president's plan for a $200m gold-trimmed ballroom at the White House. \"Who spends that and then leaves the house?\"\nThe governor also revealed that during a February Oval Office meeting, Trump spoke about Franklin D Roosevelt, the only president to serve more than two terms. \"And then he went on and on about the third term,\" Newsom said.\nTrump has previously hinted he could try to get around the 22nd amendment, which doesn't allow a third term, but has also given mixed answers when asked if he will run again.\nNewsom said Democrats must \"fight fire with fire\" and take Trump's threats seriously. \"We're losing this country in real time,\" he warned. \"This is not an exaggeration.\"\nImage source: File\nTrump says Gaza war should end in 'two to three weeks'\nDonald Trump says the war in Gaza should end soon. He told reporters on Monday: \"I think within the next two to three weeks, you're going to have a pretty good, conclusive ending.\"\nHis comments come as the world reacts with anger to the killings of civilians, journalists and medics, and to famine in Gaza caused by Israel's blockade.\nTrump has made promises before that the war would end, but so far there has been no ceasefire and very little aid has reached Palestinians. Instead, his administration has given Israel billions of dollars in weapons and blocked global attempts to recognise a Palestinian state.\nTrump said: \"It's got to get over with because between hunger and worse than hunger, death, pure death, people are being killed.\"\nEarlier this year, Trump suggested moving all Palestinians out of Gaza, something critics say would be ethnic cleansing.\nOn Monday, Trump seemed unaware that Israel had just bombed Nasser Hospital, killing 21 people, including five journalists. Asked about it, he said: \"I'm not happy about it ... at the same time, we have to end that whole nightmare.\"\nHe then turned to talking about efforts to release Israeli captives in Gaza.\nImage source: File\nTrump caught hiding hand bruises with makeup\nDonald Trump has been seen with heavy makeup on his right hand in Washington, leading people to believe he was trying to hide a bruise.\nAt a World Cup event in the Oval Office on Friday, Trump kept his right hand turned away from the cameras or covered it with his left hand. Online, people said the makeup looked obvious and mismatched with his skin, making the bruise stand out even more.\nOn Sunday, Trump was seen with another bruise on his left hand while at his golf club in Virginia.\nThis is not the first time the 79-year-old president has been seen with marks on his hands. Last month, the White House confirmed Trump has chronic venous insufficiency, a vein condition that causes swelling and bruising.\nWhite House doctor Captain Sean Barbabella said the condition is \"benign and common,\" adding that Trump remains \"in excellent health.\" He explained the bruises could be from aspirin use and frequent handshakes.\nBut many people online are not convinced. Social media users said Trump looked thinner and weaker, with one writing: \"He looks sick as hell ... I think his heart might be failing.\" Others suggested the marks could come from IV drips or blood tests.\nThe White House has dismissed those claims, saying Trump has no signs of heart failure, kidney disease or any other serious illness.\nImage source: @Terror_Alarm\nTrump accused of using Africa as a \"dumping ground\"\nActivists have accused President Donald Trump of turning African countries into a \"dumping ground\" after five convicted criminals were deported to Eswatini.\nThe July 16 deportation flight carried men from Vietnam, Jamaica, Laos, Cuba and Yemen, all convicted in the US of crimes including child rape, murder and robbery. Their home countries had refused to take them back.\nEswatini is the second African country to receive Trump's deportees this month. Washington also sent eight others, described as \"uniquely barbaric monsters,\" to war-torn South Sudan.\nTrump's \"third country\" plan follows a Supreme Court ruling allowing deportations to unrelated nations. Critics say the policy tramples human rights.\nWandile Dludlu, deputy president of opposition group PUDEMO, said the US sees Eswatini \"as a criminal dumpsite.\" He warned the country's overcrowded prisons, already at 170% capacity, cannot cope.\nThe Eswatini government insists the men pose \"no security threat\" and will be kept in isolated units. It says it will work with the US and UN agencies on their eventual repatriation.\nCivil society groups are threatening legal action, arguing the deportations violate Eswatini's own laws.\nTrump has also discussed similar deportation deals with Liberia, Senegal, Rwanda and others. Critics say smaller African nations are being pressured into accepting unwanted criminals in exchange for US favour.\nImage source: File\nTrump bans new solar and wind projects\nPresident Donald Trump said his administration will not approve any new solar or wind power projects, even as parts of the US struggle to keep up with rising electricity demand.\n\"We will not approve wind or farmer-destroying Solar. The days of stupidity are over in the USA!\" Trump wrote on Truth Social.\nThe move comes after the White House last month handed all renewable permits to the Interior Secretary's office.\nTrump blames renewables for higher power prices, pointing to the PJM Interconnection grid, where costs jumped 22% in the latest auction as coal plants closed and demand surged from data centers.\nBut experts say solar and batteries are the fastest way to fill the supply gap, and they already make up most of the projects lined up to join the grid.\nSince taking office, Trump has rolled back tax credits for solar and wind, slapped tariffs on steel and copper, and pushed the Department of Agriculture to stop supporting solar farms. His \"One Big Beautiful Bill Act\" ends wind and solar subsidies completely by 2027.\nImage source: File\nTrump calls himself and Netanyahu \"war heroes\" after Iran strike\nDonald Trump has declared that both he and Israeli Prime Minister Benjamin Netanyahu are \"war heroes\" after US airstrikes destroyed three Iranian nuclear sites in June.\nIn a radio interview on The Mark Levin Show, Trump praised Netanyahu: \"Bibi is a good man. He's fighting. They're trying to put him in jail on top of everything else. He's a war hero ... I guess I am, too.\"\nThe International Criminal Court has issued an arrest warrant for Netanyahu, accusing him of war crimes in Gaza.\nTrump, who has never fought in a war, boasted about the secret attack on Iran - dubbed Operation Midnight Hammer - where US B-2 bombers dropped 30,000-pound \"bunker busters\" on Tehran's underground facilities.\n\"It was an obliteration,\" Trump said, adding he had personally rewarded the pilots in the Oval Office.\nThe Pentagon originally assessed the strike only set back Iran's nuclear program by a few months, but Trump insists it crippled Tehran's capabilities for years.\nImage source: File\nTrump says 'no boots on the ground' in Ukraine peace deal\nDonald Trump says the US will not send troops to Ukraine under any peace deal with Vladimir Putin but hinted America may provide air power to help enforce an agreement.\nSpeaking on Fox News, Trump told listeners: \"You have my assurance - no US boots on the ground.\" But he added Washington was \"willing to help by air.\"\nThe White House said both Putin and Ukraine's Volodymyr Zelenskyy had shown interest in meeting soon. Hungary and Switzerland have offered to host, while France suggested Geneva.\nNato's chief, Mark Rutte, called Trump's promise of security guarantees a \"significant breakthrough.\" Zelenskyy also welcomed the move, calling guarantees a \"key issue\" in ending the war.\nBut doubts remain. Moscow has rejected any Nato troops in Ukraine. European leaders are scrambling to push Trump into a tougher line with Putin after their friendly Alaska summit.\nPutin wants Ukraine to withdraw from occupied regions, while Zelenskyy insists no land can be ceded.\nImage source: File\nTrump says Putin agreed to meet Zelensky face-to-face\nVladimir Putin has agreed to meet Ukraine's President Volodymyr Zelensky in person to discuss ending the war, Donald Trump announced Monday - though Russia hasn't confirmed it yet.\n\"I called President Putin, and began arrangements for a meeting between President Putin and President Zelensky,\" Trump wrote on Truth Social after tense White House talks. He said a three-way meeting with himself would follow.\nGermany's leader Friedrich Merz seemed to confirm it: \"The American president agreed there would be a meeting within the next two weeks.\" But he warned Putin might not show up.\nRussia only said Putin was open to the \"idea\" of talks.\nLast week, Trump threatened Putin with \"very severe consequences.\" Now he's completely flipped, saying no ceasefire is needed.\n\"I don't think you'd need a ceasefire,\" Trump said. \"If you look at the six deals I settled this year - I didn't do any ceasefires.\"\nTrump promised America would help protect Ukraine, but Europe would do most of the work. Zelensky offered to buy $90-billion worth of US weapons - mainly planes and air defense systems.\nEuropean leaders still want a ceasefire first, especially after 10 people died in Russian attacks Monday, including a toddler.\nThis White House visit went much better than Zelensky's last one, when Trump and VP JD Vance criticised him. This time there were even jokes about clothing.\nTrump said any peace would be long-term, not temporary.\nImage source: @WhiteHouse\nPutin agrees to Ukraine peace deal with security promises\nVladimir Putin has reportedly agreed to a huge peace deal that would give Ukraine strong new protection from America and Europe, according to Donald Trump's top negotiator Steve Witkoff.\nRussia has apparently offered to give up some of the five Ukrainian areas it stole - Donetsk, Luhansk, Kherson, Zaporizhzhia and Crimea. Sources say Putin might keep just Donetsk and Luhansk while stopping his push into southern Ukraine.\nWitkoff said: \"We agreed to strong security promises that I would call game-changing. The US could offer Article 5-style protection - one of the main reasons Ukraine wants NATO membership. We covered almost all the other issues needed for a peace deal.\"\nArticle 5 means if someone attacks you, all your allies fight back - it's NATO's strongest protection.\nThis news comes before crucial talks in Washington between Ukraine's President Zelensky and Trump. Britain's Prime Minister Keir Starmer and many European leaders are flying in to show support for Ukraine.\nStarmer will stand with Zelensky at the White House. Other big names coming include EU chief Ursula von der Leyen, France's Emmanuel Macron, Germany's Friedrich Merz, and NATO boss Mark Rutte.\nSources say Zelensky begged Europe's top leaders to come with him for \"moral support\" before his big meeting with Trump.\nThis is Zelensky's first time back in the Oval Office since Trump and VP JD Vance kicked him out earlier this year during a heated argument.\nPutin's deal reportedly goes beyond Ukraine. Moscow would promise not to attack other European countries.\nIn return, Ukraine would:\n- Give up trying to join NATO\n- Officially say Crimea belongs to Russia\n- Agree to trade some territory in Donetsk and Luhansk\nImage source: @WhiteHouse\nTrump warns Putin to make peace or face 'very severe' punishment\nDonald Trump warned Wednesday that Vladimir Putin will face \"very severe consequences\" if he doesn't agree to stop the Ukraine war at their big meeting in Alaska on Friday.\nTrump will meet Putin at a military base in Anchorage - the same place America used to watch the Soviet Union during the Cold War. If that goes well, Trump wants a second meeting right away with both Putin and Ukraine's President Zelenskyy.\n\"If the first one goes OK, we'll have a quick second one,\" Trump told reporters. \"I would like to do it almost immediately.\"\nEuropean leaders had an emergency video call with Trump and his VP JD Vance before the Putin meeting. They're worried Trump might give away too much to get a deal.\nBritain, France, and Germany told Trump he can't let Putin keep any Ukrainian land and that Ukraine must be protected. Trump seemed to agree, promising this Alaska meeting is just a \"feel-out\" to test what Putin wants.\nUkraine's Zelenskyy has said his military won't give up territory. But Russia wants to keep at least four Ukrainian regions - either through talks or by force.\nEarlier Wednesday, Trump got angry at news coverage, writing on Truth Social: \"The media is being really, really unfair about my meeting with Putin. We win EVERYTHING.\"\nTrump wants to end the war quickly to keep his campaign promise. Europe wants to make sure Ukraine doesn't get screwed. Putin wants to keep the land Russia has taken. Something's got to give on Friday.\nImage source: File\nSouth Africa slams US report saying it treats people badly\nSouth Africa is upset at a harsh report by the US State Department that said the country badly treats its people, calling it \"wrong and unfair.\"\nThe US said South Africa got much worse at protecting people's rights last year. This happened especially after President Cyril Ramaphosa signed a new law about taking land in December.\nThe Americans said South Africa:\n- Is trying to take land away from white farmers\n- Lets police kill and arrest people for no good reason\n- Doesn't punish government workers who hurt people\n- Allows hate speech against white people\nGovernment spokesman Chrispin Phiri said South Africa was very upset with the report. He said it got the facts wrong.\n\"The report doesn't show what our country is really like,\" Phiri said. He said America used bad information and lies.\nPhiri said the US wrongly called some farm worker deaths \"murders by police\" even though the courts are still deciding what happened. He said the report ignored that South Africa has proper ways to investigate police.\nPhiri attacked America right back. He said the US left an important UN group that watches human rights, so America \"doesn't want anyone checking up on them.\"\nHe also pointed out America's own problems, like how it treats refugees and people trying to cross the border.\nPhiri said the United Nations recently said South Africa's new land law was good for fixing unfair land ownership - the opposite of what America claimed.\nThis fight comes as President Trump has been putting higher tariffs on South African goods and threatening more punishment. The harsh human rights report adds to tensions between Trump's America and South Africa.\nSouth Africa will release papers this week to prove the US report is wrong. The government says it will talk to America about the problems.\nImage source: File\nTrump says he's \"going to Russia\" when Putin meeting is actually in Alaska\nDonald Trump got mocked online after accidentally saying he was going to Russia to meet Vladimir Putin - when the meeting is actually happening in Alaska.\nDuring a crime press conference at the White House, Trump said: \"I'm going to Russia on Friday. I don't like being up here, talking about how unsafe and dirty and disgusting this once beautiful capital was.\"\nBut the Putin meeting is set for Alaska, not Russia.\nThe clip quickly went viral on X, with users having a field day:\n\"Wait, did he give Alaska back to Putin already?\" one person asked.\n\"Has the Trump administration just announced they've ceded Alaska to Russia?\" another wondered.\n\"You're embarrassing our country,\" someone else wrote.\nRussian nationalists have long wanted Alaska back - Russia sold it to the US in 1867 for several million dollars. Putin has been pressured over the years to reclaim it, but he's never shown interest.\nThe Alaska meeting is significant because it's Putin's first time on American soil in 10 years, and it's happening on land that used to be Russian territory.\nThe two leaders plan to discuss the Ukraine war, hoping to reach some kind of ceasefire deal. But Ukraine's President Volodymyr Zelensky wasn't invited to the Alaska meeting.\nTrump's mistake happened during his ongoing attacks on Washington DC crime rates. He's been claiming teenage gang members are running wild, even though violent crime in DC is at a 30-year low.\n\"Crime in Washington, D.C., is totally out of control,\" Trump posted on Truth Social, demanding tougher laws to prosecute minors as adults starting at age 14.\nHe also wants homeless people removed from the capital \"IMMEDIATELY.\"\nImage source: File\nTrump wants homeless gone from Washington after seeing tents on golf trip\nDonald Trump demanded on Sunday that homeless people leave Washington DC \"IMMEDIATELY\" and threatened to jail criminals - even though violent crime in the capital is at its lowest point in 30 years.\n\"The Homeless have to move out, IMMEDIATELY,\" Trump wrote on Truth Social while heading to his golf club. \"We will give you places to stay, but FAR from the Capital.\"\nTrump posted four photos apparently taken from his motorcade on the way to golf. They showed 10 tents along a highway, one person sleeping on building steps, and some roadside litter near the Kennedy Center.\nHe promised a Monday news conference that would \"essentially stop violent crime\" in DC without explaining how. He later said it would also be about \"cleanliness.\"\nAbout 800 people sleep outside on any given night in the city of 700,000. Another 3,275 use emergency shelters, and 1,065 are in temporary housing, The Guardian reported.\nViolent crime in DC dropped 35% in 2024 and hit a 30-year low. This year, it's down another 26%.\n\"We are not experiencing a crime spike,\" DC Mayor Muriel Bowser told MSNBC Sunday. \"We have spent two years driving down violent crime to a 30-year low.\"\nTrump wants to send federal officers and possibly the National Guard to patrol DC streets, even though federal law enforcement already works with city police.\nThe White House won't say what legal power Trump has to kick people out of DC. He only controls federal land and buildings, not the whole city.\nTrump's lawyers are \"studying\" whether to overturn the 1973 law that lets DC residents govern themselves instead of being controlled directly by the federal government.\nDC's congressional representative Eleanor Holmes Norton called Trump's comments \"misguided and offensive\" to the 700,000 people who live in the capital.\n\"DC residents, a majority of whom are Black and brown, are worthy and capable of governing themselves,\" she said.\nImage source: File\nTrump ready to talk to Putin without Ukraine\nDonald Trump says he is ready to meet Vladimir Putin - even though the Russian leader refuses to meet Ukraine's president, Volodymyr Zelenskyy.\nSpeaking in the Oval Office, Trump said Putin doesn't have to meet Zelenskyy first. \"They want to meet with me, and I'll do whatever I can to stop the killing,\" he said.\nThis clashes with a report claiming Trump would only meet Putin if he sat down with Zelenskyy, something Putin has rejected.\nThe US and Russia keep giving different stories, adding to confusion over whether a summit will happen.\nPutin says the \"right conditions\" for talks with Zelenskyy aren't there yet. Kremlin officials say they are preparing a Trump-Putin meeting, possibly in the UAE, but deny plans for a three-way summit.\nKyiv and European leaders fear Trump and Putin could strike a deal without Ukraine in the room. Zelenskyy says talks work best when leaders are involved and has been speaking with Germany and France to form a united European position.\nTrump has recently criticised Russian attacks on civilians and threatened new sanctions if progress isn't made. The White House says sanctions are still coming.\nIf the summit goes ahead, it would be the first meeting between a US and Russian president since 2021.\nImage source: File\nTrump could meet Putin next week to end Ukraine war\nDonald Trump could sit down with Vladimir Putin as soon as next week to try ending the Ukraine war, White House officials said Wednesday.\n\"There's a good chance that there will be a meeting very soon,\" Trump told reporters when asked about meeting with Ukraine and Russia's leaders.\nAccording to reports, Trump wants to meet Putin first, then have a three-way meeting with Putin and Ukraine's President Volodymyr Zelenskyy. It would be the first US-Russia leader meeting since 2021.\nThis comes after Trump's special guy, Steve Witkoff, spent three hours talking with Putin at the Kremlin on Wednesday. Trump claimed \"great progress was made\" in those talks.\nSecretary of State Marco Rubio warned not to get too excited. Many \"impediments\" to peace remain, especially over which territory Russia gets to keep. There's no actual ceasefire plan on the table yet.\n\"What we have is a better understanding of what Russia wants,\" Rubio said. Now they need to see \"what Ukraine is willing to accept.\"\nThis all happens just before Trump's Friday deadline for Russia to make peace or face new punishments. Trump has already hit India with 25% tariffs for buying Russian oil, and more countries could get punished Friday.\nAfter Trump called him Wednesday night, Zelenskyy said: \"The war has to end, and it has to be a just ending. Ukraine has to defend its independence.\"\nPutin hasn't shown he's ready to give up his main war goals yet. But there are rumors Russia might offer to stop long-range attacks from both sides.\nTrump's Ukraine envoy is heading to Kyiv soon for more talks.\nImage source: File\nTrump says he 'probably won't' run for third term\nPresident Donald Trump said Tuesday he would \"probably not\" run for a third term, but didn't completely rule it out.\n\"I'd like to run,\" Trump told CNBC's Squawk Box. \"I have the best poll numbers I've ever had.\"\nThe problem? The Constitution's 22nd Amendment clearly says no one can be elected president more than twice - even if the terms aren't back-to-back like Trump's.\nBut Trump and his allies keep talking about ways around this rule. Some ideas include getting rid of the amendment completely or having Trump run as vice president, then taking over as president.\nBack in March, Trump told NBC there \"are methods\" for him to become president again if he wanted to. He's repeatedly refused to promise he won't try for a third term.\nTrump's team says he's \"focused on undoing all the hurt Biden has caused\" right now and it's \"far too early\" to think about 2028.\nTrump's official store is already selling \"Trump 2028\" merchandise. One hat promises to help buyers \"rewrite the rules.\"\nSo while Trump says he \"probably won't\" run again, he's clearly not closing that door completely - Constitution or no Constitution.\nImage source: File\nTrump and Putin head for crash over Ukraine war\nAre Donald Trump and Vladimir Putin about to have a massive fight? A popular Russian newspaper thinks so, saying \"a head-on collision seems unavoidable\" between the two leaders.\nHere's what's happening: Putin keeps fighting his war in Ukraine. Trump keeps cranking up the pressure - setting deadlines, threatening punishments, and moving nuclear submarines closer to Russia.\nWhen Trump first came back to power, things looked cozy. The US even sided with Russia at the United Nations in February. Trump and Putin talked about visiting each other's countries, and Trump's envoy made four trips to Moscow in two months. Putin even gave him a portrait of Trump.\nBut Trump wanted Putin to stop fighting in Ukraine completely. Putin, who thinks Russia is winning, wasn't interested.\nSo Trump got fed up, calling Russia's attacks \"disgusting\" and accusing Putin of talking \"bullshit\" about Ukraine. Last month, Trump gave Putin 10 days to end the war or face more punishment. That deadline runs out this week.\nTrump's envoy is heading back to Russia this week for more talks. Some experts think\nTrump might offer Russia sweet deals if they agree to peace.\nThe problem is Putin still wants everything: Ukrainian territory, Ukraine to stay neutral, and limits on Ukraine's army.\nTrump wants a deal but Putin wants victory.\nImage source: File\nTrump's tariff forces South Africa to find new markets\nSouth Africa is scrambling to find new customers in Africa and Asia after the US slapped it with 30% trade tariffs starting August 7.\nPresident Cyril Ramaphosa said Monday the country won't give up on talks with America, but it's also looking elsewhere fast. The US is South Africa's second-biggest trading partner, and these tariffs could kill 100,000 jobs in a country where unemployment is already over 30%.\n\"Our top priority is protecting our export industries,\" Ramaphosa wrote in his weekly newsletter. South Africa will keep trying to save its US market access while \"accelerating\" the hunt for new buyers, especially in Africa.\nThe 30% tariff is the highest hitting any country south of the Sahara. It comes as US-South Africa relations have gone downhill over various policy disagreements.\nTo try avoiding these punishing tariffs, South Africa has offered to buy US natural gas and farm products, plus invest more in mining and metals recycling.\nThe tariffs will especially hurt South Africa's farms, car makers, and textile companies - industries that Pretoria says don't compete with US businesses but actually support them.\nMeanwhile, the US hit several other African countries with 15% tariffs, including tiny Lesotho, which had originally faced threats of 50% tariffs.\nImage source: File\nSouth Africa fails to reach trade deal with US\nSouth Africans woke up to the bad news on Friday that US tariffs on local goods have gone up to 30%.\nThe White House confirmed on Thursday that South Africa's new \"reciprocal\" tariff rate will take effect in seven days. This comes after months of tense trade talks, and no deal.\nUnder previous agreements like AGOA, SA goods entered the US duty-free. But now, products like cars and citrus will cost a lot more in the American market, making them harder to sell.\nThe Trump administration says SA failed to meet the deadline to strike a trade deal. In May, the US rejected South Africa's first offer. A second, sweeter offer, including natural gas imports, steel quotas, and R60-billion in investment, was also ignored.\nPresident Trump has slapped similar tariffs on 70 other countries. Lesotho was spared (cut to 15%), but others like Canada and Switzerland got hit hard too.\nIn July, Trump warned President Ramaphosa of the looming 30% tariff. Now it's here.\nImage source: File\nTrump falls asleep during major health launch\nPresident Donald Trump looked like he was falling asleep during a major health announcement at the White House.\nDuring a televised event on Wednesday, Trump struggled to stay awake while his health boss, Dr. Mehmet Oz, explained how the US government plans to upgrade the healthcare system using tech, apps, and artificial intelligence.\nAs Oz spoke about diabetes, weight-loss plans, and using QR codes to manage prescriptions, Trump kept blinking slowly and closing his eyes. He looked like he wasn't following a word.\nThe video quickly went viral. \"Trump is fighting for his life to stay awake,\" joked one journalist on X. Another user wrote: \"Was he up all night golfing?\"\nBut the sleepy moment came during a big shift: Americans will soon be asked to move their health records to private platforms linked to companies like Google, Amazon and Noom. These apps will read lab results, track medical progress, and even suggest diets using AI.\nOfficials say the data will stay private and only be shared with permission.\nTrump didn't respond to questions at the end.\nImage source: File\nSouth Africa offers cash, gas, chickens but Trump won't budge\nSouth Africa is running out of time to stop massive US tariffs, despite offering billions in trade and investment.\nWith just days to go before a 30% tax hits SA exports to the US, government officials say they're still waiting for real feedback from Washington.\nSouth Africa has put a major deal on the table, including nearly R60-billion in local investment into US industries like mining and recycling, a 10-year gas import agreement, and easier access for US poultry and blueberries into the SA market. In return, it's asking the US to scrap harsh tariffs on sectors like agriculture, shipping, and small business exports.\nBut the US hasn't responded, and the deadline is Friday.\nIf nothing changes, South African exports will take a big hit. Already, car and steel exports have dropped by 30%. Citrus farmers warn their fruit could go unsold, News24 reported.\nTalks hit a wall over Black Economic Empowerment (BEE), which some US officials oppose.\nTrade Minister Parks Tau says SA has \"put its best foot forward,\" and a crisis plan is now being prepared.\nOnly five countries have made deals with the US so far. South Africa says it's ready, but the clock is ticking.\nImage source: File\nTrump turns on Israel over Gaza starvation\nDonald Trump has told Israel to open the gates and \"let every ounce of food\" into Gaza, admitting for the first time there is \"real starvation\" in the region.\nThe US president made the comment during a messy 70-minute press conference at his Scottish golf course, where he met UK Prime Minister Keir Starmer. Trump directly contradicted Israeli PM Benjamin Netanyahu, who called reports of starvation \"a bold-faced lie\".\nTrump replied: \"Look at the kids. That's real starvation. You can't fake that.\"\nHe said Israel must do more to let aid through, while blaming Hamas for not releasing hostages. He also claimed the US and allies would set up \"walk-in food centres\", but gave no details.\nMeanwhile, Trump said he was losing patience with Putin and gave Russia 10-12 days to agree to a Ukraine ceasefire before new sanctions kick in.\nHe praised Starmer but told him to \"cut taxes\" and \"get tough on immigration\" if he wants to win the next UK election -comments likely to annoy Downing Street.\nOutside Trump's golf course, protesters waved Palestinian flags and called him a bully. One said, \"If it was my grandchildren starving, I'd want people to speak up too.\"\nImage source: File\nTrump's caddie drops the ball - literally\nDonald Trump was caught in a cheeky golf moment during his visit to Scotland, and social media isn't letting it slide.\nA video shot from a nearby building shows Trump arriving at his Turnberry golf course in a cart. As he pulls up near a tricky spot on the fairway, one of his caddies walks ahead and drops a ball on the grass. A few seconds later, Trump steps out with his club and strolls straight toward it.\n\"Who needs talent when you've got a personal ball-dropper?\" joked one X user. Another wrote, \"Him and Kim Jong Un would be an unstoppable team.\"\nThe video popped up just hours after Trump met with European Commission head Ursula von der Leyen at the same course. Together, they announced a massive $1.35-trillion trade deal between the US and EU.\nTurns out, a sneaky golf ball placement gets more clicks than global economics.\nImage source: File\nTrump named in Epstein files but White House says it's \"fake news\"\nThe White House is denying reports that President Donald Trump was told in May that his name appears in files linked to Jeffrey Epstein.\nThe Wall Street Journal says Attorney General Pam Bondi briefed Trump, telling him the documents included hundreds of names, including his, but that it didn't mean he did anything wrong. Trump later said he was never told.\nA White House spokesperson called it \"fake news,\" while Trump's team blamed \"criminal leakers and the liberal media.\"\nTrump had promised to release Epstein-related files during his campaign, but supporters are now angry that no \"client list\" has come out. The FBI says no such list exists.\nA judge this week refused to release grand jury records from Epstein's 2006 Florida case, saying it would break secrecy laws. Meanwhile, Congress is trying to force the justice department to hand over files, and to make Ghislaine Maxwell testify from prison.\nMaxwell, jailed for helping Epstein traffic underage girls, says she'll decide after a meeting with the justice department.\nDemocrats say the Trump team is covering up. Even some Republicans are joining efforts to get the files released.\nTrump once called Epstein a \"friend\" but says they fell out in 2004.\nImage source: File\nTrump wants to punish South Africa over links to Russia\nA US committee just passed a Bill that could worsen America's relationship with South Africa. The \"US-South Africa Bilateral Relations Review Act of 2025\" calls for a full review of ties between the two countries, and possible sanctions on top ANC and government officials.\nThe Bill passed by 34 to 16, mostly supported by Republicans, and now heads to the full House. If it becomes law, the Trump administration must look at whether SA has harmed US interests, and name any leaders guilty of corruption or human rights abuse for possible US travel bans.\nThe Bill says South Africa is close to America's enemies, Russia, China, Iran, and even Hamas. It also slams SA for accusing Israel of genocide and pushing anti-Taiwan policies.\nThe Bill's sponsor, Republican Ronny Jackson, has strong links to pro-Israel donors. But top Democrat Gregory Meeks called the Bill \"heavy-handed\" and said it would hurt long-standing US-SA ties.\nSouth Africa's foreign minister said diplomacy is the way forward, and denied any anti-white violence. The ANC says the Bill is politically motivated and ignores decades of shared struggle and partnership.\nImage source: File\nTrump wants minerals from Africa and a place to send migrants\nUS President Donald Trump met five African leaders at the White House last week. It was a surprise, since Trump doesn't usually focus on Africa. The countries he chose. Senegal, Mauritania, Guinea-Bissau, Liberia, and Gabon, all have oil, gas, and rare minerals.\nTrump said the US wants to move from giving aid to doing trade. He even shut down the US aid agency, USAID.\nBut trade wasn't the only thing on the table. Trump asked the leaders to help with immigration by taking in people the US wants to deport, including asylum seekers and criminals, while their cases are still being processed.\nThe leaders talked up their mineral wealth. Trump, not knowing Liberia speaks English, told its president he had \"beautiful English.\"\nExperts say Trump wants to lock down mineral deals and maybe find new places for US military bases in Africa, especially after Niger kicked them out. But sending migrants to poor countries won't be easy.\nOne analyst said instead of dumping people, the US should help African countries build jobs so their youth don't risk dying trying to leave.\nImage source: File\nTrump demands peace but Putin won't back down in Ukraine\nRussian President Vladimir Putin doesn't seem surprised or shaken by Donald Trump's latest threats. Trump, who once promised to end the war in 24 hours and improve US-Russia ties, has now sent weapons to Ukraine and warned Russia of heavy sanctions if there's no peace deal in 50 days.\nPutin had hoped for better ties with Trump but always made it clear that his main goal was victory in Ukraine. Kremlin insiders say Trump's shift is disappointing, but not unexpected. A former official said, \"Putin always cared more about the war than friendship with Trump.\"\nTrump grew frustrated after six calls with Putin led nowhere. He joked that after each \"nice\" call, Melania would point out another bombing. Putin's forces have been stepping up attacks, using drones and missiles to hit Ukrainian cities, the Guardian reported.\nStill, Moscow isn't giving up on Trump. Russian insiders believe he's emotional and might change course again.\nWith over 100,000 Russian soldiers dead, Putin wants a clear win. Peace, he says, will only come if Ukraine agrees to stay neutral and gives up land. Far-right voices in Russia now say a full clash with the US is likely, and may already be underway.\nImage source: File\nTrump posts fake AI video of Obama being arrested in Oval Office\nUS President Donald Trump posted a fake video showing former president Barack Obama being arrested by FBI agents in the Oval Office.\nThe video, made using AI, shows Obama in handcuffs and being dragged away while Trump watches. Trump posted the video on his Truth Social platform with the words: \"No one is above the law.\"\nThere was no warning that the video was fake, and many people who saw it believed it was real.\nTrump has often attacked Obama and claims that Obama's government worked to destroy his presidency. Trump has also said that he wants to jail his political enemies if he wins a second term.\nHis post comes shortly after Tulsi Gabbard, the US intelligence chief, accused Obama's team of starting the \"Russia hoax\" to make Trump look bad after his 2016 election win. No evidence has been shared publicly, and Obama has not responded.\nThe White House has not commented on the video.\nImage source: File\nDoctors reveal Trump has blood flow disease in his legs\nThe White House has confirmed that President Donald Trump has a condition that affects blood flow in his legs.\nDoctors found that the 79-year-old US president is suffering from something called chronic venous insufficiency. It means his veins are not working properly, and blood is not flowing back to his heart like it should.\nThe condition was found after Trump had some swelling in his lower legs. A White House doctor checked him and said it's not life-threatening, but could become painful or disabling if not treated.\nExperts say the disease happens when vein valves are damaged or weak, causing blood to leak backwards and collect in the legs.\nSymptoms can include swelling, pain, cramps, itchy skin, varicose veins and even wounds that don't heal. It's most common in people over 70, but can also affect pregnant women, overweight people, or anyone who stands or sits too long without moving.\nThe White House said Trump does not have any blood clots or blocked arteries, which is good news. His doctors have told him to wear special stockings and keep exercising to improve blood flow.\nOn the same day this news came out, Trump also told his Attorney General Pam Bondi to release all secret grand jury files in the Jeffrey Epstein sex case.\nImage source: File\nTrump's 30% tariff could kill 100,000 South African jobs\nUS President Donald Trump's new 30% import tax on South African goods could destroy around 100,000 jobs in the country.\nSouth Africa's Reserve Bank governor, Lesetja Kganyago, said on Wednesday that the agriculture and car-making industries will be hit the hardest.\nSpeaking on radio station 702, Kganyago said the agriculture sector could suffer badly. \"Farming employs many low-skilled workers. The new tax will hit products like oranges, grapes and wine,\" he said.\nHe also raised the alarm about South African car exports, which have already dropped by more than 80% after Trump started taxing imported cars in April.\n\"If we don't find other solutions, we could lose up to 100,000 jobs,\" he warned.\nSouth Africa already has one of the world's highest unemployment rates. The official jobless rate is 32.9%, and the broader rate is over 43%.\nFarmer groups say the new taxes will also hurt macadamia nut, fruit juice and ostrich leather exports.\nIn the citrus industry alone, about 35,000 jobs are at risk. The new tariffs could destroy small towns like Citrusdal in the Western Cape that depend on fruit exports to the US.\nImage source: South African Reserve Bank\nTop Trump ally turns on him over Epstein case\nOne of Donald Trump's closest allies, Mike Johnson, now says the truth about Jeffrey Epstein must come out.\nJohnson is the Speaker of the House - a powerful job in the US. He says the US government must show the public all the files it has on Epstein.\nEpstein was a rich man who was arrested for trafficking underage girls. He died in jail in 2019. Many people don't believe the official story that he killed himself, and they think powerful people who were involved with him are being protected.\nTrump had promised to make everything public. But now he says people should stop focusing on Epstein and has called the case \"boring\".\nThat has made many of Trump's Maga supporters very angry. They believe Trump broke his promise.\nJohnson said: \"We need to put it all out there and let people decide.\" He also asked Trump's top lawyer, Pam Bondi, to explain why she once said Epstein's \"client list\" was on her desk, but hasn't released it.\nTrump said Bondi can decide what files to release, but Bondi refuses to talk about Epstein. She says she's focusing on fighting drug dealers and human traffickers.\nMany Maga supporters are now turning on Trump. Some are burning their red Trump hats in protest.\nImage source: File\nTrump's wife tells him to stop being soft on Putin\nDonald Trump has admitted that his wife, Melania, has influenced how he deals with Russian President Vladimir Putin.\nTrump said that after having \"pleasant\" conversations with Putin, Melania would scold him. \"I come home and say, 'I had a great talk with Vladimir today,' and she says, 'Really? Another city in Ukraine just got bombed.\"'\nNow, Trump has changed his tone. He warned Putin that Russia has 50 days to agree to a peace deal in Ukraine or face tough new tariffs. He also announced that the US will send more weapons to help Ukraine, Daily Star reported.\nMelania, who was born in the former communist country of Yugoslavia and grew up in Slovenia, has strong views about Russia's war in Ukraine. She says she remembers what it was like living under a communist government and often reminds Trump of the suffering in Eastern Europe.\nEven though Melania no longer lives full-time at the White House, Trump said they speak often and that she \"knows what she's talking about\".\nTrump's warning to Russia comes just months after he called Putin \"crazy\" and begged him to stop bombing Ukraine. He said if no peace deal is reached in 50 days, he will hit Russia and its trade partners with heavy tariffs.\nUkraine's President Volodymyr Zelenskyy said he spoke to Trump on the phone this week and that they agreed to speak more regularly about how to end the war.\nImage source: File\nTrump crowns himself as 'Superman'\nDonald Trump has shared an image of himself as Superman, complete with muscles, a tight suit, and a cape.\nThe AI-generated picture, posted on the official White House social media page, shows Trump's face on a superhero body and includes the words: \"THE SYMBOL OF HOPE. TRUTH. JUSTICE. THE AMERICAN WAY. SUPERMAN TRUMP.\"\nThe post is part of Trump's ongoing efforts to present himself as a strong leader ahead of the 2026 elections.\nHe's often said he's the only one who can save America, and now he's using superhero-style images to back it up.\nBut not all his supporters are happy. Some MAGA followers have started burning their red hats in protest after the White House said there would be no further public release of the Jeffrey Epstein files.\nVideos online show frustrated Trump supporters setting their caps on fire.\nImage source: @WhiteHouse\nTrump's army using robot animals to protect air bases\nDonald Trump's US military has deployed robot coyotes to guard air bases as part of his push to use high-tech tools to protect Americans and look tough doing it.\nThe fake animals are designed to scare away birds and other wildlife that could damage fighter jets or cause crashes during take-off and landing. They've been rolled out at major US air bases after successful trials.\nEach robot is shaped like a coyote, a wild animal similar to a jackal, and rides around on wheels like a remote-controlled guard dog. Coyotes are natural predators of many smaller animals, and their presence is enough to keep birds from settling near runways.\nThe US Army's research team developed the cyborg coyotes alongside the Department of Agriculture. The goal: protect expensive aircraft and military crews from bird strikes and animal interference.\nThe move fits with Trump's image-heavy military style. He often talks about \"peace through strength\" and has supported flashy defence projects involving space weapons, military parades and giant spending plans.\nOfficials say the robot coyotes may soon be upgraded with cameras, sensors, and even artificial intelligence.\nImage source: @armenberjikly\nTrump bragged he threatened to bomb Moscow and Beijing in secret talks\nDonald Trump told private donors that he once warned Vladimir Putin he would \"bomb the s*** out of Moscow\" if Russia invaded Ukraine. The comments were caught on new recordings from Trump's presidential campaign.\nTrump claimed he told Putin directly: \"If you go into Ukraine, I'm gonna bomb the s*** out of Moscow.\" He said Putin didn't believe him but added, \"10% was enough.\"\nThe recordings are featured in a new book called 2024: How Trump Retook the White House and the Democrats Lost America.\nTrump also claimed he gave the same warning to Chinese president Xi Jinping, threatening to \"bomb the s*** out of Beijing\" if China attacked Taiwan. \"He thought I was crazy,\" Trump said in the recording. \"But he believed me 10%. That's all I needed.\"\nDespite saying he could end the war in Ukraine in \"24 hours,\" Trump has failed to stop the conflict since returning to office. This week, he announced more US military support for Ukraine after talks with Putin made no progress.\nIn the same recordings, Trump said student protesters supporting Palestine should be kicked out of the country. \"Throw them out,\" he said. \"That will stop it.\"\nHe also bragged about pressuring a rich donor into giving him R460-million, saying the man originally only wanted to give him R18-million.\nThe White House and the Kremlin have not yet responded to Trump's comments.\nImage source: File\nTrump says no more delays for new tax on South African goods\nUS President Donald Trump says that new, higher taxes on goods coming from other countries, including South Africa, will start on 1 August. He says there will be no more delays or changes.\nTrump had already put a 10% tax on imports from almost every country back in April. Then in July, he said some countries would be taxed even more, but he paused those increases. Now, he says the bigger taxes will go ahead as planned.\nIn messages sent to leaders around the world, Trump said countries like South Africa, Japan, South Korea and others will face taxes of between 25% and 40% on goods they send to the US.\nHe also warned that if any country hits back with their own taxes, the US will raise its taxes even more.\nTrump said this will bring in lots of money for the US. His finance minister said the US could make more than $300-billion from these taxes by the end of the year.\nTrump says the taxes are meant to fix \"unfair\" trade deals. But some people are worried the plan will make goods more expensive and cause problems between countries.\nThe US has only made a few new trade deals so far, with the UK, Vietnam and China. Talks with other countries are still going.\nImage source: File\nTrump hits South Africa with 30% tax on all goods\nUS President Donald Trump is putting a 30% tax on everything South Africa sends to America - and it starts in August.\nTrump has written to President Cyril Ramaphosa and other world leaders, saying it's time to stop what he calls \"unfair trade\". He says South Africa has had an advantage for too long by using trade rules that favour it and not the US.\nThe tariff will hit South African products being sold in America. Ramaphosa tried to get Trump to back down, but it didn't work.\nTrump says the US trade deficit (when a country imports more than it exports) is a threat to both the economy and national security.\nHe also warned that if any country tries to fight back, he'll raise the tariffs even more.\nRamaphosa has responded, saying Trump's view of trade between the two countries is simply wrong.\nImage source: File\nTrump slams Elon Musk for starting new political party\nDonald Trump has attacked Elon Musk on social media, calling him a \"train wreck\" who has \"gone off the rails.\" The US president spoke just after Musk announced he's launching a new political group called the \"America Party.\"\nTrump said third parties don't work in the US and only cause \"chaos.\" He claimed the system is built for two major parties and accused Musk of trying to disrupt the country when there's already too much division.\nHe also said Musk is upset because Trump's new tax-and-spending bill removes the electric vehicle (EV) mandate - a rule that would've pushed more people to buy EVs. Trump says Americans should be able to choose between petrol cars, hybrids or electric vehicles. He added that Musk had backed him before, even though Trump was always against the EV mandate.\nThe president also said Musk once asked for a friend to lead NASA, but that person turned out to be a Democrat who had never supported Republicans. Trump said that was a red flag, especially because NASA works so closely with SpaceX, Musk's company.\nTrump ended by saying his job is to protect the American people. His comments follow Musk's announcement that the \"America Party\" will contest elections starting in 2026. Musk said the new party will break the power of the two-party system by focusing on a small number of key seats.\nThough Musk was born in South Africa and cannot run for president himself, he has been vocal about wanting political change. In a poll he ran on social media, two-thirds of voters backed the idea of a new party. Musk said that was enough to launch it officially, saying the country needs \"freedom from the one-party system.\"\nImage source: File\nTrump celebrates new bill and says UFC fight is coming to the White House\nDonald Trump has kicked off 4 July celebrations by bragging about his new tax-and-spending bill, and announcing that a UFC fight will take place on the White House lawn.\nSpeaking at a rally in Iowa, Trump said: \"There could be no better birthday present for America\" than the passing of his new bill, which makes his 2017 tax cuts permanent and increases spending on the military and border security.\nBut the bill also cuts healthcare and food support for low-income Americans and will add $3.3 trillion to the US budget deficit over 10 years.\nDuring the rally, Trump also said he plans to celebrate America's 250th birthday (in 2026) with a national state fair and a live UFC championship fight for up to 25,000 people at the White House.\n\"Dana [White, UFC boss] is going to do it. We have a lot of land there,\" Trump said.\nHe also mocked Joe Biden, repeated false claims about a stolen election, and attacked Democrats. \"I hate them. I really do,\" he said. \"Because I believe they hate our country.\"\nTrump hinted at a softer stance on immigration, saying farm workers could stay in the US if their employers vouch for them. \"We don't want to remove workers from the farms,\" he told supporters.\nImage source: File\nAmerica admits Iran's nuclear sites weren't 'obliterated' like Trump claimed\nThe US Pentagon has admitted that Donald Trump exaggerated when he said he had \"obliterated\" Iran's nuclear sites.\nA spokesperson for the Pentagon, Sean Parnell, said the real damage from the US airstrikes probably only set Iran's nuclear programme back by one or two years, not destroyed it completely.\nThis comes after Trump celebrated the bombing of Iran's Fordow site, calling it a huge win and saying the country's nuclear programme was \"completely and totally gone.\"\nBut intelligence officials have avoided using Trump's word \"obliterated.\" At a press conference, Parnell repeated the word, but admitted that Iran could rebuild in time.\n\"We believe the facilities were heavily damaged,\" he said. \"But their programme may only be delayed by a year or two.\"\nThe bombs used, called \"bunker busters\", are designed to hit deep underground. But Iran's nuclear knowledge and tech were not destroyed.\nRafael Grossi, the head of the International Atomic Energy Agency, said Iran still has the skill to restart the programme. \"You can't destroy the knowledge,\" he said.\nTrump had also claimed that the bombing helped him get a ceasefire deal between Israel and Iran, calling it the end of the \"12-day war.\" But fighting restarted the next day, with both countries blaming each other.\nThe Pentagon is now pushing back against media reports that the strike wasn't as successful as Trump claimed. Parnell accused journalists of using \"false and incomplete\" information to make the military look bad.\nImage source: File\nTrump says Israel is ready for Gaza peace deal\nDonald Trump says Israel is now ready to agree to a peace deal with Hamas to end the war in Gaza, a war that has already killed nearly 60,000 people.\nIn a post on his Truth Social page, Trump said: \"Israel has agreed to the necessary conditions to finalise the 60-day ceasefire.\" He added that during that time, the US will try to help all sides reach a full peace agreement.\nTrump said that Qatar and Egypt, two countries helping to mediate, would now deliver the \"final proposal\" to Hamas. So far, neither Israel nor Hamas has officially responded to Trump's announcement.\nIt's not clear exactly what Israel has agreed to. In the past, similar ceasefire talks have collapsed quickly, with both sides accusing each other of breaking deals, especially around prisoner swaps.\nStill, Trump seems confident. Speaking to reporters, he said a deal could be reached as soon as next week and that he will meet with Israeli Prime Minister Benjamin Netanyahu on Monday.\n\"We want the hostages out, and we want the war to end,\" Trump said, the Guardian reported.\nHamas has said it is willing to release the remaining hostages in exchange for a deal to end the war. Israel, on the other hand, says the war can only stop if Hamas gives up all weapons and control, something Hamas has refused.\nTrump is trying to use momentum from the recent Israel-Iran ceasefire and the joint US-Israeli bombing of Iran's nuclear sites to help secure peace in Gaza.\nHe also warned Hamas not to miss this chance. \"It will not get better, it will only get worse,\" he said.\nTrump's announcement came just after an Israeli airstrike hit a café in Gaza on Monday, killing between 24 and 36 people, including children, according to reports.\nThe war began when Hamas attacked southern Israel in October 2023, killing 1,200 people and taking over 250 hostages. Since then, more than 56,500 Palestinians have been killed and nearly the entire population of Gaza has been displaced. Much of the area has been destroyed.\nImage source: File\nTrump says Elon Musk would be \"back in South Africa\" without US money\nDonald Trump has attacked Elon Musk, saying he only became rich because of US government money, and without it, he'd be back living in South Africa.\nIn a post on Truth Social, Trump said: \"Elon may get more help from the government than any person in history. Without that, he'd probably have to close his businesses and go back to South Africa.\"\nTrump said there would be \"no more rockets, no more satellites, no more electric cars\" if the government stopped giving Musk support. He added: \"We'd save a fortune.\"\nThis comes after Musk complained about Trump's new tax plan. The plan removes money and support for electric cars and clean energy. Musk said cutting this support would be \"very bad\" for the country.\nTesla, Musk's electric car company, has been getting a $7,500 (R133,000) tax break for each car sold. But Trump's plan would stop that. Tesla is also expected to report poor sales this week.\nTrump reminded people that he never supported forcing people to buy electric cars. \"Electric cars are okay, but no one should be forced to drive one,\" he said.\nTrump also said Musk supported him for president, even though he knew Trump didn't like electric vehicle laws.\nImage source: File\nTrump says he's found 'rich buyers' to take over TikTok\nDonald Trump says a group of very rich people are ready to buy TikTok's US operations, but they'll need permission from China before the deal can happen.\nSpeaking to Fox News, Trump said: \"We have a buyer for TikTok. I think China will probably approve it.\" He added he would reveal who the buyers are in about two weeks.\nThe US government has been trying to force TikTok's Chinese owner, ByteDance, to sell the app's American side or face a total ban. The deadline to make the deal is now set for September 17.\nTikTok is still very popular in the US, especially with younger users. Trump has even said it helped him connect with young voters during the 2024 election.\nBut the big problem is TikTok's algorithm, the smart technology that decides what videos people see. It's protected by Chinese law and is listed in China's official tech database, which means it can't be sold easily.\nChina has said before that it might block any sale, especially if it involves the algorithm. And Trump's tough stance on China, including new tariffs earlier this year, has made things even more difficult.\nImage source: File\nTrump posts \"Daddy's Home\" video after NATO boss calls him daddy\nDonald Trump just posted a video of himself at a big NATO meeting, using Usher's song \"Daddy's Home\" as the soundtrack.\nYes, really.\nThe clip shows Trump walking around the NATO summit like he's the star of an R&B music video. The words \"Daddy's Home\" flash across the screen as Usher's hit plays in the background.\nIt comes after NATO boss Mark Rutte bizarrely called Trump \"daddy\" during a press meeting earlier this week.\nRutte was trying to describe Trump's wild rant about Israel and Iran, where Trump said: \"Let them fight for a few minutes, it's easier to stop them.\" Rutte jumped in with: \"And then daddy has to use strong words to stop them.\"\nNot \"Dad.\" Not \"President.\" Just \"daddy.\"\nPeople online quickly slammed Rutte, calling it a clear case of sucking up to Trump. Even Trump joined in the joke, telling reporters: \"Daddy, you're my daddy.\"\nNow the White House has made things even worse with the video, featuring a song that's full of sexual lyrics.\nImage source: File\nTrump turns on spy boss Tulsi over Iran bombing report\nDonald Trump's spy boss, Tulsi Gabbard, has been left out of a big security meeting with US lawmakers, and some insiders say she's now in \"the line of fire.\"\nGabbard was supposed to join top Trump officials in a closed-door briefing with Congress to talk about the recent US strikes on Iran's nuclear sites. But now she's suddenly off the list, and people close to the White House say Trump blames her for a damaging leak, the Daily Mail reported.\nLast week, Trump blasted Gabbard after she said Iran wasn't close to making a nuclear weapon. He told reporters, \"She's wrong.\" Gabbard quickly changed her position, saying Iran could make a bomb \"within weeks to months.\"\nBut the damage was done. A leaked Pentagon report showed the US bombing may have only delayed Iran's nuclear programme by a few months, far less than what Trump had claimed. Trump said the sites were \"obliterated.\" The report said Iran might be able to restart soon.\nNow, there's a full-blown investigation into who leaked the report, and some White House insiders say Gabbard could be the one who gets the blame.\nTrump biographer Michael Wolff said: \"Tulsi is in the line of fire. Trump always needs someone to blame.\"\nEven though Gabbard publicly supported Trump and said the attacks destroyed Iran's facilities, she's been cut from the team giving the official update to Congress.\nTrump is furious at media reports saying the strike didn't do enough. He's attacking CNN and The New York Times, saying they're lying to make him look weak.\nCNN reporter Natasha Bertrand broke the story. Trump posted that she should be \"fired and thrown out like a dog.\" CNN fired back, saying they stand by her reporting.\nImage source: File\nUS bombs didn't stop Iran's nuclear plans\nA new report says the US bombing of Iran's nuclear sites last weekend didn't destroy them completely, and may have only delayed Iran's plans by a few months.\nUS President Donald Trump said after the attacks that the sites were \"totally destroyed\" and that Iran's nuclear programme was \"obliterated.\"\nBut a secret report from the Pentagon now says that's not true. It says some of Iran's nuclear machines were not fully destroyed, and that Iran had moved a lot of its uranium before the bombs hit. That means they might be able to restart the programme soon, the Guardian reported.\nThe US used big B-2 bombers and huge \"bunker-buster\" bombs on three sites, Fordow, Natanz and Isfahan. But one of the sites, Fordow, is buried deep under a mountain, and the bombs couldn't reach all the way down.\nThe report says Fordow is likely still working and may be used again soon.\nTrump posted in all capital letters on his social media: \"THE NUCLEAR SITES IN IRAN ARE COMPLETELY DESTROYED!\" He's angry the report got out and says it's an attempt to make him look bad.\nBut US military leaders are being more careful. One general said the sites were badly damaged, but they are still checking how much was really destroyed.\nThe head of the world's nuclear watchdog says they don't know where 400kg of Iran's uranium has gone. And US Vice President JD Vance admitted they still don't know where the rest of Iran's nuclear material is hiding.\nImage source: File\nThree people killed in Israel just after Trump announces ceasefire\nJust hours after US President Donald Trump said the war between Israel and Iran was over, missiles from Iran hit Israel, killing three people.\nIran fired six waves of missiles early Tuesday morning, with explosions heard in Tel Aviv and Beersheba. Three people died in Beersheba, according to emergency workers.\nThis happened soon after Trump said he had made a peace deal with Israel and Iran to end the 12-day war. He thanked both countries and said on social media that it was \"a historic moment.\"\nBut Iran said the fighting would only stop if Israel stopped its attacks. One Iranian official said they had not fully agreed to stop the war.\nIran's last missiles were fired just before the ceasefire was supposed to begin.\nOver the weekend, the US and Israel bombed Iran's nuclear sites. Iran denies building nuclear weapons, but Trump said the goal was to stop them from ever getting one. The US dropped heavy \"bunker-buster\" bombs on underground sites.\nAfter days of bombing, many people in Tehran have left the city.\nTrump said Iran warned them before attacking a US base and that no Americans were hurt. He said he will push Israel to choose peace.\nTalks between Iran and other countries are still happening. Qatar helped set up the peace deal, and US leaders like Vice President JD Vance and Secretary of State Marco Rubio were involved.\nImage source: File\nIran tells Trump to \"bring enough coffins\" if you want war\nAn Iranian leader has warned Donald Trump that if the US starts a full war with Iran, they should \"bring enough coffins\" for their soldiers.\nThis came after the US bombed three of Iran's nuclear sites using powerful B-2 bombers. Iran is angry and says it will fight back.\nEbrahim Rezaei, a top member of Iran's parliament, said: \"Don't expect us to bury your soldiers. Bring your own coffins.\"\nTensions are rising fast between Iran, Israel and the US. Many world leaders are calling for peace, but Iran's army and other powerful groups say they are ready to hit back hard.\nThe US says they don't want war. Their defence chief said the attack was not meant to kill people, but to stop Iran's nuclear programme. \"This is not about removing Iran's government,\" he said.\nBut Trump is not backing down. On his Truth Social page, he called the attack \"a historic moment\" and told Iran: \"End the war now.\"\nHe also warned Iran that if they keep fighting, \"there will be peace or there will be tragedy.\"\nIran says the US helped Israel start a dangerous war and has now made things worse. Some experts warn this could lead to more terrorism and attacks on US soldiers and allies.\nImage source: @WhiteHouse\nTrump gives himself two weeks to decide on Iran attack\nDonald Trump says he'll decide in the next two weeks if the US will join Israel in bombing Iran.\nThis comes as fighting between Israel and Iran enters its second week, with both sides firing missiles and the danger of a bigger war growing fast.\nTrump's press secretary, Karoline Leavitt, told reporters: \"There's a chance for talks with Iran. The president will decide in the next two weeks if the US will go to war or not.\"\nTrump has also asked the US military if their biggest bombs, the 30,000-pound \"bunker busters\", could destroy Iran's hidden nuclear sites.\nHe says he wants a peaceful solution but is also ready to use force. When asked what his message is to people who voted for him because they wanted \"no more wars,\" Leavitt replied: \"Trust in President Trump.\"\nTrump also said Russian President Vladimir Putin offered to help make peace, but Trump refused, telling him: \"Let's fix Russia first.\"\nTrump is reportedly thinking about attacking Iran's Fordo nuclear site, a hidden base deep underground. So far, Israel hasn't hit that target, but Trump might.\nHe's also posted online that Iran's leader, Ayatollah Ali Khamenei, is \"an easy target\", though he says there are no plans to kill him \"for now.\" Iran has warned the US that choosing war would bring \"irreparable harm.\"\nImage source: File\nTrump says \"I may do it\" as he thinks about attacking Iran\nDonald Trump says he hasn't decided if the US will join Israel in attacking Iran.\nWhen asked about it, he gave a short answer: \"I may do it, I may not.\" He also said, \"Nobody knows what I want to do.\"\nTrump believes Iran is in big trouble and says they want to talk. He told reporters that Iran might even come to the White House for talks. But then he also warned that he's \"had it\" and wants \"unconditional surrender.\"\nIran's top leader, Ayatollah Ali Khamenei, replied with a warning. He said if the US chooses war, it will cause \"irreparable harm.\" Iran also said they will not beg or give in to the US.\nTrump must make a decision soon. US officials say the next 24 hours are very important. Trump doesn't want to look weak while the fighting between Israel and Iran continues.\nAt the same time, the US has moved warships and planes closer to the region. But the White House says they are only there for defence.\nTrump also said Russian President Vladimir Putin offered to help make peace between Israel and Iran. But Trump told him: \"Let's fix Russia first.\"\nImage source: File\nPeople say more pizza orders in the US mean war is coming\nAn online theory claimed that a rise in pizza deliveries near the Pentagon was a secret sign that war was about to break out. But it turns out Pentagon staff were just... hungry.\nThe idea went viral last week as Israel launched major strikes on Iran. A group of internet sleuths, running the so-called \"Pentagon Pizza Report\", noticed a spike in pizza orders near the US defence HQ just before the bombs dropped. They told their 100,000 followers: \"All nearby pizza establishments have experienced a HUGE surge in activity.\"\nAccording to them, when Pentagon staff are working late on military plans, they order loads of pizza -- and that's the first clue that something big is coming.\nBut the White House has now shut that theory down. Officials said the US government already knew about the attacks ahead of time -- no pizza clues needed. Experts also rubbished the idea, calling it \"confirmation bias\" and saying there's no solid proof.\nThe Pentagon does have late-night food available, but they don't track what staff are eating. So no, America isn't using pepperoni pizza to signal a strike.\nMeanwhile, the real news is much more serious. The Israel-Iran conflict is now in its fifth day. Israel has bombed Iranian targets. Iran fired back at major cities. The region is on edge.\nDonald Trump has jumped in too. After leaving the G7 summit early, he warned Iran's supreme leader on Truth Social that the US \"knows exactly where he is\" -- but claimed there were \"no plans to take him out (kill), at least not for now.\"\nUS officials say Trump is also thinking about joining Israel in attacking Iran's nuclear sites.\nSo while the missiles are very real, the pizza warning system is not. Sometimes a delivery is just dinner.\nImage source: File\nTrump leaves G7 early as Israel-Iran war threat grows\nDonald Trump is leaving the G7 summit early as the fight between Israel and Iran explodes.\nHe's heading back to Washington on Monday, skipping the second day of talks in Canada. This comes after Trump warned people in Tehran, Iran's capital, to evacuate immediately on his Truth Social account.\nEarlier, Israel told parts of Tehran to clear out before bombing military targets. Now, with things getting worse, Trump says he needs to be home to deal with it.\nThe White House said he'll still attend the G7 photo and dinner before leaving. But his early exit upset other leaders, who hoped the US would help push for peace.\nA draft statement said Iran must not get nuclear weapons, and that Israel has the right to defend itself. Trump didn't sign it, but posted, \"IRAN CAN NOT HAVE A NUCLEAR WEAPON. MAKE AMERICA GREAT AGAIN!!!\"\nHe also hinted he might try to help end the conflict: \"They want to make a deal... but I have to leave here.\"\nMeanwhile, Israel is bombing Iranian sites, and Iran is firing missiles at Israeli cities. Iran also warned it may leave the global nuclear treaty.\nIsrael's leader, Benjamin Netanyahu, said killing Iran's top leader would end the war.\nThe US isn't in the fight yet, but is moving warships and planes closer. The USS Nimitz is heading to the Middle East to join another US carrier, and two destroyers have moved near Israel.\nImage source: @WhiteHouse\nIsrael ignores Trump's orders and attacks Iran\nDonald Trump told Israel not to bomb Iran. They did it anyway.\nJust hours before the attack, Trump said he didn't want Israel to go in, warning it could ruin his peace talks with Iran. But Israeli warplanes launched the strike without US support, and without waiting for Trump's approval.\nNow Trump is caught in a dangerous situation. His efforts to calm things down with Iran are at risk, and thousands of US troops in the region could be in danger if things get worse.\nTrump's top diplomat was preparing for talks in Oman when the attack happened. Trump had already asked Israeli Prime Minister Netanyahu to hold off. He didn't listen.\nRepublicans like Senator Lindsey Graham cheered the move, but Trump's not interested in starting new wars. Unlike past presidents, he doesn't want the US dragged into foreign fights unless America is directly attacked.\nAfter the airstrike, the US made it clear they had nothing to do with it. A short statement from Secretary of State Marco Rubio said: \"Israel acted alone. Our priority is keeping American forces safe.\"\nImage source: File\nElon Musk says sorry for going too far about Trump\nElon Musk has said sorry to US President Donald Trump after the two had a big fight online.\n\"I went too far,\" Musk wrote on X on Wednesday. \"I regret some of my posts about President Trump.\"\nLast week, the two were throwing insults at each other. Trump said he might stop giving government money to Musk's company, SpaceX. Musk, in return, said Trump's name was linked to the Epstein scandal, something Trump strongly denies.\nTrump hit back, saying Musk had \"lost his mind\".\nNow, people close to Musk say he's calming down and might want to be friends again. He even deleted a post where he supported removing Trump from office.\nMusk's apology came after Trump warned him: \"If he keeps trying to punish Republicans, there will be serious consequences.\" But Trump didn't say what those consequences would be.\nEarlier this year, there were rumours Trump might sell off his Tesla shares, but nothing happened.\nEven though things got ugly, Trump has stopped attacking Musk for now. He said he wishes Musk well and wants Musk's satellite internet company, Starlink, to keep running.\nVice President JD Vance said Musk made a \"huge mistake\" by going after Trump.\nHe called Musk's angry posts \"emotional\" and said, \"I hope Elon comes back, but maybe it's too late, he went nuclear.\"\nImage source: File\nPhotos show Trump may be wearing a catheter on his leg\nPhotos of Donald Trump at the White House have gone viral after people noticed a weird bulge in his left pant leg. Many think he might be wearing a catheter, which is a medical tube that drains urine into a bag.\nThe bulge looks like tubing running down his leg. Some say it's a Foley catheter, which is often used for people with bladder problems. Others shared diagrams of how catheters work and said it matches the shape seen in the photos.\nA few people suggested it might be a leg brace or just wrinkled pants, but many online are convinced it's a medical device.\nTrump has not commented, and his doctor has never mentioned any catheter or health issues like this. Still, the internet is buzzing with rumours about his health based on the pictures.\nImage source: @patriottakes\nTrump wants to give R18,000 to every baby born in the US\nDonald Trump has shared a new idea that every baby born in the US between 2025 and 2029 will get $1,000 (R18,000) from the government. The money will go into a special savings account that grows with the stock market. Parents can also add more money, up to $5,000 a year.\nTrump says this plan will help kids build money for their future. Big business leaders like the CEOs of Uber, Goldman Sachs, and Dell have promised to add billions more to support this idea.\nThe plan is part of a big new law that Trump calls his \"beautiful bill.\" It's already passed in the House of Representatives but still needs to pass the Senate. If it doesn't pass, the baby accounts won't happen.\nTrump says the money for this plan will come from changes to welfare programs and a new tax on money sent out of the country. But a government report says the plan would actually add $2.4-trillion to the national debt and cut healthcare and food help for millions of people.\nSome experts also say the baby accounts aren't the best way to invest money, and other savings plans might work better. Still, Trump believes the accounts will give kids a good start in life.\nOther countries like the UK and Singapore have done similar things before, giving money to kids to help them save early.\nTrump and his supporters say if this bill doesn't pass, Americans might face higher taxes. So they're pushing for Congress to approve it soon.\nImage source: File\nTrump sends troops to Los Angeles and says \"we'll be everywhere\"\nPresident Donald Trump has sent troops into Los Angeles after protests broke out over immigration raids. He warned that \"troops will be everywhere\" and said he wouldn't let the protests continue.\nThe protests started after ICE (Immigration and Customs Enforcement) agents raided a detention centre and arrested a union leader. Police used tear gas and flash-bangs on protesters, and the scene quickly got tense.\nTrump blamed California Governor Gavin Newsom and LA Mayor Karen Bass, saying they weren't doing their jobs. He made fun of Newsom on social media, calling him \"Newscum,\" and said protesters shouldn't be allowed to wear masks.\nGovernor Newsom responded, saying Trump was trying to \"create chaos\" so he could send in more troops and scare people. He told everyone to stay calm and peaceful.\nAround 300 National Guard soldiers were sent to LA over the weekend to help control the protests. ICE said they would keep arresting people who tried to stop their raids.\nImage source: @USBPChief\nElon Musk and Donald Trump go from besties to enemies\nDonald Trump and Elon Musk used to be best buds. Now, they're fighting like two celebs in a bad reality show.\nIt all started when Musk called Trump's new tax bill \"disgusting\" and told Americans to call Congress and stop it. He even posted a picture from the movie Kill Bill to make his point.\nTrump didn't stay quiet. He fired back from the White House, saying he might cancel Musk's government deals and cut off his billions in funding. Musk clapped back: \"Go ahead, make my day.\"\nThen things got even messier.\nMusk claimed Trump's name was in the secret Jeffrey Epstein files. There's no proof, but Musk's post went viral.\nJust a few days ago, the two were all smiles in the White House, with Trump even giving Musk a goodbye gift as he left his short government job at the Department of Government Efficiency (DOGE).\nMusk also said Trump would have lost the election without him, and called him ungrateful. Trump replied, saying Elon had \"turned on him\" and only got upset because the new bill cuts tax breaks for electric cars. Musk said he never even saw the bill, and accused Trump of hiding it from Congress.\nThen Musk joked that Trump must have been replaced by a body double, because he used to say the same things Musk is saying now.\nJust when you thought it couldn't get wilder, Trump's old advisor Steve Bannon said Musk should be deported and investigated, claiming he might be in the US illegally.\nImage source: File\nTrump banned travel from a country that does not exist\nUS President Donald Trump is being laughed at online after banning travel from a country that hasn't existed for over 30 years.\nTrump signed a new executive order blocking people from entering the US from 12 countries. One of them was \"Burma,\" but that country officially changed its name to Myanmar in 1989.\nThe full list of banned countries includes Afghanistan, Iran, Somalia, Sudan, Yemen, and others. The White House says the travel ban is meant to keep the US safe. But critics say it unfairly targets certain countries and reminds them of Trump's earlier \"Muslim ban\" from 2017, which caused protests and confusion at airports.\nThis new ban comes after a recent attack in Colorado, where an immigrant from Egypt was arrested. But Egypt is not on the list.\nPeople online mocked Trump for not knowing that Burma and Myanmar are the same country. Others say the ban is more about politics than safety, and that it could hurt the US's image around the world.\nImage source: File\nElon Musk calls Trump's tax plan 'a disgusting mess'\nElon Musk has slammed US President Donald Trump's new tax and spending plan, calling it \"outrageous\" and \"a disgusting mess.\"\nThe plan, which gives huge tax breaks and increases spending, was passed by Republican lawmakers in May. Trump called it a \"big, beautiful bill.\" But Musk strongly disagreed. On his social media platform X, he wrote: \"This massive spending bill is a disgrace. Shame on those who voted for it.\"\nMusk had been working in the Trump government for a short time to help cut waste and lower spending. His team was called the Department of Government Efficiency (DOGE). But last week, Musk quit the role. He said trying to fix problems in Washington was harder than expected.\nAt a press event, the White House brushed off Musk's complaints. Trump's spokesperson said the president still supports the bill.\nMusk warned that the bill would raise the national debt to $2.5-trillion and said voters should remove the politicians who supported it.\nMusk had big plans to cut $2-trillion in government spending, but only managed $150-billion. He also faced backlash over cuts to foreign aid and clashed with other Trump officials, Daily Star reported.\nHis short-term role in government was always limited to 130 days. That time ended at the end of May.\nImage source: @WhiteHouse\nTrump misled about 'white genocide' in South Africa, says adviser Mark Burns\nMark Burns, a US pastor and adviser to Donald Trump, says the former president may have been misled about claims that white farmers are being targeted and killed in South Africa.\nBurns is visiting South Africa for the first time and says the country reminds him of his home state, South Carolina.\nIn an interview with the Mail & Guardian, Burns said he was surprised to learn from South Africans of all races that most people don't believe in the so-called \"white genocide\" narrative. He added that of the over 5,000 murders in the last part of 2024, only 12 were farmers, and just three were white.\nBurns said he met with white Afrikaner farmers who confirmed crime is a problem but denied being targeted for their race. He believes Trump may change his view if he visits South Africa himself and gets accurate information.\nBurns described Trump as a \"man of peace\" who wants prosperity for all countries. He said Trump sometimes reacts to what's shown to him without knowing the full truth and would rethink things if given better information.\nHe also warned that South Africa's role in Brics, a group that includes Russia and China, could hurt relations with the US by challenging the US dollar. Burns said this makes trade and negotiations harder.\nAsked if Trump would attend the G20 summit in South Africa later this year, Burns said he couldn't speak for him, but he would advise him to come and see the situation for himself.\nImage source: File\nTrump claims that Biden is a clone\nUS President Donald Trump has shared a shocking post online that says Joe Biden died in 2020 and was replaced by a clone or robot.\nThe original post, made by someone else on social media, said: \"There is no Joe Biden - he was executed in 2020. What you see now are clones and robotic copies.\" Trump didn't comment, but he reposted it on his platform, Truth Social, which made it go viral.\nSome of Trump's supporters believed it, saying things like \"We always knew something was wrong.\" Others pointed out things like Biden's changing eye colour as \"proof\" he had been replaced, Daily Star reported.\nBut many people laughed at the idea and called it just another crazy conspiracy. One person wrote, \"Do you think the Earth is flat too?\"\nTrump has shared strange claims before. He once said Barack Obama wasn't born in the US and suggested Ted Cruz's father helped kill President John F. Kennedy. He's also supported QAnon and made false claims about the 2020 election being stolen.\nDespite not having any proof, Trump continues to share these kinds of stories, and some of his fans continue to believe them.\nImage source: File\nTrump gives Putin two weeks to prove he wants peace in Ukraine\nUS President Donald Trump has warned Russia's Vladimir Putin that he has two weeks to show he's serious about ending the war in Ukraine, or the US will respond differently.\nAt the White House, Trump said: \"I can't tell if Putin wants peace, but we'll find out in two weeks. If he's just playing games, we'll act differently.\"\nTrump has recently called Putin \"crazy\" and accused him of \"playing with fire\" after Russia launched one of its deadliest attacks on Ukraine in years. At least 13 people, including children, were killed in Kyiv over the weekend.\nEarlier, Trump and Putin spoke on the phone for two hours. Trump said the call went \"very well,\" but no peace deal followed, and Russia kept bombing, BBC reported.\nSo far, Trump's administration has mostly pressured Ukraine, even pausing military support in March. Critics say this makes Russia feel stronger. Russia has now demanded that Ukraine give up land and that the US recognise Crimea as Russian territory.\nA Kremlin official said Trump doesn't understand what's really happening and blamed Ukraine for attacking Russian cities. Meanwhile, Germany has offered Ukraine longer-range missiles, which Russia says could damage peace efforts.\nTrump is now focusing on a possible summit with Putin instead of pushing for an immediate ceasefire. But with Russia holding about 20% of Ukraine and peace talks going nowhere, the war continues.\nZelensky says Russia is stalling, while Moscow claims a peace plan is almost ready.\nImage source: File\nElon Musk quits Trump team after arguing over government spending\nElon Musk has decided to leave his role as an adviser to US President Donald Trump. The billionaire businessman said he's had enough of politics and is frustrated by how slowly things work in government.\nMusk, who runs Tesla, SpaceX and X (formerly Twitter), announced on X that his time helping the Trump administration has come to an end. He thanked Trump and said his plan to cut wasteful government spending, called the DOGE mission, will still continue without him.\nMusk had been helping Trump try to cut down the US government's budget, but said the system is more broken than he expected. \"It's harder to fix things in Washington than I thought,\" he told The Washington Post.\nHe quit shortly after criticising Trump's new spending bill, calling it too expensive and saying it added more debt. In an interview with CBS, Musk joked that the bill was \"big\" but not \"beautiful,\" poking fun at Trump's description of it.\nTrump said he's not happy with every part of the bill, but still supports it overall.\nMusk had been working part-time for the government since January and helped Trump's campaign with millions in donations. But now he says he's stepping away from politics completely and going back to focus on his businesses.\n\"I think I've done enough,\" Musk said.\nImage source: File\nRamaphosa jokes about Trump meeting: 'I get nervous when the lights go off now'\nPresident Cyril Ramaphosa made a lighthearted joke on Tuesday about his unusual meeting with US President Donald Trump last week.\nSpeaking at an event in Cape Town, Ramaphosa said he now feels uneasy whenever the lights go dim, because of what happened in the Oval Office.\nDuring his meeting with Trump, the US president suddenly told staff to turn off the lights and play a video on a TV in the room. The video showed EFF leader Julius Malema singing \"Kill the Boer,\" a controversial song. The moment caught Ramaphosa by surprise.\nAt Tuesday's event, when the lights dimmed as he walked onto stage, Ramaphosa joked: \"When I saw the room going dark, I thought, what's going on? Is this happening again?\" He laughed and said it reminded him of what happened with Trump.\nHe also joked with journalist Clement Manyathela, who was at both the Trump meeting and the Tuesday event. \"Seeing you again gave me flashbacks,\" he said, smiling.\nRamaphosa said people later told him the Oval Office moment was \"an ambush,\" but he just found it confusing and unexpected. \"I thought we were getting into a good discussion, and then suddenly the lights went out and a video was playing,\" he said.\nImage source: File\nRussia could attack Europe by 2027\nA new report warns that Russia might be ready to attack European countries as soon as 2027, if the war in Ukraine ends or slows down soon.\nThe report, from a top London research group (the International Institute of Strategic Studies), says that a ceasefire would give Russia time to rebuild its army. Even though Russia has lost many tanks and vehicles in Ukraine, it's already starting to replace them, the Daily Star reported.\nExperts say that if Russia gets a break from the war, it could rebuild its forces and pose a serious threat to nearby countries like Estonia, Latvia, and Lithuania within two years.\nLeaders in Europe, including France's President Emmanuel Macron, have also warned that Russia still has big military goals and may not stop with Ukraine. European Union foreign policy chief Kaja Kallas said last year, \"It's not a question of if they'll start another war, but when.\"\nThere's also growing concern about NATO, the alliance that protects many Western countries. US President Donald Trump has repeatedly questioned whether America should continue to defend NATO countries that don't spend enough on their military.\n\"If they don't pay, I'm not going to defend them,\" Trump told reporters after returning to office.\nExperts say that if the US pulls back from NATO, it could weaken the group, making it easier for Russia to act more aggressively in Europe.\nImage source: File\nTrump warns Putin that taking all of Ukraine will destroy Russia\nUS President Donald Trump has warned that if Russian President Vladimir Putin tries to take control of all of Ukraine, it could lead to Russia's downfall. In a post on Truth Social on Sunday night, Trump said, \"I've always had a good relationship with Putin, but something has happened to him. He's gone absolutely CRAZY!\"\nTrump said he believes Putin wants to take over all of Ukraine, not just part of it, and warned that doing so would be a huge mistake for Russia, The Guardian reported.\nEarlier that day, Trump told reporters he was shocked by Russia's latest attacks on Ukrainian cities. He also said he was now considering adding new sanctions on Russia. \"He's killing a lot of people,\" Trump said. \"What the hell happened to him?\"\nTrump also took aim at Ukrainian President Volodymyr Zelenskyy, saying Zelenskyy was \"doing his country no favors\" and that \"everything out of his mouth causes problems.\" He added, \"I don't like it, and it better stop.\"\nZelenskyy had earlier criticised the US for not speaking out more strongly after Russia carried out its biggest air attack in years. The weekend strikes killed at least 12 people, including three children, and involved nearly 300 drones and dozens of missiles.\nDespite promising during his campaign to end the war in 24 hours, Trump has not placed new sanctions on Russia, even after it refused a proposed 30-day ceasefire.\nZelenskyy's top aide said more pressure is needed, warning that Russia could continue attacking not just Ukraine, but possibly other countries as well.\nImage source: File\nTrump shows wrong photo to claim white farmers are being killed in South Africa\nDuring a meeting at the White House with South African President Cyril Ramaphosa, US President Donald Trump wrongly said he had proof that white farmers were being killed in South Africa. He held up a picture and said, \"These are all white farmers being buried.\"\nBut the photo wasn't from South Africa at all, it was taken in the Democratic Republic of Congo (DRC). It shows people being buried after a deadly attack by rebels near the city of Goma.\nThe picture came from a video made by the news agency Reuters in February. Trump had seen the image in an article on a conservative website called American Thinker, which talked about race problems in both South Africa and the DRC. The website didn't explain where the image was from, but it linked to the original video about Congo.\nThe Reuters journalist who filmed the video, Djaffar Al Katanty, said he was shocked to see Trump using it in the wrong way. \"President Trump used my video from Congo to claim white people are being killed in South Africa,\" he said, TimesLive reported.\nThe White House didn't respond to questions about the mistake. The editor of the blog admitted Trump was wrong about the photo, but still defended the article's message.\nPresident Ramaphosa visited the US this week to improve relations. Trump has accused South Africa of mistreating white people, which the South African government says is not true.\nImage source: File\nRamaphosa jokes with Trump: 'I don't have a plane to give you'\nSouth African President Cyril Ramaphosa met US President Donald Trump at the White House on Wednesday. The meeting had some tense moments, but Ramaphosa used humour to lighten things up.\nWhen a reporter asked Trump about a $400-million private jet he reportedly accepted from Qatar, Ramaphosa joked, \"I don't have a plane to give you.\" Trump laughed and replied, \"I wish you did. I would take it.\"\nBut the mood turned tense when the reporter asked if taking the plane was ethical. Trump got angry and said, \"You're a bad reporter. You should be ashamed,\" and told the reporter they couldn't ask any more questions. Ramaphosa tried to keep things calm by repeating his joke, which got another laugh.\nEarlier in the meeting, Trump showed Ramaphosa a video he claimed showed the graves of over 1,000 white farmers in South Africa and handed him newspaper articles. Ramaphosa, watching with no visible reaction, asked where the video came from and responded: \"There is crime in South Africa, but most of the victims are Black.\"\nTrump replied, \"The farmers are not Black.\"\nLater, when journalists asked how the meeting went, Ramaphosa said, \"It went very well.\"\nImage source: @PresidencyZA\nTrump drops Elon Musk as friendship falls apart\nElon Musk is no longer part of the US government team he once helped lead, and it looks like he's stepping away from politics completely.\nThe tech billionaire has been removed from the Department of Government Efficiency (called DOGE), and many of his businesses have struggled because of his political opinions and ties to President Donald Trump.\nTrump used to praise Musk often on his Truth Social account, sometimes mentioning him four times a week. He liked Musk's bold cost-cutting moves, including firing government workers and shutting down departments.\nBut things have changed. Trump hasn't mentioned Musk at all since early April, and reports say Musk's influence in the White House is basically gone.\nOne Republican insider told Politico, \"He's done. People don't like him anymore.\" They said Musk's attempts to act like an average American didn't go down well, and instead upset voters.\nNow, people in Trump's team see Musk as a problem, not an asset. He used to be viewed as a smart outsider who could help fix government, but now he's seen as too controversial.\nThere hasn't been an official announcement, but the silence from Trump's side says a lot. According to The Independent, Trump's team is quietly pulling away from Musk.\nImage source: File\nRamaphosa lands in Washington for talks with Trump\nPresident Cyril Ramaphosa has arrived in Washington DC for an important visit to the United States. He is expected to meet with US President Donald Trump at the White House on Wednesday.\nRamaphosa is travelling with several senior government leaders and political figures, including Democratic Alliance leader John Steenhuisen, Trade and Industry Minister Parks Tau, Minister in the Presidency Khumbudzo Ntshavheni, International Relations Minister Ronald Lamola and South Africa's new special envoy to the US, Mcebisi Jonas.\nIn a statement earlier this week, Steenhuisen said the visit is both historic and crucial. He explained that his focus is on strengthening trade relations between the US and South Africa, especially in the agricultural sector. He said that maintaining agreements like AGOA is essential to protect jobs, boost the economy and create more employment opportunities.\nSteenhuisen added that South Africa's relationship with the United States is extremely important. He warned that losing preferential trade access under AGOA would be a major blow to the country's economy, especially for farmers and farm workers.\nThe upcoming meeting between Ramaphosa and Trump is expected to address key economic and political issues affecting both nations.\nImage source: @PresidencyZA\nTrump to call Putin in push for Ukraine ceasefire\nUS President Donald Trump says he's ready to speak with Vladimir Putin and Volodymyr Zelenskyy on Monday in a new push to end the war in Ukraine.\nTrump shared on social media that he's expecting a \"productive day\" and hopes to make progress toward a ceasefire. He also plans to speak with NATO leaders.\nThe war, which began when Russia invaded Ukraine in February 2022, has proved difficult to end, despite Trump's repeated claims that he could stop it quickly.\nTrump's top adviser on the matter, Steve Witkoff, said the president believes a phone call with Putin could \"clear up the logjam\" and get both sides closer to peace. \"I think it's going to be a very successful call,\" Witkoff said.\nBut not everyone agrees with Trump's approach. Bridget Brink, the former US ambassador to Ukraine, resigned last month, saying the administration has been too soft on Russia and too hard on Ukraine.\nShe said the final straw came in February, when Trump and his team criticised Zelenskyy during a meeting at the White House. \"Peace at any price is not peace,\" Brink warned. \"It's appeasement, and that leads to more war.\"\nTrump said the first call will happen at 10am Monday with Putin. He hopes to stop what he called the \"bloodbath\" in Ukraine. He also suggested trade incentives might be part of the deal, since Russia's economy is suffering under US and Western sanctions.\nTrump posted that he believes this war \"should never have happened\" and is confident it can be ended soon.\nImage source: File\nRamaphosa and Trump to talk trade, refugees and war\nPresident Cyril Ramaphosa is heading to the United States next week to meet with President Donald Trump at the White House on May 21. Their goal is to fix tensions between South Africa and the US.\nRelations between the two countries have gotten worse since Trump returned to office in January. Trump has cut off aid to South Africa and accused the government of unfairly targeting white Afrikaners through its land reform policies. He also allowed 49 white South Africans to move to the US as \"refugees,\" claiming they were victims of racial discrimination. South Africa says this is not true.\nRamaphosa's team says that the refugee issue is not the most important topic for the meeting. Instead, he wants to focus on trade, investment, and cooperation between the two countries.\nHe will also speak to Trump about:\n- The future of the AGOA trade deal, which helps African countries export goods to the US\n- South Africa's legal case against Israel over the war in Gaza\n- The ongoing war in Ukraine, where Ramaphosa has tried to help promote peace\nSouth Africa says it wants fair trade, peaceful diplomacy, and a balanced relationship with the US.\nRamaphosa has invited Trump to visit South Africa later this year for the G20 summit and says he'll see for himself that the country is peaceful and welcoming.\nSouth African officials say they expect the meeting to be respectful, even if the two leaders don't agree on everything.\nImage source: File\nRamaphosa to meet Trump in the US next week\nPresident Cyril Ramaphosa will visit the United States next week to meet with President Donald Trump at the White House on May 21, his office confirmed on Wednesday.\nThe two leaders will talk about important issues between South Africa and the US, as well as topics affecting the rest of Africa and the world.\nRamaphosa's office says the visit is a chance to improve relations between the two countries, which have become strained since Trump returned to power in January.\nTrump has cut off all US aid to South Africa, saying he doesn't support the country's land reform plans or its legal case against Israel at the International Court of Justice.\nThis week, the US also gave refugee status to 49 white South Africans, claiming they face racial discrimination. The South African government says that claim is not true, and Ramaphosa has said the US is misunderstanding the situation.\nEven though relations are tense, the US is still one of South Africa's biggest trading partners, after China.\nImage source: File\nSaudi Arabia rolls out mobile McDonald's for Trump\nUS President Donald Trump was given a tasty surprise during his trip to Saudi Arabia this week, a mobile McDonald's restaurant set up just for him.\nTrump landed in Riyadh on Tuesday to meet with Crown Prince Mohammed bin Salman. The two leaders signed several major deals, including a $142 billion arms agreement involving US defence companies.\nBut all eyes were on something else parked nearby, a fully equipped McDonald's on wheels, brought in especially for Trump's visit, Daily Star reported.\nThe restaurant served the usual favourites like Big Macs and Quarter Pounders, as well as local menu items like the McArabia Kofta, which is served in pita bread.\nTrump has long been open about his love for fast food. He once ordered 300 burgers to the White House, posed for photos serving food at McDonald's during his campaign, and starred in a McDonald's commercial years ago. After attending a funeral in New York last year, he even ordered $200 worth of burgers for his flight home to Florida.\nTrump once said he prefers McDonald's because it's \"clean\" and he trusts that the food is safely pre-made. According to his biographer, he likes it because he fears being poisoned, and believes McDonald's food is safer than unknown restaurants.\nTrump is expected to attend more events in Saudi Arabia before continuing his Middle East tour in Qatar, where reports suggest he may be given a £302 million private jet as a gift from Qatari royals.\nImage source: @stockbella\nTrump invites all South African minorities to apply to be refugees\nThe US is now offering asylum to all South African minorities, including Afrikaners, who say they are being mistreated or fear they may be in danger.\nThe US embassy in South Africa announced that people who are Afrikaner or part of a racial minority group in South Africa can now apply to move to the US as refugees. The programme is part of a new order signed by President Donald Trump.\nTo apply, you must:\n- Be a South African citizen\n- Be an Afrikaner or part of another minority group\n- Be able to explain how you've been mistreated, or why you fear for your safety in the future\nApplicants must complete a form and explain their situation, including how many people are travelling with them and when they're ready to leave. They'll be asked what kind of harm they've faced, such as unfair treatment because of race, religion, or political views.\nThe first group of people from South Africa has already flown to the US.\nBut in the US, many people are asking why South Africans are being fast-tracked, while thousands of other refugees from war zones, already been approved, are still being blocked.\nSome lawyers say it's unfair and may break US law, especially since Trump had earlier stopped refugee resettlement completely. Now, his administration is helping some people while leaving others in danger.\nA US refugee group said: \"Afrikaners are being fast-tracked, while others in desperate need are left behind.\"\nImage source: File\nUkraine and Russia may agree to peace talks this week\nUkrainian President Volodymyr Zelenskyy says there could be a ceasefire with Russia as soon as Monday, with direct peace talks possibly happening later this week in Turkey.\nZelenskyy shared the news on social media after speaking directly with Russian President Vladimir Putin. He said both sides may meet in person on Thursday in Istanbul.\n\"We're waiting for a full and lasting ceasefire starting tomorrow,\" Zelenskyy said. \"There's no reason to keep the killing going.\"\nRussia and Ukraine have been at war since 2022. This is the most hopeful update in months. Putin has rejected Ukraine's call for a 30-day unconditional truce but has offered face-to-face talks without preconditions.\nDonald Trump, who pushed Zelenskyy to accept the offer, posted: \"Have the meeting, now!\"\nEuropean leaders, from France, Germany, the UK and Poland, met with Zelenskyy on Saturday and also demanded a ceasefire starting Monday. They warned Russia of tougher sanctions if Putin doesn't agree.\nPutin says he wants peace, but only if it leads to a \"lasting solution\" and not just time for Ukraine to prepare for more fighting.\nWhile the US and European countries see this week's talks as a chance for peace, many remain sceptical of Putin's intentions.\n\"This could be a first step,\" said French President Emmanuel Macron, \"but it's not enough.\"\nIf talks go ahead on Thursday, it would be the most serious chance yet to end the war.\nImage source: File\nTrump says having an American pope is a 'great honour'\nThe new head of the Catholic Church is Robert Francis Prevost, who will now be known as Pope Leo XIV. He was born in Chicago, studied near Philadelphia, and later worked as a missionary in Peru.\nTrump praised the historic appointment, telling reporters: \"To have the Pope from America is a great honour.\"\nOther American leaders also welcomed the news. Vice President JD Vance, a Catholic convert, said millions will pray for the new pope, BBC reported.\nJoe Biden, a devout Catholic and former president, wrote: \"Habemus papam - May God bless Pope Leo XIV of Illinois.\"\nBarack Obama congratulated the pope as a fellow Chicagoan, calling it a historic day.\nGeorge Bush said the news brought \"hope\" for Catholics in America and around the world.\nWhile many political leaders are celebrating, there are signs that Pope Leo may have disagreed with some of Trump's past policies. A social media account believed to be his once shared posts criticising the Trump administration's deportations and comments made by JD Vance.\nThe Vatican has not confirmed whether the account belongs to Pope Leo.\nImage source: @CyrilRamaphosa\nIran wants to kill Trump to get revenge, says ex-us official\nIran is planning to kill Donald Trump to get revenge for the killing of one of their top generals, says John Bolton, a former US security adviser.\nIn 2020, Trump ordered a US airstrike that killed Qasem Soleimani, a powerful Iranian military leader, in Iraq. Since then, Iran has promised to strike back.\nNow, Bolton says Iran has made a kill list, and Trump is number one on it. Bolton also believes he is on the list.\n\"Iran is using gangs in Europe and the US to go after people who speak out against them,\" Bolton told Sky News. \"They're trying to find and hurt people like me -- and Trump is their main target.\"\nTrump was already the target of an assassination attempt last year in the US.\nAt the same time, Trump says his government is now talking directly with Iran to try and stop them from building a nuclear bomb.\n\"We're having talks. A deal would be better than the alternative,\" Trump said. \"But if the talks fail, Iran will be in big trouble.\"\nIran has not said anything yet about Bolton's claims, but its leaders have often warned the US would pay for killing Soleimani.\nImage source: File\nTrump says letting Russia back into the World Cup might help end the war\nDonald Trump was surprised to learn that Russia is banned from the 2026 Fifa World Cup because of its invasion of Ukraine. When a journalist asked him about Russia's suspension during a White House Fifa meeting, Trump said, \"I didn't know that. Is that right?\"\nFifa president Gianni Infantino quickly explained that Russia is currently banned from international football. \"We hope peace will come and they can be readmitted,\" he said.\nTrump then suggested that allowing Russia back into the tournament could be used as a peace incentive. \"Hey, that could be a good incentive, right?\" he said. \"We want them to stop. We want the killing to stop. It's not even believable.\"\nTrump also claimed that hosting the 2026 World Cup, which will take place across the US, Canada, and Mexico, would bring massive economic benefits. He said it would create thousands of jobs and bring in billions for local businesses.\n\"We'll make sure it's safe and successful,\" Trump promised. \"Everyone coming to the US will have a smooth, easy experience.\"\nThe US is also set to host the Club World Cup this June. Trump said both tournaments will be \"special\" and the 2026 World Cup will be \"the best run soccer tournament the world has ever seen.\"\nImage source: White House\nTrump will pay undocumented immigrants $1,000 to leave the US\nThe Trump administration has announced a new program that will pay undocumented immigrants $1,000 (R18,000) if they agree to leave the US voluntarily.\nThe Department of Homeland Security (DHS) says people without legal status can apply through an app called CBP Home. After they leave the country and it's confirmed, they'll get the money.\nThis is a change to an app created under President Biden, which helped people request asylum at the US border. Trump shut that down and changed it so the app now helps people exit the US instead.\nDHS says this approach saves money. Right now, arresting and deporting someone costs the US over $17,000. By offering a $1,000 incentive, the government says it could cut those costs by 70%.\nHomeland Security Secretary Kristi Noem said it's the \"safest and most cost-effective way to leave\" and avoid arrest, the Guardian reported.\nOne person has already flown back to Honduras under the program, and more trips are planned.\nThe government claims people who leave this way might have a better chance of being allowed back legally later, but immigration experts warn that this may be false hope.\nCritics say it's a trap and could actually make it harder for people to return legally in the future.\nThis plan is part of Trump's larger push to reduce immigration and encourage \"self-deportation\", which means making life in the US so difficult that people decide to leave on their own.\nImage source: File\nTrump announces 100% tariff on movies made outside the US\nPresident Donald Trump says all movies made outside of the United States will now face a 100% import tax.\nHe made the announcement on his Truth Social account on Sunday, calling foreign-made films a \"national security threat.\"\nTrump says countries like Australia and New Zealand are stealing away American film jobs by offering better deals to Hollywood producers. He wants movies to be made in the US again, the Guardian reported.\n\"We want movies made in America, again!\" he posted.\nHe also claimed the move is needed to fight \"messaging and propaganda\" from other countries. It's not yet clear how or when the new tax will begin, or whether it affects American companies filming overseas.\nFilm production in Los Angeles has dropped nearly 40% over the past 10 years, according to FilmLA. Meanwhile, countries like Australia, New Zealand and others have attracted big-budget movies by offering tax breaks and cash.\nImage source: File\nTrump asks for 'divine dreams' and makes virgin joke at prayer event\nDonald Trump held a big prayer event at the White House on Thursday, where religious leaders asked God to give him \"divine dreams\" and protect him with \"supernatural power.\"\nOne man even knelt in front of Trump while others raised their hands and sang Amazing Grace. The event marked National Prayer Day, and Trump used the moment to sign a new order creating a group called the Religious Liberty Commission.\nTrump, who survived an assassination attempt last year, said he believes God saved his life and is now helping guide his leadership. \"We're bringing back religion in this country,\" Trump said.\nPaula White, Trump's spiritual adviser, led the prayers. She asked God to give him special dreams, wisdom, and strength. She also said the country needs a spiritual reset, with Trump leading the way.\nEven though Trump has faced many scandals, including a criminal conviction and selling $60 Bibles, many Christian voters still support him.\nDuring the event, Trump also made a joke about a belief that saints in Islam receive 72 virgins in Heaven.\n\"What about 38 virgins?\" he joked while speaking about a talk he had with Muslim leaders.\n\"They said, 'That's nonsense.\"'\nTrump repeated his false claim that he won the 2020 election and said he's working to protect religion in America, including setting up a team to fight \"anti-Christian bias.\"\nOne top advisor, Mike Waltz, was missing. Trump later replaced him due to a scandal over leaked messages.\nImage source: White House\nTrump jokes about becoming the next pope\nDonald Trump this week told reporters that he wants to be the next pope. \"I'd like to be pope,\" Trump said with a grin. \"That would be my number one choice.\"\nUsers on social media site X quickly made fun of the comment, with one writing, \"First time in history, we will have orange pope.\" Others pointed out how the media might have reacted if someone else had said it: \"Had Biden said something this stupid, the media and MAGA would have a field day,\" Daily Star reported.\nTrump didn't name a preferred candidate for the real role, but did mention Cardinal Timothy Dolan of New York, calling him \"very good\".\nThe College of Cardinals is set to meet on May 7 to start voting for the next pope after Pope Francis's funeral on Saturday. Only cardinals under the age of 80 can vote, and 108 of the 135 eligible voters were appointed by Francis.\nWhile some cardinals want to continue Francis's focus on helping the poor and vulnerable, others are pushing for a return to traditional teachings and unity in the church.\nTrump's pope comment may have been a joke, but the conclave to choose the real one is expected to be serious, and fast, possibly wrapped up in two or three days.\nImage source: File\nTrump moves fast but big promises still not done\nDonald Trump has been moving fast since returning to the White House. After 100 days, he's made some big changes, but many of his promises are still not done.\nTrump says he already fixed inflation, but experts warn that his high tariffs on foreign goods could make prices rise again. He promised to lower energy bills by half, but for now, energy costs have stayed the same.\nOn immigration, Trump has made a big impact. Illegal crossings from Mexico have dropped a lot, and deportations are up.\nTrump promised to end the Russia-Ukraine war quickly. That hasn't happened. Fighting is still going on, and there is no peace deal yet.\nHe also promised big tax cuts, like no taxes on tips and overtime pay, but none of those have passed yet.\nTrump has acted fast on cultural issues. He banned transgender athletes from girls' and women's sports, cut funding to some universities, and pardoned around 1,500 people who were involved in the January 6 Capitol riot.\nTrump also worked with Elon Musk to cut government jobs, but the savings are much smaller than they promised.\nIn short, Trump has moved quickly on immigration and culture wars, but promises like cheaper energy, lower taxes, and peace in Ukraine are still not delivered, and it's unclear if they will be.\nImage source: File\nTrump says Ukraine may give Russia part of its land\nUS President Donald Trump says he thinks Ukrainian President Volodymyr Zelenskyy is ready to give up Crimea to Russia, even though Zelenskyy said just last week that Crimea will always belong to Ukraine.\nSpeaking to reporters in New Jersey on Sunday, Trump said: \"Oh, I think so,\" when asked if Zelenskyy was willing to give up the Black Sea region, which Russia seized in 2014, the Guardian reported.\nZelenskyy has not yet responded to Trump's latest comments. But last week, he clearly stated that Crimea is still \"the property of the Ukrainian people.\"\nMeanwhile, leaked US peace plans suggest Trump's team is proposing that Russia keep the territories it captured, including Crimea. Germany's defence minister called the US plan a \"capitulation\" and warned it was worse than anything Ukraine could have agreed to a year ago.\nEven so, Trump said after meeting Zelenskyy at the Vatican that he now has more sympathy for him.\n\"He's working hard. He wants to do something good for his country.\"\nTrump also criticised Russia for launching new missile attacks after his peace ambassador met with Putin, saying he was \"very disappointed.\"\nWhen asked if he trusts Putin, Trump answered: \"I'll let you know in about two weeks.\"\nTrump added that he believes a peace deal could be signed soon and claimed (without evidence) that the US has already sent Ukraine $350 billion in aid.\nOn another front, Trump said there had been \"a little bit\" of progress in trade talks with China, despite Chinese officials saying no talks are happening.\nImage source: Donald Trump Truth Social\nTrump starts 2028 campaign even though third term is not allowed\nDonald Trump has started selling \"Trump 2028\" campaign hats, even though US law says he can't run for a third term.\nThe red cap, which looks like his usual \"Make America Great Again\" hat, now says \"Trump 2028\" and is being sold for $50 (around R1,000).\nAccording to the US Constitution, a person can only be elected president twice. Trump already won in 2016 and again in 2024, which means he shouldn't be able to run again.\nBut Trump told NBC that there may be \"ways around\" the rule. \"I'm not joking,\" he said. \"A lot of people want me to do it.\"\nFormer Republican politician Adam Kinzinger says Trump is ignoring the rules and could create a big crisis if he refuses to listen to court decisions in the future, Daily Star reported.\nTrump's second time in the White House has already caused economic problems, with high tariffs on imports and growing tension between countries. Stock markets have dropped, and trade wars have begun.\nNow, there are signs that Trump might try to calm things down but many believe the chaos isn't over yet.\nTrump's actions can affect the whole world, including South Africa. If he tries to stay in power longer than allowed, it could damage trust in democracy everywhere and hurt global trade and economic stability.\nImage source: File\nTrump still cares about Africa, says adviser after aid cuts\nUS President Donald Trump still cares about Africa, even after cutting major aid programmes and raising tariffs, according to his adviser Massad Boulos.\nIn an interview with the BBC, Boulos said Trump \"highly values Africa and African people\" and denied that the US is planning to close its embassies across the continent.\nBut Trump's actions have caused real problems.\nOn his first day in office, Trump froze most US foreign aid, which has had a serious impact on health services in Africa. Many HIV treatment programmes were cut, and some countries may soon run out of HIV medication, according to the World Health Organization.\nKenya, Nigeria and Lesotho are among the countries affected. The aid freeze also hit cholera clinics. In South Sudan, five children and three adults died after walking for hours to reach a clinic that had shut down.\nBoulos said the US is reviewing how aid is spent to make sure the money is not being wasted. \"We want the money to go to the right places,\" he said.\nHe also confirmed that the US is interested in mining resources in the Democratic Republic of Congo (DRC) and Rwanda, especially minerals like lithium, which are used in electric car batteries.\nTrump's trade policies have also hit Africa. He recently placed 50% tariffs on imports from countries like Lesotho, before putting those tariffs on hold for 90 days. Lesotho depends on US trade, especially in clothing and textiles.\nThere are also worries about the future of AGOA -- a special trade agreement between the US and African countries, first launched in 2000. Trump has not said if he will renew it, and experts think it might end soon.\nImage source: File\nTrump says China tariffs will drop but not go away\nUS President Donald Trump says his very high tariffs on goods from China will be reduced but not removed completely.\nRight now, the US charges a 145% tariff on Chinese goods. China hit back with a 125% tariff on US products. This has started a trade war that's shaken the global economy.\nSpeaking at the White House on Tuesday, Trump said: \"The tariffs will come down a lot -- but they won't go to zero,\" the Guardian reported.\nHis comments followed a warning from his treasury secretary, Scott Bessent, who said the current situation can't continue and both sides need to make changes.\nTrump said he still wants to keep good relations with China: \"We're doing fine with China. I think we'll work well together.\"\nThe stock market went up after news of possible lower tariffs.\nChina hasn't officially replied yet, but their media called Trump's tariffs unfair and warned other countries not to make trade deals that hurt China.\nMeanwhile, businesses around the world, including in South Africa, are worried that this trade fight will make things more expensive and slow down the economy.\nBoth China and the US are huge trading partners for South Africa. If their trade war continues, it could mean fewer exports, job losses, and higher prices here at home.\nImage source: File\nPope once told Trump 'he's not a Christian'\nPope Francis and Donald Trump never had a good relationship, and it all started with a wall.\nDuring Trump's 2016 campaign, the Pope slammed his plans to build a wall between the US and Mexico, saying: \"A person who thinks only about building walls and not bridges is not Christian.\"\nTrump didn't take it well. He fired back, saying if ISIS ever attacked the Vatican, the Pope would've prayed for a president like him, Daily Star reported.\nThe two later met in 2017 at the Vatican. Trump said it was a \"fantastic meeting,\" but photos told a different story, with the Pope looking miserable next to Trump's big grin.\nThings didn't get better.\nThis year, just months before his death, the Pope again criticised Trump's mass deportation policies, saying they were built on \"force, not dignity\" and \"will end badly.\"\nHe also disagreed with Vice President JD Vance, who said people should look after their own families and countries before helping others. The Pope wrote: \"Christian love is not just about looking after people close to you.\"\nPope Francis passed away on Monday 21 April at the age of 88. Trump is expected to attend his funeral on Saturday.\nImage source: @WhiteHouse\nTrump says Russia and Ukraine might make a peace deal soon\nUS President Donald Trump says Russia and Ukraine could reach a peace deal \"this week\", but gave no details on what that would look like.\nWriting in all caps on his social media platform Truth Social on Sunday, 20 April, Trump said:\n\"HOPEFULLY RUSSIA AND UKRAINE WILL MAKE A DEAL THIS WEEK.\"\nHe added that if peace is reached, both countries could start doing \"big business\" with the US and \"make a fortune.\"\nThe comment comes after a failed Easter ceasefire between the two countries. Russia said it would pause attacks for the holiday, but both sides have since accused each other of breaking the truce.\nTrump has recently said that both Ukraine and Russia need to compromise to end the war, which started in February 2022 when Russia invaded Ukraine.\nAny peace deal between Russia and Ukraine would affect global prices, from fuel to food. It could ease inflation and reduce pressure on SA's economy, which has been hit hard by rising costs linked to the war.\nImage source: File\nPresidency says Trump won't hold grudge against Jonas\nThe presidency has defended sending Mcebisi Jonas to the US as South Africa's new special envoy despite an old video where Jonas called Donald Trump a \"racist, homophobe and narcissist\".\nThe comments were made in 2020, when Jonas gave a public lecture as a private citizen, not as a government official.\nPresidency spokesperson Vincent Magwenya said on Wednesday: \"At the time, Jonas was not representing the government. Those views were personal.\"\nHe added that Trump isn't the type to hold grudges. \"If he did, half his cabinet wouldn't be working with him.\"\nJonas' job is to fix SA's diplomatic and trade relationship with the US, which has become tense. Trump expelled SA's former ambassador Ebrahim Rasool after criticism of his administration, and recently threatened to boycott the G20 summit in South Africa.\nMagwenya said Rasool and Jonas are different cases -- Rasool spoke while in office, while Jonas was just an activist at the time.\nJonas also commented this week, saying: \"These things happen. People move on.\"\nImage source: File\nTrump's trade war with China is bad news for South Africa\nSouth Africa got a 90-day break from Trump's harsh tariffs, but experts say we're still in trouble.\nThat's because Trump is now hitting China, one of South Africa's biggest trading partners -- with heavy taxes. And when China's economy slows down, South Africa suffers too.\nChina and the US buy over 18% of SA's exports. If demand drops, it means fewer sales, fewer jobs, and a weaker economy here at home.\nEconomist Maarten Ackerman told Mail & Guardian: \"Even if the US doesn't tax us directly, we're still going to feel the pain.\"\nSA's farmers and food producers may need to find new markets fast, especially if US buyers stop ordering wine, fruit, or canned goods.\nTo protect trade ties, President Ramaphosa has sent Mcebisi Jonas to Washington as a special envoy to deal with the growing crisis.\nImage source: File\nTrump blames Zelenskyy for war after deadly Russian attack\nJust days after 35 people were killed in Ukraine by Russian missiles -- including two children -- US President Donald Trump blamed Ukrainian President Volodymyr Zelenskyy for helping to start the war.\nSpeaking from the White House, Trump said that millions of people have died because of three people: Russia's Vladimir Putin, former US president Joe Biden, and Zelenskyy.\nHe said the war could have been stopped: \"Biden could've stopped it, Zelenskyy could've stopped it, and Putin should never have started it,\" Trump told reporters, Sky News reported.\nHe also said Ukraine made a mistake by going to war with a much stronger country: \"You don't start a war with someone 20 times your size and hope people give you missiles,\" he said.\nThe comments came just after two Russian missiles hit the city of Sumy during a Palm Sunday celebration. It was one of the deadliest attacks in Ukraine this year, and over 100 people were injured.\nZelenskyy has called for help from the world. Russia claimed it hit a military target but has shown no proof.\nTrump said he wants to end the war and stop people from dying: \"All I want to do is stop the killing.\"\nImage source: File\nWhite House claims Trump is healthy and fit to lead\nDonald Trump is \"fully fit\" to run the United States, even though he has high cholesterol, slightly high blood pressure, and a scar from a gunshot, according to a report from the White House doctor.\nThe report came after Trump, who is 78 years old, went for his yearly health check-up. The doctor, Sean Barbella, said Trump is in good shape, both physically and mentally, and is taking medicine to manage his cholesterol.\nTrump's cholesterol level is now 140, which is healthy. In 2018, it was over 220. His blood pressure is a little high at 128 over 74, but it's not dangerous.\nThe report also said Trump is up to date on all his vaccines, even though his health secretary, Robert F Kennedy Jr, has questioned vaccines in the past.\nTrump still has a scar on his ear from when he was shot at during a campaign rally last year. He survived, but one person died and others were injured.\nTrump told reporters after the exam: \"I think it went well. They did every test you can imagine.\"\nHe also said he took a cognitive test to check his memory and thinking skills. He scored 30 out of 30, which means he passed with full marks. The test includes tasks like drawing a clock, remembering words, and naming animals.\nHis heart rate was 62 beats per minute, which is normal for someone in good health.\nImage source: White House\nTariff pause is no relief for South Africa\nSouth Africa has been given a 90-day break from Donald Trump's harsh import tariffs but experts say it's not really good news.\nThe US dropped tariffs on many SA goods from 31% down to 10%, giving local exporters a bit of breathing room. But analysts and unions say this is just a tactic by Trump's administration to force South Africa into signing trade deals that favour the US.\nTrade Minister Parks Tau confirmed that SA is included in the pause and said talks have already begun. But some tariffs, like the 25% tax on cars, steel, and aluminium, are still in place.\nExperts say the US is using tariffs as a negotiating weapon. Dr Frederich Kirsten, an economist, said: \"It's not about relief -- it's about pressure. The US now holds the cards,\" he told The Citizen.\nPolitical analyst Sandile Swana warned that the US is trying to change global trade rules. \"When you trade with the US, they want your country to play by American rules -- even if it hurts your economy,\" he said.\nUnions are worried too. Cosatu says 500,000 jobs in South Africa are linked to trade with the US. They called the 10% tax on agriculture \"still too high\" and warned that keeping cars at a 25% tariff could kill exports and cause job losses.\nThe US tariff pause isn't a gift -- it's a way to pressure SA into making deals that could hurt workers, weaken trade rules, and threaten jobs. With unemployment at around 32%, SA can't afford to play along without a fight.\nImage source: File\nLesotho made Trump's shirts -- now he's taxing them 50%\nSome of Donald Trump's fancy golf shirts were made in Lesotho, the same country he just hit with a huge 50% tariff.\nTrump's branded shirts, made by golf legend Greg Norman's clothing brand, have tags showing they were made in Lesotho. But now, because of Trump's new import rules, clothing from Lesotho will cost 50% more to bring into the US.\nThat's bad news for Lesotho. The country depends on selling clothes to the US -- it's one of the biggest parts of its economy and supports 15,000 jobs, News24 reported.\nBefore this, Lesotho's clothes went into the US tariff-free under a deal called AGOA, which helps African countries trade with America. But that benefit is now gone.\nThe reason? Trump says Lesotho has a trade \"imbalance\" with the US, mostly because of diamond sales.\nGreg Norman, who makes the shirts and supports Trump, once called him \"a breath of fresh air.\" Now, that air comes with a big bill.\nLesotho's economy is closely tied to South Africa. If thousands of jobs are lost there, it can affect trade, migration, and our shared economy. And if Trump is raising tariffs on neighbours like Lesotho, South Africa could face even more pressure -- we've already been hit with a 30% tariff.\nImage source: File\nTrump's tan taxed as tariff war hits his face\nDonald Trump's new import taxes could end up hitting his own face -- as prices rise on tanning products used to create his famous orange glow.\nTrump's massive new tariffs came into effect on April 5, adding tariffs to thousands of foreign products. And that includes fake tan.\nPopular UK bronzer brand St. Tropez will now cost Americans 10% more, while Trump's rumoured favourite face cream -- Swiss brand Bronx Colors -- will be hit with a 31% tariff.\nThat means the president's signature orange look could soon come with a higher price tag, Daily Star reported.\nTrump reportedly insists on 2 bottles of the Swiss concealer in his bedroom at all times.\nBut now, thanks to his own tariffs, Americans will be paying more for beauty products, food, clothes, and electronics.\nImage source: @WhiteHouse\nTrump wants to ban sex toys and bring back child labour\nDonald Trump is trying to make it harder to buy sex toys -- and easier for kids to work overnight.\nIn Texas, a new law would force people to show their ID just to buy a vibrator online. Sellers who don't check could face a year in jail and a $4,000 fine.\nAnother proposed law would ban big shops like Walmart from selling sex toys at all -- only strip clubs and sex shops would be allowed to sell them.\nThe official term for a sex toy in Texas? An \"obscene device\" -- including dildos and anything used to \"stimulate genitals.\"\nSex expert Dr. Shamyra Howard said, \"It turns something normal and healthy into something shameful.\"\nMeanwhile, in Florida, lawmakers want to let 14-year-olds work night shifts, even on school days.\nOne journalist put it simply: \"Orgasms are out. Child labour is back.\"\nImage source: File\nZimbabwe cuts US tariffs as Africa faces trade war\nZimbabwe's president, Emmerson Mnangagwa, says his country will drop all tariffs on goods coming from the US -- just days after Donald Trump slapped an 18% tariff on Zimbabwe's exports going into America.\nMnangagwa says he wants to improve relations with the US and hopes this move will open the door to better trade. But many people say it's a bad deal.\nTop journalist Hopewell Chin'ono says Zimbabwe is trying to \"please\" Trump in the hopes that US sanctions on Mnangagwa will be removed -- but he calls it \"a long shot.\"\nZimbabwe has been under some form of US sanctions for over 20 years, mainly due to human rights abuses and corruption. Biden removed the old sanctions last year but kept targeted sanctions on 11 people, including Mnangagwa himself.\nNow, Zimbabwe says it wants fair trade and friendly relations. But critics say the US will benefit far more from this decision than Zimbabwe will.\nTrade between the two countries is small -- just over $110 million in 2024 -- and most experts say scrapping tariffs won't help Zimbabwe much.\nMnangagwa, who is currently the chair of the SADC region, is also being criticised for acting alone. Some say he should be working with other African countries to respond to Trump as a group, not going solo.\nTrump has placed huge tariffs across Africa:\n- Lesotho: 50% tariff on exports\n- South Africa: 30% tariff on exports\n- Zimbabwe: 18% tariff.\nLesotho says it will send a team to the US to negotiate.\nTrump's new tariffs are already hitting South Africa hard, with a 30% tax on goods going into the US. That could hurt our exports, lead to job losses, and make our economy even more unstable. And if other African countries start making one-sided deals, SA could be left behind.\nImage source: @edmnangagwa\nDonald Trump calls America a 'healing patient'\nDonald Trump says America is like a patient that just had surgery -- and now it's getting better, thanks to his new trade rules.\nOn what he's calling \"Liberation Day\", Trump signed off on a big new tax (called a tariff) on goods coming into the US from other countries, including the UK, Japan, South Korea and South Africa.\nFor example, goods from South Africa will now face a 30% tariff when they enter America.\nEven though many Americans are worried about prices going up, Trump celebrated on social media, writing:\n\"THE OPERATION IS OVER! THE PATIENT LIVED, AND IS HEALING. THE PATIENT WILL BE STRONGER, BIGGER, BETTER.\"\nBut not everyone is impressed.\nThe UK government says it won't react just yet, and Japan is deciding whether to fight back with its own tariffs. Experts also pointed out that some of Trump's claims in his speech were wrong -- like when he said American companies aren't allowed to sell cars in other countries.\nTo make things more awkward, Trump walked off the stage after his speech before signing the actual papers. A staff member had to bring him back to finish the job.\nWhen big countries like the US start taxing imports, it can cause global prices to rise. That means we might end up paying more here in South Africa for fuel, food, cars and other goods.\nImage source: File\nElon Musk expected to leave Trump's government soon\nElon Musk is expected to leave his role in Donald Trump's government in the next few weeks, according to insiders.\nMusk has been working as a special advisor in Trump's new department called the Department of Government Efficiency (DOGE). But now, with Tesla sales dropping and more people criticising his influence in politics, Musk is stepping back to focus on his businesses.\nHis time as a \"special government employee\" is set to end around May or June.\nAt a press briefing, Trump said: \"At some point, he's going back. I'd keep him as long as I can -- he's very smart.\"\nBut behind the scenes, there's been trouble. Some people in Trump's team say Musk's behaviour has become difficult to manage. His surprise announcements and posts on social media have caused problems, and many in the White House have been frustrated.\nMusk has also become a political problem. He recently spent millions supporting a judge in an American election -- but the judge lost badly. His link to Trump is also hurting Tesla, as some customers are now avoiding the brand. Tesla's share price has dropped, and some experts say Musk is turning people away with his behaviour.\nTrump has also started to distance himself from DOGE, the government project Musk created to \"cut waste.\" Some say it caused more confusion than results.\nElon Musk was born in Pretoria, and he's one of the most powerful people in the world. His role in the US government affects decisions about technology, business, and even space. If Musk steps away from politics, it could change how the US works with other countries -- including South Africa.\nImage source: @POTUS\nTrump to announce new taxes on imports\nDonald Trump is set to make a big announcement on Wednesday that could affect prices around the world -- including in South Africa.\nHe's calling it \"Liberation Day\", and he plans to add new taxes (called tariffs) on goods coming into the United States from other countries.\nThat means anything the US buys from overseas -- like cars, clothes, electronics, oil, and food -- could be taxed more. Trump says he's doing this to protect American businesses and workers, and to punish countries he thinks have taken advantage of the US for years.\nReports say Trump may add:\n- 20% tax on all imported goods\n- 25% tax on cars and car parts\n- Extra taxes on oil, steel, and products from countries like Canada, Mexico, Brazil, India and the EU\nThese new tariffs would start right away -- and many people are worried.\nBusiness leaders in the US say the extra taxes will make things more expensive for them, and they'll likely raise prices for customers to make up for it. That could lead to a rise in the cost of living in many countries.\nThe global stock market has already dropped, and experts say Trump's plan could help cause a worldwide recession -- which means job losses, rising prices, and slower trade.\nIf prices go up in the US and Europe, South Africans could feel it too. We might pay more for things we import, like petrol, electronics and food. If global trade slows down, South African businesses could lose money -- and that puts jobs at risk.\nImage source: File\nTrump says he's not joking about a third term as president\nDonald Trump has suggested he could try to stay in the White House for a third term, despite the US Constitution saying that's not allowed.\nSpeaking in an interview, the 78-year-old president said \"a lot of people want me to do it,\" and hinted that his vice president JD Vance could take over as president -- and then step down so Trump could return.\n\"I'm not joking,\" Trump said. \"There are ways you could do it.\"\nUnder US law, no president can be elected more than twice. But Trump's latest comments have experts worried. Former congressman David Jolly warned: \"If he says he's not ruling it out, we should take it seriously.\"\nLegal experts say it's likely just political theatre -- but with Trump, anything is possible.\nIf Trump starts a trade war, it could make everyday things more expensive here in South Africa. Our economy is connected to the global market, so if prices go up in the US and Europe, we feel it too. And if Trump finds a way to stay in power longer than the law allows, it could encourage other world leaders to try the same -- which is bad news for democracy everywhere.\nImage source: @POTUS\n'Pissed off' Trump warns Putin to back off or face tariffs\nDonald Trump says he's \"very angry\" and \"pissed off\" with Russian president Vladimir Putin and now he's threatening major new oil tariffs to force a peace deal in Ukraine.\nThe outburst came after Putin suggested Ukraine should kick out president Volodymyr Zelenskyy as part of a ceasefire agreement -- something Trump called a \"step in the wrong direction.\"\nSpeaking to NBC News, Trump said: \"If Russia and I can't make a deal to stop the bloodshed, and I think it's Russia's fault -- which it might be -- I'll hit them with massive tariffs. No more Russian oil in the US. No business with countries that buy it. A 25 to 50% tariff.\"\nTrump has shifted from his previously soft tone on Putin to something more aggressive, even though he insists they still have a \"good relationship.\"\nHis latest comments come as peace talks drag on with no clear end in sight. Russia says negotiations could stretch into 2026 and continues to demand the lifting of sanctions as a condition for any ceasefire.\nMeanwhile, Russia continues to bomb Ukrainian cities. A drone strike on Kharkiv this weekend killed two people and injured 35, including patients in a military hospital.\nA wider or longer war in Ukraine keeps global fuel prices high, food costs rising, and world markets unstable. If Trump gets tough on Russia, it could shake up oil supplies -- and the impact will reach South African wallets fast.\nImage source: File\nTrump calls himself the fertilisation president\nDonald Trump has given himself a strange new nickname: \"the fertilisation president.\"\nHe was speaking at the White House during a Women's History Month event when he started talking about helping more women access IVF (in vitro fertilisation) -- a medical process that helps people have babies.\n\"There will be tremendous goodies in the bag for women,\" Trump said. Then he added: \"I'll be known as the fertilisation president -- and that's OK.\"\nPeople in the room laughed, and Trump smiled: \"Actually, I like it. I've been called worse.\"\nTrump has been trying to win over more women voters by promising that the government will help pay for fertility treatments.\nHe also made headlines earlier this year when he called himself \"the father of IVF,\" even though he admitted he didn't know much about it until recently.\nImage source: File\nTrump picks far-right media boss as new US ambassador to SA\nUS President Donald Trump has nominated Brent Bozell -- a hardcore conservative media figure -- as America's new ambassador to South Africa.\nBozell is best known for founding the Media Research Center, a group that attacks what it calls \"liberal bias\" in the US media. Trump made the announcement on his social media account, calling Bozell \"fearless\" and praising his \"extraordinary experience.\"\n\"Brent brings fearless tenacity, extraordinary experience, and vast knowledge to a Nation that desperately needs it,\" Trump wrote. \"Congratulations Brent!\"\nBozell could replace Reuben Brigety, who resigned in January after several rocky months in Pretoria. His nomination was confirmed this week in a formal note sent to the US Senate.\nThis comes as relations between the US and South Africa remain tense, with Trump cutting funding and booting SA's ambassador Ebrahim Rasool out of Washington earlier this month.\nBozell is a known Trump loyalist who's been part of the MAGA (Make America Great Again) movement. Some insiders say this appointment is less about diplomacy -- and more about messaging.\nBrent Bozell is not a diplomat -- he's a political activist who supports Trump's views and often attacks anyone who disagrees. His appointment means the US may take a tougher, more aggressive approach toward South Africa. That could make it harder for our government to work with the US on things like trade, diplomacy, and international issues like Ukraine or Gaza.\nImage source: @SenMikeLee\nHeavyweight clash at White House ends with missing belt\nVolodymyr Zelenskyy revealed this week that he doesn't know what happened to the WBC championship belt he brought to the White House months ago as a gift for Donald Trump.\nThe belt, given to him by heavyweight champion Oleksandr Usyk after beating Tyson Fury, was meant as a peace offering. But instead of handing it over, Zelenskyy pulled out a folder of disturbing war photos showing tortured Ukrainian soldiers -- and the meeting turned into a political punch-up.\nTrump, who had already called Zelenskyy a dictator, exploded on camera. \"You're gambling with World War III,\" he snapped.\nZelenskyy now says he left the belt on a side table and never saw it again. \"Maybe it's still sitting there,\" he told Time magazine this week. Reports say a staffer moved it to Trump's private dining room -- where it may now be collecting dust next to tomato sauce bottles and golf trophies.\nZelenskyy says he doesn't regret showing the photos instead of the belt. \"He has kids. He should feel what we feel,\" he said. \"But yeah... the conversation went in a different direction.\"\nImage source: File\nTrump's team accidentally texts war plans to journalist\nTop Trump officials have accidentally leaked secret US war plans in a messaging app group chat -- by including a journalist in the conversation.\nThe group, made up of senior figures like Vice President JD Vance, Defence Secretary Pete Hegseth and Secretary of State Marco Rubio, was discussing attacks on Yemen when they mistakenly added Atlantic magazine editor Jeffrey Goldberg.\nGoldberg says he was shocked to see real-time details of the military operation, including names of officials and sensitive tactics. \"I thought it was a prank,\" he said. \"But the attack happened exactly as they planned it.\"\nThe Trump administration has confirmed the breach but is trying to downplay the damage. Hegseth even told reporters, \"Nobody was texting war plans.\" Goldberg hit back: \"That's a lie. He was.\"\nIf Trump's top officials can't keep their own war plans private, it puts global security at risk. Countries like South Africa often work with the US on trade, security, and international cooperation. But if the US keeps making mistakes like this, it's harder to trust them.\nImage source: @POTUS\nRasool says 'don't replace me with a white ambassador'\nFormer ambassador Ebrahim Rasool has told President Cyril Ramaphosa not to choose a white replacement just to please Donald Trump.\nSpeaking at a homecoming rally in Cape Town on Sunday, Rasool told ANC supporters that South Africa must fix its relationship with the US but without sacrificing its values.\n\"We can't think that just because America has a white president, we need a white ambassador,\" he said. \"We need someone who can rebuild ties, but still stand strong for what we believe in.\"\nRasool was kicked out of the US last week after Trump's government accused him of being disrespectful. Now, names like deputy minister Andries Nel and former DA leader Tony Leon are being floated as possible replacements but the presidency says there's no rush.\nRasool also called for a new kind of diplomacy -- one based on Ubuntu. \"Ubuntu diplomacy is not about lying to protect your country or flattering your host,\" he said. \"It's about telling the truth with respect, standing your ground, and keeping your dignity.\"\nThe next ambassador will shape how South Africa navigates a tough relationship with Trump's US. That choice will say a lot about whether we stand firm -- or bend under pressure.\nImage source: File\nFrance wants the Statue of Liberty back\nFrench leaders are demanding that the United States give back the Statue of Liberty -- all because of Donald Trump.\nFrench politician Raphaël Glucksmann says the statue, which was gifted to the US 140 years ago, no longer belongs there. He says Trump has \"sided with tyrants\" and no longer represents the values the statue stands for.\n\"We gave it to you as a symbol of freedom,\" Glucksmann said. \"But if you've chosen to support dictators and silence scientists, then we want our gift back.\"\nThe Trump administration hit back hard, saying the statue is going nowhere. A White House spokesperson said France should be grateful to the US for helping them win World War II and added that \"if it wasn't for America, they'd be speaking German.\"\nEven Australia's former Prime Minister jumped in, reminding everyone that France once helped America fight the British in its own war for independence.\nThis may sound like political theatre but it shows how Trump's actions are damaging US relationships around the world. As America isolates itself, smaller countries like South Africa feel the knock-on effects in trade, global funding, and foreign policy influence.\nImage source: File\nTrump says Rasool must leave the US by Friday\nSouth Africa's ambassador to the US, Ebrahim Rasool, has just days to clear out his office and leave America after being declared \"persona non grata\" by the Trump administration.\nThe diplomatic bombshell dropped when Secretary of State Marco Rubio blasted Rasool as a \"race-baiting politician who hates President Trump\" in a social media post after the ambassador discussed white Americans becoming a minority.\nRasool's diplomatic privileges expired Monday, and he must be out of the country by Friday.\nPresident Ramaphosa is trying to downplay the crisis, calling it a \"hiccup\" and promising to engage \"with deep respect\" for Trump, but this comes right after Trump cut funding to South Africa over alleged \"anti-white policies.\"\nAs our top diplomat gets ready to fly home, South Africans should watch closely - when ambassadors get expelled, serious economic and political fallout usually follows.\nImage source: SA Embassy\nIs Trump just Musk's babysitter now?\nNew photos from the White House have people asking: who's really in charge -- Donald Trump or Elon Musk?\nThe pictures show Trump walking next to Musk's four-year-old son while Musk walks ahead, talking to his staff. In one photo, Trump is even seen helping the boy -- nicknamed \"Lil X\" -- onto the presidential helicopter.\nSocial media had a field day. \"Trump finally got a real job -- he's Lil X's nanny now,\" one person joked. Another said: \"Imagine being the president but spending your day babysitting a billionaire's child.\"\nSome people even asked, \"Does this kid live at the White House now?\" One user replied: \"Of course he does -- he's the real president!\"\nMusk posted one of the photos himself, calling it \"a happy picture.\" But many people noticed something else: Musk walking ahead like the boss, while Trump trails behind with the child. \"It really shows who has the power,\" one person wrote.\nSince Trump appointed Musk to lead the Department of Government Efficiency (called DOGE), Musk has become one of the most powerful people in Washington.\nMusk was born in Pretoria and now he's influencing major decisions in the US. That could affect South Africa too, from how we use social media and tech to deals around space, green energy and trade. If Musk is the one calling the shots, his choices could impact jobs, prices, and policies here at home.\nImage source: @POTUS\nPutin \"agrees\" to Trump's ceasefire plan but with a catch\nPutin just said yes to Trump's 30-day ceasefire plan for Ukraine, but don't get too excited.\nWhile thanking Trump for \"regulating the conflict,\" Putin added he has \"a lot of questions\" and any deal must \"lead to long-term peace\" - Putin-speak for getting what he wants.\nThe Russian leader couldn't help boasting that his forces \"are on the offensive everywhere\" and warned Ukrainian troops they must \"surrender or die.\"\nExperts think Putin's agreement comes with hidden conditions and might just be playing nice with Trump, who has now restored military aid to Ukraine after Zelenskyy agreed to ceasefire talks.\nWhy should South Africans care? Because global conflicts affect our economy directly - from higher food prices to unstable markets. Plus, watching Trump broker deals between Russia and Ukraine shows how he handles international problems - a preview of what other countries (including ours) might face.\nImage source: File\nTrump's right hand tells a story the White House won't explain\nSomething strange is going on with Trump's hand. A dark mark keeps showing up in photos - most recently during his meeting with Ireland's leader.\nThe White House claims it's just from Trump shaking too many hands. But medical experts aren't buying it.\nDr. Anatalia Moore, a skin specialist, says normal handshakes don't cause bruises like that, Daily Star reported.\nShe thinks it might be from a medical procedure where doctors put a drip in his hand.\nShe also points out that at 78, Trump could bruise more easily from just bumping into things, as older people often have balance issues and their bodies heal slower.\nWhile it might just be makeup or a minor bruise, these marks are raising questions about the president's health - something worth watching as his physical condition could affect his decisions on South Africa and other global issues.\nImage source: @POTUS\nTrump opens door for Afrikaner resettlement in America\nIt's official - the US is now actively working to bring Afrikaner South Africans to America as refugees.\nThe US Embassy just confirmed they're reviewing applications and will contact people who've already applied. This isn't just Trump talking anymore - it's becoming real policy.\nTrump claims South Africa is \"confiscating\" white farmers' land \"without compensation\" after Ramaphosa signed the Expropriation Act. Most experts say this isn't true, but that hasn't stopped Trump from offering \"a rapid pathway to citizenship\" for these farmers.\nAbout 1,500 Afrikaners have already gathered outside the US Embassy in Pretoria to thank Trump for his support.\nMeanwhile, our government refuses to get into a shouting match with Trump, with Ramaphosa's spokesperson saying South Africa won't engage in \"counterproductive megaphone diplomacy.\"\nThe big question now: How many farmers will actually pack up and leave? And what would that mean for our farms, food security, and race relations?\nImage source: File\nTrump's market panic and what it means for South Africa\nBy Dylan Bettencourt\nThe US stock market just took a nasty dive after Trump twice dodged questions about a recession.\nWhy should you care? Because when America sneezes, South Africa catches a cold. Trump's chaos affects us directly:\n- When global markets panic, the Rand usually weakens\n- Weaker Rand = more expensive imports = higher prices at the shops\n- Foreign investors get nervous about putting money in countries like ours\n- Our exports become less valuable if America's economy slows down\nTrump admitted his policies might cause economic \"pain\" before things get better. His own team is now rushing to calm markets, promising there won't be a recession.\nFor South Africans already struggling with high prices, Trump's unpredictable style is the last thing we need.\nThe big question: Will Trump back down like he did with Canada and Mexico, or stick to his disruptive plans? Either way, as one expert warned: \"Good luck in this challenging time.\"\nImage source: File\nDe Klerk foundation rejects Trump's farmer 'rescue' plan\nBy Dylan Bettencourt\nThe FW de Klerk Foundation has rejected Trump's offer to give US citizenship to white South African farmers.\nTheir message? Trump's plan is based on \"disinformation and cheap politics\" with \"no basis in truth.\"\nChristo van der Rheede put it simply: \"The challenges we face in South Africa aren't just white people's problems. We're all affected by crime, unemployment and bad policies.\"\nThe Foundation warns that Trump's actions will hurt South Africa's economy and farming industry.\nThey also connect Trump's move to the rise of \"ethnic nationalism\" worldwide, suggesting right-wing groups are using this to attack South Africa's non-racial democracy established in 1994.\nMeanwhile, our government won't engage in \"megaphone diplomacy\" - choosing to ignore Trump's social media outbursts rather than dignify them with a response.\nImage source: File\nHealth Minister says Trump 'doesn't' owe us a cent'\nBy Dylan Bettencourt\nHealth Minister Aaron Motsoaledi said \"Trump doesn't owe South Africa any cent whatsoever\" after the US president cut R8 billion in HIV/AIDS funding.\nInstead of complaining, he called on South Africa to \"stand on our own\" and revealed he's already talking to other donors like the Gates Foundation to replace Trump's money.\nEFF's Malema had a different take, claiming the cuts are \"Israel's revenge\" for South Africa's support of Palestine. He also warned that land reform will continue \"whether they like it or not.\"\nMotsoaledi couldn't resist taking a jab at right-wing group Solidarity's recent White House visit, distinguishing them from the COVID Solidarity Fund that's helping fill funding gaps.\nThe bottom line for South Africans living with HIV? The political blame game won't matter if someone doesn't step up to save the program that employs 15,000 healthcare workers and keeps millions of patients alive.\nImage source: @MYANC\nTrump says 'nobody has ever heard of' Lesotho\nTrump just took a cheap shot at our neighbor Lesotho in his Congress speech, calling it a country \"nobody has ever heard of\" while Republican lawmakers laughed along.\nWhy? He was defending his foreign aid cuts, specifically \"$8 million for LGBTQI+\" in Lesotho - though local LGBTQ groups say they never got this money.\nLesotho's Foreign Minister is angry, calling the comments \"shocking\" and promising to send a formal protest to Washington.\nThe real impact? Lesotho has the world's second-highest HIV rate, and Trump's funding cuts threaten healthcare programs that people on both sides of the border rely on.\nFor South Africans, it's perhaps a reminder of how Trump sees African nations - as jokes, not partners.\nImage source: @POTUS\nZelenskyy folds after Trump cuts military aid\nBy Dylan Bettencourt\nTrump just announced he's got a letter from Zelenskyy saying Ukraine is \"ready to come to the negotiating table\" - quite the U-turn after last week's White House showdown.\nAfter getting his military aid cut off, Zelenskyy's now saying he wants to \"make things right\" and is ready \"any time and in any convenient format\" to sign that minerals deal he previously walked away from.\nTrump's also claiming he's had \"serious discussions with Russia\" and received \"strong signals they're ready for peace.\"\nFor South Africans, this drama is worth watching closely. What happens when a superpower suddenly changes sides? We're seeing countries that depend on American support scrambling to adjust.\nIn Trump's world, yesterday's allies can become today's bargaining chips - a lesson that applies just as much to Pretoria as it does to Kyiv.\nImage source: File\nTrump leaves Ukraine stranded\nBy Dylan Bettencourt\nTrump just pulled the plug on Ukraine's military aid after publicly arguing with Zelenskyy. No more weapons, no more ammo - not even stuff that's already on ships heading there.\nIt's the same tactic he used when cutting South Africa's HIV funding. One day you've got support, the next you don't.\nWhen Zelenskyy dared say peace might be \"very, very far away,\" Trump didn't hold back: the Ukrainian president \"won't be around very long\" unless he plays ball.\nThe message for countries like ours is crystal clear: in Trump's world, you either give him what he wants or he'll pull the rug out from under you - no warning, no negotiations.\nSo when South African ministers next fly to Washington, they'd better have more than just goodwill in their briefcases. In Trumpland, it's deal or no deal.\nImage source: File\nTrump vs Zelensky fight in White House Smackdown\nBy Dylan Bettencourt\nTrump and Ukraine's president Zelenskyy argued live on TV and SA analyst Sandile Swana says it's a whole new ballgame.\nGone are the days of friendly military aid. Trump's message was crystal clear: \"No minerals, no protection.\" While Zelensky talked about friendship, Trump talked about business - leaving the Ukrainian leader visibly stunned.\nMeanwhile, the Ukrainian Association of South Africa is urging us not to abandon Ukraine, warning that Putin won't stop his expansion plans anytime soon.\nTrump's \"my way or the highway\" approach could be coming to an international relationship near you.\nUS ambassador quits as SA relations hit rock bottom\nBy Dylan Bettencourt\nIn the latest Trump-era shake-up, Dana Brown, America's acting ambassador to South Africa, has suddenly resigned.\nThis exit happens just as relations hit rock bottom, with Trump cutting all funding to South Africa and offering refugee status to Afrikaner farmers.\nThe timing couldn't be worse for South Africans. With no permanent US ambassador since January and Brown now leaving in March, our diplomatic channel to America is running on skeleton staff just when we need it most.\nMeanwhile, Afrikaner lobby groups AfriForum and Solidarity flew to the White House seeking \"humanitarian assistance\" - a move Ramaphosa slammed as \"sowing divisions.\"\nFor ordinary South Africans, this diplomatic cold war threatens everything from healthcare funding to trade relations, showing how Trump's personal politics directly impacts our national interests.\nImage source: US Embassy\nTrump axes USAID funding for HIV\nBy Dylan Bettencourt\nTrump on Thursday pulled the plug on R8.1 billion in HIV funding, telling South African organisations to \"immediately cease all activities.\" He sent just letters saying the programs \"aren't aligned with Agency priorities.\"\nThis isn't just American politics - it's about your friend, neighbour or family member who depends on these services. Some 8 million South Africans rely on HIV treatment programs, and these cuts threaten real lives in our communities.\nWhile the government scrambles for a response, healthcare workers are losing jobs and vulnerable patients are left hanging. From sex workers to pregnant moms, the impact hits hardest on those who need help most.\nAs one health worker put it to Bhekisasa: \"This isn't just a funding cut - it's a betrayal.\"\nImage source: File\nGauteng minister copies Elon Musk strategy\nBy Zukile Majova\nThe Gauteng health department is checking if all 85,642 people on its payroll are real workers who actually show up for work.\nThe department has already frozen the salaries of 66 workers who haven't come forward to prove they exist.\nHealth MEC Nomantu Nkomo-Ralehoko says her department can't waste money paying ghost workers when hospitals need more staff and patients need care.\n\"We have limited resources at our disposal and cannot afford to waste money on ghost workers while hundreds of healthcare workers are looking for employment and thousands of people require access to healthcare services,\" she said.\nThe department's new Ziveze (Reveal Yourself) Campaign follows a similar move by Elon Musk in America. Musk emailed US government workers asking them to prove what work they've done.\nThe billionaire head of the Trump administration's Department of Government Efficiency said: \"All federal employees will shortly receive an email requesting to understand what they got done last week. Failure to respond will be taken as a resignation.\"\nIn Gauteng, workers must go to their HR office to prove they are real employees. Those who don't show up risk losing their jobs and could face criminal charges.\nSo far, 23,789 workers still need to prove they exist.\nImage source: @NkomoNomantu\nUkraine fights back against Trump's mineral grab\nBy Rorisang Modiba\nTrump's got Zelenskyy flying to Washington on Friday to sign a deal over Ukraine's precious minerals. Trump initially wanted a massive $500bn chunk of Ukraine's resources - imagine someone trying that with our platinum!\nMuch like how South Africans get nervous when foreign companies eye our mineral wealth, Ukrainians weren't having it. Zelenskyy flat-out refused to sign something \"10 generations would have to repay.\"\nNow, they've settled on sharing ownership instead - sound familiar? It's the same dance our government does with mining giants over our resources.\nAs global powers scramble for these battery metals and rare earths, South Africa should watch closely. This is exactly the kind of pressure our mineral-rich country could face next.",
  "word_count": 47070,
  "scraped_at": "2026-02-14T12:13:29.353369"
}