{
  "article_id": "e4ee4113252d",
  "url": "https://www.justarsenal.com/match-preview-arsenal-women-at-west-ham-slegers-issues-warning/399974",
  "title": "Match Preview : Arsenal Women at West Ham , Slegers issues warning",
  "date": "20250912T131500Z",
  "domain": "justarsenal.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Arsenal Women will face West Ham United later today and Renée Slegers has suggested that they will employ a different approach during the fixture. The Gunners head into the second round of the WSL campaign off the back of a thumping victory last time out. The girls rallied from a goal down to dismantle London City Lionesses 4-1 last weekend. Arsenal have a fantastic record against today’s opponents. In fact, only Chelsea (12) have inflicted more defeats on West Ham in the WSL than Arsenal (11). Despite the superb record and excellent form, however, Slegers is still wary of the danger they could pose.\nSlegers wary of the Hammers\n“I think we will need to use other tools in our toolbox tomorrow, but of course, we always have to be prepared for any scenario,” she said in her pre-West Ham Presser.\n“I know historically it has always been a hard game for Arsenal to go to, it is a hard ground. They play a type of football that they believe in and they are very disciplined in the way they do things. But we will have to do that as well.\n“Of course we believe in ourselves and our own qualities but we will go there with humility because we know it is a hard game and we have things to prove for ourselves. So we need to understand the setting and the opposition. But at the end of the day we look a lot at what we want to bring to the game tomorrow and that is what we will focus on.”\nArsenal’s away record on the line\nDid you know: Renée Slegers could become the first Arsenal boss to lose three consecutive WSL away games.\nArsenal Women’s short trip to the Chigwell Construction Stadium in Dagenham will be their first away trip of the campaign. Despite the aforementioned comments, it is hard to think of anything besides an Arsenal win today. As cited earlier, they have an almost flawless record against the Hammers, while their recent win will put them in high spirits ahead of the encounter. In stark contrast, West Ham lost their first game of the season, narrowly losing via a late Bethany England penalty against Tottenham Hotspur.\nFollowing the excellent display on her Arsenal debut, Olivia Smith will be a player to watch today. The Canadian international picked up the Player of the Match award in her previous outing, scoring a stunning goal at the Emirates Stadium. The forward was arguably our most dangerous attacker on the day and she could prove instrumental once again.\nTonight’s match at Chigwell Construction Stadium kick’s off at 7.30PM UK. You can watch the action live on Sky Sports.\nScore prediction in the comments. I’m going for 3-0 to the Gunners!\nBenjamin Kenneth\n__________________________________________________________________________________________\nADMIN COMMENT\nSo here are some simple rules which I must insist commenters follow….\nYou agree not to give any personal abuse to other Arsenal fans. Everyone is allowed to hold their own opinions even if you disagree with them. It COSTS NOTHING TO BE POLITE TO OTHER ARSENAL FANS.\nCALLING ALL ARSENAL FANS! Anyone who would like to contribute an Article or Video opinion piece on JustArsenal, please contact us through this link…",
  "word_count": 539,
  "scraped_at": "2026-02-14T12:23:25.386245"
}