{
  "article_id": "e51ec0a1f658",
  "url": "https://www.90min.com/posts/arsenal-vs-reading-wsl-preview-tv-channel-live-stream-team-news-prediction-12-3-2023",
  "title": "Arsenal vs Reading - WSL preview : TV channel , live stream , team news & prediction",
  "date": "20230310T133000Z",
  "domain": "90min.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Arsenal vs Reading - WSL preview: TV channel, live stream, team news & prediction\nArsenal will look to win their third game in a row against reading ahead of their UEFA Champions League clash with Bayern Munich.\nOff the back of their Conti Cup win against Chelsea, their first trophy in nearly four years, Arsenal defeated Liverpool in the WSL and will look to do the same against Reading.\nThe Gunners are currently fourth in the league, six points behind leaders Manchester United and three back from third place Manchester City with a game in hand on both. Jonas Eidevall's side will be doing all that they can to finish in the top three to get a Champions League spot.\nReading are four points clear of the relegation zone after picking up a win against West Ham last weekend, their first in the league since early December.\nWhere to watch Arsenal vs Reading on TV/live stream\nWhen is kick off? Sunday 12 March, 18:45 (GMT)\nWhere is the match being played? Meadow Park\nTV channel/live stream? Sky Sports Football/Premier League (UK), Paramount+ (US), FA Player (International)\nWhat time does TV coverage start in the UK? 18:30 (GMT)\nReferee? Amy Fearn\nArsenal team news\nSteph Catley has been ruled out of this one, having already missed the midweek win over Liverpool with a contact injury that left her wearing a protective boot and needing crutches.\nThat could help Victoria Pelova keep her place, with Katie McCabe potentially at left-back again.\nReading team news\nDeanne Rose remains a huge miss for Reading after rupturing her Achilles in September.\nLily Woodham was missing from the win over West Ham, a game which also saw January signing Easther Mayi Kith make her WSL debut. Goalkeeper Grace Moloney appears to be back in favour after being dropped for Jacqueline Burns earlier in the season.\nArsenal vs Reading score prediction\nIt will be a tough ask for Arsenal to get ahead of Manchester United, Chelsea and Manchester City for the WSL title. But they are still very much in touching distance of a Champions League spot and picking up points against teams in the bottom half will be crucial.\nThe Gunners breezed past Liverpool earlier in the week with a 2-0 victory, and the expectation is that they will do the same against Reading.",
  "word_count": 388,
  "scraped_at": "2026-02-14T12:21:22.059419"
}