{
  "article_id": "e5275e15d61c",
  "url": "https://www.theirishworld.com/soul-searching/",
  "title": "Soul searching | The Irish World",
  "date": "20251009T124500Z",
  "domain": "theirishworld.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Niall McNamee told David Hennessy about his debut album, forthcoming tour and the forthcoming Saipan film.\nNiall McNamee releases his debut album Glass and Mirrors this Friday.\nThe singer- songwriter/ actor marks the release with a 24-date tour of UK and Ireland.\nThe album also comes ahead of the release of the Roy Keane/ Mick McCarthy film Saipan which Niall plays Republic of Ireland goalkeeper Alan Kelly in.\nNiall has previously featured on hit shows such as Call the Midwife and Bad Sisters and shared the screen with Pierce Brosnan and had a screen fight with none other than Jackie Chan.\nBorn in Leicester, Niall grew up in the Dundalk area although where he was living was nearer to South Armagh.\nMoving to London at aged 17, Niall worked on building sites in the day and played in Irish pubs at night.\nHis talent for acting would soon see him play Romeo in Romeo and Juliet in London’s West End before moving into film and TV.\nA notable appearance with Pierce Brosnan and Jackie Chan in The Foreigner led to his first lead film role in the 2023 award-winning feature film Love Without Walls for which he also wrote the original soundtrack.\nA big soccer fan, Niall has been known to play events for Republic of Ireland Soccer Supporters Club in London. He also had a stint playing GAA with Fulham Irish although he admits that auditions prevented him from togging out too much.\nHe has also played support for London band The BibleCode Sundays, The Wolfe Tones for their final London live show and, more recently, Derek Warfield and the Young Wolfe Tones in The Claddagh Ring. Other supports include Melissa Etheridge and Louis Dunford while festival appearances include Isle of Wight and Cambridge Folk Festival.\nHow does it feel to be talking about a debut album, it’s all been leading up to this, hasn’t it?\n“Absolutely, it’s all led to this.\n“It’s not always my best quality but I have managed to kind of sit back and pat myself on the back a little bit and go, ‘That was hard but you did it’.\n“If I’ve realised anything over the last few years, it is that I love music but I find it painful as well.\n“Without sounding too arty farty about it, it’s a difficult process spiritually but it’s worth it.\n“When you write a song, when you’re singing it, the equivalent to that is crying.\n“Even if it’s a happy song, you are letting something out and it’s definitely always been a way that I can process things.\n“The songs are emotional.\n“They’re stories.\n“They’re all true.\n“They’re all built from memories and stuff so it’s going to have a bit of an effect on you.\n“It makes you relive stuff so for loads of reasons, it’s painful but then when you’re finished, there’s a big release.”\nTwo men you channelled on this album are Shane MacGowan and Christy Moore for the writing of it…\n“I did, yeah.\n“You can hear those things more in hindsight.\n“It’s not like you sit down and go, ‘Right, I’m gonna write a song like them’, but I can’t deny growing up listening to them and the storytelling.\n“There’s a lot to be said for when you have something you want to say in a song and imagining how they would say it.\n“You’ll never get close is the reality of it.\n“They’re geniuses, huge inspiration.\n“Thank God for those heroes.\n“I just think they made music that mattered.\n“We live in a world now where clothes and phones and everything we have is so disposable. TikTok videos last 30 seconds and that’s it, no one watches them again.\n“I wanted to write something that will stand the test of time.”\nThe opening song is Clapham Wine. It was inspired by a friend’s horrendous break up, isn’t that right?\n“My friend was going out with a fella who dumped him.\n“It was kind of a shock dump and then he kind of turned into a bit of a lunatic and started telling my friend that he was meeting other people and saying that he was going to go on a date and saying it was in Clapham which is where my friend lived.\n“His fella lived on the other side of London and didn’t need to be in Clapham but he sounded like he went on a date as close to his ex’s house as possible.\n“And naturally when he told me I was like, ‘So sorry for your loss, would you mind if I wrote a song about that?’\n“And he was actually delighted.\n“He said it was his Adele moment.\n“I’ve kind of been shocked that, in some ways, Clapham Wine is the most listened to song now even above Magpie with a Mullet.\n“But Clapham Wine seems to really hit with people which is good because when I wrote it, I was told by a couple of people that I shouldn’t call it Clapham Wine because it’s quite specific and if you’re not from London, you might not know what Clapham is.\n“But I was like, ‘Well, that’s where it was and that’s what it is’.\n“Again, without sounding too arty farty, I don’t feel like I have a lot of decisions on what songs are.\n“It is Clapham Wine.\n“Change it to London Wine, it’s a different song.\n“That wasn’t what it was.\n“It’s not about London, it’s about Clapham.”\nMagpie with a Mullet was a song that did great things for you, wasn’t it?\n“Yeah, game changer.\n“I released songs before and people liked them and stuff but Magpie, in hindsight, was definitely a game changer. People just connected with it.\n“When I went to gig at the Irish Cultural Centre in Hammersmith, I hadn’t released it yet but I put up little videos on Instagram and by the time I got to the gig, people already knew it and I thought, ‘That’s a good sign’.\n“The version that was out before the album is literally the live version from that gig at the ICC.\n“It went down so well and it sounded so great that there was something really daunting about re-recording it in a studio because I was like, ‘Will this ever get to the same level’?\n“But that’s why it’s more traddy and a bit more acoustic, it had to be different.\n“I’m not scared of redoing songs and putting out different versions.\n“There will definitely be songs that I’ve recorded and released that I will do a new version of because some of them need updating and sometimes, if it’s worth it, you go, ‘I want to have another go with that’.”\nClones Fireman, about how your grandparents met, was one of the first songs you ever wrote, wasn’t it?\n“Yeah, I wrote that when I was about 16 or 17 about my grandfather meeting my grandmother and going off to Birmingham and stuff.\n“I never played it to my grandad.\n“He worked on the building sites and he worked on the trains and he was a great man but I don’t know what he would do with the information that his grandson had written a song about his life.\n“I think he would find it a bit embarrassing.\n“He’d probably say, ‘Get a job’.\n“But also, I never played it to him because that story has been told through the generations of our family and you would hate for him to hear it and go, ‘Oh no, actually, that bit didn’t happen’.\n“Because one thing I always say is that my grandad was a bit of a fibber.\n“He used to tell me little lies just to wind me up, and I used to believe him.\n“I asked him once why Ireland weren’t in World War Two and he told me that we didn’t qualify, and I believed him because we didn’t qualify for anything.\n“His name was Chris O’Connor and he told me that when he was young, he was so poor that he didn’t have a surname and he bought O’Connor with his first pay cheque because O’Connor was the cheapest name you could buy and that’s why there’s so many of them.\n“I love that song.\n“He was such a great bloke.\n“I suppose you can write songs about the historical figures and Michael Collins and all that but that doesn’t mean to say that a man who worked hard his whole life and just did his best doesn’t deserve his own tribute as well.”\nWhat is the meaning of Glass and Mirrors for you? It’s obviously very significant as you gave it as a working title when we spoke last year..\n“I wrote Glass and Mirrors when I was in a really bad place.\n“Glass and Mirrors was a really dark moment.\n“There is an element to Glass and Mirrors which I think reflects something in me that maybe I don’t really show. I do have issues with mental health sometimes and I don’t really talk about it.\n“I was sat at a piano and the piano happened to have a load of awards on it.\n“Some of them were trophies from football, some of them were belonging to other people.\n“Some of them were made of glass and then next to them there were things that were made of silver and they reflected.\n“I wrote it in lockdown and it just felt like everything was going wrong and everything was going in the wrong direction and I was never going to get anywhere near the happiness that I wanted, or the dreams.\n“I saw myself reflected back in these awards that I felt I was doomed to never get near, they symbolised something to me and the song kind of came out really naturally.\n“That’s what Glass and Mirrors represents, two sides and a mixture of feelings.\n“Everyone has that.\n“Everyone has a side they keep more hidden and a side that is for show and it was my way of getting that side out and then you’ve got Man Complete which is the other side of that which is the release and the moment you come out of it.\n“All of the songs are about a situation or a time in my life and even the good ones, those good feelings stopped once and the bad feelings stopped as well so it will serve as a reminder that whatever I’m in, whether it be good or bad, it will switch over again, and that’s okay.”\nTell us about Saipan, the film that you are in with Éanna Hardwicke and Steve Coogan..\n“I loved it.\n“I absolutely love soccer.\n“The thing that’s so painful about the Irish team doing so badly at the moment is we, as a culture, attach so much joy and history and memory from what that Irish team did for us as a country.\n“Jack Charlton changed the country in the same level that U2 did, or Thin Lizzy, these big cultural moments.\n“And it’s sad because at the moment it seems that outside of soccer, everything else is in the right direction for Irishness.\n“The music seems better than ever in terms of bands coming out of Ireland.\n“In acting Cillian Murphy, Paul Mescal, Anto Boyle, who’s a good friend of mine, is flying.\n“The soccer team need to catch up with that.\n“I was only little but I remember the excitement that was around (in 2002).\n“Éanna Hardwicke is just such a good actor and he’s such a lovely fella.\n“He was not only Roy and the captain of the team in the movie, he was the captain of the movie.\n“I’ve known Éanna a while so I always knew that.\n“And him and Steve Coogan were just amazing.\n“I got to know Alan Kelly really well. He’s come to a gig or two and we keep in touch.\n“That’s a new friendship in my life that I really value. He’s such a lovely man and we were gigging in Bury last year and he came and brought all his family and we got to hang out.\n“It felt really special.\n“I love Steve Coogan.\n“When you get a job like that, you can do your preparation but before you know it, you’re on set with Steve Coogan and you’re doing the scene and you kind of just get on with it.\n“I think Irish fans will love it.\n“I think one thing that is really in hindsight is would everything have gone differently in the argument if someone could come to them from the future and go, ‘I’m from 2025, this is the last World Cup you’ll be in for a while, lads. No one’s got another chance at this’.\n“Robbie Keane and Damien Duff were really young.\n“That was their only World Cup but would Roy have acted differently if someone was to say to him, ‘There’s not another one in four years, Roy. This is it’.\n“In hindsight that makes it a bigger issue.\n“I know we’ve been to the Euros and stuff but if we’d been in three World Cups or two since then and done quite well, that story would have disappeared a little bit, wouldn’t it?\n“I don’t know if the movie would be made.\n“I think there’s probably a consciousness in the movie that, ‘This was your chance’.\n“We should have beaten Spain that day, would football be different in Ireland now if we had?\n“There’s no doubt in England watching the Lionesses and stuff, that’s had a massive impact on the young women coming through playing soccer in England so it does have effect on the youth.”\nYou led the tributes to the Irish publican Brendan Connolly who passed away earlier this year..\n“I was very sad about that.\n“He was so good with me when I moved over.\n“I suppose the only thing you can take away from a tragic, sudden loss like that is that there was so much love in that room.\n“I realised when we were at the funeral and at the drinks after at Connolly’s just how many people he brought together, the amount of people that I knew.\n“It was really apparent to me at his funeral that there were so many people in my life that I wouldn’t know if it wasn’t for Brendan.\n“He paid for the programmes for a gig I did and was always there to help.\n“He was always supportive.\n“There’s people in my life that I always wanted to impress and when I was working on the building sites and coming in for pints and saying hello to Brendan and catching him up on everything, there was the feeling that if things ever went well, I wanted to bring that back to Connolly’s and make him proud.\n“Massive loss.\n“I think over the next year or two, and as time goes on, we’ll start to realise even more a big hole he’s kind of left in the circle of that world, the Irish in London, the pub game, the football and all that.”\nNiall McNamee’s debut album Glass and Mirrors is out 10 October 2025.\nHe tours UK and Ireland from 16 October- 6 December finishing at Oslo in London.\nFor more information, click here.\nSaipan is out in January.",
  "word_count": 2561,
  "scraped_at": "2026-02-14T13:06:55.476629"
}