{
  "article_id": "e529729f2607",
  "url": "https://www.justarsenal.com/heres-how-i-think-arsenal-can-beat-chelsea-in-the-womens-conti-cup-final-what-do-you-think/363205",
  "title": "Here how I think Arsenal can beat Chelsea in the Women Conti Cup final - what do you think ? ",
  "date": "20240328T190000Z",
  "domain": "justarsenal.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Our Arsenal Women will face off against London rivals Chelsea, on Sunday, in the Continental Cup final. We have a long history in the competition, and a great history at that, winning the cup 6 times in the past, and have been in 10 finals out of the 13 that have ever been played. It’s definitely our Gunners competition, and on Sunday we will hopefully get our names on the trophy for the 7th time. The match is being played at Wolverhampton’s Molineux Stadium, on Sunday 31st March, kick-off 3PM UK.\nTickets are still available to purchase, but if you can’t make the game in person, it will be broadcast live in the UK on BBC2 (except in Northern Ireland) and also available on the BBC Sport website and BBC iPlayer, with coverage starting at 2.30pm.\nIt will also be available for international supporters to watch on the FA Player.\nPlaying against Chelsea is never easy as they’re a great team, with a great manager, but we have proved this season that we can beat them, after we smashed the Blues at the Emirates in December 4-1, but considering they just beat us too at Stamford bridge 3-1, Jonas Eidevall is going to have to be tactical and work out a system that will be able to get past them.\nI said it before we faced them last, that we would have to surprise Hayes and her Chelsea team, and do something they’re not used to, and for me it could be as simple as playing both Alessia Russo and Stina Blackstenius together.\nIt’s worked in the past against teams, and I think Chelsea will be expecting us to line up almost the same as we did the last time we met. But they clearly caught us napping, and without a full half of football playey the game already looked gone, and if it wasn’t for a lucky deflection goal in the dying minutes, the Blues would have walked away 3-0, so for me, we need fire power.\nRusso has been good this season and loves to play against Chelsea, having some great moments when she was at Manchester United, and managed to bag two goals in our 4-1 win against Chelsea at home. She’s definitely got to start and also, knowing a lot of the girls in the Chelsea squad and how they play, because of the England squad is definitely a plus. She’s not only a proper goal scorer but she also tracks back, and helps out defending from the front, so I think she will start up front.\nI’d like to see Blackstenius in the high midfield/false 9 role just behind Russo. I think that gives us the extra fire power to go forward, and look lethal in attack. People may disagree, but I think this would take Chelsea off guard and could give us a great chance in winning the final.\nTactically, for me, things need to be changed for this game and, with the WSL title now looking out of sight, I’d say we need to find a way to dig deep and win this. We have plenty of experience winning it, and without the Cup this season it would feel like a bitter disappointment..\nWhat’s your thoughts Gooners?\nDaisy Mae\nFollow JustArsenal’s Gooner Women on Just Gooner Women on Twitter for regular updates on the Arsenal Womens Team!\nDo you want to read more about the Arsenal Women’s Team? Click here….",
  "word_count": 577,
  "scraped_at": "2026-02-14T12:22:19.171030"
}