{
  "article_id": "e52f511e7ec1",
  "url": "http://africa.chinadaily.com.cn/a/202507/29/WS68882aa5a310c26fd717c3bf.html",
  "title": "Kelly delivers England a second European crown",
  "date": "20250729T064500Z",
  "domain": "africa.chinadaily.com.cn",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Kelly delivers England a second European crown\nDefending champion beats Spain on penalties in gritty victory\nBASEL, Switzerland — Chloe Kelly converted the decisive spotkick to help England win 3-1 on penalties, defeating Spain to lift the Women's Euro 2025 trophy on Sunday. The game had finished 1-1 at the end of extra time, allowing the Lionesses to avenge their defeat to La Roja in the World Cup final two years ago and retain their continental crown.\nIt looked as though Spain would repeat its Sydney 2023 victory over England, as it dominated the game at St Jakob-Park in Basel and took the lead through Mariona Caldentey's first-half header.\nBut, England, did not panic, having already trailed against both Sweden in the quarterfinals and Italy in the semis before finding a way to win.\nAlessia Russo headed in its equalizer just before the hour mark, and no further goals meant a shootout in which Kelly — who once again had a huge impact off the bench — netted the winner.\n\"I was cool, I was composed. I knew I was going to hit the back of the net,\" Kelly told the BBC of her penalty.\nIt was an agonizing way to lose for Spain, but it failed to score three of its spot-kicks, with reigning Ballon d'Or holder Aitana Bonmati seeing her effort saved.\nIt meant that Sarina Wiegman's England became back-to-back European champion, three years after it defeated Germany in extra time at Wembley to claim its first major women's tournament title — also thanks to a Kelly winner.\n\"What a team. What a game. What drama. You dug deep when it mattered most and you've made the nation proud. History makers,\" British Prime Minister Keir Starmer, who was at the match, wrote on X.\nDefeating Spain helps make up for the pain of losing the World Cup final in 2023, and England's victory also confirms Wiegman's place among the coaching greats.\nShe has now won three consecutive European Championships, having led her native Netherlands to victory in 2017 before doing the same with England three years ago.\n\"We said we can win by any means, and that's what we have shown again today. I am so proud of the team and the staff. It is incredible,\" said Wiegman, whose team lost to France in its first match at the tournament.\n\"Losing your first game and becoming European champions is incredible,\" she added.\nSpain fell short in its quest to add a maiden Euros title to the World Cup it won in Australia.\nLa Roja dominated possession as expected, but ultimately paid the price for not killing the game off against an England side that never knows when it is beaten.\n\"I am in shock,\" Bonmati told broadcaster TVE before apologizing for failing from the spot.\n\"Football is cruel. Everything seems bad right now, but I believe we played the best football of the tournament.\"\nEngland, meanwhile, had been 2-0 down against Sweden in the last eight before scoring twice to force extra time, and won on penalties.\nThen, substitute Michelle Agyemang's 96th-minute equalizer denied Italy in the semifinals, when Kelly netted the extra-time winner.\nWiegman took a gamble here on the fitness of Lauren James, which paid off, albeit not quite as planned — having come off with an ankle injury against Italy. The Chelsea winger, though, did not last until halftime and was replaced by Kelly.\nBy that point, Spain was in front, scoring when Ona Batlle crossed from the right for Caldentey to head home.\nIt had already been in control before that, and it felt like England's best hope was for a moment of complacency from its opponent.\nThat moment nearly came with the game still goalless, when Spanish keeper Cata Coll played a careless short pass to Laia Aleixandri in her own area.\nLauren Hemp was alive to the opportunity and pounced, but Coll made the save.\nYet, even at 1-0, England was still in the game, and it took its chance in the 57th minute when Kelly crossed from the left for Russo to level.\nEngland — with more fans on its side in the crowd of 34,203 — sensed yet another comeback win was on the cards, and it took Coll's fingertips to keep out another Kelly effort.\nThe game continued into extra time, and from there to the gripping tension of penalties, in which Beth Mead's first kick for England was saved after she was forced to retake.\nCaptain Leah Williamson also had her effort stopped by Coll, but Alex Greenwood and Niamh Charles both scored, while Patri Guijarro was Spain's only successful player from the spot, before Kelly's effort sealed the win.\nAFP\nMost Popular\n- Guangdong beats Macao 2-0 in first leg of soccer cup\n- Para teams set to leave mark on ice\n- US skier Johnson wins women's downhill as Vonn crashes at Milan-Cortina Games\n- Su Yiming clinches first medal at Milano-Cortina\n- Over 300 athletes from 35 countries and regions kick off Asian championships in Tianjin\n- Legacy of Beijing 2022 lives on as Milan welcomes Games",
  "word_count": 852,
  "scraped_at": "2026-02-14T12:58:37.394677"
}