{
  "article_id": "e533298a8ddc",
  "url": "https://www.bbc.co.uk/sport/football/67109044",
  "title": "Aston Villa 2 - 4 Tottenham Hotspur : Spurs go top of Women Super League thanks to Thomas hat - trick",
  "date": "20231021T153000Z",
  "domain": "bbc.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Aston Villa 2-4 Tottenham Hotspur: Thomas hat-trick helps 'brave' Spurs beat Villa\n- Published\n- comments\nWomen's Super League top scorer Martha Thomas scored an exquisite hat-trick as Tottenham condemned Aston Villa to four league defeats out of four this season and earned praise from manager Robert Vilahamn for playing \"the Tottenham way\".\nEngland forward Rachel Daly netted a fifth-minute penalty to put the hosts ahead, but Thomas drew Spurs level in sensational style when she won possession from Scotland team-mate Rachel Corsie and angled a long-range chip over goalkeeper Rebecca Spencer.\nAshleigh Neville then headed the visitors in front at Bescot Stadium on the stroke of half-time from Jessica Naz's arrowed cross.\nThomas personified Spurs' confidence by striking twice with fine goals from the edge of the box after the break, ensuring they moved two points clear of Leicester City and Chelsea, with a third consecutive win.\n\"You can see we have really good character in this group,\" said Vilahamn.\n\"We know how to keep going. You can see how brave we are in the build-up, how we play in the Tottenham way. That's also a big step for us.\"\nManchester City's win over Leicester at King Power Stadium in the only other WSL game on Saturday meant Spurs finished the day second, while reigning champions Chelsea also have the chance to overtake them when they host Brighton & Hove Albion on Sunday.\nVilla, who scored a second when Lucy Parker nodded her first goal for the club in second-half added time, remain second-bottom because Bristol City, who are also without a point, have an inferior goal difference.\nCarla Ward's side return to action when they host Chelsea on 4 November, while Spurs are at home to Everton the following day.\nThomas takes Tottenham top\nStriker Thomas has had a prolific start to life at Tottenham since joining from Manchester United in September, and her audacious opener from well outside the box was a splendid way to become the outright top scorer in the WSL.\nJust as she did at Brighton six days earlier, the 27-year-old levelled after Spurs had conceded an early goal - and her tenacity and willing running also helped them pose a persistent threat, coupled with her two other finishes to put this contest to bed.\nTipped to challenge for a top-four spot by some before the start of the season, Villa's third spurning of a lead this term came after Eveliina Summanen's late challenge on Adriana Leon allowed Daly to convert from the spot.\nEbony Salmon's curling shot was tipped behind by goalkeeper Daphne Van Domselaar as Villa pressed for a second early on, but their failure to turn momentum into goals proved costly and they could not hold off an irresistible attacking display from their opponents - especially Thomas.\n\"We score a lot of goals and that's what we want to do,\" added Vilahamn.\n\"It's a joy to watch them.\"\nCould the death penalty ever die out? Join Livvy Haydock as she takes us deep into Death Row in the USA\nWhat happens when you get too close to Madonna's fire? Annie and Nick share their experience of the opening night of The Celebration Tour",
  "word_count": 532,
  "scraped_at": "2026-02-14T12:22:17.047985"
}