{
  "article_id": "e5508d1db007",
  "url": "https://www.inverness-courier.co.uk/news/national/mary-earps-says-bring-it-on-ahead-of-fa-cup-final-after-receiving-mbe-106569/",
  "title": "Mary Earps says  bring it on  ahead of FA Cup final after receiving MBE",
  "date": "20240508T151500Z",
  "domain": "inverness-courier.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Mary Earps says ‘bring it on’ ahead of FA Cup final after receiving MBE\nMary Earps has said this weekend’s Women’s FA Cup final will be the “highlight” of her football season, adding: “Bring it on.”\nThe Manchester United and England goalkeeper was made an MBE for services to football during an investiture ceremony conducted by the Prince of Wales at Windsor Castle on Wednesday.\nSpeaking afterwards to the PA news agency, the 31-year-old said she was “very prepared” for Sunday’s final against Tottenham.\nShe said: “I’m very prepared for it, very up for it and really looking forward to it. It’s only a few days away so bring it on.\n“It’ll be the highlight of the season, for sure, by a million miles.”\nEarps was a key part of the Lionesses side which reached the Women’s 2023 World Cup final, winning Fifa’s Golden Glove award for the best goalkeeper at the tournament, and was also part of the team that won the Euros in 2022.\nEarps said she believed it would be “tough” for the Lionesses to retain the Women’s Euros title in 2025.\n“I think you can see from the World Cup and even the Euros when we won it in 2022, the competition gets tougher every single year,” she said.\n“But I think we’ve got a fantastic team and I have every belief in the quality of the girls individually and collectively even more.\n“So, I think if we prepare right and go through what we need to do in terms of our preparation to make sure we’re performing at the highest level possible, I have every confidence that we will be there again – we’ve got to earn it though.”\nEarps was crowned BBC Sports Personality of the Year in 2023, and also drew praise after she spoke out about sportswear manufacturer Nike’s failure to offer an England goalkeeper’s replica jersey for sale before the World Cup – which later sold out in minutes.\nMore than 150,000 people signed a Change.org petition which called on Nike to release the shirt.\nSpeaking about her newfound popularity, she said: “I just think that it’s amazing when people want to have a conversation with you and talk about their experience of something that I’ve done, helped them with or inspired in some way.\n“But us, as a group of Lionesses, what we stand for – our values – I think is so strong that it resonates with people. That’s a pretty incredible feeling and something that we’ll continue to try and do as a team.”\nShe described the growth of women’s football as “amazing”, and said she has gratitude to “stand on the shoulders” of female footballers who came before her.\nShe added: “I think there’s still a lot of hard work to do.\n“I think that’s what we’re focused on, it’s the absolute recognition of how far we’ve come and that gratitude. Standing on the shoulders of the people who’ve worked before us and hopefully the future generations can stand on our shoulders as well.\n“It’s continuously everybody involved in the game just continuing to try and push it in the right direction… long may it continue.”",
  "word_count": 529,
  "scraped_at": "2026-02-14T13:04:53.037993"
}