{
  "article_id": "e56c151cb43f",
  "url": "https://www.oregonlive.com/portland-thorns/2023/08/portland-thorns-sale-on-track-to-finish-by-end-of-year-multiple-prospective-buyers-advance-in-process.html",
  "title": "Portland Thorns sale on track to finish by end of year , multiple prospective buyers advance in process",
  "date": "20230802T143000Z",
  "domain": "oregonlive.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "The sale of the Portland Thorns is on track to be completed by the end of 2023, with multiple prospective buyers advancing in the process, Timbers and Thorns CEO Heather Davis confirmed to The Oregonian/OregonLive on Tuesday.\nIn an exclusive interview, Davis went in-depth on a process that had been kept under wraps in the eight months since Merritt Paulson stepped down as club CEO and announced he would sell the National Women’s Soccer League team.\n“We started this process right after we announced the sale late last year,” Davis said from her Providence Park office located next door to Paulson’s. “Our first step was engaging an investment bank. Our bank is BDT Capital. They have been running the process for us in collaboration with all of us at the club.”\nBDT Capital put together sales materials for prospective buyers along with a confidential information memorandum, which provides buyers information about the club’s current and past financials and future financial projections for both the team and league.\nBDT Capital has done work for PTFC and the Paulson family before, Davis said. And Hank Paulson — Merritt’s father and the former CEO of Goldman Sachs — has extensive connections in the finance world. The firm recently facilitated the sale of approximately $100 million in shares of sports apparel giant Under Armour by its founder and executive chairman, Kevin Plank.\nIn the Thorns sale, BDT Capital has handled the identification of and communication with prospective buyers through their legal representation.\n“They have all the initial conversations with prospective purchasers and do all the due diligence to determine that anyone who is interested in buying the Thorns has the infrastructure and capital that will be viable,” Davis explained. “Buyers that pass that first stage will move into what is called the diligence data room, which the bank will have helped all of us set up. That gathers all of our material contracts, financials, all of the legal and financial diligence that buyers will want to do.”\nOne prospective ownership group that did not meet the threshold for consideration was a collection of women-led investors, including former Nike executive Melanie Strong, that has been the only interested party revealed publicly to date.\nOne of the principal investors of that group, Sue Levin, the chief marketing officer for Bolt Threads, said the group’s bid had “more than enough” capital to complete the transaction but was not seriously considered. She said she felt the process was confusing and a waste of the group’s time and money.\n“We had a group of serious, deep-pocketed backers who were represented by a law firm that has done several multi-billion dollar sports transactions,” Levin said. “The current owner did not choose to engage with us, and he made a series of changes to the qualification threshold during the period of discussion with us, in order to prevent us from entering a bid. We concluded that either this was a nonsensical process or he was not interested in selling to us. And we moved on.”\nHowever, a source with knowledge of the sale process told The Oregonian/OregonLive that the Strong-led group “did not have the ownership or capital structure” that would have been approved by the NWSL or been able to sustain and grow the Thorns in perpetuity. The group withdrew from the process as a result.\nDavis, who noted that she can’t comment on specific buyers or the details of their bids, said significant investment will be required by the Thorns’ next owners as the NWSL continues to grow at a rapid pace. What’s more, the league privately has expressed an expectation in terms of a controlling owner’s net worth.\nA potential price for the Thorns, shared with The Oregonian/OregonLive last December, was upwards of $60 million. Davis could not discuss specific numbers Tuesday, however, as negotiations with multiple prospective buyers are ongoing. She added that far more investment goes into operating NWSL clubs than just paying the up-front sale price.\n“Our priority is finding the right owners for the club,” Davis said. “And for us, that means first and foremost owners who have the capital and commitment to invest in the Thorns, to keep them at the level we expect which is one of the top teams in NWSL and the world. That is a key consideration, and we are also looking for owners who are committed to partnering with the Timbers to create a positive impact here in Portland.\n“Significant investment is going to be required in the next few years to meet the growth rate of the league and the expectations of the league and players. If you look at who has invested in NWSL teams recently, they have been some very high net worth individuals. Between Bay FC, the owners in Washington and San Diego, you have near-billionaires and multi-billionaires in some instances. That is the level this league is generally looking for. But there is no actual dollar threshold.”\nA major differentiating factor for prospective buyers who have met the criteria for advancement is a commitment to invest in a dedicated training facility for the Thorns. A team source confirmed to The Oregonian/OregonLive last month that the club has identified two potential sites in Portland for the facility, which Davis said the future owners would be responsible for funding.\nThat facility is currently targeting an early 2025 opening, Davis said.\n“We’ve been looking at opportunities to build the Thorns their own training facility for a while,” Davis said. “Just given timelines, construction and permitting timelines alone, we felt it was important to continue to push that process forward as much as we could. The new owners will have some options at their disposal that they can then make final decisions on and proceed with the build and construction process.”\nFans and the Portland soccer community have been famished for updates on the Thorns sale since Paulson announced he would sell the club. Behind the scenes, it has steadily progressed. Davis, who spent nine years as general counsel for the NFL, said the sale process is moving at what she believes is a normal pace for professional sports — despite the challenge of untangling the Thorns from the Timbers after 11 years under the same business umbrella.\nBut the commitment from the club remains. Davis said the Thorns will have an entirely new ownership group in the coming months, and will continue to play their matches in front of raucous crowds at Providence Park in what executives said they hope is a seamless transition — particularly for players.\n“We have multiple prospective buyers who are conducting diligence, and our goal is to close the transaction by the end of 2023,” Davis said. “Based on where we are now, that is certainly achievable. The transaction has proceeded at the pace I would have expected based on my experience in this space.”\n-- Ryan Clarke, rclarke@oregonian.com, Twitter: @RyanTClarke",
  "word_count": 1150,
  "scraped_at": "2026-02-14T12:16:40.550815"
}