{
  "article_id": "e5892acd96e6",
  "url": "https://www.bostonherald.com/2024/12/10/bostons-expensive-white-stadium-renovation-at-franklin-park-hits-another-roadblock/",
  "title": "Boston expensive White Stadium renovation at Franklin Park hits another roadblock",
  "date": "20241211T001500Z",
  "domain": "bostonherald.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "A group of residents surrounding Franklin Park has secured more time to gather evidence to back up their argument that the planned White Stadium renovation violates the state constitution by illegally transferring public trust land to private use.\nState Superior Court Judge Julie Green is providing project opponents more time to gather evidence they believe is being withheld from them, review documents, and conduct depositions ahead of an anticipated trial scheduled for March 18.\nGreen denied a request from the plaintiffs for the trial to be pushed back.\nThe rulings come as the project cost has swelled to roughly $200 million, more than double the initial estimate that Boston Unity Soccer Partners, an all-female ownership group behind the city’s new women’s soccer team, provided in the summer of 2023.\nTaxpayers are now expected to pay $91 million, up from the $50 million initially proposed.\n“Seemingly every day, damning new details are coming out about the plan to demolish White Stadium and build a massive professional sports complex in its place,” Jamaica Plain resident Melissa Hamel said in a statement after Tuesday’s ruling.\nHamel is part of “Franklin Park Defenders,” a group of 21 residents who live near Franklin Park and the nonprofit advocacy group, Emerald Necklace Conservancy, which has sued the city, alleging the endeavor would “illegally transfer the public trust lands” to “a private party.”\nBOS Nation Football Club, which won an expansion bid in September 2023 to join the National Women’s Soccer League, is expected to take the pitch at White Stadium for the 2026 season.\n“The judge’s ruling to firmly uphold the March trial date is a significant win against the Emerald Necklace Conservancy’s efforts to derail the revitalization of White Stadium,” the team said in a statement shared with the Herald on Wednesday. “We remain confident that there is no legal foundation for this case, and it is clear that the plaintiff’s sole intent is to employ delay tactics. We look forward to resolving this frivolous lawsuit in March.”\nSuffolk Superior Court Justice Sarah Ellis tossed out motions last March for a temporary restraining order, or preliminary injunction — measures the plaintiffs desired to prevent additional steps from being taken in the massive project.\nRenovations at the dilapidated park and stadium — where half of the grandstands were burned out from a fire decades ago— would triple the number of hours the stadium could be used, 90% of which would be dedicated to Boston Public School student-athletes and the community, project proponents have said.\nThe city’s Public Facilities Commission unveiled the huge cost overruns during a Nov. 20 meeting.\n“Today we are more confident than ever that Franklin Park will be protected from their scheme to turn this historic parkland into a colossal sports and entertainment complex,” said Renee Stacy Welsh, an Egleston Square resident and member of the Franklin Park Defenders. The question is: how much more money will Boston’s taxpayers funnel into this fatally-flawed privatization plan before it collapses?”",
  "word_count": 495,
  "scraped_at": "2026-02-14T13:16:55.820258"
}