{
  "article_id": "e58fac3819f4",
  "url": "https://nymag.com/intelligencer/article/who-are-the-newly-revealed-jeffrey-epstein-associates.html",
  "title": "Who Are the Newly Revealed Jeffrey Epstein Associates ? ",
  "date": "20240328T221500Z",
  "domain": "nymag.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "All these years later, the list of prominent people who were somehow connected to Jeffrey Epstein continues to grow — including some whose ties to the notorious sex trafficker and longtime hobnobber were previously unknown. In 2019, New York published an exhaustive alphabetical list of Epstein’s alleged high-society contacts according to public documents available at the time. Below, we’ve adapted and expanded that list to include the many more names and details that have emerged in the various Epstein files, including his private schedules, his infamous birthday book, the files haphazardly released by the Justice Department under the Epstein Files Transparency Act, and his personal documents, messages, and photographs that have been released by the House Oversight Committee. (Inclusion on this list means only that the person has been somehow linked to Epstein, not that they were necessarily involved in or aware of his crimes.)\nWe are still updating this guide as we learn more about what’s in the Justice Department’s massive recent file dump. Click these names to skip down to some of the biggest names in the list, as well as some of the entries that have been recently added or expanded: Woody Allen, Steve Bannon, Ehud Barak, Sultan Ahmed bin Sulayem, Richard Branson, Deepak Chopra, Andrew Farkas, Bill Gates, Reid Hoffman, Brad Karp, Howard Lutnick, Peter Mandelson, Elon Musk, Kathryn Ruemmler, Peter Thiel, Steve Tisch, Michael Wolff, and Leslie Wexner. Our separate guide to how Donald Trump appears in the Epstein files is here.\nWoody Allen: Director\nEpstein was longtime friends with Allen and his wife, Soon-Yi Previn. From our 2019 guide:\nEpstein kept a photo of his friend Allen, the sexual pariah, on his wall and was photographed walking with him on the Upper East Side. They had more than a neighborhood in common. For years before his relationship with Mia Farrow, Allen had carried on with a 16-year-old girl he’d met at Elaine’s named Babi Christina Engelhardt. In an interview with The Hollywood Reporter, she wondered if she was the inspiration for Manhattan, Allen’s 1979 movie about a man in his 40s who dates a high-school student, which was nominated for two Academy Awards. Engelhardt had sex with Allen more than 100 times, she says, sometimes with Farrow. “The whole thing was a game that was being operated solely by Woody so we never quite knew where we stood,” she said. Engelhardt went on to become Epstein’s assistant.\nDocuments released by the Justice Department detail Epstein’s extensive relationship with Allen and his wife, Soon-Yi Previn, who sought and received Epstein’s help with their daughters’ educations, and how in 2016, Epstein, at their request, donated $15,000 to the elite K–12 Hewitt School where their teenage daughter Manzie was enrolled.\nAnil Ambani: Indian businessman\nIn 2008, Forbes ranked the Reliance Group chairman, who also briefly served as a member of India’s parliament, as the sixth richest person in the world, but a dramatic business downfall wiped out nearly all of his net worth since then. According to the Justice Department files, Epstein and Ambani first linked up in early 2017 by way of Sultan Ahmed bin Sulayem, and soon after Ambani told Epstein that “leadership” wanted to set up meetings with Trump advisers Steve Bannon and Jared Kushner ahead of a possible U.S. visit by Indian prime minister Narendra Modi. They corresponded periodically until months before Epstein’s sex trafficking indictment, discussing world affairs, the Trump administration and the Modi government, and at least a few times, what kind of women Ambani liked. They met in person at least once, in New York in May 2019; Epstein claimed to Bannon that Ambani was someone Modi had sent to talk to him.\nRon Altbach: Keyboardist, co-founder of the rock band King Harvest\nContributor to Epstein’s birthday book.\nCharles Althorp: Princess Diana’s brother\nName found in Epstein’s black book.\nEva Andersson-Dubin, M.D.: Doctor and former Miss Sweden\nName found on Epstein’s private-jet log.\nAs our guide noted in 2019:\nEpstein’s ex-girlfriend and her husband, billionaire hedge funder Glenn Dubin, had Epstein over for Thanksgiving dinner in 2009, telling his probation officer they were “100 percent comfortable” with his being around their teenage daughter, Insider reported. She also created a foundation so Epstein could donate to her breast-cancer charity without attaching his name. “The Dubins are horrified by the new allegations against Jeffrey Epstein,” they said in a statement. “Had they been aware of the vile and unspeakable conduct described in these new allegations, they would have cut off all ties and certainly never have allowed their children to be in his presence.”\nJosé María Aznar: Former prime minister of Spain\nAccording to FedEx receipts included in the DOJ’s Epstein files, Aznar was the recipient of two packages from Epstein and Maxwell. One, addressed to Aznar and his wife, was sent to their official residence in September 2003 while he was still the Spanish prime minister. The other was sent in May 2004, after Aznar had left office, to him at his think tank. There is no information on the receipts indicating what the packages contained. There is also an October 2003 payment to a travel agent that includes Aznar’s name, but that also could have been Aznar’s son, who shares the same name. The DOJ files include an April 2004 email from Aznar’s son to a redacted recipient that appears to share the address of his father’s think tank. A spokesperson for the former prime minister has said that Aznar doesn’t know what the packages were and that he did not know Epstein.\nVittorio Assaf: Restaurateur\nName found in Epstein’s black book.\nPeter Attia: Longevity influencer\nDocuments released by the Justice Department include more than 1,700 mentions of Peter Attia, a physician, a biohacker, and the author of the 2023 best seller Outlive: The Science and Art of Longevity. The documents include appointments and extensive correspondence between Epstein and Attia, including discussions of medical matters and medications. The Cut’s Erica Schwiegershausen reports:\nIn one email sent to Epstein in February 2016, Attia appeared to write, “Pussy is, indeed, low carb. Still awaiting results on gluten content, though.” If it wasn’t clear just how friendly these two men were, in another 2016 email sent to Epstein’s longtime assistant, Lesley Groff, Attia seems to have written that he hopes to see Epstein soon, adding, “I go into JE withdrawal when I don’t see him” …\nIn 2015, Epstein emailed Attia a redacted image with the subject line “Got a fresh shipment.” In response, Attia wrote, “The biggest problem with becoming friends with you? The life you lead is so outrageous, and yet I can’t tell a soul.” A year later, Attia wrote, “I need to visit some time” after bringing up “LSJ” — which appears to be a reference to Little Saint James, Epstein’s private island.\nIn a statement and apology posted to X, Attia acknowledged meeting with Epstein at his Manhattan home as many as eight times but denied that he was his doctor, that he was involved in any criminal activity or sex parties, and that he had been to Epstein’s island. On February 2, Attia resigned from his role as chief science officer at the wellness protein-bar company David.\nJoscha Bach: AI researcher\nIn 2013, Epstein started funding the research of Bach, a German academic who studies artificial intelligence and cognitive science, at MIT Media Lab and Harvard’s Program for Evolutionary Dynamics. Bach is now the executive director of the California Institute for Machine Consciousness. According to the DOJ’s files, Epstein also gave Bach tens of thousands of dollars over the years to help with his family’s living and travel expenses, as well as his kids’ private-school tuition. In one email exchange between him, Epstein, and Noam Chomsky, Bach made some controversial statements about race and gender (which he later disavowed). In a statement to SFGATE, Bach acknowledged that Epstein covered his family’s living costs from 2013 to 2019, but said he had been unaware of any crimes Epstein committed after his 2008 conviction and that Epstein’s money never influenced his research.\nDoug Band: Influence peddler\nPer our 2019 guide:\nA onetime White House intern who climbed his way to being Bill Clinton’s bag carrier, body man, fixer, and all-purpose gatekeeper, Band arranged for the former president to travel to Africa on Epstein’s 727 in 2002. Band would go on to help his boss found the Clinton Global Initiative in 2005, a choice platform from which he launched his own lucrative favor-trading corporate-advisory firm, Teneo. Throughout that time, he took a number of trips on Epstein’s plane and attended parties at his townhouse. Band resigned from his position at CGI in 2012; leaked emails later showed Band and Chelsea Clinton trading accusations of conflicts of interest in a war of influence over her parents. More recently, Band’s been teaching a “Public Service” class at NYU.\nAndré Balazs: Celebrity hotelier\nName found in Epstein’s black book.\nAlec Baldwin: Actor\nName found in Epstein’s black book.\nBaldwin has denied knowing Epstein.\nSteve Bannon: Trump strategist, MAGA influencer\nBannon and Epstein regularly corresponded in 2018 and 2019, as the Washington Post reports:\nBannon’s phone number and email address are redacted from the newly released files, but the messages include hyperlinks to media appearances and interviews he gave. In one exchange, Epstein suggests that a woman he is connected with will contact the email recipient. The person responds: “Oh ‘the next future ex-mrs. bannon.’” Bannon spent much of spring 2019 in Europe, and Epstein frequently offered to send a private jet or charter a plane to ferry Bannon to meet him in Paris. Bannon appears to have stayed overnight at Epstein’s home in spring 2019, the messages show.\nIn early 2018, Epstein began referring to Bannon as a friend in emails. Bannon regularly sent him links to his media appearances, and Epstein would offer feedback.\nEpstein also had photos of himself and Bannon as well as one of Bannon talking to Woody Allen.\nEhud Barak: Former Israeli prime minister\nThe longtime Israeli politician had close ties with Epstein, and according to the DOJ-released documents, they corresponded and met up regularly over the last 14 years of Epstein’s life, before and after his sex-offense conviction. Per one analysis, the DOJ documents show Epstein and Barak made arrangements for more than 60 meetings between 2010 and 2019, mostly at Epstein’s Manhattan townhouse, including during the time that Barak was Israel’s defense minister. Barak also stayed at Epstein’s home dozens of times and visited his private Caribbean island.\nDonald Barr: Dalton School headmaster\nFrom our 2019 guide:\nBarr was ousted shortly before Epstein, 21 and without a college degree, showed up for his first day of work teaching math and physics at the Manhattan’s elite Dalton School in the early 1970s. Barr announced his resignation soon after, in February 1974: “He was disliked by the faculty, he was highly controversial, he hadn’t raised much money, he was very conservative,” said the board’s chairman. Barr’s leadership style was described as “authoritarian” and “undemocratic” at the time. Memorably, several former students told the New York Times that Epstein was overly familiar with teenage girls at the school. Donald’s son William would intersect with Epstein’s orbit while serving as a counsel at Kirkland & Ellis in 2009. The law firm secured Epstein his obscenely lenient 2007 non-prosecution deal, which the Justice Department is now reviewing. In July, Barr the son refused to recuse himself from the ongoing Epstein investigation.\nTom Barrack: Private-equity manager\nThe staunch Donald Trump ally was friends with Epstein and the former president back when they were close in South Florida in the 1980s. Epstein apparently tried to revive the connection in 2016 after Trump cinched the Republican nomination. In August of that year, Epstein scheduled a lunch with Barrack, who was an informal adviser to the Trump campaign at the time. Barrack was also invited to Epstein’s Upper East Side townhouse in September 2016 with Russian ambassador to the United Nations Vitaly Churkin and Woody Allen.\nSandy Berger: National security adviser for Bill Clinton\nName found on Epstein’s private-jet log.\nNicolas Berggruen: Billionaire investor\nName found in Epstein’s black book.\nBill Berkman: New York businessman\nName found in Epstein’s black book.\nAs we noted in our 2019 guide:\nA wealthy executive whose family established the Berkman Klein Center for Internet & Society at Harvard, Berkman was sued in 2014 by his administrative assistant, who said she was forced to read emails Berkman had sent to a colleague containing “pictures of random and unsuspecting women on the street” — that is, creepshots. (The suit was settled.)\nSergey Belyakov: Russian government official\nPer a Washington Post analysis of the Justice Department files, Belyakov began cultivating a relationship with Epstein in 2014, when he was serving as Russia’s deputy minister of economic development. They continued to have ties until 2018, apparently meeting in person several times and corresponding about investment opportunities. Belyakov, a graduate of Russia’s Federal Security Services Academy, repeatedly invited Epstein to the St. Petersburg International Economic Forum, which he chaired from 2014–15. The Daily Beast reports that he also helped Epstein obtain Russian visas. Epstein introduced Belyakov to Ehud Barak and tried to arrange for him to meet with Peter Thiel. In 2015, Epstein asked Belyakov for his assistance dealing with “a russian girl from Moscow” who was claiming that “powerful men take advantage of women like her” and was, he said, “attempting to blackmail a group of powerful businessmen in New York.” Belyakov said he would look into the woman and later reported back to Epstein about her. In 2016, while working as an adviser at the Russian Direct Investment Fund, Belyakov sought Epstein’s help attracting foreign investment to Russia.\nMohammed bin Salman: Crown Prince and de facto ruler of Saudi Arabia\nSeen in one of Epstein’s photos and is referenced in Epstein’s emails and text messages.\nEpstein kept a framed photo of himself and bin Salman on a credenza in his mansion. He also wrote in a 2016 email, following a trip to Saudi Arabia, that MBS, as bin Salman is often referred to as, “sent me a TENT carpets and all.” Before that trip, Epstein’s assistant asked him, “Did you need me to book the Four Seasons for you in Riyadh? Or is the king taking care of it!?”\nSultan Ahmed bin Sulayem: CEO of Dubai Port World\nThe DOJ files reveal that Epstein and bin Sulayem, one of the Dubai’s most prominent businessmen, were longtime friends who corresponded extensively for more than a decade. Bin Sulayem also visited Epstein’s Little Saint James private island multiple times. As the Financial Times and Bloomberg report, business wasn’t the only thing the Emirati executive discussed with Epstein. They also talked about women, including multiple messages bin Sulayem sent describing sexual experiences, that sometimes included images (redacted from the DOJ files). Epstein and bin Sulayem also exchanged emails regarding prostitution, including one in which bin Sulayem appears to explain which sex services he paid for at a Tokyo massage parlor. In one 2017 email chain, bin Sulayem helped arrange for a Russian he described as the “personal masseuse” at Epstein’s “private spa” to work in the spa of a Rixos Hotel in Turkey “so she gains better experiences.”\nEpstein arranged or tried to arrange numerous meetings between other associates and bin Sulayem over the years, repeatedly dropped his name in conversations, and he literally used his name in 2016 to purchase a second Caribbean island, Great Saint James, from someone who had refused to sell it to Epstein (because he was a sex offender).\nOn February 10, Congressman Ro Khanna announced that bin Sulayem was the redacted recipient of an email Epstein sent on April 24, 2009 in which he wrote “where are you? are you ok I loved the torture video.” (This may have been a reference to an ABC News report which Epstein was forwarded that same day about a video showing a member of the UAE’s royal family brutally torturing a man.)\nRobin Birley: Nightclub impresario\nName found in Epstein’s black book.\nBirley owned the club where Meghan Markle and Prince Harry had their first date.\nDebonnaire von Bismarck: Countess\nName found in Epstein’s black book — listed as Debbie.\nLeopold von Bismarck: Count\nName found in Epstein’s black book.\nYes, those Bismarcks.\nVanessa von Bismarck: Heiress and publishing entrepreneur\nName found in Epstein’s black book.\nConrad Black: Media mogul\nName found in Epstein’s black book.\nFrom our 2019 guide:\nHe’s perhaps best known for being sentenced to 42 months in prison for fraud, then writing a book about Trump and receiving a pardon. Vicky Ward, who profiled Epstein for Vanity Fair in 2003, said Epstein heavily leaned on Black, who is her ex-husband’s uncle (and was her ex-husband’s then-boss), to try to exert his influence on Ward.\nLeon Black: Apollo Global Management co-founder\nThe private-equity giant’s relationship with Jeffrey Epstein, whom he paid tens of millions of dollars to, eventually lead to Black stepping down as CEO of Apollo and to his departure from his position as chairman of the Museum of Modern Art. Black contributed a poem to the birthday book. Their emails have also come out, including one in which Epstein writes: “Leon, As you are well aware, There is little I won’t do for you, or at least try to do as a friend, and a great deal that I have already done (both known and some things that will need to remain unknown).” Black has denied having any awareness of Epstein’s crimes.\nRoy Black: Epstein lawyer\nPer our 2019 guide:\nThe trial attorney and legal analyst’s client roster has included Justin Bieber, Girls Gone Wild creator Joe Francis, and Rush Limbaugh. Black is perhaps best known for representing William Kennedy Smith against rape charges in Palm Beach in 1991. (The Kennedy nephew was acquitted.) In 2005, Black played the “managing partner” on NBC’s The Law Firm, a knockoff of The Apprentice for up-and-coming lawyers.\nDavid Blaine: Magician\nName found in Epstein’s black book. They also emailed.\nBlaine put on a private show for Epstein’s dinner guests in 2003, doing card tricks for the likes of Sergey Brin, Mort Zuckerman, and Bill Clinton aide Doug Band. The dinner was organized by Ghislaine Maxwell and included a group of young women who were introduced as Victoria’s Secret models. Included in the Epstein emails released by the House Oversight Committee is one from Blaine supporting a visa application for an “amazing fashion model.”\nTony Blair: Former British prime minister\nName found in Epstein’s black book.\nHenry Blodget: Founder of Business Insider\nAs Semafor reports, the Justice Department files include a 2013 email chain showing correspondence between Epstein’s philanthropic foundation and Blodget in which they asked for BI to take down a mugshot of Epstein it had published, arguing that it “undermines the foundation’s work which funds critical science and medical research.” Blodget then forwarded the email to a BI editor who swapped the mugshot for another photo. (He told Semafor he did not remember that but emphasized that “We published hundreds of tough stories on him.”) This was part of an effort by a team Epstein hired to scrub the internet of negative press about him.\nMichael Bloomberg: Billionaire and former mayor of New York\nName found in Epstein’s black book.\nTodd Boehly: Chairman of Chelsea FC\nAccording to the DOJ files, Epstein arranged two meetings with Boehly in 2011, when he was a managing partner at Guggenheim Partners. Boehly is also now a part owner of the Los Angles Dodgers and Lakers.\nHassanal Bolkiah: Sultan of Brunei\nAs we noted in our 2019 guide:\nEpstein had at least one meeting with the sultan when he traveled to Brunei in 2002 with Bill Clinton. Bolkiah and his brother are famous for their lavish spending, including a collection of 2,500 cars and a $1.5 billion palace. Bolkiah was once sued by Miss USA 1997, who claimed she had been held as a sex slave. The suit was dismissed on the grounds that Bolkiah had sovereign immunity.\nAnnabelle Bond: British socialite\nName found in Epstein’s black book.\nAndrea Bonomi: Italian businessman\nName found in Epstein’s black book.\nThe chairman and founder of Investindustrial was a key character in the Paradise Papers international tax-shelter scandal.\nMichael Borrico: Long Island contractor\nName found in Epstein’s black book.\nDescribed by Social Life magazine as the “ambassador of the all-important Hamptons polo culture,” Borrico is known for hosting polo matches at his estate in Water Mill.\nLeon Botstein: President of Bard College\nEpstein’s private schedules from 2013 to 2017 had roughly two dozen meetings scheduled with Botstein over the four years covered in the documents, mostly at his townhouse. Regarding his relationship with Epstein, Botstein told The Wall Street Journal he was interested only in Epstein’s money: “I was an unsuccessful fundraiser and actually the object of a little bit of sadism on his part in dangling philanthropic support.”\nFrederic Bourke: A founder of Dooney & Bourke\nName found in Epstein’s black book.\nBourke went to prison for a scheme to bribe government officials in Azerbaijan.\nHamish Bowles: European editor-at-large for Vogue\nName found in Epstein’s black book.\nMuriel Brandolini: Interior designer\nName found in Epstein’s black book.\nHer clients have included Matt Lauer and the crown prince and princess of Greece.\nRichard Branson: Founder of Virgin Group\nBranson has his own private island in the British Virgin Islands, and he hosted Epstein there three times in 2013. According to emails included in the DOJ documents, before one trip Epstein said he would need U.K. visas for “2 Russian girls.” After another visit, Epstein emailed Branson to thank him for his hospitality, and Branson replied, “Any time you’re in the area would love to see you. As long as you bring your harem!” (According to a Virgin Group representative, Epstein had brought three women with him to the island and referred to them as his “harem.”) The British billionaire also offered Epstein some PR advice about getting Bill Gates to vouch for his reformation:\nI think if Bill Gates was willing to say that you’ve been a brilliant advisor to him, that you slipped up many years ago by sleeping with a 17 ½ year old woman and were punished for it, that you’ve more than learnt your lesson and have done nothing that’s against the law since and, yes, as a single man you seem to have a penchant for women. But there’s nothing wrong with that.\nThe DOJ documents include two photos of Epstein and Branson in an unidentified tropical location. Epstein kept one of the images framed on the wall of his Manhattan townhouse.\nEpstein also offered Branson a $50,000 donation in October 2013. A Virgin Group representative told the Financial Times that any contact Branson and his wife had with Epstein “was limited to group or business settings.” They also said that after Epstein offered his donation, a due-diligence check “uncovered serious allegations” and the company’s charitable foundation Virgin Unite didn’t take the donation, and the Bransons “decided not to meet or speak with Epstein again.” (Per the emails released by the DOJ, Epstein instead donated the money to WildAid, where Branson serves as a brand ambassador, at the request of Virgin Unite’s CEO.)\nBørge Brende: President and CEO of World Economic Forum\nBrende, who is also the former foreign minister of Norway, visited Epstein’s Manhattan townhouse once in 2018 and twice in 2019, and he also corresponded with Epstein via email and text. Brende says the visits were all multi-person business dinners, that he attended the first at the invitation of Norwegian diplomat Terje Rød-Larsen, and that he was “completely unaware of Epstein’s past and criminal activities.”\nFlavio Briatore: Italian millionaire businessman\nName found in Epstein’s black book.\nA friend of Trump, a convicted card cheat, and an accused Formula 1 race fixer, Briatore was a longtime fugitive in the Virgin Islands.\nSergey Brin: Google co-founder\nAccording to a court filing, Epstein advised Brin from 2004 to 2007, including providing guidance on how to set up a tax shelter — a tax-saving trust for Brin’s kids called a grantor-retained annuity trust — with bankers at JPMorgan Chase. Brin had become a client of the bank in 2004 following a referral from Epstein and subsequently held more than $4 billion in accounts there. The Wall Street Journal notes that Epstein helped billionaire and Apollo Global Management co-founder Leon Black set up a similar tax shelter. Epstein’s relationship with Brin came to light in an August 2023 court filing by the U.S. Virgin Islands in its civil suit against JPMorgan over the bank’s relationship with Epstein. Documents released by the Justice Department include an undated photo of Brin and at least three redacted women at some tropical location, as well as a report from one of Epstein’s accusers that Brin and his wife at the time spent a day on Epstein’s island in January 2007.\nJohn Brockman: Literary agent\nName found on Epstein’s private-jet log.\nDavid Brooks: Journalist\nImages obtained from the Epstein estate and released by the House Oversight Committee show the New York Times columnist at a 2011 “billionaire’s dinner” attended by Epstein, Sergy Brin, and numerous other business leaders. A Times spokesperson said it was a “widely-attended dinner” and Brooks had no other contact with Epstein.\nEdgar Bronfman Jr.: Executive\nName found in Epstein’s black book.\nThe former Warner Music Group CEO, son of the late Seagram’s CEO Edgar Bronfman Sr., is related to the NXIVM-sex-cult Bronfmans. His son has a child with singer-rapper M.I.A.\nJean-Luc Brunel: Model scout\nName found in Epstein’s black book and on Epstein’s private-jet log. He also contributed to Epstein’s birthday book.\nPer our 2019 guide:\nBrunel was accused in court testimony of having used his agency to supply Epstein with girls. (He was not charged.) He also has a long history of allegations that he had abused his fashion-world position. In 1988, he was the subject of a 60 Minutes investigation alleging that he and a fellow agent sexually assaulted nearly two dozen models. He denied the claims but later told Model author Michael Gross, “You get laid tonight with a model, is that a crime?” In 2005, Brunel co-founded the MC2 modeling agency; Epstein invested $1 million, according to a 2010 deposition.\nBrunel killed himself in 2022 while in a Paris jail awaiting trial on charges of raping and trafficking minors.\nJoan Juliet Buck: Fashion editor\nName found in Epstein’s black book.\nAs we noted in our 2019 guide:\nIn 2003, Buck met Maxwell at a fashion party at a New York City boutique. Buck had recently moved on from her seven-year tenure as the editor of French Vogue and was writing for its American counterpart and living in New Mexico. She was a lifelong resident of a rarefied social world. Maxwell, a regular on that particular circuit, quickly made a connection. “Oh, Jeffrey’s got a ranch in Santa Fe, blah blah blah,” Buck recently remembered their conversation going. She gave Maxwell her Santa Fe number and later asked a friend about Epstein and New Mexico. “His ranch?” the friend replied. “As we say in Texas, all hat, no cattle.”\nRon Burkle: Supermarket magnate\nName found in Epstein’s black book and on Epstein’s private-jet log.\nBurkle took what were described as humanitarian trips to Africa with Bill Clinton on Epstein’s private Boeing 727. According to a 2008 Vanity Fair feature about former president Clinton, “Burkle’s usual means of transport is the custom-converted Boeing 757 that Clinton calls ‘Ron Air’ and that Burkle’s own circle of young aides privately refer to as ‘Air Fuck One.’ ”\nWilliam Burns, former CIA director\nAccording to his private documents, Epstein had three scheduled meetings in 2014 with Burns, who was at that point the deputy secretary of State during the Obama administration. They met both in Washington, D.C., and New York.\nCandace Bushnell: Columnist who inspired Sex and the City\nName found in Epstein’s black book.\nArpad Busson: French financier\nName found in Epstein’s black book.\nPer our 2019 guide:\nDuring a custody battle with ex Uma Thurman, Thurman’s lawyer asked Busson, a prominent hedge funder, if he had ever said he was “addicted to prostitutes.” (He said no.)\nJason Calacanis: Businessman\nName found in Epstein’s black book.\nAn investor in Uber, Calacanis was a fixture in the early aughts New York tech scene as the founder and editor of Silicon Alley Reporter. (“I can’t tell you how many propositions I get, it’s absolutely insane,” he told the Observer in 2000.) In 2014, Vice awarded him Most Offensive Tweet of the Year for describing as racist the idea of white privilege.\nNicky Caledon: Earl\nName found in Epstein’s black book.\nNaomi Campbell: Supermodel\nName found in Epstein’s black book and on Epstein’s private-jet log.\nThe Wall Street Journal reports that the model’s name was in Epstein’s schedules after 2008, and that one of Epstein’s accusers said that she was approached by an Epstein associate at a 2010 Campbell event in Paris and told that Epstein knew Campbell and could help her modeling career.\nNicholas and Christian Candy: British property-developer brothers\nNames found in Epstein’s black book.\nGraydon Carter: Former editor of Vanity Fair\nAccording to journalist Vicky Ward, he killed portions of a 2003 story that accused Epstein of pedophilia after an office visit from Epstein. (Carter says there wasn’t enough on-the-record sourcing.) “I didn’t invent the system. I just lived by the system,” he said when The New York Times Magazine questioned him about it.\nFidel Castro: Former president of Cuba\nAppears in a group photo with Epstein that the financier displayed in his mansion.\nJames Cayne: Bear Stearns CEO\nContributor to Epstein’s birthday book.\nAurelia Cecil: PR chairwoman\nName found in Epstein’s black book.\nAllegedly the former girlfriend of Prince Andrew.\nMark Cecil: Hedge funder\nName found in Epstein’s black book.\nHas hosted Prince William and Kate Middleton at his villa in Mustique.\nVikram Chatwal: Hotelier\nName found in Epstein’s black book.\nWhen 1990s playboy Chatwal settled down, Bill Clinton attended his wedding. In 2017, Chatwal pleaded guilty to a misdemeanor violation after being accused of trying to set a pair of dogs on fire on a Soho street.\nNoam Chomsky: Linguist and author\nAccording to Epstein’s schedules he arranged several meetings with Chomsky in 2015 and 2016, who was then teaching at MIT where Epstein had donated hundreds of thousands of dollars. The scheduled meetings included a gathering of academics as well as a flight with Epstein aboard his private jet to New York for a dinner at his townhouse with film director Woody Allen and his wife, Soon-Yi Previn. Chomsky and Epstein also corresponded about news and politics via email between 2015 and 2017.\nDeepak Chopra: New Age author\nEpstein and Chopra corresponded repeatedly and met up at least 12 times between 2016 and 2019, including dinners at Epstein’s Manhattan townhouse and funding meetings regarding alternative medicine. In one email exchange, Chopra asked whether a woman had dropped civil charges against Epstein and replied “good” when Epstein said she had. In another exchange, they traded jokes about “cute girls.” In other correspondence, they made apparently metaphorical references to “the tiger,” and in one email, Chopra told Epstein that he was “deeply grateful for our friendship.” He also asked Epstein for financial advice. In a statement on February 4, Chopra said that while some of his messages to Epstein “reflect poor judgment in tone,” he insisted that “I was never involved in, nor did I participate in, any criminal or exploitative conduct.”\nVitaly Churkin: Russia’s ambassador to the United Nations\nThe Justice Department files include messages between Epstein and Churkin, who died in 2017, indicating that in the summer of 2016, Epstein helped his son Maxim find a job in the U.S. Epstein said “Any maxim help is confidential” and Churkin replied “Of course.” He also told Epstein, regarding his son, that “U r a great teacher!” Epstein also indicated to Thorbjørn Jagland in a 2018 email that he had advised Churkin about how to deal with Trump.\nThe DOJ files also include correspondence and arranged meetings between Epstein and Maxim Churkin.\nGiuseppe Cipriani: Restaurant magnate\nName found in Epstein’s black book.\nThe scene-y Cipriani Italian spots are known for inventing the Bellini cocktail — and more infamously for being Harvey Weinstein’s “hunting ground.”\nGustavo Cisneros: Venezuelan billionaire\nName found in Epstein’s black book.\nThe patriarch of a family so wealthy it operates practically as its own nation-state in Latin America.\nBill Clinton: Former U.S. president\nName found on Epstein’s private-jet log. Seen in numerous photos included in the Justice Department’s Epstein files.\nFrom Rebecca Traister’s entry on Clinton in our 2019 guide:\nAs soon as the Epstein news broke two weeks ago, the taunting and tallying began, suffocating in its familiarity. First were the jeering reminders, as if we didn’t know it in our every molecule: It wasn’t just Donald Trump who’d be ensnared in this stygian nightmare of underage sexual assault and trafficking of girls, it was Bill Clinton, who’d been a friend and repeat flier on Epstein’s plane. Then came the numbers, the attempts to quantify the nature of the Clinton-Epstein relationship. Clinton issued a statement toting up four plane trips, one Epstein meeting in Clinton’s Harlem office, one visit to Epstein’s home, and zero trips to his island. Meanwhile, reporters recalled that Gawker’s published flight logs had tallied 12 separate plane legs and that Epstein had more than 20 numbers and email addresses for Clinton and one signed photo of him in his home, along with one of Woody Allen and one of Mohammed bin Salman, the crown prince of Saudi Arabia.\nAll of this was presented as if these numbers could clarify some exact science of guilt or complicity. The reality is: Yes, Clinton was grimy and had grimy friends, and, more broadly, this is how powerful men have behaved toward women and one another. Yes, we know it’s dirty and mean and exhausting and true.\nThere are many photos of Clinton in the files released by the Epstein estate and the Justice Department, some showing Clinton with women whose faces are redacted, including one of him shirtless in a hot tub. Clinton’s representatives have repeatedly said the former president wasn’t aware of Epstein’s crimes and cut off contact with him after they came to light.\nChelsea Clinton: First daughter\nGhislaine Maxwell attended the former First Daughter’s wedding after Epstein had first been charged. This was shortly after Maxwell skipped a deposition for the Epstein case, claiming she needed to return to the U.K. to be with her deathly ill mother.\nNicholas Coleridge: Chairman of Condé Nast Britain\nName found in Epstein’s black book.\nPhil Collins: Musician\nName found in Epstein’s black book.\nDavid Copperfield: Magician\nAccording to a message-pad entry dated January 27, 2005, at 3:55 p.m., Copperfield rang Epstein’s line while he was out. The handwritten entry reads, “Magic David called.” An undated photo of Copperfield and Ghislaine Maxwell, wearing bath robes and hugging, was included in the Epstein files released by the Justice Department.\nKatie Couric: Journalist\nCouric was among those who attended a dinner at Epstein’s townhouse for Prince Andrew in 2010. The DOJ’s Epstein files include a 2011 email she sent to publicist Peggy Siegal, in which she wrote, “Oy, thanks for the Jeffrey Epstein invite … it’s brought me a world of trouble!” In her 2021 memoir, Couric described the dinner as “creepy” and acknowledged that she “should have done a little more research” before attending.\nBill Cosby: Comedian, convicted rapist\nCosby lived across the street from Epstein in Manhattan.\nAndrew Cuomo: Former governor of New York\nName found in Epstein’s black book.\nPrince Pierre d’Arenberg: Royal\nName found in Epstein’s black book.\nPer our 2019 guide:\nAmericans often imagine aristocrats floating on a cloud of above-it-all wealth, but even real-life princes, this one descended from a German royal family that long ago united with the most influential and wealthiest family of the Hapsburg Netherlands, could get something out of a relationship with a font of new American money like Epstein.\nLouis Albert de Broglie: Political scion, founder of luxury garden brand\nName found in Epstein’s black book.\nCharlene de Carvalho-Heineken: Heiress\nName found in Epstein’s black book.\nJacques de Crussol: 17th Duke of Uzès\nName found in Epstein’s black book.\nSophie Dahl: Former model, granddaughter of Roald Dahl\nName found in Epstein’s black book.\nAlan Dershowitz: Epstein lawyer\nName found in Epstein’s black book and on Epstein’s private-jet log.\nWrote Andrew Rice in our 2019 guide:\nFor around a decade, Dershowitz kept casual company with Epstein, who introduced him to his friends, like Ghislaine Maxwell and Prince Andrew. (Dershowitz says he and the prince ended up not getting along because they disagreed about Israel.) Dershowitz visited Epstein’s mansions in New York and Palm Beach and occasionally accompanied him on his private plane. He says these trips were family oriented. Once, Epstein lent him the Palm Beach home so he could attend a granddaughter’s soccer tournament. Another time, he and his nephew flew down to watch a space launch with another Epstein connection, a top NASA official. He and his wife, Carolyn Cohen, once stayed with Epstein on his island in the Caribbean, where they were joined by another Harvard professor and his family.\nWhen Epstein first started to attract media attention in the early aughts, mainly because of his friendship with former president Bill Clinton, Dershowitz served as a character witness for the reclusive financier. He told Vanity Fair that he shared manuscripts of his books with Epstein before they were published and swore that his money was irrelevant. “I would be as interested in him as a friend if we had hamburgers on the boardwalk in Coney Island and talked about his ideas,” he told the magazine.\nBut Dershowitz says their interactions changed in 2005, when Epstein faced a local police investigation into his relations with underage girls in Palm Beach and he hired Dershowitz as a lawyer. With his assistance, Epstein was able to whittle down the state’s indictment against him to a single count of soliciting prostitution. But in the years to come, as Epstein’s legal problems compounded, they would eventually ensnare Dershowitz himself. He is also accused of having sex with two of Epstein’s alleged victims. “The stories are so phantasmological,” Dershowitz says. He recognizes that the Me Too movement has surfaced countless accounts of preposterous-sounding sexual misbehavior by powerful men and almost all of them have turned out to be true. But Dershowitz swears he is different. “Mine is the only case, singular, the only one, where I never met the people,” he says. “There’s no evidence we’ve ever met, no evidence we were ever in the same place at the same time, ever.”\nToday, Dershowitz claims he and Epstein were never really even friends, despite their proximity. “He was an acquaintance,” he says. “In retrospect, I wish I hadn’t taken the case, but I didn’t see a problem with taking the case. We didn’t have a close personal relationship.”\nMariette DiChristina: Former editor-in-chief of Scientific American\nAccording to the Justice Department files, Epstein and DiChristina corresponded in 2014 and 2015, and they apparently had at least one phone call and an in person meeting in Manhattan in 2014. She also invited Epstein to observe a Scientific American editorial meeting that year. DiChristina, who is now the dean of the College of Communication at Boston University, told Scientific American that Epstein was interested in how the publication “identified innovations for coverage,” but never came to their office and “had no influence on any coverage decided by the editors or by me personally.”\nJanice Dickinson: Model, actress, TV personality\nName found in Epstein’s black book.\nPedro Diniz: Agroforester, businessman, former Formula 1 racing driver\nName found in Epstein’s black book.\nMinnie Driver: Actress\nName found in Epstein’s black book.\nStephen Dunbar-Johnson: President, international, of the New York Times Company\nName found in Epstein’s black book.\nGriffin Dunne: Director\nName found in Epstein’s black book.\nJoan Didion’s nephew and a Martin Scorsese leading man.\nGerald Edelman: Nobel Prize winner\nEdelman received funding from the Jeffrey Epstein VI Foundation. “Jeff is extraordinary in his ability to pick up on quantitative relations,” he told New York in 2002. “He came to see us recently. He is concerned with this basic question: Is it true that the brain is not a computer? He is very quick.”\nEric Ellenbogen: Former CEO of Marvel Enterprises\nName found in Epstein’s black book.\nWilliam Elkus: Venture capitalist\nThe Clearstone founder contributed a letter to Epstein’s birthday book in which he fondly recounts a time he watched Epstein apparently seduce a woman. According to emails in the Justice Department files, Elkus and Epstein periodically corresponded and made arrangements to meet up until at least 2016.\nChristina Estrada: Model\nName found in Epstein’s black book and on Epstein’s private-jet log.\nEstrada is the ex-wife of the late Walid Juffali, who was a billionaire chairman of the largest privately owned enterprise in Saudi Arabia.\nAndrew Farkas: New York real-estate mogul, founder of Island Capital Group\nEpstein and Farkas, who is a scion of the family that built the Alexander’s department-store chain, were business partners and co-owned a 127-slip marina in the U.S. Virgin Islands near Epstein’s private island. Though Farkas has insisted theirs was purely a commercial relationship, documents released by the DOJ indicate they were also friends. In a 2010 email, Farkas told Epstein, “You are one of the blessings in my life and I cherish our friendship.” He also appeared to be giving Epstein a nearly $200,000 annual discount on marina services.\nJonathan Farkas: New York socialite, Broadway producer\nJonathan — who is Andrew Farkas’s uncle and another scion of the Alexander’s department-store family — was longtime friends with Epstein and visited him in prison. According to emails released by the Justice Department, Farkas spoke with Epstein about his marriage problems and seemed to ask him for help meeting women. In one 2017 email exchange, Farkas mentioned a woman he was apparently having an affair with, and when Epstein warned him to stay away from her, Farkas replied, “Jeffrey please help me here is she a hooker.”\nSomers Farkas: New York socialite, U.S. ambassador to Malta\nSomers, a former model and advertising executive, is Jonathan Farkas’s third wife and currently serves as U.S. ambassador to Malta under President Trump. Farkas mentions his wife to Epstein in multiple emails included in the DOJ documents. Somers also reaches out to Epstein to invite him to events. In a 2010 email Epstein received from publicist R. Couri Hay proposing a “reputation turnaround strategy,” Hay recounts a conversation with Somers: “I asked her if she knew you and she responded saying, ‘I do know Jeffery and I like him. You wouldn’t think I would but I do.’”\nFrédéric Fekkai: Celebrity hairstylist\nName found in Epstein’s black book and on Epstein’s private-jet log.\nFekkai’s expensive salons are up and down the Upper East Side and in Palm Beach, and he’s known for butter blondes, layered bobs, and participating in the polishing up of Hillary Clinton. Epstein’s assistants were given house accounts for blowouts, waxing, nails, highlights — the works.\nSarah Ferguson: Duchess of York\nName found in Epstein’s black book and on Epstein’s private-jet log.\nEpstein loaned Prince Andrew’s then-wife $18,000 to pay off some debts. “I personally, on behalf of myself, deeply regret that Jeffrey Epstein became involved in any way with me,” Ferguson told the Telegraph in 2011. “I abhor paedophilia.” According to the documents released by the Justice Department, she emailed Epstein afterward to apologize for her comments. She also corresponded with Epstein in 2009 while he was under house arrest; one of those emails indicates they had recently had lunch.\nBran Ferren: Artist, former Disney executive\nContributor to Epstein’s birthday book.\nRalph Fiennes: Actor, producer, director\nName found in Epstein’s black book.\nPaula Heil Fisher: Opera producer\nEpstein’s former girlfriend met him through Bear Stearns where she was once an associate.\nSteve Forbes: Chairman and editor-in-chief of Forbes magazine\nName found in Epstein’s black book.\nTom Ford: Designer\nName found in Epstein’s black book.\nBill Gates: Microsoft co-founder, philanthropist\nThe connection between Epstein and Gates has been well known for years, but in 2023, The Wall Street Journal published a revelatory new story on their relationship. The paper reported that Gates had an affair with a bridge player named Mila Antonova in the early 2010s and that Epstein attempted to leverage his knowledge of the situation against the Microsoft co-founder. The Justice Department files include hundreds of references to Gates, including scheduled meetings and email correspondence. Some of those emails were about Gates’s philanthropic work, but there are also a few Epstein emails about the tech titan that never got sent, per CNN:\nThe most explosive elements of the release involve two draft emails Epstein appears to have written himself in July 2013. In these stream-of-consciousness notes, riddled with typos and vitriol, Epstein appears to claim he facilitated sexual encounters for Gates and helped him obtain medication to hide a sexually transmitted infection from his wife. It’s not clear who wrote the draft messages from 2013 saved in Epstein’s email account, but they are addressed from Epstein to himself. Gates has strongly denied these claims as “false.”\nEpstein also had multiple photos of Gates: some of him with Prince Andrew outside what looks like a private plane and also at what looks like a small airport with a woman whose face is redacted.\nMurray Gell-Mann: Physicist\nName found in Epstein’s black book. Contributor to Epstein’s birthday book.\nIn 1969, Gell-Mann won the Nobel Prize. In 2003 he told Vanity Fair, “‘There are always pretty ladies around’ when he goes to dinner chez Epstein.”\nMark Getty: Co-founder and chairman of Getty Images\nName found in Epstein’s black book.\nGary Ginsberg: Communications pooh-bah\nName found in Epstein’s black book.\nOnce a lawyer in the Clinton White House, Ginsberg joined George, then News Corp., then Time Warner. He has also done pro bono speechwriting for Benjamin Netanyahu and now works for SoftBank, a Japanese investment company with close ties to the Saudi government.\nMalcolm Gladwell: Writer\nPer our 2019 guide:\n“I was invited to the TED conference in maybe 2000 (I can’t remember), and they promised to buy me a plane ticket to California,” Gladwell says now. “Then at the last minute they said, ‘We found you a ride on a private plane instead.’ As I recall, there were maybe two dozen TED conferencegoers onboard. I don’t remember much else, except being slightly baffled as to who this Epstein guy was and why we were all on his plane.”\nGerald Goldsmith: Rothschild Executive\nName found in Epstein’s black book.\nAce Greenberg: Bear Stearns chairman, Epstein’s first patron\nWrote Jessica Pressler in our 2019 guide:\nJeffrey Epstein didn’t have any formal training when he started working at Bear Stearns in 1976, but that wouldn’t have mattered to then-CEO Alan “Ace” Greenberg, who famously hired “PSD degrees,” short for “poor, smart, with a deep desire to be rich.” As it happened, Epstein was all three. He came from a modest Coney Island background, had no college degree, and worked a job — as a math teacher at Dalton and a tutor to Greenberg’s son — that was unlikely to support his tastes, which were apparently of the private islands–and–gilded desk–purportedly–belonging–to–J. P. Morgan variety. At Bear Stearns, Epstein made a name for himself in the “special-products division,” essentially figuring out how to help the rich pay less taxes. “He would recommend certain tax-advantageous transactions,” Greenberg’s protégé, James “Jimmy” Cayne, told New York in 2002. Cayne, who succeeded Greenberg in 1993, seems to have become the closer party to Epstein, whose mysterious departure from the firm he publicly defended decades after Epstein’s departure. “Jeffrey said specifically, ‘I don’t want to work for anybody else. I want to work for myself,’ ” Cayne insisted, despite transcripts from an SEC deposition that suggest other concerns around them both. It’s easier to imagine Cayne, a cigar-chomping, archetypal fat cat who was infamously off playing bridge when Bear Stearns collapsed in 2008, as a member of Epstein’s inner circle than his mentor, a folksy, bow-tie-wearing soul who referred to his successor as “crude,” “full of himself,” and “warped” in a memoir published shortly before his death. At the very least, it seems Cayne and Epstein were both capable of, ah, massaging the truth.\nGreenberg was also one of the contributors to Epstein’s birthday book.\nCornelia Guest: Socialite\nName found in Epstein’s black book.\nShe was dubbed “debutante of the decade” in 1986.\nJohn Gutfreund: CEO of Salomon Brothers\nName found in Epstein’s black book.\nGeorge Hamilton: Actor\nName found in Epstein’s black book.\nThe overtanned C-lister that Hollywood turns to when casting any vaguely and/or mysteriously aristocratic cameo role.\nJosh Harris: Co-founder of Apollo Global Management, co-owner of the Washington Commanders and several other teams\nAccording to the Justice Department files, Harris attended at least one meeting with Epstein, a group breakfast in 2014, and they corresponded periodically until 2016 about apparent business matters regarding Apollo and Leon Black, but it also appears as though Harris often dodged direct contact with Epstein. A spokesperson for Harris has insisted that was in fact the case and that Harris “never had an independent relationship” with Epstein and “sought to prevent Epstein’s attempts to develop a corporate relationship with Apollo.”\nChelsea Handler: Comedian\nHandler attended a dinner at Epstein’s townhouse for Prince Andrew in 2010. “It was just one of those strange nights,” she later said.\nNikki Haskell: Socialite\nEpstein dated Haskell, one of Donald Trump’s closest friends. “Jeffrey didn’t talk about his past, although he claimed to have been a concert pianist,” Haskell told the Daily Mail in 1992. “He told me he was a spy hired by corporations to find major amounts of money which had been embezzled.”\nStephen Hawking: Physicist\nIn 2006, the world’s most famous brain visited Little St. James, Epstein’s private island, which came to be known as “Pedophile Island.” Hawking, who was in the Caribbean for a conference, was photographed at a barbecue on the island and aboard a submarine for a tour. According to the Telegraph, “Epstein is said to have paid for the submarine to be modified for Professor Hawking, who had never been underwater before.”\nSteven Hoffenberg: A mentor and con man\nExplained James D. Walsh in our 2019 guide:\nBefore Bernie Madoff, there was Hoffenberg, who in 1985 pleaded guilty to cheating investors out of $460 million — at the time, the largest Ponzi scheme ever. He was sentenced to 20 years in prison and, after his release in 2013, began sounding the alarm on Epstein, who had worked at Hoffenberg’s Towers Financial Corporation after leaving Bear Stearns. He claimed that Epstein had been his co-conspirator in the scheme and that Epstein’s fortune was built on Towers Financial’s fraud. “He was great at moving money illegally,” Hoffenberg says. “He was the deeper architect to getting things accomplished.”\nHoffenberg claims he was introduced to Epstein by Douglas Leese, a mysterious British arms dealer, and that he paid Epstein $25,000 a month as Towers Financial began making risky plays to take over companies like Pan American World Airways and Emery Air Freight. Advisers on the Pan Am deal included Richard Nixon’s attorney general John Mitchell, Nixon’s brother Edward, and John Lehman, a former secretary of the Navy. The move fell apart after the Lockerbie bombing, and when Towers Financial later went belly-up, Hoffenberg says, the two of them engineered a Ponzi scheme to fill the hole.\n“He has a magnificent personality,” Hoffenberg says. “He’s very easy to interact with, very social, very easy to bond with, an unusually nice person. And he’s pretty dynamic on financial savvy. He could move money in different areas to get the stock prices to go up and down.”\nHoffenberg still owes his victims some $1 billion in restitution, and in 2016 he sued Epstein to recover some of the money. (He eventually dropped the suit.) Last year, two victims brought a suit against Epstein making the same claims as Hoffenberg but voluntarily dismissed the suit two months later.\n“You’re about to see an entire story about this supposed billionaire and the story about his financial empire, which is as big as the tragedy with the girls,” Hoffenberg says. “It’s billions of dollars, and it’s a fiasco.”\nDustin Hoffman: Actor\nName found in Epstein’s black book.\nReid Hoffman: Co-founder of LinkedIn, venture capitalist\nHoffman has acknowledged corresponding and meeting with Epstein, including once visiting Epstein’s private island, as part of his fundraising efforts for the MIT Media Lab. According to emails in the Justice Department documents, they also discussed Hoffman visiting Epstein’s Manhattan home and ranch in New Mexico. In 2019, Hoffman said he deeply regretted how he had helped Epstein “repair his reputation and perpetuate injustice.”\nThomas K. Hubbard: Former University of Texas professor\nThe DOJ files include a 2015 letter Hubbard sent to Epstein’s charitable foundation requesting financial support for a conference which aimed to assemble scholars and other experts to “interrogate the concept of sexual consent” in light of new Title IX policies targeting campus rape. The letter also warned of how a new penal code was “further expanding the reach of the sex offender-incarceration panic.” Hubbard taught Classics at UT Austin, including the classes “Child and Adolescent Sexuality” and “Mythology of Rape.” In 2019, he was accused of promoting pedophilia by student activists, who he then sued for libel. He later agreed to retire as part of a $700,000 settlement with the university. In a statement to The Daily Texan, Hubbard defended his request for money from Epstein, waved off his 2008 conviction, and argued that Epstein was not technically a pedophile or a rapist:\nhis sexual preference appears to have been for young women aged 16-22, which would at most reflect partial ephebophilia. Although most of the women who were involved with him at that age retrospectively regret it, I am unaware of any evidence that the contacts were non-consensual at the time.\nHe also claimed that some of Epstein’s victims were sex workers who “are now making cynical claims of victimization to cash in on his estate and business partners,” and he made it clear he sought funding from Epstein because he was a convicted sex offender:\nGiven his own brush with the law, I believed his Foundation might have been interested in furthering critical discussion of the contours of consent and rape. They weren’t.\nElizabeth Hurley: Actress\nName found in Epstein’s black book.\nLauren Hutton: Model and actress\nName found in Epstein’s black book.\nWalter Isaacson: Best-selling biographer, former editor of Time\nName found in Epstein’s black book.\nJoi Ito: Tech evangelist, former director of MIT Media Lab\nIto resigned from MIT and three boards in 2019 after The New Yorker reported that he had received $1.7 million from Epstein over a decade, including $1.2 million for his own investment funds, and that he helped conceal at least $7.5 million in donations to MIT Media Lab from Epstein after MIT had disqualified him from being a donor.\nMichael Jackson: Musician\nSeen with Epstein, Bill Clinton, and Diana Ross in undated photos included in the Epstein files released by the Justice Department.\nMick Jagger: Musician\nName found in Epstein’s black book.\nThe Rolling Stones frontman is also seen dining with Epstein, Maxwell, and Bill Clinton in photos included in the files released by the Justice Department.\nThorbjørn Jagland: Former Norwegian prime minister\nThe Wall Street Journal reports that one of Epstein’s accusers said he had shown her emails he had exchanged with Jagland, explaining that he wanted her to meet him. In Epstein’s correspondence with Jagland in 2018, when he was the secretary general of the Council of Europe, Epstein suggested Jagland put senior Russian officials in touch with him. Jagland said he would and thanked him for a “lovely evening.”\nAndrew Jarecki: Filmmaker\nName found in Epstein’s black book.\nThe director of the documentaries Capturing the Friedmans, about an accused pedophile, and The Jinx, which profiled Robert Durst, the madman at the center of another New York fortune.\nHenry Jarecki: Billionaire\nName found in Epstein’s black book and on Epstein’s private-jet log.\nOnce a psychiatrist, Henry, Andrew’s father, made his fortune in gold and silver speculation. In 2024, Jarecki acknowledged having a “consensual, non-secretive and mutually respectful relationship” with one of Epstein’s accusers (who filed then later dropped a civil lawsuit against Jarecki).\nElizabeth Johnson: Heiress\nName found on Epstein’s private-jet log.\nEpstein was a co-trustee on 14 parcels of land the Johnson & Johnson heiress owned in Dutchess County, New York. He resigned as a trustee for Johnson’s revocable trust at the end of 1998.\nRichard Johnson: Gossip journalist for “Page Six”\nName found in Epstein’s black book.\nCecile de Jongh: former First Lady of the U.S. Virgin Islands\nThe Wall Street Journal reports that according to court filings made by JPMorgan Chase in response to the civil suit brought against the bank by the U.S. Virgin Islands, Cecile de Jongh allegedly began working for Epstein starting in 2000 and continued working for him when her husband, John de Jongh, was serving as governor of the U.S. territory (from 2007 to ’15). The court filings also allege Cecile de Jongh helped arrange visas for some of Epstein’s victims.\nBrad Karp: Former chairperson of Paul, Weiss, Rifkind, Wharton & Garrison\nDocuments released by the Justice Department include multiple emails between Epstein and Karp, who represented Epstein client Leon Black.\nIn one 2015 email, Karp thanks Epstein for “including me in an evening I’ll never forget,” adding that it was “truly ‘once in a lifetime’ in every way, though I hope to be invited again.” Epstein replied, “You are always welcome. There are many many nights of unique talents. You will be invited often.” Bloomberg reports that “Karp attended a few dinner gatherings at Epstein’s Upper East Side residence, according to a person familiar with the matter.”\nIn another email that year, Epstein asked Karp for help confirming and revoking a woman’s visa, and Karp replied, “will work on this.” In a 2016 email, Karp asked Epstein to help set up his son with a job on a Woody Allen film.\nKarp said in a statement that his law firm was retained by Black to negotiate fee disputes with Epstein and “at no point did Paul Weiss or Brad Karp ever represent him.” He resigned from Paul Weiss on February 4.\nSarah Kellen: Alleged enabler\nName found in Epstein’s black book and on Epstein’s private-jet log.\nWrote Lisa Miller in our 2019 guide:\nIn a world where most women still work for men, and where their jobs are overwhelmingly in the “service” or “caring” professions, it should surprise no one that Epstein’s procurers, schedulers, fixers, and enablers were female. Four women — Sarah Kellen, Nadia Marcinkova, Adriana Ross, and Lesley Groff — were identified in the 2007 Florida case against Epstein as possible co-conspirators, though none was charged.\nHistory is full of the self-serving enabling of men by women, ending with the Trump court but not starting there. Was it money? Probably. The word is that Epstein paid his “executive assistants” $200,000 a year and let them order takeout from Le Cirque. When Groff had a baby, Epstein gave her a Mercedes and paid for a full-time nanny. “There is no way I could lose Lesley to motherhood,” he told the New York Times in 2005 (for a front-page story on the indispensability of good help for Wall Street tycoons).\nMarcinkova, referred to in court documents as Epstein’s “sex slave,” hails from the former Yugoslavia; Ross, a model, is from Poland. Kellen (who has since married a NASCAR driver) was a scheduler, making sure that Epstein always had a slate full of girls, and it was she who sometimes walked the girls up the stairs in the Florida mansion and laid the oils out on the massage table. Marcinkova would have sex with the girls for Epstein’s viewing pleasure and sometimes all together. Groff booked travel, and Ross also helped with the calendar. After the Miami Herald published its investigation in 2018, Epstein wired the “possible co-conspirators” $250,000 and $100,000, respectively, prosecutors say, to buy their silence. Since then, none of them have been reached for comment.\nDuring Ghislaine Maxwell’s sentencing hearing, U.S. District Judge Alison Nathan called Kellen both a “criminally responsible participant” and “knowing participant in the criminal conspiracy.” Kellen has never been charged, her name is almost entirely redacted from the DOJ’s Epstein files, and in 2020 she told The Sun that, “I’ve been made out to be such a monster — but it’s not true. I’m a victim of Jeffrey Epstein. I was raped and abused weekly.”\nEthel Kennedy: Human-rights advocate\nName found in Epstein’s black book.\nRobert F. Kennedy Jr.: Health secretary\nThe vaccine skeptic turned MAHA leader and HHS secretary flew on Epstein’s plane multiple times.\nTed Kennedy: U.S. senator\nName and home phone number found in Epstein’s black book.\nGeoffrey Kent: High-end-safari entrepreneur\nName found in Epstein’s black book.\nJohn Kerry: Former U.S. senator, former secretary of State\nName found in Epstein’s black book.\nPer our 2019 guide: “The seven numbers listed for Kerry in Epstein’s address book include the direct line to his presidential campaign.”\nAdnan Khashoggi: Saudi Arabian man of mystery\nExplained Matt Stieb in our 2019 guide:\nTo bolster their argument that private-jet owner Epstein is a massive flight risk, SDNY prosecutors produced an expired Austrian passport under an alias that listed Saudi Arabia as Epstein’s primary country of residence. His lawyers claim the fake ID was for the “personal protection” of “an affluent member of the Jewish faith” traveling in the Middle East, but it could also point to one of his more secretive income sources.\nAccording to his former friend the journalist Jesse Kornbluth, in the mid-1980s Epstein said he “worked for governments to recover money looted by African dictators” and occasionally subcontracted to those same autocrats to “help them hide their stolen money.” A source who spoke with journalist Vicky Ward said one of Epstein’s clients was the late Saudi arms dealer Khashoggi, a middleman in the Iran-Contra scandal who helped smuggle cash for the Marcos family out of the Philippines. In 1988, Khashoggi was arrested in Switzerland for concealing assets and later faced fraud and racketeering charges in the U.S. (He was later acquitted.) That year, he sold his 282-foot yacht to the Sultan of Brunei, who soon flipped it to Donald Trump.\nHenry Kissinger: Former secretary of State and national security adviser\nName found in Epstein’s black book.\nOne of the past century’s most notorious practitioners of cutthroat realpolitik, Kissinger served on the Council on Foreign Relations with Epstein.\nNancy Kissinger: Philanthropist\nEpstein and Kissinger served on the Rockefeller University board alongside Nobel laureate Joseph Goldstein, socialite Brooke Astor, and Texas billionaire Robert Bass.\nLeah Kleman: Art dealer\nShe told Vanity Fair in 2003 that Epstein lived like a “modern maharaja” and described his haggling over art prices as “something like a scene out of the movie Mad Max: Beyond Thunderdome.”\nDavid Koch: Plutocrat\nName found in Epstein’s black book.\nStephen Kosslyn: Harvard psychologist\nName found in Epstein’s black book.\n“He is amazing,” Kosslyn said of Epstein in a 2002 New York profile. “Like a honeybee — he talks to all these different people and cross-pollinates. Just two months ago, I was talking to him about a new alternative to evolutionary psychology. He got excited and sent me a check.”\nLawrence Krauss: Cosmologist\nPer our 2019 guide:\nEpstein was a major donor to his program at Arizona State University, and Krauss teamed with the financier to host a conference of Nobel laureates in the U.S. Virgin Islands in 2012. “Jeffrey has surrounded himself with beautiful women and young women, but they’re not as young as the ones that were claimed,” he told the Daily Beast in 2011. “I always judge things on empirical evidence, and he always has women ages 19 to 23 around him but I’ve never seen anything else. So as a scientist, my presumption is that whatever the problems were I would believe him over other people. I don’t feel tarnished in any way by my relationship with Jeffrey. I feel raised by it.” This spring, Krauss retired amid allegations of his own sexual harassment.\nMiroslav Lajčák: Former foreign minister of Slovakia\nDocuments released by the Justice Department on January 30, 2026, include email correspondence from 2018 between Epstein and Lajčák in which Epstein invited him to dinner and meetings. Lajčák says they were diplomacy-related meetings, but one day after the files were released, Slovak prime minister Robert Fico announced that Lajčák had resigned from his current role as national security adviser.\nRonald Lauder: Billionaire cosmetics heir, art collector\nDocuments released by the Justice Department indicate that Epstein scheduled multiple meetings with the Estée Lauder Company heir in 2017, and that Epstein may have had some role in Lauder’s art deals with fellow art collector Leon Black.\nGeraldine Laybourne: TV executive\nName found on Epstein’s private-jet log.\nCo-founder of Nickelodeon and, with her husband, Kit, and pal Oprah Winfrey, the Oxygen network.\nSimon Le Bon: Duran Duran front man\nName found in Epstein’s black book.\nGerald Lefcourt, Epstein attorney\nName found in Epstein’s black book.\nAs Matt Stieb explained in our 2019 guide: “A white-collar defense attorney to the stars, Lefcourt has also represented Black Panther Huey P. Newton, Sid Vicious, Tracy Morgan, Russell Crowe, insider trader Michael Milken, and Murder Inc. Records founder Irv Gotti.”\nJay Lefkowitz: Epstein attorney\nNoted Matt Stieb in our 2019 guide:\nLefkowitz negotiated the terms of Epstein’s negligently lenient plea deal with his former Kirkland & Ellis colleague Alexander Acosta. Now at Columbia Law, he served in both Bush administrations, as director of Cabinet affairs for H.W. and deputy executive secretary to the Domestic Policy Council and special envoy for human rights in North Korea for W.\nNick Leese: Film producer\nContributor to Epstein’s birthday book.\nCourtney Love: Singer\nName found in Epstein’s black book.\nHoward Lutnick: Former CEO of Cantor Fitzgerald, current secretary of Commerce\nAccording to documents released by the Justice Department, Epstein and Lutnick had drinks in 2011, and in 2012, Epstein invited Lutnick to his private island. Lutnick’s wife, Allison, accepted the invitation and then coordinated arriving by yacht with their kids. Though Lutnick said last year that he had cut off contact with Epstein decades ago, the DOJ documents indicate they remained associated until as late as 2018. During a congressional hearing on February 10, amid bipartisan calls for him resign as Commerce secretary, Lutnick said that he “barely had anything to do” with Epstein, but admitted that he had visited Epstein’s private island by boat in 2012 as part of a family vacation and had an hour-long lunch there along with his wife, children, nannies, and another couple and their children. He said the only thing he saw there were the staff who worked for Epstein.\nPeter Mandelson, British politician, former ambassador to the U.S.\nDocuments released by the Justice Department on January 30, 2026, include records of three $25,000 payments in 2003 and 2004 from Epstein’s bank account that appear to have gone to Lord Peter Mandelson, plus additional payments to Mandelson’s partner, Reinaldo Avila da Silva, in 2009 and 2010. The Financial Times reports that when he was a Cabinet minister under Prime Minister Gordon Brown, Mandelson passed along confidential government information to Epstein. Metropolitan Police are now investigating the allegations. Mandelson resigned from the Labour Party on February 1, he may soon face removal from the House of Lords, and the resulting scandal may yet take down Keir Starmer’s government.\nMandelson also called Epstein “my best pal” in a letter included in Epstein’s birthday book.\nPatrick McMullan: Photographer\nName found in Epstein’s black book.\nRobert Meister: Insurance executive\nMeister introduced Epstein to Leslie Wexner after Epstein met and charmed Meister on a plane to Palm Beach, according to James Patterson’s book Filthy Rich.\nMette-Marit: Crown Princess of Norway\nThe Crown Princess maintained a friendship with Epstein from 2011 to 2014, according to the DOJ documents, and in emails she joked with him about his pursuit of women and told him “you tickle my brain.” At one point, in 2012, asked him, “Is it inappropriate for a mother to suggest two naked women carrying a surfboard for my I5 yr old sons wallpaper?” The files also indicate that Mette-Marit stayed at Epstein’s empty Florida home for several days in 2013, and though she has now expressed regret “for not having checked Epstein’s background more closely and not understanding quickly enough what kind of person he was,” she told Epstein in a 2011 email that she had Googled him and “it didn’t look too good.”\nMarvin Minsky: MIT professor and pioneer of artificial intelligence\nName found in Epstein’s black book and on Epstein’s private-jet log.\nGeorge Mitchell: Former U.S. Senate majority leader\nName found in Epstein’s black book. Contributed a letter to Epstein’s birthday book. Once flew on his plane.\nThe former senator was appointed the U.S. special envoy for Northern Ireland by President Clinton and was an architect of the Good Friday Agreement. He called Epstein a “friend,” and the address book lists a dozen numbers for him under the heading “Piper, Rudnick,” the name of the Washington law firm where Mitchell was a partner. Though Mitchell has said he did not associate with Epstein after his 2008 conviction, documents released by the Justice Department indicate that he did continue to associate with him, including correspondence setting up meetings, and that he once flew on Epstein’s plane.\nRosa Monckton: Former CEO of Tiffany & Co. in the U.K.\nName found in Epstein’s black book.\nMonckton was Epstein’s “close friend since the early 1980s,” according to the 2003 profile of Epstein written by Vicky Ward in Vanity Fair: “Monckton recalls Epstein telling her that her daughter, Domenica, who suffers from Down syndrome, needed the sun, and that Rosa should feel free to bring her to his house in Palm Beach anytime.”\nAndrew Mountbatten-Windsor: Former prince, Duke of York\nAfter years of mounting pressure, King Charles III finally initiated the formal process for stripping Prince Andrew’s royal titles and other benefits following his long fall from grace over his longtime association with Epstein and Ghislaine Maxwell.\nRupert Murdoch: Media mogul\nName found in Epstein’s black book.\nMurdoch has two numbers — one New York, one California — listed in the address book.\nElon Musk: Billionaire tech mogul\nAccording to documents released by the Justice Department, Epstein and Musk corresponded by email numerous times between 2012 and 2014, including discussions about plans to meet and Musk visiting Epstein’s private island. In November 2012, Epstein emailed Musk, asking, “How many people will you be for the heli to island”; Musk replied, “Probably just Talulah and me. What day/night will be the wildest party on your island?” They discussed another possible visit during an exchange of emails in late 2013, when Musk wrote to Epstein, “Will be in the BVI/St Bart’s area over the holidays. Is there a good time to visit?,” and then the two went back and forth over the logistics.\nMusk has previously tweeted that “Epstein tried to get me to go to his island and I REFUSED.” After their correspondence was revealed, Musk tweeted, “I have never been to any Epstein parties ever.”\nKimbal Musk: Brother of Elon Musk\nAccording documents released by the Justice Department, there are multiple emails between Epstein and Kimbal Musk between 2012 and 2015, including Epstein inviting him to his private island. In one 2012 email, Musk thanks Epstein and others for connecting him with an unidentified woman whom he appears to have subsequently dated.\nNathan Myhrvold: Businessman\nThe legendary patent troll turned impresario of molecular gastronomy dined at Epstein’s home. He also contributed to Epstein’s birthday book.\nBoris Nikolić: Biotech venture capitalist\nEpstein and Nikolić were longtime friends who emailed extensively. Epstein named him as the “successor executor” of his will, which Nikolić said he was “shocked” to find out following Epstein’s death.\nMartin Nowak: Harvard professor\nContributor to Epstein’s birthday book.\nMehmet Oz: Television doctor, CMS Administrator\nA transaction report initially released in the DOJ’s Epstein files listed Oz’s name next to a $1,592 payment to a travel agency in 2004. The files also include a very short email with a redacted message sent by Oz to Epstein on January 1, 2016.\nJoe Pagano: Venture capitalist\nName found on Epstein’s private-jet log. He was also a contributor to Epstein’s birthday book.\nThe chief executive, secretary and treasurer, principal accounting officer, and principal financial officer of an insecticide-research company, Pagano even visited Epstein in jail.\nLarry Page: Google co-founder\nPer Wired, emails in the Justice Department documents indicate that Page and Sergey Brin once attended a lunch or dinner at Epstein’s house. There are also references to business dealings between Epstein and Page and travel-plan references suggesting that Page may have visited, or planned to visit, Epstein’s island in 2010.\nJoel Pashcow: Real-estate businessman, longtime Mar-a-Lago member\nHe contributed entries to Epstein’s birthday book, including a page that includes a photograph of Pashcow holding an oversize $22,500 check to Epstein from “DJ TRUMP” with the caption suggesting Epstein had sold a “fully depreciated” woman to Donald Trump. Notes the New York Times:\nMr. Pashcow appears to have contributed several consecutive pages to the book. On the page before the mock check is a vulgar cartoon depicting Mr. Epstein’s grooming of young girls: On one side, marked 1983, Mr. Epstein is handing out balloons to a group of girls; on the other, labeled 2003, he is receiving a naked massage from four topless young women. “What a great country!” it reads at the bottom.\nAndrés Pastrana Arango: Former Colombian president\nName found in Epstein’s black book and on Epstein’s private-jet log.\nRonald Perelman: Revlon chairman\nName found in Epstein’s black book.\nThe billionaire invited 14 guests, including Epstein, Jimmy Buffett, and DNC co-chair Don Fowler, to his Palm Beach home for a Bill Clinton fundraiser in 1995.\nItzhak Perlman: Violinist\nName found in Epstein’s black book.\nSteven Pinker: Linguist, Harvard professor, and author\nNoted Matt Stieb in our 2019 guide:\nPinker is one of the famous intellectuals most often linked to Epstein, but he says he flew on Epstein’s private plane only once in 2002 and that he was involuntarily placed next to him for a picture at Lawrence Krauss’s Origins Project’s annual conference in 2014: “If I had more wherewithal, I would not have indulged my friend in sitting with him. Despite what various friends and colleagues all said about what a genius he was, I found him tedious and distasteful. Even before I knew about the criminality, I found it irritating to talk to him, all the more so because the reason he was in the conversation was because he had given money to these various projects. He likes schmoozing with smart and intellectual people, but he couldn’t really or had very little interest in exploring an issue. He’d wisecrack, change subjects, or get bored after a few seconds. He’s a kibitzer more than a serious intellectual.” Nevertheless, Pinker supplied some linguistic expertise that his friend Alan Dershowitz used to defend Epstein during the 2008 trial.\nAlberto Pinto: Interior designer\nName found in Epstein’s black book and on Epstein’s private-jet log.\nWrote Wendy Goodman in our 2019 guide:\nForget for a moment the mural featuring Epstein in the middle of a prison yard complete with guards and barbed wire. Let’s also forget the life-size doll hanging from a chandelier, and the chess set with figures of his staff as pieces to play with. Let’s instead focus on the very lush Euro-Orientalist décor of Epstein’s 21,000-square-foot seven-story Beaux-Arts mansion, decorated by none other than the late great Alberto Pinto, one of the world’s top prestige interior designers. His clientele included princes, moguls, and wannabe princes, as captains of industry so frequently are, and Epstein clearly aspired to that provenance and history. He flew Pinto on his private plane, as he did other architects and designers (Jean-Michel Gathy, Ricardo Legorreta, and Peter Marino are also listed in Epstein’s flight logs), and lived like a modern pasha in rooms lavished with money that bought custom-tooled gold leather walls (at least they were made to look like tooled-leather walls) and leopard-print upholstered armchairs in the dining room that appear to be covered in silk velvet. It was exactly the sort of project Pinto relished, flexing all the artisanal muscle that a designer of his stature can exercise when cushioning his client’s home.\nBob Pittman: Chairman and CEO of iHeartMedia, Inc.\nName found in Epstein’s black book.\nStuart Pivar: Art collector, chemist\nPivar was close friends with Epstein and his art adviser, but he says he ended their friendship after Epstein accuser Maria Farmer told him Epstein had assaulted her.\nStacey Plaskett: U.S. Virgin Islands delegate to the House of Representatives\nFiles released by the House Oversight Committee include apparent text messages between Epstein and Plaskett during a congressional hearing with former Trump fixer Michael Cohen in 2019.\nChristopher Poole (a.k.a. “moot”): Founder of 4chan message board\nDocuments released by the Justice Department indicate that Epstein met with Poole in late October 2011 at the recommendation of his friend Boris Nikolic. After the meeting, Epstein told Nikolic in an email, “I like [him] alot. I drove him home, he is very bright.” The files indicate that Epstein and Poole tried to meet up again over the next several months, but it’s not clear if they did.\nFelix Posen: Philanthropist\nName found in Epstein’s black book.\nFormer business partner of Marc Rich (who was famously indicted for tax evasion and trading with Iran before being even more famously pardoned by President Clinton) with whom he paired on deals in the Soviet Union before the fall of Communism.\nTom Pritzker: Executive chairman of the Hyatt Corporation\nName found in Epstein’s black book and on Epstein’s private-jet log.\nAs our 2019 guide pointed out, Pritzker was known to dine with Epstein in the early aughts. He also emailed with Epstein in 2013.\nCarole Radziwill: Author and television personality\nName found in Epstein’s black book.\nRadziwill is the daughter-in-law of Lee Radziwill and a Real Housewife of New York.\nLewis Ranieri: The “father” of mortgage-backed securities\nName found in Epstein’s black book.\nRanieri was another Epstein dinner partner.\nBrett Ratner, Hollywood filmmaker\nImages released by the Justice Department include photos of Epstein with Ratner and Jean-Luc Brunel with different women, whose images have been redacted, at Epstein’s Manhattan townhouse. In some photos, Ratner can be seen sitting on a couch with Epstein and two women, embracing one sitting between him and Epstein. Ratner, who has faced numerous allegations of sexual assault and harassment and had been out of work as result until he recently directed the Melania documentary, had previously denied knowing or meeting Epstein. Speaking with Fox News, Ratner said the reason he was at Epstein’s house was because his fiancée at the time invited him there, that she was the one he was seen embracing in the photos, and that he hadn’t remembered meeting Epstein.\nBill Richardson: Former New Mexico governor\nName found in Epstein’s black book.\nPer our 2019 guide:\nEpstein donated $50,000 to each of his gubernatorial campaigns. A spokeswoman for Richardson told the Albuquerque Journal that Richardson recalls visiting Epstein’s New Mexico ranch only once, during his first run for governor in 2002.\nStephen Riggio: Barnes & Noble CEO\nRiggio was photographed with Epstein at the 1999 Edge Foundation Billionaires’ Dinner and twice met him at the TED conference.\nJoan Rivers: TV host, actress, and comedian\nName found in Epstein’s black book.\nCharlie Rose: Television journalist\nName found in Epstein’s black book.\nWrote Irin Carmon in our 2019 guide:\nYou learn things answering phones, and in the spring of 2005, answering Charlie Rose’s phone at his PBS show, you would learn that his friend Jeffrey Epstein had some recommendations to make for whom Rose ought to hire as his next assistant. Written call logs from 2005 and 2006 show Epstein and his own assistant calling dozens of times, making plans for lunch and tea in Manhattan or to try to meet up in Paris. Epstein also called with a total of five women’s names and phone numbers. One woman was described as “world’s most perfect assistant she used to work for Harvey Weinstein he’s lucky if he can get her.” Another entry reads, “Jeffrey Epstein wants to talk to you before you call these two girls.” A fourth woman shows up on the manifests of Epstein’s jet, including on Bill Clinton’s trip across Africa, and wound up working at the Clinton Foundation. Two former staffers remember another Epstein referral, a young woman not mentioned in the logs, who interned at the show. In all, Rose hired three (“Jeffrey Epstein from time to time recommended various candidates for open positions at the Charlie Rose Show,” Rose’s representative said in a statement, but said the ex-host only learned about Epstein’s alleged abuse years later, when he pleaded guilty in Florida). When I called one of these women recently, she was stunned to learn she was one of many women Epstein recommended for the job. “I was being offered up for abuse,” said the woman, who was 22 at the time she worked for Rose. It helped her understand not only how her boss Rose — whom in 2017 she would accuse, along with 34 other adult women, of sexual harassment — had treated her, but also how the rest of the staff had seen her. And it helped her understand a grim version of networking among powerful men.\nHenry Rosovsky: Harvard economist\nThe former Harvard professor and dean, who died in 2022, is listed as a contributor to Epstein’s birthday book, which includes “tit print” artwork “specially commissioned” by Rosovsky.\nDavid A. Ross: Art museum director, educator\nDocuments released by the Justice Department reveal ties between Epstein and Ross dating back to 1995, when Ross was the director of the Whitney Museum of American Art. The files include some 60 emails, including an exchange in 2009 in which Ross expressed interest in Epstein’s proposal “to fund an exhibition entitled statutory. Girls and boys ages 14 – 25, where they look nothing like their true ages.” Epstein added that “Some people go to prison because they can’t tell the true age.” That same year, Ross repeatedly expressed his support to Epstein, at one point calling his prison sentence for soliciting prostitution from a minor “an underserved punishment foisted upon you by jealous creeps.” Ross also appeared to seek Epstein’s financial support for his online magazine that year, and in 2015, he reached out to once again express his support and friendship after learning Epstein was being investigated again. In a statement to ARTnews, Ross said he became friends with Epstein because he was a “wealthy patron and a collector” and “when the reality of his crimes became clear, I was mortified and remain ashamed that I fell for his lies.” Ross resigned from his role as MFA Art Practice Chair at the School for Visual Arts on February 3.\nMarc Rowan: CEO and co-founder of Apollo Global Management\nAccording to documents released by the Justice Department, between 2011 and 2018, Epstein exchanged multiple emails with Rowan and other Apollo executives regarding the company’s tax affairs, and Rowan arranged to meet with Epstein multiple times. In 2016 an Epstein representative inquired about buying Rowan’s private jet, though apparently no sale was made. According to Bloomberg, Rowan once attended a meeting at Epstein’s Manhattan townhouse. Rowan succeeded Leon Black as CEO of Apollo after Black resigned in 2021 over his Epstein ties. Per the Financial Times, Apollo says that the company never did business with Epstein and that Rowan “had neither a business nor any other relationship” with him.\nJoanna Rubinstein: Humanitarian\nDocuments released by the Justice Department revealed that Rubinstein had visited Epstein’s private island in 2012 with her family and afterward thanked him for his hospitality. In a statement distancing herself from Epstein, she said she had accepted a social invitation to his island while vacationing nearby at the time, even though she was aware of his conviction. From 2015–2020, Rubinstein served as the director of the U.S. branch of the World Childhood Foundation, an organization that works to prevent child sexual abuse. After her ties to Epstein were revealed, she resigned as chair of Sweden for UNHCR, a U.N. refugee agency.\nKathryn Ruemmler: Goldman Sachs general counsel, former White House counsel\nEpstein’s schedules contained more than three dozen meetings with Ruemmler starting in 2014; they emailed extensively up until months before his arrest, including discussions about Ruemmler’s post–White House career and Epstein trying to help her land a senior position at Facebook. Documents released by the Justice Department show that Epstein also sent numerous gifts to Ruemmler, including $10,000 worth of Bergdorf Goodman gift cards, flowers, one million Amex points, and an Hermès bag.\n“I regret ever knowing Jeffrey Epstein,” Ruemmler said in 2023. Goldman Sachs said in a statement, “It’s well known that Epstein often offered unsolicited favors and gifts to his many business contacts.”\nAmy Sacco: Nightlife impresario\nName found in Epstein’s black book.\nPer our 2019 guide:\nThe undisputed club queen of aughts New York, Sacco ran Lot 61 in Chelsea, which was famous for using fresh fruit in its drinks, and later Bungalow 8, which prided itself on discretion, the kind of place where celebrities could behave badly and not have to worry about appearing in “Page Six.” Sacco was a pioneer of marrying nightlife with concierge-style indulgences for the very rich: Her staff would get you whatever you needed: pizza delivery, peanut M&M’s, a private flight to Miami leaving from Teterboro as soon as you could get there.\nRoger Schank: AI theorist, chief learning officer at Trump University\nThe computer scientist and longtime academic, who died in 2023, was longtime friends with Epstein and attended a 2002 AI summit Epstein hosted on his private island. He also defended Epstein after his sex-offense conviction and visited him in prison in 2008, then defended him again in a 2019 interview. According to the documents released by the Justice Department, they continued to arrange meetings and correspond by email until at least 2017.\nChuck Schumer: U.S. Senator\nSchumer was one of the many politicians to receive donations from Epstein over the years. Epstein gave bipartisan-ly but not equally: Between 1990 and 2004, he gave more than $139,000 to Democrats and just over $18,000 to Republicans. Epstein also gave to a handful of politicians in New Mexico, where he’d purchase the Zorro Ranch from former governor Bruce King and where he was not required to register as a sex offender. After Epstein’s downfall, Schumer was one of the politicians who decided to make a donation to charity of the amount Epstein donated to them.\nTed Serure: Bear Stearns co-worker\nContributed a letter to Epstein’s birthday book.\nMaria Shriver: Journalist and former First Lady of California\nName and two California phone numbers found in Epstein’s black book.\nPeggy Siegal: Elite New York publicist\nSiegal worked with Epstein for years, helping him expand his network and improve and protect his image. As Carl Swanson explains our 2019 guide:\nA brazen and relentless publicist of the old school, Siegal understands one thing well: “Bringing people together. Everyone needs to feel that they belong.” At least a certain kind of accomplished person, no matter, frankly, how they went about getting there (who was she to judge?). Known for her movie premieres and other guest-list-driven social events, she bragged that she “ruined the Hamptons” to Vanity Fair in a profile back in 1996. Publicity-party invites are an amoral game, driven by status and FOMO. Like everyone, she worked with Harvey Weinstein when he was an Oscar machine, the toast of the town. So you can’t blame Siegal for including someone who already knew all the boldface power people. In 2008, in the teeth of the accusations against Epstein, he was spotted by a New York party reporter, “unshaven, smiling that feline-monkey grin,” at the Siegal-engineered screening of the HBO film Bernard and Doris at the Time Warner Center. But after prison, apparently Epstein needed her more than ever: In a Times story on how Manhattan’s A-list refused to shun him, Siegal in particular was willing to help him (for free, apparently), “using her gate-keeping powers to usher Mr. Epstein, a friend, into screenings and events.” In 2010, she threw a dinner party at his Upper East Side townhouse for Prince Andrew, Katie Couric, George Stephanopoulos, Charlie Rose, and Woody Allen. She and Epstein might have had other reasons to get along: Siegal, who has just turned 72, is a self-invention as well, without a particularly pedigreed background. Also notable is the fact that, as she told Vanity Fair in 2012, “my favorite way to travel” to Cannes is “on a friend’s G5 from Teterboro to Nice.”\nSteven Sinofsky: Former Microsoft executive\nAccording to the Justice Department files, Sinofsky, the former head of Windows, corresponded extensively and met with Epstein while seeking (and apparently paying for) the financier’s guidance in the aftermath of his abrupt and messy departure from Microsoft in late 2012. Epstein pushed Sinofsky to fight for more money while negotiating the terms of his exit, and Sinofsky ultimately walked away with a $14 million retirement package in 2013. Epstein also gave Sinofsky career advice and tried to help him land a new job at Apple or Samsung. Epstein and Sinofsky continued to correspond and meet up until at least 2017.\nIt’s not clear from the DOJ files how Sinofsky was connected to Epstein, but his partner, neurosurgeon Melanie S. Walker, worked for Epstein as a science adviser in 1998.\nRodney Slater: Secretary of Transportation under Bill Clinton\nName found on Epstein’s private jet log.\nFlight logs record Slater taking a flight from Ghana to Nigeria in September 2002.\nPeter Soros: Nephew of George Soros\nName found in Epstein’s black book.\nGeorge Soros’s name is not in there.\nKevin Spacey: Actor\nName found in Epstein’s black book and on Epstein’s private-jet log.\nFlew with Bill Clinton to Africa (and, according to flight logs, the Azores) on Epstein’s plane.\nMerrie Spaeth: Crisis strategist\nEpstein emails obtained by Bloomberg in 2025 revealed coaching sessions and correspondence between Epstein and Spaeth in 2008, including three public apologies Spaeth drafted for him months before he pleaded guilty to sex offenses. When asked about her consulting work with Epstein, Spaeth told Bloomberg that she “ultimately terminated the engagement because of my discomfort with it.” But according to the DOJ files, she did more consulting work for him 2011, and in early 2015, she reached out to once again offer her firm’s assistance regarding “recent continuing publicity” adding, “just want him to know he has friends who are thinking of him.” In a new statement to the Dallas Morning News, Spaeth said “I am embarrassed that I had any involvement whatsoever including our follow ups with him.”\nWarren Spector: Bear Stearns executive\nName found on Epstein’s private-jet log.\nCaroline Stanbury: Socialite\nName found in Epstein’s black book.\nStanbury went on to star on Bravo’s Ladies of London.\nKenneth Starr: Former United States solicitor general\nWrote Jonathan Chait in our 2019 guide:\nObviously, lawyers do not share guilt for their clients’ crimes. But it’s striking that Kenneth Starr chose to join Jeffrey Epstein’s defense team in 2007, after his moral fulminations against Bill Clinton’s sexual perfidy. His obsessive pursuit of President Clinton made him a folk hero on the right, representing the defense of traditional sexual virtue and the notion that it was under assault by Bill Clinton and the liberal elite. His special-prosecutor exploits propelled him to the presidency of the conservative Baptist Baylor University. During his tenure, the football program engaged in a horrific pattern of sexual abuse that led to the dismissal of the football coach and the removal of Starr after an investigation found “actions by University administrators that directly discouraged some complainants from reporting or participating in student conduct processes.”\nIt is perhaps coincidental, but Starr has tracked the broader conversion of the religious right from sexual shaming to sexual shamelessness. In an era when Donald Trump has exposed the hollowness of so many values conservatives allegedly hold dear, it is fitting that this Zelig of right-wing sexual hypocrisy has made yet another cameo.\nJes Staley: Former Barclays CEO\nStaley, who resigned from Barclays in 2021 for his association with the sex criminal, had a close connection with Epstein. “I deeply appreciate our friendship,” Staley wrote to him in 2009 when he was working at JPMorgan Chase. “I have few so profound.” Emails show that Epstein helped connect him to his high-society associates, including Prince Andrew, Bill Gates, former New York Fed board member Lee Bollinger, and Dubai businessman Sultan Ahmed bin Sulayem.\nGeorge Stephanopoulos: Journalist, former White House communications director\nStephanopoulos attended a dinner at Epstein’s Upper East Side townhouse for Prince Andrew in 2010. “That dinner was the first and last time I’ve seen him,” Stephanopoulos later said. “It was a mistake to go.”\nLarry Summers: Former Treasury secretary and former Harvard president\nAccording to the Justice Department and House Oversight files, the elite economist maintained a friendship with Epstein well after his 2008 conviction, chatting frequently and exchanging creepy emails with the financier, including ones about Summers pursuing an affair with a woman he was mentoring. The subsequent fallout for Summers was swift and intense: he stepped down from the board of OpenAI and stepped away from Harvard and numerous public commitments.\nFettah Tamince: Turkish billionaire, founder of Rixos Hotels\nIn a June 2017 email exchange, Sultan Ahmed bin Sulayem reached out to Tamince and asked him to arrange for Russian, who he described as “the personal masseuse at the private Spa of our friend Jeffery Epstien,” to “work as a trainee” at the spa of the Rixos hotel in Antalya, Turkey “so she gains better experiences.” Tamince replied, “I will make sure asap.” Tamince’s personal assistant subsequently followed up, Epstein said she should “learn as much as she can. all treatments etc.” They later set up the travel arrangements and training for both her and, at Epstein’s request, “another assistant.”\nJulie Taymor: Director\nName found in Epstein’s black book.\nTaymor was responsible for one of the biggest hits in Broadway history, The Lion King, and one of the biggest flops, Spider-Man: Turn Off the Dark.\nPeter Thiel: Billionaire venture capitalist\nAccording to Epstein’s schedules and emails, he and Thiel met up numerous times and corresponded via email between at least 2015 to 2019. In a 2016 email exchange, Thiel asked Epstein for his thoughts on the presidential race, and Epstein advises him “you should be closer,” then later suggests they continue their conversation via an encrypted messaging app. Epstein also invested $40 million in Valar Ventures, an investment firm Thiel co-founded. In 2018, Epstein invited Thiel to his Caribbean island; a spokesperson for Thiel says he never went.\nSteve Tisch: Film producer, co-owner of the New York Giants\nDocuments released by the Justice Department include email correspondence from 2013 in which Epstein tries multiple times to set Tisch up with women. In one email chain titled “Ukrainian Girl,” Tisch mentions having lunch with Epstein’s assistant’s friend, whom he had met at Epstein’s house. They also discuss another unidentified woman, and Tisch asks if she is a “pro or civilian.” In another email, Epstein asks him to “send me a number to call I dont like records of these conversations.”\nIn a statement to news organizations following the release of the documents, Tisch said he and Epstein had a “brief association where we exchanged emails about adult women, and in addition, we discussed movies, philanthropy, and investments. I did not take him up on any of his invitations and never went to his island. As we all know now, he was a terrible person and someone I deeply regret associating with.”\nJean Todt: French motorsport executive, former president of FIA\nAccording to the DOJ files, Todt met Epstein at Epstein’s Manhattan home in 2017. The meeting seems to have been facilitated by Norwegian diplomat Terje Rød-Larsen.\nRobert Trivers: Evolutionary biologist\nIn 2015, he defended Epstein, saying, “By the time they’re 14 or 15, they’re like grown women were 60 years ago, so I don’t see these acts as so heinous.” In 2019, he called his past statement “stupid and offensive.”\nDonald Trump: President of the United States\nThere’s a whole lot to dig into here, from their former friendship, to Epstein’s many allegations about Trump, to Trump’s lewd contribution to Epstein’s birthday book.\nIvana Trump: Donald Trump’s first ex-wife\nName found in Epstein’s black book.\nIvanka Trump: Daughter of Donald and Ivana Trump\nName found in Epstein’s black book.\nMelania Trump: Wife of Donald Trump and First Lady of the United States\nEpstein has reportedly claimed he was the one who introduced Melania to her future husband, which Melania vehemently denies. The three have traveled together, however: She flew with Epstein on then-boyfriend Donald Trump’s plane in 2000. Documents released by the Justice Department also include a 2002 email from someone named Melania to Ghislaine Maxwell telling her “you look great on the picture” in the “nice story about JE in NY mag.” (That would be this story.)\nChris Tucker: Actor\nName found in Epstein’s black book and on Epstein’s private-jet log.\nTucker flew with Bill Clinton to Africa on Epstein’s plane. He is also seen posing with with Ghislaine Maxwell on an airport tarmac in an undated photo included in the files released by the Justice Department.\nEdward Tuttle: Architect of Epstein’s island compound\nName found on Epstein’s private-jet log.\nExplained Max Read in our 2019 guide:\nWho built the temple? Tuttle, a designer of luxury resorts by trade, renovated the main compound on Epstein’s 70-acre private island in 2003. Sometime between 2009 and 2013, a “temple” appeared on the island: a large, boxy, blue-and-white-striped structure with a golden dome, surrounded by palm trees. In the days after Epstein’s arrest, the temple became the object of fervent speculation online. It was the kind of irresistible conspiracy-bait that exemplifies the Epstein story: On the one hand, shouldn’t it be enough that a mysteriously wealthy banker with connections to the globe’s most powerful people was apparently operating a child sex-trafficking ring without dabbling in theories about occult island temples? On the other hand, though, once you’ve accepted that, why would occult island temples be so out of the question? On the edges, the Epstein saga could seem less like a news story than like a brutal, unreadable fairy tales. Or maybe it was a desire to take a story about financial power and social privilege colluding to protect a criminal predator and transform it into something more terrible and monumental. After weeks of speculation, the first eyewitness account revealed that what the “temple” contained wasn’t a necromantic shrine but a gym, decorated with a framed photograph of a topless woman.\nCyrus Vance Jr.: Former Manhattan district attorney\nWrote Irin Carmon in our 2019 guide:\nThere are currently 475 level-three sex offenders registered in New York County, but in 2011, when an attorney from the office of Cy Vance, Manhattan DA, argued that Epstein’s risk level should be reduced, Justice Ruth Pickholz responded, “I have to tell you I am a little overwhelmed because I have never seen a prosecutor’s office do anything like this.” Pickholz denied the request — Epstein’s risk assessment put him 20 points above the required threshold for the highest level of offender — and the DA’s office later reversed its request. Though there’s no indication Vance and Epstein were friendly, his office has been criticized previously for declining to pursue sex-crimes charges against Harvey Weinstein that coincided with a donation from his attorneys (though Weinstein has since been charged by Vance’s office) and fraud charges against Ivanka and Donald Trump Jr.\nBrian Vickers: Former NASCAR driver\nVickers’s ex-wife, Sarah Kellen is an alleged (unindicted) co-conspirator in Epstein’s sex trafficking ring, though she has said she was also one of Epstein’s victims. According to the Justice Department files, Vickers corresponded with Epstein dating from at least 2012 to 2019, and Epstein was involved effort in 2013 effort to protect one of Vickers’s sponsorship deals as his and Kellen’s links to Epstein came to light. Vickers also sent Epstein a lewd email forward in 2012 and some kind of video (it’s redacted in the DOJ files) as a Valentine’s Day message in 2019.\nLinda Wachner: Head of the textile corporation behind Calvin Klein and Speedo\nName found in Epstein’s black book.\nMike Wallace: 60 Minutes journalist\nName found in Epstein’s black book.\nBarbara Walters: Broadcast journalist and TV personality\nName found in Epstein’s black book.\nVera Wang: Fashion designer\nListed on Epstein’s schedules, contributor to Epstein’s birthday book.\nAccording to The Wall Street Journal, the designer was one of the people listed on Epstein’s schedules after 2008. And some victims the Journal spoke with said that Epstein had used Wang’s name while leading the victims to believe he would help them with their fashion careers. Per the Journal, “Wang said she regrets ever associating with Epstein. ‘I never knew he was using my name in any capacity, and it horrifies and repulses me to now hear that he did so,’” she said.\nCasey Wasserman: Founder of Wasserman Group, head of the Los Angeles Olympics organizing committee\nAccording to documents released by the Justice Department, Wasserman exchanged flirtatious emails with Epstein accomplice Ghislaine Maxwell in 2003. He has said in a statement that he “deeply regrets” the correspondence and that although he once flew on Epstein’s plane as part of a Clinton Foundation humanitarian trip in 2002, “I never had a personal or business relationship with Jeffrey Epstein.”\nBob Weinstein: Former co-chairman of Miramax Films and the Weinstein Company\nName found in Epstein’s black book.\nLeslie Wexner: Billionaire retail magnate\nName found in Epstein’s black book, contributor to Epstein’s birthday book.\nWrote Michelle Celarier and Carl Swanson in our 2019 guide:\nRetailing billionaire Leslie Wexner was Epstein’s only known client, the man who transferred the rights to that famous townhouse to him for free in 2011, years after they were supposed to no longer be in contact. The relationship stretches back to the late 1980s, a time when Wexner’s star was on the rise. A 1985 cover story for New York visited him in Columbus, Ohio, where his retail empire was built. Journalist Julie Baumgold described how he, not unlike Epstein, was a self-made man, addicted to self-improvement, how he didn’t know how to pronounce La Grenouille correctly and wanted to have his picture taken at the Whitney, and noted that “Wexner is what used to be known as a ‘confirmed bachelor.’ ” (He later married and has four children.) Not long after that piece, he was introduced to Epstein, who had left Bear Stearns under a cloud and was broke. He and Wexner hit it off, and Epstein soon began managing Wexner’s finances. Wexner’s credibility lent plausibility to the notion that Epstein managed billions from his Caribbean-island redoubt. Associates of Wexner, who is now worth $6.6 billion, didn’t understand the attraction. Soon after the men began working together, Epstein moved into Wexner’s Upper East Side mansion. Wexner bought the seven-story townhouse in 1989 for $13.2 million but apparently lived there only for a few months. The title was transferred in 2011 to a Virgin Islands entity controlled by Epstein. It is now worth $56 million.\nElie Wiesel: Nobel Prize winner\nName found in Epstein’s black book.\nMichael Wolff: Journalist\nEpstein’s emails contain extensive correspondence between him and Wolff, including many exchanges related to Trump, and messages in which Wolff appeared to be advising Epstein. Wolff has since said he was trying to play Epstein in order to get him to share information about Trump.\nElliot Wolk: Bear Stearns co-worker\nContributed a letter to Epstein’s birthday book.\nNina and Tim Zagat: Publishers\nNames found on Epstein’s private jet log.\nJide Zeitlin: Former CEO and chairman of Tapestry\nAccording to the Justice Department files, Zeitlin and Epstein were introduced in early 2018 by Steve Bannon, who called Zeitlin a “close friend.” They then corresponded periodically for more than a year and also met up in person. In some of their email exchanges, they discussed Trump administration diplomacy and foreign business opportunities, and Epstein linked Zeitlin up with DP World CEO Sultan Ahmed bin Sulayem and others. In 2019, Zeitlin met with an Epstein associate about a possible job at Tapestry (the parent company Coach and Kate Spade New York), apparently at Epstein’s request. The associate’s name is redacted from the files.\nZeitlin resigned from his role leading Tapestry in 2020 after a reporter dug into allegations that he had once used an alias to moonlight as a fashion photographer, took photos of multiple women, some of which were sexually suggestive, and had a consensual extramarital affair with one of the models.\nIra Zicherman: Former senior managing director at Bear Stearns\nName found in Epstein’s black book and on his private jet log, contributed a letter to Epstein’s birthday book.\nZicherman was also a founding trustee of Epstein’s charitable foundation.\nMark Zuckerberg: Facebook CEO and co-founder\nEmails in the Justice Department documents indicate Epstein and Zuckerberg met at least once, at an August 2015 dinner with several other tech CEOs hosted by Reid Hoffman. Days after the dinner, Hoffman connected Epstein and Zuckerberg via email “so that convo can continue,” but so far there’s no indication they ever corresponded, or that Zuckerberg had any other association with him.\nMort Zuckerman: Media mogul and newspaper publisher\nZuckerman went into business with Epstein — briefly — in 2004, spending $25 million to invest in Radar, but he pulled the plug after just three issues. He first attempted a deal with Epstein in 2003, when he was part of a consortium with Michael Wolff, Donny Deutsch, Nelson Peltz, and Harvey Weinstein to buy New York Magazine. Zuckerman also contributed a satirical letter to Epstein’s birthday book.\nThis post has been updated throughout.\nMore on the epstein files\n- Did Bondi Spy on Lawmakers’ Epstein Search History?\n- Pam Bondi Refuses to Apologize to Epstein Victims at House Hearing\n- Trump Told Police Chief ‘Everyone’ Knew About Epstein Abuse",
  "word_count": 17800,
  "scraped_at": "2026-02-14T13:10:47.213208"
}