{
  "article_id": "e5af4441e6c2",
  "url": "https://www.justarsenal.com/lia-walti-warns-emma-hayes-that-arsenal-women-are-not-going-to-be-nicer-to-her/355289",
  "title": "Lia Walti warns Emma Hayes that Arsenal Women  are not going to be nicer  to Chelsea",
  "date": "20231209T154500Z",
  "domain": "justarsenal.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "The most crucial match in women’s football this weekend is without a doubt Arsenal women vs. Chelsea women. The two WSL heavyweights will square off at the Emirates this Sunday in a top-of-the-table duel.\nArsenal hasn’t beaten Chelsea in the league since 2021, which indicates that recent fortunes aren’t on their side.\nEven so, Arsenal fans will be hoping for a big win over the Blues this weekend, which would bring them equal on points (22) with the reigning champions at the top of the table.\nThe Gunners will go into this game full of confidence, having already defeated and drawn with two other reputed title contenders: Manchester City (1-0) and Manchester United (2-2). And they’re on a six-game winning streak.\nWith a stronger squad and the fact that they have beaten the Blues (3-1) in the Continental Cup this calendar year, there is reason to anticipate that Sunday may be memorable for the Gunner women at the Emirates and they can prove themselves to be serious title challengers this season.\nLia Walti spoke ahead of the game, staking her claim about the London Derby. In her admissions, she claimed that they would be determined to stop Emma Hayes and her Chelsea team at the Emirates on Sunday in a spectacular London derby. She stated that Arsenal wants to frustrate the Chelsea boss because it may be the last time they do so because she is leaving.\n“Emma has done so much for women’s football in the English league. We all have the biggest respect for what she did here. But we also don’t want her to finish that era on a high,” said Walti.\n“We’re here to compete with Chelsea. We’re here to win trophies, and we’re not going to be nicer to them just because it’s Emma’s last year, that’s for sure.”\nDo you think Arsenal’s women will beat Chelsea this Sunday? I think they will give everything they’ve got to garner all 3 points and increase the pressure in the title race.\nCOYGW!\nMichelle Maxwell\nFollow JustArsenal’s Gooner Women on Just Gooner Women on Twitter for regular updates on the Arsenal Womens Team!\nDo you want to read more about the Arsenal Women’s Team? Click here….",
  "word_count": 369,
  "scraped_at": "2026-02-14T12:22:13.116352"
}