{
  "article_id": "e5cc03e2276f",
  "url": "https://joannenova.com.au/2019/08/prof-andy-pitman-admits-droughts-are-not-worse-and-not-linked-to-climate-change/",
  "title": "Prof Andy Pitman admits droughts are not worse and not linked to climate change « JoNova",
  "date": "20241218T223000Z",
  "domain": "joannenova.com.au",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Drought Panic Over\nh/t to Jim Sternhill, Frank Brus, via Jim Simpson.\nIn June Professor Andy Pitman quietly dropped a bomb:\n“…as far as the climate scientists know there is no link between climate change and drought.”\n“…there is no reason a priori why climate change should made the landscape more arid.“\nHe’s admitting there’s never been a scientific basis for the endless climate drought scares? He went on to say that in Australia, droughts are not increasing, and there’s no drying trend in one hundred years of data. He’s also admitting the models can’t predict extremes in rain either. Where are the press releases?\nIt’s great to hear him speaking like a skeptical scientist, with candor and care, but 52% of Australians (including many of our politicians) think “climate change” is already causing more frequent droughts. So half the country is not only convinced droughts are increasing, but they think climate change is causing an effect that isn’t happening. And the world is spending $330b a year on windmills and solar panels in the hope of stopping droughts, among other things.\nPitman follows this with: “this may not be what you read in newspapers…” No, Sir. And the 64 billion dollar question (which isn’t asked) is — why not? And what are you doing about that?\nDoes Andy Pitman keep trying to tell journalists the full and accurate story and they won’t print it? (Well, we know what that’s like.) Given his roles as Director of the ARC Centre of Excellence for Climate System Science, and as a Lead Author for the IPCC, does it bother him when he sees his specialty misreported over and over again? Since the taxpayer funds him, isn’t there an obligation to correct the record?; to flick an email to the ABC journalists who keep saying climate change is linked to drought, or drop a five minute phone call to Peter Hannam of the Sydney Morning Herald who is still getting it wrong? He may even want to call his own researcher at the centre where he is a director. Andrew King advised Hannam on that last link which is filled with “human fingerprints” of “drought” and emerging “greenhouse signals”. The article even says — completely incorrectly —“Australia is among the regions of the world where the drying trend is clearest”.\nThe SEI forum: Adapting Climate Science for Business\nWednesday 19 June, 2019, Sydney Environment Institute (SEI), University of Sydney.\nAt 1:11:20\n“…this may not be what you expect to hear. but as far as the climate scientists know there is no link between climate change and drought.\nThat may not be what you read in the newspapers and sometimes hear commented, but there is no reason a priori why climate change should made the landscape more arid.\nIf you look at the Bureau of Meteorology data over the whole of the last one hundred years there’s no trend in data. There is no drying trend. There’s been a trend in the last twenty years, but there’s been no trend in the last hundred years, and that’s an expression on how variable Australian rainfall climate is.\nThere are in some regions but not in other regions.\nSo the fundamental problem we have is that we don’t understand what causes droughts.\nMuch more interesting, We don’t know what stops a drought. We know it’s rain, but we don’t know what lines up to create drought breaking rains.”\nBookmark this page. I’ll be referring back to these quotes.\nJust trying to help Prof Andy Pitman get his message out — the whole truth and nothing but the truth.\nAs I’ve been saying, the Federation drought was worse than anything modern. The worst droughts in Australia were 1,000 to 2,000 years ago and there’s no trend in Australian droughts. And who could forget the recent study by Ashcroft showing that 178 years of Australian rain has nothing to do with CO2?\nUPDATE: Figure this: Andy Pitman says “we don’t understand what causes droughts” but “the indirect link is clear”!\nAndy is a climate modeler with a major focus on terrestrial processes in global and regional climate models. He has explored the global and regional impacts of land cover change and currently co-leads the Land use change: identification of robust impacts project. He has interests in climate extremes and how these are likely to change in the future. His leadership and research experience is extensive nationally and internationally. Between 2004 and 2010 he convened the ARC Research Network for Earth System. Since 2011 he has been the Director of the ARC Centre of Excellence for Climate System Science. This national centre involves five Universities, major Australian research agencies and many international groups. Andy is a member of the Academy of Science’s National Committee for Earth System Science and the NSW Minister for the Environment’s Science Advisory Committee. He is closely affiliated with the World Climate Research Program (WCRP). He was chair of the WCRP’s Land Committee for the Global Land Atmosphere System Study from 2006 to 2008, and is now on its Science Steering Committee.",
  "word_count": 847,
  "scraped_at": "2026-02-14T12:09:56.722726"
}