{
  "article_id": "e5d923697c77",
  "url": "https://wtug.com/ixp/532/p/west-alabama-thursday-briefing-91/",
  "title": "West Alabama Thursday Briefing",
  "date": "20250306T174500Z",
  "domain": "wtug.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "West Alabama Thursday Briefing\nGood morning West Alabama! It is Thursday, March 6, 2025. This is the 65th day of the year with 300 remaining.\nThursday Morning Observations:\nWhat about keeping shooters from killing and wounding mass numbers of people do some people not understand about legislation that would ban Glock Switches? Banning the switches will not impugn on anyone's Second Amendment rights but it can and will save lives.\nGlock Switches alter the trigger mechanisms of semi-automatic pistols and rifles, enabling the guns to continuously fire rounds as long as the trigger is depressed, and the gun has ammunition. These devices can allow pistols to fire at rates of up to 1,200 rounds per minute. This is a capability that only the military should possess.\nAlthough weapons and devices that can create automatic weapon fire have been tightly regulated by the Feds since the 1930s, only 23 states have similar laws.\nJorge Leon invented the switch for the Venezuelan military and police 27 years ago but after reading how many people have died in the U.S. because the switches have fallen into criminal hands, he told ABC News he regrets the invention and getting a US Patent.\n\"After seeing and reading about all those deaths, those unnecessary deaths of youngsters, of police officers, of broken families, I don’t feel nice about that, I don’t feel good,\" Leon lamented.\nSB116, sponsored by Sen. Will Barfoot, R-Montgomery, would make, \"...possessing any part or combination of parts designed and intended to convert a pistol into a machine gun, often known as Glock switches, punishable by a term between 366 days and 10 years, according to state code.\"\nThe bill passed the senate and is now headed to the full house for a vote, perhaps as early as tomorrow.\nThe bill has the backing of Gov. Ivey but there are those who think any type of law impacting firearms is an infringement upon their liberty, it is not. As long as Glock Switches are legally available, more and more people will die. What about their right to life, liberty and the pursuit of happiness?\n(Opinions expressed in Morning Observations are those of the author and not necessarily those of the ownership, management, staff or sponsors of Townsquare Media Tuscaloosa.)\nWeather:\nGet ready for a rainy weekend ahead. The precipitation will amount to an inch or less, but it will help further reduce the ongoing wildfire threat. The other good part is the rain will come with little threat of severe weather. The rain chances will run until around midday Monday.\nThe Forecast:\nTopping the News:\nMayor Maddox is Grateful for Election Win\nSpring Break Elicits Some Advisories\nMercedes Benz of Tuscaloosa Deals With Hateful Social Media\nNext Governor's Race Could Be Interesting\nHeated Debate on 10 Commandments in Schools\nDemopolis Healthcare High School Gets Leader\nTopping Sports News:\nBama Men Stumble Against Gators",
  "word_count": 480,
  "scraped_at": "2026-02-14T14:15:28.904011"
}