{
  "article_id": "e61b082ef3d7",
  "url": "https://www.irishtimes.com/obituaries/2024/12/27/obituaries-of-2024-charlie-bird-nell-mccafferty-ian-bailey-and-more-50-people-who-died-in-2024/",
  "title": "Tony OReilly , Nell McCafferty , Ian Bailey and more : 50 people who died in 2024 – The Irish Times",
  "date": "20241227T091500Z",
  "domain": "irishtimes.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "The weekly Irish Times obituary page highlights the deaths of people whose lives made an impact, for better and occasionally for worse, on Irish society or on the greater world. This year, obituary writers remembered the lives of more than 110 people. They included broadcasters, environmentalists, soccer managers, judges, writers, journalists and business people. Some were household names, such as politician Mary O’Rourke, journalist Nell McCafferty or broadcaster Micheál Ó Muircheartaigh while others quietly made a huge impact in their chosen fields. Frank Hayes shaped Kerry Group’s public identity during pivotal years. Hazel Allen was a gifted restaurateur who preferred to remain out of the limelight at Ballymaloe House, while Justin O’Brien was a lifelong campaigner for the most marginalised people in society. And some were controversial figures who merited inclusion because of their newsworthiness.\nAll these obituaries can be read on irishtimes.com but here we select 50 people whose deaths were marked by an obituary in the newspaper this year:\nEddie O’Connor\nEntrepreneur\nEddie O’Connor, who died on January 5th aged 76, was a pioneering figure in the renewable energy sector, particularly wind energy.\nHe was chief executive of the Irish semi-State peat development company, Bord na Móna, when, in 1989, a board member told him that carbon dioxide was dangerously heating the world. He later recalled his shock at realising that the company he led was responsible for 10 million tonnes of carbon dioxide from peat used in power generation. From then on, he decided that renewable energy was going to be the mission. In 1997, he founded Eirtricity (now SSE Airtricity), an electricity supplier and wind farm development company which constructed the Arklow Bank offshore wind farm. He was also co-founder of Mainstream Renewable Power.\nREAD MORE\nHe was a strong advocate for a European supergrid using thin, fast, cost-effective and energy-efficient cables to distribute electricity from renewable sources, using technology he was developing in the SuperNode superconductor technology project with his Norwegian partner company, Aker Horizons.\nIn 2003, O’Connor was named World Energy Policy Leader by Scientific American magazine while in 2009, he was presented with the first leadership award at the annual Ernst & Young Global Renewable Energy awards.\nMáire Ní Mhurchú\nBroadcaster\nThe Cork-based RTÉ broadcaster Máire Ní Mhurchú died on January 11th, aged 90. She was an award-winning presenter and head of regional radio broadcasting in Cork City. When she joined RTÉ Cork local radio in the 1950s, she travelled to schools and homes to record many hours of interviews with children for series such as Young Munster on the Air, Munster Journal and Children Talking. She also worked with broadcaster Síle Ní Bhriain on a series entitled A Woman’s World. And, with a team of helpers, she put together the annual hour-long programme about the Cork Choral Festival.\nHer most celebrated documentaries include The Echo Boys, a profile of the newspaper boys who sold The Evening Echo on the streets of Cork City, and Someone To Love, a two-part radio series on the harsh life in a convent orphanage in the 1960s. She won a Jacob’s Award in 1969 for her broadcasting work.\nIn 1989, Ní Mhurchú was promoted to divisional head of Cork Local Radio, which was rebranded as Cork 89FM when the first independent radio stations were being licensed. She retired in 1998.\nShe was credited with launching the careers of broadcasters such as Mary Wilson, Tony O’Donoghue, Eileen Whelan, Ger Canning and Marty Morrissey.\nChristopher Moriarty\nBiologist\nChristopher Moriarty, who died on January 13th aged 87, was a biologist who developed innovative strategies to expand the Irish eel fisheries industry. He was also a prolific author of books and articles on many aspects of nature in Ireland.\nHis parents encouraged his passion for the outdoors in the still partly rural Rathfarnham where he grew up. As a student, he expanded the natural history society membership of St Columba’s College to 40 members. After attaining a zoology degree from Trinity College Dublin, he joined the Civil Service in 1959, and rapidly became the national expert on eels.\nHe regularly published highly regarded scientific papers and was an influential figure in the European Inland Fisheries and Aquaculture Advisory Commission of the UN Food and Agriculture Organisation. He was also a key figure in the Dublin Naturalists’ Field Club and served as its president in the 1970s.\nHis publications include books on the river Liffey and the Dodder, a guide to Irish birds, a natural history of Ireland, an exploration of the history of Leinster and a collection of his eponymous columns in this newspaper.\nHe was also one of the first Agency for Personal Services Overseas (APSO) volunteers, taking two years’ leave to help set up a successful course in fisheries management for the Ibadan University of Nigeria in the mid-1970s.\n[ Finding the Liffey’s source: Anna Livia takes her first steps – The Irish TimesOpens in new window ]\nIan Bailey\nMurder suspect\nIan Bailey, the chief suspect for the 1996 murder of Sophie Toscan du Plantier, died in west Co Cork on January 21st, days before his 67th birthday.\nA controversial figure, some saw the Englishman as the victim of a grave injustice while others believed he was a calculating individual whose portrayal of himself as the wronged party was the ultimate affront to Toscan du Plantier’s family.\nHe had been working as a freelance journalist when he moved to Ireland in 1991, and later moved in to the home of Welsh artist Jules Thomas, near Schull. After Toscan du Plantier’s body was found at her west Cork holiday home on December 23rd, 1996, he reported as a journalist on the murder but later became the prime suspect.\nDespite being arrested by gardaí for questioning in 1997 and 1998, no prosecution was brought. When a European Arrest Warrant issued by the French authorities was endorsed by the High Court in 2010, he appealed to the Supreme Court and won his case.\nHe subsequently lost a civil action against the State for wrongful arrest and conspiracy to frame him for the murder. In 2019, Bailey was convicted in Paris, in his absence, of voluntary homicide but served no jail time having successfully blocked his extradition in the Irish courts.\nIvor Browne\nPsychiatrist\nPioneering psychiatrist Ivor Browne died on January 24th, aged 94. He has been credited with transforming attitudes to mental illness, particularly his understanding of the role of trauma. He believed that mental illness was rooted in traumatic experience and, while he believed that drugs could play a role in helping patients, he campaigned against the overuse of medications and electroconvulsive therapy.\nFrom the mid-1960s to the mid-1990s, he was chief psychiatrist with the Eastern Health Board and became professor of psychiatry at University College Dublin. Over those decades he led a revolution that saw a dismantling of institutions in Ireland such as St Brendan’s, Grangegorman, and the development of community clinics. Professor of psychiatry at Trinity College Dublin Brendan Kelly described this as the reversal of “Ireland’s fatal weakness for institutional solutions to social problems”. Browne’s most profound legacy was “the additional liberty enjoyed by thousands of people who avoided institutionalisation as a result of the reforms which Ivor came to represent”.\nProf Browne also founded the Irish Foundation for Human Development, as well as developing linked community models in Ballyfermot and Derry.\nPresident Michael D Higgins said he had fearlessly challenged what was a dehumanising system. “His respect for the dignity of those under his care was renowned and is often recalled by his former patients,” he said.\nMary Hobart\nArt gallery owner\nMary Hobart, who died on February 2nd aged 81, played a crucial role in raising awareness of Irish art in this country and internationally. Originally from Scotstown, Co Monaghan, she owned Pyms Gallery in London with her husband Alan Hobart. Neither had any formal training as artists or art historians when they opened the gallery in 1975.\nThey had a passion for Irish art at a time when it was far from fashionable and they travelled through Britain and Ireland to find overlooked paintings and sculpture. They bought and sold hundreds of works by William Orpen, including On the Beach, Howth (1910) and A Summer Afternoon. In 1996 they set up the Orpen Research Fund to further enhance knowledge of the artist’s work.\nThroughout the 1980s and 1990s they brought work by the greatest Irish artists to London. In their 1982 show, The Irish Revival, they exhibited works by John Lavery, John Luke, Walter Osborne, Paul Henry, Jack B Yeats and Louis Le Brocquy.\nOther artists promoted by them included Rita Duffy, Hector McDonnell, Norah McGuinness, Nano Reid and Mainie Jellett. They also championed the art of modern artist Mary Swanzy.\nOne of their shrewdest purchases came when they paid $7.7 million for Edvard Munch’s 1902 painting Girls on the Bridge, in 1996. They sold it on a few years later for $30.8 million.\nJohn Bruton\nPolitician\nJohn Bruton, who died on February 6th, aged 76, was taoiseach and European Union ambassador to the United States.\nFrom a farming family in Dunboyne, Co Meath, he was elected to the Dáil in 1969 for Fine Gael at the age of 22. He was appointed minister for finance in 1981 and became party leader at the end of 1990.\nHe had the unique distinction of being the only person in the history of the State to become taoiseach because of a change of government without an election halfway through a Dáil term. He succeeded to the office in December 1994 when the Labour Party pulled out of government with Fianna Fáil and did a deal with Fine Gael to form a new administration.\nHis rainbow coalition narrowly failed to win re-election in 1997. After fighting off two challenges to his leadership, he fell to the third challenge in 2001.\nHe was the European Union’s ambassador to the United States from 2004 to 2009. After his return to Ireland he served as chairman of the financial services body IFSC Ireland and as chairman of Co-operation Ireland which promotes good relations between the two communities on the island of Ireland. He also took a leading role in the Brexit debate and gave evidence to the House of Lords in London about the implications of Brexit on the peace process.\nMichael O’Regan\nJournalist\nMichael O’Regan, who died on February 18th aged 70, was an Irish Times parliamentary correspondent, political analyst and broadcaster.\nAfter studying journalism in the College of Commerce, Rathmines, he got a job as a junior reporter with the Kerryman newspaper. It gave him an insight into local politics and he often said nothing could rival the bear pit that was Kerry politics. He won a national journalism award in 1980 and joined The Irish Times the following year.\nIn 1988, he moved into politics and had a front-row seat to observe every political crisis that emerged in the following three decades. His encyclopedic knowledge of political constituencies and his ability to make politics interesting led to regular appearances on current affairs shows on radio and television.\nHe covered the Kerry Babies tribunal for this newspaper in 1985 and wrote a book, Dark Secrets, about the case, with Ger Colleran.\nA Kerryman, he was a vociferous supporter of his native county and served as president of the Kerry Association in Dublin in recent years. He appeared on Radio Kerry’s Call From the Dáil slot on the Kerry Today show, where he provided a lively retelling of the week’s political events.\nHe wrote about his cancer diagnosis and ongoing health issues in this newspaper and after he retired in 2019, he continued to be a regular voice on television and radio.\nMichael Gibney\nFood scientist\nProf Michael Gibney, one of Ireland’s most prominent food scientists and an internationally renowned researcher, died on February 23rd aged 75.\nHe was professor of human nutrition at Trinity College Dublin Medical School for more than 20 years before moving to University College Dublin where he was professor of food and health. He was also director of the UCD Institute of Food and Health from 2006-2013 and was professor of nutrition at the University of Ulster from 2013-2016.\nAt TCD he developed a worldwide reputation for his work on metabolic nutrition and molecular nutrition and became renowned for his work on public health nutrition. He was the first Irish person to be elected a fellow of the American Society for Nutrition.\nGibney served on food safety and health advisory committees and boards of national and international agencies and food manufacturing companies. He was a member of the EU scientific committees for food in the 1980s and 1990s and on public health, where he advised the European Commission on the BSE crisis.\nHe chaired the first EU expert group on recommended dietary allowance, which set out the average daily nutrient requirements for healthy individuals and also chaired the FAO/WHO joint consultation on dietary guidelines.\nHe chaired the Food Safety Authority of Ireland from 2013-2018. A prolific writer, he was working on his fourth book when he died.\nCharlie Bird\nJournalist\nCharlie Bird, who died on March 11th, was one of the best-known broadcast journalists in Ireland for nearly 40 years. As chief news correspondent, and special correspondent for RTÉ, he reported on most major Irish and international news stories from the early 1980s until 2012.\nHis death, at the age of 74, followed his diagnosis with motor neuron disease in 2021. He went public about his illness, and his decision to climb Croagh Patrick saw him raising more than €3.3 million for charity.\nHis journalism career started with a job in this newspaper’s library. He joined RTÉ as a researcher in 1974 and quickly gained a reputation for diligence and resourcefulness on programmes including Seven Days and The Late Late Show. Recruited to the newsroom in 1980, his reports on the Stardust fire in 1981, and from the prison cell of the wrongly-jailed Irish priest Niall O’Brien in the Philippines in 1984 brought him to national prominence.\nHe became known for his distinctive reporting style and his empathy with subjects. His interview with Nelson Mandela in South Africa’s first post-apartheid general election in 1994 scooped the world’s media and featured in Mandela’s autobiography. Investigative work led to him being named Journalist of the Year, jointly with colleague George Lee, in 1998, for investigating allegations of tax evasion at National Irish Bank.\n[ Charlie Bird: A life in pictures – The Irish TimesOpens in new window ]\nMalachy McCourt\nWriter, actor\nMalachy McCourt, the Irish-American actor and writer, died on March 11th, aged 92. His celebrated biography, A Monk Swimming, followed the hugely successful memoir Angela’s Ashes, written by his older brother Frank.\nMalachy McCourt was born in Brooklyn in 1931 but returned as a three-year-old to Ireland with his parents. He spent his formative years in Limerick and moved to England to find work, arriving back in New York at the age of 20 after Frank, working as a teacher in the city, sent him the fare.\nA natural performer, he appeared regularly on soap operas – notably Ryan’s Hope, on which he had a recurring role as a barman – and played bit parts in several films such as Reversal of Fortune and Bonfire of the Vanities. He was a well-cast Henry VIII in a television commercial and he enjoyed periodic turns as a television and radio host.\nIn the 1950s he opened what was considered Manhattan’s original singles bar: Malachy’s, on the Upper East Side.\nHis biography was a bestseller when published in 1998 and he followed it with Singing My Him Song in 2000, and Death Need Not Be Fatal in 2017.\nHe ran for governor of New York in 2006 but lost out to Eliot Spitzer.\nEmmet Bergin\nActor\nEmmet Bergin, who died on March 15th aged 79, became a household name in the 1980s when he took on the role of the urbane solicitor Dick Moran in Glenroe.\nAfter beginning his theatrical career as an assistant stage manager at the Eblana Theatre, he soon moved towards the spotlight. He appeared in the debut production of Brian Friel’s Philadelphia, Here I Come! at the Gaiety Theatre during Dublin Theatre Festival in September 1964 and toured with the Abbey and the Irish Theatre Company.\nKnown for his versatility, he played Biff in Death of a Salesman, Eilert Lövborg in Hedda Gabler and Mr Parksy in The Unexpected Man. In 1969, he had a small part in David Lean’s film Ryan’s Daughter and later appeared alongside Gabriel Byrne in John Boorman’s Excalibur, as Sir Ulfius.\nHe joined the cast of RTÉ's Sunday-night staple Glenroe in 1983 and his character’s forbidden romance with the then-married Mary McDermott brought him to a whole new level of fame. Such was his charisma, viewers did not turn on his character after Dick Moran had a fling with businesswoman Terry Killeen while married to Mary.\nHe continued to work after Glenroe was cancelled in 2001 and played Sunday Independent editor Aengus Fanning in Joel Schumacher’s Veronica Guerin movie in 2003.\nRose Dugdale\nIRA bombmaker, art thief\nRose Dugdale, who died on March 18th aged 82, was an IRA member and bombmaker but also a wealthy British heiress and Wittgenstein scholar. She was presented as a 17-year-old to Queen Elizabeth as part of the 1958 summer debutante season. She studied economics, politics and philosophy at Oxford, before becoming involved in IRA activities during the Troubles. She said it was Bloody Sunday in 1972 that prompted her to join the paramilitary group.\nIn 1973, her future husband Eddie Gallagher recruited her to assist him in seizing a helicopter, from which he attempted to bomb a barracks in Strabane.\nThe following year she was a member of the gang that stole 19 paintings – then valued at IR£8 million – from Russborough House. Sir Alfred Beit and his wife Lady Clementine were bound and gagged during the raid and the paintings were later found in Co Cork.\nShe was jailed for the robbery and gave birth to her son in Limerick Prison.\nGallagher, who remained at large, subsequently kidnapped Dutch businessman Tiede Herrema, demanding in vain Dugdale’s release in exchange for Herrema’s. She continued her involvement with the IRA after being released from prison and with partner Jim Monaghan she developed several lethal home-made explosive devices.\nShe was the subject of a new book, television series and film in recent years.\n[ Heiress, Rebel, Vigilante, Bomber by Sean O’Driscoll – The Irish TimesOpens in new window ]\nEilish Cleary\nDoctor\nEilish Cleary, the Dublin-born doctor and public health advocate, died aged 60, on March 22nd. After training as a GP, she spent most of her working life in Canada. In Northern Manitoba she worked with Cree Nation, one of the largest indigenous communities in that part of Canada, and she became a strong advocate for equity in healthcare for First Nations communities. Soon after, she got a job as assistant chief medical officer in Winnipeg, Manitoba, and later became chief medical officer for New Brunswick.\nShe played a key role in the province’s fight against the 2009 swine flu pandemic.\nIn 2012, she issued a report about the negative impacts of fracking on public health and the environment. She was later seconded from her job to work on fighting Ebola in West Africa with the World Health Organisation.\nShe was fired without explanation from her post in 2015, after she had begun investigating glyphosate, a herbicide widely used on forest lands in New Brunswick. There were public demonstrations in front of the Health Department’s office and calls from academics and physicians for her reinstatement but to no avail.\nNot long after her termination, Cleary received the President’s Award from the Public Health Physicians of Canada, for her “outstanding contribution to public health and preventive medicine”.\nImogen Stuart\nSculptor\nImogen Stuart was one of Ireland’s leading sculptors and her works can be found in churches and public spaces all over the island. She died on March 24th, aged 96.\nShe grew up in Germany but came to Ireland in 1949 after meeting her future husband Ian Stuart, son of Francis Stuart and Iseult Gonne.\nWorking mainly on church commissions, she honed her distinctive style which was influenced by German expressionism, Romanesque style and early Irish Christian art.\nHer significant church commissions included the Angel of Peace at St Teresa’s Carmelite Church on Dublin’s Clarendon Street, the decorative doors of Galway Cathedral, the altar and baptismal font in UCC’s Honan Chapel, and the monumental sculpture of Pope John Paul II in Maynooth.\nAmong her other key works are The Fiddler Of Dooney at Stillorgan Shopping Centre, the Flame Of Human Dignity in the courtyard of the Centre Culturel Irlandais in Paris, and The Arch Of Peace, in Cavan town.\nHer numerous awards include the Oireachtas art exhibition award and the ESB Keating McLoughlin Award at the Royal Hibernian Academy annual exhibition. She was elected a member of Aosdána in 1981 and a full member of the RHA in 1990. She was awarded the Cross of the Order of Merit of the Federal Republic of Germany in 2018 – the highest tribute paid to individuals for services to Germany.\nMichael Coady\nPoet, writer\nMichael Coady, the poet and short story writer, died at the age of 84 on March 25th.\nFrom Tipperary, he trained as a schoolteacher and saw his first poem published in the New Irish Writing page of the Irish Press. In 1979, he won the Patrick Kavanagh Award – a prize for emerging Irish poets – and Gallery Press published his first collection of poems, Two for a Woman, Three for a Man, soon after.\nFive collections followed that first success: Oven Lane (1987, revised edition 2014), All Souls (1997), One Another (2003), Going by Water (2009) and Given Light (2017).\nIn 2004 he won the Laurence O’Shaughnessy Award, presented by the University of St Thomas in St Paul, Minnesota, to outstanding Irish poets. His short stories won the Francis McManus Prize and the Listowel Writers’ Week short story award.\nIn the 1990s, Arts Council bursaries allowed him to travel to Newfoundland and the United States. He held the Heimbold Chair of Irish Studies at Villanova University in 2005 and he also held a residency at the Centre Culturel Irlandais in Paris. He was elected to Aosdána in 1998.\nAs a self-styled “lapsed trombone player’', music was a constant theme in his work and he collaborated with composers such as Rhona Clarke and Bill Whelan. Other publications include a personal memoir of the musicians Packie and Micho Russell, and Full Tide, an illustrated miscellany.\n[ Poem: A Sweet Bell Ringing, by Michael Coady – The Irish TimesOpens in new window ]\nJoe Kinnear\nSoccer player, manager\nFormer Republic of Ireland defender and Wimbledon manager Joe Kinnear died on April 7th, at the age of 77.\nHe was born in Crumlin, Dublin, but moved to Hertfordshire in England with his mother when his parents separated. After excelling in schoolboy football, he was playing for St Alban’s City when he was spotted by a Tottenham Hotspur scout and signed. By the age of 20 he was the club’s established right-back and starred in their FA Cup final win over Chelsea at Wembley in May 1967. Kinnear would win several more medals with Spurs: a pair of League Cups in 1971 and 1973, and a Uefa Cup in 1972.\nHe made his Ireland debut in a European Championship qualifier against Turkey in Ankara in 1967 and went on to win 26 caps with the Republic of Ireland during his career.\nHis final playing season was with Brighton before knee trouble forced him to retire in 1976, aged 30.\nHe served his coaching apprenticeship as an assistant to Dave Mackay at two clubs in the UAE. He also managed Nepal and India before returning to Britain. Kinnear went on to manage Wimbledon from 1992-1999 until a heart attack led to his resignation. He later returned to work, managing Oxford, Luton, Nottingham Forest and, most recently, Newcastle.\n[ Former Ireland international Joe Kinnear dies at the age of 77 – The Irish TimesOpens in new window ]\nJo English\nSailor\nJo English, who died on April 8th, aged 59, was a sailor and co-manager of SailCork, the sailing school based in Cobh.\nShe studied hotel and catering management in Galway and spent many years in the hospitality business before sailing became her life. She worked in hotels in San Francisco, in the Blarney Park Hotel, the catering department of the Mercy Hospital in Cork and as a manager in Brennan’s catering emporium in the city.\nAn accomplished cook, in the mid-1990s, she opened her own cafe and deli, The Bluebell Nook, in Mallow.\nWhen she met her husband Eddie English, she gave up her job and joined him in the sailing school. She first completed all the sailing courses the business offered, and later took over a lot of the administration, dividing her time between the business and rearing of their two children.\nFor almost 20 years the couple ran SailCork’s “sunshine yachting holidays”, bringing groups on chartered boats in the Mediterranean and Caribbean seas. He did the teaching while she did the cooking and she was known for producing exceptional meals from the confined galleys of boats.\nLarry Masterson\nTelevision producer\nThe RTÉ producer and social justice campaigner Larry Masterson died on April 14th, aged 74.\nFrom Dublin’s Gardiner Street, he studied social science at UCD. After attending a talk at Trinity College by a co-founder of the Simon Community in London, he and friends Brian McCarthy and Denis Cahalane set up the Simon Community in Dublin.\nAfter graduating, he worked in social services in Drogheda and appeared on panel shows to discuss the social issues of the day. This led to him being offered a job as a researcher on Bunny Carr’s Encounter. He went on to work with Mike Murphy on the series The Live Mike in the late 1970s and left RTÉ with him in the early 1980s to start Emdee Productions with cinematographer Seamus Deasy. He also worked with Tyrone Productions and produced shows for TG4, Channel 4 and the Discovery Channel among others.\nOne of his most significant projects was 2001′s If I Should Fall From Grace with God: The Shane MacGowan Story, which told the story of the Pogues singer and featured interviews with Nick Cave, Elvis Costello, Johnny Depp and Sinéad O’Connor.\nHe returned to RTÉ as a freelance producer on Brendan O’Connor’s TV debut, The Saturday Night Show and was executive producer on The Late Late Show during the Pat Kenny and Ryan Tubridy years. He retired in 2017.\nTeri Hayden\nAgent\nTeri Hayden, who died April 18th aged 75, was a trailblazing agent who guided the careers of many notable Irish actors including Brendan Gleeson, Domhnall Gleeson, Ruth Negga and Gabriel Byrne.\nHer clients have won Golden Globes, Baftas, Tonys, Oliviers, Emmys and Academy Award nominations, as well as numerous Iftas.\nFrom Derry, she studied economics and finance at Manchester University before working at RTÉ. In the early 1980s she saw an opportunity in the growing demand for actors’ representation in Ireland, predicting that Irish theatre, TV and film was about to expand.\nSoon she had become Ireland’s leading talent agent, and rapidly won respect and recognition for her skills. She was known as a fearless negotiator, determined to secure the best possible deal for her clients and she also brokered many projects, even when she had no stake in the productions. Brendan Gleeson dedicated his Ifta win for best supporting actor in The Banshees of Inisherin to Hayden, “who has led me through this minefield of a profession that we embrace for years and years”. Gabriel Byrne credited her with getting him the help he needed when he realised he had a problem with alcohol in the late 1990s.\nShe reportedly rejected an offer from an A-list Hollywood agency to buy her out, and the Dublin-based agency is now run by her son Karl.\nEthna Viney\nNature writer\nThe nature writer and TV and film producer Ethna Viney died on April 26th, aged 95.\nA woman of many careers, she first trained as a pharmacist and ran her own chemist shop in Killala where she also organised a group of women to form a cheese-making co-operative. She later moved to Dublin to study politics and economics in UCD. She married young British journalist Michael Viney in 1965 and worked as a researcher and producer in RTÉ.\nWhen the couple were in their 40s, they relocated to a remote cottage on one acre on the west coast of Mayo. While he began his weekly Another Life column for this paper, she took on many projects. She brought together the fishermen of north Connemara and south Mayo in a co-operative mussel farming project.\nShe was an editor of Technology Ireland and became a freelance writer for this paper on economics and women’s issues. And she was also a founder member of the Women’s Environmental Network (WEN).\nWhen Michael’s second column An Eye on Nature – which answers readers’ queries – began, she ran it for years under his name until she was finally acknowledged as the author. She also co-authored Ireland’s Ocean: A Natural History with him. Her documentary-making focused on features that dealt with the human impact on the environment.\n[ Former Irish Times columnist Ethna Viney dies aged 95 – The Irish TimesOpens in new window ]\nMary Banotti\nPolitician\nMary Banotti was a Fine Gael MEP, a presidential election candidate and a committed campaigner for the rights of women and children. She died on May 10th, just weeks before her 85th birthday.\nShe trained as a nurse which led to a stint as a development aid worker in Kenya. There she met and married an Italian doctor, Giovanni Banotti. After the marriage broke up, she returned to Dublin with her daughter in 1970 and threw herself into social causes involving the welfare of women.\nShe was a co-founder of Women’s Aid, which opened the first refuges for the victims of domestic violence, and she served as chairwoman of the Rutland Centre. Her appearances on RTÉ led to her selection as a Fine Gael candidate to contest the 1983 Dublin Central byelection. While she failed to win that seat, she went on to win a seat in the European Parliament.\nShe continued to campaign for women’s and children’s rights and was the first EU mediator for parentally-abducted children. She was named one of the top 10 environmental legislators in Europe in the late 1980s.\nIn 1997, she won the Fine Gael nomination to contest the presidency in succession to Mary Robinson but ultimately lost out to Mary McAleese.\nAfter 20 years in the European Parliament, she retired in 2004.\nJosephine Bartley\nNursing director\nJosephine Bartley, who served as director of nursing at Beaumont Hospital from its opening in 1987 to her retirement in 1998, died on May 13th, aged 90. She was also a founder member and former dean of the Faculty of Nursing and Midwifery in the Royal College of Surgeons of Ireland (RCSI).\nThe Limerick-born nurse will be remembered as a driving force in the development of education and specialist training for nurses in Ireland during the time when the nursing profession began to have a higher status within the healthcare system.\nEarly in her career, she oversaw training for all registered nurses in regional centres throughout Ireland. During her time as dean of the Faculty of Nursing and Midwifery at the RCSI, the first four-year Bachelor of Nursing degree courses were offered at the college. She also conferred the first honorary fellowship of the Faculty of Nursing and Midwifery on St Teresa of Calcutta in Rome in 1992.\nA woman of strong faith, Bartley acted as matron of the volunteers for the Dublin Diocesan pilgrimage to Lourdes each year. She was also an active member of the Guild of Irish Catholic Nurses and represented the International Catholic Committee of Nurses and Medico-Social Assistants at the World Health Organisation in Geneva, Switzerland.\nTony O’Reilly\nBusinessman\nTony O’Reilly was remembered as Ireland’s first business superstar after his death on May 18th, at the age of 88.\nHe first came to public attention as a rugby player who earned 29 caps for Ireland, and a record-breaking 37 tries with the British and Irish Lions. He enjoyed early business success as the head of Bord Báinne – the Irish Dairy Board, where he pioneered the dairy brand Kerrygold.\nHis stewardship of the Irish Sugar Company brought him into the orbit of Heinz and he would go on to become its chief executive. He bought into Independent Newspapers in the 1970s and built it into an international media empire with publications and broadcasting interests in South Africa, Australia, New Zealand and the UK.\nHis business interests took a downturn in the last decade and a half. His attempts to stave off the collapse of the Waterford Wedgwood business saw him suffer a huge financial loss. And he was involved in one of the most high-profile corporate clashes of recent decades when he lost control of Independent News and Media to Denis O’Brien. Once reported to be Ireland’s wealthiest person, he was declared bankrupt in 2015.\nA generous supporter of the arts and academic institutions, he was also a founder of the US Ireland Funds, which raised funds to promote peace and reconciliation. In 2001 he was knighted by the late Queen Elizabeth.\nFran Rooney\nBusinessman\nFran Rooney, who led Baltimore Technologies to a multibillion-dollar valuation, and went on to lead the FAI, died on May 20th, aged 67.\nAn accomplished footballer, he played for Home Farm, Shamrock Rovers, St Patrick’s Athletic and Bohemians, and managed the Irish women’s soccer team between 1986 and 1991.\nHe worked in several government departments and in National Irish Bank, before setting up Meridian International, a VAT processing company. Along with a group of investors, he bought Baltimore Technologies, which specialised in internet security, for the equivalent of about €381,000 in 1996.\nThis coincided with the start of the boom in internet-related companies which led to Baltimore being listed on the Nasdaq in New York in 1999. The company’s market capitalisation ballooned to more than $13 billion (€12 billion) putting Baltimore in the FTSE 100, an index of the most valuable companies on the London market. When the dotcom bubble burst in 2000, the value of the stock collapsed. Efforts to turn around the fortunes of the company failed and he stepped down as chief executive in 2001.\nHe became chief executive of the FAI in 2003, in part to implement the findings of the Genesis report commissioned after the Saipan saga, when Roy Keane left the squad in the run-up to the 2002 World Cup. He left the association in 2004.\n[ Former Baltimore Technologies, FAI CEO Fran Rooney has died – The Irish TimesOpens in new window ]\nJoe Joyce\nJournalist, author\nJoe Joyce, who died on June 6th aged 76, was an award-winning investigative journalist and author.\nHis first reporting job was with The Irish Times, where he gravitated towards politics, as well as justice and policing matters. With colleagues Renagh Holohan and Don Buckley he wrote a series of Irish Times investigations into the activities of the Garda’s Murder Squad, known more colloquially as the Heavy Gang.\nAlong with Don Buckley, he revealed the Kerry Babies incident in 1984, while writing in the Sunday Independent. They detailed how gardaí had obtained confessions from an entire family to a murder that subsequent forensic evidence proved they could not have committed.\nHe twice received the national Journalist of the Year award for his investigative work.\nHe left his staff job in 1978 and went freelance, working for Reuters news agency, Hibernia magazine and the Southside newspaper. He also worked for the Sunday Tribune and the Guardian.\nHe was co-author, with Peter Murtagh, of The Boss, a biography of the 1982 government of the former Fianna Fáil leader Charles Haughey, and of Blind Justice, an examination of the Sallins mail train robbery and subsequent investigation.\nIn later life he became an accomplished author, penning a series of thrillers, historical novels, plays and a biography of the Guinness family.\nCharlie Lennon\nMusician\nCharlie Lennon, who died on June 8th, was a traditional musician and prolific composer. He died a month before his 86th birthday and just a few nights after a memorable concert performance by fiddle player Martin Hayes in Lennon’s Stiúideo Cuan, in Spiddal.\nOriginally from Kiltyclogher, Co Leitrim, he studied classical piano but couldn’t resist his first love, the fiddle.\nHe embarked on a professional career as a musician as a young teen, touring with bands across Ireland and the UK, playing a wide mix of styles including English and Scottish country music.\nHe later returned to education and excelled academically, receiving his PhD in nuclear physics in 1969. While he worked as a software and management consultant, he pursued a parallel life as a prolific performer, recording artist and composer.\nLennon recorded more than 50 albums, both as a fiddle player and as a piano accompanist. He regularly played with Matt Molloy, Mick O’Connor, Johnny Connolly, Joe Burke and many others, and his tunes were sought out by musicians such as Frankie Gavin.\nHe began to compose orchestral works in the 1980s, leading in 1991 to the performance of Bainis Oileáin/Island Wedding, by the RTÉ Concert Orchestra. Later orchestral works included The Famine Suite and Áille na hÁille. He was awarded the TG4 Gradam Ceoil for Composer of the Year in 2006.\n[ Irish traditional musician Charlie Lennon has died aged 85 – The Irish TimesOpens in new window ]\nPaul Mackay\nCo-founder of the Progressive Democrats\nPaul Mackay, who died on June 11th aged 83, was one of co-founders of the Progressive Democrats (PDs), along with Des O’Malley, Mary Harney and Michael McDowell.\nHe qualified as a chartered accountant in 1965 and began a private practice specialising in corporate recovery in 1971.\nAn admirer of Seán Lemass, he joined the Clontarf cumann of Fianna Fáil in the 1960s. He was made auditor of the party finances in Charlie Haughey’s Dublin North East constituency in 1981, but after he asked to see the accounts, a dispute followed and he was dismissed in May 1983.\nTwo years later Des O’Malley was also expelled from Fianna Fáil and Mackay told him he would have strong support should he form a new political party. The party was formed at Mackay’s home in December 1985 and a reluctant O’Malley agree to lead it.\nMackay raised the bank loan for party headquarters in Dublin’s South Frederick Street and played a central role in the 1987 general election when the PDs won 14 seats. He was director of elections in the 1989 contest which saw the party reduced to six seats but ended up into government with Fianna Fáil.\nOver the following two decades, Mackay played a leading role in the PDs as treasurer and election strategist.\nTommie Gorman\nJournalist\nTommie Gorman died on June 25th, three years after he retired from his role as RTÉ's Northern Editor. The Sligo-born journalist was 68 years of age.\nHis first byline as a journalist appeared in The Sligo Champion, over match reports on his beloved Sligo Rovers’ games in Dublin, when he was studying journalism in the College of Commerce, Rathmines. He went on to work as a correspondent for the Western Journal and became its editor aged 23. He joined RTÉ in 1980 as its northwest correspondent. In 1989, he moved to Brussels to become its Europe correspondent.\nIn 1994 he was diagnosed with neuroendocrine tumours, a rare form of cancer, and lived stoically with it for 30 years. He highlighted his success in accessing treatment for his illness in Sweden via an EU scheme, which encouraged others to explore this option.\nAs RTÉ's Northern editor, he reported on Stormont politics from 2001 and earned the trust of leading politicians across the political spectrum. He also landed one of the most memorable sporting scoops when he secured an interview with footballer Roy Keane after he left Saipan in the build-up to the 2002 World Cup.\nHe retired from RTÉ in March 2021. He made several documentaries, the last of which was Ireland, Cancer and Me, a personal account of living with neuroendocrine tumours.\nMicheál Ó Muircheartaigh\nBroadcaster\nMicheál Ó Muircheartaigh’s voice was a constant summer companion for generations of GAA supporters. He made his radio debut in 1949 and commentated on his last All-Ireland final on television in 2010, earning himself a place in the Guinness World Records for his longevity. He was as popular for his GAA knowledge as for his unique turn of phrase and distinctive Kerry lilt.\nHis passion for Gaelic games was matched only by his love for the Irish language and his native Kerry. He was a student teacher when he broadcast the 1949 Railway Cup football final and he combined broadcasting work with teaching until 1981 when he took up a full-time post with Raidió na Gaeltachta.\nHe took part in RTÉ's first television broadcast of the All-Ireland hurling final in 1962, alternating Irish language commentary with Seán Óg Ó Ceallacháin doing English. In 1964 he took over the live television coverage as Gaeilge of All-Ireland minor finals.\nFrom 1985, he broadcast English radio commentary on all All-Ireland senior finals – a total of 55, including replays. His friend, Raidió na Gaeltachta commentator Micheál Ó Sé, told his funeral mass that his gifts as a broadcaster would remain unequalled. “The microphone in his hand was like the brush in the hand of a great master,” he said.\nMicheál Ó Muircheartaigh died on June 25th, aged 93.\nElizabeth MacGrath\nJudge\nDistrict Court judge Elizabeth (Liz) MacGrath died on July 3rd, aged 65, after a short illness. She began practising as a solicitor in the mid-1980s in the firm established by her grandfather and county solicitor for Tipperary, Patrick MacGrath. In 1989, she set up her own solicitor practice, MacGrath and Co, in Nenagh, taking on cases in criminal and civil litigation, family law, probate and conveyancing. She also represented the local authority in planning, environmental and regulatory matters.\nShe was appointed as judge of the District Court in 2007, and in 2012 she was assigned to District Court 8, which covers her home county of Tipperary.\nMacGrath had a reputation as a straightforward and reasonable criminal judge and was not afraid to speak publicly on legal matters and in defence of her profession. In 2016, she spoke out about the limitations of the judicial system to enforce drink-driving legislation and to prosecute drunken drivers. She also wrote so-called bench books for judges on her experiences of case law and legislation – particularly in relation to drink driving.\nShe was president of the District Judges Association and was the elected District Court representative on the board of the Judicial Council, which promotes high standards of conduct among judges.\nJohn O’Mahony\nFootball manager, politician\nThe All-Ireland winning manager and Fine Gael TD and senator John O’Mahony died on July 6th, aged 71.\nAs a player he won a minor All-Ireland medal with Mayo in 1971, and an U21 medal in 1974. He would go on to manage the U21 team and led the county to the 1983 All-Ireland U21 title.\nHe was an early adopter of the inclusion of sports psychology and performance coaching with his teams and he earned his reputation as a pioneering leader with a series of historic triumphs.\nIn 1989, he brought Mayo to a first senior All-Ireland final in 38 years. His leadership saw Leitrim winning a first Connacht championship in 67 years in 1994, while he led Galway to its first Sam Maguire in 32 years in 1998, and another in 2001.\nHe took over Mayo for a second term in 2007 and won the Connacht championship in 2009. He was also a respected pundit in local and national media outlets, including as a columnist for this newspaper.\nHe won a seat for Fine Gael in the 2007 general election and was re-elected in 2011. After constituency lines were redrawn, he lost out on a seat in Galway West but went on to serve in the Seanad from 2016 to 2020.\nHugh Geoghegan\nJudge\nThe barrister and Supreme Court judge Hugh Geoghegan died on July 7th, aged 86.\nHe came from a long line of legal experts that dated back to the 1840s. His father James was a minister for justice, attorney general and Supreme Court judge. His wife Ms Justice Mary Finlay Geoghegan was also a Supreme Court judge, and two of their children became barristers.\nHe was called to the Bar in 1962 and became a senior counsel in 1977, practising in Dublin and the Midland Circuit. He appeared as counsel before the tribunal into the Stardust fire disaster and chaired a commission that recommended the formation of the Labour Relations Commission.\nFrom 1984, he combined a busy practice with service as Public Service Arbitrator and was known for his courtesy and fairness to all parties.\nHe was appointed a judge of the High Court in 1992 and became a judge of the Supreme Court eight years later. When he retired in 2010, he was feted as one of the most respected and well-loved judges of his time, whose judgments were infused with humanity and compassion. He went on to chair the Barristers’ Professional Conduct Appeals Board and was the Independent Appeals Commissioner for the College of Surgeons. He was active in the Irish Legal History Society and wrote several ground-breaking essays on the early legal history of independent Ireland.\nJustin Kilcullen\nCharity worker\nJustin Kilcullen was the public face of Trócaire, the overseas development agency of the Catholic Church, but he also supported numerous organisations helping disadvantaged people. He died on July 16th, aged 73.\nA trained architect, he was inspired by his two Jesuit missionary uncles to work with Voluntary Service Overseas (VSO) in Tanzania. He later worked with the United Nations refugee agency UNHCR, where he helped develop housing facilities for Vietnamese boat-people and Cambodian refugees. In 2002, he was awarded the Robert Matthew Prize by the International Union of Architects for his work on human settlements. On his return to Ireland, he worked with the Voluntary Housing Association movement in Belfast to refurbish inner-city housing on the Falls and Shankill Roads.\nHe joined Trócaire in 1981 as Africa programme officer and was appointed executive director in 1993. He held that position for 20 years until his retirement in 2013. In 2019, he was awarded a papal knighthood of the Order of St Gregory the Great for people of distinguished character, reputation and accomplishment. Caoimhe de Barra, current chief executive of Trócaire, said he had “a passion for justice and a deep belief in the dignity and rights of every human being which drove and defined him”.\nEdna O’Brien\nWriter\nEdna O’Brien, the novelist, short-story writer, playwright and screenwriter died on July 27th, aged 93. Her trilogy of novels which debuted in the early 1960s – The Country Girls, The Lonely Girl [later renamed Girl with Green Eyes] and Girls in Their Married Bliss – were banned by the Irish censorship board.\nShe wrote more than 20 novels, biographies of James Joyce and Lord Byron, plays, screenplays and a memoir.\nBorn in Tuamgraney, Co Clare, she had a well-publicised love-hate relationship with her native country and lived abroad for most of her life. She never baulked at tackling difficult subjects and themes of her later novels included murder, terrorism and rape. Her final novel, Girl, was published in her late 80s, and involved her travelling to Nigeria to carry out research.\nAmong her numerous awards were the Kingsley Amis Award, the Los Angeles Times Book Prize, the European Prize for Literature and the Pen Nabokov Award for Achievement in International Literature. She was also a member of Aosdána and was elected as a Saoi (wise one) in 2015.\nPresident Michael D Higgins said she was “a fearless teller of truths” and “one of the first writers to provide a true voice to the experiences of women in Ireland in their different generations”.\nLeigh Gath\nDisability campaigner\nLeigh Gath, who died on July 27th, aged 62, was a thalidomide survivor who spent her adult life campaigning for the rights of people with disabilities.\nShe was born with shortened arms and legs, due to the side effects of the morning sickness drug thalidomide. Growing up in Newry, Co Down, she advocated for those who didn’t have the confidence to speak up for themselves. When she was campaigning for accessible footpaths, she led local MP Enoch Powell down the centre of a busy street to show him the obstacles facing wheelchair-users.\nIn 1991 she married her first husband and the couple later moved to Texas. After they divorced, she met and married a fellow thalidomide survivor, Irish man Eugene Gath, in 2003. The family returned to live in Co Limerick in 2006 and she became involved in disability issues. In 2012 she led a sleep-out outside the Department of the Taoiseach to protest against cuts to personal assistance and home-help services for people with disabilities.\nShe was appointed the HSE’s first confidential recipient in late 2014, following the abuse scandal in the Áras Attracta centre for adults with intellectual disabilities in Co Mayo. Her job involved examining concerns relating to HSE-funded services for people with disabilities and older people.\nHer autobiography, Don’t Tell Me I Can’t, was published in 2012.\nAidan O’Leary\nAid worker\nAidan O’Leary, the Irish director of the World Health Organisation’s polio eradication programme, died on August 6th aged 59. Known for his collaborative leadership style and his ability to solve complex problems, he worked in war-torn parts of the world including Gaza, Yemen, Afghanistan, Syria and Iraq.\nThe Dubliner joined the Irish Army in 1983 and served initially in the Supply and Transport Corps in Cork and Dublin. As part of his military service, he completed a degree and master’s in economics and also studied chartered accountancy.\nHe was seconded to the Department of Finance in 1991 as a policy analyst for a year and became the right-hand man of the chiefs of staff as a strategic planner. During this period, O’Leary did two tours to Lebanon and one to Yugoslavia. He was promoted to captain during this period.\nIn 2000, he was headhunted to work for the Organisation for Security Cooperation in Europe (OSCE). He went on to work for the United Nations Relief and Works Agency with Palestinian refugees, the Office for the Co-ordination of Humanitarian Affairs, the United Nations Children’s Emergency Fund (Unicef) and finally the WHO. He moved to Geneva to head its polio eradication programme in 2021. One of his last tasks involved preparing for two rounds of polio vaccination campaigns for young children in Gaza.\nNell McCafferty\nJournalist, campaigner\nNell McCafferty was remembered as a fierce and feisty campaigning journalist and author when she died on August 21st aged 80.\nFrom the Bogside in Derry, she fought for equal rights for women and gay people and railed against social injustice. She became involved in civil rights politics as a student at Queen’s University Belfast in the 1960s, before becoming a journalist with The Irish Times and a founder member of the Irish Women’s Liberation Movement. She was on the famous contraceptive train which brought condoms and pills from Belfast to Dublin, where they were illegal, in 1971.\nHer reports from the courts in the In the Eyes of the Law series broke new ground between 1970 and 1980. In vivid, searing and humorous prose she brought a fresh insight into what was happening in the courts.\nAmong her noted works were the book A Woman to Blame, on the ordeal of Joanne Hayes in the Kerry babies’ case, and The Armagh Women, on woman republican prisoners and their hunger strikes in Armagh jail. She also wrote for In Dublin, the Sunday Tribune and Hot Press and was a regular contributor to news and current affairs shows.\nVeteran civil rights campaigner Eamon McCann said she had changed the world “and in the course of that she entranced as many women as she alarmed men ... they had never seen or heard the like of her”.\nSr Theresa Kane\nNun, campaigner\nSr Theresa Kane, who died on August 22nd aged 87, was a Catholic nun who publicly challenged Pope John Paul II to allow women to become priests.\nThe Irish-American was just 27 when she was named chief executive of St Francis Hospital in Port Jervis, New York. She became the head of the Sisters of Mercy’s New York province a few years later, and in 1977, president of the entire order. She was also president of the Leadership Conference of Women Religious.\nIn 1979, she was chosen to give a welcome address for Pope John Paul II during his Washington visit. A few days earlier, in Philadelphia, he had made his opposition to the ordination of women clear. Not to be dissuaded she told him that, in order to join the pope in his mission, women needed to be equal participants within the church hierarchy.\nSr Theresa’s address was televised and was front page news in the New York Times and in this newspaper. She faced a backlash after her speech, as did the groups she led, under both Pope John Paul II and his successor, Pope Benedict.\nShe was a leading figure among progressive Catholic women and took liberal positions on issues such as abortion and same-sex marriage. She was among the first prominent church figures to champion the rights of LGBTQ+ Catholics.\nPaul Good\nEstate agent, mediator\nPaul Good, the co-founder of Douglas Newman Good (DNG) property agency, died on August 24th, aged 83. Widely respected within the property industry, he was renowned for his expertise in arbitration, mediation, compulsory purchase order negotiations and commercial valuations.\nHe initially studied architecture before switching to quantity surveying. The firms he worked with included Donal O’Buachalla, Jones Lang LaSalle, Lisneys, Dublin Corporation and Druker Fanning. In 1982 he joined forces with Edmund Douglas and Paul Newman to establish DNG, which went on to be one of the country’s leading commercial and residential property agencies.\nIn 1994 Good left DNG to work for himself. During the following three decades, he did commercial and residential sales and rental valuations and acted as a mediator in disputes between landlords and tenants, and homeowners faced with compulsory purchase orders. He was also an independent expert for the Royal Institute of Chartered Surveyors, the Society of Chartered Surveyors Ireland, the now defunct Irish Auctioneers and Valuers Institute and the Law Society.\nBetween 2009-2011, while the financial crisis was raging, he reviewed more than 100 projects for WK Nowlan Consortium on behalf of the National Asset Management Agency. He was also a member of the Private Residential Tenancies Board’s Dispute Resolution Committee.\n[ Paul Good, co-founder of DNG, dies aged 83 – The Irish TimesOpens in new window ]\nFred Johnston\nPoet\nFred Johnston, the Belfast-born poet, died on September 9th, shortly before his 73rd birthday. He was also a translator, literary critic, musician and human-rights campaigner.\nHe moved to Dublin in 1969 and was awarded a Hennessy Prize in the New Irish Writing section of the Irish Press three years later.\nHe settled in Galway in 1978 after attending a writer’s workshop there. Johnston’s first book of poetry, Life and Death in the Midlands, and his first collection of short stories, Portrait of a Girl in a Spanish Hat, were published the following year.\nHe was one of the founders of the Cúirt Festival of Poetry and also set up the Western Writers’ Centre. In total, he produced three novels, four volumes of short stories, nine books of poetry and a play. His work as a critic was published in Poetry Ireland, The New Statesman, The Spectator, The Irish Times and Harper’s and Queen magazine.\nA year spent in Algeria fostered his love of French and he later became a translator of the work of the Senegalese poet Babacar Sall and the Breton Colette Witorski. He was awarded the Prix de l’Ambassade by the French government in 2000 and was writer-in-residence at the Princess Grace Irish Library in Monaco in 2004.\n[ Singing an Irish song of parting and loss – The Irish TimesOpens in new window ]\nJohn O’Driscoll\nGarda\nAssistant commissioner of An Garda Síochána John O’Driscoll was remembered as a gifted leader and a skilled communicator, after his sudden death on September 27th, aged 64.\nHe was credited with providing the leadership that helped gardaí to break the grip of gangland figures and seriously disrupt the activities of criminals such as the Kinahan family.\nHe joined the guards in 1981 and his early Garda career centred around the Dublin Metropolitan Area, chiefly Fitzgibbon Street, Store Street, and the Bridewell where he was inspector. While working in the north inner city, he put huge efforts into fostering links with the community and steering young people towards sport whenever possible.\nIn 2000, he was transferred into the Garda National Immigration Bureau and was asked to lead the office in 2009. He had been promoted to chief superintendent at this stage and he oversaw prosecutions against child traffickers and people smuggling.\nHe took over as head of the National Drugs Unit in 2014 and became head of the National Bureau of Criminal Investigation the following year. His promotion to assistant commissioner in 2016 gave him the responsibility for combating organised and serious crime and made him the public face of these Garda operations.\nAfter 41 years of service, he retired in 2022. His memoir, On Duty: Reflections on a Life in the Guards, was published after his death.\nMary O’Rourke\nPolitician\nMary O’Rourke, who died aged 87 on October 3rd, held senior positions in government and opposition for 30 years. After her political career ended, she remained in the public eye as a media pundit and author of a bestselling memoir.\nWhile she came from a leading Fianna Fáil family – the Lenihans of Athlone – she carved out a political career on her own merits. She served in several senior ministries, including education and public enterprise, and was deputy leader of Fianna Fáil from 1994 to 2002.\nWhen Charlie Haughey appointed her as minister for education after the 1987 general election, the minister for foreign affairs was her brother Brian Lenihan. They remain the only brother and sister to have served together in Cabinet.\nShe was one of the shock losers in the 2002 general election but was elected to the Seanad and became leader of the House.\nO’Rourke relished the cut and thrust of politics, enjoying spats with opponents and the intrigue that went with internal party manoeuvring. She cultivated good relationships with political journalists in Leinster House and was always a lively and entertaining guest on current affairs shows.\nFianna Fáil leader Micheál Martin said she was a “a commanding and engaging figure – an insightful observer of both political life and societal trends”.\nDavid Davin-Power\nJournalist\nDavid Davin-Power had a long and varied career in the media and was known for reporting on some of the momentous events in modern history in an incisive and impartial manner. He was 72 when he died on October 31st.\nHe began his career in journalism with the Irish Medical Times, and in 1976 he moved to the Irish Press as a subeditor, where one of his colleagues was David Hanly. The two of them moved to RTÉ in the late 1970s and were appointed as the first presenters of Morning Ireland which went on air in November 1984. The radio programme quickly developed a wide listenership, making household names of its two presenters.\nHe left RTÉ to head the news operation of Ireland’s first commercial broadcaster, Century Radio in 1989. After the station closed, he was appointed political correspondent at the Evening Press, and almost simultaneously, RTÉ offered him the job of Northern Correspondent. He decided that broadcasting was where his future lay and headed for Belfast. His time in Northern Ireland coincided with a crucial period for the evolving peace process and he kept listeners and viewers up to date with the events that ultimately led to the Belfast Agreement.\nIn 2001 he returned to Dublin and held the role of RTÉ's political correspondent for 16 years. His calm demeanour and precise use of language were the hallmarks of his broadcasting style.\nKathleen Watkins\nAuthor, broadcaster, musician\nKathleen Watkins was a broadcaster, award-winning author, musician and patron of the arts. Her death, on November 7th at the age of 90, came almost five years to the day after the death of her husband, broadcaster Gay Byrne. They were television’s golden couple and were familiar faces at arts and cultural events in Dublin for many decades.\nShe was an accomplished harpist and singer and made history as the first continuity announcer to appear on screen on the opening night of Telefís Éireann on New Year’s Eve, 1961. Her honeyed voice meant she was always in demand for voiceover work while her on-screen television work included presenting shows such as Faces & Places and Holiday Ireland.\nShe said no one was surprised as she was when she became a children’s author at the age of 82. Her three children’s books were based on stories she told her grandchildren about a piglet called Pigín. Her great love of poetry led to her compiling two books of poems – An Ordinary Woman, in 2019 and One for Everyone, in 2020.\nPresident Michael D Higgins said Ms Watkins “represented the best of her generation in so many ways and during such a formative period in our country”.\nJohnny Duhan\nMusician\nSongwriter and musician Johnny Duhan died in a drowning accident in Galway on November 12th at the age of 74.\nOriginally from Limerick, he joined the band Granny’s Intentions as a teenager and moved to Dublin, where he once shared a flat with Phil Lynott and Gary Moore. The band toured Ireland and the UK, and later moved to London. He composed eight of the band’s 11 songs on their sole album, Honest Injun. When he was 21 he struck out on his own and settled in Galway with his wife-to-be, Maureen.\nDuhan wrote songs and performed solo in the early 1980s and occasionally toured with other bands. Artists who recorded his songs included Christy Moore, Dolores Keane, Mary Black and The Dubliners. Many years later, regular references to him in Ken Bruen’s series of Jack Taylor detective novels brought him new fans from all over the world. He also composed the music for the 1988 film Reefer and the Model.\nHis most famous song The Voyage was recorded by Christy Moore in 1989 and has become a folk standard. As well as his eight solo albums, he wrote a series of autobiographical books, beginning with There is a Time in 2001, while Waltons published his songbook in 2003.\nDervilla Donnelly\nScientist\nProf Dervilla Donnelly, a chemist who made a major contribution to research, science policy and public service both in Ireland and abroad, died on November 14th, aged 94.\nShe began her teaching career in University College Dublin (UCD) in 1956 in the old School of Chemistry and later moved with the university to its present location in Belfield. She was professor of phytochemistry – the study of chemicals with biological activity derived from plants – for 16 years. She was described by UCD as “one of the most respected and influential chemists” of the university.\nProf Donnelly was the first female president of the Royal Dublin Society, from 1989 to 1992, and the first woman to receive the Royal Irish Academy’s highest honour, the Cunningham Medal, in 2017.\nAlways in demand for her skills, she served as chairwoman of the Custom House Docks Development Authority, the National Education Convention and the Forum on Early Childhood Education. She was also chairwoman and director of the Commission on Assisted Human Reproduction from 2000-2005.\nIn 2000 she was appointed to the Austrian Council for Science and Technology, a position she held for 10 years.\nOther appointments include her presidency of the Institute of Chemistry of Ireland, governor of The Irish Times Trust and a director of The Irish Times Limited.\n[ Renowned Irish scientist Dervilla Donnelly dies aged 94 – The Irish TimesOpens in new window ]\nJon Kenny\nComedian, actor\nJon Kenny, who died aged 67 on November 15th, was one of Ireland’s most beloved comedians, and a respected actor on stage and screen. He was also a talented musician who continued to write and perform songs throughout his life.\nThe Limerick man first found fame as one half of the D’Unbelievables, a duo he began with Pat Shortt, whom he met in the late 1980s. Their act became one of the biggest names in Irish comedy and they played to packed houses all year round. When Jon Kenny was diagnosed with non-Hodgkin lymphoma in 2000, he had to stop performing while receiving treatment. He returned to a successful solo career, while he and Shortt reunited for a sell-out D’Unbelievables tour in 2011.\nOn television, he will be forever associated with the Father Ted series, where he played two roles – the local cinema manager owner, and a Eurovision host – but he excelled in straight parts too. His work included sharing the screen with Liam Neeson in Les Misérables. He voiced a woodcutter in Wolf Walkers and portrayed Gerry the fiddler in The Banshees of Inisherin. He also appeared in Angela’s Ashes and The Van.\nOn stage, his portrayal of Bull McCabe in Shoestring Theatre Company’s run of John B Keane’s The Field received rave reviews, while he made the role of Dicky Mick Dicky O’Connor in The Matchmaker his own.\nGemma Hussey\nPolitician\nGemma Hussey, who died on November 26th aged 86, was the third woman to hold Cabinet office since independence.\nAfter studying languages at UCD, she set up her own language school. She cofounded the Women’s Political Association and was its chairwoman from 1973 to 1975. She was elected to the Seanad in 1977 as an Independent and, four years later, stood for Fine Gael in the general election. While she failed to win a Dáil seat at her first attempt she was re-elected to the Seanad and was appointed leader of the House by the incoming taoiseach Garret FitzGerald.\nShe was elected to the Dáil in the first general election of 1982 and when Fine Gael made it back into government in the second election of that year, she became minister for education.\nShe established aural and oral exams and created the National Parents Council, but it was the battle over teachers’ pay that dominated her tenure, as the government struggled to get public finances under control.\nShe also served as minister for social welfare and minister for labour before retiring from politics in 1989. She wrote a memorable book about her time in office – At the Cutting Edge: Cabinet Diaries 1982-1987.\nShe later immersed herself in the European Women’s Federation, encouraging women in eastern Europe to become active in politics.\nDickie Rock\nSinger\nSinger and former Eurovision contestant for Ireland Dickie Rock died on December 6th at the age of 88.\nThe Dubliner was one of the biggest stars of Ireland’s showband scene as a member of the Miami Showband and later as a solo artist, with a career spanning seven decades.\nAn apprentice welder, he was recruited to lead the Miami Showband in 1963. That December, he enjoyed his first number one when the band covered Elvis’s There’s Always Me. In all, the band had seven number one hits during his tenure, with songs such as From the Candy Store on the Corner, in 1964, and Every Step of the Way which became the first release by an Irish band to go straight to the top.\nIn 1966, he came fourth in the Eurovision Song Contest in Luxembourg, with his song Come Back to Stay, another number one hit in Ireland. He left the Miami Showband in 1972, three years before the group was ambushed by loyalist paramilitaries and three of its musicians murdered.\nHis first solo single, The Last Waltz, reached number 15. But his biggest hit would be a cover of John Denver’s Back Home Again, which went to number one in 1977.\nHe continued to tour to packed houses into his 80s, finally announcing his retirement at the age of 84 in 2021.",
  "word_count": 11480,
  "scraped_at": "2026-02-14T12:09:54.110731"
}