{
  "article_id": "e6200b6ed141",
  "url": "https://english.news.cn/20250609/6a21e680002f42ee89b542cb7341ea17/c.html",
  "title": "Xinhua photos of the day - Xinhua",
  "date": "20250609T111500Z",
  "domain": "english.news.cn",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "This stack composite photo taken on June 8, 2025 shows the antenna for the Chinese Spectral Radioheliograph (CSRH), an imaging telescope array, under the milky way at the Ming'antu observing station of the National Astronomical Observatories of the Chinese Academy of Sciences in Zhengxiangbai Banner, Xilin Gol League, north China's Inner Mongolia Autonomous Region. (Photo by Liu Sai/Xinhua)\nVolunteers provide bottled water to a student at a national college entrance examination site in Changsha, central China's Hunan Province, June 8, 2025. Tianxin District of Changsha has organised volunteers to provide help for students and their parents at multiple local examination sites during this year's national college entrance exam. (Xinhua/Chen Zhenhai)\nAryna Sabalenka sheds tears during the awarding ceremony for the women's singles at the French Open tennis tournament at Roland Garros, Paris, France, June 7, 2025. (Xinhua/Gao Jing)\nThis drone photo taken on June 7, 2025 shows two red-crowned crane chicks following their parents in search of food at the Naoli River National Natural Reserve, northeast China's Heilongjiang Province.\nLocated in the heartland of northeast China's Sanjiang Plain, the Naoli River National Natural Reserve is a major habitat for migratory birds in Northeast Asia. (Photo by Sheng Jingli/Xinhua)\nAn aerial drone photo shows vehicles running to transport building materials at the construction site of the Huajiang Grand Canyon Bridge in southwest China's Guizhou Province, June 5, 2025.\nAs workers started to remove the gantry cranes and install elevators, the construction of the Huajiang Grand Canyon Bridge, which is set to become the world's tallest bridge, is expected to complete in the second half of 2025.\nA project of Guizhou Transportation Investment Group Co., Ltd., the suspension bridge has a vertical height of 625 meters from the bridge deck down to the river surface.\nThe 2,890-meter bridge, with a span of 1,420 meters, is also the world's largest span bridge to be built in a mountainous area. (Xinhua/Yang Wenbin)\nPeople attend a candlelight vigil outside the hospital where Colombian presidential candidate Miguel Uribe Turbay is being treated after the attack, in Bogota, Colombia, June 7, 2025.\nColombian senator Miguel Uribe Turbay, who is running for the presidency in 2026, was shot and seriously wounded at a campaign rally in Bogota on Saturday, local authorities said.\nColombia's Defense Minister Pedro Sanchez has announced the arrest of a suspect in the shooting of the senator, adding that an investigation is underway to determine whether others were involved. (Photo by Andres Moreno/Xinhua)\nA man dives into the water in Antalya, Türkiye, on June 7, 2025. (Mustafa Kaya/Handout via Xinhua)\nProtesters clash with Los Angeles sheriff deputies in Paramount, Los Angeles County, California, the United States, June 7, 2025. Several people were arrested on Saturday after protesters clashed with U.S. immigration agents for the second day in a row in Southern California. (Photo by Qiu Chen/Xinhua)\nStilt fishermen are seen near the southern Sri Lankan city of Galle, June 5, 2025. (Photo by Thilina Kaluthotage/Xinhua)\nAn aerial drone photo taken on June 8, 2025 shows ships docking for coal transportation at Liangshan Port in Jining, east China's Shandong Province.\nLiangshan Port serves as an important logistics hub connecting the western coal-producing areas with the Yangtze River Economic Belt.\nTo ensure the coal supply during the peak demand period in summer, Liangshan Port has focused on streamlining the mining, storage, transportation and sales of coal. The port has put a transfer project into operation, which connects railway transportation with waterway transportation.\nWith coal market trade reserves reaching 40 million tonnes and overall operation efficiency increased by 25% year-on-year, the port has significantly enhanced its capacity in handling the coal supply in emergency. (Xinhua/Guo Xulei)\nBelarusian President Alexander Lukashenko (L, front) hands the key, a symbol of the Belarusian National Football Stadium project built with Chinese support, to representatives of Belarusian athletes in Minsk, Belarus, June 7, 2025.\nThe Belarusian National Football Stadium officially opened here on Saturday evening, with President Alexander Lukashenko attending the inauguration ceremony.\nAs the largest and most modern football stadium in Belarus, it meets the highest international standards. With a seating capacity of over 33,000, the stadium was constructed under a general contract by Beijing Urban Construction Group, said the president. (Photo by Henadz Zhinkov/Xinhua)",
  "word_count": 703,
  "scraped_at": "2026-02-14T13:20:12.462769"
}