{
  "article_id": "e627e04d29ce",
  "url": "https://www.irishnews.com/gaa/brendan-crossan-build-casement-scorch-our-skyline-and-make-our-children-dream-NUVOMWRF4ZGRHET2LOIG4NDG5U/",
  "title": "Brendan Crossan : Build Casement , scorch the city skyline and make our children dream",
  "date": "20240222T211500Z",
  "domain": "irishnews.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "THE debate surrounding the rebuilding – or rather the re-imagining - of Casement Park has become decidedly toxic over the past few days.\nAt this stage, we shouldn’t be surprised. On many levels, Casement Park is a key measuring stick as to whether power-sharing can work here.\nHistorically opposed to the Good Friday Agreement, the Democratic Unionist Party [DUP] has been barely lukewarm towards the notion and has never prepared the ground for a political reset.\nThey’ve also conceded precious ground to its own political fringes and allowed them to do their bidding for them.\nPolitical unionism continues to wrestle and contort at the prospect of equality – and equality of provision.\nIn the absence of political leadership, warped thinking somehow morphs into acceptable discourse and breezes onto the mainstream media stage.\nStaring everyone in the face is a new 34,500 state-of-the-art stadium – a vibrant commercial and employment hub with a community and heritage centre, a community café, conference rooms, shops, handball facilities and much more that will reinvigorate the social, sporting and cultural fabric of the city.\nBut throw a couple of unfounded figures into the ether - £300m was one – and the anti-Casement Park brigade instantly turn into amateur accountants and fiscal freaks and become utterly obsessed with carparking.\nI’ve had the absolute privilege of covering big sporting events all around the world for the last couple of decades and never once did I park my car within a mile of a stadium.\nYou invariably reach these beautiful stadiums and life-affirming sporting occasions by public transport or, yes, by walking to them.\nGdansk, Hamburg, Hanover, Ibaraki, Bari, Stade de France and Suwon were all inconvenient to reach.\nSince Clonliffe College closed its gates, carparking can be difficult for attending games at Croke Park.\nBut, you know, we all somehow get over this devastating consequence.\nI park over a mile away from the famous stadium on match-days and walk to Jones’s Road. That’s part of the gig.\nWhat’s sadly become known as the ‘Casement Park debate’ has nothing to do with fiscal reasoning or carparking provision expressed by desperately concerned citizens.\nIt’s simply about denying the ‘other side’ equality of provision – a pledge contained in the Programme for Government a decade-and-a-half ago.\nIn 2011, the DUP collapsed the multi-sports stadium at the Long Kesh/Maze site which, as it happens, would have been less burdensome on the taxpayer.\nNow, the doom and gloom merchants in the party are adopting a mean-spirited, can’t-do attitude, knowing full well that there are in fact money trees in London and in Dublin that can and will make Casement Park happen.\nThis, from the same party whose successive health ministers cut student nursing places – they called it “efficiency savings” at the time - and now scoff at the temerity of the Irish Government for restoring 250 places in the north through the Shared Island Fund.\nThe ideal scenario for some people would be that Casement Park never gets built and Belfast passes up on the opportunity of hosting matches at the 2028 European Championships. This is classic cutting off your nose to spite your face politics.\nIf it was possible to build a brand-new tier all around Windsor Park so that it met the capacity threshold to host Euro 2028 games, would the Casement Park naysayers be obsessed with overspend and a tragic dearth of carparking in south Belfast?\nThey would be right to say: ‘Build it and they will come’.\nLast December, our youth football club brought over 70 young female footballers – between the ages of seven and 10 – to watch the Northern Ireland women’s team host their Republic of Ireland counterparts in a Nations League game.\nChanged times.\nOnce a ‘Cold House’ for Catholics, Windsor Park has become a more welcoming place for all denominations.\nFirst Minister Michelle O’Neill has stated she will attend Northern Ireland’s matches at the south Belfast venue.\nThe stadium’s rebuild, having adhered to its Programme for Government commitments, is first class and was fully deserved.\nTo that end, it’s only right Irish League stadia receive their much-needed cash injection. Why? To make this a better place to live and enjoy big events together.\nIt’s true empty vessels make the most noise in such debates, but in an interview with the GAA’s President-elect Jarlath Burns last October, the Armagh native was at pains to point out that all big stadia that are funded by the taxpayer, must have a strong municipal element to them.\nResponding to a section of the Northern Ireland fans chanting: ‘You can stick your Casement Park up your ****’, Burns said: “Given the divisions elsewhere [in the world], it is an incredible story to think that soccer would be played at Casement Park and that Northern Ireland would be playing at Casement Park.\n“That’s a really good news story because at the end of the day we want to make peace and we want a fully inclusive stadium, and what better way to show that the GAA is an inclusive organisation – because inclusion is one of our values – than to see the Northern Ireland team playing there.\n“I think the future of big stadiums in Ireland – the cost of them – is in this paradigm of almost having municipal stadiums. I would love to see lots of sports being played in Casement. That just makes us better.”\nExpect Jarlath to put some shape on the discussion at this weekend’s GAA Congress in Newry.\nAmid the incessant stream of meanspirited DUP press releases, the amateur accountants who roam our very amenable airwaves and who selflessly offer themselves as our fanatical watchdogs of fiscal imprudence up in Stormont, and not forgetting those conscientious souls who fear the lack of carparking will be the death of the project just can’t countenance a wonderful new stadium in their midst that will scorch the city’s skyline forever and a day and make our children dream of better days.",
  "word_count": 997,
  "scraped_at": "2026-02-14T14:11:05.922982"
}