{
  "article_id": "e6305ef20b6d",
  "url": "https://www.espn.co.uk/espn/story/_/id/46027436/only-matter-nigeria-esther-okoronkwo-becomes-ballon-dor-nominee",
  "title": "It only a matter of time before Nigeria Esther Okoronkwo becomes a Ballon dOr nominee",
  "date": "20250821T013000Z",
  "domain": "espn.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Nigeria midfielder Esther Okoronkwo was overlooked for the women's Ballon d'Or, but the real MVP of the Super Falcons' Africa Cup of Nations triumph has the potential to establish herself as the continent's top player over the years to come.\nIt's been a whirlwind month for the forward following her Player of the Match performance in Nigeria's come-from-behind 3-2 victory over Morocco in Rabat on July 26, with the AFC Toronto striker scoring once and registering two assists to inspire the Super Falcons to complete Mission X in some style.\nSince then, she's received acclaim and reward from Nigeria and beyond, being received by Head of State President Bola Tinubu at an elaborate reception at the presidential residence, where the squad were each promised $100,000 (£75,000) as well as a three-bedroom Abuja apartment.\nOkoronkwo, who was born in Abia State before being raised in Richmond, Texas, has also been honoured separately in her home state, where Governor Alex Otti is seeking to recognise the 28-year-old for her services to the nation during the WAFCON.\n\"She converted the crucial opening goal from the spot, and with two sublime assists, powered our team to a triumphant win that crowned Nigeria African Champions once again,\" the governor wrote on his @alexottiofr handle.\n\"Her performance spoke volumes, not just in stats, but in spirit, courage, and leadership on the pitch.\"\nEd Dove praises Esther Okoronkwo for inspiring Nigeria's 3-2 comeback victory over Morocco to win the Women's Africa Cup of Nations.\nRevered at home, Okoronkwo's WAFCON showing was not enough for her to make the cut for the women's Ballon d'Or list.\nTwo NWSL-based African players -- Barbra Banda and Temwa Chawinga -- were included, but late bloomer Okoronkwo will have to wait until next year's reveal, or the African Footballer of the Year award to be announced in December, before she gets the individual recognition her talent surely deserves.\nShe's a player who knows what it means to bide her time and wait for her moment in the sun; her current standing in the continental game could scarcely have been predicted for the forward, who had previously been a bit-part player for the national side at major tournaments.\nInjured before the last WAFCON, she featured just once at the FIFA Women's World Cup in 2023 and started one fixture at the Olympics in Paris last year, but as she returns to AFC Toronto, can look back proudly on a tournament performance which has surely transformed the trajectory of her career.\n\"Even when I tore my ACL two times, in both legs, I never gave up,\" she told ESPN. \"I know how much I can give and what I can achieve in my life, just believe in yourself.\n\"Before the 2022 tournament, I tore my ACL, and it was heartbreaking for me,\" she continued, \"but I knew in the back of my mind that I was going to make a comeback. I just never gave up, and kept working.\"\nHaving shown her true quality with the Falcons only sporadically in recent years, Okoronkwo dazzled at the WAFCON, and was arguably unfortunate not to have been selected as Player of the Tournament ahead of Rasheedat Ajibade.\nThe 28-year-old contributed six assists during the campaign, while also weighing in with goals in the 5-0 quarterfinal mauling of Zambia and to begin the Falcons' comeback against Morocco in the tournament final.\nShe was inspirational in both key matches, first against the Copper Queens, setting up Osinachi Ohale's opener with a fine free kick, before adding a second herself just after the half-hour mark.\nHer wand of a left foot also set up Nigeria's other centre back -- Oluwatosin Demehin -- to add a fourth for the Falcons on 68 minutes, capping off a truly inspirational display by the forward.\nAfter the fixture, her teammate Ashleigh Plumptre described Okoronkwo's key qualities to ESPN, describing the attacker as \"one of the best strikers I think I've ever seen,\" and \"the most creative player on [the Nigeria] team.\"\nOkoronkwo, nicknamed 'Yesi', took her game to another level in the final, where Nigeria found themselves 2-0 down after a disastrous opening 25 minutes, and needing something special to find their way back into the contest, let alone unseat the would-be champions Morocco.\nIndeed, Okoronkwo was at the heart of a magnificent salvation act as Nigeria rallied to prevail 3-2 following a stunning second-half comeback.\nFirst, she took responsibility ahead of captain Ajibade to equalise from the penalty spot soon after the hour mark following Nouhaila Benzina's innocuous handball.\nOkoronkwo then turned provider to set up Folashade Ijamilusi for the equaliser seven minutes later with an excellent cross, before her set piece, deftly delivered, allowed Jennifer Echegini to tap home from close range two minutes from time and ultimately seal tenth continental crown for the Falcons.\nHistory was made for Nigeria, but Okoronkwo -- named Fans Player of the Tournament after the WAFCON -- is determined that the Falcons' return to the pinnacle of the continental game translates to greater growth of women's football in the West African country.\n\"It showed the resilience in us, the fire,\" Okoronwko confided. \"We want more, and we want more support, from the fans, the country, for women's football in general.\n\"We want [women's football] to grow, the more eyeballs on it, the more people who are watching, the more support we're getting,\" she continued. \"We were also here to change the story, to show people we're worth it, to keep watching, to keep supporting, because we need the support, stuff like that.\"\nBetween now and 2028, Okoronwko is in line to compete in another WAFCON, the World Cup, and the 2028 Olympics during some of her prime years. They are campaigns that will shape her legacy, as she continues to make up for lost time, and, if she can build on the momentum of Morocco, will surely put her in contention for top individual prizes in the sport.\nAt club level, it remains to be seen how the newly inaugurated Canadian top flight -- the Northern Super League (NSL) -- will establish itself against the biggest women's league in the world game, although some of the division's star power as well as the burgeoning enthusiasm for the sport in the country, suggest that there's reason to be encouraged.\nIt remains to be seen whether, over the years to come, playing in the NSL will preclude the Nigerian forward from truly enjoying a status in the global game that her talent surely deserves.\nFor Okoronwko, however, talk of individual honours are put to one side as she looks ahead to further glories with the Falcons.\n\"No [the WAFCON win doesn't change my career path], I'll just keep working hard. Obviously, it's my first major win with the Super Falcons, so I'm very happy about this.\n\"Next year, we go again, we get the W [win], and we go again.\"\nIf she can conjure up the magic of Morocco in competitions to come, Okoronkwo should prove beyond doubt that she could to be considered alongside the very best African players in the game today.",
  "word_count": 1187,
  "scraped_at": "2026-02-14T12:43:48.237185"
}