{
  "article_id": "e651ab1c1319",
  "url": "https://news.yahoo.com/gianni-infantino-admits-learning-process-170045457.html",
  "title": "Gianni Infantino admits  learning proces after OneLove armband row",
  "date": "20230304T180000Z",
  "domain": "news.yahoo.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Gianni Infantino admits ‘learning process’ after OneLove armband row\nFIFA president Gianni Infantino says all sides have lessons to learn from the armband row at last year’s World Cup in Qatar and is confident there will be “a solution” in time for this year’s women’s finals in Australia and New Zealand.\nEngland and Wales were threatened with unlimited sporting sanctions on the day of their opening matches in Qatar if their captains Harry Kane and Gareth Bale wore the ‘OneLove’ anti-discrimination armbands, starting at a yellow card for the skippers.\nThe bands are part of a wider year-long campaign which began last September, but would have sent out a particularly strong message in Qatar where same-sex relationships are criminalised.\nFIFA faced criticism for appearing to bow to local sensitivities, while the seven European nations competing in Qatar who had intended to wear the bands were criticised for backing down to FIFA’s threats.\nInfantino said at a press conference following the International Football Association Board (IFAB) annual general meeting in London: “We all went through a learning process.\n“What we will try to do better this time is to search for a dialogue with everyone involved – the captains, the federations, the players, FIFA – to capture the different sensitivities and see what can be done in order to express a position, a value or a feeling that somebody has in a positive way, without hurting anyone else.\n“We are looking for dialogue and we will have a solution in place well before the Women’s World Cup.”\nEngland Women captain Leah Williamson said last month she hoped to be able to wear the OneLove armband at this summer’s tournament.\n“Obviously, you hope it’s not a last-minute call once we get there but it’s something we want to do all year round,” she said.\n“(The World Cup) is a great stage and a great time to promote the values we believe in so much, so I hope it’s the same.”\nFootball Association chief executive Mark Bullingham said on Saturday: “We all had a lot to learn out of Qatar. I’m not pointing a finger at anyone in particular.\n“We are determined that we don’t have that going into the summer.\n“We’ve actually been speaking for a few weeks about how we avoid that situation and how we reach a position. I do think it’s important that players have an opportunity to have their voices heard. How that comes true, there are a number of different ways to look at. But we’ve started the conversation, we’ll see where we get to.”\nAsked whether there was now an openness from FIFA to listen, Bullingham said: “Yes, I think so.”",
  "word_count": 445,
  "scraped_at": "2026-02-14T13:46:09.425440"
}