{
  "article_id": "e65b74ce9b46",
  "url": "https://www.irishmirror.ie/showbiz/celebrity-news/jack-grealishs-girlfriend-sasha-shares-30203540",
  "title": "Jack Grealish girlfriend Sasha shares rare public message for him ahead of Man City game",
  "date": "20230610T191500Z",
  "domain": "irishmirror.ie",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Jack Grealish's girlfriend Sasha shares rare public message for him ahead of Man City game\nManchester City take on Inter Milan in just a few hours time, hoping to bag their first ever Champions League trophy, and midfielder Jack Grealish's girlfriend Sasha Attwood is getting behind her beau and his teammates\nJack Grealish's on-off girlfriend is showing her support for the Manchester City ace ahead of his big night in Turkey this evening.\nSasha Attwood, who has dated the footballer since their school days, took to Instagram earlier today to send a sweet message to her childhood sweetheart and the rest of his teammates before their must-win game.\nJack and his Manchester City teammates take on Inter Milan in Istanbul in this year's Champions League final later tonight, with the English club hoping to win the competition for the first time in the club's entire history.\nPep Guardiola's side will complete their treble if they manage to beat the Italian football team once the match kicks off at 8pm, after winning the Premier League and F.A Cup earlier this year.\nEngland international Jack, who left his boyhood club Aston Villa to sign for Man City in 2021, will be hoping to add to his growing collection of medals and help secure glory for his team on the pitch at the Atatürk Olympic Stadium.\nJust hours ahead of kick-off, the 27-year-old's on-off beau Sasha took to her Instagram page to let the world know she's right behind her man and will be cheering him on.\nAfter reposting a snap of her boyfriend in his blue Man City kit to her 176,000 followers, Sasha then shared another post from the football club's official account and added her own message.\n\"Come on @mancity [blue loveheart emojis],\" the model penned ahead of Jack's huge game.\nThe blonde beauty and the professional footballer first met at St Peter's Roman Catholic Secondary School in Solihull as school kids and began dating at the age of 15.\nIn the 12 years since their romance begun, the pair have had an on-off relationship - with the Manchester City player even incorrectly rumoured to have dated Emily Atack and Amber Rose Gill behind the model's back over recent years.\nWhile Sasha usually keeps quiet about the speculation surrounding her love life, boyfriend Jack broke his silence about the constant rumours in December 2021.\nThe loveable sports star told fans not to \"believe everything you read\", after speculation mounted he'd been dating other women.\nEngland's number seven shared a short statement on his Instagram Stories, pleading with his followers to ignore the rumours surrounding his love life.\nIn addition to modelling, Sasha also has a presence on YouTube, where she has previously used to discuss the intense death threats she can receive due to dating one of the world's most fancied footballers.\nChatting on her channel after England's Euro 2020 campaign, she said: \"Things have obviously blown up over the Euros, but I never thought in a million years it would ever be this bad.\n\"It just kind of blows my mind how nasty people can be for no reason whatsoever.\"\n* Follow Mirror Celebs on Snapchat , Instagram , Twitter and Facebook .",
  "word_count": 534,
  "scraped_at": "2026-02-14T12:45:59.843144"
}