{
  "article_id": "e6604676db8e",
  "url": "https://www.capitalfm.com/news/tv-film/love-island/dejon-famous-dad-gifton-noel-williams/",
  "title": "Love Island star Dejon famous dad revealed",
  "date": "20250722T001500Z",
  "domain": "capitalfm.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Love Island star Dejon's famous dad revealed\n21 July 2025, 21:00 | Updated: 22 July 2025, 11:27\nLove Island's Dejon has a famous father that he's never mentioned.\nListen to this article\nLove Island's Dejon Noel-Williams has been keeping a secret from viewers... it's that he has a famous dad!\nDejon is the son of footballer Gifton Noel-Williams. The football striker-turned-manager has played for league teams including Watford, Stoke City and Burnley but retired in 2010 due to a serious knee injury from years before.\nSpeaking about his dad before the villa, Dejon told ITV: \"I’ve met all kinds of famous people through him. When I was younger it was weird because he was just my dad, but we’d go to a game and fans were asking for photos.\n\"I’ve met David Beckham, he was really nice.\"\nWho is Love Island's Dejon's famous dad?\nDejon's dad is 45-year-old football manager Gifton Noel-Williams who was Watford's top goalscorer when he was just 19. Between 1996 and 2010 he played for other teams like Stoke City, Real Murcia and Burnley.\nAfter years of other coaching gigs, Gifton now works as the Technical Director for the Grenada Football Association which he started in June 2023.\nDejon isn't the only islander on series 12 that has famous relatives, as now dumped islanders Lucy Quinn and Giorgio Russo revealed they have celebrity in their family tree.\nWhile it was never aired on the show, Giorgio's sister is professional footballer Alessia Russo, best known for playing as a forward for Arsenal and the England national team (who are competing in the European Women's Championship).\nGiorgio has since revealed Tommy Bradley and Conor Philips figured this out as soon as they found out his full name and he was surprised it was never shown in an episode.\nAnd for Lucy, her claim to fame is her uncle Ray Quinn who's best known for his appearance on X Factor in 2006, where he finished in second place behind Leona Lewis.\nRead more about Love Island here:\n- Love Island's Harrison responds to damning Woman's Aid statement\n- Love Island star Dejon's sister gives her honest opinion on Meg\n- Love Island's Megan reveals how Conor knew her before the villa\n- Love Island's Harrison breaks silence on being intimate with Lauren after backlash\n- Love Island's Tommy defends Lucy's voice note as she confirms it's real",
  "word_count": 398,
  "scraped_at": "2026-02-14T13:32:56.728842"
}