{
  "article_id": "e666197cfc4a",
  "url": "https://metro.co.uk/2025/12/07/won-im-a-celebrity-full-list-winners-ahead-2025-final-25243418/",
  "title": "Who has won Im A Celebrity before ? Full list of winners ahead of 2025 final",
  "date": "20251207T114500Z",
  "domain": "metro.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "I’m A Celebrity 2025 is drawing to a close with the final three contestants being announced ahead of tonight’s final.\nSocial media star Angry Ginge, EastEnders actress Shona McGarty and Celebs Go Dating client co-ordinator Tom Read Wilson will battle it out to be crowned King or Queen of the jungle.\nRapper Aitch became the ninth celebrity to leave the ITV1 reality show in the penultimate episode and narrowly missed out on the final after 22 days in camp.\nAhead of the final, we decided to look back on those tenacious few who managed to endure the indignities of the jungle and be crowned winners.\nOver the last 20 years or so, the I’m a Celeb royal family has grown to include sporting legends, reality favourites, sensational singers, a chef and even panto stars!\nGet personalised updates on I'm A Celeb\nWake up to find news on your TV shows in your inbox every morning with Metro’s TV Newsletter.\nSign up to our newsletter and then select your show in the link we’ll send you so we can get TV news tailored to you.\nSo take a wander through the camps of yesteryear and enjoy this list of all the I’m a Celeb winners (so far).\nFull list of I’m A Celebrity winners from 2002 to 2024\n2002 – Tony Blackburn\nThe first winner of I’m A Celebrity… Get Me Out of Here! was Tony Blackburn, all the way back in 2002 – that’s 22 long years ago, for those of you keeping count!\nRadio DJ and TV personality Tony, who was 61 at the time, made it to the final three alongside Tara Palmer-Tomkinson and author Christine Hamilton.\nDespite being just 61, Tony was the oldest member in the camp that year, but still ‘found [himself] able to relax despite the atmosphere’.\nThings got tense in the camp during the first year as the contestants adjusted to their surroundings and struggled to get used to each other.\nBut at the end of it all, Tony was named King of the Jungle and was the first winner to walk across the famous bridge with a glass of champagne.\nTony’s victory was watched by a series average of 7.58 million people, with the first competition still needing a bit of time to win the rest of its audience over.\n2003 – Phil Tufnell\nAfter Tony Blackburn, former cricketer Phil Tufnell was the second celebrity to win I’m A Celebrity… Get Me Out of Here!\nPhil, 37 at the time, beat competition from former footballer John Fashanu, Changing Rooms presenter Linda Barker, and dancer Wayne Sleep to become the King.\nCelebrating his win with an ice-cold pint, Phil was also the first winning contestant to be actually, properly crowned – Tony had only been given champagne.\nPhil’s victory meant he became one of only four celebrities to have won I’m A Celebrity after being in the bottom two at a prior stage of the series.\nThe season won by Phil was also the last I’m A Celebrity contest to be screened in the summer, and was also the last to only be 15 days long.\nPhil’s win was watched by an average of 8.55 million people on ITV, with its new flagship series gaining popularity with the British public.\nJanuary 2004 – Kerry Katona\nHot on the heels of Phil’s win, Kerry Katona was confirmed as the first Queen of the Jungle just six months after the previous season.\nAt this point, I’m A Celebrity was the biggest show on ITV and one of the most popular series in the country – and 2004 was the absolute peak.\nThe country watched on as Katie Price and Peter Andre fell in love, while Sex Pistols vocalist Johnny Rotten fell out with absolutely everyone and everything in camp.\nAt the end of it all, Kerry was crowned the Queen, having remained out of the bottom two in the public voting for her entire stay in the Australian jungle.\n14.9 million people watched the finale as the show’s success ballooned overnight, with the series average going above 10 million for the first time.\nNovember 2004 – Joe Pasquale\nAnd so began the annual tradition of I’m A Celebrity, beginning in November, with Joe Pasquale winning the programme 21 years ago in 2004.\nThe comedian beat competition from Royal servant Paul Burrell and nightclub manager Fran Cosgrove in a tense final episode.\nThis season was particularly notorious for the difficult Bushtucker Trials, which saw the celebrities going hungrier than ever before on the show.\nFormer All Saints singer Natalie Appleton quit the show after being nominated for five consecutive Bushtucker Trials, and former East 17 singer Brian Harvey also quit after a spat with Janet Street-Porter.\nViewing figures dipped slightly from Kerry’s win, with a series average of 8.66 million people watching Joe be crowned King.\n2005 – Carol Thatcher\nThe 2005 season of I’m A Celebrity produced one of the few shock winners, as Margaret Thatcher’s daughter Carol reigned victorious.\nGiven the former Prime Minister’s controversial reputation with the British public, it was expected that her daughter Carol would go home early.\nBut the journalist won the public over and, at the age of 52, she walked across the red carpeted bridge with champagne in hand and crown on.\nEastEnders actress Elaine Lordan left the jungle on day one in 2005 after fainting twice in camp, famously being stretchered out of camp as the others waved her away.\nMidway through the competition, Carol famously got up in the middle of the night to pee right next to her hammock instead of going to the dunny.\nRatings recovered from the last season, with an average of 9.42 million people tuning in to watch the increasingly popular reality series.\n2006 – Matt Willis\nDanny isn’t the only McFly-Busted winner in I’m A Celebrity history, with Busted singer Matt Willis also clinching the title in 2006.\nDespite being bitten by a baby alligator, Matt beat competition from Hear’Say singer Myleene Klass and Stock Aitken Waterman star Jason Donovan.\n2006 was the year of pop domination in the jungle.\nThe series perhaps became most famous for Myleene’s infamous white bikini jungle shower photos, which were published in the press and caused a national storm.\nIt was a different time.\nHowever, ratings dropped to just 8.01 million on average, which was the lowest average rating since the first season four years earlier.\n2007 – Christopher Biggins\nChristopher Biggins was the firm favourite with the public from the outset during his time in the jungle, with his larger-than-life personality seeing him crowned King of the Jungle.\nHappy to make a fool of himself – and drop a few famous names into his stories now and then – Christopher took to the Bushtucker Trials with ease, winning 81% of his stars.\nHe is one of the few winners of I’m A Celebrity who was actually a late arrival to the camp, only turning up on day five of the competition.\nSupermodel Janice Dickinson came second that year, while Five singer J Brown finished in third. Christopher received his crown and sceptre.\nRatings dipped further again, however, to the lowest average yet of 7.34 million viewers – something needed to change for I’m A Celebrity.\n2008 – Joe Swash\nEastEnders star Joe Swash swept to victory on I’m A Celebrity in 2008 after three weeks in the jungle camp.\nHe beat competition from former tennis star Martina Navratilova, Star Trek actor George Takei, and pop singers Simon Webbe and David Van Day.\nITV bosses must have breathed a sigh of relief when looking at the TV ratings, with the star-studded line-up proving to be a winner with viewers.\nAn average of 8.78 million people watched the eighth season, which was the highest-rated season for three years – since Carol’s win.\nJoe proved so popular on I’m A Celeb that he stayed attached to the series, eventually hosting its supplementary chat show I’m A Celebrity: Extra Camp between 2009 and 2018.\n2009 – Gino D’Acampo\nTV chef Gino D’Acampo won I’m A Celebrity 15 years ago in 2009.\nUpon arriving in camp, he made sure to become camp cook after realising he wouldn’t just ‘get a baguette off camera’.\nHe was in the finale alongside Kim Woodburn, and former snooker player Jimmy White, and he won with a staggering 82% of the viewers’ votes.\nDuring Gino’s winning season, the ratings improved again as the show reached a second peak, with an average of 9.37 viewers tuning in.\n2010 – Stacey Solomon\nIf 2004 was the first peak of I’m A Celebrity, the 2010 season – which saw Stacey Solomon announced as the Queen of the Jungle – was definitely the second.\nAn absolutely iconic competition, I’m A Celebrity 2010 was packed with so many iconic British pop culture moments that we don’t have space to list them all.\nBut at the very top of the pile, it has to be Gillian McKeith fainting on live TV after being selected for yet another Bushtucker Trial by the British public.\nStacey won viewers over almost instantly, absolutely owning her Bushtucker Trials, and beat close competition from Shaun Ryder to be crowned as Queen. She even met her future husband Joe Swash on the spin-off show.\nThe ratings were surely music to ITV’s ears, with the average for the season climbing to 10.36 million – the highest in six years.\n2011 – Dougie Poynter\nMcFly singer Dougie Poynter became the first of two winners from the Noughties band in 2011.\nHis airtight bromance with Mark Wright stole the show that year – with the pair eventually becoming the final two after 21 days in the jungle.\nThe vote was close, too, with Dougie taking the crown with just 55% of the vote – the lowest amount for a winner for years. Dougie and Mark were just that popular as a pair.\nThat year, Freddie Starr wowed viewers when he ate more than his fair share during a live Bushtucker Trial, but collapsed in camp after suffering a severe allergic reaction and was told not to return by doctors.\nViewers tuned in in their millions again, but with a season average of 10.06 million, things took a little dip for the ITV series again after 2010 had proved so popular.\n2012 – Charlie Brooks\nCharlie Brooks made sure 2012 was her year, being crowned Queen of the Jungle by just 1.12% of the public vote over singer Ashley Roberts.\nEastEnders star Charlie, who played Janine in the Albert Square soap, was seen struggling during her time in the jungle, missing her young daughter as well as her regular home comforts.\nBut her perseverance didn’t go unnoticed by the viewers at home, who became attached to her as she surpassed her own expectations.\nBrian Conley quit the jungle on day nine after suffering from malnutrition and exhaustion, saying at the time: ‘I started feeling really bad, and very shortly after that I did have to leave.’\nNadine Dorries MP was suspended by the Conservative Party for choosing to take part, while Helen Flanagan struggled in several of her Bushtucker Trials.\nHowever, ITV were pleased to see viewing figures climb again after 2011, with an average of 10.47 million people tuning in across the season.\n2013 – Kian Egan\nWestlife singer Kian Egan won the ITV series just over a decade ago, beating competition from David Emanuel and EastEnders’ Lucy Pargeter.\nThe series is perhaps best remembered for the gradual softening of actor and comedian, The Fresh Prince of Bel-Air star Alfonso Ribeiro.\nHe was frequently grumpy and upset in the early days, but he soon put a smile on his face and made it all the way to day 19, eventually finishing sixth after looking like he’d be the first to go.\nKian proved massively popular with the public, never dropping into the bottom two during his journey to the crown, and winning with 67% of the vote.\nAnd the show itself was becoming more and more popular, with 11.11 million people (on average) tuning in to watch King Kian.\n2014 – Carl Fogarty\nMotorbike racer Carl ‘Foggy’ Fogarty was truly a machine when it came to Bushtucker Trials – and may be one of the highest star earners to ever compete on the show.\nIn the seven trials he took part in, he had a 100% success rate, meaning he took back to camp every meal up for grabs, every single time – that’s an I’m A Celeb hero right there.\nSo it was only right that he became the King of the Jungle, beating competition from The X Factor’s Jake Quickenden and TV presenter Melanie Sykes.\nAfter hitting a series average peak of 11.11 million viewers in 2013, I’m A Celebrity stayed popular on ITV with a 2014 series average of 10.26 million.\n2015 – Vicky Pattison\nAfter two years of Kings, Geordie Shore star Vicky Pattison became the first Queen of the Jungle since EastEnders’ star Charlie Brooks in 2012.\nVicky’s ‘can-do’ and cheeky nature were credited with completely revamping her image from her Geordie Shore days, taking her to the win.\nThat year, Made in Chelsea star Spencer Matthews left the show following an ‘error of judgement’ regarding steroid medication.\n12 days later, Lady Colin Campbell left the camp after becoming one of the most controversial contestants in the show’s history, rowing famously with Dragons’ Den’s Duncan Bannatyne.\nRatings dropped again, however, dipping down to a season average of 9.86 million viewers – the lowest total since the end of the Noughties.\n2016 – Scarlett Moffatt\nNo doubt about it, Scarlett Moffatt became at one with nature pretty quickly in the jungle – she famously fell headfirst out of a canoe before even getting to camp.\nOnce there, she admitted she didn’t shower for more than a week – the show’s medical specialist Bob had to intervene and ordered her to clean up.\nScarlett was sweet but assertive in both camp life and the trials, proving the most popular choice by viewers, with Joel Dommett finishing in second place and Adam Thomas in third.\nViewers were clearly keen on Scarlett, too, with the season average jumping back up to a healthy 10.46 million people.\n2017 – Georgia Toffolo\nGeorgia Toffolo was the nation’s sweetheart for three weeks on her way to becoming the third consecutive Queen of the Jungle.\nShe became especially close to Stanley Johnson – former Prime Minister Boris Johnson’s father – and endeared herself to millions of people at home.\nGeorgia eventually won the show while Hollyoaks actor Jamie Lomas, TV presenter Iain Lee, and Coronation Street’s Jennie McAlpine all made the latter stages of the competition.\nThe 2017 I’m A Celebrity series also saw Jack Maynard forced to withdraw after past social media activity was exposed by the public.\nAn average of 9.98 million people tuned in across the series, with the show’s popularity taking a hit but still remaining relatively strong.\n2018 – Harry Redknapp\nFormer football manager Harry Redknapp won the public over quickly and became the first King of the Jungle since Carl Fogarty in 2014.\nHe beat Emily Atack and John Barrowman, who came second and third respectively, with fans coming to love him after he showed his affection for his wife Sandra and jam roly-polys.\n2018 was perhaps most famous for coming in the middle of Ant’s year-long break from TV, making it the first I’m A Celebrity series not to be hosted by both Ant and Dec.\nInstead, Holly Willougby stood in, with the series attracting its biggest audiences yet, averaging 12.18 million viewers across the 2018 season.\n2019 – Jacqueline Jossa\nEastEnders star Jacqueline Jossa beat competition from Andy Whyment and Roman Kemp to secure the win five years ago.\nDuring the emotional season finale, both Andy and Jacqueline burst into tears as the announcement was made – they both would have been happy for the other to win.\nShe said in her post-win interview: ‘I can’t believe I did all that stuff. It was not what I expected; it was a lot harder. But also, I just didn’t think it was going to be such a turning point in life.’\nViewing figures dropped from the 2018 series high back down to a 10.59 million average for the season.\n2020 – Giovanna Fletcher\nThanks to the Covid-19 pandemic, I’m A Celebrity didn’t take place in Australia for the very first time in 2020 – instead, it was in a castle in Wales.\nRegardless, that didn’t stop Queen of the Castle Giovanna Fletcher from accepting her crown, becoming the second person associated with McFly to win the competition.\nMarried to McFly singer Tom, she followed in Dougie Poynter’s footsteps to protect the I’m A Celeb dynasty upheld by the All About You singers.\nDuring the series, North Wales Police investigated the show after concerns were raised that cockroaches and scorpions could escape the castle and enter the Welsh countryside.\nThe series proved popular with viewers, with the season average climbing back up to 11.05 – we all turned to I’m A Celebrity at the height of Covid-19’s lockdown.\n2021 – Danny Miller\nDue to ongoing conditions enforced on the show by Covid-19, I’m A Celebrity stayed in Wales for 2021, where Danny Miller was the one to make it to the very end.\nThe Emmerdale star beat Coronation Street’s Simon Gregson in a battle of the TV soaps, with Danny notching 55% of the public vote in the final.\nThat year, TV host Richard Madeley was forced to leave the castle in unusual and unfortunate circumstances.\nAfter enduring a rather yucky Bushtucker trial, Madeley began to feel unwell in the early hours of the morning and was taken to the hospital as a precaution.\nUnfortunately, going to the hospital meant that he left the camp’s secure Covid bubble, and he was forced to withdraw from the competition.\nRatings took a serious hit, though, with just 7.61 million people tuning in for this season – a drop of almost four million from the previous season.\n2022 – Jill Scott\nWith the Covid-19 pandemic finally entering the rear-view mirror, I’m A Celebrity returned to Australia for the first time in three years.\nAnd it was former England and Manchester City women’s footballer Jill Scott who was crowned Queen of the Jungle for her efforts.\nJill became a bit of a sensation after England’s women won the Euros in 2022, when footage emerged of her yelling an expletive during a heated match.\nShe sailed to victory, eventually beating Hollyoaks actor Owen Warner to the throne, having never been in the bottom two for elimination.\nThe 2022 series proved controversial, however, as Conservative MP Matt Hancock entered the jungle after numerous scandals in the UK press.\nReturning to Australia helped the series recover its viewership, too, with an average of 10.94 million people tuning in over the course of the season.\nSouth Africa 2023 – Myleene Klass\nAfter coming so close to the title in 2006, Myleene was finally granted the title of Queen of the Desert as I’m A Celebrity took its first all-stars season to South Africa.\nAmong the returning cast were former winners Georgia, Joe , and Phil , but Myleene beat them all to soar to victory.\nHowever, viewers were a little put off by the change in premise from the original series, and only 5.05 million people (on average) tuned in over the season.\n2023 – Sam Thompson\nIt was back to normal in Australia for the 2023 series as I’m A Celebrity left South Africa behind last year.\nSam Thompson, the TV personality and radio presenter, won the competition after 21 days in camp, beating boxer Tony Bellew at the final hurdle.\nITV attracted a mixed reaction when it included politician Nigel Farage in the line-up, with the former Ukip leader eventually finishing third.\nFans had hoped that Britney Spears’ sister Jamie Lynn Spears would be a campmate full of stories, but she quit after just 11 days in camp.\nRatings took a big hit, however, dropping to an average of 8.36 million people over the course of the season – the worst for an Australian season since 2008.\n2024 – Danny Jones\nAnd so, we come to the most recent King of the Jungle, Danny Jones, who beat runner-up Coleen Rooney to be the new I’m A Celebrity champion.\nMore Trending\nIn doing so, he became the second McFly member to win the competition after Dougie Poynter and the fourth McFly-connected champion overall.\nAfter the controversy of casting Matt Hancock and Nigel Farage on the show in the past, no politicians were included in the 2024 line-up.\nDuring the vote for the final three, Danny received 41.36%, with Coleen picking up 33.47%, and Richard Coles gaining 25.18%.\nThe I’m A Celebrity… Get Me Out Of Here! final airs at 9pm on ITV1, STV and ITV on Sunday.\nGot a story?\nIf you’ve got a celebrity story, video or pictures get in touch with the Metro.co.uk entertainment team by emailing us celebtips@metro.co.uk, calling 020 3615 2145 or by visiting our Submit Stuff page – we’d love to hear from you.\nDeals of the Day\n-\nThe Traitors is over – but Claudia Winkleman’s shoes are everywhere\n-\nCraving sun, city streets or theme parks holdays? This £99 mystery deal has it all\n-\nThis easy concealer trick transformed how my makeup looks and lasts all day\n-\nTour Emily in Paris Season 6 Rome hotspots with a getaway from just £79pp\n-\n11 of the best expert-approved running shoes to buy now\nMORE: EastEnders child star looks totally different 19 years on – do you recognise her?\nMORE: I’m A Celebrity star Jack Osbourne shuts down sister’s claim Kelly Brook was a ‘bully’\nMORE: I’m A Celebrity star relapsed into drug addiction due to ‘stress of the show’",
  "word_count": 3655,
  "scraped_at": "2026-02-14T12:59:04.568749"
}