{
  "article_id": "e67494e0bd66",
  "url": "https://www.yahoo.com/news/silver-wave-help-elect-kamala-140000736.html",
  "title": "Will a Silver Wave Help Elect Kamala Harris ? ",
  "date": "20240902T150000Z",
  "domain": "yahoo.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Will a Silver Wave Help Elect Kamala Harris?\nLet’s say you were going to your high school prom in the spring of 1969, and you turned on the (probably AM) radio in your Mustang on the way to the school cafeteria — the Number One song in America? Aquarius/Let the Sun Shine In. Fast forward 55 years, and you’re 73, right about the median age for surviving baby boomers. Which means, as we start casting votes next month, you’re going to play a disproportionate role in the outcome of the coming election. That’s because candidates have to work hard to lure younger voters to the polls, but not so with the old, who have the habit of democracy most strongly ingrained. There’s no known way to stop old people from voting.\nDonald Trump might be inclined to think that’s good news for him — that as the oldest man ever to win a presidential nomination and one whose campaign is rooted in nostalgic appeals to past greatness, he should harvest most of those votes from the boomers and the Silent Generation. After all, he won those categories in 2020, though by reduced margins from 2016. But not so fast this time — remember that tune from Hair on the radio. We’re turning out more older voters all the time — about 10,000 people a day pass the 65-year mark. And increasingly, they’re starting to make that caricature — older voters are more conservative — irrelevant. Older voters come from the past — but the past they come from is changing. Which means new polling indicates that something like a silver wave may be building as November approaches.\nConsider, for instance, the Fairleigh Dickinson poll last week that found the biggest lead yet for Kamala Harris — a seven-point national edge that came largely from her 16-point lead among people over the age of 65. On Thursday, a Suffolk University poll for USA Today found Harris leading Trump 53-42 among voters over 60 — her largest vote share of any demographic. And it’s the same in many of the swing states: A New York Times/Siena College poll showed her with a modest lead among older voters in Arizona — and there are a lot of older voters in Arizona. In North Carolina, another swing state crowded with retirees, she’s up by 10 points among older voters. In Maine, statistically the oldest state in the union, Harris led by 20 points among older voters. In Vermont, the second-oldest state, 61 percent of older voters thought Trump’s mental and physical health were “very poor,” higher than any other group. (Which is worth thinking about — if anyone’s an expert on gauging decline, it’s those of us who see it around us regularly, and perhaps sense it in ourselves).\nThere are enough polls out there that you can find the opposite too — the last Washington Post poll, now almost two weeks old, shows Trump beating Harris by two points among older voters, and a Pell Center poll had him up by three. But I think it’s safe to say Trump shouldn’t count on older voters. At Third Act, which I founded to organize progressive voters over the age of 60, our volunteers have written hundreds of thousands of postcards to swing states, and they’re phone banking every night; they report anecdotally a huge surge of interest in and support for the Harris-Walz ticket. We organized an “Elders for Kamala” call last month, and it blew up fast — with Jane Fonda, Bette Midler, and Robin Wall Kimmerer all making the case that older Americans were thinking progressive.\nSome of this can be explained by simple self-interest. We older voters know that the last time around Trump made repeated efforts to cut Medicare and Social Security, and we paid attention earlier this year when, asked about the entitlement programs, he mused that “there is a lot you can do in terms of entitlements, in terms of cutting.”\nBut I think deeper cultural forces are also at play — the muscle memory, the generational DNA, that was formed in that remarkable period of social, cultural, and political transformation that was the 1960s. It was the apex of the civil rights campaigns, the rise of the women’s movement, the first Earth Day. As the political analyst Nate Cohn pointed out earlier this year, we’re not Archie Bunker — that’s our dads. We’re Meathead. We’ve lived with the freedoms of Roe v. Wade and the protections of the Clean Air Act, and it’s been disconcerting to watch the Supreme Court strip them away.\nTo the extent that we are “conservative,” clean air and reproductive rights are among the things we want to conserve. Older voters are second only to the youngest cohort in their share of “climate voters,” in part because we’ve lived long enough to know how drastically the climate has changed. Eighty-six percent of older Americans think abortion should be legal at least under certain circumstances — in part because we’re old enough to remember coathangers. As for democracy — well, Jan. 6 may have hit us particularly hard, because we’ve lived through 15 or 20 elections, and had come to take the peaceful transfer of power entirely for granted.\nBut it’s not just the issues. To us, Trump seems … not normal. Even those our age who support him tend to say things like, “I like his policies, but I wish he’d shut up.” That’s because if our politics may have been formed by the liberations of the 1960s and 1970s, our attitudes probably go back deeper than that. Remember — we were born under Truman and Eisenhower.\nConsider, for instance, Trump’s endless insistence that everything is rigged against him. (He once claimed he would have won a Nobel Peace Prize “for a lot of things, if they give it out fairly, which they don’t.”) We may have thought our fathers too stoic and may be glad that our children are more in touch with their feelings, but we look askance at adults who consider themselves victims (perhaps especially if they’re also billionaires, by the grace of their parents).\nOr think about Trump’s disrespect for veterans. Yes, we were in the antiwar generation, but our parents fought in World War II and Korea, and even if we ended up with varying ideas about war and foreign policy, we still find it jarring to hear that Trump declined to visit a military cemetery because it was raining, or said he doesn’t want wounded veterans near him in parades because they make him look bad. We all knew people who fought in Vietnam, the last conflict fought by draftees. Someone like Tim Walz — football coach, National Guardsman — is a familiar figure for us, even though he’s barely 60.\nI’m not saying that older Americans will definitely vote for Harris and Walz. Trump clearly expects we won’t — and that the thought of a Black woman in the White House will be too unsettling. And truthfully, the Democrats aren’t doing much outreach to older voters — back when it was still the Biden campaign, they launched their senior outreach with “events like bingo and pickleball,” which may not be reading the room quite right. (Think more like Carole King, who played at the “Swifties for Kamala” call.) But there are signs — even in outposts like the Villages in Florida, where golf cart parades for Harris as well as Trump now snake through the sleepy streets. Don’t sleep on the elders. It’s starting to look like a lot of us may back the Democrats — if so, that silver wave could turn very blue.\nBill McKibben is the founder of Third Act, which organizes people over the age of 60 for action on climate and democracy. He’s also the Schumann Distinguished Scholar at Middlebury College.\nMore from Rolling Stone\nBest of Rolling Stone\nSign up for Rollingstone's Newsletter. For the latest news, follow us on Facebook, Twitter, and Instagram.",
  "word_count": 1334,
  "scraped_at": "2026-02-14T13:15:01.247991"
}