{
  "article_id": "e6862cc80bde",
  "url": "https://www.wtae.com/article/pennsylvania-saint-francis-university-division-iii/64324556",
  "title": "Saint Francis University athletes react to Division III move",
  "date": "20250329T033000Z",
  "domain": "wtae.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Saint Francis University student-athletes left shocked following announcement that school will drop divisions\nSaint Francis moving from Division I to Division III; Red Flash athletes from Pittsburgh area react\nSaint Francis moving from Division I to Division III; Red Flash athletes from Pittsburgh area react\nSaint Francis moving from Division I to Division III; Red Flash athletes from Pittsburgh area react\nSaint Francis University announced this week that the school is moving from Division I to Division III. The announcement shocked hundreds of student-athletes across 22 sports.\nMany of the Red Flash athletes are from the Pittsburgh area, including junior Paige Drake on the women's track and field team and freshman quarterback Payton Wehner in football.\n\"It definitely took a toll on all of us. We were very shocked and confused, and it took a while for us to even comprehend what was going on,\" Drake said.\n\"It was just frustration, and I think just because of how hard we worked through the fall, the winter, now in the spring, and just hearing this now, I think it was definitely frustrating,\" Wehner said.\nWehner's father said he was blindsided by the news.\n\"As a parent, I couldn't believe it,\" Jim Wehner said. \"You get a call from your kid who made all these things of working out all summer and getting ready for Division I football, and then it's down the tubes now. He's scrambling to find out what he wants to do.\"\nThe university's president, the Rev. Malachi Van Tassell, said it was a move Saint Francis had to make, with things like NIL and the transfer portal making it hard to compete.\n\"To run a high-quality Division I program that we've been doing for decades is not getting any cheaper or easier. So, really, we wanted to get out in front of things, control our own destiny,\" Van Tassell said.\nThe board voted on making the move in mid-March and announced it on Tuesday.\nAs for why they chose to wait, Van Tassell said they wanted to make sure it was 100% going to happen, but the NCAA Tournament also played a role, as the Red Flash made the tournament for the first time since 1991.\n\"We didn't want news like this to rain on their parade. We wanted to go and cheer on men's basketball, celebrate with them,\" Van Tassell said. \"But I also knew that we had to get this message to coaches and athletes as soon as possible because they're going to make have to make some hard decisions based on a path that we've decided to go on.\"\nStudents who are currently on athletic scholarship can remain on scholarship until 2028 if they choose to stay.\nThe university will be in Division I until the fall of 2026 and achieve full Division III membership status in 2029.\nIf student-athletes choose to go to the transfer portal, they will not lose their roster spot or their aid if they choose to come back.\n\"We love D-I. It's been a great part of our history. But D-I changed around us, and we're trying to preserve a wholesome student-athlete experience,\" Van Tassell said.\nVan Tassell said they are now setting their sights on being a premier Division III program.\nHowever, Wehner believes that is easier said than done.\n\"I'm not saying they won't be dominant. I'm just saying that it seems to me that a lot of people don't really want to stick around, especially how this went down. So, I'm not saying Saint Francis can't be, but I'm really not sure, in years to come, how this university will look,\" Wehner said.\nDrake said she is more concerned about her younger teammates.\n\"It wasn't what they signed up for, so it breaks my heart for them that they just are in such a hard decision. They're almost, like, back in their senior year, junior year of high school, trying to figure out what to do,\" Drake said.\nVan Tassell said they are doing everything they can to make sure no one is left high and dry, and to encourage students to make the best decision for themselves.\n\"This came from the institution. The athletics department didn't even know about it. The coaches were just as surprised as the students were. So this is us, and we're trying to do right for our students because they're in a scenario that they never, ever anticipated.\" Van Tassell said. \"My message to the student-athletes — because, again, they're still in shock and they're reeling from this, and they're all here because we're a D-I school. My message to them is we're here for you. This is shocking. This is not what you signed up for. But please take a moment, and take the time you need to make a good decision.\"\nFor student-athletes like Wehner, he is using the news as motivation to make their last year in Division I count.\n\"We want to make the most of our opportunity this year, and we're trying to just get better each and every day and just try and make a run for the championship in our last year,\" Wehner said.\nUniversity leaders said they are planning to release a detailed plan on this transition process and are expected to work with coaches and the community as they enter this new chapter.",
  "word_count": 891,
  "scraped_at": "2026-02-14T13:18:31.031129"
}