{
  "article_id": "e68fae1e5c67",
  "url": "https://www.hrw.org/news/2025/03/25/fifa-recognize-support-afghan-womens-team-exile",
  "title": "FIFA : Recognize , Support Afghan Women Team in Exile",
  "date": "20250325T134500Z",
  "domain": "hrw.org",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "(Amsterdam) – The Fédération Internationale de Football Association (FIFA) should act to stop the ongoing discrimination against Afghan women footballers living in exile and facilitate their return to international competition, the Sport & Rights Alliance said in a report released today.\nIn two days, the Afghanistan Women’s National Football Team (AWNT) will be absent from the 2026 AFC Women’s Asian Cup Qualifiers draw, which feeds into qualification for the 2027 Women’s World Cup; marking the second World Cup-qualifying cycle from which the team has been excluded since the Taliban takeover of Afghanistan in 2021.\n“Though the Afghanistan Women’s National Team escaped the Taliban in 2021, the shadow of systematic gender discrimination continues to follow them across borders, denying them their rightful place on the international stage,” said Samira Hamidi, South Asia campaigner at Amnesty International. “Amnesty, along with the United Nations, Human Rights Watch and other civil society organizations, has called for the Taliban’s gender persecution to be investigated as crimes against humanity.”\nThe new Sport & Rights Alliance report, titled “‘It’s not just a game. It’s part of who I am’: Afghan Women Footballers’ Fight for the Right to Play,” details how the Afghan women’s team, a symbol of women’s empowerment in post-Taliban Afghanistan, was specifically targeted for reprisals when the Taliban returned to power in 2021. The report documents that dozens of Afghan women footballers who were evacuated to countries including Australia, Portugal, Albania, the United Kingdom, and the United States remain eager and ready to represent Afghanistan in international competition.\n“Right now, the game is at halftime, and the Taliban think they are winning,” said Khalida Popal, founder of the AWNT and Girl Power Organization. “If FIFA would change its rules and let us play, we could show the world that Afghan women and girls belong in sport, in school and everywhere in society – and we will not be defeated.”\nFIFA regulations currently require the team to receive recognition from the Taliban-controlled Afghanistan Football Federation, which will not recognize a women’s football team due to the Taliban’s ban on women’s sports. For more than three years, the Afghan women’s team players and their supporters have campaigned for FIFA to intervene and provide them with the official recognition and financial support denied to them by Afghanistan.\nIn response to a letter from the Sport & Rights Alliance requesting comment on the report, FIFA shared on 21 March that a plan has been developed to provide football opportunities for Afghan women both within and outside the country, but did not say whether they intend to officially recognize the AWNT or how specific funding would be allocated.\n“The Afghanistan Women’s National Team has shown remarkable resilience since its establishment – even in the face of harassment, abuse and death threats, and being forced to leave their homes and build new lives in cities all over the world,” said Joanna Maranhão, network coordinator for the Sport & Rights Alliance’s Athletes Network for Safer Sports. “Restoring the AWNT’s ability to access training facilities and resources to play and represent their country would be an important form of remedy, as required under international human rights law.\nThe FIFA Statutes and Human Rights Policy prohibit discrimination of any kind, including gender discrimination, and commits the global sport governing body to promoting women’s football. The FIFA Statutes mandate that all member associations comply with the organization’s regulations, including the obligation to prevent and oppose discrimination and to promote women’s football. Member associations may face sanctions for any violations of these obligations.\n“Afghan women footballers’ ability to play internationally depends entirely on intervention from FIFA,” said Andrea Florence, executive director of the Sport & Rights Alliance. “FIFA’s letter in response to our report laid out their strategy to support Afghan women. It is great to hear that FIFA is working to promote playing opportunities for the players, but we remain hopeful that they will decide to officially recognize the team and allocate financial support as it does to other member associations.”\nThe Sport & Rights Alliance also said that FIFA should provide financial support for the women’s team to train and participate in international competitions, as it does with other member associations. Through the FIFA Forward Development Programme for instance, each of FIFA’s 211 member associations are currently entitled to up to US$9.2 million over a four-year period.\nThe Afghan team’s campaign has garnered global attention and support over the last three years, including from Nobel Peace Prize laureate Malala Yousafzai and nearly 200,000 people who have signed a Change.org petition urging FIFA to recognize the team in exile.\n“For these athletes, football is not only their passion but a fundamental act of resistance against the Taliban – an act of solidarity with their sisters still living in Afghanistan,” said Fereshta Abbasi, Asia researcher at Human Rights Watch. “FIFA’s recognition of and support for the team would be a powerful statement that Afghan women’s rights cannot be erased.”\nThe International Olympic Committee (IOC) did recognize an Afghan Olympic Committee in exile for the 2024 Paris Olympics, enabling Afghan women athletes to compete despite Taliban restrictions. Several United Nations experts called this move from the IOC a “welcome start,” but called on international and national sports bodies to do more to push back against the Taliban’s oppressive policies and “support female Afghan athletes wherever they are.”",
  "word_count": 890,
  "scraped_at": "2026-02-14T12:34:44.005222"
}