{
  "article_id": "e6952c6b20f0",
  "url": "https://www.newfoodmagazine.com/article/190963/perfectted-pitches-a-new-kind-of-caffeine-kick/",
  "title": "PerfectTed pitches a new kind of caffeine kick",
  "date": "20230331T143000Z",
  "domain": "newfoodmagazine.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "PerfectTed pitches a new kind of caffeine kick\nPosted: 31 March 2023 | Grace Galler | No comments yet\nTeddie Levenfiche speaks to Grace Galler about why he thinks matcha is a “superior source of caffeine” and how PerfectTed has taken the UK by storm since featuring on Dragons’ Den.\nAfter appearing on the BBC’s hit show Dragons’ Den and receiving a clean sweep of offers from all investors, matcha energy drink company PerfectTed had a difficult decision to make. Which dragon could help catapult their brand onto supermarket shelves across the UK?\nNew Food had a few questions of its own when it came to the thought process behind creating the brand. What gap in the market does it fill? Why switch to matcha instead of sticking with coffee or other well-established energy drinks? And what really goes on behind the scenes when pitching a new beverage to five ruthless investors?\nTaking on the roll of a dragon, Grace Galler spoke to Teddie Levenfiche, Co-Founder of PerfectTed, asking for an updated business pitch to see how far the brand has come since filming the popular TV show back in 2022.\nQ: What is the story behind PerfectTed?\nTeddie Levenfiche (TL): PerfectTed is the brand on a mission to spread positive energy. We’re also the brand behind Europe’s first matcha powered energy drinks.\nMy Co-Founder Marissa Poster suffered from ADHD and anxiety growing up and found that coffee and energy drinks really exacerbated those symptoms. But when she switched to matcha, she found that it gave her longer lasting energy without the jitters, crashes or anxiety and it didn’t worsen her symptoms.\nShe got me hooked. We quickly realised that it was a superior source of caffeine that allowed us to access other amazing benefits like antioxidants and vitamins. When we launched, we were living in the US, Marissa was in New York and I was in LA where matcha was massive. We moved back to the UK and saw a massive opportunity to support people by providing them with a source of caffeine that we were using ourselves.\nWhat makes PerfectTed different from other matcha drinks?\nTL: PerfectTed is a matcha energy drink. The way we think about the energy category is in three waves. The first wave was coined by the likes of Red Bull and Monster and they focus on providing energy at any cost. The second wave was natural energy drinks that focus on providing the same type of energy, but through natural ingredients.\nPerfectTed represents the third wave. Consumers now take natural ingredients as a given, so we are focussing on how we can give them a better energy boost – that means a longer lasting type of energy that doesn’t give them the crashes or the negative side effects that other energy drinks do.\nMatcha is primarily grown in Japan, so how do you source your ingredients to ensure authenticity?\nTL: We partner directly with farms in Japan so we’ve cut out all the middlemen. We can control the sustainability and quality and we put it in the most accessible format possible: a can.\nPeople love matcha, but often the faff of preparing it can prevent that consumption. What we’ve done is eliminate that barrier and allow people to easily access the drink by literally just popping a can open.\nHow accessible is PerfectTed to UK consumers in 2023?\nTL: You’re always within half a mile of a Perfect Ted, probably less. We’re in 1200 Tesco stores, we’re also in Planet Organic, Holland and Barratt, Marks & Spencer, and at sushi counters.\nOne of the early footholds we got into the market was through supplying offices such as Facebook, Google, LinkedIn and Amazon. Companies were actually coming to us saying “Hey, we’re currently feeding out employees with unhealthy energy that is giving them an afternoon crash. We want to keep them as productive as possible. Can we stock your products?” That’s how it took off.\nWho is your target market?\nTL: Everyone. Energy is the number one reason that consumers buy food and beverage products, followed by immunity. We satisfy both customer needs.\nAnyone that is currently consuming caffeine or can’t consume caffeine because it worsens their symptoms is our target customer – and this is the majority of the population.\nWhy drink a can of PerfectTed instead of a cup of coffee?\nTL: Looking at energy, there is an amino acid in matcha called altheine, which regulates the absorption of caffeine into the body. When you drink a cup of coffee, the caffeine hits you at one moment so you will have a spike of energy over one to two hours.\nSince matcha contains a combination of caffeine and altheine, it means the caffeine is absorbed in your body over a 46 hour period. This means that you can feel caffeinated for longer but you also don’t have the immediate spike. It’s a much smoother caffeination. You’ll never get jittery and you won’t get the anxiety that is associated with drinking coffee. Our can has the same amount of caffeine in terms of milligrams (80 milligrams) as a Red Bull or a small cup of coffee, but it will last you for twice as long.\nDo you think PerfectTed will alter the stigma behind energy drinks?\nTL: A lot of people don’t drink energy drinks. Some women don’t resonate with hyper-masculine energy drink brands such as Red Bull and Monster. Equally, some working professionals don’t want to crash in the afternoon after having these drinks at their work desk. There’s a negative connotation with them.\nThere’s also millennials like myself that would never touch an energy drink because they’re too health conscious. We are reimagining what an energy drink might look like.\nWhat was it like pitching PerfectTed on Dragons’ Den?\nTL: It was the biggest risk we ever took for the business. As it is on national television, we have no idea how it is being edited or what the response will be from the Dragons.\nTaste is subjective – we could have had five to seven million people tuning in to see a product get annihilated on national TV! Fortunately though, it went well. Super well. It was a very emotional experience for me. You’ll see me in the elevator on the show boxing the air – that was me trying to hype myself up!\nWe could not have prepared for how amazing the reaction was going to be post Dragons’ Den. I really believe in our mission and the team. Building a food and beverage brand incredibly quickly is very challenging but I believe we have a team in place that will be able to execute that.\nI think we have shown that PerfectTed is a mainstream beverage. There are so many amazing people in the food and beverage industry that inspired and encouraged us, they really paved the way for us to be able to do what we are doing.\nHow does having Steven Bartlett on board help you as a beverage company?\nTL: Steven Bartlett is the most incredible person. Part of the reason we got through the first six months of starting the business was because of his podcast “The Diary Of A CEO”. The guests that he brought on and the inspiring advice and encouragement he offered gave us that push.\nWe now work very closely with his team and they are incredibly talented. There are experts across social media, marketing, PR and business that we are able to leverage. Also, having Steven as an ambassador for the brand and as a mentor for us is incredible.\nWhat are your plans for taking PerfectTed global?\nTL: We are going to become the largest matcha brand in the world and we want to become the largest natural energy player in Europe. Those are our two main goals.\nOur mission overall is to spread positive energy. Ultimately the product is trying to invoke a positive emotion through energy with reduced anxiety, improved focus, productivity.\nWe are a team of people under the age of 30 that are crazy enough to believe that they can reimagine the energy drink sector and create a category within matcha to help people feel their best selves.\nBiography\nRelated topics\nBeverages, Health & Nutrition, Product Development, Research & development, retail, Supermarket, The consumer, Trade & Economy",
  "word_count": 1393,
  "scraped_at": "2026-02-14T12:24:49.700133"
}