{
  "article_id": "e6b0a61e2e6e",
  "url": "https://www.fourfourtwo.com/news/why-england-can-win-the-womens-world-cup-2023-despite-missing-key-players",
  "title": "Why England CAN win the Women World Cup 2023 - despite missing key players",
  "date": "20230719T210000Z",
  "domain": "fourfourtwo.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Why England CAN win the Women's World Cup 2023 - despite missing key players\nEngland might have some big names missing as they head to the Women's World Cup 2023, but that shouldn't stop them from dreaming\nThe best features, fun and footballing quizzes, straight to your inbox every week.\nYou are now subscribed\nYour newsletter sign-up was successful\nWant to add more newsletters?\nFive times a week\nFourFourTwo Daily\nFantastic football content straight to your inbox! From the latest transfer news, quizzes, videos, features and interviews with the biggest names in the game, plus lots more.\nOnce a week\n...And it’s LIVE!\nSign up to our FREE live football newsletter, tracking all of the biggest games available to watch on the device of your choice. Never miss a kick-off!\nJoin the club\nGet full access to premium articles, exclusive features and a growing list of member rewards.\nEngland kick off their Women's World Cup 2023 campaign on Saturday vs Haiti.\nBut with stars like Beth Mead, Leah Williamson and Fran Kirby all out through injury, the Lionesses have lost their tag as favourites for World Cup 2023. The pesky USA are instead the nation expected to lift the trophy come the final in Sydney on August 20.\nEngland women's team can still do it, though, at least that's according to FourFourTwo's Adam Clery, who describes his reasoning in the video above.\nWhy England can win the Women's World Cup 2023\nDespite missing five of the starting line-up that won the Euros last summer (Ellen White has retired, the aforementioned trio of Mead, Williamson and Kirby are injured and Rachel Daly proved she's more of a striker than a left-back by becoming the WSL top-scorer last season) not to mention the fact Millie Bright has been injured for the past couple of months, there are still plenty of solutions available to England.\nAlessia Russo, Ella Toone, Chloe Kelly and Lauren James are all fighting to come into the team, with Daly also in contention for a starting berth upfront.\nAlex Greenwood is also more than capable of performing to a high standard slotting in in central defence for England at the World Cup, with Jess Carter and Niamh Charles strong options at left-back.\n\"It's very easy to label England as being in the midst of several player crises, but they are one of the few teams in the world - probably the only team in the world - who could cope with multiple, concurrent crises,\" Clery suggests.\nThe best features, fun and footballing quizzes, straight to your inbox every week.\n\"And if that can't get you excited about an international football tournament, I don't know what will.\"\nIndeed, the two players who scored for England in their Euro 2022 final win against Germany (Kelly and Toone) aren't even guaranteed to start in Australia and New Zealand, highlighting the strength in depth and why England are certainly more than capable of going all the way once again.\nMore England stories ahead of the Women's World Cup 2023\nManager Sarina Wiegman implemented some bonding methods for the England team that proved pivotal in the Lionesses' Euro 2022 success.\nGeorgia Stanway acknowledges that the Lionesses are a different animal compared to last year, suggesting \"the dynamic has changed but we’re still an unbelievable squad\".\nMeanwhile, FFT columnist Jules Breach says that England can still win the World Cup, despite the loss of experience in the side.\nWe've also compiled everything you need to know ahead of the World Cup in a special tournament hub.\nRyan is a staff writer for FourFourTwo, joining the team full-time in October 2022. He first joined Future in December 2020, working across FourFourTwo, Golf Monthly, Rugby World and Advnture's websites, before eventually earning himself a position with FourFourTwo permanently. After graduating from Cardiff University with a degree in Journalism and Communications, Ryan earned a NCTJ qualification to further develop as a writer while a Trainee News Writer at Future.",
  "word_count": 661,
  "scraped_at": "2026-02-14T13:27:14.936207"
}