{
  "article_id": "e6b5c420ad44",
  "url": "https://www.kyivpost.com/post/33676",
  "title": "Sport Gives Maimed Ukrainian Veterans  New Goal , Says Shevchenko",
  "date": "20240603T061500Z",
  "domain": "kyivpost.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Sport has given Ukrainian veterans maimed in the war with Russia \"new dreams and goals to aspire to\", Ukraine football legend Andriy Shevchenko told AFP.\nSome of those veterans are in the Ukrainian squad currently taking part in the Euro 2024 football amputee championship in France.\nJOIN US ON TELEGRAM\nFollow our coverage of the war on the @Kyivpost_official.\nShevchenko, the 2004 Ballon D'Or winner and the son of a \"military man\", is president of the Ukrainian Football Association (UFA) and devised the project to aid amputee veterans in June last year.\nShevchenko, 47, says Ukrainians owe a huge debt to the veterans, who have fought at great cost to defy the might of the Russian army since Russian President Vladimir Putin launched the invasion in February 2022.\n\"Sport allows them to feel alive even during difficult times,\" Shevchenko told AFP via email.\n\"Sport is a powerful instrument of the physical and psychological recovery of veterans, and also gives them new dreams and goals to aspire to.\n\"Veterans are the reason we are all alive today and have the opportunity to continue developing Ukrainian football.\"\nThe former Dynamo Kyiv, AC Milan and Chelsea striker says there are around \"70,000 amputees\" presently in Ukraine and \"the majority are war veterans\".\n\"UFA has established one of its strategic goals to help them to return to active life through football.\n\"We are currently putting together a roadmap of the project for the next five years on the development of amputee football across the country.\"\nUkrainian Priest’s Daughter Sentenced to 15 Years for Spying for Russia’s FSB\nThere are currently teams in Lviv, Cherkasy and two in Kyiv, including Shakhtar Donetsk.\nFor the moment all eyes are on the amputee squad -- which has \"four to five\" veterans -- competing in the Euro 2024 championships and who began their campaign with a 1-0 defeat against hosts France in Evian-les-Bains on Saturday.\nThe veterans are a huge inspiration for the civilian amputees in the squad, head coach Dmytro Rzhondovskyi told AFP.\nEqually, though, Rzhondovskyi says the civilian players have their own role to play in helping the traumatised veterans.\n\"The civilian players take pride in playing with the wounded veterans,\" Rzhondovskyi told AFP by phone from Kyiv before the tournament.\n\"For them it is unbelievable. (The civilians) say 'they are our heroes, our heroes are our soldiers'.\n\"It's so unbelievable for the civilian players.\n\"However, they must as well help our soldiers, to get back and adapt to this life.\"\n- 'Traumatic injuries' -\nRzhondovskyi concedes Ukraine are in a tough group for the nine-day tournament in which the matches last 50 minutes with six outfield players and a goalkeeper, who must be missing an arm, plus six substitutes.\nHowever, morale has been boosted by Oleksandr Usyk's world heavyweight title win over Tyson Fury a fortnight ago.\n\"Usyk is our spirit, he is Ukraine's spirit, our power and we are so proud of Oleksandr,\" said Rzhondovskyi, who used to play football with Usyk when they were youngsters.\n\"His was a very important victory for our country.\"\nRzhondovskyi, who also coaches the women's amputees team, knows what it takes to win a title.\nThe former Dynamo Kyiv academy player won Mundiavocat, the World Cup for lawyers, in Barcelona in 2018, scoring in the semi-final and final.\nThe 35-year-old, born in Prague as the son of a Ukrainian soldier, says he has not fought in the war yet, so this is his way of contributing to his country's efforts.\n\"They are heroes, I am not a soldier but for me I am a Ukrainian man helping female and male soldiers to adapt back to life after their traumatic injuries,\" he said.\n\"For me I am honoured to know these people.\"\nRzhondovskyi, who along with a pub-owning friend prepared meals for soldiers earlier in the war, said he is passionate about his job.\nHe is also due to oversee the women's amputee team in the World Cup in Baranquilla, Colombia, on November 2-11.\nHowever, he is unsure whether he will get there.\n\"It is very important for me the project because at the moment I am not there in a war, I am in Kyiv...but I do not know where I will be tomorrow,\" he said.\n\"It is a difficult situation as maybe I will be needed to go to war.\n\"It is our home, not Russia's home, and we want to live in peace in Ukraine our land.\"\nYou can also highlight the text and press Ctrl + Enter",
  "word_count": 752,
  "scraped_at": "2026-02-14T12:52:21.501880"
}