{
  "article_id": "e6d7fd4eea10",
  "url": "https://www.mercurynews.com/2025/04/18/opinion-50-years-anniversay-saigon-fallwe-gained-the-world-but-lost-our-homeland/",
  "title": "Opinion : 50 years after Saigon fell -- gaining the world , losing our homeland",
  "date": "20250418T190000Z",
  "domain": "mercurynews.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "We lost our homeland half a century ago, and in the process, gained the world.\nIn the waning days of April 1975, the U.S. Armed Forces Radio in Vietnam kept playing “White Christmas” though the temperature was hot and muggy. We didn’t know it at the time, but it was code for evacuation of American personnel and some Vietnamese officials. Saigon fell to communist forces on April 30 and one of America’s longest wars was over.\nThe communist victors changed the beloved name of Saigon to Ho Chi Minh City, and exacted revenge on the South. They sent former South Vietnamese government and military officials to brutal “reeducation camps,” designed to starve their bodies, and worse, stamp out their spirits. They forced people from their homes to harsh “New Economic Zones,” undeveloped jungles that one journalist described as “a prefabricated hell and a place one comes to only if the alternative to it would be death.” Washington imposed an economic embargo on Vietnam that lasted until 1994.\nThe reunification of the country in 1976 prompted another separation as thousands fled. Overnight, we became wanderers deprived of land and home, purged of our identity and essence.\nThough some were airlifted by the United States to refugee camps in the Philippines and Guam, most of us left in rickety fishing boats. A small 40-foot craft could often pack up to 150 people, stacked on top of each other inside the cargo hold designed to store fish. The putrid stench caused many to vomit. The rich sat on deck while the poor were squeezed in the hold below, with no place to relieve themselves, so excrement, vomit, and other wastes flowed down into the lower areas. To avoid detection, a wooden cover sealed the hold, cutting off air circulation. As the days passed, the smells intensified, and some died from suffocation.\nHunger was harsh, thirst was worse. Only two sips of water were given each day, enough to moisten the lips and coat one’s mouth. Every attempt to swallow was an assault on the throat, like sandpaper over an open wound.\nMany boats sank from overcrowding, bad weather, engine troubles and piracy. The United Nations High Commissioner for Refugees estimated that more than 200,000 Vietnamese drowned by the summer of 1979. The fortunate ones made it to international waters, positioning themselves in the shipping lanes, hoping a ship would rescue them.\nTreacherous seas\nThe danger was being spotted by pirates first. A common escape route from South Vietnam was to head due west toward Thailand, a journey that typically took two days, in contrast to five to Malaysia and seven to the Philippines. Between 1978 and the early 1990s, the Gulf of Thailand was notorious for piracy. Robbery, rape, kidnapping and murder were frequent. Many boats faced multiple attacks. When there was nothing left to rob, the pirates often resorted to killing. This was the harsh reality of the journey seeking freedom.\nStill, people left because the option of staying behind was worse, far worse. And so, the boat people exodus continued, filling makeshift refugee camps in Hong Kong, Thailand, Malaysia, Indonesia, Singapore and the Philippines.\nCamps like Galang in Indonesia lacked electricity and indoor plumbing. The bathroom was an outhouse, the kitchen an open-air communal space. Food was scarce, basic hygiene was a challenge, and tropical bugs feasted on our bodies. Every night, under a mosquito net in a space of a king-sized bed, we snuggled, feeling safe for the first time in years. The international volunteer workers all carried candies and chewing gum, a fact the children discovered almost instantaneously. “Candy please” became one of the first English phrases they learned.\nLife was monotonous for the adults. The days dragged on in uncertainty. We could not leave the camp, so earning a living was difficult. The camp’s main street intersection — Tự Do (Freedom) and Nhân Đạo (Humanity) — spoke of our aspirations and hope.\nAs people were fleeing Vietnam, President Gerald Ford signed legislation in 1975 that allowed the refugees special status to enter and resettle in the United States. In 1978, President Jimmy Carter ordered American ships to rescue refugees from boats escaping Vietnam.\nMany came first to places like Camp Pendleton and Fort Chaffee before resettling in various corners of the United States with the help of church groups and individual sponsors.\nOne such sponsor was actress Tippi Hedren, who asked her personal manicurist to teach the first 20 Vietnamese women how to do nails. Today, more than 50% of nail salons in the United States are run by Vietnamese.\nNational Youth Poet Laureate Alexandra Huynh wrote a paean to the business in “The Nail Shop”:\n“I once asked my mother why so many Vietnamese women became nail technicians and she told me, ‘It’s because we are a hard-working people. detailed people. who know how to make things beautiful’ and I wanted to tell her, ‘Yes, but we are also a shipwrecked people. A people who learn how to take shelter and weather the storm even after the sun had come out.’ I can never forget this instinct. Plastered firmly onto my soul and sealed by the kind of glue that holds entire generations together. My hands, too, will become callused. Veins branching along my skin like the waterways of my mother country. I, too, will learn to build temples. Beautiful, detailed, rhinestone temples.”\nThe Vietnamese arrival coincided with the birth of the computer age. We migrated to warm-weather states like Texas and California, where tech companies were thriving, and worked entry-level jobs like assemblers and technicians. We moved into downtrodden areas like the Tenderloin in San Francisco and raised families and built small businesses and helped revitalize the neighborhood. We turned strawberry fields in Orange County into Little Saigon.\nIn San Jose, we converted shuttered storefronts downtown into small mom-and-pop grocery stores, hair salons and restaurants. The first Lee’s Sandwiches began on East Santa Clara and Sixth streets. Saigon Moi, the first Vietnamese market in San Jose, was opened nearby across the street from the current City Hall by the parents of Viet Thanh Nguyen, who later won a Pulitzer for his novel “The Sympathizer.” Redevelopment later forced most of us out of downtown and we reestablished yet again in East San Jose in strip malls like Lion Plaza and Grand Century.\nA new homeland\nWhile the parents worked, the children went to school to become doctors and engineers and lawyers, to refine the script that is the American Dream. Pho, banh mi and sriracha became a part of the American food lexicon. We assimilated to the American landscape. We became writers and poets (Nguyen Qui Duc, Andrew Lam, Alexandra Huynh, Brian Le), won Pulitzer Prizes (Nick Ut, Viet Thanh Nguyen), played NFL football (Dat Nguyen) and Major League baseball (Danny Graves, Tony Pham) and became generals (Luong Xuan Viet, Nguyen Tu Huan). Some of us even literally reach for the stars (astronaut Amanda Nguyen).\nThe world has changed since 1975. The Soviet Union dissolved. China became a superpower. Vietnam is a rising economic dragon and one of the United States’ major trading partners. Many Vietnamese overseas now come back to their homeland for a visit. Some even returned to stay.\nMore than 2.3 million Vietnamese now live in the United States, a part of its fabric. We have had a chance for freedom, for education, for boundless opportunities. We have had a chance to visit Paris and Rome and the Greek islands, to watch our children flourish in America. We are grateful for the countless people who helped us succeed. And yet, in our quieter moments, we remember the young soldiers who perished in war and reeducation camps, the people who died at sea, the loved ones left behind, and those who weren’t fortunate to have had our opportunities in the free world.\nWe have gained the world, but the loss of our homeland 50 years ago and its manifest wound and pain remain inconsolable.\nDe Tran, a former Mercury News staff writer, came to the United States in May 1975. He was publisher and editor of Viet Mercury, a Vietnamese-language newspaper published by the Mercury. He also worked for the Los Angeles Times and Newsweek magazine.\nLauren Vuong fled Vietnam by boat and came to the United States at age 8 with her family. She attended UC Berkeley where she earned a bachelor’s degree in English literature. She earned her Juris Doctorate from the University of San Francisco and remains a practicing attorney. Vuong produced and wrote the award-winning documentary “Finding the Virgo,” an account of her family’s search for the crew of the ship that rescued them after their escape from Vietnam in 1980.\nCommemoration event\n“50 Years of Remembrance and Renewal,” a commemoration of the fall of Saigon, will take place from 1-3 p.m. April 27 at the Santa Clara County Building, 70 W. Hedding St., San Jose. The event, organized by Immigrant Resettlement and Cultural Center and the Viet Museum, will include music and a book and poetry reading as well as an art, poetry and photo exhibit. Free admission.",
  "word_count": 1518,
  "scraped_at": "2026-02-14T13:21:20.703653"
}