{
  "article_id": "e6d8e52972aa",
  "url": "https://wwd.com/fashion-news/fashion-scoops/ralph-celebrates-miami-federer-sees-eye-to-eye-gabriela-hearsts-handbag-shop-1235632812/",
  "title": "Ralph Miami Party , Federer Eyewear Deal , Hearst Handbag Shop – WWD",
  "date": "20230428T074500Z",
  "domain": "wwd.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "CELEBRATING IN MIAMI: Ralph Lauren toasted its new Miami Design District concept store with a cocktail party at a private waterfront residence in North Miami on Wednesday night. The brand brought its luxury “coastal living” aesthetic to the estate, outfitting poolside wicker lounge chairs with “RL” embroidered pillows and towels from Ralph Lauren Home.\nGuests included Melissa Barrera, Joan Smalls, Lily Aldridge, Noah Beck, Diana Silvers, Claire Holt and Camila Coelho. The evening also featured a performance by “In the Heights” star Leslie Grace.\nThe Design District store, which opened several weeks ago, offers the men’s Purple Label and women’s Collection, along with handbags and accessories exclusive to the Design District. In a nod to Miami’s status as the “crypto capital,” the boutique partnered with Web3 platform Poolsuite, and accepts cryptocurrency as payment through a partnership with BitPay. — KRISTEN TAUER\nYou May Also Like\nEYE TO EYE: Fans of retired tennis star Roger Federer won’t see him on the courts as much, but he’s increasingly visible in the fashion field.\nThe athlete, who is a friend of Vogue editor in chief Anna Wintour, is one of the 2023 Met Gala co-chairs. Meanwhile, eyewear giant EssilorLuxottica announced on Thursday it had inked an exclusive global license deal with Federer for the design, manufacturing and global distribution between his brand and the Oliver Peoples label. The duration of the agreement was not disclosed.\nIn a statement, Federer said he’d been a fan of Oliver Peoples for years and found “great commonality” in how both parties approach their respective fields.\nThe first designs are expected to be released in spring 2024 and will draw their inspiration “from their shared dedication to excellence in one’s craft and appreciation for understated luxury.”\nEssilorLuxottica chairman and chief executive officer Francesco Milleri deemed him “a legendary athlete, a passionate entrepreneur, and a force in the worlds of fashion and lifestyle,” calling him the “perfect partner” for the group and brand.\nFederer invested in Swiss running shoe brand On in 2019, where he has input on his own line. A long-time Rolex ambassador — he first signed on in 2006 and renewed the deal in 2016 — the tennis star has also worked with the likes of Nike, Wilson and Uniqlo.\nFor Oliver Peoples CEO Rocco Basilico, Federer’s prominence and cultural impact are “legendary and reach beyond the world of tennis.” He was the first male player to win more than 14 Grand Slams and was ranked No.1 for 310 weeks — that’s nearly six years — by the Association of Tennis Professionals. — LILY TEMPLETON\nIN THE BAG: Gabriela Hearst has opened a retail installation with Selfridges for her signature handbags that runs until June 4.\nThe space has been reimagined by the designer with several shades of camel featuring French oak display shelves, which resembles her flagships in New York and London.\n“It’s always a joy to feel that you are coming home, at Selfridges. In our second-ever installation, this time with our treasured handbags, which could only be displayed on furniture designed by my favorites Antoine Dumas and Benji Gavron,” said Hearst, who collaborated with the French sculpture and furniture designer on the custom pieces at the store.\nThe bags on display at the luxury department store include the Nina, the Demi, the Diana, the Baez and the Nostalgia.\nSelfridges is a right fit for the accessories designer, who was born in Uruguay and is based in New York because of its environmental credentials.\nSelfridges has set out a 2030 target of reaching 45 percent of its transactions to come from circular products and services by stocking products that meet its environmental and ethical standards.\nSelfridges has accelerated its net zero goal by changing its deadline to 2040 instead of 2050 as a promise to the Climate Pledge.\nIn August 2020, the British department store launched its Project Earth program to track its environmental targets and its commitment to a net zero future.\n“Our vision is to reinvent retail and create a more sustainable future, and Project Earth and our new targets underpin this. We recognize that we need to challenge ourselves to accelerate change and our ambitious circular and materials targets do just that,” said Andrew Keith, managing director at Selfridges, last year. — HIKMAT MOHAMMED\nATHLETIC PAYDAY: The spring in Lululemon Athletica Inc.’s step has been good for Calvin McDonald’s paycheck.\nThe chief executive officer saw his total compensation rise 18.1 percent to $15.7 million last year.\nMost of the pay came from stock and option awards that were valued at a total of $10 million and link the executive’s fortunes to those of shareholders. His salary tallied $1.3 million.\nBut McDonald also received incentive pay of $4.4 million — 200 percent of his target and his maximum potential bonus for the year. To hit that mark, Lululemon needed to see revenue of $7.5 billion and operating income of $1.7 billion for the year.\nWhat the active brand turned in was adjusted revenues of $8.1 billion with operating income of $1.8 billion — a big leap despite a $442.7 million charge to write down the Mirror acquisition, which fell short of expectations.\nThe pay details were included along the company’s proxy statement, which was filed with the Securities and Exchange Commission ahead of the firm’s annual meeting on June 7.\nMcDonald has a good report to give to shareholders at the meeting.\nIn March, the CEO told analysts on a conference call that in the fourth quarter: “The adult active apparel industry decreased its U.S. revenue by 5 percent compared to the same period last year. And over this time period, Lululemon gained 2.3 points of market share in the U.S., the most of any brand in this market according to NPD Group’s consumer tracking service. This is the highest quarterly market share gain we’ve achieved since we began tracking these numbers in 2020, and it caps a year in which we grew our market share every quarter. This speaks to our growth in the U.S., a key market within North America.” — EVAN CLARK\nNO INCENTIVE PAY: Executive pay slipped at American Eagle Outfitters Inc. last year as top leaders received no incentive pay, but Jay Schottenstein, executive chairman and chief executive officer, said the company successfully pivoted in a tough environment and has plenty of opportunities ahead.\n“Fiscal 2022 was another dynamic year,” said Schottenstein to shareholders in a letter filed to regulators as part of the company’s annual proxy statement.\n“Consumers were experiencing rising inflation and higher interest rates,” he said. “At the same time, we continued to navigate supply chain disruptions, which drove elevated costs and product delays.…We pivoted swiftly to adjust inventory, seek efficiencies and maximize productivity. Ultimately, this drove a meaningful improvement in operating income and free cash flow in the second half of fiscal 2022, enabling us to end the year in a healthy financial position.”\nFor the full year, the company’s revenues were down slightly at just under $5 billion while gross profits fell 12 percent to $1.7 billion and net income slipped to $125.1 million.\nThe second-half rebound, however, wasn’t enough to trigger incentive payments for top executives.\nSchottenstein saw his total pay package fall 34.3 percent to $9.8 million from $14.9 million in 2021, when the CEO received $5.9 million in incentive compensation.\nThe vast majority of the CEO’s pay last year came in the form of stock and option awards, which were valued at $7.8 million, but are dependent on the company’s stock price — tying the executive’s pay to the portfolios of shareholders.\nJennifer Foyle, president and executive creative officer for American Eagle and Aerie, saw her pay decline 38.2 percent to $5.4 million, including stock and options valued at $4 million.\nWhile the environment is still tricky, Schottenstein said the company is ready for what’s ahead.\n“Looking ahead, I see no shortage of opportunities for our company,” the CEO said. “We have been battle-tested in many ways over the past several years and have entered fiscal 2023 more agile and disciplined.” — E.C.\nSPREADING OUT: Streetwear gurus can now dream up their own collaborations with Spread, a unisex brand out of Berlin that gives customers a “creative toolbox” to personalize each garment with graphics, prints, embroideries and exclusive artworks.\nIt’s the brainchild of Lothar Reiff, who operates a namesake consulting business in Germany and is well known for having been a longtime creative director at Hugo Boss. He’s also the chief product and brand advisor at Spread Group, a Leipzig-based company specializing in customized merch.\nReiff is extending the firm into fashion and lifestyle territory with Spread’s cropped and oversized hoodies, T-shirts, sweatpants and shorts, which ooze Berlin cool. A launch event Friday night in the German capital will summon 800 select hipsters to a secret location for a dance party.\nThe initiative is targeted squarely at what Reiff calls “Genzennials,” a portmanteau of Gen Z and Millennials, generations who prize individuality and hence personalization.\nReiff ticked off other important boxes: All the products are produced in Portugal from organic cotton, and the customizations are realized in a jiffy, shipped within two or three days of the order being placed.\nAccording to Spread Group chief executive officer Julian de Grahl, the venture leverages its “proven made-to-order technology in a disruptive way,” offering young consumers what they value most: “personality and consciousness.”\nSold exclusively online at Spreadyourstyle.com, the streetwear will initially ship within Europe “and then spread out globally,” Reiff said.\nHe enlisted art director Donald Schneider to mastermind the communication plan, which involves social media content and wild postings that resemble magazine covers.\nSchneider assembled an edgy “Berlin squad” for the campaign, including actor and musician Aaron Altaras, artist Mago Dovjenko and three musicians and DJs who go by one name: Dania, Lsdxoxo and Vtss.\nUp-and-coming photographer Vitali Gelwich teamed with stylist Claudia Hofmann for the images.\nReiff said he and Spread Group executives are assembling a creative studio that will be headquartered in Berlin and turn out several new drops per year and a rotating roster of guest artists. — MILES SOCHA\nPROMISING GALA: Promise Project’s annual spring fundraiser, “Beautiful Promise,” will take place once again at the Metropolitan Pavilion at 123 West 18th Street in New York on Tuesday from 6:30 to 8:30 p.m.\nLongtime emcee WABC-TV’s Bill Ritter joined this year for the first time by Christie’s deputy chairman Sheri Farber, will oversee the evening’s festivities, which include opportunities to bid on auction items that benefit Promise Project.\nSilent auction items include handbags and accessories from such designers as Louis Vuitton, The Row, Tory Burch, Jennifer Fisher and Alexis Bittar; a behind-the-scenes tour of Christie’s with a Champagne toast, and dining experiences at Union Square Cafe and Scarpetta.\nCharitybuzz will auction tickets to New York’s “Jimmy Kimmel Live,” “The Drew Barrymore Show” and “Live With Kelly and Mark,” among other lots.\n“While kids are back in school learning, marginalized students are challenged more than ever,” said Dana Buchman, founder of Promise Project. “That’s why Promise Project is so important. Not only does Promise provide free, state-of-the-art neuropsychological evaluations, when coupled with advocacy and parent support, Promise ensures students are put on a path to education they deserve.”\nPromise Project, in collaboration with Columbia University Medical Center and New York Presbyterian Hospital, is New York City’s most effective and comprehensive program committed to helping marginalized families get the support they need for children living with learning disabilities.\nTicket options, registration and further information is available at promise-project.org. — LISA LOCKWOOD\nSMART DESIGN: Valeria Peeva and Maxi Purton, students at Jimmy Choo’s JCA London Fashion Academy, have won a competition to design the staff uniform for the Saïd Business School at the University of Oxford.\nThe students took inspiration from the city’s architecture, which will be out later this year for the catering, reception and housekeeping teams.\nThe sketches from the pair of designers show a relaxed take on uniforms with relaxed trousers; cropped and sleeveless sweaters, and deconstructing the classic blazer by giving it a softer edge.\nThey picked up their prize on Thursday at the institution.\nNiamh Nowlan, another student at the academy, was presented with an award for her print design which will be used across student merchandise.\nPeeva and Purton will be given a place on the school’s Oxford Venture Series program, which includes three six- to eight-week tutor support and live lessons for new entrepreneurs. The short program usually costs 5,100 pounds.\n“I am really self-critical, and I often won’t do something unless I feel confident I can do it perfectly. But I put myself out there on this with my best friend and it has given me a real sense of confidence in my work. The biggest prize for me is that we’ll be able to come to Oxford and see our work in real life, it’s such a buzz to think people will be wearing clothes we created, for years to come,” said Purton.\n“I always wanted to get into fashion and told myself when I turned 18, I would go for it. Now I’ve turned 18 and this has happened, it’s brilliant. We’re also quite young, so I feel this award will help us to prove ourselves and our talent,” added Peeva.\nJimmy Choo, the Malaysian footwear designer, opened the doors to his JCA London Fashion Academy in 2021 on Hanover Square opposite a green park that’s within walking distance of the Condé Nast offices and London’s luxury shopping destination, Bond Street.\n“I love the fashion shops here. The student can go and see many things here,” Choo said in an interview with WWD, adding that the students’ safety comes first, hence why he’s chosen a location that’s renowned enough to put worried parents’ minds at ease when they send their children off to study.\nWhen the academy launched, it took on 30 undergraduates and five MA students from the U.K. For the second year, the academy opened applications to international students, while still intending to keep numbers under capacity by introducing short courses in September and a summer school for 13- to 17-year-olds. — H.M.\nSIGN UP: Wolverine is holding its own signing day to encourage more young people to pursue careers in skilled trades.\nThrough a continued partnership with SkillsUSA, the 140-year-old boot and clothing company is hosting its own National Signing Day on May 4 with the head football coach of the University of Michigan Wolverines, Jim Harbaugh, to speak to students and inspire them with the same work ethic he is known to instill in his players.\nHarbaugh, alongside five University of Michigan football players, will attend the annual Signing Day event at the Bay-Arenac ISD Career Center in Bay City, Michigan.\nCoach Harbaugh said in a statement that he is “proud” to be a part of this “impactful” event with the Wolverine brand to celebrate these young people in the same way that student athletes are celebrated for committing to a four-year university. “It’s important to recognize and encourage those who are pursuing careers in the skilled trades as this is a critical industry that keeps our country running,” Harbaugh said. “There’s no better place off the field for my players and me to rally around our blue-collar work ethic than at SkillsUSA Signing Day.”\n“The partnership with Wolverine and the Michigan Wolverines began because of our shared values around hard work, dedication and grit,” added Scott Schoessel, vice president of marketing at Wolverine. “Coach Harbaugh’s involvement at SkillsUSA Signing Day will amplify our partnership as his attendance will surely inspire and infuse confidence to students across the nation as they embark on their career in the skilled trades.”\nAccording to Schoessel, the event is designed to support thousands of high school students across the nation as they sign their letter of intent, committing to further their education with a trade program in residential wiring, building trades and renovations, HVAC or plumbing, and more. In 2022, more than 1,000 students in 33 states participated in Signing Day. — STEPHEN GARNER",
  "word_count": 2675,
  "scraped_at": "2026-02-14T12:02:42.834225"
}