{
  "article_id": "e6e60bb7e724",
  "url": "https://www.independent.ie/irish-news/obituary-seamus-ogrady-celebrated-academic-and-adult-education-pioneer-with-a-passion-for-gaa/a2018373232.html",
  "title": "Obituary : Séamus OGrady , celebrated academic and adult education pioneer with a passion for GAA",
  "date": "20250420T020000Z",
  "domain": "independent.ie",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Obituary: Séamus O’Grady, celebrated academic and adult education pioneer with a passion for GAA\nSéamus O’Grady, who has died aged 77, was a visionary University of Galway academic and pioneer of adult education who combined a love of sport with a passion for arts, music and people.\nA long-serving chair of Druid Theatre in Galway, he was also known as “Mr Football” in the college for decades due to his extensive involvement with university GAA as a player, trainer and referee.\nHe was born and raised in Gurteen, south Sligo, in 1948 and might never have left there if his father’s plans for him had borne fruit. The local post office became vacant in 1965, the year he sat his Leaving Certificate, and Jim O’Grady believed it would be just the job for his son.\nFortunately, he was adamant that he wanted to study at what was then University College, Galway, and so, as his son Niall noted at his funeral: “An Post missed out on that one”.\nHe took science and it was here that he met founding members of Druid Theatre, while he also sang with the college choir, Cantairí Coláiste na hOllscoile.\nHis professional life was defined by a deep commitment to education\nSuch was his concern about the lost potential of those who might have been forced to leave school early that he was employed by the university to set up extra-mural studies, which developed into adult and continuing education.\nThe extramural courses began in 1969, benefiting people in over 40 western communities, with 2,500 adult participants in the first five years alone.\nAs close friend and University of Galway professor of law Donncha O’Connell noted in a tribute in The Connacht Tribune, his leadership was “genuinely pioneering with huge emancipatory impact”.\n“Although he would disdain the corporatist but cold labels now attached to the kind of work that he did in those days, his professional life was defined by a deep commitment to education and a strong belief in scientific knowledge as a public good to be shared without discrimination,” O’Connell wrote.\nInitially living in Nun’s Island in Galway, where he was known for his hospitality to fellow students and his particular skill with spaghetti bolognese, O’Grady moved to Cruachán Park in Rahoon.\nAcross the road was a house of young women, one of whom, a teacher named Bernadette Walsh, was set a dare to invite him to a dress dance. Several years later they linked up again and married, settling in Galway and rearing two children.\nA Gaelic football enthusiast, he took up refereeing with zeal and was on the management team for the university’s four Sigerson Cup wins in the early 1980s. He was chairman of the club for over 30 years, and lifted the Sigerson Cup when the team won again in 2022.\nNiall recalled how he was refereeing a match between Annaghdown and Milltown, Co Galway, in the early 1980s when a brawl broke out.\nAfter O’Grady separated the two players and sent both off, he discovered one of them was due to play on the Sigerson Cup team a week later.\nHis match report was written with such diplomatic skill that the same player was on the college team for the crucial game.\nHis many friends and colleagues included the writer John McGahern — both men lost their mothers at a young age. Their enduring friendship ensured McGahern’s archive was secured by the university library.\nAmong his initiatives was the establishment of community development group Forum Connemara in 1989, which he initially chaired. He also helped to set up the university’s international summer school in Irish studies, along with an online diploma in the same subject, and a programme for US students.\nSéamus was a very dear friend of mine, and an ally and champion for all of us at Druid\nHis colleague Professor Louis de Paor, director of the university’s Centre for Irish Studies, said his work “continues to have a transformative impact on the lives of students who never met him”.\nWhen he received an honorary degree from his alma mater in 2019, he drew great satisfaction from witnessing members of the Travelling community receiving their diplomas on the same day.\nDuring his tenure as chair of Druid, he guided it “through a period of great ambition and success”, the company noted.\n“Séamus was a very dear friend of mine, and an ally and champion for all of us at Druid. During his many years of service, he provided us with support, wise counsel and firm leadership,” its artistic director Garry Hynes has said.\n“Séamus O’Grady lived a full and storied existence, doing what he did as if it was what he ought to do,” O’Connell said, adding that he “nurtured that capacity in others”.\nSéamus O’Grady is survived by his wife, Bernadette, children Niall and Aoife, grandson Ruairí, and extended family.",
  "word_count": 814,
  "scraped_at": "2026-02-14T12:11:47.943199"
}