{
  "article_id": "e6edabf30303",
  "url": "https://en.vietnamplus.vn/artists-athletes-exalted-at-devotion-awards-2023/250779.vnp",
  "title": "Artists , athletes exalted at Devotion Awards 2023 | Culture - Sports",
  "date": "20230331T031500Z",
  "domain": "en.vietnamplus.vn",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Among the nine categories for the music awards, whichmaintained its traditional voting by journalists covering cultural aspects, singer Hoang ThuyLinh won three, namely the awards for music video, female singer, and album of the year.\nMONO (real name Nguyen Viet Hoang, born 2000) was named as new artist of the year, while the awards for male singer, producerand musician of the year went to Tung Duong, DTAP, and Khac Hung,respectively. The song of the year was “Ben tren tang lau” composed andperformed by Tang Duy Tan, while the show of the year was “Tri am” bysinger My Tam.\nIn the sport categories, football player Khuat Van Khangseized the award for the young athlete of the year, while Nguyen Thi Oanh, a female track-and-field athlete, was honoured as the sport figure of the year, which honour athletes with outstanding achievements, good impressions and dedication in sports activities.The two awards were based on votes by fans via the Bvote system.\nThe last award ‘Sports Achievement of the Year’, which recognisesbreakthrough by an individual or a team in professional fields, went to thenational female football team who won a berth in the FIFA Women's World Cup2023. The winner was selected by a council under the organising committee.\nAt the awards ceremony, Le Xuan Thanh, Editor-in-Chief ofThe Thao & Van Hoa, highlighted a series of the 2023 edition’s first-times,including the opening of sports categories and the Bvote system, and theapplication of blockchain technology in organisational work.\nThe Devotion Awards were first launched in 2005./.",
  "word_count": 250,
  "scraped_at": "2026-02-14T12:24:53.226170"
}