{
  "article_id": "e6eec36fd6cd",
  "url": "https://dailytrust.com/oshoala-nkwocha-adesanya-kamaru-named-in-espns-africa-top-25-athletes/",
  "title": "Oshoala , Nkwocha Adesanya , Kamaru named in ESPN Africa top 25 athletes",
  "date": "20240723T004500Z",
  "domain": "dailytrust.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Super Falcons attacker Asisat Oshoala and former Nigeria international Perpetual Nkwocha have been named among Africa’s 25 Best Athletes of the 21st Century by ESPN.\nOther Nigerians on the list include Mixed Martial Arts (MMA) stars Israel Adesanya and Kamaru Usman, and American football star Osi Umenyiora.\nThe list also features soccer legends Samuel Eto’o, Yaya Toure, Didier Drogba, Mohamed Salah, and Sadio Mane. Renowned athletes such as Kenenisa Bekele (Ethiopia), Caster Semenya (South Africa), Eliud Kipchoge (Kenya), and Tirunesh Dibaba (Ethiopia) were also included.\nRegarding Oshoala, ESPN highlighted: “Oshoala, who currently plays for Bay FC in the NWSL, has elevated African women’s football to new heights. The Nigerian striker has been named the African Women’s Player of the Year a record six times, largely due to her outstanding five seasons with Barcelona.”\n- Electricity tariff: KEDCO seeks reconciliation with MAN, others after court judgment\n- Leadership E-I-C to host reading of new book\n“Her 92 league goals for Barça came at a rate of roughly one every 65 minutes. There, she won the Spanish Primera Division four times, and the UEFA Women’s Champions League thrice. For Nigeria, she’s been part of the Super Falcons side that won the African title three times, and is set to represent the Super Falcons again at the Paris Olympics.“\nIn its remarks on Adesanya: “Born in Lagos, although he moved to New Zealand aged 10 after a brief stint living in Ghana, Adesanya dominated the middleweight division of the UFC from 2019-2022, finally losing to Alex Pereira in November 2022 before beating him in a rematch five months later.\n“Adesanya lost his belt again to Sean Strickland later that year, but has a chance to win it back against South Africa’s Dricus du Plessis at UFC 305 on August 17 in Perth.\nAdesanya will be 35 years old by the time that fight happens but whether or not he dethrones du Plessis (30), he will go down in history as one of the sport’s greatest ever, fulfilling ESPN’s prophecy of him as the “next big thing.”\nThe global sport media outfit described Nkwocha as prolific in front of goal.\n“A prolific goalscoring midfielder who conquered Africa five times with a dominant Nigeria side, former Super Falcons captain Nkwocha has made a name for herself in Sweden both as a player for Sunnanå SK and later as a coach for Clemensnäs IF.\n“Nkwocha combined dazzling dribbling skills with ruthless efficiency in front of goal to etch her name into the history books as one of the greatest African women’s footballers ever.“\nUPDATE NEWS:\nNigerians can now invest ₦2.5 million on premium domains and profit about ₦17-₦25 million. All earnings paid in US Dollars. Rather than wonder, click here to find out how it works.",
  "word_count": 460,
  "scraped_at": "2026-02-14T12:42:22.454040"
}