{
  "article_id": "e6f31caad179",
  "url": "https://www.thewrap.com/claire-foy-women-talking-interview/",
  "title": "How Claire Foy Drew on  Righteou Anger for  Women Talking  ",
  "date": "20230109T203000Z",
  "domain": "thewrap.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "This story about “Women Talking” star Claire Foy first appeared in the Awards Preview issue of TheWrap’s awards magazine.\n“Women Talking” is a quiet film that goes deep into the righteous anger of women who have been violently abused for years and finally decide: No more. It is based on a shocking true story of the serial rape of a group of Mennonite women in Bolivia over several years.\nWhy Claire Foy, the elegant British actress best known for playing Queen Elizabeth II in the highbrow series “The Crown,” chose to explore the roiling emotions raised by this narrative and portray one of the women leaders who debate stark decisions — from violence to remaining passive — is surprising indeed. “It was like nothing I’d ever read,” said Foy of the film written and directed by Sarah Polley from the novel by Miriam Toews. “It’s more honest to the experience of what it is to be a woman in the modern society that we live in.”\nWrap Editor Sharon Waxman spoke with Foy before a live audience of several hundred women at TheWrap’s Power Women Summit in December.\nThis film is of a piece with the mission that we have at this event, which is to talk about women’s empowerment. One of the things that’s so striking about your involvement in this film is that, as an actress, we associate you with more reserved roles — obviously, Queen Elizabeth and “The Crown.” But this is really a departure. Your character Salome is angry and she needs to express that anger. So I first wanted to ask you why you were drawn to the role to begin with.\nI think Salome has a lot of things. I think she’s really frustrated. I think she feels betrayed. She’s murderous, basically, is quite a good way of describing her. Herself, her mother, her sister — all the women that she knows and her 4-year-old daughter have been sexually abused while they were unconscious. So I feel like her anger and her rage is pretty righteous and also proportionate to the trauma that she’s experienced. And I feel like it’s also her capacity, at that point, to stay alive. If she didn’t have the anger, I don’t really know how she kept going, to be honest.\nIt’s based on a book by a Canadian author, Miriam Toews. And originally when I was sent an email about the job, I got a link to… I think it was the Guardian or the New York Times about the real-life attacks that happened in Bolivia in a Mennonite community. That was my introduction to the story. My first thought was, “How are they going to make that into a film?” And then I read the script. And the script was extraordinary. It was like nothing I’d ever read. I’d never read a script that was just women’s voices talking about things that women talk about.\nBut also, the idea that you’d want to spend your time in a world in which it’s a group of women who’ve been raped or assaulted… I’m not an actor, but I would need to take a beat and think, do I want to take this journey?\nI think there’s more of an honesty about that. I feel like the world we live in is the world these women live in, unfortunately. The people I know — the women I know — are survivors. So I feel like it’s more honest to the experience of what it is to be a woman in the modern society that we live in.\nYou said the women you know are survivors?\nYeah. I mean, yeah. Am I speaking here into a void? I feel like everybody in this room, the women that they know… Obviously, (I knew) this was going to take a lot. But it was also going to give me a lot. I can’t stress enough the uniqueness of reading a script like this and then being given the gift of being trusted with it. And working with these extraordinary actors and the crew and Sarah, who’s a genius — it’s once in a lifetime.\nIt is. You had Frances McDormand, Rooney Mara, Judith Ivey — some really incredible actors. What was that like?\nThat’s what we’re in it for. We go very deep, very quickly. And I think that Sarah cast this film with a certain type of actor in mind. It was completely egalitarian, there were very few egos. Everybody was there for the right reasons. We just all wanted to be there for each other. And for Sarah, and for the story.\nFor those who haven’t seen the film, we should explain that most of it takes place in a hayloft in this Mennonite-like community, where they’re completely cut off from the world. The women and the children are all raised in this very old tradition, without televisions or cell phones or anything like that. And this is going on in a religious community where women are finding themselves waking up with blood in the bed or with bruises on their limbs, and finally figuring out that they’re all being drugged and assaulted.\nBasically, in order to enter the kingdom of heaven, they have to forgive the men. The tenet of the Mennonite faith is forgiveness and pacifism. And so, it’s a sort of life-and-death situation. They’ve been told by the elders of the community, who are all men, that they must forgive the men. And so they have to decide whether they’re going to stay and fight, whether they’re going to stay and do nothing, or whether they’re going to leave.\nIt seems very allegorical: What is the role of a woman in today’s society? It’s an extreme depiction of women in a moment of crisis, but you really could draw a distinct line to where women are today.\nI don’t think it’s just about women. The film has an amazing ability to (represent) any marginalized group of people, any group of people who’ve been oppressed. It’s unsafe for them to imagine a world other than the world they’ve been told they’re living in. These women do not know what the world without the men is like. They do not know how to read, they don’t know how to write, they don’t know where they are in the world, they don’t know how to have freedom of thought. This is their first experience of being given the opportunity to design a life.\nAnd I think that’s the problem that is happening in the world at the moment. We believe that we don’t have the right to imagine a world in which we can be equal participants, whether that’s any marginalized community, women or otherwise. And this film genuinely shows that there can be a template of how you hope for that, and how you can make that yourself in whatever way that is, whether that’s a big decision or a small decision that you make in your life. You can say no or yes or nothing at all, really.\nThat’s a really good insight. Once a certain line is crossed, they’re like, “Well, no, that’s not acceptable.” And then they have to start thinking about all kinds of things that are outside the scope of accepted thought.\nYeah, I think it’s a scary place to live, isn’t it? I can imagine it’s very scary and makes people defensive if the world that they know and trust is being questioned. But I think that the idea that anything is constant, the idea that anything is without doubt or fallibility is the biggest lie. I think we have to move through life knowing that none of this is solid. It will always change.\nWe’ve seen so many films that are about whether a rocket goes into space to blow up an asteroid, or there’s a submarine — something really dangerous. You don’t know what’s happening, but something dangerous is happening. And it’s really important. It’s lots of men around a table, pushing things around and having serious conversations like it’s a really big deal. And then they have, like, a massive shot of the earth. And then we zoom in onto a football pitch (field).\nWhat Sarah wants to do with this film was be like: This choice that these women are making is monumental. They are starting a civilization. Women do that in small ways every day. And people are doing that all the time. And I think that this film shows that while there is so much damage being done, and there is so much fear and it can feel very unsafe, that there is always the other option. Even if you can’t see it in the darkest time, it is there somewhere. It’s like being on an airplane going up over the clouds. It’s sunny out there. Even if it’s raining.\nIt’s a feat of imagination. In some ways you have to imagine it, and then create it.\nRead more from the Awards Preview issue here.\nClaire Foy was photographed at the Fairmont Hotel in Santa Monica on December 14, 2022\nStylist: Nicky Yates, Makeup: Georgie Eisdell, Hair: Gregory Russell",
  "word_count": 1532,
  "scraped_at": "2026-02-14T13:35:08.091206"
}