{
  "article_id": "e6f96149b27a",
  "url": "https://www.lbc.co.uk/news/al-fayed-escaped-sex-assault-charges-twice/",
  "title": "Mohamed Al Fayed twice escaped sexual assault charges , prosecutors admit , as nearly 200 ... ",
  "date": "20240922T063000Z",
  "domain": "lbc.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Mohamed Al Fayed twice escaped sexual assault charges, prosecutors admit, as nearly 200 women come forward\nProsecutors have admitted they twice declined to bring sexual assault charges against Mohamed Al Fayed while he was alive, as nearly 200 women come forward with claims against the late billionaire after his death.\nListen to this article\nThe former Harrods and Fulham FC owner, who was described as a \"monster\" by a lawyer for some of his alleged victims earlier this week, had evidence against him sent to the Crown Prosecution Service (CPS) by the police on two occasions.\nMr Al Fayed was accused of indecent assault against a 15-year-old girl in 2008, which he denied.\nThe CPS declined to bring charges when presented with the case in 2009, citing conflicting evidence.\nMr Al Fayed was said to have raped a woman in 2013, with the case reinvestigated by police in 2015, but neither investigation resulted in a charge.\nCurrent Prime Minister Keir Starmer was the CPS’s director of public prosecutions (DPP) in 2009. His successor Alison Saunders was the DPP in 2015. A Downing Street spokesman said of the 2009 allegation: “Keir did not handle this case. It did not cross his desk.”\nA spokesperson for the CPS said: \"We reviewed files of evidence presented by the police in 2009 and 2015.\n\"To bring a prosecution the CPS must be confident there is a realistic prospect of conviction - in each instance, our prosecutors looked carefully at the evidence and concluded this wasn't the case.\"\nThis is the first time that the CPS has acknowledged the 2015 investigation. They also gave early investigative advice for Al Fayed in 2008, 2021 and 2023.\nCommander Kevin Southworth, the public protection lead for the Met, said: “We are aware of various allegations of sexual offences made over a number of years in relation to the late Mohamed Al Fayed, which were reported to the Met.\n“Each one was investigated and, where appropriate, advice from the Crown Prosecution Service was sought. No charges resulted from these investigations.”\nMr Al Fayed died last year, aged 94, without ever facing charges. A wave of allegations surfaced this week against him for his alleged conduct at Harrods.\nMeanwhile a former Fulham women's team manager claimed that the club had to take extra care to protect female players from his attention, and a former head of royal protection said that he warned the royal family about Mr Al Fayed before Princess Diana took Prince Harry and Prince William on holiday with him.\nDai Davies, who was head of Royal protection and was responsible for Queen Elizabeth II's safety, says he and others were aware of Mr Al Fayed's reputation as far back as the 1990s.\nAt least 187 women have come forward with claims against Mr Al Fayed - some 150 of those since the initial press conference on Friday.\nDean Armstrong KC, a lawyer for the alleged victims, told LBC's Matthew Wright on Saturday that he was expecting more women to come forward with claims against the late billionaire and former Harrods owner.\nMr Armstrong said: \"We're already signed up with 37 - we have overnight, certainly in excess of 150 more who have contacted us - we're anticipating that it will be more than that.\"\nHe added that Harrods and other companies must work harder to make sure that women are protected against sexual predators.\nMr Armstrong said: \"One of the things that I hope and believe must be taken away from this is the importance in the future of the corporate responsibility of looking after your employees - making sure they have a safe system of work.\nHe added that \"the fact that it was the facilities and resources of the body corporate that were being used to effectively enable this [alleged] behaviour, that is something which must be addressed very urgently.\"\nA press conference on Friday which set out the claims made against the late Harrods' owner heard there was a \"systematic failure of corporate responsibility\".\nMr Armstrong told reporters: \"And that systematic failure is on the shoulders of Harrods.\"\nThe legal team also represents women who were employed by the Paris Ritz and investigations were ongoing into \"all entities that he had involvement in\", including Fulham Football Club.\nThe legal team featured in a documentary called Al-Fayed: Predator At Harrods, where more than 20 female former employees spoke to the broadcaster as part of a special investigation, coming forward with allegations of assault and physical violence at properties in London and Paris.\nSources within Harrods have said the business has accepted vicarious liability for the conduct of Mr Al Fayed for the purpose of settling claims of alleged victims brought to its attention since 2023, reaching settlements with the vast majority.\nHarrods has received new inquiries since the airing of the documentary, it is understood.\nAlso speaking at the press conference was an alleged victim of Mr Al Fayed, who went by the name of Natacha, and said the \"fear instilled left me paralysed\".\nShe said: \"These private meetings turned into more of a forced kiss, his hands gripping your face to his lips or pulling you down on his lap, where his hands were free to explore any part of your body that he wished.\n\"These incidents lasted seconds, but the fear instilled left me paralysed.\n\"Al Fayed brushed off these moments like they had never happened, but I was always reminded not to mention them to anyone.\"\nHarrods previously said it was \"utterly appalled\" by the allegations of abuse and said it had set up a page on its website inviting former employees to come forward if they have allegations.",
  "word_count": 947,
  "scraped_at": "2026-02-14T14:13:28.989462"
}