{
  "article_id": "e7170965bc74",
  "url": "https://www.sbs.com.au/news/the-feed/article/clares-ex-pampered-her-when-they-started-dating-turns-out-she-was-financially-catfished/wth0c8ayj",
  "title": "Financial catfishing : It isnt an elaborate romance scam",
  "date": "20240303T194500Z",
  "domain": "sbs.com.au",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "\"He said he was a doctor with a convertible. He was a student in a Mazda,\" one person said online.\nAnd yes, Mazda technically makes convertibles, but was the framing crafted to bend overall perception? Also, yes.\n'Financial catfishing' isn't an elaborate romance scam. There is no fake online persona. When you meet for a date, they look the same as their profile.\nThese people lie about the type of car they drive or look at houses they could never afford or say they have a glamorous job, all to impress real dates and pretend they’re richer than they actually are. Sometimes the guise works.\nBeware of 'financial catfishing'\nClare still doesn’t know whether her ex once had more cash or if he just had some coming in during their first few months of dating.\nBut as the cliche goes, it was quite dreamy when Clare started dating him. At the time, she was in her mid-20s and finishing off her nursing degree when a man 11 years her senior parachuted into her life and showered her charm.\n\"He was charismatic, could talk to anyone, he was really good at being in any conversation,\" she said.\nThen came the nice dinners — with cocktails, no house wine allowed — there were gifts and a level of generosity that implied if he were asked how wealthy he was, he'd reply: \"comfortable\".\nWith the age gap, it was conceivable to Clare that he did have his life together.\nIt wasn't the reason why they got together, but the excitement and generosity did help with the wooing, Clare said. It lulled her into a false sense of security.\nHe worked as an international travel photographer, and \"he made a point of talking about his numerous properties around Australia, his investments, his photo sales\".\n\"It was: 'look at how impressive I am, look how much travel I’ve done, look at all this adventure you could have if you were here with me',\" she said.\nThe only problem is he was lying, and when the initial getting-to-know-each-other phase was over and they moved in together, it became clear that it had been a front.\nThe only problem is he was lying about it\nThings started to fray when they moved in together, and the lie was harder to keep tucked away.\nSome weeks, rent wasn't being paid and there was always some reason why it hadn’t gone through; the landlord had messed up, his money was tied up in different accounts, and at one point, Clare was told he had a divorce settlement being processed.\nThen there was the doomed holiday to Cairns. Clare and her ex ended up stuck there for days when he didn't have the money to pay for the flight home, one he promised to cover.\n\"We ended up stuck until our pay came through,\" she said.\nShe got a flight home and then broke up with him. They’d been together for two years.\n\"It came from a deep insecurity and feeling like he could not be his authentic self and as attractive as a partner to me, so he needed to create this whole persona,\" she said.\n\"Maybe he thought he wouldn't be loved otherwise.\"\n\"I feel like he was just overcompensating all the time and he spun himself into a web of lies.\"\nAnd she thinks it was all done to impress. \"Looking back, I don’t think he had any real friends. He was incredibly lonely in retrospect, living in a remote town.\"\nIn heterosexual couples, pay expectations persist\nEven as new generations become increasingly more liberal in their politics, when it comes to dating, some traditional gender roles around money are still very much there for heterosexual couples.\nIn a 2023 paper from Psychological Reports, a peer-reviewed journal asked 552 heterosexual Americans who they expected would pay for a date.\nAnd regardless of whether they had more traditional or progressive views of gender roles, the expectation was the same: both men and women expected the man would pay.\nSome progressive defenders will cite the gender wage gap as their defence to this, and the \"pink tax\" — i.e. the tendency for products specifically marketed to women to be more expensive than those marketed to men.\nIn heterosexual relationships, 42 per cent of 18 to 30-year-old men believed they should be the providers, not women, according to a newly released report from Jesuit Social Services, The Man Box.\nBut from time to time, prospective dates will try to impress — or fool — their dates by peacocking assets they don't have.\nTaking dates to luxury home inspections\nIn 2022, Professor Cassandra Cross was contacted by real estate agents who were trying to wrap their heads around a subset of fake buyers in the luxury housing market.\n\"There was a prevalence of particularly men who were attending different open houses of high-end properties, multimillion-dollar properties, and they would bring their date with them,\" the professor at the Queensland University of Technology's School of Justice told The Feed.\nSometimes, the person would take one date to multiple properties; other times, it would be different dates to different properties.\n\"But the problem was that they never had the financial means to buy those houses. They were just going to the open houses to establish this status, this image of themselves as a kind of wealthy, powerful person.\"\n\"It might be attractive in the first instance to a potential partner, but it also gives them the background to justify themselves when they can't pick up the bill.\"\n'Who TF Did I Marry': Reesa Teesa's 52-part TikTok story of financial catfishing\nA day after Valentine's Day, Tiktoker 'Reesa Teesa', a 35-year-old American, started her 52-part, eight-hour story time about her 'pathological liar' ex-husband.\nThe saga has captured the attention of the internet this week, who are calling it a 'cautionary tale', with most videos attracting up to 10 million views. Others have close to 50 million.\nReesa quickly fell for a man she believed was a former football player and divorced corporate executive and who she felt was romantic and could provide for her financially. Within months, they had moved in together and she became pregnant.\nSoon after, the two started house hunting and he also said he would buy her a car and have it delivered to the house.\n\"It was intoxicating to not have to worry financially,\" Reesa Teesa said on TikTok.\nBut the red flags appeared to Reesa when he would put in all-cash offers but he couldn't produce the proof of funds necessary to close any deals.\nThe car never came. And they never bought a house. And the hours-long story concludes that he had allegedly misled her over months.\nHer ex — who has identified himself — is denying the accusations and says he is considering legal action.\nLying on a first date? You're not the only one\nAccording to 2017 research from dating site Match.com, about two in five people lie on the first date. One of those lies is how much money they make, but other common lies are around height and sexual history.\n\"I’m not a millionaire and that’s something I definitely feel insecure about, so I’ll definitely lie about my accomplishments,\" one man said in response to the research online.\nDaniel Paproth, who talks to young men about masculinity in his role at Victorian youth organisation The Man Cave, said to be mindful of how you respond if you find a partner dishing out a \"white lie\" on their finances.\n\"Come at it from a place of curiosity,\" he said.\n“Then maybe that makes the man in that scenario feel a little safer and a little more comfortable to be able to explore the uncomfortable feeling within himself.\"\nPaproth remembers being in his early twenties and trying to impress.\n\"I genuinely felt so far behind in terms of my looks, my confidence that I was just trying anything and everything and throwing things at the wall and see what would stick.\"\nIt wasn't flashy cars - though it did cross his mind - but it was \"shredding for Stereo\", a music festival, for which he bought \"ridiculous\" little white singlets.\n\"Truth be told, I f--ing hated it.\"\nThrough award winning storytelling, The Feed continues to break new ground with its compelling mix of current affairs, comedy, profiles and investigations. See Different. Know Better. Laugh Harder. Read more about The Feed\nHave a story or comment? Contact Us",
  "word_count": 1412,
  "scraped_at": "2026-02-14T12:07:32.046661"
}