{
  "article_id": "e74bc83527c0",
  "url": "https://www.fcbarcelona.com/en/club/news/4421423/30-consecutive-victories-across-all-professional-fc-barcelona-first-teams",
  "title": "30 consecutive victories across all professional FC Barcelona first teams",
  "date": "20251218T134500Z",
  "domain": "fcbarcelona.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "30 consecutive victories across all professional FC Barcelona first teams\n- label.aria.viber Viber\n- label.aria.whatsapp WhatsApp\n- label.aria.twitter Twitter\n- label.aria.facebook Facebook\n- label.aria.messenger Messenger\n- label.aria.link label.aria.tick Copy link\nThe multisport model of FC Barcelona has immeasurable value and is going stronger than ever. The most recent section of the season has brought a lot of joy to fans, as it has now been 23 days since any of the six professional first teams at the Club have tasted defeat, but even more impressively, they have accumulated 30 consecutive victories.\nFlick's Barça 6/6 after loss at Stamford Bridge\nThe last time a blaugrana team fell to defeat was the men's football first team match at Stamford Bridge on 25 November. Hansi Flick's side have six wins in three different competitions since that 3-0 defeat by Chelsea. They have victories over Alavés, Atlético Madrid, Betis and Osasuna in LaLiga, Eintracht Frankfurt in the Champions League, and most recently Guadalajara in the first Copa del Rey match this season. Six wins that have helped consolidate top spot in LaLiga, improve the situation in the Champions League and see them through to the last 16 in the Copa del Rey.\nFour for the women's team, WCL league phase leaders\nThose six wins become ten when you add the four by Barça Women during the same period. The most recent came yesterday away to Paris FC, which ensured first place in the table at the end of the WCL league phase. This may have been victory number 30, but Pere Romeu's side have also beaten Tenerife, Benfica and Badalona. Continuing on, the men's first team may have won six games, but the Barça basketball and handball sides have also achieved the same.\nXavi Pascual makes his mark on Barça basketball\nThe arrival of Xavi Pascual as the blaugrana basketball coach seems to have turned the entire season around. They have only lost, and by only one point, against Anadolu EFES in Turkey way back on 20 November in Pascual's first game, and it's been all wins ever since. Furthermore, four of them have come in the EuroLeague. The victories have come against ASVEL, Crvena Zvezda, Olympiacos and París, while they have won resoundingly against Andorra and Manresa in the Liga Endesa.\nHandball team along the same lines\nThe handball team have had this winning feeling for the longest, as Carlos Ortega's side have in fact won every game since 18 September, 25 from 25. They have six wins in this specific period from 25 November, like the men's football first team and the basketball team. These came in the Champions League against GOG and PSG, and Rebi Cuenca, Tubos Aranda Villa de Aranda, Guadalajara and Torrelavega in the domestic league. That's 22 so far, and the remaining eight to reach 30 are accounted for by four each by the futsal and roller hockey sides.\nFor more for futsal and roller hockey\nThe Barça futsal team has won three Liga games against Palma Futsal, Noia and in the derby against Industrias Santa Coloma, while they also won in the Copa del Rey a few days earlier in Santa Coloma. The final four victories came from the roller hockey team coached by Ricard Ares, who have defeated Alcoy, SHUM Maçanet and Cerdanyola in the OK Liga, as well as winning at Igualada in the Champions League. That's the breakdown for these 23 days of smiles, wins and happiness for FC Barcelona. Long may the run continue!\n- label.aria.viber Viber\n- label.aria.whatsapp WhatsApp\n- label.aria.twitter Twitter\n- label.aria.facebook Facebook\n- label.aria.messenger Messenger\n- label.aria.link label.aria.tick Copy link",
  "word_count": 601,
  "scraped_at": "2026-02-14T12:50:30.853658"
}