{
  "article_id": "e75ea0faf83a",
  "url": "https://www.inquirer.com/phillies/marsh-erin-brandon-siblings-olympics-phillies-20240626.html",
  "title": "Brandon and Erin Marsh are always there for each other , from Olympic trials to Red Octobers",
  "date": "20240626T200000Z",
  "domain": "inquirer.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Brandon and Erin Marsh have always been there for each other, from Olympic trials to Red Octobers to their greatest loss\nSonja Marsh is proud of her kids’ athletic careers, but even more for how they have supported each other through the pressures of their sports and the loss of their father.\nOn Monday afternoon, Phillies outfielder Brandon Marsh received a text from his mother, Sonja. He was in Detroit for a three-game series against the Tigers, and she was in Eugene, Ore., to watch his sister compete in the U.S. Olympic track and field trials.\nErin Marsh is one of the best heptathletes on the planet — ranked 10th in the United States, and 56th in the world — but she was not having her best day. She suffered a hamstring injury a few weeks earlier and was starting to feel it. She had begun to fall in the standings, and by the time she reached her final event, the 800-meter dash, she had been statistically eliminated from qualifying for the Olympics.\nIt was a demoralizing moment. So Sonja asked her son to lift his sister up.\n“Erin is pretty bummed,” she said. “Just reach out to her and tell her how she should finish that 800.”\nBrandon obliged.\n» READ MORE: A T-shirt showed up in Brandon Marsh’s locker. Here’s why it reminded him of his late father.\n“Just enjoy it,” he wrote. “You’re one of the very, very few that are able to compete here. Finish the 800 strong, like your life depended on it, and then we relax. I love you so much. You’re so special, Erin. Keep being you and smiling big. You’re the best ever.”\nA few hours later, Brandon ran out to center field as Erin ran two laps around the track. She finished five seconds short of a personal record.\nHer brother’s words resonated, as they usually do.\n“He’s been in high-pressure moments,” Erin said. “He knows the ins and outs of the day-to-day sacrifices. So it always helps when he texts me stuff like that.”\nBoth of the Marsh children found their future callings in high school in Georgia. Brandon, 26, was a multisport athlete who had offers to play Division I football, but he was selected by the Angels in the second round of the 2016 MLB draft at age 17. Erin, 24, dabbled in softball and cheerleading, and found her way to track through cross country.\nA coach asked her if she could run the hurdles, and she gave it a try. She won the Junior Olympics in the 400-meter hurdles shortly after that, which is when her family realized that this might be more than a hobby.\n“I was like, ‘OK, we might have something special,’” Brandon said.\nSonja is proud of her children, for obvious reasons, but she is especially proud of how they’ve supported each other. There are times when Brandon and Erin are thousands of miles away, in different countries or even different continents, but that never seems to matter. Erin doesn’t miss a game, and Brandon doesn’t miss a meet. If they can’t watch an event live, they will watch it later.\n“I’m just there to be a hype man,” Brandon said. “I’m the second-best athlete in the family.”\n‘I want to go to the Olympics’\nWhen Erin was in high school, shortly before she committed to Duke, her father, Jake, began to ask about her long-term goals. He wanted to know exactly what she set out to accomplish in track and field.\nAt first, she told him that she wanted to have a successful college career. It wasn’t the answer he was looking for.\n“More,” he told her. “You’ve got to want more.”\nSo Erin set her sights on something greater.\n“I want to go to the Olympics,” she said.\n» READ MORE: Almost two years later, the Brandon Marsh-Logan O’Hoppe trade has ‘worked out for everybody’\nThat was more like it. The Marsh children got their athleticism from their father, who was a three-sport star at Portal High School in eastern Georgia. Unlike his kids, Jake never made a career out of any of those sports, but he did pass on some valuable lessons.\nThe biggest was perseverance, and they saw it firsthand. Jake was diagnosed with tongue and throat cancer in 2017. After he beat it, the cancer returned to his kidneys and traveled all the way up to his head.\nHe was in serious pain, but that didn’t stop him from living. Jake traveled to Erin’s and Brandon’s events when he could barely walk or speak. He attended Angels spring training in March 2021, and died on April 6, 2021, at the age of 50.\nTwo days later, Erin had to compete in a home meet at Duke. Brandon flew in from Arizona. The night before, they snuck onto the track with Sonja and decided to race. The first heat was Brandon against his mother. He was wearing slides instead of sneakers, and when he took off, his slides went flying.\nHe kept running, and as Sonja tried to catch him, Erin began to laugh. It felt good.\n“That was obviously one of the hardest times of our lives,” she said. “But nothing was more important to me than being with them in those following days. We all tried our best to keep good spirits about it all because life doesn’t stop when something crazy happens.\n“We all deal with it in our own way, but I think that we’ve all done a good job at living, still.”\nIn June of that year, Erin competed in her first Olympic trials. In July, Brandon made his big league debut with the Angels. Both days were bittersweet. They wanted their father to be there. But his absence has brought them even closer.\nErin travels sometimes and stays in Philadelphia for most of the postseason. The baseball schedule is less forgiving, but Brandon has managed to catch a few track meets in person.\nAfter the Phillies lost to the Diamondbacks in the National League Championship Series last year, Brandon flew down to Santiago, Chile. He was not in the best mood, but Erin was competing in the Pan American Games, and he wanted to support her.\nHe watched event after event with Sonja, as Erin climbed her way to the top of the standings. They were 5,000 miles away from Philadelphia, but the environment felt just as electric. Eighty thousands fans were packed inside, cheering for their countrymen and -women. When Erin won a gold medal, she received a standing ovation.\n“I cried a little bit,” Brandon said. “Watching your sister do that? That was unbelievable. It stung because we just got put out by the Diamondbacks, like days before then, and I wasn’t going to be able to go see her. But that helped lift me back up, you know?\n“I was on the edge of my seat the whole time. I was like, ‘THROW IT! THROW IT!’ And then watching her do the hurdles … I mean, I can’t even touch my toes. So to see her bring her knee to her face and the other back leg being parallel to the ground is painful for me to watch.\n“But she’s so good. And she gets a lot of points for her hurdle scores, so I like watching her go. She looks like a gazelle out there.”\n» READ MORE: Brandon Marsh, trying to be ‘one with nature,’ explored the Coors Field forest. His teammates followed suit.\nErin gets just as much fulfillment from watching her brother play. There aren’t many similarities between the heptathlon and baseball, but both require mental toughness. In the heptathlon, you are competing against yourself, and you have a lot of time to think.\nSometimes, this leads to overthinking, which is a habit that baseball players are quite familiar with. But Brandon has shown an ability to persevere in a game of failure.\n“It inspires me when he goes 0-for-4 and then comes back the next day and gets on base four times,” Erin said. “I think that when I see him do that — how he doesn’t let the bad games bring him down — that inspires me. And it reminds me to be a dog, too. If I have a bad event, I’ve got to move forward.”\nWho’s the better athlete?\nThis mutual respect doesn’t prevent them from giving each other grief. Brandon likes to remind Erin of the times he’s beaten her in a race. His sister has decided that they won’t be racing anytime soon.\n“Just leave it up for interpretation,” Erin said. “See who people think is faster. I think he could beat me, because he’s taller and athletic, but I’m going to say I’m the most athletic. I’ll take that one.”\nBrandon’s Phillies teammates agree with her. When asked who was the better athlete, second baseman Bryson Stott did not hesitate.\n“Erin,” he said last week.\nThird baseman Alec Bohm, Brandon’s roommate, gave it a little more thought.\n“I mean, Brandon could’ve played Division I football, and he’s playing in the big leagues … but Olympic athletes are pretty athletic too,” Bohm said. “So I don’t know. She does more stuff, so I guess she’s technically the better athlete. So, I guess I’ll give it to her.”\nAdded Brandon: “She would come over to the football field in high school and race us after practice. She beat some of the guys, and beat me a couple of times, but I beat her the majority of the times.”\nNo one is safe from these well-intentioned taunts, not Bohm, not Marsh, not even designated hitter Kyle Schwarber.\n“I did make a joke once that I think I could beat Bohm in a race,” Erin said with a laugh. “Bohm doesn’t look like he’s moving too fast on the basepaths, but he’s also like 6-6, or however tall he is [listed at 6-5].\n“I bet I could beat Schwarber, maybe. He’s had a couple of knee surgeries. I think I could play that to my advantage.”\nShe has enjoyed meeting his teammates and has embraced the cult following her brother has developed in Philadelphia. Erin has memories of Brandon using pens to beat box, back when he spent hours on SoundCloud, digging up Lil Uzi Vert songs. He’s since replaced beat boxing with barking, but other than that, not much has changed.\n“I remember him saying things like, ‘Oh, you don’t know this song by Lil Uzi. It’s not out,’” Erin said. “And I’m like, ‘All right, Brandon …’”\nTo the surprise of no one, Brandon intertwined his love of baseball and rap through his walk-up songs, which is something he still does today.\n“He had ‘Grillz,’ by Nelly, in double A,” Erin said. “That was funny. That would really get the crowd going. In high school, his walk-up song was ‘El Chapo,’ with Skrillex, which is literally hilarious.\n“He also used to have a Lil Uzi chain, like a little spaceship thing, in the minors. It was so stupid. Him and Jo Adell, back in Anaheim, would have some funny chains. I don’t think he wears them as much now. I think he wears the cross chain that my mom got him for Christmas. But he used to be just goofy with rapper stuff.”\nHe is still pretty goofy, but that’s the way his family likes it.\n“People will send me a video of him barking or rapping, and I’m like, that’s just Brandon,” Erin said. “He’s literally been that way since he was 10 years old. He’s always been this way. Now, it’s just on TV. And honestly, I’m so, so thankful that he’s never changed. That he’s stayed as big a personality as he is.”\n‘Beyond proud of her’\nSonja said her son’s goal is to be the best outfielder he can be. Her daughter’s goal is more specific. She wants to go to the Olympics, and she wants to win a medal.\nIt’s not unrealistic. Erin was just a few hundred points short of qualifying last weekend — a small amount, relative to her final score of 5,898. She will still be in her prime in 2028, when the Olympics are held in Los Angeles. But regardless of what happens, she will not do it alone.\nJake won’t physically be there, but Erin’s mother and brother will be.\n“I’m super, super proud of her,” Brandon said. “Growing up, if the people around us would have thought that my sister would be trying to compete for the Olympics, and I’d be playing for the Philadelphia Phillies, I bet they’d say, ‘You’re crazy.’ We’re super blessed to be in the position we’re in, and I am beyond proud of her to where she’s gotten to in her career and in her life.\n“And I honestly think it’s just the beginning for her. I think she has a lot more left to give to the sport. And a lot more to prove. So I’m excited for her. I’ll be with her every step of the way.”",
  "word_count": 2184,
  "scraped_at": "2026-02-14T12:41:29.020592"
}