{
  "article_id": "e79eadf8a441",
  "url": "https://liverpooloffside.sbnation.com/2023/2/10/23593841/liverpool-fc-women-beard-report-theres-a-special-bond-between-us-and-the-supporters",
  "title": "Beard Report :  There A Special Bond Between Us And The Supporters  ",
  "date": "20230210T060000Z",
  "domain": "liverpooloffside.sbnation.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Liverpool FC Women have had a slightly better go of it as of late than the men have, but not by much. They have also lost out on both domestic competitions they’ve been in, but at least they secured a much needed three points this past weekend when playing against Reading in the FA Women’s Super League.\nBeard Report: “There’s A Special Bond Between Us And The Supporters”\nIn his latest column, Matt Beard writes about how important the supporters are, the new signing’s effect on the squad, and the win against Reading.\n“It was an important three points for us against Reading last Sunday in the Barclays Women’s Super League and I felt it was thoroughly deserved,” manager Matt Neard wrote in his weekly column for the club website.\n“I’d seen the results the day before and, obviously with Reading just below us in the table, that win gives us a bit of daylight. It was good to go above Tottenham and get closer to West Ham and Aston Villa.\n“We knew it would be a tough game and sometimes, like it was in the first half, these games can be like a game of chess. We showed the players where the spaces were at half-time and we started to stretch them and the game became a bit more open.”\nOur Red Women were able to put Reading down by two goals, both coming in the second half.\n“If you look at our first goal, it was a bit of a scrappy one but a goal is a goal at the end of the day. For the second one, obviously Megan Campbell’s throw is such a weapon for us – I was delighted we scored from it, we haven’t made enough of them this season,” Beard went on.\n“It was great for Ceri Holland to score again on her 50th appearance for the club. We spoke with Ceri the day before about making these runs and she said to me after the game, ‘Finish your runs Beardy, finish your runs!’”\nBeard also joined the chorus of praise for new signing Fuka Nagano after a stellar showing at Prenton Park. Liverpool signed the Japanese midfielder in the winter window from North Carolina Courage and she’s clearly impressed - especially with her ability to help out young star Missy Bo Kearns.\n“Fuka Nagano coming in has made a big difference to us, and it’s given Ceri and Missy Bo Kearns more freedom to get forward in those higher positions,” Beard wrote.\n“You just look at Fuka’s performance against Reading, it was just so enjoyable to watch and she is going to make a big difference to this team, who will continue to get better. She is a fantastic player and she is a great person as well – very grounded, always smiling. We are very lucky that we managed to bring her in.\n“It was great to see Missy Bo get a goal and I firmly believe she is capable of doing that on a regular basis.\n“She is such a creative player and a creative spark. The first few months of this season were tough for her because when you step out of the Championship into the WSL, it’s a completely different level.\n“It’s taken her a little bit of time to adjust but with Fuka now in there as well she has a bit more freedom to add that creative spark, and I’m delighted she got her goal.”\nAnother signing that finally got time to shine was Miri Taylor, who had come over in the same window from Angel City Football Club in Los Angeles. Taylor had picked up a minor injury before the Chelsea match, delaying her debut, but she was able to come off the bench last Sunday against Reading.\n“It was great to give a debut to another one of our recent signings, Miri Taylor, when she came off the bench against Reading as we made a couple of changes just to make sure we saw the game out,” Beard continued.\n“Unfortunately, just before the Chelsea game she picked up an injury that has kept her out, but I’m delighted to give her a debut and last Sunday was a good day all round for us.”\nA return to Prenton Park also meant that the supporters were in full voice, and it didn’t go unnoticed by the manager.\n“Our supporters were absolutely fantastic once again. They were singing the players’ songs and all sorts – even Dame Heather Carroll got a song, bless her, which was great,” Beard added.\n“Whether we have been winning or losing, they have always supported us and we are so grateful for that. They do make a huge difference. There is a special bond between us and the supporters, and it’s great that it has continued.”\nEven for all the excitement following the win, focus goes to hosting Leicester City on Sunday at Prenton Park, and the selection headaches that come with new signings and players returning from training. Captain Niamh Fahey is likely to be available for selection following her absence against Reading, in addition to Natasha Dowie, and that just adds to Beard’s problems. Within the squad, though, the only problems to be dealt with are injuries - togetherness is as tight as it’s ever been.\n“I’ve got a great selection headache now – which I want – because Natasha Dowie is ready for her second debut on Sunday,” Beard wrote.\n“Hopefully our captain Niamh Fahey will be available for selection as well after missing the Reading game. So, I’ve got some proper selection headaches but I wouldn’t have it any other way.\n“Since that bad day against Manchester United, the way the whole squad has trained and helped the XI that started that game, you can definitely see the togetherness of this group. For me, the players who are not starting are just as important because they are getting their head down, working hard, while at the same time helping us prepare for the games. I want to praise them as well for their professionalism and the way they have been going about things.\n“Tats has been brilliant since she came in. She’s just an infectious person, a cheeky laugh and just watching her back in training and seeing her professionalism and the standards that she drives, there’s been a few good battles already. We have brought in a great mixture of youth and experience. If you look at Sofie Lundgaard (20), Fuka (23), and Miri (23), and adding Gemma Bonner and Tats to that, we have good balance in this squad now, with people on different parts of their football journey.\n“For Tats to come back here, this is a club she supports and she had a lot of success here. So with Leanne Kiernan and Shanice van de Sanden out, it’s a win-win situation. She will play an important part for us between now and the end of the season.”\nLeanne Kiernan is aiming for a March return from injury, with Shanice van de Sanden’s current timeline unknown. The need for experienced attackers was paramount, and if Beard feels like we got there, there’s no reason to believe we haven’t. As for the rest of the season? Well the announcement that the next Merseyside Derby is to be played at Goodison Park was a welcome one.\n“It was announced on Monday that our away Merseyside derby against Everton will be played at Goodison Park on Sunday March 26,” Beard added.\n“It will be a great occasion and hopefully from our perspective Everton can feel the pressure that we felt at Anfield! It does have an added pressure but it’s fantastic to play this game at the first-team stadiums.”\nThat’s still a ways off, with plenty of time to make up ground in the lague and hopefully move up the table so we can meet Everton in a different position than we were in at the start of the season. By then our new signings will hopefully be fully settled and firing on all cylinders.\nHighlights and a match replay of the Reading match are available on the FA Player and Liverpool Women play again on Sunday, 2/12, against Leicester City.",
  "word_count": 1374,
  "scraped_at": "2026-02-14T12:39:14.257574"
}