{
  "article_id": "e7bde09e84eb",
  "url": "https://www.wkar.org/wkar-news/2023-05-23/michigan-state-club-ultimate-frisbee-team-sets-a-winning-standard",
  "title": "Michigan State club ultimate frisbee team sets a winning standard",
  "date": "20230523T184500Z",
  "domain": "wkar.org",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "For the first time since 2018, MSU’s ultimate Frisbee student club team defeated its rival Michigan in sectionals. But they’re not finished just yet., as the club members are hungry for more.\nMSU’s ultimate Frisbee team was founded on the foundation of fostering a competitive environment with a positive mentality. As one of the older club teams, it has an established alumni association and large membership.\n“We have a long-standing program with a lot of history of success and experience,” fifth-year senior and captain Neil Proefrock said. “We’ve got a long list of alumni that continue to come back and help keep us at a higher standing.”\nThe club is split into two separate teams, Arc and Riot Control. Arc is more competitive and selective, while Riot has a no-cut policy, and requires no prior experience with the sport to join.\nArc and Riot Control members tend to spend time together outside of practice, along with members of the women’s ultimate frisbee team as well.\n“Frisbee-wise, we play pick-up and throw around with all the other teams,” senior captain Jacob Blatt said. “We host and attend social events with Riot Control and the women’s team throughout the year as well. We have a formal…and have a spring break trip every year too.”\nClub dues are approximately $300 per year. However, financial assistance is available from the club’s alumni association for individuals who are unable to cover the cost. Additional travel expenses such as gas and preferred gear are separate, and paid for individually by members.\nHow is Ultimate Frisbee played?\nThe game is played similarly to football, with the end goal of scoring in the end zone of a turf field. Players are prohibited from moving their feet when in possession of the disc and there’s a 10-second limit that a player can hold onto the disc.\nSeven players per team are permitted on the field, and those athletes remain on for the duration of the play. They leave the field once a point is scored. If the disc hits the ground or the opposite team catches the disc, it’s an immediate turn of possession.\n“Games are played anywhere from 13 to 15 points, usually 15 for the more competitive tournaments,” Blatt said. “Games last no longer than about 105 minutes total.”\nPlayers are required to wear cleats of their choosing (lacrosse, soccer, etc,), as long as they’re plastic turf cleats. Gloves and other additional gear is based on personal preference, and are individually provided. Gear and uniforms are not included in the club’s yearly dues.\nHow to become involved\nMost club members find out about the club team from Sparticipation or from word-of-mouth around campus.\nFreshman Marc Canellas had played ultimate at his summer camp, and was eager to continue playing once he got to MSU.\n“I went to Sparticipation, found their table and showed up to tryouts,” Canellas said. “It’s been a lot of fun, I’ve made a ton of friends and met a lot of cool people. It’s given me something to do too, instead of sitting in my dorm all day.”\nARC and Riot Control each contain three senior, more experienced captains and one junior captain to learn the leadership ropes of the club, in hopes of reaching the senior captain role in the future.\nAlthough Canellas is only a freshman, he hopes to take on a bigger role with the club team within the next three years.\n“Maybe in the future I'll be a captain, but right now, I’m just trying to be a part of the team first and improve my game,” Canellas said.\nProefrock has a unique experience, being both a transfer student and now a veteran member of the team. Proefrock played ultimate Frisbee throughout high school and began his collegiate ultimate Frisbee career at Eastern Michigan. He transferred after his freshman year to become a part of MSU’s more established and historically successful program.\nThe veteran has grown immensely since transfering, serving as a senior captain the past two years and taking on other leadership roles as well.\nThe team celebrated its accomplishment of overcoming the top ranked team in its region (Michigan), but is ready to take it up a notch in regionals, in order to qualify for Nationals.\n“It feels incredible to have that tic on my belt, just to say that I did that,” Proefrock said. “However, at the same time it feels like yeah, we did that but what’s next. It’s nice to be able to say that I accomplished that but it’s not the final goal. Our job’s not done..”",
  "word_count": 764,
  "scraped_at": "2026-02-14T13:09:10.118939"
}