{
  "article_id": "e7f6229033bf",
  "url": "https://www.chroniclelive.co.uk/news/north-east-news/lioness-jill-scott-opens-new-26201597",
  "title": "Lioness Jill Scott opens new football pitch named in her honour in Jarrow",
  "date": "20230210T011500Z",
  "domain": "chroniclelive.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Lioness Jill Scott opens new football pitch named in her honour in Jarrow\nThe Jill Scott Pitch was unveiled in a ceremony at the Perth Green Community Centre and is the first of 23 dedicated to Euro 2022 winners\nThe first of 23 grassroots football pitches named after England's Euro 2022 winning lionesses has been unveiled in the North East in honour of midfielder Jill Scott.\nThe 'Jill Scott Pitch' was unveiled in a ceremony at the Perth Green Community Centre in Jarrow alongside coaches and members of the local community. The new floodlit facility is just five miles from Jill's hometown of Sunderland and aims to support the growth of female, disability an recreational football in the local area.\nThe Lionesses became the first England football team to lift a major trophy since 1966 when they beat Germany 2-1 in the final at Wembley in July last year. Following that victory, the Footbal Association's Football Foundation, Premier League and the Government committed to naming grassroots facilities in honour of the squad as an effort to raise the profile of women's football and the elite level and increase access to women and girls participating at grassroots level.\nRead more: Jill Scott returns to Boldon Girls football club to visit aspiring Lionesses in BBC's We Are England\nJill Scott, MBE, said: \"It’s an absolute honour to have a site that will be used by so many people in the local community named after me in the place I used to play! Winning the Women’s EUROS was incredibly special and I hope, thanks to this recognition and funding from The Premier League, The FA and Government’s Football Foundation, this pitch will benefit Lionesses of the future.\"\nSue Campbell, the FA's Recitor of Women's Football, said: \"The England women’s team changed the landscape for the women’s and girls’ game when they lifted the UEFA Women’s EURO 2022 trophy last year. The success of the team wasn’t just about lifting the trophy, it was also about changing the path for women and girls who want to or currently play football up and down the country.\n\"By 2024 The FA want to see 5,000 good-quality pitches added to the current number. With the Football Foundation, we are prioritising the areas and communities where these new pitches are most needed.\n\"This project allows us to provide more opportunities for people to play football across the region. Jill Scott has had an incredible career and no doubt inspired many people in her hometown to take up the game, so I’m sure the ‘Jill Scott pitch’ will be extremely popular.\"\nRead next\n- The University of Sunderland strives to find the next generation of England Lioness cubs\n- BBC apologise for Sunderland's Jill Scott's angry reaction in England Euro 2022 final\n- Jill Scott joins Robson Green for paddle boarding adventure in North East BBC series\n- Jill Scott jokes she's 'going to complain' about Matt Hancock's £320,000 I'm A Celebrity fee\n- Newcastle United capacity could be boosted after Saudi owners buy back land Mike Ashley sold in 2019",
  "word_count": 512,
  "scraped_at": "2026-02-14T13:03:23.481686"
}