{
  "article_id": "e7f8d50c5613",
  "url": "https://wtug.com/ixp/532/p/west-alabama-wednesday-briefing-83/",
  "title": "West Alabama Wednesday Briefing",
  "date": "20241218T210000Z",
  "domain": "wtug.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "West Alabama Wednesday Briefing\nGood morning West Alabama. It is Wednesday, December 18, 2024.\nWednesday Morning Observations:\nChristmas Day is a week from today. For many of us the week in between will be busy going work or school, shopping for just the right presents, mailing last minute Christmas cards, grocery shopping and planning the family Christmas Day dinner. But among all the hustle and bustle I urge you to slow down and remember the \"reason for the season\".\nGod sent his son into this world for us, to save us from ourselves and to teach us to have compassion for others, At this important time of the year let us look outward for a bit at those in need.\nThere are numerous organizations collect funds, food and gifts for our neighbors who, through no fault of their own, are in need. One of those organizations in the Salvation Army.\nLast year, the organization provided more than 51,465 meals to those experiencing chronic hunger and provided 17,710 nights of shelter while serving thousands more through various programs and services.\nThe Tuscaloosa Salvation Army’s goal is to raise $80,000 this holiday season. They are short of that goal at this moment. So, take some time and look for a Salvation Army \"Red Kettle\" and bellringer. Drop in what you can spare or if you can't get to a kettle go online and give virtually, it is what the season is all about.\n(Opinions expressed in Morning Observations are not necessarily those of the ownership, management or staff of Townsquare Media Tuscaloosa.)\nWeather:\nIncreasing cloudiness is expected this afternoon with a line of showers moving across Central Alabama during the afternoon to evening hours. A few thunderstorms are possible, but they are not expected to reach severe levels.\nThe Forecast:\nTopping the News:\nA $1 million Cybersecurity Scholarship Grant has been made by Google to Stillman College. The contribution honors the memory of Kevin Lamar Harris who served as executive director of the HBCU Cybersecurity Clinic at Stillman College. He passed away on Oct. 5 at the age of 50.\nStaff, students and neighbors of Shelton State Community College's C.A. Fredd Campus got a treat yesterday and it was part of final exams. The annual “Chef’s Table Showcase” highlighted what students have been learning about food preparations and presentation and it was free.\nMore than 7,000 children will have a merrier Christmas in West Alabama due to \"Toys for Tots\". During the two-day distribution, each child will receive three age-appropriate gifts and three stocking stuffers.\nThe lowest threshold for a family of two to receive benefits through WIC is 728 dollars.\nWIC is open to pregnant women, women who had a baby within the past six months, breastfeeding moms, and children under five.\nUnder WIC, each child who qualifies can receive $26 a month to help pay for food.\nTopping Sports News:\nTonight's Alabama at North Dakota game is a homecoming of sorts for Tide Forward Grant Nelson. His hometown of Devils Lake is just a couple of hours from the arena. For that reason, Nelson told media he has been swamped with tickets requests from family and friends.\nNelson probably will not get a great welcome because he played for NDU's main rival North Dakota State before transferring to Alabama.\nA Winter Storm Watch is in effect for the Grand Forks, ND area through tomorrow. Total snow accumulations between 2 and 7 inches are possible. Winds could gust as high as 35 mph. The high today there is forecast at 9-degrees with a low of 3-degrees and a wind chill of -12-degrees. Grant advised his teammates to bring their overcoat.\nThe 6th ranked Crimson Tide (8-20 is coming off a big win against Creighton this past Saturday while the Fighting Hawks are 4-8 and enters the matchup on a three-game losing streak.\nTipoff is set for 8:00 tonight on the CBS Sports Network on TV and the Crimson Tide Sports Network on radio.\nTide football stars Tyler Booker and Malachi Moore continue to pile on the All-American accolades this season, with Booker being named an All-American by the FWAA, Associated Press, American Football Coaches Association, and the Walter Camp Football Foundation. Moore was named an All-American by the Associated Press and the AFCA.\nBoth players were named to Sporting News Second Team All American.\nRead More: Two Tide Stars Named Sporting News All-Americans\nFormer Florida EDGE Rusher Kelby Collins has Committed to Alabama according to various reports. Collins originally considered Alabama out of Gardendale High School.",
  "word_count": 755,
  "scraped_at": "2026-02-14T13:16:58.519754"
}