{
  "article_id": "e813b6464e2b",
  "url": "https://www.bostonglobe.com/2024/11/20/nation/linda-mcmahon-wwe-trump-administration/",
  "title": "Linda McMahon made a fortune with WWE . Wrestling scandals now shadow her rise . ",
  "date": "20241120T173000Z",
  "domain": "bostonglobe.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "In the wrestling ring, where the men are bare-chested and the women don’t wear much more, World Wrestling Entertainment CEO Linda McMahon always looked like she was on her way to a Chamber of Commerce meeting: hair perfectly coiffed, wearing statement jewelry and conservative pantsuits.\nShe periodically joined the show for wild narratives about her family in the 2000s, trading scripted blows with her adult daughter and - in one particularly vivid storyline - pretending to be drugged and in a wheelchair as her husband, WWE co-founder Vince McMahon, carried on an affair, later kicking him in the crotch as tens of thousands of fans roared.\nLinda McMahon resigned 15 years ago from WWE, leaving that televised spectacle behind as she sharpened her public image as a political power broker, donating tens of millions of dollars to Republicans, running for the U.S. Senate and leading the Small Business Administration during President-elect Donald Trump's first term.\nFEATURED VIDEO\nBut as she serves as a key adviser in Trump’s second term - co-chairing his transition and chosen to lead his Education Department - a lawsuit against Linda and Vince McMahon is bringing fresh scrutiny to long-running claims that they mistreated WWE workers. Vince McMahon is also facing separate allegations of sexual abuse and trafficking.\n“Linda is this well-spoken, congenial, bright, well-dressed woman executive, but she helped run a testosterone-fueled business that was seen as very sleazy for a long time,” said Dave Meltzer, a pro wrestling expert who has published a newsletter about the industry for decades. “That could be an issue for her, but Trump has so much baggage himself, and it seems that in politics these days, everything goes.”\nVince McMahon faces an ongoing federal investigation by the Southern District of New York into allegations that he used his position at the helm of WWE to commit and conceal sexual abuse and trafficking, according to a person familiar with the case who spoke on the condition of anonymity to discuss a law enforcement probe. Securities and Exchange Commission filings by WWE's parent company, TKO Group Holdings, show McMahon agreed to pay $14.6 million in connection to \"allegations of misconduct\" - money the Wall Street Journal reported was promised to women who accused him of sexual misconduct between 2006 and 2022. Vince McMahon also has been sued by a former WWE employee, Janel Grant, who is accusing him of sexual assault and of trafficking her to other men.\nAdvertisement\nLinda McMahon is not directly implicated in either of these cases.\nLinda and Vince McMahon face a separate civil suit filed in October by five anonymous plaintiffs who worked decades ago as \"ring boys,\" teenagers who helped set up WWE events. The plaintiffs claim the McMahons were aware they were being sexually abused by other high-ranking WWE employees and did not do enough to protect them.\nThe McMahons are currently separated, according to Linda's attorney, Laura Brevetti, who called the ring boys lawsuit \"baseless.\" Vince McMahon resigned from WWE one day after Grant's lawsuit was filed in January, and he has described the complaint as \"salacious, false and defamatory\" in court documents. He issued a statement in January that the federal probe wouldn't uncover any wrongdoing; representatives for him declined to provide further comment this week.\nTrump has not publicly commented on the allegations; he called Vince McMahon \"a fantastic guy, and one of the best ever\" in an interview last year, after details of the federal investigation had begun to surface but before Grant filed her lawsuit.\nThe newly aired allegations against the WWE founders, combined with the ongoing legal jeopardy facing Vince McMahon, are shadowing Linda McMahon's rise into the president-elect's inner circle. Trump campaigned on exercising more control over the Justice Department - claiming broad executive powers that collide with long-standing norms shielding criminal investigations from political influence - and he could try to intervene in the federal probe into Vince McMahon. A spokesman for the transition, Brian Hughes, declined to comment on the case.\n\"We have no control over what happens with any criminal investigation, but we have an unwavering will to see that Janel gets justice,\" said Grant's attorney, Ann Callis.\nAdvertisement\nLinda McMahon’s vast family wealth also could conflict with her public duties as the transition co-chair and on Trump’s Cabinet.\nTKO Group Holdings, for example, holds events in Saudi Arabia and Abu Dhabi, UAE, and according to its annual report, must comply with \"extensive U.S. and foreign governmental regulations.\" Vince McMahon is a minority shareholder whose stake is worth roughly $950 million; Linda McMahon owns about $67 million in stock. Their son-in-law is the WWE chief content officer.\nLinda McMahon is a director on the board of Trump Media & Technology Group, the parent company of Trump’s social media platform, Truth Social. McMahon was not paid in 2023 or 2022, but the board can award directors “stock as noncash compensation … from time to time,” according to SEC filings.\nBrevetti said McMahon would place her financial interests in a blind trust and resign from all outside positions and board memberships if she serves in the next administration. She was viewed as a front-runner for commerce secretary, but Trump on Tuesday instead chose his other transition co-chair, Howard Lutnick, and picked McMahon as education secretary, writing on Truth Social that she will use her \"deep understanding of both Education and Business\" to \"make America Number One in Education in the World.\"\nMcMahon, 76, is one of Trump’s most conventional Cabinet picks at a time when some Republican senators are questioning the viability of several of the president-elect’s other choices. As SBA head, she visited all of the agency’s 68 offices and avoided the taxpayer-funded travel scandals that dogged other members of Trump’s Cabinet by traveling on her private plane. She then led the America First Policy Institute, a conservative nonprofit that helped lay the groundwork for a second Trump term while averting the backlash against a similar effort by the Heritage Foundation’s Project 2025.\nAdvertisement\nAs co-chair of the transition, McMahon is helping to vet roughly 4,000 political appointees, who, under the president-elect's plan to gut the civil service, would lead a radically restructured workforce of more than 2 million people, many of whom could be fired at will. Trump and his transition team have discarded many protocols that typically guide the transfer of power, failing to sign ethics pledges, reach out to federal agencies or allow the FBI to vet appointees.\n“Linda answered the call, and is working tirelessly to support President Trump as he executes the agenda that an overwhelming majority of Americans endorsed,” Hughes said before Trump’s announcement late Tuesday that he’d picked McMahon for education secretary. “Linda’s leadership and hard work will ensure that President Trump’s wins for our nation start on Day 1.”\nGrowing questions about a wrestling empire\nLinda and Vince McMahon started working in the wrestling promotion business in the 1970s and built a publicly traded juggernaut employing hundreds of people. She was the poised business executive who negotiated media, television and merchandising deals, while he was the larger-than-life showman who handled the creative side. Linda served as chief executive from 1997 to 2009 and president from 1993 to 2000, while Vince chaired the board of directors, according to corporate records.\nThe McMahons have known Trump since the late 1980s, when WWE held its annual pay-per-view extravaganza, WrestleMania, at Trump Plaza in Atlantic City. Trump shaved Vince McMahon’s head on national television in 2007 after winning the “Battle of the Billionaires,” and Trump was inducted into the WWE Hall of Fame in 2013.\nAs WWE grew into a global empire, so did criticism of how it treated employees. The company classified wrestlers as independent contractors, which meant they did not receive health care and retirement benefits. WWE lobbied states in the 1980s to consider wrestling matches as entertainment, not as sporting events, allowing the industry to sidestep safety regulations. Former pro wrestlers who argued WWE failed to protect them from repeated head injuries unsuccessfully sought multimillion-dollar settlements like those offered by the National Football League and the National Hockey League.\nAdvertisement\nFollowing the deaths of several wrestling stars amid accusations of widespread abuse of steroids and other drugs, Linda McMahon testified before a House committee in 2007. “We have always been concerned about the health and welfare of our performers,” she said. But she acknowledged the company ended random steroid testing because “it was just no longer cost effective to random test across the large pool of talent that we had.”\nMcMahon left WWE in 2009 and moved directly into politics, spending about $100 million of her own money on unsuccessful campaigns for the U.S. Senate from her home state of Connecticut in 2010 and 2012. Her 2019 financial disclosure as SBA administrator shows hundreds of millions of dollars in investments - much of it at that time in WWE, but also in mutual funds, bonds and real estate in Connecticut, New York and Florida. She helped make Trump’s Cabinet the wealthiest in modern American history; she separated from numerous entities to avoid conflicts of interest.\nWhile she led the SBA, which partners with banks and credit unions to lend money to small businesses, employee ratings of their engagement and satisfaction rose, according to the nonpartisan Partnership for Public Service.\nAfter Trump's defeat in 2020, McMahon chaired the America First Policy Institute (AFPI) board as the group crafted plans for Trump's second term, including making it easier to fire career civil servants who resist the new president's policies and rescinding some antidiscrimination protections for gay and transgender people.\n“We were founded on God and faith and family and righteousness,” McMahon said in a podcast interview. “And I do think that we have lost a lot of those values.”\nAs Linda McMahon led the AFPI, her husband confronted sordid claims of sexual abuse.\nAdvertisement\nIn the summer of 2023, federal law enforcement agents executed a search warrant and served Vince McMahon with a federal grand jury subpoena, according to SEC filings by TKO. The investigation was first reported by the Wall Street Journal, which said the subpoena named Grant and four other women who reached financial settlements with McMahon in exchange for keeping quiet about his alleged sexual abuse.\nGrant's lawsuit, filed in January, said she was unemployed and living in the same apartment building as Vince McMahon when they met in 2019. He got her an entry-level job in the legal department and later promoted her to talent relations. Meanwhile, the lawsuit alleges in graphic detail, he was demanding Grant engage in sexual acts with him and other WWE employees and sharing sexually explicit photos and videos of her with other men. In 2021, she claims, Vince McMahon sexually assaulted her in another boss's office as the two men took turns forcing themselves on her and restraining her on a table.\nThe lawsuit seeks damages and the dissolution of a nondisclosure agreement. Grant said Vince McMahon pressured her into signing the agreement after he said he told his wife about their relationship, which he describes in court documents as \"a consensual relationship during which Defendant never coerced Plaintiff into doing anything and never mistreated her in any way.\" The court documents also show he agreed to pay her $3 million as part of the nondisclosure agreement.\nCourt records show the parties agreed to a six-month stay in the lawsuit, until Dec. 11, following what Grant's lawyer has called \"a request by the U.S. Attorney for the Southern District of New York...pursuant to a pending non-public investigation.\"\nTrump has condemned the criminal justice system that has indicted him four times as \"weaponized.\" As president, he offered clemency to scores of big donors and other close allies, and he has promised to pardon supporters convicted of crimes connected to the Jan. 6, 2021 attack on the U.S. Capitol.\nVince McMahon donated about $100,000 to the Republican National Committee during Trump’s first campaign, according to campaign records, while Linda McMahon has given tens of millions of dollars to his White House bids, including $15 million to a pro-Trump PAC in the 2024 cycle. The McMahons also donated $5 million to Trump’s now-defunct foundation.\n“I always have concerns if perpetrators who have used power over victims will be held accountable, and those questions are magnified when those people are in positions of great power and wealth,” said Bridgette Carr, a University of Michigan law professor and human trafficking expert. “At the core of sex trafficking is a power differential, and the legal system often exacerbates that.”\nIn the wake of Grant's lawsuit and a Netflix documentary released in September that scrolls through WWE scandals, five former \"ring boys\" filed a lawsuit in October alleging sexual misconduct by three WWE officials from the 1970s to the early 1990s. (All three officials have since died.) The plaintiffs allege that Vince and Linda McMahon knew about the abuse and didn't stop it. The lawsuit relies heavily on media coverage and court documents from a 1993 libel case against a New York Post sports columnist that was later dismissed.\nThough sexual harassment allegations against the three WWE officials have circulated for decades, no one has ever been criminally charged. A Maryland law that last year repealed the statute of limitation on filing lawsuits for child sex abuse opened the door for the suit in Baltimore County Circuit Court. The lawsuit cites a 1993 FBI investigation into sexual harassment allegations against a WWE ring announcer but says none of the alleged victims were willing to come forward at the time.\n“This lawsuit based upon thirty-plus-year-old allegations is filled with scurrilous lies, exaggerations, and misrepresentations,” said Brevetti, Linda McMahon’s lawyer.\nWWE declined to comment on the investigation or the two lawsuits. TKO Group Holdings did not respond to requests for comment.\nTrump heavily courted combat sports fans during his campaign. Dana White, who leads the Ultimate Fighting Championship martial arts company that is now merged with WWE under TKO, is a major Trump supporter who introduced him at the Republican National Convention. Trump attended a UFC event with White on Saturday and was spotted hugging the McMahons' son-in-law, the wrestler known as Triple H.\nDrew Harwell and Aaron Schaffer contributed to this report.",
  "word_count": 2374,
  "scraped_at": "2026-02-14T13:18:10.174797"
}