{
  "article_id": "e81cdbdc2139",
  "url": "https://nuclear-news.net/2025/01/23/",
  "title": "2025 January 23 « nuclear - news",
  "date": "20250123T083000Z",
  "domain": "nuclear-news.net",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Operation Stargate, the project to make AI an “essential infrastructure” .\nKoohan Paik-Mander. 22 Jan 25\nEach data center is filled from ceiling to floor with stacks of metal boxes — computers which process all the AI calculations, which are in the billions per second, and which cause the machines to heat up. To cool them, giant pipes filled with water snake through the basements of these buildings with capillaries of cooling liquid that branch off up to run alongside each of the machines. The water consumption for cooling data centers is enormous.\nEssentially, Elon Musk is rejiggering all of America’s society and economy to recalibrate itself around AI. We are expected to give up our land, water and dreams of a livable climate in order to make the data centers operational.\nI fear we will very soon be seeing a pivot from endless war on other countries to a focused crushing of the American people, under the banner of Operation Stargate, the project to make AI an “essential infrastructure,” like water or electricity. How that looks on the ground will be enormous data centers that are a half-million square feet each (the size of 2-1/2 Walmart Superstores or 8.5 football fields) constructed in clusters all over the nation. Wherever they are built, all nature perishes, because it is a wholesale smothering of the earth with concrete. They are now building ten of these data centers in Texas, as the first phase of this scourge on the American people. Each one of the ten uses between 20 to upwards of 100 megawatts of power. The entire island of Hawaii, where I live, uses 180 megawatts of energy. This is why they pulled the U.S. out of the Paris Accord, which would be an obstruction to the central plan of this administration to entrench AI infrastructure — arguably more central than deportations or building a wall.\nThey are proposing using federal lands as well, such as national parks, for these data centers. The first $500 billion was committed to their construction at the first Trump press conference. At the press conference, they didn’t mention any of the above. They just talked about how AI was going to cure cancer. It reminded me of the U.S. general telling the Bikini islanders that the atomic tests were to be “for the good of mankind.”\nEach data center is filled from ceiling to floor with stacks of metal boxes — computers which process all the AI calculations, which are in the billions per second, and which cause the machines to heat up. To cool them, giant pipes filled with water snake through the basements of these buildings with capillaries of cooling liquid that branch off up to run alongside each of the machines. The water consumption for cooling data centers is enormous.\nThey want to cover the continent with these data centers, much like the initiative to cover it with interstate highways. But I don’t see it like that. For me, it is like watching the tracks being lain that would guide train-cars full of Jews and other “undesirables” to the incinerators at Auschwitz and Dachau. It is like watching the gureombi at Gangjeong be blasted, only to be paved over to build a navy base. It is like watching the limestone forest on Guam be razed to construct the live-fire training range. It is like watching the farming villages at Pyeongtaek protest the construction of one of the largest U.S. bases in the world… So I’m used to watching the horror of autocracy smashing nature and community. Only difference is, now it’s in my own country.\n“This land is your land, this land is my land.” We used to sing that song in grade school — remember?\nOperation Stargate is building not only the hardware of this infrastructure; it is building the software as well. It seeks to fully automate government. It is a libertarian’s wet dream. Its planners in Silicon Valley saw their wealth balloon during the pandemic when everyone went online. The idea behind a fully automated civilization is to revive that scale of profit acceleration for Silicon Valley, by getting society online as much as possible. Remember how every meeting, every lesson, every funeral, every yoga lesson — everything — was done online? They want that back again, but with many added AI “bots”, and what better place to start than government? Just as all the schools were online during the pandemic, the plan is for all of government to be online. Soon, trying to get assistance from City Hall will be as challenging as talking to a person at Yahoo. Maybe they’ll farm out the humans who answer our phone calls to our virtual City Hall with a bunch of underpaid workers in the Philippines or India.\nBut full automation is not truly human-free. AI requires a constant stream of data to train it. Slave wage workers will be hired in Africa to “annotate”; that is, to sit at computers and click meaningless boxes to train the AI models. The American people will also play a role in training. We’ll be surrounded by a smart grid and smart meters, smart appliances, smart cars, smart air fryers, smart homes — everything “smart”, which really means connected to sensors that record our voices, our images, our behavior patterns and any shifts in the environment. Those recordings provide more data streams to feed AI. Did you know that the reason they no longer manufacture stick shifts is because the sensors can’t translate manual transmission into usable data?\nData is considered more valuable than money these days. In fact, the U.S. government pays for satellite rental (most likely to Musk’s Starlink) in data from surveillance.\nIn the AI world, the word “surveillance” refers not only to cameras and microphones, but any of the ways these sensors are extracting data. Interaction with government agencies will be more opportunities to collect our data. Every interaction will be surveillance. You see, an AI infrastructure cannot exist without a surveillance infrastructure, a surveillance state.\nThe most egregious proposal is called Medshield, which was proposed in Congress last term but is certain to return, because it would be a means for the much needed data extraction. It proposes to transform the Department of Health and Human Services into a biowarfare hub. Combined with the “AI first, regulation last” mentality of the incoming administration, it would amount to a full-spectrum assault on Nature and human rights.\nIntroduced by Sen. Mike Rounds (R-South Dakota), the bill came off the drawing board at the Special Competitive Studies Project (SCSP), a think tank founded by former Google CEO Eric Schmidt.\nThe bill’s stated purpose was to require a pandemic preparedness and response program. Couched in the euphemism “surveillance,” the bill’s passage would ultimately mandate the continual extraction of DNA samples from hundreds of millions of Americans in order to train AI models, ostensibly to track and monitor biological attacks, and to create antidotes for them. There has been some talk about nationalistically spinning this as “patriotism,” as if it were the postwar Victory Garden movement. But nothing in the bill’s text hints at the egregious Constitutional violations to privacy and individual agency that this would pose.\nNor does the Act explicate that, as a general rule, all supposedly “defensive” weapons can be inversely deployed for offense. Building an arsenal of millions of new synthetic life forms to defend against a biological weapons attack has the potential, if not the covert intent, to irreversibly unleash new viruses, bacteria, proteins and other organisms into the ecological systems. Case in point: we saw how the “defensive” development of the atom bomb played out.\nThe MedShield Act would employ technology that works with large-language model AI much in the same way that ChatGPT operates. The large-language model is comprised of a maze of networks with billions of artificial neurons. It is trained by inputting hundreds of millions, perhaps billions, of relevant data points. (This is why a surveillance state is essential for any nation wishing global AI dominance — to continually feed the AI’s hungry maw.) Once trained by the data set to recognize patterns and relationships, a query can be entered into the AI, which then processes it by making millions of calculations before spitting out its answer.\nFor example, generative AI could be queried to “make a Covid-like virus that doesn’t show symptoms until at least five days after contraction.” Or “what should go into a vaccine to inoculate against a flu virus that was engineered to last 30 days?” The possibilities for biological warfare are endless, which is why weapons technology companies like Palantir (maker of Gaza-tested Lavender AI) is studying how to use AI to create and mitigate biological threats. Los Alamos Labs is teaming up with Open AI to do the same.\nAccording to the SCSP, MedShield is necessary in order to keep ahead of China in the AI arms race. Here’s how the SCSP explains Medshield:What is MedShield? Imagine a system that could protect us from dangerous pathogens and bioweapons as effectively as our military would defend against inbound ballistic missiles (NORAD) or nuclear attacks (STRATCOM). That’s the idea behind MedShield. This potential national technology program is a bold, fully-integrated, AI-enabled system-of-systems that could neutralize a biological threat, whether from a state, non-state actor, or nature (biological threats go beyond pathogens into five basic types). MedShield would create one holistic “kill chain” against biological threats.\nIt is a discomfiting notion that protocols would be implemented that would connect our national healthcare department to the Pentagon, and would be modeled after the NORAD and STRATCOM war commands. Could a more sinister, inappropriate framing exist for the office charged with the well-being of our women, men and children? I think not.\nBecause all generative AI — not only MedShield — requires a surveillance infrastructure of continual data extraction. All that data could come from anywhere, both legally or, as is more often the case, surreptitiously from everyday citizens, indigenous peoples, prisoners, marginalized communities, or the Global South. The human-rights threats of an unregulated, comprehensive, AI-driven federal government would make the East German Stasi look like Munchkinland.\nEssentially, Elon Musk is rejiggering all of America’s society and economy to recalibrate itself around AI. We are expected to give up our land, water and dreams of a livable climate in order to make the data centers operational. We are expected to let our government transform into a data extraction apparatus. AI runs on energy, but it lives on data. It can’t live without extracting our data. Our role in society is being reduced to “data resource.” A commodity. If we serve AI, as is the plan, we are not citizens but slaves.\nThe endless war agenda of the Democrats will be allowed to wind down by Silicon Valley because they can make just as much money, if not more, installing infrastructures for domestic terror instead. Unlike the legacy warmongers like Lockheed and Raytheon, Elon Musk and his digital cabal don’t care who or what they destroy. Everything we are is fodder for their profit machine.\nThe only answer is to return to an embodied existence, offline. Ditch the digital. Resist smart anything. Oppose the AI-ification of government.\n26 January – WEBINAR Autonomous Armageddon: Nuclear Weapons and AI\nJoin us for a critical webinar on Sunday, January 26, at 2:00 PM GMT “Autonomous Armageddon: Nuclear Weapons and AI“, to explore the alarming dangers posed by the integration of artificial intelligence (AI) into nuclear weapons systems. Hosted by three Nobel Peace Prize-winning organizations dedicated to eliminating nuclear weapons, this event will feature expert speakers, including:\nModerator: Professor Karen Hallberg, Secretary General of Pugwash Conferences on Science and World Affairs, 1995 Nobel Peace Prize.\nRepresentative of Nihon Hidankyo, 2024 Nobel Peace Prize;\nProfessor Geoffrey Hinton, 2024 Nobel Prize Winner in Physics;\nConnor Leahy, CEO of Conjecture (AI safety research);\nDr. Ruth Mitchell, neurosurgeon and Chair of IPPNW, 1985 Nobel Peace Prize;\nMelissa Parke, Executive Director of ICAN, 2017 Nobel Peace Prize; and\nTogether, they will discuss the general and specific risks AI presents to nuclear command and control systems, the catastrophic humanitarian and environmental consequences of nuclear war, and ongoing initiatives to mitigate these threats. We invite you to participate in this vital discussion to address the intersection of AI and nuclear weapons.\nRegister here or below. A recording will be made available following the session.\nEurope posts record negative power prices for 2024 as renewables rise\nThe number of periods when day-ahead power prices fell to zero or below hit a record 4,838 instances in Europe in 2024, driven by surging renewables, weak demand, and limited grid flexibility, says Montel Analytics.\nPV Magazine January 21, 2025 Brian Publicover\nEurope recorded 4,838 periods of day-ahead power prices falling to zero or below in 2024, a record high driven by rising renewable generation, sluggish demand, and constrained grid flexibility, according to a new report from Montel Analytics. The total is nearly double the 2,442 instances that were recorded in 2023.\nThe Oslo-based market intelligence firm said that the increase was driven by surging wind and solar generation capacity, as well as sluggish demand and limited demand-side response mechanisms.\nFinland led in negative pricing at 721 hours, mainly due to high wind production and low grid interconnectivity with Sweden and Estonia, said Montel Analytics. It noted that solar oversupply in the Netherlands and wind output in Sweden also weighed on prices, while the Iberian Peninsula experienced negative prices for the first time during the second quarter of 2024.\nThe energy data specialist said that renewables accounted for 50.4% of Europe’s total power mix, which was an all-time high. Fossil fuels, meanwhile, dropped to less than 25% of the continental total.\n………………………Harreman also noted the widening price gap between solar peak and evening peak periods, as renewables displaced conventional generation.\nIndustrial demand remained below pre-pandemic levels, and rooftop solar continued to offset household electricity usage, said the company. It reported that total European electricity demand fell 7.7% year on year to 2,678 TWh, underscoring broader economic weakness, particularly in Germany. https://www.pv-magazine.com/2025/01/21/europe-posts-record-negative-power-prices-for-2024-as-renewables-rise/\n“A question arises in terms of nuclear power – should EDF give up its international ambitions?”\nThe Court of Auditors is concerned about the electricity company’s ability to support the French fleet renewal program, while it finds itself financially exposed in the costly British projects of Hinkley Point and Sizewell, notes Jean-Michel Bezat, journalist at “Le Monde”, in his column.\nHeavily indebted, the company has not yet finished\nwith its difficulties across the Channel, the Court of Auditors recalled in\na report published on Tuesday, January 14: “The EPR sector: new dynamics,\npersistent risks”. The commissioning of the British plant is already five\nyears behind schedule. The additional cost has reached around 12 billion\neuros since 2019, while the departure of the Chinese group CGN, linked to\ntensions between London and Beijing, is creating a “worrying financing\nconstraint” . EDF has had to depreciate 11 billion euros of assets, and the\nvery profitability of the project is at stake.\nLe Monde 20th Jan 2025 https://www.lemonde.fr/idees/article/2025/01/20/une-question-s-impose-en-matiere-de-nucleaire-edf-doit-il-renoncer-a-ses-ambitions-internationales_6506629_3232.html\nIt is only a matter of time before nuclear development at Bradwell falls by the wayside.\nEnergy and the role of nuclear power\n7 January 2025, Andrew Blowers, Emeritus Professor of Social Sciences, Open University and Chair of BANNG considers this topic in the January 2025 column for Regional Life magazine\nAt the beginning of 2024, the Conservative Government published its Civil Nuclear: Road Map to 2050, proclaiming its commitment to recovering the UK’s global leadership in nuclear power. The Road Map was gung-ho for big nuclear at Hinkley Point C (still unfinished) and Sizewell C (still looking for investors just to get started); plus a fleet of Small (in fact rather large) Modular Reactors chosen by competition (still awaiting the winning design); and the (vanishingly) distant prospect of a raft of Advanced Modular reactors, including fusion (that tantalisingly evanescent Holy Grail of nuclear fulfilment)\nIt was the accompanying New approach to siting beyond 2025 which most attracted our attention. The Government proposed a developer-led approach, in effect a market free-for-all where developers are invited to find suitable sites for new nuclear power stations. At the same time, six sites identified back in 2011, including Bradwell, were carried forward as having ‘inherent positive attributes’ potentially suitable for consideration.\nBANNG commented that developers would be unlikely to ‘identify sites beyond those that are being dangled in front of them already’. Yet again, we were at pains to stress that the Bradwell site is simply unsuitable and does not possess any of these ‘positive attributes’, least of all widespread public support. At a meeting with the then Minister for Energy, I made it crystal clear that there is widespread deep and extensive opposition from the local communities around the Blackwater.\nA change of Government brought no change in nuclear policy; if anything Labour is even more effusive in its support for nuclear as essential in providing clean, stable and reliable power.\nOnce again, BANNG took up the challenge. With Stephen Thomas, Emeritus Professor of Energy Policy at Greenwich University, I wrote a paper exposing the ‘Great British Nuclear Fantasy’ which formed the basis of a discussion with the Minister for Energy, Lord Hunt.\nWe stressed that any expansion of nuclear power would be ‘too expensive, unrealistic but above all, simply unachievable’. There were no sites yet available for nuclear projects, least of all Bradwell. In response Lord Hunt reassured us that we were not ‘blockers’ and had presented a reasoned, professional argument which, to give him credit, he listened to.\nClimate Change\nAs the impacts of Climate Change (CC) are becoming more evident it is ever more obvious that sites like Bradwell are wholly unsuitable for major infrastructures like nuclear power stations or big transformers. During the year BANNG helped to lead a series of workshops with the Office for Nuclear Regulation (ONR), responsible for the safety of nuclear plants, on the implications of CC for nuclear regulation.\nThe ONR confirmed that our work had been a significant influence on its understanding of CC. BANNG asserted that CC makes Bradwell the least suitable of all the sites currently in the ring for nuclear development. BANNG has urged the Chief Executive of ONR ‘to resist the presumption that Bradwell is an acceptable site and to declare that it should be withdrawn from further consideration’.\nBANNG ended the year with a further challenge, this time to Great British Nuclear\n(GBN), the body responsible for pushing forward nuclear development, inviting\nit to confirm that any proposals ‘will be subject to scrutiny and consultation through\nthe open, democratic and participative processes of public engagement.’\nOur conclusion is that despite all the rhetoric, the nuclear programme is stuttering\nand Climate Change may well seal its fate. It is only a matter of time before\nnuclear development at Bradwell falls by the wayside.\nA new report from the International Energy Agency is bullish on the global nuclear sector, but only if obstacles like cost overruns are addressed.\nUK’s Sizewell C Nuclear Developers Contest £40B Cost Estimate\nJanuary 21, 2025, Primary Author: Gaye Taylor\nAs French nuclear developer EDF and the UK government dispute recent assertions that the planned Sizewell C nuclear power station in Suffolk will cost £40 billion to build, a new report from the International Energy Agency is bullish on the global nuclear sector, but only if obstacles like cost overruns are addressed.\nSources “close to the negotiations” recently pegged building costs for the not-yet-approved 3.2-gigawatt station at £40 billion, double the estimate given by EDF and then-prime minister Boris Johnson’s Conservative government back in 2020, reports the Financial Times.\n“Surging construction costs as well as the implications of delays and cost overruns at sister site Hinkley Point C” were cited as reasons behind the price spike, writes FT. “The higher estimate is likely to raise questions over the government’s strategy for a nuclear power revival, at a time of stretched government finances and cost-of-living concerns,” the London-based daily adds.\n……………………………….A spokesperson for the UK’s Department for Energy Security and Net Zero described the £40-billion figure as “speculative” since discussions with potential investors are ongoing.\nFor its part, France’s state auditor has warned EDF against making any final investment decision on Sizewell C “until it has reduced exposure” to Hinkley Point, reports City AM.\nResponding to the auditor, EDF Chair and CEO Luc Rémont said the Labour government has taken charge of financing for Sizewell C, and that his company now holds less than a 20% equity share in the project.\nLabour Party donor and UK wind entrepreneur Dale Vince is among those warning that Sizewell C will cost too much to build, whoever builds it, with the costs invariably passed on to the ratepayer.\nSizewell “will saddle consumers with higher bills long before it delivers a single unit of electricity,” Vince said in a recent letter to the government’s new Office for Value for Money, reports FT.\nWhitehall is expected to make a final investment decision about Sizewell C later in the year.\nReports of the potential doubling of estimated costs for Sizewell C landed as the International Energy Agency issued a new report on the future of the global nuclear sector. Titled “The Path to a New Era for Nuclear Energy”, the report finds nuclear power “set to reach a new record in 2025”, with consequent improvements in energy security as electricity demand accelerates.\nTo achieve success, however, the report says, “Costs, project overruns, and financing must be addressed.”\nhttps://www.theenergymix.com/uks-sizewell-c-nuclear-developers-contest-40b-cost-estimate/\n-\nArchives\n- February 2026 (141)\n- January 2026 (308)\n- December 2025 (358)\n- November 2025 (359)\n- October 2025 (376)\n- September 2025 (258)\n- August 2025 (319)\n- July 2025 (230)\n- June 2025 (348)\n- May 2025 (261)\n- April 2025 (305)\n- March 2025 (319)\n-\nCategories\n- 1\n- 1 NUCLEAR ISSUES\n- business and costs\n- climate change\n- culture and arts\n- ENERGY\n- environment\n- health\n- history\n- indigenous issues\n- Legal\n- marketing of nuclear\n- media\n- opposition to nuclear\n- PERSONAL STORIES\n- politics\n- politics international\n- Religion and ethics\n- safety\n- secrets,lies and civil liberties\n- spinbuster\n- technology\n- Uranium\n- wastes\n- weapons and war\n- Women\n- 2 WORLD\n- ACTION\n- AFRICA\n- Atrocities\n- AUSTRALIA\n- Christina's notes\n- Christina's themes\n- culture and arts\n- Events\n- Fuk 2022\n- Fuk 2023\n- Fukushima 2017\n- Fukushima 2018\n- fukushima 2019\n- Fukushima 2020\n- Fukushima 2021\n- general\n- global warming\n- Humour (God we need it)\n- Nuclear\n- RARE EARTHS\n- Reference\n- resources – print\n- Resources -audiovicual\n- Weekly Newsletter\n- World\n- World Nuclear\n- YouTube\n-\nRSS\nEntries RSS\nComments RSS",
  "word_count": 3802,
  "scraped_at": "2026-02-14T14:16:14.393549"
}