{
  "article_id": "e831b6e03855",
  "url": "https://www.pressherald.com/2024/03/20/wednesdays-college-roundup-grambling-state-wins-first-four-game-in-ot-88-81/",
  "title": "Wednesday college roundup : Grambling State wins First Four game in OT , 88 - 81",
  "date": "20240321T014500Z",
  "domain": "pressherald.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "DAYTON, Ohio — Jimel Cofer scored all 19 of his points in the second half and overtime and Grambling State rallied from a 14-point deficit to beat Montana State 88-81 to earn its first NCAA Tournament win in program history in the First Four on Tuesday night.\nThe Southwestern Athletic Conference champion Tigers (21-14) advance as the No. 16 seed in the Midwest Region to play No. 1 seed Purdue on Friday night in Indianapolis.\nRobert Ford III made his fifth 3-pointer of the game to tie the game at 78 for the Big Sky Conference tournament champions with 2:02 left in overtime, but Grambling iced the game from the free-throw line with eight straight points.\nMontana State (17-18) went 1 of 6 in the final 1:27.\nBurnett and Jourdan Smith had 18 points apiece for the Tigers.\nGrambling State, which was playing in the NCAA Tournament for the first time despite a 2-10 start to the season, rode a second-half surge going on a 21-6 run erasing its 42-33 halftime deficit. Cofer, who didn’t play in the first half, flipped in a layup as part of an individual 6-0 run giving the Tigers their first lead of the second half 60-59 with 5:47 remaining in regulation.\nCofer laid in a tying score with 34 seconds left to knot it at 72, and Montana State’s Brandon Walker missed a potential go-ahead layup with 9 seconds left to send the game to overtime.\nMARQUETTE: Coach Shaka Smart says star guard Tyler Kolek has been practicing in 5-on-5 drills this week as the 2023 Big East player of the year gets ready to return from an oblique injury.\nKolek has missed Marquette’s last six games, but Smart has expressed confidence the Associated Press All-America second-team selection would be back for the NCAA Tournament. Marquette (25-9), the No. 2 seed in the South Region, faces Western Kentucky (22-11) on Friday in Indianapolis.\n“He has gone live, he has gone 5-on-5 up-and-down fullcourt,” Smart said before the team left campus. “He’s done a lot of good things.”\nKolek has 7.6 assists per game to rank second among all Division I players. The 6-foot-3 guard also is averaging 15 points and 4.7 rebounds.\nHe injured his oblique during a 91-69 victory over Providence on Feb. 28. Marquette went 3-3 in the games Kolek missed, with two of the losses coming to NCAA Tournament No. 1 seed UConn.\nFLORIDA A&M: Florida A&M University is moving on from Coach Robert McCullum after seven seasons.\nFlorida’s only public historically Black university announced that it will not renew McCullum’s contract, which expires at the end of June.\nMcCullum went 67-133 during his tenure with the Rattlers, including a 53-61 mark in conference play. The team finished 6-23 this past season. McCullum was named the Mid-Eastern Athletic Conference Coach of the Year in 2021.\nWOMEN’S BASKETBALL\nPRESBYTERIAN 49, SACRED HEART 42: Mara Neira made sure Presbyterian’s first NCAA Tournament game was memorable, scoring 14 points, including two free throws with 26.1 seconds left, as the Blue Hose beat Sacred Heart in the First Four at Columbia, South Carolina.\nThe Big South Tournament champions earned a Friday rematch with top-ranked South Carolina, which administered a 99-29 beatdown on this same floor on Dec. 16. Presbyterian is the smallest school in the tournament with 955 undergraduates in 2022-23.\nLast year, Sacred Heart won the first NCAA Tournament game for a Northeast Athletic Conference team with a 57-47 win over Southern.\nThe Blue Hose won the battle of 16-seeds with defense, limiting Sacred Heart, which had won 15 straight games, to 25% shooting, including 3 of 23 from 3-point range.\nBryanna Brady added 12 points for Presbyterian (21-14), which had to beat three higher seeds in the Big South tourney to extend its season.\nALL-AMERICA: Caitlin Clark has been a mainstay on The Associated Press All-America team the past few seasons.\nThe NCAA’s all-time scoring leader from Iowa was honored for the third straight year, becoming the 11th player to earn the distinction three times. She was a unanimous choice from the 35-member national media panel that chooses the AP Top 25 each week.\nClark was joined on the first team by Stanford’s Cameron Brink, UConn’s Paige Bueckers and freshmen JuJu Watkins of USC and Hannah Hidalgo of Notre Dame. They are only the fourth and fifth freshmen to make the AP team since it began in 1994-95, joining Oklahoma’s Courtney Paris, UConn’s Maya Moore and Bueckers.\nIndiana’s Mackenzie Holmes of Gorham was selected on the third team.\nGEORGETOWN: Darnell Haney was promoted to head coach after one season in an interim role succeeding the late Tasha Butts.\nHaney has led the Hoyas to a 22-11 record — their most wins since the 2010-11 season — including a run to the Big East Tournament championship game and a berth in the first Women’s Basketball Invitation Tournament. Georgetown plays Washington in the first round on Thursday night.\nHaney came to Georgetown before this season as the associate head coach for Butts, who was hired last April but died of cancer in October at age 41 before coaching a game.\nFOOTBALL\nSOUTH CAROLINA: Former Alabama head coach and quarterback Mike Shula will serve an an offensive analyst at South Carolina this season.\nGamecocks offensive coordinator Dowell Loggains said Shula, most recently an offensive assistant for the NFL’s Buffalo Bills, recently joined the program and was with the team when it opened spring football on Tuesday.\nShula, the son of late NFL coaching wins leader Don Shula, played quarterback for the Crimson Tide in the 1980s, then served as Alabama head coach from 2003-06.\nShula takes over for Sean Ryan, a longtime NFL coach who spent last season as a Gamecocks offensive analyst. Ryan returned to the NFL with the Miami Dolphins.",
  "word_count": 966,
  "scraped_at": "2026-02-14T14:09:37.470329"
}