{
  "article_id": "e872e4b7b571",
  "url": "https://themaneland.com/2025/05/10/orlando-pride-vs-north-carolina-courage-preview-how-to-watch-tv-info-live-stream-lineups-match-thread-and-more-25/",
  "title": "Orlando Pride vs . North Carolina Courage : Preview , How to Watch , TV Info , Live Stream , Lineups , Match Thread , and More",
  "date": "20250510T173000Z",
  "domain": "themaneland.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Orlando Pride\nOrlando Pride vs. North Carolina Courage: Preview, How to Watch, TV Info, Live Stream, Lineups, Match Thread, and More\nThe Pride look to bounce back from a tough loss in Portland when they visit the North Carolina Courage Saturday.\nWelcome to your match thread as the Orlando Pride (5-2-0, 15 points) face the North Carolina Courage (2-3-2, 8 points) in Cary, NC. This is the first of two games the teams will play this season. The return game in Orlando is scheduled for Sept. 19.\nHere’s everything you need to know about tonight’s game.\nHistory\nThe Pride and Courage have played 26 times since the Western New York Flash moved to North Carolina and became the Courage in 2017. The Pride are 6-13-7 in those games (6-10-2 in the NWSL regular season, 0-0-2 in the Fall Series, 0-3-2 in the NWSL Challenge Cup, and 0-0-1 in the NWSL x Liga MX Femenil Summer Cup.)\nThe most recent meeting between the two teams was on July 20, 2024, in the NWSL x Liga MX Femenil Summer Cup in North Carolina. Manaka Matsukubo gave the hosts the lead just before halftime before Celia equalized late for the Pride. The game went into penalties where the Courage won 5-4.\nThe Pride were the better team on June 15, 2024, with more possession, shots, and shots on target, but the game ended in a scoreless draw. While they were disappointed with the result, the Pride were the first team to take points in North Carolina in 2024. Earlier in the season, on May 1 in Orlando, Barbra Banda and Ally Watt started up top together for the first time, a move that paid off in the game. Banda set up Watt for the opener in the first half, and Watt repaid the favor just over 10 minutes later, as the Pride went up 2-0. Julie Doyle added a goal just before halftime, giving the Pride a commanding lead. Emily Sams’ own goal was the only scoring for the Courage and Banda’s second of the night gave the Pride a 4-1 win.\nThe first game between the Pride and Courage in 2023 was on April 19 in Orlando. The Pride took the lead after halftime when Summer Yates set up Watt for the opening goal, but Denise O’Sullivan equalized in the ninth minute of second-half injury time, resulting in a 1-1 draw. On June 17 in North Carolina, it was all Courage. Kerolin and Meredith Speck gave the hosts a 2-0 lead before a Haley McCutcheon own goal made it 3-0 to North Carolina.\nThe Pride didn’t show up for the July 29 Challenge Cup contest in North Carolina, getting demolished by the Courage. Brittany Ratcliffe and Malia Berkely gave the hosts a 2-0 halftime lead before Frankie Tagliaferri made it three, and a late brace by Haley Hopkins completed the 5-0 result. The Pride finally got a win that year on Sept. 17, 2023 at home. Watt got the Pride off to a great start, scoring inside the first minute. After assisting on the first goal, Adriana doubled the lead before halftime. Manaka Matsukubo got one back for the visitors, but it wasn’t enough and the Pride won 2-1.\nThe first meeting in 2022 came on May 18 in North Carolina. The Pride got off to a great start in that game, with Sydney Leroux scoring early. Mikayla Cluff doubled the lead with her first professional goal. A late goal by Brianna Pinto got the Courage back within one, but it wasn’t enough as the Pride took the 2-1 win. On Sept. 21, 2022, at Exploria Stadium, it was the Courage that got off to the better start when Debinha scored in the second minute. The Brazilian then assisted Tess Boade in first-half injury time to double the lead, and later added another, dooming the Pride to a 3-0 defeat.\nThe Pride and Courage were placed in the same division for the 2022 NWSL Challenge Cup, so the teams played twice before the regular season started. The first game was on March 26 in North Carolina. Merritt Mathias converted a penalty after Gunny Jonsdottir was called for a handball in the box, lifting the hosts to a 1-0 win. The return match in the tournament took place on April 16 in Orlando. The Courage got off to a fast start, scoring three goals in the first nine minutes. Darian Jenkins netted a brace to make it 3-2, but a late Debinha goal put the game away and North Carolina won 4-2.\nThe teams played three times during the 2021 NWSL season. On May 22 in North Carolina, goals by Leroux and Alex Morgan gave the Pride a 2-0 lead late into the game. Jessica McDonald scored late to pull one back but the Pride held on for a 2-1 win. On July 4 in Orlando, Debinha and Havana Solaun goals helped the Courage take home a 2-0 win. The final game was played July 31 in North Carolina. Leroux opened the scoring but Brittany Ratcliffe equalized moments later and the teams drew 1-1.\nThe two teams were also matched up in the 2021 NWSL Challenge Cup but they only played once in that tournament. Neither team was able to find the back of the net in that game in a scoreless draw.\nSimilar to the Challenge Cup, the teams were in the same group of the 2020 Fall Series, meeting twice. The first was on Sept. 19 in North Carolina and ended in a scoreless draw. The second was on Oct. 17 at Exploria Stadium. Led by a Debinha brace, the Courage went up 3-0. But the Pride came back with goals by Marisa Viggiano, Kristen Edmonds, and Ally Haran for an exciting 3-3 draw.\nThe Pride and Courage played three times during the 2019 season. The first game was on April 17 in North Carolina. The Courage took a 1-0 lead into halftime but scored four times in the second half to win 5-0. They played a second time on June 1 in Orlando. Again, it was a dominant performance by the Courage as the Pride fell 3-0. The final meeting that year was another thrashing by North Carolina. The Pride got a goal in that one but still fell 6-1.\nThe teams also met three times in 2018 but the results were much closer. On May 23 in Orlando, goals by Alanna Kennedy and Rachel Hill saw the Pride come back from a 3-1 deficit. But McDonald scored a winner in the 90th minute and the Courage won 4-3. The Pride went down by three goals in the final two games that season, but were unable to come back and fell 3-0 in both contests.\nThe 2017 season saw the teams meet for the first time. The Courage took the first game 3-1 on April 29 in North Carolina. They played a second time two weeks later in Orlando when the Pride took the 3-1 win. The final meeting in 2017 came in the final game of the season on Sept. 30. The Pride took a 2-0 lead but the Courage came back to even it at 2-2. It looked headed for a draw until Kennedy netted a late winner, leading the Pride to a 3-2 win.\nOverview\nThis season certainly isn’t the record-breaking start the Pride had last year, but they’re still one of the teams to beat in the NWSL. The defending champions won their first four games before falling 1-0 to the Washington Spirit in a disappointing performance. It looked like they would see their first losing streak when they fell behind 2-0 to Angel City FC, but scored three goals in the final 20 minutes to take all three points.\nUnfortunately, the winning didn’t last long. The Pride followed the come-from-behind win with a trip across the country to face the Portland Thorns. With a long flight and on artificial turf, Pride Head Coach Seb Hines made several changes to the team, including giving rookie Zara Chavoshi her first start. Reyna Reyes’ goal was the difference as the Pride fell 1-0 for their second loss of the season.\nDespite the loss, the Pride remain in first place, tied with the Kansas City Current on points, goals scored, and goals conceded. This is the finale of a two-game road trip before they return home to face the same Current team in a highly anticipated Friday night clash at Inter&Co Stadium.\nThe Pride are led offensively by Banda with four goals. Marta follows with three goals, McCutcheon has two, and Watt has one goal. The assists have been spread evenly with Marta, Oihane, Morgan Gautrat, and Banda all recording one.\nThe defense has been the strong point for most of the season, recording shutouts in three of the first four games. The 3-2 win over Angel City is the only time the Pride have conceded multiple goals in a game, with the two losses being 1-0 results.\nThere was a question who would start in goal tonight, as starting goalkeeper Anna Moorhouse left the game in Portland with a head injury. McKinley Crone did well in her place, playing nearly the entire second half. But Moorhouse is not on the availability report and is expected to return to action tonight.\nThe Courage currently sit in ninth, three points below the final playoff spot. They got off to a slow start but have been hot in recent weeks. It started with a 3-2 win on April 26 over the then-undefeated Current for their first win of the season. They followed that with a 2-0 win over the Utah Royals on May 3.\nDespite having firepower with the likes of Ashley Sanchez and Jaedyn Shaw, the Courage have struggled a bit offensively, scoring eight goals in seven games. They’ve been much better defensively. They’ve conceded nine goals this year, but five of those were against the Current and NJ/NY Gotham FC, two of the best attacking teams in the league.\nSanchez leads the team with two goals this season. Ryan Williams, Kaleigh Kurtz, and Riley Jackson have one each. Williams, Speck, O’Sullivan, and Matsukubo lead the team assists so far this season, but each has just one.\nThe big concern for the Pride entering tonight’s game is on the offensive end. While they lead the league with 14 goals scored, six of those came in the season opener against the Chicago Stars. Meanwhile, they’ve been kept off the scoresheet in two of the last three games. To claim three points away from home, they’ll have to beat one of the league’s top goalkeepers in Casey Murphy.\n“Always a difficult place to go play historically. It’s always been a challenge there, the way that North Carolina likes to play,” Hines said about tonight’s game. “They’ve found some form in the last two games as well. We’re looking to bounce back from our recent result as well, so it’s an exciting game.”\nThe Pride go into this game with an unchanged availability report. They remain without Simone Charley (ankle), Luana (illness), Amanda Allen (shoulder), Aryssa Mahrt (knee), Julie Doyle (knee), Rafaelle (thigh), and Summer Yates (ankle).\nThe Courage will be without Berkely (leg), Sydney Collins (ankle), Hensley Hancuff (excused absence), and Olivia Wingate (leg). Speck (lower body) is listed as questionable.\nProjected Lineups\nOrlando Pride (4-2-3-1)\nGoalkeeper: Anna Moorhouse.\nDefenders: Kerry Abello, Kylie Nadaner, Emily Sams, Cori Dyke.\nDefensive Midfielders: Haley McCutcheon, Morgan Gautrat.\nMidfielders: Angelina, Marta, Prisca Chilufya.\nForward: Barbra Banda.\nNorth Carolina Courage (3-4-3)\nGoalkeeper: Casey Murphy.\nDefenders: Natalia Staude, Kaleigh Kurtz, Maycee Bell.\nMidfielders: Feli Rauch, Riley Jackson, Denise O’Sullivan, Ryan Williams.\nForwards: Shinomi Koyama, Manaka Matsukubo, Ashley Sanchez.\nReferees\nREF: Brad Jensen.\nAR1: Katarzyna Wasiak.\nAR2: Melissa Beck.\n4TH: John Rush.\nVAR: Danielle Chesky.\nAVAR: Kevin Huet.\nHow to Watch\nMatch Time: 7:30 p.m.\nVenue: First Horizon Stadium at WakeMed Soccer Park — Cary, NC.\nTV: Ion.\nStreaming: Prime Video.\nSocial Media: For live updates and rapid reaction, follow our David Rohe on Bluesky or the Orlando Pride’s official Twitter feed (@ORLPride).\nEnjoy the game. Go Pride!\nOrlando City\nOrlando City, Orlando Pride Remain Hidden During Preseason\nOrlando City and the Orlando Pride continue the odd policy of hiding information from fans as they prepare for the upcoming seasons.\nAs preseason continues for Orlando City and the Orlando Pride, little is known about the progress the team is making in their preparations for the upcoming seasons. But it wasn’t always that way. The club used to be quite open about their preseason scrimmages. The social media accounts would provide lineups, substitutions, goals, and other game updates, allowing fans to follow along.\nBut there was more.\nWhen the Wilf family took over ownership, they opened the doors to the club during preseason. In 2022, two games were open to season ticket members and both teams had a preseason game open to all fans and media.\nThe club continued providing an open preseason game for both teams in 2023, giving a chance to see the teams in action before the regular season started. However, less and less access has been provided to the outside world since then.\nThe 2024 season saw the open preseason games removed for both City and the Pride. The Lions had an FC Series game against Flamengo before camp began and a late game for Society XXI members. Last year, the Lions started with an FC Series game again, this time against Atletico Mineiro. They ended with a season ticket member game.\nThe club released very little information other than the FC Series contest. That leads us to this preseason, in which the club has been as tight-lipped as it has been since the Wilf family took charge of the club.\nThere has been even less information about the Pride. Since Seb Hines became the permanent head coach leading into the 2023 season, the club doesn’t even provide an official preseason schedule anymore.\nWhile the club at one time provided updates on games and opened one to media and at least season ticket members, you’re lucky to even get a reference that the team still exists. The occasional photo is the only way fans know the team has even begun preseason.\nThe lack of availability during preseason is quite unique to American soccer. Other major American sports — the NFL, MLB, NBA, and NHL — allow fans and media to attend their preseason games. Soccer teams from other countries also sell tickets to preseason games and local fans often travel abroad, following the team.\nAlso, not all MLS teams are this quiet as they prepare for the season. On Sunday, for example, the LA Galaxy live streamed a scrimmage against the Chicago Fire.\nOrlando City played Nashville SC in a scrimmage Saturday afternoon. The opposition provided lineups, substitutions, goals, and other updates throughout the contest. The only thing they didn’t offer was Orlando CIty goal scorers, something likely requested by the Lions.\nBut what advantage does Orlando City gain from this?\nIt could be argued that the club is working on tactics and doesn’t want to give anything away. But it hasn’t been like that in the past, and that argument doesn’t hold water when you see teams that routinely are more open about their preseasons making deep playoff runs.\nOscar Pareja made the most significant tactical change since arriving in Orlando during the 2024 preseason. He moved attacking midfielder Dagur Dan Thorhallsson to right back and put either David Brekalo or Wilder Cartagena at left back. The team played five in the back defensively and three in the back while in the attack. It was a significant change, but the club still provided information to fans.\nIn today’s sports world, fans have more access than ever before. Television networks and streaming services regularly give fans a behind-the-scenes look at some of the most popular sports teams in the world. These programs aren’t the teams or leagues showing gratitude to fans. They’ve realized that giving fans this glimpse makes them feel more connected to the teams they follow and builds a buzz heading into the season. As a result, they’re more likely to watch games on television or attend games in person.\nUnfortunately, Orlando fans aren’t getting that connection anymore. The excitement for the start of preseason is nearly gone, because City and Pride fans know they’ll receive little, if any, information until the season begins.\nThe club will argue that it provides several experiences for all fans leading up to the regular season opener — from public jersey unveilings to drinks with coaches and players. But what would help build fan excitement about the upcoming season would be the ability to see the team in action and catch glimpses of new signings. Or at least to know how they’re progressing.\nWhether the club’s habits revert to how they were just a couple of years ago remains to be seen. There’s definitely an appetite as The Mane Land and other outlets regularly field requests from fans looking for any possible information. But even those that cover the club regularly are kept at a distance.\nFor the time being, fans will have to be content with the occasional player signing, community event, and photo from a scrimmage the club may or may not admit is happening. And they’ll continue to count down until Orlando City’s first MLS game on Feb. 21 and the Orlando Pride’s first NWSL game on March 15.\nOrlando Pride\nThe Pride Need to Tie Barbra Banda to Their HIP\nA look at the NWSL’s new High Impact Player classification, and how the Pride might allocate those funds.\nIs it just me, or has the off-season seemed even longer than usual this year? It feels like forever since any of the Orlando clubs played a match, and while we are getting social media pictures and videos from their respective preseasons, we are still weeks away from the season openers. The off-season just seems to keep going and going.\nIt reminds me of “Rapper’s Delight,” the 1979 song that is often cited (incorrectly, but that is a story for another time and website) as the first-ever hip hop song. It’s a 14-plus-minute audio experience that also just seems to keep going and going, and it starts off with one of the most well-known lines in contemporary pop music: “I said a hip hop, the hippie, the hippie to the hip, hip hop and you don’t stop.”\nThe hips that Wonder Mike was rapping about are not the same ones that were in the news recently, as those are not hips but HIPs, as in High Impact Players — the NWSL’s new roster mechanism (introduced in December) that will allow teams to go beyond the salary cap to sign certain players to much higher salaries than previously.\nWithout belaboring over the details, a simple definition for a HIP is that the player must have met at least one classification from the list below:\n- 2025 SportsPro Media Top 150 Most Marketable Athletes.\n- 2025 Ballon d’Or voting (top 30 players).\n- 2024 Ballon d’Or voting (top 30 players).\n- 2025 Guardian Top 100 football players in the world (top 40 players).\n- 2024 Guardian Top 100 football players in the world (top 40 players).\n- 2025 ESPN FC Top 50 football players in the world (top 40 players).\n- 2024 ESPN FC Top 50 football players in the world (top 40 players).\n- 2025 minutes played for the USWNT (top 11 field players, top goalkeeper).\n- 2024 minutes played for the USWNT (top 11 field players, top goalkeeper).\n- 2025 NWSL MVP Finalists.\n- 2024 NWSL MVP Finalists.\n- 2025 End of Year NWSL Best XI First Team.\n- 2024 End of Year NWSL Best XI First Team .\nAs of December 2025, The Equalizer reported there are 102 players around the world who qualify, though that number is fluid because some of the 2024 lists will be replaced by new lists, once they are released. The Pride currently have two players on the roster who are HIP eligible: Barbra Banda and Marta, each of whom qualified under eight of the 13 possible qualifications, though in reality they went eight for 11 since Banda is Zambian and Marta is Brazilian, making neither eligible to play for the United States Women’s National Team (USWNT). Emily Sams was also eligible while a member of the Pride, but she is now a member of Angel City, so she is dead to me.\nJust kidding, I will still root for Sams, but only when she is playing for the USWNT. Or if she comes to her senses and asks to return back to a club that actually has won something in the league.\nThe Washington Spirit signed Trinity Rodman to the NWSL’s first-ever deal using the HIP mechanism last week, making her the highest paid women’s soccer player in the world, earning more than $2 million annually according to reports. Unlike MLS, the NWSL does not release contract details, so we do not know how much more that is than the next-highest-paid players in the league, but we know that she just set the new bar, and deservedly so.\nBut is it deservedly so? Let’s take a look.\nLet me start by saying that Rodman is one of my favorite athletes to watch across all sports. Not among women’s athletes, among all athletes. She plays with speed, power, skill, and joy, and even though she plays for a rival team in the NWSL, I root for her to succeed, because her style of play is one that every athlete should aspire to replicate. It certainly helps that she also plays (and when healthy, starts) for the USWNT, my second favorite soccer team behind the Pride, but even if she was playing elsewhere I am confident I would still be a fan. How could you not, when she makes plays like this and then gets her coach to join the celebration?\nThat combination of success on the field and likeability is what makes her one of the most marketable athletes in the NWSL as well, and marketability was included in the list of HIP criteria, so I think it is a quick and resounding yes, it is deservedly so that Rodman set the new bar.\nBut once a bar is set, another player will want to jump over it. Rodman has a tremendous mix of soccer skills and marketability, but NWSL general managers want to win championships more than just the hearts and minds of fans, so they are generally more interested in bringing in the best players than they are the most marketable players. Rodman is a great player and has set that bar very high, but now every GM in the league has a target they can use to try to acquire a new player by pulling a Jerry Maguire and showing them the money.\nRodman might not have many peers in the marketability space, but let’s take a look at a few players on the soccer side. Just for fun we’ll call them Player B and Player M, to see if they match up with her and might want a similar salary. Here are their stats per 90 minutes from the combined 2024 and 2025 seasons with their NWSL ranks included in parentheses:\n*data from what’s still available on fbref.com (goal contributions, plus/minus), as well as FotMob (chances created (a.k.a. key passes), FotMob rating) and American Soccer Analysis (goals added).\nYou did not need to be a Bletchley Park-level codebreaker (deep cut for the history buffs) to figure out that Player B is Banda and Player M is Marta. Banda compares quite favorably to Rodman, exceeding her performance in nearly every category, and while Marta lags behind the other two in a few categories (reminder, she played those seasons at 37 and 38 years old and is the oldest player in the league), she surpasses both of them, and the rest of the soccer world, in the categories of heart and, you know, being the greatest of all time. That, however, probably will not translate into the Pride signing her to a HIP deal at this point in her soccer career, even though there is no player in soccer who more perfectly fits the definition of high impact than Marta.\nBanda does not have Marta’s global profile or status, but at 25 years old (she will turn 26 in March) she is already a superstar, with high-level achievements already in the Summer Olympics and World Cup for Zambia, a goals-scored-per-90-minutes ranking of fourth in NWSL history (0.62 per 90), and she played a pivotal role in helping the Pride win the NWSL Shield and the NWSL Championship during the 2024 season. The injury she suffered during the 2025 season did not completely derail the Pride’s season, but the offense was not the same without her in the lineup — one of the main reasons that the Pride came up short in their quest to win back-to-back titles.\nWhen she was acquired in 2024, Banda reportedly (again, it would be ideal for the NWSL to actually release this information instead of forcing people to use words like “reportedly”) signed a four-year deal worth up to $2.1 million over the life of the contract, but with Rodman’s deal now worth nearly that amount per year, it is certain that Banda’s agent has already been in discussions with the Pride’s front office about signing her to a brand new contract using the HIP mechanism.\nHer current contract runs through the 2027 season, but in recent months the trends have pointed to more players wanting to go to Europe than stay in the NWSL. While that is not exclusively about money, the ability of European teams to offer whatever they want certainly has played a role in enticing players to make a move. With two years left on her contract the Pride are not at risk of losing Banda imminently, but there are few strikers like her in the world (she is one of only 44 women across fbref.com’s database of 16 women’s leagues who have averaged more than 0.60 goals scored per 90 minutes while playing more than 3,000 minutes in the last two seasons), and she is still in the early prime of her career.\nI expect the Pride to offer Banda a HIP contract in the upcoming months, as now that Rodman’s deal has been signed, every team has a benchmark in place, and they can negotiate with the agents and players using that deal as a starting point. Banda’s statistical performance and age is similar to Rodman’s, though the Pride will likely offer her a lower amount as she does not have the same commercial profile. There are no hard and fast rules to defining “commercial profile” or “marketability,” so it is more about perception than anything, but I think the Pride will discount something off of Banda’s offer, even though a good argument can be made that Banda delivers more on the field than Rodman.\nHopefully, the Pride’s front office and Banda can come to an agreement on a new contract in the near future, and when they do, it will only be right that we all shout out HIP HIP hooray!\nVamos Pride!\nOrlando Pride\nReading (Into) the Minutes: How The Pride Might Allocate Playing Time This Season\nHere’s how the Pride might replace the minutes played by those players who departed the club during the off-season.\nOn Tuesday, the Pride held their first practice of the preseason, and even though it is not November, I am giving thanks that they are finally back on the field. There are only so many stories out there during the off-season, when news comes in drips and drabs. It was great to see players back in their Pride practice uniforms and smiling together on the field, and with every passing day, the Pride’s roster will get closer and closer to being set for the 2026 season, and we will know which players will compete to replace the minutes of those who departed the club during the off-season.\nAt almost this exact time last year I wrote an article about how the 2025 Pride were bringing back nearly every player from their 2024 team, and while just two weeks later the Pride said “oh really, Andrew?” and transferred Adriana to Al Qadsiah in Saudi Arabia, a robust 87% of the minutes played by Pride players during the 2025 NWSL regular season were played by players from that 2024 team. That percentage would likely have been even higher if not for the injury to Barbra Banda, but 87% is still the second-highest percentage of minutes played in the subsequent season by returning players from the league champion in NWSL history, as you can see from the table below:\nThe 2025 Pride had a lot of continuity from that 2024 team, and while we will never know what would have happened if Banda had stayed healthy (my completely unbiased prediction: back-to-back champs, wins in every playoff game by at least 10 goals), we know that when she played, the team had a +10 goal differential in 16 (but really 15) games, and the team was +1.04 goals per 90 minutes better with her on the field than off the field. That stat is courtesy of fbref.com, a phrase I sadly may not be able to say again this season, as fbref’s data provider cut off its data access this week, and sadly one of the world’s best free databases for men’s and women’s soccer statistics is now gone. I am feeling more verklempt than Mike Myers in an SNL sketch. Let’s move on.\nThere is only a weak negative correlation between the percentage of minutes played by returning players in the subsequent season and a champion’s finish in the subsequent regular season. So, while a negative correlation means as the percentage of minutes played by returning players increases, a team’s regular-season finish decreases (decreasing being good, because the number is getting closer to one, which is first place), the correlation is weak. In plain language, that means just because a lot of players return, it does not imply the team will challenge for the regular-season title.\nThe correlation is also weak and negative for the relationship between returning player minutes and a team’s finish in the subsequent playoffs, and the numbers back up what most of us inherently think anyway, which is that while it is good to have continuity and bring back championship-winning players, it does not guarantee anything.\nThis leads me to the roster, as we know it, for the Pride. I wrote a piece in our most recent newsletter, which you can subscribe to by clicking here, about the positional breakdown of the players currently on the Pride’s roster. But if we step back and look at the macro view for the Pride, the following players, who played at least one minute during NWSL play in 2025, are no longer with the club: Emily Sams, Ally Watt, Carson Pickett, Morgan Gautrat, Prisca Chilufya, Simone Charley, Grace Chanda, and Bri Martinez. Those players combined to play almost exactly 25% of the NWSL regular-season minutes last season, and some quick math tells us that means the Pride currently have 75% of their minutes played in 2025 returning for 2026, as it stands today.\nKylie Nadaner’s return date is still to be determined, so that is another 6% currently unavailable (dropping the total down to 69% returning) but will probably be back during the season. The upshot of all this is the team returns approximately two-thirds of its minutes from last year from a team that, when healthy, was among the best in the league.\nIt is not ideal that the minutes that have to be replaced include one of the league’s best center backs in Sams, who played the full 90 minutes in every game except one, but at the same time, it is ideal that Banda is likely to play 500+ more minutes and Jacquie Ovalle will probably play 1,000+ more minutes than they did in 2025. If those two hit those benchmarks they will replace all or nearly all of the minutes played by the now-departed Watt and Charley, and while they were solid contributors, minutes played by Banda and Ovalle will be considered an upgrade.\nPickett’s departure will likely be covered by a combination of the new defenders who have signed with the Pride in recent weeks, some Kerry Abello minutes in the midfield instead of at left back, and increases in minutes for Julie Doyle, Simone Jackson, or Summer Yates, who hopefully will be fully healthy this year and return to her 2024 form. Thus far, the Pride have signed two attacking players — rookies Solai Washington and let’s-hope-she-doesn’t-wear-number-six Seven Castain — but both players primarily played forward in college, so we do not yet know if they have the ability to play out on the wing.\nIf they do, those two could also be in the mix to replace Pickett’s midfield minutes as well as the minutes played by Chanda, Chilufya, and some minutes at their natural position of forward. That leaves the one minute played by Martinez, which will be absorbed by the Pride’s deep list of right backs (Cori Dyke, Hailie Mace, Oihane, Nicole Payne). The midfield minutes played by Gautrat can be filled by Ally Lemos, Luana, and Viviana Villacorta, though most likely by the first two.\nYou surely noticed that I skipped over replacing the minutes from Sams and Nadaner (while she is out). While there are players on the roster who can do that, there is also the ever-present risk of a Rafaelle injury, as she has not been the most durable player while in Orlando. Zara Chavoshi and the recently acquired Hannah Anderson are both center backs, though last season Anderson was the third center back for a bottom-of-the-standings Chicago team and Chavoshi was the fourth center back in Orlando. Both players are young and have the potential to improve, and in Chavoshi’s case she was behind three really good center backs last season, so being fourth on the depth chart is not an indication of her talent.\nSome of the Pride’s other outside back players like Abello, Dyke, Mace and potentially others could also play some center back, but it still feels like that position is unsettled at the moment and there is not enough depth, especially with Rafaelle’s injury history and an even longer schedule this year due to the two new expansion teams joining the league.\nSpeculation season will come to an end soon, but new Vice President of Soccer Operations and General Manager Caitlin Carducci still has weeks left to make additional signings or trades and firm up the roster (hopefully she ensures Own Goal stays for another year). As the preseason opens, it seems like the Pride have backfill options already on the roster to adequately cover every departed player except for Sams, but that $650,000 they received for her is some dry powder that Carducci surely will make use of at some point to acquire additional new talent. Perhaps Anderson, Chavoshi, or another defender will show so much in preseason that those funds can be deployed elsewhere, or maybe Carducci will go center back shopping, but either way, there will be a new center back pairing when the season opens.\nThe countdown is on until the season opener on March 15 at home against Seattle, and while right now most fans are focused on how many days are left until that game, you can be assured that in the front office and among the coaching staff they are having just as many conversations about how to allocate the game minutes as they are how to allocate those practice days.\nBoth conversations matter, but none more than how game minutes will be allocated. Pride leadership will make minute examinations of minute details, parsing minute distinctions to determine who ultimately earns major minutes.\nVamos Pride!\n-\nLion Links2 weeks ago\nLion Links: 1/30/26\n-\nOrlando City1 week ago\nThe Orlando City Off-Season Blues\n-\nOrlando City2 weeks ago\nOrlando City’s Defensive Unit Primary Concern Heading Into Regular Season\n-\nLion Links1 week ago\nLion Links: 2/4/26\n-\nOpinion2 weeks ago\nLikes and Dislikes from the Third Week of Orlando City Preseason\n-\nOrlando City1 week ago\nOrlando City Preseason Notes: Jansson Undergoes Surgery, Lions Sign Nolan Miller\n-\nLion Links2 weeks ago\nLion Links 2/2/26\n-\nLion Links2 weeks ago\nLion Links: 2/3/26",
  "word_count": 6107,
  "scraped_at": "2026-02-14T12:24:04.628216"
}