{
  "article_id": "e873757943d1",
  "url": "https://www.france24.com/en/live-news/20240621-caf-announce-new-dates-for-2025-afcon-in-morocco",
  "title": "CAF announce new dates for 2025 AFCON in Morocco",
  "date": "20240621T224500Z",
  "domain": "france24.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "CAF announce new dates for 2025 AFCON in Morocco\nJohannesburg (AFP) – The next Africa Cup of Nations will be played in Morocco from December 21 2025 to January 18 2026, Confederation of African Football (CAF) president Patrice Motsepe said on Friday.\nIssued on:\n\"I am confident that the CAF AFCON Morocco 2025 will be extremely successful and the best AFCON in the history of this competition,\" he said.\nCAF held a virtual executive committee at their headquarters in Cairo on Friday evening after which Motsepe made the announcement.\nOriginally scheduled for June and July 2025, the AFCON was moved to avoid a clash with the inaugural Club World Cup in the United States from June 15 to July 13 next year.\nAn added challenge for CAF officials was the desire to avoid a clash of dates with the UEFA Champions League in Europe.\nMatchday six of the elite European club competition ends on December 11 2025 and matchday seven begins on January 21 2026.\nHowever, the new dates are sure to upset many Premier League clubs as the Christmas-New Year period is frenetic with teams playing many matches in a short period.\nEnglish media reports have suggested clubs might not release African stars as they are compelled to do so for only one international championship per year and the next World Cup is in 2026.\nCAF could argue that it is the 2025 AFCON, although most of the tournament will be staged the following year.\nFinding suitable dates for the AFCON, a 24-nation tournament won by hosts the Ivory Coast last February, has become increasingly difficult.\nA switch to mid year worked for the 2019 edition in the searing heat of Egypt in so far as it avoided a clash with the European club seasons.\nDramatic profit increase\nHowever, the two subsequent editions, in Cameroon and the Ivory Coast, had to be staged in January and February to avoid the rainy seasons in central and west Africa.\nThe qualifying draw for the 2025 AFCON is scheduled for Johannesburg on July 4 with 48 hopefuls to be divided into 12 groups.\nMorocco will take part to gain competitive match practice, but are guaranteed a place at the 24-team finals as hosts.\nUnlike the four-yearly European Championship, Copa America and Asian Cup, the AFCON is held every two years because it delivers most of the CAF revenue.\nIn a recent TV interview, Motsepe said CAF made an $80 million (€75 million) profit from the last AFCON, hosted by the Ivory Coast in January and February this year.\nThis was a dramatic increase from previous editions, which produced an average profit of about four million dollars, according to the South African billionaire.\nThe 2024 Women's AFCON (WAFCON) has also been postponed and will now be played in Morocco from July 5-26 next year.\nNew dates will also have to be found for the African Nations Championship (CHAN), originally scheduled for Kenya, Tanzania and Uganda this year.\nNot even the qualifying draw has been made for a competition restricted to home-based footballers and won by Senegal in Algeria last year, and CAF have not explained the delay.\nThere has also been no news from CAF on a second edition of the African Football League (AFL), initially called the African Super League.\nPlanned to be a 24-club mini-league and knockout competition featuring the highest ranked clubs in the continent, it debuted last year with just eight sides involved in a three-round affair.\nWere the original format to be introduced, clubs would play between 14 and 21 matches in a continent where air travel presents challenges due to limited direct flights between countries.\n\"You can turn the lights off on domestic football if this (AFL) goes ahead,\" warned John Comitis, the chairman of top-flight South African club Cape Town City.\n© 2024 AFP",
  "word_count": 638,
  "scraped_at": "2026-02-14T12:32:31.574960"
}