{
  "article_id": "e882a5c59b81",
  "url": "https://www.deseret.com/2023/6/1/23743205/utah-utes-softball-continues-quest-toward-an-ncaa-national-championship-washington-huskies-pac-12",
  "title": "Utah Utes softball continues quest toward an NCAA championship",
  "date": "20230601T200000Z",
  "domain": "deseret.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "It was another memorable and historic week in University of Utah sports.\nThe softball team won its three-game Super Regionals series against San Diego State to capture its first Women’s College World Series berth in 29 years in front of record-breaking crowds.\nThe Utes overcame a loss in the first game Friday, bouncing back to win 10-1 Saturday and 7-2 Sunday.\nAce pitcher Mariah Lopez was fantastic, and in the final two contests she received significant run support to eliminate the Aztecs.\nNo. 15-seeded Utah faces a Pac-12 team, No. 7 Washington, Thursday (7:30 p.m. MDT, ESPN) in the double-elimination tournament in Oklahoma City. The last time the Utes went this far was 1994, when current coach Amy Hogue was a player.\n“It has been too long. They have been building and doing all the things that it takes to get there. You can’t take what we just did for granted,” Hogue said after Sunday’s win. “It’s incredibly hard. I just talked to my former coach who has been there. Took me there, led us there — Jo Evans. She said, ‘You have to enjoy every minute of it because it is just so hard to get there. You’re going. Go and have a good time.’”\nIn case you missed it\nUtah football earned a significant offseason recruiting win last week when Corner Canyon star quarterback Isaac Wilson committed to the Utes.\nThen he was included in the roster for the annual summertime Elite 11 Finals, a showcase of top prep quarterbacks. Wilson was one of 20 selected.\nFrom June 14-16 in Los Angeles, Wilson and the other 19 QBs will participate in a variety of events.\nFrom the archives\nHow ace pitcher Mariah Lopez’s development helped Utah reach the Women’s College World Series\n3 Isaac Wilson games to watch in the 2023 season\n‘They have a great thing going’: Why big guard Cole Bajema left Washington and joined the Runnin’ Utes\nExtra points\nWhere BYU, Utah and Utah State rate in ESPN’s post-spring SP+ rankings (Deseret News)\nFormer Utah gymnast Sage Thompson has announced her transfer destination (Deseret News)\nWhere do Zach Wilson and Tyler Huntley rank among NFL backup quarterbacks? (Deseret News)\nUtah collegians finish 1-2-3 in 5,000-meter run at NCAA West region track and field meet (Deseret News)\nHow Utah’s bats woke up, staved off elimination in NCAA softball Super Regionals against San Diego State (Deseret News)\nHow San Diego State sent No. 15 Utah to the brink of elimination in the NCAA softball tournament (Deseret News)\nFanalyst\nWhat a treat!!! The Lady Utes were on ESPN for the Super Regional this weekend, all three games!!! They lost a close game to San Diego State in the opener and then swept the next two in convincing fashion and are off to the College World Series!!!! Pitching, power and defense did the trick and Utah gets back to the World Series for the first time in 29 years! Almost as much fun was seeing the fan turnout, which set records three days in a row. The Lady Utes will draw Washington and along with Stanford the Pac-12 has three team in the series. Of course one of the three will get bounced with the Utes playing the Huskies. A good showing for the conference, and really, a great time to be a Ute!!! Next team up ... Washington!!! Go Lady Utes!!!\n— stathis\nWhat a great talent. Everything you want in your starting ace. I heard her interviewed after the last SDS win and she is poised, honest and real. Good luck this weekend, Ms. Lopez. You are a gem.\n— xert\nUp next\nJune 1 | 7:30 p.m. | Softball | Women’s College World Series vs. Washington | @Oklahoma City | ESPN\nJune 7-8 | TBA | Track and field | NCAA championships | @Austin, Texas",
  "word_count": 639,
  "scraped_at": "2026-02-14T13:08:59.547981"
}