{
  "article_id": "e894f71c0b79",
  "url": "https://www.lancashiretelegraph.co.uk/news/24010458.read-court-stories-2023-january-june/",
  "title": "Our most read court stories of 2023 : January to June",
  "date": "20231230T053000Z",
  "domain": "lancashiretelegraph.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "As a news outlet responsible for holding authority to account, our reporters also have to sit in court and hear details of crimes committed by people from across East Lancashire, to ensure justice is served in an open and honest way.\nWhile some of the details may not make easy hearing for our reporters, you - our loyal readers - spend a lot of time perusing over our court stories, with some being read thousands and thousands of times due to either the severe or shocking nature of the case, or because of its high profile.\nOver the next two days we’ll bring you the most read court stories of 2023, staring today, with January through to June.\nJanuary:\nBlackburn boy beaten by parents and brother after coming out\nBack in January the courts heard how a 16-year-old boy was beaten by his parents and his elder brother after coming out as gay.\nBlackburn Magistrates' Court was told how his parents told him he \"could be changed\" and enlisted the help of his older brother.\nIn a victim impact statement the boy, who is of South Asian heritage and cannot be identified for legal reasons, but is from Blackburn, said he was scared for his life at the time of the incidents.\nHe feared his family would continue to use violence towards him if he hadn’t moved away from the area, the court was told.\nFull story here: Blackburn boy beaten by parents and brother after coming out\nBurnley woman who 'pretended to be doctor paid £1m by NHS'\nMeanwhile, in the same month, Manchester Crown Court heard how a woman from Burnley was branded a “most accomplished fraudster” when she was paid more than £1million by the NHS after forging a degree certificate and pretending to be a qualified doctor.\nZholia Alemi, of Plumbe Street, Burnley, worked as a psychiatrist after claiming to have qualified at the University of Auckland in New Zealand, a trial at Manchester Crown Court was told.\nShe denied 20 offences, including forgery and fraud.\nOpening the case, Christopher Stables, prosecuting, said: “To put it bluntly, the defendant is a fraud.\nFull story here: Burnley woman who 'pretended to be doctor paid £1m by NHS'\nFebruary:\nBurnley accountant spent £250k of work's money on prostitutes\nIn February, Preston Crown Court heard how an accountant stole more than a quarter of a million pounds from his employers, spending the money on prostitutes, hotel stays, laptops and work on his own home.\nDarren Parker, 43, started working for a company called Stortec Engineering Ltd in 2018 and almost immediately began a “catastrophic fall” from grace as he started to transfer and withdraw money from the company into his own accounts, to the tune of £255,304.84.\nParker, of Barley Grove, Burnley, made bank transfers between March 15, 2018, and June 16, 2020, amounting to £181,596.83.\nFull story here: Burnley accountant spent £250k of work's money on prostitutes\nDarwen drugs gang leaders sentenced to more than 20 years\nAlso in February, six members of an organised crime group who controlled the production, supply and importation of hundreds of kilos of amphetamine and cannabis from a warehouse in Darwen were jailed for more than 35 years.\nEx-Royal Marine, Sam Stone, alongside his partner in crime, Zac Deaffern, was involved in the supply and production of more than 200kg of amphetamine and 400kg of cannabis, with the pair using accomplices John Rowe, Phillip Alderson, Dexter Ryan and Joshua Main to help import the cannabis into the UK from Italy and other areas of Europe.\nFull story here: Darwen drugs gang leaders sentenced to more than 20 years\nMarch:\nFive fined £20k for demolishing Punch Bowl and ordered to rebuild pub\nIn March, five people were ordered to pay a total of nearly £70,000 after illegally demolishing the Punch Bowl Inn - and were also told to rebuild the pub within a year.\nRibble Valley Borough Council, which brought the case to court, said the grade II listed pub on Longridge Road, Hurst Green, was razed to the ground unlawfully on June 15, 2021.\nA trial last year at Burnley Magistrates' Court, found Andrew Donelan, 61, Nicola Donelan, 59, and Rebecca Donelan, 29, all of Carr Hall, Whalley New Road, Wilpshire; David Cotterell, 58, of Percliff Way, Philips Road, Blackburn; and Brian Ingleby, 70, Hollowhead Avenue, Wilpshire, unlawfully demolished the pub.\nFull story here: Five fined £20k for demolishing Punch Bowl and ordered to rebuild pub\nBlackburn drug dealers jailed for heroin and cocaine conspiracy\nLater in March, three drug dealers from the same family who operated a drugs line using various different hire cars for around six weeks, selling heroin and cocaine to users in Blackburn were jailed for a total of more than 15 years\nBrothers Atiq Ashraf, 33, and Tussif Ashraf, 36, and their cousin Asraar Ali, 32, were all working for the ‘Immy’ drugs line, ending 1181, from May to June last year, before being caught by police, Preston Crown Court heard.\nThe court was told Atiq Ashraf was the main person responsible for the ‘Immy’ line and would send out regular ‘batch texts’ to drug users, and take orders for different amounts of heroin and cocaine, before directing Tussif Ashraf and Ali to deliver and drop off the drugs at various locations in Blackburn.\nFull story here: Blackburn drug dealers jailed for heroin and cocaine conspiracy\nApril:\nFake clothing boss from Lancashire convicted of £150m fraud\nIn April, the mastermind of a fake designer clothing scam was convicted of one of the UK’s largest ever carousel tax frauds.\nSock manufacturer Arif Patel, 55, of Preston, and his criminal gang tried to steal £97million through VAT repayment claims on false exports of textiles and mobile phones.\nThey also imported and sold counterfeit clothes that would have been worth at least £50 million, had they been genuine. The proceeds were used to buy property across Preston and London through offshore bank accounts.\nFull story here: Fake clothing boss from Lancashire convicted of £150m fraud\nFather spat in face of Mount Carmel High School deputy head\nMeanwhile, at Preston Crown Court, it was heard a ‘volatile’ father spat in the face of a deputy headteacher after his son was expelled from school.\nJonathan Semain, 51, had been called into Mount Carmel School in Accrington to have a meeting with the headteacher and deputy headteacher regarding his child.\nAlex Beevers, prosecuting, said Semain’s son had previously been temporarily excluded from the school.\nHeadteacher Xavier Bowers and deputy head Paul Dugdale called Semain in for a meeting to talk about his son's reintroduction to the school.\nFull story here: Father spat in face of Mount Carmel High School deputy head\nMay:\nArif Patel, from Lancashire was sentenced to 20 years\nIn April we told you how two men involved in one of the UK’s largest ever carousel tax frauds were convicted, with that being our most read story court story of the month.\nIt’s no surprise then, that when they were sentenced to a combined total of 31 years in jail in May, the story was widely read.\nSock manufacturer Arif Patel, 55, formerly of Preston but now of Dubai, was sentenced in his absence to 20 years behind bars, while co-accused Mohamed Jaffar Ali, 59, also of Dubai, was also sentenced in his absence to 11 years in jail.\nA joint HM Revenue and Customs (HMRC) and Lancashire Police investigation found Arif Patel and his criminal gang tried to steal £97million through VAT repayment claims on false exports of textiles and mobile phones.\nFull story here: Arif Patel, from Lancashire was sentenced to 20 years\nBlackburn women sentenced for perverting course of justice\nIn that same month, two women who knowingly provided false names in their response to speeding tickets received sentences totalling more than two years.\nHajrah Jahan, 27, was charged with two counts of conspiracy to pervert the course of justice and one count of perverting the course of justice, while Aneesa Ramzan, 30, was charged with one count of conspiracy to pervert the course of justice.\nJahan pled guilty to the three offences if February. Ramzan was convicted of her count after a trial.\nFull story here: Blackburn women sentenced for perverting course of justice\nJune:\nMan blamed for costing Blackburn Rovers play-offs given ban\nMid-year saw two completely different court stories resonate with readers.\nFirst, the man widely blamed for costing Blackburn Rovers a play-off spot and the chance of a £100million Premier League place was banned from all football grounds for five years.\nA hearing at Blackburn Magistrates' Court viewed video footage of Carl Hayes running on the pitch at Deepdale - home ground of Preston North End - in the dying seconds of the Championship game between Preston and Blackburn Rovers on April 22\nAt the time of his invasion, Blackburn held a 1-0 lead over their Lancashire rivals.\nFull story here: Man blamed for costing Blackburn Rovers play-offs given ban\nBlackburn woman guilty over horrific Bully Kutta dog attack\nA woman was found guilty of being in charge of a dog dangerously out of control after it caused serious injuries to another dog walker.\nAshiya Hussain, 32, pleaded not guilty to the charge at a previous hearing and maintained that plea ahead of the hearing at Burnley Magistrates Court on Wednesday, May 31.\nThe victim, 60-year-old Donna Ormerod, was savagely attacked by the dog, a Bully Kutta, when she was out walking her own pets in Preston Old Road, Feniscowles.\nShe suffered life-changing injuries to her leg during the incident and had to undergo surgery and rehabilitation\nFull story here: Blackburn woman guilty over horrific Bully Kutta dog attack\nKeep an eye out tomorrow for our round up of the most read court stories from July to December.",
  "word_count": 1634,
  "scraped_at": "2026-02-14T13:10:05.850244"
}