{
  "article_id": "e899d31bbf66",
  "url": "https://news.yahoo.com/spain-removing-word-women-national-165519564.html",
  "title": "Spain is removing the word  women  from national team name to show  conceptual shift  ",
  "date": "20230922T171500Z",
  "domain": "news.yahoo.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Spain is removing the word 'women' from national team name to show 'conceptual shift'\nMANCHESTER, England (AP) — By eliminating the phrase for “women's soccer” from the name of its national team, the Spanish Football Federation is hoping to show it has made a “conceptual shift” in its view of the sport.\nIt remains to be seen if more countries will follow suit.\nSpain made the move towards greater equality this week as part of an agreement between the governing body and its World Cup winning team, which have been in dispute since former federation president Luis Rubiales kissed player Jenni Hermoso on the lips during the trophy ceremony as Spain was crowned world champion in Australia last month.\nThe name for the women's team traditionally included the phrase \"de fútbol femenino” — translated as “women’s soccer.” Going forward, the men’s and women’s national teams will both officially be known as “Selección Española de fútbol” or “Spain’s national soccer team.”\n“More than a symbolic change, we want this to represent a conceptual shift, and recognition that soccer is soccer, regardless of who plays it,” the federation’s interim president Pedro Rocha said.\nEuropean soccer’s governing body, UEFA, has previously held informal discussions about how countries can handle such name issues, but no official proposal has been made.\nOther countries, such as England and United States, have created parity in the names by referring to them as the “men's” and “women's” national teams.\nBut there is less parity when it comes to leading tournaments.\nEuropean club soccer's elite men's competition is simply called the Champions League. The women's equivalent, however, is called the Women's Champions League.\nLikewise, next year's European Championship for men is called Euro 2024. The women's 2025 version is called the Women's Euro.\nThe recent Women's World Cup in Australia and New Zealand came months after the men's edition, whose official name is simply the FIFA World Cup.\nThere are similar examples in the United States where the pro basketball leagues are the NBA for men and the WNBA for women.\nSpain's players have successfully brought about change after weeks of open rebellion as they demanded thorough reform of the federation after Rubiales' kiss and the reaction to his behavior.\nWith Spanish soccer engulfed in crisis, Rubiales eventually stepped down and World Cup-winning coach Jorge Vilda was fired.\nOn Wednesday most of Spain’s players ended a boycott of the national team after the government intervened to help shape an agreement to make immediate changes at the federation.\nThe federation's secretary general, Andreu Camps, who was considered to be close to Rubiales, was also relieved of his duties.\nThe reforms were cast as a way to help further professionalize women's soccer in the country and promote equal pay.\nWhile the World Cup underlined the growing popularity of women's soccer, there remain issues within the game.\nEngland's players had also been in dispute with the country's federation, the Football Association, leading up to the tournament over bonuses and commercial arrangements.\nLionesses captain Millie Bright said Thursday that an agreement had now been reached.\nIn an interview with The Associated Press this week, England and Arsenal player Leah Williamson also called for equality in the sport.\n“I think when we say (we want a) level playing field, what we want are the same opportunities with the same respect to try to make the game what it is,” she said.\n___\nJames Robson is at https://twitter.com/jamesalanrobson\n___\nMore AP soccer: https://apnews.com/hub/soccer",
  "word_count": 578,
  "scraped_at": "2026-02-14T13:03:52.718463"
}