{
  "article_id": "e8babd7f3e68",
  "url": "https://www.maravipost.com/malawi-fa-throws-open-gates-as-u-20-women-chase-world-cup-dream/",
  "title": "Malawi FA throws open gates as U - 20 Women chase World Cup dream",
  "date": "20260212T234500Z",
  "domain": "maravipost.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "BLANTYRE-(MaraviPost)-The Football Association of Malawi (FAM) has rolled out a bold initiative ahead of the crucial FIFA U-20 Women’s World Cup qualifier between Malawi and Guinea Bissau, scheduled for this Saturday 14 February at Bingu National Stadium in Lilongwe.\nIn a move aimed at igniting national support, FAM has declared free entry for fans who will occupy the Open Stand.\nThe decision is designed to draw a massive crowd as the young Malawian women’s side battles for a place in the next round of the qualifiers.\nWith a ticket to the 2027 FIFA U-20 Women’s World Cup in Portugal at stake, the match carries enormous significance for the nation.\nSpeaking to MaraviPost, FAM’s Commercial Manager Mayamiko Kafwamba said the association wants Malawians to turn up in large numbers and rally behind the girls as they carry the national flag with pride.\n“All logistics for the match have been taken care of by FAM and we recognize that these girls are flying the country’s flag. It is only right that we give them maximum support,” said Kafwamba.\nThe free entry applies strictly to supporters who will sit in the Open Stand, making the match accessible to thousands of fans who might otherwise fail to attend due to financial constraints.\nFAM believes a packed stadium could provide the psychological boost the team needs.\nHowever, fans seeking a more premium experience will still need to purchase tickets.\nVIP seats have been pegged at K5,000, while Corporate Box tickets are going at MK10,000.\nThis is not the first time FAM has opened stadium gates to the public.\nDuring the WAFCON qualifiers involving the Scorchers and Angola at the same venue, supporters were also granted free entry an initiative that resulted in an impressive turnout.\nBy repeating the strategy, FAM is once again banking on the power of the 12th player the fans to inspire the team to victory in this decisive encounter.\nThe fixture forms part of a two legged tie, with the aggregate winner advancing further in the qualification campaign.\nEvery goal and every cheer could make the difference between progression and elimination.The first game ended 1–1 in Guinea last week.",
  "word_count": 358,
  "scraped_at": "2026-02-14T12:38:08.734209"
}