{
  "article_id": "e8bd9aeb8730",
  "url": "https://www.6000.co.za/tag/world-cup/",
  "title": "world cup",
  "date": "20240912T124500Z",
  "domain": "6000.co.za",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "It’s amazing what can pique your interest, hey?\nThis weekend, I’ve enjoyed watching some really great sport. The football on Friday was great, but it was Sheffield United, so of course I would be interested, and they won, so of course it would be great.\nBut it was other events this weekend that made me remember that it takes something extra special to get you invested when you’ve got no skin in the game. And those sort of things are fairly rare.\nSure, there are artificial ways of generating interest, like a small bet on the outcome (thank you, Aston Villa) or a fantasy football match-up (curse you, Aston Villa), but when you are just watching because you enjoy the sport, and you’re not rooting for one side or the other, well, it needs to be wow! to generate that same sort of interest.\nThat’s happened twice for me this weekend.\nThis morning’s game in the Australian NRL Finals was a superb watch, with both sides giving it absolutely everything for the whole 80 minutes, and Manly winning only after a – literally – last second field goal attempt missed by a couple of metres. 50,714 in the stands, 26 on the pitch, probably hundreds of thousands in front of their TVs across Australia and the world holding their breath as Matt Burton launched the ball into the Sydney night air. I was in the gym and I had to stop cycling to give my full attention to that last play of the match. Because concentrating and pedaling is hard.\nAnd then the instant juxtaposition of relief, jubilation, heartbreak and despair as my legs realised that they had to start exercising again the rugby result was set in stone.\nBut even that had nothing on the Geoguessr World Cup final. And I know that I keep banging on about this, but just so you know, I could have been doing something much, much, nerdier this weekend…\n…and maybe I did.\nBut that’s for another blog post.\nBecause that final. Best of 5 games – or first to 3 if that’s your preference – and wow, did it deliver.\nAs a very basic introduction, players each start on 6000 points (I know, right?), and lose points the closer their opponent is to the correct location, and the further they are away. Ten 1 minute rounds per game.\nWhen you run out of points, you lose the game.\nI’ve just enjoyed watching stuff. I don’t mind who wins. I’m not invested. Yet.\nThe favourite, a French guy called Blinky, is already up 2-0 and cruising to a crushing victory, and comes within a whisker of wiping his opponent, America’s MK, out and winning the World Cup. Based on the fact they could have been dropped anywhere in the world (but ended up in Latvia), if Blinky had been just 5km closer to the actual spot or MK just 5km further away, it was all over.\nHere’s the twenty minutes of madness that followed.\nThe score is 4035-46. No typos here. No missed digits. One guy is basically two games up and four thousand points clear. The other is on forty-six points. It’s nothing. It’s impossible to turn this around with just two rounds of the third game to go.\nBut obviously, he does. It’s an amazing comeback. But it’s still only 2-1.\nAnd in the eighth round of the fourth game, Blinky has MK down to 66 points again. The event is being staged at the City Hall in Stockholm and there’s a crowd of a few hundred watching it live. And as they hit the tenth round, it was like that field goal attempt (which hadn’t happened yet, but still). Held breath. Wide eyes. And then just sheer incredulity as MK drags in back to 2-2 with a guess just 12km off in the middle of rural Mexico. Literally a horse in a river.\nHow?!?\nThis is now running almost an hour overtime, but nobody is going anywhere.\nFinal round. The decider. NMPZ. Just a single image of a place anywhere in the world.\nNo moving. No panning. No zooming. WYSIWYG. Where G is guess.\nRound one. It’s rural. Literally nothing to go on. And yet they both immediately plump for Mexico: about 50km apart from one another.\nBut it’s Ghana. Everyone is confused. They players look at each other and both laugh. Even the best in the world get it horrifically wrong sometimes. And when that happens, they usually both get it horrifically wrong the same way.\nThe tension is broken for a moment.\nHeads are shaken. They reset. We go again.\nRound two. There’s a guy burning some leaves in a wooded area. That’s all you’ve got. Both players go for Thailand. It is Thailand. Of course it’s Thailand. You don’t get two Ghana anomalies in one game.\nRound three. It’s a slightly overgrown path in the field. It’s Peru. Blinky is closer.\nRound four. It’s a brown dirt road. Nothing more. They both go for Argentina within 4 seconds. They’re each about 50kms out.\nI’ve completely given up on Bournemouth v Chelsea now.\nRound five: It’s a road and a mountain in Turkey. Obviously, they both go Turkey. It takes them 7 seconds.\nMind blowing.\nRound six: It’s a grey road and some trees. It’s in Russia, but Russia is big. They’re both a long way off.\nRound seven and Blinky is holding a decent lead thanks to that Peru guess, but we’ve seen this all before in the last 20 minutes.\nAnother road. Some green grass. Both hit central Bulgaria inside 10 seconds. It is central Bulgaria.\nRound eight, It’s north east USA. MK’s home turf. They’re both there in about 10 seconds again. Nothing to choose between their guesses. And we’ve got a maximum of two rounds left.\nNkunku scores and I hardly notice.\nRound nine: As the crowd sees it, there are gasps. Because it’s a town, and there are French flags everywhere. Does Blinky recognise the place? He zones straight in on Colmar in Eastern France… MK goes further north, closer to Belgium. Aaaand…\nIt’s Germany (despite the flags) but it’s only just over the border. It’s enough. Blinky wins.\nI am emotionally exhausted. God knows how they feel.\n270,000 viewers online. That’s four times the figures for last year’s World Cup.\nMaybe there will be a million in 2025*. Maybe I’ll be there in the finals**.\nI almost feel sorry for Spurs and Arsenal today.\nBecause they are surely never going to get to that sort of drama.\nAre they?\n* very possible.\n** not possible.",
  "word_count": 1103,
  "scraped_at": "2026-02-14T14:15:11.775462"
}