{
  "article_id": "e8c55b9356d3",
  "url": "https://greatbendpost.com/posts/11669dd7-f34b-463a-8fa7-3f78e39e999f",
  "title": "Barton Women Soccer plays to 1 - 1 draw with No . 18 Hutchinson",
  "date": "20240916T163000Z",
  "domain": "greatbendpost.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "By BRANDON SMITH\nBarton Sports Info\nAmidst a grueling stretch facing three straight nationally ranked opponents, the Barton Community College women's soccer team had one slip away Saturday afternoon as an equalizing goal with 17:34 remaining furnished a 1-1 draw with No. 18 Hutchinson Community College at the Cougar Soccer Complex.\nThe result leaves Barton 1-2-2 in league play and 3-2-2 on the season while the Blue Dragons sit 3-1-2 in conference and 4-1-2 overall. The Cougars will conclude their three-match stretch against ranked opponents traveling to No. 14 Cowley Wednesday night at 5:00 p.m.\nControlling possession for much of the first half, Barton finally broke through on the scoreboard with 1:27 remaining in the first stanza as Fiona Jolly rattled the nets for the fifth time this season going unmarked inside the 6' cleaning up Leticia Quadros denied free kick shot attempt.\nOutshooting the Blue Dragons 11-0 in the opening 45-minutes, the two teams combined for six shots apiece over the final 45-minutes.\nMuch like Barton's goal, the Blue Dragons benefitted behind a free kick attempt in the 73rd minute, as Kira Artmann's sent in ball found Kaitlyn Edwards in front of the net for a near post-strike to knot the game even at 1-1.\nThe Cougars created multiple chances for the go-ahead goal behind its 17-6 shot advantage, but the Blue Dragons goalkeeper Karsyn Siothower denied nine of 10 shots faced on frame.\nBarton netminder Mio Tanaka was solid between the pipes rejecting four of the five Hutchinson shots faced with a key save coming on Katharina Marx 1-v-1 opportunity with 68:19 remaining.",
  "word_count": 265,
  "scraped_at": "2026-02-14T12:17:39.745319"
}