{
  "article_id": "e8d8e8b6954c",
  "url": "https://www.aol.co.uk/anglo-spanish-couples-tense-fun-070006260.html",
  "title": "Anglo - Spanish couples say  tense  but  fun  watching Euros final together",
  "date": "20240713T073000Z",
  "domain": "aol.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Anglo-Spanish couples say ‘tense’ but ‘fun’ watching Euros final together\nAnglo-Spanish couples have said they anticipate a “tense” but “fun” atmosphere in their homes during the Euro 2024 final.\nThe final between the Three Lions and Spain takes place on Sunday in Berlin and for those in Anglo-Spanish households, excitement seems to be at fever pitch.\nRebecca Garcia, 40, who is English, and her Spanish husband Eugenio, 38, will be watching the match with their daughters Alba, five, and Eva, three.\nMr Garcia, a structural engineer, said he anticipates there being mixed feelings in their home in Penge, south London, on Sunday.\n“I think I’ll be more tense and nervous and (Mrs Garcia) will probably be having some wine,” he told the PA news agency.\nTheir score predictions also tell two different stories.\n“I think it will end up going to penalties, which is always a really tough thing to happen to them as people, and the pressure, and then I think it will end up with England winning, but on penalties,” Mrs Garcia, who works in the construction industry, told PA.\nMr Garcia said: “I think it’s going to be 2-0 for Spain,” adding that he expects Lamine Yamal and Nico Williams to score.\nMr Garcia, who also supports Liverpool and plays football regularly, said he had not expected his team to reach the final.\n“I think on the Spanish side, we’ve been the surprise of the tournament, I wasn’t expecting to be in the final,” he said.\n“We managed to play really good football and eliminate big teams like France, Italy, Germany, and we started as the underdog and now we are the favourite in the final.\n“On the English side, I think it’s been the opposite – we have great players, they’re not performing probably as they should be.\n“England is now the underdog.”\nMrs Garcia said she has been “rooting” for England the whole way through the tournament and hoping they would reach the final.\n“It’s not every day you get the two sides of your life competing against each other,” she added.\nMrs Garcia said her children will most likely “root for whoever’s winning at the time”.\nMr Garcia quipped: “I think Alba likes Spain, I think she’ll be cheering for Spain, I’ll make sure.”\nDespite being only three, Eva may be displaying signs she is a budding footballer as she enjoys running around and kicking footballs.\n“It’s nice to see them watching the matches and getting behind the excitement of it all,” Mrs Garcia added.\n“Alba’s got a Spain outfit, so we’ll probably put her in that (for the final).”\nThe girls may also have the Spain and England flags painted on their cheeks to pay homage to their mixed heritage.\nAdrian Salamon, 42, a magician from York, will watch the final with his Spanish wife, Azahara Berlango, 42, and their son Tristan, seven.\nMs Berlango believes Spain will defeat the Three Lions 2-0, and Mr Salamon predicts the score will be 2-1 to captain Alvaro Morata’s team.\nTristan is currently “divided”.\n“I think last year he was rooting more for England but this year he seems to be rooting more for Spain,” Ms Berlango told PA.\n“I think because I am very loud when I watch the match, (Tristan) gets more invested in it.”\nMr Salamon added: “It will be tense here, but it will be fun between us.”\nThe family will have a “low key” affair and stay at home to watch England face Spain.\n“We’ll keep it low key. We’ll do a little bit of Spanish tapas and English beer,” Ms Berlango said.\nMs Berlango hopes her Spanish flag, which she says will be in “prime position near her” when the match takes place, will send her team the luck needed to secure victory.\n“I got it when Spain played the final of the World Cup 2010 and my flag is always with me. It’s my lucky flag,” she said.\nShe has predicted teenage Spanish right winger Lamine Yamal will score first on Sunday.\n“I have a little soft spot for our little Spanish prodigy, Lamine Yamal. I think he’ll score first on Sunday,” she said.\nThe couple watched the Lionesses take on Spain in the Women’s World Cup final last August, but “never” believed they would be seeing England and Spain battle it out once again at a major football tournament.\nMr Salamon said he asked his wife “wouldn’t it be funny?” if England face Spain in the final again.\n“We’re finding ourselves in this spot again,” Ms Berlango said.\n“When (the Euros) started, never. When we saw England playing, even less. But, how they’ve pulled it out of the hat.”\nMr Salamon joked with his wife: “You’re not going to gloat if we beat you, are you? To which she replied: “A bit.”",
  "word_count": 804,
  "scraped_at": "2026-02-14T13:05:09.327974"
}