{
  "article_id": "e8de6478fae4",
  "url": "https://www.thisdaylive.com/index.php/2024/06/19/will-kano-pillars-stay-strong-as-warriors-attack/",
  "title": "Will Kano Pillars Stay Strong as Warriors Attack ? – THISDAYLIVE",
  "date": "20240619T050000Z",
  "domain": "thisdaylive.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Latest Headlines\nWill Kano Pillars Stay Strong as Warriors Attack?\nInspired Abia Warriors will go all out for glory when they take on traditional powerhouse team and former winners Kano Pillars in one of the semi final matches of this year’s President Federation Cup, at the Lafia City Stadium on Thursday.\nThe Aba giants struggled for several weeks in the relegation waters, but finally secured their Premiership status when they defeated Akwa United 2-0 in a Matchday 37 game on Sunday. They will approach the match in Lafia with very high impetus.\nIn the other semi final, El-Kanemi Warriors are also highly inspired after securing promotion to the NPFL following the conclusion of the NNL Super 8 Tournament. The team has been promoted alongside Nasarawa United, Beyond Limits and Ikorodu City.\nTheir opponents are Kebbi United, who fear no foe, and have reached this stage by defeating higher-rated ABS FC of Ilorin, NPFL side Akwa United and EFCC FC of Abuja. It promises an interesting evening at the NFF/FIFA Goal Project on Thursday.\nIn the women’s quarter finals, Nasarawa Amazons go up against Remo Stars Ladies at the Samuel Ogbemudia Stadium in Benin City, in what is undoubtedly one of the potentially-explosive encounters of the women’s competition.\nThe girls from Ikenne have been following in the footsteps of their men’s team (Remo Stars FC) in chasing for honours this season, with the men’s team also firmly in the hunt for a CAF Champions League spot as the NPFL season rounds off next Sunday.\nThe Samuel Ogbemudia Stadium is also the venue for the clash between Delta Queens and Sunshine Queens, while FC Robo Queens of Lagos and Naija Ratels of Abuja clash in another tantalizing match-up in Asaba.\nThe Nnamdi Azikiwe Stadium, Enugu – where Enugu Rangers emerged champions of this year’s NPFL season on Sunday – is venue for the clash between Osun Babes and Rivers Angels.\nMeanwhile, the grand finale of this year’s President Federation Cup men and women competitions will take place at the MKO Abiola National Stadium, Abuja on Saturday, 29th June.\nNFF General Secretary, Dr. Mohammed Sanusi, revealed yesterday that the date has been agreed by both the NFF and GTI in view of the fact that Nigeria have until midnight of Sunday, 30 June to submit to the Confederation of African Football, the names of her representative clubs in next season’s continental club competitions.\nMEN’S SEMI-FINAL\n(Thursday@4pm)\nKebbi Utd v. El-Kanemi\nAbia War v Kano Pillars",
  "word_count": 412,
  "scraped_at": "2026-02-14T12:41:31.006890"
}