{
  "article_id": "e939e614c0e1",
  "url": "https://www.nytimes.com/athletic/6983664/2026/01/20/afcon-final-morocco-world-cup/",
  "title": "What impact does AFCON final chaos have on Morocco and World Cup 2030 ? ",
  "date": "20260120T070000Z",
  "domain": "nytimes.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "It was supposed to be the showpiece occasion that projected Morocco in its best light to an international audience, but Sunday’s Africa Cup of Nations (AFCON) final will be remembered only for the chaos that unfolded.\nSenegal’s 1-0 win over the host nation in extra time was marred by what FIFA president Gianni Infantino called “ugly scenes” in Rabat. At the same time that Senegal’s players were threatening to force an abandonment in protest to a controversial late penalty awarded to Morocco, prolonged fighting broke out in the stands as a small number of visiting fans attempted to storm the pitch.\nAdvertisement\n“Violence cannot be tolerated in our sport, it is simply not right,” Infantino, who had watched from the stands, wrote on his Instagram account on Monday morning.\nThe Athletic looks at the key questions as a big night for Morocco, co-hosts of the 2030 World Cup, ended in mayhem.\nWhat happened on Sunday?\nAfter 90 forgettable minutes came a rapid descent into disorder, on and off the pitch.\nAll that happened is best explained at length here but a disallowed goal from Senegal’s Ismaila Sarr in stoppage time was followed by a controversial penalty to Morocco after El Hadji Malick Diouf was adjudged to have fouled Brahim Diaz.\nSenegal revolted, with head coach Pape Thiaw ordering his players off the pitch to bring a 16-minute delay. Brahim’s eventual Panenka penalty, saved by Edouard Mendy, then sent the game to extra time, where Pape Gueye’s goal proved decisive.\nThe backdrop to all that, though, was violent scenes in the stands and the perimeter of the pitch. A small group of Senegal fans attempted to invade the pitch and fought with security at one end of the stadium. Items were thrown and one volunteer was carried from the pitch by stewards after being injured in the melee.\nThe unsavoury episodes did not end there. Senegal reserve goalkeeper Yehvann Diouf was chased by Moroccan ball boys, who had been attempting to steal Mendy’s towel, while Thiaw and counterpart Walid Regragui were involved in a heated altercation at the full-time whistle. An inglorious full stop on the night came when Thiaw was unable to complete his post-match press conference due to a fight breaking out between journalists from Morocco and Senegal.\nWhat was the reaction to the night?\nWidespread disapproval. That began with Regragui saying the final had given a shameful image of African football in his post-match press conference and continued the morning after with a statement from CAF, the governing body of African football, strongly condemning “any inappropriate behaviour during matches, particularly that directed at the refereeing team or match organisers”.\nAdvertisement\nIt added: “CAF is examining all the images and will submit the case to the competent authorities so that appropriate measures can be taken against those found guilty.”\nThe Royal Moroccan Football Federation (FMRF) made no mention of the crowd disorder within the stadium in its statement, but made clear it already challenged Senegal’s temporary withdrawal from the pitch before Brahim fluffed his penalty in stoppage time.\nThe FMRF said it would “resort to legal procedures with CAF and FIFA” after Senegal’s protests “significantly impacted the normal flow of the match and the players’ performance”. A formal complaint was lodged within 24 hours.\nIt is the belief of the FMRF that Senegal should face strong disciplinary measures for players leaving the pitch and that the responsibility also lies with the coaching staff and the Senegalese Football Federation. They regard their opponents’ actions to be unprecedented, damaging the reputation of African football.\nMorocco are intent on seeing disciplinary action taken against Senegal. That appeared to be echoed by Infantino, who had watched the game unfold sitting next to dignitaries from the host nation. He called the flashpoints, on and off the pitch, “unacceptable”.\n“It is also the responsibility of teams and players to act responsibly and set the right example for fans in the stadiums and millions watching around the world,” he wrote on his personal Instagram page.\n“The ugly scenes witnessed today must be condemned and never repeated. I reiterated that they have no place in football and I expect that the relevant disciplinary bodies at CAF will take the appropriate measures.”\nIt is worth noting that the tensions between the two finalists had been stoked up in the days leading to Sunday’s meeting in Rabat. The Senegalese Football Federation released a list of complaints to CAF on Saturday morning, including concerns over the security around its players and the standard of accommodation.\nWhy was Sunday’s game so big ahead of 2030?\nMorocco is where the football world will head in four and a half years from now. Along with co-hosts Spain and Portugal, FIFA awarded the 2030 World Cup to Morocco 14 months ago to ensure its greatest competition heads back to African soil for the first time since 2010.\nAdvertisement\nMatches to mark the World Cup’s centenary will also be played in Argentina, Paraguay and Uruguay but, much like Qatar and Saudi Arabia, it will conclude a long drive for Morocco to take football’s spotlight after an enormous investment into sporting infrastructure and facilities.\nOf the 20 venues listed in the 2030 Bid Book published by FIFA, Morocco has six, along with Spain’s 11 and Portugal’s three. Those include the Stade Prince Moulay Abdellah in Rabat, which hosted the AFCON final on Sunday, and the Grand Stade Hassan II in Casablanca, which has been designed to be the biggest stadium in the world. It is planned to open in 2028.\nMorocco hope the 115,000-capacity venue can even be where the 2030 final is played but faces competition from the recently rebuilt Santiago Bernabeu, home of Real Madrid in the Spanish capital. That decision is unlikely to be made until 2027, or later, as FIFA’s focus is trained on this summer’s competition across the U.S., Canada and Mexico.\nDo Sunday’s events raise concerns over Morocco hosting in 2030?\nAlthough Infantino strongly condemned the events of Sunday night, it was telling that the criticisms came after the congratulations. As well as crediting the success of Senegal, he said Morocco had staged a “fantastic tournament” as “exceptional hosts”.\nTo Infantino and FIFA, this was not an event that could be tarnished by Sunday night’s events. The previous four weeks had demonstrated the progress made by Morocco over the last decade in organisation, transport links and accommodation.\nThere are also strengthening bonds to FIFA, with Morocco able to point towards their growing experience of staging key dates for the world’s governing body. As well as hosting the final African qualifiers for the World Cup in October, where DR Congo progressed to the intercontinental play-offs, Morocco will stage the Under-17s Women’s World Cup every year until 2028.\nSunday’s problems have not damaged faith in Morocco but, much like the 2024 Copa America final played in Miami two years out from a World Cup, there will need to be lessons learned over the security measures in place.\nThat fixture between Argentina and Colombia, overseen by CONMEBOL, brought delays of over an hour due to overcrowding and was considered more dangerous to safety than the flashpoints witnessed in Rabat. The Hard Rock Stadium, home to the Miami Dolphins, will still host seven games at this summer’s World Cup.\nAdvertisement\nThe final of Euro 2020, played in the summer of 2021 at Wembley, was another major final overshadowed by violence. An independent review of the events around Italy’s penalty shootout win over England said it was fortunate that fatalities had been avoided after an estimated 2,000 ticketless fans gained entry to the stadium. Subsequent improvements have since convinced UEFA that Wembley can again host the final of the European Championship in 2028.\nFIFA’s own security teams, rather than those of CONMEBOL or CAF, will take control of operations across the three main co-hosts in 2030, but the belief is that Morocco’s hosting of AFCON has endorsed, not undermined, their credentials ahead of what will be their biggest sporting moment.\nWhat happens next?\nCAF will be tasked with overseeing a full investigation into the events of Sunday, from Senegal’s temporary withdrawal to the violence that spilled down from the stands. Morocco’s claim that a formal complaint had been filed with both CAF and FIFA might well be true, but it will only be the governing body of Africa that can adjudicate and hand down sanctions relating to Sunday.\nCAF predictably kept its statement brief on Monday morning, refusing to be drawn on the rights and wrongs of all that unfolded the previous evening. A disciplinary board will shape the next steps, with Morocco pushing for Senegal’s players and staff to be punished.\nFIFA, though, will be keen to understand how a smoothly-run tournament was allowed to unravel at such a spectacular pace. The lessons learned will be key to planning ahead of 2030.\nAdditional reporting: Simon Hughes and Mario Cortegana",
  "word_count": 1485,
  "scraped_at": "2026-02-14T14:22:10.344673"
}