{
  "article_id": "e97c06d27c7d",
  "url": "https://www.justarsenal.com/striker-alessia-russo-officially-leaving-man-united-and-close-to-arsenal-move/342188",
  "title": "Striker Alessia Russo officially leaving Man United and close to Arsenal move",
  "date": "20230616T173000Z",
  "domain": "justarsenal.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Striker Alessia Russo officially leaving Man United and close to Arsenal move by Michelle\nManchester United have issued the following statement this morning:\nManchester United can confirm that Alessia Russo will leave the football club on completion of her contract at the end of June.\nAlessia went on to make 59 appearances in all competitions as a Red, scoring 26 goals in the process. Her time at the club culminated in a record-breaking 2022/23 season for United Women, with the team finishing second in the WSL, securing Champions League qualification for the first time, as well as making it to our maiden Women’s FA Cup Final. Everyone at the football club would like to thank Alessia for her service and wish her luck for the future.\nYesterday Tim Stillman of Arseblog News reported that Arsenal are closing in on a deal with Alessia Russo, as per the official tweet below. The fact that Manchester United have officially confirmed Alessia’s departure at the end of June, I think we can expect an official announcement from Arsenal soon!\nNew: Arsenal Women close in on Alessia Russo deal https://t.co/kfURMRLb4f #arsenal #afc pic.twitter.com/LizmfYjF4y\n— arseblognews (@arseblognews) June 15, 2023\nAlessia Russo would be the signing of the season for Arsenal! Especially after their record bid was rejected in the January transfer window – with Manchester United stating that the striker “is not for sale at any price”.\nCOYGW!!\nMichelle Maxwell\nFollow Michelle on Just Gooner Women on Twitter for regular updates on the Arsenal Womens Team!\nDo you want to read more about the Arsenal Women’s Team? Click here….",
  "word_count": 265,
  "scraped_at": "2026-02-14T12:39:18.602909"
}