{
  "article_id": "e98c1d81dba6",
  "url": "https://lasvegassun.com/news/2025/sep/12/wagers-on-touchdowns-strikeouts-and-even-penalties/",
  "title": "Wagers on touchdowns , strikeouts and even penalties : States eye limits on prop bets - Las Vegas Sun News",
  "date": "20250912T114500Z",
  "domain": "lasvegassun.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Wagers on touchdowns, strikeouts and even penalties: States eye limits on prop bets\nFriday, Sept. 12, 2025 | 2 a.m.\nAs a bankruptcy attorney, New Jersey Assemblymember Dan Hutchison said he sees clients “all the time” whose betting on football and baseball quickly leads to missed car payments, delinquent mortgages and, ultimately, bankruptcy.\nThe rise of live, in-game bets — in which a gambler could place more than 200 individual bets during a baseball game if they wager on each pitch thrown — has only amplified his misgivings.\n“And I’m like, are you kidding me? I mean, they’re betting on the next pitch, the next play, and it’s constant,” he said. “There’s no pause. It’s just not healthy.”\nWorried that those bets can worsen problem gambling and threaten the integrity of sports, Hutchison, a Democrat, introduced legislation to ban New Jersey gambling licensees from offering live bets on individual plays during sporting events.\nThat bill illustrates growing state interest in regulating proposition bets, commonly called prop bets, a form of sports betting that is popular with fans but worrisome for sports leagues and state officials nationwide.\nUnlike wagering on which team will win or the point spread of a game, prop bets can center on the performance of an individual player or even a single play that doesn’t necessarily affect the outcome of a contest. Prop bets can include trivia, such as the color of the Gatorade dumped over the Super Bowl’s winning coach, or specific stats, like how many touchdowns a certain quarterback will score during a game or which team will score first.\nCritics say prop bets are easier for athletes to manipulate than the outcome of an entire game. They also make individual players more susceptible to online harassment from gamblers and increase the frequency of betting, thus raising the risk of addiction.\nOhio’s Republican governor has called for the nation’s first outright ban on prop betting on professional sports. Already, at least 15 states ban prop betting in collegiate sports, according to data maintained by the American Gaming Association, a trade group.\nThe heightened focus on prop bets comes amid a rapid rise of legal sports gambling, which is operational in 38 states and the District of Columbia. (Missouri plans to launch its new voter-approved program this December.) While legal betting has boosted state revenues and reshaped sports fandom, Hutchison said bankruptcy attorneys across the country are getting a preview of the financial wreckage it can wreak.\nHe said some clients are so distraught, he worries about potential suicides related to out-of-control gambling debts.\n“That’s the reality of what’s going on. But they don’t make it seem like that when they’re doing these commercials during the football games: It’s normal, everybody does it, if you don’t do it, you’re not enjoying yourself,” he said. “That’s the glamour side of it. I deal with the other side.”\nThe industry’s rapid rise\nThe liberalization of sports gambling was made possible by a 2018 Supreme Court decision to strike down a federal law prohibiting gambling.\nSince then, legal gambling has transformed the fan experience and propelled sportsbooks into major industry players: Americans are expected to wager an estimated $30 billion in legal sports betting on the NFL this season, according to the American Gaming Association. With so much money and energy flowing into gambling, academic researchers are increasingly raising concerns about the mental and financial consequences.\n“The speed at which gambling has been marketed and legalized in this country is way faster than guardrails have been set to protect consumers and to try to give resources for problem gambling,” said Stephen Shapiro, a University of South Carolina professor who researches sports gambling.\nShapiro said a potential ban on prop betting in Ohio would prove a “big step” in gambling regulation. But he expects fierce opposition from the industry and consumers alike.\n“They’re very popular. They’re arguably as — if not more — popular than betting on just individual games,” he said. “ … So I think there’ll be some backlash, but I also think over the next few years … there’s going to be an appetite for setting guardrails.”\nThe American Gaming Association, which represents casinos and sportsbooks, says that such restrictions would only drive gambling to illegal venues such as offshore betting platforms, where consumers have no protections.\nBut some sports leagues are ready for more restrictions on prop bets. The NCAA, the governing body for major college athletics, has been pushing federal and state leaders to ban prop betting in college sports.\nThe organization says 1 in 3 high-profile college athletes has received abusive messages from gamblers — the majority directed toward basketball players during tournament season. Just 12 days after North Carolina legalized sports betting last year — including prop bets on players — the University of North Carolina’s Armando Bacot reported receiving more than a hundred abusive social media messages for not accumulating enough rebounds in a game.\nWomen’s basketball student-athletes received about three times the number of threats as men’s basketball student-athletes, according to the NCAA.\nIn a March awareness campaign, NCAA President Charlie Baker said the abuse threatens the well-being of student-athletes and the overall environment of college sports.\n“We need fans to do better,” he said in a statement at the time. “We need states to do better and ban player props that target student-athletes and enable detrimental abuse.”\nAnd professional teams have their own concerns. Last month, ESPN reported the NBA and its players union supported further limits on certain prop bets. This summer, MLB Commissioner Rob Manfred told reporters he would like to see some limits on prop bets.\n“There are certain types of bets that strike me as unnecessary and particularly vulnerable,” Manfred said, according to Yahoo Sports.\nIn late July, Ohio Republican Gov. Mike DeWine called on state regulators to outright ban all prop bets — a request he asked the professional sports leagues to support.\nDeWine’s proposal followed the suspensions of Cleveland Guardians’ pitchers Luis Ortiz and Emmanuel Clase, who are being investigated by MLB. A sports betting integrity firm reportedly flagged two specific pitches Ortiz threw in early June that coincided with a pair of prop bets.\n“The harm to athletes and the integrity of the game is clear, and the benefits are not worth the harm,” DeWine said in a July news release. “The prop betting experiment in this country has failed badly.”\nThe Ohio Casino Control Commission, which regulates sports betting, did not answer Stateline’s questions about the governor’s request. On Aug. 13, the agency said its investigation into the suspicious betting on the Guardians was ongoing.\nIn a statement responding to DeWine, the American Gaming Association said the Ohio incident is actually evidence that regulated gambling works: “It detects potential misconduct, it reports it, and it helps hold bad actors accountable,” said Joe Maloney, the association’s senior vice president of strategic communications.\nIn an interview, Maloney said eliminating legal prop betting will only move that activity into unregulated markets with no transparency. He said prop bets are a reflection of sports fandom: Bettors like to wager on their favorite players notching touchdowns or 3-pointers.\n“It increases a fan’s engagement with the game they love, with the player they love. And so the idea that eliminating a legal betting market for someone really interested in increasing the level of engagement is going to prevent that activity, it’s just not the case,” Maloney said. “ … It simply will just move the activity into the shadows.”\nLeagues endorse some limits\nBut the leagues are pushing for certain parts of the game to remain off-limits in legal betting markets.\nMajor League Soccer, for example, successfully pushed Illinois regulators last year to ban wagering on whether yellow and red penalty cards will be shown during a match and whether a specific player will receive a yellow or red card penalty.\nSimilarly, the state in February banned prop bets on NFL player injuries, player misconduct, officiating assignments, replay results and the first play of the game, following lobbying from the league.\nIllinois Gaming Board spokesperson Beth Kaufman told Stateline the regulatory agency doesn’t maintain a list of specific prop bets that are allowed. But the board does require licensees to receive approval from the agency for specific wagers offered, she said.\n“The IGB regularly monitors ongoing trends and developments in the industry and in major sports for any possible impact to the integrity of sports wagering in Illinois,” she said in a statement.\nThe NFL has pushed for similar rule changes in other states.\nDuring a late August news briefing on gambling, David Highhill, the league’s vice president for sports betting, said the NFL has consistently objected to certain bets that raise integrity risks and provide limited fan engagement. Those include bets about officiating or player injuries and bets that are controllable by a single player on a single play.\n“So things like ‘will this kicker miss a field goal’ are things that we’ve worked collaboratively across the board with operators to make sure those types of wagers are not offered,” he said.\nIn New Jersey, Hutchison said he doesn’t want to ban all sports betting or even all prop bets. And he knows his bill targeting so-called micro bets — those live, play-by-play bets — will face opposition, both from the industry and sports gamblers.\nAn avid sports fan himself, he said he doesn’t waste his money gambling on his beloved Philadelphia Eagles: “They don’t build all of those casinos in Atlantic City and Las Vegas because they pay out winners,” he said.\nHe said he’s not looking to end legal sports betting, but does think New Jersey needs to instill consumer protections and have a meaningful policy conversation about the societal costs of gambling.\nNew Jersey lawmakers are also considering a separate bill to ban player-specific prop bets on college sports.\nThe Council on Compulsive Gambling of New Jersey says it has experienced a nearly 300% increase in calls to its problem gambling hotline since the Garden State launched legal sports gambling in 2018.\nIn a July statement, Luis Del Orbe, executive director of the nonprofit council, which contracts with the state on gambling addiction issues, urged lawmakers to approve the bill to ban live, in-game bets. The organization says those high-frequency bets can trigger instant dopamine releases in the brain’s reward system, fostering compulsive behaviors that can lead to addiction.\n“By limiting the proliferation of micro betting, this legislation takes an essential step toward protecting citizens from the harmful effects of reckless gambling practices,” Del Orbe’s statement said.\n____\nStateline reporter Kevin Hardy can be reached at [email protected].\n____\nStateline is part of States Newsroom, a national nonprofit news organization focused on state policy.",
  "word_count": 1790,
  "scraped_at": "2026-02-14T12:43:41.010082"
}