{
  "article_id": "e9a04ee583c8",
  "url": "https://awfulannouncing.com/fox/colin-cowherd-cowboys-brian-schottenheimer-backwards-visor-rant.html",
  "title": "Colin Cowherd criticizes Cowboys coach for appearance",
  "date": "20250805T020000Z",
  "domain": "awfulannouncing.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "FS1 host Colin Cowherd has remained adamant in his assessment that appearance is everything when it comes to how a figurehead within an NFL organization is perceived to the general public. And the latest example of this came on the latest edition of The Herd, when Cowherd took aim at Cowboys head coach Brian Schottenheimer’s appearance at a press conference on Monday.\nCowherd hasn’t been shy in doubting Schottenheimer’s longevity within the Cowboys organization as of late. On numerous occasions, Cowherd has already floated the possibility of Nick Saban being a great fit for the Cowboys head coaching job. This is all despite the fact that Schottenheimer has yet to coach a single game as the lead man in Dallas.\nThe latest reason that Cowherd is seemingly doubting how good Schottenheimer will be as a head coach is a silly, yet predicable one given Cowherd’s track record. After Cowboys training camp on Monday, Schottenheimer addressed the media wearing a backward visor, which Cowherd ripped him for on Monday’s edition of The Herd alongside Jason McIntyre.\n“You know I don’t like backward hats,” said Cowherd. You know what is worse? A backward visor. That’s a two-win team, I am taking away four wins. That’s awful, that’s so bad. I know everybody gets mad at this. I only really care… For instance, Bank of America is behind him. It’s a big sponsor. I do think if you are the quarterback or head coach of an organization, and you do press conferences, you are not only representing yourself. You are representing the Dallas Cowboys and you are representing Bank of America. That’s probably a huge team sponsor. They probably paid eight million bucks or something like that to the Cowboys. Some big money deal.\n“Here is what men do very poorly. Men often don’t think of others in social situations. It’s how do I look. Women tend to be a little more self-aware, little less narcissism. So when you sit in front of a podium, you are representing the Cowboys, you are representing Bank of America. You are representing a $12 billion dollar corporation. I think you have got to do better as a head coach than a visor backwards. That’s just my take.”\n“You’re representing a $12 billion corporation. I think you gotta do better as a head coach than a visor backwards.”@colincowherd and @jasonrmcintyre have strong feelings about Brian Schottenheimer’s press conference appearance pic.twitter.com/HUTSlUvc9Z\n— Herd w/Colin Cowherd (@TheHerd) August 4, 2025\nSchottenheimer has been far from the only personality who has drawn the ire of Cowherd for breaking his pet peeve of wearing a backwards hat at a press conference, previously going after Shedeur Sanders and Baker Mayfield among others for doing the same in the past.\nIt’s a tried and true complaint from Cowherd that he has tried to rationalize publicly for quite some time now. But is there any actually validity to maintaining a more proper appearance playing a role in being a successful football coach?\nWell, no, not really… Bill Belichick, who is arguably the greatest NFL coach in the history of the sport, always prioritized comfort over fashion, infamously wearing a sweatshirt with visible holes in it to press conferences for years. And yet Cowherd really never had any kind of gripe with Belichick’s appearance.\nUltimately, if Schottenheimer is able to win in Dallas, Cowherd’s complaints will likely disappear as if they never happened. But if Schottenheimer’s tenure goes south like Cowherd seems to believe it will, chances are Cowherd will refer back to him being a “backwards hat guy” as the reasoning for why he never worked out as a head coach.",
  "word_count": 607,
  "scraped_at": "2026-02-14T14:18:52.062112"
}