{
  "article_id": "e9b10087750b",
  "url": "https://www.irishecho.com/2025/5/galway-tipped-again-in-west",
  "title": "Galway tipped again in West",
  "date": "20250502T213000Z",
  "domain": "irishecho.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "It’s probably difficult for many GAA supporters to get their heads round the fixtures master plan. Before Covid and the introduction of the split-season we would be gently getting the football championship under way in Gaelic Park on the first Sunday in May. But the reality is that next Sunday we have two provincial finals to be decided. The only thing that stays the same are the contestants with Mayo and Galway meeting in the Connacht final in Castlebar and Kerry taking on Clare in Killarney.\nGalway have won the Connacht title 50 times, while Mayo are their nearest challengers with 47 wins. They’re playing for the Nestor Cup, which was was first presented to legendary Galway captain Seán Purcell when they beat Leitrim in the 1958 final. This century both counties won the Nestor Cup 10 times, but Galway are bidding for four in a row on Sunday. Mayo were not convincing when beating Leitrim in their semi-final and after their easy win over Roscommon, Galway will be hot favorites on Sunday. But I am reminded of that famous line from the Saw Doctors famous song, ‘‘Will Galway beat Mayo, not if they have Willie Joe.’’ Well, Willie Joe Padden is long retired, but Aidan O’Shea is still going strong and he made his 200th appearance for the county against Leitrim. But I think it’s going to be Galway, even if the final is in Castlebar.\nMeanwhile in Killarney, Kerry after a close call against Cork, will start as hot favorites to win the Munster final for the 86th time when they play Clare. It’s now 33 years since Clare shocked Kerry in the Munster final in Limerick for what was only their second final win. The sight of Kerry’s green and gold jerseys seems to lift the Cork players, but somehow they cannot repeat that form when they play in the round robin series later in the summer. They do have a good team this year and should make the All-Ireland quarter-finals. Clare have only beaten Tipperary, which to be fair wasn’t much of a test and Kerry manager Jack O’Connor will have plenty of material for his team talk on Sunday when he reminds his players of how they escaped with a win from Pairc Ui Chaoimh on a wet Saturday night in Cork.\nCANHAM LEAVES\nTOP FAI POSITION\nLast week the FAI confirmed that Marc Canham is stepping away from his role as Chief Football Officer. Marc has spent close to three years with the FAI and in that time has played a pivotal role in helping to shape the future of Irish football, including the development of the Football Pathways Plan, which provides a clear direction for the continued growth of the game at all levels from grassroots, to professional, to international. Having previously served as the EPL’s director of coaching, Canham arrived in Abbotstown in June 2022, effectively replacing Dutchman Ruud Dokter, whose title was High Performance Director.\nCanham’s title was changed to chief football officer in September 2024 in what was viewed as a vote of confidence from the FAI in the 42-year-old’s capabilities. Last year he was central to the appointments of men’s international manager boss Heimir Hallgrimsson and women’s head coach Carla Ward earlier this year. Last week FAI CEO David Courell said that Canham was returning to England for personal reasons and that the Association are going appoint an interim CFO from within as they cast the net wide for a permanent appointment. Courell said: ‘‘We will do it as swiftly as we can I am not going to put timelines on it, but we will do it as swiftly as we can and make sure we get the right candidate to lead Irish football forward and deliver on our Football Pathways Plan.’’\nTICKETS SNAPPED\nUP FOR JULY OPEN\nThe organizers of the Open Championship have expressed confidence they can manage “McIlroy mania” on the tournament’s return to Northern Ireland in July. The 153rd Open at Royal Portrush from July 17-20 is set to become the second-best attended in history, with almost 280,000 fans having snapped up tickets for the final major of the year. The event was already a complete sell-out before home favorite Rory McIlroy completed the career grand slam with his dramatic Masters victory at Augusta National. Almost 1.1 million people applied in the public ticket ballot last year, with 278,000 securing tickets across the practice days and four tournament days. That is around 41,000 more than attended the Open when Shane Lowry triumphed at Royal Portrush in 2019. That year marked the first time the Open had been played in Northern Ireland since 1951. Meanwhile, tickets for the Irish Open in the K-Club from Sept. 4-7 are expected to sell out following McIlroy’s US Masters heroics. A few months back, McIlroy confirmed that he was going to play in the Irish event at the Kildare venue.\nINTENSE INTEREST\nIN ROVERS STAR\nShamrock Rovers expect that teenage star Victor Ozhianvuna will soon smash the transfer record for a League of Ireland player. That record was earlier this year by Mason Melia’s pre-contract deal with Tottenham agreeing to complete a €1 million deal for the St Patrick’s Athletic striker on Jan 1, 2026. Rovers manager Stephen Bradley says that there is intense interest in their 16-year-old midfielder who has already played in Europe for the Hoops against Molde. Arsenal and Manchester United are reported to be among the clubs interested.\nMeanwhile Bohemians, Dundalk, Shamrock Rovers and Sligo Rovers will share close to €100,000 bonus between them from UEFA. The League of Ireland clubs have gotten this windfall as part of an agreed payment structure with UEFA for all clubs providing their players for senior international duty. Overall 900 clubs across all 55 member nations have benefited from a total of €233 million due to their player call ups for UEFA national team competitions across the 2020 to 2024 cycle of competitions. Shamrock Rovers earned the most amount of money receiving €43,908 to go with the guaranteed €5.4 million they earned from UEFA for their extended 2024/24 European run.\nOLAZABAL TAPPED\nSpain’s Jose Maria Olazabal has been named as Luke Donald’s third vice-captain for Team Europe’s bid to retain the Ryder Cup in New York in September. The 2012 title-winning captain and two-time Masters champion will return to Donald's backroom team alongside the already-confirmed Edoardo Molinari and Thomas Bjorn for the Sept. 26-28 contest at Bethpage Black.\nMARKIEVICZ CLOSES\nFOR PITCH REPAIRS\nSligo’s Markievicz Park is to close until the middle of 2026 due to essential pitch repair works. The presence of Meadowgrass, which leads to issues with the condition of the playing surface, has left Sligo GAA with little option but to close the pitch while regeneration works take place. The planned works will include stripping off the worn-out surface to a depth of about 25mm, re-mixing the sand and soil layers, leveling, sanding, fertilizing, and finally, reseeding with high-quality robust, modern ryegrass blend sports-turf. Once completed, the pitch will be rolled, mowed and maintained to ensure long-term durability and performance. Prunty Pitches of Newtownbutler in County Fermanagh, who are leaders in the provision of pitches in Ireland, won that tender and they will begin the work immediately, they recently a project to relay the pitch for Leitrim GAA at Pairc Seán MacDiarmada in Carrick on Shannon and it re-opened earlier this month. The closure of Sligo’s county ground meant that this year’s county finals and Sligo’s home games in next year’s National Leagues will be played at an alternative venue.\nMICK MCGRATH, 89\nThe death occurred last week of former Irish soccer international Mick McGrath at the age of 89. A Dubliner, he joined Blackburn Rovers from Home Farm in August 1954 and was a member of the Blackburn team that lost 3-0 to Wolves in the 1960 FA Cup final. During his 12-year stay at Ewood Park, McGrath helped the club win promotion to the old First Division. In total McGrath made 269 League appearances for Blackburn before leaving for Bradford Park Avenue and then becoming player-manager at Bangor City in Wales. Mick won one Irish “B” cap against Romania in 1957 and won the first of his 22 Irish senior caps in a friendly against Austria in Vienna in May, 1958. Mick later lived in the Blackburn area and retired after 24 years working for Thwaites Brewery.",
  "word_count": 1402,
  "scraped_at": "2026-02-14T13:21:02.124547"
}