{
  "article_id": "e9ba4b722bb8",
  "url": "https://www.arsenal.com/news/wsl-preview-arsenal-women-v-reading",
  "title": "WSL Preview : Arsenal Women v Reading",
  "date": "20230311T184500Z",
  "domain": "arsenal.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Next up in the Barclays Women's Super League for our Gunners is ninth-place Reading on Sunday evening at Meadow Park.\nAs momentum continues to grow after our Conti Cup triumph, we'll be eyeing another three points against the Royals to keep pace with our league rivals.\nReading's season so far\nKelly Chambers' side currently occupies ninth place in the WSL, only four points above Leicester City in last place. Wins over Spurs and Leicester City earlier in the season have been balanced out by losses to all of the top four, though Reading pushed both Chelsea and Manchester United to the very end in those narrow losses.\nA 2-1 win against West Ham last weekend and a run to the Vitality Women's FA Cup's quarter-finals could see a spring in the Royals' step. They haven't had back-to-back victories in the league since they won five in a row last season between November and February.\nCharlie Wellings has been involved in five WSL goals this season (3 goals, 2 assists), more than any other Reading player. In their victory over the Hammers, Wellings scored and assisted a goal in a WSL match for the first time\nLast time around\nStina Blackstenius was the difference-maker the last time we met the Royals at the Select Car Leasing Stadium.\nOur Swedish striker bagged the only goal of the game with a neat turn and strike past Jackie Burns, and she could have had three or four more in a dynamic display up front.\nWhat the managers say\nEidevall on Reading: \"Reading are a very versatile opponent. They’re a team confident enough to play a lot of different formations so they can adapt between and during matches.\n\"They have a 'never give up' mentality, which I always respect and admire a lot in teams, and I think their players and their coaching staff have shown that time after time. We understand that we need to give a top performance in order to be able to win the game.\"\nChambers on us: “It’s clear looking at the table, Arsenal aren’t where they want to be, but they’ve shown in the last few games especially, they’re still very dangerous so we are under no illusions how tough Sunday will be.\n“But no matter what type of Arsenal take to the pitch, we have to make sure we are at our best. Which, at the moment we’re in right now, we do have a good amount of confidence in the squad.\"\nHow to watch\nWe kick off at Meadow Park at 6:45pm. Supporters can follow along with the action from home via Sky Sports Football, with coverage beginning from 6:30pm.\nTeam news\nSteph Catley missed out on Wednesday's game against Liverpool due to a \"non-contact foot injury\". No further update on Catley's fitness has been given.\nIn better news, Eidevall has \"high hopes\" that both Lina Hurtig and Sabrina D'Angelo will be in Sunday's matchday squad.\nFacts and stats\n- We have faced Reading more often without ever losing than against any other opponent in the WSL, winning 11 and drawing two. We've only failed to score against the Royals once, in a goalless draw back in January 2018\n- Reading have lost all six of their WSL away games against us, conceding 23 goals and scoring just three at Meadow Park\n- Stina Blackstenius has scored in both of her WSL appearances against Reading\n- Kim Little scored in her first four games against Reading but our skipper hasn't found the net in her last four against them\n- We have only lost one of our last 28 WSL games played on a Sunday, with that defeat coming away at Birmingham last season\n- Reading are the only side without an away point in the league this season. The Royals have lost all seven of their games on the road, conceding 20 goals in the process\nCopyright 2026 The Arsenal Football Club Limited. Permission to use quotations from this article is granted subject to appropriate credit being given to www.arsenal.com as the source.",
  "word_count": 677,
  "scraped_at": "2026-02-14T12:38:49.564200"
}