{
  "article_id": "e9c147a2f916",
  "url": "https://www.arsenal.com/news/preview-arsenal-women-v-liverpool-0",
  "title": "Preview : Arsenal Women v Liverpool",
  "date": "20250308T094500Z",
  "domain": "arsenal.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Women’s FA Cup football returns to Meadow Park as we host Liverpool in the quarter-finals on Sunday (2.30pm kick-off).\nWe’re looking to book a place in the semis after beating London City Lionesses 2-0 in the fifth round and Bristol City 5-0 in the fourth round.\nManchester United, Sunderland, Manchester City, Aston Villa, Chelsea and Crystal Palace are the other teams remaining in the competition, with the draw for the semi-final due to take place following the conclusion of our tie with the Reds.\nLAST TIME WE MET\nAlessia Russo scored the only goal of the game as we emerged from St Helens Stadium with a 1-0 win in mid-December. It was our fourth Barclays Women’s Super League win without conceding in a row, before we made that five at home to Crystal Palace.\nIt's been quite the opposite for Liverpool, whose defeat to us was their fourth in a row without scoring, leaving them eighth in the league.\nNEW FACE AT THE HELM\nMatt Beard, who had been Liverpool’s head coach since 2021 following a previous stint between 2012 and 2015, departed the club following a 4-0 defeat away to Manchester City in February. He was replaced by Amber Whiteley, who is now the interim manager and took charge of her first game with this month’s 1-0 win away to Crystal Palace.\nLiverpool have fared well in the FA Cup this season, winning 5-0 away to West Ham United and 2-0 away to Rugby Borough in the fourth and fifth rounds respectively.\nWHAT THE MANAGERS SAY\nSlegers: “They changed formation and the way they did things in the game against Crystal Palace and we have to be ready to exploit that but at the same time we know they’ve been playing in another formation in a different style with Matt Beard, who has done an incredible job I think.\n\"We’ll see what they think suits the game on Sunday, what they’re going to come with, and we pride ourselves on problem solving as a group - staff and players - so that’s something we’re going to have to do really well on Sunday.\"\nWhiteley: “We’ll go there prepared, that’s for sure. We know it will be difficult but we will be ready and we will certainly give it a good go. We want to be on the front foot and aggressive in the moments we can be and also be difficult to break down.\n“There will be fewer opportunities on Sunday potentially, therefore we need to make those chances count when we do get them.”\nTEAM NEWS\nLotte Wubben-Moy is not available for Sunday, while Chloe Kelly is cup-tied. Lina Hurtig has been ill but, otherwise, we have no fresh team news concerns.\nAs for Liverpool, they will be without captain Niamh Fahey and defender Hannah Silcock for this weekend's game.\nMATCH OFFICIALS\nStacey Pearson has been appointed to take charge of Sunday’s game.\nReferee: Stacey Pearson\nAssistants: Sophie Dennington and Ella Broad\nFourth official: Phoebe Cross\nLIVE COVERAGE\nThis match will be shown all around the world live on the Women’s FA Cup YouTube channel.\nCopyright 2026 The Arsenal Football Club Limited. Permission to use quotations from this article is granted subject to appropriate credit being given to www.arsenal.com as the source.",
  "word_count": 544,
  "scraped_at": "2026-02-14T12:43:04.093058"
}