{
  "article_id": "e9c2f3bf9431",
  "url": "https://www.msnbc.com/opinion/msnbc-opinion/trump-shutdown-snap-benefits-food-stamps-crisis-rcna238842",
  "title": "How Trump is using the shutdown to exploit a looming food stamps crisis",
  "date": "20251022T113000Z",
  "domain": "msnbc.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "As the federal government shutdown enters its third week with no end in sight, a major crisis looms on the horizon: The Supplemental Nutrition Assistance Program, also known as food stamps, will face a huge funding problem as of the beginning of November.\nThe New York Times reports that the Agriculture Department warned in a letter to state agencies last week that due to the shutdown the federal government would have “insufficient funds” for the program on which more than 40 million low-income Americans rely for food. Brooke Rollins, the agriculture secretary, told reporters on Thursday that “we’re going to run out of money in two weeks.”\nThe Trump administration’s tactical approach could result in a greater number of people struggling to put food on their table in November.\nBut the Trump administration is painting a dire black-and-white picture of funding falling off a cliff that is misleading; policy experts say that the Agriculture Department has a significant amount of money for an emergency of this kind.\nTo be clear, there are legitimate concerns about how the department is going to cover the entire bill for SNAP benefits for November. But it appears the Trump administration is framing the funding problem as catastrophic as a tool to apply more pressure on Democrats to drop its health care demands and end the government shutdown.\nRollins has used the approaching funding shortfall to blame Democrats for a potential humanitarian crisis. “Because of the Democrat shutdown, there are not enough funds to provide SNAP for 40 million Americans come Nov 1,” the agriculture secretary posted on X last week. “Democrats are putting free healthcare for illegal aliens and their political agenda ahead of food security for American families. Shameful.”\nRollins’ comment about “free health care for illegal aliens” is a nonsensical Republican talking point that has been debunked. And while it’s true that SNAP faces funding problems, the Agriculture Department also has a special pot of cash to draw from for this situation: SNAP has a contingency fund of about $6 billion. According to the Center on Budget and Policy Priorities, more than $5 billion of that fund should be available for use toward SNAP benefits, which would cover close to two-thirds of the roughly $8 billion required to pay out November’s SNAP benefits.\nCBPP also pointed out that the agriculture secretary has the discretion to transfer funds among the department’s different nutrition programs — an authority it used to inject $300 million in tariff revenue earlier in the month into the Special Supplemental Nutrition Program for Women, Infants and Children (also known as WIC) to prevent disruption to the program. As my colleague Hayes Brown pointed out last week, that move “helped inoculate the White House politically against claims that it didn’t care about mothers of newborns going hungry.” (Brown also described the funding transfer as legally questionable — but the point is that the Trump administration clearly considers the maneuver legitimate and could attempt to repeat it.)\n“USDA should use its discretion to transfer whatever amount possible to augment the SNAP contingency funding using the same mechanism as it used for WIC, or any other available legal authority, and come as close as possible to funding full November SNAP benefits,” CBPP’s Dottie Rosenbaum and Katie Bergh wrote in their analysis.",
  "word_count": 549,
  "scraped_at": "2026-02-14T13:44:33.574342"
}