{
  "article_id": "e9c83d324aa5",
  "url": "https://thepeoplesperson.com/2025/04/05/elisabeth-terland-does-everything-but-score-in-frustrating-night-for-norway-women-292594/",
  "title": "Elisabeth Terland does everything but score in frustrating night for Norway Women - Man United News And Transfer News",
  "date": "20250405T121500Z",
  "domain": "thepeoplesperson.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Manchester United Women were in action on a busy night of Nations League football in Europe.\nGrace Clinton and Ella Toone played their part as England crushed Belgium 5-0.\nClinton had 52 touches and made 72% of her passes from the middle of the park. One of her passes was considered as a key pass as she probed the Belgian backline. She also had one shot off target and one that was blocked as she tried to add to her fantastic goalscoring season for club and country.\nThe 22 year old was also combative in the middle of the park winning five ground duels and making three interceptions as she was more than prepared to do the dirty work for her side.\nElla Toone started in a more advanced number 10 position for the Lionesses but only played 60 minutes of the encounter. She had 42 touches and completed 81% of her passes.\nToone completed her one long ball attempt and won three out of four ground duels that she participated in. It was on the whole a rather quiet night for the 25 year old who is usually the livewire for club and country.\nAoife Mannion played at right back as the Republic of Ireland impressively cast aside Greece 4-0 away from home.\nThe veteran defender played the whole 90 minutes and made five tackles, while blocking one shot. She impressively won five out of her seven ground duels for a completion rate of 71%. She also won one aerial battle.\nMannion was also a threat in attack as she had 68 touches of the ball and completed 84% of her passing attempts.\nDominique Janssen also started in defence for the Netherlands as they eased past Austria 3-1. She played the entire 90 minutes, making three clearances and blocking one shot.\nJanssen only won one of her aerial duels but she was imperious on the ball, completing 96% of her 73 passes. The experienced Dutchwoman also completed 10 out of 10 long ball efforts as she set her team up time and time again on the attack.\nElisabeth Terland also had a busy night for Norway as she led the line for the entire match. She had two shots on target, four shots off target and four blocked shots as Norway played out a frustrating 0-0 draw with Iceland.\nOne of those chances was considered a big miss but she did complete 92% of her passes and three of them were considered key passes.\nFinally Emma Watson played the last five minutes of Scotland’s humbling 0-4 defeat to Germany.\nFeatured image James Fearn via Getty Images\nFollow us on Bluesky: @peoplesperson.bsky.social",
  "word_count": 442,
  "scraped_at": "2026-02-14T13:06:36.361237"
}