{
  "article_id": "e9cc178c599d",
  "url": "https://www.esquire.com/uk/latest-news/a26086091/best-podcasts/",
  "title": "The 81 Best Podcasts to Listen to Right Now",
  "date": "20230707T030000Z",
  "domain": "esquire.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Sign up to Junk Mail, our ruthlessly edited weekly digest of the very best the entertainment industry has to offer. Each Friday lunchtime the Esquire team will recommend a small selection of films, books, TV shows, music, theatre and more that we think are truly worthy of your attention.\nAs you can see by the amount of podcasts which qualify for a 'best podcasts' list, there's never been a better time for podcasts. Though the format has been around for a couple of decades now, it's only in the last few years that they really hit their stride. You might say that we're living through a golden age of podcasts, if you're the kind of person who needs all their culture categorised into neat eras.\nBut podcasts themselves seem to live in the wild. You need a David Attenborough to point the way through the undergrowth and stop you wasting time wandering down dead ends. So to that end, this is our pick of the best new podcasts, as well as our highlights from long-running favourites. We've even herded them into neat little categories for you too.\n\"Where's the funny ones?\" you might start griping. \"I like the funny ones. And what about true crime? I was only here for some true crime, and now it's all gone.\"\nChill out mate. They're in their own spin-off lists: this one's the comedy one, and the true crime one is here. We've hived off the best of the BBC's podcasts into a separate list too, because there are absolutely loads. Nice one, the Beeb.\nSo, this is it: our pick of the best podcasts of 2024. Need anything else? Want us to pop your Airpods in for you too? Oh, go on then. We're all friends here.\nCurrent affairs / Sport / Interviews /\nHealth / Culture / Comedy /\nTrue crime and investigations\nCurrent Affairs Podcasts\nThe Rest is Politics\nOne of the many oddities of British politics in 2024 is that former devil incarnate Alastair Campbell is now the cuddly uncle of centre-left politics, and sweet, wet-eyed May-era Tory MP Rory Stewart now spends much of his time throwing Molotov cocktails at the party he used to work for. Despite only getting going in March 2022, their double act has swept all before them.\nThe secret sauce – and what sets them apart most starkly from the lobby journalist podcasters – is in Campbell and Stewart's willingness to spill the beans on the intricacies and absurdities of life in Parliament and British politics, and a slight to-hell-with-it sense of indiscretion toward many of those they crossed paths with in politics now that they're out of the front line. Yes, it's a little bit #FBPE centrist dad fodder. Yes, everyone's copying them now. But it's still good.\nTrashfuture\nIt scarcely needs repeating, but Britain is in a very, very strange place now and has been for quite a long time. Making sense of things by looking at YouGov polls and whatever the lobby hacks are hearing can only explain things so far, and Trashfuture is about as far from the usual spoddy, insiderish British politics podcasts as it's possible to get. Instead, everything is refracted through the lens of tech and social media, and the slow degradation of our political system over the last two decades. It's a lot funnier than that makes it sound. Only here will you get reminders that Angela Rayner was once asked on Question Time whether the Labour Party would nationalise sausages.\nSpin-off podcast Ten Thousand Posts with Hussein Kesvani and Phoebe Roy goes further into the intersection of Twitter and Facebook and British culture, and how 'poster's brain' – the need to say stuff online which no normal human being ought to, simply because it sounds good online – has infected the commentariat and political classes.\nHot Money\nWhen the FT’s Patricia Nilsson started looking into who owned the biggest company in the global porn business, she was stumped. Nobody knew. So where was all the money going? Her deep, deep dive into a confusing world where gigantic torrents of cash swirl between unknown and frequently slightly alarming places. She manages to elucidate the power structure that often sucks cash upwards and away from creators, and tells the story of the explosion of porn sites during the mid-Noughties which blew apart the underground industry which had grown over the 20th century. It’s a collision of two of the deepest and most human of desires: the call of the horn; and the dirtier, darker lure of hard cash.\nHuman Resources\nThis one from the reliably excellent and now much mourned Broccoli Productions (RIP) explores the lingering links between the transatlantic slave trade and modern Britain. Yes, it's sort of a history podcast, but if you want to make sense of the ongoing push to decolonise areas of public life and reckon with Britain's role in the slave trade – spoiler alert: we were pretty keen on it for a long time – then this is an engaging, typically thoughtful way of doing it. Moya Lothian-Mclean, journalist and descendent of both Black African enslaved people and white slave owners, presents and takes us on a journey which starts at Lady Hawkin's School in Herefordshire – named for the wife of Britain's first slave trader.\nToday in Focus\nGiven how quickly everything's moving at the moment, anything more than a 30-minute catch-up can feel out of date almost immediately. The Guardian's daily podcast is an essential primer on everything that's going on right now, and it's been particularly good on the Russia-Ukraine war lately.\nToday, Explained\nVox’s excellent Explained digested news strand was a hit on YouTube and Netflix, and it drops new 20-minute podcast episodes every day. It's quite US-centric, but it's very good.\nPaper Cuts\nMiranda Sawyer leads what feels like a most ye-olden-media staple – the newspaper review, where the day's headlines are pored over by pundits and different papers' approaches compared – but gives it a larky, sarky new media topspin. Out go the usual talking heads, and in come the likes of Popbitch editor Chris Lochery, comedy writer Jason Hazeley, journalists Marie Le Conte and Holly Thomas and a rotating cast of unfusty types. It's out every weekday, and will give you a decent bird's eye view of what's going on plus fond mocking of the odd conventions of Fleet Street.\nThings Fell Apart\nJon Ronson's exploration of the fractures which follow each skirmish in the culture wars is back for a second series, again dodging the usual broad-brush approach to these stories in search of the humanity underneath them. Each time it's a half-hour true story knitting together the deep roots of a culture war flashpoint. There's a serial killer of sex workers in Eighties Miami who ends up linked to the death of George Floyd in 2020, a yacht club exchange in the early Noughties which ends up founding a conspiracy theory, and the roots of the 15-minute cities hysteria at Chipping Norton town hall. At the heart of all of these remarkable stories is the reminder that often what looks like chance is often the percolation of one bad decision through a system, and that what looks like malevolence is often willful misunderstanding of people's motivations. Altogether it's a series of portraits of people who've found their lives and things which have happened to them being flattened out and used as placards by millions of people who don't know the real story.\nSport Podcasts\nThe Guardian Women’s Football Weekly\nFronted by Guardian regulars Faye Carruthers and Suzanne Wrack, this one drops three times a week and maintains the mixture of proper analysis and daft chat which made Guardian Football Weekly so huge, while also hitting its own diagonals and running its own channels.\nStadio\nMusa Okwonga and Ryan Hunn talk about football and pretty much everything else besides. As with the best sporting podcasts, it’s not just about the sport. Memory, storytelling and the minutia of the game are as important as working out what species of extraterrestrial Erling Haaland is.\nInterview Podcasts\nWhere Are You Going?\nThis is a lovely thing. Nine years ago Catherine Carr, who also created the Talking Politics and Relatively podcasts, started sticking her microphone under the noses of random strangers in the street and asking the single question of the pod's title. After 16 episodes on the BBC, it was shelved. But as of April Carr has been out and about again, chatting to people in New York, Liverpool, Brighton, Cambridge, Cardiff and elsewhere about what they're up to. The 15-minute episodes pack in more intrigue and unexpected heart-tugs than pretty much any of the grander, intensely production-centric mystery pods I've heard this year. It's just normal people talking about their lives, and because Carr is so genuine they open up to her instinctively. Along the way we meet oyster divers on the Underground, some lads off to Malaga to watch the racing at Cheltenham on the TV, and more remarkable everyday lives.\nWhere There's a Will, There's a Wake\nKathy Burke doesn't really do podcasts, and yet here she is hosting her own. She's what elevates this one above the other podcasts where a celeb talks through their fantasy [insert tweak on Off Menu here]. Each time a different famous person, generally a comedian – Jamie Demetriou, Diane Morgan, Dawn French and Babatunde Aleshe have all been on so far – talks through their fantasy death. They talk about how they'd like to die, what they'd like their funeral to be like, who they want to do their eulogy, everything. Burke is her usual excellent self. She very genuinely does not give a shit. There is no thought of building this out into a live tour and a Where There's a Will... Shopify page. She's here to have a laugh, and talk about death a bit, and then go home.\nYou're Wrong About\nA long-running favourite of ours, You're Wrong About does rather more work than the raft of what we'll call 'history retelling' podcasts out there. They take apart and reinterpret misunderstood events and phenomena from pop culture. As well as the sheer range of stuff hosts Sarah Marshall and Mike Hobbes get through – from Beanie Babies to where preppy style came from, and from medieval torture methods to the time Tom Cruise boinged around on Oprah's sofa and toppled off it – what sets You're Wrong About apart is the empathetic and earnest way that stories are retold. Try starting with the story of the rugby team whose plane crashed in the Andes and who had to resort to eating each other to survive – in their hands its an affecting story of friendship, brotherhood and profound love.\nPerformance People\nAn enjoyably different spin on the sport/generalised grindset podcast set, this one sees Sir Ben Ainslie, the most decorated sailor ever, and his sports presenter wife Georgie chatting to other duos who've worked together to get to the top of their respective fields. Some are family, like boxing promoters Barry and Eddie Hearn; some are partners like cycling champs Jason and Laura Kenny; others are just business partners, like endurance swimmer Lewis Pugh and his agent. What's constantly surprising and fascinating is that the dynamics between them are all unique and uniquely tailored to the experiences they've gone through, and purely from a podcasting perspective, the double-date format tends to bring up much lively bickering as well as revelatory self-reflection. Good stuff.\nThe Full English Podcast\nLaunched via Vittles, the newsletter about food and culture which is doing a lot to bring different voices and perspectives into food writing, this six-part podcast series does much the same thing in broadening the definition ‘British food’. We start, obviously, with breakfast and what the full English fry-up says about the nation which insists a giant plate of grease is the only way to kick off the day, and after that explore farming, tea, and the influence of ‘modern European’ restaurants. Best of all is a deep dive into Nigella’s fish finger-powered take on bhorta – a fried mixture of vegetables with ginger, mustard, garlic, chilli and onions – and the complex idea of what a national cuisine actually is. Plus, it's the only podcast we've seen ask perhaps the biggest question of all: should we nationalise Wetherspoons?\nDead Honest\nLook, the idea of sitting down and relaxing with a nice, concentrated blast of pain and the wreckage that any death leaves behind isn’t exactly enticing, we know. But the unflinching attitude of Georgie Vestey’s interview podcast turns the most difficult subject of all into a listen that’s so tender and fascinating that you owe it to yourself to face down that awkwardness. Each time, Vestey speaks to a professional who stares into death’s absent eye sockets every day, from a police diver to a chaplain who looks after railway workers who’ve seen people take their own lives. Not immediately cheery, but completely sublime.\nLife Changing\nFormerly led by Jane Garvey and now by Dr Sian Williams, this one is all about people who've had strange, unexpected and often inexplicable events happen to them, and what they did next. Grace Spence Green was minding her own business in Stratford Westfield shopping centre when she was crushed by a man who fell several storeys onto her, leaving her paralysed. When he was 24 Tony O'Reilly from County Carlow in Ireland put a pound on Patrick Kluivert to score first and Holland to beat Argentina 2-1 at the 1998 World Cup. Over time his gambling freewheeled into stealing €1.75 million from his work, and he went on the run. Another guy gets stabbed 17 times by his boss, someone else discovers that their dad's been lying to them about being a baroness, another woman falls asleep at the wheel and accidentally kills three friends. Cheery? Not really. Endlessly fascinating? Oh, boy, you betcha.\nThe Dope Black Podcast\nPulling together podcasts under the Dope Black Dads, Dope Black Mums and Dope Sports Podcast banners, as well as extra contributions from the UK, America and across Africa, this is all about giving Black parents the space to talk about what matters to them, from grief and how lockdown can shake your mental health to exactly why it’s so hard to remember birthdays.\nCulture Podcasts\nDecoder Ring\nWhy don't people slow dance anymore? Where did catchphrase comedy go? What is it about snogging that we like so much? Willa Paskin delves deep into a different cultural rabbit hole each time, and always turns up surprising answers. If you've been missing Reply All (RIP) then this will scratch that itch.\nDrifting Off with Joe Pera\nCult comedy hero Joe Pera, of the deeply off-beam sort-of-sitcom Joe Pera Talks With You, adds himself to the number of celebs doing sleepy-time audio these days, and in typically Joe Pera fashion too. There are little gags here and there, and a gently lulling soundscape, to try to draw you into slumber: sometimes Pera reads from books on his desk, or hears reflections from a trip to Ireland, or listens to a friend talking about musical instrument shops. You can hear 20-minute episodes for free, or shell out for the eight-hour director's cuts.\nPaul McCartney: A Life in Lyrics\nLongtime Macca-watchers will be used to hearing quite a lot of the same stories trotted out whenever our greatest living songwriter does the interview rounds, but this feels very different. Poet Paul Muldoon interviewed McCartney over several months for the A Life in Lyrics book which came out last year, and now the unguarded chats they had have been repurposed into a podcast. They weren't meant to be for broadcast, and have a rough and ready quality, and McCartney sounds more relaxed than he has for ages. Each episode takes a different song, from 'Eleanor Rigby' to 'Helter Skelter', to talk through his life a tune at a time.\nRAW\nMust be nice to be a producer on RAW, the Beeb's archive interview pod: you just whack the whole thing out from start to finish, no edits or extra fiddly bits on there, and your job's done. All sorts of interesting types are caught at interesting times of their careers here, from a very young Adele in 2007 and a magnetic Chadwick Boseman in 2018 to David Bowie in his Serious Moonlight era pomp and, in the new run, Ricky Gervais just before The Office Christmas specials were about to go out in 2003. This is history with all the umms and errs left in, and a sense of seeing behind the curtain left intact.\nArctic Monkeys: Believe the Hype\nAn alarming thought for any millennials wondering when exactly they became culturally irrelevant: Arctic Monkeys' debut album was released in January 2006, and we are now as far from that moment in time as we were from the Second Summer of Love, the Hacienda and the poll tax riots when Whatever People Say I Am, That's What I'm Not landed. The BBC's Kate Nash-fronted look back how it all happened doesn't have access to the Monkeys themselves, but it does have a cache of great archive stuff from the time and heads back to the clubs, bars and little studios of Sheffield – and particularly the High Green suburb where most of the band were from – to work out how it happened. Warning: contains a lot of references to MySpace which might spin any wistful thirty-somethings out.\nDisniversity\nThere's a lot more to the story of Disney animation studios than that myth about old Walt having his head cryogenically frozen. Empire magazine journo Ben Travis is assisted by his own Jiminy Cricket, animation academic and Disney expert Dr Sam Summers, in this film-by-film exploration of how Disney got to be the commercial juggernaut and creative powerhouse it became over the 20th century. Each time they look at the technological leaps Disney took, how each film reflects the film industry and culture at large, and the big ideas at play in the films themselves. It's both very smart and very daft, and works because, above all, Travis and Summers are funny, funny guys.\nEmpire\nEach series of this history podcast breaks down a different empire from throughout the ages, tracking its rise, its fall, and the wreckage which it left behind. First up: the extremely yikes-y story of the British colonisation of India, starting with hot the East India Company grew from a tiny Tudor age enterprise to basically running a country, and going all the way through to the collapse of British rule and Partition in 1947. Neither patronising nor over-complex, it's a very good primer on how the British Empire transformed the countries it colonised, and the traumatic effects it had across the world.\nDragoncast\nAfter three years of fuming about the way the ending of Game of Thrones went down, errant Starbucks cup and all, House of the Dragon has arrived and had fans dusting off their white-blonde Targaryen wigs with a bit more gusto than they'd been anticipating. It's a return to bloody, gory, politicking form, and former host of GoT pod Thronescast Jamie East is back to hang, draw and quarter each episode and its implications for the peoples of Westeros with a phalanx of guests. There have been emergency pods with new tidbits in the run-up to season two as well.\nKermode and Mayo's Take\nAfter 21 years of bickering, shoehorned references to The Exorcist and meltdowns over the sociopolitical implications of Sex and the City 2, Simon Mayo and Mark Kermode jumped ship from BBC Radio 5 Live and took their flagship film review programme – and its impressive catalogue of in-jokes – with them. The Wittertainment cruise has instead docked at Sony's podcast division, where Doctors Mayo and Kermode will deliver twice-weekly reviews and insights into the movies as well as TV chat and the kind of rambling nonsense that made their film review show essential listening.\nJames Bond A to Z Podcast\nAfter 25 films and nearly 60 years of foiling bad lads, necking dry martinis and driving hover-gondolas, there's a lot of James Bond history to go at. Journalists Tom Butler and Tom Wheatley and improviser Brendan Duffy take a letter at a time, from legendary set designer Ken Adam to Max Zorin, the giggling tycoon who was seen off by Roger Moore in his suspiciously wide-eyed later years, and tell James Bond's story in depth. There's a real depth of knowledge here as well as the usual snickering: Butler, Wheatley and Duffy know their stuff, and they've invited film historians, entertainment journalists and other insiders on to add even more expertise into the room.\nSoul Music\nThis long-running Radio 4 programme is the gold standard for music podcasts. It's about the strange ricochets and resonances which music can have through your life, and how the things you live through change your perspective on what a song means. The format might sound a little bit dry – each time ordinary people reflect on a different song or piece of music and its significance to them – but every single time it carries a serious emotional wallop. Recently it's covered David Bowie's 'Life on Mars?' and Talking Heads' 'Once in a Lifetime', but the archive spans 31 series going back 20 years, and often the best ones are those about music you've never heard before.\nGetting Emotional\nYou've probably felt vemödalen, even if you've never heard the word before. These short episodes – usually sub-15 minutes – explore and explain the specific emotional states which English-speakers need words from other languages to describe, as well as chatting to people who've felt them. Vemödalen, if you were wondering, is that feeling you get after taking a picture and realising that it's the same one as loads of other people have taken and yours is rubbish anyway.\nScript Apart\nEven now that podcasting at large has settled into three or four cosy little formats, sometimes a podcast comes along which surprises you with the sheer obvious brilliance of its conceit. Script Apart is one of those. Each time, a writer brings in the first draft of one of their most famous works, and talks through how they got from a rough but promising kernel to the final product. A little like Song Exploder, Script Apart isn't just about its guest, though they're very high calibre; it's about how creativity works, and the pleasures and difficulties of collaboration. Among others, Armando Iannucci has been on to talk about In the Loop, Charlie Wachtel and David Rabinowitz about BlacKkKlansman, and Barry Jenkins for Moonlight.\nTeam Deakins\nYou probably heard a lot about cinematographer Roger Deakins during the promo push for 1917, in which he and Sir Sam Mendes took us on a real-time single-shot journey through the trenches of World War I. Here, Deakins and his collaborator and wife James chat to other notables about the technical side of filmmaking, from directors including Mendes and Denis Villeneuve to Steadicam operators and colour scientists.\nTwenty Thousand Hertz\nGiven podcasting is an aural medium, you’d think more of them would be a bit more curious about the specifics of the sounds that they pipe into your brain. Twenty Thousand Hertz is all about the noises you hear everywhere, all the time, and how they’re made. It has pulled apart sounds as diverse as that massive bum-wobbling note that THX showed off its cinema systems with, the golden record on the Voyager spacecraft, the multi-layered construction of the lightsabre’s vvvvvwing and farts.\nTalking Sopranos\nThis is several cuts above your average watchalong podcast. Michael Imperioli and Steve Schirripa, who played Christopher Moltisanti and Bobby Baccalieri, chat about The Sopranos episode by episode, dropping behind the scenes tidbits and anecdotes all over the place and discovering fan theories they never knew about.\nSwitched On Pop\nIf you're of the (correct) opinion that pop is the greatest art form of the last century, this is an essential. It treats the songs, artists and trends most would think of as flotsam with high-minded enthusiasm, and its break-it-down-to-basics approach never patronises and always illuminates. Vox has form for all this with the excellent Explained Netflix series and YouTube channels, and the dive into what exactly makes 'Baby Shark' the juggernaut is typical, pulling together the history of the do-do-do in pop, what makes kids love certain songs and how to deal with hearing it for the millionth time.\nComedy Podcasts\nSpringleaf\nBack in 2013 James Acaster's crime-solving alter ego Pat Springleaf – a former conman turned undercover cop – was in a bind. As these wiretap recordings show, he was trying to take down the notorious SW6 gang while fending off his wife's attempts to get a divorce and dealing with his ex-partner-in-crime's attempts to blackmail him. This is an extremely high concept idea: Springleaf's travails become a foundation myth for the comedy career of the man now known as Acaster, and episodes see comedian guests including Romesh Ranganathan, Ed Gamble, Joe Lycett, Lolly Adefope and Katherine Ryan reacting to the contents of the wiretap conversations. The cast for those wiretaps is ridiculous: Domhnall Gleeson, Finn Wolfhard, Michael McKean, Jo Brand, Louis Theroux, Kemah Bob and nearly all of Acaster's other comedy mates pop up. Mad, and an acquired taste, but inventive.\nWho Shat On the Floor at My Wedding?\n\"It was the perfect day,\" runs the blurb to this one, \"until someone shat on the floor.\" About as big a sleeper hit as podcasting has yet seen, this investigation-slash-hangout pod originally came out in 2020 but bubbled up big in 2023. The 13-part poodunnit finds its crime scene at the wedding of Karen Whitehouse and Helen MacLaughlin: a boat just out of port, on 11 August 2018. The evidence: a big old human dump outside the ladies' toilets. The suspects: any and all of Karen and Helen's nearest and dearest. The happy couple's mate, detective Lauren Kilby – who is very much not a detective and relies on a €99 lie detector she found on the internet – is on the case. It's a riot.\nLolly Adefope: Fanmail\nThe insufferably self-involved celeb chat pod is ripe for a send-up, and Adefope – who you'll know from Ghosts, Shrill and This Time with Alan Partridge – inhabits a particularly solipsistic version of herself to do it here. Each time she answers some searching questions from her, ahem, fans like \"how tall are you?\" and chats to famous pals. Some are collaborators like Steve Coogan and Charlotte Ritchie; others include the lesser-spotted Steve Buscemi.\nAlan Partridge: From the Oasthouse\nMeanwhile Partridge himself is back for a third series of rambling, intimate podcasts from his Kent hop kiln turned very impressive country bolthole. Norfolk's most celebrated son has bounced back again, this time from the death of his gigantic and terrifying dog Seldom, and there's a whisper of romance in the air with a new assistant. This is the very deepest, highest proof Partridge there's ever been: there's a little of the Mid Morning Matters days, plus a little of the low level desperation which ran through Marion and Geoff. Lovely stuff.\nTrue Crime and Investigation Podcasts\nThe Spy Who\nThe first series of this history pod focused on MI6 double agent Duško Popov, one of the men who supposedly inspired Ian Fleming to create James Bond. Its second is about Oleg Lyalin, a KGB officer who was blackmailed by MI5 into becoming a double agent when it found he was carrying on with his secretary. It was the mid-Seventies, and Britain was absolutely crawling with spies from behind the Iron Curtain but there was little political will to kick them out. Lyalin was seen by MI5 as a useful tool to help lever politicians into doing something about it. In the event, he was a lot more than that. He was from Department V, the KGB department responsible for assassinations and sabotage designed to destroy Britain. Lyalin's defection helped turn the tide against them.\nThe Butterfly King\nThere aren't many cold cases colder than the death of King Boris III of Bulgaria. Eighty years after his mysterious death at the height of World War Two, nobody knows exactly what befell him. For the last 20 years of his life, Boris III ruled Bulgaria just like an absolute monarch, outlawing political parties and bending prime ministers to his will. But in 1943, he suddenly died. It looked like heart failure. But rumours persist that Adolf Hitler had Boris III murdered for his resistance to getting involved in the war against the USSR. So, was he poisoned? Journalist Becky Milligan investigates.\nExposed: The Ashley Madison Hack\nBack in 2015, Ashley Madison was a very big deal. It was a website where people found other people to have affairs with, and it was absolutely open about that being its whole thing. Quite a lot of people had a problem with that, but more than enough didn't for it to become a bit of a juggernaut after its launch in 2002. Then, in August '15, a whole load of data about the site's users flooded out onto the internet. The people who'd trusted that their creeping around behind their partners' backs wouldn't be found out, were suddenly found out. This podcast is about how the hack happened and the human consequences of it – and the dangers of thinking that anything you do on the internet is ever really private.\nWalter's War\nIn 2012, a young graduate named Charlie is making her way in London. She meets a diplomat called Oliver online, and the two hit it off. Charlie encourages her to go for a job in British intelligence, and she takes the leap – but soon the idea Charlie had of the man Oliver appears to be starts to fall apart. Things don't add up. Ten years later Oliver is an influential and highly in demand man in the civil service, with a company selling AI to the military and academic clout, but Charlie is still uncertain where the truth about Oliver lies. Investigations powerhouse Tortoise try to unravel a story taking in the greyness swallowing up defence contractors, the British state machine and tech companies inveigling themselves into the corridors of power.\nBelieve in Magic\nMegan Bhari was an inspiration. Back in the early 2010s, she became a powerful figure among young cancer patients, raising money for her charity Believe in Magic to make dreams come true for other sick children while also battling a brain tumour herself, her mum Jean always in the background. But then a small group of sceptics – whose children had also fought cancer – started to ask questions. Why was Jean always so vague about Megan's treatment? Where was it happening? What was actually wrong with Megan? The answer to that last question is a knotty one, and journalist Jamie Bartlett goes deep to uncover it while trying desperately to get to Jean. It's a sad but gripping listen.\nCan I Tell You a Secret?\nIt starts with a simple question. Can I tell you a secret? At first a few people in the faded market town of Northwich, then a dozen, then hundreds and hundreds of people across the north-west of England and further afield were drawn into the acrimony stirred up by one committed harasser.\nFriendships were broken, punches thrown, and families turned upside down by one person, who started spreading vicious rumours around a small town via Facebook. And the weirdest thing was, everyone knew it was the reclusive Matthew Hardy who was doing it – but nobody could stop him. Sirin Kale (whose other pod from last year, Unreal, was another massive success) investigates why it was so hard to stop Hardy's cyberstalking, as well as hearing from some of the many women who Hardy accused of cheating and homewrecking.\nBut there's more to the stalking than meets the eye. What separates Can I Tell You a Secret? from other true crime pods is its unwillingness to shirk the complex issues at the story's heart, and unbalance the straightforward moralising which the first couple of episodes appear to be heading to.\nA Very British Cult\nIf this initially sounds quite kooky and fun, just know that it's nothing of the sort. When a man named Jeff found himself lacking focus and restlessly looking for ways to pick himself up, he landed in a self-improvement webinar. He was picked out by one of the men running it as being particularly promising: open, hard-working, a keen student. Join my organisation, the man said, and we'll mentor you in the ways of business. So Jeff joined Lighthouse, and a nightmare started – though he can only see it for what it was now he's escaped it. Lighthouse is accused of operating exactly like a cult, separating its members from their families and persuading them to give up everything they have to the organisation. Jeff ended up giving £131,000 to Lighthouse as 'investment'; the returns were dubious. Caitlin Nye's investigation uses Lighthouse's own tapes of meetings and interviews in this podcast – the organisation says it tapes everything for transparency, while former members say it's to hold the more sensitive admissions they make as collateral if they try to leave – as well as clearly laying out how Lighthouse worked. There's also an hour-long BBC3 documentary telling the same people's stories, but the eight-episode series gives them their proper airing which climaxes with a showdown with Lighthouse leader Paul Waugh.\nDeath by Conspiracy?\nSince early 2021 Marianna Spring has been the BBC’s first specialist disinformation reporter, and this 10-part series of 10-minute episodes is a masterclass in taking the very big currents of the culture and measuring their impact in the real world by focusing on one small, ordinary story. Gary Matthews liked to take photos around Shrewsbury before the pandemic, and was part of a big Facebook group where he shared his work. But as Covid started to grip the world, Matthews’ tone changed. He didn’t believe in Covid, and had fallen in with the conspiracist Shropshire Corona Resilience Network. In January 2021 he died of Covid. Spring talks to the people who believed the same as Matthews did, and listens as their nonsense meets hard real world consequences. It’s gripping.\nDisaster Trolls\nAnother Spring joint, this one is all about the ghouls who bombard survivors of traumatic events like the Manchester Arena bombing with messages telling them they're liars and fakers, or even shills working for some shadowy cabal. Infowars' Alex Jones, who for a long time denied the reality of the Sandy Hook school shooting, is perhaps the most famous example. Unfortunately, most of these types of trolls don't get rinsed for the thick end of a billion dollars by the courts, as Jones has, and British trolls are taking up his mantle. Most frighteningly, they're taking their harassment offline too.\nHoaxed\nThere’s nothing like a good ol’ fashioned Satanic panic to get middle England in a lather, and the in the summer of 2014 one of the biggest the UK has ever known started to spill out from behind the gates of Hampstead’s townhouses and down its leafy backstreets. Two children accused their dad of being the head of a paedophile ring operating around North London. He was responsible, they said, not just for sexual abuse but for killing children and making snuff films. He was the head of 175 conspirators, destroying the lives of countless children in plain sight. The police flew into a massive response – and discovered none of it was true. The investigation stopped. But that’s when things got really weird. Tortoise’s follow-up to the mega-hit Sweet Bobby is a trip through the looking glass.\nBonaparte\nThis true crime investigation focuses on the toughest case which the prominent New York lawyer Anne Champion ever had to take on: the death of her friend, for which no-one was ever held responsible. Laura Van Wyhe was found dead at the side of a road in Iowa in 1997. Now Champion is heading back there to find out what happened.\nFilthy Ritual\nWhen Juliette D'Souza was sentenced to 10 years in prison back in 2014, she was called many things: a faith healer; a scam artist; a fake shaman. The truth is perhaps even stranger and more painful than even that. D'Souza was well known around Hampstead, probably the leafiest and bougiest of north London's leafy, bougie bits. For more than a decade, she managed to persuade people that she could make things happen for them, if only they gave her the money. She could cure cancer, help women get pregnant, introduce young singers to Simon Cowell. She also threatened that she could sour people's lives – and even end them – if they didn't pay up. By the time she was sentenced, she had conned people out of more than £1 million. Hannah Maguire and Suruthi Bala from the excellent true crime podcast Redhanded host, but instead of digging through the facts of a cold case they turn investigators trying to piece together the destructive path D'Souza wove through the lives of her victims, and work out how she came to wield such terrible power over people who ended up destitute because of her threats.",
  "word_count": 6238,
  "scraped_at": "2026-02-14T13:27:28.345127"
}