{
  "article_id": "e9e60a9f4ab2",
  "url": "https://www.90min.com/posts/england-womens-world-cup-opponents-haiti-denmark-china-2023",
  "title": "England Women World Cup opponents : Everything you need to know about Haiti , Denmark & China",
  "date": "20230718T094500Z",
  "domain": "90min.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "England Women's World Cup opponents: Everything you need to know about Haiti, Denmark & China\n- England start their Women's World Cup campaign against Hait on 22 July\n- Pernille Harder's Denmark are the next opponent on 28 July\n- The Lionesses then face China for the first time in eight years\nBy Emily Keogh\nEngland are to imminently begin their 2023 Women's World Cup campaign, with the Lionesses seeking to take the next step up from last summer's Euro 2022 win.\nGroup D has a mixture of first-time talent, European stars and former World Cup runners-up, making it one of the most interesting to watch. Whilst Denmark are no strangers to England, it's been nearly eight years since the Lionesses have faced China, while Haiti are brand new.\nWith only two teams to advance to the knockout rounds, 90min takes a deep dive into everything you need to know about the opponents England will hope to dominate in order to go through.\nHaiti\nHaiti Women’s World Cup record\nDebutants Haiti are the definition of an underdog heading into this World Cup, having failed to qualify in previous years with women's football still a slowly developing sport in the Caribbean.\nHow Haiti qualified for 2023 Women’s World Cup\nHaiti's route to Australia was longer than it could have been as the CONCACAF W Championship did offer automatic World Cup places for the region. However, going into in a group with reigning champions USA, Caribbean giants Jamaica and hosts Mexico made qualifiying no easy feat.\nVictory over the hosts was at least enough to earn Haiti a third-place finish and a trip to the inaugural Inter-Confederation play-off tournament held in Aotearoa, New Zealand in February 2023.\nThey then managed to defeat Senegal 4-0 in a semi-final clash in order to go one step closer to their maiden World Cup appearance. A shock 2-1 win over Chile, who qualified in 2019, thanks to Melchie Dumornay's brace secured their passage to Australia.\nHaiti best players\nMelchie Dumornay\nHaiti undeniable best player is 19-year-old Lyon forward Melchie Dumornay. After a youth career propelled her into the spotlight, she is now getting a platform to shine on the biggest stage.\nDumornay has featured in plenty of junior tournaments, competing in the 2018 CONCACAF U-20 and U-17 Championships, winning the Golden Ball for the latter tournament, as well as the U20 World Cup in 2018 aged just 14 and the 2022 CONCACAF U-20 Championships, where she won the Golden Boot by 14 goals in six games to set a new competition record.\nThe teenager made her senior debut in 2019. In 2022, she was part of the Haitian squad during the CONCACAF W Championship in Mexico, where she gained accolades as Best Young Player and was included in the tournament's Best XI.\nScoring a brace in their 2-1 win over Chile in the play-off final, Dumornay was integral to securing World Cup qualification for Haiti for the very first time, proving how vital she is. It was this talent that attracted of French giants Lyon, joining the club from Reims in July 2023.\nNerilia Mondesir\nCommonly known by her nickname Nerigol, Haiti captain Nerilla Mondesir plays for French side Montpellier and scored nine top flight goals during the 2022/23 season.\nNow 24, Mondesir earned the Golden Boot in the 2016 U-17 CONCACAF championships.\nThe forward's leadership and impressive ability to find the back of the net will be a crucial addition to the Haitian effort in Australia, hoping to exploit any weaknesses in opposing backlines to help her country pull off what would be an almighty shock if they get through the group.\nBatcheba Louis\nDuring her 2022/23 season with FC Fleury 91, Batcheba Louis played 25 matches, scoring eight goals and three assists across all competitions, alluding to the talent that she brings to the national team ahead of such a big summer for the underdogs.\nRegistering seven goals in eight appearances in 2023 for Haiti, the 26-year-old forward has proven herself as a clinical finisher that has become a key asset to the developing team, with her knowledge and ability to read the game becoming a true weapon in their arsenal.\nWith plenty of Division 1 experience under her belt, having also played over 70 league matches in France with Issy, she will be a key player for Haiti under pressure.\nHaiti manager\nNicolas Delepine\nIn 2022, Nicholas Delphine was appointed Haiti boss, with the mission of taking The Grenadieres to the the next three competitions they are set to face: the 2023 Women's World Cup, the 2024 Olympics and the 2024 Gold Cup. Part one is complete.\nThe 44-year-old Frenchman has a host of experience as a manager, spending over 20 years leading various French teams, most notably managing Nantes, Montpellier, Guingamp and most recently Grenoble, where he remains in post in parallel to his role with the Haiti national team.\nDenmark\nDenmark Women’s World Cup record\nDenmark have failed to qualify for the last three World Cups, most recently qualifying in 2007 where they failed to get out of the group stage after losses to Brazil and China. The Dane also failed to qualify in 2003 and went no further than round one in 1999. It is bizarre to say the least for a country that reached European Championship semi-finals in 2001 and 2013, and then the final in 2017.\nDenmark's first two World Cups in 1991 and 1995 were slightly more effective, making the quarter-finals each time. On those occasions, their hopes were dashed by Germany and Norway respectively.\nHow Denmark qualified for 2023 Women’s World Cup\nDenmark topped their qualifying group with a perfect record, seven wins and one forfeit afetr Russia were disqualified. They also scored 40 goals in the process.\nFacing the likes of Malta, Bosnia & Herzegovina, Azerbaijan and Montenegro, the Danes netted seven or more goals on three occasions and reached five twice more. New Real Madrid signing Signe Bruun top scored with 13 of their goals.\nDenmark best players\nPernille Harder\nPernille Harder is Denmark's standout player, having scored 70 goals in 141 appearances since her debut for the team in 2009. She became the most expensive player in the world when she joined Chelsea from Wolfsburg in 2020, a record since broken by Keira Walsh's 2022 transfer to Barcelona, while she will begin 2023/24 facing a new challenge with Bayern Munich.\nThe forward spent much of the past WSL season sidelined with injury, but she returned to fitness in the final stages of the campaign and was particularly crucial to Chelsea's victory in the FA Cup final at Wembley when she came off the bench.\nThis is a player who has been Danish Footballer of the Year seven times and a frequent Ballon d'Or nominee in recent seasons, finishing as high as second in the vite in 2018..\nSigne Brunn\nDon't let a disappointing loan at Manchester United in 2022 fool you, Signe Bruun is another exceptional Danish forward. After helping PSG end Lyon's years of domestic dominance in France, she was poched by...you guessed it - Lyon themselves. She has now already secured a new challenge for next season by joining an ambitious Real Madrid.\nHer vision and ability to read the game has become one of best assets to this European side who have struggled for World Cup qualification in the past, however Bruun's 13 goals during the qualifying group made an immense impact in seeing the team through to Australia.\nHaving been awarded Danish Breakthrough Player of the Year in 2017, she Bruun was named Danish Footballer of the Year in 2021 - the first other than Harder to win that accolade since 2014.\nSanne Troelsgaard\nAt 34 and with over 170 senior international caps, Sanne Troelsgaard is one of Denmark's most experienced players - she also chips with goals on a regular basis, getting more than 50 for her country to date. That leadership could prove in a group with seven players aged 24 or younger.\nTroelsgaard has the added incentive of playing for her future afte rleaving Reading at the end of the WSL season. Her versatility is also a key asset to the team, playing as both a midfielder and forward, giving manager Lars Sondergaard flexibility in where to play the proficient goal scorer.\nDenmark manager\nLars Søndergaard\nLars Sondergaard took over the role as manager in 2017, following on from Nils Nielsen, now director of women's footall at Manchester City, and the shortlived Soren Randa-Boldt. Since his appointment, Sondergaard has won 28 of the 46 games and is taking Denmark to a first World Cup since 2007.\nThe 64-year-old had a brief stint as a player himself before embarking on a managerial career that has spanned 27 years to date, managing mainly Austrian teams before moving into Danish club football in 2009 and then taking up his current post.\nChina\nChina Women’s World Cup record\nChina have one of the more successful World Cup nations, failing only to qualify for one tournament (2011) and making it through the group stage in each that they have been to.\nThey reached the last eight as hosts in the first ever Women’s World Cup in 1991, before going one better in 1995 and finishing fourth. Four years after that, in 1999, China contested an iconic final against the United States that was eventually decided on penalties. That period of time saw Sun Wen, named FIFA’s joint female player of the century in 2000, at her peak.\nBut China, despite being an early powerhouse of the global game, have struggled to kick on. Further quarter-finals exits came in 2003, 2007 and 2015, while 2019 finished with last 16 elimination and was the first time they had failed to win at least two games in a World Cup tournament.\nHow China qualified for 2023 Women’s World Cup\nAs the winners of the 2022 AFC Women's Asian Cup, China automatically qualified for this World Cup - the four semi-finalists from the competition all booked a place in Australia and New Zealand.\nThe Steel Roses finished top of a group containing Chinese Taipei, Iran and India, winning both of their games after India withrdrew and earning maximum points. China then faced Vietnam in the quarter-finals, winning 3-1 to get into the last four and seal their World Cup place.\nA penalty shootout win that followed a 2-2 draw against Japan pushed them further in the AFC tournament, eventually beating South Korea with a stoppage time winner from Xiao Yuyi. That means they enter this World Cup as reigning Asian champions.\nChina best players\nWang Shuang\nWang Shuang has had a successful club career within China, featuring for the top sides in the Chinese Super League whilst also having stints with French giants Paris Saint-Germain and more recentlyin the NWSL with Racing Louisville.\nSince making her China debut in 2013, the 28-year-old has netted 43 goals in 121 appearances for the side, was involved in the 2022 Asian Cup win, has four Four Nations tournament triumphs and is heading to her third World Cup. She also first featured for China's Under-17 team at the age of just 12.\nZhu Yu\nIf England want to beat China and potentially come out of the group stage with maximum points, assuming they have already beaten Haiti and Denmark by then, they have will have to find a way past towering goalkeeper Zhu Yu.\nThe 25-year-old stands at six feet tall and got her first taste of tournament experience at the delayed 2020 Olympics. Zhu was named goalkeeper of the tournament at last year’s Asian Cup, not conceding during the group stage and underpinning China’s overall victory.\nWang Shanshan\nAs captain, Wang Shanshan is arguably China's most important and therefore deadly player. Being voted the Most Valuble Player during the 2022 Asia Cup that saw the side qualify for the tournament speaks volumes to her impressive nature and talent.\nThis is already her third World Cup after coming to prominence at international level in 2015, a tournament in which she was utilised as both a forward and a defender. That versatility and the positional intelligence it requires might just be why she is such an effective goalscorer.\nChina manager\nShui Qingxia\nShui Qingxia stepped into the role as China head coach in 2021 when spirits were low as the once formidable Steel Roses, exited the last Olympics with a whimper, humiliated in big defeats to both Brazil and Netherlands and rescuing a 4-4 draw against an unknown Zambia.\nShui galvanised the side, taking China to their ninth Asian Cup win, something that fans thought was beyond them, maintaining her reputation of never being part of a losing side in the competition.\nAs a former midfielder, the 56-year-old was no stranger to winning, featuring as part of a dominant generation of Chinese players that emerged in the 1990s. That included picking up a silver medal at the 1996 Olympics, although she missed the World Cup in 1999.",
  "word_count": 2167,
  "scraped_at": "2026-02-14T12:22:08.122241"
}