{
  "article_id": "e9e7b7495688",
  "url": "https://www.recorder.com/Keeping-Score-Dog-days-are-coming-early-for-the-Boston-Red-Sox-51175704",
  "title": "The Recorder - Keeping Score : Dog days are coming",
  "date": "20230603T140000Z",
  "domain": "recorder.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Good morning!\nBoston’s poor showing against the Cincinnati Reds — a team The Sporting News predicted would finish 16 games under .500 — doesn’t bode well for their 10 games in two weeks against the Rays and Yankees.\nBoston’s defense ranks last in the AL. Their .982 fielding percentage translates to 35 errors and 24 unearned runs. Wins have become losses.\nOn Wednesday night, Rafael Devers’ throwing error led to three unearned runs in Cincinnati’s 5-4 win. The previous night, shortstop Kike Hernandez’s two errors contributed to a 9-8 loss.\nRookie second baseman Enmanuel Valdez has committed five errors, and part-time catcher Connor Wong has made four errors and allowed two passed balls. Hernandez leads the majors with 11 errors; Xander Bogaerts made 10 all last season and has two errors in 51 games with the Padres. The Red Sox brass who let him go should be pumping gas in Yeehaw Junction.\nWhile Boston collectively strives to resurrect memories of Dick Stuart, aka Dr. Strangeglove, the first place Rays lead the AL in fielding percentage (.990), Houston and Seattle are tied for second (.989) and Baltimore and Texas are tied for fourth (.988).\nThe team’s dysfunction extends to clutch hitting. The Red Sox have left more runners in scoring position than any team in the league except Toronto and Detroit, according to teamrankings.com. Trailing by two runs with the bases loaded in the seventh inning on Wednesday, Justin Turner grounded out.\nStarting in mid-August the Red Sox will play 29 games in 34 days against the Yankees, Astros, Rays, Orioles, Blue Jays, Dodgers and Texas and all but 10 of those games are on the road.\nFair weather fans will be jumping off the bandwagon, and tickets will be selling for less than a case of Bud Light.\n****\nVegas oddsmakers moved UMass hockey up a few notches this week when coach Greg Carvel made an off-season goaltending switch. UNH grad transfer David Fessenden was penciled in to be a one year stopgap until 18-year-old Michael Hrabal arrived in Amherst, but in Carvel’s words Fessenden “didn’t have a path to graduation.”\n“The transfer portal had been picked over by this time. Michael Hrabal had a strong season in the USHL and was outstanding at the World U18 tournament. I spoke with his agent Alan Walsh about the possibility of bringing him in this fall. Alan agreed that Hrabal was ready for the jump to D1. So that is why he is coming Fall of ’23 instead of Fall of ’24.”\nThe 6-foot-6, 205-pound native of Praha, Czechia, turned 18 in January and NHL Central Scouting ranks him as the second best draft-eligible goaltending prospect in North America, and he’s projected to be a second round pick in the NHL draft on June 28-29.\nAccording to Alex Hobson of thehockeywriters.com, “One of Hrabal’s most redeeming factors is his agility, especially for a goaltender who’s 6-foot-6. His poise is also very strong for his age, and it’s not often you’ll find him flopping around in his crease. The potential is there and his strengths will blossom with a good team in front of him.”\n****\nCongrats to every Franklin County high school team that advanced into the postseason, and a shoutout to the Pioneer baseball team. The Panthers lost a heartbreaker to the Ware Indians, 3-1, in 10 innings on Tuesday at Vets Field in the Class D title game. The PA announcer was none other than Northfield’s George “The Enunciator” Miller, who nailed every name with his usual aplomb.\nKudos also to Jeff Lajoie and Thomas Johnson in the Recorder sports department, with an assist from the Daily Hampshire Gazette’s Kyle Grabowski. There’s no such beast as a 40-hour week during tournament season, and the scoreboard page has been essential for finding when and where teams are playing in the postseason.\n****\nThe football world is mourning the passing of Bill McGovern, who coached in the NFL and at UMass, BC, Pitt and Nebraska and was UCLA’s defensive coordinator until his health gave out last season.\nHe died May 30 in California at age 60. “Great. Smart. He gave 100 percent when he played at Holy Cross and he brought the same qualities to coaching his players,” texted former Minutemen head coach Jim Reid. “Coaches are smart but can’t always get through to their players. Bill was able to do that.”\nReid hired McGovern in 1988 to coach the defensive backs. When McGovern asked if his contract included moving expenses, Reid hijacked the UMass laundry truck to deliver his belongings.\n****\nWarriors forward Draymond Green was pleased as punch that the Celtics lost to the Heat on Memorial Day and the bulk of his schadenfreude was directed at the fans. “Those people were really rude to me last year and I like to see them suffer. Ha ha ha. I’m happy y’all lost, especially those of you that were in that arena.”\n****\nSQUIBBERS: Look who leads the MLB in turning double plays, it’s the Florida Marlins. Their 65 DPs easily outpaces Baltimore and Colorado who are next with 55. … Rays broadcaster Andy Freed after Tampa Bay’s 11-10 win against the Dodgers on Sunday: “This was one of those games where you’re not sure it’s over until about a half hour after it’s over.” … The Tigers hosted “Bark in the Park” on Tuesday. Fido had to have his own ticket, and the money went to the Michigan Humane Society. … Mets pitcher Carlos Carrasco doesn’t like to come out of games and tries to hide between innings. “I had to chase him around the bathroom at the end of the sixth,” said manager Buck Showalter. “I waited until he came out.” … Detroit’s hopes for its first AL Central title in nine years were dashed this week when centerfielder Riley Green fractured his shin bone. No timetable was released for his return. … Matthew Slater says the new kickoff rules are a ruse. “I can give you a long list where the league does not act in the best interest of the players,” said the longtime Patriots wideout. … Radio host-turned-podcaster Mike Francesca compared Mets first baseman Pete Alonso to Harmon Killebrew who belted 573 home runs for the Twins. “Killebrew was a squat guy with big muscles, not fast, not a great glove, but he could hit the ball to the moon and he was clutch.” … The BC women’s lacrosse team lost its D-1 title tilt to Northwestern on Sunday, 18-6. … On Friday, BC’s baseball team played Troy at the NCAA regionals in Tuscaloosa, and UConn played Texas Tech in Gainesville. What, no UMass? … Giancarlo Stanton’s expected back this weekend after missing all but 13 games this season and 120 games since 2021. … Houston’s Jose Altuve was 0-for-19 with the bases loaded until he slammed the Twins on Memorial Day. … One of the great summer songs was sung by Bobbie Gentry, and today’s the day Billy Joe McAllister jumped off the Tallahatchie Bridge. … UMass basketball coach Frank Martin was happy to see Tyler Burton transfer from Richmond to Villanova. Burton torched the Minutemen for 28 points in the Spiders’ 71-38 blowout at the Barclays Center. … The Rays got to Cubs reliever Mark Leiter Jr. on Wednesday, blasting a pair of two-run homers by Brandon Lowe in the eighth inning and Jose Siri in the ninth to win 4-3. … Earl Weaver would like this year’s no-quit Orioles. Weaver won 1,480 games managing the Birds and in 1986 he told the Washington Post, “On my tombstone just write, The sorest loser that ever lived.”\nChip Ainsworth is an award-winning columnist who has penned his observations about sports for decades in the Pioneer Valley. He can be reached at chipjet715@icloud.com",
  "word_count": 1297,
  "scraped_at": "2026-02-14T13:08:56.849155"
}