{
  "article_id": "e9e9a4019e3e",
  "url": "https://www.dailybreeze.com/2024/01/19/idaho-players-parents-alumni-vandals-ad-terry-gawlik-should-be-fired/",
  "title": "Idaho players , parents , alumni : Vandals AD Terry Gawlik should be fired",
  "date": "20240122T084500Z",
  "domain": "dailybreeze.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "University of Idaho director of athletics Terry Gawlik is the target of increasing demands that university president C. Scott Green fire her for what current and former Vandals volleyball players, their parents and a growing number of alumni and university employees allege has been her failure to effectively address the alleged continued bullying of players by head coach Chris Gonzalez.\nGawlik has prioritized supporting and protecting Gonzalez, a former U.S. national team coach, who she hired prior to the 2022 season, over the mental health and safety of members of the team, according to players, parents, and alumni in a series of interviews and emails.\nIdaho’s decision to not place Gonzalez on leave during an investigation into allegations against him is further evidence, players and parents allege, of what they describe as Gawlik and the university’s misplaced priorities.\n“Terry is a big proponent of Title IX and she’s on all these (NCAA) committees but you need to be fired,” Dave Green, the father of former Vandals libero Emmy Green and the cousin of university president C. Scott Green, said of Gawlik. “You said you were going to protect these women. She didn’t do (expletive). That pisses me off. That pisses me off. I really thought Terry was going to do the right thing and she didn’t. Vandals are loyal and to (us) Terry is (expletive). Terry needs to be gone.”\nFormer Vandals outside hitter Marissa Drange echoed a number of current and former Idaho players.\n“I absolutely think she should be fired,” Drange, who transferred after the 2022 season and helped Trinity reach the NCAA Division 3 Final Four last fall, said in an email to the Southern California News Group. “She ignored the concerns that have been brought to her over the past two seasons and continues to show little regard for the welfare of the athletes she is supposed to protect.” “She ignored the concerns that have been brought to her over the past two seasons and continues to show little regard for the welfare of the athletes she is supposed to protect.”\nThe University of Idaho’s official student body government also released a statement on Friday in support of the women’s volleyball players.\n“The Associated Students of the University of Idaho stands firmly with our fellow students on the UIdaho volleyball team’s right to a respectful and healthy college experience,” the ASUI said in the statement. “The reports outlined in the Orange County Register in no way reflect what the student experience should be for anyone attending the University of Idaho. They are of great concern and deserve immediate attention,\n“…The women of the UIdaho volleyball have demonstrated strength and courage in standing up for themselves as we all should against all forms of harassment and bullying.”\nSeven members of the Green family have earned degrees from Idaho including Leon Green, an uncle of Dave Green, who was an All-American football player for the Vandals in the 1930s and later returned to the university to serve as a professor, department head, athletic director and lead the drive to build the Kibbie Dome, the school’s indoor football stadium.\n“Vandals take care of Vandals,” Dave Green said. “Vandals are loyal and when I say loyal I mean loyal. We’re not (a big school) like Alabama but we’re very loyal. We’re proud of who we are. We hold our chins up high. We expect loyalty. We expect support.”\n“The vibe” with Idaho boosters, Green continued, “is this woman needs to go.”\nGawlik, by failing to take effective action, if any action at all, on a series of detailed complaints against Gonzalez by players and parents both in writing and in person between October and December 2022, allegedly enabled Gonzalez to continue to physically, verbally, and emotionally abuse, body shame, pressure players to play or practice injured or improperly touch players for another year, 13 current and former players, nine parents and three university employees allege in interviews and emails to university officials.\n“A lot of people knew what was going on in 2022. That’s the story,” Dave Green said. “Why was (Gonzalez) allowed to continue coaching?\n“Why was nothing done in 2022?”\n“It would have been great,” said Hans Doorn, the father of former Vandals standout Kate Doorn. “Then another group of (players) would have not had to go through the same things Kate did.”\nDave Green and Idaho players, parents, alumni and university employees question why Gawlik allegedly ignored what they describe as “clear and obvious red flags” during and immediately after the 2022 season.\nThree Big Sky Conference Players of the Week during the 2022 season, Doorn, a setter, Madison Wilson, a middle hitter, and Travel Morris, a middle blocker, transferred out of the program after Gonzalez’s first season in Moscow.\nGonzalez’s first recruiting class in 2022 included 12 freshmen. Only four remain on the team. Nearly two thirds (63.6 percent) of the players who have been on Idaho rosters since Gonzalez was hired have left the program before completing their eligibility.\n“When all those girls are leaving, good players, All-Big Sky players of the week, leaving and the AD didn’t ask why?” Dave Green said.\nBetween October 2022 and January 11, 2024, Gawlik and other university officials, including C. Scott Green, have received at least 18 emails, letters, memos or formal complaints from Idaho players, their parents or women who have played for Gonzalez at other schools detailing that Gonzalez had physically, emotionally, and verbally abused players, denied them food, routinely body shamed them, engaged in inappropriate touching and comments, disregarded the school’s sports medicine staff instructions that athletes not play or practice because of injuries and made racially insensitive remarks to a Black player, according to documents obtained by the Southern California News Group and more than three dozen interviews.\nPlayers and parents were alarmed by Gonzalez’s treatment of Idaho players even before the 2022 season started.\nGonzalez, frustrated and then enraged with how a drill was proceeding in a practice in the spring of 2022, only weeks after Gawlik hired him, shoved a player over, knocking her to the ground, according to five people.\nJust weeks into the 2022 season Idaho parents began meeting after matches to discuss their concerns and potential ways to address them with the university. The parents eventually sent Gawlik a detailed list of allegations of abusive behavior by Gonzalez in the fall of 2022.\n“Terry just kept turning a blind eye to everything,” said Drange. “She just doesn’t want to admit she made a bad hire.”\nDave Green said he did not press the issue with his cousin, the university president, because of the murder of four Idaho students on November 12, 2022.\n“It would be hard to call Scott up and say help us out when he’s on TV crying because four kids just got murdered on his campus.”\nBut other parents and players said they continued to raise concerns and file complaints with Gawlik in the ensuing months.\nDrange and Emmy Green were among eight players, including five starters, who signed a “grievance list” against Gonzalez after the 2022 season that they sent to Gawlik. The document detailed allegations of “nutrition issues,” “disregard for (player) safety,” “mental abuse,” and that Gonzalez relied on “fear & intimidation” to coach the team.\n“She didn’t hear us,” Drange said.\nDoorn, in a December 5, 2022 letter to Gawlik, detailed what he described as “textbook bullying behavior” by Gonzalez, outlining examples of alleged bullying, verbal abuse, “severe diet and meal issues while traveling,” and “zero attempts to create a culture or team identity, zero attempts at forming relationships with the athletes.”\n“Chris Gonzalez has demonstrated abusive verbal behavior and created an extremely negative culture and hostile environment,” Doorn wrote in the letter to Gawlik in which C. Scott Green, Matt Brewer, associate AD for compliance and Brian Wolf, the school’s faculty athletic representative, were also copied. “I am concerned about my daughter Kate’s mental health, and that of the entire women’s volleyball team. I am directing this note to Ms. Gawlik not only as the Athletic Director who oversees the athletic program, but as the Senior Women Administrator. These young female athletes need an advocate to help, provide advice, mentor, and to listen to their story of this volleyball season.”\nDoorn said he received a “generic response” from the university. Kate Doorn transferred to Sacramento State after the 2022 season and played a leading role in the team capturing the Big Sky regular season title.\nEd Barbeau, Kate Doorn’s grandfather, also raised concerns with Gawlik in 2022.\n“I warned you last December about Coach Gonzalez that there would be several players leaving your program because of his treatment,” Barbeau wrote in an email to Gawlik this week.\nKate Doorn, Barbeau continued in the email to Gawlik, “left after talking to YOU, walked away feeling you could care less. Left Idaho and her scholarship for ANYWHERE ELSE. Luckily she landed at Sac State, played for them and led their offense to the Big Sky Championship. Rewarded with a scholarship by Coach Volta. Played every game. She proved Kalisha wrong. She proved Gonzalez wrong.\n“So, Stand by and do nothing. The women of Idaho already know YOU don’t have their back!”\nFormer Idaho assistant coach Kalisha Goree said Kate Doorn didn’t have “the fire.”\nGawlik has also been the focus of widespread criticism for her response in the wake of a 9,000-word, SCNG report on December 30 in which current and former players alleged the coach routinely bullied and abused players during his two seasons at the Big Sky Conference school. Idaho held its first volleyball practice on Thursday since the initial SCNG report was published.\n“It feels like she’s scrambling,” a current Idaho player said.\nGawlik did not respond to a request for comment.\nIdaho has hired Thompson & Horton, a Texas law firm, to conduct an investigation into the culture of the volleyball program under Gonzalez.\nC. Scott Green held a book signings this week for his recently released “University President’s Crisis Handbook” in the Moscow.\n“By popular demand, our president is sharing his perspective on management through periods of intense turmoil and difficulty,” according to a press release on the university’s website. “..it is a handbook that educates leaders (and not just presidents) and provides various tactics and explanations that help you maneuver a crisis successfully.”\nUniversity officials did not respond to a SCNG request for comment on Gawlik’s performance or status, or a request to interview C. Scott Green.\nInstead a university spokesperson wrote in an email “We have made many resources available to our student-athletes to ensure they can make decisions that are best for them while we await the results of a thorough investigation. Student-athletes choosing to not participate in practice will maintain their scholarships. Investigators have reached out to dozens of people to request interviews and they are working expeditiously.”\nWhile Gawlik has repeatedly said she and the university have made player safety and mental health a priority, players allege an incident during the 2023 season undercut her statements. Instead, the players allege the incident demonstrates not only her unwavering support for Gonzalez, but why they don’t feel safe confiding in Gawlik or confident she has their best interests at heart.\nReturning from the Spokane International Airport last fall to the University of Idaho campus 87 miles to the south, Idaho volleyball players became alarmed by the way Vandals assistant coach Maria Logan was driving the car they were riding in, according to five players.\nAt one point the players said they noticed Logan driving nearly 100 miles per hour. The players reported the incident to university officials including athletic director Terry Gawlik.\nA few days later Gonzalez addressed the matter during a team meeting after a September 23 loss at Northern Arizona.\n“Either somebody in this room or somebody back home said something about Maria driving a hundred miles per hour on a road trip and of course everything gets back to me. So I hear everything,” Gonzalez, a former U.S. national team coach, is heard saying during a recording of the meeting obtained by the Southern California News Group.\nGonzalez then laughed before continuing.\n“She’s the slowest driver I know. And she drives that way because she feels responsible for your health and welfare. It gets back, everything that gets said. And when my boss says, ‘Why is she driving like that?’ I have to tell her whoever gave you that information is wrong.”\nIn fact, the incident was verified by five players, two of whom provided SCNG with a video of the speedometer exceeding 95 mph. Five players and two parents have also alleged that Logan was stopped for speeding while driving players earlier in the season and was able to talk her way out of being issued a ticket. SCNG has obtained a photograph taken by a player during the stop.\nLogan has referred requests for comment to the school.\nGonzalez’s comments after the Northern Arizona match, Idaho players and their parents allege, are not only an example of his alleged repeated attempts to bully and gaslight them, but also demonstrate Gawlik has prioritized supporting Gonzalez over the mental health and safety of Vandals players.\n“Our primary goal remains to uphold our values and the principles of an inclusive, supportive, and nurturing learning environment,” Gawlik wrote in a January 11 email to players. “We are committed to a timely, but fair and thorough investigation, and we appreciate your patience and understanding as we work through the investigative process.”\n“We all care about each and every one of you as students and student athletes,” Gawlik told Idaho players Tuesday, according to a recording of the meeting.Idaho players and parents allege that her words ring hollow.\n“Terry keeps talking about ‘we want you to feel safe,’” said the parent of a current player. “After the coach speeding and how the school and Chris handled it, would you feel safe going to Terry about anything?”\nRELATED\nIdaho expands investigation of volleyball coach Chris Gonzalez\nIdaho volleyball players ask school to place Chris Gonzalez on leave\nIdaho AD, president warned about Chris Gonzalez’s alleged abuse in December 2022\nIdaho weighing whether to allow players to opt out of practices with Chris Gonzalez\nIdaho women’s volleyball players can opt out of practices with Chris Gonzalez\nIdaho volleyball practice Thursday with Chris Gonzalez described as ‘weird’",
  "word_count": 2397,
  "scraped_at": "2026-02-14T12:07:48.998165"
}