{
  "article_id": "ea972d7fe031",
  "url": "https://www.publishersweekly.com:443/pw/by-topic/childrens/childrens-book-news/article/98262-spring-2026-children-s-sneak-previews.html",
  "title": "Spring 2026 Children Sneak Previews",
  "date": "20250722T234500Z",
  "domain": "publishersweekly.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "ABRAMS\nAbrams pricks up its ears for The Animals Speak by S.D. Nelson, which espouses that the teachings of our animal brothers and sisters can prepare us for the joys and challenges in the world; Tiny Garden by Deborah Underwood, illus. by Jax Chow, in which a boy sets out to grow his own tiny garden on a street that covets big, showy ones; Bearsuit Turtle Plays a Game by Bob Shea, which finds the duo from Bearsuit Turtle Makes a Friend inventing an imaginative and silly new game; Robin and the Stick by E.B. Goodale, showcasing the awe, frustration, and delight inherent in a pre-verbal child’s perspective of the big world around them; and “We The People” Is All the People by Howard W. Reeves, illus. by Duncan Tonatiuh, celebrating inclusion and exploring what the preamble to the U.S. Constitution leaves unsaid.\nABRAMS/AMULET\nAmulet rubs the lamp with The Genie Game by Jordan Ifueko, in which a girl on a mission to save her sister finds herself thrust into a world of genies, magic, and mystery; Penelope Positano Sees It All by Katie Cotugno, illus. by Amy Jindra, launching a chapter book series about a plucky seven-year-old who can see things other people miss; Funerals Are for the Living by Sami Ellis, about a girl who is kidnapped by a racist cult after investigating the supernatural happenings at her sister’s gravesite; The Last Dragon House by Liv Mae Morris, a middle grade debut introducing a magical boarding house for dragons and the unlikely boy destined to save it; and The Shrew Detective: The Case of the Pilfered Pearls by Margi Preus, illus. by Junyi Wu, starring Detective Minerva Shrew, who is called upon to solve the everyday mysteries of her animal friends.\nABRAMS/APPLESEED\nAppleseed opens up with My Box of Feelings by Sabrina Moyle, illus. by Eunice Moyle, a collection of board books that explore six big feelings; Charts for Babies by Michelle Rial, which presents early learning concepts through simple graphic charts and graphs; Hide-and-Seek Mommy by Marta Altés, featuring a hide-and-seek game between toddlers and their mothers, who just need a moment to themselves; Just a Shell… or Is It? by Becca McMurdie, illus. by Paola Escobar, in which a seashell can be many different things to many different creatures; and Breathe a Rainbow by Julie Koon, offering mindful breathing exercises and calming textures for children to trace with their fingers as they inhale and exhale.\nABRAMS/FANFARE\nFanfare scores with Lionel Messi’s World Cup Triumph by Chris Barish, illus. by Nate Sweitzer, kicking off a nonfiction graphic novel series featuring great moments in sports history; Once Upon a Tail by Audrey Perrott, illus. by Charlene Chua, the launch of an early reader graphic novel series following the everyday adventures of a dragon and a horse; The Lionharts by Mike Lawrence, in which the Lionhart brothers must save their parents and uncover the truth behind their legendary adventuring family; Colossal by Rutile, illus. by Diane Truc, a Webtoon about a young aristocrat who’s about to discover that the heart may be the strongest muscle of all; and BUUZA by Shazleen Khan, taking readers on a YA romp through a fantasy world inspired by Silk Road history and Asian and African Islamic mythologies.\nABRAMS/MAGIC CAT\nMagic Cat steps up to the barre for Anything Is Possible with Ballet by Steven McRae, illus. by Margaux Carpentier, providing step-by-step instructions from McRae, principal dancer with the Royal Ballet; 5 Minute Dinosaur Stories by Gabby Dawnay, illus. by Mona K, delivering nonfiction rhyming dinosaur stories; Buzz by Richard Jones, illus. by Sara Boccaccini Meadows, showcasing 15 bugs with extraordinary abilities; Come Along by Cosmo Sheldrake, illus. by Liniers, which celebrates nonsense verse based on the lyrics to a Sheldrake song; and What If? by Tom Schamp, first in a multiple-choice picture book series focusing on the power of asking “what if?”\nAKASHIC BOOKS\nAkashic whets its appetite with WillieBoy Eats the World by Steve Schirripa and Phil Lerman, illus. by Kirk Parrish, in which actor Schirripa and his beloved dachshund, WillieBoy, explore cuisines from around the globe.\nAPA/MAGINATION PRESS\nMagination Press put on its boogie shoes for Disco Dave by Jody Jensen Shaffer, illus. by Yana Kozak, the story of Dave the walrus, who loves disco but just can’t dance no matter how hard he tries; Love for Black Sons by Kimberly A. Gordon Biddle, illus. by David Wilderson, presenting a Black mother’s heartfelt promise to love her son forever as she asks the world to love him too; Jeff O’Lantern by Charlie Greenwald, illus. by Jelke Van Antwerpen, in which Jack O’Lantern’s shy younger brother finds his own way to shine on Halloween; The Sounds That Shelter Me by Bibi Senthi, illus. by Sayani Ray, which invites readers to join Mayuri, an autistic child, in repeating rhythmic Tamil sounds as she loses her voice in a sensory storm and finds it again; and Professor Thomas Cat’s Guide to Understanding the Human Brain: The Dyslexia Files by Rachael Allen, illus. by Miguel Díaz Rivas, in which Professor Cat presents the science behind dyslexia, while Ava, who actually has dyslexia, has a few things to add.\nAMICUS/AMICUS INK\nAmicus Ink checks the stopwatch for One Speedy Cheetah on the Big Blue Earth by Tory Christie, illus. by Luciana Navarro Powell, showcasing the African environment as a baby cheetah finds her place on the big blue Earth; Betsy Tacy for Small Children by Maud Hart Lovelace, illus. by Lois Lenski, the adventures of Betsy, Tacy, and their childhood published for the first time in a picture book edition with colored versions of Lois Lenski’s illustrations and abridged text; and Whose Ears? and Whose Toes? by Kristina Jones, which pose questions and answers in a peek-a-boo style.\nANDERSEN PRESS USA\nAndersen Press USA sticks its neck out for Giraffe and a Half by Nicola Kent, the story of a giraffe with six legs and three ears who believes she is too different to make friends; When the Storm Came by Chris Naylor-Ballesteros, in which Little Frog finds out that the Big Scary Thing in the tree stump is not so scary but is instead a friend; Home Is Where My Heart Is by Smriti Halls, illus. by Alice Courtley Cambridge, following Bear’s journey far from home and back again; Shine Like the Stars by Anna Wilson, illus. by Harry Woodgate, which shows readers that they are connected to the Earth, the stars, the ocean, and more.\nARCHIPELAGO BOOKS/ELSEWHERE EDITIONS\nElsewhere Editions checks the current for The River by Claude Ponti, a tale of friendship and adventure set in a fantasy world of two floating villages on the river Longo; and Little Yu and the Treelings: Lost in Peach Blossom Paradise by Xiong Liang, beginning a fantasy series in which city girl Little Yu follows marching peach blossom petals to a magical world inspired by ancient Chinese myth, traditions, and tales.\nBAREFOOT\nBarefoot Books relaxes with Breathe Deep by Joanie Leeds, illus. by Bárbara Quintino, an original lullaby singalong using mindfulness to help kids calm down and get ready for sleep; Mari and the Great Market Swap by Janelle Springer-Willms, illus. by Julian Eigner, in which Mari devises a plan to make sure all the sellers can bring home the food their families need after they face a market day with no customers; Myths of America’s Founding by Christy Mihaly, illus. by Marta Sevilla, which investigates the familiar myths about the founding of the United States and what really happened; When I Grow Up, I Want to Be a Chair by Ryan Rae Harbuck illus. by Barry Lee, the story of Vo, who doesn’t want to work like all the grumbling grown-ups but would rather be a chair; and Alex and the Squid by M. Wilson Duff, following cephalopod lover Alex, who is so captivated by a book fair title about his favorite animal that he tucks it under his arm and takes it home.\nBEHRMAN HOUSE/APPLES & HONEY\nApples & Honey chooses colors for Paint My World by Esther Novak, illus. by Susan Gal, about a child facing a range of sometimes conflicting emotions in response to changes in the weather that affect plans and activities; Zoey Zoombeck Superhero by Heidi E. Y. Stemple, about a girl who receives a cape as a birthday gift that transforms her into a superhero; Under The Rubble by Elisa Boxer, illus. by Oksana Drachkowska, the true story of how the Jews of the Warsaw Ghetto defiantly documented what was happening to them, hiding the papers in canisters buried deep in the rubble of the ghetto, which were discovered afterwards and shared with the world; Last Days in Moav by Sharon Reiss Baker, a multiple POV YA novel set in the biblical age, centering twins with a mysterious healing gift that makes them outsiders in their tribe; and Liberty Club House by Ellen Schwartz, the story of three young friends who form a secret society in 1784 in Boston to support Jews and other religious minorities who are forbidden from building their own houses of worship.\nBLOOMSBURY\nBloomsbury goes round and round with Olive Oakes and the Haunted Carousel by Kalynn Bayron, about a young mystery enthusiast who uncovers a mystery linked to the traveling circus that comes through their town; Kat & Mouse: Let’s Have a Sleepover! by Salina Yoon, which finds Kat and Mouse struggling to agree on an activity during their sleepover; More Than a Million by Grace Farris, celebrating the unconditional love parents have for their children; Princess Academy by Shannon Hale, illus. by Victoria Ying, adapting the 2006 Newbery Honor title as a graphic novel; and Red River Rose by Carole Lindstrom, in which Rose, a Métis girl in the 1800s, embarks on an adventure to protect her family and community when tensions rise over joining the resistance; These Shattered Spires by Cassidy Ellis Salter, featuring familiars Taro and Nixie who are forced into a deadly competition following the king’s murder; Reign of Shadows by Gabi Burton, which finds Mira in danger of having her lie-powered magic exposed; If We Never End by Laura Taylor Namey, in which Sylvie’s summer turns into an unexpected adventure when she discovers a vintage gold watch that summons the ghost of a boy named Penn; Call2Arms by Matteo L. Cerilli, in which the monsters from Wyatt’s favorite video game appear in real life and threaten the entire country; and We Have Always Been Here by Jen St. Jude, the story of Calla and their girlfriend, who find a place to belong in a mysterious house filled with teens from various time periods.\nBLUE DOT\nBlue Dot Kids Press is in tune with Everything Is Music by Miran Park, focused on the many sounds of nature; Wide Open Spaces by Robyn McGrath, illus. by Polina Gortman, which finds a child imagining stepping into the skin of animals seen along the way during their family’s annual road trip to visit Grandma; and Breathe In, Breathe Out by Hu Yifan, in which readers are invited to breathe in (watching fireworks) and breathe out (blowing out birthday cake candles) with every turn of the page.\nBLUE STAR\nBlue Star Press cheers Olé, Olé, Olé for ¡GOOOOOOOL!: A Bilingual Book of Soccer by Mike Alfaro, illus. by Gerardo Guillén, introducing soccer terms in English and Spanish; The Unbreakable Piñata by Alfaro and Guillén, about a stubborn piñata that refuses to break; and You Stole My Name Foodies by Dennis McGregor, featuring animals and foods with shared names, e.g. dinosaur kale.\nCANDLEWICK\nCandlewick Press decorates the gym for Operation: School Ball by Angourie Rice and Kate Rice, which finds Amy’s dream date to the Senior Year Ball derailed by an unexpected text; Relic Hamilton, Genie Hunter by Joseph Coelho, illus. by Hyun Song We, in which 12-year-old Relic polishes a mysterious brass lamp in his grandfather’s antique shop and finds a real live genie standing before him; Wiggling Words by Kate Rolfe, which visually conveys the experience of dyslexia or neurodivergence as a child invents a creative way to tackle a mountain of letters by using letter shapes to build a world of possibilities; Honor Flight: Celebrating America’s Veterans by Jeff Gottesfeld, illus. by Matt Tavares, featuring an anonymous veteran describing the impact of a trip to tour the service member monuments in Washington, D.C., and receiving an appreciative welcome home; and Is This... Spring? by Helen Yoon, following an exuberant pup that finds an antidote to the hacking and sneezing of spring allergies.\nCANDLEWICK/MIT KIDS PRESS\nMIT Kids Press pulls out its field journal for Extreme Birdwatching: Measuring Change on a Galápagos Island by Loree Griffin Burns, illus. by Jamie Green, presenting a “you-are-there” account of a husband and wife’s 40-year study of how finch beaks change in response to their environment; After the Rain by Eleanor Spicer Rice, illus. by Fiona Lee, in which a leading scientist offers a closer look at what happens in the natural world following a rainfall; Cora’s Beach Adventure by Sally M. Walker, illus. by Julie Kwon, spotlighting a day of science-based discoveries and adventures by the shore; and Sama Crushes the Code by Samaira Mehta, illus. by Jenny Alvarado, which finds Sama feeling insecure about being able to help her middle school Tech Club get to the Code Crusher championship.\nCANDLEWICK/MITEEN PRESS\nMITeen Press steps into the lab with Discovering Life’s Story: The Birth of Genetics by Joy Hakim, continuing Hakim’s series charting the path of human discovery, as scientists race to unravel our genes and the mysteries they hold.\nCAPSTONE/CAPSTONE EDITIONS\nCapstone Editions sounds out spring with How to Teach Your Monster the ABCs by Christianne Jones, illus. by Katya Longhi, in which a child and their pet monster go on a scavenger hunt to discover objects that start with each letter of the alphabet; Just Like Rabbit by Katy Hudson, about a frog who strives to emulate Rabbit and must decide who he’s really meant to be; and Octavio by Dustin Resch, starring a curious octopus who pops out of his reef to observe the divers who are observing him.\nCAPSTONE/CAPSTONE PRESS\nCapstone Press ties on its cape for The Dynamic DC Origin Story by Benjamin Harper, offering a behind-the scenes look at the evolution of DC characters Superman, Batman, and Wonder Woman in comics, TV shows, and movies; and Next Level Minecraft Trivia: An Unofficial Guide by Jim McDermott, designed to help readers level up their Overworld know-how.\nCAPSTONE/PICTURE WINDOW\nPicture Window Books dishes up Eat Your Food, Fussy Filo! by Nico Waters, illus. by Rita Ribeiro Lopes, in which young Ethan tries to help a neighbor transition their fussy cat to a new food; My Axolotl Life by FB Smit, illus. by Brooke O’Neill, which follows a Wild Type axolotl through a day in its life; Parker Poop’s Icky, Sticky Sewer System Journey by Jamee-Marie Edwards, illus. by Christian Cornia, chronicling Parker Poop’s journey from the toilet bowl to the sewer pipe to the water treatment plant and beyond.\nCAPSTONE/STONE ARCH\nStone Arch Books goes incognito for The Spy in the Library by Bryan Patrick Avery, illus. by Ma Pe, in which junior spies Kat and Harry embark on a mission to memorize a name that’s encrypted with a cipher and written inside a magic book; and The Magical Morrisons: Love Potion Commotion by Kristen Aguilar, illus. by George Ermos, following the exploits of young witch Nina, who has a crush on a new boy at school.\nCICADA BOOKS\nCicada steps into spring with Shoes! A footwear fashion frolic by Daisy Wynter, showcasing the rich history of footwear; Why Do We Sleep? by Cathy Evans, illus. by Polya Plavinskaia, an investigation of the science of sleep, including how circadian rhythms work and what dreams are for; Finding Life: A Prehistoric Search and Find by Sophie Williams, which combines illustrations depicting the landscapes and creatures of the prehistoric epochs with informative text and a search-and-find; Everything Amplified by Ziggy Hanaor, illus. by Sarah Lippett, following the lives of twin brothers Nel, a 15-year-old music nerd, and Ludo, who seems to breeze through the relentless social complexities of teenage life; and Flush It Down: The story of sewers through time by Rob Flowers, exploring the history of waste disposal from ancient Rome to today.\nCHARLESBRIDGE\nCharlesbridge gets tricky with Anansi and the Talking Cloth by Caroline Brewer with Kwasi Asare, illus. by Ekua Holmes, in which Anansi the spider must save the city when spiders who make kente cloth stop their weaving to protest mass-produced cloth; Remember Her Name: Debbie Allen’s Rise to Fame by Tami Charles, illus. by Meredith Lucius, showcasing the struggles and triumphs in the career of dancer and actor Allen; Something Sweet: A Sitting Shiva Story by Leslea Newman, illus. by Sarita Rich, which finds Lizzie participating in the Jewish customs of shiva in support of her friend, who is mourning the loss of his grandfather; Ways Papi Says I Love You by Delia Ruiz, illus. by Carlos Velez Aguilera, celebrating the father-daughter relationship inspired by the author’s own truck rides with her dad through a ranch in Mexico; A Place to Dance: How Richard Lamberty Brought Change to the Ballroom by Eric Rosswood and Richard Lamberty, illus. by Vincent Chen, focusing on how Lamberty broke traditional gender roles via same-sex ballroom dancing.\nCHARLESBRIDGE MOVES\nCharlesbridge Moves wings into spring with The Avian Adventurers #1: Snowy Owl Rescue by Heidi E. Y. Stemple, illus. by Natasha Donovan, first of the avian adventures undertaken by the students at Maynard Elementary, who fight a freak snowstorm to save a rare snowy owl.\nCHARLESBRIDGE TEEN\nCharlesbridge Teen goes green with Footeprint: Eunice Newtown Foote at the Dawn of Climate Science and Women’s Rights by Lindsay H. Metcalf, a fictionalized look at the first woman to identify carbon dioxide as a cause of climate change in 1856; and Onward: Climate Fiction to Inspire Hope, edited by Nora Shalaway Carpenter, an anthology of short stories centered on the climate crisis.\nCHOOSECO\nChooseco is out of sight with The Stowaway by Griffin McElroy, a multiple-ending story set on a space ship heading toward a black hole; Dungeon Crawl at the Haunted Mall by Jendia Gammon, in which readers navigate a hazardous mall in the late ’80s to rescue their friend; and Kaiju Gaga by E.C. Myers, about a school trip to the Museum of Media that involves accidentally cracking open a monster egg.\nCHRONICLE\nChronicle Books sounds the alarm for Construction Site Firefight by Sherri Duskey Rinker, illus. by AG Ford, in which Fire Engine, Foam Truck, Water Tender, and the rest of the mighty fire crew join forces with the classic Construction Site friends to save the day; Tiny Tries Soccer by Jonathan Stutzman, illus. by Jay Fleck, kicking off a series featuring pint-size dino Tiny trying his favorite things; Mysterious Things by Andy J. Pizza and Sophie Miller, an exploration of Mysterious Things—lost things, forgotten things, things we don’t know, and even things we don’t know we don’t know; Shrinking Violet by Laurel Snyder, illus. by LeUyen Pham, about Violet, who when she is afraid, doesn’t just feel small—she actually shrinks; and Chopsticks Are by Chloe Ito Ward, illus. by Lynn Scurfield, which celebrates how chopsticks are used by so many people all over the world.\nCHRONICLE/PRINCETON ARCHITECTURAL PRESS\nPrinceton Architectural Press slithers into spring with Colorful World of Reptiles by Matt Sewell, featuring watercolor art and facts about 45 species.\nCOLLECTIVE BOOK STUDIO\nCollective Book Studio soars into spring with Rainbow Colors by Yvonne Pearson, illus. by Carole Chevalier, a primer on all the vibrant colors of the rainbow; The Fly Who Flew Under the Sea by Lauren Sánchez, illus. by Raleigh Stewart, following Flynn the Fly on a new adventure exploring our ocean's wonders; Through the Garden Gate by Sharon Rose, illus. by Erin Brown, in which Miles is bored one summer day, until he finds a mysterious garden gate that leads him on a magic-filled adventure; Little Bee and the Bloom by Carly Kremer, illus. by Katie Hunt, following Little Bee and Bloom as they learn about pollination and how to spread flowers far and wide; and Ocean Superheroes by Gabrielle Raymond McGee, illus. by Anastasiya Halionka, in which oceanographer Dr. Sylvia Earle helps students dive into the biodiversity of the ocean, teaching them about the harmony of life and inspiring simple actions to protect our planet.\nCONCORDIA\nConcordia ushers in the season with J Is for Jesus by Joni Walker, a Christian alphabet book featuring words designed to strengthen readers’ faith.\nCREATIVE COMPANY/CREATIVE EDITIONS\nCreative Editions opens wide the door with A Place in the World by Rina Singh, illus. by Christopher Pouler, a refugee tale that conveys the message that everyone deserves to find a safe place in the world; The Burning of the Books by Jonah Winter, illus. by Gary Kelley, telling an ominous story of the Nazi book burnings, warning that such events could happen anywhere, even in the United States; Climbing by Amy Lowell, illus. by Paolo Domeniconi, in which an ordinary tree-climbing outing becomes an imaginative adventure; The Great Northern Expedition by Maria Cristina Pritelli, reimagining Russia’s 18th-century voyage to Siberia and Alaska; and You Belong in this World by Lori Peelen, illus. by Tom Leonard, offering a look at the diverse ways nature’s offspring come into the world with an inclusive message that no matter the method, everyone belongs.\nDISNEY HYPERION\nDisney Hyperion fluffs its pillow for Goodnight, Bruce by Ryan T. Higgins, in which Mother Bruce’s family of mice and geese will do anything to get out of going to sleep; Royalslinger by Graci Kim, second in the Slinger series where dragons and phoenixes roam the skies of Seoul and dreams literally come to life; Habitat Heroes by Daniel Bernstrom, illus. by Carolina Coroa, debuting a picture book series following a team of kids who combine their tools, facts, and feelings to build dream homes for the animals in their town; Griffinspeaker by Jan M. Flynn, the story of 12-year-old Rain who bonds with the last wild griffin and has the chance to change her fortune—and possibly her world; and The Amazing Augustus by Tammi Sauer, illus. by Pauline Gregory, starring a hubristic squirrel who is so busy celebrating himself that he winds up in the belly of a lion.\nDISNEY/DISNEY PLANET POSSIBLE\nDisney Planet Possible buzzes into the season with Green Jolene and the Backyard Bees by Wendy Mass, illus. by Billy Yong, in which Jolene and her neighbors devise a plan to save the bees; and The Honeybee Highway by Shanna Upchurch, illus. by Dagmar Smith, which finds seven-year-old JJ along for the ride as an 18-wheeler drives across the country to deliver more than 400 beehives to the almond groves of California.\nDISNEY/FREEDOM FIRE\nFreedom Fire takes a running start for Rayana Johnson’s Giant Leap by Jill Tew, featuring a STEM-loving Black girl finding her place in the universe again after news of her parents’ divorce—and her first period—knocks her out of orbit.\nDISNEY/HYPERION\nHyperion is well armed for Hunting the Strange by Kaitlyn Cavalancia, next in the Mystery Royale series which finds Mullory returning to Stoutmire Manor amid new powers, puzzling questions, and an even deadlier mystery; Body Count by Codie Crowley, focused on three wishes, one prom queen celebrating with her squad, and one monster who will keep killing until the wishes are paid for; In Between Days by Camryn Garrett, the story of a teen who explores her queerness and navigates her grief through a friendship with her deceased father’s ex-love; and The Ruins Beneath Us by Sasha Sloan, in which an elven girl hiding in the human world must uncover the mysteries surrounding her forbidden elven heritage while falling for two very different human men.\nDISNEY/MELISSA DE LA CRUZ STUDIO\nMelissa de la Cruz Studio wags its tail for Pet Placement Society by Primo Gallanosa, about a group of tweens who form a club to help find the perfect homes for animals at the local shelter while learning how to deal with middle school drama.\nFAMILIUS\nFamilius creeps and crawls into the season with Lydia Loves Bugs by Heidi E.Y. Stemple, illus. by Yuliya Pankratova, about a girl who prepares a school show-and-tell all about bugs with the help of her entomologist mother; Claude by Phyllis Harris, in which a young artist sets out to paint her own masterpiece inspired by Claude Monet—but her puppy has other plans; The Book Machine by Laurie Duersch, illus. bu Susanna Covelli, following a book-loving boy who builds a machine, hoping to create his own library; Nighty Night, Dinos by Deborah Holt Williams, illus. by Anna Doherty, in which dinosaurs wind down and snuggle up for a good night's sleep; and Call Your Father by Tracy Gold, illus. by Vivian Mineker, following a boy and his father through life’s milestones—both the highs and the lows.\nFLORIS\nFloris changes things up with My Grandma the Chameleon by Maria Löfgren, which finds Ari on a hide-and-seek hunt for Grandma through the rooms of her amazing home; Abdullah’s Bear Needs a Name by Yasmin Hanif, illus. by Sophie Benmouyal, in which Abdullah is inspired by a family story from Pakistan to consider giving his teddy bear a name from his own culture; All Our Families Are Awesome by Charlotte Bellière, illus. by Ian de Haes, offering a childlike perspective on diverse family structures; Celtic Folk and Fairy Tales by Lari Don, illus. by Elise Carmichael, featuring traditional folk tales from Scotland, Ireland, Wales, Cornwall, the Isle of Man, and Brittany; and Once Upon a Pickup Time by Johanna Lindemann, illus. by Mareike Ammersken, in which Ben, who is always last to get picked up from kindergarten, invents a fantastical tale about why his father can’t come sooner, and all the other children want to stay behind to listen.\nFOCUS ON THE FAMILY\nFocus on the Family is fired up for spring with Imagination Station: Faith in the Flames by Marianne Hering, in which cousins Patrick and Beth visit the time of the apostle Paul’s final imprisonment when a huge fire broke out in Rome; and The Blackgaard Chronicles: The Scotch Game by Phil Lollar, which finds Jack and Jason seeking answers as a wave of vandalism strikes the town of Odyssey.\nFREE SPIRIT\nFree Spirit bundles up for Thank You, Snow by Dan McCauley, illus. by Jo Loring-Fisher, about a girl and her family being drawn outside to take a walk in the fresh snowfall; Arlo All Over Again by Sayuri Stabrowski, illus. by David Szalay, in which two boys find themselves forming a surprising friendship over the course of a couple of snow days; Celebrate We Gullah Geechee by Yvette R. Murray, illus. by Tonya Engel, following five young narrators who each celebrate and share sensory poems about the sights, sounds, textures, smells, and tastes of the Gullah Geechee Heritage Corridor; Santiago and Great Bear by Lisa Johnston Hancock, about a boy who moves to a new place and wishes on a star for a friend; and the debut titles of the Disability Books for Kids series by various authors and illustrators, which introduce children to a variety of physical, intellectual, developmental, emotional, sensory, health, and learning disabilities.\nGECKO\nGecko Press roars into spring with My Tiger by Joy Cowley, illus. by David Barrow, in which a boy’s pet tiger is apprehensive about his first trip to the dentist; Edith by Catharina Valckx, following a girl who is gifted with eternal childhood as she tries to reverse that spell 100 years after her birth, at the age of seven; The Fluffy Futon by Yuichi Kasano, the story of how each member of the household, one by one, discovers that a soft fluffy futon in the sun is an irresistible spot for a nap; The Monster in the Night by Mats Strandberg, illus. by Sofia Falkenhem, about a town terrorized by monsters, and a warm-hearted werewolf trying to find his pack; and Tomorrow I’m in Charge by Jörg Mϋhle, following forest pals Bear, Weasel, and Badger as they try to decide what game to play.\nGLOBE PEQUOT\nGlobe Pequot browses the stacks with Vivi A-Z at the New York Public Library by Angela Classi, an exploration of literature, music, and historical and cultural figures found at the New York Public Library, led by Viviani Fedeler, who was born and raised there.\nGLOBE PEQUOT/MUDDY BOOTS\nMuddy Boots rises and shines with Anyone Else Awake?: A Dawn Chorus by Carmela Coyle, illus. by Bonnie Kelso, following the dawn as it moves through three phases, each one represented by different bird species awakening with their unique songs; Scout Moore, Junior Ranger: Rocky Mountain National Park by Theresa Howell, illus. by Jeffrey Ebbeler, in which Scout Moore, “the ranger of her own backyard,” travels to Rocky Mountain National Park in Colorado; Twelve Days of Spring by Sherri Maret, illus. by Thomas Hilley, reimagining “The Twelve Days of Christmas” by enumerating wonders of wildlife and nature’s vibrant transformations observed during spring; and Unusual Ocean: Who Lives in the Deep? by Meghan Jones, introducing children to 26 of the most unusual creatures to inhabit the oceans.\nGLOBE PEQUOT/NORTH COUNTRY\nNorth Country Books skates into season with Puck Hog: Trophy Thief Mystery by Christie Casciano, illus. by Rosie Moziak, which finds a squirt hockey team on the hunt for the missing Lake Placid Invitational Cup; and Adirondack Spring by Brian Heinz, illus. by Michelle Garlock, featuring animals emerging from winter rests, and the rebirth of green nature.\nGROUNDWOOD\nGroundwood Books heads to the pitch for One Goal by Heather Camlot, illus. by Drew Shannon, which shows how the passion of soccer fans around the world can and should be used in the fight against climate change; A Friend Is a Friend Is a Friend by Sara O’Leary, illus. by Qin Leng, in which a child attending summer camp for the first time considers the best way to make and be a friend; The Space Between by Naseem Hrab, illus. by John Martz, offering a playful exploration of the possibilities that live in the spaces between words, actions, and even between friends; Planting Sunshine by Andrée Poulin, illus. by Enzo, which finds Theo inspired to raise money for victims and sow the seeds of peace after learning about a devastating yet distant war on TV; and Leo and Ralph by Peter Carnavas, the story of 10-year-old Leo, who comes up with a backup plan when his parents ask him to say goodbye to his imaginary alien friend Ralph.\nHARPERCOLLINS\nHarperCollins polishes its crown for The Night King’s Court by Elisa Bonnin, in which Ida uses her gift of magical weaving to work in the palace, but discovers she must unravel the castle’s secrets before a new dark magic destroys her; Royal Summer by Kass Morgan, which finds Hannah working at a castle gift shop in Scotland for the summer—and falling hard for the Prince of England; The Velvet Knife by Maureen Johnson, featuring Stevie Bell, back in a new standalone mystery; A Room with a View by Joanna Ho, illus. by Thaís Mesquita, about a boy who is reluctant to go on outdoor adventures with his mother, who ultimately realizes there are more memories to treasure than he initially believes; Honeybird Blue by Taunya English, illus. by Raissa Figueroa, following a girl and her father on a nature walk to look for the many colors of birds; Hypergifted by Gordon Korman, featuring super-genius Noah who goes to Wilderton University and ends up needing to use all his middle-school smarts to fix a haywire program before it ends the world; It Takes a Family to Serve by Lisa Wheeler, illus. by David Soman, celebrating the selfless friends and family who serve at home while their loved ones in the military serve their country; Medusa’s Pet Rock by Steph Lau, launching a humorous picture book mythology series, which puts a new spin on the “monstrous” Medusa; The Skeleton and the Cat by Brandon James Scott, presenting a series of stories about Skeleton and Cat forming a sweet, strange, and often humorous friendship; and Spendin’ Time by Gary R. Gray Jr., illus. by Rahele Jomepour Bell, about a boy and his grandfather spending a slow day in each other’s company.\nHARPERCOLLINS/AMISTAD\nAmistad puts on a pedometer for 7 Million Steps by Derrick Barnes and Christian Gregory, illus. by Frank Morrison, about comedian and activist Dick Gregory’s Food Run of 1976 to combat world hunger.\nHARPERCOLLINS/CLARION\nClarion looks on the bright side with While We’re Here by Anne Wynter, illus. by Micha Archer, the tale of a mother and daughter who miss a birthday party but delight in small pleasures throughout the city all the same; The Dream by Gideon Sterer, illus. by Nik Henderson, a wordless fantasy which imagines a world in which children come together to make the environment better for all those who live in it—including those who are furred, feathered, and finned; Chasing Eruptions by Curtis Manley, illus. by Katherine Roy, a biography in verse of Maurice and Katia Krafft, French scientists who saved countless lives based on their daring volcano research; Just One Gift by Linda Sue Park, illus. by Robert Sae-Heng, a novel-in-verse companion to The One Thing You’d Give, capturing a classroom discussion about gift giving, and exploring themes of transformative connection, community, and gratitude; and Rialto by Kate Milford, in which two sisters spend their vacation discovering the secrets of an unusual town and its abandoned amusement park.\nHARPERCOLLINS/GREENWILLOW\nGreenwillow saddles up for the season with This Ain’t Our First Rodeo by Liara Tamani, a Western romance between rodeo champ Shawn and local rich girl Josie set in Houston; Clair and the Cathedral by Pam Fong, a wordless picture book in which a girl finds beauty in unexpected places when she visits a cathedral with her mother on a rainy day; I Used to Be a Dinosaur by Casey Lyall, illus. by Laurie Keller, about a proud mama chicken who demands respect for herself and her chicks; Pull by Alex London, illus. by L. Fury, telling the true story of a boy, his dad, and a gun; and The Weedy Garden: A Happy Habitat for Wild Friends by Margaret Renkl, illus. by Billy Renkl, which introduces the varied residents of a biodiverse garden.\nHARPERCOLLINS/HARPERALLEY\nHarperAlley takes a bow with Encore! by Miles Toriko Burks, following Clay and Aron, two former best friends turned strangers, who are thrown back together to work on a project for their theatre class; A Kid Like Me by Norm Feuti, in which Ethan grapples with fitting in when his broken backpack and ancient phone aren’t quite up to snuff in the social landscape of middle school; Lightfall: A Place Between by Tim Probert, which finds Bea, Cad, and the rest of the crew arriving on the shores of the island nation Pellidyr, where they must confront a devastating loss and an impossible decision; My Imaginary Duck by Graham Annable, featuring Mavis and her imaginary duck as they go on adventures and find that four-player games may be even more fun after all; and Speak of the Devil by Sweeney Boo, the witchy sequel to Over My Dead Body, in which Abigail fights to clear her name when strange occurrences continue to plague Younwity Hidden Institute of Witchcraft.\nHARPERCOLLINS/HARPERPOP\nHarperPop laces up its cleats for Ultimate Unofficial World Cup Book by Maria Barbo, the go-to guide to the Summer 2026 World Cup; and The Creature Cases: Welcome to CLADE, laying out the ins and outs of being an animal detective.\nHARPERCOLLINS/HEARTDRUM\nHeartdrum looks to the sky for An Expanse of Blue by Kaua Mahoe Adams, the story of a Native Hawaiian girl who fights back against the confines of her strict family and society; Free to Fly by Karina Iceberg, illus. by Steph Littlebird, presenting a hopeful conversation between a grandparent and grandchild about the trauma of the Native boarding schools, and dreams of the future; Here Come the Aunties! by Cynthia Leitich Smith, illus. by Aphelandra, about aunts by kinship as well as family friends, neighbors, and community members who all step up to fill the important role of “auntie”; Shards of Silence by Brian Lee Young, a tale that bridges the generational divide between a Navajo teen at an elite prep school and his great-grandmother’s experience at a Native boarding school; and The Witches of Bear Creek Falls by Christine Hartman Derr, in which a Cherokee girl stands up to bullies with a set of new friends in her new school, while learning how to wield a delicious magic that her late mother passed down to her.\nHARPERCOLLIN/QUILL TREE\nQuill Tree Books generates a fiery list with Each and Every Spark by Claire Swinarski, a middle grade novel straddling two timelines in Paris—one set in the Nazi-occupied 1940s, the other in the present—and follows the mystery surrounding a painting that vanished during the French Resistance’s fight against Hitler’s regime; Their Will Undone by RJ Valldeperas, first in a YA fantasy romance duology about a 17-year-old girl who is chosen to marry the emperor, but during her travels to the palace, finds herself falling for her escort and discovering a spark of magical power that could change her destiny; Estela, Undrowning by René Peña-Govea, in which 17-year-old Estela is thrust into the spotlight of debates around merit-based admissions at her exclusive San Francisco high school; Few Blue Skies by Carolina Ixta, following a teen who fights to protect her family and community from a mega corporation taking over her town; and Queso, Just in Time by Ernesto Cisneros, following Queso, who wishes under the full moon to see his late father again, and suddenly finds himself back in 1985 with Pancho, the boy who will grow up to be his dad.\nHARPERCOLLINS/STORYTIDE\nStorytide steps into the ring with Worst in Show by PJ Gardner, illus. by Tim Jessell, featuring a hapless ferret who decides to prove himself to his furry crime family by foiling a plot to sabotage the Baskerville Dog Show; Better the Devil by Erik J. Brown, a contemporary psychological thriller about a queer homeless teen who, in a bid for safety, assumes the identity of a boy who went missing 10 years ago—only to find that there’s a dark secret about the boy’s disappearance; If You Were Here by Abigail Johnson, following Lili and Wren over a Nantucket summer, as they investigate a historical mystery and fall for each other along the way; The Littlest Elephant: A One and Only Ruby Story by Katherine Applegate, illus. by Lita Judge, a picture book adaptation of the middle grade novel The One and Only Ruby, chronicling Ruby’s memories of her early life in Africa; and The Revolution of Olivia Witherson by S. Isabelle, companion novel to The Great Misfortune of Stella Sedgwick, following Stella’s prim and proper cousin Olivia as she comes face-to-face with the reality of life for the working class in 19th-century France.\nHARPERCOLLINS/TOMMY NELSON\nTommy Nelson looks for sparks of joy with Winnie’s Pile of Pillows by Dana K. White, offering tips on how to tidy up; That’s What Heroes Do by Adam Kinzinger, which takes a closer look at what makes a real-life hero; Calm Thoughts for Kids: 40 Devotions for Anxious Days by Max Lucado, offering hope and calm for kids who are facing fears and having anxious thoughts; Heroes, Dreamers, and Saints: 40 Devotions for Anxious Days by Amy Kerr, highlighting 365 heroes who have made a difference in the world; and We Are Home When We’re Together by Jen Stoffer and Grace Start, which finds the mother-daughter designers Stoffer and Start of The Established Home helping kids facing moving and other changes.\nHARPERCOLLINS/VERSIFY\nVersify is golden with 24 Karat Dad by NoNieqa Ramos, illus. by Hatem Aly, which celebrates fathers; Can’t You See It’s Coming? by Erika Turner, a collection of YA stories by multiple Black authors that explore American racism through the lens of horror; and Tough Times by Raul the Third, illus. by Elaine Bay, focused on a young luchador-in-training, Kid Toro, who struggles with a losing streak and learns a valuable lesson from his coach.\nHARPERCOLLINS/WALDEN POND\nWalden Pond Press bars the door with No One Escapes the Island by Christopher Healy, in which the detective from No One Leaves the Castle is back in another magical murder mystery mashup; and The Ghosts of Dreadsea by Laura Ruby, about three kids dealing with the fallout of a devastating storm that tore through their Jersey shore hometown—as well as the memories, and ghosts, it unearthed.\nHELVITQ\nHelvetiq takes measure of spring with Faster Than a Jet, Bigger Than a Whale by Andrea Minoglio, illus. by Bethany Lord, providing a guide to the biggest, the fastest and the most astounding; and The Big Book of Pi: The Famous Number You Can Never Know by Anita Lehmann and Jean-Baptiste Aubin, illus. by Joonas Sildre, in which a mathe-magician explores what makes Pi so intriguing, so unknowable, and so very important to our lives.\nHIGHLIGHTS\nHighlights Press wraps up the season with Daddy’s Little Burrito by Jody Jensen Shaffer, illus. by Ana Zurita, a novelty book for fathers and babies to share; Puzzle-a-Day Challenge: Bite-Size Puzzles All Year Long, containing 365 puzzles, including word, math, logic, and classic hidden pictures puzzles; Why, How, and Wow! Space by Stephanie Warren Dimmer and Andrew Brisman, which answers kids’ questions about the universe with expert explanations, NASA astronaut interviews, humorous illustrations, and jokes; Can You Find Steve?, delivering a search-and-find challenge featuring Steve, a tiny but sneaky duck hiding in 50 photo puzzles; and How to Draw Hidden Pictures by Jannie Ho, offering tips on how to hide objects in your artwork.\nHOLIDAY HOUSE\nHoliday House eats its vegetables with Broccoli Is Trying to Kill Me by Katie Evans, illus. by Savannah Allen, in which a girl who finds herself up against an army of vegetables learns the best way to fight back is to take a giant bite; Straight to the Source by K-Ming Chang, the story of two estranged girlfriends who discover simmering romantic feelings—and skeletons in both girls’ family closets—when they reconnect; Serendipity by Gabbie Benda, which finds Serendipity seemingly cursed with the fate of “bad luck forever” when she accidentally knocks over a fortune-telling machine at the carnival; Korobá: The Case of the Missing Kolo: A Graphic Novel by Àlàbá Ònájìn, featuring 10-year-old aspiring sleuth Korobá who tries to catch a piggy bank thief in her Nigerian fishing village; and Secrets at Sparhawk Point by Anna Rose Johnson, about a group of kids hoping to draw tourists to their declining coastal town by claiming to have seen a mythic creature from Ojibwe legend.\nHOLIDAY HOUSE/PORTER\nNeal Porter Books gets the creative juices flowing with Off the Wall by Molly Idle and Juana Martinez-Neal, which begins as one girl alone with a wall and a bucket of chalk designs a community mural as friends and neighborhood animals join in; Bored! by Felicita Sala, following young Rita, who is so bored that her mind drifts to the beginning of a daydream that turns into much more; A Potion, a Powder, a Little Bit of Magic by Philip C. Stead, about a kingdom whose castle rests on the backs of 24 goats, one of which escapes and sets off a twisty rescue mission; Past Perfect Radioactive: My Life in Ukraine in Words and Pictures by Yevgenia Nayberg, the author’s graphic novel account of her childhood and dream of attending art school in 1980s Ukraine, amidst the turmoil of Soviet control, the Cold War, and the Chernobyl nuclear disaster; and On Fridays by Winsome Bingham, illus. by Jason Griffin, introducing Jamar, who befriends many senior citizen mentors when he takes the bus on Fridays after school to meet his Momma at the assisted living center where she works.\nINSIGHT EDITIONS/WELDON OWEN\nWeldon Owen Kids spies a super season with Undercover Answers: Planet Earth and Undercover Answers: Animal Kingdom, which allow readers to use a special light to uncover answers to trivia questions that are written in invisible ink; Eye View: Bugs, featuring artists’ renderings of creatures’ points of view, scientific explanations of why bugs see the way they do, and perception experiments for kids to do at home; The Magnificent Book of Night Creatures, which shows how the animal kingdom comes to life after the sun goes down; and History’s Most Spectacular Heists, spotlighting the world’s most unbelievable heists, from art thefts to bank robberies to jewel burglaries.\nIVP/IVP KIDS\nIVP Kids follows the light with Oscar and the Mystery of the Glowing Orbs by Don Everts, starring Oscar, who starts seeing things no one else can in his new town and soon discovers he’s not the only one with a mysterious power.\nKALANIOT\nKalaniot revs up for spring with Tractor Zack on Sunshine Kibbutz by Alice Blumenthal McGinty, illus. by Rotem Teplow, in which Tractor Zack starts to break down, causing him to find a new job on Sunshine Kibbutz; Day of Delight: A Jewish Sabbath in Ethiopia by Maxine Rose Schur, illus. by Brian Pinkney, telling the story of the Ethiopian Jews through the eyes of a boy as his family and friends prepare for the sabbath; and Essie, Martha, and Maya by Marcella White Campbell, illus. by Olivia Smith, following Maya as she discovers the stories of her great grandmothers—one, an African American and the other, a Jewish immigrant from Romania—and realizes that she, herself, is the beginning of a brand-new story all her own.\nKIDS CAN\nKids Can Press takes its mark for False Starts by Carl Brundtland, illus. by Claudia Dávila, second in the Nansi graphic novel series, which finds track star Nansi and her friend Angela worrying about their bestie Ayesha who’s spending the last days of summer rehearsing for a play instead of hanging out with them; The Book of Jupiter by Robin Stevenson, in which 13-year-old Ara must decide whether to continue living in Jupiter Station, an isolated community led by Father Jupiter, a self-appointed prophet whose increasingly dangerous beliefs and visions rule the family; I Built a Rocket Ship by Anna Lazowski, illus. by Jennica Lounsbury, which finds a child determinedly building (with Dad’s help) a rocket ship out of cardboard, decorating and furnishing it in honor of a loved one who has died; I Will Not Walk to School by Naseem Hrab, illus. by Kelly Collier, featuring Monster, who is determined not to enjoy the dreaded walk to school, while pal Bird cajoles him to hurry so they won’t miss Pepperoni Pineapple Pizza Pancake Breakfast Day; and A Smile Like Yours by Emily Thomas, in which Rhys starts university far from home, but his prosopagnosia (face blindness) makes it difficult to meet people.\nKIDS CAN/CITIZENKID\nCitizenKid dips into the season with All the Water on Earth by Rochelle Strauss, illus. by Madelyn Goodnight, an exploration of the various forms of water and how it is sourced, consumed, used in manufacturing, harnessed for energy, and protected.\nLAWLEY\nLawley learns some new tricks with Rover Rolled Over by Rebecca Langston-George, illus. by Merry Miller-Grass, in which Reggie thinks outside the box to adopt a furry companion despite his apartment manager’s strict no-pet policy; Ten Hungry Dragons by Lorna Stallman, illus. by Leila Nabih, about 10 hungry dragons who snatch up the first fruit they find, leaving one ravenous dragon with nothing to eat; Room Enough for All by Christopher DeLuca, illus.by Sian Moore, in which the North Star guides readers on a journey through the universe, revealing how there is space for everyone to shine; Roadrunner Fran by Molly McNamara Carter, illus. by Cleriston Rebeiro de Azevedo, following an incredibly fast roadrunner as she encounters a rattlesnake for the first time; and Quilly by Mary Permann, illus. by Ada Aco, about a porcupine known for his good intentions, though they often lead to unintended consequences.\nLEE & LOW\nLee & Low welcomes spring with Ours: A Story of Loss and Healing by Mandy Settembre, illus. by Francine Matsumoto, in which a boy and his parents find a way to grieve and heal after a pregnancy loss by starting a backyard garden.\nLEE & LOW/BEBOP\nBebop Books is in the groove with new titles added to the Drumbeat Decodable Book early reader series by Sandra Samatte, illus. by various artists, created in collaboration with Indigenous Education Press: Shade and Snake, Snail Trail, Bree, Dee, and Reed; Eager Beaver, and The Ride.\nLEE & LOW/CHILDREN’S BOOK PRESS\nChildren’s Book Press kicks into gear with bilingual title Lucia’s Goals/Los goles de Lucía by Angela Quezada Padron, illus. by Christina Barragan Forshay, about a girl named Lucía who sets out to become a professional futbolista and prove that girls can dominate on and off the soccer field.\nLEE & LOW/CINCO PUNTOS\nCinco Puntos Press gets goosebumps with The Hero Twins in the Realm of Fright by David Bowles, illus. by Charlene Bowles, a graphic novel retelling of an Indigenous Mexican tale, about demigod twins who descend to Xibalba (the land of the dead) to rescue their father and uncle and fulfill their destiny.\nLEE & LOW/TU BOOKS\nTu Books flutters into the season with The Monarchs in the Wild by Israel Moya, following 17-year-old Cal, whose life is jostled into motion when he discovers the body of a friend under a bridge—the butterflies stitched onto her jeans forever seared into his memory; and Hairy Man Suit by Haleh Massey, featuring an Iranian American sixth grader as she tackles her preteen troubles with humor and gutsy determination.\nLERNER\nLerner raises the Jolly Roger for Pirate Peril by Cavan Scott, illus. by Abby Ryder, in which a real pirate has stolen Adventure Park’s pirate ship and taken Emily, Jacob, and Frank hostage; The Stolen Unicorn by Annette M. Clayton, illus. by Paula Zamudio, which finds Luisa and her cousin Lisa coming to the rescue of a kidnapped unicorn; and Plan It, Test It, Solve It by Nicole Gabor, designed to help young readers sharpen critical thinking skills.\nLERNER/CAROLRHODA\nCarolrhoda hits the high notes with Choir Grrrl by Ashley Granillo, in which 13-year-old Alondra fronts an alt-rock band she formed with her sisters under her father’s guidance, but secretly joins a choir group at school; A Home on the Page by Kao Kalia Yang, illus. by Seo Kim, about a Hmong American girl who turns to her family for support while navigating anti-Asian racism, ultimately finding refuge in the written word; For the Win: Poems Celebrating Phenomenal Athletes, edited by Irene Latham and Charles Waters, an anthology spotlighting 20 contemporary athletes and featuring bios, photos, and quotes from the athletes; The World Game: Soccer Circles the Globe by John Coy, illus. by Phung Nguyen Quang, which depicts kids at various moments mid-game in 12 countries; and Wild Mountain Ivy by Shannon Hitchcock, illus. by Stephanie Singleton, the story of 12-year-old Ivy, still sick months after catching a common virus, who starts dreaming about another sick girl who lived in the same house a century ago.\nLERNER/CAROLRHODA LAB\nCarolrhoda Lab watches the clock for When It’s Your Turn for Midnight by Blessing Musariri, in which 15-year-old Chianti discovers that her dad isn’t her biological father; and Beyond Seven Forests by Amanda McCrina, which finds 18-year-old Polish countess Renata trapped in her home with two Polish deserters from the Russian army during a blizzard as World War I rages.\nLERNER/GRAPHIC UNIVERSE\nGraphic Universe hatches a spring list with BIRD!: Along Came a Spider: In Spring by Raymond McGrath, the debut title in a graphic novel series about Bird’s adventures in the big, wide world; Magda, Intergalactic Chef: Beyond the Tournament by Nicolas Wouters, illus. by Mathilde Van Gheluwe, trans. by Ann Marie Boulanger, in which Magda and her culinary competitors will have to look beyond their differences and take a stand against the Imperium; The Last Boy Above Ground by Rodrigo Reyes Rico, featuring Elias, the only human left in Mexico City after pollution sends people underground—until he meets Ana; Red Stones: A Graphic Account of the Salvadoran Civil War by Ernesto Saade, the true story of when the Salvadoran Civil War reached the village of Santa Marta in 1981; and We Are Dwarf Sperm Whales!: A Graphic Guide to Cetaceans by Anne Lambelet, in which Kogi and his mother take an underwater tour of all things cetacean.\nLERNER/KAR-BEN\nKar-Ben preps a palette for The Power of Her Paintbrush by Janice Hechter, spotlighting fine artist Theresa Bernstein; The Right Blessing by Kerry Olitzky and Samantha Orshan Kahn, illus. by Violet Tobacco, in which Joey opens up to her family at Shabbat dinner that she has always felt different from other boys and knows she’s a girl; Rules for Liars by Debra Garfinkle and April Patten, about two girls struggling with grief, guilt, and self-identity, who find unexpected friendship; Talia and the Passover HUG-gadah by Linda Elovitz Marshall, illus. by Francesca Assirelli, which finds Talia excited to celebrate Passover with hugs; and Who Will Rule the Trees? by Eric A. Kimmel, illus. by Alette Straathof, the story of how the humble olive tree stands out for its ability to create light, earning its crown as the wise and powerful leader of the trees.\nLERNER/MILLBROOK\nMillbrook Press steps up to the plate with The First Beisból Bat: How Nemesio Guilló Brought Baseball to Cuba by Ramon Olivera, the true story of how baseball first came to Cuba from the U.S. and became popular, thanks to the enthusiasm of Nemesio Guilló, who initially encountered the game as a student in Alabama; The Ocean’s Heart: The Tiny Creatures Essential to Life by Jilanne Hoffmann, illus. by Khoa Le, offering a look at zooplankton, focusing on their nightly migration from the ocean’s depths to the surface and highlighting their vital place in the ocean’s food chain; and Whose Tree Is This?: Poems About the Mighty Oak and Its Companions by Marilyn Singer, illus. by Julian Plum, centered on an oak tree and all the different creatures that depend on it.\nLERNER/ZEST\nZest greets the season with Hmong: A Graphic Memoir by Vicky Lyfoung, which recounts the history of the Hmong people, told through interviews with the author’s family; and The Real Rosalind: The Truth About Rosalind Franklin’s DNA Discovery and How It Was Erased by Janet Fox and Debbie Loren Dunn, focusing on how Franklin was largely uncredited for her science leading to the discovery of the structure of DNA during her lifetime.\nLEVINE QUERIDO/LEVINE\nLevine Querido/Arthur A. Levine offers spring zest with The Sweetest Lemons by Daniel Nayeri, illus. by Rahele Jomepour Bell, following a young narrator on a visit to his grandfather’s farm in Iran where he is told a fantastical story of three brothers, a lemon tree, a giant, and a journey beyond our world; Rainbow Cookies by Lesléa Newman, illus. by Z.B. Asterplume, about a girl who rallies her friends and family to show the power of love and acceptance when a woman’s Pride-inspired rainbow cookies spark backlash; Firesnake by Donna Barba Higuera, the third and final book in the Cuentista trilogy, which brings together characters new and old on both Sagan and Earth; Death in the Tall Grass by Andrea L. Rogers, in which a Cherokee girl investigates the dark past of one side of her family and reclaims her cultural heritage; and Hear Ye Mortals by Yamile Saied Méndez, following a family band using their music to resist the authoritarian government in 1970s.\nLEVINE QUERIDO/EM QUERIDO\nLevine Querido/Em Querido tells all with Asad’s Secret by Najlaa Attaallah, trans. by Sawad Hussai, which illuminates a young man’s hopes and dreams while navigating the difficult reality of living in the largest city in Palestine, the Gaza Strip.\nLIL’ LIBROS\nLil’ Libros takes a sweet treat break with Pan Dulce: A High Contrast Bilingual Board Book by Aaron Bowersock, focusing on the colorful world of these pastries; Mariachi: Musical Instruments/Instrumentos musicales by Citlali Reyes, spotlighting the musical instruments (plus vocals) within a traditional mariachi band; Noah’s Ark, illus. by Stefany Plaza Gomez, introducing readers to the male and female features of the animals that made it onto Noah’s Ark; Las manos de Mamá by Juan Moreno, illus. by Stefany Plaza Gomez, pointing out the many ways in which a mother’s body parts—like her hands and cheeks—keep her baby feeling secure and safe; and My First 100 Sports Words in English & Spanish, illus. by Citlali Reyes, about all things sports, from baseball and gymnastics to boxing and soccer.\nLITTLE BEE\nLittle Bee Books stays on top of spring with Mac Wears a Hat by Vicki Johnson, illus. by Gillian Reid, which finds Mac using the hats in her collection to cheer herself up and express herself; A Taxi for Everyone: How Roy Velásquez Fought for Equality by Debbie Zapata, illus. by Laura Sandoval Herrera, the true story of Velásquez, a taxi driver who set out to serve his segregated community and fight against discrimination on public transportation; Schooltime Grumps by Katrina Moore, illus. by Xindi Yan, in which Daisy’s grandfather, Yeh-Yeh, helps her feel less grumpy at the start of the new school year; My Body, My Rules by Andy Passchier, providing an introduction to the concepts of consent for young readers; and Before It Was… a Hurricane! by Mary Kay Carson, illus. by Jieting Chen, which explains how a hurricane forms, starting with the most dramatic part of a storm’s life, moving backwards to before it was even a hurricane.\nLITTLE BEE/YELLOW JACKET\nYellow Jacket is abloom with Sunflowers and Lavender by Meghan Valins, which finds hopeless romantic Penny and aspiring musician Bianca crossing paths in humorous ways as a romance begins; Something to Be Proud Of by Anna Zoe Quirke, following bisexual aspiring stand-up comedian Imogen and openly gay football captain Ollie as they join forces to tackle injustices in their school and beyond; and Maggie the Dread by Austin Gilkeson, in which seventh grader Sebastian accidentally frees a vampire goddess from a cursed stone during after-school detention.\nLITTLE BEE/BUZZPOP\nBuzzPop takes a road trip with Hot Wheels: Hot Wheels Explores the Wild Wilderness by Lori C. Froeb, a novelty board book featuring different terrains and landscapes around the world; and Barbie: Barbie Explores Science, Technology, Engineering, and Math by Thea Feldman, which finds Barbie and her friends learning about basic STEM concepts.\nLITTLE BIGFOOT\nLittle Bigfoot calls “all aboard!” for Go, Trains, Go by Addie Boswell, illus. by Alexander Mostov, following a variety of trains—from steam-powered to high-speed bullet trains—transporting diverse families on their various journeys.\nLITTLE, BROWN\nLittle, Brown Books for Young Readers weave a spring lineup with Story Rug by Phoebe Wahl, illus. by Sophie Blackall, in which school children use rags to craft a classroom storytime rug for their teacher; Iguana Miss You by Sandra Boynton, a picture book expressing “I’m gonna miss you;” Terry’s Many Hats by Terry Crews, illus. by Tanisha Cherislin, about a boy who learns he doesn’t have to choose between his various interests; King of Nothing by Nathanael Lessore, which finds popular high schooler and detention regular Anton forced to attend an activity group as punishment, where he gets to know the less popular crowd and starts to rethink what being a “man” really means; and The Ungovernable Heart of Miss Darcy by Erin Edwards, an alternate retelling of Pride and Prejudice, which centers a romance between shy Georgiana Darcy and headstrong Kitty Bennett.\nLITTLE, BROWN/OTTAVIANO\nChristy Ottaviano Books flows through the season with A Scar Like a River by Lisa Graff, about a 13-year-old girl with a mysterious scar on her face and a big secret she feels pressured to keep; Otherwise Known as Judy the Great: An Ode to Judy Blume by Selina Alko, a picture book about the childhood of the trailblazing and beloved children’s book author; Diffy by Brian Lies, starring a lonely fish who finds an unusual object that sparks his imagination and soon leads to community building and a celebration of storytelling; Birdy by N. West Moss, which explores the unbreakable bond between siblings; and Boarding School Seasons (Young Readers Edition) by Brenda J. Child, with contributions by Benay Bizhiw, providing a history of American Indian boarding schools from 1900–1940, comprised of first-person testimonies and historic photos.\nLITTLE, BROWN/LB INK\nLB Ink practices its dreamy stare with To the Stars and Back Vol. II by Peglo, continuing the slow-burn love story of Kang Dae and Bo Seon; Before We Wake by Sophie Glock, focused on a paranormal love triangle; Bad Kid by Sofia Szamosi, a graphic memoir detailing one girl’s harrowing experience in behavioral correction facilities; The Brainstormerz: Money Talks by Kwame Alexander and Cassidy Dyce, illus. by Rashad Doucet, in which three best friends work together to solve problems with family, friends, and school while searching for the perfect cell phone; and Queer and How We Got Here by Hazel Newlevant, which ties together LGBTQ+ narratives from the past to the present.\nLITTLE ISLAND\nLittle Island Books charts the tide for Shorelines by Ruth Ennis, which takes a fresh look at The Little Mermaid to tackle contemporary questions of beauty standards, toxic power, and the environment; Dino Mode Activated by Jen Wallace, illus. by Alan O’Rourke, which finds the kids from Dinosaur Pie solving a new mystery; The Experimenters by Shane Bergin, illus. by Sayani Mukherjee, an exploration of the cozy world of science at home, featuring experiments with household objects; Crying Wolf by James Butler, in which Joey’s stepfather who fled Dublin more than a year ago returns, and everyone wants to know if he’s still a wolf; and Making It Up As You Go Along by Patricia Forde, illus. by Mary Murphy, a practical guide to writing stories from a stellar line-up of major Irish writers.\nMACMILLAN\nMacmillan Children’s Books flexes with Liliana the Strong by Quentin Blake, illus. by Emma Chichester Clark, featuring a tiny girl who uses her superhuman strength to help others in crisis; Penguin and Pup: The Perfect Pet by Hazel Gardner, illus. by Nikki Dyson, in which friends who are opposite in every way try to decide on what is the best pet to get; Land of the Last Wildcat by Liu Sit, illus. by David Dean, a debut novel about family, friendship and the beauty of our natural world; and Calico Critters: Halloween Search and Find, spotlighting Calico Critters characters on a hunt to find spooky holiday related items.\nMACMILLAN/BALZER + BRAY\nBalzer + Bray is all left feet with Kitty Caterpillar by Annabeth Bondor-Stone and Connor White, illus. by Brigette Barrager, beginning the adventures of Kitty Caterpillar—part kitty and part caterpillar—and her human, Hazel; The Lion’s Run by Sara Pennypacker, the tale of an orphan in Nazi-occupied France who discovers unexpected courage within himself; Dad by Christian Robinson, which pays tribute to animal and human dads; The Unlikely Tale of Chase and Finnegan by Jasmine Warga, spotlighting the friendship between a cheetah and a rescue dog; and Augusta Pine Does Not Exist by Emily Lloyd-Jones, following a teen hacker turned secret government operative who must rely on her wit and tech prowess to stay one step ahead of a band of cyberterrorists.\nMACMILLAN/CAMPBELL\nCampbell Books mooooves into spring with Axel Scheffler Farm Noises by Axel Scheffler, in which readers take a tour of a farm and discover all its sounds with the push of a button; Mo’s First Day and The Party, additions to the Matty and Mo series about puppy siblings by Rosalind Beardshaw; and Goldilocks and the Three Bears and Little Red Riding Hood, both illus. by Natascha Rosenberg, the latest titles in the First Stories series.\nMACMILLAN/FARRAR, STRAUS AND GIROUX\nFSG Books for Young Readers smooths its whiskers for Vampurr by Justin Colón, illus. by Lenny Wen, about an adopted vampire kitty who finds the perfect home; Bartleby by Matt Phelan, following a dapper polar bear who learns the power of staying true to yourself; Time for a Change by Questlove with S.A. Cosby, illus. by Godwin Akpan, in which Rahim and Kasia are hunted by doppelgängers from parallel dimensions and cunning robots masquerading as allies, and are plunged into a shadowy battle for survival; The Worry-Worry Whale and the Halloween Scaries by Deborah Diesen, illus. by Dan Hanna, featuring Willa Whale as she explores strategies to make a Halloween plan that works for her; and Together We See by Ari Tison, a story of grief, environmental justice, and the fight for retribution, inspired by real-world missing, dead, and attacked Indigenous activists.\nMACMILLAN/FEIWEL AND FRIENDS\nFeiwel and Friends is black and white and read all over with Panda-monium by Ann Baily, illus. by Bonnie Wong, a snapshot of picture day at the pandas’ school; Love You Like a River by Nancy Tillman, celebrating all the ways to love, as mirrored by nature; Behind Five Willows by June Hur, presenting a YA homage to Jane Austen, set in historical Korea about a reader and a writer who secretly fight against government book banning; The Gifted by Adriana Mather, the story of two students who are magically bound together and trapped inside their warded magic university; and We Could Be Anyone by Anna-Marie McLemore, which finds sibling con artists targeting rich people at a resort.\nMACMILLAN/FIRST SECOND\nFirst Second says its goodbyes with Until We Meet Again by Lily Kim Qian, a graphic memoir about a young woman’s search for belonging as her immigrant family moves between Canada and China; As I Dream of You by Jennifer Lee and LeUyen Pham, in which one member of a loving couple dies and the other turns to lucid dreaming to continue their love story; Forgive-Me-Not by Mari Costa, the story of a lost princess and a changeling who was made to take the heir’s place as part of a fey scheme; Inbetweens by Faith Erin Hicks, following twins who attend an animation camp where they face their differing levels of talent and passion; and InvestiGators 9 by John Patrick Green, which finds the city’s water supply replaced by milk.\nMACMILLAN/HENRY HOLT\nHenry Holt goes deep undercover for Double Crossed by Rebecca E.F. Barone, a narrative nonfiction account of Operation Bodyguard, in which the Allied forces in WWII used spies and double agents to deceive the Nazis about their true plans for D-Day; The Greenies by Emma Mills, illus. by Sarah Nicole Kennedy, a graphic novel introducing a girl who reluctantly joins the Environmental Club at her new school and finds friendship and community where she least expects it; How a Bear Became a Book by Annette Bay Pimentel, illus. by Faith Pray, the story of how writer, illustrator, and editor came together to craft Pooh’s first adventure; One Word, Six Letters by Adib Khorram, in which two teen boys grapple with identity and accountability and set off a ripple effect within their community after a school assembly is disrupted by a shouted slur; and Queen of Faces by Petra Lord, following a desperate girl navigating a cutthroat magical academy where she faces a choice between life and death.\nMACMILLAN/HOLT/GODWIN\nGodwin Books hails a big yellow taxi for Both Sides Now by Lydia Corry, a biography about singer-songwriter Joni Mitchell; When the Beavers Move In by Alison Pearce Stevens, illus. by Natasha Donovan, the story of how the Tulalip Tribes biologists in Puget Sound help destructive beavers find a new forever home far from people; Weaver and Web by Chris Baker, illus. by Byron Eggenschwiler, following Weaver the spider as she goes about her evening routine of meticulous web=making; and Take It to Your Grave by Louangie Bou-Montes, in which a teen receives more than he bargained for after accidentally releasing a decades-old poltergeist from a nearby haunted house.\nMACMILLAN/KINGFISHER\nKingfisher puts readers in the know with reference books The Kingfisher Racing Encyclopedia, a guide to car racing; and The Kingfisher Extreme Weather Encyclopedia by Kate Castle, a guide to wild weather, its causes, and how it impacts the world around us.\nMACMILLAN/NEON SQUID\nNeon Squid stocks the bunker with How to Survive an Apocalypse by Cameron Hardy and Coby Coonradt, illus. by Victoria Stebleva, which finds the hosts of The Casual Preppers podcast offering tips for surviving all types of apocalypses.\nMACMILLAN/ODD DOT\nOdd Dot keeps on turning with ABCD Earth by Stacy McAnulty, illus. by Joey Chou, a novelty alphabet board book that features a spinning globe; Venus! Fierce and Fabulous by McAnulty, illus. by Stevie Lewis, the latest entry in the Our Universe series of celestial “autobiographies,” which finds McAnulty channeling the voice of Venus; Howl! It’s Halloween with Brown Bear and Friends by Eric Carle and Odd Dot, illus. by Carle, featuring the beloved characters from the World of Eric Carle; Hot Dog by Christine Van Zandt, illus. by Steven Salerno, serving up a multicultural history of one of America’s favorite foods; and A Believer’s Guide to Unicorns by Jenni Desmond, which reveals unicorns’ secrets and invites readers to join in the magic.\nMACMILLAN/ROARING BROOK\nRoaring Brook Press gets a whiff of spring with City of Plagues and Perfumes by Jake Halpern and Peter Kujawinski, following a girl who uses her remarkable sense of smell to save the world from a perilous plague; A Fishboy Named Sashimi by Dan Santat, launching a graphic novel series starring a creature with the head of a fish and the body of a boy; Better Pets by Leigh Bardugo, illus. by Liz Climo, showcasing all the kinds of pets out there; Kingdom of Waves by Melissa de la Cruz, launching a YA romantasy duology about two thieves who go after the same mythical treasure; and This Must Be the Place by Kelly Quindlen, in which Louisa returns to her Alabama hometown for a funeral after more than a year away and makes her unplanned debut as an out-and-proud lesbian.\nMACMILLAN/TOR/STARSCAPE\nStarscape carries extra treats for Lily to the Rescue: The Pack of Poodle Puppies by W. Bruce Cameron, which finds Lily the rescue dog paying it forward by rescuing a pack of poodle puppies left without a home; and Abeni and the People Who Could Fly by P. Djèlí Clark, the finale of the Abeni’s Song fantasy trilogy.\nMACMILLAN/WEDNESDAY\nWednesday Books sets sail with Midnight on the Celestial by Julia Alexandra, in which a teen resurrector and heir to a powerful family joins the crew of a sinister cruise ship that siphons magic from its staff in order to keep her magic and her life; Hearts Gambit by J.D. Myall, about two time-traveling Black families who are cursed to put forth competitors in a magical duel once a generation, and the star-crossed lovers destined to break the blood feud between their families; In Time With You by Kristin Dryer, featuring one girl saving her first love’s life by falling for his best friend; The River She Became by Emily Varga, following a young researcher who hunts for an ancient fae relic to restore the magic to her world; and Deathly Fates by Tesia Tsai, the fantasy tale of a priestess who reanimates corpses to shepherd them home, but ends up awakening a prince who is more alive than dead.\nMAD CAVE STUDIOS/PAPERCUTZ\nPapercutz sinks its fangs into spring with Bat Pat Vol. 2 by Trevor Mueller and Bill Walko, continuing the adventures of talking bat Bat Pat and his friends, Rebecca, Leo, and Martin, who help misunderstood monsters; Herobear Vol. 2: Saving Time by Mike Kunkel, in which Herobear and Tyler discover that Henry, the family’s magical butler, is missing; Miraculous Chibi Vol. 6 by Jeremy Whitley and Carrie Harris, which expands Ladybug’s friendships with Alya Césaire and Rena Rouge, and includes some information about real bugs; The Loud House Vol. 25 by The Loud House Creative Team, an anthology celebrating 10 years of the hit Nickelodeon show; and The Smurfs Archives Vol. 4 by Peyo, featuring comics and other original pieces from 1976 to 1988.\nMARBLE PRESS\nMarble Press sees spring in a new light with Glow by Nancy Stone, about a mysterious, glowing white bird that brings together sweet Frano and sour Cordelia on an eco-mission to save a family of storks; B and the Spoon by Mk Smith Despres, illus. by Raluca Burcă, which finds B, the youngest of many siblings, saving her family with ingenuity and grit when their seaside home is leveled by a giant wave; and Legend of Leo by Monica Acker, illus. by Mikel Valverde, the story of a dandelion named Leo who believes he is anything but an ordinary weed.\nNEW FRONTIER\nNew Frontier stomps into the season with Max’s Dinosaur Feet! by Lana Spasevski, illus. by Penelope Pratley, in which Max and his family try to keep their feet quiet so they don’t wake the baby; Jump for the Stars by Vogue Williams, illus. by Tilia Rand-Bell, spotlighting 14 children who like to be super active all day long; Storm Goliath by James Sellick, illus. by Craig Shuttlewood, the story of how Goliath the gorilla learns how to manage his anger in a positive way; and I’m a Duckling (Who Am I?) and I’m a Tiger (Who Am I?), illustrated by Liv Wan, two lift-the-flap animal books.\nNOBROW/FLYING EYE\nFlying Eye Books does a kickflip for Skating Wilder by Brandon Dumais, illus. by AJ Dungo, a semi-autobiographical look at the creator’s “first love,” skateboarding, its history, and the culture that surrounds it; Detective Stanley and the Green Thumbed Thief by Hannah Tunnicliffe, illus. by Erica Harrison, in which Detective Stanley is on the case when someone starts swiping priceless plants from Narlybone Gardens; The Lost Robot by Joe Todd-Stanton, in which a broken robot wakes up in a rubbish dump and tries to remember his past life before being rescued by a new family; Baby Kraken by Ana Jiménez, which finds young Michael, who is fearful of the sea, befriending a baby octopus in a tide pool; and Juniper Mae: Journey to the Levels Below by Sarah Soh and Tim Fraser, catching up with Juniper as she joins forces with her inventor friends to break into Tykotech Tower and save her family from danger.\nNORTHSOUTH\nNorthSouth Books slays the season with Fabulous Creatures by Cornelia Funke, illus. by Ruby Warnecke, trans. by Anna Schmitt Funke, shining a spotlight on unicorns, basilisks, qilins, chimeras, and other mythical creatures from around the world; Welcome, Uncle Nowruz! A Persian New Year’s Story by Rashin Kheiriyeh, a tale inspired by Iranian folklore, which finds Nane Sarma and her grandchildren preparing for the arrival of legendary character Uncle Nowruz; The Passover Pet Surprise by Ana María Shua, illus. by Ángeles Ruiz, in which Jordanita, Benja, and their cousins consider what freedom means for their pets as they celebrate Passover; Selma: The Story of a Stellar Spider by Tini Malina, trans. by Tammi Reichel, about a spider’s artistic and unusual spinning style, which helps her reach the stars; and What’s for Dinner? by Larysa Maliush, about a big bad wolf who finds a lost baby bunny and vows to return the rabbit home safely.\nNORTHSOUTH/EDICIONES NORTESUR\nEdiciones NorteSur says ¡bienvenido! to the following titles in Spanish: La gran sorpresa de Pésaj by Ana María Shua, illus. by Ángeles Ruiz; Seres fabulosos by Cornelia Funke, illus. by Ruby Warnecke, trans. by María José Ferrada and Silke Kleemann; Selma: la historia de una araña estelar by Tini Malina, trans. by Mariana Llanos; El Pez Arcoíris trae la paz, by Marcus Pfister, trans. by David Bowles; and Gaudí–el arquitecto de la imaginación by Susan B. Katz, illus. by Linda Schwalbe.\nNORTON\nNorton Young Readers puzzles it out with The Wish Ring Cipher by Alexandra Ott, the launch title in the Codebreakers series following 12-year-old Emma, who has autism, and a crew of code-busting pals at her new school as they race to find a magical object; Ripples by Katie Yamasaki, the story of a girl and her aunt who set sail on their river raft, on a mission to clean litter and trash from the water; Where I Grew by Jashar Awan, illus. by Rahele Jomepour Bell, in which a girl reflects on her family’s journey to reach her home and honors the generations—past, present, and future—that comprise it; Hope in a Classroom by Imani Perry, which looks at the social history of Black America through the lens of schooling, segregation, and the education system; and La Golondrina by Sonia De Los Santos, illus. by Teresa Martínez, a bilingual ode to family, home, and the journeys we make to create them.\nNOSY CROW\nNosy Crow spells it out with How to Learn Your ABCs by Caspar Salmon, illus. by Matt Hunt, featuring sneaky letters that cannot be trusted; USA ABC by Ingela P. Arrhenius, a board book abecedary celebrating the U.S. in its sesquicentennial year; Once I Was a Tree by Eoin McLaughlin, illus. by Guilherme Karsen, following the comedic misadventures of a seed that turns into a tree, and then into a book; Armadillo Hello by Zewlan Moor, illus. by Karen Obuhanych, which encourages children to explore and emulate animal greetings from around the world; and Destiny Ink: Sleepover Surprise by Adeola Sokunbi, first in an illustrated chapter book series about Destiny, who uses her sketchbook to doodle her ideas and work through her worries.\nPAGE STREET/PAGE STREET YA\nPage Street YA stands tall for The Redwood Bargain by Markelle Grabo, a gothic fairy tale in which a maid poses as her lord’s stepdaughter to fulfill his bargain with the murderous lord of the woods; The Labyrinth of Waking Dreams by Michelle Kulwicki, following a girl and a magician as they venture beneath the Appalachian Mountains into the mythological Labyrinth to find the love and power they’ve been denied; I Was a Teenage Death God by M.J. Beasi, featuring a nonbinary teen cursed with the power of taking life force via touch, who must hunt down the ghost threatening their twin sister; If I Can’t Have You by Aden Polydoros which finds the Love Interest 3000 simulator serving up a perfect boyfriend who becomes the perfect nightmare; and Under a Carnivore Sky by Brianna Jett, the story of a girl who hunts a monster through a carnivorous swamp to save her father and fellow townsfolk from its curse.\nPAIGE TATE AND CO.\nPaige Tate and Co. sharpens its pencils for All the Bugs: How to Draw Books for Kids by Alli Koch, providing instructions for how to draw more than 40 different bugs; and the following early concept books by Tabitha Paige: Our Little Adventure at Easter, Scribble Scrabble, Our Big Book of Animals, and Our Big Book of Nature.\nPAW PRINTS\nPaw Prints Publishing links pinkies for Daddy’s Promise by Ed Gordon, illus. by Sophia Green, in which a father makes a pledge to his daughter to always love her, support her, uplift her, and protect her, no matter what; All I Can Tell You by Alison Malee, illus. by Chantal Horeis, offering a visual interpretation of Malee’s poem about female agency, camaraderie, and strength; McGill and Lee 1: Invasion of the Mutant Plications by Florenza Lee and Bridgett McGill, illus. by Abi Fox, the kick-off to a graphic novel series following 12-year-old friends McGill and Lee who use their math skills to combat mutant, anthropomorphic math problems that are unleashing chaos throughout their school; Cuddlefish by Jesse Byrd, illus. by Michael Bensur, about a cuttlefish that loves to cuddle; and Rachel and Abby: Search for the Afikomen by William Stieglitz, illus. by Daniel Sulzberg, the story of two sisters on an adventure around town to find their family’s afikomen during Passover.\nPEACHTREE\nPeachtree takes deep breaths for Allie and the 100 Percent Perfect, Frustration-Free Day! by Megan Wagner Lloyd, illus. by Ellie Snowden, featuring a little alpaca with dreams of making sure each day is perfect in every way; Making Plans for Nigel Binty by Shawn K. Stout, which finds sixth graders Nigel and new student Glory Bea crossing paths at school as major life changes shake up their carefully laid plans for themselves; The Treasure Collector by David Zeltser, illus. by Benjamin Arthur, in which Reginald isn’t sure what to do when he stumbles upon a hard-to-categorize item for his collection of treasures; The Sweet Spot by Elaine Vickers, following Little League star Trip, as he makes room for Sam, who’s striving to succeed as the only female player in the league; and You’re Still Pretty New Here by Mariyka Foster, in which a brand-new baby is filled in on all the adventures that happened before they were born, from their ancestors to a time before humans existed.\nPEACHTREE TEEN\nPeachtree Teen gets a charge out of A Wild Radiance by Maria Ingrande Mora, in which a girl with the ability to conduct electricity discovers that the powerful House of Industry is not the benevolent organization it seems to be and teams up with unexpected allies to take it down; Downfall by Marc J. Gregson, continuing the Above the Black series, where mayhem has erupted in the Skylands; The Hyacinth Labyrinth by Jamie Pacton, the story of bored Princess Hyacinth who sneaks away with her best friend to battle bandits; The Lustrous Dark by Loretta Chefchaouni, a story inspired by the Moroccan Snow White folktale, which finds a young midwife’s apprentice rising to take back the power that’s been stolen from women; and Between Sun and Shadow by Laura Genn, following Kori, the daughter of the powerful and secretive empress of the Daylands, who is held for ransom by Adria, a winged mutant and striking ruler of the Shadowlands.\nPEACHTREE/QUINLIN\nMargaret Quinlin Books visits Mr. McGregor’s garden for Beatrix and Her Friends: Celebrating Beatrix Potter by Anne Lambelet, a picture book biography focusing on the joy and comfort Potter found in her animals, real and imagined; Beatrice and the Nightingale by Patricia Newman, illus. by Isabelle Follath, the true story of a duet between a young cellist and a nightingale that was broadcast across the British Commonwealth as far away as India and Australia to more than one million listeners on May 19, 1924; and Nature’s Remarkable Partners: Wild Poems for Two Voices by Leslie Bulion, illus. by Robert Meganck, featuring two-voice poems that highlight some of the lesser-known symbiotic partnerships found in nature.\nPENGUIN WORKSHOP\nPenguin Workshop pirouettes with Brave New Ballet by Robyn McGrath, telling the true story of Les Ballets Trockadero de Monte Carlo, the all-male ballet company in 1970s New York City; Amy Gets Eaten by Adam Kay, which follows Amy, a small piece of sweetcorn, through the human body as she discovers lots of facts about digestion; A Black Girl and Her Braids by Jaylene Clark Owens, showcasing braids of all types, textures, and styles in an ode to Black girls and the protective hairstyle; Fustuk: A Graphic Novel by Robert Mgrdich Apelian, following the youngest of three dysfunctional siblings who strike a deal to save their mother’s life, inspired by Armenian and Persian mythology; and Pirate Academy: New Kid on Deck by Justin Somper, in which the swashbuckling students at Pirate Academy band together and fight back against a mysterious and ruthless new enemy.\nPENGUIN/DIAL\nDial goes for the gold with Raise the Bar by Fernanda Frick, following a Chilean aspiring teen weightlifter invited to train with an Olympian; Nisha Knows Best by Maryann Jacob Macias, illus. by Maithili Joshi, in which Nisha learns to set boundaries around her body at a large, loving family gathering when her grandparents visit from India; Serafina Makes Waves by Matthew Burgess, illus. by Robin Rosenthal, first in a series about one dramatically over-the-top kitty; Seasons by the Lake by Naja Lund Aparico, illus. by Alex Nees, about two Inuit brothers who experience a year of changing seasons in Greenland as they pick crowberries during the long summer days and follow the Aurora Borealis during the winter nights; Phoenix: Ride On by Kimberly Brubaker Bradley, launching a series following 11-year-old Harper, who is struggling with the implosion of her family and finds connection with an abused horse and fellow riders.\nPENGUIN/DUTTON\nDutton keeps its ear to the ground for Found Sound by Meg Wolitzer and Charlie Panek, in which a boy discovers a mysterious musical clue and begins to follow a sound-inspired scavenger hunt; The Saint Nicholas Heist by M.T. Anderson, a narrative nonfiction story following the life, death, bone theft, and monumental effects today of the man who became Father Christmas; A Garden of Vipers (The Swifts #3) by Beth Lincoln, which finds Shenanigan and the Swift clan traveling to New York City in the middle of a blizzard to solve a murder; and Postscript by Cory McCarthy, the story of an unlikely quintet of survivors who try to write a joyful coda in humanity’s final days on a wind-ravaged archipelago off the East Coast.\nPENGUIN/FLAMINGO\nFlamingo keeps on truckin’ with Big Rig Pig by Claire Tattersfield, illus. by Rob Sayegh Jr., a cumulative story about Miles Bacon, a big rig truck driver, who helps people in need when their vehicles have broken down; Exca-Gator by Brooke Hartman, illus. by Michael Slack, in which an alligator who operates an excavator makes a big mess when not thinking of others on his construction crew; Trucks All Year by Mary Vander Plas, illus. by Angela Li, which shows readers the trucks they’ll see on the road at certain times of year; Axl the Axolotl Is Not a Frog by J.P. Brammer, illus. by Vanessa Morales, the back-to-school story of an axolotl trying to find where he belongs; and The Chronicles of Whetherwhy 2 by Anna James, next in the fantasy series following twins Juniper and Rafferty as they learn about their new magical abilities.\nPENGUIN/GROSSET & DUNLAP\nGrosset & Dunlap makes a wish with the following novelty board books: Happy Birthday! by Steph Stilwell, which celebrates birthdays filled with puns and positive affirmations; World’s Best Mom by Little Tiger, showcasing mothers and all the wonderful ways they inspire and provide support; Peek-a-Clue: Animals at Home by Gideon Sterer, featuring three mystery animals found at home who are gradually revealed by die-cuts; I Believe in You by Stilwell, delivering a message about believing in yourself; and Let’s Play Baseball! by Jo Parker, illus. by Ahra Kwon, which captures the fun and excitement of baseball.\nPENGUIN/KOKILA\nKokila calculates the odds for Will They, Won’t They by Maulik Pancholy, about the sparks that fly when an aspiring documentarian from Queens is unexpectedly enlisted to film the behind the scenes of a Bollywood movie starring a nepobaby bad boy from Mumbai; Where Do Stories Live? by Meenal Patel, in which a girl and her sister discover the magic of storytelling hiding in butterfly wings, homemade meals, and shared laughter; Hold by Randy Ribay, illus. by Zeke Peña, following a curious child who wants to hold everything and a frazzled father who wants to leave the house on time; and Class Pet Ghost Detective: Milkshake the Disappearing Milk Snake by Akeem S. Roberts, following a boy who solves school mysteries with the ghost of his former class pet, a naked mole rat.\nPENGUIN/PAULSEN\nNancy Paulsen Books braces for Landslide by Betty Culley, in which a perceptive boy senses that the landfill across the street is on the verge of collapse, forcing him to come up with a brave plan to save his father who works at the top of the heap; You Are the Land by Steph Littlebird, an exploration of a Native American child’s loving relationship with the family, community, and land that support and nurture her; Hafsa’s Way by Aisha Saeed, a stand-alone companion to Amal Unbound, which finds Hafsa defying her family’s patriarchal expectations by pursuing her dreams and encouraging her married sister to do the same; Goodbye, French Fry by Rin-rin Yu, featuring a Chinese American girl doing her best to kick aside all the assumptions made about her; and Gods & Comics by Kat Cho, the romantic meet-cute tale of an ordinary human girl falling in love with a Korean god.\nPENGUIN/PUTNAM\nPutnam holds the key to spring with The Escape Game by Marissa Meyer and Tamara Moss, a murder mystery set in an escape-room-themed game show; The Great Escape by Deborah Marcero, featuring an older sister and her pack of wild, noisy, can’t-sit-still younger siblings on a grand and wondrous adventure; Empire by Sabaa Tahir, the sequel to the romantic fantasy Heir which untangles the lives of three young people as they grapple with power, treachery, love, and the devastating consequences of unchecked greed; Sibylline by Melissa de la Cruz, the story of three friends with hidden feelings for each other who infiltrate a magical university in this dark academia romantasy; and Deadly Little Lessons by Danielle Valentine, about an experimental school that puts students through twisted trials with often deadly outcomes.\nPENGUIN/PHILOMEL\nPhilomel plays hooky with A Day Off School by Oliver Jeffers, illus. by Kevin Waldron, in which a boy convinces his parents that he should stay home sick, only to wonder about all the fun he’s missing at school; Forty the Fortune Teller by Drew Daywalt, illus. by Kevin Cornell, a graphic novel-style picture book starring a paper fortune teller left behind at recess who ends up saving the day; We All Belong by Gianna Marino, about a group of animals who learn how we are all different, yet all the same; Little Troublemaker Takes a Stand by Luvvie Ajayi Jones, illus. by Joey Spiotto, the story of how Little Luvvie learns how best to stand up for someone when her confrontation of a bully goes awry; and Teeny and Tilly by Beanie Feldstein, illus. by Laura Watkins, the first in a new series about two best friends who celebrate each other for who they are and share life experiences.\nPENGUIN/RISE X PENGUIN WORKSHOP\nRise X Penguin Workshop dives into spring with All I Want to Do Is Swim by Marilyn Singer, illus. by Luisa Uribe, which finds a girl imagining what it’s like to swim alongside fellow animals, embracing the water with joy, playfulness, and a sense of wonder; How Do You Jew? by Suzy Ultman, introducing Jewish traditions from around the world and celebrating the global Jewish community; and My Someone by Yuko Torii, in which a stray dog’s life changes forever when he is adopted by a family.\nPENGUIN/ROCKY POND\nRocky Pond waves to Hello, Ocean! by Corinna Luyke, the story of a family’s visit to the beach and all the meaningful activities of the day; Put Your Records On by Corinne Bailey Rae, illus. by Gillian Eilidh O’Mara, in which a girl discovers the power and comfort of music during a visit to her great-aunt; More Than a Tree by Sarah Kurpiel, telling the cycle-of-life story of a child’s deep connection to her ailing backyard tree; Can You Grow a Striped Banana? by Jill Santopolo, illus. by Momoko Abe, about a mother who finds a way to show her love for her child even when she can’t grant their wishes; and Today We’ll Be Eaten by Alan Barillaro, which finds a ladybug and dragonfly worrying about their future and making big discoveries during a storm.\nPENGUIN/VIKING\nViking has a hot date with Meet Me Under the Lights by Cassie Miller, a summer farm-town baseball romance; Goldfinches by Mary Oliver, illus. by Melissa Sweet, interpreting one of Oliver’s most beloved poems; Hello, Beautiful by Traci N. Todd, illus. by Loveis Wise, which celebrates Black babyhood; Her Hidden Fire by Cliodhna O’Sullivan, in which a girl must make an impossible decision: watch the boy she loves get exiled for lack of magic, or pass her formidable powers off as his; and Mythspeaker by Christopher Roubique, a fantasy inspired by Native American mythology that follows a band of misfit children who must pull off an impossible heist in order to save the world.\nPENGUIN/WORLD OF ERIC CARLE\nWorld of Eric Carle nibbles through spring with the following titles starring Carle’s beloved caterpillar: The Very Hungry Caterpillar’s First Poems by Charles Ghigna, illus. by Eric Carle, containing 12 original poems; Luck from The Very Hungry Caterpillar; The Very Hungry Caterpillar’s Eid; I Love the Earth with The Very Hungry Caterpillar; and The Very Hungry Caterpillar at the Tea Party.\nPHAIDON\nPhaidon Kids waves the checkered flag for Formula Fast by Matt Ralphs, illus. by Dragan Kordic, covering all the elements that make Formula One the toughest, fastest, and most exciting motorsport in the world; Our Prehistoric World by Sue Lowell-Gallion, illus. by Lisk Feng, a poetic introduction to our planet’s prehistoric past, from giant insects and bizarre-looking mammals, to enormous crocodiles and dinosaurs; and Who's Hiding? Under the Sea by Janet Lawler, illus. by James Weston Lewis, featuring a lift-the-flap guessing game focused on favorite ocean creatures.\nPOST WAVE\nPost Wave Children’s Editions brightens the season with Brilliant Sun, Luminous Moon by Agnes Monod-Gayraud, illus. by Elin Manon, featuring origin myths, cultural legends, and scientific insights about how the universe has shaped both our world and the course of human history; Pass the Parcel by Carly Gledhill, which imagines how the present that Octopus is sending to someone far away will get to its destination; The Tiger Child by Michelle Beech, in which a shy girl follows a mysterious tiger’s tail into the jungle, growing in confidence with every step; Where sˆBear? by Fátima Ordinola, taking readers on a lift-the-flap search for Bear in familiar spots around the house; and Pasta, Pasta, Pasta! by Sarah Finan, a die-cut board book about the joy of eating pasta.\nQUARTO/BECKER & MAYER! KIDS\nbecker&mayer! Kids sets off fireworks for America Celebrates: The Most Amazing and Impressive People, Places, and Events of the Last 250 Years by Aubre Andrus, which takes young readers on a journey through American history, highlighting one influential person, place, or event per year from 1776 to the present; and Goal! Awesome Soccer Stories and Fun Facts for Kids by Carlos D. Mojica, featuring more than 100 player profiles, historical highlights, fun facts, maps, infographics, and photos.\nQUARTO/HAPPY YAK\nHappy Yak sneaks up on the season with Quietly, Quietly… QUACK! by Jonty Howley, which finds three little ducklings trying to stealthily get out of their duck house to explore the farm while Mama Duck is still asleep; No, I’m a… SHARK! by Mike Henson, illus. by Ana Gomez, about a boy who is certain he wants to be a shark when he grows up; Before the Fairy Tale: Little Fairy Godmother by Abie Longstaff, illus. by Leire Martín, revealing how Dazzle, a little fairy from Fairyland, may prove to be the perfect fairy godmother to help Cinderella get ready for a grand ball; Sorry, Sammy by Scott Rothman, illus. by Tom Tinn-Disbury, which finds Sammy in trouble, stuck in his room, writing apology letters for things he shouldn’t have done; and Puggle Snuggles by Mo O’Hara, illus. by Loretta Schauer, centering a puggle (a baby platypus) who mainly likes to snuggle... until darkness falls.\nQUARTO/IVY KIDS ECO\nIvy Kids Eco stitches together a list with Igor and the Mending Mice by Alexander Mostov, in which Igor the tailor is determined to stop the tiny mice who start fixing clothes for free, affecting his business.\nQUARTO/LINCOLN\nFrances Lincoln Children’s Books makes room for The Unexpected Guests by Mariajo Ilustrajo, following a family of mice living peacefully in a house that are startled when a human child moves in; Bear’s Worries by Natalia Shaloshvili, which finds Bear’s anxieties about running out of cookies spiraling until sharing his feelings brings unexpected joy; The Chase by Jenny Bloomfield, focused on a group of dogs racing through the city in pursuit of a runaway ball; It Won’t Be Forever by John Dougherty, illus. by Thomas Docherty, in which a young fox named Vixie struggles with missing her father while he is away; and My Dad Can by Stephen Lightbown, illus. by Claire Lemp, featuring Iris, who sees her father for who he is beyond his wheelchair—someone who can play, imagine, and do incredible things.\nQUARTO/QUARRY\nQuarry Books pulls on its wellies for Nature School: In the Garden and Nature School: In the Garden: The Workbook by Stephanie Hathaway, Lauren Giordano, and Laura Stroup, serving up a guide filled with science facts, activities, and experiments to inspire kids to explore the wonders of the garden and connect with nature.\nQUARTO/WIDE EYED EDITIONS\nWide Eyed Editions just keeps swimming with Fish Are Friends! Meet the Marine Creatures Who Keep Our Waters Thriving by Jules Howard, illus. by Gosia Herba, in which a pufferfish narrator explains to readers how fish are a misunderstood species that does a great deal for the planet; Young Discoverers by Stephen Davies, illus. by Violaine Leroy, telling the true stories of 12 extraordinary young people throughout history who discovered something key or significant in various walks of life; America Is Wild: A State-by-State Encyclopedia of American Wildlife by Brad Timm, Jill de Haan, and Margaux Samson Abadie, a field guide to the wildlife of North America from insects to birds, to wildflowers and mammals; The Shipwreck Atlas by Jo Arnold, illus. by Philip Harris, spotlighting 50 of the world’s most fascinating shipwrecks,; and Recordbreaking USA: Celebrating America’s biggest, brightest, and bravest! by Clive Gifford, illus. by Paul Hammond, providing a compilation of record-setting people and places from every U.S. state and territory.\nQUARTO/WORDS & PICTURES\nwords & pictures makes a splash with Expert’s Guide to Mermaids by Rhian Wright, featuring Little Sweetpea, the ultimate mermaid expert, who’s on a mission to find the rarest mermaid of all—the elusive Cave Mermaid; Celebrations & Festivals: Juneteenth by Tonya Abari, illus. by Ashley Evans, following a boy and his family as they observe Juneteenth; When Brian Met Terry by Russell Kane, illus. by Erica Salcedo, in which Russell brings home a new puppy, who must learn to get along with Russell’s loyal cat; and Don’t Call Me a Dinosaur by Charlotte Guillain, illus. by Sally Agar, centered on a curious duo on an adventure through time to search for dinosaurs who meet lots of indignant prehistoric creatures that are not dinosaurs along the way.\nRANDOM HOUSE\nRandom House Books for Young Readers checks out spring with I’m So Happy You’re Here: A Celebration of Library Joy by Mychal Threets, illus. by Lorraine Nam, which extends an invitation to anyone who could use a little library joy and a reminder that libraries are for everyone; Young World by Soman Chainani, in which a viral social tirade gets a teenager elected as the U.S. president and sparks a worldwide revolution where all the major global leaders are teens; When Tomorrow Burns by Tae Keller, the story of three friends who navigate their complicated feelings about each other and their fears of the unknown; That Which Feeds Us by Keala Kendall, about a teen girl’s search for her missing twin, which leads her to a remote island resort where she uncovers the sinister side of paradise with horrors both real and supernatural; and Nest of Tongues by Randy Ribay, a YA horror novel about vampires from the Philippines and a hunter on their tail.\nRANDOM HOUSE GRAPHIC\nRandom House Graphic ties on an apron for Lovely Recipe by Myra Rose Nino, which finds klutzy high school senior Sofia desperate to learn her late grandmother’s family recipes and falling for classmate Anna Marie, who agrees to give Sofia cooking lessons; Oh Brother by Gina Chadderton, a middle grade coming-of-age graphic memoir exploring the author’s deep bond with their brother, a nonverbal autistic boy with an intellectual disability; Someday Perfect by Kat Schneider, in which a teenager struggles with how she presents herself to the world after she falls for a fellow camper at her Christian sleepaway camp; Hilo Presents: The Mighty by Judd Winick, beginning a new series in which average kid Miranda Luna unexpectedly develops the ability to transform into a super-strong, hairy giant; and Sol Goes for Goal! by Julio Anta, illus. by Gabi Mendez, the next installment in the Hillside Valley series which follows seventh-grader Sol, who is navigating tryouts for the school soccer team and her first crush on another girl—who happens to be the team captain.\nRANDOM HOUSE STUDIO\nRandom House Studio climbs the family tree with Grumpy Monkey Father’s Day Fuss by Suzanne Lang, illus. by Max Lang, in which readers learn where Jim Panzee gets his grumpiness from; Who Are You? by Claire Keane, about a girl who explores the outdoors and discovers how each experience, from watching butterflies to feeling raindrops, shapes her identity; Owl by Myself by Pete Oswald, about a little owl who sets out to prove it can handle everything on its own; Camp Frenemies Book 2 by Liz Montague, following pals Bea, Roxy, and Virginia during another summer at Camp Chordata; and My Papa Has a Red Mustache by Leo Espinosa, the story of a girl who learns to appreciate her Papa’s unique red mustache when the two become separated during a soccer game.\nRANDOM HOUSE/SCHWARTZ\nAnne Schwartz Books charges up its headlamp for Navigating Night by Julie Leung, illus. by Angie Kang, in which a girl bonds wither her father as she helps him deliver Chinese take-out food; The Mother Tree by Sybil Rosen, illus. by Nancy Carpenter, featuring a kid who saves a beautiful mother tree from being chopped down; The Naked Streak by Kim Howard, illus. by Jaime Kim, following a little kid who refuses to wear any clothing, until they discover a few unusual fashion pieces; and Indigo Hands by Sita Singh, illus. by Maithili Joshi, the story of a girl who accompanies her father to his indigo studio and learns how to dye cloth indigo.\nRANDOM HOUSE/BRIGHT MATTER\nBright Matter Books builds a balloon bouquet for Coming Home (Adapted for Young Adults) by Brittney Griner and Michelle Burford, the WNBA icon’s memoir about her journey from early athletic stardom to an account of how she persevered in a Russian prison; Unfathomable: 20 Wild (But True) Stories About the Ocean by Mary Boone, illus. by Max Temescu, featuring tales from our world’s unbelievable—and unpredictable—oceans; and Unstoppable Us, Volume 3: How Enemies Become Friends by Yuval Noah Harari, illus. by Ricard Zaplana Ruiz, offering another look at how different ancient civilizations united and created countries and cultures we have today.\nRANDOM HOUSE/CROWN\nCrown follows a trail to spring with When We Were Snails by Nan Cao, about a girl who holds on to the memory of her mother’s love when her mom must work far away; Ambrosia Lee Drops the Mic by Patricia Park, in which a Korean American former child actor decides to give up her flailing acting career to follow a new dream; Black Hands by Carole Boston Weatherford, illus. by R. Gregory Christie, celebrating African Americans’ countless contributions in the U.S.; and Jin Young, Between Two Worlds by Ellen Oh, about a Korean American teen who is willing to travel between parallel worlds if it’s the only way he can reunite with his girlfriend.\nRANDOM HOUSE/DELACORTE\nDelacorte books a getaway at The Faraway Inn by Sarah Beth Durst, in which a teen girl’s summer is turned upside down when she learns her great-aunt’s inn is hiding magical secrets; Blightfall by Brandon Sanderson and Janci Patterson, a trilogy opener and companion to the Skyward Series, which fins Skyward Flight on a new adventure to investigate mysterious happenings on the remote planet Blightfall; Stolen Midnights by Katherine Quinn, the tale of a thief who joins forces with the palace darling after he unwittingly steals a necklace with the power to change everything; X Marks the Haunt by Lindsay Currie, which finds the son of the local crypt keeper trying to end the haunting unleashed when a centuries-old crypt key is lost; and Thornbird by E. Kennedy, focused on the daughter of a serial killer who gets caught up in the search for the missing bodies of her father’s victims.\nRANDOM HOUSE/DELACORTE ROMANCE\nDelacorte Romance wins a spring faceoff with Love on Ice by Sara Ney, about a bookworm in desperate need of a prom date who gets the opportunity to strike a bargain with her hockey-star crush; Love in Ruins by Auriane Desombre, in which a teen grappling with her recent OCD diagnosis meets a captivating local girl on a school trip to Greece; We’re a Bad Idea, Right? by K.L. Walther, a Risky Business-inspired rom-com which finds Audrey agreeing to fake date her best friend and turn her home into an Airbnb while her parents are away for the summer; an as-yet-untitled novel by Kristy Boyce, showcasing a gaming romance that includes a touch of high school band competition; and As Long as You Loathe Me by Swati Hegde, the story of a teen who tries to get back at her ex-best friend for stealing her crush and ends up rekindling their complicated friendship.\nRANDOM HOUSE/DR. SEUSS\nDr. Seuss Publishing knows Who’s in the kitchen with Cooking with Horton by Elle Caraway, which finds Horton the elephant making a special dish for his friends; Thing One and Thing Two’s Funner-Than-Fun Seek and Find!, illus. by Tom Brannon, encouraging readers to find more than 100 items throughout the book; and A Trip with BLIP by Jerrard Polk, following two siblings to the library where they meet a talking machine that turns books into adventures.\nRANDOM HOUSE/DOUBLEDAY\nDoubleday holds the anchovies for Pizzasaurus by Tammi Sauer, illus. by Kyle Beckett, featuring a prehistoric pizza party; Baby Botanicals: Good Morning, Garden! by Jillian Miao, illus. by Riley Samels, the kick-off to a board book series promoting a love of gardening; Gigantic: The Small Whale with a Big Heart by Rob Biddulph, which presents positive messages about teamwork and believing in yourself; The Baby Who Only Said No! by Sandra Salsbury, in which the star of The Baby Who Stayed Awake Forever drives her family to the brink as she learns a very useful new word; and Farm Shark by Bill Canterbury, illus. by Maddie Frost, about a very chompy shark who visits the farm and causes mayhem.\nRANDOM HOUSE/GOLDEN\nGolden Books swings for the fences with Shohei Ohtani: A Little Golden Book Biography by Nicole de las Heras, illus. by Toshiki Nakamura, spotlighting the Japanese baseball superstar who plays for the L.A. Dodgers; Jenna Ortega: A Little Golden Book Biography by Heather E. Schwartz, illus. by Luz Tapia, dipping into the life of the Wednesday and Beetlejuice Beetlejuice actor; My Little Golden Book About Route 66 by Diane E. Muldrow, illus. by Alexandra Bye, which explores the sights and history of U.S. Highway 66; My Little Golden Book About the 80s by Jennifer Arena, illus. by Spencer Wilson, taking a look back at famous faces, cultural movements, and historical events of the 1980s; and I’m a Drone by Danna Smith, illus. by Brian Biggs, about mechanical drones, how they work, and what they are useful for.\nRANDOM HOUSE/JOY REVOLUTION\nJoy Revolution steps right up for Carnival Fantástico by Angela Montoya, the tale of a thief pretending to be a fortune-teller who competes to be the lead act at a magical traveling carnival, until her former flame shows up and warns her that the carnival is more sinister than it appears; Charmed and Dangerous by Shelly Page, a contemporary sapphic romantasy centered on a teen mystic who will do anything to solve a series of love-related magical mishaps plaguing the high schools in her small town; Love Makes Mochi by Stefany Valentine, the final romance in the Love in Translation series, in which a teen goth fashion designer travels to Tokyo, where she meets a rainbow-haired budding tattoo artist who changes her idea of love; Rebel Heiress by Amalie Howard, a Regency-era romance in the Diamonds series, following a brilliant almost-spinster who meets her match in a handsome mathematician, while pretending to be her male cousin at Cambridge University; and To Dance the Moon and Stars by Tasia M S and Barbara Perez Marquez, about a future high priestess who must unlock her full power with the help of a dance goddess and her childhood best friend, who’s also the crown prince, before dark forces destroy her kingdom.\nRANDOM HOUSE/KNOPF\nKnopf mixes a glass of Tang for Life on the Moon by Matthew Swanson, illus. by Robbi Behr, the tale of a curious boy sent to live on the moon; Because of a Shoe by Julie Fogliano, illus. by Marla Frazee, about an especially impossible-to-put-on pair of shoes; The Future Book by Mac Barnett, illus. by Shawn Harris, which humorously imagines the words and phrases humans will be using in the future; Red Star Rebels by Amie Kaufman, a sci-fi adventure focused on a stowaway girl and an entitled boy who find themselves falling for each other as they race against the clock to outwit a band of mercenaries; The Fight of Our Lives: Voices from the AIDS Crisis by David Levithan and Gabriel Duckels, exploring the AIDS crisis in the United States via primary source interviews and narratives, poems, essays, and other creative works, medical research, and cultural touchpoints.\nRANDOM HOUSE/LABYRINTH ROAD\nLabyrinth Road cannonballs into the season with Last Day Pool Party by Emma Steinkellner, a graphic novel snapshot of all the drama at the Orange Grove Junior High bash just before summer break; Guardians: Forbidden Mountain by Brandon Mull, in which two children from very different worlds—one magically bonded with a powerful but dangerous spirit and one with the ability to read emotions—cross paths on a journey to save their empire from a mysterious rising evil; Clementine H. Hopeful Is Not a Hero by Noah Corey, following a gender-queer seventh-grader who becomes an unexpected anti-hero when he discovers a world of magic and monsters; The Dragon’s Apprentice: Revenants Return by James Riley, which finds human apprentice Ciara and her dragon teacher Scorch trying to disentangle the lies of the Emperor with the aid of his son the prince; and My Voyager: A Love Story by Deb Caletti, a love story between a girl whose anxious thoughts tie her down, and a boy whose dreams of the stars lift her up—until tragedy strikes and she has to find a way forward without him.\nRANDOM HOUSE/MAKE ME A WORLD\nMake Me A World strolls into spring with Jeong Is Jeong by Jessica Yoon, illus. by Michelle Lee, which finds a Korean American girl and her grandmother spending the day exploring their community, showing care for other people, and exchanging stories in hopes of understanding the meaning of the not-quite-translatable Korean word “Jeong.”\nRANDOM HOUSE/RODALE KIDS\nRodale Kids pays it forward with the following concept books in the Books of Kindness series by Patricia Hegarty, illus. by Summer Macon: ABCs of Kindness at School; 123s of Kindness at Bedtime: A Touch & Feel Board Book; and ABCs of Kindness (Deluxe Edition).\nRED COMET\nRed Comet Press tests its scuba gear for The Lost Sea Garden by Alison Goldberg, illus. by Vanessa Gillings, the story of a humpback whale and her search for a mythical sea garden where clearer waters could be the key to survival for her family and the ocean; Barbed Wire Between Us by Mia Wenjen, illus. by Violeta Encarnación, a reverso poem that starts with a Japanese American girl interned in a camp in Oklahoma during World War II, which pivots to a contemporary account of a Latina immigrant girl interned in the same facility; Time for Haiku by J.N. Santaeulàlia, illus. by Lucian Lozano, trans. by Lawrence Schimel, featuring 50 haiku reflecting aspects of the seasons throughout the year; Tova’s Sweet Solution by Melissa Taylor, illus. by Aurelie Lise-Anne, in which Tova finds creative ways to feed her sweet tooth and stay mindful of her intolerance to certain ingredients; and An Invisible River to Cross by Taraneh Matloob, illus. by Kristen Balouch, offering a look at how difficult it would be to start a new school in a new country where you do not speak one word of the language.\nREGAL HOUSE/FITZROY\nFitzroy Books butters the popcorn for The Reel Life of Zara Klegg by Brad Barkley, following 16-year-old Zara, still mourning her mother, as she works a solitary job as a projectionist at a small beach town theater that screens only old sci-fi B movies; The Unfinished Business, Book One by Stephanie Campisi, in which Dari inherits a ghost-busting business, and soon learns that finishing the unfinished business of ghosts is no piece of cake; The Wonders of Shadow Key by John Fleming, the story of a girl and her parents who escape to an abandoned beach town in a storm-ravaged, near-future Florida, where the girl befriends a colony of quirky, shipwrecked ghosts; Pinkie’s Turnabout by Sue Llyod-Davies, about a 12-year-old girl who fights to adopt a snarky stray cat in the hope that he can save her beloved great-grandmother from losing her memory; and Gone Before You Knew Me by Renkipate Wildermuth, featuring a high school student who enlists the help of the new guy at school to protect herself from a sinister conspiracy plot.\nRUNNING PRESS KIDS\nRunning Press Kids tracks oversize footprints in the forest for Bigfoot and Friends: Believe in Yourself, illus. by Wendy Stephens, which finds Bigfoot and his cryptid friends learning self-confidence; and The Monster Manual: The Ultimate Guide to Werewolves, Goblins, and Other Wicked Creatures by Sarah Glenn Marsh, a guide to the history of these monsters, their interactions with humans, and information on how and where to find them.\nSCALLYWAG\nScallywag Press combs the beach for A Passing On of Shells by Simon Lamb, illus. by Chris Riddell, a debut collection of 50 poems, each written in exactly 50 words, on such subjects as family, identity and growing up, and the wonder of nature; Hannah and the Violin by Satoshi Kitamura, in which Hannah spots a leaf that looks like a violin on the grass and decides to see if she can play it; Ten Little Dogs by Ruth Brown, featuring a countdown of canines; and Phyllis and Grace by Nigel Gray, illus. by Bethan Welby, focused on the friendship between Phyllis, who lives alone and whose memory is fading, and Grace, the child next door.\nSCHOLASTIC EN ESPAÑOL\nScholastic en Español says bienvenudo to Prisionero B-3087 by Alan Gratz; Sobreviví el tornado de Joplin, 2011 by Lauren Tarshis and Scott Dawson; and Spanish editions of Dreaming of a Quinceañera by Yamile Saied Méndez and Christine Almeda; Baby-Sitters Little Sister #6: Karen’s Birthday by Ann M. Martin and Katy Farina; and Around the Spider-Verse by Justin A. Reynolds and Penelope Rivera Gaylord.\nSCHOLASTIC PAPERBACKS\nScholastic Paperbacks sparkles for spring with Magic Gems #1: Journey Through the Waterfall, launching a chapter book series starring a group of friends who protect animals with magical gemstones; Max Beast #1 by Maddy Mara, first in a series where a magic talisman transforms Max into different animals when the situation calls; Diary of a Bad Dog #1: Unicorn Chase, in which reformed “bad dog” Benny attempts to catch the magical unicorn he suspects is causing chaos in his neighborhood; How to Save a Dolphin by Michelle Schusterman, about 12-year-old Dany and her community working together to get a dolphin that’s trapped in a nearby creek back to the sea—before a looming hurricane strikes; and I Survived the American Revolution, 1776 by Lauren Tarshis, a special edition for America’s 250th anniversary, including 64 pages of full-color nonfiction backmatter.\nSCHOLASTIC\nScholastic Press saddles up for Rhea’s Rodeo by Laekan Zea Kemp, illus. by Raissa Figueroa, spotlighting Mexican family traditions, fierce competitions, female bravado, and the real meaning of triumph; Goldenborn by Ama Ofosua Lieb, about a teen girl who navigates a hidden realm of Ghanaian gods and supernatural crimes in San Francisco’s AfricaTown to save her father and uncover her true power; The Gravewood by Kelly Andrew, first in a duology in which Shea makes a literal devil’s bargain with the vampires who supply black market goods in exchange for items to help her ill and disabled neighbors; Burn the Water by Billy Ray, which follows two warring Houses in a future London that has been submerged in rising oceans; Theft of the Ruby Lotus by Sayantani DasGupta, about the strange treasure that turns up in Ria’s mail one day, presenting her and her friends with a mission to keep it out of the hands of those who dishonor it; Magnitude by Jennifer A. Nielsen, following three kids desperately searching for their families and evading a gang of thieves in the wake of the Great Earthquake of San Francisco in 1906; That’s Awe! by Chana Stiefel, illus. by Susan Gal, exploring the mysterious feeling of awe that can arrive in big moments or small everyday wonders; How NOT to Make a Jelly Sandwich by Ross Burach Fun, featuring a girl’s silly, adventure-filled “how to” guide; and Just for Today by Charlotte Agell, illus. by Ana Ramírez González, the story of a misadventure with a boat that shows Elba and Norris how to ease their worries and be okay, even if just for today.\nSCHOLASTIC/ACORN\nAcorn introduces a fun guy with early reader title Gus the Mushroom Dragon (Dragon Hill #2) by Tracey West, illus. by Carolina Vázquez.\nSCHOLASTIC/AFK\nAFK’s got rizz with the following titles based on digital franchises: Skibidi Original Novel and Five Nights at Freddy’s #2: The Official Movie Novel.\nSCHOLASTIC/BRANCHES\nBranches keeps cool with the following early chapter books: The Fantastic Freeze Ray (Super Villains in Training #1) by Kailei Pew, illus. by Carolina Coroa; Corner Kick! (Sports Zone! #2) by Andrew Maraniss, illus. by Aishwarya Tandon; Claim the Emerald Crown (Coral Keepers #3) by Robin Yardi, illus. by Paul Kellam; Battle of the Super Rabbit Boys! (Press Start! #18) by Thomas Flintham; and Defending the Swamp Dragon (Dragon Masters #31) by Tracey West, illus. by Graham Howells.\nSCHOLASTIC/CARTWHEEL\nCartwheel Books embraces the flavors of fall with My Little Pumpkin Spice by Liv Wan, showcasing apple cider, pumpkin spice, and other autumn drinks; Tales from Acorn Wood: Fox’s Socks and Rabbit’s Nap by Julia Donaldson, illus. by Axel Sheffler, featuring the animals of Acorn Wood in everyday situations, such as getting dressed and trying to take a nap; Hello Babee by Sandra Magsamen, about welcoming a babee to the world and letting them know how much they are loved; and Millie Fleur’s Pumpkin Problem by Christy Mandin, a Halloween tale in which Millie tackles her biggest challenge yet; and Spin and Lift: Rescue Trucks by Ilanit Oliver, illus. by Steve James, launching a transportation novelty series.\nSCHOLASTIC/GRAPHIX\nGraphix follows the drum major with Crescent Moon Marching (Vol. 1) by Hamachi Yamada, in which a new student finds inspiration, friendship, and maybe even romance when she joins the ultra-competitive high school marching band; Catwad’s Friend, Blurmp: A Blurmp in Time by Jim Benton, beginning a spinoff series about Catwad’s BFF Blurmp as he travels through space and time; Fruitcake by Rex Ogle and Dave Valeza, the autobiographical story of eighth grader Rex who has a girlfriend, but can’t stop thinking romantically about his best friend, Drew; Mixed Feelings by Sara Amini, illus. by Shadia Amin a graphic memoir following Sara, a mixed-race sixth grader, who is struggling to find her place at school, in drama club, and with her friends; and Snowlands: A Blood Moon by Morr Meroz, illus. by Collin Fogel, first in a fantasy series about three outcasts—Feba, a white wolf cub; Usha, a snow leopard; and Batu, a Pallas’s cat—who join forces for the adventure of a lifetime.\nSCHOLASTIC/LITTLE SHEPHERD\nLittle Shepherd counts its blessings with Mommy Loves Me (And God Does Too!), which finds farm animal babies thankful for the everyday blessings of God and their mother’s love.\nSCHOLASTIC/ORCHARD\nOrchard Books spins a yarn for Rumpelstiltskin by Mac Barnett, illus. by Carson Ellis, a new interpretation of the fairy tale; When You Dream Big by Peter H. Reynolds, following Charley on Dream Big Day at school as she ponders not just what she wants to be when she grows up, but who she wants to be; Rise Girl, Rise: Our Sister-Friend Journey. Together For All by Gloria Steinem and Leymah Gbowee, illus. by Kah Yangni, in which feminist icon Gloria Steinem and Nobel Peace Prize winner Gbowee share their parallel journeys as friends who come together to tell an uplifting story of girls and women strengthening one another and changing the world; Bandage Buddies by Kathryn Rammell, introducing a group of emotional support bandages who help kids everywhere with any kind of wounds—emotional or physical; and The Genius Next Door by Dean Robbins, illus. by Sean Rubin, offering a peek into the life of genius Albert Einstein and how he taught a young neighbor to love math.\nSEVEN STORIES/TRIANGLE SQUARE\nTriangle Square creates some space with Nobody but Me by Sara Lundberg, the story of a boy who unties the knot anchoring his small boat near his mother and floats off on a quiet and peaceful journey through town, jungle, and city; Azadi Means Freedom, in which a young woman activist takes on her government and the world’s largest sports body, FIFA, to fight for women’s and girls’ rights in Iran; Silver Wolves by Jerome Charyn, a novel about a teenager who must choose between the life of the streets and a life of art and opportunity in 1950s New York City; and Newyorkinas, the Spanish-language edition of City Girls by Loretta Lopez, which finds three middle schoolers in New York City supporting each other while dealing with issues around immigration, divorce, and an ill parent.\nSIMON & SCHUSTER\nSimon & Schuster Books for Young Readers tosses up a spring mix with Unsettling Salad! by Aaron Reynolds, illus. by Peter Brown, introducing a chapter book series of creepy tales; Go Bananas! by A.B. Peele, illus. by Lala Watkins, featuring an a-peeling bunch of fruit friends; Just Try It! Someplace New! by Phil Rosenthal and Lily Rosenthal, illus. by Luke Flowers, which finds Netflix food and travel star Rosenthal and his daughter Lily trying all kinds of different experiences; and The Traitor Moth by Katharine Orton, about a young moth on an epic journey to save his clan and the kingdom from peril; and Loops by Jashar Awan, celebrating an important kid milestone: learning to tie one’s shoelaces.\nSIMON & SCHUSTER/SIMON SPOTLIGHT\nSimon Spotlight adds a special ingredient to Cupcakes & Camp by Coco Simon, illus. by Tracy Bishop, the launch of a Cupcake Diaries middle grade spinoff featuring Mia, as she navigates discomfort and unmet expectations at sleepaway camp.\nSIMON & SCHUSTER/ALADDIN\nAladdin digs Relic of Thieves by Shana Targosz, continuing the Underwild fantasy series; Tested by Anna Monders, following a girl in a world where everyone’s future is determined on their Genetic Report Card, who finds out her elite score was based on another girl’s DNA; Europa by James Ponti, in which the City Spies have to race across Europe in the hope that they can thwart attacks by Umbra; Girl of Lore by Melanie Dale, the paranormal story of a girl who’s used to battling the monster of her own mind and discovers there’s an even more sinister evil lurking in her small town; and The Aftermyth by Tracy Wolff, the first book in a dark academia fantasy middle grade series inspired by Greek mythology.\nSIMON & SCHUSTER/ATHENEUM\nAtheneum goes off-leash with The Pup Days of Summer by Kelly Leigh Miller, which finds Cloud Puppy and her friends spending their summer holiday riding rollercoasters, visiting a floating island festival, telling campfire stories, and more; Howliday Inn by James Howe and Andrew Donkin, illus. by Stephen Gilpin, the second book in the Bunnicula series to be adapted as a graphic novel; Glory Be by Jamie Sumner, following a girl searching for her lost dog and the truths about her family; The Danger of Small Things by Caryl Lewis, about girls finding their voices in the darkest of times; and A Fish Like Me by Jamie Sumner, illus. by Devon Holzwarth, the story of a child in swim therapy, celebrating the ways differently abled bodies can move in the water.\nSIMON & SCHUSTER/ATHENEUM/DLOUHY\nCaitlyn Dlouhy Books shambles into spring with How to Draw a Zombie by Zoey Abbott and August Jeffrey Wagner, illus. by Abbott, an irreverent picture book about creativity and zombies; Ramin Abbas Has MAJOR Questions by Ahmad Saber, about a gay teen who has to choose between being true to himself, or to his faith, and his realization that maybe those two things aren’t as separate as he thought; Nani and the Lion by Alicia D. Williams, illus. by Anna Cunha, in which a girl who loves to drum comes face to face with the King of the Lions who loves quiet; Debug This Book by Omar Abed, illus. by Julie Rowan-Zoch, which finds a boy enlisting the reader and other helpers to rid the computer on which he’s writing of a “bug”; and Yulu’s Linen by Cao Wenxuan, illus. by Suzy Lee, following aspiring artist Yulu as she tries to paint the perfect self-portrait.\nSIMON & SCHUSTER/BARLEY\nSarah Barley Books howls at the moon for The Lure of the Wolves and Whispers by Amanda Connolly, following a girl who risks everything to buy the rare forbidden magic that could save her sister’s life and finds herself bound to a dangerous rebel leader; Love Me Tomorrow by Emiko Jean, about a teen who starts receiving letters from the love of her life—writing to her from years in the future; Heiress of Nowhere by Stacey Lee, a historical gothic mystery focused on a girl racing to uncover a killer—who may or may not live in the sea—before she is the next victim; Salt Water Blood by Manuia Heinrich, in which an Indigenous teen embraces her gift of hearing the sea’s prophetic thoughts to clear her brother’s name of a crime; and Local Gods by Melinda Salisbury, the story of a girl who must decide whether to save the hometown that hates her or burn it all down when a dying god hidden in the woods warns her of an impending catastrophe.\nSIMON & SCHUSTER/BEACH LANE\nBeach Lane has a book here, has a book there with The Case of Old MacDonald and His Farm by Mark Teague, which finds something mighty suspicious—and silly—afoot on Old MacDonald’s farm on April 1; Come What May by Debi Gliori, a testament to the unconditional love between parents and their children, which is strong enough to withstand whatever life may bring; Little Ghost’s Summerween by Maggie Edkins Willis, in which Little Ghost discovers the only thing better than a summer birthday party are the spooktacular friends and family you share it with; You and I Are Stars and Night by Kate Hosford, illus. by Richard Jones, which celebrates the loving relationship between parent and child on a dreamy journey before bedtime; and I Want Everything! by Sophy Henn, the story of a ghost who declares he wants everything, and the pal who helps him see that friendship is the real treasure.\nSIMON & SCHUSTER/LITTLE SIMON\nLittle Simon is the alpha dog with Leader of the Pack by Cam Higgins, illus. by Ariel Landy, launching a Good Dog spinoff series following the adventures of Bo’s best puppy friend; Juneteenth by Hannah Eliot, illus. by Tequitia Andrews, centering the history of Juneteenth and the ways we celebrate it today; Chicka Chicka I’m a Big Sister by Bill Martin Jr. and John Archambault, illus. by Daniel Roode, designed for an older sister who’s expecting a new baby to arrive; and Lawn-Mowing Day! by Breanna Carzoo, showcasing a cast of lawn-care-crazy critters who snip, clip, and mow the day away.\nSIMON & SCHUSTER/MCELDERRY\nMargaret K. McElderry Books harnesses spring energy with Steam by Shaenon K. Garrity, illus. by Emily Holden, following genius humanoid Ruby as she decides to play Cupid and match up her coworkers and the regulars at her local coffee shop; Infinite Shores by Pascale Lacelle, the final book in the dark academia fantasy Drowned Gods trilogy; Devious Prey by Scott Reintgen, about a young woman who must survive the deadly mythical creature she smuggled aboard an airship after it crash lands on a deserted island and begins hunting the survivors; The Traitor’s Gambit by Amanda Foody, next up in the Wilderlore series, in which Barclay learns to use his strange powers in order to save the Jungle; and The Last Best Quest Ever by F.T. Lukens, the story of a fraudulent teen quester forced to team up with a brooding rival prince on a perilous adventure to save her brother’s life.\nSIMON & SCHUSTER/MILLNER\nDenene Millner Books sizes up the season with Daisy Helps with the Dress by Olugbemisola Rhuday-Perkovich, illus. by Charis Jackson Barrios, which finds Daisy bringing her family together to make her cousin Simone the perfect wedding dress; Pecosita’s Freckly Freckle Face by Aliya King Neil, illus. by Eric Velasquez, featuring Pecosita, who stands firm in her love for the freckles that adorn her face even if the kids at school poke fun; The Toy Plane by Cherise Harris, the story of Leonard, who travels on a fantastical voyage to retrieve his treasured toy plane from an egret that swoops in and steals it; The Umbrella by Sylvia Walker, in which Zora makes room under her umbrella for new friends at the park during a sudden rain shower; and The Other Side of the Garden by Sili Recio and Elena Djome Lawrence, illus. by Brianna McCarthy, centering a girl coping with her grandmother’s death as she discovers that memories can help keep our loved ones alive.\nSLEEPING BEAR\nSleeping Bear Press pitches a tent for Camping Is a Terrible Idea by Kirsten Pendreigh, illus. by Tiffany Everett, featuring a routine-loving city kid who goes camping, anticipating chaos and calamity, only to discover that nature has its own reassuring sounds and patterns; Hattie, the Happy Camper by Danielle Davison, illus. by Alyssa Russell, about Hattie, who keeps her human family warm, safe, and dry, but is left all alone when the children grow up and move on; GiRaft: A Real-Life Giraffe Rescue by Laurel Neme, illus. by Elisa Paganelli, the true story of how a 20-foot-tall wild giraffe was transported to safety when their home in Kenya is flooded; Mama’s Song by Julie Buchholz, illus. by Faryn Hughes, in which a mother tells her new baby how to live mino-bimaaduziwin (a good life) by following the teachings of the Seven Grandfathers alongside their ancestors; and A Puppy Like Yours by Frank Murphy and Carla Murphy, illus. by Kayla Harren, celebrating dogs and all the lessons they have to teach us.\nSOHO PRESS/SOHO TEEN\nSoho Teen stays up late for We Run the Night by Peace Mbengei, which finds Shani wondering what is happening when she wakes up with mud on her feet and a headache one morning, following rumors of legendary night runners appearing on the campus of her boarding school in Nairobi.\nSOURCEBOOKS\nSourcebooks Young Readers holds its head high for The Unbreakable Crown by Carina Finn, the next volume in the Feast and Famine series, in which the heirs of the two houses must survive the trials at a boarding school for demons if they are to return home to Fauret; The Curse Breaker by Jen Calonita, the latest Isle of Ever title, which raises the stakes in the game to find a treasure; Dragon Girl and the Awakened Flames by Jenny Moore, about an orphan girl who discovers she has dragon blood, the key to immortality; War by Eoin Colfer and Andrew Donkin, illus. by Giovanni Rigano, telling the story of two young people whose lives are impacted by war; and Georgie Summers and the Scribes of Scatterplot by Isaac Rudansky, introducing 12-year-old Georgie and his journey into the hidden realm of Scatterplot.\nSOURCEBOOKS EXPLORE\nSourcebooks Explore preheats the oven for My Very First Baking Book by Danielle Kartes, introducing young chefs to simple recipes they can execute (mostly) on their own; I Can Say Bye-Bye by Stephanie Cohen, illus. by Lindsay Dale-Scott, the next installment in the My First Learn-to-Talk line, which teaches readers to say “hi” and “bye-bye” as they open and close flaps, and practice waving in a mirror; Butt or Face? Adora-Butts! by Kari Lavelle, serving up a new set of close-up photos of animals and challenging readers to guess whether they’re looking at the critter’s top or its bottom; Why Space Will Freak You Out by Kimberly K. Arcand and Megan Watzke, illus. by Robert Ball, in which two NASA scientists present the scary, horrific parts of the universe; and The Six Queens of Henry VIII by Honor Cargill-Martin, illus. by Jaimee Andrews, a feminist guide to the lives of these bold queens.\nSOURCEBOOKS FIRE\nSourcebooks Fire warms things up with The Sun and the Starmaker by Rachel Griffin, following Aurora who is whisked away to the Starmaker’s enchanted castle to harness the sunlight and protect her village against the deadly frost; Burn the Kingdom Down by Addie Thorley, in which Indira decides to take her elder sister Rowena’s place as a captive bride in an enemy nation and seek vengeance after Rowena is murdered; She Knows All the Names by Michelle Jabès Corpora, second installment in the Throne of Khetara trilogy, which finds a princess, a priestess, a rebel, and a tomb raider at the heart of the turmoil as an ancient oracle continues to unfold; and All We Once Had by Katy Upperman, a contemporary romance exploring the complicated nature of grief, family, growing up, and the beauty of second chances.\nSOURCEBOOKS JABBERWOCKY\nSourcebooks Jabberwocky hippity hops into spring with A Fluffle of Bunnies by Christie Matheson, which finds a scurry of squirrels and other woodland animals (identified by their collective nouns) in search of a missing gray rabbit, who eventually reveals a fluffle of baby bunnies; Judgy Bunny and the Terrible Beach by Scott Rothman, illus. by Linzie Hunter, introducing a rabbit whose first instinct is to expect every new experience is the worst, especially if she wasn’t invited, or might not be good at it; Wildspeak by Sangma Francis, illus. by Lexi Vangsnes, simultaneously offering an invitation to discover new (real) words and your own words for experiences in nature; The Sun Thief by Alice Hemming, illus. by Nicola Slater, about the way the days lengthen and shorten as spring turns into summer and summer into fall; and My Daddy Is Everything by Carole Boston Weatherford, highlighting the special role that a father plays in a child’s life and the many ways he shows his love.\nSOURCEBOOKS/CALLISTO KIDS\nCallisto Kids visits Olympus with Female Heroes of Greek Mythology by Megan DuVarney Forbes, illus. by Meel Tamphanon, featuring the stories of 51 brave and and fearless female heroes of Greek mythology; and What to Do When It’s Time to Calm Down by Cara Goodwin, illus. by Katie Turner, offering self-regulation and communication skills designed to help toddlers understand where big feelings come from.\nSOURCEBOOKS/DUOPRESS\nduopress delivers with Gunnar the Viking’s Great Pizza Adventure by Diego Vaisberg, in which Gunnar the Viking realizes that bravery on the battlefield is not his true calling; Bebé Ama a Papá / Baby Loves Dad by Chela de la Vega, illus. by Teresa Martinez, a bilingual Spanish/English board book that showcases the love between bebé/baby and papá/dad; and Baby Animals, a soft-fabric, high-contrast book that clips to a stroller, featuring black-and-white images of friendly baby animals.\nSOURCEBOOKS/STONEFRUIT STUDIO\nStonefruit Studio levels up with Fatal Glitch: Camp Zero by Erin Entrada Kelly and Eliot Schrefer, the first book in a middle grade series about technology gone wrong following a girl at a summer camp for gamers that ends up being an elimination game of its own; and The League of Dangerous Young Ladies by J.A. Morgenstein, featuring Rose Moriarty and her friends as she attempts to help Count Dracula unlock a magical relic while running her own long con to hunt monsters in all their forms.\nSOURCEBOOKS WONDERLAND\nSourcebooks Wonderland looks under its pillow for The Untold Story of the Tooth Fairy by Diane Albert, in which the Tooth Fairy answers the many questions curious kids have about how she came to be; Truckosaurus by Karen Shapiro, illus. by Rachel Foo, which takes readers on a journey to the magical island where incredible creatures roam, including the most loyal, brave, and kind Truckosaurus; Ooh! Ooh! Ooh! I Love You! by Rose Rossner, illus. by Katherine Castano, the latest Punderland entry, featuring punny rhymes of love and encouragement; I Chews You: On the Farm by Louise Anglicas, a teether book containing friendly farm animal faces; and Meet April by April Martin, an addition to the Calendar Kids series, focused on April, who loves pranks, animals, and nature.\nTIGER TALES\nTiger Tales flocks together for Whose Nest Is Best? by Lyndsay Wasko, exploring the nests of birds around the world; Marcie and Giraffe by Kim Gregory, which finds Marcie and Giraffe figuring out a way to enjoy making art together; Don’t Do It, Doug! by Maudie Powell-Tuck, illus. by Duncan Beedie, the story of a curious hamster whose lack of impulse control leads to unfortunate but silly consequences; Mister Norton’s New Truck by Huw Lewis Jones, illus. by Corey Egbert, in which Mr. Norton tries different vehicles for his journey to work after a bear has broken his bicycle; and Moon’s Lullaby by Júlia Moscardó, which finds Mama Goose telling her five goslings their favorite bedtime tale.\nTILBURY HOUSE\nTilbury House is on the right track with Spring Scenthound by Karen Finch, illus. by Ángeles Ruiz, in which a child and their hound race out after school to search for spring in a nearby woods; I Am Light by Henry Herz, illus. by Mercè López, providing a history and scientific explanation of light, from Light itself; The Mermaid by Patty Brozo, illus. by Annie Bowler, about a child on a family lakeside vacation who learns to love the water with the help of her grandfather; and The Heronry by Barbara Herkert, visiting a blue heron nesting site as the birds arrive in the spring to make nests, lay eggs, and raise fledglings.\nTRANSIT\nTransit Children’s Editions RSVPs for Chez Mousse by Claire Lebourg, which finds typically solitary protagonist Mousse hosting a holiday party; The Mueganos by Jacque Jours, about a Mexican family who are so close they’re literally stuck together, like the traditional Mexican street candy; and Have You Ever Heard a Horse Sing? by Pauline Barzaia, a surreal adventure in sound and wordplay.\nTUNDRA\nTundra Books pops the hood for Sarabeth’s Garage by Melanie Florence, illus. by Nadia Alam, about an independent and spirited girl who has no time for the limitations that society wants to put on her, and who wants to help her father out at the garage; the Now I See series by Mac Barnett and Jon Klassen, a quartet of board books that playfully shows the changing seasons through a child’s eyes; Billie Builds a RoboCorn by José Avelino Gilles Corbett Lourenço, illus. by James Braithwaite, introducing precocious and resourceful Billie and her adventures making new friends; Fantastic Frog and the Amazing Tad Lad by Brandon Reese, first in a middle grade graphic novel series starring two frog superheroes battling the scaly swamp thing terrorizing Sector One; and A Deadly Inheritance by Kelley Armstrong, the story of 17-year-old Liliana, who discovers she’s an heiress to a billion-dollar corporation and finds herself at a new boarding school where she must navigate secret societies and a deadly competition.\nTUNDRA/SWIFT WATER\nSwift Water Books stands on guard for Canada by Richard Wagamese, illus. by Mangeshig Pawis-Steckley, a poem by Ojibwe author Wagamese reimagined as a picture book; and Here for a Good Time by Kim Spencer, featuring an Indigenous teen girl grappling with the effects of intergenerational trauma while managing school, family, and young love.\nTYNDALE HOUSE/TYNDALE KIDS\nTyndale Kids is gonna let it shine with Light of the World Bible Storybook by Salvation Poem Project, which highlights stories in the Bible that show how God used light to tell his story of love and redemption; The Dead Sea Squirrels: Cybersquirrels by Mike Nawrocki, in which Michael and Justin use AI to scrub images of squirrels Merle and Pearl from their class presentation about their trip to Israel—and get found out; Wake Up, Little Seed by Sarah Philpott, illus. by Amanda Morrow, a lift-the-flap board book that follows farmers from planting to harvest, emphasizing God’s provision and our role in caring for His creation; Parable Port: The Sower’s Secret by Brock Eastman and Shaun Stevenson, following Anthony as he uncovers a town’s mysterious link to Jesus’s parables; and Jesus Is for Kids: Jesus and the Outsiders by Connor Shram and Daniel Duncan, exploring how Jesus welcomed those who felt left out.\nUNION SQUARE & CO./UNION SQUARE KIDS\nUnion Square Kids calls shotgun with Catty Corner Hits the Road by Julie Murphy, illus. by Eve Farb, which finds Catty setting out on a road trip with Grandma Tabby, and discovering that traveling in close quarters can be tough to navigate; Seyoon and Dean: Unscripted by Sujin Witherspoon, in which a teenager determined to win the prize money her mother was cheated out of decades ago competes in a reality show where she must fake a relationship with another contestant; and The Birthday Bear by Mrs. & Mr. MacLeod, about the hilarity and joy that can be found in birthday celebrations.\nWALKER BOOKS AUSTRALIA\nWalker Books Australia drops anchor with Diary of a Marine Biologist by Anita Thomas, illus. by Sarah Wilkins, showcasing an adventurous week in the life of a marine biologist; Down the Plot Hole by Annaleise Byrd, following pals and reluctant reading partners Terry and Basil as they are plunged back into the Grimm World, this time to save their fairy tale friends from being sucked into oblivion by plot holes; How to Be Normal by Ange Crawford, which finds Astrid’s world opening up from her father’s tight control after her homeschooling comes to an end; and Neville’s Great Escape by Sean E. Avery, featuring the adventures of a risk-taking penguin who’s been swallowed by a whale.\nWATTPAD WEBTOON BOOK GROUP/WATTPAD\nWattpad Books puckers up for The Kiss Bet: A Novel by Farrah Penn, based on the graphic novel by Ingrid Ochoa, a dual-POV story following Sarah on her quest to experience her first kiss; The Blind Date Agreement by Jessica Cunsolo, in which 17-year-old Carina agrees to go on blind dates to hide her crush on her best friend’s boyfriend; and Cursed Princess Club: Mirror Mirror by Michelle Knudsen, based on the graphic novel by LambCat, which introduces the Princels—princes who have shunned society not because of curses, but because of their own insecurities.\nWEBTOON UNSCROLLED\nWebtoon Unscrolled tops the charts with Death of a Pop Star Vol. 2 by Violet Karim, following Sophie as she takes on the new challenge of college after striking a deal with the Grim Reaper, Eli, to get her life back; Daybreak Vol. 2 by Moosopp, in which Marcus has a crush, and Cog is completely unprepared for the hijinks that follow; Morgana and Oz Vol. 4 by Miyuli, which finds the witch and the vampire forced to work together to unravel a tangled web of dark magic that ensnares both their families; The Kiss Bet Vol. 3 by Ingrid Ochoa, focused on Sara, who has decided to take a break from bets, because her most recent one led to a very surprising first kiss; and True Beauty Vol. 8 by Yaongyi, the story of Jugyeong as she grows more worried about the state of her relationship with Seojun after finding out he might debut soon.\nALBERT WHITMAN\nAlbert Whitman counts down to spring with Abby in Orbit: Going Supernova by Andrea J. Loney, in which spacefaring third grader Abby contends with the pressures of keeping up appearances after stumbling into fame on the galaxy’s biggest social media app; How Not to Lose a Million Dollars by Sheila Bair, offering financial advice for a middle grade audience; and It Started with a Book Ban by Linda Ravin Lodding, about a small town turned upside down after a book ban leads to comically escalating limits on what people can do and say.\nWORKMAN/WORKMAN KIDS\nWorkman Kids soars into spring with World Without Birds by Nick Lund, which examines the many factors contributing to this loss and what our planet would look like in birds’ absence; Be Yourself and Other Bad Advice by Meredith Walker, offering readers a guide to finding and developing their authentic self; and FlipFlap Board Book: Colors, a concept book featuring a double spine that allows readers to flip through it forwards and backwards.",
  "word_count": 24116,
  "scraped_at": "2026-02-14T12:12:38.238019"
}