{
  "article_id": "ea99e339630f",
  "url": "https://www.arsenal.com/news/renee-really-happy-performance",
  "title": "Renée  really happy with the performance  | Interview | News",
  "date": "20251218T013000Z",
  "domain": "arsenal.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "We ended our UEFA Women’s Champions League group phase in style by beating OH Leuven 3-0 away from home on Wednesday.\nOlivia Smith fired us into an early lead before Beth Mead curled in a second. Caitlin Foord forced an own goal in the second half to put us in cruise control.\nSpeaking after the match, Renée Slegers reflected: “Happy with the clean sheet, happy with the three points of course. We kept track of the other games and the standings during the second half. The win was everything we could achieve today, so the three points were most important and we did that. So ended up in fifth place in the table. So we'll see the draw, but really happy with the performance, clean sheet and result.”\nPicking up on the clean sheet, we asked our head coach about the growing confidence Anneke Borbe is displaying on the ball of late.\n“Yeah, I think she started this block, her first game, this block was her first competitive game for Arsenal,” she explained. “But she's done really well, really, really well. We haven't conceded that much this block so far. She's been a confident and calm player on the pitch for us. And I think connected well with the players on the pitch. And that's what we want to be about, be a team and back her and protect her. I think her decision making and passing on the ball was really good today as well.”\nCommenting on the record attendance for women’s football in Belgium, as well as our second biggest away following in the competition after the Champions League finalm Renée added: “Yeah, a special night. So two records, it's us, the standing champions of Europe, playing against a team that's making their debuts. And I think the way they have been performing, it's really impressive. It says everything about how the game is growing. A team from Belgium is doing this and they're also through to the knockout phase. So I think a special moment, a big moment for women's football. But of course it was about the football and I'm happy we took the three points.\n“So now it's about recovery, getting back to London and prepare for the last one, which we look forward to getting started in the League Cup as well.”\nCopyright 2026 The Arsenal Football Club Limited. Permission to use quotations from this article is granted subject to appropriate credit being given to www.arsenal.com as the source.",
  "word_count": 415,
  "scraped_at": "2026-02-14T12:50:33.654173"
}