{
  "article_id": "eab3381d9d7a",
  "url": "https://finance.yahoo.com/news/5-byu-sleeper-players-watch-030000682.html",
  "title": "5 BYU  sleeper  players to watch in 2023",
  "date": "20230526T041500Z",
  "domain": "finance.yahoo.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "5 BYU ‘sleeper’ players to watch in 2023\nIncoming BYU football players such as quarterback Kedon Slovis, running back Aidan Robbins, defensive end Isaiah Bagnah, offensive lineman Caleb Etienne and cornerback Eddie Heckard dominated the headlines as the Cougars wrapped up spring camp, and rightfully so.\n“We have a good team. There is some really hefty competition (still) in a lot of different spots, and so we are looking forward to the season. I think this is a good start for us going into the 2023 season, going into fall camp.” — BYU football coach Kalani Sitake\nThose transfers from the likes of Pitt, Louisville, Boise State, Oklahoma State and Weber State, respectively, will have to be as good as advertised if BYU hopes to contend favorably in its first season in the Big 12 this fall. There is a lot of pressure for them to deliver, especially Slovis, who began his college quarterbacking career at USC.\nDon’t forget, however, that BYU has some outstanding players returning who helped the program go 8-5 last fall and defeat SMU 24-23 in the New Mexico Bowl. Stars like offensive tackle Kingsley Suamataia, defensive end Tyler Batty, safety Micah Harper and tight end Isaac Rex were tabbed by the Deseret News recently as Cougars who could be selected in the NFL draft next April if they put together another outstanding season in 2023.\nAlthough it has been well-documented that BYU needs some significant personnel upgrades to make a dent in the Power Five conference in 2023 and stay competitive against teams on its killer schedule such as Oklahoma, Texas, Arkansas, TCU and Oklahoma State, the cupboard is not bare with the departures of drafted stars Jaren Hall, Puka Nacua and Blake Freeland.\nFar from it.\n“We have a good team,” head coach Kalani Sitake said as spring practices concluded. “There is some really hefty competition (still) in a lot of different spots, and so we are looking forward to the season. I think this is a good start for us going into the 2023 season, going into fall camp.”\nCoaches didn’t stop adding to their roster once spring camp ended, however. In recent weeks they have added Weber State offensive lineman Jake Eichorn, Eastern Michigan receiver Darius Lassiter, Colorado running back Deion Smith, UConn receiver Keelan Marion and Weber State cornerback Kamden Garrett.\nAre they finished?\nProbably, but keep in mind that Sitake and offensive coordinator Aaron Roderick have said the staff will never stop recruiting, never stop looking at the transfer portal, and never turn away a prospect who fits the mission of the school off the field and can be a game-changer on it.\nRelated\n“We just gotta keep getting better every day. We need to keep building our depth, keep recruiting, and just keep getting better in all areas,” said Roderick, who was an assistant at Utah when the Utes entered the Pac-12. “The margin for error is going to be really slim, from my experience in the Pac-12. Every team in the league could beat each other every week, and I think the Big 12 is going to be the same way.\n“The margin between the teams from top to bottom is going to be very thin,” he concluded.\nSo who are some of the guys on the rise in BYU’s program, players who haven’t quite been able to get on the field consistently for one reason or another but are seen by coaches as having good chances to make bigger contributions in 2023 than they did in 2022?\nHere are five players — let’s call them sleepers, for now — who are waiting in the wings, as it were, to become starts in their own right for the Cougars:\nTight end Ethan Erickson\nThe aforementioned Rex is the clearcut starter at tight end for the Cougars in 2023, and for good reason. Even though he was less than 100% last year after sustaining a massive ankle injury in November 2021, Rex caught 22 passes for 320 yards and six touchdowns last year.\nThe three-year starter has 21 TD receptions in his career and has an outside chance to catch Cody Hoffman’s program-record 33 TD catches if he can stay healthy and be as productive as he was in 2020.\nBut Rex had another surgery in the offseason, to clean up some scar tissue and the like, and wasn’t at full strength in spring cap.\nEnter Erickson.\nThe 6-foot-5, 240-pounder from Laie, Hawaii, stands poised to not only back up Rex well, but enter games alongside the senior and give the Cougars quite a one-two punch.\n“I would say I am the No. 2 tight end right now,” Erickson said after spring camp. “It just depends on what play we are running, what kind of scouting report we have. But I feel good about where I am at in the program.”\nErickson caught one pass last season, but it went for a touchdown — a 14-yarder against Utah State. More help is on the way. After spring camp, Roderick was asked which incoming freshman could make an impact in 2023 and he brought up Jackson Bowers, the four-star tight end recruit from Mesa, Arizona.\n“We are going to love having him, and accept him, obviously,” Erickson said of Bowers. “He is going to be one of our boys. … It is hard to learn our offense, coming right out of high school. There is definitely a learning curve. But I hear great things about him. I have seen his great (film) clips. I am excited to have him here.”\nDefensive lineman John Nelson\nLost in the excitement over the additions of Bagnah and his fellow Boise State defensive lineman, Jackson Cravens, is the fact that the Cougars had a fairly decent defensive line last year.\nNelson was a mainstay on that unit, playing in all 13 games and starting 11. The cousin of BYU women’s basketball star Lauren Gustin led the Cougars with three sacks and had 28 tackles, so calling him a “sleeper” is a bit of a stretch.\nBut the 6-4, 275-pounder from Salem Hills High in southern Utah County is a relentless worker and weightlifter, and can’t be counted out, along with another returning interior defensive lineman, Caden Haws.\nNelson is one of the more versatile defenders on that unit, with the ability to play inside or out.\n“I’m excited about his potential and versatility,” new BYU defensive line coach Sione Po’uha said. “Nobody is going to outwork him.”\nReceiver Chase Roberts\nThe drama surrounding receiver Kody Epps’ transfer portal entry, then change of heart and subsequent return to BYU, has overshadowed the fact that the other returning pass-catchers are pretty good, too. Texan Keanu Hill showed late last season that he is capable of being WR1 in Roderick’s offense, and American Fork High product Roberts is seemingly headed toward big things, too, if he can stay healthy.\nRoberts caught 22 passes for 357 yards and three TDs last year. He became the first Cougar freshman since Hoffman in 2010 to post a 100-yard receiving game, notching 122 in the 26-20 double-overtime win over Baylor.\nRelated\nMuch has been made of the Cougars needing receiving help from the transfer portal, but don’t discount the fact that Roberts isn’t going to give up his starting status easily. He’s a grinder who won’t back away from competition.\n“They haven’t lost their edge,” receivers coach Fesi Sitake said in spring camp. “We are down in numbers. We are thin right now. A lot of times in the past, when I have been thin in numbers, you start to feel kind of the stress, the anxiety, kick in. But these guys are optimistic. They are positive.\n“So I just love the overall feel of the group, whether guys are going or not, there is that camaraderie you want.\n“They are being energy givers, not energy takers. Those things we are preaching, they are staying true to that. So I have been really pleased with them.”\nUtility player Hobbs Nyberg\nThe former BYU baseball player hasn’t garnered the headlines that quarterback Hall did after moving from the diamond to the gridiron, but Nyberg has quietly become a mainstay on this team, particularly on special teams with his punt returning skills.\nBut look for the former Dixie High star to take on a bigger role in the offense in 2023, along with fellow kick returner Talmage Gunther. With the aforementioned Epps not competing in spring workouts, Gunther and Nyberg showed they have good hands, know the offense, and run outstanding routes. Fesi Sitake noticed, and so did Roderick.\n“Hobbs Nyberg and Talmage Gunther are both reliable guys that you can count on,” Roderick said. “I wouldn’t be surprised if you see those guys play some this year.”\nCornerback Jakob Robinson\nCalling the Utah State transfer who played in all 13 games in 2022 and started in five a sleeper is also a stretch, until one considers that the junior probably hasn’t received the credit he deserves, to date.\nRobinson, who prepped at Orem High, not only made the game-saving tackle in last year’s New Mexico Bowl, he recorded 51 tackles and five pass breakups in 2022.\nBYU is losing some good corners in Kaleb Hayes and D’Angelo Mandell, but new defensive coordinator Jay Hill has said Robinson provides a good base to work around as he’s brought in the Weber State transfers to compete for playing time.\nOn the tackle of SMU’s Tanner Mordecai that sealed BYU’s bowl win, Robinson said: “Just if it pops up on my phone or whatever, I will watch it. My dad probably watches it more than I do.”",
  "word_count": 1612,
  "scraped_at": "2026-02-14T13:09:08.628331"
}