{
  "article_id": "eabedd288a53",
  "url": "https://www.bbc.co.uk/news/articles/cpde53lxly5o",
  "title": "Wales rugby fan faces 54 - mile run after England win",
  "date": "20250317T111500Z",
  "domain": "bbc.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Wales fan faces 54-mile run after record England win\n- Published\nA rugby fan who vowed to run a mile for every point Wales lost by during the Six Nations tournament is facing a 54-mile run after their thrashing by England.\nRhodri Williams said he was \"counting those miles increasing and increasing\" as he watched the game unfold on Saturday.\nEngland racked up a record Six Nations win over Wales with a 68-14 victory in Cardiff during Wales' final game of the tournament.\n\"I wasn't feeling too good yesterday morning,\" he told BBC Radio Wales Breakfast on Monday.\nWhere can Welsh rugby possibly go from here?\n- Published16 March 2025\nWilliam and Kate cheer on rival teams as England beat Wales\n- Published15 March 2025\nWales fan wins Parkrun in Rome before rugby defeat\n- Published10 February 2025\nThe Bristol-based video content producer, whose family is from Cardiff, is raising money for rugby mental health charity LooseHeadz to help tackle the stigma around mental health.\n\"So far it's been amazing,\" he said, adding he has so far raised over £2,000.\nWales lost by six points to Scotland, seven points in Italy and nine points to Ireland, but suffered heavy losses against France and England, conceding 43 and 54 points in those matches respectively.\n\"I would have liked to have spread the pain over the games,\" Rhodri said. \"I thought it would be more even.\"\nSaturday's defeat brought his total number of miles to run up to 119.\nCovering 43 miles after Wales' defeat at the Stade de France was a challenge, Rhodri told BBC Wales last month, setting out at 06.30 GMT and not returning until 17.00.\nHe will complete the final 54 miles to account for the loss to England in stages, he said.\n\"It's finding the time to run for that long,\" he said. \"I'm going to do it, I think, in four half marathons.\"\nHe is considering a similar challenge for the women's rugby World Cup, he said, but won't do miles per point again.\n\"I think I've learnt my lesson,\" he said.",
  "word_count": 346,
  "scraped_at": "2026-02-14T12:34:58.063787"
}