{
  "article_id": "eac258b16d9f",
  "url": "https://www.thecable.ng/the-labour-of-our-heroes-past",
  "title": "The labour of our heroes past",
  "date": "20240107T020000Z",
  "domain": "thecable.ng",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "On the day Nigeria played Italy at the 1994 FIFA World Cup in the United States, I was inside a public bus. When I left our office in Ajao Estate, Lagos state, for a Bible study meeting in my church at Surulere, the Super Eagles were leading 1-0 via an early goal by Emmanuel Amuneke (whose name was wrongly spelt as “Amunike” by the wonderful football authorities and had to live with it for the rest of his career). On the yellow bus ride between Ojuelegba and Masha, a passenger announced that Italy had beaten Nigeria 2-1. I did not want to believe him, so I did not believe him. Another passenger said it was not true, that it was still 1-1 and that the match had gone into extra time.\nThere were no mobile phones, no internet, no Livescore to follow the scores. Still, I was too emotionally invested to believe we had been defeated. I was praying that Nigeria would go all the way to the final. Reckless optimism. The optimistic passenger insisted that the match had not ended and we had not lost. Then he introduced himself. “My name is Baba Otu Mohammed. I once played for Nigeria,” he said. The name didn’t ring a bell to others. I was the only one who picked it. Immediately, I said to him: “You played for Nigeria at the 1976 and 1978 Africa Cup of Nations.” I could feel his sense of pride. The sensational dribbler was in the team of the tournament in 1976.\nThis encounter replayed on my mind on Wednesday when Sebastian Brodericks-Imasuen, also known as “Sabara”, died. He had reportedly been bed-ridden for a while, suffering from stroke and diabetes. My first shock was that his name didn’t ring a bell to many young football fans. To be sure, I was a kid when Mohammed represented Nigeria at the Africa Cup of Nations in the 1970s and I never watched him play. But I still knew of him. I know of many great athletes who represented Nigeria before I was born. You cannot say Emmanuel Ifeajuna or Hogan “Kid” Bassey and it would not ring a bell to me. This is not about history being taught in schools but knowing and appreciating our sporting heroes.\nLet me tell you a bit about Brodericks-Imasuen. On August 11, 1985, a group of Nigerian teenagers, captained by Nduka Ugbade, stunned the world by beating the highly favoured West Germany 2-0 to win the inaugural FIFA Under-16 World Championship. Jonathan Akpoborire scored as early as the fourth minute and Victor Igbinoba scored a TV goal one minute to the end of the match to send Nigerians absolutely crazy. It was incredible. Going to the tournament unknown and unrated, the Baby Eagles of Nigeria, as they were called before they were renamed Golden Eaglets, instantly put the country on the world map. Nigeria became the first African country to win a FIFA competition.\nAdvertisement\nJust as Afrobeats has put Nigeria on the global entertainment map, Nigeria’s victory at China ’85 paved the way for our football to start gaining recognition beyond Africa. But this feat was not masterminded by a foreign coach, unlike when we won the Africa Cup of Nations in 1980 under the tutelage of Otto Glória, the Brazilian tactician. This time, it was a Nigerian that did it. Yes, Sebastian Brodericks. It was not a fluke: he took us to the final again two years later but lost to the USSR on penalties after a last-minute goal-bound move by Dimeji Lawal was halted by the referee, José Wright from Brazil, because of a foul on the winger. Wright curiously refused to give the advantage.\nLet me put it plainly: Brodericks-Imasuen was the first Nigerian and the first African and the first black coach to win a world football championship. Should I say that again? On arrival in Nigeria after the glorious run, the team was received by Maj Gen Muhammadu Buhari, then military head of state, and Maj Gen Tunde Idiagbon, his deputy. Buhari declared them as heroes and national assets, promised them scholarships and named streets after them in their state capitals. There were no lavish cash gifts, as we do today, but the pride of patriotism and achievement was written all over the boys and their coaches. More teenagers aspired to play football and represent their fatherland.\nWith Brodericks-Imasuen’s historic feat, you would naturally assume that he had secured a place in our annals and would be treated as a national treasure for life. You would never predict that a day would come when his family would be begging “kind-hearted Nigerians” to assist in offsetting his medical bills and helping him get better treatment. He died at 85. We cannot say he died young. But he died miserably — from the picture of him on hospital bed that I saw on social media. I also read where his son, Chuka, was practically begging: “We would like to say a big thank you to one of his former players, Kayode Keshinro, for his support. We hope others can lend their support to us.”\nAdvertisement\nThe mainstream media did not treat Brodericks-Imasuen much better either. Reports of his death did not get considerable inches or front-page treatment in the newspapers. A line in our national anthem says: “The labour of our heroes past shall never be in vain…” Whoever wrote that line definitely had noble intentions about the beauty of remembering our history and honouring the memory of those who contributed their decent quotas to national development in different spheres of life. Maybe it is just not in our culture as a people to remember our history and honour our heroes. Perhaps, we are too occupied with today to remember the labour of our heroes past. We live for here and now.\nA while ago, I was discussing with my pal, Calvin Emeka Onwuka, on the worrisome amnesia in the football arena. We pay little or no attention to our past heroes. In recent times, Emeka has probably done more than any other Nigerian in the visual promotion of our football history through the social media and his website, ACLSports. He catches up with our “heroes past” and interviews them, reliving the days that served as part of the building blocks of our sporting sector. He has a golden throve of footages of matches played decades ago. It is not surprising that he is not getting the kind of corporate support that he needs: I think most of us are not really interested in our own history.\nFor instance, how on earth will the birthday or death anniversary of Stephen Keshi not be a significant day on the Nigerian football calendar? I challenge anybody to name one Nigerian sportsperson who did more for our football than Keshi. After being banned — along with Henry Nwosu, Clement Temile, Bright Omokaro and Sunday Eboigbe — by the football authorities in 1985 for failing to report for national duty within deadline, Keshi left for Stade d’Abidjan, Cote d’Ivoire, to ply his trade. He won trophies there before heading for Belgium, where he opened the floodgate for other Nigerian and African players, practically involved in getting them into European clubs.\nNigeria’s qualification for its first FIFA World Cup in 1994 was largely a product of the sojourn of our footballers in Europe — inspired in no little way by Keshi. It was not just that our footballers became multi-millionaires but their technical capabilities and exposure did Nigerian football a world of good. It was Keshi that opened that door. He was a mentor, offering shelter and financial support to upcoming players. He was kind-hearted and open-handed. When Osaro Obobaifo, a gifted midfielder, died in a road accident in Belgium in 1991, it was Keshi that paid the fine for the damage caused to public property by the crash and got his body repatriated to Nigeria. He footed the funeral costs.\nAdvertisement\nKeshi was a leader. The late coach Paul Hamilton, another forgotten hero, said sometime in 1987 that anytime Keshi reported for national assignments, he always made things easy for the coaches. As a player, he would join the coaches to lead training sessions even without having a coaching badge. Hamilton said he usually concentrated his energy on tactical sessions since Keshi had made things easier for him. When the authorities forgot to bring Super Eagles’ kits to the stadium for a crucial match against Burkina Faso in 1991, players lamented that it would not have happened if “Skippo” was around. He always checked before every match to be sure everything was in place. Leadership.\nIn 2013, Keshi, after coaching a couple of foreign national teams, led Nigeria to win the Africa Cup of Nations in South Africa — the first by a Nigerian coach. He had won Africa’s most-coveted trophy as a player in 1994 in Tunisia. Only two Africans have ever achieved that feat — the other being Egypt’s Mahmoud El-Gohary, who won as a player in 1959 and coach in 1998. Sadly, since the sudden death of Keshi aged 54 in 2016, I don’t think the football authorities have done anything worthwhile to commemorate his unrivalled service to fatherland. It is not out of place to immortalise this modern hero. Instructively, he was honoured by Google with a doodle on his post-humous 56th birthday.\nIf we do not give Keshi the honour due him, is it Sam Okwaraji who died ages ago that we would give his place in our football annals? Okwaraji died while playing for Nigeria on August 12, 1989. The authorities promised to retire the No. 6 jersey in his honour. They reneged as soon as they could. One of the most patriotic Nigerian sportsmen ever, Okwaraji would pay for his own tickets to honour invitations to the national team and would not even bother to demand a refund. All he wanted to do was serve his fatherland. He played out his heart every single time he had the opportunity and paid the ultimate price in the ill-fated match against Angola at the National Stadium, Surulere, Lagos state.\nLet me now stop lamenting. In the words of Olusegun Adeniyi, the distinguished THISDAY columnist, we need to move from the Lamentations of Jeremiah to sing the Songs of Solomon. Brodericks-Imasuen’s death should set us thinking on two fronts. One, how can the sporting authorities make sure that those who served their fatherland are not neglected and turned to beggars in old age? Do we need a special trust fund for them? Two, how do we make sure that the labour of our heroes past is not, indeed, in vain? Can the authorities please come up with creative ideas to keep them alive in our memories? Addressing these two issues should not require rocket science, or should it?\nAdvertisement\nOn a final note, I find it befuddling that President Bola Tinubu’s handlers did not deem it fit to issue a statement on the death of Brodericks-Imasuen. For a team that eagerly issues statements to celebrate the 46th birthday or chieftaincy title of somebody, it would not be too much to say a word or two on Brodericks-Imasuen. The sports ministry too does not consider it to be a big deal. But it is not too late: the federal government can still afford to meaningfully recognise or immortalise the departed coach and others before him. Those who choose to serve Nigeria “with heart and might” should know that, in life and in death, their service is not in vain. Pray, is that too much to ask?\nAND FOUR OTHER THINGS…\n‘I AM A SOLDIER’\nAdvertisement\nOn Tuesday, Lagos Governor Babajide Sanwo-Olu ordered the arrest of a soldier who was riding against traffic on the Lagos-Badagry Expressway. The culprit was genuinely surprised because he obviously believed that as a soldier, he was above the law. Generally, members of the security agencies appear to think that the laws don’t apply to them. Many drive against traffic, go above speed limits and park at No Parking spots. Some ride motorbikes without wearing a helmet. They hardly stop at traffic lights. It may take centuries to make them accept they are not above the law but it is, all the same, worth the trouble to take them through a complete re-orientation. Civilisation.\nRIDE ROUGHSHOD\nAdvertisement\nWhen President Bola Tinubu declared “transportation subsidy” during the Yuletide — offering passengers 50 percent discount on designated routes and rides across the country — I was expecting that the usual greedy human behaviour would kick in. Human beings would game anything and take advantage of the best of intensions. As it turned out, some officials of the national railway company block-booked seats and started selling to passengers at a premium. There was a similar experience with some inter-state buses. The heart of man is desperately wicked. The default instinct of many people is how to cheat and make greedy gain. We are a religious but godless people. Shameful.\nBUDGET BAZAAR\nAdvertisement\nThe details of the budgets of federal “super agencies” (remember we hardly bother ourselves with the states) are now being made public after years of agitation by transparency campaigners and public affairs commentators. I think we need to acknowledge this development. It is a positive one and a win for the campaign for accountability. Sorry to say, but the details are depressing in many instances. I saw a budget of over N2 billion for the purchase of empowerment freezers for women. One agency budgeted N11 billion for long service awards. The bazaar has always been there just that the details were never made public before. We know how to burn money in this country. Wow!\nNO COMMENT\nAs the 34th Africa Cup of Nations kicks off in Cote d’Ivoire next week, there is still no certainty over how Nigerians will watch the games. New World TV, a Togolese broadcaster, surprisingly won the broadcast rights, edging out giants such as beIN, Canal+ and Supersport. It should be good news that another African broadcaster is on board, but New World is so new to the world it barely has a presence even in Francophone African countries where it targets. There are unrefuted reports that Dr Patrice Motsepe, president of the African Football Confederation (CAF), owns Sanlam, the company that guaranteed New World TV’s loan used to pay for the broadcast rights. Africa!",
  "word_count": 2405,
  "scraped_at": "2026-02-14T12:07:57.842455"
}