{
  "article_id": "eacc8763c3cd",
  "url": "https://www.dailymail.co.uk/news/article-12192033/Families-19-year-old-Nottingham-students-killed-knife-rampage-bits.html",
  "title": "Families of 19 - year - old Nottingham students killed in knife rampage are  in bits  ",
  "date": "20230614T013000Z",
  "domain": "dailymail.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Families of 19-year-old Nottingham students killed in knife rampage are 'in bits' says one's grandfather - as friends and teammates of the sport-loving pair pay tribute: Suspect, 31, is a 'West African migrant with history of mental health issues'\nThe family of a 19-year-old university student stabbed to death in the early hours of Tuesday morning in Nottingham are 'in bits' after the sportsman was killed in a rampage across the city alongside a fellow student and England hockey star.\nSpeaking outside the family home in Somerset last night, Barnaby Webber's maternal grandparents Phil and Jenny Robson, who travelled up from their home outside Exeter, Devon, said: 'We are still unsure what has gone on at the moment.\n'Barnaby's parents are in bits as you can imagine but they are with officers from Nottinghamshire Police as we speak.\n'We've been told not to make any comment until we know more. Perhaps in a day or two we can say more but at the moment we are not allowed.'\nBarnaby's grief-stricken father, David, 51, said only that it 'wasn't a good time' when approached at the family home, before other relatives arrived with flowers.\nIt is believed Mr Webber, director of an IT consultancy, called one of his son's flatmates in Nottingham to inform the fellow students of the tragedy.\nHe was killed alongside England's under-18s hockey star Grace Kumar, also 19, just five minutes' walk from home in Ilkeston Road, after a night out at around 4am.\nTributes to the 19-year-old university freshers have begun pouring in, with one friend saying Barnaby would 'always be loved'.\nIt comes after police arrested a 31-year-old man on suspicion of murder after three people died and a further three were injured in a knife and van attack in the early hours of the morning. It is understood the suspect has a history of mental health issues.\nPolice believe the attacker killed the third victim, a man believed to be 54, before stealing his van and using it to run into three other people. One man remains in a critical condition in hospital.\nGrace Kumar, 19, was one of two University of Nottingham students who was stabbed to death while walking home after a night out at 4am on Tuesday\nBarnaby Webber, a university student, was killed in the attacks early on Tuesday morning\nGrace Kumar, 19 was a rising star in the hockey world, who played for England's U16s and U18s\nNottingham was locked down following the terrifying sequence of events\nHockey player Grace has been a star for England's young hockey programme having been selected on a national level for both the under-16s and under-18s squads.\nShe attended Bancroft's independent school, which is flying its flag at half mast following the tragic incident, and was England's top goal scorer in her age category for the 2018-19 season, newsletters from the school show.\nAt university she continued pursuing the sport, helping the Surbiton ladies' first team to victories in top UK leagues, and was also described as a talented cricket player.\nGrace's family today released a tribute to MailOnline hailing her as a 'truly wonderful and beautiful young lady'.\nHer father is believed to be hero doctor Dr Sanjoy Kumar, who previously saved the lives of three teenagers who were stabbed in a gang attack near his surgery in 2009, The Sun reports.\nHe helped move the 15. 16. and 17 year old teens to a makeshift trauma room, before emergency services arrived.\nFormer England cricket captain Michael Vaughan paid tribute to Mr Webber, describing him as a 'young cricketer gone far too soon'.\nThe cricketer and rugby player attended the £7,890-a-term Taunton school in his home town in Somerset, where family were gathering to comfort each other on Tuesday.\nOne friend of Mr Webber paid tribute to him on Instagram alongside a black and white image. She wrote: 'RIP Barney. You are always loved and got a special place in my heart xx'.\nA second said: 'You were the light to all my darkness and helped put a smile on my face when no one else could, there are no words for what has happened to you and how much you will be missed.\n'I'm so glad we got to spend the last few hours of your life together and share one more last dance and laugh which will forever be in my heart and never forgotten.\n'You had the purest heart of them all. I will be lost without you and always have a gap in my heart.\n'This still feels like a lie and I'll forever be waiting for u to walk thru [sic] that door. All your friends and family adored you and we're all so grateful to have experienced having you in our life.'\nBarnaby was walking home with Grace, who was also stabbed to death at the scene, after a night out\nGrace pictured playing hockey while representing England's youth teams\nFormer England cricket captain Michael Vaughan paid tribute to Mr Webber, describing him as a 'young cricketer gone far too soon'\nGrace, a high-flying hockey player, is understood to be from north-east London\nFriends of Barnaby Webber posted emotional tributes to him online in the hours after his death\nAnother student told the Times: 'My friend was his flatmate. They were pretty close, they were more like family.\n'She told me about Barney this morning. She went home after hearing the news. It's hit her hard.'\nA young woman from the same halls of residence said: 'Barnaby was a friend of mine. He was just walking home from a club like we all do they just got unlucky. They were five minutes from home and stabbed by some random guy.'\nBarnaby had travelled home from Nottingham only last month to play cricket for a local club, Bishops Hull. He had also turned out for them in an indoor league and was named man of the match in his most recent game on 4 June.\nTaunton School newsletters report he was a talented hockey player. He previously celebrated winning the under-14s county championships in 2018, The Sun reports.\nThe 19-year-old, who also played cricket for Nottingham University, was previously selected by Taunton School in 2020 to feature in ITV West Country's coverage of the region's GCSE results.\nBishops Hull Cricket Club, where Barnaby played, released a statement on Tuesday night which read: 'Today we learnt of the death of our dear friend and team mate, Barnaby Webber.\n'Barney was attacked at the early hours of this morning walking home with a friend after a night out on 13/06/2023 and had [sic] lost his life.\n'Webbs' joined the club back in 2021 and has since then been a key part of our club and made such an impact in such a short space of time. Playing more than 30 games for the club, scoring 622 runs, and taking 29 wickets, his memory will live on.\n'As a club we would like to invite family, friends, club members and members of the village and public who wish to pay their respects and lay some flowers at the club. TA1 5EB.'\nA teammate, Jack Wall, added: 'Rest in Peace Barney Boy. Absolutely gutted that you have been taken away so young. It's been a pleasure sharing the wicket with you for Bishops Hull Cricket Club. You will never be forgotten mate.'\nA second, Dan Chanter, posted a picture of cricket stumps accompanied by a photo of Barnaby and wrote: 'I really can't believe what has happened today, we had so many good laughs on and off the field!! You'll be deeply missed but never forgotten…RIP Barnaby.'\nCaroline Tucker of the Old Tauntonians, a group for former Taunton School pupils, wrote on Facebook: 'Today Taunton School lost one of its newest Alumni.\n'Barnaby Webber was in Marshall (one of the school's houses) aged 19, at university, and was killed in the Nottingham attacks last night.\n'A wonderful young man with so much to look forward to. Our boys will miss you Barney, we live in an unkind world.'\nThe suspect arrested by police is understood to be a 31-year-old West African national who has been living legally in the UK since his teenage years, and who has struggled with mental health issues.\nThe investigation into the rampage is understood to be turning away from it being terror-related, instead focussing on the suspect's mental state.\nThe man, who is being questioned over three deaths and the injuring of three others, is understood to have no previous criminal history but was known to police.\nThe talented sportsman (right) was killed on his way home from a night out in the city\nBarnaby (right) had travelled home from Nottingham only last month to play cricket for a local club, Bishops Hull\nStudents attend a vigil in Nottingham for the two 19-year-olds and man in his 50s who were killed on Tuesday\nA vigil at Nottingham's St Peter's Church, in the city centre, was attended by hundreds of people paying their respects to those who died and those injured\nMany of the young people at a vigil for those caught up and killed in the attacks were emotional at St Peter's church in Nottingham on Tuesday evening\nBishop Hull Cricket Club released a photograph of Barnaby (circled) saying 'his memory will live on'\nBritish tennis player Andy Murray paid tribute to those who had been caught up in the rampage at the Rothesay Nottingham Open, describing the 'heartbreaking' situation in the city centre.\nMurray, who ate out in Nottingham city centre not far from where the attacks happened, said the incident was 'way more important than tennis'.\nHe said: 'It was obviously shocking when I woke up this morning and when I was going down to breakfast a few messages on our team chat came up.\n'We are staying in the city centre and had been out for dinner last night and walking around those areas. You never expect something like that to happen, it was really shocking.\n'I didn't know if it was going to affect anything here or not because the streets were closed this morning. Really shocking and obviously heartbreaking for the victims and the people involved so hopefully everyone is safe now.\n'We were talking about it this morning, saying that we didn't know if the tournament was going to be suspended for the day because there are way more important things than a tennis event, and we didn't know the first thing about what was going on because it happened in the middle of the night.\n'It is a bit unsettling, it seems like everything is under control now but it was shocking news to wake up to.'\nTournament organisers confirmed there will be a minute's silence in memory of the three victims ahead of play today (Wednesday).\nThe three victims are believed to have been randomly attacked and stabbed to death by a knifeman dressed in black and wearing a rucksack.\nA student at Nottingham Trent University told The Sun that Branaby 'must have been walking back from Pryzm,' a nightclub in Nottingham city centre.\n'It was the final day for everyone,' the student said. 'There was an all-day festival at Binks Yard then everyone went to Pryzm. It always seems safe walking here because there are so many students.'\nCounter terror police have raided two properties in Nottingham, with officers saying they are keeping an 'open mind' over the attacker's motive.\nOne raid took place this afternoon around Ilkeston Road in a student area of the city, where police were called to just after 4am to reports that a young man and woman had knife injuries and were 'unresponsive'.\nAfter the first attack, a third body was found on Magdala Street at around 5.30am, which was an unnamed man in his 50s, police have confirmed.\nIn a press conference on Monday evening, a spokesperson said the force's current hypothesis is that the 31-year-old man killed the man in his 50s, before stealing his van and ramming into three other members of the public nearby.\n'We had a further call to another incident in Milton Street, where the driver of a stolen van had attempted to run over three people. As a result, one man is in hospital in a critical condition while two others are believed to have suffered minor injuries.\n'The van was then stopped on Maple Street, where a man was tasered and detained by police officers on suspicion of murder. A man in his 50s was also found dead from knife injuries in Magdala Road by a member of the public.\n'At the moment, we believe that the suspect has stolen this man's vehicle and driven it to Milton Street, where he is then driven at members of the public.\n'We are still in the early stages of the investigation. I need to determine exactly what the motives were behind this attack.'\nNottinghamshire Police said they are now working alongside counter-terror colleagues to 'establish the facts' and determine the motive for the attack. They do not believe anyone else was involved.\nAll the victims' families have been informed and they are being supported by specialist officers.\nChief Constable Meynell added: 'I want to thank those who live and work in our city for their patience and understanding in incredibly difficult circumstances. We will, of course, keep the public updated as soon as we are able to say anything further.\n'This is a very sad day for our city and we will do everything possible for the victims and their families.'\nHundreds of young people were among those to pay their respects, many of whom were emotional\nPeople comfort one another in Nottingham after the death of Barnaby Webber, a 19-year-old woman and a man in his 50s\nCandles are lit and flowers laid at St Peters' Church in memory of the victims of the attacks\nMany of those who attended Tuesday's vigil were students at the universities of Nottingham and Nottingham Trent\nNottinghamshire Police Chief Constable Kate Meynell speaking to the media outside Central Police Station in Nottingham on Monday evening\nForensic officers work at the scene of a white van following the attacks on Tuesday\nA specialist Counter Terrorist Specialist Firearms Officer on patrol on Ilkeston Road in Nottingham on Tuesday\nPolice were called to the final incident on Milton Street at around 5.30am on Tuesday, where a van ran into three people who are now being treated in hospital. The man was arrested after being tasered at 5.40am.\nOne man is in a critical condition, while two other people received minor injuries. They are believed to have been waiting for a bus at the time.\nNottinghamshire Police Chief Constable Kate Meynell, speaking outside a police station in the city, said: 'Police were called to Ilkeston Road just after 4am after a member of the public reported that two people aged 19 had been stabbed and were unresponsive.\nThe Home Secretary also expressed shock at the attack in Nottingham. Suella Braverman said: 'First of all, I want to say how shocked and saddened I am that three people have lost their lives earlier today in Nottingham and that further individuals have been injured in this tragic incident.\n'My thoughts first and foremost are with all of those who have been involved, their friends, their families and their communities.\n'I want to thank the emergency services for their rapid response. They're working around the clock to keep people safe and we're incredibly grateful for their efforts.'\nShe added: 'I'm in regular contact with the Chief Constable of Nottinghamshire Police, but I want to take this opportunity to urge anybody who has any information about this incident to come forward and report it to the police.\n'It's right that Nottinghamshire Police are working with Counter Terrorism Policing. But it's also fair to say that everybody and all professionals on the front line are keeping an open mind as to what the precise motive might have been.'\nYesterday the University of Nottingham confirmed two of the dead were students and that a graduation ball scheduled for Tuesday night would be cancelled.\n'It is with great sadness that we confirm the sudden and unexpected death of two of our students following a major incident in Nottingham city centre overnight,' a spokesman said.\n'We are shocked and devastated by the news and our thoughts are with those affected, their families and friends.\n'We know this is likely to cause distress for staff and students in our community. Support is available through our support and wellbeing services for any of our community who may need it.'\nA vigil at Nottingham's St Peter's Church, in the city centre, was attended by hundreds of people paying their respects to those who died and those injured.\nDuring the service, attended by mainly young people of university age, those present were invited to place flowers below the altar or light a candle.\nThe Bishop of Southwell and Nottingham, the Rt Revd Paul Williams, said the impromptu service was an opportunity to 'pray for those whose lives have so cruelly taken away'.\nThe bishop also said the city was 'in collective shock and disbelief.'\nThose attending the vigil included students from the University of Nottingham and Nottingham Trent University.\nSpeaking outside the church, a second-year student at the University of Nottingham said: 'We live fairly close to where, unfortunately, [the two students] were found, so it has properly shook up a lot of people.\n'It's really scary. It's so horrible that this has happened.'\nLabour MP for Nottingham East Nadia Whittome said: 'Our whole city is shaken and completely devastated by this.\n'Nothing like this has happened in Nottingham in my lifetime.\n'But I know that the city already has come together. We've all just come back from the vigil which was particularly attended by a lot of young people who are paying respects to their classmates and their families who have been killed today and I know that that will continue over the coming days and weeks.'\nShe encouraged people affected to access support available through the University (of Nottingham) wellbeing services and Nottingham Victim Care.\nMeanwhile Education Secretary Gillian Keegan said: 'My thoughts and prayers are with the City of Nottingham following the devastating news that three people have lost their lives, including two students from @UniofNottingham.\n'Support is available for students and staff and my Department stands ready to assist in any way we can.'\nForensic officers carry away evidence from one scene of investigation on Tuesday in Nottingham\nA phone confiscated by a search team is sealed in an evidence bag and carried away for examination\nCounter terror police have raided two properties in Nottingham with cops saying they are keeping an 'open mind' over the motive for the attack\nOfficers are seen pinning a man down on a pavement in Nottingham on Tuesday. Three people have been killed in the city, police said\nArmed police on patrol in Nottingham city centre in the hours after the attacks\nChief Constable Meynell said earlier on Tuesday: 'This is a tragic series of events which has led to the lives of three innocent people being taken and left another member of the public in a critical condition in hospital.\n'My thoughts are with all the families affected by this shocking incident, and we will be working extremely hard to understand exactly what has happened.\n'We are at the early stages of the investigation and need to determine the motives behind these attacks and will keep the public updated as soon as we are able to say more.\n'We are keeping an open mind as we investigate the circumstances surrounding these incidents and are working alongside Counter Terrorism Policing to establish the facts - as we would normally do in these types of circumstances.\n'We do have a man in custody who has been arrested on suspicion of murder. Currently, we do not believe there is anyone else involved in this incident.\n'It is safe to go into the city centre but there are a number of streets that will remain closed including Ilkeston Road, Magdala Street, Milton Street and Maple Street. This is so officers can gather evidence in order to understand what has happened.'\nWitness Lynn Haggitt described seeing a man in a white van at around 5.30am on Milton Street near the Theatre Royal. She said the man looked in his mirror and saw a police car behind him, before 'quickening up' and slamming into two people.\nAt 5.40am on Bentinck Road, witness Kane Brady told GB News he was woken by 'what sounded like gunshots' and saw a person tasered, dragged out of a van and arrested.\nA 31-year-old man was arrested on Bentinck Road on suspicion of murder and officers are linking the three deaths.\nDelivery driver Miklos Toldi, 37, and his wife Petra found the body of the older man as they headed to work in their car at around 5.30am. 'The blood looked as if it was fresh,' he said - adding that the victim had been stabbed.\nMohammed Qasim and Nisar Ahmed, who work at Xclusive Hair Studio next door to one of the properties on Ilkeston Road that was raided yesterday, said police also broke into the property last year.\nMr Qasim added: 'A for sale sign has been up for about two to three months. We haven't seen anyone since.'\nMeanwhile, two female university students in another property that was raided on Ilkeston Road said officers repeatedly asked them if they knew a black man who lived at the address, the Telegraph reports.\nAround 20 police officers - some armed with rifles - battered down the door and questioned Bella Crawshaw and her housemate Liv.\nMiss Crawshaw, a 20-year-old computer sciences student, said she was asked by officers if she knew of a black man who lived at the address or if she 'hung out with one'.\nThe women were later released.\nNottingham city centre remained locked down Tuesday afternoon, with dozens of squad cars, fire engines and ambulances on the scene.\nPolice cordoned off around 400 yards of the scene at Ilkeston Road with tape, and what appeared to be medical kit was scattered across the road.\nTwo forensic officers arrived and appeared to dedicate the majority of their time to a bathroom and plumbing business.\nThe area around a white Vauxhall Vivaro van in Bentinck Road was also cordoned off.\nThe van was left short distance from the pavement with its passenger door open and what looks like a black bag on the road near the door.\nA witness told the BBC he saw a young man and young woman being stabbed on Ilkeston Road, close to the junction with Bright Street in Nottingham, at around 4am.\nThe man, who did not give his name, said he heard 'awful, blood-curdling screams' and looked out his window to see a 'black guy dressed all in black with a hood and rucksack grappling with some people'.\nHe told the broadcaster: 'She was screaming 'Help!' I just wish I'd shouted something out of the window to unnerve the assailant.\n'I saw him stab the lad first and then the woman. It was repeated stabbing - four or five times. The lad collapsed in the middle of the road.\n'The girl stumbled towards a house and didn't move.\n'The next minute she had disappeared down the side of a house, and that's where they found her. I'd say it all happened within five or six minutes.\n'The attacker then just walked off up Ilkeston Road towards town, as calm as anything.'\nThe man said he called the police who arrived within five minutes, before paramedics tried to revive the pair for 40 minutes.\nWitness Lynn Haggitt told Channel 4 News she saw a van hitting two people on Milton Street near the Theatre Royal at around 5.30am.\n'At half past five I saw a van pull up at the side of me,' she said. 'It was white, all white. There was a police car behind it coming up slowly, no flashing lights.\n'The man in the driver's seat looked in his mirror and saw the police car behind him.'\nA photo of a Vauxhall Vivaro van on Bentinck Road in Nottingham on Tuesday. There are dents in the bonnet and cracks in the windscreen\nA police forensic officer takes a photo of the scene on Magdala Road, where a man was found dead\nA cordon surrounded the Vauxhall Vivaro van in Bentinck Road, Nottingham. A rucksack can be seen on the tarmac by the open door\nThe van was left a short distance from the pavement with its passenger door open and what looks like a black bag on the road near the door\nViewed from the other side of the cordon, the van in Bentinck Road has clear damage to its bonnet and windscreen. There are two dents on the bonnet, just above the radiator grille, and two sets of corresponding cracks radiating out from two points on the windscreen\nShe said the white van then drove up to 'the corner of the street and went into two people'.\n'The lady ended up on the curb, and then he backed up the white van and he went, speeded up Parliament Street with the police cars following him,' Ms Haggitt added.\nWhen asked if she thought the collision was deliberate, Ms Haggitt said: 'I don't think I should say that, but to me he went straight into them, he didn't even bother to turn, just went back straight into them.'\nWhen asked if the people hit were hurt badly, she said that a man appeared to have a head injury.\n'They did get him to his feet,' she added, but said of the woman who was hit: 'She was sitting up on the curb, to me she looked OK'.\n'I was there for 15 minutes and there was no ambulance. One of the policemen, I think, did first aid. He looked after a man on the floor.'\nMs Haggitt told BBC News she spotted the van while she was on her way to work.\n'He looked in his mirror, saw a police car behind him, he then quickened up, there were two people, two in the corner, he went straight into these two people.'\n'The woman went on the kerb, the man went up in the air, there was such a bang, I wish I never saw it, it's really shaken me up. I went over, perhaps I shouldn't have gone over but I wanted to see if I could help.\n'The woman was sitting up on the kerb, she looked OK. The man was laying down, but then he got up, sat on the side waiting for an ambulance. I can't believe he was able to get up after the head wound.'\nOfficers were called to Ilkeston Road west of the city centre just after 4am. Two people were found dead in the street\nA forensic tent on Magdala Road, Nottingham, where a man was found dead\nPolice forensics officers on Ilkeston Road as investigations continued\nPolice forensics officers on Ilkeston Road, where they appeared to be analysing evidence left on the ground\nThe officers seen photographing evidence on a road in Nottingham city centre\nA forensics officer placing items into a sealable bag in Nottingham\nAnother witness told Sky News she saw a man and woman hit by a van.\nFrances, whose surname was not given, was on her way to work and was near Theatre Royal in the city centre when she saw the vehicle hit the two pedestrians.\nShe said: 'There was a male and a female. The female, she could speak.\n'She was in pain from the impact from hitting the ground. She had hit her head but was still able to speak.\n'Then the gentleman as well took the full brunt of the van and he had head injuries but was still awake.\n'He didn't lose consciousness, he was still awake at that stage.'\nA witness on Bentinck Road told GB News he heard what sounded like gunshots before seeing armed police arresting a man after pulling him from a white van at around 5.30am.\nThe man was wearing a hat and the witness, who did not want to be named, could not see his face.\nPolice cordoned off around 400 yards of the scene at Ilkeston Road with tape, and what appeared to be medical kit was scattered across the road\nThe forensic officers eventually left the scene on foot with a black crate and large plastic bag\n'We woke up this morning at about 5.30 in the morning to what sounded like gunshots and went to a window and there was armed police running out of what looked like an undercover car,' the witness said.\n'And then the suspect, whoever's in the van is then tasered and dragged out by them and then they arrested him.\n'We didn't actually see any gunshots or anything but it certainly sounded like them with the glass all smashed in the van… I didn't see the person who it was but I saw them arrested from behind.'\nHe added: 'We saw a man pinned down on the ground and multiple armed police surrounding him and then more armed police later turned up after that.'\nStudent Demi Ojolow said: 'I just saw the police shouting at him to get out of the car and get on the floor.\n'And they dragged him out of the car and he just fell on the floor. He was still pretty wrestling at the point.\n'They dragged him away and that was about it.'\nMs Ojolow said police were pointing some kind of weapons at the man but she was not sure whether it was a Taser or firearm.\nShe did not know if the man from the van was armed.\nAsked what the police shouted, she said: 'Get out of the car and get on the floor.'\nArmed police in Nottingham city centre, which was locked down on Tuesday morning\nMedical equipment lies within a police cordon on Ilkeston Road, where two people were found dead. A resident said police were 'banging on my door' at 5am asking for any CCTV footage\nAnother Bentinck Road resident, Dimitrious Lawani, said: 'Two of them (police) were holding what seemed to me to be a Taser.\n'The other one seemed quite a bit bigger than a Taser. I'm not sure what that one was.'\nStudent Mr Lawani said he arrived at the scene just as the man was being pulled out of the van.\nHe said: 'There's two of them pulling him and two behind pointing at him - I think those were Tasers.'\nHe said they shouted: 'Get down, get out, stop fighting.'\nDelivery driver Miklos Toldi, 37, and his wife Petra found the body of the man in Magdala Road as they headed to work in their car at around 5.30am.\nThey live just 100 yards from where the body was found and stopped their car at the same time as another motorist.\nMr Toldi, a Hungarian national, said the victim had clearly been stabbed. He was aged around 65 with grey hair and black trousers.\n'I saw the body lying in the street,' he said. 'There was blood trailing down the road. The blood looked as if it was fresh.'\n'He was lying on his side, his mouth was open and there was no movement.'\nMr Toldi said it took the police only about two or three minutes to arrive at the scene following a 999 call.\nOfficers turned the man on to his back to start CPR and Mr Toldi said he saw what appeared to be several stab wounds in his chest. 'His knuckles were also covered in blood,' he said.\n'It was a big shock. I'm ok but I am worried about my wife.'\nOne resident overlooking Magdala Road said he was woken by the 'sound of a woman's screams.'\nThe man, who asked not to be named, said: 'I was worried it was the sound of someone being attacked but thinking about it now it may have been the person who came across the body.'\nHe said he later saw police and a sheet, probably covering a body, on the road outside the tennis club.\nSix roads were shut and tram services were cancelled as police locked down the entire city centre\nNational inter-agency liaison officers (NILO) on the scene in Nottingham city centre\nMagdala Road is in a leafy middle class area of Nottingham with large detached homes.\nSix roads around the city and suburbs have been shut and tram services cancelled, while ambulances, fire engines and specialist officers dressed in body armour and helmets are on the scene.\nThey are National inter-agency liaison officers (NILO) - part of an elite force set up in the wake of the Manchester Arena bombing.\nPolice have said road closures will remain in place for 'some time' and vowed to release more information when they can.\nLocal resident Glen Gretton said he was woken up at around 5am morning by the sounds of a series of police cars passing his home.\nThe 46-year-old delivery driver, who lives in a flat in Mansfield Road in Sherwood, said: 'I heard a police car go past.\n'It was driving extremely quickly, followed by another one, another one.\n'They just kept coming so I knew something quite major ... was happening somewhere around the city centre.'\nChief Constable Kate Meynell said: 'This is an horrific and tragic incident which has claimed the lives of three people. Pictured are officers at the scene\nRishi Sunak said he is being kept updated on the 'shocking incident' in Nottingham as police investigate, and he paid tribute to those who have lost their lives and their families.\nThe Prime Minister tweeted: 'I want to thank the police and emergency services for their ongoing response to the shocking incident in Nottingham this morning.\n'I am being kept updated on developments. The police must be given the time to undertake their work.\n'My thoughts are with those injured, and the family and loved ones of those who have lost their lives.'\nFrench president Emmanuel Macron tweeted: 'Our thoughts go to the victims of the tragic events in Nottingham, the injured, the families.\n'We share the grief of our British friends and stand by their side.'\nHome Secretary Suella Braverman said she is 'shocked and saddened' at the deaths in Nottingham and has spoken with the Chief Constable of Nottinghamshire Police.\nShe tweeted: 'I am shocked & saddened that three people have lost their lives today in Nottingham. My thoughts are with those affected by this incident.\n'I have spoken to @nottspolice Chief Constable & am receiving regular updates. I am thankful to the emergency services for their response.'\nThe A6008 Upper Parliament Street is currently closed from the junction with Maid Marian Way, towards the Theatre Royal.\nPrime Minister Rishi Sunak said he was being kept 'updated' on any developments\nBen Bradley, the leader of Nottingham city council, said his 'thoughts' were with everyone in the city\nRobert Jenrick, a Home Office minister and the Conservative Member of Parliament for Newark, Nottinghamshire, shared his shock today\nThe A60 Mansfield Road is also closed between Woodborough Road, towards Mapperley and St Ann's, and Shakespeare Street, near the Victoria Centre.\nMilton Street, the street parallel to the main entrance to the shopping centre, and Burton Street are also closed in the city centre.\nAll tram services have been suspended, due to what has been described as a 'major police incident, with tram tickets being accepted on buses.\nMaples Street in Hyson Green is also shut, while the A609 Ilkeston Road is also closed in both directions, with slow traffic due to a police incident from Faraday Road to Bright Street. Magdala Road near Mapperley Park is also closed.\nLabour leader Sir Keir Starmer said his thoughts were with the family and friends of those who had died and were injured in Nottingham.\nHe tweeted: 'Awful news from Nottingham this morning. My thoughts are with the family and friends of those who have lost their lives, those injured, and the people of Nottingham.\n'Thank you to the police and the emergency services as they respond to this terrible incident.'\nNational inter-agency liaison officers (NILO) on the scene in Nottingham\nRobert Jenrick, a Home Office minister and the Conservative Member of Parliament for Newark, Nottinghamshire, tweeted: 'I'm deeply grateful to @nottspolice and all those who responded to the terrible attack earlier today in Nottingham.\n'All of us in Nottinghamshire share a sense of shock. My thoughts and prayers are with those injured and with the family and friends of those killed.'\nNottingham's three Labour MPs, Nadia Whittome, Lilian Greenwood and Alex Norris, said they were 'shaken' by the events in the city.\nA joint statement posted on Twitter by Ms Whittome said: 'Our city has been devastated by the deaths of three people this morning.\n'Our thoughts and prayers are with the families and loved ones of those who have died and those injured.\n'We are grateful for the efforts of the city's emergency responders in tackling these incidents. They must be allowed to do their jobs in investigating them.\n'Nottingham is a beautiful city, home to brilliant people from all backgrounds.\n'We are shaken by today's events but will meet them collectively as a community and heal together.'\nNottinghamshire Police said: 'We ask the public to be patient while inquiries continue. At this time, a number of roads in the city will remain closed as this investigation progresses'\nNottingham Forest Football Club also reacted to the incident, saying on Twitter: 'We are devastated to learn the news of the horrific events that took place in Nottingham this morning.\n'The thoughts of everyone at #NFFC are with the friends and families of those who have tragically lost their lives and to everyone affected by this incident.'\nPolice have asked witnesses, or anyone concerned about a family member or friend, to call 0800 0961011.\nMost watched News videos\n- Extraordinary moment mass brawl breaks out between Brits on flight\n- Finance expert's TV interview interrupted by adorable granddaughter\n- Moment driver veers to target e-bike riders before killing teen\n- Moment Swiss bar fire owners collapse after being confronted\n- Chilling police interview of ISIS fanatic plotting UK attack\n- Astonishing moment a street is swallowed by a sinkhole\n- Israeli hostage reveals how she survived being tortured\n- Deepak Chopra confronted over his relationship to Epstein\n- Food vlogger dies after 'eating toxic devil crab'\n- Spy cam shows woman on her knees next to Jeffrey Epstein\n- New video shows man with backpack similar to Guthrie kidnapper\n- Toddler opens car door in traffic and sends biker flying",
  "word_count": 6491,
  "scraped_at": "2026-02-14T13:47:05.385125"
}