{
  "article_id": "eaed4084cf2a",
  "url": "https://www.90min.com/jenna-nighswonger-always-dreamed-playing-europe",
  "title": "Jenna Nighswonger :  Ive always dreamed of playing in Europe  ",
  "date": "20250204T184500Z",
  "domain": "90min.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Jenna Nighswonger: 'I've always dreamed of playing in Europe'\n- Arsenal announced the signing of Jenna Nighswonger last week\n- The left-back arrives in north-London from NWSL side NJ/NY Gotham FC\n- 90min sat down with Arsenal's newest recruit to find out why she moved to the WSL\nUSWNT defender Jenna Nighswonger reveals playing football in Europe has always been her ambition after moving across the pond to join Arsenal.\nIt was announced on deadline day of the January transfer window that the 24-year-old had made the move to north-London from NWSL side NJ/NY Gotham FC.\nNighswonger signed with Gotham in 2023 and became the NWSL Rookie of the Year in her debut season, but her dream has always been to play in Europe's top-flight.\n\"This is something I wanted to do since I was like, seven or eight,\" Nighswonger tells 90min. \"I think when I was planning my whole life I was like, okay, coming out of college I wanted to go to Europe. But then a great opportunity with Gotham happened, so I went to Gotham.\"\n\"However still in the back of my mind, I was always like, I really want to play in Europe. So when this opportunity presented itself, I was so happy to join.\"\nThe defender explained that growing up, she was an avid fan of the Premier League. \"I was following the Premier League, because that's just where the good soccer was,\" she says. \"I always wanted to come here because that's who I'd watched growing up.\"\nNighswonger isn't the only member of the USWNT team that has made the switch to England during the transfer window, with Chelsea signing defender Naomi Girma for a world-record fee.\nHighlighting what she makes of the difference between the NWSL and the Women's Super League (WSL), Nighswonger explains: \"the NWSL is very transitional and the WSL is more tactical, you could say. I think that growing your game in different ways is really important.\n\"I think coming into a new team just has that transition, whether or not it is a new league or a different league. I'm just trying to lean in my new teammates, especially Foxy [Emily Fox], I'm asking like a million questions to try to make the transition as smooth as possible.\"\nArsenal's newest recruit starred at left-bank on four occasions for her nation during the USWNT's gold medal campaign at the Paris Olympic Games, but grew up plying her trade elsewhere on the pitch.\n\"I think that versatility in the game is important and I'm happy to have it,\" Nighswonger adds. \"I love left back now and I'm so happy that I got moved there.\n\"I was a 10 or an eight before, and then I got to Gotham and they were short on left backs, and I'm left footed, so I just fell into that role. Then I really loved it, and now I'm really happy to play there. I think it's a really fun position.\n\"I just like the creative freedom that left-backs have. We can get forward, you can go high, you can go inside. It just depends on the tactics of the game. I think there is versatility in just being a left-back. It's really fun to be involved in everything- attacking defending, I love that.\"\nThe American, brimming with a bubbly personality, left one final note for Arsenal fans who will see her feature in red and white very soon: \"I love soccer, I love football, so I'm just excited to play and be immersed in it.\"",
  "word_count": 590,
  "scraped_at": "2026-02-14T13:19:42.455023"
}