{
  "article_id": "eaffe387386d",
  "url": "https://theathletic.com/4270681/2023/03/06/big-ten-f1-espn-mls-apple/",
  "title": "Big Ten football media draft , F1 ratings , ESPN future and more : Sports Media Mailbag , Part I",
  "date": "20230306T150000Z",
  "domain": "theathletic.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Welcome to the 35th Media Mailbag for The Athletic. Writing a mailbag — as egocentric as it is — is always a fun exercise. Thanks for sending in your questions via the website and app. There were nearly 100 questions, so this will be a two-parter. Part II will appear later this week.\nNote: Questions have been edited for clarity and length.\nAdvertisement\nAt what point will we have a better idea on the draft order process for selecting the Big Ten games between Fox, NBC, and CBS for this upcoming football season? I would assume that Fox would not get the first pick every week and that it would alternate between the three networks? — Aaron W.\nExcellent question. From what I understand, Fox will have the first pick of a game on a given week more often than CBS and NBC, but they don’t get the first pick for every week. Fox’s Big Ten schedule will be very strong this year given CBS still has SEC football in 2023, so they don’t have as many windows for the Big Ten. (I would guess CBS would have more No. 1 picks later in the deal when the SEC morphs to ESPN.) What Fox will definitely get is the top game of the package every year, which, based on viewership, is of course Ohio State against Michigan. I’ve heard the games will be selected this spring, and we should see some dates in May.\nAny idea what the Formula One viewership numbers will look like in the U.S. this year? — Ryan O.\nPer ESPN: The 2022 season averaged 1.21 million viewers per race across ESPN, ESPN2 and ABC, a 28 percent increase over the previous U.S. television record of 949,000 average viewers from 2021. The 2022 season was the first in U.S. television history to average 1 million or more viewers per race. ESPN platforms will air all 23 races, with 18 of the 23 airing on ABC or ESPN. Races in Miami and Austin will air on ABC. I do wonder if we are close to the F1 ceiling in the U.S., but I do think this schedule sets up very nicely for a small increase from last year.\nGO DEEPER\nWhat sport will be the next F1 on U.S. TV? Our candidates for a ratings boom\nIs Apple+ or MLS offering a commercial service for their League Pass? Or are bar and restaurant owners left out on being able to stream the matches? This seems like kind of a “test run” if you will for YouTube’s NFL Sunday Ticket this fall. — Gary C.\nAdvertisement\nCommercial establishments can get MLS Season Pass via DirecTV For Business. Per the league: Finding businesses with MLS Season Pass can be done via the DirecTV Sports Bar Finder app, available on the App Store.\nWhat did you make of Bob Iger’s comments that Disney and ESPN must be a little more selective in bidding for live sports? Has it already had an impact, and where might it have an impact in the future? Plus, would Warner Media really walk away from the NBA? That is a pretty big legacy property for TNT. — Michael P.\nDespite Bob Iger’s public statements about ESPN, the reorganization at Disney struck me as a potential first step towards eventually spinning off the ESPN division. Would ABC go with ESPN or stay as part of the Disney Entertainment Group? — Robby W.\nTo answer Michael P’s Qs: I think ESPN will absolutely be more selective. Navigating cord-cutting and escalating fees for sports rights makes this a necessity. Once upon a time, it would have been inconceivable for ESPN not to be airing Big Ten football, even if they got a secondary package. The current business suggests to me that the NBA is too important for ESPN (and ESPN for the NBA as well) for a deal not to happen. I don’t feel the same way about Warner Bros. Discovery Sports. They’ve lost some long-tenured executives with longtime relationships with the league — the people in the room when the deal happened. So while I’d still lean toward WBDS re-upping with the NBA, I’d make it a 2-point favorite as opposed to being a double-digit favorite once upon a time.\nTo answer Robby W: Candidly, I’d read the business press on this before a knucklehead such as myself. ESPN is definitely facing greater accountability in this new structure. In December, a Wells Fargo analyst predicted a separation for ESPN/ABC. Last month, Iger said the new structure was not designed with a spin-off in mind. Having lived through the AOL-Time Warner merger as a young Sports Illustrated employee, I reflexively am suspect of most CEOs. I thought this piece from the L.A. Times was worth reading.\nIs college football becoming more of a regional sport instead of going national for many games? If so, how would teams and leagues deal with that equation and still get their games on live TV? — Joe D.\nAdvertisement\nI look at it a little differently: College football is a regional sport that has grown in interest nationally over the past two decades as broadcast outlets have increased inventory and placed the game in highly visible programming windows. If you play in one of the Power Five conferences (ACC, Big Ten, Big 12, Pac-12 and SEC), you are being funded by media companies (presuming the Pac-12 deal finally comes in) with national (and potentially global) distribution. So while I think interest in, say, Texas Tech football is mostly found in Texas and the Southwest, the distribution allows that team to be national.\nWhat do you see as the likelihood of broadcasters owning pieces or the entirety of sports leagues like the XFL and USFL? — Dan R.\nThat’s an interesting question. I certainly think it’s possible that a sports league startup would offer equity to a broadcaster, especially if the person was a high-profile broadcaster whose hiring created interest in a new league. I think your question is realistic only for niche sports. Fox Sports NFL broadcaster Daryl Johnston is the vice president of operations for the USFL, but keep in mind Fox has a significant financial stake in the league.\nWhat was the overall consensus on how MLS performed on Apple TV for opening weekend? — Seth H.\nThe biggest goal for Apple/MLS for its debut was to show proof of concept and not have any technology issues. They succeeded. I wrote about the first weekend here.\nGO DEEPER\nMLS and Apple: The grand media experiment begins, plus Pac-12 media thoughts\nI know nothing will be changing until 2032, but could you see the next March Madness TV deal be split up into the major TV channels? Could 1/4 of games go to CBS, another 1/4 to Fox, 1/4 to ESPN/ABC and the last 1/4 to NBC? — Jake S.\nI don’t see the NCAA Tournament being split between more than two entities. But could one of those future entities be a streaming service? For certain.\nRegarding the MLS Apple TV deal, how did the decision to set all kickoff times for 7:30 p.m. local time come about and was there any pushback from some of the northern-based teams? — Danu M.\nAdvertisement\nMy soccer colleagues at The Athletic wrote a great piece last October that went deep into the thought process of the MLS/Apple partnership. I think universal start times was something most in the league were in favor of, and broadcaster Taylor Twellman told me that, in 2022, there were 62 different start times for MLS games, which is crazy.\nWho’s in your top five of all-time color commentators? I’m sure you would have to have (John) Madden, (Tim) McCarver and (Billy) Packer? — John S.\nAlways a fun question, but it’s so subjective. Is it my personal top 5, or who I think would ultimately prevail in a poll of viewers? It’s also tough to compare across sports. How would you rank, say, Howard Cosell versus John McEnroe? Put me down for Cosell, Madden, Hank Stram, Hubie Brown and Bobby Heenan.\nAs March Madness approaches, there are several commentators that work for other networks during the season that work for CBS/Turner in the tournament (Bill Raftery, Dan Bonner, Jim Jackson, etc). Why doesn’t Fox lease out Gus Johnson to CBS for a couple weeks in March? — Mark S.\nI’d love to see Gus here on a loaner, but I think CBS/Turner executives are happy with this current group.\nWhat is ESPNs relationship with Sky for F1 coverage this year? I thought with the new contract there would be a chance they would try and produce their own telecast. — Adam S.\nESPN says they well still be using Sky coverage for races, qualifying, practice and shoulder programming. They will have SportsCenter talent live from the track for the U.S. races, but those U.S. race telecasts would still be broadcast by Sky.\nDo you think we will see local coverage of the Phoenix Suns increase in the immediate post-(Kevin Durant) trade given their Super Team and deep postseason run potential? Or will it take media orgs too long to respond / for the Suns to “earn it”? — Matthew B.\nAdvertisement\nAt this late juncture of the season, I don’t think you’ll see national outlets send reporter/s to live in Phoenix for a couple of months, but the Suns will get a ton of attention nationally come the playoffs. Local news coverage has been gutted across the U.S. — and that filters into sports coverage — due to many factors. But I am sure local outlets will amp up Suns coverage for the postseason.\nWhat is going to happen with the ACC due to their dilemma of having an outdated and inferior TV contract that runs until 2036, not to mention the grant of rights agreements last until then too? — Stewart M.\nI asked my colleague Andy Staples, one of our senior writers for college football, for some insight regarding your question:\nWrites Staples: “They’re going to argue. A lot. The contract is not as bad as people make it sound. It’s backloaded like all of them, so the average number that was reported at the time is now on the lower end of what’s left. It’s still going to pay out more than the Big 12 and (we assume) Pac-12, but it will be far behind the Big Ten and SEC. This is obviously a huge deal for Clemson and Florida State because they must compete for players with SEC schools (and play them annually). It’s also a big deal for North Carolina, which would be near the top of the Big Ten and SEC’s wish lists if it was a free agent. Miami also probably could draw interest from either of those leagues as a free agent. But at this point, no one in the league seems to feel comfortable challenging the grant of rights. It’s not a matter of a simple majority being able to rip it up. If anyone moved to challenge it or rework it, a school like Boston College would sue everyone. If you can’t get out of the GOR, you have no rights to your home games until 2036. And the fear among the schools that want to challenge it is that even if you ultimately prevail, it could take several years of litigation to get there.”\nAs a UK football fan watching from afar it seems CBS has struck the right balance between serious analysis and entertainment with their studio talent for the UEFA Champions League coverage. With Apple just launching their coverage of MLS, which U.S, network/platform do you think is most popular with soccer fans on your side of the pond for their overall presentation? — Luke S.\nI think NBC’s Premier League coverage has been excellent and has rightfully drawn praise on social media and other publishing platforms. They’ve invested significantly in the product. Of course, it’s a pricy proposition to watch every game for an American fan, but I think if you are a diehard fan who has invested the money for Peacock/NBC, you are satisfied.\nESPN’s NBA coverage on Wednesday will feature an all-women broadcast as part of International Women’s Day. Beth Mowins, Doris Burke and Cassidy Hubbarth will call the Mavericks-Pelicans game (7:30 p.m. ET, ESPN) while ESPN’s NBA studio programming on that day will consist of host Malika Andrews and analysts Chiney Ogwumike, Becky Hammon, Ramona Shelburne and Monica McNutt. The behind-the-scenes positions will be led by women as well, including game director Joslyn Mayer, game producer Laurie Privitera, “NBA Today” director Kathy Perez and associate director Vannessa Ford, and “NBA Countdown” producer Dominique Collins.\nAdvertisement\nEpisode 283 of the Sports Media Podcast features San Jose Mercury News reporter Jon Wilner, who authors the“Pac-12 Hotline,” and Sweeney Murti, an MLB Media senior contributor. In this podcast, Wilner discusses where things stand with Pac-12 media rights negotiations; Amazon’s conceptual interest in a Friday night window; the interests of ESPN, Apple and Amazon; the likely timeframe of a deal; the potential dollars each school is looking at annually; the proximity of Pac-12 schools to Amazon and Apple; the likely end of the Pac-12 Network; the basketball and Olympic sport programs of the Pac-12; whether Washington can emerge as a bigger football power and more. Murti discusses his new job for MLB Media after a 30-year run at New York audio sports station WFAN; how his new job came about; working 22 years as a New York Yankees reporter; how he feels about WFAN management today; the biggest challenge covering the Yankees every day; Derek Jeter joining Fox and what Murti’s expectations of Jeter as a broadcaster; the future of sport-talk radio and more.\nYou can subscribe to this podcast on Apple Podcasts, Google Play, Stitcher and more.\nSome things I read over the last week that were interesting to me:\n• Such a great feature in the video below from MLB Network on Blue Jays outfielder George Springer and Mateo Sanchez, the 13-year-old son of MLB.com writer Jesse Sanchez, on how they bonded over stuttering awareness. Props to coordinating producers Jed Tuminaro and Bruce Cornblatt, producer Paul Solga and writer Anthony Castrovince.\n\"I just saw a kid that I was… I had been in that position and knew, felt and understood exactly everything he was going through.\" – George Springer\nThe story of Mateo Sanchez and the @BlueJays star, as told by @castrovince. pic.twitter.com/XdyF70E2P2\n— MLB Network (@MLBNetwork) March 2, 2023\n• The oligarch’s ex-wife had carefully built a place for herself in the art world. And then, Putin’s war started. By Caitlin Moscatello of The New York Times.\n• Kenny Anderson, NYC hoops legend, finds fulfillment at HBCU steeped in history. By Joe Rexrode of The Athletic.\n• More great work from ESPN’s Don Van Natta Jr.: How a disputed $55M loan plays into feds’ probe of Commanders.\n• A Tale of Shipwreck, Mutiny and Murder. By David Grann of The New Yorker.\nAdvertisement\n• Why Mason Greenwood should not play for Manchester United again. By Daniel Taylor of The Athletic.\n• For the Rangers’ Taylor Hearn, rodeo is the family business — and his future. By Levi Weaver of The Athletic.\n• What it’s like in an NHL front office on trade deadline day. By Cam Charron of The Athletic.\n• MLS willing to be flexible in order to seal Lionel Messi transfer. By Paul Tenorio and Pablo Maurer of The Athletic.\n• The Fugee, the Fugitive and the FBI. By Jason Leopold, Matthew Campbell & Anthony Cormier for Bloomberg Businessweek.\n(Photo of Michigan’s Kris Jenkins celebrating the team’s win over Ohio State in November: Ben Jackson / Getty Images)",
  "word_count": 2628,
  "scraped_at": "2026-02-14T12:38:53.714772"
}