{
  "article_id": "eb00a09cda84",
  "url": "https://www.hollywoodreporter.com/business/business-news/espn-content-overhaul-burke-magnus-1235984414/",
  "title": "ESPN Content Overhaul Under Burke Magnus",
  "date": "20240826T194500Z",
  "domain": "hollywoodreporter.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "ESPN is making big changes to its content organization, with president of content Burke Magnus outlining a sweeping new organization structure that will elevate some top executives and see the company part ways with others.\nIn a memo to ESPN staff Monday, Magnus wrote that the changes will make the company “more strategic, collaborative and nimble, as we continue to excel in every area and function. We remain committed to employee development, and the restructure will result in new positions or promotions for people who are expanding their responsibilities or taking on new challenges.”\nRelated Stories\nAt the top of the new structure will be Mike McQuade, a 37-year ESPN veteran who has been named executive vp sports production, overseeing production and studio shows dedicated to specific sports, while David Roberts will be executive vp and executive editor of sports news and entertainment, which will include oversight of ESPN’s news operation, as well as non-sport-specific programming like First Take, SportsCenter and The Pat McAfee Show.\nMagnus wrote that going forward his direct reports will be Roberts, McQuade, Kaitee Daley, Freddy Rolón, Brian Lockhart, Chris Calcinari and Nick Parsons. He added that with the new structure, there will be layoffs, though he added that it will also create new opportunities for staff.\n“I understand how difficult change and shifts can be,” he wrote. “With this reorganization, we have set up the Content organization to best operate now and in the future, while creating opportunities for colleagues across the organization to grow and thrive. We will continue to tweak the structure to reflect the constant evolution of our business, and all of us should embrace change.”\nThe changes come at a critical moment for ESPN, which is in the midst of planning a flagship streaming service for next year, and just cut a long-term deal with the NBA. Magnus wrote that the new structure reflected conversations with nearly 75 ESPN executives across levels at the company.\n“Our Content team is the industry leader, and these moves will only enhance our strong position, further our mission of serving sports fans, anytime, anywhere, and continue our ability to drive value and results for The Walt Disney Company,” Magnus wrote.\nYou can read his full memo below.\nTeammates –\nFirst, thank you all for your hard work this past weekend – we are in an incredibly busy time of year with the kickoff of our college football season, the US Open, LLWS, and so much more. We’ve had an amazing 2024 so far, and we continue to succeed in delivering outstanding content across platforms, hitting ratings highs despite industry challenges, while innovating for sports fans. You should all be proud of our collective achievements.\nSince May, we’ve been working on a plan to restructure our department to improve collaboration, centralize functions, create better alignment, and redeploy resources to areas of growth – further positioning our people to deliver on ESPN’s priorities during rapidly evolving times. To ensure we identified the best structure possible, we engaged Disney’s organizational development team to interview nearly 75 ESPN stakeholders, and with their recommendations in hand, and after careful deliberation, I am pleased to share our new structure.\nWith these moves, I believe we will be more strategic, collaborative and nimble, as we continue to excel in every area and function. We remain committed to employee development, and the restructure will result in new positions or promotions for people who are expanding their responsibilities or taking on new challenges.\nOne key message heard loud and clear in the interviews was the recommendation that studio, production, and editorial functions could be better aligned for effectiveness and creativity. Our Sports Production team, led by Mike McQuade, will include production, and studio shows that are sport-specific, while our Sports News & Entertainment team, led by David Roberts, better integrates and centralizes cross-platform editorial, news and coverage, and includes non-sport specific studio shows (SportsCenter, First Take, Get Up, The Pat McAfee Show, ATH, PTI).\nIn taking on leadership of the new Sports Production team, Mike McQuade, a 37-year employee at ESPN, has been promoted to EVP. Most recently, Mike was the producer for Tennis (Australian Open, Wimbledon and the US Open), NHL, Boxing, Golf (Masters & PGA Championship), and SportsCenter with Scott Van Pelt – a program he helped create. Among his many successes, Mike recently led our coverage as producer of the breaking news of the arrest of Scottie Scheffler, a great example of his ability to quickly lead a team responsible for critical content with excellence. In addition to his extensive production background, Mike is well known for his storytelling ability across platforms, innovative mindset, attention to detail and his tireless push to deliver results. He is also a leader who takes the time to mentor employees of all levels. Mike will relocate to Bristol. Details about Mike’s new team and the structure of his group can be found below.\nNext, with our continued focus on expanding to reach new audiences and better prepare for our DTC future, another strong recommendation was to streamline and centralize digital, social and streaming, enabling more horizontal discussion and strategy across platforms, aligned under one leader – Kaitee Daley.\nAdditionally, to expand our global sports imprint, we are bringing together our International Production team and our ESPN Deportes and International Editorial teams, along with Business Operations for International, under one leader – Freddy Rolón.\nLastly, the SIG group is being divided into two functional areas – Research and ESPN Stats & Analysis. Research is a key group that supports our storytelling functions and better aligns with the News & Entertainment group, led by Maria Soares, under David Roberts. Stats & Analysis is critical to our digital strategy and will move to the newly formed Digital, Social & Streaming Content team under Kaitee Daley, specifically under Nicole Pelaez-Dandrea.\nWith that said, my direct reports are David Roberts, Mike McQuade, Kaitee Daley, Freddy Rolón, Brian Lockhart, Chris Calcinari and Nick Parsons.\nDavid Roberts, EVP, Executive Editor, Sports News & Entertainment\nDavid has done phenomenal work with our NBA and WNBA properties and studio programming, and I thank him for the amazing, steady growth of everything associated with both leagues and our daily shows. David will now transition to oversee Sports News and Entertainment, and his direct reports will be SVP Maria Soares (leading our newly centralized Sports News and Coverage, including Research and Digital Editorial), SVP Mike Foss (Sports Studio and Entertainment, including SportsCenter), and VP Chris Buckle (Investigative and Enterprise Journalism).\nReporting to Maria Soares: VP David Kraft (Newsgathering), VP Lauren Reynolds (Digital Editorial, Universal Coverage Group), Sr. Director Kristie Blasi (Research & Bottomline), VP Jack Obringer (Wraps, Sales, Integration, Editorial Graphics Producers) and Sr. Director Stacey Pressman (Talent Producers).\nReporting to Mike Foss: VP Pete McConville (7am SC, Get Up, First Take), newly promoted VP James Dunn (2p SC, ATH, PTI, weekend SC), VP Scott Clark (ESPN BET & Fantasy studio shows, ESPN BET Content Integration, 6p SC), VP Johann Castillo (Late Night & LA SC, SVP, Screening, RISE), VP Julie McGlone (CCU, SCEU), and newly promoted VP Justin Craig (Digital Production, Podcasts, Audio). Mike Foss will continue his role working directly with The Pat McAfee Show.\nReporting to Chris Buckle: Sr. Deputy Editor Mike Drago (Investigative Journalism), Coordinating Producer I Rayna Banks (Production), Executive Director Scott Burton (Enterprise Journalism), newly promoted Sr. Director Eric Neel (Development) and Sr. Deputy Editor Jena Janovy (Enterprise and Investigative Journalism).\nMike McQuade, EVP, Sports Production\nMike will have four direct reports: SVP Mark Gross (Event and Studio for NFL, MNF & Super Bowl, CFB, CFP, UFL, UFC, Boxing and Golf), a to be determined SVP (Event and Studio for NBA, WNBA, NHL, College Ice Hockey and Tennis), SVP Meg Aronowitz (Event and Studio for MLB, ACC, SEC, NCAA Women’s and Men’s Basketball, School Control Rooms, College Baseball, Pro and College Softball, Girls and Boys Little League World Series), and VP Kate Jackson (Wrestling, Volleyball, Gymnastics, Field Hockey, College and Pro Lacrosse, Special Olympics, F1 and special event productions such as the ESPYS).\nReporting to Mark Gross: VP Steve Ackels (MNF), VP Seth Markman (NFL and CFB studio shows), and a new VP Sports Production role for the Super Bowl will be posted. As you know, with our most recent NFL agreement, ABC/ESPN joined the Super Bowl rotation, with this outstanding opportunity beginning with the 2026 season, on Feb. 14, 2027. This new VP position will enable us to fully focus our resources and efforts on creating another defining moment for this company with our Super Bowl. In addition, VP Amanda Gifford (CFB, CFP, UFL), VP Shawn Murphy (CFB, CFB Spring Games, Boxing), and VP Glenn Jacobs (UFC) will report to Mark. While Golf will move to Mark Gross, Mike McQuade will continue to cover until a plan is in place.\nUntil the new SVP is determined, the following colleagues will interim report to Mike McQuade: VP Tim Corrigan (merging NBA and WNBA responsibilities), newly promoted VP Linda Schulz (NHL Studio and Event and College Ice Hockey), Coordinating Producer II Hilary Guy, Coordinating Producer I Terrell Bouza, and a new VP Sports Production role for NBA and WNBA Studio shows that will be posted. Tennis will continue to report to Mike McQuade until a plan is in place.\nReporting to Meg Aronowitz: VP David Ceisler (Women’s and Men’s CBB, LLWS), VP Phil Orlins (MLB and Technology), newly promoted VP Pete Watters (SECN), Coordinating Producer II Andy Green (Non-traditional Productions), Sr. Managing Producer Dan Kole (School Control Room and Packager Services), and a new VP Sports Production role for ACCN and NCAA Studio that will be posted.\nReporting to Kate Jackson: Coordinating Producer I Erika Galbraith (Lacrosse, Volleyball), Coordinating Producer II Aaron Katzman (CBB GameDay, NBA Draft, college soccer, and beach volleyball), and a Coordinating Producer I role to be posted.\nKaitee Daley, SVP, Digital, Social & Streaming Content\nKaitee’s strategic mindset leading social has led to ESPN becoming one of the most successful, innovative, and engaged brands across social media. As we continue our evolution as the preeminent digital sports platform, Kaitee will return to her digital media roots to add oversight of digital audience engagement inclusive of ESPN mobile apps, streaming, SEO, and Stats & Analysis, led by VP Nicole Pelaez-Dandrea (ESPN Digital Audience Engagement). VP Celia Bouza (Multi-Platform Video) will continue to report to Kaitee and add oversight of YouTube and digital video. Kaitee’s direct reports also include Sr. Director Amanda Anderson (Social Operations and Audience Expansion) and Sr. Director Brett Edgerton (Social Sports and Partnerships), with Omar Raja continuing his talent and social strategist role. Additional roles will be created in the following growth areas: Digital Product Alignment, Direct-To-Consumer, and Social.\nReporting to Celia Bouza: Sr. Director Josh Barbarotta (Digital Video Content & Solutions), Sr. Director Jeremy Fitch (YouTube), and Sr. Director Max Kelley (Social Production & Creative).\nReporting to Nicole Pelaez-Dandrea: Sr. Director Nick Loucks (Mobile Apps), Sr. Director Emily Schaible (SEO, Content Optimization), Sr. Director Patrick Caulfield (ESPN Stats & Analysis), Director Erin Spraw (Audience Engagement), and Sr. Director Dominic Ridgard (Streaming).\nReporting to Amanda Anderson: Sr. Manager Lauren Giudice (Women’s Sports, espnW, Social Referrals), Digital Video Producer II Justin Rockhold (Snapchat, Platform Development), Sr. Manager Arthur Kogan (Audience Expansion), and Sr. Manager Ann Drinkard (Social Operations).\nReporting to Brett Edgerton: Director Annie Dunbar (Social College Sports), Director Nicole Williams (Social Pro Sports), and Manager Mike Powers (Social Sponsorship).\nFreddy Rolón, Head of Global Sports & Talent Office\nFreddy’s distinguished leadership at ESPN and in the industry is highly regarded, and he’ll apply his expertise in audience expansion and content strategy to advance a new department that unites our Production, Editorial, and Business Operations teams focused on global sports. Freddy’s new role comes at an important time, as starting in the 2025-26 NBA season with our new agreement, Disney’s international package of NBA and WNBA games will be available to stream on its digital platforms, including on Disney+ in select markets around the world – Disney’s most significant global sports expansion. Freddy also assumes oversight of the Talent Office, a vital function which serves the entire organization, and will also oversee ESPN NEXT, our phenomenal early-career program, helping guide its continued growth through his unique perspective as a longtime mentor, advisor and leader. Reporting to Freddy are SVP Rodolfo Martinez (International and ESPN Deportes Production), VP Rosetta Ellis-Pilie (Talent Development and Negotiations), VP Oscar Ramos (Global Digital Editorial and ESPN Deportes) and newly promoted VP Stan Thomas (Cross-Platform Development & Business Operations, focused on international). Thank you to Celia Bouza for her stellar leadership of the NEXT program over the last 5 years. A Senior Director of ESPN NEXT will report to Freddy and will be posted soon.\nBrian Lockhart, SVP, Original Content\nBrian’s keen sense of quality storytelling has strongly benefited our Original Content and Films. Brian’s most recent successes include ESPN+’s new original series, In The Arena: Serena Williams, and a terrific summer slate of 30 for 30s. Brian will continue to oversee Original Content, Business Affairs and Talent Relations, and will add the award-winning Features group. His direct reports include VP Marsha Cooke (ESPN Films), newly promoted VP Lindsay Rovegno (ESPN Originals), VP Andy Tennant (E60, Content Integration), VP Craig Lazarus (Original Content and Features), VP Heather Anderson (Original Content and Business Affairs), Sr. Director Chantre Camack (Talent Relations), and Sr. Director Kati Fernandez (Original Content Development). Craig’s SCEU/CCU responsibilities, led by Julie McGlone, will shift to Mike Foss’s org with Julie reporting directly into Mike. VP Jose Morales (Features) will continue to report to Craig.\nChris Calcinari, SVP, Content Operations\nChris will continue his leadership excellence with our Content Operations group, overseeing Studio and Remote Operations and taking on oversight of Studio & Event Directing under VP Scott Favalora’s remit. Scott will report directly to Chris. Chris’s other direct reports will remain the same: VP Francis Legros (Studio Production Operations), Director Carlton Young, Director Dennis Cleary, and Executive Director John LaChance (all Remote Production Operations), Director Antwuan Dance (Crewing & Resources), Director Chris Strong (Production Operations Specialists), Director Dan Lannon (REMI Production Operations) and Director Kimberly Kanner (Production & Business Operations). The role of this critical function cannot be overstated – we depend on the experience, dedication and 24/7 mentality of Content Operations to deliver for fans.\nNick Parsons, VP, Content Business Operations\nNick, who has been focused on strategic planning for the Content organization and who will continue to partner with Finance on all Content spending, adds several content-related management operations and planning groups to his team, further ensuring strategic resource management across Content. Reporting to Nick are VP Miranda Thorpe (Charlotte Office and Production Management), VP Christie Dockman (Management Operations) and Sr. Director Marissa Cucolo (Office of the President of Content and Content Business Optimization). Nick will continue to manage our relationship with Omaha Productions.\nEach of my direct reports will be reaching out to their teams over the next 24 hours to respond to questions and further explain how their function will operate.\nAs a part of this reorganization, a few dedicated colleagues will no longer be with the company. With respect and admiration, I thank these colleagues for their commitment to ESPN and have communicated resources to help support them during the transition.\nI understand how difficult change and shifts can be. With this reorganization, we have set up the Content organization to best operate now and in the future, while creating opportunities for colleagues across the organization to grow and thrive. We will continue to tweak the structure to reflect the constant evolution of our business, and all of us should embrace change.\nOur Content team is the industry leader, and these moves will only enhance our strong position, further our mission of serving sports fans, anytime, anywhere, and continue our ability to drive value and results for The Walt Disney Company.\nTogether – by supporting each other and collaborating across the organization – we win as a team. I look forward to connecting with all of you soon – a full Content Town Hall will be announced in the coming weeks.\nThanks,\nBurke\nTHR Newsletters\nSign up for THR news straight to your inbox every day",
  "word_count": 2701,
  "scraped_at": "2026-02-14T12:17:44.496679"
}