{
  "article_id": "eb12ff2df17f",
  "url": "https://www.baltimoresun.com/2023/12/06/republicans-went-after-one-another-at-lively-fourth-debate-skipped-by-trump-follow-live-updates/",
  "title": "Republicans went after one another at lively fourth debate skipped by Trump . Follow live updates",
  "date": "20231207T043000Z",
  "domain": "baltimoresun.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "By The Associated Press\nFour Republican presidential hopefuls — Florida Gov. Ron DeSantis, former United Nations Ambassador Nikki Haley, biotech entrepreneur Vivek Ramaswamy and former New Jersey Gov. Chris Christie — were on stage for Wednesday night’s debate in Alabama. The early front-runner for the GOP nomination, former President Donald Trump, held a fundraiser in Florida instead.\nHaley was a top target of her rivals Wednesday night\nTakeaways from the fourth GOP presidential debate\nThe debate was a key moment for the young NewsNation cable network\nThe fourth debate was held in Alabama, the state that gave the GOP a roadmap to Trump\nChristie is doubling down on his criticism that his fellow Republican presidential candidates are too timid to take on Trump and his legal troubles.\nThe former New Jersey governor said after Wednesday’s debate that the other three candidates on stage in Tuscaloosa were “pretending we’re the only four candidates in the race.”\nChristie noted that Haley remained silent through an extended discussion of Trump’s fitness for office, given multiple pending indictments on charges stemming from his behavior in office and after leaving the White House.\nIf Haley, DeSantis and others are afraid to take on Trump, Christie said they aren’t up to being head of state and sitting across the table from other world leaders.\nBut he quipped that “at least the moderators asked some Trump questions,” unlike some previous debates.\nThough the candidates spent more time talking about Trump or responding to his comments and his commanding lead than in past debates, there were a few subjects the Republicans did not touch on Wednesday.\nDespite two high-profile shootings leading up to the debate with a gunman killing three people and wounding a fourth at the University of Nevada, Las Vegas on Wednesday and a Texas man who killed his parents and four others in a trail of violence Tuesday, the candidates did not discuss gun violence or mass shootings in America.\nAbortion, which was a big issue in last year’s midterm elections and is expected to play a prominent role in next year’s elections, was also conspicuously missing from the fourth debate. The candidates spent months on the campaign trail this year discussing — or sometimes sidestepping — questions on abortion, which they all oppose.\nClimate change also did not receive much of a mention Wednesday night besides in Ramaswamy’s closing statement, when he said the “climate change agenda is a hoax” and “one of the most important topics that needs to be discussed.”\nTrump’s super PAC said at the conclusion of the fourth presidential debate that it’s time for Republicans to unify around the former president.\nKaroline Leavitt, a spokesperson for Make America Great Again Inc., said Wednesday night that “The battle for second place has become the biggest waste of time, money, and energy that politics has ever seen.” She accused the four candidates on stage of “putting up a fake fight to satisfy their egos and please their billionaire puppet masters.”\nTrump skipped the fourth presidential debate, as he had the previous three, saying he didn’t want to give his lower-polling rivals any attention.\nNone of the four Republicans challenging Trump for the GOP nomination named him as inspiration for their possible future administrations.\nChristie said he would draw inspiration from Ronald Reagan, saying he has been working on a book about the president he called a “slave to the truth.”\nHaley named both George Washington and Abraham Lincoln, the latter of whom she said led the nation through the division of the Civil War.\nDeSantis named Calvin Coolidge, saying that “silent Cal knew the proper role of the federal government.”\nRamaswamy, the stage’s youngest candidate, said he would take inspiration from Thomas Jefferson, who wrote the Declaration of Independence at just 33 years old.\nWhile discussing terrorist threats, Haley says Iran knows “the easiest way” to enter the United States is through the southern border.\nBut reports of terrorists entering the United States by land from Mexico are almost unheard of.\nAlex Nowrasteh of the pro-immigration Cato Institute documented nine foreign-born terrorists who entered the United States illegally from 1975 through last year. Three entered Mexico in 1984 when they were 5 years old or younger and were convicted of plotting to attack Fort Dix, New Jersey, in 2007. The other six entered through Canada.\nIran has not been linked to funding terrorist attacks in the United States, like the 2001 strikes on the World Trade Center and Pentagon.\nDeSantis drew loud cheers when he said parents “do not have the right to abuse” their kids in response to Christie’s remarks about signing legislation as governor of New Jersey to provide guidance for schools to protect transgender students.\nChristie said he stood up for parents.\n“The minute you start to take those rights away from parents, you know, that’s a slippery slope,” Christie said. “What rights are going to be taken away next?”\nSaying “as a parent, you do not have the right to abuse your kids,” DeSantis said, “This is mutilating these minors. These are irreversible procedures.”\nGuidelines call for thorough assessments to confirm gender dysphoria before starting any treatment.\nThat treatment typically begins with puberty-blocking medication to temporarily pause sexual development while giving youngsters time to mature enough mentally and emotionally to make informed decisions about whether to pursue permanent treatment. Puberty blockers may be used for years and can increase risks for bone density loss, but that reverses when the drugs are stopped.\nSigns aren’t allowed during debates, but Ramaswamy used a legal pad at his podium to write a note criticizing Haley.\nRamaswamy held up a handwritten sign reading “Nikki = corrupt,” a characterization he repeated during debate critique of her association with aerospace giant Boeing Co., among other issues.\nRamaswamy had been asked if he questioned Haley’s Christian conviction after she was raised in the Sikh faith and converted.\nAll four candidates had notebooks on their podiums and were seen writing notes as soon as they walked on stage. It wasn’t clear when Ramaswamy had written the message.\nAsked if she would like to respond after Ramaswamy invoked her name, Haley said, “No, it’s not worth my time to respond to him.”\nChristie says he doesn’t think Trump is kidding when he says he would only be a dictator “on day one” if he returns to the White House.\nChristie says, “There’s no mystery” to what Trump wants to do as he has ramped rhetoric that has been criticized as increasingly authoritarian and violent.\n“Do I think he was kidding? When he said he’s a dictator? All you have to do is look at the history,” he added, before criticizing his rivals on stage for failing to go after Trump more aggressively.\nSome in the audience booed his comments.\nOn Tuesday, the former president declined to rule out abusing power as retribution in an interview with Fox News Channel host Sean Hannity.\n“Under no circumstances, you are promising America tonight, you would never abuse power as retribution against anybody?” Hannity asked Trump.\n“Except for day one,” Trump replied.\nAs the candidates quibbled about who would speak the truth to voters, everyone — moderators and candidates alike — let a rant of baseless conspiracy theories from Ramaswamy pass by unchecked.\nIn a run-on sentence, Ramaswamy rattled off a series of false and dubious claims, including that the Jan. 6 insurrection at the Capitol was an “ inside job ” and that the 2020 election was stolen by “Big Tech.”\nHe also reiterated his belief in a racist ideology known as the “ great replacement theory,” calling it “a basic statement of the Democratic party’s platform.”\nThe theory suggests there’s a plot to diminish the influence of white people and culture in America. Its adherents include far-right extremists, some of whom have committed violent acts.\nDeSantis sidestepped questions about whether Trump is “fit” to be president but said he thinks the former president, is 77, is too old to be president.\n“Father time is undefeated,” DeSantis said, adding: “I think we need to have somebody younger.”\nThe 45-year-old also said a candidate needed to be able to serve two terms, which Trump would not be able to do.\nChristie then repeatedly tried to get DeSantis to answer whether he thought Trump was mentally fit, leading to extended cross-talk and bickering between the two.\nDeSantis said of Trump: “I don’t know how he would score on a test.”\nThe Florida governor said he did not think Trump “is as bad as Biden,” who is 81, but said, “I do think that over a four-year period, it is not a job for somebody that’s pushing 80. We need somebody that’s younger.”\nThe fourth Republican presidential debate, like those before it, is revealing little about a core issue to many primary voters: immigration and border security.\nA nine-minute segment focused largely on the fentanyl scourge, with Haley and Ramaswamy focused more on China than Mexico as a source of the drug. DeSantis defended his vow to shoot smugglers at the border, even though 90% of fentanyl seized at the border during the latest budget year was at official crossings — not between them — and nearly 3 of 4 fentanyl seizures at the border have been carried out by U.S. citizens.\nThere have been some wrinkles along the way, such as Ramaswamy’s call in the third debate for a border wall with Canada, but candidates were once again largely in lockstep and unwilling or unable to draw contrasts.\nIt is hard to out-Trump Trump on an issue that helped catapult him to the White House and would be a thrust of his second term. He has hinted at mass detentions of people in the country illegally and flirted with resurrecting a policy to separate children from their parents at the border, a bridge that his opponents have yet to cross.\nExpect the issue to become more prominent ahead of the general election, where contrasts with Biden and Democrats are much sharper.\nQuestions about how to handle the conflicts with Hamas and Iran opened a fiery exchange about the candidates’ foreign policy experience and smarts.\nAsked whether they would send U.S. troops to rescue American hostages held in Gaza, Christie answered, “Damn right, I would.” DeSantis didn’t appear to answer the question directly.\nRamaswamy, asked about his position that the U.S. shouldn’t be lending military support to Israel, acknowledged his policy on that was “a little bit different.”\n“Israel absolutely has the right to defend itself without the U.S., U.N. or EU second-guessing its decisions,” he said.\nRamaswamy, who is often faulted for his lack of foreign policy experience, then turned the focus to Haley, a former U.S. ambassador to the United Nations.\n“Foreign policy experience is not the same as foreign policy wisdom,” Ramaswamy said. He followed up with a challenge to Haley to name three provinces in eastern Ukraine, prompting Christie to rebuke him for being rude.\nHaley did not bite on the Ukraine-province challenge.\nThey are facing off for the GOP nomination, but Christie has come to Haley’s defense during his own debate screed against Ramaswamy.\nAfter Ramaswamy repeatedly railed against Haley for what he characterized as her inability to name some of Ukraine’s provinces, Christie called Haley “a smart accomplished woman” and said Ramaswamy “should stop insulting her.”\nChristie also said Ramaswamy would be voted “the most obnoxious blowhard in America.”\nChristie and Haley were both elected governors of their respected states in 2010 and were friends during Christie’s time chairing the Republican Governors Association.\nHaley turned to Christie and seemingly uttered a “thank you” when he defended her.\nJust like in past debates, Christie appears to be the only candidate on stage interested in taking on Trump directly.\nHe was the first to target the front-runner, calling Trump a “dictator” and a “bully” who “doesn’t have the guts to show up and stand here.”\n“The fact of the matter is that he is unfit to be president,” Christie said about 15 minutes into the debate.\nThe former New Jersey governor called out his competitors for ignoring “he who shall not be named.”\n“These three are acting as if the race is between the four of us,” he said. “It’s often very difficult to be the only person on stage who’s telling the truth.”\nThe fourth GOP primary debate began with unusually pointed questions, particularly from moderator Megyn Kelly.\nYou entered the race with so much momentum and are now trailing in the polls. Is it fair to say that voters are telling you not, ‘No,’ but ‘Not now?’ she asked DeSantis.\n“Aren’t you too tight with the banks and the billionaires to win over the GOP’s working-class base, which mostly wants to break the system, not elect someone beholden to it?” she questioned Haley.\nHow could you possibly be the nominee of a party that does not appear to like you very much? Kelly challenged Christie,\nKelly famously tangled with former President Donald Trump during the first debate of the 2016 campaign, when she called him out for calling women he doesn’t like “fat pigs” and “disgusting animals.” The question sparked a yearslong rivalry.\nRamaswamy used his first question of the debate to go directly after Haley, as he has done in previous on-stage clashes.\nAsked if his critiques of other candidates made his candidacy seem less serious, Ramaswamy criticized Haley for being “bankrupt” when she stepped down as United Nations ambassador and then going on to serve on the board of aerospace giant Boeing Co.\nIn response, Haley defended her 10-month service on Boeing’s board, noting that she left during a dispute over COVID-19 bailout funds. “I love Boeing,” Haley responded.\nIn the third debate, Haley called Ramaswamy “scum” after the entrepreneur was critical of her daughter’s use of TikTok.\nDeSantis joined in to criticize Haley, who he said “caves any time the left comes after her, anytime the media comes after her.” DeSantis also opened with criticism of Haley for meeting with executives from investment firm BlackRock.\nHaley said her opponents were “just jealous” of the attention she’s been getting from donors.\nThe first debate question went to DeSantis, who was asked whether he should drop out of the race as his candidacy has failed to close in on Trump’s large polling despite his campaign and super PAC spending large amounts of money.\nThe Florida governor gave an impassioned and defiant answer, declaring, “I’m sick of hearing about these polls.”\nDeSantis said he will win the Republican nomination and said he’s been underestimated before. He said he’s “sick” of Republicans “who are not willing to stand up and fight back against what the left is doing to this country.”\nDeSantis, who has campaigned as a pugilistic candidate, claimed he’s the only Republican presidential candidate who has “beaten” teachers unions, former chief White House medical adviser Anthony Fauci and George Soros, among other targets.\nA diminishing field of Republican presidential candidates has begun its fourth debate of the 2024 primary campaign, the last scheduled debate before the Iowa caucuses kick off the nominating process in January.\nAgain, Trump, the front-runner, will not be on the stage.\nHaley and DeSantis are positioned in the middle, while Christie and Ramaswamy are standing at podiums on the outside.\nThe debate is airing on NewsNation. The cable network is still trying to build its audience after taking over WGN America three years ago. NewsNation’s Elizabeth Vargas will moderate alongside Megyn Kelly, a former Fox News anchor who now hosts a podcast, and Eliana Johnson of the conservative news site Washington Free Beacon.\nTrump is reminding his rivals for the 2024 Republican presidential nomination of his domination of the primary by rolling out new endorsements.\nOn Wednesday, he announced the backing of Sen. Katie Britt, a University of Alabama alumna and former student body president who is widely viewed as a Senate up-and-comer. He was endorsed earlier this week by North Dakota Sens. John Hoeven and Kevin Cramer.\nBritt has never been a Trump critic, but she’s also not a Trump acolyte, and she hails more from the old-guard Republican establishment. Before winning her seat, she was president of the Business Council of Alabama and served as chief of staff to her predecessor, Richard Shelby.\nDropping the Britt endorsement a day that Republicans came to her state and her alma mater is another example of just how overwhelming a favorite Trump is just six weeks before 2024 voting begins with the Iowa caucuses.\nWith Trump absent from Wednesday’s debate, the scene in Tuscaloosa lacks some of the buzz associated with debates in previous years, especially in ostensibly open primaries.\nLess than two hours before the opening salvo, the media room, which is normally the practice hall for the University of Alabama’s Million Dollar Band, was barely half full. The television and radio platforms around the periphery — the spin room, in debate parlance —- were noticeably quiet. It lacked the high-profile surrogates or campaign staffers who might normally be appearing live on cable news or talk radio pitching on their candidates’ behalf.\nOutside Moody Music Hall on campus, more buzz came from state high school football championship games being played in Bryant-Denny Stadium.\nIn case you haven’t noticed, some of these candidates don’t like one another very much. And six weeks before Iowa votes, the increasing pressure to break out, combined with the participants’ animus, could produce fireworks early and often.\nIn the last debate, Haley called Ramaswamy “scum” after he picked on her daughter’s social media habits. Ramaswamy slapped at DeSantis’ choice of footwear. In recent days, DeSantis attacked Haley as the “last gasp of a failed political establishment.” And don’t sleep on Christie, who once upon a time almost single-handedly ended Marco Rubio’s presidential aspirations on the debate stage.\nPerhaps most importantly, the participants also have an opportunity to go after Trump, who will not be on stage to defend himself.\nThey have poked at the absentee front-runner to varying degrees in prior debates, but nothing they have done to date has weakened his grip on the nomination.\nBiden has said it is imperative that Trump doesn’t get reelected to the White House and has framed that as the reason he is running for reelection at age 81.\nBut on Wednesday, asked if another Democrat could defeat Trump in 2024, Biden answered, “Probably 50 of them.”\nBiden declined to elaborate on who else he believed could best the Republican front-runner and former U.S. president. “I’m not the only one, but I will defeat him,” Biden said.\nDemocrats gathered at the University of Alabama for the Republican presidential debate are framing the GOP field as being every bit as extreme as their absent front-runner.\nBiden’s deputy campaign manager, Quentin Fulks, said, “Every Republican on stage tonight is desperate to mirror Donald Trump’s MAGA agenda.” Fulks argued that a Republican administration would hurt middle-class Americans economically and impose a national abortion ban.\nFormer U.S. Sen. Doug Jones joined Fulks at a news conference adjacent to the debate site. Jones was especially critical of Trump suggesting in a Fox News town hall Tuesday night that he would make certain dictatorial moves on “day one” of another White House term.\nJones says the rhetoric from Donald Trump and the far-right agenda are dangerous, and he criticized Trump’s Republican rivals for not condemning his rhetoric. He says their silence allows “dangerous ideologies to fester” and “threatens the very institutions that uphold our democracy.”",
  "word_count": 3248,
  "scraped_at": "2026-02-14T14:08:26.389135"
}