{
  "article_id": "eb2946fde4cb",
  "url": "https://www.dailymail.co.uk/tvshowbiz/article-13231355/Gladiators-fans-fuming-rule-broken.html",
  "title": "Gladiators viewers are left raging after spotting a MAJOR rule break was overlooked by the referee during Duel challenge",
  "date": "20240323T201500Z",
  "domain": "dailymail.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Gladiators' fans were left fuming after spotting a major rule break during the Duel between Giant and Wesley on Saturday's evening semi-final.\nThe gladiator and the contestant battled it all out during the gruelling physical challenge - but viewers were quick to notice Giant used the pugil stick to balance himself and touched the opponent's platform, which is not allowed.\nYet, Premier League Referee Mark Clattenberg ruled 'no rules were broken' as he claimed instead he 'dropped' the stick, causing the audience to boo.\nAnd people at home were also furious about the referee's choice - with some saying Wesley was 'robbed'.\nAnnoyed viewers took to X as one pointed out: 'Mark Clattenberg back to his Premier League Referee root's lying openly that Giant 'dropped his pugil stick' so no rules broken. He had hold the entire time and used it to balance himself. Great cheating, Mark. #Gladiators.'\nGladiators ' fans were left fuming after spotting a broken rule during the Duel between Giant and Wesley on Saturday's evening semi-final\nThe gladiator and the contestant battle it all out during the gruelling physical challenge - but viewers were quick to notice Giant used the pugil stick to balance himself\n'No rules broken! #Gladiators'; 'Wesley's been robbed there #gladiators'; 'I see Mark Clattenburg still making shonky decisions. Giant clearly hadn't dropped his stick. Like watching him ref a game at Old Trafford again. #gladiators';\n'Giant didn't break any rules when he rested his giant cotton bud on his opponents podium! What? Yet when Betty rested hers on her podium weeks ago she was disqualified ! #Gladiators #GladiatorsUK.'\n'Well I would say that the referee made the wrong decision there on #Gladiators, Giant touched Wesleys podium and contenders have been DQ'd for that in the past'; 'There is no way Giant won that Duel... Awful decision! #gladiators';\n'Giant did NOT drop his pugil stick!! That's total bs #Gladiators'; 'I can't believe giant didn't get disqualified! #Gladiators'; 'How can he say Giant dropped his stick and picked it up? He clearly fell and used it to gain his balance!! Wesley was robbed in that! #Gladiators #Duel';\n'Giant became a tripod and used his pugil stick to stay upright.. just gonna think of Giant's pugil stick for a minute #gladiators'; 'Clattenburg bringing his *ahem* Premier League referee skills into #Gladiators. #giant';\n'He didn't drop his stick. He used it to balance himself!! #Giant #Gladiators'; '#Gladiators giant should have lost that event'; 'That should have been a Contender Win!!! Giant put his hand on Wesley's podium!!!! #Gladiators'; 'Giant used his cotton bud to keep him up #Gladiators'.\nYet, Premier League Referee Mark Clattenberg ruled 'no rules were broken' as he claimed instead he 'dropped' the stick, causing the audience to boo\nViewers at home were also furious about the referee's choice - with some saying Wesley was 'robbed'\nGladiator Diamond recently told MailOnline that being called 'skinny' is an 'insult' and believes overcoming childhood bullies has made her the 'strong woman' she is today.\nLivi Sheldon, 29, said she was subjected to cruel taunts growing up over her height but now as a 6ft bodybuilder, she embraces her tall stature, and even wears a 10kg weighted vest while walking her dog to maintain her physique.\nIn an exclusive interview, the BBC star described her younger self as 'lanky' but after playing football from the age of six led to a career in fitness, she built up her strength and now aims to banish stereotypes that women shouldn't have ripped bodies.\nDiamond insists she doesn't pay any attention to online trolls and her focus is on inspiring young women to be stronger and more powerful.\nShe said: 'It's not easy to build muscles so when you work that hard for it you don't want to be knocked down.\nMost watched News videos\n- Extraordinary moment mass brawl breaks out between Brits on flight\n- Finance expert's TV interview interrupted by adorable granddaughter\n- Moment driver veers to target e-bike riders before killing teen\n- Moment Swiss bar fire owners collapse after being confronted\n- Astonishing moment a street is swallowed by a sinkhole\n- Chilling police interview of ISIS fanatic plotting UK attack\n- Food vlogger dies after 'eating toxic devil crab'\n- Spy cam shows woman on her knees next to Jeffrey Epstein\n- Deepak Chopra confronted over his relationship to Epstein\n- Toddler opens car door in traffic and sends biker flying\n- New video shows man with backpack similar to Guthrie kidnapper\n- Israeli hostage reveals how she survived being tortured",
  "word_count": 758,
  "scraped_at": "2026-02-14T12:31:56.800402"
}