{
  "article_id": "eb509a41a1f6",
  "url": "https://urbanmilwaukee.com/pressrelease/wsoc-pulls-away-for-4-1-victory-at-st-thomas/",
  "title": "Wsoc Pulls Away for 4 - 1 Victory at St . Thomas",
  "date": "20250901T054500Z",
  "domain": "urbanmilwaukee.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Wsoc Pulls Away for 4-1 Victory at St. Thomas\nJocelyn Leigh scores in third-straight game\nThe Marquette University women’s soccer team (4-2-0, 0-0-0 BIG EAST) continued its three-match road swing with a 4-1 victory at St. Thomas (2-2-1, 0-0-0 Summit League) on Sunday afternoon in non-conference action.\nMarquette’s aggressive offensive attack finished with 31 shots, 16 of which were on goal. The shot total was the highest since the Golden Eagles fired 24 attempts (17 on goal) against Mercyhurst last year in a 4-0 victory.\nAfter the Tommies evened the score at the 15:48 mark with a strike from the top of the box inside the right post, midfielder Megan Murray tapped home a rebound from her own shot and slid the ball along the turf from six yards out just a few minutes later.\nThe Golden Eagles capped the first-half scoring at the 37:37 mark when freshman Olivia Hernandez and sophomore Jocelyn Leigh teamed up at midfield with some pinpoint passing and the result was a Leigh goal from down the right side from 12 yards out just inside the near post. Leigh’s marker gives her a goal in each of the team’s last three outings (vs. Wisconsin, at Minnesota, at St. Thomas).\nAfter peppering the St. Thomas net for a majority of the second half, Minnesota native Abby Ruhland moved Marquette ahead 4-1 at the 76:34 mark, tapping home a loose ball from five yards out after a cross from Josie Bieda bounced of UST goalkeeper Olivia Rowe.\nUP NEXT: The Golden Eagles conclude their three-match road swing at Kansas City on Thursday, Sept. 4 at 7 p.m. CT.\nNOTES\n- Freshman Coco Dorfman, who redshirted last season at Pittsburgh, made her first-career collegiate start on Sunday afternoon\n- Five of the team’s first seven matches in 2025 are on the road\n- The Golden Eagles, who finished 2-6-1 on the road in 2024, are now 3-1-0 in 2025\nSOCIAL: X | Facebook | Instagram\nJOIN THE CONVERSATION: #WeAreMarquette\nNOTE: This press release was submitted to Urban Milwaukee and was not written by an Urban Milwaukee writer. While it is believed to be reliable, Urban Milwaukee does not guarantee its accuracy or completeness.\nMentioned in This Press Release\nRecent Press Releases by Marquette Athletics\n#MUBB Falls 77-74 at Villanova Tuesday Night\nFeb 10th, 2026 by Marquette AthleticsRoyce Parham finishes with first-career double-double (26 points, 11 rebounds)",
  "word_count": 398,
  "scraped_at": "2026-02-14T12:20:18.375716"
}