{
  "article_id": "eba592615577",
  "url": "https://www.midmajormadness.com/2024/2/29/24086292/umass-departure-for-mac-opens-door-for-potential-atlantic-10-realignment",
  "title": "UMass departure for MAC opens door for potential Atlantic 10 realignment",
  "date": "20240229T154500Z",
  "domain": "midmajormadness.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "As first reported by Nicole Auerbach with the Athletic, UMass will be leaving the Atlantic 10 Conference in all sports ahead of the 2025-26 athletic season.\nUMass departure for MAC opens door for potential A10 realignment\nWith UMass on the way out, here’s a short list for a potential future move to the A10\nOne of the A10’s founding members in 1976 (then known as the Eastern Collegiate Basketball League), the Minutemen and Minutewomen will now compete in the Mid-American Conference alongside the likes of Akron, Buffalo, Ohio and more.\nIn what is undoubtedly a move perpetrated by UMass’ football program, which has won just 10 games total since 2018, the University is actively stepping on years of basketball tradition, history and rivalry.\nThough the A10 has been trending downwards more recently, according to KenPom, it’s a move that’ll see the UMass basketball programs leave a top-10 conference for the 24th-ranked MAC.\nWith just two combined NCAA Tournament appearances between the men’s and women’s sides since 1999, perhaps this transition makes sense for UMass at the current time?\nBut latent with all that A10 basketball history from Marcus Camby and John Calipari to Sam Breen and Tory Verdi, the league won’t be the same without the Minutemen and Minutewomen.\nThat being said, this definitely isn’t a decision that’s unexpected.\nAs A10Talk reporter Michael Bergman spoke about, since going independent in 2016, the school has long pushed its focus toward finding a home for the football program.\nWhile it will greatly benefit UMass football in giving it a new home, the switch could potentially have benefits for the University’s inconsistent basketball programs as well.\nDespite it statistically being a one-bid league which hurts UMass’ overall chances at a Tournament bid, the competition isn’t regarded as highly and may allow for more regular contention in Amherst.\nHowever, with UMass departing, the A10 is now back to just 14 programs which opens the door for potential conference realignment at the mid-major level.\nAs historically one of the multi-bid mid-major conferences, there will definitely be schools interested in the possibility of a move to join the A10.\nHere’s five programs that could be on the radar for a transfer to the A10 given the conference’s recently expanded footprint and current college basketball landscape.\nCharleston\nIn just three seasons at the helm, head coach Pat Kelsey has turned Charleston into a consistent contender in the CAA and one of the nation’s premier mid-major programs. After garnering the Cougars first NCAA Tournament bid since 2018 last season, Kelsey has led Charleston to a 22-7 record this season and atop the CAA’s standings just weeks out from the conference championship.\nAll this recent success has definitely made Charleston a prime candidate to join the A10 in the near future. With a strong finish to the 2023-24 campaign from the Cougars, the door could be wide open next offseason.\nVermont\nAs UMass vacates the conference, the A10’s footprint within the New England area will shrink to just Rhode Island. A way to combat this could be with the addition of another successful program from that region, and Vermont would be a very welcomed addition.\nDespite coming from what many would consider to be a much smaller conference, the Catamounts have dominated the America East for 13 years under head coach John Becker. Headlined by five NCAA Tournament appearances and nine conference regular-season championships since Becker’s hiring, it’s time this program took a step up, and the A10 could now be the perfect destination.\nTemple\nAt the current time, given Temple’s devotion to developing the university’s football program, a move back to the A10 unfortunately doesn’t seem realistic for the Owls. However, I think it’s worth pointing out just how beneficial this could be for a struggling Temple basketball program as well as the A10.\nAfter so much consistent success in the A10 under legendary head coaches John Chaney and Fran Dunphy, it’s been all downhill for the program with a departure for the AAC. Since, the Owls have managed just two NCAA Tournament bids, both under Dunphy, and just a single winning season after forcing him to prematurely retire back in 2019.\nSimilarly to UMass, Temple has struggled on the football field, managing just 10 wins since 2020 which is highlighted by no more than one in-conference win during each of those four seasons. In a move back to the A10, Temple gets a chance to re-establish its basketball program as one of the premier mid-majors while the conference reinvigorates multiple exciting rivalries in its Philadelphia tradition.\nDePaul\nSince leaving Conference USA for the Big East back in 2005, DePaul has failed to win a conference championship or secure an NCAA Tournament bid with the program’s last coming in 2004. As the A10 just recently expanded its footprint to include the Chicago area with the addition of Loyola-Chicago, maybe it’s time the Blue Demons look elsewhere?\nWhile it seems unrealistic, currently bolstering a 3-24 record without a win in conference play, staying in the Big East might be even worse for this Blue Demons program. At that, a move downward to the A10 would still provide DePaul with a solid level of competition to rebuild while giving the conference a program of notoriety to help maintain that multi-bid Tournament status (#ZeroBidLeague).\nUMass-Lowell\nKeeping a program in Massachusetts may be front of mind for the A10’s expansion committee. With a lack of mid-majors finding prolonged and consistent success up there, as our own Sam Federman put it, UMass-Lowell might now be the State’s flagship program. I know Merrimack is certainly in that conversation, but with a move to the MAAC on the agenda for this offseason, another move seems unlikely in the near future.\nHaving transitioned to the DI level only back in 2013, head coach Pat Duquette has quietly turned the River Hawks into an America East contender over the past two seasons. After finishing second last year and losing in the conference final to Vermont, UMass-Lowell is back with a 19-7 record and sitting third in the AEC standings. The River Hawks certainly don’t have the notoriety that a conference like the A10 may be in search of, but could still be a potential option for an institution in Massachusetts.",
  "word_count": 1043,
  "scraped_at": "2026-02-14T13:11:11.346775"
}