{
  "article_id": "eba7a7cc379c",
  "url": "https://www.irishfa.com/news/2023/september/oxtoby-says-ni-will-be-up-for-it-against-republic",
  "title": "Oxtoby says NI will be  up for it  against Republic ... ",
  "date": "20230922T171500Z",
  "domain": "irishfa.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Northern Ireland’s senior women’s team will be aiming to spoil the party when they face Republic of Ireland Women at the Aviva Stadium.\nAround 38,000 fans are due to be at the stadium in Dublin on Saturday afternoon for the Republic’s official welcome home following their appearance at the FIFA Women’s World Cup finals in Australia in July.\nThe Republic, who played well in Australia but failed to register a victory in their three group games, are favourites to win what will be the opening fixture for both sides in the inaugural UEFA Women’s Nations League.\nI'm really looking forward to seeing this group go out and enjoy the game, show what they are all about and be really brave. It will be a really good learning experience to see where we are at\nMore than 1,200 Northern Ireland fans will be attending tomorrow’s game, which kicks off at 1pm and is being livestreamed on BBC iPlayer and the BBC Sport NI website.\nThe hosts are ranked 24th in the world compared to Northern Ireland in 47th position, however Northern Ireland have a spring in their step following the appointment of new manager Tanya Oxtoby.\nIn contrast the Republic will be led by an interim manager, Eileen Gleeson, after the Football Association of Ireland decided not to offer a new contract to Vera Pauw, the manager who led them to the World Cup.\nGleeson, who is also the Head of Women’s and Girls’ Football at the FAI, undoubtedly has a talented squad at her disposal for the Group 1 opener in League B.\nBut Oxtoby is not daunted ahead of the game between the top seeds (Republic) and second seeds in a group that also features Hungary and Albania.\nThe former Chelsea Women assistant boss said at the matchday minus one press conference that she is used to “winning environments” and she wants to carry that into her new role.\nShe pointed out the Republic have a strong squad packed full of professional players, but added that her team will be “up for it”.\nThe new Northern Ireland Women manager said training in the run-up to her first game in charge has been positive, and she believes the team are well prepared ahead of their first ever Women’s Nations League match. She also said all members of her squad are available for selection ahead of the Dublin clash.\nAnd Oxtoby added: \"I'm really looking forward to seeing this group go out and enjoy the game, show what they are all about and be really brave. It will be a really good learning experience to see where we are at.\"\nArsenal Women midfielder Katie McCabe, who captains her country, is among a raft of players in the Republic squad who play in England’s first or second tiers.\nOthers include Everton keeper Courtney Brosnan and Everton midfielder Heather Payne, Birmingham City Women quartet Louise Quinn (goalkeeper), Jamie Finn, Lily Agg and Lucy Quinn (all midfielders), London City Lionesses midfielder Ruesha Littlejohn and Bristol City Women midfielder Megan Connolly.\nTheir squad also features players who operate at the highest level in the USA, including experienced midfielder Denise O’Sullivan (North Carolina Courage) and San Diego Wave forward Kyra Carusa.\nStriker Amber Barrett plays for Standard Liege in Belgium’s top flight along with defender Claire O’Riordan, while experienced defender Diane Caldwell has just signed for FC Zurich in Switzerland.",
  "word_count": 564,
  "scraped_at": "2026-02-14T12:56:06.801808"
}