{
  "article_id": "ebb67654c285",
  "url": "https://impactnottingham.com/2025/11/throwing-is-only-half-the-fun-inside-the-world-of-uon-darts/",
  "title": "  Throwing is only half the fun  - Inside The World Of UoN Darts",
  "date": "20251122T231500Z",
  "domain": "impactnottingham.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Kian Gadsby\nAlthough traditional sports like football and cricket often dominate headlines, one classic pub game has been quietly hitting the mark.\nBuoyed by the popularity of upcoming superstars including Luke Littler and Luke Humphries, Darts has become a global sporting phenomenon in recent years, drawing in crowds and captivating the imaginations of new players.\nDriven by the global progress, Darts has also been on the rise at the University of Nottingham, where the team continue to go from strength to strength.\nA crowd of over 800 spectators were enticed to visit their Varsity clash against Trent back in March, and after a stellar year both competitively and in off-the-board matters, they will be hoping to build on that over the course of the upcoming year.\nIn this article, which is part of Impact’s Students’ Sporting Stories series, we spoke with Liam Geegan, the President of the University of Nottingham’s Darts team, to uncover the story behind the oche.\nIs Darts really a sport?\nWhen discussing Darts, stereotypes are never far from the conversation. With the conversation starting with a discussion about Darts’ status, it was the perfect time to settle the age-old argument about darts’ status as a sport.\nDespite being considered a sport by sporting councils across the UK, it does not have an official BUCS League, meaning the debate rages on at university level.\nHowever, when posed the question, Liam laughed, before responding emphatically and offering a decisive argument for darts to be considered as a sport.\n“It definitely treads a fine line between ‘sport’ and ‘game’ but I do think it is better associated as being a sport due to the competitive nature between you and an opponent.\n“It also has the psychological aspects akin to something like tennis, where one score can completely change the momentum of the game, or a missed chance at a double can allow your opponent to take advantage of the match.\n“As well as having to work on your technique, darts requires some fundamental aspects that you need to work on and improve as you see in other sports, such as precision, consistency and having to stay calm under high-pressure moments of which there are many in closely contested games.”\nHow is Darts played?\nDarts is a straightforward game to understand, with its simplicity making this sport so entertaining for spectators.\nHowever, the game goes beyond simply throwing darts at a board. It’s far harder than athletes make it appear, as it requires technical precision and mental agility to constantly change strategies and quickly reach the target score.\nWith the intricacies of the sport often being hidden from mainstream media attention, especially at the University of Nottingham, I asked Liam to explain how darts is played and introduce the sport for any readers who are unfamiliar with the game.\n“Darts is a simple concept that is difficult to execute and requires a lot of practice to improve.\n“It has many different ways to be enjoyed, whether that be the traditional and most famous X01 game, where the objective is to score as many points as you can with three darts (usually aiming for the inner treble 20 segment) and to ‘checkout’ your exact score using an outer double segment. For example, if you had scored your way down to 40, you would try to hit double 20 to win the ‘leg’. The first to however many legs you and your opponent are playing to wins.\n“However, this is not the only way darts can be played. For those at an intermediate level, Cricket – involving hitting treble and double segments faster than your opponent to score more points – can be played as an effective practice or competitive game.\n“Or for a more amateur player, ‘around the clock’ – hitting each segment in numerical order before your opponent does is a fun starting block that is easy to understand and track.\n“As long as you have access to a board and 3 darts, there is an endless possibility of different practice games or casual games you can do.”\nHow does a Darts journey begin?\nMost sporting stories start with a captivating experience at an early age, and Liam’s is no exception.\nHe excitedly told his story about how his love for Darts started from interest around the house, but his interest rose dramatically when he joined the team at university.\n“There was always a dartboard in the house growing up, so I was throwing darts without really thinking of playing from a young age with my family.\n“Also, the World Championships being broadcast throughout the Christmas period was also a mainstay in the house. So, I had an appreciation and a full understanding of it by the time of my mid-teens with very limited ability or even a proper set of darts.\n“But what really piqued my interest to play properly and pay more attention to it was after the Michael Smith 9 Darter in the proclaimed ‘Best Leg of Darts Ever’ during the 2023 Final.\n“A final push on Freshers Week from the welcome stall and I was completely hooked.\n“Surrounded by like-minded people who all enjoyed the different aspects it has to offer, whether that be playing, watching or using it as an excuse to meet up and share the good and bad life throws at you.”\n“The best part being the accessibility of the game, whether that be in your own home, or with someone else in theirs or one of the many pubs that have a board.”\nDespite being an experienced player, when asked for standout memories, it was a moment from his time at university that sprang to mind.\nHe said that his highlight was when he was tasked with counting the score for a match between professionals Devon Peterson and Connor Scutt during the Varsity showcase, as watching the two superstars duel in front of his eyes was a captivating experience.\n“For me personally, I got to score a game between two professionals up on stage in front of over 800 people during our varsity event, which was quite surreal seeing them throwing up close whilst still having to count and mark on a whiteboard.\n“On top of this, each year members of our society get to play with one of these pros for a leg on stage before our 9 best go up against NTU’s 9 best in a head-to-head varsity.”\nWhat does it mean to wear the Green and Gold shirt?\nWhen considering the reputation of the University of Nottingham, its sporting prowess is one of the first things that springs to mind.\n25 teams wearing the famous Green and Gold are currently National Champions, while scintillating victories in Varsity against rivals Trent and in Trophy finals on BUCS Big Wednesday only embellish the glorious reputation of the institution.\nThe University of Nottingham is currently second in the University Sports Rankings, behind Loughborough, who secured their 44th consecutive title. However, after a record-breaking year which saw 31 UoN teams compete on BUCS Big Wednesday, the gap is rapidly closing.\nThese successes add to the weight of the shirt, and, especially in an individual sport such as darts, can make putting on the jersey a daunting prospect.\nHowever, although Liam acknowledged the importance of the shirt, he said that his teammates and the people surrounding him are far more significant.\n“It means a lot, particularly putting the t-shirt on for the first time.\n“The enjoyment when you win with all your mates and you can celebrate afterwards. Stepping up to checkout a crucial leg and having your teammates celebrate with you straight after or immediately console you if you miss.\n“Representing the Uni, particularly in such an individual sport such as darts, makes the team closer together and greater bonds as everyone is working towards the same objective and wants to see our teams climb up the rankings.\n“But more importantly, everyone knows what it’s like to lose big games and representing UoN means you’re not alone and there’s always someone to pick you up if you’re on a losing side. As much as everyone is there to celebrate with you after a big win.”\nLast year’s successes – progress across the board\nDespite not securing silverware, the UoN Darts team were happy with their progress.\nThere was improvement across the board, especially in the B team, and with the foundation of a women’s side, the club were finally improving their inclusivity.\nHaving played a critical role last year, pride radiated through Liam’s tone as he offered an insight into their successes.\n“All of our teams did very well last season, a huge improvement on recent memory: Our A’s only lost one game in the league phase before exiting Nationals unfortunately on Leg difference.\n“Our B’s, despite only winning 2 games in the 23/24 season, won 11/22, marking a major improvement for both sides. On top of this, we were proud to be one of the first Universities in the country to establish an all-women’s side, something we hope to grow in the coming years.\n“So we were very happy overall as there was a noticeable improvement in standard from everyone throughout the year.”\nEyes on the prize: What’s next for the club?\nNot content with their improvement, the Darts team are hoping to continue to progress heading into the new season.\nAs treasurer last year, Liam had a personal involvement and played a crucial part in the teams’ improvements last season. Now, as President, he hopes to use his new power to take the team to new heights.\n“We have goals in different aspects of the all-round society,” Liam declared, as he acknowledged his ambitions for the new season both on and around the board.\n“Firstly, from a competitive viewpoint, we want our teams to repeat their league forms and be more competitive on other fronts as well.\n“Last year we were stunned in the first round of the cup so are looking to go deeper this year. The Varsity trophy has eluded us for 5 straight years, so we want to go and get it back in 2026 in what will hopefully be a more neutral venue.\n“We have a strong crop of players that are still studying at UoN this year, so there is optimism about once again qualifying for nationals, going much deeper in the cup and winning back the Varsity Trophy.”\nAs a classic pub game, Darts is renowned as a social sport. This creates an unusual pressure for the Darts society amongst sports teams, as they face pressure to uphold that reputation by acting as a hub which goes far beyond the competitive team.\nAs President, Liam is looking to enhance that stereotype. The passion shone through his tone, as he spoke about this alongside his ambition to make the sport more attractive to those beyond typical darts players.\n“From an inclusion viewpoint, we want to grow our women’s team and show that Darts is a super community for everyone.\n“It has the stereotype of just being a pub game for beer-belly middle-aged men but our society couldn’t be further from that.\n“With a fantastic mix of people from all backgrounds and all abilities ranging from people who, when they started, struggled to hit the board, to people who fire in effortless 180s, we want to keep ensuring that darts thrives as a great social group and a brilliant place to meet new friends no matter what your gender, background or interest in the sport may be.\n“From a charitable viewpoint, last year we held our biggest Movember event, raising over £3,000.\n“We want to continue the magnitude of this event and try to grow it even further with more people watching and donating to a brilliant cause.\n“We also want to keep working with the charity Matthew22, researching Bone Cancer treatment in memory of Matthew Hollingworth, that has remained close to this society and was even used by our governing body UDUK as a main charity in a recent event.”\nThinking of giving it a go?\nAs the interview wrapped up, I asked Liam if he had any advice for students who were considering joining the darts society.\nWhilst grinning, possibly reminiscing about how he was convinced to take up the sport, Liam took the opportunity to urge new students to join his society.\n“Do It!!! It can be quite daunting to start as 99% of the time, those who pick up darts for the first time struggle to play through a leg but after a bit of practice it can be the most fun low effort activity with high reward – the moment you hit your first ‘checkout’, first bullseye, first 180, it will leave you with that feeling of wanting more.\n“Plus, throwing darts is only half the fun. The communities around darts and social settings make it a perfect place to talk to people both about darts or anything else. The vast majority of people do not care about your ability and many will help you with tips about the playing or counting aspect.\n“It’s a highly enjoyable activity and can be a great way to help your mental health.”\nWith a stellar squad, an ambitious president, and an exciting plan of action, the Darts society appears destined to enjoy its best year yet.\nHave you been inspired to give it a go? Make sure you check out the Darts society’s Instagram page @uondarts for further information about how you can join the team.\nKian Gadsby\nFeatured image courtesy of UoN Darts. No changes were made to this image.\nIn article image 1 courtesy of @uondarts via Instagram. No changes were made to this image.\nIn article image 2 courtesy of @uondarts via Instagram. No changes were made to this image.\nFor more content including uni news, reviews, entertainment, lifestyle, features and so much more, follow us on Twitter and Instagram, and like our Facebook page for more articles and information on how to get involved.\nFor further sports content and ways to get involved, follow @uonimpactsport on Twitter and Instagram, and like the Impact Sport Facebook page!",
  "word_count": 2355,
  "scraped_at": "2026-02-14T12:50:56.919265"
}