{
  "article_id": "ebee21e0e69e",
  "url": "https://newtelegraphng.com/2023-caf-awards-osimhen-oshoala-nnadozie-abiodun-in-final-top-3-nominees/",
  "title": "2023 CAF AWARDS : Osimhen , Oshoala , Nnadozie , Abiodun in Final Top 3 Nominees",
  "date": "20231208T013000Z",
  "domain": "newtelegraphng.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Salah, Hakimi Threatens Eagles Striker’s Chances\nIt Will Be Daylight Robbery if Napoli Forward Loses, Says Pascal\nNapoli striker Victor Osimhen has been named as one of the final three nominees for the CAF Player of the Year award. The General Coordinator of the Super Eagles, Patrick Pascal, believes that it would be a robbery if Osimhen didn’t win the title. The Confederation of African Football (CAF) announced yesterday that Osim- hen will have to compete with Mohamed Salah of Egypt and Liverpool, as well as Ashraf Hakimi of Morocco and PSG for the men’s top award at an event slated for next Monday in Morocco.\nThe last Nigerian star to win this prestigious award was Nwankwo Kanu in 1999. Other winners included Rashidi Yekini, Emmanuel Amuneke, and Victor Ikpeba. Pascal believes that Osimhen deserves to win the award, given what he achieved in the year under review. He finished ahead of any African in the Ballon d’Or race, and denying him the award would be the biggest robbery in the history of the award. “I feel like we don’t celebrate our achievements enough.\nI’m surprised that the hype around Osimhen’s nomination for the Ballon d’Or has died down so quickly. However, it would be great to see him win the title of the best player in Africa. He deserves it! Who else has accomplished as much as he has in the past year? He played a significant role in leading Napoli to their first league title in 33 years and even became the highest goal scorer in the African Cup of Nations q u a l i f i e r s .\nPeople are talking about the World Cup, but none of the Moroccan players ranked higher than Osimhen in the Ballon d’Or. We witnessed a great team effort from Morocco in Qatar. No individual player stood out in that team,” he said. Meanwhile, three Nigerian players have secured spots in the final shortlists for the upcoming CAF Awards across various categories. These players are Asisat Oshoala, Chiamaka Nnadozie, and Deborah Abiodun.\nAsisat Oshoala is already a record five-time recipient of the African Player of the Year (Women) accolade, and she continues to make history. She finds herself in the top three once again, facing off against South Africa’s Thembi Kgatlana and Zambia’s Barbara Banda. Although Super Falcons’ goalkeeper Chiamaka Nnadozie fell short of the Player of the Year shortlist, she remains in contention for the Goalkeeper of the Year honour. Nnadozie is poised to challenge Khadija Er- Rmichi of Mo- rocco and South Africa’s Andile Dlamini for the coveted shot-stopper prize.",
  "word_count": 434,
  "scraped_at": "2026-02-14T12:40:32.071413"
}