{
  "article_id": "ebfcf1680742",
  "url": "https://www.rollbamaroll.com/2023/8/16/23834002/girthy-gump-day-jumbo-package-quarterbacks-have-still-not-seized-the-opportunity-in-front-of-them",
  "title": "Girthy Gump Day Jumbo Package : Quarterbacks have still not seized the opportunity in front of them",
  "date": "20230816T153000Z",
  "domain": "rollbamaroll.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "I didn’t even try to call today Gump Day — in your heart, know it to be true. But Coach Nick Saban’s fiery press conference at the conclusion of the Tide’s practice yesterday was not one that engendered much confidence in any of the quarterbacks vying for the vacant starting role.\nGirthy Gump Day Jumbo Package: Quarterbacks have still not seized the opportunity in front of them\nDon’t shoot the messenger\nNor, does it appear, any of them have stepped up to seize the opportunity in front of them. As Saban said yesterday, who starts will be a matter decided by the play of the quarterbacks, not by the coaching staff:\nYes, Saban ultimately has to make a choice alongside offensive coordinator Tommy Rees. But pressure has been shifted to the quarterbacks for the time being. Saban is calling on Buchner, Milroe, or Simpson to step up and make his life a whole lot easier.\nAs for the recent fall scrimmage, Saban did not distribute too much information. No stats were given, with Saban saying he was “not a stats guy.” Instead, he wanted to get back to the facilities and review the film. Based on his Tuesday evening answer, there must have not been any separation created from any of the three.\n“What I tell the quarterbacks is it’s not up to the coaches,” Saban said. “You’re looking over your shoulder to see if a coach is going to do this or that? How be you forcing me to play you? Force us to play you. When you get your reps in, you get a chance to play, you play so good we don’t have any chance but to play you rather than worrying about all this other stuff.”\nNew beat guy, Matt Stahl, has summarized what has been holding back Ty:\nThe redshirt freshman is the youngest of the three contenders. With appearances in four games last year, with just five pass attempts, Simpson simply doesn’t have the seasoning that Milroe and Buchner do.\nDuring the spring, Saban stressed the need for Simpson to continue progressing.\n“Ty’s a young guy,” Saban said. “He’s really conscientious, really trying to learn, but just needs to continue to get more and more opportunities in practice so that he can gain the confidence that he needs to be able to go out there and play.”\nSimpson also isn’t as athletic as Milroe, so if Saban and company put a premium on that part of the game, he might be at a disadvantage.\nAnd though official stats weren’t released, there was plenty of scuttlebutt following ‘Bama’s first scrimmage last week about the other contenders. Here are some takeaways from Talty:\n—Jalen Milroe looked the best of the three QBs competing for the starting job. Our sources put him at 3 TDs for the day (two passing, one rushing) including a long touchdown pass to Jermaine Burton. Some of the damage came against the second-team defense, but Milroe was solid and competent from all accounts.\n—Ty Simpson started slow and wasn’t able to do a ton against the first-team defense when he went in. He missed a couple throws he should have hit, but was solid overall and had a touchdown pass to tight end Amari Niblack. Did some good things with his legs + scrambling, too.\n—Tyler Buchner struggled from what we’ve been told including throwing an interception into triple coverage. One person we talked to expressed a lot of doubt in Buchner becoming the starter after watching him today.\n—Dylan Lonergan isn’t going to be the starter this season, but he earned strong reviews today. He had an impressive outing and there was optimism if he can keep improving, he could be a real factor in the battle for the position next season.\nIf you recall, we were pretty upbeat about Lonergan in our Spring Position Preview. Despite him being the rawest prospect, he is a very smart player. His mobility opens up the offense a great deal for intermediate passing, though his arm isn’t the strongest.\nHe doesn’t have the best arm strength and deep ball, but he has a very nice touch inside of 20-25 yards, with a sweet little drop-pass that he can doink over the top of defenders in the zone. Unusually for an RPO player, Lonergan also reads zones well. He doesn’t make mistakes that beats his team on the play, but his arm strength does somewhat curtail the offense.\nIt will really depend on what kind of scheme Rees wants to run, but Lonergan reminds you most of a former Notre Dame signal-caller: Ian Book. If Lonergan wins the job, you can expect a more RPO-heavy scheme, with more PA West Coast passing concepts kept within 10-13 yards from the LOS and plenty of keepers, particularly up the middle when the second level turns their back to the play: YAC is the name of his game, not air yards. Remember Blake Sims? That kind of offense.\nSo, what do we make of all this? It very much appears to be setting up a reprise of 2016 and 2017.\nYou have the mobile QB with the arm talent, who is just not making enough plays consistently to seize the starting job despite being the favorite. You have the athletic QB with a cannon for an arm, who is an immovable load, but oft struggles running the offense. You have a promising freshman on the bench waiting for his chance next season. You have the star in waiting playing his Senior year of high school ball, and is probably going to come in and unseat his veteran competition.\nAnd all of that is bookended by a deep running game, and a natty-type defense.\nFeels a whole lot like 2016, doesn’t it?\nBut, don’t despair about no one seizing the starting job just year, or the fact that the winner of the gig may not even be one of identified superstars.\nWhy?\nBecause, as F-Bomb noted yesterday, Alabama’s national titles have never ran through superstar QBs. In fact, three superstars lost title games. Meanwhile, guys like Coker and G Mac are wearing some big-ass jewelry from Josten’s:\nFinebaum said it’s quite possible one emerges, plays well and Alabama is once a bonafide playoff contender. But he noted they might be one anyways.\nNick Saban has appeared in nine national championship games — BCS or CFP — in his time at Alabama, winning six. The quarterbacks he has won national titles with: Greg McElroy (2009), AJ McCarron (2011, 2012), Jake Coker (2015), a combination of Hurts and Tagovailoa (2017) and then Jones (2020).\nThe starting quarterbacks in the three national title games that Saban lost: Hurts (2016), Tagovailoa (2018) and Bryce Young (2021).\nFinebaum agreed with Barrie that there might be some credence to the idea that Saban and Alabama have more consistently achieved with slightly lesser quarterbacks, albeit amid a litany of other variables.\n“In some ways they are, yeah,” Finebaum said. “I would probably take them to go to the playoffs right now with a shot at the championship.”\nPawwwwwl has mastered the art of infuriating his audience while giving them just enough to keep coming back for more. The man is a master of his craft: half-earnestness, half-shitposting. He’s an aggravating national treasure.\nPeople are worried about QB — I’m far more concerned the veteran status will win-out over meritocracy along the offensive line. But, that appears to not be the case. Proctor seems to be angling for a spot at tackle, and interestingly, they’ve flipped Book from RG to LG.\nFrom Tony T:\nPlease Baby Paul Bryant in His manger, let this be the answer. My soul simply cannot handle a third straight year where the line play is cheeks,\nCrootin’ szn\nTwo blue-chip ‘Bama prospects / finalists have set their commitments dates:\nI would be stunned if ‘Bama landed Bussey, TBH. He’s the No. 2 athlete in this class, is from Texas, and the Horns have long been thought to have the inside track. Finalists are: Texas, Oklahoma, Texas A&M, LSU, and Alabama\nThe next one is far more promising. Four-star, in-state Edge Jordan Ross will also be committing soon:\nThis one is a true toss-up, with Alabama and UT thought to be the leaders going into the clubhouse.\nSaban is all-good with punt returner — as well he should be; Alabama returns the nation’s best back there in Kool-Aid. Kick returner, however, that is a bit of a mess that Saban just doesn’t seem too upset by.\nThe kickoff returner spot less settled at the top. Jahmyr Gibbs handled most of the role for Alabama last season, but he’s off to the NFL’s Detroit Lions.\nSaban mentioned wide receivers Kendrick Law and Emmanuel Henderson as players who could take over at kickoff returner for 2023. He also noted he’s not particularly worried about the spot.\n“We’ll just have to see how that part of it develops, but I think we’ve got enough good skill guys that we should be able to come up with some pretty good return guys,” Saban said.\nIn other words, it is much as I wrote three weeks ago: Given that literally every other part of the Tide’s special teams game is superb, the lack of a game-breaking KR just isn’t something that’s going to faze the staff. There are bigger battles to wage:\nWhether the Tide is punting, covering, kicking, or reeling in punts, ‘Bama is in great hands. Perhaps the best we’ve ever seen under Nick Saban. Sure, a kick returner emerge would be great to see. Special teams represent instant field position and momentum-devouring cheap scores that can win you a game...or cost you a game\n. Looking at you Tennessee, Texas A&M.But given the rest of ‘Bama’s strengths, I think we can live with merely average here.\nLook, I know we’ve promised for a decade now that tight end really, truly will become a meaningful part of the offense. But, might this be the year?\nMismatch machine Amari Niblack may just force the staff’s hand on this one:\nSaban reiterated his praise for sophomore tight end Amari Niblack.\n“He is a mismatch player in the passing game,” Saban said Tuesday. “He’s done a really good job.”\nFlashback to Aug. 3, 12 days ago, when Saban first met with the media to kickoff fall camp.\n“Amari has really made a lot of improvement,” Saban said then. “He’s kind of a mismatch player a little bit in the passing game, which is a good thing.”\nNiblack, a 6-foot-4, 233-pound Florida native, may be primed for a big 2023 season. He was a standout performer in Alabama’s scrimmage last Saturday and regularly ran with the first- and second-team offense during Alabama’s open practice a week earlier.\n“He’s doing great,” Saban reiterated on Tuesday. “He’s gotten bigger, he’s gotten stronger, he understands the offense a lot better … he was very productive in the first scrimmage, and he is blocking better.”\nAlabama Women’s Soccer enters its season the No. 7th ranked ream in the nation, fresh off of last year’s amazing run. They are also tabbed to be the runner-up to No. 3 Arkansas in the SEC.\nThe Alabama soccer team is receiving national attention as the program looks to build off a successful run last season which included an SEC regular season championship and the program’s first-ever College Cup appearance.\nAlabama, which enters the game as the No. 7 ranked team in the United Soccer Coaches preseason poll, the highest preseason ranking in program history, will open the season Thursday night (7 p.m. CT) against DePaul.\nAdditionally, the team was tabbed to finish second in the Southeastern Conference by league coaches.\nCoach Wes Hart has been a slow-burning miracle worker at the Capstone.\nWanna’ catch some photos of practice from the week? Right here.\nAnd, Finally, it’s the one-year anniversary of Coach Mike Leach’s passing. No one who knew him had a bad thing to say about the man.\nWith his passing, the sport became a lot less interesting, and the world a little dimmer.\nSwing your sword on the rainbow bridge, Coach.\nThere will be many remembrances and anecdotes and funny stories about Coach Leach over the coming days. They will chart his quiet but meteoric rise from a Pepperdine law grad to offensive powerhouse. We will be treated to countless Xs and Os features regarding his coaching acumen — and they are all deserved. His turn of phrase, his eccentricities, his interests will all be lain bare for public consumption.\nBut there will not be nearly enough tales told that emphasize his humanity. If Leach’s charm lie anywhere, it was in his authentic humanity and ability to just be a regular guy. The sort of character that everyone knows, very few really understand, but with whom a brief brush makes our lives the better for it.\nAs former WSU beat writer, John Canzano, wrote yesterday, Mike Leach said of coaching and parenting, “you gotta be present and genuine. Kids can sniff out a fake a mile away.”\nCoach Leach was anything but a fake; we are diminished by his absence.",
  "word_count": 2193,
  "scraped_at": "2026-02-14T13:37:53.155986"
}