{
  "article_id": "ec2c913402cb",
  "url": "https://greatbendpost.com/posts/2b572fc5-9975-4979-891e-44197f5ce0b3",
  "title": "Saturday Sports Headlines and Scores presented by Barton Community College",
  "date": "20240803T164500Z",
  "domain": "greatbendpost.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "DETROIT (AP) — Salvador Perez had three hits, including a home run, and the Kansas City Royals won their fifth straight by routing Tarik Skubal and the Detroit Tigers 9-2. Cole Ragans (8-7) held the Tigers to two runs on two hits in 5 2/3 innings. Skubal (12-4) allowed a season-worst five runs on seven hits in 6 1/3 innings. He struck out eight. The Royals chased Skubal in a six-run seventh inning that included nine straight hits, two stolen bases and a wild pitch. Justyn-Henry Malloy hit a two-run homer for Detroit in the first inning.\nCHICAGO (AP) — Christian Bethancourt and Michael Busch homered in a five-run second inning and the Cubs spoiled the Cardinals’ debut of new acquisition Erick Fedde as Chicago stretched its winning streak to three games with a 6-3 victory over St. Louis. Tyson Miller (3-1), the first of four relievers, earned the victory and Héctor Neris picked up his 15th save as Chicago won its third straight game against its NL Central rivals. The Cubs’ big inning came against Fedde (7-5), who was acquired earlier in the week from the White Sox in a three-team trade. The 31-year-old right-hander gave up the first five runs and six hits and finished with four strikeouts in five innings.\nCINCINNATI (AP) — Blake Snell pitched his first career no-hitter on Friday night, striking out 10 as the San Francisco Giants beat the Cincinnati Reds 3-0. The reigning NL Cy Young Award winner walked three and threw 114 pitches, 78 for strikes, in his first complete game in 202 major league starts. The 31-year-old Snell recorded the 18th no-hitter in Giants’ franchise history and the third in the majors this season. Casey Schmitt and Tyler Fitzgerald homered for the Giants.\nNEW YORK (AP) — Yankees second baseman Gleyber Torres was removed from an 8-5 loss to Toronto by manager Aaron Boone for not hustling, sending a message to the clubhouse of a team that has struggled since mid-June. Torres did not run hard out of the batter’s box on his second-inning drive off the left-field wall, thinking it was a home run, and reached only first base. That cost the Yankees a run when he was thrown out at the plate trying to score on Anthony Volpe’s two-out double into the left-field corner in the second.\nST. JOSEPH, Mo. (AP) — There’s nothing new about Patrick Mahomes and the Kansas City Chiefs having a dynamic offense, but this year’s training camp presents a new opportunity for Kansas City to sharpen its attack. Mahomes has to face a defense that was the higher-ranked side of the ball for the Chiefs last season. Last season, Kansas City won its third of the past five Super Bowls with unprecedented balance. Mahomes’ unit was ranked ninth in the NFL and Spagnuolo’s defense was second. The goal for the Chiefs this season is to maintain that consistency on both sides of the ball.\nCOLUMBUS, Ohio (AP) — Ohio State opened camp on Thursday with the usual towering expectations but also a heavy sense of urgency built up over the three consecutive seasons blown up by losses to Michigan. The Buckeyes finished 11-2 in each of those campaigns but failed each time in their primary mission of beating Michigan and advancing to the Big Ten championship game. Coach Ryan Day insisted the urgency isn’t any greater than in other preseasons during his six-year tenure. He said this year's team will be built with an eye toward making sure its best football is being played in the last few critical games.\nUNDATED (AP) — Former Michigan State University head football coach Mel Tucker is suing the university and school leaders, saying they wrongfully fired him and violated his constitutional rights in response to sexual harassment allegations. His federal lawsuit filed Wednesday in Michigan says they undertook an “improper, sham investigation” last year after rape survivor and activist Brenda Tracy accused him of sexually harassing and exploiting her. He also says they violated his employment agreement with the school, and he's asking for damages. The Associated Press emailed a Michigan State spokesperson and members of the school’s legal department Thursday seeking comment.\nOLYMPICS\nVILLEPINTE, France (AP) — The allegations that Olympic boxers Imane Khelif and Lin Yu-ting failed an eligibility test for women's competition have been made by only the International Boxing Association. That's also the only governing body that has ever been completely banished from the Olympics. The entire boxing world has already learned to expect almost anything from the Russian-dominated organization, whose untransparent tests have been seized upon by those criticizing the female boxers amid wider clashes about gender regulations and perceptions in sports. The IOC has decades of bad history with the beleaguered governing body, and it has exasperatedly begged non-boxing people to pay attention to the sole source of the allegations against Khelif and Lin.\nPARIS (AP) — The Paris Olympics at the halfway mark have brought the world “The Pommel Horse Guy,” a rugby star and social media sensation who wants to be on on reality show “Love Island” and “The Real John Wick” in the form of a 51-year-old Turkish shooter. These Olympics have been full of memorable moments since the dazzling opening ceremony: a gender controversy in boxing, the Seine River was too dirty for the triathlon swim to go on as scheduled and Leon Marchand led France with four golds in four swimming events. And of course, Simone Biles has dazzled while winning two gold medals with more still up for her taking.\nSAINT-DENIS, France (AP) — Joshua Cheptegei of Uganda took the lead with a little more than a lap left in a masterpiece of a 10,000-meter race to finish in an Olympic-record 26 minutes, 43.14 seconds in front of a roaring crowd on an electric opening night at the track. The world-record holder raced in the middle of a strung-out pack for most of the 25 laps on the calm, cool evening at the Stade de France. Then he took off, and held the lead over the final 500 meters against a crowd of Ethiopians who set a blistering pace all night. Ethiopia's Berihu Aregawi beat American Grant Fisher in a sprint to the line for silver. Fisher’s bronze medal marked the first for the U.S. in the longest race at the Olympic track since Galen Rupp took silver in 2012.\nSAINT-DENIS, France (AP) — Bobby Kersee's known as the “mad scientist” for his outside-the-box training methods. He's concocted a winning formula that’s struck gold for some of the biggest stars in track history. Back in the day, he worked with Florence Griffith Joyner, Al Joyner, Gail Devers and his wife, Jackie Joyner-Kersee. In more modern times, it was Allyson Felix. Now, it’s Athing Mu and McLaughlin-Levrone, who’s his only athlete at the Paris Games. Kersee’s athletes have taken home at least one gold medal in every Olympics since the 1984 Summer Games.\nNANTERRE, France (AP) — In another disappointment for the American swim team, Simone Manuel has been eliminated in the preliminaries of the 50-meter freestyle. Manuel posted the 18th-fastest time in the hectic sprint over one length of the pool, not good enough to make it to the evening semifinals. The first Black woman to win an individual gold medal in swimming touched in 24.87 seconds, 0.15 out of the time she needed to crack the top 16 and a whopping 1.02 behind the fastest qualifier, Sarah Sjöström of Sweden. The United States comes into the next-to-last day of the competition with 21 medals but only four golds, falling short of expectations for the world’s dominant swim nation.\nFRIDAY SCORES\nMAJOR LEAGUE BASEBALL\nINTERLEAGUE\nFinal Oakland 6 L.A. Dodgers 5\nFinal Seattle 10 Philadelphia 2\nFinal N.Y. Mets 5 L.A. Angels 1\nAMERICAN LEAGUE\nFinal Kansas City 9 Detroit 2\nFinal Cleveland 8 Baltimore 4\nFinal Toronto 8 N.Y. Yankees 5\nFinal Minnesota 10 Chicago White Sox 2\nFinal Houston 3 Tampa Bay 2\nFinal Boston 11 Texas 6\nNATIONAL LEAGUE\nFinal Chicago Cubs 6 St. Louis 3\nFinal San Francisco 3 Cincinnati 0\nFinal Atlanta 5 Miami 3\nFinal Milwaukee 8 Washington 3\nFinal Arizona 9 Pittsburgh 8\nFinal Colorado 5 San Diego 2",
  "word_count": 1372,
  "scraped_at": "2026-02-14T12:42:16.184578"
}