{
  "article_id": "ec309086ccbd",
  "url": "https://www.the42.ie/amber-barrett-5-6397072-Jun2024/",
  "title": "  Amber has a lot more goals to score for Ireland  - Barrett bullish for Sweden rematch",
  "date": "20240603T060000Z",
  "domain": "the42.ie",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "AMBER BARRETT WEARS her heart on her sleeve.\nShe’s one of those players you’re delighted to see coming through the mixed zone after a game as you don’t get the usual clichés, soundbites and stock answers.\nThere was no shortage of them after Ireland’s 3-0 defeat to Sweden at the Aviva Stadium on Friday night.\nThen, along came Barrett, after a somewhat surprising start and 84-minute shift.\nThe in-form Standard Liège striker began by airing her obvious frustration, and immediately jumped to the feeling on an individual level, rather than insulating herself with the collective.\n“Usually, they say when you miss a chance, you have to forget about it. But I don’t think I’ve forgotten about the header yet because it’s a chance that any other day, I’d be very confident to put it away.”\nThen it was straight to righting the wrongs in Tuesday’s rematch in Stockholm [KO 5.30pm Irish time, live on RTÉ 2] and most importantly, getting points on the board.\nBarrett spoke about the belief just creating those chances should instil — and casted her mind back to a seven-game, 16-month losing run under Vera Pauw “before everything fell into place”.\n“This is a massive transition,” she insisted. “Look at the quality of players we’re playing against. This team is good enough. But again, look at the change of players coming through the last few months — we’re all building a relationship, that also takes time, but it will come.\n“We’re all good enough players. Lily [Agg] knows she should score, I know I should score. It would be worse if we were sitting here saying, ‘Oh well, next time.’ We know we need to be better. And I think that’s the attitude that we have here. As long as that attitude stays, we’re always going to keep improving.”\nBarrett certainly has that attitude as an individual. The 28-year-old hasn’t had the most straightforward journey in professional football across Germany and Belgium,, but she won’t shy away from it.\nShe has spoken openly about her struggles since spreading her wings from Peamount United and the Women’s National League, having also excelled in Gaelic football and athletics.\nThat, perhaps, made the 2023/24 season all the sweeter. She finished her debut campaign at Standard Liège with 19 goals, and as the Belgian Women’s Super League’s second top goalscorer as they finished runners-up.\nEileen Gleeson handing her a rare start as one of two strikers — and likely her longest international appearance ever — was a massive confidence booster on Friday.\n“Personally it’s been the best season I’ve had since I went over [to mainland Europe] and in hindsight, I think where would I be if I’d been playing consistently in the past five years? At the same time, I’m ferociously proud for getting myself to this stage.\n“I’ve had loads of setbacks. I spoke about last year, about Postdam being terribly negative, with a lot of people putting me down. I just went somewhere people probably questioned the level but I’m playing every week and valued as an important player in the team. We’re pushing for a league trophy too so what type of person doesn’t want to be in that environment?\n“I came into camp with probably the most confidence I’ve ever had. That’s something I’ve to build on. I need to know that those chances come few and far between and I’ve to put them away.”\n“It does fill you with confidence,” the Hampden hero continues on her recent goal-scoring exploits at club level, “but me being me, I spend more time thinking about the ones I should have put away.\n“I want to be in teams that create chances. We’ve some good teams, Leuven and Anderlecht, over the past few weeks and I had a lot of nice compliments from opposition players and coaches. I’d been starved of that since I started professional football.\n“When I had Colin Bell as coach, he always said that whatever I do, don’t lose your patience. It’s easier said than done but I’ve always been very patient.\n“19 goals is 19 more than I scored last year. You have to take confidence from that.”\nBarrett doesn’t regret that move to Potsdam, having made friends for life, but focuses on lessons learned and the importance of the right environment for players to thrive in.\n“If you don’t learn the hardest of hards, as in how to deal with them, you’ll never get the highs,” she says.\n“It doesn’t matter if you’re playing for the best team in the world or a Sunday league team, if the player is enjoying it you’ll get the best from them.\n“You have the create the right environment for a player. You can say they’re not good enough but have they created the right environment? When the answer is no, they have to look at themselves but that’s not always the way people work or operate.\n“I’m very self-reflective. I know when I’ve been terrible, when I’ve not been good enough and should have been better. But I’m also aware to know that I’d been actually very good that day or I should be really proud of myself.\n“Going forward, I need to bring that belief. Having the support of my team-mates is brilliant. Amber has a lot more goals to score for Ireland.”\nHere’s to building on her current tally of seven in 44 caps.\nOne last thing: Barrett doesn’t agree with the notion that she had to win Gleeson over.\nShe appeared to fall down the pecking order during the Uefa Nations League campaign last Autumn and was dropped from the squad at one point. But as always, she has come back stronger.\n“There was a lot of reflection on that at the time. Everybody was asking me what happened, but it’s top level sport. Players are in and players are out.\n“It’s just something I had to deal with. Looking back, during that camp I wasn’t in, I had two great weeks working really hard with my club. My mindset was, ‘Don’t give her a reason to leave you out again’. I think I’ve done well with that and it’s something I’m going to keep doing.\n“You always have to do everything be able to say that, ‘I’ve done everything in my power that this doesn’t happen again.’ It can’t be put on you. That’s the only way you can do it.”\nThe interview wraps up with Barrett confirming she’s contracted at Liège again next season.\nGoal target?\n“30,” she responds after a moment’s thought.\nSlightly joking, mostly serious.\nHeart on her sleeve.",
  "word_count": 1101,
  "scraped_at": "2026-02-14T12:41:34.549089"
}