{
  "article_id": "ec3414a68194",
  "url": "https://www.yahoo.com/news/chancellor-porn-films-battle-americas-100001078.html",
  "title": "The chancellor , his porn films , and the battle for America soul",
  "date": "20240616T110000Z",
  "domain": "yahoo.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "The professors filmed themselves having sex with porn stars. Their university was not pleased.\nAs I'm eating roti in a booth with Joe Gow and his wife, Carmen Wilson, a man in a baseball cap approaches our table. As chancellor of the University of Wisconsin-La Crosse for 17 years, Gow is as close to royalty as this Midwestern town gets. Six-foot-four and gray-haired, sporting an ever present gold chain, he was often approached by adoring students for selfies. But when I look into the man's eyes, there is a glint of aggression.\n\"I was an academic for 12 years, and I always kept it in my pants,\" the man says.\nGow laughs, startled by the man's directness. But the stranger isn't finished. \"There's a bunch of people who are very ashamed your signature is on their diploma,\" he says.\nGow turns serious. \"I hope you realize we didn't want to make a big deal out of this,\" he says. \"They could have come to me and said we need you to resign quietly.\"\nGow was the second-longest-serving chancellor in the university's history. He oversaw 10,700 students and 1,450 faculty and staff, managed an annual budget of $95 million, and kept admissions up during a period of declining college enrollment. Then, last December, someone forwarded several Pornhub links to Gow's boss, the president of the University of Wisconsin system. The porn videos had titles like \"Juicy Anniversary\" and \"Bedroom Shenanigans.\" The stars of the videos were Gow, 63, and Wilson, 56.\nWithin weeks, Gow found himself ousted as chancellor. Headlines flooded in from all over the world: CNN, The Times of London, India Today. In La Crosse, the news was greeted with a combination of disbelief and hilarity. A group of students flew a flag with an image of Gow going down on Wilson. A local brewery released a \"Hot for Chancellor\" fruited sour beer; the 186 cases sold out in 40 minutes.\nBut Gow, who grew up wanting to be the next Bruce Springsteen, has refused to exit quietly. This spring, as campuses across the country erupted in protests over the war in Gaza and the nation grappled with the complexities of academic freedom, Gow was fighting a very different kind of First Amendment battle. And how the chancellor turned porn star winds up faring in his fight may tell us a lot about what kind of country we've become and just how far we're willing to extend the limits of free speech.\nIt's early April, and I'm sitting at the dining table in Gow and Wilson's airy home a few miles from campus. Their snow-covered backyard is visible through a stately window, photos of their grandchildren perched on a nearby ledge. Before I arrived, they asked if I wanted to watch them have sex, which they do five or six nights a week, usually just before having dinner. To my relief, they ultimately decided that doing it in front of me would be too weird. Instead, they suggest we watch them having sex on screen. As they sit beside me sipping white wine, Gow opens his laptop and cues up \"Juicy Anniversary,\" the third professionally produced porn they shot.\nGow and Wilson met at UW-La Crosse in 2006. He was a candidate for chancellor; she was on the hiring committee. Rumors swirled that the two, both married, were having an affair, an accusation they denied. Wilson, a professor of psychology, served as Gow's chief of staff for two years before becoming the head of what was then UW-Rock County.\nIn 2011, Wilson and her second husband divorced after 20 years of marriage. Shortly after, Gow ended his marriage of 25 years. The two say they began dating in 2013, bonding over their bad marriages, their veganism, and their desire for sexual adventure. They were married in San Francisco, in a ceremony where they started on opposite sides of the Golden Gate Bridge and met in the middle. It made a BuzzFeed list of \"32 Incredibly Beautiful Elopements You Have to See.\"\nMore in U.S.\nBecause monogamy hadn't worked out for them, Gow and Wilson decided they were going to do things differently this time. First they tried a threesome with an ex-girlfriend of Wilson's (too awkward). Then they explored polyamory (too emotionally fraught). Finally, they tried hiring escorts (just right). They liked paying for a service, with no strings attached. But all the escorts were female, mainly because male escorts were hard to find in western Wisconsin. In search of a man for Wilson, Gow sought advice from his therapist, who suggested joining a swingers club. But they found that the other attendees, as Wilson puts it, \"lacked hygiene.\"\nBoth Wilson and Gow, like most Americans, watch porn. Eventually they thought: Why not make our own? They went to Best Buy and bought a Sony camcorder.\nTheir connection to the porn industry began with a male stripper they paid to give them a private performance in their hotel room in Chicago, where they were attending the annual conference of the Higher Learning Commission. After the show, Gow says, the stripper was happy to get it on with Wilson for free while Gow filmed them. During a postcoital conversation, the couple shared that they were interested in making high-quality porn films of themselves. The stripper said there was another convention in town that might have what they were looking for. So after they were done with their panels on accreditation and assessment in higher education, Gow and Wilson visited the Exxxotica convention, looking to hire porn stars.\nFor their first shoot, the couple hired a 21-year-old porn actor for about $1,000 and took turns filming their sex with her. Then they spent $2,350 to hire a porn studio — camera crew, makeup, and editing — to shoot them having sex on a professional set in a penthouse loft in downtown Los Angeles. It turned them on to be watched.\nPorn actors say it's fairly common for people to hire them to appear in private home videos. The industry \"frowns upon\" the practice, according to one veteran, viewing it as an unprofessional side hustle. But Gow and Wilson had no trouble hiring plenty of big names in the business: Gow's teenage crush Nina Hartley, young hunk Danny Mountain, newcomer India Summer, who'd had a career in finance. \"We've worked with people with degrees from MIT, USC, Cal Berkeley,\" Gow says.\nThe films proved to be a middle-age sexual awakening. Wilson says she doesn't feel any jealousy when Gow is performing with porn stars. \"I love to watch him fuck other women,\" she says. Gow feels the same way about seeing Wilson have sex with \"these major stud-y guys,\" adding, \"To watch her turn them on, I'm just like, 'Oh man, this is amazing.'\" In 2016, Wilson became an administrator at Dickinson State University in western North Dakota. On days she was 700 miles away, Gow would often masturbate to their videos. \"It gets you through the week,\" he says.\nThe shoots also brought out their creativity. Inspired by their love of food, they began shooting vegan cooking videos with porn stars and editing them together with their sex scenes — think Food Network meets Pornhub. In one, Gow, in a gray-checked button-down, and Wilson, in a purple top, face the camera behind a kitchen counter and explain how they're going to cook sweet-and-smoky soy-curl pizza. Then the adult star Lauren Phillips, the XBIZ 2024 MILF performer of the year, bounds into the kitchen, breasts bouncing gloriously in a cropped tank top. As Phillips kneads soy curls in a marinade of tamari, maple syrup, and liquid smoke, Wilson smiles mischievously.\n\"I am very hands-on,\" she tells Phillips.\n\"I would know,\" Phillips says.\n\"Wait till you've seen the scene we've shot with her,\" Gow says.\nThe couple spent some $80,000 to shoot 18 porn films. “Some people will go off on a trip to play golf,\" Gow says. \"We’ll go off and do this video.”\nOver the years, the couple spent some $80,000 to shoot 18 porn films. \"Some people will go off on a trip to play golf,\" Gow says. \"We'll go off and do this video.\" His porn hobby, he says, usually didn't interfere with his work as chancellor. There was one day in 2015, though, when the university was trying to finalize plans for a visit from President Barack Obama. Gow was on set in Arizona when he received a call from a staff member. He declined it, thinking it would interfere with his on-screen performance.\nThough they kept their porn films secret, Gow and Wilson self-published two books about their exploits: \"Monogamy with Benefits\" and \"Married with Benefits: Our Real-Life Adult-Industry Adventures.\" They were careful to use pseudonyms, Geri and Jay Hart, identifying themselves in their Amazon author bio as \"a married woman and man who serve in executive positions at two well-known organizations in the US.\" But next to the bio, seemingly oblivious to the ways of the internet, they included a photo of themselves.\nAt their dining-room table, I sit next to Gow and Wilson as \"Juicy Anniversary\" starts to play. The video begins with Wilson in a slinky pink floral dress and silver heels and Gow in a beige sport coat and a white button-down. He presents her with several anniversary gifts, including a bracelet and a purple rabbit vibrator. The exchange goes on for six minutes. If you didn't know what was to come, you could be forgiven for mistaking it for a Lifetime rom-com.\nThen the clothes come off. Gow, in boxers, stands behind Wilson, caressing her breasts.\nAt the table, Gow turns to me. \"Now, me at this point, I'm like, OK, am I going to get hard?\" he says. He'd taken Viagra for the shoot, but he remained worried.\nIn the background, Video Gow is moaning \"Oh yeah\" as IRL Gow says, \"I've always had some ED issues.\"\nOn-screen, Gow begins to perform a variety of sexual acts on Wilson.\n\"Look at how well lit that is,\" Gow says.\nIRL Wilson nods in agreement. Video Wilson moans.\n\"She's multi-orgasmic,\" Gow says.\n\"I wasn't always,\" Wilson adds. \"I had to work at it.\"\nThere's a close-up on Video Gow's lower torso as he thrusts. \"I like to do a lot of core,\" he tells me. \"I want to have a flat stomach.\" Then he starts doing a play-by-play, like he's announcing a football game. \"She has two so far,\" he says, counting off her orgasms, \"and here comes three.\" As the video ends with the big finale — the money shot, as it's known in the industry — Video Gow stands above kneeling Video Wilson, arms outstretched. \"It's almost Christlike,\" IRL Gow says.\nWhile they kept their porn hobby hidden, it did bleed into their university life. In 2018, Gow and Wilson were filming a video with Nina Hartley when she mentioned she'd been paid to speak at schools like Dartmouth. Gow decided to bring her to UW-La Crosse for a talk called \"Fantasy vs. Reality: Viewing Adult Media with a Critical Eye.\"\nThe backlash began the moment the event was announced. The chair of the faculty senate emailed Gow about his ire that \"a controversial speaker\" was being presented as the sole voice \"of a potentially triggering subject.\" A student wrote that Hartley's visit \"encourages behavior that promotes sexual assault.\"\nGow, who considers himself a champion of sex positivity, was undeterred. On the night of the event, he stood onstage in a suit and striped tie. \"Sexuality, pornography: These are things that I think we need to talk about,\" he said. \"And we have a speaker here with us to do that who is uniquely qualified on these subjects.\"\nHartley, then 59, blond hair cascading over her form-fitting black dress, began by leading the lecture hall in a chant. \"I have a right to experience sexual pleasure,\" the audience intoned. Then she discussed safe sex, her experiences on set, and the fantasies depicted in porn. \"There was nothing salacious about it at all,\" Gow says. (Hartley declined to be interviewed.)\nThe next day, Hartley's talk was front-page news in the La Crosse Tribune. When parents and others complained, Gow defended himself in an op-ed article, arguing that he was helping promote the university's policy of academic freedom. The university disagreed. \"Your defense of your actions is just making things worse,\" Gow's boss, the UW president Raymond Cross, told him. Cross officially reprimanded Gow, ordered an audit of his discretionary funds, and denied him a pending raise.\nGow issued a public apology and announced he would pay Hartley's $5,000 speaking fee out of his own pocket. But the message from his superiors was clear: Even having so much as verbal intercourse with a porn star was off-limits for a university chancellor.\nThe big blowup took place last fall, after Gow announced at his annual start-of-the-school-year speech that he intended to retire as chancellor in May. He received a standing ovation. As Wilson stood beside him onstage, he mentioned that she was leaving academia and that the two of them were working on a YouTube cooking show. He, meanwhile, would remain on the faculty as a tenured professor in communications.\nThe accolades were universal. \"When Chancellor Gow steps down next year, he will be leaving UW-La Crosse much better off than it was when he arrived,\" the university system's new president said. A public-radio story listing Gow's many achievements briefly mentioned the Hartley dustup. Gow spun the controversy as \"very helpful,\" saying it had sparked global media attention for the university and elevated its commitment to free speech.\nNow that their exit was pending, Gow and Wilson didn't waste any time in launching their porn career. That October, while he was still chancellor, they uploaded \"Juicy Anniversary\" and several other videos on LoyalFans and OnlyFans under the name SexyHappy Couple. The videos were paywalled. Only a handful of people watched.\nA month later, Gow and Wilson were having dinner with their video editor. He suggested they might find a larger audience if they uploaded the videos on xHamster and Pornhub, where they could be watched for free. So the couple gave it a try, hoping they might get a few dozen views.\nSeveral hundred people watched the first day. Within a week, 10,000 people were watching a day. Within two weeks, the views surpassed 1 million.\nThe couple were shocked. \"We were like, holy fuck,\" Wilson says. \"We didn't know: Does anybody want to see a couple in their 50s having sex? And the amazing thing was, yes, they did.\"\nThen Gow realized they might have jumped the gun by posting their porn videos for free. \"Sooner or later,\" he worried, \"somebody we know is going to see this.\"\nIt was sooner. On December 19, three weeks after the videos were posted, Gow received a call from the university's legal team saying they needed to discuss a \"personnel matter\" with him. He didn't think much of it. As chancellor, he regularly talked to the school's lawyers. But when the meeting began over Zoom the following day, he realized it was about him. Someone had seen the videos and forwarded them to the president's chief of staff.\nOn the call, the deputy general counsel and the deputy HR director questioned Gow about the videos and his books, which they had also discovered. He admitted everything and cleared up a misconception. The lawyers thought — \"their big concern,\" Gow says — that the couple had been paid by the porn studios, when in fact it was the other way around. Gow explained that he had never made more than $1,000 from his \"expensive hobby,\" which is why he never reported it on the financial statement he was required to file each year with the state. \"That seemed to satisfy my system colleagues,\" he later wrote in the Chronicle of Higher Education, \"and they ended the meeting cordially, giving me no indication of what might happen next.\"\nSix days later, as Gow and Wilson were flying back to La Crosse after visiting his 93-year-old mother for Christmas, Gow learned he had been fired as chancellor. The termination letter said he had failed to properly report his income from the porn videos and had violated \"prohibitions for using one's public position for private benefit.\" The president of the university system released a statement calling Gow's actions \"abhorrent.\"\nGow was placed on paid administrative leave for the spring semester, but he retained his status as a faculty member. Firing a tenured professor is extremely hard, for good reason. The whole point of tenure is to let faculty express themselves freely, without fear of reprisal. Termination requires just cause. Sexual assault, domestic violence, and sexual harassment all count. Consensual sexual activity doesn't. The only mention of porn in the University of Wisconsin's bylaws is a rule against watching it at work.\nAs part of a review of Gow's tenure, the university hired a white-shoe law firm and a forensic analyst from the publicly traded firm FTI Consulting to investigate his actions. His university-issued computer was seized, along with Wilson's. Then the most accomplished chancellor in the school's history was barred from campus, unless accompanied by a police escort.\nThe morning after I watch \"Juicy Anniversary\" at their dining table, Gow takes me to Planet Fitness. He wants to show me his workout routine. As Gow does mountain climbers, his skinny legs pumping, his longtime trainer, Tony Tomich, offers a full-throated defense of his client. Gow and Wilson's porn \"wasn't hurting anyone,\" Tomich tells me. \"It's sad in this day and age, in a university environment, where you're supposed to be open minded. This isn't Communist China.\"\nMany on campus echo those concerns. After Gow's workout, I head to the student center to meet Easton Moberg, a sophomore who has covered the Gow scandal as managing editor of the student newspaper, The Racquet Press. The first thing I notice in his office is a brochure from the women's and gender studies department pinned to a wall: \"Your Comprehensive Guide to Clitoral Masturbation and Other Pleasures.\" A recent issue of the paper featured a satirical story with a photo of Gow, Wilson, and Nina Hartley under the headline \"Gow to Teach Culinary Class.\"\nMoberg tells me he used to have a flag with Gow's face on it pinned inside the house he shared with fellow students. Gow \"was just well respected,\" he says. \"Students loved him.\" After the porn became public, he and his friends found the situation \"hilarious.\" His roommate began \"cranking out memes instantly.\" Still, Moberg doesn't think Gow should be stripped of tenure. \"I am pro-First Amendment,\" he says. \"I have the right to speak freely and write freely. He should be able to do whatever he wants to do freely as well.\"\nThe next day, a janitor in the student center tells me he feels the same way about Gow's indiscretions. \"I don't think what he did was right, but that was his own private thing,\" he says. \"If you don't like what someone's doing, just go to another website, just keep your mouth shut. You don't need to set someone up and take them down.\"\nHe gestures to an empty wall that used to contain portraits of past chancellors. \"Gow was here,\" he says, pointing to a blank spot that has been repainted eggshell white.\nIn March, the university completed its investigation and provided Gow with a copy of its report, which stretches to 318 pages. After watching over 11 hours of the couple's porn, the investigators demurely concluded that the \"dialog and video content would likely be considered offensive to many but were not likely illegal.\" Nonetheless, the report brims with salacious details, couched in a kind of tortured bureaucratic prudery unseen since the Starr Report. Breasts are \"torsos\"; scenes end with various things being \"consumed.\" Twenty-five pages are devoted to sex-toy marketing emails that were sent to Gow's and Wilson's university email addresses. The emails featured images of vibrators, pocket pussies, and vibrating asses. Gow says he never visited porn sites while at work. The university's president, general counsel, and interim chancellor all declined to comment for this story.\nGow plans to defend himself at a tribunal over his tenure. \"It's kind of the trial of Socrates,\" he says with characteristic modesty.\nThe university offered to settle the case without issuing charges if Gow would agree to retire from the faculty. When he refused, he was charged with 21 violations of university policy, including refusing to cooperate with the investigation, receiving emails containing pornographic images on university computers, engaging in \"unethical and potentially illegal conduct\" by paying to have sex with female escorts and strippers and paying for Wilson to have sex with a male escort, and damaging the university's reputation by making porn and posting it online. The university also complained, somewhat penuriously, that Gow \"took a large volume of leftover catered wine from the Chancellor's Box\" after two football games.\nGow decided to fight his dismissal on First Amendment grounds. On April 17, he formally requested a public hearing to review his termination as a tenured faculty member. Under the university's rules, a faculty member will chair the tribunal, which is scheduled to convene on June 19, and each side will have three hours to present its case. It will be the state's first hearing over a faculty member's tenure in 23 years, and the first ever over porn.\n\"It's kind of the trial of Socrates,\" Gow says with characteristic modesty. \"It was about corrupting the morals of youth. They wanted me to drink the hemlock.\" He plans to defend himself at the hearing, as Socrates did, and he believes the tribunal will ultimately see that, as he recently told a local La Crosse news station, \"what a couple does on their vacation, on their own time with their own money and on social media, that's their own business, and that shouldn't disqualify one from being a faculty member.\"\nGow may be right. But it's a tough sell at a moment when leading universities across the country are under attack by the far right. Experts are skeptical that Gow will prevail on free-speech grounds. \"Being in a pornographic movie is generally not viewed as speech on matters of public concern,\" says Eugene Volokh, a First Amendment scholar at Stanford. He points to the precedent set by City of San Diego v. Roe, where the Supreme Court determined that a police officer could be fired for selling videos of himself masturbating on eBay.\nWhatever the outcome of the hearing, Gow and Wilson have already paid a steep price for their perceived transgressions. Wilson's 37-year-old daughter didn't speak to her for five months and has cut her off from contact with her two young grandchildren. \"I want to hurt you as much as you hurt me,\" her daughter told her. Gow's mother called him \"disgusting.\" Wilson's 82-year-old mother, Diane, wouldn't speak to her daughter for a month. When she finally relented, she wrapped Wilson in a hug and said, \"Your reputation is ruined.\"\nBefore I leave La Crosse, I pay one last visit to Gow and Wilson's home, where they and Diane are having their Sunday-night ritual of wine and snacks. \"I decided I wasn't going to lose my relationship with them,\" Diane says. \"I told them, I'm not condoning what you've done. But I will accept it.\" What upsets her most is that her daughter and granddaughter aren't speaking to each other.\n\"I want to have a relationship with her, but she won't talk to me,\" Wilson says.\n\"She has that right,\" Diane says.\n\"We need to have a conversation,\" Wilson says. They both begin to cry.\n\"This is the worst part of the whole situation,\" Gow says. \"I really love those kids too. To just be shut out\" — his voice breaks, and he joins the weeping.\nAs Diane is on her second glass of red, she tells me about how she remained a virgin in college. \"We had zero sex education,\" she says. \"I lived on a farm, and that's how I learned, watching the animals.\"\nHer phone rings — her granddaughter, Wilson's daughter, is FaceTiming her. Diane walks into the living room to take the call.\nI ask Gow and Wilson if I can see their OnlyFans. Gow logs in, showing me a chart of their subscribers. \"You know what that bump is?\" he says. \"That's the day they fired me and it got into the media. We went from 24 subscribers to 9,666 literally overnight.\" In two months, they made $60,000 from the platform. They've also signed with Sssh.com, a porn studio for women and couples.\n\"We didn't get into this for the money,\" Gow says. \"But when my job is under threat and our health insurance is under threat, it's good to be able to make, like, $300 a day.\"\nAnd therein lies the rub, as it were. If Gow and Wilson had managed to keep their porn careers secret for a few more months, their videos wouldn't be generating nearly as much revenue as they are now. Gow could have stepped down to widespread acclaim before going on to a second act that combined recipes for vegan country-style ribs with scenes of graphic sexual acts. He and Wilson wouldn't be as famous. And they wouldn't be engaged in a battle over free speech. But they would still have their family.\nIn the dining room, Gow shows me one of their most popular videos on LoyalFans: a threesome with Lauren Phillips. Wilson peers into the living room, watching her mother sing \"Uh-Oh SpaghettiOs\" with her grandchildren.\nHallie Lieberman is a sex historian and journalist. She's the author of Buzz: A Stimulating History of the Sex Toy.\nCorrection June 16, 2024 — An earlier version of this story misstated Carmen Wilson's title at the University of Wisconsin-La Crosse in 2006. She was then a full professor of psychology.\nRead the original article on Business Insider",
  "word_count": 4345,
  "scraped_at": "2026-02-14T14:11:32.406154"
}