{
  "article_id": "eca27287917e",
  "url": "https://www.ksl.com/article/50824918/utah-loads-up-on-defense-signs-15-players-as-part-of-2024-recruiting-class",
  "title": "Utah loads up on defense , signs 15 players as part of 2024 recruiting class",
  "date": "20231221T010000Z",
  "domain": "ksl.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Estimated read time: 4-5 minutes\nThis archived news story is available only for your personal, non-commercial use. Information in the story may be outdated or superseded by additional information. Reading or replaying the story in its archived form does not constitute a republication of the story.\nSALT LAKE CITY — With all the turbulence this time of the year in college football — a churning transfer portal, early signing day and bowl games — the Utah football program decided to go with the low-drama route.\n\"I guess the overriding theme for this class would be no drama,\" Utah head coach Kyle Whittingham said Wednesday. \"It unfolded almost exactly as we anticipated. There's still a few things up in the air, but it was as expected, for the most part.\"\nUtah signed 15 players Wednesday on the first day of the NCAA early signing day period for the 2024 recruiting class. And outside of one surprise commitment — a legacy recruit in defensive lineman Elijah Elliss — Utah had its class wrapped up well ahead of Wednesday.\n\"It was a defensive-heavy class,\" Whittingham said. \"We were down on numbers on defense, particularly with guys that are opting out for the NFL and we also had some attrition throughout the year, so it was skewed in that direction by design.\"\nWhittingham elected for a smaller recruiting class this year as a result of several players on the roster returning for the 2024 season, in addition to the coaching staff's desire to leave some spots available for transfer portal signings.\nThe longtime Utes coach said the team is expected to continue to go through changes over the next 10 days as more players enter the transfer portal. As a result, Whittingham said the team will continue to dip into the portal and recruit high school recruits for the second signing period.\n\"We've got plenty of space left in the 85 count, and so we will continue to add through the end of this portal time period and then also at the end of April when the second portal opening occurs,\" Whittingham said. \"I'm sure we'll add some at that point, too.\"\nThough Utah secured its future on the offensive side of the ball with four-star quarterback Isaac Wilson and four-star offensive tackle Isaiah Garcia — the state of Utah's No. 1 overall recruit according to 247Sports — the 2024 recruiting class was largely made up of defensive players to help fill needs.\nOf the 15 recruits that signed Wednesday, 11 are projected to play on defense, including seven defensive backs.\nThe seven defensive backs include safeties Davis Andrews (American Fork HS, UT), Jeilani Davis (Mater Dei HS, CA), Luke Bryant (Olympus HS, UT) and Maurice Evans (Blinn College, TX); and cornerbacks Sammie Hunter (Chandler HS, AZ), Latristan Thompson (Mount Pleasant HS, TX), and Quimari Shemwell (Long Beach Poly, CA).\nUtah signed three of the top five players from the state of Utah, according to 247Sports, with Corner Canyon defensive end Kash Dillon just outside at No. 6 to round out the top three players out of Corner Canyon, the reigning 6A champions. That trio from Corner Canyon was the \"centerpiece\" of the in-state talent, Whittingham said, and was a key asset of the 2024 recruiting class.\nThe only player uncommitted in the top five — Bountiful High's Faletau Satuala, the No. 2 overall recruit — has narrowed his decision down to BYU and Utah, though Utah is considered a slight favorite, according to sources. Satuala will announce his decision during the 2024 All-American Bowl in San Antonio on Jan. 6.\nTwo wide receivers — three-star Zacharyus Williams (Junipero Serra HS, CA) and three-star David Washington (Las Vegas Academy, NV) — join Utah as much-needed depth to a receiver room that had Devaughn Vele leave to pursue to the NFL draft and a handful of other receivers transfer out of the program, including dynamic slot receiver Mikey Matthews.\nWilson was recently named the MaxPreps Utah Player of the Year and was a finalist for the national player of the year awards, while also landing on the MaxPreps All-America first team. Garcia was named to the MaxPreps All-America second team.\nWhittingham said Wilson, who had 19 official scholarship offers, was heavily pursued the week leading up to signing day by a \"prominent\" SEC school to flip his commitment, but Wilson stayed true to his commitment made on May 24.\n\"There was a flurry at the end, people trying to get in on Isaac at the last minute — SEC schools; one prominent SEC school, in particular — so it was great to add him to our program,\" Whittingham said.\nWhittingham added that Wilson fit all the characteristics Utah hopes to see from their quarterbacks each season.\nWilson and Garcia will enroll early for spring camp, in addition to about seven other players, Whittingham said, though that number also includes players that have transferred to Utah.\nDavis Andrews and Bryant will serve a two-year church mission before officially enrolling at Utah, but Whittingham said the program will return two recruits — Dallas Vakalahi and Trey Reynolds — as part of the 2024 roster\nTransfers to Utah\nThough not officially new recruits, Utah also welcomed four transfers to the program Wednesday, including Utah native Carsen Ryan, who joins Utah as a tight end from UCLA. Also joining Utah is former BYU defensive end John Henry Daley and former Georgia Tech cornerback Kenan Johnson.",
  "word_count": 906,
  "scraped_at": "2026-02-14T13:10:13.024640"
}