{
  "article_id": "ecb93392c8a1",
  "url": "https://www.londontheatre1.com/reviews/the-lost-lionesses/",
  "title": "The Lost Lionesses - Space Theatre",
  "date": "20240721T163000Z",
  "domain": "londontheatre1.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "This is a story that has gained traction recently for at least three reasons. In no particular order: the first is the success of the England women’s national football team, who won the UEFA Women’s Championship in 2022 and were runners-up in the FIFA Women’s World Cup 2023. This, invariably, has increased interest in women’s football in England generally – and as the Financial Times pointed out after ‘the Women’s Euros’ in 2022, the potential for increased funding through sponsorship is almost limitless (a point also raised in this show). Secondly, Copa 71, a documentary film, produced by tennis legend Serena Williams, had its UK premiere at the BFI London Film Festival in October 2023. The film, like this play, follows the events leading up to the 1971 Women’s World Cup. Thirdly, in September 2023, a blue heritage plaque was unveiled in Luton to honour Chiltern Valley Ladies FC and the British Independents, the name their head coach Harry Batt (Stanley Eldridge) gave to the team he took to the Women’s World Cup.\nAs this production would have it, he felt he needed to call themselves something other than ‘England’ because they weren’t the official England women’s team – that was something still being formed at the time by the Women’s Football Association (WFA) (1969-1993). In a briskly paced monologue, Batt tells the audience directly about the Fédération Internationale Européenne de Football Féminine, or FIEFF – he spells out each letter rather than pronouncing it ‘fye-eff’ as I would have done. The Union of European Football Associations (funnily enough, pronounced ‘you-ey-fuh’ rather than ‘you-ee-eff-ay’) didn’t like FIEFF and did everything it could to denounce and discredit it. UEFA succeeded, and FIEFF folded in 1972.\nThere wasn’t much Batt could do about the local football fans hailing the British Independents as “Inglaterra” (that is, ‘England’), particularly in the absence of any other team from England, but that seemed to wind up the WFA sufficiently that it was apparently in a factor in issuing Batt and his wife June with a lifetime ban from the FA from coaching or managing a team, and Chiltern Valley Ladies FC was ordered to be disbanded. It isn’t quite true, as the show asserts, that the British Independents themselves never met up ever again (even if it took 48 years), though the production does a good job overall of maintaining interest in proceedings, mixing on and off-pitch scenes in such a way that the show is never overly reliant on either matches and training for matches or the backstories and miscellaneous challenges faced by the team and their manager.\nThe performance area takes the form of an unmarked pitch, with the script leaving little to the imagination, describing in some detail the rugged terrain that the Chiltern Valley players trained on, and later, the intense heat and atmosphere of the Estadio Azteca in Mexico City (the British Independents played in mid-August). Batt described the locals’ response to the British Independence as “Beatlemania”, and as this show would have it, it took a while for the players to realise they really were being celebrated and loved. Until that is, they returned to Blighty.\nWhatever one’s level of interest in the so-called beautiful game (mine happens to be quite low), it was difficult not to be engaged in this gritty story. Some of the team were schoolgirls at the time, and therefore able to travel in August, during the summer holidays, without restrictions on annual leave. The sort of abuse the women and girls received were quite tame by today’s standards, which is a rather damning indictment of contemporary society, even if today’s top-flight women’s football players have considerably greater standing than in 1971.\nIf there weren’t actually eleven women on the stage-pitch (as I’m calling it), there weren’t eleven men on the stage-pitch of Dear England either. With commentary for anyone who thinks they wouldn’t be able to follow a football match without it, it’s an inspiring and engaging production. But shouldn’t it really be called The Found Lionesses?\nReview by Chris Omaweng\n“Football? Watch out, your ovaries might fall out!”\nThe true story of the first ever unofficial England Women’s team, who played at the World Cup in Mexico in 1971. The Lost Lionesses played at the Azteca Stadium in front of 90,000 people. When they returned to England, they were banned from football. This is their story.\nCAST\nLizzie Coles as Gill Sayell\nMhairi Boyle as Carol Wilson\nCharlotte Brown as Trudy McCaffrey\nMolly Walker as Christine Lockwood\nAmie Butler as Leah Caleb\nStanley Eldridge as Harry Batt\nCREATIVES AND CREW\nNicole Lockwood-West – Writer\nDanny Milwain – Producer\nDavid Frias Robles – Director\nKelly Long – Co-Producer\nOliver Dressler – Graphic Designer\nMaeve Reading – Set Design\nAlex Ansdell – Sound Design\nChristian Needle – Lighting Design\nCharlie Letchford – Operator\nGeorgia Adderly – PR\nChloe Lee – Set Design Assistant\nUnlock Theatre in association with Pathway Theatre presents\nTHE LOST LIONESSES\nThe Space Theatre\n16 to 20 July 2024",
  "word_count": 836,
  "scraped_at": "2026-02-14T13:05:05.793137"
}