{
  "article_id": "ecc46eaa902d",
  "url": "https://www.westernadvocate.com.au/story/8401695/clash-of-the-giants-platypi-out-to-keep-minor-title-hopes-alive/?cs=2629",
  "title": "Panorama Platypi to host Wiradjuri Goannas in Western Women Rugby League round five fixture at Bathurst | Western Advocate",
  "date": "20231027T063000Z",
  "domain": "westernadvocate.com.au",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "SUNDAY'S Western Women's Rugby League match at Jack Arrow Oval might just be a grand final preview.\nSubscribe now for unlimited access.\nor signup to continue reading\nBut Panorama Platypi will have to win if it wants a home decider.\nThe two-time defending premiers, who have won their last two games with an aggregate scoreline of 96-16, welcome ladder leading Wiradjuri Goannas to Bathurst in a top of the table clash.\nHaving won all three of their matches, Goannas are shaping up as a formidable opponent according to Platypi coach Kevin Grimshaw believes Goannas.\nBut he knows his team is more than capable of getting a win.\n\"It's going to be pretty tough I think,\" he said.\n\"Goannas have a very solid forward pack but if we can match them in the middle, I think we'll probably go a long way to winning the game.\n\"I'm pretty confident with the way we've been playing, that we can win.\"\nWhile Platypi lost a round two match to Orange Vipers, Grimshaw said this Sunday's match will be the biggest test of the season.\n\"We've got a lot riding on this game and so do Dubbo,\" he said.\n\"It should be a good spectacle to watch I think because they're obviously playing for a minor premiership as well.\n\"If they beat us, they'll go four points ahead of us and probably stay in front of Orange too.\n\"But that's why it's so important for us. We'll be coming out with all guns blazing.\"\nGrimshaw believes his team's form bodes well heading into Sunday's showdown in Bathurst.\n\"We're in pretty good form but a week is a long time in football,\" he said.\n\"It could be like Orange, when everyone was confident after a good win, but we sort of got ahead of ourselves.\n\"I think we've got that out of the road and we're ready to roll.\"\nThey'll be some other big match-ups in the lower grades between the two teams, particularly the under 14s and under 16s, where Goannas lead both competitions.\nKick-off in under 12s is at 9.30am, 14s at 10.30am, 16s at 11.40am and 18s at 12.50pm.\nThe main game kicks off at 2pm.\nPANORAMA PLATYPI: 1 Tiana Anderson, 2 Sophie Tilburg, 3 Darcie Morrison, 4 Cheynoah Amone, 5 Menzi White, 6 Carly Abbott, 7 Sarah Colman, 8 Molly Kennedy, 9 Xanthe Booth, 10 Lily Walsh, 11 Bek Giffin, 12 Kate Gullifer, 13 Demi Chapman. Interchange: 14 Meredith Jones, 15 Mia Lee, 17 Tanesha Pringle, 18 Marita Shoulders, 19 Paige Gallagher, 20 Layla Rumball, 24 Paris Campion, 25 Chelsea Amone\nReading this on mobile web? Download our news app. It's faster, easier to read and we'll send you alerts for breaking news as it happens. Download in the Apple Store or Google Play.",
  "word_count": 463,
  "scraped_at": "2026-02-14T12:57:04.992383"
}