{
  "article_id": "ece666b8baf6",
  "url": "https://www.cleveland.com/news/2023/08/garage-sales-bring-joy-to-sellers-and-buyers-olmsted-dates-and-data.html",
  "title": "Garage sales bring joy to sellers and buyers : Olmsted Dates and Data",
  "date": "20230807T144500Z",
  "domain": "cleveland.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "OLMSTED FALLS, Ohio -- The saying “one person’s trash is another’s treasure” held true last week throughout the community.\nThe Olmsted Chamber of Commerce sponsored its three-day Community Garage Sale, and shoppers definitely were finding their treasures.\nSusie Fowler noticed a small, colorful saucer-type item. She picked it up to take home.\n“I’ll likely put it on my coffee table and enjoy it,” said the founder of Second Mile Shop, which was established in 1986 in Berea and is still going strong.\nSusie, who retired from the shop, said she was on her way to Goodwill and Volunteers of America when she saw the Water Street garage sale sign.\n“I go to garage sales and vintage-type shops all the time,” Susie said. “You never know what you will find.”\nHolly Nock decided to have a garage sale for the first time after reading about it in the Sun Post-Herald. She said her daughter dislikes “all the clutter” in the house and, with the price of only $10, being part of the community event just made sense.\nShe had clothing, football shoes, various sports balls, a child’s wall shelf, a swimming pool alarm, bikes, books, wall decorations and many other items at great prices.\n“I am getting a lot of traffic, but people come for very specific items,” she said. “Anything that doesn’t sell is being donated. They are not coming back into the house.”\nThe community garage sale originally was part of the Olmsted Heritage Days festival that the late Clint Williams created more than 30 years ago. It was billed then as the Citywide Garage Sale.\nClint, the father of Grand Pacific Junction, stood in “downtown” Olmsted Falls in the 1980s, saw buildings -- some quite dilapidated -- and envisioned that area as a historic village. I remember his standing before City Council those many years ago and discussing his restoration plans.\nI once asked Clint if his vision reached his expectations. His answer, “Oh, above and beyond.”\nWhen the Junction’s merchants honored him in 2016 -- on the 25th anniversary of Heritage Days -- the part of Mill Street that runs along the Junction was renamed Williams Way.\nWith the Olmsted Chamber of Commerce now sponsoring the garage sale, a part of Clint Williams’ vision continues throughout the entire city.\nJane Gardner had many items at her garage sale that did not sell at a relative’s estate sale. She asked neighbors to join her. Bruce and Fonda Hosta gladly accepted her invitation.\nTheir combined items included glassware, jewelry, a baby stroller, vases, lamps, a coffee table, a roll-away bed, exercise equipment and so much more.\nThe monetary results of garage sales are beneficial, but Jane said there is another reason why she loved being a part of this event for the second time.\n“The best part of this is meeting the people,” she said. “I have met people I would have never met had I not had this. There is no price on that.”\nThanks, chamber, for again hosting this event and to the 50-plus homes and businesses that were part of it and had their locations placed on a live online map.\nLittle marching Bulldogs: The Olmsted Falls High School “Pride of Olmsted Falls” Bulldog Marching Band invites prekindergarten through grade 5 kids to join its members this Friday (Aug. 11).\nBring an instrument or pompoms to the band’s practice field -- along Bagley Road in front of the high school -- at 6:30 p.m. to march with the band members.\nThe band will then march to the Charles A. Harding Memorial stadium for the 7 p.m. Bulldog Marching Band Preview Show. Parents, friends and community members are invited to the show.\nNo need to call anyone. Just bring your child and have them march alongside the band beginning at 6:30.\nBook sale/history facts: The Historical Society of Olmsted Falls will have an open house and used book sale from noon to 7 p.m. this Friday (Aug. 11).\nIt will be in the society’s home, which is on the second floor of Olmsted Falls City Hall at its western end -- which is left when facing the building on Bagley Road.\nThe society will have displays of historical photos and items that Olmsted Falls residents have donated. It is amazing to see pictures of major roads in the area when they were simply dirt roads that had wide open spaces, now covered with homes and businesses.\nThe inexpensive used book sale features a wide variety of subjects, including history, novels, biographies, antiques, art, crafts, cooking, philosophy, politics, religion and travel, as well as some in foreign languages and magazines and DVDs.\nThe society’s officers will be available to give you a tour and answer questions you may have of the exhibits or about becoming a member.\nThe society offers some great Olmsted Falls memorabilia that you won’t find elsewhere in person. Stop by and check it out.\nBuffett fest: Fat Little Buddies’ Outdoor Music Festival and Buffett Fest is this Saturday (Aug. 12) at the tavern, 26906 Cook Road, just west of Fitch Road.\nThe event starts at 2 p.m. and features two Jimmy Buffett and Friends tribute bands: The Leaky Tikis and Cheeseburgers in Paradise.\nYou will receive a free beer and koozie with each purchased ticket. All proceeds benefit the Alzheimer’s Association.\nTickets are $15 each, with a total cost of $17.85. Go to https://tinyurl.com/mtdj3hfu to purchase your online tickets.\nOktoberfest tickets: You still have time to obtain discounted tickets to the Donauschwaben’s German-American Cultural Center’s Sommer Oktoberfest. The fest runs Aug. 18-20 at Lenau Park, 7370 Columbia Road.\nThe $10 discount tickets are available online at https://tinyurl.com/ynfavudb. You must select the day on which you plan to attend. You also may purchase a three-day pass for $25.\nKampus kudos: Five local students earned Youngstown State University’s president list with a perfect 4.0 grade point average for the spring semester.\nThey are Alexis Bella, majoring in pre-social work; Mackenzie Simon, public health; Halle Slater, middle childhood education in math/science track; Sanat Subhash, biological science, BaccMed track; and Hanna Simiele, primary/primary intervention specialist education.\nSeveral local students attending Youngstown State earned the dean’s list. They include Bella, Simon, Slater, Subhash and Simiele, as well as Jessica Newman, allied health; Maura Schultz, dental hygiene; Raven Reale, medical laboratory technology; Mikayla Shiels, nursing; and George Kerg, chemistry.\nCongratulations to these young women and men.\nGreek galore: The Olmsted Falls Greek Fest is set for Aug. 26 at the Nafpaktian Cultural Foundation Inc. building, 7890 Brookside Drive\nEnjoy such traditional Greek food as gyros, souvlaki, moussaka, spanakopita, stuffed grape leaves, baklava and more from 1 to 10 p.m.\nMusic, dancing and beer also are part of the fest. There is no admission price.\nThe Nafpaktian Cultural Foundation has its origin in Sterea Ellas, Greece, which is in that country’s central region. According to its website, as more Nafpaktians settled in the Cleveland area, they established an organization, whose purpose was to develop relationships among those who came from that location in Greece.\nThey also wanted to help preserve the religion and traditions and support philanthropic endeavors. This fest helps those purposes -- and gives our community yet another culture and food to enjoy.\nHope to see you there Aug. 26.\nNominate: Time is running out to nominate a candidate for this year’s Olmsted Falls Citizen of the Year award. The deadline to nominate is Aug. 31.\nOlmsted Falls annually honors one of its residents whose dedication and service exemplifies a significant contribution to the community.\nThere are a few requirements. The person must have lived in Olmsted Falls for at least 12 months, not received the awad in the past and cannot be an elected official or member of the Olmsted Falls Parks and Recreation Board.\nQualifications include being an above-average volunteer and/or philanthropic contributor to the city; consistently demonstrating distinguished volunteer service of significant value through civic groups, school activities, church, community events and others; and not being paid for the volunteer activity.\nThe Olmsted Falls Parks and Recreation Board will review candidates and select the winner based on the qualifications and content on the nomination form.\nThe Citizen of the Year will be announced at Falls Day in the Park.\nForms are available on the city’s website, olmstedfalls.org. Mail them by Aug. 31 to Chairman, Parks and Recreation Board, City of Olmsted Falls, 26100 Bagley Road, Olmsted Falls, Oh 44138.\nYou also may drop them off at City Hall.\nTeam Dak: The community is invited to join Team Dak at the Sept. 10 Northern Ohio Chapter of the ALS Association’s Walk to Defeat ALS. It is in Independence.\nOlmsted Falls Bulldog grad Dakota “Dak” Hosta died in April of amyotrophic lateral sclerosis, a progressive, fatal neuromuscular disease that slowly takes away the body’s ability to walk, speak, swallow and breathe.\nDak was 32 when he died with the disease, also known as Lou Gehrig’s disease.\nHis widow, Danielle, is heading up the team. You may donate to this cause by going to https://tinyurl.com/3yv4bvxu. Funds raised help provide awareness, resources and services to families and, hopefully, unlock the mystery to find a cure for ALS, which is diagnosed every 90 minutes in a person in the U.S.\nThe ALS Northern Chapter’s website is at www.als.org/northern-ohio.\nInformation, please: To include news, tidbits, honors or activities in Olmsted Falls and Olmsted Township, contact Joanne DuMound at jdumound@yahoo.com. She is also on Twitter, @JoanneDuMound. The column’s online version at cleveland.com/olmsted has direct links for many news items.\nRead more from the Sun Post Herald.",
  "word_count": 1593,
  "scraped_at": "2026-02-14T13:37:55.104389"
}