{
  "article_id": "ece922f6dd1f",
  "url": "https://economictimes.indiatimes.com/news/international/global-trends/gianni-infantino-and-donald-trump-handshakes-warmth-and-a-mutual-interest/articleshow/121702731.cms",
  "title": "Gianni Infantino and Donald Trump : Handshakes , warmth and a mutual interest",
  "date": "20250608T021500Z",
  "domain": "economictimes.indiatimes.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Infantino has shown a deft touch when it has come to dealing with hard-nosed leaders, from Russian President Vladimir Putin, when Russia hosted the 2018 World Cup, and now Trump with the United States set to co-host football's global showpiece next year.\nTrump has been quite the opposite, showing no mercy to those who have dared challenge him -- he has laid into Ukrainian President Volodymyr Zelensky and his South African counterpart Cyril Ramaphosa in extraordinary scenes at the White House.\nHowever, with Infantino it is all smiles, compliments and Trump's traditional use of the words \"great\" and \"greatest\" when he likes something or somebody.\nInfantino was one of just a handful of prominent sports figures present at Trump's inauguration.\n\"Infantino handles Trump really well,\" Martin Sorrell, the founder of advertising giants WPP who is putting together a documentary for next year's World Cup, told AFP.\nSorrell pointed to when Infantino was filmed with Trump in March, showing off the trophy for the upcoming Club World Cup.\n\"Trump, who had the FIFA trophy behind him in the Oval Office on the video, said... 'as one president to another',\" he noted.\nInfantino appears to have placed his relationship with Trump front and centre -- perhaps unsurprising as the women's 2031 World Cup is also expected to be hosted in the US as well as the inaugural women's Club World Cup in 2028.\nHowever, there are signs that the relationship can grate with others as it did with UEFA representatives when Infantino arrived late at a FIFA Congress in Paraguay in May having been with Trump on the US president's visit to Qatar and then Saudi Arabia.\n- 'My great friend' -\nNevertheless, whether some like it or not Infantino has restored relations with the US which reached its nadir under his predecessor Sepp Blatter.\nAfter the US lost out to Qatar for the right to host the 2022 World Cup, a FBI investigation resulted in 'Fifagate', leading to several of the governing body's senior figures going to jail and Blatter resigning.\nIn 2018, two years after Infantino was elected, the US were named co-hosts of the 2026 World Cup, earning him an invitation to the White House.\nTwo years later the 'bromance' was strengthened when Trump asked Infantino to deliver the address at a dinner he hosted at the Economic Forum in Davos.\n\"America is on the verge of becoming a great soccer power,\" purred Infantino.\n\"The 'American dream' is something we all need to have. All those who love soccer.\"\nTrump responded by praising FIFA as a \"steadfast movement\" and Infantino as \"my great friend.\"\nInfantino's loyalty -- a characteristic Trump values in others above all else -- has remained rock solid.\nThe press conference-shy football boss has in his social media posts steered clear of commenting on the slights made by Trump regarding his World Cup co-hosts Mexico and Canada.\nSo keen is he to maintain smooth relations, he did not even step in to correct Trump, sitting behind him, when the US president said inviting Russia to the 2026 World Cup could facilitate them making peace with Ukraine.\nRussia are barred from the qualifiers due to the 2022 invasion of Ukraine.\nHowever, both have so much invested in the World Cup being a success that nothing must blight the landscape.\n\"Gianni's obviously got a very close relationship with Trump and he's leveraging that because both sides have a mutual interest for 2026 to work,\" John Zerafa, an experienced sports communications strategist based in the UK, told AFP.\n\"Trump is a guy that's driven by headlines and being in the spotlight, and he's going to love being in the spotlight in the run-up to and during the World Cup, and he knows that it's got to go smoothly.\n\"So they've got a mutual interest for 2026 to work.\"",
  "word_count": 639,
  "scraped_at": "2026-02-14T12:35:43.594760"
}