{
  "article_id": "ed1b74c14d13",
  "url": "https://reliefweb.int/report/iraq/how-girls-are-moving-goalpost-iraq",
  "title": "How girls are moving the goalpost in Iraq - Iraq",
  "date": "20230905T121500Z",
  "domain": "reliefweb.int",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Over two billion people around the world watched the Women’s World Cup Final in August, and tucked away on the left coast of the Tigris River in Mosul, Iraq, a group of teenage girls and their families scoured the internet to find streaming sites to catch the game. The screening was fuzzy, but the vision was clear: one day, the Mosul Girls Football Club could also be on this field.\nRama, 13, Zubaida, 14, and Hadeel, 15, have a shared story of displacement and loss. The name of their city, Mosul, was synonymous with death, destruction, and despair less than a decade ago.\nMany families, including theirs, have returned to Mosul after years of living in limbo, and are building a brighter future for their children. Bazaars, schools, community centres are reopening and being rebuilt. The city is shaking off the anguish and grief of the previous years and the community is reviving its millennia-old culture and traditions. They are also welcoming new practices and embracing change.\n“We are not boys,” says Rama, while getting ready for football practice at the Al Ammal football club in Mosul. “Generally, women and girls do not play sports in Mosul. It’s not common. My mother was afraid that I would fall and get hurt. But, eventually, she agreed. Now she is my biggest cheerleader.”\nMany other girls on the team from the city report the same initial hesitation from their families and relatives, followed by cautious approval. Today, a majority of the girls have their entire community’s unwavering support.\n**‘Local celebrities’ “Every time we have a match, people come to watch us play,” says Hadeel, who loves hiking and driving – and any other activity that challenges prevailing gender norms. “Our school principal posts regular updates about our games on Facebook – who scored, who won, who played well. My father is always happy to see when I score and encourages me more.”\nThe girls are local celebrities and an inspiration to their peers.\nThe football team started as a project implemented by the Sustainable Peace Foundation (SPF) of Mosul in 2021, led by Shahad Khaleel.\nMs. Khaleel, 29, and her team worked with school teachers, community leaders, and parents to advocate for the participation of girls in their project, Sports for Peace. SPF is one of 22 grassroots organizations supported by the International Organization for Migration (IOM) in Iraq through the Wasl Civil Society Fund to design and implement community-level projects that address drivers of instability, displacement and violent extremism.\n‘Football gave us the common ground’\nThe project is part of SPF’s vision to provide a safe space for young girls and boys to participate in team sports in efforts to challenge gender norms and increase youth engagement and community resilience, with an overarching goal to prevent violent extremism and associated risks.\n“The most important lesson is teamwork,” Zubaida said between games. “When we first started playing in teams, we weren’t sure how to work together and it created some tension. Football gave us the common ground to resolve some issues and helped us be stronger as a team. Now we dominate the field.”\nFifteen teams consisting of 10 girls each, along with 20 women coaches, have come together over their shared passion for football in the last ten months. Together, they train, compete, and inspire other young women and girls to participate in sports.\nVulnerable to violent extremism\nOver 60 per cent of Iraq’s population of 43.5 million are under the age of 25. Many have seen their country go through cycles of extreme violence, conflict, and instability, and yet play a limited role in the national peace and reconciliation efforts.\nWithout the active engagement and participation of the youth themselves, efforts to alleviate and mitigate factors making them vulnerable to violent extremism will be incomplete.\n“Especially for young women and girls,” Khaleel added. “It is erroneously believed that the women and girls are not influenced by violent extremism or were coerced into committing acts of violence. We now know that Da’esh was able to consolidate their reign of terror, in Mosul and beyond, by exploiting marginalized women and girls, their poor financial conditions and lack of equal opportunities.”\n‘Iraqi youth are passionate’\nThrough team building and idea exchange, Sports for Peace aims to provide a common platform for the next generation of girls in Mosul to challenge norms, defy societal expectations and advocate for peaceful coexistence. The project has been extended for another six months and will continue working with over 150 girls in 10 teams across Mosul.\nSimilar initiatives have been supported by IOM’s Wasl Civil Society Fund in Fallujah and Halabja, where local organizations bring together members of disparate communities for field trips to heritage sites, to play in tournaments and foster dialog on social cohesion.\n“Iraqi youth are passionate and motivated to build a better future for their communities,” said Giorgi Gigauri, Chief of Mission, IOM Iraq. “The Mosul Girls Football Club embodies the determination and courage of the next generation of Iraq, and we need to invest in and encourage these efforts, especially when they bring people together to work towards a brighter tomorrow.”\nBack at the Al Ammal football club, the match is in full swing. Zubaida scored a penalty kick in the second half. Hadeel and Rama are cheering on with the crowd.\n“I will be a professional football player in ten years,” Rama said, “because nothing is impossible. Inshallah, I will play for my country.”\n“In the end, you only live once,” Hadeel said, with typical Gen Z candor. “So, we must use this time to have fun, and keep ourselves busy with interesting and exciting activities.”",
  "word_count": 944,
  "scraped_at": "2026-02-14T12:04:29.118607"
}