{
  "article_id": "ed2708efd792",
  "url": "https://www.con-telegraph.ie/2024/01/07/mayos-top-20-heroes-of-the-year-are-revealed/",
  "title": "Mayo top 20 Heroes of the Year are revealed | Connaught Telegraph",
  "date": "20240107T151500Z",
  "domain": "con-telegraph.ie",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Mayo's top 20 Heroes of the Year are revealed\nOur selection of outstanding achievers and achievements of 2023\nby Caoimhin Rowland\nMohammad Naeem\nMOHAMMAD Naeem, an exceptional 18-year-old hailing from Claremorris, has rightfully earned his place as one of Mayo's heroes of the year. His recent appointment as a United Nations Youth Delegate not only proves his prodigious diplomatic talents but also his dedication places him as a trailblazer, being the youngest person ever selected for this prestigious role and the first from Mayo.\nNaeem's commitment to making a positive impact is highlighted by his extensive involvement in activism at various levels, including regional, national and international spheres.\nIn 2023, Naeem represented Ireland at the United Nations in Geneva, engaging with the Ombudsman for Children and addressing the UN Committee on the rights of the child.\nThis experience not only reflects his passion for advocating on behalf of children's rights but also demonstrates his ability to bring pressing issues affecting Irish youth to the global stage.\nAs the deputy president of the Irish Second Level Students’ Union, Naeem has already shown leadership and dedication to the welfare of his peers.\nHis selection as a UN Youth Delegate further solidifies his status as a Mayo hero, poised to represent not only Claremorris and Mayo but the entire island of Ireland on the international stage. Naeem's journey promises to inspire and empower the youth of Mayo and places him in firm footing as a potential future politician.\nCaelan Doris\nTHE talented rugby player hailing from Mayo has undoubtedly emerged as one of the county's heroes of the year.\nBorn in Lacken, north Mayo, Doris has not only made a significant impact on the rugby field but has also become a source of pride for his local community.\nAs the Irish and Leinster number eight, he has shown his prowess on the international stage, contributing to Ireland's successes and becoming a beacon of inspiration for aspiring rugby players in Mayo.\nDoris's journey to becoming a rugby hero started with his local Ballina Rugby Club, secondary education at the prestigious Blackrock College in Dublin and now excelling in the green jersey under Andy Farrell.\nHis commitment to the sport has been evident in his performances, including a memorable World Cup pool win over the Springboks, where he showcased exceptional athleticism and skill. This achievement not only brought glory to Ireland but also elevated Doris's status as a sports icon representing Mayo on a global scale.\nAs Mayo celebrates Caelan Doris as one of its heroes of the year, there is a palpable sense of pride and excitement about his future endeavours. With a renewed contract with Leinster until 2026-27, Doris's journey is far from over, and Mayo eagerly anticipates more triumphs and moments of glory from their rugby prodigy.\nIn both his on-field achievements and off-field contributions, Caelan Doris stands tall as a symbol of excellence and inspiration for Mayo, truly deserving the recognition as one of the county's heroes of the year.\nRuairi Keating\nTHE former Westport United striker has spent time playing football professionally in England but this season for Cork City the prolific front man etched his name onto the annals of League of Ireland folklore.\nPicking up a nomination for Player of the Year and sealing a move to FAI Cup winners St. Patrick’s Athletic after his Cork City side were relegated, Keating will look to kick on with St. Pat’s and is surely relishing the opportunity to play European football with his new side.\nA remarkable achievement for the 28-year-old after losing his father tragically to a road accident. He commemorated his father’s memory by returning to the field of play and striking a crucial hat-trick at Turner’s Cross against Sligo Rovers and laid his shirt on the turf, dedicating the impressive haul to his late father, Ciaran.\nCiara Mangan\nCIARA Mangan courageously emerged as a hero this year by publicly sharing her painful experience as a survivor of sexual assault.\nWaiving her right to anonymity, she shed light on the profound impact of such a traumatic event on her life.\nCiara's poignant words described the theft and destruction of a part of herself, emphasising that she will never be the same person she was before the assault.\nCiara detailed the events leading up to the assault, highlighting the lack of choice she had in the matter and torturous bullying in the aftermath.\nDespite grappling with the trauma, she acknowledged the unwavering support of her family, friends, the police, and the Rape Crisis Centre.\nThrough her strength and resilience, Ciara transformed from a victim to a survivor, reclaiming her agency.\nCiara Mangan's decision to speak out contributes to breaking the silence around sexual assault, fostering awareness and understanding.\nBy sharing her story, she not only seeks justice for herself but also becomes a beacon of hope and inspiration for others who may be silently suffering.\nCiara Mangan’s bravery and determination make her a deserving addition to the list of heroes of the year, as she advocates for change and challenges societal perceptions surrounding sexual assault.\nJordan Flynn\nTHE Crossmolina midfielder was a stand-out performer for Mayo during their Allianz National League campaign victory.\nHe was nominated for an All-Star for his 2023 performances and has grown into the shirt remarkably. Flynn’s power from midfield was a focal point for Kevin McStay’s Mayo side and his disallowed goal in the quarterfinal versus Dublin was a turning point in the first half in that game.\nFlynn will surely go on from strength to strength in the green and red as he becomes one of the leaders of an increasingly youthful Mayo side. Known for his ill-temper in his younger days, he has shown remarkable discipline in recent seasons, maturity, strength and scoring from distance now characterise the Ballina based midfielder’s game.\nSure to be a key for Mayo this season and a lot will depend on his fitness and availability if Mayo make it to the latter stages of the championship.\nGarron Noone\nTHE Ballina social media star has enjoyed a meteoric rise online in 2023, with appearances on BBC radio, a series of sold-out live performances and a whopping 500,000 Instagram followers.\nHis videos have been shared by British comedian Phil Jupitus, musician Jessie J and controversial commentator Katie Hopkins.\nHis turn of phrase and love of his native Ballina and Mayo shine through in every one of his videos, with an opening welcome in each of his videos, How are ya getting on?\nAnd his outro “Follow me I’m delicious” becoming one of the trendiest viral moments of 2023.\nA talented musician in his own right, Garron is set for even better success in the year ahead as he performed stand-up comedy in December for his Vicar Street debut. Expect appearances on talk shows and more content that captures the hearts and minds of a burgeoning global audience.\nMark Duffy\nTHE Ballina councillor made a name for himself on the international scene this year when he spoke at the Joe Biden Presidential visit on April 14.\nSpeaking to a worldwide audience, 'Mayor Mark', as he was monikered by the US press, addressed the large crowd assembled along the banks of the Moy.\nThe young councillor, first elected in 2018, was heralded for his speech using no notes or teleprompter. He was only told the night before that he was selected to make a speech as he was cathaoirleach of Ballina Municipal District.\nDuffy is hotly tipped to retain his seat in the local elections in June, but a general election bid may also materialise considering his name recognition and independent status.\nIoseph O’Reilly\nCAPTAIN of Castlebar Celtic’s invincibles, O’Reilly was a mainstay at the heart of the defence for his home town club. Celtic reclaimed the Super League title, going the entire season unbeaten, while their most heralded and consistent performer was Ioseph O’Reilly at centre-half.\nUnder the stewardship of manager Stevie Gavin, Celtic performed superbly throughout the 2023 campaign but were kept under pressure by Ballina Town throughout the season. Ultimately O’Reilly lifted the Tom Kelly Cup in Mount Falcon against Conn Rangers.\nWinning 16 out of 18 games in Mayo’s top flight, Celtic were potent in front of goal, but their defence was vital in ensuring an invincible season. Picking up the title after an absence of two years, Celtic will be keen to reclaim the league title in their centenary year and the performances of Ioseph O’Reilly will be imperative to that task.\nMayo Dark Skies\nTHE group based in the Nephin national park have helped to educate, intrigue and welcome dark sky enthusiasts from around the globe to northwest Mayo.\nAn idea to redo lights on St. Patrick's Church in Newport was welcomed by astronomers as Mayo boasts the darkest skies in Europe. Ensuring that the area continues to be one of the most progressive in preserving the starry night sky in the county.\nGer Staunton\nMAYO'S main funny man, Staunton’s career in comedy has gone from strength to strength this year as he performed in his hometown in late December during a side-splitting gig in the TF Royal Theatre.\nRenowned for his 'incredibly funny' style, as praised by The Irish Examiner, and his 'immaculately woven anecdotal riffs with a smooth pace and a dark twinkle,' according to The Independent, Staunton's repertoire of hilarious stories and insightful anecdotes makes him one of the most exciting comics crafting their trade in Ireland.\nThe Castlebar man performed as Gaeilge in the Linenhall Arts Centre in a unique gig back in November and his consistently sold out Castlebar Comedy Club in Bridge Street showcases the love of comedy in the county and passion Staunton has to bring entertainment to his native town.\nNiamh Kelly\nMAYO'S very own Niamh Kelly emerged as a standout, earning her well-deserved place in the AFLW Team of the Year.\nThis accolade, a testament to her skill and tenacity, solidifies her status as one of Mayo's exceptional heroes of the year. As a midfielder for the West Coast Eagles, Niamh not only showcased her prowess down under but brought recognition to Mayo's rich sporting tradition.\nNiamh Kelly's inclusion in the AFLW Team of the Year represents a significant milestone not only for the player herself but also for Mayo on the global sports map. Her achievements underscore the county's ability to produce top-tier talents capable of making a mark in elite competitions.\nThis international recognition adds a new layer to Mayo's sporting legacy, further establishing the county as a breeding ground for exceptional athletes.\nBeing selected in the AFLW Team of the Year is a testament to Niamh Kelly's consistent excellence throughout the season.\nA midfielder with a keen eye for the game, she contributed significantly to the West Coast Eagles' campaign, earning the respect of peers, coaches, and fans alike. Mayo can take pride in having a player of Niamh's calibre, whose performances have not only elevated her personal standing but also brought honour to the county.\nNiamh Kelly's achievement in the AFLW Team of the Year serves as an inspiration for aspiring athletes in Mayo. Her journey, from the local GAA pitches to national heights with Mayo to international acclaim, sends a powerful message about the potential for success with talent, dedication and hard work in tow.\nAhRef\nTHE team behind the most popular Mayo GAA podcast reached new heights in 2023.\nThe knowledge of Enda McGearty, Hollymount man John Stagg, and the odd cameo of Charlestown man Ronan Kenny, all marshalled by the main man AhRef who possesses a swift turn of phrase, eye for a story and top-tier BS detector for the narratives that spin around Mayo footballing circles.\nThe AhRef podcast made it to the finals of the Listener’s Choice, Irish Podcast Awards in November. With over 500,000 listens and a hardcore audience awaiting the latest release from the entertaining trio, it’s perhaps the simplicity of their podcasting style that garners such attention.\nWhat started out as two recording off their phones in the back of a car after a Mayo game, if Arsenal Fan TV became the forerunner of fandom punditry, AhRef takes it to another level.\nTheir deep level analysis, statistics brimming from Enda Mc and John Stagg’s colourful use of language, the pod gives you the experience of being in a pub on Dorset Street after an All-Ireland final loss with friends, with the added benefit of not even having to be in Dublin.\nThe diligence in which they cover the local club games is beyond remarkable, like public service broadcasting without a television licence fee, the AhRef podcast proves that Mayo people have a few screws loose when it comes to football, nothing is more important to us and the zeitgeist of AhRef himself, who has accumulated almost 30,000 followers on twitter, shows that he has the finger on the pulse of Mayo folk at home and abroad.\nWhether it be news of a management change in Moygownagh, the next big thing to come out of Garrymore or a simple moan and rant about the shenanigans behind the scenes of Mayo football that grind the axe of one Enda Mc.\nJohn Stagg’s move into co-commentary with Midwest is a breath of fresh air, he offers great insights and is close to the game, while Ref himself is a top bainisteoir at intermediate level and Enda McGearty an accomplished international umpire. They are far from hurlers on the ditch. The real thing you gleam from their show is that they know about the game they’re talking about.\nMags Downey\nCHAIR of the Ballina Chamber of Commerce, Mags Downey was integral in pulling off the Joe Biden presidential visit back in April. By her own account, she peppered the Oval Office with invitations and letters asking him to return to his ancestral home.\nMags was key in forging links between Scranton and Ballina, helping to put the north Mayo town on the map. Such was the success of Biden’s Ballina visit broadcasting the town to the world, it is believed Ballina will see a jump in international visitors on the back of the attention drawn in 2023.\nMags was a key player in forming the Ballina 2023 Vision, a plan enacted to put the town’s best foot forward during their birthday celebrations.\nBallina is now one of the most popular towns for weekend breaks and could soon overtake Westport as a tourist destination in the county. The community activism and support received from all of the businesses in Ballina has helped foster a unique spirit that will see Ballina thrive well into 2024.\nKevin Barry\nAS a Consultant General Surgeon at Mayo University Hospital and the Director of National Surgical Training Programmes in the Royal College of Surgeons in Ireland, Professor Kevin Barry has demonstrated impeccable commitment and leadership. His establishment of a Symptomatic Breast Clinic and collaboration with multidisciplinary teams at Galway University Hospital showcase his dedication to enhancing patient care.\nCatherine Donohoe, Hospital Manager at MUH, commended Professor Barry's pivotal role in the healthcare system, highlighting his position as the first Dean of the Medical Academy and the Associate Clinical Director for the Cancer MCAN at MUH. His induction as a Member of the American College of Surgeons (ACS) Academy of Master Surgeon Educators is a testament to his international recognition and the impact of his work on a global scale.\nIn Professor Barry's own words, the award holds personal significance, acknowledging the support he received from colleagues and institutions throughout his career. His commitment to training the next generation of surgeons and adapting to the evolving healthcare environment further solidifies his status as a Mayo hero.\nThe ACS Academy of Master Surgeon Educators plays a crucial role in advancing surgical education, and Professor Barry's inclusion in this prestigious group underscores his influential contributions to the field. Congratulations to Professor Kevin Barry, a true Mayo hero of the year, whose dedication and excellence continue to shape the future of surgical practice and education.\nEddie Conroy\nTHE Charlestown native managed Lahardane MacHales to the Junior football championship crown and Connaught success.\nIn his own words, after extra-time in the Connaught football semi-final versus Menlough of Galway, Conroy told the Lahardane players they are representing Mayo as the only club remaining in the provincial stages.\nMacHales went on to win the penalty shootout against the Galway champions and it’s a testament to the belief Conroy instilled in the players who were understandably at a low ebb when he took the mantle under the butt of Nephin last January.\nLahardane had been relegated from intermediate football, confidence was low and a poor league campaign did little to instil faith in the parish’s potential to bounce back to intermediate level.\nA veteran of Mayo masters football, Conroy is a committed winner, having sealed county final crowns with his adopted Breaffy in 2003 and later at intermediate level.\nHis style of play is a breath of fresh air in a year in which Mayo club football was derided on the national stage due to low scoring defensive slogs, particularly at senior grade. Conroy’s charges will tackle Listowel Emmett’s this weekend in a difficult but tantalising clash. His side will be keen to go one step further than 2017 and make it to the hallowed turf of Croke Park in a week's time.\nManulla FC Women’s Team\nA HISTORIC treble came the way of Manulla women’s team, etching their names into the annals of history with a remarkable domestic treble triumph.\nThe grand finale unfolded at Solar 21 Park, Castlebar, where a resounding 6-3 victory over Castlebar Town secured not only the Mayo Women's Cup but also added to their Premier League title and the coveted Rumley Cup, clinched just a week prior.\nIn a stunning showcase of talent, Jess Nolan and Tracey Hall orchestrated a spectacular encore of hat-tricks in the final, with Hall achieving the remarkable feat of scoring six goals in two consecutive finals.\nTheir journey to victory was a testament to resilience and skill, and as Manulla captain Aoife Freyne picked the gleaming cup, the team's triumph resonated as a tale of perseverance and excellence in the heart of Mayo's soccer legacy.\nOisín McGrath\nOISÍN McGrath, the co-founder and chief executive of Galenband, emerges as a visionary leader in the field of healthcare technology.\nHis leadership has been pivotal in positioning Galenband as a standout player in the InterTradeIreland Seedcorn Investor Readiness Competition, culminating in their recognition as the Best Early Stage Category winner.\nMcGrath's dedication and strategic acumen are evident in the development of Galenband's revolutionary diagnostic heart telemetry system, a non-invasive alternative that promises to transform long-term heart monitoring.\nHis commitment to advancing healthcare is shown by the potential of Galenband's technology to significantly reduce stroke rates through early detection and intervention.\nWinning the competition not only reflects McGrath's leadership and the hard work of his team but also serves as a catalyst for securing further support as they navigate the crucial stages of product development and regulatory milestones.\nOisín McGrath's vision and leadership position Galenband at the forefront of innovation in cardiac care, with the potential to make a lasting impact on the health and well-being of individuals worldwide.\nCroagh Patrick path build team\nTHE completion of the €1 million pathway project at Croagh Patrick stands out as one of the significant achievements of the year in Mayo.\nOver the course of two and a half years, the project successfully reached the summit, marking a crucial milestone in the effort to enhance safety and address erosion issues on the holy mountain.\nThe collaborative approach involving local stakeholders, government entities and Mayo County Council exemplifies a commendable commitment to sustainable access and habitat restoration.\nThe meticulous planning, spanning five years, and the unique collaboration between path consultants and contractors from Scotland, England and Ireland underscore the thoroughness of the initiative.\nThe project garnered widespread support from the community, church, and recreational users, and received formal approval from Mayo County Council.\nLed by the Croagh Patrick stakeholder group, with Martin Keating at the helm, the establishment of a well-organised corporate structure ensured the orderly and safe progression of the project.\nCo-funding from the Department of Rural and Community Development and Mayo County Council further emphasised the project's significance at both local and national levels.\nIn essence, the completion of the Croagh Patrick pathway project represents a standout achievement of the year, not only enhancing the physical landscape but also providing a safer and more sustainable experience for pilgrims.\nDarren Forde\nAN exemplary figure among Mayo's heroes of the year, Darren Forde stands out for his commitment to the safety and well-being of those venturing onto the iconic Croagh Patrick and across the county.\nAs a Mayo engineer and Community First Responder from Hollymount, Forde identified a critical gap in life-saving resources on the mountain, spurring him into action. With a keen understanding of the challenges posed by extreme weather, he successfully secured €8,000 in funding from local sponsors to purchase and install two defibrillators, each housed within their own solar-powered cabinets. And the defibs initiative has extended far beyond the mountain, with projects in other communities around the county coming on stream.\nForde's dedication and quick action have not only filled a crucial void but have also demonstrated how local initiatives can significantly impact the safety of the community. His contributions mark him as a true Mayo hero, whose efforts resonate far beyond the mountain's summit.\nBreaffy rounders team\nBREAFFY won the All-Ireland rounders title in 2023, the club’s second successive victory at senior level.\nThey secured the silverware after a memorable win over Wexford’s Glynn-Barntown - a narrow victory of 12–10 helping the blues to a record breaking win. Key players such as Gráinne Gavin, Michelle Hopkins and Katie Kenny helped their club over the line in September and brought the vaunted All-Ireland trophy back west for the second year running.",
  "word_count": 3656,
  "scraped_at": "2026-02-14T12:41:27.082786"
}