{
  "article_id": "ed345ec4202a",
  "url": "https://www.express.co.uk/news/world/1930988/paris-olympics-targeted-france-chaos",
  "title": "Olympics chaos as Paris games  targeted  while games fall flat",
  "date": "20240801T181500Z",
  "domain": "express.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Olympics chaos as Paris games 'targeted' while games fall flat\nSpeaking on Wednesday, the French PM said the attacks included direct targeting of Olympic venues, Bercy and Le Villette on July 25.\nAlmost 70 cyber attacks on the organisation of the Paris Olympic Games have been identified and thwarted since the event began, the French Prime Minister has said.\nSpeaking on Wednesday, Gabriel Attal said the attacks included direct targeting of Olympic venues, Bercy and Le Villette on July 25.\nThe head of government, who has resigned but remains in charge of current affairs, shared the update at the end of a progress report on the Olympic Games with ministers at Matignon, the PM's official residence.\n\"All of these cyber attacks, all 68 of them, including the two that targeted Olympic sites, were detected in time and thwarted,\" he said, as per France Info.\nAttal said organisation and security around the opening week of the international sporting event in the capital has been a \"real success on all fronts\".\nHe also lauded the \"exceptional\" opening ceremony, and the triathlon event that took place on Wednesday morning in the Seine.\nAttal praised \"the remarkable commitment of the forces of law and order\", noting that \"no major or noteworthy incident has been reported\" and that \"30,000 police officers and gendarmes\" and \"10,000 military personnel\" had been mobilised daily in the capital.\nBut it comes after various major issues have plagued the games, including arson attacks on train networks around France just hours before the Olympics kicked off.\nA national investigation is underway into last week's train sabotage, which disrupted travel for nearly a million passengers in France as well as people in London and other neighbouring countries.\nFrench authorities then had to deal with numerous telecommunications lines being hit in acts of vandalism, affecting fibre lines and both fixed and mobile phone lines, with cities around the country hosting events for the Olympics.\nMarina Ferrari, secretary of state in charge of digital affairs, said at the time: \"Under my supervision, the Center for Defense Electronic Communications cooperates with operators until communications and services are fully restored.\nDON'T MISS: France and Algeria tensions boil after letter from Macron to King of Morocco\nDON'T MISS: Inside King Charles's £400k banquet as Emmanuel Macron blew the budget\nDON'T MISS: Olympics fans all want this man to win gold medal for one strange reason\nOlympics: Brayshaw delighted to 'prove people wrong' with gold medal\n\"I condemn in the strongest terms these cowardly and irresponsible acts. Thank you to the teams mobilised this morning to carry out repairs and restore damaged sites to service.\"\nAnd those aren't the only crises Paris has faced so far. Sébastien Jibrayel, local councillor for sports in Marseille previously proposed selling tickets at lower prices to help fill half-full stadiums.\nAt the start of the Games, football matches were bringing very few people to the stadiums. On Sunday, the stands at the Stade Geoffroy-Guichard (Saint-Étienne) were only moderately full during the defeat of the French women’s team against Canada. Of the 42,000 seats available in the arena, only 25,000 were present.\nTo remedy this apparent lack of interest, Jibrayel proposed to put tickets on sale at the price of 5 or 10 euros: \"When we see an empty stadium, we are not satisfied. The price of tickets must drop further, perhaps to 10€ or even less. Why not 5€?,\" he declared on RMC and La Provence. This price would only be offered 24 hours before the start of the match.\n\"We must be aware of the financial situation of citizens; in difficult times, it would be interesting to review the prices downwards so that everyone can participate in the party,\" he said.\nAccording to Le Figaro Sport, the proposal is on the table.\nThe Paris 2024 Olympics has been approached for comment.",
  "word_count": 640,
  "scraped_at": "2026-02-14T12:09:29.258910"
}