{
  "article_id": "ed384d36fd91",
  "url": "https://www.propublica.org/article/missouri-ag-andrew-bailey-trump-fbi-sam-page",
  "title": "Trump FBI Pick Andrew Bailey Has History of Prosecuting Democrats ProPublica",
  "date": "20250827T111500Z",
  "domain": "propublica.org",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "In late July, Missouri state troopers walked into St. Louis County government headquarters and seized the cellphone of one of the most prominent Democratic officials in this solidly red state.\nTwo days later, a grand jury indicted Sam Page, the St. Louis County executive. Acting as a special prosecutor, Missouri Attorney General Andrew Bailey, a Republican, secured two felony counts of stealing by deceit and two election-law violations.\nFor Bailey, bringing felony charges against the leader of the state’s biggest blue stronghold added to the resume of a MAGA warrior who had already interviewed for a key position in President Donald Trump’s administration.\nLess than three weeks later, Trump tapped Bailey to help run the FBI. He’ll serve as co-deputy director with Dan Bongino, a former Secret Service agent and conservative podcast host. Bailey said he’ll resign as Missouri’s attorney general on Sept. 8 to take the post. A spokesperson said he was not taking questions from the media.\nThe case against Page was the latest in a string of legal strikes against Democrats by Bailey, bringing the full weight of the state on a political adversary. It wasn’t about bribery or self-dealing. Page, the top elected official in a county with about 1 million residents, wasn’t accused of stealing a dime for himself.\nInstead, the charges turned on something mundane: the printing and mailing of flyers weeks before about a measure on the ballot in April — the kind of informational material local governments often send to voters and the sort of action that experts said had never led to criminal charges in Missouri.\nThe election asked voters to give the County Council the power to fire the county’s department heads and its top attorney. Page spent more than $25,000 of taxpayer money to print and mail flyers to voters outlining the measure. The flyer at issue did not overtly tell voters to vote no, but it listed groups that opposed it, including the police board and NAACP, and it quoted a state judge’s ruling that the ballot language was misleading and unfair. It also suggested that a yes vote would allow directors to be fired for political reasons or in emergencies and that a no vote would maintain stable leadership.\nDocuments filed in the case against Page also showed that he did not follow a county lawyer’s advice to make some changes to the flyer. Bailey alleged that the flyer crossed the line from providing information, which is legal, to urging a no vote, which he said was an unlawful use of tax dollars — and, in his view, grounds to seek felony charges.\nIf convicted on the most serious count, Page could face three to 10 years in prison and $10,000 in fines. He could also face removal from office and sanctions against his medical license; he’s an anesthesiologist, though he doesn’t currently practice full time.\n“Public officials must follow the law,” Bailey wrote in a news release, “and my Office will work to ensure that they always do.”\nThe playbook was familiar: Trump has talked about arresting California Gov. Gavin Newsom and New York City mayoral candidate Zohran Mamdani. Federal agents just raided the home of John Bolton, the former national security adviser in the first Trump administration and a prominent Trump critic.\nAttorney General Pam Bondi appointed Ed Martin, who had worked as an attorney in Missouri, to head the U.S. Department of Justice’s Weaponization Working Group and to investigate two prominent Democrats, New York Attorney General Letitia James and U.S. Sen. Adam Schiff of California, on allegations of mortgage fraud.\n“Bailey really was auditioning for that role, or something like it, and what better way to show loyalty than to do exactly what Trump wants on the federal level, but replicated on the state level,” said Paul Nolette, the director of the Les Aspin Center for Government at Marquette University. “It’s a template for what type of approach Bailey is going to take on the federal level. Political opponents are going to get targeted.”\nBailey has called himself a defender of the rule of law, portraying his high-profile lawsuits and investigations in Missouri as necessary to protect the state from what he has described as illegal or unconstitutional actions by the federal government and abandonment of the rule of law by the left.\nPage became county executive in 2019 after a federal corruption case toppled his predecessor, Steve Stenger. Page had led a bipartisan bloc on the County Council against Stenger, who was sentenced to nearly four years in federal prison for a pay-to-play scheme that steered county contracts to political donors. (St. Louis County wraps around — but does not include — the much smaller independent city of St. Louis.)\nThe cooperative spirit collapsed as Page set St. Louis County on the aggressive end of Missouri’s response to the COVID-19 pandemic, issuing early emergency orders limiting gatherings and indoor dining. That stance put him at odds with state officials who were moving to curb local power.\nDespite this and other political battles, Page has twice won countywide elections — first in 2020 to finish Stenger’s term, then in 2022 to a full four-year term. He has said he will decide by the end of the year whether to run again in 2026. He is scheduled to be arraigned on Friday.\n“I don’t think I did anything wrong,” he said in brief remarks to local news reporters at a ribbon-cutting for a county road project.\nA Page spokesperson referred questions to his lawyer, Jeff Jensen, a former U.S. attorney in Missouri during Trump’s first term. Jensen did not respond to requests for comment.\nMany have questioned the legitimacy of the case and whether Bailey’s successor, Catherine Hanaway, will see it through. Hanaway, also a former U.S. attorney, as well as a former speaker of the Missouri House of Representatives, did not respond to questions.\n“It certainly seems, based on my reading of it, a stretch,” said Peter Joy, a law professor at Washington University in St. Louis and an expert in legal ethics and trial practice. “It would be an uphill battle for the state to make this charge stick.”\nKen Warren, a political scientist and pollster at Saint Louis University, said the charges were “totally phony” but that “the more outrageous you are, the more you are going to attract the attention of Donald Trump.”\n“Let’s say the same thing occurred but the county executive happened to be a Republican,” Warren said. “Would Bailey go after him? Of course not.”\nMissouri has become a proving ground of sorts for Trump appointees. Martin — a longtime state GOP insider with a record of stoking controversies— was named the U.S. attorney for Washington, D.C. After it became apparent he couldn’t win Senate confirmation, he was moved to the administration’s pardon office and the Justice Department’s weaponization group.\nJohn Sauer, a former Missouri solicitor general and anti-abortion activist who last year helped bankroll a campaign to defeat Missouri’s abortion rights ballot issue, defended Trump’s claim to presidential immunity before the Supreme Court. Now, as U.S. solicitor general, he serves as the federal government’s top advocate before the Supreme Court.\nWill Scharf, who lost a primary bid last year to unseat Bailey, pivoted straight into Trump’s legal inner circle. Then there’s Billy Long. The six-term ex-congressman was confirmed in June as IRS commissioner — despite having once pushed to abolish the agency — amid scrutiny over his ties to questionable tax-credit plans. He was recently ousted and said he will become ambassador to Iceland.\nThat roster of loyalists is no accident. Over the past two decades, Missouri has moved from being a competitive bellwether state to a deep-red stronghold, with a political environment that rewards the kind of hard-line conservatism and culture-war ethos that Trump prizes.\nJohn Danforth, a Republican who served as Missouri’s attorney general from 1969 to 1976 and then as a U.S. senator until 1995, said the office has shifted dramatically from its core mission. Under him, he said, the job was to represent state agencies, handle every felony appeal, respond to legal opinion requests and manage litigation with a small staff. Asked about a move last year in which Bailey investigated a St. Louis-area school district after a student was beaten during school hours — blaming its diversity policies and removal of resource officers for safety failures — Danforth said, “I wouldn’t have done it.”\nAs the state has shifted right, many races are effectively decided in the primary. Candidates don’t need to win over most voters, according to political experts and observers — just the small, very political group that shows up for low-turnout, winner-take-all primaries. That favors hard-line candidates.\nNowhere is that change clearer than in the attorney general’s office.\nBailey is a U.S. Army veteran who served two tours in Iraq as an armored cavalry officer. He started his career as an assistant Missouri attorney general, then worked as a prosecutor. He joined the governor’s office as deputy general counsel in 2019 and later served as general counsel to then-Gov. Mike Parson.\nHis politicization of the attorney general’s office follows a path blazed by two predecessors, Josh Hawley and Eric Schmitt, who each used relatively brief tenures as the state’s attorney general to launch themselves into the U.S. Senate. In Hawley’s case, out-of-state political consultants were embedded in the office from his first weeks on the job, directing taxpayer-funded staff, shaping his policy rollouts and boosting his national profile ahead of his Senate run. Schmitt used the office to wage headline-grabbing legal fights, from suing China over COVID-19 to challenging pandemic restrictions, elevating his profile as he prepared his own Senate campaign.\nNeither Hawley nor Schmitt could be reached for comment.\nAfter Schmitt was elected to the Senate in November 2022, Parson announced that he would appoint Bailey to fill the vacancy. That set up a high-profile Republican primary last year against Scharf, a candidate with backing from the conservative establishment. Bailey won 63% of the vote and cruised to an easy general-election victory in November.\nWithin a week, Bailey was interviewing with Trump for the job of U.S. attorney general in the new administration.\nWith no Democrats holding statewide office and a GOP supermajority in the legislature, Bailey has turned his fire on Democratic officials in Missouri’s two largest cities. He pressured St. Louis Circuit Attorney Kim Gardner to resign by filing a lawsuit to remove her from office that alleged willful neglect of duty and a failure to prosecute violent crimes, and he recently sought to remove St. Louis Sheriff Alfred Montgomery, accusing him of misconduct. Gardner repeatedly denied any wrongdoing before resigning; later she acknowledged misusing some public funds. Montgomery has denied wrongdoing and has refused to resign.\nKansas City Mayor Quinton Lucas has also been a frequent target: Bailey threatened a Missouri Human Rights Act investigation into Lucas and his staff after a city-run social media account, responding to a speech by the Kansas City Chiefs football player Harrison Butker about women being homemakers, named the suburb where Butker lived. The city deleted the post and apologized. Bailey framed the post as discrimination against Christians.\nLast year, Lucas suggested the city could benefit from asylum-seeking immigrants joining the local workforce, then clarified that he meant immigrants who were in the U.S. legally. Bailey — who had sued the Biden administration over what he called an “illegal” parole program for migrants from Cuba, Haiti, Nicaragua and Venezuela — accused Lucas of trying to involve Missouri businesses in a “fundamentally unlawful program.” He posted a letter on the social media platform X calling Lucas’ comments “wildly irresponsible” and said he was “putting him on notice that it is a Class D felony to knowingly transport an illegal alien in the State of Missouri.”\nLucas responded in a statement then that Bailey’s letter was “a political campaign press release with no legal effect.”\n“It’s not effective lawyering,” Lucas said in a recent interview. “It’s a whole new branch of lawyering that I, as a lawyer, didn’t grow up knowing, which is: If you get a story out, who cares if you drag people through the mud?”\nBailey, on the other hand, has stepped up to defend Republican allies. His office intervened to defend three GOP state senators who were sued for false light invasion of privacy after wrongly identifying a Kansas man as the shooter at a Super Bowl parade honoring Kansas City’s NFL team — and falsely calling him an undocumented immigrant.\nTwo of the senators called the lawsuits frivolous, while Bailey has argued the posts were protected by legislative immunity, as the senators were acting in their official capacity.\nLawsuits against two of the officials, who are represented by the Missouri deputy solicitor general, a high-ranking lawyer in the attorney general’s office, remain pending in federal court.",
  "word_count": 2140,
  "scraped_at": "2026-02-14T14:18:24.525162"
}