{
  "article_id": "ed3e3dfe190a",
  "url": "https://www.foxnews.com/entertainment/prince-william-shares-first-personal-social-media-post-since-kate-middletons-cancer-announcement",
  "title": "Prince William shares first personal social media post since Kate Middleton cancer announcement",
  "date": "20240410T223000Z",
  "domain": "foxnews.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Prince William has returned to social media for the first time following Kate Middleton’s cancer treatment announcement.\nHe posted on both X, formerly Twitter, and Instagram Stories, to comment on the international retirement of Rachel Daly, a star player on England’s national soccer team.\n\"Thank you for so many unforgettable performances with @Lionesses, @RachelDaly3,\" he wrote on the Kensington Royal accounts, which he shares with Middleton, on a reposted photo from Daly's account.\n\"Plenty more goals for Villa now!\" he added, referring to Daly’s plans to continue playing with Aston Villa, at the club level, and signing it with a \"W.\"\nKATE MIDDLETON’S CANCER DIAGNOSIS LEAVES MONARCHY’S FUTURE ON PRINCE WILLIAM’S SHOULDERS: EXPERT\nAccording to People, Prince William and Middleton are spending time as a family while their children, Prince George, Princess Charlotte and Prince Louis, are on a school break.\nFox News Digital reached out to Kensington palace for comment, but they did not immediately respond to the request.\nThe social media post from William is the first personal post he has shared since The Princess of Wales shared her video revealing she has cancer last month on March 22.\nShe explained that following her planned abdominal surgery earlier this year, tests showed \"cancer had been present\" and she was undergoing preventative chemotherapy.\nCLICK HERE TO SIGN UP FOR THE ENTERTAINMENT NEWSLETTER\n\"This of course came as a huge shock, and William and I have been doing everything we can to process and manage this privately for the sake of our young family,\" Middleton said. \"As you can imagine, this has taken time. It has taken me time to recover from major surgery in order to start my treatment. But, most importantly, it has taken us time to explain everything to George, Charlotte and Louis in a way that is appropriate for them, and to reassure them that I am going to be OK.\"\nMiddleton’s absence from the public eye spurred a flurry of rumors and speculation before she made her announcement.\nDuring that time, Prince William was engaged in many of his royal duties, attending public events.\nLIKE WHAT YOU’RE READING? CLICK HERE FOR MORE ENTERTAINMENT NEWS\nOn March 1, he was photographed taking a shot with actor Rob McElhenney, one of the producers of the \"Welcome to Wrexham\" documentary about the town’s soccer team following its purchase by McElhenney and Ryan Reynolds.\nPrince William is active in his support of soccer in the country and has been the president of The Football Association (The FA), the governing body of soccer in England since 2006.\nPeople noted that the royal is an avid fan of Aston Villa and known to attend games to support the team, often with his children at his side.\nCLICK HERE TO GET THE FOX NEWS APP\nLast year, William and Princess Charlotte posted a video on the family’s social media to wish the Lionnesses good luck in the Women’s World Cup last summer, after he announced he would be unable to attend the team’s final match.",
  "word_count": 503,
  "scraped_at": "2026-02-14T13:04:54.968944"
}