{
  "article_id": "ed41e6d18232",
  "url": "https://www.northerndailyleader.com.au/story/8568781/halpin-sisters-make-return-to-national-touch-championships/",
  "title": "Halpin sisters make return to National Touch Championships | The Northern Daily Leader",
  "date": "20240326T183000Z",
  "domain": "northerndailyleader.com.au",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "The Halpin household must have been a perennial whirlwind of activity while Steph, Rachel, and Luke grew up.\nSubscribe now for unlimited access.\nor signup to continue reading\nThe siblings were raised in a sports-mad environment, and have continued that trend well into adulthood.\nBut oddly, even though Steph and Rachel both played representative touch football throughout the age groups and into the senior ranks, neither of them has appeared at the National Touch League Championships for roughly a decade.\nUntil, that is, earlier this month, when they did so together for the Southern Rebels women's 27s.\n\"I thought I'd try to tap back in,\" Steph said.\n\"We tried to get our regional team going and we got knocked back in that space, so I said to Rachel 'Let's put our name in the player pool'.\"\nSteph's absence from the national championships began when she suffered a \"massive\" back injury around 2011 and was forced away from the sport for a period.\nSoon after, Rachel progressed on to a new stage of life with a family and kids, and touch took a back seat.\nSo when the opportunity arose to make a return this year, they both jumped at the chance.\nAlthough, initially, there was no guarantee that they would play together.\n\"We ran the risk of being separated and getting picked up by separate teams, but luckily enough we ended up in the same team, which was so good,\" Steph said.\n\"It's always nice when we play together, it's something I enjoy. We know how each other plays and I think we play well together,\" Rachel said.\nIt was daunting to say the least for both women to jump into a side in which they hardly knew any of the other players.\n\"Having Steph there was probably my comfort zone, it would have been a bigger jump if I did get put into another team,\" Rachel said.\nBut thankfully, Steph added, \"the girls really embraced us\" and could not have been more welcoming.\nThe Tamworth-based siblings quickly settled in and ended up being key presences for the Rebels, who made it all the way to the semi-final before they \"lost the plot\" and were defeated by Western Australia.\nThat, however, did not matter too much to the Halpins. Steph and Rachel were simply happy to be back playing at a high level, and hope to earn selection for NSW in next year's State of Origin series.\n\"I probably wasn't thinking about it when we first went down there,\" Rachel said.\n\"But after playing with the girls and experiencing that level of touch again, I've made it a goal to play at that level again.\"\nThat would be a cherry on the cake for Steph who, at 34, is older than Rachel by two years and was recently named in the Australian women's 27s team to play in the World Cup, set for Nottingham in July.\n\"I'd been away from it for 12 or 13 years, at an Australian level. So when I went to the selection camp, I was really unsure,\" Steph said.\n\"That's a long time away from it, games can change so significantly ... but it's nice to be back mixing it.\"",
  "word_count": 535,
  "scraped_at": "2026-02-14T12:31:50.635456"
}