{
  "article_id": "ed5c38ad3320",
  "url": "https://www.liverpoolecho.co.uk/news/liverpool-news/faces-52-merseyside-criminals-who-27630326",
  "title": "These are the faces of 52 Merseyside criminals who were jailed in August",
  "date": "20230901T050000Z",
  "domain": "liverpoolecho.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "These are the faces of 52 Merseyside criminals who were jailed in August\n£28million gang's 'money man', disgraced PE teacher and murderer were among the crooks locked up this month\nA murderer who hugged a man then stabbed him to death, a disgraced PE teacher and the \"money man\" for a £28million drugs gang were among the Merseyside criminals jailed this month.\nAlso locked up was an armed robber who went on the run for seven years after stabbing a man in a botched stick-up. Meanwhile, Liverpool Crown Court heard that a drugs boss and his brother called on contacts in Brazil, the Netherlands and Spain as they plotted to import cocaine and supply firearms on a \"breathtaking\" scale.\nHere are the faces of 52 criminals from our region who were imprisoned over the past few weeks.\nREAD MORE: Teacher unmasked as Snapchat paedophile 'addicted' to indecent images of children\nLewis Price\nA mum returned home from a friend's house in the early hours to find a shadowy figure lurking in her front window.\nThe homeowner fled in terror after discovering Lewis Price inside her property uninvited. The intruder had been staying next door on his sister's sofa at the time and helped himself to items including electronic goods, money boxes and half a packet of biscuits.\nPrice admitted burglary. He was jailed for 876 days, this being the minimum three-year term for a third-strike burglar minus a reduction for his guilty plea.\nHelen and Michelle McPartland\nTwo sisters wept and wailed in the dock as they were jailed for framing their brother-in-law for a crime he did not commit.\nHelen and Michelle McPartland made up the false allegations amidst an ongoing family feud, sparked when they were left out of their late mother's will. Victim Graham Potter was being wrongly convicted of a criminal offence as a result of their brazen lies, which followed a jibe over a \"tummy tuck\".\nBoth women admitted perverting the course of justice. They were locked up for 10 months each.\nAiden Dodd\nAn eight-year-old girl was left in hospital after an illegal driver smashed into her mum's car.\nAiden Dodd caused the head-on crash while attempting to overtake other vehicles on a blind bend on a country lane, then callously fled the scene. The youngster whom he injured is now a \"nervous wreck\" when travelling on the roads, having suffered a \"nasty\" wound in the collision.\nDodd admitted dangerous driving, failing to stop after an accident and driving without a licence and insurance. He was jailed for 14 months.\nCraig Gallagher, Christopher Van Maren, Wesley Campbell and Marcus Allen\nA pair of brothers called on contacts in Brazil, the Netherlands and Spain as they plotted to import cocaine and supply firearms on a \"breathtaking\" scale.\nCraig and Ashley Gallagher had ambitions to flood the UK with hundreds of kilograms of class A drugs every week while arranging the sale of a frightening arsenal of guns, including AK-47 assault rifles and semi-automatic AR-15s. While the former was today handed a lengthy prison sentence over their multi-million pound operation, his older sibling remains on the run from the law and is believed to be in hiding abroad.\nCraig Gallagher admitted conspiracy to import cocaine, conspiracy to supply cannabis, conspiracy to convert criminal property and assisting an offence of conspiracy to transfer firearms. Appearing remotely from HMP Liverpool, he shook his head after being jailed for 24 years before leaving the video link booth.\nAppearing alongside him was \"trusted\" OGC member Christopher Van Maren, who pleaded guilty to conspiracy to supply cocaine and conspiracy to convert criminal property. The 40-year-old, of Marbury Road in Kirkby, was locked up for 12 years and replied: \"Thank you.\"\nWesley Campbell, a customer of Gallagher's and an onward supplier, admitted the same counts of conspiracy to supply cocaine and conspiracy to convert criminal property. The 39-year-old - of Castle Green in Kingswood, Warrington - was also handed 12 years.\nGang courier Marcus Allen, of Grey Road in Walton, pleaded guilty to conspiracy to supply cocaine and cannabis and conspiracy to convert criminal property. The 29-year-old said \"nice one\" after he was imprisoned for eight years.\nDouglas Webley\nA sick paedophile raped a young girl then branded her a \"nuisance\" and a \"liar\".\nDouglas Webley subjected his victim to a catalogue of vile sexual abuse when she was aged as young as eight. She has described how his sickening actions \"ruined her life\", while her dad says he \"just wants his little girl back\".\nWebley admitted rape and sexual assault. He was jailed for 15 years and four months and handed an additional year on licence.\nThomas Mayer\nA man who drove down the wrong side of the motorway \"risked killing people\".\nThomas Mayer, 21, made off from police while behind the wheel of a Honda Civic near the Knowsley Expressway in the early hours of New Year's Day. He drove at speeds of more than 100mph and crashed into the central reservation before being found hiding in bushes.\nMayer pleaded guilty dangerous driving, using a motor vehicle without insurance and driving otherwise in accordance with a licence. He was jailed for eight months.\nJoanne McGarity\nA woman stole tens of thousands of pounds from her own grandma and left her facing the prospect of eviction.\nJoanne McGarity swindled nearly £50,000 out of her nan over the course of several years in order to fund her gambling addiction. As a result, her elderly victim was left with debts which nearly saw her turfed out of her home of more than three decades and threatened with bailiffs coming round to repossess her belongings.\nMcGarity admitted fraud by abuse of position. She was jailed for two years and eight months and handed a restraining order preventing her from contacting Ms Jones for 10 years, and blew a kiss to family members in the public gallery as she was led down to the cells.\nSuzanne David\nA furious mum led a vicious attack on her daughter's love rival after an argument in a tanning salon.\nSuzanne David, 51, and her daughters Tiffany and Shannon Baker, 26 and 20, brutally attacked Melanie Park outside Tropical Heat on Corinthian Street, Rock Ferry, at around 3.15pm on March 3, 2022. Video footage of the incident, filmed by a passerby, showed David and Tiffany Baker pulling Ms Park to the ground.\nThe former then sat on top of her and banged her head on the pavement, shouting: \"You f****** little sweat, dirty f****** sweat. Don't you dare talk to my f****** kids.\nTiffany was seen punching the complainant to the face at least four times, pulling her hair and dragging her into the road. Shannon then kicked her twice in the head.\nAll three women admitted assault occasioning actual bodily harm. David was jailed for one year and three months, while the sisters received 10 months.\nMark Roberts\nAn armed robber went on the run for seven years after stabbing a man in a botched stick-up.\nMark Roberts, who was once one of the UK's most wanted men, stabbed Mohamad Alkshaib in the chest after cornering him on the driveway of his South Liverpool home and attempting to steal his BMW M4 car and £60,000 Richard Mille watch on September 30 2016. He went on the run and was discovered seven years later in Estepona, near Malaga in southern Spain following an operation involving the National Crime Agency, Guardia Civil and Merseyside Police.\nRoberts admitted attempted robbery and wounding with intent. He was jailed for eight years.\nDarren Gray\nThe \"money man\" for a £28million drugs gang was arrested in Spain after fleeing the country via the Channel Tunnel.\nDarren Gray acted as the bookkeeper for a lucrative organised crime group headed up by Jordan Talbot. Both men sought to head for the continent when their secret dealings over encrypted communications platform EncroChat were exposed - but while one was halted in his tracks at the border, the other successfully made it to Europe and was able to evade justice until now.\nGray admitted conspiracy to supply cocaine, heroin and cannabis and possession of criminal property. Appearing in the dock wearing a grey Nike zip-up top and jeans and sporting long brown hair, a beard and glasses, he was jailed for 17 years.\nRyan Kenny\nRyan Kenny left fellow inmate and paedophile magician \"Professor Paulous\" seriously injured in prison after attacking him and saying \"That's what you get for fiddling with kids.\"\nPaul McKee worked as a children's entertainer to the stars, having performed for soap actors and at private parties for legendary Liverpool FC footballers. But he was secretly a prolific child sex offender, subjecting several young girls to a catalogue of harrowing abuse over the course of nearly 25 years.\nHe then became the victim of a beating behind bars at the hands of fellow sex offender Ryan Kenny on February 15 this year. The incident at HMP Altcourse was caught on CCTV and showed him being punched once from behind.\nMcKee then fell and suffered injuries including a fractured jaw, ribs and vertebrae. Prison guards then intervened, at which point his attacker said: \"That's what you get for fiddling with kids.\"\nKenny, of no fixed address, admitted wounding with intent. Appearing in court via video link, the 29-year-old was handed a further 18 months behind bars.\nRyan Daly and Luke Davies\nA drug dealer was banned from owning dogs after he left his own without food or water.\nThe Halewood home of Ryan Daly was raided after an investigation by Cheshire Police into the sale of illegal drugs in the Northwich area. Phones used to orchestrate the distribution were linked to the 27-year-old to and Luke Davies.\nDuring a police raid at Daly's property, officers found a dog which had been left without access to food or water for a prolonged period and the floor covered in dog faeces and urine. The animal was taken away from the address for its own welfare.\nBoth were subsequently charged with being concerned in the supply of cocaine, ketamine, and cannabis while Daly was also charged with failing to ensure the needs of a dog are met. He was jailed for four years, with Davies receiving four-and-a-half years.\nDean Welch\nA young child was left alone in a flat with weapons and drugs \"at arm's length\" when the dealer who was meant to be looking after the youngster went to sell cannabis on the street.\nDean Welch left the child in his \"squalid\" and freezing cold apartment, wearing only a school jumper and a nappy and with only a bullmastiff and two bulldogs for company. The property was described as being filled with an \"overwhelming smell of excrement and urine\" and was also being used to store thousands of pounds of cocaine.\nWelsh admitted possession of cocaine and cannabis with intent to supply, possession of criminal property and child neglect. Wearing a black Berghaus hoodie in the dock, he was jailed for three years and three months.\nDarren Ablett\nA cocaine trafficker was rumbled thanks in part to a picture showing him with his feet up watching Spider-Man.\nThe infiltration of EncroChat by law enforcement authorities in 2020 saw a light shone on the criminal underworld, with those using the network to trade in drugs and illegal weapons having their previously secret discussions laid bare for the world to see. And when investigators combed through the communications of the service user behind the monikers \"HonestMallet\" and \"IvyHound\", who had been connected to the supply of 27.5kg of cocaine, they discovered a whole host of clues which led them straight to the door of Darren Ablett's home in Melling.\nThis trail of breadcrumbs included chatter about Hollyoaks, luxury cars, \"making millions\" and previous spells spent behind bars. He had also spoke of supposed warnings made to one of his debtors, in which he was said to have threatened that he was \"gonna blow his and his dad's wigs off\".\nAblett was found unanimously guilty of conspiracy to supply cocaine by a jury after only an hour of deliberations. He was jailed for 20 years.\nJames Ireland\nA killer was told to \"rot in hell\" and branded a \"murdering b******\" by his victim's grieving girlfriend as he was jailed for life.\nJames Ireland savagely knifed Billy Moore in the face, throat and chest on the doorstep of his own home only minutes after the two had hugged in the street. He was unanimously convicted of the 31-year-old's murder by a jury last month after one hour and 53 minutes of deliberations.\nHe returned to Liverpool Crown Court to be sentenced and nodded as he was told he must serve at least 19 years behind bars before being eligible for release on parole. Mr Moore's bereaved partner then left the courtroom screaming: \"James Ireland you murdering b******\", I hope you rot in hell.\"\nSteven Laverty\nA disgraced PE teacher who had sex with a former pupil has been jailed.\nSteven Laverty was banned from teaching 10 years ago after his wrongdoing first came to light. But he has only now faced justice over his sickening sexual activity with the girl, whose life was said to have been \"destroyed\" by the abuse of trust.\nLaverty was found guilty of one count of sexual activity with a child by a jury. He was locked up for three years and told to sign the sex offenders' register for life.\nSteven Shannon\nA \"couple of geeks\" converted blank firing guns into functioning weapons for sale.\nPolice discovered a modified firearm hidden in the attic of Steven Shannon's home before the contents of his phone revealed his and Sean Aspinall's plot to supply such items. A judge said their actions had \"potentially lethal consequences\".\nShannon admitted conspiracy to possess prohibited weapons for sale, conspiracy to convert imitation firearms into firearms and possession of a prohibited firearm and ammunition. Supporters in the public gallery gasped and wept as he was jailed for eight years.\nAspinall was previously jailed for nine years in March 2023, having been convicted of conspiracy to supply a prohibited weapon and conspiracy to convert an imitation firearm into a firearm following a trial. The 24-year-old also pleaded guilty to possession of an offensive weapon in a private place and possession of a class B drug.\nGareth Bullock\nPolice found a teenage boy hiding down the side of a paedophile's bed and another on the window ledge of his third-storey flat.\nGareth Bullock is banned from having any contact with male children after he was caught with a stash of vile indecent images. The 40-year-old attempted to feign ignorance when officers found two youngsters hidden in his apartment in the earlier hours, in violation of this court order.\nBullock admitted breaching a sexual harm prevention order and breaching a community order. He was jailed for two-and-a-half years.\nAnthony Lucas\nA dad has been urged to stop committing crimes \"if he loves and cares for his son\".\nAnthony Lucas left his ex-girlfriend \"living in fear\" after consistently \"hounding\" her and \"making her life a misery\". This campaign of harassment included hurling abuse at her as she picked their child up from primary school while young children played nearby.\nLucas was found guilty of two counts of harassment and two counts of breaching a non-molestation order during a trial and admitted breaching a suspended sentence order. Appearing in the crown court for sentence via video link to HMP Altcourse, he was jailed for two years.\nRobin Cunningham\nA \"sexually deviant\" pensioner stood on furniture while performing sex acts out of his bedroom window as horrified children watched on.\nRobin Cunningham repeatedly flashed kids outside his home over a period of more than a decade. The previously convicted sex offender was said to have \"derived sexual gratification from being seen\" by the youngsters, who were left \"corrupted\" by his sickening actions.\nCunningham admitted five counts of engaging in sexual activity in the presence of a child and three of exposure. He was jailed for two-and-a-half years.\nOwen Cotton\nA petty argument in a city centre bar erupted into an all-out melee as a gang of men rained down vicious blows on two strangers.\nOwen Cotton, 24, Mark Bleasdale, 34, and Luke Abrams, 23, attacked Matthew Burke and Andrew Whittaker in the Manhattan Bar and Grill on Fenwick Street at around 10pm on February 25. Both suffered serious injuries after being struck with a glass by Cotton, who also attacked another man, John Rainier, who happened to be sitting nearby.\nCotton, of Berwick Close, Newsham Park, pleaded guilty to two counts of grievous bodily harm and one count of unlawful wounding. Bleasdale, of Bardsay Road, Walton pleaded guilty to affray while Abrams, of Belmont Road in New Brighton - who was said to have been trying to play \"peacemaker\" before joining the melee - pleaded guilty to threatening behaviour.\nCotton was sentenced to a total of three years and 11 months in prison. Bleasdale was sentenced to 19 weeks, suspended for 18 months, and ordered to carry out 25 days of rehabilitation, 100 hours of unpaid work, and a thinking skills programme while Abrams was given a £375 fine.\nGordon Rhodes\nPolice discovered three guns in a raid on a Netherton house.\nThe home of Gordon Rhodes, on Abbeystead Avenue, was stormed by officers in February this year. Detectives found three firearms, including a Glock and two revolvers, three small bullets, a quantity of cash and cannabis.\nThe 57-year-old was jailed for nine years and nine months after being convicted of three counts of possession of a firearm, three counts of possession of ammunition and possession of cannabis.\nDellwyn James\nA convicted murderer told his ex he would send a man in a balaclava to \"come looking for her and do her in\".\nDellwyn James was previously locked up for life after stabbing his teenage girlfriend Rae Torbet to death during a frenzied attack in her own flat. He is now back behind bars after making chilling threats towards another former partner, whom he warned: \"You had better watch out.\"\nJames admitted making threats to kill. Appearing via video link to HMP Altcourse, he was jailed for 18 months.\nTerence Wilson\nA heroin and cocaine trafficker known as \"Sylvester the Cat\" fled the country after his lockdown haircut brought the police to his door.\nTerence Wilson called on criminal contacts overseas as he traded class A and B drugs in huge quantities over encrypted communications platform EncroChat. He later fled the country when officers came knocking, his secret identity having been rumbled by pictures he had sent to fellow service users - including a selfie showing his makeshift trim amid Covid-19 restrictions - and them wishing him a happy birthday.\nWilson admitted conspiracy to supply heroin, cocaine, cannabis and cannabis resin. Appearing via video link to HMP Dovegate, he was jailed for 14 years and three months.\nLucy Letby\nBaby killer nurse Lucy Letby will never be freed from prison.\nThe 33-year-old became the UK's most prolific child killer after being convicted of murdering seven newborns and attempting to kill a further six. Her horrific and cruel crimes were committed over the course of a year while she was working on the neonatal unit at the Countess of Chester Hospital.\nLetby, who also spent time on placement at Liverpool Women's Hospital in 2012 and 2015, was sentenced at Manchester Crown Court on Monday. She refused to attend the hearing but was handed a whole life order in her absence, meaning she will never be eligible for release from jail.\nSentencing, Mr Justice Goss said: \"You acted in a way that was completely contrary to the normal human instincts of nurturing and caring for babies and in gross breach of the trust that all citizens place in those who work in the medical and caring professions. In your evidence you said that hurting a baby is completely against everything that being a nurse is, as indeed it should be.\n\"You also claimed you never did anything that was meant to hurt a baby and only ever did your best to care for them. That was but one of the many lies you were found to have told in this case.\n\"There is no doubt that you are intelligent and outwardly were a very conscientious, hard-working, knowledgeable, confident and professional nurse, which enabled you repeatedly to harm babies on the unit without arousing suspicion for some time. There was premeditation, calculation and cunning in your actions.\n\"The great majority of your victims suffered acute pain as a result of what you did to them. They all fought for survival.\n\"Some, sadly, struggled in vain and died. You knew that the last thing anyone working in the unit would or did think was that someone caring for the babies was deliberately harming them.\n\"As the number of unexpected and unexplained collapses and deaths escalated, senior doctors started to think the unthinkable and consider the possibility that someone was, in fact, deliberately harming the babies and you were identified as the common factor. You had a detached enthusiasm for the resuscitations and what followed.\"\nLiam Mousdell\nA Merseyside drug dealer sold around £11,000 worth of heroin and crack cocaine from a caravan in Wales.\nLiam Mousdell, from Prescot, was caught when police followed a drug user into a caravan park in Rhyl, where the drug dealer was staying. The 24-year-old tried to flee from officers but was found in possession of a rock of crack cocaine and a ringing mobile phone which he attempted to reset to its factory settings.\nA search of his caravan revealed cannabis, scales and cutting agents while his messages revealed that he had sold in the region of £11,000 of heroin and crack cocaine within a month. Mousdell, of Beaconsfield, pleaded guilty to two counts of possession with intent to supply class A drugs and possession of class B drugs and was sentenced to a total of 27 months imprisonment.\nCalum Fairclough\nA man tried to blackmail what he thought was a 12-year-old girl into sending him naked pictures.\nCalum Fairclough used the online name \"Mistressmeg2000\" to lure in what he thought was a young girl and offered to \"help her work out whether she liked boys or girls\" before sending images of his private parts. The 26-year-old asked her to send him pictures of her breasts, and when she refused, he threatened to \"post her pictures all over the internet and send them to her mum.\"\nHowever, he had no idea that the supposed 12-year-old was in fact an undercover police officer. Fairclough pleaded guilty to three counts of making indecent images, possession of indecent photographs of children, two counts of taking an indecent images, attempted blackmail, attempted sexual communications with a child, and attempting to cause a child to watch a sexual act and was jailed for four years.\nDonna Wells\nA \"greedy\" conwoman who stole more than £150,000 from the charity she worked for has been arrested in Turkey.\nDonna Wells was detained abroad around nine months after she fled the UK, two days before she was due to face justice over her long-running campaign of fraud. The charity boss transferred tens of thousand of pounds out of her employers' bank account and into that of her friend's butty van, as well as swiping cash and purchasing gift vouchers for herself using the company credit card.\nWells was handed an additional four weeks behind bars for breaching bail, having previously been handed four years for her scam in her absence. She nodded and said \"thank you\" as she was taken down to the cells.\nArmani Costell\nA woman threw a television at her girlfriend while she was having a bath during a year-long campaign of abuse.\nArmani Costello \"severely abused\" her partner over the course of their relationship, also hurling ornaments at her and headbutting her during regular assaults. Her victim has been left living as a \"recluse\", having suffered \"significant injuries and psychological trauma\" at her girlfriend's hands.\nCostello admitted controlling and coercive behaviour and breaching a suspended sentence order. Appearing via video link to HMP Styal wearing a black Montirex puffer jacket, she was handed 30 months in a young offenders' institute and handed an indefinite restraining order.\nLinda Titterington\nA racist terrorised a woman by using \"disgusting\" slurs and threatening violence.\nLinda Titterington, of Upper Pitt Street in the city centre, harassed a woman between May 20 and July 21 of this year. During this time she made racial slurs and threatened her with violence, which was racially aggravated.\nTitterington was sentenced to 10 weeks in jail after pleading guilty to a hate crime. As well as a prison sentence, the 54-year-old was also handed a restraining order not to contact the victim.\nAndrew Contento\nA paedophile ranted \"that's a lie\" after a heroic dog called Monty caught him red-handed.\nAndrew Contento feigned innocence when the police came knocking at his door. But the serial sex offender was rumbled once again when officers introduced him to a police dog specially-trained to sniff out hidden electronic devices, who then discovered a hidden phone which contained a sickening collection of indecent images.\nContento admitted three counts of making indecent images, possession of prohibited images of children and breaching a sexual harm prevention order. Appearing via video link to HMP Altcourse, he was jailed for 20 months.\nRicky Hamblin\nA couple's romantic getaway ended with the girlfriend screaming for help from a hotel balcony.\nRicky Hamblin locked his partner inside their room at Formby Golf Club during a vicious drunken assault, in which he left her face bloodied and bruised and caused her to gasp for breath as he throttled her. But the heavily convicted thug has promised a judge that he is \"not gonna mess up again\".\nHamblin admitted assault occasioning actual bodily harm, intentional strangulation, criminal damage and possession of cannabis. He was jailed for 20 months.\nSara Oliveria and David Lee\nA paedophile couple met for the first time in the dock at court after being convicted of a series of disturbing child sexual offences.\nSara Oliveria and David Lee hatched their sickening plot, which saw her film herself performing sex acts as a young child watched, in a series of Facebook and WhatsApp messages. She then sent these videos to the man, whom she had never actually seen in person, in order to fulfil his depraved \"thrills and satisfactions\".\nOliveria admitted two counts of engaging in sexual activity in the presence of a child. She was jailed for 16 months and told to sign the sex offenders' register for 10 years.\nLee pleaded guilty to encouraging an offender, possession of indecent images and three counts of making indecent images. He was imprisoned for two years, as well as being handed a sexual harm prevention order and a notification requirement - both of which will run for the next decade.\nWilliam Dickinson\nA pensioner left a stranger with a broken cheekbone after hitting him in the face with his walking stick after a night out.\nWilliam Dickinson cracked the complainant in the head with the makeshift weapon after being pushed in the chest by the younger man when a dispute erupted between the pair in the early hours. He was then found armed in the street just over two weeks later by police officers investigating an alleged knife attack.\nDickinson admitted wounding without intent, possession of a bladed article in a public place and assaulting an emergency services worker. Appearing via video link to HMP Altcourse, he was jailed for 14 months.\nScott McKay\nAn arsonist who was found by police with his face covered in soot after setting a string of fires claimed that he was actually coated with gloss paint.\nScott McKay torched his way through the streets of Birkenhead in the early hours, setting two houses, five wheelie bins, three skips, two hedges and a tree ablaze. His trail of fire led to pensioners being evacuated from their homes and police officers being bitten by a distressed dog.\nMcKay admitted 12 counts of arson being reckless as to whether life was endangered. Appearing via video link to HMP Altcourse, he was jailed for 50 months by Recorder Kate Cornell.\nJustin Fraser\nA police sergeant used the force's system to stalk a junior colleague after she called off their affair.\nJustin Fraser, 51, a former response sergeant with Lancashire Police, launched a campaign of harassment against the woman, using confidential police systems to check on her whereabouts and gather 'evidence' she was having an affair with another colleague - an allegation which had no basis.\nFraser, of Holliers Close, Maghull, reported the woman to her supervisor in an attempt to cause trouble for the junior officer. A judge at Preston Crown Court said his actions were \"malicious\" as he jailed him for 21 months after he pleaded guilty to stalking and misuse of police computer systems.\nRyan Gildea, Jordan Needham, Jodie Hewitt and Loretta Clinton\nA group attempted to chop off a vulnerable victim's thumb and little finger in a \"Quentin Tarantino\" style attack.\nIn February this year, four people attacked a \"vulnerable\" man in his own home as they attempted to chop off his thumb and little finger with garden secateurs. Liverpool Crown Court heard that the man, who had been a victim of cuckooing, had been forced out of his own home in the Fairfield area for several months so that class A drug supply could take place.\nBut when he attempted to return to his flat to pick up his personal items, he was attacked. Trevor Parry-Jones, prosecuting, told the court that the victim was himself in debt of around £200 but the attack that occurred was a \"Quentin Tarantino style revenge\" that was \"totally out of kilter with the balance of debt\".\nAppearing before the court for sentencing were Ryan Gildea, Jordan Needham, 33, Jodie Hewitt, 31, and Loretta Clinton, 33, who were all in the flat at the time. The court heard that there was an \"indication a drug dealer wanted to see his finger amputated\" after the former received a phone call.\nMr Parry-Jones said the flat had been \"taken over\" for the past 12 months and that Gildea was the \"leading man\". When the victim returned to pick up his belongings he was \"grabbed by his neck\" and the 40-year-old attempted to remove his little finger with the weapon, shouting \"he's coming here, he wants your finger.\"\nThe prosecutor added that there was \"blood everywhere\" as Hewitt then attempted to sever his thumb, despite struggles from the victim. The court heard how the four were arrested but during interview, Gildea kept \"pretending to be asleep\" and Hewitt said it \"never happened\".\nGildea was given a custodial sentence of 81 months with an extended licence period of 39 months. Hewitt was given a total sentence of 64 months.\nNeedham was handed 54 months in custody. Clinton received 21 months.\nRaymond Henharen\nA paedophile whisked a boy away from his mum in a shopping centre while promising to take him to an arcade.\nRaymond Henharen befriended the youngster's family on a day trip before his behaviour started to ring alarm bells with his parents. The convicted sex offender began obsessing over the teenager, convincing his unwitting mother to leave him in her care and hounding his dad to allow them to play football together.\nHenharen, who was assisted by a British sign language interpreter in court, admitted breaching a sexual harm prevention order. Wearing a black North Face hooded top under a black coat in the dock, he was jailed for 20 months.\nJack Powell\nThe head of a county lines drug dealing gang has been jailed.\nJack Powell has been sentenced to 33 months for running a class A drugs line into Widnes. The 26-year-old, of Abingdon Road in Walton was identified as the controller of the \"Connor\" line by Operation Toxic officers as part of an investigation drug dealing and child criminal exploitation.\nPaul Whalley\nA robber smiled and joked with an old woman on a bus moments before he violently yanked a gold chain from around her neck.\nPaul Whalley had held a convenience store up at knifepoint only minutes before he struck up a seemingly pleasant conversation with the widow. But he then followed the elderly cancer patient as she exited the service and attacked her for her jewellery, which had been given to her by her late husband and has never been recovered.\nWhalley admitted two counts of robbery and possession of a bladed article in a public place. Appearing via video link to HMP Altcourse, he was jailed for nine years.\nAbdirashid Hassan\nA teenage girl was left in tears after being sexually assaulted as she walked to the shop.\nAbdirashid Hassan preyed upon his victim in the street after drunkenly stumbling out of a nearby pub. He \"thrust\" himself at her only hours after making a series of crude, sexually charged comments towards a young charity volunteer.\nHassan admitted sexual assault and harassment. Appearing via video link to HMP Altcourse, he was jailed for 50 weeks as well as being told to sign the sex offenders' register for 10 years and given a restraining order lasting the same period.\nGet the latest news from Merseyside's courts by signing up to our newsletter",
  "word_count": 5575,
  "scraped_at": "2026-02-14T13:00:21.889911"
}