{
  "article_id": "ed69d8f27af4",
  "url": "https://www.leighjournal.co.uk/news/25728423.tyldesleys-ella-toone-awarded-mbe-new-years-honours/",
  "title": "Tyldesley Ella Toone awarded MBE in New Year honours",
  "date": "20251229T231500Z",
  "domain": "leighjournal.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "TYLDESLEY’S England and Manchester United footballer Ella Toone has been awarded an MBE in the New Year’s Honours list for services to football.\nThe double women’s European Championship winner is not the only member of the national squad to be honoured.\nEngland women's football head coach Sarina Wiegman has been awarded an honorary damehood after leading the Lionesses to a successful defence of their European Championship title and several of her team have also been honoured.\nIn addition to Wiegman's honorary damehood, England football captain Leah Williamson becomes a Commander of the Order of the British Empire (CBE) while four team-mates who were part of the Lionesses' title-winning squad for a second time - Alex Greenwood, Georgia Stanway, Ella Toone and Keira Walsh - are made a Member of the Order of the British Empire (MBEs).\nWiegman said: \"I would like to express my sincere gratitude for this honour.\n\"When I first arrived in England, I could never have imagined the respect and warmth I've experienced from the English people. I deeply thank the fans for their support.\n\"This title is a reflection of my exceptional team of players and staff. My congratulations go to Alex, Ella, Georgia, Keira, Leah and also Dr Ritan Mehta who have all been celebrated for their brilliant contributions.\n\"Our team values mean that when there is recognition for one, then there is recognition for all. I want to pay tribute to every member of our EURO squad.\n\"They should all be celebrated for everything they brought to the pitch and for the positive role they play in society. I'm proud to work alongside such a dedicated group of people.\n\"It's been a special year and as we look ahead to our next objective, qualifying for the 2027 World Cup, we hope we can continue to make the country proud.\"\nCulture Secretary Lisa Nandy hailed the achievements of the women's football and rugby teams and said: \"To have two England teams - in two of our most loved sports - win major tournaments in the space of a few months was just extraordinary.\n\"You've united the country, inspired girls and boys everywhere to get into sport and well and truly changed the game.\"",
  "word_count": 368,
  "scraped_at": "2026-02-14T13:07:15.766138"
}