{
  "article_id": "ed700e6f78c1",
  "url": "https://www.thisdaylive.com:443/index.php/2024/03/28/former-spanish-fa-boss-rubiales-faces-two-and-half-year-jail-term",
  "title": "Former Spanish FA Boss , Rubiales , Faces Two - and - half - year Jail Term",
  "date": "20240328T043000Z",
  "domain": "thisdaylive.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Latest Headlines\nFormer Spanish FA Boss, Rubiales, Faces Two-and-half -year Jail Term\nKISSING SCANDAL\nSpanish prosecutors have announced they are seeking a two-and-a-half-year prison sentence for the country’s former FA chief Luis Rubiales over the infamous ‘Kissgate’ scandal.\nThey said on Wednesday they also wanted him to pay Jenni Hermoso €100,000 (£85,000) in compensation if he is convicted at trial\nThey laid out their pre-trial demands in a six-page indictment made public on Wednesday.\nThey said they were seeking a one-year jail term for a sexual assault charge and a separate one-year six-month prison sentence for coercion linked to his alleged attempts to get Jenni to speak out in his defence over the ‘unwanted’ kiss he gave the Women’s World Cup winner last summer.\nMadrid-based judge Francisco de Jorge paved the way for Rubiales to be tried earlier this year after recommending he be put in the dock.\nHe said his long-running probe had uncovered ‘solid evidence’ pointing to the potential illegality of the kiss.\nMr De Jorge, who has already quizzed the former football boss and his alleged victim separately in closed sessions at Spain’s centralised Audiencia Nacional court, said in a five-page ruling made public in January: ‘The investigation has revealed the existence of solid evidence the kiss Luis Manuel Rubiales Bejar gave the player Jennifer Hermoso was not consensual and was a unilateral and surprise initiative on his part.\n‘Whether there was no any erotic intention or it was a result of the state of euphoria and excitement experienced as a consequence of the extraordinary sporting triumph preceding it is something that should be valued in a public trial.’\nHe said he had concluded Hermoso had been left ‘bewildered and surprised’ by the ‘unexpected’ kiss and ‘didn’t have time to react’ after Rubiales grabbed her by the head with both hands and locked lips with her at the awards ceremony in front of millions of TV viewers watching live last August.\nHe also proposed former Spain’s World Cup women’s team manager Jorge Vilda, men’s team director Albert Luque and former Spanish FA marketing director Ruben Rivera should face trial.\nMr de Jorge said in his written ruling he believed there was enough evidence to proceed with a formal accusation against all three men for their ‘concerted action’, agreed with Rubiales, to try to ‘break Jennifer Hermoso’s will and get her to agree to record a video saying the kiss had been consensual’ as the controversy surrounding the former Spanish FA chief’s action exploded.\nHe accused Rubiales of pressuring Jenni to publicly support him on the plane back from Sydney in Australia where the Spain team won last August’s final against the England women’s team before asking Vilda to speak to her brother and try to convince her to record a video saying the kiss was consensual.\nHe went on to detail how his investigation had discovered evidence pointing to Vilda subsequently telling the footballer’s sibling her failure to assist with the video would have ‘negative consequences’ for her.",
  "word_count": 501,
  "scraped_at": "2026-02-14T12:31:48.297533"
}