{
  "article_id": "ed9bf5867940",
  "url": "https://nltimes.nl/2023/05/30/edwin-van-der-sar-ajax-ceo-mens-team-worst-finish-14-years",
  "title": "Edwin van der Sar out as Ajax CEO after men team has worst finish in 14 years",
  "date": "20230530T131500Z",
  "domain": "nltimes.nl",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Edwin van der Sar out as Ajax CEO after men’s team has worst finish in 14 years\nEdwin van der Sar has resigned from his position as the CEO at Ajax after the men’s team finished in third place in the Eredivisie. It was the team’s worst finish since the 2008-2009 season. His contract was due to expire at the end of the 2024-2025 season, but the resignation will be effective from Wednesday.\n\"After almost eleven years on the board, I am done. We have experienced wonderful things together, but it has also been an incredibly tough period,” Van der Sar said on Tuesday. “I am very grateful for the people I have met and worked with during my second career at Ajax, and what we have achieved and been through together. I feel the need to take some distance, to get some rest, and to do other things.”\nVan der Sar took the job at Ajax in 2016. His team took part in the Champions League each year, and won the Eredivisie three times and the KNVB Cup twice under his leadership. The men’s team lost the final of the KNVB Cup this year, and with a third place finish on the table will wind up in the Europa League next year.\nThe team said that Van der Star’s decision was his alone. “We wanted Edwin to stay, but he had made his decision. We have to respect that. The last season does not reflect the entire period that he has been in charge of Ajax,” said Supervisory Board Chair Pier Eringa.\nVan der Sar has been under pressure for the last two years amid internal conflict and turmoil at the club. Marc Overmars left the team amid a scandal over sexual harassment and transgressive behavior, and landed at Royal Antwerp FC where his team took a championship this year.\nTransfers brought in a large cash windfall for the team while eviscerating their starting lineup. Popular manager Erik ten Hag also fled for Manchester United. More recently, the leadership at Van der Adar’s club was criticized for downplaying the championship won by their top women’s team, and refusing to organize an official celebration for them.\n“It doesn’t feel good to take decisions about the future of this wonderful club in the coming period. That is why I have decided to resign,\" Van der Sar said.\n”He will transfer his duties to his colleagues on the Board of Directors from June 1, 2023 onwards. The Supervisory Board has requested Van der Sar to formally remain in his position until August 1, to ensure a good transfer of both national and international dossiers,” the team said in a statement.\nVan der Sar, now 52, Made 130 appearances as the goalkeeper for the Dutch men’s national during a storied football career. He joined the Ajax board as marketing director in 2012 and currently holds board positions at FIFA, UEFA, and ECA.",
  "word_count": 489,
  "scraped_at": "2026-02-14T13:09:02.509001"
}