{
  "article_id": "edb2018fbc8a",
  "url": "https://www.thedailystar.net/opinion/views/news/remembering-roushan-jahan-my-sister-teacher-comrade-4031011",
  "title": "Remembering Roushan Jahan : My sister , teacher , comrade",
  "date": "20251110T070000Z",
  "domain": "thedailystar.net",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Remembering Roushan Jahan: My sister, teacher, comrade\nRoushan Jahan, one of the pioneer researchers on women's empowerment, passed away on Tuesday, November 4, 2025. She was my sister, four years older than me, and the firstborn amongst six siblings. She was a born teacher, and when I was growing up, I completely relied on her to give answers to all my questions on any subject! My younger brother Kabir and I had problems pronouncing some Bangla syllables when we were children. Though she was barely eight or nine herself, Roushan managed to teach us how to move our tongue to pronounce correctly. Later in life, Roushan and I shared a common passion for doing research and writing on women's empowerment.\nShe was an exceptionally bright student, curious to read everything from the age of four. Roushan was especially fond of literature. She was articulate, made friends easily, and her teachers in school, college and university recognised and appreciated her many talents. Though I was four years younger, and she could have easily chosen to spend time with friends of her own age group, she devoted an enormous amount of time to me, telling me stories, playing with me, and teaching me Bangla and English grammar and literature. We were inseparable as children and all through our school and college years till she left for her higher studies in English literature at the University of Chicago on a Fulbright scholarship in 1961.\nRoushan not only excelled in her studies. She participated in school theatres and learnt music from Ustad Ayet Ali Khan in Cumilla. She was interested in films and sports. I remember, when Calcutta Mohammedan Sporting Club came to Dhaka to play football, Roushan and I went to the stadium to watch the game, only two girls in a sea of men! She was quite fearless in taking these bold decisions.\nRoushan was a favourite student of both Dr Syed Sajjad Hussain and Dr Khan Sarwar Murshid in the English Department at Dhaka University (DU), which was quite an achievement! After passing her MA in English literature, she taught briefly at Eden College and then joined the teaching faculty of the English Department at DU.\nAt the University of Chicago, again, she was a favourite student of Professor Edward C. Dimock. She helped him in his translation work and taught Bangla to US students, many of whom still remember her fondly. At age 92, Professor Ralph Nicholas, also from the University of Chicago, remains grateful to Roushan for teaching him Bangla. The recordings of her teaching were used for years at the university. At Chicago, she also met Muzaffar Ahmed, who was then a PhD student in the economics department. They later got married when Roushan returned to Dhaka in 1966. I missed her wedding because I was doing my PhD at Harvard University during that time.\nRoushan never got back to her teaching career at DU after marriage. I always considered this a great loss to the nation because she could have produced so many great scholars in both English and Bangla literatures and linguistics. She had a special skill in teaching people. Generations of students were deprived of learning from a great teacher!\nHowever, when I started my own initiative of doing research on women in 1973 and requested her to join our study group, which used to meet once a week at our house, she readily agreed. I wrote my first article on \"Women in Bangladesh\" in English in 1973 and Roushan translated it into Bangla for wider dissemination. Ahmed Sofa organised a large lecture at DU, where I presented my article in Bangla. Razia Khan Amin and Suraiya Khanam were the other two discussants. Many young people participated in the lecture.\nIn 1975, we registered our study group as an NGO titled \"Women for Women,\" and published a book with the same title, where Roushan contributed an article \"Women in Bangla Literature.\" She later became the president of Women for Women and kept this voluntary organisation alive for the next two decades through her research and writings. Throughout the 1980s and 1990s, she did pioneering research on many issues and published many books. Though a student of literature, she did research and wrote on wide-ranging subjects such as education, health, human rights, environment, politics, workers' conditions and violence against women. Her noteworthy publications include Hidden Danger, where she presented data on domestic violence, and No Better Options, co-authored with Hameeda Hossain and Salma Sobhan, where she analysed the working conditions of women industrial workers, based on findings of survey research. Both were pioneering research studies. Her most famous work was an edited version of Rokeya Sakhawat Hossain's Sultana's Dream, which was published by the Feminist Press in New York and was widely used as a textbook in women and gender studies courses in US universities. The book is still much in demand. She translated into English parts of Rokeya's Oborodh Bashini and also Ahmed Sofa's Onkar.\nIn addition to research and writing, Roushan was actively involved with other women's and civil society organisations such as Bangladesh Mahila Parishad, Ain o Salish Kendra, Campaign for Popular Education (CAMPE), Education Watch and Bangla-German Shampriti (BGS). She worked on a voluntary basis in all these organisations for decades with commitment and dedication. She was always a behind-the-scene worker, never trying to promote herself as a leader. She wrote or edited the reports of many of these organisations.\nRoushan also actively participated in many regional and international conferences. We both attended the UN Women's Conference in Nairobi in 1985, and we three sisters Roushan, Nilufar and I attended the fourth UN Women's Conference in Beijing in 1995. Roushan and Nilufar were not only my sisters, but we all became comrades fighting a common cause. Now, Roushan's daughter Sohela Nazneen has joined the same good fight.\nRoushan and my close bonding might have come as a surprise to many, as we had very different personalities. Roushan was a truly kind and humble person, never hurting anybody, never pushing herself forward, almost a saint-like figure. I was the total opposite! But we never quarrelled, largely because Roushan was always so very loving and forgiving. She has left a void in my life that will never be filled. I will miss her every day of my remaining days, but will always rejoice remembering our happy memories together, walking in the garden where Roushan could identify every tree and flower, looking at the stars as she named them all, reading a book or a poem where she could recite every line, or listening to a song where she could sing along. She enjoyed the simple things of life. She was my first teacher, who opened my eyes to the wide vista of a world beyond me. I thank my lucky stars that such an exceptional human being appeared in my life and kept me company for so many years.\nRounaq Jahan is a political scientist, author and distinguished fellow at the Centre for Policy Dialogue (CPD).\nViews expressed in this article are the author's own.\nFollow The Daily Star Opinion on Facebook for the latest opinions, commentaries, and analyses by experts and professionals. To contribute your article or letter to The Daily Star Opinion, see our guidelines for submission.",
  "word_count": 1215,
  "scraped_at": "2026-02-14T14:21:21.985964"
}