{
  "article_id": "edc2241554c7",
  "url": "https://www.newsweek.com/entertainment/celebrity-news/alabama-barker-new-boyfriend-scooter-jackson-2042376",
  "title": "Alabama Barker Debuts New Boyfriend on TikTok",
  "date": "20250310T174500Z",
  "domain": "newsweek.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Alabama Barker has a new boyfriend amid her ongoing feud with Bhad Bhabie.\nOn Sunday, March 9, the influencer uploaded a couple of videos to TikTok debuting her new relationship. In one video, the daughter of Travis Barker and Shanna Moakler wore a red silk button down and danced with her new man, who has been identified as Scooter Jackson.\nJackson, who hails from Compton, California, is on the football team at the University of California at Los Angeles (UCLA). His freshman and part of his sophomore year, he played defensive back for Utah Tech. He has since joined the UCLA squad, transferring to the school in the middle of his sophomore year. Jackson announced his decision to transfer back in December 2024.\n\"I'm home,\" he captioned a post on X (formerly Twitter).\nNow, he's linked up with Alabama, though it's unclear how long the two have been an item. In another TikTok uploaded on Sunday, March 9, Alabama, 19, sat on Jackson's lap as he caressed her legs. The two were sitting in a chair with an unmade bed seen in the background. Alabama turned the comments off on both of the videos, which have since gone viral.\nAlabama's decision to go public with her new boyfriend comes amid her ongoing feud with rapper Bhad Bhabie (real name: Danielle Bregoli). Things between the two really soured when Bhad Bhabie, 21, accused Alabama of trying to steal her boyfriend, Le Vaughn, 26, in late 2024.\n\"@alabamaluellabarker took my man,\" Bhad Bhabie wrote on her Instagram Stories in December. \"I told Lv next time I catch you. You gon b with them!\" she wrote in a follow-up post.\nAlabama released a statement of sorts, denying any involvement with Le Vaughn, whom she accused of being \"physically abusive towards women.\"\n\"I want to be clear: I have no interest in this man, nor would I ever lower myself to be with someone who has been physically abusive towards women,\" she wrote on her Instagram Stories, per the Daily Mail.\nBregoli claimed on another track that Alabama had hooked up with Tyga and Soulja Boy, and claimed that the \"Rack City\" rapper, 35, got her pregnant. Alabama vehemently denied all three claims.",
  "word_count": 369,
  "scraped_at": "2026-02-14T13:19:02.773882"
}