{
  "article_id": "ee60c231b21b",
  "url": "http://www.asiabulletin.com/news/278864148/india-drawn-with-japan-australia-and-lebanon-in-afc-u17-women-asian-cup-china-2026",
  "title": "India drawn with Japan , Australia and Lebanon in AFC U17 Women Asian Cup China 2026",
  "date": "20260212T150000Z",
  "domain": "asiabulletin.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "ANI\n12 Feb 2026, 18:34 GMT+10\nNew Delhi [India], February 12 (ANI): India were drawn alongside Japan, Australia, and Lebanon in Group B of the AFC U17 Women's Asian Cup China 2026 during the Final Draw held at the AFC House in Kuala Lumpur, Malaysia, on Thursday, according to the All India Football Federation (AIFF).\nHaving qualified for the AFC U17 Women's Asian Cup for the first time in 21 years after defeating Kyrgyz Republic and Uzbekistan, the Young Tigresses will open their campaign against Australia, followed by matches against Japan and Lebanon. The tournament will take place from May 1 to 17.\nJapan were runners-up in 2024 and thus qualified automatically for the tournament. They are four-time champions of the AFC U17 Women's Asian Cup and also FIFA U17 Women's World Cup champions in 2014 and runners-up in 2010 and 2016.\nAustralia were eliminated in the group stage of the 2024 edition and qualified for the 2026 tournament after victories over Singapore and the Northern Mariana Islands. On the other hand, Lebanon will make its debut, having qualified for its first tournament with wins over Kuwait and Iran.\nIn Group A, hosts China were drawn alongside Thailand, Vietnam and Myanmar. Group C contains DPR Korea, the Republic of Korea, the Philippines and Chinese Taipei.\nThe AFC U17 Women's Asian Cup China 2026 will be held in Suzhou, at the Suzhou Sports Centre Stadium and the Suzhou Taihu Football Sports Centre.\nThe top two sides from each group, along with the two best third-placed teams, will progress to the quarter-finals. The four semi-finalists will qualify for the FIFA U17 Women's World Cup Morocco 2026, where DPR Korea are the current holder.\nAFC U17 Women's Asian Cup China 2026 Draw Lists:\nGroup A: China, Thailand, Vietnam, and MyanmarGroup B: Japan, Australia, India, and LebanonGroup C: DPR Korea, the Republic of Korea, the Philippines, and Chinese Taipei. (ANI)\nShares\nShare\nTweet\nShare\nFlip\nEmail\nGet a daily dose of Asia Bulletin news through our daily email, its complimentary and keeps you fully up to date with world and business news as well.\nPublish news of your business, community or sports group, personnel appointments, major event and more by submitting a news release to Asia Bulletin.\nMore InformationVANCOUVER, British Columbia, Canada - The death toll in Tuesday afternoon's deadly high school shooting in Canada has been revised...\nLONDON, U.K.: People who turn to artificial intelligence for medical advice may not be making better health decisions than those who...\nLONDON/TORONTO/FRANKFURT: Jeffrey Epstein's partner Ghislaine Maxwell opened accounts with Swiss wealth giant UBS that helped her manage...\nHONG KONG: Jimmy Lai, the 78-year-old pro-democracy former Hong Kong media tycoon and a fierce critic of Beijing, received a 20-year...\nTOKYO, Japan: Japanese Prime Minister Sanae Takaichi's governing party won a landslide victory, surpassing the two-thirds supermajority...\nTRINITY, Florida: For Christie O'Sullivan of Trinity, Florida, Valentine's Day has mostly been a couples' affair. She has spent 21...\nMOSCOW, Russia: As Russia grapples with a deepening labour shortage worsened by its war in Ukraine, employers are increasingly recruiting...\nHAVANA, Cuba: Airlines flying into Cuba have been told they will no longer be able to refuel on the island, as tightening U.S. pressure...\nNEW YORK, New York - U.S. stocks closed marginally lower Wednesday, despite positive economic data which saw the U.S. economy add 130,000...\nSAN FRANCISCO, California: As competition intensifies around the infrastructure powering artificial intelligence, Cisco Systems has...\nTOKYO, Japan: Honda Motor Co. posted a sharp decline in profit for the nine months through December, underscoring the growing pressure...\nTOKYO, Japan: Rising wage bills are beginning to bite for Japan's smaller companies, with bankruptcy filings climbing in January as...",
  "word_count": 612,
  "scraped_at": "2026-02-14T12:37:56.431674"
}