{
  "article_id": "ee673edabb04",
  "url": "https://www.lhrtimes.com/2024/09/20/chelsea-legend-gianfranco-zola-to-visit-singapore-as-part-of-clubs-flagship-international-fan-engagement-programme-the-famous-cfc-presented-by-ascott/",
  "title": "Chelsea legend Gianfranco Zola to visit Singapore as part of club flagship international fan engagement programme The Famous CFC , presented by Ascott",
  "date": "20240921T044500Z",
  "domain": "lhrtimes.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "The upcoming Famous CFC in Singapore will feature Chelsea legend Gianfranco Zola, a fan favourite when he played for the Blues from 1996 to 2003. Throughout his career with the Blues, Zola was twice named Player of the Year and was voted by fans as the club’s greatest-ever player in 2003. During his time at Chelsea, he won the UEFA Cup Winners’ Cup, the UEFA Super Cup, two Football Association Challenge Cups, the League Cup and the Community Shield. This event will be Zola’s first visit to Singapore with the Blues.\nThe Famous CFC is a global fan experience created by Chelsea to strengthen connections with its fans around the world, and to help connect partners and brands within international markets. Introduced in 2023, the event has run two successful editions in Mumbai, India and Los Angeles, USA. The Singapore edition will mark Ascott’s first presentation of The Famous CFC, with plans to introduce it to additional markets in the future.\nThe Singapore edition of The Famous CFC will be headlined by a watch party at Funan as Chelsea play Aston Villa on 1 December, football coaching clinics delivered by the Chelsea Foundation as well as a meet-and-greet between Zola and local fans, alongside other fan engagement activities. Some of the experiences will be made available exclusively for members of Ascott Star Rewards (ASR).\nTan Bee Leng, Chief Commercial Officer, Ascott, said: “Since becoming Chelsea’s Official Global Hotels Partner in July, Ascott has been dedicated to bringing Chelsea fans closer to their beloved football heroes, such as through exclusive hospitality packages at the Ascott Privilege Signatures Stadium Lounge at Stamford Bridge and creative social media content. Recognising that many of Chelsea’s over 600 million fans are based in Southeast Asia, we are thrilled that The Famous CFC is visiting the region very soon. Southeast Asia is one of Ascott’s key markets where we are managing over 360 properties in nine countries. Starting with Singapore, specifically at lyf Funan Singapore as the main venue for The Famous CFC, we hope to build excitement among Chelsea fans ahead of the rebranding of the stadium hotels at Stamford Bridge to lyf by the second half of 2025.”\n“The Famous CFC programme seamlessly blends hospitality, entertainment and sports, aligning perfectly with Ascott’s commitment to meeting the growing demand for experiential travel. Through The Famous CFC, we are delighted to offer Chelsea fans unique opportunities to connect with their club and provide exclusive experiences to Ascott Star Rewards members that embody our brand promise of ‘Stay Rewarded’,” she added.\nCasper Stylsvig, Chelsea’s Chief Revenue Officer, said: “We are looking forward to bringing The Famous CFC to Singapore in November, and the chance to engage with our passionate fan base of over 60 million people in Southeast Asia.\n“It’s the first time we have visited the country since 2017, and we are grateful to Ascott – our presenting partner of this leg of the programme – in sharing our vision of connecting with our fans from across the globe in innovative and exciting ways. We look forward to delivering what will be an unforgettable weekend of activities, for both our supporters and ASR members alike.”\nGianfranco Zola said: “I’m so excited to be involved in The Famous CFC this year, and to take part in the event for the first time. I know we have a huge fan base in Southeast Asia so it will be really special to spend some time together while exploring a beautiful country.”\nLive the Ultimate Chelsea Fan Dream with Ascott Star Rewards\nIn anticipation of The Famous CFC in Singapore, Ascott is pleased to launch an exciting campaign for ASR members. Participants stand to win fantastic prizes including passes to Zola’s meet-and-greet event, signed Chelsea merchandise, tickets to watch Chelsea take on Manchester United live at Stamford Bridge in May 2025 and a stay at an Ascott property using ASR points. For more details on the campaign and prizes, please refer to the Annex and visit https://www.discoverasr.com/en/ascott-chelseafc for updates.\nThe Famous CFC Experience Packages\nAscott has also launched two exclusive experience packages for The Famous CFC in Singapore, available only to ASR members. The ‘Football Fan Experience Package’ for two includes access to a football coaching clinic by the Chelsea Foundation, tickets to the watch party as Chelsea play Aston Villa and a chance to win a Chelsea shirt or football signed by the first team. The higher-tier ‘Ultimate Weekend with Zola Experience Package’ for two includes all the same features, plus an exclusive perk – a VIP meet-and-greet and photo opportunity with Zola. Both packages include ASR points that can used for stays at lyf Funan Singapore or any other participating Ascott property.\nMore experience packages are in the pipeline. For ticketing details and the latest updates on The Famous CFC in Singapore, please visit https://www.discoverasr.com/en/ascott-chelseafc.\nAbout lyf Funan Singapore\nlyf Funan Singapore is a vibrant hub designed for experience-led social living. With 329 rooms, it is a hotspot for forging connections, featuring trendy shared spaces like open work areas and a modern communal kitchen. It is seamlessly connected to the City Hall MRT interchange via a sheltered underground walkway, providing easy access to all parts of Singapore. As part of the innovative Funan integrated development that also comprises a mall and two office blocks, lyf Funan Singapore is surrounded by modern amenities including trendy dining options, an urban farm, a theatre, a cinema, a gym with a swimming pool, rock climbing walls and a futsal court.\nAnnex – Book Your Stay with Ascott Star Rewards and Win Exclusive Chelsea Experiences\nReady to live the dream of a Chelsea fan? Book your stay with Ascott Star Rewards for a chance to win an exclusive meet-and-greet with Chelsea legend Gianfranco Zola during Famous CFC in Singapore or two tickets to the thrilling Chelsea vs Manchester United match at Stamford Bridge. Every dollar you spend brings you closer to winning!\nFrom London to around the globe, create unforgettable memories that money can’t buy. Enter the draw when you book and stay between 20 September and 13 December 2024.\nBook now and let the excitement begin!\nFirst Draw: Score exclusive meet-and-greet with Chelsea legend Gianfranco Zola in Singapore\n- Prize: A pair of passes to meet the legend in Singapore and signed Chelsea merchandise\n- Valid book and stay period: 20 September to 10 November 2024\n- Winner announcement: Week of 11 November 2024\nFinal Draw: Win a pair of tickets to Chelsea versus Manchester United with a hotel stay in London\n- Prize: A pair of general admission tickets to watch Chelsea take on Manchester United live at Stamford Bridge in May 2025 (exact match date to be confirmed) and ASR points for a 2D1N stay at one of the ASR participating properties\n- Valid book and stay period: 20 September to 13 December 2024\n- Winner announcement: Week of 16 December 2024\nVisit https://www.discoverasr.com/en/ascott-chelseafc for campaign updates.\nHashtag: #Hospitality #Chelsea #FamousCFC #Football #Partnership #Loyalty\nhttps://www.discoverasr.com/en\nhttps://www.linkedin.com/company/the-ascott-limited/\nhttps://www.facebook.com/discoverasr/\nhttps://instagram.com/DiscoverASR\nThe issuer is solely responsible for the content of this announcement.\nAbout Chelsea Football Club\nChelsea Football Club is one of the top football clubs globally and its men’s team were the FIFA Club World Cup winners for 2021, with the final when the side beat Brazilian side Palmeiras in Abu Dhabi held in 2022 due to the pandemic. That success followed winning the UEFA Champions League for a second time in 2021 with victory over Manchester City in Porto.\nFounded in 1905, Chelsea is London’s most central football club, based at the iconic 40,000-capacity Stamford Bridge stadium. Nicknamed ‘The Blues’, the club lifted the Champions League for the first time in 2012 and has also won the Premier League five times, the FA Cup eight times, the Football League Cup five times, the UEFA Europa League twice, the UEFA Cup Winners’ Cup twice, the UEFA Super Cup twice and the Football League Championship once, in 1955.\nThe 2021 Champions League and Super Cup triumphs ensured Chelsea became the first club to win four major UEFA club competitions twice, following its earlier successes in those two competitions as well as the Europa League and Cup Winners’ Cup.\nThe Chelsea Women’s team have enjoyed a huge amount of success and in 2024 won the FA Women’s Super League for a fifth consecutive year and the seventh time overall. The Women’s FA Cup has been won on five occasions. The side has also captured the FA Women’s League Cup twice as well as reaching the UEFA Women’s Champions League final in 2021.\nIn addition to possessing some of the world’s most recognisable players, Chelsea has also invested in its future with a state-of-the-art Academy and training centre in Cobham, Surrey. Since the Academy building’s opening in 2008, the club has won seven FA Youth Cups, back-to-back UEFA Youth League titles in 2015 and 2016, and the U23 and U18 Premier League national championships most recently in 2019/20 and 2017/18 respectively.\nThe Chelsea Foundation boasts one of the most extensive community initiatives in sport, helping to improve the lives of children and young people all over the world.\nAbout The Ascott Limited\nSince pioneering Asia Pacific’s first international-class serviced residence with the opening of The Ascott Singapore in 1984, Ascott has grown to be a trusted hospitality company with over 950 properties globally. Headquartered in Singapore, Ascott’s presence extends across more than 230 cities in over 40 countries in Asia Pacific, Central Asia, Europe, the Middle East, Africa, and the USA.\nAscott’s diversified accommodation offerings span serviced residences, coliving properties, hotels and independent senior living apartments, as well as student accommodation and rental housing. Its award-winning hospitality brands include Ascott, Citadines, lyf, Oakwood, Somerset, The Crest Collection, The Unlimited Collection, Fox, Harris, POP!, Preference, Quest, Vertu and Yello. Through Ascott Star Rewards (ASR), Ascott’s loyalty programme, members enjoy exclusive privileges and offers at participating properties.\nA wholly owned business unit of CapitaLand Investment Limited, Ascott is a leading vertically-integrated lodging operator. Harnessing its extensive network of third-party owners and in-market expertise, Ascott grows fee-related earnings through its hospitality management and investment management capabilities. Ascott also expands its funds under management by growing its sponsored CapitaLand Ascott Trust and private funds.\nThis year, Ascott marks 40 years in hospitality service with the launch of Ascott Unlimited, a full year campaign that will offer Unlimited Opportunities, Unlimited Choices, Unlimited Freedom, and Unlimited Good. Navigating a future of unlimited possibilities against a backdrop of global change and evolving perspectives of travel, Ascott Unlimited marks Ascott’s ambitions to break new ground, and springboard to its next chapter of growth as a global hospitality company. Find out more about Ascott Unlimited at www.discoverasr.com/ascottunlimited.\nFor more information on Ascott and its sustainability programme, please visit www.discoverasr.com/the-ascott-limited. Alternatively, connect with us on Facebook, Instagram, TikTok and LinkedIn.\nAbout CapitaLand Investment Limited\nHeadquartered and listed in Singapore, CapitaLand Investment Limited (CLI) is a leading global real asset manager with a strong Asia foothold. As at 30 June 2024, CLI had S$134 billion of assets under management, as well as S$100 billion of funds under management held via six listed real estate investment trusts and business trusts and a suite of private real asset vehicles that invest in thematic and tactical strategies. Its diversified real estate asset classes include retail, office, lodging, industrial, logistics, business parks, wellness, self-storage and data centres.\nCLI aims to scale its fund management, lodging management and commercial management businesses globally and maintain effective capital management. As the investment management arm of CapitaLand Group, CLI has access to the development capabilities of and pipeline investment opportunities from CapitaLand’s development arm.\nAs a responsible company, CLI places sustainability at the core of what it does and has committed to achieve Net Zero carbon emissions for Scope 1 and 2 by 2050. CLI contributes to the environmental and social well-being of the communities where it operates, as it delivers long-term economic value to its stakeholders.",
  "word_count": 1993,
  "scraped_at": "2026-02-14T12:33:13.450040"
}