{
  "article_id": "ee80103dd8d8",
  "url": "https://www.empireofthekop.com/2025/07/11/kaylee-hunter-diogo-jota/",
  "title": "Canadian player pays tribute to Diogo Jota after emotional goal celebration",
  "date": "20250711T181500Z",
  "domain": "empireofthekop.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "A moving tribute to Diogo Jota has emerged from the other side of the Atlantic a week after the Liverpool forward’s tragic passing.\nKaylee Hunter, who plays for AFC Toronto in the Northern Super League, marked her recent goal with a familiar celebration — one that Liverpool fans will instantly recognise.\nAfter finding the back of the net, the Canadian forward sat cross-legged and mimicked the PlayStation controller gesture, a celebration that became iconic during the Portuguese international’s time at Anfield.\nThe tribute, shared by the Northern Super League on Instagram, has drawn heartfelt reactions from Liverpool supporters online, many of whom spotted the subtle nod to the much-loved No.20.\nJota’s legacy continues to inspire tributes across the football world\nThe Canadian Women’s league may seem a world away from the Premier League, but Jota’s impact was truly global.\nFrom fans at Anfield to players overseas, the outpouring of emotion since the Portugal international’s passing has only highlighted how respected he was — not only for his goals, but his personality, passion and celebration style.\nWe’ve seen Porto also honour this iconic celebration and Jota’s legacy is certainly going to live on in both football and eSports.\nTributes continue to pour in for Diogo Jota\nArne Slot and his squad are preparing for pre-season without one of our most beloved players, with Liverpool confirming they will honour the late forward during the 2025/26 campaign.\nThis moment comes whilst supporters lay flowers outside Anfield and Jota’s teammates visit or post personal tributes on social media, showing just how deeply his presence is missed.\nAs the Reds look ahead to a new era under our Dutch head coach, reminders of what Jota brought to the club — on and off the pitch — will continue to resonate.\nThis Canadian tribute, quiet but powerful, is another reminder that Jota’s memory will live far beyond Merseyside.\nYou can view the Jota-inspired celebration via @northersuperleague on Instagram:\nView this post on Instagram\nView this post on Instagram",
  "word_count": 332,
  "scraped_at": "2026-02-14T12:44:03.143564"
}