{
  "article_id": "ee82e8e06d5f",
  "url": "https://thenationonlineng.net/edo-queens-bayelsa-queens-complete-list-for-nwfl-super-six/",
  "title": "Edo Queens , Bayelsa Queens complete list for  NWFL  Super Six",
  "date": "20240426T011500Z",
  "domain": "thenationonlineng.net",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Sports\nApril 26, 2024 by Our Reporter\nEdo Queens, Bayelsa Queens complete list for NWFL Super Six\nThe Nigeria Women’s Football League Premiership regular season ended on a high note as Benin Ladies and Prosperity Girls nicked the final two Super Six tickets while Royal Queens and Sunshine Queens suffered demotion to the lower league.\nBy Tunde Liadi\nAll is now set for the Nigeria Women’s Football League Premiership Super Six following the conclusion of the regular season and the determination of the six teams that will vie for the season ending competition from where the 2023-24 League champions would be known.\nThough no host has been secured for the competition and the organisers of the league are yet to fix a date for the event, it has been a fascinating season filled with thrills and frills as well as shocks before the six teams for the Super Six got their berths.\nBefore the conclusion of the season on Thursday, four teams: Nasarawa Amazons, Confluence Queens, Heartland Queens (Group A) and Rivers Angels (Group B) had already secured their places before the final game. It was left for Group B to produce the remaining two teams for the Super Six slots to be sorted.\nIt went typically according to script despite a late dogged fight by FC Robo Queens to crash the Super Six party with a surprise victory in Yenagoa against Bayelsa Queens. The Emmanuel Osahon’s girls had mathematically ruled themselves out of the race for the Super Six ticket following their goalless home draw against Delta Queens in Lagos.\nBut FC Robo Queens went down with a fight ensuring that they ended the season with a win. Folashade Ijamilusi bagged a double in the 38th and 65th minutes to put the Lagos darling team in driver’s seat before Bayelsa Queens reduced the tally in the 90th minute through Blessing Abiola.\nFC Robo finished fourth but were only out of the Super Six because of inferior goals difference to beaten Bayelsa Queens who got the third ticket in Group B by the virtue of superior goals scored. Both teams ended the season with 22 points. It was a poor end to the regular season for the Prosperity Girls who were beaten in their final two games of the season. Pressure will be on head coach, Domo Okara to arrest the sudden slump if Bayelsa Queens are to be among the favourites for the league title.\nRead Also: Heartland Queens, Bayelsa Queens dominate pace in NWFL\nThe South South derby in Asaba between Delta Queens and Edo Queens produced the remaining Super Six ticket. Edo Queens had beaten Remo Stars Ladies 1-0 in the penultimate game of the season to ensure they go into the final game requiring just a draw to qualify for the Super Six even in the worse scenario.\nThe Moses Adukwu’s girls came out gun blazing right from the kick off and they thought they had bagged the maximum points when Amarachi Odoma shot them ahead in the 87th minute but the reigning league champions conjured their way to get the equaliser on the stroke of full time through Arit Itu. Edo Queens finished the regular season campaign in the second spot with 23 points while Delta Queens ended it in sixth spot with 17 points.\nIn other Group B game, Remo Stars Ladies pipped Sunshine Queens 2-1 to cement their fifth spot with 18 points ahead of Delta Queens in only their debut season in the topflight. Adaobi Okoh got a brace for the Ikenne girls while Taiwo Ajibade bagged Sunshine Queens’ consolation goal. But Sunshine Queens ended their solitary season in the topflight with demotion back to the lower league because of the defeat. A win in Ikenne would have been sufficient for another stint in the topflight next season.\nIt was Sunshine Queens’ neighbouring State, Ekiti Queens that got the last topflight ticket secured following their 2-0 home win over highly rated Rivers Angels in Ekiti’s Kayode Oluyemi Stadium. Odunayo Adeleye and Rashidat Salau with the two goals that downed the Jewels of Rivers.\nIn Group A, the battle for the sole team that would be relegated to the lower league went down to the wires at the conclusion of both games on Thursday morning in Gombe and Abuja respectively.\nNaija Ratels thrashed Abia Angels 3-0 in Abuja through Agama Ziperekefeghe, Augustina Unamba and Grace Saliu first half goals. They came fifth with 17 points while Abia Angels finished seventh with 14 points. The Benjamin Nwoke led side lost their final three league games of the season but still managed to survive by the skin of their teeth.\nIt was Royal Queens that were relegated even though they finished the season with the same number of points (14) and the same number of goals difference (-9) with Abia Angels that got the last topflight slot. The tie breaker was the number of goals both scored. Abia Angels got 11 goals during the regular season and conceded 20 goals while Royal Queens scored seven goals and conceded 16 goals. It was a sad end to Royal Queens’ season despite battling to a goalless draw against Adamawa Queens in Gombe’s Pantami Stadium.\nIn the other Group A game, Confluence Queens were held to a goalless draw at the Edo State University Pitch, Iyarmho by Nasarawa Amazons who topped the group with 27 points. Confluence Queens came second with 25 points.\nHeartland finished third with 24 points despite suffering a 2-0 defeat to Dannaz Ladies in Lagos. Delight Isaac’s double fetched her team’s huge win. Dannaz thus finished the season in fourth spot with 18 points.",
  "word_count": 940,
  "scraped_at": "2026-02-14T12:41:56.148349"
}