{
  "article_id": "ee8255b58178",
  "url": "https://www.burntorangenation.com/2025/2/24/24371797/longhorns-daily-news-texas-wbb-ap-poll-vic-schaefer-cfp-steve-sarkisian-sec",
  "title": "Longhorns Daily News : Texas WBB is No . 1 in the latest AP Poll for first time in two decades",
  "date": "20250224T221500Z",
  "domain": "burntorangenation.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "The Texas Longhorns women’s basketball team pulled into the latest AP Poll’s No. 1 overall spot this week. It’s the first time in 21 years that Texas women’s basketball has pulled off a top overall AP Poll ranking.\nLonghorns Daily News: Texas WBB is No. 1 in the latest AP Poll for first time in two decades\nPlus: In fact, it’s been 21 years since Texas WBB’s last No. 1 AP Poll ranking\nAs ESPN noted, it’s been a minute since the Texas women’s squad has pulled off this exact feat.\nWHAT THEY’RE SAYING ABOUT THE LONGHORNS\nAustin American-Statesman: 3 things to know about Steve Sarkisian’s new contract with Texas football\n247Sports: Horns247 Staff Roundtable: Which Texas player will boost stock most at NFL Combine?\nInside Texas: ITYT: Texas records a sweep in Jim Schlossnagle’s first home series at the Disch\nInside Texas: Elite programs must replace programs and coaches\nInside Texas: Replacing Terry Joseph will be Steve Sarkisian’s most important offseason move\nInside Texas: Texas, Learfield add several NIL leadership positions in effort to maximize student-athlete opportunities\nInside Texas: Four things to track at Chris Del Conte’s annual athletics town hall\nICYMI IN BURNT ORANGE NATION\nRECRUITING ROUNDUP\n247Sports: The Stampede: Classifying Crystal Ball predictions as like it, love it, leave it\n247Sports: Longhorns QB commit Dia Bell sets Texas official visit\n247Sports: Football recruiting scoop from The Sevens: Intel on top 2026, 2027 prospects after loaded Atlanta tournament\n247Sports: Texas standing out early for Arlington Lamar 2027 LB Braylon Williams\nInside Texas: On3’s No. 2 RB Ezavier Crowell sets Texas official, connecting with new RB coach\nSEC SHOWDOWN\nAustin American-Statesman: Bryanna Preston making a difference as No. 2 Texas heads to Georgia\nAustin American-Statesman: Does Texas basketball still have NCAA hopes after loss at South Carolina?\n247Sports: Everything Texas basketball head coach Rodney Terry said following the team’s loss at South Carolina\nGood Bull Hunting: Cal Poly Preview: Aggie Baseball welcomes Mustangs to College Station\nRock M Nation: Mizzou baseball wins two of three at the Andre Dawson Classic\nAnd The Valley Shook: Tigers take series against Omaha\nRed Cup Rebellion: Ole Miss blasts through Eastern Kentucky in three game series\nRocky Top Talk: Tennessee Vols move back into top five in latest college basketball polls\nAnchor Of Gold: The Statistical: Ole Miss\nRoll ‘Bama Roll: Alabama baseball wins Jacksonville Classic in dramatic fashion\nA Sea Of Blue: Andrew Carr is returning to form, and that’s crucial for Kentucky\nWHAT WE’RE READING\nSB Nation: The most-likely and least-likely teams to try and ban the Tush Push\nSB Nation: How Nosferatu explains the NFL Scouting Combine\nNEWS ACROSS LONGHORN NATION AND BEYOND\n- Texas softball bounced back for four consecutive wins in the Hillenbrand Invitational against Colorado State, UC Davis, Arizona, and Colorado State, again, after the Longhorns dropped their tournament-opening face-off against Stanford.",
  "word_count": 475,
  "scraped_at": "2026-02-14T13:41:04.316804"
}