{
  "article_id": "ee980a7c52cf",
  "url": "https://www.yahoo.com/news/two-city-owned-sites-baltimore-213800686.html",
  "title": "Two city - owned sites in Baltimore to be considered for potential pro soccer stadium operated by D . C . United",
  "date": "20240305T221500Z",
  "domain": "yahoo.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Two city-owned sites in Baltimore to be considered for potential pro soccer stadium operated by D.C. United\nIf Baltimore ever does add an outdoor pro soccer team, the club might make their home a couple of miles south of downtown.\nThe state’s Department of Commerce recently requested the Maryland Stadium Authority study two city-owned sites — Carroll Park and Swann Park — for a potential stadium that would hold between 7,500 and 10,000 spectators and host an MLS Next Pro team, a men’s minor league club that would feed to MLS side D.C. United.\nThere is no guarantee that this study will result in a soccer stadium or a pro team but it demonstrates interest, in the form of dollars, from relevant parties. The study, which will take about a year, costs $450,000, with D.C. United paying half, the Department of Commerce paying $100,000, the City of Baltimore paying $100,000 and the stadium authority chipping in $25,000. The result will be a report that stakeholders, such as the soccer club and government authorities, can use to decide if they’ll invest in a stadium.\nThe venue might also host a top-flight women’s pro club.\nFlorida-based Crossroads Consulting filed a December report to the stadium authority analyzing potential stadium sites, stating that a “women’s professional soccer league represents another potential tenant for the proposed multi-use soccer stadium.” D.C. United, who the stadium authority has said would be the “primary operator” of the proposed venue, recently partnered with the USL Super League, a new women’s soccer league set to launch later this year.\nA news release last month from the Super League noted that a Washington club is among the eight teams set to begin play in August and that it will “add another exciting chapter to the region.” The league has not yet said where that team will play.\nThe Super League, whose season spans from fall to summer, recently received Division One sanctioning from the U.S. Soccer Federation, meaning it will join the decade-old National Women’s Soccer League atop the country’s pro soccer ladder.\nDanita Johnson, D.C. United’s President of Business Operations, said in a statement to The Baltimore Sun that the club wants to be a part of “Baltimore’s renaissance” and that D.C. United is “confident that professional soccer will flourish in Baltimore and positively impact the community.”\n“Baltimore has established a nationally recognized tradition and passion for soccer,” she stated. “We believe that we can enhance Baltimore’s soccer reputation and expose the world’s sport to more Baltimore youth by providing them with new opportunities. We want to be a part of Baltimore’s renaissance, and our goal is to build a product that is authentic to the city and create something that Baltimore residents will be proud of.”\nMuch remains unknown: when a potential stadium would be built, who would pay for it and how many millions of dollars it would cost. But the new report would identify a cost estimate for each site and follow up on the December report with a more comprehensive survey of the two sites identified. The earlier report cost $50,000 and was split between D.C. United and the stadium authority.\nRelated Articles\nThe scope of the study will include site analysis, due diligence, conceptual design and budget, according to a letter the Department of Commerce sent to the stadium authority on Monday. It will specifically analyze “what’s below your feet,” said Gary McGuigan, Maryland Stadium Authority’s Executive Vice President for Capital Projects, and look into potential environmental, historic or archaeological challenges with the sites. This report would likely be the last before stakeholders either move forward with building a stadium — or don’t.\nMore in Sports\nBarcelona fans tear into several players amid Atlético disaster\nCarroll Park, located near Pigtown, is currently a golf course and was found to be the most viable of the four sites reviewed by Crossroads. Evaluated with various criteria such as size and access to transportation, it totaled 156 points, more than second-place Reedbird Park (149), which the Department of Commerce did not ask the authority to study.\nWith 67 acres, the Carroll Park site is large enough and has several strengths, the report found, despite the potential for it to “feel secluded.” Swann Park, 11 acres of athletic fields located near Baltimore Peninsula, totaled 124 points, ranking as the third most viable site, ahead of Retriever Park, UMBC’s soccer stadium.\nCarroll Park was selected to be studied because it was the top-ranked option. Second-place Reedbird Park had “quite similar ratings across most metrics” as compared with Carroll Park, while Swann Park “presented a contrast,” which is why it was also selected, a spokesperson for the Department of Commerce said.\nThe study was unanimously approved by the stadium authority board Tuesday, with one member, William Cole, abstaining because he’d previously worked on similar efforts.\nThe Baltimore area has long had an indoor soccer team — the Baltimore Blast, who play at Towson University’s TU Arena — but is one of the largest American cities without a pro outdoor soccer team.\nThis is not the first time local authorities have studied the feasibility of a soccer stadium, though. In 2010, the stadium authority analyzed two distinct possibilities: a 25,000-seat stadium (for a hypothetically relocated D.C. United team) in Westport, as well as a 7,000- to 10,000-seat venue south of M&T Bank Stadium for minor league play, but neither venue was built.\nBaltimore Mayor Brandon Scott, a Democrat, told The Sun in December that Baltimore has proved it is a “sports and entertainment destination.”\n“And we’re always looking for ways to expand that,” he said. “So we’re not surprised that our neighbors in D.C. United are looking at Baltimore as part of the expansion of their footprint. We’re very excited about that possibility.”",
  "word_count": 962,
  "scraped_at": "2026-02-14T12:17:17.923931"
}