{
  "article_id": "eec0237ecd3e",
  "url": "https://www.espn.com/espn/story/_/id/47185953/nigeria-super-falcons-lament-lack-games-banyana-win-final-fifa-window-wafcon",
  "title": "Nigeria Super Falcons lament lack of games while Banyana win in final FIFA window before WAFCON",
  "date": "20251203T091500Z",
  "domain": "espn.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Nigeria's Super Falcons players, led by captain Rasheedat Ajibade, have expressed their unhappiness over the team's lack of fixtures during the final window of FIFA's Women's International Match Calendar.\nThe 10-time African champions were the only top team who did not play a single friendly match of the last window of 2025, which held between November 24 and December 2, as teams used the final window of the year to ramp up preparations for next year's Women's Africa Cup of Nations in March.\nAjibade, along with defenders Ashleigh Plumptre, Rinsola Babajide, Christy Ucheibe and Michelle Alozie, expressed their displeasure by sharing a meme on their social media questioning the lack of confirmed friendly matches for the Super Falcons.\nThe flyer, originally produced and shared by a content creator, called out the NFF, stating \"WAFCON loading. . . Zero friendlies confirmed\".\nNigeria, the defending WAFCON champions, last played in October when they despatched Benin Republic over two legs to qualify for next year's tournament. But with no further windows for friendly games until the tournament kicks off, the Super Falcons will have no further opportunities to get together except perhaps for pre-tournament scrimmages.\nA team official, who did not wish to be named for fear of repercussions, told ESPN that the situation was not ideal: \"Just like the players, I think we are all disappointed that we did not get to play any friendlies this FIFA window, but we will still try to do our best when the time comes.\"\nNFF officials did not respond to ESPN questions on why the team did not have friendly games scheduled this window.\nWhile the Super Falcons were inactive, the rest of Africa's top women's teams were making hay.\nSouth Africa, who were dethroned as champions after winning their first title in 2024, played and beat two-time finalists Morocco 2-0 on Tuesday night in Agadir. The game marked the return of coach Desire Ellis, who had been away from the team while negotiating a new contract with SAFA. It is unclear as yet if Ellis has been given a signed extension.\nBefore that game against South Africa, Morocco had earlier played Burkina Faso on November 29, ending with a 1-1 draw against the West Africans.\nGhana, who are making their second consecutive appearance after missing out in 2022, tested their strength against European champions England, going down 0-2 at St Mary's.\nZambia, who were eliminated by the Super Falcons at the last tournament, took part in a three-nation tournament that included fellow southern African teams Malawi and Zimbabwe.\nThe Copper Queens overcame a training boycott where they pressed for payment of outstanding allowances, to underline their credentials as regional powerhouses by tournament.\nThe Zambians overcame Zimbabwe 3-1 victory at Bingu National Stadium in Lilongwe on Tuesday to emerge winners with four points from two matches having drawn with hosts Malawi 1-1 on Sunday.\nHosts Malawi, who will make their WAFCON debut next year, finished bottom, with just one point after a 2-1 loss to Zimbabwe, who finished second.\nAlgeria and Kenya also tested their chops against each other, with Algeria winning 2-1 in the first game and tying 1-1 in the second.\nThe 2026 WAFCON also serves as Africa's qualifiers for the FIFA Women's World Cup, with the top four teams qualifying to represent Africa.",
  "word_count": 551,
  "scraped_at": "2026-02-14T12:50:48.110607"
}