{
  "article_id": "eec1724b8194",
  "url": "https://theconversation.com/new-study-highlights-the-brain-trauma-risks-for-young-athletes-212369",
  "title": "New study highlights the brain trauma risks for young athletes",
  "date": "20230829T020000Z",
  "domain": "theconversation.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "The Boston University CTE Center today reported the results of the largest-ever study of chronic traumatic encephalopathy (CTE) in young athletes.\nThe study, examining autopsied tissue, found signs of CTE in 63 out of 152 young athlete brains. The subjects of the study competed in youth, high school and college competitions, and all died before the age of 30.\nThis case series includes the first American woman athlete diagnosed with the disease, just months after the Australian Sports Brain Bank reported the world’s first case of CTE in a female athlete.\nThe results of this study have major implications for sporting leagues around the globe. Like other dementias, CTE is often assumed to be a disease that develops later in life, but as neuropathologist and Boston University CTE Centre Professor Ann McKee says, “this study clearly shows that the pathology of CTE starts early”.\nThese latest findings come as Australia’s Senate is due to report the findings of its inquiry into concussions and repeated head trauma in contact sport.\nThis should push sporting organisations to do more to protect the brains of all athletes, especially in junior and recreational competitions.\nCTE and young athletes\nCTE is a devastating and currently incurable form of dementia which causes neurodegeneration of the brain. The disease has long been associated with contact sport participation.\nDementias like CTE are often thought of as diseases of the elderly. However, some high-profile cases of CTE have been identified among younger athletes.\nIn Australia, much-loved NRL player and coach Paul Green was 49 when he died and was later found to have CTE. Former AFL star Shane Tuck was 38 when he died with the disease. Former AFLW player Heather Anderson was only 28. A recent study in the United States also found CTE in the brain of an 18-year-old athlete.\nThe disease is known to cause mood disorders and behaviour changes. People with CTE may be at higher risk of suicide.\nThese cases and the latest Boston University study indicate the risk of developing CTE is not restricted to those in their middle or older years. Although there is some evidence developing brains are more vulnerable to trauma – it creates a chronic inflammatory response affecting brain development – the pathology of CTE is still being studied.\nThe risk factors for young athletes are complex and multifaceted but it is likely that playing junior contact sport heightens an athlete’s risk of developing neurodegenerative diseases as an adult.\nThe strongest predictor for developing CTE is cumulative exposure to repeated brain trauma, rather than the number of diagnosable concussions. Prolonged exposure to repeated low-level impacts appears to produce a greater lifetime volume of brain trauma when compared with athletes who sustain a small number of more forceful injuries.\nAgain, the reasons for this dynamic require further study. One potential explanation is that low-level impacts, which often do not reach the clinical threshold for a concussion diagnosis, are easier to ignore and play through.\nFor the athletes in the Boston University study to develop CTE before the age of 30, it is likely they were exposed to repeated brain trauma from an early age through youth sport.\nAre contact sports safe for kids?\nPublic health advocates in North America, Australia, New Zealand Aotearoa and the United Kingdom have long expressed concerns about the risks of contact sport for children.\nImproved oversight would go some way toward reducing the serious health risks of mild traumatic brain injury (concussion). These include post-concussion syndrome (where symptoms do not resolve within the expected time period of about one month) and second impact syndrome (where a young athlete who has previously been concussed receives a second impact either on the same day or up to a week later, resulting in catastrophic outcomes).\nAlthough professional athletes are increasingly subject to monitoring for brain injuries, these practices are not consistently in place for participants in semi-professional, club or junior competitions. It is essential that sports bodies implement the same reporting, monitoring and exclusion protocols all the way through their competitions, especially in junior sport.\nFirst steps\nExisting concussion guidelines are not designed to account for the types of sub-concussive injuries (where an impact does not result in observable symptoms) most strongly associated with CTE. To protect them from the disease, contact sporting bodies must reduce young athletes’ lifetime exposure to brain trauma. One way to do this would be to restrict contact in training and games for juniors.\nSome sporting bodies have already taken the initial steps. Australian Rules football players are restricted to modified tackling until the age of 12. The National Rugby League will soon implement a ban on tackling until midway through under-7s competitions.\nThe US Soccer Federation prohibits children under 11 from heading the ball. The UK Football Association will trial a ban on deliberate heading before age 12 – a clear acknowledgement of the dangers of repetitive low-grade brain trauma.\nThe prevalence of CTE in this study from the US, where athletes routinely wear helmets to play football and ice hockey, is further evidence helmets do not protect young players from concussions or the risk of CTE.\nChanges to tackling rules were met with resistance by those who fear they would “soften” the games. Further measures to protect athletes will require courage from contact sports administrators.\nThis new study shows CTE can develop in young brains and builds off previous research suggesting the origins of this pathology may lie in junior contact sport. To protect players from neurodegenerative diseases like CTE, sports must reduce cumulative exposure to brain trauma for all athletes, beginning with the junior leagues. In Australia, where children have at least four football codes to choose from, this message must be received with particular urgency.\nIf this article has raised issues for you, or if you’re concerned about someone you know, call Lifeline on 13 11 14. The National Dementia Helpline number is 1800 100 500.",
  "word_count": 987,
  "scraped_at": "2026-02-14T12:15:40.257926"
}