{
  "article_id": "eec1cd39222d",
  "url": "https://www.thenationalnews.com/opinion/comment/2025/07/10/at-100-mahathir-mohamad-is-still-a-factor-in-malaysian-politics/",
  "title": "At 100 , Mahathir Mohamad is still a factor in Malaysian politics",
  "date": "20250710T043000Z",
  "domain": "thenationalnews.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Malaysia’s Dr Mahathir Mohamad turns 100 today. Even before this milestone birthday, social media was abuzz with jokes about the longevity and seeming indestructability of a man who spent a record 22 years in office as prime minister from 1981-2003, only to return to lead his country in 2018 at the age of 92.\n“Guys, Dr Mahathir is literally older than sliced bread,” read one post on X. “Mahathir was alive when the Big Bang happened,” was another. “The year is 2321. Emperor Mahathir is currently on the throne, since 200 years ago,” was a third.\nThere will be plenty of congratulatory wishes, including, I suspect, from some of his opponents who were jailed under his rule or at his behest. The veteran opposition leader Lim Kit Siang was locked up for 17 months under the Internal Security Act in 1987 during the notorious Operation Lalang period, but said Dr Mahathir had changed in the run-up to the 2018 general election, in which the latter led the opposition to victory over the Barisan Nasional coalition he had once headed.\nPrime Minister Anwar Ibrahim may feel duty-bound to say a few warm words about the man who dismissed him as deputy prime minister in 1998, with Mr Anwar going to jail the following year (his conviction was later overturned, but not until 2004). Could it be that even former prime minister Najib Razak, whose criminal charges began not long after Dr Mahathir returned to office in 2018 and is currently incarcerated, will wish him happy returns?\nGiven the hold that the centenarian has had on the country for nearly 50 years, and the culture of respect for elders and former statesmen, it couldn’t be ruled out. Today will be a day when his fellow citizens will want to celebrate all the positive aspects of the man “who put Malaysia on the map”, as his biographer Barry Wain wrote in Malaysian Maverick, published in 2009.\nIron-willed as prime minister, Dr Mahathir never truly retired, and definitely not from Malaysian politics. A few years after both his handpicked successors, Abdullah Ahmad Badawi (2003-2009) and Mr Najib (2009-2018), took office, he became irked that they wouldn’t take his “advice” and sought to force them from office. In both cases, he was ultimately successful. As a Najib aide told me ruefully after the 2018 election: “We always knew that the most powerful man in the country was not the boss. That was Mahathir.”\nStill at his office desk by 8.45 in the morning, Dr Mahathir remains busy with all manner of matters, but with two chief aims: trying “to save” the Malays, who despite making up 58 per cent of the multiethnic population still apparently need “fighters to champion their cause”, as he put it last month; and doing whatever he can to undercut Mr Anwar, the former protege he made up with (or pretended to) before that crucial 2018 election – only subsequently to work to deny Mr Anwar the premiership to which he finally did ascend in 2022.\nDr Mahathir was up to his old ways once again just a few days ago. After Mr Anwar finished a triumphant visit to strengthen bilateral ties with Italy, Dr Mahathir put up a post on X. “Hooray,” it began. “Now Italy ‘is set to invest RM8.13 billion in Malaysia’. Great!”\n“Bapa FDI” – the father of foreign direct investment – “is at it again,” he wrote. “Already RM680 billion has come. You cannot see it because the factories are invisible. We want more visit to foreign countries so that more invisible FDI will come.”\nScathing sarcasm is not a normal feature of Malay “adat” – or custom – which prizes politeness and saving face. But Dr Mahathir has always stood apart. “When he came to power, he and his family were very different from us,” the scion of a Malay political family told me recently.\nDr Mahathir’s predecessors as prime minister had been a prince – Tunku Abdul Rahman; a hereditary nobleman – Tun Razak; and the grandson of a high-ranking courtier – Tun Hussein Onn. Dr Mahathir, by contrast, came from a relatively humble background and qualified as a medical doctor in Singapore; unlike the previous premiers, there had been no expensive education in the UK for him.\nHis singlemindedness led to great achievements, including putting in train grand projects whose vast expense others may have balked at, such as the Penang Bridge (one of the longest in South-East Asia) and the Petronas Twin Towers. But his self-belief left little room for contrary views. The common view is that the independence of Parliament, the judiciary and other state institutions were all hollowed out, while corruption rose to alarming levels, during his first 22 years in office.\nWhen I interviewed him after Malaysian Maverick came out, he batted away all accusations and criticisms, so I asked him if he had any regrets. “I keep on choosing the wrong people,” he told me – referring to the fact that he fell out with every single one of the deputy prime ministers and successors he chose.\nWhere his record was unambiguous was as a critic of a West that he believed still had a colonialist mindset. Not only did he refuse to bow down to those he considered his equals, but he also struck back in a manner that made him a hero to many in the developing world. His caustic responses to being berated by Australian leaders over human rights issues are too many to list.\nPerhaps the most audacious example of the Mahathir attitude came soon after taking office in 1981. Reacting to several issues, including the UK government raising university fees for Malaysian students threefold, he announced a new policy: “Buy British last”. For good measure, his government also took back the glorious colonial mansion in Kuala Lumpur that had been the UK High Commissioner’s residence. Not only did then-UK prime minister Margaret Thatcher hurriedly send two senior cabinet ministers to soothe feelings, but she also later treated Dr Mahathir to a grand dinner in No 10 Downing Street.\nRespect had been earned on both sides, as both leaders wrote in their autobiographies. And that’s one of the reasons why today, of all days, most Malaysians will put aside any reservations about Dr Mahathir’s record, his continued obsession with race, or the trademark sarcasm that seems too often lately to have curdled into bitterness.\nThey will celebrate a giant of a politician who truly stood up for Malaysia – while simultaneously being possibly quite relieved that they are unlikely to see his like again.",
  "word_count": 1100,
  "scraped_at": "2026-02-14T12:12:44.817430"
}