{
  "article_id": "eef3471274c8",
  "url": "https://www.cardchronicle.com/2024/9/24/24252374/tuesday-afternoon-cardinal-news-and-notes-louisville-cardinals",
  "title": "Tuesday afternoon Cardinal news and notes",
  "date": "20240924T230000Z",
  "domain": "cardchronicle.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "—Spread Check: Notre Dame by 6.\nTuesday afternoon Cardinal news and notes\nThe boys are already South Bend ready.\n—I’m going to go ahead and put this out here early this week because it’s going to be a thing: Saturday’s game is only available on Peacock. If that’s going to be a problem for you or if you know someone who you know this is going to be a problem for, the time to start making plans or figuring out how to use the app is now.\n#CardsOnTheCock\n—Congratulations to Teddy Bridgewater on being inducted into the Kentucky Sports Hall of Fame.\n—Teddy was effusive in his praise of the city of Louisville during his induction speech.\nI will love him forever.\n—Louisville is “on the bubble” in Athlon’s latest College Football Playoff projection.\n—The U of L men’s soccer team will step out of conference play tonight and host UAB. Here’s a preview.\n—The full week ahead in Cardinal sports:\nTuesday, September 24\nMen’s Soccer vs. UAB (Dr. Mark & Cindy Lynn Stadium) - 7 p.m. ET\nThursday, September 26\nWomen’s Soccer at Virginia Tech - 7 p.m. ET\nFriday, September 27\n#12 Field Hockey vs. Boston College (Trager Stadium) - 6 p.m. ET\n#4 Volleyball vs. California (L&N Federal Credit Union Arena) - 7 p.m. ET\nSaturday, September 28\n#15/17 Football at #16/14 Notre Dame - 3:30 p.m. ET\nSunday, September 29\nWomen’s Soccer vs. NC State (Dr. Mark & Cindy Lynn Stadium) - 1 p.m. ET”\n#12 Field Hockey at #6 Ohio State - 1 p.m. ET\n#4 Volleyball vs. #2 Stanford (KFC Yum! Center) - 3 p.m. ET\nMen’s Soccer at Boston College - 3 p.m. ET\n—Mikel Brown, the No. 1 point guard in the class of 2025, is expected to arrive in Louisville for his official visit to U of L tonight.\n—Louisville stays at No. 3 in USA Today’s ACC power rankings.\n—From the Rumble Seat recaps things from the Georgia Tech side. It seems like both fan bases are pleased with their respective passing games, but nervous about their offense’s inability to get much going on the ground.\nSome thoughts\nLet me begin by saying this was a great passing game for Haynes King. We’ve wanted to see him throw downfield, and he did so in a big way getting Rutherford and Singleton involved. Rutherford finished with seven catches for 113 yards and Singleton five catches for 88 yards. Rutherford, Singleton, Avery Boyd, and Jackson Hawes all had catches of 25 yards or more.\nBut we flip to the run game, and it’s the opposite of what we thought this team would look like. 98 total yards, Haynes King again our leading rusher, this time at 58 yards and a TD. Situationally, we were a DISASTER on late downs, even with the fourth down touchdown in the first half. On 20 3rd and 4th plays, Tech only seven successful plays that averaged 4.15 yards a play. Our EPA per rush the whole game was -0.38 points/play, which while Louisville’s was worse, is still inexcusable for us.\nWe legitimately had an avenue to win this game. We had it within one score with the ball in the fourth quarter. With our offense, there are not many teams that are reliably stopping us. In this game, we shot ourselves in the foot and just gave it away. The blocked field goal, the bad decision by King to throw it sideways in the first half, the inability to get a running back running, it was not good enough and the team would be the first ones to tell you that.\nA big factor that I think matters and was a topic coming into the game; this was our 5th game in five weeks, this was Louisville’s 3rd and they came off a bye week. Rest advantage in football is no joke with how physically taxing the sport is. Tech has played in two countries and three states over these five games. Yes, this is football, but these are still teenagers in some cases carrying a heavier travel load than some NFL teams do over a five week span. Oh, and they’re also full time students at Georgia Tech. Weird, undisciplined games are going to be a side effect of playing college football under the current conditions the state of the sport puts them in. To go 5-0 in this stretch would’ve required a truly phenomenal team that we don’t quite have yet. But, to still lose by one score to Syracuse and have a drive to potentially go ahead against Louisville I don’t think should be ignored. We still put ourselves in those situations despite our self-inflicted scheduling.\nWe get a week off next week, and boy do we need it.\n—Gonzaga’s AD says reports from Monday that the school has officially made the decision to leave the West Coast Conference for the Pac-12 are “not accurate.”\n—The CJ says Louisville will need to be much better against Notre Dame than it was against Georgia Tech if it wants to head into October undefeated.\n—Rene Konga is getting some NFL draft attention following his monster game against Georgia Tech.\n—The Louisville men’s basketball team’s ACC-SEC Challenge game against Ole Miss on Dec. 3 will tip-off at 9 p.m. on the ACC Network.\n—Louisville hoops target Tre Singleton says his decision is coming in “a week or two.”\n—Nick Saban: Still a big Jeff Brohm fan.\n—Pat Kelsey built the most experienced Louisville basketball team in decades. Will success follow? Here’s what the numbers say (CJ).\n—Former Card Junior Bridgeman is one of four Naismith Hall of Fame board members to receive the honor of “life trustee.”\n—Athlon’s Dan Lyons says Notre Dame is one of the three most overrated teams in the current AP top 25 poll.\n—New Card Tape just dropped.\n—Vintage heavyweight tees are the newest items being offered up by our friends over at Homefield Apparel.\n—Louisville safety commit Micah Rice says he’s transferring to North Oldham for the remainder of his senior season and will graduate in December before enrolling early at U of L. Rice had previously been playing for Cincinnati Moeller.\n—Louisville Report looks at how former Cardinals in the NFL fared in week three.\n—Here’s some more from Teddy on Monday night.\n—Because of what happened last year, Jeff Brohm expects Notre Dame to be out for revenge on Saturday afternoon.\n—College football road tripper Brett Gibbons was very impressed by the Cardinal fans on Saturday.\n—It’s Notre Dame week, which means it’s time for Mark Rutherford to start popping back up on your TVs.\nI’m back on “ACC PM” tonight at 6:15 on the ACC Network.\n—One Foot Down examines the Notre Dame depth chart heading into the Louisville game.\n—Rick Bozich previews the Cards vs. the Irish.\n—The latest From the Pink Seats podcast is here.\n—Notre Dame is using last year’s loss to the Cards for more than just motivation.\nThe Notre Dame fan site SlaptheSign.com called Louisville, “the biggest game of the year.” The game is designated as the program’s annual “Wear Green” game, and the Fighting Irish are expected to don green jerseys for the matchup – something generally saved for special occasions in recent times. The original alternate jerseys were introduced by Knute Rockne in 1921 to help make his receivers more visible on the field.\n“As you think back to last year, it’s not going to be a lack of motivation,” Notre Dame coach Marcus Freeman said. “They’ll be motivated.”\nWhile Freeman noted that he’ll have the stinging loss in front of his players a good bit this week, his primary concern won’t be motivation. Rather, he wants to use it for instruction.\n“It’s a lot like therapy,” Freeman said. “Sometimes you got to revisit those dark places, you know, to kind of get out of it what you need to. So, we’re definitely going to revisit last year. But my intentions are to make sure we gain the wisdom and the learning opportunities that the film of last year will truly tell us. . . . It’s an opportunity for guys that weren’t in this program last year to be able to reflect and understand that, ‘Hey, we lost to this team last year. But there’s a lot of great learning opportunities from that game, and that’s what I’m going to preach to our team. … I’m not revisiting last year to motivate you. I’m revisiting last year to learn from those things.”\n—Bill Connelly’s S&P rankings are predicting a 28-22 Notre Dame win.\n—Jordan Nwora is lighting it up in the preseason for his new club in Europe.\n—Some kind words for the city of Louisville from a Canadian:\nWell done, guys.\n—The Fayetteville Observer writes about Brandon Huntley-Hatfield and Mike James both making the move from Louisville to NC State.\n—Notre Dame writers Tim Hyde and Mike Singer discuss the keys to avoiding an upset on Saturday for the Irish.\n—And finally, the Mike Rutherford Show is back this afternoon from 3-6 on 1450/96.1 The Big X. You can stream it here.",
  "word_count": 1524,
  "scraped_at": "2026-02-14T13:14:28.212573"
}