{
  "article_id": "ef20718fdcee",
  "url": "https://www.yahoo.com/entertainment/kc-current-await-portland-thorns-195238273.html",
  "title": "KC Current await Portland Thorns in NWSL Championship rematch at Children Mercy Park",
  "date": "20230331T063000Z",
  "domain": "yahoo.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "KC Current await Portland Thorns in NWSL Championship rematch at Children’s Mercy Park\nThe Kansas City Current kick off their home schedule this weekend with a juicy rematch of last fall’s National Women’s Soccer League championship game against the Portland Thorns at Children’s Mercy Park.\nThe Current came up short in that championship match, so Saturday’s home opener has been circled and highlighted twice over.\n“We just went over a couple clips, and it was like, ‘Agh!’” said KC veteran Lo LaBonta. “Just seeing them from the final, that hurts and leaves a bitter taste in your mouth.”\nLaBonta is not alone. KC Current captain Desi Scott said the championship game loss was one of the main reasons she returned for another season in the NWSL. Current coach Matt Potter indicated the firepower the Thorns brought off their bench that evening in Washington, D.C. prompted his already competitive KC squad to load up with even more talent in the offseason.\nThe anticipation for Saturday’s home opener is further heightened by the frustrating outcome of last weekend’s season-opening loss at the North Carolina Courage.\n“We want not just a better result because of last Saturday but because of how the year ended last year,” LaBonta said.\nSaturday’s showdown with Portland will be a relatively early one. The start time has been moved up to 11:40 a.m. Central Time to accommodate a national broadcast on CBS. The Current anticipate a record crowd in Kansas City, Kan.\n“We’re hyped for it,” LaBonta said, “just to be out in front of our fans. We built a really good crowd last year and a fanbase ... I know we’re going to feel the energy and definitely play better than last Saturday.”\nThe Thorns remain a formidable opponent. They still boast one of the league’s deepest rosters, loaded with USWNT and International talent. They also have one of the brightest young stars in the world in Sophia Smith.\nSmith posted 14 goals and three assists last season en route to winning the NWSL MVP award. The 22-year-old scored and assisted in Portland’s 4-0 win over Orlando on opening weekend.\nSo how will the Current plan to stop Smith?\n“I think it’s about decision-making,” Potter said. “And once it’s about individual decision-making, it’s about a collectiveness of always knowing where she is so that it can be by committee versus any one individual.”\nMore in Sports\nFocusing solely on Smith could prove futile when the Thorns’ roster also boasts Crystal Dunn, Morgan Weaver, Hina Sugita, Michele Vasconcelos and Christine Sinclair.\nThe Current bulked up their roster, too. But a number of those key KC player additions are not available for game duty just yet because of injuries. Debinha, Vanessa DiBernardo and Mallory Weber have returned to full training, but it seems unlikely any of them would start. Even if they make the matchday squad, an extended run of minutes on Saturday wouldn’t seem to be in the offing.\nRegardless of who starts, the Current relish the opportunity at hand this weekend.\n“We wouldn’t want anything different,” Potter said. “For us to continue to progress in a manner that they (Portland) already have established, then we want to be on those big stages.\n“We want to be in front of those big challenges and see what we can find out about ourselves.”",
  "word_count": 554,
  "scraped_at": "2026-02-14T12:13:37.600409"
}