{
  "article_id": "ef242004fa1c",
  "url": "https://www.cbsnews.com/sacramento/news/uc-davis-equestrian-team/",
  "title": "UC Davis Division I equestrian team demoted to club , student - athletes devastated",
  "date": "20260114T110000Z",
  "domain": "cbsnews.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "UC Davis Division I equestrian team demoted to club, student-athletes devastated\nThe University of California, Davis announced it will downgrade its NCAA Division I varsity equestrian team to club sport status in favor of elevating another emerging women's sport to varsity this July.\nThe student-athletes of the Equestrian Team have had a home on the UC Davis campus for the past eight years. But for the 33 girls on the roster, their current competition season will be their last as DI athletes.\nFormer team captains and All-Americans Margaret Franke and Kendall Lance told CBS Sacramento they were blindsided and devastated by the mid-season bombshell.\n\"It's really disappointing that the university wants to take away that opportunity for these young women,\" Franke said.\nThe team of riders competes against the most elite collegiate equestrian athletes across the country.\nUC Davis Equestrian won back-to-back conference championships in 2023 and 2024, while also participating in the NCEA national championships following both their inaugural 2019 season and the 2024 season, according to the team.\n\"My general reaction was immediately so upset,\" said Lance. \"It does feel like it erases all of our hard work and the literal blood, sweat and tears we put into our sport.\"\nUC Davis leaders said in a statement that they consulted a third-party firm to review the program and the team's demotion came down to competitive alignment, student-athlete participation, academic performance, Title IX obligations and financial sustainability.\n\"These decisions were made following extensive external and internal analysis and thoughtful collaboration with campus leadership,\" said UC Davis Athletics Director Rocko DeLuca. \"As the landscape of Division I athletics continues to evolve, it is important that we regularly evaluate how we best align our resources to support student-athletes, advance gender equity, and position UC Davis Athletics for long-term success. Our student-athletes across the board—including those in Equestrian—are dedicated, talented, and driven. They represent UC Davis with tremendous pride and excellence.\"\nUC Davis leaders also referenced the fact that the university is one of just 14 DI schools nationwide to sponsor a dual discipline equestrian team.\nThe team has garnered more than 12,000 signatures in an online petition asking the university to reconsider. The girls say there is a big difference between competing as a DI athlete and participating in a club.\n\"A club sport has no financial backing from the university. So that's fully self-funded, and just the level of competitiveness is very different. At the NCAA level, we're competing against the best riders,\" Lance said.\nIn addition, they say there is no scholarship.\n\"The girls that get recruited for the NCAA team have spent their entire riding careers, from elementary school on, trying to achieve that. It's just a different animal,\" said Christine Smith, whose daughter is a freshman on the team.\nThe former captains say cutting the team feels off-brand for the university, home of the Aggies and Gunrock the Mascot, a horse.\n\"It's a little bit shocking in the sense that UC Davis prides itself on being an agricultural school,\" Lance said.\nThe equestrian team riders also serve as a mascot themselves, taking on the role of \"Maggie the Aggie\" at home football games.\n\"These girls want to compete. They want to get on horses and compete at their level, and that's been taken away from them after years of hard work,\" Smith said. \"This is their life. This is their world. This is what matters to them.\"\nThe West Coast options for a transfer are slim. The only other DI equestrian team in California is at Fresno State.\nSmith said her daughter feels like transferring is not an option and she wants to stay in Davis. The university's decision has left her daughter feeling \"empty.\"\n\"There's nowhere else for her to go unless she moves to South Carolina or Georgia or Texas. That's where the other NCAA teams are. There were only two in California, and now we're going to have one. It's really sad that they're taking away so many opportunities for folks that live on this side of the country,\" Smith said.\nLance worries this will stall the future of their sport.\n\"What impact will this have on other women's sports? What impact will this have on other equestrian teams? Because if Davis is willing to do this, possibly other teams are too,\" Lance said.\nIn place of the equestrian team, the UC Davis women's STUNT team, which is an offshoot of cheerleading, will now elevate from a club sport to NCAA varsity status in July. STUNT will compete as an NCAA Championship sport beginning in the 2026-2027 season.\nUC Davis says it will sponsor Equestrian as a varsity program through the 2026 academic year.\nAs for scholarships, the university says it will honor and maintain the aid for the student-athletes on the equestrian team now until they complete their undergraduate degrees.\nThe team's final regular-season meet is at UC Davis versus UT Martin on Saturday, March 7.",
  "word_count": 823,
  "scraped_at": "2026-02-14T13:23:38.579718"
}