{
  "article_id": "ef46baeb1b59",
  "url": "https://www.pressherald.com/2023/11/29/wednesdays-college-roundup-umaine-men-end-six-game-trip-by-beating-holy-cross-72-57/",
  "title": "Wednesday college roundup : UMaine men end six - game trip by beating Holy Cross , 72 - 57",
  "date": "20231130T024500Z",
  "domain": "pressherald.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Kellen Tynes had 20 of his 26 points in the first half as the University of Maine took an eight-point halftime lead to beat Holy Cross 72-57 in men’s basketball Wednesday night at Worcester, Massachusetts.\nJaden Clayton and Peter Filipovity had 15 points apiece, with Kristians Feierbergs adding 11 for Maine (5-4) as they concluded a six-game trip.\nLouth Coulibaly and Joe Octave each had 14 points for Holy Cross (2-6).\nMAINE-FARMINGTON 77, SOUTHERN MAINE 63: The Beavers (5-2) took a 10-9 early in the first half on a Jason Reynolds 3-pointer and did not look back as they defeated the Huskies (4-2) at Gorham.\nJordan Anthony paced Maine-Farmington with 19 points, Zachary Mickle chipped in 17 and Reynolds finished with 13.\nChance Dixon led Southern Maine with 23 points, and Brady Saunders and Tommy Whelan added 11 apiece.\nENDICOTT 107, UNIVERSITY OF NEW ENGLAND 91: The Gulls (3-3, 1-0 CCC) ran out to a 58-44 halftime margin, closing the first half on a 9-2 run, as they cruised by the Nor’easters (5-2, 0-1) at Biddeford.\nJalen Echevarria had 26 points to lead six players in double figures for Endicott.\nKyle Lombardi led UNE with 33 points, going 9 for 12 from the field.\nNHTI 107, SOUTHERN MAINE CC 105: Terrian Wester drained a runner at the buzzer in overtime as the Lynx (7-0, 6-0 YSCC) edged the Seawolves (5-3, 1-1) at South Portland.\nDahsan King had 25 points to lead six players in double figures for NHTI as it went 26 for 52 from behind the arc.\nThomas Martinotti had 21 points, including 8 for 11 from the line, for SMCC, and Adam Savage added 19.\nVIRGINIA 59, (14) TEXAS A&M 47: Andrew Rohde scored 13 points and host Virginia (6-1) took command with a 17-2 run spanning the halves and beat Texas A&M (6-2).\n(17) NORTH CAROLINA 100, (10) TENNESEE 92: RJ Davis scored 27 points as host North Carolina (6-1) built a huge lead and then held off a second-half push by Tennessee (4-3) in the inaugural ACC/SEC Challenge.\nArmando Bacot added 22 points and 11 rebounds for the Tar Heels, who dominated the opening 20 minutes to lead by as many as 23 and score 61 points by halftime. That lead grew to 76-52 early in the second half before the Volunteers flirted with pulling off a miraculous comeback behind a huge performance from Northern Colorado transfer Dalton Knecht.\nThe 6-foot-6 guard scored 22 of his career-best 37 points after halftime.\nSAINT JOSEPH’S 78, (18) VILLANOVA 65: Erik Reynolds II scored 24 points, Xzayvier Brown added 16 and visiting Saint Joseph’s (5-2) beat Villanova (6-2).\nRasheer Fleming had 12 points and 11 rebounds and Lynn Greer III scored 15 for St. Joe’s, which advanced to the first-ever Big 5 Classic championship game on Saturday night.\nJustin Moore scored 17 and Eric Dixon had 14 for the Wildcats, who struggled on offense all night. Villanova shot 22 of 56 and committed 17 turnovers.\n(22) JAMES MADISON 81, BUFFALO 66: TJ Bickerstaff scored 18 points and host James Madison (7-0) topped Buffalo (1-6).\nTerrence Edwards added 15 points as the Dukes cruised to their second straight blowout victory. Bickerstaff finished with seven rebounds and four assists.\nSy Chatman scored 19 points for Buffalo.\nWOMEN’S BASKETBALL\nUNIVERSITY OF NEW ENGLAND 86, ENDICOTT 64: The Nor’easters (5-2, 1-0 Commonwealth Coast) took control with a 9-0 run to close out the second quarter as they easily handled the Gulls (1-4, 0-1) at Biddeford.\nFaye Veilleux had 18 points to lead five players in double figures for UNE, Jordyn Frranzen had 16 points and Kaylee Beyor added 13 points and grabbed 11 rebounds, and Gabby Soter chipped in with 13 and Juliana Tracey tossed in 11.\nSarah Dempsey paced Endicott with 19 points.\nSOUTHERN MAINE 74, MAINE-FARMINGTON 56: Liz Cote had 22 points, going 6 for 10 from behind the arc, to lead the Huskies (2-5) to a win over the Beavers (2-6) at Gorham.\nTara Flanders added 13 points and pulled 10 rebounds for Southern Maine.\nJessica Dow had 12 points for Maine-Farmington.\nBOWDOIN 72, ST. JOSEPH’S 61: Jess Giorgio’s layup broke a 50-50 tie and sparked an 11-4 early fourth-quarter run as the Polar Bears (4-1) beat the Monks (4-3) at Standish.\nMaria Belardi led Bowdoin with 14 points, Callie Godfrey tossed in 12 points and Megan Tan and Carly Davey chipped in with 11 apiece.\nAngelica Hurley paced St. Joseph’s with 13 points, Nina Howe added 11 and Grace Ramsdell contributed 10.\nSOUTHERN MAINE CC 86, NHTI 43: The Seawolves (6-1, 1-1 YSCC) used a balanced attack to roll to a 21-2 first-quarter advantage and doubled up the Lynx (1-2, 1-2) at South Portland.\nHannah Thorsen came off the bench and led SMCC with 15 points and 11 boards.\nAlexis Christensen had 12 points to pace NHTI and Jenessa Lofton tossed in 10.\n(10) TEXAS 112, ORAL ROBERTS 74: Taylor Jones had career-bests 27 points and 16 rebounds in 24 minutes as Texas (8-0) defeated visiting Oral Roberts (4-3).\nLSU: Star forward Angel Reese, who has missed four games for undisclosed reasons, is rejoining the No. 7 Tigers in advance of their match-up with ninth-ranked Virginia Tech on Thursday night.\nReese, who is one of the most popular and commercially successful players in her sport, missed games at Southeastern Louisiana and against Texas Southern in Baton Rouge before also not accompanying the team to the Cayman Islands for a holiday tournament. LSU defeated Niagara and Virginia in the Cayman Islands Classic last weekend.\nReese also was benched for the second half of a victory over Kent State on Nov. 14.\n(18) NOTRE DAME 74, (20) TENNESSEE 69: Maddy Westbeld had 15 points and 11 rebounds, Natalija Marshall added 15 points and nine rebounds, and visiting Notre Dame (6-1) rallied from a 16-point deficit to beat Tennessee (4-3) in the ACC/SEC Challenge.\nFOOTBALL\nDUKE: Quarterback Riley Leonard entered the transfer portal, signaling his departure from the Blue Devils after two seasons as a starter.\nLeonard immediately becomes one of — if not the — most talented quarterback available in college football’s transfer market. The move comes two days after Duke lost its head coach, Mike Elko, to Texas A&M.\nLeonard’s 2023 season was cut short by ankle and foot injuries, but he helped lead the Blue Devils to a 4-0 start before being hurt on Duke’s final offensive play of its 21-14 loss to Notre Dame.\nHe finished this season throwing for 1,102 yards, three touchdowns and three interceptions in seven games. He also ran for 352 yards and four TDs. Last year, Leonard threw for 2,967 yards, 20 touchdowns and six interceptions and he ran for 699 yards and 13 scores as Duke went 9-4.\nSOUTH CAROLINA: Quarterback Spencer Rattler, perhaps the brightest spot for South Carolina in a losing season, is giving up his final year in college for the NFL.\nRattler, a fifth-year senior who spent his first three seasons at Oklahoma, announced his intentions on social media.\nUTAH STATE: Quarterback Levi Williams will not return for his senior season in 2024, intending to apply for Navy SEAL training following the Aggies’ upcoming bowl game.\n“I just want to be in a spot where I can protect this great country where we get to play football with the freedom to do that,” Williams told KSL 97.5 FM. “I think this is the best country in the world, so I’d like to keep it that way and protect it as long as I can.”\nThe junior QB plans to take a SEAL qualifying fitness test after the season. It is a rigorous test that features a 500-yard swim, maximum push-ups, pull-ups and curl-ups done in separate two-minute intervals, and a 1.5-mile run. The individual time for either the swim or the run cannot exceed 12 ½ minutes.\nARKANSAS: Arkansas announced it is bringing back Bobby Petrino to be offensive coordinator, 11 years after he was fired as head coach in a sordid scandal that involved a motorcycle accident, an affair with a woman who worked for him and being untruthful to his bosses.\nPetrino received a two-year contract that will pay him $1.5 million next season and $1.6 in 2025, according to a contract the school released.\nPetrino’s career has taken him all over college football and the NFL, often leaving a mess behind after some notable peaks. This past season he was offensive coordinator for Texas A&M, where Jimbo Fisher was fired last month.",
  "word_count": 1417,
  "scraped_at": "2026-02-14T13:10:35.904724"
}