{
  "article_id": "ef7ec09e26a4",
  "url": "https://www.cityam.com/mercedes-benz-stadium-home-of-atlanta-falcons-ready-for-club-world-cup-stage/",
  "title": "Atlanta Falcons owners ready for Club World Cup soccer showpiece",
  "date": "20250610T191500Z",
  "domain": "cityam.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Mercedes-Benz Stadium: Home of Atlanta Falcons ready for Club World Cup stage\nThe Club World Cup begins this weekend and Atlanta Falcons and their epic Mercedes-Benz Stadium are ready to shine.\nStarting on Saturday night in the US, two of 32 competitors will lift the curtain on the expanded Club World Cup. Fifa president Gianni Infantino has proclaimed the competition the pinnacle of club football but there have been concerns surrounding ticket sales and wider interest.\nAt the Mercedes-Benz Stadium – the megabuild that cost $1,8bn, holds 75,000 fans and has a signature pinwheel retractable roof – in Atlanta, Georgia, though, the excitement is palpable. Because the Peach State is now at the epicentre of the domestic game, with the US Soccer Federation upping sticks and moving to Atlanta.\nIt will host three group games – Chelsea’s opener against Los Angeles FC, Lionel Messi’s Inter Miami versus Palmeiras and Manchester City’s second game, against Al Ain – as well as two round of 16 matches and one quarter-final.\nHome to the Atlanta Falcons NFL franchise, the MLS club Atlanta United and future host of the 2028 Super Bowl, the Mercedes-Benz Stadium is part of parent group AMBSE, owned by Home Depot co-founder Arthur Blank.\nSoccer bid Stateside\nThe group’s chief operating officer Dietmar Exler, a former president and CEO of Mercedes-Benz USA, tells City AM that “50 per cent of the events we do at the stadium are soccer related”. Blank “is an American self-made entrepreneur and in 2006/7/8 he was watching his son in high school play soccer and that’s how he got connected,” he adds.\n“There are two trends in soccer,” Austrian-born Exler adds. “In Atlanta we have a metropolitan area of 6m people, 1m were born outside of the US. A big chunk of them came from Middle America and South America, and what sport did they grow up with? Soccer.\n“And the second is the amount of kids that play soccer today in high school. It’s the fastest growing sport. A lot of girls play, a lot of high schools offer it and the American Women’s National Team has been tremendously successful. We sold over 50,000 tickets for the SheBelieves Cup [50,644 for USA vs Japan and Brazil vs Canada double header].”\nPresident Donald Trump’s recent swathe of travel bans doesn’t appear to have had an impact on this year’s Club World Cup; teams have long been working on their plans. But next year’s World Cup – co-hosted by the US, Canada and Mexico – feels slightly more contentious, with Trump’s history of disparaging comments about his co-hosts’ citizens.\nClub World Cup opportunity\nExler says the Club World Cup will be successful, and praises Fifa for realising that the old format – where teams played in a series of tiered matches – did not work.\n“This new event gives us a chance to have the best clubs,” he adds. “I had a chance to talk to somebody who’s affiliated with River Plate and they’re kind of focused on, ‘we want to show these Europeans’.\n“Depending on how it ends, we might have a Brazilian team against an Argentinian team – there will be fire on the field when they play.”\nExler cites Nelson Mandela’s famous quote about sport having the power to change lives when asked about the World Cup and Trump’s stirring, simply adding that Georgia is a great state and the entry gate to the south. “It is the friendliest business state,” he adds. “It’s going to be tremendous.”\nWhether or not fans care about the Club World Cup will become clear over the next couple of weeks. England’s representatives – Chelsea and Manchester City – will be expected to make good progress, and will each play at the grand Mercedes-Benz Stadium.\nThe presence of them, and the world’s elite, in some of America’s great arenas could be the appetiser for next year’s main course. But for Atlanta and a stadium crossing soccer with American football, it’s time to shine on the world stage.",
  "word_count": 670,
  "scraped_at": "2026-02-14T12:35:18.629884"
}