{
  "article_id": "ef80bd62b46e",
  "url": "https://www.mirror.co.uk/3am/celebrity-news/jill-scott-addresses-claim-women-36248540",
  "title": "Jill Scott addresses claim women  cant have banter  as iconic series reaches end",
  "date": "20251114T163000Z",
  "domain": "mirror.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Jill Scott addresses claim women 'can't have banter' as iconic series reaches end\nJill Scott is best known for her impressive football career but has made the move into TV over recent years, lifting the I'm A Celeb trophy back in 2022\nA League of Their Own is bowing out with its last ever series – and presenter Jill Scott is definitely going to miss messing about with her male co-stars, Romesh Ranganathan, Jamie Redknapp and Micah Richards. “On this show, you're just one of the lads really,” she tells us.\n“Sometimes people think that women are more sensitive or you can't have banter and stuff like that. But hopefully this shows that if you’re in an environment where you trust people, and you're friends with people, the banter and everything can be taken in a light-hearted way.”\nFormer England footy star Jill, 38, joined the irreverent Sky show as a team captain in July 2023, but she found her arrival a little daunting. “The lights came on, and I was like, ‘It's such an iconic show. Wow, this is massive.’ But straightaway, Romesh, Micah and Jamie made me feel so at ease, and I think it's a credit to them that we created this environment where we can just say what we want because there's no bad intent.”\nAfter more than a decade of outrageous challenges and quick-fire banter, the 20th series will be the final outing, bringing us everything from wacky assault courses to popstar penalties and extreme crazy golf.\nSpecial guests will include Josh Widdicombe, Jon Richardson, Maya Jama, Chris McCausland, Tom Davis, Maisie Adam, Alex Brooker, while Jill is especially looking forward to the footballers making an appearance – including Lionesses heroine Chloe Kelly, plus England stars Wayne Rooney and Harry Maguire.\n“I'm so excited to get Wayne on,” she says. “He's so funny – he’s got such a dry sense of humour. And he's one of the best footballers to ever play the game. With the sports stars, you really get an insight into the stories that you wouldn't hear after they've played a game, because it's a much more relaxed environment.”\nSpeaking of her personal highlights over the years, she says, “It’s just seeing people dressed up as stupid things, like in the human dart game. You'd never expect to see Micah Richards dressed as a dart, would you? We also played hockey on lubricated floors where you’d just go absolutely flying. I love the fun and madness of it all.”\nJill says one of her most memorable experiences made her tackle one of her biggest fears. “My favourite challenge, which wasn't my favourite when I first got told I was doing it, was riding a bike along a tightrope, which was really high up. That was definitely the scariest. I hate heights, and people say, the more you do it, the better it gets. But I am still as terrified of heights as I was at the beginning.”\nThe star, who also took part in I’m A Celeb… in 2022, says viewers can expect even more craziness than usual as the final series **airs. “**I think the games have definitely stepped up,” she says. “The handbrake is definitely off.”\nShe’s hoping to remain in contact with her co-stars long after the final credits roll. “I'm sure we'll all keep in touch, and still grab a coffee together,” she says. “They've definitely become friends.”\nWhile there are mixed emotions about such a TV staple coming to an end, Jill says there’s plenty to be upbeat about. “It’s been so fun,” she says.\n“I think we have to look at this last series as a celebration of the whole show and all the series that have gone before. It's such an iconic show, so we've got to go out with a bang. It's one of the best shows I've ever been part of, and I've loved every minute of it.”\nA League of Their Own airs Wednesdays on Sky\nLike this story? For more of the latest showbiz news and gossip, follow Mirror Celebs on TikTok, Snapchat, Instagram, Twitter, Facebook, YouTube and Threads.",
  "word_count": 688,
  "scraped_at": "2026-02-14T13:06:49.846090"
}