{
  "article_id": "ef83f8be9793",
  "url": "https://nagalandpost.com/44-teams-to-vie-for-25th-nsf-martyrs-memorial-trophy/",
  "title": "44 teams to vie for 25th NSF Martyr Memorial Trophy",
  "date": "20250909T221500Z",
  "domain": "nagalandpost.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Delhi Police, Sikkim, Mnp among contenders\nThe 25th NSF Martyrs’ Memorial Trophy is set to begin from September 13 to October 18 at the Indira Gandhi (IG) Stadium in Kohima and the Chümoukedima Football Stadium. The tournament is jointly organized by the Naga Students’ Federation (NSF) and the Angami Students’ Union (ASU).\nAt a press briefing at the ASU office here on Tuesday, organisers revealed that 44 teams—including Delhi Police, a team from Sikkim, and seven from Manipur, in addition to local Nagaland squads—would participate in the silver-jubilee edition.\nThe tournament will feature approximately 900 players and 180 team officials, across 36 matches in Kohima and eight in Chümoukedima, totalling 44 fixtures.\nThe tournament will officially begin on September 13 at IG Stadium, Kohima, with Rural Development & SIRD Minister Metsubo Jamir expected to grace the opening ceremony as the special guest. Organisers anticipate a strong turnout to mark this milestone edition.\nASU president Diezevisie Nakhro stated that survivors of the tragic 1986 incident have been invited and special arrangements are being made to honour their memories. Medo Yhokha, steering committee convenor, emphasized that the event is not merely a football tournament—but a platform to build peace and unity. He also acknowledged the role of the Nagaland Football Association (NFA) and Kohima District Football Association (KDFA) in providing vital guidance.\nAddressing concerns about eight teams being seeded directly into the pre-quarterfinals, Yhokha explained that it was a special arrangement for the 25th anniversary aimed at raising the competition’s quality. “We understand the effort required from all teams; however, with Nagaland football advancing, such formats have precedent. We appeal for fair play from every side,” he said. Meanwhile, technical convenor Mhasimhalie Mathew Yhome added that invitations were limited to former champions and professional teams, and eight accepted the offer after careful deliberation.\nThe organising committee has announced an enhanced prize purse: Rs. 5 lakh for the champions, Rs. 3 lakh for runners-up, and Rs. 1 lakh for each losing semi-finalist, along with individual awards. Entry fees are set at Rs. 50 for preliminary rounds and Rs. 100 from the quarterfinal stage.\nTreasurer Kezhazer Angami outlined fiscal plans, revealing that surplus funds will be invested, with future tournaments funded from returns, ensuring sustainability. He also confirmed ongoing corporate tie-ups through CSR initiatives. Additionally, he shared plans to introduce qualifying rounds for village teams in future editions, aimed at boosting participation and confidence among grassroots sides.\nAn IT firm has been engaged to telecast matches, and organisers urged audiences to steer clear of unauthorised streaming. As in past editions, women’s football won’t be included this year, due to logistical and financial constraints, though there is openness to reconsidering this in future.\nThe press conference was jointly Medo Yhokha (Steering Committee Convenor), Khrielievi Chüsi (Steering Committee Co-convenor), Diezevisie Nakhro (ASU President), Mhasimhalie Mathew Yhome (Technical Convenor), Kezhazer Angami (Treasurer) and Sedeneikho Shosahie (Publicity Convenor).\nHistorical Significance: The Tragic March of 1986\nThe NSF Martyrs’ Memorial Trophy was established to honour the memory of Kekuojalie Sachü (19, Baptist English School, Kohima Village, now Baptist High) and Vikhozo Yhoshü (14, Kohima English School, now Mezhür Higher Secondary, Kohima). On March 20, 1986, they were fatally shot during a peaceful student protest organised by the Naga Students’ Federation. The demonstration was against the state government’s decision to introduce Indian Police Service (IPS) cadres into Nagaland and extend the Disturbed Area Belt from 5 km to 20 km along the Indo–Myanmar border.\nDespite having negotiated with officials to peacefully disperse from restricted zones, police opened fire without warning at Phoolbari Junction (MLA Hostel area), killing the two young students and injuring around 50 others.\nThe incident triggered massive public outrage: eight state ministers—including three from the Cabinet—resigned in protest. Over 50,000 Nagas attended the funeral at the Kohima Local Ground, which used to be the venue for the trophy in the past. This tournament serves not only as a sporting event but also a living memorial—a reminder of Naga youth’s sacrifice in pursuit of dignity and justice. It maintains the legacy of the two martyrs through the spirit of football, unity, and peace, and continues to inspire generations.",
  "word_count": 690,
  "scraped_at": "2026-02-14T14:18:07.276099"
}