{
  "article_id": "ef91d854b417",
  "url": "https://www.armidaleexpress.com.au/story/8316693/not-ready-to-let-go-where-to-find-the-matildas-playing-year-round/?cs=9676",
  "title": "How to support the Matildas and women sport year - round | The Armidale Express",
  "date": "20230823T234500Z",
  "domain": "armidaleexpress.com.au",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Out of a whirlwind FIFA World Cup, the Matildas don't have time to take a breath before they head into qualifiers for the Paris 2024 Olympics.\nSubscribe now for unlimited access.\nor signup to continue reading\nThe team will be playing on Sam Kerr's home turf at Perth's Rectangular Stadium in October.\nThey'll play against Iran on October 26, Philippines on October 29 and Chinese Taipei on October 31. Kick-off times are being finalised.\nAs football fever continues, Australians are looking for ways to follow and support their heroes.\nHow to support the sport\nAdvocates are calling for the resources needed to keep momentum for women's sport including financial and cultural support.\nSuccessful sporting clubs also need a crowd of people to cheer on the next generation of Kerrs, Catleys and Carpenters. And they need volunteers at the local clubs.\nMatildas fans can continue watching as their heroes conquer the pitch, see below for a guide to finding the champions year-round.\nMonash University lecturer Dr Thomas Heenan said Australia's World Cup success could be used to advocate for parity in women's sports.\n\"It's about equal pay and equal conditions, there's about seven teams that have been in dispute with their Federation at this World Cup, the average wage of any player in this World Cup is about $36,000,\" he said.\nIN OTHER NEWS:\nEncourage female participation\nAustralia can also promote the success of women's sport by creating a supportive culture and speaking respectfully about female and transgender athletes.\nTouch Rugby player Maddy Morrall said she's glad her kids will have the female athletic role models on the national stage that were lacking in her generation.\nThere were only two other women in her high school P.E. class in Bundaberg, Queensland and Ms Morrall said she was regularly on the receiving end of sexist remarks about her sporting passions.\n\"People say 'well, you made the women's team - any one could do that',\" she said.\nHer major achievements never felt as celebrated as her male counterparts, Ms Morrall said.\n\"But I haven't heard any of that kind of negativity towards the World Cup.\n\"It's a good change, it's going in the right direction.\"\nParity in women's soccer\nWith former Socceroo Craig Foster putting Australian politicians on notice, that their vocal support for the Matildas should be backed up by better funding for the world game, the Albanese Government announced $200 million to improve women's sporting facilities and equipment.\n\"There is something really significant happening in this World Cup and it's emphasising that there should be more women in administrative posts leading sport,\" Dr Heenan said.\n\"You're going to have parity on the pitch, let's have parity in administration,\" he said.\n\"You need to be fuelling money into that community base, particularly when a major portion of that base doesn't have the facilities to change in at the most basic level.\n\"It should be funded on an equal status with the major codes of rugby and Australian Rules Football - it is an internationally far more significant sport.\"\nDr Heenan said the Matildas were Australia's most marketable team and their growth had been organic.\nFrom here he said women's participation in football had to grow and Australia must realise the soft power significance of the Matildas.\n\"It's about using this event to equalise sports based on gender, but its also about engaging with the Pacific as a tool of soft diplomacy,\" he said.\nWhere to find the Matildas at home and abroad\nSam Kerr\nCatch Kerr wearing the blue jersey for Chelsea F.C. when the 29-year-old striker returns to the English Women's Super League and UEFA Women's Champions League.\nKerr is the Chelsea F.C.'s top scorer and a highly-awarded player and team member.\nMary Fowler and Alanna Kennedy\nCairns-born Mary Fowler plays forward for Manchester City W.F.C. in the English Women's Super League and UEFA Women's Champions League.\nShe secured her first goals for the team in a 6-0 Continental Cup win over Blackburn in October 2022.\nStar midfielder and defender Alanna Kennedy also signed a two-year contract extension with Manchester City in May 2023.\nEllie Carpenter\nThe Cowra-born defender made the move to Lyon in 2020, joining Olympique Lyonnais Féminin.\nHer team plays in UEFA Women's Champions League, Division 1 Féminine and Coupe de France Féminine.\nHayley Raso\nAfter three years playing for English teams, winger Hayley Raso joined the Spanish team Real Madrid in 2023.\nShe plays in the English Women's Super League and UEFA Women's Champions League.\nKatrina Gorry, Clare Polkinghorne and Charlotte Grant\nCatch midfielder Katrina Gorry and fellow Queenslander Clare Polkinghorne playing in the Swedish League for Vittsjo GIK.\nCharlotte Grant joined her teammates in Sweden in 2021, playing for Rosengard and Vittsj GIK.\nTune into the Sweden's Damallsvenskan League to watch their games.\nMackenzie Arnold\nGoalkeeper Mackenzie Arnold has made 54 league appearances for West Ham United since joining the team in 2020.\nShe plays in the English Women's Super League.\nCaitlin Foord and Steph Catley\nWinger and forward Cailtin Foord joined an exodus of Australians headed to Arsenal F.C. for the 2019-2020 season. She averages a goal for every two starts despite often being played as a left wing.\nSteph Catley signed a new contract with the club in 2022 and is described by Arsenal as \"a reliable full-back with a stunning delivery\".\nThey play in the English Women's Super League and UEFA Women's Champions League.\nCortnee Vine\nShepparton's own Cortnee Vine continues as a hero of Australian soccer, playing for Sydney F.C in the Australian A-League.\nKyra Cooney-Cross\nMidfielder Kyra Cooney-Cross began playing in Sweden's Damallsvenskan League in early 2022, signing a two-year contract with Hammarby IF.\nAlex Chidiac\nAlex Chidiac signed a one-year contract with U.S. team Racing Louisville in 2022, but spent much of the year loaned to Melbourne Victory.\nRacing Louisville play in the U.S. National Women's Soccer League.\nEmily van Egmond\nMatildas midfielder Emily van Egmond plays for U.S. team San Diego Wave F.C. after a multi-player trade with Orlando Pride.\nHer contract lasts through the remainder of 2023 to play in the U.S. National Women's Soccer League. .\nCourtney Nevin\nCourtney Nevin left home to play for Hammerby IF in Sweden's women's league in 2022 but permanently transferred to Leicester City as a defender in July 2023.\nShe plays in the English Women's Super League.\nClare Hunt\nDefender Clare hunt has been under contract with the Western Sydney Wanderers since 2021 and plays in the Australian A-League.\nLydia Williams\nGoalkeeper Lydia Williams has made seven appearances for Brighton and Hove Albion W.F.C. in the English Women's Super League.\nShe's signed an 18 month contract with the club after leaving Paris Saint-Germain.\nKyah Simon\nKyah Simon is signed as a striker with Tottenham Hotspur but tore her ACL playing in the English Women's Super League in October 2022.\nTameka Yallop\nTameka Yallop joined Norwegian club SK Brann Kvinner in August 2022 with a further six month option.\nShe plays as a midfielder in Norway's premier league Toppserien.\nAivi Luik\nAivi Luik plays in Sweden's Damallsvenskan League for Gothenburg team BK Hacken FF.\nClare Wheeler\nClare Wheeler plays for the Liverpool-based club Everton F.C in the English Women's Super League.\nThe Coffs Harbour midfielder was loaned to Everton in August 2022 and signed on permanently when her contract ended.\nTeagan Micah\nGoalkeeper Teagan Micah defends Liverpool F.C.'s penalty area in the English Women's Super League.",
  "word_count": 1234,
  "scraped_at": "2026-02-14T12:40:10.043022"
}