{
  "article_id": "efa0b064d8c4",
  "url": "https://decider.com/2025/05/13/all-american-season-7-netflix-review/",
  "title": "  All American  Season 7 Netflix Review : Stream It Or Skip It ? ",
  "date": "20250514T011500Z",
  "domain": "decider.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Season 7 of All American lands on Netflix after its premiere last January on the CW. That’s how the play has traditionally been drawn up, and some All American fans like to wait til it streams so they can smash that binge button. But there are new wrinkles to be aware of. All American star Daniel Ezra has moved on – Season 6 saw Spencer and Olivia (Samantha Logan) marry and move to New York, where he’s turning pro – so it’s Jordan (Michael Evans Behling) and Layla (Greta Onieogou) and Coop (Bre-Z) holding it down for the Vortex friend crew in Los Angeles, where they’re joined by new faces in football and in life. Osy Ikhile (Black Mirror) and Nathaniel Logan McIntyre (The Equalizer) are notable additions for season 7 of All American, which otherwise remains in series renewal limbo.\nALL AMERICAN – SEASON 7: STREAM IT OR SKIP IT?\nOpening Shot: Spencer James is heard in voiceover, like a little connecting piece as All American moves on from Daniel Ezra’s main character. “Them 10,000 hours starts young,” Spencer says of a young person’s training for pro football glory. And we see shots of Jordan Baker (Behling), now a coach, working with Chargers players in the South Crenshaw weight room.\nThe Gist: It’s Spencer’s voice note to Jordan we’re hearing, as the latter prepares for his first football season on the coaching staff at Crenshaw. While Jordan scolds Chargers quarterback Yasi (Elijah M. Cooper) for blowing off OTAs, he also frets over his role, and where to establish the line between coaching and being one of the guys. It doesn’t help that Crenshaw head coach Bobby Shepard (Gilbert Glenn Brown) seems to have it out for Jordan. And if his new job wasn’t enough of an adjustment, Jordan and Layla (Onieogou) are also clashing a bit as they engage with married life. For her part, Layla wonders, as both a married woman in her early 20s and the operator of her namesake lounge, if she’s already peaked as a grown-up.\nThere are changes all over the place in All American Season 7. Coop (Bre-Z) is about to begin law school, but is also keeping an eye on Amina (Alexis Chikaeze), 16, who chafes at everyone trying to tell her she’s too young or too this or too that. At school, Amina might be interested in Khalil (Antonio J. Bell), a bright student with connections to the Crips. But Amina also meets and immediately likes Kingston Jeremy (McIntyre), “KJ,” a talented football player visiting LA from Oakland. Well, he thinks it’s a visit, anyway. KJ’s parents Cassius (Ikhile) and Ava (Angel Parker) have agreed to a trial separation – we don’t know all of the details behind that, but she’s leaving his texts on read – and he’ll join his dad at Beverly Hills High, with Cassius as head football coach and KJ as quarterback of the Eagles.\nThere is an on-field rivalry setting up between Beverly and Crenshaw for All American Season 7. Or as Yasi says, Beverly thinks they’re the “Kendrick to our Drake.” But the off-the-field stuff matters in this series, too, and especially as the the characters around its football core have evolved. There will still be drop-ins – from Spencer and Olivia, from Monet Mazur as Laura Fine-Baker, and from Chelsea Tavares as Patience Robinson, who parted from Coop to pursue her Broadway dreams. But it’s the relationships and trials of the younger cast on All American that should rise up, even as Jordan, Layla, and Coop navigate their crew’s collective evolution.\nWhat Shows Will It Remind You Of? So what’s Daniel Ezra up to, now that his All American playing days are over? He’s starring with Glen Powell in a Running Man remake. The Chi is also returning in May for a seventh season. And while NYC is an unseen outpost for a few All American characters, it’s home for the women of Harlem, which recently dropped its third and final season on Prime.\nOur Take: “Someone there to help us navigate the ups and downs of life…to take these kids all the way to they dream…” The early going of All American Season 7 gets as much mileage as it can out of Spencer James’s voice note pep talk to Jordan Baker, since his encouragement applies to more than what goes on between the gridiron lines. This new season will present new professional and personal challenges for Jordan and Layla, who are now navigating life’s ups and downs as married partners. And Coop watched what could have been with Patience walk out the door to New York City, though that may be a good thing, as she confronts her own next chapter. All American even introduces Coop and Layla to Cassius Jeremy in such a way that his marital strife with Ava becomes something for them both to help him solve.\nThe series is aiming to retain the frame it built over the years – married Layla and Jordan are even living in the Baker family house, the Vortex’s longtime hangout – while plugging new components into available spots. So, kind of like a team does when star players retire or are traded away? Wait, is Season 7 a rebuilding season? It would have to be officially renewed for there to be something to fully rebuild. But All American does have enough going on with its veteran characters and the new faces added – with Cassius and his son KJ being of particular interest – to remain a contender.\nSex and Skin: Nothing beyond light suggestion. This show airs on the CW, after all.\nParting Shot: Cassius Jeremy (head coach) and KJ (star QB) check out the weight room at Beverly High, where the Eagles championship banners fly. “Welcome to our new home.”\nSleeper Star: Daniel Ezra’s departure has moved All American to focus even more on its ensemble, so it’s not exactly a one-to-one comparison. But Nathaniel Logan McIntyre as KJ is a match for Spencer’s quarterback position, and Ezra’s million-watt grin.\nMost Pilot-y Line: “What happened to us?” Layla asks Coop, as they discuss Layla’s new marriage and picking out paint chips for the Baker house. “I guess we grew up.”\nOur Call: STREAM IT. As Season 7 of All American tosses its usual lateral from airing on the CW to streaming on Netflix, its cast shakeups signal an emphasis on new storylines, while the OGs who remain are greeting new challenges as adults.\nJohnny Loftus (@johnnyloftus.bsky.social) is a Chicago-based writer. A veteran of the alternative weekly trenches, his work has also appeared in Entertainment Weekly, Pitchfork, The All Music Guide, and The Village Voice.",
  "word_count": 1114,
  "scraped_at": "2026-02-14T12:58:16.666087"
}