{
  "article_id": "efc4cf607948",
  "url": "http://www.batonrougepost.com/news/278463680/49ers-announce-2025-bill-walsh-nfl-diversity-coaching-fellows",
  "title": "49ers Announce 2025 Bill Walsh NFL Diversity Coaching Fellows",
  "date": "20250724T023000Z",
  "domain": "batonrougepost.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "San Francisco 49ers\n24 Jul 2025, 04:15 GMT+10\nThe San Francisco 49ers head coach Kyle Shanahan today announced the team's 2025 Bill Walsh NFL Diversity Coaching Fellows OL coach Osama Abulhassan, WR coach Stephen Amoako, S&C coach Devonte Chandler, LB coach Yosef Fares, DB coach Quentin Jones, TE coach Mike Machado and DL coach Rusty McKinney.\nAbulhassan, who will work with the 49ers offensive line, serves as the founder and coach of Youth Tractor Football, a non-profit youth football organization in Dearborn, MI. He was brought onto the New York Jets coaching staff as a Bill Walsh Diversity Coaching Fellow in the spring of 2024 after working with them in the same capacity in 2022. Previously, he served as the associate head coach and offensive coordinator for Fordson (MI) High School's varsity football team (2011-23). He received his bachelor's degree in political science from the University of Michigan, Dearborn (2009-12) before obtaining his master's in education in math curriculum & instruction from the University of Texas, Arlington (2014).\nAmoako, will work with the 49ers wide receivers. He is currently an assistant coach at Georgetown University where he works with wide receivers. Amoako previously worked as the outside linebackers and nickelbacks coach at Morehead State University (2024). Prior to his experience at Morehead State, he served as the wide receivers coach and passing game coordinator at the College of San Mateo (2022-24). Before his time at San Mateo, Amoako was the head strength & conditioning coach at Valley Christian High School (2021-22). Amoako previously served as the passing game coordinator, special teams coordinator and wide receivers coach at De Anza College (2018-21). Amoako received his master's in education from the University of Louisiana Monroe (2016-17). He played defensive back for the University of Oregon's football team (2012-14) before transferring to Illinois State University where he received his bachelor's of science.\nChandler will work with the 49ers strength and conditioning staff. Currently, he serves on the strength and conditioning staff at Western Michigan University. Before his time at Western Michigan, Chandler was an assistant strength and conditioning coach at Arkansas State University while earning his master's degree in sport and fitness administration/management (2023-25). Prior to his time at Arkansas State, Chandler served as an assistant strength and conditioning coach at Piedmont Volleyball Club in Greensboro, NC. He also worked as an assistant strength and conditioning coach at his alma mater, Elon University (2023), where he earned his bachelor's degree in communication and media studies and played linebacker (2018-22).\nFares will work with the 49ers linebackers. He is the head coach of the varsity football team at Garza (CA) High School while teaching physical education at Central Unified (CA) High School. Previously, he has served as a Bill Walsh Diversity Coaching Fellow for the Chicago Bears (2024) and Atlanta Falcons (2022-23). Fares obtained his master's in education from National University in 2022. He received his bachelor's of science in kinesiology and physical education from California State University, Fresno (2011-14).\nJones, who will work with the 49ers defensive backs, currently serves as the assistant defensive backs coach at The Georgia Institute of Technology. Jones previously worked with the quarterbacks at his alma mater, Lehigh University (2021-22). He played professional football with the Memphis Express of the Alliance of American Football and the Nojima Rise in Japan's X-League (2019). Jones played defensive back at Lehigh University while earning his bachelor's degree in sociology (2014-17).\nMachado will work with the 49ers tight ends. He is currently the offensive coordinator and wide receivers coach at his alma mater, Lewis & Clark College. Machado previously served as a graduate assistant at San Jose State University working with the offense (2020-21) while working towards a master's degree in interdisciplinary studies. Previously, he was an offensive quality control intern at San Jose State University, where he coached their tight ends and special teams units (2019). As a player, Machado was a quarterback at Lewis & Clark College where he earned his bachelor's degree in rhetoric and media studies (2015-18).\nMcKinney, who will work with the 49ers defensive line, is serving as an assistant coach at Davenport University where he also works with the defensive line. He was previously selected as a Bill Walsh Diversity Coaching Fellow by the San Francisco 49ers and worked with the tight ends (2024). Prior to his time with the 49ers, McKinney served as a defensive assistant coach for the Arizona Cardinals (2019-22) following three seasons with the Miami Dolphins as a defensive quality control coach (2016-18). McKinney previously served as a coaching intern for two seasons with the Cleveland Browns (2014-15). Prior to his time coaching in the NFL, McKinney served as the linebackers coach, strength and conditioning coach, special team coordinator and defensive coordinator for Bentley University (2009-13). McKinney graduated with a bachelor's degree in business administration from the University of Towson and an associate's in culinary arts from Johnson and Wales University (2004).\nLatest Videos Channel\nBrock Purdy, Fred Warner Discuss Competition and Leadership at Training Camp\nLatest Videos Channel\nLynch, Shanahan Preview 2025 Training Camp, Share Key WR Updates\nLatest Videos Channel\n49ers Make History in Dubai | First NFL Team to Launch in UAE\nLatest Videos Channel\n49ers FLAG x SF City Girls Flag Skills Camp\nLatest Videos Channel\n49ers PREP x SF City Taube Tackle Skills Camp\nLatest Videos Channel\n49ers EDU Selects Bay Area Teachers as 2025 'Follow Your Bliss' Award Recipients\nLatest Videos Channel\n49ers Foundation Host High School Female Student-Athletes for T.H.I.N.K. Gold Conference\nLatest Videos Channel\n49ers Host High School Students for 'Foundation for Success' Event\nLatest Videos Channel\nMini Camp Breakdown, Bryce Huff Deal & Lindsey's Last Pod | 1st & 10\nLatest Videos Channel\nChristian McCaffrey and Bryce Huff Share Offseason Mindset, Team Goals\nLatest Videos Channel\nSaleh Breaks Down Defensive Identity, Rookie Standouts & Huff's Impact\nLatest Videos Channel\nWilliams, Lenoir Talk Offseason Focus, Stepping Into Leadership\nLatest Videos Channel\nShanahan Talks Injuries, Offseason Progress & Key Veterans\nLatest Videos Channel\nPurdy, Kittle, Warner Locked In & OTA Takeaways | 1st & 10\nLatest Videos Channel\nBrock Purdy, Nick Bosa, Mac Jones on SEAL Workouts and Team Chemistry\nLatest Videos Channel\nLombardi, Bradley, Kocurek, Turner Jr., and Holland Discuss 2025 Season Goals\nLatest Videos Channel\nGeorge Kittle, Fred Warner on Leadership, Rookies, and 49ers Offseason Energy\nLatest Videos Channel\nKyle Shanahan on Offseason Reset, First Impressions from OTAs\nLatest Videos Channel\nFred Warner's Top Plays from His 49ers Career (So Far)\nLatest Videos Channel\nThe Rise of San Francisco's QB1: Brock Purdy\nLatest Videos Channel\nBrock Purdy Addresses Media Following Five-Year Contract Extension\nLatest Videos Channel\n49ers Lock In Their QB1: Brock Purdy Signs 5-Year Contract Extension\nLatest Videos Channel\nBrock Purdy's Top Plays from His 49ers Career (So Far)\nLatest Videos Channel\n49ers Foundation's 2025 Golden Getaway\nLatest Videos Channel\n49ers Invasions are Back for the 2025 Season\nLatest Videos Channel\nSan Francisco 49ers 2025 Schedule Release | Golden Trail\nLatest Videos Channel\n49ers Rookies Share Draft Reactions and Goals for First NFL Minicamp\nLatest Videos Channel\nRobert Saleh, Klay Kubiak, Brant Boyer Set the Tone for 49ers 2025 Season\nLatest Videos Channel\n49ers PREP Highlights Eden Enoru for Women's History Month\nLatest Videos Channel\n49ers EDU Participate in Read Across America Week\nLatest Videos Channel\nGeorge Kittle's Top Plays from His 49ers Career (So Far)\nLatest Videos Channel\n'GMFB' Reacts to George Kittle's New Four-Year Contract with 49ers\nLatest Videos Channel\nLocked In: George Kittle Signs a Four-Year Extension with the 49ers\nLatest Videos Channel\nBehind the Scenes of George Kittle's Four-Year Extension with the 49ers\nLatest Videos Channel\n49ers 2025 NFL Draft Recap | 1st & 10\nLatest Videos Channel\n49ers Player Personnel Talk 2025 NFL Draft Process\nLatest Videos Channel\nJohn Lynch Recaps Day 3 of the 2025 NFL Draft | 49ers\nLatest Videos Channel\nJunior Bergen's Journey to the 49ers | 2025 NFL Draft\nLatest Videos Channel\nConnor Colby Talks 49ers Fit and Future | 2025 NFL Draft\nLatest Videos Channel\nMeet Kurtis Rourke: 49ers Seventh-Round Pick | 2025 NFL Draft\nShares\nShare\nTweet\nShare\nFlip\nEmail\nGet a daily dose of Baton Rouge Post news through our daily email, its complimentary and keeps you fully up to date with world and business news as well.\nPublish news of your business, community or sports group, personnel appointments, major event and more by submitting a news release to Baton Rouge Post.\nMore Information\nnull in null\nNEW YORK, New York - U.S. stocks rose sharply Wednesday as investors and traders started to come round to the benefits of recent trade...\nWASHINGTON, D.C.: Microsoft has warned of active cyberattacks targeting a widely used server software that allows businesses and government...\nSHANGHAI, China: A leading Chinese automotive industry publication has walked back claims that regulators plan to ban the resale of...\nNEW DELHI, India: India has firmly rejected the European Union's latest round of sanctions on Russia, asserting that it does not recognize...\nNEW YORK, New York - U.S. equity markets delivered a mixed performance to start the week, with the Dow Jones Industrial Average climbing,...\nNEW YORK CITY, New York: Lin-Manuel Miranda is using the 10th anniversary performance of Hamilton on Broadway not just to celebrate...\nA chorus of condemnation echoed across the international community on Monday as Britain and more than 20 other countries—including...\nA typical, but devastating day of violence and deepening humanitarian catastrophe unfolded across the Gaza Strip on Saturday, as at...\nMirwais and family have left their home in Kabul and have been constantly changing their location since 2022, when a group of armed...\nISTANBUL, July 23 (Xinhua) -- Russian and Ukrainian delegations held a third round of peace talks here on Wednesday evening at the...\nAll humanitarian agreements have been fulfilled, Vladimir Medinsky has said Russia and Ukraine have fulfilled all the humanitarian...\nThe findings were published in a report by the research unit of Confindustria, Italy's main business lobby, amid concerns over rising...",
  "word_count": 1659,
  "scraped_at": "2026-02-14T13:43:16.969484"
}