{
  "article_id": "efdf23b1e0d5",
  "url": "https://www.gazettelive.co.uk/news/teesside-news/who-could-replace-gary-lineker-26446370",
  "title": "Who could replace Gary Lineker on Match of the Day this weekend",
  "date": "20230310T220000Z",
  "domain": "gazettelive.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "The BBC announced tonight that former England international Gary Lineker has \"stepped back\" from presenting Match of the Day this weekend. It comes after one of his tweets about the government's new asylum policy sparked furore.\nThe broadcaster confirmed he will not front the show until both the footballer and corporation bosses have an “agreed and clear position on his use of social media”. The former Leicester City striker has hosted the show since 1999 when he took over from Des Lynam.\nDuring his tenure, the BBC has however had to have stand-ins for Lineker on occasion. Mark Chapman, Gabby Logan and Dan Walker have all deputised over the past 24 years.\nAnalysts Ian Wright and Alan Shearer have already announced they will not appear on this week's show. Now, the PA news agency has had a look at who could step into the hot seat this weekend.\nJermaine Jenas\nThe former Nottingham Forest, Newcastle and England midfielder is mainly used either as a studio guest or as a pundit alongside a commentator by BBC Sport, but Jenas has demonstrated his presenting skills on The One Show. He was also chosen by Fifa to host the draw for the 2022 World Cup finals in Qatar.\nAlex Scott\nScott, 38, enjoyed a successful playing career with Arsenal and England before moving into broadcasting after her retirement in 2017.\nLike Jenas, she has presented The One Show and has also worked alongside Lineker in the past as a presenter of the BBC’s Sports Personality of the Year programme.\nShe was also a contestant on one of the corporation’s flagship entertainment shows, Strictly Come Dancing, in 2019. However, a tweet from her account on Friday evening suggested she was not in the running.\nGabby Logan\nFormer gymnast Logan has presented MOTD in Lineker’s absence on many occasions in the past, while she also fronted the BBC’s coverage as the Lionesses stormed to glory in last year’s Women’s Euro.\nShe has also been involved in the BBC’s coverage of Six Nations rugby, and the last four summer Olympic Games.\nMark Chapman\n“Chappers” is the regular presenter of Match Of The Day 2, which shows highlights of Premier League action on Sunday evenings. He is also a key part of the BBC’s coverage of football on radio, presenting Sports Report on 5 Live and the Monday Night Club on the same channel.",
  "word_count": 397,
  "scraped_at": "2026-02-14T11:59:27.999918"
}