{
  "article_id": "f0b99fe255ea",
  "url": "https://www.dailyrecord.co.uk/news/uk-world-news/spains-world-cup-hero-learned-30748489",
  "title": "Spain World Cup hero learned father had died after she scored winning goal",
  "date": "20230820T224500Z",
  "domain": "dailyrecord.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Spain's World Cup hero learned father had died after she scored winning goal\nThe 23-year-old sparked jubilant scenes at Stadium Australia after scoring the goal which ultimately defeated the Lionesses'.\nSpain's Olga Carmona, who scored the winning goal against England in the Women's World Cup final today, received the heartbreaking news that her father had died after the match.\nCarmona was key to La Roja winning the tournament for the first time in their history after breaking the deadlock midway through the first half.\nThe 23-year-old sparked jubilant scenes at Stadium Australia after scoring the goal which ultimately defeated the Lionesses', the Mirror reports.\nBut after winning the World Cup, Carmona received the devastating news that her father had passed away, the Royal Spanish Football Federation has said.\nA statement from the RFEF on Sunday evening read: \"The RFEF deeply regrets to report the death of Olga Carmona's father. The soccer player learned the sad news after the World Cup final.\n\"We send our most sincere hugs to Olga and her family in a moment of deep pain. We love you, Olga, you are the history of Spanish football.\"\nCarmona had revealed a touching tribute to her best friend's late mother who had recently passed away while she celebrated her goal, as she showed a message on her shirt saying \"Merchi\".\nHer name was written into Spanish folklore with her strike against England as the Lionesses' tried to battle back to find an equaliser but were unable to breach their opponents.\nTop news stories today\nThe game would have been over for Sarina Wiegman's side much earlier were it not for Mary Earps, who prevented Spain from doubling their lead from the penalty spot in the second half.\nDon't miss the latest news from around Scotland and beyond - Sign up to our daily newsletter here.",
  "word_count": 306,
  "scraped_at": "2026-02-14T12:05:13.826833"
}