{
  "article_id": "f0bc7bcd0261",
  "url": "https://www.montanakaimin.com/features/for-the-love-of-club/article_9aec1360-02a3-11ef-97e2-3b0e73ee93c7.html",
  "title": "For the Love of Club",
  "date": "20240425T204500Z",
  "domain": "montanakaimin.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "It’s 9 a.m. on a warm Saturday on the outskirts of Bonner, Montana. The 20-odd men of the University of Montana club baseball team slowly trickle into Kelly Pine Field, making sure to park their cars as far away from the field as possible. They’ve all played long enough to see a windshield cracked by a foul ball.\nSome holding coffee and others donning gloves, the players begin some light defensive practice. There’s excitement in the air as the team’s opponent in the day’s double-header, Washington State University, rolls into the lot.\nThe UM team’s 20-year-old president, Charles Nance, welcomes his opposite number from WSU, Joshua Waite, and the two crack a few jokes before preparing their teams for the game.\nNance catches a few light pitches from 22-year-old Griz Kaden McDowell, his longtime friend and pitching mate. The familiarity and quiet confidence McDowell and Nance share is obvious.\nMcDowell and Nance pour an average of 16 hours each week into UM’s team on top of pursuing forestry and wildlife biology degrees at the University, respectively. The trips to Bonner and the searches for discounted equipment necessary to keep the team running can be tiring, but sometimes members see it pay off in big ways.\nDuring a tournament in Las Vegas last month, McDowell came out of the bullpen against San Diego State University’s club team. He knew he needed to raise the bar — especially since SDSU put up 20 runs in just two innings.\nHe wound up his 6-foot-1 frame and threw some of the hardest pitches of his life. The first went wide of the strike zone and the batter didn’t bite. He followed it up with a deceptive curveball that caught the batter swinging. He allowed three runners on base, but his arsenal of pitches locked out every SDSU run attempt that inning.\nThe team still lost — badly. It ended on a mercy rule with SDSU beating UM by 19 runs, not entirely unexpected given SDSU’s status as a division above UM. But SDSU’s coach David Aceron was impressed. Aceron is the general manager of the Dublin Leprechauns, a minor league professional baseball team that plays in the Pecos summer league.\nHe liked McDowell’s game and offered him a chance to play pro for the summer, making McDowell the first player in the UM club team’s history to ink a pro deal.\n“It’s definitely a dream that every baseball player has,” McDowell said. “I kind of gave up on the dream and then did [club baseball] to just keep playing, and that’s what it’s all about — just keep playing.”\nIt takes the whole team to bring players like McDowell this success — while Nance does the bulk of the scheduling and paperwork, all 24 full-time members pay their dues, fundraise and even pull weeds on the Bonner field where they host their games to keep their dreams on the diamond alive.\nIt’s a labor of love solely for their shared passion for the game, and they persist despite usually having only a few dozen people in the crowd cheering them on. Since the University doesn’t rally around club sports like baseball the way it does around NCAA-sanctioned sports like football, it’s the price players pay as they tackle lackluster budgets, a complex funding system and a host of other challenges.\nASUM 101\nClub sports at UM are part of and, in part, funded by the Associated Students of the University of Montana Sports Club Union, which includes 12 teams: ACHA Griz Hockey, Griz Lacrosse, Griz Club Baseball, Griz Club Soccer, Griz Women’s Rugby Club, UM Smoke Jump (Men’s Ultimate Frisbee), Montana Pillowfight (Women’s Ultimate Frisbee), Woodsman Team, Grizzly Hurling, Griz Spikeball, UM Telemark Skiing Club and UM Rodeo.\nBoth ASUM and the Sports Club Union have several governing documents that teams must follow. The rules include having a team representative attend meetings at least once a month and submitting budgets by hard deadlines. Failure to do so can result in fines and teams being deprived of ASUM funding altogether.\nThe documents are also very specific about how money can be spent, which can make things particularly difficult for more niche sports like the UM Woodsman Team. Much of its equipment, like chainsaw oil, qualifies as “expendable goods” that cannot be reimbursed.\nAccording to Alex Kaper from the Woodsman Team, Paige Mickelson from Griz Club Soccer and Nance from Griz Club Baseball, the money is rarely enough for a season’s worth of travel and hotels. The woodsmen had to crowdfund the gas for one of its most recent trips to Idaho and camp outside in freezing temperatures.\n“It really does make things difficult — some of the restrictions on funding and just the lack of funding,” Kaper said. “On the flip side, I’m deeply appreciative of the fact that when I’ve gone to the Senate with requests for items that will increase our safety, items that will increase survivability, they have approved that without blinking an eye.”\nASUM’s funding comes from a $79 fee on every student’s semester registration bill — $59 of which goes into the Senate’s yearly budget, which sat at $1,065,750 in 2024. The remaining 20 dollars of the fee goes directly into the accounts of the Kaimin, KGBA, ASUM Child Care, and Experiential Learning Scholarships.\nFrom there, some money is put aside for an administrative fund and a $41,000 travel fund, which all ASUM-recognized clubs can pull from to pay for gas and other expenses. The remainder of the money is distributed to clubs requesting money. The Sports Club Union and Music Union request money as a whole rather than having each individual club under their umbrellas come forward with its budget. This year, the sports union received $41,366, $4,366 more than last fiscal year’s $37,000.\nThen, the Senate looks at the budget and distributes the remaining funds into the clubs or organizations that it feels would benefit from it most. The sports union isn’t eligible for any extra money ASUM distributes during the final budgeting of the Senate-wide pot.\nTeams have had to get creative with the way they divide up their funds. For example, Bonner Elementary School gave the baseball team free use of Kelly Pine Field. However, it’s up to the club to do all the groundwork and maintenance necessary to keep the facilities in shape.\n“Last year, when we were given [use of] it [for] the first time, I think we spent two weeks working on it,” Nance said. “We’ve had entire practices where the whole team walked around the infield and picked weeds out of the dirt. It’s been a lot of hours put in on our [end], but it’s been a very beneficial situation for the club.”\nThe sports union kept $1,166 of the $41,366 as a rainy day fund that clubs can pull from and had each team cast a vote on how to distribute the remaining cash.\nThe first option was a three-tiered system which divided the teams into groups based on their sizes and distributed the budget accordingly. A first-tier club like Griz Lacrosse might receive $5,000 a year while a smaller team like Spikeball might only receive $1,000.\nThis system was used as recently as two years ago, but $1,000 was simply not enough to build a traveling, competitive team. Instead, for the past two years, the union has voted for the other option and had its funding evenly distributed, with each team receiving $3,350 this year.\nFor some clubs like Griz Spikeball, this amount can largely cover all the team bases. But for others like Griz Lacrosse, the ASUM funding makes up less than 3 percent of its $160,000 annual budget. To keep up, the team’s members pay $3,000 a season just to join the team, and the rest of the difference is made up by donors. Baseball has a budget of around $20,000, paid for through $500 dues paid by each player and by team fundraising in addition to the ASUM money.\nIf this all sounds complicated, that’s because it is, but many club presidents have credited ASUM office manager Gwendolyn Coon with helping them figure out the rules and restrictions.\n“The baseball club would not exist without [Coon] and ASUM,” Nance said.\nASUM’s bylaws are intended to ensure the Senate’s money is spent responsibly, which, in practice, results in them being very specific about what funds are used from what accounts. Most clubs have an account for ASUM money and an account of money they raise themselves. Coon said the number one way to help teams is to have them understand ASUM policies. From there, she can reimburse them for more at a faster rate, or help them work out alternatives.\nNance is one of her frequent visitors. He spends about eight hours a week finding hotels, arranging practice times and working through the weeds of these policies. Coon enjoys helping club leaders like Nance out.\n“I get to work with the best and brightest students on campus,” Coon said. “It’s just really fun working with motivated individuals.”\nThe leadership carousel\nNavigating funding on top of practices and travel becomes even more complicated for club athletes with turnover in the union. The current leadership of the union consists of president Jacob Amend, treasurer Charles Nance and secretary Taylor Stark.\nUnion presidents are selected each semester. Amend, who is also the president of Griz Spikeball, entered his role in the spring of 2024 after the previous semester’s president left the University without notice.\n“We had a lot of changes in leadership,” Amend said. “There was a girl that came in, her name is [Mickelson], she was the — kind of the catalyst of actually structuring everything.”\nMickelson, the founder of Griz Club Soccer, served as the union’s president in the spring of 2023, and she still works extensively with the union in her current position as student group coordinator.\nBefore Coon and Mickelson came in, in 2019 and 2021, respectively, the union interpreted its bylaws to be more like by-suggestions, Coon said. Communication between the clubs was minimal. Information such as how to reserve a field, who oversaw what in a club and how to set up a season schedule were all lost in the jumble of leadership changes and lack of in-person communication during COVID-19.\nHockey club, which is completely separate from ACHA Griz Hockey, has had its share of struggles in that area. The club has a women’s and co-ed team that both play in the Glacier Ice Rink adult league.\nAfter hockey’s previous club president graduated without warning or parting words in 2019, Hunter Schmidt stepped into the role with no knowledge of how ASUM worked.\n“I basically just came to ASUM, and I was like, ‘Hey, I want to be part of the hockey club,’ and they [were] like, ‘Oh, it doesn’t exist anymore because [the former leadership] didn’t submit a budget, and they didn’t hand over any of the paperwork or anything like that,’” Schmidt said. “So I tried to build it from the ground up, basically.”\nSchmidt filled the president, treasurer and faculty adviser positions necessary to start a valid club and complete the ASUM paperwork. He even began recruiting for the club by bringing a hockey net out into the Oval and having people shoot pucks. Although there was a lot of interest and sign-ups for the club, only about 20% actually showed up.\nStill, the club gained some traction and managed to host a few events, even renting out the ice rink and bringing in a coach to teach new players. But in 2021, as a member of the Army National Guard, Schmidt was deployed.\nOther students and the club’s faculty adviser kept the club going until he returned for spring 2023. But this year, the membership has decreased to around 14 players. The only two officers, Schmidt and the treasurer, are in their senior years.\nPartially due to the scramble, the club missed budgetary meetings and did not receive any funding from ASUM this year, although they still actively play in the Glacier Ice Rink adult league and are open to new members. The club does have some money in its savings to hold it over until it can rejoin the union’s payroll next year.\n“I’m really trying to identify somebody who can step up to the plate and manage this club, because it’s really cool when it’s going,” Schmidt said.\nThere doesn’t appear to be a huge amount of interest in the position, however, as it requires a lot of energy to work with ASUM and Glacier Ice Rink that many students don’t want to stack on top of their studies, jobs and recreation.\n“There’s just a requirement of a pretty consistent investment of time and energy to keep it going,” Schmidt said.\nPractice times\nWhile club hockey has a consistent practice space in Glacier Ice Rink, most clubs are not so lucky. Teams often have to choose between practicing off campus at locations like Dornblaser Field or Fort Missoula in the afternoon, or on campus late at night or early in the morning.\nGriz Club Soccer usually practices in Washington-Grizzly Stadium from 8 p.m. to 9:30 p.m. or drives 15 minutes from campus to Kelly Pine Field in Bonner to use the outfield earlier in the afternoon.\nOn-campus fields like Washington-Grizzly Stadium are generally rented out to club teams at a reduced rate, but the practice times are limited. It’s not unusual to see a revolving door of clubs playing on the field from the early evening to past midnight. Missoula Parks & Recreation also has fields available, but club leaders like Mickelson have said that even with multiple voicemails and emails, they often take several days or weeks to respond.\nMissoula Parks and Recreation communications specialist Becky Goodrich told the Kaimin they aim to respond promptly to requests and haven’t had any complaints.\nThis issue is worsened by the construction of the University of Montana’s new indoor football practice facility, nicknamed ‘the dome,’ which was built over a field previously used by multiple club sports. The dome will offer some opportunities for club sports once completed, but for many teams, those opportunities will likely be outside their budgets.\nAccording to UM Athletics Director Kent Haslam, once finished, the dome will be open for campus recreation Monday through Thursday, from 8:30 to 11:30 p.m.. Outside of these times, the field will mainly be reserved for the football team, then for the track and field athletes, despite there not being a traditional track in the facility.\nClubs may be able to work with UM Athletics to schedule additional times. Otherwise, the field will also be available for rent after 11:30 p.m. all week. Prime-time slots for the full field are estimated to cost somewhere between $375 and $525 an hour, although the field may also be available to rent in three separate sections, and the hourly price will decrease during less-optimal times like later in the evening.\n“It sounds like they’ve already scheduled out days and times for all the teams, and then, you know, club sports is kind of like an afterthought ... I could not ask my team without pushback to practice from 11-12:30 at night,” Mickelson said. “Which is a little frustrating because, you know, we go to Gonzaga, we go to Bozeman, we go to [the] University of Idaho [in] Moscow, and they all have these dedicated turf fields that are used for their student recreation.”\nLacrosse coach and hockey general manager Tucker Sargent has floated the idea of creating a club sports facility, but nothing concrete exists yet.\nWhy play club sports?\nSo why even play, or be the president of a club team in the first place, if you have to deal with all of the above and more?\nIt’s because these students love the game they play and helping others play it.\n“It’s awesome to see guys get better. It’s really cool to see us grow as a club and be able to compete at a higher level,” Nance said. “From our beginning of 11 guys, to now over 30, we have the depth. We don’t need to have a guy stand on the mound and throw until his arm falls off.”\nEven after getting swept in a three-game series against WSU, the team currently has a 9-4 conference record and 12-8 total record. This season, it’s reached rankings as high as eighth out of over 100 teams in its league. It hasn’t been an easy path to get there, but with a successful record and McDowell reaching pro heights, both Nance and McDowell said overcoming the obstacles as club athletes at the University has been worth it.\n“There’s no free swag, you don’t get any cool perks,” Nance said. “You’re just a club baseball player, and you’re really playing just because you love to play, and that’s the reason why I’m still doing it. It’s the reason why a lot of our guys are still doing it.”",
  "word_count": 2836,
  "scraped_at": "2026-02-14T13:01:30.948044"
}