{
  "article_id": "f0c7cb81d7fe",
  "url": "https://www.businessoffashion.com/articles/beauty/athletes-beauty-influencers-partnerships-nba-nfl/",
  "title": "Why Athletes Are Beauty Real MVPs",
  "date": "20230612T051500Z",
  "domain": "businessoffashion.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Agenda-setting intelligence, analysis and advice for the global fashion community.\n“Beauty and haircare brands are really missing out by not working with college athletes because we’re the girls actually wearing the edge controls, the eyelashes,” said Angel Reese in a video on Twitter in early April, before rattling through a list of brands she wanted to work with that included Mielle Organics.\n“My hair lashes, nails, everything is always done … it’s about being able to be cute and still get buckets,” she said.\nAfter seeing the post, the textured hair care brand knew it would need to act fast to sign Reese. The college basketball star was propelled into the global spotlight that month after leading Louisiana State University to its first national championship, in what was the most watched NCAA women’s basketball game of all time.\nReese began the March Madness tournament with 447,000 followers on Instagram. Today, she has over 2 million followers on both TikTok and Instagram.\nADVERTISEMENT\nMielle Organics founder Monique Rodriguez and president Omar Goff saw a star in the making — and better yet, one who already used their products on and off-court. It took just over two weeks from initially making contact with Reese to her announcement as Mielle’s latest ambassador last month. As part of the deal, Reese is set to front the brand’s first ever commercial, appear at consumer-facing brand events and curate her own product bundles.\n“Beauty brands are so underrepresented in sports like basketball,” Goff told The Business of Beauty. “Mielle is laser-focused on Gen-Z consumers and wants to be the authority in textured hair — who better to represent us than someone who shows night-in night-out that being at the peak of your performance doesn’t need to come at the expense of looking good.”\nWorking with athletes isn’t a new phenomenon for beauty brands. But in the past, commercial deals were reserved for the highest-profile athletes like Serena Williams or confined to particular sports like tennis which were traditionally associated with feminine elegance.\nReese’s partnership with Mielle is one of a number of recent long-term tie-ups among athletes, teams and beauty companies that signal a growing overlap between sports and culture.\nRecord TV viewership and fan engagement for professional women’s basketball and football leagues has made not just athletes more marketable, but sports teams themselves. Il Makiage, for example, became the official beauty partner of leading British football club Arsenal Women FC, investing in a multiyear deal in November 2022 that was the first of its kind in women’s football in the UK.\nName, image and likeness (NIL) deals — a policy in place since late 2021 that allows US college athletes to monetise their profiles through commercial deals — has also opened up a whole market of untapped student athlete-influencers who amass millions of fans online before they’ve even finished college. In November, New York-based skincare brand Bubble tapped University of Texas track-and-field athlete-cum-content creator Sam Hurley to help launch its new overnight hydration mask in front of his 3.6 million followers on TikTok.\nMeanwhile, entrepreneurial athletes, who for many years have typically pursued fashion businesses in their spare time, are turning to beauty to launch their own brands. American-Japanese tennis champion Naomi Osaka and NBA legend Dwayne Wade are both building their own personal care brands — Kinlò and Proudly, respectively — with the backing of celebrity brand-building platform A-Frame.\nModern athletes are ideal beauty brand collaborators as opposed to influencers or straight-up content creators, according to sport and fashion journalist Lauren Cochrane.\nADVERTISEMENT\n“First of all, athlete-ambassadors are appealing because you have someone who is extremely gifted at something — and admired by millions of people for it — championing your product, which is very marketable,” she said. “Also, unlike musicians or other celebrities, younger athletes generally are more social media savvy and have better media training.”\nRedefining Beauty\nWhen Shai Eisenman launched Bubble in 2020, she wanted to stray from the traditional notion of feminine and flawless beauty. And athletes, she said, are the perfect ambassadors to counter the pixel-perfect image projected by the beauty industry. At launch, Bubble tapped US Olympic gymnast Laurie Hernandez, before working with several other high-profile US athletes in its three-year history.\n“In between shoots we’d catch her studying for her exams in the corner,” Eisenman said. “Someone who is so hard working, excelling in her field, this is exactly the sort of person we wanted to represent our brand.”\nWorking with athletes is also a core strategy at A-Frame, the celebrity brand builder founded in late 2021. In addition to Osaka, A-Frame’s Kinlò announced the signing of five US college athletes — including UCLA soccer player Reilyn Turner and University of Kentucky basketball’s Robert Dillingham — to front its “#GlowOutside” August 2022 suncare campaign to communicate the importance of SPF products.\nPutting the spotlight on Black athletes, meanwhile, enables brands to appeal to consumers who feel their skin tones are not prioritised by mainstream beauty companies noted Martin Ekechukwu, A-Frame chief strategy officer.\n“Simply put, working with athletes allows us to get to audiences that normally would not pay attention to us, who are otherwise inundated by countless other brands through digital marketing on various platforms,” said Ekechukwu.\nA New Marketing Funnel\nNew York-based beauty brand Il Makiage announced its partnership with Arsenal Women FC using large advertisements splashed across the side of London busses, carrying campaign slogans such as “Focus on my Game Face”. The timing of the partnership proved a masterstroke, as the team enjoyed record stadium attendance during the 2022-2023 season, most notably at a sellout Champions League game in May where 60,063 people were in attendance at London’s Emirates Stadium. All season, fans flocked to watch Arsenal’s England national team players who had won the European Championships in July.\nIl Makiage chief executive Dmitri Kaplun said the tie-up has opened the brand up to a huge audience of football-loving consumers. “People increasingly love to buy from brands aligned with their personal interests and we’ve even seen people discussing the partnership in dedicated football forums,” he said.\nADVERTISEMENT\nWorking with male athletes such as NFL stars Justin Jefferson and Melvin Gordon has also opened up Bubble’s audience. It has also seen a flurry of new customers that it would not have been able to access with billboards or social media ads alone, said Eisenman.\nLegacy brands are also taking to the trend. Estée Lauder-owned Jo Malone London has placed athletes at the centre of its strategy to scale its men’s fragrance business in North America. In July 2020, it tapped NBA rising star Shai Gilgeous-Alexander and NFL rookie Jackson Smith-Najiba for a campaign, which drove a significant uptick in traffic on the brand’s e-commerce site and generated $200,000 in earned media value, said senior vice president Kendal Ascher. The brand plans to expand its ambassador programme to include two NBA prospects from the upcoming draft later this month.\nEkechukwu of A-Frame said athletes make ideal partners for purpose-driven brands or campaigns, but consumers are smart enough to tell when a partnership is not genuine or organic.\n“With our brands, we’re always trying to solve a problem, and for each cause there will always be a person to attach to it,” he said. “I fully believe athletes are perfectly placed to be these people, but it has to be authentic.”",
  "word_count": 1225,
  "scraped_at": "2026-02-14T12:45:58.794146"
}