{
  "article_id": "f0c84a73a4ae",
  "url": "https://www.rnz.co.nz/news/sport/505822/all-sporting-roads-lead-to-paris-in-2024",
  "title": "All sporting roads lead to Paris in 2024",
  "date": "20231230T193000Z",
  "domain": "rnz.co.nz",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "All sporting roads lead to Paris next year with the first post-COVID Olympic Games looming large on the horizon but the two-week extravaganza will merely be the centrepiece for another 12 months of compelling theatre.\nFour continental football tournaments beginning with the Asian Cup in Qatar and Africa Cup of Nations in the Ivory Coast in January, will mean little respite for players and fans.\nGermany will stage the European Championship in June and July with the hosts running out of a time to put together a team capable of reviving past glories. At the same time, the Copa America takes place in the United States in what will be regarded as a rehearsal for the 2026 World Cup.\nSaudi Arabia will enhance its status as a global sporting hub in February when Oleksandr Usyk and Tyson Fury meet in Riyadh to decide the undisputed heavyweight boxing title -- a clash in which the hype will reach stratospheric proportions.\nAs further proof, if any were needed, of Gulf states' appetite for staging major events, swimmers and divers will get an early chance to put down markers for Paris when the Aquatics World Championships takes place in Qatar in February -- the first time it has been held in the region.\nAfter a miniscule break, the tennis season resumes days after Christmas and the Australian Open will welcome Spanish great Rafa Nadal who is returning to Grand Slam action in what will probably be his farewell year.\nNFL's Super Bowl will dominate the U.S. sporting narrative in the build-up to the February showpiece in Nevada and in Australia, 2024 kicks off in traditional fashion with a cricket test series against Pakistan.\nThe sporting conveyor belt, it seems, gets more and more loaded each year -- but once every four years everything, for a few weeks at least, bows before the Olympic Games.\nParis is, and will continue to be, dogged by the usual gripes about staging the greatest show on earth.\nTransport issues and security concerns are par for the course but organisers are also contending with an outbreak of bed bugs, pollution in the River Seine and a stink about Paris's traditional street booksellers being dispersed.\nBy the time thousands of sportsmen and women arrive in the French capital, however, the focus will likely switch to a return to near Olympic normality after the delayed and COVID-impacted Tokyo Games played out in deserted stadiums.\nMORE INCLUSIVE\nInternational Olympic Committee President Thomas Bach says Paris will be \"new era\" for the Games -- more inclusive and more sustainable than ever before.\nRussian and Belarusian athletes, competing as neutrals, will also be welcomed with open arms, according to Paris 2024 chief Tony Estanguet. His opinion, however, might not be shared by all.\nThe world's oldest sporting competition, the America's Cup, returns in October when Barcelona hosts the 37th edition of the sailing's blue riband event with New Zealand seeking to regain the Auld Mug.\nWhile great sporting sagas will unfold around the globe in 2024 with feats of human skill, endurance and athleticism, the narrative will have less edifying battles.\nThe European Court of Justice's ruling in December has raised the spectre of civil war in soccer with the proposed European Super League back on the agenda.\nGolf also appears at a crossroads with the Saudi Arabia-funded LIV Golf likely to continue to disrupt the status quo over the next 12 months with more top players defecting to the money-spinning tour.\nSport, increasingly, is ruthless business where money alone talks and the joy is ebbing away.\nThankfully, however, it can still be fun.\nNew Year's Day's sporting programme might not make the headlines but for those attending the Ponteland Wheelbarrow Race in Northumberland, competing in Polar Bear swims in icy Canadian lakes or leaping off Rome's Cavour Bridge for the annual Tuffo nel Tevere, it is still the taking part that counts.\n-Reuters",
  "word_count": 651,
  "scraped_at": "2026-02-14T12:30:19.955166"
}