{
  "article_id": "f0e273b9af4b",
  "url": "https://www.heraldscotland.com/news/23617710.scotlands-pedro-martinez-losa-meeting-craig-brown/",
  "title": "Scotland Pedro Martinez Losa on meeting with Craig Brown",
  "date": "20230627T223000Z",
  "domain": "heraldscotland.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "The death of former Scotland manager Craig Brown this week struck a chord with Pedro Martinez Losa, manager of the women’s national side.\nThe Spaniard crossed paths with the 82-year-old only once but was left in no doubt about the influence he exerted on the Scottish psyche. Indeed, Brown’s mantra of ‘playing the game properly and honestly’ is the philosophy that Martinez Losa would like to imprint on the women’s team.\n“I can see and feel obviously what he represents for Scottish football and for the national team,” he said. “ And even that sentence for me [playing the game with honesty] will become the mantra of my team.”\nMartinez Losa has so far failed to emulate Brown when it comes to leading out a team at a World Cup finals.\nScotland’s inability to qualify for this month’s FIFA Women’s World Cup will resonate across the coming weeks as the full realisation, financially and otherwise, will be appreciated by Martinez Losa’s squad. The fact the most commercially viable and lucrative women’s tournament was so firmly within their grasp before the Republic of Ireland nicked them to it will only compound their frustrations.\nIt is the second time they have to watch a major finals with their noses pressed against the glass - last summer’s Euros was a tough shift for players sharing dressing rooms with English colleagues - yet Martinez Losa is insistent that there remains a sense of camaraderie and cohesion within his squad.\nHe admitted that yesterday’s 22-player squad for the friendlies against Northern Ireland and Finland could well have run the risk of players wishing to pull out given that they come immediately prior to a return to domestic pre-season.\nREAD MORE: McCoist shares hilarious Craig Brown memory in touching tribute\n“Maybe in previous years we would have struggled to have all players available,” said Martinez Losa.\n“Now there is no question about that. They are on holiday but there is no question from them that there is a camp in the diary. That mental commitment from the players now has totally changed and I think they enjoy the atmosphere here. But we are here to perform which we won’t forget.”\nMartinez Losa has called 18-year-old Rangers midfielder Kirsty MacLean into his 22-man squad while there has also been a first call up for former England under-21 internationalist Amy Rodgers.\nMeanwhile, Sam Kerr has become the latest Scot to make the step into an elite league after she left Rangers for Bayern Munich last month.\nShe joins Real Madrid’s Caroline Weir and Chelsea’s Erin Cuthbert with Martinz Losa optimistic that Scotland can produce players capable of competing at the very top level. Furthermore, he is confident that representing the national team can afford players and clubs a different perspective as they look to perform at elite level.\n“It shows how much playing and training with us has benefited them,” he said.\n“Erin struggled at Chelsea in the beginning which is normal. She was playing as a wing-back or a winger but I had that conversation with her where I thought I saw her as a midfielder for this team and we moved her.\n“The last two years her performances for Chelsea have impressed and evolved.\n“Caroline was always exceptional but she is pushing to be world-class. She always wants more.\n“Honestly, if I was a Sporting Director for another club there would be three or four players here in Scotland that I would seriously be looking at.\n“If you ask me to drive a Ferrari at 200mph but I am used to driving my normal car, I will tell you that I will try but I am not sure what is going to happen.\n“But if I drive the Ferrari every single day then that is not a problem. Young players can definitely develop in Scotland.”\nMeanwhile, Martinez Losa is keen to cast his net wide as he looks to enhance the quality of the national team but he has warned that his first job is to ensure there is an authenticity from eligible prospective players.\nHe has revealed that there has been a lengthy list of players who have made their eligibility known to the SFA with his first task to sound out their exact reason for opting to represent Scotland.\n“Playing international football can be a type of branding for players,” he said.\n“The first thing I need to have is a strong feeling of wanting to play for Scotland. I don’t want to bring players here who do not really want to play for Scotland - you can tell after two or three conversations. “But we will continue to evaluate all routes to improve the team.”",
  "word_count": 782,
  "scraped_at": "2026-02-14T12:29:09.371576"
}