{
  "article_id": "f0e561d6cca9",
  "url": "https://thepeoplesperson.com/2024/04/13/marc-skinner-should-stay-at-manchester-united-for-both-his-and-the-clubs-sake-278680/",
  "title": "Marc Skinner should stay at Manchester United for both his and the club sake - Man United News And Transfer News",
  "date": "20240413T030000Z",
  "domain": "thepeoplesperson.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "As journalists, we’re used to being unpopular, and this is bound to upset a number of Manchester United fans but it makes sense for Marc Skinner to sign a new contract at Manchester United Women – for both parties.\nAs Manchester United, the club, enters a new era under INEOS, we’re already starting to see major changes taking shape behind the scenes. Football director, John Murtough, is departing at the end of the season as is director of women’s football, Polly Bancroft.\nSir Jim’s bread and butter at Manchester United is the men’s team, that’s his priority, it’s where the history and legacy of the club lies not to mention the money. He has met with fans of the women’s team and pledged his support to them but that will not be high on his list of things to do.\nIn some ways, he is inheriting two struggling football teams that both require an element of change but it is doubtful whether he can successfully change both drastically at the same time.\nErik ten Hag’s future has come into question a lot lately and whether he stays or goes it feels unimaginable that both teams could require a new manager at the end of the season. Stabilising the men’s team, getting the right structures in place for them first, needs to be the priority.\nFrom Skinner’s point of view, he has just become a father again so the job security that a new contract offer would bring seems a wise move for the 41 year old.\nIs he the long term solution for Manchester United women? Possibly, possibly not but he’s also not the problem. First we have to start with the question, did Manchester United women over-achieve last year or under-achieve this year?\nThe answer is, probably a bit of both.\nWhilst Arsenal were struggling with four ACL’s hampering their side’s chances last season and City were adapting to a lot of incomings and outgoings, Manchester United were flying high, going toe-to-toe with Chelsea.\nUnited were finding ways to win, not always convincingly. The team would nick a goal late on to take the points.\nThe incredible victory against Arsenal at the Emirates, coming from behind to win 3-2 in injury time, with a similar story against Aston Villa, meant euphoria for a fan but it also potentially clouded the fact that those games were pretty close and how it could so easily have tipped the other way if the footballing gods hadn’t been on United’s side.\nSkinner’s side pushed Chelsea all the way to the final day of the season and forced them to the highest-ever WSL points total to prevent the Reds winning their first top flight title. Meanwhile, in the FA Cup, United enjoyed their first trip to Wembley where they narrowly lost to Chelsea 0-1.\nThis year, United suffered plenty of injuries – Gabby George, Emma Watson, Hinata Miyazawa and in those finely-poised games, the footballing gods haven’t been smiling on them this time around.\nBrighton and Hove Albion away, United came back twice and in the dying moments of injury time, they had a corner that Williams headed goal-wards but it didn’t go in. It was so nearly another 3-2 thriller but instead, fans left feeling slightly frustrated with a draw.\nPerhaps it’s got nothing to do with the football gods and everything to do with opposition teams becoming wiser to the Reds’ injury-time antics, and being able to defend against them better. But the point is, performance-wise, United are not much different this year than they were last year.\nAt this point, it may be fair to ask, ‘Why haven’t we pushed on from last year? If teams have become wiser, why haven’t we adapted?’ It would be a valid enquiry and one I can only defend with, ‘It takes time’.\nThere has been a massive change in personnel, and United are feeling the loss of Ona Batlle and to a lesser extent Alessia Russo and although we invested well last summer, some of those new players are yet to adapt to our style of play and in some cases, to the language barrier.\nWe have seen the capabilities of players like Geyse and Miyazawa on the world stage and it’s only a matter of time before they start producing the goods week in, week out at United.\nAn issue affecting the club that has been raised time and time again is the inability to keep players, to negotiate contract extensions in time and get transfers over the line but that responsibility does not lie on Skinner’s shoulders.\nINEOS already seem to be addressing those issues as they appoint Matt Johnson to replace Polly Bancroft and have promised an audit of the women’s team structure.\nAs for the other issues that fans have raised around Skinner’s tenure, they are more complicated.\nThey need to be careful with some of their wilder accusations on social media; If you haven’t got solid evidence to back up your statements, that would stand up in a court of law, then don’t say them – you could literally be sued for defamation.\nWant to be the first to hear breaking Man United news? For carefully selected, crucial updates, join our WhatsApp channel: https://bit.ly/United-Breaking-News.",
  "word_count": 875,
  "scraped_at": "2026-02-14T12:22:38.183200"
}