{
  "article_id": "f0f156f7a7c3",
  "url": "https://allafrica.com/stories/202507290349.html",
  "title": "Nigeria / Morocco : Miracle of Rabat - How We Overcame Morocco - Super Falcons",
  "date": "20250729T131500Z",
  "domain": "allafrica.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Super Falcons coach, Justine Madugu may not be charismatic like other coaches. Still, he turned out to be the one who saw tomorrow with his predictions and analysis of the Super Falcons as they came back from the 'dead' to maul Morocco 3-2 to lift their 10th title of WAFCON.\nThe man who had been on the hot seat had displayed an uncommon faith in the players and in his strategy, despite the pressure; he continued to tell everybody to 'calm down'.\nMadugu revealed that self-belief and mental resilience were key to the historic win.\nKeep up with the latest headlines on WhatsApp | LinkedIn\n\"We knew we could do it. When we were two goals down, we kept encouraging the players not to lose their confidence. If they didn't have that mental resilience, they would have given up. We did a lot of talking at halftime,\" he said.\nThe coach further explained that their initial game plan backfired, leading to the early goals conceded, but swift tactical adjustments made the difference.\n\"We had a game plan, but what we wanted to avoid led to the two goals, so we had to make the necessary changes,\" Madugu added\nIrrespressible Esther Okoronkwo who made her debut in Morocco and became the livewire of the team with her menacing runs and distribution of the balls that caused panic at the opponent's backline, has hailed the resilience of the team.\n\"It's my first time with the team but we struck the right cord from the first training. The girls had confidence and insisted that they were going for the trophy. Even when we were down, we talked to ourselves and agreed to work for each other. Unity to be real must stand the severest strain without breaking. Truly, unity remained our strongest weapon and it paid off. I'm so happy. Credit must be given to our coach who treated us like his daughters and impacted on us\".\nAlozie Mitchell, the medical researcher who plays for the Houston Dash in the NWSL and accounted for Nigeria's winning goal against South Africa's Banyana Banyana in the semifinals said that the Nigerian never-say-die spirit propelled them to achieve what people consider as impossible. \"There's nothing that a Nigerian wants that he/she cannot achieve. It has been a positive force that drove us to achieving the ultimate.\nTinubu to receive victorious Super Falcons in Abuja today\nPresident Bola Tinubu will host the victorious Super Falcons and officials of the Nigerian female football team at the State House in Abuja on Monday.\nThe Super Falcons are expected to arrive Nigeria from Morocco later on Sunday night.\nIt is expected that the players and their officials would be rewarded handsomely by the President.\nTinubu, it would be recalled, approved the payment of the team's outstanding bonuses and allowances on the eve of the Saturday's final with hosts Atlas Lionesses of Morocco.\nThe Super Falcons rallied from two goals down to beat the North Africans 3-2 in the game.\nSoon after the team's historic feat in Morocco Saturday night, President Tinubu spent time speaking with the players via video call.\nDuring the chat, the President assured the Super Falcons of a befitting celebration upon their return from Morocco, where the team won the WAFCON title for a record-extending 10th time.\nHe told the players, \"As a team, we are very proud of you; the entire nation is proud of you. You lifted our spirits, and we are all very happy.\n\"You will be celebrated, and I congratulate all the coaches and the management of the team, including the ministers and officials.\n\"To set the record of victories for the 10th time is not a small feat for the country and the continent as a whole. Safe journey back home, enjoy yourselves and avoid injuries,\" Tinubu said.\nThe President hailed Rasheedat Ajibade, who emerged as the tournament's Most Valuable Player and clinched the Woman of the Tournament award.\nHe also praised Esther Okoronkwo's composure during a crucial moment in the final, describing her 64th-minute penalty kick, which sparked a dramatic comeback, as \"very courageous.\"\nOkoronkwo created the second goal and delivered the decisive free-kick that Jennifer Echegini converted to seal Nigeria's 3-2 victory.\n\"Safe journey home, enjoy yourselves, avoid injuries, God bless you,\" the President told the jubilant players and officials, who repeatedly interjected with \"Thank you, Mr President!\"\nIt could be recalled that President Tinubu rewarded the Super Eagles with national honours, cash and plots of land in Abuja when they earned a runners-up medal at the delayed 2023 Africa Cup of Nations in the Ivory Coast last year\nIt was the 10th time the Super Falcons have won the WAFCON title.\nSuper Falcons' triumph'll inspire Super Eagles -- Gusau\nPresident of the Nigeria Football Federation, NFF, Ibrahim Gusau has showered encomiums on the Super Falcons for their remarkable feat at the 2024 Women's Africa Cup of Nations.\nThe Super Falcons won the WAFCON title for the 10th time following a hard-earned 3-2 victory over Morocco in Rabat on Saturday night.\nJustine Madugu's side rallied from two goals down to win the thrilling contest.\nGusau saluted the determination, and fighting exhibited by the players.\n\"I am very happy because our girls rose from the 'dead', as they say, and fought to victory. This was an extraordinary performance. I congratulate them for their resilience.\"\nGusau added, \"This victory, and the spirit behind it, will have positive implications for the men in their 2026 FIFA World Cup qualifying series. We have four more matches to turn the table against our opponents, and watching the Super Falcons tonight, and how they turned things around, underscores again the wise saying that in sport and in life, it is never over until it is over.\"\nNigeria's chase of a 2026 FIFA World Cup finals ticket resumes in September, when they host the Amavubi of Rwanda before flying to South Africa to play the Bafana Bafana.\nWAFCON winner will stay in my heart forever --Echegini\nJennifer Echegini says her Women's Africa Cup of Nations-winning goal for Nigeria will remain a highlight to look back on for the rest of her career.\nThe 24-year-old midfielder swept home Esther Okoronkwo's free-kick in the 88th minute to complete a stunning second-half comeback as the Super Falcons beat hosts Morocco 3-2 on Saturday.\n\"I'm just going to carry this moment close to me,\" she told the BBC World Service.\n\"If I'm ever doubting myself as a player, I just think of this to encourage me and give me confidence.\n\"It's my first trophy I've ever won in my career, so definitely a memorable one that I'll keep in my heart forever.\"\nA record-extending 10th continental title for the West Africans had looked a distant dream at half time, as goals from Ghizlane Chebbak and Sanaa Mssoudy put Morocco 2-0 up at the Olympic Stadium in Rabat.\nBut Okoronkwo pulled a goal back from the penalty spot midway through the half and then laid on two more goals in a compelling team display of mental strength.\n\"We're 2-0 down in the final, it's half-time, you absolutely have nothing to lose,\" Echegini said.\n\"It's either you play with fear and you lose the game or you put everything into the game and you hope you win - and we did so.\"\nMy Story is incomplete without Demehin, Abiodun --Oshoala\nSuper Falcons striker Asisat Oshoala has disclosed that the duo of Oluwatosin Demehin and Deborah Abiodun have played some key roles in her football career.\nOshoala, who is expected to announce her retirement from football after the Super Falcons' stunning comeback against Morocco to lift the 10th Women's Africa Cup of Nations, stated via her Instagram handle that her Mission X won't be complete without Demehin and Abiodun.\n\"Love them scatter. Can't tell my Mission X story without these two [Oluwatosin Demehin and Deborah Abiodun],\" Oshoala posted on her Instagram story alongside the picture of Demehin and Abiodun.\nMorocco was up 2-0 until Esther Okoronkwo led Nigeria back with a penalty and two assists in the final half hour.\nThe continent's most successful national team kept intact its unbeaten record in the competition's finals with its comeback victory in Rabat.\n'Thrilling performance' --Ngozi Okonjo-Iweala\nThe Director-General of the World Trade Organization, WTO, Ngozi Okonjo-Iweala has reacted to Super Falcons' 2024 Women's Africa Cup of Nations, WAFCON, final win against Morocco on Saturday night.\nNigeria came from 2-0 down to beat Morocco 3-2 in the WAFCON final at the the Olympic Stadium in Rabat.\nGhizlane Chebbak and Sanaa Mssoudy gave the hosts nation a 2-0 first-half lead.\nBut the Super Falcons responded in the second-half, thanks to three goals from Esther Okoronkwo, Folashade Ijamilusi and Jennifer Echegini.\nThe victory against Morocco means, the Super Falcons has now clinched their 10th WAFCON title.\nReacting, Okonjo-Iweala wrote on X on Sunday: \"What a thrilling performance from our very own Super Falcons @NGSuper_Falcons in Morocco.\n\"Congratulations. You pulled it off. A super exciting match to watch. To God be the Glory!\"\nIt was all or nothing --Okoronkwo\nEsther Okoronkwo has reacted to Nigeria's 3-2 victory over the Atlas Lionesses of Morocco in the final of the 2024 Women's Africa Cup of Nations.\nOkoronkwo played a pivotal role in the stunning victory, scoring once and also providing two assists.\nThe AFC Toronto striker contributed two goals and four assists for the Super Falcons in the competition.\nIt was the first time she would be winning a major title with the Super Falcons.\nOkoronkwo expressed her joy at becoming an African champion.\nThe 27-year-old also praised the Moroccans for their spirited display.\n\"I am very happy to be a champion. The first-half goals were unfortunate. It happens in football. When we went to the locker room, we gathered the fighting spirit because it was all or nothing. The Moroccan team has chemistry, they were a tough team,\" she said after the game.\nWhat Nigerians are saying about Super Falcons' feat - Peter Obi\nA big congratulations to our outstanding Super Falcons of Nigeria for becoming the African Women's Football Champions and winning the 2025 WAFCON!\nI watched as our girls never gave up. Just as I said before the game, it was an exemplary display of the indomitable Naija spirit.\nThis is more than a win--you have shown true dominance in African football.\nFrom every Nigerian heart across the world, we say thank you for making us proud.\nToday, history bows to your greatness. Congratulations, Super Falcons. Mission X--done and dusted.\nA new Nigeria is POssible. -PO\nAkpabio\nCongratulations to the Super Falcons on their historic WAFCON 2025 victory! Your brilliance, resilience, and unity have lifted our spirits and inspired a nation. You've made Nigeria proud.\nTinubu\nThey chose to accept this mission.\nThey understood the assignment.\nOur Superior Super Falcons delivered in true Nigerian fashion. Never say Never.\nThey went. They saw. They have conquered again!\n10-time champions of Africa.\nMissionX: COMPLETE!\nI just spoke with our Super Falcons.\nOn behalf of all Nigerians--at home, in Morocco, and around the world--I told them how proud we are. They have lifted our spirits with their brilliance, resilience, and unity.\nWe are very, very happy. I look forward to welcoming them home soon.\nAtiku\nIt's an even more beautiful morning with the victory of our high-flying\n@NGSuper_Falcons\nin last night's WAFCON final. Their 10th Women's Africa Cup of Nations title came through a dramatic comeback, driven by the Nigerian spirit of never giving up.\nI congratulate the Super Falcons and join millions of Nigerians in celebrating this special victory. It is a perfect send-off for Asisat Oshoala, one of the greatest African female footballers of all time, as she retires from international football. -AA\nSanwo-Olu\nCongratulations to our incredible Super Falcons on their well-deserved WAFCON victory.\nThis win is a reminder of what can happen when talent, discipline, and belief come together. To the players, coaches, and everyone who worked behind the scenes, thank you for making the country proud once again.\nYou've shown the world the strength and spirit of Nigerian football, and I celebrate you wholeheartedly.\nA flawless 10 out of 10 performance. We are beyond proud.\nOluremi TInubu\nI celebrate you,our beautiful and lovely Super Falcons for the landmark victory of your 10th Women's Africa Cup of Nations championship.\nYour resounding 3-2 victory is indeed remarkable and commendable.\nIt is not just another trophy; it is a testament to your hard work, consistency, and the indomitable Nigerian spirit. We thank God for this sweet victory.\nYou have once again lifted the pride of our dear nation, Nigeria and cemented your place as Queens of African football.\nOn behalf of Nigerian women and the entire nation, I thank you for making us proud.\nYou have written your names in gold and inspired millions across the continent.\nCongratulations, Super Falcons!\nI celebrate you.\nNigeria celebrates you.\n~ Senator Oluremi Tinubu, CON\nFirst Lady of the Federal Republic of Nigeria\nHannatu Musawa\nVictory at last! Well done, Super Falcons!\nYou've not only lifted the trophy, but lifted the spirit of an entire nation.\nYou've made Nigerian women and Nigerians across the world incredibly proud..\n@DTIGRESS\nOne of the greatest comebacks in sports history. Not even the laser lights could stop the Super Falcons. Congratulations sister Queens.\nPDP\n2024 Women's Africa Cup of Nations (WAFCON).\nWe extend our heartfelt congratulation to Nigeria's Super Falcons for their triumphant victory at the 2024 Women's Africa Cup of Nations (WAFCON), securing a record-extending 10th continental title with a thrilling 3-2 comeback win over host nation Morocco last night, July 26, 2025.\nWe celebrate the Super Falcons' remarkable resilience, teamwork, and unyielding determination, which shone brightly in their dramatic second-half revival to clinch the title.\nThis victory reaffirms Nigeria's dominance in African women's football and serves as a powerful testament to the strength, talent, and spirit of Nigerian women.\nWe are immensely proud of our Super Falcons for this monumental achievement. Their extraordinary performance, overcoming a two-goal deficit against a formidable Moroccan side in front of a passionate home crowd, embodies the indomitable Nigerian spirit.\nThis triumph is not just a win on the pitch but an inspiration to millions of Nigerians, especially our young women, to pursue excellence with courage and unity.\nWe commend the players, coaching staff, and the Nigeria Football Federation (NFF) for their dedication and strategic brilliance. We also commend the standout performances from stars like Rasheedat Ajibade, Michelle Alozie, and Esther Okoronkwo, among others, which underscored the team's depth and commitment to excellence.\nOnce again, congratulations.\nRabiu KwanKwaso Congratulations, our dear Super Falcons. Mission accomplished.\nKatsina Governor Dikko Radda\nKatsina State Governor, Dikko Radda, has congratulated the Super Falcons on their historic triumph at the 2024 Women's Africa Cup of Nations, where they clinched the title for a record 10th time after an impressive comeback win against Morocco.\nThis is contained in a statement by the Chief Press Secretary to the Governor, Ibrahim Mohammed, and made available to newsmen yesterday.\nRadda described the Falcons' victory as a proud moment for every Nigerian and a true reflection of the strength, determination, and resilience of Nigerian women in sports.\n\"This win means more than just a trophy. The Super Falcons showed the kind of courage and commitment that define the true Nigerian spirit.\n\"Coming from behind to defeat a tough Moroccan side in front of their home crowd shows what's possible when talent meets hard work and unity,\" the governor said.\nHe further hailed the team's success as inspirational, not only to aspiring female athletes across the country but to all Nigerians.\nRadda also commended the coaching crew, the Nigeria Football Federation, and all supporters of the team for standing firmly behind the players throughout the tournament.\nDeputy Senate President Barau\nThe Deputy President of the Senate, Senator Barau Jibrin, has lauded Nigeria's Super Falcons after their dramatic 3-2 victory over Morocco's Atlas Lionesses in the final of the 13th CAF Women's African Cup of Nations on Saturday.\nBarau disclosed this in a congratulatory message issued by his Media Adviser, Ismail Mudashir, yesterday.\nThe Super Falcons overcame a spirited Moroccan side at the Rabat Olympic Stadium to secure Nigeria's 10th WAFCON crown--extending the nation's status as the most successful side in the competition's history.\nThe Kano politician describes the team's performance in Rabat as \"a testament to their resilience, talent and unyielding national spirit.\"\n\"I congratulate the Super Falcons and indeed all Nigerians on our team's historic victory at the 2025 Confederation of African Football Women's African Cup of Nations tournament.\n\"This victory is a testament to our players' resilience, talent and unyielding national spirit. This is a moment of immense pride and celebration for our nation,\" Barau said.\nSpeaker Abbas\nSpeaker of the House of Representatives, Tajudeen Abbas, also congratulated the Falcons, describing the feat as well-deserved.\nIn a congratulatory message issued yesterday by his Special Adviser on Media and Publicity, Musa Krishi, the Speaker said, \"The victory was not only well-deserved but also came as a relief to Nigerians as a football-loving nation.\"\nHe described the WAFCON trophy as \"A symbol of patriotism, hard work, and tenacity.\"\nAbbas called on the Nigerian government to appreciate the team, even as he urged Nigerian athletes to continue to be loyal to their country.\nWhile restating his commitment to helping revive Nigeria's sporting sector, Speaker Abbas noted that the country has many talents at the grassroots who are waiting to be discovered.\nHe therefore called for the revival of inter-house and inter-school sporting competitions, stressing the need for the government to embark on a \"catch-them-young\" campaign.",
  "word_count": 2933,
  "scraped_at": "2026-02-14T13:44:27.548242"
}