{
  "article_id": "f113fdcdcf97",
  "url": "https://dailytrojan.com/2025/02/11/2025-usg-senatorial-forum-live-updates/",
  "title": "2025 USG presidential / vice presidential debate as it happened",
  "date": "20250212T071500Z",
  "domain": "dailytrojan.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "📌 PINNED | Last update: Feb. 11, 2024 10:28 p.m.\nSean Campbell, Nicholas Corral & Asiana Guang; photos by Henry Kofman\nThe presidential/vice presidential debate is now over.\nCandidates discussed USG culture, free speech, political polarization, campus perimeters and each ticket’s big promises. The voting period will begin at 10 a.m. on Feb. 18 and close Feb. 21 at 11:59 p.m. Preliminary results will be announced at the Feb. 25 senate meeting.\nPresidential/vice presidential candidates are as follows:\n- Heydy Vasquez and Elija Barnes\n- John Breitfelder and Guinevere (Gwen) O’Beacain\n- Ali Bhatti and Chichi Makasi\n- Mikaela Bautista and Emma Fallon\nSenatorial candidates are as follows:\n- Jeremiah Boisrond\n- Mason Yonover\n- Jad Kilani and Zehran Muqtadir\n- Moy Valdez\n- Sudeepta Murthy\n- Justin Shih and Karim Debian\n- Dakota Driemeyer\n- Andrew Cardenas\n- Kian Salek and Sabeeh Mirza\n- Kevin Hoang\nJust a note of transparency: Some of the candidates who are participating in the forum and debates tonight have affiliations, or were previously affiliated, with the Daily Trojan. Andrew Cardenas is an assistant editor for Sports, Dakota Driemeyer was previously a staffer for The Soapbox and Heydy Vasquez was previously a columnist for Opinion. Last but not least, our Editor in Chief Stefano Fendrich will be among the moderators tonight. Neither Cardenas nor Fendrich are involved in our coverage of the debates; Driemeyer and Vasquez are no longer affiliated with this paper.\n10:28 p.m.\nThe debate has concluded. Candidates tonight focused heavily on touting their proposals with minimal focus on attacking the other proposals.\nBhatti and Makasi repeatedly stated their platform’s focus on implementing surveys and questionnaires to increase collaboration between the student body and USG. They said they hope to actively reach out to recognized student organizations and students directly to hear their perspectives.\nBarnes and Vasquez said the presidential and vice presidential roles are administrative rather than project-based and focused on “achievable” goals. They mentioned their previous experience as a senator and speaker of the senate, respectively, as a reason to elect them.\nBautista and Fallon spoke about continuing dialogue on issues important to the student body so students don’t feel “angry and unheard.” They likewise pointed to their experience in the USG.\nBreitfelder and O’Beacain repeatedly described themselves as “scrappy” and focused on their goal of reforming USG as “outsiders” to the organization. They focused on policies relating to food, including bringing In-N-Out to campus for finals week.\n9:58 p.m.\nVice president Dane Sprague ended audience questions by asking the tickets’ vice presidents how they can show they have the administrative skill to lead as well as to name a favorite project done by a committee.\nMakasi said her experience as a president of Alpha Phi, a Panhellenic sorority, qualifies her to be vice president.\nBarnes said his time as speaker of the senate has allowed him to work closely with the vice president.\nO’Beacain said the shuttle from Los Angeles International Airport to USC after winter break was a project she has heard helped students. She also mentioned leadership roles in multiple clubs.\nFallon said she “fell in love” with the legislative branch as a general member of the affordability and basic needs committee. She said she has worked with all of the standing committees in her time at USG.\n9:58 p.m.\nChief programming officer Hunter Black asked Bhatti and Makasi how they hope to incentivize programming.\nBhatti said he hopes to raise awareness about what programming assemblies do by going directly to RSOs.\n9:58 p.m.\nAn audience member asked Breitfelder and O’Beacain about how they want to tackle bureaucracy in USG.\nO’Beacain said there is a lack of communication from USG to the student body which leads to a lack of trust in the organization. She said she hopes to make USG more project based to help with that.\n9:54 p.m.\nAn audience member asked Breitfelder and O’Beacain to elaborate on how EBT implementation should work, specifically at Tutor Campus Center.\nO’Beacain said they want to make EBT accepted at TCC and can implement additional food options that qualify for EBT if hot and pre-made options do not qualify.\n9:54 p.m.\nAn audience member asked Breitfelder and O’Beacain how they hope to support undocumented students when they had previously mentioned an initiative that has already been implemented.\nO’Beacain said undocumented students should be aware of their rights and it is a good thing if multiple tickets have similar goals.\nAn audience member asked Breitfelder and O’Beacain whether bringing In-N-Out during finals week really aligns with their healthy food initiatives as well as their push to eliminate seed oils, which the fries are cooked in.\nO’Beacain claimed fries are not carried in the food truck that they propose to bring. The Daily Trojan could not immediately confirm this.\n9:47 p.m.\nSenatorial candidate Driemeyer asked how candidates will ensure Zionist and conservative individuals are comfortable on campus.\nVasquez said USG represents all of USC’s students and hopes to connect all voices with administration.\nMakasi said their platform is focused on getting direct feedback from students and hopes to give that to all groups. Bhatti said he hopes to go directly to clubs rather than making them fill out forms for USG to hear their voices.\nBautista said their ticket is willing to engage with all students and hopes to take an “active role” in listening to all students and hearing their voices.\nO’Beacain said their campaign believes in diversity, equity, inclusion and belonging and bringing in that final component.\n9:47 p.m.\nAn audience member asked Bhatti and Makasi about the judicial council opinion related to their campaign.\nBhatti said they received only a warning related to his search for a replacement running mate.\n9:44 p.m.\nSenator Patrick Nguyen asked candidates how they will equip individuals within their administration to deal with setbacks.\nBreitfelder said his ability to shift his WAYMO project from a replacement for the free-Lyft program into a separate initiative shows his ability to adapt to roadblocks.\nBarnes said they would make sure that every person within USG knows that going into administration, data is the number one thing to have in order to prove one’s point.\nBhatti said coming into USG he had big ideas but he had to adjust his approach on his Raising Cane’s project to include Shake Shack because the University requested a burger restaurant.\nFallon said she wants to empower USG staff in spite of the organization getting told “no” a lot. She said it is important to communicate with other USG members on what the administration is telling them.\n9:39 p.m.\nCurrent USG president, Brianna Sánchez, asked candidates who are current senators how they have used their position to make tangible change at USC.\nBautista said she has done a variety of wellness-based projects including Sex Week and free menstrual care in bathrooms.\nBreitfelder said he felt “called to” run for senate due to USG not acknowledging certain students’ perspectives. He said he ran a “streamlined” campaign and has focused on WAYMO and pickleball courts.\nVasquez said she has gathered funding for the Buddhist shrine room on campus.\nBarnes cited his work to aid RSOs in Fall 2024 and work on the college essentials program to give resources to students.\nBhatti said he is currently in the process of making Raising Cane’s an approved vendor at USC — one of his major campaign goals. He also mentioned his work, alongside Breitfelder, on establishing pickleball courts on campus.\n9:33 p.m.\nModerators have now opened the floor for audience questions.\n9:32 p.m.\nVasquez asked Breitfelder and O’Beacain how they will ensure transparency after a recent judicial council opinion found them guilty of violating the election code and received multiple sanctions.\nO’Beacain said they acknowledged what they did was wrong and came forward with their violation as soon as they realized. Breitfelder said they were treated very fairly by the judicial branch.\n9:31 p.m.\nO’Beacain asked Vasquez and Barnes what projects they have done in their time at USG as a ticket with significant experience in USG.\nVasquez pointed to her work to incorporate the Undocumented Trojan Success Assembly and with funding a Buddhist shrine at the University Religious Center. Barnes said he was one of the only senators to help students and faculty register RSOs in the USG office. He said he also helped restructure the involvement fair after it was delayed in the fall.\n9:31 p.m.\nBautista asked Bhatti and Makasi how their experience in a variety of RSOs have prepared them to succeed in USG.\nBhatti said being in a consulting club, Model United Nations and a fraternity has taught him how to manage multiple projects and enhance his professional capabilities.\n9:30 p.m.\nBhatti asked O’Beacain and Breitfelder about their focus on removing seed oils from the dining halls as part of their platform.\nO’Beacain said they hope to give students the ability to advocate for what they want to see in dining halls. Breitfelder said many students have concerns about dining halls and they want to “make our dining halls great.”\n9:30 p.m.\nTickets were given the opportunity to ask one another about their platforms.\n9:29 p.m.\nBautista and Fallon were asked whether their approach to the RSO registration process excluding a USG role is fair.\nBautista said after talking to president Sánchez, the current USG administration has been having conversations with Campus Activities to make sure issues don’t happen again. Trusting that, Fallon said their goal is to make sure RSOs are able to access resources and said they will implement a workshop where USG officers walk RSO officers through how to register step by step.\n9:29 p.m.\nBhatti and Makasi were asked how they hope to secure funding for RSOs\nBhatti claimed that USC recently reported having one of the best fundraising years in history, yet there have been budget cuts. The Daily Trojan could not immediately confirm this.\nMakasi said, as someone who runs an RSO, they hope to streamline the process to start an RSO and make sure RSOs are able to access resources currently meant to support them.\n9:24 p.m.\nBreitfelder and O’Beacain were asked about a lack of information about RSO’s in their platform.\nO’Beacain said they want to make it easier for RSO’s to obtain planning and funding for the events.\n9:24 p.m.\nBarnes and Vazquez were asked about how they plan to advocate for diversity, equity and inclusion policies and programming in the face of political division on the topic on campus and nationwide.\nVasquez said she hopes to make USG and their potential executive cabinet a representation of the student body during her administration and work alongside the chief diversity officer and chief programming officer to do so.\n9:23 p.m.\nBautista and Fallon were questioned about professors’ expressed concerns over the availability of Chat GPT Plus leading to academic dishonesty.\nFallon said she hopes to implement Chat GPT in the classroom alongside a clear set of “dos and don’ts.” She said AI use is “inevitable” in classes and hoped to encourage responsible use.\n9:23 p.m.\nMakasi and Bhatti were asked about how their laundry stipend proposal differs from that introduced by former speaker of the senate, Diana Carpio.\nBhatti said they want to make sure the existing policy is expanded upon during their term as president and vice president.\n9:22 p.m.\nBreitfelder and O’Beacain were asked about how they plan to reinstate the Daily Trojan’s funding while still implementing their other projects like Linkedin Premium and In-N-Out during finals week.\nO’Beacain said she hopes to increase the programming fee by $1 to $2 per person to reinstate the DT’s five-day-per-week print. Breitfelder called it “an absolute scam” that DT cannot print every weekday and said they will be “scrappy” with other projects to focus on the DT project.\n9:20 p.m.\nVasquez and Barnes were asked about specific initiatives they will implement.\nVasquez said the presidential and vice presidential roles are administrative and not project based. She said she hopes to focus on implementable things, rather than projects that last multiple years. Barnes said they are hoping to work on extending library hours during finals week and expanding on a solar panel bench project.\n9:20 p.m.\nFallon and Bautista were asked about how they would go about implementing digital ID cards given it was already in progress under the previous Divya Jakatdar and Michelle Lu administration.\n9:19 p.m.\nBhatti and Makasi were asked about the alignment within their ticket after sanctions from the judicial council and the decision by Luo to step aside.\nBhatti said the sanction their campaign received was a warning because the judicial council did not offer a way they could have avoided the violation. Makasi said she was more than willing to join Bhatti’s campaign because she agreed with his campaign and wanted to promote student voices, since she felt she was not heard as a freshman international student.\n9:19 p.m.\nBreitfelder and O’Beacain were asked how they would work to have EBT to be accepted at Seeds Marketplace and Tutor Campus Center.\nBreitfelder pointed to their other plans related to food access including In-N-Out and reducing seed oils. He said that if Seeds was not viable, they would instead work to get EBT access at Trader Joe’s at USC Village.\nClarification: The Trader Joe’s at USC Village already accepts EBT.\n9:19 p.m.\nModerators are asking each ticket specific questions about their platform.\n9:11 p.m.\nMultiple tickets responded to Barnes’ claim about a lack of USG experience.\nBhatti said he and Makasi have a campaign with the most detailed platform.\nBreitfelder said he and Bhatti have had the same experience on USG as Barnes.\nO’Beacain said the claim promotes “exclusivity” and Breitfelder said the lack of experience is good because the organization “needs change.”\n9:11 p.m.\nCandidates were asked who they would vote for if not themselves.\nBhatti said they would vote for Bautista and Fallon because the other candidates are “not what the culture of USG needs” and support initiatives that they want rather than what students want.\nVasquez and Barnes said they would vote for Bautista and Fallon because they felt the other tickets did not have the experience to work as president and vice president.\nFallon said they would vote for Barnes and Vasquez due to experience working with them in USG.\nO’Beacain said she would support Bautista and Fallon because they were welcoming to her when she began running as an outsider. Breitfelder said he would also support Bautista and Fallon because they have strong experiences in USG.\n9:02 p.m.\nCandidates were asked what they think the priority of the next USC president should be.\nBreitfelder said the next USC president has an amazing background as a general counsel and his goal would be continuity and keeping things the same.\nVasquez said she hopes the next president continues sustainability initiatives and listens to students.\nBhatti said there is a “general disregard” for student opinions at USC and said they hope the next University president listens to students. Makasi said the next president should be more transparent in where tuition is going.\nFallon said there is a large disconnect between students and administration and hopes students can collaborate more with the new interim president.\n9:02 p.m.\nCandidates were asked to provide constructive feedback on the proposals of another ticket.\nBautista said they want to talk about Bhatti and Makasi’s proposal to bring Chat GPT Edu to USC. She said she wants to bring Chat GPT Plus instead which she said is more similar to what students will be using in the workplace\nBreitfelder and O’Beacain pointed to existing subscriptions available to USC students in answer to both Chat GPT proposals as well as the high environmental impact of AI.\nVasquez said the presidential and vice presidential role is administrative based rather than project based and said the other tickets “should reflect that.”\nBhatti said Breitfelder and O’Beacain’s goal of implementing CalFresh at Ronald Tutor Campus Center restaurants is impossible because he claimed, as someone who uses EBT, you cannot get hot, ready made food from restaurants with those funds.\n8:55 p.m.\nThe candidates are now competing in a rapid-fire trivia round where they must answer questions about USG’s internal operations.\nQuestions include how much USG’s budget is, what the three branches of USG are and what the legislative process is to pass a bill.\n8:53 p.m.\nCandidates were challenged to describe the finances of their most ambitious platform proposals.\nBreitfelder said his FLEA project does not need funding, making it attainable. He also mentioned his experience working on a WAYMO project as a senator and both of their experience as “scrappy” entrepreneurs as reasons why they are capable of doing so.\nBarnes said reallocating funds to projects like funding for RSOs — which he said is almost exhausted currently — is a way to make change without an increase in the budget. He said they hope to utilize rollover funds into their spending proposal.\nBhatti said he wants to get more financial transparency from the University and said many of their projects, including cleaning bathrooms at libraries, should already be funded by the University. Makasi focused on the laundry stipend proposal from their campaign.\nBautista said she wants to create an opt-in system similar to New York Times subscription for ChatGPT plus to reduce excess costs. Fallon said her experience as a member serving on the Board of Trustees meant she understood the challenges to implement the Chat GPT idea.\n8:50 p.m.\nCandidates were asked whether they supported gates around University Park Campus. Tickets who did not support the gates were asked how they would work to remove the gates.\nBhatti said they want to remove the internal gates near Doheny which he said are “redundant” and said the University should provide data to clarify the point of them. He said they want to continue evaluating the student ID system to see if it is an effective way to spend University money. Makasi said, using questionnaires and surveys, they will see if students actually feel safer with the gates.\nBautista said they want to continue conversations and projects that began this year to remove the campus gates. Fallon said on their end they want to be more assertive with USC administration.\nBreitfelder said realistically with an interim University president they find it unlikely that he’ll remove the external gates. O’Beacain said she feels “very safe” on campus and believes the gates have made campus more safe compared to when she lived on campus last year.\nVasquez said, as a member of the external affairs committee, she wants to balance the student desire to remove the barriers with student safety, and wants to continue conversations with administration and DPS to find that.\n8:37 p.m.\nCandidates were asked about supporting undocumented students and international students amid executive orders from the Trump administration.\nVasquez, as the former advocacy liaison for the Undocumented Trojan Success Assembly — then IDEAS — said the issue is very important to her. Vasquez said she wants to more clearly communicate messages from the University to UTSA and help students understand what it means to be undocumented as a student.\nBhatti said their campaign was directly affected by the political climate due to his former vice presidential running mate, parliamentary secretary Luisa Luo, dropping out of the race due to complications from being an international student. Makasi said she wants to make sure students know they are supported by USG and understand their rights.\nBautista and Fallon said they wanted to uplift student organizations working with these student groups and their resources. They also said as an administration they would want to open space for conversations.\nBreitfelder said they understand it is a “scary” time for people being affected by Trump Administration orders. They said the key is to listen to students’ voices through their proposed workshops and work closely with UTSA and the International Student Assembly. O’Beacain said she wants to hold workshops for students so they can help to understand their rights and utilize the resources available from USG and USC.\n8:37 p.m.\nCandidates were next asked about free speech on campus.\nBreitfelder and O’Beacain said everyone should feel able to express their opinion on campus, which he said is not supported enough by USG or USC.\n“Gwen and I have suffered deep and strong conviction that every single person deserves to sit at the table,” Breitfelder said.\nBarnes wants to make sure that students feel safe expressing their opinions, They want to make sure that they are actively communicating that to the USC administration. Vasquez said she hopes to make protesting rules clear and accessible on campus.\nBhatti said he felt because of the recent protests, free speech is stifled on campus. Makasi specifically said they would use roundtables to bring student voices to the Department of Public Safety.\nBautista said in the past students felt “angry and unheard” so they want to make sure when these situations come up they have an open line of communication set up. Fallon said USG can provide spaces for productive and meaningful dialogue.\n8:35 p.m.\nChief justice Andryan asked what steps candidates would take to improve internal culture of USG given resignations in the past year.\nBautista and Fallon said they wanted to focus on promoting inclusivity and cross-departmental communication inside of USG. Fallon said they met through USG and have a genuine friendship, which they hope to see replicated in other members.\nBhatti said it can be hard to get to know people within the organization when he joined and would like to see more internal socializing. Makasi said she wanted to use more surveys and questionnaires and outreach to learn about student wants.\nBarnes and Vasquez want to emphasize belonging inside of USG, which they said starts with the president and vice president.\nBreitfelder and O’Beacain said they want every single member of USG to think about what they can do for students big and small. O’Beacain said her biggest problem was not knowing what was going on with USG, so she proposed open forums outside of senate for students to interact with USG directly.\n8:28 p.m.\nCandidates gave their opening statements:\nBautista and Fallon said student government shouldn’t be about making promises but “seeing them through.” Bautista and Fallon mentioned their previous roles in USG, as a senator and committee chair respectively, as reasons why they are qualified for president and vice president respectively.\nBhatti and Makasi said their platform was focused on amplifying the voices of students. They mentioned student influence on concerts and removing fences around Alumni Park.\nBarnes and Vasquez said they are hoping to propose “feasible” initiatives that have a direct impact on students. They mentioned support for recognized student organizations, sustainability, and health and wellness as three of the “pillars” of their campaign.\nBreitfelder and O’Beacain said USG has been held back by bureaucracy “for years.” They mentioned a digital marketplace, FLEA, a student-run digital marketplace for students. Food and future — including In-N-Out during finals week — rounded out their priorities.\n8:20 p.m.\nThe Presidential Debate begins.\nThe debate will begin with one-minute opening statements for all four tickets, followed by general questions for each ticket to answer in 45 seconds, with the final question given one minute.\nTopics for the questions will include USG culture, free speech, political polarization, campus perimeters and each ticket’s big promises.\nA 10-minute section will follow where candidates will answer rapid-fire questions about USG to assess their knowledge of the organization.\nThen, moderators will ask platform-specific questions for 25 minutes before the audience will ask questions for 15 to 20 minutes. Current president Brianna Sánchez and vice president Dane Sprague will close and open the audience section, respectively. Finally, each ticket will make one-minute closing statements.\n8:14 p.m.\nThe Senatorial Forum is over.\nIncreasing transparency from USG to the student body was a common theme among candidates. Multiple candidates mentioned increasing financial initiatives related to textbooks and food. Programming and other University prices were also mentioned by multiple candidates.\nCandidates also emphasized what made them unique as candidates: being transfer students, being the only woman in the race or being Greek Life affiliated.\n(Henry Kofman / Daily Trojan)\n8:10 p.m.\nKian Salek and Sabeeh Mirza presented their platform SPARK — solutions, progress, advocacy, reform and knowledge. They mentioned a club subsidy program and a consolidation of clubs on EngageSC as priorities.\nMirza said they want to make the student programming fee more transparent and provide funding for campus media.\nSalek said as a member of Sigma Alpha Nu, a fraternity he can bring a different perspective to the organization.\n8:02 p.m.\nAndrew Cardenas described his campaign with the acronym VISION. He presented on visibility, identity and support before reaching the time limit for his presentation.\nCardenas said he wants to create websites in non-English languages, including Spanish and Mandarin, in order to make campus more accessible for international students. He said this initiative was important to him as a neuroscience major and as someone who translates for doctors who don’t understand Spanish.\n7:54 p.m.\nDakota Driemeyer pledged to not take a stipend if elected and encouraged other officers to do the same. He said working on projects to help students should be the incentive to join USG, not the stipend.\nDriemeyer said he is concerned about where USG gets the money to fund its projects, because much of the budget is used by continuing expenses.\nHe presented a textbook affordability pact to alleviate textbook prices and a dining dollar reform to allow students to roll over unused dining dollars from semester to semester.\n7:50 p.m.\nKevin Hoang could not present at the senatorial forum because of a family emergency, said a friend of Hoang.\nIn a statement Hoang proposed a financial aid liaison within USG, a campus wide networking event and free, peer-led workouts.\nHoang proposed bringing Kentucky Fried Chicken to campus in order to have “cheap and accessible” food.\n7:46 p.m.\nSudeepta Murthy said she was working for increasing hours for campus libraries and at the Tutor Campus Center. She also argued for a subsidy to fund costs of late-night food delivery.\n“Internally, I want to work on increasing diversity and perspective with USG,” Murthy said.\nMurthy said she is the only woman running for senate, setting her apart from the other candidates. The USG website does not currently list any other women as candidates for senate.\n7:39 p.m.\nMoy Valdez, who described himself as the outsider candidate for senate, said he plans to implement an open door policy for USG, a gender-equity center and a grant tied to voting in USG elections.\nValdez is a transfer student and he said this is his first semester here.\n7:37 p.m.\nJad Kilani, a freshman majoring in political science said he wanted to increase transparency from USG to the student body. Among his planned projects, Kilani listed reopening the campus volunteer center, implementing EpiPens in dining halls and reducing wait times for financial aid.\nKilani is running alongside Zehran Muqtadir, who was not present at the forum because he is studying at the Capital Campus.\nKilani emphasized his perspective as an underclassman if elected to the senate. He did not express support for overhauling the election system but said he would look into possible reforms to increase underclassman representation.\n7:32 p.m.\nJeremiah Boisrond presented his ideas on improving students’ access to campus, budget-friendly meal plans, affordable textbooks, transparency on student fees and his food after hours project.\nBoisrond is one of two current USG senators seeking reelection.\n“And then my favorite project, honestly, has been food after hours,” Boisrond said.\n7:32 p.m.\nMason Yonover, speaking over a video of football players, said students could smoke cigarettes on campus. He was briefly reprimanded by Chief Justice Susanna Andryan for profanity.\nHe also spoke about the Shoah Foundation promoting awareness of the Holocaust and interrupted himself for a brief land acknowledgement. He also mentioned turning sorority houses into houses for the homeless.\n7:32 p.m.\nJustin Shih and Karim Debian presented first, expressing their support for dining hall upgrades and increasing CalFresh access among vendors and with workshops. They also said they wanted to see increased support for transfer students and more school spirit. Debian is himself a transfer student.\n“We’re one of the Big 10 schools, but let’s be honest, our spirit doesn’t really show that,” Debian said.",
  "word_count": 4735,
  "scraped_at": "2026-02-14T13:19:26.277172"
}