{
  "article_id": "f169ac570576",
  "url": "https://metro.co.uk/2025/06/03/karen-carney-says-england-star-will-be-disappointed-after-defeat-to-spain-23322585/",
  "title": "Karen Carney says England star will be  disappointed  after defeat to Spain",
  "date": "20250603T200000Z",
  "domain": "metro.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Karen Carney says Hannah Hampton will be ‘disappointed’ not to have stopped the first of Claudia Pina’s two goals after Spain came from behind to beat England to a place in the Nations League semi-finals.\nAlessia Russo opened the scoring with a composed strike past Cata Coll to give England the lead midway through the first half at Espanyol’s RCDE Stadium.\nBut Pina dragged Spain back into the contest just moments after coming on in place of Salma Paralluelo, finding the corner from a tight angle on the hour-mark.\nWith 20 minutes remaining of the clash, an inspired Pina cut inside Missy Bo Kearns and struck a sumptuous effort beyond Hampton to make it 2-1 and complete the comeback.\nThe world champions preserved their narrow advantage in Barcelona to advance through to the semi-finals as group winners, with Sarina Wiegman’s side left to lick their wounds just a month out from the Women’s Euros.\nWatching back Pina’s leveller in the ITV studio, Carney criticised both Kearns and Jess Carter, before pointing the finger at England goalkeeper Hampton.\n‘She [Pina] has been on fire all season for Barcelona and I think she’s more influential for them when she comes off the bench,’ ex-England, Arsenal and Chelsea midfielder Carney said.\nGet your football fix\nDon't want to miss the week's biggest football stories? Metro's exclusive football newsletter, In The Mixer, is your essential guide.\nFrom the latest transfer rumours and managerial moves to analysis of the biggest games and a lot more, our experts have you covered.\nSign up here, it's an open goal.\n‘What she did really well was never getting picked up. She ghosts into these spaces and she’s always unattended.\n‘Does Kearns go to her? Does Jess Carter go to her? England don’t clear their lines. First ball, second ball, that’s the golden rule, especially around the centre of the pitch.\n‘I don’t know if Hannah Hampton is caught blindsided by bodies in front of her… she gets a hand to it, but I think she’ll look back and be disappointed because it’s not right in the corner.\n‘But I am being hyper-critical because we’re playing Spain and this is a game we have to look on that we might get in the semi-final or final of the Euros so it was a little bit disappointing to concede in that manner.’\nFor the second goal, Carney’s ITV colleague Anita Asante felt Kearns invited Pina to take a shot rather than showing the Barcelona forward away from goal.\n‘It was pure quality. She [Pina] has come on with immediate impact, she’s done that for Spain time and time again,’ Asante said.\n‘She’s finds a pocket of space, waiting for the opportunity to get the ball, and she drops inside and just unleashes that shot, grazes it inside the post.\n‘It’s a brilliant finish but with England, you can see the gaps are getting too big, there’s no awareness of who is going to pressure.\n‘In that instance, Missy Bo Kearns just allows her to come back inside. Really, you want to show players like that outside and away from the goal. She had the whole goal to aim for.\n‘That just became a problem with some of the changes. They had a bit more fatigue and the gaps opened up.’\nEngland head coach Wiegman admitted there was room for improvement in the performance, viewing the match as a ‘learning moment’ in the build-up to the Euros.\n‘Concerned? That is a learning moment. I would not say concerned,’ she explained.\n‘They did something different so you want to exploit the space that they leave in behind, but first you have to keep the ball. That is not easy. Something to take with us moving forward.’\nMore Trending\nWiegman defended Hampton’s performance having put her faith in the Chelsea goalkeeper as her number one – a decision which prompted the shock retirement of Mary Earps last month.\n‘She was put under a lot of pressure, as was the whole defence,’ Wiegman added.\n‘There were many moments where there were a lot of players around her, a lot of crosses and a lot of runs in front of her.\n‘It was a good game for her experience.’\nMORE: England star Fran Kirby announces international retirement before Euros\nMORE: Martin Zubimendi raises doubt over £50m Arsenal transfer after medical claim\nMORE: Thomas Tuchel names Chelsea star ‘steps ahead’ of Harry Maguire after England snub",
  "word_count": 740,
  "scraped_at": "2026-02-14T12:50:02.113166"
}