{
  "article_id": "f1a14dfca3f8",
  "url": "https://www.arrowheadpride.com/2024/8/31/24232841/arrowheadlines-history-is-a-reason-the-chiefs-may-not-three-peat",
  "title": "Chiefs News : History is against the Chiefs",
  "date": "20240831T133000Z",
  "domain": "arrowheadpride.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Arrowheadlines: History is a reason the Chiefs may not three-peat\nChiefs headlines for Saturday, August 31\nKansas City Chiefs (11.8%)\nWhy they’ll win the Super Bowl\nYou know the reasons. It’s hard not to sound like a broken record when talking about this era of the Chiefs, but here goes: They have a generational quarterback in Patrick Mahomes, an all-time great coach in Andy Reid, one of the best assistant coaches in recent memory in defensive coordinator Steve Spagnuolo and a championship-caliber roster. If Mahomes is healthy and under center, it’s hard to see them as an underdog against anyone.\nWhy they won’t win the Super Bowl\nNo team in the Super Bowl era has ever three-peated. It’s incredibly difficult to win the Super Bowl, and despite Mahomes and Co. making it look so easy, the AFC really is stacked this year. One thing I’m worried about is that the Chiefs kind of sleepwalked through the regular season last year. If they have to go on the road in the playoffs again, maybe the defense takes a step back (replacing star CB L’Jarius Sneed won’t be easy) and they trip up in a tough environment like Baltimore or Buffalo.\nKansas [City] general manager Brett Veach has now spoken about the loss of Rees-Zammit to Jacksonville, highlighting what he needs to do to potentially crack the NFL code following his high profile crossover from rugby.\nAsked if Kansas [City] wanted him on their practice squad or if they had encouraged him to pursue other opportunities, Veach told an online media briefing: “Yeah, we kept it open [the practice squad]. We wanted the kid to really look at maybe some different opportunities as well.\nCarson Steele • Kansas City • RB • #42\nI don’t know why there’s talk of Steele as a fullback. He is not a fullback. Never was. He enters the league as a former UCLA Bruin, but it was in 2022 at Ball State when Steele, now of preseason stiff-arm fame, ran for nearly 1,600 yards at 5.3 yards per pop with14 touchdowns. In that masterpiece of a season, Steele forced 98 missed tackles on 298 attempts. He was a true workhorse that season.\nBecause of that, there should’ve been no real shock when he slid through defenses with loose hips and electric cuts for a 6-foot, close to 230-pound runner this August. He finished the preseason with 87 yards on a mere 11 totes with two rushing scores. What’s fascinating, too, about Steele’s situation...he’s not too far away from getting touches in what is bound to be another uber-efficient Patrick Mahomes and Andy Reid-led offense in 2024. Heck yeah I’m intrigued by this combine snub and UDFA with the Chiefs. Not too different from what occurred with Pacheco, Steele has earned a cult-like following in Kansas City, and rightfully so.\nKeegan Abdoo: Chiefs over Packers. Patrick Mahomes cements his status on the Mount Rushmore of signal-callers, leading the Chiefs to the first-ever Super Bowl three-peat.\nJudy Battista: Chiefs over Lions. Even Cinderella can’t stop an unprecedented Chiefs three-peat. Patrick Mahomes will lead the offense to another last-minute score to prevail in a thrilling, high-scoring game that anoints the Lions as the champs-in-waiting and the Chiefs as the current dynasty that poses a legitimate threat to match the Belichick-Brady Patriots’ six titles.\nAli Bhanpuri: Chiefs over Packers. Some folks are tired of Kansas City. Bored with the Chiefs’ relentless success. Desperate for something different. Not me. I love watching greatness. And we’re in the midst of one of the finest runs the sports world has ever seen. Nothing to do but sit back and enjoy the show (and another “L” on the Packers’ ledger).\nCarson Steele • Kansas City Chiefs · RB • Undrafted\nThe hard-charging runner out of UCLA could earn some snaps in the Chiefs’ running back rotation after shining in the preseason. Steele averaged 7.9 yards per carry (11 attempts for 87 yards), displaying a combination of strength, power and explosiveness that enabled him to rumble through the tackle-to-tackle box like a bull in a china shop. Given Andy Reid’s willingness to utilize a running-back-by-committee approach behind Patrick Mahomes, the rookie’s rugged running style adds a dimension to Kansas City’s offense.\nDuring a recent interview with NBC’s Chris Simms previewing next week’s season kickoff, Patrick Mahomes noted that Swift has even been drawing up plays.\n“I think it’s been cool to see the girls and the women that have really embraced watching football,” Mahomes said of Swift. “I know being a girl dad, how cool it is for me to see like these little girls — these daughters — and how much they’re loving to spend time with their dad, watching football. And then meeting Taylor, realizing how genuine and cool she is. I think that’s been special to me because she’s, like you said, the most famous person in the world, she could not be (genuine).\n“And she’s really interested in football, and she asks a lot of great questions. Started drawing up plays. We might have to put one in.”\nKansas City Chiefs: CB Trent McDuffie\nMcDuffie is probably the unquestioned “best” player on this list, as X factors are often young players in new starting roles or late-career veterans with a questionable amount of juice remaining. But with the trade of L’Jarius Sneed in March, McDuffie has become an even more critical player for the Chiefs.\nHere’s the problem with McDuffie: He’s too good at everything. His prowess as a slot corner allowed the Chiefs to play Sneed outside from much of last season. From that nickel spot, McDuffie could cover or blitz or defend the run or take on a block or swing to deep safety, and he did it all with aplomb. But ideally, when a corner as talented as Sneed leaves so many snaps on the outside and a team has such a talented cover man in McDuffie on the roster, it bumps him outside and forgets about it.\nAround the NFL\n“I think it is a little bit of an unknown because we haven’t played as a unit in games. We’ve seen it in practice,” DeCosta said.\nBut the unknown of young players is just the reality of team building.\n“Across the board, we made the decision to start to build up the line with young players,” DeCosta said. “Unfortunately, with a salary cap league, you just can’t build a team with veterans at every position. If you could, it’d be great. I grew up a Cowboys fan, and the 1993 Dallas Cowboys, one of the great teams of all time, if that team had been able to stay together forever they would’ve won Super Bowls every year. But there is a salary cap and there is free agency. And so you have to pay players, but you also have to understand you’ve got to draft and you’ve got to develop young players as well. And we have started to do that on the offensive line. . . . We may have some hiccups along the way, but we’ve started to build from the bottom up and I think a year from now we’ll be in a great place.”\nThe deal is for four years at $22.04 million, sources told ESPN’s Adam Schefter. The extension includes $12.5 million guaranteed, sources told Schefter.\nThe Chargers reward Dicker after one of the best seasons of his career in 2023, where he was one of the Chargers most consistent players. Dicker set the franchise record for 50+ yard field goals made in a season last year with seven.\nDicker has had somewhat of a winding journey to this point. He went undrafted out of the University of Texas in 2022, then spent time with three different teams during his rookie season before landing with the Chargers in Week 7 after an injury to kicker Dustin Hopkins.\nIn case you missed it on Arrowhead Pride\nThe latest example is rookie safety Jaden Hicks, whom the Chiefs selected in the fourth round of last April’s draft. Hicks has shined in the preseason — and by the sound of things, players around the league are beginning to take notice.\nVeach believes the former Washington State defensive back has been impressive since his first day in Kansas City — and is “going to have a big role” in Kansas City’s defense.\n“[He] wasn’t one of those guys we drafted [who] had some ups, some downs and then he started making plays,” Veach told reporters on Thursday. “I think from the time he stepped on the field here, he had a good grasp of things. And then that kind of translated right into the training camp — and [then] right off the bat, the Jacksonville game.”\nA former Chiefs safety (who is now playing for his hometown New Orleans Saints) is among those who also noticed Hicks’ preseason play.\n“I was at home watching some preseason games after we got done playing one night,” recounted Veach. “I just randomly texted Tyrann Mathieu to check in and say hi. We were exchanging texts — and he kind of ended it with, ‘And [number] 21 is a stud.’\nSocial media to make you think\nFollow Arrowhead Pride on Social Media\n- Facebook: Click here to like our page\n- AP Instagram: Follow @ArrowheadPride\n- AP on X: Follow @ArrowheadPride\n- AP Staff on X: see complete list\n- Sports Radio 810 on X: Follow @SportsRadio810",
  "word_count": 1577,
  "scraped_at": "2026-02-14T13:30:43.857289"
}