{
  "article_id": "f1ca840e311b",
  "url": "https://www.chroniclelive.co.uk/news/north-east-news/st-james-park-future-verdict-33379479",
  "title": "St Jame Park future verdict after Newcastle United chief gives stadium update",
  "date": "20260207T033000Z",
  "domain": "chroniclelive.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "St James' Park future verdict after Newcastle United chief gives stadium update\nNewcastle United fans are still waiting for a decision on whether the club will seek to redevelop St James' Park or move to a new stadium elsewhere\nNewcastle’s council leader has reiterated her hopes of a “world class stadium at the heart of the city centre”, amid ongoing uncertainty surrounding the future of St James’ Park. Fans of Newcastle United have been waiting to hear whether the club plans to stay and regenerate the ground it has called home since 1892 or seek to build a new, more modern stadium.\nThere has been widespread speculation that the Magpies could try to move to neighbouring Leazes Park, leading more than 28,000 people to sign a petition last year opposing the idea of building on the grade II listed green space. Club chief executive David Hopkinson told talkSPORT this week that the NUFC hierarchy still haven’t decided whether to stay or go, though he confirmed that relocating to a new stadium but “not really moving that far” was an option being considered.\nAnd city council leader Karen Kilgour says that staying in the heart of the city is essential to retain the “unique” feeling of a matchday in Newcastle. The Labour councillor, a season ticket holder at St James’ Park, said that early talks had been held with the football club about their ambitions – but insisted there had still been no “formal discussions” about Leazes Park.\nLast November, the council denied any “secrets or secrecy” over the stadium debate after it emerged that it had rejected a freedom of information request asking for details of emails between the local authority and NUFC about Leazes Park on the ground that there were more than 31,000 potential such emails.\nCoun Kilgour told the Local Democracy Reporting Service: “As with all major developments, we have had early discussions to support the club in their decision-making. We absolutely share their ambition to have a world class stadium at the heart of the city centre, whether that is a new stadium or building on the existing stadium.\n“We are the planning authority, we need to carry out due diligence, we need to make sure whatever happens in the city is the absolute best it can possibly be and the best thing for the city. But until there is a planning application in, there is nothing more we can really do.\n\"We stand ready to support them and help them and I personally would love to see something happen, whatever that may be. The club is a really important feature in the city, a really important asset.\n\"Where else can you go that has a stadium right in the heart of the city? It is unique and part of our DNA. Absolutely we stand ready to support them, but it is up to the club to submit a planning application.”\nMr Hopkinson told talkSPORT that St James’ is a “magical place” and that club officials were “working on this every day, deciding whether it’s here or on a new site”. He said that any new stadium would not be “in some farmer’s field out in the middle of nowhere”.\nSt James’ Park is due to host matches at Euro 2028 and is part of the UK’s bid to stage the Women's World Cup in 2035.\nThere have been wider questions surrounding the future sporting investment plans of Newcastle United’s majority owners, Saudi Arabia’s Public Investment Fund (PIF). It was reported last week that the flagship Neom project, including the building of a 170km-long megacity known as The Line, in Saudi Arabia is being scaled back due to financial pressures amid a slump in oil prices.\nCulture secretary Lisa Nandy said last year that the UK Government was “keen to support” a Newcastle United stadium development, having also offered backing to Manchester United’s proposed Old Trafford redevelopment. Regeneration works surrounding a new football stadium could also be a key target for Tyneside mayoral development corporation set up by Kim McGuinness to accelerate construction in key sites.\nCoun Kilgour added: “When we have discussions with the club it will be about more than a specific planning application, important though that will be, because we have to get it right for the city. This is a once in a lifetime opportunity and we have to make sure it is right.\n“Absolutely we want a world class stadium that is fit for the future because that is what Newcastle United and the supporters deserve, but it has to be right for the city. There needs to be the correct infrastructure, we would need to masterplan any area if there were to be any significant changes because the impact will be huge and we need to get it right.”",
  "word_count": 799,
  "scraped_at": "2026-02-14T12:38:14.875938"
}