{
  "article_id": "f1d333c38f9c",
  "url": "https://www.starsandstripesfc.com/2024/7/3/24190717/usa-uswnt-olympic-roster-profiles-midfielders-horan-macario-lavelle-coffey-albert",
  "title": "USWNT Olympic roster profiles : Midfielders",
  "date": "20240703T163000Z",
  "domain": "starsandstripesfc.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "The 2024 Olympics kick off at the end of the month, and the United States Women’s National Team are back in search of yet another medal. They have received medals in 6 of the 7 Olympics that have featured women’s football as a sport, and in 2024 the team heads to France - where they won the 2019 Women’s World Cup - to hopefully win their fifth gold medal.\nUSWNT Olympic roster profiles: Midfielders\nWe continue our series to introduce the USWNT Olympic roster by position with the midfielders.\nAs the Olympic roster was released last week, we are initiating a series of profiles, focusing on each position individually as well as the coaching staff. We will detail how they round out the USWNT as they get ready to take on the world. We continue this focus with the midfielders.\nThe USWNT bring five midfielders to France:\nMidfielders (5): Korbin Albert (Paris Saint-Germain), Sam Coffey (Portland Thorns), Lindsey Horan (Lyon), Rose Lavelle (Gotham FC), Catarina Macario (Chelsea FC)\nLindsey Horan is the key in the midfield. As the USWNT captain, her play is crucial to the team’s success. She has struggled at times in 2024, but if she plays at the top of her game, it makes the flow easier for the entire team. She’s been inconsistent at times, being stellar with her finishing on occasion but also having a growing tendency to slow the game down to a grind with excessive dribbling and dull passing. She will have to provide the leadership and set the example on the field by getting involved in the attack and also doubling back on defense when needed.\nEasily the best potential playmaker is Catarina Macario. She could start in an attacking role, she could flow up top as a false 9, or she could play as a box-to-box midfielder or winger in a pinch. Her creativity, however, is why she’s on this team, and Emma Hayes knows her well from her club play at Chelsea. The idea is to put the ball at her feet and let her cook…because she’s a master chef on the ball. She can score from anywhere on the field, and she can set up anyone for a great scoring chance with her passing and insane dribbling.\nComplementing Catarina Macario is Rose Lavelle. The 29-year-old midfielder has been oft-injured as of late, but she appears to be ready to go for the Olympics at 100%. Another creative option, Rose has been one of the more brilliant dribblers and passers for the team since she arrived on the scene. And, she’s overdue to get back to the Rose Lavelle that we saw win the Bronze Ball at the 2019 Women’s World Cup. If Rose is at the top of her game, there may not be a player on earth that can stop her. But, can she remain healthy and has her recent injuries robbed her of some of that effectiveness? The hope is that her plus Macario in front of Horan can break down defenses and get a ton of scoring chances with link-up play with the forwards.\nSam Coffey has been fairly solid for the team in her role as a defensive midfielder. She could be called on to start in that role or do so off the bench, and she could be thrown into a box-to-box role if Emma Hayes needs some defense to close out a match.\nKorbin Albert is the biggest question mark on this team. She has recently broken into the USWNT, but has also been at the center of controversy over some of her homophobic and transphobic stances highlighted through social media along with actively cheering for the injury of USWNT legend Megan Rapinoe that ended her illustrious career. And, throughout all of it, she hasn’t played well, leaving many fans thinking that she should be left at home. However, Emma Hayes apparently has seen enough to bring her on the plane to France. She will have to step up on the international stage, in a country that she calls home on the club level, and provide distribution and defense from the 6 role. You can easily envision her getting heavy minutes during the Olympics, especially when Hayes opts for more defense. But, she has to also be the exemplary teammate and show them and fans that she has learned from her mistakes and is ready to atone with her play.\nHal Hershfelt and Croix Bethune are both rookies with the Washington Spirit that have exploded onto the international scene in the last month. They both head to France as alternates. Hershfelt is more of a defensive midfielder, while Bethune has been arguably the most dynamic player in the NWSL this season. Both easily could have made the roster and provided a lot, but they will be able to keep the midfield and defense on their toes in practice with their creativity and hard work. Neither have been blinded by the lights either, so if they have to be called up to the main roster, fans can rest assured that they will be ready to maximize the opportunity and do what they can to help the team go for gold.\nThe midfield as a whole might be the most important part of how this team operates. When the USWNT win the midfield, they can be unstoppable. However, a midfield that isn’t getting the job done could mean the team goes home without a medal. It’s important that they can be the engine that steers this team forward and not the nail in the tire that holds them back.",
  "word_count": 934,
  "scraped_at": "2026-02-14T12:58:00.552317"
}