{
  "article_id": "f1d7fcc8b660",
  "url": "https://www.chortle.co.uk/news/2024/06/09/55782/inside_no_9s_final_twist",
  "title": "Inside No 9 final twist : News 2024 : Chortle : The united kingdom Comedy Guide",
  "date": "20240609T123000Z",
  "domain": "chortle.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Inside No 9's final twist\nOur pick of the very limited comedy offering on TV, radio and streaming this week…:\nSunday June 9\nTHE ALL STAR EUROS SKETCH SHOW: BBC Scotland celebrates the national side qualifying for the Euros by recruiting some of their biggest comedy names for this one-off celebration, mixing established audience favourites with new characters. Impressionist Jonathon Watson will transform into football figures from Sir Alex Ferguson to Scotland manager Stevie Clarke; Scot Squad’s Chief (Jack Docherty) plans an ambassadorial trip to Germany; and there’s a Euros inspired scene from the cast of The Scotts. Meanwhile musical duo Almost Angelic - aka Karen Dunbar and Tom Urie - reunite after a 20-year hiatus, Greg Hemphill writes and performs new sketch material and his Still Game collaborator Ford Kiernan showcases a character new to TV BBC Scotland, 9pm\nWednesday June 12\nINSIDE No 9: So this is it… apart from the stage show coming to London in the New Year. After nine series of classic TV, Reece Shearsmith and Steve Pemberton’s endlessly inventive anthology show comes to an end. Episodes were frequently chilling, often funny and always offering something different… so expectations are sky-high for the send-off. And with suitable intrigue, details are scant. We know it’s called Plodding On and we think it’s a two-hander between the two creators, with no co-stars listed. But no preview images or clips have been released, the press have not been given an advance copy, and the summary of the episode reads only: ‘The final episode of the award-winning anthology of films, written by and starring Steve Pemberton and Reece Shearsmith.’ Mysterious… BBC Two, 10pm\nJESSICA FOSTEKEW: STURDY GIRLS’ CLUB: The comic’s Radio 4 series returns to look at women taking part in sports traditionally considered ‘unladylike’. In this episode Fostekew looks at Crossfit with champion Lucy Campbell - about muscularity, finding a community and the sexualisation of the women at the top of their game. BBC Radio 4, 6.30pm\nPublished: 9 Jun 2024",
  "word_count": 333,
  "scraped_at": "2026-02-14T13:39:46.167420"
}