{
  "article_id": "f1deafbd2a65",
  "url": "https://www.fool.com/earnings/call-transcripts/2024/06/27/nike-nke-q4-2024-earnings-call-transcript/?source=iedfolrf0000001",
  "title": "Nike ( NKE ) Q4 2024 Earnings Call Transcript",
  "date": "20240628T030000Z",
  "domain": "fool.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Nike (NKE +3.17%)\nQ4 2024 Earnings Call\nJun 27, 2024, 5:00 p.m. ET\nContents:\n- Prepared Remarks\n- Questions and Answers\n- Call Participants\nPrepared Remarks:\nOperator\nGood afternoon, everyone. Welcome to NIKE, Inc.'s fiscal 2024 fourth-quarter conference call. For those who want to reference today's press release, you'll find it at investors.nike.com. Leading today's call is Paul Trussell, VP of corporate finance and treasurer.\nI would now like to turn the call over to Paul Trussell.\nPaul Trussell -- Vice President, Investor Relations and Strategic Finance\nThank you, operator. Hello, everyone, and thank you for joining us today to discuss NIKE, Inc.'s fiscal 2024 fourth-quarter results. Joining us on today's call will be NIKE, Inc. president and CEO, John Donahoe; and our CFO, Matt Friend.\nBefore we begin, let me remind you that participants on this call will make forward-looking statements based on current expectations, and those statements are subject to certain risks and uncertainties that could cause actual results to differ materially. These risks and uncertainties are detailed in NIKE's reports filed with the SEC. In addition, participants may discuss non-GAAP financial measures and nonpublic financial and statistical information. Please refer to NIKE's earnings press release or NIKE's website, investors.nike.com, for comparable GAAP measures and quantitative reconciliations.\nAll growth comparisons on the call today are presented on a year-over-year basis and are currency-neutral unless otherwise noted. We will start with prepared remarks and then open up for questions. We would like to allow as many of you to ask questions as possible in our allotted time, so we would appreciate you limiting your initial question to one. Thanks for your cooperation on this.\nI will now turn the call over to NIKE, Inc. president and CEO, John Donahoe.\nJohn J. Donahoe -- President and Chief Executive Officer\nThank you, Paul, and hello to everyone on today's call. I want to start by briefly commenting on our financial results. For full-year fiscal '24, revenue grew approximately 1% on a currency-neutral basis and earnings per share grew 15%. Q4 revenue was flat.\nFor the quarter, we saw strong gains within performance product. However, this was more than offset by declines in lifestyle. These declines had a pronounced impact on our digital results. These factors, when combined with increased macro uncertainty and worsening foreign exchange have caused us to reduce our guidance for fiscal '25.\nMatt will provide more detail on our results and outlook later in the call. While fiscal '25 will be a transition year for our business, we continue to make real progress on our comeback. Over the past year, we've highlighted the strategic shifts we're taking as a company, including leadership and organization changes, kick-starting a multiyear innovation cycle, and creating capacity to invest in consumer-facing activities. As I mentioned in last quarter's call, we're making a series of adjustments to position us to compete and win.\nWe're sharpening our focus on sport, accelerating our pace and scaling of newness and innovation, driving bigger, bolder storytelling, and elevating the entire marketplace to fuel brand distinction and being the path of the consumer. This is our playbook, and we're seeing momentum build in all four areas, particularly on the performance side of our product portfolio. We have work to do, but we're on it. Our teams are moving with energy and urgency against the opportunity we see in front of us.\nNow, as we've discussed over the past few quarters, we've been accelerating our innovation pipeline, including pulling forward several innovations, some more than a year. We're moving aggressively to reestablish our innovation edge. We began with a focus on performance as NIKE always does, and the early results from newness and innovation are encouraging. Performance grew double digits in the quarter, with growth in many of our key sports.\nAnd as we kicked off our multiyear innovation cycle, one of our key priorities has been increasing our speed to the consumer. We believe accelerating the pace and consistency of our innovation will allow us to deliver impacted scale season after season. Now, as you know, for years, NIKE has had an Express Lane, which enables short-lead-time replenishment and hyperlocal design, and we'll continue to leverage Express Lane. But over the past year, we have also built a new way of working across the entire product creation process.\nWe call this Speed Lane, and it's part of a broader companywide effort to move faster and be more responsive to the consumer. For example, through Speed Lane, we're leveraging our Bowerman Footwear Lab to accelerate design. We're leveraging advanced digital tools to quicken development. And we're leveraging key manufacturing partners to speed up product testing and production.\nWe've already accelerated half a dozen models through this new capability, and in the second half of the fiscal year, you'll see other new innovations come out of Speed Lane, including several exciting new franchises across fitness and lifestyle. As I've mentioned, our sharp focus around newness and innovation starts with performance, and we're seeing the impact across key sports. Let me give you a few brief examples across three: basketball, fitness, and running. First, basketball, which was up double-digit growth in Q4 across men's, women's, kids', and Jordan.\nThis was driven by new innovation from the G.T. Cut to Kobe's new footwear and apparel to the Sabrina 1, which in itself has taken two points of share across the entire U.S. basketball market, including both men's and women's. We recently announced Sabrina's next shoe as well as A'ja Wilson's signature franchise, and we announced the signing of Caitlin Clark to a roster of athletes that was already the game's best.\nAll this energy will continue to fuel the rapid growth of our women's basketball business as excitement around the WNBA soars to historic highs amid an expanding fan base. And of course, this month's Jayson versus Luka NBA Finals matchup marked the first time Jordan signature athletes met on basketball's pinnacle stage. We celebrated Jayson's title with one of the Jordan Brand's biggest marketing efforts ever. Next, let's look at our fitness business.\nFitness represents one of the largest market share opportunities we see as a company, particularly for our female consumer. We've made intentional decisions to make meaningful investments in fitness, and these actions are paying off. Over the past quarter, we saw broad-based growth for fitness, led by double-digit growth in apparel. For example, statement leggings, which is a key focus for us, were up high double digits in Q4, led by innovations we've introduced over the past few quarters with Universa, Zenvy, and Go.\nWomen's fitness footwear also had a strong quarter, driven by Motiva and the latest version of Free Metcon, which came out last summer. Free Metcon is now NIKE's No. 1 women's fitness shoe having expanded from the gym to the street. Next, let's look at road running, which remains a competitive battlefield, but we are playing to win.\nIn past calls, we've discussed that we're now aligned, resourced, and taking this challenge head-on with confidence. We've been hustling to accelerate our running innovations and amplify our ground game. While our overall running business was impacted in Q4 by our proactive actions to manage the Pegasus portfolio transition, we're pleased that recent new releases in Vomero, Invincible, Infinity, and Structure all grew high double digits over the quarter. We're making it easier for consumers to discover these styles by simplifying our running construct at retail as we highlight our best-in-class cushioning technologies.\nNow, as you know, a few weeks ago, we launched the Pegasus 41 a new chapter for NIKE's biggest performance franchise. Peg 41 pairs Zoom Air with full-length React X foam for a ride that's more comfortable, durable, and responsive than ever. It's received strong reviews from industry experts. We supported the 41 with our full playbook backed by NIKE's most comprehensive running campaign in years, which will last for several seasons.\nIt was also fueled by a refreshed ground game. This included neighborhood activations to drive consumer trialing at scale and building energy across the full marketplace, including NIKE Direct, our strategic partners, and our performance authenticators such as running specialty doors. This energy drove Peg 41 to a strong start, led by better-than-expected sell-through in both wholesale and NIKE Direct. And our full running journey for fiscal '25 goes beyond the Peg 41 launch.\nWe'll be adding several dimensions for Peg in holiday before introducing additional exciting innovations in the second half of the year, including Pegasus Premium and Vomero 18. We're already seeing strong wholesale order book for running across the next few seasons as we continue to take meaningful strides to assert our leadership in this key sport. Now, let's talk about lifestyle, where we're focused on building a more diversified lifestyle footwear portfolio to complement the industry's three largest franchises. We're excited about our pipeline of new lifestyle product.\nA key example was last quarter's introduction of Dynamic Air, our newest breakthrough innovation platform. We launched the Air Max Dn globally, and within just a few months, Dn has become a top 10 lifestyle franchise in our men's business and is resonating particularly well with sneaker-engaged consumers in major cities. And importantly, Dynamic Air is an innovation platform. We're already working on the two -- next two iterations of Dynamic Air, and we will continue to innovate on this platform, including customizing air cushioning to create unique consumer benefits.\nAnother component of fueling a more diversified lifestyle portfolio is taking advantage of NIKE's unmatched vault. One example is retro running. We saw an opportunity in the marketplace for retro and moved quickly and nimbly to fill it with our Y2K portfolio, and consumers are responding. We experienced significant quarter-over-quarter retail sales growth for Y2K and now expect to nearly triple our retro running business by the end of fiscal '25 compared with the start of fiscal '24.\nNow, while we are growing new lifestyle offerings, we're also accelerating planned reductions for our three largest franchises. And this will have a meaningful impact near term on our overall lifestyle growth rate. Now, while we have work to do, we are very focused on scaling the newness to offset this planned reduction. And we're excited about the pipeline with exciting footwear concepts coming in the second half of fiscal '25.\nFinally, the Paris Olympics offers us a pinnacle moment to communicate our vision of sport to the world. This is led by breakthrough innovation and announced by a brand campaign that you won't be able to miss. We recently unveiled our Air for Athletes innovation at our Nike on Air event in Paris. And we can't wait to bring all this Olympics product to life across the games and in more than 8,000 doors worldwide.\nAnd throughout, our brand storytelling will be bold and clear, with sport and athletes at the very center of it all from brand voice to retail activations. This summer, we will cut through the clutter to create powerful energy for the NIKE brand. We're back doing what we do best, creating impactful storytelling, and ultimately, brand distinction in sport. In the end, we're taking our challenges head-on, and we're regaining our edge.\nThanks to the heart and hustle of our global team, we're aggressively asserting the future of NIKE. With passion, clarity, and grit, we're driving this business forward. We're excited about the opportunity in front of us, and we're eager to prove what NIKE can do. And with that, I'll turn the call over to Matt.\nMatthew Friend -- Chief Financial Officer\nThanks, John, and hello to everyone on the call. For NIKE, fiscal '24 was a pivotal year to get back on the offense in sport with consumers, led by an urgency to accelerate our pace of innovation and scale newness across our product line. Today, our playbook is in motion. Our teams are focused and hustling to deliver, and we're seeing positive signals from consumers and retail partners across the world.\nThat said, this quarter, we have been navigating several headwinds, which we now expect to have a more pronounced impact on fiscal '25. Although the next few quarters will be challenging, we are confident that we are repositioning NIKE to be more competitive with a more balanced portfolio to drive sustainable, profitable long-term growth. Let me provide some deeper insights into the fourth quarter and the implications we see as we look forward before reviewing our financial results and our outlook. First, after double-digit growth over the past several years, our lifestyle business declined in Q4 across men's, women's, and Jordan, more than offsetting strong growth in our sport performance business.\nSecond, NIKE Digital declined 10% in the quarter. Although our digital business has grown at an approximately 26% CAGR since fiscal '19, we missed our Q4 plan on softer traffic, higher promotions, and lower sales of certain classic footwear franchises. More specifically, these franchises underperformed our overall digital business results in the quarter, especially in April and May, and continuing on into early June. This is even as these franchises continue to drive retail sales growth at high full-price realization in multi-brand retail.\nThird, we experienced meaningful shifts in consumer traffic in key markets, particularly in Greater China, where brick-and-mortar traffic declined as much as double digits versus the prior year. We also continue to see uneven trends in EMEA and other markets around the world. And last, foreign exchange headwinds worsened, creating an additional one-point headwind on revenue in the quarter. In the midst of these dynamics, our goals to return to strong growth remain the same: read and react to the consumer, maximize full-price sales across all channels, protect long-term franchise health, prioritize a healthy pull market, and create marketplace capacity for new products and new stories coming in fiscal '25.\nTherefore, despite continued marketplace demand, we are advancing our timelines to tighten total supply of certain classic footwear franchises at different paces across different channels around the world. In particular, we are aggressively adjusting our forward-looking plans for these franchises on NIKE Digital, where they have their highest share of business. All told, we expect these actions to create several points of short-term headwinds on revenue in fiscal '25. However, our past experience gives us confidence that proactively rebalancing our portfolio will strengthen our competitive position and fuel brand momentum as we take the consumer somewhere new.\nLet me share a few recent examples. Back in fiscal '18, we recalibrated the supply of select Jordan Brand franchises, resetting our launch business and bringing more dimension to our portfolio. Over the subsequent quarters, we turned the page from double-digit declines in the brand to the start of multiple consecutive years of strong double-digit growth. And earlier this year, we moved quickly to reshape our lifestyle footwear portfolio in Japan and Korea, two of our most trend-forward markets, where our teams read and reacted to consumer signals.\nWe reduced supply of some classic franchises while scaling and creating new energy around other models in our vault. In the fourth quarter, we regained our No. 1 position in Korea in women's lifestyle footwear and extended our lead in Japan with new momentum heading into fiscal '25. Now, as we accelerate our pace of newness and innovation, the early response from consumers and partners are reinforcing our optimism in NIKE's path forward.\nFirst, the sharper focus on sport is creating impact. This quarter, performance grew across men's, women's, kids', and Jordan across all channels and geographies, and we expect to build on that momentum, leading with performance in fiscal '25. We are seeing favorable indicators in key focus areas, including strong double-digit growth in order books with North American running specialty partners in both holiday '24 and spring '25. In lifestyle, fresh releases are resonating positively with consumers.\nFor instance, new executions around retro running and field franchises such as Cortez, Killshot, and the Field General are driving strong retail sales growth as we prepare to scale these franchises in fiscal '25. Our teams are also attacking opportunities across price points, including a refreshed lineup of new footwear products below $100. Building on this quarter's double-digit growth, we plan to scale new performance and lifestyle models in spring '25. Added up, we expect the business contribution from new products to more than double from the start of fiscal '24 to where we end the year in fiscal '25.\nLast, we are managing expenses tightly through this product cycle transition while reallocating resources to maximize consumer impact. This is enabled by our save-to-invest initiative, which is creating investment capacity to fuel our next phase of growth. At the end of fiscal '24, we have unlocked savings from initiatives up and down our P&L and across our value chain from reducing small parcel fulfillment costs to consolidating suppliers, optimizing technology spend, and restructuring our organization to streamline layers and support functions. In turn, we are reinvesting nearly $1 billion in consumer-facing activities in fiscal '25, which we expect to accelerate our return to strong growth.\nThis includes ramping up our ground game offense in running in key cities, increasing resources in design, product creation, and merchandising for our key sport dimensions, deepening our sports marketing portfolio, elevating the distinction of our brand in physical retail, and driving bigger bolder brand campaigns starting with EC24 and the Paris Olympics. Now, let me turn to our NIKE, Inc. fourth-quarter results. In Q4, NIKE, Inc.\nrevenue was down 2% on a reported basis and flat on a currency-neutral basis. NIKE Direct was down 7%. NIKE stores were down 2%, and NIKE Digital was down 10%. Wholesale grew 8%.\nGross margins expanded 110 basis points to 44.7% on a reported basis, primarily due to strategic pricing actions, lower ocean freight rates, and improved supply chain efficiency, partially offset by lower margins in NIKE Direct, unfavorable channel mix, and net foreign exchange impact. SG&A was down 7% on a reported basis as increased investment in demand creation was more than offset by reductions in operational overhead. This includes impact from approximately $40 million in restructuring charges. Our effective tax rate was 13.1% compared to 17.3% for the same period last year due to changes in earnings mix, partially offset by decreased benefits from one-time items such as stock-based compensation.\nDiluted earnings per share was $0.99, up 50% versus the prior year. This includes nonmaterial impact from restructuring charges. For the full year, revenue was flat on a reported basis and up 1% on a currency-neutral basis. Diluted earnings per share grew 15%.\nCash flow from operations was $7.4 billion, up 27% versus the prior year on significant improvements in working capital. Inventory declined 11% versus the prior year with continued improvement in days in inventory. Now, let me turn to the operating segments. In North America, Q4 revenue declined 1%.\nNIKE Direct was down 9%, with NIKE Digital down 11% and NIKE stores down 5%. Wholesale grew 6% due to accelerated shipping timing from Q1 of fiscal '25, and EBIT grew 5% on a reported basis. This quarter, we saw softer traffic in our factory stores, highlighting increasing pressure being felt by the value consumer. That said, we saw a number of bright spots as well, including strong growth in basketball, fitness, and kids', offset by declines in lifestyle and Jordan.\nKids' led our results in the geography with performance dimensions of strong double digits. In women's fitness, we gained market share in footwear. In men's and women's running, fall footwear bookings are up double digits, led by the Pegasus 41. In EMEA, Q4 revenue grew 1%.\nNIKE Direct was down 8% as NIKE stores grew 1%, and NIKE Digital declined 14%. Wholesale grew 7%. EBIT grew 2% on a reported basis. In a cautious macro environment, we are seeing performance innovation drive strong sell-through.\nThis is partially offset by overall declines in lifestyle with new product releases working well. Global Football grew double digits across men's and kids'. In women's fitness, we drove strong momentum in footwear and new apparel releases such as our refreshed Nike Pro line. In lifestyle, our retro running franchises continue to scale, and our Air Max Dn launch drove energy with a full marketplace takeover.\nIn Greater China, Q4 revenue grew 7%, including several points of contribution from Tmall's earlier start to the 6.18 shopping holiday. Excluding this timing benefit, we fell short of our plan with traffic softness persisting across all marketplace channels. NIKE Direct declined 2%, with NIKE stores down 6% and NIKE Digital up 8%. Wholesale grew 15%.\nEBIT grew 4% on a reported basis with continued impacts from foreign exchange. Our kids' business set the pace in the geography this quarter led by running and basketball. Within men's and women's lifestyle, retro running styles and our latest Express Lane releases drove positive consumer response. And in men's and women's running, retail sales for our new releases, Structure, Vomero, and Invincible, grew double digits.\nThe China marketplace remains highly promotional, and we continue to manage both NIKE and partner inventory carefully. While our outlook for the near term has softened, we remain confident in NIKE's competitive position in China in the long term. In APLA, Q4 revenue grew 4%. NIKE Direct declined 3% with Nike stores up 11% and NIKE Digital down 12%.\nWholesale grew 9%, and EBIT grew 4% on a reported basis. Mexico and Southeast Asia and India led our growth in the geography. And across APLA, we drove strong momentum in performance with men's basketball, men's global football, and women's fitness up double digits. Jordan Brand drove energy with street ball activations in Tokyo and Manila and market share gains in basketball footwear.\nNow, let me turn to our fiscal '25 financial outlook. We are managing a product cycle transition with complexity amplified by shifting channel mix dynamics. A comeback at this scale takes time. With this in mind, we've considered a number of factors and scenarios in revising our outlook for fiscal '25.\nMost importantly, this includes timelines and pacing to manage marketplace supply of our classic footwear franchises; lower NIKE Digital growth, especially in the first half of the year due to lower traffic on fewer launches, planned declines of classic footwear franchises given Q4 trends, as well as reduced promotional activity; increased macro uncertainty, particularly in Greater China, with uneven consumer trends continuing in EMEA and other markets around the world; and sell into wholesale partners as we scale product innovation and newness across the marketplace and finalize second half order books. Taking all of this into consideration, we now expect fiscal '25 reported revenue to be down mid-single digits with the first half down high single digits. Foreign exchange headwinds have also worsened and will now have a one-point translational impact on revenue in fiscal '25. Turning to gross margin.\nWe expect full-year expansion of approximately 10 to 30 basis points on a reported basis. This reflects benefits from strategic pricing actions and lower product input costs, partially offset by supply chain deleverage, channel mix shifts, and net foreign exchange impact. We expect full-year SG&A growth to be up slightly versus the prior year as we increase investments in demand creation to ignite brand momentum and maximize reach and impact while holding operating overhead largely flat. Other income and expense, including net interest income, is expected to be approximately $250 million to $300 million for the year.\nWe expect our full-year effective tax rate to be in the high teens range. Now, turning to our first quarter. We expect first-quarter revenue to be down approximately 10%. This reflects more aggressive actions in managing our classic footwear franchises, continuing challenges on NIKE Digital, muted wholesale order books with newness not yet at scale, a softer outlook in Greater China, and a number of quarter-specific timing factors.\nWe expect first-quarter gross margins to be in line with the full-year guidance. And we expect first quarter SG&A to be up mid-single digits, as we hold operating overhead flat while investing in key brand moments, including EC24 and the Paris Olympics games. For NIKE, inspiration starts with the athletes we serve. Their dreams motivate us to create the most innovative product in sport and tell stories that reach millions of people around the world.\nAbove all, they remind us of the hard work and the hustle that is required to win. Before I close, I'd like to thank our NIKE teammates whose passion and drive are the fuel for our comeback. The heart, the focus, and the collaboration that I'm seeing from our teams today are my greatest reasons for confidence as we move forward. With that, let's open up the call for questions.\nQuestions & Answers:\nOperator\n[Operator instructions] Our first question will come from the line of Matthew Boss with JPMorgan. Please go ahead.\nMatthew Boss -- JPMorgan Chase and Company -- Analyst\nGreat. Thanks. Maybe, John, just to summarize and think about relative to three months back, I guess, how would you rank changes on the macro front and similarly on NIKE execution that impacted the change in your 2025 outlook today relative to three months ago? And then, Matt, just on the gross margin, could you just help break apart maybe the puts and takes to consider over the course of '25 and how best to model the cadence from a gross margin perspective?\nJohn J. Donahoe -- President and Chief Executive Officer\nWell, thanks, Matthew. We set out what we're calling our comeback plan a year ago, and in the last 90 days, I would say, our execution continues to stay on pace. Matt, you can talk about macro and the franchise management impacting the numbers. But on the fundamental things, we set out to do four things that we are moving aggressively on, one, put sport back at the center of everything we do, serving the athlete.\nAnd over the last 90 days, we completed completely aligning our organization along the lines of sport, are co-locating those teams, and now, end to end, have clear, what we call, field-to-play -- sport-based field-to-play teams end to end, which is accelerating our pace and also improving our execution. As we've talked about the last couple of quarters, we've reignited our innovation pipeline, including pulling several innovations forward. So, in addition to launching Dn and Peg 41 during the quarter or early this quarter, we'll also pull forward key innovations like the Peg Premium and Vomero 18, which are just two examples of what's coming in spring '25. And as I mentioned earlier, speed is a capability we're building, which we feel increasingly strong about.\nAnd brand is getting strong. With Euro Champs, you see our Awaken Your Madness campaign, which is really the first of the bigger, bolder brand voice you're going to hear, and then we're very excited about the Olympics coming. A lot of the work that went into the Olympics happened in Q4, but you're going to get to see it in a few weeks. And then on marketplace, we've spent a lot of time leaning in with our wholesale partners.\nWe've had several wholesale partner summits. We've had RSG groups, neighborhood, partners, and authenticators to campus. We're exposing our three-year product innovation pipeline to them, and feedback has been very strong. Our order book for holiday, spring '25 -- holiday '24, spring '25 is strong.\nAnd so, our confidence is building. So, on the fundamentals that we are executing against this proven playbook on a comeback that will take time, we feel like we've made strong progress.\nMatthew Friend -- Chief Financial Officer\nAnd just hitting the financial implications relative to 90 days ago. Last quarter, we said that we thought revenue was going to be down low single digits in the first half, and that included a more pronounced impact in the first quarter. We also said that we expected revenue to grow. And what we saw in the fourth quarter were really two things.\nOne, lifestyle -- our lifestyle business declining more pronounced on NIKE Digital, specifically in April and in May, and those trends continuing into June. And what I highlighted in my prepared remarks is that those specific classic franchises that we were talking about underperformed our overall digital business results in the fourth quarter. And so when we look at our updated guidance of down mid-single digits for the full year, there's really three things that are driving the change. One, I'll start with FX.\nOur outlook on foreign exchange and the strength of the U.S. dollar had a one-point impact relative to 90 days ago. We've softened our outlook for Greater China, and that also similarly had a level of impact for the full-year guidance. And then the majority of the remainder of the change is related to the more aggressive actions that we're taking on our key franchises across the total marketplace but really with the compounded impact on total digital.\nAnd the bigger impact of this will be in the first half of this year, but we are planning for meaningful sequential improvement in the second half of the year. And that's how I think about the revenue differences relative to what we said 90 days ago. On the first quarter, the other impact was timing. And we saw the 6.18 period come earlier into May than we had in the prior year, and that had an impact on Q4's results but also an impact on Q1's results.\nAnd we saw some favorable shipment timing in North America as we prepare to go live with our ERP and also just better general product availability. So, that also had an impact on the first quarter numbers.\nJohn J. Donahoe -- President and Chief Executive Officer\nI just want to add one more thing that -- Matthew, you've heard Matt and I both talk about it. It's an intangible thing, but I think it's just so important, which is the heart and hustle of our team, which has just been extraordinary over the last year but also in the last 90 days, just accelerating. Both Heidi's and Craig's teams, the teamwork of how they're working together end to end, the focus and focus on the consumer, the increasing speed, pulling things forward, there's a palpable shift in the confidence and forward-looking nature of our teams. So, I want to give huge credit to them but also just recognize that is so important at NIKE, and our teams are, I think, feeling more confidence each day comes along.\nOperator\nOur next question will come from the line of Lorraine Hutchinson with Bank of America. Please go ahead.\nLorraine Hutchinson -- Bank of America Merrill Lynch -- Analyst\nThank you. Good afternoon. Can you provide some numbers that might help us to have confidence in the meaningful second-half improvements? How much less of a headwind is there from sunsetting some of these franchises? How do total order books look? And anything you can provide numerically that helped you to get to that back half improvement?\nMatthew Friend -- Chief Financial Officer\nWell, Lorraine, as I mentioned, we've looked at a number of different factors and scenarios as we've updated our guidance for the year, and that ranges from looking at different slopes of different curves and different products over time and developing a perspective on what -- how we think the trends are going to play out as it relates to some of our largest franchises. But those franchises continue to drive retail sales growth and high levels of full-price realization in the marketplace. And so, the bigger impact on the first half are the adjustments that we're taking to manage the health of those franchises starting first with NIKE Digital. And that has a pronounced impact on revenue, which is creating a more meaningful first-half impact.\nWe want to continue to let those franchises in the multi-brand environment continue to have the impact that they're having for our partners. And one of the ways that we maintain the health of those is by reducing what we're offering to consumers through our digital channel. As it relates to the second half, we highlighted a couple of things, but we are planning for meaningful sequential improvement in the second half versus the first half. And it starts with the confidence that we have around the new products that we're bringing to market, the Peg 41, the Peg Premium, the Vomero 18, the order book for Air Max Dn plus the next Air Max iteration.\nThat's going to be coming to market, plus our plans to scale the innovation and the newness that we've been discussing. And so, when we look at where we are today and the ways in which we're working to drive this plan through the balance of the fiscal year, our scaling of newness is on track. And our teams are hustling to see whether there's even opportunities to accelerate the scaling of that newness in the second half. We are confident in the indicators that we're seeing in the marketplace right now.\nWe gave you a couple of specific numbers as it relates to running and running specialty. But what I will tell you is that our initial read of our spring order book is in line with the guidance that we're providing. And so, we feel confident that we're creating better balance across our portfolio and also building momentum with our wholesale partners.\nOperator\nOur next question will come from the line of Bob Drbul with Guggenheim Securities. Please go ahead.\nBob Drbul -- Guggenheim Partners -- Analyst\nHi. Just two questions for me. I guess the first one is, when you look at the visibility of the business, I think, in some of your answers to Lorraine's questions, when you look at the visibility of the business today with the shifts that are occurring, can you just talk about how you feel looking at that versus what you saw over the last 12 and 24 months just in terms of your ability to predict? And then I guess the second piece of this is when you look at the channel shift that is going on wholesale to direct to bricks and mortar, the digital pieces of the business, can you just give us any more framework around how to think about the P&L impacts at a higher level?\nMatthew Friend -- Chief Financial Officer\nSure. Sure, Bob. Well, as it relates to the visibility with the shifts, I mean, we were surprised at what we saw on these larger franchises as we're navigating through the fourth quarter. And that is what's caused us to revise our guidance.\nI would say, in general, we've driven incredible growth in our digital business over the last four years, and we've had a lot of confidence in our ability to continue to drive those results against the consumer opportunity that's in the marketplace. I think most recently in the context of managing our overall franchises, the dynamic of increasing supply of these franchises in the wholesale marketplace relative to having the supply of them on digital and the relative balance between those things are -- those factors are what drove some of the volatility this quarter. And looking at the trend in retail sales but also looking at our overall plans for how we manage franchises based on our experience of doing this, we've made the adjustments in this forward-looking guidance, and we've been more aggressive with it on NIKE Digital. And so, we're continuing to improve with the capabilities that we're building in terms of demand sensing, leveraging data and insights in order to have better predictability of our owned business.\nBut I feel really good about the adjustments that we're making at this point in time and the aggressiveness through which we are -- the rest of the way that we continue to manage it. I'd also just say that when I look at the digital business overall, we were already planning for lower launches in Q4 because we had an extraordinary number of launches in the fourth quarter of the prior year. And if I exclude the impact of the biggest franchises on our digital business, the rest of our digital business was healthy, and we were pleased with the growth that it delivered. And so, from that end, we feel comfortable in the way that we're looking at this.\nAs far as the channel shift mix going forward, it certainly will have a headwind in fiscal year '25, both in terms of revenue, as I just mentioned in answering a prior question, but also on margin. And these products also have an outweighed impact on margin just given the high levels of full-price realization that we've been driving across these franchises. And so, we are planning for channel mix to be a headwind in '25, but I'm pleased that we're still able to expand margins 10 to 30 basis points in the year. And that's despite another year of about 15 basis points of foreign exchange headwinds.\nSo, we are expanding margins as we look toward fiscal year '25. And we still believe, while channel mix may be less of a driver as we look forward, we have a number of other opportunities to continue to drive more profitable business over the long term. And it starts with a strong brand, and it starts with creating great products that consumers love.\nJohn J. Donahoe -- President and Chief Executive Officer\nAnd I'd add to that a healthy marketplace where it's -- channel mix is driven by consumer demand. We said we want to be where the consumer is whether that's digital or our own door or wholesale. And so, we're embracing a more balanced approach to growing the whole marketplace. And a couple of nice evidence points of what I think health looks like is -- we've mentioned that performance grew double digits in the quarter.\nIt grew double digits in wholesale, and it grew double digits in digital. The first couple of weeks of Peg 41 sold through well in wholesale, and it sold well in NIKE Direct, both digital and outdoors. And so, over time, our channel mix should be driven by consumer -- being at the consumer at the right time and given shopping occasion. And so, we think it will settle out in a consumer-friendly way.\nOperator\nOur next question comes from the line of Adrienne Yih with Barclays.\nAdrienne Yih -- Barclays -- Analyst\nGreat. Thank you very much. I was wondering if you can talk about the amount of newness that is coming down the pipeline kind of over the next six to 12 months. Has there been another time when NIKE has historically launched this magnitude of newness? And how do you read sort of the second degree of the consumer, right? So, it's going into the wholesale channel first.\nHow do you read the success of that sort of at the end consumer as it goes to the wholesale pipeline? Thank you.\nJohn J. Donahoe -- President and Chief Executive Officer\nWell, we've said it now for a couple of quarters. We are very excited about this multiyear innovation pipeline and cycle. And it's just -- you've seen some early examples of it in this past quarter with Dn and Peg 41. And as we are saying, as we move into the end of this second half of this fiscal year, which we talk about is spring '25 and summer '25 of the seasons, the amount, and breadth and depth of the innovation is just accelerating significantly.\nAnd at our size and scale, we know we need to both innovate broadly and deeply but also provide innovations that can scale. And so, we've set a goal of doubling our -- the growth of our new innovations by the end of '25 versus the beginning of '24. And we're on track to achieve that. And one of the ways -- when you ask how do we know that, the wholesale partner feedback on what they see both in the second half of this year and into '26 because we're showing them three-year road maps, in many cases, around running, around basketball, around lifestyle, the wholesale feedback has been strong.\nAnd their order books, as Matt mentioned a minute ago, are reflecting that. And so, we view our job to be able to deliver, season in, season out, strong innovations, also the ability to scale those innovations over time, both to delight consumers and also bring us to healthy and sustainable growth. So, we feel very good about the track we're on, and we think it will accelerate as the year goes on.\nMatthew Friend -- Chief Financial Officer\nAdrienne, I would just add that one element of newness is also in the lifestyle side of the business. Over the last four years, we have driven double-digit growth and created an extraordinary amount of energy. We've created iterations and dimensions to Air Force 1 to Air Jordan 1 to the Dunk business. And as a result of that, we've created extraordinary consumer demand.\nAnd so, one element of us bringing newness to the market is actually going into NIKE's vault, what no one else has, and being able to create energy the way that we've done over the last four years to be able to move consumers on to a new place. And it's something that we can do that we have a proven track record doing. In fiscal year '19, the Dunk represented 0% of NIKE's business. And we scaled that dramatically with strong consumer appeal and response over the last three years, and now we're managing that franchise back to continue to ensure that demand in the marketplace is greater than the supply that we're offering.\nAnd that is how we're managing these franchises. And so, on the one hand, there's certainly a performance innovation side and what we showed in Paris and what John was highlighting in terms of what's coming, we feel great about, but there's also an element of NIKE taking advantage of its vault of assets and bringing new innovation, new stories, new partnerships to bring new products to market to capture an incredible amount of sneaker demand out in the marketplace.\nOperator\nYour next question comes from the line of Brooke Roach with Goldman Sachs. Please go ahead.\nBrooke Roach -- Goldman Sachs -- Analyst\nGood afternoon, and thank you for taking our question. I wanted to follow up on Adrienne's question and your comment about the franchise management that you're focused on for FY '25. Can you contextualize the importance of these larger classic franchises in relation to NIKE's current sales in comparison to historical averages? Do you expect to be remixed to typical franchise penetration rates by the end of the year as you scale these new innovations? And then perhaps a follow-up for Matt. Can you provide some additional color on how you're thinking about the gross margin bridge and the tailwinds that you expect from input costs and pricing relative to some of the headwinds that you see? Thank you.\nMatthew Friend -- Chief Financial Officer\nI mean, these franchises are the largest franchises in industry history. And they've gotten that way based on consumer demand. And so, we certainly started managing these franchises a couple of years ago, and what we were most focused on was the fact that we needed to restrict supply of these franchises into the marketplace because we didn't -- because we had a gap in innovation in our pipeline, which we've talked about over the last couple of calls. And so, the intentionality around managing these franchises is that newness is what's moving the consumer, and we wanted to move to more newness.\nAnd so, the significance of it is the impact that it's going to take in fiscal year '25 on our financial outlook as we're pulling the amount of supply down and creating better balance in our portfolio. And when I say that, I don't mean that lightly. I mean, better balance between performance and lifestyle, better balance between high price points and lower price points, better balance between wholesale and direct, even within wholesale between sporting goods and athletic specialty or other channels. And so, that is where our focus is.\nAnd I think the actions that we're taking and the guidance that we've provided is to follow through on those actions. And I've been at NIKE for over 15 years, and we've gone through these product cycle transitions before. And while this is challenging, and it's going to be challenging over the next couple of quarters, our history has demonstrated that when we take action, and we do it aggressively and we get behind the things that are new and we build marketing and storytelling around it, we move the consumer fairly quickly to a new place. And what we're doing here is nothing different than that.\nOperator\nOur next question will come from the line of Michael Binetti with Evercore. Please go ahead.\nMichael Binetti -- Evercore ISI -- Analyst\nHey, guys. Thanks for taking our question here, and thanks for all the details as we look out to '25. I guess as we look beyond '25, you've given us a work here, where you've got a lot of work you're going to do here. As you'll have classics cleaner, you'll have the channel mix more stable.\nYou'll have the innovation working. Can you just help us think about -- within a historical context in the past? I think you spoke to a NIKE that could grow high single digits. But I think in the future, wholesale plays more of a role. China maybe doesn't grow what it once did, so a few things like that that are kind of different than the old world.\nMaybe you can help us think about what you see as the longer-term opportunity for this business as channels, geos, and franchises come back into alignment. And then I guess just at a bigger picture, we can see the lab is back at work bringing out new technologies on the performance side. But maybe walk us through how you can use innovation and performance and how you can create the halo for lifestyle, which is really just more cyclical product. I'm curious how you guys look at the catalog and how you lean on innovation to try to drive the lifestyle stuff back to growth.\nJohn J. Donahoe -- President and Chief Executive Officer\nWell, I might just start, Michael, by saying as we get to a more -- through some of this portfolio adjustment, we still have significant tailwinds in our industry. The fact is sport is growing. The definition of sport is growing. Healthy lifestyles is becoming embraced globally.\nI was in China a couple of weeks ago. It was very striking to focus on healthy lifestyles. And so, I think there's a structural tailwind for the industry. I also think where sport happens, it's one of the derivatives of the post-COVID environment.\nYou don't have to go to the gym or the field. You're working out in your backyard or working out or taking a walk or -- so sports happening in many more places and that line between sport and lifestyle is blurring with athleisure. And so, people want to look -- have a great style while they're doing sport, and they want to have sport-inspired style when they're not doing sport. And so, we view all those things as tailwinds.\nAnd you ask about lifestyle innovation. We want to be sport-based in our lifestyle innovation, both in footwear and apparel. And we think there's a tremendous opportunity to do that across men's, women's and kids' and Jordan, Jordan streetwear being an example of it.\nMatthew Friend -- Chief Financial Officer\nYeah. I'll just finish up this question, and then I'll come back to the start, Michael, where you asked. But I would also say that the lines that blur between performance and lifestyle are really as much about how consumers are using products. The one thing that's undoubtable is that the consumer wants more comfort.\nAnd you can see that across the marketplace. Our teams are absolutely focused on fit and comfort as we bring these new iterations to market. And I think that when you look at products like Peg Premium or even the Peg 41 or the Vomero 18, I think you're going to start to see consumers carrying those over into lifestyle because they're new, they're fresh, they've got a particular look. And so, we're balancing the fact that the consumer is voting for performance and innovation, and we need to make sure that we've got performance and innovation that they can wear every day in addition to leveraging the vault that -- as I said before, leveraging the vault to bring classics back because there will always be a classics business.\nThere will always be an energy business around classic lifestyle products, and we've got a great vault to be able to leverage doing that. As it relates to your question about the long-term model, I guess, here's what I would say. We're focused on driving unit growth. And I think I said that a couple of quarters ago, and the importance of that point was that it wasn't about one particular channel or the other.\nIt's growing the overall marketplace. And so, we're focused on driving unit growth where the consumer is. And given where we see the dynamics in the marketplace right now, we're also focused on taking back market share. And we see opportunity in the performance dimensions, in particular, to come strong with a strong pipeline of innovation, to come back, and to take market share, but this product transition is going to take a little bit of time for us to work through.\nAnd so, over the course of the next couple of quarters, we're going to execute the plan that we've laid out here for fiscal '25. And at our Investor Day in November, we will provide an updated outlook on growth and profitability, taking into consideration the marketplace dynamics that we're dealing with across the portfolio, where we are in the product transition, and also some of the strategic shifts that we've put into place over the last year.\nOperator\nYour next question will come from the line of Aneesha Sherman with Bernstein. Please go ahead.\nAneesha Sherman -- AllianceBernstein -- Analyst\nThank you. I have a -- I'll start with just a quick follow-up. Matt, you talked about the challenges for the next couple of quarters on product life cycle management. Can you clarify, are you expecting this reset to be down by the end of the fiscal year? So, are you expecting to exit FY '25 at a normalized run rate on the top line without the headwind? And then second, I'm curious about where you are on the organizational reset and kind of shifting of the cost base.\nHow much of that $2 billion cost reallocation do you expect to be done with by the end of the fiscal year? Is it going to be front-loaded? Or is it going to be spread out to the next couple of years? Thank you.\nMatthew Friend -- Chief Financial Officer\nYes. No problem. So, on your first question, the actions that we're taking on NIKE Direct and Digital are more aggressive. And so, the adjustments that we're making to our plan, specifically as it relates to our own channels, are going to be largely taken into consideration in the first half of this year.\nWe will continue to manage franchises because you can picture a curve that goes up and a curve that comes down. And as the curve comes down, it doesn't happen in a moment. It happens naturally over time as consumers react to supply coming out of the marketplace. But the actions that we're taking are also causing us to look at the broader marketplace in the second half of the year and ensure that we're reducing supply there as well to maintain a healthy marketplace and also to ensure that we've got capacity in the market to bring newness in.\nSo, I mentioned that we're planning on scaling newness -- that newness is scaling as we make our way up through the year from minus 10 in the first quarter to down high single digits in the first half to finishing the year at down mid-single digits. And the largest driver of that is going to be, on a full-year basis, the scaling of newness that we're bringing to market. We expect to exit the year with momentum. And that means that we expect the new things that we're bringing to market to begin to outweigh the franchise management that we're navigating through in this year.\nAnd as we look forward to '26, we'll continue to manage these franchises in line with consumer demand. But what's going to make it -- what makes that possible is the fact that we've got more new things coming that we're driving energy around that will be more than offsetting the way that we manage those franchises.\nJohn J. Donahoe -- President and Chief Executive Officer\nAnd then, Aneesha, on your -- the second question, the way you asked that, I want to just distinguish one thing. You mentioned organizational reset. That's behind us. And as I mentioned earlier, we are now completely aligned across the organization around sport, field to play.\nAnd our teams are focused. They're excited. There's just a tremendous amount of hustle throughout the organization, and you can feel it. And so, that's going to continue.\nSo, the head count dimension of the save to invest is behind us. And now those teams are focused on driving for the consumer innovation and execution. We'll look to other areas to provide ways of savings, non-labor areas. Matt, you can describe some of these.\nBut the organization is now 100% focused on driving the growth and innovation we've been talking about through our call. And I can again just reassure you that everyone's got energy, hustle, and excitement about the future.\nMatthew Friend -- Chief Financial Officer\nYeah. I mean, we've been focused, as we've been talking about it, about building an operating model that -- with greater speed and cost productivity as we grow. And so, the actions that we've taken over the past year have enabled us the opportunity to make some bold swings in fiscal year '25. We've reallocated $1 billion into consumer-facing activities.\nThat includes teammates that we've invested in and product design, building out the merchandising function. To John's point, we have sport-focused teams now at global and in the geographies in order to be able to execute this new offense. And we're putting more of our investment dollars in demand creation while we're managing operating overhead tightly. We did that in fiscal year '24.\nYou saw even with the restructuring charge some significant effort to manage operating overhead so that we could reallocate resources as I've referenced. And while these investments will take some time to drive a return, they're absolutely the right thing for us to do to reignite brand momentum and to get us back on the offense with consumers. And so, that's what we've done, and we will continue to manage SG&A tightly, leveraging this program and this initiative to create the capacity for us to be -- to invest, to push us forward with the consumer.\nJohn J. Donahoe -- President and Chief Executive Officer\nAs we wrap up, Paul, just one -- maybe just one final comment. And this is intended for NIKE's team around the world. We -- this has been a challenging last year, and so much hard work and energy has gone into it. And I want to just thank everybody on NIKE's team globally for what -- how you've led through this and how you've operated through this.\nIt's so clear to me, and I'm saying this on behalf of Matt and Heidi and Craig and our whole leadership team. NIKE's real competitive advantage at the end of the day is NIKE's people and NIKE's culture. And so, those people and that culture is alive and well and ready to compete and hungry to drive the kind of execution and growth we've been talking about all calls. So, I just want to wrap up with thanks to everyone on NIKE's global team.\nPaul Trussell -- Vice President, Investor Relations and Strategic Finance\nThank you for joining our fourth quarter fiscal 2024 call. We look forward to hosting many of you here at the headquarters for our Investor Day in late November. More details to come. This concludes our call.\nGood evening.\nOperator\n[Operator signoff]\nDuration: 0 minutes\nCall participants:\nPaul Trussell -- Vice President, Investor Relations and Strategic Finance\nJohn J. Donahoe -- President and Chief Executive Officer\nMatthew Friend -- Chief Financial Officer\nMatthew Boss -- JPMorgan Chase and Company -- Analyst\nJohn Donahoe -- President and Chief Executive Officer\nMatt Friend -- Chief Financial Officer\nLorraine Hutchinson -- Bank of America Merrill Lynch -- Analyst\nBob Drbul -- Guggenheim Partners -- Analyst\nAdrienne Yih -- Barclays -- Analyst\nBrooke Roach -- Goldman Sachs -- Analyst\nMichael Binetti -- Evercore ISI -- Analyst\nAneesha Sherman -- AllianceBernstein -- Analyst",
  "word_count": 9598,
  "scraped_at": "2026-02-14T14:11:03.133346"
}