{
  "article_id": "f1e8edb72728",
  "url": "https://www.rnz.co.nz/news/sport/512160/how-netball-trailblazers-carved-a-place-for-women-and-girls-in-nz-sport",
  "title": "How netball trailblazers carved a place for women and girls in NZ sport",
  "date": "20240319T184500Z",
  "domain": "rnz.co.nz",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "It's been the number one sport for women and girls in this country for more than a century.\nAs Netball NZ gets ready to celebrate 100 years, Bridget Tunnicliffe looks at how the sport carved its own path, in part one of a special report.\nIn 2020 Netball New Zealand's chief executive told a special select committee - \"There is no other organisation in New Zealand with the breadth of connection with women and girls in our community.\"\nJennie Wyllie was speaking to the Epidemic Response Committee about the impact that Covid-19 was having on sport.\nNew Zealand was just starting to come out of lockdown and national sporting organisations were appealing for more financial support from the government.\nDr Margaret Henley has researched netball's impact on New Zealand society. She said it was far-reaching, with most girls introduced to the sport as young as seven.\nBy the 1920s, netball had surpassed women's hockey as the most popular sport for women and girls in New Zealand, and remarkably still is today.\nHenley - a University of Auckland senior tutor in communications - has delved into the history of the sport in Aotearoa for Netball New Zealand's centenary.\nOn 21 May, Netball New Zealand (NNZ) will become the first national netball body in the world to reach 100 years of existence.\n\"While girls today have dozens of different sports they can play, early last century there was probably two, and it depended where you lived what kind of access you had,\" Henley said.\nThere is evidence that 'women's basketball' was played as early as 1897 in New Zealand.\nHenley said netball survived because it wasn't in direct competition with male sports.\n\"It was cheap, economic, and it used space that boys did not require, which was crucial to the survival of the sport because they weren't competing for male space.\"\nHenley said the women who set up regional associations around the country were trailblazers.\n\"They rolled their sleeves up and made do with what they had. They were quite inventive, brave, and they were learning how to run organisations, often with no business background, when many women were confined to the home.\"\nHenley said they really believed that they were fighting for women to have a space in society.\n\"They were fuelled by an absolute drive to make the lives of women and girls better - healthier, stronger, more options. That sort of laid down that foundation of team sport and being active for health and they really cared about the camaraderie and friendship that came from it.\"\nIt also became embedded in the education system and has strong intergenerational links.\n\"It's not uncommon for three generations of women to attend an ANZ Premiership netball game, they are such loyal fans.\"\nWyllie said the impact netball has had on the lives of women and girls in New Zealand could not be under-estimated.\n\"It's hard to even quantify what it's done for our community. For social cohesion, the impact on physical and mental health and most importantly for me is that empowerment and confidence of young women and girls to be able to lead in many different spaces,\" Wyllie said.\nShe said it was crucial that women and girls had their own space.\n\"We can't have a community where one group continues to have sub-standard access or opportunity, it's important that women and girls are held in the same regard and are given that space to participate in sport from grass roots right through to elite.\n\"And we've grown year on year coming out of Covid, which is a phenomenal achievement. We remain crucial for participation for young women and girls in sport in our country.\"\nThe numbers game\nWhile it's facing more competition from sports like cricket, football, and rugby, netball still wins the numbers game when it comes to grassroots popularity.\nSilver Fern legend Irene van Dyk is NNZ's participation manager and said their numbers were veering towards pre-Covid.\nNetball remains the number one sport in New Zealand secondary schools, of which 96 percent of participants are female. It beats out basketball, which is second, where the majority of participants are boys.\nLast year netball was played by nearly 26,000 girls at high school, volleyball was the second most popular for girls with just over 15,000 participants, and hockey came third with 7,212 female participants.\nIn the adult space, NNZ's membership return for 2023 showed there were 138,241 registered participants.\nA further break-down shows 95 percent of netballers are female, 4.9 percent are male, and 0.1 percent are non-binary.\nNew Zealand Europeans make up 58 percent of participants, 22 percent are Māori, 8 percent Pacific Island, while Asian players make up 5 percent, and 'other' 7 percent.\n\"We need to cater for our communities and I think with our centres getting all this data it tells them a picture and they can go back and go 'look this is where we need growth, we need to pay more attention to our secondary school space or you know our male participation, we need to dig into that',\" Van Dyk said.\n\"Even with the slow decline in female physical activity we have been stable for quite some time so somewhere along the line we are doing things right. And I think the fact that our centres listen to their community and cater for their community counts for a lot.\"\nIt's also estimated that as many as 300,000 New Zealanders participate in the game annually, if you include social leagues outside of centres affiliated to NNZ.\nOther female sports have got some way to go before they could get close to those numbers.\nLast year there were 29,448 registered female rugby players in the country, a 20 percent jump on the year before when the World Cup was on New Zealand soil.\nFor the 2022/23 season New Zealand Cricket recorded a total of 36,068 female participants.\nThe total number of girls and women playing football and futsal in 2023 was 42,429.\nA sport taken seriously\nFormer Silver Fern Joan Hodson remembers when the national Swiss Maid league was put on TV in the 1980s.\n\"This was the first kind of national club league, it was so exciting, it was all so new, Bendon came on as a sponsors and it was a thrill watching your games on TV.\"\nHodson said it helped give legitimacy to the sport.\n\"You got to see a lot of the big stars like Yvonne Willering, Tracey Fear, Margaret Forsyth, that group.\"\nDame Lois Muir was in charge of the Silver Ferns from 1974 to 1988 and became synonymous with netball.\nThe formidable coach was at the forefront of netball's rise in profile within New Zealand and was recently named in the first intake of inductees to the Netball New Zealand Hall of Fame.\nBy the time the Silver Ferns went to the 1987 World Champs, which they would go on to win, there was a lot more media coverage of netball.\nAnother turning point that took the game to a higher level was the 1991 World Cup in Sydney, when the Silver Ferns and Australia played a cliff-hanger final during prime time TV.\nPeople were able to watch the tournament on TVNZ and the final drew a huge audience, including people outside the sport who started to appreciate the athleticism of the players.\nAuckland University professor of sports sociology Toni Bruce has studied media coverage of women's sport and said netball was still by the far the most covered female sport in New Zealand.\nAnd she said journalists treated it much the same way as they treated men's sport, which was quite unusual for women's sport.\n\"During the ANZ Premiership for example the coverage is regular, and it's everything from match reports to providing rigourous analysis, and reporting on injuries, coach changes, and scandals,\" Bruce said.\nBruce said the way netball was put under the microscope demonstrated a level of respect for the sport.\n\"Whereas what's happened with other women's sport even in recent times, is that there's been this massive coverage of 'yay women's sport is taking off, wow lots of people came to watch them play' but it's not directly translating into regular coverage of the actual games or analysis, what I would call normalised media coverage.\n\"Netball reached that status in the New Zealand media some time ago of being a premier sport, which deserved coverage and should be looked at critically.\"\nA leadership academy\nOn the back of an outstanding career in sports governance and administration, former NNZ Board chair Kereyn Smith was also recently named in the Netball New Zealand Hall of Fame.\nSmith spent 11 years on the board, closely followed by her five-year term as World Netball Vice President.\nSmith joined the board in the mid 1990s and during her tenure helped guide the transformation of the sport from an amateur to semi-professional status.\nAfter stepping away from netball she became the CEO and Secretary General of the New Zealand Olympic Committee, served as a commission member for the International Olympic Committee, and until recently was vice president of the Commonwealth Games Federation.\nSmith said netball governance was a perfect training ground.\n\"For a young female leader and somebody that was kind of ambitious and loved doing what I do, netball was a great place for leadership development, it was like a women's leadership academy really, that was part of my acceleration of leadership,\" Smith said.\nShe said netball was a trailblazer for other female sports in New Zealand.\n\"It was the first sport for women to get on TV and that was quite a big deal. And as a sport we had to go through quite a significant change in the 1990s, that was a major milestone. We changed the model for the way the sport was organised, there were more people employed to run the game.\"\nNetball was created by women for women and girls when very little opportunities existed and Smith said that was grounded in its culture.\n\"Of course now there is growth in men's and boy's netball, which is important to meet the needs of the future. However that's not where it started and that's not netball as I experienced it.\"\nAs someone who was at the helm when the sport went through significant change, does Smith think netball needs to adapt again to ensure it stays in a strong position?\n\"I guess it's almost like one of those times now.\n\"Since coming into the 2000s that was a pretty big milestone for the sport and that kind of evolved into the trans-Tasman league and then for various reasons that discontinued.\n\"My sense of it is that there is now an appetite and almost a desire to have a bit of a freshen again in what's available for elite netballers given the other options out there from competing sports.\"\nIn Part II, Bridget Tunnicliffe looks at netball's new battle ground - the competition with other female codes.",
  "word_count": 1831,
  "scraped_at": "2026-02-14T12:07:26.906131"
}