{
  "article_id": "f1f85828bc42",
  "url": "https://www.dailystar.co.uk/tv/strictlys-karen-carneys-secret-dance-35993517",
  "title": "Strictly Karen Carney secret dance past exposed by Lioness legends",
  "date": "20251001T093000Z",
  "domain": "dailystar.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Strictly's Karen Carney's secret dance past exposed by Lioness legends\nEXCLUSIVE: The professional footballer's former teammates have revealed her secret history with dance.\nTwo Lionesses legends have revealed Strictly Come Dancing sensation Karen Carney's secret dance background.\nThe former England star left audiences and judges gobsmacked with her Jive to One Way or Another alongside partner Carlos Gu during Saturday's opening live show.\nShe shattered an 18-year record by bagging 31 points and claiming top spot on the leaderboard - the first footballer to achieve this feat in nearly two decades - whilst Shirley Ballas gushed: \"It was just sensational, best dance of the night for me.\"\nKaren had previously confessed she felt somewhat outside her comfort zone, and following the overwhelming response, she modestly remarked: \"Everyone did a great job, it's been an amazing show, it's been an honour and I'm really emotional.\"\nREAD MORE: Kate Garraway says Celebrity Traitors helped Derek Draper grief 'come out'READ MORE: Strictly Come Dancing's Karen Carney opens up on secret injury saying 'it wasn't great'Yet two individuals who know her well have now hinted that whilst Karen's Jive brought the house down, we ought to be crossing our fingers for her breakdancing skills to grace the ballroom, reports Coventry Live.\nPrior to the UEFA Women's Champions League broadcasting live on Disney+, presenting duo and former Lionesses Fara Williams and Lianne Sanderson disclosed Karen's dancing heritage.\nChatting exclusively before the tournament's launch, with all 75 fixtures scheduled to stream on Disney+, Fara disclosed: \"Kaz used to body pop! I'm not sure she's put this story out, but Kaz is a body popper, so she's got rhythm anyway. Kaz can dance!\n\"This is a different type of dancing, but I'll tell you what Kaz is, she's very dedicated, and if you're going into something you have to fully commit to it, and that's something Kaz will do.\n\"She'll fully commit to it, she'll use every minute that she can trying to get her dance routines perfect because that's the type of person she is.\"\nThe ex-Everton midfielder went on: \"We already know she has quick feet, as a footballer, her feet are amazing and I didn't think she'd still have it at her age and being five years retired now, her feet were amazing.\n\"We're all rooting for her and hopefully she can win it.\"\nLianne shared similar thoughts, remarking: \"Kaz has always been a good dancer; she can body pop and everything.\n\"People forget that, but those of us that have been her teammates, I've seen Kaz can move, she can break dance!\n\"She can do all that, spinning on her head and all that, but I've never seen her do stuff like that, so it was amazing, an amazing performance.\"\nWhen asked if she thinks Karen surprised herself following her modest reaction, Lianne added: \"She's one of those quiet ones, the silent assassin, because I've always known she could move, so I'm not surprised that she's doing well on Strictly.\n\"Like I said, I expect her to do some hip-hop stuff as well, she's a fantastic hip-hop dancer.\"\nFara and Lianne are now joining forces with the likes of Alex Scott and commentator Vicki Sparks to present the UEFA Women's Champions League on Disney+, available to all subscribers.\nTalking about making the game more accessible, Vicki shared: \"I think it's absolutely massive that the visibility of the game is being increased in this way by Disney+.\"\nShe continued: \"To have it on a regular platform, a platform as big as Disney+, a platform that is so used to telling stories and shaping those narratives and seeing what's going to unfold, it's so exciting.\n\"It's going to bring the women's game to more people and that's what we want because the more people see it, the more people are inspired and little girls who have maybe not thought about football before but are watching Moana or Frozen and think 'Oh I'll put this on', and then suddenly as well as Elsa and Anna, you've got these footballers that become these heroines for these young girls and inspire them to do something they've never thought of doing before and maybe change their dreams.\"\nThe UEFA Women’s Champions League kicks off on 7 & 8 October, with every game live on Disney+ as part of existing subscriptions",
  "word_count": 721,
  "scraped_at": "2026-02-14T13:06:56.319176"
}