{
  "article_id": "f211bef06dd0",
  "url": "https://www.irishfa.com/news/2025/august/nipw-ballard-has-black-cats-purring",
  "title": "NIPW | Ballard has Black Cats purring",
  "date": "20250818T134500Z",
  "domain": "irishfa.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Northern Ireland defender Daniel Ballard marked his Premier League bow with a superb headed goal as Sunderland got their season off to a magnificent start with a 3-0 home win over West Ham United.\nThe former Arsenal man, who lined up alongside his international colleague Trai Hume in the Black Cats' first Premier League game since 2017, was immense at the heart of the Sunderland defence as they got their campaign off to a flyer.\n“The lads were so focused. We’ve had this game in the back of our minds for six weeks now,” he told safc.com.\n“The lads were ready. We matched them toe-to-toe and we had that little bit of quality in the final third which was the difference.\"\n“I didn’t quite expect to score today,” he added. “I thought I might have to wait a while for my next one but I’ve been working on it a lot in the last few days.\n“That second phase around the back post is something we’ve worked on. It was a great ball in and I was delighted to score again. It was a fantastic feeling.”\nElsewhere in the Premier League Justin Devenny played the final six minutes as a substitute as Crystal Palace held on for a deserved draw at Chelsea, however Conor Bradley missed Liverpool’s thrilling 4-2 home success over AFC Bournemouth on Friday night through injury.\nIn-form West Brom midfielder Isaac Price hit a brace as the Baggies recorded their first league win away from home since November last year with a 3-2 victory at Wrexham.\nThat’s now three goals in his opening two league games for the 21-year-old who, prior to the Championship clash with Wrexham, told Sky Sports how manager Ryan Mason has started to get the best out of him.\n“I think the gaffer’s given me a lot of freedom since I joined,” Price explained. “I think his ideas have been clear since he came in.\n“He watched a lot of my games for Northern Ireland, which obviously helped, and he sees me as a number 10. The freedom that I’ve had has given me confidence to get more goals and assists.”\nAlso in the Championship winger Paul Smyth made his first appearance of the season in QPR’s 2-1 defeat at Watford, while Ethan Galbraith was again an influential figure in the Swansea City midfield as they chalked up their first league win of the season after overcoming Sheffield United 1-0 at the Liberty Stadium.\nMeanwhile, in League One, Josh Magennis came off the bench to score a consolation penalty in Exeter City’s 2-1 home defeat to Mansfield Town, though Blackpool’s new striker Dale Taylor is still awaiting his league debut for the Tangerines after remaining as an unused substitute against Huddersfield Town.\nIt has been quite a week for midfielder Brad Lyons, who celebrated the birth of his son Theo and also scored the winner for Kilmarnock with a superb volley in their Scottish League Cup success against Dundee United on Sunday.\n“Brad’s had a turbulent four or five days,” said Killie boss Stuart Kettlewell. “But he’s come back in really, really focused to try and have an impact on the game, which he has done.\n“So we’re delighted for him as a football club. But Brad’s known as soon as the baby’s here safe that he moves on to his job and, credit to him, he’s been first class in that.”\nThe U18 Premier League in England started over the weekend and there were debuts for a number of players who came through the Irish FA JD Academy. They were: Kalum Thompson (Nottingham Forest), Matthew Burns (Sunderland), Callum Leacock and Joel Kerr (both West Ham) and Glenn McCourt (Norwich City).\nFinally, Keri Halliday (Hearts) and Alexandra Clarke (Aberdeen) both made their debuts for their new clubs following their moves to the Scottish Women’s Premier League over the summer.",
  "word_count": 646,
  "scraped_at": "2026-02-14T13:32:43.153540"
}