{
  "article_id": "f221749d3e51",
  "url": "https://www.prnewswire.com/news-releases/north-carolina-courage-announces-first-horizon-bank-as-stadium-naming-partner-302335443.html",
  "title": "NORTH CAROLINA COURAGE ANNOUNCES FIRST HORIZON BANK AS STADIUM NAMING PARTNER",
  "date": "20241218T220000Z",
  "domain": "prnewswire.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Team to play at First Horizon Stadium at WakeMed Soccer Park starting in 2025\nCARY, N.C., Dec. 18, 2024 /PRNewswire/ -- The North Carolina Courage and the Town of Cary today announce First Horizon Bank (NYSE: FHN) as the naming rights partner for the 10,000-seat stadium located inside WakeMed Soccer Park. This multiyear partnership officially titles the Courage home as First Horizon Stadium at WakeMed Soccer Park.\nThe stadium naming deal expands the highly successful partnership with First Horizon Bank, which became the Courage's first official banking partner in 2024. The naming rights are exclusive to the stadium, while WakeMed retains sole naming rights to the wider park. The stadium is also home to North Carolina FC of the USL Championship and hosts various collegiate and high school sporting events throughout the year, including the NCAA Division I College Cup.\nThe expansion includes planned investment in permanent branding around the stadium and newly constructed signage outside of the stadium's northeast gate main entrance.\n\"First Horizon Bank has been a tremendous partner, and we're excited to expand our relationship in 2025. When we first announced our official banking partnership, we spoke of our joint mission to impact our community. Enhancing the soccer experience for our players, fans and staff is a massive piece of those efforts. We're pleased to see a swift desire to deepen our brand alignment and look forward to an even bigger partnership with a community-focused company like First Horizon Bank,\" said Courage President Francie Gottsegen.\n\"The Town of Cary is excited to begin this new chapter with First Horizon Bank and the North Carolina Courage. The partnership not only reinforces Cary's reputation as a premier destination for sporting events, but also underscores our shared commitment to providing our citizens and fans with high-quality facilities and special experiences they won't find anywhere else,\" said Town of Cary Mayor Harold Weinbrecht.\n\"At First Horizon Bank, we are proud to expand our partnership with the North Carolina Courage by introducing First Horizon Stadium,\" said Laura Bunn, Mid-Atlantic Regional President for First Horizon Bank. \"This Stadium represents more than just a name; it's a reflection of our shared commitment to community, growth and excellence – particularly in support of women's sports. First Horizon Bank is thrilled to deepen our connection to the team and its fans as the 'Official Bank of the North Carolina Courage'. We look forward to creating memorable moments in a space that embodies the spirit of the game and the greater community we serve.\"\nThe Courage and First Horizon Bank will host a ribbon-cutting ceremony upon completing the planned stadium enhancements in early 2025. For more information on the 2025 schedules for the North Carolina Courage and North Carolina FC, visit www.nccourage.com and www.northcarolinafc.com.\nAbout the North Carolina Courage: Competing in their eighth season of competition in 2024, the Courage began play in the National Women's Soccer League (USSF Division I) in 2017. The Courage were formed when Steve Malik purchased the Western New York Flash and relocated the franchise to Cary, North Carolina. The team plays home matches at WakeMed Soccer Park and is the winningest club in NWSL history, claiming seven league trophies as three-time NWSL Shield winners (2017, 2018, 2019), two-time NWSL Champions (2018, 2019), and two-time UKG NWSL Challenge Cup champions (2022, 2023). The Courage also won the 2018 ICC Championship. Follow the Courage on the web at www.nccourage.com and on social media @TheNCCourage.\nAbout Cary, North Carolina: With excellence and innovation in its DNA, Cary is a thriving community of over 187,000 people representing more than 60 nationalities at the heart of North Carolina's renowned Research Triangle region. The Town consistently ranks among the most desirable places to live, work, have fun, and do business in the United States. Known for its safe neighborhoods, extensive network of bike-friendly parks and greenways, environmental stewardship, robust business climate, and premier sports venues, Cary remains a place of inspiration and opportunity. With a \"people first\" philosophy, this local government values collaboration, experimentation, learning, and adaptation, making Cary an exceptional place to call home and an inspiring destination for visitors.\nAbout WakeMed Soccer Park: WakeMed Soccer Park is the Town of Cary's 158-acre state-of-the-art facility renowned for hosting premier soccer events at all levels. Since 2004, it has evolved into a central hub for professional, collegiate, and community soccer. Home to professional teams North Carolina Football Club and the NC Courage, the complex is designed to support a wide range of events, from international tournaments to local festivals, as well as sports, from high school football to polo.\nFirst Horizon (NYSE: FHN), with $82.6 billion in assets as of September 30, 2024, is a leading regional financial services company, dedicated to helping our clients, communities and associates unlock their full potential with capital and counsel. Headquartered in Memphis, TN, the banking subsidiary First Horizon Bank operates in 12 states across the southern U.S. The Company and its subsidiaries offer commercial, private banking, consumer, small business, wealth and trust management, retail brokerage, capital markets, fixed income, and mortgage banking services. First Horizon has been recognized as one of the nation's best employers by Fortune and Forbes magazines and a Top 10 Most Reputable U.S. Bank. More information is available at www.FirstHorizon.com.\nSOURCE First Horizon Bank",
  "word_count": 878,
  "scraped_at": "2026-02-14T12:48:47.017221"
}