{
  "article_id": "f22eab0edaae",
  "url": "https://www.bbc.com/news/articles/cd16xydp1gpo",
  "title": "Wiltshire football physio calls for change after  vile  abuse",
  "date": "20240718T094500Z",
  "domain": "bbc.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Football physio calls for change after 'vile' abuse\nA football physio who was bombarded by \"vile\" and \"absolutely shameful\" comments online has called for change.\nIssy Anderson became the target of trolls after Shrewton United Football Club posted online that she was their newest member of staff.\nThe club supported her and quickly deleted the post, but Ms Anderson believes \"misogyny towards women should be addressed more widely within the sport\".\nShe said: \"If more people speak out about [abusive] comments, hopefully more clubs will call out this behaviour.\"\n'Complete strangers'\n\"There are great things going on with women's sport and football, but a lot of women feel they can't go to someone and say 'I've had this done to me' and expect support, that's the frustrating part.\n\"I think it should come from the clubs,\" added Ms Anderson.\nDespite considering herself to be \"tough-skinned\", she admitted going to the next match was \"difficult\".\n\"The day after the post my phone was just going completely crazy, just lighting up all the time: I got about 1.2 million views,\" she told BBC Wiltshire.\n\"I almost felt like I didn't want to be here because everyone had seen it [the social media posts] and I felt people were looking at me and I just wanted to get on with the job I love.\"\nShe said it was \"comforting how the club dealt with it straightaway\".\n\"They weren't confused about what to do, they thought this behaviour isn't OK for any female [to face],\" she said.\nMs Anderson said she did not believe the comments were from genuine football fans.\n\"They were just random people online. I don't know where they were from.\n\"I think there were a lot from different countries as well, but complete strangers,\" she added.\nShrewton United put out a statement after deleting the original post: \"It’s disappointing to have read so many harmful comments towards our newest member of the team and we won’t allow her to be subjected to such vile comments.\n\"Football is a game for everyone.\"\nThe club has now partnered with the campaign group Her Game Too, which aims to tackle sexism and promote gender equality within the world of sport.\nIt was founded in 2021 by 12 female football fans, who had all been subjected to sexist comments while supporting their clubs.\nThe group reached out to offer support to Ms Anderson and the club in the aftermath of the incident.\nAccording to its Facebook page, Shrewton United has now joined 73 Premier League and English Football League clubs, as well as hundreds of other non-league and grassroots clubs, leagues and organisations, as an official partner.\nCaz May, founder of the campaign, said: \"We felt it was necessary to reach out and offer our support to both Issy and the club after the inappropriate and unacceptable comments she received after the announcement of her new role.\n“The club was quick to respond and become affiliated with Her Game Too and we look forward to working with them further.\"\nShrewton United said the decision to delete the original post gained a lot of attention online, including from former Chelsea First Team doctor Eva Carneiro, who herself received sexist comments from fans.\nMs Carneiro posted: \"The problem with deleting and not looking to ban or discipline the abusers supports the misogynists and their philosophy that women in football should never be visible and nothing ever changes.\n\"Women in football should not need, or be told, to hide.\"\nShrewton United, formed in 1946 just after World War Two, are based in Shrewton, a village near Amesbury in Wiltshire.\nThey play in the Wiltshire Senior League Premier Division, which is step 11 of the English Football League pyramid.\nFollow BBC Wiltshire on Facebook, X and Instagram. Send your story ideas to us on email or via WhatsApp on 0800 313 4630.",
  "word_count": 644,
  "scraped_at": "2026-02-14T12:57:58.403427"
}