{
  "article_id": "f22e5c2c7376",
  "url": "https://onwardstate.com/2024/03/28/womens-history-month-five-influential-penn-state-alumnae/",
  "title": "Women History Month : Five Influential Penn State Alumnae",
  "date": "20240328T083000Z",
  "domain": "onwardstate.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Women’s History Month: Five Influential Penn State Alumnae\nIt’s one of our school’s favorite fun facts: Penn State has the largest alumni association in the country. Penn State was founded in 1855, and since then, millions have graduated from the school. Today, there are over 750,000 living alumni across the world.\nTo celebrate this year’s Women’s History Month, here’s a list of five influential female Penn State alumnae.\nLisa Salters\nAlisia “Lisa” Salters was born on March 6, 1966, in King of Prussia, Pennsylvania. Salters graduated from Penn State with a bachelor’s degree in broadcast journalism in 1988 and played guard for the Lady Lions basketball team from 1986 to 1987. She still holds the record of being the shortest player in school history, standing at just 5’2″.\nSalters has reported on major events such as the O.J. Simpson trials, the NBA Finals, and the FIFA World Cup, which earned her a nomination for a Sports Emmy Award in 2008. Salters continues to excel as a lead sideline reporter for ESPN’s Monday Night Football. She will be headlining the Penn State Forum speaker series on Friday, March 29.\nLara Spencer\nLara Christine Von Seelen, professionally known as Lara Spencer, is a distinguished American television presenter renowned for her role as co-anchor on ABC’s Good Morning America. She was born on June 19, 1969, in Long Island, New York.\nSpencer graduated from Penn State in 1991 with a bachelor’s degree in broadcast journalism after spending four years on an athletic scholarship as a nationally-ranked member of the swim and dive team. Spencer’s journey in journalism began with her coverage of notable events such as the TWA Flight 800 crash, propelling her to national prominence.\nBeyond her television career, Spencer is an accomplished author, producer, and advocate for interior design, reflecting her multifaceted talents and commitment to engaging storytelling.\nLinda Yaccarino\nLinda Yaccarino, born on December 21, 1963, is an esteemed American media executive. Originally from Deer Park, New York, Yaccarino graduated from Penn State in 1985 with a bachelor’s degree in telecommunications.\nShe had previously held the position of chairman of global advertising and partnerships for NBCUniversal. In June of 2023, she succeeded Elon Musk as the chief executive officer of the platform X (formerly known as Twitter).\nYaccarino has also served as a presidential appointee, working under Presidents Donald Trump and Joe Biden. Under Trump, she served on the President’s Council on Sports, Fitness, and Nutrition, while she promoted the COVID-19 vaccine under Biden.\nValerie Elise Plame\nValerie Elise Plame, born on August 13, 1963, is a distinguished American writer, spy novelist, and former Central Intelligence Agency (CIA) officer. She graduated from Penn State University in 1985 with a B.A. in advertising but took a different career path and joined the CIA as an officer.\nDuring Plame’s career in the CIA, she was involved in counter-proliferation efforts, operating under non-official cover in locations such as Athens and Brussels. Her career as a spy was cut short in 2003 after a journalist for the Washington Post exposed her position, and this became known as the Plame Affair.\nAfter this, Plame transitioned into writing, which included a memoir and several spy novels. Recently she has delved into politics, running for New Mexico’s 3rd congressional district in 2020.\nBritt Baker\nMulti-talented American professional wrestler and dentist Brittany Ann Baker was born on April 23, 1991, in Punxsutawney, Pennsylvania. She graduated from Penn State in 2013 with a degree in behavioral medicine.\nShe then embarked on a “dual journey,” pursuing both professional wrestling while also studying dentistry at Pitt’s School of Dental Medicine, where she graduated in 2018.\nBaker made history as the first woman signed to All Elite Wrestling (AEW) and has also been awarded the title of AEW Women’s World Champion.\nYour ad blocker is on.\nPlease choose an option below.\nPurchase a Subscription!",
  "word_count": 642,
  "scraped_at": "2026-02-14T12:31:43.061309"
}