{
  "article_id": "f27eec9bf3e4",
  "url": "https://www.hollywoodreporter.com/feature/natalie-portman-cannes-may-december-times-up-1235483130/",
  "title": "Natalie Portman Talks Cannes , May December , Time Up , Luc Besson – The Hollywood Reporter",
  "date": "20230511T033000Z",
  "domain": "hollywoodreporter.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Natalie Portman at Cannes: “I Need to Leave the Drama for the Screen”\nAt the festival for her role in Todd Haynes’ 'May December,' the actor, producer and budding soccer mogul talks \"amoral art,\" her complicated feelings about Luc Besson and the “heartbreaking” implosion of Time’s Up: \"Mistakes are deadly for activism.\"\nIn a scene late in Natalie Portman‘s new movie, May December, she’s talking with the faintest lisp, somehow playing a moment as both fragile and predatory. Portman’s performance in the scene is striking not just for how uncomfortable it is, but because it’s an uncanny re-creation of a character that Julianne Moore has been playing for the entire movie up to that point. In the drama from director Todd Haynes, which will premiere in competition May 20 at Cannes, Portman is Elizabeth, an actress doing research to play Gracie (Moore), a woman at the center of a decades-old tabloid scandal, married to a man (Riverdale‘s Charles Melton) 23 years younger than she is. May December is an opportunity for the star of dark films like Black Swan and Léon: The Professional to dig into an old obsession.\n“I’m very curious about performance,” Portman says. “It’s a topic that’s interested me and that I feel like I return to a lot in my work. The question of ‘Can art be amoral?’ ”\nThe drama, which is seeking distribution at the festival, is the first film from Portman’s new company, MountainA, with her French producing partner, Sophie Mas. With Haynes, MountainA is debuting with the ultimate actress’ director: His 2002 drama Far From Heaven earned Moore an Oscar nomination; Cate Blanchett and Rooney Mara both collected them for his 2015 film Carol; and Blanchett also earned a nom for his 2007 movie I’m Not There.\nMountainA’s opening TV project is tonally as far from May December as can be, but the two are linked in centering women outside traditional roles. Angel City, a docuseries premiering May 16 on HBO Max, follows the first year of L.A.’s Angel City Football Club, the National Women’s Soccer League team that Portman co-founded. Later this year, the company will roll out the limited series Lady in the Lake, part of its first-look deal with Apple TV+, in which Portman plays a housewife turned journalist.\nIn April, during a wide-ranging interview in Los Angeles, Portman, 41 and a mother of two, spoke with THR about her new company’s guiding ideals, what she’s learning from running a sports team, what went wrong at Time’s Up and what advice she’d give another child actor starting out: “Treat it as a game.”\nAt the end of the movie, when your character, the actress, is playing the role she’s been preparing for, you’re actually playing Julianne Moore playing the role. How did you prepare for that?\nWe didn’t have any rehearsal time, and I knew that I was going to have to slowly morph into Julianne, and I didn’t know what she was going to be doing — I had no idea. I was like, “Is she going to do something that I can hold onto, that I can use, mimic?” And thank God she just came with this complete full concept of this person, which also had some very idiosyncratic aspects like the lisp and the whole voice she was doing, and the way she talked was really helpful to have something for my character to evolve into.\nSo you didn’t text her beforehand and say, “Can you send me a voice memo of how you’re going to play this lady, so I can …”\nWell, I was definitely curious, but I didn’t know her that well yet, and also, you don’t want to pressure another actor to give away their whole hand while they’re still working on it.\nWhen I saw that the film is called May December, I assumed it would be a younger woman and an older man. Were the gender dynamics of the film — where we see a woman as the aggressor in a relationship with a younger person — part of what interested you?\nIt’s definitely interesting to see crimes that are generally committed by men committed by a woman. It’s the exceptions to the rule that are most interesting, and what would make a woman do that? Whereas, with a man, everyone’s kind of like, “Oh, all men are like that.” It definitely has more of a specific psychology that’s more interesting.\nIt could not be more different from your Angel City docuseries in terms of tone, but both projects are female-forward. If there’s an operating principle for MountainA, is that part of it?\nWhere it’s united is, how can we see as many different versions of women as possible? And I think that’s where you get to equality, where women can be anything. They can be criminals, virtuosic athletes, brilliant, not brilliant. I think when you get the more variety, the more expression, there’s more possibility.\nYou co-founded Angel City with venture capitalist Kara Nortman, whom you met through some of your activism, and tech entrepreneur Julie Uhrman. How did you come to be the co-founder of a soccer team?\nIt’s a very weird story, but my son is really passionate about football, and when he was 7, it was the Women’s World Cup and he was as passionate as he had been about the previous Men’s World Cup. He was as passionate about the women as the men, and I was just watching him and I was like, “This is a revolution if young kids grow up idolizing female athletes the way they idolize male athletes.” And it’s so evident we have the stars. These women are absolute stars, and so why, when they play on their home teams in the league, does no one even know it exists? You have the most popular sport in the world, the best players in the world in the U.S., and it’s completely invisible.\nAre there parallels between what female athletes face in professional sports and what women in the entertainment business face in terms of barriers?\nDefinitely. People will use the evidence of the box office or game attendance or viewership and be like, “This is why you get paid less.” You’re like, “Well, did you advertise the same? Did you invest in it the same? Did you promote it the same? Did you give it the same slots?” For soccer, “Did you broadcast it in the same time slot?” With movies, “Did you put it out in the same number of theaters? Did you spend the same on advertising?” When you do invest the same, then you can actually be like, “OK, put it next to each other.” You actually have to give it the same chance. So it feels like a very, very familiar world.\nWhat will success look like?\nWell, I think we already feel it by, we’re selling out our games. We have 16,000 season tickets sold. The sponsorship and the broadcasting deals for the league are central to our understanding of the success. Then, of course, also we’d love to make the playoffs, win the playoffs at some point. That would be a long-term goal, to see the team thrive athletically.\nListen, men’s football internationally is one of the biggest businesses in the world. It’s the most popular thing everywhere you go. So to bring women up to that level of viewership is the goal — to make these billion-dollar teams. That’s how you get the women valued as they deserve, but I think there’s all the ingredients there to do it and it’s the biggest growth market in sports in general — to have the most popular sport with an audience that is ready and rabid for it, to give them what they want.\nHow has MountainA prepared for a writers strike?\nWe’re aware that a lot of the projects we were taking out to pitch or are in progress on are kind of stalling now, but of course we support the decision to strike. And we support writers getting what they deserve. We’re hoping for everybody that it doesn’t last too long.\nOn Women Talking last year, Sarah Polley made an effort to have a set where cast and crew could have a family life during production. Are you seeing the industry evolve at all in that way?\nThat’s something that I see a lot in France, and I think it’s why the entire new generation of French filmmakers is female, because it’s really possible. Not that every woman has kids or wants kids, but it makes it possible to be a director and to have children and be a good parent. You have a strong social system that has child care, and the workday hours are normal. We shot Jackie in France, and I did a French film called Planetarium as well. I was home every day for dinner at 6 p.m. — just completely life-changing. When you make a film or a series in the U.S., you’re just gone. You’re just gone, and it’s really hard on all parents.\nHow do you talk in your house about climate change?\nWe talk about it a lot in our household in terms of how we live, what we choose to do. My veganism is in large part an environmental choice, along with animal welfare. I haven’t bought or used any leather or fur or animal products in 20 years. I use a car-share app that is all electric cars. I buy vintage clothes, and only if absolutely necessary, and of course repair damaged items, most recently a handbag, rather than buy a new one. When we travel, we try to organize our trips to places we can go by train; or if we have to fly, to stay long enough to justify the travel. The library plays a big role in the family consciousness as well — a place where we can get joy and greater selection by sharing and not owning. It’s a process, and clearly imperfect, but the consciousness is there.\nYour company is making a series, Lady in the Lake, based on a crime novel by Laura Lippman, for Apple TV+, and you play a housewife turned investigative journalist in 1960s Baltimore. What’s her deal?\nI guess almost every story about a woman is about her trying to get free. So she’s trying to get free but doesn’t realize that her process of getting free is stepping on another woman’s ability to be free. [Director and co-writer] Alma [Har’el] and I both were drawn to it because of the tragedy of oppressed people not being able to recognize other people’s oppression, that you can get so caught up in being like “But I’m the oppressed” that you can contribute to someone else’s oppression.\nYou were a key figure in the early days of the Time’s Up movement, which started with so much promise. But now, apart from the Time’s Up Legal Defense Fund, the organization has effectively disbanded. Why do you think that happened, and how do you feel about the future of gender activism in Hollywood?\nIt was really, really heartbreaking that Time’s Up dissipated the way it did. I think a lot of people made mistakes, but mistakes are deadly for activism. You have to be so perfect in order to demand the change that you want to see, and I don’t know, maybe acknowledging all our imperfection as humans and saying that people can do something wrong and also be good at something else, having a little bit more shades of gray might actually let us get to more progress. There was something so powerful about just gathering women with similar experiences and sharing. And so many amazing things have spun off it that I think those relationships have persisted and have turned into incredible other projects, but it still is painful that Time’s Up doesn’t exist anymore as it was. For an entire movement to not be allowed to exist because of individual mistakes or even collective mistakes, I think that we have to be able to make mistakes and learn from them and allow that.\nIt’s a great silencing mechanism to hold people up to perfection standards because then everyone’s like, “Well, I shouldn’t say anything because I’m not perfect.”\nHow did you feel when you heard women were making allegations of sexual abuse by Luc Besson?\nIt’s devastating.\nWere you surprised by them?\nYeah, of course. I had never … Yeah.\nYou said “yeah,” but you shook your head “no,” so I just want to make sure I understand your perspective on this. Luc was a crucial figure in your career and the career of other young women. Do you think there was any indication that —\nI really didn’t know. I was a kid working. I was a kid. But I don’t want to say anything that would invalidate anyone’s experience.\nHow the public received that role in Léon: The Professional was complicated for you as a young woman.\nIt’s a movie that’s still beloved, and people come up to me about it more than almost anything I’ve ever made, and it gave me my career, but it is definitely, when you watch it now, it definitely has some cringey, to say the least, aspects to it. So, yes, it’s complicated for me.\nYou’ve been to Cannes multiple times over the years, on the jury, as an actor and as a director. How has the experience been for you?\nYes, we premiered Star Wars: Episode II there, and I had a shaved head because I was doing V for Vendetta. So I went to Cannes with a shaved head that year. That was wild. And I had a movie that year in competition, Free Zone. That was fun. Everyone was just rubbing my head like I was their troll doll. Troll doll minus the hair.\nDo you have any Cannes rituals?\nI love going to La Colombe d’Or and of course du Cap for some fancy, fancy drinks. And I’ll hopefully either find or make a dance party somewhere.\nHow do you feel about Cannes’ history with women?\nI think that it’s something that they’re responding to now, which I’m happy that they’ve been pressured to do so. I obviously wish it were a lot farther along.\nThis year sees the most female directors they’ve ever programmed. But they’re also opening with a Johnny Depp movie, which some people are side-eyeing. Do you have an opinion on that?\nI haven’t read much about that. But it can always be better. We will keep pushing for it to be better.\nWhat’s your opinion on Israeli Prime Minister Benjamin Netanyahu right now? How are you feeling watching the state of democracy in Israel?\nIt’s terrible. I’ve never supported him, and it’s definitely not what my grandparents hoped for.\nI feel like because you are willing to engage on these subjects and because you do know what you’re talking about, people assume that you’re super serious. And I’m curious if you feel that way.\nPeople often tell me they’re surprised that I’m silly. But most people who know me well know I’m a pretty goofy person. Some people are surprised that I will be joking around before doing a very serious scene, but it’s part of how I function well. I need to leave the drama for the screen. That’s not to say that there’s not a serious approach to the work and an intense focus to it. It’s just that silliness helps the flow and also the feeling of safety and comfort that allows me to be bare when I need it.\nWhat are the acting roles you want but haven’t gotten to play yet?\nI really wanted to do a voice in an animated film, which I’ve been working on, which I’m really excited about. I’ve never gotten to do that. And I’d love to do a comedy.\nWhen you see young actors starting out at the age that you were when you were starting out, do you ever find yourself wanting to whisper some advice in their ear?\nYeah, I always want to tell them to treat it as a game more than a job because I don’t think kids should really have jobs.\nFor you, was it a game or was it a job?\nIt was fun. I definitely knew how to take things seriously as a kid, but I loved it. I really, really loved it.\nInterview edited for length and clarity.\nThis story first appeared in the May 10 issue of The Hollywood Reporter magazine. Click here to subscribe.\nNatalie Portman Hair: Adam Campbell at The Wall Group. Makeup: Kayleen McAdams at A-Frame using Dior Forever Foundation in #2N, Dior Prestige La Crème Fine & Dior Vernis. Manicure: Ana Morcillo. Location: Dil Studios.",
  "word_count": 2812,
  "scraped_at": "2026-02-14T12:39:37.230428"
}