{
  "article_id": "f28bfa3bfe7f",
  "url": "https://www.fox7austin.com/news/madison-sheahan-ice-deputy-director-resigns-run-congress",
  "title": "Madison Sheahan , ICE deputy director , resigns to run for Congress",
  "date": "20260116T011500Z",
  "domain": "fox7austin.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Madison Sheahan, ICE's deputy director, resigns to run for Congress\nMadison Sheahan, the deputy director for U.S. Immigration and Customs Enforcement (ICE), is leaving her role to run for Congress in Ohio.\nSheahan, a close ally and former political director for Homeland Security Secretary Kristi Noem, made the announcement Thursday.\nWhy did Madison Sheahan resign from ICE?\nSheahan, 28, said she’s resigning from ICE’s No. 2 position to run in Ohio’s 9th Congressional District. She has launched a new campaign website that says she’s \"fighting to protect American jobs, American paychecks, and American values.\"\nLIVE UPDATES: Minneapolis ICE shootings: Trump threatens Insurrection Act\nOhio’s 9th District is currently represented by Rep. Marcy Kaptur, a Democrat and the longest-serving woman in Congress. She took office in 1983 and was re-elected in November 2024.\nWhat they're saying:\n\"For too long, Northwest Ohio has been represented by a career politician who has grown comfortable with the swamp and disconnected from the people back home,\" Sheahan said in a statement to Fox News Digital. \"I am running because President Trump deserves a Congress that stands firmly behind his agenda, and Ohio deserves an elected Representative that will make America safer, more affordable, and more prosperous.\"\nIn an email to ICE staff, Sheahan said working for ICE was \"the honor of my life.\"\n\"We have been empowered to put the safety and security of the American people first,\" she wrote. \"Together, we strengthened our agency, restored its purpose, and set a new standard for excellence.\"\nThe other side:\nIn a statement to Fox News Digital, the Kaptur campaign said, \"While Republicans from near and far will fight through a messy primary in this district they gerrymandered again just this fall, Congresswoman Kaptur is focused on delivering real results for her constituents.\"\nDig deeper:\nAs ICE’s deputy director, Sheahan has been at the forefront of President Donald Trump’s aggressive crackdown on immigration. She boasts on her campaign website that 2.5 million immigrants who were in the U.S. illegally have left the country since she joined ICE.\nHer departure comes amid high-profile protests against ICE in Minneapolis and across the U.S. following the death of Renee Good, who was shot by ICE agent Jonathan Ross on Jan. 7.\nWho is Madison Sheahan?\nThe backstory:\nSheahan grew up in Ohio and attended Ohio State University. Before Noem appointed her in March to be the second-highest ranking official at ICE, she served as secretary of the Louisiana Department of Wildlife and Fisheries.\nRELATED: Illinois congresswoman moves to impeach DHS Sec. Kristi Noem\nWhen Louisiana Gov. Jeff Landry announced her appointment, he cited her experience as captain of the women’s rowing team at Ohio State and addressing leadership issues with the university’s then-football coach Urban Meyer, according to Nola.com.\n\"I’ve known her for years, she loves her family, Ohio and her country,\" Noem said in a statement to Fox News Digital Thursday, describing Sheahan as \"a work horse, strong executor, and terrific leader who led the men and women of ICE to achieve the American people’s mandate to target, arrest, and deport criminal illegal aliens.\"\nThe Source: This article includes information from Madison Sheahan’s congressional campaign website, Fox News Digital, Homeland Security Secretary Kristi Noem, Nola.com and previous FOX Local reporting.",
  "word_count": 541,
  "scraped_at": "2026-02-14T14:22:19.406946"
}