{
  "article_id": "f2ba4bf3e3a9",
  "url": "https://www.sbs.com.au/news/podcast-episode/midday-news-bulletin-19-september-2024/g98esd0j8",
  "title": "Midday News Bulletin 19 September 2024",
  "date": "20240919T064500Z",
  "domain": "sbs.com.au",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts\nTRANSCRIPT\n- Exploding walkie-talkies kill at least 20 and injure hundreds in attacks across Lebanon\n- Australia's unemployment rate remains unchanged from July to August\n- One of Italy's greatest football stars, Totò Schillaci, has died at the age of 59\nAt least 20-people have died and more than are 450 injured in Lebanon after devices including walkie-talkies, smartphones, and solar energy equipment blew up across the country.\nThe blasts appear to be a second wave of attacks after at least 12 people were killed and around 3000 were injured yesterday after thousands of pagers used by Hezbollah blew up.\nHezbollah and the Lebanese Government are blaming Israel for the attacks, but the Israeli Government has refused to comment.\nIt's feared the wave of explosions across Lebanon could fuel a major escalation of conflict between Israel and Hezbollah.\nThe Lebanese Health Minister says hospitals are dealing with a lot of casualties.\n\"What we have observed is that the vast majority of injuries are actually injuries to the face and the hand. we've seen alot of people who have practically lost their eyesight and probably the use of one their hands at least. The spectrum of patients coming to the emergency room was wide. We've seen children, including two have died.\"\nMeanwhile, Israel's Defence minister Yoav Gallant says the country is \"opening a new phase in the war\", and the \"centre of gravity is shifting to the north\".\n—-\nThe Federal Government has abstained from a United Nations vote calling on Israel to end its \"unlawful presence\" in the Palestinian territories.\nThe resolution received 124 votes in favour while 43 countries - including Australia - abstained and Israel, the United States and 12 others voted no.\nAsked if Australia abstained to appease Israel, Foreign Affairs Minister Penny Wong told the ABC the government looked very carefully at the resolution.\nThe Executive Council of Australian Jewry says \"the resolution is an invitation to endless war and bloodshed, an encouragement to Iran and its proxies to step up their aggression and pursue their openly-declared genocidal aims against Israel.\"\n—-\nAustralia's unemployment rate has remained unchanged over July to August and employers hired more people than predicted over the month.\nThe unemployment rate was steady at 4.2 per cent in August on a seasonally adjusted basis according to the Australian Bureau of Statistics.\nThe number of unemployed people fell by around 10,000, while the number of employed people grew by around 47,000, in August.\nHigh interest rates have slowed down the economy but the employment market has remained strong.\nThe Reserve Bank governor has ruled out an interest rate cut this year despite falling global borrowing costs.\n—-\nThe US central bank has cut interest rates by half a percentage point amid concerns about rising unemployment in the US.\nIt's the first cut in official borrowing costs since early 2020 after it reduced rates to near zero because of the coronavirus pandemic.\nThe Fed was then forced to rapidly raise rates over 2022 and 2023 as inflation increased steeply as the U-S economy bounced back thanks to massive coronavirus stimulus.\nFollowing the Fed's overnight move, the official U-S borrowing rate now stands at 4.75-percent to 5-percent.\nUS Federal Reserve chairman Jerome Powell says the pace of price rises (inflation) is continuing to come down in North America because of higher interest rates.\n\"We come into this with a policy position that was put in place, as you know, I mentioned in July of 2023, which was a time of high inflation and very low unemployment. We've been very patient about reducing the policy rate. We've waited. Other central banks around the world have cut, many of them several times. We've waited. And I think that that patience has really paid dividends in the form of our confidence that inflation is moving sustainably under 2%.\"\n—-\nA Senate inquiry is recommending women experiencing menopause and perimenopause should be able to request reproductive leave.\nThe government committee report made 25 recommendations including the consideration of introducing gender-inclusive reproductive leave.\nMenopause usually occurs between women and some gender diverse people between the ages of 45 and 60, and perimenopause, which precedes it, can last up to ten years.\n—-\nTotò Schillaci, one of Italian football's greatest stars of the 1990s, has died at the age of 59.\nHe was the surprise star of the 1990 World Cup, when he was the competition's leading goal scorer.\nComing on as substitute in Italy's first game, Schillaci went on to score six goals throughout the World Cup, helping Italy to a third place finish.\nHis former manager at Messina, says he had never seen a player who wanted to score as much as Totò.",
  "word_count": 798,
  "scraped_at": "2026-02-14T12:33:17.896658"
}