{
  "article_id": "f2dabbd9a8ba",
  "url": "https://gsas.harvard.edu/news/responsibility-world",
  "title": "A Responsibility to the World | Graduate School of Arts and Sciences",
  "date": "20230907T210000Z",
  "domain": "gsas.harvard.edu",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "A Responsibility to the World\nJim Yong Kim's lifelong quest to end poverty\nSitting in the oval office, Jim Yong Kim considered a question from President Barack Obama: Why should the White House nominate Kim, a physician and anthropologist, for the presidency of the World Bank rather than an economist? In response, Kim referenced the doctoral dissertation on Indonesian artisans written by Obama’s mother, Ann Dunham. Years before, fascinated by Obama’s political rise, he’d sought out an archived copy. Though economists had predicted that globalization would destroy Indonesia’s artisanal industries, Dunham, an anthropologist, documented that the artists she studied were flourishing because their work could reach new markets. “I won’t be able to tell you how the world looks from 30,000 feet like a macroeconomist,” Kim told the president, “but I’ve been on the ground doing development work my whole life. I’m going to be able to tell you if these programs are actually working.”\nJim Yong Kim’s wide-ranging career has in many ways been shaped by the PhD in anthropology that he completed at GSAS in 1993 after earning his MD from Harvard Medical School. His anthropological approach helped shape Partners in Health (PIH), the nonprofit he cofounded with his friend Paul Farmer, PhD ’90, which now delivers care to millions in the world’s poorest places. He went on to work at the World Health Organization on the HIV/AIDS pandemic in Africa, as a professor in public health at Harvard, and as the 17th president of Dartmouth College. More recently, his anthropological training informed his leadership of the World Bank, a role in which he once chewed coca leaves, danced, and played soccer at 12,000 feet before discussing development finance with Bolivia’s president, Evo Morales, a vocal critic of the institution.\nA Doctor Sometimes, An Anthropologist Everyday\nIt was another question, years before his meeting with President Obama, that helped set Kim, the son of two Korean immigrants who arrived in the United States in 1964, on a career path working with some of the world’s poorest people.\nA student at Harvard in the late 1980s, Farmer, also on the MD/PhD track, once asked him: “So, Jim, given our ridiculously elaborate educations, what is the nature of our responsibility to the world?” By then, Farmer was already doing volunteer medical work in Haiti, and in 1989 Kim made his first trip there. The poverty he witnessed shook him to his foundations, he says, and compelled him to ask, “How is it possible that 45 minutes from Miami, the world has allowed this situation to exist?”\nKim had long been interested in social justice. Among his earliest memories after moving to Dallas, Texas, were children there shouting racist epithets at him. Two years later, his family settled in Iowa, where he became class president, valedictorian, quarterback of the football team, and point guard in basketball. But despite his achievements, he was never fully accepted as American. “I struggled with the identity question so much that I ended up getting a PhD in anthropology,” he says. “It was exactly what I needed.”\nHis dissertation was on the role of pharmacists in providing healthcare in South Korea, since many people there couldn’t afford doctors. During his research, from 1985 to 1988, he learned not only to speak Korean and understand better his parents’ cultural roots but also that South Korean living standards were rising. “I realized it was fine to turn my attention to other problems in other countries.”\nNot long after his return, Farmer introduced him to liberation theology, which had taken root among progressive Catholic priests in Latin America in the 1960s and emphasized a “preferential option for the poor.”\nOver the years following Kim’s first trip to Haiti, he and Farmer worked to establish Partners in Health and battled ideas prevalent in medicine that little could be done to help poor people. “The most important thing is that we did not divert our gaze,” Kim says.\nOphelia Dahl, a PIH co-founder, former executive director, and the chair of its board of directors, says Kim not only cared deeply about the organization’s philosophy but could also translate it into immediate action in difficult situations. “He has never tried to look for anything that is tidy,” she says. PIH’s successes with complicated conditions were met with incredulity in the American medical community, especially after a campaign treating drug-resistant tuberculosis in Peru, for which Kim found ways to dramatically lower drug prices. “A good number of [public health professionals] were saying, ‘Who in the hell do you think you are telling us this is possible? Because if it were possible, we would already have done it.’”\nThough no longer working in the field of anthropology, Kim used ethnographic skills to understand what people wanted and what was at stake. “What I learned about empathic listening, what I learned about keeping your mouth shut, what I learned about being comfortable in situations where at first you have no idea what people are talking about—all of those lessons proved invaluable in public health,” he says.\nThe same held true after 2003 when he joined the WHO. Esther and Sidney Rabb Professor of Anthropology Arthur Kleinman, AM ’74, Kim’s PhD advisor at Harvard, says, “Jim used his anthropological knowledge to critique virtually every aspect of public health. He used it to get the WHO to run against what was the public health approach at that time”—the belief that prevention rather than care should be emphasized for poor people. By learning from various national and institutional cultures, Kim set ambitious goals for HIV treatment n Africa and found ways to dramatically lower medication costs to treat millions. “I’m a doctor sometimes,” he says, “but I’m an anthropologist every single day.”\nStarting in 1993, Kim taught at Harvard Medical School, and later became department chair of global health and social medicine, chief of global health equity at Brigham and Women’s Hospital, and director of the François-Xavier Bagnoud Center for Health and Human Rights at the Harvard School of Public Health. Anne Becker, PhD ’90, a professor in the Department of Global Health and Social Medicine and dean for clinical and academic affairs at Harvard Medical School, recalls Kim as a “visionary chair” who encouraged collaboration beyond the department while catalyzing change within it. “He really worked to bring global health and social medicine into the medical school curriculum.\nIntroduction to Social Medicine became a required course that has inspired a new generation of medical students.” He was also attentive to gender equity, scheduling department meetings so primary caregivers of children could easily attend, she says. “It was the kind of leadership that was very thoughtful, and it made people feel seen and understood and supported.”\nThe most important thing [about partners in health] is that we did not avert our gaze.\n-Jim Yong Kim\nKim’s next leap was in 2009, when he became president of Dartmouth College. He was the first Asian American president of an Ivy League university. At Dartmouth, Kim established the Center for Health Care Delivery Science to focus on graduate studies in healthcare and mobilized students to support relief work in Haiti after the earthquake in that country in 2010. He also launched the National College Health Improvement Project to address student health, especially binge drinking.\nIn 2012, Tim Geithner, a Dartmouth graduate and then the United States Secretary of the Treasury, called about the World Bank presidency. Kim told him that he’d been part of Fifty Years Is Enough, an organization demanding the World Bank’s closure on its 50th anniversary in 1994, and had also, in 2000, published a book critiquing it, Dying for Growth: Global Inequality and the Health of the Poor. When Geithner said he knew, Kim added, “I’m not an economist. I’m not a finance guy. I’m not a politician.” But he went to D.C. anyway. “If the president of the United States asks you to interview for an important job,” Kim says, “that’s what you do.\nA World Free of Poverty\nIn 2012, Kim took the helm of a World Bank which was very different from the organization he once wanted to shutter.\nOn his first day, at its D.C. headquarters, he saw, written on its wall, the words, “Our dream is a world free of poverty.” He asked his team, “Why are we just dreaming about it? Can we set a deadline for the end of poverty?” He was taking to heart the lessons of one of his mentors, former Harvard Professor Don Berwick, who told him, “If you don’t have a plan and a deadline, it’s just a slogan.”\nKim’s team developed a framework that would monitor the number of people living in absolute poverty and also track inequality. The World Bank then set a target date of 2030 to dramatically reduce global poverty—a goal that COVID-19 has likely made unattainable.\nKim’s team also launched the Human Capital Project in 2018, which published an index that ranked each country based on measurable health and education outcomes and showed that the countries whose outcomes improved the most also had more robust economic growth. “We made it clear that investments in health and education are absolutely critical for development,” Kim says. He also spearheaded work on climate change, an area previously neglected at the World Bank. Among the first visitors to his office was former Vice President Al Gore who gave Kim “an intense tutorial.” Kim pushed for $30 billion annually for climate-related projects. “We went from being the pariah in the climate change world to leading the discussion around financing climate change–related activities,” he says.\nOf Kim’s successes at the World Bank, the most unexpected—especially at a time of great skepticism about multilateral organizations in the US government— was a capital increase of $13 billion. The bank’s shareholders are its 189 member countries, and many ministers of finance were reluctant to transfer funds from their treasuries. “Literally, everyone I knew, from board members to my senior team, said, ‘Jim, you cannot go for this capital increase. You will fail,’” Kim recalls. He pointed out, however, that the proportion of the bank’s contribution to development had shrunk relative to the rest of global development funding. “I believed that the World Bank had to remain at the center of the development discussion, but if there are not enough resources to participate in some of the most important development projects, then you quickly become irrelevant,” he says.\nKim also worked to improve trust in the World Bank. When his team asked to meet with Morales, the first Indigenous president of Bolivia and the president of that country’s coca growers union, he received a message that the Bolivian leader would only meet him in a mountaintop village that he had to get to by helicopter. “He hated the World Bank,” Kim recalls. The reasons were similar to those Kim once had for opposing it, but now that the bank was the largest provider of funding for health and education in the developing world, Kim wanted to repair that relationship. During their meeting in Uru-Chipaya, high in the Andes, Morales gave him coca leaves to chew to help with the altitude, as well as soccer clothes and shoes, inviting him to play. Kim barely knew the game but did his best. “There was no soccer in Iowa in the 1960s,” he says. “But that’s what anthropologists do. When you’re in someone else’s country, you have to be open to everything.”\nLater, Kim was invited to join in a traditional dance that was similar to one he’d learned while working in Peru. He recalls Morales watching him with grudging respect. Then, at a political rally in Cochabamba, Kim gave a speech in Spanish where he referred to Morales as the “best soccer player in the world among heads of state,” receiving applause and laughter. “I’m a physician,” he went on to tell them, “but the World Bank doesn’t give prescriptions anymore for economies in Latin America.” In the years since the meeting between Kim and Morales, the World Bank and Bolivia have partnered on a number of projects.\nThinking Big\nIn 2019, Kim left the World Bank to work with Global Infrastructure Partners (GIP), a private equity fund working on projects around the world related to energy, roads, airports, and more. At the World Bank, he’d struggled to find private financing for developing country infrastructure. “Nearly every country in the world wants more private-sector investment,” he says. Already successful in developed countries, GIP opened a division in emerging markets and asked Kim to lead it.\nNot long after accepting the new position, however, COVID-19 swept the planet. Dahl recalls how Kim encouraged PIH to use its knowledge of community health to help states respond and himself led the pandemic response team that supported Texas, Florida, Ohio, Illinois, New Jersey, New Mexico, and Massachusetts. Charlie Baker, then the governor of Massachusetts, describes in his recent book, Results: Getting Beyond Politics to Get ImportantWork Done, how Kim advised him on “prevention, testing, care, and isolation efforts,” as well as “a virtual, remote phone-bank operation of contact tracers.” Dahl, in reflecting on Kim’s role in the pandemic, says, “The first thing he did was to think big, which is what he does.”\nNow, with the pandemic receding, Kim is focusing on mental health. “The mental healthcare system in the United States and all over the world is incredibly broken,” he says. This moment, he believes, is similar to 1999, when people with HIV were stigmatized and rapidly dying, despite the availability of highly effective treatments. While not as effective as those for HIV, treatments for mental health could decrease epidemic levels of suicides and depression. “If we use for mental health the lessons we learned from efforts to combat tuberculosis, HIV, cholera, Ebola, and also COVID, we may be able to start something that looks like a movement,” he says.\nWhy are we just dreaming about it? Can we set a deadline for the end of poverty?\n-Jim Yong Kim\nRecently, Kim was named chancellor of Rwanda’s University of Global Health Equity, the role held by his friend Farmer, who died in February 2022. As a founding director, he also continues work with PIH, now an NGO with an annual budget of over $150 million. He is heartened to see so many people trained at PIH doing important work worldwide and is currently writing a memoir to tell his remarkable story—not just all that he accomplished with the simple yet revolutionary principle of never diverting his gaze from those in need, but also that he, the child of two war refugees born in a South Korea too impoverished to qualify for World Bank loans, became the organization’s president.\nHe recalls once visiting a fifth-grade class in Tanzania and asking students what they wanted to be. When two of the children responded, “president of the World Bank,” everyone laughed but Kim stopped them and said, “When I was in preschool in Korea, the president of the World Bank, George David Woods, could very well have walked into my classroom on a visit to Korea,” he says. “And I seriously doubt that he could have imagined that one of his successors was sitting in that classroom.” His story may be improbable, Kim says, but the point of telling it is to remind those kids in Tanzania that they too should think big. “I told them to never let anyone tell them they can’t reach their dreams.”\nIllustration by Matthew Cook; Photos by Justin Ide/Harvard University and Dominic Chavez/World Bank\nGet the Latest Updates\nJoin Our Newsletter\nSubscribe to Colloquy Podcast\nSimplecast\nConnect with us\nView the Entire Issue\nDownload PDFView All Issues Online\nView Colloquy ArchiveRelated News\nCountering Cancer’s Mutations\nKidist Ashami is a PhD student in Harvard Griffin GSAS’s Biological and Biomedical Sciences Program, where she searches for ways to treat mutant strains of cancer.\n‘She Was Right and They Were Wrong’\nA new play examines the work of Harvard Griffin GSAS alumna Cecilia Payne-Gaposchkin, a groundbreaking astronomer whose discoveries were suppressed and work obscured.\n(Sesqui)centennial Medalists\nHarvard Griffin GSAS closes out its anniversary celebration by honoring alums who epitomize the School’s inquiry, innovation, and impact",
  "word_count": 2699,
  "scraped_at": "2026-02-14T13:09:49.629291"
}