{
  "article_id": "f2f4b2f6eb23",
  "url": "https://www.theartsdesk.com/new-music/glastonbury-festival-2023-down-paradise-city",
  "title": "Glastonbury Festival 2023 : Down to the Paradise City",
  "date": "20230629T150000Z",
  "domain": "theartsdesk.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "TUESDAY 27TH JUNE 2023\nI wake up around 11.00, get outta bed around 12.00.\nMy carcass has been ridden over by Immortan Joe’s entire fleet of vehicles from Mad Max: Fury Road. My inner head has been scooped out like a cantaloupe. Where my brain once resided a blistered, reddened, atavist lizard id sits curled in upon itself, pulling levers. I need to write. I can barely recall how to use a spoon. Maybe I have Long Glastonbury? No time for mewling. Back in…\nTHURSDAY 22ND JUNE 2023\nShepton Mallet’s behind us. So’s the A361. We’re into the leafy lanes, bustin’ the pastoral with GN’R. Don Carlton and I singing “Mr Brownstone” to the verges and trees from the windows of Finetime’s red Nissan Qashqai. Except, despite the blazing heat, a great dent in the front passenger door means I can’t wind down my window. Monday I borrowed the car and dinged it collecting dosh in Brighton. Forced onto the pavement by some dead-eyed white van skunter. Hit a bollard.\n“I get up around seven, get outta bed around nine, and I don’t worry about nothin’, no, ‘cause worrying’s a waste of time.”\nTrue that. Via a gap in the bushes, the 53-year-old Festival bursts into view. Sun on red’n’blue candy-striped marquees, multitudes of white tipis, lines and lines of parked cars glinting, goes on forever against the valleyed meadows. City bigger than the actual urban metropolis of Aberdeen. Or Ipswich. Or Oxford. Never grows old. Unlike us. 84 hours ahead. One chance. Grab or lose.\nFinetime’s sucking a cold Peroni at the wheel, shades on, red band round his hair. Don’s crammed in the sole back seat, cocooned by tents, camping chairs, duvets, rucksacks, sleeping bags and the rest. I’ve an Aspall Draft Cyder on the go (Aspall Premier Cru’s a bit pokey for first swiggings). Don’s on a tinny of Thatchers Gold. We’re all eating small packets of Red Leicester Mini Cheddars. I wanted to open the Texas BBQ Pringles but then remembered the wraps of Quivver Fizz stashed in there, down amongst the Pringle layers, top re-glued, cap back on. Best leave it. Rule No.1: Always travel to festivals as if you’re going through customs (Rule No.2 being “Never turn back to repack supplies if you see a Police dog at a festival entrance”).\n“We want the Bronze Gate,” I state.\n“It’s this way,” says Finetime, looking at roadside signage.\n“That’s the Purple Gate,” says Don.\n“It looks bronze to me,” says Finetime, “Or maybe brown.”\n“It’s purple,” says Don.\n“Must be the sun,” says Finetime.\n“Is the Bronze Gate the same as the Orange Gate?” I ask.\n“Yeah, must be,” they chorus.\nIt isn’t.\nBut I only find that out after the Festival. Somehow it doesn’t matter and we’re parked up in Hospitality beside acres of solar panels and silage tanks. The industrial Cosco Foldable Hand Truck takes up half the car, but we’re long done with those useless flimsy packdown family festival trolleys. Feeble. Instead, we load the Cosco to chest height, ratcheted and bungeed tight.\nBeing the chunkiest lunk, it’s assigned my job to push it. The journey, in Gobi Desert sun, across the car park, via press accreditation alley, through the Wicket Gate, onsite, past Darble Field, down to the campsite, mutates my physical being. Panting like a dog left in a pizza cooker, my limbs are lactic acid boxing bouts, my “MR HAPPY” yellow tee is not so happy anymore, a quagmire of saline solution, interstitial fluid and eccrine gland gunk.\nOnly Thursday and there’s no room in Hospitality Camping. Could be they’ve oversold it. Could be they didn’t count on music biz execs each needing a large bell tent per person. A campsite lady points out meagre space and we squidge in. We meet our neighbour Frisco, a dreadlocked drummer from Swindon who was once a thatcher, and his girlfriend Locket. We’re parked right in their doorway but he’s genial. Don and he talk Miniature Schnauzers. Locket is hiding, putting on gigantic false eyelashes. Frisco’s pal G has a robust, virile beard, shades and a US snapback cap. He’s the spit of Don Carlton. A photo is taken.\nTime for a reveal. This year I’ve taken the plunge and invested in a one metre x one metre flag (and a six-metre telescopic flagpole). It says, “DON CARLTON ARMY”, and features Google’s only hi-def image of Don’s obscure, middle-aged misfit namesake from Pixar’s 2013 prequel, Monsters University. He’s buzzed. We pose with it. More photos. Then Finetime, Don and I wash down a handful of Liberty crumbles and head in (mushrooms EVERYWHERE this year). Yesterday two separate people rang and asked if I could drive their forgotten sleeping mats to the Festival so I’m now carrying these. The Burrow Hill Cider Bus is the arranged meet.\nBurrow Hill Cider is my Glastonbury religion. I’ve been ever-refilling my two litre Highland Spring water bottle with two pints of Farmhouse Medium to one of Dry for 33 years. It’s exactly as long as they’ve been onsite. But there’s more to Burrow Hill than my monstering. Owners the Temperley family have been fighting for cider for decades. Based in Pass Vale Farm since 1969, deep in countryside midway between Taunton and Yeovil, patriarch Julian and wife Diana built a business that represents cider and related distillations as worthwhile high-end drinking, as opposed to the usual corporate fermented glucose-corn-spirit skank.\nTheir daughter Matilda now runs the show. She and her three siblings have been coming here forever too (spotting a Temperley is a fairly advanced form of Glastonbury bingo). The family has an affinity with the Festival’s spirit; their alignment with non-conformist Somerset yeoman farmer traditions chimes with the Eavis’s. And then there’s the lone sycamore tree on Burrow Hill itself, on their land, beneath which, inevitably, King Arthur is supposed to be buried.\nToasting the fungally low-glowing sun over the unused and quiet Pyramid Stage with a three-year-old cider brandy, we quickly meet our two bedding contacts. One conveniently sells me a tenner’s-worth of ‘Pam Ayres Lovebeans (fast-acting low-level tranks, should solutions such as Night Nurse, Nytol or CBD fail to cut through narco night-sweats).\nThe other is Koko, the 20-year-old daughter of good friends. She’s working for a company who provide the Festival’s gate steward volunteers. She pays them approximately the ticket price before the event, which she receives back afterwards if she does her shifts. Fair enough. For years, people would sign on as all kinds of Glastonbury volunteers, then simply disappear into the madness. However, it sounds a brutish, clumsy regimen she’s under, unsympathetic, squeezing as much work out of the her as possible in an environment of sour internal politics, edging here’n’there into bullying.\nWe’re sat on a wooden bench among the Cider Bus melee of drinkers and grab food. Basic £11 steak sandwich with chilli sauce for me. Underwhelming. Gone in a flash. Beside us a blue pole has the words “WHAT THE FUCK BITCHES” painted on it. I take a photo of Koko in which only the last two words are visible. Not one for the family. Evening is settling in and Finetime goes back to camp to gather warm layers for laters. More brandy, more cider, and out comes the Swiss Army Knife, flathead screwdriver for Quivver bumpology. None for Koko. Weird, the lines we draw, but that stuff from me to a pal’s child doesn’t synch with my caning procedurals. Maybe will when they’re older? Dilemmas, dilemmas. Things begin to twinkle.\nFinetime fails to return for aeons. We ancient bastards, two-and-a-half and three-and-a-half decades older than Koko, respectively, are info-succubae. We learn from her that one variety people who break into the festival are “runners”. They simply go full pelt at the entrances, all staff around yelling “RUNNER!”. Most are tackled by security but some make it. We also learn that the word “pinger” is slang for an Ecstasy pill.\nFinetime returns clad in the finery of an Eighties sports coat but not happy. The reason he’s been away so long? A group of younglings have been having a go. They wanted our tents moved. We were in what they’d designated their picnic area. Finetime explained there was no room anywhere but they didn’t care. Despite all having gigantic bell tents, one for every two people, they weren’t having it. “Just move!”\nWe’ll deal with this later. Finetime takes an apple brandy, a clonko of Quivver Fizz, and a mouthful of Leaf-mould to calm the nerves. We go on the march, joined by a random wild-haired young punker called Leilani who falls into our company, possibly at Carhenge, the 24 car replication that sits near the Meeting Point, bathed in multicoloured light. It was created by Glastonbury’s resident scrap metal visionary, Joe Rush, modelled on the more brutalist version which his Mutoid Waste Company built in 1987 to commemorate the traveller convoy’s absence from Stonehenge following the disgraceful police brutality at the Battle of the Beanfield two year earlier (if you don’t know the story, Google it, proper social history, Tory attitudes to land. And read Nick Hayes’ Book of Trespass while you’re at it).\nWe initially stop at Glasto Latino, until this year an ill-attended backwater somewhere in the far-flung fields, mainly known for dance classes. Now next to the West Holts Stage, it’s a giant writhing marquee fumigated by sex and Salsa [Pedant post-publication edit: Don Carlton points out that it actually moved here in '22]. It’s ballistic. Onstage, Bristol’s 17-piece Dockside Latin orchestra are upping the tempo and temperature. At either side, podiums contain dancers in ruby-sequinned mini-dresses, some with male partners, are cutting sharp moves. The whole beautiful crowd is a sea of unfussed choreography, attempting the New York Walk, the Pimienta, the Enchufla, the Mambo and God-knows-what-else. Even Koko and Leilani are at it, and that’s the last we see of them, bolero-crazed amid the perspiring, wriggling mass as “Bésame Mucho” plays.\nOur destination is the Truth Stage, right out in the far South-East Corner, where Earache Records have taken over for the night. We jig over there past endless bass wob-wob and huge billboards saying, “EVERYTHING MUST CHANGE”. It must. Arrive as Welsh dub-metallers Skindred finish but we’re here for uncategorizable New Jersey outfit Ho99o9. Festival perennial Chris Tofu is spinning remixes of classic heavy rock. We load up and fist-pump to beat-laden twists on “Ace of Spades”, ACDC and more.\nHo99o9 consist of two dreadlocked black dudes, theOGM, looking like a voodoo bondage phantasm, bottom half of his face painted white, and Eaddy in a combat onesie. With a drummer in support, they go nuts for 45 minutes, rapping and growling to a soundtrack that’s part hip hop, part electronic noise, part riff-apocalypse. They’re a dystopian nightmare Prodigy.\nAt some point Don Carlton wanders off, thinking he’s lost his phone, treks miles, but turns out he’s just lost his ability to think. Still has his phone. He returns to find Finetime and I exactly where he left is, under Ho99o9’s stroboscopic cacophony, headbanging. Then it goes melty. South East Corner antics. I particularly recall being somewhere with log palisades that reminded my sprongled consciousness of Rorkes Drift. Although, historically, in the Zulu War of 1879 it's unlikely they'd have been dancing to the breakbeat hardcore of “The Bee” by The Scientist.\n[NB. Those who follow these rambling sagas from year to year may have noticed that GB, who Don Carlton hooked up with at Glastonbury 2019, does not feature. This is because she's done her back in and needs to rest it. Rom-com fans will, however, be pleased to hear that she's now his fiancée, and that they're marrying in August at their own mini-festival.]\nFRIDAY 23RD JUNE 2023\n“The one place I don’t want to go today is the Arcadia Spider when the Chemical Brothers are playing” says Don, vehemently into the tent-mouth. “I really don’t like it there; it’ll be fucking rammoed.”\nI’m half-awake, my eyes are glued together with a grit-like substance. Finetime appears at his side bearing a paper plate with an oat pancake lathered in beans, egg and fried mushrooms, and a tea. I suck the lot up like Jeff Goldblum in The Fly. Put on Elvis-style gold-rimmed shades and a ragged hat of woven dried reeds. Step outside. A shaven-headed, topless guy of about 23, smoking Marlboros in the entrance to the bell tent next door, says, “Nice tent placement, mate, not very cool at all.”\n“Listen,” I say, calm as a tree-sloth, “What’s not very cool is entitled rich kids thinking they own this land because they’re camping here. This is the Eavis’s land and we’re all guests. There was no room left when we arrived. We had to camp here.”\nHe silences momentarily, says, “Rude,”, then starts in on it again.\n“I’ve been coming here over 30 years, dude,” I cut in, “and your attitude is not what this place is about.”\nHe shuts up. I go for my morning ablutions and recognise the writer Miranda Sawyer who I don’t know and have never met. I blearily tell her, apropos of nothing, “Hello there, we have a mutual friend.”\n“You’re the first interesting person I’ve seen in here,” she responds. Which is pleasing. But I’m still left with an ugly feeling about our irritated neighbours.\nInstead of dwelling on that, I sling on multi-pocketed shorts and a tee-shirt with a photo of Charlie Sheen and the word “WINNING”. Discuss briefly with Frisco and crew whether the 2011 Sheen interview is the best television of all time. We’re all up very early for Glastonbury. The heat is so intense that Don and Finetime couldn’t stay in their tents. Doesn’t bother me so much.\nAnother handful of Liberty Crumble washed down with scrumpy and we’re on our way. Three-pint cider refill. “I guess that’s why they call it the poos,” says a sticker on a passing toilet. First act on West Holts is Star Feminine Band, perfect start to the day. In 2016 in remote Benin, West Africa, a group of seven schoolgirls heard a radio station call-out for music training and took part. Two albums later and here they are (although there only seem to be six of them today).\nClad in matching, blue-dominated multi-colour dresses, their voices cute, the only one willing to speak English onstage advises us in an almost impenetrable French accent, “Let’s have foooon!” They proceed to lay down a sparkling soundtrack of highlife guitar and sweet sunlit music, occasionally throwing gourd percussion instrumentation between each other and performing relaxed dance routines. “We live together in the same house and we go to school together,” states the nominated talker. I’d write here, “Like The Monkees”, but surely only the most grizzled scrapheaps now know who The Monkees even were?\nFinetime sits under a Thai cotton parasol smoking roll-ups. Don has a weeping fit, overwhelmed at being here again, then proceeds to pass about a large Tupperware of homemade trail mix. I drink scrumpy and sway, gently mycelium-tendrilled. I spot this year’s Glastonbury tote bag screwed up by someone nearby. It says on it, “DON’T THINK ABOUT TOMORROW”. “Quite right,” I yelp, pointing it out, “Never think about tomorrow, or next week, just this, just here, there’s only the now!” I raise my hands to the sky, ecstatic. The person uncrumples the bag and I realise it says, “DON’T STOP THINKING ABOUT TOMORROW,” a Fleetwood Mac reference converted to environmental purpose.\nWe walk to the Other Stage flailing about laughing while shouting the opening of Kurupt FM’s song “Original Rudeboyz” into each other’s faces. A piece of green plastic has marker pen on it saying, “Ken Barlow is a Druid”. A man walking by wears a tee-shirt announcing, “MAKE GREECE ACID JAMAICA”. It features the Greek Flag in yellow’n’black. What the Hell does it mean? Who cares?\nWe’re up front at the Other Stage, buzz on at 1.00 in the afternoon. It’s hot but with passing clouds, nowhere near as viciously sweltering as it will be tomorrow. Flags flutter all around; “Jason Steele For England”, “The Pirates”, “Shit Indie Disco”, “This is our Fuppin’ Spot”, “Cattle in the Wind”. The Hives arrive like a Swedish thunderbolt. Dressed in black’n’white suits aptly embossed with lightning, they nail one of the sets of the weekend. 45 minutes of adrenalin garage rock, forensically tight-tight-tight, spiked with sheer cheek from frontman Pelle Almqvist.\nOpening and closing with newies, “Bogus Operandi” and “Countdown to Shutdown”, respectively, doesn’t hurt them a jot. With a roadie dressed as a ninja stringing out his mic cable, Almqvist scissor-kicks the air, clambers into the crowd, stands on the monitors, rushes off down stage-side gangways, makes us all sit down and bounce up again. “This one,” he says, “is for all the bands who’ve warmed up before us and all those who’ll cool things down after us.” He later suggests that Glastonbury might be better with just The Hives playing all weekend.\n“It’s hot,” he adds, “but do not let yourself off the hook, Glastonbury,” and we don’t, pogo-ing and singing along to their UK hits “Hate to Say I Told You So,” and “Walk Idiot Walk”, yelling the irresistible duel-worded gonzo “Come On”, and losing it to a rampaging longform assault on 2007 single “Tick Tick Boom”, wherein they photo-freeze mid-song, then explode to frenzied life. “Swedish midsummer is a time of human sacrifice,” Almqvist informs us. And we’re happy to be flayed on their altar.\nAfterwards, we’re beaming. We want to see ADG7, the Korean folk-pop collective, but we also have a collective desire to sort the tent situation out, to bring peace by compromise. So that’s what we do. Go back and tell the assembled younglings that we’re going to move our tents forward a few yards to give them an area to hang out. Hands are shaken, names exchanged. The rest of the weekend we all get along. Fucking hippies.\n“If only Russia and the Ukraine could have sorted things out this easily,” I grin inane from within foamy mushroom cognizance.\n“That’s not the same,” says Finetime. He explains why. He is correct.\nStill, it puts us in rising spirits, doing the right thing. We sit around chatting to Frisco et al. We talk about uppers, downers and all-arounders. He gives me a Zopinated Cyclone to inspect at wakeful sleepytimes, like an adapted ‘Pam Ayres Lovebead that’s less likely to affect respiratory function. He introduces us to his friend Bully, full-time songwriter who’s written for/with Tiesto, KSI, Galantis, Sigala, Felix Jaehn, The Chainsmokers and others to the tune of over six billion streams.\nBut we must move. Time just goes. While we’ve been chatting and drinking and chewing Liberty Crumble, Steflon Don, Carly Rae Jepson, Lightning Seeds, Los Bitchos, Billy Nomates, FLO, Gok Wan, and hundreds more have been playing. Not that I especially want to see those. Point is, it’s too easy to relax, high and happy. If you’re watching on telly, it’s the press of a button. Here it’s a 15-20 minute walk to the Pyramid, half an hour to West Holts, and more to further stages. Stomping is the game. Also keeps the metabolism fast, stops chemical pooling, detracts from hangovers and comedowns.\nDon spots Krishnan Guru Murthy in a Hawaiian shirt. Except it isn’t Krishnan Guru Murthy. It’s just a dude in a Hawaiian shirt and glasses. Burgeoning Psychoactive Fungus Guru Murthy. Low-rate celeb spotting this year. Not even the ubiquitous Billy Bragg. Or the less welcome Nick “Grimmy” Grimshaw. No-one wants to see him, anyway, but he used to be everywhere.\nNow carrying the DON CARLTON ARMY flag on its six-meter pole, we end up back at West Holts where Thundercat-affiliated Los Angeles funker Louis Cole is finishing his set. Doesn’t seem drastically interesting. I eat a large plate of Goan fish curry. All my blood runs to my digestive system. I’m reduced for 20 minutes to a pulp-blob on the ground, clinging to the flagpole. A man in a straw hat taps me and starts telling me the Monsters University image on the flag has made his child’s day. I look up at his silhouette in bleary pleading bemusement. Finetime cruelly takes photos. The grass feels nice.\nIt passes. Just as the much-lauded Gabriels start their set with the classy, string-swathed falsetto balladry of “To the Moon and Back”, I’m ready to move to the Moon and back (I’ve repeatedly tried Gabriels and can see why everyone praises them to the skies, but it just doesn’t hit me in that place). More Cider Bus scrumpy, more brandy, a post-prandial Quivver Fizz explosion, and we’re perched back at the Pyramid for “The Churnups”, the “surprise band” who everyone knows is Foo Fighters.\nI never listen to them In Real Life but it’s going to be an occasion. Everyone likes Dave Grohl. The people who don’t like Dave Grohl only say that because they find everyone liking Dave Grohl irritating. I find out later that Foo Fighters all took the train down to Bath. That sort of thing. While I don’t care for their thick-sliced bread’n’ham anthems, I found out at Glastonbury 2017 that they welly them live. And so they do today, speeding through, dropping the riff from Black Sabbath’s “Paranoid” into “No Son of Mine”, pausing only for slowie “Show Me How” with Grohl’s daughter Violet, bringing the hillside to attention for an arm-hair-raising singalong to “Best of You”, then closing with “Everlong”, dedicated to the late drummer Taylor Hawkins.\nWalk past Bristolian jazz-hop outfit Snazzback playing The Bandstand in the marketplace. I have an album of theirs. The people watching look like circus-show squirrel monkeys dressed as gypsies. The sky is full of cottage cheese. Pull back. Pull back. Drop the flag off at the Press Tent, where the hosts are lovely but the tabled ranks of laptop-jockeys filing copy depress me, their conversation only two degrees west of normal and home.\nWe sit in Hospitality eating pizza. The middle of the site and a great cut-through between stages. It’s full of people whose successful music-related businesses have paid almost twice the ticket price for them to be here. Some spend all weekend watching the Pyramid from a giant TV, like a Sky Sports bar. We discuss who to see next. Not Arctic Monkeys, although Don is tempted. It’s between Young Fathers and Kelis at West Holts, The Damned at the Avalon Stage, Sparks at The Park, and Frisco’s recommendation, Fred Again at Other.\nI persuade them Sparks. I think they’re just relieved not to be dragged to see The Damned (who I like but have seen many times). We stop for ten minutes, en route, to watch Fred Again, mates with both Brian Eno and drill-lord Headie One. He’s pressing lots of buttons, surrounded by a synth wizard set-up, and making a tasty sound (though watching back on the BBC days later, I realise more of his set is way too smooth-EDM Martin Garrix-tastic for me).\nWe stop again at The Bug, a military truck customized into a psychedelic open-winged beetle, lights blipping the dusk. On it, Groove Armada’s Andy Cato is playing back-2-back with a DJ called Spooky Cash-Cash who, from the look of it, is surely his teenage son? Cato sold the rights to his Groove Armada songs years ago to buy a farm, and has since, via co-founding Wildfarmed, become an activist for environmental change, exploring sustainable ways of growing cereal crops. None of that is helping him draw a crowd tonight, mind. But it’s in his favour.\nBy the time we’ve hauled ourselves all the way up the hill to The Park on the far south of the site, I’m regretting my decision. The natural amphitheatre is not packed, dusk is incoming. Don’s looking shifty, I’m feeling guilty. Finetime takes his photo pass and disappears to the pit.\nSparks arrive and play a song I don’t know, appropriately called “So May We Start”, which turns out to be from their 2021 feature film Annette. Directed by Leos Carax and starring Adam Driver and Marion Cotillard, Peter Bradshaw described it in The Guardian as “a declamatory and crazy spectacle, teetering over the cliff edge of its own nervous breakdown… a swoon of anxiety and rapture”. So’s the set we now witness, an operatic insanity that brooks no argument and drags everyone in.\nIt doesn’t hurt that they then bring on Cate Blanchett for the second song, “The Girl is Crying in Her Latte”, in a yellow suit and sunglasses, emulating her turn in the video. By the time they reach the grinding synth-pop of “Balls”, we’re all singing along (“To succeed/All you need/Are balls”). Accompanied by a band that includes a guitarist who rolls around on the floor, Russell Mael, clad in a black’n’red jacket, leads with elegant aplomb, while brother Ron stays at the synth, popping out for an occasional leg-kicking dance.\nIt's hugely engaging fun, the stage framework hung with giant fairy lights, and when they hit us with their two mega-hits, “The Number One Song in Heaven” (1979) and “This Town Ain’t Big Enough For the Both of Us” (1974), the lid blows briefly off The Park. Now we’re all willing to sway along to the preposterous but magnificent theatrical pomp of closer “All That”, swaying and singing like a chorus from Les Miserables, arms aloft, “All that we've done/We've lost, we've won/All that, all that… and more.”\nA miracle has also occurred. Finetime asked me to water his allotment last week while he was away on a job. I did but thought I’d also clear a carpet of weeds that were choking his onions and garlic. Pulled something in my lower back. Been bothering me ever since. Now it’s gone. Sparks have healed me. Although possibly it’s the anaesthetic.\nWe stride away with Don and Finetime deciding what's next (it’s usually me but I’m easy after the miracle). Don stops at the Arcadia Spider, the 50-ton, 20-metre-high, three-legged steel'n'glass arachnid, built from the scrap parts of a TriStar jet, Gazelle helicopters and much else. Beneath its “eyes” is a glass encasement in which the Chemical Brothers are beginning their set on the Funktion One 360-degree sound system\n“I thought you said this is where you definitely didn’t want to be, Don?”\nBut he’s off and away. All around us everyone's raving, a tee-shirted guy next to me holding onto the back of his much smaller boyfriend, their eyes bulging, staring at the weirdness. Soon more arrive and we’re surrounded, breakbeats and techno raining down, the woof of flames from the spider rising high into the night sky, heat flashing across our massed movement, lasers, a bonkers remix of “You Got the Love”, perhaps a tribute to Candi Staton who’s playing West Holts on Sunday night, their own new single “No Reason”, a ragged squawling remix of “Hey Boy Hey Girl”. We’re there an hour-and-a-half before Don is released from his mesmerism.\nThe night is young and we check out something I now know is Hedex presents My Home is the Rave at Lonely Hearts Club, an MC speed-rapping in a white tee to lively-lively drum & bass. And briefly visit DJs Craig Francis & Francesco del Garda at The Wow, amid Silver Hayes’ field of gigantic pop-up outdoor nightclubs, a steady house thrum, everywhere roadblocked. The new Levels is gigantic, layered, looks oddly like tech start-up offices by day, shiny and black, but by night, neon and crammed, it’s a different story.\nAnother of those myths held by the derisive, who never go to Glastonbury - or haven’t been since the 1990s - is that it’s now solely the privilege of the old and the rich. One look about Silver Hayes at night (or, indeed, when the right act is on many of the stages by day) and the “old” bit is easily refuted. Especially this year. Even the TV footage demonstrates. The line-ups are gradually balancing towards a younger demographic, even to the extent that sometimes I flounder around the latest TikTok blow-up names prior to the festival, YouTubing frantically to keep up.\nThe only-for-the wealthy accusation is more complex, especially as the relationship between class and money has changed so drastically since Thatcher. “That was easily the wordiest evocation of the Bourgeois Kumbh Mela (@ Will Self) I’ve ever read. Well done for taking one for the team,” wrote a friend when I posted a link to my Glastonbury ramblings on social media last year.\nApart from being blithely snide, this strikes me as inverse snobbery. Remember when Tory stoneface Dominic Raab sneered at Labour MP Angela Rayner’s visit to Glynebourne last year? It’s tangentially in line with that sort of thing. There are all kinds of versions of aspirational. Is my friend suggesting that all the British working class can enjoy are chicken’n’chips’n’football? Do they not save up and go on foreign holidays? If they wanted, are they not capable of wishing to come here, then making it happen?\nI noticed at Camp Bestival some years ago, the most Waitrose of all non-Henley-type festivals, that my encampment was surrounded by people who had working class professions, thick regional accents and so on. Brief research on what “bourgeois” even means anymore reveals many traditionally working-class professions - electricians, plumbers, builders, carpenters and so on - earn more than certain bourgeois professions (office functionaries, academics, mid-level medical admin, council officials, teachers, etc). I’d guess at least half the randoms I chat to this year at Glastonbury would be described as “of working class origin”. The Bourgeois thing is a canard.\nSuch thoughts wriggle about my oomyceted bonce as we head up the darkened railway track that cuts across the top-middle of the festival. We’ve had enough of Silver Hayes shiny untz-untz-untz modernism. We’re after “Old Glastonbury”. We cut through a hedge into the Green Fields and all is dark but what’s that over there? The Lizard Stage. It’s full of doped-out bodies lying, red eyes wobbling to Duncan Disorderly & the Skallywags who are rapping about tea to a lilting skank.\nWe sit in a rustic pergola nearby. Fizz and flap then push into the tent, now filling up. An open-shirted bearded dude in glasses, Duncan Disorderly is surrounded by lively women on bass, keys, percussion and much else. They’re doing a song about The Discovery Channel. Their fusion of Balkan, ska and folk clears the dozy from the floor and turns this carpeted Bedouin canopy into a bubble-pit of jigging. I briefly run into an associate I haven't seen for over 20 years. Sober these days, they recognise me. I am not. It takes a moment, but fritzes my circuits a little when I realise. Them doggone festival fates.\n”I fucked your mum and I fucked your daddy too,” Duncan Disorderly sings, “And if you keep looking at me with those eyes I’m gonna fuck you too!” Whether that was the closing song about sex on ecstasy, I can’t recall. That’s quite enough Saturday. I was in bed by about 3.00, sated, and plummeted to a sleep of Witches And Their Flying High Lubrication.\nSaturday 24th June 2023\nI wake up to a kerfuffle. Due to the extreme heat, everyone is gathered on seats outside under an awning Finetime has erected. He loves his awnings. It’s way early to be so chatty and cheery but waddya gonna do? I haul half my body out tent-front and watch the show. Frisco is checking small plastic baggies and talking about the documentarian of indigenous peoples, Bruce Parry.\n“Didn’t he spear his knob?” he asks the assembled - Don, Finetime, Bully and partner N, G and partner Lydia.\n“I think he did,” says someone.\n“Commitment that,” says Frisco.\nHe is passing around a breakfast box of “goon”, the Aussie term N gives for cheap rosé.\n“No, I don’t want any,” says Bully.\n“Flip the no,” says Frisco.\n“Flip the no? Flip the no!” says Bully. And he does, going keenly at the goon.\nFinetime brings me my daily oat pancake breakfast sloppage and a cuppa, but by the time I’ve eaten it the goon is gone. The assembled have moved onto chilled Prosecco decanted into a large plastic water container. How it’s still both cold and fizzy is the weekend’s second miracle. I take a glass but Don and Finetime have already moved next-level with Quivver Fizz tootalation. Bully announces that he’s pissed and that he’s sweating from under his eyes… “See! See! See!” He points at the offending area of his face.\nI take a second Prosecco and think it’s probably time to get up.\nClad in a black straw cowboy hat, a red’n’green Hawaiian shirt, and a pair of long black shorts with many pockets and Motörhead’s snaggletooth logo on the side, I’m ready to go. We head out. “This fish has never experienced gravity in all its life,” says someone we pass. I want to hear more of that conversation. A person is hanging onto a pole raising a flag that says, “LONG LIVE THE KING”, bearing a photo of Michael Eavis wearing a badly Photoshopped cartoon crown.\nAs we pass the Pyramid to reach the Cider Bus, Rick Astley is owning everything like a minor deity from another realm. The magic power of \"Never Gonna Give You Up\" has many, many hundreds in his clutches. It's inconceivable that in 1987 anyone could have imagined this sight, this worship of the song. Its journey to here is completely bizarre. Also hard to fight. All three of us are mumbling it absent-mindedly, along with everyone else's roaring.\nWest Holts. Kanda Bongo Man is playing first. His happy treble Congo soukous guitar sound was a favourite of John Peel and his set, punctuated by his cries of “Allez! Allez!”, and the booty dancing of two ladies in white crop tops, is as delicious as it is apparently endless, a revolving, one-long-song emanating cheer under a cloudless sky and ferocious lunchtime sun.\nBubble-guns blow everywhere. A man in a Harley Davidson jerkin with a rainbow feather mohawk cuts a rug on the warm turf. Another shakes a skull puppet that looks like Mr Punch gone to Hell. A few William Axl Roses pass by in kilts and tacky red wigs. A man in a 19th century British red army uniform, pink Lennon glasses and a beret stands with three similarly attired friends. He looks like Captain Sensible. I ask if he is. He says nothing but points to a sewn badge on his tunic that says THE DAMNED. I look harder at him. He is not Captain Sensible.\n“Dancing is free of charge,” Kanda Bongo Man tells us. Have we been here forever? A woman is lying on the floor in flowery full-body dungarees dancing only with her legs. Her twin sister is nearby dancing upright, Except I ask and they’re not twins but two of triplets. Kanda Bongo Man will never end. Why should he? He will always be playing. In 4.5 billion years time, at the Andromeda-Milky Way galactic collision, Kanda Bongo Man will be the guest soundtrack. Live and direct.\nThe only one not dancing is Finetime. The heat has completely done him in. As we move off, he’s walking like a zombie. “Find shade,” he monotones, huskily. He’s suffering. We walk and walk and walk, his daze leading us in circles. Somewhere in the Healing Fields we come across an open-sided canvas shelter surrounded by young oaks in pots, as well as a variety of other plants. It’s called Radha’s Grove and offers Life Alignment between 4.00 and 5.00 and Cacoa Ceremonies at times unspecified. We leave Finetime in a heap and grab life-saving food from Henry’s Beard Café round the corner; tortilla, curried something, salad, tomatoes, olives. After passing this to Finetime, it’s time for Don to wane too. They lie side-by-side napping. I have the mad-dog-and-Englishman gene so eat my fill, then head off alone to explore the Healing Field, out in the midday sun.\nThe Coracle Christian Worship and Prayer tent sits next to Shamanic Healing. Clearly a many-sided assortment of spiritual paths can accommodate each other here. I stroll down Soothsayers Avenue. Yes, it’s really called that. The Bhakti Temple offers mantra singing but more noise is coming from a small marquee nearby. Inside, a middle-aged, fit-looking dude with long grey hair, wearing shorts, is in the centre on a carpet. Circled around him are 20 or so attractive young women. He whales on a shaman drum in what must be some sort of yogic exercise class, constantly making them kneel, lie down, leap up, wave their arms, as recorded music peaks and slows. The incongruous aspect is that it’s a horrid Eurocheese remix of Hadouken’s “Levitate”. Maybe he produced it himself. I can’t find it online. I wonder if the “Conscious Connected Breathwork Meets Bass” session at the Sacred Breath tent is similarly physically active?\n“I love how different everyone is,” says a passing guy wearing an orange kaftan, a black cowboy hat overloaded with huge red roses perched atop his head.\nIn the Gong Sound Bath, a woman with blond dreadlocks creates a rise’n’fall of gonging to a large-ish marquee of zonked people with eyes closed. A man in a white Carhartt tee fidgets and scratches his leg. Everyone is running from the sun. Except for a man in a pink shirt, with a grey flick, doing Tai Chi, alone by scaffolding in the shape of the Star of David. Or possibly the Sigil of Baphomet.\nPassing into the Craft Field I buy a wooden-headed, carved Liberty Cap mushroom for £8 from a stall that boasts, “Love many, trust few, always paddle your own canoe”. I resist learning to make a wooden spoon, but chat at the busy Guitar Building Workshop. These stalls don’t seem to be doing much business but have been invited by the Festival to represent their skillsets and are happy at it, unconcerned whether Aitch, Sophie Ellis-Bextor or The Lathums exist or not. Mind you, on that we might agree. At the Bunting Workshop, beside a Viking ship sandpit, sewing ladies chat over a baby in a basket, who fondles the scrummage of fabric scraps in which she sits.\nThen I talk awhile with Jamie at Tý Pren, a Welsh roundwood timber framing company. His houses look tempting, like 19th century Wild West open range cabin-homes. I daydream as he explains the fire-proofing. I wonder if I could buy my own small acre of land and live in one of these. He reminds that it will save a lot of money if his company erects the frame, floor joists and roof, then I do the rest in my spare time. My dream shatters. He hasn’t seen my DIY.\nA man walks by with a backpack blasting Dreadzone. Up here it’s quiet and some look at him with disapproval. Another stall advises that I can “learn how to wrap homegrown herbs into gorgeous smudge bundles that can transform and cleanse energies in your space”. Smudge bundles. No idea what that is but sounds good [Boring Sober Explanatory Edit: They’re tightly bound Native American herbs used in ceremonies]. And, by way of an additional tip, it gives “positive energy to light your sage with a match”.\nEvery piece of shade is packed. Glastonbury is wilting. Any object casting shadow is rife with humanity, reminding of sheep by hedgerows. Artist-blacksmith Jenny Pickford’s 12-foot steel flowering plant offers no such cover, but it’s a persuasive object I’d like in the garden outside my imaginary log cabin. Along with a load of sage, obviously. A man in a kilt made of neck-ties, wearing a green rough-felt waistcoat, sprays me with water and fans me. He speaks in the hoarse voice of someone who’s been having far too good a time.\nThe only true oasis of actual cool air is a small, wooded glade overseen by the Iona Community, a long way from their Benedictine monastery just west of the Isle of Mull in northern Scotland. I’m invited in but am enjoying the sun. Surprisingly, there are only four people sitting there, all looking red, sweaty, sleepy and defeated. I return to Radha’s Grove and check in on Finetime. He’s ostensibly ready to move but, in fact, won’t be at full speed until after Lizzo later. I can’t help but speculate that some of the wipe-out might be down to Frisco’s goon’n’Quivver Fizz brekky. Both Finetime and Don vehemently deny this. But hmmmmm, right?\nI have grown increasingly fond of Avalon, in recent years, with its relaxed real ale bar vibes, sturdy venues, and sense of a village festival within the actual festival. But this year there seems to be no music here at a time I can make. Case in point, right now Brit blues-rocker Joanna Shaw Taylor is playing a cover of an Aretha Franklin tune but Jamaican reggae-crossover originals Third World are about to appear at West Holts, three Seventies members present and correct.\nI catch the first song which suggests, “We are all sheep in the meadow”. We might be in this sun. Massed thirst means a trip to the bar takes forever and their big hit “Now That We Found Love” is heard only faintly through shouts of “Three pints of Brooklyn Pilsner, please!” But I am back for the most apt song of the day “1865 (96º In The Shade)”, although the famous chorus belies that it’s based on the gallows speech of unjustly executed Jamaican rebel hero and champion of the people, George William Gordon. Google it.\nWe’ll fast forward a couple of hours or it’ll read like a time loop of site-crossing, pharmaceuticals, pizza, grabbing the flag, and so forth. Suffice to say, fed and cidered, with a bottle of Maker’s Mark Kentucky bourbon in hand, Finetime, Don Carlton and I, are ready on the right of the stage as Lizzo kicks off. Here, I confess, the sun becomes a bit much. It’s in the sky right behind the Pyramid so, despite the enormo-screens, it’s tricky to actually catch the action. It’s also hard in my face, battering, as if to level things out for my earlier, smug midday-sun survival.\nBut US star Lizzo’s contagious, very sweary energy, alongside the huge crowd she’s drawn, brings everything up. I can’t really see her against the blinding light, but I can just make her out in a laced black PVC catsuit, her band, The Lizzbians & Little Pigs (I think that’s what she said) all in pink. But I sure can hear her, belting out the 24-carat classic that is “Juice”, constantly chewing on the word “bitch” with glee (“It’s bad bitch o’clock”), bigging up her “big girls”, even convincing us that “Everybody’s Gay”.\nThe set dips in the middle – or maybe I do – but revies with a Pyramid field disco party of Kylie/Diana Ross proportions for a cover of “I’m Every Woman”, and the closing one-two punch of “Good as Hell” and “About Damn Time”, the latter featuring Lizzo’s flute interplay with two other pink-clad flautists called The Sashays.\nA man asleep on the floor wearing a bucket hat and shades wakes up during the latter half of Lizzo’s set and says, “What’s this shit?” He is Kaleb and will feature in our story later. Finetime, who vanished to sit under a bush for shade, reappears as the sun finally starts to quit. We’re ready for Guns N’ Roses, but the field thins out after Lizzo and never refills to the same level. It’s clear we’re a minority. Before diving into our mess and mayhem, it’s worth unpicking that a little.\nFirst off, GN’R weren’t crap. They were firin’ on all cylinders. Axl, particularly, was on more athletic form than when I saw them in 2018 (when he looked like a bloated Mick Hucknell). But they didn’t click with Glastonbury. My theory as to why is twofold. First, and more minorly, the previous night at the Pyramid, a 20-years-in-the-game guitar band, the Arctic Monkeys, had disappointed many. Even if they hadn’t, everyone is going to see Elton John tomorrow, so this is a good night to desert the Pyramid, have a change of scene, the bonus being that the other big stage alternatives are Lana Del Rey, Fatboy Slim, Loyle Carner and Christine and the Queens, all of whom draw a devoted and younger demographic.\nSecondly, Glastonbury 2023 is suffused with feminine energy. The misleading media bollocks, earlier in the year, that Glastonbury is misogynistic because the Pyramid headliners are all male ignored the fact that 32 of the 69 main acts originally announced were female or female-fronted. A better ratio than most festivals. And Glastonbury is basically now run by a woman. It’s in the air and Guns N’ Roses, more than most, don’t fit that zeitgeist. They’re hoary old L.A. sex’n’drugs’n’rock’n’rollers, representing ropey hedonic values from a less sensitive age (although let’s not do the disservice of forgetting their keyboard player these last seven years, Melissa Reese, is female).\nBut, back in the field, rock’n’roll is where we’re at. We’ve been excitedly singing “Mr Brownstone” since before the drive down. I’ve been looking forward to this. I didn’t realise until tonight, at this particular moment, that I’m the dinosaur, out of time. I don’t especially care. My music tastes run the gamut. Let’s press the accelerator and bite this.\nWe make a new friend, Raquel from Weymouth, who likes us and likes our high-flying Quivver Fizz and Nong Nongs. Turns out Kaleb, the sleeping Lizzo cynic is her boyfriend. They are with Terry, who works in the Navy and can’t touch anything naughty, and his girlfriend Cerys. Together we’re a Guns N’ Roses Kentucky bourbon unit, chatting, sharing bits’n’bobs and, luckily for me, taking turns to hold the flag.\nThe set warms up slowly and hits blast-off with “Welcome to the Jungle”. While capable of widdly guitar bits (of course!), they’re a tight, flabless unit, as punk as they are rock, and sound like they’re enjoying it. “Mr Brownstone” has us hooting and “Live and Let Die”, which we heard exactly here only last year, sung by Macca, raises the game. It foreshadows two more covers, suitably UK Subs’ “Down on the Farm”, originally on the band’s lazy but enjoyable 1993 covers album “The Spaghetti Incident”, attacked with punk gusto by Axl, while bassist Duff McKagan has a pub band spotlight moment with The Stooges’ “TV Eye”.\nI’ve a big soft spot for “Civil War” so have all seven of my arms around everyone, propounding its excellence, and who’s going say no to “Sweet Child o’ Mine”? But the wind-machine-blown MTV video schmaltz and Slash guitar histrionics of “November Rain” and “Patience” turn Finetime off. Then it’s singalong time to “Knockin’ on Heaven’s Door”, and the final vamping seven-minute “Paradise City”. Air guitars a-go-go. Over the years, I’ve been very aware when Pyramid headliners didn’t quite fit – Metallica and U2, to name a couple – and could see their fans from outside, giving everything, heedless. Tonight it’s my turn to be in that bubble.\nWe’re all loopy-loo by now. Revved. The goal is to make garage bananas Kurupt FM, 2.00 AM, at the Rum Shack in The Common, right at the very furthest end of the South-East Corner. First we have to get in, which the whole site is now trying to do. After dropping the flag off at the Press Tent, the South-East Corner is full. I know a secret route but Don has retreated to a primitive self, nong-noddled. He keeps rushing off, distracted by the sights, amnesiac. At one point we retrieve him from a large empty main stage tent where he’s standing raising his hands as if a band were on.\nDespite our best efforts, we lose Don. We make it to Kurupt FM but can get nowhere near inside the tent. Finetime, Kaleb, Raquel and I are at warp speed by now (Terry and Cerys sensibly departed for bed when they saw what was coming). Kaleb still has his shades on and looks like a refugee from Madchester. Neither are dancers but they’re solidly chatty friends-for-the-night. We blather and shuffle among the shadowed bodies as MC Grinda rules the mic. I grow very excited at a glowing white ridged sci-fi bracelet which I put on, and show it off. I later find out it’s one of those rubber cylinders that fit round card coffee cups to stop hands burning.\nAround 4.00 AM I take a turn. As The Ramones once put it, feels like somebody put something in my drink. Or did I? Whatever, I’m changing. Something unwanted is in my system, possibly an accidental ingestion amid the melee, less questioned than it should have been. Or simply verbal confusion? Who knows? Too late now. On the freight train. My conversation is sliding and my jaw is going, the meat inside my mouth a tasty meal. Kaleb has that look which says, “This has been fun but now I suddenly really must be going.” And they do. Finetime, looking mildly concerned, tells me, “Your eyes look very intense.” They feel that way too. When they’re not rolling about. But coordination is fine and we yomp back to Hospitality camping.\nAt some point I make an eight-minute pocket call to my 20-year-old daughter. I dread to think what’s on it but, days later, she tells me the only audible words are Finetime or I repeatedly saying, “Is that bar open?” Just as sleep is about to arrive Don puts his head into the tent snarling, “Where were you? I’ve been calling you for hours,” then disappears. I go to his tent and try to explain. \"No,\" is all he'll say. He will remember nothing of it in the morning. And so I tumble into sleep’s warm embrace. Messy.\nSUNDAY 25TH AUGUST 2023\nI awake around midday lying in yesterday’s Hawaiian shirt, half into the tent porch. The day is, thankfully, cloudier. My shirt-front is sopping, my pillow is too. I elbow into the liquid, propping myself up. There’s a large Tupperware box hidden under a small towel to the right of the tent that Finetime and I use in the night to save toilet-runs. It’s been knocked over into the tent-front. My head’s not right. I'm taking time to understand. When I do, I tell no-one but gurgle, “Noooooooooo!”. I swiftly take the shirt off and use it to mop up. The pillow can stay outside. Forever.\nToday initially has a shadow of wonk thrown over it by yesterday’s human chemistry set. And the urine. Takes a moment. And a swab-down. We’ve a triple-header afternoon lined up at The Park. Oat pancake breakfast is followed by wobbly uphill walk. The Sandalism sculpture along the way tells us it represents “the widely held pagan belief in the reincarnation of the soul”. Mine is reincarnated slowly by two pints of lager to one of IPA, assisted by Finetime’s large bag of salted cashews and, especially, Don’s superhot chilli Pringles which are a revelation and wake-up call.\nStanding by a man in a yellow beret holding a banner saying, “FUCK FAST FASHION”, I’m buoyed further by the arrival onstage of French-Martinican-Guadeloupean-Belgian electronic dance-popster Charlotte Adigéry, whose name we pronounce around seven different ways, and her Belgian-Chinese associate Bolis Pupul. Their Topical Dancer album of last year is smart, pared back, electro-funky and subtly catchy. And so they prove to be live, Adigéry clad in a psychedelic catsuit and knee-high silver boots, while Pupul, at a keyboard, wears a loud Nudie suit in fawn.\nShe has a strutting, satiric new wavey presence. They drop the big ones, the faintly Josh Wink-ish “HAHA”, full of perpetual and vaguely creepy laughter, and “Ceci N’Est Pas Un Cliché”, with its’ deadpan lyrics. But the whole set zips by, making the hours between 2.00 and 3.00 PM an unforced club strut, crisp, modern and foot-moving.\nOnce they disappear, I curl on the wax cup-scattered grassland floor and doze. A breeze finally is around. Intruding into my uncanny inner world of whirring elemental nebbishes comes a fluttering voice, redolent of pre-Raphaelite art-school girls unburdening themselves in melancholic song. Weyes Blood is onstage. This one Don does pronounce right (“Wise Blood”), though I’ve been saying it wrong all day (“Ways Blood”). Her music is not my bag on record and nor is it live, though I have friends who’d class her 2019 album Titanic Rising as one of that year’s most essential and moving. When I eventually make it to my feet, she’s prancing around the stage in a caped white dress, looking exactly as the music sounds. I lie back down again.\nSweden’s Viagra Boys, on the other hand, are one of the bands I’ve been most looking forward to, and don’t disappoint. Beneath The Park’s quilt of social statement art (“EQUITY IS THE BEST THERAPY”, “DON’T FORGET SYRIA”, etc) they look commanding. California-raised frontman Sebastian Murphy is topless, his upper body a dense canvas of tattoos, given to ebullient battle cries such as, “None of you fucking hippies better be sitting down out there, I swear to God”. But the eyes are equally drawn to saxophonist Oscar Karls, eyes shaded, gloriously mincing in micro-shorts, smoking, drinking, or keyboard player Elias Jungqvist acting the cowboy hunk.\nHuge yellow balloons, with zonked-out x-eyes and tongues out, bounce around the crowd, perhaps representing how many feel today, as Murphy sings, “I'm a savage, I'm really cool, I tried to warn you - I'm loose!” The sound is punk but with added electronic oomph and rock’n’roll twang. They grind out the tongue-in-cheek misanthropy of “Ain’t Nice”. The crowd is Sunday-lethargic but appreciative, except for the moshing maniacs down the front.\n“Move your body, move your body to the rhythm of love,” we sing as we walk down the hill, but we’ll miss back-in-the-day rave act K-Klass in The Glade. A granddad nap is calling. Don goes off to see Blondie with a friend who’s only made it onsite today, after sitting round in nearby Pilton since Friday, her ticket in Sweden with Viagra Boys’ agent until this morning (she’ll end her day at 11.00 PM with a drink-induced headache… the very shortest of Glastonburys).\nMeanwhile Finetime and I buy food – a predictability burger for me. We sit outside the The Big Easy Jam, a large yurt where passersby can pick up instruments and play together. Currently there’s a languid drummer, a guitarist and a pianist. The sound they make is eccentric, ultra-simple yet strangely compelling, as if they’ve just discovered what music is but cannot push it beyond its most nascent form. Round and round it goes, a-plip donk, a-plip donk, a-plip donk. Maybe they’ve hit on something unique. Perhaps I should offer to manage them? A topless sunburned man with a blue towel turban picks himself off the floor of the yurt, seizes a tambourine. Upper body hanging low, as if the weight is too much, he wanders about the players bashing the instrument against his knee. Bez he is not. We move on.\nBack at the campsite Frisco and co. have decided to exit tonight and are packing down. We say our goodbyes and exchange numbers. Great company. Naughty, naughty, very naughty, as Mr C once declaimed. I fall asleep in the now pee-free tent-front, and dream of a young Donald Trump alternately tempting and pestering me as we travel ornate Venetian canals of another age. When I wake, time has leapt suddenly forward. I grab the DON flag and stumble-rush off. I’m keen not to miss the first half of a proudly gay Pyramid double-header.\nLil Nas X is a 24-year-old phenomenon, streaming in the billions, breaking down hip hop stereotypes along the way. “Old Town Road” aside, though, I’m at a loss with the music. At the end of his glitzy Las Vegas show, which includes a Daily Mail-baiting male-on-male kiss with one of his dancers, I still am. But his stage-crawlin’, gold breastplate-wearin’, pumped gym-dancin’, weave-whippin’, effusively grinnin' showmanship is a riot. As are the giant, artfully designed puppets that dominate in certain songs, an elephantine horse, a stage-length serpent, a towering crane-like bird. He closes with global chart smash “Industry Baby”, bringing on rapper Jack Harlow to girlish audience screams, mashing the whole thing into a Michael Jackson “Beat It” work-out. For me, it’s all show, an eye-boggling, fabulously gay one, with little musical meat, but only the stubbornest churl could resist such field-owning levels of glitzy pizzazz alongside the assured sense of a socio-cultural victory lap.\nA few ciders and swigs of Maker's Mark later, standing with the newly arrived Don and Finetime: \"Look, maybe we have to face it,\" I suggest, \"It's niggling me. Is it possible we peaked last night?\"\nFinetime shrugs. \"It happens.\"\nDon waves the flag back and forth, his face sun-burnished, his eyes worn but lively.\nBut I’m kicking myself. More Maker’s Mark, more cider, more anything is only holding the line. Not going forward. The last time this happened was a decade ago. The Stones one. Maybe it’s allowed once every ten years? But I’ve no patience with it. Holding the line feels fine but I want to be a rocket man. Only Uncle Elton can save us now…\nThe opening “Pinball Wizard”, which he’s not played live for yonks, sets the juices going. Shouting “Sure plays a mean pinball” is a tonic. Elton is clad in a rumpled gold lamé suit, the trousers of which, on the rare occasions he moves from his piano, threaten to fall down, as in a Seventies sitcom.\nWhat I hadn’t realised is quite how much Glastonbury 2023 is ALL ABOUT Elton’s (maybe) final British show. The Pyramid PA tells us beforehand that everyone must stand up. The field is becoming too crowded. All seats must be put away, right to the treeline. At home, 7.6 million armchair watchers are with us, the highest ever for a Glastonbury performance. Dude’s a national treasure. Who knew? Apparently everyone!\nBut then the set settles and reminds me why my teen self had no time for Elton. Despite a giant inflatable giraffe bouncing across the audience, and participation in “I Guess That’s Why They Call It the Blues”, the likes of “Sad Songs Say So Much” and “Are You Ready For Love”, the latter featuring Jacob Lusk of Gabriels, were never going to sweep me off. As for the American TikTok sensation Stephen Sanchez, brought on to sing his own “Until I Found You”, well, it’s hideous.\n“All the young people seem to know it,” I say to my compadres, responding to the broad vocal involvement around us.\n“Yes, we do,” grins a wide-smiling young woman in front, arms around her friends.\nStill hideous. Grump grump.\nA dozen songs in, once he’s finished with the awful but much-beloved “Candle in the Wind”, Uncle Elton is ready to raise the Don Carlton Army’s spirits (next year’s flag, incidentally, will be two metres x two meters and say DON CARLTON. SALES. We decided last night in our cups that we didn’t like the ARMY bit). I’ve never had a moment for “Tiny Dancer” but tonight it elates me. It elates everyone. Howling “Hold me closer, tiny dancer,” with that trademark Elton voice-crack puts a lump in my throat. We’re getting somewhere, despite the presence of The Killers’ Brandon Flowers.\n“Saturday Night’s Alright For Fighting” sees us round on Finetime and his origins, the bellicose pubs of north Kent that he’s told us so many times we’d be eaten alive in. For “I’m Still Standing” the way the screens machinegun images of Elton’s long career is effective, even moving. Then the closing version of “Rocket Man”, I’m lifted to the stars, the sky relentlessly full of fireworks, popping, whistling, exploding for minutes on end. Elton, rather than \"Mr Brownstone\", won Glastonbury.\nThen we stroll to the Woods near Woodsies (a stage that used to be named after John Peel). We're looking for lager. But we stop and gawp. Spend time. This is a new area, aiming at the magical, at a fairytale sense of wonder. Frazzled lovers and children and we three succumb. Trees aglow with low blues and reds, their leaves a-shimmer with reflections. Aquamarine columns like radioactive toadstools. A wicker wolf twice my size plays a violin. An Ewok village of walkways in the trees. A large group of people in Dalmatian cowboy hats playing the illumaphonium, an interactive sculpture that looks like racks of luminous hand-weights wrought to become a horizontal xylophone. There is beauty here. But we must find a pint. And who knows what else? This is Glastonbury 2023. We ate well of it.\nBelow: Watch Elton John wow a massive and euphoric Pyramid crowd with a firework-laden, 10-minute version of \"Rocket Man\" at Glastonbury Festival 2023",
  "word_count": 10156,
  "scraped_at": "2026-02-14T12:28:33.733185"
}