{
  "article_id": "f302a2e3fdb6",
  "url": "https://www.theguardian.com/australia-news/2024/mar/01/were-not-finished-yet-inquest-into-marion-barters-disappearance-gives-daughter-hope-for-answers",
  "title": "  Were not finished yet : inquest into Marion Barter disappearance gives daughter hope for answers | New South Wales",
  "date": "20240229T143000Z",
  "domain": "theguardian.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "For 27 years – more than half of her life – Sally Leydon has been searching for her mother. On Thursday, a live clock counted down the minutes on Leydon’s website as the New South Wales state coroner, Teresa O’Sullivan, prepared to deliver her findings in the inquest into the disappearance of Marion Barter.\nThousands of people from around the world tuned in to hear the coroner speak. Barter, a primary school teacher, had become a cause célèbre, an enduring mystery, world-famous in her unexplained disappearance. Twenty million people have downloaded the podcast The Lady Vanishes since its debut in 2019.\nBut for Leydon, her mother’s absence has been an ache, an anguish, that for 22 years she carried alone; bewildered and struggling to find anyone to listen, to act, to help her. “I’ve had doors constantly closed in my face. No one was hearing my screams for help,” she told the Guardian last year.\nOn Thursday the coroner agreed, criticising NSW police for their failures in the case that had “led to the unavailability of crucial evidence surrounding Marion’s disappearance” and, ultimately, “resulted in Marion’s disappearance remaining unsolved”.\nThe coroner found that Barter is likely deceased, but she could not provide the family with further answers. “I am unable to determine the place of Marion’s death. I am unable to determine the cause of Marion’s death. I’m unable to determine the manner of Marion’s death,” O’Sullivan said.\nShe could not rule out foul play. In fact, O’Sullivan urged the NSW police commissioner to ensure the case remains with the state crime command’s “unsolved homicide team” for ongoing investigation.\nThe coroner was particularly dubious of Barter’s former lover, the convicted conman Ric Blum, who she said had “exploited Marion” and lied while giving evidence.\nO’Sullivan said she was “convinced” that Blum “does indeed know more” and “that there is a sufficient basis for a finding that he was and is deliberately unwilling to devote this further knowledge to the court”.\nShe declined to refer the matter to the director of prosecutions to consider charges, as she said it was a matter best left to police, whose investigation had not concluded.\nAn abrupt life change\nWhen I first met Leydon in 2010, she told me her mother was an educated woman. “She didn’t drink or smoke. She was a very dainty cultured person. She was a schoolteacher. That’s all she did. She loved her job. If she wasn’t at school, she was at one of the parents’ houses having afternoon tea.”\nAfter three failed marriages – the first to the football player Johnny Warren – she was disheartened and lonely. “She didn’t have much success with the men in her life,” Leydon said. Nor was she street smart. “She was totally naive, innocent, very trusting.”\nIn March 1997 Barter made an abrupt life change. She announced that she was going on a sabbatical to Europe, quit her job and sold her house.\nAnd she became uncharacteristically secretive. When Leydon and her fiance ran into her at a petrol station at a local McDonald’s, there was a tall man sitting in her car. Seeing her daughter, Barter sped off the wrong way.\nOn Thursday, the coroner found that, “Marion and Mr Blum travelled together in England as a couple in a relationship”. But Marion’s hopes for true love were a mirage. The coroner found Blum “clearly did not intend to pursue the relationship because he was married with children”.\nBlum had told the inquest that he had only seen Barter four times and had not seen her again after she left the country.\nMeanwhile, Barter withdrew money in August 1997 and transferred $80,000 to an unknown account two months later “on the encouragement of Mr Blum and in circumstances where Marion believed that she was in a relationship with him”.\nWhen the coroner’s inquest began in February 2022, two women came forward to identify Blum as the man with whom they had also had a relationship, although he had used different names with each. Both were vulnerable and recently divorced. Both were encouraged to sell their property and start a new life in France with Blum.\nIn June 2023, two more European women came forward to the inquest. Ghislaine Dubois-Danlois, widowed at the age of 50, had placed a small ad in a local paper in 2006. Believing “Frederick de Hedervary was going to marry her in Bali and they would emigrate to Australia”, she sold her car and house and liquidated her bank accounts. Within weeks he had walked out of her house with her life savings of €70,000 and her most valuable possessions.\nIn 2012 Marie Christine Landrieu, a Belgian widow, had received a visit from a man who was her dead husband’s cousin. He wanted them to buy a house in Bali, splitting the purchase price of €200,000. She would be left penniless in Bali when he walked out with €100,000 in cash.\nThe coroner stated that “the evidence of these women demonstrates a tendency on the part of Mr Blum to misrepresent himself to single vulnerable women for financial gain”.\n“I find that Mr Blum exploited Marion in 1997 in the manner in which he later exploited other women who have given evidence in these proceedings. I make this finding despite Mr Blum’s denials in this regard and notwithstanding that the women involved in his (later) relationships remained alive and well.”\nIt was revealed that the man now known as Ric Blum, a Belgian national, had been convicted of larcenies, embezzlement, fraud, breach of trust and false impersonation between 1965 and 1973. The coroner said “Mr Blum’s dishonesty and manipulation of women for financial gain is consistent with the nature of the offences he committed in Europe for which he served time in prison”.\nHer passport was never used again\nBlum was presenting himself as Fernand Remakel, the coroner said, when he suggested to Barter that they start a new life in Luxembourg.\nUnbeknown to her family, Barter changed her name to Florabella Natalia Marion Remakel in 1997, two months before she left Australia.\nBarter insisted that no one go to the airport to see her off on 22 June 1997.\nOn 1 August Barter phoned Leydon, reportedly from Tunbridge Wells in the UK. They spoke until she ran out of coins in the phone box. There was no indication that anything was wrong or that she was returning to Australia. “She said I was the best daughter,” says Leydon, “and that was the last time I spoke to my mum.”\nThe coroner found that Barter “took steps to ensure that no one was aware of her return to the country”, but she did come back to Australia in August. Her passport was never used again.\nOn 18 October, when Barter did not contact her son Owen for his 23rd birthday, Leydon realised she did not know where in the world her mother was. She contacted Barter’s bank. She discovered that over a three-week period in August and September, $5,000 a day had been withdrawn in Byron Bay and Burleigh Heads in northern NSW.\nShe reported Barter missing on 22 October and walked around Byron and Burleigh with photos asking if anyone had seen her. A week earlier, $80,000 had been electronically transferred to an unknown account, according to the coroner’s findings. O’Sullivan stated: “I am satisfied that the person seeking to withdraw or transfer the $80,000 was in fact Marion using photographic identification to the satisfaction of the bank teller.” It was the last time Barter was seen alive.\n‘Very little was done’\nThe coroner found that the “nature and adequacy of the police investigation into the disappearance of Marion by NSW police between 1997 up until 2019 was not adequate. Very little was done.”\nBarter was officially listed as a missing person for the first time in 2007.\nIn 2009 Det Sen Const Gary Sheehan took over the case. Told by the Department of Foreign Affairs and Trade that Barter had changed her name, Sheehan believed Barter had staged her own disappearance and took her off the missing persons list, marking her as “located”. She was not reinstated until 2022. The coroner found that “Sheehan should not have reclassified Marion as located in 2011”.\nWhen the The Lady Vanishes podcast launched in 2019, it attracted the attention of Joni Condos, a cookbook writer, former social worker and, it turned out, a formidable investigator who has been working full-time on the case ever since.\nShe was struck by the name Remakel. She ran the name “through all these active online databases. If you just put ‘Remakel’ in, you would never have got it.” She tried putting spaces between the letters in different combinations. And then she found it. A 1994 lonely hearts ad in Le Courrier Australien, a French-English bilingual newspaper. Fernand Remakel was “searching for a lady with a free heart. Looking or a permanent relationship and or marriage.”\nTwenty-two years after Leydon first reported her mother missing, the unsolved homicide unit established Strike Force Jurunga to investigate Barter’s disappearance. Police would find a lapsed Queensland driver’s licence in the name of Fernand Remakel that linked to the man now known as Ric Blum.\n“On 24 August 1988,” the coroner stated, “Mr Blum dishonestly applied for and was issued with a Queensland driver’s licence in the name of Fernand Nicola Remakel. I accept this submission and find that Mr Blum’s motivation was to dishonestly misrepresent himself… and that Mr Blum’s weak explanation and denials in this regard should be wholly rejected.”\nThe coroner further stated that Blum “has further knowledge of Marion’s travel overseas, he has further knowledge of his relationship with her in the months prior to her disappearance, that he has further knowledge of her circumstances following her return from overseas. This evidence, along with his lies and deceptions throughout the inquest, has convinced me that he does indeed know more than he is saying. There is sufficient basis for me to make a finding that Mr Blum was in communication with Marion and played some role in her life following her return to Australia.”\nThe coroner said any decision to prosecute Blum should be left to police, particularly considering their investigation has not concluded.\nShe praised Leydon “on her unwavering commitment and participation in the coronial investigation and inquest to find out what happened to her mother. She has shown fortitude, dignity, resilience and grace throughout these proceedings.”\nAs far as Leydon and Condos are concerned, their own investigation will continue unabated. They will not stop until Leydon finds her mum.\nSpeaking to the Seven Network after the findings were handed down, Leydon said it was a “bittersweet” day, but she was glad she hadn’t given up.\n“It’s a very long arduous journey. It’s not easy. We’re not finished yet. I would like to see justice served. Someone knows something.”",
  "word_count": 1817,
  "scraped_at": "2026-02-14T13:11:11.010980"
}