{
  "article_id": "f303eefca604",
  "url": "https://www.justarsenal.com/opinion-who-tops-your-list-of-arsenal-pundits-in-the-media/399573",
  "title": "Opinion : Who tops your list of Arsenal pundits in the media ? ",
  "date": "20250906T163000Z",
  "domain": "justarsenal.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Arsenal In The Media – Top 10 List\nPaul Merson felt compelled the other week to defend himself on social media over his status as an “Arsenal Legend” and supporting Chelsea. Some Gooners feel the Sky Sports pundit is not qualified to be critiquing the Gunners as he has been a lifelong fan of our London rivals.\nIn other words, another example of people happy for someone to have freedom of speech as long as they agree with you. Not that the 57-year-old owes anyone an explanation, he makes it clear he feels that no one should swap allegiances once you pick a club to follow, but that does not mean he cannot love Arsenal for the moments they shared.\nAs many readers will know during the international break I like a list so here goes.\nHere are my top 10 rankings of those who work in the media regarding Arsenal.\nLee Dixon\nThere is something quite unlikeable about Lee Dixon’s commentary. I do not know if it is highlighted by his pairing with Sam Matterface, with the two taking turns to make sarcastic comments which I think are meant to be funny but come across as passive aggressive.\nThe 61-year-old has chosen mostly not to lean on his Arsenal connections like others on this list but does not bring much else to the party. Maybe he has been working with ITV for too long but he never seems happy to be there.\nTony Adams\nIf one man’s punditry on this list might be marmite it could be “Mr Arsenal”. If you are a Gooner who only wants to hear everything is rainbows and unicorns at the club you will not enjoy hearing how critical our former captain can be.\nThe problem is you have to find the balance. If you are always negative then long term it is not clear if you are being genuine or just speaking for attention.\nThe 58-year-old does not frequently work as a pundit in the UK so when he does make an appearance maybe his words carry more weight? There seems to be a lack of recent product knowledge though and a lot of bringing the topic of conversation back onto himself. In that respect is there a lack of self-awareness?\nHe has openly been disappointed in Arsenal for not inviting him back to help with his coaching career and he does come across as a bit salty.\nMartin Keown\nThe 59-year-old has been trusted to work for various broadcasters at multiple international tournaments as a commentator.\nIf the Invincible left it like that he would be higher on this list, an analyst who viewers will listen to because he has played the sport. Where he lost some credibility even with some Gooners was when he accepted a job with TalkSport.\nJim White and Simon Jordan have zero interest in hearing the ex-defender reflect on his experiences. They want clicks and views and realise they can get that by winding Keown up. He lacks the self-awareness to realise he is being played and laughed at for sound bites.\nWhere he thinks he is defending Arsenal it can be a bit cringe at times. It is almost like the radio station have tried to make him a cartoon character. You can understand why a YouTuber would put themselves in that position but not a former professional.\nAlan Smith\nI always wonder if our former striker contacts his employers and asks why he is never trusted to commentate on the Sunday 16:30 fixture. As part of the Super Sunday coverage the 62-year-old is often picked to do the less anticipated game of the day.\nHe is old school in that he keeps the focus on what he sees on the pitch and not on getting himself views. Not all of his peers can say the same. Safe.\nTheo Walcott\nIn many ways a bit harsh to rate the 36-year-old as he has just started out on his media journey, picking his gigs carefully to not over expose himself.\nWe have lots of pundits who represent Arsenal from a successful period but Theo can give an insight into being in a young dressing room which transitioned from Highbury to Emirates and where the ambition changed at the club.\nThe dynamics are a bit off at Sky Sports though where he is surrounded by winners like Roy Keane, Gary Neville and Jamie Carragher who at times seem to belittle Walcott’s career. He is too classy to bite and Sky might not like that.\nEmmanuel Petit\nIt feels like once a year the Frenchman visits the UK for a couple of weeks and does the media tour, popping up on TalkSport, Sky Sports, etc. The 54-year-old happens to say a lot of things about Arsenal that I personally agree with.\nHe is in the perfect position to do this as someone who is clearly an Arsenal legend but does not necessarily love the badge like others on this list. Nor does he have or crave a working relationship with the Gunners.\nSo he can take away any emotion and tell you from experience the pressure of playing for the club and what might be missing. Never taking himself too seriously, the ex-midfielder is not afraid to laugh at himself when recounting his career.\nKaren Carney\nAs a casual viewer of women’s football, Karen Carney got me hooked during Arsenal’s Champions League Final and this summer’s Euros. Her passion for ex-teammates and to see how far the sport has grown was endearing.\nI am not saying it is correct but the 38-year-old is under constant pressure to deliver with the likes of Joey Barton just waiting for her to mess up. You can tell she is well educated and tactically insightful.\nThe biggest compliment I can give the 38-year-old is when she is a pundit I do not see gender, which is the point.\nPaul Merson\nSome try to criticise the 57-year-old for not always pronouncing his words properly but unfortunately that is just people wanting to trip someone up.\nThe point of having ex-players as pundits is they can give an insight that others cannot. Because the former midfielder has been candid about the mistakes in his career he can offer examples of the highs and lows of the sport.\nFor example, when he says how difficult it is to go to Anfield or play for England, you listen because it is his lived experience. As are his stories about transfers, being lazy in training, winning or failing in title races, etc.\nHe does possess an annoying habit of making his point and following it up with hyperbole. For instance, there is one thing to say “I think Liverpool will win at the Etihad” but then he will add “I cannot see how they lose this football match” or “it is impossible they win”.\nThierry Henry\nPart of CBS Champions League coverage which UK viewers can access segments of on YouTube. I am not personally a fan of his banter with Jamie Carragher and Micah Richards.\nI prefer when the 48-year-old is invited back onto Sky Sports to talk about the Gunners past or present or to reflect on his career. It is affectionate how a player from abroad could genuinely fall in love with our club but Henry does not get accused of being biased like others on this list.\nA legend of the club, Henry can get away with saying what he really thinks. He will highlight the shortcomings of the manager or ownership if needed. He does not need to tell you what you want to hear.\nThere are certain names in the history of various genres who have earned the right that when they speak, you listen. Go listen to what the Frenchman said on the Overlap in the summer about wingers not taking on their man anymore. Within a few minutes he described our failures from last season.\nIan Wright\nHow you rate the Arsenal legend depends on how impartial you want your pundits to be when watching coverage. My brother supports Man United and my best mate is a Liverpool fan yet I know neither enjoys Gary Neville and Jamie Carragher co-commentating, you sense Sky realise they pushed that a bit too much.\nIan Wright is perhaps the most passionate player to have ever worn a Gunners shirt but it would be a disservice to the 61-year-old’s work to say all he does is tell Gooners what they want to hear.\nFirstly, having originally walked away from Match of the Day not happy with the stereotype of being too hyper and animated, his media training taught him to embrace his larger-than-life personality and view it as a strength.\nSecondly, it is not true. He is happy when the team win but is hurt when they let us down and will question manager and owners if needed. He often reflects what I am feeling and that is his biggest quality, he is relatable.\nWhen playing or retiring, the ex-striker has never forgotten his roots or taken for granted the life the sport has given him. It is why supporters of even our rivals love Ian Wright.\nBecause wherever it is club, country, promoting women’s football or telling stories on the Overlap, his passion is infectious. Anyone else voicing the video welcoming Eze to the Emirates and it would not have been as powerful. I think the word is real.\nWhat Arsenal pundits do you prefer? Share your thoughts in the comments.\nDan Smith\n__________________________________________________________________________________________\nADMIN COMMENT\nSo here are some simple rules which I must insist commenters follow….\nYou agree not to give any personal abuse to other Arsenal fans. Everyone is allowed to hold their own opinions even if you disagree with them. It COSTS NOTHING TO BE POLITE TO OTHER ARSENAL FANS.\nCALLING ALL ARSENAL FANS! Anyone who would like to contribute an Article or Video opinion piece on JustArsenal, please contact us through this link…",
  "word_count": 1665,
  "scraped_at": "2026-02-14T12:58:27.763698"
}