{
  "article_id": "f313c7385a88",
  "url": "https://metro.co.uk/2025/07/26/will-lauren-james-play-euro-2025-final-england-vs-spain-predicted-line-ups-23757618/",
  "title": "Will Lauren James play in Euro 2025 final ? England vs Spain predicted line - ups",
  "date": "20250726T150000Z",
  "domain": "metro.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Lauren James was part of a 23-player England squad involved in training on Saturday morning ahead of the Euro 2025 final clash against Spain, with Sarina Wiegman confirming the player is available for selection.\nThe Lionesses are hoping to be crowned champions of Europe once again on Sunday following their triumph at Euro 2022 under Wiegman.\nEngland face a tough test against Spain, who beat them in the 2023 World Cup final, with supporters keep to know how Wiegman’s side will line up.\nMetro has predicted the England XI for the Euro 2025 final – and you can scroll down for the latest team news, start time and how to watch it…\nEngland vs Spain Euro 2025 team news\nLionesses star James was in a race to prove her fitness after being forced off at half time in Tuesday’s semi-final comeback win over Italy.\nJames picked up an ankle injury – but Wiegman suggested in Saturday’s press conference that she’ll be fit to start against Spain tomorrow.\nGet your football fix\nDon't want to miss the week's biggest football stories? Metro's exclusive football newsletter, In The Mixer, is your essential guide.\nFrom the latest transfer rumours and managerial moves to analysis of the biggest games and a lot more, our experts have you covered.\nSign up here, it's an open goal.\n‘We had 23 players on the pitch today [in training] and everyone came through,’ Wiegman said.\n‘If everyone recovers well then we have everyone fit for tomorrow.’\nEngland captain Leah Williamson added: ‘Lauren James brings something different – so having that available is best case scenario for us.’\nEngland centre-back Esme Morgan made her first major tournament start last time out and is set to keep her place next to captain Leah Williamson.\nAlessia Russo looks set to start for the Lionesses too despite Michelle Agyemang’s late heroics in the last two knockout games from the bench.\nSpain, meanwhile, are set to have Laia Aleixandri return to the backline after she served a one-match ban against Germany on Wednesday.\nEngland vs Spain predicted line-ups\nEngland’s predicted XI to face Spain: Hampton; Bronze, Williamson, Morgan, Greenwood; Stanway, Walsh, Toone; James, Hemp, Russo\nSpain’s predicted XI to face England: Coll; Batlle, Paredes, Aleixandri, Carmona; Bonmati, Guijarro, Putellas; Caldentey, Pina, Gonzalez\nEngland vs Spain how to watch and start time\nEngland vs Spain gets underway at 5pm UK time on Sunday, July 27.\nViewers will have a choice between BBC One and ITV 1, with both TV channels providing live coverage of the final in the United Kingdom.\nWho will win the Euro 2025 final?\nAnalysis from Metro’s Sports Reporter Liam Grace…\nEngland’s road to the Euro 2025 final has been a rollercoaster of resilience and emotion – last-gasp equalisers, heart-stopping penalty drama and a defiant response to their opening ground-stage defeat to France have all shaped a storyline worthy of the grandest stage.\nNow, the Lionesses stand on the edge of history, with an opportunity to become the first England team ever to defend a major tournament title.\nIt is Spain, the tournament favourites before a ball was kicked, who stand in their way. La Roja are aiming to make their own history – having never been crowned champions of Europe before – and they have a number of impressive stars who can cause England problems.\nHaving scored four goals in five matches, Spain forward Esther Gonzalez enters the final as the tournament’s leading scorer. England will also have to deal with the likes of Aitana Bonmati, Alexia Putellas and Athenea del Castillo – some of the best players in women’s football.\nWe’re set for a fiery rematch of the 2023 World Cup final – with previous clashes between the two nations packed with tension – so expect more of the same on Sunday… with England hopefully coming out on top.\nPrediction: England 2-1 Spain\nSpeaking ahead of the final, England manager Wiegman said: ‘I think that both teams have so much respect for each other.\n‘They are good on the ball, so I expect they’ll have the ball a little bit more, but we have played games where we’ve had a certain amount of ball possession too.\nMore Trending\n‘We are just preparing as well as possible. We have to defend really well and try to harm them at other moments.’\nSpain head coach Montse Tome added: ‘It’s an incredible joy to be in the final. I’m very happy for the players, the staff, and everything we are building here in Switzerland.\n‘Now, it’s time to recover. We’ll start looking at England more closely, although our analysts have already been watching them live and studying their performances.\n‘We’re going to dive deeper into their game, and we’re going all in.’\nMORE: Lionesses star Ella Toone all loved up with fellow footie star – who happens to be a rival\nMORE: Inside Lionesses teammates Lucy Bronze and Keira Walsh’s ‘romance’ on and off pitch",
  "word_count": 823,
  "scraped_at": "2026-02-14T13:32:51.631214"
}