{
  "article_id": "f3266143eb60",
  "url": "https://blogs.fangraphs.com/hopes-and-skenes/",
  "title": "Hopes and Skenes",
  "date": "20240906T161500Z",
  "domain": "blogs.fangraphs.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Hopes and Skenes\nPITTSBURGH — Crossing the Roberto Clemente Bridge over the sun-shimmering Allegheny River two Thursdays ago, I came upon a vendor with Pittsburgh sports merch hanging from the golden steel structure about three and a half hours before first pitch.\nAt any other time, in any other place, such a scene wouldn’t have caught my eye. After all, in this weird world of sports, it is totally normal to see an enterprising middle-aged man trying to make a quick buck — or 80 — by selling fabrics of faith to his fellow congregants. That’s just good business. But the vendor’s specific assortment of apparel was notable because it was limited to three of the most important symbols in Pittsburgh sports these days: Terrible Towels, Roberto Clemente, and Paul Skenes.\nThat’s right, the 22-year-old right-hander who has yet to complete his first full season of professional baseball — at any level — has already become something of an institution in this city. Over the last few months, Skenes has returned the Pirates to relevance for the first time in nearly a decade. His first start, on May 11, was the most highly anticipated starting pitcher debut since Stephen Strasburg’s in 2010. Against the Cubs at Wrigley Field six days later, Skenes dazzled for six no-hit innings; he struck out 11, including the first seven batters he faced and nine of the first 12, and he didn’t allow anyone to reach base until he walked Michael Busch with one out in the fifth. A month into his career, pitching for the first time against the Cardinals at Busch Stadium, Skenes received a standing ovation as he walked off the mound after carving up the St. Louis lineup for 6 1/3 innings; he gave up five hits and no walks and finished with eight strikeouts. He started the All-Star Game for the National League, an honor that rewarded him for his early success and platformed him as one of the faces of baseball for years to come.\nIndeed, Skenes is a transcendent talent who appeals to all generations of baseball fans. Traditionalists love him because he’s a bonafide ace whose easy delivery and precise command allow him to pitch deep into games despite his triple-digit velocity, and with his 6-foot-6, 235-pound frame, he’s built like an old-fashioned workhorse; meanwhile, more analytically savvy seamheads gawk at his splinker, which he started throwing this year and which grades out as one of the nastiest pitches in baseball (2.7 RV/100). And, as the boyfriend of gymnast and social media influencer Livvy Dunne, he is one of the few players whose celebrity stretches beyond baseball. That last part might be just as crucial for MLB as it pushes to rewrite its reputation as a boring relic and reach new fans. Dunne was featured prominently in coverage from the All-Star Game red carpet festivities, on MLB’s social media platforms, and during the broadcast of the game itself.\nMore important than all of that, at least to the people of Pittsburgh, is Skenes’ impact on a franchise that has made the postseason just three times over the last three decades. Those three playoff appearances came in succession, from 2013-15, and the final two consisted of just the Wild Card game. The Pirates have not finished in first place since 1992 — 10 years before Skenes was born.\nCloser David Bednar, who is from Pittsburgh and grew up going to Pirates games, told me there was a palpable vibe shift at PNC Park when Skenes was called up. He said the atmosphere of that game, and of all of Skenes’ starts at home since then, felt like the energy during the team’s three-year run a decade ago.\n“It definitely had that feeling of excitement,” Bednar said. “Come every day that he pitches, you can definitely tell the crowd loves it, and I think everybody kinda feeds off it.”\nIt didn’t matter that the Pirates were in fourth place with 7.4% playoff odds when Skenes debuted, or that the only thing more anemic than their offense was ownership’s willingness to spend to beef it up. The presence of Skenes alone promised a better future in Pittsburgh.\nAnd for the first few months of Skenes, Pittsburgh fans could hope that the future was now. The Pirates remained in the playoff race through the first half of the season, and then played even better coming out of the All-Star break. Entering the day of the trade deadline, they were a second-place team and, at 54-52, only two games out in the Wild Card standings. Their playoff odds were up to 15.9%.\nBut now it was coming on the end of August and the Pirates had just slogged through three brutal weeks of baseball following the trade deadline. That stretch, which included a 10-game losing streak and wiped away any real shot they had at making the playoffs, gave fans a different reason to show up for Skenes: Each start could be his last of the year. They understood the Pirates might choose to end Skenes’ season early to protect him from an injury that could jeopardize his health for next season. More cynically, Pittsburgh could shut him down to make it less likely that he would place first or second in National League Rookie of the Year voting and, as a result, earn a full year of service, which would allow him to reach arbitration and, eventually, free agency on schedule instead of having his payday delayed for one more season.\n“There’s no immediate plans to shut him down,” manager Derek Shelton said before Skenes’ August 22 start. “There have never been any immediate plans to shut him down. How we monitor that, whether it’s an innings limit or workload limit per game, we’ll be thoughtful about that, and, you know, won’t really talk about it, because it can become a competitive advantage on the other side of it, but we are. We’re thinking about it.”\nWhile playing for the Yankees, Pirates infielder Isiah Kiner-Falefa saw the effect Adley Rutschman had on the Orioles during his rookie season two years ago, and he said Skenes is having a similar impact on Pittsburgh since he was called up.\n“I think it’s a sign to everybody that this is a little window right here,” Kiner-Falefa said. “I feel like he’s opened the window.”\nOf course, Skenes’ arrival hasn’t led to the same immediate turnaround for the Pirates the Orioles experienced upon promoting Rutschman to the majors; Baltimore went 67-55 from that point on, while Pittsburgh is 48-51 since Skenes debuted. That’s understandable, considering Skenes starts about once a week while Rutschman is in the lineup almost every day. (To protect his arm, the Pirates have decided not to use him on regular rest this season.) But it’s also undeniable that the Pirates are better because of Skenes. They are 12-7 in his 19 starts, and in three of those seven losses, the Pirates blew the lead after he exited the game. He’s made 13 quality starts, and he has more scoreless starts (five) than he does games in which he’s allowed more than two earned runs (three). Overall, he’s 9-2 with a 2.13 ERA, a 2.75 FIP, and 3.3 WAR. He does not have enough innings to qualify for the ERA title, but among pitchers who’ve thrown at least 100 innings entering play Friday, he ranks second in the majors in ERA, third in FIP, and fourth in strikeouts per nine (11.21).\nFor a while now, I’ve wondered whether one player can alter the outlook and perception of a team. When I asked center fielder Michael A. Taylor about this, thinking he’d be able to offer me some insight gathered during his 11-year career, he said, “You’re probably the guy to answer that question. I bet you’ve got numbers and data at FanGraphs to back that up.” Fair enough. But I’m not sure how revealing the empirical data would be in this case, because how can you measure hope? It’s an intangible emotion that defies logic and probability, and it’s inherently subjective.\n“I think for the organization, he is definitely something to be excited about,” said Taylor. “What he’s done in this short period of time, and just to think he has his full career ahead of him, the sky’s the limit. So, I think fans have the right to be excited.”\nWhile the Reds took batting practice, I spoke to a man named Carmelo who was standing alone in the special guest area on the warning track behind home plate. He said he is friends with Neil Walker, who hooked him up with a ticket to the game. At one point, Carmelo beamed when he saw Dominic Smith trot out for defensive work.\n“Is that Dom Smith?!” he asked me.\n“Yeah, the Reds just claimed him today.”\n“Yo, I love Dom!” He then yelled, “Yo Dom!” Smith turned, saw Carmelo, and said, “Yo man! What are you doing here? I’ll be over in a bit.” Carmelo told me they were friends from Smith’s days playing with the Mets.\nCarmelo said he wasn’t going to stay for the whole game, just until Skenes was relieved. He’d heard the talk about curbing Skenes’ innings and figured he might be able to leave as soon as the fourth inning. I didn’t think the Pirates would pull him that soon, but his thinking — that he needed to see Skenes as soon as possible because there was only a finite amount of time left to do so — made sense. It was the same thing that brought me and thousands of other fans to the ballpark that day.\nAfter the National Anthem, I walked around the concourse behind home plate. As Skenes took his warm-up pitches, there were black mustaches everywhere: women in their 20s wearing fuzzy fake ones, boys rocking yellow t-shirts with a faceless-but-mustachioed Skenes under a Pirates cap, dads sporting their own unkempt carpets above their upper lips. Throughout the night, in addition to countless Skenes jerseys, I also saw a handful of Pirates Hawaiian shirts that must’ve been bought at Dan Flashes and several Grateful Dead-themed tie dye shirts with a “P” on the forehead of the skull.\nI snagged a seat in the back row of the 100-level section behind home just in time to see Skenes get Jonathan India to ground out on the first pitch of the game. Next up was Elly De La Cruz, who worked a five-pitch walk.\nCommand had been a bit of an issue for Skenes entering that night. Across his previous four starts, he’d walked 11 batters in 23 1/3 innings, after totaling 13 walks over his first 12 starts. “He’s been so efficient that when you start to have some maybe normal starts, it gets kind of magnified because of how good he’s been,” Shelton said before the game. “We’ve seen him lose his delivery at times a little bit. And when you lose your delivery, that’s when the ball kind of scatters a little bit.” Some of that probably had something to do with fatigue; even though Skenes carried similar workloads pitching for LSU, he has never pitched this late in the year before. That’s part of the reason the Pirates aren’t planning to shut him down.\n“You have to learn how to get through a major league season,” Shelton said. “It’s important because you don’t know what it’s like until you do it. You don’t know what it’s like to make your final couple starts in September, whenever they are. You realize, like, ‘Hey, man, this is a long season,’ and this is what you’ve got to prepare for.”\nIt’s a tricky balance to strike: The Pirates simultaneously need to figure out the best way to help Skenes develop without overworking him to the point of injury.\nThe walk to De La Cruz set up one of the most exciting moments of the night, as Skenes had to prevent the league’s premiere basestealer from getting into scoring position. With the count 1-2 to Spencer Steer, Skenes threw over to first; De La Cruz dove back safely. Steer fouled off the next pitch, a 100-mph fastball up in the zone, to stay alive. Then, as De La Cruz took a slightly bigger lead, Skenes quickly jump-pivoted and snapped another throw to first. De La Cruz was initially ruled safe, but the call was overturned after Pittsburgh challenged it. That pickoff proved to be crucial: Steer fouled off two more pitches and then grounded a single to left. If De La Cruz had swiped the bag, it would’ve been 1-0 Reds, because any “hit with him on second base is a run,” Skenes said after the game.\nInstead, Skenes struck out the next batter, TJ Friedl, to end the inning. He was already at 19 pitches, but it could’ve been more like 25 or 30 if not for the pickoff, and then maybe Carmelo would’ve been leaving before the fifth inning, after all. Skenes avoided trouble and cruised from there; he’d allow just one more batter to reach base.\nI made my way out to the seats in front of the Miller Lite Landing in center field just in time to watch Skenes strike out the side looking in the second. It was the best vantage point to see both the movement on his pitches, and to see him paint his four-seamer well off the outside corner to a righty batter for called strikes. That’s what happened on the first two second-inning punchouts. It didn’t look like Skenes was only getting lucky, though. Instead, it seems that he saw where home plate umpire Larry Vanover’s zone was — in the bottom of the first, Reds starter Nick Lodolo caught Kiner-Falefa looking at three pitches, with two of those pitches off the plate away, including his first one, a sinker in the lefty batter’s box — and then manipulated it to his advantage.\nLodolo, meanwhile, might have been even better than Skenes the first time through the order; the Pirates didn’t get their first hit until Bryan De La Cruz flared a ground-rule double down the right field line. The next batter, Oneil Cruz, whiffed at a nasty sinker up and in for the final out of the inning, giving Lodolo eight strikeouts on 14 batters faced.\nSkenes allowed his only other hit to begin the fifth, when Amed Rosario — another former Met with whom Carmelo used to hang out — lined a single to right field. He wasn’t on base for long, though, as the next batter, Santiago Espinal, grounded into a double play. Smith then struck out swinging, and Skenes was through five scoreless innings. A conflicted Carmelo presumably was still at the park. And it’s a good thing he didn’t leave, because it was time for the most Pittsburgh thing of the night: The pierogi race!\nFor one magical moment of madness, PNC Park transformed into the streets of Pamplona for the Running of the Bulls. You haven’t lived until you’ve witnessed grown men shout “RUN!” at people in giant pierogi costumes.\nThe happiest person in the ballpark was a 5-year-old boy named Liam, who decided to root for the orange pierogi and then went absolutely bananas when Orange won. He shouted “ORANGE!” and strutted up and down the aisle asking his parents, “Did you SEE that?! Orange won!” I’m not sure I’ve ever been that happy in my entire life.\nI struck up a conversation with his dad, Mark Bentz, a White Sox fan from Allentown. His wife was in Pittsburgh on business, so they made a final family trip out of it before the end of summer. He said they do similar races at Lehigh Valley IronPigs games, the Triple-A affiliate of the Phillies and the Bentz family’s local team, and it was one of Liam’s favorite parts of going to baseball games.\nNearly 19 years ago, when I was a handful of years older than Liam, I saw my first game at PNC Park. It was the first stop on a ballpark tour my dad and I did for my 10th birthday. The Pirates were in worse shape back then than they are now — they finished sixth in the NL Central, at 67-95 — but they did have the reigning NL Rookie of the Year, Jason Bay. On the bump for Pittsburgh that day was Josh Fogg, a far cry from Skenes. (That must be the first time Fogg has been mentioned in the same sentence as Skenes, right?)\nIt was a getaway day game against the Diamondbacks, so it fit perfectly into our travel schedule. After the game, the plan was for my dad to drive the nine hours to St. Louis — he was a machine — so we could explore the city before going to the Friday night Cardinals-Mets game. (That’s a story for another article.) Naturally, the Pirates game went 12 innings.\nI remember two things from that game: Bay threw me a baseball he was warming up with between innings, and Tony Clark, playing first base for Arizona, hit two home runs. Until I looked up the game to write this piece, I forgot that the Pirates won on a Humberto Cota walk-off single against the 39-year-old Buddy Groom. How can you not be romantic about baseball?\nI wonder what Liam Bentz will remember from his trip to PNC Park. Will he recall watching Skenes shove as a rookie? Or cheering for the victorious orange pierogi? What about the burst of offense that happened next?\nIt started out as nothing. Jared Triolo walked with one out and advanced to second on a wild pitch before another Lodolo strikeout, his ninth of the night. Then, he fell apart. He walked Taylor and hit Kiner-Falefa to load the bases for Bryan Reynolds, who smoked a grounder up the middle. De La Cruz gloved it and shoveled it to the second baseman Espinal. Kiner-Falefa, who’d nearly reached second base by the time De La Cruz transferred the ball from glove to bare hand, came into second at full speed, just beating Espinal to the bag, and kept running.\nStretching for the feed while trying to keep his foot on the base, Espinal ended up on his back, quickly recovered, and threw to third baseman Noelvi Marte. Taylor was standing on the base, but Kiner-Falefa was three-quarters of the way to third by this point, so Marte ran at him. Kiner-Falefa retreated to second slowly and signaled for Taylor to start for home. Marte turned back toward third and saw Taylor shuffling off the bag; Lodolo had made his way to cover third, so Taylor couldn’t go anywhere. While Marte’s eyes were glued to what was happening at third, Kiner-Falefa broke back to second; Marte realized this too late, and Kiner-Falefa leapt headfirst to safety ahead of the throw. Everybody was safe. The Pirates led 1-0.\nIt was chaos to see it unfold from center field, like sitting in the end zone at a football game and watching all the moving parts of an offense as a play develops.\nThe flustered Lodolo plunked the next batter, Joey Bart, with a 1-2 curveball to force home Pittsburgh’s second run. Cincinnati called on righty Jakob Junis to face De La Cruz, who waited on a 2-2 slider and lifted it over Rosario’s head in right field for a bases-clearing double. Cruz capped off the six-run fifth with a 106-mph single to drive in De La Cruz.\nAt this point, I jotted in my notebook: “Skenes sitting for a while. Prob won’t pitch 6th?” It felt like a 6-0 game after a long half inning would’ve been a reasonable time to take Skenes out if Pittsburgh’s main intention was to limit his workload. But when the Pirates were finally retired, Skenes emerged from the dugout for one more frame. He struck out Marte and Luke Maile, and then got India to pop out. His final line: six innings, two hits, no runs, one walk, nine strikeouts, 87 pitches, pure dominance.\nThe 7-0 victory was Pittsburgh’s fifth win in its 20 games since the day of the trade deadline, and though the Pirates took two more games from the Reds that weekend, they faltered again afterward. They finished August with an 8-19 record. As it was with Rutschman in 2022, Strasburg in 2010, and Mike Trout in every year except 2014, Skenes will not lead his team to the postseason this year. Pittsburgh’s playoff odds officially hit 0.0% on August 28. One elite talent alone cannot elevate a mediocre team into a successful one.\nWhat he can do, though, is change the direction of this long-suffering organization by providing hope that, in the words of Kiner-Falefa, “this is a little window right here.” That window won’t stay open forever. That means the time is now for the front office to assemble a solid supporting cast around him, and more importantly, for ownership to offer them the budget to do so.\nThat last part may seem impossible, because owner Bob Nutting doesn’t seem to care much about building a winning team so long as it’s profitable. But even frugal team owners can be motivated to invest more in their roster if they believe that’s the best way to maximize profits. He determined it was worth it to extend Reynolds and Ke’Bryan Hayes, to approve the trade deadline additions of Kiner-Falefa and Jalen Beeks, and — for some misguided reason — to spend $10.5 million on Aroldis Chapman. Maybe Nutting will be willing to invest more money heading into Skenes’ first full season in the majors. Winning, after all, is a most profitable endeavor.\nAs I walked back to my car on the other side of the Allegheny, I thought about that vendor I saw on the way over, with the Skenes jersey positioned next to the Clemente one and the Terrible Towels. He was no longer there, but he’d be back again the next day, ready to sell these fans more emblems of their past glories and the promises of more memories to come, courtesy of their great new hope, the mustachioed man with the power arm.\nMatt is the associate editor of FanGraphs. Previously, he was the baseball editor at Sports Illustrated. His work has appeared in The New York Times, Men’s Health, Baseball Prospectus, and Lindy’s Sports Magazine. Follow him on Twitter @ByMattMartell and Blue Sky @mattmartell.bsky.social.",
  "word_count": 3749,
  "scraped_at": "2026-02-14T13:30:38.492263"
}