{
  "article_id": "f340240076d2",
  "url": "https://www.thenationalnews.com/news/us/2025/09/25/trump-to-host-erdogan-at-white-house-with-trade-gaza-and-military-jets-up-for-discussion/",
  "title": "Trump to host Erdogan at White House with trade , Gaza and military jets up for discussion",
  "date": "20250925T061500Z",
  "domain": "thenationalnews.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "US President Donald Trump on Thursday said a Gaza deal was close to being completed.\nMr Trump is preparing to announce a Gaza ceasefire proposal, after he presented a 21-point plan to Arab leaders at the UN this week.\n“We want to get Gaza over,” he told reporters as he welcomed Turkish President Recep Tayyip Erdogan to the White House.\n“I had a great meeting with the leaders of that area, of that region, generally speaking, the Middle East, meeting the other day. I think we're close to getting some kind of a deal done.”\nMr Trump hosted a meeting about Gaza with Arab and Muslim countries on the sidelines of the UN on Tuesday. Attendees have described it as productive.\n\"I will not allow Israel to annex the West Bank, I will not allow it, not going to happen,\" Mr Trump said from the Oval Office later on Thursday.\nIsraeli President Benjamin Netanyahu is set to address the UN on Friday, and will meet Mr Trump at the White House on Monday.\nThe White House meeting on Thursday comes after Mr Trump and Mr Erdogan addressed the UN General Assembly this week.\nDuring his UN address, Mr Erdogan criticised Israel's actions, calling the war a genocide. He repeated that the international community must act, as “everyone who is keeping silent is an accomplice to this barbarity”.\nThe two leaders are also likely to address disagreements over Syria and Kurdish groups, one of the most persistent fault lines between Washington and Ankara.\nMr Erdogan was also expected to use his meeting with Mr Trump to press for stronger American recognition of Turkey’s security concerns and possibly for a reconfiguration of US support in Syria.\nThe US President, who had a pin on his lapel depicting an F-35 jet, said he and Mr Erdogan would discuss the fighter programme “very seriously.” Turkey was suspended from buying F-35s in 2019 after purchasing Russian S-400 missile systems.\n“We're going to have a discussion, big discussion,” Mr Trump said.\n“We do a lot of trade with Turkey, and we're going to continue. We're going to do some additional [trade]. They want to buy F-16s, F-35s and some other things.”\nThere are legal and Congressional obstacles to Turkey rejoining the F-35 programme, despite Mr Trump's openness to major deals.\nUnder US-imposed sanctions known by their acronym Caatsa, Ankara is subject to penalties for making “significant transactions” with Russia’s defence sector – making it difficult for any administration to restore Turkey to the F-35 programme without congressional approval or a formal withdrawal of those sanctions.\nMr Trump called his Turkish counterpart “tough” and “opinionated” and took a swipe at Ankara for buying Russian oil amid its war against Ukraine.\n“I'd like to have him stop buying any oil from Russia while Russia continues this rampage,” Mr Trump said.\nMehmet Ceylan, a former Turkish permanent representative to Nato, said only a high-level compromise – such as deactivating the system indefinitely or returning it to Russia – could ease Caatsa sanctions and reopen the door to F-35 co-operation.\n“Without a solid compromise on the future of the S-400 between Turkey and the US, it would be extremely difficult, if not impossible, to find a conducive ground for Turkey to get back to the F-35 production and procurement as long as the US position remains intact,” Mr Ceylan told The National.\n“I think the upcoming contact between the two presidents could yield a compromise to the satisfaction of both countries.”\nBeyond the sanctions, there is also broad bipartisan scepticism of Mr Erdogan among many members of Congress, who criticise Ankara for authoritarian policies at home, its confrontations with Nato ally Greece, as well as Cyprus, and its alignment with Russia on some defence purchases.\nThe long-time Turkish leader is also seeking deeper industrial co-operation with the US, which would involve Turkish companies in aircraft production.\nIn a goodwill gesture before the visit, Turkey on Monday lifted tariffs on a range of US imports, indicating its readiness to expand trade ties after years of tension.\nLizzie Porter contributed to this report from Istanbul",
  "word_count": 683,
  "scraped_at": "2026-02-14T12:12:04.687693"
}