{
  "article_id": "f36205672268",
  "url": "https://www.illawarramercury.com.au/story/8155694/sam-kerr-inspires-matildas-to-amazing-win-over-england/",
  "title": "Sam Kerr inspires Matildas to amazing win over England",
  "date": "20230412T000000Z",
  "domain": "illawarramercury.com.au",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Sam Kerr hopes Australia has woken up delighted to the news that her Matildas, inspired by her own striking brilliance, have earned a sensational 2-0 triumph over England.\nSubscribe now for unlimited access.\nor signup to continue reading\nDemonstrating once again why she's the deadliest striker in the women's game at Brentford's Gtech Community Stadium on Tuesday, the Australian captain pounced on a first-half error by England skipper Leah Williamson to put the Matildas ahead.\nThen she turned provider after the break, her pinpoint cross being headed home by Charlotte Grant, via a deflection off the hapless Williamson, to hand the European champions their first defeat in 31 matches.\n\"Hopefully, waking up in Australia this morning, there's a few happy Aussies,\" smiled Kerr.\nIt was an extraordinary result, carved out against all the odds by an injury-hit team on a miserable, rain-drenched night in London which perfectly demonstrated coach Tony Gustavsson's belief that the Matildas need fear no-one at their home World Cup in July.\n\"It does a lot (for the game back home),\" said Kerr.\n\"England are such a footballing nation that when people wake up and see the Matildas have beaten them, it's big news.\"\nWhat an overseas send-off this was - and it was no absolutely no fluke.\nFrom the outset, Kerr's team, faced by an overwhelmingly partisan full house of 14,500, were as aggressive, in-your-face and committed as Gustavsson had promised they would be.\n\"Their combination of head and heart makes me really proud,\" said the Swede.\nWith their punch and invention on the counter-attack, his side consistently discomfited a team who hadn't lost a match for two years and had just won the Finalissima against South American champions Brazil.\nIndeed, Australia might have won even more convincingly as England's rearguard were stretched time and again by their sharpness on the counter-attack, with substitute Cortnee Vine, who'd come on for the injured Tameka Yallop in the first half, excelling.\nKerr was magnificent, leading from the front and ending worries over her fitness to spearhead their challenge.\nThe Chelsea ace was pronounced fit to lead the line in a starting line-up that showed two changes from the team beaten 1-0 by Scotland on Friday.\nKerr said she hadn't been carrying an injury but was having her playing load managed by both Chelsea and the national team.\nWith the rain driving down, the Matildas, as Gustavsson suggested they would, never looked remotely overawed, even though they were without 10 important players.\nStill it was against the run of play that Kerr struck in typically predatory fashion.\nShe had barely had a sniff for the first 32 minutes but when Clare Hunt hoofed a long ball forward, she was on to her opposing captain Williamson like a hawk, shadowing her and anticipating that she'd try to nod the ball back to her keeper Mary Earps.\nShe did just that, but too weakly and Kerr diverted it expertly first-time over the advancing keeper for the 63rd goal of her storied international career.\nEngland were stunned, but though they redoubled their pressure, Australia's back four remained steadfast through to the break, despite the dispiriting sight of a limping Yallop being helped off the pitch after she came off worse in a challenge with Kelly.\nAustralia could have nicked a second with a couple of breaks early in the second half which ended with Kerr missing two opportunities she'd normally gobble up.\nEngland, while enjoying the lion's share of possession, created only one truly glaring chance which sub Rachel Daley headed wide, but Clare Polkinghorne and Hunt, absolute rocks in central defence, ensured there was no way through for the deflated home attack.\nOur news app has had a makeover, making it faster and giving you access to even more great content. Download The Illawarra Mercury news app in the Apple Store and Google Play.",
  "word_count": 643,
  "scraped_at": "2026-02-14T12:55:39.338219"
}