{
  "article_id": "f3caf081d710",
  "url": "https://www.westmeathexaminer.ie/2025/02/05/wednesdays-briefing-arteta-rues-striker-failure-ahead-of-carabao-cup-semi-final/",
  "title": "Wednesday briefing : Arteta rues striker failure ahead of Carabao Cup semi - final",
  "date": "20250205T141500Z",
  "domain": "westmeathexaminer.ie",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Wednesday’s briefing: Arteta rues striker failure ahead of Carabao Cup semi-final\nBy PA Sport Staff\nMikel Arteta has voiced his frustration at Arsenal’s failure to sign a striker in the January transfer window while the Premier League have given details of VAR shortcomings.\nThere has also been some further transfer activity and Championship promotion-chasers Burnley have been in action.\nArteta had made clear his desire to bring in a new forward after Gabriel Jesus was ruled out for the remainder of the season through injury.\nThe title-chasing Gunners had been heavily linked with Aston Villa’s Ollie Watkins but no deal materialised before Monday’s deadline, leaving Kai Havertz as their sole recognised senior striker.\n“We had a clear intention to explore the opportunities to improve our squad with players that can impact it,” said Arteta. “And we haven’t achieved that so we are disappointed in that sense.\n“We’re going to have to be very flexible with the front line. It’s not a gamble, it’s reality and we have to face the reality.\n“I am not worried. Now I focus on the numbers that we have, how to maximise them, how to make the best out of them.”\nThe Premier League’s Key Match Incidents Panel has reported there have been 13 VAR errors so far this season.\nThat is made up of four incorrect VAR interventions and nine missed interventions, the league said on Tuesday.\nWhile it has not specified the missed interventions, the four occasions where it believes VAR intervened and the wrong decision was reached were revealed.\nThese were Dango Outtara’s disallowed late winner for Bournemouth against Newcastle in August, a penalty awarded to West Ham in their win over Manchester United in October, a red card for Brentford’s Christian Norgaard against Everton in November and Nikola Milenkovic’s disallowed goal for Nottingham Forest against Southampton last month.\nMeanwhile, Premier League chief football officer Tony Scholes said “significant progress” had been made with semi-automated offside technology and it could still be introduced before the end of the season.\nChelsea forward Joao Felix has joined AC Milan on loan for the remainder of the season, it was confirmed on Tuesday.\nThe move, which was completed before the Serie A transfer deadline on Monday, comes just six months after the Portuguese made a permanent move to Stamford Bridge from Atletico Madrid.\nManchester United defender Tyrell Malacia was also on the move, joining Eredivisie leaders PSV Eindhoven for the remainder of the campaign.\nManchester City have revealed record goalscorer Bunny Shaw was sent racist and misogynistic messages following Sunday’s Women’s Super League game against Arsenal.\nThe matter has been reported to police.\n“An investigation will follow and the club offers our full support to Bunny following the disgusting treatment she’s received,” read a club statement.\nOn the field, Burnley moved second in the Sky Bet Championship with a 1-0 victory over Oxford at Turf Moor.\nThe only goal of the game came when Michal Helik turned into his own net in the 33rd minute.\nThe win took the Clarets, who are now unbeaten in 18 games, above third-placed Sheffield United on goal difference, two points behind leaders Leeds but having played a game more than both their rivals.\nNewcastle, chasing their first major trophy since 1969, will hope to book a place in the Carabao Cup final for the second time in three seasons as they take on Arsenal in the second leg of their semi-final at St James’ Park. The Magpies lead 2-0 on aggregate following the first leg last month.\nChampionship leaders Leeds have a chance to extend their lead at the top of the table to five points but face a tough test as they travel to Frank Lampard’s in-form Coventry, who have won their last four games.\nNorth of the border, William Hill Premiership leaders Celtic, who have a 10-point lead over rivals Rangers at the summit, play their game in hand as they host 10th-placed Dundee.",
  "word_count": 657,
  "scraped_at": "2026-02-14T12:43:12.154942"
}