{
  "article_id": "f4007f04cd7e",
  "url": "https://wtug.com/ixp/532/p/lottery-dominates-legislatures-1st-week/",
  "title": "Lottery Dominates Legislature 1st Week",
  "date": "20240209T004500Z",
  "domain": "wtug.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Lottery Dominates Legislature’s 1st Week\nThe first week of the 2024 Alabama legislative session is in the books but everyone is still talking about Tuesday on Goat Hill today. That is when the House Gaming Study Group issued their findings of a near yearlong study. What they discovered is what most people already knew. There is illegal gambling in all 67 counties and Alabama is missing out on millions by not legalizing it.\nDuring her State of the State Address Tuesday night Gov. Ivey threw her support behind letting voters, not legislators, decide on a lottery and gaming. “I believe the current proposal being contemplated by the Legislature is good for Alabama,” Ivey said, “and I will be carefully watching it move through the process. It will crack down on illegal gambling, and it will responsibly regulate limited forms of legal gaming, including a statewide lottery.\"\nStudy Group member, Rep, Chris Blackshear (R-Phenix City), agreed with Ivey, “We’ve kicked the can down the road too long,” he said. “All we are trying to do is put a good package together that allows the citizens of Alabama to decide what they want. Ultimately, their votes decide.”\nThere has not been a statewide vote on gambling since former Gov. Don Siegelman’s proposed lottery failed in 1999. Bills have stalled since then due to lawmaker opposition to legalized gambling as a revenue source and disputes over who would get casino licenses.\nThe last time there was a public lottery vote it was defeated by a strange alliance between conservative politicians, church groups, moralist organizations, and tribal casinos.\nThe Alabama Constitution currently bans lotteries and casinos. To change that, the measure would have to be approved by three-fifths of members in both legislative chambers and then a majority of voters in a statewide referendum.\nIn other legislative action this week, The Alabama Senate Government Affairs Committee advanced controversial legislation that would make it illegal for anyone to be compensated to collect absentee ballots in Alabama. Otherwise called the \"Anti-Ballot Harvesting Bill\", the legislation cosponsored by Sen. Gerald Allen (R-Cottondale), worries Democrats who fear volunteer and church groups would be criminalized for assisting homebound and seniors with absentee ballots.\nSeveral organizations had representatives present at the committee meeting to oppose the bill, including the League of Women Voters of Alabama, the National Federation of the Blind of Alabama, and Greater Birmingham Ministries.\nAnother bill that got senate committee approval gives local governments the power to remove public library board members by majority vote. Critics claim the bill would politicize libraries and lead to book banning.\nThe Senate Education Policy Committee ok'd Jasper Republican Senator Greg Reed's “Parents’ Right to Know” bill, putting it in line for a floor vote today, which it got.\nThe bill requires the curricula that will be used in each classroom across each school district in Alabama to be posted on the school website at the beginning of each school year or within 30 calendar days after a new or revised curriculum is adopted. The posting will be verified by the local superintendent of education and local board of education.\nThe bill passed on the floor, modified by an amendment from Senate Minority Leader Bobby Singleton (D-Greensboro). It now moves to the house.\nThe original version of the bill required instructors to schedule appointments with parents or guardians who wanted to review classroom material. Singleton’s amendment allows the instructor to provide information regarding the curriculum and the supplementary materials over the phone or through email and other electronic means. It also would transfer the matter to members of the local board of education.\nThe house also today introduced a resolution to honor Alabama football's history making place kicker Will Reichard. It congratulated him on numerous accomplishments, including becoming the NCAA's all-time points leader.\nAcross the street from the State House, Gov. Ivey followed through on her State of the State pledge. She signed an Executive Order creating a Task Force to \"Promote Responsible Use of Generative Artificial Intelligence in State Government.\"\nThe senate met for less than 2 1/2 hours this morning while the house adjourned at noon. Both will be back in session Tuesday,",
  "word_count": 694,
  "scraped_at": "2026-02-14T13:11:43.268063"
}