{
  "article_id": "f405c1651d7d",
  "url": "https://www.twtd.co.uk/ipswich-town-news/40344/twtd-questionnaire-2020-21/onthisday",
  "title": "TWTD Questionnaire 2020 / 21 - Ipswich Town News",
  "date": "20240602T201500Z",
  "domain": "twtd.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Wednesday, 2nd Jun 2021 11:06\nWelcome to the annual TWTD Questionnaire, your chance to look back in judgement at Town's 2020/21 season.\nThe results of the TWTD Questionnaire will be made available once TWTD's supercomputer, the Osborne 1.0, has finished the processing later in the summer.\nThis year, due to the absence of fans, a number of regular questions are missing, among them the best away day, best away fans at Portman Road and ratings on the concourse bars and FanZone. Thankfully it seems likely they'll be back on next year's survey.\nSimilarly, there are no questions on ITFC Women's season with their league programme having lasted only four matches. They'll be back on next year's questionnaire, ideally with the Tractor Girls in a higher division.\nIt's still fairly long, so leave the odd question out if you can't decide on an answer, it doesn't apply to you, you're getting a bit bored or you're starting to feel tired. All answers will be treated in the strictest confidence.\nThe TWTD Questionnaire, has been run for more than 20 years and is the biggest annual survey carried out amongst Town supporters with 1636 fans responding last year. All the relevant people are made aware of the results.\nTo fill in this year’s TWTD Questionnaire and to look at those from previous seasons, click here.\nPhoto: Matchday Images\nPlease report offensive, libellous or inappropriate posts by using the links provided.\n- Page:\n- 1\nI put \"poor\" for Lambert and \"very poor\" for Cook.\nThat's extremely worrying!\nWe panic buy and get spunked by other clubs.....\nBut let's keep the positive vibe can't wait to get back to PR, missed it badly despite the kak season...not just about the football it's being around the place with friends and family.\nThink we all felt Cook would do better and has left cause for concern. Prepared to give benefit of doubt whilst he builds his own squad.\nTeddy Bishops goals v Blackpool was pretty good....showed drive and skill that we desperately need on a consistent basis.\nPlenty of favourite players but Wark for me every single time. Could play anywhere, changed games, set up chances, prolific goalscorer, records, trophies and won the league players player of the year BEFORE Kenny Dalglish (and something the overrated Beckham never achieved). If he played today his transfer fee for a goalscoring defensive midfielder would be £70-80 million\nLambert was Average but Cook was VERY Poor with the same players. I think he will be able to take us up to the Championship next season if he has money to spend and can keep KVY and maybe Downes, Kenlock, Dobra and Norwood. The rest can go f...off.\nThe player of the season has to be KVY even though he had minimal game time - what does that tell you about the rest of the squad.\n- Page:\n- 1\nYou need to login in order to post your comments",
  "word_count": 491,
  "scraped_at": "2026-02-14T13:12:34.241926"
}