{
  "article_id": "f40c8e5d1ecb",
  "url": "https://www.offalyindependent.ie/2023/03/16/russias-daniil-medvedev-sorry-for-ukrainian-players-amid-tour-tensions-over-war/",
  "title": "Russia Daniil Medvedev sorry for Ukrainian players amid Tour tensions over war",
  "date": "20230316T154500Z",
  "domain": "offalyindependent.ie",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Russia’s Daniil Medvedev sorry for Ukrainian players amid Tour tensions over war\nBy Eleanor Crooks, PA Tennis Correspondent\nRussia’s Daniil Medvedev said he feels sorry for Ukrainian players as tensions over the war’s impact on tennis came to the fore in Indian Wells.\nUkrainian Lesia Tsurenko withdrew ahead of her scheduled clash with Belarusian Aryna Sabalenka on Monday, revealing later that she had a panic attack after a conversation with WTA chief Steve Simon over its response to the invasion of her country.\nRussian player Anastasia Potapova, meanwhile, has been warned by the WTA after wearing a Spartak Moscow football shirt ahead of her clash with Jessica Pegula earlier this week.\nMedvedev, the highest profile current Russian player, said after reaching the semi-finals: “I definitely do feel sorry for all the Ukrainian players and what they go through. For sure, the situation with Tsurenko, I don’t know in detail. It’s more for her and for maybe a little bit Sabalenka to answer.”\nRussian and Belarusian players have been criticised for not publicly coming out against the war in Ukraine in greater numbers, and Medvedev again talked only in vague terms about the situation.\n“Talking about top players, of course we have a responsibility, and it depends how every person, individual, will do with it and will hold with it,” he said. “I always said the same, I’m for peace all over the world, and that’s all I can say.”\nWomen’s world number one Iga Swiatek has seen up close the effects of the conflict in her country, Poland, which neighbours Ukraine.\nShe has been outspoken in calling for more support for Ukrainian players and urged tennis to change its approach after defeating Emma Raducanu in the fourth round.\n“For sure it’s a tough situation,” she said. “For me, it’s pretty emotional because I feel like these situations are happening, like with people that are wearing a Russian team football T-shirt, because at the beginning we didn’t have proper leadership to guide us through all of that, and there is a lot of tension in the locker room.\n“But maybe it should be a little bit less if WTA put some action at the beginning to kind of explain to everybody what is right and what is not.\n“I totally understand why (Tsurenko) withdrew, because I respect Ukrainian girls so much. If a bomb landed in my country or if my home was destroyed, I don’t know if I could handle that, honestly, and play on the WTA and compete.\n“I feel there should be done a little bit more to help Ukrainian players, because I feel like everything we discuss in tennis is more about Belarusian and Russian players, if they should be allowed, what’s going on with them.\n“It’s unfortunate that some people were born in countries that make the war, but I feel like they should be more responsible sometimes.”\nWimbledon organisers will no doubt be following the situation closely as they prepare to make a final decision on whether to lift the ban on Russian and Belarusian players for this year’s tournament to bring them in line with the rest of the sport.\nOn court, meanwhile, Medvedev overcame another fall as he defeated Alejandro Davidovich Fokina 6-3 7-5 in the quarter-finals.\nA day after rolling his ankle in a tight victory over Alexander Zverev, Medvedev split open his thumb in the second set against Davidovich Fokina as he made it 18 straight wins.\n“The moment I cut it, I saw, I don’t know if I should say it, kind of the meat,” he told a press conference. “That was not nice to see. They cleaned it now. I have a small tape. It should be fine.”\nMedvedev will take on American Frances Tiafoe, who defeated British number one Cameron Norrie on Wednesday, in the last four while the first women’s semi-final will be between Australian Open champion Sabalenka and seventh seed Maria Sakkari.",
  "word_count": 656,
  "scraped_at": "2026-02-14T13:45:23.693609"
}