{
  "article_id": "f41473d2ea8f",
  "url": "https://www.marketscreener.com/quote/stock/SKECHERS-U-S-A-INC-14408/news/NFL-Champion-Head-Coach-Andy-Reid-Joins-Skechers-Slip-ins-Team-Reid-Now-Starring-in-Skechers-Hands-48466204/",
  "title": "NFL Champion Head Coach Andy Reid Joins Skechers Slip - ins Team ; Reid Now Starring in Skechers Hands Free Slip - ins Campaign with More to Come as He Brings the Brand Comfort and Convenience into the Postseason",
  "date": "20241126T154500Z",
  "domain": "marketscreener.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Coach\nCoach\n'I tell our players to never get too comfortable mentally, but after standing on\n'Coaching championship-caliber teams takes everything you've got, so anyone will understand exactly why\nNow in the midst of his 12th season as head coach of the\nSkechers offers its complete range of footwear at Skechers retail stores and skechers.com, as well as at department stores and footwear retailers around the globe.\nAbout\nSkechers (NYSE:SKX),\nThis announcement contains forward-looking statements that are made pursuant to the safe harbor provisions of the Private Securities Litigation Reform Act of 1995, Section 27A of the Securities Act of 1933, as amended, and Section 21E of the Securities Exchange Act of 1934, as amended. These forward-looking statements may include, without limitation, Skechers' future domestic and international growth, financial results and operations including expected net sales and earnings, its development of new products, future demand for its products, its planned domestic and international expansion, opening of new stores and additional expenditures, and advertising and marketing initiatives. Forward-looking statements can be identified by the use of forward-looking language such as 'believe,' 'anticipate,' 'expect,' 'estimate,' 'intend,' 'plan,' 'project,' 'will,' 'could,' 'may,' 'might,' or any variations of such words with similar meanings. Any such statements are subject to risks and uncertainties that could cause actual results to differ materially from those projected in forward-looking statements. Factors that might cause or contribute to such differences include the disruption of business and operations due to the COVID-19 pandemic; delays or disruptions in our supply chain; international economic, political and market conditions including the effects of inflation and foreign currency exchange rate fluctuations around the world, the challenging consumer retail markets in\nMedia Contact:\njennc@skechers.com\nSource:\nReleased\n(C) 2024 Electronic News Publishing, source",
  "word_count": 287,
  "scraped_at": "2026-02-14T12:18:30.399829"
}