{
  "article_id": "f43b525ce25b",
  "url": "https://www.the42.ie/ireland-wnt-watch-internationals-abroad-6068270-May2023/",
  "title": "WNT Watch : Relegation in Germany , Celtic goal - scoring hero and Stateside success",
  "date": "20230515T114500Z",
  "domain": "the42.ie",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "IT WAS A mixed weekend for Republic of Ireland internationals abroad as the countdown to the 2023 Women’s World Cup continues.\nIreland make their major tournament debut in just over nine weeks — or 66 days — against co-hosts Australia in Sydney.\nAs the 20 July showdown moves into full view, squad competition will reach boiling point with players at home and abroad doing their utmost to be in Vera Pauw’s plans.\nWhile it was another busy Saturday in the Women’s Premier Division and Aoife Mannion and her Manchester United side suffered FA Cup final heartbreak at Wembley on Sunday, there was plenty of other action further afield.\nThere was disappointment for Amber Barrett in Germany, as Turbine Potsdam were relegated from the Frauen-Bundesliga.\nThey suffered a 5-1 home defeat to Bayer Leverkusen on Saturday, and the traditional German heavyweights were consigned to the drop with just eight points secured from 20 games so far this season.\nBarrett featured as a second-half substitute after a challenging first season at the club: Ireland’s World Cup play-off hero was sidelined with a shoulder injury for a lengthy period, and she has mostly been deployed at right-back despite being a natural striker.\nShe has previously experienced relegation in Germany, with FC Köln in 2020.\nPotsdam are two-time Uefa Women’s Champions League winners (2005 and 2010) and have won the Frauen-Bundesliga on six occasions. RB Leipzig will now replace them in the top-flight.\nDenise O’Sullivan, Marissa Sheva and Nicole Douglas were all on winning sides in the NWSL last night. O’Sullivan captained North Carolina Courage to a 1-0 victory over OL Reign — home of Megan Rapinoe and a host of other big names — while Sheva came off the bench as Washington Spirit overcame Angel City on the same scoreline in LA thanks to an injury-time penalty.\nThe three-cap Ireland senior and former US underage international also scored a superb goal last week:\nOH MY @marissasheva whatta banger 🥵 pic.twitter.com/sYjXArEpFK\n— National Women’s Soccer League (@NWSL) May 11, 2023\nSpirit moved top of the table as a result, leapfrogging OL Reign, with Sinead Farrelly’s Gotham FC staying in touch after a 0-0 draw with Orlando Pride.\nTo Scotland next, where Claire O’Riordan has enjoyed a huge few days with Celtic. The Limerick defender scored in Thursday’s 3-1 win over Glasgow City at Celtic Park, a record crowd of 9,553 watching on at Paradise as the Hoops kept their title hopes alive. She was on target again yesterday in a 2-1 win at Hibernian, ensuring the race goes down to the final day.\nGlasgow City, Rangers and Celtic are all in with a shout, the former pair gearing up for what could be a straight shoot-out as City lead their other rivals by just two points.\nIrish-eligible Caitlin Hayes captains Celtic, and she was named Player of the Year last night, reflecting her impressive individual campaign.\nClaire Walsh and Emily Whelan both featured in Glasgow City’s late 2-1 win over Partick Thistle with Aoife Colvill on the bench as she returns from an ACL injury, while Ciara Grant — recently named on the SWPL Team of the Year after a superb season — missed Hearts’ 6-0 hammering to Rangers.\nIn Spain, Tyler Toland was an unused substitute in Levante’s 3-2 defeat to Real Madrid, while several other Irish players dotted across the continent were out of action over the weekend: Niamh Farrelly (Italy), Roma McLaughlin (Denmark) and Tiegan Ruddy (Switzerland) to name a few.\nCloser to home, the Women’s Super League is going right down to the wire with 13 Irish players involved. Mannion’s Manchester United are best placed to dethrone Chelsea, while Katie McCabe will hope to captain Arsenal to a Champions League spot.\nRelegation to the Championship appears imminent for Grace Moloney, Diane Caldwell and Reading.\nThe second-tier action is wrapped up with Chloe Mustaki’s Bristol City winning it out, finishing one point clear of Birmingham City (Louise Quinn, Jamie Finn, Lucy Quinn and Harriet Scott). London City Lionesses (Hayley Nolan, Lily Agg and Kyra Carusa) finished third, while Coventry City suffered relegation despite the best efforts of Eleanor Ryan-Doyle during her loan move",
  "word_count": 692,
  "scraped_at": "2026-02-14T12:14:59.718558"
}