{
  "article_id": "f49c3647826b",
  "url": "https://patriotpost.us/digests/104953-mid-day-digest-2024-03-05",
  "title": "Mid - Day Digest",
  "date": "20240305T210000Z",
  "domain": "patriotpost.us",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Mid-Day Digest\nTHE FOUNDATION\n“We should be unfaithful to ourselves if we should ever lose sight of the danger to our liberties if anything partial or extraneous should infect the purity of our free, fair, virtuous, and independent elections.” —John Adams (1797)\nIN TODAY’S DIGEST\n- A Tough Day for TDS in 9-0 SCOTUS Case\n- ‘Extremists Attack the Integrity of Free and Fair Elections’\n- Executive News Summary\n- Higher Education’s Broken Promise?\n- DEI Is Gator-Chomped Out of the University of Florida\n- Biden Placates the Jew Haters\n- DAILY FEATURES: Reader Comments, Videos, Best of Right Opinion, Short Cuts, Memes, and Cartoons.\nON THE WEB\n- Mark Alexander: Profiles of Valor: The Roosevelts\n- Mike Rhinehart: Demise of the ‘Down and Out’ Motel\n- In Brief: The Truth About Alabama’s Ruling on IVF\nFEATURED ANALYSIS\nA Tough Day for TDS in 9-0 SCOTUS Case\nIn a resounding slapdown of Colorado, the Supreme Court said that states can’t simply kick a guy off the ballot because they don’t like his politics.\nDouglas Andrews\nNine-zip. Nine-zilch. Nine-nada.\nIt’s said that 9-0 rulings aren’t all that rare when it comes to Supreme Court decisions. The “fact-checkers” at PolitiFact tell us that they’ve usually accounted for a plurality of rulings, and that they’ve never fallen below 36% of all rulings since 2008.\nAnd that may be true — we have no reason to doubt it — but it seems that such resounding rulings almost always come in little-watched cases, like when the justices are registering their collective disgust at the heavy-handed legal tactics of an obscure hack like Trump special persecutor Jack Smith. Indeed, rarely do 9-0 decisions accompany such high-profile and heavily watched cases as yesterday’s Colorado ballot case — a case of TDS, a case of Trump Derangement Syndrome.\nAnd yet.\nThe Trump-hating Democrats (but we repeat ourselves) who’d prefer to keep the former president off the 2024 ballot were dealt a seemingly mortal blow late yesterday morning as the John Roberts court ruled unanimously that Colorado could not kick Donald Trump off its 2024 presidential primary ballot.\nAs Fox News reports: “All nine justices ruled in favor of Trump in the case, which will impact the status of efforts in several other states to remove the likely GOP nominee from their respective ballots. The court considered for the first time the meaning and reach of Article 3 of the 14th Amendment, which bars former officeholders who ‘engaged in insurrection’ from holding public office again. Challenges have been filed to remove Trump from the 2024 ballot in over 30 states.”\nAs to whether the hopes of all those other Trump-banning states are still alive, still able to keep him off their ballots, constitutional law professor Jonathan Turley seemed — shall we say? — rather dubious. “I think they’re all dead as Dillinger,” he said. “When you read this opinion, there is no dissent that the states cannot enforce the 14th Amendment provision.” That Civil War-era provision, according to assorted lefties in high places across certain states, allows them to ban The Insurrectionist Trump™ from their presidential ballots.\nA few weeks ago, we suggested that the Colorado Supreme Court’s December 19 decision — a 4-3 decision by an all-Democrat court — was Trump-deranged hogwash, and we wondered whether the Supreme Court would make a statement by ruling unanimously in declaring it so. And sure enough, they have, in what can only be called a great victory for Chief Justice John Roberts. “The only disagreement,” Turley added, “is whether the court should’ve gone even further to close off future arguments or challenges without an action from Congress.”\nIt seems like only a few weeks ago that Trump-deranged former federal judge and short-list Bush Supreme Court candidate Michael Luttig said: “Yesterday’s decision by the Colorado Supreme Court was, uh, masterful. Uh, it, it, was brilliant. Uh, and, uh, it is an unassailable, uh, interpretation, uh, of the 14th Amendment.”\nSo much for “uh, masterful.”\n“I want to start by thanking the Supreme Court for its unanimous decision today,” said the former and perhaps future president, Donald Trump. “It was a very important decision, [was] very well crafted, and I think it will go a long way toward bringing our country together, which our country needs. And they worked long, they worked hard, and frankly, they worked very quickly on something that will be spoken about 100 years from now and 200 years from now. Extremely important.”\nTrump added: “The voters can take the person out of the race very quickly. But a court shouldn’t be doing that. And the Supreme Court saw that very well. And I really do believe that will be a unifying factor because while most states were thrilled to have me, there were some that didn’t, and they didn’t want that for political reasons.”\nAnd so, as The Babylon Bee quipped, “In Major Blow To Democracy, Supreme Court Rules Voters Can Vote For Favorite Candidate.” As Justice Amy Coney Barrett said in her concurrence: “The Court has settled a politically charged issue in the volatile season of a Presidential election. Particularly in this circumstance, writings on the Court should turn the national temperature down, not up. For present purposes, our differences are far less important than our unanimity: All nine Justices agree on the outcome of this case. That is the message Americans should take home.”\nIndeed, that is the message that all Americans should take home, but Trump derangement being what it is, we expect the Left’s caterwauling about the Supreme Court’s “illegitimacy” will only grow louder and more grating — ironically, even in the face of a 9-0 smackdown. And sure enough, it has.\nColorado Secretary of State Jena Griswold looked to be on the verge of tears as she stared wide-eyed into the teleprompter and reacted to the repudiation of her state’s errant decision: “My larger reaction is disappointment,” she said. “I do believe that states should be able, under our Constitution, to bar oath-breaking insurrectionists. … Ultimately, it will be up to the American voters to save our democracy in November. … Regardless of this decision, American democracy still remains very much under attack, and that threat, in this upcoming election, will be crucial for democracy’s survival in the United States.”\nWhen someone says it’s not about the money, you can be sure it’s about the money. Similarly, when a lefty says it’s about preserving our democracy, you can be sure it has nothing to do with preserving our republican democracy. As for Griswold, how hilariously obtuse that she’s worried that voters must “save our democracy.” That’s kind of the point, isn’t it?\nAnyone who thought congressional Democrats would respect the ruling of the third coequal branch of government and simply slink away is gravely mistaken. As Axios reported yesterday, Maryland Democrat Jamie Raskin, the ranking member of the House Oversight Committee and a former member of the rigged January 6 Committee, said he’s already working on federal legislation that would force Trump off the ballot.\n“Congress will have to try and act,” said Raskin, and we have no doubt that they will. Unfortunately for him and his ilk, such legislation has zero chance of passing so long as Republicans run the House, which will be the case until at least early January when the 119th Congress is seated.\nIn a Politico article titled “Level of Freak Out Remains High,” authors Ryan Lizza, Rachael Bade, and Eugen Daniels wrote: “This has the feel of a slow motion car crash. … If you’re not a bedwetter now, you’re not paying attention.”\nAnd speaking of nocturnal enuresis, we bring you the perennially unhinged Keith Olbermann. When a random social media antagonist chided Olby for crying about the Supreme Court’s decision, he responded: “Those aren’t tears, Fascist. They’re urine. I’m sure you enjoy being bathed in it.”\nUrine? What does this even mean? And why is it that all the creepy nutjobs are on the Left?\n“You can’t save a people from themselves,” lamented University of Virginia law professor Larry Sabato, who seems to be leaning further left with age. “If they’re determined to reelect him after he organized that insurrection — arguably our first coup d'état — then there’s nothing to stop the people from doing that.”\nWhoa, Larry. Isn’t that “democracy”? He’s also wrong about that coup d'état, which was actually attempted by the deep state against President Trump.\nAs the far-more-sensible Turley put it last night: “The real winner here is not Donald Trump, but rather it’s the United States Supreme Court and ultimately the American people. The court was designed for this moment. This is what the Framers hoped would happen. They want a court to be able to transcend the politics of the moment; to be able to rise above that, and to point citizens to a horizon, a constitutional horizon that unites them all. And they did that.”\nThat they did, Professor Turley. That they did.\n‘Extremists Attack the Integrity of Free and Fair Elections’\nKamala Harris and Merrick Garland are peddling lies about elections and voting rights to whip up black voters.\nNate Jackson\nDemocrats are bound and determined to “save democracy” by undermining it at every turn. It’s the only way they can even begin to hope Joe Biden will defeat Donald Trump this November. Vice President Kamala Harris and Attorney General Merrick Garland are just the latest contestants in that cynical game.\nBoth of them went to Tabernacle Baptist Church in Selma, Alabama, Sunday to commemorate the 59th anniversary of the clash between police and civil rights protesters there, and they asserted some outright falsehoods. The purpose is to shore up black voters for Biden, as he’s beginning to lose them to Trump.\nWe’ll start with Garland:\nThe right to vote is still under attack, and that is why the Justice Department is fighting back. That is why one of the first things I did when I came into office was to double the size of the voting section of the Civil Rights Division. That is why we are challenging efforts by states and jurisdictions to implement discriminatory, burdensome, and unnecessary restrictions on access to the ballot, including those related to mail-in voting, the use of drop boxes, and voter ID requirements.\n“There are many things that are open to debate in America,” Garland also said. “One thing that must not be open for debate is the right of all eligible citizens to vote and to have their vote counted.”\nHarris also complained about election integrity.\nToday, in states across our nation, extremists pass laws to ban drop boxes, limit early voting, and restrict absentee ballots. In Georgia, extremists passed a law to even make it illegal to give people food and water for standing in line to exercise their civic duty and right to vote. …\nAcross our nation, extremists attack the integrity of free and fair elections.\nNot surprisingly, we have a few points of rebuttal.\nIf a Republican were to show up in a church and talk about voting, he’d be accused of the supposedly rank sin of Christian Nationalism, flagrantly breaking down the Left’s sacred “wall of separation” and thus threatening democracy. Yet Democrats can do that in black churches all day, every day. So not only do we have two-tiered justice implemented by Garland and others, but we have two-tiered religious liberty.\nIt’s nothing but a BIG Lie for Democrats to assert that (in this case, unnamed) Republicans are trying to take away the right to vote from anyone. There are more options to vote early and by mail than at any point in American history. Eight states and Washington, DC, run their elections primarily through the mail, with every eligible voter automatically receiving a ballot. Nearly all states allow in-person early voting, with 21 of them offering voting on Saturday and nine on Sunday.\nSome 36 states request or require some form of identification to vote, though only 10 require photo ID. (It should be all 50.) Fourteen states require no documentation whatsoever.\n“Voters across all demographics support voter ID laws in virtually every poll by almost 80%,” notes The Heritage Foundation. “This typically includes more than 60% of Democrats.” It also includes large majorities of minorities.\nYet racist Democrats continue implying that blacks and Hispanics somehow have a more difficult time obtaining photo IDs. They never explain why it’s “discriminatory” to require the same verification for everyone, regardless of color.\nWe’ll address Harris’s ridiculous complaint about Georgia with a few questions. Why can’t voters exercising their civic duty bring their own water or food in preparation for lines? Who happens to run the dysfunctional precincts with long lines in places like Atlanta? (Hint: Democrats.) And why do electioneering volunteers insist on providing water to voters — and ensuring voters know who provided it?\nHarris failed to note that after Georgia passed its election integrity law rolling back some of the pandemic excesses, the state saw record turnout in 2022.\nIn truth, of course, the only extremists attacking the integrity of our elections are Democrats.\nAs our Mark Alexander wrote last fall:\nOf the votes cast in 2020, 43% (66 million ballots) were cast by mail — and a majority of those were in states where authentication of the person receiving and casting the ballot is not required. Of all those who voted in person, 66% voted for Trump versus 42% for Biden — which is to say that 58% of Biden ballots, almost 47 million votes, were cast by mail.\nFailing to authenticate mail-in ballots or to even try to obtain any proof of eligibility for in-person voters is a dereliction of duty. It is deliberately choosing to neglect the integrity of our elections. One in five mail-in voters even admitted to ballot fraud in 2020. Not only can that change results — it might have been decisive in 2020 — but it undermines public confidence in our election process and deeply divides the country. Democrats want both, of course, which is why Harris and Garland are tag-teaming to smear the “extremists” on the GOP side.\nBut again, who are the extremists?\nMaybe — just maybe — the extremists are the ones implementing cockamamie schemes to remove Trump’s name from state ballots. Schemes so obviously foolish that the Supreme Court rebuked them 9-0.\nMaybe the extremists are the ones conducting egregiously partisan lawfare against Trump during an election year. They’re suing him for defamation, hitting him with unbelievable fines for the victimless “crime” of buying and selling real estate, and hitting him with four separate indictments with 91 counts for everything from business accounting to so-called “insurrection.”\nDemocrats intended to make Trump the GOP nominee with all of this lawfare because they hoped to beat him in a fourth straight national election. But if the polling is any indication, they severely miscalculated — at least if Biden remains the nominee.\nThere are still roughly eight months until Election Day, and Democrats intend to have Trump sitting in a courtroom for as many days as possible during that stretch, calculating that independents won’t vote for a guy under so much legal duress and that they’d opt instead to vote for the vegetable or the late replacement.\nIn other words, “Across our nation, extremists attack the integrity of free and fair elections.” Notably, by the way, Kamala Harris did not name the extremists, which means, ironically, she’s right.\nExecutive News Summary\nTexas immigration law stymied, Florida loses a DEI battle, San Francisco Giants players must stand for national anthem, and more.\nDouglas Andrews, Thomas Gallatin, & Jordan Candler\nCross-Examination\nDoubling down on democracy: It’s no secret that Joe Biden’s key selling point over Donald Trump is his oft-repeated claim about the danger that Le Bête Orange poses to “our democracy.” Indeed, longtime Biden stooge Mike Donilon says that in the weeks and months ahead, the campaign’s focus “will become overwhelming on democracy.” (It’s a republic, but whatever.) But a funny thing seems to be happening on the way to November: Biden and Trump are now in a statistical tie as to which of them will safeguard “democracy and rule of law.” According to a new poll of registered voters from CBS News and YouGov, 34% believe that these two institutions will be safe “only if Biden wins,” while 33% believe the same will be true only if Trump wins. In perhaps a sign of the deep divisions within our country, 20% of respondents said democracy and rule of law won’t be safe regardless of which man wins. Bringing up the rear of the sample, only 13% of voters expressed confidence that these institutions will be safe no matter who wins. It’s a bleak picture, to be sure, but what are we to expect when one party engages in endless lawfare against the other party’s leading presidential candidate and tries to deny the American people the right to vote for the candidate of their choice by unconstitutionally removing that same candidate from the ballot?\nTexas illegal immigration law stymied: The U.S. Supreme Court on Monday issued a temporary stay on Texas’s anti-illegal immigration law, SB 4, that extends authority to local and state law enforcement to arrest migrants for being in the state illegally. The Court issued its block following a request from the Biden administration after the Fifth Circuit Court of Appeals on Friday granted a stay of a judge’s decision to halt the law. With the action of SCOTUS, Texas will be prevented from enforcing its law until the High Court weighs in. And that decision will likely be coming sooner rather than later. The crux of the case is whether Texas’s law infringes on the federal government’s authority to enforce the nation’s immigration laws. If only the federal government would enforce the laws.\nFlorida loses a DEI battle: The Eleventh Circuit Court of Appeals ruled on Monday that Florida’s anti-DEI bill, which Republican Governor Ron DeSantis signed into law, is unconstitutional. The law forbids private employers from subjecting “any individual, as a condition of employment” to engage in “training, instruction, or any other required activity that espouses, promotes, advances, inculcates, or compels” DEI ideology. The court ruled that the law violated the First Amendment by claiming the state was attempting to “control speech by recharacterizing it as conduct.” Florida’s lawyers argued that the state was not engaged in controlling speech but rather that the law aimed to protect employees from being compelled to engage in “certain speech against their will.”\nTrump wallops Haley in Super Tuesday preview: To no one’s surprise, Donald Trump smoked Nikki Haley 85-14 yesterday in North Dakota’s presidential primary — a primary that may well be a preview to what transpires today, Super Tuesday, in 15 more contests. The win continues Trump’s primary dominance, marking his ninth win in 10 events, with the only blemish being this past weekend’s win for Haley in Washington, DC. The North Dakota win, as Fox News reports, “comes as Trump’s campaign has largely shifted its attention to the general election and an all-but-certain rematch of 2020’s matchup against President Biden.” As for today, Republican voters across the land are heading to the polls in Alabama, Alaska, Arkansas, California, Colorado, Maine, Massachusetts, Minnesota, North Carolina, Oklahoma, Tennessee, Texas, Utah, Vermont, and Virginia. Collectively, these states make up a full third of all available delegates, and the result will almost certainly be an avalanche of wins for Trump and ever greater pressure for Haley to end her quixotic campaign. Reminded of her poor electoral performance so far and asked whether she’d drop out and throw her support behind Donald Trump if (read: when) things go poorly for her today, Haley dodged with a non sequitur followed by a word salad: “If I were to get out of the race, it would still be the longest presidential general election in history. I don’t know why everybody’s so adamant that they have to follow Trump’s lead to get me out of this race. You know, all of these people deserve to vote. Sixteen states want to have their voices heard. Let’s let their voices get heard. We’re a democracy [sic].”\nFrance makes abortion a constitutional right: France has become the first nation to make abortion a constitutional right. On Monday, French legislators voted 780-72 to codify the right to abortion in the country’s constitution. Back in 1974, France first legalized abortion up to 12 weeks gestation. This new constitutional right expands legal abortion up to 14 weeks gestation. An advocate for enshrining abortion as a constitutional right, leftist Green Party Senator Melanie Vogel ridiculously asserted that “the French Republic will no longer remain democratic without the right to abortion.” What of the democratic rights of preborn babies? Meanwhile, it is telling that even as France has sadly enshrined abortion into its constitution, it still limits it to 14 weeks. Here in the States, even 16 weeks is too limiting for Democrats and their pro-abortion cadres; they demand no limits. The U.S. has no federal ban on abortion at any point in pregnancy, making our nation just one of seven other countries with no such limit on abortion. These countries include the likes of North Korea and China.\nMajority of British scientists still hold to the science on sex: A recent survey of some 200 scientists in British universities found that 58% still hold a binary view on the classification of human sex. Furthermore, 29% of those scientists endorsed the concept of sex being nonbinary, while 13% refused to respond. Following the poll, Dr. Wolfgang Goymann, a professor of biology at the Max Planck Institute for Biological Intelligence, stated, “To me, this just means that at least 29 percent of the academics that filled out this questionnaire do not understand the biological concept of sex, and at least 22 percent of them do not know what gender means.” Indeed, any scientist being true to science should have endorsed the binary nature of sex. The evidence and the science have not changed. However, what has changed is the West’s embrace of relativism. As Goymann further observed, “Leading science journals have been adopting this relativist view, thereby opposing fundamental biological facts.” Helen Joyce, director of advocacy at Sex Matters, noted: “This survey has two remarkable findings. The first is that 29 percent of academics are apparently unaware of the obvious fact that sex is binary. The second is that nearly two-thirds of academics say that ‘gender is fluid.’ That is a strikingly confident statement about a nebulous concept. Most ordinary people think ‘gender’ is just a polite alternative to ‘sex,’ so are these academics talking about personal style — masculinity or femininity; or assertions about; ‘identity’ — that is, states of mind?”\nSan Francisco Giants players must stand for national anthem: In a development that’s equal parts good news and bold news, the grizzled skipper of Major League Baseball’s San Fransicko Giants, Bob Melvin, has declared that his ballplayers will come out of the dugout and stand for the national anthem. Just a decade ago, such non-news would’ve been met with puzzlement, but these are strange days indeed. As RedState’s Bob Hoge writes, “Well here’s a breath of fresh air — after we’ve seen former 49ers quarterback Colin Kaepernick and friends kneel for the national anthem and the US Women’s Soccer Team refusing to sing along, now we get a baseball manager who’s apparently had enough of such shenanigans and is requiring his players to be on the field for The Star-Spangled Banner.” As for Melvin, his rationale was as follows: “It’s all about the perception that we’re out there ready to play,” he told The Athletic. “That’s it. You want your team ready to play, and I want the other team to notice it, too. It’s really as simple as that.” We’ll venture a guess that Melvin is also a patriot, but we’d fully understand his desire to keep such a dirty little secret under wraps over there in Pelosiville.\nDEI is on the ropes everywhere: During the past year, we’ve written extensively about the racist ills of the so-called diversity, equity, and inclusion programs that now infect institutions across America both public and private. But it seems clear that the tide is finally turning. One powerful case in point is the recent decision by the University of Florida to Gator-chomp DEI right off its campus, and other indications are chronicled in a new City Journal piece by anti-DEI warrior Chris Rufo. As he writes: “Corporate America is following suit. Firms including Google, Meta, and Zoom have quietly cut back DEI departments and laid off employees. I have recently spoken with a number of Fortune 500 executives, who explained that, following the summer of George Floyd, companies felt immense pressure to ‘do something’ about racial disparities. But four years later, they have realized that DEI programs undermine productivity, destroy merit-based systems, and poison corporate culture. Because of our successful campaign to expose the true nature of DEI, they now have the political space — in essence, the social permission — to wind down these programs.”\nHeadlines\nMichelle Obama’s office says the former first lady “will not be running for president” in 2024 (NBC News)\nJohn Thune enters race to become Senate GOP leader (Daily Wire)\nRussia hoax lawyer Marc Elias admits Trump can’t get an impartial jury in DC trial (The Federalist)\nAOC chased out of Brooklyn movie theatre by leftist protesters demanding she accuse Israel of “genocide” (PM)\nUN: “Convincing information” sexual violence committed against hostages in Gaza (BBC)\nGovernor Newsom announces new Hate Hotline so informants can report their neighbors to the state (Not the Bee)\nCalifornia demolished dam to save salmon, killed the salmon instead (FrontPage Mag)\nFederal judge rules that Christian employers do not have to pay for transgender surgeries (Daily Wire)\nBud Light may have lost $1.4 billion (Townhall)\nHumor: Cast of “The View” unanimously overturns SCOTUS decision (Babylon Bee)\nFor more editors’ choice headlines, click here.\nHigher Education’s Broken Promise?\nMore than half of recent college graduates are underemployed.\nThomas Gallatin\nGetting a four-year degree used to be the ticket to at least an upper-middle-class job. Indeed, if you wanted to move up the career ladder, a college degree was a nearly unquestioned must.\nThis idea of higher education being the ticket to realizing the American Dream caused Congress to expand the availability of low-interest loans for students. In this way, even students from poorer socioeconomic backgrounds could afford to go to college with the promise of rising up that economic ladder.\nWell, as often happens when government do-gooders step in to “solve” a “problem,” their actions serve to make things even worse. A case in point: Thanks to low-interest loans, the cost of college has gone through the roof. Students are graduating with mountains of loan debt and are finding it difficult to get a good-paying job with which to pay off that debt.\nFor nearly four million lucky lottery winners, Joe Biden has stepped in to transfer $138 billion in student loan debt to the backs of taxpayers. That’s illegal and an unconstitutional usurpation of power, but even the Supreme Court “didn’t stop me,” he boasted recently.\nOther college grads have a tougher slog. A recent survey of 60 million American workers found that a whopping 52% of college graduates within a year of finishing school are working jobs that don’t require a college education. To make matters even worse, 88% of these college grads are still working in jobs such as food service and retail even five years after graduating.\nThese are the growing numbers of the so-called “underemployed.” Ten years after earning a college degree, 45% still work in fields that don’t require college degrees, whereas 79% of college graduates who began their careers in jobs that required a college degree still work college-level jobs.\nWhy is this happening? Well, as many college graduates have learned the hard way, simply having a college degree doesn’t guarantee a college-level job. As it turns out, the specific degree actually matters. As West Virginia University political scientist R. Scott Crichlow points out, “While a college degree will substantially increase your income, some fields are wiser choices than others.”\nFurthermore, a growing number of companies have begun eliminating college requirements for jobs, as they find they have to spend time training employees anyway for positions, and college does little to prepare them. As PublicSquare reported last November, 67% of 905 small business owners said that today’s college graduates lacked “relevant skills that today’s business community needs.”\nRedBalloon’s unfortunately named CEO Andrew Crapuchettes contends, “A lot of students are wasting tens of thousands of dollars and years of their lives on meaningless college degrees.”\nYou don’t say. Is it any wonder that Biden’s student loan cancellation scheme is so attractive to so many college graduates saddled with so much student debt? After all, it beats flipping burgers alongside high school kids.\nAs for underemployment by racial demographic: A year after getting a college degree, 60% of the underemployed are black, 57% are Hispanic, 53% are white, and 47% are Asian. Once again, the choice of degree is the primary factor for graduates struggling to find college-level careers.\nTargeting a career path before simply heading off to college is the wiser choice. If your chosen profession requires higher education, then by all means, go to college. But be mindful that there are other fulfilling career options that don’t require a four-year degree or a mountain of student loan debt.\nPoliticians love to tout their favorite one-size-fits-all solutions. But those solutions rarely work out for everyone. Rather, the rediscovery of that good old American Spirit needs to be preached and embraced. That spirit rejects the victimhood narrative and instead sees the rich and wonderful world of opportunities that this great nation affords to all who are willing to put in the work and chase that dream.\nDEI Is Gator-Chomped Out of the University of Florida\nThis makes it the first public university to divest itself from the Racial Marxism ideology.\nEmmy Griffin\nIn a memo released by the University of Florida’s J. Scott Angle, Provost and Senior Vice President for Academic Affairs, an announcement was made that the university is shutting down its diversity, equity, and inclusion (DEI) division. According to the memo, “To comply with the Florida Board of Governor’s regulation 9.016 on prohibited expenditures, the University of Florida has closed the Office of the Chief Diversity Officer, eliminated positions and administrative appointments, and halted DEI-focused contracts with outside vendors.”\nThe total number of positions eliminated is 13 DEI positions and 15 administrative appointments. Those staff that were just laid off will be paid 12 weeks severance. Even in spite of that, the school is saving itself $5 million. Those funds will be allocated to a faculty recruitment fund.\nThis makes the University of Florida the first public university to divest itself from the Racial Marxism ideology that labels itself as DEI.\nOne aspect to watch, however, is that those in the DEI division who have lost their jobs are “allowed and encouraged” to apply for other available positions. The Wall Street Journal interprets this as a positive move, showing that the University of Florida is not trying to punish anyone, rather it is trying to unite its staff under the founding principle of the university: to teach students. The difficult aspect of rehiring DEI professors and staff into different positions is that they might still push forward the ideology of DEI, which is toxic.\nJust look at what DEI’s influence has done to Harvard. Its former president, Claudine Gay, couldn’t even state that calls for genocide against the Jews were a punishable offense on campus. Harvard is now in a farcical dance between rectifying itself in the court of public opinion and still teaching and acting on the tenets of DEI, which label Israel and the Jews as oppressors and Hamas as the oppressed. By trying to have its cake and eat it, too, Harvard has merely succeeded in further exposing the degradation of the university.\nIn an interview in January, former U.S. Senator and University of Florida President Ben Sasse signaled that this change would probably be coming. Here is the pertinent excerpt from that interview, according to The Wall Street Journal:\nOf the push for “diversity, equity and inclusion,” [Sasse] says that “the aspirational best parts of diversity and inclusion, I’m for.” “If you don’t have viewpoint diversity, I don’t know how you ever get to education — you just get indoctrination.” And he believes in “the dignity of every soul,” so “you want people to be included.”\nWhat’s wrong with DEI “is the E,” he says, meaning the embrace of “equity” at the expense of equality. “The fundamental problem is saying that Martin Luther King can’t fit in the new communities of know-it-all ideological-indoctrination bureaucrats that run most universities in the country. … MLK doesn’t fit because of his aspirations for a colorblind society.\n\"Can people have a different view than MLK? Of course.” But “the ideological conformity of mandating that equality of opportunity is wrong and bigoted, it has to be excluded from our discourse — those people are crazy.”\nIt’s amazing what leadership backed by good governance can do. Let’s hope that other universities in other states take notice and will follow the University of Florida’s example. Let’s also hope that the University of Florida is able to foster that diversity of thought without the equity of outcome seeping back in.\nBiden Placates the Jew Haters\nEver mindful of the electoral map, the president tried to shore up his hard-left base by siding with Hamas in its war with Israel.\nMichael Swartz\nWhile it may seem like a lifetime ago, it’s only been about five months since Hamas made its incursion into Israel, killing some 1,200 Israeli civilians and taking dozens of hostages who have since been used as human bargaining chips. Since the hopeful point of a weeklong ceasefire in late November resulted in the release of some Hamas-held hostages, Israel has avenged the terrorist organization’s October 7 invasion by destroying Hamas infrastructure within Gaza. But unlike most military conflicts, in which non-combatants can flee an affected area, no Arab nation will take in the Gazans. Instead, they’ve become human shields for Hamas.\nEver since Israel gained the upper hand in the conflict with its superior firepower, Jew haters and Hamas supporters have been the biggest proponents of yet another ceasefire. Such a ceasefire would bring six weeks’ worth of peace for some of the remaining hostages.\nAs Zach Kessel of National Review describes it: “A Biden-administration official told reporters on Saturday that the Israeli government had ‘basically accepted’ the terms of a proposal for a six-week cease-fire meant to facilitate the release of elderly and injured hostages, though no specific number has been provided as to how many of the approximately 100 Israelis believed to be in Hamas captivity would be freed. The potential cease-fire is also intended to provide a window for Israel to allow more aid into the Gaza Strip.”\nTraditionally, American foreign policy has advocated a two-state solution in which the Jewish state and a Palestinian state exist side by side. However, as we’ve seen in the constant war-and-ceasefire cycle since Hamas took over the Gazan government in 2006, it’s difficult for sworn enemies to coexist — especially when one of them explicitly and repeatedly rejects that idea.\nBut it’s also led more recently to clashing factions in the Democrat Party, which is really what this story is about. As our Thomas Gallatin observed last month, “Team Biden worries that if Israel is allowed to continue and eventually crushes Hamas, it will hurt Biden’s reelection chances, specifically in Michigan, with its significant Arab-American population.”\nThat call for a ceasefire from the Democrats’ Hamas wing became louder with reports that the Israeli Defense Forces “reportedly killed dozens of Palestinians” who were waiting in line for aid last week. Speculation was that the IDF attack thwarted the Biden administration’s efforts to secure a ceasefire.\nRegardless, Joe Biden read from his cue cards that the U.S. would, in the coming days, “be providing airdrops of additional food and supplies into Ukraine.” He meant Gaza, not Ukraine, but rest assured: He’s a “well-meaning elderly man with a poor memory.”\nMalapropisms aside, Biden said this on Friday: “The truth is, aid flowing into Gaza is nowhere nearly enough now. … Innocent lives are on the line and children’s lives are on the line. We should be getting hundreds of trucks in, not just several.”\nHowever, as pointed out by National Security Council spokesperson John Kirby, airlifts are “a tough military mission.” The preference among those concerned was to resume supplying the Ukrainians, er, Gazans by ship and truck.\nAnd in a bid to establish her leadership credentials before the November election, Kamala Harris stepped out of the shadows this past weekend and lined herself up squarely in the ceasefire camp as well, telling a crowd in Selma, Alabama: “People in Gaza are starving, conditions inhumane, and our common humanity compels us to act. Given the immense scale of suffering in Gaza, there must be an immediate ceasefire for at least the next six weeks, which is what is currently on the table. This will get the hostages out and get a significant amount of aid in; this would allow us to build something more enduring to ensure Israel is secure and to respect the rights of Palestinian people.”\n“Hamas claims it wants a ceasefire,” added Harris. “Well, there is a deal on the table. And as we have said, Hamas needs to agree to that deal.” Harris also called on Israel to “work to restore basic services and promote order in Gaza, so more water and fuel can reach those in need.” However, that would imply that Israel takes full control there, which a ceasefire would prevent.\nIn years past, the Democrats could count on the votes of both Jewish and Arab Americans. However, some of the Jewish vote appears to have peeled away toward Donald Trump. Biden, though, has to worry more about his left flank, which is heavily pro-Hamas and prepared to sit this one out — especially if we’re to judge from the results of the recent Michigan primary. There, a significant segment of the Detroit area’s Arab American stronghold voted “uncommitted” to protest Biden’s perceived pro-Israel stance. Michigan is the definition of a “swing state,” having gone narrowly for Trump in 2016 and narrowly for Biden in 2020. No wonder Biden is hell-bent on appeasing this crucial voting bloc.\nGoing forward, look for more calls for a ceasefire and more aid to Gaza while Hamas is down. It seems like the only chance for a two-state solution, though, is one in which Hamas is removed from the equation. A ceasefire only allows Hamas to hang on longer, using the timeworn strategy of waiting out a change of Israeli leadership to keep the Middle East in turmoil.\nREADER COMMENTS\nEditor’s Note: Each week we receive hundreds of comments and correspondences — and we read every one of them. Click here for a few thought-provoking comments about specific articles. The views expressed therein don’t necessarily reflect those of The Patriot Post.\nVIDEOS\nUnpacking SCOTUS Reversal of Colorado’s Trump Ballot Ban — In a 9-0 ruling, the U.S. Supreme Court followed the Constitution and sent a clear message to the country.\nMSM Flipped From Border Crisis Denial to Blame Game — In January, the White House backed a border bill and congressional Republicans killed the legislation, saying it was too weak. Suddenly, “border crisis” was in the headlines, and news outlets were suggesting Republicans didn’t care enough about the out-of-control illegal immigration.\nNewsom Protects Campaign Donor From Minimum Wage Hike? — As California is set to raise the minimum wage for fast food workers to $20 an hour, a new report says Gavin Newsom exempted his campaign donor buddy from the law.\nWhy Wind and Solar Make Our Power Grid Less Reliable — Politicians and activists tell us about how “renewable” energy will save us from the climate “crisis.” They don’t tell us about the real costs of green power.\nA Moral Case for Capitalism — What is the only economic system that values freedom, lifts people out of poverty, disdains distinctions of race and creed, and draws us into productive networks of mutual dependency? Hint: It’s not a system of ever-increasing government control.\nRock Star! — CPAC has served as the gold standard of Donald Trump pep rallies. But this year, there was something different. Argentina’s Javier Milei held the crowd spellbound for an hour with a lecture on economics.\nBEST OF RIGHT OPINION\nFor more of today’s columns, visit Right Opinion.\nSHORT CUTS\nCan’t Fix Stupid\n“I do believe that states should be able under our Constitution to bar oath-breaking insurrectionists. … Ultimately, it will be up to the American voters to save our democracy in November.” —Colorado Secretary of State Jena Griswold\n“I am working with a number of my colleagues … to revive legislation that we had to set up a process by which we could determine that someone who committed insurrection is disqualified.” —Congressman Jamie Raskin (D-MD)\n“The Supreme Court has betrayed democracy. Its members including Jackson, Kagan and Sotomayor have proved themselves inept at reading comprehension. And collectively the ‘court’ has shown itself to be corrupt and illegitimate. It must be dissolved.” —former MSNBC host Keith Olbermann\nTheater of the Absurd\n“The right to vote is still under attack. And that is why the Justice Department is fighting back. … That is why we are challenging efforts by states and jurisdictions to implement discriminatory, burdensome, and unnecessary restrictions on access to the ballot, including those related to mail-in voting, the use of drop boxes, and voter ID requirements.” —Attorney General Merrick Garland\n“In Georgia, extremists passed a law to even make it illegal to give people food and water for standing in line to exercise their civic duty and right to vote.” —Kamala Harris\nThe BIG Lies\n“Today, extremists pass book bans … while they also try to erase, overlook, and rewrite the ugly parts of our past.” —Kamala Harris\n“I did not interact with [Hunter and James Biden’s] partners.” —Joe Biden\n“We need more forces on the border. I don’t have the authority to do that.” —Joe Biden\n“There certainly is no evidence of a high crime or misdemeanor in any respect in the performance of Secretary Mayorkas.” —Senator Dick Durbin (D-IL)\nBaghdad Bob\n“When Governor Abbott chooses to use migrants as political pawns and leave them by the side of the road in the dead of winter, he shows Republicans are more interested in politics than solutions.” —White House Press Secretary Karine Jean-Pierre\n“That is so false. [Biden] has taken action. He has taken action. Republicans rejected it because of the last president. … Republicans told on themselves and said that the former president told them to not move forward with the bipartisan Border Patrol deal.” —Karine Jean-Pierre\nUseful Idiots\n“Netanyahu … seems sort of hellbent to continue this terribly-destructive-to-civilian-life battle in Gaza.” —Senator Tina Smith (D-MN)\n“Given the immense scale of suffering in Gaza, there must be an immediate ceasefire.” —Kamala Harris\nGaslighting\n“We need to make sure people understand the good that is coming their way because of the president’s leadership and because of their work.” —Transportation Secretary Pete Buttigieg\n“I think the president is an incredibly compelling figure. And I would hope that the White House will send him out all over the country to just be who he is.” —Senator Chris Murphy (D-CT)\n“We have to lift up that Joe Biden is working on the real issues that the American people care about. He is working towards peace, and Donald Trump is openly xenophobic, openly anti-Muslim, and would do nothing to actually address the real issues that the American people care about.” —Biden campaign spokesperson Kevin Munoz\n“Remember that Joe Biden is handling the complexities of the world. … The man is doing yeoman work.” —Illinois Governor JB Pritzker\nBelly Laughs of the Day\n“[Biden] believes in going across the aisle and working in a bipartisan way.” —Karine Jean-Pierre\n“The president has done more in three years in this administration than most president has done in two terms.” —Karine Jean-Pierre\nFor the Record\n“Joe Biden campaigned on open borders. He campaigned on saying: ‘I will not deport people. I will not enforce our laws.’ And as president, that may be the only campaign promise he has honored.” —Senator Ted Cruz (R-TX)\nTODAY’S MEME\nFor more of today’s memes, visit the Memesters Union.\nTODAY’S CARTOON\nFor more of today’s cartoons, visit the Cartoons archive.\nPlease join us in prayer for our nation — that righteous leaders would rise and prevail and we would be united as Americans. Pray also for the protection of our Military Patriots, Veterans, First Responders, and their families. Please lift up your Patriot team and our mission to support and defend our Republic’s Founding Principle of Liberty, that the fires of freedom would be ignited in the hearts and minds of our countrymen.\nThank you for supporting our nation’s premier online journal of Liberty.\nSemper Vigilans Fortis Paratus et Fidelis",
  "word_count": 7559,
  "scraped_at": "2026-02-14T12:17:17.279032"
}