{
  "article_id": "f4a29789c87c",
  "url": "https://www.yahoo.com/news/won-because-were-kansas-city-120000662.html",
  "title": "  We won because we were Kansas City : KC Current coach Vlatko Andonovski explains",
  "date": "20240318T123000Z",
  "domain": "yahoo.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "‘We won because we were Kansas City’: KC Current coach Vlatko Andonovski explains\nThe Kansas City Current opened CPKC Stadium in style on Saturday, earning a thrilling 5-4 victory against the Portland Thorns.\nThe result was secondary in the bigger picture, but it was icing on the cake — and a tasty icing, at that — for a memorable start to the club’s 2024 season in the National Women’s Soccer League.\nSaturday’s match had a little bit of everything: goals, tackles, saves and yellow cards.\nDid we mention goals?\nThe Current raced to a 5-1 lead. Then, after being throttled for 70 minutes, Portland’s pride kicked in. That set up a frantic finish in which the Current held off an equally talented team.\nOnce heart-rates had returned to normal, Current coach Vlatko Andonovski assessed how his team conceded four goals and won anyway.\n“We didn’t win because we were so good or so much better than Portland,” he said. “We won today because we were Kansas City.”\nThat might sound like coach-speak, but Andonovski has called KC home for much of his life. Kansas City means a lot to him.\n“If we describe this team, it has to be like we’re describing Kansas City,” he said.\nAsked what attributes he wants to see in his team — attributes that might also describe the city — he mentioned hard work, resilience, flair and bravery.\nMore in Sports\n“Literally in people’s faces,” he said.\nThe Current showed those characteristics during Saturday’s match against the Thorns. Take, for example, the first goal of the game.\nBrazilian star attacker Debinha is known for her flair and soccer sense, which seem to be installed in Brazilian players at birth (most of the world calls it football, America calls it soccer and Brazil refers to it as simply joga bonito: the beautiful game).\nYet it wasn’t Debinha’s flair that created that first goal. To start with, it was hard work. She pressed Thorns goalkeeper Caroline Hogan high, seemingly reading her mind to intercept a pass. Then she moved with the ball toward the goal.\nA glimmer of flair followed: Debinha used the outside of her foot from a tight angle, trying to sneak the ball between Hogan’s legs. The attempted nutmeg shot — a move with which she’s been terrorizing teammates during training — sailed slightly off-mark.\nThe shot didn’t go in, instead clipping the inside of Hogan’s heel and rolling in front of the Portland net. That’s when Vanessa DiBernardo embodied another one of Andonovski’s attributes — bravery — in abandoning her midfield post at just the right time to poke it home.\nEuphoria ensued, and from then on, each moment in the match offered something KC-special. The Current put in more tackles, won more duels and made more saves and clearances.\nTo top it all off, five different Kansas City players scored.\n“We want to be described as a Kansas City team,” Andonovski said. “We want to be described as (having) a Kansas City mentality. We want to be known as that.\n“That’s who we are. And we’re not afraid of that. We’re not ashamed of it. We’re actually very proud, and we wanted to display that ... on the field.”",
  "word_count": 537,
  "scraped_at": "2026-02-14T12:17:16.691631"
}