{
  "article_id": "f4ae062baeb4",
  "url": "https://www.lowellsun.com/2024/05/29/no-hollywood-ending-in-lowell-but-boston-gave-fans-plenty-to-cheer-about/",
  "title": "No Hollywood ending in Lowell , but Boston gave fans plenty to cheer about",
  "date": "20240530T060000Z",
  "domain": "lowellsun.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "LOWELL — The Tsongas Center was the place to be on Wednesday night.\nSince opening its doors in 1998, the arena has housed everything from minor-league hockey to arena football. Its primary function serves as the home of UMass Lowell’s Div. 1 men’s ice hockey and basketball teams, welcoming rowdy students and fans on weekends to cheer on their River Hawks.\nIt has hosted concerts. High school tournament championship games.\nBut this night was special. This was an event. This was history in the making. There was a buzz in the arena long before the first puck was dropped at 7 p.m.\nNothing compared to the scene at the deciding fifth game of the Professional Women’s Hockey League Finals between Boston and Minnesota.\nBox office tickets sold out in 24 hours to witness history. If you missed out, the cheapest seats on StubHub would run you nearly $200.\nThis was Game 7 of the Stanley Cup Finals. The Super Bowl. And it happened in downtown Lowell.\nA sellout crowd of 6,309 packed the blue seats hoping to witness their home team hoist the Walter Cup for the first time in league history. While that goal didn’t come to fruition as Boston fell 3-0, the hype of the game certainly did.\nKatie Vaudrain, an elementary teacher from Maynard, was one of the excited fans.\n“The kids in my class have been buzzing about the game,” she said. “So between them talking about it, I was like, I don’t care if it’s a school night. I’m going. Forget it. I actually ran into one in the lobby area and we took a selfie already. It’s bringing people together.”\nIt’s brought people to Lowell who would otherwise have no business making the trek to the Mill City. The Tsongas Center is easy to overlook, and out-of-town visitors likely wouldn’t make it part of their tourist itinerary.\n“Not particularly,” Vaudrain said of making the 22-mile drive to the city on a regular occasion.\n“Lowell, not so much,” said Garrett Colon of Framingham. “This is my destination.”\nBecause of the new league, the Tsongas has been Colon’s destination all season. He’s been to every game except for one, seen sporting his team-signed Boston jersey awaiting pregame warmups.\n“I’ve really enjoyed seeing the crowd start to learn the energy, the pacing, it’s just been a delight,” he said.\nHowever, that’s not to say every member of the raucous crowd drove far and wide to Lowell. For Amanda Dubois, the historic matchup took place right in her backyard.\n“It is amazing,” Dubois said, a Lowell resident. “It’s a walking distance from my apartment.”\nEver since attending the home opener in January, she’s been hooked.\n“I’m a big Bruins fan, and I was pumped to hear that women’s hockey was going to be in the city I live in,” she said. “Why would I not enjoy that?”\nBoston may not have fulfilled its Walter Cup dreams. But the team sure proved its ability to make its presence felt in Lowell.\n“Watching it grow each game has been so much fun to see,” Dubois said. “And I hope it continues that way, and I hope it stays in Lowell. It’s been fun watching history.”",
  "word_count": 535,
  "scraped_at": "2026-02-14T12:41:42.274252"
}