{
  "article_id": "f4b0d9f50e67",
  "url": "https://www.northwichguardian.co.uk/news/national/24147624.celtic-boss-rodgers-had-laugh-journalist-made-good-girl-comment/",
  "title": "Celtic boss Rodgers  had a laugh  with journalist he made  good girl  comment to",
  "date": "20240227T150000Z",
  "domain": "northwichguardian.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Celtic boss Brendan Rodgers has said he “had a laugh” about the sexism row over his “good girl” comment with the journalist involved.\nRodgers said he was “saddened” by the reaction, while the BBC Scotland sports reporter he made the comment to, Jane Lewis, has said she believes he did not mean to offend and she has not taken any offence.\nDuring a BBC Sportsound radio interview following Celtic’s 3-1 win against Motherwell on Sunday, Rodgers was heard saying “good girl” following a line of questioning from Ms Lewis.\nThe Celtic manager told a press conference at Celtic Park on Tuesday: “I have spoken to Jane. She wasn’t offended. We had a laugh about it, she will continue to ask me awkward questions, I’m sure. But I see her every week and we have good relations, like I have with most people in my life, whether that’s professional or social.\n“Sadly for me, in society now, we are either looking to offend or find something that is offensive to try and pin on to people.\n“I find it saddening as much as anything because one, I am not that type of person, I can never be that, it’s not how I’m built. But also it saddened me for society now because people are just trying to find ways to somehow bring you down if they can. It’s not nice.”\nMs Lewis said on Tuesday: “Clearly, the interview on Sunday has become a talking point. I don’t believe there was any offence meant by Brendan Rodgers – and for my part, there was none taken.”\nThe Scottish Feminist Network and For Women Scotland earlier urged Rodgers to explain the comment, which has been labelled as “casual sexism”.\nOn the Sunday programme, Ms Lewis asked the Celtic boss to elaborate on the Cinch Premiership title race after he said: “The story has already been written about this group. But we will write our own story.”\nShe said: “Can you give us a bit more – you don’t want to give us a bit more insight into that and what you mean?”\nHe replied: “No, no, you know exactly what I mean,” but the journalist then said: “I’m actually not sure exactly what you mean.”\nHe then appeared to wrap up the interview by saying: “Done, good girl, well done.”\nA spokeswoman for the Scottish Feminist Network said: “Rodgers’s throwaway comment encourages other football fans to behave in a similar way, demeaning women they work with or engage with.\n“It has to stop.\n“Jane Lewis was just doing her job, trying to extract an explanation from Brendan Rodgers on his cryptic comment.\n“That the go-to attitude of a manager of a winning team was condescension is quite illuminating but really very depressing in 2024. We thought dinosaurs were extinct.”\nA spokeswoman at For Women Scotland said: “It’s depressing that casual sexism is still embedded in sport.\n“Women’s achievements are underrated and dismissed, and their professional status undermined. Rodgers owes the reporter an apology.”",
  "word_count": 500,
  "scraped_at": "2026-02-14T14:10:47.761196"
}