{
  "article_id": "f4bd7cb0cb1a",
  "url": "https://kesq.com/news/national-world/cnn-national/2023/09/03/start-your-week-smart-burning-man-proud-boys-sentenced-astronauts-returning-florida-congressional-map-jimmy-buffett/",
  "title": "Start your week smart : Burning Man , Proud Boys sentenced , astronauts returning , Florida congressional map , Jimmy Buffett",
  "date": "20230903T193000Z",
  "domain": "kesq.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Start your week smart: Burning Man, Proud Boys sentenced, astronauts returning, Florida congressional map, Jimmy Buffett\nBy Andrew Torgan and Daniel Wine, CNN\n(CNN) — Happy Labor Day weekend, also known as summer’s unofficial last hurrah. Unfortunately, the long holiday weekend is often punctuated by heavy highway traffic and lengthy airport delays — no doubt exacerbated by the damage caused by Hurricane Idalia last week. If you’re among the millions traveling today and Monday, be patient, stay hydrated and take deep breaths.\nHere’s what else you need to know to Start Your Week Smart.\nThe weekend that was\n• As thousands of people remain unable to leave the Burning Man festival in the Nevada desert after heavy rains inundated their campsites with ankle-deep mud, authorities say they are investigating a death at the event. Attendees were told to shelter in place and conserve food, water and fuel.\n• A federal judge handed down hefty sentences against two members of the Proud Boys for their role in attacking the Capitol on January 6, 2021. Ethan Nordean was sentenced to 18 years in prison, and Dominic Pezzola received 10 years.\n• Four astronauts concluded their six-month stay aboard the International Space Station and are heading for a splashdown off the coast of Florida days after Hurricane Idalia ravaged parts of the state.\n• A Florida judge struck down congressional district lines advocated by Gov. Ron DeSantis, ruling that the Republican leader’s map had improperly diluted Black voting power. The order requires the legislature to draw a new one.\n• Jimmy Buffett, the tropical troubadour whose folksy tunes celebrated his laid-back lifestyle, inspired legions of devoted fans and spawned a lucrative business empire, died at age 76.\nThe week ahead\nMonday\nYep, it’s Labor Day. All the usual suspects will be open (most stores, restaurants, etc.) or closed (banks, post offices, non-essential government offices, etc.) and beaches, pools and parks will be packed. If you’ve ever wondered why we get this respite on the first Monday of September, here’s your answer.\nIt’s also the 25th anniversary of the founding of Google. The search engine that went on to become a verb (Google it) was incorporated on September 4, 1998, by computer scientists Larry Page and Sergey Brin while they were students at Stanford University in California. Fun fact: the original name of the search engine they built was — we kid you not — Backrub.\nTuesday\nThe first over-the-counter naloxone, a drug used to reverse an opioid overdose, will be available in retail stores and online. The medicine, with the brand name Narcan, will have a suggested retail price of $44.99 per carton of two doses, according to its maker, and will be available initially in stores and online from retailers including Walgreens, Rite Aid, Walmart and CVS. The FDA approved Narcan as an over-the-counter drug in March against a backdrop of record-high deaths from opioid overdose, driven by powerful synthetic drugs like fentanyl. Narcan is a nasal spray version of naloxone, which can revive a person from an overdose within minutes.\nWednesday\nSeptember 6 is the day that Donald Trump’s 18 co-defendants are scheduled to be arraigned in the Georgia 2020 election subversion case, although some have already pleaded not guilty, including former Trump campaign lawyer Sidney Powell. The former president also entered a plea of not guilty last week and formally asked a judge to sever his case from those of his co-defendants who want a speedy trial. Trump now faces a total of 91 state and federal criminal charges across four different cases.\nFriday\nPresident Joe Biden will be in New Delhi, India, to attend the G20 Summit. Topics expected to be discussed include the transition to clean energy and combating climate change, as well as mitigating the economic and social impacts of the war in Ukraine. Russian President Vladimir Putin is not expected to attend.\nIt’s International Literacy Day, to remind people around the world of the importance of literacy as a matter of dignity and human rights, as well as its importance in building more sustainable societies.\nOne Thing: Tackling football safety\nIn this week’s One Thing podcast, CNN Sports anchor and former NFL player Coy Wire investigates football’s violent history and how it informs today’s game. Plus, we get a look at technology that experts hope will one day predict injuries — before they happen. Listen here for more.\nPhotos of the week\nCheck out more images from the week that was, curated by CNN Photos.\nWhat’s happening in entertainment\nTV and streaming\n“The Changeling,” starring LaKeith Stanfield, arrives on Apple TV+ Friday. Based on the best-selling book of the same name, the new series is set in an alternate New York City, where Stanfield — a husband and father — searches through a magical world for his abducted son and missing wife.\nIn theaters\nFriday is sequels day at the multiplex, and your options couldn’t be further apart. First up is “My Big Fat Greek Wedding 3,” which finds the Portokalos family traveling to Greece for a family reunion. Expect lots of food, dancing, ouzo, and, of course, cousins.\nAnd if jump scares are your thing, Valak returns in supernatural horror flick “The Nun II.” This latest installment in “The Conjuring” universe is from Warner Bros. Pictures, which — like CNN — is owned by Warner Bros. Discovery.\nMusic\nMonday is not only Labor Day, it’s Bey Day. Beyoncé turns 42, and if you are lucky enough to be attending her show that night — or any of her shows through mid-September — her birthday wish is “to celebrate with you wearing your most fabulous silver fashions” as she winds down her “Renaissance” world tour next month.\nWhat’s happening in sports\nAt a glance …\nThe US Open tennis tournament continues in New York today with the start of the men’s and women’s Round of 16. It all culminates with the women’s final on Saturday and the men’s final one week from today.\nLionel Messi and Inter Miami take on Los Angeles FC today, and ticket prices for the match are the most expensive for a Major League Soccer game ever, according to TickPick, an online marketplace. Average prices are around $690 — a 527% increase over the average ticket price of an MLS game, which used to cost $110 before the global superstar joined the league.\nNFL Week 1 kicks off on Thursday night when the Detroit Lions battle the Kansas City Chiefs, the defending Super Bowl champions. Speaking of the big game, Super Bowl LVIII will take place on Sunday, February 11, 2024, in Las Vegas. Let the betting begin…\nThe college football season, meanwhile, is already underway. Learn here why all diehard fans need to cherish the 2023 season — because after this, the sport will never be the same.\nFor more of your favorite sports, head on over to CNN Sports as well as Bleacher Report, which — like CNN — is owned by Warner Bros. Discovery.\nQuiz time!\nLooking for a challenge to start your week? Take CNN’s weekly news quiz to see how much you remember from the week that was! So far, 54% of fellow quiz fans have gotten eight or more questions right. How will you fare?\nPlay me off …\nHappy birthday Beyoncé!\nCrank up the speakers at your Labor Day — I mean Bey Day — cookout and marvel at the birthday girl’s remarkable vocal range. (Click here to view)\nThe-CNN-Wire\n™ & © 2023 Cable News Network, Inc., a Warner Bros. Discovery Company. All rights reserved.",
  "word_count": 1261,
  "scraped_at": "2026-02-14T12:04:31.358943"
}