{
  "article_id": "f4bf54a5e52e",
  "url": "https://www.90min.com/posts/one-year-since-england-won-euro-2022-everything-that-has-happened-since-lionesses",
  "title": "One year since England won Euro 2022 : Everything that has happened since",
  "date": "20230731T191500Z",
  "domain": "90min.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "One year since England won Euro 2022: Everything that has happened since\n- England won Euro 2022 on home soil last summer\n- A first major international trophy for the Lionesses\n- The victory made household names of various players\nBy Emily Keogh\nWhen the final whistle blew at Wembley on 31 July 2022, England were crowned European champions for the very first time. Fast forward to the present day, a lot has happened since.\nIt has been exactly 365 days since the chilling moment that Chloe Kelly scored the extra-time winner in front of a packed-out Wembley Stadium, seeling England overcome Germany in dramatic fashion.\n\"I think you've seen it grow, especially even in the league,\" said Rachel Daly, who started at left-back throughout Euro 2022, but has since established herself as one of the WSL's top strikers.\n\"I think the Lionesses obviously have had the target on our back a little bit, but you know, we always say pressure is the privilege, and we've earned that, right? So things have changed in that sense.\n\"But we're all just the same old people that we were before. Obviously, things around us change, getting recognized a little bit more, stuff like that. But I don't think a whole lot has changed.\n\"And obviously, it's not something that we particularly focus on is the Euros because a lot of the group that are with us now weren't at the Euros, so it's great to have that in the bag, but this is a new tournament, and that's what we're focusing on now.\"\nEven though Daly believes the players have not changed much on an individual level, the broader landscape for the Lionesses certainly has.\nWhat has happened since the Lionesses became European champions?\nMore trophies and titles\nShortly before Euro 2022, England also won the inaugural Arnold Clark Cup. In 2023, six months after their Wembley win win, the Lionesses strode to victory in the Arnold Clark Cup once again, beating Italy, Belgium and South Korea to retain the trophy.\nThe first ever Women's Finalissima was also played in 2023, pitting the reigning European champions against those from South America. Brazil arrived at Wembley for the occasion, holding the Lionesses to a 1-1 draw over 90 minutes. But Mary Earps turned in a heroic penalty shootout performance to see England eventually prevail 4-2 from the spot.\nGovernment change\nImmediately after the Euros, the 23 England players wanted to leave a legacy and penned an open letter to the UK government calling for equal access to sports in school among both boys and girls, and hoping to make PE a requirement for all schools.\nLed by Lotte Wubben-Moy and Leah Williamson, the Lionesses were successful in securing a multi-million-pound investment in school sport and after-school activities – including over £600m in funding over the next two academic years.\nRetirements and injury crisis\nAfter the summer, Lionesses' top goal scorer Ellen White announced her retirement from football. Days later, veteran midfielder Jill Scott did the same. The pair had played an integral role in the Euros campaign and had been consistent presences under Sarina Wiegman since her tenure began.\nBut those losses from the squad would only be exacerbated by the injury crisis that has since gripped the Lionesses suffered, with three key players ruled out of this summer's World Cup.\nEuro 2022 top goalscorer and best player Beth Mead suffered an ACL injury while in action for club side Arsenal in November 2022. She initially held onto hope the World Cup was far enough away for her to recover, eventually losing that race against the clock.\nFran Kirby's fight for fitness was also deemed over in early May when it was announced that wouldn't be going to Australia with the Lionesses squad. Her absence has certainly been felt.\nLeah Williamson' ACL injury occured in April in WSL action. She had lifted the Euros trophy nine months earlier and had become a public figure who transended her sport. Losing a key defender and skipper in one swoop has arguably been one of England's biggest losses.\n30-game unbeaten streak: over\nEngland won all six games they played at Euro 2022, part of a much longer unbeaten run that began when Sarina Wiegman took up her position as head coach in September 2021.\nAfter the summer, the Lionesses England continued undefeated, winning all their World Cup qualifiers and even beating the reigning world champions United States at a sold-out Wembley.\nHowever, all good things eventually come to an end and England were beaten on a rainy night in Brentford by Australia. The result prompted a mixed reaction among players and fans, with some believing it was the wake up call that England needed to steady them ahead of the World Cup, and others suggesting it could shake the Lionesses up right before the tournament.\nWorld Cup qualification\nEngland booked their 2023 World Cup place in the first international break that followed Euro 2022, beating Austria with a game to spare - the Lionesses finished qualifying with 10 wins from 10 games, 80 goals and 10 clean sheets.\nNow at the tournament, England have secured two wins from their first two group games against Haiti and Denmark. The third and final game against China is next up, with the Lionesses in a good position to reach the knockout rounds - despite not yet putting in a vintage performance.\nInjury to key midfielder Keira Walsh has derailed England's confidence, but not all hope is lost as the Lionesses look to lift a major trophy for the second successive summer.",
  "word_count": 932,
  "scraped_at": "2026-02-14T13:01:05.639794"
}