{
  "article_id": "f4c7f952f020",
  "url": "https://cartilagefreecaptain.sbnation.com/2023/2/15/23601264/tottenham-hotspur-women-1-2-manchester-united-women-spurs-extend-losing-streak-against-top-wsl-side",
  "title": "Tottenham Hotspur Women 1 - 2 Manchester United Women : Spurs extend losing streak against top WSL side",
  "date": "20230215T194500Z",
  "domain": "cartilagefreecaptain.sbnation.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Tottenham Hotspur Women fell to Manchester United 1-2 in front of a healthy crowd at Tottenham Hotspur Stadium thanks to a heartbreaking own goal. We’re now winless in 8, and though performances have picked up from the goalless misery of late 2022, we have nothing to show for it in the league table.\nTottenham Hotspur Women 1 - 2 Manchester United Women: Spurs extend losing streak against top WSL side\nBetter performance, but like, I have questions\nRehanne Skinner stuck with a familiar lineup for the second game in the row. Tinja-Riika Korpela started in goal, with Amy Turner, Molly Bartrip, and Shelina Zadorsky ahead of her, and Kerys Harrop and Celin Bizet flanking them as wingbacks. Eveliina Summanen and Drew Spence reprised their partnership in the midfield two, and Ash Neville, Mana Iwabuchi and Beth England headed up the attack.\nThe first half was a tense affair, with Spurs set up in the organized, pressing mid-block we’ve come to expect. Spurs defended United’s attacks well, but struggled to progress the ball at times, or picked the wrong pass on promising counters. Leah Galton had a goal ruled out for offside in the 22nd minute, and shortly after Ash played in a beautiful ball to Beth England, but Beth put it over the crossbar.\nThe game broke open in the second half. In the 67th minute, Ona Batlle beat Kerys Harrop on the wing, and put in a dangerous cross that Leah Galton finished amidst chaos. Less than ten minutes later, Spurs equalized. Mana Iwabuchi battled hard to win the ball back just outside our third and played Beth England down the wing. Beth dribbled hard, made a fool out of Maya Le Tissier, and slotted home into the far corner. It was a gorgeous goal, and one emblematic of Spurs efforts thus far in the game.\nFor a minute, it seemed Spurs had done it, but it wasn’t to be. United came right back down our left side, with Lucia Garcia racing ahead of Kerys Harrop to put in a dangerous cross. Molly Bartrip unfortunately cut the ball into her own net, instead of out of danger. Moments before, Beth England had gestured at her teammates and pointed at her own head, “keep your head in the game.”\nThere was a bit of late drama when Ella Toone pushed Eveliina Summanen down, and then shoved her down again after Eveliina was on the ground. Ella Toone was sent off for dangerous conduct. Edit- Ella Toone’s red card has been overturned and the FA has opened an investigation into Eveliina Summanen for play acting. I think this is ridiculous. One of the best things about Eveliina is her ability to get under her opponents skin. Keep them rattled, Eveliina, you’re doing great. Spurs pushed for a late winner, but 10-player United held on to seal the win.\nAll in all, it was an encouraging performance. Several demons that plagued us earlier in the season look to have been vanquished–Spurs were more organized in defense, more dangerous in attack. Set piece defense continue to be relatively fine, and the whole squad looks fitter. Ash Neville looks more like her usual, delightful self. A tip-top Ash Neville is only good news for Spurs.\nI still think Spurs need to do better in ball progression. Whether this is adding more passers to the side (in, say, Asmita Ale), or setting up the side in a different way. Eveliina and Drew are both good passers, and we should see more out of them. United has the strongest defense in the league so I’m not terribly fussed about this.\nI’m also really starting to question the inclusion of Kerys Harrop over Asmita Ale. Asmita has shown her ability to play well against big sides with dangerous wingers before. Kerys, though I love her so much, has been responsible for quite a few goals of late. In this game, she was partially at fault for both after getting beat on the wing by Ona Batlle and later Lucia Garcia. Teams are starting to target that area, and I’d rather invest in a young, promising player and not risk losing her to a different side. I would’ve also liked to see Nikola Karczewska subbed on to cause some chaos.\nWe’ve known for months that Spurs can’t compete with this season’s top sides. We knew there was a very good chance Spurs wouldn’t take anything from this run of games against them. On the bright side, Spurs took the game to Manchester United, and were probably unlucky not to grab a point, which is a huge improvement on 2022. Against a side that’s not one of the best in the league, I think this display turns into a convincing win.\nIt’s not the season we thought we were going to have, but we’ll probably be fine. I like our chances–Spurs are now far better than Leicester and Brighton (if you can’t see that, do check the quality of your stream, you’re missing something), and we’re probably better than Reading and West Ham (who have been absurdly, astonishingly lucky, at least until their recent encounter with Chelsea in the Conti Cup). But it’s kind of too late for “what-ifs.” We’re just 3 points clear of the drop, and now we have to do it when it counts.\nSpurs next face Reading in the FA cup on February 26th. We’ll know a lot more about the state of the team after that game.",
  "word_count": 913,
  "scraped_at": "2026-02-14T12:39:02.393892"
}