{
  "article_id": "f4cc80851a8d",
  "url": "https://metro.co.uk/2023/05/15/landing-gear-completely-snaps-off-plane-during-emergency-landing-18784638/",
  "title": "Landing gear completely snaps off plane during emergency landing",
  "date": "20230515T114500Z",
  "domain": "metro.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "This is the frightening moment a plane’s landing gear was ripped clean off during an emergency landing.\nA Boeing 747 was heading for Chicago O’Hare Airport, USA when the pilot was forced to abort the flight shortly after take-off because the landing gear failed to retract.\nCargolux, the company operating the plane, confirmed one of its aircraft suffered a ‘significant landing incident’ yesterday evening.\nTerrifying footage filmed by onlookers shows the aircraft coming in to land at Luxembourg Airport after it safely dumped fuel and turned back.\nAs the plane touches down with its rear wheels, it starts to disappear out of the shot momentarily.\nBut then a shocked woman behind the camera can be heard saying: ‘Woah, woah, woah, s***!’\nJust out of shot, the right-hand landing gear had completely snapped off from the underside of the aircraft.\nWhen the camera pans further left, the entire landing gear can be seen dramatically flying through the air and bouncing along the runway.\nHuge puffs of dust and smoke kick up from the tarmac before the landing gear comes to a standstill on the ground.\nA fire service truck immediately rushes towards the damaged plane to help.\nPictures taken afterwards show significant damage to the fuselage with crumpled bodywork and a gaping hole in the plane.\nThe wheels of the landing gear were torn off and entirely separated from the plane.\nA Cargolux spokesman said: ‘Cargolux would like to confirm that one of its aircraft, B747-400F bearing registration mark LX-OCV, suffered a significant landing incident at Luxembourg airport on Sunday evening at 18:52.\n‘The aircraft was unable to retract its landing gear on take-off from Luxembourg.\n‘As a result, it was forced to safely dump fuel in order to return to land at the airport.\n‘On its landing roll its right body landing gear detached from the aircraft.’\nFortunately no one was hurt in the incident and Cargolux say the plane managed to come to a ‘controlled stop’ before emergency services attended the scene.\nMore Trending\nThe spokesman added: ‘No persons on board nor on the ground suffered any injuries.\n‘The relevant authorities have been informed of the incident.\n‘The aircraft remains on the runway and recovery efforts are underway.’\nLast month, a plane carrying the Arsenal women’s football team burst into flames on the runway as it was taking off.\nGet in touch with our news team by emailing us at webnews@metro.co.uk.\nFor more stories like this, check our news page.",
  "word_count": 411,
  "scraped_at": "2026-02-14T13:00:03.540989"
}