{
  "article_id": "f4e41c07cf98",
  "url": "https://www.sheknows.com/entertainment/slideshow/2524282/kate-middleton-royal-fashion-photos/",
  "title": "Top Kate Middleton Royal Fashion Moments : PHOTOS – SheKnows",
  "date": "20231230T001500Z",
  "domain": "sheknows.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "When you picture the royals, we wouldn’t be surprised if the first thing that comes to mind is their dazzling style. From extravagant gowns to expensive jewelry — or in Princess Diana’s case, her impeccable streetwear style — the royals always come dressed for success from head to toe. And after many Diana-less years, there was one royal in particular who made us fall back in love with Palace fashion: Kate Middleton, Princess of Wales.\nIt feels like just yesterday we were setting our alarms for 4 AM to see the legendary wedding of Kate and Prince William in 2011, and almost fifteen years later, Kate still looks like the royal-to-be we fell in love with — though her confidence and charisma have only increased as she’s grown in her royal role.\nWhether it’s an all-matching ensemble or a glittering gown, Kate knows what looks good on her and how to rock it. So, in honor of her birthday today, Jan. 9, we wanted to take a walk down memory lane. Except this memory lane is a super-fashionable one where we look back at Kate’s best royal looks over the years. We know it’s hard just to pick a few, but we were up to the task (plus we had the ever-so-helpful and amazing site Kate Middleton Style to help us along the way).\nFrom 2011 to now, Kate Middleton has remained an effortless fashion icon — check out some of our favorite looks of hers from the past decade below.\nA version of this article was originally published on Jan 2022.\n-\nUS State Visit (2025)\nCatherine, Princess of Wales, arrived in a gold-encrusted off-white gown from Phillipa Lepley during the State Banquet hosted by King Charles III and members of the Royal Family at Windsor Castle during the state visit by US President Donald Trump.\n-\nWimbledon (2025)\nFor Wimbledon 2025, Kate wowed in an all-white Self-Portrait look that mirrors the silhouette of her past Wimbledon looks.\n-\nTrooping The Colour (2025)\nFor the 2025 Trooping the Colour, Kate Middleton wowed in a new color: an aqua look. The look pays homage to Princess Diana and Queen Elizabeth II. She donned a Catherine Walker coatdress (Diana’s favorite designer), a matching hat by Juliette Botterilll Millinery, and Elizabeth’s Bahrain Pearl Earrings.\n-\nTogether At Christmas Service (2024)\nFor the long-awaited ‘Together At Christmas’ Carol Service at Westminster Abbey on Dec 6, 2024, Kate wowed ina festive look. For the event, she donned a bespoke, red coat that’s from Sarah Burton for Alexander McQueen. She paired it with a festive (and trendy) black velvet bow and a plaid skirt from Emilia Wickstead’s Autumn-Winter 2018 collection.\n-\nFestival of Remembrance (2024)\nKate Middleton looked truly beautiful in this all-black look for the 2024 Festival of Remembrance.\n-\nWowing at Wimbledon (2024)\nAs you can see, Kate looked gorgeous in a vibrant lilac Safiyaa London Cecilia dress, which she paired the look with the L.K. Bennett Milly handbag, two Halcyon Days bangles, and her Camilla Elphick Lucia sandal for Wimbledon 2024.\n-\nTrooping the Colour (2024)\nKate made a surprise appearance in a sleek white dress from Jenny Packham, featuring a white base and black lines. She also donned a matching, striped fascinator from Philip Treacy, Gianvito Rossi heels in white, Cassandra Goad Cavolfiore Pearl Stud Earrings, a striped monochromatic bow, and a Mulberry clutch.\nThis was her first appearance in 2024.\n-\nA Royal Christmas (2023)\nChristmas Day wouldn’t be complete without a Kate Middleton fashion moment. In 2023, Kate wore an all blue outfit with a statement hat as she attending a church service.\n-\nPrincess Pink (2023)\nFor the Diplomatic Reception in the 1844 Room at Buckingham Palace, Kate donned a truly sparkling pink gown with silver accents and dazzling details.\n-\nRoyal Blue (2023)\nKate gave royal blue a whole new meaning in this floor-length Safiyaa London gown, Gianvito Rossi matching heels and glittering silver clutch by Jenny Packham as she attended The Royal Variety Performance 2023 on Nov. 30.\n-\nPurple Power (2023)\nIn another one of her signature monochromatic look, Kate looked confident as ever at the Shaping Us National Symposium on Nov. 15 in this double-breasted blazer and cigarette-style trousers from Emilia Wickstead.\n-\nRocking Red (2023)\nDuring the ceremonial welcome for The President and the First Lady of the Republic of Korea on Nov. 21, Kate looked incredible in this bright red Catherine Walker cape paired with a matching Jane Taylor wide-brim felt hat, a Miu Miu bow-embellished suede bag and Gianvito Rossi heels.\n-\nMatching in Green (2023)\nKate and William had such a cute matching moment in their blue denim and green blazers while visiting DAY1 in Scotland on Nov 2.\n-\nGoing Back to Basics (2023)\nYet again, Kate rocked a sleek Zara blazer, along with her go-to slim-leg MOTHER jeans and white Veja sneakers for World Mental Health Day.\n-\nTerrific in Tweed (2023)\nKate Middleton stole the show in this white tweed Zara blazer, when she arrived at the 2023 Quarter Final match between England and Fiji.\n-\nKeeping It Cozy (2023)\nDuring a visit to Nottingham Trent University, Kate looked comfortable yet ultra-chic in this skirt and sweater two-piece set from Sezane.\n-\nPretty & Preppy (2023)\nWhile visiting the Vsi Razom Community Hub on Oct 4, Kate looked incredible in this preppy heathered gray look. For the big day, the royal paired a classic white button-down with a gray sweater vest from Cefinn (find an affordable version HERE!) and matching gray trousers from Sezane Martin.\n-\nRavishing in Red Zara (2023)\nFor her ‘Shaping Us’ campaign, Kate rocked this tweed, red Zara blazer, which she paired with a Boden cashmere sweater and black slacks.\n-\nTerrific in Teal (2023)\nWhile visiting the AW Hainsworth in 2023, Kate Middleton kept her super-chic suit regime up with this teal Burberry number.\n-\nCharming in Camel (2023)\nThe Princess of Wales looked so chic in this camel Roland Mouret suit for a meeting with frontline staff from Streets of Growth.\n-\nBlack-Colored Rewears (2023)\nYet again, Kate rocked a dark suit from Holland Cooper, along with black slacks and he trusty black Gianvito Rossi heels!\n-\nNeat in Navy (2023)\nFor her public Sept 2023 visit to HMP High Down, Kate wowed in this richly-colored suit from Alexander McQueen!\n-\nWhite Wonder for Rugby Match (2023)\nOn Sept 9, Kate Middleton wowed in this re-wear of a white blazer by Alexander McQueen, which she paired with delicate Mappin & Webb jewelry for the Rugby World Cup France 2023 match.\n-\nBurgundy Beauty (2023)\nFor her first appearance in months, Kate donned this sleek burgundy coat dress from Eponine London, along with wearing Queen Elizabeth II’s earrings for the tribute for the late Queen.\n-\nGorgeous in Green (2023)\nFor the Wimbledon Men’s Finals on July 16, 2023, Kate rocked yet another gorgeous green look! We’re convinced this is her favorite color, and it’s quickly becoming one of our favorite colors to see on the Princess of Wales. For the big day, she debuted a new piece: a green Roland Mouret Short Sleeve Cady Midi Dress.\n-\nLovely in Lime (2023)\nFor day thirteen of the Wimbledon Tennis Championships 2023, Kate arrived in a bold, lime green ensemble of a tweed blazer and pleated skirt that reminded everyone, yet again, of Princess Diana’s 1980s fashion.\n-\nBeautiful in Beulah (2023)\nFor the 2023 Royal Charity Polo Cup event, Kate donned a blue and white patterned Beulah dress that fans have never seen from her before!\n-\nStunning in Scotland (2023)\nOn July 5, Kate rocked this monochromatic rewear of her blue Catherine Walker coatdress.\n-\nWowing at Wimbledon (2023)\nFor day two of the Wimbledon Tennis Championships, Kate truly channeled her late mother-in-law Princess Diana with this colorful, mint green 1980s look from Balmain.\n-\nPolka Dot Princess (2023)\nFor her trip to Southampton in June 2023, Kate Middleton re-wore one of her Wimbledon 2022 looks. She rocked a blue polka dot dress by Alessandra Rich and her go-to Alessandra Rich Fab Slingback Pumps.\n-\nRoyal Red at Royal Ascot (2023)\nFor the 2023 Royal Ascot, the Princess of Wales stunned in this bold, all-red ensemble from Alexander McQueen. She paired the bold look with earrings from Sézane, a matching fascinator from Philip Treacy, and Jennifer Chamandi heels.\n-\nChic in Chanel (2023)\nKate turned heads on June 20, 2023 when she stepped out in this monochromatic, tweed look from Chanel for the reopening of the National Portrait Gallery.\n-\nPolka Dotted Princess (2023)\nFor the Order Of The Garter Service on June 19, 2023, Kate channeled Princess Diana once again in this silky, polka-dotted dress from Alessandra Rich. (And if this dress looks familiar to you, it’s because Lady Eliza Spencer wore the same one in pink to honor Diana at the Chelsea Flower Show)!\n-\nTrooping the Colour 180 (2023)\nFor her debut as the Princess of Wales, Kate did a total 180 from her usual Trooping the Colour look. For the 2023 event, she wore a green dress from designer Andrew GN, from their Spring-Summer 2023 collection.\n-\nGreen for Riversley Park Children’s Centre (2023)\nKate shook things up during her visit to the Riversley Park Children’s Centre, by wearing a summer-theme green leopard dress from Cefinn Petra, which she paired with Kiki McDonough Green Amethyst Pear Drop Earrings, her whie Mulberry Amberley Small Crossbody Bag, and her iconic Jimmy Choo Romy 85 Pumps.\n-\nChic Blue Blazer (2023)\nFor Kate’s visit to the Windsor Family Hub in June 2023, she opted for a chic and affordable look consisting of a gingham blue blazer from Zara and Emmy London flats!\n-\nBusiness Barbiecore (2023)\nKate made headlines again with this Barbiecore suit from Alexander McQueen. She paired the pastel suit with Gianvito Rossi 105 White Leather Pumps, a daring Camilla Elphick Pearl White Belt, and Maria Black Cha Cha Mother-Of-Pearl Drop Single Earrings.\n-\nCasual Barbiecore (2023)\nFor the highly publicized Chelsea Flower Show on 2023, Kate wowed everyone with this rewear of a pleated Barbiecore dress from ME+EM. She paired the look with Castañer Carina Espadrille Wedges and Catherine Zoraida Fern Drop Earrings.\n-\nGreen Goddess (2023)\nDuring her visit to the Anna Freud Centre on May 18, Kate turned heads in this sleek and chic green dress from Suzannah London, which she paired with monochromatic Alessandra Rich ‘Fab’ Slingback Pumps.\n-\nRewear Royal (2023)\nOne of Kate’s fan-favorite looks was her Royal Ascot 2019 look: an Elie Saab ensemble, which she re-wore in 2023! In this look, we see her rocking a dusty blue Elie Saab skirt and pussybow shirt, along with blue Kiki McDonough earrings, a metallic Elie Saab clutch, and a Philip Treacy hat from 2016.\n-\nWowing in Red & White (2023)\nOn May 4, Kate rocked this outfit of rewears for her visit to the Dog & Duck pub. She rocked a red Eponine London coat dress, a white Suzannah Flippy Wiggle Dress, and matching white accessories from Mulberry, Jimmy Choo, and Maria Black.\n-\nBeyond Regal at the Coronation (2023)\nEntering King Charles’ coronation, the Princess of Wales took our breath away in this billowing royal blue cape with red and whit details. Her headpiece, a floral tiara, is a refreshing and stunning change of coronation attire. We love to see it!\n-\nBold in Black (2023)\nDuring a visit to the Aberfan memorial garden, Kate looked as chic as can be in this Zara Black & White Houndstooth Pussybow Dress and her go-to Mulberry Small Amberley Crossbody Bag. While we don’t see Kate in darker colors often, she always stuns in them!\n-\nCasually Chic (2023)\nFor Kate’s surprise visit The Baby Bank on April 24, 2023, she decided to rock a gorgeously chic and simple ensemble of a REISS Larsson blazer, black slacks, and Boden Clothing pointed flat shoes.\n-\nMerlot Middleton (2023)\nFor her and William’s visit to The Rectory on April 20, 2023, Kate turned heads in this merlot Karen Millen trench coat. She paired the deep look with a black Smythson Panama East West Zip Tote, Sézane’s Dina earrings, and the Gianvito Rossi ‘Gianvito 105’ pumps in Burgundy that she always re-wears!\n-\nBeautiful in Blue (2023)\nFor the 2023 Easter Mattins Service, Kate Middleton arrived in a showstopping cobalt blue ensemble consisting of a coat dress by Catherine Walker, Gianvito Rossi pumps, and a Lock & Co. Mayfair Pillbox hat.\n-\nBusiness Style for Business Affairs (2023)\nFor the inaugural meeting of new Business Taskforce for Early Childhood, Kate showed everyone she meant business by arriving in a white Alexander McQueen Crepe Jacket, black slacks, her Gianvito Rossi Pumps in Black Suede, and an Anderson’s Croc-Effect Leather Belt.\n-\nTeal at the St. Patrick’s Day Parade (2023)\nOpting to change it up from the traditional green, Kate Middleton wore this stunning teal Catherine Walker & Co coat dress to the 2023 St. Patrick’s Day Parade. In addition to matching heels and a fascinator, the royal accessorized the look with a festive shamrock brooch\n-\nClassic Navy for the Commonwealth Day Service (2023)\nAt 2023’s Commonwealth Day Service, Kate Middleton looked stunning wearing a floral navy skirt and blazer from Erdem. She then paired the two-piece set with matching navy accessories including a hat, heels, and a clutch. (Find a similar style HERE and HERE!)\n-\nParade Ready in Bright Red (2023)\nCatherine, Princess of Wales looked stunning in this bright red coat during a visit to the 1st Battalion Welsh Guards for the St David’s Day Parade on March 1. The royal paired the look with all-black accessories: a black shirt, black boots, black gloves and a matching fascinator.\n-\nBeautiful at BAFTAs (2023)\nCatherine, Princess of Wales looked like a monochromatic dream when she stepped out in this flowing, ethereal white gown from Alexander McQueen. She paired the look with black gloves, a black clutch, and statement gold earrings from Zara.\n-\nRadiant While Rocking Red (2023)\nEveryone’s breath was instantly taken away when Kate Middleton arrived for a BAFTA event in this Alexander McQueen ensemble. Red really is her color, and she went all out by pairing it with Miu Miu clutch, statement earrings by the brand Florence in the style Regency, and her go-to Gianvito Rossi ‘Gianvito 105’ Pumps.\n-\nPantsuit Power (2023)\nAttending a reception for the England Wheelchair Rugby League Team on Jan 19, Kate Middleton gave us all some work attire inspiration in this maroon tailored pantsuit, matching heels, and cream-colored top.\n-\nGorgeous in Green (2022)\nFor this year’s Earthshot Prize, Kate Middleton arrived in a show-stopping Sabina Maxi Dress in Bright Green from Solace London, which she rented for around $100 on the renting platform Hurr. She paired the look with Princess Diana’s favorite necklace: the Delhi Durbar Emerald Choker, and matching earrings.\n-\nHarvard Chic (2022)\nIn her first solo moment during her and Prince William’s trip to Boston, Kate Middleton visited Harvard University and their Center on the Developing Child. For the occasion, Kate wore a custom-made, tailored long-sleeved blue houndstooth Emilia Wickstead dress. She accessorized the look with an adorable baby blue Mulberry leather purse and navy suede Gianvito Rossi pointy-toe heels.\n-\nCeremonial Welcome (2022)\nAttending the Ceremonial Welcome by The King and The Queen Consort at Horse Guards Parade on Nov 22, Kate Middleton looked stunning in this monochromatic burgundy look. The royal paired this gorgeous Emilia Wickstead coat dress with a matching Sean Barrett hat and color-coordinated heels and a Mulberry bag. So stunning!\n-\nRugby League World Cup 2021 Quarter Final (2022)\nProving once again that red is her color, Kate Middleton wore this red Alexander McQueen dress for the Rugby League World Cup 2021 Quarter Final on Nov 5, Town and Country reported. The royal paired the showstopping coat with a burgundy turtleneck, drop pearl earrings and boots, perfect for the rainy weather.\n-\nOfficial Visit in Scarborough (2022)\nKate Middleton looked absolutely stunning in this head-to-toe tan ensemble during her and Prince William’s official visit to Scarborough on Nov 3. Breaking down the look, the royal wore a midi-length turtleneck dress with a brown woven Boven belt and a Max&Co camel coat on top, Town & Country reported. She also wore matching Ralph Lauren heels, gold hoop earrings and a chocolate-colored DeMellier purse. The definition of monochromatic perfection!\n-\n10th Anniversary Of Coach Core (2022)\nKate Middleton celebrated vintage in this classic tweed Chanel jacket at the 10th Anniversary Celebration of Coach Core at the Copper Box Arena. Kate paired the double-breasted blazer with black wide-leg trousers, a matching pendant, and gold twisted hoops.",
  "word_count": 2786,
  "scraped_at": "2026-02-14T12:30:35.739629"
}