{
  "article_id": "f4eccf334a41",
  "url": "https://www.aa.com.tr/en/world/morning-briefing-nov-15-2023/3053885",
  "title": "Morning Briefing : Nov . 15 , 2023",
  "date": "20231115T083000Z",
  "domain": "aa.com.tr",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Morning Briefing: Nov. 15, 2023\nAnadolu’s recap of top stories from around the globe\nISTANBUL\nHere’s a rundown of all the news you need to start your Wednesday, including the storming of Al-Shifa hospital by Israeli forces, a lack of fuel hindering UN aid deliveries to the Gaza Strip, and Hamas rejecting Israel’s call to displace Palestinians from Gaza.\nTOP STORIES\nThe Israeli army stormed Al-Shifa Hospital in Gaza City early Wednesday.\nThe head of the burns department at the Al-Shifa Medical Complex said Israeli tanks and bulldozers were inside the complex, reported Al Jazeera.\nEarlier Wednesday, the Israeli army said it had launched a military operation in “a certain part” of the Al-Shifa Medical Complex.\nHamas said it held Israel and US President Joe Biden fully responsible for the repercussions of the storming of the complex and the safety of the medical staff as well as the displaced people taking shelter there.\nThe UN agency for Palestinian refugees or UNRWA was not able to receive aid that entered the Gaza Strip on Tuesday through the Rafah border crossing due to a lack of fuel, its commissioner-general said late Tuesday.\n“No fuel has entered Gaza since 7 Oct. Our trucks were not able to receive aid coming through the Rafah crossing today,” said Philippe Lazzarini.\nHe warned that the humanitarian response in the Gaza Strip, on which over 2 million people are dependent, is gradually coming to an end.\nPalestinian resistance group Hamas rejected Israel’s far-right Finance Minister Bezalel Smotrich comments Tuesday in favor of displacement of the Palestinians in the Gaza Strip.\n“We tell Smotrich and his like that we are the ones who will stay on this land,” senior Hamas member Osama Hemdan said a press conference in the Lebanese capital Beirut.\nHe accused the Israeli army of deliberately targeting hospitals to push Palestinians into “forced migration.”\nEgypt called the remarks by the Israeli official “irresponsible.”\nNEWS IN BRIEF\nCanadian Prime Minister Justin Trudeau urged Israel on Tuesday to exercise maximum restraint for the protection of civilians in Gaza, saying the killing of women and babies \"has to stop.\"\nLebanon filed a complaint with the UN Security Council against Israel’s targeting of Lebanese journalists, its Foreign Minister Abdullah Bou Habib said Tuesday.\nHamas claimed Tuesday to have killed seven Israeli soldiers in the Gaza Strip from “point-blank range” north of Gaza City. Israel says 49 of its soldiers have been killed in Gaza since Oct. 27.\nThe death toll of Palestinians killed by Israeli forces in Gaza Strip has surged to 11,320 people, the government media office said on Tuesday, with the victims including 4,650 children and 3,145 women.\nFamilies of Israelis held captive by Hamas staged a march in Tel Aviv on Tuesday to demand the release of their relatives held hostage in Gaza.\nLebanese group Hezbollah said Tuesday that it had struck Israeli military sites near the border with Lebanon amid rising tensions along the countries’ shared frontier.\nMore than 60 left-wing politicians from Europe and Latin America signed a petition calling on the International Criminal Court (ICC) to investigate Israeli leaders for genocide.\nIsrael’s war cabinet met Tuesday night to discuss a deal to release Israelis being held captive by the Palestinian group Hamas in the Gaza Strip, Israeli Channel 13 reported.\nNearly 15,000 babies are expected to be born in Gaza between Oct. 7 and the end of 2023, all of them at “grave risk amid escalating violence\" and with “medical care, water and food at crisis levels,” said Save the Children.\nMore than 400 US government officials from 40 government agencies sent a letter Tuesday to President Joe Biden opposing his support for Israel in its war on the Gaza Strip, and demanding a cease-fire\nFrance's Senate passed a bill Tuesday seeking to control immigration by toughening measures and making it easier for authorities to expel foreigners who commit crimes.\nSPORTS\nUEFA, the governing body of European football, initiated proceedings against the Kosovo Football Federation due to booing and whistling during Israel’s national anthem on Sunday, local media reported.\nKosovo beat Israel 1-0 on Sunday in a Group I qualifying match to seal a spot in UEFA EURO 2024.\nKosovo fans booed Israel's national anthem during the pre-match ceremony.\nBUSINESS & ECONOMY\nAnnual consumer inflation in the US came in at 3.2% in October, slowing from a 3.7% gain in September, according to figures released Tuesday.\nThe figure was also lower than expectations of a 3.3% increase, year-on-year.\nThe consumer price index (CPI) showed an annual increase of 3.7% in August.\nHigh interest rates reducing credit growth in developed countries: Fitch\nHigh interest rates are reducing credit growth in developed countries, according to a report released Tuesday by Fitch Ratings.\n\"Lending growth to households and corporates is declining swiftly in Europe, the US, Australia and Canada as monetary tightening takes hold,\" said the report.\n\"Bank lending in Spain and Italy is contracting in annual terms, while in France and Germany, it is decelerating rapidly.\"\nAnadolu Agency website contains only a portion of the news stories offered to subscribers in the AA News Broadcasting System (HAS), and in summarized form. Please contact us for subscription options.",
  "word_count": 862,
  "scraped_at": "2026-02-14T12:05:50.866545"
}