{
  "article_id": "f5180183504c",
  "url": "https://nkytribune.com/2025/11/dan-webers-just-sayin-hall-of-famers-helicopter-hero-and-no-1-nku-volleyball/",
  "title": "Dan Weber Just Sayin : Hall of Famers , helicopter hero and No . 1 NKU volleyball",
  "date": "20251121T071500Z",
  "domain": "nkytribune.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Capt. Tommy Butts, USN, was clear about exactly how the former Lloyd Memorial football/baseball star was able to make the long trip from his home in Coronado, California, for the Wednesday induction into the Northern Kentucky Sports Hall of Fame.\n“I didn’t get here by myself,” the Deputy Commander in charge of 4,000 personnel and 135 aircraft for the Helicopter Combat Wing Pacific as he thanked so many in the room – and in his life. And on his teams growing up in Erlanger, as well as all the coaches who worked with him and now, for those in his command.\nA self-described “slow running back,” he thanked the coaches who worked with him to become a quarterback calling the signals, from his eight years from 1981 to 1989 in an Erlanger Lions’ program that “instilled discipline and pride” to his Lloyd High School days when the late Rudy Tassini told him “You’re my quarterback.”\nThat “changed my life,” said Butts, whose last 30 years have been spent flying for the Navy, where he has more than 2,700 flight hours on the way to ever more increasing command opportunities that have earned him an arm’s-length list of military citations. Most recently, he was Battle Director at the Combined Air and Space Operations Center at Al Udeid Air Base in Qatar.\nHe praised high school coaches like Mike Burns and Bob Meyerhoff and youth coaches like John Dunhoft and Marc Otto who helped him discover the leader within him.\nAnd then there was his family. “It’s not lost on me the love and sacrifices they showed me,” Capt. Butts said as he highlighted all those who helped him get here – including a half-dozen of those Erlanger Lions’ teammates in attendance.\nDrue Ferguson, in a touching tribute to his hometown of Dayton and a single mom who raised him, made clear he’s “so proud to have grown up in Dayton” and now joins the 21 proud Greendevils to be inducted before him into the NKSHOF. But nothing, not helping Dayton to its lone state football championship in 1966, nothing else compared to having the love and support of his mom, a recovering TB victim, who encouraged her only child in what is now “a 60-year life in sports,” Ferguson said.\nHe’s retired from Kroger’s after listening to his mom and pursuing a career in computers and not in sports except for coaching kids. And definitely not in basketball, his first love, when he realized that the day he fouled out in a JV game with all five offensive fouls. Maybe it was a sign his game was football, he said.\nAlthough in basketball, he did miss his mom’s “Get the ball, you all” call in her Southern accent that could be heard anywhere in the gym. His Dayton High football coach Ray King was “like the father I never had.” And tough-talking basketball coach Tom Hood was the Bobby Knight in his life with a dozen or so special comments that still live with him.\nJerry Klein, another Lloyd guy, went from Lloyd’s two-time MVP offensive lineman, Iron Man and Leadership Award winner to UK, where he won a scholarship as a walk-on and moved from part-time starter as a junior to starting center as a senior on the team that faced No. 12 West Virginia in the Hall of Fame Bowl in Birmingham in 1983.\nBuddy Dittus, an assistant at Lloyd, recalls how Jerry “started out as tight end but we realized he didn’t want to catch the ball, he wanted to hit somebody.”\nKlein thanked his Lloyd teammates and friends, a number that are still close to this day – “We’re a tight bunch,” Jerry said. And thanks also to UK’s esteemed Academic Director for Athletics, Bob Bradley, for driving up to join him on this day.\nAnd to his family: “You are what I am most proud of, thank you all,” Klein said.\nThe father-son duo of Bob Hassman (Newport Central Catholic swimming) and Bob Jr. (Highlands soccer) had the younger Hassman deferring to his dad who was honored first. “I won’t be as long – or as funny – as my father,” he promised.\nNor could he guarantee, the Northern Kentucky Player of the Year and first-team all-stater in 2000 said, that he’d be here now at a time when soccer is a much more serious sport. “Soccer at Highlands was a little bit different,” he said, “our coaches were more chaperones.”\nBob Jr. thanked his mom and dad for taking him “to thousands of soccer practices.” And finished with this line: “Thank you all, that’s all.”\nHis dad – one of Kentucky’s top high school swimmers and a UK scholarship athlete who competed at the top of the SEC for four years while qualifying for the Olympic Trials, had fun talking about practice and “what it was like to grow up in the ‘60’s and ‘70’s.” Especially when you were born on the day that was the 100th anniversary of the YMCA. And you were given a lifetime YMCA membership.\nAnd on your arrival as a youngster at Cincinnati’s Williams YMCA, you realized that it was a “swimsuit optional” pool. As was the pool where his NewCath team practiced. And where his high school coach couldn’t swim so “we couldn’t throw him in the pool when we won a meet.”\nLots of fun for the Hassmans.\nSeth Combs accepted for his father, Larry Combs, who he described as “a baseball guy whose stories I still tell, to this day.” Like when the All-NKAC pitcher at Newport got the chance to start as the pitcher for the first NKU (then NKSC) baseball team when it faced the University of Kentucky.\nHe also coached pitching for Seth’s Knothole team into the 2000’s.\nTop-seeded NKU women to host Horizon volleyball this weekend\nFor the first time in the decade NKU has been in the Horizon League, the Norse women volleyballers have secured the top spot in the postseason tournament. As well they should with a 17-1 Horizon record (21-8 overall) as they come into the postseason on a 13-game win streak.\nAs a result, NKU will be seeded into the Saturday semifinals at 3 p.m. against the lowest-seeded quarterfinals winner. The championship match will be at 2 p.m. Sunday. The tournament opens Friday with games at 3 and 6 p.m. with the same on Saturday. Tickets are $15 a day and available at Ticketmaster.com or the Truist Arena Box Office. Fans can park in Lot O or in the Arena Garage west of Truist Arena. Attending fans can enter through the Main Entrance or the North Gate. Truist Arena has a clear bag policy and is cashless.\nContact Dan Weber at dweber3440@aol.com. Follow him on X (formerly Twitter) @dweber3440.",
  "word_count": 1130,
  "scraped_at": "2026-02-14T12:20:42.202767"
}