{
  "article_id": "f5211a9cb422",
  "url": "https://www.newcastleherald.com.au/story/8893605/red-cards-in-round-1-edgeworth-triumphs-as-npl-season-kicks-off/?cs=7580",
  "title": "Red cards in round 1 : Edgeworth triumphs as NPL season kicks off | Newcastle Herald",
  "date": "20250216T114500Z",
  "domain": "newcastleherald.com.au",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Ryan Feutz's goalscoring celebrations were short-lived in Edgeworth's crucial win over defending champions Broadmeadow while Newcastle Olympic's new-look forward line all fired as they also posted a first-up victory in NPL Northern NSW over the weekend.\nSubscribe now for unlimited access.\nor signup to continue reading\nAnother talking point of round one was the winning return of Belmont Swansea, back playing top-tier football for the first time in 26 years, as well as the fact the season was kicking off earlier than ever before.\nPlayers barely had time to digest their Christmas turkeys and round one was upon them.\nBelswans turned heads with their gritty, 5-2 win over Adamstown at Blacksmiths Oval on Thursday night.\nOn Friday night, the grand final rematch pitted defending champions and premiers Broadmeadow against Edgeworth, and the game went down to the wire.\nLittle separated the teams before Feutz, the 2024 NPL leading scoring, finally broke the deadlock in stoppage time to secure a 1-0 victory and send the Eagles' home crowd at Jack McLaughlan Oval into raptures.\nThe New Zealander was mobbed by teammates on the sidelines then booked for taking off his shirt amid celebrations. The yellow card was Feutz's second of the match - the first for a challenge - and was consequently followed by a red.\nIt means the Kiwi will be suspended when the Eagles travel to Blacksmiths in round two to face the competition newcomers.\n\"For both teams, it was all about getting a result,\" Edgeworth coach Peter McGuiness said.\n\"The horror start we had last year, not in football terms but results-wise, we didn't want to get off to that start again, so it's important to get some points up straight away.\"\nOn Saturday, Olympic's investment in their front third quickly paid dividends. New recruits Roy O'Donovan, Jared Muller and Kane Bradbery all scored as Olympic beat Cooks Hill 4-2 at Darling Street Oval.\nOlympic took a 1-0 lead when Cooks Hill conceded an own goal on a corner in the 16th minute. Muller made it 2-0 in the 56th minute before teenage talent Cody Nancarrow (63rd minute) pulled one back for Cooks Hill with a spectacular long-range effort.\nO'Donovan notched his first goal in Olympic colours in the 74th minute but Alex Gillespie fired back for the visitors in the 81st minute. Bradbery sealed the three points with four minutes of regulation time remaining.\n\"To get three points, first game of the year, we're very happy with that.\" Olympic coach Paul DeVitis said.\n\"Home game, Old Boys day, it was pretty imperative that we started with three points.\n\"Cooks Hill were very good, and will battle for the five. I think the difference was our finishing was very good, especially Roy and Kale, they took their chances very well.\n\"To score four goals, that might have happened once last year. Otherwise, there was a lot of games where it was one or two goals last year. That was a big reason why we wanted to recruit in the top third, and all of our three attackers scored so that was fantastic.\"\nAt Cooks Square Park on Saturday, Maitland and Valentine drew 3-3. The Magpies led 2-0 after goals to Tyrell Paulson (16th minute) and Aden Raftery (25th minute). But Phoenix responded through Carter Smith (53rd minute) and substitute Toby Jensen (68th minute).\nBraedyn Crowley restored a one-goal advantage for the hosts from the penalty spot in the 83rd minute before Campbell Ross forced an equaliser in the 88th minute.\nNew Lambton's goalkeeping stocks were already thin and things quickly went from bad to worse as their NPL Women's campaign got underway with a 6-1 loss to defending champions Charlestown at Alder Park on Saturday.\nWith Isabella White set for an extended period on the sidelines due to an ankle injury, Golden Eagles coach Aaron Stedman looked to reserve shot-stopper Ngawai Pirini.\nBut, by the 18th minute, he was looking at what his next option was when Pirini got caught off her line and was red-carded for handling the ball outside of the area to deny Madi Gallegos.\nReduced to 10 players, centre-back Finley Woodforth took the gloves.\nAzzurri led 3-0 at the break after Gallegos produced a first-half double, scoring headers in the 23rd and 39th minutes. Melina Ayres made it 3-0 on the stroke of half-time.\nNew signing Caitlin Pickett won a foot race to get New Lambton on the scoresheet in the 48th minute before Gallegos added her fourth goal of the game with a tap-in in the 65th minute then Ayres completed a match brace with an outside-of-the-foot effort in the 87th minute.\nOn Sunday, defending NPLW premiers Maitland trailed for 80 minutes before drawing 1-1 with newcomers Lake Macquarie at Cooks Square Park.\nThe Magpies, under new coach Joseph Wright, fielded four players with national league experience - Sophie Nenadovic, Sophie Stapleford, Renee Pountney and Josie Morley - in their starting side plus former South African representative Marry Ntsweng.\nBut Lakes, who have replaced Warners Bay in NPLW, stunned the hosts to take a 1-0 lead with the game just five minutes old.\nTahlor Thackray buried the rebound after goalkeeper Annabella Thornton spilled Ani Jensen's free kick from the edge of the box to score the club's first goal in NPLW.\nEmily Loader Weston had the chance to double the advantage three minutes later but, with only Thornton to beat, put her shot wide of the goals.\nThe competition's newest side looked fit and fast, and kept Maitland on their toes.\nThe Magpies pushed and probed to no avail before Stapleford finally found the leveller with a curling, left-footed free kick from close to the right corner in the 85th minute.\nAlso on Sunday, Charlestown's men's side beat Weston 3-1 at Lisle Carr Oval.\nAzzurri led 2-1 at the break. Jarryd Sutherland opened the scoring in the 10th minute then Tyron Cousins made it 2-0 from the penalty spot in the 31st minute after Sutherland was felled in the area by Weston's Dominic Archbold.\nBlake Archbold pulled a goal back for the Bears when he scored from a tight angle in the 35th minute.\nCousins restored the home side's two-goal buffer in the 67th minute.\nOn Sunday night, dual A-League Women's championship-winner Rhali Dobson announced her return to NPLW with a hat-trick in Olympic's 8-2 rout of Magic at Magic Park.\nDobson, who is back in action after starting a family, scored either side of Jemma House's individual effort to have Olympic 3-0 up after 25 minutes.\nElodie Dagg made it 4-0 with a volley off a corner before Olivia Oto found the back of the neck for Magic one minute before the break.\nHouse and Laura Hall made it 6-1 before Lilly-Jane Babic added a second goal for the hosts.\nTeenage talent Amelie Hingston showed good skill to pick up the ball in the middle of the park, step inside Magic's Jannali Hunter then score into the top left corner from outside the 18-yard box.\nDobson completed the demolition from the spot in stoppage time after Olympic fullback Danielle Nicol was felled in the box.\nAlso on Sunday night, Lambton Jaffas beat New Lambton 2-0 at Arthur Edden Oval to round out round one of the men's competition.\nA long ball found Riley Taylor deep in Golden Eagles territory. He outmuscled Caleb Reed then scored from a tight angle in the 10th minute.\nJapanese import Shusuke Kirihari made it 2-0 with a darting run in the 34th minute.",
  "word_count": 1246,
  "scraped_at": "2026-02-14T12:49:48.184596"
}