{
  "article_id": "f531a30cf343",
  "url": "https://www.opinionnigeria.com/2024-olympics-qualifier-toni-payne-and-19-other-players-hit-super-falcons-camp-ahead-cameroon-clash/",
  "title": "2024 Olympics Qualifier : Toni Payne and 19 other players hit Super Falcon camp ahead Cameroon clash – Opinion Nigeria",
  "date": "20240223T150000Z",
  "domain": "opinionnigeria.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Breaking News\n2024 Olympics Qualifier: Toni Payne and 19 other players hit Super Falcons’ camp ahead Cameroon clash\nCameroon, who edged Uganda 3-2 on aggregate in the second round, will be missing star player Ajara Njoya Nchout. Yet, it will be dangerous to underestimate what the Lionesses can come up with right in their own den.\nAhead of their 2024 Olympic Games qualification match against the Indomitable Lionesses on Friday (today), the Super Falcons have twenty players in their camp in Doula, Cameroon.\nOn Wednesday night, 19 players made the trip to Douala for the match.\nTo boost the number, versatile Sevilla of Spain player Toni Payne arrived the team’s camp on Thursday.\nPayne also participated in the team’s evening practice at the Stade de la Reunification in Douala, the venue of the game.\nUchenna Kanu is the only player being expected in camp as of the time of filing this report.\nThe match will kickoff at 6:00 p.m. Nigerian time.\nThe second leg will take place at Abuja’s Moshood Abiola Stadium on Monday.\nParis 2024: Super Falcons, Lionesses of Cameroon in fierce battle\nGiants of African women’s football, Nigeria and Cameroon will be taking no prisoners when they clash in Douala on Friday for a place in the final round of the African qualifying series for this year’s Women’s Olympic Football Tournament.\nThe Super Falcons, rated top in Africa and still walking with springs in their steps after reaching the Round of 16 at the FIFA Women’s World Cup in Down Under, exiting the finals without losing a match in regulation time, will remember at kick-off that the Indomitable Lionesses stopped their march to the London 2012 Olympics.\nOn their part, the Lionesses have grouses of their own, having been bumped by Nigeria in several major events including being denied the Women Africa Cup of Nations title in front of their fans in 2016, and being shoved out at the quarter-finals of the last Women AFCON tournament in Morocco.\nCoach Randy Waldrum has recalled fabulous defender Ashley Plumptre, now based in Saudi Arabia, and Halimatu Ayinde, Toni Payne and Christy Ucheibe will get to play together in the middle again after a stirring outing at the World Cup in Australia. There’s also the talented youngster Deborah Abiodun.\nNigeria’s goalkeeper Chiamaka Nnadozie is one of the most respected safe hands globally, and in forwards Asisat Oshoala, Rasheedat Ajibade, Uchenna Kanu, Gift Monday and Esther Okoronkwo, the Super Falcons boast one of the most stellar attacking ensemble in women’s football.\nCaptain Ajibade scored two of the five goals that eliminated Ethiopia in the second round of the qualifiers, with Oshoala also scoring, and Okoronkwo and Kanu were on fire as Cape Verde were put to the sword in the final round of qualifiers for this year’s Women AFCON championship.\nVeteran defender Osinachi Ohale is peerless on her day, and younger stallions Tosin Demehin and Rofiat Imuran have grown to become true fighters whenever the occasion called for such.\nCameroon, who edged Uganda 3-2 on aggregate in the second round, will be missing star player Ajara Njoya Nchout. Yet, it will be dangerous to underestimate what the Lionesses can come up with right in their own den.\nBoth teams will join the same flight to Nigeria’s administrative capital, Abuja for Monday’s return leg at the MKO Abiola National Stadium.\nSouth Africa’s Banyana Banyana will take on Tanzania the same weekend, with the winner over two legs to clash with the winner of Nigeria/Cameroon for one of the African tickets to Paris in July.\nTunisia clash with Morocco in an all-North African affair while Ghana host Zambia in Kumasi. Winners will face off for the second African ticket to Paris.",
  "word_count": 617,
  "scraped_at": "2026-02-14T12:07:45.415691"
}