{
  "article_id": "f55f979cb4d0",
  "url": "https://995qyk.com/2023/11/20/garth-brooks-on-rosalynn-carters-passing-a-light-has-gone/",
  "title": "Garth Brooks on Rosalynn Carter Passing :  A Light Has Gone  ",
  "date": "20231121T180000Z",
  "domain": "995qyk.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Garth Brooks on Rosalynn Carter’s Passing: ‘A Light Has Gone’\nGarth Brooks held a Nashville press conference at his new bar, “Friends In Low Places,” this morning (11/20), which will have what he calls a “soft open” on Friday, the…\nGarth Brooks held a Nashville press conference at his new bar, \"Friends In Low Places,\" this morning (11/20), which will have what he calls a \"soft open\" on Friday, the day after Thanksgiving, where he will perform.\nWe asked Garth his thoughts on the passing of former First Lady Rosalynn Carter, who passed away yesterday (11/19) at her home in Plains, Georgia, at the age of 96. According to a press statement from The Carter Center, she died peacefully, with family by her side, at her home in Georgia. She was surrounded by her family and husband, President Carter.\nBrooks and his wife, Trisha Yearwood, have spent a lot of time with the Carters in the last several years, helping the first couple build houses for Habitat for Humanity.\nGarth got emotional when he told us of the former First Lady, \"This is gonna be tough. President Carter calls Miss Yearwood his second favorite, Georgia Peach, so all I can think about, like everyone else in this room, is President Carter. You don't say one without the other.\"\nRELATED: Garth Brooks’ New Album ‘Completes The Circle’\nHe searched for the words, adding, \"It's tough. Miss Yearwood called her (Rosalynn) a quiet warrior. If you ever got to hang around her, President Carter always steals the show, and then when it comes time to hear her speak, she will walk to the mic, and you watch her; she won't say anything for a few seconds. That's how she was.\"\nBrooks continued, \"Then you just watch the crowd start to lean in, and then what she says is very quiet but yet very powerful. And what she taught Miss Yearwood and what she teaches us all: the lion doesn't have to roar, and your statement doesn't have to be more than a few words to get your point across. She was great at that, and everyone loved her for that.\"\nGarth noted, \"A light has gone out that shines on how we should treat each other, but if we all pick that light up, maybe that light can grow instead of disappear.\"\nMrs. Carter was married for 77 years to Jimmy Carter. Carter was the 39th president of the United States and the 2002 Nobel Peace Prize recipient. He is now 99 years old. Mrs. Carter championed mental health, caregiving, and women's rights.\nWe've had to say goodbye to some big names this year in the worlds of entertainment, sports, politics and beyond. To be frank, it was an absolutely brutal year.\nSo many giants in music died in 2023. Guitar god Jeff Beck died suddenly in January at age 78 after contracting bacterial meningitis. In February, legendary songwriter Burt Bacharach died at age 94. Singer, actor and civil rights icon Harry Belafonte died in April at age 96 from congestive heart failure. In May, the world lost Tina Turner – the Queen of Rock ‘n Roll – at age 83. Iconic pop singer Tony Bennett died in July at age 96.\nThe worlds of television and film were not immune to significant loss in 2023. Sitcom mastermind Norman Lear died in December at age 101. Three’s Company star Suzanne Somers died in October at age 76 from an aggressive form of breast cancer. Matthew Perry also died in October. The Friends star was only 54. Bob Barker, longtime host of The Price is Right, died in August at age 99. Paul Reubens, best known for his character Pee-wee Herman, died in July at age 70 following a private battle with cancer.\nThe sports world was rocked by the deaths of three major wrestling figures. In June, The Iron Sheik (Hossein Khosrow Ali Vaziri) died at age 81. Then, in August, there were two back-to-back deaths. First, WWE Hall of Famer Terry Funk died at age 79. Funk's hardcore style has been influential to generations of wrestlers that followed. Then, Bray Wyatt (Windham Rotunda) suddenly died at age 36. The young wrestler died after contracting COVID, which exacerbated a heart issue and led to a heart attack.\nScroll through the gallery below to see the musicians, celebrities and other cultural figures we've lost in 2023.\nHarry Belafonte\nLegendary singer/actor who was also an integral figure in the civil rights movement.\nTina Turner\nQueen of Rock & Roll. An icon, a legend and forever the moment.\nTony Bennet\nIconic pop singer whose career spanned eight decades.\nJeff Beck\nGuitar icon and two-time Rock & Roll Hall of Fame inductee as a solo artist and as a member of the Yardbirds. He is one of the most influential guitar players of all time.\nBurt Bacharach\nLegendary songwriter who wrote hits for Dionne Warwick, Aretha Franklin, Jackie DeShannon, Tom Jones, Dusty Springfield and more. His hits included \"This Guy's in Love with You,\" \"Raindrops Keep Fallin' on My Head,\" and \"(They Long to Be) Close to You.\"\nDavid Crosby\nSinger-songwriter best known for his work with the Byrds and Crosby, Stills & Nash (& Young). He's a two-time Rock and Roll Hall of Famer. He also released a number of solo albums in the years leading up to his passing.\nSuzanne Somers\nSuzanne Somers shot to fame as Chrissy Snow on the '70s sitcom 'Three's Company.' She would reach pop culture icon status thanks to the Thigh Master.\nNorman Lear\nNorman Lear was the creator of some of the most iconic and influential sitcoms of all time. Lear's impact on television is immense. He created/developed over 100 shows in his career. Among them were 'All in the Family,' 'Sanford and Son,' 'Maude,' 'Good Times,' 'The Jeffersons,' 'One Day at a Time' and 'Mary Hartman, Mary Hartman.'\nSeymour Stein\nIconic record executive who co-founded Sire Records and the Rock & Roll Hall of Fame.\nCindy Williams\nActress best known for playing Shirley Feeney in the 1970s sitcom 'Laverne & Shirley.' The show was a spinoff from 'Happy Days.'\nJimmy Buffett\nJimmy Buffett was a legendary singer/songwriter. His massive hit, \"Margaritaville,\" helped inspire his brand, which is worth billions.\nJim Brown\nJim Brown was a legendary NFL fullback, actor and civil rights activist. His reputation would be impacted following accusations of abuse towards women.\nLisa Marie Presley\nSinger/songwriter and only child Elvis and Priscilla Presley. Her debut album, 'To Whom It May Concern,' was released in 2003.\nMatthew Perry\nMatthew Perry was best known for playing Chandler Bing for ten seasons on 'Friends.' During the show's run, Perry received one Primetime Emmy Award nomination in 2002 for Outstanding Lead Actor in a Comedy Series.\nSandra Day O’Connor\nSandra Day O’Connor was the first woman to serve on the United States Supreme Court. She sat on the bench from 1981-2006.\nBob Barker\nBob Barker was the longtime, legendary host of 'The Price is Right.' Before that show, Barker hosted 'Truth or Consequences' from 1956 to 1972.\nAndre Braugher\nAndre Braugher was best known for his roles on 'Brooklyn Nine-Nine' and 'Homicide: Life On The Street.' His breakout role was in 1989's Academy Award-winning film 'Glory.'\nPaul Reubens\nPaul Reubens was best known for his character Pee-wee Herman. The character was the star of three films and the Emmy Award winning children's series 'Pee-wee's Playhouse.'\nRichard Roundtree\nRichard Roundtree was a legendary actor that rose to fame during the era of blaxploitation movies. He's best known for playing the iconic character Shaft.\nRosalynn Carter\nRosalynn Carter was a former First Lady of the United States. She was married to former President Jimmy Carter for 77 years. Mrs. Carter also championed mental health, caregiving, and women’s rights.\nSen. Dianne Feinstein\nDianne Feinstein was a legendary politician who served as in the United States Senate for over 30 years. She also served as mayor of San Francisco.\nJerry Springer\nFormer politician turned notorious talk show host of 'The Jerry Springer Show.'\nLance Reddick\nActor best known for his roles on HBO's 'The Wire' and the 'John Wick' movie franchise.\nSinéad O'Connor\nAcclaimed Irish singer best known for her moving cover of \"Nothing Compares 2 U\" and who was chastised for telling the truth about the Catholic Church.\nDick Butkus\nDick Butkus was a Chicago Bears legend and a member of the Pro Football Hall of Fame. Butkus began acting toward the end of his football career and during his retirement.\nRichard Belzer\nRenowned stand-up comedian and actor best known for playing Det. John Munch on 'Homicide: Life on the Street' and 'Law & Order: SVU.'\nAlan Arkin\nAcclaimed Academy Award-winning actor.\nBobby Knight\nBobby Knight was a the legendary college basketball coach for Indiana University. He was inducted into the Basketball Hall of Fame in 1991.\nThe Iron Sheik\nLegendary wrestler. Currently making the afterlife humble.\nGary Rossington\nGuitarist and last surviving original member of Lynyrd Skynyrd.\nRobbie Bachman and Tim Bachman\nCo-founding member/drummer and co-founding member/guitarist and vocalist for Bachman-Turner Overdrive both passed away this year. BTO's hits included \"Let It Ride,\" \"Takin' Care Of Business\" and \"You Ain't Seen Nothing Yet.\"\nBray Wyatt (Windham Rotunda)\nBray Wyatt was a WWE wrestler portrayed by Windham Rotunda. He is considered one of the most unique WWE characters in its storied history.\nRobbie Robertson\nRobbie Robertson was best known for being the guitarist, vocalist and songwriter for The Band. Robertson went on to have a decades-long partnership with Martin Scorsese. He composed or produced music and served as executive music producer for a number of Scorsese's films.\nRaquel Welch\nActress and iconic sex symbol of the 1960s. She won a Golden Globe Award for Best Motion Picture Actress in a Musical or Comedy in 1974 for her performance in 'The Three Musketeers.'\nGina Lollobrigida\nActress, photojournalist and politician. She was a sex symbol during the \"Golden Age Of Hollywood.\"\nSteve Harwell\nSteve Harwell was the singer for Smash Mouth from 1994-2021. Smash Mouth is best known for their hits \"All Star,\" \"Walkin' On The Sun\" and their cover of the Monkees' \"I'm A Believer.\"\nClarence Avant\nClarence Avant was a legendary record executive and influencer in the world of politics and sports. He was dubbed \"The Black Godfather.\"\nBarry Humphries (aka: Dame Edna)\nAustralian actor best known as the personality of Dame Edna Everage.\nBurt Young\nBurt Young was a veteran actor known for playing \"tough guy\" roles. He was best known for playing Paulie in the 'Rocky' film franchise.\nHenry Kissinger\nHenry Kissinger was one of the most powerful, influential and controversial political figures in modern history. He served as Secretary of State for President Richard Nixon and President Gerald Ford.\nJeremiah Green, drummer for Modest Mouse\nGreen was the drummer for Modest Mouse. He was a founding member of the group. He left in 2003, but returned shortly after.\nLola Mitchell\nGangsta Boo of Three 6 Mafia. Starting her career at age 14, she became a popular collaborator. She has worked with a number of artists, including Eminem and OutKast.\nAnita Pointer\nFounding member of the Pointer Sisters. She was also the lead singer on many of their other hits, including \"Yes We Can Can\", \"Fire\", \"Slow Hand\", and \"I'm So Excited.\"\nHenry Grossman\nIn February 1964, he photographed the Beatles' immortal performance on 'The Ed Sullivan Show.' He was also a staff photographer for LIFE magazine.\nArt McNally\n“Father of Instant Replay” in the NFL. In 2022, McNally became the first NFL game official to be enshrined into the Pro Football Hall of Fame.\nAdam Rich\nChild star on ‘Eight Is Enough.' He was often referred to as \"America's Little Brother\" at the time. He also guested on other shows including 'The Six-Million Dollar Man' and 'CHIPS.'\nCarl Hahn, former head of Volkswagen that helped popularize the VW Beetle\nFormer head of Volkswagen. The company helped popularize the VW Beetle.\nDavid Jude Jolicoeur (Trugoy the Dove)\nOne-third of the influential hip-hop group De La Soul. They reissued their incredibly influential catalog months after his passing.\nKyle Jacobs\nSongwriter and husband of country singer Kellie Pickler.\nCharles Kimbrough\nActor of stage, screen and television. Best known for playing Jim Dial on the hit CBS sitcom 'Murphy Brown.'\nBob Born\nConfectioner best known for inventing Peeps.\nBobby Hull\nHockey Hall of Famer best known for his 15 seasons with the Chicago Blackhawks. Known as \"The Golden Jet,\" he is regarded as one of the greatest hockey players of all time.\nLloyd Morrisett\nCo-creator of 'Sesame Street'\nJerry Blavat\nIconic Philadelphia DJ, \"The Geator with the Heater\" and \"The Big Boss with the Hot Sauce.\"\nTom Verlaine\nSongwriter and guitarist from influential punk band Television.\nLisa Loring\nActress best known for playing Wednesday Addams on ABC's 'The Addams Family' from 1964-1966.\nCody Longo\nActor and singer/songwriter best known for his roles on 'Hollywood Heights' and 'Days of Our Lives.'\nTim McCarver\nMLB All-Star and two-time World Series Champion that went on to be a Hall of Fame broadcaster.\nSal Piro\nNoted superfan of 'The Rocky Horror Picture Show.'\nWayne Swinny\nFounding member and guitarist for Saliva.\nKeith Reid (L)\nProcol Harum lyricist. Notably wrote the lyrics to \"A Whiter Shade of Pale.\"\nNora Forster\nMusic promoter, wife of John Lydon (Sex Pistols' Johnny Rotten) and mother to Arianna Forster (Ari Up from The Slits.)\nMichael Lerner\nIconic character actor best known for his roles in the films 'Barton Fink,' 'Elf' and 'Newsies.'\nLynette Hardaway (L)\n\"Diamond\" of conservative media personalities \"Diamond and Silk.\" They were frequent contributors to conservative news outlet Newsmax.\nMary Quant\nFamed British designer known as \"The Mother of the Miniskirt.\"\nBlair Tindall\nAuthor of the 2005 memoir 'Mozart in the Jungle: Sex, Drugs, and Classic Music,' which was later adapted into an award-winning series for Amazon.\nLen Goodman\nRenown British dance champion who was a longtime judge on ABC's 'Dancing With the Stars.'\nAndy Rouke\nBassist of The Smiths.\nGordon Lightfoot\nLegendary Canadian singer-songwriter/folk icon.\nPete Brown\nLyricist for legendary rock band Cream.\nRay Stevenson\nActor best known for roles in “Punisher: War Zone,” “King Arthur” and the “Thor” films.\nRandy Meisner\nFounding member of the legendary band, Eagles.\nJane Birkin\nRenown actress and inspiration behind the iconic Hermès Birkin bag.\nNikki McCray-Penson\nLegendary basketball star. Two-time Olympic gold medalist, three-time WNBA All-Star.\nBernie Marsden\nBernie Marsden was the guitarist for Whitesnake from 1978-1982. During his time in the band, Marsden and David Coverdale wrote Whitesnake's biggest hit, \"Here I Go Again,\" which was originally released on their 1982 album 'Saints & Sinners.' However, the track took off when it was re-recorded for the band's self-titled 1987 album.\nGary Wright\nGary Wright was the former keyboardist/singer of Spooky Tooth and a solo artist. He was best known for his solo hit \"Dream Weaver.\"\nMichael Gambon\nMichael Gambon was an acclaimed actor of TV and film. He is best known for playing Albus Dumbledore in the 'Harry Potter' film series.\nRudolph Isley\nRudolph Isley was a founding member of The Isley Brothers. The iconic ground was best known for their hits \"Shout,\" \"This Old Heart of Mine,\" \"Twist & Shout,\" \"It's Your Thing,\" and more.\nShane MacGowan\nShane MacGowan was the singer/songwriter/founder of The Pogues. He fronted The Pogues from 1982-1991. MacGowan and The Pogues would reform from 2001 to 2014.\nDenny Laine\nDenny Laine was a co-founder of the Moody Blues and Wings. Laine was inducted into the Rock & Roll Hall of Fame in 2018 as a member of the Moody Blues. Laine also played on all seven studio albums from Wings, which was also co-founded by Paul McCartney in 1971 following the breakup of the Beatles.\nRyan O'Neal\nRyan O'Neal was best known for his roles in 1970's 'Love Story' and 1973's 'Paper Moon.' O'Neal's breakout performance came as Rodney Harrington on the '60s TV series 'Peyton Place.'\nAngus Cloud\nAngus Clous was best known for portraying Fezco on 'Euphoria.' He was only 25 years old.\nMark Margolis\nMark Margolis was a veteran character actor. He was best known for roles in 'Breaking Bad,' 'Scarface,' 'Ace Ventura: Pet Detective' and more.\nRodriguez\nRodriguez was a working musician based in Detroit. He was the subject of the Academy Award-winning documentary 'Searching for Sugar Man.'\nPiper Laurie\nPiper Laurie was an Emmy Award-winning and Oscar nominated actress. Some of her most notable credits include 1961's 'The Hustler,' 1976's 'Carrie' and 1986's 'Children of a Lesser God.'\nRichard Moll\nRichard Moll had an acting career that spanned four decades. However, he was best known for playing bailiff Bull Shannon on NBC's 'Night Court.'\nTyler Christopher\nTyler Christopher was best known for portraying Nikolas Cassadine on 'General Hospital.' He won a Daytime Emmy Award for his performance in 2016.\nMarty Krofft\nMarty Krofft, along with his brother Sid, created a number of popular children's/variety shows of the 1970s. Among them were 'H.R. Pufnstuf,' 'Land of the Lost' and 'Donny and Marie.'",
  "word_count": 2831,
  "scraped_at": "2026-02-14T14:09:16.662239"
}