{
  "article_id": "f56ce713394d",
  "url": "https://www.atlanticcouncil.org/news/transcripts/full-transcript-the-2025-atlantic-council-global-citizen-awards-recognize-three-of-the-worlds-most-influential-leaders/",
  "title": "Full transcript : The 2025 Atlantic Council Global Citizen Awards recognize three of the world most influential leaders",
  "date": "20250925T074500Z",
  "domain": "atlanticcouncil.org",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Watch the event\nEvent transcript\nUncorrected transcript: Check against delivery\nJOHN F.W. ROGERS: Good evening, your excellencies, ladies and gentlemen.\nWe assemble here tonight during the United Nations General Assembly to reinforce the Atlantic Council’s commitment to advancing constructive leadership across the global stage and to working towards a future we can shape together. Here at our annual Global Citizens Dinner, we recognize a rare few who have shown themselves to be among the world’ most influential leaders, who have taken up the call to serve a purpose greater than oneself and who represent the very best of the Atlantic Council’s mission and traditions.\nToday, we stand at a critical juncture in history. The post-Cold War world order, which for decades provided a framework for international cooperation and stability, is now unraveling before our eyes. And we can no longer ignore the stark reality that the geopolitical landscape is shifting beneath our feet, and with it the very principles that have underpinned global governance since the late twentieth century. The triumph of liberal democracy, long heralded as the ultimate victor in the ideological struggle of the Second World War and the Cold War, is under immense threat. Authoritarian regimes are on the rise, leveraging new technologies and innovations to strengthen their grip on power and undermine democratic values.\nWe see this every day as nations grapple for the influence in a world increasingly defined by competition, not cooperation. As members of the Atlantic Council, we have the privilege and the responsibility to recognize these signs and to adapt our strategies to meet the emerging challenges of our time. The digital revolution has unlocked unprecedented possibilities for communication, for innovation, and for collaboration. Yet, it has also empowered adversarial nations to manipulate information, surveil their populations, and conduct cyberwarfare with alarming efficacy.\nIn the hands of authoritarian leaders these technologies are tools of oppression rather than instruments of progress. If we do not act swiftly and decisively to strengthen the alliance of democracies, we risk surrendering our future to regimes that prioritize control over liberty, subjugation over empowerment. We cannot afford complacency as we witness the erosion of democratic norms around the globe. The fight for our values, for the rights and the freedoms that we hold dear, is more urgent than ever. And to forge a new framework, we must first acknowledge what is at stake. We must articulate a vision of the world that enables democracies to thrive in this new era.\n“We cannot afford complacency as we witness the erosion of democratic norms around the globe,” says John F.W. Rogers at #GCA2025.\n— Atlantic Council (@AtlanticCouncil) September 24, 2025\n“The fight for our values, for the rights and the freedoms that we hold dear is more urgent than ever,” he adds. #ACAwards pic.twitter.com/0hr8JPmvvx\nIt is incumbent on us to foster an environment where innovation and technological advancement serve the greater good, promoting democratic governance and protecting individual rights. We must embrace collaboration, not only among ourselves in the Atlantic community, but also with like-minded partners across the globe. Building coalitions that leverage our collective strengths will be essential in countering the rising tide of authoritarianism. And this means sharing best practices, investing in shared technologies, standing united against those who seek to exploit innovation for nefarious purposes.\nAnd through our work at the Atlantic Council and beyond, we can create forums for dialogue, establish frameworks for responsible technological use, and ensure that our democratic institutions are robust enough to survive and thrive in the face of these emerging threats. And we must develop adaptive policies that anticipate the challenges and respond with agility, lest we become victims of our own complacency. With so much at stake for people seeking prosperity, for cultures and countries everywhere seeking peace, the Atlantic Council is more committed than ever, in collaboration with our allies and partners, to meet the moment and help chart a path forward amidst the current environment of charged, polarizing politics.\nAnd it’s worth restating that we continue to operate and conduct ourselves solely as an independent thought leader and policy advocate for America and its partners. As a nonpartisan organization, the Atlantic Council has never been shy about advocating for democratic values, principles, and ideals. Our fundamental goal has been to equip government, policymakers, decision-makers, civil society leaders with the insights and the analysis necessary to make the informed decisions possible on an increasingly complicated global scale.\nWhich is to say, while we are nonpartisan, we are not neutral. We believe in a strong national defense, strong alliances, respect for individual rights, free and fair market economies, and the rule of law. Our work reflects the nuance and multifaceted nature of the issues we analyze and provide viewpoints on each day. And that mission is greatly enriched by the leaders that we celebrate tonight.\nIt has been said that the price of greatness is responsibility. It is now my privilege to announce the Global Citizens Award to three honorees who exemplify this dedication to duty and whose character and contributions have transcended the obligations of their own circumstances.\nThe first—a student of the piano, of theater, and philosophy—he would find early success in business before launching a career in public service and a new political movement that would propel his ascension to the youngest-ever president of France.\nThe next—call it football or soccer—either way, he’s crazy about the game, and his passion and his vision would take him to the top of FIFA, putting him in a position to reshape the world’s most popular sport, balancing expansion, commercialization, and global outreach—but most importantly, building bridges through sport, ensuring football remains a powerful force of unity and understanding around the globe.\nAnd finally, a professor, rock-and-roll frontman, an undeniable dog-lover—his bold, dynamic personality and his single-minded resolve would lead him to become one of the most unconventional and transformative leaders in Argentina’s history, if not Latin America more broadly.\nLadies and gentlemen, please join me in a round of applause for the 2025 Global Citizens.\nPresident Infantino, I was just thinking about it, that here you are, and Argentina and France are here. We could have a wonderful night.\nLet me conclude, ladies and gentlemen, by expressing our appreciation to this evening’s co-chairs, the Atlantic Council’s board of directors, our international advisory board, and for all their friends and partners, for their important and their unwavering support. In solidarity we stand proven and ready to confront these challenges together. Thank you.\nAnd now it’s my pleasure to ask you to turn your attention to the screen to start our process of our first honoree.\nANNOUNCER: Please welcome seven-time Super Bowl champion, entrepreneur, and philanthropist, Tom Brady.\nTOM BRADY: That’s a long walk. Good evening to everyone. It’s very special to be with you all this evening and, obviously, a privilege to be here with the Atlantic Council for the Global Citizen Awards.\nFirst, I want to wish congratulations to President Emmanuel Macron and President Javier Milei. You are both very inspiring leaders. Your day jobs are managing economies, protecting your nations, and responding to crises.\nOur next honoree manages something even more dangerous, the opinions of every football fan on Earth. I spent twenty-three years in the NFL where I kicked a ball three times. Yeah, three times. So, of course, they asked me to introduce the president of FIFA Gianni Infantino.\nI’ll keep this brief. If I need some extra time FIFA told me they’ll talk to the refs who will pick a random number of minutes and add it to my stoppage time.\n“I’ll keep this brief. If I need some extra time, FIFA told me they’ll talk to the refs, who will pick a random number of minutes and add it to my stoppage time.”@NFL quarterback @TomBrady introduces #GCA2025 honoree @FIFACom President Gianni Infantino.\n— Atlantic Council (@AtlanticCouncil) September 25, 2025\nWatch live:➡️… pic.twitter.com/K6g9gEwHJb\nI played a game that brought communities together every Sunday. I’ve seen a stadium full of strangers become family by the fourth quarter. Sports do that. They break barriers. They build connections. They give us a common language even when we don’t share one.\nIn my sport you get flagged for a false start. In Gianni’s world, you might see a yellow card for a late tackle. Different penalties but the same lesson—discipline, respect, and the team first.\nUnder Gianni’s leadership football has reached farther and welcomed more people in. He’s championed inclusion and access, making sure the beautiful game belongs to everyone from new fans to diehards. You know, the guy with the drum at every match. There’s always the guy with the drum.\nIt’s truly inclusive. I mean, maybe a little too inclusive letting Rob McElhenney and Ryan Reynolds own a club. I’m kidding. Kind of.\nHe supercharged the women’s game, inspiring a new generation, and he reminds us football is more than a score. It can be a force for peace, for dialogue, for development, for global citizenship.\nThe values I love most are simple: preparation, teamwork, and belief. When everyone is pulling in the same direction great things can happen. That’s what Gianni has pushed for from local pitches to the biggest stages.\nFor his extraordinary contribution to the sport and for bringing the world together through football, it is my honor to present the Atlantic Council Global Citizen Award to my friend Gianni Infantino.\nGIANNI INFANTINO: Wow. Can we clap hands once more for the legend Tom Brady?\nThank you so much, my friends, for your kind words. Wow, what an emotion.\nDear chairman, dear president of the Atlantic Council, dear presidents, excellencies, distinguished guests, ladies, gentlemen, dear friends, what an emotion it is and what an honor it is to be here with you tonight to receive this—where did I put it? Ah, I gave it over there. You’ll get it back to me after, right? To take this incredible award, and after having heard from the number-one legend in the number-one sport in the United States of America, finally we can pass to the number-one sport in the world.\nFootball, or soccer—actually, are there Americans in the room here? Yeah? How many Americans there are here? Yeah, OK. I thought so. I thought so. So let’s clarify this once and for all, right? So stay with me. We, meaning all of us outside of this beautiful country, we call football, a game we play with our feet—that’s why we call it football, right? You, in this beautiful country, you call football a game you play with your hands. Now I don’t know who’s right or who’s wrong. It’s OK. But actually, you can call it soccer. You can call it football. The important is to enjoy, to have fun, to be happy. And this is exactly what this is about.\nOur game, football, is about joy, about happiness, about smile, about passion, about emotion. But of course, also about discipline, about respect, about team spirit, about resilience. These are all positive values that children learn when they grow up playing football, playing the game. You learn to win as a team. But you learn as well to lose. And when you lose a match, you know that the next match is coming very soon. And you are going to win that next match. And this is a lesson for your life. And this is why football is such a great sport.\nAnd football as well unites the world. And we will unite the world, dear friends, next year here in North America—Mexico, Canada, the United States. We will organize the FIFA World Cup. You see this beautiful trophy here? Isn’t it incredible? Didn’t we have a bowl actually, as well somewhere? I’m asking my team. Ah, you see? Let’s put it here, OK? Canada, Mexico, United States of America, FIFA World Cup. Here is the trophy—the most iconic trophy in sport—bringing the world together. We will welcome the world. And we will unite the world in North America next year, from the 11th of June until the 19th of July.\nThe 19th of July, the final will be here in New York/New Jersey. And in between, we’ll have three countries, sixteen host cities—three in Mexico, two in Canada, and eleven in the US. We will have forty-eight countries competing. And they will play 104 matches. Actually, Tom, 104 Super Bowls in one month. Imagine that. Because we’ll have seven million people in the stadiums. We’ll have six billion people watching from home. We have millions more coming here to celebrate and to unite together in something which will be not just the biggest sporting event, but the biggest social event the world has ever seen.\nAnd God knows, if we need today to have occasions to unite the world, to bring everyone together, to bring people together so that they can meet, they can exchange, they can know each other, and they can learn all from each other. This is what the FIFA World Cup is about. And this is what this is about. This is football. Look at this. You see how they smile? Look at how they smile. They’re having a—they were having a serious face earlier. They receive a ball, and they smile. This is the magic of football. This is not just—can I take it back? Oh, she said, I give it back to you after. This is not just an instrument to play sport. This is a magic object that transforms the face of children in happy children, in smiley children.\nWe always have to forget that. We forget to be happy. We forget to smile. We forget to enjoy. This is what this sport is about. It’s about unity, togetherness. We tried. And we did unite the world already this summer in the United States of America. We organized, maybe you heard about it, a new competition, the FIFA Club World Cup. The final was here in New York/New Jersey, MetLife Stadium, full stadium. Chelsea from England against Paris Saint-Germain from France. A great final. But on the pitch there were players from sixteen different countries from five different continents. And in the stands, we had fans from over 160 countries who came to watch this great competition.\nThis is what football is about. And football unites the world. FIFA, you must know, has 211 member associations, member countries. More than the United Nations—211. Imagine that. And they all share the same passion. They all share the same love. They all share the same enthusiasm for this ball, for this game, for coming together. And FIFA is an organization that invests 100 percent of its revenues in developing the game all over the world, in giving dreams and hopes to children, to girls, to boys, in 211 countries in the world. Because that’s what they need. They need dreams and they need hope. And that’s why we are here. And that’s why we are proud to be here. And that’s why I’m proud to stand here in front of you today to take this incredibly prestigious award. Not for me, for the six billion people around the world who love this incredible and beautiful sport.\nAnd let me conclude with a plea. I’m a simple football person. In this room tonight, we have many world leaders in politics, in the economy. Let me, by the way, congratulate President Macron and President Milei. Félicitations ma chère, Emmanuel. Muchas felicidades Gerardo Javier. France, Argentina—by the way, as it was mentioned earlier, the last final of the World Cup—the last two world champions as well, France in 2018 and Argentina in 2022. Congratulations to both of you. Many world leaders are here. Many leaders in business. And that’s why my plea, and the plea coming from everyone who loves football all over the world, is actually very simple.\nWe all know that we live, sadly, in a divided world, in an aggressive world, in a complicated world. And like all of you, I suffer when I see children suffer. I cry when I see mothers crying, whether it’s in Gaza, in Ukraine, in Sudan, in Libya, anywhere in the world. There are eighty countries where there are conflicts. And we all suffer when we see what is happening. But like many of you as well, I believe that human beings are fundamentally good, and not fundamentally bad. And we have to believe in us. And, dear leaders, we believe in you. We need peace in the world. How can we get it? Well, if I knew it, I would have done it long time ago. I don’t know.\n“I cry when I see mothers crying, whether it’s in Gaza, in Ukraine, in Sudan, in Libya, or anywhere in the world,” says @FIFACom President Gianni Infantino at #GCA2025.\n— Atlantic Council (@AtlanticCouncil) September 25, 2025\n“We need peace in the world,” he adds. #ACAwards pic.twitter.com/EEBUpIuGec\nBut the secret, probably, like for anything else in life, is to believe in it and to work for it. So let’s just work more. Let’s just bring people together more. Let’s just create occasions for people to get to meet each other and know each other a little bit more. We want you to succeed. We want the world to succeed. We want to unite the world. And we want peace. Thank you very much for the great honor. I love you all. World Cup next year. Thank you.\nANNOUNCER: Please welcome Chair of the Atlantic Council Global Citizen Awards Victor L.L. Chu.\nVICTOR L.L. CHU: Your excellencies, ladies and gentlemen, and friends and members of the Atlantic Council community, when I co-founded this event in 2010 with Fred Kempe I don’t think we ever expected that this event has grown into the signature event during the UNGA evening week.\nSo thank you very much for all of you for your support. Many of you have been with us all through in the last thirteen years, fourteen years, and you’ll remember that our first awardee was Professor Klaus Schwab. Unfortunately, Klaus cannot be here with us tonight. He called me yesterday to ask me to convey his best wishes and regards to all his friends in the Atlantic Council.\nBut I’m delighted that the WEF is well represented tonight, not least by our co-chairman Larry Fink and many others. So I hope we still will cement a very close collaboration between the WEF and the Atlantic Council in the many years to come.\nLast year we talked about the impact of technology and how that may impact on humanity and society. This week in New York apart from football the most popular topic is AI. I think we have to assume that we need to embrace totally on AI so that AI can serve society and humanity.\nBut AI must also embrace global citizenship. Without the right guardrails, the right rules and ethics, AI could be an enemy to society. So I hope AI and global citizenship can go hand in hand in the future.\nWhat you have heard from Chairman John Rogers earlier means that in a fractured world that we live in the Atlantic Council plays an ever more important role in bridging the East-West-North-South and different layers of stakeholders and Global Citizen Awards is one of the platforms that we use to bring people together.\nAnd tonight with President Gianni being the first to speak it really resonates the essence of global citizenship. President Gianni represents leadership, passion, courage, but also promoting World Cup means that we are promoting unity, hope, and inclusion. So, for that, I thank the president and I wish that all of us will support him in a unique World Cup 2026 next year.\nApart from sports, the Atlantic Council also promotes culture as a means of uniting different stakeholders together and we are very fortunate this evening. I just saw immediately at the table in front of me three of the greatest cultural icons are with us tonight and I’d like to recognize Jeff Koons, Nile Rodgers, and Yusi Khan who are with us. So thank you.\nIf I could conclude by borrowing Nile Rodgers. We are family and in football, as we say at Liverpool, you never walk alone. We are together and we have to try better to reach out to different stakeholders.\nThank you very much indeed.\nANNOUNCER: Please welcome the United States treasury secretary, the Honorable Scott Bessent.\nSECRETARY SCOTT BESSENT: It’s an honor to be able to assist the public of Argentina, which is transformative. So with that, I will say I hope the teleprompters are working better here than at the UN. I took the stairs so there were no escalator incidents. But seriously, just a few years ago, Argentina’s economy was in shambles. Decades of mismanagement had led to runaway inflation, high unemployment, debt defaults, and irresponsible money printing. When pressed by the people, the government’s solution to each of these problems was always mas. Mas. More spending, more social programs, more bureaucracy, But as the government did more, the people had less.\nOne man recognized government was not the solution. It was the problem. One man had the courage to stand up for Argentina by standing against the establishment. And that man stands with us this evening. Tonight we recognize President Javier Milei for his tireless efforts to make Argentina great again. President Milei has transformed Argentina for the better. In a place of corrupt, budget-busting bureaucracy, the Milei administration has built a lean, efficient government that looks to safeguard the property, liberty, and free enterprise of its people. As President Milei noted last week, financial equilibrium is a cornerstone of growth. To that end, President Milei has presented a plan to achieve a fiscal surplus for the third year in a row.\n“President Milei has transformed Argentina for the better,” building a “lean, efficient government that looks to safeguard the property, liberty, and free enterprise of its people.”@SecScottBessent introduces #GCA2025 honoree President of Argentina @JMilei.\n— Atlantic Council (@AtlanticCouncil) September 25, 2025\nWatch:➡️… pic.twitter.com/kQo158gf42\nThanks to the president—thanks to President Milei’s visionary leadership, the world is starting to see Argentina with fresh eyes. Of course, this process of transformation has not been without opposition. Generational reform is painful. And that pain invites derision from those who have been voted out of power. Hence, the course of criticism from incumbents of the old system. But President Milei has stayed the course and remains committed to his core principles. Like President Trump, he has empowered the Argentinian people by making sure the government serves them, not the other way around—not the other way around.\nThere is a knock-on effect from President Milei’s governing philosophy. It has galvanized reforms not only in Argentina, but in other Latin American countries as well. President Milei is a leader of a great nation, but also a continent. He has inspired Argentina’s youth to question the stale proposition that the heavy hand of government is the path to prosperity. In doing so, he has ignited faith in free markets and laid the foundation for a new golden age in Argentina. In recognition of these monumental achievements, I am pleased to present the Atlantic Council’s Global Citizen Award to President Javier Milei.\nPRESIDENT JAVIER MILEI: Hello, everybody. And I am delighted. But I will speak in Spanish.\n(Continues through interpreter.) Good evening, everyone. It is a pleasure to be back in the United States to have the honor to receive this award from none other than the secretary of treasury, Scott Bessent, whom I consider a friend of the Argentine Republic. Thank you very much, Mr. Secretary, thanks to the Atlantic Council for this honorable distinction, and thanks to all of those present here today.\nI wish to thank President Donald Trump and Secretary Bessent especially for having given their strong endorsement to Argentina in a time of uncertainty. This is a historic landmark in the relationship of friendship and strategic partnership between our two nations that will surely bring mutual benefits for both, as well as for the whole American continent.\nWhen we took office in December 2023, we found a patient in critical condition. The Argentine Republic was on the brink of the worst crisis in its history, with the social indicators in the red and standing upon the cusp of yet another bout of hyperinflation due to the systematic plunder of the central bank.\nFrom the very first moment, it was clear to us that we needed to take drastic measures to avoid falling over the cliff. Therefore, in the first month alone we carried out an adjustment to reduce five GDP points of fiscal deficit and another 10 GDP points of quasi-fiscal deficit. We strictly upheld this trend, and today Argentina has a sustained fiscal surplus for the first time in 123 years without being in default of its debts. Actually, we are one of the five countries in the world to hold that title, and we are committed to defending it against the attacks of politicians who are bent on bringing it down.\nWe have also gotten rid of the currency controls, and we are gradually achieving full normalization of our economy. And this last achievement we made in an election year against all odds and contrary to all manuals on political orthodoxy.\nHowever, everything we have done is but the foundation of the country we want. We know this has been a difficult time for the Argentine people, and their effort and commitment to get the country off the ground reaffirms every day our determination. Like in every process to clean up public accounts, we have to take measures that may seem unpleasant but which are fundamental in order to put the country back on the path of growth.\nWe decided to tell the truth. We offered our people to change for good and stop insisting on the same recipes that have led us to failure. Displaying a great deal of courage, effort, and patience, the Argentine people are supporting us, convinced that this time will be different precisely because nothing that we’re doing now has been tried before in our country in the last century.\nWe know we are on the right track. We’re applying ideas that have made other countries prosperous and that triggered our own golden age in the early twentieth century, because, indeed, what has made prosperous nations prosper is doing the right thing no matter how uncomfortable it may be instead of doing what is comfortable and easy.\n“What has made prosperous nations prosper is doing the right thing no matter how uncomfortable it may be, instead of doing what is comfortable and easy,” says President of Argentina @JMilei at #GCA2025.\n— Atlantic Council (@AtlanticCouncil) September 25, 2025\nWatch live: ➡️ https://t.co/fZHy8eenmc #ACAwards pic.twitter.com/ImOyROfg3R\nThis is something my friend Donald Trump knows better than anyone. And that is why he is driving forward the measures he’s implemented to make America great again, which is why his administration serves as a great inspiration for ours.\nBut in the case of Argentina, we also know that this is only just beginning. Now is the time to build on the foundations we have laid. It is the time to stay the course and to carry out the remaining reforms to grow once and for all. We’re facing a political opposition that wants none of this to happen. This is why they want to take advantage of the time they have left before the renewal of congressional seats to cause as much damage as they can. That is why the upcoming congressional elections in Argentina are key. Those who benefited from the previous regime see their chances to come back to power dwindle every day. And they will do whatever they can to spoil our chances of victory. They know the moment to destroy us is now, as soon Argentina will begin to grow for good.\nThat is why we will not stop fighting for the ideas of freedom with unwavering conviction and the goal of making Argentina great again. And we know we share this fight with you, and that you are doing what is necessary to make America great again. We have always witnessed a short while ago, with the cowardly assassination of Charlie Kirk, the violence with which left is fighting this process. They are willing to do anything to impose their criminal ideas. And since Charlie beat them in debate saying the truth, they resorted to force. That is why today, more than ever, we need to face them with the same courage and determination your administration is showing. We cannot stop because we know they won’t. They will not stop until they’ve managed to destroy us completely. Thank you very much, everyone. Thank you. Thank you.\n[Dinner break]\nANNOUNCER: Please welcome the president and chief executive officer of the Atlantic Council, Fred Kempe.\nFREDERICK KEMPE: So, everybody, it’s UN week. We’ve got heads of state with really difficult schedules. We’ve got streets with gridlock that the heads of state need to get through. And we’ve got the most amazing global community anywhere in town tonight at the Ziegfeld Ballroom. Thank you for being here, and give yourselves a big round of applause.\nAnd thanks for your understanding. We don’t—we don’t usually serve dinner while we’re continuing with the program. But out of respect for our heads of state and respect for our honorees, thank you for going with the flow, which we all do this week in New York.\nI joined the Atlantic Council in January 2007 as president and CEO. You may remember more that that year Tom Brady, in his seventh season with the New England Patriots, set the National Football League record at the time with fifty touchdown passes. Yeah, that’s right. And you probably noticed—you probably noticed that neither one of us has aged since then either.\nSo, fast forward eighteen years. Never in my wildest imagination could I have thought that we would be sharing an Atlantic Council stage tonight with the GOAT, the greatest of all time in American football—or as Johnny Infantino would put it, American handball—honoring the leader of global football ahead of the 2026 World Cup, FIFA President Gianni Infantino. A big round of applause with our awardee, Giann Infantino. And President Milei and Secretary Bessent, what a wonderful and moving portion of our program as well. So congratulations to you as well.\nWe meet here at what we, at the Atlantic Council, call the fourth great inflection point of the last century. And listen to this, because I think sometimes we don’t understand how high the stakes are right now. And they also didn’t know it at these inflection points. The first came after World War I, the second after World War II, the third after the Cold War, and the fourth is now. Hopefully, after the successful end to Russia’s illegal, unprovoked war in Ukraine, with a sovereign, secure, independent, and democratic Ukraine.\nAs President Trump said this week after meeting with President Zelenskyy, Ukraine is in a position to fight and win. After World War I, we failed in our efforts to create a freer, more prosperous, and more secure, and more democratic world, with the failure of Versailles, the League of Nations—the failure of the League of Nations, and ultimately the rise of fascism, the outbreak of World War II, the Holocaust, and millions upon millions dead. After World War II, we succeeded wildly by taking the lessons of two world wars.\nAnd the founders of the Atlantic Council were around in that period of time. They had lived through the first two world wars. In their wisdom, they created the Atlantic Council. And they created the institutions of the international rules-based order that has served us until today, with all its flaws. Through the most successful and sustained period of freedom, prosperity, major power, peace and security that the world has known.\nThe period after the Cold War has been more of a mixed bag. Some very good, the enlargement of NATO and the European Union, and initially the integration into the world economy of China, which brought so much potential promise. But some bad, wars in the Balkans, Russia’s war in Ukraine, conflicts in the Middle East, and, unfortunately, China’s behavior backing Russia, Iran, and North Korea, when it could have chosen a different path.\nThat’s the context for this evening so powerfully laid out by Atlantic Council Chairman John Rogers at the outset of this evening. Last year, our honoree, Italian Prime Minister Giorgia Meloni, put it this way. Quote, “Patriotism is the best response to decline-ism. Defending our deep roots is a preconditioning for reaping ripe fruit. Learning from our past mistakes is the precondition for being better in the future.” You are all actors in this moment, celebrating the brand of global citizenship that will help us navigate the shoals and steer safely to shore.\n“You are all actors in this moment, celebrating the brand of global citizenship that will help us navigate the shoals and steer safely to shore,” says @AtlanticCouncil President and CEO @FredKempe at the 2025 Global Citizen Awards.\n— Atlantic Council (@AtlanticCouncil) September 25, 2025\nWatch live: ➡️ https://t.co/fZHy8edPwE… pic.twitter.com/bQn0cF2Tgs\nIn our audience this evening we have more than seven hundred government, business, military, media, and civil society leaders from more than forty countries, including six heads of state and government, five former honorees, including Kristalina Georgieva, the head of the IMF, Albert Bourla, the head of Pfizer. That’s on top of more than a dozen ministers, more than twenty ambassadors, a whole herd of legislators, and more than four dozen chief executives and chairpersons of significant global companies. You all have agency. You all can shape this future. Rounding this impressive list we have more than fifty-five Atlantic Council Board members and International Advisory Board members. So I’m very pleased that you’re all here, and so please give yourselves a round of applause.\nIn his farewell address to the nation in 1989, President Ronald Reagan, who history will treat as one of our greatest presidents, talked of America as a “city on the hill,” which we at the Atlantic Council would define as constructive American leadership on a hill alongside partners and allies which throughout the last eight decades has guided our community toward a future that is safer, brighter, and more prosperous.\nAs our constituents know, what really sets the Atlantic Council apart besides this incredible network, beside the mission that we stand for, beside the durability as a nonpartisan values-oriented organization is our entrepreneurial spirit, a team that continues to add new projects to our arsenal.\nI won’t list everything tonight that we’ve done new but I’ll scratch the surface with a few significant brand new initiatives at the Atlantic Council that underscore the energy and entrepreneurship that sets us apart.\nThe first is the Bipartisan Commission on Biodefense, which will join the Atlantic Council in October. Established in 2014, the commission is the preeminent body providing comprehensive assessment of US biodefense efforts and fostering critical policy challenges to support prevention, deterrence, preparedness, response, and mitigation of human-generated and naturally occurring biological threats. It’s the cutting edge.\nChaired by former secretary of labor Donna Shalala, a Democrat, and former secretary of homeland security and governor of Pennsylvania Tom Ridge, a Republican, the commission is the preeminent voice on biodefense issues in the country and will enhance our footprint in this key area of national security.\nSo, Donna, thank you so much for being with us tonight.\nI’m also pleased to announce a new partnership between the Atlantic Council and the Antenna Group. Chaired by our international advisory board member—yes, we have an Antenna Group constituency here. Chaired by our international advisory board member and Antenna Group chairman Theodore Kyriakou.\nThis very week we will launch the inaugural Alliance for Europe-Gulf Geopolitics and Investment Summit, which the acronym from those letters is AEGGIS. So it’s the regular spelling of AEGIS with an extra G.\nThis ambitious undertaking aims to strengthen EU-Gulf strategic and economic relations. No such organization right now exists at a critical moment for both regions and their partners around the world.\nSo, Theo, thank you so much.\nAnd we recently launched the Atlantic Council’s newest office in Romania, launched this summer thanks to the generous support of our founding partners, many in the room tonight.\nThank you, Teofil Muresan, Radu Piturlea, Catalin Podaru, Sorin Preda, and Corneliu Bodea. Thank you so much for being here.\nAnd mark your calendars for the 2026 Global Energy Forum in Washington, DC, on June 9th, 2026. I think we’ve done about a dozen of those. There are too many in the audience to thank for this, but Landon Derentz is leading this charge building on this year’s impressive forum which featured 1,500 participants from ninety-five countries. You won’t want to miss it.\nAnd finally, we intend to build new work energized this evening around the power of sport to unify and galvanize common cause. So thank you, Gianni, for inspiring us to go in this direction.\nAnd then I’m just going to thank three groups of people. First of all, those of you in the room tonight who have generously contributed to the name spaces within our global headquarters in Washington and you can look at the screen and see the names of those.\nAs we round out our first year in this innovative new space, I’m deeply grateful for your investment in the Atlantic Council. It speaks volumes about the trust and belief you put onto us, and you can see the names on the screens behind me for the impressive roster of individuals who are responsible for this. And by the way, there are still spaces available in the building for naming if any of you would like to step up.\nAs we celebrate the achievements of tonight’s honorees I also want to salute the leadership of another distinguished group of individuals. As is our tradition, I want to thank—and I want them to stand—the 2024 Global Citizen Dinner co-chairs. It’s the largest group in our history of this dinner, some fifty of you in all. So turn to the screen. You can see the name of all of them. But please stand, all dinner co-chairs, as we—as we applaud you.\nAnd then the other tradition—and here I really hope you’ll stand and applaud even louder, and there’s some overlap with the first group—the Board, the International Advisory Board, the staff of the Atlantic Council. It’s one of the greatest honors of my life, after my family and my wife, to work alongside you. So thank you so much. And please rise so we can thank you as well.\nSo, with that, please turn your attention to the screen for the next portion of tonight’s program.\nANNOUNCER: Please welcome the chairman and chief executive officer of BlackRock, Larry Fink.\nLAURENCE D. FINK: There we go. Hi, everyone. I can’t see the screen that well because it’s too low, because I’m too tall. Can somebody fix this?\nAnyway, let me just start up and say it’s a real honor to be here today. And importantly, at a time of so much uncertainty, at a time where there’s so much misunderstanding, there’s a need more than ever before of having conversations, having an understanding. And organizations like the Atlantic Council provide a forum for that. And we need to preserve organizations that build deeper understandings through conversation, and more importantly for democracy understanding and conversation is essential. And I hope we all, as leaders of governments, leaders of companies, and everybody in the room—thank you for that, by the way—everybody in the room focuses on how can we play a part in making sure that we are building democracy in a way that we can build greater prosperity, but more importantly prosperity for more and broadening the future of democracy and the future of capitalism. And if we don’t do that, the other outcomes are going to be far worse.\nBut I’m not here to talk about that. I’m here to offer a brief thought, a few thoughts to a man who I’ve admired for many years, somebody we’ve shared conversations. Somebody that—there’s one thing that Emanuel Macron and I have in common: We both started our careers in finance. The difference is, he got out. And for all of us and for the country of France, the Republic of France, he became the president of France. Whereas I, I’m here standing and making a presentation to him with the award.\nBut in all seriousness, you can make an argument—and I’ll pound the table with this argument—that no French leader has led his country at a more pivotal time since World War II. For years many people in this room were worried about France—were worried about Europe. And Europe was defined by stagnation.\nBut today, when I visit France, when I meet the business leaders of France, when I meet the government of France, I hear something so different. I hear questions. How are we going to start building and growing again? How are we going to broaden our economy so more members of the French economy can enjoy and build and be prosperous? How do we make sure that French citizens share the prosperity being created around the world instead of watching it pass by? And we need to do this in more and more countries, making sure we broaden our economies that more prosper.\nFrance is asking those questions because of one man, Emmanuel Macron. He is the one who’s pushing the country forward. And it’s not been easy. And at times, as we all know, it’s hard. He has always been unusually clear-eyed about what the future demands, a greater appetite for risk, making bold decisions, making more innovation work, and making sure that all twenty-seven countries of Europe build together with strength and vitality. It’s been too long that Europe has been growing slower than the United States and other democracies. And I do have a view that President Macron is one of the key leaders in trying to make that happen. And he’s succeeding.\nI think he’s an example for more. He’s an example for businesspeople to maybe go into a new career. But importantly, he is really redefining the role of globalization, and how globalization could work for more. And globalization really should not be abandoned. And economic prosperity will be through that process. You see that in a way he’s emerged as a defender of NATO and a real defining peacemaker for Ukraine. President Macron has reminded us that peace in Europe is never just a European project. It is what holds the world together.\n“President @EmmanuelMacron has reminded us that peace in Europe is never just a European project; it is what holds the world together,” says @BlackRock CEO Laurence D. Fink at #GCA2025.\n— Atlantic Council (@AtlanticCouncil) September 25, 2025\nWatch live: ➡️ https://t.co/fZHy8eenmc #ACAwards pic.twitter.com/iokAH4ysRD\nAfter all this, that is why Paris is a city of light. Not because it was the first to install gas lamps on its street corners. But because when the world has needed France, France has illuminated the way out of darkness towards something better. As we know here, the foundation of America has been so based on France, based on democracy from France. Which brings me to the name of this award, “global citizen.” It’s not a phrase. It’s not a single definition. But it’s how and what. A global citizen is not someone without a country. It is someone who is loved in the country, and so deeply believes in his country, and lifts more people.\nAnd by that measure, Emmanuel Macron is the very definition of a global citizen, but a true global leader. And I am proud that I’m up here today introducing the president of France, Emmanuel Macron.\nPRESIDENT EMMANUEL MACRON: It seems that he just took the prize for himself. Thank you very much. I want to thank first Larry for your kind words. And, Mr. Chairman, excellencies, distinguished guests, ladies and gentlemen, dear friends. Tonight we are celebrating a strong and lasting friendship, a big, beautiful friendship, as would say a friend of mine.\nAnd at the very beginning, I didn’t understand exactly why I was awarded tonight with my great friends Gianni and Javier. It was a little strange to me. And I started to think about that. And probably it was because three of us are soccer fans—or, Gianni, football fans—Boca Juniors, Inter Milan, and Olympique de Marseille. And it’s true that I remember a good final in 2018. It’s another time in another world. But we were in Russia, believe it or not, with Gianni Infantino. And France won the World Cup. And in 2022, it was in Qatar. And I don’t remember the end of this game. I’m sorry, Javier.\nMore seriously, I want to thank the Atlantic Council for this great honor tonight, and this Global Citizen Award. I have a very elaborate speech by my team, but I think at the end of this dinner I will kill you if I just read this speech. So let me just share a few thoughts on how to take such a prize, and which type of call to action I got from it. I would say when we speak about global citizenship in the current world, it could be a big problem for you. Because being global is not so good for a leader today.\nAnd let me first say, but it was perfectly phrased by my predecessors here, that you can be a global leader, deeply rooted. And you can believe in patriotism and defend your country without being a nationalist. And this is a big difference. And the big difference is that being full of patriotism makes you loving your country, but without attacking the others. Which is the main difference with a nationalist guy. And this is why I’m here in front of you as a clear patriotic for France, but as a strong advocate for Europe, and a strong believer in global cooperation and in this global order.\nAnd I’m quite well known in France for the en même temps, which means “at the same time.” And a lot of people reproach me to have a sort of ambiguity with that. No. You can refuse to make stupid choices. And you can refuse stupid alternatives. You can love your country and love to cooperate with the others. This is just the matrix of being a global citizen. Now, after the Second World War, we built all together—and this is clearly the DNA of our United Nations—we built this order to have peace, prosperity, and democracy. And these three core ideas and concepts are the one at stake today.\nAnd in order not just to protect them but to be sure that ourselves and our children will benefit from peace, prosperity, and democracy, this is the very moment where we will have to work very hard and cooperate altogether. Peace first. Let’s be clear, when you look at the situation today there is a huge risk to live in a world where this is the end of the rule of law, where this is the end of our UN Charter. You mentioned, and I want to thank you for that, the aggression war launched by Russia and Ukraine. And let me tell you, this is not just the war of Ukrainian people. They are so brave. And we all admire them tonight. And please applaud them.\nThis is, obviously, an existential war for the Europeans because this is our security which is at stake. But this is a war for everybody in this world, because if you remain passive, if you don’t react to this aggression war against sovereignty, I mean, the territorial integrity of the Ukrainian people, it means just that you renounce to the UN Charter. And the day after, what is your guarantee not to live in the Wild West? Nothing? So our duty as free nations, as member of these United Nations, it’s clearly to back the Ukrainians in this resistance, to back the Ukrainians in order not just to resist but to recover their territory and their integrity.\nThis is why we worked very hard with so many colleagues and allies to build this coalition of the willing together with the UK prime ministers. And we are thirty-five nations working for the day after on security guarantees for Ukraine. But this is why… we have to step up to help the Ukrainians to resist in this time.\nAnd this is, of course, a discussion we had yesterday with President Trump, and we agreed to say Russia is not the one you believe in. Russia is not so strong. Look at the situation. More than one thousand day, they just took 1 percent of the Ukrainian territory. If we decide that Russia has to come back at the table of negotiation, and accept and Ukraine as a free country, we can do it.\nSo we strongly believe in peace, but not a peace which will be in a certain way a surrender for Ukraine; a robust and solid peace, compliant with our international order and our UN Charter. This is our objective, and this is what we will deliver.\nBut this is, as well, what is at stake in Middle East. And let me just say a few words on Middle East tonight here, because if we want to be global citizens, if we believe that we live in a global order, we should never accept a double standard. And what is the credibility of the Europeans or others to say it’s very important to respect territorial integrity of the Ukrainians, it’s very important to respect the principles of the UN Charter, but not to have a single word for Middle East, not to have a single word for what’s happening in Gaza? We kill our credibility with such an approach. It’s not understood in the rest of the world, because what is at stake is human life.\nThis is why we do condemn with strength the terrible terrorist attacks the 7th of October 2023 launched by the Hamas, a terrorist group. This is why our top priority today is the release of all hostages. And at the time of Rosh Hashanah, I have a special thought for all the families of these forty-eight hostages and all the families being victims of the 7th of October. But this is why we have to call—you can applaud them. But this is why we have to call for an immediate ceasefire in Gaza as well, for clearly humanitarian action, and to stop this war without end.\nThis is why we proposed two days ago with Saudi Arabia not just the recognition of Palestine made by eleven countries from Canada, UK, to Australia and France, but a peace and security plan for all backed by 142 countries, which is: First, the release of hostages, a ceasefire; second, the stabilization of Gaza and the dismantling of Hamas; and, third, a two-state solution, which is the only way to have the Palestinian people living in peace in a Palestinian state being demilitarized, recognizing Israel, Israel recognizing this state, and having all the neighbors and especially those which today don’t recognize Israel recognizing it.\nThis is just the only way forward to have peace and sustainability for Israeli people and this is as well precisely what the United Nations voted seventy-eight years ago. No double standard. No double standard. Believe me, this is part of our credibility.\nI can imagine tonight all the wars but this is always the same thing we have to do, working hard together, cooperating, and fixing the situation to build peace and sustainable peace. If we speak about prosperity this is the same. In order to deliver such an agenda we need more cooperation.\nI don’t believe we can fix the global imbalances of this world by fighting each other or fragmenting the economic global order. We do have global imbalances: lack of domestic demand in China, lack of investment in Europe, more need of money and investment in the key challenges in Africa and LatAm, and over-indebtedness in some sectors here.\nBut the only way to fix it is precisely to resynchronize this debate and to cooperate as we did when we launched the G7 more than fifty years ago. And it will be called for for our G7 agenda next year, but we have clearly to work together in order to deliver this agenda of prosperity. And this is why IMF and World Bank, they. . . are so important in this agenda, because in this very moment we are first to accelerate our growth policy in our economies—more innovation, more simplification, big acceleration in order to deliver more growth.\nBut as well we have to deliver a more balanced world and this is why we need stronger instruments public and private in order at the same time to deliver our tech, green tech, and climate agenda. We will kill the global order if we just are focused on deregulation in our economy without any solidarity with our—vis-à-vis the other members of the UN and if we don’t deliver our climate agenda and we should remain focused on this agenda.\nIt’s very important, and this is not because, I would say, the global discussion seems to change that we will be citizens of another world. There is no planet B and this is why when we speak about prosperity we need more growth, more innovation, more redistribution, and fixing climate change by innovation and decarbonization of our economies. No other choice.\nAnd the last point is about democracy, obviously. It seems to be so naive to speak about democracy but look at our democracies. I’m not so sure we’re in good shape. Look at the violence in our societies—Javier mentioned that. Look at the rise of the extremes and the permanent disorder of democracies where there is a sort of legitimization of excessive words, hate speech, and so on.\nThe basics of democracy is because you can vote, because you can change your leaders, because you vote for your laws, you need respect and peaceful debates and we are losing these basics.\nAnd let me just share one conviction when we speak about democracies in this country but in mine as well. We will have to work very hard on social media. Our democracies were not conceived with, for, the social media and this is a huge issue and we were definitely too naive.\nOur young people and teenagers are hurt by the social media; it’s now well documented. But if we speak about mental health of our teenagers and young people just look at the social media, and what happens? From bullying to obsession of some references, but this is making their life impossible. We have to protect them, for our democracies. We already have a sacrificed generation. So one was started with the social media in 2015. We are not allowed to remain passive.\nBut more than that, look at all of us. We were educated to learn about the world, to try to be educated, and to digest some information sometimes in the day, and to try to think about what’s happening, to live in in a global, shared world. Now, from the morning till the end, we eat this permanent food delivered by the social media. And the merit order is the argument is lower, emotion is much stronger, and negative emotion is much, much higher, because everything is driven by an algorithm I don’t know, you don’t know, but made on purpose to create excitement, engagement, and, guess what? Money.\nI don’t want my democracy to be driven by an algorithm whose unique purpose is to create this excitement and to spread crazy contents, because it’s just killing the possibility of a common discussion. It’s just pushing people to the extremes. It’s just killing our common approach of a common world and a shared world. And it’s just framing our democracies in favor of the extremes. Our democracies are at risk because we are too naïve with something which is quite well organized. So let me tell you that if we want to be efficient and remain democracies speaking about democratic values in a few years’ time in this room, we should act. And we should regulate. And the regulation of social network is not a bad word. This is just necessity.\n“I don’t want my democracy to be driven by an algorithm.” Watch @EmmanuelMacron make the case for regulating social media at the Atlantic Council’s Global Citizen Awards. #GCA2025 pic.twitter.com/Ynreifx8US\n— Atlantic Council (@AtlanticCouncil) September 25, 2025\nTo work together on peace, prosperity, and democracy, we need this strong alliance, especially between the United States and France, the United States and Europe. This is our history. This is history from Lafayette to the First World War and the Second World War. And we are here together. And I want to conclude by telling you how much this partnership is important, and how much you need here in the US a stronger Europe. Sometimes people thought that having a stronger Europe was something detrimental to the transatlantic relation. This is the opposite. Having a strong Europe—Europe has a power, a financial and economic, a military power—is just having a Europe which shares the same values as the US, but is able to take its fair part, its fair share in this global order.\nBut we have to work together very hard. And each time we diverge, this is the time where we are less efficient to fix a war, less efficient to build a sustainable prosperity, less efficient to work and improve our democracies. I was already too long. And I do apologize for that. But as you understand, I strongly believe that this cooperation between our countries is the only way—the only way to remain global citizens in this current environment. As for the rest and beyond cooperation, partnership, and friendship, leave it to the football field, dear Gianni. Thank you for your attention.\nANNOUNCER: Please welcome Atlantic Council Executive Vice Chair Adrienne Arsht.\nADRIENNE ARSHT: What an evening. Let me tell you now about our closing performance. Regardless of what country you’re from, the language you speak, or if you’re an avid opera fan or not, we’re all familiar with this last song, “Nessun Dorma.” And if you ever wondered what it means, it means “No One Sleeps.” It’s from the last act of Turandot and, as in all operas, the plot is convoluted, messy, and a bit nonsensical.\nSo I’m not here to tell you about the opera, but I do want to tell you why “Nessun Dorma” has such relevance this evening. First of all, it was sung at the FIFA World Cup in 1990 by Luciano Pavarotti. And the concept of sleep or that no one sleeps certainly describes the tireless role of our two honorees President Macron and President Milei.\nTonight, we’re privileged to hear one of opera’s brightest stars. He’s from Turkey. He has thrilled audiences on major stages with a voice that blends commanding power with remarkable artistry. Accompanied by the American Pops Orchestra conducted by Luke Frazier, please join me in welcoming internationally acclaimed tenor Murat Karahan.\nWatch the full event\nFurther reading\nFri, Aug 15, 2025\nA milestone on Argentina’s long road to recovery\nNew Atlanticist By Jason Marczak, Ignacio Albe\nThe International Monetary Fund recently completed the first review of Argentina’s Extended Fund Facility signed in April. The result was positive, reflecting the country’s larger economic trajectory under President Javier Milei.\nThu, Sep 4, 2025\nIn Beijing and Paris, a tale of two global futures\nInflection Points By Frederick Kempe\nRecent gatherings in China and France revealed that competing international orders are crystallizing. What part will the United States play?\nFri, May 2, 2025\nFrance’s foreign minister on Europe’s role in the ‘new era of multilateralism’\nNew Atlanticist By Daniel Hojnacki\nJean-Noël Barrot laid out his vision of European strategic autonomy and cautioned Washington against pulling back from the multilateral system it helped build.",
  "word_count": 10081,
  "scraped_at": "2026-02-14T12:36:19.567085"
}