{
  "article_id": "f59ef5141dde",
  "url": "https://theconversation.com/censorship-into-art-why-iranian-director-jafar-panahis-subversive-stories-are-getting-the-worlds-attention-255221",
  "title": "Censorship into art : why Iranian director Jafar Panahi subversive stories are getting the world attention",
  "date": "20250603T064500Z",
  "domain": "theconversation.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Iranian director Jafar Panahi has spent his career turning barriers into creative inspiration.\nWorking under travel bans, house arrests and periodic detention, he had made powerful films that show everyday life in Iran through quiet moments, daily struggles, and small talk on streets under surveillance. He shows people who are restricted by repressive rules, yet who hold onto hope – albeit fragile.\nAlthough Panahi is banned from making films in Iran, he has managed to make a new film “underground” almost every two years. He recently stood triumphant as he received the prestigious Palme d'Or at the Cannes Film Festival for his thriller It Was Just an Accident (2025).\nThe 2025 Sydney Film Festival’s retrospective Jafar Panahi: Cinema in Rebellion provides a valuable opportunity to look deeper into Panahi’s work, and understand how he makes impossible cinema possible through his unique position.\nA slice of life under censorship\nPanahi is one of Iran’s most important filmmakers – both because of the international recognition he has received, and because of the symbolic power he has gained through his fight for freedom of speech.\nHis form of storytelling is rooted in the tradition of Iranian “social films”: dramas and melodramas focusing on everyday, ordinary life.\nHe blends this tradition with the style and aesthetics of late director Abbas Kiarostami (who he worked with for some years), using elements such as long sequences, vehicles as a recurring motif, and self-reflexive approaches to storytelling.\nPanahi’s films not only focus on daily life, but treat cinema as part of that life. In other words, the filmmaking process becomes part of the narrative.\nHe sometimes places himself within his films. In No Bears (2022), he plays a version of himself to explore the complexities of trying to tell a story while battling surveillance, the threat of exposure, and extreme cultural dogma.\nPanahi’s films feature characters rarely seen other works. For instance, in the short film Hidden (2020), the protagonist is a young woman who must perform out of sight due to restrictions on female voices in public.\nSimilarly, in 3 Faces (2018), a girl from a small village sends a video to a famous actress, begging for help to study acting because her family won’t allow her.\nAnd Offside (2006) follows a group of girls who try to enter a football stadium by dressing up as boys to watch a World Cup qualifying match – highlighting Iran’s historical ban on women attending men’s football matches.\nCinema as reality\nPanahi’s films try and look behind the curtains to construct a filmic representation of daily life in Iran. In doing so, they often blur the line between fiction and reality.\nIn The Mirror (1997), a young actress suddenly stops acting and refuses to follow the script. Although this moment is not actually unscripted, it challenges the viewer’s sense of what is real and what is performed. The film turns into a kind of documentary as the cameras follows the girl on her journey home.\nHis work also investigates how external forces can shape one’s internal world. In Closed Curtain (2013), a man hides his dog inside a dark house as dogs are viewed as “impure” by the public authorities.\nHalfway through the film, Panahi himself appears – again in the form of a filmmaker facing bans. While the film remains fictional, Panahi’s presence turns the narrative into a reflection on cinema and lived experience.\nWe also see this approach in his subversive documentary This Is Not a Film (2011). Forced into house arrest, and facing a 20 year ban on filmmaking, Panahi films himself inside his apartment while exploring what it means to be banned from filmmaking – and whether filmmaking is possible without a crew or script.\nThe tragedy in small hurts\nPanahi’s films are full of small moments that build into bigger truths – part of the heritage of Iranian social cinema.\nIn The Circle (2000), different women move through Tehran facing rules that limit their freedom. At the end, the film loops back to its start, showing how their problems don’t end, but simply repeat.\nIn Crimson Gold (2003), co-written with Abbas Kiarostami, a deliveryman is repeatedly humiliated throughout his daily life because of his social status. The film begins by showing the man attempting to rob a jeweller, before taking his own life – then moves backward to show how he built-up enough despair to commit the act.\nThe real shock isn’t the act itself, but everything that led to it.\nVehicles as a safe space\nVehicles are everywhere in Panahi’s work: mobile spaces reside on the boundary between public and private life.\nIn Taxi (2015), Panahi plays a cab driver whose taxi becomes a small stage for passengers to share their stories and opinions.\nIn No Bears (2022), although Panahi is largely confined to a rural village setting, cars and motorbikes function as transitional spaces between different zones of privacy and publicity.\nNothing onscreen is unintentional\nPanahis’s work resists simplistic ideas of the oppressed and the oppressor. These are not just stories about a heroic artist against an authoritarian state. They prompt us to ask: who really benefits from this binary? And what deeper political and cultural dynamics are at play?\nAnd he does this by using the restrictions imposed on him – and even his silence – as narrative tools. Censorship becomes part of the creative process. Not an obstacle, but a resource.",
  "word_count": 901,
  "scraped_at": "2026-02-14T12:35:59.545989"
}