{
  "article_id": "f60389e9b3e5",
  "url": "https://timesofindia.indiatimes.com/city/delhi/indian-junior-boxers-storm-into-finals-at-iba-world-boxing-championships/articleshow/105690767.cms",
  "title": "Indian Junior Boxers : Indian Junior Boxers Storm into Finals at IBA World Boxing Championships |",
  "date": "20231203T040000Z",
  "domain": "timesofindia.indiatimes.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "- News\n- City News\n- delhi News\n- 12 Indian junior boxers storm into Worlds finals\nTrending\nThis story is from December 3, 2023\nPrachi Tokas (+80kg) put up a dominant show over Osipova Mariia of Russia, forcing the referee to stop the contest in the first round itself. Megha (80kg), on the other hand, showed a similar display of strength and power to also clinch a referee stop the contest (RSC) win in round three against Tseng An Chi of Chinese Taipei. Vini (57kg), Akansha (70kg) and Shrushti (63kg) outperformed their opponents to grab identical 5-0 unanimous decision victories to enter the finals.\nPriyanshu loses to Jen in Syed Modi semis:\nPriyanshu Rajawat squandered a one-game advantage to go down to Chi Yu Jen of Chinese Taipei in the semifinal of the Syed Modi International badminton in Lucknow. The 21-year-old, who won the Orleans Masters Super 300 this season, toiled hard for one hour 14 minutes before losing 21-18 14-21 17-21. agenciesBASKETBALL:\nNBA, 7.30 pm (Jio); CRICKET:\nIndia vs Aus, 5th T20I, 7 pm (Jio); Women’s T20, India ‘A’ vs England ‘A’, 1.30 pm (Jio); WI vs Eng, 1st ODI, 7 pm (Fancode); FOOTBALL:\nISL, FC Goa vs Kerala, 8 pm (Jio); EPL, Chelsea vs Brighton; Liverpool vs Fulham, 7.30 pm; Man City vs Tottenham, 10 pm (Star); Bundesliga, 8.30 pm (Sony); La Liga, 9 pm (Jio); I-League, Rajasthan United vs Shillong Lajong, 4.30 pm; Mohammedan FC vs Sreenidi Deccan, 7 pm (Fancode, Eurosport)\nWe also published the following articles recently\nAshwini-Tanisha pair in final, Priyanshu loses to Jen in Syed Modi semis\nIndia's Ashwini Ponnappa and Tanisha Crasto secure their spot in the women's doubles final of the Syed Modi International badminton tournament after top-seeded Japanese pair Yuki Fukushima and Sayaka Hirota concede the match due to Hirota's injury. The Indian duo will face Japan's Rin Iwanaga and Kie Nakanishi in the final. In the men's singles semifinal, Priyanshu Rajawat loses to Chi Yu Jen of Chinese Taipei after a one-hour and 14-minute battle. Priyanshu's errors cost him the opportunity to reach the final. Ponnappa and Crasto are now the only remaining Indian representatives in the tournament.\nIndia's Ashwini Ponnappa and Tanisha Crasto secure their spot in the women's doubles final of the Syed Modi International badminton tournament after top-seeded Japanese pair Yuki Fukushima and Sayaka Hirota concede the match due to Hirota's injury. The Indian duo will face Japan's Rin Iwanaga and Kie Nakanishi in the final. In the men's singles semifinal, Priyanshu Rajawat loses to Chi Yu Jen of Chinese Taipei after a one-hour and 14-minute battle. Priyanshu's errors cost him the opportunity to reach the final. Ponnappa and Crasto are now the only remaining Indian representatives in the tournament.\nRani Mukerji: It is important to stand by strong films & strong roles\nRani Mukerji praises Bollywood films Kabhi Alvida Naa Kehna and Hum Tum for addressing a woman's wants and choices. She believes these films were ahead of their time and should be remembered in the history of Indian cinema. Rani emphasizes the importance of portraying realistic characters through body language and appearance. She also discusses the significance of discussing a woman's desires and physical chemistry in relationships. Rani shares her experience in preparing for her character Naina in Hichki and expresses her gratitude to the audience for breaking the age barrier in Bollywood. Lastly, she reflects on how the film Black transformed her as a person.\nRani Mukerji praises Bollywood films Kabhi Alvida Naa Kehna and Hum Tum for addressing a woman's wants and choices. She believes these films were ahead of their time and should be remembered in the history of Indian cinema. Rani emphasizes the importance of portraying realistic characters through body language and appearance. She also discusses the significance of discussing a woman's desires and physical chemistry in relationships. Rani shares her experience in preparing for her character Naina in Hichki and expresses her gratitude to the audience for breaking the age barrier in Bollywood. Lastly, she reflects on how the film Black transformed her as a person.\nIndia GDP Q2 data explained: Indian economy on strong footing, will continue to outperform large economies\nIndia's GDP grew at a better than expected 7.6% in Q2 FY24, driven by manufacturing, mining, and construction. Government final consumption expenditure and gross fixed capital formation also contributed to the growth. The service sector showed recovery with a growth of 11.3%. The Indian economy is on a strong footing led by domestic consumption. India is expected to outperform other large economies this fiscal year.\nIndia's GDP grew at a better than expected 7.6% in Q2 FY24, driven by manufacturing, mining, and construction. Government final consumption expenditure and gross fixed capital formation also contributed to the growth. The service sector showed recovery with a growth of 11.3%. The Indian economy is on a strong footing led by domestic consumption. India is expected to outperform other large economies this fiscal year.\nEnd of Article\nFOLLOW US ON SOCIAL MEDIA",
  "word_count": 832,
  "scraped_at": "2026-02-14T12:56:49.108335"
}