{
  "article_id": "f60605a4da94",
  "url": "https://www.bbc.com/sport/football/articles/cpwr89dp2zno",
  "title": "England vs Germany : Selection headaches for Sarina Wiegman at Wembley",
  "date": "20241024T163000Z",
  "domain": "bbc.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Selection headaches as England meet Germany again\n- Published\nWhen England meet Germany at Wembley Stadium on Friday, memories of their Euro 2022 success are bound to come flooding back.\nIt is the first time the two teams will face-off since Sarina Wiegman's side lifted the European trophy on home soil.\n\"We will always cherish that. It was one of the biggest moments of my career and of my life,\" said Wiegman.\n\"But it’s a totally different Germany team and we are different because we've moved on too. It's the start of [going into] the next Euros.\"\nThe Lionesses are preparing for the defence of their title in Switzerland next summer with back-to-back friendly matches.\nAfter meeting Germany on Friday (19:30 BST), they take on South Africa in Coventry on Tuesday (19:45 GMT).\n\"I'll never get tired of talking about [the Euros success], of course not, but we have a new focus and a completely different tournament to play,\" said captain Leah Williamson.\n\"I'm sure there will be many people in the stadium [at Wembley] who would have wanted to have been there two years ago, so it's lovely, it's a great memory.\n\"But tomorrow we play somebody that won it six times in a row. We have one, they have many. It's a great fixture.\"\nWhat has changed for England since Euros triumph?\n- Published24 October 2024\nLe Tissier wants to 'cement spot' in England squad\n- Published23 October 2024\nIs England's number one shirt in Hampton's hands?\n- Published23 October 2024\n'We always want to progress faster'\nThe showdown between two of Europe's biggest football nations can be a marker of where the Lionesses must improve before the summer.\nIt has not been plain sailing since their Euros success, with disappointment in the Women's Nations League and missing out on Olympic qualification.\nThey did reach the Women's World Cup final in 2023 however, and won the first Women's Finalissima a few months before.\nBut there has been growing criticism of England's performances, which have dipped since the highs of 2022.\n\"We always want to [progress] faster but I think the game has increased, the level of the leagues in international football has increased and developed,\" said Wiegman.\n\"That's what we want, so that means we have to develop too. There's competition in the team, with other players coming in, and more experienced players have to help the younger players so we are all on the same page.\n\"We just know where we want to get to in July.\"\nGermany are under new management in Christian Wuck, who took over the squad after they reached the semi-finals of the Olympic Games in Paris.\nHe said \"both nations have developed well\" since the Euro 2022 final and have \"profited\" from the progression of their domestic leagues.\n\"Germany has always been a powerful team, very physical and one that wants to play a possession game but doesn't hesitate to play long balls either,\" added England boss Wiegman.\n\"They have a new coach now, so they will probably do some other things too and that's a challenge for us - a nice challenge.\n\"We don't know exactly what they will do, but we're prepared for everything. It's really good for us to get that experience at the highest level.\"\n'They are headaches I want to have'\nOne of the concerns for England going into Friday's match is the number of regular starters who have struggled to find form with their clubs.\nStriker Alessia Russo has not scored in the WSL this season, while team-mate Beth Mead has netted once in five appearances.\nForward Chloe Kelly has fallen out of favour at Manchester City, while England captain Williamson has struggled for regular game time, dealing with concussion.\nIt means there could be a selection dilemma for Wiegman, who must decide whether to select in-form centre-back Alex Greenwood ahead of Williamson.\n\"That is absolutely a headache because they are all really good and really competing for minutes,\" said Wiegman, when asked about her defensive options.\n\"But they are absolutely the headaches I want to have, so it's a hard decision to make.\n\"But we also know there's six or seven months to go and things can change very quickly in football.\"\nWilliamson said competition for places has always existed with England, but she hopes to get some minutes.\n\"I was once very much on the outside trying to push the people in front of me. We've always had a very strong unit,\" she added.\n\"I think it's fair to say that’s why our output has been so successful over the last couple of years.\"\nIt could be the perfect opportunity for Wiegman to use young midfielders Jess Park and Grace Clinton, who have impressed for Manchester City and Manchester United respectively.\nThere is also a decision to be made in attack, with Chelsea's Aggie Beever-Jones continuing to perform well for her club.\nAnd goalkeepers Hannah Hampton and Mary Earps continue to battle it out for the number one spot.",
  "word_count": 835,
  "scraped_at": "2026-02-14T13:05:29.942561"
}