{
  "article_id": "f61f7c987106",
  "url": "https://alumni.berkeley.edu/california-magazine/online/my-old-guy-masters/",
  "title": "My Old Guy Master Piece - Cal Alumni Association",
  "date": "20250604T013000Z",
  "domain": "alumni.berkeley.edu",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "I was somewhere in the middle of the Indian Ocean when Ed Wasserman called my wife’s cell phone. We were on a round-the-world (yes, 80-day) cruise and the connection kept going in and out.\nGeeta Anand, then-dean of the Berkeley Graduate School of Journalism, had asked Professor Wasserman, her predecessor, to call me and see how serious I was about the following short email, replete with the bad punctuation you see, I had sent her weeks before:\n“I was in one of the early grad school classes…would have graduated in 1974, but took a leave offered by Dean Bayley and never came back. Now I am retired, but had the thought that i might want to finish that masters. What would it take to do that.”\nTo be frank, I wasn’t quite sure about my motives, much like when I first came to Berkeley—and when I left. I had had some kind of life in that interim half-century. Journalism jobs that were wonderful (reporter at Sports Illustrated) and others not so (cop reporter in Gastonia, NC). I was fired five times, but never deterred. I had taught writing for two decades at the University of Pennsylvania and waited tables in between other jobs. As a freelancer, I had hundreds of bylines in the New York Times and had written three books, the best-received being Worst. President. Ever (No, not him, but James Buchanan). I had a marvelous wife, two talented daughters, had owned a restaurant and visited 123 countries.\nWhen the Berkeley J-School bought into this whimsy, I readied for, well, whatever.\nAs I write, I am starting the required 300-hour internship and thesis/final project the master’s degree requires. I have spent the last year walking the campus daily, gazing at the Mario Savio Steps, petting the statue of the saber-toothed tiger near McCone Hall, the earth sciences building and rubbing the adjacent petrified wood block for luck.\nLuck, I have had. My hundred-or-so colleagues (about 50 in each cohort) are a gift to me. They are as varied as the raindrops and warm as the shawarma at My-O-My on Euclid Ave.\nHere’s a tale. I was walking the halls of North Gate, the J-School building, telling a young classmate of my introduction to working at the Daily Californian back in 1973. I had volunteered to write about water polo without ever having seen a match live and not knowing of Cal’s vast reputation in the sport. Thankfully, the coach took pity and schooled me.\nAs we were coming to the entrance of the student lounge, I spat out, “And I even remember his name.” I paused, then said, “Pete Cutino.”\nAt that moment, another of our classmates bolted out of the lounge, blurting, “That was my grandfather!”\nI felt my age, and, at the same time, not at all. By the end of the year, Sophia Cutino and I had exchanged autographed books, as if we were contemporaries, which, of course, we are.\nI fell quickly into my (admittedly self-appointed) roles as social director and ad hoc mentor. A couple of my classmates had interest in sports, which is not really part of the curriculum, so I connected them with friends who were broadcasters or magazine writers or authors or coaches. I had a car and a campus parking space, so I gathered people on weekends to ride cable cars in SF or head to Napa or even (sigh!) spend a day at Stanford.\nMy daughter had lived in SF and introduced me to two bars in the city that catered to Philadelphia sports fans, of which I am one. I dragged two of my new J-School African friends to one for the Eagles’ NFL season opener. They had never seen American football before, but I convinced them it would be an American experience. Several plates of chicken wings and many Eagles cheers later, they were ready to make that experience their first multimedia project.\nOn the other hand, I was clearly on the downside of the technology curve. I had only gotten a cell phone two years ago, and only because you can no longer get into sporting events without one. For my audio classes, I had thought of bringing in a mattress to the J-school tech offices—I spent so much time there.\nMy professors found me to be a curiousity—or a conversation piece—but I know they appreciated that I was dead serious on learning. I audited Associate Professor Mark Brilliant’s History of California class, and occasionally, even though I sat in the back of the lecture hall, he would call up to me, “Robert, when did Willie Mays die?” or “Who did Nixon beat in 1968?” I felt like a wrinkled proto-Google, but proud I knew the answers.\nI gathered together an intramural tennis team and we tied for first in the fall. I paternalistically drove my female classmates several times to report their stories in Oakland. A Chinese friend had me talk to her father on FaceTime just to prove I existed. I offered to donate a vending machine to the snack-starved student lounge.\nI took advantage of every Berkeley advantage. I joined Professor Bill Drummond’s class helping the inmates at San Quentin with their journalism every Sunday afternoon. I took Brilliance of Berkeley, a weekly lecture seminar by distinguished professors. No, I would never take molecular biology, but 50 minutes with Professor Jennifer Doudna, who won a Nobel Prize for CRISPR, or listening to professor emeritus and former Secretary of Labor Robert Reich felt like feasting at a gourmet academic buffet.\nI did a piece for our radio news show on the protest songs of the Free Speech Movement, sat in the cheering section with my classmates at a Cal women’s basketball game, and brought champagne to every minor class celebration. I made my first friends from South Sudan and Pakistan, not to mention Vallejo and Bakersfield. I had sniffles and tears as I live-streamed my colleagues’ graduation ceremony.\nWhen my people at home ask me how it’s all been, I repeat that it was a gift. Lots of them have had good retirements, I would say, but none of them got to spend it with 25-year-olds.\nI will be weeks from my seventy-fifth birthday when I finally get that master’s I started 53 years earlier. To say that I thank all who helped me experience it in those sometimes ragged halls of North Gate, is not nearly enough.",
  "word_count": 1074,
  "scraped_at": "2026-02-14T12:11:23.577647"
}