{
  "article_id": "f636b1deb2ab",
  "url": "https://www.nasa.gov/centers-and-facilities/marshall/the-marshall-star-for-december-20-2023/",
  "title": "The Marshall Star for December 20 , 2023",
  "date": "20231221T004500Z",
  "domain": "nasa.gov",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Crew-6 Connects with Marshall Team Members During Visit\nBy Celine Smith\nOne week after the 25th anniversary of the International Space Station, NASA’s SpaceX Crew-6 visited the agency’s Marshall Space Flight Center to share their experience during Expedition 69. The event was held Dec. 14 in Building 4316.\nExpedition 69 began March 2 with Crew-6 flying on SpaceX’s Falcon 9 rocket from NASA’s Kennedy Space Center. While aboard the space station, the crew studied the behavior of flames in microgravity, grew cardiac tissue using 3-D culturing, and researched the impact of weightlessness on astronauts’ health.\nNASA astronauts Frank Rubio (flight engineer), Stephen Bowen (flight engineer), Warren “Woody” Hoburg (flight engineer), and UAE (United Arab Emirates) astronaut Sultan Alneyadi (flight engineer) answered questions from Marshall team members after viewing a short film summarizing the research done on Expedition 69.\nActing Center Director Joseph Pelfrey welcomed Marshall team members, thanking them and Crew-6 for all the effort that goes into making a mission successful.\n“As we wrap up 2023, I just want to say how proud I am of our team and all the accomplishments that you have helped us achieve this year,” Pelfrey said. “Crew-6 is going to talk about their amazing experience. Marshall is a part of that experience and mission with the work we do here between Payload Operations, the Environmental Control and Life Support System and payload facilities and our Commercial Crew Program support. This is a great time to hear from our guests and celebrate our successes together.”\nDuring the Q&A portion of the event, the audience learned about the strides in research being made on the station. Hoburg discussed the growing of human tissue while on the expedition.\n“One day Sultan worked on heart muscle cells up there and we actually got to see the cells beating under the microscope,” Hoburg said. “We’re doing work in Low Earth orbit to help people back on Earth with potential heart disease. We also did work with the BioFabrication facility where we 3D-printed biological material. We printed the first-ever section of human meniscus.”\nThe microgravity environment of the station provides crew members with the ability to do more intricate work that cannot be done as well on Earth, Hoburg explained.\nExpedition 69 is particularly important because it marks the longest time an American astronaut has been in space. The end of the mission concluded Rubio’s 371-day stay in space, which began with Expedition 68.\n“I was excited to implement lessons learned right away,” Rubio said. “With your first mission, you’re learning. You typically don’t get to implement your better self until years later. I got that opportunity much sooner.”\nRubio also used his experience to detail the effects of prolonged time in space on the body.\n“You miss microgravity, in the sense that it’s a lot of fun to just fly around,” he said. “It takes 72 hours to 5 days to fully acclimate to microgravity. After two weeks, you’re completely used to it. When you come back to Earth, there’s a lot of aches and pains because the reality is offloading everything off your joints, especially your spine, feels good – specifically for those who are older. Like, for me, it feels like I’ve run a 5k every time I get up because my feet did nothing for a year, but your body does readjust.”\nExpedition 69 also marks the first time a UAE astronaut has been to the station. Alneyadi spoke about his unique experience when asked about his participation in a culturally based event.\n“I was presenting to the whole region, speaking Arabic, discussing the International Space Station, and showcasing the importance of its science,” Alneyadi said. “It was very impactful, and I felt honored to be a part of it as well. I see the impact on the students. They ask a lot of questions and have a lot of excitement.”\nThe event concluded with the opportunity for attendees to get their picture taken with the Crew-6 astronauts.\n“People are the same everywhere, that’s the basics of humanity,” Bowen said when asked what’s the most exciting thing he’s learned from the international aspect of his work. From our perspective, we can’t see borders — it’s one Earth. At the very intimate singular level, people are people. We’re people, and we’re absolutely capable of doing amazing things.”\nSmith, a Media Fusion employee, supports the Marshall Office of Communications.\nTake 5 with Jason Adam\nBy Wayne Smith\nFor Jason Adam, joining NASA wasn’t a career choice. It was a calling.\n“A calling to push the boundaries of human knowledge, to turn the dreams of a starry-eyed child gazing up at the sky into a reality, and to be a part of humanity’s greatest adventure – the exploration of the universe,” said Adam, who is the manager for the CFM (Cryogenic Fluid Management) Portfolio Project at NASA’s Marshall Space Flight Center.\nThe project develops key CFM technologies used to acquire, transfer, and store cryogenic fluids in orbit. The project is within STMD (Space Technology Mission Directorate) and develops crucial technologies for STMD and other mission directorates. Adam’s role extends across 12 states and six NASA centers, managing significant contracts and a multitude of complex activities nationwide.\nGrowing up in North Dakota, Adam said he always was captivated by the mysteries of the universe as he studied the night sky.\n“(I was fascinated) by the endless expanse above, with its twinkling stars and wandering planets, and boundless possibilities,” he said. “This childhood wonder laid the foundation for my journey to NASA. It was here that my dream to explore the cosmos took flight.”\nWorking with projects like CFM enables Adam to live his dream, and he hopes to inspire others as well toward NASA’s mission of exploring the universe for the benefit of all.\n“Remember your journey at NASA is not just about personal achievements, but also about contributing to the greater goal of exploring and understanding our universe,” he said. “Embrace this opportunity with enthusiasm and a commitment to excellence.”\nQuestion: What excites you most about the future of human space exploration and your team’s role it?\nAdam: Cryogenic fluid management is a critical and exciting area of technology, particularly in relation to the exploration of Mars for several reasons. One of the primary uses of cryogenic fluids in space exploration is as rocket fuel, specifically liquid hydrogen and liquid oxygen. These cryogenically stored fuels are highly efficient but must be kept at extremely low temperatures. Effective cryogenic fluid management is crucial for months or years-long missions to Mars, as it ensures that the spacecraft has enough fuel for the journey there, operations on the Martian surface, and the return trip. Mars missions are looking into using ISRU (in-situ resource utilization) to generate fuel from Martian resources. For example, water ice from Mars can be processed into liquid hydrogen and oxygen. Managing these cryogenic fluids effectively is essential for this process to be viable, enabling longer and more sustainable missions.\nCryogenic fluid management is not only a cornerstone to enable Mars exploration but also a catalyst for broader innovations in space travel and various terrestrial applications.\nQuestion: What has been the proudest moment of your career and why?\nAdam: There have been many proud moments in my 20-plus years at Marshall that originated at Stennis Space Center. Some of those moments include helping the shuttle return to safe flight through testing SSMEs (space shuttle main engines) at Stennis, to flying the Mighty Eagle Lander with a small team in the Marshall West Test Area, to now having the privilege of leading the CFM project with a group of spectacular individuals. In each case, I have been proudest when the team was accountable, authentic, passionate, inclusive, and highly competent. Those are the teams I cherish most and the type of environment I try to create as a leader.\nQuestion: Who or what drives/motivates you?\nAdam: Working at Marshall, my motivation is deeply rooted in the pioneering spirit of technological innovation and the quest for knowledge beyond Earth. Marshall, known for its groundbreaking work in developing systems that push the boundaries of space technology, serves as a constant source of inspiration for me. My drive is fueled by a profound passion for space exploration. The idea of contributing to missions that reach into the unknown, that test the limits of human ingenuity and reveal the mysteries of the cosmos, is what gets me up in the morning. I’m driven by the knowledge that the systems and technologies you’re helping to develop at Marshall will one day make space more accessible and safer for astronauts. This drive isn’t just about the technology itself, it’s about what that technology represents – the human desire to explore, to learn, and to constantly push forward. My motivation comes from wanting to contribute in a meaningful way to this grand endeavor. Each day at Marshall offers a new opportunity to be a part of something larger than yourself – to contribute to a legacy of exploration that benefits not just the present generation but also the future ones. In my role, I’m not just a witness to history in the making; I’m an active participant in shaping it.\nQuestion: What advice do you have for employees early in their NASA career or those in new leadership roles?\nAdam: First, follow your passion. Begin by immersing yourself in a field that truly fascinates you. NASA’s diverse missions span from the depths of the oceans to the far reaches of space, so align your work with what genuinely excites you. This passion will be your driving force and will keep you motivated through challenges.\nSecond, build a strong foundation. Whether your focus is technical, scientific, or administrative, strive to develop a robust base of knowledge and skills. Seek opportunities to learn from different projects and teams. This diverse experience will be invaluable as you progress in your career, providing a well-rounded perspective and a toolkit of solutions.\nThird, nurture your team. As you advance into leadership roles, remember that your success is intricately linked to the well-being and performance of your team. Invest in understanding their strengths, aspirations, and challenges. Encourage an environment where everyone feels valued and motivated. Strive to create an environment where employees can bring their full self to work.\nQuestion: What do you enjoy doing with your time while away from work?\nAdam: Outside of work, I enjoy spending time with my family. My wife and I have three children and two dogs. We like to spend time outdoors and enjoy camping around the region in our camper on some weekends. My wife and I also like to watch our alma mater, North Dakota State University, play football.\nSmith, a Media Fusion employee and the Marshall Star editor, supports the Marshall Office of Communications.\nPamela Bourque Named Chief Counsel at Marshall\nPamela Bourque has been named as chief counsel at NASA’s Marshall Space Flight Center. She has served as the center’s acting chief counsel since May, leading Marshall’s Office of the General Counsel team and overseeing the legal practice areas of procurement and contract law, partnerships and agreements, personnel law, ethics, fiscal law, employment law, intellectual property, and litigation.\nMarshall’s chief counsel is responsible for coordinating a full range of legal operations affecting the center and its organizations. The chief counsel also serves as a senior member of the NASA Office of the General Counsel’s enterprise leadership team.\nFrom 2022 to April 2023, Bourque was Marshall’s deputy chief counsel, assisting the chief counsel with managing the legal operations of the center. She also supported the NASA legal enterprise on various senior teams, including the Legal Leadership Board, the Ethics Best Practices Working Group, the Deputy Counsel Forum, and participated as a mentor in NASA’s attorney mentoring program.\nFrom 2005 to 2022, Bourque was the center’s assistant chief counsel for general law and litigation. She was the functional lead for litigation matters and provided Marshall management with legal advice and representation in the areas of personnel law, federal ethics standards, agreements, and other matters. Under her leadership, Marshall’s Ethics Program was recognized by the U.S. Office of Government Ethics with an Ethics Program Award.\nFrom 1993 to 2005, Bourque was an attorney-adviser at Marshall. She has previously served as president of the North Alabama Chapter of the FBA (Federal Bar Association), as well as the chair of FBA’s Labor Law Symposium for multiple years.\nBourque has been recognized with numerous NASA awards during her career, including the NASA Office of the General Counsel’s Meritorious Service Award, the NASA Exceptional Service Medal, the NASA Silver Achievement Medal, the NASA Space Flight Awareness Launch Honoree Award, the NASA Space Flight Awareness Silver Snoopy Award, the Marshall Engineering Directorate’s Service to Engineering Award, and other performance, on-the-spot, and peer awards. She has been profiled in Women at NASA.\nA native of Broussard, Louisiana, Bourque is a graduate of the U.S. Army Aviation and Missile Command’s Leadership Investment for Tomorrow (LIFT-II) Program, the Simmons Executive Leadership for Women/NASA Fellowship at Simmons College, the Department of Defense Mediator Certification Program, and she is currently enrolled in the Leadership of Greater Huntsville’s Connect Emerging Leaders Program.\nBourque earned a Juris Doctor degree from Tulane University School of Law in New Orleans, Louisiana, where she was a senior fellow. She received her honors baccalaureate degree from the University of Louisiana at Lafayette.\nShe lives in Madison with her husband, Max Patin. They have two children.\nThomas Percy Named Systems Engineering and Integration Manager for Human Landing System Program\nThomas Percy has been named as the SE&I (Systems Engineering and Integration) manager for the HLS (Human Landing System) Program at NASA’s Marshall Space Flight Center.\nThe SE&I office oversees the development and verification of requirements, cross-discipline insight into commercial lander providers, and cross-program integration. The HLS SE&I team is also responsible for integration with the Moon to Mars Program in the areas of mission development, general analyses, and requirements management.\nSince 2021, Percy has been the deputy SE&I manager for HLS. From 2020 to 2021, he was the integrated performance lead for HLS, managing the team within SE&I responsible for trajectory analysis, environments, performance assessment, mission development, and metric tracking.\nFrom 2016 to 2020, Percy was a space systems analyst prior to his role as chief architect of the Advanced Concepts Office at Marshall, where he supported the formulation of the HLS Program as well as transportation architecture studies for human Mars missions and the development of various robotic spacecraft concepts.\nPrior to joining NASA in 2016, Percy spent 13 years working in private industry at SAIC as a section manager and support contractor to Marshall and Johnson Space Center. He also was a part-time instructor in the Mechanical and Aerospace Engineering Department at the University of Alabama in Huntsville off and on from 2006-2021.\nHis honors include a NASA Group Achievement Award: Human Landing System Source Evaluation Panel; NASA Exceptional Service medal; NASA Silver Achievement Medal Group: Human Landing System Source Evaluation Panel; and a NASA Group Achievement Award: Mars Basis of Comparison Reference Team.\nA native of Easton, Massachusetts, Percy received a bachelor’s degree in mechanical engineering from Rochester Institute of Technology in Rochester, New York, a master’s in aerospace engineering from the Georgia Institute of Technology in Atlanta, Georgia, and a doctorate in aerospace systems engineering from the University of Alabama in Huntsville.\nHe and his wife, Erin, live in Madison. They have three children.\nMission Success is in Our Hands: Chelsi Cassilly\nMission Success is in Our Hands is a safety initiative collaboration between NASA’s Marshall Space Flight Center and Jacobs. As part of the initiative, eight Marshall team members are featured in new testimonial banners placed around the center. This is the second in a Marshall Star series profiling team members featured in the testimonial banners.\nChelsi Cassilly is a planetary protection microbiologist working for Jacobs at Marshall, where she’s been for almost three years. A native of Tennessee, she previously worked at Harvard Medical School in Boston, Massachusetts, as a postdoctoral fellow prior to joining Jacobs. She’s a graduate of Lipscomb University in Nashville, Tennessee, where she earned a bachelor’s degree in molecular biology, and of the University of Tennessee, Knoxville, where she earned a doctoral degree in microbiology.\n“It’s an honor and privilege to work for Jacobs and NASA,” Cassilly said. “I look forward to work every single day and consider myself exceptionally blessed with this opportunity I’ve been afforded.”\nQuestion: What are some of your key responsibilities?\nCassilly: I support many different projects at Marshall. Primarily I help projects implement planetary protection. This includes the Mars Ascent Vehicle, which is part of the Mars Sample Retrieval Lander; a mission concept for a Europa Lander; and the lunar Human Landing System. I also manage the Planetary Protection Lab at Marshall, which is a fully functional biosafety level 2 lab. Funded by multiple sources, including NASA ROSES (Research Opportunities in Space and Earth Science), Marshall Cooperative Agreement Notices, Marshall Technical Excellence funding, and Jacobs Innovation Grants, I have both completed and continue to support multiple smaller experiments to determine microbial abundance within materials as well as sterilization methods.\nQuestion: How does your work support the safety and success of NASA and Marshall missions?\nCassilly: NASA missions must meet the requirements laid out by headquarters. One subset of requirements on some missions is planetary protection, that is, preventing forward and backward microbial contamination. Marshall is involved with several missions where there are planetary protection requirements to meet. I help the center interpret and implement techniques to meet the requirements. I am currently the only point of contact for this discipline at Marshall, so I take seriously the responsibility of helping engineers understand unfamiliar terminology while also ensuring we are compliant with requirements, therefore helping achieve the goals of our missions.\nQuestion: What does the Mission Success is in Our Hands initiative mean to you?\nCassilly: It means that success is personal. It means every single one of us can contribute in large ways to mission success simply by being ethical and maintaining our integrity as workers and as individuals.\nQuestion: How can we work together better to achieve mission success?\nCassilly: We can support one another by encouraging safety, ethics, a culture of learning, ownership, and integrity within our teams. We can foster an environment where ownership is lauded and correction is not seen as negative, but rather as learning opportunities and areas of improvement. Benchmarking such progress of both individuals and teams, using mistakes and problems to propel us forward, will serve to strengthen teams, develop a sense of pride in our collective mission, and provide clear trajectory for our long-term efforts and goals.\nI am Artemis: Bruce Askins\nGrowing up, Bruce Askins was passionate about space and oceanography. His desire to explore other worlds always made him want to be an astronaut. Though he did not become an astronaut, Askins has built a 42-year career at NASA, and, as the infrastructure management lead for NASA’s SLS (Space Launch System) Program at the agency’s Marshall Space Flight Center, Askins is an integral part for the next generation of explorers.\nAskins and his team are the gatekeepers and protectors of data and responsible for both cyber- security and physical security for the SLS Program. Under Askins’ leadership, his team ensures all data is stored properly, that information about the rocket shared outside NASA is done with proper data markings, and access is given to those that need it.\nAskins wasn’t always familiar with the world of infrastructure and cyber security. As a mechanical engineering graduate from the University of Alabama in Huntsville, Askins began his career as part of NASA’s internship program. He considered himself imaginative, or “creatively driven,” which is why Askins originally pursued a career at NASA.\n“I always loved the design aspect of my early position in special test equipment,” Askins says. “Back then I drew everything by hand with a pencil before eventually transitioning to computers.”\nHis creativity and interest in underwater worlds, along with his scuba diver certification, led him to have a hand in designing early test elements for NASA’s Hubble Space Telescope. At the Neutral Buoyancy Simulator, a former underwater training facility at Marshall, Askins interacted with a crew of astronauts supporting Hubble and designed the flight simulation hardware used for crew training on the Canadarm2 robotic arm that is still a part of the International Space Station today.\nAskins has been a part of the NASA family for almost half a century and is thrilled to be a part of the next era of space exploration to the Moon under Artemis.\n“To explore is one of the greatest things that we can all do, and with the Artemis Generation the sky’s the limit,” Askins said.\nSLS is part of NASA’s backbone for deep space exploration, along with the Orion spacecraft, advanced spacesuits and rovers, the Gateway in orbit around the Moon, and commercial human landing systems. SLS is the only rocket that can send Orion, astronauts, and supplies to the Moon in a single launch.\nNASA’s Tech Demo Streams First Video from Deep Space via Laser\nNASA’s Deep Space Optical Communications experiment beamed an ultra-high definition streaming video on Dec. 11 from a record-setting 19 million miles away (or about 80 times the Earth-Moon distance). The milestone is part of a NASA technology demonstration aimed at streaming very high-bandwidth video and other data from deep space – enabling future human missions beyond Earth orbit.\n“This accomplishment underscores our commitment to advancing optical communications as a key element to meeting our future data transmission needs,” said NASA Deputy Administrator Pam Melroy. “Increasing our bandwidth is essential to achieving our future exploration and science goals, and we look forward to the continued advancement of this technology and the transformation of how we communicate during future interplanetary missions.”\nThe demo transmitted the 15-second test video via a cutting-edge instrument called a flight laser transceiver. The video signal took 101 seconds to reach Earth, sent at the system’s maximum bit rate of 267 Mbps (megabits per second). Capable of sending and receiving near-infrared signals, the instrument beamed an encoded near-infrared laser to the Hale Telescope at Caltech’s Palomar Observatory in San Diego County, California, where it was downloaded. Each frame from the looping video was then sent “live” to NASA’s Jet Propulsion Laboratory in Southern California, where the video was played in real time.\nDeep Space Optical Communications, or DSOC, a NASA technology demonstration riding aboard the Psyche space craft, is using advanced laser communication technology to transmit large amounts of data back to earth. DSOC is the latest in a series of optical communication demonstrations funded by the agency’s TDM (Technology Demonstration Missions) program office at NASA’s Marshall Space Flight Center.\n“We just demonstrated a highly advanced data transmission capability that will play an instrumental role in NASA’s boldest missions to deep space, and it shows that DSOC is functioning successfully in a relevant environment,” said Tawnya Laughinghouse, manager of the TDM program office at Marshall. “Streaming an ultra-high definition video from millions of miles away in deep space is no small feat.”\nThe laser communications demo, which launched with NASA’s Psyche mission Oct. 13, is designed to transmit data from deep space at rates 10 to 100 times greater than the state-of-the-art radio frequency systems used by deep space missions today. As Psyche travels to the main asteroid belt between Mars and Jupiter, the technology demonstration will send high-data-rate signals as far out as the Red Planet’s greatest distance from Earth. In doing so, it paves the way for higher-data-rate communications capable of sending complex scientific information, high-definition imagery, and video in support of humanity’s next giant leap: sending humans to Mars.\n“One of the goals is to demonstrate the ability to transmit broadband video across millions of miles. Nothing on Psyche generates video data, so we usually send packets of randomly generated test data,” said Bill Klipstein, the tech demo’s project manager at JPL. “But to make this significant event more memorable, we decided to work with designers at JPL to create a fun video, which captures the essence of the demo as part of the Psyche mission.”\nUploaded before launch, the short ultra-high definition video features an orange tabby cat named Taters, the pet of a JPL employee, chasing a laser pointer, with overlayed graphics. The graphics illustrate several features from the tech demo, such as Psyche’s orbital path, Palomar’s telescope dome, and technical information about the laser and its data bit rate. Tater’s heart rate, color, and breed are also on display.\n“Despite transmitting from millions of miles away, it was able to send the video faster than most broadband internet connections,” said Ryan Rogalin, the project’s receiver electronics lead at JPL. “In fact, after receiving the video at Palomar, it was sent to JPL over the internet, and that connection was slower than the signal coming from deep space. JPL’s DesignLab did an amazing job helping us showcase this technology – everyone loves Taters.”\nThere’s also a historical link: Beginning in 1928, a small statue of the popular cartoon character Felix the Cat was featured in television test broadcast transmissions. Today, cat videos and memes are some of the most popular content online.\nThis latest milestone comes after “first light” was achieved on Nov. 14. Since then, the system has demonstrated faster data downlink speeds and increased pointing accuracy during its weekly checkouts. On the night of Dec. 4, the project demonstrated downlink bit rates of 62.5 Mbps, 100 Mbps, and 267 Mbps, which is comparable to broadband internet download speeds. The team was able to download a total of 1.3 terabits of data during that time. As a comparison, NASA’s Magellan mission to Venus downlinked 1.2 terabits during its entire mission from 1990 to 1994.\n“When we achieved first light, we were excited, but also cautious. This is a new technology, and we are experimenting with how it works,” said Ken Andrews, project flight operations lead at JPL. “But now, with the help of our Psyche colleagues, we are getting used to working with the system and can lock onto the spacecraft and ground terminals for longer than we could previously. We are learning something new during each checkout.”\nThe Deep Space Optical Communications demonstration is the latest in a series of optical communication demonstrations funded by the TDM program under NASA’s Space Technology Mission Directorate and supported by NASA’s SCaN (Space Communications and Navigation) program within the agency’s Space Operations Mission Directorate.\nThe Psyche mission is led by Arizona State University. JPL is responsible for the mission’s overall management, system engineering, integration and test, and mission operations. Psyche is the 14th mission selected as part of NASA’s Discovery Program under the Science Mission Directorate, managed by the agency’s Marshall Space Flight Center. NASA’s Launch Services Program, based at the agency’s Kennedy Space Center, managed the launch service. Maxar Technologies in Palo Alto, California, provided the high-power solar electric propulsion spacecraft chassis.\nNASA Geologist Paves Way for Building on the Moon\nBy Jessica Barnett\nFor many at NASA’s Marshall Space Flight Center, a love – be it for space, science, or something else – drew them to the career they’re in today. For geologist Jennifer Edmunson, there were multiple reasons.\nHer love for geology dates back to her childhood in Arizona, playing in the mud, fascinated by the green river rocks she would find and how they fit together. As she grew older, her love for astronomy led her to study the regolith and geology of the Moon and Mars in graduate school.\nThat, in turn, led her to Marshall for her post-doctorate, where she studied how shock processes from meteorite impacts potentially affect scientists’ work to determine the age of rocks using different radioisotope systems. On her first day, she needed help from the center’s IT department, which is how she met Joel Miller, the man she now calls her husband.\n“I met him on April Fools’ Day, and he asked me out on Friday the 13th,” Edmunson recalled. “I knew I needed to get a stable job, so I got a job as the junior geologist on the simulant team here at Marshall. That was back in 2009.”\nFourteen years later, they still work at Marshall. He’s now the center’s acting spectrum manager, and she manages the MMPACT (Moon-to-Mars Planetary Autonomous Construction Technology) project. Through MMPACT, Marshall is working with commercial partners and academia to develop and test robotic technology that will one day use lunar soil and 3-D printing technology to build structures on the Moon.\n“It’s phenomenal to see the development of the different materials we’ve been working on,” Edmunson said. “We started with this whole array of materials, and now we’re like, ‘OK, what’s the best one for our proof of concept?’”\nNASA aims for a proof-of-concept mission to validate the technology and capability by the end of this decade. This mission would involve traveling to the Moon to create a representative element of a landing pad.\nMMPACT aims to build lunar infrastructure using the materials readily available on the Moon. This process, known as in-situ resource utilization, allows NASA engineers to use lunar regolith, fine-grained silicate minerals thought to be available in a layer between 10 to 70 feet deep on the lunar surface, to build different structures and infrastructure elements.\nHowever, regolith can’t be used like cement here on Earth, as it wouldn’t solidify in the low-pressure environment. So, Edmunson and her team are now looking at microwaves and laser technology to heat the regolith to create solid building materials.\nAfter successfully building a full-scale landing pad on the Moon, MMPACT will likely focus on a vertical structure, like a garage, habitat, or safe haven for astronauts.\n“The possibilities are endless,” she said. “There is so much potential for using different materials for different applications. There’s just a wealth of opportunity for anyone who wants to play in the field, really.”\nEdmunson hopes to get more lunar regolith first, as NASA is still working with samples from the Apollo missions and simulants based on those samples. She’s also looking forward to Artemis bringing back samples from different parts of the lunar surface because it will provide her team with a wider pool of regolith samples to analyze.\n“We want to learn more about different locations on the Moon,” she said. “We have to understand the differences and how that might affect our processes.”\nKnowing this will make it easier not just to build landing pads and habitats but to build roadways and the start of a lunar economy, Edmunson said.\n“I want there to be sufficient structures there to make things safe for crew, so if we want to build a hotel on the Moon, we could,” she said. “We could have tourists going there, mining districts pulling rare Earth elements from the Moon. We could do that and get a lot of resources that way. I want science to progress, things like building a radio telescope on the far side of the Moon. I want more information on more of the different sites around the Moon, so we can get a be`tter understanding of how the Moon formed and the history of the Moon. We’ve only scratched the surface there.”\nThere are parts of the Moon that can only be explored in detail by visiting in person, Edmunson explained, and she’s excited to be working at Marshall as that exploration is made possible.\n“It’s awesome to be part of this. Honestly, it’s the reason I get out of bed in the morning,” she said. “I was born in ’77, so I missed the Apollo lunar landings. I would love to see humans on the Moon in my lifetime, and on Mars would just be amazing.”\nHer advice is simple to anyone considering a career like hers: Just go for it.\n“A lot of it comes down to passion and tenacity,” she said. “If you really love what you do and you get to do it every day, you find more enjoyment in your career. I feel like I’m making a difference, and with surface construction at such an infant kind of stage right now, I feel like it’s a contribution that will last for a very long time.”\nBarnett, a Media Fusion employee, supports the Marshall Office of Communications.\nSprightly Stars Illuminate ‘Christmas Tree Cluster’\nA new image of NGC 2264, also known as the “Christmas Tree Cluster,” shows the shape of a cosmic tree with the glow of stellar lights. NGC 2264 is, in fact, a cluster of young stars – with ages between about one and five million years old – in our Milky Way about 2,500 light-years away from Earth. The stars in NGC 2264 are both smaller and larger than the Sun, ranging from some with less than a tenth the mass of the Sun to others containing about seven solar masses.\nThis new composite image enhances the resemblance to a Christmas tree through choices of color and rotation. The blue and white lights (which blink in the animated version of this image) are young stars that give off X-rays detected by NASA’s Chandra X-ray Observatory. Optical data from the National Science Foundation’s WIYN 0.9-meter telescope on Kitt Peak shows gas in the nebula in green, corresponding to the “pine needles” of the tree, and infrared data from the Two Micron All Sky Survey shows foreground and background stars in white. This image has been rotated clockwise by about 160 degrees from the astronomer’s standard of North pointing upward, so that it appears like the top of the tree is toward the top of the image.\nYoung stars, like those in NGC 2264, are volatile and undergo strong flares in X-rays and other types of variations seen in different types of light. The coordinated, blinking variations shown in this animation, however, are artificial, to emphasize the locations of the stars seen in X-rays and highlight the similarity of this object to a Christmas tree. In reality, the variations of the stars are not synchronized.\nThe variations observed by Chandra and other telescopes are caused by several different processes. Some of these are related to activity involving magnetic fields, including flares like those undergone by the Sun – but much more powerful – and hot spots and dark regions on the surfaces of the stars that go in and out of view as the stars rotate. There can also be changes in the thickness of gas obscuring the stars, and changes in the amount of material still falling onto the stars from disks of surrounding gas.\nNASA’s Marshall Space Flight Center manages the Chandra program. The Smithsonian Astrophysical Observatory’s Chandra X-ray Center controls science operations from Cambridge, Massachusetts, and flight operations from Burlington, Massachusetts.\nNASA’s 3D-printed Rotating Detonation Rocket Engine Test a Success\nNASA has achieved a new benchmark in developing an innovative propulsion system called the Rotating Detonation Rocket Engine (RDRE). Engineers at NASA’s Marshall Space Flight Center successfully tested a novel, 3D-printed RDRE for 251 seconds (or longer than four minutes), producing more than 5,800 pounds of thrust.\nThat kind of sustained burn emulates typical requirements for a lander touchdown or a deep-space burn that could set a spacecraft on course from the Moon to Mars, said Marshall combustion devices engineer Thomas Teasley, who leads the RDRE test effort at the center.\nRDRE’s first hot fire test was performed at Marshall in the summer of 2022 in partnership with In Space LLC and Purdue University, both of Lafayette, Indiana. That test produced more than 4,000 pounds of thrust for nearly a minute.\nThe primary goal of the latest test, Teasley noted, is to better understand how to scale the combustor to different thrust classes, supporting engine systems of all types and maximizing the variety of missions it could serve, from landers to upper stage engines to supersonic retropropulsion, a deceleration technique that could land larger payloads – or even humans – on the surface of Mars.\n“The RDRE enables a huge leap in design efficiency,” he said. “It demonstrates we are closer to making lightweight propulsion systems that will allow us to send more mass and payload further into deep space, a critical component to NASA’s Moon to Mars vision.”\nEngineers at NASA’s Glenn Research Center and Venus Aerospace of Houston, Texas, are working with Marshall to identify how to scale the technology for higher performance.\nRDRE is managed and funded by the Game Changing Development Program within NASA’s Space Technology Mission Directorate.",
  "word_count": 6100,
  "scraped_at": "2026-02-14T13:10:13.558033"
}