{
  "article_id": "f638dbd51db4",
  "url": "https://theathletic.com/4524654/2023/05/17/manchester-united-sale-sir-jim-ratcliffe-sheikh-jassim-and-what-were-hearing/",
  "title": "Manchester United sale : Sir Jim Ratcliffe , Sheikh Jassim and what were hearing",
  "date": "20230517T063000Z",
  "domain": "theathletic.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "It is 176 days into the Glazer family’s proposed, protracted sale of Manchester United and there might finally be light at the end of the tunnel.\nAs ever in a process that has meandered in various directions, with plenty of contradictory claims along the way, scepticism is a useful companion. But several sources close to the deal, who like others in this article will remain anonymous to protect business relationships, are now reporting confidence from Sir Jim Ratcliffe’s team that his INEOS bid will be successful.\nAdvertisement\nNotably, in a new development, bankers associated with past acquisitions by petrochemicals giant INEOS were very recently instructed to pull together specific financing for the United bid, indicating an advanced stage of talks.\nAt United’s Carrington training ground and their Old Trafford stadium, staff have been asked to dig out facts and figures that would be used for due diligence.\nSir Dave Brailsford, the former British Cycling chief who is a crucial figure in Ratcliffe’s team, has let his optimism be known.\nThe INEOS mindset is one thing; the crucial element, however, is what the Glazers decide to do. And, on Tuesday evening came another twist in the tale. Those representing Sheikh Jassim Bin Hamad Al Thani’s Qatari bid claimed an improved offer had gone in for the whole club.\nGiven neither Ratcliffe nor Sheikh Jassim, the two parties interested in gaining control of United, had heard back officially over their third bids, lodged on April 28, the reason for the offer tabled on Tuesday (as purported by Sheikh Jassim’s representatives) could lie in back-channel dialogue and the Qataris fearing they were going to miss out without making one final attempt. What happens now remains to be seen, but the end-game is at least in sight.\nThe sense things had up to that point been heading in the direction of the 70-year-old from Failsworth, some four miles north east of Manchester city centre, comes from financiers who have spoken recently to counterparts at Raine, the merchant bank handling the search for “strategic alternatives”, and is strengthened by a mystique around Sheikh Jassim.\nGO DEEPER\nManchester United takeover: How local lad Sir Jim Ratcliffe built a business empire\nSome at Raine are surprised there has been no direct contact with the man central to the Qatari proposal, even at this late stage in proceedings. Representatives for Sheikh Jassim say he is not someone who wants to be in the public eye — the handful of photographs of him available online are evidence of this — and it would have felt presumptuous to make himself visible.\nAdvertisement\nBut this is now a crunch point in what could be a once-in-a-generation opportunity to own United and the lack of dialogue with Sheikh Jassim is regarded as notable by those involved.\nRatcliffe attended the tour of Old Trafford and Carrington in person, alongside Brailsford. Sheikh Jassim instead sent a group including Shahzad Shahbaz, president of the Nine Two Foundation, which would be the vehicle for his takeover, and Fady Bakhos, the most senior personal adviser to the Qatari royal.\nBut some believe that level of privacy means the Premier League would take longer in ratifying a Qatari takeover, making the deal less appealing to those Glazer siblings who want to cash out immediately. The club’s co-chairmen, Avram and Joel Glazer, are known to be the most reluctant to sell up, while Bryan, Edward and Kevin Glazer, as well as their sister, Darcie Glazer Kassewitz, are eager to bank their shares. On this theme, interrogation of bidders’ ultimate source of wealth has already been part of the process.\nPerhaps less importantly but nevertheless intriguingly, there has been a distinct lack of harmony in conversations involving Raine and Sheikh Jassim’s camp.\nFrom the outset, sources connected to Qatar expressed doubts about whether the Glazers actually wanted a full sale and there have since been accusations of inaccurate briefings by both sides. “Pointing fingers,” as one person involved described the situation.\nFor the second round of bids, on March 23, there are different versions of what happened around the extended deadline.\nThose speaking on behalf of Sheikh Jassim initially claimed a revised offer had been made, but then said this was withdrawn after Raine communicated a request by Ratcliffe’s team for more time. Staff at Raine say the Qataris told them two days before that they wouldn’t hit the deadline, which was accepted, and INEOS only asked for a 12-hour extension a day later. Raine says it did not inform Sheikh Jassim’s camp of this.\nAdvertisement\nThis kind of tit-for-tat has extended to claims around the size of Sheikh Jassim’s third bid. There is a dispute on whether it was more or less than £5billion.\nAccording to Qatari representatives, all their bids, as well as the one they claimed had been made on Tuesday, have included wiping United’s debt, which at a minimum is £535.7million — the amount placed on the club by the Glazers in their 2005 leveraged takeover. That would be money that does not go to any of the siblings, which is a factor to consider. Sheikh Jassim’s camp also say there is a commitment of several hundred million pounds for investment in the stadium and local community on top of the bid amount.\nSquabbles behind the scenes would not usually be of significance, but given this late stage, the tone has suggested there needed to be a drastic change for an agreement to follow. One source also claimed the friction had prompted those in Sheikh Jassim’s circle to go direct to the Glazers at least once. Perhaps this fresh bid is the result of that.\nConversely, the noises around Ratcliffe’s bid have been positive, which is a turnaround given the initial doubt in some quarters about his approach and scope of funding. Raine and Ratcliffe also had what people call a “chequered history” after his late entrance into the Chelsea bidding a year ago.\nRatcliffe tabled a last-minute offer to buy Chelsea last May — despite Raine, which was also charged with facilitating that sale, having already established a shortlist of four consortiums.\nThe crucial point with United, however, appears to have been the third bids.\nAny anticipated raise from Sheikh Jassim did not materialise, while reports surfaced of Ratcliffe proposing a deal that would see him gain a majority of slightly more than 50 per cent and allow Joel and Avram Glazer to stay on as minority shareholders. The Glazers currently own roughly 69 per cent of the club, with about 31 per cent of shares held by non-family members, the vast majority of them by institutional investors.\nAdvertisement\nRatcliffe’s representatives are remaining tight-lipped on his bid, but rebuttals on this aspect could be expected given how toxic an association with the Glazers would be.\nThat Ratcliffe’s proposal values United shares at a higher price than the Qatari bid, even now, has not been disputed by anybody. He has greater flexibility to pay more per share because he is not planning to straightaway buy 100 per cent of club stock, nor pay off the debt. His commitment would be about 51 per cent of the overall club value, which, at £6billion, would be £3.06bn — in the same ballpark as the £2.5bn bid he made for Chelsea, which had an additional promise of £1.75bn investment into the London club over the following 10 years. In that scenario, there is a big difference in immediate outlay between the parties.\nOne reading, expressed by several observers, is that Ratcliffe would buy out the four siblings most wishing to sell — Bryan, Kevin, Edward and Darcie — at a price above market value (a £5billion bid equates to $32.5 per share; current market price is $18.85). This would let Joel and Avram stay at a 20 per cent level to accede to their desire to keep some hold on the club and also so the takeover does not cost Ratcliffe or INEOS as much money immediately.\nThe Glazers would have to strike an agreement that their Class B shares do not convert to Class A ones in order for Ratcliffe to actually have control. Class B shares are worth 10 times the voting rights of Class A versions and automatic conversion is written into the stock offering at present.\nUK TV channel Sky News has reported Ratcliffe’s bid includes what are known as put-and-call options, which would make sense as an exit route for Joel and Avram.\nAn investor with shares in United explains: “A put option probably means Joel and Avram can force INEOS to buy their shares at a minimum price at some point in the future — for instance, $30 per share, which protects them from losing money from here. The call option for INEOS probably means they can buy the Glazer shares at a higher price, $45 per share for example, anytime before a certain date, say 2026. This is a way for Joel and Avram to protect their downside while having a viable path to get out.”\nThat would guard against the situation Alisher Usmanov found himself in at Arsenal when he had 30 per cent of the club in 2011 but no influence because Stan Kroenke owned more than 60 per cent. Usmanov eventually sold to Kroenke five years ago.\nAdvertisement\nHolding 20 per cent without put-and-call agreements could leave Joel and Avram holding stock of less value, even if they might still be curiously enticed by the simple prestige of having a stake in United. Avram attended the Women’s FA Cup final defeat by Chelsea at Wembley last weekend, having also been there for the men’s side’s Carabao Cup final win over Newcastle United in February.\nThe risk otherwise is explained by the investor. “I can’t see Qatar, or another state, buying only 20 per cent,” they say. “Private equity won’t be interested in shares with no financial return, so this would give Joel and Avram an exit route at a higher price than the market value.”\nTrying to sell on the open market would see the shares almost halve in value. The general trend of the stock is downwards since news emerged that Ratcliffe’s bid had serious momentum because he intends to leave the 31 per cent the Glazers don’t own on the market for the time being. The share price has been below $20 for a fortnight, significantly below the all-time of $27 in February, suggesting investors have gradually been losing faith in their prospect of ever receiving a souped-up offer for their shares.\nThe proposed Ratcliffe arrangement has led to financiers pointing out how little upside there has been for anyone buying United shares since the IPO launch of 2012. There is some anger at a deal that would cut them out.\nOthers in the industry have scoffed that only one full bidder has been brought to the table, removing any competitive tension.\nSeveral sources have been taken aback by the length of time this process has taken. US hedge fund Elliott’s acquisition of AC Milan, by contrast, took a matter of weeks. Elliott and fellow American organisations Ares, Carlyle and Sixth Street have offered minority investments in United.\nInvested observers speculate all the weeks and months point to disagreements among the six Glazer siblings, with Joel and Avram also changing their minds, which is why until the paperwork is signed, there will be doubt about the conclusion. Some feel giving Ratcliffe the impression of success could be a final method of squeezing the Qataris.\nAdvertisement\nThose involved in Sheikh Jassim’s bid say they are not giving up, as this latest apparent bid demonstrates. Whether it is the final one depends, according to sources, on what feedback they now receive. The fact he has not blown Ratcliffe out of the water adds weight to claims it is a private enterprise rather than a state-sanctioned move. People who work with Qatar accept something of this magnitude would require tacit acceptance from the Gulf nation’s ruling family, but argue there is not a blank cheque to write.\nSheikh Jassim’s father, Sheikh Hamad, the former prime minister of Qatar, described any football bid as an “investment” not “advertisement”.\nSo, as one source with an understanding of the Qatari viewpoint put it, bending to “Glazer greediness” is not on the agenda.\nAdditional contributors: Dan Sheldon, Matt Slater & James Horncastle\n(Top photo: Michael Regan/Getty Images)",
  "word_count": 2063,
  "scraped_at": "2026-02-14T13:00:03.676930"
}