{
  "article_id": "f664161879c4",
  "url": "https://www.rollbamaroll.com/2025/5/13/24429080/jumbo-package-ncaa-approves-new-rule-changes-for-2025",
  "title": "Jumbo Package : NCAA Approves new Rule Changes for 2025",
  "date": "20250513T173000Z",
  "domain": "rollbamaroll.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "First of all, check out this stat:\nJumbo Package: NCAA Approves new Rule Changes for 2025\nAlabama has fallen victim to false claps many times the last couple of years, so at least one of these rules will be a welcome change.\nOn Monday, May 12, Alabama announced its Academic Progress Rate of 998, which was the highest in the SEC and the second-highest in the country. The team’s cumulative GPA of 3.29 was also the highest in program history with 103 players on the team earning above a 3.0.\nLong gone are the days of opposing fanbases claiming that Alabama had low academic standards for football players. Last year, Jalen Milroe won the academic Heisman award, and on top of that, the team set a program record on cumulative GPA, plus led the SEC and was 2nd in the country.\nIt may be increasingly feeling like semi-pro ball, but all of these players are simultaneously getting a college degree, and that’s still worth a whole lot.\nIn football, ESPN only ranked Alabama’s incoming class of freshmen and transfers as #15 overall:\nTop impact recruits: CB Dijon Lee Jr, OT Jackson Lloyd, S Ivan Taylor, QB Keelon Russell, WR Lotzeir Brooks\nNick Saban set an incredibly high bar in recruiting. So far, Kalen DeBoer has met that high standard. He signed two five-stars who could contribute in 2025. At 6-foot-4, Lee has elite length and very smooth movements for his size at corner. He’ll be tough to keep out of the mix, even if Alabama returns two starters.\nAlabama returns multiple offensive line starters, but Lloyd and Michael Carroll are competing for open spots at left guard and right tackle. At a minimum, they should factor into the offensive line two-deep.\nQuarterback Ty Simpson enters as the likely starter on a similar timeline to Bryce Young, who was a reserve in his first season in Tuscaloosa. Russell could follow a similar path, but he was one of the most talented prospects in the 2025 class regardless of position.\nTop transfers: WR Isaiah Horton, CB Cameron Calhoun, LB Nikhai Hill-Green, OL Kam Dewberry, DL Kelby Collins\nIn the portal, Alabama added some experience at multiple spots. Calhoun’s arrival from Utah only strengthens the cornerback unit. Horton caught 56 passes for Miami last season and should be productive in a starting role. While the Tide have a freshman option, 2022 ESPN 300 offensive lineman Dewberry (Texas A&M) will likely take over Tyler Booker’s left guard spot. Hill-Green, a Colorado transfer, is also plenty experienced and could step into multiple roles on Alabama’s defense, even if he doesn’t win the starting job outright.\nESPN seems to be giving much more value to transfers over freshmen here. The Tide is ranked #21 by 247Sports’ portal rankings, but #3 in freshman recruits. It’s an interesting exercise, and could indicate which teams have the best chance for improvement in 2025. Of course, what that doesn’t take into account is the baseline talent of the team and the lost talent leaving 2025.\nIf you want a little bit of hater in your life, On3’s J.D. PicKell is not a believer in the Tide.\nWhile its a bit aggressive, he’s not wrong. Kalen DeBoer’s (and therefore, Alabama’s) offense hinges on QB play. This isn’t a Lane Kiffin system that works around the QB... It’s one that asks a lot of the signal caller, and while the ceiling of the offense is very high, it also depends greatly on that one guy being up to the challenge.\nCan Ty Simpson, Keelon Russell, or Austin Mack do it better than Jalen Milroe did? It’s possible. And it’s just as likely they can’t.\nTuscaloosa News has a nice breakdown of the upcoming rule changes for the 2025 season:\nMcDaid also addressed changes to punt formations where no offensive player can be in direct line of the snap to the kicker, making it more “obvious” that a kick will be made. And on kickoff returns, the “T” signal will now be valid to cancel a return attempt.\nIn 2025, SEC defenses will not be able to simulate action before the snap, saying the “criteria” and “frame of judgement” will be judged “tighter,” and that a hand-clap cadence is solely reserved for offenses, with the words “shift” or “move” will be only for defenses.\nFor once, I mostly agree with them. The quick summary:\n- Discourage fake injuries: Players going down with injury after the ball is down and refs are set will cost a team a timeout, regardless of situation.\n- Less timeouts in overtime: After the 3rd overtime, each team only gets one more timeout for the rest of the game\n- Replay “lack of evidence”: No longer will replays stand as called due to no video evidence. It will either be “upheld” or “overturned.”\n- Less trickery on punts: Someone can’t stand between the snapper and the punter. (I do not understand the intent of this one)\n- No faking a fair catch: Teams have been using a “T” signal on kickoffs to let the ball go through the endzone, and South Carolina took advantage of that on a trick play last year. So now the “T” is officially the same as a fair catch.\n- Reducing Defenses faking snap counts: Clapping is now universally reserved for offense. No more ambiguity on defenses making offensive players false start with false snaps.\nLast week, Alabama added an official camouflage pattern to its Crimson Tide Outdoors program. Four athletes are serving as ambassadors through an NIL partnership with the school’s collective, Yea Alabama.\nFootball players Ty Simpson and Bray Hubbard headline the partnership, along with softball catcher Marlie Giles and women’s basketball guard Karly Weathers, and they all will receive a portion of the royalties. They showed off the two new colors – “Tree Tide” and “Tusk” – as part of marketing initiatives around the NIL deal. Additional athletes will join the initiative, as well.\nI’m not sure there’s anything more Alabama than this.\nRoll Tide!",
  "word_count": 1004,
  "scraped_at": "2026-02-14T13:20:45.170464"
}