{
  "article_id": "f664b4856165",
  "url": "https://www.ksat.com/news/2025/02/09/the-latest-eagles-soaring-over-chiefs-at-super-bowl/",
  "title": "The Latest : Eagles soaring over Chiefs at Super Bowl",
  "date": "20250210T024500Z",
  "domain": "ksat.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "NEW ORLEANS – The Philadelphia Eagles have spoiled the Kansas City Chiefs' bid for a three-peat, winning the Super Bowl 40-22.\nHere's the latest:\nRecommended Videos\n___\nWill Travis Kelce retire?\nThe Chiefs wasted no time turning their attention to next season.\nWhether that will include Travis Kelce remains to be seen. The star tight end has been noncommittal about retirement, and Mahomes said he would give his good buddy the time and space necessary to make that decision.\n“He’s given so much to this team and to the NFL and been such a joy, not only for me to work with, but for people to watch. And so he knows he still has a lot of football left in him,” Mahomes said. “I know he still has love for the game, and he’ll get to spend some time with his family and make that decision on his own. But I mean, he knows he’ll come back here with welcome arms out. We love that guy.”\nHalftime show disruptor was part of field cast, NFL says\nThe person who disrupted the halftime show by displaying a flag was part of the 400 member field cast, the NFL says.\n“The individual hid the item on his person and unveiled it late in the show,” the NFL said in a statement. “No one involved with the production was aware of the individual’s intent.”\nRoc Nation, the entertainment company which produced the show, said the act “was neither planned nor part of the production and was never in any rehearsal.”\nYour Super Bowl 2026 favorites: The Eagles (of course)\nBetMGM Sportsbook has installed the Eagles as favorites (+650) to win next year’s Super Bowl, with Baltimore (+700) the second choice.\nBuffalo (+750), Kansas City (+750) and Detroit (+850) round out the top-five favorites for next season.\nLaughter dominates Super Bowl ads\nWhile the Eagles dominated the Chiefs, laughter dominated the commercials.\nEugene Levy’s eyebrows flew off and buzzed around after he ate some Little Caesars. Four old ladies went on a joy ride in a commercial for WeatherTech, while sloths had a case of the Mondays in an ad for Coors Light.\nAnd British singer Seal became an actual seal, sad that he couldn’t hold Mountain Dew with his flippers.\nStill, some ads had more serious messages. Pharmaceutical company Novartis urged women to get early detection for breast cancer, while Dove spotlighted the problem of low body confidence in young girls.\nAnd to no surprise, Hurts is MVP\nHurts is the Super Bowl MVP after throwing for 221 yards and two scores, plus running for 72 yards and another score.\nHurts: ‘I couldn’t do any of these things without the guys around me’\nHurts is forever a Super Bowl winner now, but he lauded Philadelphia’s defense in his on-field interview with Fox.\n“Defense wins championships,” Hurts said.\nHe also deflected credit to all his teammates: “I couldn’t do any of these things without the guys around me.”\nSirianni lifts up son, shares an “E-A-G-L-E-S” chant\nAt the end of Sirianni’s post-Super Bowl interview with Fox, he embraced his family and lifted one of his kids to his shoulder — leading an “E-A-G-L-E-S” chant.\nSirianni to Fox: ‘This is the ultimate team game’\nSirianni called football “the ultimate team game” in his post-Super Bowl interview.\n“You can’t be great without the greatness of others,” he said.\nSirianni said the Eagles didn’t care what people thought about their path this season.\n“All we wanted to do is win,” Sirianni said, later adding, “these guys did not want to let each other down.”\nEAGLES WIN: Philadelphia takes Super Bowl\nIt’s over. Philadelphia has won the Super Bowl, beating Kansas City 40-22 behind 221 passing yards, two passing TDs and one rushing score from quarterback Jalen Hurts.\nSCORE UPDATE: Eagles 40, Chiefs 22\nThe 2-point conversion is good. It’s 40-22 with 1:48 remaining.\nWorthy has eight catches for 157 yards and two scores for the Chiefs.\nEarliest Gatorade bath ever? (the color was yellow)\nNick Sirianni got hit with the Gatorade with 2:52 remaining, which might be the earliest victory bath for a coach in a long time.\nAlso, for those betting on such things (because you could): The Gatorade was yellow.\nHere’s the most recent three-peat teams in the major US pro sports\nKansas City isn’t getting it done, so there’s never been a three-peat champion in the Super Bowl era.\nThe most recent three-peat champions in the other major U.S. pro leagues:\n1. NBA -- the Los Angeles Lakers, 2000-02\n2. MLB -- the New York Yankees, 1998-2000\n3. NHL -- the New York Islanders, 1980-83 (a four-peat)\nTaco Bell airs customer photos for its Super Bowl spot\nLeBron James and Doja Cat made brief appearances in Taco Bell’s ad for the Super Bowl this year, but the fast food chain focused on its fans who aren’t celebrities.\nThe ad featured nearly 400 photos of Taco Bell customers, from more than 3,000 who drove photobooth cameras at the chain’s drive-ins this past December, according to the company.\nSCORE UPDATE: Eagles 40, Chiefs 14\nThe 2-point conversion is good and the Chiefs are within 26 points with 2:54 left, pretty much ensuring this won’t be the worst Super Bowl loss in the game’s history.\nTOUCHDOWN: Mahomes throws to Hopkins, Chiefs score late in the 4th\nMahomes has found DeAndre Hopkins for a touchdown, with 2:54 left in the game.\nOther than NFC East cities, here’s where the Eagles will visit in 2025\nPhiladelphia always plays NFC East rivals Dallas, Washington and the New York Giants home-and-away.\nHere’s where the (soon-to-be) Super Bowl champions will also visit next season: The Eagles will play at Buffalo, Green Bay, Los Angeles (against the Chargers), Minnesota ... and, yes, Kansas City.\nJake Elliott is perfect\nEagles kicker Jake Elliott had been shaky this season before the Super Bowl.\nHe was 28 of 36 in the regular season, making just 1 of 7 field goals from beyond 50 yards. He was 6 for 7 on field goals in the playoffs but missed three extra points.\nAgainst the Chiefs, Elliott made his first eight kicks, including field goals of 48, 29, 48 and 50 yards.\nMiami Heat will be disappointed by this result\nThere’s not going to be a three-peat by the Kansas City Chiefs.\nAnd that means no big party for ... the Miami Heat? Let’s explain.\nHeat President Pat Riley owns some “Three-Peat” trademarks after beginning to file for them in the late 1980s, when the Los Angeles Lakers — who he was coaching at that time — were seeking three consecutive NBA titles.\nRiley struck a deal with the Chiefs on three-peat usage, but there won’t be a three-peat, much to the dismay of the Heat.\n“I know he’ll bring out the best wine and hopefully have a great organizational party on behalf of the great Pat Riley,” Heat coach Erik Spoelstra said.\nHeat forward Kevin Love also was hoping Riley would cash in and gift the Heat some wine after a Chiefs win. Alas, no three-peat. Maybe Riles will spring for some wine anyway.\nSCORE UPDATE: Eagles 40, Chiefs 6\nAnother field goal. It’s 40-6 Eagles with 8:01 left in the Super Bowl.\nHarrison Ford talks about life’s ‘owner’s manual’ for Jeep\nFilm legend Harrison Ford headlines the Jeep brand’s 2025 Super Bowl commercial\nA two-minute ad from Jeep takes a more serious tone, enlisting Harrison Ford to talk about freedom.\nNo single definition emerges — and at one point, Ford says, “Freedom is yes. Or no. Or maybe.”\nThe actor encourages viewers to write their own “owner’s manual” of their lives.\n“We won’t always agree on which way to go, but our differences will be our strength,” Ford says in the spot. He later adds: “This Jeep makes me happy, even though my name is Ford.”\nSCORE UPDATE: Eagles 37, Chiefs 6\nElliott has connected again on a field goal, and Philadelphia’s lead is 37-6 with 9:51 left to play.\nThe biggest Super Bowl blowout? A 45-point romp\nThe Eagles are rolling tonight, but as of now it’s not the biggest Super Bowl blowout in history.\nNot even close.\nThe biggest Super rout was Jan. 28, 1990, when San Francisco beat Denver 55-10.\nMaybe New Orleans is the city for blowout wins. That 55-10 game was also at the Superdome.\nKendrick dropped key word from ‘Not Like Us’ but kept plenty in\nKendrick Lamar’s cleaned-up-for-TV version of “Not Like Us” left out the usual slurs and swear words during his halftime performance.\nHe also skipped the key word “pedophile” during the ruthless Drake diss track. But he kept similar lines in the Grammy-winning song including “I hear you like ’em young” and “Tryna strike a chord and it’s prolly A minor.”\nDrake, who is touring in Australia, sued the record label he shares with Lamar over the track, calling its allegations false, inflammatory, shocking and dangerous.\nBrady ‘roasts’ Kevin Hart\nKevin Hart got a lot of shots in on Tom Brady during the infamous Netflix roast of the seven-time Super Bowl winner last year.\nBrady took a shot of his own during the Super Bowl.\n“Kevin Hart’s here? How did the cameras find Kevin Hart?” Brady asked, making a height joke toward the rather diminutive comic.\nEND OF THIRD QUARTER: Eagles 34, Chiefs 6\nPhiladelphia is one quarter away from a Super Bowl title. The Eagles had the ball to open the fourth quarter and have a four-touchdown lead.\nJalen Hurts is 15 of 20 for 201 yards and two passing yards.\nNike, NFL spotlight women in sports in their Super Bowl ads\nNike put the spotlight on women in sports this Super Bowl — in a spot featuring Caitlin Clark, Sha’Carri Richardson, Sabrina Ionescu, Jordan Chiles, A’ja Wilson and Sophia Wilson.\nThe spot lists all the “cant’s” that female athletes face and encourages them to prove people wrong and “Just Do It” anyway.\n“You can’t win. So win,” the ad, which is narrated by Doechii, says.\nMeanwhile, in an ad after halftime, the NFL centered girls’ sports in schools. The league called for girls flag football to become a varsity sport in all 50 states.\nSCORE UPDATE: Eagles 34, Chiefs 6\nThe Chiefs tried a 2-point conversion pass to Travis Kelce, but it failed. It’s 34-6 late in the third quarter.\nTOUCHDOWN: The Chiefs are on the board\nXavier Worthy made a diving 24-yard catch for a touchdown and Kansas City is on the board late in the third quarter.\nThe odds, as you might guess, have taken a big turn\nKansas City was favored by 1.5 points entering this Super Bowl.\nThe current line, according to BetMGM Sportsbook: Philadelphia by 29.5.\nAnd the money line is off the board, since the books are convinced the Eagles will win this game.\nDeVonta Smith gives Alabama its first Super Bowl points ever\nAlabama gets on the Super Bowl scoreboard for the first ever.\nThe 46-yard touchdown catch by DeVonta Smith marked the first time a player who ended his college career at Alabama scored a point in a Super Bowl. While former Crimson Tide QBs Bart Starr and Ken Stabler threw TD passes in a Super Bowl, they don’t get credit for scoring the points.\nThere are 144 colleges who have had a player score in a Super Bowl before the 12-time AP champion Alabama joined the list.\nSCORE UPDATE: Eagles 34, Chiefs 0\nThe kick is good and the rout continues, Philadelphia now up 34-0.\nTOUCHDOWN: Hurts connects with DeVonta Smith for 46-yard TD\nOne play, 46 yards, and this seems very over now. Jalen Hurts just found DeVonta Smith for another Philly touchdown.\nHäagen-Dazs reunites ‘Fast and Furious’ stars\nIn typical Super Bowl fashion, the celebrity reunions during ad breaks keep coming.\nHäagen-Dazs reunited “Fast & Furious” stars Michelle Rodriguez, Vin Diesel and Ludacris in its spot during the third quarter. But this time, they’re driving going slow — to enjoy the brand’s ice cream bars.\nIt wouldn’t be the Super Bowl without some nostalgia, and bringing former onscreen co-stars back together is a tried-and-try approach. Earlier in the night, Hellmann’s also brought back Meg Ryan and Billy Crystal’s “When Harry Met Sally” characters to enjoy another sandwich at Katz’s Deli.\nKendrick Lamar’s halftime setlist\nKendrick Lamar’s 13-minute halftime set leaned heavily on the past year, with half of the songs in his 10-song set coming from his 2024 album “GNX.” Here’s are all the songs he included:\n“Squabble Up” “Humble” “DNA” “Euphoria” “Man at the Garden” “Peekaboo” “Luther featuring SZA” “All the Stars featuring SZA” “Not Like Us” “TV Off”\nReview: Kendrick’s halftime performance another victory lap\n“Salutations!,” the actor Samuel L. Jackson dressed as Uncle Sam introduced Kendrick Lamar at New Orleans’ Caesars Superdome for the Super Bowl halftime show.\nIt was a powerful, commanding creative choice by the first solo hip-hop artist to ever headline the coveted slot. As if there were any doubts of the Pulitzer Prize winning rapper’s ability to put on a show.\nThe Associated Press’ Maria Sherman describes Lamar’s performance as a continued victory lap in her review of the performance. SZA was a previously announced guest performer and frequent Lamar collaborator.\n▶ Read the AP’s full review on Kendrick Lamar’s halftime performance\nThere’s never been a Super shutout\nEvery team in Super Bowl history has scored at least once. Kansas City has about 20 minutes of game time left tonight to extend that streak.\nThe record for fewest points in a Super Bowl is three, by the Los Angeles Rams in their 13-3 loss to Tom Brady and the New England Patriots six years ago.\nSCORE UPDATE: Eagles 27, Chiefs 0\nAnother field goal from Jake Elliott has pushed Philadelphia’s lead to 27-0 with 5:18 left in the third quarter. Elliott’s field goal was from 29 yards out.\nTrump leaves the Super Bowl\nPresident Donald Trump has left the Super Bowl.\nHis departure after halftime was expected.\nMahomes’ mother, brother and sister posed for a photo with Trump in his suite before he left.\nSerena Williams brings Compton love to Kendrick’s set\nKendrick Lamar didn’t go too heavy on the guest artists during his halftime set, but brought in a surprise superstar and a bit of his hometown when Serena Williams appeared on the halftime stage.\nThe retired tennis great showed up as a solo side dancer in a denim jacket and skirt and blue Converse, dancing to “Not Like Us.” Williams is from Lamar’s hometown of Compton, California.\nDJ Mustard, Samuel L. Jackson and SZA also made appearances.\nMan runs on field with what appears to be combination Sudan/Palestine flags before security tackles him\nA man appeared to unfurl some combination of the flags of Sudan and Palestine during Kendrick Lamar’s Super Bowl halftime show, and then ran on the field with it before being dragged away by security personnel.\nIt was not immediately clear how the person got onto the field. The show continued without interruption and it did not seem as though the person was shown on the broadcast of Lamar’s performance.\nHalftime in real time: 33 minutes — 2nd half begins\nThe second half is underway, 33 minutes after the final play of second quarter was run. That’s a long time for the Chiefs to think about trying to pull off a big comeback.\nEagles match 1985 Bears for first half dominance\nThe Philadelphia Eagles joined some elite company the way they dominated the first half.\nThe Eagles scored 24 points and allowed only 23 yards to the Chiefs.\nThe only other time a team scored more points than yards allowed in the first half of a Super Bowl came here at the Superdome in the 1985 season. Buddy Ryan’s Bears defense held New England to minus-19 yards on the way to building a 23-3 halftime lead. Chicago won the game 46-10.\nKendrick teases ‘Not Like Us’ and zigs away before zagging back\nKendrick Lamar teased his Drake diss track and huge hit “Not Like Us” before going in another direction.\n“I want to perform their favorite song,” he said to a group of women, then the opening riff of “Not Like Us” played.\n“Yeah that song, aw, maybe I’ll think about it,” he said. “Know what, I’ll slow it down.”\nThen guest star SZA came out and they performed their slow-jam-style collaboration “Luther.”\nHe didn’t disappoint, though, bringing “Not Like Us,” which won him Grammys for song of the year and record of the year, just a few minutes later.\n‘Uncle’ Sam Jackson opens Kendrick halftime show\nSamuel L. Jackson played emcee to Kendrick Lamar’s halftime show.\n“Salutations! It’s your uncle, Sam, and this is the great American game!” Jackson said done-up in red white and blue.\nLamar’s appeared crouched atop a Buick Grand National Experimental — the car his newest album, “GNX,” is named for.\nDancers wearing red, white and blue came pouring out of the Buick like a clown car and moved in sync to songs including “Humble.”\nKendrick Lamar begins halftime show\nKendrick Lamar has taken to the field for his halftime show.\nHe’ll be joined by guest star SZA, and if recent Super Bowls are any indication, probably other surprise guests.\nSo you’re saying there’s a chance: A list of Super Bowl comebacks\nTake note, Chiefs Kingdom. There have been seven successful comebacks from double-digit deficits in Super Bowl history.\n4. 25 — New England 34, Atlanta 28 (2016 season)\n5. 10 — Kansas City 25, San Francisco 22 (2023 season)\n6. 10 — New Orleans 31, Indianapolis 17 (2009 season)\n7. 10 — Kansas City 31, San Francisco 20 (2019 season)\n8. 10 — Kansas City 38, Philadelphia 35 (2022 season)\n9. 10 — New England 28, Seattle 24 (2014 season)\n10. 10 — Washington 42, Denver 10 (1987 season)\nThere’s the record for Saquon: Most yards in a full season by a RB\nPhiladelphia’s Saquon Barkley has passed Terrell Davis for most rushing yards in a full season (meaning both regular season and playoffs).\nDavis rushed for 2,476 for Denver in 1998. Barkley entered this Super Bowl with 2,447 yards. He’s got 2,478 now with the game at halftime.\nBarkley tied Davis’ record with a 9-yard run with 4:49 left in the second quarter, then passed the mark with a 2-yard carry on the last snap of the first half.\nHALFTIME: Eagles take 24-0 lead into the break\nThe Super Bowl is a blowout right now.\nJalen Hurts has completed 11 of 15 passes for 123 yards, has thrown for a touchdown and rushed for another, and Philadelphia has a 24-0 lead at the half of the Super Bowl.\nCooper DeJean had an interception return for a score (on his birthday, no less) and AJ Brown has a touchdown catch for the Eagles.\nPatrick Mahomes is struggling in a big way, completing six of 14 passes for only 33 yards with two interceptions. Travis Kelce doesn’t have a catch yet and the Chiefs have become totally one-dimensional — rushing only three times for three yards so far.\nOpenAI makes Super Bowl debut\nAI is back in the spotlight during ad breaks this year.\nChatGPT maker OpenAI made its Super Bowl debut in a spot that asked, “what do you want to create next?”\nMeanwhile, Google tapped into AI again this year by featuring Gemini Live, a tool that allows users to have real-time conversations with the tech giant’s chatbot. The ad shows a father using Gemini Live on a Pixel phone to prepare for an apparent job interview, all while showing heartfelt moments with his family.\nAnd Meta showed off its AI-powered glasses Ray band glasses in an ad starring Chris Pratt, Chris Hemsworth, Kris Jenner and a $6.2 million banana art piece.\nA.J. Brown showing his ‘Inner Excellence’\nA.J. Brown has been attacking the Chiefs all game.\nOne might say he’s showing his... “Inner Excellence.”\nBrown pulled out his sideline read after scoring a TD before halftime.\nSCORE UPDATE: Eagles 24, Chiefs 0\nAnother extra point is good and Philadelphia is up 24-0 with 1:35 left in the first half.\nTOUCHDOWN: Hurts throws TD pass to AJ Brown\nThe Eagles are rolling, with Jalen Hurts and AJ Brown connecting on a 12-yard TD pass.\nKendrick Lamar is on deck for halftime\nKendrick Lamar is getting ready to take the field as the halftime headliner.\nHe’ll be joined by guest star SZA, and if recent Super Bowls are any indication, probably other surprise guests, especially given the rapper’s penchant for collaboration.\nLamar was a guest star himself at the 2022 halftime show headlined by Dr. Dre and Snoop Dogg. He added a dystopian note to the party atmosphere that night, with dancers in totalitarian style uniforms moving in lockstep behind him.\nHe’s given no specific indication of what the vibes may be like when he takes the field in a few minutes.\n‘When Harry Met Sally’ reunion ad\nHellmann’s is reuniting Meg Ryan and Billy Crystal’s “When Harry Met Sally” characters to enjoy another sandwich at Katz’s Deli.\nThis time, the mayo makes all the difference — prompting Ryan to recreate one of the 1989 rom com’s most iconic scenes.\nSydney Sweeney chimes in with the famous line: “I’ll have what she’s having.”\nRocket Mortgage ad starts in-stadium sing-along\nRocket Mortgage used its Super Bowl spot to encourage an in-stadium sing-along.\nSet to John Denver’s “Take Me Home, Country Roads,” the emotional ad took viewers through a range of moments of people heading home.\nThen, the broadcast pivoted to the Caesars Superdome, showing that in-person audience members were also singing along.\nWhy are the Eagles sacking Mahomes so much?\nThe Eagles are taking advantage of the Chiefs’ season-long problems on the left side of their offensive line.\nThe Chiefs started the season with rookie Kingsley Suamataia at left tackle, but he struggled so much he was benched. Then it was Wanya Morris who got a shot at the job, but he likewise struggled and wasn’t even active for the Super Bowl.\nLate in the season, the Chiefs moved All-Pro left guard Joe Thuney to tackle and put Mike Caliendo in his place. That lineup seemed to work in playoff wins over Houston and Buffalo, but the Eagles have left Thuney grasping at air as they collapse the pocket on every passing down.\nDuracell batteries revive Brady\nDuracell’s trick ad featured Fox Sports commentator Kevin Burkhardt and Fox analyst and former NFL star Tom Brady seeming to comment on the game, until Brady suddenly freezes.\nThe culprit? His “batteries” ran out and needed to be replaced by Duracell batteries with the help of brand character Duracell scientist.\nRamon Velutini, Duracell President of North America & LATAM, said they wanted to use “an element of unexpectedness” to stand out in the crowded field of advertisers.\nThere’s been one 17-point comeback in the NFL all season\nThere’s been only one successful comeback from a 17-point deficit in the NFL this season.\nAnd it was in Week 1.\nChicago trailed Tennessee 17-0, before the Bears won 24-17.\nThe Chiefs are in big trouble now\nThe Chiefs’ comeback odds are long now.\nThey trail the Eagles 17-0 midway through the second quarter. In Super Bowl history, teams that trailed by more than 10 points at any point in the game are 1-43.\nThe one win was New England coming from 25 down to beat Atlanta 34-28 eight years ago.\n‘He Gets Us’ ad returns to Super Bowl\nFor a third consecutive year, “He Gets Us” has returned to the Super Bowl.\nThe religious campaign aired an ad in the second quarter, showing a range of images of people helping or supporting one other — and a message that read, “Jesus showed us what greatness really is.”\nJohnny Cash’s cover of “Personal Jesus,” a song by Depeche Mode, played throughout.\nSCORE UPDATE: Eagles 17, Chiefs 0\nThe kick is good and Philadelphia is up 17-0 with 7:03 left in the first half.\nTOUCHDOWN: Cooper DeJean scores on an interception return\nCooper DeJean has given Philadelphia a three-score lead, returning an interception 38 yards for a touchdown.\nDeJean became the first player to score a Super Bowl TD on his birthday.\nSome bad news, and good news, for Chiefs fans\nWell, they’ve been here before.\nThe Chiefs trail Philadelphia 10-0. That’s the bad news. Here’s the good news: This is familiar Super Bowl territory for the AFC champions.\nIn each of their three Super Bowl wins of the Andy Reid-Patrick Mahomes era, the Chiefs trailed by exactly 10 points before rallying.\nThey trailed San Francisco by 10 before winning 31-20 on Feb. 2, 2020. They trailed Philadelphia by 10 before winning 38-35 on Feb. 12, 2023. And they trailed San Francisco by 10 again before winning 25-22 on Feb. 11, 2024.\nThere have been only seven rallies from double-digit deficits in Super Bowl history. The Chiefs have three of them. (There’s been only one from more than 10 points down, that being New England erasing a 28-3 deficit to stun the Atlanta Falcons 34-28 on Feb. 5, 2017.)\nSCORE UPDATE: Eagles 10, Chiefs 0\nA 48-yard field goal from Eagles kicker Jake Elliott has put Philadelphia up 10-0 with 8:38 left in the second quarter.\nChiefs offense gets off to slow start in Super Bowl\nThree drives and three punts for Patrick Mahomes and the Kansas City Chiefs.\nThat’s only happened three other times with Mahomes as a starter, including a loss to New England in the 2018 AFC title game. Kansas City also did it in a loss to the Raiders on Christmas in 2023 and a Week 2 win over the Chargers in 2020.\nKansas City has tended to start slowly on offense in Super Bowls with the Chiefs scoring only 33 first-half points compared to 70 after halftime in four Super Bowl appearances.\nMatthew McConaughey pitches football conspiracy for Uber Eats\nWas football invented to simply sell food? Matthew McConaughey is trying to convince us that it’s all been “a conspiracy to make us hungry” from the very beginning.\nIn a celebrity-filled ad for Uber Eats, McConaughey makes his case to Greta Gerwig — with the help of additional cameos from Kevin Bacon, Martha Stewart, Charli XCX and YouTuber Sean Evans.\n76ers update: They’re on the ground in Philly\nThe Philadelphia 76ers tried to follow the first quarter of the Super Bowl on their charter flight, but wi-fi was spotty. They’re on the ground in Philly now.\nChiefs get a turnover, stay within 7-0\nBryan Cook has saved Kansas City from getting into a deeper hole.\nHe intercepted a pass from Philadelphia’s Jalen Hurts inside the Chiefs’ 5, giving Kansas City the ball back early in the second quarter. The Chiefs trail 7-0.\nEND OF FIRST QUARTER: Eagles 7, Chiefs 0\nJalen Hurts completed six of seven passes for 75 yards, plus ran for the only touchdown and Philadelphia leads Kansas City 7-0 after the first quarter.\nThe Eagles face 2nd-and-14 from the Chiefs 34 when the second quarter begins.\nSCORE UPDATE: Eagles 7, Chiefs 0\nThe extra point is good and Philadelphia leads 7-0 with 6:15 left in the first quarter.\nThat 1-yard rush by Hurts made him the fifth player with four Super Bowl rushing touchdowns in a career. Emmitt Smith has the most, with five. Thurman Thomas, Franco Harris, John Elway and now Hurts all have four.\nTOUCHDOWN: Hurts opens the scoring at Super Bowl\nPhiladelphia has struck first in the Super Bowl, with Jalen Hurts — thanks to the Eagles’ famed tush push, where the offensive line just bullies their way into the end zone and Hurts follows the crowd — scoring the game’s first touchdown.\nNow it’s the Chiefs fans complaining about the officials\nKansas City appeared to get a third-down stop against Philadelphia, but Trent McDuffie was called for a personal foul for making contact with Dallas Goedert’s face mask.\nTom Brady didn’t like this call, either.\nIt’s not just Messi at the Super Bowl. He’s with friends\nLionel Messi isn’t the only Inter Miami star at the Super Bowl.\nTeammates Jordi Alba, Sergio Busquets and Luis Suarez are there with him, taking a break from the preseason before resuming training in South Florida later this week.\nThe group famously were all teammates at Barcelona a decade ago, before reuniting to play in MLS with Inter Miami.\nFans inside Superdome boo Taylor Swift, Ice Spice\nThe fans inside the Superdome booed when Taylor Swift was shown alongside Ice Spice on the big screens during a break in the first quarter.\nSwift has drawn the ire of many NFL fans, who say that TV broadcasts show too much of her. She has been dating Chiefs tight end Travis Kelce since early last season.\nSwift was shown just after the cameras panned among actors Rob McElhenney, Adam Sandler and Paul Rudd. She gave a bit of a side-eye when she realized she was getting booed on the big screens, and kind of wrinkled her nose a bit.\nDunkin’ snags first ad spot\nDunkin’ snagged the first ad spot of the game — with the Massachusetts-based chain again enlisting Ben Affleck to represent “The DunKings.”\n“The DunKings” were introduced at the Super Bowl ad last year, with Affleck and stars like Tom Brady and Matt Damon showing off their Boston (and Dunkin’) pride through a boy-band like performance. But it appears the team has changed some since.\nIn Dunkin’s ad this year, Affleck’s brother Casey, Bill Belichick and Jeremy Strong are new members of the group.\nThe first big penalty of the game went in Kansas City’s favor.\nThe Eagles were going for it on fourth-and-2 from midfield and appeared to convert a 30-yard completion. But a flag came out for Brown putting his hand on cornerback Trent McDuffie’s face, leading to the questionable penalty.\nA big topic heading into the game was perceived bias for officials in favor of the Chiefs. Commissioner Roger Goodell called it “ridiculous” but those complaints will only grow louder after that first penalty.\nFox breaks out new scorebug for Super Bowl\nIt’s a different look showing time and score at the bottom of your screen for the Super Bowl.\nAnd social media isn’t loving what Fox is doing.\nFox has “KC” on one side in red, “PHI” on the other in green, with score in big white numerals. There’s also some different graphic elements than the norm as well.\nChiefs defer, 15th straight Super Bowl to open that way\nFor the 15th straight Super Bowl, the team that won the opening coin toss of a Super Bowl chose to defer.\nKansas City won the toss and gave Philadelphia the option to start with the ball. The Chiefs will get the ball to begin the second half.\nThe only team to choose to start a Super Bowl with the ball after winning the opening toss since the defer option was initiated in the 2008 season was the Saints in Super Bowl 44 against Indianapolis.\nThe coin toss winner: Tails. (Sorry, Eagles fans.)\nTravis Kelce called tails. It never fails, as they say.\nThe Chiefs won the coin toss, in a bad omen for the Eagles.\nIn Philly’s past Super Bowl appearances, when the coin toss result was tails, they lost.\nTrump visits field before heading to suite\nTrump spent a few minutes on the field before he headed to his suite to watch the game with lawmakers and family members.\nAfter entering through a tunnel near the Chiefs’ end of the field, he greeted first responders and victims of the New Year’s Day attack in the French Quarter.\nHe was greeted with a mix of cheers and boos from fans.\nBatiste brings accents of New Orleans and a long last note to anthem\nJon Batiste sang the U.S. national anthem while playing a wildly multicolored piano. He started out soft and only sprinkled only a few accents from his native New Orleans but got increasingly jazzy as he went, holding and riffing on the last note for a long time.\nThe telecast cut to a saluting President Donald Trump during the performance. The 2 minutes, 2 seconds the seven-time Grammy winner took to sing “The Star-Spangled Banner” was about average for a Super Bowl anthem.\nIt was the exact same length as Chris Stapleton two years ago but a lot slower than Reba McEntire, who brought it in at 1:30 last year.\nEli declared victorious over Peyton in ‘Kick of Destiny’\nEli Manning was declared victorious over his brother Peyton in FanDuel’s third annual “Kick of Destiny,” a pregame promotion from the gambling site held hours before Super Bowl kickoff on Sunday.\nThat means fans who betted for Team Eli are set to win a share of $10,000,000 in FanDuel Bonus Bets.\nA very Louisiana ‘America the Beautiful’\nTrombone Shorty, left, and Lauren Daigle, center, perform “America The Beautiful” before the NFL Super Bowl 59 football game between the Kansas City Chiefs and the Philadelphia Eagles, Sunday, Feb. 9, 2025, in New Orleans. (AP Photo/Charlie Riedel)\nTrombone Shorty and Lauren Daigle added some serious Big Easy swing to their rendition of “America the Beautiful.”\nShorty played his signature instrument during the verses and then sang along with Daigle on the choruses.\nThe last word from Mahomes, Barkley\nPatrick Mahomes and Saquon Barkley met with Fox reporters Erin Andrews and Tom Rinaldi after the teams took the field for the Super Bowl.\nSaid Mahomes: “Just enjoying it with the team. It’s always special.”\nAdded Barkley: “It’s no accident why we’re here. ... It’s go time.”\nIt’s a pro-Eagles crowd at the Super Bowl\nThere was a heavily pro-Eagles crowd inside the Superdome to watch Philadelphia try to dethrone the two-time defending Super Bowl champion Chiefs.\nThe Chiefs were booed loudly during pregame introductions, and the crowed revved up when Bradley Cooper appeared with a mic to introduce Philadelphia.\nIt had been evident all week that Eagles fans had come in droves, while perhaps a bit of Super Bowl fatigue had set in among Kansas City fans, who thought the big game was a once-in-a-lifetime trip but has now happened three straight years.\nIt’s a good bet that a lot of otherwise neutral fans were rooting for the Eagles, too. The Chiefs have become the juggernaut that everybody loves to hate.\nCelebrities are ready for kickoff, too\nPaul McCartney is here. Messi in a white sweatsuit. Bradley Cooper is on the field in his green Eagles jacket. Taylor Swift is in a suite with Ice Spice. Jay-Z with his daughters Blue Ivy and Rumi were on the field earlier.\nHarry Connick Jr. welcomes the crowd — and the world — to the Super Bowl\nNew Orleans legend Harry Connick Jr. has welcomed the crowd, and the worldwide television audience, to the Super Bowl.\nWith live marching bands, dancing and song, Connick led a Mardi Gras-themed welcome.\n“How y’all feeling, baby? Let’s celebrate some New Orleans music and culture at Super Bowl 59,” Connick said as the performance was beginning.\nLady Gaga, Tom Brady honor Americans’ resilience to tragedy\nLady Gaga sang “Hold My Hand,” her 2022 tribute to resilience, in a pre-recorded performance on Bourbon Street that was aired in the run-up to kickoff.\nBefore the song, a solemn group that included Tom Brady, Michael Strahan and NFL commissioner Roger Goodell walked up the street together to honor the victims of recent tragedies including the Jan. 1 New Orleans truck attack and recent Los Angeles wildfires.\nBrady praised “the American spirit of courage, generosity and unity.”\nGaga wore all white and sat at a piano in the middle of the street in the performance that was taped at 4 a.m. on Thursday.\nInside the Superdome, fans were given bracelets that lit up in an otherwise darkened stadium, creating a twinkling nighttime effect.\nLauren Daigle embraces hometown pride ahead of Super Bowl pregame performance\nWhen Trombone Shorty invited Daigle months ago to join him for “America the Beautiful” at the Super Bowl, she didn’t hesitate. Now, as she prepares to take the stage, she calls the moment an honor — one that carries deep meaning in her home state of Louisiana.\n“There’s a sense of pride in the air. It’s palpable,” said Daigle, a two-time Grammy winner known for her 2018 breakout hit “You Say.” She sees the NFL’s presence as a much-needed uplift for New Orleans, a city still healing from the New Year’s terrorist attack and past hardships like Hurricane Katrina.\nDaigle and Trombone Shorty began rehearsals at the Superdome on Friday after first working on the song together in the studio.\nAs for pre-show jitters? She welcomes them.“Nerves are part of the experience,” she said. “You just have to let them fly.”\nThe futbol GOAT has arrived at football’s biggest game\nLionel Messi is at the Super Bowl, an intersection of futbol and football.\nThe eight-time Ballon d’Or winner as soccer’s best player is at the Superdome, arriving one day after he and Inter Miami played a preseason game at Honduras.\nMessi is the reigning MLS MVP.\nNBA and NHL clear schedules, but 76ers will be airborne for Super Bowl’s start\nThe NBA and NHL had games today, but all were scheduled early enough to be done before the start of the Super Bowl.\nThat said, one team probably isn’t very happy right now.\nThe Philadelphia 76ers played at Milwaukee -- and the team was flying back to Philly after the game, with a flight plan that has them airborne during kickoff.\nIt’s about a 90-minute flight between Milwaukee and Philly, and the 76ers are scheduled to land around 7:30 p.m. That would be roughly the end of the first quarter.\nDawn Staley’s supporting the Eagles\nSouth Carolina women’s basketball coach Dawn Staley stayed true to her Philly roots.\nStaley rocked a Super Bowl LIX sweatshirt and green sneakers when the Gamecocks played Sunday at Texas. Staley represents her favorite Philly teams as much as she can, and the city loves her back. In 2017, Philadelphia proclaimed a Dawn Staley Day and renamed a street right where she grew up as Dawn Staley Lane.\nA 1,200-mile, 18-hour drive through the night\nPhiladelphia residents Ed White and Giiselle Burnett drove more than 1,200 miles overnight — an 18-hour drive — to arrive in Bourbon street in time for the Super Bowl.\nDespite the overnight drive they were bursting with energy, dancing down the street blowing whistles and shouting cheers to other Eagles fans.\nThey had already adorned green Mardi Gras beads over their Eagles shirts.\n“We got to come out here and represent for our birds,” White said. “Chiefs get outta here — it’s not happening!”\nLedisi keeps it local with a soaring ‘Lift Every Voice and Sing’\nLedisi performs “Lift Every Voice and Sing” before the NFL Super Bowl 59 football game between the Kansas City Chiefs and the Philadelphia Eagles, Sunday, Feb. 9, 2025, in New Orleans. (AP Photo/Godofredo A. Vásquez)\nLedisi was backed by a choir of local high school students as she sang “Lift Every Voice and Sing” — the song widely regarded as the Black national anthem.\nThe R&B singer stood spot-lit on a pedestal clad all in angelic white, with the students all in gold robes behind her as she delivered a soaring rendition of the song. It opened a series of pregame performances that will include the U.S. national anthem sung by Jon Batiste.\nChiefs heard loud boos\nPatrick Mahomes and the Chiefs heard loud boos as they ran on the field for warmups. The early-arriving crowd was overwhelmingly filled with Eagles fans. Though Philadelphians are known for their boorish behavior, the Eagles are fan favorites against the Chiefs. A few Saints fans were heard screaming “Go Birds!” and one Jets fan joined Eagles fans in singing “Fly! Eagles! Fly!” on the stadium concourse.\nTaylor Swift arrives at the Super Bowl\nTaylor Swift has arrived at the Super Bowl to cheer on her boyfriend Travis Kelce and the Chiefs.\nThe pop superstar was spotted in her suite at the Superdome, wearing a simple white ensemble, about an hour before kickoff.\nSwift and Kelce have been the sports-and-entertainment power couple since early last season, when the four-time All-Pro tight end invited the 14-time Grammy winner to watch him play in a matchup with the Bears.\nSwift made an around-the-world trip from her concert in Tokyo to Las Vegas last year to watch the Chiefs beat the 49ers in the Super Bowl.\nSuper Bowl ads hit record price, cost up to $8M\nThe cost of a 30-second ad during the Super Bowl reportedly cost up to a record $8 million this year; and that’s just the media buy — production can cost millions more.\nWhy spend so much? The Super Bowl reaches more than 120 million viewers who tune in not only to watch the game, but are primed to watch the ads as well.\nAn estimated 123.7 million viewers tuned in for Super Bowl in 2024, according to Nielsen. By contrast, about 19.5 million people tuned in to the Oscars in 2024 and about 18.6 million watched the final game of the World Series in October, according to Nielsen.\nFans pay their respects to truck attack victims\nAt the entrance to Bourbon Street, many paused to pay their respects to the 14 people had lost their lives in the Jan. 1 truck attack.\nA group of young Eagles fans removed green beads from around their necks and placed them on the memorial beside a mass of flowers and other offerings from tourists and locals alike.\n“I’ve seen it on the news but it’s my first time seeing it in person,” said Baton Rouge resident Chester Matthews, 35, as he stood beside the memorial, taking it in. “People lost their lives on the same streets we’re walking on. I just had to take a moment to reflect on that.”\nA vast roster of Super Bowl ads\nFamous mustaches help deliver Pringles. Bad Bunny is all smiles in Ritz’s “salty club.” And Meg Ryan and Billy Crystal’s “When Harry Met Sally” characters reunite in Katz’s Deli, with the help of Hellmann’s mayonnaise.\nIt’s Super Bowl Sunday — and, as always, there’s a vast roster of advertisers ready to vie for fans’ attention during game breaks.\nThe commercials will pull out all the stops. Viewers can expect to see the biggest actors, dazzling special effects and plenty of nostalgia (coupled with a frenzied mix of silliness) fill their screen.\n‘Puppy Bowl’: Team Fluff beats Team Ruff\nTeam Fluff clawed its way to victory to defeat Team Ruff at the 21st annual “Puppy Bowl.”\nWith a final score of 68-66, the adorable piece of Super Bowl counterprogramming came down to the very last play.\nA Labrador retriever mix named “Paws Allen” scored a touchdown in the final seconds of the game — taking matters into his own famous paws and securing the Lombarky Trophy for Team Fluff.\nThis year’s Most Valuable Puppy Award went to Team Ruff’s “Foxtrot,” a border collie mix who scored the first two touchdowns and added another in the fourth quarter.\nThis year’s ‘Puppy Bowl’ was set to feature 142 rescue puppies from 80 shelters across 40 states — as well as one from Nicaragua.\nChiefs, Eagles inactive lists announced\nThere were no big surprises when the inactive lists were released 90 minutes prior to kickoff.\nThe Eagles inactives were offensive linemen Darian Kinnard and Trevor Keegan, wide receiver Ainias Smith and defensive backs Eli Ricks, Lewis Cine and Bryce Huff.\nThe Chiefs inactives were defensive backs Steven Nelson and Keith Taylor, linebacker Josh Uche, defensive end Malik Herring and offensive linemen C.J. Hanson, Ethan Driskell and Wanya Morris.\nTrump arrives in New Orleans\nDonald Trump has arrived in New Orleans.\nThe president arrived on Air Force One with family members and a long list of lawmakers.\nEagles fans feel safe on Bourbon Street\nDiehard fans Daryl Flowers and Cheryl Williams, decked out in Eagles green, had flown in from Philadelphia and said they felt safe visiting Bourbon Street to watch the game from a bar.\n“This is one of the greatest cities in America,” Flowers said. “Bourbon street is always a fun time — there was never any trepidation about coming down here.”\nEagles’ Brandon Graham cleared for Super Bowl\nEagles defensive end Brandon Graham has been activated for the Super Bowl a day after he was taken off the injured-reserve list, where he had been recovering from a torn triceps sustained 11 weeks ago.\nThe 36-year-old Graham was thought to be done for the season after he was hurt Nov. 24 against the Rams. But as the Eagles kept winning, Graham started to hint he could put on his No. 55 jersey in the Super Bowl.\nIowa farm town gathers to watch native son DeJean\nIn the tiny farm town of Odebolt, Iowa, (population 920), a Super Bowl watch party was underway for native son Cooper DeJean.\nGreen and black balloons adorned the town’s community building, where Odebolt resident Jenny Sorensen was popping popcorn, which will be given away free during the game.\nThe Eagles’ DeJean “always takes time for the little kids who look up to him so much,” Sorensen said. “He’ll always take time to say hi to them, pat them on the back, sign something for them.”\nJimmy Johnson gets Super Bowl pregame tribute from Fox\nHall of Famer Jimmy Johnson just got about a 10-minute tribute from Fox, chronicling his life in football from college playing to college coaching to NFL coaching to broadcasting.\nJohnson said he hadn’t seen the tribute until it aired live, and he teared up as he discussed the piece.\n“I’ve got to thank my family for allowing me the time to accomplish some of those things,” Johnson said. “And I was blessed to have great players, great assistant coaches and great friends.”\nBut what did it mean?\nThere were definitely some hints at retirement, especially when he was asked by NFL on Fox pregame host Curt Menefee, “Was that good-bye?”\n“One day at a time, Curt,” Johnson said. “One day at a time.”\n‘Puppy Bowl’ wrangler\nIf you tuned into the “Puppy Bowl,” you likely saw a key person’s influence — even if you didn’t actually see her.\nVictoria Schade is a dog trainer and novelist who’s the show’s lead puppy trainer and wrangler. She was the one making sure the shelter pups had a conflict-free contest and that they were captured at their most adorable — all from off-camera.\nBlack Masking culture of New Orleans\nArtist Tahj “Queen Tahj” Williams is responsible for the Super Bowl theme art and logo that have been featured almost everywhere, such as digital game tickets, the official program cover, the team jerseys, the game ball and the exterior of a hotel in New Orleans.\nWilliams’ design was a tribute to Black Masking culture, which was rooted in the 1800s. It blends African and Native American heritage.\nThe elaborate, hand-sewn suits — adorned with intricate beadwork and feathers — are highlighted with bold and colorful designs to pay homage to their ancestral influence.\nThe NFL said Williams’ work honors the cultural roots of New Orleans, calling her the “perfect artist.”\nBatiste gets ready to sing US national anthem\nJon Batiste is getting ready to bring it home.\nHe’s set to take the Super Bowl field to sing the US national anthem at approximately 5:24 p.m. CST.\nThe multi-talented musician from Louisiana will look to put his own spin on “The Star-Spangled Banner” at the piano, all while thinking of his late grandfather, a veteran who recently died.\nActor Stephanie Nogueras will perform the anthem in American sign language.\nBourbon Street is packed, with thousands of officers on guard\nBourbon Street is packed with festive Eagles and Chiefs fans clutching drinks and grabbing Mardi Gras beads tossed down from balconies amid blasting bar music.\nThere’s more than 2,000 law enforcement officers on hand in the city keeping a watchful eye on the crowds and a host of new security measures in place after a truck attack struck the city’s most famous thoroughfare on Jan. 1.\nWhile it remains relatively easy for pedestrians to get into the city’s historic French Quarter, metal barriers have been erected and raised around Bourbon street to block vehicles from entering and armed National Guardsmen are stationed at every intersection, along with federal agents. New bollards — steel columns — have been installed by the city throughout the most popular blocks of Bourbon Street.\nTrombone Shorty, Lauren Daigle teaming up for ‘America The Beautiful’\nTrombone Shorty will perform “America The Beautiful” with Christian singer-songwriter Lauren Daigle before kickoff.\nTrombone Shorty was raised in the New Orleans jazz scene. Daigle is from Lake Charles, Louisiana.\nThey’ll take to the field at approximately 5:22 p.m. CST, just before the US national anthem.\nIt’s a Super Bowl birthday for Barkley and DeJean\nSaquon Barkley and Cooper DeJean are hoping for a bigger reason to celebrate besides their birthdays.\nThe two Eagles will become the 15th and 16th players to appear in a Super Bowl on their birthday and the first teammates to do it since Green Bay’s Travis Williams and Ron Kostelnik in a Super Bowl 2 win over Oakland.\nNo one has ever scored a touchdown or intercepted a pass in the Super Bowl on their birthdays. Although Randy White did share the MVP with Dallas teammate Harvey Martin after beating Denver on his 25th birthday in Super Bowl 12.\nLedisi to perform ‘Lift Every Voice and Sing’\nR&B singer Ledisi is set to perform “Lift Every Voice and Sing,” a song regarded as the Black national anthem.\nLedisi, who is from New Orleans, will perform at approximately 4:46 p.m. CST.\nIf you’re an Eagles fan, here’s what you root for: Heads\nHeads is on a coin-toss roll right now, having been the result of the pregame flip in three of the last four Super Bowls.\nThe most superstitious of Eagles fans might want to see that trend continue.\nThis is Philadelphia’s fifth Super Bowl. In the previous four, tails has been the coin-toss result three times; the Eagles are 0-3 in those games. The one time the coin-toss result was heads, Philly prevailed.\nWill Kendrick perform ‘Not Like Us’ at his halftime show?\nKendrick Lamar is almost certain to rap at least part of “Not Like Us” when he performs with guest star SZA and possibly others. It’s an odd fit for the Super Bowl, though.\nThe incendiary shots the song takes at Lamar’s rival Drake drove Drake to sue their shared record label for defamation.\nTrump is en route to the Super Bowl\nPresident Donald Trump said he’s looking forward to the game as he prepared to board Air Force One en route to New Orleans.\nTrump said he’ll be cheering on “two great teams—the Kansas City Chiefs and the Philadelphia Eagles” in a statement released by the White House. He says that, “The coaches, players, and team staff on the field tonight represent the best of the best in professional football” and “embody the best of the American Dream.”\nHe also acknowledged those who were killed and injured during the New Years attack in the French Quarter. Upon arriving at the Caesars Superdome, Trump is expected to participate in a meet-and-greet with this year’s honorary coin toss participants, including victims’ family members, members of the New Orleans Police Department and other emergency personnel.\nAP NFL writer takes Eagles over Chiefs 31-30\nAP NFL Writer Rob Maaddi predicted the Eagles would beat the Chiefs in the Super Bowl before the season began and he’s sticking with it, taking Philadelphia to win 31-30.\nMaaddi accurately selected winners in 70.7% of games this season in Pro Picks, going 201-83.\nKendrick Lamar says to expect storytelling in halftime show\nKendrick Lamar said viewers can expect storytelling above all from his Super Bowl halftime show.\nHe comes into the headlining gig after winning five Grammys a week ago, including record of the year and song of the year, for “Not Like Us.”\nThe artist who is from Compton, California, said he’s riding “L.A. Energy” into Louisiana.\nHere’s a lineup of the Super Bowl’s pregame performances\nJon Batiste will headline a pregame parade of local Louisiana performers when he sings the national anthem in New Orleans shortly before kickoff.\nBatiste, the multi-instrumentalist, singer and former TV bandleader whose music has blended R&B, hip-hop, swing, jazz, pop and classical sounds says he’ll perform “The Star-Spangled Banner” at the piano.\nThe seven-time Grammy winner comes from a legacy New Orleans musical family. Batiste told The Associated Press he’ll be thinking of his veteran grandfather who died recently when he performs.\nR&B singer Ledisi, a native of the city, will perform “Lift Every Voice and Sing,” a song regarded as the Black national anthem.\nTrombone Shorty, who was raised in the New Orleans jazz scene, will perform “America The Beautiful” with Christian singer-songwriter Lauren Daigle, who is from Lake Charles.\nChiefs are going for first Super Bowl three-peat\nThe Chiefs (17-2) will try to become the first team to win three straight Super Bowls when they face the Eagles (17-3) in the Superdome.\nIt’s a rematch from two years ago when Jalen Hurts nearly led Philadelphia to a championship only to watch Patrick Mahomes snatch it away by rallying Kansas City to a 38-35 win.\nMahomes lifted the Chiefs to an overtime win against San Francisco in another Super Bowl rematch last year. Now, they’re poised for a three-peat.\n___\nAP NFL: https://apnews.com/NFL",
  "word_count": 8938,
  "scraped_at": "2026-02-14T12:53:15.112630"
}