{
  "article_id": "f665216e6d8c",
  "url": "https://uk.style.yahoo.com/lionesses-nigeria-womens-world-cup-171500848.html",
  "title": "Lionesses to take on Nigeria in Women World Cup last - 16 clash and caution is the watchword",
  "date": "20230806T184500Z",
  "domain": "uk.style.yahoo.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Women's World Cup: As heavyweights crash out, cautious Lionesses prepare to face Nigeria\nThey've seen the American agony. The German gloom. And Brazilians broken-hearted.\nUpsets have opened up a clearer route to World Cup glory for England - but have shown how the heavyweights are marks to be taken down.\n\"I think everyone who plays against us wants to beat us,\" England manager Sarina Wiegman said.\n\"What we have seen in this tournament is that nothing is easy.\"\nSo caution is the watchword going into the last-16 clash with Nigeria - with no complacency against the record 11-time African champions.\nBut there is also optimism in the England camp, with Keira Walsh back in training with her teammates after a week of recovering from a knee injury.\nEngland defender Alex Greenwood said: \"She always had a smile on her face and we just supported her as teammates as best we could.\"\nFears that Walsh would be the latest star afflicted by a tournament-ending ACL problem were allayed.\nBut whether the beating heart of the team returns to the team on Monday will be a late call by Wiegman.\nThe unpredictability of the potential line-up could benefit England.\nA rejigged formation flourished in the 6-1 thrashing of China in the last group game.\nAnd Nigeria has been left having to prepare to face systems dependent on Walsh's availability.\nLast female coach standing\nTactical nous and flexibility is why England turned to the coach who took the Netherlands to the 2019 final and then won the Euros for the Lionesses last year.\nMore in Sports\nShe is impressing while dugouts, even in the women's game, are dominated by men.\nThe Netherlands knocking out South Africa and their coach Desiree Ellis left Wiegman on Sunday as the last woman of the 12 managers still at the World Cup.\n\"Before the tournament started, we had 20 male and 12 female coaches,\" Wiegman said.\n\"What we hope is that that balance gets right in the future and we are working on that, at least in England and I know in other countries too, to give opportunities to have more women in the game and hopefully also more coaches in the game.\"\nShe turned to Greenwood sitting alongside her in the Brisbane stadium.\n\"I hope in the future not too soon - that she'll be a coach at some point,\" Wiegman smiled. \"And that balance gets right.\"\nWiegman has a fan of her achievements in Nigeria coach Randy Waldrum.\n\"She's done a fantastic job with England,\" he said.\n\"You can see the progression of the team. And when I look at a coach and I try to analyse, if I don't know them personally, you can look at their team and you can tell if they have an idea based just in their organisation and they look like they have a plan.\n\"A way they want to play offensively and they're organised defensively and you clearly can see that with England.\n\"They're so disciplined on both sides of the ball. Their movement offensively is very good, especially in the last match you saw the how fluid it was against China.\"\nRead more:\nFIFA President returns to Women's World Cup after almost a week away on Pacific islands\nPay dispute 'on hold'\nBut England are progressing in Australia with an unresolved pay dispute between the players and the FA.\n\"At the moment, the conversation's on hold,\" Greenwood said. \"We are here to fully focus on football and are nothing more than that right now.\"\nFocus that is required having seen the Americans' hopes of a hat-trick of World Cup titles ended by Sweden after losing on penalties.\nBrazil and Germany did not even make it out of the group stage.\nWiegman said: \"What we've seen in this tournament, is that the game is developing really quickly.\"",
  "word_count": 639,
  "scraped_at": "2026-02-14T13:26:31.820524"
}