{
  "article_id": "f68831ccf5f4",
  "url": "https://www.france24.com/en/live-news/20240526-brazil-s-ronaldinho-stars-in-charity-match-for-flood-victims",
  "title": "Brazil Ronaldinho stars in charity match for flood victims",
  "date": "20240526T234500Z",
  "domain": "france24.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Brazil's Ronaldinho stars in charity match for flood victims\nRio de Janeiro (AFP) – Brazilian football great Ronaldinho came out of retirement Sunday for a charity match to raise funds for those affected by devastating flooding in the country's south.\nIssued on:\nThe Paris Saint-Germain and Barcelona legend notched two goals and an assist in the 5-5 tie at the match in Rio de Janeiro's Maracana stadium.\nRonaldinho, whose full name is Ronaldo de Assis Moreira, is from Brazil's Rio Grande do Sul state, which has been reeling from weeks of unprecedented floods that have killed more than 160 people and left 90 percent of its towns inundated.\nA slew of Brazilian football stars got together for Sunday's charity match, including coach Dorival Junior and former right-back Cafu.\n\"It's moving to see all these people coming together to help my people,\" Ronaldinho said.\n\"After this immeasurable tragedy, we see the Brazilian people uniting again,\" Junior said.\nRonaldinho, 44, put in his team's fourth and fifth goals, while Cafu also shone with a goal and an assist.\nHe left the pitch with 15 minutes on the clock, to a standing ovation.\nWomen's stars also took part in the match, including Formiga.\nCities and rural areas alike in Rio Grande do Sul have been hit for weeks by an unprecedented climate disaster of torrential rains and deadly flooding.\nMore than half a million people have fled their homes, and authorities have been unable to fully assess the extent of the damage.\nIn state capital Porto Alegre, floodwaters rose again on Thursday amid new rainfall.\nThe floods mark the region's fourth extreme weather event in less than a year, a phenomenon scientists say is driven by climate change and also deforestation.\nGovernor Eduardo Leite told TV Globo on Saturday evening that the reconstruction could last \"several months, or even more than a year.\"\n© 2024 AFP",
  "word_count": 313,
  "scraped_at": "2026-02-14T12:52:20.721405"
}