{
  "article_id": "f68bb0e1947b",
  "url": "https://www.afl.com.au/aflw/news/1217463/opinion-sarah-black-why-we-now-need-larger-list-sizes-in-the-aflw",
  "title": "Number up : Why we now need larger list sizes in the AFLW",
  "date": "20240910T120000Z",
  "domain": "afl.com.au",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "AFTER just one game of the 2024 NAB AFLW season, Collingwood was needing top-up players to form a squad of 24 to face Hawthorn.\nThe Pies lost by 47 points to the Hawks, with Muireann Atkinson (concussion), Lauren Butler (calf), Imogen Evans (hamstring), Kalinda Howarth (ACL), Mikayla Hyde (foot), Annie Lee (knee), Charlotte Taylor (foot) and the suspended Tarni White all sidelined.\nWith one of the deepest Telstra AFLW Drafts we've seen on the horizon, it's time to extend AFLW lists to 32 over the next two years.\nThe latest round of expansion teams are now in their third season in the competition, and player movement across the AFLW is stabilising after the introduction of three and four-year contracts.\nCurrently, each club has 30 active players on its list, and is able to replace those already sidelined for the year during the pre-season period.\nAFLW INJURY LIST Who's sore? Who's nearing a return?\nClubs also each have a pool of 10 train-on players drawn from the state leagues (which often includes former AFLW players), who attend one training session a week to help with match simulation drills.\nIf a team cannot form a playing squad of 24 (inclusive of three emergencies), then a train-on player can be elevated either as an emergency, or as a player in the 21 itself.\nWhile uncommon, it's not a rare scenario. We've seen it happen before. But we've never seen a team needing top-up players as early as week two.\nIn the midst of its injury crisis last year, the Western Bulldogs drew on four train-ons in rounds eight and nine, only ever naming two in its 21 at a time.\nRichmond also leant on two train-on players across rounds five to eight, while Fremantle drafted now-Eagle Mikayla Western in for a match during a COVID outbreak in season six.\nSarah Perkins reignited her AFLW career as a train-on for Melbourne in 2020, ultimately playing three games.\nThis season will see the advent of mid-week footy, with 11 rounds played in the space of 10 weeks.\nIt's yet to be confirmed what next season's structure and timing will be, under the direction of new AFL general manager of women's football Emma Moore, but we do know we will have at least 12 rounds of football.\nAFLW DRAFT The latest news on 2024’s prospects\nBut if mid-week footy is to stay, longer lists will be vital. As it stands now, a player could miss three games through the 12-day concussion protocol, putting further strain on playing stocks.\nIncreasing playing lists by two per club is an additional 36 players. This doesn't have to be facilitated purely by extra draft picks in a single year, but also through fewer delistings over two.\nReigning premier Brisbane lost nine players in the off-season (excluding retirements). Seven were trade requests for greater opportunity, and their two delistings – Caitlin Wendland and Brooke Sheridan – then found homes at other clubs.\nA gradual increase of one additional player per club over the next two years won't break the bank, particularly as we're set to enter the first draft since 2017 that doesn’t feature expansion concessions or state-based selections.\nAll drafts since 2017 have included either major or minor concessions for expansion clubs as they progressively entered the competition, with the COVID-affected 2020 the most \"normal\" draft after Richmond and West Coast had to on-trade their bonus first-rounders.\nThe confirmation of a fully national draft will also open up clubs' access to talent across the whole country.\nTop talent has been funnelled to various expansion clubs over the years, who have had extra selections up their sleeves, diluting the pool in both talent and number of players for the remaining clubs.\nThe addition of two extra list spots will also allow for greater development of \"project\" players. In the men's competition, it's common for rucks and key position players to be tucked away for a few years, working on their craft as they physically grow.\nDue to the depth of talent in its squad, Melbourne is a rare AFLW team who has been able to give additional time to the likes of Georgia Campbell, Georgia Gall and injured draftee Jacinta Hose (as well as the returning Denby Taylor) without needing to play them straight away.\nAllowing a greater number of footballers time to develop in a professional environment can only better the competition in the long run and will allow teams greater flexibility around selection.\nWe're not reinventing the wheel, but it's time for another small step forward in the evolution of the competition ahead of its 10th season in 2025.",
  "word_count": 770,
  "scraped_at": "2026-02-14T13:30:37.268512"
}