{
  "article_id": "f69967e021bc",
  "url": "https://www.premierleague.com/news/3124795",
  "title": "Meet the people of the FA Women National League",
  "date": "20230422T000000Z",
  "domain": "premierleague.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Former England star Sue Smith recently took the Premier League and England Women's Euros trophies to Solihull Moors FC to help celebrate the growth of the women's game and to recognise the importance of Premier League investment lower down the football pyramid.\nThe Premier League supports the FA Women's National League (WNL), the third and fourth tiers of women's football, with £3m of investment and a new three-year strategy \"Empowering For Success\", which was launched this season.\nSmith's visit was on 2023 FA Women's National League Finals Day as Leeds United Women, Stourbridge Women, Newcastle United Development and Portsmouth FC Development battled it out for the WNL Plate and Reserve Plate finals.\nHere are the stories of those who participated on the day.\nAvi, Kyra, Lyra & Malayah (women's football fans)\n\"We love women's football a lot. We watched the Euros last summer at our cousin's house in Manchester and were so happy when Chloe Kelly scored the winning goal. Everyone screamed and it was one of the best days of our lives!\n\"Our favourite Lionesses are Ellen White and Jess Carter. They make us love watching football the most, but now we all play with our mates for fun. It’s so weird seeing the Euros trophy in real life because we have only seen it on the telly. It looks so cool and different compared to the other trophies. It is really beautiful.\"\nBrian Pearson (Newcastle United Development fan)\n\"Unfortunately, at my age I can't play myself, so it is nice to watch the others get out there and be active - especially the women.\n\"It's great to see the game has changed since I started watching it by including women's games seriously, and it's amazing to see how professional the leagues are forming.\n\"Back in my time, all you could do was come down to your local pitch and play with your mates on a Saturday, go to the pub and that was it. Today, these games are at an amateur level, but it is run on more professional grounds, which is good to see.\"\nApril Hill, Macey Nikiah-Walters & Esme Parsons (Portsmouth Women Development players)\n\"Promoting women's football will help continue its growth, especially with how it's growing after the Euros. We can't wait for it to develop.\n\"We need more people involved, more fans and more broadcast events. When we were in school, we had to join the boys' team just to play football. Some of us were lucky and had a mixed team to play with.\n\"It would have been nice to have had a girls' team. We are incredibly happy we have a team now where we can play together at this standard and at this level and we love it!\"\nDavid Jenkins (Portsmouth Women Development super fan)\n\"The girls played well and gave it their best, which is all that matters at the end of the day. Portsmouth Reserves is one of my favourite teams to watch and I try to come down as much as possible to support them\n\"I even do my best by wearing their merch. Compared to men's football, I find women's football at this level much calmer and it is easy to follow. The competitiveness is just as strong, though, compared to other leagues because everyone wants to win.\"\nBridie Hannon and Kathryn Smith (Leeds United Women players)\n\"The icing on the cake helping the women's game grow has been the Lionesses winning the Euros. It helped the game become stable after years of stagnancy.\n\"People are starting to know who the England women are. Hopefully, in a few years time, people will know who the Leeds players are. You can tell by all the fans that have arrived here today from all over the country that it is in a really good place, particularly for a fourth-tier game.\n\"Because of this, there’s so many pathways for girls who want to follow in our footsteps. Our advice is to work hard and never give up.\"\nLaura Malkin (sports photographer)\n\"I actually have two jobs. When I'm not at football matches, I also do media at a lawn-mowing company.\n\"But I love sports, and my job is not so much a chore when I'm being paid to watch events and capture shots. My work ranges from travelling to take photos for grassroots football to professional games, sometimes even travelling internationally.\n\"Regardless of where I am, I will always end up at a sporting event with a camera. I've loved sports all my life - I grew up playing cricket and football for 20 years so getting a job in this industry is ideal for me and the best thing that could happen.\"\nHannah Sharp, Rebecca Halford, Charlotte Phillips (match officials)\n\"Getting to officiate finals is one of the coolest perks about our jobs, having the opportunity to be involved with women's football and helping to grow the game.\n\"In terms of enjoyment, it comes from being able to be on the pitch and watch the game up close, as well as being able to provide the game for the fans and everyone else watching. We also enjoy being role models to young people and to ourselves when we are together.\n\"The best advice we can give is telling others to give the game a go. Whether that’s playing to officiating, start from the bottom at grass roots and work your way up to gain your skills. There's a place for everybody.\"\nMaddie, Poppy, Summer & Zoie (Stourbridge Women fans)\n\"Millie Rogers is our favourite player from Stourbridge Women's. We are huge fans. They're top of the table in Division 1 in the Midlands so they are really good.\n\"We also play football ourselves, which is why we are interested and involved. Our group ranges across the positions, with a left-winger, a goalkeeper, a striker and a centre-back.\n\"It is nice having Stourbridge Women to look up to because we want to be like them and hopefully have careers as female footballers.\"\nSue Smith (football presenter & former Lioness)\n\"I've seen both sides of the game from when I first started playing for a local boys team, to having to pay to play at Tranmere Rovers, where there were a lot of volunteers who helped run the club, to then playing professionally at Leeds United and Doncaster Belles, to also playing for England, where we had everything from personal sports scientists to doctors and cooks at St George's Park.\n\"Looking into the National League, it takes me back to when I was trying to balance an education to playing football and trying to train everyday while also having other commitments as I couldn’t focus on football full-time at this level.\n\"Seeing all the hard work and dedication to keep the clubs running is just amazing and how everyone volunteers to get things running for the growth of the clubs is heart-warming, especially at a final.\"\nPaige Williams (Leeds United Women midfielder)\n\"To be honest, I started my day by making sure my team were prepared for this big day. We've had to analyse Stourbridge Women a lot and hold respect for the opponents.\n\"We are both in the same leagues but in different areas of the country, so we knew it was going to be a tough game and had to make sure we were reliable to each other as team-mates on where we were playing on the pitch.\n\"We know who we are as a fairly big club and that we are a great team. We know each other very well and we knew what we were capable of, so it was just going into the game with that mindset and not letting anything else drag us down.\"\nGuy Thrower (Match official)\n\"There aren't really too many lows with my position as a referee, apart from some boos here and there but that's inevitable really. In terms of my addition to being part of the women's game, this is a privilege at the moment, you know?\n\"As a male in the women's game, there is so much opportunity to join a match and referee for them, especially with girls who were part of today's final, who worked their absolute socks off. Having to match their energy and running pace is insane. This is the highest I have refereed at, at the moment, and I'm more than happy so far. I truly love what I do!\"",
  "word_count": 1406,
  "scraped_at": "2026-02-14T12:39:41.688189"
}