{
  "article_id": "f6bd76d9a37b",
  "url": "https://www.npr.org/transcripts/g-s1-10410",
  "title": "Why the weapon of choice matters in the Trump assassination attempt",
  "date": "20240716T031500Z",
  "domain": "npr.org",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Why the weapon of choice matters in the Trump assassination attempt.\nTERRY GROSS, HOST:\nThis is FRESH AIR. I'm Terry Gross. We've postponed our interview with former Hollywood stunt man and director of the new film \"The Fall Guy\" so that we can address what's on everybody's mind right now - the attempted assassination of former President Trump and the other victims of the shooter. Two were seriously injured. One was killed. The shooter used an AR-15, an assault weapon that has become the preferred weapon of mass shooters.\nMy guest, Todd Frankel, wrote about how the civilian rifle was adapted from the military combat automatic rifle, the M-6, and how with the help of clever marketing and lobbying, the AR-15 has become a huge moneymaker for the gun industry, and icon of gun culture, a favored weapon for perpetrators of mass shootings, and a flash point in the debate about guns in America. Frankel was the lead reporter on the main story of a Washington Post investigation into the history of the AR-15. The series won a Pulitzer Prize this year for national reporting. Frankel is an enterprise reporter on the financial desk of the Post. We're going to hear the interview we recorded this morning. Then we'll dive deeper into the gun's history and current place in gun culture and listen back to the interview we recorded last year when the AR-15 series was published.\nTodd Frankel, welcome back to FRESH AIR. What was your reaction when we heard the shooter used an AR-15?\nTODD FRANKEL: Not surprised. I think, every time there's a shooting, especially one that's so high profile or a mass shooting - you know, the first question that I have - actually a lot of gunmakers always have - is, was it an AR-15? And this time, it was.\nGROSS: Why is that the first question?\nFRANKEL: It's because it's become such a popular weapon for use - popular, period, and then also popular for use in these sort of horrific mass events. You know, it's everywhere. And you know, one in 20 gun owners in America has an AR-15, it's estimated. The thing's just blown up and taken over the gun market. And so not only is it popular amongst all gun owners. It's popular amongst the subset of folks who, when they want to cause death and destruction, this is what they reach for.\nGROSS: The AR-15 is banned in several states, including Washington, California, New York, Connecticut, New Jersey, Massachusetts, Maryland, Illinois, Delaware, and some chains like Walmart and Dick's Sporting Goods no longer sell it. What impact has that had on that rifle?\nFRANKEL: And some ways, it's sort of raised the profile of the rifle because it's made it sort of a taboo weapon that some places don't want you to have. And it hasn't had any effect on sales, really, because some folks in some states perhaps can't get one. And also, all these bans are sort of on shaky legal ground with the Supreme Court showing its willingness to overturn any gun ban with the Bruin decision a couple of years ago, affecting handguns and the right to own that. A lot of folks expect that any gun law that it has been passed nationwide is perhaps going to get new scrutiny.\nGROSS: And in jeopardy?\nFRANKEL: Yes, definitely in jeopardy.\nGROSS: Milwaukee, Wis., the site of the Republican Convention - Wisconsin is an open-carry state. Does that include assault weapons?\nFRANKEL: It does. And it makes it sort of a challenge for law enforcement, these open-carry laws. You know, famously, I think, a couple of years ago, there was that young kid, Kyle Rittenhouse who was open carrying an AR-15 during one of the Black Lives Matter protests in Kenosha, Wis., and, you know, he ended up killing, I think, two people and wounding another. And the simple act of wearing this weapon, which part of its appeal is that it looks menacing, and it has a real high profile and people sort of recognize immediately - you can just wear it going down the street, as long as you're not sort of brandishing it, not sort of pointing at people and stuff. As long as it's just slung over your shoulder or across your chest. And it's - you know, to some folks, it's a really difficult thing to digest, to look, to see, but you know, that's where our laws stand in several states right now.\nGROSS: The AR-15 has become kind of a symbol for people on the right. How is it used as a symbol?\nFRANKEL: It's become, you know, sort of the stand in for the musket, the revolutionary war musket. You know, it's a symbol of freedom. It's a symbol of gun rights. Without a doubt, there were folks at that Trump rally in Pennsylvania who had, you know, the image of the AR-15 on a T-shirt or on their hat. I mean, it's everywhere. And it's become much larger than just a gun. It's become the symbol of freedom. Part of the appeal in the marketing is also that it antagonizes the so-called left, the folks who aren't quite so comfortable with this weapon. It's almost like this litmus test of how you react to the very distinct outline of this gun. You know, with its - you know, it's a long gun, it's a rifle, and it has, you know, the clip, the magazine clip that extends down below.\nIt's instantly recognizable, and it has this military bearing - it looks like an M-16. And you know, the fact that it sort of provokes strong reactions, both of folks who instantly identify with it, you know, and also folks who identify - sort of repulsed by it. So, you know, as we become more polarized, it's become this sort of weaponized symbol of, well, how do you feel about this? And immediately, you can sort of sort into your respective camps.\nGROSS: Do you think that the AR-15 as a symbol for people on the right might change after this assassination attempt with an AR-15?\nFRANKEL: No, I don't think so because I don't think that they assigned the weapon the responsibility in this. This is a bad guy who did this shooting. This wasn't the weapon itself. And so I don't expect that they'll change their tune on how they feel about the gun. It won't lose any of its luster. I mean, if anything, the power of - the need for everyone to be armed will be even more apparent now, right? Because there'll be some discussion about, like, well, what if someone else rather than waiting for law enforcement to respond with their guns, what if they could have responded with their gun earlier and quicker, since you know they saw this gunman before law enforcement did.\nGROSS: What have Biden and Trump said about AR-15s and assault weapons in general?\nFRANKEL: Biden has been a longtime opponent of assault weapons, of AR-15s. He would love to see a nationwide assault weapons ban. He's said this many times publicly. He hasn't been shy about it. Even as some Democrats have preferred not to talk about it, he has been pretty consistent in saying, I want an assault weapons ban. It's the right thing to do. Trump, you know, as we reported in our piece last year, was initially uncomfortable with it. I think one of his advisers sort of said that was sort of the New York liberal in him, that he was like, why did people need this weapon? But his advisers in the NRA, you know, they quickly explained to him that this is what his supporters want, that this weapon is part and parcel of that. And he has sort of changed his tune, and publicly, you know, now supports the weapon or, you know, does not support any sort of change to a law to make it harder to get.\nGROSS: The leaders of the Republican National Convention have asked for more security at the convention. And at the same time, Republicans have opposed the assault weapons ban and the weapon that was used in the assassination attempt is an assault weapon. And I wonder what your thoughts are about that.\nFRANKEL: I mean, it's one of those great ironies that both sides see differently. You know, on the right, you know, they talk about these gun-free zones as being the most dangerous places in the country, right? You know, if schools would just arm everybody, they'd be safer. But then, you know, ironically - right? - at their convention, those are gun-free zones, just because it's impossible to manage with guns everywhere.\nGROSS: What do you think might be next in terms of an assault weapons ban?\nFRANKEL: I don't think most people expect that there's any real chance at it. Mostly because of the current composition of the Supreme Court, which has this sort of 6-3 conservative-liberal split, and has shown a willingness to, if anything, undo current gun laws, to roll them back. And so the idea that they would show an openness to - even if somehow Congress, which hasn't, you know, allowed the last assault weapons ban to expire in 2004, you know, if they were somehow to develop the political will to pass one now, it would get struck down by the court. So I think most folks expect that, you know, if there's going to be any sort of additional regulation of assault weapons, it's going to be at the state level, and even then it's sort of dicey because it could be challenged at the Supreme Court. And so it's going to have to be real - you know, picking little pieces of this weapon, you know, maybe some sort of feature. But the entire weapon itself, there's really no expectation that there's going to be a ban.\nGROSS: Todd Frankel, thank you so much for talking with us.\nFRANKEL: Thank you.\nGROSS: Todd Frankel was the lead reporter on the main story of a Washington Post series on the history of the AR-15. The series won a Pulitzer Prize for national reporting this year, and the Post has just reposted that AR-15 series. After we take a short break, we'll take a deeper dive into the history of the AR-15 and its current place in gun culture and listen back to the interview we recorded last year when the series was published. This is FRESH AIR.\n(SOUNDBITE OF SLOWBERN'S \"WHEN WAR WAS KING\")\nGROSS: This is FRESH AIR. We're talking about the assault weapon that was used in the attempted assassination of former President Trump. Now let's listen back to my interview recorded last year with Todd Frankel, the lead reporter on a Washington Post series on the history of the AR-15 and its current place in gun culture. The series won a Pulitzer Prize for national reporting this year. It's been reposted on the Washington Post website.\n(SOUNDBITE OF ARCHIVED NPR BROADCAST)\nGROSS: Let's start with, if you could list some of the mass shootings that the AR-15 was used as the weapon.\nFRANKEL: Yeah, I mean, any mass shooting that has made the news that we've all sort of horrified by - you know, the Uvalde shooting down in Texas last year - that involved an AR-15-style weapon. Newtown, most famously, back in 2012, was an AR-15. Parkland, Fla., San Bernardino, the shooting in the movie theater in Aurora, Colo., you know, the Las Vegas mass shooting - the worst mass shooting in U.S. history - involved AR-15s. So when the death toll gets really high, 10 or more, these horrific things that you can't look away from and horrify people, usually, they involve AR-15s.\nGROSS: Why do mass shooters often choose an AR-15?\nFRANKEL: Yeah, you know, it's something that some of the mass shooters even explicitly spell out - like in their manifestos they leave behind, like the shooter in the Buffalo mass shooting. I mean, he specifically said, I chose AR-15 'cause it's, you know, very good at killing people. It's a military weapon that was sort of modified and changed for the civilian market. And it has taken on this aura that is appealing to folks for many reasons, but also for folks who really want to do a lot of harm.\nGROSS: It's easier to keep steady, you know, to keep steady aim with minimum recoil. Why is that an important feature of the gun?\nFRANKEL: Yeah, that was one of the innovations and one of the things that made it so appealing to the military. At first was it has this gas impingement system, which technically basically means that it redirects some of the energy from a fire bullet to blow the next bullet. There's less recoil, less kick on it. It's easier to keep aim, right? So instead of the front of the rifle kicking upwards with each bullet, it's easier to keep it on a constant target. It's more accurate. It doesn't hurt. It's much easier to shoot. One of the things for folks who want to go out and fire 40, 50 rounds at a range to do that with their big old hunting rifle, they'll bruise their shoulder after four or five rounds. The AR-15 is sort of famously easy to shoot and doesn't have much kick.\nGROSS: It's got a lot of speed. I learned this from The Washington Post. The speed of the bullet, the bullet would cross six football fields in 1 second. That's - I can't even fathom that, that a bullet can go that quickly. So how does the speed of the bullet affect the lethality of the bullet once it enters the body?\nFRANKEL: Yeah, the AR-15 actually shoots a fairly small bullet. It's known as a 223 or a 556 - you know, these technical details. But it's a fairly small bullet, but it has a lot of powder behind it, gunpowder behind it. And so it goes incredibly fast. And with that speed and how small the bullet is, when it hits a body, it sort of - once it goes in there, it doesn't just go right out the other side. You know, you referenced some of the work we did, and we had this animation where it showed the difference between getting shot by a typical handgun round like a nine millimeter round versus an AR-15 typical round.\nA handgun round will go clear through you, that sort of pinhole on both sides. But when AR-15 round typically hits you, it makes that small entry wound, but then inside it creates this shock wave, this blasting pattern that blows out the backside of people, causes internal injuries, and it's just devastating. It makes it very effective for a military weapon, but it's horrific when you see these in civilians.\nGROSS: So the AR-15 is a semiautomatic version of the combat rifle, the M-16, which was an automatic weapon. The M-16 was standard issue rifle in Vietnam. A Pentagon report described the M-16 as an outstanding weapon with phenomenal lethality. So what's the difference between the M-16, which was first used in combat in Vietnam, and the AR-15, which is being marketed to civilians?\nFRANKEL: They're very similar. The biggest difference is that the M-16, the military's rifle, is capable of automatic fire, which means if you pull and hold down the trigger, it'll keep firing bullets, whereas the AR-15, the one anyone can pretty much buy in a store, it's one trigger pull, one bullet. But it goes as quick as you can pull it, but that's still the main difference. But the gun itself is functionally otherwise the same as what is being used by the military.\nGROSS: So how did a weapon that was designed for combat become slightly redesigned for civilians? Like, was it somebody's idea? Can you pinpoint the person who decided, let's take this combat weapon and find a way to mass market it to civilians?\nFRANKEL: You know, the gun industry itself had huge doubts about this gun. They didn't really - they didn't welcome it at its trade shows. You know, we spoke to AR-15 manufacturers who talked about the hostility that they faced from other gun manufacturers - you know, like, what are you doing with this weapon that they thought was maybe for law enforcement, maybe for the military, but, like, you know, they didn't see it as having a role in the civilian gun market, which was pretty much like handguns and hunting rifles, traditional hunting rifles - if you think about a grandfather's hunting rifle or the one you might see hanging in the back of a pickup truck.\nBut when the assault weapons ban - the U.S. federal assault weapons ban expired in 2004, no major gun manufacturer actually made an AR-15. And it was a couple of years later that Smith and Wesson, which I think was sort of a pivotal moment - when they decided, you know what? For the first time in our long history, going back to the 1850s, we're going to make not only a rifle; we're going to make the AR-15.\nGROSS: Was that controversial within the gun industry?\nFRANKEL: It was. Again, there was this hostility towards the weapon itself, this sort of military gun - you know, what ordinary gun owners need with this? But the gun industry itself was suffering several years of flat sales, right? Guns - you know, there's no planned obsolescence with a gun. They last for decades. You can hand them down for generations. And so at some point, you've sold pretty much every hunting rifle and handgun that folks can buy and they're looking for something new. And Smith and Wesson did this market study, looking for new markets to tap into, and they found that there was some interest in this - what they called the tactical rifle market, which was the AR-15.\nGROSS: So, you know, the series mentions a man named Harry Falber, who ended up being the head of licensing at Smith and Wesson. And he came from the ad world. He had been an ad man in big companies. And when he came to Smith and Wesson, he wanted to test out what kind of advertising seemed to work best for Smith and Wesson. So he took out two ads in Guns and Ammo, one kind of more traditional gun ad, and one a gun ad for the AR-15, and basically tried to figure out which consumers responded better to. Can you describe those ads?\nFRANKEL: Yeah, I mean, Harry was a traditional - he describes himself as like from the \"Mad Men\" era of advertising. He'd worked for Hallmark, Volvo. He'd worked on these very mainstream brand campaigns. And so when he got to Smith and Wesson, they were trying to figure out how to market this AR-15 and also to sell their guns in general. And so he did this study where they placed two ads in Guns and Ammo magazine. And they were very different in tone, and the sort of illustrates the change in marketing that would come with the AR-15 throughout the industry. And one shows two pistols side by side, and the big headline, the tagline, is, fine-tuned machines. The other ad showed a police SWAT team officer. He's wearing dark gloves and a tactical helmet. He's pointing the AR-15 at some unseen target just out of the frame there. And underneath, the big words say, the chosen one.\nGROSS: So two things in that version of the ad - the chosen one is kind of, like, making the gun into this heroic figure. Also by advertising, like, you could be, like, this SWAT team officer who's seeing the action. You could have the same kind of thing, just as a civilian, not having to join the police even.\nFRANKEL: Yeah, no, and that was that sort of darker edge of marketing that at the time was still sort of sort of unwelcomed or sort of challenged in the industry, but now that's pretty much just how guns are advertised. It's sort of darker, sort of more aggressive. There's a threat out there, and you need to confront it, you know, just like the police do. You can be just like them. And that's mainstream firearms marketing today. And to Harry - well, the testing with consumers about how they reacted, they actually found that the fine-tuned machines, the more tame approach, was more popular with consumers. But there was something about this other one that really appealed to Smith and Wesson executives, Harry was telling us. And so they actually went in that direction.\nIt was not just choosing the chosen one for that one particular ad, but it was this tenor of advertising and marketing the gun that was different than how they had marketed guns previously. And it's dark. It's sort of threatening. There's this idea that the appeal is that tactical SWAT teams use it, and the military uses it, not that you can go out hunting turkeys on the weekend with it.\nGROSS: And one of the reasons I think why he spoke out is in 2012, after he decided to leave Smith and Wesson, because he didn't like the idea of these assault weapons - just a couple of months later was the Sandy Hook massacre in the elementary school, and he lived just like 20 miles away from Sandy Hook.\nFRANKEL: Yeah, he was horrified by that, and his wife worked in education, and I think he was just horrified by the idea that he had played any role in popularizing that gun.\nGROSS: We're listening back to the interview I recorded last year with Todd Frankel, the lead reporter on the main story of the Washington Post series on the history of the AR-15. That's the weapon that was used by the shooter who attempted to assassinate Donald Trump. The series won to Pulitzer Prize for national reporting this year. The Post has reposted the series on its website. We'll hear more of the interview after a break. I'm Terry Gross, and this is FRESH AIR.\n(SOUNDBITE OF REVERSO'S \"BLUE FEATHER\")\nGROSS: This is FRESH AIR. I'm Terry Gross. We're talking about the assault weapon that was used in the assassination attempt against former President Trump, the AR-15. It's become the weapon of choice for mass shooters. Let's get back to the interview I recorded with Todd Frankel, the lead reporter on the main story of a Washington Post series on the history of the AR-15. The series one of Pulitzer Prize for National Reporting this year. Our interview was recorded when the series was first published. The Post has reposted the story on its website.\n(SOUNDBITE OF ARCHIVED NPR BROADCAST)\nGROSS: I was surprised to read that after mass shootings, the sales of the AR-15 go up.\nFRANKEL: Yeah. And that's because it's the center of the gun conversation, the gun control conversation, where folks say, well, what are we going to do about - how are we going to address these mass shootings? And someone will say, well, we'll - we should have ban these assault weapons, and so that drives everyone scared on the other side who says - runs out and - guns rights groups play that up (ph).\nGROSS: Like, let's buy an assault weapon before it's too late, before it's banned.\nFRANKEL: Right. Yeah, it's going to be taken. You know, they're coming for your assault weapons, your AR-15. And come and take it - you know, that sort of attitude is on there, too. And so yeah, sales react to that, and folks will just strip gun shops clean of these guns.\nGROSS: You know, we talked a little bit about the ad campaigns for the AR-15. There was also some pretty clever marketing behind them, and one of the facets of that is working with video game manufacturers. So what was that relationship like? How did gun manufacturers get their guns into video games as a way of making people want those guns?\nFRANKEL: Yeah. I mean, there's a very popular video game franchise called Call Of Duty, which is sort of a shooting game, right? And so gun manufacturers, you know, would work with these video game manufacturers to make sure that their guns were included or referenced. And, you know, we even described this one moment in the late 2000s where a video game manufacturer and a gun manufacturer go out to this desert in - outside of Las Vegas to capture the sound - a rifle, AR-15-style rifle, being fired because they want to make sure it's accurate and realistic. And we've talked to gun owners who designed their AR-15s based on what they had used in the Call Of Duty games earlier as - when they were too young to own a weapon, you know? They would then trick out their gun to sort of match what they had used in these video games.\nGROSS: Despite the success of sales with the AR-15, there were still people within the gun industry, within the gun world, who objected to it. But there was a lot of pressure to keep those people quiet or to kind of push them out. And one example that is written about in The Washington Post series is Jim Zumbo. Tell us about him and the story of what happened when he objected to the AR-15.\nFRANKEL: Jim Zumbo was a well-known personality in the gun world. And, you know, he had a TV show. He had a column in gun magazines. He was just a well-known guy. And this was in the early 2000s - or late 2000s, you know, around 2006, 2007, when the gun is just sort of taking off and the gun industry is still getting sort of comfortable with this weapon itself. And he sort of came out and said, I don't think this is a good gun for hunting. It's still sort of a controversial point, you know, whether the AR-15 - you know, folks who love the weapon will say, oh, yes, you need it. It's perfect for hunting boars. But it's - you know, a lot of folks think that the bullet is so powerful. The same thing it does to human bodies, it does to an animal. It blows it apart. That's not great in general for hunting, especially if you're going to eat the meat. And so he came out with this, you know, very early on and said, you know, I just don't think - I think he called it a terrorist rifle.\nAnd the blowback was immediate. He lost his positions throughout the industry, his TV show, his column. He was sort of cast aside. And it actually became a sort of watchword within the industry that, you know, if you speak out against this gun, you're going to get Zumboed (ph). That's what we found, that finding folks who were willing to speak out about what they saw in the gun industry was really difficult. It's, you know, you're either with us or against us. And that made reporting very difficult. And we found a few people willing to talk with us and describe what they saw. But, you know, there was a lot of fear about being Zumboed.\nGROSS: Have you been to a lot of gun shows over the years?\nFRANKEL: I have, yeah.\nGROSS: And how have the displays for AR-15s changed in that period?\nFRANKEL: It's remarkable. And it's sort of been gradual, but then only when you look at it, you know, over several years that you sort of realize, oh, it wasn't always this way. And I think even folks who are around guns a lot, it's sort of that frog in the pot with the temperature slowly getting hotter. You know, you walk into a gun show or a gun store today and it's, like, black rifles, AR-15s - they call them black rifles - all along the wall and handguns in the display case. And that's pretty much it.\nI mean, again, we have this sort of, I think, still this popular notion of, you know, the hunting rifle, the wood-stocked hunting rifle that you load it, and then you fire it, and then you load it again. But what is being sold at gun shows and at gun stores today is a military tactical rifle, black rifle, that can fire, you know, 30 rounds without being reloaded, if not more. But for it to have such market dominance - you know, 1 in 4 guns manufactured these days - it's unmistakable. It's changed everything about the gun industry.\nGROSS: What about gun culture?\nFRANKEL: And gun culture, yeah. I mean, they're sort of intertwined. The gun industry is not a huge industry, but - so they are very closely tied to the culture itself. And, you know, they are making directly what folks want, and that is then reflected back in driving sales. So they sort of go hand in hand. I mean, you know, there's a group called Gun Owners of America. And their mascot - or their logo is a minuteman from the revolutionary times holding a musket. And, you know, there was some discussion - you know, I was talking to folks about this. There's some discussion within the group about changing that minuteman from holding a musket to holding an AR-15, right? So they're putting the AR-15 on that sort of pedestal as the iconic American weapon. And that's where, I think, things have really changed.\nGROSS: We're listening back to the interview I recorded last year with Todd Frankel, the lead reporter on the main story of a Washington Post series on the history of the AR-15, the weapon that was used in the assassination attempt against Donald Trump. The series won a Pulitzer Prize this year for national reporting. We'll hear more of the interview after a break. This is FRESH AIR.\n(SOUNDBITE OF MUSIC)\nGROSS: This is FRESH AIR. We're talking about the AR-15, the weapon that was used in the attempted assassination of former President Trump. Let's get back to the interview I recorded last year with Todd Frankel, the lead reporter on the main story of a Washington Post series on the history of the AR-15. The series won a Pulitzer Prize this year for national reporting.\n(SOUNDBITE OF ARCHIVED NPR BROADCAST)\nGROSS: So the Sandy Hook massacre in Newtown, Conn., the massacre in the elementary school back in 2012, how did that focus attention on the AR-15, which was the weapon that was used in that assault? One hundred fifty-four rounds were fired. Twenty children were killed. Six school employees were killed.\nFRANKEL: Yeah, that was a pivotal moment, right? You know, I think, for a lot of Americans, it's probably the first time they've really been introduced to this weapon. The wounds in there were devastating, kids, you know, just, frankly, torn apart by what happened in those classrooms. And folks were horrified. There was this - President Obama, you know, I think folks remember some of the speeches he gave immediately after. And then there was that tense standoff with the NRA about, you know, what are we going to do? And that's when they came up - Wayne LaPierre came up with that line of, you know, the only thing that stops a bad guy with a gun is a good guy with a gun. And there was that whole discussion about arming folks in schools.\nAnd there was that push to then - right? - resurrect the assault weapons ban and, what are we going to do? And that was the talk. And that failed. You know, even some Democrats have voted against that. And from there, that drove sales, too, right? So that happened, the Sandy Hook shooting happened in December of 2012. And an all-time record for FBI background gun sale checks was in that month, as folks, like, ran into gun stores and bought anything they had, but especially bought their AR-15s, believing that a ban was just around the corner. And when the political will behind that sort of faded and failed, I think it emboldened the gun industry then to say, all right, this gun is here to stay. And it became this, increasingly, sort of culture icon - right? - sort of figured where you stood on things is, do you support folks owning this sort of weapon?\nGROSS: There were some large stores, including some chains, that stopped carrying AR-15s, stopped selling them, after Sandy Hook. And the sales increased. There's still a lot of disillusionment about the weapon. How did the NRA and the gun industry push back against that?\nFRANKEL: You know, Dick's Sporting Goods sort of famously decided to stop selling the AR-15, although they would backtrack because they would sell it at a subsidiary store called Field and Stream for a little while. And then after the Parkland school shooting, they decided to get rid of AR-15s entirely. But the NRA went to some of these stores like Cabela's, you know, these big outfitters, and said - you know, had to reassure them that, like, yes, you might face pressure. But listen, you have to understand your customer. And that's where it becomes this cultural flashpoint, you know, where your customers, being gun owners, you know, want you to keep selling this, and you don't want to give in to the other side. So, you know, you're going to have to just weather this. And they - a lot of them held on and sort of kept selling it.\nI mean, I find it interesting that Walmart doesn't sell the AR-15 anymore. They stopped in 2015. The biggest retailer in the U.S. doesn't sell this sort of iconic American weapon. They stopped, they claim, because of demand. You know, it just wasn't there. But, you know, retailers, they don't want to be selling the weapon that's used in school shootings, but they also don't want to upset the side that believes that the AR-15 is just as good as any other gun and is important to our constitutional rights.\nGROSS: How did gun rights become a top issue for Republicans with often a focus on AR-15s?\nFRANKEL: Especially after the Newtown shooting and you had this sort of standoff between President Obama and the NRA, it was, again, that sort of - are you with us or against us? - sort of focus. And it became a political symbol, right? The NRA and Republicans saw that this was something that a lot of Democrats hated. They hated this gun. They hated the look of it. They hated what it had done. And they could campaign and fundraise and drive - it was a cultural wedge issue. It was a very potent one, too, right? I mean, it was pretty dependable, a pretty good predictor of how folks - what political affiliation they had was how they viewed the AR-15 because it had been just filled up with so much cultural significance that you could reliably tell how someone would vote based on their attitude towards this one gun.\nGROSS: So The Washington Post series describes the AR-15 as having become a political symbol in campaigns. How has it been used that way?\nFRANKEL: Yeah, just think about those - you know, we see this pop up in the news, those holiday cards from almost - well, certainly only Republican officials of their whole family holding an AR-15, you know, even the teenage kids, maybe even younger, holding AR-15s - to the TV ads, political ads where folks are firing AR-15s. You know, they might use to, maybe a generation ago, fire a hunting rifle to show that they understood that sort of thing. But now it is an AR-15 that carries much more political weight.\nWe had the handful of Republican congressmen and women who wore little AR-15 pins - right? - silver pins on their lapels on Capitol Hill to sort of show their allegiance, their support for gun rights. The AR-15 is very much this sort of signifier of your politics. And it has such a distinct outline of the gun - you know, the sort of clip coming down, the ammunition clip coming down and the long nose and the buttstock on it - that it's instantly recognizable. And so you put it on a bumper sticker. You put it on a T-shirt. And you put a slogan with it, like come and take it, and it's a great political signifier.\nGROSS: I want you to tell the story of C.J. Grisham and his use of the AR-15 in a political and an identity way.\nFRANKEL: C.J. Grisham was out for a walk with his son in rural Texas. And this is in 2013. And he has an AR-15 with him. And he's just walking down the side of this, like, dirt road, gravel road. And then he's stopped by the police officer, and the police officer, you know, says, why do you have this? And Grisham's answer is, because I can. And there's a slight scuffle. It's not a big deal. But he ends up later getting convicted of misdemeanor police interference. It seems like it's one of those things that could have gone away, except there was dashcam video of it. And...\nGROSS: So Grisham's the one who gets convicted?\nFRANKEL: Yeah. And so he is just sort of outraged by the way he was treated. I mean, he's not doing anything. He's just carrying this gun. We have to imagine, this is a decade ago, before open carry and these sort of - wearing it to public protests is almost a common thing. So when he did it, it was sort of still like, whoa, you know, what's going on? But he founds this group in Texas called Open Carry Texas advocating for carrying weapons in public. And it sort of just takes off, this idea that - and folks would - they'd start doing these, like, pop-up demonstrations, in Texas especially. And they would carry their hunting rifles, especially, and they would carry their hunting rifles, their shotguns, but also the AR-15s and just go into stores. They would go into Chipotles and Home Depots and just open carry. And it was one of those things that was interesting because this is, again, a decade ago, the Newtown mass shooting had only happened a year before.\nAnd the NRA actually criticized this. They thought it was a little weird. Actually, they called it downright weird that he was doing this. But then their membership got so upset with them that they backed off and said, all right, you know, no, we understand what he's doing. And now that idea, that movement of open carry, that you should be able to carry your AR-15 strapped across your chest or somehow not hide it when you're out in public, it's pretty commonplace. I mean, again, we've seen these, especially during the COVID lockdown protests at state capitals and stuff. You know, folks who were carrying these big military-looking assault rifles on their chest, and it sends a message. And it's sort of changed the tenor of different debates, I think.\nGROSS: The Second Amendment, as interpreted by gun activists and the gun manufacturers, the gun lobby - the Second Amendment is seen as upholding your right to carry any kind of gun. But no matter how you interpret the Second Amendment, it doesn't literally say anything about ammunition, about the bullets. There's been proposals to limit high-capacity magazines because that would limit the number of rounds somebody could fire off without having to reload and if they had to reload, might give an opportunity for somebody to tackle the mass shooter.\nFRANKEL: You know, it's a fascinating topic because the idea of limiting the number of bullets someone can hold in a single magazine, it sounds sort of, maybe, what's the point? But there's a lot of research that shows that that's perhaps a very American solution to this issue. If we're not going to get rid of the guns, at least give the folks who are caught in these horrible moments a shot at survival. This happened in Newtown where the gunman had to reload and when he reloaded, and even though you could be very quick with reloading, even those few precious seconds - they call it a critical pause. Some kids escaped. They ran out of the classroom. And the idea that if you interject and require some sort of forced pause in the shooting that it'll least limit the carnage. It won't avoid it all, because we're going to still have these guns, but at least with a ban on the size of the magazine, they at least give folks a shot at survival.\nGROSS: Well, Todd Frankel, thank you so much for talking with us. Thank you for your reporting for the series in The Washington Post.\nFRANKEL: Oh, thank you, Terry.\nGROSS: Todd Frankel was the lead reporter on the main story of a Washington Post series on the history of the AR-15. The series won a Pulitzer Prize for national reporting this year. The Post has reposted the series on its website. Our interview was recorded last year when the series was first published. After we take a short break, Ken Tucker continues his series on great albums that were recorded 50 years ago and revisits a Stevie Wonder album. This is FRESH AIR.\n(SOUNDBITE OF KYLE EASTWOOD'S \"SAMBA DE PARIS\")\nCopyright © 2024 NPR. All rights reserved. Visit our website terms of use and permissions pages at www.npr.org for further information.\nAccuracy and availability of NPR transcripts may vary. Transcript text may be revised to correct errors or match updates to audio. Audio on npr.org may be edited after its original broadcast or publication. The authoritative record of NPR’s programming is the audio record.",
  "word_count": 7064,
  "scraped_at": "2026-02-14T12:09:44.143893"
}