{
  "article_id": "f6cc4994e116",
  "url": "https://www.independent.com/2024/09/17/santa-barbara-athletic-hall-of-fame-inducts-six-new-members/",
  "title": "Santa Barbara Athletic Hall of Fame Inducts Six New Members",
  "date": "20240918T053000Z",
  "domain": "independent.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Six new members entered the Santa Barbara Athletic Round Table Hall of Fame during an induction ceremony Monday night at the Cabrillo Pavilion.\nThey included four athletes, who attended Santa Barbara area high schools, a requirement for eligibility for the Hall of Fame. All went to excel in college and beyond.\n— Sari Small (Carpinteria 1960). More than a decade before Title IX enforced the participation of women and girls in interscholastic sports, she competed in the first girls races at Carpinteria’s Russell Cup track and field meet, and later raced in college and AAU championships. Neil Ablitt, a Carpinteria schoolmate, spoke on her behalf Monday and recalled that football coach Marv Goux, who later was on the staff of national championship teams at USC, recognized Small’s ability by holding her back to lap other runners.\n— Russ Hafferkamp (Santa Barbara High 1972). He started playing on the high school’s first water polo teams and won All-American recognition at SBCC and UCSB. He coached water polo at several colleges and, as a senior player, won 26 Masters Division titles.\n— Elysia Hodges Mitchell (San Marcos 2011) Her name is all over the track and field record books at San Marcos and Westmont College, where she competed after high school. As the finisher of the 4×400 relay, she brought San Marcos to third place in the CIF State Championships. She set 11 records at Westmont – nine still stand – and was a 12-time NAIA All-American.\n— Stamatia Scarvelis (Dos Pueblos 2014). A three-time state champion in the CIF girls shot put, she also won a discus title in 2014. At UCLA and Tennessee, she gravitated to the hammer throw. She was SEC champion in the hammer and placed third in the NCAA. She is a two-time Olympian, representing her family’s home country, Greece, at Tokyo three years ago and Paris this summer.\nTwo other new Hall of Fame members were dedicated professionals.\n— Coach: Ed Gover. He guided SBCC women’s volleyball for 28 years. He said he didn’t look at wins and losses but at the experience of his athletes; nevertheless, the Vaqueros had a winning percentage of .873 in their last 10 years of conference competition.\n— Special Achievement: Dave Loveton. In his 25 years as a sports writer for the Santa Barbara News-Press and 16 more as SBCC’s sports informational specialist, he was known for his enthusiasm and his attention to detail. He died from cancer in 2021. His longtime colleague Barry Punzal was emotional in presenting Loveton’s name for induction.\nThe Round Table held its first annual Hall of Fame ceremony in 1968, and Monday’s event began with a tribute to the organization’s late founders, Jerry Harwin and Caesar Uyesaka. They were successful businessman who wanted to support grass-roots sports in the community. Harwin’s name is on the roadway entering Elings Park, and UCSB’s baseball stadium is named after Uyesaka – representing two other special projects they advocated.\nLoveton’s memoriam: https://www.independent.com/2021/10/07/dave-loveton-1958-2021/",
  "word_count": 494,
  "scraped_at": "2026-02-14T14:14:52.779641"
}