{
  "article_id": "f6ce0dba43d1",
  "url": "https://punchng.com/fans-query-oshoala-abiodun-omission-from-france-friendly/",
  "title": "Fans query Oshoala , Abiodun omission from France friendly",
  "date": "20241126T023000Z",
  "domain": "punchng.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Football enthusiasts have expressed dissatisfaction over the omission of key players Asisat Oshoala and Deborah Abiodun from the Super Falcons’ squad announced for the international friendly against France on November 30.\nThe 20-woman list, unveiled by the Nigeria Football Federation on Sunday, includes five home-based players and 15 foreign-based professionals.\nWhile Saudi Arabia-based Ashleigh Plumptre returns after a six-month injury layoff, the absence of some notable names has sparked debate among supporters.\nOn social media platform X (formerly Twitter), fans were vocal about their concerns.\nAugustine @AustinL71449 lamented, “Now I see the reason why the squad list was delayed. Seems like a lot of players were unavailable from their clubs. This list is too weak, especially the forward and defence.\n“I was expecting to see (Esther) Onyenezide, (Deborah) Abiodun, (Sebastian) Flourish, (Chinwendu) Ihezuo, and (Esther) Ajakaye.”\nAyo Dawson directly queried the exclusion of Barcelona striker Asisat Oshoala, writing, “Where’s Agba Baller?”\nSimilarly, Adejoke @Jhokzy added, “Where’s Deborah Abiodun?”\nJE @Jval222 was perplexed, asking, “Where is Ajibade and Oshoala, even Deborah I can’t see, or am I not seeing well?”\nHis Majesty @TalmudicSage listed other absentees, stating, “Is this the full squad tho? Where are the following players: Deborah Abiodun, Oshoala, Rasheedat Ajibade, (Halimatu) Ayinde, Gift Monday..?”\nSome fans were more understanding but still critical as Gotti22 @9jaRealist speculated, “On the presumption that Deborah Abiodun is unavailable for this game (and Edo Queens players are being given a rest), it’s a decent-ish list. Good luck, ladies.”\nOthers, like Bonaeffective @walexywalexy, kept their message simple, asking, “Where is Deborah????”\nThe friendly against Les Bleues is being regarded as a preparatory test for the Falcons as they gear up for the Women’s Africa Cup of Nations in Morocco next summer.\nThe match, scheduled for 9:30 pm France time at Stade Raymond Kopa in Angers, is part of Coach Justin Madugu’s efforts to rebuild the team ahead of the tournament, where Nigeria is grouped with Tunisia, Algeria, and Botswana.\nHowever, the absence of captain Rasheedat Ajibade due to injury and the glaring omission of Oshoala and Abiodun have left fans questioning Nigeria, ranked 36th in the world and the team’s strength against a formidable French side who are ranked 10th in the World.\nMadugu will hope the players at his disposal can rise to the occasion and give a good account of themselves against one of Europe’s strongest teams, even as fans continue to demand answers about the absence of their favourites.",
  "word_count": 408,
  "scraped_at": "2026-02-14T12:52:52.059520"
}