{
  "article_id": "f6d8442ea6e0",
  "url": "https://www.thenationalnews.com/news/uk/2025/09/05/yvette-cooper-replaces-david-lammy-as-uk-foreign-secretary-in-major-reshuffle/",
  "title": "Yvette Cooper replaces David Lammy as united kingdom Foreign Secretary in major reshuffle",
  "date": "20250905T190000Z",
  "domain": "thenationalnews.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "A major reshuffle in the British cabinet, sparked by the resignation of the deputy prime minister, has seen David Lammy elevated from his post as foreign secretary.\nOnly hours before he was due to take off for a flight to the Gulf for high-level meetings on Gaza, Mr Lammy was told by Prime Minister Keir Starmer that he would instead become deputy prime minister.\nThe British leader has attempted to make an opportunity out of a crisis by instigating a significant shake-up of his beleaguered government, following Angela Rayner’s departure for breaching the ministerial code through incorrect tax payments on a property transaction.\nMr Lammy, who will also hold the portfolio of justice secretary, is being replaced by Labour veteran Yvette Cooper, a stalwart of the Tony Blair years, who will leave her post at the Home Office.\nShabana Mahmood will become the first Muslim woman to head the Home Office after a successful stint as justice secretary that included tackling the issue of overcrowded prisons.\nMr Lammy had overseen the UK's response to the Gaza war and faced pressure from within Labour for a clearer stance on Israel's conduct in the conflict.\nAs he tried to build relationships with Arab nations he sought alignment on a Gaza ceasefire, access for humanitarian aid and progress toward a two-state solution.\nHe had been due to travel for meetings with Gulf nations focused on rebuilding Gaza after a ceasefire, before the reshuffle took place.\nMr Lammy had developed a strong relationship with US Vice President JD Vance as well as his French counterpart Jean-Noel Barrot.\nLabour veteran\nMs Cooper will take on a significant portfolio, which will include navigating Britain’s path to recognising a Palestinian state at the UN General Assembly later this month.\nThe journalist-turned-politician has served every Labour prime minister this century.\nAs home secretary, Ms Cooper was handed the toughest job in government when the Labour returned to power in July 2024.\nThe task was to stop the flow of tens of thousands of migrants arriving on small boats to seek asylum in the UK.\nThe crisis has only grown during her tenure with more than 110,000 asylum seekers, a quarter of whom are living in hotels.\nSeveral of these hotels have become flashpoints with flag-waving crowds demonstrating against the accommodation policy.\nAn Oxford and Harvard graduate, Ms Cooper is very familiar with US politics. Her husband, Ed Balls, is a former politician who presents breakfast TV and hosts a prominent political podcast.\nA trained economist, she has been a leading figure in feminist politics and was the first minister to take maternity leave.\nCrisis relaunch\nMr Starmer had promised to restore some stability to government after the years of Conservative chaos by stating that the holders of the major offices of state would remain in post for several years.\nHis hand was forced by Ms Rayner’s resignation after a week of negative headlines, although he had also been looking for the opportunity to “reset” his government after a year of turmoil and botched policymaking.\nWith Nigel Farage’s far-right Reform party surging in the polls, and Labour a good 10 points behind them, Mr Starmer hopes his drastic shake-up of government will bring about some stability.\nHowever, that will come under severe pressure in November when Chancellor Rachel Reeves delivers her budget, which is intended to reverse Britain’s gloomy economic outlook.\nDowning Street was quick to state on Friday that Ms Reeves would remain in post, but her political future is tied to the UK’s economic health.\nCode breach\nMs Rayner resigned as deputy prime minister, housing secretary and deputy leader of the Labour party after she was found to have breached the ministerial code of ethics. She underpaid the tax due on the purchase of a flat on the south coast while maintaining an interest in her constituency home in the north of England, through a trust which handles the affairs of her disabled son.\nShe had referred herself to the government’s ethics adviser Sir Laurie Magnus who swiftly investigated the case.\nHe stated that it was “deeply regrettable that the specific tax advice was not sought”.\nMs Rayner had failed to comply with the “overarching duty” on government ministers to “comply with the law and protect the integrity of public life”.\nSir Laurie said she had failed to meet the “highest possible standards of proper conduct”.",
  "word_count": 729,
  "scraped_at": "2026-02-14T12:12:13.172087"
}