{
  "article_id": "f6e79d234476",
  "url": "https://www.nytimes.com/athletic/5763279/2024/09/13/colombia-modern-rivalry-argentina/",
  "title": "Colombia hot streak ignites a modern rivalry with World Cup champion Argentina",
  "date": "20240913T110000Z",
  "domain": "nytimes.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "BARRANQUILLA, COLOMBIA — As soon as you walk out of the air-conditioned Ernesto Cortissoz International Airport in Barranquilla, the city’s sweltering heat provides an especially warm welcome. Locals say the weather in September is cool and manageable. Arrive in June or July, though, and the heat is unbearable.\nAdvertisement\nThe drive from the airport to Barranquilla’s main city center takes roughly 40 minutes. There’s a new toll road that allows drivers to avoid the stop-and-go traffic that characterizes the coastal city. The views are unspectacular, but from the car window, you can see trees for miles, a glimpse of the Magdalena River, and a desert-colored landscape that has inspired one of Barranquilla’s many nicknames, ‘la arenosa’ — the sandy one.\nThis week, hundreds of people traveled from different parts of Colombia and cities throughout the United States to support the only undefeated team in South America’s high-stakes World Cup qualifying tournament. The opponent has attracted hordes of travelers, too: Argentina, the reigning World Cup champion and the team that snapped Colombia’s 28-game unbeaten run earlier this summer.\nColombia has been flying under Argentine manager Nestor Lorenzo. The 58-year-old former teammate of Diego Maradona has lost just once in 28 games since taking charge at the end of 2022. The lone defeat came in July in the Copa America final played in Miami against Argentina, the tournament’s defending champion. Lorenzo has become a celebrity in Colombia. His detractors have said that he hasn’t won anything yet. Colombia plays well and his side has proven that it can compete with any national team in the world, but win streaks and flair don’t trump trophies.\nLorenzo has orchestrated friendly wins over Germany and current European champion Spain, two teams Colombia had never defeated before. Colombia outlasted Brazil 2-1 in November, recording its first win over the five-time world champions in a World Cup qualifier. Then Colombia reached their first Copa America final in 21 years after eliminating Uruguay in the semifinals earlier that summer.\nLorenzo has also resurrected the form and career of James Rodriguez and built a youthful and energetic team around the 33-year-old playmaker. The loss to Argentina in Miami was a big blow to Colombia’s newfound success. They had taken Argentina into the final moments of extra time with the score 0-0, only to lose in the 112th minute on a goal from Lautaro Martinez.\nAdvertisement\nDespite Colombia’s wonderful tournament in the U.S., Argentina had once again proven superior, which has historically been the case between the two nations. Today, Argentina and Colombia are the top teams on the continent. They clashed again in Barranquilla — this time for three vital points ahead of the 2026 World Cup. Colombia sought revenge and a place among the world’s elite. Argentina looked to slow Colombia’s rise and quietly begin a World Cup cycle that may not include Lionel Messi.\nThe taxi’s radio volume was awkwardly high. In between classic salsa hits and vallenato songs, the musical genre that defines Colombia’s coast, the radio DJ reminded listeners that Colombia will host Argentina in two days at Barranquilla’s imposing Estadio Metropolitano Roberto Melendez.\n“The Metropolitano will become an inferno when Argentina comes to town!” the radio host exclaimed.\nA 3:30 p.m. kickoff under the hot sun all but guaranteed that his description wouldn’t be far-fetched. The Colombian players and fans embrace the heat. When results are positive, the scorching temperature becomes a competitive advantage and a source of pride. In Colombia, the press had jumped all over Argentina manager Lionel Scaloni’s comments after his side dismantled a listless Chile side 3-0 in Buenos Aires. A trip to Barranquilla is never easy, but Argentina arrived in Colombia with an extra day’s rest.\n“Now we’ll go to a place where it’s very hot to play at a time of day that shouldn’t be allowed,” Scaloni told reporters during his post-match press conference on September 5. “But that’s like saying we can’t play at altitude. There are always challenges. They’ve decided to play at that time. We’ll go there. It’ll be a difficult match. Colombia’s a great team.”\nSocial media accounts conveniently replayed the first part of Scaloni’s comment on loop, which attracted reactions from media members and banter from fans. News outlets throughout South America led their reports with what appeared to be a complaint by the manager of the world’s best national team. In his pre-match press conference, Lorenzo didn’t take the bait when asked about Scaloni’s apprehension about playing under Barranquilla’s afternoon sun.\nAdvertisement\n“Scaloni later said that both teams have to deal with the heat. It’s not a big deal. We know that Barranquilla has a unique climate and we can adapt a bit more due to the experience of our players,” he said. “The majority of Argentina’s players are based in Europe. It’s nothing new that it gets hot here. Enjoy the match and avoid creating controversies.”\n“Colombia is like a visiting team in Barranquilla,” said Gerardo, a local Uber driver. “The entire squad plays abroad. The heat won’t benefit Colombia. It’s going to be brutal for both teams.”\nMore than dealing with rising temperatures, Colombia faced off against history, one that they’re not proud of. Despite an electric atmosphere at the 46,000-seat Estadio Metropolitano, Colombia had not defeated Argentina in Barranquilla since 1993. The results have been lopsided, but Argentina versus Colombia has become a modern rivalry in South America, with both teams featuring globally known stars and young talent.\nWhile Rodriguez, 33, is Colombia’s talismanic captain, Liverpool’s Luis Diaz has become the face of the national team. Diaz is plastered on billboards throughout Barranquilla. Before moving to Porto in Europe in 2019, Diaz, 27, sprinted down the right flank of the Metropolitano wearing the colors of Barranquilla’s Atletico Junior. He’s a hometown hero.\nColombia has a strong Premier League presence, as well, which is perhaps the best barometer for measuring their current pool of players. Lorenzo’s starting 11 against Argentina included five players who wear Premier League kits. Diaz started alongside Crystal Palace players Daniel Munoz and Jefferson Lerma, while Wolverhampton Wanderers defender Yerson Mosquera and Aston Villa’s Jhon Duran each earned their first senior team starts. Budding midfield star Richard Rios of Palmeiras and Fluminense’s Jhon Arias have also become key members of the squad.\nAgainst Colombia on Tuesday, Argentina trotted out an 11 that included four Premier League players (Emiliano Martinez, Aston Villa; Lisandro Martinez, Manchester United; Cristian Romero, Tottenham Hotspur; Enzo Fernandez, Chelsea). A formidable front line of Julian Alvarez and Lautaro Martinez and a deep bench tilted the odds in Argentina’s favor before kickoff, but it felt like a new-look side.\nMessi was unavailable as he continues to recover from a high ankle sprain sustained during the Copa America final. Angel Di Maria retired from international football after the tournament and his absence is just as significant. Argentina is capable of winning games without Messi. It has done so on numerous occasions and the Albiceleste tend to play faster and more directly without the eight-time Ballon d’Or winner. Scaloni said after the match in Barranquilla that “new energy” is always welcomed in the squad. Messi is expected to return to the national team in October when qualifiers resume. Lorenzo, however, was relieved Messi had stayed in Fort Lauderdale, Florida.\nAdvertisement\n“Nobody wants to face Messi,” Lorenzo said. “It’s very difficult to predict how to mark him because if he gets away from you once or if you give him two meters, then he’ll win the game for you. Players like that don’t exist, there aren’t many. So at least he’s not playing, it gives us peace of mind.”\nThe Estadio Metropolitano is a 30-minute drive from downtown Barranquilla. It’s a massive yet dated concrete structure with a deep history within Colombian football. Atletico Junior are 10-time winners of Colombia’s Primera A tournament. The red-and-white-striped club has been home to notable players like Diaz, Carlos Valderrama, Ivan Valenciano, and Brazilian legend Garrincha, who made just one appearance for Junior in 1968.\nJunior is very well supported. It’s a well-respected institution in Barranquilla, but internationally the city is known as the proud home of the Colombian national team. The nation’s capital, Bogotá, was the host city until the late 1980s. It is a cosmopolitan city with global appeal, but Barranquilla’s love for the national team is arguably unmatched.\n“The Colombian national team is the most important sporting reference for Colombians,” said a gentleman who calls himself “El Tigre Colombiano”. Dressed colorfully in yellow, blue and red and sporting face makeup that resembles a tiger, he recounts how he has traveled around the world and supported the national team for over a decade.\n“The national team unites us,” he continued. “Colombia has been divided for so many years, but when Colombia plays we all have the same objective: to win. We support the squad in good times and bad.”\nOn game day, the city is painted in yellow. Men, women and children all wear Colombia’s famous yellow shirt. Colombian flags adorn local businesses and are hung outside apartment buildings. Children are excused from attending school when Colombia plays in the afternoon.\nSecurity was tighter than usual for a big international match, with the mayor’s office announcing that 1,500 police officers would patrol the ground. Fans with tickets have to bypass several checkpoints located roughly a mile from the stadium’s main entrance and police in military-grade riot gear stood attentive along the route. This was standard operating procedure for Colombian authorities and a stark contrast to how CONMEBOL had approached security during the Copa America in the U.S.\nGO DEEPER\n'It was inhuman': Why the Copa America final was delayed and dangerously close to disaster\nPlus, there’s an added buzz when Argentina is the visiting team. Among the over 40,000 yellow-clad fans sat one lone Argentina supporter with a peculiar sense of fandom. Omar, 42, is a Barranquilla-born Argentina fan in a Di Maria kit who is steadfast in his support for the three-time world champions.\nAdvertisement\n“It’s a really complicated subject, but Argentina is the national team I’ve supported since the 1986 World Cup in Mexico,” he said before kickoff. “I was a child and I witnessed Maradona’s incredible World Cup. I was hooked from that moment. I’ve never worn another national team shirt. Only Argentina’s shirt because in football you can’t wear two shirts. I’ve been exclusive to Argentina since 1993.” He never cracked a smile and spoke nervously as Colombian fans walked past him, some glancing questionably at his choice of wardrobe.\n“It’s been really hard because we live in a violent society,” Omar continued. “A society that for a lot of people feels intolerant. When you wear the shirt of an opposing team, that can lead to physical violence. I’ve had to tolerate that. I’ve had to suffer through matches. Three years ago at this stadium, I was involved in an altercation with some fans who had been drinking. But those are the types of people that I have to deal with.”\nThere is, however, mutual respect between Colombia and Argentina. It’s not a clasico rooted in hatred and prestige like Brazil-Argentina, yet the rivalry between the current Copa America champions and runners-up has at times been fueled by unsavory moments and insults.\nIn 1993, Colombia traveled to Buenos Aires for a pivotal World Cup qualifier. Colombia won 5-0, a historic win and the worst defeat Argentina has suffered at home. The Colombian press reported the following day that racial slurs had rained down from the Estadio Monumental stands throughout the match.\nIn 2001, Argentina refused to travel to Colombia for the Copa America, which was hosted by Colombia as political violence and narcoterrorism took hold over the country. Argentina, then coached by Marcelo Bielsa, pulled out of the tournament, which was perceived as a slap in the face by the tournament’s organizers. Colombia won the competition that year.\nOn Tuesday, sections of the Estadio Metropolitano whistled loudly during Argentina’s national anthem. When the momentum shifted in Colombia’s favor, notably after Rodriguez’s 60th-minute penalty (a dubious call that went to the video assistant referee) gave Colombia a 2-1 lead, sectors of the Metropolitano chanted homophobic slurs at the Argentine players. Emiliano Martinez in particular was the target of the Colombian supporters every time he touched the ball.\n“I don’t think they should’ve jeered our national anthem,” Argentina midfielder Rodrigo De Paul told reporters after the match in a video shared by TyC Sports. “And the game should’ve been played at a different time of day, but it’s normal. Every team seeks an advantage when they face the best national team in the world.”\nAdvertisement\nMartinez was later accused of “an act of aggression” by the Colombian Association of Sports Journalists after he slapped a television camera off the shoulder of a local cameraman. “Out of the blue he slapped me,” the cameraman told RCN Deportes on Wednesday. “I felt angry, very angry. I was working, just like he was. He was playing and I was shooting with my camera.”\nThe raucous crowd was in raptures after the final whistle. The 2-1 scoreline held and Rodriguez was the hero again. Crowned the best player at the Copa America, Rodriguez engineered another win with one goal and an assist on the day. He became the eighth player in CONMEBOL’s history to score at least once against every South American nation.\nDespite the bad blood displayed throughout the 90-minute affair, the Colombian supporters applauded the visitors as they came off the pitch — a sign of respect that’s not often seen in South America.\nArgentina remains the top team in the world. The loss to Colombia, their second defeat during the current qualification process, won’t change that. Moreover, Colombia doesn’t have the number of titles that Argentina, Brazil and Uruguay have won in South America, but they’ve gained valuable ground in the region’s upper echelon.\nUntil Tuesday’s win, Colombia had never defeated Argentina and Brazil in the same qualification process. After, Colombia’s players spoke about a new mentality and how they’ve turned the page after the heartbreak they suffered against Argentina in Miami. They are now two points behind Argentina nearly halfway through the pre-World Cup tournament.\n“Teams will grow after obtaining an important victory,” Lorenzo said during his post-match press conference. “What do I mean? They know what it takes to win. You can learn from losing, but when you win you install a series of habits that are needed. These wins allow you to raise the ceiling and the challenge is to maintain that high standard.”\n(Top photo: Gustavo Pagano, Andres Rot, Raul Arboleda/Getty, Felipe Cardenas/The Athletic; Design: Dan Goldfarb)",
  "word_count": 2443,
  "scraped_at": "2026-02-14T12:48:22.100188"
}