{
  "article_id": "f6fc3ed6faec",
  "url": "https://www.rnz.co.nz/news/sport/485590/fifa-applauds-world-cup-debutants",
  "title": "FIFA applauds World Cup debutants",
  "date": "20230308T184500Z",
  "domain": "rnz.co.nz",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "FIFA General Secretary Fatma Samoura applauded the eight nations who are debuting at the Women's World Cup in celebration of International Women's Day, urging the players to take pride in their ability to inspire.\nHaiti, Morocco, Panama, Philippines, Portugal, Ireland, Vietnam and Zambia will debut at the global women's football showcase that runs from July 20-Aug. 20 in Australia and New Zealand.\n\"Seeing you ladies who are mothers, sisters, students and athletes. Women they identify with, excelling on the pitch,\" Samoura said in a statement.\n\"This will encourage a generation of young girls and women to aim high, to aim big. To advocate for themselves and to take themselves beyond greatness, on the pitch but also, in life.\"\nSeveral other sports figures championed women and applauded progress on International Women's Day, which has its roots in the U.S. socialist and labour movements of the early 20th century when many women were fighting for better working conditions and the right to vote.\nEngland's Lionesses cheered a UK government pledge that every girl in Britain will have equal access to football in school - a cause the national women's team had been supporting since capturing the Euro 2022 title last August.\nSchools will be expected to deliver a minimum of two hours of P.E. (physical education) per week and ensure that girls have equal access to all school sport, including football.\n\"An announcement that will change women's football in England forever, and the start of something truly special,\" the Lionesses said in a statement. \"We see this as only the beginning.\"\nHayley Wickenheiser, a four-time Olympic hockey champion for Canada, praised her parents in a celebratory Instagram post.\n\"My mom was an amazing female role model who advocated for women's rights, and my dad an amazing male role model who believed a little girl could do anything a little boy could do,\" she said. \"They were a big reason I was able to break down barriers and finish medical school.\"\nInternational Tennis Federation president David Haggerty called on men to step up in the fight for gender equality.\n\"The role of men cannot be underestimated,\" Haggerty said in a statement. \"It is our combined duty and responsibility to work out the best way to redress gender imbalance.\"\nThe ITF launched the Men as Allies programme, an element of the ITF Advantage All gender equality strategy.\n\"It's time to start championing the champions,\" said Haggerty, who is a United Nations HeForShe Champion. \"We invite male leaders across all aspects of tennis to become Advantage All Male Allies.\"\nAccording to the ITF, allies will be expected to commit to make a tangible contribution toward gender equality goals.\nSebastian Coe championed female leadership in a Twitter video, saying having women in positions of influence makes for a better organisation.\nAdding that \"I'll be maybe a little controversial,\" Coe suggested that if World Athletics had more women in leadership positions during some of the organization's darker years of the past, the challenges might not have been so profound.\n-Reuters",
  "word_count": 503,
  "scraped_at": "2026-02-14T13:03:00.764127"
}