{
  "article_id": "f70c97b603ff",
  "url": "https://www.90min.com/posts/women-s-champions-league-quarter-final-semi-final-draw-revealed-2022-23",
  "title": "Women Champions League quarter - final & semi - final draw revealed",
  "date": "20230210T133000Z",
  "domain": "90min.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Women's Champions League quarter-final & semi-final draw revealed\nBy Ali Rampling\nEuropean champions Lyon will face WSL winners Chelsea in a blockbuster Champions quarter-final clash.\nThe draw for the quarter-finals and semi-finals of this season's competition took place at UEFA headquarters in Nyon, Switzerland on Friday, and was conducted by former England striker Ellen White and UEFA's head of women's football Nadine Kessler.\nChelsea - the last WSL side to reach the Champions League final back in 2020 - will take on record eight-time winners and defending champions Lyon.\nArsenal - the only English team to win the competition, having triumphed back in 2007 - will face Bayern Munich - the only team to beat Barcelona this season.\nLast season's beaten finalists Barcelona have been drawn against Champions League debutants Roma.\nTwo-time European champions Wolfsburg will face two-time runners up PSG.\nThe semi-final draw was also conducted on Friday, and will see the winner of PSG vs Wolfsburg face the winner of Bayern Munich vs Arsenal. Whoever comes out on top between Lyon and Chelsea will face either Roma or Barcelona.\nShould Lyon and Barcelona both win their quarter-final ties, one of this year's semi-finals will be a rematch of last season's final.\nWomen's Champions League quarter-final draw\n- Bayern Munich vs Arsenal\n- Lyon vs Chelsea\n- Roma vs Barcelona\n- PSG vs Wolfsburg\nWomen's Champions League semi-final draw\n- PSG or Wolfsburg vs Bayern Munich or Arsenal\n- Lyon or Chelsea vs Roma or Barcelona\nWhen are the Women's Champions League quarter-finals?\nThe first legs of the quarter-finals of the Women's Champions League will take place on Tuesday 21 and Wednesday 22 March. The second legs will be played a week later on Tuesday 28 and Wednesday 29 March.\nWhen are the Women's Champions League semi-finals?\nThe first legs of the Women's Champions League semi-finals take place on Saturday 22 and Sunday 23 April. The second legs take place the following week on Saturday 29 and Sunday 30 April.\nWhen is the 2023 Women's Champions League final?\nThe 2023 Women's Champions League final will take place on Saturday 3 June at 17:00 (BST). The Women's Champions League final will be played at the Philips Stadium in Eindhoven, home to PSV.",
  "word_count": 372,
  "scraped_at": "2026-02-14T12:21:28.699176"
}