{
  "article_id": "f71df7410f2f",
  "url": "https://www.bbc.co.uk/sport/football/62016998",
  "title": "Who is Sarina Wiegman: England v Spain World Cup final - the mastermind behind the Lionesses' success",
  "date": "2023-08-18T13:53:44.000Z",
  "domain": "bbc.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_bbc",
  "body_text": "Who is Sarina Wiegman: England v Spain World Cup final - the mastermind behind the Lionesses' success\n- Published\nSarina Wiegman's list of achievements is as long as it is impressive.\nWhen England take to the pitch at Sydney's Stadium Australia on Sunday for their Women's World Cup final against Spain, it will be the Dutch coach's fourth major tournament final in a row.\nSince becoming an international football manager in 2017, the 53-year-old has masterminded back-to-back wins at the Women's Euros, first with the Netherlands in 2017 and then with England in 2022.\nThose two triumphs were separated by a defeat for her native country in the 2019 World Cup final against serial winners the United States.\nHere, BBC Sport speaks to some of the players and coaches she has worked with over the years to get an insight into the woman attempting to make history again by leading the Lionesses to their first world title.\nThe player\nIt was on the streets of the Hague that Wiegman first discovered football, playing alongside her twin brother at a time when there were no girls-only teams. She was called up by the Netherlands for the first time in 1986, aged 16, and later moved to the US for a year to study and play football at the University of North Carolina (UNC).\nWiegman's university team, the North Carolina Tar Heels, weren't any ordinary side, with future World Cup winners Mia Hamm and Kristine Lilly also in the ranks.\nLilly, who would go on to become the most-capped player in the history of the sport with 354 appearances for the United States, has fond memories of sharing her freshman year with the Dutchwoman.\n\"I can picture her smile - there were always some laughs going on,\" she says. \"She was nice, friendly, and a very crafty midfielder, so I loved having her on my team. She worked hard.\n\"As a player she had this little feistiness, competitiveness about her, that I think now as a coach you wouldn't see from her as much, because you have to be on an even keel. But as a player, I can see her game face, and it was tense when she played. I loved that.\"\nWiegman has spoken of being anxious as she embarked on that first trip to the US, saying she was completely out of her comfort zone, but her nerves weren't apparent to those looking on.\n\"I don't think it was a daunting experience for her,\" says Anson Dorrance, who ran the women's soccer programme at UNC before he became the USA's national coach.\n\"She was already a Dutch international, travelling all the time. She didn't appear in the least to be self-conscious or paranoid or afraid. She appeared wonderfully well-adjusted.\n\"We embraced her immediately. All we could see was an immediate adjustment to the American culture. The Dutch would be called the Americans of Europe - a swashbuckling nation, very frank and direct. She fitted right in.\"\nThe apprentice coach\nWiegman combined her playing career with teaching PE, then started football coaching when she retired as a player. When the Women's Eredivisie was created in 2007 she landed her first full-time job as a coach at ADO Den Haag, having initially turned it down when it was only offered on a semi-professional basis.\nFormer Netherlands international Leonne Stentler was one of the players Wiegman took to ADO Den Haag in her first season there.\n\"The way she welcomed me and the way she talked about how she wanted to do it was warm but really ambitious,\" says Stentler.\nShe recalls an unusual rule from Wiegman's early days that prevented anybody in the team being allowed to take a drink of water by themselves - it had to be done together.\n\"At first she was a hard coach with a lot of rules, but during the first year she made so many changes and worked on herself,\" she says.\n\"I know she reads a lot of management books so that was what she was doing and we experienced all the exercises she read about. We really felt the development of ourselves, but also the development of her.\"\nInitially, a lively pre-match dressing room, with music blaring, would leave the new manager perplexed.\n\"Sometimes I looked at her and she couldn't understand why people were dancing and laughing - she was like: 'You should be concentrating and focusing on the game… this is going to be a disaster',\" says Stentler.\n\"She had to learn that that was the preparation for some specific characters.\"\nWiegman spent seven years at the club, but Stentler says those first few months were the biggest learning period for the future England coach.\n\"She let us find out what rules worked for us but she would make sure the frames were really clear,\" she said. \"Inside those frames, we were totally free.\"\nThe assistant\nAfter seven years at Den Haag, Wiegman became assistant coach of the Netherlands national team. To continue her development as a coach, she became one of a handful of Dutchwomen to earn the Uefa Pro Licence - the highest coaching course in the professional game.\nAs part of the requirements of her Pro Licence course, Wiegman needed to carry out an internship. She wrote to Sparta Rotterdam head coach Alex Pastoor, asking if she could coach at his club - a men's team in the Dutch second tier.\nPastoor says Wiegman, the first female coach on his team, came across as very \"serious\" about her work.\n\"She had the experience of playing herself,\" he says. \"The tactical things, we all discussed together. She took part in it and saw the same things we saw.\n\"As a coach, you need to have a certain leadership and authority, and this was something she had when she was leading parts of the training.\"\nWhen the season finished, Pastoor asked Wiegman to return as assistant to the under-23 team, making her the first female coach in Dutch professional men's football. That was cut short, however, when the national team required more of her time.\nBut Pastoor has no doubt she would have flourished whichever route she chose.\n\"I honestly think if she would coach at a professional men's football team in Holland, she would succeed,\" he says.\nThe leader\nWiegman twice stepped up as interim head coach of the Netherlands before taking the job permanently in January 2017. She won the Euros seven months later, and led the team to the World Cup final in 2019. She took over as England manager in September 2021.\nWiegman took over a Dutch squad low in morale and, because of her association with the previous regime, she had to win over the players and her new staff. That included vastly experienced coach Foppe de Haan, who was brought in to assist Wiegman.\n\"In the beginning we had to find our place,\" says De Haan. \"We made an agreement about what was my part of the job, and what was her part of the job.\"\nYet despite De Haan being older and more experienced, he says Wiegman was very comfortable in the leadership role.\n\"She knows what she wants, but she was also open and keen to hear other people's ideas.\"\nTrying to get her to switch off during that first tournament was more difficult, though.\n\"She's a workaholic,\" says De Haan. \"Every day, every moment she is working, working, working. I told her: 'You have to take the rest. You have to relax sometimes.' I tried to delegate to the others.\"\nThere were stressful moments during that first tournament but De Haan says one of Wiegman's strengths is \"she is always calm, she never panics\".\nDutch international Vivianne Miedema was part of her Euro-winning team, and she describes Wiegman as playing a big role in her career, having joined the set-up when she was 18 when Wiegman was the assistant.\n\"Not many coaches out there are open to discussions, but she was always open to having a footballing discussion with someone,\" she says. \"I really enjoyed that because it made me a better player.\"\nMiedema says they were fortunate not to experience losing very often under Wiegman's leadership but she does remember a bad performance they put in against Spain after winning the Euros.\n\"At half-time she came in and said 'guys this isn't good enough but also I wasn't good enough before the game'.\n\"So she was very open and honest. We fixed it up together as a team and the coaching staff.\"\nWhen Wiegman became England manager, she took over a squad short on confidence and in a state of transition.\nBut she knew exactly how to bring the players together.\nLionesses goalkeeper Hannah Hampton recalls the new head coach turning one room at the team's training base into a \"massive firepit with beanbags, hot chocolate, the lot\".\nIn that homely environment, the players were encouraged to share their stories and create bonds with their team-mates.\n\"I think from then it changed everyone's attitude and the atmosphere changed... you definitely felt closer to one another and we definitely all looked out for each other.\n\"We are just a massive family.\"\nCalm, clear and direct are words that crop up regularly when people are asked to describe Wiegman.\nStriker Beth England calls her a \"very good people person\" but adds: \"She tells us when things aren't right; and she's not shy to be savage and brutal when she needs to be.\"\nAfter plotting England's victory at Euro 2022, many of the players commented afterwards how the coach had made their roles clear from the start - whether that was as a starter, a super-sub, or a squad player, they knew where they stood.\n\"She's honest and up front and as a player I respect that,\" says striker Alessia Russo. \"It's nice to have an honest conversation.\n\"She is a winner. She sets the standards so high in training and she leads with real class. It's great for us because it's so competitive and everyone is so focused on one goal but away from the pitch she let's us relax which is so important. She makes camp a really fun place to be.\"\nBaroness Sue Campbell, the director of women's football at the Football Association, said they knew they were getting a great coach when they appointed her but didn't realise they were getting such a \"unique person\".\n\"She's built a collective - not just among the players, but the team around the players - which is very, very special. I've not seen anything like it in all my time in sport.\n\"She is a quite remarkable leader and a very special person.\"\nThe person\nWiegman was born in the Hague, in 1969, and is married to Marten Glotzbach, a youth football coach, with whom she has two daughters.\n\"Sarina is just a genuinely lovely person that shows a lot of empathy towards you. She wants to know you on a human level, not just as a player. She has conversations with you about your family.\"\nThose were the words of England's record goalscorer Ellen White, and have been echoed by many of those who have worked with her.\nDorrance, Wiegman's university coach, says one of his most striking memories of his former pupil came a few years after she had left the US, when he had been invited to give a talk to a group of Dutch coaches in the Netherlands.\nHe says he presented his philosophy - which was to use data to show how skilful a player was - but his audience quickly let him know they did not agree with the concept.\n\"All I can remember from that experience is poor Sarina basically absorbing the blows with me, and I could see the consternation on her face,\" he says.\n\"To some extent she was embarrassed about the way I was treated. I've never forgotten that. I still have a wonderful picture of her compassionate face looking up at me, just hoping that her colleagues would give me a break.\"\nFor Stentler, that human side sets Wiegman apart from other coaches she worked with during her career.\n\"She really feels what players need - and makes sure you feel warm and welcome and open to say anything to her. If I was in a really bad situation, I could tell her without any consequences. And that feeling of openness is not very common in coaches.\n\"I definitely had moments where I was not happy with Sarina but when I look back at my career she was the best coach, the best human, in my career.\"\nA version of this feature was first published in July 2022.",
  "word_count": 2118,
  "scraped_at": "2026-02-14T11:17:44.235533"
}