{
  "article_id": "f721479fb310",
  "url": "https://northafricapost.com/78265-afcon-morocco-2025-to-be-held-from-dec-21-2025-to-jan-18-2026-caf.html",
  "title": "AFCON Morocco - 2025 will be held from 21 Dec . 2025 to 18 Jan . 2026 , announces CAF , expressing gratefulness to King Mohammed VI – The North Africa Post",
  "date": "20240622T084500Z",
  "domain": "northafricapost.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "The Executive committee of the Confederation of African Football (CAF) announced Friday the dates of Africa’s most popular and competitive football competition, the CAF TotalEnergies Africa Cup of Nations (AFCON) which will be hosted by Morocco.\nThe final phases of the 35th edition of AFCON-2025 Morocco, will thus take place from 21 December 2025 to 18 January 2026, CAF announced on Friday.\nThe opening match of “Africa’s most popular and competitive football competition”, the Africa Cup of Nations, to be held in Morocco, will take place on Sunday December 21, 2025, while the final game will be held on Sunday January 18, 2026, CAF stated in a post on its website.\nThe President of CAF Patrice Motsepe expressed confidence that the AFCON Morocco 2025 will be “extremely successful and will be the best AFCON in the history of this competition.”\n“We will continue to make significant progress in developing and ensuring that African Football is globally competitive and amongst the best in the World,” Motsepe said, adding that CAF is grateful to King Mohammed VI to the Government and people of Morocco, and to Royal Federation of Moroccan Football for hosting the CAF TotalEnergies AFCON Morocco 2025 as well as the CAF TotalEnergies WAFCON Morocco 2024.\nActually, the CAF Executive Committee also announced Friday the dates for the Women’s Africa Cup of Nations 2024 that will also be hosted by Morocco.\nThe opening match of this competition, which is “growing exponentially”, will be held on Saturday 5 July 5 2025, and the final match on Saturday 26 July 2025.\nCAF Chief said in this connection: “I am also impressed by the enormous growth of Women’s Football in Africa and I am expecting the CAF TotalEnergies WAFCON Morocco 2024 to be immensely successful.”\n“We hope that the CAF TotalEnergies AFCON Morocco 2025 will be the best event to honor Africa, and Morocco will make available the best conditions to host the rest of Africa and the World,” said on his part President of the FRMF Fouzi Lekjaa.\nThe draw for the qualifiers for the AFCON 35th edition will take place on July 4 in Johannesburg, South Africa. A total of 48 nations will be divided into 12 groups of four teams each.\nIt was also decided to hold the 46th Ordinary General Assembly of CAF in Kinshasa on October 10, the Confederation said.",
  "word_count": 392,
  "scraped_at": "2026-02-14T12:32:30.219954"
}