{
  "article_id": "f7346dc92f46",
  "url": "https://abc11.com/post/ncaa-tournament-triangle-womens-teams-continue-march-madness-runs-young-girls-find-inspiration/16077186/",
  "title": "NCAA tournament | As Triangle women teams continue March Madness runs , young girls find inspiration",
  "date": "20250325T024500Z",
  "domain": "abc11.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Monday, March 24, 2025\nRALEIGH, N.C. (WTVD) -- Before NC State took the floor Monday for its second-round NCAA women's tournament matchup against Michigan State, Jessica Pearce and her family were getting in some quality time on campus.\n\"We're so excited. We're ditching work, ditching school. It's pretty cool that we get to do this,\" said Pearce, an alum. \"We live 15 minutes down the road. To be part of this last year, we were able to see the Bell Tower turn red with the Final Four advancements, and it's just awesome, awesome to be a part of it.\"\nShe was standing next to her young daughter Audrey.\n\"The first time I watched basketball live, it was cool. But it's even better now since it's girls. Girl Power!\" exclaimed Audrey, who takes part in gymnastics.\nAround the corner, eighth-grader Mary Grace Langley was joined by her parents for the game at Reynolds Coliseum.\n\"Seeing these girls to be able to go out there and do this at this level here at NC State, that's great,\" said Langley, who plays volleyball.\nBoth girls were inspired by the Wolfpack women's athletes, part of a growing generation participating in youth sports.\nAccording to The Aspen Institute, from 2019-2022, the percentage of 6- to-17-year-old girls who played sports regularly increased from 33% to 34.5%, a period that saw a drop in participation for boys. Breaking it down further, 13- to 17-year-old girls saw a 3% increase, with the overall participation rate hitting its highest level since 2013.\n\"I came here and graduated in 2003. To see it grow even since then, it's amazing. It just empowers my kids to be able to do whatever they want, whether it's gymnastics or a different sport, knowing that they have the support of the community around us,\" said Pearce.\nThere's still plenty of room for improvement in North Carolina, which had the fifth-lowest youth girls participation rate in the country according to the 2020-2021 National Survey of Children's Health.\nOverall, women's sports are in as strong a position as ever before, with new television deals for both the WNBA and college athletics.\n\"I could never see it, so I never did it. But because the next generation (gets) to see all that they see, (they play). And it's not just college, but it starts young now,\" said Cynthia Glover, an NC State fan.\nGlover says her household always has women's sports on television.\n\"When I grew up, it was all about men's sports. For the women to finally get the moment that they're getting and the support that they get because whenever I come to a game, we are all on one page,\" said Glover.\n\"We've always known that there's been potential from a financial perspective investing in women's sports. And finally, as the investment has come, we're seeing the product of that with TV ratings, with attendance, with NIL deals,\" said Dr. Michael Edwards, an Associate Professor of Sport Management at NC State.\nAccording to a 2023-24 report from SponsorUnited, 52% of the top 100 athletes based on NIL deals in a 12-month span were women, with sports such as softball and volleyball seeing greater investment.\n\"We've come to Reynolds several times for different events, whether it's gymnastics meets or volleyball or women's basketball. It's great to see that regardless the sport, this community is huge,\" said Pearce.\n\"It's been very clear that this is a market that's been undervalued for a long time. They're just compelling storylines. They're exciting games to watch. The individual athletes have really captured the imagination for a lot of people,\" said Edwards.\nWinning consistently also helps.\nWhen Wes Moore took over during the 2013-2014 season, NC State had missed the NCAA tournament for three consecutive years and only made it once during an eight-season stretch. That season, the average attendance was 2,252 fans per game.\nThis season marked the eighth consecutive time NC State made the NCAA tournament (excluding 2020, in which the tournament was canceled), a run in which the Wolfpack made it past the first weekend five times. Fans responded in force, with games hitting an average attendance of 5,214.\n\"I think (former Athletics Director) Debbie (Yow) did a great job here. The program has always been solid, and Wes (Moore) coached under (Kay) Yow early, and he's just done a great job for the last 10 years,\" said Bob Kennel, a former NC State student-athlete.\nKennel played football, basketball, and baseball for the Wolfpack in the 1950s, well before Title IX ushered in new opportunities for women's sports.\n\"(My granddaughters) all came to Kay Yow's camps, etc., so they were close to the program,\" said Kennel.\nYow's legendary run set the standard for one of the country's top programs, which is now a perennial contender in the NCAA tournament.\nFresh off a Final Four run, the Wolfpack earned a No. 2 seed in this year's NCAA tournament, knocking off Vermont and Michigan State to advance to the Sweet 16.\n\"It's like at the very top of my list of things to do in my lifetime. The most exciting thing I've encountered in a while,\" said Glover about attending the NCAA tournament games.\n\"The NC State fans, they're awesome. Just the excitement in there. When they get ready, it's awesome,\" said Langley.\nNC State will face the winner of LSU and Florida State on Friday for their Sweet 16 match-up in Spokane.\n\"The community does support this program. I support it because it's NC State, and it's great basketball. You can't beat that,\" said Bob Kennel, a former NC State student-athlete.\nCopyright © 2026 WTVD-TV. All Rights Reserved.",
  "word_count": 940,
  "scraped_at": "2026-02-14T12:10:44.852122"
}