{
  "article_id": "f73e594f6102",
  "url": "https://www.arsenal.com/news/adidas-and-arsenal-expand-no-more-red-campaign",
  "title": "adidas and Arsenal expand No More Red campaign",
  "date": "20230106T113000Z",
  "domain": "arsenal.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "adidas and Arsenal have launched the next chapter of our No More Red campaign, an initiative first launched in January 2022 to support the long-standing work being done by Arsenal in the Community to help keep young people safe from knife crime and youth violence.\nAlthough the number of teenagers killed as a result of violent youth crime dropped significantly in 2022 in comparison to 2021, there were 11,502 knife offences recorded in London between January 2022 and November 2022, an increase compared with the corresponding period in 2021.\nBoth ourselves and adidas remain steadfast in our long-term commitment to create safe spaces for young people to play sport in the capital, provide better access to trusted role models, and shine a light on talented individuals who are making a positive difference in their community.\nNo More Red in 2023\nInspired by the impassioned response to last year’s launch, this year we are expanding No More Red; inviting members of the public to be part of the campaign by volunteering with one of our charity partners:\n- Arsenal in the Community\n- The Stephen Lawrence Day Foundation\n- Steel Warriors\n- Don’t Stab Your Future\n- Box Up Crime\n- Copenhagen Youth Project\n- St Giles Trust\n- Abianda\n- Octopus Community Network\n- The Ben Kinsella Trust\nEach person who volunteers with one of the above as part of the scheme can receive their own No More Red shirts and will be invited to watch us play at Emirates Stadium.\nEach charity and organisation have 10 limited edition shirts to give volunteers, who each must donate their time to be eligible. Full details relating to how each participating charity is offering the shirts can be found on their respective websites, and Arsenal.com/NoMoreRed.\nIn addition to the volunteer scheme, in 2023 No More Red will continue to focus on:\n1. Investing in safe spaces to play football, with work planned to redevelop a community pitch in Kings Square Estate, Islington later this month\n2. Awarding and recognising local young champions identified as positive influences in their communities\n3. Developing social action projects, which will:\n- Bring together groups of young people from the local community and connect them with inspirational talent from the creative and sports industries\n- Include paid opportunities for these young people to work on creative projects that leave a positive mark on their community, such as art installations, community events and awareness campaigns\nTo mark the second year of the campaign, our men’s first-team will wear an on-pitch version of the kit in their FA Cup tie away at Oxford United on Monday, January 9. Our women's team will support the initiative by wearing No More Red pre-match training kit and anthem jackets against Chelsea on Sunday, January 15.\nThe kit will never be commercially available and only be awarded to individuals who are making a positive difference in the community.\nFreddie Hudson, Head of Arsenal in the Community, said: “Last year we were proud to launch No More Red with adidas. It provided a unique opportunity to highlight almost four decades of our local community work that has helped to keep thousands of young people safe.\n\"Throughout 2022, we worked in our local area with adidas, and our charity partners to build on our support for young people by providing more high-quality safe spaces to play sport, access to trusted role models and to shine a light on the positive work being done across our community.\n\"A special thanks also goes to our partners at Islington Council who have supported our work, including the new pitches on Harvist Estate and King’s Square Estate and a No More Red mural at Rosemary Gardens.\n“Young people face multiple challenges as they grow up in today’s world and we don’t have all the answers, but we are confident our work makes a significant contribution to the lives of our participants. Our hard work must continue and we’re proud to be building on the achievements of the first year of No More Red by adding more social action projects and a volunteer programme that broadens the reach of this powerful initiative.\n“Combining decades of expertise with the incredible support from adidas, will help more individuals make better, informed choices about their future. We’re also sending a strong message that by pursuing your talent and focusing on aspirations, young people can have bright futures and become role models themselves.”\nJessica Neil, CEO of Stephen Lawrence Day Foundation, added: “We’re extremely proud to be one of the nominated supporting charities of No More Red, working alongside Arsenal and adidas to inspire a more equitable, inclusive society and to foster opportunities for marginalised young people across the UK.\n“Stephen Lawrence Day 2023 marks the 30th anniversary of Stephen’s death and a significant moment for reflection. We can never know what extraordinary things Stephen would have achieved in his own name had he been afforded the opportunity, but we can work together to ensure that every other extraordinarily ordinary young person like him is supported, empowered and uplifted to explore the full breadth and depth of their potential.”\nChris Walsh, VP Brand Northern Europe at adidas said: “We know the issue of violent youth crime does not have a simple solution, but we are passionate about the importance of creating safe spaces for young people to express themselves.\n“Sport has an incredible power to bring people together, and it continues to be a great honour to be working with experts at Arsenal and our 10 charity partners to try and create a long-term impact on the lives of young people in London.\n“We’re committed to supporting local communities through the adidas Football Collective and No More Red is an incredibly important part of that.”\nNo More Red is a joint initiative between ourselves and adidas, and is part of the adidas Football Collective; a movement committed to creating change through sport.\nThrough the adidas Football Collective, the brand is joining forces with established community partners, activists and change-makers, as well as professional clubs and athletes – all to deliver real action. This is achieved through the deployment of resources to teams that give access where it isn’t readily available, including disability champions, female game-makers and teams from the LGBTQIA+ community.\nLearn more about how to volunteer at one of the charity partners for your chance to own one of the limited edition No More Red shirts, or find out more information about the campaign.\nCopyright 2026 The Arsenal Football Club Limited. Permission to use quotations from this article is granted subject to appropriate credit being given to www.arsenal.com as the source.",
  "word_count": 1108,
  "scraped_at": "2026-02-14T12:59:59.377927"
}