{
  "article_id": "f74b34dd4dcc",
  "url": "https://www.limerickleader.ie/news/treaty-utd/1747513/sean-russell-ready-to-make-his-mark-with-treaty-united.html",
  "title": "Sean Russell ready to make his mark with Treaty United",
  "date": "20250307T141500Z",
  "domain": "limerickleader.ie",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Treaty United women's manager Sean Russell, PICTURE: Sportsfile\nTREATY United women's manager Sean Russell is very pleased with the squad he has assembled ahead of the SSE Airtricity League of Ireland Premier Division season.\nSean Russell has taken over the helm from previous coach Dominic Foley, who helped the team finish in seventh place of the SSE Airtricity Women's Premier Division last year.\nRussell has had plenty of experience coaching having spent last season with the WU17 side at Treaty. He was also involved as assistant coach to the senior women's side back in 2021.\n\"We're very pleased, we feel like we've got the right blend there. We've got a lot of good people and players there and we are very content with what we have\" said Treaty United manager Sean Ruseell.\nTen players who have came through Treaty United academy are part of Russell's squad.\n\"A big part of it is that they're good enough and that's the important thing. We made the decision based off bringing these players through because we appreciate the talent that is there. I think now is a good time to start exposing them to first team football.\"\nRussell was forced to retire from his playing career at the age of 26 due to injury. The 26 year old feels his experience coaching at grassroots football has stood to him.\n\"I've learned something at every level to help me progress onto the next level. I took the decision to go back to grassroots football and work with more local clubs and build my way back up from there as a coach. I think it's very important to do that. I'me extremely grateful for all the opportunities I've had\" added Russell.\nTreaty United women's side will get their SSE Airtricity Women's Premier Division season underway on Saturday in the Markets Field when they welcome Waterford FC to Limerick.\n\"That atmosphere has been good, we expect a very difficult challenege against Waterford. Our ambition is to go and win every single game we play this year. We hold oursleves fully accountable to that and we're going out to win.\"\nADVERTISEMENT - CONTINUE READING BELOW\nADVERTISEMENT - CONTINUE READING BELOW\nADVERTISEMENT - CONTINUE READING BELOW\nADVERTISEMENT - CONTINUE READING BELOW\nADVERTISEMENT - CONTINUE READING BELOW\nADVERTISEMENT - CONTINUE READING BELOW\nADVERTISEMENT - CONTINUE READING BELOW\nADVERTISEMENT - CONTINUE READING BELOW\nADVERTISEMENT - CONTINUE READING BELOW\nADVERTISEMENT - CONTINUE READING BELOW\nADVERTISEMENT - CONTINUE READING BELOW\nSubscribe or register today to discover more from DonegalLive.ie\nBuy the e-paper of the Donegal Democrat, Donegal People's Press, Donegal Post and Inish Times here for instant access to Donegal's premier news titles.\nKeep up with the latest news from Donegal with our daily newsletter featuring the most important stories of the day delivered to your inbox every evening at 5pm.",
  "word_count": 469,
  "scraped_at": "2026-02-14T13:31:59.643223"
}