{
  "article_id": "f767dc41cdcd",
  "url": "https://www.thenation.com/article/society/super-bowl-rigged-trust/",
  "title": "Why People Dont Even Trust the Super Bowl",
  "date": "20230213T180000Z",
  "domain": "thenation.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "The United States suffers from a profound mistrust in institutions that used to be considered sacrosanct. Across the political spectrum, people are subjecting elections, politicians, the courts, and even science to unprecedented scrutiny. There is a crisis in confidence in the legitimacy of everything that was once foundational. Now we can add the ultimate all-American spectacle, the Super Bowl, to this list. After Super Bowl 57, in which the Kansas City Chiefs defeated the Philadelphia Eagles 38-35, #Rigged was trending on Twitter around the world. The game’s culmination left much to be desired, and outside of Kansas City, howls of dissatisfaction echoed throughout social media. That’s not the way the National Football League wanted to end its season. Its most valuable commodity is the idea that “on any given Sunday” any result is possible. This was proven true, but it wasn’t the ending anyone wanted.\nFor those who found other ways to spend their Sunday, allow me to explain. The score was 35-35 with under two minutes to go when Kansas City quarterback Patrick Mahomes threw an incompletion on third down. This would have forced the Kansas City team to kick a field goal and give the Eagles a healthy amount of time to try to tie or even win the game. But instead a referee called a very shaky defensive holding penalty on Eagles cornerback James Bradberry. Kansas City took the automatic first down and ran out the clock, with Mahomes taking a knee, followed, as the clock helplessly ticked down, with a game-winning field goal.\nIt was striking to see people of all political stripes, both in my house and on social media, unite around a shared idea: The call made a mockery of what had been a thrilling game. (Who knew that seeing a quarterback take a knee could make NFL fans so mad?) Far from sticking the landing, the NFL gave us three hours of drama, followed by a dud of an ending. Imagine Rocky IV ending with Rocky having to forfeit his fight against Ivan Drago because of a bad case of lactose intolerance. That would have been a more satisfactory ending for the Philadelphia faithful. It is true that Bradberry said after the game, “It was a holding, I tugged his jersey. I was hoping they would let it slide,” but it’s also true that the refs hadn’t called that penalty—or much of anything—all game. They were “letting the players play” until the last two minutes, when they became sticklers. It’s a disaster, made more so by the perception that fans believe the great Mahomes has been shoved down our throats as the game’s golden calf. We have been primed to worship his every play, so anything that looks like a finger on the scales for his benefit has the whiff of conspiracy.\nPeople could be forgiven for thinking that the game was, in fact, “rigged,” given the reservoirs of bullshit that threatened to drown it. We saw Rupert Murdoch and Elon Musk sitting together in one of the luxury boxes. As the cameras displayed our American oligarchs, the announcer Kevin Burkhardt said, “Well, you’ve got some brilliant minds in that photo, Rupert Murdoch, Elisabeth Murdoch, Elon Musk.” His partner Greg Olsen was silent, which I am choosing to read as a political act. After an awkward moment watching the elderly Murdoch play with some wax paper, Burkhardt, perhaps realizing that he sounded like a minor member of a royal court, joked, “Rupert pays our checks too, so that’s always good.”\nPopular\n\"swipe left below to view more authors\"Swipe →\nThe fraud extended beyond deeming the plutocrats who ruined television news and Twitter somehow “brilliant.” There was a distressing salute before the game to Pat Tillman, the former NFL player turned Army Ranger who was killed in a “friendly fire” incident in Afghanistan back in 2005. Yet, as per usual when the NFL bathes in Tillman’s memory, there was no mention that the military covered up the circumstances of his death and that the family never really got a satisfactory answer as to why he had been killed by his own troops. There is no mention that Tillman had turned against the war, calling the invasion of Iraq “illegal as hell.” There is no mention that Tillman had started reading Noam Chomsky. There is no mention that Tillman certainly would have rejected the way his own narrative was woven into a tapestry celebrating the NFL, patriotism, and war.\nThe fraud was also felt in the NFL’s celebration of Buffalo Bills safety Damar Hamlin, who almost died on the football field just last month. It was beautiful to see Hamlin cheered. But to see the NFL spin the way the sport nearly killed someone into a feel-good story felt morally abhorrent—like another lacquer of propaganda slathered on an already too-slick product.\nAnd then there was the proud celebration of the Kansas City Chiefs’ racist mascotry and use of the “chop” to celebrate their team. I think the shot of Chiefs fans in Munich doing the chop was the cherry on the Sunday of racism that the NFL claims to oppose.\nThe deceit included the hyping of the fact that the military flyover was for the first time an all-women endeavor. While this undoubtedly caused some aggrieved conservatives to spit up their nachos and call the NFL “woke”—because that’s the word for anything that makes them even mildly question their own belief system—it was a political sham. There is nothing progressive about this, no matter how many right-wing trolls blow their tops. It reminded me of Olúfẹ́mi Táíwò’s writings on “elite capture”: The flyover stunt cynically used the movement for women’s liberation for the purpose of US militarism. The message is that while bodily autonomy has been trashed by the Supreme Court, at least this is a country where women can bomb people.\nThe fraudulence also extended to the commercialization and the sheer glut of famous people bursting out of every ad. The US is rich in celebrities, and they arrived in force to sell us anything that wasn’t nailed down. Other than Ben Affleck achieving his long-awaited destiny of starring in a Dunkin’ Donuts commercial, there wasn’t much to see. Yet usually the game itself stands as an honest product amid the Super Bowl’s sea of flash bulbs, corporate criminals, and grifters. This is the secret of the NFL’s success: Amid the commercial and militaristic sewage, the game is entertainment of the first order, commodified violence to rival anything out of Hollywood. But stories need endings, and this year the ending was as repellent as the surroundings, and that’s bad for the NFL. It likes to sell us the idea that “football is America.” We shouldn’t be surprised that in a country that feels rigged, people would assume the same about the Super Bowl.",
  "word_count": 1139,
  "scraped_at": "2026-02-14T12:39:07.925937"
}