{
  "article_id": "f7a7e71d181e",
  "url": "https://news.yahoo.com/thought-children-safe-teachers-sex-225848901.html",
  "title": "They thought their children would be safe . A teacher sex abuse went unreported for years . ",
  "date": "20230218T001500Z",
  "domain": "news.yahoo.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "They thought their children would be safe. A teacher's sex abuse went unreported for years.\nEditor's note: Warning, this article includes descriptions of child sexual abuse. To report suspected sexual abuse, call 1-800-96-ABUSE (1-800-962-2873).\nIt was food truck day at Parkside Elementary School, the last day of November. As children ordered lunches and played soccer under the bright Naples sun, a third-grader told a recess monitor, “Mr. Manley touches people’s private parts.”\nShe saw the teacher touch her friend, she said. “You can ask her.”\nThe girl’s words made their way, like a game of telephone, through six staff members: tutors, teachers and two assistant principals.\nBut they didn’t talk to the girl.\nThey didn’t question her friend.\nAnd despite the fact that it is a felony in Florida to let suspected child abuse go unreported, sworn statements Parkside teachers and administrators made to investigators indicate they did not call the authorities that day, nor any day that followed.\nThree months passed before two more third-grade girls raised another alert about Hector Manley, before Collier County Public Schools administrators called authorities, before he was jailed and fired. Between the last day of November 2018 and the last day of February 2019, Manley added three new students to his victim count and continued assaulting others at Parkside.\nIn total, he molested as many as 20 children as young as age 5.\nAt least four sworn statements made to investigators by administrators, a teacher and a tutor back this timeline up, although witnesses disputed exactly what they were told that day in November. In a response to a civil lawsuit brought by a survivor’s parent, the district maintains it could not have known about Manley’s “propensities” before his arrest date.\nMore in U.S.\nA five-month investigation by the Naples Daily News and The News-Press uncovered how school officials ignored numerous and credible complaints about Manley’s behavior. Teachers repeatedly pointed out Manley’s habits of rule-breaking and inappropriate relationships with students, but administrators apparently failed to piece these clues together.\nThe school district didn’t investigate Manley’s actions or file a federal Title IX report, which a district official said it didn’t have to do because it had fired Manley.\nTogether, these events paint a picture of a district that failed to protect students and disregarded federal guidance.\nManley began molesting children his first day on the job, and there wasn’t a single month during his employment at Parkside when he wasn’t abusing students, court records show.\nChildren’s statements to investigators show Manley abused them in classrooms, in hallways, in the computer lab, in the cafeteria, in his car and in their homes where he tutored them.\nThey said he also molested them on the field during “Parkside United” soccer practices, a team he founded and coached through the East Naples Soccer League. He filled out the roster with Parkside students he handpicked.\nInvestigation and response\nReporters examined hundreds of emails from faculty, administration and staff; teacher and administrators’ personnel files and disciplinary records; weekly staff bulletins; notes from administrative meetings; school handbooks and teacher guidelines; sworn statements taken by Collier County Sheriff’s investigators; files and audio from the criminal case against Manley and a civil case against Collier County Public Schools, and interviewed current and former Parkside students and their parents.\nThis news organization also reached out to more than a dozen current and former Parkside teachers and staff, including all three former Parkside administrators, five school board members and the superintendent for comment through various methods: phone, email, home visits and handwritten letters.\nOne former teacher, Isabel Castillo, gave comment on Manley’s relationship with the Latino community and her experience during school or district training. Of the five school board members, only Jen Mitchell replied, saying, “It isn’t our practice to comment on any pending litigation.”\nThe Collier County Sheriff’s Office and the state attorney’s office declined to speak with reporters on the case, return public information requests or make investigators available to explain how an investigation into teacher sexual misconduct would normally proceed.\nAlthough a school district spokesman said this news organization’s reporting contained “multiple inaccuracies” when presented with numerous requests for comment, communications director Chad Oliver declined to tell reporters which details the district perceived as inaccurate, citing ongoing litigation.\nAfter publication, Oliver reached out to say in response to a question sent prior to publication that the district does train students in recognizing and responding to grooming behaviors or sexual advances made by adults, and has since before 2018. Additionally, he requested the Naples Daily News / The News-Press add in that Collier County Public Schools Superintendent Kamela Patton declined through Oliver to discuss the status of sex abuse and assault cases in the district when reporters requested meetings in November and December because the district is facing litigation related to the case.\nPatton in December was named Florida’s 2022 Superintendent of the Year by the Florida Association of District School Superintendents and the Florida School Boards Association. She was one of four finalists for the 2022 National Superintendent of the Year by the School Superintendents Association but did not win.\nBy number of survivors, this is the second-largest educator sex abuse case in Florida since 2014, according to data from the anti-abuse nonprofit Stop Educator Sexual Abuse Misconduct and Exploitation, or S.E.S.A.M.E.\nData: Hector Manley's survivor count is Florida's second-highest in recent history\nOn March 1, 2019, Manley was booked into the Naples Jail Center. On Jan. 21, 2022, he was convicted of being a sexual predator and sentenced to 25 years in prison, with credit for time already served. He admitted to 20 counts of molestation of children's genital areas, including breasts. Three sexual battery charges were dropped in exchange for his plea.\nWhile other outlets have reported Manley molested 19 students, the state attorney’s office did not respond to emails asking whether 19 or 20 children were part of the 20-count plea deal.\nHad Manley faced a jury, he could have been sentenced to life in prison without the possibility of parole because of those battery charges.\n‘She has not been able to forget’\nColleagues reported Manley’s favoritism toward certain students, rule breaking and inappropriate social media contact with children to team leaders or administration time and again, witness statements say. Yet Collier County Public Schools stated in its response to a civil suit that it had no way of knowing Manley was abusing children before his arrest nor could it have stopped him.\nThe district has generally refused to comment on the civil suit and Manley’s prosecution. It declined to comment on allegations in the witness statements that Manley’s behavior repeatedly drew attention.\nSexual assault experts say that if the district had ensured children were properly taught how to report sexual abuse, and if it had trained teachers and administrators in spotting signs of grooming, Manley’s abuse might not have gone unchecked for more than three and a half years.\nThe district says teachers receive training in identifying abuse but would not clarify whether spotting grooming behaviors is part of the training.\nFederal law directs districts to investigate the blind spots that sexual predators like Manley exploit in order to prevent abuse.\nBut the district says it has not done its own investigation because “internal investigations are only conducted for active employees.” It added that the matter had been turned over to law enforcement.\nIn response to a civil suit filed by attorney Gregg Schwartz on behalf of the mother of a girl Manley abused, the district denies the girl was abused on school grounds but doesn’t address other students’ abuse. Manley abused multiple children on school property, according to official statements made by children who say Manley molested them.\nSchwartz, who represents the families of two survivors in cases against the district related to Manley, provided this news organization with sworn statements teachers, tutors, staff and administrators made to investigators that he obtained through a public records request of the Office of the State Attorney for the 20th Judicial Circuit.\nManley’s abuse has left children devastated.\n“You tainted my life,” one survivor wrote in a letter to the court on the day of Manley’s plea hearing. “I never thought that a person could hurt another person like that.”\nOne woman whose daughter was abused by Manley said her once-loving, happy daughter has become insecure, fearful and full of rage. She said Manley, who tutored the girl, abused her daughter in their home while she was in another room doing laundry.\n“She has not been able to forget,” the woman wrote in a letter that was read last month in court. “I have not been able to erase from my mind her little face, filled with hate when she told me this was my fault. I have not been able to forget,” she wrote in Spanish.\n“I have always been able to protect her,” the mother wrote. “I thought that while she was attending that school she would be also protected, and protected by her teachers, but unfortunately that has not been the case.”\nOne of Manley’s victims wrote in a letter to him that was read in court during his plea hearing: “You thought that we could not speak and we could not defend ourselves, but we persevered and now you cannot do this again to other children. You deserve the weight of the law. I hope my eyes will never, ever see you again.”\nShattering trust: Manley’s habits and abuse as a teacher\nIn Naples and nationally, the man students called “the teacher with the robot legs” was celebrated.\nAs a boy in El Salvador, he was sucked down into a burning garbage pit where he was searching for food when an earthquake struck. It took nearly an hour for a local man to dig him out and days before he reached a pediatric hospital, Hospital de Niños Benjamin Bloom. There, doctors amputated both his legs above the knee. Two board members, Ohio nursing home owners Don and Karen Manley, asked his parents if they could take him to the U.S. for prosthetic legs. A year later, with his parents’ permission, they officially adopted him. Within the decade, they moved with him to Southwest Florida.\nIn his 20s, Manley became a local celebrity, lauded for his dedication to sports and helping other disabled people. Naples awarded him a key to the city, he landed gigs as a motivational speaker and kayaked the length of the Mississippi River for charity. At 28, in August 2015, he was hired by Collier County Public Schools as a Pre-K aide at Parkside Elementary.\nAt Parkside, Manley’s Latinidad, fluent Spanish, volunteer work and the interest he showed in students helped him gain access to children both inside and outside the classroom.\nSurvivors of Manley’s abuse are largely Hispanic or Latino. Nearly 90% of the 6,500 residents of Naples Manor, the community Parkside serves, are Hispanic/Latino or Black. And it’s low-income, disproportionately so. About 18% of people in Naples Manor live below the poverty line, nearly triple that of Naples proper. Many in Naples Manor work in hospitality or on the grounds of the resorts that dot Naples.\nIsabel Castillo was one of only three other Latino teachers at the school during Manley’s tenure. She said his ability to speak to parents in their native language set him apart from other teachers and the administration, who by and large were white and did not speak Spanish.\n“Se miraba buena gente,” Carolina Don Juan, a Parkside parent who still has a daughter enrolled at the school, said about Manley. He seemed like a good guy, she said, always calm, different from the other teachers. She recalled the lunch sacks with applesauce, yogurt and fruit he brought families after Hurricane Irma.\n“Fue buen de él, no?” she asked. It was good of him, right?\nIn school, he bought McDonald’s for students and gave out his school security badge and key to at least one student, both of which violate policy. Sworn statements say he would go all day teaching with the lights out, played favorites with students and touched them frequently, patting them on the back, picking them up and hugging them – all things teachers are warned against.\nWeekly staff newsletters show he volunteered near-constantly. He helped plan and execute parent-child literacy programs, joined his colleagues in 5K runs, served food at chili cookoffs, joined in school cleanups. With the school’s encouragement and name behind him, he started his own soccer team.\nHe bought hot pink cleats for some of the girls on his team and frequently drove them home in his gray SUV.\nTeachers and administrators were witness to all of this. In fact, some tweeted it.\n“One of our teachers @hectormanley, coaching our Parkside soccer team tonight! Way to go team Parkside,\" Assistant Principal Holley Holland tweeted in September 2018.\nAnother Parkside teacher shared Holland's sentiments three months later.\n\"Go Team Parkside (celebration emoji) (soccer ball emoji),\" the teacher tweeted with a photo of team members attached.\n\"Way to go, Team,\" replied Principal Tamie Stewart.\nThese gifts, frequent touches and overvolunteering, sexual assault experts say, are classic grooming tactics, carried out to make children and adults less likely to report him.\nOne Parkside administrator admitted to detectives that when she watched him pick up a child and hug her on the sidelines at a soccer game that she simply marveled that a man balanced on two prosthetic legs could do so without falling over.\nChildren’s statements indicate on days Manley used his wheelchair, he would pull students into his lap and fondle them during class. He molested one girl almost daily as she read from the class PowerPoint. He molested another girl on his soccer team sometimes three times a day, and, she said, every time she went to soccer practice he would press her against a tree on the sidelines and grope her.\nHe cornered one girl by the water fountain and groped her as she tried to drink. Another girl told detectives she was so scared of Manley that he appeared in her nightmares most nights. Another was terrified he would climb through her window at night and refused to sleep without her mother.\nWhen Carolina Don Juan learned Manley had been accused of molesting children, she said she couldn’t believe it. He always seemed like such a good person, she said.\n“Se acercaba mucho a los niños, hablándoles, haciéndoles plática,” she said. “Pero no sabíamos lo que estaba pasando. Como papá, se da desconfianza.”\nThat translates to: He was always hanging around the kids, talking to them, chatting with them. But we didn’t know what was happening. As a parent, that shatters your trust.\n‘No one raised the alarm’\nOver the years, as Manley groomed children and adults, something seemed off to nearly everyone who worked with him.\nFellow teachers reported him regularly to their team leaders or the administration for inappropriate behavior with children, but no one seemed to put all the pieces together.\nEach time an administrator admonished him for crossing a boundary – turning his lights out, lending his badge and key to a student, Snapchatting a student – Manley apologized. I won’t do it again, he said.\nCastillo, the former Parkside teacher, said faculty received an annual training on mandatory reporting and spotting signs of abuse in children, such as attending school hungry, dirty or infrequently.\nThe district confirmed that its employees were trained annually in mandatory reporting and spotting abuse by the Florida Department of Children and Families. But it would not clarify if adults received training in spotting grooming behaviors by other adults. Florida DCF did not return phone calls or emails asking if the training included information on identifying grooming behaviors by an adult, nor are training materials available on their site.\n“The district carefully reviews claims that are brought to its attention that could involve, or be construed as, grooming behaviors,” Collier schools’ communications director Oliver said.\nAfter publication, Oliver wrote in an email that the district does teach children how to recognize and respond to sexual abuse, including luring and threatening situations, how to act, set appropriate boundaries, get away from an individual attempting to groom them and how to share feelings and information with trusted adults. Oliver said it had done so since prior to 2018.\nAn examination of the 2018-19 teacher handbook shows a section that details how to report suspected child abuse but not how to spot it.\nThree indicators of grooming – being alone with a student in a dark or closed room or secluded area; behaving in an overly friendly or familiar way or failing to maintain an appropriate professional boundary with a student; bantering or engaging in colloquial or slang communications with a student – do appear on a brochure titled “Identifying and Reporting Professional Misconduct” provided to teachers and hosted on the district website. There is no indicator on the brochure that these are considered signs of inappropriate sexual interest in a student.\nHad teachers been better trained in recognizing tactics child sex predators employ to get close to children, Manley might have been stopped sooner, said Charol Shakeshaft, a Virginia Commonwealth University professor and national expert on educator sexual misconduct.\n“The school has a responsibility to train people to understand what grooming looks like,” said Shakeshaft, who has compiled reports for Congress on educator sexual misconduct. “People with knowledge, people who’ve done the training they should have done, people who had paid attention would understand that there was something disturbing here that needed to be stopped.”\nBut the administrators who received these complaints and reports apparently didn’t see the pattern unfolding.\n“If your intent is to sexually abuse kids, then you want the other adults around,” Shakeshaft said. “So you ingratiate yourself first by helping people … by having people seeing you as a selfless person who's there for the kids.”\nAnd slowly, she said, you cross boundaries. Then you do it again, and again and again. And each time, you apologize for it, “saying things like, ‘Oh, I'm sorry, I didn't realize I shouldn't have done that. I won't do it again.’\n“And then there's another boundary crossed,” she said. “That's a huge red flag.”\nStacey Honowitz, an assistant state attorney in the Sex Crimes and Child Abuse Unit for the 17th Judicial Circuit of Florida, likened grooming behaviors to the frog in a pot of boiling water: the temperature rises so slowly the frog doesn’t realize it’s in danger.\nExperts say sexual predators use a variety of grooming tactics meant to minimize suspicion, but that’s why there are laws that require teachers and other adults to report things like being alone with a child, favoritism and initiating touching, even if they seem like nothing at all.\nSnapchat, parties and ‘the weirdest conversation’\nAfter Manley was promoted to a second-grade teacher position in the fall of 2017, his celebrity helped boost Parkside’s star. He often appeared in articles or television news segments that covered his role in the district as well as his origin story.\nBut teachers and administrators began noting that Manley was struggling, and by the spring of 2018, a number of his colleagues complained that he was flouting the rules, they later told detectives.\nTeachers said he held weekly parties – roughly 10 times the four parties teachers were allowed to throw – taught with the lights off and took children from other classes for the entire day, sometimes without permission. Most concerning to teachers was when one second-grade teacher learned Manley was rewarding one of her students with treats to Snapchat him messages and photos of herself.\nSomehow, none of this made it into his official file. Instead, teachers and administrators later told detectives, Manley was verbally reprimanded and placed under stricter observation.\nAt least one teacher told investigators that administrators started showing up unannounced in his room for unofficial observations during spring 2018. After the school year ended, he was reassigned to first grade.\nOne teacher told investigators in a sworn statement that the official story was that Manley was moved because the incoming second-grade class was smaller than the incoming first-grade class. But really, she said, it was because he didn’t control his classroom.\nAnother teacher said the move came about because administrators were concerned about his relationships with students after the Snapchat incident.\nShiwali Patel, director of justice for student survivors and senior counsel at the National Women’s Law Center, said moving Manley to work with a lower grade level was a poor decision, at best, given how many warning signs Manley exhibited and the number of complaints about him.\n“They did have a sense he was engaging in grooming behaviors even if this was not observed,” Patel said, referring to teachers’ complaints about Manley’s behavior. “I don’t think it was responsible to have him teach first-graders because they were concerned by his behavior and how he was interacting with the students. The fact that he would have classes in the dark with a closed door…” she trailed off.\n“All that is suspicious, and to have that all happen in just a few months? I think that speaks to a need for education in K-12 schools on how to identify grooming behaviors. That type of behavior should not be ignored and should be looked into.”\nBut Manley floundered in his first-grade classroom too, so much so that administrators decided it would be better to demote him from classroom teacher to tutor at the end of the fall semester.\nIt was Nov. 30, 2018, just a few weeks before he was demoted, when the third-grader reported Manley to a tutor on food truck day.\nThe tutor, Stephanie Lahens, told detectives in a sworn statement that she first asked another recess monitor what she should do, who told her to tell an administrator right away.\nLahens said she relayed the information to Assistant Principal Barbara Fields, and Fields walked her over to the other assistant principal, Holley Holland, who asked for the students’ names. At that point, she said, Holland reassured her, saying, “I’ll talk to the girls and we’ll take care of it.”\nLahens told detectives she thought that was all she had to do. After lunch, she relayed the events to teacher Priscilla Rodriguez, who told investigators she followed up later that day with Fields. Fields, Rodriguez said, told her she was handling the report.\nHolland and Fields, however, recounted their interaction differently in sworn statements to investigators. Holland said she never spoke with Lahens – that she recalled Fields approaching her and telling her that Lahens “overheard some girls.”\n“I said, ‘You need to talk to those girls,’” Holland continued. “And she goes, ‘I don’t know who they are. She didn’t say.’ And then I kind of left that ‘cause I tried to be real careful of … she said she was going to take care of it.”\nBut Fields didn’t. She told investigators that she had “the weirdest conversation” with Lahens in either October or November about Manley, but that Lahens wouldn’t tell her who the students were, what they were saying or where they were, just that they were “talking about Mr. Manley.”\nFields said Holland, who won the district’s administrator of the year award the same day Manley was booked into jail, told her, “You don’t have any information to do anything with.”\nNeither of them looped in Principal Stewart, according to all three administrators’ sworn statements.\n“He shouldn’t have been allowed in school for three more months … with access to kids,” Rodriguez told investigators in her sworn statement.\nQuestions emailed to these six teachers, faculty and staff members by this news organization asking why they did not alert the authorities to the girl’s claims were not returned.\nCollier County Public Schools states in a September response to one of the civil suits that it had no “actual notice, nor any reason to suspect, nor even a suspicion based on a hunch, nor any means of discovering Hector Manley’s propensities” prior to his arrest and termination.\nThis, said Patel of the National Women’s Law Center, is worth an investigation by the U.S. Department of Education, which she believed would identify additional survivors.\n“Teachers were made aware; it was reported to them he was molesting students and they didn't do anything with it,” Patel said. “They just dropped the ball completely.”\nFailing to report suspected child abuse is a third-degree felony that carries a statute of limitations of three years in Florida, but Collier County Sheriff’s detectives did not charge any of the district employees who did not follow up on the Nov. 30 report. Four of them spoke with investigators and admitted in their sworn statements that they did not report the girl’s claims to authorities and offered conflicting versions of the information they received.\nBut there’s confusion around whom mandatory reporting laws apply to, and many adults admit reluctance to calling in a report they aren’t sure is accurate, Honowitz said. As a result, failure to report suspected child abuse is rarely prosecuted, she said.\nHonowitz said that as an attorney with the sex crimes and child abuse unit of the 17th Judicial Circuit of Florida, she saw a lot of situations come through like this, where adults, reluctant to report potential abuse in case they were wrong, passed the buck to another adult who they thought would take care of it. Still, she said, the buck stops with the administrators.\n“You’re in charge,” Honowitz said. “If something like a child being touched doesn’t generate enough concern for you to bring that kid to your office right now? I think there’s a problem.”\nMore students come forward about Manley’s abuse\nOn the day of his arrest, Feb. 28, 2019, Manley was in the teachers’ lounge attending his 30th birthday party, exactly three months after the events of food truck day.\nAbout 1:30 p.m., two new third-grade girls told their teacher that Manley had molested them, and they saw him do the same to at least one other student. It began when they were in his second-grade classroom, they said.\nThis time, when a teacher contacted Assistant Principal Holland, she immediately took action. She told Principal Stewart, they sent Manley to district headquarters with his badge and key and called the Florida Department of Children and Families.\nManley was arrested and fired, in that order.\nThat, the district asserts, is all it needed to do.\nAs detectives investigated each child’s claim, evidence indicated Manley had abused a much larger group than the two who reported him in February 2019. Children’s statements show that over and over again, interviewing one survivor led investigators to another. Many of them said they had seen Manley abuse another student; sometimes more than one. A number of them corroborated each others’ recollection of abuse.\nBy the time detectives compiled the final list of charges, the list of survivors had grown to nearly two dozen.\nAccording to children’s statements taken over the course of several months, Manley groped nearly two dozen girls in the breast or groin areas, digitally penetrated two and pinched a young boy’s genitals while he sat at a desk, threatening to kill his mother if he told anyone.\nNo investigation, no report\nWhen this news organization asked the district for its Title IX investigation file and report on Manley, district public records supervisor Tiffany Myers said “there is no such file in existence.”\n“The District was first made aware of the allegations against Mr. Manley on Thursday, February 28, 2019,” she continued. “Upon learning of the allegations, CCPS immediately removed Mr. Manley from the school. On March 5, 2019, the School Board terminated Mr. Manley’s employment based on the arrest. Internal investigations are only conducted for active employees.”\nReporters pressed communications director Oliver for clarification and were redirected back to Myers' original statement and told the district could not comment on pending litigation or criminal matters.\nEducators, activists and attorneys well-versed in federal and state law on child sex abuse say investigations are meant to help identify systemic problems that need to change in order to better protect survivors and other students.\nA Department of Education official declined to comment on the district’s lack of investigation and report, saying that the Office of Civil Rights cannot comment on specific circumstances as they relate to compliance with federal civil rights laws, and that the department also cannot comment on pending investigations.\nhttps://ocrcas.ed.gov/contact-ocr and https://www2.ed.gov/about/offices/list/ocr/complaintintro.html\n“Doing an investigation could help identify the internal systems that need to change so this doesn’t happen again,” said Patel, a former Department of Education attorney who helped research and write Title IX policy before she left in the department in 2018. “It’s absurd, and I can’t imagine anyone would be OK sending their kid to a school where there was a sexual predator and the school didn’t bother to investigate what happened, who knew and why it occurred.”\nIn fact, Collier County Public Schools has carried out these investigations before and since, according to a response to a records request for specific district Title IX investigative records.\nA year and a half before Manley’s arrest, Collier County Public Schools completed a Title IX investigation and report on Brock Smith, a Naples High School teacher who has since been found guilty of having sex with a minor and sending lewd images to a minor. In March 2021, the district completed a Title IX report on Travis Westberry, an Immokalee High School coach, who was arrested on charges of transferring harmful information to a child via an electronic device and three counts of misdemeanor battery.\nWhen asked why the district carried out a Title IX investigation and report for Smith and not for Manley, Oliver wrote:\n“As previously shared, in cooperation with the Collier County Sheriff’s Office, Mr. Manley was removed from the school, arrested, and immediately terminated. There are multiple inaccuracies in your representations. These impinge upon the present litigation and cannot be addressed because we do not comment on active litigation involving the District, as well as subject matters that are linked to the criminal case.”\nExperts agree that firing Manley was the right thing to do, but they add that the best way to prevent future sexual predators from using Collier County Public Schools as hunting grounds is to thoroughly investigate what allowed Manley to abuse children without drawing suspicion.\nAlthough districts are encouraged not to conduct their own investigations while a criminal investigation is ongoing to prevent any additional harm done to victims, Shakeshaft said, after a case has concluded there is no longer any reason to wait.\nThe Department of Education’s Office of Civil Rights could force the district to conduct an investigation. Collier County Public Schools is currently facing two civil lawsuits from survivors’ parents that cite a lack of a Title IX investigation and report.\nAn investigation could result in additional training for teachers and children or even codifying a rule that says teachers cannot be alone with one student at a time.\n“Oftentimes when there's one incident of this, it points to a larger, systemwide problem,” Patel said. “Investigating it wouldn't have just been about figuring out whether he sexually abused students but (finding) out what were the gaps that were in this system.”\nParkside parent: I don’t trust that school\nManley’s arrest ripped through Naples Manor, Parkside’s neighborhood of small, cheerful homes and four-square apartments squeezed in alongside one another. Tricycles sit on lawns, children’s artwork proudly tacked up in windows for passersby to see.\nParents expressed frustration that the school district did not provide direct communication about the case.\nInstead, many learned of Manley’s arrest mostly through word of mouth and Google Translate, since the school and the district shared only a Facebook post on the arrest from the Collier County Sheriff’s Office. There were no parent meetings, emails or phone calls about the arrest, according to dozens of parents interviewed by the Naples Daily News.\nWhen school began again that fall, the principal, an assistant principal and half the first- and second-grade teachers had left. In total, more than 1 in 5 certified teachers were gone.\nNow, about a third of the school's staff who were there in 2019 remain. None of the administrators who led Parkside during Manley’s tenure are still employed at the school, although some are still with the district.\nConversing in Spanish, former Parkside parent Javier Hernández talked about the devastation that ripped through the neighborhood after news spread of Manley’s arrest, talked about the parents who moved their newly-quiet and withdrawn daughters away. But, he said, even though many of his neighbors say the school is to blame, everyone who was in charge of those kids bears some guilt.\n“Una persona nunca sabe lo que está adentro de una persona,” Hernández said. You never know if someone really is who they say they are.\nBut at least Manley’s in a place where he’ll pay, he added. “Está en un sitio donde pagar.”\nThat same wariness has coursed through other parents, many of whom had no option other than to leave their children enrolled in the neighborhood school where Manley preyed on children. Valentina Rangel, a Naples Manor resident whose son attended Parkside when Manley was arrested, said she no longer feels comfortable leaving her children in the care of the school.\n“No confío en dejar a mis hijos después de la escuela,” she said. “Ya no nos confiamos nada más. No tengo confianza en la escuela.”\nIn English, that translates to: I don’t feel like I can let my kids stay after school. We don’t trust we can do that any longer. I don’t trust that school.\nThis story has been updated with a response from the district, and to correct the year Manley was first hired by the district.\nKate Cimini is an investigative journalist covering Florida. Share your story at kcimini@gannett.com.\nRachel Fradette is a general assignment reporter for IndyStar. She can be reached at rfradette@gannett.com.\nCriminal justice investigative reporter Dan Glaun contributed to this article. Reach Dan at daniel.glaun@naplesnews.com.\nIllustration by Rachael Thomas, USA TODAY Network — Florida\nThis article originally appeared on Naples Daily News: Florida teacher sex abuse: Hector Manley molested children for years",
  "word_count": 5709,
  "scraped_at": "2026-02-14T12:14:05.990113"
}