{
  "article_id": "f7a7f5f964ed",
  "url": "https://www.dw.com/en/ex-bayern-munich-boss-jens-scheuer-takes-on-wsl-challenge-with-brighton/a-64376381",
  "title": "Ex - Bayern boss Scheuer takes on WSL challenge – DW – 01 / 13 / 2023",
  "date": "20230113T141500Z",
  "domain": "dw.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Ex-Bayern boss Scheuer takes on WSL challenge\nJanuary 13, 2023From a Bundesliga title to a relegation scrap in England, Jens Scheuer's latest move is unexpected. The former Bayern Munich coach talks to DW about the motivation behind the decision and the impact of Christian Streich.\nThe last time Jens Scheuer stood on an English touchline, he was managing Bayern Munich in a Champions League semifinal. Twenty months after Chelsea's late surge ended his team's hopes, he's set to return in very different circumstances: as the Brighton and Hove Albion manager tasked with keeping his side in the WSL.\nScheuer's ambitions for his new club stretch far beyond survival in England's top flight. But having only taken over from former England coach Hope Powell after Christmas, his long-term vision has to wait for now.\n\"It's best to find the balance and to work on the basics first,\" he told DW. \"Because we've only worked together 10 days. I'm not Jesus. So we need a little bit of time.\"\nThe 44-year-old got his chance at Bayern after an impressive stint at Freiburg, where he was instrumental in bringing through young players like Giulia Gwinn and Klara Bühl, both now key members of the Germany squad, while reaching the German Cup final and recording Freiburg's best finish of third place.\nYouth development key\nAfter breaking Wolfsburg's four-year grip on the Bundesliga title in 2020-21 with a record point haul for Bayern, he left by mutual consent after losing just three league games in the following season. A league that has had just two champions in the last decade leaves little room for error.\nThere may be a little more leniency at Brighton, for a while at least. The ambitious club on England's south coast offers Scheuer the chance to develop young players as he did at Freiburg, with the chance, he thinks, to eventually play at the top table, like Bayern.\n\"It was important to me to have an interesting project, rather than to get to a top, top club like Arsenal, Chelsea or Real Madrid,\" he says. \"The vision and the strategy is what I'm searching for. We can't close our eyes and say we're perfect now, because we are not. But we can grow up together and get in the direction we want to go.\"\nBut it's very early days. Scheuer's wife is still back in Munich for now, along with his two school-age sons. It's \"not easy\" for the family but Scheuer believes it's right for his children's education. And, right now, his new job is just about the only thing occupying his mind.\nOne track mind\n\"Even as we are talking about this, I'm thinking all the time. 'OK, Leicester are building up in this way, what shall we do to win it back and how do we find more space behind them?' My break is in the summertime maybe, or sometimes when I'm with my kids, they can bring me a little bit of relaxation. But actually, my work is come here at seven o'clock and leave at seven. Go home, have a shower, take the laptop and watch the matches.\"\nThere has, at least, been one social outing since his arrival. Well, sort of. \"Once I was in the pub in Brighton I walked around and around but the reason was I wanted to watch the [men's] game. Chelsea v City. I got my beer on the bar and watched the game.\"\nCompeting with the likes of Chelsea and City in the long term is what is driving the WSL's first German coach. As he talks of his plans to build the club up by developing and selling young players while building an environment that makes them want to stay, the strong link between the men's and women's teams, the dedicated €9.5 million women's training facility and his tactical philosophy built on \"pressing and intensity\" there's a clear sense that Scheuer is looking to forge a dynasty: \"I don't want to be here only a year. We started on a path together and I hope it will be a long, long, long, long, one.\"\nLessons from Christian Streich\nHe has a good role model. As a youth player at Freiburg in the mid-90s, Scheuer was coached by Christian Streich who, decades later is still at the club, having been first team head coach since 2011.\n\"It would be amazing if we can have the same connection. But this takes time and patience from both sides. Christian was relegated with Freiburg too, if you're not the biggest club it can happen. But then you have to trust the process. It's not so easy. Football is such a big business now, and there are so many interests from different sides and everyone wants to make money.\"\nWhile Brighton's investment in facilities and a coach of Scheuer's pedigree signals their ambitions; Chelsea, Arsenal and Manchester City dominate the silverware in England in a way Wolfsburg and Bayern do in Germany. Nevertheless, Scheuer won't settle for midtable consistency and, he believes, neither will his new club. How long his chosen path will end up being is an open question. But, first of all, it leads to Leicester.\nEdited by James Thorogood",
  "word_count": 870,
  "scraped_at": "2026-02-14T12:21:40.214012"
}