{
  "article_id": "f7d6c9d6411b",
  "url": "https://www.the42.ie/ireland-world-cup-7-6150653-Aug2023/",
  "title": "Reality bites for Ireland stars out of World Cup bubble",
  "date": "20230826T070000Z",
  "domain": "the42.ie",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "THE BOB PAISLEY Bar on the first floor of the Hetton Centre was free for bookings this weekend.\nIt is named after the legendary former Liverpool manager, who was born in the small County Durham coal mining village of Hetton-le-Hole just a few miles outside of Sunderland.\nEven on a Bank Holiday weekend in Britain the function room was available on both Friday and Saturday night.\nIt means there will be no hasty clean-up job required for staff after an 18th or 21st birthday party as the complex prepares to host its first Women’s Championship game of the season on Sunday.\nThe Eppleton Colliery Welfare Ground that is just below is a long way from Australia and New Zealand.\nIn every sense.\nIt is where Sunderland host their women’s team and it is where some of Ireland’s stars will feel reality bite in England’s second tier after emerging from a World Cup bubble in which they played in front of a total of 117,733 fans over their three group games.\nThe Eppleton Colliery Welfare Ground has a capacity of 2,500 with 250 seats.\nThis is a return to the norm.\nSunderland are at home to London City Lionesses on the opening Sunday of the season, the club in England’s capital growing a solid core of Irish players over the summer.\nThe signing of Ruesha Littlejohn piqued plenty of interest earlier this week.\nThe 33-year-old has signed a two-year deal with the Lionesses and drops down from the Women’s Super League having endured an injury-hit campaign with Aston Villa.\nA broken foot, calf strain, laceration of the knee, and Achilles problems conspired to make the last 12 months pretty brutal.\nNo wonder, then, that Littlejohn spoke about simply hitting the ground running and “playing lots of minutes” with her new club – who narrowly missed out on promotion last term after finishing three points behind champions Bristol City.\nThe hope for the veteran international is that the form she showed in a condensed period during the World Cup can now be replicated over the course of a full campaign.\nHer displays in midfield for Vera Pauw’s side against Australia, Canada and Nigeria highlighted her class at the top level. The Glasgow-born star remains an efficient, quality operator capable of covering ground between both boxes.\nAfter Katie McCabe, and perhaps Courtney Brosnan given her player of the match award against Nigeria following that world class save from Uchenna Kanu’s header, Littlejohn was Ireland’s standout performer.\nShe knew back in May that her time with Villa was over, one of numerous players released at the end of their contracts, so her build up to the World Cup was two-fold: a mixture of anticipation for the most exciting period of her career as well as the realisation it could help shape the next part of it.\nLittlejohn thrived.\nThe only surprise is that a club in the Women’s Super League – which has a later start date in early October – didn’t come in, although the guarantee of regular football in a side bidding for promotion is perhaps a key factor.\nIreland goalkeeper Grace Moloney was already confirmed by London City after her 14 years with Reading, while defender Niamh Farrelly returned from Parma in Italy to make up the Irish contingent.\nLittlejohn’s arrival was also crucial given her international teammate Lily Agg departed for Birmingham City, joining another healthy section of the diaspora in the English midlands.\nLouise and Lucy Quinn remain with the Blues while Harriet Scott – one of the training players at the World Cup – confirmed her retirement as she focuses on her new career as a doctor.\nFull-back/winger Jamie Finn was alongside Scott in that group on the periphery Down Under, one of those surprisingly left out of Pauw’s 23-strong squad but who still did her duty on a daily basis without hope of a World Cup appearance.\nHer experience in the shadows could not have been any more of a contrast to that of Littlejohn’s, yet when Birmingham play Blackburn Rovers tomorrow Finn will be in a similar boat.\nThe World Cup is over, the stage from the O’Connell Street homecoming has long be packed away, and the football world continues to turn for Littlejohn and Finn.\nThe challenge is to find form ahead of the start of the Nations League campaign against Northern Ireland at Aviva Stadium on 23 September.\nYet, less than a month away, who they will have to impress is unknown. It should also become clearer over the coming days as FAI director of football Marc Canham has overseen a “full and comprehensive review” of the World Cup campaign and will make his recommendation to the board about Pauw’s future on Tuesday.\nBut for those London City fans who travel north to Sunderland, the topic of conversation in the Bob Paisley Bar is unlikely to be the Ireland manager, rather the impact of their new Irish stars.",
  "word_count": 824,
  "scraped_at": "2026-02-14T13:04:06.793308"
}