{
  "article_id": "f7d79047692e",
  "url": "https://www.twtd.co.uk/ipswich-town-news/45153/mckenna-felixstowe-friendly-ticked-all-the-boxes",
  "title": "McKenna : Felixstowe Friendly Ticked All the Boxes - Ipswich Town News",
  "date": "20230701T200000Z",
  "domain": "twtd.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Saturday, 1st Jul 2023 16:16\nTown boss Kieran McKenna felt the Blues’ 6-0 pre-season victory at Felixstowe & Walton ticked all the required boxes.\nFreddie Ladapo scored twice and Sone Aluko, Kyle Edwards, Kayden Jackson and Panutche Camara once each in the 30 minutes a half match at the AG Arena.\n“I think the priority is always no injuries, show a good attitude and finish off what’s been a really demanding week on the players,” he said.\n“We’ve managed to tick all those boxes, so we’re happy with what we’ve got out of it.”\nTown started pre-season training last week and McKenna was asked if it was mainly getting running into his players’ legs or whether there was much ball work going on.\n“A bit of both,” he reflected. “We have six weeks to get ready, we’ve got a lot of work to do, physically as well as tactically, mentally as well.\n“We’re straight into that work from day one, there’s no time to ease yourself in in modern football. The expectation is that you come back in good condition and then we look to get better as a team.\n“We’re straight into that, the players have worked really hard in all aspects but we’ve got a long way to go to make sure we’re ready.”\nMcKenna included youngsters Rio Morgan and Fin Barbrook, the former starting for the second-half XI and the latter taking over late on but the Blues boss says they aren’t the only academy players who have been involved with the first-team squad.\n“There are quite a few players coming out of the FA Youth Cup team last year, players who played in the U21s last year, who have made a good impression,” he said. “There have been a few others training with us at times this week as well.\n“They’re two of a batch of players that we’re keeping a really close eye on and they come up and train with us on a fairly regular basis.\n“Of course, the squad at the moment is big, so there isn’t always as much space for your best young players but they’re very early in their development, both very young, but two good prospects with the right attitude that we want to see keep developing.”\nOverall, the Northern Irishman says Town enjoyed their afternoon at a capacity AGL Arena: “Really good. Just a fantastic welcome first and foremost, a typical Suffolk welcome. We’ve been really well received by the people.\n“It’s been a great turnout, we know how much it means to these clubs to show that we’re there and we’re supporting them in different ways.\n“It’s nice to be here and with the women’s team playing here there’s a bit of an extra link, so it was a nice fixture for them for us to be here and it was a good fixture for us in terms of getting some minutes.\n“Just like we did with Needham Market last year, we want to have those good links with the clubs around us.”\nNeedham Market’s Bloomfields is where Town are in action next, in a friendly on Friday evening against Maidenhead United when his players will play a full half each.\n“Maidenhead next Friday night and all being well with the training week this week, we’ll have 22 players fit and ready to go and we’ll share the minutes across the 90 and will look to build up progressively as the pre-season goes on,” he said.\nFollowing that, Town are off to Austria for their pre-season training camp, the first overseas pre-season trip since 2019.\n“Really looking forward to that,” McKenna said. “The first time the club will have travelled away for a few years. The first time for me going out of the country with this group.\n“We’re looking forward to that, it should be a really good training week and we’ll finish it off with a couple of fixtures that the club will confirm in due course and that will be a good week for us.”\nTown are due to play a training ground game against Slovakian side Spartak Trnava on the morning of Saturday 15th July and then Admira Wacker at their motion_invest Arena in the afternoon.\nPhoto: TWTD\nPlease report offensive, libellous or inappropriate posts by using the links provided.\n- Page:\n- 1\n- Page:\n- 1\nYou need to login in order to post your comments",
  "word_count": 735,
  "scraped_at": "2026-02-14T12:00:05.033168"
}