{
  "article_id": "f7e1780d6b8e",
  "url": "https://www.justarsenal.com/arsenal-women-share-some-of-their-pre-christmas-celebrations-with-us-merry-xmas-gooners/383565",
  "title": "Arsenal Women share some of their pre - Christmas celebrations with us ! Merry Xmas Gooners ! ",
  "date": "20241225T171500Z",
  "domain": "justarsenal.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Our Arsenal Women are currently on winter break, but left us some festive fun messages before they departed for their various individual Xmas celebrations…\nOur Gunners have really turned around their 2024-25 season thus far, after a somewhat wanting start under former head coach, Jonas Eidevall. Their campaign has been marked by significant achievements in both the UEFA Women’s Champions League and the Women’s Super League.\nIn the Champions League, Arsenal showcased their European prowess with impressive early results. They dominated the qualifiers, securing decisive victories against Rangers (6-0), Rosenborg (1-0), and Häcken (4-1). Despite a challenging 5-2 loss to Bayern Munich in the group stage, the team quickly rebounded with commanding wins throughout the rest of the group stage qualifiers. Our Gunners managed to top their group with their 3-2 win over Bayern Munich, at Meadow Park, on 18th December, to reach the UWCL quarter-finals.\nWhen you remember it’s Christmas tomorrow 🎄🤣 pic.twitter.com/UrdQ4iiUeM\n— Arsenal Women (@ArsenalWFC) December 24, 2024\nThe team’s domestic performance has been equally compelling and they currently sit 3rd in the WSL table, only one point behind Manchester City in 2nd place, though somewhat off leaders Chelsea\nFrida Maanum has emerged as a standout performer, contributing numerous goals and assists. while Alessia Russo has also been crucial, really finding her form in recent months. Caitlin Foord and Beth Mead have consistently supported the team’s attacking strategy, with Foord contributing 3 goals and 3 assists, and Mead scoring 3 goals and providing two assists.\nThe season has not been without challenges. The departure of head coach Jonas Eidevall on 15th October 2024, with Renée Slegers assuming an interim role, represented a significant transition for the club and players alike.\nOur favourite reluctant carol singers 🎄🤣 pic.twitter.com/HDQbtit58l\n— Arsenal Women (@ArsenalWFC) December 23, 2024\nArsenal Women continue to demonstrate why they are considered a powerhouse in women’s football, combining tactical skills (especially under Renee!), individual brilliance, and a commitment to excellence across competitions.\nSeasons Greetings to all of our readers from the JustArsenal team!\nMichelle M\nFollow JustArsenal’s Gooner Women on Just Gooner Women on Twitter for regular updates on the Arsenal Womens Team!\nDo you want to read more about the Arsenal Women’s Team? Click here….",
  "word_count": 370,
  "scraped_at": "2026-02-14T12:22:59.843037"
}