{
  "article_id": "f7e82770625e",
  "url": "https://www.prospectmagazine.co.uk/society/66702/a-love-letter-to-luton",
  "title": "A love letter to Luton",
  "date": "20240608T101500Z",
  "domain": "prospectmagazine.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Luton’s first ever major music festival was filled with special moments. Olly Alexander singing “It’s A Sin”. Sabrina Carpenter dropping an f-bomb live on the BBC. David James handing out ponchos and scratch cards in the town square. But the biggest surprise of R1’s Big Weekend came at the close, when Chris Martin, who had already sung “Yellow”, finished Coldplay’s set with a new composition: “Orange”.\n“It’s hard to be a football fan here in Luton town,” he sang. “Sometimes you do the best you can, still you find you’re going down.” The crowd, many of them dressed in the local team’s colours, screamed their approval. Luton Town FC has never had its own official song, and one of the world’s most famous musicians had just gifted them one.\nFor three days more than 100,000 festival goers had streamed cheerfully through the town centre, a rainbow-coloured manifestation of what Luton’s first ever season in the Premier League had wrought. Without the global glow of England’s top-tier competition, the BBC might never have thought to stage their marquee music festival here.\nJust a week previously, Luton had been relegated back down to the Championship, as most pundits had predicted they would be. Now the question is: can Luton’s fleeting footballing success have a lasting legacy on the town?\nLuton has struggled with its reputation for more than 50 years—perhaps since developers buried its High Street beneath the Arndale, one of the UK’s first concrete shopping centres, in 1972. Four years later a Campari advert, starring Lorraine Chase, turned the town’s no-frills airport into a punchline. Luton is still dogged by the spurious title, awarded in 2004 by the Idler magazine which was promoting a series of toilet-read books, of Britain’s Crappiest Town.\nThese days its town centre feels all but abandoned, as do so many in England—the absence of major retailers is a visible manifestation of an economic decline accelerated by austerity, Covid and the cost-of-living crisis. And links to the 7th July London bombers, and the 2009 founding of the English Defence League by native son Stephen Yaxley (aka Tommy Robinson), have also hurt, encouraging the media to depict the town as a petri dish for both far-right and Islamist extremism.\nCan Luton’s fleeting footballing success have a lasting legacy on the town?\nBut the popular image of this unpopular town has misrepresented much and missed plenty else. It’s unlikely you knew, for instance, that Luton is home to the UK Centre for Carnival Arts, putting on the UK’s biggest one-day carnival each May. Or that it had a jazz club voted one of the top 25 in the world, or that one of its independent chicken shops placed first in the nationwide WingFest competition and was invited to feed the England men’s football team. Last year JustGiving reported that it was the third most generous place in the UK when it came to donations through its site.\n“I think everybody in Luton has had enough of being kicked,” says Stephen Browne, part of the fan-led consortium that took over the football club when it went into administration in 2007 and which spent the past decade dragging it back from the nether regions of non-league competition. “And now people see something in the town doing well, it can be a self-fulfilling prophecy… that creates more interest in what else is going on in the town.”\nThe football club’s 139-year-history has been, overall, a modest one. Until last season it was best known for its embarrassing astroturf pitches in the 1980s, an infamous riot at a Millwall game and a peculiar away end which requires visiting fans to climb past the back gardens of two terrace houses to reach their seats.\nThe first southern club to turn professional boasts just one major trophy—the 1987-88 League Cup—but from May last year, Luton Town could lay claim to a unique achievement. Ten years after relegation to non-league football, they became the only team ever to climb through all the tiers of the professional game to the Premier League. Theirs was the ultimate underdog story (Wrexham who?) and during this latest season, the promise-crammed air around the stadium has inspired pride even among Lutonians who have never watched a game in their life.\nA mile from the club’s historic home—opposite St Mary’s, the checkerboard church that has stood in the middle of Luton for 900 years—diggers are now tearing up the site of a former power station. After decades of rejections, obstructions and deferrals, the football club finally has land and plans for a new ground—not to mention the necessary funds, thanks to this season’s Premier League participation. Power Court, as the stadium is putatively known, will include restaurants, shops, bars and even a music venue, and is the messianic hope for the moribund town-centre.\nThe moment that Luton won their Wembley play-off in May 2023, optimistic politicians and residents alike began speculating about the outside investment the football team’s success might inspire. In the past 12 months the club’s brand has reached millions of homes worldwide that had never before heard of the town. The signing of Japanese right-back Daiki Hashioka in January caused an instant spike in followers in his home country, adding to to the club’s social media interactions. Some new fans have even made the journey to watch their countryman play at Kenilworth Road.\n“I think everybody in Luton has had enough of being kicked}’‘\nBrowne witnessed the power of the media spotlight first-hand in Sydney this year, when a carful of Australians, seeing his LTFC licence plate, pulled up next to him to ask if he was a Hatter (as Luton Town fans call themselves). “There is an element of ‘the circus coming to town’,” he says, “but what that enables us to do on a longer, ongoing basis is to invest in our academy and our facilities, and to employ local people in the jobs we create.”\nIt has also allowed the club to be bolder with their ground development, building Power Court to its maximum allowable capacity right away rather than in stages, as was originally planned. The ringfencing of large portions of their Premier League windfall for the new stadium cost the club in other ways—last year’s squad cost one-fiftieth the price of Chelsea’s, and their limited spending on talent was one reason for their struggle to compete against bigger teams.\nAnd yet Luton’s never-say-die spirit, and their tenacious, attacking style of play, forced title-contending teams such as Arsenal, Liverpool and Spurs to leave relieved and thankful at a one-goal victory or even a draw. They lost 24 of their 38 games, but that stark statistic doesn’t convey the pleasure and affection they inspired beyond their own fanbase, becoming the league’s favourite underdog. At a time when the sport’s mega-rich owners and greedy behaviour taints so much of its followers’ enjoyment, Luton’s community-first approach has been as a popular throwback.\n***\nYou hear the word community often in Luton, both to describe the town’s ethnic and religious groups and also the local events and activities designed expressly to bring them together. In April, St George’s Square hosted an Eid event and the grey plaza wedged between TK Maxx and Wetherspoons was filled with families in colourful clothing and kids drumming along to a nasheed.\nAlongside the Bangladeshi, Pakistani and Afghani families were the Luton Turkish Women’s Association and a troupe of young Sikh performers in saffron turbans. Women of the Windrush generation spoke on stage, while the organiser of the town’s Polish and Romanian festivals looked on. The town has been a melting pot of immigration ever since Irish workers first began moving here in the aftermath of the Second World War to help build the M1 motorway or take up jobs at the Vauxhall factory.\nCouncillor Javeria Hussain, who grew up in Dallow, one of Luton’s most deprived areas, is proud of what she saw that day. “Those who say bad things about the town haven’t met the people,” she says. “Everywhere in the UK has issues related to austerity, poverty, homelessness—but there are a lot of positives here too.”\nHistorically, Luton’s working-class economy punched above its weight thanks to its ability to adapt to new industry, from brickmaking to hat factories to engineering works and ultimately the Vauxhall plant, which at its height in 1960 employed 37,000 people, just under a third of the population. By the time it shut down in 2002 the workforce was a mere 700, the majority of whom were absorbed by the airport and surrounding aviation industry.\nThe closure nevertheless left a psychological scar. Many inhabitants now work in unskilled, low-paid jobs, and austerity followed by Covid have stymied all efforts at improving the town’s economy, public spaces and standard of living. The comparison with the immensely wealthy nearby towns of Harpenden and St Albans is telling. Luton ought to be an attractive option for those looking for affordable family homes close to London. Instead it is the town that just won’t gentrify.\nUntil last year Hussain was the chair of Luton Rising, the public enterprise that oversees the airport. Luton’s is the only major UK airport wholly in public ownership, and as a council-owned asset it helps to fund community programmes and development. This summer the Secretary of State for Transport will decide whether to approve an expansion plan which would increase passenger numbers from 18m to 32m a year by the mid 2040s. (Council leaders have adopted “Green Controlled Growth” measures in their plans, which include legally binding limits for carbon emissions, air quality and noise effects, but the independent Climate Change Committee has advised that no airport expansions should proceed until aviation is sufficiently decarbonised to meet Net Zero by 2050.)\nHistorically, Luton’s working-class economy punched above its weight\nIf this expansion is approved, Luton Rising says it will create 11,000 new jobs and bring an additional £1.5bn a year of economic benefits. But Lutonians have been promised change before. In the 1990s, the council ran a marketing campaign, “Luton’s Looking Up”; the logo was a maniacal smiley-face that seemed to capture the desperation of the statement. In 2006, the increasingly decrepit Arndale was rebranded as The Mall, and the town’s erstwhile teacher training college became the University of Bedfordshire.\nThe material benefits from these changes have been slow to infiltrate the economy. Last year a study by the Joseph Rowntree Foundation ranked the population the 10th most destitute in the country; and according to the council’s own data, around 45 per cent of children in the town are growing up in “relatively poverty”, compared to 27 per cent nationally. Luton Rising’s stated target is that within two decades, no household will be living without basic needs. At present, such households account for 12 per cent of the local population.\nBeneath the town hall clocktower, the Sikh Soup Kitchen, staffed by volunteers from the gurdwara near Kenilworth Road, hands out curries to a long line of regulars. Both the organisers here and those running a similar operation at the Discover Islam centre have noticed the uptake increasing lately—more than 200 meals were handed out in the course of an hour, as well as toys for children, celebrating the festival of Vaisakhi. “We see a lot of students from the local universities,” says Bal Ahir, the soup kitchen’s coordinator. “But we also see a lot of families with their children. It seems like Luton has been getting poorer.”\nSome of the lads volunteering say that the Sunday soup kitchen is almost the only time they venture into the town centre, which can be an intimidating place after the shops have shut. A couple of months ago, one of them came with his parents to get dinner. “But it was scary, there were people over there fighting, so Dad just put us all straight back in the car and we went home.”\nPolice statistics show that crime rates dropped last year during Luton’s promotion-winning season, and the mayor went on to say that the sporting success had created a stronger sense of community in the town. But while Luton Town’s fanbase remains predominantly white, in the streets around Kenilworth Road more than 50 per cent of residents are Asian or British Asian. But the club has begun work to engage its most immediate neighbours. The youngest lad at the Soup Kitchen started supporting the club after he went to a game on one of the free tickets they distribute among the local community.\nAbu Nasir, a Luton-based sports agent and former chair of the Muslim Sports Council, believes the club can do more to bring the town’s disparate groups together. Sometimes people have just assumed that Asians are not interested in football,” says Nasir, who is on the strategy group for the FA’s Asian Inclusion plan. “But we've got hundreds of players playing in local leagues.”\nNasir attended a Luton school notorious for fights and expulsions and says that his passion for football offered alternative experiences and widened his social circle beyond the Bangadeshi community in which he grew up. He wants to see Luton Town create more opportunity for Asian players at both junior and senior level, and a deeper engagement with the majority Asian community in which it’s based.\nThe club do distribute free tickets to local residents—at least one young lad at the Soup Kitchen had started supporting Luton as a result of the scheme—and they also hosted their first iftar event at the ground in March. Oil money and private investment funds don’t seem an obvious fit with the club’s current ethos, however. The Hatters’ appeal has always been a local one, a reflection of the town’s working class environment. Its next stage of development offers a unique chance to create a multicultural fanbase and a unifying identity for the town.\nNasir also identifies other opportunities—both for the team and the town. His own playing career—first at Luton Town’s academy, then at Liverpool’s—never went fully professional, but an MBA and a job in the City have returned him to the sport in a more entrepreneurial role. Having played a role in setting up the Saudi Pro League, Nasir sees opportunity for Saudi, Qatari or Emirati investment in Luton. “Rather than Liverpool and Manchester and other areas, we need to bring them here,” he says. “If we’re going to tackle poverty in the town, the key thing at the moment is getting that investment in. And I think the football club is crucial to that.”\nOil money and private investment funds don’t seem an obvious fit with the club’s current ethos, however. When Browne outlines his vision for the future, he remembers how his grandfather played alongside Luton legend Joe Payne in the 1930s. “It was a family club back then,” says Browne, “and everybody knew everybody. So many of our older supporters remember that vibe, and we’re asking people to recall that and live that.”\nWhether the stardust settles is another matter\nPerhaps this is why some fans say they would rather see Luton stay in the Championship, without the financial pressures and morally dubious choices that attend survival in the Premier League. The club’s 18th place finish earned them around £120m, with an additional parachute payment of around £50m to help cushion the drop. Those extra funds will help them to replace the talent already being poached by canny managers impressed by their performances this year, and should leave them one of the stronger teams in the second tier.\nThe new Championship season begins on 10th August, and Luton find out their first opponents at the end of this month. The club have offered manager Rob Edwards a new contract, although he, too, may yet be lured elsewhere. Whether he goes or stays, Edwards will remain beloved in Luton for all that he has achieved in raising the club and the town’s profile. He was easily the most popular celebrity at R1’s Big Weekend, despite the presence of Simon Pegg, Lawrence Dallaglio and the contestants from BBC reality contest Race Across The World.\nAfter Harry Styles visited Kenilworth Road for the Man United game earlier in the season, the town has probably attracted more stardust this year than at any point in its thousand-year history. Whether that stardust settles is another matter. The new Power Court stadium, and a renewed pride among the local population, offer a chance to reboot the town’s economy and renew its identity but for both the club and the town, the next stage of their journey is the crucial one. Luton’s challenges, which are great, are echoed in towns across the country; more than their own future may be decided by the outcome.",
  "word_count": 2785,
  "scraped_at": "2026-02-14T13:01:27.914858"
}