{
  "article_id": "f8042c0972a0",
  "url": "https://theathletic.com/4945691/2023/10/12/cardinals-troubling-workplace-michael-bidwill/",
  "title": "Arizona Cardinals employees detail troubling workplace culture under owner Michael Bidwill",
  "date": "20231012T103000Z",
  "domain": "theathletic.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "More than a dozen current and former Arizona Cardinals employees detailed a culture at the organization in which they felt constantly on edge, and described unwritten policies about how women were to dress, interact with male football staffers and players, and where they could and couldn’t go in the building.\nAdvertisement\nThose policies forced them to operate in an environment that, as one framed it, was “outdated, archaic, constricted.” They also described how the lack of a robust human resources department made it difficult to know where to take complaints, such as nursing mothers having to pump near the showers in the locker room or in a conference room. The current and former employees spoke to The Athletic on the condition of anonymity out of their fear of retaliation from team owner Michael Bidwill, an attorney and former federal prosecutor.\nIn response to the allegations, Bidwill issued a statement that read: “As I have said personally to every member of the Cardinals organization, I certainly have room to grow and with the benefit of hindsight, would have done some things differently over the years. I also know that my direct approach doesn’t always land well, and I’m working on that. I have always been driven by the desire to learn and improve and more importantly, to use those lessons in building the best organization possible. Over the last several years, we have taken significant steps to improve our culture and build a stronger community. We are a better and more inclusive organization today than we were yesterday and I’m extremely excited about what we can be tomorrow.”\nWorth an estimated $3.8 billion according to Forbes, the Cardinals employ a pared-down corporate structure in contrast with other franchises and employ approximately 140 people on the non-football side of the operation. When Bidwill, 58, assumed the role of principal owner following the death of his 88-year-old father, Bill, in 2019, he didn’t hire a team president (his previous role) and left the position of chief operating officer vacant for more than three years before filling it in August.\nThat structure, some former and current employees said, contributed to the creation of a top-down culture where Bidwill sometimes hovered over minor tasks and erupted over the smallest of grievances.\nAdvertisement\nTwo employees recalled Bidwill berating someone for pushing a squeaky cart near his office. Another told of how Bidwill got upset with a woman for laughing. Just after being hired, one employee said a supervisor told her she would be an “official Cardinal” once she got yelled at by Bidwill or another senior manager. “Like 20 minutes after that, Michael Bidwill yelled at me,” she said.\nBidwill’s office was in the center of the second floor, and some staffers hesitated to go near there — one former employee called it “tiptoe alley.” If the team lost the previous weekend, or if Bidwill had already yelled at someone that day, word would quietly spread: Don’t go down the hall today, Michael’s mad.\nAvoiding Bidwill’s wrath was made more difficult because he sometimes involved himself in minor or mundane workplace tasks. One former employee said Bidwill became upset when the staffer assigned a new hire’s cell phone number to the 480 area code used in the Phoenix suburbs instead of the 602 area code for the city center. Another time, after a department opted to turn off the fluorescent lights above their cubicles in favor of softer lighting, an employee said Bidwill flipped the fluorescent lights back and announced: “Here we work with the lights on!”\nIn 2019, Cardinals employees were asked to complete a workplace survey in which some wrote about unpleasant encounters with Bidwill and unwritten rules they dare not break in his presence. Many female employees addressed a variety of issues that made some of them feel like second-class citizens inside the building.\n“People tore Michael Bidwill to shreds,” said a former employee with more than five years of experience with the team.\nIn the following weeks, many Cardinals staffers awaited the fallout but the results of the survey were never shared broadly.\nAdvertisement\nSome Cardinals staffers looking to raise concerns about the workplace said they didn’t know where to turn. There was no dedicated HR director from 2008 until 2021 and no fully staffed HR department until 2022. And some employees worried if they raised concerns they’d be quickly let go.\n“People just didn’t say anything,” one employee said. “They complain under their breath, and they go into their car at lunch and they cry.”\nIn 2022, the Cardinals went 4-13, lost franchise quarterback Kyler Murray to injury after a contentious contract negotiation, parted ways with their head coach and GM, then committed a tampering violation in the process of hiring a new coach.\nWeeks before the 2023 draft, former Cardinals executive Terry McDonough, who worked for the team from 2013 to 2023, accused Bidwill of organizing a scheme involving “burner phones” to circumvent the NFL’s no-contact stipulation of then-general manager Steve Keim’s DUI suspension in 2018. The Cardinals acknowledged the existence of the burner phone plan but blamed it on an unnamed executive. “Mr. Bidwill took swift action when he learned of that situation and directed the phones be retrieved and communications stopped,” a PR adviser hired by the team said in a statement.\nA few weeks before COO Steve Minegar left his job in January 2020, ending a two-decade run with the franchise, he delivered a three-page letter to Bidwill that referenced the employment survey.\n“We learned that a majority of our employees are working in fear,” Minegar wrote to Bidwill in the letter, a copy of which was obtained by The Athletic. “There are several factors, but much of this was directed at you based on the poor interaction they’ve had with you. What was your reaction when you saw the preliminary responses? Instead of leaning into it and trying to change things for the better, you shut the study down.”\nA team spokesperson responded: “The 2019 survey was not ignored. In fact, significant action was taken based on its feedback, the most prominent of which was the creation of the Chief People Officer role. Some changes were immediate, like the employee wellness initiatives announced in February of 2020, just weeks before COVID shut down the country. Others took longer as a result of the pandemic.”\nRead the full story on the Cardinals’ workplace environment.\n(Photo by Christian Petersen / Getty Images)",
  "word_count": 1074,
  "scraped_at": "2026-02-14T13:28:46.534444"
}