{
  "article_id": "f82c9aa49194",
  "url": "https://www.nationalaccordnewspaper.com/ballon-dor-nnadozie-shines-with-4th-place-finish-as-hampton-clinches-womens-yashin-trophy/",
  "title": "Ballon dOr : Nnadozie shines with 4th - place finish as Hampton clinches women Yashin trophy",
  "date": "20250923T101500Z",
  "domain": "nationalaccordnewspaper.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Super Falcons star Chiamaka Nnadozie earned global recognition with a 4th-place finish in the Women’s Yashin Trophy rankings, while England’s Hannah Hampton took home the prestigious goalkeeper award at the 69th Ballon d’Or ceremony in Paris.\nHampton, 24, was pivotal in England’s UEFA Women’s Euro 2025 victory, notably saving two penalties in the final against Spain.\nShe also played a key role in Chelsea’s unbeaten treble-winning season, solidifying her status as the world’s best goalkeeper for the 2024/25 campaign.\nMeanwhile, Nnadozie was a defensive rock for Nigeria at the 2024 Women’s Africa Cup of Nations, where she was named Best Goalkeeper of the Tournament.\nHer heroics helped the Super Falcons lift their record 10th WAFCON title after a thrilling 3-2 victory over hosts Morocco in Rabat.\nIn the coaching category, Super Falcons head coach Justin Madugu earned a nomination for Women’s Team Coach of the Year, following Nigeria’s triumphant run. However, the award went to England’s Sarina Wiegman, who led the Lionesses to their second consecutive European championship.\nOther notable moments from the evening included:\nBarcelona’s Vicky López winning the Women’s Kopa Trophy, ahead of England’s Michelle Agyemang\nLamine Yamal making history by retaining the Men’s Kopa Trophy — the first back-to-back winner\nItaly’s Gianluigi Donnarumma collecting his second Men’s Yashin Trophy, repeating his 2021 feat\nBack home, President Bola Tinubu recently honoured the Super Falcons with national awards, cash incentives, and housing gifts for their historic WAFCON triumph.\nThe glittering ceremony at Théâtre du Châtelet, Paris, celebrated the standout performers of the 2024/25 season across global football.",
  "word_count": 258,
  "scraped_at": "2026-02-14T12:36:32.798954"
}