{
  "article_id": "f834df70b1d0",
  "url": "https://thepeoplesperson.com/2025/05/05/man-united-women-duo-maya-le-tissier-and-millie-turner-laud-team-spirit-after-champions-league-qualification-293645/",
  "title": "Man United Women duo Maya Le Tissier and Millie Turner laud team spirit after Champions League qualification - Man United News And Transfer News",
  "date": "20250505T120000Z",
  "domain": "thepeoplesperson.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Manchester United Women secured their place in the Champions League with a 2-2 draw against Manchester City Women yesterday afternoon.\nThe Red Devils overcame the severe obstacles of being two goals down and also playing the last 25 minutes with ten players after Aoife Mannion was sent off.\nMaya Le Tissier has been one of the standout players of the season and the captain has shown incredible leadership at just 23 years old.\nSpeaking to the club’s official website after the game she praised the self-belief of her side.\nShe said, “it was very stressful but even with the ten players we had, I really believed that we were going to do it. To be fair, on Wednesday night I thought we going to do it too. That just shows the confidence in the team.”\nLe Tissier believes that the unity in the group is also vital and she stated, “we said before the game, we are such a together team. We will run for each other, we will fight for each other just to get the end goal and we managed to do that. Yeah, very relieved.”\n“It’s been fun, really fun and these are the sort of games that you want to play in at Old Trafford against City, Champions League is on the line. So yeah it was special. We are so together that I feel we are unbreakable at times.”\nLe Tissier also opined that the players were not even aware how much time was left to defend with ten players after Mannion was sent off. She also praised Melvine Malard who scored the all-important second goal and claimed she showed her “true class” after overcoming the disappointment of not starting the match.\nReflecting on her season as captain she asserted, “yeah it is so special, when you play football at a high level and the pressure is on, you never really take a moment to see where the team has come from. We wanted to win the league of course, but that wasn’t to be and now we wanted Champions League and we managed to get that. It is a very special feeling and we can’t wait.”\nVeteran United defender Millie Turner also praised the unity of the side and claimed this was vital to completing their objective. She said, “it feels so so good, honestly. It’s the best feeling in the world. It is what we set out to do. I think in our heads we just knew that we had a job to do today. We went out there and just knew what we had to do collectively. We just stayed solid the whole game and I thought we were never going to lose that game.”\nTurner also highlighted the key role the fans have played all season and how important it was to seal qualification at Old Trafford.\nShe explained, “we were in the huddle at the end and listening to the singing and the United chant was just incredible. Honestly, we just listened to it and wanted to join in with the fans. It’s just been an unbelievable season and to be honest, it has been one of our best.”\nElaborating further on the role of the supporters she claimed, “yeah everyone is with us. It is so important that we have our 12th man out there. They’ve been outstanding all season and it is just incredible to share this journey with them.”\nTurner has been with the United team since their return to Women’s football in 2018 and she was asked about where this team stands in comparison with past editions.\nShe was effusive in her praise claiming, “amazing, honestly I cannot say a bad word about it. It is incredible where we are, I think our form is just outstanding. Everyone can see it, I think teams are scared to come and play us because they know we are going to give absolutely everything, so yeah, we just need to carry that on.”\nUnited will travel to face Arsenal in the final league match of the season on Saturday. After they will make the trip down to Wembley with the objective of winning their second FA Cup against Chelsea on Sunday 18th May.\nFeatured image Gareth Copley via Getty Images\nFollow us on Bluesky: @peoplesperson.bsky.social",
  "word_count": 716,
  "scraped_at": "2026-02-14T12:58:17.880708"
}