{
  "article_id": "f84ce4f1cca8",
  "url": "https://www.sandiegouniontribune.com/2025/09/11/scuffling-wave-look-to-break-through-with-win-over-gotham-fc/",
  "title": "Scuffling Wave look to break through with win over Gotham FC",
  "date": "20250912T003000Z",
  "domain": "sandiegouniontribune.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "The San Diego Wave face a tall task Friday night, when they take on Gotham FC and the visitors’ stingy defense at Snapdragon Stadium.\nGotham has allowed only 17 goals all season, the second-best mark in the league. And the Wave have been struggling to score since returning from the National Women’s Soccer League’s international break. They’ve racked up just three goals in their last six matches.\n“We need to be sharp in everything that we do,” Wave coach Jonas Eidevall said. “We quickly need to change the focus from the last game to the new game.”\nSan Diego (8-5-6) is coming off a 3-0 loss to the Houston Dash, who capitalized on a turnover in the box, sharp through-ball passing, and a perfectly placed ball into the area that was finished clinically.\nSunday night’s result showed how teams on the outside of the playoff picture, like Houston, are starting to crank up the pressure in the final stretch of the season.\nGotham (7-6-6) certainly considers itself a contender. On Thursday, the club acquired former Wave star Jaedyn Shaw from the North Carolina Courage for an NWSL-record transfer fee of $1.25 million. It’s the second trade involving Shaw in eight months: San Diego traded the young star to the Courage in January for $300,000 in allocation money, $150,000 in intra-league transfer funds and international roster slots for both the 2025 and 2026 seasons.\n“I’m so excited to be a part of this incredible club and community,” Shaw said Thursday. “I’m looking forward to playing alongside world-class players and giving my all to help the team win another championship.”\nSince the midseason break, the Wave have gained just six points out of a possible 18. Yet they remain third in the NWSL standings with 30 points — something that feels like a small miracle.\nEidevall has made a point of addressing his team after every home match lately — especially since San Diego hasn’t won at Snapdragon since May 25 and is just 3-3-4 at home this season.\n“I think a massive takeaway from this game is reminding ourselves to kind of go back to our roots,” Wave forward Kyra Carusa said after Sunday’s loss. “Where we were in our thought process at the beginning of the season, understanding and believing internally who we are and our style of play and our belief in ourselves.”\nSaid Eidevall: “I have a quote that I keep reminding myself of and it’s about, ‘You can either have results or excuses.’ I don’t believe you can have both. So we need to focus on what we can control.”\nEidevall took responsibility for the latest loss, admitting he needs to do a better job of putting the team in position to succeed. The Wave are creating chances and getting the ball into the box, but they’ve struggled to finish.\nHouston’s three goals were the most San Diego had allowed in a game all year. On Monday, the Wave reviewed the film and discussed adjustments to get back in the win column.\n“We really want to just get back out there and show that wasn’t our best performance,” Wave midfielder Savannah McCaskill said. “That’s not who we want to be as a team going forward. It’s really just been about us and getting back into the rhythm and flow of who we are and who we want to be. …\n“At this point, there’s nothing we can do about the result anymore, but we can learn from those lessons and improve upon them for the games coming forward.”\nThe Wave have just seven matches remaining on their regular-season schedule. Five of them will come against playoff contenders, though — as McCaskill pointed out — it’s not really about other teams.\n“This is about us, and we control our destiny to continue on and end up in the playoff spots at the end of the season,” McCaskill said.\nSan Diego Wave (8-5-6) vs. NJ/NY Gotham FC (7-6-6)\nWhen: 7 p.m., today\nWhere: Snapdragon Stadium\nStreaming: Prime Video",
  "word_count": 669,
  "scraped_at": "2026-02-14T12:20:04.744932"
}