{
  "article_id": "f84ee97c060a",
  "url": "https://www.liverpoolfc.com/news/ceri-holland-we-want-make-our-special-fans-proud-sunday",
  "title": "Ceri Holland : We want to make our special fans proud on Sunday",
  "date": "20231012T134500Z",
  "domain": "liverpoolfc.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "InterviewCeri Holland: We want to make our special fans proud on Sunday\nCeri Holland believes the passion of the fantastic Liverpool FC Women supporters can inspire the team when they run out at Anfield against Everton Women on Sunday afternoon.\nAfter taking maximum points from their opening two games in the Barclays Women’s Super League with wins over Arsenal and Aston Villa, Matt Beard’s side get the chance to play at Anfield once again (kick-off 4.30pm BST).\nWales international Holland was part of the team that suffered a disappointing 3-0 loss to the Blues at the stadium last season, but she feels valuable lessons have been learned since that encounter.\n“It’s a very special feeling to get this opportunity to play at Anfield once again and it’s what you want to do as a Liverpool player,” the midfielder told Liverpoolfc.com.\n“Anfield is one of the special stadiums in Europe and I think we can generate a really good atmosphere again on Sunday evening against Everton in the derby.\n“We know this is a massive game for our fans and we want to put right what happened last season, but this is a different team, this is a different season and we need to forget about that now and be fully focused on this game.\n“The occasion last year maybe got the better of us but on the day we weren’t good enough. That’s what it came down to because our performance levels on the day weren’t good enough.\n“We’ve just got to forget that and play the game how we want to play. We are used to the big stadiums now, we’ve just played in front of 54,000 people at the Emirates. There’s no excuses from us now.”\nYou have to accept cookies in order to view this content on our site.\nWatch on YouTubeThe return derby clash at Goodison Park last season ended in a 1-1 draw, with Holland coming so close to grabbing what would have been a dramatic winner in stoppage time.\n“It would have been nice and a bit of a star moment as it was the 97th minute, so it would have been the winner,” said the 25-year-old.\n“We gave a much better account of ourselves that day, we were very disappointed not to get the three points and the disallowed goal stood out, so we will look to try to get the three points on Sunday.”\nHolland also touched on the special connection that exists between the players and the supporters, stressing it really does inspire the team whenever they take to the field.\n“Our fans are amazing,” she said. “Even away at the Emirates, you could hear our fans all the way through singing You’ll Never Walk Alone and singing every player’s song, and that made it really special.\n“For them to come up and down the country is really special and they are a special group of fans. We have a really special connection with them and we want to make them proud on Sunday.”\nYou have to accept cookies in order to view this content on our site.\nThe Reds will head out in front of the Kop this weekend in buoyant mood after their start to the WSL season, and Holland insists hard work has been key to their encouraging early form.\nShe said: “If you look at the first two games and the performances we have put in, we have played really good football at times, and last Sunday night against Aston Villa I thought it all came together really well with a fantastic performance over the 90 minutes.\n“It was a very special atmosphere at Prenton Park and we had a really good turnout, especially with it being live on Sky on a Sunday evening, and it was fantastic to see our fans again and we were really happy to put on a good show for them.”\nLFC Women boss Beard made seven new signings during the summer and all have made a seamless transition into their new surroundings.\nTwo of the recruits – Marie Höbinger and Natasha Flint – marked their home debuts with goals in the 2-0 win over Villa.\n“You look at Marie’s performance on Sunday night, she was absolutely brilliant,” Holland said.\n“Her goal, we see her do that in training every single day but I think in a game itself it’s a different ball game, so it was very special for her to get her home debut goal. And the same for Tash as well to get her first goal.\n“It’s so good to see because we’ve still got quality players in the forward line to come back like Leanne Kiernan, Shanice van de Sanden and Sophie Roman Haug, so it’s looking really positive.\n“All of the new signings have settled in really well and they have really become part of the family.\n“They really appreciate just how much of a family feel it is around here and it’s just a really nice environment that we have created, and I think you can see that on the pitch.\n“We are all playing for each other. There’s so much hard work all over the pitch and if you look at us defensively in our first two league games, everyone wants to put their bodies on the line for each other.\n“That’s the mindset we have got here. We’ve got a real good internal belief that we can do what we want this year with the squad that we’ve got.”\nBefore Sunday’s fixture, both teams will form a guard of honour for Natasha Dowie, who recently called time on her playing career.\nA legend with both Merseyside teams, Dowie will be continuing her association with the Reds as a club ambassador moving forward.\n“It’s going to be a very special day for her and she deserves it,” said Holland. “We still see Tats around the AXA Melwood Training Centre and around Kirkby, which is brilliant.\n“Tats is a fantastic person and she has done some fantastic things not just for this football club but for the women’s game. So for her to have that tribute on Sunday will be a special moment and fully deserved.”",
  "word_count": 1030,
  "scraped_at": "2026-02-14T12:40:55.933378"
}