{
  "article_id": "f87657c2dd3d",
  "url": "https://www.yahoo.com/news/bobblehead-feature-michigan-states-sparty-100917653.html",
  "title": "New bobblehead will feature Michigan State Sparty kissing the court",
  "date": "20250319T113000Z",
  "domain": "yahoo.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "New bobblehead will feature Michigan State's Sparty kissing the court\nEAST LANSING — A new licensed, limited edition bobblehead has Michigan State’s Sparty “kissing the court,” just in time for the Spartans' March Madness debut.\nThe National Bobblehead Hall of Fame and Museum is unveiling its latest bobblehead Wednesday, two days before the Spartans’ first 2025 tournament game against the Bryant Bulldogs of Bryant University in Rhode Island.\nThe bobbleheads now available will be individually numbered to 2,025 and will ship out in September. They will run for $40 and there's an $8 flat-rate shipping charge per order.\n“We’re excited to unveil the first bobblehead featuring Sparty kissing center court at the Breslin Center – a well-honored Michigan State tradition,” National Bobblehead Hall of Fame and Museum co-founder and CEO Phil Sklar said in a press release. “The 30-year tradition is one of the best in college sports and is special for the seniors who have worn the green and white.\n“This bobblehead will be a must-have for all fans of Michigan State!”\nAs a bobblehead, Sparty wears a signature outfit while positioned on a rectangular, hardwood-textured base, ready to kiss the Spartan logo at Breslin Center’s center court. The front and back of the base read “Michigan State” and “Spartans.”\nLegendary Spartan Shawn Respert began the kiss-the-court tradition at his final victorious 1995 home game against Wisconsin. After scoring 31 points, the senior kissed the Spartan “S” at center court to show gratitude to MSU, the coaching staff and his teammates.\nSpartan basketball players – both men and women – have continued the tradition that has spread across campus. Spartan hockey players kiss the ice and the school’s football players are known to huddle to kiss a helmet.\nEarlier this month, the National Bobblehead Hall of Fame and Museum released a licensed, limited edition Tom Izzo Win Counter Bobblehead to honor the MSU basketball coach’s 354th Big Ten Conference victory, which surpassed former Indiana coach Bob Knight for the most conference wins in league history.\nMore: Michigan State's Tom Izzo gets bobblehead honoring milestone win ahead of March Madness\nMore: Celebrate Tom Izzo's historic Big Ten wins mark with this awesome commemorative poster\nContact editor Susan Vela at svela@lsj.com or 248-873-7044. Follow her on Twitter @susanvela.\nThis article originally appeared on Lansing State Journal: New bobblehead will feature Michigan State's Sparty kissing the court",
  "word_count": 395,
  "scraped_at": "2026-02-14T14:15:20.732679"
}