{
  "article_id": "f878bca4c985",
  "url": "https://theathletic.com/4552019/2023/05/25/marc-skinner-manchester-united-wsl/",
  "title": "Marc Skinner : My Manchester United side not getting enough credit for WSL season",
  "date": "20230525T144500Z",
  "domain": "theathletic.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Marc Skinner thinks his Manchester United side have not received enough credit as they gear up for this weekend’s Women’s Super League finale with an outside chance of winning the title.\nUnited head to Liverpool on Saturday afternoon two points behind league leaders Chelsea, who will be crowned champions for a fourth successive time if they defeat relegation-threatened Reading.\nAdvertisement\nEven if United settle for second place, it would still be their highest WSL finish in a season where they reached the FA Cup final for the first time.\nJust five years after being reformed and four after their promotion to the top-flight, Skinner believes United gate-crashing the established WSL order of Chelsea, Manchester City and Arsenal should be more widely recognised by those in the game.\n“We’ve been exceptional this year and I don’t think we get enough credit, I really don’t,” the United boss said on Thursday.\n“There’s always a caveat as to why we’re successful. That is other teams’ injuries, other teams maybe not having the run they wanted and having Champions League, and I get that. It’s a factor we will have to look at but I just feel the players have been exceptional this year.\n“It’s not about where we finish in the league right now, that’s not the overriding factor. We’re growing up in front of the public eye whereas other teams have already done that. I feel this team, in a pressure cauldron, not only have performed well but won games of football.\n“We’re still in contention to win and if we don’t, we finish second, but to do that and disrupt the historical top-three, that is a big, big season regardless of what’s happened elsewhere.\n“I want people to give this team and the players the credit they deserve.”\nAoife Mannion, meanwhile, will miss out this weekend after tweaking her knee in training although Skinner is confident the Republic of Ireland defender will be fit for the World Cup.\n“We’re hoping so, that’s the plan,” said Skinner, who will also be unable to call upon Maria Thorisdottir because of the Norwegian’s foot injury.\n“There’s nothing structurally wrong. She won’t be in at the weekend but we’re hoping in a few weeks, she’ll be back.”\nGO DEEPER\n'I didn't think it would be possible in my time as a footballer to have female-specific boots'\n(Photo: Getty Images)",
  "word_count": 394,
  "scraped_at": "2026-02-14T12:21:49.260238"
}