{
  "article_id": "f8bbc51683c9",
  "url": "https://www.90min.com/england-2-1-republic-of-ireland-player-ratings-12-7-24",
  "title": "England 2 - 1 Republic of Ireland : Player ratings as Lionesses close in on Euro 2025 qualification",
  "date": "20240712T221500Z",
  "domain": "90min.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "England 2-1 Republic of Ireland: Player ratings as Lionesses close in on Euro 2025 qualification\n- England secured a crucial 2-1 win over the Republic of Ireland at Carrow Road on Friday night\n- The victory takes them one step closer to qualification for next summer's Euros in Switzerland\n- Goals from Alessia Russo and Georgia Stanway fired the Lionesses to victory\nEngland beat the Republic of Ireland 2-1 at Carrow Road on Friday night to move within touching distance of qualification for Euro 2025 in Switzerland.\nAlessia Russo fired the hosts in front early doors and that was followed up by a composed penalty finish from Georgia Stanway in the second half. It could and maybe should have been more for England before Julie-Ann Russell pulled one back for Ireland right at the death, but it was the result that mattered on the night.\nSweden succumbed to defeat against France in the other group game, putting Sarina Wiegman's side in pole position to qualify for next summer's Euros in Switzerland. A draw will be enough in Gothenburg on Tuesday night to secure a top-two finish.\nHow the game unfolded\nIt took less than five minutes for England to open the scoring in Norwich. Keira Walsh and Stanway played some intricate passes in the middle of the park to find Beth Mead, who slid an inch-perfect pass through to Russo, who made no mistake from close range.\nSomehow they failed to make it two goals ten minutes later as England won the ball back high and Lauren Hemp had a driven effort punched away by Courtney Brosnan. Jess Carter jumped on the loose ball, but her eventual shot was also saved.\nEngland started the second half as they did the first - with desire and intensity. Russo came agonisingly close to adding a second as she looked to meet a cute lofted ball into the box from Jess Park, but the Arsenal forward couldn't get a strong enough connection on the stretch.\nThey were handed a golden opportunity, however, when Hemp capitalised on a loose ball at the back for Ireland. Niamh Fahey was left with little choice but to make the foul and the referee immediately pointed to the spot.\nStanway slotted home from the spot with incredible composure, sending Brosnan the wrong way. It was a much-needed buffer for England as the visitors looked to score themselves just moments later, but Hampton was there to claim a dangerous cross in from Aoife Mannion.\nDespite late pressure from the Lionesses, it was Eileen Gleeson's side who clinched a goal right at the death. One of substitute Megan Campbell's long throws wasn't defended by England and Russell was there to slot it home.\nEngland player ratings (4-3-3)\nGK: Hannah Hampton - 7/10 - One nervy moment at the back in the first half as she was closed down on the ball and just about cleared the danger. Solid distribution and was otherwise a calming presence in the England goal.\nRB: Maya Le Tissier - 7/10 - Found the spaces well and put a handful of dangerous crosses into the box. Wasn't able to influence proceedings as much as she'd have liked as England often looked to penetrate through the middle of the pitch.\nCB: Leah Williamson - 7/10 - Led the backline well in the first half. Made some crucial interceptions to keep Ireland at bay when they looked to attack in the latter stages of the first 45. Subbed at half-time to be rested.\nCB: Alex Greenwood - 7/10 - The ever-present in defence throughout the game as her centre-back partner changed at the break. Defended well in one-v-one situations and put an end to some dangerous Ireland attacks. Didn't pick up Russell on her shoulder for Ireland's goal.\nLB: Jess Carter - 7/10 - Had an early effort saved by Brosnan. Little bit loose in possession at times but recovered well in those situations. Subbed at half-time to allow Charles some game time.\nCM: Keira Walsh - 7/10 - Some outrageous line-breaking passes through the middle of the pitch to move England further forward. Incredible composure, especially in tight spaces.\nCM: Georgia Stanway - 8/10 - Unrelenting energy in the early exchanges and won the ball back in some dangerous areas to set England on the attack. Clinical from the penalty spot to put England two goals to the good.\nCM: Jess Park - 8/10 - Missed an obvious pass to Hemp early doors as England looked to extend their lead. Her driving runs in midfield caused Ireland problems as she carved out a number of opportunities.\nRW: Lauren Hemp - 7/10 - Unlucky not to score in the opening 15 minutes as her well-taken effort was tipped away by Brosnan. Did well to get ahead of Fahey and win the penalty for England in the second half.\nST: Alessia Russo - 8/10 - Applied the finishing touch to a fantastic England move inside the opening few minutes to put them ahead. A number of opportunities to score another, but couldn't quite get the finish right. Plenty of promising signs and was a constant nuisance for the Ireland back line.\nLW: Beth Mead - 7/10 - Fantastic ball into the path of Russo for the opening goal. Very nearly got on the scoresheet herself in the first half but couldn't dance her way round the green shirts in the box to get a clear shot away.\nSubstitutes\nSUB: Millie Bright (45' for Williamson) - 7/10 - Used her pace well to shut down Ireland's attempted counter attacks. Dominant in the air and won most of her aerial duels.\nSUB: Niamh Charles (45' for Carter) - 7/10 - Some much-needed game time to increase match fitness after injury. Was smart when she pushed forward and got some much-needed minutes in the legs.\nSUB: Chloe Kelly (60' for Mead) - 7/10\nSUB: Jess Naz (70' for Russo) - 7/10\nSUB: Aggie Beever-Jones (88' for Hemp) - N/A\nSubs not used: Mary Earps (GK), Khiara Keating (GK), Lucy Bronze, Ella Toone, Grace Clinton, Esme Morgan, Millie Turner.\nManager\nSarina Wiegman - 7/10 - Some much-needed rotation to the team after an intense season and start to the summer internationals. Timed her substitutions well to keep momentum in England's favour and they controlled the game for much of the 90 minutes.",
  "word_count": 1059,
  "scraped_at": "2026-02-14T13:05:09.652561"
}