{
  "article_id": "f8d4fa3d5aac",
  "url": "https://www.dailymail.co.uk/femail/article-13507399/Rachel-Reeves-spot-woman-soon-Britains-female-chancellor-tells-Mail-bank-account-NEVER-goes-overdrawn-shes-not-sure-shes-kissed-Tory.html",
  "title": "Rachel Reeves on the spot : The woman who could soon be Britain first female chancellor tells the Mail how her bank account NEVER goes overdrawn - but she not sure if she ever kissed a Tory … ",
  "date": "20240608T021500Z",
  "domain": "dailymail.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Rachel Reeves on the spot: The woman who could soon be Britain's first female chancellor tells the Mail how her bank account NEVER goes overdrawn - but she's not sure if she's ever kissed a Tory…\nRachel Reeves, who will be the first ever female Chancellor of the Exchequer if Labour win the election, has the crisp authority of a headteacher.\nAnd then she laughs — a cartoon, ‘Ha!’ followed by a rich contralto chuckle — and any sense that she is forbidding or humourless is dissipated.\nYou get this a lot with Reeves, 45. A short lecture on fiscal responsibility leavened with a funny anecdote about her kids.\nShe is on the campaign trail and earlier this week was up at dawn to fly from London to Edinburgh for a dizzying round of rallies, meet-and-greets and interviews, before bed at 12am. ‘I’m like Cinderella,’ she says. ‘I have a midnight curfew.’\nShe misses her husband Nick Joicey, 54, a senior civil servant, and their two children — a daughter aged 11 and an eight-year-old son — but says the kids have more licence when their dad’s in charge.\nIn four weeks she could be our first female Chancellor - so we put Rachel Reeves to the test...\n‘I’m probably the strict one. Nick lets them stay up later. He’s brilliant with them and is keeping the show on the road while I’m running round the country.’\nLater, she tells me her son’s favourite joke: ‘Why was the ice cream sad? Because his friend was a wafer too long! Geddit? That’s what my son always says. It’s from one of those kids’ joke books and he thinks it’s hilarious.’\nHer constituency, Leeds West, is a 170-mile schlep from the family’s London home. Her children, who are established in local state schools — no, they will never go private — have friends nearby and only make the journey north in school holidays. She does not involve them in her political life.\n‘They have never delivered a leaflet. They’ve never come door knocking with me.’\nWhat if they decide to become Tories? ‘My little boy says: “I will always be Labour” but he has no idea what that means. I’ve always said to them: “You’ll make a decision one day about what you think.”’\nHer daughter, meanwhile, is unimpressed by her role. ‘She was watching Newsround at school one day and there was a clip about politics and I was in it. A little boy in her class lives on our street. She gave him a look that said: “If you say that’s my mum, I’m going to kill you.”’\nReeves insists there is no rivalry between her and Labour leader Keir Starmer, who made her his Shadow Chancellor in 2021\nCard-carrying Labour stars, Angela Rayner and Rachel\nThere’s that chortle again. ‘She doesn’t want to be the one whose mum is on TV. She’s indifferent to what I’m doing. She keeps me grounded.\n‘She said, “If you become Chancellor, lots of people will not like you.” I said, “Why?” And she said, “Because you will have to make very difficult decisions.” I’m very well aware of the scale of the challenge that is ahead of me.’\nSome of these difficult decisions were foreshadowed this week with suggestions that she is planning ‘ten to 12’ tax hikes — including capital gains tax — to increase spending on public services.\nPredictably, she refutes this: ‘We have set out fully costed, fully funded plans with very specific tax loopholes we would close. Nothing in our plans requires any new taxes to be introduced.’\nPensions, she says, are included in this pledge.\nReeves read politics, philosophy and economics at New College, Oxford, then graduated with an MSc in economics from the London School of Economics, after which her first job was a six-year stint as an economist with the Bank of England.\nShe then moved to Leeds to work for the banking and insurance company HBOS; qualifications which, she believes, equip her well to look after the nation’s finances. Elected an MP in the 2010 election, she came to the fore when Sir\nKeir Starmer became leader in 2020. In 2021, he appointed her Shadow Chancellor.\nRelations between prime ministers and their Chancellors can be fractious: Gordon Brown, when at No 11 Downing Street, always coveted Tony Blair’s job while tension between the then PM Boris Johnson and Rishi Sunak crackled.\nStrikingly, both Brown and Sunak went on to get their boss’s job, but Reeves insists there is no rivalry between her and Starmer. They text each other most days while out campaigning.\n‘We’ve both got young children so one of the things we talk about is the balance of work and family life,’ she says. ‘We both spend a lot of time persuading our children they don’t want a new pet. My daughter wanted a tortoise. His daughter wanted a dog. We compare stories on how we’re fighting these demands.’\nThey talk about the stresses of being both a parent and a politician. She has help with childcare and her parents pitch in, but she carves out time for jaunts with the kids, too.\n‘The children love trips to the park, going to the seaside, playing sandcastles, paddling.’\nSoft play? ‘Oh God, no! I’d put that in my Room 101. So unhygienic . . . and loud! I prefer the playground. It’s better value than soft play, which is a rip-off.’\nShe and Starmer have something else in common outside politics: both play the flute.\n‘Yes, but Keir’s a lot better than me. I got Grade 8 and he got a youth scholarship to the Guildhall School of Music.’ Does it irk you that he’s better than you? She is fiercely competitive.\n‘No!’ she insists. She continues: ‘He’s obsessed with football. He’s always going on about Arsenal and I have absolutely no interest in football at all.\n‘That’s the only time I roll my eyes at him. But I admit when I’m listening to the news now I always hear the Arsenal results. I can’t stop myself. I think: “Keir will be happy / disappointed.”’ But surely, despite their easy camaraderie, Reeves’ ambition is to be prime minister? ‘No, that’s one of the reasons Keir and I have a really good partnership.’\nWhen I press her, she insists: ‘Honestly, I’ve wanted to be Chancellor ever since I went into politics. I just think: I can do this job well, because of my background as an economist and working in financial services. I’m really qualified for it.\nHas she ever kissed a Tory? ‘Ha! I’m not sure. I went round voter ID-ing people when I was at university,’ she laughs\n‘Keir said when he appointed me: “People have to trust you with their money” and I was struck by that.’\nCan we trust you with our pensions? Gordon Brown provoked fury when he raised the State pension by just 75p a week in 2000.\n‘We are committed to the triple lock [meaning pensioners receive a sum that keeps up with rising prices and wages],’ says Reeves. ‘It is really important that people who have worked hard all their lives can be confident about what they are going to get in retirement.’\nShe arrives at our lunchtime meeting place — an unpretentious cafe in Musselburgh, east of the Scottish capital, inconspicuously. Our chat is punctuated by the gasp of coffee steamers and clattering plates. Her falafel wrap comes with a side order of chips. She drinks Diet Coke.\nHer clothes are High Street: a pale blue trouser suit from Next. ‘Last year’s,’ she says, rummaging to show me the label. ‘You don’t have to spend loads to look smart.’\nHer nails are varnished Labour red: ‘I did get these done for the campaign. I like red. It’s traditional and they look smart, but I don’t feel I always have to wear red. I wore a blue suit for my conference speech.’\nIndeed, some Corbynites considered Reeves too blue for their liking, calling her a ‘Red Tory’; even telling her to ‘eff off and join the Tories’.\nHow did she feel? ‘Really angry,’ she says. ‘I thought: I’ve been in the Labour Party a lot longer than any of you lot here.’\nWhat did she think when Starmer’s deputy Angela Rayner called Tories ‘scum’? ‘I wouldn’t have used that language. Angela has since apologised for it. I would like a politics that is more respectful, where people focus on issues rather than individuals.’\nRachel in 1987 - a small child with big ambitions\nMuch has been made of Reeves’ pledge ‘not to play fast and loose’ with public finances. She went further at the party conference last year, promising to exert ‘iron discipline’ in controlling spending. It was so redolent of Margaret Thatcher — the Iron Lady — that I assume the reference was intentional. ‘I leave other people to decide that,’ she smiles, adding, ‘I hate waste.’\nReeves says she has good friends who are Conservatives, citing Seema Kennedy, former Tory MP for South Ribble, Lancashire. Kennedy is no longer an MP. ‘But we text each other every week and go out to dinner together. I went to her wedding.’\nHas she ever kissed a Tory?\n‘Ha! I’m not sure I went round voter ID-ing people when I was at university,’ she laughs.\nShe was infamously called ‘boring snoring’ when Ian Katz, then editor of BBC’s Newsnight, inadvertently posted a private message about her to his 26,000 Twitter followers. What would she like to say to him now?\n‘I’m doing quite well!’\nActually, while deadly serious about her job, she is good company: authoritative, warm, chatty. Born in the borough of Lewisham, her accent is unmistakably South-East London.\nShe has a healthy capacity for self-mockery: before we meet she addressed 500 employees at the Royal Bank of Scotland’s HQ. Her arrival there was kept hush-hush — as everything is on this campaign trail — so her audience had no idea who they had come to hear.\n‘They dutifully turned up to see this “special guest” probably thinking I’d be a Team GB star or Taylor Swift. I hope they weren’t too disappointed.’\nToday, her self-confidence has been honed by years of denigration; for not being privately educated — she and her sister Ellie, also a Labour MP, attended the comprehensive Cator Park School for Girls, Beckenham — and for having the temerity to be a girl in a male-dominated world.\nHer parents Sally and Graham were both teachers who separated when she was seven and subsequently divorced. ‘They had joint custody of me and Ellie. They never went to court. It was never acrimonious. They were just put me and Ellie first.’\nAfter the split, Reeves recalls there was careful budgeting. ‘My mum would keep all her receipts and bank statements and tick everything off to make sure it all added up. We were not poor, but after my parents split up they had to buy their own homes. There was less money to go around and I was conscious of that.’\nShe was, she freely admits, a bit of a swot. Always alert to opportunities to prove herself, she recalls asking to take SATs, even though her school had boycotted the tests. ‘I wanted to know how good I’d be at them so I asked my teacher if I could do them at lunchtime. I did very well!’\nMeanwhile, her primary school head, a keen chess player, taught all his pupils to play. ‘Dad got me a chess set so we could play at home. He never let me win. I remember the first time I beat him. I was pleased with myself.’\nBy the age of 14 she was British Girls’ Chess Champion but, in a world where most of her competitors were private school boys, the disparagement continued.\nConformist rather than anarchic, Reeves once defended her ‘boring snoring’ image by saying no one would want the person in charge of the nation’s finances to be turning cartwheels. What is the wildest thing she’s ever done?\n‘I wasn’t particularly rebellious. I worked hard. I liked to win and do well,’ she says, predictably. ‘I used to go to parties in the college bar or common room. I loved Destiny’s Child and then Beyonce. I still do!’\nReeves has always worked in a predominantly male milieu — the City, Westminster — and I ask if she has experienced sexism.\nShe talks about the ‘blokey’ culture in banking: ‘One division went out to a lap-dancing club because there “weren’t any women” on their team. You don’t say? They weren’t nasty, just thoughtless. What woman would be comfortable in their team?’\nShe writes about the masculinity of Parliament in her 2019 book Women Of Westminster and records how Labour MP Dawn Butler, who is of African-Caribbean heritage, was told by one Conservative MP that it was inappropriate for a cleaner to be in the lift with them. Reeves herself was asked by a male SNP MP, when she first arrived in Westminster, whom she worked for. ‘The assumption was that I must be a researcher.’\nThese days she is not troubled. We’re back to that aura of brisk capability: no male MP, I suspect, would dare to demean her.\nAt home, she is, reassuringly, in charge of the joint bank account and says: ‘We have never gone overdrawn.’\nWhile her husband does ‘other jobs around the house: bins, dishwasher, repairs’, like Starmer she enjoys cooking: Sunday roasts, crumbles, Middle Eastern food.\n‘I do a very nice recipe with minced lamb and aubergine.’\nShe tries to keep Sundays sacrosanct. ‘Even last week we managed to have family lunch together.’\nOn Saturday evenings, come September, the family will be glued to Strictly. ‘The kids love it, so we all have dinner then watch it.’\nIt’s a relentlessly demanding job, revved up to full throttle since the election was called, but she is bright-eyed, well-groomed, energetic. She swims, runs occasionally: ‘It’s really important in this job to stay fit and healthy. The hours are very demanding. You eat when you can.’\nShe has only managed half her, admittedly huge, falafel wrap so to underline her abhorrence of waste she asks for the remainder to be boxed up so she can take it with her.\nBefore we say goodbye, she tells me: ‘My mum has always read the Mail. But if you’re going to write that put it at the end so I’ll know if she’s read the whole article. Haha!’\nShe leaves on a gust of laughter.",
  "word_count": 2427,
  "scraped_at": "2026-02-14T14:13:08.321604"
}