{
  "article_id": "f915ba0cd24b",
  "url": "https://www.abc15.com/news/local-news/how-are-wnba-players-treated-and-compensated-compared-to-nba-players",
  "title": "How are WNBA players treated and compensated compared to NBA players ? ",
  "date": "20230912T141500Z",
  "domain": "abc15.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "You don't have to be a sports fan to know there are many differences in the ways female athletes are treated and compensated compared to male athletes.\nLook at the salaries alone -- according to the website Statista.com, the average WNBA salary was about $103,000 for this past season, but for the NBA, it was about $9.4 million.\nAnd the numbers are even more shocking when you look at top-tier players. According to Spotrac, Phoenix Mercury's Diana Taurasi makes about $235,000 a year compared to Steph Curry of the Golden State Warriors who makes about $52 million for this upcoming season.\nThe huge discrepancy between salaries for male athletes and female athletes is something we decided to dive deeper into after Brittney Griner held her first news conference since being freed from Russia.\n\"I'll say this...the whole reason a lot of us go over is the pay gap,\" explained Griner back in April. \"A lot of us go over there to make an income, to support our families, to support ourselves...and it's a shame that we have to leave our families for holidays. I mean you're missing everything being away. And at the same time, as much as I would love to pay my light bill for the love of the game, I can't, you know?\"\nIn a conversation with ABC15's Nick Ciletti, Arizona State University Professor Victoria Jackson agreed that in many ways, this battle is emblematic of what's been happening in society.\n\"...It goes back to structures of equity,\" Jackson explained.\nAnd Jackson explains the structures need major improvement, not just in the WNBA, but across female sports as a whole.\nJackson is perhaps uniquely qualified to speak on this — she's a former NCAA champion track star and sports historian.\nJackson says the matter goes way beyond just dollars and cents.\n\"It's not just about, 'let's throw more money at the women' - let's start building these structures of equity and then those wages rise as a result of that.\"\nJackson says that comes down to having equal training facilities, equal travel accommodations, equal revenue sharing, and equal publicity and promotion.\n\"It's not a losing enterprise. If you invest in women, you're going to see payoff. Much like what we have seen in the MLS. The MLS, Major League Soccer, has been expanding over the past decade and again people on betting on men's soccer in the US like they never have before. We need to see people betting on women's sports and women's basketball.\"\nBut there's another harsh reality: revenue. According to Bloomberg, the WNBA will bring in roughly $200 million in both team and league revenue, compared to the NBA's $10 billion - but Jackson says the NBA has gotten a 50-year head start.\n\"The revenue the WNBA is bringing in is comparable to what the NBA was bringing in the early 70s....This sport is on the up and up let's pour money into it because we know we are going to have a lot of returns on that investment. And we are not seeing that in the case of women's sports.\"\n\"What kind of message does that send to our female athletes?\" Ciletti asked.\n\"It's really hard to be inundated with messaging that you are not a real athlete,\" Jackson said.\nThe current collective bargaining agreement between the WNBA and the player's association was signed back in 2020 and will expire in 2027.\nAfter it was signed, the WNBA issued a news release, saying in part:\n\"Foremost among the deal terms is a 53 percent increase in total cash compensation, consisting of base salary, additional performance bonuses, prize pools for newly created in-season competitions, and league and team marketing deals. Under the new CBA, the league’s top players will be able to earn cash compensation in excess of $500,000, representing a more than tripling of the maximum compensation under the prior deal. Other top players will have an opportunity to earn between $200,000 and $300,000. And for the first time in WNBA history, the average cash compensation for players will exceed six figures, averaging nearly $130,000, resulting in an increase for all players from rookies to veterans.\"\nCritics argue base salaries still need to rise and the WNBA should switch to a revenue-sharing model that's similar to what the NBA currently uses.\nTo read that full release, click here.",
  "word_count": 725,
  "scraped_at": "2026-02-14T12:15:19.156167"
}