{
  "article_id": "f94c680f4ae4",
  "url": "https://theathletic.com/4516679/2023/05/15/ornstein-gundogan-leao-pulisic-liverpool-loans-berrada/",
  "title": "Ornstein : No decision on Gundogan future , Chelsea bid structure for Leao , Liverpool loans manager leaving",
  "date": "20230515T071500Z",
  "domain": "theathletic.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Ilkay Gundogan gave a potentially title-defining display as Manchester City won 3-0 at Everton, the captain scoring two goals and assisting the other as his side took a huge step towards winning the English top flight for a third year running.\nThe 32-year-old, who hopes to lead City to a Premier League, FA Cup and Champions League treble over the next month, has hit fine form at the perfect moment.\nAdvertisement\nIt is also well-timed for Gundogan personally, given his contract expires at the end of this season, and there is no shortage of interest from clubs looking to secure the Germany international midfielder as a free agent.\nHe has been heavily linked with a move to Barcelona, and the new La Liga champions are among a number of enticing options for Gundogan. But a decision on where he will continue his career is yet to be reached and no agreements have been struck to determine his next destination.\nThe situation remains open and that includes the prospect of Gundogan prolonging his seven-year stay at the Etihad Stadium if a compromise can be found.\nIt has been widely reported that there is a discrepancy between the two parties over the length of a fresh deal, although a late twist that results in City keeping hold of Gundogan is not beyond the realms of possibility.\nAfter the Gundogan-inspired events of Goodison Park, Arsenal were handsomely beaten by Brighton & Hove Albion at the Emirates Stadium later in the day, and that put Pep Guardiola’s men four points clear with a game in hand.\nGundogan’s 300th appearance for City could not have gone better and he is said to be fully focused on finishing the campaign as strongly as he can, despite the speculation over his future and when it might be settled.\nLiverpool loans manager leaving in search of a fresh challenge\nLiverpool are preparing for significant behind-the-scenes changes this summer, the most notable of which will see sporting director Julian Ward step down while talks continue with the German executive Jorg Schmadtke to replace him.\nWard’s unexpected departure was confirmed in November, and it has now emerged he will be followed out of Anfield by David Woodfine, the club’s director of loan management.\nWoodfine, who arrived from West Ham United in 2014 and built a strong reputation across three different positions, has informed Liverpool about his decision to exit in search of a fresh challenge.\nAdvertisement\nHe was brought in by Ward’s predecessor Michael Edwards, the pair having worked together at Portsmouth. They all had important roles in a tight-knit group at Liverpool that included head of recruitment Dave Fallows, chief scout Barry Hunter and director of research Dr Ian Graham.\nEdwards left Liverpool last year and Graham is doing the same at the end of this season, when he will be succeeded by Will Spearman. Woodfine’s initial post on Merseyside was as scouting and recruitment coordinator. Three years on, he became head of football projects and scouting operations, then got a promotion to his latest position in December 2020. He is a popular figure and goes with Liverpool’s best wishes.\nGO DEEPER\nMeet Jorg Schmadtke - the 'miffed grouch' Liverpool want as their sporting director\nWoodfine has overseen several successful loans — such as Neco Williams’ move to Fulham in January 2022 that led to a £17million transfer to Nottingham Forest in the summer — and is credited for helping create strong pathways for players.\nLiverpool manager Jurgen Klopp recently hailed Conor Bradley amid a superb stint with Bolton Wanderers in League One and said he was looking forward to working with the 19-year-old right-back ahead of his return to Anfield for the 2023-24 campaign. Tyler Morton, who spent this season on loan at Blackburn Rovers of the Championship, is another to have excelled.\nWoodfine has also contributed at a senior level, assisting in the deal for Luis Diaz in January last year as Liverpool saw off competition from Tottenham Hotspur for his signature. He flew to Argentina with then-club doctor Jim Moxon after Colombia let the player undergo a medical while on international duty.\nCity chief Berrada to stay despite Premier League and NFL approaches\nManchester City face a massive week as they continue their bid to become only the second English club to complete a treble. Such a feat — previously completed only by neighbours and bitter rivals Manchester United in 1999 — would take their success under Abu Dhabi ownership to a new level. And despite the scrutiny and controversy surrounding the tenure, City’s progress has become the envy of many across the industry.\nAdvertisement\nCity Football Group (CFG), which owns the reigning Premier League champions, has created a multi-club model that is admired elsewhere and has seen other sporting organisations turn to some of those involved to help build their own projects.\nScott Munn, previously City Football Group China chief executive, will be Tottenham Hotspur’s chief football officer while Chelsea hired former CFG executive Tom Glick as president of business. Elsewhere, Jason Wilcox and Joe Shields took up senior roles at Southampton after their time with CFG, before Shields soon moved on to Chelsea. Several former City employees have also moved to Newcastle United.\nThe pursuit of those with CFG experience is now going to the core of the operation, with Omar Berrada, chief football operations officer, being targeted.\nBerrada joined City from Spanish giants Barcelona in 2011 and was commercial director for City Football Marketing before becoming the club’s chief operating officer. He works closely with City director of football Txiki Begiristain on areas including transfers and contracts, and was involved in the signing of striker Erling Haaland, who scored his 52nd goal of the season on Sunday, last summer.\nMultiple industry sources in the US and UK, speaking on condition of anonymity to protect their positions, told The Athletic that Berrada has been approached for chief executive roles at a Premier League club, MLS teams and a major NFL franchise.\nAll of those moves have been rejected in a clear indication that Berrada is committed to staying at City, but it underlines the regard in which CFG and its employees are held.\nChelsea offered Pulisic and Ziyech when trying for Leao deal\nOn the morning of the first leg of last week’s Champions League semi-final against neighbours Inter, Rafael Leao committed to sign a new long-term contract with AC Milan.\nAdvertisement\nLeao, the reigning Serie A MVP, was about to enter the final year of his existing deal at San Siro — an opportunity other members of Europe’s elite were monitoring. Chelsea made an effort to lure him away last summer on the back of his instrumental role in Milan’s first league title since 2011, writes James Horncastle.\nTodd Boehly and Behdad Eghbali were in the midst of their first transfer window at Chelsea, and presented Milan with several deal structures designed to tempt them into allowing Leao to leave. Chelsea valued the player at €100million (£87m; $108m) and wished to include a player in exchange to make that price. The USMNT international Christian Pulisic was offered to Milan, as was Hakim Ziyech.\nOver the course of negotiations, Chelsea’s initial valuation of both players came down to tempt Milan to take one of them in a swap. But the Italians were not convinced. Chelsea showed interest too late in the transfer window and were pointed to the €150million buyout clause in the player’s contract at the time.\nThe January signing of Mykhailo Mudryk from Shakhtar Donetsk did not end Chelsea’s pursuit of Leao.\nAfter the winter window closed, Chelsea’s executives sought a status update and wanted to know if he was renewing his contract. (Chelsea deny this enquiry happened.) It is understood Chelsea considered Leao for the striker position.\nThe London club will now have to look elsewhere — unless, that is, they are prepared to meet the new €175million buyout in Leao’s new five-year contract, as reported by The Athletic last week.\nFamilies of England’s World Cup players will get £10,000 to support travel costs\nEach England player who makes the squad for this year’s Women’s World Cup, hosted by Australia and New Zealand, will receive a £10,000 travel fund, reports Charlotte Harpur.\nAdvertisement\nEngland made the most of their home advantage last summer when they defeated Germany 2-1 in the European Championship final in front of a record crowd of 87,192 at Wembley Stadium.\nThe team will now travel to Australia, 9,442 miles (15,195km) away, for the next major tournament, and to assist players’ families and friends with costs, the Football Association (FA) has given each squad member a travel allowance. Current prices for a return flight from the UK to Sydney, departing in July, are over £1,500.\nThe FA considers time spent with family and friends a performance-enhancing factor that helps the players stay fresh. Moments to interact with their loved ones at suitable times within the team’s schedule will be planned during the tournament.\nSarina Wiegman’s side will travel between the cities of Brisbane, Sydney and Adelaide for their group games against Haiti, Denmark and China respectively. They will return to Sydney should they reach the knockout phase.\nWiegman confirmed in December the team would fly business class, a notable change from recent years when, under then-manager Phil Neville, England’s women flew in premium economy to the United States to play in the 2020 SheBelieves Cup.\nThe World Cup starts on July 20 and runs until the final a month later.\nBrighton will let Sky use bodycam footage from coaching staff in warm-up\nBrighton are pioneering increased access for Premier League live TV rights-holders to take viewers closer to the action, writes Andy Naylor.\nDuring Sky Sports’ coverage of Brighton’s recent 1-0 win over Manchester United at the Amex Stadium, midfielder Moises Caicedo wore a body camera for the pre-game handshakes and the post-match celebrations in the home dressing room.\nPOV: You're in the line-up for Brighton against Manchester United 🎥 pic.twitter.com/4T96diwcPK\n— Sky Sports Premier League (@SkySportsPL) May 4, 2023\nAnd Sky was also given camera access — without sound — for a clip of head coach Roberto De Zerbi’s instructions to his players at half-time.\nAdvertisement\nThe next step will be a member of De Zerbi’s coaching staff wearing a body camera during the pre-match warm-up, complete with sound (that will be filtered, to avoid giving away any tactical insight to the opposition).\nMedia access to changing rooms has been commonplace in North America’s MLS for many years but the move towards a more open approach in the UK doesn’t have universal approval. Some Premier League clubs with the biggest global reach are sceptical, preferring that such behind-the-scenes content is reserved for their own channels.\nFrom next season, Brighton will become the third club — after Manchester City and Tottenham — to have a “Tunnel Club”, giving their members sight of the players through one-way glass while fine dining. This will cost £8,950 per season, plus a £2,500 founding member fee.\nFormer City masseur set to be reunited with Kompany at Burnley\nPromoted Burnley are set to appoint former Manchester City masseur Mark Sertori to a senior role in their performance department.\nSertori, who has also worked with the England national team, left the Premier League leaders in recent months and has a close relationship with Burnley manager Vincent Kompany, a former City captain and club icon.\nBurnley sealed an immediate return to the Premier League in their first season under Kompany, guaranteeing promotion from the Championship in early April with seven games to spare.\nMeanwhile, with a big gap between the Championship ending a week ago and the 2023-24 Premier League beginning on the weekend of August 12-13, Kompany has decided to hold a “pre” pre-season training camp for his players in June, writes Andy Jones.\nAfter four weeks off to recover from the gruelling Championship campaign, they will head to a 10-day training camp in Portugal next month. The players will then have a further 10 days’ holiday ahead of the start of pre-season proper.\nAdvertisement\nThe trip is expected to overlap with the June international break, so those with national team commitments are not expected to be in the travelling party. Burnley are expected to return to Portugal during their actual pre-season, too — as they did last summer — and their search to find an opponent to play at Turf Moor in a friendly in the final weeks of pre-season continues.\nMartin meeting Swansea owners in US to discuss his future\nRussell Martin is due to fly to the United States this week for face-to-face talks with Swansea City’s majority owners that should bring some clarity on both his future and the Championship club’s plans for next season, reports Stuart James.\nThe 37-year-old has 12 months remaining on his contract and has been linked with several clubs in recent weeks, including Southampton, who are set to move towards a more possession-based style of football following their now-confirmed relegation.\nMartin is also likely to be among the names under consideration to manage Leicester City, should they follow Southampton down into the Championship.\nIt is understood that Swansea have not made any formal move to offer Martin an extended deal and it is unclear whether that will change during the meeting in Washington, D.C.\nAppointed Swansea manager in the summer of 2021, Martin has said that he is settled in south Wales and would be keen to extend his stay with the club, provided he is given assurances about the level of backing he will receive next season.\nIn January, Swansea lined up several targets but failed to make a single signing, prompting a public apology to the supporters from Jason Levien, who bought a controlling stake in the club in 2016 along with Steve Kaplan.\nAlthough Swansea endured a difficult couple of months after the winter window closed, they ended the season strongly, winning seven of their last nine matches to finish only three points outside the play-offs.\nAdvertisement\nSheffield United and Wrexham avoid Round Two in Las Vegas\nWrexham players celebrated promotion in style at the Bellagio resort in Las Vegas, courtesy of co-owners Rob McElhenney and Ryan Reynolds. But the vibe could have been rather different had the National League champions flown out a few days later, writes Richard Sutcliffe, with this season’s FA Cup foes Sheffield United’s own promotion knees-up taking place in the same US city.\nThe two clubs clashed after a fourth-round replay in February that was won 3-1 by Paul Heckingbottom’s Championship side. United captain Billy Sharp accused the National League side of “eyeing up Spurs” after the draw had paired the Premier League side with the winners of that February 7 replay at Bramall Lane, saying they had also “disrespected” his team-mates.\nPlayers from both sides also had to be separated in the tunnel area amid an extraordinary row that also involved both sides copying Tottenham forward Son Heung-min’s “camera” goal celebration.\nDespite both Wrexham and United heading to Vegas for their promotion celebrations, with the National League season finishing the weekend before the Championship, any possible tension was averted, with United only flying out after last Thursday’s open-top bus parade around Sheffield.\nBy then, Wrexham’s hungover squad had already returned from their trip of a lifetime, with Ben Tozer, Paul Mullin and company enjoying lavish pool parties and VIP treatment at a host of venues, including the Hakkasan and Omnia nightclubs.\nAs a reward for finishing top of the fifth tier, the Wrexham players were treated to dinner next to the Fountains of Bellagio by actor McElhenney.\nUnited are still in Vegas, the third time the Yorkshire club’s players have visited in seven years after also winning promotion in 2017 (from League One) and 2019 (from the Championship). Not all of the squad travelled, a few are missing due to family commitments.\nAdvertisement\nFoley plans Bournemouth documentary: David versus Goliaths\nThe sports documentary boom is showing no signs of abating with new fly-on-the-wall looks at subjects as diverse as Newcastle United and the Tour De France coming to a device near you soon, writes Matt Slater.\nBournemouth are the latest sports team or competition to join the brigade, which should not come as a surprise to fans of new owner Bill Foley’s first sports investment, the Vegas Golden Knights, as they would probably be NHL ice-hockey champions every season if the trophy was handed out solely for razzamatazz.\nA group of American investors led by Foley bought Bournemouth last December and they have already improved the matchday experience, increased commercial income and resumed construction at the club’s new training ground — not to forget the small matter of retaining Premier League status for next season.\nBut when you play in the league’s smallest stadium, the challenges will keep coming, and that is the pitch for Bournemouth’s documentary: David versus Goliaths.\nIn an exclusive interview with The Athletic, Foley revealed that the club’s production partner, NFL Films, shot a “sizzle reel” during his visit to the south coast last month, with Bournemouth’s 4-1 home win over Leeds United providing the backdrop.\nThe idea is to create a multi-year series, like Welcome To Wrexham, and while he did not feature in the promo, Bournemouth co-owner and Hollywood leading man Michael B Jordan can be expected to add some Ryan Reynolds-style stardust when required.\nSo, even if they remain in the dreaded last-game slot on the BBC’s Saturday night highlights show Match Of The Day, requiring fans to stay up until around midnight to see them, there is a chance Bournemouth will be flying high in the streaming charts.\nSouthampton’s former head of player insights to team up with Ross Wilson at Forest\nNottingham Forest’s fortunes on the pitch have taken a positive turn in recent weeks, losing just once in their last four games.\nAdvertisement\nWins over Brighton & Hove Albion and Southampton and a draw with Chelsea have seen them move up to 16th, three points clear of the relegation zone with two matches to play.\nOff the pitch, Ross Wilson, their recently appointed chief football officer, has already started making changes behind the scenes, and Forest are focused on building a strong infrastructure under his leadership across all areas of the club.\nTom Stockwell, who recently resigned from his role as Southampton’s head of player insights — and who formed a close bond with Wilson during their time together on the south coast — is set to join Forest in the coming weeks, reports Dan Sheldon.\nStockwell is highly regarded, having spent over a decade at St Mary’s, and was an important figure there in scouting and recruitment, where he was tasked with adding an analytical and data-driven edge to that department.\n(Photos: Getty Images)",
  "word_count": 3129,
  "scraped_at": "2026-02-14T12:55:29.357667"
}