{
  "article_id": "f95a5069d15f",
  "url": "https://www.rnz.co.nz/national/programmes/mediawatch/audio/2018903035/our-world-cup-runneth-over-and-out-what-next",
  "title": "Our World Cup runneth over - and out . What next ? ",
  "date": "20230820T054500Z",
  "domain": "rnz.co.nz",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "The Women's World Cup 2023 attracted record crowds in the stands and on TV - both here and in Australia. It also delivered drama and off-pitch stories that livened up standard sports coverage. But will all that change the way the media cover sport? Mediawatch asks two journalists with an eye on the media on both sides of the Tasman.\nThe Football Ferns peaked in the World Cup in game one on day one - scoring their one and only goal of the tournament to defeat Norway.\nEven though it was all downhill after that - and then out - after just three group games, Kiwis bought into the Cup in a big way.\nParts of the media not normally moved to mention women’s football much suddenly couldn’t stop - and it wasn't all about the winners.\n“All respect to the losers. Without you the tournament is nothing,” said longtime Newstalk ZB sportscaster D’Arcy Waldegrave on his All Sport Breakfast show.\n“As of midnight on Sunday, only one team will experience the unadulterated joy of ascending their sporting Sagamartha - or Everest as the colonising empire called her,” he said, unleashing some Kipling-esque emotions.\nBut the losers were literally a big part of the World Cup story. All former winners were out by the quarter-final stage, including the incumbent champs from the United States whose official advert didn’t date well:\nWhile the biggest teams getting knocked out early was a novelty, the World Cup also delivered unique off-pitch stories for the media.\nMorocco featured the first ever hijab-clad player in a World Cup. The so-called Reggae Girls from Jamaica, who knocked out Brazil, also had the most mothers in the squad. Unlike some other teams, they had to leave families and children behind because of the expense.\nWhat went right - and wrong?\nNo major event goes off without a hitch. The deadly Queen Street shootings on the morning of opening day shut down the fanzone in Auckland.\nLess seriously, the Dutch weren’t happy with a rock-hard cricket wicket in their Tauranga training pitch - and at least some of the Spanish squad found Palmerston North a bit too dull. And this week, Football Ferns captain Ali Riley revealed they were nearly late for that opener against Norway because their bus was stuck in Auckland traffic.\nBut even Wellington’s bus-tastrophic public transport made good news for once by coping with the fares-free surges on game days.\nBefore kickoff, the concerned FIFA chief was imploring Kiwis to buy tickets, but long before the biggest games were played crowds were already substantially higher than they were in the previous tournament in 2019 - even though tickets were even cheaper and it was summertime in France.\nA record audience in Australia last weekend week saw their quarterfinal against France settled by longest-ever World Cup penalty shootout. The crowd at a blockbuster men’s AFL game at the MCG that night booed when the Matildas game was turned off on the big screen.\n“It's just incomprehensible. I still cannot understand how a men's Australian Rules footy game had women's football on TV at the same time. It just it doesn't make sense to me,” The Guardian Australia’s sports editor Jo Khan said.\nThrills, spills, skills, huge crowds and audiences. What’s not to like for the media?\n“It’s boring. It's you can't have 90 minutes plus 30 minutes with no goals scored. You can say it had moments of tension and excitement, all that usual stuff. But at the end of the day, it's dull,” Mike Hosking told his ZB listeners last Monday.\nHis sports panelists - TVNZ’s Guy Heveldt and Andrew Saville - couldn’t convince Hosking the bulging stadiums proved New Zealanders had embraced women football.\n“We're caught up in this because of what it is - not because it's women's sport or women's football. It's just an event that we’ve (hosted).”\nHosking was also unsure whether it was really Kiwis filling the stands at all.\n“People have come and made a holiday of it. Whether it be here or Australia, you buy a bunch of tickets you're going to every game no matter what. The same people are turning up the games,” he said.\n“You're not taking into account the multicultural makeup of the New Zealand population or indeed the Australian population these days,” he said, when asked to explain how matches like Japan v Sweden had filled Eden Park.\nThese days more than one in four New Zealanders living here were born outside the country, possibly in countries with more interest in football than here. It didn’t matter to any other commentator what kind of Kiwis were actually in the record-breaking crowds.\nAmong those arguing FIFA Women's World Cup was revolutionary for New Zealand was TVNZ’s John Campbell.\n“That it is being led by a FIFA product is truly unexpected. FIFA are revolutionary in the same way that Ronald McDonald is a vegan,” he wrote.\nEven FIFA secretary-general Fatma Samoura told a live debate in Auckland this week that the image of FIFA is “a middle-aged European man riding in a limousine and stealing money”.\nThis tournament’s success has helped world football’s bloated world body repair its scandal-tainted image a little.\nBut what legacy will the biggest-ever media event in this country leave on the media here and across the Tasman?\nTurning point?\n“It was wonderful to see the support that this tournament - and every team in it - has received from New Zealanders and Australians,” senior stuff sport journalist Zoe George, who specialises in reporting on equity and equality in sport, told Mediawatch.\n“It helped that the Football Ferns won that first game. The only other time that I've heard Eden Park like that was at the Women’s Rugby World Cup final last year between England and the Black Ferns,” she said.\nBefore the tournament kicked off Australian Associated Press reporter Ben McKay, who’s usually based in Wellington, reported that “Australia had World Cup fever - but New Zealand may have caught a cold.”\n“An enthusiasm gap has emerged between the two co-hosts for the tournament,” wrote McKay, who was at the last Women’s World Cup in France and has covered the Matildas for nearly ten years.\nBut he wasn’t wrong at the time.\n“It was a moment in time. Some of the matches in Hamilton and Dunedin were not as well attended - but it's not all about packing out every stand. You could argue that Costa Rica v Zambia wasn't going to pull a crowd no matter where you put it,” he said.\n“I went down to Dunedin for Bledisloe Cup coverage and a number of people were just so stoked to have played a part in this massive global event,” he said.\nBefore the tournament kicked off in Australia, host TV broadcaster Channel 7 was accused of under-selling it.\nLukewarm commercial sponsors were warned they might miss out on a shared national moment - and some did as the Matildas set successive records for TV viewing.\n“The Matildas match against France was the most watched television broadcast for 18 years. These were genuine nation-building moments,” he said.\nTheir tournament culminated in last Wednesday's semi-final attracting more than 11 million TV viewers at one point.\n“People weren't really sure how this would go. Optus - a telco like Spark - on-sold a package of matches to channel seven the free to air broadcaster Seven. Reports are that Optus paid $20 million and that package of games went to Seven for A$4m which must be the biggest bargain in the history of Australian sports broadcasting,” he said.\nFIFA initially struggled to persuade global broadcasters to offer enough for the rights to air the tournament. McKay said FIFA had already offered the rights for the next one, hoping to capitalise on the runaway ratings for the current tournament.\n\"The first story I wrote about the Matildas was in 2014. It was a crisp 108-word match report when they played the Netherlands. The next story I wrote about the Matildas was the ABC cutting free-to-air coverage of the league,” McKay recalled.\nHere, Sky Sport screened every game for its subscribers, but Sky-owned Prime TV (rebranding as Sky Open next week) screened selected live games free-to-air TV, including the Ferns' ones.\nStuff.co.nz also offered Sky coverage of selected games as a live stream for free alongside news stories and other content - an arrangement they will repeat for the Rugby World Cup next month.\n“I think that combination of commercial and free-to-air is really important to bring new audiences to women's sport. If we don't make it visible, then it's just going to fall off a cliff again,” she said.\n\"(Stuff) also had our FIFA Women's World Cup hub - and most of that coverage is led by men in my team which makes me doubly proud to know that we've got male allies who believe in the value of women's sport.”\n\"Media coverage is slightly different too because women's sport is driven by social issues and some have come to the fore during this World Cup - things like pay and prize money equity,” Zoe George said.\n“FIFA also said you can't wear the rainbow armband. Queer culture is a huge part of women's sport and (players) just found other ways to protest,” she said.\nBut does the success of the spectacle on the pitch preoccupy the media - and drown out the background issues when people are paying most attention to the sport?\n“Don’t forget that the US won back-to-back tournaments in 2015 and 2019 in the midst of a huge pay fight with their federation,” McKay said.\n“We've been successful during the Women’s World Cup, with millions seeing it (whether) it's through Sky or via our content. But what is the commitment going forward? And what is the strategy going forward to ensure we capitalise on this wave.\n\"So we need all media organisations to make a commitment to women's sport, equity and equality in our coverage,” she said.\n“At the moment about 28 percent of the sports coverage ecosphere is for all women's sports - which is a huge improvement from what it was even three and a half years ago when was 12 percent. So we are seeing a commitment from media organisations but we can always do more,” Zoe George told Mediawatch.",
  "word_count": 1725,
  "scraped_at": "2026-02-14T12:05:16.249178"
}