{
  "article_id": "f9603a83048f",
  "url": "https://www.thenationalnews.com/arts-culture/music-stage/2025/05/02/concerts-events-uae-2025-abu-dhabi-dubai/",
  "title": "Top 42 concerts and events coming to the UAE in 2025 , from Elyanna to Metallica",
  "date": "20250530T121500Z",
  "domain": "thenationalnews.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "There's something for everyone with rock, rap, opera and a hit musical among the exciting performances coming to the UAE over the next few months.\nThe Offlimits music festival returns with blockbuster headliner Shakira and Saadiyat Nights continues with its most impressive line-up yet, featuring a solo acoustic performance by John Mayer.\nThe UAE National Orchestra has begun its inaugural season with shows across the country, and the American Ballet Theatre will headline part of Abu Dhabi Festival. Fans in Dubai can look forward to shows from rockers Def Leppard and hip-hop stalwarts Wu-Tang Clan.\nHere, we round up the live events to look forward to this year.\n1. Wicked The Musical: Until February 15 at Dubai Opera\nThe Broadway hit tells the story of the witches of Oz through Stephen Schwartz’s celebrated score and songs, including Defying Gravity, Popular and For Good. Its Dubai Opera debut brings a global phenomenon to regional audiences.\nEvening and matinee shows available; tickets from Dh275\n2. La Bayadere: February 14 to 16 at Dubai Opera\nThe National Theatre of Brno stages the 19th-century Russian ballet set in India, which follows the rivalry between temple dancer Nikiya and the king's daughter Gamzatti.\nShow starts 8pm; tickets from Dh350\n3. John Mayer: February 15 at Saadiyat Nights, Abu Dhabi\nThe American singer-songwriter will make his UAE debut as part of the Saadiyat Nights concert series. A seven-time Grammy Award winner, Mayer is known for hits such as Gravity, Your Body Is a Wonderland and Slow Dancing in a Burning Room.\nDoors open 5pm; tickets from Dh345\n4. Krazy Super Concert: February 17 at Dubai Media City Amphitheatre\nThe Krazy Super Concert is a K-pop festival led by G-Dragon, known for tracks such as Crooked and One of a Kind, alongside Jay Park, whose catalogue includes Mommae and All I Wanna Do. The bill also features Kim Jong-kook, Yerin, Yein and special guest Kun.\nDoors open 6pm; tickets from Dh399\n5. Jimmy Carr: February 21 at Dubai Opera\nBritish-Irish comedian Jimmy Carr returns to Dubai Opera with his stand-up show Laughs Funny. Known for his rapid-fire delivery and dark humour, Carr is one of the UK’s most recognisable comedy voices, with a career spanning live tours, television and global specials.\nShows at 6.30pm and 9.30pm; tickets from Dh250\n6. Mo Gilligan: March 18 at Dubai Opera\nUK comedian Mo Gilligan brings his The Mo You Know World Tour to Dubai following sold-out runs across Europe. Gilligan has risen from viral sketches to arena tours, becoming one of Britain’s most prominent contemporary stand-up performers.\nShow starts 8pm; tickets from Dh250\n7. Wu-Tang Clan: March 22 at Coca-Cola Arena, Dubai\nHip-hop collective Wu-Tang Clan bring The Final Chamber Tour to Dubai, celebrating the legacy of albums such as Enter the Wu-Tang (36 Chambers) and Wu-Tang Forever. The group’s influence on global hip-hop culture remains unmatched more than three decades on.\nShow starts 7.30pm; tickets from Dh395\n8. Mary Poppins: March 25 to April 15 at Etihad Arena, Abu Dhabi\nThe award-winning West End production of Mary Poppins makes its Abu Dhabi debut with 26 performances.\nSet in Edwardian London, the musical tells the story of the nanny with supernatural powers who transforms life at Cherry Tree Lane for Jane and Michael Banks. Adapted from the stories of PL Travers and Disney’s 1964 film, the show features colourful choreography, inventive effects and timeless songs including A Spoonful of Sugar, Chim Chim Cher-ee and Supercalifragilisticexpialidocious.\nVarious timings; tickets from Dh120\n9. Yuja Wang: March 26 at Dubai Opera, Dubai\nWorld-renowned Chinese-American pianist Yuja Wang returns to Dubai Opera for a solo recital combining trademark technical precision and expressive range.\nShow starts 8pm; tickets from Dh300\n10. Big Time Rush: March 26 at Coca-Cola Arena, Dubai\nAmerican pop group Big Time Rush bring their In Real Life Worldwide tour to Dubai. The show will include tracks from their Nickelodeon series alongside songs such as Boyfriend and Worldwide.\nShow starts 8pm; tickets from Dh195\n11. Josh Groban: March 27 at Coca-Cola Arena, Dubai\nAmerican vocalist Josh Groban arrives in Dubai with his Gems World Tour. Known for blending classical, pop and musical theatre, he is expected to perform crowd favourites You Raise Me Up and To Where You Are.\nShow starts 8pm; tickets from Dh349\n12. A1 and Music Travel Love: March 28 at Coca-Cola Arena, Dubai\nBritish-Norwegian pop group A1 and Canadian acoustic duo Music Travel Love share the bill and perform separate sets. A1 rose to prominence in the late 1990s and early 2000s with chart hits including Everytime, Caught in the Middle and Like a Rose. Music Travel Love have built a large global following through harmony-led acoustic interpretations of songs such as Nothing’s Gonna Change My Love for You, alongside original material for live and digital audiences.\nShow starts 8pm; tickets from Dh295\n13. Keinemusik: March 28 at Bab Al Shams Arena, Dubai\nAfter performing as part of last year’s Abu Dhabi F1 Grand Prix, Berlin electronic collective Keinemusik headline a desert show. Expect DJ sets built around melodic and deep house that prioritise atmosphere as much as momentum.\nShow starts 7pm; tickets from Dh375\n14. Ebi: April 1 at Coca-Cola Arena, Dubai\nIranian singer Ebi returns to Dubai as part of his Pooste Shir concert series. With a career spanning more than five decades, his catalogue includes enduring songs such as Gharibeh, Shekar and Gheseh Eshgh.\nShow starts 8pm; tickets from Dh350\n15. Amr Diab: April 4 at Coca-Cola Arena, Dubai\nWidely regarded as one of the most influential figures in Arabic pop, Diab has a catalogue that spans decades, with enduring hits including Nour El Ein, Tamally Maak, Amarain and Ya Ana Ya La. The set is expected to draw from both classic material and recent releases such as Khatfoony, Baba and Shaif Amar, delivered with the Egyptian performer's long-standing live band.\nShow starts 9pm; tickets from Dh295\n16. Shakira at Offlimits: April 4 at Etihad Park, Abu Dhabi\nThe event returns for the second time with headliner Shakira. Known for global crossover hits including Hips Don’t Lie, Whenever, Wherever and Waka Waka (This Time for Africa), the Colombian singer will lead a bill featuring hip-hop and electronic music acts who will be announced soon.\nDoors open 3pm; tickets from Dh495\n17. Jon Batiste: April 12 at Emirates Palace Auditorium, Abu Dhabi\nFew musicians can balance virtuosity with storytelling as effectively as Jon Batiste. The Grammy-winning pianist blends jazz, soul, classical and RnB, and is known for work that moves between concert performance and cinematic composition. His Abu Dhabi Festival appearance forms part of the Maestro series and will spotlight his solo piano approach.\nDoors open 7pm, show starts 8pm; tickets from Dh250\n18. Dhafer Youssef: April 14 at The Red Theater, NYU Abu Dhabi\nOud maestro Dhafer Youssef will perform with his quintet, bridging sounds from the East and West through jazz, Arab and North African traditions, as well as European classical and electronic elements. He is expected to perform material from his latest album Shiraz, described as his most personal work to date.\nDoors open 7pm, show starts 8pm; tickets from Dh150\n19. Tarkan: April 17 at Etihad Arena, Abu Dhabi\nKnown internationally for the global hit Simarik and a catalogue that has defined Turkish pop for more than two decades, Tarkan making his Abu Dhabi debut is further proof of Turkish’s pop growing popularity in the region.\nShow starts 8.30pm; tickets from Dh795\n20. Daniel Bedingfield: April 17 at The Tent, Bla Bla Dubai\nUK singer-songwriter Daniel Bedingfield performs live in Dubai for the first time, revisiting the catalogue that defined early-2000s pop and UK garage crossovers such as Gotta Get Thru This and If You’re Not the One.\nDoors open 8pm, show starts 9pm; tickets from Dh250\n21. American Ballet Theatre: April 17 at Emirates Palace Auditorium, Abu Dhabi\nAmerican Ballet Theatre will present works by three choreographers: Twyla Tharp’s playful Sextet, Alexei Ratmansky’s meditative Serenade after Plato’s Symposium, and George Balanchine’s Theme and Variations, set to music by Tchaikovsky.\nDoors open 7pm, show starts 8pm; tickets from Dh125\n22. Hyperound K-Fest: April 18 at Etihad Arena, Abu Dhabi\nA one-day K-pop showcase led by boy band Enhypen, known for tracks such as Bite Me, and girl group Fifty Fifty, whose breakout hit Cupid achieved global streaming success. Both will feature the high-powered production and choreography synonymous with K-pop shows.\nShow starts 7pm; tickets from Dh210\n23. Minsoo Sohn: April 19 at The Red Theater, NYU Abu Dhabi\nPianist Minsoo Sohn will perform Book One of Bach’s Well-Tempered Clavier, presenting the 24 preludes and fugues that explore every major and minor key. The recital highlights both the intellectual depth and emotional breadth of the landmark work.\nDoors open 7pm, show starts 8pm; tickets from Dh150\n24. Lisa Batiashvili and Giorgi Gigashvili: April 22 at The Red Theater, NYU Abu Dhabi\nViolinist Lisa Batiashvili and pianist Giorgi Gigashvili will perform works by Beethoven, Bartok and Franck, alongside a contemporary piece by composer Josef Bardanashvili.\nDoors open 7pm, show starts 8pm; tickets from Dh150\n25. Christina Aguilera: April 24 at Etihad Arena, Abu Dhabi\nChristina Aguilera will return to Abu Dhabi just more than a year after her Saadiyat Nights performance. The seven-time Grammy Award winner last appeared in the emirate in February 2025, a show that was described in The National as a masterclass in live performance, underlining her reputation as one of pop’s most formidable vocalists. Her return follows earlier UAE appearances including Expo 2020’s closing ceremony.\nDoors open 7pm; tickets from Dh395\n26. Sondra Radvanovsky and Vincenzo Scalera: April 25 at The Red Theater, NYU Abu Dhabi\nSoprano Sondra Radvanovsky will perform arias and songs by Bellini, Verdi and Puccini, accompanied by pianist Vincenzo Scalera. The programme also includes music by Rachmaninoff, Tchaikovsky and Richard Strauss.\nDoors open 7pm, show starts 8pm; tickets from Dh150\n27. Algarabia: April 26 at Emirates Palace Auditorium, Abu Dhabi\nAlgarabia presents a theatrical production blending flamenco with Arabic poetry, performed by musicians from Spain’s University of Navarra Symphony Orchestra alongside dancers and actors. The work follows the journey of an Arab girl drawn to ancient botanical theory and poetic tradition.\nDoors open 7pm, show starts 8pm; tickets from Dh100\n28. Hauser: May 2 at Etihad Arena, Abu Dhabi\nCellist Stjepan Hauser will perform both solo and ensemble pieces, presenting classical and contemporary works with the expressive style that has made him a global concert and online presence.\nDoors open 7pm, show starts 9pm; tickets from Dh248\n29. Rumi The Musical: June 4 to 7 at Dubai Opera\nRumi: The Musical, from Qatari composer Dana Al Fardan and British-Lebanese actor Nadim Naaman, returns to Dubai Opera to tell the story of the 13th-century poet’s transformative bond with the mystic Shams Tabrizi.\nShowtime and ticket prices yet to be announced\n30. Def Leppard: August 2 at Coca-Cola Arena, Dubai\nFormed in Sheffield in 1977, Def Leppard have become leaders of the “new wave of British heavy metal” with early albums such as High ’n’ Dry (1981), which featured the breakthrough single Bringin’ on the Heartbreak. The group last performed in the UAE as part of the 2022 F1 Abu Dhabi Grand Prix race-day concert.\nDoors open 8pm; tickets from Dh595\n31. Russell Peters: October 25 at Etihad Arena, Abu Dhabi\nKnown for his rapid-fire delivery, crowd banter and cultural observations, Indian-Canadian comedian Russell Peters built an international following through specials such as Outsourced, Red, White and Brown and Deported. Peters remains one of the highest-grossing comedians globally, with a touring career spanning more than two decades.\nShow starts 8.30pm; tickets from Dh275\n32. Lewis Capaldi and Zara Larsson: December 3 at Etihad Park, Abu Dhabi\nLewis Capaldi and Zara Larsson will open the Abu Dhabi Grand Prix 2026 after-race concert series with separate sets at Etihad Park.\nCapaldi returns to the capital following his Saadiyat Nights performance in January, bringing a catalogue that includes Someone You Loved, Before You Go and Forget Me. Larsson joins the bill with pop staples such as Lush Life, Never Forget You and Symphony, offering a high-tempo contrast to Capaldi’s ballad-driven set. The show launches the four-night programme running alongside the race weekend at Yas Marina Circuit.\nShow times yet to be announced; access exclusive to Abu Dhabi Grand Prix ticket holders",
  "word_count": 2050,
  "scraped_at": "2026-02-14T12:58:13.477832"
}