{
  "article_id": "f96d6fe469aa",
  "url": "https://www.boston.com/community/readers-say/2025/03/21/why-white-stadium-should-be-redeveloped/",
  "title": "1 , 000 readers voted : Redeveloping White Stadium will  be a boon  ",
  "date": "20250321T104500Z",
  "domain": "boston.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "The White Stadium renovation trial began this week over the costly and contentious plans to renovate the ailing 76-year old stadium in Franklin Park – a project that has some Boston.com readers conflicted.\nThe renovation process has been underway for a year, as a result of a public-private partnership between the City of Boston and Boston Unity Soccer Partners (BUSP), the investor group behind the city’s new women’s professional soccer team.\nThe goal of the renovation project is to build a new and improved stadium for Boston Public Schools student-athletes and the community, as well as a home base for the women’s professional soccer team. The project is expected to cost $200 million, and the city will pay for about half of the project (an estimated $91 million), while the BUSP will cover the rest.\nAdvertisement:\nCity officials have described the project as a “generation opportunity” for the city’s student-athletes and the emerging professional soccer team. But not everyone is on board with the plans.\nLast February, several community members and the Emerald Necklace Conservancy filed a complaint against the city and the BUSP over concerns about the proposed redevelopment of White Stadium in Franklin Park. They argue the project violates Article 97 of the Massachusetts Constitution and “fundamentally alter[s] the nature and feel of a significant portion of Franklin Park.”\nWhen we asked Boston.com to weigh on the renovation, just over half (55%) of the nearly 1,000 respondents to our poll said they support the plan.\nDo you agree with plans by the city and Boston Unity Soccer Partners to redevelop White Stadium?\nYes, I agree\n55%\n520\nNo, I disagree\n42%\n397\nI don't know\n2%\n20\n“I think it will be an added value to the neighborhood and larger community. I love the mixed-use proposed between local area school teams and the professional women’s soccer team. It brings a positive element to the area!” reader Stacy from Milton said.\nAdvertisement:\nBut a sizable portion (42%) of readers opposed the renovation, expressing concern over the public-private partnership bankrolling the project and the impact the stadium will have on the park’s environment and surrounding neighborhoods.\n“It’s a boondoggle for corporate investors and a loss for the neighborhoods and schools,” Michelle D. from Jamaica Plain said.\nBelow, readers weigh in on the city’s plans to renovate White Stadium in Franklin Park.\nResponses have been lightly edited for grammar and clarity.\nDo you agree with plans by the city and Boston Unity Soccer Partners to redevelop White Stadium?\nYes, I agree\n“I think that a totally revitalized stadium is a real asset to our city. As a mom of a BPS student athlete, I am excited for my daughters to have access to a top notch facility. Too often female athletes get the bottom of the barrel. Also, the opportunity to have world class athletes as role models in our own city will be galvanizing. The lease agreement sets up BPS to have most of the access to the stadium.” – Patricia, Dorchester\n“I am a Boston District 4 resident, a frequent visitor of Franklin park, and a BPS parent of a young girl. BPS kids deserve a facility of this quality, and this seems like a fair deal for the city, and a great opportunity to get some funding to pay for a new facility. Also, as a fan of soccer, and of women’s sports, I very much look forward to taking my athlete daughter to see professional women athletes playing in our city. We plan on getting season tickets for our family!” – Nicholas W., Roslindale\n“I live in Jamaica Plain near the stadium and I am excited to bring my children to games, and for them to benefit as BPS students. I also think it will be a boon for the local economy and bring needed attention to the often overlooked and under-resourced grounds of Franklin Park.” – John, Jamaica Plain\n“I get why the neighborhood is fighting against the White Stadium renovation from a historical perspective. But it’s a dilapidated structure that’s never going to be updated without a public/private partnership. Complaining about traffic also ignores that the site already has a 10,000 seat stadium and does a disservice to the small businesses next to the park that would benefit from more visitors. Change isn’t always bad and I wish neighborhood organizations would spend more time negotiating for positive change rather than just saying no to everything.” – Eric, Dorchester\n“I am a daily Franklin Park user and live in the neighborhood. The state of the stadium has been appalling. BPS runners, of which I know several, deserve better. I am excited about the possibility of having a professional women’s soccer team playing here! And I am excited about the opportunities it can generate for our community and young people.” – Molly B., Jamaica Plain\n“I am very excited about the stadium and an update is long overdue. Leasing the stadium out to a tenant that is willing to pay for half of the costs in exchange for only a portion of use is a smart way to expedite the construction of a 100% public stadium that is going to support our BPS kids in the long term. Plus, the stadium is actively benefiting the park, investing in green space not just in the short term but through donations over the entire 10-year lease, resulting in a real financial investment in the park and the surrounding neighborhood. It’s pure icing on the cake that this tenant would be a professional women’s soccer team in a world where professional women athletes are earning 1% of what professional male athletes are making.” – Beth S., Roxbury\n“Nothing comes for free, and the proposed public/private partnership appears to be the best solution to both upgrade infrastructure in dire need of it, and not have the entire financial burden rest on the taxpayers. With construction costs always on the rise, people need to be open to this type of approach unless they are OK with taxes rising accordingly.” – Tom, Revere\n“It’s a great idea to get private investment to offset costs of the much needed renovation of White Stadium. Plus, it is very exciting to bring professional women’s soccer to Boston – long overdue.” – Gaby W., Medford\n“For years, I lived right next to Franklin Park in Jamaica Plain. I’d run and walk my dog around White Stadium all the time. It was a dump. It’s been a dump for decades. All the hand-wringers did nothing to remedy this situation – for decades. Boston Unity Partners will remedy this state of affairs. Moreover, I like soccer. I like women’s soccer. I’d like to take my daughters to top-tier women’s soccer in the area. The city will have a stadium that is not a dump, and we will have women’s soccer to go to. Win-Win. For all those complaining, I’d ask: Where were you for the decades this stadium was literally rotting? One entire grandstand has been unsafe for use since the 1980s. Multiple mayors simply ignored it. This plan is not perfect – none is. But, it’s a good one. No, I don’t live in JP anymore – but I would be even more enthusiastically in favor of this if I did and could walk to the matches!” – Marcus, Sudbury\nNo, I disagree\n“Placing a huge stadium in that area of the park will radically change the character of that section of the park. The plans call for use of land far outside the footprint of the current stadium! Currently, the majority of the people who use that area live in the surrounding areas and are mostly people of color. These are people who do not have the resources to vacation on Martha’s Vineyard or on Cape Cod and they use the park to access nature. To have constant vehicular traffic, extreme noise and thousands of fans descending upon this park will be a travesty.\nI firmly believe that if the city plans to spend over $100 million on a project that it should be voted on by the residents of Boston who pay taxes. There is a viable alternative plan available that would renovate the stadium and allow full access to the citizens and students for far less money. It reduces the height of the stadium and is more in keeping with the bucolic nature of the park.” – Patricia C., Jamaica Plain\n“It’s land held in trust by the public and Franklin Park is the crown jewel of the Emerald Necklace. There is no reason to have a massive tax giveaway to wealthy investors that will have a negative impact on access for Boston residents. Access will be lost on 20 Fri/Saturdays by BPS students and residents during prime weather seasons. The area also doesn’t have the infrastructure to support 11,000+ people attending, causing severe traffic delays and disruptions to the local community. Most importantly, it will only accelerate the fast moving pace of gentrification in these areas that are composed primarily of BIPOC folks and other marginalized communities.” – C.R., Roxbury\n“I think the proposal for a professional stadium will close off an important part of Franklin Park to the public during key summer and early fall weekends. I also worry that the new stadium will be used as an entertainment venue all year long, causing transportation issues and noise pollution. I want a simpler renovation exclusively for the public and BPS athletes.” – Margie G., Boston\n“Public funding for an unproven professional sports team is irresponsible. What happens if the team and/or league fails? The city of Boston will be on the hook, which would spell financial disaster. Instead, a more modest publicly funded renovation would improve the facility, retain control, and protect the city from potential financial strain.” – Joe, Jamaica Plain\n“I live four blocks from the stadium and we would love to see it be renovated into a vibrant modern sports and cultural hub for BPS students and the community. What it should not be is a largely private-use facility which does not enhance the culture and vibrancy of Franklin Park and surrounding neighborhoods. There is an absolute lack of parking and transportation needed for professional public sporting events. The continually escalating costs, to which the City has committed half, are likely still dramatically under what the final cost would be. At this point, the City should foot the whole bill and keep it fully public use only.\n“Franklin Park already has a vibrant local cultural scene on any given day, and this proposed privatization of the stadium will not enhance the existing cultural events nor will it be meant to draw in the local residents. This plan is the wrong plan for the wrong place, completely disregards the actual needs and desires of the community and those who use the park and stadium, and should be halted permanently. The right plans would draw from the local community and would draw in the community for many generations of use, recreation and enjoyment.” – Lauren, Jamaica Plain\nBoston.com occasionally interacts with readers by conducting informal polls and surveys. These results should be read as an unscientific gauge of readers’ opinion.",
  "word_count": 1868,
  "scraped_at": "2026-02-14T12:19:08.935432"
}