{
  "article_id": "f981e0654aa2",
  "url": "https://allfortennessee.com/tennessee-fans-react-to-vols-trading-transfer-quarterbacks-with-ucla-01jsd98bbey8",
  "title": "Tennessee fans react to Vols  trading  transfer quarterbacks with UCLA",
  "date": "20250422T133000Z",
  "domain": "allfortennessee.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Tennessee has completed the biggest \"trade\" in college athletics's NIL and transfer portal era. Nico Iamaleava announced he is transferring to UCLA, and as a result, UCLA quarterback Joey Aguilar entered the portal and is heading to Rocky Top.\nESPN's Chris Low confirmed that Aguilar will join Josh Heupel on Rocky Top after the Tennessee coaching staff and Aguilar met on Monday.\nAccording to Volboy on X, the official unofficial trade involves Nico Iamaleava going to UCLA, and the Vols receiving Joey Aguilar, women's basketball standout and UCLA forward Janiah Barker, and cash considerations, as the Vols will pay Aguilar significantly less than they would have paid Iamaleava.\nBarker announced her commitment to the Lady Vols basketball program on Monday, adding fuel to the fire between Tennessee and UCLA.\nMeanwhile, Tennessee fans seem to be excited for Aguilar to come to Rocky Top. He created some exciting highlights as Appalachian State's quarterback the past two seasons, and Vols fans are ready to see what he can do in Heupel's offensive system.\nThe aftermath of the Nico transfer saga turned many college football fans into Tennessee fans for the upcoming season before Aguilar's commitment, but that has been amplified since Aguilar's announcement Monday afternoon.\nPeople outside of Vol Nation have also expressed excitement about Aguilar's commitment to Tennessee and wished him and the Vols success for the upcoming season.\nAfter about a week and a half of not knowing who the Vols quarterback would be in 2025, Heupel has landed a potential superstar at quarterback in Joey Aguilar.\nHis arm talent and athleticism match what Heupel has been looking for in a quarterback to run his system, and Aguilar will now have the opportunity to thrive at Tennessee.",
  "word_count": 287,
  "scraped_at": "2026-02-14T13:21:26.078566"
}