{
  "article_id": "f99005402026",
  "url": "https://www.pilotonline.com/2026/01/08/virginia-tech-gains-commitment-from-former-penn-state-lb/",
  "title": "Virginia Tech gains commitment from former Penn State LB",
  "date": "20260108T233000Z",
  "domain": "pilotonline.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "COLLEGE FOOTBALL\nEx-Penn State LB commits to Hokies\nVirginia Tech gained a commitment from Penn State transfer linebacker Keon Wylie, who will be reunited with coach James Franklin and more former teammates with the Nittany Lions. The 6-foot-2, 228-pounder had 47 tackles and 4.5 sacks with Penn State and has two years of eligibility remaining.\nMeanwhile, the Hokies landed former Oklahoma offensive lineman Logan Howland, a 6-6, 322-pounder, according to Tech Sideline.\nAlso, defensive tackle Emmett Laws announced he’d return to the Hokies. He had 12 tackles and a sack this season.\nEx-Memphis backup QB commits to JMU\nJames Madison gained a commitment from quarterback Arrington Maiden, a 6-foot-3, 225-pounder from College Station, Texas, who played in reserve as a freshman for Memphis. He was 5 of 10 for 59 yards and had 13 carries for 79 yards and a touchdown.\nAlso committing to JMU was Kylan Billiot, a 6-3, 195-pound receiver who wasn’t a factor on LSU’s team this year but was considered a top-100 recruit in the 2024 class by On3 Sports. Another commit was Hayden Ross, a long snapper who was on East Tennessee State’s team for two seasons but did not play in a game.\nDefensive lineman Mychal McMullin withdrew from the transfer portal and will return to JMU. The former Phoebus High star had 32 tackles and a sack this season.\nDefensive back Jayon Harvey announced his commitment to JMU. He was a second-team selection in the Division II Great Midwest Athletic Conference for Findlay in 2024 after compiling 58 tackles and four interceptions.\nJMU will hire its 2016 FCS national title-winning quarterback, Bryan Schor, as the tight ends coach on Billy Napier’s staff, according to CBS Sports. Schor has been on Georgia Southern’s staff the past four seasons.\nFormer JMU running back Wayne Knight, the Sun Belt championship game MVP, committed to UCLA and will be reunited with coach Bob Chesney. Knight, an All-American, had 1,770 yards and 10 touchdowns this season.\nCOLLEGE BASEBALL\nUVA ranked 14th in Perfect Game poll\nVirginia was ranked 14th in the Perfect Game preseason poll.\nThe Cavaliers, under former Duke coach Chris Pollard, and many other teams begin their season Feb. 13. UVA will face Wagner in an opener.\nUVA was the third-highest-ranked Atlantic Coast Conference team in the poll, behind No. 2 Georgia Tech and No. 9 Florida State.\nLSU sits atop the poll, with the Yellow Jackets, Tennessee, Arkansas, UCLA, Mississippi State, Oregon State, Texas, the Seminoles and Auburn rounding out the top 10.\nCOLLEGE MEN’S TENNIS\nUVA fifth, Wake first in preseason poll\nVirginia was ranked fifth in the Intercollegiate Tennis Association preseason poll, which defending champion Wake Forest unanimously topped.\nOther ACC teams in the top 25 were No. 4 Stanford, No. 9 NC State, No. 17 Duke, No. 22 Florida State and No. 25 Clemson.\nCOLLEGE WOMEN’S TENNIS\nCavaliers start season 14th in nation\nVirginia was 14th in the ITA preseason poll, led by Georgia.\nThe top-25 ACC teams besides the Cavaliers were No. 3 North Carolina, No. 8 Duke, No. 9 Stanford, No. 11 NC State and No. 15 California.\nCOLLEGE TRACK AND FIELD\nUVA’s Martin makes Bowerman watch list\nVirginia distance-running standout Gary Martin has been named to the watch list for the Bowerman, collegiate track and field’s most prestigious award, for the third time. He is the only one of the preseason 10 candidates from the ACC.\nSOCCER\nUVA’s Simmonds named to U.S. U-20 camp\nFormer Virginia standout forward Nicholas Simmonds was named to the roster for the U.S. U-20 Men’s National Team training camp, which is set to take place alongside the U-18 and U-19 camps from Jan. 10-16 at Arizona Athletic Grounds in Mesa.\nFrom Midlothian, he was selected third overall in the MLS SuperDraft by FC Dallas.\nRichmond Kickers defender Griffin Garnett and Richmond native Brent Adu-Gyamfi, a Columbus Crew forward also in the U-20 camp.",
  "word_count": 649,
  "scraped_at": "2026-02-14T13:23:47.641080"
}