{
  "article_id": "f99634c3a821",
  "url": "https://www.mirror.co.uk/news/uk-news/breaking-attacker-stabs-eight-leaving-29823480",
  "title": "Attacker stabs eight leaving one dead after rampage near Cornwall nightclub",
  "date": "20230430T124500Z",
  "domain": "mirror.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "A man in his 30s has died and seven people have been injured in a knife frenzy outside a nightclub.\nPolice rushed to the scene in Bodmin, Cornwall, and have been near the Eclipse Nightclub since the early hours of this morning.\nThe victim was pronounced dead at the scene and those who suffered injuries were taken to hospital for treatment, Devon and Cornwall Police said.\nThe force confirmed a 24-year-old man has been arrested on suspicion of murder, attempted murder and causing grievous bodily harm with intent, and remains in police custody, Cornwall Live reported.\nLeigh Frost, Cornwall councillor for Bodmin St Petroc, said: \"I'm shocked and devastated at the news coming out from last night.\n\"Firstly my thoughts are with the victims, their families, and anyone who has suffered from tragic event.\n\"We are a strong community and we will support each other through this, I'll make it absolutely clear knife crime is unacceptable, and we will not tolerate it here in Bodmin.\n\"I'd like to praise the emergency services for their quick actions in responding to this incident, and to urge everyone to let the police conduct their investigation, and if you have any helpful information please come forward.\"\nDevon and Cornwall Police have confirmed some of those caught up in the incident had been in the Eclipse nightclub earlier in the evening - but said the attack itself happened outside.\nSupt Rob Youngman said it was not currently known what the relationship was between the suspect who has been arrested and the victim and they were still trying to establish a motive.\nHe said: \"At this moment in time we are working to continue to understand the motivation behind this incident. The relationship, if any, between those involved is not clear at this stage.\n\"We believe some members of the group who were injured had been in Eclipse nightclub. They were then outside in Castle Canyke Road when the incident happened.\"\nLocals described the incident as \"heartbreaking\" with one posting on Facebook: \"Thoughts to everyone caught up in the trouble at Eclipse nightclub in Bodmin in the early hours. Just absolutely heartbreaking people go out for a fun night and now they aren't coming home.\"\nAnother said: \"So tragic, you see someone leave for a fun night and they never come home, heartbreaking. Thoughts with the families.\"\nDevon and Cornwall police said in a statement: \"Police were called at 3.15am on Sunday 30 April to the area of Victoria Square on Castle Canyke Road following a report of a serious altercation.\n\"It was further reported someone was in possession of a knife and multiple people had sustained suspected stab wounds.\n\"A man in his 30s was confirmed deceased at the scene. His next of kin have been informed and are being supported by specialist officers.\n\"At least seven other men and women have been injured and taken to hospital to receive treatment. At this time none are being treated as life-threatening.\n\"A 24-year-old man from Bodmin has been arrested on suspicion of murder, attempted murder and causing grievous bodily harm with intent. He remains in police custody at this time.\"\nDetective Inspector Ilona Rosson from the Major Crime Investigation Team said: \"Following an incident in Bodmin last night, a man in his 30s has been confirmed deceased and officers are supporting his next of kin.\n\"At this time we are treating this as an isolated matter and we are not seeking anyone else in connection to this incident.\n\"This is a live and active police investigation, and I would urge people not to speculate on social media but if you have information which may assist us, please report it.\"\nEast Cornwall Local Policing Superintendent, Rob Youngman said: \"This investigation is in its early stages and the public can expect to see a heightened policing presence around Bodmin today whilst enquiries are ongoing.\n\"Understandably this incident will have an impact on the local community, and our thoughts are with the families of the victims.\n\"Cordons will stay in place today whilst officers gather information and evidence from the scene.\n\"Anyone who has not yet been spoken to by officers and has any information which may assist our investigation, please get in touch. This could include any relevant dash-cam, doorbell and CCTV footage from the area of Victoria Square and along Castle Canyke Road.\"\nIf you witnessed the incident or have any information, including footage which could help with enquiries, please contact police via the Major Incident Public Portal.",
  "word_count": 751,
  "scraped_at": "2026-02-14T12:02:41.160294"
}