{
  "article_id": "f9aba55a2d1a",
  "url": "https://www.richmondandtwickenhamtimes.co.uk/news/national/uk-today/25726685.full-list-famous-faces-named-new-year-honours-2026/",
  "title": "Full list of famous faces named in New Year Honours 2026 | Richmond and Twickenham Times",
  "date": "20251230T011500Z",
  "domain": "richmondandtwickenhamtimes.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "The actor Idris Elba, ice dancers Jayne Torvill and Christopher Dean and members of the England women's national football and rugby sides have been recognised in the New Year Honours list for 2026.\nThe Honours are awarded based on merit or on exceptional achievement or service, and are awarded twice a year - on the King's Birthday and the New Year.\nThis can range from receiving a knighthood or damehood to getting a CBE, MBE, OBE or GBE.\nAn individual can be nominated for an Honour either by government departments or members of the public, so there is always a mix of famous faces and the general public.\nWhich famous faces were recognised in the New Year Honours list for 2026?\nThe actor Idris Elba was one of the more recognisable names on the list, with him being knighted for services to young people.\nHe founded the Elba Hope Foundation, which supports community empowerment, education, youth advocacy and sustainable development.\nSpeaking on the honour, Sir Idris, 53, said: “I receive this honour on behalf of the many young people whose talent, ambition and resilience has driven the work of the Elba Hope Foundation.\n“I hope we can do more to draw attention to the importance of sustained, practical support for young people and to the responsibility we all share to help them find an alternative to violence.”\nHe is well-known for his roles in numerous TV shows and films, including The Wire, Luther, Pacific Rim, Zootopia, American Gangster, Prometheus and the Marvel Cinematic Universe.\nJayne Torvill and Christopher Dean have been made a Dame and Sir for services to ice skating and to voluntary service.\nThey took home the Olympic gold at the 1984 Winter Games in ice dancing and saw success at the World, European and British Championships.\nDiscussing the honour, Dame Jayne, 68, said the timing of the honours seemed “perfect” after the pair danced on the ice for the last time this year.\nShe said: “We had such a great time, we were so happy with the tour and the fact that we got through it.\n“It was a big thing for us to mark our career before retirement, and then receiving this award at the end of the year, it’s just finished everything. It’s perfect.”\nOther people within the entertainment industry who were recognised included the actor Warwick Davis and presenter and author Richard Osman being made OBEs.\nIt comes after Davis was given Bafta’s highest honour at its annual film awards, the Bafta Fellowship, for his performing and advocacy work back in February.\nAlongside that, former Coronation Street star Sally Lindsay is made an MBE, and the actress Meera Syal is made a Dame.\nSyal, 64, is known for her work on Goodness Gracious Me, The Kumars at No.42 and The Split among many other TV shows and films.\nWicked star Cynthia Erivo is also made an MBE for services to music and drama, and football commentator Clive Tyldesley becomes an OBE for services to sports broadcasting and to charity.\nThe comedian Bill Bailey is made an MBE for services to entertainment, and singer Ellie Goulding is made an MBE for services to biodiversity and the climate.\nWriter Roy Clarke, creator of sitcoms Last Of The Summer Wine, Open All Hours and Keeping Up Appearances, is also knighted.\nIn the world of sport, members of England’s Lionesses featured heavily after winning the Euros this summer.\nCaptain Leah Williamson is made a CBE, while Alex Greenwood, Keira Walsh, Georgia Stanway and Ella Toone are made MBEs.\nThe team’s Dutch manager, Sarina Wiegman, is awarded an honorary damehood, the Cabinet Office said.\nMembers of England Women’s Rugby World Cup-winning squad are also represented, with Marlie Packer and Zoe Aldcroft becoming OBEs, along with coach John Mitchell.\nTeammates Ellie Kildunne, Sadia Kabeya, and Megan Jones are made MBEs after the Red Roses defeated Canada in the final in September.\nPaula Radcliffe, a three-time London Marathon winner who held the women’s marathon world record for 16 years, has been made an OBE.\nWho else featured on the New Year Honours list for 2026?\nOther notable people featured on the New Year Honours list include 92-year-old Betty Brown.\nShe is thought to be the oldest victim of the Horizon IT scandal and said it was a “shocker” to have been made an OBE for seeking justice for subpostmasters.\nRecommended reading :\n- How to watch Jools Holland's 2025 Annual Hootenanny (and the celebrities joining him)\n- Every UK Bank Holiday date for 2026 - see the full list\n- Celebrity Traitors to the Euros - take our quiz to see what you remember from 2025\nMeanwhile, D-Day veteran Mervyn Kersh, 101, said it is a “wonderful thing” to be awarded a British Empire Medal (BEM) for services to Holocaust remembrance and education.\nThe oldest on the list is 102-year-old John Hearn, one of four centenarians included, who receives a BEM for services to Judo and to the community in north-east England.\nAt 20, the youngest recipient this year is Olympic gold medal-winning sports climber Toby Roberts from Elstead in Surrey, who becomes an MBE.",
  "word_count": 854,
  "scraped_at": "2026-02-14T13:07:09.877997"
}