{
  "article_id": "f9b8387d0b84",
  "url": "https://www.mediapost.com/publications/article/411450/coca-cola-kicks-off-2026-world-cup-trophy-tour.html",
  "title": "Coca - Cola Kicks Off 2026 World Cup Trophy Tour",
  "date": "20251218T010000Z",
  "domain": "mediapost.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "- by Danielle Oster , December 17, 2025\nAs part of its World Cup sponsorship agreement with FIFA, Coca-Cola is giving fans across the world a chance to see the prize awarded to the tournament’s champion ahead of the 2026 World Cup tournament.\nThe FIFA World Cup Trophy Tour by Coca-Cola will give fans across 75 stops the chance to see the original World Cup Trophy over the course of 150 days. It kicks off on Jan. 3, in Riyadh, Saudi Arabia, and will visit 30 countries, including all three hosts for the 2026 World Cup -- the United States, Canada, and Mexico -- as well as future FIFA World Cup and FIFA Women’s World Cup host nations, including 2027 Women’s World Cup host Brazil, Morocco, Portugal, and Spain.\nIn addition to an opportunity to see the sought-after World Cup Trophy, the tour will also include experiential brand activations, “interactive football challenges” and exclusive content featuring “FIFA legends.” Coca-Cola announced the World Cup Trophy tour with a video running on brand social channels including Facebook and Instagram, and is inviting fans to follow the World Cup trophy along its journey via content on Instagram.\nadvertisement\nadvertisement\nThe tour marks 20 years since the first Coca-Cola-sponsored World Cup Trophy tour, and its sixth tour overall. According to Coca-Cola, over the years the tour has reached more than four million fans of the sport globally.\n\"Football has an unmatched ability to bring people together, no matter where they’re from or what language they speak,” added Mickael Vinet, vice president, global assets, influencers and partnerships for The Coca-Cola Company. “As the Trophy travels toward the biggest FIFA World Cup in history, we’re celebrating the passion, pride and unity that make football the world’s favorite sport.\"\nAccording to The Coca-Cola Company, the tour will also include collaborating with local teams and bottling partners to support the company’s sustainability initiatives, including packaging collection, and recycling initiatives.\nNews of the upcoming tour kickoff follows PepsiCo launching its own World Cup campaign for the company’s Lay’s brand earlier this month, bringing back its “No Lay’s, No Game” brand platform with an ad featuring comedic actor Steve Carell, as well as soccer superstars David Beckham, Thierry Henry, Lionel Messi, and Alexia Putellas.",
  "word_count": 374,
  "scraped_at": "2026-02-14T12:37:39.318391"
}