{
  "article_id": "f9be1f0550f2",
  "url": "https://www.centralwesterndaily.com.au/story/8258083/the-title-winning-western-side-that-helped-develop-two-of-our-world-cup-stars/?cs=104",
  "title": "Western graduates Ellie Carpenter , Clare Hunt set to lead Matildas defence at FIFA Women World CUp | Central Western Daily",
  "date": "20230706T073000Z",
  "domain": "centralwesterndaily.com.au",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "TWELVE years ago at the New South Wales Junior Girls Football Championships in Dubbo a talented Western under 12s side fought their way to a country title over Riverina and Southern.\nSubscribe now for unlimited access.\nor signup to continue reading\nIt was an achievement worth celebrating for the squad but for two of those players there would just be the start of their journey towards the pinnacle of the sport.\nWhen the Matildas begin their FIFA Women's World Cup campaign in two weeks' time they will look for the defence of both Grenfell product Clare Hunt and Cowra talent Ellie Carpenter to lead them to glory on home soil.\nThe NSW Junior Girls Championships under 12s country title might not be the first title mentioned next to those two names in their resume of career achievements but it played a part in developing two of the nation's most reliable defensive options.\nThe man who coached that 2011 Western side, Paul Morris, said his team was packed with talent from front to back, but he's still blown away knowing that two of those players have gone on to represent their country.\n\"With Clare being from Grenfell and Ellie being from Cowra they were committed to doing a lot of travelling for their football at a young age. It's a big deal for parents to do ... and looking at things now it's certainly paid off,\" he said.\n\"We played Ellie up front - she was a striker back in the day - and Clare was a midfielder,\" he laughed.\n\"I remember them being great athletes and great kids who were really committed. You could tell at the time that they were going to go somewhere.\n\"We ended up winning the country championship and we finished fifth overall in that tournament. We had a lot of representatives from those Western teams going on to play in country teams as well, like Jess Daymond and Morgan and Kelsey Sherman. Women's soccer was very strong at the time.\"\nCarpenter has since notched up 61 appearances for the Matildas and announced herself on the world stage when she signed for French club Olympique Lyonnais in 2020, where she is contracted through to 2026.\nWestern Sydney Wanderers' Hunt has been a more recent addition to the senior national side, making her debut this year during February's Cup Of Nations clash against Czechia in Gosford, and she has since achieved four more caps for the Matildas.\nTogether with Orange-born midfielder Tameka Yallop it's a Maitldas side that reminds girls from around the region that a path to the top is possible for Western's best of the best.\nThe Matildas defensive duo have each gone through their share of adversity to reach this point.\nHunt has battled through an ACL injury, shoulder reconstruction and a broken ankle to eventually make her national debut while Carpenter also suffered a torn ACL in Lyon's UEFA Women's Champions League final victory last year.\nBoth are now fully fit for the World Cup campaign, with Carpenter recently stating that she feels \"better than ever\".\nFootball NSW's Development Manager for Regional Football, Andrew Fearnley, headed up the Western Mariners program at the time Carpenter and Hunt were starting to catch people's attention.\nHe remembers the duo showing plenty of talent in their primary school years.\n\"The World Cup is the showpiece of football and it's really positive to have regional girls making it all the way to the top. It's a credit to them and it's a big positive for the young players that we currently have in regional football as it's something for them to aspire to,\" he said.\n\"They were very talented players. You never know who is going to make it but there are some players who have something about them. It's pleasing to see those two from that one tournament have gone on to reach the pinnacle of our sport.\n\"I remember both of them playing - different players with different qualities but each with great skill sets for the positions they play.\n\"It's been a long time since then but they've both obviously worked really hard at getting to where they are.\n\"Clare, in particular, has had some significant injuries to overcome and obviously Ellie had a recent significant injury to overcome as well, so it's pleasing to see the determination they have to maintain their spot at the highest level.\"\nThe Matildas begin their FIFA Women's World Cup campaign at Sydney's Stadium Australia on July 20 against Ireland.\nReading this on mobile web? Download our news app. It's faster, easier to read and we'll send you alerts for breaking news as it happens. Download in the Apple Store or Google Play.",
  "word_count": 785,
  "scraped_at": "2026-02-14T13:27:34.181058"
}