{
  "article_id": "f9c1b8ea90bc",
  "url": "http://burgundywave.com/2024/06/04/uswnt-summer-olympics-prep-korea/",
  "title": "USWNT Summer Olympics Prep : Lady Yanks Ready for Second Friendly Against Korea Republic",
  "date": "20240604T193000Z",
  "domain": "burgundywave.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "SAINT PAUL, Minn. – The United States Women’s National Soccer (USWNT) and Korea Republic square off in the second leg of a two-game series at Allianz Field on Tuesday evening June 4. The game is set to kick off in the Twin Cities at 7 p.m. local / 6 p.m. MT and will be broadcast on TNT, TruTV, UNIVERSO, MAX, and Peacock.\nAlbeit a summer friendly, Team USA’s eight-day camp that started in Boulder, Colorado last Tuesday, which included a match on Saturday at DICK’S Sporting Goods Park Commerce City, Colorado with the Koreans, has significant ramifications for those players here dreaming of earning an invitation to represent the United States of America at the Summer Olympics.\nAfter the second match with South Korea, USA’s newest head coach, Emma Hayes, and her staff will huddle up and select 18 players plus an additional four alternates for the Summer Games which will start for the Yanks’ on July 25 in Nice, France. This match will be crucial to the USWNT Summer Olympics prep.\nTwenty-seven players are currently in camp and are showcasing both their versatility and innate talent for a one-of-a-kind job. Many international football pundits agree that this will be the most difficult roster to fill out as this group of women is one of the most accomplished and adept in decades.\nThe soon-to-be-unveiled 2024 Olympic Team will feature in the USA’s final two games before leaving for France, those taking place on July 13 at Red Bull Arena in Harrison, New Jersey against Mexico, and on July 16 at Audi Field in the nation’s capital.\nLeading the charge to make the team are Coloradans Lindsey Horan, Mallory Swanson, and Sophia Smith. The trio excelled during the Lady’s 4-0 victory over Korea on Saturday evening before nearly 20,000 high-energy patriotic fans.\nThe genuine team effort which combined fans and field players, song and dance, the win added to the record against the Korean Republic. The result pushed the series to 12W-0L-4D. The Stars and Stripes also remained unbeaten all-time in Colorado, improving to 8W-0L-1D in matches played in greater Metro Denver.\nAppearing to be back to her overachieving ways, Swanson scored a pair of goals and added an assist in front of the sold-out crowd. Her teammates Smith and Horan also ignited rounds of cheers throughout the match. Smith split the Korean defense to the point of their backline resorted to heavy-duty hip checks and slide tackles to keep the Real Colorado alum off balance.\nNevertheless, she took several shots on goal and ultimately picked up an assist when the ball found her left foot just above the penalty box in the 34th minute of play. In a flash, she sent the ball to a streaking Swanson who finished off the combination with a forceful strike at the right corner of the goal.\n“I couldn’t ask for anymore,” Hayes said during her post-match about Swanson’s outing. “She’s a player I’ve always admired, so to get the opportunity to coach and see firsthand the quality she possesses. She’s a connector. She’s magnetic, as a human being too, in the way she operates in the team.”\nThe manager continued, “She can multitask: She can do what she’s doing on the pitch, and she can listen on the sidelines. I noticed that about her today. Our goal is to keep her fit, keep her healthy, because she’s an important part of this team.”\nSwanson’s goal was her first in 465 days for the USWNT. She last scored against Brazil on February 22, 2023, in the SheBelieves Cup finale. Her brace was the sixth of her international career and her second for the USWNT in the Centennial State. The Highlands Ranch native had scored twice for the U.S. during a victory over Australia at DICK’S Sporting Goods Park in April 2019.\nLate in the second half, Swanson completed her worthy performance with her second goal.\nSubstitute Crystal Dunn forced a loose pass by Korea out of their final third and swift-footed Rose Lavelle intercepted the lost ball near midfield. Lavelle’s run into the final third drew enough defenders to allow space for Swanson to turn on her jets and also make a parallel. Lavelle’s pinpoint pass found Swanson in full stride and she easily swatted the ball low and inside the left post to close out the evening and cap off the 4-nil win.\nMore so, Swanson’s three-goal combinations (two goals, one assist) are tied for the second-most in a game in her international career. Saturday’s match was her eighth career game for the USWNT with at least one goal and one assist.\nHer remarkable comeback from her horrific knee injury months before last winter’s Women’s World Cup Soccer Tournament in New Zealand and Australia has put her in a dandy spot to make the Olympic Team.\nSmith’s assist to Swanson was the ninth of her burgeoning career and her second in 2024. Smith’s presence right in the middle of the attack is perfect for her style of play. When she played attacking wing during the Women’s World Cup she often appeared to be out of sorts and not firing on all cylinders. With Alex Morgan being on the cusp of making the Summer roster, or not, perhaps Hayes was auditioning Smith for the center striker position that Morgan has occupied for many seasons.\n“There were a lot of emotions going into it. I know I was nervous because it’s the first game with a new coach, playing in my hometown, said Smith during her time at the microphone after the game concluded.\nTeam Captain Lindsey Horan thrilled her fans with unbroken hustle and dominant box-to-box play.\n“Lindsey, she’s the captain for a reason,” Hayes said. “She’s a leader. She leads by example in so many ways. She was measured in her performance.”\nAfter the rout, Horan cooled down, put on a smile, and looped the inside of the field to meet and greet with her cherished supporters. She was the last player off of the pitch, and so, with only one boot. A very lucky young Horan booster earned one of her game-worn shoes, competing with an on-the-spot autograph.\nPhoto Credit: John Babiak\nThank you for reading Burgundy Wave. Support us via our Patreon starting at $5/month. We’re always looking for new talent. Let us know if you’re interested in covering Colorado Soccer.",
  "word_count": 1060,
  "scraped_at": "2026-02-14T13:30:24.505366"
}