{
  "article_id": "f9cf4ed53cc2",
  "url": "https://news.yahoo.com/megan-rapinoe-said-emotional-goodbye-005000517.html",
  "title": "Megan Rapinoe Said an Emotional Goodbye to the US Women Soccer Team after Her Final Match",
  "date": "20230926T020000Z",
  "domain": "news.yahoo.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Megan Rapinoe Said an Emotional Goodbye to the US Women’s Soccer Team after Her Final Match\n\"Hearst Magazines and Yahoo may earn commission or revenue on some items through these links.\"\n1985-present\nLatest News: Soccer Star Plays Final Match for USWNT\nMegan Rapinoe helped lead the United States Women’s National Team to a 2-0 victory over South Africa in her final cap for the red, white, and blue. Rapinoe didn’t score in the September 24 game but performed her iconic goal pose one final time at the behest of teammates and received a video tribute before tearfully addressing fans following the match. “I feel like I was able to grow up in front of you,” she said. “It has been such an honor to wear this shirt and play out my childhood dream.” Her family, friends, and fiancée, former WNBA star Sue Bird, were all in attendance. Still to come is her final game with Seattle’s NWSL team, OL Reign, which Rapinoe has played for since 2013. That final appearance is expected October 15.\nWho Is Megan Rapinoe?\nMegan Rapinoe is a soccer player who became a key member of the USWNT. With Rapinoe’s help, the team won two World Cup titles, in 2015 and 2019, and an Olympic gold medal in 2012. Her dominant performance in the 2019 World Cup earned her the Golden Boot for most goals scored and the Golden Ball for being the top player in the tournament. That year, she was also named FIFA’s Women’s World Player of the Year. Rapinoe is also an outspoken activist. She was one of the first soccer players to announce she was gay and has publicly supported LGBTQ rights, racial justice, and equal pay.\nQuick Facts\nFULL NAME: Megan Anna Rapinoe\nBORN: July 5, 1985\nBIRTHPLACE: Redding, California\nASTROLOGICAL SIGN: Cancer\nEarly Life, Family, and Soccer Start\nMegan Anna Rapinoe was born on July 5, 1985, in Redding, California, 11 minutes after her fraternal twin sister, Rachael. Rapinoe also grew up in the conservative northern California town. Her mother, Denise, is a server. Her father, Jim, worked as a contractor.\nRapinoe grew up as the youngest of six. Around the age of 5, Megan and Rachael followed in their older brother Brian’s footsteps and began playing soccer. The two turned out to be gifted players. Because there were no girls teams where they lived, they first joined a boys soccer team.\nRapinoe attended Foothill High School where she ran track and played basketball in addition to soccer. While in high school, Rapinoe hoped her soccer skills would earn her a college scholarship, which the University of Portland ended up providing. She also played for U.S. Soccer’s Under-17 youth team and delayed college enrollment to join the Under-19 team.\nRapinoe began at the University of Portland in January 2005 and helped the school’s women’s soccer team win the NCAA Division I Championship that year. In July 2006, she played for the U.S. Women’s National Team for the first time in a game against Ireland. She also remained part of the University of Portland’s team, though ACL injuries to her left knee took her out of action in 2006 and 2007.\nRachael also excelled at soccer through college, though she didn’t reach the very highest level of the sport alongside Megan. The two remain close. Rapinoe has also maintained a tight bond with her brother Brian, who was arrested for bringing methamphetamine to high school when he was 15 years old and has been in and out of jail several times while battling drug addiction. The soccer star even gave him a birthday shoutout following the 2019 World Cup final.\nU.S. Women’s National Team and Club Teams\nRapinoe plays forward and is known to strike a unique celebratory pose—widespread arms, head tossed back, and proud grin—when successful on the field. She rejoined the U.S. women’s national team in 2009. In 2011, she participated in her first World Cup. She amazed the world during one match by sending the ball on a breathtaking cross-field journey to teammate Abby Wambach, who then scored and tied the game just before the clock ran out. Although the U.S. women lost the World Cup final in 2011, Rapinoe was there when they won gold at the 2012 Olympic Games in London.\nBesides playing on the national team, Rapinoe was brought into different soccer clubs. She joined the Chicago Red Stars in 2009, before playing with the Philadelphia Independence, Florida’s magicJack, and Australia’s Sydney FC. In 2013, she played in France with Olympique Lyonnais. By 2014, Rapinoe returned to the National Women’s Soccer League with a spot on the OL Reign roster in Seattle.\nIn 2015, Rapinoe and the U.S. women’s team won the World Cup. She suffered an ACL injury in her right knee that December but still became part of the Olympic team in 2016. However, the U.S. women didn’t medal at those Games.\nWhen the U.S. women again headed to the World Cup in 2019, Rapinoe was named co-captain. During the event, she became headline news following the release of a video, made months earlier, in which she declared that even if the team won and received an invitation, “I’m not going to the f––ing White House.” Then-President Donald Trump responded with taunts on Twitter, but the resulting pressure didn’t disrupt Rapinoe’s game. She scored two goals in the next quarterfinal match and led the team to World Cup victory. Afterward, Rapinoe was true to her word and avoided the White House.\nAt the end of the 2019 tournament, she won the Golden Boot for scoring the most goals and the Golden Ball for being the top player throughout the World Cup. That year, she was also named FIFA’s Women’s World Player of the Year.\nRapinoe was part of the USWNT for the 2020 Olympic Games, held in Japan the following summer due to a COVID-19 pandemic delay. She scored twice in the third-place match, as the U.S. left the Games with a disappointing bronze medal. However, the star forward didn’t make the roster for the 2022 SheBelives Cup, a four-team international tournament.\nRetirement\nIn late June 2023, U.S. head coach Vlatko Andonovski announced Rapinoe would be part of the team’s 23-player roster for that year’s World Cup hosted by New Zealand and Australia beginning in July. “She is going to have different types of minutes [compared to previous World Cups], but her leadership role is so important and her performance on field is very valuable for us,” Andonovski said.\nSoon after on July 8, Rapinoe announced that she would retire from playing competitive soccer at the end of the 2023 season, making the World Cup her last with the national team. “I never could have imagined the ways in which soccer would shape & change my life forever,” she said in a tweet sharing her decision. Unfortunately, the team recorded a disappointing result with only one victory in four matches and was eliminated with a loss to Sweden in the round of 16.\nRapinoe played her final match with the USWNT at Chicago’s Soldier Field on September 24, a 2-0 win in a friendly against South Africa. Her roughly 17-year tenure included 203 caps, and she scored 63 goals over those matches. She is expected to play her final home game with OL Reign on October 6, with the last game of the season on October 15.\nFight for Equal Pay\nHistorically, male soccer players in the United States often made more money than women, though the women’s national team has been more successful. As a result, Rapinoe and others battled for equal pay. In 2016, she and four other teammates filed a federal labor complaint against U.S. Soccer for wage discrimination.\nAfter the labor complaint stalled, Rapinoe was one of 28 players who filed a lawsuit in March 2019 against the U.S. Soccer Federation for pay discrimination. The suit was dismissed by a federal judge in May 2020. An agreement was then reached in December 2020 between U.S. Soccer and the women’s team to improve and bring parity to working conditions.\nRapinoe visited President Joe Biden and First Lady Jill Biden at the White House to commemorate Equal Pay Day in March 2021. At the event, she stated, “You see, despite all the wins, I’m still paid less than men who do the same job that I do.” That June, a documentary called LFG about the fight for equal pay for female soccer players released on HBO and included interviews with Rapinoe.\nIn February 2022, Rapinoe and teammate Alex Morgan were among the five players that reached a $24 million settlement with the U.S. Soccer Federation stemming from their 2016 complaint. According to the terms of the agreement, U.S. Soccer agreed to pay male and female players at an equal rate in all future friendlies and tournaments, including the World Cup. “For us, this is just a huge win in ensuring that we not only right the wrongs of the past but set the next generation up for something we only dreamed of,” Rapinoe told NBC’s Today.\nOther Activism: LGBTQ Rights and Racial Justice\nFor Rapinoe, there isn’t a divide between sports and activism. “I think the premise that athletes shouldn’t be political is just wack,” she said in 2020. “Politics is gonna engage with you whether you engage with it or not.” In addition, she asserted later that year, “I feel a responsibility to do what I can with what I have to try to make the world better in whatever way I’m able to.” She has been outspoken about several social issues, most notably LGBTQ rights and racial justice.\nLGBTQ Rights\nRapinoe, who realized she was gay while in college, publicly came out in July 2012, ahead of the Olympic Games. She was one of the first soccer players to do so. She made the decision because, “it became very weird and not very authentic for me not to be out.” Rapinoe has since continued to support LGBTQ rights. In March 2021, following state legislation that would block trans children from playing school sports, she wrote in an opinion article, “I believe that all kids, including transgender youth, should be able to participate in sports they love.”\nIn July 2023, Rapinoe was critical of policies aiming to ban transgender women from competing in women’s sports. In an interview with Time, she said she would “absolutely” welcome a transgender woman to the U.S. team. “The most amazing thing about sports is that you play, and you’re playing with other people, and you’re having fun, and you’re being physically active,” she said. “We’re putting this all through the lens of competition and winning. But we’re talking about people’s lives. That’s where we have to start.”\nRacial Justice\nIn August 2016, Colin Kaepernick of the San Francisco 49ers began kneeling during the national anthem at NFL games to protest racial injustice. Rapinoe decided to make the same gesture a week after Kaepernick’s initial action, becoming the first well-known white athlete to kneel at her games. She said, “I have chosen to kneel because I simply cannot stand for the kind of oppression this country is allowing against its own people.” She further explained, “Being a gay American, I know what it means to look at the flag and not have it protect all of your liberties.”\nRapinoe’s actions resulted in hate mail, and though her national contract wasn’t canceled, she was taken off the team roster. She didn’t play again until April 2017, after U.S. Soccer instituted a rule that required all players to stand for the anthem. She obeyed the directive, though she didn’t sing, while it was in effect. (It was repealed in June 2020.) Rapinoe has acknowledged that her career has since thrived, while Kaepernick hasn’t played for the NFL since 2017.\nSome members of Rapinoe’s family didn’t understand her decision to kneel during the national anthem. Her father’s vote for Trump in 2016 alienated Rapinoe and her twin, who is also gay, though they reconciled at a family gathering.\nDrawing on experience with her older brother, Rapinoe has spoken out about the need for changing how the law deals with addicts. She endorsed Elizabeth Warren for president in 2020; conducted an Instagram Live session with U.S. Representative Alexandria Ocasio-Cortez to explain the impact of the CARES Act, a COVID-19 pandemic relief law; and supported the Democratic candidates in Georgia’s 2021 Senate runoff elections.\nPresidential Medal of Freedom\nBecause of her role in the U.S. team’s success and dedication to equal pay and other causes, Joe Biden presented Rapinoe with the Presidential Medal of Freedom in July 2022. She became the first soccer player to receive the honor and only the sixth female athlete or coach in any sport. Other recipients that year included Olympic gymnast Simone Biles and actor Denzel Washington. “Beyond the World Cup title to Olympic medals, Megan is a champion for the essential American truth that everyone, everyone, is entitled to be treated with dignity and respect,” Biden said.\nRelationship with Sue Bird\nRapinoe’s former romantic partners include Australian football player Sarah Walsh and musician Sera Cahoone. She and Cahoone were engaged, but Rapinoe ended the relationship.\nShe next became involved with star WNBA player Sue Bird, whom she met at the 2016 Olympics in Rio. When Rapinoe was left off the team roster following her decision to kneel for the national anthem weeks later, Bird supported her. Rapinoe also credits Bird with helping her follow a diet and exercise regimen that got her in better shape at that time: “I really did transform. From a career standpoint, I owe so much to her.”\nThe couple moved in together in 2018. During the COVID-19 pandemic, Rapinoe joined Bird in the WNBA bubble in Florida in 2020 so the two wouldn’t have to be separated. Rapinoe and Bird announced their engagement in October 2020.\nIn December 2022, Rapinoe and Bird launched their own production company called A Touch More, with projects to focus on people who shape and move culture forward. Earlier in the year, Bird retired from the WNBA.\nHistoric Media Appearances and Book\nIn 2018, Rapinoe and Bird appeared on the cover of ESPN The Magazine’s Body Issue, the first openly gay couple to do so. In 2019, Rapinoe was the first out lesbian to show up in the Sports Illustrated Swimsuit Issue. She was named Sports Illustrated Sportsperson of the Year that same year.\nRapinoe’s one-hour HBO special, Seeing America with Megan Rapinoe, was released in August 2020. She was also one of the hosts for the ESPYs in 2020 and appeared in the reboot of The L Word. That November, Rapinoe published a memoir called One Life, which became a New York Times bestseller. Soon after, it was reported that Sony Picture Studios planned to adapt the memoir into a scripted television series.\nSponsorships and Lifestyle Brand\nRapinoe has been sponsored by Nike, Samsung, and Vitamin Water. Her endorsement deals include Schmidt’s deodorant and Victoria’s Secret. The organization Rapinoe SC sets up sports clinics, and Rapinoe co-founded a lifestyle brand called re-inc.\nQuotes\nWhen I look at the flag, what I want to see is us constantly trying to live up to these words and live up to this ideal where all people are free and all people do have all of their rights.\nI see patriotism as constantly demanding better of ourselves.\nI’m from Trump country. But I’m able to travel the world and live in very liberal places now. I am sort of in all the worlds at once.\nBeing a gay American, I know what it means to look at the flag and not have it protect all of your liberties.\nI feel a responsibility to do what I can with what I have to try to make the world better in whatever way I’m able to.\nFact Check: We strive for accuracy and fairness. If you see something that doesn’t look right, contact us!\nYou Might Also Like",
  "word_count": 2669,
  "scraped_at": "2026-02-14T12:15:17.606512"
}