{
  "article_id": "f9da555ab9da",
  "url": "https://metro.co.uk/2024/05/19/josh-kroenke-sends-positive-message-arsenal-fans-ahead-transfer-window-20867908/",
  "title": "Josh Kroenke sends positive message to Arsenal fans ahead of transfer window",
  "date": "20240519T120000Z",
  "domain": "metro.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Arsenal co-chairman Josh Kroenke has vowed to strengthen Mikel Arteta’s first team squad this summer, regardless of the outcome of the final day of the Premier League season.\nThe Gunners retain a slim hope of a first title in 20 years, but will require a favour from West Ham if they are to finally topple Manchester City and deny them a fourth straight crown.\nHaving already amassed more points than last season and set a club record for the number of wins in a single campaign, progress has undoubtedly been made again under Arteta.\nKroenke, the son of the club’s owner Stan Kroenke, insists the club will not stand still in their pursuit of football’s biggest prizes and hinted at another exciting summer of transfer activity.\nHe said: ‘While we are undoubtedly proud of the progress we have made, I want to be clear that no one at the club will stand still. However things finish today, we’re all working behind the scenes to move us forward – always forward – again.\n‘There is so much that we want to achieve, both at home and in Europe, and we are focused on writing some exciting new stories and chapters that build on the history of Arsenal Football Club.\n‘There have been so many stories and milestones across the season, shaped by so many of our players.\nGet your football fix\nDon't want to miss the week's biggest football stories? Metro's exclusive football newsletter, In The Mixer, is your essential guide.\nFrom the latest transfer rumours and managerial moves to analysis of the biggest games and a lot more, our experts have you covered.\nSign up here, it's an open goal.\n‘We have all enjoyed seeing our summer signings flourish into being Arsenal players and we’re delighted that a number of players have committed to new contracts to keep this squad together, fighting on all fronts. We want to continue to forge that winning mentality that runs so deeply throughout the club.’\nKroenke also made time to highlight the outstanding achievements of the women’s team which continues to thrive under Jonas Eidevall and will host 11 games at the Emirates Stadium next season.\nMore Trending\n‘Of course, it isn’t only our men’s team who have made great strides this season,’ he said.\n‘Winning the Continental Cup back-to-back and securing European qualification while continuing to be pioneers in the game.\n‘We are all so proud of our women’s team. To set three new attendance records and sell out Emirates Stadium twice is an incredible achievement.\n‘And there is so much more to come next season, with 11 women’s games planned for Emirates Stadium and a season where we’ll challenge for major trophies once again. Our sporting director, Edu, will continue to innovate and develop our men’s, women’s and academy football.’\nMORE: Brighton vs Man Utd: Confirmed team news, injury latest and predicted lineups\nMORE: Chelsea vs Bournemouth: Confirmed team news, injury latest and predicted lineups",
  "word_count": 493,
  "scraped_at": "2026-02-14T13:13:19.744519"
}