{
  "article_id": "f9dff9518cc0",
  "url": "https://www.thenews.com.pk/latest/1111144-iranians-give-ronaldo-ecstatic-welcome-amid-mahsa-aminis-anniversary",
  "title": "Iranians give Ronaldo ecstatic welcome amid Mahsa Amini anniversary",
  "date": "20230918T193000Z",
  "domain": "thenews.com.pk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Iranians give Ronaldo ecstatic welcome amid Mahsa Amini's anniversary\nRonaldo´s arrival has sparked a debate over Iran´s internet restrictions affecting citizens protesting Mahsa Amini's death\nCristiano Ronaldo was enthusiastically welcomed by crowds of Iranian football supporters on Monday as his Saudi squad landed in Tehran for the first home-and-away club match in the wake of Mahsa Amini's death anniversary.\nFans chanted the name of the Portuguese five-time world player of the year as he arrived with his Al Nassr teammates to face Iran´s leading club Persepolis in the Asian Champions League on Tuesday.\nThe match will be the first since Tehran and Riyadh reached a China-brokered deal that was announced in March.\nTeams from both countries had only played matches on neutral grounds since 2016 when Saudi Arabia and Iran severed ties, AFP reported.\nIn Tehran, excitement filled the air as fans eagerly waited to catch a glimpse of 38-year-old Ronaldo as he left Iran´s Imam Khomeini´s airport with his teammates.\n\"It was a very good feeling, and we all enjoyed it,\" Al Nassr manager Luis Castro said in his press conference.\n\"We saw a series of scenes and many Iranian fans were even holding Al Nassr team shirts, which was a pleasant event for us.\"\nLarge crowds of cheering fans lined the streets as Ronaldo arrived at a hotel in Tehran on board the team bus.\nOthers chanting \"Ronaldo, Ronaldo!\" even flooded into the hotel lobby.\nPosters of the former Manchester United, Real Madrid and Juventus star with \"Welcome\", written in Arabic, English and Farsi sprung up in the Iranian capital´s main streets.\nSadly for the fans, none will be allowed to attend the match which will be held at the gigantic Azadi stadium, which can host up to 90,000 people.\n'Unlimited internet'\nRonaldo and his teammates have been placed under the protection of an \"elite unit\", specialised in securing presidential visits, according to sports website Varzesh 3.\nThe unit will be in charge of \"preventing any contact between fans and players of the Saudi team,\" it added.\nRonaldo´s arrival has also sparked a debate over Iran´s internet restrictions.\nIran has imposed strict curbs — including on WhatsApp and Instagram — since last year´s mass protests triggered by the death in custody of Mahsa Amini.\nAmini, a 22-year-old Iranian Kurd, had been arrested for allegedly violating the Islamic Republic´s dress code for women.\nLast week, Persepolis´s general manager Reza Darvish proposed that the Saudi team be given SIM cards with unfiltered internet access.\n\"I have talked to the CEO of Irancell (a local provider and sponsor to Persepolis) and asked for SIM cards for... players and those who accompany them with unlimited internet,\" he said.\n-\nBreezy Johnson engaged at Olympics after emotional finish line proposal\n-\nOlympics men hockey game: McDavid, Crosby power Canada past Czechia\n-\nEx-Arsenal footballer Thomas Partey charged with additional rape counts\n-\nChloe Kim set for historic halfpipe gold showdown at Milano Cortina\n-\nVladyslav Heraskevych disqualified from Winter Olympics 2026 over helmet controversy\n-\nThomas Tuchel set for England contract extension through Euro 2028\n-\nMilano-Cortina 2026: Assessing Italy’s Winter Olympics economic growth\n-\nVictor Wembanyama’s historic first half tops Tim Duncan, sparks massive NBA reactions",
  "word_count": 534,
  "scraped_at": "2026-02-14T13:51:06.402664"
}