{
  "article_id": "fa31b923c30c",
  "url": "https://www.independent.co.uk/arts-entertainment/tv/news/new-gladiators-bbc-show-uk-b2478117.html",
  "title": "Meet the new Gladiators facing off against contenders on rebooted BBC game show",
  "date": "20240113T161500Z",
  "domain": "independent.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Meet the Gladiators facing off against contenders on rebooted BBC game show\nBBC reboot premieres tonight with an all-new line-up of elite athletes\n- Bookmark\n- CommentsGo to comments\nThe BBC’s Gladiators will return to our screens on Saturday 13 January, with an all-new arena, enthusiastic contenders, and the formidable super athletes they will face off against.\nThe broadcaster announced that it was reviving the sports entertainment show, which first premiered in the UK on ITV in 1992, last year.\nA 2024 release date was announced during the final of Strictly Come Dancing last December. The BBC later confirmed it would release on the second Saturday in January.\nThis year’s line-up of Gladiators comprises 16 new “superhumans” who will take on contenders in both new and old games.\nEach Gladiator has been given a nickname, which describes them. This year’s elite athletes include Apollo, Athena, Legend, Fire, Bionic, Diamond, Nitro, Electro, Giant, Steel, Comet, Viper, Fury, Phantom, Sabre, and Dynamite.\nSabre\nSheli McCoy, who has competed in five British weightlifting championships and can deadlift 160kg, will appear as Sabre.\nMcCoy recalled being inspired by original female Gladiators, including British gymnast Kim Betts (Lightning) and British former heptathlete Judy Simpson (Nightshade), when she watched the show as a young girl.\n“I remember thinking that I didn’t think women were allowed to be sporty and into fitness and have muscles and win and be unapologetically athletic, and that’s what they were, these women were unapologetically athletic,” she said.\nDynamite\nEmily Steel, a 20-year-old full-time CrossFit athlete, will be known as Dynamite. Her secret weapon is also super strength, as Steel can lift 160kg, or six cement bags, in one go.\nWatch Apple TV+ free for 7 day\nNew subscribers only. £9.99/mo. after free trial. Plan auto-renews until cancelled.\nADVERTISEMENT. If you sign up to this service we will earn commission. This revenue helps to fund journalism across The Independent.\nWatch Apple TV+ free for 7 day\nNew subscribers only. £9.99/mo. after free trial. Plan auto-renews until cancelled.\nADVERTISEMENT. If you sign up to this service we will earn commission. This revenue helps to fund journalism across The Independent.\nShe has previously teased some of the show’s competitions, including The Edge and Collision.\n“[The Edge] is so high up in the sky with a net underneath and you’re literally playing cat and mouse up on this maze – until the Gladiator pushes the contender off the Edge into the net,” Steel revealed.\n“Collision... that’s a very fun one. I felt like a little kid on a playground,” she continued. “That’s where the Contenders run across the bridge and we swing in from the trapeze to knock them off. I loved just swinging at someone, it was so fun.”\nFire\nTeam GB sprinter and Olympic bobsledder Montell Douglas will star as Fire on the show. The speedy Gladiator can run 100m in 11.05 seconds – blink and you might miss her!\nShe said the BBC revival has stayed true to the original ITV show, adding: “I hope Gladiators will be what everyone remembers because it has the same feel as the Nineties show, just in 2024.\n“You get the same the feeling you had when you heard the announcement ‘Gladiator’s Ready’ and the music come on, I hope the audience at home agree.”\nLegend\nMatt Morsia, a fitness influencer whose YouTube videos attract thousands of views, will go by Legend. His superhuman talent is that Legend can triple jump over 50 feet, which is higher than a double decker bus.\nAppearing on Gladiators has been a “lifelong ambition”, Morsia said.\n“It’s always been a life goal of mine. I watched the original Gladiators as a kid so from the age of nine or 10 years old, I wanted to be a Gladiator,” he continued. “It’s been a lifelong ambition, I guess.”\nApollo\nAlex Gray, who previously played in the England rugby sevens team before transferring to the NFL in the US, will be called Apollo.\n“Like Superman but with a sense of humour”, Apollo said of himself. He can jump 2.8m from standing, or roughly the length of a ping-pong table.\nGray said he was “absolutely mad” for the original show, adding: “My mum says all plans were cancelled for the Saturdays that Gladiators was on TV, as there would be absolute hell to pay if me and my brothers couldn’t watch it.”\nGiant\nJamie Christian Johal will appear as Giant, earning his name as he stands tall at 6ft 5in and fuels himself with 10,000 calories a day.\nGiant has an unlikely connection to the first iteration of the Gladiators, after forging a friendship with Helen O’Reilly, the athlete known as Panther on seasons one to five of the ITV series.\n“My favourite female Gladiator was Panther,” Johal said. “Fun fact for you... Panther and I became friends through a bodybuilding federation, which I did from my early twenties into my early thirties.”\nNitro\nTeam GB sprinter Harry Aikines-Aryeetey, whose biceps have a diameter of 44cm, has been nicknamed Nitro.\nNitro, who can do a standing vertical jump of 42 inches, describes his avatar as “pure energy”.\nThe athlete from London continued: “He’s explosive by nature and he does everything with a smile on his face. Nitro’s there to bring the good vibes. He’s not shy. He’s bringing that energy for the contestants as well as for himself. The crowd fuels him, so if you give him energy, he gives you energy back.”\nDiamond\nA six-ft-tall bodybuilder from Worcestershire, Livi Sheldon will be known as Diamond.\nExplaining that she can squat 120 kg, or the equivalent of standing up with a jaguar on your back, Sheldon said her best traits are her strength and power.\n“She’s also incredibly quick too. Diamond, is unbreakable; she’s strong, powerful, and versatile,” Sheldon added.\nAthena\nKarenjeet Kaur Bains, who is the Commonwealth powerlifting champion, will go by Athena.\nOn her motivation to become a Gladiator, Bains explained that she wanted to be a role model for the next generation.\nThe Indian-British powerlifter said: “Coming from a diverse minority background, I’ve always dreamt of having a platform to inspire the next generation.\n“What could be better than a sports entertainment programme like Gladiators? It’s iconic, so I couldn’t have asked for anything better.”\nComet\nElla-Mae Rayner, a former elite gymnast turned diving enthusiast, is nicknamed Comet.\nRayner, who loves to walk on her hands, described Comet as the embodiment of “femininity and strength”.\n“Comet is feminine; she is a perfectionist, very poised, and very elegant,” she said. “She encompasses femininity and strength combined. She is always smiling and friendly, but she’s not someone to be underestimated, because she has her strengths and the games she competes in, she excels in.”\nBionic\nBodybuilder Matty Campbell, who can deadlift 300kg, has acquired his name Bionic due to both his strength and height. He stands tall at 6ft 6in.\nCampbell revealed that he has a “fun, love-hate relationship” with Gladiators referee Mark Clattenburg, who is a former Premier League football referee.\n“Me and Mark have a fun, love hate relationship because he’s a Newcastle lad and I’m from Middlesbrough and the whole football rivalry, especially with him being a former ref,” Campbell explained. “We’re always messing about backstage.”\nPhantom\nElsewhere, 6ft5ins British bobsledder Toby Olubi has been given the title of Phantom.\nPhantom, who has the longest wingspan of all the Gladiators at 2 metres, said the new series is “explosive, evolutionary, epic and unmissable”.\nHe described his character as a “trump or Joker card” in the competition.\n“Phantom is a mysterious, elusive character that is a hybrid of all the Gladiators as well,” the London-based athlete said. “I’m like a trump or Joker card, because if you think about all the things that I’m good at, everyone else has as their main strength.”\nElectro\nSports model, fitness coach and hybrid athlete Jade Packer, who trains in CrossFit, has been named Electro.\nElectro’s calling card is that she can squat 100 kgs, which is the same weight as about 12 watermelons, without breaking a sweat.\nAsked to sum up the new series in one word, Electro replied: “I would use the term ‘nostalgia’.”\n“This series reflects the original series, but in an amped up modern way. It gives that nod to the original series but while also being something completely different,” she added. “I feel like the Gladiators all look very different to the original Gladiators line up in terms of representation and having different stories and different backgrounds.”\nViper\nBodybuilder Quang Luong, nicknamed Viper, said he was “born to be a Gladiator”.\nViper, who can bench press the weight of an adult panda, has crowned himself the show’s villain – just as Michael Van Wijk’s Wolf did on the original series.\nThe Surrey-based athlete ominously described his chartacter as “mean, moody, sneaky and powerful”.\nFury\nJodie Ounsley, who is nicknamed Fury, is looking to keep her family legacy alive with her stint on Gladiators. Her dad took part as a contender in a previous series.\nFury, who is the first-ever deaf Gladiator, said: “I loved watching how physical the Gladiators were but then I also loved watching my dad go through the process as well, so he’s clearly been a massive influence and it’s pretty cool that I can do it too.”\nSteel\nCrossFit star Zack George, who won the title of the UK’s Fittest Man in 2020, completes the line-up as Steel.\nThe self-described “Mr Nice Guy”, Steel can lift 220 kgs, which is about the same as three-and-a-half washing machines.\nHe said appearing on the show is “like a dream come true” because he idolised the original Gladiators when watching them compete on the first iteration.\n“I watched the original series, and at that time, I was extremely overweight, very self-conscious and I didn’t really like how I looked,” George said. “I remember looking at the Gladiators and thinking that they are absolute superheroes, so to even one day potentially look like them – let alone actually become a Gladiator – is like a dream come true.”\nGladiators premieres on BBC One at 5.50pm on Saturday 13 January.\nAdditional reporting on wires.\nJoin our commenting forum\nJoin thought-provoking conversations, follow other Independent readers and see their replies\nComments",
  "word_count": 1710,
  "scraped_at": "2026-02-14T12:41:25.906479"
}