{
  "article_id": "fa318428124f",
  "url": "https://www.gcis.gov.za/newsroom/media-releases/statement-cabinet-meeting-4-december-2024",
  "title": "Statement on the Cabinet Meeting of 4 December 2024 | Government Communication and Information System ( GCIS ) ",
  "date": "20241205T183000Z",
  "domain": "gcis.gov.za",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "A. Issues in the environment\n1. Group of Twenty (G20) Summit\n1.1. South Africa officially assumed the Presidency of the G20 on 1 December 2024, making it the first country on the African continent to lead the premier forum. The theme of G20 South Africa is “Solidarity, Equality, Sustainability”.\n1.2. Hosting the G20 offers our nation an unprecedented opportunity to position South Africa as a global force for driving Inclusive Economic Growth, Employment and Reduced Inequality in a sustainable manner.\n1.3. We anticipate an economic boost in areas such as tourism and hospitality, as the participants, their support staff and families attend the more than 130 meetings before the Leaders’ Summit.\n1.4. All provinces will benefit from hosting either the Ministerial or Working Group meetings. Following in the footsteps of Brazil, South Africa will host the G20 Social for broader participation of civil society and introduce a new engagement group Township20 (TS20) to highlight the creative, cultural, financial and innovative capacities of South Africa’s township economies. Further details of both the G20 Social and TS20 will be shared in due course.\n1.5. The first working group meetings of The Sherpas, and Finance and Central Bank Deputies will take place from 9 to 10 December 2024 and 11 to 12 December 2024 in Gauteng. For more information on G20 South Africa – go to www.G20.org\n1.6. Cabinet invites potential sponsors to partner with government in sponsoring G20 South Africa. Interested parties are invited to forward their expression of interest to g20sponsorship@dirco.gov.za by 31 March 2025.\n2. Economy\n2.1. Quarterly Labour Force Survey – Quarter 3 of 2024\n2.1.1. Cabinet welcomes the positive trend in the country’s employment figures, which shows that the number of employed people increased by 294 000 to 16.9 million in the third quarter of 2024, with the unemployment rate declining to 32.1% from 33.5% in quarter two. The largest increases in employment were observed in the Eastern Cape (83 000), Western Cape (75 000), North West (69 000) and Mpumalanga (49 000).\n2.1.2. Importantly, the total number of unemployed youth (age 15 to 34) decreased by 171 000 to 4,8 million while employed youth registered an increase of 66 000 to 5,8 million. Similarly, the number of employed women increased by 97 000 to 7,5 million.\n2.1.3. The positive employment trend is a result of concerted efforts and interventions which began during the Sixth Administration through the implementation of the Economic Reconstruction and Recovery Plan (ERRP) which are starting to yield results.\n2.2. Quarter 3 gross domestic product (GDP) decline in the midst of Positive Economic Outlook\n2.2.1. Cabinet noted the decline in GDP by 0.3% in the third quarter of 2024, with the largest decline of 28.8% recorded in the agriculture, forestry and fishing industries, which may indicate the impact of drought as Statistics South Africa reports that the decline is primarily due to decreased economic activities for field crops.\n2.2.2. Despite the third quarter GDP decline, Cabinet welcomed the positive economic outlook by the International Monetary Fund and rating agency Standard & Poor's (S&P) as the impact of the coordinated reforms implemented by Operation Vulindlela start to bear fruits.\n2.2.3. S&P also upgraded Eskom's long-term global scale foreign and local currency ratings from stable to positive, which indicates the progress made by government in strengthening Eskom’s financial and operational foundation through the work of National Energy Crisis Committee, Eskom Board and Executive team.\n2.2.4. Cabinet further welcomed the decision by the South African Reserve Bank to cut the repo rate by another 25 basis points from 8% to 7.75%. The lower interest rate will continue to ease the burden on highly indebted consumers and mitigate the high cost of living whilst also encouraging businesses to expand their operations to further stimulate economic activity.\n2.3. Investment\n2.3.1. Cabinet welcomes the announcement by Saudi Arabia to invest R9.5 billion to build a platinum smelter and base metals refinery in the Waterberg region in Limpopo.\n2.3.2. This new investment is a strong vote of confidence in our nation and builds on the first phase of our investment mobilisation drive under the Sixth Administration that saw our nation surpassing its investment target by 26% to reach a total of R1,51 trillion in investment pledges. South Africa is now targeting R2 trillion in new investments over another five-year period between 2023 and 2028.\n2.4. South African Airways (SAA)\n2.4.1. Cabinet commends SAA’s strong performance, highlighting the airline’s significant progress towards financial sustainability. For the first time since 2012, the SAA has recorded a net profit of R252 million for the 2022/23 financial year and group revenue increased from R2 billion to R5.7 billion.\n2.4.2. Remarkably, SAA achieved this milestone while operating with only six to eight aircraft across nine destinations at the beginning of the 2022/23 financial year. The airline has since doubled its fleet, launched intercontinental routes, and increased its network to 16 destinations.\n3. Interventions Against Foodborne Illnesses\n3.1. Since President Cyril Ramaphosa’s announcement on 15 November 2024 of interventions against foodborne illnesses, nearly 200 000 spaza shops have been visited while more than 1 000 spaza shops, supermarkets and warehouses have been closed down. Large quantities of goods have been confiscated and numerous fines have been issued for violations of by-laws. There will be added scrutiny of manufacturers of foodstuffs and pesticide Terbufos to ensure that proper controls are adhered to.\n3.2. The National Joint Operational and Intelligence Structure continues to coordinate government’s responses.\n3.3. The departments of Small Business Development and Trade, Industry and Competition are finalising the setting up of the Small and Medium Enterprise Fund (R500 million) to support South African-owned townships and rural businesses as soon as they meet the compliance requirements.\n3.4. Cabinet reminds all spaza shops and all food-handling facilities that they are required to register with their municipality within 21 days from 15 November 2024 and to meet required health standards or face closure.\n3.5. Cabinet calls on all South Africans to remain vigilant when purchasing food items, especially not to purchase items that have passed their expiry date. Let us make it our responsibility to educate our children about food safety, including teaching them to check the labelling themselves. Vendors and food producers are also urged to adhere to strict hygiene practices, including proper food storage, thorough cooking and maintaining clean food preparation areas.\n3.6. Cabinet calls on anyone who sees counterfeit foodstuffs and expired items being sold in communities to report this to the National Consumer Commission on 012 065 1940.\n4. Safety and Security\n4.1. Crime statistics and continued fight against crime\n4.1.1. Cabinet welcomed the release of the second quarter crime statistics, which show that law-enforcement agencies efforts to turn the tide in the fight against crime are starting to yield results with a decrease in both murder and violent crimes.\n4.1.2. The murder rate in South Africa has decreased by 5.8%, while sexual offences decreased by 2.5%, and robbery with aggravating circumstances decreased by 8.8%. Additionally, rape decreased by 3.1% while robbery at residential premises and non-residential premises decreased by 1.3% and 21.1% respectively.\n4.1.3. Cabinet also welcomed the arrest of a 39-year-old Mexican national for dealing in and manufacturing drugs as well as contravening the Immigration Act, 2002 (Act 13 of 2002) after a multi-disciplinary operation guided by police led to the discovery of a drug laboratory in Rietfontein, Johannesburg, valued at approximately R100 million. In addition, the South African Police Service, through an intelligence-driven operation, confiscated a container carrying cocaine with an estimated street value of around R86.5 million that came in from Brazil through the Durban Harbour.\n4.1.4. In addition, five suspected ATM bombers were killed in a shootout with police in eMalahleni, Mpumalanga. The suspects opened fire on the police after they were cornered at a safe house in Schoongezicht in Emalahleni.\n4.1.5. Cabinet calls on all sectors of society to partner with the police to strengthen the fight against crime. By working together, we can create safer communities and public spaces while ensuring criminals have no place to hide.\n5. Inaugural National Construction Summit\n5.1. Cabinet welcomes the inaugural National Construction Summit held on 19 November 2024 by the Department of Public Works and Infrastructure to create crime free construction sites. The summit brought together stakeholders from government in public works and infrastructure, police, treasury as well as those in the built environment, to reflect on and agree on a common approach to ending violence and extortion at construction sites, which severely delay government’s large scale infrastructure projects.\n5.2. Cabinet noted the signing of the Durban Declaration as an effort to build confidence in government’s ability to deliver projects on time and within budget in its quest to turn South Africa into a construction site.\n5.3. The declaration proposes a series of interventions to end the disruptions at construction sites to be implemented over the course of the next year. This includes strengthening legislation governing the construction industry, implementing appropriate policies for the development of the construction industry, improving data and reporting systems, and the arrest and prosecution of those responsible for extortion on construction sites.\n5.4. Work will also begin on supporting emerging enterprises and ensuring greater skills development. There will also be an intensified focus on collaboration on solutions to problems faced by the construction industry, which will be enhanced by establishing collaborative platforms for industry stakeholders to share best practices.\n6. Engagement with Traditional Leaders\n6.1. Cabinet noted the recent successful engagement between government and the National House of Traditional and Khoi-San Leaders aimed at strengthening collaboration and addressing key issues that affect rural communities that are represented by traditional leaders.\n6.2. The gathering provided an opportunity to promote constructive dialogue on matters related to the institution traditional leadership and communities, including an update on the Traditional and Khoisan Leadership Bill that was gazetted on 29 November 2024 for public comments.\n6.3. The engagement forms part of ongoing work by the Inter-Ministerial Task Team (IMTT) set up by President Ramaphosa and chaired by Deputy President Paul Mashatile to ensure the voices and concerns of traditional leaders are heard and addressed comprehensively.\n6.4. During this meeting, Cabinet Ministers who are part of the IMTT provided feedback and shared progress on their respective areas of responsibility such as health, land, water and sanitation and human settlements.\n7. Social Matters\n7.1. Class of 2024\n7.1.1. Cabinet commends the Department of Basic Education and the Class of 2024 on the successful conclusion of the 2024 National Senior Certificate examinations.\n7.1.2. Government has set up 181 marking centres across the country that have been audited and deemed ready. The national matric results will be announced on 13 January 2025, with provincial education departments releasing the results on 14 January 2025.\n7.2. World AIDS Day\n7.2.1. Deputy President Mashatile, together with the South African National AIDS Council launched the country’s commemoration of World AIDS Day on 1 December 2024 under the theme: “Equal Rights, Equal Care,” which calls for equitable, dignified and equal access to healthcare for all South Africans, irrespective of their economic status, gender, ethnicity or sexual orientation.\n7.2.2. In line with the theme, government continues with efforts to strengthen the fight against HIV and AIDS, and support those infected and affected by the virus. The day reminds us that HIV and AIDS has not gone away and that we must collectively fight against the virus, especially by practicing safe sex. HIV is prevalent among young people, especially adolescent girls and young women between the ages of 15 and 24, with a weekly record of 1,300 new cases.\n7.2.3. It was also a time for South Africa to reflect on the extraordinary progress we have made in the fight against AIDS and tuberculosis. The country has the largest antiretroviral therapy programme in the world, with more than 5.7 million HIV-infected individuals accessing antiretroviral drugs.\n7.2.4. The launch of World AIDS Day coincided with the 2024 National Day of Prayer held at the FNB Stadium which brought together different churches to pray for our country. The gathering was organised by the Motsepe Foundation and is observed by many countries around the world to encourage people of all religions to pray for their leaders and people.\n7.3. 16 Days of Activism Campaign\n7.3.1. This year marks the 26th anniversary of the 16 Days of Activism for No Violence against Women and Children campaign which is being marked under the theme: “30 Years of Advancing Collective Action to End Violence Against Women and Children”.\n7.3.2. The campaign began on 25 November and will conclude on 10 December 2024. In support of the country’s 16 Days of Activism for No Violence against Women and Children Campaign, the National Men’s Day Against Gender-Based Violence and Femicide (GBVF) will take place in Durban, KwaZulu-Natal on 6 December 2024, and take the form of a march from King Dinuzulu Park to The Station in Stamford Hill.\n7.3.3. The National Men's Day Against GBVF is an annual event that aims to increase awareness about the impact of GBVF on society and educate citizens about gender equity. The event will be officiated by Deputy President Mashatile and His Majesty the King Misuzulu kaZwelithini.\n8. International\n8.1. International Criminal Court (ICC)\n8.1.1. Cabinet welcomes the warrants of arrest issued by the ICC for Israeli Prime Minister Benjamin Netanyahu, former Minister of Defence Yoav Gallant and Mohammed Deif of Hamas. These actions mark a significant step towards justice for crimes against humanity and war crimes in Palestine.\n8.1.2. South Africa reaffirms its commitment to international law and urges all state parties to act in accordance with their obligations in the Rome Statute. We call on the global community to uphold the rule of law and ensure accountability for human rights violations.\n8.2. UN Climate Change Conference (COP29)\n8.2.1. Cabinet welcomes the outcome of the COP29, which agreed on a new finance goal to help countries protect their people and economies against climate disasters.\n8.2.2. Known as the New Collective Quantified Goal on Climate Finance, the new goal aims to triple finance to developing countries, from the previous goal of US$100 billion annually to US$300 billion annually by 2035.\n8.2.3. South Africa views climate change as a global crisis and has established the Just Transition Partnership to transition to a low carbon economy as part of our commitment to save the planet from harmful emissions.\n8.3. Nigeria-South Africa Binational Commission (BNC)\n8.3.1. The 11th Session of the Nigeria-South Africa BNC was held on Tuesday, 3 December 2024 in South Africa to strengthen relations between the countries. The two countries signed a number of agreements and Memoranda of Understanding that will improve the lives of people.\n9. Namibia Elections\n9.1. Cabinet congratulates President-elect Netumbo Nandi-Ndaitwah for securing victory in the Namibian Presidential election and becoming the country’s first female President.\n9.2. Cabinet also commends the people of Namibia for coming out in their numbers to vote in this election and allowing the Electoral Commission of Namibia space to finalise the results of the Presidential and National Assembly elections.\n10. Safer Festive Season\n10.1. Cabinet wishes all South Africans a safe and prosperous Festive Season, and reminds everyone that we all have a part to play in making the festive season joyous and safe for everyone.\n10.2. Cabinet reminds everyone that road traffic law-enforcement officers, law-enforcement agencies and other government departments will step up safety operations during this period to ensure that people are safe.\n10.3. These will include regular roadblocks, stop and searches and the tracking and tracing of wanted suspects. The heightened police visibility is aimed at preventing, combating and at the same time, countering serious and violent crime during the holiday season and beyond.\n10.4. You can play your part to ensure a safer festive season by always obeying the rules of the road. Do not ever drive while under the influence of alcohol, and do not text and drive.\n10.5. Cabinet calls parents and guardians to remain hyper vigilant concerning the supervision of our children, especially when at pools, beaches or near water. Children should never be left unattended at swimming pools or beaches and must be equipped with the necessary safety equipment. Do not drink when children are in your care at swimming pools or beaches and ensure that swimming pools are properly secured when not in use to deny children access.\n10.6. We also call on citizens to always be alert and aware when on holiday or during leisure moments. Avoid carrying large amounts of cash; instead use bankcards or electronic funds transfer to make transactions. Do not display large amounts of cash when making transactions because it can attract criminal elements.\nSouth Africa has many beaches that are accessible to all citizens, limiting of access to beaches that are public property amounts to the restriction of the freedom of movement, a right which is protected under the Constitution of the Republic of South Africa of 1996.\nB. Updates to Cabinet\n1. Electricity\n1.1. Cabinet commended the continuous and successful implementation of National Energy Action Plan led by the Minister of Electricity and Energy, Dr Kgosientsho Ramokgopa. The implementation of this plan has resulted to 252 days of constant power supply. .\n1.2. The Energy Action Plan implementation has resulted in year-on-year diesel savings of R17.37 billion less than R24.15 billion spent during the same period last year.\n1.3. Cabinet was further updated on Eskom’s successful completion of its pre-paid meter Key Revision Number (KRN) roll-over project. Over 5.5 million customers have rolled over to KRN2 and are transacting successfully.\n1.4. The KRN project has resulted in reduced zero buyers from 2.1 million to 1.7 million. Eskom will use various interventions to reduce the 1.7 million zero buyers.\n1.5. Eskom will further embark on replacement of faulty meters, prioritising buying customers. Time schedules will be communicated with respective communities as the meter replacement initiative is rolled out.\n2. Business Rescue and Reopening of Lily Mine\n2.1. Cabinet was updated about the progress on the business rescue and the reopening of the Lily Mine, which was placed under business rescue on 4 April 2016 following a mine disaster.\n2.2. The Minister of Mineral and Petroleum Resources, Mr Gwede Mantashe, continues to engage the owner of the mine and the Business Rescue Practitioner with the aim of ensuring the reopening of the mine and for best solutions for the affected families, recovery of the three missing employees and for economic revival of the area.\n2.3. Following the final agreement reached on 10 May 2024 between the Department Mineral and Petroleum Resources, the owner of the mine and the major creditor, the Minister held a meeting with stakeholders wherein the following resolutions were reached:\n2.3.1. Vantage Goldfields will arrange and provide for the funding to reopen the mine by 31 July 2024;\n2.3.2. Payment of outstanding salaries to employees;\n2.3.3. Recruitment plan to be developed for former employees who are still unemployed; and\n2.3.4. Mine to commence to process slimes dam to generate income in the short term.\n3. South Africa’s election as first Vice-Chair of the United Nations (UN) Tourism Executive Council for 2025\n3.1. Cabinet was informed of the election of the Minister of Tourism as the first Vice-Chair of the UN Tourism Executive Council for 2025 at the UN Tourism Executive Council Meeting held in Cartagena, Colombia in November 2024.\n3.2. This appointment will strengthen South Africa’s role in ensuring tourism as a catalyst for economic growth, job creation, and mostly leverage on South Africa’s Presidency in G20 to promote tourism opportunities in the continent.\n4. Water Matters\n4.1. Cabinet was briefed on various interventions to address challenges of water provision.\n4.1.1. Water Leaks\n4.1.1.1. Cabinet was apprised that eThekwini Municipality and Joburg Water have commenced with implementation of their turnaround strategies through the assistance of National Treasury’s City Support Programme.\n4.1.1.2. The Department of Water and Sanitation (DWS), National Treasury, South African Local Government Association and Development Bank of Southern Africa have established a Water Partnerships Office to assist municipalities to assess funding for various projects, including projects to reduce non-revenue water. The eThekwini, Buffalo City, City of Tshwane, Mangaung and Nelson Mandela metropolitan municipalities are being assisted to package projects for funding.\n4.1.1.3. National Treasury, through its Public-Private-Partnership unit, is assisting the City of Johannesburg for private sector assistance to reduce non-revenue water.\n4.1.2. Support to Water Services Authorities\n4.1.2.1. Cabinet was apprised that in addition to supporting municipalities designated as Water Services Authorities through grant funding, two reforms are under implementation by the DWS and National Treasury respectively. These are the amendment of the Water Services Act, 1997 (Act 108 of 1997) and the Reform of Metropolitan Trading Services Programme.\n4.1.3. Long Term Water Resource Management Planning\n4.1.3.1. Cabinet was briefed on plans to ensure water security in the country\n4.1.3.1.1. The Olifantspoort and Ebenezer water supply augmentation project is aimed at increasing the supply of water to the Polokwane and Capricon municipalities. The current phase of the project commenced in the 2022/23 financial year and is due for completion in July 2025. The current project involves construction of pipelines and pumping stations from the Olifantspoort and Ebenezer water treatment works.\n4.1.3.1.2. The Sinthumule Kutama bulk water supply project is aimed to supply additional water to Makhado is anticipated to be completed in January 2025.\n4.1.3.1.3. The Mooihoek bulk water supply project involves upgrading the Mooihoek Water Treatment Works, a bulk pipeline to serve 13 villages, including Burgersfort. The contractor is attending to the snag list and the project is ready for the municipality to connect reticulation.\n4.1.3.1.4. The Nebo bulk water supply project aimed to provide bulk water supply to 40 villages in the Makuduthamaga and Greater Fetakgomo Tubatse municipalities. The municipality is expected to appoint a contractor during the 2025/26 financial year to complete the project.\n4.1.3.1.5. The Moutse bulk water supply project aimed to supply bulk water from Groblersdal water treatment works to 40 villages in Moutse under Ephraim Mogale and Elias Motsoaledi municipalities. The DWS has deployed its own resources to ensure the project is completed by September 2025.\n4.1.3.1.6. The Loskop bulk water project is aimed to supply bulk water to villages in Moutse East, Mpumalanga and Limpopo, and is expected to be completed by March 2025.\n4.1.3.1.7. The Mametja water supply project is aimed to supply water to 28 villages in the Maruleng Local Municipality and Phase 1 of the project is expected to be completed by December 2024 and Phase 2 is projected to commence in 2025.\n4.1.3.1.8. Giyani water project: The rehabilitation of the water treatment works was completed in June 2024, and 11 villages of the 24 villages to be served by this water scheme are now receiving water in their yards. Work to serve the remaining 13 villages is expected to be completed in December 2024. Phase 2 of the project to reticulate water to the 31 villages will commence in April 2025.\n4.1.4. Hammanskraal Water Supply\n4.1.4.1. Cabinet is pleased that Phase 1 of the Klipdrift package plant, which is expected to bring 12.5-million litres of water per day to communities in the Hammanskraal area, has been completed. Magalies Water and the City of Tshwane are now busy clearing the reticulation pipeline that will be used to distribute water to residents. Once completed, further testing will also be done to ensure that the water is clean and drinkable. When all phases are fully completed, 50-million litres of treated water will be added to the system.\nC. Cabinet desicions\n1. National Policy on Women in Sport Policy Framework\n1.1. Cabinet approved the National Policy on Women in Sport Policy Framework for implementation.\n1.2. The policy intends to promote increased active participation of women in sport and in leadership roles, and recognises that increased participation of women in sport and in leadership positions will drastically reduce and ultimately contribute to eradicating gender inequality and various forms of discrimination against women. It also promotes equity by ensuring that women receive respect and recognition on the professional front, including equal remuneration as their male counterparts.\n1.3. The policy outlines a set of measures that will promote and support women in sport and ensure that programmes are in place to address gender disparities in sporting codes and structures. It also addresses barriers to entry by women in sport such as lack of funding, sponsorship and inadequate remuneration.\n2. Strategy for Reducing Food Losses and Waste\n2.1. Cabinet approved the strategy for reducing food losses and waste for implementation.\n2.2. The strategy aims to minimise food loss and waste along the food supply chain, reduce undesirable food wastage by applying tools and technologies, improve food security and mitigate negative environmental impacts. This is aligned to government interventions of reducing the high cost of living.\n2.3. It provides regulatory measures and interventions, norms and standards, appropriate financial support and incentives to promote reduction in food loss and waste, amongst others.\nThis strategy will assist to ensure the reduction of hunger and improve food security.\n3. White Paper on Human Settlements\n3.1. The Cabinet has approved the White Paper on Human Settlements, marking a significant milestone in the country's journey towards creating sustainable, inclusive, and equitable communities.\n3.2. The White Paper aims to provide an overarching policy framework for the delivery of sustainable human settlements, addressing the lessons learned from past experiences and incorporating the principles of spatial integration, inclusivity, and synergistic approaches.\n3.3. The objectives of the White Paper are to contextualize policy, provide for necessary institutional governance, give effect to the new review of the current legislative framework, and foster robust stakeholder engagement and coordinated action across sectors and jurisdictions.\n3.4. The White Paper has undergone extensive stakeholder engagement, including public consultations and inputs from civil society organizations, academia, and sector departments.\n3.5. All written comments were considered and incorporated into the final document. The approval of the White Paper marks a significant shift in the department's role from a State-Centered approach to an enabler, supporter, coordinator, and regulator in the planning, development, and management of integrated and sustainable human settlements.\n3.6. This development is a major step towards achieving the United Nations' Sustainable Development Goals, particularly Goal 11, which focuses on sustainable cities and communities.\n4. Tourism Route Development Marketing Plan\n4.1. Cabinet approved the Tourism Route Development Marketing Plan for implementation. The plan is intended to use tourism as a vehicle to drive inclusive growth, job creation and poverty reduction.\n4.2. The Tourism Route Development Plan is anchored on collaborative public-private sector partnerships and aims to support route development and sustenance. The plan will also strengthen the position of South Africa’s domestic airline services.\n5. Designation of the South African Human Rights Commission (SAHRC) as the National Preventative Mechanism for Optional Protocol to the Convention Against Torture (OPCAT)\n5.1. Cabinet approved the designation of the SAHRC as the national preventative mechanism for the OPCAT protocol. OPCAT is an international agreement aimed at preventing torture as well as cruel, inhuman or degrading treatment or punishment.\n5.2. This designation is aligned to the Constitution of the Republic of South Africa of 1996 and the South Africa’s foreign policy objective of promoting and protecting of human rights.\nD. BILL\n1. Judicial Matters Amendment Bill of 2024\n1.1. Cabinet approved the submission of the Judicial Matters Amendment Bill of 2024 to Parliament.\n1.2. The primary aim of the Bill is to amend numerous Acts which are administered by the Department of Justice and Constitutional Development. The amendments are intended to address practical and technical issues of non-contentious nature, including compliance with Constitutional Court judgements.\nE. Appointments\nAll appointments are subject to verification of qualification and relevant security clearance.\n1. Ms Mary Lerato Morake as the Chief Executive Officer (CEO) of the Vaal Orange Catchment Management Agency for a period of five years.\n2. Mr Bernard Swaswa Ntlhoro as the CEO of the Pongola-Umzimkulu Catchment Management Agency.\n3. Mr Cecil Khosa as the CEO of The South African Diamond Precious Metals Regulator.\n4. Mr Mziwabantu Dayimani as the CEO of National Empowerment Fund.\n5. Ms Mmmakgoshi Lekhethe as the CEO of the Industrial Development Corporation.\n6. Appointment of non-executive members to the ARMSCOR Board:\na. Dr Lesiba Alex Mahapa (Chairperson);\nb. Ms Maki Ndlovu (Deputy Chairperson);\nc. Ms Peta Nonceba Mashinini;\nd. Mr Zane Oswald Cleophas;\ne. Ms Masande Booi;\nf. Mr Raymond Mlungwana Vokwana;\ng. Dr Elsie Molokwane;\nh. Ms Mmathabo Abigail Sukati; and\ni. Mr Ntshengedzeni Michael Tshivhase.\n7. Appointment of members to the South African Weather Service Board:\n(a) Ms Sandika Daya (Chairperson);\n(b) Prof Sylvester Mpandeli (Deputy Chairperson);\n(c) Dr Lesley Luthuli;\n(d) Ms Mpho Gift Mogodi,\n(e) Dr Phumudzo Tharaga;\n(f) Prof Thando Ndarana;\n(g) Ms Makua Zondi Balebetje;\n(h) Adv Ikaneng Mokgosi;\n(i) Ms Ane Bruwer; and\n(j) Dr Prittish Dala\n8. Appointment of members to the board of Mzimvubu- Tsitsikamma Catchment Management Agency:\n(a) Mr Simphiwe Nicholus Khondlo;\n(b) Ms Fiona Sephton;\n(c) Ms Fezeka Mkile;\n(d) Mr Samir Randera-Rees;\n(e) Ms Margaret Wollf;\n(f) Ms Salome Chiloane- Nwabueze;\n(g) Prof Winston Plaatjes;\n(h) Ms Nicky McLeod;\n(i) Dr Patricia-Ann Scherman; and\n(j) Mr Thembelani Nkele.\n9. Appointment of the board members of the Broadband Infraco Limited:\n(a) Ms Zandile Kabini (reappointment Chairperson)\n(b) Ms Mathapelo Mzizi;\n(c) Ms Ulandi Exner;\n(d) Mr Loyiso Tyira (re-appointment);\n(e) Mr Patrick Makape;\n(f) Ms Bojane Segooa;\n10. Appointment of non-executive members to the Council of the Social Housing Regulatory Authority:\n(a) Ms Pulane V. Thobejane (Chairperson);\n(b) Ms Ayanda Olifant;\n(c) Mr Justice M. Makoko;\n(d) Mr Tumisho M. Makofane;\n(e) Mr Kevin Kiewitz;\n(f) Ms Refilwe Rapotu;\n(g) Ms Keletso P. Mokoena;\n(h) Dr Xitshembiso Russel Mulamula;\n(i) Ms Lindiwe N. Mjobo;\n(j) Mr Naledzani R. Sengani;\n(k) Mr James M. Maboa; and\n(l) Dr Soraya Beukes.\n11. Appointment of the Board of Housing Development Agency:\n(a) Hosi Pheni C. Ngove (Chairperson);\n(b) Ms Nelisiwe G. Baai (Deputy Chairperson);\n(c) Dr Alex Lesiba Mahapa; and\n(d) Ms Nalini Maharaj\n12. Appointment of members of Community Schemes Ombud Service\n(a) Mr Jacob Khawe (Chaiperson);\n(b) Ms Maria Dumakude (Deputy Chairperson);\n(c) Mr Heinrich G. April;\n(d) Mr Simon M. Molefe;\n(e) Ms Samkelisiwe F. Khumalo; and\n(f) Ms Lerato Moamogwa.\n13. Appointment of the Board of Property Practitioners Regulatory Authority:\n(a) Ms Queendy R.M. Gungubele (Chairperson);\n(b) Mr Johan D. Van der Walt;\n(c) Ms Pamela Nonkulululeko Makhubela;\n(d) Adv. Mxolisi Sphamandla Nene;\n(e) Mr Kebeditswe H. Medupe;\n(f) Mr Dikgang M. Stock;\n(g) Ms Dalphline H.C. Ewerste;\n(h) Ms Kedibone R. Tsiloane; and\n(i) Ms Nomxolisi M. Moagi\n14. Appointment of National Home Builders Registration Council members:\n(a) Ms Noxolo Kiviet (Chairperson);\n(b) Prof. Mandla J. Radebe (Deputy Chairperson);\n(c) Ms Renaire Shelley Huntley;\n(d) Mr Kganki S. Matabane;\n(e) Ms Nontuthuko Q. Chiluvane;\n(f) Ms Morwesi Ramonyai-Thonga;\n(g) Ms SiphindileS. Memela;\n(h) Ms Nomthandazo Lucia Ngcobo;\n(i) Mr Donovan Goliath;\n(j) Prof. Sijekula Mbanga; and\n(k) Mr M. Lehlogonolo Alfred Masoga.\nF. Upcoming events\n1. Reconciliation Month\n1.1 South Africa will mark Reconciliation Month in December under the theme: “Healing Historical Wounds and Forging New Futures”. The month serves as a clarion call for all sectors of society to play an active role in promoting healing from the injustices of our past.\n1.2 This year’s commemoration coincides with our 30 Years of Democracy celebration and will also reflect on the work of the Truth and Reconciliation Commission (TRC), which helped our country deal with the wounds inflicted by apartheid. The TRC advanced peace, reconciliation, tolerance and social cohesion.\n1.3 The 2024 National Day of Reconciliation will take place on 16 December 2024 in Matzikama Local Municipality in the Western Cape. It will be followed by a dialogue from widows of our nation’s freedom fighters. Through these discussions, we hope to draw wisdom and courage to move forward in building the country envisaged by our forebearers.\n2. International Relations\n2.1 His Excellency the President of the Republic of Angola, Mr João Manuel Gonçalves Lourenço, will undertake a State Visit to the Republic of South Africa on 12 December 2024, at the invitation of President Ramaphosa.\n2.2 The visit will strengthen relations between South Africa and Angola and focus on preparations for the inaugural session of the South Africa – Angola BNC to be hosted by Angola in 2025. The Heads of State will further exchange views on regional, continental and global matters of mutual interest.\n2.3 President Ramaphosa will undertake a State Visit to the People's Democratic Republic of Algeria on 5 and 6 December 2024. The visit will explore ways to further enhance bilateral cooperation in various fields and our shared vision to promote the values and ideals of Pan-Africanism.\nG. Messages\n1. Congratulations\nCabinet extended its congratulations and well-wishes to:\n• Minister Ronald Lamola, who was bestowed the Order of the Star of Merit in recognition of his support for Palestine and leadership in South Africa’s ICJ case on genocide against Israel.\n• National Treasury, for issuing a US R3,5 billion bond with a 12-year and 30-year tranche on the London Stock Exchange.\n• Prof Thumbi Ndung'u, University of KwaZulu-Natal HIV and TB researcher, who has been elected to the prestigious US National Academy of Medicine. The recognition is considered one of the highest honours in the fields of health and medicine.\n• Prof Thuli Madonsela, on her selection as a member of the prestigious International Council for Arbitration in Sport by the International Olympic Committee for the remainder of the 2023-2026 term, to fill the vacancy left after the passing of Justice Yvonne Mokgoro.\n• Bafana Bafana, who qualified for the 2025 African Cup of Nations.\n• The Springboks, for reclaiming the top spot in World Rugby after their victory against England, and to Pieter-Steph du Toit, who was named World Rugby Player of the Year.\n• Nkosinathi Maphumulo, popularly known as DJ Black Coffee, named the World’s Best DJ 2024.\n• Palesa Desiree Shilabje, known as DJ DESIREE, named as the World’s Breakthrough Artist 2024 at the Golden Moon Awards held in Spain.\n• Wouter Kellerman, Grammy Award winning South African flautist, composer and producer, for being nominated for a Grammy in the Best New Age, Ambient or Chant Album category for his latest album Triveni.\n• Johan Lange, a South African correctional official after being crowned Mr Universe International Bodybuilding and Fitness Master Class in over 40 categories.\n• Magau Ramaila who was crowned winner of the 2024 Miss Teen World beauty pageant.\n2. Condolences\nCabinet expressed condolences to the friends and family of:\n• Mrs Louise Asmal, a leader of the international campaign against apartheid and spouse of the late former Minister of Higher Education, Prof Kader Asmal. She was the cofounder of the Irish Anti-Apartheid Movement.\n• Dr Faustine Ndugulile, the former Health Minister of Tanzania, who was elected World Health Organisation (WHO) Africa’s Regional Director and was due to commence his duties next year. Cabinet wishes to extend its condolences to the Government and People of Tanzania, the WHO Africa Region on the untimely passing of Dr Ndugulile.\n• Mr Naphtall Manana, who committed his life to the pursuit of justice and freedom for all South Africans. His sacrifices and dedication to the struggle for freedom continues to encourage and inspires us to work together to build a better South Africa for all. He served as a distinguished leader, a committed civil servant and an international diplomat. Ambassador Naphtal Manana was a steadfast advocate for the values of a democratic, non-racial, non-sexist, united and prosperous society.\n• Mr Mallele Petje, Audit Committee Chairperson for the Mpumalanga Department of Education, who at one time served as a Director-General of the GPG in the Office of the Premier. Amongst the many positions held, he served as a Superintendent-General in the GDE.\n• Prof Enos Ngutshane who was chair of the Governing Body of the CCMA. He was an activist and will be remembered for his invaluable contributions to the administration of the country’s labour market.\n• Mr Imran Vanker, who played a pivotal role in the field of auditing, serving as Chairman of the Audit Committee of the United Nations, Director of Standards at the Independent Regulatory Board for Auditors and convening the Audit and Ethics Committee and the Committee for Auditing Standards in South Africa.\n• Mr Lucas “Masterpieces” Moripe, South African football legend known by his fans as the “God of Football”. His legacy lives on in the Lucas \"Masterpieces\" Moripe Stadium in Atteridgeville, which was named after him in 2010.\n• Mr Breyten Breytenbach, South African poet, novelist, painter and activist. He was well-known as a dissident poet and vocal critic of the apartheid regime.\n• Mr Jean-Jacques Cornish, a veteran journalist, editor and authoritative commentator on African affairs, who ensured that South African stories were told around the world. He also contributed to a deeper understanding of the continent’s challenges and opportunities.\nEnquiries: Ms Nomonde Mnukwa – Acting Government Spokesperson\nMobile: 083 653 7485\n#GovZAUpdates #servicedeliveryza",
  "word_count": 6158,
  "scraped_at": "2026-02-14T13:17:45.363553"
}