{
  "article_id": "fa4aab699b04",
  "url": "https://www.arsenal.com/news/every-word-artetas-post-southampton-presser-0",
  "title": "Every word from Arteta post - Southampton presser",
  "date": "20250525T230000Z",
  "domain": "arsenal.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "After seeing us overcome Southampton 2-1 to round off our 2024/25 campaign, Mikel Arteta spoke to journalists one last time before his summer break.\nThe boss chatted about saying goodbye to some familiar faces, ending on a high, and the success of our women's team in the Champions League.\nHere is everything he had to say:\non his thoughts on the game:\nI'm very happy to finish [the season] winning the match. We wanted to leave that dressing room with a positive energy, with a good vibe. We had to say goodbye as well to a few players that won't be with us next season, that was quite emotional as well, I think they deserved their appreciation and a good vibe around it. We've done it and now we're going to have plenty of time to think, to analyse what happens in the season, to learn from it for sure, to take all the incredible positive things that the team has done regarding the circumstances and think, okay, how can we now go into that little percentage that is missing to get where we want.\non if that will be achieved by adding personnel up front:\nIn order to achieve that, a lot of things have to happen. The team has to provide, that player has to play a certain amount of minutes and games. Believe me, we are on it. We will try to squeeze and think and turn every stone that we possibly can, to make this club even more successful. But I think what these boys have done, the team has done, regarding everything that has happened, I repeat myself, I think they deserve a lot of credit.\non Kieran Tierney scoring:\nHe said it yesterday, I'm going to score on my last Arsenal match and he's done it! So, credit to him, a special thank you to him. He's been part of the journey and he's won with me. It's true that he went to Sociedad for a few months, but it's been a joy to work with him, a really special character. We wish him and his family all the very best. The doors of this club are open for him - he's someone very, very liked at the club, in the dressing room and we want to wish him the best.\non sitting next to Josh Kroenke for the game:\nWe'll have enough time in the next few days to discuss the topics that you are probably suspecting, and we'll do it in the right environment. Today was just about the game.\non Riccardo Calafiori missing out:\nWe pushed Richy a lot to make sure that he was fit for the last few games and he was two, three weeks ahead of schedule in his injury. He's been constantly dragged into areas where he was really, really stretched and he wasn't comfortable the last week or two. With a lot of things, he still wanted to carry on but we decided to give him a break. He needs a rest, he needs to now make sure that he has proper preparation, a clear pre-season and give him the best chance to have a successful season next season.\non his message to the supporters:\nA big thank you for the way they have supported the team, the club. They will have travelled throughout Europe, in the country and the manner and the energy they put in has been incredible again. Hopefully they feel pride and that this team gives absolutely everything and I'm telling you that they've done it. There is nothing else to squeeze, there is not a single drop. I don't think there is more to give. Hopefully they value where we are, where we have brought this football club and of course make sure that that's decided that we all have to make the next step and that is the percentage that we need. Between all of us, we can achieve it and be very positive and enthusiastic about what is coming and be constructive especially.\non what the plan is for the next few days:\nWith the coaches, analyse everything, what we've done as a team, what we've done individually, put all the plans together that they are almost done, sit down with them, finalise a few things that still have to be planned out, decided, timings of that and go for it.\non if he’ll check his phone during the break:\nIf my wife allows it, yes but I’m not sure! I think I need some time because I have learned over the last few summers how you can get drawn into that. We have some great people, I fully trust them, I think it's very clear what we have to do. I will be available 24/7 wherever I am, they know that, but as well, I think we need to reset. I think it's been an extremely demanding season because emotionally to handle the team, to handle the club's expectations with everything that happened, it's been tough. So, I think as well to get the best version of ourselves next season is going to have to be a period where we have to disconnect and recharge those batteries\non the women’s team winning the Champions League:\nWe were all watching it, we were in two different buses on our journey to Southampton and we were watching it and I think it was incredible. First the way they played and the way they played against that Barcelona team, I think it was again a case of that resilience, that character because through the season they have had a lot of issues and the way they have managed to turn that around and win the Champions League, it's unbelievable. Josh was there yesterday and he couldn't be prouder, we cannot be prouder of that. So, a great example to look ahead.\non them being an inspiration:\n100%. That's what we want and they've done it and they've done it in a way that represents the club in an incredible way.\non the importance of finishing second:\nYes, if you cannot be the best, be the best of the rest. I've said it many, many times and it is difficult to do it three consecutive years when you look at the amount of points that we have in the last three years. The consistency, the league performance is what happens regardless in the toughest league that this country has ever seen, and this season has been the toughest as well. And we need to value that, and from there we can build whatever we want, but understanding what has taken us that far, because there's not much more to do apart from winning.\non when he starts focusing on next season:\nNow because tomorrow we already have some things that we are discussing and making decisions. Everything that is planned for pre-season and the first few weeks of the season has already been done two or three months ago, so we are now really good. And the moment I start to think about that, I feel goosebumps and excitement, and this is a really good sign always.\non if he’ll have a break before the transfer window opens:\nYeah, well it will be in different ways, but certainly. From tomorrow my day will look different. There are a lot of things to do, but it won't be, especially with that feeling in my tummy that a game is coming up. It will be a different one, and that changes everything.\nCopyright 2026 The Arsenal Football Club Limited. Permission to use quotations from this article is granted subject to appropriate credit being given to www.arsenal.com as the source.",
  "word_count": 1285,
  "scraped_at": "2026-02-14T12:50:19.560962"
}