{
  "article_id": "fa558609b04f",
  "url": "https://deadline.com/print-article/1236090280/",
  "title": "Deadline",
  "date": "20240917T140000Z",
  "domain": "deadline.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "LA’s Micheaux Film Festival Locks 2024 Edition With Projects Featuring Viola Davis, Michael Ealy, Morris Chestnut & Michael Gandolfini\nEXCLUSIVE: LA’s Micheaux Film Festival will officially run at The Culver Theater in Culver City from October 21 to October 27 with a selection of short and feature projects with talent such as Viola Davis and Morris Chestnut. Scroll down to see the featured lineup.\nThe festival, launched by Courtney L. Branch and Noel Braham to honor the legendary Oscar Micheaux, celebrates its sixth anniversary this year. The festival’s theme will be Champions, a celebration of “the resilience and determination of filmmakers who overcome countless obstacles to bring their visions to life.”\nThis year’s lineup includes more than 250 short films, feature films, and new media series with additional projects screening virtually. Titles include The Ebony Canal, a 46-minute feature on Black infant mortality rates narrated by Viola Davis. Also screening is The Origin, a project produced by Morris Chestnut, and Tea, a short project from filmmaker Blake Winston Rice featuring Michael Gandolfini. Alongside screenings, the festival will also host an industry-focused forum with panels featuring execs, agents, and managers. The festival has said it expects over 4,500+ guests.\n“We are honored to celebrate the enduring legacy of Oscar Micheaux, and illuminate the path for contemporary international filmmakers who mirror his pioneering spirit,” founders Noel Braham and Courtney Branch told us this morning. “This year’s festival is poised to be a catalyst for inspiration and an indelible milestone.”\n2024 Micheaux Film Festival Lineup:\nDesde La Raiz\n(Dir./Prod: Paulina Gamiz, Gus Sánchez; EPs: Ray Jimenez, Jaime Camil)\nNotable Talent: Jaime Camil (Jane the Virgin)\nLogline: In this four part docu-series, actor Jaime Camil (Jane the Virgin) will explore origins and meaning of Mexican products like coffee, chile, corn, and mezcal. Camil describes the series as “a love letter to México and some of the country’s richest heritage and legendary commodities.”\nDocuseries | Runtime: 42:00\nThe Distinguished\n(Dir.: Rickey Castleberry, Writer: Rickey Castleberry, Rodney Wilkins, Producer: Zach Fuqua, Rickey Castleberry, Khaild Jordan)\nNotable Talent: Harold Perrineau, Tracie Thoms, Luke Youngblood, Tosin Morohunfola, Jonathan Burke, Shawn Carter Peterson\nLogline: A young boy’s reality transforms as he deciphers cryptic messages from a supernatural force in his dreams, uncovering his family’s legacy.\nShort Film | Runtime:16:24\nPremiere Status: World Premiere\nMeal Ticket\n(Dir.: Wes Andre Goodrich, Writers: Wes Andre Goodrich, Patrick Nichols, Producers: Hillman Grad, 271, Patrick Nichols)\nNotable Talent: Siddiq Saunderson, Wu-Tang: An American Saga // Coy Stewart, Are We There Yet? // Grace Duah, Gossip Girl\nLogline: An anxiety thriller about a manager: Saint, who is forced to decide what to do with life-changing news he receives about his client: a young hip hop star, twelve minutes before goes onstage for his debut tour.\nShort Film | Runtime: 12:43\nAll In\n(Dir./Prod: Dusan Brown; Producers: Yuchuan Cao, Joyce Kelly-Brown\nJames Kexian Lee)\nNotable Talent: Dusan Brown, Netflix’s Ma Rainey’s Black Bottom, Legendary’s 42\nLogline: When an enterprising teen is left with seemingly insurmountable debt by his unscrupulous, late father, he must play poker to either make the money back and save what’s left of his family… or die trying.\nStudent Short Film | Runtime: 14:51\nPremiere Status: World Premiere\nRay of Hope\n(Dir/Writers: Ryan Singh, Nikila Cole, Producers: Ryan Singh, Patricia Scarlett, Nikila Cole)\nNotable Talent: Rathika Sitsabaiesan, Former Canadian Member of Parliament\nLogline: Ray of Hope is a personal journey of an Eelam Tamil Canadian woman who survived the Sri Lankan armed conflict, advocating for others with interspersed stories of healing and triumphs.\nFeature Film | Runtime: 1:30:00\nScam\n(Dir/ Writer: Julie Sharbutt, Producer: Whitney Wolanin)\nNotable Talent: Julie Sharbutt (I’m Dying Up Here, The Good Wife, 3 Days, Moved, The Weekend)\nLogline: When a phone scammer makes one last late night call, the woman on the other end gives her much more than she bargained for.\nShort Film | Runtime: 0:07:30\nAs Easy As Closing Your Eyes\n(Dir.: Parker Croft, Writers: Aaron Golden, Parker Croft, Producers: Max Loeb, Parker Croft, Aaron Golden, Chris Blim, Laura Coover\nNotable Talent: EP Abigail Breslin, EP Jon Michael Hill, Associate Producer Nolan Gould\nLogline: A grieving mother battles her addiction to a black-market drug that gives her life-like dreams about the son she lost.\nShort Film | Runtime: 0:21:43\nVigilante\n(Dir.: Wesley Armstrong, Writer: Philip Dover II, Producers: Jamee Ranta, Diamond Batiste)\nNotable Talent: Khleo Thomas (Zero in Holes) Maestro Harrell (Fear The Walking Dead)\nLogline: In a world where superheroes overlook the vulnerable, four friends with powers step up to protect their neglected neighborhood.\nShort Film | Runtime: 0:22:08\nPremiere Status: LA Premiere\nFlux\n(Dir/Writer: Aaron LaMarr Burleson, Producers: Aaron LaMarr Burleson, Elizabeth Franco)\nNotable Talent: Russell Curry – D’Angelo, Aaron LaMarr Burleson – Albie, Writer, Producer, Director, Elizabeth Franco – Executive Producer, Richard Stevenson Jr. – Producer, Composer – Space Monk, Maisha Azadi – Mysterious Women\nLogline: Trapped in an eerie, timeless void within his own home, a man confronts his past and future, ultimately discovering the key to breaking free from his purgatorial existence.\nShort Film | Runtime: 0:17:22\nPremiere Status: World Premiere\nThe Heart of Texas\n(Dir.:Gregory JM Kasunich, Writers: Gregory JM Kasunich, Lauren Noll, Producers: Jordan Ochel, Soledad Bautista, Becca English, Gregory JM Kasunich, Lauren Noll)\nNotable Talent: Carlos Moreno Cravioto – The Beauty and the Beasts, Aaron Konzelman – The Voice\nLogline: An aspiring country singer on her way to a life changing audition collides with an undocumented worker who refuses medical care. The two engage in a struggle, each in pursuit of their own American dreams.\nShort Film | Runtime: 0:14:45\nChocolate with Sprinkles\n(Dir/Writer: Huriyyah Muhammad, Producers:Okema T. Moore, Cole Sanchez, Yha Mourhia Wright)\nNotable Talent: Reno Wilson (CREDITS: Dexter: Original Sin, Fatal Attraction, Bel-Air)\nLogline: On their 25th wedding anniversary, a bickering couple is given one day to do something they haven’t done in 25 years – work on their marriage.\nShort Film | Runtime: 0:19:05\nPremiere Status: LA Premiere\nYou & I Don’t Say Goodbye\n(Dir/Writer: Armie Hicks Jr, Producers: Obiamaka Onwuta, Janae David)\nNotable Talent: Armie Hicks – Atlanta, Insecure, The Morning Show. Alexis Louder – Copshop, Violent Night, The Changeling\nLogline: Armie, a struggling actor who hasn’t been home in over a year, returns to North Carolina to reconnect with his daughter and attend her pageant. He faces the challenge of balancing his career ambitions with his desire to be a present father.\nShort Film | Runtime: 0:09:32\nPremiere Status: LA Premiere\nSubmerge\n(Dir.: J. Michael Hayes, Writers: J. Michael Hayes, Clarence Young, Producers: J. Michael Hayes, Emerson Mahoney, Nekeshia Hayes)\nNotable Talent: Mela Lee as “The Voice of Naima”, credits include: Miraculous Ladybug, The Owl House, Atlanta, Apex Legends\nLogline: On a remote island, Naima comes of age among an ancient mystical people. As a “chosen one” she must confront fear, expectations, and doubt to embrace her power as she transitions from childhood to something even more mysterious and powerful: herself.\nShort Film | Runtime: 0:06:28\nPremiere Status: LA Premiere\nIt Takes A Village\n(Dir.: Joshua Kissi, Writers: Joshua Kissi, Keyla McNeely, Producers: Kegan Sant, David Richards, Kamila Prokop, Patrick Milling-Smith, Leah Natasha Thomas)\nNotable Talent:Michael Ealy\nLogline: In 1960s Georgia, Mr. Cooke prepares Isaiah for his ascension to manhood through the hunting of a deer; a rite of passage every Cooke man has gone through before him.\nShort Film | Runtime:0:13:36\nTwo Breaths\n(Dir.: Kateryna Kurganska, Writers: Kateryna Kateryna, Myka Arakawa, Timur Guseynov, Producers: Kateryna Kateryna, Don John, C Craig Patterson, Timur Guseynov, Valerie Delahaye, Nick Brooks)\nNotable Talent: Romeo Garcia “Moana” (Live Action)\nLogline: After a man-made disaster decimates an evergreen island, a stranded 11-year-old girl must find the tenacity to leave behind her home with the help of an unlikely friend.\nShort Film | Runtime: 0:16:11\nWord of Oda\n(Dir/Writer: Nesha Jackson, Producer: Nesha Jackson, NEEN.)\nNotable Talent: NEEN – Executive Producer\nLogline: A member of Club Oda – an underground cult of One Piece extremists – kidnaps and rehabilitates his girlfriend after date night, doesn’t go as planned.\nShort Film | Runtime: 0:10:38\nPremiere Status: LA Premiere\nMarque Dos\n(Dir/Writer:Asha Chai-Chang)\nNotable Talent: Isaac Gonzalez Rossi – Lead in Netflix’s Global Top Ten film “That’s Amor”; Netflix/ starring Jennifer Lopez “The Mother”; Just booked Paramount+ “Dexter: Original Sin”; seen in HBO’s “Westworld,” “NCIS”, Amazon’s “As We See It,” and NBC’s “I Feel Bad.”| Roxy Rivera – “The Idea of You” (Prime/ stars Anne Hathaway) ; Hit Man, Dynasty, HBO’s “The RIghteous Gemstones”, and national commercials. Adargiza De Los Santos – “Grey’s Anatomy”, “The Horror of Dolores Roach” , “Abbott Elementary”, “This is Us” , and “Criminal Minds”\nLogline:An aspiring tour manager moves up the ranks in the marketing industry where discovering herself and her place in the world faces off with the demands of her dream job.\nWeb Series | Runtime:0:11:10\nPremiere Status: LA Premiere\nThe Flacalta Effect\n(Dir/Writer: Rochée Jeffrey, Producers: Ebony Elaine Hardin, Takara Joseph)\nNotable Talent:Executive Producer – David Arquette (Scream, Never Been Kissed) and Writer/Director – Rochée Jeffrey (co-executive producer Grownish, Smilf, Woke)\nLogline: After a drug with anti-aging properties has apocalyptic consequences, two Black sisters fight for their lives—and looks—in this satirical take on toxic white beauty culture.\nShort Film | Runtime: 0:07:50\nPremiere Status: LA Premiere\nThomasville\n(Dir/Writer: Alex Woodruff, Producers: Alex Woodruff, Abijeet Achar)\nNotable Talent: Kiah Clingman, Jay Jones\nLogline:A heart-wrenching psychodrama exploring the complex nature of Black legacy in Atlanta. Trapped in a rainswept car, a young man and his ailing father confront their fractured history before it’s too late.\nShort Film | Runtime: 0:13:07\nPremiere Status: LA Premiere\nName Image Likeness\n(Dir/Writer/Producer: Justin Rowe Tolliver)\nNotable Talent: Kyle Schmid – NCIS Origins\nLogline: A Los Angeles High School football phenom seems to be on top of the world, that is until his newfound fame and money start to present more problems than he can handle.\nShort Film | Runtime: 0:19:59\nSuperman Doesn’t Steal\n(Dir/Writer: Tamika Lamison, Producers: Tamika Lamison, Chris Beal, Dominique DeLeon, Carol Shine, Ben Ephraim)\nNotable Talent: Mustafa Shakir- Cowboy Bebop, Luke Cage, Deuces; Jordyn McIntosh- Unprisoned\nLogline: Based on a true story & set in the 70’s during the Atlanta Child Murders, a young brother and sister with a love of comics, face a series of impactful events which cause them to question the meaning of heroes, villains, superman- and themselves.\nShort Film | Runtime: 0:19:00\nMemoirs of a Bruised Mind\n(Dir/Writer: Shania Banton, Producer: Kiara Butler)\nNotable Talent: Grace Duah – HBO Max Gossip Girl\nLogline:After years of suppressing the pain caused by her mother, a young writer must summon the courage to face her trauma and turn it into art. As she puts pen to paper, she embarks on an anxiety-filled journey of self-discovery and healing, striving to turn her wounds into words and find redemption through her craft.\nShort Film | Runtime: 0:14:48\nPremiere Status: World Premiere\nThe Seductress from Hell\n(Dir/Writer: Andrew de Burgh, Producers: Oleksii Strykun, Andrew de Burgh, Roberta Sparta)\nNotable Talent: Jason Faunt (“Power Rangers”) James Hyde (Netflix’s “Monarca”) Andy Lauer (“Born on the Fourth of July”) Rocio Scotto (“AfrAId”) Raj Jawa (“Free Guy”) Sound Designer Steve Campagna (“Stranger Things”) Art Director Anna Giudice (“Interstellar”) Special Effects Makeup Artist Brittany Jamison-Lackey (“Ant Man and the Wasp: Quantumania”)\nLogline: A Hollywood actress undergoes a horrific transformation after being pushed to the edge by her psychopathic husband.\nFeature Film | Runtime: 1:42:05\nPremiere Status: World Premiere\nA RACE IN THE SUN\n(Dir/Writer/Producer: K. Nicole Mills)\nNotable Talent: Ayesha Mcgowan (Professional Cyclist)\nLogline: An exploration of cycling culture through the eyes of Ayesha McGowan who rose through the ranks of the New York City underground cycling world to break barriers as the world’s first African American woman to become a professional cyclist.\nShort Film | Runtime: 0:20:00\nPremiere Status: LA Premiere\nUnbraided\n(Dir/Writer: Caroline Renard, Producers: Sidney Butler, Suhashini Krishnan, Tiffany Thomas)\nNotable Talent: Monique Coleman, Godfrey, Sasha Compere, DaMya Gurley\nLogline: Desperate to get her hair done before a big trip, Frankie navigates the streets of LA, facing rejection and obstacles at every turn to find someone, anyone to braid her hair.\nShort Film | Runtime: 0:14:27\nTASTE OF THE MECCA\n(Dir/Writer: Tevin Scott, Producers: Tevin Scott, Vondell Burns, Brandon Palm\nNotable Talent: Issa Rae, Executive Producer\nLogline: An awkward black boy fresh out of a predominantly white high school begins to find love while struggling to fit in at his prestigious HBCU.\nShort Film | Runtime:0:16:19\nPremiere Status: LA Premiere\nSkettel\n(Dir/Writer: Moon Lee Ferguson, Producers: Kiara Diana, Shania Banton\nNotable Talent: Alicia Pilgrim (A Thousand and One, HBO’s Random Act of Flyness)\nLogline:A young mother struggles to keep her head above water as she navigates motherhood, her neurodivergent toddler, and the gritty Atlanta nightclub where she works. All on a quarter tank of gas.\nShort Film | Runtime: 0:13:05\nPremiere Status: LA Premiere\nThe Possible Life\n(Dir.: Burke Doeren, Writer: Jacob Seidman, Producer: Tyson Cal)l\nNotable Talent: Michael Vlamis – Rowsell, New Mexico\nLogline: After welcoming their first baby, Pete and Emma struggle with all the classic new parent challenges. But is something deeper going on? Follow Emma as she replays the events that led them to their current state – if she tries hard enough, maybe she can change the outcome.\nShort Film | Runtime: 0:10:42\nPremiere Status: LA Premiere\nChorus Notes\n(Dir/Writer: Casey de Fremery, Producers: Melody Carey, Regina Pigsley)\nNotable Talent: Leah Voysey (Terrifier 2)\nLogline:After a chance encounter at a record store, two women form a connection through the power of music.\nShort Film | Runtime: 0:10:00\nGet Your Story Straight\n(Dirs.: Myra Aquino, Ariel Felix, Writers: Ariel Felix, Myra Aquino, Eric Hwang, Producer: Paul Martinez)\nLogline: A murder charge assembles four estranged siblings for an unexpected reunion where they find themselves navigating secrets, dysfunction and the law. A short film with an all Filipino American cast and crew.\nShort Film | Runtime: 0:15:47\nSam From North Vegas\n(Dir/Writer/Producer: Brad Rundblade)\nNotable Talent: Patrick Walker\nLogline: A young man buries bodies for the mob in the desert of North Vegas until one day he receives the bodies of his older brother and younger sister.\nShort Film | Runtime: 0:20:00\nPremiere Status: World Premiere\nShoebox\n(Dir/Writer: D’Angelo “D’Lo” Louis, Producers: Jamari Perry, David Hunter Jr.\nNotable Talent: LaRoyce Hawkins- Chicago P.D, Chicago Fire, Chicago Med\nLogline: Overcome by abuse, a teenage black boy is forced to choose between pulling the trigger or not in an effort to protect himself. In turn, we are split between two realities of fate – the dream or a dream deferred.\nShort Film | Runtime: 0:12:25\nPremiere Status: LA Premiere\nVida\n(Dir/Writer: Maria Valdez, Producers: Maria Valdez\nNotable Talent: Valeria Maldonado\nLogline: In a post-civil war, women of color face forced sterilization. Vida and her rebel group must choose: escape or save the others and risk capture.\nStudent Short Film | Runtime: 19:59\nPremiere Status: LA Premiere\nLyz\n(Dir/Writer: Darnell Brown, Producers: Randy Becker, Darnell Brown, Angela Lewis)\nNotable Talent: Angela Lewis (Aunt Louie from SNOWFALL), Patricia “Ms. Pat” Williams (Ms. Pat from THE MS. PAT SHOW), J. Mallory McCree (Homeland, Good Trouble, Quantico)\nLogline: A fresh, off-beat dramedy that follows a passionate mental health worker as she struggles to balance her uniquely challenging job with keeping a promise to her daughter. Inspired by the writer/director’s experience as a former mental health professional.\nShort Film | Runtime: 0:10:22\nTricked and Treated\n(Dir.: Victoria Monai Richards, Writers: Victoria Monai Richards, Sherrie Richards, Michael Anthony Snowden, Producers: Sherrie Richards, King Hoey, Joel Harold, Joseph Harold, Grant Gilmore, Victoria Monai Richards, Tichina Arnold)\nNotable Talent: Tichina Arnold, Tommy Davidson, Juhahn Jones, Landon Moss, Christopher “CP Powell, Norm Nixon Jr., Victoria Monai Richards, Nijah Brenea\nLogline:After a college student and her two best friends frantically rush him to care for her mysteriously demented PawPaw, he disappears. Will her street reformed Auntie, homeless informants, and a host of other misfits help them find PawPaw in time for Christmas, or will they be taken too?\nFeature Film | Runtime: 1:42:00\nPremiere Status: LA Premiere\nMy Brother & Me\n(Dir/Writer: Ryan DeForeest, Producers: Ryan DeForeest, Shandrea Evans, Lexx Truss)\nNotable Talent: Alexander Bello: Theater Camp (Searchlight), And Just Like That (HBO), John Mulaney & the Sack Lunch Bunch (Netflix) — Rodney Hobbs: Shirley (Netflix), Young Dylan (Nickelodeon),\nLogline: A coming-of-age story about two brothers who attempt to rob their distant father of their overdue child support money.\nShort Film | Runtime:0:17:17\nPremiere Status: LA Premiere\nJulian\n(Dir.: Vivian Kerr, Writer: Cory Stonebrook, Producers: Stephanie Drake, Vivian Kerr)\nNotable Talent:Stephanie Drake (MAD MEN)\nLogline:A reconciliation brunch between estranged sisters goes awry when one of them brings an unexpected guest.\nShort Film | Runtime: 0:06:53\nLife Goes On\n(Dir/Producer:Hümam Özkara, Writer: Suat Köçer)\nNotable Talent:Osman Doğan\nLogline:Suat goes to a cafe in an area he doesn’t know about before and sits down to wait for his friend. He is unaware that this cafe is actually located under the mosque and was set up in the area where the funeral ceremony is being held. At that moment, a funeral comes to the cafe and interesting images emerge. Suat and the other customers cannot hide their surprise at this situation and it is revealed once again how ordinary death is in life.\nInt’l Short Film | Runtime: 0:08:30\nPremiere Status: LA Premiere\nGroupies\n(Dir.: Corey Grant, Writer: Daphnique Springs, Producers: Daphnique Springs, Phaedra Harris)\nNotable Talent: Eric Roberts\nLogline: A group of determined, marginally educated millennial groupies on a mission to change their destiny by bagging a baller… or at least his Bentley!?!\nWeb Series | Runtime: 0:30:23\nPremiere Status: LA Premiere\nSweet Santa Barbara Brown\n(Dir.: Eric Dyson, Writer: Solomom Hughes, Producers: Matthew Barnes, Oliver Mack Calhoun, Eric Dyson, Tony Gapastione, Solomon Hughes)\nNotable Talent: Solomon Hughes, Spencer Garret, Max Williams\nLogline: Due to a case of mistaken identity, four members of the Globetrotters find themselves at the violent mercy of the Santa Barbara Police Department.\nShort Film | Runtime:0:13:00\nPremiere Status: LA Premiere\nBehold A Lady\n(Dir/Writer: Britt Williams, Producers: Austin Chen, Chris Crema)\nNotable Talent: Alana Kay Bright, AMARR\nLogline: When a studious tomboy’s boyfriend dumps her on the eve of her Latin Quiz Bowl tryouts, she struggles to balance her heartbreak and studies as she transforms her appearance to win him back.\nShort Film | Runtime: 0:15:58\nPremiere Status: LA Premiere\nBRAND NEW\n(Dir/Writers: Quincy Ledbetter, Denzel Whitaker, Producers: Yuki Maekawa-Ledbetter, Ramfis Myrthil)\nNotable Talent: Denzel Whitaker, Kris D. Lofton, Maestro Harrell, Chad L. Coleman\nLogline:When a newly famous music producer visits his hometown, he battles the guilt of abandoning his past and the bitterness of an old friend.\nShort Film | Runtime: 0:21:56\nLove on Speed\n(Dir/Writer/Producer: Evan Cleaver)\nNotable Talent: Aaron Branch. He’s a series regular on Netflix’s UNSTABLE and is on a nationwide tour as a standup comedian\nLogline: Aidan and Jayden feel an instant connection when they latch eyes at a speed dating event , but do they have enough courage to endure some odd characters in order to meet each other?\nShort Film | Runtime: 0:11:47\nAmong The Wounded\n(Dir/Writer: Adonis Williams, Producer: Pamela Diaz)\nNotable Talent: Executive Producer – Ramel Westry (Coordinator To Executive Chairman for AGBO of the Russo Brothers-Directors of Avenges 2&3 )\nLogline: As a violent epidemic of a new drug wreaks havoc on a New York housing project complex right after a heavy snowstorm, a single mother and her youngest son frantically search for her oldest who may have been exposed at a party he attended against her wishes.\nShort Film | Runtime: 0:09:02\nPremiere Status: LA Premiere\nMiracle Wood\n(Dir/Writer:Johnny Rey Diaz, Producers: Johnny Rey Diaz, Ash T)\nNotable Talent: Matt McCoy – Seinfeld, Police Academy, Silicon Valley, Jack Ryan\nLogline: A lonely, depressed old man finds hope in a holy piece of wood.\nShort Film | Runtime: 0:06:10\nWho in the Hell is Regina Jones?\n(Dir.: Soraya Selene, Writer: Billy Miossi, Producers: Alissa Shapiro, Sam Pollard)\nNotable Talent: Sam Pollard\nLogline: The extraordinary life of Regina Jones is one not only shaped by history, but also one that made history. From being pregnant and married at 15, through the middle of the Watts Rebellion of 1965, to emerging as a groundbreaking newspaper publisher, Regina is a testament to the American experience.\nFeature Film | Runtime: 1:42:00\nPremiere Status: LA Premiere\nBACKLOG\n(Dir/Writer: Jacqueline Elyse Rosenthal, Producers: Robin Wang, Marian Cook, Josh Powell\nNotable Talent: Jill Renner (Lead)\nLogline: The true-life story of an assault survivor who becomes the voice of millions in her crusade to fight a failing American justice system.\nShort Film | Runtime: 0:18:06\nUnited in Grief\n(Dir/Writer: Desmond Levi Jackson, Producers: Desmond Levi Jackson, Khaila Amazan)\nNotable Talent: Khaila Amazan, The Spider Within: A Spider-Verse Story, K-POPS!, The Horrors of Dolores Roach\nLogline: Suffering debilitating grief from the passing of his best friend who introduced him to the world of dance, Derrick must confront a monster that seeks to separate him from everything he loves.\nShort Film | Runtime: 0:12:51\nPremiere Status: LA Premiere\nRESPECT MY CROWN: THE RISE OF AFRICAN AMERICAN WOMEN IN CALIFORNIA POLITICS\n(Dir.: Pamela Bright-Moon, Writers:Jocelyn Y. Stewart, Alisa Bass Covington, Pamela Bright-Moon, Producers: Alisa Bass-Covington, Pamela Bright-Moon)\nNotable Talent: Julianne Malveaux, Ph.D.; Karen R. Bass; Barbara Lee; Sydney Kamlager-Dove; Shirley Weber, Ph.D.; Lola Smallwood Cuevas; Tina McKinnor; Mia Bonta; Lori Wilson; Holly J. Mitchell; Areva Martin; Emma Sharif, Racquel Vasquez, Deborah Robertson, Acquanetta Warren, Tasha Cerda, Yvonne Wheeler, Kellie Todd Griffin, Charisse Bremond Weaver, Jan Perry, Laura Richardson, Heather Hutt, Jackie Lacey. Not interviewed but featured: Vice President Kamala Harris, US Congresswoman Maxine Waters.\nLogline: In the state of California, Black women have battled race and gender barriers in pursuit of equality and political power, for the past 170 years. Respect My Crown: The Rise of African American Women in California Politics, reveals the sacrifices and contributions these women made to become leading voices in politics, community activism, organized labor and the judicial system.\nFeature Film | Runtime: 1:26:00\nBlindspot\n(Dir/Writer: Luke O’Sullivan, Producers: Luke O’Sullivan, Mallory Jansen, Thomas Simon)\nNotable Talent: Mallory Jansen, actress in AGENTS OF S.H.I.E.L.D, THE BIG LEAP, GALAVANT, THIS IS US, YOUNG & HUNGRY\nLogline: BLINDSPOT takes place over the course of one night, as a woman deals with the aftermath of a fatal car accident that blurs the lines between right and wrong. The film follows June as she is taken to the police station for questioning, while the police struggle to distinguish between victim and perpetrator.\nShort Film | Runtime: 0:11:30\nReunion\n(Dir/Writer: Timothy S Naylor, Zainab Jah, Producers: Djaka Souaré, Timothy S Naylor, Zainab Jah)\nNotable Talent: Executive Producer: Danai Gurira. Associate Producer: Lupita Nyong’o\nLogline: REUNION – a West African immigrant living the Bronx, discovers the child soldier who destroyed her family, years later, is now a best selling author living in New York City. Combining live action with graphic novel techniques and with Danai Gurira as Executive Producer, this award winning short has qualified for the 2025 Oscars.\nShort Film | Runtime: 0:15:30\nHuli\n(Dir/Writer: Daniel Croix, Producers: Max Mooney, Phil Schlieder, William Rouse, Richard Hamasaki, Mele Hamasaki, Emily May Jampel)\nNotable Talent: Daniel Croix (Manhunt on Apple TV+, The Oval on BET, Love Victor on Hulu)\nLogline: After a boxer flees from New York to Hawaiʻi, a friendship with his coach expands his awareness of identity, purpose, and power.\nShort Film | Runtime: 0:12:00\nPremiere Status: LA Premiere\nMORROW\n(Dirs.: Rich Monteiro, Lexx Truss, Producers: Gregory Warfield, Victoria Griggs)\nNotable Talent: Rich Morrow (John Henry, Young Rock, Mindhunter, Hacks, Swoon)\nLogline: From the spotlight on the court as a D-1 basketball player to the spotlight on set as a rising thespian, we follow Rich Morrow’s journey from one exhilarating road to the next.\nShort Film | Runtime: 0:22:00\nPremiere Status: World/LA Premiere\nThe Newlyweds: Blood at The Altar\n(Dir/Writer: Lucien Christian Adderley, Richard “Byrd” Wilson, Producers: Moon Lee Ferguson, Kiara Diana, Tanisha Cidel, LaToya Tonodeo, Arlen Escarpeta, Analisa Velez)\nNotable Talent:Latoya Tonodeo ( Power Book II: Ghost (STARZ), The Fosters, The Oath, The Perfect Match), Arlen Escarpeta (Found (NBC), Whitney, David Makes Man, Final Destination 5, Friday the 13th, S.W.A.T, NCIS), Alex Hibbert (Moonlight, The Chi, Black Panther), Analisa Velez (The Game, Quantum Leap, Almost Love), Bertrand E Boyd II (Queen & Slim, P-Valley, Cherish The Day)\nLogline: On the day of their wedding, a newlywed couple must battle everyone they love in order for their marriage to survive.\nShort Film | Runtime: 0:14:42\nPremiere Status: World Premiere\nN.ot W.ithout A.lonzo: The Origins of West Coast Hip Hop (2024)\n(Dir/Writer/Producer: Timothy Lee Conley\nNotable Talent: Grandmaster Lonzo: Godfather of West Coast Hip Hop – World Class Wreckin’ Cru, The D.O.C.: Hip-Hop Pioneer, DJ Yella: Rock N Roll Hall of Fame – NWA/World Class Wreckin’ Cru, Kurtis Blow: Hip Hop Pioneer, MC JB: Hip Hop Pioneer – JJ Fad, Arabian Prince: Rock N Roll Hall of Fame – NWA/Uncle Jamm’s Army, DJ Cli-N-Tel: Hip Hop PioneerWorld Class Wreckin’ Cru, DJ Battlecat: Hip Hop Pioneer, The Poetess: Hip Hop Pioneer – Los Angeles Radio Host (92.3 The Beat FM 1990s)\nLogline: N.ot W.ithout A.lonzo: Every success has an origin story. Grandmaster Lonzo, The Godfather of West Coast Hip-Hop narrates and details the origin story of West Coast Hip Hop from 1974-1987.\nFeature Film | Runtime: 1:12:06\nExpanding Sanctuary\nDir/Writer: Kristal Sotomayor\nNotable Talent: Music by Las Cafeteras\nLogline: An immigrant mother emerges as a community leader during the historic campaign to end the sharing of the Philadelphia police database with Immigration and Customs Enforcement (ICE). Expanding Sanctuary tells a rarely told story about a Latinx immigrant community’s successful journey to change legislation and protect families.\nShort Film | Runtime: 0:20:00\nPremiere Status: LA Premiere\nHARLEM FRAGMENTS\n(Dir.: Cameron Tyler Carr, Writers: Cameron Tyler Carr, Wes Andre Goodrich, Danielle Therese Dougé, Producers: Flor Tejada, Collin Meath, Ben Thompson, Salma Qarnain)\nNotable Talent: Roderick Lawrence – Silent Partner, Tina The Musical, Lion King\nLogline: Harlem Fragments is an Afro-futurist scrapbook storytelling of a Harlem Black family’s beautiful destruction during the 2008 recession. A natural disaster so mesmerizing you can’t look away from the tragedy. Based on true events.\nShort Film | Runtime: 0:17:00\nTo End All Spells\n(Dir/Writer/Producer: Nana Kwabena, Zak Cedarholm\nNotable Talent: Idara Victor (Mad Men, Shameless, Minx, Rizzoli & Isles), Jidenna (Insecure, Luke Cage)\nLogline: Amidst her village, Sumsun, nearing the brink of extinction, an unforgiving desert warrior fights to protect the legacy of Palve, a sacred psychedelic fruit that connects its indigenous to the spiritual realm. The only way to experience the effects of this scarce and forbidden hallucinogenic is through the remaining villagers greatest form of protection; their hair.\nShort Film | Runtime: 16:05\nPremiere Status: LA Premiere\nAugust & Ebony\n(Dir.: Sunyin Zhang, Writer: A. Cooper, Producer: Pinar Binay)\nNotable Talent: John Clarence Stewart (Zoey’s Extraordinary Playlist, P-Valley, Luke Cage, A Killer Romance) & Ayesha Harris (Daisy Jones & The Six, Glamorous, The L Word: Generation Q, This Is Us)\nLogline: Ebony, who finds herself unexpectedly pregnant after a U-Haul marriage, has to referee between her new wife, August and best friend-turned-child’s father, Justin, while finding her footing as a mother-to-be.\nShort Film | Runtime: 0:12:51\nThe Debutante\n(Dir.: Elizabeth Hobbs, Producer: Abigail Addison)\nNotable Talent: Alexa Davies. Credits: Mama Mia: Here We Go Again!, White House Farm, Dead Pixels, Detectorists\nLogline: A spirited young woman persuades a hyena from London Zoo to take her place at a dinner dance being held in her honor.\nInt’l Short Film | Runtime: 8:10\nPremiere Status: LA Premiere\nBurn Out\n(Dir/Writer: Russell Goldman, Producers: Jamie Lee Curtis, Michael Fry, Wendy Wang, Everett Osborne)\nNotable Talent: Everett Osborne and Tommie Earl Jenkins (Actors), Jamie Lee Curtis (Producer)\nLogline: An assistant will do anything to get a presentation in front of his boss… even set himself on fire. Starring Everett Osborne (SWEETWATER) and Tommie Earl Jenkins (DEATH STRANDING).\nShort Film | Runtime: 0:12:32\nDare Greatly\n(Dir/Writer/Producer: Kerri Lendo)\nNotable Talent:Selena Leoni – BAFTA Connect, Berlinale Talents, Gold House Futures, and Film Independent’s Project, MK Paulsen – Inside Joke on Amazon Prime\nLogline: Love and loss in the grocery store parking lot.\nShort Film | Runtime: 3:45\nPremiere Status: LA Premiere\nPeripheral\n(Dir.: Sulayman Tahir, Writer: Sulayman Tahir, Jordan Tortorello, Producers: Jordan Tortorello, Dallas Hart)\nNotable Talent: Patrick Walker (Lessons In Chemistry, The Last Days of Ptolemy Grey)\nLogline: A woman’s husband goes missing soon after moving into their new home. But strange paranormal events start to occur upon his return\nFeature Film | Runtime: 1:27:00\nPremiere Status: LA Premiere\nLufalo Rising\n(Dir/Writer: Gordon Christopher Greene, Producers: Howard Green, Gordon Greene)\nNotable Talent:Gordon Greene (The Famous Jett Jackson, Mafia 3, Shameless), Jimmy Jean-Louis (Tears of the Sun, The Goat Life, Heroes), Robert Wu (Ted, Survivor’s Remorse), Jeffrey Anderson-Gunter (Mark for Death, Naked Gun 33 1/3, Don’t be a Menace to South Central While Drinking Your Juice in the Hood)\nLogline: After a deadly struggle to try and save his mother from the hands of a brutal Warlord, Lufalo Banza becomes a wanted fugitive.\nShort Film | Runtime: 0:19:27\nPremiere Status: World Premiere\nReally Good Driver\n(Dir/Writer: Alex Song-Xia, Producers: Niki Ang, Jen Arwatchanakarn)\nNotable Talent: Keiko Agena (Gilmore Girls, Prodigal Son)\nLogline: IAn Asian American mom teaches her grown-up child how to drive, forcing both to confront parts of the car, and themselves, they never have before.\nShort Film | Runtime: 0:08:00\nRoberta’s Rules\n(Dir/Writer: Derrex Brady, Producers: Derrex Brady, Michael Dalton, Mayon Denton)\nNotable Talent: Derrex Brady, Carmen Serano, Page Kennedy, Aida Rodriguez, Sean Holland, Michael D. Walton\nLogline: A deceased mother of three leaves behind iCloud videos to help her career-obsessed husband parent and heal his family.\nShort Film | Runtime: 0:25:21\nPremiere Status: World Premiere\nThe Ebony Canal\n(Dir/Writer: Emmai Alaquiva, Producers: Ya Momz House, Inc.)\nNotable Talent: Viola Davis Narrator\nLogline:A STORY ON BLACK INFANT MORTALITY\nShort Film | Runtime: 0:46:00\nPremiere Status: LA Premiere\nSurvived By\n(Dir/ Writer: K.D. Chalk, Producers:K.D. Chalk, Nicole Crespo, Pinar Binay)\nNotable Talent: Chris Chalk (HBO’s Perry Mason, James Baldwin on Ryan Murphy’s Fued, Ava Duvernay’s When They See Us, Fox’s Gotham, HBO’s Welcome to Derry etc) https://www.imdb.com/name/nm1663252/\nLogline: A newly orphaned kid dodging the foster care system spends a magical evening with a sock puppet hoping to unpack her complicated relationship with her father days after his death.\nShort Film | Runtime: 0:12:26\nArt, Beats + Lyrics\n(Dir.: Bill Horace, Producers: Jabari Graham, Dwayne Wright)\nNotable Talent: Killer Mike\nLogline:Art, Beats + Lyrics celebrates the legacy of the groundbreaking visual art and hip hop roadshow that began in Atlanta in 2004 and has since become a national phenomenon. The documentary chronicles the lead up to AB+L’s twentieth anniversary tour.\nFeature Film | Runtime: 1:30:06\nPremiere Status: LA Premiere\nInterception: Jayne Kennedy • American Sportscaster\n(Dir/Writer:Safiya Songhai, Producers:Safiya Songhai, Jayne Kennedy Overton, Latena Hazard, Esq, Garland McLaurin, Michael L. Brown Philip Dover II,)\nNotable Talen:Jayne Kennedy, Muhammed Ali, Jim Brown, Irv Cross, Brent Musberger, Phyllis George\nLogline: When a bronze-skin bombshell rocks the world of Sunday Morning Football, millions tune in… but few know the tumultuous story of Jayne Kennedy, the first Black woman to boldly tackle the racism of 20th century American broadcast television.\nShort Film | Runtime: 0:15:00\nChimera\n(Dir/Writer: Kryzz Gautier, Producers: Corsica Wilson, Kryzz Gautier, Brett Marshall)\nNotable Talent:\nLogline: Haunted by the past, a brilliant tech-addicted developer faces an impossible dilemma: recreate her ex-girlfriend in virtual reality or hold onto the crumbling relationship with her current one.\nShort Film | Runtime: 0:18:15\nPremiere Status: LA Premiere\nThe Devil Ain’t Pius\n(Dir.: Keena Ferguson, Writer: Miatta Vincent Ronca, Producers: Miatta Vincent Ronca, Delece James)\nNotable Talent: Lawrence Hilton-Jacobs: Coolie High, Welcome Back Kotter. Rolando Boyce: The Chi.\nLogline: A lifetime ago, a struggling Pius Montgomery sold the soul of one of his future grandchildren to the Devil in exchange for a life of wealth and success. Fifty years later, Pius, the head of the billion dollar Uncle Pius’ Devilishly Hot Hot Sauce empire, has gathered his four children and seven grandchildren around him to break the bad news. One of the kids will have to surrender their child to the Devil to pay off their father’s debt. But already anticipating what a difficult decision it will be, Pius has set up a series of games of skill. And the loser will leave the weekend with one less child.\nweekend with one less child.\nShort Film | Runtime: 0:27:00\nPremiere Status: LA Premiere\nThe Concert\n(Dir/Writer: Elizabeth Bourgeois, Producers: Hays Hitzing, Nancy Nagrant)\nNotable Talent: Nancy Nagrant – Co-Producer (Marvelous Ms. Maisel, Law and Order, Other TV)\nLogline: Three teens riff on music, future, and freedom as they prep for their first rock concert. The girls tap into sisterhood, strength, and resolve when their dream night takes a brutally realistic turn.\nShort Film | Runtime: 0:07:34\nPremiere Status: LA Premiere\nMONOCHROMATIC\n(Dir/Writer: Karen Bryson, Producers: Shakyra Dowling, Lorraine Bhattachary)\nNotable Talent: David Harewood – Executive Producer (Blood Diamond, Homeland, Supergirl)\nLogline: The film is seen through the eyes of Grace, age 6. The world as she sees it, innocent and carefree. Grace is Black. 1977, London. The political climate is volatile with the rise of the National Front calling for the repatriation of immigrants and appealing to racial hatred. Grace plays in her garden. Bored, she opens the back gate seeking adventure. Along the New River path, she falls cutting her hand badly. Grace’s mother thinks she is playing in the back garden until the doorbell rings. She opens to see a skinhead boy wearing a Nazi t-shirt with Grace, her blood on his hands. Micro aggressions culminate in a moment at their white Christian Church. Grace reaches out her hand to the white woman next to her, the woman recoils. At this moment, we see little Grace for the first time, a tiny piece of her heart breaks.\nShort Film | Runtime: 0:12:51\nDevelopment\n(Dir/Writer: Chloe Caudillo, Producers: Via Bia, Haskiri Velazquez, Sal Lopez, Alan Luna)\nNotable Talent: Haskiri Velazquez (Saved By The Bell, The Forty-Year-Old Version); Raquel McPeek Rodriguez (NCIS: Los Angeles); Jeff Lorch (Our Flag Means Death), Leticia Castillo (Jessica Jones, When They See Us) and Sal Lopez (Full Metal Jacket, American Me)\nLogline: Struggling to climb the corporate ladder, an office worker finally lands a leadership training seminar, only to realize that to be successful, trainees must become clones of the “nepo baby” boss.\nShort Film | Runtime: 0:10:13\nLast Hoorah at G-Baby’s\n(Dir/Writer/Producer: DeeDee Casimir\nNotable Talent: Kim Coleman – EP + Casting Director Chaine “CJ Fly” Downer\nLogline: After her grandmother dies, an aimless and apathetic art school grad must come up with five months of back rent or she risks eviction from her inherited rent-controlled apartment in a gentrifying Brooklyn.\nStudent Short Film | Runtime: 14:55\nUnder the Influencer\n(Dir.: Bryn Woznicki, Writer: Skye Emerson, Producers: Jill Bennett, Katie Hall)\nNotable Talent: Joy Sunday (Wednesday, Dear White People, MacGyver); Erin Matthews (Hannah Montana, Chasing Life, Final Fantasy XV); Pam Trotter (Dreamgirls, Abbott Elementary, Life in Pieces); Tami Lane (Oscar-winning makeup artist)\nLogline: Digital artist Lex Carre documents her struggle with anxiety through work that she posts pseudonymously online. Her pieces capture the attention of cunning curator Andrea Caulfield, who offers mentorship in exchange for control of Lex’s career. When Lex’s mental health starts to spiral from the pressure, Andrea assumes ownership of her work—prompting Lex to plot a psychological showdown against the exploitative mentor who stole her art and nearly destroyed her mind.\nFeature Film | Runtime: 1:42:51\nPremiere Status: LA Premiere\nPhels High\n(Dir/Writer/Producer: Kevin Nelson\nNotable Talent: Omari Hardwick, Elise Neal, Allen Maldonado, TJ Atoms, Marc John Jefferies, Michael Hyatt\nLogline: ” With danger lurking and trust fraying, survival becomes the ultimate challenge, In the aftermath of a high school shooting, where four friends find themselves barricaded in the school basement. Their loyalty is tested as they place their lives in the hands of the police officers negotiating with the shooter. “\nFeature Film | Runtime: 01:25:06\nPremiere Status: LA Premiere\nLavender Men\n(Dir.: Lovell Holder, Writers: Roger Q. Mason, Lovell Holder, Producers: Mia Chang, Mia Ellis, Lovell Holder, Roger Q. Mason)\nNotable Talent: Pete Ploszek (star of Michael Bay’s Teenage Mutant Ninja Turtles franchise; the upcoming season of Netflix’s You)\nLogline: After a particularly disastrous performance, the stage manager of a small theater daydreams about Abraham Lincoln’s gay love affair in order to cope with their own loneliness.\nFeature Film | Runtime: 01:25:06\nPremiere Status: LA Premiere\nForeign Planetary\n(Dir/Writer: Tiffany Lin\nNotable Talent: Chelsea Sik (Alan’s Universe, Apex Legends)\nLogline: On the brink of her last day on Earth before being forced to return to her planet of origin, a young woman must find a way to stay in her new home.\nFeature Film | Runtime: 1:38:19\nI’m Pretty Sure My Therapist Thinks I’m a Bad Actor\n(Dir/Writer: Spenser Davis, Producers: E.M. Davis, Spenser Davis)\nNotable Talent: Elizabeth Laidlaw (actor, “The Red Line,” CBS), E.M. Davis (actor, “4400,” The CW)\nLogline: A microbudget dark comedy about anxiety, vulnerability, and the folks we turn to (and kidnap) for validation.\nShort Film | Runtime:0:12:20\nDemo-Lition\n(Dir.: Alesia ‘Z’ Glidewell, Writer: Omar El Alami, Producers: Nina Burnett, Lidiya Korotko, Alesia Glidewell, Robb Hanson)\nNotable Talent: Rell Battle – Peacock’s Killing It, Carl McDowell – Ballers, Geri-Nikole Love – Star Trek Picard\nLogline: The fate of an aspiring rapper with unbreakable resolve and his supportive wife for over a decade, hang in the balance of an all-too-important phone call from a record label.\nShort Film | Runtime:0:08:06\nStan Behavior\n(Dir/Writer: Tyler C. Peterson, Producer: Eric Michael Kochmer, Marc Smolowitz)\nNotable Talent: Ginger Minj (Cast), Yvonne Zima (Cast), Heidi N Closet (Cast)\nLogline: A drag queen embarks on a quest for better workplace rights, but finds herself in a dicey situation when her new lawyer, a tone-deaf straight woman, is revealed to be a drag super fan.\nShort Film | Runtime: 0:15:01\nPremiere Status: LA Premiere\nNever Can Say Goodbye\n(Dir/Writer:Christopher Grant, Producers: Hash Sesay, Crystal Lucas-Perry, Christopher Grant)\nNotable Talent: Lead Actress, Crystal Lucas Perry Crystal Lucas-Perry is an American actress. She is known for her performances on Broadway acting in the musical revival of 1776, and the Jordan E. Cooper sketch-play Ain’t No Mo’, the latter of which earned her a 2023 Tony Award nomination for Best Featured Actress in a Play.\nLogline: Inspired by, created for, and starring parents who are dealing with child parent separation… A mother, convicted and on the verge of prison, asks for one last chance to see her kids. But when her children refuse to say goodbye, she’s forced to make other plans.\nShort Film | Runtime: 0:18:20\nPremiere Status: World Premiere\nHow to Sue the Klan\n(Dir/Writer: John Beder, Producers: Ben Crump, Cameron S. Mitchell, Raji Ramanathan\nNotable Talent: Ben Crump\nLogline: How to Sue the Klan is the story of how five Black women from Chattanooga used legal ingenuity to take on the Ku Klux Klan in a historic 1982 civil case, fighting to hold them accountable for their crimes and bring justice to their community. Their victory set a legal precedent that continues to inspire the ongoing fight against organized hate.\nShort Film | Runtime: 0:34:28\nHONEST/ FLUFF\n(Dir/Writer: Sherean Jones, Producer, Jamari Perry)\nNotable Talent: Amy Aniobi (writer and EP Insecure)\nLogline: A perpetual people-pleaser must come to terms with the fine line between tactless bosses, freeloading fuck buddies and the honest truth of taking action and getting the life you deserve.\nShort Film | Runtime: 0:15:00\nPremiere Status: LA Premiere\nTEA\n(Dir/Writer: Blake Winston Rice, Producer: Gabriella Piazza\nNotable Talent: Michael Gandolfini (Lead), Olivia Nikkanen (Lead), Blake Winston Rice (Director), Gabriella Piazza (Producer)\nLogline: While rehearsing asking out the girl of his dreams, a lonely and highly allergic Circuit-Shack employee gets stung in the throat by a hornet.\nShort Film | Runtime: 0:12:25\nSaving All My Love\n(Dir.: Kristina Thomas, Writer: Tyler Young, Producer: KD Chalk)\nNotable Talent: Venus DeMilo Thomas, Yolanda Snowball\nLogline: A down-on-her-luck former pageant queen’s anxiety spirals out of control when she finally confronts her mother’s hoarding.\nShort Film | Runtime: 0:12:36\nWabi-Sabi\n(Dir.: Josephine Green Zhang, Writers: Josephine Green Zhang, Rachel Michiko Whitney, Producers: Josephine Green Zhang, Rachel Michiko Whitney, Jeff Mizushima, Michael Fry)\nNotable Talent: Josh Caras — Good Boys, The Glass Castle; Hymnson Chan — Curb Your Enthusiasm; Dana Donnelly — Hacks, The Sex Lives of College Girls; Teruko Nakajima — Lady Dynamite\nLogline: When an insecure woman goes on a date at a traditional Japanese tea house, her best friend’s advice about white guys with Asian fetishes threatens to ruin her love life and her sanity.\nShort Film | Runtime:0:19:47\nMoments\n(Dirs.: Malachi Rivers, Aaron Lewis, Writer: Malachi Rivers, Producers: Malachi Rivers, Rob Byrd, Carlton Jordan, Aaron Lewis, Jeff Gardere\nNotable Talent: Rutina Wesley (OWN’s Queen Sugar, HBO’s True Blood, The Last of Us) · Malachi Rivers (Creator and Writer, Netflix’s Mank) · Jeff Gardere (GMA, CNN) · Sufe Bradshaw (HBO’s Veep, Lovecraft Country) · Devere Rogers (Amazon Prime’s Honk for Jesus. Save Your Soul) · Thomas Hobson (Nickelodeon’s That Girl Lay Lay) · Desean Terry (Apple TV’s The Morning Show) · Tiffany Snow (BET’s Just As I Am, Family Portrait) · Jowanda Durham (Rhonda Mitchell M.D.) · Brooklyn Chance (Money & Violence, L.I.P.S) · Crystal Porter-Bazemore (Sound)\nLogline: A weekly therapy group unravels tales of abuse, deferred dreams, lost love, and more, guided by a mind-reading therapist and a time-traveling healer who help them confront the moments that led them to therapy.\nWeb Series | Runtime: 0:23:10\nSole Suspect\n(Dir.: Maggie Castle, Writers: Maggie Castle, Matt Watts, Producers: Maggie Castle, Jamin Kerner, Joe McDougall\nNotable Talent: Maggie Castle (Tumbledown, Todd and The Book of Pure Evil, Starstruck) , Jeananne Goossen (Handmaid’s Tale, Beacon 23, Slasher, So Help Me Todd) , Oscar Best (Arthur The King, The Last Face)\nLogline: Just when a retired detective thought she was finally out, her son’s missing shoes pull her back in.\nShort Film | Runtime: 0:13:00\nMANIFESTO [for Concrete Poetry]\n(Dir/Writer/Producer: Richard Hamasaki, Jody Stillwater, Sebastian Galasso\nNotable Talent: Jody Stillwater (2024 Emmy nominated for sound); Daniel Croix (Apple TV Manhunt actor and Oval actor for Tyler Perry); Sebastian Galasso (actor)\nLogline: MANIFESTO [for Concrete Poetry] features a timeless, irreverent and satirical poem by the late Wayne Kaumualii Westlake (1947-1984) originally published in 1979.\nShort Film | Runtime: 6:24\nPremiere Status: LA Premiere\nX: The Interview\n(Dir.: RJ Barnes, Anthony Rose, Writer: RJ Barnes, Producers: RJ Barnes, Anthony Baldino)\nNotable Talent: Brandon Broady\nLogline: A canceled superhero facing eviction turns to his side hustle for survival, but as he embarks on his journey, he discovers dark powers are conspiring against him.\nShort Film | Runtime: 0:18:35\nPremiere Status: LA Premiere\nWill I See You Again?\n(Dir.: Michael Perez-Lindsey, Writers: Rhett Lindsey, Michael Perez-Lindsey, Producers: Michael Perez-Lindsey, Alex Coffey, Valeria Lopez)\nNotable Talent: Hosea Chanchez (The Game), Nick Wechsler (Revenge), Richard Lawson (Tyler Perry’s Divorce In The Black), Anna Maria Horsford (Friday), Rosanny Zayas (L Word: Generation Q)\nLogline:After 20 years of estrangement, two former college teammates find themselves summoned to their late friend’s estate hearing. To claim their inheritance, they must first confront their past relationship while undergoing a polygraph test.\nShort Film | Runtime: 0:24:13\nCurtain Call\n(Dir/Writer/Producer: Wilderley Mauricette\nNotable Talent: Jared Wofford (StartUP, Swagger, David Makes Man), Tony J. Scott (Manhunt. The Equalizer)\nLogline: A young drug dealer with a hidden passion for theater finds his double life unraveling as his commitment to the stage clashes with his criminal responsibilities, drawing the dangerous attention of his powerful mentor. Faced with an impossible choice between his love for the arts and his loyalty to the streets, he risks everything to pursue his dreams, igniting a life-altering confrontation.\nShort Film | Runtime:17:52\nPremiere Status: LA Premiere\nBaggage Claim\n(Dir/Writer: Eric Dyson)\nLogline: Jimmy discovers sometimes the end is just the beginning.\nShort Film | Runtime: 0:15:00\nPremiere Status: LA Premiere\nThe Other Side of Fair\n(Dir/Writer:Dani Coleman, Producer: Dani Coleman, Taron Germany, Bathsheba Bauduy)\nLogline: When workplace jealousy and competition brings two colleagues head to head, a face off between ambition and entitlement forces them both into rude awakenings.\nFeature Film | Runtime: 0:52:03\nPremiere Status: World Premiere\nT-Minus\n(Dir.:Emily Lerer, Writer: Sam Meier, Producer:Toni Cunningham)\nLogline: It’s a trans-abortion-road-trip-romcom! After a one night stand, a trans auto mechanic named Andrew and a drag queen named Lex must road-trip from Ohio to Detroit to obtain an abortion.\nShort Film | Runtime: 0:12:26\nPremiere Status: LA Premiere\nBarakah\n(Dir/Writer: Biniyam Abreha, Producers: Bemnet Yemsgen, Biniyam Abreha)\nLogline: Faced with a dire request from a mysterious woman, a distraught young man embarks on a transformative journey that unearths mystical forces that reach into a long forgotten past.\nShort Film | Runtime: 0:14:47\nPremiere Status: LA Premiere\nFortune Cookie\n(Dir/Writer/Producer: Fu Yang)\nLogline: A fortune-cookie-head crumbles himself, piece by piece in order to keep devouring creatures out of his way.\nShort Film | Runtime: 0:03:50\nPremiere Status: LA Premiere\nGolden Garden Takeout\n(Dir/Writer: Maggie Wong, Producers: Ellen Xing, Stephanie Gong)\nLogline: A nosy mother walks in on her teenage daughter’s devastating breakup.\nShort Film | Runtime: 0:11:06\nPremiere Status: LA Premiere\nWrite This!\n(Dir.: Christopher Ortega, Writers/Producers:Ken Gregory, Holly Logan)\nLogline: In a hilarious twist of fate, a washed-up talent manager turned wannabe writer faces the ultimate plot twist: he must charm and cajole his brilliant but skeptical client into letting him manage her career by crafting side-splitting stories, turning his own life into a comedy of errors in the process.\nShort Film | Runtime: 0:08:33\nPremiere Status: World Premiere\nSwoon\n(Dir/Writer: Byron Manuel, Producers: Byron Manuel, Ryan Rojas, Kassandra Diaz, Franco Tavera, Cash Oliver, JP Ouellette)\nLogline: A woman wakes tied to a bed, and her captor tries to manipulate her into believing they are a couple.\nFeature Film | Runtime: 1:23:00\nPremiere Status: LA Premiere\nWelcome to AfroTree\n(Dir/Writer: Chase Parker, Producers: Chase Parker, Greg Rhem)\nLogline: Steven and Janet are fed up with gentrification, whitewashing, and code switching in the big city. They move to Afrotree, an experimental, gated community populated by only African-American residents. Their dream of living in a cultural oasis suddenly becomes a nightmare when they discover they may not be “Black” enough.\nShort Film | Runtime: 0:20:44\nPremiere Status: LA Premiere\nThe Candy Lady\n(Dir/Writer: Monique Morton Derouselle, Producers: Chris Jones, Monique Morton Derouselle)\nLogline: The Candy Lady is a comedic Afro-fantasy short film that follows Debra, a neighborhood candy lady whose quiet day goes awry when she, unbeknownst to her, awakens a magical typewriter bringing all of her short stories to life.\nShort Film | Runtime: 0:11:28\nPremiere Status: LA Premiere\nPhoenix\n(Dir/Writer: Sid Dalvi, Producers: Jacqueline Urteaga, Nandini Dalvi, Sid Dalvi)\nLogline: When a psychiatrist hypnotizes one of his most traumatized patients, he discovers something that changes both of their lives forever.\nShort Film | Runtime: 0:19:07\nPremiere Status: LA Premiere\nSundown\n(Dir/Writer: Jordan Freeman, Producers: Wellesley Mobasser)\nLogline: When their car breaks down on the way to an HBCU Homecoming, two best friends discover something sinister in the town they’ve stopped in.\nShort Film | Runtime: 0:06:00\nPremiere Status: World Premiere\nThe Yellow Sponge is the Dish Sponge\n(Dir.: Michele Noble, Writer: Bixby Elliot, Producers: Bixby Elliot, Michele Noble)\nLogline: Do we really need to wash sheets every week? Why would you ever have to clean a shower head? What is the difference between the blue sponge and the yellow sponge? These are the questions that haunt Jason. He doesn’t understand the world’s obsession (and his husband Erik’s obsession) with cleanliness. So, on the day of their big party Jason launches his campaign to open Erik’s eyes to this problem. What starts as disagreements about Lysol Wipes and Febreze scented trash bags turns into something bigger as The Yellow Sponge is the Dish Sponge looks at a couples conflict as old as time…fighting about household chores.\nShort Film | Runtime: 0:16:39\nPremiere Status: World Premiere\nCottage Grove\n(Dir/Writer:George Ellzey Jr. Producers: Cara Winter, Jordan Rivers, Kat Blade-Owens, TJ Harris, Keiph Oliver)\nLogline: A young man struggles to communicate with his stroke-afflicted father, and at the same time, stay true to himself.\nStudent Short Film | Runtime: 0:13:24\nPremiere Status: LA Premiere\nBelow the Veil\n(Dir/Writer: Jami’L Carter, Producers: Jami’L Carter, Amber Johnson)\nLogline: Two cousins return to their family home and dig into their grandfather’s history but receive resistance from their uncles. As their prying leads to emotional wounds, the cousins uncover familial secrets that were never meant to be unveiled.\nShort Film | Runtime: 0:21:55\nPremiere Status: LA Premiere\nSuper High: A Period Piece\n(Dir/Writer: Bianca Lambert, Producers: Kiah Clingman)\nLogline: In the semi-autobiographical short film “Super High: A Period Piece,” Amanda battles excruciating period pain caused by fibroids. Desperate for relief, she experiments with a celebrity cannabis brand’s edibles. A dosage mishap catapults her into a surreal, anxiety-filled journey until she awakens.\nShort Film | Runtime: 0:08:59\nPremiere Status: LA Premiere\nWelcome Home\n(Dir/Writer: Jo Rochelle, Producers: Joshua Dean, Regina Hoyles)\nLogline: A rebellious teenage girl with pastor parents orchestrates a surprise for her brother on Halloween.\nShort Film | Runtime: 0:13:40\nPremiere Status: LA Premiere\nShepherd’s Calling\n(Dir/Writer: Wubetu Shimelash, Producers: Wubetu Shimelash, Majiye Uchibeke, Celai Ahmadzai)\nLogline: From the rugged caves of Ethiopia to the dazzling lights of Hollywood, ‘SHEPHERD’S CALLING’ follows the remarkable journey of an Ethiopian shepherd turned filmmaker in America. This captivating documentary explores the struggles of leaving home, reconciling cultural identities, and the universal quest for belonging.\nInt’l Short Film | Runtime: 0:21:54\nPremiere Status: LA Premiere\nS.P.I.C.\n(Dir.: Heidi Miami Marshall, Writer: Johnny Sanchez, Producers: Mathia Vargas, Carlos Ibarra, Johnny Sánchez, JLove Calderón, Jennifer Sklias-Gahan, Luz Corona, Frank Oz, Michelle Hurd, Heidi Miami Marshall, Andrew McClain, Art Chudabala)\nLogline: A young boy’s desire to get his mother back, and a father’s wish to make things right collide.\nShort Film | Runtime: 0:17:48\nPremiere Status: LA Premiere\nToska\n(Dir/Writer: Alessia Devecchi, Producers: Alessia Devecchi, James Perkins)\nLogline: A hunter’s obsession with the creature that has eluded her leads her down a dangerous and lonely path.\nShort Film | Runtime: 0:11:22\nPremiere Status: World Premiere\nThe Origin\n(Dir./Writer: Jorge Sanchez, Producer: Morris Chestnut)\nNotable Talent: Morris Chestnut\nLogline: As the fate of the earth hangs perilously in the balance, Bandi a sagacious elder embarks on a crucial mission to locate Tep one of the few legitimate descendants of an ancient extraterrestrial power, tracing back to a small tribe in Africa.\nShort Film | Runtime: 20:00\nHours.\n(Dir./Writer: Tiger AJ Ray, Producer: Aaron Kelly, Tiffany Campbell, Tiger AJ Ray)\nNotable Talent: Steve Howey, Deric Augustine & Liz Lafontant\nLogline: “Hours.” is a 24-hour romance between two emotionally unavailable co-workers who decide to throw caution to the wind after seeing one another outside of work.\nShort Film | Runtime: 16:28\nPremiere Status: LA Premiere\nPull Over So I Can Hit You!\n(Dir.: Catelin Shane Dunn, Writer: Calvin Michaels, Catelin Shane Dunn, Producer: Calvin Michaels, Catelin Shane Dunn)\nNotable Talent: Bobby Mcgee (Netflix- The Upshaws NBC- Grand Crew, The CW- Everybody Hates Chris)\nLogline: The driving desires of a teen get railroaded by a chaotic family drive.\nShort Film | Runtime: 13:00\nPremiere Status: LA Premiere\nSelf-Belief Symphony\n(Dir./Writer: Azuri Vallatine, Producer: Black Girls Film Camp, Regina Hoyles, Yha Mourhia Wright, Chassidy Jade)\nNotable Talent: Chassidy Jade\nLogline: Stuck between two worlds, a young teen girl struggles with the choice to please her mother and yield to cultural expectations or follow her own passions.\nShort Film | Runtime: 6:52\nPremiere Status: LA Premiere\nLove, Malachi\n(Dir.: Britt Banks, Writer: Kaena Hood; Producer: KAENA ALICE MEDIA, STREETLIGHT PRODUCTIONS)\nLogline: A young cancer patient and his girlfriend’s plans are unexpectedly deterred when his discharged date gets postponed. The two must suddenly figure out how to make the most of their day against all odds.\nShort Film | Runtime: 20:00\nPremiere Status: LA Premiere\nSan Francisco Bae\n(Dir./Writer: Cephra Stuart, Producer: Cephra Stuart, Duke Sayer)\nNotable Talent:\nLogline: A black female founder, struggling to find investors, and an Asian med-school dropout concoct a risky plan to pursue their true passions & achieve the American dream.\nFeature Film | Runtime: 1:49:00\nPremiere Status: World Premiere\nTakeout\n(Dir.: Marcus Ellison Jr., Writer/Producer: Madeline Rooks)\nLogline: Tensions rise for a young couple when a delayed takeout order disrupts their night in.\nShort Film | Runtime: 11:36\nPremiere Status: LA Premiere\nAbove the Desert\n(Dir: Sonia Sebastián, Writer: Heather Older, Producer: Heather Older, Sonia Sebastián, Maarten Cornelis)\nLogline: After arriving illegally in the United States, a young Mexican girl’s troubled life gets inspired by spying on an incandescent neighbor.\nShort Film | Runtime: 16:20\nPremiere Status: LA Premiere\nDon’t Cry For Me All You Drag Queens\n(Dir.: Kristal Sotomayor, Writer: Kristal Sotomayor and María Luisa Santos, Producer: Kristal Sotomayor, Nic Cory, Daniel Brooks)\nLogline: “Don’t Cry For Me All You Drag Queens” pays homage to the legendary Mother Cavallucci by weaving together the present and past to provide a striking portrait of belonging and memory.\nShort Film | Runtime: 9:00\nCrossfire Love\n(Dir./Writer: Patrick Phillips, Producer: Patrick Phillips, Kandice Ware and Jamison Phillips)\nLogline: Highlighting the historical impact of groups like the Black Panthers and legislation such as the Mulford Act, “Crossfire Love” sheds light on the evolving landscape of black gun ownership in contemporary society.\nShort Film | Runtime: 22:00\nPremiere Status: LA Premiere\nBible Camp\n(Dir.: Philip DeRise, Writer: Hyon Jung Lee, Producer: Sibyl Reymundo-Santiago, Taja Perkins)\nLogline: Young Korean immigrants assimilate to baseball, burnt hot dogs and hostility at a discount daycare. Rocking out to vinyl records at Bible Camp has unintended consequences. A traumatic memory, based on a true immigrant story.\nShort Film | Runtime: 13:21\n3 Easy Steps\n(Dir.: Paige Henderson, Writer: Paige Henderson, Nicole Murray, Producer: Leah Meyerhoff, Nicole Murray, Paige Henderson)\nLogline: A woman with debilitating ADHD embarks on a self-help journey to the woods where things take a dark turn when she manifests another version of herself.\nShort Film | Runtime: 16:39\nPremiere Status: LA Premiere\nMelabration\n(Dir./Writer: Kezita Mentor, Producer: Renee Reid)\nLogline: After returning home from prison, Callie faces a mysterious threat in her small town where under the sun’s glare your survival depends on the amount of melanin in your skin.\nShort Film | Runtime: 16:16\nPremiere Status: World Premiere",
  "word_count": 9082,
  "scraped_at": "2026-02-14T12:57:41.157147"
}