{
  "article_id": "fa783c9181c2",
  "url": "https://www.theglobeandmail.com/business/article-international-students-interest-rates-business-quiz-january-26/",
  "title": "How many international students are living in Canada ? Take our business quiz for the week of January 26",
  "date": "20240126T111500Z",
  "domain": "theglobeandmail.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Welcome to The Globe and Mail’s business and investing news quiz. Join us each week to test your knowledge of the stories making the headlines. Our business reporters come up with the questions, and you can show us what you know.\nThis week: The Bank of Canada kept its benchmark interest rate at 5 per cent, a two-decade high reached last July. This was the fourth consecutive time that it held the rate steady, while pulling back on its threat of further rate hikes. Meanwhile, the U.S. economy expanded faster than expected in the fourth quarter, with growth for the full year coming in at 2.5 per cent. Released on Thursday, the Commerce Department’s advance fourth-quarter gross domestic product also showed inflationary pressures ebbing further.\nAlso: There are new trends in social media, electric vehicles and disciplining employees.\nd. More than 1 million. Official figures show 1,028,850 study-permit holders at the end of December, far above the level the government had projected.\na. Blackstone. Toronto-based Tricon is a major developer of Toronto rental apartments and also owns 37,000 single-family homes in the southern United States. New York-based Blackstone bills itself as the world’s largest manager of alternative assets.\nd. Being vocal about your financial choices. Loud budgeting is about making it clear that it’s your personal choice not to spend. Instead of going along with the crowd and spending, or not spending and blaming your decision on a lack of money, it’s about simply declaring you don’t want to spend.\nd. The EV share of the U.S. car market is declining. The EV transition isn’t proceeding quite as rapidly as many hoped. Tesla’s growth is slowing, Hertz is selling some of its EVs and some automakers are backing away from ambitious goals for EV production. But, despite those hiccups, EV sales are still setting records and continue to expand their share of the overall market. They accounted for 7.6 per cent of the U.S. car market in 2023, up from 5.9 per cent the year before, according to data from Kelley Blue Book.\nb. Drove nails into trees that were going to be cut down. An anonymous group claimed responsibility on an anarchist website. They said the sabotage was in protest against a project they say will destroy wetlands and perpetuate car culture.\nc. Between 3.5 per cent and 4 per cent. Core inflation has fallen sharply since 2022 but is still running higher than the central bank’s target of 1 per cent to 3 per cent.\nb. Butter chicken. The family behind Moti Mahal, a famed Delhi restaurant brand, is suing rival chain Daryaganj, accusing it of falsely claiming to have invented the dish.\na. Aren’t showing up in the office enough. The letters are the latest attempt in an ongoing campaign by many companies to convince remote employees to return to the office.\nc. Oil prices have risen this year, unlike bitcoin, gold or Tesla stock.\nd. Railways have performed the best and by a wide margin, according to a recent CIBC World Markets report. Canadian National Railway and Canadian Pacific Kansas City produced an average annual return of 15. 5 per cent over that three-decade stretch.\nd. Pro wrestling will start streaming next year. In a major move into live sports – or at least into live sports-like entertainment – Netflix has signed a US$5-billion, 10-year contract with TKO Group to bring Raw, the weekly WWE pro wrestling show, and other sweaty delights to its streaming lineup.",
  "word_count": 580,
  "scraped_at": "2026-02-14T12:17:26.274026"
}