{
  "article_id": "fa962d82c67f",
  "url": "https://www.theguardian.com/world/2025/sep/24/wednesday-briefing-what-russia-wants-with-nato-airspace-and-what-options-it-leaves-the-west",
  "title": "Wednesday briefing : What Russia wants with Nato airspace – and what options it leaves the west",
  "date": "20250924T073000Z",
  "domain": "theguardian.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Good morning. Of all the scary things about the recent military escalation between Russia and Nato, perhaps the most unnerving is this: it is impossible to know which incident will be the one that sends things spiralling out of control.\nIn the past two weeks, there have been a series of Russian incursions into Nato airspace with unpredictable consequences. First with drones, and then with fighter jets, the Kremlin appears to be testing how far Ukraine’s allies will go in response. “We do not want to see a continuation of this dangerous pattern by Russia, intentional or not,” Nato chief Mark Rutte said yesterday. “But we stand ready and willing to continue to defend every inch of allied territory.”\nNato countries have warned Russia that any further incursion will be met with a military response – and yesterday at the UN, on the same day that he accused European countries of “destroying their heritage” through immigration, even Donald Trump said he would support Nato countries shooting down Russian aircraft over their territory.\nToday’s newsletter, with Dr David Jordan of the Freeman Air and Space Institute at King’s College London, explains why Russia has been testing Nato – and what might happen if it does so again. Here are the headlines.\nFive big stories\n-\nUS news | Donald Trump attacked European leaders, telling them “Your countries are going to hell” and describing climate change as a con in an inflammatory general assembly speech at the UN.\n-\nUK politics | The Liberal Democrats are the only remaining block against “the forces of darkness” led by Nigel Farage, Ed Davey has told his party’s annual conference in a speech that repeatedly and at times personally took aim at the Reform UK leader.\n-\nJeffrey Epstein | The Duchess of York allegedly sent an email apologising to the disgraced late financier Jeffrey Epstein after he threatened to “destroy her” in a “Hannibal Lecter-style” phone call, according to reports.\n-\nMedia | Jimmy Kimmel returned to air on Tuesday, calling government threats to silence comedians “anti American”, as he spoke about the suspension of his late-night programme which ignited a debate over free speech.\n-\nMedia | Noel Clarke has been ordered to pay the Guardian an initial £3m towards its legal costs from successfully defending his libel claim over an investigation in which the actor was accused of sexual misconduct by more than 20 women.\nIn depth: ‘Shooting down drones would seem a high priority’\nThe recent spate of Russian incursions into Nato airspace began on 10 September, when 19 drones flew over Poland and three or four were shot down. Even at that stage, Polish prime minister Donald Tusk said that military conflict was closer “than at any time since the second world war”.\nThree days later, another drone was detected in Romanian airspace. On Friday, Nato said that three Russian MiG-31 fighter jets entered Estonian airspace over the Baltic Sea for 12 minutes with their transponders off and without communicating with air traffic control. On Sunday, two German jets were scrambled to intercept a Russian reconnaissance plane ignoring requests to make contact as it flew in neutral airspace, again over the Baltic Sea. And on Monday, Denmark and Norway were forced to close their main airports after drone incursions; yesterday, Denmark’s prime minister, Mette Frederiksen, said that she “cannot rule out” Russian involvement. (Dan Sabbagh examines that incident in this analysis piece.)\nWhile the intelligence picture of thinking within the Kremlin is imperfect, taken together these incidents suggest that Russia is seeking to bring divisions within Nato to the surface, Dr David Jordan said. “They are hoping that they may cause some Nato nations to refuse to participate in supporting Ukraine in some way, by hinting that this might lead to a wider war.”\nIs Russia definitely being provocative?\nThere has been some debate about the drone incursions, partly because Polish and Romanian incidents took place near the Ukrainian border, and Ukraine routinely jams GPS signals to knock them off course. CNN reported a lack of consensus among Nato intelligence officials about whether these cases were deliberate – or simply a more cavalier attitude to risk in Moscow.\nBut the Economist’s defence editor, Shashank Joshi, says that the drones travelled too deep into Poland for this to be a plausible explanation in his War Room newsletter. Jordan, too, described them as “at best, ‘accidental on purpose’ navigation errors”.\nIn any case, the Estonian incident appears hard to write off as a mistake, even if Russia denies it. “I would suggest that we are more likely to discover that Paddington Bear is a real live talking bear living in London before we find an instance of the Russians telling the truth about anything like this,” Jordan said. “This is a typical Russian approach of doing something and then denying it, even when there is clear evidence that it has to be them.”\nPoland’s foreign minister, Radosław Sikorski, told the Guardian that, because the drones were “all duds”, the most likely scenario was that “Russia tried to test us without starting a war”.\nOthers have pointed to reports that Washington has threatened to reduce security assistance programmes to Baltic states including Estonia, which might lead to a curiosity in Russia about whether Nato would maintain a united response to an incident there. And there is little doubt that Moscow will be seeking ways to warn the UK, France and other members of the “coalition of the willing” that it will back up its threats of retaliation against any “reassurance force” posted in Ukraine.\nHow has Nato responded?\nAfter the initial drone incursions, there were signs of disunity within Nato: while eastern European nations and others firmly characterised them as deliberate, Donald Trump suggested that they might have been accidental. Nonetheless, a new operation, Eastern Sentry, was launched in response, with additional fighter jets and military assets from France, Germany, Denmark and the UK. British jets flew over Poland on Saturday as part of that operation.\nAfter the MiGs incursion into its airspace, Estonia requested a meeting of the UN security council, where Britain and Poland said they would shoot down Russian aircraft if it happens again.\nThat was not an indication of a new posture, but “a reaffirmation in public of what could be expected when certain rules of engagement criteria are reached”, Jordan said. Trump’s affirmative answer yesterday when asked if he would support Nato countries shooting down Russian aircraft was welcomed by Sikorski, who said on X: “Roger that.”\nIn the longer term, Nato allies are aware that their defences against drone incursions are insufficient. Seven EU member states will attend a meeting with the European Commission and Ukraine about developing a so-called “drone wall”, a defence system involving radar, cameras and other technology that would complement existing anti-missile systems.\n“It has highlighted the need for a counter-drone capability, something which has been apparent for a long time, and which Nato nations have been working on to varying degrees,” Jordan said. “Shooting them down would seem to be a high priority given the potential risks.”\nCould we see Russian jets shot down in future?\nThat is certainly the clear message from Nato. And some analysts argue that, far from escalating the conflict, such a measure is more likely to prompt Russia to back down, and should have happened already. They point to the day that Turkey downed a Russian jet near its border with Syria in 2015: as this Washington Post editorial argues, “The incident didn’t cause World War III, but it did make clear to Putin that he would pay a price for testing a country’s resolve.”\nBut there may be limits to the comparison for the incident in Estonia, unfolding in the context of the Ukraine war with tensions already at such a high. “There were other issues at play with Turkey,” Jordan said, such as the fact that Ankara had the capacity to block Russian access to the Mediterranean.\nOthers point out that there were elements of caution to the Russian infringement that would have made it harder to defend bringing the jets down. “Russians deviated only slightly from their usual route, left themselves the excuse of a navigational error, carried no visible armaments, and complied when Nato fighters forced them out,” MP and security expert Eerik-Niiles Kross wrote for Estonian World.\nJordan pointed out that between different Nato actors – in this case, the Estonian authorities and the Italian government whose jets were on patrol – there might be different rules of engagement. “They are generally – rightly – quite highly classified,” he said. “It it possible for there to be a collectively agreed set of rules or differing rules on a national basis. They are framed in terms of the amount of risk to one’s own forces or territory one is prepared to tolerate.”\nHow serious is the risk of escalation?\nThe first step of any further escalation would be new Russian incursions. That could happen “if the Russians think it may cause disruption or sow discord in Nato”, Jordan said. But “if Nato nations start bringing the drones down as a matter of course, then they will almost certainly stop”.\nDrone incursions alone are very unlikely to cause a significant escalation, he added. As for another jet, “they’d try it with drones first,” he said. “But I suspect Putin doesn’t have the appetite to risk one of his tactical aircraft being shot down – they are valuable in Ukraine, and it would be humiliating.”\nThe important thing for Nato countries in range of Russia is that even if Trump has publicly wavered, “Putin can’t be certain that the US would stay aloof if an Article 5 declaration was made” – that is, if Nato’s principle of an attack on one being an attack on all was invoked. “I’m not for one moment ruling it out, but I think we shouldn’t see military confrontation as an inevitable end point.”\nWhat else we’ve been reading\n-\nCornelius Taylor was crushed to death when a bulldozer came to clear his homeless encampment in Atlanta, Georgia. His death was meant to transform homelessness policy, but as this moving interview with his fiance shows, very little has changed. Aamna\n-\nThe populist right is increasingly besotted with Dubai as inspiration for Britain’s future. Jonathan Liew’s column is very good on how thoroughly they’re telling on themselves. Archie\n-\nThe UK exports thousands of tonnes of plastic waste to Turkey every year. What happens to it? A three-part investigative podcast reveals how Afghan refugees are exploited by factory owners and dying at an alarming rate. This interview with its host is harrowing. Aamna\n-\nThe latest dubious celebrity sucked into the Jeffrey Epstein vortex is, inevitably, Fergie. Marina Hyde reflects on her curious knack for friendship with “some Kazakh oligarch/sex Gulliver/other mysterious billionaire” who happens to be able to keep her in funds. Archie\n-\nMy colleague Chris Osuh has the fascinating story of how a bundle of letters discovered for sale on eBay by a man researching his roots has shed new light on prominent British families who amassed a fortune from slavery. Aamna\nSport\nFootball | Alexander Isak scored his first goal for Liverpool while Hugo Ekitike (above) was sent off after bagging a late winner as the hosts beat second-tier Southampton 2-1 at Anfield to reach the fourth round of the League Cup on Tuesday.\nCricket | Harold “Dickie” Bird, who transcended his role as a Test umpire to become one of the most recognisable figures in cricket, has died at 92.\nCricket | England will hit Australia with their fastest bowling attack in a generation – perhaps all time – after announcing their 16-man squad for the Ashes. Gus Atkinson, Jofra Archer, Brydon Carse and Josh Tongue are all named, with Mark Wood fit again after knee surgery in March.\nThe front pages\n“‘Your countries are going to hell,’” Trump tells European, is the splash on the Guardian on Wednesday. “Trump: West going to hell over migration,” says the Telegraph, while the Mirror sums up Trump’s address with the headline: “Deranged”.\n“Shoot down Russian jets in Nato’s sky, says Trump,” is the lead story at the Times, while Metro runs with “U.N. Sim-farm plot smashed.”\n“Email damns Starmer’s top aide in £740,000 donations row,” is the highlight at the Daily Mail. The i has “Reeves facing £30bn hole as pressure grows for tax hikes in her Budget,” and the Express: “500,000 OAPs to lose winter pay.”\n“Crocked Dani quits Strictly,” writes the Sun. Finally the FT with: “Eli Lilly boss joins pharma companies’ offensive against drug pricing regime.”\nToday in Focus\nRussia’s high-risk game in Nato skies\nOver the past two weeks, Russian drones and jets have entered the airspace of several European countries. Dan Sabbagh discusses the escalation along the Nato-Russia border.\nCartoon of the day | Martin Rowson\nThe Upside\nA bit of good news to remind you that the world’s not all bad\nAfro-descendant communities in Latin America have long cultivated “edible landscapes”, which grow in natural forests and mimic the surrounding flora.\nFor decades, those communities have argued that they play a critical role in protecting biodiversity and therefore need legal protection over their lands. But, until recently, there was little scientific data to support their claims. New research changes that.\nA paper published recently in Nature Communications Earth & Environment found more than half of (56%) formally recognised Afro-descendant lands in Brazil, Colombia, Ecuador and Suriname, overlaps with the highest 5% of biodiverse areas on Earth.\nIn Ecuador, the figure is striking: 99% of all Afro-descendant land is in biodiversity hotspots, while in Colombia almost 92% of Afro-descendant lands are in the top 5% of areas for biodiversity.\nSign up here for a weekly roundup of The Upside, sent to you every Sunday\nBored at work?\nAnd finally, the Guardian’s puzzles are here to keep you entertained throughout the day. Until tomorrow.",
  "word_count": 2331,
  "scraped_at": "2026-02-14T12:36:25.987123"
}