{
  "article_id": "fa980d938e3e",
  "url": "https://www.winnipegfreepress.com/opinion/columnists/2025/08/22/the-beginning-of-a-bizarre-friendship",
  "title": "The beginning of a bizarre friendship – Winnipeg Free Press",
  "date": "20250822T213000Z",
  "domain": "winnipegfreepress.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "NHL and Serie A: The beginning of a bizarre friendship\nSerie A, NHL hobnobbing kicks off at Rossoneri season opener\nAdvertisement\nCanadian calcio fans will notice a curious crossover this weekend.\nRead this article for free:\nor\nAlready have an account? Log in here »\nTo continue reading, please subscribe:\nMonthly Digital Subscription\n$1 per week for 24 weeks*\n- Enjoy unlimited reading on winnipegfreepress.com\n- Read the E-Edition, our digital replica newspaper\n- Access News Break, our award-winning app\n- Play interactive puzzles\n*Billed as $4.00 plus GST every four weeks. After 24 weeks, price increases to the regular rate of $19.95 plus GST every four weeks. Offer available to new and qualified returning subscribers only. Cancel any time.\nMonthly Digital Subscription\n$4.99/week*\n- Enjoy unlimited reading on winnipegfreepress.com\n- Read the E-Edition, our digital replica newspaper\n- Access News Break, our award-winning app\n- Play interactive puzzles\n*Billed as $19.95 plus GST every four weeks. Cancel any time.\nTo continue reading, please subscribe:\nAdd Free Press access to your Brandon Sun subscription for only an additional\n$1 for the first 4 weeks*\n*Your next subscription payment will increase by $1.00 and you will be charged $16.99 plus GST for four weeks. After four weeks, your payment will increase to $23.99 plus GST every four weeks.\nCanadian calcio fans will notice a curious crossover this weekend.\nRead unlimited articles for free today:\nor\nAlready have an account? Log in here »\nCanadian calcio fans will notice a curious crossover this weekend.\nSaturday, while AC Milan hosts Cremonese on the first matchday of the Serie A season (1:45 p.m., FuboTV), some familiar faces will appear in the San Siro stands.\nToronto Maple Leafs winger William Nylander will be in attendance, as will Carolina Hurricanes centre Sebastian Aho, defenceman Miro Heiskanen of the Dallas Stars and 23 other NHL players.\nNo, they haven’t organized a Lombardian stag party, and they’re not starring in a new season of The White Lotus.\nThey’re in Milan to promote the new Content Collaboration Partnership between the NHL and Serie A — an idea sparked by a viral Instagram post that showed Mika Zibanejad of the New York Rangers exchanging jerseys with Italian World Cup winners Andrea Pirlo and Marco Materazzi back in March.\nPrior to kickoff they’ll tour Inter Milan’s training facility, and they’ll do some more sweater-swapping with some to-be-named “legends” of the Rossoneri and Nerazzurri.\nBeyond that, it’s all a bit mysterious. Serie A’s New York office has stated the partnership will not be an influencer-fuelled social media stunt, which means that’s almost certainly what it will be.\nIf it’s easy to be cynical about a buzzwordy enterprise that’s tailor-made for AI, it’s because the relationship seems so totally random.\nThere is, however, an obvious connecting point in the upcoming Winter Olympics in Milan and Cortina d’Ampezzo.\nFor the first time since 2014, NHLers will compete at the Games — and hobnobbing with two of world football’s better-known clubs can only increase the hockey tournament’s visibility.\nAs host, Italy will also be icing a team and — while it won’t challenge the established powers — there’s a positive feeling in the group after winning promotion to the top tier of the World Championship in May. Its captain is Thomas Larkin, a former fifth-round pick of the Columbus Blue Jackets who grew up near Milan.\nIn the short term, it’s hockey that stands to gain from the football link-up. And beyond its Olympics promotion, the NHL will be keen to boost its numbers on DAZN, which streams the league in Italy and throughout Europe.\nSerie A, meanwhile, is playing the long game.\nDespite the more than 17 million Americans of Italian descent (Canada’s 2021 census counted about 1.5 million people of Italian heritage in this country), Serie A has struggled to break through in the United States.\nA 2023 report by World Soccer Talk — updated in 2024 — ranked it seventh in U.S. viewership, behind the top flights of England, Mexico, Spain and Germany, as well as Major League Soccer and the National Women’s Soccer League.\nIt is unclear how they expect hockey, which remains a niche sport in many U.S. markets, to help its numbers. A Serie A press release revealed the league will shadow the NHL’s International Broadcaster Summit, presumably for insight into global marketing and streaming strategies.\nStorytelling — something it feels the NHL does well — is also a growth area.\nSerie A has also stated that Italian football and elite-level hockey “are increasingly speaking the same language,” and that the collaboration is a chance to unite “two sporting passions.”\nAgain, it’s not entirely clear what that actually means.\nAs of Friday, neither AC Milan nor Inter had even mentioned the NHL partnership on any platform, in either Italian or English. Understandably, both clubs have been concentrating on pre-match preparations (Inter faces Torino on Monday, 1:45 p.m., FuboTV), and with the transfer window still open they’re making last-minute roster moves as well.\nTransfers are also the top stories at Italy’s major media companies, and they’re followed by previews of the upcoming U.S. Open, where Jannik Sinner is looking to defend his tennis title.\nAssuming the Milan clubs remember to fetch the hockey players from their hotel, it’s hard to see a “synergy,” as NHL deputy commissioner Bill Daly likes to say, beyond one or two Instagram posts, and maybe a couple more in the run-up to the Olympics.\nThis whole thing, don’t forget, was born from that Zibanejad-Pirlo-Materazzi photo. People liked it. They also like photos of athletes with puppies.\nBut maybe they’re onto something. Maybe Serie A can benefit from the “passion” of hockey’s fanbase, and maybe the NHL can add Northern Italy to its growing Central European footprint.\nThe proof will be in the number of fans they excite in their content crossover. That’s another growth area, because enthusiasm for…whatever this is…is currently at zero.\njerradpeters@gmail.com\njerradpeters.bsky.social\nOur newsroom depends on a growing audience of readers to power our journalism. If you are not a paid reader, please consider becoming a subscriber.\nOur newsroom depends on its audience of readers to power our journalism. Thank you for your support.\nHistory\nUpdated on Friday, August 22, 2025 8:45 PM CDT: Updates deck",
  "word_count": 1044,
  "scraped_at": "2026-02-14T12:12:19.241019"
}