{
  "article_id": "facfc240d6bd",
  "url": "https://www.burntorangenation.com/2023/2/8/23591044/longhorns-daily-news-texas-2023-cfp-big-12-bijan-robinson-nfl-draft",
  "title": "Longhorns Daily News : Texas predicted to play for 2023 CFP berth in Big 12 championship",
  "date": "20230208T193000Z",
  "domain": "burntorangenation.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "The Texas Longhorns have something to build on after a mildly disappointing 2022 college football season. Seemingly, talking heads and analysts across the country are picking up on these truths, too. So much, in fact, that 247Sports predicts the Longhorns will have a chance to compete for a College Football Playoff berth by the time the Big 12 Championship rolls around.\nLonghorns Daily News: Texas predicted to play for 2023 CFP berth in Big 12 championship\nPlus: Five former Longhorns receive NFL Combine invites\nFrom 247Sports: “Texas is set to return 10 starters on offense in 2023, the only players not coming back being Doak Walker winner Bijan Robinson. That’s a substantial hole to fill, sure, but this is a loaded unit on that side of the football, especially at wide receiver and quarterback. Given Alabama’s uncertainty at quarterback and a new offensive coordinator in Week 2, the Longhorns have a legitimate shot at winning that one on the road. And if that happens, you’re looking at a team with a quality victory in their back pocket that will become even stronger as the season progresses and the playoff conversation begins to materialize. If Quinn Ewers plays with consistency and defensive play was as good as it was last season (No. 2 in the conference), this will be the Longhorns’ most special season under Steve Sarkisian during what amounts to a win or go home year for him.”\nWHAT THEY’RE SAYING ABOUT THE LONGHORNS\nAustin American-Statesman: No. 20 Texas receives on-court boost from a healthy DeYona Gaston\n247Sports: Morning Brew: Here come the expectations for Texas football in 2023\n247Sports: Grading the 2023 Texas signing class\n247Sports: Texas roster departure tracker and scholarship list\nInside Texas: Texas Football: The last time the Longhorns... (Part 4)\nInside Texas: Promising sophomore moved to new position on offense\nInside Texas: Texas team quick hitters to satiate offseason thirst\nICYMI IN BURNT ORANGE NATION\nRECRUITING ROUNDUP\n247Sports: Five-star TE Duce Robinson sets decision deadline\n247Sports: The All-Impact Team: 2023 recruits who could play right away\nInside Texas: Texas Longhorns Wednesday recruiting intel\nInside Texas: How the Longhorns fared recruiting On3’s top 2023 prospects in Texas\nInside Texas: Five 2024 out of state prospects that jump off the screen\nInside Texas: Texas’ Blake Gideon is tenacious on the recruiting trail\nInside Texas: The five biggest need positions in UT’s 2024 recruiting class\nInside Texas: Texas Longhorns recruiting quick-hitters from South Dallas\nBIG 12 BREAKDOWN\n247Sports: The Daily Dish: The Big 12 is college basketball’s most thrilling conference\n247Sports: Big 12 football: Projected regular-season win totals for every team in 2023\nInside Texas: Texas ranks No. 19 in returning production according to ESPN, ahead of all but one Big 12 team\nFrogs O’ War: 2023 TCU Baseball Preview: Infielders\nBring On The Cats: K-State heats up late, buries TCU 82-61\nWHAT WE’RE READING\nSB Nation: Kareem Abdul-Jabbar wrote an incredible blog about LeBron James passing him in scoring\nSB Nation: Aaron Rodgers’ ‘darkness retreat’ is exactly as weird as it sounds\nSB Nation: Our ‘Madden’ sim of the Super Bowl was the greatest game of all time\nNEWS ACROSS LONGHORN NATION AND BEYOND\n- Five Longhorns have received an invite from the NFL Scouting Combine.\n- Texas women’s basketball takes on the Texas Tech Red Raiders tonight at 7pm Central.",
  "word_count": 554,
  "scraped_at": "2026-02-14T13:34:08.677968"
}