{
  "article_id": "fad7c6187cee",
  "url": "https://www.the42.ie/ballon-dor-winners-2025-6823993-Sep2025/",
  "title": "Dembele captures men Ballon dOr as Bonmati wins for third year in a row",
  "date": "20250922T220000Z",
  "domain": "the42.ie",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "FRANCE FORWARD OUSMANE Dembele won the men’s Ballon d’Or at a ceremony in Paris on Monday, the most prestigious individual award in football rewarding his starring role in the Paris Saint-Germain side that won the Champions League last season.\nDembele, 28, pipped Barcelona and Spain teenage sensation Lamine Yamal to the prize and succeeds Manchester City and Spain midfielder Rodri, who won the trophy in 2024.\nThe former Borussia Dortmund and Barcelona winger, who was part of the France team that won the World Cup in 2018, scored 35 goals in all competitions as PSG won a French league and cup double as well as the Champions League for the first time in their history.\n“I really don’t have the words. It was an incredible season with PSG,” said an emotional Dembele, who said his club coach Luis Enrique had been “like a father”.\n“It is an individual trophy but it was really the collective that won it,” added Dembele, who was one of nine members of the triumphant PSG team from last season nominated for the prize.\n“The Ballon d’Or has not really been an objective for me in my career but I worked hard for the team to win the Champions League.”\nThe 18-year-old Yamal, who was a teammate of Dembele’s at Barcelona when he first broke through in 2023, earlier won the Kopa Trophy for the best player aged under 21 – the second year running he has taken that award.\nMeanwhile, Barcelona and Spain star Aitana Bonmati won the Women’s Ballon d’Or, the third consecutive year she has taken the prize.\nBonmati edged out Mariona Caldentey, her teammate in the Spain side beaten on penalties by England in the Women’s Euro 2025 final in July.\nThe 27-year-old midfielder also lost the Women’s Champions League final with her club last season, at the hands of Caldentey’s Arsenal.\nBonmati was named player of the tournament at the Euros, despite not starting either of Spain’s first two matches as she recovered from a bout of viral meningitis.\nAlessia Russo, one of the nominees from the triumphant England European Championship team, came in third place.\nThe Ballon d’Or is the most prestigious individual prize in both men’s and women’s football, and Bonmati’s run of three in a row follows back-to-back victories for her Barcelona and Spain teammate Alexia Putellas.\nNorway’s Ada Hegerberg and USA star Megan Rapinoe are the only other players to have won the Women’s Ballon d’Or since it was introduced in 2018.",
  "word_count": 415,
  "scraped_at": "2026-02-14T12:36:39.554368"
}