{
  "article_id": "faf5bf4e7c59",
  "url": "https://www.si.com/nfl/giants/news/giants-cb-dru-phillips-reveals-he-had-this-procedure",
  "title": "Giants CB Dru Phillips Reveals He Had This Procedure",
  "date": "20250519T223000Z",
  "domain": "si.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Giants CB Dru Phillips Reveals He Had Vision Correction Procedure | News Briefs\nIn this story:\nMAY 19. GIANTS CB ANDRU PHILLIPS REVEALS HE HAD LASIK. New York Giants slot cornerback Andru Phillips revealed on his X (formerly Twitter) social media account that he recently underwent LASIK to correct a vision problem that warranted eyeglasses/contact lens usage.\n“LASIK was one of the best decisions I’ve made,” the second-year cornerback posted Monday, accompanied by a photo of the surgeon who performed his procedure.\n“The process was smooth, recovery was quick, and I’m now seeing 20/20. Couldn’t recommend them more!\nLASIK is a procedure often used to correct various conditions such as nearsightedness, farsightedness, and astigmatism. The procedure is done with a laser that reshapes the cornea of the eye\nIt’s unknown what specific vision issue Phillips had before his procedure, but whatever it was, it didn’t appear to hurt him during his rookie NFL season.\nPhillips finished 13th in NFL coverage rating (95.6) out of 23 cornerbacks with at least 250 coverage snaps in the slot. He allowed just one touchdown from the slot and had one interception.\nIf there is one part of the former Kentucky defender’s game that needs fixing, it’s his tackling. Phillips, per PFF, missed 11 tackles, tying him for third-most on the team with linebacker Bobby Okereke.\nMAY 15. GIANTS HAVE CHANGES ON COACHING STAFF, SCOUTING GROUP. New York Giants assistant coach Angela Baker, one of two women on New York Giants head coach Brian Daboll’s staff, is no longer listed on the team’s website on the coaching page.\nBaker was hired by Daboll in 2022 as a minority coaching fellow and offensive quality control coach. She had previously worked with the Cleveland Browns as part of the Bill Walsh Diversity Coaching Fellowship.\nThe team also hired Tyson Beane as a scouting assistant. Beane is the son of Bills general manager Brandon Beane, for whom current Giants general manager Joe Schoen worked under when the two were in Buffalo together.\nMAY 12. GIANTS SIGN CORNERBACK T.J. MOORE. The New York Giants have signed former Mercer Football All-American cornerback T.J. Moore, who attended the team’s rookie minicamp this past weekend.\nMoore, 6-foot and 185 pounds, appeared in 59 games over five seasons for the Bears. The Riverdale, Georgia native recorded 186 total tackles, 128 solo, and three tackles for loss.\nHe also had 11 interceptions (one returned for a touchdown), 32 pass breakups (including a career-best 20 last season), one forced fumble, and two fumble recoveries.\nMoore appeared in all ten games during his freshman season in 2021. During his sophomore campaign, he was named to the All-Southern Conference team and the Phil Steele watch list. He finished seventh that year in total tackles.\nThe Giants also announced they have waived DBs Tommy McCormick and RJ Delancey III.\nMAY 12. GIANTS RE-SIGN WR LIL’JORDAN HUMPHREY. The New York Giants have reportedly re-signed receiver Lil’Jordan Humphrey, whom they released three days ago to fit in their undrafted free agent signings.\nHumphrey initially signed a one-year, $1.245 million deal in March, which qualifies as a veteran minimum benefit. Presumably, this time, he received the same deal minus the $25,000 signing bonus he received in his initial Giants contract.\nThe 6-foot-4 Humphrey has played in 58 regular-season games, with 23 starts and three postseason appearances, most recently with Denver this past season. He’s part of a new wave of taller receivers the Giants have been looking to add to their roster.\nMAY 9. GIANTS RELEASE WR LIL’JORDAN HUMPHREY. The New York Giants released veteran receiver Lil’Jordan Humphrey just two months after signing him to a one-year, $1.245 million deal in March.\nHumphrey entered the NFL with the Saints as an undrafted free agent out of Texas in 2019. He spent three seasons with New Orleans before moving to the Patriots in 2022. He was most recently with the Broncos, where he spent two seasons.\nThe 6-foot-4 Humphrey has played in 58 regular-season games, with 23 starts and three postseason appearances, most recently with Denver this past season.\nThe 26-year-old has caught 62 out of 92 pass targets for 770 yards (12.4 average) and 7 touchdowns. He has played every game over the last two seasons and posted his best single-season figures in receptions (31) and receiving yardage (293) last year with Denver.\nThe Giants gained $1.08 million on their salary cap, some of which was used to sign players from their rookie draft class.\nMAY 8. GIANTS UDFA DEFENDER SUFFERS TORN PEC MUSCLE. The New York Giants recently completed Phase 1 of their offseason program, the strength and conditioning phase. Unfortunately, one player won’t make it through the remaining two phases.\nESPN reported that outside linebacker Victor Dimukeje suffered a torn pectoral muscle during an offseason workout. This likely means that Dimukeje will miss several months while he recovers from the injury.\nDimukeje, who signed with the Giants this past offseason after spending the first four seasons of his career with the Arizona Cardinals, who selected him in the sixth round of the 2021 draft out of Duke.\nThe 6-foot-2, 262-pounder played in 55 games, with eight starts. He recorded 67 tackles and four sacks, all of which came in 2023.\nDuring his rookie season, Dimukeje was primarily a special-teams player for the Cardinals. Seventeen of his career tackles (eight solo) have come playing on special teams.\nDimukeje signed a one-year veteran minimum benefit contract with the Giants, which included a $1.17 million base salary and a $167,000 signing bonus. He was set to count for $1.197 million against the team’s 2025 salary cap.\nMAY 6. GIANTS HIRE FORMER NFL DEFENSIVE BACK FOR FRONT OFFICE ROLE. The New York Giants announced that they have hired former safety Usama Young to fill their Vice President of Player Engagement role.\nYoung appears to have replaced long-time Director of Player Engagement Ashley Lynn, who is no longer listed on the Giants’ website.\nPrior to joining the Giants, Young had been in the NFL Player Enrichment office since 2017. His role is to support players and their families by guiding them toward continuing education, financial, and professional enrichment programs. He also worked with incoming rookies to ensure they had access to programs and resources to help them flourish as they transitioned from college to the pros.\nYoung, a third-round draft pick by the New Orleans Saints in 2007, spent eight seasons in the league, including four with the Saints, two with the Browns, and two with the Raiders, before calling it a career after the 2014 season.\nMAY 2. GIANTS PART WITH NATIONAL SCOUT. With the 2025 NFL draft over, the New York Giants have begun tweaking their scouting department.\nNational scout Mike Derice, who was hired by the team in 2022, general manager Joe Schoen’s first season, is no longer listed on the team’s website.\nDerice, who had been with the Giants for three seasons, was once included in a survey of 26 NFL-certified agents as “a future GM to watch,” a poll conducted by The Athletic. Derice had received at least one vote from those surveyed.\nBefore joining the Giants, Derice had been with the Indianapolis Colts, with whom he had been for ten seasons. His path briefly crossed with current Giants assistant general manager Brandon Brown during the 2015-16 season.\nMAY 1. GIANTS LEGENDARY LINEBACKER TO GET HOLLYWOOD ROYAL TREATMENT. For 13 years, New York Giants Hall of Fame linebacker Lawrence Taylor was a larger-than-life presence on scores of televisions every Sunday.\nNow, football fans who marvelled over Taylor’s relentless play or who might have missed his era but have seen highlights on YouTube, will soon get a chance to get the real story of the man who changed the way the position was played.\nThe former New York Giants legend and NFL Hall of Famer will be the subject of A Giant Amongst Men. This multi-platform media project will include a narrative feature, a limited series, and a documentary.\nThe project is being spearheaded by Stoked Sports & Entertainment, a Beverly Hills-based management and production company that recently struck an exclusive deal with BEL Productions for Taylor’s life rights.\nStoked Sports & Entertainment, co-founded by former NBA player turned filmmaker Jarnell Stokes, focuses on helping athletes and other crossover talent transition into various industries beyond sports.\nThe project is in its early developmental stage, so casting has not been announced yet. But the project will delve into Taylor’s life both on and off the field, including the controversies that surrounded him during the height of his career.\nThe project’s executive producers will include actor-producers Blake Leon (American Gigolo) and Curran Walters (Titans) for BEL Productions, as well as Jarnell Stokes, Aisha Corpas Wynn, Beth Fryman Poulin, Sean Mik’ael Butler, and Patrick Strøm for Stoked Sports & Entertainment.\nCasting and other key contributors, such as writers and directors, will be determined in the coming months.\nMAY 1. REPORT: GIANTS UDFA GETS FIFTH-HIGHEST GUARANTEED MONEY AMONG UDFAs LEAGUE-WIDE. Every year after the draft, the New York Giants, in their quest to land undrafted free-agent talent, often increase the amount of money offered to specific players.\nThey have reportedly done so again, giving undrafted free agent receiver Da’Quan Felton $264,000 in total guaranteed money. This is currently the fifth-richest deal for a 2025 UDFA league-wide.\nFelton, 6-foot-5 and 213 pounds out of Virginia Tech, combines premium height, length, and speed (4.5 40-yard dash at the combine). He started his collegiate career at Norfolk State, gaining an extra year of eligibility after the program was put on hold during the 2020 season due to the COVID-19 pandemic.\nHe finished his time at Norfolk State as a second-team All-MEAC honoree, leading the team with 39 receptions, 573 yards, and seven touchdowns in 11 starts.\nFelton, whose father Ron was a tight end at Norfolk State and his cousin, Shyron Stith, was a running back at Virginia Tech and the NFL (Jaguars in 2000 and Colts in 2002), appeared in 48 games with 42 starts over his college career. He caught 137 passes for 2,090 yards and 19 touchdowns.\nThe Giants will hold their rookie minicamp on May 9-10 next weekend.\nMore 2025 New York Giants News Briefs\nJOIN US ON SOCIAL MEDIA! Follow and like us on Facebook. Don't forget to check out our YouTube channel. And if you want to send a letter to our mailbag, you can do so here.\nMore New York Giants Coverage\nPatricia Traina has covered the New York Giants for 30+ seasons, and her work has appeared in multiple media outlets, including The Athletic, Forbes, Bleacher Report, and the Sports Illustrated media group. As a credentialed New York Giants press corps member, Patricia has also covered five Super Bowls (three featuring the Giants), the annual NFL draft, and the NFL Scouting Combine. She is the author of The Big 50: The Men and Moments that Made the New York Giants. In addition to her work with New York Giants On SI, Patricia hosts the Locked On Giants podcast. Patricia is also a member of the Pro Football Writers of America and the Football Writers Association of America.\nFollow Patricia_Traina",
  "word_count": 1860,
  "scraped_at": "2026-02-14T13:32:22.659991"
}