{
  "article_id": "fafcc12d8fb8",
  "url": "http://www.allgov.com/departments/department-of-defense/department-of-the-air-force?agencyid=7375",
  "title": "AllGov - Departments",
  "date": "20230605T084500Z",
  "domain": "allgov.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Overview:\nmore\nless\nThe U.S. Air Force (USAF) constitutes the aviation component of the Armed Services, providing tactical, strategic, and logistical air support for U.S. military operations. The USAF also is charged with operational command of U.S. nuclear forces. Some of the most advanced weapons systems in the U.S. military have been developed for the Air Force, often at great costs and involving much controversy.\nHistory:\nmore\nless\nThe Air Force’s origins reside in the U.S. Army Signal Corps, which established a small Aeronautical Division in 1907 responsible for all matters pertaining to military balloons, “air machines and all kindred subjects.” The Signal Corps tested its first airplane at Fort Myer, Virginia, in 1908. By 1912 the Signal Corps had acquired 11 aircraft. The following year the Army ordered its aviators to Texas to take part in maneuvers where the assembled men and equipment were designated the “1st Provisional Aero Squadron,” making it the Army’s first unit devoted exclusively to aviation. It was subsequently designated the 1st Aero Squadron and even later the 1st Reconnaissance Squadron, which has remained continuously active to this day.\nIn 1914 Congress created in the Signal Corps an Aviation Section to replace the Aeronautical Division and directed the new section to operate and supervise all military aircraft, including balloons, and to train officers and enlisted men in matters pertaining to military aviation. When World War I broke out in Europe in August 1914, the 1st Aero Squadron represented the entire tactical air strength of the Army. It counted 12 officers, 54 enlisted men and six aircraft. By the end of the war, there were 185 squadrons consisting of 740 American aircraft, which only represented 10% of the total aircraft strength of Allied nations. American squadrons only saw combat during the last nine months of the war, conducting 150 separate bombing attacks, while downing 756 enemy aircraft and 76 enemy balloons, but losing 289 airplanes and 48 balloons.\nBefore the war ended, President Woodrow Wilson issued an executive order in 1918 transferring aviation from the Signal Corps to the newly created Air Service of the U.S. Army. Like the rest of the Army, the Air Service underwent demobilization, leaving it with only 22 squadrons. Officer strength plummeted from 19,189 to 1,168 and enlisted strength dropped from 178,149 to 8,428.\nAside from a name change, from Air Service to Air Corps in 1926, the inter-war period was marked mostly by the establishment of new training centers for pilots. In August 1926 the Army established the Air Corps Training Center in San Antonio, Texas. Randolph Field, in Texas, became the “West Point of the Air” and the headquarters of the Air Corps Training Center in 1931. By 1932 the Air Corps had grown to 1,305 officers and 13,400 enlisted men, including cadets, and possessed 1,709 aircraft.\nAs the likelihood of war grew in Europe during the 1930s, President Franklin D. Roosevelt acknowledged the growing importance of airpower, prompting the Air Corps to prepare plans in October 1938 for a force of some 7,000 aircraft. Soon afterward, President Roosevelt asked the War Department to prepare a program for 10,000 airplanes, of which 7,500 would be combat aircraft.\nBeginning in September 1939, the German military’s rapid conquering of Poland, Norway, Holland, Belgium, and France was aided by the Luftwaffe, demonstrating to American leaders the importance of air power. Leaders of the Air Corps found themselves in the novel position of receiving practically anything they requested. Plans soon called for 54 combat groups, then 84 combat groups. All told, the strength of the U.S. Army air forces in World War II swelled from 26,500 men and 2,200 aircraft in 1939 to 2,253,000 men and 63,715 aircraft in 1945.\nIn the early stages of WWII, American combat planes such as the P-40 struggled to compete in aerial dog-fighting with the Japanese Zero and the German Messerschmitt. But as the war progressed, military designers produced newer, more sophisticated fighters and bombers. Tactical aircraft like the P-51 Mustang allowed American pilots to gain the upper hand over their enemy counterparts. New long-range bombers, such as the B-17 Flying Fortress and B-29 Superfortress, became the backbone of the Army Air Corps strategic bombing campaigns designed to destroy the industrial war machine of Germany and Japan. Bombing missions gradually grew in size and frequency, pummeling German factory towns and major Japanese urban centers.\nAmerican air attacks caused considerable civilian casualties and controversy. In 1945, American and British bombers dropped incendiary bombs on Dresden, causing an enormous firestorm that destroyed large sections of the city and killed tens of thousands of Germans. A month later 300 B-29 bombers dropped nearly a half-million M-69 incendiary cylinders over Tokyo, causing a similar firestorm that destroyed some 16 square miles of the city. The attack killed between 83,000-100,000 Japanese.\nBut the most controversial bombings by American warplanes came in August 1945 when the United States dropped atomic bombs on Hiroshima and Nagasaki in an effort to shorten the war and avoid American military forces having to invade Japan. Both cities were obliterated, killing a combined 220,000 people and leaving thousands more sick and dying from radiation poisoning. The atomic attacks not only marked the beginning of America’s nuclear weapons program, but also cemented the Air Corps’ strategic importance in post-war military planning.\nShortly after the end of WWII, military leaders agreed to establish an independent branch of the services dedicated to air power. The U.S. Air Force (USAF) was formally created by the National Security Act of 1947. Within the USAF three new commands were set up: Strategic Air Command, Air Defense Command, and Tactical Air Command. These three commands represented the strategic, tactical and air defense missions that would serve as the foundation of the Air Force in the coming years of the Cold War.\nDuring the Cold War struggle between the U.S. and the Soviet Union (circa 1947-1991), the Air Force played a featured role for American military and political leaders. Only a year after being officially born, the Air Force was called upon by President Harry Truman to conduct a massive airlift of supplies to West Berlin after Russian forces cutoff the city’s land corridors to Western powers. The Berlin Airlift proved successful, forcing the Soviets to reopen West Berlin the following year. This event was only the beginning of the Air Force’s strategic place in American battles with the USSR.\nAs the nation’s nuclear weapons program grew during the 1950s, the Air Force was given the prime mission of delivering America’s strategic arsenal in the event of nuclear war with the Soviet Union. At first the focus was on bombers. A new generation of jet-powered aircraft took over USAF squadrons, most importantly the B-52 Stratofortress. Air wings comprised of B-52s, based both in the U.S. and overseas, were set up on round-the-clock aerial missions to fly toward the Soviet Union until reaching a “fail safe” point at which they turned around unless given the “go codes” from Strategic Air Command (SAC) to attack the USSR. This game of nuclear cat-and-mouse was depicted in the Hollywood films “Dr. Strangelove” and “Fail Safe.”\nThe Air Force’s role in American nuclear war planning grew more significant with the development of Intercontinental Ballistic Missiles (ICBMs) capable of delivering multiple warheads at targets in the USSR and China. SAC oversaw the operation of all U.S. ICBM silos, and it played key roles in the development of U.S. strategic doctrine, such as Massive Retaliation, Flexible Response, and Mutual Assured Destruction.\nUSAF squadrons continued to play important non-nuclear roles as well for the U.S. military. During the Korean War, American pilots engaged in the first combat missions involving jet fighters. Beginning with the Eisenhower administration, USAF pilots flew highly-secret reconnaissance missions over the USSR using U-2 spy planes. In 1960, USAF pilot Francis Gary Powers was shot down while flying his U-2 over Sverdlovsk. Powers was captured by the Soviets, and the incident proved a huge embarrassment for the Air Force and the U.S. government. It also escalated tensions between American and Russian leaders that later culminated with the Cuban Missile Crisis of 1962, the closest USAF commanders ever came to engaging American nuclear forces against the Soviets.\nDuring the Vietnam War, the Air Force performed some of the most controversial military missions of that era. Convinced that massive conventional bombing could turn the tide of the war in America’s favor, USAF commanders followed the strategic bombing philosophy of USAF General Curtis LeMay, the architect of America’s WWII strategic bombing campaign, who later organized Strategic Air Command. LeMay was quoted in 1968 as saying of the Vietnamese enemy that America should “bomb them back to the stone age,” and it nearly tried as more munitions were dropped on Vietnam than during WWII. This included not only massive attacks on North Vietnam but also secret missions inside Cambodia and Laos.\nWhen American planes weren’t dropping explosives on the Vietnam countryside, they were dispersing highly toxic chemicals, such as Agent Orange and other defoliants designed to destroy the thick jungles that North Vietnamese and Viet Cong forces used effectively to attack American soldiers. The aerial spraying wound up causing serious illnesses among many U.S. servicemen who fought long after the war for the Air Force and other branches of the military to recognize their mission-related sicknesses.\nWith no war to fight during the remainder of the 1970s, following America’s withdrawal from South Vietnam, the Air Force concentrated on modernizing its aircraft. New fighter and strategic bombers were ordered from defense contractors on the basis that the USAF had to stay ahead of the USSR for control of the skies. This modernization meant producing more sophisticated aircraft at substantially higher costs, a trend that the Air Force has continued to this day. Tactical fighters such as the F-15, which were first built in 1975, wound up costing $40 million a plane, and even more advanced stealth fighters that came along in the late 1980s cost $80 million a plane.\nNew bombers such as the B-1 and B-2 registered per aircraft costs in the $300-$400 million range. The B-1 proved to be especially costly for the USAF due to design flaws that forced Air Force commanders to alter the mission of the plane. Originally purchased to replace the aging B-52, the B-1 was supposed to be able to fly at low altitude in order to penetrate Soviet air defenses. Military planners later realized that the high-tech bomber was vulnerable to such defenses, forcing the Air Force to abandon its plan of replacing the B-52, which continues to serve in USAF squadrons to this day. Although another high-tech bomber, the B-2, proved more reliable in terms of performance, its price tag of almost a half-billion dollars per plane made it impossible for the Air Force to purchase the aircraft in the quantity it had originally proposed.\nIn addition to pricey new aircraft, the Air Force also became involved in new strategic nuclear weapons systems advocated by President Ronald Reagan. The MX missile first began development in the 1970s, but support for it waned until the Reagan years, when the administration wanted to subdue the Soviet Union by bolstering America’s nuclear first-strike capability. Capable of carrying 10 nuclear warheads (three times the number of other ICBMs), the MX proved vulnerable to the Soviet’s new generation of highly accurate long-range missiles, causing some American policymakers to call for building a huge underground railroad system upon which the MX would ride. This provoked outrage by both anti-nuclear activists and political leaders in Western states where the mobile MX would be based. Ultimately, the administration chose to order fewer missiles and simply place them in old, vulnerable Minutemen III silos.\nEven more controversial was President Reagan’s Strategic Defense Initiative (SDI), or “Star Wars” concept. Influenced by the vision of scientist Edward Teller, father of the hydrogen bomb, President Reagan in 1983 called for a defensive shield to protect the U.S. from missile attack. The ambitious plan called for developing space-based laser and other kinetic-kill weapons that were decades away from becoming operational, if they could work at all. Cost estimates put the price tag for SDI in the hundreds of billions of dollars, prompting the Air Force along with other military branches to promote new projects to gain a share of research-and-development monies. Momentum for Star Wars waned as the Cold War came to an end, although the program continues to live on through the Missile Defense Agency.\nIt wasn’t until after the Cold War that the Air Force got the chance to fully demonstrate the capability of its modernized aircraft. But instead of taking on the Russian Red Army, USAF pilots helped smash the Iraqi army during the Gulf War of 1990-91. As part of Operation Desert Shield, Air Force squadrons were some of the first American military units to engage Iraqi air and ground forces. Some of the most prominent images recorded during the war featured USAF weapons systems, such as laser-guided bombs destroying Iraqi bunkers, stealth fighters and bombers attacking under the cover of darkness or the slow-moving A-10 Thunderbolt attack aircraft effectively destroying the Soviet-made tanks that comprised Iraq’s armored units occupying Kuwait.\nWhen hijackers crashed civilian airliners into the World Trade Center towers and the Pentagon on Sept. 11, 2001, the Air Force found itself at a readiness level not seen in the United States. With fears running high of more assaults from the skies, USAF squadrons of F-15s were scrambled with orders to shoot down unidentified aircraft in American air space. Squadrons remained on high alert for months after 9/11 in the event of possible attack.\nBy 2008, budget tightening saw the Air Force’s active-duty force drop to 330,000, which was 64% of what it had been at the end of the Gulf War in 1991. In June 2008, an upheaval in Air Force leadership took place following disputes it had with Secretary of Defense Robert Gates, and in the aftermath of two incidents that involved the Air Force’s mishandling of nuclear weapons. Citing \"systemic issues associated with declining Air Force nuclear mission focus and performance,\" Gates accepted the forced resignations of Secretary of the Air Force Michael Wynne and the Air Force Chief of Staff Gen. T. Michael Moseley.\nIn July 2009, the Air Force released its plans for unmanned aerial vehicles through the year 2047, revealing that a third of all future aircraft that it purchases will be unmanned.\nRemembering the Dresden bombing (by Jacqueline Head, BBC)\n1945 Tokyo Firebombing Left Legacy of Terror, Pain (by Joseph Coleman, Associated Press)\nWhat it Does:\nmore\nless\nThe U.S. Air Force (USAF) constitutes the aviation component of the Armed Services, providing tactical, strategic and logistical air support for U.S. military operations. The USAF also is charged with operational command of U.S. nuclear forces.\nIn order to carry out its missions, the Air Force separates its forces into nine major commands and their subordinate units. Major commands are organized either on a functional basis in the United States or a geographic basis overseas. They organize, administer, equip, and train their subordinate elements. Major commands generally are assigned specific responsibilities based on functions. In descending order of command and authority, elements of major commands include numbered air forces, wings, groups, squadrons, and flights.\nThe basic unit for generating and employing combat capability is the wing, which has always been the Air Forces prime war-fighting instrument. Composite wings operate more than one kind of aircraft. Other wings operate a single aircraft type, such as F-15s, ready to join air campaigns anywhere they are needed. Within a particular wing are the operations, logistics and support groups needed to make the wing function.\nThe 13 major commands and components of the USAF are as follows:\n- Air Combat Command (ACC), headquartered at Langley Air Force Base, Virginia, was created June 1, 1992, by combining its predecessors, Strategic Air Command and Tactical Air Command. ACC’s mission is to provide combat airpower to U.S. military warfighting commands. It operates fighter, bomber, reconnaissance, battle-management, and electronic-combat aircraft. It also provides command, control, communications, and intelligence systems, and conducts global information operations.\nThe ACC provides the air component to U.S. Central, Southern, and Northern Commands. It also augments forces to U.S. European, Pacific, and Strategic Command.\nThe ACC commands several numbered air forces that provide security for the continental United States. First Air Force, with headquarters at Tyndall AFB, Florida, provides surveillance and command and control for air defense forces for the continental United States in support of the North American Aerospace Defense Command (NORAD). Eighth Air Force, with headquarters at Barksdale Air Force, Louisiana, supports ACC in providing command and control, intelligence, surveillance, and reconnaissance; long-range attack; and information operations forces to Air Force components and warfighting commands. Ninth Air Force, with headquarters at Shaw Air Force Base, South Carolina, controls ACC fighter forces based on the East Coast and serves as the air component for a 25-nation area within the U.S. Central Command area of responsibility (Middle East, Southwest Asia, Northeast Africa). Tenth Air Force, located at Naval Air Station Joint Reserve Base, Fort Worth, Texas, directs the activities of more than 13,300 reservists and 900 civilians located at 28 installations throughout the United States. Twelfth Air Force, with headquarters at Davis-Monthan AFB, Arizona, controls the ACC's conventional fighter and bomber forces based in the western United States and has the warfighting responsibility for U.S. Southern Command (Central and South America).\n- Air Education and Training Command (AETC), with headquarters at Randolph Air Force Base near San Antonio, Texas, is responsible for training all USAF personnel. AETC consists of 13 bases, more than 43,000 active-duty members and 14,000 civilians. The command has responsibility for approximately 1,600 aircraft. It includes the Air Force Recruiting Service, two numbered air forces and the Air University.\nSecond Air Force, with headquarters at Keesler AFB, Mississippi, is responsible for conducting basic military and technical training for Air Force enlisted members and support officers. The first stop for all Air Force, Air National Guard and Air Force Reserve enlisted people is basic military training at Lackland AFB, Texas. Nineteenth Air Force, with headquarters at Randolph AFB, Texas, conducts AETC's flying training.\nAir University, headquartered at Maxwell AFB, Alabama, conducts professional military education, graduate education and professional continuing education for officers, enlisted members and civilians throughout their careers.\n- Air Force Materiel Command (AFMC), with headquarters at Wright-Patterson Air Force Base, Ohio, conducts research, development, testing and evaluation, and provides acquisition management services and logistics support necessary to keep Air Force weapon systems ready for war. It equips the Air Force with weapon systems through the Air Force Research Laboratory and several centers which are responsible for the “cradle-to-grave” oversight for aircraft, electronic systems, missiles and munitions.\n- Air Force Reserve Command (AFRC), with headquarters at Robins Air Force Base, Georgia, has 35 flying wings equipped with their own aircraft and nine associate units that share aircraft with an active-duty unit. There also are more than 620 mission support units in the AFRC, equipped and trained to provide a wide range of services, including medical and aeromedical evacuation, aerial port, civil engineer, security force, intelligence, communications, mobility support, logistics, and transportation operations.\nThe AFRC has 447 aircraft assigned to it. The inventory includes the F-16 Fighting Falcon, O/A-10 Thunderbolt II, C-5 Galaxy, C-141 Starlifter, C-130 Hercules, MC-130 Combat Talon I, HC-130, WC-130, KC-135 Stratotanker, B-52 Stratofortress and HH-60 Pave Hawk helicopter. On any given day, 99 percent of these aircraft are mission ready and able to deploy within 72 hours. These aircraft and support personnel become available to Air Combat Command, Air Mobility Command and Air Force Special Operations Command if mobilized. The aircraft and their crews are immediately deployable without need for additional training.\n- Air Force Space Command (AFSPC), with headquarters at Peterson Air Force Base, Colorado, defends North America through its space and intercontinental ballistic missile operations. AFSPC has two numbered air forces and two centers. Located at Vandenberg AFB, California, Fourteenth Air Force manages the generation and employment of space forces to support US Strategic Command and North American Aerospace Defense Command (NORAD). Twentieth Air Force, located at F.E. Warren AFB, Wyoming, operates and maintains the nation’s ICBMs. The Space and Missile Systems Center at Los Angeles AFB, California, designs and acquires all Air Force and most Department of Defense space systems. It oversees launches, completes on-orbit checkouts and then turns systems over to user agencies.\n- Air Force Special Operations Command (AFSOC), with headquarters at Hurlburt Field, Florida, provides Air Force special operations forces (SOF) for worldwide deployment and assignment to regional unified commands. The command’s SOF are composed of highly trained, rapidly deployable Airmen. These forces conduct global special operations missions ranging from precision application of firepower, to infiltration, exfiltration, resupply and refueling of SOF operational elements. AFSOC's unique capabilities include airborne radio and television broadcast for psychological operations. The command’s special tactics squadrons combine combat controllers, special operations weathermen and pararescuemen with other SOF to form versatile joint special operations teams.\n- Air Mobility Command (AMC), with headquarters at Scott AFB, Illinois, is responsible for rapid, global mobility and sustainment for America’s armed forces. The command also plays a crucial role in providing humanitarian support at home and around the world. AMC personnel—active duty, Air National Guard, Air Force Reserve, and civilians—provide airlift and aerial refueling for all U.S. armed forces. Many special duty and operational support aircraft and stateside aeromedical evacuation missions are also assigned to AMC.\n- Pacific Air Forces (PACAF), with headquarters at Hickam AFB, Hawaii, provides air and space power to promote U.S. interests in the Asia-Pacific region during peacetime, through crisis and in war. PACAF’s area of responsibility extends from the west coast of the United States to the east coast of Africa and from the Arctic to the Antarctic, more than 100 million square miles. The command’s major units are 5th Air Force, Yokota Air Base, Japan; 7th Air Force, Osan AB, South Korea; 11th Air Force, Elmendorf Air Force Base, Alaska; and 13th Air Force, Guam.\n- United States Air Forces in Europe (USAFE), with headquarters at Ramstein Air Base, Germany, serves as the air component of the U.S. European Command, a Department of Defense unified command. USAFE directs air operations in a theater spanning three continents, covering more than 20 million square miles, containing 91 countries, and possessing one-fourth of the world’s population. During the Cold War, USAFE was a fight-in-place force geared for a large-scale conflict with the Soviet Union and its Warsaw Pact allies. Since the fall of the Berlin Wall, it has transitioned to an Air Expeditionary Force with a mobile and deployable mix of people and resources that can simultaneously operate in multiple locations. Its role in Europe and Africa has included warfighting as well as humanitarian and peacekeeping operations. USAFE consists of seven main operating bases: RAF Lakenheath and RAF Mildenhall in England; Ramstein and Spangdahlem Air Bases in Germany, Aviano Air Base in Italy, Lajes Field in the Azores, and Incirlik Air Base in Turkey.\n- Air Force Global Strike Command (AFGSC) is assigned to both nuclear and conventional global strikes, with ICBM and dual-mission bomber forces under a single command. It is responsible for organizing, training and equipping ICBM, B-2 and B-52 bomber forces, as well as other deterrence capabilities, in support of combatant commanders. Its locations include Barksdale AFB in Louisiana (2nd Bomb Wing, 8th Air Force, and AFGSC), F.E. Warren AFB in Wyoming (90th Missile Wing, 341st Missile Wing, and 5th Bomb Wing), and Whiteman AFB in Missouri.\n- Air Force North is a component of the North American Aerospace Defense Command (NORAD) and the U.S. Northern Command (USNORTHCOM). It provides airspace surveillance and control and directs air sovereignty activities for the continental United States and other designated areas.\n- Air National Guard enforces federal authority, suppresses insurrection and defends the nation when mobilized by the president, Congress, or both. In conjunction with USAF, it participates in operations and exercises worldwide by direction of the Air Staff, major commands or joint/unified commands.\n- U.S. Air Forces Central (USAFCENT) is the air component of U.S. Central Command, and is responsible for air operations (unilaterally or in concert with coalition partners) and developing contingency plans in support of national objectives for USCENTCOM's 20-nation area of responsibility in Southwest Asia.\nA complete list of all aircraft employed by USAF can be found on their Web site.\nThe Air Force Reserve Handbook 2011 (pdf)\nAir University Catalog (pdf)\nFifth Air Force Nose Art Gallery\nFrom the Web Site of the Department of the Air Force\nWhere Does the Money Go:\nmore\nless\nAlmost all of the weapons, equipment and supplies used by the Air Force are provided through defense contractors. According USAspending.gov, in FY 2007, 79,087 different companies received Department of Defense contracts totaling $312 billion. However the top six companies, Lockheed Martin, Boeing, Northrop Grumman, General Dynamics, Raytheon, and BAE Systems, received almost one third of that money.\nThese six also help make up the top 25 defense contractors who do business with the Air Force, along with United Technologies Corp., North American Airlines, FedEx, Computer Sciences Corp., General Electric, Honeywell, MIT, and the Carlyle Group, among others. Some of the Air Force’s most important weapons systems, and their contractors, are:\n- A-10 Thunderbolt attack plane (Fairchild Republic Co.)\n- B-1 bomber (Boeing)\n- B-2 Spirit bomber (Northrop Grumman Corp. along with Boeing, Hughes Radar Systems Group, General Electric Aircraft Engine Group, and Vought Aircraft Industries, Inc.)\n- B-52 Stratofortress bomber (Boeing)\n- C-130 Hercules transport plane (Lockheed Martin)\n- C-17 Globemaster III transport plane (Boeing)\n- C-5 Galaxy transport plane (Lockheed)\n- F-15 Eagle fighter (Boeing, from McDonnell Douglas)\n- F-16 Fighting Falcon fighter (Lockheed Martin)\n- F-22 Raptor fighter (Lockheed Martin, Boeing)\n- KC-135 Stratotanker tanker (Boeing)\nControversy often swirls around the choice of a company to build a new plane for the Air Force. Take for example the task of midair refueling. For decades the Air Force used Boeing’s KC-135 (a rendition of the old 707 commercial jet) to refuel Air Force fighter and bombers on long missions. But with the aircraft reaching its service limits due to age, the Air Force tried to lease a modified version of Boeing’s 767 to replace the KC-135. The deal fell apart after accusations arose over costs and ethical violations (see Controversies).\nWith the failure of the Boeing lease deal, USAF officials turned their attention to buying a newly designed fuel tanker. In March 2008 the Air Force announced that Northrop Grumman was the winner of the KC-X competition for development and procurement of up to 179 tanker aircraft for approximately $35 billion. The initial contract for the newly named KC-45 called for the system design and development of four test aircraft for $1.5 billion. The first 18 aircraft will be delivered by 2017. The contract also included five production options targeted for 64 aircraft at $10.6 billion.\nThe Air Force’s decision to go with the Northrop Grumman team infuriated lawmakers in both chambers and both parties. Not mentioned in the Air Force public statement about the contract was the fact that the American subsidiary of the European defense conglomerate EADS, which includes aircraft maker Airbus, would help Northrup Grumman build the new tanker. Lawmakers charged that the selection shortchanged U.S. jobs, weakened the aerospace industrial base and created jobs in Europe at a time when the economy was headed for recession.\nSome of the Air Force contracts awarded in 2012 include:\n- $68 million contract to Lockheed Martin for support operation for the first two GPS III satellites\n- $6.9 billion Network Centric Solutions 2 contract to Iron Bow LLC for purchase of IT items\n- $5.4 million contract to MacAulay-Brown, Inc. for R&D on the LAIRCM program.\nUSASpending.gov also provides data on additional Air Force contractor transactions, such as these top five types of products purchased between FY 2002 and FY 2012: operational services ($264,750,276), hospital and infirmary construction ($69,542,904), air passenger service ($41,000,000), fuel oils ($39,404,243), and facilities operations support services ($16,976,171). During that period, more than $527 million was spent by the Air Force on 1,147 contractor transactions.\nThe top five recipients of that contractor spending were:\n1. Cerberus Capital Management L.P. $264,750,276\n2. Kiewit/ Cornerstone J/V $69,516,602\n3. Aircraft Charter Solutions Inc. $41,000,000\n4. TMV LLC $39,404,243\n5. Chenega Corporation $24,688,011\nAir Force Announces Tanker Contract (Air Force Link)\nAir Force faces fire for controversial tanker decision (by Roxana Tiron, The Hill)\nControversies:\nmore\nless\nCulture of Abuse of Women in the Air Force\nCritics have accused the U.S. Air Force of allowing a culture of abuse to exist toward women, owing to recent controversies involving pornography and sexual misconduct.\nIn January 2013, the Air Force announced it had discovered hundreds of examples of pornography as well as thousands of other inappropriate items at bases and facilities worldwide.\nInspections revealed about 32,000 items that fell into three categories: pornography, unprofessional material, and inappropriate or offensive material.\nThe discoveries came on the heels of media reports of sexual harassment and hostile working conditions for female airmen, and amid a growing scandal centered on Joint Base San Antonio-Lackland, Texas, over sexual misconduct by Air Force instructors toward trainees.\nAt least 25 military training instructors were investigated at Lackland, leading to charges against 11. As of late January 2013, five had been convicted of charges ranging from rape to inappropriate relationships with recruits.\nTwo commanding officers were removed, and six more received “disciplinary action.”\nPorn Sweep or Witch Hunt? (by Chris Carroll, Stars and Stripes)\nLackland Air Force Base Sex Scandal Report Cites 'Abuse Of Power' Amid Petraeus, Allen Probe (by Molly O’Toole, Huffington Post)\n9/11 Remains Mishandled at Dover AFB\nThe mortuary at Dover Air Force Base was heavily criticized after it was learned in 2012 that the remains of September 11 victims were dumped in a landfill, among other problems.\nDefense records, including emails, showed that Air Force officers considered burying the remains at sea before deciding to discard some and burn other parts of it as medical waste.\nIt was also reported that the Air Force dumped the burned partial remains of more than 270 American troops in a Virginia landfill between 2003 and 2008.\nIn response to the controversy, the Air Force began disciplinary actions against Col. Robert Edmondson, the former commander of the Air Force Mortuary Affairs Operations Center, and his civilian deputy, Trevor Dean.\nAn investigation by the Office of Special Counsel learned that Edmondson, Dean, and another supervisor had provided phony reasons to fire or punish four mortuary workers who had exposed problems there.\nSupervisor In Air Force Mortuary Controversy Faces Further Discipline (Fox News)\nDover Air Force Base Human Remains (Breaking News)\nAir Force Debated Disposal Of 9/11 Remains (by Lolita Baldor, Associated Press)\nControversial Photo\nA group of airmen created uproar in December 2011 after taking a photo with one of their buddies lying in an open casket, wearing a noose and chains across his body.\nThe Air Force personnel were part of the 37th Training Group at Lackland Air Force Base in Texas. Their commander launched an investigation into the matter.\nIncluded with the photo, which was posted on Facebook, was the caption: “Da Dumpt, Da Dumpt …. Sucks 2 Be U.”\nThe image surfaced shortly after the disclosure that the Air Force’s Port Mortuary at Dover Air Force Base in Delaware had lost and mishandled the remains of hundreds of dead soldiers.\nBut it was later determined that the photo was taken months before the mortuary controversy went public, leaving it unclear what the airmens’ point was, if any.\nCasket Photo Sparks Investigation At Lackland (by David Larter, Air Force Times)\nCasket Photo Sparks Air Force Investigation, Outrage (by James Eng, NBC News)\nOf Context and Caskets: No Wrongdoing in Controversial Photo (God and Country)\nRemains of 274 Air Force Troopers Dumped in Landfill\nThe U.S. Air Force was blasted publicly in 2011 for dumping the remains of dead American troops in a landfill between 2004 and 2008.\nThe cremated remains of at least 274 American military personnel were disposed in a Virginia landfill, and family members were not notified by the Air Force, which tried to cover up the scandal.\nIn late 2011, federal investigators complained of “gross mismanagement” at the morgue at Dover air base, the main port of entry for fallen American soldiers returning to the U.S.\nIt was discovered that body parts were left in freezers for months or even years, and in one incident, the disfigured arm of a dead marine was removed with a hacksaw, without permission from his parents, so that his body could fit into a coffin.\nReport: Air Force Dumped Remains Of 274 Troops In Landfill (MSNBC)\nUS Air Force Used Secret Landfill Site To Bury Soldiers (by Guy Adams, The Independent)\nAF Ripped Anew In Remains Controversy (by Pauline Jelinek, Associated Press)\nUSAF Drone Attack on Troops\nAn unmanned aircraft controlled by the U.S. Air Force accidentally killed two American military personnel in Afghanistan after they were mistaken for enemy combatants.\nThe two men, Marine Staff Sgt. Jeremy Smith and Navy Corpsman Benjamin Rast, were trying to reach a group of Marines coming under fire in Helmand province in April 2011 when the pilot of an Air Force drone spotted activity in the area. Thinking the unidentified figures were attackers, rather than reinforcements, the pilot launched Hellfire missiles at Smith and Rast, killing both.\nThe deaths were considered the first instances of friendly-fire deaths from drone attacks during the war.\nThe government investigated the incident and later determined the drone’s pilot committed no dereliction of duty.\nPredator Drone Mistakenly Kills 2 U.S. Servicemen: Report (by Cara Parks, Huffington Post)\nMultiple Missteps Led To Drone Killing U.S. Troops In Afghanistan (by David S. Cloud and David Zucchino, Los Angeles Times)\n2 US Servicemen Mistakenly Killed By Drone Attack In Afghanistan (by Jim Miklaszewski, NBC News)\nDrone Pilots Suffer High Rate of Burnout\nEven though operating drones is a relatively new type of combat job—and it’s done from thousands of miles away—pilots of the machines have quickly become burned out from guiding the unmanned aircraft during wartime.\nA six-month study conducted by the U.S. Air Force in 2011 found 29% of drone pilots suffered from burnout or high levels of fatigue. Furthermore, 17% were categorized as “clinically distressed,” which meant their stress was impacting their work and/or personal lives.\nPart of the problem is that the personnel who operate drones do so during working hours, then go home to families, with their own stressful circumstances. They also watch the same areas in Afghanistan or Iraq for long periods of time and learn about the daily lives of their “targets” and their families, before sending drones in on them.\nA large majority of the 1,100 pilots who control drones said they were not getting any psychological counseling for their stress.\nReport: High Levels Of 'Burnout' In U.S. Drone Pilots (by Rachel Martin, NPR)\nOverstretched U.S. Drone Pilots Face Stress Risk (by Phil Stewart, Reuters)\nWhy Overworked Drone Pilots Are Falling Victims To Stress (by Jill Reilly, Mail Online)\nUSAF C-17 Smuggles Drugs into Argentina\nA U.S. Air Force transport plane became the subject of an unusual diplomatic spat in 2011 between Washington and the government of Argentina.\nIn February, Argentine authorities accused the U.S. of sending a C-17 cargo plane full of contraband into their country. The large aircraft reportedly contained sophisticated communications equipment, GPS devices, high-power rifles, a machine gun and narcotics, plus expired pharmaceuticals including stimulants.\nThe supplies were in boxes stamped 7th Army Airborne Brigade, which is based in North Carolina. An aircraft manifest indicated the materials were for a training course involving Argentine police.\nForeign Minister Hector Timerman planned to file an official protest with Washington. He also called for a joint investigation into the matter to determine why the U.S. Air Force would violate Argentine laws.\nUS Air Force C17 Transport Caught Smuggling Arms And Drugs Into Argentina (Aletho News)\nUS Air Force C-17 Seized Over Argentine Drug Smuggling Accusations (RT.com)\nU.S. Airforce Plane Caught Smuggling Drugs (Drug War 101)\nDefense Cooperation Agreement with Colombia Causes Controversy\nThe United States and Colombia in 2009 signed a new military pact that alarmed many in the South American country.\nThe controversial Defense Cooperation Agreement (DCA) granted the U.S. military access to seven Colombian military bases for a period of 10 years. The declared purpose of the DCA was to support counternarcotic and counterinsurgency initiatives within Colombia.\nBut then a U.S. Air Force document surfaced that said the DCA would also help Washington counteract “anti-U.S. governments” in South America.\nAs it turned out, the DCA was stalled from going into effect. Colombia’s Constitutional Court struck down the DCA in 2010. The nation’s Congress could still vote to approve it, but the court decision was seen as a serious obstacle to the agreement being ratified.\nUnsettling Revelations Regarding U.S. Lease of Colombian Military Bases (by Christina Esquivel and Paulina Serna, Council on Hemispheric Affairs)\nColombian Court Strikes Down U.S. Defense Agreement (Just the Facts)\nBoeing Wins Contract after Protest\nTen years and multiple protests later, Boeing finally won a billion-dollar bid in 2011 to supply the U.S. Air Force with new midair refueling tankers.\nThe process began around 2001 when the Air Force first requested proposals from defense contractors. The competition came down to two companies: Boeing versus Northrop Grumman and EADS, based in Europe.\nIn 2008, the Air Force announced that the Northrop/EADS team had won the bid. This prompted Boeing to file a protest with the Government Accountability Office (GAO).\nBoeing claimed the Air Force turned a “fair, open and transparent competition” into “a process replete with irregularities” that placed the American manufacturer at a disadvantage.\nThe GAO reviewed the claim and decided to overturn the award. This forced the Air Force to start over again with the bidding.\nThen, it was Northrop and EADS’ turn to complain, saying the new guidelines favored Boeing. Northrop eventually pulled out of the competition, leaving EADS, with a tanker based on the Airbus A330, to duke it out with Boeing, which proposed one built around the 767 body. The Air Force decided, once and for all, to give Boeing the job in 2011.\nBoeing Protests U.S. Air Force Tanker Contract Award (Boeing)\nSummary of Boeing Tanker Protest (Wall Street Journal)\nBoeing Bid Beats Europe for Tanker (by Nathan Hodge, Wall Street Journal)\nAir Force Blocks Access to WikiLeaks Documents Online\nThe Air Force in 2010 cut off access to any Web site containing classified documents published by WikiLeaks.\nOfficials blocked Air Force personnel from reading more than two-dozen news sites, including The New York Times, the British newspaper The Guardian, the German magazine Der Spiegel, the Spanish newspaper El País and the French newspaper Le Monde.\nWhen personnel tried to view the websites, a warning message appeared on screen that read: “Access Denied: Internet usage is logged and monitored.”\nSome Air Force leaders admitted the ban might prove ineffective, since personnel could use personal computers at home to read the WikiLeaks materials.\nA few months later, the Air Force warned airmen to stay away from WikiLeaks altogether, less they risk being prosecuted for reading documents still considered classified by the U.S. government. The Air Force quickly retracted its threat.\nAir Force Clarifies WikiLeaks Directive (by Scott Fontaine, Air Force Times)\nAir Force Blocks Sites That Posted Secret Cables (by Eric Schmitt, New York Times)\nAir Force Cutting Off Access To WikiLeaks News (CNN)\nUS Air Force Blocks Staff From Websites Carrying WikiLeaks Cables (by Richard Adams, The Guardian)\nAir Force Blocks New York Times for Posting WikiLeaks Documents (by Glenn Halbrooks, About.com)\nUSAF Reserves Charged with Plagiarism\nThe U.S. Air Force Reserve was accused in 2010 of plagiarizing a song by the band the White Stripes for a television commercial that aired during the Super Bowl and ran on the Reserve’s Web site.\nThe White Stripes threatened “strong action” against the Air Force Reserve for ripping off the band’s 2002 hit “Fell in Love With a Girl.”\nBoth the Air Force Reserve and Fast Forward Music, the company that produced the commercial and had hired a musician to compose a tune for it, denied knowingly copying the Stripes’ tune.\nThe Air Force Reserve issued a statement in response to the White Stripes’ allegation, saying: “There was never any intention to utilize any existing music, or to sound like any music by the band White Stripes, or any other musical performer. Any similarity or likeness to any other music is completely unintentional. This ad was produced specifically for airing regional during the Super Bowl in some local markets. It was scheduled to be pulled after the Super Bowl. It only ran one time.” It was also pulled from the Web.\nWhite Stripes Vs. Air Force Reserve Ad: Musician Addresses Controversy: 'It's My Responsibility' (by Simon Vozick-Levinson, Entertainment Weekly)\nWhite Stripes Vs. U.S. Air Force Reserve Ad: Who's To Blame? (by Simon Vozick-Levinson, Entertainment Weekly)\nWhite Stripes Air Force Reserve Super Bowl Ad Controversy (Pop Crunch)\nUSAF Loses Contact with 50 ICBMs\nA missile base in Wyoming briefly lost contact with 50 underground ICBMs in October 2010.\nThe U.S. Air Force, which operates the country’s land-based missile force, said a technical malfunction severed communications for nearly an hour between airmen in the command facility and 50 Minuteman 3 ICBMs housed in silos at F.E. Warren Air Force Base.\nAir Force spokesman Lieutenant Colonel Todd Vician said base operators were able to monitor the security of the missiles while the problem was being fixed.\nAlthough the Air Force downplayed the seriousness of the glitch, it was important enough to inform the White House.\nThe 50 Minutemen represented one-third of the missiles at the Wyoming base and one-ninth of the nation’s ICBM arsenal.\nAir Force Loses Contact With 50 ICBMs at Wyoming Base (Global Security Newswire)\nOops! US Air Force Loses 50 Nukes (RT.com)\nCommunication With 50 Nuke Missiles Dropped in ICBM Snafu (by Noah Shachtman, Wired)\nUSAF and UFOs\nMore than half a dozen former Air Force personnel claimed in recent years that their branch of the service experienced numerous encounters with UFOs during the 1960s, ’70s, and ’80s.\nAt a 2010 news conference in Washington D.C., six former officers and one ex-enlisted man told the media that they either had personal sightings or seen reports from subordinates and others about UFOs hovering over U.S. nuclear missile silos or nuclear weapons storage areas during the Cold War.\nThree of the former Air Force officers said UFOs suspended themselves over silos near Montana’s Malmstrom Air Force Base in 1967 and somehow had temporarily deactivated some of the nuclear missiles.\nTwo years later, former Air Force Col. Charles Halt publicly accused the U.S. government of a UFO cover-up involving a secret agency charged with handling extraterrestrial visitations.\nHalt was the deputy base commander of the RAF Bentwaters military base in England who had witnessed, along with others, several UFO-related events at Rendlesham Forest in December 1980.\nHis remarks were made while serving on a panel of speakers (“Military UFOs: Secrets Revealed”) that included two former Air Force officers who were part of the infamous Project Blue Book that investigated UFOs in the 1950s and ’60s, and a former investigator with Britain’s Ministry of Defense.\nCharles Halt, Former Air Force Colonel, Accuses U.S. Of UFO Cover-Up (by Lee Speigel, Huffington Post)\nThe Air Force Releases Schematics On How To Build A Flying Saucer (by Robert Johnson, Business Insider)\nAliens Are Monitoring Our Nukes, Worry Ex-Air Force Officers (Fox News)\nEx-U.S. Air Force Security Policemen Discuss UFO Activity (Roger Marsh, Examiner.com)\nUFOs Eyed Nukes, Ex-Air Force Personnel Say (CNN)\nEx-Air Force Personnel: UFOs Deactivated Nukes (CBS News)\nSarah Palin and Russian Incursions Over Alaska\nWhile helping John McCain seek the White House in 2008, running mate Sarah Palin claimed Russian military jets had entered U.S. airspace over her state of Alaska. Furthermore, the governor claimed she was in the loop whenever the U.S. Air Force scrambled interceptors to meet unauthorized intruders.\nAfter Palin made these remarks, the New York Daily News reported that the Alaska governor possessed no command authority over the Air Force.\n“She doesn’t have any role in that process,” Air Force Maj. Allen Herritage, spokesman for the Alaska North American Aerospace Defense Command, told the Daily News.\nSteven Biegun, a McCain foreign policy adviser, explained that Palin was informed by her National Guard commander about any close encounters with the Russians. But the Alaska Air Guard, which Palin oversees, does not fly interception missions and merely performs airspace-watching missions under NORAD command.\nPalin’s remarks, which inferred that the Russians had entered U.S. airspace, also was corrected by the military. Officials said Russian bombers had skirted Alaskan airspace 20 times, but they had not violated it during Palin’s term in office.\nNORAD: Sarah Palin Has No Role In Guarding U.S. Airspace Despite Claims In Katie Couric Interview (by James Gordon Meek, New York Daily News)\nAir Force Contradicts Palin: No Russian Incursions Into U.S. Airspace During Her Tenure. (Think Progress)\nThe Russian Air Force Can See Sarah Palin’s House from their Bear Bombers (by Whitney Pitcher, A Time for Choosing)\nManhattan Flyover Causes Panic\nNew Yorkers went into a brief panic in April 2009 when Air Force One flew low over Manhattan as part of a photo op.\nThe plane, a backup to the one regularly used by the president, was accompanied by two F-16 fighters, while Air Force photographers snapped pictures of the aircraft and the New York City skyline, including the Statue of Liberty.\nSome workers in the financial district feared another September 11 attack was underway and began to evacuate buildings. The panic prompted Mayor Michael Bloomberg to publicly blast the White House for its actions.\nPresident Barack Obama was not onboard. He was, though, quite furious when he heard what happened.\nThe flyover was orchestrated by the White House Military Office, led by Louis Caldera, a former California politician who also served in the Clinton administration. Caldera apologized for the incident and resigned from his post within a month.\nWhite House Apologizes for Air Force Flyover (by A.G. Sulzberger and Matthew Wald, New York Times)\nAir Force One Photo Op Causes Panic In New York (Associated Press)\nFlyover Photos Of Controversial Air Force One Flight Released (by Cindy Adams, Examiner.com)\nOfficial Who OK'd Air Force One Jet Flyover Resigns (CNN)\nAir Force Runs Toxic Burn Pit in Iraq\nAn Air Force expert warned that an open-air “burn pit” at the largest U.S. base in Iraq may have exposed thousands of troops, contractors, and Iraqis to cancer-causing dioxins during the war.\nJoint Base Balad, the central logistics hub for U.S. forces in Iraq, regularly burned some 147 tons of poisons and hazardous medical waste per day, allowing dark plumes of smoke to waft over living quarters and the base’s hospital.\nAir Force Lieutenant Colonel Darrin Curtis, former bioenvironmental flight commander for Joint Base Balad, wrote in 2006 regarding the burning, which continued for two years after that: “In my professional opinion, there is an acute health hazard for individuals. There is also the possibility for chronic health hazards associated with the smoke.”\nBase operators burned a wide range of items, including Styrofoam, unexploded ordnance, petroleum products, plastics, rubber, dining facility trash, paint and solvents, and medical waste, including amputated limbs, according to Curtis.\nBurn Pit At Balad Raises Health Concerns (by Kelly Kennedy, Army Times)\nMilitary Burn Pits and Chronic Health Problems (LawyersandSettlement.com)\nStudy: Health Effects From Military Burn Pits Inconclusive (by Kelly Kennedy, USA Today)\nNuclear Weapons Incident Forces Resignations\nA major snafu involving half a dozen nuclear armed missiles caused two high-profile resignations within the Air Force in 2008.\nThe Air Force was publicly embarrassed after admitting that a B-52 bomber flew from its base in North Dakota to Louisiana, while the crew was completely unaware that six cruise missiles armed with nuclear warheads had been loaded onto the plane without authorization.\nThe warheads were supposed to have been removed from the missiles before they were taken from their storage bunker.\nAnother mistake came when Air Force personnel failed to notice or report that the warheads were missing from Minot Air Base, and yet another failure allowed the missiles to remain mounted on the B-52 for at least 36 hours without adhering to proper security precautions.\nAs a result of these blunders, and another involving the shipping to Taiwan of equipment capable of triggering a nuclear warhead, Air Force Chief of Staff General T. Michael Moseley and Secretary Michael W. Wynne resigned from their posts in June 2008.\n2007 United States Air Force nuclear weapons incident (Wikipedia)\nAir Force officials ousted over nuclear gaffes (CNN)\nAir Force Fails New Nuclear Reviews (by Bill Gertz, Washington Times)\nUSAF Blog Ban\nAir Force leaders upset personnel in 2008 with a new policy that essentially banned them from reading blogs while working by setting up a filtering system.\nImplemented by the Air Force Network Operations Center, the policy interfered with the work of personnel who followed certain blogs on military subjects ranging from counterterrorism to defense technology, critics argued.\nBut Air Force brass claimed the reading of blogs posed potential security risks, despite the fact that the Army and the Navy had been reaching out to bloggers more and more to counter negative impressions of the departments.\nRetired Air Force Colonel Tom Erhard, a senior fellow at the Center for Strategic and Budgetary Assessments, told Wired: “It is increasingly clear that active exploitation could take advantage of airmen and civilians who want to inform and correct the often outrageous, false assertions on these blogs.”\nUS Air Force Shoots Down Blogs, Airmen Frustrated (by Ryan Paul, Ars Technica)\nAir Force Releases ‘Counter-Blog’ Marching Orders (by Noah Shachtman, Wired)\nAir Force Bomb Wing Flunks Nuclear Inspection\nA strategic bomb wing based in North Dakota flunked an important security inspection in 2008, and cost its commander his job.\nThe 5th Bomb Wing at Minot Air Force Base was subjected to a defense nuclear surety inspection by the Defense Threat Reduction Agency (DTRA). After reviewing the wing’s procedures and personnel for a week, the DTRA gave the unit an “unsatisfactory” grade.\nInspectors found security broke down on multiple levels during simulated attacks across the base, including against nuclear weapons storage areas. One security guard played video games on his cell phone while protecting a “restricted area perimeter,” while another airman was “unaware of her duties and responsibilities” during the exercise.\nThe poor performance followed another embarrassing episode for the air wing, when one of its B-52s took off loaded with six nuclear-tipped cruise missiles, which constituted a violation of Air Force procedures.\nColonel Joel Westa had been assigned as the 5th Bomb Wing commander two years earlier in hopes that he could fix the wing’s problems after the B-52 incident. Westa was relieved of his command following the DTRA inspection. He later chose to retire from the service.\n5th Bomb Wing flunks nuclear inspection (by Michael Hoffman, Air Force Times)\nOusted Minot commander Westa to retire (by Michael Hoffman, Air Force Times)\nDominating Cyberspace\nThe U.S. Air Force, in coordination with the Department of Homeland Security, DARPA and other agencies, has a five-year, $30 billion plan to control all computers worldwide.\nAir Force Aims for “Full Control” of “Any and All” Computers (by Noah Shachtman, Wired)\nAttention Geeks and Hackers: Uncle Sam’s Cyber Force Wants You! (by William J. Astore, Dandelion Salad)\nTomgram: William Astore, Militarizing Your Cyberspace (by Tom Engelhardt, TomDispatch)\nDominant Cyber Offensive Engagement and Supporting Technology Funding Opportunity (Federal Business Opportunities)\nAir Force Commercials Über Alles\nA recent advertising campaign by the Air Force, purportedly intended to help with recruitment, created a backlash of criticism from both Congress and other branches of the military. The commercials featured troubling images of black-clad terrorists and the Chinese army followed by narration that stated, “Only the United States Air Force has the speed, power and vision to defend our nation for the century ahead. U.S. Air Force, above all.” Officials on Capitol Hill and in the Pentagon believed that the new Air Force ads were less about recruiting and more about lobbying for extra money.\nPart of a $25-million campaign called “Above All,” the ads did not highlight what the military offers individuals who join. Instead, they stressed how the Air Force protects the nation. Some Pentagon officials questioned why the Air Force needed recruiting ads at all since the service has had no trouble meeting its recruiting goals and was supposed to be downsizing, not growing.\nThe language used in the ads also was controversial. One Defense official said “Above All” evoked the phrase “über alles” from the national anthem used by Nazi Germany, which roughly translates to “above all.” Air Force officials insisted the commercials merely represented an innovative and necessary campaign, and that they brought in German language experts to make sure the “Above All” catchphrase did not evoke the words “über alles” with German speakers.\nTo some members of Congress, the recruiting ads looked suspiciously like a lobbying effort. Rep. John P. Murtha (D-Pennsylvania), chairman of the House Defense Appropriations Subcommittee, called the advertising campaign “outrageous” and questioned in a letter to Secretary of Defense Robert M. Gates whether it amounted to an illegal lobbying effort.\nRep. Allen Boyd (D-Florida) said Congress should “thoroughly examine” the ads. Rep. Jerry Lewis (R-California) was incensed over ads that seemed to target the Washington area. Two full-page newspaper ads ran in The Washington Post, which has a limited circulation outside the capital region, suggesting the ads were designed to lobby Congress.\nAlthough the Air Force is supposed to shrink, top officials asked Congress for money to halt the cuts and restore its ranks. The Air Force’s budget proposal stated the objective of the advertising campaign was to increase the service’s “brand awareness.”\n“If we are even thinking about turning around from a declining Air Force to an increasing Air Force, we need to show what we are doing in support of the nation,” said Air Force Secretary Michael W. Wynne. “We need the influencers not to think about the Air Force as a dead end.”\nAir Force ads’ intent questioned (by Julian E. Barnes and Peter Spiegel, Los Angeles Times)\nControversial Ad Shows Missile Destroying a Satellite\nThe U.S. Air Force in 2008 pulled a television advertisement depicting a missile destroying an American satellite after critics complained about the content.\nThe commercial, part of the Air Force’s “Above All” recruiting and public-relations campaign, contended that a single missile could knock out cell phone calls, television programming, and GPS navigation.\nAfter pulling the ad, the Air Force promised to bring it back with a new story line.\nGPS experts said several GPS satellites would have to be destroyed to disrupt phone and banking services, demonstrating that the commercial was inaccurate and hyperbolic.\nU.S. Air Force Pulls Controversial TV Spot (by Ben Iannotta, Defense News)\nAir Force to Farm out Strategy\nRelying on defense contractors to meet its mission goals is nothing new for the Air Force. But now USAF leaders apparently want to farm out their master strategizing as well.\nEvery four years, the Pentagon produces its Quadrennial Defense Review, “a comprehensive examination of the national defense strategy, force structure, force modernization plans, infrastructure, budget plan, and other elements of the defense program and policies of the United States with a view toward determining and expressing the defense strategy of the United States and establishing a defense program for the next 20 years,” according to DoD.\nThe Air Force provides its section of the review, detailing how it sees the future of military aviation. But instead of writing it themselves, Air Force officials published a notice saying they were looking for a company “to provide the focal point for the Air Force Quadrennial Defense Review ... through an integrated process that reaches across the Department of Defense, supporting the Chief of Staff's global strategic vision while preparing our nation to fight and win in air, space, and cyberspace.”\nAir Force to Contractors: Come Up With Our Strategy (by Noah Shachtman, Wired)\nWeapons Procurement Waste and Corruption\nIn March 2008 the Government Accountability Office released a scathing report on the status of numerous weapons projects being developed for the Pentagon. Government auditors found programs for new ships, aircraft and satellites were billions of dollars over budget and years behind schedule.\nAmong the major programs reviewed was Lockheed Martin’s F-35 Joint Strike Fighter, a stealthy tactical fighter intended for the Air Force and Navy. Cost projections had put the price tag at almost $100 million per plane, up 40% since 2001. In a statement, Lockheed said that the Joint Strike Fighter was “performing solidly, making outstanding technical progress in the context of the most complex aircraft ever built” and that “the bedrock and the cornerstone” of the F-35 program have been “affordability and cost containment.” Problems had emerged in the F-35’s performance, including engine air intake restrictions and wobbling while hovering. Consequently, the aircraft was put on probation in 2011 by then-Secretary of Defense Robert Gates. That decision was reversed in 2012 by Secretary Leon Panetta, who claimed progress had been made in correcting the problems. A strike of union workers at Lockheed factories in May compounded the craft’s problems. Overall program delays have affected the global market for F-35 sales.\nIn another case, the initial contract target price of Boeing’s program to modernize avionics in the C-130 cargo plane was expected to skyrocket 323%, to $2 billion. The contract award, which finally came in at $4.1 billion, had been challenged by Lockheed Martin and other bidders after US Air Force acquisition official Darleen Druyun confessed to having favored Boeing out of gratitude for jobs that Boeing gave to her daughter and future son-in-law. She was sentenced to nine months in prison and fined for a series of conflict-of-interest violations. Following the scandal, the Air Force planned to invite new bids for the contract, then made an unsuccessful attempt to kill the program in 2009. A year later, 198 of the crafts were on the books to receive the avionics upgrade at an initial cost of $14 million per plane. The Pentagon finally cancelled the program in 2012.\nThe GAO report said the reasons for the cost overruns and delays were threefold: too many programs chasing too few dollars; technologies not mature enough to go into production; too long to design, develop and produce a system.\n“They’re asking for something that they’re not sure can be built, given existing technologies, and that’s risky,” said a GAO official.\nThe GAO’s March 2012 report on Pentagon weapons projects concluded that defense acquisitions have lagged behind policy and law. It also reported that major acquisition programs grew by over $74.4 billion during the preceding year, of which about $31.1 billion was attributable to “inefficiencies in production.” It added that an increase in acquisition costs have caused over 60% of the programs to lose “buying power,” preventing DoD from using its funds for other priorities.\nGAO Blasts Weapons Budget: Cost Overruns Hit $295 Billion (by Dana Hedgpeth, Washington Post)\nGAO Report: Defense Acquisitions - 2008 (pdf)\nGAO Report Defense Acquisitions – 2012 (pdf)\nAir Force Grounds F-15s, Brings in Troubled F-22s\nIn November 2007 the Air Force twice grounded its fleet of F-15 fighters. On Nov. 3, all 676 of the planes were grounded, even those supporting critical missions, after an F-15 crashed during an Air National Guard training exercise in Missouri. The plane had been among four planes engaging in one-on-one training flights in which speeds of 400 to 450 mph are typical. The pilot was forced to eject from the aircraft, which crashed harmlessly in the Missouri countryside.\nAir Force officials insisted the grounding stemmed only from the Missouri crash. However, three other F-15s crashed earlier that same year in separate incidents. In May, an F-15 crashed just outside of Vincennes in southwestern Indiana during a flight practice with four F-16 jets from the Indiana Air National Guard’s 181st Fighter Wing, based in Terre Haute. In June, another F-15 jet from the 142nd Fighter Wing, Oregon Air National Guard, went down in the Pacific Ocean during a training mission. And in a separate incident in June, an F-15 crashed near Eielson Air Force Base in Alaska.\nOn Nov. 21 the Air Force returned all of its F-15s to active service in spite of the fact that there had been concerns about structural failure in the case of the Missouri incident. But a week later, the Air Force again grounded the majority of the planes, 452 in all, after discovering defects in the metal rails that hold the F-15s fuselage together. USAF officials said the planes would remain grounded until each one was inspected and possibly repaired.\nThe plane is built by Boeing, which bought the aircraft from McDonnell Douglas. Boeing delivered the last F-15s to the Air Force in 2004. The Air Force planned to replace the aging fighter with the F-22 Raptor, built by Lockheed Martin. The Raptor joined the USAF fleet in 2005 amid much fanfare, with the Air Force expressing confidence in the craft’s speed, stealth and combat capabilities. However, a variety of factors—including the Raptor’s high cost, development of the more affordable F-35, and a federal ban on Raptor exports—led the Defense Department to halt all new orders of the F-22 in 2009, and funding for it was dropped in 2010. Production of the final Raptor was completed in December 2011. While it remains in operation, the Raptor has since been plagued by chronic problems with its pilot oxygen system. The fighter plane reportedly has the highest accident rate of any USAF aircraft currently in active service.\nAir Force grounds F-15 jets over Missouri crash: Boeing fighter planes probed for ‘structural failure’ after training accident (Associated Press)\nAir Force grounds F-15 fighter jets again: Boeing aircraft to be inspected after ‘possible fleet-wide’ problems found (Associated Press)\nF-22 Raptor pilots make problems public (by Rowan Scarborough, Washington Times)\nAir Force Officers Accused of Attacking Blackwater Contractor\nIn February 2006 the Air Force Times reported a bizarre incident involving two Air Force lieutenant colonels who were facing charges of assault and conduct unbecoming an officer after a face-off with a Blackwater contractor in Afghanistan. Accounts from the Air Force and the two officers, as well as their families, differed wildly.\nThe Air Force charged that the two officers, Lt. Col. Gary W. Brown and Lt. Col. Christopher R. Hall, initiated the incident by ramming the contractor’s sport utility vehicle. But family members of the two men said it was the other way around—that security contractor Jerry Bergeron rammed the Air Force SUV the two officers were in and that they responded to what they perceived as a threat on their lives and their accompanying wives.\nNeither officer had previous disciplinary problems. Both were reservists who returned to active duty after Sept. 11, 2001, as part of Air Force recall programs. Brown took a military leave of absence from his job as a pilot for American Airlines in the fall of 2003 and ended up flying C-17s out of Charleston Air Force Base, South Carolina. Hall left his airline job in September 2002 and had been serving as an instructor pilot at Laughlin Air Force Base, Texas. The two men deployed separately to Afghanistan in spring 2006 and ultimately worked to help get the Afghan air force off the ground.\nIn April 2006 the charges against Hall and Brown were dropped after the investigating officer determined the men had behaved properly given the security situation in Afghanistan. Furthermore, the Air Force began an investigation into allegations of witness tampering, attempted bribery, falsified evidence and doctored charging documents. The Air Force statement read, “someone may have attempted to influence the testimonies of several local national witnesses.”\nLt. Colonels charged with assaulting contractor (by Rod Hafemeister, Air Force Times)\nCharges dismissed against officers in Kabul run-in with contractor (Air Force Times)\nAir Force Academy Sued for Intolerance\nIn October 2005 a Jewish father of two Air Force Academy cadets sued the Air Force, claiming senior officers and cadets illegally imposed Christianity on others at the school. The lawsuit was filed in federal court by Mikey Weinstein, an academy graduate and outspoken critic of the school’s handling of religion.\nThe lawsuit stated that over the past decade or more, academy leaders had fostered an environment of religious intolerance at the Colorado school, in violation of the First Amendment. Weinstein’s sons were subjected to anti-Semitic slurs from evangelical Christian cadets, he said.\nCadets, watchdog groups and a former chaplain at the academy alleged that religious intolerance was widespread at the school. In August 2005 the Air Force issued guidelines discouraging public prayer at official functions and urging commanders to be sensitive about personal expressions of religious faith.\nOther complaints included a Jewish cadet being told the Holocaust was revenge for the death of Jesus and that another Jew being called a Christ killer by a fellow cadet. A banner in the football team's locker room read: “I am a Christian first and last ... I am a member of Team Jesus Christ.” There also were complaints that cadets were pressured to attend chapel, that academy staffers put New Testament verses in government e-mail and that cadets used the e-mail system to encourage others to see the Mel Gibson movie The Passion of the Christ.\nThe lawsuit named the Air Force and its secretary, Pete Geren, as defendants.\nAir Force Sued Over Religious Intolerance (by Tim Korte, Associated Press)\nMikey Weinstein and His Lawsuit Against the U.S. Air Force (Jews On First)\nBoeing Lease Deal under Assault\nFor years the Air Force relied on the KC-135 to provide air-refueling services to its fleet of planes. Arguing that it was time to replace the aging KC-135, the Air Force negotiated a $24 billion deal with Boeing to lease 100 of its 767 commercial airliners to take over air-refueling responsibilities. The deal came under attack by Sen. John McCain (R-Arizona) who claimed that Boeing officials had improperly won the contract from the Air Force, which prompted an investigation by the Pentagon’s inspector general.\nThe report found that Air Force officials had not thoroughly examined all of their options before concluding that they were paying a fair price for the tankers. The inspector general, Joseph E. Schmitz, also said that Air Force officials improperly waived the government’s right to audit the program and failed to follow other important acquisition and testing practices.\nIn the fallout over the scuttled deal, Boeing fired two executives after uncovering “compelling evidence” of ethical violations related to contract negotiations. The two employees were Darleen Druyun, a former Pentagon acquisition official who lobbied the Air Force on behalf of Boeing, and Michael Sears, Boeing’s chief financial officer, who was accused of violating company policies by communicating directly and indirectly with Druyun about future employment when she had not disqualified herself from acting in her official Air Force capacity on matters involving Boeing. In addition, an internally initiated review found that both employees had attempted to conceal their misconduct.\nPentagon Says Changes Are Needed in Boeing Jet Deal (by Richard A. Oppel Jr., New York Times)\nMcCain still seeking details on scuttled Boeing lease deal (by Mike Sunnucks, Phoenix Business Journal)\nBoeing fires former Pentagon official involved in tanker lease deal (by Amy Svitak, Government Executive)\nUSAF’s First Female Bomber Pilot Was Discharged for Adultery\nThe Air Force’s first-ever female bomber pilot left the service in disgrace after she was exposed for having an affair with a married subordinate.\nKelly Flinn, a first lieutenant who flew B-52s, was granted a general discharge in 1997 after being charged with adultery, disobedience, fraternization, and lying to investigators. The discharged allowed her to leave the service and avoid a court martial.\nHer military offenses included disobeying a direct order from her commanding officer to break off the affair, and for lying to him about having done so.\nFlinn’s troubles received widespread media attention and was discussed in a U.S. Senate hearing on May 22, 1997.\nDischarged Female Pilot Enters Civilian Life (CNN)\nKelly Flinn Incident (Wikipedia)\nProud To Be (Google Books)\nSuggested Reforms:\nmore\nless\nSuggested Reforms from Center for a New American Security\nWith the Defense Department forced to implement $450 billion in budget cuts over the coming decade, a think tank offered up its recommendations in 2012 for how the U.S. military could trim its expenditures while still maintaining an effective fighting force.\nThe Center for a New American Security (CNAS) saw the budget reductions as an opportunity to implement key reforms that would “make the U.S. military more effective as well as less expensive.”\nFor the Air Force, the CNAS endorsed the idea of significantly reducing the Air Force Reserve, an idea that has upset some on Capitol Hill.\nThe CNAS also suggested the Air Force buy fewer F-35 fighters (reducing the number from 1,763 to between 1,000 and 1,200 aircraft) and instead purchase more F-16s. Other recommendations included prioritizing air and naval forces, developing new drone aircraft for intelligence gathering and strike missions, and staying the course on a new bomber aircraft, but re-evaluating the total number to be purchased.\nThink Tank Calls Budget Cuts an Opportunity to Reform Military (by John T. Bennett, U.S. News & World Report)\nThink Tank Calls for Pentagon Reform (by Marc V. Schanz, Air Force Magazine)\nSustainable Pre-eminence Reforming the U.S. Military at a Time of Strategic Change (by David W. Barno, Nora Bensahel, Matthew Irvine and Travis Sharp, Center for a New American Security)\nCyber-Warfare Reforms\nAfter some starting and stopping with its plans, the Air Force launched its cyber-warfare command during President Barack Obama’s first term.\nIn 2008, the Air Force announced plans to train all of its 320,000 airmen to protect the service in cyberspace. Every enlisted man and officer was going to be taught about cyber warfare in basic training, the Air Force Academy, or officer candidate school.\nIn addition, about 100 students each year would receive advanced instruction at the Undergraduate Network Warfare Training course at Hurlburt Field in Florida. Those attending the special program would learn to operate a computer like “a weapon system,” according to one Air Force general. The goal was to be able to “drop bombs” in cyberspace to achieve military objectives as easily as dropping real 2,000-pound bombs.\nLater that year, however, the Air Force suspended its plans to establish a Cyber Command until leaders had time to further develop the scope and mission of the special outfit. By the following year, cyber-warfare training was in full swing at the Air Force.\nEfforts to engage the enemy online continued to expand, with a 2012 announcement from the Air Force that it wanted concept papers from contractors on ways to build offensive cyber-warfare tools. Leaders sought myriad capabilities, from attacking to mapping networks to cyber-warfare support.\nAir Force Trains Warriors To Defend Cyberspace (by Tom Vanden Brook, USA Today)\nUS Air Force halts plans to establish a Cyber Command (by Dan Goodin, The Register)\nAir Force planning to train hundreds yearly in cyber warfare skills (by Trish Choate, Standard-Times)\nU.S. Air Force To Start Training In Cyberwarfare (by Dan Elliott, Associated Press)\nAir Force Seeks Offensive Cyber Weapons (by J. Nicholas Hoover, InformationWeek)\nStrategic Airlift Force Structure Reform\nTwo U.S. senators proposed a cost-savings measure in 2011 that would have reduced the number of transport planes required of the Air Force for conducting strategic airlifts.\nUnder current law, the Air Force is mandated to have at least 316 planes available for transporting supplies, equipment and military personnel around the world.\nBut Senators Kelly Ayotte (R-New Hampshire) and Jack Reed (D-Rhode Island), both members of the Senate Armed Services Committee, proposed lowering the Air Force’s aircraft inventory minimum down to 301 planes.\nThe Strategic Airlift Force Structure Reform Act of 2011 could have saved taxpayers as much as $1.2 billion over several years, according to Ayotte and Reed.\nTheir plan was endorsed by some senior military commanders, including General Raymond Johns, commander of U.S. Air Mobility Command, who told a congressional panel that the 316 plane requirement forced the Air Force “to keep unneeded, less capable” aircraft, like the aging C-5A, around for missions.\nS. 1704: Strategic Airlift Force Structure Reform Act of 2011 (Govtrack.us)\nBipartisan Ayotte Bill to Reduce Aircraft Floor Could Save Taxpayers More than $1 Billion (Senator Kelly Ayotte)\nSenate Bill 1704 (LegiScan)\nDebate:\nmore\nless\nShould the Air Force depend more on drones?\nIn only a few years drone technology has taken off, becoming a growing part of the United States’ military and civilian sectors. But it has been the expansion of unmanned aerial vehicles (UAVs) by the U.S. Air Force (and to some degree the Central Intelligence Agency) for war that has stirred the greatest debate.\nAs of 2010, the military had spent billions of dollars to expand its fleet of UAVs, which have gone from 167 aircraft in 2002 to more than 7,000. By 2009, the Air Force had already trained more pilots to fly drones than traditional, piloted aircraft, ushering in a new era of warfare.\nThe Air Force plans to greatly expand its fleet of drones by 2047, so much so that some see all piloted aircraft replaced by UAVs in the future. A sign of this development has already appeared with the Defense Department’s decision to scale back purchases of the F-22 Raptor, a piloted combat plane, because its usefulness may be reduced in the coming years with more advances in drone technology.\nAnother advanced fighter, the F-35, may be the last funded, piloted fighter program, according to analysts.\nSome experts say drones represent an approaching technological tipping point that could produce a genuine revolution in military affairs.\nPro:\nOfficials within the Air Force argue drones are the future of the service. First and foremost, UAVs can conduct warfare with precision, and reduce collateral damage, making them a logical replacement for conventional fighters and bombers. Not only will this reduce civilian casualties, but American ones as well, supporters say.\nDrone advocates also say that using UAVs in the war against terrorism is legal. Officials in the Obama administration contend killings of terrorists by drones are legal under established principles of self-defense, international laws of armed conflict and the Authorization for Use of Military Force (the so-called “law of 9/11” passed by Congress following the 2001 terrorist attacks).\nHarold Koh, the State Department’s legal adviser, defended the administration’s use of drones for targeted attacks, asserting that the United States “may use force consistent with its inherent right to self-defense under international law.”\nUS Air Force Prepares Drones to End Era of Fighter Pilots (by Edward Helmore, The Guardian)\nCon:\nCritics say the use of drone attacks violate the laws of war, in part because the air strikes occur inside another nation’s sovereign territory. Attacks inside Pakistan have unquestionably violated international laws of armed conflict because the United States is not at war with Pakistan, critics point out.\nOpponents also argue that drone strikes are fueling anti-American sentiment and spurring more terrorism. Faisal Shahzad, the Pakistani immigrant who tried to set off a car bomb in New York’s Times Square in 2010, is cited as an example, because he suggested that American drone strikes in Pakistan and elsewhere helped motivate him.\nFurthermore, critics cited a recent British study that warned drones are becoming increasingly automated. Soon, UAVs could be able to launch a missile on their own without help from human controllers—and without recourse to higher, human authority.\nUS Predicts Killer Robots 40 Years Away, Raises Ethics Debate (by Haley A. Lovett, Finding Dulcinea)\nOther links:\nAre Strikes By Unmanned Aircraft Ethical? (The CQ Researcher Blog)\nDrones: America's New Air Force (CBS News)\nAir Force UAVs The Secret History (by Thomas Ehrhard, Mitchell Institute)\nAre Drones A Technological Tipping Point In Warfare? (by Walter Pincus, Washington Post)\nU.S. Strike Kills 4 Amid Pakistan Drone Debate (by Rasool Dawar, Associated Press)\nAir Force Plans for All-Drone Future (by David Axe, Wired)\nCombat Generation: Drone Operators Climb On Winds Of Change In The Air Force (by Greg Jaffe, Washington Post)\nPolice Employ Predator Drone Spy Planes On Home Front (by Brian Bennett, Los Angeles Times)\nShould women be barred from combat roles?\nIn 2011, a government commission recommended that the Defense Department rescind its policy that prevents women from being assigned to combat units below the brigade level.\nThat same year, several female airmen from the 389th Expeditionary Fighter Squadron and 455th Air Expeditionary Aircraft Maintenance Squadron at Bagram Airfield in Afghanistan were selected to fly the first all-female combat sortie from start to finish. The mission, which was put together in honor of Women’s History month, set off a debate about women in combat.\nIn January 2013, Defense Secretary Leon Panetta announced an end to the policy of banning women from combat, giving the services until 2016 to make the case that some positions should remain off-limits to women.\nPro:\nSupporters of lifting the ban for the Air Force point out that many female soldiers and Marines have already been fighting in Afghanistan in an unofficial capacity.\nThey also note that female pilots have been flying fighter planes since 1993, and that it is long past due to officially assign these pilots to combat missions.\nIf women qualify to join the military and perform the job the same as men, then there should be no distinction of what role they should serve in, supporters contend. They add that a woman is no more or less valuable than a man, in terms of the risk of being wounded or killed during wartime.\nWomen’s Groundbreaking Flight Sparks Debate (by Markeshia Ricks, Air Force Times)\nCon:\nOpponents say the physical and physiological differences that separate men from women still demand that the latter stay out of combat roles. They argue women would not have an equal opportunity to survive in combat situations, or to help fellow soldiers survive.\nAlso, to mix women and men in combat units could impact discipline and cohesion.\nFurthermore, women are more likely to lose duty time due to medical issues, including pregnancy, and this absence could prove disruptive in combat units where concentration and mutual trust are essential for survival, critics say.\nShould Women Be Allowed In Combat? (Upfront)\nOther links:\nWomen in Combat: Leon Panetta Removes Military Ban, Opening Front-Line Positions (by Lolita C. Baldor, Huffington Post)\nWomen in Combat: Issues for Congress (by David F. Burrelli, Congressional Research Service)\nPanel Says Rescind Policy On Women In Combat (by Lisa Daniel, American Forces Press Service)\nHistory of Women in Combat Still Being Written, Slowly (by John Cushman Jr., New York Times)\nFormer Directors:\nmore\nless\nMichael Wynne\nMichael W. Wynne served as secretary of the Air Force from November 2005 until he was forced to resign on June 5, 2008. He received a bachelor of science degree in general engineering from the U.S. Military Academy at West Point in 1966; a master’s degree in electrical engineering from the Air Force Institute of Technology, Wright-Patterson Air Force Base, Ohio, in 1970; and a master’s degree in business from the University of Colorado, Colorado Springs, in 1975.\nWynne served in the Air Force for seven years from 1966 to 1973, completing his career as a captain and assistant professor of astronautics at the U.S. Air Force Academy. From 1973 to 1975 he held the title of principal at Research Analysis and Development (RAD), Inc. In 1975 he joined General Dynamics, where he worked a total of 23 years in various senior positions with the Aircraft (F-16s) and Main Battle Tanks (M1A2) Divisions and served on the corporate staff prior to becoming the president of Space Systems, including launch vehicles (Atlas and Centaur), and a corporate vice president.\nIn 1994 he joined Lockheed Martin after selling General Dynamics’ Space Systems Division to then Martin Marietta (which merged with Lockheed). He integrated the division into the astronautics company and became general manager of the Space Launch Systems segment, combining the Titan with the Atlas launch vehicles. In 1997 he returned to General Dynamics to serve as senior vice president of international development and strategy until 1999.\nIn 2000 he became chairman and chief executive officer of the IXATA Group, which offers business-to-business e-commerce services for corporate travel and hospitality markets, and held an executive position with Extended Reach Logistics. He also was involved in venture capital as a member of the NextGenFund Executive Committee.\nIn 2001 he joined the Department of Defense and served in a key procurement role, first as principal deputy and then as acting Under Secretary of Defense for Acquisition, Technology and Logistics. In April 2005 President George W. Bush nominated Wynne to take over as Under Secretary of Defense for Acquisition, Technology and Logistics. But Sen. John McCain (R-Arizona) opposed Wynne’s confirmation because of the nominee’s support for the controversial Boeing lease deal (see Controversies). Thus, in June 2005, the President withdrew Wynne’s name as under secretary. Five months later, however, Wynne’s appointment as Secretary of the Air Force was confirmed by the Senate.\nFormer Chiefs of Staff, United States Air Force\nGeneral T. Michael Moseley\nGeneral T. Michael Moseley served as chief of staff of the U.S. Air Force from September 2005 until he was forced to resign on June 5, 2008. Moseley graduated from Texas A&M University with a bachelor’s and master’s degree in political science.\nHis career in the Air Force began in 1972 as a student pilot at Webb AFB, Texas. From 1973 to 1977, he served as a T-37 instructor pilot, spin flight test pilot, flight check pilot and standardization and evaluation flight examiner for the 3389th Flying Training Squadron, 78th Flying Training Wing at Webb AFB. From 1977 to 1979, he worked as an F-15 instructor pilot and flight lead and mission commander for the 7th Tactical Fighter Squadron at Holloman AFB, New Mexico.\nFrom 1979 to August 1983, Moseley was an F-15 weapons and tactics officer, instructor pilot, flight lead and mission commander, standardization and evaluation/ flight examiner for the 44th Tactical Fighter Squadron and 12th Tactical Fighter Squadron at Kadena Air Base in Japan. The following year he taught at the Air Command and Staff College at Maxwell AFB in Alabama.\nFrom 1984 to 1987, Moseley served in Washington D.C., as chief of the Tactical Fighter Branch, Tactical Forces Division, Directorate of Plans, and as deputy chief of staff for Plans and Operations at Headquarters U.S. Air Force. He then served as commander of the F-15 Division and instructor pilot for the Fighter Weapons Instructor Course at the U.S. Air Force Fighter Weapons School at Nellis AFB, Nevada, from 1987 to 1989. The next year he taught courses at the National War College at Fort Lesley J. McNair in Washington D.C. From 1990 to 1992, Moseley served as chief of staff of the Air Force chair and professor of Joint and Combined Warfare at the National War College.\nHe then served as commander of the 33rd Operations Group at Eglin AFB in Florida from 1992 to 1994. Moseley returned to Washington D.C. until 1996 as chief of the Air Force General Officer Matters Office. The following year he commanded the 57th Wing at Nellis AFB, and then served as Deputy Director for Politico-Military Affairs, Asia/Pacific and Middle East, Directorate for Strategic Plans and Policy, for the Joint Chiefs of Staff in Washington D.C. He remained in D.C. until 2001 as the director and legislative liaison for the Office of the Secretary of the Air Force.\nFrom 2001 to 2003, Moseley commanded the 9th Air Force and U.S. Central Command Air Forces at Shaw AFB, South Carolina. He then returned to Washington D.C., where he held the position of Vice Chief of Staff at Air Force headquarters until becoming Chief of Staff.\nDENNIS DARSNEY\n13 years ago\nto secetary of the air force on donley,michael about barment issue the congarsmen wilson the state south carolina looking why iam barment what what have done this action by general hyde the 86th air lift commander this order should resend cell number is 015238041649.\nRichard Matkevich\n14 years ago\nhello secretary of the usaf—mr. michael donley\ni’m writing this letter in the hopes of you helping the american nuclear test workers who were put at risk to serve the national security interests of the united states. at the present time there are several programs to aid the nuclear test workers in our country, the veterans administration (va), the energy employees occupational illness compensation program (eeoicp) and the radiation exposure compensation act (reca).the eeoicp covers ...\n- Table of Contents\n- Overview\n- History\n- What it Does\n- Where Does the Money Go\n- Controversies\n- Suggested Reforms\n- Comments\n- Leave a comment\nFounded: 1947\nAnnual Budget: $110 billion\nEmployees: 553,107 (FY 2012)\nOfficial Website: http://www.af.mil/\nDepartment of the Air Force\nWilson, Heather\nSecretary\nHeather Wilson, a former Air Force officer who was once named one of the most corrupt members of Congress, was confirmed in a 76-22 Senate vote on May 8, 2017, as Secretary of the Air Force.\nWilson was born December 30, 1960, in Keene, New Hampshire. Her father, George, was a commercial pilot and her mother, Martha, was a nurse. Wilson’s grandfather was also an aviator, so it made sense for her to attend the U.S. Air Force Academy, where she was in the third class that included women. She earned a B.S. in 1982, but instead of going to flight school, Wilson accepted a Rhodes scholarship to study at Oxford University. She finished there in 1985 after having earned M.Phil. and D.Phil. degrees in international relations.\nShe remained in Great Britain, and was assigned by the Air Force to work on plans and host country negotiations. In 1987, she was moved to the U.S. mission to the North Atlantic Treaty Organization in Belgium.\nWilson left the Air Force in 1989 to take a staff job on the National Security Council (NSC) in the George H.W. Bush administration. She served as director for European defense policy and arms control. Wilson left the NSC in 1991 to become president of Keystone International, a consulting firm in Albuquerque whose clients have included the Department of Defense and Department of Energy. In 1996, she sold the firm to retired Air Force Colonel Gary Van Valin.\nIn 1991, Wilson married Jay Hone, an attorney and former Air Force officer who had been an instructor of Wilson’s at the Air Force Academy.\nIn 1995, Wilson was named secretary of New Mexico’s Children, Youth and Families Department. While there, she was involved in an incident that came back to bite her during her political career. She ordered that a file with information about Hone’s background as a foster parent be moved to another office. The file contained a 1993 Albuquerque police report naming Hone in a possible sexual touching case involving a youth whose legal interest Hone was handling. The touching was found to have been inadvertent. Wilson defended the movement of the file at the time, saying she didn’t want a file with personal information about her family available to department employees.\nThe movement of the file was raised during Wilson’s 1998 campaign for Congress. She won a special election to fill the seat representing Albuquerque that had been held by Steve Schiff when he died in office. Wilson also won the regular election that fall.\nWilson supported President George W. Bush’s 2003 invasion of Iraq because she believed that Saddam Hussein had weapons of mass destruction. When this turned out to be untrue, Wilson opposed having the House investigate why there had been such an important intelligence failure, stating that such an investigation “would do this country a terrible disservice.”\nWilson remained in Congress until 2009, but had a close call in her 2006 reelection bid, winning by only 875 votes out of 211,000 cast. That came after Wilson began to push for the firing of U.S. Attorney David Iglesias after she had called him to ask about an investigation into New Mexico Democratic officials. The following year, Wilson was named by Citizens for Responsibility and Ethics in Washington as one of the 22 most corrupt members of Congress.\nIn 2008, instead of running to retain her House seat, Wilson sought the Republican nomination for U.S. Senate, but she lost in the primary. She had barely moved out of her Congressional office when she formed a one-person consulting firm with a $10,000-a-month contract with a division of defense contractor Lockheed Martin, which managed Sandia National Laboratory.\nAlthough she was forbidden to directly lobby Congress, she directed Lockheed in its quest to have its management contract renewed without going through competitive bidding. Her deals with Lockheed and other nuclear contractors were later found to have violated government rules, but the hammer fell on the contractors, not Wilson. A report by the Energy Department inspector general said her invoices lacked “details as to the time expended and nature of the actual services.” She also worked for Los Alamos National Laboratory, Oak Ridge National Laboratory and Nevada National Security Site between 2009 and 2011. The labs eventually reimbursed the government $442,000 that they’d paid Wilson. Lockheed eventually lost the Sandia contract.\nFrom August 2010 until February 2011, Wilson served on the board of directors of Crossroads GPS, the Karl Rove-founded nonprofit campaign finance organization.\nWilson took another shot at the Senate in 2012, but lost in the general election to Martin Heinrich (D). During the campaign, she criticized a Senate bill aimed at cutting the bullying of LGBTQ children. While in the House, Wilson voted for a constitutional amendment that would have defined marriage as being between a man and a woman.\nIn 2013, Wilson was named president of the South Dakota School of Mines and Technology. She also sits on the board of defense contractor Raven Industries, which, among other products, provides radar technology to the U.S. Department of Defense and stratospheric balloons to NASA, and on the board of directors of Peabody Energy, the world’s largest coal company.\nWilson and Hone have three adult children. She is a licensed private pilot.\n-Steve Straehley\nTo Learn More:\nAir Force Secretary Nominee Helped a Major Defense Contractor Lobby for More Federal Funds (by Patrick Malone, Center for Public Integrity)\nFormer Congresswoman Sets Revolving Door Speed Record (by Noel Brinkerhoff, AllGov)\nDOE IG Flags $450K to Wilson’s Firm (by Darius Dixon, Politico)\nRove Testimony Contradicts Wilson’s (by John Bresnahan and Josh Gerstein, Politico)\nCREW Releases Third Annual Most Corrupt Members of Congress Report (Citizens for Responsibility and Ethics in Washington)\nTrump Picks Former Congresswoman and Air Force Veteran Heather Wilson as Air Force Secretary (by Dan Lamothe, Washington Post)\nThis is Heather Wilson: Her Private Life in the Private Sector (by Justin Horwath, Santa Fe Reporter)\nHeather Wilson 2011 Financial Disclosure Statement (United States Senate)\nLee James, Deborah\nPrevious Secretary\nPresident Barack Obama has nominated a security industry executive to be secretary of the Air Force. Deborah Lee James is president of the Technical and Engineering Sector at Science Applications International Corporation (SAIC), a major contractor with the federal government headquartered in McLean, Virginia. If confirmed by the Senate, James would succeed Michael Donley, who retired in June, and would become the second woman to hold the post. Although James has no actual military experience, she has spent many years living off defense contracts, and the administration is believed to hope that nominating a woman will help quiet some of the criticism over the Air Force’s dismal record at dealing with the epidemic of sexual assault within its ranks.\nBorn circa 1957, James earned a B.A. in Comparative Area Studies at Duke University in 1979 and an M.A. in International Affairs at Columbia University in 1981.\nShe began her career in national security as a professional staff member on the House Armed Services Committee from 1983 to 1993, specializing in military personnel and North Atlantic Treaty Organization (NATO) issues. She then moved over the to the executive branch, serving from May 1993 to April 1998 as assistant secretary of defense for Reserve Affairs at the Department of Defense, responsible for all matters pertaining to the National Guard and Reserve Forces.\nHeading to the private sector, James was vice president for International Operations and Marketing at United Technologies Corporation from April 1998 to May 2000.\nFrom May 2000 to December 2001, James was the executive vice president and chief operating officer at Business Executives for National Security (BENS), a conservative organization representing more than 350 corporations that lobbies for more spending on homeland and national security programs—which its members then profit from by obtaining government contracts. In fact, according to security industry expert Tim Shorrock, BENS “has been a driving force in the privatization of U.S. defense capabilities, including the outsourcing of the precious intelligence assets.”\nFrom January 2002 to 2013, James held four jobs at SAIC, starting with a mere one month as senior vice president and director for Homeland Security. After a two-year gap, James was senior vice president of the C4IT Business Unit from January 2004 to August 2010, executive vice president of Communications and Government Affairs from August 2010 to January 2013, and president of the Technical and Engineering Sector from January to July 2013.\nJames is active in several professional and charitable organizations, including the Tragedy Assistance Program for Survivors, Defense Department Advisory Committee on Women in the Services, and chairperson for the PenFed Foundation National Advisory Board.\n-Matt Bewig\nTo Learn More:\nObama to Nominate Deborah Lee James as Air Force Secretary (by Jeff Mason and Andrea Shalal-Esa, Reuters)\nObama Nominates Deborah Lee James As Air Force Secretary (by Josh Lederman, Huffington Post)\n- Latest News\n- D.C. Public Schools will Teach all Second-Graders to Ride a Bike\n- New Rule in Germany Limits Sales of Sex-Themed E-Books to 10pm to 6am\n- What Happened to the 6-Year-Old Tibetan Boy the Chinese Government Kidnapped 20 Years Ago?\n- U.S. Ambassador to Turkey Photoshops his Hair Color to Mock Turkish Mayor\n- Mystery Artist Calls Attention to Unfixed Potholes by Drawing Penises around Them\nOverview:\nmore\nless\nThe U.S. Air Force (USAF) constitutes the aviation component of the Armed Services, providing tactical, strategic, and logistical air support for U.S. military operations. The USAF also is charged with operational command of U.S. nuclear forces. Some of the most advanced weapons systems in the U.S. military have been developed for the Air Force, often at great costs and involving much controversy.\nHistory:\nmore\nless\nThe Air Force’s origins reside in the U.S. Army Signal Corps, which established a small Aeronautical Division in 1907 responsible for all matters pertaining to military balloons, “air machines and all kindred subjects.” The Signal Corps tested its first airplane at Fort Myer, Virginia, in 1908. By 1912 the Signal Corps had acquired 11 aircraft. The following year the Army ordered its aviators to Texas to take part in maneuvers where the assembled men and equipment were designated the “1st Provisional Aero Squadron,” making it the Army’s first unit devoted exclusively to aviation. It was subsequently designated the 1st Aero Squadron and even later the 1st Reconnaissance Squadron, which has remained continuously active to this day.\nIn 1914 Congress created in the Signal Corps an Aviation Section to replace the Aeronautical Division and directed the new section to operate and supervise all military aircraft, including balloons, and to train officers and enlisted men in matters pertaining to military aviation. When World War I broke out in Europe in August 1914, the 1st Aero Squadron represented the entire tactical air strength of the Army. It counted 12 officers, 54 enlisted men and six aircraft. By the end of the war, there were 185 squadrons consisting of 740 American aircraft, which only represented 10% of the total aircraft strength of Allied nations. American squadrons only saw combat during the last nine months of the war, conducting 150 separate bombing attacks, while downing 756 enemy aircraft and 76 enemy balloons, but losing 289 airplanes and 48 balloons.\nBefore the war ended, President Woodrow Wilson issued an executive order in 1918 transferring aviation from the Signal Corps to the newly created Air Service of the U.S. Army. Like the rest of the Army, the Air Service underwent demobilization, leaving it with only 22 squadrons. Officer strength plummeted from 19,189 to 1,168 and enlisted strength dropped from 178,149 to 8,428.\nAside from a name change, from Air Service to Air Corps in 1926, the inter-war period was marked mostly by the establishment of new training centers for pilots. In August 1926 the Army established the Air Corps Training Center in San Antonio, Texas. Randolph Field, in Texas, became the “West Point of the Air” and the headquarters of the Air Corps Training Center in 1931. By 1932 the Air Corps had grown to 1,305 officers and 13,400 enlisted men, including cadets, and possessed 1,709 aircraft.\nAs the likelihood of war grew in Europe during the 1930s, President Franklin D. Roosevelt acknowledged the growing importance of airpower, prompting the Air Corps to prepare plans in October 1938 for a force of some 7,000 aircraft. Soon afterward, President Roosevelt asked the War Department to prepare a program for 10,000 airplanes, of which 7,500 would be combat aircraft.\nBeginning in September 1939, the German military’s rapid conquering of Poland, Norway, Holland, Belgium, and France was aided by the Luftwaffe, demonstrating to American leaders the importance of air power. Leaders of the Air Corps found themselves in the novel position of receiving practically anything they requested. Plans soon called for 54 combat groups, then 84 combat groups. All told, the strength of the U.S. Army air forces in World War II swelled from 26,500 men and 2,200 aircraft in 1939 to 2,253,000 men and 63,715 aircraft in 1945.\nIn the early stages of WWII, American combat planes such as the P-40 struggled to compete in aerial dog-fighting with the Japanese Zero and the German Messerschmitt. But as the war progressed, military designers produced newer, more sophisticated fighters and bombers. Tactical aircraft like the P-51 Mustang allowed American pilots to gain the upper hand over their enemy counterparts. New long-range bombers, such as the B-17 Flying Fortress and B-29 Superfortress, became the backbone of the Army Air Corps strategic bombing campaigns designed to destroy the industrial war machine of Germany and Japan. Bombing missions gradually grew in size and frequency, pummeling German factory towns and major Japanese urban centers.\nAmerican air attacks caused considerable civilian casualties and controversy. In 1945, American and British bombers dropped incendiary bombs on Dresden, causing an enormous firestorm that destroyed large sections of the city and killed tens of thousands of Germans. A month later 300 B-29 bombers dropped nearly a half-million M-69 incendiary cylinders over Tokyo, causing a similar firestorm that destroyed some 16 square miles of the city. The attack killed between 83,000-100,000 Japanese.\nBut the most controversial bombings by American warplanes came in August 1945 when the United States dropped atomic bombs on Hiroshima and Nagasaki in an effort to shorten the war and avoid American military forces having to invade Japan. Both cities were obliterated, killing a combined 220,000 people and leaving thousands more sick and dying from radiation poisoning. The atomic attacks not only marked the beginning of America’s nuclear weapons program, but also cemented the Air Corps’ strategic importance in post-war military planning.\nShortly after the end of WWII, military leaders agreed to establish an independent branch of the services dedicated to air power. The U.S. Air Force (USAF) was formally created by the National Security Act of 1947. Within the USAF three new commands were set up: Strategic Air Command, Air Defense Command, and Tactical Air Command. These three commands represented the strategic, tactical and air defense missions that would serve as the foundation of the Air Force in the coming years of the Cold War.\nDuring the Cold War struggle between the U.S. and the Soviet Union (circa 1947-1991), the Air Force played a featured role for American military and political leaders. Only a year after being officially born, the Air Force was called upon by President Harry Truman to conduct a massive airlift of supplies to West Berlin after Russian forces cutoff the city’s land corridors to Western powers. The Berlin Airlift proved successful, forcing the Soviets to reopen West Berlin the following year. This event was only the beginning of the Air Force’s strategic place in American battles with the USSR.\nAs the nation’s nuclear weapons program grew during the 1950s, the Air Force was given the prime mission of delivering America’s strategic arsenal in the event of nuclear war with the Soviet Union. At first the focus was on bombers. A new generation of jet-powered aircraft took over USAF squadrons, most importantly the B-52 Stratofortress. Air wings comprised of B-52s, based both in the U.S. and overseas, were set up on round-the-clock aerial missions to fly toward the Soviet Union until reaching a “fail safe” point at which they turned around unless given the “go codes” from Strategic Air Command (SAC) to attack the USSR. This game of nuclear cat-and-mouse was depicted in the Hollywood films “Dr. Strangelove” and “Fail Safe.”\nThe Air Force’s role in American nuclear war planning grew more significant with the development of Intercontinental Ballistic Missiles (ICBMs) capable of delivering multiple warheads at targets in the USSR and China. SAC oversaw the operation of all U.S. ICBM silos, and it played key roles in the development of U.S. strategic doctrine, such as Massive Retaliation, Flexible Response, and Mutual Assured Destruction.\nUSAF squadrons continued to play important non-nuclear roles as well for the U.S. military. During the Korean War, American pilots engaged in the first combat missions involving jet fighters. Beginning with the Eisenhower administration, USAF pilots flew highly-secret reconnaissance missions over the USSR using U-2 spy planes. In 1960, USAF pilot Francis Gary Powers was shot down while flying his U-2 over Sverdlovsk. Powers was captured by the Soviets, and the incident proved a huge embarrassment for the Air Force and the U.S. government. It also escalated tensions between American and Russian leaders that later culminated with the Cuban Missile Crisis of 1962, the closest USAF commanders ever came to engaging American nuclear forces against the Soviets.\nDuring the Vietnam War, the Air Force performed some of the most controversial military missions of that era. Convinced that massive conventional bombing could turn the tide of the war in America’s favor, USAF commanders followed the strategic bombing philosophy of USAF General Curtis LeMay, the architect of America’s WWII strategic bombing campaign, who later organized Strategic Air Command. LeMay was quoted in 1968 as saying of the Vietnamese enemy that America should “bomb them back to the stone age,” and it nearly tried as more munitions were dropped on Vietnam than during WWII. This included not only massive attacks on North Vietnam but also secret missions inside Cambodia and Laos.\nWhen American planes weren’t dropping explosives on the Vietnam countryside, they were dispersing highly toxic chemicals, such as Agent Orange and other defoliants designed to destroy the thick jungles that North Vietnamese and Viet Cong forces used effectively to attack American soldiers. The aerial spraying wound up causing serious illnesses among many U.S. servicemen who fought long after the war for the Air Force and other branches of the military to recognize their mission-related sicknesses.\nWith no war to fight during the remainder of the 1970s, following America’s withdrawal from South Vietnam, the Air Force concentrated on modernizing its aircraft. New fighter and strategic bombers were ordered from defense contractors on the basis that the USAF had to stay ahead of the USSR for control of the skies. This modernization meant producing more sophisticated aircraft at substantially higher costs, a trend that the Air Force has continued to this day. Tactical fighters such as the F-15, which were first built in 1975, wound up costing $40 million a plane, and even more advanced stealth fighters that came along in the late 1980s cost $80 million a plane.\nNew bombers such as the B-1 and B-2 registered per aircraft costs in the $300-$400 million range. The B-1 proved to be especially costly for the USAF due to design flaws that forced Air Force commanders to alter the mission of the plane. Originally purchased to replace the aging B-52, the B-1 was supposed to be able to fly at low altitude in order to penetrate Soviet air defenses. Military planners later realized that the high-tech bomber was vulnerable to such defenses, forcing the Air Force to abandon its plan of replacing the B-52, which continues to serve in USAF squadrons to this day. Although another high-tech bomber, the B-2, proved more reliable in terms of performance, its price tag of almost a half-billion dollars per plane made it impossible for the Air Force to purchase the aircraft in the quantity it had originally proposed.\nIn addition to pricey new aircraft, the Air Force also became involved in new strategic nuclear weapons systems advocated by President Ronald Reagan. The MX missile first began development in the 1970s, but support for it waned until the Reagan years, when the administration wanted to subdue the Soviet Union by bolstering America’s nuclear first-strike capability. Capable of carrying 10 nuclear warheads (three times the number of other ICBMs), the MX proved vulnerable to the Soviet’s new generation of highly accurate long-range missiles, causing some American policymakers to call for building a huge underground railroad system upon which the MX would ride. This provoked outrage by both anti-nuclear activists and political leaders in Western states where the mobile MX would be based. Ultimately, the administration chose to order fewer missiles and simply place them in old, vulnerable Minutemen III silos.\nEven more controversial was President Reagan’s Strategic Defense Initiative (SDI), or “Star Wars” concept. Influenced by the vision of scientist Edward Teller, father of the hydrogen bomb, President Reagan in 1983 called for a defensive shield to protect the U.S. from missile attack. The ambitious plan called for developing space-based laser and other kinetic-kill weapons that were decades away from becoming operational, if they could work at all. Cost estimates put the price tag for SDI in the hundreds of billions of dollars, prompting the Air Force along with other military branches to promote new projects to gain a share of research-and-development monies. Momentum for Star Wars waned as the Cold War came to an end, although the program continues to live on through the Missile Defense Agency.\nIt wasn’t until after the Cold War that the Air Force got the chance to fully demonstrate the capability of its modernized aircraft. But instead of taking on the Russian Red Army, USAF pilots helped smash the Iraqi army during the Gulf War of 1990-91. As part of Operation Desert Shield, Air Force squadrons were some of the first American military units to engage Iraqi air and ground forces. Some of the most prominent images recorded during the war featured USAF weapons systems, such as laser-guided bombs destroying Iraqi bunkers, stealth fighters and bombers attacking under the cover of darkness or the slow-moving A-10 Thunderbolt attack aircraft effectively destroying the Soviet-made tanks that comprised Iraq’s armored units occupying Kuwait.\nWhen hijackers crashed civilian airliners into the World Trade Center towers and the Pentagon on Sept. 11, 2001, the Air Force found itself at a readiness level not seen in the United States. With fears running high of more assaults from the skies, USAF squadrons of F-15s were scrambled with orders to shoot down unidentified aircraft in American air space. Squadrons remained on high alert for months after 9/11 in the event of possible attack.\nBy 2008, budget tightening saw the Air Force’s active-duty force drop to 330,000, which was 64% of what it had been at the end of the Gulf War in 1991. In June 2008, an upheaval in Air Force leadership took place following disputes it had with Secretary of Defense Robert Gates, and in the aftermath of two incidents that involved the Air Force’s mishandling of nuclear weapons. Citing \"systemic issues associated with declining Air Force nuclear mission focus and performance,\" Gates accepted the forced resignations of Secretary of the Air Force Michael Wynne and the Air Force Chief of Staff Gen. T. Michael Moseley.\nIn July 2009, the Air Force released its plans for unmanned aerial vehicles through the year 2047, revealing that a third of all future aircraft that it purchases will be unmanned.\nRemembering the Dresden bombing (by Jacqueline Head, BBC)\n1945 Tokyo Firebombing Left Legacy of Terror, Pain (by Joseph Coleman, Associated Press)\nWhat it Does:\nmore\nless\nThe U.S. Air Force (USAF) constitutes the aviation component of the Armed Services, providing tactical, strategic and logistical air support for U.S. military operations. The USAF also is charged with operational command of U.S. nuclear forces.\nIn order to carry out its missions, the Air Force separates its forces into nine major commands and their subordinate units. Major commands are organized either on a functional basis in the United States or a geographic basis overseas. They organize, administer, equip, and train their subordinate elements. Major commands generally are assigned specific responsibilities based on functions. In descending order of command and authority, elements of major commands include numbered air forces, wings, groups, squadrons, and flights.\nThe basic unit for generating and employing combat capability is the wing, which has always been the Air Forces prime war-fighting instrument. Composite wings operate more than one kind of aircraft. Other wings operate a single aircraft type, such as F-15s, ready to join air campaigns anywhere they are needed. Within a particular wing are the operations, logistics and support groups needed to make the wing function.\nThe 13 major commands and components of the USAF are as follows:\n- Air Combat Command (ACC), headquartered at Langley Air Force Base, Virginia, was created June 1, 1992, by combining its predecessors, Strategic Air Command and Tactical Air Command. ACC’s mission is to provide combat airpower to U.S. military warfighting commands. It operates fighter, bomber, reconnaissance, battle-management, and electronic-combat aircraft. It also provides command, control, communications, and intelligence systems, and conducts global information operations.\nThe ACC provides the air component to U.S. Central, Southern, and Northern Commands. It also augments forces to U.S. European, Pacific, and Strategic Command.\nThe ACC commands several numbered air forces that provide security for the continental United States. First Air Force, with headquarters at Tyndall AFB, Florida, provides surveillance and command and control for air defense forces for the continental United States in support of the North American Aerospace Defense Command (NORAD). Eighth Air Force, with headquarters at Barksdale Air Force, Louisiana, supports ACC in providing command and control, intelligence, surveillance, and reconnaissance; long-range attack; and information operations forces to Air Force components and warfighting commands. Ninth Air Force, with headquarters at Shaw Air Force Base, South Carolina, controls ACC fighter forces based on the East Coast and serves as the air component for a 25-nation area within the U.S. Central Command area of responsibility (Middle East, Southwest Asia, Northeast Africa). Tenth Air Force, located at Naval Air Station Joint Reserve Base, Fort Worth, Texas, directs the activities of more than 13,300 reservists and 900 civilians located at 28 installations throughout the United States. Twelfth Air Force, with headquarters at Davis-Monthan AFB, Arizona, controls the ACC's conventional fighter and bomber forces based in the western United States and has the warfighting responsibility for U.S. Southern Command (Central and South America).\n- Air Education and Training Command (AETC), with headquarters at Randolph Air Force Base near San Antonio, Texas, is responsible for training all USAF personnel. AETC consists of 13 bases, more than 43,000 active-duty members and 14,000 civilians. The command has responsibility for approximately 1,600 aircraft. It includes the Air Force Recruiting Service, two numbered air forces and the Air University.\nSecond Air Force, with headquarters at Keesler AFB, Mississippi, is responsible for conducting basic military and technical training for Air Force enlisted members and support officers. The first stop for all Air Force, Air National Guard and Air Force Reserve enlisted people is basic military training at Lackland AFB, Texas. Nineteenth Air Force, with headquarters at Randolph AFB, Texas, conducts AETC's flying training.\nAir University, headquartered at Maxwell AFB, Alabama, conducts professional military education, graduate education and professional continuing education for officers, enlisted members and civilians throughout their careers.\n- Air Force Materiel Command (AFMC), with headquarters at Wright-Patterson Air Force Base, Ohio, conducts research, development, testing and evaluation, and provides acquisition management services and logistics support necessary to keep Air Force weapon systems ready for war. It equips the Air Force with weapon systems through the Air Force Research Laboratory and several centers which are responsible for the “cradle-to-grave” oversight for aircraft, electronic systems, missiles and munitions.\n- Air Force Reserve Command (AFRC), with headquarters at Robins Air Force Base, Georgia, has 35 flying wings equipped with their own aircraft and nine associate units that share aircraft with an active-duty unit. There also are more than 620 mission support units in the AFRC, equipped and trained to provide a wide range of services, including medical and aeromedical evacuation, aerial port, civil engineer, security force, intelligence, communications, mobility support, logistics, and transportation operations.\nThe AFRC has 447 aircraft assigned to it. The inventory includes the F-16 Fighting Falcon, O/A-10 Thunderbolt II, C-5 Galaxy, C-141 Starlifter, C-130 Hercules, MC-130 Combat Talon I, HC-130, WC-130, KC-135 Stratotanker, B-52 Stratofortress and HH-60 Pave Hawk helicopter. On any given day, 99 percent of these aircraft are mission ready and able to deploy within 72 hours. These aircraft and support personnel become available to Air Combat Command, Air Mobility Command and Air Force Special Operations Command if mobilized. The aircraft and their crews are immediately deployable without need for additional training.\n- Air Force Space Command (AFSPC), with headquarters at Peterson Air Force Base, Colorado, defends North America through its space and intercontinental ballistic missile operations. AFSPC has two numbered air forces and two centers. Located at Vandenberg AFB, California, Fourteenth Air Force manages the generation and employment of space forces to support US Strategic Command and North American Aerospace Defense Command (NORAD). Twentieth Air Force, located at F.E. Warren AFB, Wyoming, operates and maintains the nation’s ICBMs. The Space and Missile Systems Center at Los Angeles AFB, California, designs and acquires all Air Force and most Department of Defense space systems. It oversees launches, completes on-orbit checkouts and then turns systems over to user agencies.\n- Air Force Special Operations Command (AFSOC), with headquarters at Hurlburt Field, Florida, provides Air Force special operations forces (SOF) for worldwide deployment and assignment to regional unified commands. The command’s SOF are composed of highly trained, rapidly deployable Airmen. These forces conduct global special operations missions ranging from precision application of firepower, to infiltration, exfiltration, resupply and refueling of SOF operational elements. AFSOC's unique capabilities include airborne radio and television broadcast for psychological operations. The command’s special tactics squadrons combine combat controllers, special operations weathermen and pararescuemen with other SOF to form versatile joint special operations teams.\n- Air Mobility Command (AMC), with headquarters at Scott AFB, Illinois, is responsible for rapid, global mobility and sustainment for America’s armed forces. The command also plays a crucial role in providing humanitarian support at home and around the world. AMC personnel—active duty, Air National Guard, Air Force Reserve, and civilians—provide airlift and aerial refueling for all U.S. armed forces. Many special duty and operational support aircraft and stateside aeromedical evacuation missions are also assigned to AMC.\n- Pacific Air Forces (PACAF), with headquarters at Hickam AFB, Hawaii, provides air and space power to promote U.S. interests in the Asia-Pacific region during peacetime, through crisis and in war. PACAF’s area of responsibility extends from the west coast of the United States to the east coast of Africa and from the Arctic to the Antarctic, more than 100 million square miles. The command’s major units are 5th Air Force, Yokota Air Base, Japan; 7th Air Force, Osan AB, South Korea; 11th Air Force, Elmendorf Air Force Base, Alaska; and 13th Air Force, Guam.\n- United States Air Forces in Europe (USAFE), with headquarters at Ramstein Air Base, Germany, serves as the air component of the U.S. European Command, a Department of Defense unified command. USAFE directs air operations in a theater spanning three continents, covering more than 20 million square miles, containing 91 countries, and possessing one-fourth of the world’s population. During the Cold War, USAFE was a fight-in-place force geared for a large-scale conflict with the Soviet Union and its Warsaw Pact allies. Since the fall of the Berlin Wall, it has transitioned to an Air Expeditionary Force with a mobile and deployable mix of people and resources that can simultaneously operate in multiple locations. Its role in Europe and Africa has included warfighting as well as humanitarian and peacekeeping operations. USAFE consists of seven main operating bases: RAF Lakenheath and RAF Mildenhall in England; Ramstein and Spangdahlem Air Bases in Germany, Aviano Air Base in Italy, Lajes Field in the Azores, and Incirlik Air Base in Turkey.\n- Air Force Global Strike Command (AFGSC) is assigned to both nuclear and conventional global strikes, with ICBM and dual-mission bomber forces under a single command. It is responsible for organizing, training and equipping ICBM, B-2 and B-52 bomber forces, as well as other deterrence capabilities, in support of combatant commanders. Its locations include Barksdale AFB in Louisiana (2nd Bomb Wing, 8th Air Force, and AFGSC), F.E. Warren AFB in Wyoming (90th Missile Wing, 341st Missile Wing, and 5th Bomb Wing), and Whiteman AFB in Missouri.\n- Air Force North is a component of the North American Aerospace Defense Command (NORAD) and the U.S. Northern Command (USNORTHCOM). It provides airspace surveillance and control and directs air sovereignty activities for the continental United States and other designated areas.\n- Air National Guard enforces federal authority, suppresses insurrection and defends the nation when mobilized by the president, Congress, or both. In conjunction with USAF, it participates in operations and exercises worldwide by direction of the Air Staff, major commands or joint/unified commands.\n- U.S. Air Forces Central (USAFCENT) is the air component of U.S. Central Command, and is responsible for air operations (unilaterally or in concert with coalition partners) and developing contingency plans in support of national objectives for USCENTCOM's 20-nation area of responsibility in Southwest Asia.\nA complete list of all aircraft employed by USAF can be found on their Web site.\nThe Air Force Reserve Handbook 2011 (pdf)\nAir University Catalog (pdf)\nFifth Air Force Nose Art Gallery\nFrom the Web Site of the Department of the Air Force\nWhere Does the Money Go:\nmore\nless\nAlmost all of the weapons, equipment and supplies used by the Air Force are provided through defense contractors. According USAspending.gov, in FY 2007, 79,087 different companies received Department of Defense contracts totaling $312 billion. However the top six companies, Lockheed Martin, Boeing, Northrop Grumman, General Dynamics, Raytheon, and BAE Systems, received almost one third of that money.\nThese six also help make up the top 25 defense contractors who do business with the Air Force, along with United Technologies Corp., North American Airlines, FedEx, Computer Sciences Corp., General Electric, Honeywell, MIT, and the Carlyle Group, among others. Some of the Air Force’s most important weapons systems, and their contractors, are:\n- A-10 Thunderbolt attack plane (Fairchild Republic Co.)\n- B-1 bomber (Boeing)\n- B-2 Spirit bomber (Northrop Grumman Corp. along with Boeing, Hughes Radar Systems Group, General Electric Aircraft Engine Group, and Vought Aircraft Industries, Inc.)\n- B-52 Stratofortress bomber (Boeing)\n- C-130 Hercules transport plane (Lockheed Martin)\n- C-17 Globemaster III transport plane (Boeing)\n- C-5 Galaxy transport plane (Lockheed)\n- F-15 Eagle fighter (Boeing, from McDonnell Douglas)\n- F-16 Fighting Falcon fighter (Lockheed Martin)\n- F-22 Raptor fighter (Lockheed Martin, Boeing)\n- KC-135 Stratotanker tanker (Boeing)\nControversy often swirls around the choice of a company to build a new plane for the Air Force. Take for example the task of midair refueling. For decades the Air Force used Boeing’s KC-135 (a rendition of the old 707 commercial jet) to refuel Air Force fighter and bombers on long missions. But with the aircraft reaching its service limits due to age, the Air Force tried to lease a modified version of Boeing’s 767 to replace the KC-135. The deal fell apart after accusations arose over costs and ethical violations (see Controversies).\nWith the failure of the Boeing lease deal, USAF officials turned their attention to buying a newly designed fuel tanker. In March 2008 the Air Force announced that Northrop Grumman was the winner of the KC-X competition for development and procurement of up to 179 tanker aircraft for approximately $35 billion. The initial contract for the newly named KC-45 called for the system design and development of four test aircraft for $1.5 billion. The first 18 aircraft will be delivered by 2017. The contract also included five production options targeted for 64 aircraft at $10.6 billion.\nThe Air Force’s decision to go with the Northrop Grumman team infuriated lawmakers in both chambers and both parties. Not mentioned in the Air Force public statement about the contract was the fact that the American subsidiary of the European defense conglomerate EADS, which includes aircraft maker Airbus, would help Northrup Grumman build the new tanker. Lawmakers charged that the selection shortchanged U.S. jobs, weakened the aerospace industrial base and created jobs in Europe at a time when the economy was headed for recession.\nSome of the Air Force contracts awarded in 2012 include:\n- $68 million contract to Lockheed Martin for support operation for the first two GPS III satellites\n- $6.9 billion Network Centric Solutions 2 contract to Iron Bow LLC for purchase of IT items\n- $5.4 million contract to MacAulay-Brown, Inc. for R&D on the LAIRCM program.\nUSASpending.gov also provides data on additional Air Force contractor transactions, such as these top five types of products purchased between FY 2002 and FY 2012: operational services ($264,750,276), hospital and infirmary construction ($69,542,904), air passenger service ($41,000,000), fuel oils ($39,404,243), and facilities operations support services ($16,976,171). During that period, more than $527 million was spent by the Air Force on 1,147 contractor transactions.\nThe top five recipients of that contractor spending were:\n1. Cerberus Capital Management L.P. $264,750,276\n2. Kiewit/ Cornerstone J/V $69,516,602\n3. Aircraft Charter Solutions Inc. $41,000,000\n4. TMV LLC $39,404,243\n5. Chenega Corporation $24,688,011\nAir Force Announces Tanker Contract (Air Force Link)\nAir Force faces fire for controversial tanker decision (by Roxana Tiron, The Hill)\nControversies:\nmore\nless\nCulture of Abuse of Women in the Air Force\nCritics have accused the U.S. Air Force of allowing a culture of abuse to exist toward women, owing to recent controversies involving pornography and sexual misconduct.\nIn January 2013, the Air Force announced it had discovered hundreds of examples of pornography as well as thousands of other inappropriate items at bases and facilities worldwide.\nInspections revealed about 32,000 items that fell into three categories: pornography, unprofessional material, and inappropriate or offensive material.\nThe discoveries came on the heels of media reports of sexual harassment and hostile working conditions for female airmen, and amid a growing scandal centered on Joint Base San Antonio-Lackland, Texas, over sexual misconduct by Air Force instructors toward trainees.\nAt least 25 military training instructors were investigated at Lackland, leading to charges against 11. As of late January 2013, five had been convicted of charges ranging from rape to inappropriate relationships with recruits.\nTwo commanding officers were removed, and six more received “disciplinary action.”\nPorn Sweep or Witch Hunt? (by Chris Carroll, Stars and Stripes)\nLackland Air Force Base Sex Scandal Report Cites 'Abuse Of Power' Amid Petraeus, Allen Probe (by Molly O’Toole, Huffington Post)\n9/11 Remains Mishandled at Dover AFB\nThe mortuary at Dover Air Force Base was heavily criticized after it was learned in 2012 that the remains of September 11 victims were dumped in a landfill, among other problems.\nDefense records, including emails, showed that Air Force officers considered burying the remains at sea before deciding to discard some and burn other parts of it as medical waste.\nIt was also reported that the Air Force dumped the burned partial remains of more than 270 American troops in a Virginia landfill between 2003 and 2008.\nIn response to the controversy, the Air Force began disciplinary actions against Col. Robert Edmondson, the former commander of the Air Force Mortuary Affairs Operations Center, and his civilian deputy, Trevor Dean.\nAn investigation by the Office of Special Counsel learned that Edmondson, Dean, and another supervisor had provided phony reasons to fire or punish four mortuary workers who had exposed problems there.\nSupervisor In Air Force Mortuary Controversy Faces Further Discipline (Fox News)\nDover Air Force Base Human Remains (Breaking News)\nAir Force Debated Disposal Of 9/11 Remains (by Lolita Baldor, Associated Press)\nControversial Photo\nA group of airmen created uproar in December 2011 after taking a photo with one of their buddies lying in an open casket, wearing a noose and chains across his body.\nThe Air Force personnel were part of the 37th Training Group at Lackland Air Force Base in Texas. Their commander launched an investigation into the matter.\nIncluded with the photo, which was posted on Facebook, was the caption: “Da Dumpt, Da Dumpt …. Sucks 2 Be U.”\nThe image surfaced shortly after the disclosure that the Air Force’s Port Mortuary at Dover Air Force Base in Delaware had lost and mishandled the remains of hundreds of dead soldiers.\nBut it was later determined that the photo was taken months before the mortuary controversy went public, leaving it unclear what the airmens’ point was, if any.\nCasket Photo Sparks Investigation At Lackland (by David Larter, Air Force Times)\nCasket Photo Sparks Air Force Investigation, Outrage (by James Eng, NBC News)\nOf Context and Caskets: No Wrongdoing in Controversial Photo (God and Country)\nRemains of 274 Air Force Troopers Dumped in Landfill\nThe U.S. Air Force was blasted publicly in 2011 for dumping the remains of dead American troops in a landfill between 2004 and 2008.\nThe cremated remains of at least 274 American military personnel were disposed in a Virginia landfill, and family members were not notified by the Air Force, which tried to cover up the scandal.\nIn late 2011, federal investigators complained of “gross mismanagement” at the morgue at Dover air base, the main port of entry for fallen American soldiers returning to the U.S.\nIt was discovered that body parts were left in freezers for months or even years, and in one incident, the disfigured arm of a dead marine was removed with a hacksaw, without permission from his parents, so that his body could fit into a coffin.\nReport: Air Force Dumped Remains Of 274 Troops In Landfill (MSNBC)\nUS Air Force Used Secret Landfill Site To Bury Soldiers (by Guy Adams, The Independent)\nAF Ripped Anew In Remains Controversy (by Pauline Jelinek, Associated Press)\nUSAF Drone Attack on Troops\nAn unmanned aircraft controlled by the U.S. Air Force accidentally killed two American military personnel in Afghanistan after they were mistaken for enemy combatants.\nThe two men, Marine Staff Sgt. Jeremy Smith and Navy Corpsman Benjamin Rast, were trying to reach a group of Marines coming under fire in Helmand province in April 2011 when the pilot of an Air Force drone spotted activity in the area. Thinking the unidentified figures were attackers, rather than reinforcements, the pilot launched Hellfire missiles at Smith and Rast, killing both.\nThe deaths were considered the first instances of friendly-fire deaths from drone attacks during the war.\nThe government investigated the incident and later determined the drone’s pilot committed no dereliction of duty.\nPredator Drone Mistakenly Kills 2 U.S. Servicemen: Report (by Cara Parks, Huffington Post)\nMultiple Missteps Led To Drone Killing U.S. Troops In Afghanistan (by David S. Cloud and David Zucchino, Los Angeles Times)\n2 US Servicemen Mistakenly Killed By Drone Attack In Afghanistan (by Jim Miklaszewski, NBC News)\nDrone Pilots Suffer High Rate of Burnout\nEven though operating drones is a relatively new type of combat job—and it’s done from thousands of miles away—pilots of the machines have quickly become burned out from guiding the unmanned aircraft during wartime.\nA six-month study conducted by the U.S. Air Force in 2011 found 29% of drone pilots suffered from burnout or high levels of fatigue. Furthermore, 17% were categorized as “clinically distressed,” which meant their stress was impacting their work and/or personal lives.\nPart of the problem is that the personnel who operate drones do so during working hours, then go home to families, with their own stressful circumstances. They also watch the same areas in Afghanistan or Iraq for long periods of time and learn about the daily lives of their “targets” and their families, before sending drones in on them.\nA large majority of the 1,100 pilots who control drones said they were not getting any psychological counseling for their stress.\nReport: High Levels Of 'Burnout' In U.S. Drone Pilots (by Rachel Martin, NPR)\nOverstretched U.S. Drone Pilots Face Stress Risk (by Phil Stewart, Reuters)\nWhy Overworked Drone Pilots Are Falling Victims To Stress (by Jill Reilly, Mail Online)\nUSAF C-17 Smuggles Drugs into Argentina\nA U.S. Air Force transport plane became the subject of an unusual diplomatic spat in 2011 between Washington and the government of Argentina.\nIn February, Argentine authorities accused the U.S. of sending a C-17 cargo plane full of contraband into their country. The large aircraft reportedly contained sophisticated communications equipment, GPS devices, high-power rifles, a machine gun and narcotics, plus expired pharmaceuticals including stimulants.\nThe supplies were in boxes stamped 7th Army Airborne Brigade, which is based in North Carolina. An aircraft manifest indicated the materials were for a training course involving Argentine police.\nForeign Minister Hector Timerman planned to file an official protest with Washington. He also called for a joint investigation into the matter to determine why the U.S. Air Force would violate Argentine laws.\nUS Air Force C17 Transport Caught Smuggling Arms And Drugs Into Argentina (Aletho News)\nUS Air Force C-17 Seized Over Argentine Drug Smuggling Accusations (RT.com)\nU.S. Airforce Plane Caught Smuggling Drugs (Drug War 101)\nDefense Cooperation Agreement with Colombia Causes Controversy\nThe United States and Colombia in 2009 signed a new military pact that alarmed many in the South American country.\nThe controversial Defense Cooperation Agreement (DCA) granted the U.S. military access to seven Colombian military bases for a period of 10 years. The declared purpose of the DCA was to support counternarcotic and counterinsurgency initiatives within Colombia.\nBut then a U.S. Air Force document surfaced that said the DCA would also help Washington counteract “anti-U.S. governments” in South America.\nAs it turned out, the DCA was stalled from going into effect. Colombia’s Constitutional Court struck down the DCA in 2010. The nation’s Congress could still vote to approve it, but the court decision was seen as a serious obstacle to the agreement being ratified.\nUnsettling Revelations Regarding U.S. Lease of Colombian Military Bases (by Christina Esquivel and Paulina Serna, Council on Hemispheric Affairs)\nColombian Court Strikes Down U.S. Defense Agreement (Just the Facts)\nBoeing Wins Contract after Protest\nTen years and multiple protests later, Boeing finally won a billion-dollar bid in 2011 to supply the U.S. Air Force with new midair refueling tankers.\nThe process began around 2001 when the Air Force first requested proposals from defense contractors. The competition came down to two companies: Boeing versus Northrop Grumman and EADS, based in Europe.\nIn 2008, the Air Force announced that the Northrop/EADS team had won the bid. This prompted Boeing to file a protest with the Government Accountability Office (GAO).\nBoeing claimed the Air Force turned a “fair, open and transparent competition” into “a process replete with irregularities” that placed the American manufacturer at a disadvantage.\nThe GAO reviewed the claim and decided to overturn the award. This forced the Air Force to start over again with the bidding.\nThen, it was Northrop and EADS’ turn to complain, saying the new guidelines favored Boeing. Northrop eventually pulled out of the competition, leaving EADS, with a tanker based on the Airbus A330, to duke it out with Boeing, which proposed one built around the 767 body. The Air Force decided, once and for all, to give Boeing the job in 2011.\nBoeing Protests U.S. Air Force Tanker Contract Award (Boeing)\nSummary of Boeing Tanker Protest (Wall Street Journal)\nBoeing Bid Beats Europe for Tanker (by Nathan Hodge, Wall Street Journal)\nAir Force Blocks Access to WikiLeaks Documents Online\nThe Air Force in 2010 cut off access to any Web site containing classified documents published by WikiLeaks.\nOfficials blocked Air Force personnel from reading more than two-dozen news sites, including The New York Times, the British newspaper The Guardian, the German magazine Der Spiegel, the Spanish newspaper El País and the French newspaper Le Monde.\nWhen personnel tried to view the websites, a warning message appeared on screen that read: “Access Denied: Internet usage is logged and monitored.”\nSome Air Force leaders admitted the ban might prove ineffective, since personnel could use personal computers at home to read the WikiLeaks materials.\nA few months later, the Air Force warned airmen to stay away from WikiLeaks altogether, less they risk being prosecuted for reading documents still considered classified by the U.S. government. The Air Force quickly retracted its threat.\nAir Force Clarifies WikiLeaks Directive (by Scott Fontaine, Air Force Times)\nAir Force Blocks Sites That Posted Secret Cables (by Eric Schmitt, New York Times)\nAir Force Cutting Off Access To WikiLeaks News (CNN)\nUS Air Force Blocks Staff From Websites Carrying WikiLeaks Cables (by Richard Adams, The Guardian)\nAir Force Blocks New York Times for Posting WikiLeaks Documents (by Glenn Halbrooks, About.com)\nUSAF Reserves Charged with Plagiarism\nThe U.S. Air Force Reserve was accused in 2010 of plagiarizing a song by the band the White Stripes for a television commercial that aired during the Super Bowl and ran on the Reserve’s Web site.\nThe White Stripes threatened “strong action” against the Air Force Reserve for ripping off the band’s 2002 hit “Fell in Love With a Girl.”\nBoth the Air Force Reserve and Fast Forward Music, the company that produced the commercial and had hired a musician to compose a tune for it, denied knowingly copying the Stripes’ tune.\nThe Air Force Reserve issued a statement in response to the White Stripes’ allegation, saying: “There was never any intention to utilize any existing music, or to sound like any music by the band White Stripes, or any other musical performer. Any similarity or likeness to any other music is completely unintentional. This ad was produced specifically for airing regional during the Super Bowl in some local markets. It was scheduled to be pulled after the Super Bowl. It only ran one time.” It was also pulled from the Web.\nWhite Stripes Vs. Air Force Reserve Ad: Musician Addresses Controversy: 'It's My Responsibility' (by Simon Vozick-Levinson, Entertainment Weekly)\nWhite Stripes Vs. U.S. Air Force Reserve Ad: Who's To Blame? (by Simon Vozick-Levinson, Entertainment Weekly)\nWhite Stripes Air Force Reserve Super Bowl Ad Controversy (Pop Crunch)\nUSAF Loses Contact with 50 ICBMs\nA missile base in Wyoming briefly lost contact with 50 underground ICBMs in October 2010.\nThe U.S. Air Force, which operates the country’s land-based missile force, said a technical malfunction severed communications for nearly an hour between airmen in the command facility and 50 Minuteman 3 ICBMs housed in silos at F.E. Warren Air Force Base.\nAir Force spokesman Lieutenant Colonel Todd Vician said base operators were able to monitor the security of the missiles while the problem was being fixed.\nAlthough the Air Force downplayed the seriousness of the glitch, it was important enough to inform the White House.\nThe 50 Minutemen represented one-third of the missiles at the Wyoming base and one-ninth of the nation’s ICBM arsenal.\nAir Force Loses Contact With 50 ICBMs at Wyoming Base (Global Security Newswire)\nOops! US Air Force Loses 50 Nukes (RT.com)\nCommunication With 50 Nuke Missiles Dropped in ICBM Snafu (by Noah Shachtman, Wired)\nUSAF and UFOs\nMore than half a dozen former Air Force personnel claimed in recent years that their branch of the service experienced numerous encounters with UFOs during the 1960s, ’70s, and ’80s.\nAt a 2010 news conference in Washington D.C., six former officers and one ex-enlisted man told the media that they either had personal sightings or seen reports from subordinates and others about UFOs hovering over U.S. nuclear missile silos or nuclear weapons storage areas during the Cold War.\nThree of the former Air Force officers said UFOs suspended themselves over silos near Montana’s Malmstrom Air Force Base in 1967 and somehow had temporarily deactivated some of the nuclear missiles.\nTwo years later, former Air Force Col. Charles Halt publicly accused the U.S. government of a UFO cover-up involving a secret agency charged with handling extraterrestrial visitations.\nHalt was the deputy base commander of the RAF Bentwaters military base in England who had witnessed, along with others, several UFO-related events at Rendlesham Forest in December 1980.\nHis remarks were made while serving on a panel of speakers (“Military UFOs: Secrets Revealed”) that included two former Air Force officers who were part of the infamous Project Blue Book that investigated UFOs in the 1950s and ’60s, and a former investigator with Britain’s Ministry of Defense.\nCharles Halt, Former Air Force Colonel, Accuses U.S. Of UFO Cover-Up (by Lee Speigel, Huffington Post)\nThe Air Force Releases Schematics On How To Build A Flying Saucer (by Robert Johnson, Business Insider)\nAliens Are Monitoring Our Nukes, Worry Ex-Air Force Officers (Fox News)\nEx-U.S. Air Force Security Policemen Discuss UFO Activity (Roger Marsh, Examiner.com)\nUFOs Eyed Nukes, Ex-Air Force Personnel Say (CNN)\nEx-Air Force Personnel: UFOs Deactivated Nukes (CBS News)\nSarah Palin and Russian Incursions Over Alaska\nWhile helping John McCain seek the White House in 2008, running mate Sarah Palin claimed Russian military jets had entered U.S. airspace over her state of Alaska. Furthermore, the governor claimed she was in the loop whenever the U.S. Air Force scrambled interceptors to meet unauthorized intruders.\nAfter Palin made these remarks, the New York Daily News reported that the Alaska governor possessed no command authority over the Air Force.\n“She doesn’t have any role in that process,” Air Force Maj. Allen Herritage, spokesman for the Alaska North American Aerospace Defense Command, told the Daily News.\nSteven Biegun, a McCain foreign policy adviser, explained that Palin was informed by her National Guard commander about any close encounters with the Russians. But the Alaska Air Guard, which Palin oversees, does not fly interception missions and merely performs airspace-watching missions under NORAD command.\nPalin’s remarks, which inferred that the Russians had entered U.S. airspace, also was corrected by the military. Officials said Russian bombers had skirted Alaskan airspace 20 times, but they had not violated it during Palin’s term in office.\nNORAD: Sarah Palin Has No Role In Guarding U.S. Airspace Despite Claims In Katie Couric Interview (by James Gordon Meek, New York Daily News)\nAir Force Contradicts Palin: No Russian Incursions Into U.S. Airspace During Her Tenure. (Think Progress)\nThe Russian Air Force Can See Sarah Palin’s House from their Bear Bombers (by Whitney Pitcher, A Time for Choosing)\nManhattan Flyover Causes Panic\nNew Yorkers went into a brief panic in April 2009 when Air Force One flew low over Manhattan as part of a photo op.\nThe plane, a backup to the one regularly used by the president, was accompanied by two F-16 fighters, while Air Force photographers snapped pictures of the aircraft and the New York City skyline, including the Statue of Liberty.\nSome workers in the financial district feared another September 11 attack was underway and began to evacuate buildings. The panic prompted Mayor Michael Bloomberg to publicly blast the White House for its actions.\nPresident Barack Obama was not onboard. He was, though, quite furious when he heard what happened.\nThe flyover was orchestrated by the White House Military Office, led by Louis Caldera, a former California politician who also served in the Clinton administration. Caldera apologized for the incident and resigned from his post within a month.\nWhite House Apologizes for Air Force Flyover (by A.G. Sulzberger and Matthew Wald, New York Times)\nAir Force One Photo Op Causes Panic In New York (Associated Press)\nFlyover Photos Of Controversial Air Force One Flight Released (by Cindy Adams, Examiner.com)\nOfficial Who OK'd Air Force One Jet Flyover Resigns (CNN)\nAir Force Runs Toxic Burn Pit in Iraq\nAn Air Force expert warned that an open-air “burn pit” at the largest U.S. base in Iraq may have exposed thousands of troops, contractors, and Iraqis to cancer-causing dioxins during the war.\nJoint Base Balad, the central logistics hub for U.S. forces in Iraq, regularly burned some 147 tons of poisons and hazardous medical waste per day, allowing dark plumes of smoke to waft over living quarters and the base’s hospital.\nAir Force Lieutenant Colonel Darrin Curtis, former bioenvironmental flight commander for Joint Base Balad, wrote in 2006 regarding the burning, which continued for two years after that: “In my professional opinion, there is an acute health hazard for individuals. There is also the possibility for chronic health hazards associated with the smoke.”\nBase operators burned a wide range of items, including Styrofoam, unexploded ordnance, petroleum products, plastics, rubber, dining facility trash, paint and solvents, and medical waste, including amputated limbs, according to Curtis.\nBurn Pit At Balad Raises Health Concerns (by Kelly Kennedy, Army Times)\nMilitary Burn Pits and Chronic Health Problems (LawyersandSettlement.com)\nStudy: Health Effects From Military Burn Pits Inconclusive (by Kelly Kennedy, USA Today)\nNuclear Weapons Incident Forces Resignations\nA major snafu involving half a dozen nuclear armed missiles caused two high-profile resignations within the Air Force in 2008.\nThe Air Force was publicly embarrassed after admitting that a B-52 bomber flew from its base in North Dakota to Louisiana, while the crew was completely unaware that six cruise missiles armed with nuclear warheads had been loaded onto the plane without authorization.\nThe warheads were supposed to have been removed from the missiles before they were taken from their storage bunker.\nAnother mistake came when Air Force personnel failed to notice or report that the warheads were missing from Minot Air Base, and yet another failure allowed the missiles to remain mounted on the B-52 for at least 36 hours without adhering to proper security precautions.\nAs a result of these blunders, and another involving the shipping to Taiwan of equipment capable of triggering a nuclear warhead, Air Force Chief of Staff General T. Michael Moseley and Secretary Michael W. Wynne resigned from their posts in June 2008.\n2007 United States Air Force nuclear weapons incident (Wikipedia)\nAir Force officials ousted over nuclear gaffes (CNN)\nAir Force Fails New Nuclear Reviews (by Bill Gertz, Washington Times)\nUSAF Blog Ban\nAir Force leaders upset personnel in 2008 with a new policy that essentially banned them from reading blogs while working by setting up a filtering system.\nImplemented by the Air Force Network Operations Center, the policy interfered with the work of personnel who followed certain blogs on military subjects ranging from counterterrorism to defense technology, critics argued.\nBut Air Force brass claimed the reading of blogs posed potential security risks, despite the fact that the Army and the Navy had been reaching out to bloggers more and more to counter negative impressions of the departments.\nRetired Air Force Colonel Tom Erhard, a senior fellow at the Center for Strategic and Budgetary Assessments, told Wired: “It is increasingly clear that active exploitation could take advantage of airmen and civilians who want to inform and correct the often outrageous, false assertions on these blogs.”\nUS Air Force Shoots Down Blogs, Airmen Frustrated (by Ryan Paul, Ars Technica)\nAir Force Releases ‘Counter-Blog’ Marching Orders (by Noah Shachtman, Wired)\nAir Force Bomb Wing Flunks Nuclear Inspection\nA strategic bomb wing based in North Dakota flunked an important security inspection in 2008, and cost its commander his job.\nThe 5th Bomb Wing at Minot Air Force Base was subjected to a defense nuclear surety inspection by the Defense Threat Reduction Agency (DTRA). After reviewing the wing’s procedures and personnel for a week, the DTRA gave the unit an “unsatisfactory” grade.\nInspectors found security broke down on multiple levels during simulated attacks across the base, including against nuclear weapons storage areas. One security guard played video games on his cell phone while protecting a “restricted area perimeter,” while another airman was “unaware of her duties and responsibilities” during the exercise.\nThe poor performance followed another embarrassing episode for the air wing, when one of its B-52s took off loaded with six nuclear-tipped cruise missiles, which constituted a violation of Air Force procedures.\nColonel Joel Westa had been assigned as the 5th Bomb Wing commander two years earlier in hopes that he could fix the wing’s problems after the B-52 incident. Westa was relieved of his command following the DTRA inspection. He later chose to retire from the service.\n5th Bomb Wing flunks nuclear inspection (by Michael Hoffman, Air Force Times)\nOusted Minot commander Westa to retire (by Michael Hoffman, Air Force Times)\nDominating Cyberspace\nThe U.S. Air Force, in coordination with the Department of Homeland Security, DARPA and other agencies, has a five-year, $30 billion plan to control all computers worldwide.\nAir Force Aims for “Full Control” of “Any and All” Computers (by Noah Shachtman, Wired)\nAttention Geeks and Hackers: Uncle Sam’s Cyber Force Wants You! (by William J. Astore, Dandelion Salad)\nTomgram: William Astore, Militarizing Your Cyberspace (by Tom Engelhardt, TomDispatch)\nDominant Cyber Offensive Engagement and Supporting Technology Funding Opportunity (Federal Business Opportunities)\nAir Force Commercials Über Alles\nA recent advertising campaign by the Air Force, purportedly intended to help with recruitment, created a backlash of criticism from both Congress and other branches of the military. The commercials featured troubling images of black-clad terrorists and the Chinese army followed by narration that stated, “Only the United States Air Force has the speed, power and vision to defend our nation for the century ahead. U.S. Air Force, above all.” Officials on Capitol Hill and in the Pentagon believed that the new Air Force ads were less about recruiting and more about lobbying for extra money.\nPart of a $25-million campaign called “Above All,” the ads did not highlight what the military offers individuals who join. Instead, they stressed how the Air Force protects the nation. Some Pentagon officials questioned why the Air Force needed recruiting ads at all since the service has had no trouble meeting its recruiting goals and was supposed to be downsizing, not growing.\nThe language used in the ads also was controversial. One Defense official said “Above All” evoked the phrase “über alles” from the national anthem used by Nazi Germany, which roughly translates to “above all.” Air Force officials insisted the commercials merely represented an innovative and necessary campaign, and that they brought in German language experts to make sure the “Above All” catchphrase did not evoke the words “über alles” with German speakers.\nTo some members of Congress, the recruiting ads looked suspiciously like a lobbying effort. Rep. John P. Murtha (D-Pennsylvania), chairman of the House Defense Appropriations Subcommittee, called the advertising campaign “outrageous” and questioned in a letter to Secretary of Defense Robert M. Gates whether it amounted to an illegal lobbying effort.\nRep. Allen Boyd (D-Florida) said Congress should “thoroughly examine” the ads. Rep. Jerry Lewis (R-California) was incensed over ads that seemed to target the Washington area. Two full-page newspaper ads ran in The Washington Post, which has a limited circulation outside the capital region, suggesting the ads were designed to lobby Congress.\nAlthough the Air Force is supposed to shrink, top officials asked Congress for money to halt the cuts and restore its ranks. The Air Force’s budget proposal stated the objective of the advertising campaign was to increase the service’s “brand awareness.”\n“If we are even thinking about turning around from a declining Air Force to an increasing Air Force, we need to show what we are doing in support of the nation,” said Air Force Secretary Michael W. Wynne. “We need the influencers not to think about the Air Force as a dead end.”\nAir Force ads’ intent questioned (by Julian E. Barnes and Peter Spiegel, Los Angeles Times)\nControversial Ad Shows Missile Destroying a Satellite\nThe U.S. Air Force in 2008 pulled a television advertisement depicting a missile destroying an American satellite after critics complained about the content.\nThe commercial, part of the Air Force’s “Above All” recruiting and public-relations campaign, contended that a single missile could knock out cell phone calls, television programming, and GPS navigation.\nAfter pulling the ad, the Air Force promised to bring it back with a new story line.\nGPS experts said several GPS satellites would have to be destroyed to disrupt phone and banking services, demonstrating that the commercial was inaccurate and hyperbolic.\nU.S. Air Force Pulls Controversial TV Spot (by Ben Iannotta, Defense News)\nAir Force to Farm out Strategy\nRelying on defense contractors to meet its mission goals is nothing new for the Air Force. But now USAF leaders apparently want to farm out their master strategizing as well.\nEvery four years, the Pentagon produces its Quadrennial Defense Review, “a comprehensive examination of the national defense strategy, force structure, force modernization plans, infrastructure, budget plan, and other elements of the defense program and policies of the United States with a view toward determining and expressing the defense strategy of the United States and establishing a defense program for the next 20 years,” according to DoD.\nThe Air Force provides its section of the review, detailing how it sees the future of military aviation. But instead of writing it themselves, Air Force officials published a notice saying they were looking for a company “to provide the focal point for the Air Force Quadrennial Defense Review ... through an integrated process that reaches across the Department of Defense, supporting the Chief of Staff's global strategic vision while preparing our nation to fight and win in air, space, and cyberspace.”\nAir Force to Contractors: Come Up With Our Strategy (by Noah Shachtman, Wired)\nWeapons Procurement Waste and Corruption\nIn March 2008 the Government Accountability Office released a scathing report on the status of numerous weapons projects being developed for the Pentagon. Government auditors found programs for new ships, aircraft and satellites were billions of dollars over budget and years behind schedule.\nAmong the major programs reviewed was Lockheed Martin’s F-35 Joint Strike Fighter, a stealthy tactical fighter intended for the Air Force and Navy. Cost projections had put the price tag at almost $100 million per plane, up 40% since 2001. In a statement, Lockheed said that the Joint Strike Fighter was “performing solidly, making outstanding technical progress in the context of the most complex aircraft ever built” and that “the bedrock and the cornerstone” of the F-35 program have been “affordability and cost containment.” Problems had emerged in the F-35’s performance, including engine air intake restrictions and wobbling while hovering. Consequently, the aircraft was put on probation in 2011 by then-Secretary of Defense Robert Gates. That decision was reversed in 2012 by Secretary Leon Panetta, who claimed progress had been made in correcting the problems. A strike of union workers at Lockheed factories in May compounded the craft’s problems. Overall program delays have affected the global market for F-35 sales.\nIn another case, the initial contract target price of Boeing’s program to modernize avionics in the C-130 cargo plane was expected to skyrocket 323%, to $2 billion. The contract award, which finally came in at $4.1 billion, had been challenged by Lockheed Martin and other bidders after US Air Force acquisition official Darleen Druyun confessed to having favored Boeing out of gratitude for jobs that Boeing gave to her daughter and future son-in-law. She was sentenced to nine months in prison and fined for a series of conflict-of-interest violations. Following the scandal, the Air Force planned to invite new bids for the contract, then made an unsuccessful attempt to kill the program in 2009. A year later, 198 of the crafts were on the books to receive the avionics upgrade at an initial cost of $14 million per plane. The Pentagon finally cancelled the program in 2012.\nThe GAO report said the reasons for the cost overruns and delays were threefold: too many programs chasing too few dollars; technologies not mature enough to go into production; too long to design, develop and produce a system.\n“They’re asking for something that they’re not sure can be built, given existing technologies, and that’s risky,” said a GAO official.\nThe GAO’s March 2012 report on Pentagon weapons projects concluded that defense acquisitions have lagged behind policy and law. It also reported that major acquisition programs grew by over $74.4 billion during the preceding year, of which about $31.1 billion was attributable to “inefficiencies in production.” It added that an increase in acquisition costs have caused over 60% of the programs to lose “buying power,” preventing DoD from using its funds for other priorities.\nGAO Blasts Weapons Budget: Cost Overruns Hit $295 Billion (by Dana Hedgpeth, Washington Post)\nGAO Report: Defense Acquisitions - 2008 (pdf)\nGAO Report Defense Acquisitions – 2012 (pdf)\nAir Force Grounds F-15s, Brings in Troubled F-22s\nIn November 2007 the Air Force twice grounded its fleet of F-15 fighters. On Nov. 3, all 676 of the planes were grounded, even those supporting critical missions, after an F-15 crashed during an Air National Guard training exercise in Missouri. The plane had been among four planes engaging in one-on-one training flights in which speeds of 400 to 450 mph are typical. The pilot was forced to eject from the aircraft, which crashed harmlessly in the Missouri countryside.\nAir Force officials insisted the grounding stemmed only from the Missouri crash. However, three other F-15s crashed earlier that same year in separate incidents. In May, an F-15 crashed just outside of Vincennes in southwestern Indiana during a flight practice with four F-16 jets from the Indiana Air National Guard’s 181st Fighter Wing, based in Terre Haute. In June, another F-15 jet from the 142nd Fighter Wing, Oregon Air National Guard, went down in the Pacific Ocean during a training mission. And in a separate incident in June, an F-15 crashed near Eielson Air Force Base in Alaska.\nOn Nov. 21 the Air Force returned all of its F-15s to active service in spite of the fact that there had been concerns about structural failure in the case of the Missouri incident. But a week later, the Air Force again grounded the majority of the planes, 452 in all, after discovering defects in the metal rails that hold the F-15s fuselage together. USAF officials said the planes would remain grounded until each one was inspected and possibly repaired.\nThe plane is built by Boeing, which bought the aircraft from McDonnell Douglas. Boeing delivered the last F-15s to the Air Force in 2004. The Air Force planned to replace the aging fighter with the F-22 Raptor, built by Lockheed Martin. The Raptor joined the USAF fleet in 2005 amid much fanfare, with the Air Force expressing confidence in the craft’s speed, stealth and combat capabilities. However, a variety of factors—including the Raptor’s high cost, development of the more affordable F-35, and a federal ban on Raptor exports—led the Defense Department to halt all new orders of the F-22 in 2009, and funding for it was dropped in 2010. Production of the final Raptor was completed in December 2011. While it remains in operation, the Raptor has since been plagued by chronic problems with its pilot oxygen system. The fighter plane reportedly has the highest accident rate of any USAF aircraft currently in active service.\nAir Force grounds F-15 jets over Missouri crash: Boeing fighter planes probed for ‘structural failure’ after training accident (Associated Press)\nAir Force grounds F-15 fighter jets again: Boeing aircraft to be inspected after ‘possible fleet-wide’ problems found (Associated Press)\nF-22 Raptor pilots make problems public (by Rowan Scarborough, Washington Times)\nAir Force Officers Accused of Attacking Blackwater Contractor\nIn February 2006 the Air Force Times reported a bizarre incident involving two Air Force lieutenant colonels who were facing charges of assault and conduct unbecoming an officer after a face-off with a Blackwater contractor in Afghanistan. Accounts from the Air Force and the two officers, as well as their families, differed wildly.\nThe Air Force charged that the two officers, Lt. Col. Gary W. Brown and Lt. Col. Christopher R. Hall, initiated the incident by ramming the contractor’s sport utility vehicle. But family members of the two men said it was the other way around—that security contractor Jerry Bergeron rammed the Air Force SUV the two officers were in and that they responded to what they perceived as a threat on their lives and their accompanying wives.\nNeither officer had previous disciplinary problems. Both were reservists who returned to active duty after Sept. 11, 2001, as part of Air Force recall programs. Brown took a military leave of absence from his job as a pilot for American Airlines in the fall of 2003 and ended up flying C-17s out of Charleston Air Force Base, South Carolina. Hall left his airline job in September 2002 and had been serving as an instructor pilot at Laughlin Air Force Base, Texas. The two men deployed separately to Afghanistan in spring 2006 and ultimately worked to help get the Afghan air force off the ground.\nIn April 2006 the charges against Hall and Brown were dropped after the investigating officer determined the men had behaved properly given the security situation in Afghanistan. Furthermore, the Air Force began an investigation into allegations of witness tampering, attempted bribery, falsified evidence and doctored charging documents. The Air Force statement read, “someone may have attempted to influence the testimonies of several local national witnesses.”\nLt. Colonels charged with assaulting contractor (by Rod Hafemeister, Air Force Times)\nCharges dismissed against officers in Kabul run-in with contractor (Air Force Times)\nAir Force Academy Sued for Intolerance\nIn October 2005 a Jewish father of two Air Force Academy cadets sued the Air Force, claiming senior officers and cadets illegally imposed Christianity on others at the school. The lawsuit was filed in federal court by Mikey Weinstein, an academy graduate and outspoken critic of the school’s handling of religion.\nThe lawsuit stated that over the past decade or more, academy leaders had fostered an environment of religious intolerance at the Colorado school, in violation of the First Amendment. Weinstein’s sons were subjected to anti-Semitic slurs from evangelical Christian cadets, he said.\nCadets, watchdog groups and a former chaplain at the academy alleged that religious intolerance was widespread at the school. In August 2005 the Air Force issued guidelines discouraging public prayer at official functions and urging commanders to be sensitive about personal expressions of religious faith.\nOther complaints included a Jewish cadet being told the Holocaust was revenge for the death of Jesus and that another Jew being called a Christ killer by a fellow cadet. A banner in the football team's locker room read: “I am a Christian first and last ... I am a member of Team Jesus Christ.” There also were complaints that cadets were pressured to attend chapel, that academy staffers put New Testament verses in government e-mail and that cadets used the e-mail system to encourage others to see the Mel Gibson movie The Passion of the Christ.\nThe lawsuit named the Air Force and its secretary, Pete Geren, as defendants.\nAir Force Sued Over Religious Intolerance (by Tim Korte, Associated Press)\nMikey Weinstein and His Lawsuit Against the U.S. Air Force (Jews On First)\nBoeing Lease Deal under Assault\nFor years the Air Force relied on the KC-135 to provide air-refueling services to its fleet of planes. Arguing that it was time to replace the aging KC-135, the Air Force negotiated a $24 billion deal with Boeing to lease 100 of its 767 commercial airliners to take over air-refueling responsibilities. The deal came under attack by Sen. John McCain (R-Arizona) who claimed that Boeing officials had improperly won the contract from the Air Force, which prompted an investigation by the Pentagon’s inspector general.\nThe report found that Air Force officials had not thoroughly examined all of their options before concluding that they were paying a fair price for the tankers. The inspector general, Joseph E. Schmitz, also said that Air Force officials improperly waived the government’s right to audit the program and failed to follow other important acquisition and testing practices.\nIn the fallout over the scuttled deal, Boeing fired two executives after uncovering “compelling evidence” of ethical violations related to contract negotiations. The two employees were Darleen Druyun, a former Pentagon acquisition official who lobbied the Air Force on behalf of Boeing, and Michael Sears, Boeing’s chief financial officer, who was accused of violating company policies by communicating directly and indirectly with Druyun about future employment when she had not disqualified herself from acting in her official Air Force capacity on matters involving Boeing. In addition, an internally initiated review found that both employees had attempted to conceal their misconduct.\nPentagon Says Changes Are Needed in Boeing Jet Deal (by Richard A. Oppel Jr., New York Times)\nMcCain still seeking details on scuttled Boeing lease deal (by Mike Sunnucks, Phoenix Business Journal)\nBoeing fires former Pentagon official involved in tanker lease deal (by Amy Svitak, Government Executive)\nUSAF’s First Female Bomber Pilot Was Discharged for Adultery\nThe Air Force’s first-ever female bomber pilot left the service in disgrace after she was exposed for having an affair with a married subordinate.\nKelly Flinn, a first lieutenant who flew B-52s, was granted a general discharge in 1997 after being charged with adultery, disobedience, fraternization, and lying to investigators. The discharged allowed her to leave the service and avoid a court martial.\nHer military offenses included disobeying a direct order from her commanding officer to break off the affair, and for lying to him about having done so.\nFlinn’s troubles received widespread media attention and was discussed in a U.S. Senate hearing on May 22, 1997.\nDischarged Female Pilot Enters Civilian Life (CNN)\nKelly Flinn Incident (Wikipedia)\nProud To Be (Google Books)\nSuggested Reforms:\nmore\nless\nSuggested Reforms from Center for a New American Security\nWith the Defense Department forced to implement $450 billion in budget cuts over the coming decade, a think tank offered up its recommendations in 2012 for how the U.S. military could trim its expenditures while still maintaining an effective fighting force.\nThe Center for a New American Security (CNAS) saw the budget reductions as an opportunity to implement key reforms that would “make the U.S. military more effective as well as less expensive.”\nFor the Air Force, the CNAS endorsed the idea of significantly reducing the Air Force Reserve, an idea that has upset some on Capitol Hill.\nThe CNAS also suggested the Air Force buy fewer F-35 fighters (reducing the number from 1,763 to between 1,000 and 1,200 aircraft) and instead purchase more F-16s. Other recommendations included prioritizing air and naval forces, developing new drone aircraft for intelligence gathering and strike missions, and staying the course on a new bomber aircraft, but re-evaluating the total number to be purchased.\nThink Tank Calls Budget Cuts an Opportunity to Reform Military (by John T. Bennett, U.S. News & World Report)\nThink Tank Calls for Pentagon Reform (by Marc V. Schanz, Air Force Magazine)\nSustainable Pre-eminence Reforming the U.S. Military at a Time of Strategic Change (by David W. Barno, Nora Bensahel, Matthew Irvine and Travis Sharp, Center for a New American Security)\nCyber-Warfare Reforms\nAfter some starting and stopping with its plans, the Air Force launched its cyber-warfare command during President Barack Obama’s first term.\nIn 2008, the Air Force announced plans to train all of its 320,000 airmen to protect the service in cyberspace. Every enlisted man and officer was going to be taught about cyber warfare in basic training, the Air Force Academy, or officer candidate school.\nIn addition, about 100 students each year would receive advanced instruction at the Undergraduate Network Warfare Training course at Hurlburt Field in Florida. Those attending the special program would learn to operate a computer like “a weapon system,” according to one Air Force general. The goal was to be able to “drop bombs” in cyberspace to achieve military objectives as easily as dropping real 2,000-pound bombs.\nLater that year, however, the Air Force suspended its plans to establish a Cyber Command until leaders had time to further develop the scope and mission of the special outfit. By the following year, cyber-warfare training was in full swing at the Air Force.\nEfforts to engage the enemy online continued to expand, with a 2012 announcement from the Air Force that it wanted concept papers from contractors on ways to build offensive cyber-warfare tools. Leaders sought myriad capabilities, from attacking to mapping networks to cyber-warfare support.\nAir Force Trains Warriors To Defend Cyberspace (by Tom Vanden Brook, USA Today)\nUS Air Force halts plans to establish a Cyber Command (by Dan Goodin, The Register)\nAir Force planning to train hundreds yearly in cyber warfare skills (by Trish Choate, Standard-Times)\nU.S. Air Force To Start Training In Cyberwarfare (by Dan Elliott, Associated Press)\nAir Force Seeks Offensive Cyber Weapons (by J. Nicholas Hoover, InformationWeek)\nStrategic Airlift Force Structure Reform\nTwo U.S. senators proposed a cost-savings measure in 2011 that would have reduced the number of transport planes required of the Air Force for conducting strategic airlifts.\nUnder current law, the Air Force is mandated to have at least 316 planes available for transporting supplies, equipment and military personnel around the world.\nBut Senators Kelly Ayotte (R-New Hampshire) and Jack Reed (D-Rhode Island), both members of the Senate Armed Services Committee, proposed lowering the Air Force’s aircraft inventory minimum down to 301 planes.\nThe Strategic Airlift Force Structure Reform Act of 2011 could have saved taxpayers as much as $1.2 billion over several years, according to Ayotte and Reed.\nTheir plan was endorsed by some senior military commanders, including General Raymond Johns, commander of U.S. Air Mobility Command, who told a congressional panel that the 316 plane requirement forced the Air Force “to keep unneeded, less capable” aircraft, like the aging C-5A, around for missions.\nS. 1704: Strategic Airlift Force Structure Reform Act of 2011 (Govtrack.us)\nBipartisan Ayotte Bill to Reduce Aircraft Floor Could Save Taxpayers More than $1 Billion (Senator Kelly Ayotte)\nSenate Bill 1704 (LegiScan)\nDebate:\nmore\nless\nShould the Air Force depend more on drones?\nIn only a few years drone technology has taken off, becoming a growing part of the United States’ military and civilian sectors. But it has been the expansion of unmanned aerial vehicles (UAVs) by the U.S. Air Force (and to some degree the Central Intelligence Agency) for war that has stirred the greatest debate.\nAs of 2010, the military had spent billions of dollars to expand its fleet of UAVs, which have gone from 167 aircraft in 2002 to more than 7,000. By 2009, the Air Force had already trained more pilots to fly drones than traditional, piloted aircraft, ushering in a new era of warfare.\nThe Air Force plans to greatly expand its fleet of drones by 2047, so much so that some see all piloted aircraft replaced by UAVs in the future. A sign of this development has already appeared with the Defense Department’s decision to scale back purchases of the F-22 Raptor, a piloted combat plane, because its usefulness may be reduced in the coming years with more advances in drone technology.\nAnother advanced fighter, the F-35, may be the last funded, piloted fighter program, according to analysts.\nSome experts say drones represent an approaching technological tipping point that could produce a genuine revolution in military affairs.\nPro:\nOfficials within the Air Force argue drones are the future of the service. First and foremost, UAVs can conduct warfare with precision, and reduce collateral damage, making them a logical replacement for conventional fighters and bombers. Not only will this reduce civilian casualties, but American ones as well, supporters say.\nDrone advocates also say that using UAVs in the war against terrorism is legal. Officials in the Obama administration contend killings of terrorists by drones are legal under established principles of self-defense, international laws of armed conflict and the Authorization for Use of Military Force (the so-called “law of 9/11” passed by Congress following the 2001 terrorist attacks).\nHarold Koh, the State Department’s legal adviser, defended the administration’s use of drones for targeted attacks, asserting that the United States “may use force consistent with its inherent right to self-defense under international law.”\nUS Air Force Prepares Drones to End Era of Fighter Pilots (by Edward Helmore, The Guardian)\nCon:\nCritics say the use of drone attacks violate the laws of war, in part because the air strikes occur inside another nation’s sovereign territory. Attacks inside Pakistan have unquestionably violated international laws of armed conflict because the United States is not at war with Pakistan, critics point out.\nOpponents also argue that drone strikes are fueling anti-American sentiment and spurring more terrorism. Faisal Shahzad, the Pakistani immigrant who tried to set off a car bomb in New York’s Times Square in 2010, is cited as an example, because he suggested that American drone strikes in Pakistan and elsewhere helped motivate him.\nFurthermore, critics cited a recent British study that warned drones are becoming increasingly automated. Soon, UAVs could be able to launch a missile on their own without help from human controllers—and without recourse to higher, human authority.\nUS Predicts Killer Robots 40 Years Away, Raises Ethics Debate (by Haley A. Lovett, Finding Dulcinea)\nOther links:\nAre Strikes By Unmanned Aircraft Ethical? (The CQ Researcher Blog)\nDrones: America's New Air Force (CBS News)\nAir Force UAVs The Secret History (by Thomas Ehrhard, Mitchell Institute)\nAre Drones A Technological Tipping Point In Warfare? (by Walter Pincus, Washington Post)\nU.S. Strike Kills 4 Amid Pakistan Drone Debate (by Rasool Dawar, Associated Press)\nAir Force Plans for All-Drone Future (by David Axe, Wired)\nCombat Generation: Drone Operators Climb On Winds Of Change In The Air Force (by Greg Jaffe, Washington Post)\nPolice Employ Predator Drone Spy Planes On Home Front (by Brian Bennett, Los Angeles Times)\nShould women be barred from combat roles?\nIn 2011, a government commission recommended that the Defense Department rescind its policy that prevents women from being assigned to combat units below the brigade level.\nThat same year, several female airmen from the 389th Expeditionary Fighter Squadron and 455th Air Expeditionary Aircraft Maintenance Squadron at Bagram Airfield in Afghanistan were selected to fly the first all-female combat sortie from start to finish. The mission, which was put together in honor of Women’s History month, set off a debate about women in combat.\nIn January 2013, Defense Secretary Leon Panetta announced an end to the policy of banning women from combat, giving the services until 2016 to make the case that some positions should remain off-limits to women.\nPro:\nSupporters of lifting the ban for the Air Force point out that many female soldiers and Marines have already been fighting in Afghanistan in an unofficial capacity.\nThey also note that female pilots have been flying fighter planes since 1993, and that it is long past due to officially assign these pilots to combat missions.\nIf women qualify to join the military and perform the job the same as men, then there should be no distinction of what role they should serve in, supporters contend. They add that a woman is no more or less valuable than a man, in terms of the risk of being wounded or killed during wartime.\nWomen’s Groundbreaking Flight Sparks Debate (by Markeshia Ricks, Air Force Times)\nCon:\nOpponents say the physical and physiological differences that separate men from women still demand that the latter stay out of combat roles. They argue women would not have an equal opportunity to survive in combat situations, or to help fellow soldiers survive.\nAlso, to mix women and men in combat units could impact discipline and cohesion.\nFurthermore, women are more likely to lose duty time due to medical issues, including pregnancy, and this absence could prove disruptive in combat units where concentration and mutual trust are essential for survival, critics say.\nShould Women Be Allowed In Combat? (Upfront)\nOther links:\nWomen in Combat: Leon Panetta Removes Military Ban, Opening Front-Line Positions (by Lolita C. Baldor, Huffington Post)\nWomen in Combat: Issues for Congress (by David F. Burrelli, Congressional Research Service)\nPanel Says Rescind Policy On Women In Combat (by Lisa Daniel, American Forces Press Service)\nHistory of Women in Combat Still Being Written, Slowly (by John Cushman Jr., New York Times)\nFormer Directors:\nmore\nless\nMichael Wynne\nMichael W. Wynne served as secretary of the Air Force from November 2005 until he was forced to resign on June 5, 2008. He received a bachelor of science degree in general engineering from the U.S. Military Academy at West Point in 1966; a master’s degree in electrical engineering from the Air Force Institute of Technology, Wright-Patterson Air Force Base, Ohio, in 1970; and a master’s degree in business from the University of Colorado, Colorado Springs, in 1975.\nWynne served in the Air Force for seven years from 1966 to 1973, completing his career as a captain and assistant professor of astronautics at the U.S. Air Force Academy. From 1973 to 1975 he held the title of principal at Research Analysis and Development (RAD), Inc. In 1975 he joined General Dynamics, where he worked a total of 23 years in various senior positions with the Aircraft (F-16s) and Main Battle Tanks (M1A2) Divisions and served on the corporate staff prior to becoming the president of Space Systems, including launch vehicles (Atlas and Centaur), and a corporate vice president.\nIn 1994 he joined Lockheed Martin after selling General Dynamics’ Space Systems Division to then Martin Marietta (which merged with Lockheed). He integrated the division into the astronautics company and became general manager of the Space Launch Systems segment, combining the Titan with the Atlas launch vehicles. In 1997 he returned to General Dynamics to serve as senior vice president of international development and strategy until 1999.\nIn 2000 he became chairman and chief executive officer of the IXATA Group, which offers business-to-business e-commerce services for corporate travel and hospitality markets, and held an executive position with Extended Reach Logistics. He also was involved in venture capital as a member of the NextGenFund Executive Committee.\nIn 2001 he joined the Department of Defense and served in a key procurement role, first as principal deputy and then as acting Under Secretary of Defense for Acquisition, Technology and Logistics. In April 2005 President George W. Bush nominated Wynne to take over as Under Secretary of Defense for Acquisition, Technology and Logistics. But Sen. John McCain (R-Arizona) opposed Wynne’s confirmation because of the nominee’s support for the controversial Boeing lease deal (see Controversies). Thus, in June 2005, the President withdrew Wynne’s name as under secretary. Five months later, however, Wynne’s appointment as Secretary of the Air Force was confirmed by the Senate.\nFormer Chiefs of Staff, United States Air Force\nGeneral T. Michael Moseley\nGeneral T. Michael Moseley served as chief of staff of the U.S. Air Force from September 2005 until he was forced to resign on June 5, 2008. Moseley graduated from Texas A&M University with a bachelor’s and master’s degree in political science.\nHis career in the Air Force began in 1972 as a student pilot at Webb AFB, Texas. From 1973 to 1977, he served as a T-37 instructor pilot, spin flight test pilot, flight check pilot and standardization and evaluation flight examiner for the 3389th Flying Training Squadron, 78th Flying Training Wing at Webb AFB. From 1977 to 1979, he worked as an F-15 instructor pilot and flight lead and mission commander for the 7th Tactical Fighter Squadron at Holloman AFB, New Mexico.\nFrom 1979 to August 1983, Moseley was an F-15 weapons and tactics officer, instructor pilot, flight lead and mission commander, standardization and evaluation/ flight examiner for the 44th Tactical Fighter Squadron and 12th Tactical Fighter Squadron at Kadena Air Base in Japan. The following year he taught at the Air Command and Staff College at Maxwell AFB in Alabama.\nFrom 1984 to 1987, Moseley served in Washington D.C., as chief of the Tactical Fighter Branch, Tactical Forces Division, Directorate of Plans, and as deputy chief of staff for Plans and Operations at Headquarters U.S. Air Force. He then served as commander of the F-15 Division and instructor pilot for the Fighter Weapons Instructor Course at the U.S. Air Force Fighter Weapons School at Nellis AFB, Nevada, from 1987 to 1989. The next year he taught courses at the National War College at Fort Lesley J. McNair in Washington D.C. From 1990 to 1992, Moseley served as chief of staff of the Air Force chair and professor of Joint and Combined Warfare at the National War College.\nHe then served as commander of the 33rd Operations Group at Eglin AFB in Florida from 1992 to 1994. Moseley returned to Washington D.C. until 1996 as chief of the Air Force General Officer Matters Office. The following year he commanded the 57th Wing at Nellis AFB, and then served as Deputy Director for Politico-Military Affairs, Asia/Pacific and Middle East, Directorate for Strategic Plans and Policy, for the Joint Chiefs of Staff in Washington D.C. He remained in D.C. until 2001 as the director and legislative liaison for the Office of the Secretary of the Air Force.\nFrom 2001 to 2003, Moseley commanded the 9th Air Force and U.S. Central Command Air Forces at Shaw AFB, South Carolina. He then returned to Washington D.C., where he held the position of Vice Chief of Staff at Air Force headquarters until becoming Chief of Staff.\nDENNIS DARSNEY\n13 years ago\nto secetary of the air force on donley,michael about barment issue the congarsmen wilson the state south carolina looking why iam barment what what have done this action by general hyde the 86th air lift commander this order should resend cell number is 015238041649.\nRichard Matkevich\n14 years ago\nhello secretary of the usaf—mr. michael donley\ni’m writing this letter in the hopes of you helping the american nuclear test workers who were put at risk to serve the national security interests of the united states. at the present time there are several programs to aid the nuclear test workers in our country, the veterans administration (va), the energy employees occupational illness compensation program (eeoicp) and the radiation exposure compensation act (reca).the eeoicp covers ...\nFounded: 1947\nAnnual Budget: $110 billion\nEmployees: 553,107 (FY 2012)\nOfficial Website: http://www.af.mil/\nDepartment of the Air Force\nWilson, Heather\nSecretary\nHeather Wilson, a former Air Force officer who was once named one of the most corrupt members of Congress, was confirmed in a 76-22 Senate vote on May 8, 2017, as Secretary of the Air Force.\nWilson was born December 30, 1960, in Keene, New Hampshire. Her father, George, was a commercial pilot and her mother, Martha, was a nurse. Wilson’s grandfather was also an aviator, so it made sense for her to attend the U.S. Air Force Academy, where she was in the third class that included women. She earned a B.S. in 1982, but instead of going to flight school, Wilson accepted a Rhodes scholarship to study at Oxford University. She finished there in 1985 after having earned M.Phil. and D.Phil. degrees in international relations.\nShe remained in Great Britain, and was assigned by the Air Force to work on plans and host country negotiations. In 1987, she was moved to the U.S. mission to the North Atlantic Treaty Organization in Belgium.\nWilson left the Air Force in 1989 to take a staff job on the National Security Council (NSC) in the George H.W. Bush administration. She served as director for European defense policy and arms control. Wilson left the NSC in 1991 to become president of Keystone International, a consulting firm in Albuquerque whose clients have included the Department of Defense and Department of Energy. In 1996, she sold the firm to retired Air Force Colonel Gary Van Valin.\nIn 1991, Wilson married Jay Hone, an attorney and former Air Force officer who had been an instructor of Wilson’s at the Air Force Academy.\nIn 1995, Wilson was named secretary of New Mexico’s Children, Youth and Families Department. While there, she was involved in an incident that came back to bite her during her political career. She ordered that a file with information about Hone’s background as a foster parent be moved to another office. The file contained a 1993 Albuquerque police report naming Hone in a possible sexual touching case involving a youth whose legal interest Hone was handling. The touching was found to have been inadvertent. Wilson defended the movement of the file at the time, saying she didn’t want a file with personal information about her family available to department employees.\nThe movement of the file was raised during Wilson’s 1998 campaign for Congress. She won a special election to fill the seat representing Albuquerque that had been held by Steve Schiff when he died in office. Wilson also won the regular election that fall.\nWilson supported President George W. Bush’s 2003 invasion of Iraq because she believed that Saddam Hussein had weapons of mass destruction. When this turned out to be untrue, Wilson opposed having the House investigate why there had been such an important intelligence failure, stating that such an investigation “would do this country a terrible disservice.”\nWilson remained in Congress until 2009, but had a close call in her 2006 reelection bid, winning by only 875 votes out of 211,000 cast. That came after Wilson began to push for the firing of U.S. Attorney David Iglesias after she had called him to ask about an investigation into New Mexico Democratic officials. The following year, Wilson was named by Citizens for Responsibility and Ethics in Washington as one of the 22 most corrupt members of Congress.\nIn 2008, instead of running to retain her House seat, Wilson sought the Republican nomination for U.S. Senate, but she lost in the primary. She had barely moved out of her Congressional office when she formed a one-person consulting firm with a $10,000-a-month contract with a division of defense contractor Lockheed Martin, which managed Sandia National Laboratory.\nAlthough she was forbidden to directly lobby Congress, she directed Lockheed in its quest to have its management contract renewed without going through competitive bidding. Her deals with Lockheed and other nuclear contractors were later found to have violated government rules, but the hammer fell on the contractors, not Wilson. A report by the Energy Department inspector general said her invoices lacked “details as to the time expended and nature of the actual services.” She also worked for Los Alamos National Laboratory, Oak Ridge National Laboratory and Nevada National Security Site between 2009 and 2011. The labs eventually reimbursed the government $442,000 that they’d paid Wilson. Lockheed eventually lost the Sandia contract.\nFrom August 2010 until February 2011, Wilson served on the board of directors of Crossroads GPS, the Karl Rove-founded nonprofit campaign finance organization.\nWilson took another shot at the Senate in 2012, but lost in the general election to Martin Heinrich (D). During the campaign, she criticized a Senate bill aimed at cutting the bullying of LGBTQ children. While in the House, Wilson voted for a constitutional amendment that would have defined marriage as being between a man and a woman.\nIn 2013, Wilson was named president of the South Dakota School of Mines and Technology. She also sits on the board of defense contractor Raven Industries, which, among other products, provides radar technology to the U.S. Department of Defense and stratospheric balloons to NASA, and on the board of directors of Peabody Energy, the world’s largest coal company.\nWilson and Hone have three adult children. She is a licensed private pilot.\n-Steve Straehley\nTo Learn More:\nAir Force Secretary Nominee Helped a Major Defense Contractor Lobby for More Federal Funds (by Patrick Malone, Center for Public Integrity)\nFormer Congresswoman Sets Revolving Door Speed Record (by Noel Brinkerhoff, AllGov)\nDOE IG Flags $450K to Wilson’s Firm (by Darius Dixon, Politico)\nRove Testimony Contradicts Wilson’s (by John Bresnahan and Josh Gerstein, Politico)\nCREW Releases Third Annual Most Corrupt Members of Congress Report (Citizens for Responsibility and Ethics in Washington)\nTrump Picks Former Congresswoman and Air Force Veteran Heather Wilson as Air Force Secretary (by Dan Lamothe, Washington Post)\nThis is Heather Wilson: Her Private Life in the Private Sector (by Justin Horwath, Santa Fe Reporter)\nHeather Wilson 2011 Financial Disclosure Statement (United States Senate)\nLee James, Deborah\nPrevious Secretary\nPresident Barack Obama has nominated a security industry executive to be secretary of the Air Force. Deborah Lee James is president of the Technical and Engineering Sector at Science Applications International Corporation (SAIC), a major contractor with the federal government headquartered in McLean, Virginia. If confirmed by the Senate, James would succeed Michael Donley, who retired in June, and would become the second woman to hold the post. Although James has no actual military experience, she has spent many years living off defense contracts, and the administration is believed to hope that nominating a woman will help quiet some of the criticism over the Air Force’s dismal record at dealing with the epidemic of sexual assault within its ranks.\nBorn circa 1957, James earned a B.A. in Comparative Area Studies at Duke University in 1979 and an M.A. in International Affairs at Columbia University in 1981.\nShe began her career in national security as a professional staff member on the House Armed Services Committee from 1983 to 1993, specializing in military personnel and North Atlantic Treaty Organization (NATO) issues. She then moved over the to the executive branch, serving from May 1993 to April 1998 as assistant secretary of defense for Reserve Affairs at the Department of Defense, responsible for all matters pertaining to the National Guard and Reserve Forces.\nHeading to the private sector, James was vice president for International Operations and Marketing at United Technologies Corporation from April 1998 to May 2000.\nFrom May 2000 to December 2001, James was the executive vice president and chief operating officer at Business Executives for National Security (BENS), a conservative organization representing more than 350 corporations that lobbies for more spending on homeland and national security programs—which its members then profit from by obtaining government contracts. In fact, according to security industry expert Tim Shorrock, BENS “has been a driving force in the privatization of U.S. defense capabilities, including the outsourcing of the precious intelligence assets.”\nFrom January 2002 to 2013, James held four jobs at SAIC, starting with a mere one month as senior vice president and director for Homeland Security. After a two-year gap, James was senior vice president of the C4IT Business Unit from January 2004 to August 2010, executive vice president of Communications and Government Affairs from August 2010 to January 2013, and president of the Technical and Engineering Sector from January to July 2013.\nJames is active in several professional and charitable organizations, including the Tragedy Assistance Program for Survivors, Defense Department Advisory Committee on Women in the Services, and chairperson for the PenFed Foundation National Advisory Board.\n-Matt Bewig\nTo Learn More:\nObama to Nominate Deborah Lee James as Air Force Secretary (by Jeff Mason and Andrea Shalal-Esa, Reuters)\nObama Nominates Deborah Lee James As Air Force Secretary (by Josh Lederman, Huffington Post)\n- Latest News\n- D.C. Public Schools will Teach all Second-Graders to Ride a Bike\n- New Rule in Germany Limits Sales of Sex-Themed E-Books to 10pm to 6am\n- What Happened to the 6-Year-Old Tibetan Boy the Chinese Government Kidnapped 20 Years Ago?\n- U.S. Ambassador to Turkey Photoshops his Hair Color to Mock Turkish Mayor\n- Mystery Artist Calls Attention to Unfixed Potholes by Drawing Penises around Them",
  "word_count": 31449,
  "scraped_at": "2026-02-14T13:00:08.014872"
}