{
  "article_id": "fb383e2819e2",
  "url": "https://countercurrents.org/2024/03/uk-persecutes-bengali-australian-star-sam-kerr-ignores-uk-australian-ww2-bengali-holocaust/",
  "title": "UK Persecutes Bengali Australian Star Sam Kerr , Ignores united kingdom - Australian WW2 Bengal Holocaust",
  "date": "20240309T104500Z",
  "domain": "countercurrents.org",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "The story that has pushed the Australia-complicit US-Apartheid Israel-imposed Gaza Genocide off the front page of racist and mendacious White Western media is Bengali Australian football star Sam Kerr facing criminal trial in the UK for allegedly calling a UK policeman a “stupid white bastard”. Forgotten by generations of White Anglosphere journalist, politician and academic presstitutes is the UK- and Australia-imposed WW2 Bengali Holocaust in which 6-7 million Indians died.\nThe core ethos of Humanity is Kindness and Truth but in gross violation of both of these key moral imperatives the White Anglosphere Establishments and Establishment-serving Mainstream media are resolutely committed to lying by commission and lying by omission about Western-imposed genocidal atrocities, and hence are deeply complicit in such crimes. Silence is complicity.\nSummarized with documentation below are details of (a) the Sam Kerr non-story of alleged momentary verbal intemperance (allegedly saying “Stupid white bastard”) that is dominating the Anglo media, and (b) the forgotten WW2 Bengali Holocaust and other Western atrocities over the last 80 years (i.e. within living memory) that are variously minimized and excused by genocidally racist and egregiously lying White Anglosphere journalist, politician and academic presstitutes.\n(1). Sam Kerr – brilliant Bengali Australian footballer.\nAccording to Britannica: “Sam Kerr (born September 10, 1993, Fremantle, Western Australia) Australian football (soccer) player who was named captain of the Matildas, the women’s national team, in 2019. The star striker later became the all-time leading scorer for the team. Kerr was also a standout in professional clubs in the United States, England, and Australia… Kerr was born the youngest of four siblings in a family with a long tradition of athletics. Her father, Roger Kerr, was born in Kolkata to a featherweight boxer for Bengal and a mother who played basketball. After moving to Perth as a child, he played Australian rules football, a contact sport with similarities to rugby. He became a professional player with the West Australian Football League and the South Australian National Football League and later a coach in the WAFL. His eldest son, Daniel Kerr, Sam Kerr’s brother, also became a professional athlete, playing Australian rules football. Meanwhile, Sam Kerr’s mother, Roxanne Kerr, was the daughter and niece of players in the WAFL” [1]. Sam Kerr has become an Australian national icon (and an especial inspiration for girls) for her brilliant performances for the Australian Matilda’s and for Chelsea in the UK. Sadly she is presently recovering from a serious injury and will probably miss playing for Australia at the Paris Olympics.\nSubscribe to Our Newsletter\nGet the latest CounterCurrents updates delivered straight to your inbox.\n(2). Sam Kerr’s alleged offence – allegedly calling a UK policeman a “stupid white bastard”.\nI obviously don’t know what happened but Michael Bradley (in the commendable Alternative Australian medium Crikey): “Working backwards, it turned out, Sam had called a British copper a “stupid white bastard” (although some UK media has reported it as “stupid white PC”) after she’d had a drunken altercation with a taxi driver following her chundering [vomiting] in his cab…Still, there are serious questions here. Kerr is facing a criminal trial on charges that carry a maximum penalty of two years in jail. From what I can work out, the charge against her comes under section 4A of the UK Public Order Act, which makes it an offence when a person, with intent, uses threatening, abusive or insulting words or behaviour, causing another person harassment, alarm or distress” [2].\n(3). Persecution of Sam Kerr, the deadly torture of world hero Julian Assange, and British police-backed legal overkill – “British law is an ass” and indeed often a nasty ass at that.\nSam Kerr allegedly uttered 3 intemperate words in 2023, and in 2024 is facing criminal trial and a possible 2 year sentence in 2025 (“justice delayed is justice denied”) and all this over 3 alleged intemperate words. This brilliant sportswoman and Australian national hero is being threatened with 2 years in a British prison that would mean the end of her brilliant and inspiring football career. One is reminded of the British foundation of Australia as a penal colony in 1788 – children could be sentenced to death by “British justice” for stealing a handkerchief or food with this being “mercifully” judicially commuted to transportation as a convict to Australia [3]. However the imperialist English Establishment have always had an endless capacity to soften the awful or even eradicate it from general perception.\nIndeed English poet Alexander Pope (1688-1744) wrote a famous satirical poem “The Rape of the Lock” (apparently based on a true event in which an English aristocrat stole a lock of hair from the woman he desired) that commences: “What dire offence from am’rous causes springs, What mighty contests rise from trivial things” [4]. On a deadly serious level, my book “Jane Austen and the Black Hole of British History. Colonial rapacity, holocaust denial and the crisis in biological sustainability” [5] is concerned with exposing this English and more generally Anglosphere culture of US and US Alliance holocaust commission and holocaust denial that grossly violates the key ethos of Humanity, namely Kindness and Truth.\nDue to British “justice” Australian hero, world hero, prize-winning journalist and truth-teller Julian Assange was imprisoned in the Ecuadorean Embassy for 7 years to escape “British justice” and has been highly abusively imprisoned for a further 5 years in Belmarsh Prison in London by “British justice”. His crime? Telling the truth about US war crimes by legitimately violating the secret sanctum of the US war criminals. I have been researching and publishing about US and US Alliance war crimes for 2 decades and John Shipton (Julian Assange’s father) in trying to save his heroic son from the murderous and implacable Americans has been quoting my findings on the millions killed in these US and US Alliance atrocities, his comments being reported by Western media [7-15]. Successive cowardly and war crimes-complicit Australian Coalition and Labor Governments have refused to pick up the phone and order the rotten, human rights-abusing UK Government to free Julian Assange immediately and send him home to Australia, to his wife and 2 children, and to the embrace of millions of decent Australians.\n(4). Persecution of Bengali Australian Sam Kerr over 3 alleged intemperate words versus the British “forgetting” of the deliberately UK-imposed and Australia-complicit WW2 Bengali Holocaust that killed 6-7 million Indians.\nWhile brilliant Bengali Australian footballer and national hero Sam Kerr is being threatened over 3 alleged intemperate words, generations of cowardly and racist British and Anglosphere Mainstream journalist, politician, academic and commmentariat presstitutes have largely or completely ignored the UK-imposed and Australia-complicit WW2 Bengali Holocaust (WW2 Indian Holocaust, WW2 Bengal Famine) in which 6-7 million Indians perished in Bengal and the adjoining provinces of Odisha, Bihar and Assam in 1942-1945. In the Napoleonic Wars in Spain the British defeated the French by withdrawing across Spain and Portugal to British Navy-supplied Lisbon, burning the crops as they went – the French were defeated by lack of food. In Bengal the British under Churchill sustainably permitted a catastrophic man-made famine that ensured that if the Japanese invaded from Burma they would face a starving north east India [5, 16].\nIndian-hating, genocidal racist and imperialist Winston Churchill (our hero for opposing Nazi Germany), was a keen student of history, and knew exactly what he was doing. Before the war India depended upon importing about 3 million tons of rice and other grain to cover production deficits, but by 1942 it was actually exporting rice and other grain. Indeed in 1935 Churchill had made the following statement to the British House of Commons: “In the standard of life they have nothing to spare. The slightest fall from the present standard of life in India means slow starvation, and the actual squeezing out of life, not only of millions but of scores of millions of people, who have come into the world at your invitation and under the shield and protection of British power”. The British knew that decreased food availability per se or through price increases would doom millions to starvation. In a secret letter to Roosevelt on 29 April 1944, Churchill , in his only statement on the Bengal Famine that I have found): “We have the wheat in Australia but we lack the ships. I have resisted for some time the Viceroy’s request that I should ask you for your help, but I believe that, with this recent misfortune with the wheat harvest and in the light of Mountbatten’s representations, I am no longer justified in not asking for your help” [5]. Australia produced 24 million tons of grain during WW2 but exported only 9 million (to the UK, North Africa and the Middle East) with as little as 0.4 million tons reaching its starving ally India [5, 16-23]. What killed 6-7 million Indians was deliberate and sustained inaction by the British in 1942-1945 and a 4-fold increase in the price of rice for various reasons – those who could not pay starved and Calcutta (a major industrial centre for the Allied war effort) sucked food out of a starving, rice-producing countryside [5].\nThe WW2 Bengali Holocaust was actually the first WW2 atrocity to have been described as a holocaust (by N.G. Jog in his 1944 book “Churchill’s Blind-Spot: India” [24]). Eminent Oxford historian and expert on Winston Churchill, WW1, WW2, Jewish history and Zionism, the late Professor Sir Martin Gilbert, was one of very few historians to have actually mentioned the WW2 Bengal Famine, but he under-estimated the death toll of 7 million by a factor of about 10, excused deadly British inaction as due to the strategic priorities of a world war, and avoided any mention of the atrocity in his biographies of Churchill [25]. Just imagine a biography of Hitler that did not mention the WW2 Jewish Holocaust (5-6 million killed through violence and imposed deprivation) [26, 27]. Indeed Churchill, the perpetrator, made no mention of the atrocity in his 6-volume history “The Second World War” for which he was awarded the Nobel Prize for literature [5]. The atrocity also involved large-scale civilian and military sexual abuse of starving women and girls (e.g. via the British Military Labour Corps in Great Britain’s equivalent of the shocking “comfort women” abuses of Japanese Imperial Army) [5].\n(5). Huge Anglo over-reaction to Sam Kerr’s alleged 3 words and Yassmin Abdel-Magied’s 7 words but utterly depraved Western silence over the US Alliance-imposed Muslim Holocaust.\nAsinine “British justice” responded to Sam Kerr’s alleged 3 intemperate words by imposing a lengthy 2023-2025 legal process that technically could result in up to 2 years’ imprisonment and terminate her brilliant and globally-admired football career. On Australia’s war dead memorial Anzac Day (25 April) in 2017, non-European Muslim, feminist social advocate and humanitarian journalist Yassmin Abdel-Magied (who worked for the ABC, Australia’s equivalent of the UK BBC) posted on her Facebook page: “Lest we forget (Manus, Nauru, Syria, Palestine)”. Savaged by public outcry, Ms Abdel-Magied rapidly deleted the post and apologized. The ABC apologized and terminated Ms Abdel-Magied’s ABC program. Ms Abdel-Magied fled to London [28]. Her post was correct and her silencing by rabid jingoists is a stain on Australia and an attack on free speech in Australia. What the Yellow Press of racist White Australia didn’t do in its ferocious baying was to articulate the significance of these 7 words – Manus and Nauru were the locations in complicit foreign countries (Papua New Guinea and Nauru, respectively) of Australian concentration camps indefinitely and highly abusively imprisoning boat-borne refugees without charge or trial (that in Nauru still operates to Australia’s shame). Deaths from violence and deprivation total 1 million in the 2011 onwards Syrian Genocide and 2 million in the century-long Palestinian Genocide variously imposed by the US Alliance including genocidally racist, neo-Nazi Apartheid Israel [5, 16, 18-20].\nOf course US Alliance atrocities extend far beyond devastated Syria and devastated Palestine. Thus the US has invaded 52 countries since WW2 [16, 29, 30] and since the fall of Soviet Communism in 1990 found a new enemy for the benefit of the US Military Industrial Complex – the Muslim World. After the 9/11 atrocity on 11 September 2001 in which the Zionist-subverted US Government and Apartheid Israel were surely complicit, the mass murder of Muslims by the US Alliance reached horrific and genocidal levels. In 2015 it was estimated that 32 million Muslims had died from violence, 5 million, and imposed deprivation, 27 million, in 20 countries invaded by the US Alliance since the US Government’s 9/11 false flag atrocity that killed about 3,000 innocent Americans [31, 32]. I have been researching and writing about the human cost of wars and occupations for 30 years (for my huge books on the matter – 8 huge books including major revised editions – see [5, 16, 18-20]). I have been driven by the moral imperatives of Kindness and Truth, we are all created equal, love thy neighbour, and the key moral injunctions from the WW2 Jewish Holocaust (that decimated my wider family in Hungary) and indeed from all genocides and holocausts, namely “zero tolerance for lying”, “zero tolerance for racism”, “bear witness” and “never again to anyone”.\n5-6 million Jews were killed by violence and imposed deprivation in the WW2 Jewish Holocaust, but lest we forget the other millions killed by violence and imposed deprivation in other genocidal WW2 atrocities including the WW2 Polish Holocaust (6 million), WW2 Soviet Holocaust (27 million), WW2 European Holocaust (30 million Slavs, Jews and Roma killed), WW2 Chinese Holocaust (35-40 million killed thus under the Japanese, 1937-1945), and the WW2 Bengali Holocaust (WW2 Indian Holocaust, WW2 Bengal Famine; 6-7 million Indians deliberately starved to death in 1942-1945 for strategic reasons by the British with food-denying Australian complicity in Bengal, Bihar, Odisha and Assam) [5, 16].\nHistory ignored yields history repeated. Genocide ignored yields genocide repeated. Thus the US Alliance, including the UK and Australia, belongs to the all-European International Holocaust Remembrance Alliance (IHRA) that is anti-Jewish anti-Semitic and anti-Arab anti-Semitic (by falsely defaming anti-racist Jewish, Palestinian, Arab and Muslim critics of genocidally racist Apartheid Israel as “anti-Semitic) and holocaust denying (by ignoring all WW2 holocausts other than the WW2 Jewish Holocaust and indeed ignoring some 70 genocides and holocausts) [33-38] and has been condemned by over 40 anti-racist Jewish groups [38].\nThus, for example, on the occasion of the withdrawal of most US forces from Iraq in 2011 the ABC (Australia’s taxpayer-funded equivalent of the racist and endlessly lying UK BBC) reported: “The withdrawal ends a war that left tens of thousands of Iraqis and nearly 4,500 American soldiers dead, many more wounded and 1.75 million Iraqis displaced… At the height of the war, 170,000 American soldiers occupied more than 500 bases across the country. Now only two bases and 5,500 troops remain in the country” [39]. The 21st anniversary of the war criminal US, UK and Australian invasion of Iraq in 2003 will fall on about 20 March 2024. On this occasion mendacious and racist Western media will at best remember the Iraq War as a US policy “mistake” and largely ignore the carnage. From 1990 onwards Iraqi deaths from US-imposed violence and deprivation have totalled about 5.0 million [40, 41], similar to deaths in the WW2 Jewish Holocaust ( 5-6 million) [26, 27]. However it is estimated that 4.6 million Iraqis died from violence and deprivation under Sanctions and thence Occupation (1990-2011) with deaths under Sanctions alone (1990-2003) totalling 1.7 million [40, 41]. Indeed on May 12, 1996, Madeleine Albright (US UN Ambassador and later US Secretary of State) defended UN sanctions against Iraq on a “60 Minutes” segment in which anti-racist Jewish American journalist Lesley Stahl asked her “We have heard that half a million children have died. I mean, that’s more children than died in Hiroshima. And, you know, is the price worth it?” Madeleine Albright replied “We think the price is worth it” [6]. This was a singular instance in which the serial war criminal and genocidally racist US admitted to its genocidal carnage in the Middle East [41].\nIf these death toll figures for Iraq seem implausibly high, simply consider that the child-killing Americans are still killing Iraqis through violence, occupation and imposed deprivation, that the US (together with serial war criminal Australia, UK, Canada and neo-Nazi Germany) with ugly threats rejected Iraqi Government demands that they leave [42], and that in a detailed analysis Iraqi sociologists have estimated that “About 1 million Syrian children became orphans… The number of Iraqi orphans is estimated to be five million (5% of all orphans worldwide)” [43]. Assuming an average of 3 children per Iraqi family [44] this horrifying statistic implies 2 x 5 million/3 = 3.3 million dead Iraqi parents.\nWhile there has been huge Anglo over-reaction to Sam Kerr’s alleged 3 intemperate words and Yassmin Abdel-Magied’s 7 words, there has been utterly depraved and genocide-complicit Western silence over the US Alliance-imposed Muslim Holocaust. By way of summary here are deaths from violence and imposed deprivation in the following selected and pertinent US Alliance genocidal atrocities: 2001 onwards Afghan Genocide and Afghan Holocaust (7 million), 2003 onwards Iraqi Genocide and Iraqi Holocaust (3 million), 1990 onwards Iraqi Genocide and Iraqi Holocaust (5 million), 2011 Libyan Genocide (0.2 million), 2001 onwards Muslim Genocide and Muslim Holocaust (32 million), 1992 onwards Somali Genocide and Somali Holocaust (2 million), 1917 onwards Palestinian Genocide (2 million), 2011 onwards Syrian Genocide (1 million), and 1950 onwards US Asian wars (40 million) [5, 16, 18].\nFinal comments and conclusions.\nI am largely informed about the Sam Kerr furore via the Mainstream and other media (e.g. [2]). Obviously in general we should all use temperate language. Further we should avoid racially-specific pejorative assertions, but this is a grey area because specific nations and subgroups within them are committing atrocities. Thus Indigenous Palestinians are over 50% of the Subjects of the Apartheid Israeli entity that rules all of Palestine plus bits of its neighbours (but about three quarters of them cannot vote for the government ruling them i.e. they are subject to egregious Apartheid). In Israel proper (i.e. behind the pre-1967 borders), Indigenous Palestinian Israelis are 20% of the population and can vote for the government ruling them, albeit as Third Class citizens under 60 Nazi-style, race-based, discriminatory laws [46]. It is accordingly false and offensive to say, for example, that “Israelis have killed over 14,000 Palestinians in Gaza” – because of compulsory military service for most Jewish Israelis the Israelis doing the horrendous killing in Gaza are 99% Jewish Israelis, and one should therefore say instead that “Jewish Israelis have killed over 14,000 Palestinians in Gaza” [47].\nThe absurd singling out of global sporting super-star and Bengali Australian, Sam Kerr, for career-threatening “special treatment” by “British justice” over 3 alleged intemperate words should alert everyone around the world about the real and seriously consequential racism in Anglo societies. By way of example, Australia is a multicultural country – as of 2019 about 29% of Australians were born overseas with the major source countries being the UK, China, India and New Zealand. Indeed despite entrenched White Australian racism and the 1901-1974 White Australia Policy, today Australia is 76% White and 24% non-White. However 95% of senior executive positions in government, big business and universities are held by Whites and only 5% by non-Whites [48-50].\nIndeed “stupid white bastards” might be a quite mild descriptive for the racist White-dominated Anglosphere political duopolies – the US Democrat/Republican, UK Conservative/Labour and Australian Coalition/Labor duopolies – who have an appalling record of support for horrendous and genocidal post-WW2 US Alliance crimes outlined here, and for genocidally racist, neo-Nazi, Jewish-ruled Apartheid Israel and (a) its ongoing Occupation (millions of Indigenous Palestinians kidnapped for 56 years without human rights and now numbering 5.6 million), (b) its century-long Palestinian Genocide (90% of Palestine ethnically cleansed, 2 million dead from violence and imposed deprivation, and now 3 major Indigenous population expulsion atrocities in 1948, 1967 and in 2023-2024), and (c) its ongoing Gaza Genocide (most of Gaza reduced to rubble, over 14,000 children killed, over 100,000 Palestinians killed, missing or injured, and most Gazans facing starvation and death from disease and deprivation through lack of water, food, shelter, sanitation, medicine, and medical care [47]). Disclaimer: I was readily able to dissociate myself from and oppose the criminal complicity in US Alliance crimes of US lackey, Zionist-subverted and racist White Australia because my dear late wife of 52 years, Zareena née Lateef, was a Fiji-born Bengali and our children, like Sam Kerr, are Bengali Australians.\nReferences.\n[1].”Sam Kerr”, Britannica: https://www.britannica.com/biography/Sam-Kerr .\n[2]. Michael Bradley, “Kerr calling a cop a ‘white bastard’ isn’t reverse racism — precedent proves it”, Crikey, 7 March 2024: https://www.crikey.com.au/2024/03/07/sam-kerr-stupid-white-bastard-british-cop/?utm_campaign=crikeyworm&utm_medium=email&utm_source=newsletter .\n[3]. Robert Hughes, “The Fatal Shore”, Penguin, 2003.\n[4]. Pope’s “The Rape of the Lock”, Project Gutenberg: https://www.gutenberg.org/files/9800/9800-h/9800-h.htm .\n[5]. Gideon Polya, “Jane Austen and the Black Hole of British History. Colonial rapacity, holocaust denial and the crisis in biological sustainability”, 1998, 2008; 3rd edition, Korsgaard Publishing, 2022.\n[6]. “Assange dad slams US and Israel over war on Gaza”, The Australian,18 February 2024: https://www.theaustralian.com.au/subscribe/news/1/?sourceCode=TAWEB_WRE170_a_GGL&dest=https%3A%2F%2Fwww.theaustralian.com.au%2Fnation%2Fassange-dad-attacks-us-and-israel-for-stain-that-will-remain-through-history%2Fnews-story%2F74092902f575cf912d4723011f66cf05&memtype=anonymous&mode=premium&v21=HIGH-Segment-1-SCORE&V21spcbehaviour=append .\n[7].Andrew Buncombe, “Julian Assange’s father says ‘greatest fear is they will take him to the US and break him for revenge”, The Independent, 1 January 2021: https://www.independent.co.uk/news/world/americas/julian-assange-father-wikileaks-court-b1781104.html .\n[8]. Paul Gregoire, “”Until we win”: Assange’s father John Shipton on the home run tour for Julian”, Sydney Criminal Lawyers, 15 March 2021: https://www.sydneycriminallawyers.com.au/blog/until-we-win-assanges-father-john-shipton-on-the-home-run-tour-for-julian/ . mm\n[9]. Vadim Kamenka, “Entretien avec John Shipton, le père de Julian Assange : “La vie ne saurait permettre une telle sauvagerie”, L’Humanité, 4 January 2021: https://www.humanite.fr/monde/julian-assange/entretien-avec-john-shipton-le-pere-de-julian-assange-la-vie-ne-saurait .mmm\n[10]. Olivier Berruyer, “ « Julian Assange est victime de torture physique et morale » d’après son père”, Élucid, 16 November 2021: https://elucid.media/democratie/julian-assange-est-victime-de-torture-physique-et-morale-d-apres-son-pere/ .\n[11]. Anarchist Federation, “Assange’s Father John Shipton On The Home Run Tour For Julian”, 17 March 2021: https://www.anarchistfederation.net/assanges-father-john-shipton-on-the-home-run-tour-for-julian/ .\n[12]. Paul Gregoire, “Assange’s Father John Shipton On The Home Run Tour For Julian”, Popular Resistance, 17 March 2021: https://popularresistance.org/assanges-father-john-shipton-on-the-home-run-tour-for-julian/ .\n[13]. John Shipton, “International Human Rights Day: Bring Julian home: John Shipton”, YouTube, 13 December 2020: https://www.youtube.com/watch?v=cerK_BZJI80 .\n[14]. Gideon Polya, “Craven US lackey Australia betrays Australian & world hero Julian Assange & free journalism”, Countercurrents, 13 April 2019: https://countercurrents.org/2019/04/craven-us-lackey-australia-betrays-australian-world-hero-julian-assange-free-journalism .\n[15]. Gideon Polya, “Censorship Of Stan Grant, Indigenous Australians & Palestinians, Julian Assange & Truth Tellers”, Countercurrents, 25 May 2023: https://countercurrents.org/2023/05/censorship-of-stan-grant-indigenous-australians-palestinians-julian-assange-truth-tellers/ .\n[16]. Gideon Polya, “Body Count. Global avoidable mortality since 1950”, 2nd edition, Korsgaard Publishing, 2021.\n[17]. Gideon Polya, “Australia And Britain Killed 6-7 Million Indians In WW2 Bengal Famine”, Countercurrents, 29 September 2011: https://countercurrents.org/polya290911.htm .\n[18]. Gideon Polya, “Racist Mainstream Ignores “US-Imposed Post-9/11 Muslim Holocaust & Muslim Genocide”, Countercurrents, 17 July 2020: https://countercurrents.org/2020/07/racist-mainstream-ignores-us-imposed-post-9-11-muslim-holocaust-muslim-genocide/ .\n[19]. Gideon Polya, “”US-imposed Post-9/11 Muslim Holocaust & Muslim Genocide”, Korsgaard Publishing, 2020.\n[20]. Gideon Polya in Soren Korsgaard (editor), “The Most Dangerous Book Ever Published: Deadly Deception Exposed!”, Korsgaard Publishing, 2020.\n[21]. Gideon Polya, “Economist Mahima Khanna, Cambridge Stevenson PrizeAnd Dire Indian Poverty”, Countercurrents, 20 November, 2011: https://countercurrents.org/polya201111.htm .\n[22]. Gideon Polya, “Britain Robbed India Of $45 Trillion & Thence 1.8 Billion Indians Died From Deprivation”, Countercurrents, 18 December 2018: https://countercurrents.org/2018/12/britain-robbed-india-of-45-trillion-thence-1-8-billion-indians-died-from-deprivation/ .\n[23]. “Bengali Holocaust (WW2 Bengal Famine) writings of Gideon Polya”: https://sites.google.com/site/drgideonpolya/bengali-holocaust .\n[24]. N.G. Jog in his 1944 book “Churchill’s Blind-Spot: India”\n[25]. Gideon Polya, “UK Zionist Historian Sir Martin Gilbert (1936-2015) Variously Ignored Or Minimized WW2 Bengali Holocaust”, Countercurrents, 19 February 2015: https://countercurrents.org/polya190215.htm .\n[26]. Martin Gilbert, “Jewish History Atlas”, Weidenfeld and Nicolson, London, 1969.\n[27]. Martin Gilbert “Atlas of the Holocaust”, Michael Joseph, London, 1982.\n[28]. Gideon Polya, “Yassmin Abdel-Magied Censored On Anzac Day – Jingoists Trash Australian Free Speech”, Countercurrents, 28 April 2017: https://countercurrents.org/2017/04/yassmin-abdel-magied-censored-on-anzac-day-jingoists-trash-australian-free-speech/ .\n[29], “Stop state terrorism”: https://sites.google.com/site/stopstateterrorism/ .\n[30]. Gideon Polya, “The US Has Invaded 70 Nations Since 1776 – Make 4 July Independence From America Day”, Countercurrents, 5 July, 2013: http://www.countercurrents.org/polya050713.htm .\n[31]. Gideon Polya, “Paris Atrocity Context: 27 Million Muslim Avoidable Deaths From Imposed Deprivation In 20 Countries Violated By US Alliance Since 9-11”, Countercurrents, 22 November, 2015: http://www.countercurrents.org/polya221115.htm .\n[32]. “Experts: US did 9/11”: https://sites.google.com/site/expertsusdid911/home .\n[33]. Guy Rundle, “Melbourne Uni’s new anti-Semitism guidelines are an attack on free thought”, Crikey, 27 January 2023: https://www.crikey.com.au/2023/01/27/melbourne-university-anti-semitism-guidelines/ .\n[34]. Micaela Sahhar, Sahar Ghumkor, Jasmine Barzani, and Natale Ironfield, “The IHRA definition of anti-Semitism has no place on Australian campuses”, Al Jazeera, 6 December 2023: https://www.aljazeera.com/opinions/2023/12/6/the-ihra-definition-of-anti-semitism-has-no-place-on-australian-campuses .\n[35]. Gideon Polya, “Melbourne University Adopts Anti-Semitic & Holocaust-Ignoring IHRA Definition Of Anti-Semitism”, Countercurrents, 5 February 2023: https://countercurrents.org/2023/02/melbourne-university-adopts-anti-semitic-holocaust-ignoring-ihra-definition-of-anti-semitism/ .\n[36]. Gideon Polya, “Zionists & Pro-Zionist, US Lackey Australian Government Threaten Australian Academic Free Speech”, Countercurrents, 7 March 2023: https://countercurrents.org/2023/03/zionists-pro-zionist-us-lackey-australian-government-threaten-australian-academic-free-speech/ .\n[37]. Gideon Polya, “Melbourne University Backs Racist and Anti-Semitic IHRA”, Dissident Voice, 7 February 2023: https://dissidentvoice.org/2023/02/melbourne-university-backs-racist-and-anti-semitic-ihra/ .\n[38]. Jewish Voices for Peace, “First ever: 40+ Jewish groups worldwide oppose equating antisemitism with criticism of Israel”, 17 July 2018: https://jewishvoiceforpeace.org/first-ever-40-jewish-groups-worldwide-oppose-equating-antisemitism-with-criticism-of-israel/#english .\n[39]. Anne Barker, “US military marks end of its Iraq war”, ABC News, 16 December 2011: https://www.abc.net.au/news/2011-12-15/us-military-marks-end-of-its-war-in-iraq/3733982 .\n[40]. Gideon Polya, “Iraq Invasion 20th Anniversary: 5 Million Dead In Iraqi Holocaust”, Countercurrents, 19 March 2023: https://countercurrents.org/2023/03/iraq-invasion-20th-anniversary-5-million-dead-in-iraqi-holocaust/ .\n[41]. “Iraqi Holocaust Iraqi Genocide”: https://sites.google.com/site/iraqiholocaustiraqigenocide/ .\n[42]. Gideon Polya, “US, UK, Australia, Canada & Germany Reject Iraqi Parliament’s Quit Iraq Demand”, Countercurrents, 16 January 2020: https://countercurrents.org/2020/01/us-uk-australia-canada-germany-reject-iraqi-parliaments-quit-iraq-demand/ .\n[43]. Wahiba Abu-Ras, Anas Ashraf AbuLaban, Sabreen Talat AlQaisi, Mohammed T. H. AlQaisi, and Eliza Decker (sociologists), “Orphans in Syria and Iraq Juggling Balls: Wars, COVID-19, and the NGO’s financial crisis”, “International Journal of Qualitative Studies on Health and Well-being”, volume 18, 2023: https://www.ncbi.nlm.nih.gov/pmc/articles/PMC9904298/ .\n[44]. Riyadh Laft, Nesreen A Aflouk, Saba Dhiaa, Emily Lyles, and Gilbert Burnham (Al Mustansiriya University, Faculty of Medicine, Department of Community Medicine, Baghdad, Iraq), “Needs of Internally Displaced Women and Children in Baghdad, Karbala, and Kirkuk, Iraq”, PLOS, 10 June 2016: https://currents.plos.org/disasters/article/needs-of-internally-displaced-women-and-children-in-baghdad-karbala-and-kirkuk-iraq/ .\n[45]. “Report genocide”: https://sites.google.com/site/reportgenocide/ .\n[46]. Gideon Polya, “Australia must stop Zionist subversion and join the World in comprehensive Boycotts, Divestment and Sanctions (BDS) against Apartheid Israel and all its supporters”, Subversion of Australia, 15 April 2021: https://sites.google.com/site/subversionofaustralia/2021-04-15 .\n[47]. Gideon Polya , “20 Ways Anti-Semitic Australian Labor Government Complicit In Jewish Israeli Gaza Genocide”, Countercurrents, 5 March 2024: https://countercurrents.org/2024/03/20-ways-anti-semitic-australian-labor-government-complicit-in-jewish-israeli-gaza-genocide/ .\n[48]. Tim Soutphomassane, Greg Whitwell, Kate Jordan and Philipp Ivanov, “Leading for Change. A blueprint for cultural diversity and inclusive leadership revisited”, 2018.\n[49]. Gideon Polya, “Review: “Leading for Change” – corporate cultural diversity deficiency & Australian financial scandals”, Countercurrents, 3 May 2018: https://countercurrents.org/2018/05/review-leading-for-change-corporate-cultural-diversity-deficiency-australian-financial-scandals .\n[50]. Gideon Polya, “Scores Of Huge Realities Resolutely Ignored By Mendacious, US Lackey Mainstream Australia”, Countercurrents, 11 August 2020: https://countercurrents.org/2020/08/scores-of-huge-realities-resolutely-ignored-by-mendacious-us-lackey-mainstream-australia/ .\nDr Gideon Polya taught science students at La Trobe University, Melbourne, Australia over 4 decades. He published some 130 works in a 5 decade scientific career, notably a huge pharmacological reference text “Biochemical Targets of Plant Bioactive Compounds” (2003). He has also published “Body Count. Global avoidable mortality since 1950” (2007, 2021), “Jane Austen and the Black Hole of British History” (1998, 2008, 2022), “US-imposed Post-9-11 Muslim Holocaust & Muslim Genocide” (2020), and “Climate Crisis, Climate Genocide & Solutions” (2020), and contributed to Soren Korsgaard (editor) “The Most Dangerous Book Ever Published – Dangerous Deception Exposed!” (2020). For images of Gideon Polya’s huge paintings for the Planet, Peace, Mother and Child see: http://sites.google.com/site/artforpeaceplanetmotherchild/ .",
  "word_count": 4535,
  "scraped_at": "2026-02-14T12:17:17.357423"
}