{
  "article_id": "fb381e5e6f43",
  "url": "https://www.nwemail.co.uk/news/25733695.barrow-lioness-georgia-stanway-reacts-receiving-mbe/",
  "title": "Barrow Lioness Georgia Stanway reacts to receiving MBE",
  "date": "20260102T091500Z",
  "domain": "nwemail.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Barrow’s Georgia Stanway said being made a Member of the British Empire (MBE) is a 'real pinch me moment'.\nThe Bayern Munich and England footballer was recognised for her services to football in the New Year’s Honours list released on Monday.\nThe midfielder, who is now a double European champion after England’s win in the Women’s Euros in July, took to social media to express her thanks.\nIn a statement released on Instagram by CAA Base, a sports agency which represents footballers across the world, Stanway said: “Receiving an MBE is a real ‘pinch me’ moment, after all, I am just a girl from Barrow.\n“Football was all I ever wanted to do and so many people have made sacrifices along the way to help me get to this point on and off this pitch.\n“This honour, this recognition, is for all of them too.\n“For my family, particularly my parents, coaches, mentors, team-mates and everyone who has seen something in me.”\nAlongside Stanway, a host of other Lionesses were also named in the New Year’s Honours list.\nEngland’s captain Leah Williamson was made a Commander of the Order of the British Empire (CBE) while Alex Greenwood, Keira Walsh and Ella Toone were also made MBEs.\nThe England manager Sarina Wiegman was awarded an honorary damehood, telling the Press Association (PA) after the announcement that she ‘could never have imagined the respect and warmth I’ve experienced from the English people’.\nIn her statement on Instagram, Stanway also touched on what continues to drive her forward.\nShe said: “For as long as I play, and as long as I can make an impact after playing, I’ll continue to use my voice (and my feet!) to try to show girls and boys that anything is possible and that through sport you can make a positive difference.\n“I love my country and I’ll fly the flag wherever life takes me, to be awarded an MBE is such a huge honour so thank you and dream big.\"\nBefore Christmas, Stanway also received the Freedom of Barrow at the Town Hall.",
  "word_count": 346,
  "scraped_at": "2026-02-14T13:06:59.609017"
}