{
  "article_id": "fb7461c3e24b",
  "url": "https://www.rnz.co.nz/news/world/582905/idris-elba-former-all-blacks-coach-recognised-in-uk-honours-list",
  "title": "Idris Elba , former All Blacks coach recognised in united kingdom honours list",
  "date": "20251230T000000Z",
  "domain": "rnz.co.nz",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Actor Idris Elba, a former All Blacks coach and members of England's triumphant Women's Euro 2025 football team were among famous Britons recognised in the country's traditional New Year Honours on Monday.\nFormer All Blacks coach John Mitchell has been appointed an OBE for services to rugby after guiding England to the women's Rugby World Cup title this year. He coached the All Blacks between 2001 and 2003 and has been England women's coach since 2023.\nIce dancers Jayne Torvill and Christopher Dean, and players from England's victorious Women's Rugby World Cup-winning squad were also honoured, according to the list.\nElba, known for his roles in hit TV series The Wire and Luther, was knighted for services to young people, having founded an international charity that helps support disadvantaged youngsters.\n\"I hope we can do more to draw attention to the importance of sustained, practical support for young people and to the responsibility we all share to help them find an alternative to violence,\" said Elba, who becomes a sir.\nTorvill and Dean, who won Olympic gold at the 1984 Winter Games in Sarajevo and clinched multiple world and European titles, were knighted for their contribution to ice skating.\nThe pair said becoming a dame and a sir respectively was \"wonderful and humbling at the same time\".\nMore than 1,150 people received gongs in the latest list, which is decided by an honours committee.\nKing Charles III and other leading members of the royal family hand out the awards at ceremonies during the year.\nEngland's \"Lionesses\" featured heavily on the list after their Euros win in the summer, with captain Leah Williamson made a Commander of the Order of the British Empire (CBE).\nAlex Greenwood, Keira Walsh, Georgia Stanway and Ella Toone, who were all part of the side that beat Spain on penalties in the final in Basel, Switzerland, in July, each received the title of MBE.\nThe team's Dutch manager Sarina Wiegman, who has won the Euros twice with England and once with the Netherlands, was awarded an honorary damehood, the government said.\nElsewhere, Marlie Packer and Zoe Aldcroft of England's successful 2025 Women's Rugby World Cup squad become OBEs, with several MBEs going to their teammates.\n-AFP w/RNZ",
  "word_count": 371,
  "scraped_at": "2026-02-14T13:07:11.133963"
}