{
  "article_id": "fb8efd76a73c",
  "url": "https://www.the42.ie/amber-barrett-ireland-50th-cap-6666941-Apr2025/",
  "title": "  I want it to be said that Amber contributed with goals and moments  ",
  "date": "20250403T150000Z",
  "domain": "the42.ie",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "ALMOST NINE YEARS on from her first, Amber Barrett is in line for her 50th Ireland cap over the coming days.\nIf she features against Greece tomorrow or on Tuesday, the Dongeal striker will hit the half century of appearances for her country.\n“Honestly it would be something that I’ve had on my mind for the last couple of years as I’ve edged closer to it,” said Barrett earlier this week.\n“Of course I would be immensely proud, it’s definitely something that I hope happens. But again, I’ve been here a long time, in the sense that I’ve waited patiently. So I think when I get it, I’ll definitely have the feeling that it’s something earned and deserved. I hope it will come on Friday but we’ll be prepared for whenever it comes.”\nBarrett stands alone in Irish women’s football history as the goalscorer who sent them to their first-ever World Cup.\nThe Hero of Hampden will forever remember her 33rd Ireland cap, but insists she doesn’t want her career in green to be defined by it.\n“I said after the Scotland game that I didn’t want this to be the only thing people talked about. You might never qualify for a World Cup or Euros again, these are all possibilities. This is football. There is no guarantee. I want to give the best account of myself for as long as I can.”\n“You can’t take away how bloody brilliant it was,” she smiles, thinking back on her famous winner against Scotland. ”It was excellent.”\nThe ball from Denise O’Sullivan. The brilliant first touch on her left to send her through. Another off her right. The toe-poke home. The poignant celebration remembering those lost in the Creeslough tragedy.\nAll done after an unlikely nod from the bench amidst a challenging spell at Turbine Potsdam, during which she had most recently played as a right-back.\n“I still have no idea how I played in that game. It never looked like I was going to play. All these things went a certain way, it obviously paid off and it was great. You want to make a mark in so many ways. If we win this [Nations League] group I want it to be said that Amber contributed with goals and moments that get us over the line.\n“It doesn’t have to be: we have the Scotland win and that is great. Of course I am proud about it and I love hearing about it but I don’t want it to be the only thing. I have more to give. I heard Kyra (Carusa) now has 10 goals. I have seven. I want to get to double figures. I have all these ambitions. I just have to be in the mindset that the opportunities might not come every game, but when they do, you have to make them count.”\nNew manager Carla Ward handed Barrett a start in last month’s shocking 4-0 defeat to Slovenia, the scars of that humbling and Euro 2025 qualification failure still raw.\nThe Standard Liège star recalls “shellshock” but points to underperformance last time out, as Ireland look to return to winning ways against Greece in Crete tomorrow [KO 3pm Irish time, RTÉ Two].\n“In a way I always think that these things, as disheartening as they are, can be a good thing because you either have to say you are getting too comfortable in a situation and raise standards. You have to move on from it. You can’t keep reflecting on Slovenia but we do have to use that as the benchmark, we can’t let that happen again.\n“I think we have to look at ourselves now. What is now given to us and provided by the FAI and staff, it is miles ahead of what it was at the very very start when I came in [in 2016]. We can’t look outside the field and say, ‘Well, this wasn’t good enough,’ I think ultimately it has to come down to us. It’s very easy for people to point fingers at other people but you have to look at yourself first. I think that’s the only way we’re going to improve.\n“You have to move with the times. I am not sitting here thinking we are back on the ropes. It is easy to sit here and say we got beat 4-0 by Slovenia and this group can go straight down the gutter. It is how we respond. We have to take responsibility. We need to do a job to get us back competing for the number one spot in the group.”\nIreland trained at Theodoros Vardinogiannis Stadium, Crete, this morning. Heather Payne participated after a recent ankle injury, but the Everton wide player will not feature tomorrow as Ward’s Ireland look to bounce back in Group B2.\n“I don’t think anything but three points is good enough,” the head coach told RTÉ.\n- With reporting from Paul Fennessy",
  "word_count": 822,
  "scraped_at": "2026-02-14T13:32:30.027245"
}