{
  "article_id": "fb9e26927451",
  "url": "https://theathletic.com/4908903/2023/10/02/blackout-3pm-saturday-premier-league/",
  "title": "The Premier League Saturday 3pm blackout : united kingdom football invisible games",
  "date": "20231002T054500Z",
  "domain": "theathletic.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "When Manchester City, Arsenal, Manchester United and Newcastle United took to the pitch on Saturday, it was the first time in 18 years that the previous season’s top four teams had all played Premier League matches at 3pm on the same Saturday.\nThose teams’ games formed part of an unusual glut of six fixtures at that time, with just one Premier League fixture on Sunday (Sky, which shows Sunday matches in the UK, has not given a reason for this, but it is likely to have something to do with avoiding a clash with their Ryder Cup golf coverage). The thing is, though, unless you were one of the lucky ones with a ticket, if you live in the UK you could not watch any of those six Saturday matches live. Well not legally, anyway.\nAdvertisement\nThat is because there is a rule that states no football games can be broadcast live on UK television between 2.45pm and 5.15pm on a Saturday. That includes matches abroad, such as in Serie A or La Liga. Article 48 of UEFA’s rules allows its members to designate a two-and-a-half-hour weekend slot when live football is banned from screens. Since ITV struck a major television deal with the Football League in 1987, the English Football Association, in conjunction with broadcasters, chose to protect 3pm Saturday matches.\nGO DEEPER\nThe Briefing: Should Liverpool VAR calamity force change? Is Saka overworked? Where's 'Fortress Old Trafford'?\nThe thinking is that the blackout protects attendances lower down the pyramid. Without the rule, many supporters could stay at home to watch Premier League broadcasts rather than pay for a ticket to watch their local team.\nBut is that how it works in practice? And is it really a rule fit for the digital age?\nAt one point last year, the existence of the rule looked to be under threat, with the EFL forming plans to allow matches to be broadcast live at 3pm. That possibility has faded for now, after a broadcast deal struck with Sky made provision for matches at alternative times, though in July the FA said it was exploring the possibility of showing Women’s Super League matches live at that time.\nTo find out whether the rule serves its purpose — and to gauge what the football world thinks of it — The Athletic set reporters a task: find out how the 3pm blackout affects football and its fans.\nThe lower-league game\n“Slumming it today are you?” was the greeting from one Salford City fan who recognised The Athletic upon entering the Peninsula Stadium.\nIt’s the only direct comment we hear about those fans who might prefer the Premier League. A bout of dreary Manchester, sorry… Salford, weather surely meant any curious football fan who might have been tempted to visit their local EFL club stayed home on Saturday.\nAdvertisement\nSalford City’s match against Newport County was not one for casuals. If you were there, it’s because you really, really wanted to be, rather than due to a lack of an easy Premier League viewing option.\nSalford’s appeal is explained to us by Steve, a self-employed construction manager. Steve used to follow Stockport County where possible, but work commitments saw his engagement with the club drop. With Salford only a tram or bus ride away from Manchester’s city centre, affordable tickets — we purchased one in the West Stand terraces for £15 (about $18) — and a recent climb from the National League into the fourth-tier League Two, he chose to make “The Ammies” his new team.\n“I work eight days a week,” he jokes about a busy schedule that takes him around the country. “Most Saturdays I work in the morning and then try to make the effort to come here in the afternoon for a home game. That’s my time.”\nSteve hasn’t been able to watch Salford’s last five matches, but he’s excited about a few away trips he’s got planned. The Furness Railway in Barrow will be a meeting point for some of the Salford faithful on October 28.\n“It’s good here. Sometimes you get stag parties who come to watch a game before going into town to watch Manchester City or Manchester United if they’re on later.”\nIt’d be very reductive to claim Salford City attract more fans specifically because of Article 48. “You don’t just support a team. You belong to it” is a message written on the side of one of the stands at Moor Lane and the club prides itself on being an option for those who have grown weary of the fan experience when following a club in the gilded Premier League.\nThe loudest section of West Stand on Saturday sees a collection of teenage boys go through a hymn book of fan chants such as “SCFC, Red and White Army” and spend half-time talking about their plans for Wrexham away (October 14 ) rather than the goings on at Old Trafford or Molineux (where Manchester City were playing Wolves on Saturday). On more than one occasion, 10 boys break into a rendition of Dirty Old Town by The Pogues, which has become the club anthem.\nAdvertisement\nAfter five successive defeats in the league and a 4-0 drubbing from Burnley in the Carabao Cup, Salford rebooted their campaign with a 2-1 victory at Moor Lane on Saturday, (you can read the club’s match report here).\nAt full-time, screens showing Sky Sports News in the stadium’s “Bucks Bar” allowed Salford fans to catch up on Premier League results. That Salford City fans only briefly register the Manchester United 0-1 Crystal Palace scoreline, before quickly getting out their phones to check on their FPL teams or betting apps shows where the true focus is.\nTo those who attended Salford’s first home win of the season in League Two, the Premier League exists but it doesn’t matter nearly as much as the community on offer here.\nCarl Anka\nThe London pubs where fans gather to watch… illegally\nThe Search\nThe Oxford Arms, The Buck’s Head, The Black Heart, The Nag’s Ruin, The Duchess of Eagles, The Deaf Bluebird, The White Hart Attack, The Feral Cousin, The Hunter’s Earpiece, The Queen’s King’s Red Lion’s Oak Swan Crown. At some point, about three-quarters of an hour into this thing, levels of delirium increasing steadily, the names start to cross-pollinate.\nIt is 3.45pm on Saturday afternoon. I am walking the streets of Camden, north London. Is this something I would usually do? No, it is not, because I have taste and self-respect. (For the benefit of our international readers, a comprehensive list of all of the good things about Camden would run to precisely zero entries.) I am here in the name of journalism. In the danger zone. On the front line.\nCamden, a famously dissolute neighbourhood, is home to a lot of pubs, many of which show live football. The plan was to visit as many of them as possible, hoping to find one that flouted the blackout rule. I was hopeful, especially after hearing a promising rumour about one little place down a side street. But now, as half-time whistles blow around the nation, despair has set in. I have visited 15 pubs — 15! — and… absolutely nothing.\nAdvertisement\nI am, at this stage, quite tired and beginning to question my career choices. But wait! A message from my editor. There has been an anonymous tip about a pub 10 minutes away. He insists the intel is good. “Send the asset to Archway.”\nSuccess\nThe intel is good. You would not know it from the chalkboard outside — only the early and late kick-offs are advertised — but this blessed pub is showing one of the 3pm kick-offs.\nThe scene inside is, in truth, nothing to write home about. There is no secret doorway, no clandestine card game out back, no button on the bar that makes all of the TV screens flip around to become fish tanks. No, just a few old men chatting about the Ryder Cup, a couple at the bar slowly drinking their way towards horizontality, and eight or nine people watching Arsenal beat Bournemouth.\nThe television is tuned to Astro SuperSport 2. The aspect ratio is slightly off; the image does not reach the sides of the screen. The remote controls are sat on the edge of the pool table, ready to switch channels quickly if the landlord smells a rat. One of the patrons props his phone up against his pint of Guinness. He is streaming Wolves against Manchester City.\nAt 4.32pm, the television goes black. The landlord flicks between channels; the rest are working but the Arsenal feed has gone dead. This kind of thing usually elicits a groan, but everybody waits patiently as he returns to the main menu — he’s using an Amazon Fire Stick — and tries something else. When the images return, the aspect ratio is fixed but the commentary is in Arabic.\nArsenal run out 4-0 winners, which goes down well with those watching. After the final whistle, The Athletic speaks about the Saturday blackout with one patron who asks — more for a laugh than for his own protection — to be referred to as “John”.\n“It’s bullsh*t,” he says of the rule. “I’m paying for three TV subscriptions and I still can’t watch my team legally.”\nAdvertisement\nJohn is an Arsenal fan. He says he would happily pay for some kind of streaming season ticket. The blackout, he argues, is outdated. “Most Premier League games sell out well in advance,” he says. “When it’s a sellout, they should televise it. It’s not stopping people going to the matches.”\nThe Athletic has places to be, but not before making a quick pact with John. “Please don’t name the pub,” he says. “They’re good people.” For now, they’re also his best bet for watching his team play on Saturday afternoons.\nJack Lang\nThe LA bar where fans wake up early to watch… legally\nAt Joxer Daly’s Bar in Los Angeles, almost 9,000 miles from the Emirates Stadium as the crow flies, Arsenal fans filtered in before the 7am local time kick-off, replacing Aston Villa supporters who had set their alarms in preparation for the 6-1 thrashing of Brighton & Hove Albion.\nThose devoted west-coast fans committed to getting up and out for a 4:30am kick-off, but Saturday’s early kick-off is available across all 212 territories in which the Premier League is broadcast.\nThe 3pm games (10am ET, 7am PT) are subject to a uniform ‘blackout’ in the United Kingdom but every Premier League game is available to supporters in the United States via NBC, a television broadcast network, and Peacock, a digital subscription service.\nJoxer Daly’s is a soccer-specific bar catering to die-hard fans from the west coast of America by opening its doors in line with kick-off times in England. Despite complaints about the Peacock livestream that cut out several times, prompting a chant to the tune of “What do we think of Tottenham?” most supporters in attendance at the home of the West Side Gooners supporters’ group were in good spirits as they watched their side cruise to a 4-0 win over Bournemouth.\nPhillip West, an applied psychologist who had travelled around 20 miles from Pasadena, had heard of the 3pm blackout through Twitter, and as an American football fan, he sympathises with the English soccer fans who are frustrated they cannot watch every game on television, as the NFL once had similar restrictions.\n“Soccer has become more and more global; I mean, we’re right down the street from a Stan Kroenke-owned stadium,” says West, referencing the SoFi Stadium in Inglewood, home of NFL franchises LA Rams and LA Chargers. “For me to be able to watch this game, but someone who lives a lot closer to the stadium not to be able to watch it, seems totally unfair. If you were to take away Laker and Clipper basketball coverage from people in LA but allow fans halfway across the world to watch it, people would lose their minds.”\nAdvertisement\nFrom 1973 to 2014, the NFL maintained a blackout policy that stated a home game could not be televised in the team’s local market if 85 per cent of the tickets were not sold out 72 hours before kick-off. This policy has been suspended since 2015 and is up for review year-to-year. For West, who works in the healthcare field, the UK’s 3pm blackout shows a lack of consideration for people who struggle to attend events in public.\n“I’m a mental health professional, and there’s a lot of people I know that love sport and following their sports teams,” says West. “Being among those big crowds, even if they’re smaller crowds for smaller clubs, it’s an entirely anxiety-inducing thing. Taking that away from people to try to encourage them to attend in person? It’s just going to make them angry.”\nAs for the argument that lifting the blackout would affect attendance in lower divisions of English football, most fans The Athletic spoke to had little sympathy.\n“Even if you think about the Premier League, most teams that play at 3pm are probably not the biggest clubs,” says Ryan O’Malley, who has been an Arsenal supporter for six years after meeting his partner, Aya Kuratani, a longtime fan. “So, at the same time as not showing the lower leagues, they’re hurting the fanbases of the smaller clubs in the Premier League. It’s probably just promoting illegal streams.”\nElias Burke\nThe fan who will do anything to watch his team\nStephen Woodward* has not missed an Arsenal game for 10 years, despite the fact he only goes to around five or six home matches a season.\nHow does he do that? Illegal streaming plays a huge part. A viewing option that once meant endless searching for a working stream, followed by pop-up adverts, buffering and commentary in a different language, has evolved to the point that it is now comparable to the experience of watching via one of the main broadcasters.\nAdvertisement\n“It’s a lot easier than it used to be,” he says. “I’ve been doing it for 15 years and it used to be a real lottery to find a reliable stream with English commentary. I watched so many games with Arabic commentary. On Wednesday, I watched our Carabao Cup game against Brentford and it took less than a minute to find and the quality was really good throughout.”\nA survey by global research firm YouGov Sport last month found that 5.1million adults in England, Scotland and Wales watched a sporting event via an illegal streaming website, pirated app or modified set-top box in the first six months of 2023.\nThe media rights to live Premier League games are shared between Amazon Prime Video, Sky Sports and TNT Sports in the UK. A subscription to all three services costs fans more than £70 a month but that only gives fans access to 200 of the season’s 380 Premier League games, with the other fixtures reserved for the traditional Saturday afternoon slot.\n“Every time I watch one of these illegal streams I say to myself that Arsenal and the Premier League are missing out on revenue,” says Woodward. “I would happily pay more to watch it in high definition with proper production and commentary. I am breaking the law but there are hundreds of other countries around the world with this broadcast and yet we can’t see it.\n“I’d happily pay £10 as a one-off fee to watch a game properly, or £15-£20 for a monthly pass to watch the matches I can’t currently get via the broadcasters. I actually believe that the subscriptions I do have are good value and I get lots of entertainment from them. I wouldn’t want to steal from my club’s back pocket and I want to support the club I love financially, so I’d be happy to pay more if that was an option for these games.”\nOne limitation of illegal streaming is it takes away a degree of control. Woodward spent Saturday redecorating the house with his wife and ideally would have recorded Arsenal’s trip to Bournemouth and watched it later, but that was not an option. For someone with three children, needing to watch it live does not fit easily with a busy life. “The convenience of being able to record and pause live matches is one of the reasons I’m very happy to pay,” he says.\nWoodward is torn over whether lifting the blackout would change how he consumes football.\nAdvertisement\n“The goal of the blackout was to protect league attendances but I’m not sure those motivations still apply,” he says. “We’re so used to having everything available at all times. I don’t believe that a team being on TV would prevent a match-going fan from going. Going to the stadium is usually such a positive experience that I don’t base those decisions on whether it’s on TV or not. Having said that, would a change to the rule influence which games I tried to get a ticket for? It doesn’t at the moment but maybe if it was on TV I wouldn’t make so much effort to get to the match.”\nJohn Stanton\n*not his real name — we have chosen not to identify this person because he is discussing illegal activity.\nThe law-abiding fan who finds other ways to follow\nFor every fan standing on a rainy terrace in the fifth tier, or scouring around for a pub with a dodgy Amazon Fire Stick to get their 3pm fix, there are others who do not feel compelled to necessarily watch football — any football — on a Saturday afternoon. Take Arsenal supporter Conor O’Callaghan.\nWhen Arsenal are playing during the blackout, he is quite content to get on with his day while following updates either by listening to the radio, reading live blogs or by having Soccer Saturday on in the background.\nHe does not use illegal streams. It is not that he is afraid of getting a letter through the post. “I don’t think that would deter me,” he says.\nThis is not some principled stand against the abuse of the Premier League’s intellectual property either. “I don’t think that football always has fans’ best interest at heart anyway,” he adds.\nIt is a question of life getting in the way. A decade ago he might have had the time to sit around navigating a world of pop-up ads and VPNs but now, as a 37-year-old father, he has more important responsibilities.\nAdvertisement\n“If I wasn’t married or didn’t have a kid and I had more time on my hands, I probably would be looking for a stream on a Saturday, but I guess as you get older, you don’t have as much time as you used to do.”\nO’Callaghan adheres to the blackout, then, but he does not necessarily support it and finds the argument that it holds up lower league attendances hard to justify.\nGoing to games outside the top flight with friends in the past has not always proved cost-effective. “In the Premier League, they do the away ticket cap at £30. Pricing for games in the Championship is more expensive.”\nEven non-League football is not a huge saving, in his experience. O’Callaghan’s local team Maidenhead play in the National League. “I think a home adult match ticket is £18. That’s a lot.”\nSomething often missed on both sides of the argument is that, for O’Callaghan’s generation, watching your team play was still the exception rather than the norm.\nGrowing up, O’Callaghan’s parents always insisted a Sky subscription was too expensive. One of his neighbours would record Arsenal matches for him. “I would know the score but then I’d go up and get the video and watch it anyway.”\nBut when it came to following Arsenal live, he had little option to turn on the radio.\n“I’ve grown up listening to it,” he says. “That was my source of information when I started supporting Arsenal. People like Alan Green and Mike Ingham back in the day, I used to love listening to them.\n“That’s why I’m quite happy now,” he says. “I walk around the house and just have it on, playing through my phone. That’s pretty much what I was doing 20 years ago, just in my room, radio on.”\nWhen faced with either shelling out to watch a side you have little interest in or the hassle of searching for a reliable stream, why not simply follow the team you support through more legal, traditional and practically free methods? Especially if that is how you came to love the sport in the first place.\nMark Critchley\n(Top photos: Getty Images; design: Samuel Richardson)",
  "word_count": 3461,
  "scraped_at": "2026-02-14T12:07:18.322056"
}