{
  "article_id": "fbc559328e15",
  "url": "https://www.90min.com/your-guide-watching-womens-fa-cup-weekend",
  "title": "Your guide to watching the Women FA Cup this weekend",
  "date": "20250110T121500Z",
  "domain": "90min.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Your guide to watching the Women's FA Cup this weekend\n- The fourth round of the Adobe Women's FA Cup takes place this weekend\n- All 12 WSL teams will make their first entry into the competition\n- Manchester United were crowned winners last year at Wembley Stadium\nThe fourth round of the Adobe Women's FA Cup is set to take place over the weekend as teams from the Women's Super League (WSL) gear up to make their tournament debut.\nAll 12 WSL sides will now enter the field of play as 32 clubs prepare to face off for a place in the final 16 of the FA Cup. The teams that progress through to the fifth round will take home £54,000, with the grand prize for the victors of the competition amounting to £430,000.\nWith the fourth round of the competition set to take place over the coming weekend, 90min breaks down everything you need to know...\nWho won last year?\nManchester United took home the crown in 2024, after a 4-0 thrashing of Tottenham Hotspur was enough to reign them victorious under the arch of Wembley Stadium. The win marked United's first piece of silverware since the club's inception in 2018.\nArsenal have long been the historical giants of the FA Cup, winning the competition a total of 14 times. Despite the club's national dominance, the last time the Gunners bagged the silverware was nine years ago in the 2015/16 season when they defeated Chelsea 1-0.\nChelsea and Manchester City have shared the domestic glory ever since Arsenal's dominance began to dwindle. The Cityzens have taken home the gold in three seasons since, with Chelsea winning it on four occasions.\nFA Cup fixtures\nThe first matches of the upcoming fourth round will take place on Saturday January 11 between Brighton & Hove Albion and Durham, as well as Manchester United vs West Bromwich Albion. The rest of the fixtures will go ahead on Sunday January 12.\nUpcoming fourth round fixtures\nThe fourth round is set to host some thrilling fixtures.\nTwo London derbies in the west will see Fulham host Championship contenders London City Lionesses, and Chelsea face off with Charlton Athletic. Four top-flight sides will come up against each other, as Everton host Tottenham and West Ham United welcome Liverpool to their home.\nFamily relationships will be put to the test as Manchester United face West Bromwich Albion, as Evie Rabjohn's side comes up against her younger sister Olivia.\nIpswich Town will also be searching for a miracle against Man City, and Bristol City will need to arrive at their best if they are to see out Arsenal in north-London.\nThe full list of fixtures include...\nHow to watch\nThe FA have confirmed that eight of the 16 fixtures will be streamed live to watch across the FA Player and the competition's new YouTube channel.\nThe BBC have confirmed their broadcast pick for the round, with Fulham vs London City Lionesses set to kick-off at 12:00 on Sunday.",
  "word_count": 501,
  "scraped_at": "2026-02-14T12:23:16.768387"
}