{
  "article_id": "fbc995b04eec",
  "url": "https://www.yahoo.com/news/amendment-gender-defined-presidential-debate-100000355.html",
  "title": "The Amendment : How Gender Defined the Presidential Debate with Rebecca Traister",
  "date": "20240912T113000Z",
  "domain": "yahoo.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "The Amendment: How Gender Defined the Presidential Debate with Rebecca Traister\nErrin is joined by New York Magazine writer-at-large Rebecca Traister to unpack the high stakes debate between Vice President Kamala Harris and former President Donald Trump. From the opening handshake to the closing remarks to Taylor Swift’s post-debate endorsement, Errin and Rebecca dive into the biggest moments of the night, and examine how gender and race informed each one.\nListen or subscribe on Apple Podcasts | Spotify | Amazon Music | YouTube or wherever you get your podcasts.\nOn today’s episode\nOur host\nErrin Haines is The 19th’s editor-at-large and writer of The Amendment newsletter. An award-winning journalist with nearly two decades of experience, Errin was previously a national writer on race for the Associated Press. She’s also worked at the Los Angeles Times and the Washington Post.\nFollow Errin on Instagram @emarvelous and X @errinhaines.\nToday’s guest\nRebecca Traister is writer-at-large at New York Magazine, where she covers politics, media, and culture from a feminist perspective. Traister has written for The New Republic, Salon, The New York Times Magazine, The Nation, the Washington Post, Elle, and other publications. Winner of a 2018 National Magazine Award and 2016 Hillman Prize for Opinion and Analysis Journalism, Traister is the author of Good and Mad, a New York Times best seller and among the Washington Post and People’s ten best books of 2018; All the Single Ladies, a New York Times best seller and Notable Book of 2016; and Big Girls Don’t Cry, a Times notable book of 2010.\nFollow Rebecca on X @rtraister.\nEpisode transcript\nThe Amendment podcast transcripts are automatically generated by a third-party website and may contain typos or other errors. Please consider the official record for The Amendment podcast to be the audio publicly available wherever you listen to podcasts.\nErrin Haines:\nHey, y’all. Errin here. Okay, so last night’s debate was really…something? I bet you all were in your group chats talking about it. Where was I? Tell me what you were talking about. Anyway, I’m gonna be unpacking all of this with the Rebecca Traister, writer-at-large for New York Magazine, whose coverage of politics and sexism has been crucial reading for me over the years. So I’m super excited about that. But first, I wanna tell you about The State of Our Nation. What is that? It is our third annual poll from the 19th and SurveyMonkey, which we just published. It looks at the state of women, particularly women of color, LGBTQ+ people in America, and SurveyMonkey’s reach gives us insight into the opinions of more groups of people than many other polls. So we probed attitudes about the state of the country, reproductive care, gender affirming care, education and the state of democracy, as well as asking people about their opinions on Vice President Kamala Harris, former President Donald Trump and this year’s critical election. Just one crucial finding from the poll: Vice President Kamala Harris holds a three point lead over former President Trump, boosted by an even wider advantage with women. So you can read about our poll and what the results might mean for the election at 19thnews.org/poll2024. Okay, now let’s get to the show.\nErrin:\nHey, y’all, welcome to The Amendment, a weekly conversation about gender, politics and power from The 19th News and Wonder Media Network. I’m your host, Errin Haines. Last night, Vice President Kamala Harris faced off against former President Donald Trump in a high-stakes, much-anticipated debate on ABC. It was the first presidential debate between the candidates, but it was also the first time that these two had ever even met face-to-face, which I did not realize until Dana Bash pointed it out in the recent sit down interview with Vice President Harris. This debate, I have to say, I had a lot of feelings and thoughts going into it. I was not really sure how it was gonna go for either of the candidates. Rally knew that Vice President Harris had been preparing for this debate even as she was on the campaign trail. And also former President Trump, somebody that’s debated a lot, but really doesn’t do a lot of debate prep or traditional debate prep.\nErrin:\nSo I really wasn’t sure how this was gonna go. But I have to say that it was really, really interesting in a debate that I actually felt served voters in the way that it got into the issues, in the way that the moderators expertly fact checked a lot of what was said on the stage. It really felt like a productive and efficient 90 minutes. So, obviously, wanted to think about what this debate meant for the country, what it meant for voters, what it meant for what we learned about the candidates. And I really felt like Rebecca Traister was the person that I wanted most of all to unpack all of this with me, even before I knew one word of what either Vice President Harris or former President Trump were gonna say. So, Rebecca, writer-at-large for New York Magazine. She covers politics, media and culture from a feminist perspective. I am very happy to have you here today, and very curious to be unpacking this with you. Gimme your initial reaction. What was your takeaway by the end of that rollicking 90 minutes last night?\nRebecca Traister:\nWell, I have to tell you, like, this is very … this is just a, like my own personal journey. I was dreading last night so profoundly. I mean, this was not, like and I am a person who understands Donald Trump to be an unhinged and malevolent monster, right? Who is incapable of putting sentences together. And I understand Kamala Harris to be an incredibly eloquent, smart, prepared person. So, but, like, the terms of these things are always so unjust and so weighted. The standards are not just doubled. They’re like quintupled. His deficits are so baked into everybody’s analysis at this point that when I tell you I had a stomach ache, not just in the, like, hour leading up to it, but for days leading up to it. All I wanted to do was not to watch it. I wanted to hide in a closet and, like, eat burgers, okay?\nRebecca:\nLike that, by myself, quietly. And so that was my mindset going in. So I feel great. I feel great. It was such a profound relief. It is such a profound relief to me that it is over. And I was anticipating all kinds of ways that it would be traumatic, both in the way that it was received by the media, but also just, like, debates with Donald Trump are no joke. He is horrific. And I have burned in my brain lots of memories of the way that he, you know, loomed over Hillary Clinton in 2016 in ways that were really unsettling. Not like horror movie unsettling, not just, like, gross and awful. Um, and so, I had all that anticipation and so I’m relieved that it’s over. I think we will obviously get into this in detail. I think she did, um, stylistically everything, right?\nErrin:\nIt’s so interesting that you talk about how you felt going into this debate, because there definitely was a point at some point, you know, Tuesday afternoon where I’m thinking, “I have no idea how this is gonna go. And also how is this going to go badly?” Right? For either candidate. But yes, especially given that we have seen former President Trump on the debate stage so many times. We know what he does, especially when it comes to, um, you know, gendered attacks that he does, whether that’s against the candidate, whether that’s against one of the moderators, it’s just like, what is going to happen?\nErrin:\nWhat could he do? What could we see, you know, by way of misogyny and or racism on the stage tonight? Like, that was definitely a thing that I went into this thinking about. And I also, frankly, you know, for the gender of it all, was thinking about how her performance would be reviewed regardless of how she performed, right?\nErrin:\nI mean, because this is a woman —despite what, you know, former President Trump has said on Truth Social — who is smart, who is competent, who, you know, definitely has had this kind of prosecutorial style that is intimidated some White men in the past who have had to, you know, share a stage with her. So, you know, I’m thinking, what if she comes across as smug, or what if she comes across as arrogant? How is that gonna play with voters? How is that gonna play with the press? Like, that was definitely a thing that was on my mind going into yesterday. And then, you know, we get through those 90 minutes, and it was, I think I really was just struck by, again, how she was able to show herself as presidential in yet another kind of major milestone in this election. So she’s introducing herself even further to the American people while at the same time we’re reminded of who former President Trump is and has been.\nRebecca:\nI mean, the thing that she did — and I think this comes from the prosecutorial practice she’s had, and I think also her debate prep — I mean, she did this thing, which was bait him in every answer. And it was remarkable to watch. She got him to be the worst version of himself, right? The best thing … Donald Trump could exceed every expectation by stringing together a couple of rational sentences. It doesn’t matter if he’s talking to, like, some Nobel Prize winner on the other side. Like, if he manages to put together a couple of cogent sentences and remain, like, hinged for 30 seconds, then he, like, he gets a big prize, right? Yeah. It’s part of the unjust landscape we enter on. But she ensured that that wasn’t gonna happen by dangling in front of him, like, the pieces of meat that he cannot resist snapping at, right?\nRebecca:\nCrowd sizes, mocking him, telling him people are laughing at him. All that stuff that he just can’t … he works himself into a frenzy. And then he is talking about, by the way, and I hate, like … I understand why people on the internet are participating in the humor around the pet-eating stuff. And, like, it’s hard. It’s like, I understand that, and humor is a way of expressing anger and frustration. And there were the, like, funny memes and alf, you know, the alien, eating a cat sandwich. Like, but the horrifying racism and xenophobia.\nErrin:\nYeah.\nRebecca:\nOf this line of attack, of horrible racist mythmaking that he’s doing about Springfield, Ohio, and immigrants eating people’s house pets is, like, so abhorrent to me. But she got him to do it, right? Like to reveal himself and to just spiral in front of a national audience while she remained collected. And there was so much facial performance happening. It was a really masterful, masterful sort of communicative strategy that she employed very successfully.\nErrin:\nYeah, I mean, look: I think for both of them, “Let Trump be Trump” was the strategy. But I don’t think … it meant two very different things, right? For both of these candidates, right? And you saw that. Look, for me, like I said, thinking all the things that I thought, you know, going into last night, within the first 30 seconds I already knew how this was gonna go. They hit the stage — by the way, just a reminder they’ve never met before.\nErrin:\nThe way that she strides onto stage, immediately walks up to him. He had no intention of greeting her, right? She’s determined to greet him. She leans in, even as he’s obviously trying to avoid this exchange, right? Extends her hand. They shake hands and she clearly and correctly pronounces her name for him. As if to say, “You no longer have an excuse to ever mispronounce my name again.”\nErrin:\nOkay, now let’s begin. Now, of course, he never … he ends up never referring to her by name for the entirety of this debate. Doesn’t refer to her by first name, last name, doesn’t even call her Madam Vice president, right? Even as she’s destroying him. And yet effectively and respectfully referring to him as, you know, “the former president.” Once again, he cannot help. I mean, the impulse control completely evaporated, like, within the first half an hour, I would think. I mean, he seemed to be, you know, kind of, you know, very demure, very calm. But no, by the 30-minute mark that was over. He definitely could not resist taking the bait on crowd sizes, which, by the way, I mean that trolling started at the beginning of the day with an ad that she released, right? In Palm Beach and on Fox News with the Obama speech about crowd sizes, right? So that trolling happens hours before.\nRebecca:\nRight, right. With the joke making clear that the crowd size obsession is about dick size, right?\nErrin:\nLet’s be clear. For people who were still trying to figure out what that is a couple weeks after the convention: Yes, that is what that was about. Yeah, I mean, so, instead of a moment where he could have, you know, actually gone after her on immigration — an issue which has been thorny for her as vice president, right? — Instead, what we have is him defending the crowd sizes, criticizing her crowd sizes again, conspiracy theorizing about whether her crowds are even real and then going into this other conspiracy theory about Haitian immigrants in Springfield. Like, I mean, yes, it was definitely letting Trump be Trump. And so I think even as she kind of was fighting to have those mics unmuted, she lost that battle, obviously, but still manages to let the showing and telling happen both on her end and to get him to show and tell who he is.\nRebecca:\nYeah. So, I wanna go back to that handshake for a second because it was one of the things I had thought before the debate started. I figured he was gonna be scared of her. Right? And so much of this, like, he is already through his elocution. It’s, like, he has no filter, right?\nRebecca:\nWhich frankly, I think is one of the things people like about him, right? Is that he is unfiltered and just says what comes into his mind. But in the weeks that he’s been running against Kamala Harris, you can tell, like, his obsession with how beautiful she is, right? Which he talks about all the time in this weird, like, “Oh, she’s a very good looking woman.” Like, he can’t help himself. He just can’t, you know, and he has obviously done the same thing around other women, from different angles, and talked about how unattractive he found Hillary Clinton and how, you know, all the women who have accused him of assault are, you know, “twos” or whatever he said about ’em, right? He cannot disentangle his sexual and aesthetic appraisals of women in any context from his professional and political approach to them, right? No,\nErrin:\nNo! It’s like…presidential campaign as Miss Universe pageant or something.\nRebecca:\nExactly, yeah. Exactly. It’s just how he sees women, right? Yes. And he just makes it clear that that’s the first thing, is that his aesthetic scale of how he’s rating people is up there.\nErrin:\nWell that, but also, I mean, but look at how else he was talking about her. I mean, over these past what, 50ish days, he’s called her weak, he’s called her dumb. He said she can’t put two sentences together, right? You know, he’s already doing the things that he does, especially around gender. At least he said Hillary Clinton was smart when they were having their debates. But for her, it was definitely about just disrespecting, demeaning, trying to diminish, you know, pointing out how short she is, you know, saying “we can’t have boxes or lifts on stage”. It’s like, but then somehow by the end of the night, he comes across as the one looking smaller, even though he’s literally a foot taller than her.\nRebecca:\nNo, and I think it’s interesting because of the ways that, like, I think in very, like, a woman who he says he finds unattractive, he can acknowledge aa smart. Like these are very old school mashups of like … but the most threatening thing for somebody like Donald Trump, with his very open views around gender and women rated on aesthetic versus, sort of, intellectual, scales … like the most threatening thing would be a woman that he found to be attractive who was also very smart and smarter than him, right? Which, like, this is, for him, his nightmare. So her first approach to him ,I kept thinking in advance of the debate, like, I wish she could do the Rick Lazio move. This is a deep cut, but like…\nErrin:\nYeah, it is.\nRebecca:\nSorry! But it’s something I thought about with Trump in the past, because in the senate race in 2000 in New York, Hillary Clinton was debating her opponent, Rick Lazio, and he approached her authoritatively at the podium, got in her physical space and that’s the kind of thing that Trump did in 2016, you know. Made himself imposing. And I was like, “Gosh, if the Vice President can get into his space, even though I knew they weren’t allowed to leave the podiums, and she took that chance the very first moment that she had it.” And I thought that was amazing. And also, he’s germaphobic, right?\nErrin:\nYes.\nRebecca:\nHe’s famously germaphobic. So she made him do something that we know he’s physically uncomfortable doing, even as it is a real part of being a politician, honestly. So, yes, destabilizing him from that moment. It is interesting: I would say her first answer was the part of the debate that was scariest for me, because I didn’t … I thought she was nervous at the beginning, and I did not think that her first answer on…\nErrin:\nThe economy.\nRebecca:\nRebecca:\nThe four years, “would you say people are better off four years from now?” I didn’t. And I, like, plunged from this moment of thinking like, wow, she, she sort of initially with that, with that approach and introduction and the saying of her own name out loud, put ’em on the ropes, and then there was this moment of fear, and then she really hit her stride after that.\nErrin:\nYou know, it’s funny, because going into this, I actually thought that there might be a shaky start for her. As she was kind of getting her legs under her, settling into the podium. And then I think that we saw pretty quickly, I mean, within 15 minutes we’re into, you know, the topic of abortion, which obviously we knew was gonna be a huge topic for the night. And so, I wanna talk about both of the candidate’s responses because I felt like, you know, I definitely felt like that was one of Harris’ strongest moments. But Trump, I think maybe he thought that this was a strong moment for him, but he’s repeating this claim that everybody wanted Roe overturned. Like that is the start of his answer on abortion. And there were many things that I wanna talk about on this, but specifically, like, it just seems that he is still kind of meandering for an answer on where he is on abortion, but also the doubling down on the late-term abortions.\nErrin:\nLike, knowing that that is not a real thing, despite the fact-checking in real time from Linsey Davis, who I thought did an excellent job…\nRebecca::\nMore in Politics\nYeah.\nErrin:\n…Kind of bringing that back into focus for the American people ,who are watching and tuning in and maybe are just now starting to become aware of this election and kind of some of the issues that are involved here. But like, he’s repeating this as a thing that is true when we know that factually that is not true. And then also just continuing to say that he was just doing what the American people wanted. When, you know, we have polling that suggests quite the opposite.\nRebecca:\nSo I wanna talk about this focus on late term abortion. And where I think, I mean, and this is sort of giving him a lot of credit when it comes to content. I know the reason he’s doing that, right? And, by the way, he was doing it, he’s been doing it for years. He was doing it in 2016 in the debates then too. It’s because in this period after the overturn of Roe, when things that certain people knew for a long time — which was that abortion is actually one of the most popular issues that Democrats have had to run on for a long time. But the Democratic party itself didn’t treat it that way.\nErrin:\nMm-Hmm.\nRebecca:\nAnd used, sort of, euphemistic, distant language about choice and wouldn’t actually engage with abortion and the right to reproductive healthcare access as a moral imperative.\nRebecca:\nAnd I wanna say that last night, the word that will just ring in my ears in terms of what the Vice President said, was calling the attack on abortion rights “immoral.” I mean, to tie abortion to morality, which of course, to my mind is correct and righteous, and how the Democratic party should have been talking about this for the past 50 years, but just didn’t. She has been the leading voice on abortion and talking about it in these new ways — these new muscular, morally-centered ways. Abortion as a fundamental core tied to all this stuff: love, family, freedom. These things the anti-abortion Right sort of grabbed all that language in the wake of Roe in 1973, and Democrats permitted them to have it for far too long. And it’s only, it’s really tragic, that it’s only in the wake of Roe’s overturn that Democrats have finally begun to deploy that language that they could have been deploying for decades, and perhaps doing a better job of preserving and increasing the protections that Roe offered, right?\nRebecca:\nBecause Roe should never have been the ceiling. It should always have been the floor. I’m a person who wishes that we could go beyond restore Roe right now — and I think there is actually a lot of room for the American public — but I also am just grateful for even a politician who can say that, because that was one of the worst points of the Biden debate on June 27th, is that he could not even sort of manage to say, “We need to restore Roe again.” I don’t think that’s enough. But like, I would’ve been grateful for him to be able to get those words out. And she did more than get the words out. She offered a robust, heartfelt, beautifully argued moral framework for, and offered very human examples of the suffering, and then tied it to him and his Supreme Court, his justices, who did this. And I thought it was effective. Just, communicatively, really a beautiful set of answers that she gave there.\nErrin:\nYeah. I mean, I think definitely putting kind of a human face with some of the examples that she gave and saying, you know, “Women don’t want this, and you are the one that is making them have to endure, kind, of these rare, really horrific scenarios” that felt, um, really pretty powerful to me. Because again, a lot of people tuning into this election maybe didn’t understand or didn’t realize, you know, Roe falls under President Joe Biden, they’re thinking, “Oh, well, maybe he had something to do with this.” For people who still don’t realize how we kind of got to that moment, how we got to the Dobbs decision. Like she, squarely, laying this at his feet, again, in this debate stage, setting like that felt like a real moment.\nErrin:\nAnd then also, I mean — so many unprecedented moments already — but like, you literally have to have a moderator say, “There is no state in which it is legal to kill a baby after it is born” because he’s continuing to repeat this. Like, that felt very important. And it also felt very different just in terms of what we as viewers should expect from a debate, right? Like, “Actually, we’re going to talk about issues. Actually, if you sit up here and tell lies, we are going to … it will not just be on the candidate to interject.” But, you know, you were seeing the moderators setting a tone pretty early, you know, that that was not something that was gonna be allowed to fly. And on this issue in particular, that they started kind of setting the tone that way, that felt important to me. I wanna talk a little bit more about the moderators. I mean, I feel like Linsey Davis and David Muir did take a very different approach than in the previous CNN debate — and frankly, in a lot of the debates that we have seen in the last couple of cycles. What do you think about their approach? Was it effective?\nRebecca:\nSo I think it’s a really low bar, actually. And I think that they cleared it. But, I wanna say, I was actually having this conversation in a number of my group chats, and there was a range of responses. I felt deeply appreciative of the fact-checking and the sort of steadiness of it. There was a tone that they struck with him that was not critical, but was, like, patient and controlled. It was, like, almost parental. Now, the Vice president was doing A similar tone with a different position contextually. But I thought that was very effective, and I was so grateful for the fact-checking — just the barest fact-checking, —which just hadn’t happened in other debates. And it’s a real, REAL problem when it doesn’t happen. So in some ways, I wanna say that the correction, I don’t wanna over lionize the fact that they just did the bare minimum, which was to say, “Look, that’s not true. And here, there’s no state in the union where this is legal.” I really appreciated that. And I also liked the steadiness of their tone. There’s a way in which debate moderators can be like, “Okay, well, you may say that…” And they’re sort of almost rising with his hysteria, you know?\nErrin:\nThey could have gotten sucked into it too.\nRebecca:\nSo I really appreciated all that. I had friends — and it’s interesting, it kind of broke down on racial lines —\nErrin:\nMm-Hmm\nRebecca:\n…who were livid about the fact that they gave him so much more time to talk than her. Did you feel that? Did you hear that?\nErrin:\nI mean, I definitely heard that. So what I got from people was that the moderator started off strong, but in the end they just…he kind of wore them down. And, you know, so then they kind of keep letting him rebut. And when she attempted to rebut, she was shut down. And so they were concerned that maybe the moderators doing that would maybe give either the viewers or Trump the impression that she could be run over. And so that was what they did not like about the dynamic, because it’s like, yes, even as they were fact checking, it felt like they also were refereeing in his favor because he kept getting to respond to her in a way that she didn’t.\nRebecca:\nAnd he’s so belligerent and insistent on continuing, and they would just give in. Meanwhile, she didn’t get a chance to rebut on several issues that she wanted to. And because she was behaving more professionally and more like an adult, she was somehow penalized in terms of time. And I also think there’s this different — so how you come into how you see this — if you’re somebody who thinks Donald Trump hangs himself every time he speaks, then maybe it’s like, “Well, they gave him more time, but he showed his ass.” You know?\nErrin:\nRight.\nRebecca:\nBut actually, that has real implications in a world where the White guys have always had, like, acres of speaking to time and centrality of their own voice, while everybody who is not a White guy gets pushed to the margins offered less time, less space and less power.\nErrin:\nYeah, yeah. Yeah. I mean, like, by the end, it felt like he was being rewarded for bad behavior.\nRebecca:\nYes.\nErrin:\nAnd then also, I mean, I have to say — and I have not gone back to look at this — but I would be very curious to do it. In terms of the moderators, like, I feel like the White guy also got more time than the Black woman. I would need to go back and look…\nRebecca:\nI have to go, I would go and…\nErrin:\nThe exchanges between Trump and Muir, like, I felt like there was a lot more of that, and possibly, but just because Trump, you know, kept on just kind of coming back around. Maybe that, maybe that was, was part of why. But that also kind of stuck. That was something that I thought about kind of later — not just that Harris got less time, but really, you know, how much time was Lindsay really getting.\nRebecca:\nWell, I do think, and I’d have to go back and watch it again to say for sure, but my sense — based on my memory of how I watched last night — is that Trump was only speaking to Muir.\nErrin:\nCorrect. He was ignoring both of the Black women on stage and talking to the only other White man on stage, pretty much for the entire time.\nErrin:\nI wanna get into a few more key moments from the debate. A moment that I definitely was struck by, and I was wondering if this was gonna come up — it came up towards the end of the debate — the topic of the peaceful transfer of power, when President Trump was literally asked about his continued denial of the 2020 election results. And for his actions on January 6th. Again, he’s talking about the 2020 election results as being wrong. You know, he’s still claiming that he won that election, doubling down on those false claims, refusing to take responsibility for the violent mob at the capitol, really kind of justifying the actions of some of the folks that were at the Capitol. And then, you have Vice President Harris, who is saying that Trump was fired by 81 million people. So again, kind of baiting him and saying that clearly he’s having a hard time processing that. What was your reaction to that jab from her and what really kind of struck you about this section of the debate?\nRebecca:\nI wanna unpack a couple of things about those answers, because first, let’s talk about her response on January 6th, which I thought was so powerful in a way that ties to some of the ways we’re talking about with regard to what she said about abortion. So one of the things that I thought was powerful about how she responded on January 6th was to say, “I was there that day, I was in the Capitol.”\nErrin:\nLet’s talk about that because, okay, I don’t think … when I heard that, I was like, “Wait, was I aware that she was at the Capitol on January 6th?” Logically, that makes sense, but I’m thinking, “Have I ever heard her talk about that? Has she ever actually said that out loud that ‘I too, was at the capitol on the day of the insurrection?’” Like I don’t think that I had ever thought about that before that moment. And also, I had thought just recently about the idea of the peaceful transfer of power and realizing, “Wait, Kamala Harris is not only the democratic nominee for president, but she is also the person that will be presiding over the Senate when it is time for the peaceful transfer of power next year.”\nRebecca:\nSo yes, going back to her, having brought this into sort of an embodied form, right? So I think, of this, it’s different because she’s talking about a different person, but when she sort of said the thing about “there’s a woman on an airplane who has to travel to another state and get on a plane by herself with money she doesn’t have because of you,” okay? She’s evoking a figure, right? A specific person who is suffering, imperiled, because of his actions. And then you take this to a very different — but related — realm, which is “that mob you incited, that you urged forward. I was in the place that they were pouring into with their weapons. And I was there. And I experienced having that insurrectionist mob flood into the Capitol while I was in the Capitol, and they were coming to get us,” right?\nRebecca:\nLike, so she, again, makes a direct human line. Look, these things that you’re doing, and that I think you think of as — I mean, again, this is me adding words here — but there is a way in which so much of what Trump does is performance. And he is a television star, and he is a reality star, and he is Mr. Truth Social or Twitter or whatever platform he does to posture. And what she’s doing is bringing it down to the ground and being like, “Look, there are people who are experiencing the repercussions of these choices that you’re making for likes or for ratings or for crowd size or whatever. And you know what? Like, here are the people who have suffered because of it.” And I thought, and there are a lot of ways to do that because there are so many millions who have suffered in so many ways because of the choices that Donald Trump has made, and the decisions that he’s made as president and continues to make.\nErrin:\nThat’s so interesting. It’s honestly a much starker example of the moment that she had in 2020 with Joe Biden. “That little girl was me.” “That was me at the insurrection who you endangered with your actions at that rally.”\nRebecca:\nSo stick with that, because here’s the thing I’m gonna say that’s really, that’s like definitely not fun to talk about, but you talking about her being at the Capitol and, you know, in an imagined future, should she win the presidency and being the person to certify the election of results. And we know the level of violence that was directed at Mike freaking Pence, right? Okay. Who could not have been a more adoring, supportive Vice President. And I was thinking about that because there was, there was a, I experienced some anxiety last night at the very best parts of what I think she did communicatively, because like you and I think a lot about gender and power and race and violence and retribution and how angry it makes a system to be challenged. And so there are things that I reflexively, like simultaneously wanna get up and cheer and also like that make me scared. Um, laughing at him is beautiful. It’s precisely what he deserves.\nErrin:\nBut what are the consequences for that?\nRebecca:\nWhat are the consequences, right? I really wanna be clear that I’m not saying it was a mistake. It was, she is – what I’m saying is that I want it to be clear that what this individual is doing, and I have actually a lot of content quibbles with Kamala Harris and I have… If we were to talk about the meat of a lot of the different issues she talked about around immigration, around like the sort of lionizing of her Republican support, we could hash that out all day. I am not saying this in a way that is meant to lionize or make her into a special perfect hero. But I wanna talk about the kind of risks this woman is taking on behalf of this country right now, because they are incredibly intense. And to do that, to talk to him like he is a child, which is appropriate and brilliant and correct, to tell him, “I think you’re having problems processing.” Like she was like one tick away from saying you’re having big feelings and maybe you need to take a time out. To say to him, “world leaders are laughing at you and you were fired by 81 million people.” Right? These are, these were the best moments of that debate. But it is impossible for me to hear them without also understanding how violently, angrily White patriarchy responds to being challenged and especially to being mocked.\nErrin:\nYeah. And on a public national – global arguably – stage, right? I mean, and we know what the consequences of something like that can be. We know that for, you know, after Barack Obama’s election. We know that obviously with January 6th. Look at all the Black people that shouldn’t have been voting. There were consequences for that. I mean, that literally, by the way, is how we get to January 6th. People who should not have been challenging his authority – in his mind – who did that and who needed to be put back in their place. Moderators also pushed Trump again bringing up his accusation that Harris turned Black. I don’t know. I mean, I was wondering if this question was gonna come up with the debate. I didn’t feel like it was particularly useful for this question to come up. I mean, we kind of knew where he was gonna go. It wasn’t like he was gonna say, “oh, I’m sorry about that.” You know, “I didn’t mean to say that. I shouldn’t have said… like, no, I shouldn’t have said,” or any kind of anything resembling an apology on this was not going to happen. So I’m just like, okay. Kind of what was the point of having this question again.\nRebecca:\nThe thing that I don’t like about it, I mean that I think that there’s an argument that like, it’s useful to hear this articulated again. Like they knew that he would repeat it on some level, and he should. I just don’t, the notion that we’re asking Trump to weigh in on anyone’s race. I’m sorry, like, why? I don’t like it just sort of in its own way. I understand that it’s probably meant to put on display who this man is. We know who he is. And the idea that we’re still turning to him for some evaluation of identity or is like, actually like repulsive to me and, and a replication of everything. Why the hell does Donald Trump, why does whiteness itself get to define non whiteness? Right?\nErrin:\nWho asked for this, who asked for this at the end of the day? That’s kind of where I was with it.\nRebecca:\nYou know, nobody’s sitting there asking Harris, what do you think of his whiteness? That would never occur to anybody. So it reinforces the dynamic where her race, her heritage, her identity as a Black woman and as an Indian American woman, and as a woman is somehow like on a buffet table that Donald Trump is in charge of. I just don’t like, that’s the thing that upset me about that question being asked. I do understand that it was probably intended to be revealing of his attitudes, but we know his attitudes.\nRebecca:\nWhy is this woman, the Vice President of the United States, have to stand up there and have the moderators in this man weigh in on her racial identity? Are you kidding? That is a reinforcement of this country’s entire history of incredibly it’s twisted relationship to race itself and, you know, race as a construct and as something that can be defined by White people.\nErrin:\nYeah. And look, I didn’t really see the kind of value in the question being asked in the first place, but then even her having to respond to it in any way, also, I just was just like, no. Like, ask him if you want, if you insist, but you don’t need to ask her anything. And obviously she’s already shown you that she’s not really interested. There’s not gonna be a new answer from either one of them on this. So what are we doing? So why are we here? Right? Let’s move on. I wanna talk about gender, it really informed so much of what we saw on stage. I saw you quote tweeted, Frank Luntz, a Trump Republican, who was commenting on Harris’ facial expressions. I was also getting into those facial expressions. What struck you about his tweet? Why did you respond the way that you did?\nRebecca:\nOh It was just such horseshit. So, you know, it’s not my style, I did quote tweet Frank Luntz, who – let me see if I can get the actual thing he tweeted out, because it’s just such familiar, “oh my God, I have been here 7,000 times.” Ugh. Frank Luntz says, “if she wants to win, Harris needs to train her face not to respond. It feeds into a female stereotype, and more importantly, risks offending undecided voters.” So her face feeds into a female… Like, let’s take this apart for just one second ’cause I really did think about it last night as I read this.\nErrin:\nDiagram this tweet\nRebecca:\nHer face feeds into a female stereotype, which is fascinating. ’cause I don’t know Frank Luntz knows this or not, she’s a woman, okay? And more importantly, that face risks offending undecided viewers.\nErrin:\nThis is what I was talking about going into this right debate. I was like, who is going to say, oh, she’s coming across as smug. She’s coming across as arrogant. She’s coming across as condescending. Why i is she mocking the former president when his comments were ridiculous? She is reacting again. The mics are muted. So the facial expressions actually, were doing a lot of work there.\nRebecca:\nAnd by the way, I thought they were brilliant because – so here’s the thing. Historically in popular discourse, this is in politics, it’s in culture, it’s in art, right? The normative human being in western culture has been presented as a White man. A straight White man. And that’s the figure, the imaginative figure, whether we’re talking about presidents, whether we’re talking about heroes in movies or whatever, who’s been presented to us as fully human. By which I mean, not just heroic, but capable of complex emotions, right? Also capable of villainy, of sadness, of grief, of jealousy, like all the whole range of human emotions. And we are very used to understanding the full range of human emotions as experienced by White men. So that if you take it to the realm of politics, we have White men who can be like authoritative and inspiring, and we have White men who can be despotic and villainous, and we have White men who can cry, like John Boehner used to cry all the time, right?\nRebecca:\nAnd we have White men who can cry and yell like (Justice) Kavanaugh and Lindsey Graham, and we can understand their passion as being born of commitment or whatever. Okay? Everybody who’s not in that category that we have, actually, it’s not even a matter of do we make them heroes or villains. We actually make them both. But what we do is understand ’em to be human beings capable of a range of emotion and evaluative thought. We do not offer that imaginative reach to people who are not White men. And so, the ways that this comes out, we want women, we want Black women, we want people of color to exist as sort of offshoots capable of like one function in relationship to the full humanity that is that embodied by White men, right?\nErrin:\nThe idea that she was just kind of supposed to be there kind of stoic and un reacting, gave me kind of flashbacks to Justice Ketanji Brown Jackson’s hearing, for example, where she was expected not to react as the most ridiculous things were being thrown at her during that hearing. But that is the expectation, particularly of Black women, that they are supposed to be, you know, it is disrespectful for them to be anything other than poised and non-reactive in these extraordinary kind of moments.\nRebecca:\nAnd to go back further, Christine Blasey Ford, Anita Hill, the ways that in order for us to even hear their voices, to take them seriously, that they had to speak at a level voice to not betray any emotion. Even when they’re testifying about things. And these are great examples. The Ketanji Brown Jackson example is very useful because here are moments where women’s voices, from one angle or another, in challenge to a patriarchal system, a White patriarchal system. How have we even been encouraged to listen to them, to begin to take them seriously – not take them seriously enough to act on them in the cases of Christine Blasey Ford and Anita Hill – but they had to betray no range of humanity, to just be level scientific cold, to not be angry, to not be upset. Meanwhile, you know, Brett Kavanaugh’s crying about how he likes beer, and Lindsey Graham…\nErrin:\nAnd angry.\nRebecca:\nAnd Clarence Thomas during his hearing saying that, claiming this is a high tech lynching.\nRebecca:\nSo the men who who were permitted. And not only permitted and encouraged, but we could understand their emotion as natural passion and response. They’re reacting to a situation in ways that are varied, but the women could not react. So one of the great challenges of integrating, normalizing, like creating more diverse public and political professional spaces is beginning to become comfortable with the full humanity of people who are not White men.\nRebecca:\nI mean and you know, I speak, this isn’t video, it’s audio, but like, I’m gesturing wildly. I’m yelling. I do this all the time. Like my tone of voice is extremely uncontrolled. And boy do I hear all the time, no matter what I said, I hear versions of this all the time. “Um, what you said was really smart, but you sound hysterical saying it.” And so nobody will listen to you. Right? I get that every time I go in a public space. And sadly, I’ve never had the time to sit around and modulate my voice.\nErrin:\nSo many love letters about how I comport myself and or my appearance. Thank you everyone. Let’s get, I wanna talk about the closing remarks too. The final messages that both of the candidates ended on. For me, I felt like, again, Vice President Harris speaking directly to the American people, talking about what she wanted to do for them. So much of his remarks, to me, felt like they were just focused on her. And I wonder kind of what your takeaway was from the closing and just kind of how that further encapsulated who these two are as candidates, who they might be as president.\nRebecca:\nSo it’s interesting because for me, the closing remark was where she was at her most controlled. But the part that actually for me felt like her closing remark came earlier, which I feel, I may be taking away from the specificity of the question you’re asking, but when I think about her closing remark, the thing I’m left with, her closing remark was when she said, “I am not Joe Biden, and I’m not Donald Trump. I represent…” And I don’t have her exact words in front of me.\nErrin:\nI represent a new generation of leadership.\nRebecca:\nA new generation. That to me is the closing argument on Kamala Harris.\nErrin:\nI agree with you. I felt like that was powerful. Because there were a couple of points where he tried to say, she is Biden. And she’s like, no, I’m not Biden and I’m not you either. I’m somebody else that’s offering a new vision for this country.\nRebecca:\nAnd I think that was the message I sort of, I don’t know if she would have done that in her closing remarks, had it not come up in questioning earlier. But to me, that’s the closing. I think that is the most powerful argument she has for the American people.\nErrin:\nEspecially as there is a question about whether she could be position herself as a candidate of change. I mean, you’re literally the incumbent Vice President. So how are you different from the administration that you are have currently been representing, saying, I am representing this new generation of leadership that is carrying our country and our politics forward.\nOkay. Debate wraps. I think it’s pretty clear that the consensus is that Vice President Harris won. When I saw former President Trump kind of in the spin room wandering around, which I mean, I didn’t think that was a particularly great sign. The principal is rarely in the spin room. Kamala Harris had gone to like a watch party to energize people and remind people to keep working to make sure she gets elected. So I don’t know. I’m wondering, obviously I don’t think that this was really a debate for either one of their supporters, but I do think, to the extent that we do still have kind of these undecided voters out here, you’ve got people that are gonna start voting as soon as this month. Do you think the debate mattered? And for whom?\nRebecca:\nI don’t know. I don’t know. I was a person who in 2016 always felt I was covering Hillary Clinton’s campaign very closely. I felt the whole time that Donald Trump was likely to win for a lot of reasons. Through the entire time when many of my colleagues were saying, “oh, he is never gonna win. He’s never gonna be president.” Now there was all this consensus from people in the top of the political establishment that Clinton was the establishment. Of course she’d win and this guy was never gonna be able to win. And I never felt that way. But I will say that there were a couple moments when I felt like a degree of something like hope or optimism that she might win. And for me, I was thinking about this a lot last night,I have watched a lot of presidential debates in my lifetime, including debates where the clearly better candidate, like Barack Obama really had a bad night.\nRebecca:\nAnd you could say, that he had a 2012 debate against Mitt Romney where he did badly and lost the debate. Right? I had seen a lot of debates in my life where even the candidate I vastly preferred didn’t perform as well as I would’ve liked. And when I watched the three 2016 debates between Trump and Clinton, I actually felt like there’s no way that anybody, like she wiped the floor with him three times in a row. She still lost the presidency. And I have to keep that in mind when I think about, I do think that that debate last night, stylistically and communicatively was one of the best debate performances I’ve seen by any politician in my lifetime. There’s no question that she wiped the floor with him. Of course she won. And I think that and I did hear it also from Republicans. I mean, Lindsey Graham was being critical of it last night, Eric Erickson, people were admitting even on the Right that this was a terrible debate performance. But I think that extrapolating from that about what that’s gonna mean in terms of votes is very hard to do.\nErrin:\nI agree with you. I mean, debates don’t win elections, right? Debates obviously are very consequential. We do not get to the moment that we are in in this election without the debate of June 27th. We do not get there without that. So I think I’m with you. I think I tend to feel like, again, this was another milestone, another mile marker in this unprecedented election. It is among the things that she had to do on her way to victory, if in fact, that is going to be the outcome. And the reality is, at the end of those 90 minutes, we are still in a very close election that is going to be decided by several thousand votes in a handful of battleground states. Like, that’s still where we are, even after everything that we saw last night. The debate does not seismically change that.\nRebecca:\nAnd I think that a choice that was made last night that I don’t think it was the wrong choice, and I’m not, you have in a debate circumstance, you have a lot of people who lean Right who are also watching. Unlike maybe Republicans aren’t watching your Democratic (National) Convention, but a lot of them are probably watching the debate. So the degree to which she was reaching toward the center and talking to Republicans was very clear. That was her mentioning the late great John McCain and talking up the endorsement of Dick Cheney and Liz Cheney. I mean, as far as character witnesses, like Victor Orbán wasn’t the only one that I was giving a little bit side eye here, and I think that that makes sense strategically. But when you’re talking about also looking for every number everywhere, there were also things that in going for the Center last night, there’s a way in which she’s also alienating some of the young people and people on the Left, and they have votes, they vote too.\nRebecca:\nI understand strategically, especially in the context of a debate where you’re gonna have a lot of audience members on the right listening to you, why you take this expansive view of, look I welcome – and she was very firm about it in a lot of our answers. I think you could hear her emphasizing that I’m gonna be the president for all Americans. When I was a prosecutor, I didn’t ask what party affiliation you were, I was just working for you, all that stuff. But I do think that there is a strategic question that the Vice President is gonna have to face because she is getting a lot of pressure from the left and from young people, especially people who are really driven in their horror at the United States’ policy with regard to Israel and what is happening in Gaza. And that’s a huge population of people including like kids who are in schools in really, really tight swing states. Like there are a lot of young people.\nErrin:\nHeaded back to college campuses right now.\nRebecca:\nThere are a lot of young people that I think also are gonna matter to the outcome of this election. She got a lot of power from them in the first few weeks of the campaign. A lot of power from them, because they really were very excited about having somebody who was different from Joe Biden. And part of the project of also bringing in people from the center on the right has meant alienating some of those young people. And so when you’re talking about who’s gonna win and who’s getting off the couch and who’s gonna vote, and where are you focusing your resources, it’s a balance. And I think that that’s something that also plays in my mind when I think about the impact of a nightlight last night.\nErrin:\nWell, look, Taylor Swift apparently saw what she needed to see in that debate. Shortly after leaving the stage, you have her endorsing Vice President Harris, signing her endorsement post this “childless cat lady.” Take that J.D. Vance. Like, what do you think the significance of this endorsement is? I think for me, I’m thinking not just about Swifties, but I’m thinking about their parents. I’m thinking about, I guess this, the “Taylorverse,” for lack of a better word. You know, is this also Travis Kelce? Does this also mean that we have your proxy?\nRebecca:\nOh boy would that be useful. I don’t know. I think actually sort of in the spirit of some of the organizing we’ve seen, like where it went from “win with Black women,” whose weekly call was the night that Biden stepped down. And within a week of that you had “White dudes for Harris,” which by the way, welcome White dudes. Like, this is actually, we need that in there. And so does that apply to bringing in the Kelce universe and the football.\nErrin:\nKansas City Chiefs? Are you now on board?\nRebecca:\nRight. I mean, these are, these are real questions because so much of this labor has been left for a long time to Black women and only recently has sort of been taken up with this level of vigor by White women. And now this is actually, I think the first iteration where I’ve really seen White men doing some of that lifting or participating in it. And I think we need to get there. So what kind of impact does Taylor Swift have? I think she has a big impact, and I’m not somebody who runs around getting super excited about celebrity endorsements, but people have learned to organize. Something that the organizer recently said to me is that young people have learned to organize around culture and pop culture, like Swift fans have learned to organize, it’s how to fight back against Ticketmaster.\nRebecca:\nThis is incredible. Like the coalition building and organizing muscles extend well beyond politics. And we’re in an era of American history in which a lot of different groups and a lot of different people who’ve previously not engaged in this kind of coalition building or movement politics are doing it. And so I actually think bringing in Swifties and there was already a Swifties… Jotaka Eaddy actually told me for the story that I reported for New York this week about the Swifties for Harris call of 34,000 people a couple weeks ago. That’s 34,000 people on a call, it’s a lot of people. Anyway, so I think it’s terrific. I do think, yes, to boost the fact that her post talked not only about the fact that she was gonna vote for Kamala Harris, but that she was telling people, you gotta register. Because a lot of young people do not know that they have to register.\nErrin:\nShe had it in her IG stories, like she’s sending people to resources so that they can get involved in this election.\nRebecca:\nYeah. This is so useful. And it is a version of on the ground that is what like people in suburbs and cities and that’s what they’re doing when they’re calling and doing voter registration tables and going door to door and saying, are you registered? Have you checked? Do you have a voting plan that Taylor Swift can do that at the scale that she can is massively important. And so I think that’s great.\nErrin:\nSorry, I was just imagining Taylor Swift door knocking with her cat in my neighborhood. I was like, what would I do if that actually happened? No. So last question I gotta ask you to make a prediction. Do you think we see these two on a debate stage again before the election?\nRebecca:\nYes, actually, maybe I do. I’m not much on predictions, but I think it’s hard for him to resist a lot of bait, including the bait of being told that he’s a chicken if he doesn’t come back and face her again.\nErrin:\nI think I tend to agree. I think we probably will see another debate again because he will likely wanna rematch. She already has said, let’s do this again soon. Well thank you for helping me unpack this unprecedented night in our politics. And I guess, what do we have here? 55 more days to go until the elections, I mean, literally yesterday was eight weeks from election day, but we are already in election season, my friend, so I will see you out there. Stay tuned. But thank you so much for being here with me today on The Amendment.\nRebecca:\nOf course, There’s nobody I’d rather be talking to the morning after.\nErrin:\nSame, same my friend. So that’s this week’s episode of The Amendment, which is also a newsletter by the way that I write. You can subscribe to it for free by going to 19thnews.org. That’s where you can also find all of our great journalism around gender, politics, and policy. For The 19th and Wonder Media Network. I’m Errin Haines. Talk to you again next week.\nThe Amendment is a co-production of The 19th News and Wonder Media Network. Our executive producers are Jenny Kaplan, Terri Rupar, Faith Smith and Emily Rudder. The show is edited by Grace Lynch and Julia B. Chan, produced by Brittany Martinez, Grace Lynch and Luci Jones, and post-production support from Julia Bogan, Victoria Clark, Lance Dixon, and Wynton Wong. Artwork by Aria Goodman. Our theme music is composed by Jlin.\nThe post The Amendment: How Gender Defined the Presidential Debate with Rebecca Traister appeared first on The 19th.\nNews that represents you, in your inbox every weekday. Subscribe to our free, daily newsletter.",
  "word_count": 10453,
  "scraped_at": "2026-02-14T13:14:48.781252"
}