{
  "article_id": "fc063d4e5b3a",
  "url": "https://www.northern-times.co.uk/news/national/article/record-label-releases-own-mary-earps-shirt-after-disgusting-nike-decision-86331/",
  "title": "Record label releases own Mary Earps shirt after  disgusting  Nike decision",
  "date": "20230822T210000Z",
  "domain": "northern-times.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Record label releases own Mary Earps shirt after ‘disgusting’ Nike decision\nAn Oxford-based record label has designed an unofficial shirt of England’s goalkeeper Mary Earps after Nike’s “disgusting” decision not to sell her shirt.\nJack Clothier, the 41-year-old founder of Alcopop Records, decided to create a replica of the shirt after the Lionesses’ kit manufacturer, Nike, faced public criticism for not selling it – despite her winning the World Cup’s golden glove.\nThe Manchester United star, dubbed “Mary Queen of Stops”, said the decision was “very hurtful” while more than 90,000 people have signed a Change.org petition calling on Nike to release the shirt.\nMr Clothier came up with the idea on Wednesday and made a “last-minute decision” on Sunday to design the shirts.\nDuring the World Cup final against Spain, Mr Clothier’s partner, Rhi Lee, 38, who is currently on maternity leave, designed the shirt in the first half of the match and it was made available for purchase at halftime.\n“We were absolutely excited and sort of drawn into what a brilliant World Cup it’s been, and how the Lionesses were doing super well,” Mr Clothier told the PA news agency.\n“I was just absolutely disgusted really that Nike weren’t releasing a jersey for Mary Earps, who was one of the heroes of the tournament, undeniably of the Lionesses’ best players.\n“It seemed like a very weird decision to take the criticism from Mary herself and not do something about it.”\nThe record label founder from Twickenham, London, said proceeds from the sales will be donated to the charity Football Beyond Borders.\n“The whole point of the shirt is that Mary has been inspiring people all throughout the tournament,” he said.\n“What we wanted to do is give that money back to a charity that’s inspiring young footballers as well; it felt like the right thing to do.”\nHe stated that he ensured the light pink shirt did not “contravene” any copyright laws; the England badge was hand-drawn, and the Nike symbol was replaced with the phrase “Just did it,” a parody of Nike’s slogan “Just do it”.\nMr Clothier added the shirts have received a “positive” response from the public.\nHe said: “I think the key things we had responses on are that people want it in green, so we’re working on a green version now.\n“So many nice people have got in touch and said I want to buy extra shirts for you to give to people who can’t necessarily afford them.”\nMr Clothier said “I love Nike, I wear their stuff, but in this instance they have missed a massive PR open goal.\n“They should be supporting people who are genuinely inspiring a whole new level of athletes.\n“I’m not mega anti-corp or anything, I just want to say thank you Mary Earps more than anything else.”\nA Nike spokesman said: “Nike is committed to women’s football and we’re excited by the passion around this year’s tournament and the incredible win by the Lionesses to make it into the final.\n“We hear and understand the desire for a retail version of a goalkeeper jersey and we are working towards solutions for future tournaments, in partnership with Fifa and the federations.\n“The fact that there’s a conversation on this topic is testament to the continued passion and energy around the women’s game, and we believe that’s encouraging.”\nMary Earps responded to Nike’s statement on her Instagram stories: “Is this your version of an apology, taking accountability, a powerful statement of intent?”",
  "word_count": 585,
  "scraped_at": "2026-02-14T13:04:16.264445"
}