{
  "article_id": "fca9e7b1942e",
  "url": "https://www.independent.ie/regionals/wicklow/west-wicklow-news/local-notes/blessington-bulletin/a463200851.html",
  "title": "Blessington Bulletin",
  "date": "20251224T024500Z",
  "domain": "independent.ie",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Blessington Bulletin\nDeath\nThe recent death took place on December 9 of Mary Flanagan Carrig Glen Blessington. Mary finally lost her very brave battle with a serious illness. Her remains were removed to the Church of Our Lady Blessington last Monday Dember 15 for her funeral mass and her cremation took place afterwards in Newlands Crematorium Dublin. Mary was well known in the Blessington and surrounding area and will be sadly missed by all who knew her. Condolences to her husband Eugene and the rest of her family at this very sad time in their lives.\nCredit Union Draw\nBlessington and District Credit Union held their final members draw recently and the following members were the lucky winners of €1,000 each Ann Dwan, William Tyrrell, Vanessa Downes, Patrick Plant, Elizabeth Fisher Lindsay Brown, Martina Hopkins, Michael Fisher and Mary O’Malley. Congrats to you all and a lovely Christmas Present for you all. The next Draw for members will take place next year.\nMary’s TV appearance\nBlessington’s oldest resident Mary Finnegan from Carrig Glen appeared on the Late Late Show on Friday. Mary is 98 years young and it was wonderful to see her on the box. All of her children, grand children, great grand children and great great grand children came along to surprise her.\nThere were over seventy who came along to the Late Late show. Her family must be the largest family in Ireland. Host Patrick Kilty interviewed her on the show. And she got a great reception from the audience. Well done Mary.\nGreenway\nBlessington’s Greenway is now officially open again after being closed to the public for a number of weeks to do various repairs to the walkway. The Greenway has proven to be very popular with walkers and cyclists since it opened a number of years ago. It stretches from the Avon all the way down to Russellsltown which is across the road from Russborough House. I am sure the Greenway will be very busy over the Christmas.\nBowls Club News\nBlessington Indoor Bowls Club played Kill at home in the league on Thursday December 11. This was round 8 and the last match before Christmas. Blesso continued their winning ways at home in St. Kevin’s Community Centre. The final result was 3-2 with Blesso winning easily on the A mat but losing out on the B mat. Its their away form that has been letting them down so they will be hoping for better results next year.\nTheir next match will be an away fixture against Donard which will be round 9 and will bring them to the half way stage of the league with a lot of points to play for.\nLakeshore Striders Club\nCouch to 5K returns for 2026. Program will commence on Tuesday January 6. Their running track is behind Blessington Community College Blessington. There will be two coached sessions each week Tuesday and Thursday at 7pm. You will be training with others of similar ability.Membership will be for one year with Lakeshore Striders including Athletics Ireland membership and insurance. Why not make it a new year resolution.\nGoal Mile\nValleymount and Valleymount Lakeshore Pure Mile invite you all out there to participate in a Goal Mile at 11am on New Year’s Day. Parking will be in The GAA Grounds in Valleymount. Walker sand runners are most welcome for what promises to be a great community day out.\nYou can do a one mile or 5km. Collection buckets will be available on the day or you can register online for Valleymount GAA to be in with a chance to win €7,000. You support this Christmas will help save lives across Gaza, Sudan and beyond.\nLacken Naíonra\nEnrolment is now open for 2026-2027 for Lacken Naíonra pre-school. Please contact the school o45 865086 or email naionra@lackenns.com for full details and bookings.\nCandlelight Walk\nThe Russborough Candlelight Walk has been rescheduled for Sunday December 28 at 6pm. All are most welcome to attend. Proceeds from the walk will go to St. Mary’s Church of Ireland Blessington and the Irish Cancer Society.\nWomens Breakfast\nThe next Women’s Breakfast in the Coimin Centre Blessington will take place on Saturday January 10. This is for the Parish of Blessington and Valleymount. Further details will be announced closer to the event.\nParish Lotto\nBlessington Parish Lotto Draw took place on Thursday December 4 and there was once again no winner of the jackpot. The winning numbers drawn were 6,20,25,29. The jackpot has now survived a number of draws.\nThe next Lotto Draw will take place later in the week and it will have another new jackpot which will be standing at €3,000. Contact the Parish office for details in how to enter the draw or you can check the parish website. All support will be most welcome. It would be a great way to win a nice few euros and who knows you might be the lucky one who scoops the jackpot which no doubt will come in very handy at this time of the year. The weekly winner won €25.\nAspecial Christmas Giveaway with some fabulous prizes will take place this Thursday December 18 for those people who contribute to the Lotto Draw.\nProjected image\nThe next iconic Blessington image is now live projected onto the steeple of St. Mary’s Church in Blessington. This one features the famous Blessington Steam Trams reimagined this year as the Christmas Express. Make sure to have a look at it. It is a beautiful reminder of days gone by when the Tram was working.\nSchool enrolling\nSt. Mary’s Junior National school are currently accepting applications for 2026/27. To apply please contact Bernadette in the school office tel. 045 865501 or visit the school website.\nRay Daniels Memorial Cup\nThe Ray Daniels Memorial Cup will take place once again on St. Stephen’s Day December 26 between Blessington AFC and Blessington GAA. with kick off at 11am.\nThis match is in memory of Ray Daniels who played for both the Soccer Club and the GAA Club and supporters are asked to come along on the day for what promises to be a great occasion. It would be a lovely way to remember Ray who died suddenly some years ago.\nCinderella\nBlessington Musical and Dramatic Society will be taking to the stage of the Tramway Theatre in Blessington for the pantomime Cinderela. It will be from January 15 – January 18. Tickets are already on sale in the Office Shop Blessington and Next Door Offlicence\n. The tickets would make a lovely Christmas present so make sure to get one asap. Further details about the Panto will be announced nearer the date so keep an eye out.\nScór sucess\nCongratulations to Blessington GAA Club Scór Quiz Team who finished 2nd in the Leinster Finals of Scór which were held on December 2 in Ballyboden GAA Club Dublin. Team members were as follows Conor McDonnell, Tommy McDonnell, Declan Reape and Graham Keogh.\nThe team will now represent Blessington GAA Club in the All Irelands which will take place in Croke Park in February. Best of luck lads in the All Ireland Finals.\nLocal history\nThe Horseshoe Archway in Blessington dates back to 1854. The shape of the Archway in the form of a horseshoe indicates clearly that it was the entrance to a Forge where the farriers reshod horses and manufactured and repaired farm implements. The Forge was situated at the bottom of the laneway covered by the Archway.\nThe name of the Farrier who operated the Forge was Brown. Later the Shannons were the farriers. During the Blessington Fair day which was held on the 13th of the month. Farmers who had horses for sale gathered outside the Horseshoe Archway and it was there that the buying and selling took place.\nSeasons Greeting\nI would like to wish all my readers a very happy Christmas and a very healthy New Year. Could I give a special mention to Fr. Tim Murphy a former Blessington PP who is a weekly reader.",
  "word_count": 1337,
  "scraped_at": "2026-02-14T12:20:36.900567"
}