{
  "article_id": "fcc22263e306",
  "url": "https://www.chelmsfordweeklynews.co.uk/news/national/24390412.hundreds-thousands-england-fans-travel-germany-throughout-euro-2024/",
  "title": "Hundreds of thousands of England fans to travel to Germany throughout Euro 2024",
  "date": "20240616T033000Z",
  "domain": "chelmsfordweeklynews.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Hundreds of thousands of England fans are expected to travel to Germany throughout the Euro 2024 championship this summer as the national team prepares to kick off its tournament against Serbia on Sunday evening.\nEngland captain Harry Kane set high expectations for his squad, saying they would be disappointed with “anything other than winning” the tournament.\nThousands of fans will journey to Gelsenkirchen in western Germany to cheer for the national team in their first Group C stage match.\nGareth Southgate urged England supporters to enjoy their time in Germany despite local police labelling Sunday’s opener against Serbia “high-risk” following reports earlier in the week of Serbian ultras making their way to the region.\nCharity fundraiser Russ Cook, known as Hardest Geezer, is also expected to be in attendance after a 352-mile run which began at Wembley Stadium on Tuesday.\nThe endurance athlete made headlines after running the length of Africa for charity, finishing his trek of more than 10,000 miles in April after 352 days.\nThe Prince of Wales will join fans travelling to Frankfurt Arena on June 20 – the day before his 42nd birthday – to watch Gareth Southgate’s side clash with Denmark in their second game.\nScotland also qualified for the tournament, with tens of thousands of members of the Tartan Army thought to have made the trip to Germany to support their team against the host nation on Friday.\nThe Foreign Office said up to 500,000 British supporters are expected to travel to support their team over the course of the tournament.\nScotland midfielder Callum McGregor admitted the team’s upcoming opposition will “smell blood” after a 5-1 thumping by Germany in their opening game dampened the “phenomenal” pre-game atmosphere described by First Minister John Swinney, who joined fans in Munich.\nBack home, supermarkets say they are ready for one of their busiest periods of the year as football fans stock the fridge to watch the games from home.\nTesco said it expected to sell 33 million packs of beer and cider over the coming month but is also predicting it will sell 5.5 million bottles and cans of “no” and “low” alcohol options – a record for a major football tournament.\nWine sales are expected to top 30 million bottles, alongside more than 11 million pies, and more than 90,000 packs of bunting.\nHowever, police in the UK have warned that excessive drinking during the tournament may contribute to a potential rise in domestic abuse.\nThe National Police Chiefs’ Council said a study from Lancaster University found there was a 38% increase in domestic violence incidents when England lost a game between 2002 and 2010, and a 26% rise when they won.\nWomen’s aid charity Solace and the National Centre for Domestic Violence, have created an alternative England kit – “Shirt 38” – to raise awareness of the support available to anyone experiencing domestic abuse as part of their “No More Injury Time” campaign ahead of the Euros.",
  "word_count": 493,
  "scraped_at": "2026-02-14T14:12:35.500500"
}