{
  "article_id": "fcc9c94e3cc0",
  "url": "https://www.finanznachrichten.de/nachrichten-2024-05/62354746-brera-holdings-plc-brera-holdings-subsidiary-uyba-volley-in-busto-arsizio-hosts-3-elite-ncaa-women-s-volleyball-teams-296.htm",
  "title": "Brera Holdings PLC : Brera Holdings Subsidiary UYBA Volley in Busto Arsizio Hosts 3 Elite NCAA Women Volleyball Teams",
  "date": "20240529T130000Z",
  "domain": "finanznachrichten.de",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Dublin, Ireland and Milan, Italy--(Newsfile Corp. - May 29, 2024) - Brera Holdings PLC (NASDAQ: BREA) (\"Brera Holdings\" or the Company\") and its subsidiary Busto Arsizio UYBA Volleyball welcomes three top National Collegiate Athletic Association (NCAA) volleyball programs, the Universities of Minnesota, Tennessee, and two-time reigning national champion, Texas, to Busto Arsizio in the month of May.\nUYBA Volley Hosts 3 Elite NCAA Women's Volleyball Teams\nTo view an enhanced version of this graphic, please visit:\nhttps://images.newsfilecorp.com/files/10535/210904_photo-2024-05-29-03-07-29_550.jpg\nUYBA Volley, an Italian women's professional volleyball team that is a member of the Serie A1, one of the world's top professional leagues, is honored to host these teams for some very exciting volleyball friendlies (exhibition matches).\nDicey Perrine, Head of Brera's US Operations and former UCLA Volleyball MVP, commented, \"Serie A1 is considered by many to be the top women's professional volleyball league in the world and NCAA volleyball is clearly the top developmental league, so we're excited to host these three prestigious Universities' volleyball teams.\"\nTexas, the Two-time Reigning NCAA Champion, and UYBA Volley team photo\nTo view an enhanced version of this graphic, please visit:\nhttps://images.newsfilecorp.com/files/10535/210904_photo-2024-05-29-03-07-46_550.jpg\nUYBA played its first friendly competitive matches against Minnesota, on May 23, where Arsizio won 4-0. Following the matches the two sides enjoyed an authentic Italian meal together, exchanged autographed jerseys, and took lots of photos to commemorate the event.\nOn May 28, two-time defending NCAA champions, University of Texas, beat UYBA Volley 3-1.\nUYBA Volley will play the University of Tennessee on May 31, at 6:45 p.m. Central European Time.\nTexas, the Two-time Reigning NCAA Champion, and UYBA Volley team photo\nTo view an enhanced version of this graphic, please visit:\nhttps://images.newsfilecorp.com/files/10535/210904_photo-2024-05-29-03-20-20_550.jpg\n\"Like UYBA Volley, these three US universities have top teams comprised of elite athletes and this is an opportunity for the Lombardy region and our squad to scout and host some potential future team members,\" said Brera Holdings CEO, Pierre Galoppi.\nUYBA Volley and Texas Exchange Jerseys\nTo view an enhanced version of this graphic, please visit:\nhttps://images.newsfilecorp.com/files/10535/210904_photo-2024-05-29-07-01-08_550.jpg\nUYBA Volley and Texas Exchange Jerseys\nTo view an enhanced version of this graphic, please visit:\nhttps://images.newsfilecorp.com/files/10535/210904_photo-2024-05-29-07-01-17_550.jpg\nPlease visit UYBA Volley and Brera Holdings for more information.\nABOUT BRERA HOLDINGS PLC\nBrera Holdings PLC (NASDAQ: BREA) is focused on expanding its social impact football (American soccer) business by developing a global portfolio of emerging football and other sports clubs with increased opportunities to earn tournament prizes, gain sponsorships, and provide other professional football- and sports-related consulting services.\nThe Company seeks to build on the legacy and brand of Brera FC, the first football club that was acquired by the Company in 2022. Brera FC, known as \"The Third Team of Milan,\" is an amateur football association which has been building an alternative football legacy since its founding in 2000. The Company owns the trademarked FENIX Trophy Tournament, a non-professional pan-European football competition recognized by UEFA, inaugurated in September 2021 and organized by Brera FC. \"FENIX\" is an acronym for \"Friendly European Non-professional Innovative Xenial.\" BBC Sport has called the FENIX Trophy \"the Champions League for amateurs,\" and Brera FC hosted the 2023 finals at Milan's legendary San Siro Stadium. The 2024 FENIX Trophy finals were covered by ESPN. In October 2022, the Internet Marketing Association at its IMPACT 22 Conference named Brera FC as its award recipient for \"Social Impact Through Soccer,\" recognizing the Company's focus at an international level with this distinction.\nIn March 2023, the Company expanded to Africa with the establishment of Brera Tchumene FC, a team then admitted to the Second Division League in Mozambique, a country of nearly 32 million people. Brera Tchumene FC won its post-season tournament and in November 2023 was promoted to Mocambola, the First Division in Mozambique. In April 2023, the Company acquired 90% of the European first division football team Fudbalski Klub Akademija Pandev in North Macedonia, a country with participation rights in two major Union of European Football Association (\"UEFA\") competitions.\nIn June 2023, Brera acquired a strategic stake in Manchester United PLC, a portion of which was subject to a tender offer by Sir Jim Radcliffe and sold at a 74% realized gain. In July 2023, the Company completed the acquisition of a majority ownership in the Italian Serie A1 women's professional volleyball team UYBA Volley S.s.d.a.r.l. In September 2023, the Company assumed control of Bayanzurkh Sporting Ilch FC, a team in the Mongolian National Premier League, which became Brera Ilch FC when the football season resumed in March 2024. In January 2024, the Company announced the launch of a proactive search for an Italian Serie B football club target designed to bring multi-club ownership of the highest tiers of professional sports ownership to mass investors through the Company's Nasdaq-listed shares. In February 2024 the Brera Holdings Advisory Board was established with MLS founder and World Cup director Alan Rothenberg, luxury lifestyle executive Massimo Ferragamo, sports business leaders Paul Tosetti and Marshall Geller, and Italian football icon Giuseppe Rossi.\nIn May 2024 with a landmark decision the North Macedonian women's football association voted to assign all of the association's rights and property for a Strumica-based team now named Brera Tiverija to a joint stock company that is fully owned by Brera Holdings' subsidiary Brera Strumica. This marks the first time the association has allowed a for-profit company to operate a women's football team, and brings gender equity to the sport in Macedonia, with additional and needed resources now being available from Brera Holdings to develop the club.\nBrera Holdings PLC is focused on bottom-up value creation from undervalued sports clubs and talent, innovation-powered business growth, and socially-impactful outcomes. See www.breraholdings.com\nCautionary Note Regarding Forward-Looking Statements\nThis press release contains forward-looking statements that are subject to various risks and uncertainties. Such statements include statements regarding the Company's ability to grow its business and other statements that are not historical facts, including statements which may be accompanied by the words \"intends,\" \"may,\" \"will,\" \"plans,\" \"expects,\" \"anticipates,\" \"projects,\" \"predicts,\" \"estimates,\" \"aims,\" \"believes,\" \"hopes,\" \"potential\" or similar words. Actual results could differ materially from those described in these forward-looking statements due to a number of factors, including without limitation, the Company's ability to continue as a going concern, the popularity and/or competitive success of the Company's acquired football and other sports teams, the Company's ability to attract players and staff for acquired clubs, unsuccessful acquisitions or other strategic transactions, the possibility of a decline in the popularity of football or other sports, the Company's ability to expand its fanbase, sponsors and commercial partners, general economic conditions, and other risk factors detailed in the Company's filings with the SEC. The forward-looking statements contained in this press release are made as of the date of this press release, and the Company does not undertake any responsibility to update such forward-looking statements except in accordance with applicable law.\nCONTACT INFORMATION:\nFOR MEDIA AND INVESTOR RELATIONS\nPierre Galoppi, Chief Executive Officer\nBrera Holdings PLC\npierre@breraholdings.com\nTo view the source version of this press release, please visit https://www.newsfilecorp.com/release/210904\nSOURCE: Brera Holdings PLC\nGleichzeitig vollzieht sich an der Wall Street ein lautloser Favoritenwechsel. Während viele auf Wachstum setzen, feiern Value-Titel mit verlässlichen Cashflows ihr Comeback: Telekommunikation, Industrie, Energie, Pharma – die „Cashmaschinen“ der Realwirtschaft verdrängen hoch bewertete Hoffnungsträger.\nIn unserem aktuellen Spezialreport stellen wir fünf Aktien vor, die genau in dieses neue Marktbild passen: solide, günstig bewertet und mit attraktiver Dividende. Werte, die nicht nur laufende Erträge liefern, sondern auch bei Marktkorrekturen Sicherheit bieten.\nJetzt den kostenlosen Report sichern – bevor der Value-Zug 2026 endgültig abfährt!\nDieses exklusive PDF ist nur für kurze Zeit gratis verfügbar.",
  "word_count": 1265,
  "scraped_at": "2026-02-14T12:48:06.699364"
}