{
  "article_id": "fcff6d5b5494",
  "url": "https://www.thenationalnews.com/business/aviation/2025/08/17/air-canada-to-resume-dubai-toronto-flights-after-government-orders-end-to-strike/",
  "title": "Air Canada to resume Dubai - Toronto flights after government orders end to strike",
  "date": "20250817T141500Z",
  "domain": "thenationalnews.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Air Canada flights remained suspended for a third day as a strike involving 10,000 cabin crew continued, the airline said late on Sunday.\nThe action has affected about 700 flights and 130,000 passengers daily.\nThe airline's flight service between Dubai and Toronto was cancelled on Monday. Flights were also cancelled on Saturday and Sunday, leaving passengers scrambling to find replacements. Tuesday's service is scheduled to go ahead, according to the Dubai Airport's website.\nAbout 10,000 cabin crew walked out of work on Saturday – the first such protest since 1985 – demanding higher pay.\nThe Canadian government had on Sunday directed the flag carrier and its striking employees to end the impasse that caused major disruption in operations.\nHowever, the airline said the Canadian Union of Public Employees (Cupe) \"illegally directed its flight attendant members to defy a direction from the Canadian Industrial Relations Board (CIRB) to return to work\".\nApproximately 240 flights scheduled to operate from Sunday afternoon were cancelled. The airline will resume flights as of Monday evening, it said.\nCanada's Jobs and Families Minister Patty Hajdu referred the airline's contract negotiations with the Canadian Union of Public Employees to final binding interest arbitration. She also directed protesting staff to return to their posts.\nMs Hajdu ordered Air Canada and its budget arm, Air Canada Rouge, to resume operations by 2pm EDT (10pm UAE time) on Sunday. \"Restart of operations will begin immediately, with first flights this evening, but Air Canada expects it will take several days before its operations return to normal,\" the Montreal-based airline said on Sunday.\n\"During this process, some flights will be cancelled over the next seven to 10 days until the schedule is stabilised. Air Canada deeply regrets the inconvenience for its customers.\"\nThe demands from Air Canada's employees include compensation for duties carried out before and after flights, such as critical safety checks, boarding procedures, assisting passengers with special needs and preparing the cabin, they said in a post on the union's website.\nMeanwhile, passengers affected by flight cancellations vented their frustration on social media, with many were also forced to pay for hotel rooms as they awaited resolution. Air Canada has offered compensation for passengers affected by the strike.\nAir Canada, the country's biggest carrier, serves more than 180 airports in six continents and plays a major role in Canada's aviation sector. In 2024, the country's overall aerospace industry contributed about C$34.5 billion ($24.8 billion) to gross domestic product – about 11 per cent of last year's total GDP – and more than 225,000 jobs, a report from Innovation, Science and Economic Development Canada released this month said.",
  "word_count": 437,
  "scraped_at": "2026-02-14T13:01:49.740238"
}