{
  "article_id": "fd0bda5db025",
  "url": "https://www.justarsenal.com/ten-things-we-learned-from-arsenal-womens-superstar-leah-williams-interview/377232",
  "title": "Ten things we learned from Arsenal Women superstar Leah William interview",
  "date": "20241002T190000Z",
  "domain": "justarsenal.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Here are 10 things we learnt from the latest Happy Place Podcast ….\nLeah Williamson has played in a transition period where women footballers played with little fanfare, to where she has helped the sport for the next generation where young girls can view football as a full-time career.\nThe face of Arsenal’s merchandise department, other modelling contracts, an OBE, etc, the 27-year-old has enjoyed the perks of being one of the faces of the game’s rise in UK.\nYet because she’s never forgotten her roots, she struggles to find the balance between being ‘ normal’ and her newfound celebrity.\nIt’s a confliction that’s apparent throughout the podcast ….\nThe Ben White Outlook\nBen White gets accused of not loving the sport, admitting in his spare time he’s not watching or talking about football.\nThe whole Williamson family are Gooners. Her parents would take the 45 min drive after work to ensure she got to training after school, at a time where there were zero guarantees this could be a full-time job.\nSo, no one would accuse Leah of not loving the game.\nYet both defenders share the same Outlook.\nTo get the best out of themselves they need that time to switch off and relax from work. This gets mistaken as not caring when it’s the opposite.\nIt’s because when they are training or on matchday they need to be 100 percent at it that mentally they wouldn’t function without stepping away.\nLooking at both’s body of work, who can argue?\nThe Injury\nWhen Leah tore her ACL, she knew immediately her World Cup dream was over. From the changing room to the three-hour journey home she cried, not allowing herself any wishful thinking.\nThe defender can’t find the words in this interview to detail how bored and frustrated she was in rehab.\nYet you reach a point where your fed up with being fed up and a choice was made to stop being sad and find the positives.\nAt the very least she can maturely acknowledge she’s in a generation where a serious injury doesn’t end your career.\nThose before her wouldn’t have been paid not to play and wouldn’t have the world class medical care that the men get.\nWhile her relationship with Arsenal stretches back to the age of 9, the Gunners don’t help her walk again if she (and the WSL) isn’t an asset to them\nFell In Love Again\nHer love for the Gunners can’t be questioned but you sense Leah doesn’t adore the limelight that has existed in the last few years?\nWhen her parents were driving their daughter to Arsenal ‘s school of Excellence, there was no guarantee football could be a full-time job. Where young boys dreamt of money, fast cars and big houses as a byproduct of making it as a professional, that lifestyle was never presented as being on the table for girls.\nFrom 9- 27, Leah would have battled for professional travel, training and accommodation.\nSo, to suddenly have the fame of the Euros, her face now recognizable in the street and the pressure of carrying a baton for the next generation, Leah admits losing her passion.\nThe Injury was the classic needing to lose something to miss it again.\nShe fell back in love with the sport again and couldn’t wait to return\nEuros\nLeah is clearly a deep thinker.\n2 years ago, she reached the pinnacle, lifted the European Championship at Wembley.\nOvernight she became one of the faces of the sport, got invited to Buckingham Palace and saw an increase in sponsorship deals.\nShe has never taken for granted the uniqueness of her dream coming true. She’s humbled that the odds of being a professional were huge, yet alone representing your country which has huge social ramifications for your national sport.\nYet to have done that at 25 can be stressful because technically the only way is down?\nLeah wanted to capture that moment in a bottle and make it last forever. Yet in two weeks she had to go again, and she admits herself and her peers struggled with this. It took the injury for her to regain perspective.\nLike that feeling when you fall in love you want those butterflies in your tummy to last forever.\nThink how many Musicians, actors, sports people turn to vices or suicide after reaching the apex of their industry?\nFame\nLeah points out that apart from one of her teammates, she’s never had to travel away from home to chase her dream.\nShe’s been fortunate that Arsenal has just been something her family have always inserted into her routine.\nEven the European Championships were on her doorstep.\nSo, it was easy for her to switch off after the Euros with her creature comforts vital to her.\nAll she wanted was to have a chippy tea on a Friday or pop into Asda to pick up some milk.\nShe didn’t enjoy being recognized but worse was how friends and family now treated her.\nFriends who used to casual chat were now asking for favours.\nShe even admits that Family now give her leeway that they wouldn’t have before.\nParanoia that people want something out of her used to be an issue.\nGender / Equality\nA decent podcast should encourage debate.\nI’m not saying I agree with the following points of view but it’s healthy if it promotes a conversation.\nLeah clearly recognizes the responsibility she carries being a female player in 2024.\nMales fight for the crest on their shirt but ultimately the future is their sport is safe.\nNo matter how bad a World Cup or Euros, the next TV contracts will still be lucrative, brands will still pay over the odds for sponsorship, tickets and merchandise will remain in demand.\nWilliamson and her peers continue to play under a microscope, having to fight for the WSL to get the best possible commercial deal, to be allowed to play at the bigger stadiums, for FIFA to invest.\nOne bad game / competition, it could all go away\nPerception Of Women Footballers\nLeah has a simple summary of the UK’s opinions towards girls playing football.\nThe generation before her will never accept it but the young parents of today are on board if asked to pack some football boots for their daughters PE. By the time those children grow up Williamson believes a girl like her will be able to say football Is her job without raised eyebrows\nShe feels that’s still the case, noticing how a women would be judged more than a man if they went to a football game\nStill Room to Grow\nWhile her career has coincided with the rise in popularity in the sport, Leah feels there is still room to grow.\nWhile content that attending a WSL fixture is more family friendly then a Prem match, she believes that’s due to a lack of tribalism in the female game.\nShe doesn’t want to change the idea that youngsters can watch women’s football without the language and behaviour that occurs in the men’s version.\nThe defender believes that while she plays in front of larger capacities (especially at Wembley and the Emirates), the majority remain fans of women football not having passion for one team.\nFor example, if a Gooner watches both genders of Gunners are they as gutted if the female loses compared to the men?\nFemale Manager in The Prem?\nAgain, I don’t agree with this point of view but if it promotes conversation then that’s healthy.\nFern asks why the idea of a female managing in the men’s game at the highest level remains taboo?\nIt of course doesn’t have to be one or the other. You can want to help promote interest in Women’s football while acknowledging it’s not yet as popular as the men’s game. Based on every metric it’s like night and day and till that changes it’s almost a different sport.\nMikel Arteta loses is different pressure compared to what Jonas Eidevall experiences.\nMotivating a millionaire pound footballer does not take the same skillset as working with players from the WSL\nWhile the quality of players, pace of the game is further along in the men’s game\nPeriods\nBoth the host and guest feel it’s wrong that in 2024 this remains a taboo topic.\nSo, I would be proving their point if I didn’t mention it was a key topic at the end of their chat.\nObviously, I can’t relate but both are asking for more awareness how this impacts girl playing sport and how they can be supported!\nDan\nADMIN COMMENT\nSo here are some simple rules which I must insist commenters follow….\nYou agree not to give any personal abuse to other Arsenal fans. Everyone is allowed to hold their own opinions even if you disagree with them. It COSTS NOTHING TO BE POLITE TO OTHER ARSENAL FANS.\nCALLING ALL ARSENAL FANS! Anyone who would like to contribute an Article or Video opinion piece on JustArsenal, please contact us through this link…",
  "word_count": 1508,
  "scraped_at": "2026-02-14T13:31:41.887227"
}