{
  "article_id": "fd0e557e94dd",
  "url": "https://www.myjoyonline.com/if-i-were-the-president-of-ghana-these-are-the-issues-and-things-that-im-going-to-do/",
  "title": "If I were the President of Ghana - these are the issues and things that Im going to do",
  "date": "20230504T161500Z",
  "domain": "myjoyonline.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Audio By Carbonatix\nIf I were the President of Ghana, then, I would have to act and behave like the former Prime Minister of Singapore, the late Lee Kwan Yew, and the current President of Rwanda, Paul Kagame, in Ghana our motherland. I would also be filled with the Spirit of God Almighty, which was in Joseph and Daniel so that I would be like them 100 per cent (Genesis 41 verses 37 to 50, Daniel 2 verses 19 to 23, 6 verses 1 to 3). I would be here to promote solely the welfare and the well-being of Children, Youth and Ordinary people (who are 90% of the population) as against that of Leaders, Elders and Elites (who are just 10% of the population).\nIndeed, I shall strictly be LIKE Lee Kwan Yew/Paul Kagame President for the CORRUPT AND GLUTTONOUS: LEADERS, ELDERS AND ELITES OF GHANA WHO HAVE RULED THE COUNTRY FOR THE PAST THIRTY YEARS AND STILL WANT MORE. I shall also be FILLED with the Spirit of God Almighty and would be the SELFLESS AND BENEVOLENT LEADER LIKE Joseph/Daniel for the DISADVANTAGE AND VULNERABLE CHILDREN, YOUTH AND ORDINARY PEOPLE, and TAKE CARE OF THEM 100%.\nAnyone who will put impediments as far as GROWTH, DEVELOPMENT, INDUSTRIALIZATION AND ADVANCEMENT of Ghana our Mother land shall be arrested, be detained and be jailed within one month (after going through the court procedures and process for one month), minimum of twenty years. Indeed, the fast-track court system is coming again.\nAlso, I would promote Productions, Infrastructure, Procreation and good family life (legal and spiritual marriage between a man and a woman, union between two families, husband and wife, like Adam and Eve- Genesis 2 verses 18, 21 to 25, 4 vs 1). I shall put a great halt to all the funds and money that some LEADERS, ELDERS AND ELITES give to SLAY QUEENS AND SIDE CHICKS ILLEGALLY.\nAgain, I would put an end to Corruption and Excessive Importation into the country. I would implement a serious Import Substitutions POLICIES to curtail imports, especially food). I would be a strictly benevolent dictator. A President is either being used by the Spirit of God or the spirit of Satan, his actions and inactions are either directed by God or Satan!\nI am a child of God, His Spirit dwells in me, and have Jesus Christ the Son of God Almighty, as my Lord and personal Saviour, He lives in me. I am going to project four issues for Ghana: Jesus Christ, Productions of all kind, Infrastructure and Procreation (i.e. marriage, regular sex with husband and wife only-THE MALE SEX ORGAN PERMEATE THE FEMALE SEX ORGAN, having children minimum four and maximum ten. I would encourage all to seek God (through Jesus Christ), and see to the welfare and well-being of all so that all citizens would have Health and Wealth.\nI believe that all the Presidents we have had to date have failed because the Spirit of the Lord God Almighty does not live in them. All the former Presidents have failed, because a spirit in Ghana bewitched all of them so that their good intentions could not be achieved. They eventually became corrupt and adulterous leaders. That evil spirit will be exorcized and be rebuked in the Name and the Blood of JESUS CHRIST the Son God Almighty, our Lord and Saviour. Currently, all those who want to become future Presidents in Ghana are brilliant and highly intelligent but that is not enough; they all lack wisdom and knowledge from God. Let them all come out and declare their stand either for or against- LGBTQIA+. INDEED, I AM AGAINST IT 100%.\nA President is not supposed to be an English teacher or a lecturer speaking impeccable words and grammar. A President is not supposed to be a talking cricket engaging only in rhetorical and theoretical speeches with empty words lacking vision and mission. A President must think and behave like a Mathematician and a Scientist.\nA President must Deal with physical and practical solutions for the ordinary people to see and feel good. A President must walk his talks. The solution to Ghana’s woes can only be solved through: SCIENCE, MATHEMATICS, TECHNOLOGY AND PRACTICAL ECONOMICS. It is not just talking economics.\nIndeed, Mathematics may not teach us how to add happiness or how-to minus sadness. But, it does teach one very important thing; that is every problem has a solution. The solution to Ghana’s socio-economic development challenge is that we must all agree to cut what has been given to LEADERS, ELDERS AND ELITES (who constitute 10% of the population) continuously for the past thirty years, and then give them to CHILDREN, YOUTH AND ORDINARY PEOPLE (who are 90% of the population), from now on.\nIn 2016, presidential candidate of the New Patriotic Party (N.P.P.) - Nana Addo Dankwa Akufo-Addo said and I quote” We are sitting on money, but we are hungry”. It is very true. The truth is that we have a lot of money in Ghana, but is only meant for Leaders, Elders and Elites only and alone. There is nothing for Children, Youth and Ordinary People. If I were the President of Ghana, then, it would change. It would be stopped immediately. Children, youth and ordinary people would enjoy at the greater expense of our leaders, elders and elites. Amen.\nNOTE THIS, if you are the President of Ghana and you fail or refuse to develop Northern Ghana, then, Ghana will never be developed and be well. I shall make the Northern Ghana to be like Malaysia, which will later catalyse the whole country to develop, first to be like Rwanda and later like Singapore. Amen.\nIF I were the President of Ghana, Palm Nuts Plantation is going to be my number one money making production industry for the nation. Palm oil plantation will fetch us 10 billion Dollars or more annually, which is more than the revenues from Cocoa, Gold and Timber. We shall plant Palm nut trees all over the country, give more impetus to Benso Oil Palm Plantation (B.O.P.P.) and Twifo Oil Palm Plantation (T.O.P.P.) and create more of these factories all over the country like Juaben Oil Mills Ltd.\nIf I were the President of Ghana, then, I would not sit down doing nothing and laughing, while La Cote D’Voire is getting $8 Billion from Cocoa production annually and Ghana is getting a paltry amount of $ 2 Billion. I shall gather great men of wisdom, knowledge and thinkers with high scientific means, within two years (2023 to 2025). Invest more money unto the ground and pay the farmers and producers very well. And with that, we shall have $ 4 Billion from Cocoa production, after four years (2025 to 2027), we shall catch up with La Cote D’Voire with $ 8 Billion or more for Ghana our Mother land. Amen.\nWHO IS THE PRESIDENT?\n- HE IS THE PRODUCTION MANAGER OF ALL KIND IN THE COUNTRY.\n- HE IS THE ONLY ONE, WHO IS IMBIBE WITH THE FULL POWER AND AUTHORITY OF THE COUNTRY, HE CAN PRAISE WHEN ONE DOES SOMETHING GOOD, AND PUNISHED AS WELL VERY SEVERE, WHEN ONE DOES SOMETHING WRONG.\n- HE IS THE PROVIDER OF INFRASTRUCTURE (HE IS THE DEVELOPER) OF THE COUNTRY.\n- HE MUST ENSURE THAT DEVELOPMENT RELATES TO GROWTH OF HUMAN CAPITAL INDEXES, A DECREASE IN INEQUALITY FIGURES, AND STRUCTURAL CHANGES THAT IMPROVE THE GENERAL POPULATION’S OF QUALITY LIFE.\n- HE MUST ENSURE QUALITATIVELY-HDI (HUMAN DEVELOPMENT INDEX), GENDER RELATES INDEX(GDI) HUMAN POVERTY INDEX(HPI) REDUCE AND IMPROVE DRASTICALLY- INFANT MORTALITY REDUCE, MALNUTRITION, HUNGER, HOMELESSNESS, DISEASES, LITERACY RATE INCREASES ETC.\n- HE MUST ENSURE THAT ECONOMIC DEVELOPMENT IMPLIES CHANGES IN INCOME, SAVINGS, AND INVESTMENT ALONG WITH PROGRESSIVE CHANGES IN SOCIO-ECONOMIC STRUCTURE FOR ALL AND SUNDRY OF THE COUNTRY (INSTITUTIONAL AND TECHNOLOGICAL CHANGES).\n- HE MUST ENSURE WE ACHIEVE THE WORLD HEALTH ORGANIZATION STANDARDS LEVEL OF HEALTH CARE- EXAMPLE NUMBER OF DOCTORS PER 1000 POPULATION.\n- HE MUST ALSO ENSURE WE GET THE QUALITY, AVAILABLE AND AFFORDABLE OF HOUSING AND HIGH LEVEL OF ENVIRONMENTAL STANDARDS.\n- HE MUST ENSURE THAT, THE INFORMAL SECTOR IF NOT ELIMINATED COMPLETELY, IS REDUCE DRASTICALLY. THE INFORMAL SECTOR ALSO KNOWN AS THE BLACK ECONOMY, WHICH IS UNRECORDED ECONOMIC ACTIVITY. INDEED, DEVELOPMENT ALLEVIATES PEOPLE FROM LOW STANDARDS OF LIVING INTO PROPER EMPLOYMENT WITH SUITABLE SHELTER.\n- HE IS TO MAKE SURE WE STOP IMPORTING AT LEAST WHAT WE HAVE COMPETITIVE ADVANTAGE OF AND INCREASE EXPORTS SIGNIFICANTLY. SO THAT, OUR DOMESTIC CURRENCY WILL BE STRONG, RESILIENCE AND STABLE AS AGAINST THE FOREING CURRENCIES. AND, AGAIN HE MUST ENSURE FOOD SUFFICIENCY, SUSTAINABILITY AND SECURITY ALL THE TIME FOR COUNTRY MEN AND WOMEN.\n- HE MUST ALSO ENSURE THAT THE COUNTRY IS DEBT FREE. HE MUST NOT MAKE THE COUNTRY TO BE OVER BURDEN WITH TOO MUCH LOANS AND DEBTS.\n- HE MUST ENSURE THAT CORRUPTION IS CURBED AT ONCE, BECAUSE CORRUPTION IS MURDER TO THE NATION. CORRUPTION IS INFRASTRUCTURE FORGONE.\nThe President, the Speaker of Parliament and the Chief Justice are in charge of the: Executive, Legislature and Judiciary respectively. But the three most important personalities of the Socio-Economic Development of the country are; the President, the Finance Minister and the Governor of Bank of Ghana. If they are competent, it will reflect in the welfare and well-being of children, youth and ordinary people. If they are not competent, it will also show badly, as we are experiencing in Ghana our Motherland now.\n- President Paul Kagame of Rwanda said; “corruption is a murder to the nation”. From 1993 up until 2023, Ghana has been losing 3 billion Dollars every year. This implies that, from the era of President Rawlings, President Kuffour, President Prof. Mills, President Mahama and our current President Akuffo-Addo, Ghana has lost a total of about 90 billion Dollars over the past thirty years. All of these Presidents watched indifferently and unconcerned, while corruption thrived in our various systems and sectors. Misappropriation of funds, misapplication of funds, and mismanagement of funds have become the order of the day (MALFEASANCE AT THE HIGHEST LEVEL).\nA report by Caroline Boateng of the Daily Graphic dated on July-04-2018, 07:56 indicate that, according to the deputy commissioner of the Commission on Human Rights and Administrative Justice (CHRAJ)- Rev. Richard Quayson, another story on corruption:\nGhana loses more than $3 billion yearly through corruption. Ghana loses us$3 billion to corruption a year\n- Published: 19 August 2019\n- Written by Zdravko ljubas\nDespite being one of the least corrupt countries in Africa, Ghana is annually losing billions to graft - a menace that keeps people poor and shatters their dreams, officials said last week.\nGhana’sPresident Nana Addo Dankwa Akufo-Addo (photo: republic of Ghana, the presidency) Ghana’s anti-graft body, ghana integrity initiative (GII), which is transparency international’s local chapter, warned that the country “loses close to US$3 billion to corruption annually,” ghanaweb news portal reported on Wednesday.\nThe outlet cited G.I.I. executive director Madam Linda Ofori-Kwafo, who stressed that successive governments have attempted to minimise corruption through “moral crusades to uphold high ethics, the confiscation of properties found to have been acquired through corruption or public reforms,” but that there is still a long way ahead to fight the problem.\nWhile most of the countries of the continent are awash with corruption, tiny Ghana is according to Transparency International (TI) corruption index among the least corrupt countries of the continent.\nA recent corruption scandal serves as an example for acts that leave “citizens in poverty, joblessness, in their broken homes and with shattered dreams”.\nIndeed, If I were the President of Ghana, then, I would have to built a corruption free and a discipline society. At the end of the day, we can get enough money to develop Ghana our motherland easily. Ecclesiastes 10 vs 19B- ‘but money answereth all things.’ the question is what do the White People do with money, and what do Black People like Ghana leaders do with money. For the White People, they will use the money to build infrastructure and production all over in their country. For we the black people, as it is typical in Ghana: they will steal some of the money and put them in their accounts abroad for safekeeping. And the rest of the money spend on slay queens and side chicks. ( Ecclesiastes 10:2)\nTake the case of an investor wants to invest 500(five hundred) million Dollars in Ghana, and Mr. Charles Adu Boahen is demanding for 20% of this amount as a kick back, which is equivalent to 100 hundred million Dollars. Do you know what 100 million Dollars can do in the socio-economic development of the nation? It can be used to resolve the issue of schools under trees, procure text books, uniforms, Shoes, Canvas, Camp Boots, Sandals and Football Boots for all the school children in the country.\nBarely 5 years ago, the cost of a Six-unit classrooms block was about GHS 250,000.00. Sadly, however, this same Six-unit classroom block cost a whopping amount of GHS 1,000,000.00. Thus, instead of GHS 1,000,000.00 giving us four Six-unit classrooms block, it can only afford one. This how bad corruption has devastated the country called Ghana. Indeed, corruption is infrastructure lost.\nI SHALL first of all assemble all the Head Pastors in Ghana, so that we shall fast and pray to God Almighty for the sins of Ghana. It is believed that sometime ago, a pregnant woman was buried alive in Accra, and that sin committed by a Leader is still haunting us as a nation. (2 Chronicles 7 verses 13 to 14, 19 and 22, Proverbs 14 vs 34, Isaiah 59 vs 14, Jeremiah 7 verses 18 to 20, Ezekiel 37 verses 1 to 14). The sins of our leaders, elders and the elites, which have also affected children, youths and the ordinary people include are;\na. Idolatry/ the worship of other gods (Joshua 24 vs 2) and occultism.\nb. Adultery in the name of protocol all over the country.\nc. Committing murders indiscriminately (secret ones- honourable J.B. Danquah Adu and Ahmed Suale) all over the country.\nd. Embezzlement of national funds.\ne. Corruption, fraud and high white-collar crimes.\nf. Telling lies all over the country (John 8 vs 44).\ng. Peddling of Falsehood all over the country.\nh. Fake Pastors/Prophets all over the Country\nI. Fetish Priest/Priestess all over the place.\nj. Fake Politicians all over the country.\nk. Malfeasance deals from majority of professionals and technocrats.\nl. Scammers all over the country.\nm. llegal mining (galamsey) destroying lands and water bodies.\nn. Filth, Garbage and Waste materials all over the nation.\no. White-Collar crime all over the nation.\np. Prostitutions of all kinds all over the nations.\nq. Usage and Peddling of Drugs and blue-collar crimes\nr. Unnecessary Borrowing and Misappropriation of funds.\n- If I were the President, I am going to constitute a 24-hour prayer team for the nation. A prayer chain, consisting of both men and women, will pray in turns. As one team is ending another team will take over continuously. They will be paid by the state.\n- All Pastors, Prophets and self-acclaimed Men and Women of God, must have at least a first Degree in Theology or Religious Studies, before they would be allowed to work in Ghana.\n- All false, fake and fiendish Pastors, Prophets (charlatans) and fetish Priest and Priestess will not be allowed to operate in Ghana our mother. (Jeremiah 23 vs 11).\n- From Monday to Friday, worship will be done between 4:30am in the morning to 7:30am and 6:00pm to 9:00pm in the evening. No church services will be held between 8am to 5pm, unless it is a special one for the nation. No all-night prayers within the weekdays, except Friday evening to Saturday morning. All must work period!\n- Indeed, 10% praying, praising and worshipping God (personality of Jesus Christ) and also propagating the gospel, and then 90% productions, planning and working (principles of Jesus Christ) and also procreating very well to the glory of God (three (3) Ps: Prayer, Production and Procreation). These are what God is asking all men and women to do in order to experience progress and prosperity. If, it is the other way around, then, we shall experience retrogression and poverty, as it is being experienced in Ghana our mother land now. Indeed, 5% Spiritual and 95% Scientific approach to all issues.\n- If I were the President of Ghana, then with immediate effect put a total ban on TV and Radio programmes concerning those who do doubling of money- SAKAWA- RITUAL BLOOD MONEY, SCAMMERS, ILLEGAL LOTTERY AND THE MY BET PROGRAMME NOT SUITABLE FOR THOSE UNDER EIGHTEEN YEARS ETC.\n- I SHALL WITH IMMEDIATE EFFECT, institutionalized development policies and all inclusive-unity government. I shall do what Prime Minister the late Lee Kwan Yew did in Singapore- MERITOCRACY, PRAGMATISM AND HONESTY (M.P.S.). I shall with immediate effect task the following five gentlemen: Prof. Joseph Magnus Frimpong, Prof. Cletus Kwashi Dordunoo, Prof. Peter Quartey, Prof. Godfred Alufar Bokpin and Prof. John Gartchie Gatsi to come out with economic wisdom, knowledge, ideas and scientific solutions within one month to help me solve the ailing GHANAIAN ECONOMY. Why do we have five astute Professors of Economic and Finance or even more in Ghana and our economy is in great distress and tatters and the President is not consulting them.\n- I shall organise the market women, tune their mind that, very soon all of them will working at the factories, and also regulate the informal sector very, get them all registered and be control and get the understanding of taxation, so that they will pay tax very well.\n- If I were the President of Ghana, then within six months (from June to December 2023), I shall ensure food prices come down significantly. If a ball of Kenkey cost GHS 5.00, GHS 4.00, GHS 3.00 and GHS 2.00, shall come to Ghana pesewas 0.50, 0.40, 0.30 and 0.20 respectively. A bag of Rice which on an average is selling at GHS 500.00 shall come to GHS 50.00. A bag of Maize which is selling at GHS 800.00 shall come to GHS 80.00, if cocking Oil on an average barrel cost GHS 400.00, shall be bought for GHS 400.00. A tuber of Yam selling at GHS 20.00 shall come to GHS 2.00 and bunch of Plantain selling at GHS 50.00 shall come to GHS 5.00. if a bowl or plate of food cost GHS 100.00, it shall come to GHS 10.00 and also GHS 50.00, it shall come to GHS 5.00 and on and on. Indeed, this is not a PROMISE but a PROPHESY (2 KINGS 7: 1 TO 18). If you don’t believe in these, then you will not live to see the glory of God coming to Ghana very soon. Amen.\n- I SHALL immediately move the capital town from Accra to the middle of Ghana: between Kintampo and Yeji, a town call Nyamoase or Nyamease, within one and half years (May 2023 to December 2024), from getting to the high office (some examples; Nigeria- from Lagos to Abuja, La Cote D’Voire- from Abidjan to Yamoussoukro, Tanzania- from Dodoma to Dar Es Salaam and Brazil- Rio de Janeiro to Brasilia). I shall invest one billion Dollars into the National Health Insurance Scheme (N.H.I.S.). Indeed, I shall take very good care of children, youth, ordinary people, the aged, poor and the needy. Amen.\n- From Wenchi-Nsawkaw-Bole-Bamboi-Wa-Lawra-Jirapa to Hamile, Kintampo-Babato Kuma- Buipe- Yapei- Tamale-Walewale-Bolgatanga-Navrongo to Paga, and then Dambai/Kpassa- Bimbilla- Yendi-Saboba- Chereponi- Nakpanduri to Bawku. And also, from Atebubu-Yeji- Nyamease- Mankango- Salaga to Tamale. From these areas of upper Central and Northern Ghana, I am going to implement within one year (May 2023 to June 2024): Infrastructure, Farms and Factories (I.F.F.). I shall invest two billion Dollars for these areas’ development (S.A.D.A. and One Village One Dam). Within four years (2023 to 2027), Northern Ghana is going to change significantly by way of infrastructure: roads, housing and apartments, schools, hospitals, electricity, water etc.\n- We are going to build hostels in every district in these northern areas, - from six to twelve storey structures, and even taller structures than these. I shall bring all the youths all over the country, all the head potters (Kayayo ladies) and the unemployed adult to these places. Free apartments for all of them. They will be fed morning, afternoon and evening, and they would receive monthly allowances of GHS 2,000.00 as well. There will be evening classes from 6:00 pm to 9:00 pm for those who would want to continue and further their educational levels.\n- If I were the President, then, every household in Ghana within one year is going to have: toilets, bathrooms and kitchen. And very good waste and garbage attending system-from 2023 to 2024. Washrooms, urinals provided all over the villages, towns, cities and our highways. Street lights within our towns and cities and our highways all over the country within a year (a typical example in Takoradi- from Apollo Junction to Nkroful junction, the dual lane). I shall also increase the livelihood empowerment against poverty (L.E.A.P.) allowances from GHS 191.00 to GHS 500.00 every month. I shall also increase the funds for the orphanages and take very good of the orphans.\n- If I were the President of Ghana, then, I shall with immediate with pay rural deprivation allowance of GHS 200.00 to all our folks in the rural areas every month, from 1957 up to now 2023, the leadership have left the rural areas unattended to, making them impoverish, primitive and ignorant. This is very bad and evil, I shall take very good care of our brothers and sisters from the Rural areas, upon presenting your Ghana Card, you will be paid. I shall also immediately paid WIDOW MITE”S allowance of GHS 200.00 to our old ladies all over the country, especially to our old ladies at Gambaga( Old ladies camp).\n- If I were the President, then I would invest one billion Dollars into food and agriculture. Indeed, from Accra to Paga, Tema to Bawku, and Axim to Hamile, from the South, East, West, Central, Middle and Northern parts of Ghana is full of arable lands (Psalms 67vs 6). It is a BIG shame that, all the former Presidents and the current President have to look unconcern, while we import food OF all kind and types from A-Z into our beloved country.\n- Within one year of my leadership and with Godly and Christ-like stewardship, we shall stop importing food into the country (2023 TO 2024). I SHALL bring back Operation Feed Yourself, back yard farming, I will use some of the ideas from the late Mr. Dan Lartey (we shall eat what we grow and canned what cannot eat), those who do five acres of farming or more will be given allowance GHS 500.00, every month. And also, free fertilizers, periodically their farms will be spray against insecticides and weedicides to ensure food: SUFFIENCY, SUSTAINABILITY AND SECURITY (Genesis 41vrs 48 to 49). I am going to reduce POST-HARVEST LOSS DRASTICALLY, we shall introduce trucks and vans going around the country to each and every farm gate to collect food stuffs, vegetables and fruits. These would be store at the various silos and warehouse for storage and processing.\n- If I were the President of Ghana our Motherland, then All schools under trees would be eradicated within six months (June 2023 to December 2023). All classrooms are going to get full furniture, schools- library, science laboratories with computers for all the children, textbooks, uniforms, Slippers, Shoes, Sandals and Canvas or Camp Boots, House attires, Church attires and football boots be supplied to all pupils from kindergartens, Basic primaries to J.H.S. It will later be extended to the S.H.S. Level. We shall give to those whose parents are below the Middle-income belts to the lowest in the level of society.\n- Pupils and students are going to be fed twice every day: morning and afternoon for the day students, and the boarding students the usual evening meals with snacks (fruit juice) and desserts. I shall intensify the reading clubs, the what do you know competition, quiz, essay competition all over the country. Every school in Ghana starting from creche, kindergarten, primary, J.H.S., S.H.S., Tertiary levels must have a big school farms for all cultivation of all kind and practical and physical training. And this will lead to MECHANIZE AGRICULTURE AND SCIENTIFIC LEARNING AT THE HIGHEST LEVEL. And also, brand new school bus would be purchase for all pupils from primary to S.H.S. Buses for the public schools will given to them free and the private schools as soft loan.\n- If I were the President, then I am going to promote more of the Technical, Vocational, Educational, Training (T.V.E.T.) and Science, Technology, Engineering and Mathematics (S.T.E.M.) Programmes very, in all the various secondary schools, I am going to attach the T.V.E.T. programmes to all the S.H.S. in Ghana. Those who will opt for the T.V.E.T. programme is going to be totally free and a monthly allowance of GHS 2,000.00 be given to each student as well.\n- I shall establish Technical Universities at Damongo, Nalerigu, Dambai, Techiman, Goaso and Sefwi Wiowso to compliment all the regional capitals. At the end of the day, I will want to bridge the gap between the over producing academic students with more artisans with high dexterity. Less oral and theoretical education (recalling and memorising education) to more of physical and practical education with science and technology (recognising and creating education) how to make, create and produce all our needs and wants, for that matter gradually stop importing. All children from the age six up to seventeen will be taught how to ride bicycle free of charge, and then own one later.\n- From primary one to six, boys and girls will be mixed up, but from J.H.S. to S.H.S., separate schools for the boys and girls. They will then, converge at the tertiary level- University, Teacher training, Nursing training, Agriculture and Veterinary training at the highest level. To avoid, early illegal sex(fornication). I shall form virgin clubs for our girls all over the country, teenage girls from age 13 to 19, will be encourage to remain chaste. When they attain age 20 years, from 20 to 24, they will encourage to get married. If by accident our female teenage girls get pregnant, none of them should perform abortion or no one should advice or induce them to abort the foetus.\n- Indeed, abortion is abolished in Ghana unless the lady involve life is at risk, the state will take care of them 100%, after that, their babies will be look after, for them to continue their education, be it academic or artisan one. All female teenagers from the age thirteen to nineteen, whose parents are below middle-income belt, will be given a monthly sanitary pad allowance of GHS 200.00. Upon completion, they will get job at the factories to work. And then will be assist to get married and have a good life. I shall abolish the early marriage practices of the girl-child, no parents or families will be allowed to let the girl-child marry, unless she is eighteen (18) and above years.\n- Ladies who want to marry between the ages 20 to 24, will be supported by the state, and also, gentlemen who want to marry between the ages 26 to 29, the same for them (GHS 3,000.00) will be given to each will be couples. Free accommodation for all of them, transport allowances, utilities will be paid for them. I will encourage ladies to marry immediately after attaining 1st Degree and give birth to about two or three, then, they will be sponsor to do 2nd Degree and any other advance courses.\n- Children from age zero to seventeen will enjoy free health care till they attain 18 years, senior citizens from ages sixty-one and above will also enjoy free health to the highest-level till they died, those were below middle-income earners would be given GHS 1,000.00 in addition to their pension pay. All children from age two to seventeen years will be given one egg, a BIG cup of hot milo with milk and big bread with chocolate spread or margarine. Indeed, total elimination of KWASHIORKOR CHILDREN from Ghana.\n- They shall also take one canned Malt or fruit juice, every afternoon, after taken their meals- Rice, Wheat, Millet, Sorghum, Yam, Plantain, Banku with proper Corn Dough with small Cassava Dough, with Fish, Chicken, Beef, Goat meat, with Kontomire stew, Palm nut soups and Beans, Groundnut soups etc, intersperse with Prekese or Dawadawa, which also a free meal. Proper balanced diet with more protein, carbohydrate, good fats, vitamins and minerals. Children and the youth must be given more vegetables and fruits of all kind always for their good HEALTHY upbringing. Women, who give birth to more children, that is six children and more will be given monthly allowances of GHS 2,000.00, their children will be taken care of by the state, with full scholarships. Every pregnant woman who are below middle-income belt, shall be given monthly allowance of GHS 300.00 and free medical throughout the pregnancy duration, especially those below the middle-income brackets.\n- If I were the President, then within one year (June 2023 to June 2024), I shall ban the importation of Rice, Chicken and all kind of meats and fish products into the country. I SHALL immediately bring Mr. Abraham Dwuma Odoom, the engineered who pioneered the Nigerian’s rice production success story. Give him 100% blessings to do same in Ghana our mother land. The Aveyime, Nasia and other small rice production farmers will be given very soft loans to boost and improve the rice production significantly.\n- Indeed, from 1993 up to now 2023, Rice Masters and other Rice importers have been financing and supporting all the previous Presidents and the current President. Majority of those who want to become President 2025, have been given money from the importers. In 2017, this current government said, we shall stop importing Rice by 2023. Now they have shifted the goal post to 2026 said by Dr. Owusu Afriyie Akoto, former Agric Minister.\n- Rice importation alone cost us 900 hundred million Dollars a year, and Chicken also cost 400 hundred million Dollars within the same period of one year. When, you sum up the two, they are costing us 1.3 billion Dollars, which is almost half of the 3 billion Dollars, the NPP government is begging from the International Monetary Fund (I.M.F.) and for that matter doing that ungodly and unnecessary Domestic Debt Exchange Programme (D.D.E.P.). After, one year all what we eat and drink will also be banned from coming into the country (June 2023 to June 2024).\n- If I were the President of Ghana, then, from May 2023 to May 2024, I shall work very hard to stop importation of Mobile phones into the country. Indeed, mobile phone users in Ghana as at 2022 hit 45 million mobile connections, up from 41.69 million, published by Doris Dokua Sasu. Assuming an average price is costing GHS 100.00 and you multiply by 45 million, the result is the great amount of money- GHS 4,500,000,000.00 ($ 375,000,000.00) that left the shores of the nation. Mobile phone prices range between GHS 100.00 to GHS 25,000.00. We must be able to assemble and manufacture the phones here, could we imagine how the economy of Ghana will get and the multiply effects on the socio-economic development, let us think about these issues very well.\n- After, four years of my presidency, all electrical gadgets and appliances will be also banned from coming into the country, and then, followed by bicycles, motorbikes, tricycles, saloon cars, wagons and four-by-four vehicles (2025 TO 2031). We shall, going to manufacture articulator trucks, planes, trains, ships etc (2031 TO 2037). Amen. We shall manufacture our own tyres here, after one year, I shall ban the importation of home-used tyres into Ghana. And, year after total ban on importation of all kind of tyres in our economy (2025 TO 2026).\n- I shall promote and sponsor the tailors, seamstresses, fashion designers and beauticians. They will be given a soft loan to purchase special modern Sewing Machines for their jobs so that they can sew all kind of dresses and attires like Jackets/Coats, up and down male attire- Kaftan, female dresses fantastic and lovely products. The same thing applies to shoemakers in Kumasi and other places all over the country.\n- If I were the President, with the immediate effect slash the salaries and allowances off all the article 71 holders, 50% cut. Especially, all CEOs who earns between 18,000.00 to 25,000.00 Dollars and that of all M.M.D.C.E.O.s, etc. There is a huge disparity between the highest paid and the lowest paid. The least is taken about $ 50.00, while the highest is taken over $ 25,000.00. I am going to bridge the gap of inequality of salary structure in the country. Workers would be paid every fortnight (two weeks), instead of monthly. I the President would take 20% of my salary and allowances, the 80% left will be put into the Children's Fund. And also, a speedily and scientific exercise to rid of all GHOST names of government payrolls, a lot of them will be imprisoned for engaging in that illegal and evil moral behaviour.\n- The minimum pay salary will be patch at $500.00 and the highest pay will be $10,000.00 across board, both private and public sectors. Also, cabinet meetings allowances, board meetings, sitting allowances and all forms of meetings allowances taken will be abolished, again also, entertainment and Hi Life allowances be abolished.\n- I shall immediately put a total ban on the importation of vehicles like V-8 and other LUXURIOUS cars into the country. I shall also abolish the payment of ex-gratia of all forms and shapes to President, Vice President, Speaker of Parliament, Chief Justice, Chief of Staff, Senior Minister, all Ministers, Parliamentarians (All Article 71 Holders) etc, these funds will put into a CHILDREN FUND, it shall be use for the children welfare: school feeding, vaccines, uniforms, house attires, Church attires, furniture, textbooks, Sandals, Slippers, Shoes, Canvass, Camp Boots etc. I shall put a total ban for all foreign travels for two years for all government officials.\n- If I were the President, with the immediate effect, I will make sure that, all the past Presidents, current President and vice President, who are keeping money outside the country will be brought back into the country. Including past and current Ministers of States, Parliamentarians, all head Pastors, the King, eminent Paramount Chiefs and all Paramount Chiefs, Opposition Leaders, all Prominent Persons.\n- Indeed, about $ 50 billion (FIFTY BILLION DOLLARS) or more are being hiding outside the country, I will use diplomatic means to bring all these money into the country, which will swallow all over OUR HIGHLY UNWISE DEBTS ACCUMULATED BY N.D.C. AND N.P.P. OVER THE THIRTY YEARS, WITH NO PRODUCTIONS OR INFRASTRUCTURES TO BE SEEN OR SHOWN FOR, poverty, diseases, homelessness, those who sleeps on the street, hunger, malnutrition, infant- mortality, maternal-mortality etc.\n- Anyone who is caught in any embezzlement, corruption, fraud and crimes, within one month be made to go through the court system- fast track court system. He or she will be jailed a minimum of twenty years, all their bank accounts, money and funds will be frozen. All their assets will be confiscated. If I were the President of Ghana, by now Dr. Stephen Opuni will have been in jailed long time, and also Mr. Charles Adu Boahen, will also been in jail now, period. Indeed, no mercy for corrupt officials in Ghana, because corruption is murder to the state. I will deal with corrupt officials very hard, harshly, brutally and rough.\n- Otumfuo the King and the following eminent Paramount Chiefs: 1. Yagbon Wura 2. Yaa Naa 3. Awumefia 4. Okyehene 5. Nayiri 6. Agbogbomefia and 7. Ga Mantse, will not be allowed to plead for anyone who is caught in wrongdoing in the state.\n- I am going to have Nineteen Ministers and nineteen deputy Ministers only. They are:\n- Finance, Economic, Planning, Monitory and Evaluation (PRUDENCE AND DILIGENCE PERSONALITIES).\n- Wisdom, Knowledge, Understanding and Common Sense (Senior Minister).\n- Food, Agriculture and Aquaculture.\n- Trade, Processing, Manufacturing and Industry.\n- Rural Development, Advancement and Industrialization.\n- Energy, Fuel, Gas, Salt and Power.\n- Foreign, Diplomatic Affairs and International Relationships.\n- Justice, Attorney General, Auditing and Special Prosecutor.\n- Works, Housing, Water, Sanitation and Infrastructure.\n- Roads, Highways, Railways, Aviation and Transport.\n- Health, Welfare and Wellbeing.\n- Education and Career Development Minister.\n- Youth, Children, Ordinary People- Empowerment and Sports.\n- Defence and Military Intelligence.\n- Interior and National Security.\n- Science, Technology, Innovations and Creative Minister.\n- Forest, Natural, Renewable Resources and Tourism Minister.\n- Information, Communication, Entertainment and Digitalization.\n- Ministry of Harvesting, Storage, Preservation, Packaging and Distribution.\n- All the sixteen-regional capitals, I am going to establish one ministry over there, If I were the President. And use that opportunity to develop the various regional capitals. I shall build heliport and aerodrome at the regional capitals where it will not be prudent to build airport there. All the regional capitals are going to have two helicopters to enable the Police and the Military to combat crimes of all kind all over the country, All Ministers and Deputy Ministers, all C.E.Os., M.M.D.C.E.O.s appointed by the President, will be made to sign a bond, when you are caught in any illegal deals, you will be jail within month with hard labour, minimum of twenty years. I will not need or use Regional Ministers, I will rather use the Majors (M.M.D.C.E.O.s) and Assembly Men and Women only to develop the country.\n- All C.E.Os., all Heads of Departments and Institutions, M.M.D.C.E.O.s and agencies. There shall be Districts elections for M.M.D.C.E.O.s, not through partisan bases. Each contestant will present his or her manifestos, do the necessary campaign, strictly not monetisation election, but solely, your visions and ideas for your district.\n- I SHALL with immediate effect revamps and revitalised all the defunct factories in every district, I shall invest one billion Dollars into factories and industries, create additional factories as per the farm products at our various farms, within six months (June 2023 to December 2023). All farms products will be purchase at the farm gate, a guarantee price, just like the way and manner Cocoa is purchased in Ghana. Some of the products shall be send to the market for consumption: schools, hospitals, the general markets and government agencies. Made in Ghana products will be served solely at any functions and programmes in the country. Some of our farm products will be store at our various warehouse and finally a greater part to the factories for processing and manufacturing.\n- If I were the President of Ghana, then, the DUALIZATION of Accra to Kumasi road very urgent and very important, IT IS NOT NEGOTIABLE (four dual lanes- 2023 TO 2025), Accra- Mallam-Kasoa- Winneba- Cape Coast- Sekondi/Takoradi to Elubo road dual lanes (2023 to 2025), Accra-Tema-Sogakope to Aflao road dual lanes (2023 to 2025), Kumasi-Sunyani-Brekum to Dormaahenkro road dual lanes (2023 to 2026). Cape Coast- Assin Foso-Fomena- Bekwai to Nyanmeransa dual lanes (2023 to 2026). The EASTERN CORRIDOR ROAD 695 KM- Tema-Atimpoku-Asikuma Junction-Peki-Kpeve-Golokwati-Hohoe-Jasikan-Nkwanta-Bimbilla-Yendi-Gushiegu-Nakpanduri-Garu-Bawku-Kulungugu dual lanes (2023 to 2027).\n- Obuasi - Akrokerri- Nyanmeransa to Kumasi four dual lanes (2023 to 2025). Kumasi- Techiman- Kintampo- Buipe- Yapei- Tamale- Walewale- Bolgatanga- Navrongo- Papa dual lanes (2024 to 2032), Techiman-Wenchi- Bole-Bamboi- Wa- Lawra-Jirapa- Hamile dual lanes (2025 to 2033). All the railway lines will be fixed, Accra to Kumasi, Takoradi to Kumasi, and from Accra-Kumasi-Techiman-Kintampo- Buipe-Yapei-Tamale-Walewale-Bolgatanga to Paga lines constructed within four years (2023 to 2028).\n- If I were the President of Ghana, then all the private hostels built around our various Universities will be taken over by the government base on special negotiations with those owners, so that students will use them free of charge. All university and tertiary students will be given a monthly allowance of GHS 2,000.00, I shall review the SSNIT LOAN POLICY FOR STUDENTS. Indeed, free Egg, Milk, Milo, Sugar, can Malt and fruit juice will be given to the tertiary and university students every month.\n- If I were the President, every regional capital is going to have a NEW stadium: the new capital city Nyamease- Jerry John Rawlings, Accra- Osagyefo Dr. Kwame Nkrumah and Kumasi- John Agyekum Kuffour eighty thousand capacity football stadia. Sekondi/Takoradi- George Paa Grant, Tamale- Yaa Naa Yakubu Andani 11, Cape Coast- Prof. John Evans Atta Mills, Sunyani- Dr. Kofi Abrefa Busia and Koforidua- Dr. Joseph Boakye Danquah to have sixty thousand capacity football stadia. Also, Ho- Air Marshall Harry Dumashie, Bolgatanga- Dr. Hilla Liman, Wa- Naa Simon Diedong Dombo, Damongo- John Dramani Mahama, Dambai- Dr. Ephraim Amu, Techiman- Joseph Henry Mensah.\n- And also, Nalerigu- Alhaji Mumuni Bawumia, Goaso – Otumfuo Opoku Ware 11 and Sefwi Wiowso – Paa Kwesi Bekoe Amissah Arthur will have a forty thousand capacity football and running tracks each, within the four years (2023 to 2027). And other sporting events will have a complex for all the district capitals. And with immediate effect all the Premiere league players will be paid a minimum salary of Ghana Cedis equivalent to $1,000.00, also 1st Division $700.00, 2nd Division $500.00 and 3rd Division $400.00, 4th Division $ 300.00 per each player. Referees and assistant referees will be paid $150.00 per match.\n- Kumasi Asante Kotoko F.C. and Accra Hearts of Oak S.C.; would be given $ 10 million each AS LOAN, the rest of the premiere league clubs $ 5 million each. The 1st division $ 4 million each, 2nd division $ 3 million, 3rd division $ 2 million and 4th Division $ 1 million as a loan to boost football in Ghana. I shall invest $ 10 million into the Women football, colts and juveniles’ football $ 10 million, Athletes $ 20 million. Indeed, within three months (May to July 2023)- Kumasi, Sekondi/Takoradi, Cape Coast and Tamale, these four regional capitals are going to get the befitting TITAN TRACKS For running and field events, renovations will be done with great speed.\nBoxing $20 million and all the lesser sporting activities $5 million each, all payments would be done in Ghana Cedis. They must ensure we get standard playing pitches, international and scientific training fields and facilities, pay the players and the athletes very well, get qualify and highly professional managers and coaches to manage our teams. I know what to do as a President to win AFCON within two years- 2024 to 2026 for Ghana -\nHOW TO MAKE GHANA BLACK STARS WIN CUP WITHIN TWO YEARS\n- GET PLAYERS WITH TALL HUGE PHYSICAL PRESENCE, WHO KNOW HOW TO PLAY FOOTBALL VERY WELL, AND HIGHLY QUALIFY TO PLAY FOR THE TEAM. THOSE WHO CAN SCORE GOALS VERY WELL AND VERY EASY, WHO ARE IN TOP FORM AND SHAPES IN THEIR VARIOUS CLUBS.\n- GET GOOD STANDARD INTERNATIONAL SCIENTIFIC TRAINING FACILITIES FOR THEM.\n- PAY THEM WELL AS PROFESSIONAL PLAYERS, MOTIVATION, INSPIRATION, PATRIOTIC AND NATIONALISTIC ATTITUDE, BEHAVIOUR, CHARACTER, HABIT AND MANNERS INCALCATE AND IMBIBE IN THEM, POWERFULY.\n- GET TOP BEST COACH OR MANAGER FOR THE TEAM, NO INTERFERENCE WHAT SOEVER, FROM THE FOOTBALL ASSOCIATION AND THE POLITICIANS.\n- LET THEM GO THROUGH 99% SCIENTIFIC AND 1% SPIRITUAL FOR ALL THEIR MATCHES.\n- MENTAL TOUGHNESS, HOW TO ENDURE AND PLAY 120 MINUTES AND EVEN MORE, EXTRA MINUTES.\n- HOW TO PLAY AND WIN PENALTY SHOOTS OUT, VERY IMPORTANT IN THE FOOTBALL GAME. (1982- WE WON, 1992 AND 2015, WE LOST THE PENALTY SHOOT OUTS PAINFULLY).\n- CONFIDENCE, CONCENTRATION, CONTROL, NO COMPLENCENCY FROM ALL THE PLAYERS.\n- DISCIPLINE, DEDICATION, DEVOTION AND DETERMINATION FROM ALL THE PLAYERS.\n- GOOD RELATIONSHIP BETWEEN THE CURRENT PLAYERS, OLD PLAYERS, SUPPORTERS, MANAGERS, THE FOOTBALL ASSOCIATION AND THE POLITICIANS AS WELL.\n- These are my BEST BLACK STARS PLAYERS OF ALL TIMES; GOALKEEPERS- ROBERT MENSAH, JOSEPH “AGYINAMOA” CARR AND MICHAEL OWUSU MENSAH, RIGHT FULL BACKS- P.S.K. PAHA AND HARUNA YUSIF( OVERLAPPING MAN), LEFT FULL BACKS- AWULEY QUAYE AND JAMES AKWASI APPIAH( MAYELE), CENTRAL DEFENDERS- JAMES KUKU DADZIE, ISAAC ACQUAYE, SAMPSON LAMPTEY( GADDAFI), SETH AMPADU, STEPHEN FRIMPONG MANSO( MANYAGA) AND EMMANUEL ARMAH( SENEGAL), CENTRAL MIDFIELDERS- ADOLF ARMAH, KWADWO ADDAI KYENKYENHENE, ALBERT ASAASE( ASAASE J), ABDUL KARIM RAZAK( GOLDEN BOY), ABEDI AYEW PELE( MAESTRO) AND STANLEY ABORAH, RIGHT WINGERS- REV. OSEI KOFI( DRIBBLING WIZARD) AND JOHN SMITH BANNERMAN, LEFT WINGERS- MOHAMMED AHMED POLO( DRIBBLING MAGICIAN) AND WINDSOR KOFI ABBREH( CORNER KICK EXPECT) AND FINALLY STRIKERS- OPOKU AFRIYIE( BAYIE, BUSINESS MAN), EMMANUEL QUARSHIE AND GEORGE ALHASSAN. I shall go around Ghana, Africa and the entire world to get twenty-six players in the similitude like what I have mention above to play for Black Stars, within three years (from 2023 to 2026) we shall win AFCON. You can activate the country economy better with Football and Sports. Let look at AFCON 2008, hosted by GHANA, during President Kuffour's time.\n- Rwanda as a country is using Arsenal football club, in the English Premiere League in United Kingdom to revived their economy. All the former footballers and sporting personalities, that the nation owns them, within a month all their rewards and emoluments SHALL be pay to them. Ghana shall host the AFCON 2028, FINALLY GHANA, LA COTE D’VOIRE AND NIGERIA WILL CO-HOST THE 2038 WORLD CUP. AMEN. We shall with immediate effect institute a pension allowance for all the former players who are not doing well after the end of their carrier- GHS 2,000.00 for each of them till they died, it will be review as time goes on.\n- If I were the President, I shall also promote and encourage KEEP FIT CLUBS all over the country, from 5:30 to 6:30 in the morning, from Monday to Saturday, especially women who are obese will have the FAT TO FIT programmes, and awards will be given to them. Let us say, a woman is weighing 105kgs or more, and is able to reduce weight significantly to about 85kgs to 80 to 75, these ladies will be rewarded greatly under my leadership as the President of Ghana our Motherland. I shall introduce and encourage Daily, Weekly and Monthly check-ups of B.P. and Sugar. Annual medical check-ups for: BLOOD PRESURE, SUGAR(DIABETES), HYPERTHESIS-B, LIVER, KIDNEYS, PROSTATE ENLARGEMENT AND CANCER, BREAST CANCER, CERVICAL CANCER, ULCER, FIBROID, EYES, EARS, THROATS AND NOSE SCREENING, THE VISIT TO THE DENTIST ONCE A YEAR WILL BE ENCOURAGE, ETC., it shall be done at our various health centres in cottages, villages, communities, towns and cities all over the country free of charge for those below the middle-come belts.\n- Life expectancy of Ghana-64:11 years, US-77:28, UK-80:90 years and Japan-84:62 years. As the President of Ghana, I shall work very hard and take good care of the Ghanaian so that we can grow well, have a healthy lifestyle and for that matter ability to live longer (Psalms 90 vs.10).\n- Radios, TVs, and all the media in Ghana will be encourage to discuss only Production, Infrastructure, Health, Welfare and Well-being of Children, Youth and Ordinary People, the Aged and the Sick, and no more discussion and wasting time and energy on personalities, propaganda and politics of all kind any more. Also, the discussion going on concern of bad marriage and sexual promiscuous will not be discuss on our TV AND RADIO.\n- The abolishment from taken 1%, 2%, 5%, 10% or 20% from all payments, transactions, awarding and given out contracts. Twenty years of imprisonment, if one goes against these rules and regulations. Indeed, no given, taken or accepting gifts of any form or shape from individual or institutions when it comes to government business, that is all period!\n- The abolishment of taken or given brown or white envelope or any colour, full of money or other way to our Chiefs in Ghana, it is always the beginning of corrupt practices in Ghana.\n- All Ministries, Departments, Institutions and Agencies of Government will not be allowed to withdraw more than GHS 10,000.00(Ten thousand Ghana Cedis) per day at the counter of any bank. Indeed, no more, huge withdraws like: GHS20,000.00, GHS50,000.00, GHS100,000.00, GHS200, 000.00, GHS500, 000.00, GHS1,000,000.00 or more. All payments, settlements and transactions must be done through account crediting of each and every individual involve and issuance of Cheques to settle all payments.\n- One person cannot go the bank and withdraw huge amount of money, put them into sacks and Ghana must go sacks, and then go and distribute this money as payments to staff and customers/clients who have worked. This act will bring checks and control on corruption, we shall know all those who have really worked and being paid. And, also if an individual, private company, corporate and government institutions, departments and agencies are forbidden to issue a DUD CHEHQE. Ten years imprisonment for the culprit with hard labour.\n- Through the Governor of Bank of Ghana, Money Deposit Banks will by law ensure that, they use good, strong, durable, current and modern Bullion Vans with all the security gadgets, if possible moneys must be AIR LIFTED using Flights from one point to another to avoid arm robbers and roads accidents. Example the Military Helicopters shall be deployed to assist in some special cases.\n- Total ban on illegal mining(galamsey), as the President, and the Commander in Chief of the Ghana Armed forces, I am going to use the Military very well THIS time, the Military Officers and Men who secretly take brides from the Illegal mining people, THE MILITARY POLICE WILL TAKE THEM AND PUT THEM INTO GUARD ROOMS AND BE PUNISHED SEVERELY LATER, THEIR RANKS WILL BE REDUCE, EXAMPLE- A COLONEL WILL BE DEMOTED TO 2ND LIEUTENANT, WARRANT OFFICER CLASS 1, WILL BE DEMOTED TO LANCE CORPORAL, ON AND ON, within one month, all operations of illegal mining will come to a great halt, the culprits will be treated like rebels: Paramount Chiefs( would be destool), High Government Officials, Politicians, Prominent People- highly treasonable offences. Indeed, twenty years imprisonment with hard labour. All your accounts, funds and money will be frozen, your assets confiscated by the state.( Proverbs 8: 10 to 12, 16: 16 and 22: 1).\n- The One Village, One Dam in the Northern Ghana, with immediate effect will be tackled and fixed very well within Six months (June 2023 to December 2023). Communities, districts will have one standard dam. The Pwalugu dam will be done, within one and half years (June 2023 TO December 2025), so that spillage of water from the Bagre dam from Burkina Faso will not cause any havoc in the Northern Ghana. And the same dam used for a hydroelectric power generation. With one village, one dam put in place, we shall cultivate throughout the year in the Northern Ghana. As the food basket and the sources of raw material, to feed and supply the whole country.\n- The following Rivers are going to be dammed one turbine each: Ankobra, Pra, Densu, Oti and Birim (2023 to 2027). At the end of the period, we shall generate from 5000MW to 40000MW, improve the work of V.R.A.- Akosombo, Kpong and Bui, have enough energy, power and fuel for the industrialization agenda for the country. And also, the Ada and Somgor Salt productions, create jobs for our people there, we shall exchange Salt with Oil and Gas from Nigeria.\n- Total banned of Dollarization of the socio-economic development of the nation. You can only carry $10,000.00 (ten thousand Dollars with you when travelling).\n- If I were the President of Ghana, I shall Build more factories at the conflict’s areas like: Bawku, Nkonya-Alavanyo, Yendi, Bimbilla, Wa and others. Three or more factories over these places, the men will be made to work overtime and be engaged all the time. Indeed, the devil finds work for the idle persons will be over. And also, highly notorious areas like: Ashaiman and the other areas in Accra, Kumasi, Takoradi, Tamale, I shall build factories all over and set the Police and Military bases there.\n- If I were the President of Ghana, then, the problems of: Fire outage at our markets, I SHALL PUT TOTAL BAN FROM COCKING AT OUR VARIOUS MARKETS AND WORK PLACES, I will introduce the gradual use of Fire extinguishers in our various homes, offices, churches, market places, PUBLIC PLACES OF GATHERING etc., floods all over Accra and other places and road accidents, especially head on collisions will be look and solve drastically, THE SOLUTION IS DUALISATION OF OUR MAJOR HIGHWAYS. The introduction of public transport systems in our various towns and cities, the intra city train services improve again.\n- If I were the President, then, within a year or two (2023 to 2025), every household shall have solar panels attached to their building, or the community base ones, preferably the roof top for solar energy for electrical use. Also, rain harvesters will be dug and attached to each and every household or community base for water usage. (We shall emulate Morocco 100%).\n- If I were the President of Ghana, then I shall invest more in the ZERO MALARIA PROJECT AND PROGRAMME- (SPEAR-HEAD BY GIFTY ANTI NANAYERE AFIA DANSOAH). Indeed, Ghana will gain or save 22.1 billion Dollars from this exercise with it multiply effects on the socio-economic development. Every households in the country will be fumigated and disinfested, a period of six months, get rid of - Mosquitoes, Houseflies, Cockroaches, Tsetse flies, and rodents like Mice and Scorpions and Snakes. I will also institute and encourage every cottages, villages, communities, societies, towns and cities the neatness and cleanliness award. Currently Assin Hushea is the neatness and cleaner’s town in the country. Sunyani used to be the first, followed by Koforidua as far as the neatness and cleanliness city was concern in the country.\n- I shall build apartments for all Ghanaian nationals or citizens THE MORTGAGE SYSTEMS INTRODUCE, upon attaining the age of eighteen years, you will own an apartment with flexible payment system. You will start with two bed room apartments. Then, as you marry and have children, you will be moved to either three, four, five or six bedrooms apartment, depending on the number of children you have. Indeed, flexible accommodation for all citizens and qualify nationals of Ghana our mother land. Amen\n- If I were the President of Ghana, then I shall also institute good marriage allowance of GHS 500.00 to each couple who marries very well, engage in sex at least thrice a week or more with their spouses only. Indeed, sex involving a husband and wife is a worship to God, God will always send Angels to come and minister to husband and wife, while they are having good and lovely sex. There is always: Peace (healing, confidence, beauty/handsome, longevity, goodness, kindness), Progress, Prosperity, Performance, Promotion for couples who engages in regular sex and marry very before the Lod God Almighty and Jesus Christ the Son of God, our Lord and Saviour.\n- If I were the President, then, indeed, no divorce will be entertained under my leadership (Malachi 2 verse 15 to 16). Illegal sex of all kind is a worship to Satan, Satan’s agents will come administer to you, which is a shame to God, I will stop or minimised most illegal and illicit sexual activities going on in the country.\n- If I were the President of Ghana, All the Prostitutes, Slay Queens and Side Chicks will be encouraged to stop that practices, be train and conscientised and be prepare to get marriage. A monthly allowance of GHS 2,000.00 be given to them initially.\n- From 1919 to 1927, Gold Coast/Ghana had a fantastic Governor Frederick Gordon Guggisberg, within eight years, he laid the socio-economic development structure and foundation of the country. All the roads in the then Gold Coast were all laid and constructed by him, all the railway lines, from Accra to Kumasi, Takoradi to Kumasi and the Achease railway lines, were all constructed by him. He built the largest and the biggest Teaching Hospital- Korle Bu, Achimota College, the Achimota forest, Takoradi harbour. And, he left economic legacy of exporting raw: Cocoa, Timber and Gold to abroad, but, importing everything from A-Z. It is almost 100 years now (that is from 1927 to 2027). I shall form a strong team, we are with scientific approaches going to break that bad, socio-economic development legacy. AMEN.\n- If I were the President, every regional capital is going to get a Teaching hospital within four years of my Presidency, and also, Psychiatric hospital (2023 to 2027). Our various districts too going to get hospitals, with immediate effect complete all the AGENDA 111 projects within seven months (from May 2023 to December 2023). And also, with immediate effect purchase and provide INCULBATOR Machines for all the various hospitals and healthcare centres all over the country within one month (From May to June 2023). Our Doctors, Nurses and other Medical staff who agree to go to the rural and deprive areas will be given additional allowance of GHS 2,000.00 and free accommodation.\n- If I were the President, then all those who are begging in our streets, the State will get a place for them to sleep, feed them, cloth them etc. (Matthew 25 verses 31 to 46). All our brothers and sisters with mental challenges walking on our streets, will be confine to especial places. They will be fed thrice a day, and they get medical treatment, a special scientific treatment, and also spiritual treatments as a compliment to the scientific one.\n- I SHALL Promote colts, juvenile and youth sports throughout the country, all kinds of sporting activities: football- colts, under 12, 15, 17, 20 and 23, Boxing, Table Tennis, Long Tennis, Basketball, Volley ball, Hockey, Swimming, Weight Lifting, Wrestling. Especially Athletics, the Inter Schools and Colleges events, the Super Zonal, the Regional competitions, and also, from the Security Services.\n- If I were the President, then, the following former sporting and football commentators shall be honour by me: Joe Lartey, Edward Faakye, Ken Amoah, Ken Bediako, Eric Berko( We are sitting on Tanta hocks), Kwabena Yeboah (THE WRITTER), Papa Painstil, Dr. Kwaku Ofosu Asare, Karl THE TRUTH Tuffour, Kwabena Agyei Agyapong, Edwin Nii Lantey Vanderpuie, Charles Bruce Tagoe, Moses Foh-Amoaning, Amamoo Kakra, Sekyere Boateng, Nii Nortey Dua, Oko Dagadu, Atutonu( NYASALAO), and also the current sports personals like Kwabena Gyamfi (Sir Joe Laka) Dan Kwaku Yeboah, Kofi Asare Brako (Abatey), Dr. Randy Abbey, Frederick Kofi Acheampong (Achie), Yaw Ampofo Ankrah, Veronica Commey, Eva Okyere, Rosaline Amo, Esther Abankwa.\n- As the President of Ghana, I am going to honour and award all these former GBC-GTV Newscasters and Presenters: Vida Koranteng Asante, Mike Eghan, Clarrisa Odoi, Cordelia Amoah, Kate Boakye Danquah, Beatrice Aidoo, Sam Adjei, Grand Master Godwin Avenorbgo, Tommy Annan Forson and Fritz Baffoe (F AND F) Kwabena Nimo, Isaac Anthony, Samson Quaye (Pancho), Dusty Wayne, Lucy William, Suleman Zakari, James Amartey, Baba Adam Saddick, Dan Afari Yeboah (WHAT DO YOU KNOW!!) Gabby Adjatey, Oboshie Sai Coffie, Kwasi Kyei Darkwa (K.K.D.)\n- And also, Semah Varcourt, Yvonne Ayitia (Yvonne Asante), Ebenezer Ampaabeng, Jacqueline Enos Edu- Ohemeng, Barbara Sam Gaisie, Akushika Acquaye, Francisca Asheitey Odumtun, Lauretta Asare, Gifty Anti, Kate Addo, Jacqueline Ankrah, Earl Ankrah, Mawuko Afadzinu, Susan Naa Ayele Adamafio, Gideon Aryeequaye and Emma Morrison (TV 3- 1997), Beatrice Agyemang Abbey and Nana Aba Anamoah.\n- If I were the President, then, I am going to build theatre halls for all the 16 regional capitals, for music, entertainment and National church service activities, within two years (2023 to 2025). The Ghanaian Hi Life music is going to be improve and put on the world-wide networks again, I shall initially invest $ 200 million into music and entertainment industries, Friday evening life band with good danceable music shall be introduce again.\n- As the President, I am going to honour these great music men of Ghana: Dr. Daniel Kofi Nimo Amponsah (aka Agya Koo Nimo- Folk musician of Palm wine music and the ADADAM AGOFOMMA), The Ramblers Dance Band, Wulomei- Nii Tei Ashitey and Naa Amanua, Osibisa- Teddy Osei and Co, Abirekyieba Kofi Sammy, Obuoba J.A. Adofo (The Black Chinese And City Boys International) Gyedu Blay Ambolley( The Simigwahene, Simi Rapp), Eddie Ntre, Nana Safohene Djeni, Smart Nkansah, Bob Pinodo, Nana Kwabena Amo Mensah 1- Pat Thomas, George Darko, Adomako Nyamekye, Rex Gyamfi and Jean Danso.\n- And also, Ben Brako Baya, Dan Kofi Amakye Dede (Nana Amakye Dede, Abrantie, Serious, Iron Boy), Lee Dodou, Julius Kojo Antwi Asiamah (Mr. Music Man, The Music Maestro), Charles Kwadwo Fosu (Dada Lumba), Ernest Nana Acheampong, Charles Amoah, Ekow Micah, Felix Owusu and Oheneba Kissi, Nana Addo, Michael Asante, Bessa Simmons, Sloppy Mike Gyamfi, Nat Brew, RexOmar, Akosua Agyapong, Gee Man, Simpley Man Cantey, Adane Best, George Jahra, Solomon Ofosu Ware- Paa Solo and Kennedy Kurankye( Sibo Brothers), K.K. Kabobo, Dada K.D., Armah Pino, Princess Cynthia Act, Randy Nunoo, Ofori Amponsah, K.K. Fosu and Kofi Nti. Jamaica is getting billions of Dollars from RAGGAE MUSIC and ATHLETES. I with the huge investment in our HILIFE MUSIC, within four years, we shall get about 5 billion Dollars or more. Amen.\n- As the President I am also going to honour the following former MISS Ghana winners, from 1988 to 2002: Dzidzo Abra Amoa, Afua Amoah Bonsu, Bridgitte Dzorgbenuke, Matilda Aku Alomatu, Manuela Medie, Shiela Azuntaba, Benita Sena Golomeke, Efia Owusu Marfo, Mariam Sugri Bugri, Maame Ewurafa Hawkson, Selasi Kwawu and Shaida Buari. And also, these Dance Champions from 1982: Reginald Osei (Regggie Rastone), Slim Buster, Akosua Agyepong, Adjatey Sowah (World Dance Champion 1986, the Iced Kenkey Dancer) K.K.D. Jnr., Nana Yaw Wiredu, Dr. Terry Ofosu Bright, Lawrence Otoo, Fred Baah.\n- The following GOSPEL artist: The Sekyere Odumasi Gospel Singers Band, Prof. Kofi Abraham, Elder Dr. Kwasi Mireku, Yaw Sarpong and the Asomafo Band, Mc Abraham, Yaw Agyemang Badu (YABS), Rev. Mrs. Amy Newman, Rev. Mrs. Esther Nyamekye, Mary Ghansah, Tagoe Sisters, Daughters of Glorious Jesus, Bernice Offei, Stella Dugan, Diana Akiwimi, Naana and Dan, Helena Rhabbles and Mama Esther, Juliet Antwi Amoah, Hannah Marfo, Georgia Agyei, Esther Smith, Suzzy and Matt, Jane and Bernice, GETHY, Dorcas Appiah.\n- And also, Cecilia Marfo, Cindy Thompson, Evangelist Diana Asamoah, Mercy Twum Ampofo (Ohemaa Mercy) Christiana Love, Chief Supt. Kofi Sarpong, Francis Agyei, Edward Akwasi Boateng, Kwaku Gyasi, Nana Yaw Asare, Jack Alolome, Francis Asumadu, Noble Nketiah, Joseph Mensah, Francis Amoh, Soul Winners, Josh Laryea, KODA, Pt. Joe Beechem, Isaiah Ampong, O.J. Moses, Oware Jnr., Paa Boateng, Joe Mettle, Nacee, Christian Arko, Kofi Thompson, Joyce Blessings, Esther Amoako, Esther Prempeh (Lady Prempeh), Florence Obinim, Grace Ashy, Agnes Opoku Agyemang, Esther Opiesie, Anita Afriyie, Philipa Baafi, Anita Obeng, Patience Nyarko and Selina Boateng, Celestine Donkor, Diana Antwi Hamilton, Adwoa Amankwah, Ama Boahenmaa, Akua Serwaa Bonsu and Cee.\n- If I were the President of Ghana then, I am going to honour these Men and Women of God: Emeritus Arch Bishop Peter Akwasi Sarpong, Arch Bishop Daniel Yinkah Sarfo, Metropolitan Arch Bishop Charles Gabriel Palmer-Buckle, Most Rev. Prof. Emmanuel Matey, Most Rev. Prof. Osei Sarfo Kantaka, Most. Rev. Dr. Robert Aboagye Mensah, Pt. Dr. Andrew Lawrence Ewoo, Apostle Prof. Opoku Onyinah, Apostle Charles Kobina Soso (RTD), Apostle Dr. Michael Kwabena Ntumy, Apostle Eric Nyamekye, Apostle Dr. Aaron Ami-Narh, Most Rev.Prof. J.O.Y. Mantey, Most Rev. Dr. Paul Kwabena Boafo, Apostle Dr. Kwadwo Safo, Rev. Prof. Paul Frimpong Manso, Most Rev. Prosper Dzormeku, Most Rev. Prof Emmanuel Asante, Rev. Dr. Ernest Adu Gyamfi, Pt. Dr. Mensa Otabil, Arch Bishop Charles Agyen Asare, Bishop Dag Heward-Mills, Rev. Dr. Lawrence Tetteh, Bishop James Saah, Rev. Dr. Christine Doe Tetteh, Rev. Stephen Yenusom Wengam.\n- And also, Bishop Tackie Yarboi, Apostle General Sam Korankye Ankrah, Rev. Dr. Kwabena Opuni-Frimpong, Rev Dr. Ampiah Kwoffie, Rev. Eastwood Anaba, Rev. Eric Kwapong, Rev. Alfred Nyamekye, Bishop Kakra Baiden, Rev. Peter Annor Agyei, Rev. J.O. Mensah, Rev. Dr. James Yamoah, Prophet Dr. Kofi Oduro, Rev. Dr. Michael Boadi Nyamekye, Bishop NanaOsei Opoku Sarkodie, Pastor Agyemang Elvis, Bro. Dr. Dan Owusu Asiamah, Rev. Victor Osei, Rev. Joseph Gyimah Asante, Pt. Ransford Obeng, Rev. Kwabena Darko, Apostle Dr. Alfred Koduah, Apostle Alexander Nana Yaw Kumi Larbi, Apostle Emmanuel Gyesi Addo, Apostle Emmanuel Agyemang Bekoe, Apostle Isaac Nii Kotei Djani, Apostle Semenya Yao Dogbe, Prophet J.E. Ameyaw( RTD), Apostle Godwin Osei Bonsu( RTD), Apostle Kingsford Kyei Mensah( RTD). I shall have a quarterly meeting with them and seek Godly counselling from them, pray with them and dine with them always.\n- As the President of Ghana, I am going to introduce and promote some of the nice past LOCAL TV SOAPS AND PROGRAMMES LIKE: ULTIMATE PARADISE, BROAD WAY, THURSDAY THEATER (TV THEATER AND GET INVOLVE), THINGS WE DO FOR LOVE (NOW WE HAVE YOLO), BY THE FIRE SIDE, TAXI DRIVER, INSPECTOR BEDIAKO, OSOFO DADZIE, OBRA, ADASAA, ADEHYIE FROM CAPE COAST, SHOW CASE IN EWE, GA, DAGBANI, NZEMA, HAUSE. TV characters like: Rama Brew, Evans Omar Hunter, Kofi Yirenkyi, Sackey Sowah, William Addo (Akpatse), Dzifa Glikpe, Dzifa Abla Gomashie, Abi Adatsi, Agnes Dapaah, Vera Larbi, Edinam Atatsi (Sir Robert), Albert David Jackson, Max Broddy Mends, Nat Banini. I shall invest more in NAFTI teachings and training for our ACTORS AND ACTRESS.\n- And also, Winfred Akuoko, Mawuli Semevor( Dennis Bifon and Martin Owolewa) Fred Amugi, David Dontoh (Ghana Man) Grace Omaboe (Maame Dokuno), Akorfa Edjeani, Kojo Demenya ( Risky), Kofi Adjorlolo, Emmanuel Armah, Kofi Falconer, Harry Laud, Grace Nortey, Adjoa Peterson( Adjoa Pee) Charles Amankwah Ampofo, Nana Rokoto, C.K. Boateng( C.K. Frimpong), Kofi Kyerenmanteng( Ajooss) Emerald Brown Acheampong, Oscar Provencal, Augustine Abbey (Great Idikoko), David Bugri (Ten Thousand) Oman Shaw, Michelle Attor.\n- And also, Akosua Abdallah, Kwame Sefa Kayi( Chairman General), Abeeku Greener Nyame (Jagger Pee), Brew Riverson Jnr., Kwaku Sintim Misa( KSM) Eunice Banini, Collins Agyemang Sarpong, Micky Osei Berko (Master Richard), George Quaye (Aboagye) Henry Harding- Pattington Papa Nii Papafio (Oesophagus), Albert Kuvodu (Daavi oh Daavi) Albert Atterh, Ivy Adjimah, Dr. Joyce Akumaa Dongotey-Padi (Akumaa Mama Zimbi), Juliet Asante, Saka Brown, Jojo Robertson, Kwame Dzokotoe (Judge Kobo), Seth Kwabena Kyere Karikari (Koo Fori) and Akwasi Boadi Akrobeto. I am going to reward them richly- GHS 50,000.00 for each of them.\n- And then, Adjatey Annan (Pusher), Jackie Appiah, Abeeku Acquah (Akiller), Majid Michel, Prince David Osei, Chris Attoh, John Dumelo, Van Vicker, Omar Sheriff Captan, Edward Agyekum Kuffour, Fiifi Coleman, Bill Asamoah, Kalsoume Sinare Baffoe, Yvonne Nelson, Yvonne Okoro, Nadia Buari, Martha Ankomah, Naa Ashorkor Mensah-Doku, Joselyn Dumas, Lydia Forson, Ama K. Abebrese, Juliet Ibrahim, Nikki Samonas, Selly Galley, Nana Ama MacBrown, Gloria Osei Sarfo (Nana Ama), Emelia Brobbey, Portia Asare Boateng, Helen Kyei White, Sandra Ankobia and Film Producers- Shirley Frimpong-Manso and Deloris Frimpong-Manso( DELAY). And also, all these TV Stations will be honour: GTV, METRO TV, TV 3, UTV, JOY TV, JOY PRIME TV, ADOM TV AND ANGEL TV.\n- And also, Presenters like: Adwoa Yeboah Agyei (Naposohemaa 1999), Odi Ahenkane Kwame Yeboah, Anim Addo, Doreen Andoh, Paul Adom Okyere, Kojo Oppong Nkrumah, Samson Ayeni Lardi, Evans Mensah, Winston Amoah, Kafui Deh, Dzifa Bampoh, Emefa Apawu, Bernice Abu Baidoo Lancer, Zoe Abu Baidoo Addo, Berla Mundi, Mamavi Owusu Aboagye, Andy Dosty, Afia Pokuaa (Vim Lady), Akosua Agoe Aboagye, Nana Yaa Konadu (Mama Africa) Maame Beamah Kwaffo, Afia Akyere Asiedu( Osofo Maame), Ama Sarpong Kumankuma, Afia Amankwah Tamakloe, Yaa Konama, Afia Adutwumwaa Morosa.\n- And also, Akosua Kwartenmaa Boakye (A.K.B.), Kwabena Ntow (Yooooo), Johnny Hughes, Cookie Tee, Portia Garbo, Paa Kwasi Asare, Martin Asiedu Dartey, Nana Akua Mensah Abrampah, Aisha Yakubu Halid, Thierry Nyann, Aniela Allotey, Serwah Amihere, Kwadwo Dickson, Nana Yaw Kesse, Nana Tuffour Boateng, Caleb Kudah, Hawa Yakubu Mustapha, David Ofori Sarfo (Bongo De Fara), Ohene Nana Kwame Amo, Kwabena Marfo.\n- We shall introduce the singing of our Patriotic and National songs at all the schools, from primary, J.H.S., S.H.S. and the tertiary levels. We shall have singing competition with great awards given to the various winners, it shall be very keenly and highly competitive. And also, improvement and standardisation of all the tourist centres throughout the country: good road networks, accommodations, washrooms, restrooms, motels and hotels.\n- If I were the President, then, I shall build more class rooms for primary, J.H.S. to S.H.S., and more lecture rooms for all the tertiary and universities all over the country within one year (2023 to 2024). I shall also, build more teacher apartments and bungalows for teachers, tutors, lectures and facilitators of all kinds in our various schools, colleges and universities. We shall teach more in our local dialects; the Chinese, Koreans, Japanese have done that, and it had helped them a great deal in their socio-economic development of their countries.\n- At the end of the day, we will have export in flows of 190 billion Dollars OR MORE, and import bills of just 3 billion Dollars. I shall be implementing the triangular formulae of economy: Farms, Factories plus Finance/Service. When we combine these very by doing import substitution, we shall get all what we consume, all what we wear and all what we use. These will help us to STOP importing immediately. These will help us to have a multiply- effect in our economy, more in-flows and less out-flows. These effects will create more jobs, money will be available, indeed more liquid in our economy, food will also be available, cheap and affordable (2023 to 2027).\n- These will naturally cause our Inflation rate to come down to 5%, T-bills rate come to 5%, Monetary Policy Rate to 5% and Bank/Interest Rate 8%. Indeed, Ghana will be like a small Heaven on the Earth. Amen. We SHALL going to experienced Spiritual Uprightness and Scientific Rightness. I can do it because, I am Israeli-Ashanti/Dagomba and the Spirit that follow us is Gold, Gold means; Success and Excellence, and I have Jesus Christ the Son of God Almighty as my Lord and personal Saviour as well. I can do it all because of the Spirit of God the Creator, abides in me, I shall and I can make it. Amen (Philippians 4 vs 13).\n- If I were the President of Ghana, ALL those who have acquired land at the Achimota forest, whether through legal or illegal means, the state is taking all these forest land back. All those who have put up building structures, whether through legal or illegal means, all these structures are going to be pull down and demolish TOTALLY. And all houses built along rivers and water bodies and water ways will be demolish.\n- If I were the President, I shall put a TOTAL ban on felling of trees in our forest throughout the country, and also illegal hunting in our various forest for animals, ten years imprisonment with hard labour, if you are caught. Any land or a park left at a community as recreational center, as gathering place, nobody is permitted to sell the land or the place for housing development. A typical example is the C.K. MANN PARK AT ANAJI IN-TAKORADI, and the other places all over the country. If you put up even 100 storeys over the land mark, the structure will be totally demolished, so nobody should dare not to do that.\n- If I were the President, we shall process 70% of our Cocoa beans and export 30% of the remaining, and also our Gold and Diamond and Crude Oil in the country. The production of Cement and Iron Rods are also going to be tackle, no importation of Cement into the country. I shall bring all the rich people together example: Dr. Osei Kwame Despite, Dr. Ernest Ofori Sarpong, Elder Dr. Joseph Siaw Agyapong (JOSPONG-ZOOM LION), Elder Dr. Nana Tobin Amo (TOBINCO), Elder Nana Akwasi Oppong, Elder Nana K. Gyasi, Ibrahim Mahama, Mr. Stephen Kwabena Boateng Kesse (KESSBEN) etc to build factories and create more jobs for massive unemployed people.\n- If I were the President of Ghana our Mother land, I shall sign a bond on PAPER that, all that I have promised will be done within the stipulated period. If I failed to do them, then I shall subject myself to the Speaker of Parliament and the Chief Justice, be made to go through one-month mandatory trial. If I am found guilty, then be jailed for twenty years. But, I cannot fail, I am FIFTY-TWO years now, an Elder of the Church of Pentecost International, I have Jesus Christ living in me, also the Spirit of Pastor James McKeown and Apostle Dr. Michael Ntumy live in me, because of that, I shall fulfil all the promised I have made.\n- I am also referring everyone to my book entitle: (INDUSTRIALIZATION PLAN PROPOSAL FOR GHANA, 2018-2038), I had the vision from God for my twenty years continuous stay in great Tamale. Every Ghanaian will also be made to sign a bond to be discipline, honest, have integrity, credit worthy, and have good behaviour from both academia and artisans, those who are doing buying and selling. Otherwise, if one goes against these will be punish severely, a minimum of ten years jail sentence.\n- If I were the President of Ghana, then I will task Apostle Dr Kwadwo Safo and his outfit to manufacture and produce small cars for: Teachers, Nurses and all the other institutions and working industries. It will be given to them on soft loan purchase agreement. A lot of the young people have problem of paying house rent, they will be helped to settle their rent with the land lords/ladies amicably initially.\n- If I were the President of Ghana, then the following institutions and departments: Police, G.R.A., E.C.G., Immigration, C.E.P.S., Port and Harbour Authority, D.V.L.A., Lands Commission, and various M.M.D.A.s, are really going to be regulate and check very well. I will bring electronic bagging system into their various work places to check attendance, punctuality and loitering. A lot of bribe and corruption case are from these offices and Departments. The Police Units will be made to take on the spot fine for over speeding, crossing of the red lights, GHS 100.00, the road offenders will be issued with receipt and paid into Government accounts with Bank of Ghana.\n- And then, later with the digitalization and security cameras all over our cities and roads, road offenders will be pick up by the cameras. After that with the Ghana Card in place with all our personal details in the system, your accounts will be debited and the correspondent credit goes to government accounts in Bank of Ghana. The Police cannot pocket those kinds of money anymore from the road offenders, uneducated and vulnerable drivers. I Love C.O.P.(RTD) Nathan Kofi Boakye so much, fantastic, hardened and no-nonsense Senior Police Officer, I shall task him, so that we shall together uproot and eliminate corruption totally and completely from Ghana our Mother land. Amen.\n- If I were the President of Ghana, then the affordable housing units shall be given to people on mortgage levels, for all who are working, even, if one is not working, they can still be given accommodation free of charge. Within one year, I will complete all the uncompleted and abandoned projects in the country: housing, hospitals, schools (EXAMPLES SAGLEMI HOUSING UNITS, THE BOANKRA IN LAND PORT PROJECT, AFARI MILITARY HOSPITAL ETC.). After attaining eighteen years and completing of S.H.S, all and sundry will go for mandatory Military training for three months, both male and female.\n- If I were the President, I shall put in place a free mandatory driving school and training for both male and female (and those who want to learn how to ride motor bikes will be taught), after attaining eighteen years. The National Service allowance which is less than GHS 600.00, will be lifted up to GHS 2,000.00 plus GHS 500.00 and GHS 500.00 as transport and utilities allowance respectively. A total of GHS 3,000.00 will be paid to the youth every month, free accommodation be given to them all over the country. Indeed, the youth must be made to enjoy a little bit, because they are all children of God.\n- In 1471, a White leader by name Don Diego D’Asambuja and his men came to an African soil, that place was later named Gold Coast, he was a Politician and business man. In 1937, another White man by name Pastor James McKeown came to Gold Coast, this man was a Man of God preaching and proclaiming about Jesus Christ the Son God Almighty, that He was crucified, died on the Cross, buried and resurrected on the third day. After that, He was seen by the Disciples, and for forty days seen by all. He later ascended to heaven and will come back and judge both the living and the dead. Gold Coast Ghana attained independence on 1957, anytime the nation gets to seven something good happened- 1967, 1977, 1987, 1997. And then, 2007 the Spirit of God entered former President John Agyekum Kuffour, former Finance Minister the late honourable Kwadwo Baah Wiredu and the former Governor of Bank of Ghana Dr. Paul A. Acquah and they did the REDENOMINATION of the CEDI to GHANA CEDI, bringing hope and glory to the currency, which became stronger than the Dollar. After that, 2017, Ghanaians voted massively for President Nana Addo Dankwa Akufo-Addo in the December 2016 elections, he won with almost one million votes, which has not happened in the history of the country before, we taught there were hope for us, but now very disappointing. But, I am saying that, God is coming with His own man to lead the country, who has only Jesus Christ, and do no more the worship of the other gods and occultism secretly. From now (2023 to 2027), something positive is coming for the nation. This time, that person will be like Joseph, and will go around the country and gather food for his people, I am going to be that JOSEPH AND who has also the Spirit of DANIEL AS THE PERFECT POLITICIAN to bring healing and salvaging to the socio-economic development of Ghana our Mother land. Indeed, the economic legacy left by Governor Gordon Guggisberg will be broken from now-2023 to 2027 and beyond. Amen.\n- If I were the President of Ghana, then what my church- The Church of Pentecost is doing, we shall build more prisons for prisoners, places for homeless people, destitute people all over the country, improve their lives very well as Jesus Christ our Lord and Saviour said it- Matthew 25: 31 to 46.\n- If I were the President of this great country, then, I am going to honour MESSRS: KWAKU BAAKO JNR. AND KWESI PRATT JNR. Indeed, the two of them since 1969, through 1977-UNIGOV, from 1983 to 1993- Chairman Rawlings (P.N.D.C.), the MAY- 1995 KUMIPREKO have really fought for the good governance and economic development for the ordinary people. I am going to honour them as Professors of Journalism, Patriotism and Nationalism. I am also going to honour Dr. Nyaho Nyaho Tamakloe for being always BOLD AND BRAVE and telling the TRUTH and upholding the truth in high esteem, a great STATEMAN. And with this, as the President, I am reducing VAT from 17.5% to 2.50% and INCOME TAX for those who earns between GHS 6,500.00 TO GHS 20,000.00 FROM 15% TO 5% and also WITH IMMEDIATE EFFECT, THAT IS STARTING FROM MAY 2023, ZERO PERCENT TAX ON ALL PETROLEUM PRODUCTS for the ordinary Ghanaian to enjoy a better life, the harsh created by NDC AND NPP is too much. Mobile money and talk taxes will be scratch immediately, and later all the killer taxes will be taken of the burden of ordinary Ghanaians.\n- I shall promote and improve on the Friday wear with more Traditional attires: Kente, Smock, GTP, ATL and more of Ghana-made materials only. I shall also add Thursday to it, men’s and women’s wear with all kinds and types promoting the socio-economic development of Ghana and putting the nation on the world bigger platform.\n- If I were the President of Ghana, then I will promote and unit the Ashanti Kingdom, the Dagbon Kingdom and the Anlo Kingdom. And with Jesus Christ us our banner, we all surrounding our Sacred, Secrets, and Black Stool rooms to Jesus Christ the Son of God Almighty, our Lord and personal Saviour, like He entered the Holiest of Holy room, after that, a great and significant growth, development, advancement and industrialization will be achieved IN GHANA OUR MOTHER LAND. AMEN.\n- Vision is unfathomable like thunder and lightning, very versatile and dynamic. “Vision sees the invisible, believes the incredible and receives the impossible”- Rev. Samuel Asare-Duah, of the Church of Pentecost International. “Whatever the mind of man can conceive and believe, it can achieve”- By Napoleon Hill. “Si podemus”, yes, we can! The best way to predict your future is to create it”. By Abraham Lincoln former US President. Amen\n- I shall have these four messages wherever I am going throughout Ghana, Africa and the entire World: JESUS CHRIST, INFRASTRUCTURE, PRODUCTION AND PROCREATION. I shall also encourage the planting of Trees and Flowers at our various houses, homes, offices, schools, hospitals, churches, communities, villages, towns and cities. In the near future, that is from 2027 to 2037, by then, Water, Electricity and Gas services will be connected direct to our various homes, offices and other public and private places. You can bill online three digitalisation system like paying for DSTV and other mobile services.\n- If I were the President of Ghana our Mother land, then the problem below caused by NDC and NPP for the past thirty years, I am going to be the Prophet Ezekiel in the book of Ezekiel 37 verses 1 to 14, to solve these easy by the helped of God the Father, God the Son (Jesus Christ) and the God of the Holy Spirit, within six months. (Psalms 127 vs 1). Amen. Indeed, the current President is the King Saul, I am King David, the Spirit of the Lord God Almighty has departed from him, and the Spirit is currently upon me. AMEN.\nFROM 7TH JANUARY 1993, UP TO 7TH JANUARY 2023, THE GOOD, THE BAD AND THE UGLY OF 30 YEARS RULE FROM NDC AND NPP- THE WOES OF GHANA AND THE SOLUTIONS!\n- Loans, amortization and interest payments.\n- Statutory payments and others.\n- Compensation, remunerations, salaries and allowances- components and details (public sector wage bills, less than 2 million out of 32 million population, ballooned wage bill from 2017 of 14 billion Ghana Cedis to 35 billion Ghana Cedis as at the end of 2022: including wastage and corruption in the system).\nversus\n- Food, agriculture, aquaculture production and others.\n- Processing, manufacturing, factories systems and others.\n- Constructions and infrastructures.\nif we are to be given three billion dollars, which of the two groups are we going to spend or invest more funds and money into?\nHowever, the reality is that the first group is taking about 70 to 80% of the GDP, very irrational. Indeed, this has been case from 1993 up to now, and it is even worse and sickening. From the auditor general’s report, a lot of malfeasance are going on, all over the sectors and the systems: misappropriation of funds, misapplication of funds and mismanagement of funds, so sad and bad for Ghana our mother land. Even, the office of the special prosecutor for government is saying the same.\nGhana’s total public debt as at June 2022 was U.S. Dollar 54.4 billion (GHS 393 billion or 78.3% of GDP- exchange rate of 1 dollar to 6 Ghana Cedis). From a U.S. Dollar 32.3 billion- GHS 143 billion or 55.5% of GDP in 2017, according to the central bank and finance ministry data, of this, external debt was U.S. Dollar 28.1 billion (GHS 203.4 billion or 40.5% of GDP), while domestic debt issued in Ghana Cedis was U.S. Dollar 26.6 billion (GHS 190 billion or 37.8% of GDP). We as a nation have been to I.M.F. Sixteen (16) times, but, because of lacked of wisdom, knowledge, understanding.\nLet us choose for ghana our motherland the under listed qualities;\nWisdom discipline brilliant honesty utilize\nKnowledge diligence intelligence trustworthy selfless\nUnderstanding prudence cultured creditworthy judicious\nCommon sense insightful subtle generosity benevolence\nWe are going to embark strictly on four Japanese socio-economic development principles(KAIZEN), which govern them, making them patriotic and productive and thereby achieving industrialization: 1. Do not take or accept what does not belong to you. this has helped them to fight against bribery and corruption. 2. Whatever you buy, pay for the price of the value. 3. When you borrow and the time comes for you to settle your indebtedness, please do so amicably. 4. Last but not the least, wherever you find yourself under the sun, please patronize made in japan goods(products) and services, it does not matter whether the products are shoddy or not. Unless there is no Japanese product there.\nBanks operating in Ghana wrote off ¢2.92 billion as bad debt in the first 10 months of 2022, the domestic money bank’s income statement has revealed.\n*****\nElder Kwaku Minkah Sarkodie-Holy\nThe Church of Pentecost- Takoradi\nKwakuminkahsarkodie@gmail.com\nLatest Stories\n-\n‘I wanted to be an architect but ended up as a nurse’ – Diana Hamilton reveals\n3 minutes -\nFrom wards to worship: Diana Hamilton reveals how nursing school shaped her destiny\n20 minutes -\nMahama demands binding deadlines for African reparations\n52 minutes -\nThis is not the time to settle political scores – Bawumia to government\n2 hours -\n5 definitive Valentine’s Day gifts to win your lover’s heart in Ghana\n3 hours -\n37% of SHS students exposed to drugs – Opare-Addo\n3 hours -\nNLC secures court injunction against striking tertiary unions\n3 hours -\nWaiting in the Ring: life inside Bukom’s halted boxing scene\n4 hours -\nRed Notice cancellation: OSP official fires back at Ofori-Atta’s lawyers\n4 hours -\nOfori-Atta saga: Red Notice ends after arrest – OSP official clarifies\n4 hours -\nAAG raises alarm over billboard demolitions, calls for presidential intervention\n5 hours -\nHealth Minister to chair probe into ‘No Bed Syndrome’ death; promises system overhaul\n5 hours -\nPrime Insight to tackle ‘galamsey tax’ debate, cocoa reforms and Ayawaso East fallout this Saturday\n5 hours -\nCocoa crisis, galamsey complicity and election credibility to dominate this Saturday’s Newsfile\n6 hours -\nINTERPOL deletes Red Notice for Ofori-Atta as extradition process continues — OSP confirms\n6 hours",
  "word_count": 14462,
  "scraped_at": "2026-02-14T12:02:30.947987"
}