{
  "article_id": "fd4b6cff7cf8",
  "url": "https://www.aol.com/cristobal-blames-defense-miamis-season-210937326.html",
  "title": "Cristobal blames defense for Miami late - season collapse as Hurricanes look to  finish  in 2025",
  "date": "20250723T020000Z",
  "domain": "aol.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Cristobal blames defense for Miami's late-season collapse as Hurricanes look to 'finish' in 2025\nCHARLOTTE, N.C. (AP) — The Miami Hurricanes were on a trajectory to reach the Atlantic Coast Conference championship game last season for the first time since 2017 after starting 9-0.\nThen came a late-season collapse that included losses to Georgia Tech and Syracuse that allowed Clemson to leapfrog them into second place in the conference, abruptly knocking the Hurricanes out of contention despite having No. 1 overall NFL draft pick Cam Ward at quarterback.\n“It’s how you finish,\" Miami coach Mario Cristobal said. ”We had a chance to win every single game, but we didn’t. The bottom line is we didn’t get it done. ... Without a doubt, finishing is a mentality. Finishing is a work ethic that comes with the offseason.\"\nCristobal placed blame directly on the team's defense.\nMiami was a top 5 unit in the country early in the season before injuries intervened. But the Hurricanes, who finished 10-3, gave up at least 38 points and 500 yards in each of the final two games, those being losses to Syracuse and then Iowa State in the Pop-Tarts Bowl.\nThe result was Cristobal firing the majority of his defensive staff, including coordinator Larry Guidry.\n“We slipped defensively,” Cristobal said. “We had some injuries that led to some schematic changes that weren’t the best for our football program, so a change had to be made.\"\nCristobal hired Corey Hetherman from Minnesota to run the defense.\n“His use of personnel, his ability to adapt, his track record and his productivity, particularly last year at Minnesota, was enough evidence for us to feel comfortable in bringing him in,\" Cristobal said of Hetherman. “And he hasn’t disappointed.”\nAvailability reports going public\nThe ACC is instituting public game-availability reports for league games in football, men’s and women’s basketball, and baseball.\nReports will designate athletes as available, probable, questionable or out for issues ranging from injury to personal matters or eligibility issues. Football updates will come two days before the game, the day before and on gameday. Reports for basketball and baseball will come the day before and on gameday.\nPreviously the league had what amounted to a good-faith agreement for reporting injuries, running for roughly a decade until the league stopped ahead of the 2018 season amid the possibility of a national standard taking shape.\nCommissioner Jim Phillips said Tuesday the move was “directly connected” to legalized sports betting in terms of defusing efforts to obtain inside information about an athlete's status.\nField-storming fines\nThe league also announced Tuesday that it was implementing a fine structure for schools when fans rush the field or court to celebrate.\nFines would increase over a rolling two-year period, from $50,000 for a first offense, $100,000 for a second and $200,000 subsequently. Fines would accumulate by school rather than specific sports.\nAdditionally, schools must have security plans in place for review by an independent third party by the start of the 2026-27 academic year. The move comes after years of national discussions about the safety of getting players, coaches and officials away from the field amid onrushing fans.\nRivera's NFL experience aids Cal\nThe Cal Bears are leaning heavily on alum Ron Rivera's vast NFL experience as they look to rebuild their program. Rivera, who has served as head coach of the Carolina Panthers and Washington Commanders, was hired earlier this year at the school's general manager.\n“He's been unbelievable,” said Cal coach Justin Wilcox. “He’s got so many different experiences in pro football which have helped, just organizational structure, roster management, talking about players, situational football. Kind of from a 10,000-foot view.”\nAlong with managing the school's financial “salary cap,” Rivera's job duties also include talking to donors, advocating for the program and staying in communication with the chancellor.\n“In college, we hear that term GM, but I think it really depends on which school and how they define that role because there probably are schools where it is just cap and players, and then there’s schools like us where it’s a bigger role,” Wilcox said. “It’s really just the tip of the spear of football in general, and there’s a lot that goes into that. I think that’s where it’s a little bit different than maybe the NFL.”\nCutting calories\nVirginia defensive tackle Jahmeer Carter has a trimmer look this summer.\nThe 6-foot-2, 311-pound graduate student said he had trimmed about five percentage points from his body fat from last season, a sign he traded fat for muscle while staying at a similar weight. Working in the weight room remained a piece of that, but he pointed to nutrition being “a big part,” too.\nCarter pointed to small steps such as cutting out dipping sauces with chicken nuggets, leaning more into protein-heavy snacks like Clif Bars or drinking more water instead of calories-packed Gatorade.\n“I was intentional about, “OK, I want to be at this weight, but now I need to just drop body fat,’” Carter said. “What that means is I might cut out a couple of calories here or there. It’s not a big difference when you look at it, it’s just thinking about it more.”\nUp next\nThe league resumes its preseason media days on Wednesday with athletes and coaches from Florida State, Georgia Tech, Louisville, Pittsburgh, Syracuse and Wake Forest.\n___\nAP college football: https://apnews.com/hub/ap-top-25-college-football-poll and https://apnews.com/hub/college-football",
  "word_count": 900,
  "scraped_at": "2026-02-14T13:32:53.603854"
}