{
  "article_id": "fd50769708ff",
  "url": "http://paulgravett.com/articles/article/top_30_graphic_novels_comics_manga4",
  "title": "Top 30 Graphic Novels , Comics & Manga",
  "date": "20230305T004500Z",
  "domain": "paulgravett.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Top 30 Graphic Novels, Comics & Manga:\nMay 2023\nHello again, welcome back to my monthly survey of tempting new titles on their way to you from May or shortly after. Among my latest PG Tips, I want to single out the overdue English-language debut of Marcello Quintanilha, Brazilian and based in Barcelona, with his graphic novel which won the Best Book Award at last year’s Angoulême International Comics Festival.\nAnother Brazilian comics auteur arriving in English is Mário César with his first-hand recounting of being subjected to harrowing therapies to “cure” his homosexuality.\nAs we pass the first anniversary of Putin’s invasion of Ukraine, this graphic reportage about the first few months addresses its huge human impact…\nWhile the ever-expanding range of graphic biographies is joined by an inventive entry about the life of Anaïs Nin.\nSammy Harkham’s epic, long in the making, arrives in surely a standout comic of the year…\nAs does the man-machine collaboration between Carson Grubaugh and Midjourney A.I., demonstrating the potential and the pitfalls of this accelerating technology… Who knows where these developments will be taking comics, and humankind, next - the future is already here!\n83 Days in Mariupol\nby Don Brown\nClarion Books\n$22.99\nThe publisher says:\nA young adult graphic novel that captures the complexities of the war in Ukraine, focusing on the siege of Mariupol (Feb ’22 – May ’22) and the brave people who stayed to defend their city against Russian forces as well as the resulting effects on global politics. A city ruined. In once quiet residential streets, two armies battle, driving people into cellars and basements with little food or water. No lights or heat. Dwindling medical supplies. Shells and bullets deliver cruel, random death to the young and old, men, women, and children. This is Mariupol, a Ukrainian city and early target of Russia’s invasion of Ukraine. Bordering Russian-occupied territory, the coastal city seemed doomed to a defeat that would come within days, if not hours. Could Mariupol, and Ukraine, survive? As Russian rockets threatened the city, Ukrainians resisted, and with a heroic combination of sacrifice and bravery, the besieged city endured . . . for months. But it all came at a steep cost. With compassion and his keen journalist’s eye, Sibert Honor creator Don Brown illuminates the horrors of Mariupol and the depredations of its people not seen in the city since World War II. He also shows that outside of Mariupol, the city’s agonies were mirrored by similar events occurring in towns and cities across Ukraine. 83 Days in Mariupol reminds us that the bloody defiance shown at The Alamo, Dunkirk, Leningrad, and Thermopylae isn’t confined to the past but has a violent, modern presence. It is the story of senseless destruction, patriotism, and grit against long odds—a brutal battle whose consequences still reverberate across Ukraine and continue to reshape the global political landscape. Don Brown is the YALSA excellence in nonfiction and Sibert Honor award-winning author and illustrator of many nonfiction graphic novels for teens and picture book biographies. He has been widely praised for his resonant storytelling and his delicate watercolour paintings that evoke the excitement, humor, pain, and joy of lives lived with passion. School Library Journal has called him “a current pacesetter who has put the finishing touches on the standards for storyographies.” He lives in New York with his family. 128pgs colour hardcover.\nAdherent\nby Chris W. Kim\nConundrum Press\n$20.00\nThe publisher says:\nA poignant fable about a young woman who is captivated by a set of recently discovered notebooks and leaves her isolated community to search for their author—a journey that ultimately makes her question what she wants and what she’s willing to leave behind. The residents of an isolated village in a dreamlike world scavenge for supplies in the surrounding forest, collecting scattered items left over from a time long past. No one strays far from this community, fearing what may lie beyond it. When they find a stack of notebooks by an unknown author, a young villager becomes obsessed with their contents. She sets out on a quest to find the writer. As she ventures into the unknown, she discovers a world both barren and increasingly complex. The closer she gets to her goal, the more she realises that the encounter she’s been seeking probably won’t be what she wanted. In Adherent, Chris W. Kim (Herman by Trade, Strays) brings us a fabular tale that examines the ways we connect—and the ideas and places we value—in our own increasingly disconnected world. Chris W. Kim is a cartoonist and illustrator from Toronto, Ontario. Influenced by comics and animation, he pursued his interest in drawing at OCAD University where he studied fine art before switching to illustration. He has worked for clients such as The New York Times, The Hollywood Reporter, Popular Mechanics and Maisonneuve Magazine, among others. His first graphic novel, Herman by Trade (SelfMadeHero), was published in 2017, followed by Strays (SelfMadeHero) in 2021. 220pgs B&W paperback.\nAnaïs Nin: A Sea of Lies\nby Léonie Bischoff, translated by Jenna Allen\nFantagraphics\n$29.99\nThe publisher says:\nIn lithe, sensuous coloured pencils, this international prize-winning, impressionistic graphic biography traces the life, the affairs, and the artistic process of Anaïs Nin, one of the best-known authors of women’s erotica in the 1920s and ‘30s. Anaïs Nin, the author of works such as Delta of Venus and House of Incest, is the patron saint of taboo-breaking pop culture sexual iconoclasts. Not only is she an inspiration for contemporary figures such as Madonna, but her oeuvre, which encompasses erotica, autobiography, essays, short fiction, novels, and much more, has been adapted into film (Henry and June), television (Little Birds), and other media. The cartoonist Léonie Bischoff traces the life of the prolific writer in this lushly coloured graphic novel. It begins with Nin struggling to reconcile the man she married (who had artistic aspirations) with the banker she finds herself living with in the Parisian suburbs. Soon, her obsession with June Miller leads to inspiration. Nin’s life and art, the truth and fiction, are further intertwined as she recounts her many sexual liaisons including those with Henry Miller (whom she and her husband subsidise so he can write the controversial Tropic of Cancer), her psychoanalysts and even her father. Although Bischoff’s drawing is largely representational, she occasionally depicts Nin’s sexual experiences in scenes as surreal as Nin’s own written portrayal of them. Swiss cartoonist Léonie Bischoff received a diploma in comics from the Saint-Luc Institute in Brussels, where she still lives. Anaïs Nïn: A Sea of Lies, her 2020 graphic biography, won the Audience Favourite prize at the Angoulême International Comics Festival. Other works include Hoodoo Darlin’, Princess Suplex and more. She is a member of the Comics Creators Against Sexism Collective. Jenna Allen is a freelance translator based in Colorado. 200pgs colour hardcover.\nBlessed Cure\nby Mário César\nSoaring Penguin Press\n$39.99\nThe publisher says:\nSince he was a child, Acacio do Nascimento was a different boy from others. He preferred playing with dolls to playing soccer, the hula hoop interested him more than cowboy pistols. Scared by the possibility of their son was a homosexual, Mara and Galdino submit Acacio since he was five years old to several treatments for him to become a normal boy like the others. In 1990 the World Health Organisation (WHO) stopped considering homosexuality a disease. Based on this understanding, a 1999 resolution by the Brazilian Federal Council of Psychology prohibited professionals from applying therapies to try to change sexual orientation in Brazil. Even so, the so-called ‘gay cure’, time and again, comes into the spotlight due to the greed of those who aim to profit from ignorance and prejudice. Conservative groups want to subject perfectly healthy people to abusive treatments and, often, homosexuals themselves subordinate themselves to medieval methods to live up to the expectations of others. Blessed Cure narrates Acacio’s life through the decades since the 1960’s. Each chapter shows the provocations of other children at school, the awakening of his sexuality as a teenager, the demands of his parents for him to fit in with the standards dictated by the majority, the beginning of his adult life, the first time he falls in love with another man, the persecution of the Brazilian military dictatorship against LGBTQ+ people, the prejudice in the workplace and the dilemma between following his most intimate instincts or going according to what society imposes and marrying a woman. Discover if Acacio will keep on living a heteronormative life he never chose for himself or if he’s going to live his truth. Mário César is an awarded comic book author from Brazil. He publishes comics since 2006 and he was one the first openly gay authors to address issues of sexual and gender diversity in Brazilian comics with the book Ciranda da Solidão (2013). He is also one of the creators and producers of POC CON, the first Brazilian LGBTQ+ Comic Con. 312pgs colour paperback.\nBlood of the Virgin\nby Sammy Harkham\nPantheon\n$30.00\nThe publisher says:\nAfter fourteen years, renowned and beloved graphic novelist Sammy Harkham finally delivers his epic story of artistic ambition, the heartbreak it can bring, and what it means to be human. Set primarily in Los Angeles in 1971, Blood of the Virgin is the story of twenty-seven-year-old Seymour, an Iraqi Jewish immigrant film editor who works for an exploitation film production company. Sammy Harkham brings us into the underbelly of Los Angeles during a crucial evolutionary moment in the industry from the last wheeze of the studio system to the rise of independent filmmaking. Seymour, his wife, and their new baby struggle as he tries to make it in the movie business, writing screenplays on spec and pining for the chance to direct. When his boss buys one of his scripts for a project called Blood of the Virgin and gives Seymour the chance to direct it, what follows is a surreal, tragicomic making-of journey. As Seymour’s blind ambition propels the movie, his home life grows increasingly fraught. The film’s production becomes a means to spiral out into time and space, resulting in an epic graphic novel that explores the intersection of twentieth-century America, parenthood, sex, the immigrant experience, the dawn of early Hollywood, and, shockingly, the Holocaust. Like a cosmic kaleidoscope, Blood of the Virgin shifts and evolves with each panel, widening its context as the story unfolds, building an intricate web of dreams and heartbreak, allowing the reader to zoom in to the novel’s core: the bittersweet cost of coming into one’s own. Sammy Harkham is an award-winning cartoonist and editor, born and raised in Los Angeles. He studied at the California Institute of the Arts and the Mayanot Institute in Jerusalem, where he created the ongoing comics anthology Kramers Ergot, considered to be one of the most influential publications of its kind. His first collection of short comics stories, Everything Together, won the 2012 Los Angeles Times Book Prize for Best Graphic Novel. Harkham’s work has been published in The Best American Comics, The New York Times, Vice and McSweeney’s, among many other publications. He divides his time between Los Angeles and Sydney. 296pgs colour hardcover.\nCharisma’s Turn: A Story of Girls and their Gifts\nby Monique Couvson & Amanda Jones\nThe New Press\n$19.99\nThe publisher says:\nFrom the award-winning author of Pushout, an inspiring graphic novel about what can happen when Black girls are given the opportunity to find their genuine power. Monique Couvson’s trailblazing book Pushout laid the groundwork for understanding how our schools are failing Black girls; her follow-up, Sing a Rhythm, Dance a Blues, provided a blueprint for their healing and liberation. Now Couvson invites readers to be inspired by her liberatory imagination with an original narrative told from the perspective of the very girls she has been fighting for years to lift up. Charisma’s Turn is a graphic novel that follows the dynamic story of Charisma, a Black high school student who is grappling with mounting pressures from home and school. When frustrations with her family intersect with a conflict at school, she reaches a crossroads, facing a choice that could change her future. Featuring vibrantly illustrated art from Amanda Jones and a foreword by poet, artist, and arts educator Susan Arauz Barnes, this book will appeal to teens, parents, educators, librarians, and more. Charisma’s Turn exemplifies how Black girls can be truly empowered to reach their full potential when they have supportive educators and community members in their corner. Monique Couvson (formerly Monique W. Morris), president/CEO of Grantmakers for Girls of Color and co-founder of the National Black Women’s Justice Institute, is the author of several books, including Pushout; Black Stats; Sing a Rhythm, Dance a Blues; and Charisma’s Turn (all from The New Press). Her work has been featured by NPR, the New York Times, MSNBC, Essence, The Atlantic, TED, the Washington Post, Education Week and others. She lives in New York. 128pgs colour hardcover.\nConstellations\nby Kate Glasheen\nHippo Park\n$22.99 / $14.99\nThe publisher says:\nA debut graphic novel about a queer teen living in the margins who is determined to find their way ahead. Are you supposed to be a boy or a girl? It’s a question that follows Claire everywhere. Inescapable on the street, in school, and even at home. A black hole forever trying to pull them in. But as long as they have ride-or-die best friend Greg at their side and a drink in their hand, everything will be okay. Right? Except, Claire can never have just one drink. And when harassment at school reaches a fever pitch, Claire begins a spiral that ends in court-ordered rehab. Feeling completely lost, Claire is soon surrounded by a group of equally messed up, equally hilarious new friends and, with the help of a patient counselor, finds a space to unpack all the bad they’ve experienced. But as Claire’s release gets closer so does the question: Can Claire stay sober and true in a world seemingly never made for them? Set in 1980s Troy, New York, Constellations is a portrait of a queer teen living in the margins but determined to find their way ahead. Done in watercolor and ink, debut author-artist Kate Glasheen has created a world where strong lines meet soft color, and raw emotions meet deep thought in this story of hope, humor, and survival. Kate Glasheen was born and raised in Troy, New York and lived there until their departure for Pratt Institute for a BFA in Fine Art. Kate has since been a creator, artist, and contributor for several critically acclaimed books, participated in exhibitions and collections across the globe, and worked on several of the biggest properties in entertainment. Their artistic interests find communion in fine and sequential art under the notion that there’s something hilarious about something that’s not funny at all. Constellations is their author-artist debut. Kate lives, draws, and tattoos out of Philadelphia under the stringent supervision of Kipper the Cat. 224pgs colour hardcover / paperback.\nDaughter of Snow and Cinders\nby Nuria Tamarit, translated by Jenna Allen\nFantagraphics\n$29.99\nThe publisher says:\nPrincess Mononoke meets Jack London in this gritty, ecofeminist adventure. Fleeing the fires of her war-torn homeland, a young woman travels to the New World in search of gold to rebuild her life. In this strange, lawless land, Joana encounters friends (the kind Native women Tala and Opa), foes (the cruel gold hunter Matwei and his men), and an unexpected traveling companion who may just be her good luck charm ― and amidst the icy reaches of the wilderness, a fearsome fantastical beast lurks in the shadows. The English debut of Spanish cartoonist and illustrator Núria Tamarit, Daughters of Snow and Cinders conjures the awesome natural beauty of the frozen north in vibrant colour. A rugged adventure story with two strong young women at its heart, this graphic novel offers a poignant message about the urgent need for humanity to overcome our greed and base impulses to be good stewards of the world in which we live and depend on. Núria Tamarit is an illustrator and comic artist based in Valencia. Her graphic world is marked by fantastical elements, voluptuous plant forms, dreamy creatures, and powerful female characters. Her previous books include Two Coins (Dos Monedas, 2019, winner of the first Valencia Graphic Novel Award) and Giantess (Géante, 2020, with Jean-Christophe Deveney). Jenna Allen is a freelance translator based in Colorado. 216pgs colour hardcover.\nDesegregating Comics: Debating Blackness in the Golden Age of American Comics\nby various writers, edited by Qiana Whitted\nRutgers University Press\n$79.95 / $34.95\nThe publisher says:\nSome comics fans view the industry’s Golden Age (1930s-1950s) as a challenging time when it comes to representations of race, an era when the few Black characters appeared as brutal savages, devious witch doctors, or unintelligible minstrels. Yet the true portrait is more complex and reveals that even as caricatures predominated, some Golden Age comics creators offered more progressive and nuanced depictions of Black people. Desegregating Comics assembles a team of leading scholars to explore how debates about the representation of Blackness shaped both the production and reception of Golden Age comics. Some essays showcase rare titles like Negro Romance and consider the formal innovations introduced by Black comics creators like Matt Baker and Alvin Hollingsworth, while others examine the treatment of race in the work of such canonical cartoonists as George Herriman and Will Eisner. The collection also investigates how Black fans read and loved comics, but implored publishers to stop including hurtful stereotypes. As this book shows, Golden Age comics artists, writers, editors, distributors, and readers engaged in heated negotiations over how Blackness should be portrayed, and the outcomes of those debates continue to shape popular culture today. 368pgs B&W hardcover / paperback\nDiana: My Graphic Obsession\nby Sivan Piatgorsky-Roth\nStreet Noise Books\n$19.99\nThe publisher says:\nA unique perspective on the life of Diana, Princess of Wales, the beloved icon of many people in the LGBTQ community and beyond. Sivan Piatigorsky-Roth is obsessed with Princess Diana, in the specific, laser-focused way an autistic person can be. This book is an unorthodox biography of Diana Spencer told through a particular autistic and transmasculine lens, examining issues of identity and self-determination, and the mythological parallels in the lives of the royal family and the author. Sivan Piatigorsky-Roth was born and raised in Toronto, Ontario, and graduated from Wesleyan University in Middletown, Connecticut, where he studied art and English literature. He has published cartoons in The New Yorker among other places. Having spent a year working as a teacher in a Jewish day school, Sivan is now a Rabbinical student at Hebrew College in Newton, Massachusetts. This is his debut graphic novel. 148pgs two-colour paperback\nDiceman Complete Edition\nby John Wagner, Pat Mills, Kevin O’Neill, Bryan Talbot, David Lloyd, Steve Dillon, Mike Collins & Hunt Emerson\nRebellion / 2000AD\n£39.99 / $49.99\nThe publisher says:\nOriginally published during the adventure gamebook boom of the 1980s, Dice Man has never been reprinted in its entirety before, but now the complete run of Dice Man magazine is presented in this massive collection. Using dice and a pencil, you will become Judge Dredd as he faces off against the Dark Judges, or guide Nemesis the Warlock as they race through the Torture Tube, or help Sláine steal the Cauldron of Blood from the Tower of Glass. Pat Mills is the creator and first editor of 2000AD. He developed Judge Dredd and is the writer-creator of many of 2000AD’s most popular stories such as Sláine, Nemesis and A.B.C. Warriors. Amongst his credits are Marshal Law, (Marvel and D.C. Comics) co-created with Kevin O’Neill, the French graphic novel series Requiem, Vampire Knight with artist Olivier Ledroit, and Be Pure! Be Vigilant! Behave! The Secret History of 2000AD and Judge Dredd. His current projects include Joe Pineapples: Tin Man, illustrated by Simon Bisley and Clint Langley, Spacewarp, and Kiss My Axe! The Secret History of Sláine the Warped Warrior.\nJohn Wagner has been scripting for 2000 AD for more years than he cares to remember. His creations include Judge Dredd, Strontium Dog, Ace Trucking, Al’s Baby, Button Man and Mean Machine. Outside of 2000 AD his credits include Star Wars, Lobo, The Punisher and the critically acclaimed A History of Violence.\nBryan Talbot is one of the UK’s most respected comics artists. He has contributed to Future Shocks, Judge Dredd, Nemesis the Warlock, Ro-Busters and Sláine in the Galaxy’s Greatest Comic, and most recently wrote and illustrated a silent One-Off. Beyond 2000 AD, Talbot is renowned for his body of graphic novel work, which includes The Adventures of Luther Arkwright, Heart of Empire, The Tale of One Bad Rat and Alice in Sunderland.\nKevin O’Neill is a 2000 AD legend. From working as an art assistant on the very first prog, he quickly became involved in the creative side of the comic, co-creating classics like A.B.C. Warriors, Bonjo From Beyond The Stars, Metalzoic and Nemesis the Warlock. O’Neill has also written for the comic on strips including Dash Decent, Future Shocks, One-Offs, Tharg the Mighty and has illustrated Future Shocks, Judge Dredd, M.A.C.H. 0, One-Offs, Ro-Busters, Ro-Jaws’ Robo-Tales, Tharg the Mighty and Torquemada. Outside the Galaxy’s Greatest Comic, O’Neill was briefly notorious as the only artist ever to have his work rejected wholesale by the Comics Code Authority! Happily, his notoriety quickly became fame and acclaim, as his work on strips like Marshal Law and most recently The League of Extraordinary Gentlemen have raised him to a very high profile. O’Neill’s other work includes Green Lantern and Batman.\nSteve Dillon is a fan-favourite 2000 AD writer and artist, and the creator of both Hap Hazzard and the Irish Judge Joyce. His writing for the Galaxy’s Greatest Comic includes Future Shocks and Rogue Trooper, while Dillon’s pencils have graced A.B.C. Warriors, Bad Company, Judge Dredd, Harlem Heroes, Ro-Busters, Rogue Trooper and Tyranny Rex. Dillon shot to international superstardom as a result of his work on DC/Vertigo’s Preacher, co-created with 2000 AD’s Garth Ennis. 320pgs B&W with some colour paperback.\nEnlightened Transsexual Comix\nby Sam Szabo\nSilver Sprocket\n$24.99\nThe publisher says:\nThe definitive collection of Sam Szabo’s ETC comics series, serving up a psychedelic stew of social satire and gonzo gender theory! The year is 2023. The astral plane has entered a tailspin. Fortunately, an ancient cosmological entity is on a mission to spread her fluidity across the galaxy. Our raw, uncut heroine roams the wasteland in defense of trans rights and trans wrongs. Will the Enlightened Transsexual convince humanity to chill out at last? Or will the planet choke on her filthy gags? Sam Szabo is a beautiful cartoonist from the North Shore of Massachusetts. She has self-published dozens of comics, including Momix, Girl Hell and Comics Will Break Your Balls. Sam currently resides in Chicago, IL. 128pgs colour hardcover.\nEtoile: The World of Princesses & Heroines\nby Macoto Takahashi\nPie International\n$69.00\nThe publisher says:\nGentle and dignified princesses with sparkly eyes bring you into Macoto’s art world. This is the third collection of Macoto Takahashi’s artworks to celebrate his 70th anniversary as an artist in 2023. Macoto has created many works on the theme of princess heroines in different kinds of fairy tales. His works abound with flowers and animals filled with loving prayers that remind us that all life is precious and each and every creature deserves equal happiness. This is why Macoto’s fans named the artist’s unique utopian worldview “Macotopia”, a world that the artist continues to pursue even today. This book includes a selection from Macoto’s iconic large format works complete with the J/E bilingual introduction at the end of each article. Macoto Takahashi was born in Osaka on August 27, 1934. His first work as a manga artist, Slave Princess, was published in 1953 and showed his talent in illustration. The artist’s themes, which include ballet and princesses, along with his beautiful use of colours, have been adored by young girls and easily won him popularity. Many of Macoto’s works are centered on dress-up dolls and coloring books, and his heroines’ sparkly eyes, flowers and ribbons have become the hallmarks of Macoto’s Shojo, which took the world by storm. Meanwhile, his artwork is also found on a large range of items appealing to young girls: handkerchiefs, shoes, undergarments, handbags, stationery such as pencils and pencil cases, notebooks and even bicycles. 184pgs colour oversized hardcover.\nEvery Day: The Graphic Novel\nby David Levithan & Dion MBD\nKnopf Books for Young Readers\n$24.99 / $17.99\nThe publisher says:\nA graphic novel adaptation of the groundbreaking, beloved New York Times–bestselling novel about a teen who wakes up in a different body each day and the love that eludes them. Every day a different body. Every day a different life. Every day in love with the same girl. There’s never any warning about where it will be or who it will be. A has made peace with that—even established guidelines by which to live: Never get too attached. Avoid being noticed. Do not interfere. It’s all fine until the morning that A wakes up in the body of Justin and meets Justin’s girlfriend, Rhiannon. From that moment, the rules by which A has been living no longer apply. Because finally A has found someone they want to be with—day in, day out, day after day. But can Rhiannon love someone who is destined to change every day? For the first time on the page, A’s epic story will be brought to life as a graphic novel, with illustrations by Dion MBD. David Levithan is a children’s book editor in New York City and the author of several books for young adults, including Lambda Literary Award winner Two Boys Kissing, Nick & Norah’s Infinite Playlist and Dash & Lily’s Book of Dares (co-authored with Rachel Cohn); Take Me with You When You Go (co-authored with Jennifer Niven); Will Grayson, Will Grayson (co-authored with John Green); and Boy Meets Boy, among many other novels for teens and kids. In 2016, David was named the recipient of the Margaret A. Edwards Award. He lives in Hoboken, New Jersey. Dion MBD (short for Dionisius Mehaga Bangun Djayasaputra) is an Indonesian illustrator/designer who lives and works between Brooklyn and Bandung. Dion received his illustration BFA from Ringling College of Art and Design in Florida, where he grew his fascination with clouds. In his downtime, Dion is either cooking, listening to John Mayer or cloud-watching. 208pgs colour hardcover / paperback.\nGeorge’s Run: A Writer’s Journey through the Twilight Zone\nby Henry Chamberlain\nRutgers University Press\n$49.95 / $24.95\nThe publisher says:\nGeorge Clayton Johnson was an up-and-coming short story writer who broke into Hollywood in a big way when he co-wrote the screenplay for Ocean’s Eleven. More legendary works followed, including Logan’s Run and classic scripts for shows like The Twilight Zone and Star Trek. In the meantime, he forged friendships with some of the era’s most visionary science fiction writers, including Ray Bradbury, Theodore Sturgeon, Richard Matheson and Rod Serling. Later in life, Johnson befriended comics journalist and artist Henry Chamberlain, and the two had long chats about his amazing life and career. Now Chamberlain pays tribute to his late friend in the graphic novel George’s Run, which brings Johnson’s creative milieu to life in vividly illustrated colour panels. The result feels less like reading a conventional biography and more like sitting in on an intimate conversation between friends as they recollect key moments in pop culture history, as well as the colourful band of writers known as the “Rat Pack of Science Fiction.” Henry Chamberlain is a writer and artist whose work includes comics, illustration and graphic recording. He maintains the pop culture website Comics Grinder, though which he first met George. 226pgs colour hardcover / paperback.\nHogbook and Lazer Eyes\nby Maria Bamford & Scott Marvel Cassidy\nFantagraphics\n$19.99\nThe publisher says:\nFans of Maria Bamford’s acclaimed quasi-autobiographical Lady Dynamite Netflix series already know of her romance with LA painter Scott Marvel Cassidy, as well as her droll pug sidekicks Blueberry and Bert. Now the story has been recounted in the graphic novella Hogbook and Lazer Eyes, written by Bamford/Cassidy, drawn by Cassidy, and all told by the rescue dogs they’ve adopted. For those unfamiliar with the story, newly single fortysomethings Maria Bamford and Scott Cassidy each signed up on the dating site O.K. Cupid, under the respective usernames “Hogbook” and “Lazer Eyes.” They went on a date, and then another, and soon, despite a history of Bipolar II disorder and unhealthy relationships for each of them, they fall in love and are married in 2015. We view all of this through the prism of their pug housemates, including Blueberry and Bert (who has an unnatural obsession with Michael Flatley of Riverdance fame), and the elderly bonded pair Betty and Arnold (who recount their star turn as interplanetary canine scientists in the second season of Lady Dynamite). Cassidy’s fine art training translates with ease into graphic storytelling, with a naturalistic illustrative style that is a pitch-perfect match Bamford’s comic timing, making Hogbook and Lazer Eyes a beautifully illustrated love story, told by some incredibly charming pugs. Maria Bamford is a writer, actor and stand-up comedian. Scott Marvel Cassidy is a graduate of the Pennsylvania Academy of the Fine Arts whose work has been exhibited in New York, Los Angeles, Philadelphia and elsewhere. Maria Bamford and husband, Scott Marvel Cassidy, live in Los Angeles, CA. 64pgs colour hardcover.\nImpossible People: A Completely Average Recovery Story\nby Julia Wertz\nBlack Dog & Leventhal\n$30.00\nThe publisher says:\nIn her keenly observed graphic memoir Impossible People, celebrated cartoonist Julia Wertz chronicles her haphazard attempts at sobriety and the relentlessly challenging, surprisingly funny and occasionally absurd cycle of addiction and recovery. Opening at the culmination of a disastrous trip to Puerto Rico, the first page of Impossible People finds Julia standing stupefied in the middle of the jungle beside a rental jeep she’s just crashed. From this moment, the story flashes back to the beginning of her five-year journey towards sobriety that includes group therapy sessions, relapses, an ill-fated relationship, terrible dates and an unceremonious eviction from her New York City apartment. Far from the typical addiction narrative that follows an upward trajectory from rock bottom to rehab to recovery, Impossible People portrays the lesser told but more common story: That the road to recovery is not always linear. With unflinching honesty and a healthy dose of humour, Wertz details the arduous, frustrating and hilarious story of trying and failing and trying again. Julia Wertz is a professional cartoonist, amateur historian and part-time urban explorer. Her books include The Fart Party, Museum of Mistakes, Drinking at the Movies, The Infinite Wait and Other Stories and Tenements, Towers, & Trash: An Unconventional, Illustrated History of New York City. She does monthly comics and doodles for the New Yorker and the New York Times. After leaving New York City, she settled down in Northern California with Oliver (yes, that Oliver) and their son, Felix. 320pgs B&W hardcover.\nI Thought You Loved Me\nby MariNomi\nFieldmouse Press\n$30.00\nThe publisher says:\nJodie was Mari’s best friend through their teens and twenties. As young Mari began to explore her identity as a bisexual, biracial outsider in a rich, white town, Jodie was her constant confidant, even kissing Mari out of the closet. The two were inseparable as they sought to gain a foothold in life and love as young feminists, Jodie an entrepreneurial sex worker, and Mari working in the boys’ club of video game development in the late ‘90s. Then, suddenly and mysteriously, Jodie ends their friendship. Years later, Mari is stunned when she discovers why. Now much older, Mari is ready to forgive, but her memories of Jodie seem to have vanished. Through journal excerpts, letters, conversations with friends, and cross-country travel, she pieces together lost memories from a lost friendship in an attempt at catharsis. The reader follows in real-time as the author unravels her own mystery, examining the expectations of friendship, the unreliability of memory, and the struggle to let go. 324pgs colour softcover.\nLight Carries On\nby Ray Nadine\nDark Horse\n$19.99\nThe publisher says:\nWhen Leon’s camera unexpectedly breaks, he is forced to borrow a used one from his mom’s antique store. As he snaps the first picture, the ghost of the camera’s former owner is released and the two are inexplicably linked. After taking Leon’s body for an accidental joy ride, the ghost introduces himself as Cody, a queer punk rocker who died decades ago. Of course, he doesn’t remember how he wound up dead but the two decide investigating might be the only way to end the haunting. Leon has been reeling from a recent break-up with his boyfriend, recovering from his time in the military, and trying to become a photographer who can afford to take pictures of something more than high school proms and weddings. So being the only one able to see and talk to a ghost that died before cellphones, Wikipedia, or iTunes seems like a great way to fill his ample free time. The two get closer as they travel around Chicago showing each other the landmarks of their pasts and trying to unearth the secrets around Cody’s mysterious death. They discover they have much more in common than expected as they explore the complexities of life, love, and afterdeath, taking breaks to jam out to tunes, hang out in planetariums, and slurp down tasty frozen beverages. Cartoonist Ray Nadine (Station Six, Raise Hell, Messenger) has created an unmissable graphic novel that balances out themes of trauma, grief, and toxic relationships with radical empathy, queer joy, and healing. Ray Nadine was born and raised in central Illinois, and was drawing as soon as they could hold a pencil. They knew from a young age that they wanted to tell stories, and after years of growing up on manga and webcomics, they pursued an art education at Southern Illinois University of Edwardsville. After graduation, they launched their ongoing webcomic, Dollhouse, in January 2013 and have been publishing two pages a week until Summer 2017. In fall of 2017, they quit their day job to be a full-time freelance comic artist working on Messenger with Paul Tobin, published by Webtoon. They’ve been in a handful of anthologies, including EVERYTHING IS GOING WRONG, edited by Mark Bouchard, and Local Haunts, edited by Kara Lais. Ray is also the artist for Raise Hell!, written by Jordan Alsaqa. Ray has made a bunch of mini-comics and zines over the years too. 264pgs colour hardcover.\nListen, Beautiful Márcia\nby Marcello Quinitanilha, translated by Andrea Rosenberg\nFantagraphics\n$29.99\nThe publisher says:\nListen, Beautiful Márcia is a gripping story about a family pushed to the brink. This English language debut was the 2022 “Fauve d’Or” winner at the 2022 Angoulême Comics Festival. Márcia is a nurse in a hospital near Rio and lives in a favela with her boyfriend, Aluisio, and her daughter, Jaqueline, whom she had very young with another man. Jaqueline, a troubled young adult, makes life difficult for her mother and Aluisio and rebelliously hangs out with members of a neighborhood gang, leading to violent altercations between mother and daughter. The situation degenerates even more when Jaqueline is arrested. Márcia and Aluisio, distraught, realise that Jaqueline is in deeper trouble than they ever thought. Listen, Beautiful Márcia is a fast-paced, flamboyantly colourful new graphic novel by one of the most important Brazilian graphic novelists working today. Marcello Quintanilha’s first English-language graphic novel is a tour de force ― a tightly wound drama filled with masterful suspense and a deep love for family and character. Marcello Quintanilha was born in 1971 outside Rio de Janeiro. His first graphic novel, Tungsteno, published in 2015, was adapted for film by director Heitor Dhalia. He has lived in Barcelona since 2002. Andrea Rosenberg is a translator who has worked on a variety of novels and graphic narratives in Spanish and Portuguese. Her translations of the graphic novels Run For It by Marcelo D’Salete and The House by Paco Roca won Eisner Awards in 2018 and 2020, respectively. 128pgs colour hardcover.\nLost in Taiwan\nby Mark Crilley\nLittle Brown / Ink\n$24.99 / $17.99\nThe publisher says:\nA story about stepping out of your comfort zone—literally—on an unlikely journey to making new connections and learning to explore the big wide world around you, Lost In Taiwan is the latest from celebrated graphic novelist Mark Crilley. This wasn’t Paul’s idea. The last thing he’s interested in is exploring new countries or experiencing anything that might be described as “cultural enrichment.” But like it or not, he’s stuck with his brother, Theo, for two weeks in Taiwan, a place that—while fascinating to Theo—holds no interest to Paul at all. While on a short trip to a local electronics store, Paul becomes hopelessly lost in Taiwan’s twisting, narrow streets, and he has no choice but to explore this new environment in his quest to find his way back to Theo’s apartment. In an unfamiliar place with no friends—and no GPS!—there’s no telling what adventures he could happen upon. And who knows? Maybe it turns out he has friends in Taiwan, after all. Mark Crilley is the author and illustrator of more than forty books, including several acclaimed graphic novels, for which he has received fourteen Eisner Award nominations. His work has been featured in USA Today, Entertainment Weekly and on CNN Headline News. His popular YouTube videos have been viewed more than 400 million times. He lives in Michigan with his wife, Miki, and children, Matthew and Mio. 256pgs colour hardcover / paperback.\nMemento Mori\nby Tiitu Takalo, lettered by Crank!\nOni Press Inc.\n$24.99\nThe publisher says:\nA moving graphic memoir about life, art and the search for happiness after surviving a cerebral hemorrhage at age thirty-eight. In Memento Mori, celebrated Finnish graphic novelist Tiitu Takalo chronicles her sudden, unexpected cerebral hemorrhage and the long road to recovery she had to travel. It is a dramatic story about a life turned upside down overnight: a ruptured cerebral aneurysm, the days and nights spent in an intensive care unit and the long, painful recovery that led the artist to reflect on her life both past and present. Much more than a story of survival, Memento Mori is a philosophical and psychological journey told with exceptional honesty and compassion. A deeply moving and insightful graphic novel from a master of the medium that is also ultimately a celebration of life. Tiitu Takalo is the winner of the Finlandia Prize in comics. She has received the prestigious Puupäähattu Award in recognition of her work in comics. Her previous titles have been published in several languages. She lives and works in Finland. Christopher Crank (crank!) has lettered a bunch of books put out by Image, Dark Horse, Oni Press, Dynamite and elsewhere. He also has a podcast with comic artist Mike Norton and members of Four Star Studios in Chicago, and makes music [sonomorti.bandcamp.com]. 232pgs colour paperback.\nMy Port of Beirut\nby Lamia Ziadé, translated by Emma Ramadan\nPluto Press\n£18.99\nThe publisher says:\nOn the evening of August 4, 2020, an explosion tore through Beirut, leaving nearly 200 people dead, 6,000 injured, and 300,000 homeless. The blast was caused by storing thousands of tons of ammonium nitrate alongside a stash of fireworks—a deadly arrangement about which the government had known but done nothing. For six months straight, French Lebanese author and artist Lamia Ziadé wrote, illustrated, and recorded every new piece of information, every photograph of the wreckage or the wounded. In My Port of Beirut, Ziadé weaves together the play-by-play of the tragedy and the history of Lebanon with her own personal stories and her participation in the 2019 protests against state corruption, laying out the historical and political background that made such a catastrophe possible and, perhaps, inevitable. Lamia Ziadé is a Lebanese author, illustrator, and visual artist. Born in Beirut in 1968 and raised during the Lebanese Civil War, she moved to Paris at 18 to study graphic arts. She then worked as a designer for Jean-Paul Gaultier, exhibited her art in numerous galleries internationally, and went on to publish several illustrated books, including Ma très grande mélancolie arabe, which won the Prix France-Liban, Ô nuit, ô mes yeux and Bye bye Babylone. Winner of the English Pen Award. 240pgs colour paperback.\nMystic Debris\nby Justin Gradin\nFantagraphics Underground\n$39.99\nThe publisher says:\nWhen the band kicks him out and his wife and baby leave him, Whizbang travels to other planes of existence in an attempt to make peace with it all. A psychedelic walkabout by way of screwball comedy. Justin Gradin’s stunning debut graphic novel Mystic Debris and its cast of quixotics exist in a comics continuum with Gary Panter’s Jimbo, Mark Beyer’s Amy and Jordan and Marc Bell’s Shrimpy and Paul. Whizbang is a metalhead whose band, Fascinator, has left him for stardom. His wife, Planchette, has left with their newborn baby. He leaves himself for a shimmy up the astral projector stripper pole, to hang with cosmic dust bunnies in a quest for enlightenment, or at least in a quest to avoid a job at the door factory. Justin Gradin is a multidisciplinary artist whose practice encompasses painting, drawing, collage, sculpture, sound, music, animation, video and performance. As director, writer, producer and art department, Gradin has completed twenty music videos for companies such as Sub Pop, Converse Shoe Company and Domino Records to name a few. He lives in Vancouver, British Columbia. 156pgs colour hardcover.\nNiki de Saint Phalle: The Story of Her Life\nby Monica Foggia & Valeria Quattrocchi\nPrestel\n$24.95\nThe publisher says:\nThis graphic novel on de Saint Phalle tells the story of how a self-taught feminist artist became a worldwide sensation, a radical promoter of gender equity and a champion of social justice. Few artists’ lives are as inspiring as that of Niki de Saint Phalle. While she started her career as a fashion model, a subsequent breakdown led to her taking up painting as therapy. Entirely self-taught, Niki spent the rest of her years devoted to art that was based in emotional truth and a feminist point of view. This graphic novel follows Niki’s extraordinary career, from her early “shooting pictures,” in which she fired bullets at bags of paint, to the creation of the exuberantly formed life-sized dolls she called “Nanas,” which established her as an international success. The book also looks at her close collaborations with her husband and fellow artist Jean Tinquely; her painting, drawing, assemblage, performance art and large-scale installations; and her work in film, theatre and architecture. The texts explore how Niki tackled social and political issues and institutions— and show why her work remains as eloquent and powerful today as when it was first created. Looking beyond her brightly colored sculptures, this book tells the story of a woman who fought for a fairer world; a headstrong outsider, who made a name for herself in the male-dominated art world of the day; and an autodidact, who became one of the greatest artists of her time. Monica Foggia is a teacher, author, and radio presenter. She is helping produce a graphic novel on the artist Camille Claudel. Valeria Quattrocchi is an artist, illustrator and cartoonist. She lives in Puglia, Italy. 128pgs colour hardcover.\nPet Peeves\nby Nicole Goux\nAvery Hill Publishing\n£12.99 / $16.95\nThe publisher says:\nBobbie’s life is going nowhere fast. She’s working at a bar, wanting to play music but never having the time or energy. The only bright spot is her dog - always cheerful, always cuddly, and always there for her. As the relentless day-in, day-out of work piles up, music and roommates and social plans begin to seem less and less important as Bobbie struggles to make rent and have any time to be creative. The only thing she has time for outside her job is her dog and her dog is going to do everything he can to keep it that way. This debut solo graphic novel from breakout author Nicole Goux explores the struggles of a young artist - haunted not only by debt and society, but by more sinister (though adorable) canine forces. Nicole Goux (she/her) is an Eisner Award nominated illustrator and cartoonist from Los Angeles. She’s the artist of DC’s Shadow of the Batgirl and co-creator of Forest Hills Bootleg Society at Simon and Schuster, Everyone is Tulip at Dark Horse Comics and Fuck Off Squad at Silver Sprocket Bicycle Club. She has been published by DC, IDW and LionForge. Her work often explores the themes of coming of age, interpersonal drama and learning how to be a human. Lately she’s spent a lot of time in the house (like a lot a lot), but loves traveling the country selling her wares and making new friends. 104pgs two-colour paperback.\nSalome’s Last Dance\nby Daria Tessler\nFantagraphics\n$19.99\nThe publisher says:\nAn absurdist, psychedelic crime fantasy / graphic novella from an acclaimed artist and printmaker. The Astounding Magnus has been hypnotizing audiences at the Feedbag cocktail bar with his resplendent dancing dog act, Salome, and her “Serpentine Dance of the Seven Veils.” Yet despite his success, the pearl of life has lost its luster for Magnus. He visits the psychologist, Dr. Silkini, who promises to massage Magnus’s id into a higher dimension: the pearly gates of full life satisfaction. Meanwhile, Salome’s crowd-pleasing performances have attracted unwanted attention from sinister forces who want to know the dog’s secret. Daria Tessler’s new graphic novella, Salome’s Last Dance, showcases her phenomenal talent for incorporating elements of collage and pen-and-ink illustration to create a beautifully phantasmagoric experience under the guise of an absurdist, psychedelic fantasy (including an extended visual tour de force depicting a hallucinogenic tea trip), one that favourably compares to Yellow Submarine or the comics of Jim Woodring. Tessler’s rich ear for language and sharp sense of humour also liven every inventively stunning page of Salome’s Last Dance. Born in Finland, Daria Tessler is a cartoonist and printmaker based in Portland, OR. Her books include Cult of the Ibis, Loop of the Sun and Music of Changes. She also creates silkscreen prints, stationary and more that are found on her website. 56pgs B&W hardcover.\nThe 10,000 Disasters of Dort\nby Mike Butterworth, José Ortiz & José Gonzalez\nRebellion\n£14.99 / $16.99\nThe publisher says:\nThe aliens from Dort have lost their world and now they want Earth. It is the year 2000. In fifty years’ time the planet Dort will collide with its sun and be destroyed. Ratta, the dictator of Dort has chosen Earth as a new home for his people. But first he is creating ten thousand disasters to wipe out all human life. Only Britain’s best scientist, Professor Mike Dauntless, has the mind and spirit to stop Ratta from destroying humankind.\nMike Butterworth is primarily known in comic circles as the writer of The Rise and Fall of the Trigan Empire, but had previously written Battler Briton and Buffalo Bill strips for Comet, for Sun he wrote Max Bravo, The Happy Hussar and Billy the Kid (which was drawn by, amongst others, Don Lawrence). The Trigan Empire began in 1965 in Ranger, and continued when Ranger was absorbed into Look and Learn where it continued to be published through to 1982. From 1967 he also wrote crime novels under his full name, John Michael Butterworth, and gothic romances under the pseudonyms of Carola Salisbury and Sarah Kemp.\nJosé Ortiz Moya’s sixty plus year career began after he won a contest which ran in the Spanish magazine Chicos. In the 1950s he worked on many digest strips for Editorial Maga, including Capitan Don Nadie, Pantera Negra and Jungla. Agency work saw him produce several strips for foreign publishers, particularly in Britain where he illustrated Caroline Barker, Barrister at Law for the Daily Express, Smokeman and UFO Agent for Eagle magazine and the Phantom Viking in Lion. In the seventies and eighties Ortiz worked on several British popular strips including The Tower King and House of Daemon for the new Eagle, Rogue Trooper and Judge Dredd for 2000 AD and The Thirteenth Floor for Scream!, which he co-created with John Wagner and Alan Grant. Whilst doing all of this work on UK kids’ comics, in the US Ortiz was also working on and is arguably best known for illustrating several stories for Warren’s horror titles, including Eerie and Vampirella.\nSpanish artist Jose “pepe” Gonzalez started his career at the age of 17 working on Rosas Blancas and Brigitte for the company Editorial Toray. In the 1960s his worked graced several British publications – mainly girl’s titles including Valentine, Marilyn and Mirabelle. He also illustrated a comic adaption of the British TV series The Avengers. In the early 70s, he made an impact on the US comics’ scene, illustrating Vampirella for Warren Publishing and is still considered to be the definitive artist on the strip today. 80pgs B&W paperback.\nThe Abolition of Man\nby Carson Grubaugh, Midjourney A.I., Sean Michael Robinson & Luciano Floridi\nLiving the Line\n$35.00\nThe publisher says:\nConceived of and executed by fine-artist/educator/philosopher turned Eisner Award nominated cartoonist, Carson Grubaugh, The Abolition of Man Deluxe Edition collects all five issues of the groundbreaking series of the same name, the first comic series in history to be entirely illustrated by an Artificial Intelligence. In a series of four interwoven experiments, Grubaugh used Midjourney AI to interpret an essay by renowned thinker, C.S.Lewis, imagine a satirical dystopian future, illustrate an AI generated script, and finally, to produce graphics for an essay provided by Oxford Philosopher of Information and AI & Data Ethics policy advisor to the EU, UK, Google, etc., Luciano Floridi. All of these strands, alternately hilarious and terrifying, weave together to give a chilling peek into the world of the future, where humans and their most treasured passions have lost all purpose. This deluxe hardcover edition contains loads of exclusive content, including a reprint of the extremely rare Dall-E 2 variant edition of The Abolition of Man #1, in which the entire interior of issue #1 was re-illustrated using Dall-E 2. The collection also includes two pieces of philosophical writing produced by Grubaugh between 2007 and 2018 that were the source of inspiration for this project. These essays included predictions about the banal, content apocalypse AI is now making a reality. Also accompanying The Abolition of Man project are a series of long-form discussions about the ethics and impact of AI art with superstar guests Dave McKean (illustrator), NFN Kalyan (fine artist), John Mahoney (concept designer, filmmaker) and Luciano Floridi (Philosopher of Information, Data and AI Ethics policy maker). These are posted to Living The Line’s YouTube channel and linked in the book. This singular project will hold an important place not only in the history of comics but in the history of art, as it is the first of its kind to engage with the most important moment in the history of art since some wasteful cave-person blew juice at their hand on a wall instead of drinking it.\nCarson Grubaugh (Strange Death of Alex Raymond, The Abolition of Man) earned an MFA in Painting from the Cranbrook Academy of Art as well as BFAs in Fine Art and Philosophy from the University of California at Berkeley. He was named the Mercedes Benz Financial Services Emerging Artist of 2011, was a keynote speaker at the 2013 Difference That Makes a Difference Conference at the Open University, placed 3rd in the 15th Art Renewal Center Salon portraiture category, and has shown work at Kunstlerhaus Bethanien, ABTART, Virginia Beach Museum of Contemporary Art, Museum of New Art, Sotheby’s NY, the European Museum of Modern Art, among other venues. Carson is currently a Full-Time Instructor of Art at Shelton State Community College in Tuscaloosa, Alabama.\nLuciano Floridi currently holds a double appointment as professor of philosophy and ethics of information at the University of Oxford, and Professor of Sociology of Culture and Communication at the University of Bologna, Department of Legal Studies, where he is the director of the Centre for Digital Ethics. Starting in the Fall of 2023 Floridi will leave his position at Oxford to found the Digital Ethics Center at Yale University. Floridi is known for his work in the philosophy of information, digital ethics, the ethics of artificial intelligence and philosophy of technology, publishing several books and hundreds of articles on these topics. He has also consulted for Google, advised the European Commission on artificial intelligence, chaired a Parliamentary commission on technology ethics, and was recently awarded the highest honour the Italian government bestows, the Cavaliere di Gran Croce Ordine al Merito della Repubblica Italiana.\nSean Michael Robinson is a writer, illustrator, musician and former high school art teacher, as well as a man-about-town. In his brief time as an adult human he’s drawn hundreds of pages of comics, scribbled a gazillion portraits, sung two seasons as a mercenary Christmas caroler, performed on a hundred street corners, in a dozen plays and written and recorded nine albums. This is the very short list, leaving out as it does candy salesman, lifeguard, and other unsavory occupations. He is the founder and publisher at Living the Line Books. 228pgs colour hardcover.\nDave McKean says:\n“The Abolition of Man is a thorough test drive of AI image making, and the results are extraordinary, appalling, compelling, cold, hot, beautiful, repellant, and should be abolished.”\nThe Amazing Camel Toe\nby Claire Duplan\nBlack Panel Press\n$24.99\nThe publisher says:\nConstance, a modern, young illustrator, takes revenge for the thousands of attacks suffered daily by women with a comic of her own, titled The Amazing Camel Toe, celebrating the adventures of an anti-macho vigilante in tight, panther leggings: A hero who battles against sexism, harassment, slut-shaming and unrealistic standards of beauty. A form of release that could materialize in a publishing deal for Constance… But in order for that to happen, the author, often full of doubt, must dare to assert herself more. Luckily, she’s supported by her gang of girlfriends, her boyfriend, her favorite band and not to mention Camel Toe herself: who says this comic-book bombshell can’t exist in real life? Gently provocative, cheerfully fierce and borderline punk, Claire Duplan has a style and a tone all her own, overflowing with humour and energy. 120pgs colour hardcover.\nThe Color of Always: An LGBTQIA+ Love Anthology\nby various creators, edited by Brent Fisher & Michele Abounader\nA Wave Blue World Inc.\n$19.99\nThe publisher says:\n“Wherever you are, there is home.” The flutter of first dates, the thrill of a text-back, the heart-stopping seconds before coming out, and the rush when finally discovering who you truly are – all of these life-changing moments across the full spectrum of LGBTQIA+ experience are ready to explore in this bright and inspiring comics anthology! The Color of Always is a collection of personal stories, testimonies, heirlooms, evocations, and evangelisms for queer creators and readers that celebrates feeling good about who you are, and coming into your own at last. Featuring stories and art from Brent Fisher, Mario Cand",
  "word_count": 9219,
  "scraped_at": "2026-02-14T12:13:49.492386"
}