{
  "article_id": "fd598a942ef6",
  "url": "https://steelersnow.com/steelers-daily-news-links-terry-bradshaw-deserves-more-mike-tomlin-on-7-on-7/",
  "title": "Daily Links : Terry Bradshaw Deserves More ; Mike Tomlin on 7 - on - 7",
  "date": "20240423T093000Z",
  "domain": "steelersnow.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Steelers Daily News & Links: Terry Bradshaw Deserves More From Historians; Mike Tomlin on Impact of 7-on-7\nSteelers Daily News & Links: Your daily stop for all of the news and links from the Pittsburgh Steelers, NFL and around the Sports Now Group\n? Former Pittsburgh Post-Gazette writer Vito Stellino, who covered the Pittsburgh Steelers in the 1970s, thinks quarterback Terry Bradshaw deserves more from historians.\n“In the 1970s and 1980s, there were two quarterbacks who dominated the NFL, and each led a Team of the Decade – Terry Bradshaw in the 1970s and Joe Montana in the 1980s. Bradshaw won four Super Bowls in six years and repeated twice; Montana won four Super Bowls in nine years and repeated once. From 1974-89, they won eight of the 16 Super Bowls. … So you might think they’re ranked similarly in the pantheon of great quarterbacks. Surprisingly, they aren’t,” Stellino wrote on The Talk of Fame as a guest columnist.\n“Montana is considered one of the best quarterbacks in NFL history, generally ranked second to Tom Brady. In fact, when the Talk of the Fame Two conducted a recent poll of historians, Brady, Montana, John Unitas and Otto Graham were named to the Mt. Rushmore of quarterbacks.\n“I could live with that foursome if Bradshaw was considered No. 5. But historian John Turney recently put together a list of the Top Ten and didn’t include him, and I found another ranking on the internet where Bradshaw was only ranked 17th. I admit that I may not be the most objective observer since I covered his four Super Bowl years for the Pittsburgh Post-Gazette, but I am stunned at how underrated Bradshaw is.\n“To start with, he made long game-winning throws in the fourth quarters of two of his Super Bowl wins. Furthermore, he beat Hall-of-Famer Roger Staubach twice in Super Bowls … with a Team of the Decade on the line in the second … and twice was named a Super Bowl MVP.”\nMany have expressed recently that Terry Bradshaw deserves to have his No. 12 jersey officially retired with the Steelers. Given his career accolades, it’s hard to disagree that he deserves more recognition.\n? Steelers wide receiver George Pickens returned to his hometown of Hoover, Alabama to host the inaugural George Pickens youth football camp, according to WVTM 13.\nKids from eight to 15-years-old came out and took part in football drills and games along with getting to meet Pickens.\n“That means a lot to me because like you said, they look like me, they from where I’m from. So it’s kind of like I’m talking to myself. You see what I mean, that means a lot to me just to make kids dreams and, you know, give them a lane to where they could do anything. You see what I mean. So that’s kind of what the foundation is about, just for kids, you know, to find a way in life,” Pickens said.\n? The 2021 and 2022 quarterback draft classes are on their last legs.\nThe 2021 & 2022 Quarterback draft classes are on their last legs… pic.twitter.com/fc0wflz68L\n— Spotrac (@spotrac) April 22, 2024\n? Along with having have new uniforms, the Denver Broncos announced that they’ve brought back their 1977 throwbacks. They will be able to wear the throwback uniforms up to three times per season. The Steelers play the Broncos at Mile High in 2024, so it will be interesting to see if they wear their throwbacks for that game. It could be a prime time game with Russell Wilson set to return, also.\nThe ‘77 classics … are BACK! pic.twitter.com/xG8vtiC1Gf\n— Denver Broncos (@Broncos) April 22, 2024\n? Steelers quarterback Justin Fields posted a photo of the Pittsburgh city skyline at sundown on his Instagram Story.\nJustin Fields enjoying the Pittsburgh city skyline. #Steelers #NFL pic.twitter.com/BTq6XHxPoS\n— Blitzburgh (@Blitz_Burgh) April 23, 2024\n? Mike Tomlin acknowledged during his pre-draft press conference that high school 7-on-7 football has had a profound impact on the development of players in the 2024 NFL Draft, and for years to come.\nCoach Mike Tomlin acknowledges High School 7v7 Football and the Impact and Development the sport has had on players in the 2024 NFL Draft and for years to come 🔥🏈\n(via @steelers) @CoachTomlin pic.twitter.com/GCqFADBMO1\n— Prospect Media (@prospectmedia_) April 22, 2024\nNEWS FROM AROUND THE SPORTS NOW NETWORK\nPittsburgh Hockey Now: Penguins grades: Evgeni Malkin and what comes next.\nPittsburgh Baseball Now: Cruz, McCutchen back Jones’ strong start; Pirates snap losing streak wth win over Brewers.\nPittsburgh Sports Now: Pitt women’s basketball secures commitment from Colorado transfer guard.\nWest Virginia Sports Now: West Virginia football remains in contention for 2025 4-Star Florida safety.\nNittany Sports Now: Bo Nickal refutes report, not fighting June 1.\nPittsburgh Soccer Now: Much sharper in the final third, Riverhounds defeat defending champs, Phoenix, 3-1, for first win of season.",
  "word_count": 816,
  "scraped_at": "2026-02-14T13:14:06.393340"
}