{
  "article_id": "fd5e221882e4",
  "url": "https://www.bendigoadvertiser.com.au/story/8372684/clohesy-and-hamilton-strathfieldsayes-best-in-2023/",
  "title": "Clohesy and Hamilton Strathfieldsaye best in 2023",
  "date": "20231003T094500Z",
  "domain": "bendigoadvertiser.com.au",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Daniel Clohesy and Caitlyn Hamilton were the toast of Tannery Lane at Strathfieldsaye's presentation night.\nSubscribe now for unlimited access.\nor signup to continue reading\nClohesy won his first senior football best and fairest, claiming the Peter Crapper Medal on 98 votes in a tight count with Callum McCarty, who finished four votes behind on 94.\nHe was a consistent force in the Storm midfield in 2023, only twice having less than 20 disposals, both of which in rounds two and the first semi-final, he had 19 possessions.\nClohesy did plenty of the grunt work and was generally the man to get his hands on the footy first for the Storm, as shown by him having the sixth most handballs in the BFNL this season with 251 and second most hard ball gets with 89.\nHe was the Storm's best tackler, averaging 4.58 a game, ranked second in contested possessions (13.21) and clearances (5.79) and third for disposals (27.37).\nCallum McCarty came runners-up in the Peter Crapper Medal for the second year in a row.\nTo finish only four votes behind the winner when only playing ten regular season games due to Essendon VFL commitments shows how highly valued he is to the Storm.\nLuke Webb was named Most Consistent.\nHe averaged 29.38 disposals and only three times had less than 25 touches in a match.\nUnsung hero Lachlan Ratcliffe won the Most Valuable Player award, while Jake Moorhead was named best in finals.\nShannon Murphy (86 votes) claimed the reserves best and fairest ahead of Carson James, who polled 77 votes, while Sialoga Siu cracked the ton in terms of votes in the under-18s count, polling 106, with Jed Daniels finishing second on 91.\nDani Jeffrey was one of a few shining lights in a winless season for the Storm's senior women's side and deservedly won the best and fairest.\nIn the netball, a brilliant season for Caitlyn Hamilton has earned the Storm centre the club's A-grade best and fairest.\nHamilton's victory followed her strong showing in the league's Betty Thompson Medal count, where she polled 13 votes.\nThe skillful midcourter will play for HDFNL club Leitchville-Gunbower next season, where she has signed as A-grade coach.\nRunner-up in the best and fairest was defender Emmie Banfield.\nBanfield also finished runner-up in last year's best and fairest award, won by Ava Hamilton.\nBrylee Wilson won the Storm Spirit Award.\nJackie Geary claimed the A-reserve best and fairest award ahead of runner-up Elyse Morgan.\nThere was a tie in the B-grade best and fairest award, with Chelsea Crapper and Tahlee O'Keefe sharing the honours.\nImogen Currie finished as the runner-up and also won the best player in finals award.\nIn B-reserve, Meg Johns claimed the best and fairest award, while Lucy Sharp finished runner-up.\nIn 17-and-under, Lainey Pollard won the top award, with 2022 best and fairest winner Layla O'Shea the runner-up.\nBEST AND FAIREST WINNERS:\nFOOTBALL:\nSENIORS:\nDaniel Clohesy (98)\nCallum McCarty (94)\nRESERVES:\nShannon Murphy (86)\nCarson James (77)\nUNDER-18s:\nSialoga Siu (106)\nJed Daniels (91)\nSENIOR WOMEN'S\nDani Jeffrey\nNETBALL:\nA-GRADE:\nCaitlyn Hamilton\nA-RESERVE:\nJackie Geary\nB-GRADE:\nChelsea Crapper & Tahlee O'Keefe\nB-RESERVE:\nMeg Johns\nUNDER-17s:\nLainey Pollard\nOur journalists work hard to provide local, up-to-date news to the community. This is how you can access our trusted content:\n- Download our app on iOS and Android\n- Bookmark bendigoadvertiser.com.au\n- Make sure you are signed up for our breaking and regular headlines newsletters\n- Follow us on Twitter @BgoAddy\n- Follow us on Instagram @bendigoadvertiser\n- Join us on Facebook\n- Follow us on Google News\n- Have you signed up to the Bendigo Advertiser's daily newsletter and breaking news emails? You can register below and make sure you are up to date with everything that's happening in central Victoria.",
  "word_count": 633,
  "scraped_at": "2026-02-14T12:57:08.849888"
}