{
  "article_id": "fd767b1c2581",
  "url": "https://www.newsweek.com/why-prince-william-controversy-missed-opportunity-world-cup-1822203",
  "title": "Why Prince William Controversy Was Missed Opportunity",
  "date": "20230824T153000Z",
  "domain": "newsweek.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Prince William's decision not to fly to Australia to watch the England team play in the FIFA Women's World Cup Final this month saw the royal pass up an opportunity for some positive PR. However, he was \"let off the hook\" from widespread criticism after the team's eventual loss, according to a new episode of Newsweek's The Royal Report podcast.\nWilliam faced down backlash after the English women's national soccer team, nicknamed the \"Lionesses\", reached the final stage of the World Cup tournament against Spain on August 20 at Stadium Australia, Sydney.\nThe prince is president of the Football Association in Britain and has been since 2006. As such, he could be expected to attend the major matches for the England teams. Days before the World Cup final, though, it was made clear that the royal would not travel to Sydney—though no official reason was given by Kensington Palace, London.\nA number of high-profile commentators came out against the prince, including broadcaster Piers Morgan, who said William would have attended if it had been the men's team playing and not the women.\nChief royal correspondent, Jack Royston, said on The Royal Report that the prince had passed up the opportunity to bask in the glory of a centerpiece of national pride.\n\"If he had [gone], obviously he would have swerved these allegations that he cares more about the men's game than he does about the women's game. But it would also have given him that chance to bask in the reflected glory of a successful English soccer team,\" Royston added.\nThe 2023 tournament was the first time the England women's soccer team had ever reached a World Cup final. The England men's team have not secured a win since 1966.\nThe England v. Spain game on August 20 did have a royal in attendance, except it was Spain's Queen Letizia, also accompanied by her youngest daughter, the Infanta Sofía.\nThe Spanish team was triumphant, defeating the Lionesses in a 1-0 win.\nThough disappointing for British morale, the loss may have been a saving grace for William, according to Royston. The prince made a concession by sending a good-luck message before the match with Princess Charlotte on social media, as criticism for his absence was still being made.\n\"In a way, and it's sad to say it, but he's kind of been let off the hook by the fact that England lost,\" Royston told listeners.\n\"You know, if England had won and he'd been stuck in Britain trying to jump on the bandwagon by posting on social media from Kensington Palace [in London] or from up in Windsor, [Berkshire,] he would have looked ridiculous. He'd have been ridiculed.\n\"So I think actually England's bad luck is, in a weird way, his good luck, and he got away with this one,\" Royston said. \"But if I was him, I think very seriously this time. And remember in future that he is going to be expected to make it to the final any time the English women's team get there. And if he doesn't go, he will be accused of favoritism towards the men's game versus the women's game.\"\nJames Crawford-Smith is Newsweek's royal reporter based in London. You can find him on Twitter at @jrcrawfordsmith and read his stories on Newsweek's The Royals Facebook page.\nDo you have a question about King Charles III, William and Kate, Meghan and Harry, or their family that you would like our experienced royal correspondents to answer? Email royals@newsweek.com. We'd love to hear from you.",
  "word_count": 589,
  "scraped_at": "2026-02-14T12:05:06.417780"
}