{
  "article_id": "fd8684ee0507",
  "url": "https://www.alaskasnewssource.com/2024/03/26/former-dimond-star-alissa-pilis-collegiate-career-ends-ncaa-tournament-loss-gonzaga/",
  "title": "Former Dimond star Alissa Pili collegiate career ends in NCAA tournament loss to Gonzaga",
  "date": "20240326T154500Z",
  "domain": "alaskasnewssource.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Former Dimond star Alissa Pili’s collegiate career ends in NCAA tournament loss to Gonzaga\nANCHORAGE, Alaska (KTUU) - Former Gatorade Alaska Player of the Year and 2023 Pac-12 Player of the Year Alissa Pili’s college hoops days came to an end on Monday at the McCarthey Athletic Center in Spokane, Washington.\nThe Utah Utes fell to Gonzaga 77-66 in the second round of the women’s NCAA Tournament, finishing the season 23-11 overall.\nJust like in Utah’s first-round matchup, Pili was an unstoppable force in the post against some of the nation’s best competition.\nTwo days after scoring 26 points to lead Utah to victory over South Dakota State, Pili on Monday poured in a team-high 35 points to go along with seven rebounds and one assist.\n“It’s just tough when you know that ... that’s your last college game and it kind of just flew by,” Pili said in the postgame press conference. “I’m just grateful for it all. I’m grateful I came to Utah and kind of turned my whole life around. I’m just grateful. I’m ready for the future.”\nPili averaged 21 points in her final season, currently tied with two other players for the 14th most in the game.\nRated as the 41st overall prospect in the 2019 class, according to ESPN, Pili began her career with the University of Southern California, joining her brother Brandon Pili, who had committed to play football for USC in 2017.\nIn three years with the Trojans, Pili played in 63 games and started 58. She was named the Pac-12 Freshman of the Year and earned a spot on the All-Conference team in 2020.\nHowever, an ankle injury hampered her sophomore campaign, and in 2022, she chose to transfer to Utah.\n“I needed to step out of my comfort zone a little bit to really push me to get to where I knew I could be,” Pili said.\nThat push proved to be extraordinary.\nPili exploded back onto the scene as a junior, averaging 20.7 points on the way to earning Pac-12 Player of the Year honors.\nThat trend continued into this season, as she scored over 30 points in a game on four separate occasions, including a career-high 37 against both top-ranked South Carolina and her former Trojan squad.\nThe offensive onslaught resulted in her shattering Utah’s team record for the most points scored in a single season.\nAll told, Pili finishes her time on the collegiate court with over 2000 points and nearly 800 rebounds.\n“I’ve learned so many things from coach Lynne, my teammates and the rest of the coaches, and just the whole university,” Pili said. “The experiences will stick with me forever and I’m just really glad that I ended it with this group of people.”\nWith her time in Salt Lake having come to a close, Pili will now look towards the upcoming WNBA draft on April 15. She is currently projected as a lottery pick by multiple outlets.\nCopyright 2024 KTUU. All rights reserved.",
  "word_count": 500,
  "scraped_at": "2026-02-14T13:10:49.794472"
}