{
  "article_id": "fd87e96556c4",
  "url": "https://www.thenationalnews.com/news/mena/2025/05/21/how-will-lebanons-palestinian-factions-be-disarmed/",
  "title": "How will Lebanon Palestinian factions be disarmed ? ",
  "date": "20250521T161500Z",
  "domain": "thenationalnews.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Palestinian Authority President Mahmoud Abbas landed in Beirut on Wednesday for his first visit to Lebanon in eight years, during which he met President Joseph Aoun. Disarming Lebanon’s Palestinian refugee camps is expected to be one of the priorities on the agenda.\nSince the November ceasefire between Israel and Lebanon, the discourse over disarming non-state forces has focused largely on Hezbollah, the Lebanese political party and armed group. But as Hezbollah’s influence wanes, Lebanese officials – under significant pressure from the US – have increasingly turned to the issue of disarming Palestinian groups in the camps.\nWhat does disarmament mean?\n“We would keep light arms in the camps with co-ordination from Lebanese security forces,” said Serhan Serhan, a member of the Palestinian Authority’s (PA) Legislative Council and deputy secretary of Mr Abbas's Fatah faction in Lebanon. “This plan aims to disarm factions with medium to heavy weaponry. And we’ll confiscate weapons held by individual groups not operating under our [PA] authority.”\nSuch a task will be difficult. By long-standing agreement, Lebanon's 12 official Palestinian refugee camps are outside the state's control and governed by an array of Palestinian factions – including those opposed to Mr Abbas. This has made some camps a haven for outlaws, drug trafficking and Islamist extremists. Outbreaks of armed violence are common, as is inter-factional strife.\nMr Serhan said representatives of the Palestinian factions held a meeting early this month and agreed whatever Mr Abbas and Mr Aoun decided.\nThe factions represented included those under the umbrella of the PA, as well as Hamas, Palestinian Islamic Jihad, Ansarallah and Osbet Al Ansar.\nMr Serhan said once an agreement is reached, these factions would “form joint committees to follow up on the situation and formulate a plan towards disarmament”. He added: \"We are all under the ceiling of Lebanese law.\"\nWhich Palestinian factions are present in Lebanon’s camps?\nThe Palestinian Liberation Organisation and Fatah\nFatah is the leading political faction within both the Palestine Liberation Organisation (PLO) and Lebanon’s Palestinian refugee camps. The PLO is an internationally recognised umbrella organisation perceived as representing the Palestinian people in the occupied West Bank and among the refugee diaspora.\nThe PLO is represented by the PA, the semi-autonomous governing body in the West Bank and the symbolic representative of Palestinians in refugee communities abroad.\nAs the dominant force within the PLO and the PA, Fatah effectively oversees Palestinian political leadership, security co-ordination and diplomatic engagement with the international community.\nHamas\nHamas, an Islamist nationalist movement inspired by the Muslim Brotherhood, is considered a political party and a resistance group, and is the main political rival to Fatah. It governs the Gaza Strip, which it seized from Fatah in 2007, and is a rival to the PA in the West Bank.\nWhile Fatah and the PA have increasingly embraced international diplomacy and security co-ordination with Israel, Hamas continues to position itself as a resistance movement. It also maintains influence in Lebanon’s Palestinian refugee camps, where dissatisfaction with Fatah has grown.\nOn October 7, 2023, Hamas’s armed wing, Al Qassam Brigades, launched a large-scale surprise attack on Israel from Gaza, killing about 1,200 people and taking about 250 as hostages. It was the most significant escalation in the Israeli-Palestinian conflict in decades and triggered Israel’s devastating assault on Gaza, which has killed more than 53,600 people and destroyed much of the coastal strip.\nDespite a number of attempts at reconciliation over the years, Palestinian governance remains split between Hamas in Gaza and the Fatah-led PA in the West Bank.\nHamas is also active in Lebanon and closely aligned with Hezbollah. Hamas and its ally, the Palestinian Islamic Jihad, have launched rocket attacks at Israel from Lebanon, particularly during the cross-border fighting from October 7, 2023 until the ceasefire in November 2024.\nPalestinian Islamic Jihad\nThe Islamic Jihad Movement in Palestine, founded in Gaza in 1981, began as an offshoot of the Muslim Brotherhood and was heavily influenced by the Islamic Revolution in Iran.\nUnlike Hamas, PIJ does not participate in politics or government and is focused entirely on military resistance.\nThe group is considered close to Hezbollah and is also backed by Iran, which provides funding, weapons and training. It operates in Gaza, the West Bank and inside the Palestinian refugee camps.\nBy 1988, PIJ's leadership in Gaza was exiled to Lebanon, bringing them even closer to Iran and Hezbollah.\nExtremist groups and outlaws\nSmaller, loosely organised factions inspired by Al Qaeda or ISIS ideologies also exist in some camps, particularly in Ain Al Hilweh refugee camp in Sidon. Some residents are wanted by the Lebanese state and therefore cannot leave the camp without risk of arrest. A mix of nationalities is represented, including Palestinian, Lebanese and Syrian.\nClashes between Fatah and extremists are not uncommon in Ain Al Hilweh, which holds more than 50,000 registered Palestinian refugees.\nThese outlaw groups are not expected to give up their arms without a fight.",
  "word_count": 820,
  "scraped_at": "2026-02-14T12:11:29.836900"
}