{
  "article_id": "fd9ff84ec0cc",
  "url": "https://www.palatinate.org.uk/eidevall-finally-out/",
  "title": "Eidevall  finally  out – Palatinate",
  "date": "20241019T203000Z",
  "domain": "palatinate.org.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Eidevall ‘finally’ out\nBy Clarice Webster\nLess than 48 hours before Arsenal Women’s Champions League clash with Vålerenga Women and in the same week as another looming London Derby with West Ham, the club announced the immediate resignation of head coach Jonas Eidvall. His three-year reign at the club has been marked mainly by the immense growth of fan engagement, with the women now playing exclusively at the Emirates, and selling it out with record attendance three times last season. The second largest crowd in WSL history in fact, gathered for the North London Derby in March, to see the thundering 5-1 defeat of Tottenham. The same fans raising the roof in support that day have turned out in unity again, this time to celebrate the breaking news of Eidvall’s resignation.\nGrowing discontent has been palpable amongst not only fans, but players too, with television coverage unable to hide the tears and arguments on the Arsenal bench this weekend. Katie McCabe and Beth Mead were amongst those seen in fiery discussion with Eidvall, and with almost constant fan scepticism of line-up announcements and tactics on the pitch it was perhaps predictable that comments on the announcement state that this is ‘the first good decision’ Eidvall has made all season. Following the loss of their top WSL goal scorer of all time Vivianne Miedema to Manchester City, yet another week of joyless football, and a plummeting to sixth in the league, it is not altogether surprising.\nIt may seem unfair to ignore back-to-back Women’s League cup titles, qualifications for Champions League rounds, consecutive top three finishes, and an 81% win or draw rate in last season’s WSL in favour of such resounding ‘good riddance’-s but after a 1-out-of-4 win rate in this season’s WSL, and a categorical humbling by Bayern Munich in the Champions League, last Sunday’s at-home derby day against Chelsea was really a no-excuses must win event for Eidvall’s career. Reader, they lost. From Chelsea’s minute four opener onwards, the tension was palpable, with Eidvall eventually being booed off the pitch and down the tunnel, for what we now know to be his final Arsenal appearance. It didn’t stop at that; a fan was seen waving a P45 document at Sunday’s clash, and graffiti near the Emirates reading “Jonas Out” made it painfully clear that fan discontent is at an all-time high.\nThe debate rages on, do football fans get to dictate a manager’s career from the tip-of-the-iceberg time that they see them for? Are calls for resignation overused? Is it unfair, that after three inoffensive seasons, the Instagram announcement comments read “war is over”, and “we won’t miss you”?\nHowever, it is a debate that has mainly raged on in regard to the men’s game. It has been a staple of the game this summer to call for “Southgate Out” and this attitude is nothing new. However, it is arguably the monetisation of the game, the increased social media analysis, the growth in online fanbases, and the marketing of the game to fans above all else that has allowed fans to feel entitled to call for change within the clubs they support. So, dare I say this public shaming is encouraging? Just over 20 years ago, the WSL did not exist, and now, graffiti in north London is about Eidvall, and not Arteta. The Arsenal women’s Instagram page has nearly 2 million followers, the games hit record crowd numbers time and again.\nThere is money flowing where it didn’t before in the women’s game, there is a full calendar, and a growing base of digital media coverage, allowing for ‘round-the-clock’ fan engagement. Perhaps this is a leap, but the double-edged sword of increased coverage, increased fandom, and increased engagement is being played out before us here, and maybe, just maybe, this defamation is all part of the crawling journey to gender equality in football fandom? Fanbases have a louder voice now, and they know it, let them be heard, they have a message for Jonas and it’s not a thanks, it starts “who’s bringing the champagne?”\nImage: Ank Kumar via Wikimedia Commons",
  "word_count": 684,
  "scraped_at": "2026-02-14T12:23:05.847150"
}