{
  "article_id": "fdac0c72ca18",
  "url": "https://www.the42.ie/australia-v-ireland-womens-world-cup-6103424-Jun2023/",
  "title": "Ireland World Cup opener with co - hosts Australia an 80 , 000 sellout",
  "date": "20230627T091500Z",
  "domain": "the42.ie",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "THE REPUBLIC OF Ireland and tournament co-hosts Australia will play their opening game of next month’s Women’s World Cup in front of a full house, a senior Fifa official has confirmed.\nDave Beeche, chief executive of the Women’s World Cup, said the Matildas’ opener against Vera Pauw’s side on 20 July has sold out at Sydney’s Stadium Australia, which can hold around 80,000 fans.\n“There is currently nothing available,” he said.\nBeeche also expects a capacity crowd the same day in Auckland where tournament co-hosts New Zealand — the ‘Football Ferns’ – open their campaign against Norway.\n“It’s going to be a massive day for women’s football,” he said of the double-header either side of the Tasman Sea.\nWith less than 25 days until kick off, the tournament boss says only a “few thousand” tickets are left for New Zealand’s opening game at Eden Park, where capacity will be just under 40,000.\n“Yes, definitely” Beeche replied when asked whether the Auckland stadium would be sold out for the opener, despite fears about the tournament’s low ticket sales in New Zealand.\nFootball’s governing body Fifa has said around 1.1 million tickets have been sold for the 64 matches in Australia and New Zealand.\nFifa’s head of women’s football Sarai Bareman has voiced concern about low World Cup ticket sales in New Zealand, where the co-hosts are struggling for form.\nThe Football Ferns approach the tournament on a 10-match winless streak with one chance left to get a morale-boosting win in a final home friendly against Vietnam on 10 July.\nBeeche said 270,000 tickets had so far been sold in New Zealand and 830,000 in Australia.\nThose unequal numbers reflect the population sizes of Australia, where 26 million people live, and New Zealand, which is home to five million, he insisted.\n“When you look at the Matildas being a high-ranked team and the Football Ferns’ run of form, New Zealand is doing pretty well,” he said.",
  "word_count": 324,
  "scraped_at": "2026-02-14T12:29:21.795833"
}