{
  "article_id": "fdbf7ac22c98",
  "url": "https://abc11.com/post/chaotic-recruiting-harsh-decisions-bill-belichicks-first-months-unc/17705365/",
  "title": "Chaotic recruiting and  harsh  decisions : Bill Belichick first nine months at UNC",
  "date": "20250901T041500Z",
  "domain": "abc11.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "ByDavid Hale and Andrea Adelson\nMonday, September 1, 2025\nCHAPEL HILL, N.C. -- Just minutes before taking the stage at the ACC's annual kickoff event at the Hilton Charlotte Uptown, Bill Belichick scrolled through his phone, reviewing his notes at a table in a dark service corridor as hotel employees stacked plates and glasses around. He had been shuffled through back hallways by conference and school staffers hoping to avoid the majority of the more than 800 media members gathered in an adjacent ballroom, all eager to photograph, question or simply glimpse college football's biggest celebrity, but the spotlight awaited.\nThis is the new normal for North Carolina.\n\"It's a little like the Deion [Sanders] thing at Colorado,\" ACC commissioner Jim Phillips said. \"He grabs your attention. It's made for television.\"\nThe ballroom where Belichick addressed topics as banal as the modern use of the fullback remained packed for his session, the ACC having distributed nearly 40% more credentials than a year earlier. In a breakout room intended for a more informal Q&A, more than 200 reporters elbowed through the crowd to pose a question. Belichick spoke for more than 20 minutes, even cracking a few jokes.\nOne reporter asked what it was like sitting in living rooms with recruits during the spring.\n\"I haven't done that,\" Belichick quipped. \"That would be a recruiting violation right now.\"\nFor anyone who had lived through Belichick's chaotic early days of recruiting and roster building, it might have felt like an inside joke. The start to this new era in Chapel Hill was marked by missteps, confusion, broken promises and \"harsh\" and \"businesslike\" decisions to nudge players out the door, all while a skeleton staff bereft of college experience struggled to keep up.\n\"It was very stressful,\" said a former member of the staff. \"Everyone was running around like chickens with their heads cut off.\"\nIt was a far cry from Belichick's presentation at ACC media days this summer, where he appeared at ease in his new world -- still far from his promise to bring a national championship to Chapel Hill but more aware of the pitfalls he'd face along the way.\nWhen Belichick met with North Carolina's team for the first time in December 2024, he delivered a mission statement for a program that has developed a reputation as a perennial underachiever. It was now being led by a man who had won 302 NFL games and six Super Bowls as a head coach. Things were about to change dramatically.\n\"We're going to grind every single day,\" he told the team, according to veteran quarterbackMax Johnson. \"It's a process from January until the season starts.\"\nThat process reaches its apex Monday night when UNC hostsTCU(8 p.m. on ESPN) in Belichick's first game as a college head coach. It has been, according to more than two dozen sources including former assistants, current and former staffers, high school coaches, players, recruits and members of school administration who spoke with ESPN, at times enlightening and exhilarating, chaotic and tumultuous.\nBelichick and his staff have had to adjust on the fly to the intricacies of NCAA recruiting rules, rebuild a roster and dodge scrutiny about the 73-year-old coach and his 24-year-old girlfriend. The promise Belichick didn't offer to his team that first day, but the one that seems most likely to hold true, is that no part of this era would be boring.\n\"There's things that we're going to deal with that other schools aren't,\" Belichick said in his usual subdued tone. \"That's the way it goes.\"\nIF BELICHICK'S NFL résumé was a selling point to UNC fans, his status as a college newcomer quickly became uncomfortably apparent to numerous high school coaches, recruits and staffers who spoke to ESPN. They described the December and January recruiting push as a frenetic and disjointed process in which few people seemed to have a clear vision for the program's direction.\nIn a quest to \"go lean,\" Belichick quickly cut ties with much of the previous staff -- from assistant coaches to entry-level personnel who handled the basic operations of recruiting. When he was in the office, Belichick spent most of his time behind closed doors in a staff room with Tar Heels GM Mike Lombardi and newly hired personnel staffers Joe Anile and Andrew Blaylock, with one source involved in the process saying the Heels initially couldn't do \"traditional\" visits because there were so few people for players to meet with. Another source at UNC said the decision to move on from the prior staff was understandable, but \"you still need someone who knows how to book a flight or a hotel.\" Multiple sources confirmed Belichick ultimately relented -- at least temporarily -- rehiring some analysts just to fill the void.\n\"A couple times they brought in good players and ignored them on their visit,\" a source with direct knowledge of the situation said. \"There were times that the kids would be waiting 30, 45 minutes or an hour and then all of a sudden, you're not meeting with Coach Belichick anymore, and we'll go back to the airport.\"\nBelichick and his top lieutenants were often flying blind when it came to NCAA rules and regulations, operating by a Silicon Valley-style \"move fast and break things\" approach, while public records obtained by ESPN show numerous reminders from compliance staff about recruiting quiet periods and NIL restrictions, along with a protracted debate about the boundaries of where coaches could meet with recruits on official visits.\n\"That's probably the biggest thing they've had to learn, with what you can and can't do,\" another source who has worked with the program said. \"They found out fast how many rules we've been dealing with over the past couple of years.\"\nThose initial months were a barrage of hasty evaluations and high-pressure sales pitches.\nOne recruit, who ultimately didn't sign with UNC, recalled meeting Belichick for just a few minutes before being handed a contract and asked to sign.\n\"I kind of felt it was disrespectful to just put me in that situation after just meeting a coach,\" the recruit said. \"It was just crazy that you'd make a player sign a contract in front of a coach right after you just met him, and you haven't even talked about numbers yet or anything about what I would get at that school.\"\nIn-state recruit Jariel Cobb was planning a visit to an SEC school when he got a call from UNC, saying Belichick wanted to send a car to pick him up if he could visit campus immediately. When Cobb arrived in Chapel Hill with his mother, they were given the red-carpet treatment, with an array of people in UNC gear shaking hands and lauding the recruit's skill set. Belichick met with Cobb, who had always dreamed of playing for his home-state Tar Heels but didn't receive an offer from the prior staff. Belichick delivered a stern analysis: \"I don't know why in the hell they hadn't offered you, but I looked at the film. I want you.\"\n\"They treated us like celebrities,\" Terri Cobb, Jariel's mother, said. \"Other schools had told him to think on it, but right out of the gate, Bill stood up and said, 'You rocking and rolling with me or what?'\"\nCobb signed, enrolled early and went through spring ball with the Tar Heels, calling it a positive experience, but his mother had noted that, during his initial conversations with Belichick, the coach had repeatedly mentioned two other players from Cobb's high school he hoped would also come to UNC. In retrospect, she wonders if the Tar Heels' interest in her son was aimed at getting an inside line to other players.\n\"They were flying through visitors,\"the former member of the staff said. \"It was unclear if Coach Belichick had evaluated the tape with how quickly they were bringing kids in.\"\nBy the spring, with a full staff and enough time to better evaluate talent, North Carolina went into its second roster rebuild of the offseason. Overall, 39 players transferred out after Belichick's arrival, including nearly two dozen after spring workouts. Cobb was among them. After just four months at his dream school, he was told he was unlikely to play and encouraged to transfer. It was, according to his mother, a similar story for many of his teammates. Cobb is now at Charlotte, which will play the Tar Heels in Week 2.\nMeanwhile, UNC heavily recruited transfers during the spring portal window, which, according to numerous coaches across multiple Power 4 conferences, was described as the most bereft of talent since the portal era began in 2021. The Tar Heels added 23 players.\n\"There's a little guesstimate there,\" Belichick said. \"You do the best you can to figure it out, but it's a very inexact science.\"\nTo find worthy additions in April and May, North Carolina was aggressive in identifying potential transfers. Five coaches told ESPN that they had been frustrated with North Carolina's brazen efforts, led by Lombardi, to contact players directly prior to those players entering the portal, with at least one coach contacting Belichick to complain. Though tampering has become commonplace in college football, it's often done through back-channels -- current players talking to friends or former teammates, for example. North Carolina was \"blatant\" and \"brazen,\" according to one Power 4 coach. One player who spoke to ESPN said that he had been contacted by UNC in an effort to convince him to transfer, and he was warned not to inform anyone of the communication. If he did, he was told, he could lose his eligibility.\n\"I don't think they're doing anything that hasn't been done [elsewhere],\" one source said, \"but I do think it's such a drastic culture change from [former coach] Mack [Brown], so that it looks completely different to the people at UNC.\"\nWhile the style is different, so are the results. UNC already has nine blue-chip commitments for 2026 as Belichick has grown more comfortable with the recruiting process and focused on a national approach to talent acquisition.\n\"We're in there with some good schools,\" Belichick said, \"and it's good to be able to get kids coming to Carolina over some of the top schools in the country.\"\nAfter the rocky start, Belichick has used additional resources promised as part of his hiring to nearly double the recruiting support staff from what existed under Brown, yet it's often Belichick who's the linchpin to selling a player.\nBelichick's first time on the road recruiting was traveling to Rolesville High outside Raleigh, North Carolina, to visit brothersZavionand Jayden Griffin-Haynes. Zavion had been committed to North Carolina under Brown, but decommitted after the coaching change. Jayden never received an offer under the previous staff.\nBelichick stayed for nearly two hours, according to Zavion, and he broke down tape with the brothers, a key part of the coach's sales pitch with high-level recruits.\n\"They stayed on me,\" Zavion said. \"They came to see me practice during spring ball. They made sure it was love from UNC and that really stood out to me. He wants me to be the face of the program, but he also said I have to work for it. He's not just going to hand it to me, but I'm the guy he's looking for in the program.\"\nBoth brothers committed in June.\nWeddington (N.C.) coach Andy Capone remembers Belichick visiting campus this spring to meet with recruitThomas Davis Jr., and he was awestruck.\n\"I've been fortunate enough to meet a lot of head coaches,\" Capone said, \"but I've only taken a picture with two of them: Nick Saban and Bill Belichick.\"\nWhat truly impressed Capone was Belichick's pitch once the fanfare died down. Belichick described a detailed plan for UNC, spent time with three recruits, including Davis, and, from memory, recited plays he had watched on film from their games, relating each to plays run by some of the greats from Belichick's past.\n\"He'd say, 'This is how I used Lawrence Taylor or Mike Vrabel,'\" Capone said. \"It was really cool to let them see a perspective of how he sees players in his system.\"\nCapone said Belichick was honest with his recruits, and he pitched them on his long history of preparing players for the NFL.\nBefore Belichick departed, Davis, who ultimately committed toNotre Dame, asked the question that has been at the forefront of so many debates since the NFL legend arrived at Carolina. Was Belichick really planning to stay long in Chapel Hill?\n\"I wouldn't have taken this job to go back to the NFL,\" Belichick told him. \"We're going to win national championships here.\"\nVINAY PATEL WAS never a Belichick fan. The UNC board of trustees member applauded the hire for the Tar Heels, but he had seen enough of Belichick in the pros to assume he wouldn't like the guy.\nStill, Patel was curious, so he attended a welcome banquet held on campus this winter, hosted by Belichick and his girlfriend, Jordon Hudson.\nTo his surprise, the event was friendly.\n\"I expected some pompous SOB, and he definitely wasn't that,\" Patel said. \"And she's not standoffish at all. We chatted, shook hands. She's polite.\"\nA few months later, amid a media firestorm surrounding Belichick's relationship with Hudson, who is nearly 50 years his junior, and her role in managing his personal brand, Patel remembers being perplexed by the seemingly ubiquitous outrage.\n\"I had a friend saying, 'Can you believe this Jordon Hudson?' -- this and that,\" Patel said. \"And I'm just thinking, yes, but if you'd told me a year ago that UNC football was going to be a news story on a daily basis, I'd have thought you were nuts.\"\nIf Patel favored an \"all publicity is good publicity\" approach, many members of the often staid and conservative UNC community saw it differently. In December, Belichick emailed UNC staff, insisting Hudson be copied on all communications. Hudson proceeded to inject her opinion on how the school's PR staff operated, sometimes frustrating longtime employees. In one instance, she insisted Steve Belichick never be referred to as Bill's son, and in a February email, asked to have public comments on UNC football social media sites censored, including one she said described her as \"a predator.\" UNC public relations replied that it \"hid/erased one comment that had been posted about your personal life,\" but did not find additional critical comments on UNC football's Facebook page, according to documents obtained by ESPN in a public records request.\nBill Belichick was frustrated that the emails were shared, according to multiple sources, despite warnings from UNC staff that, as a public university, the athletics department was subject to open records requests.\n\"He didn't like it at all, but he's never worked at a public school,\" a UNC source said. \"[Hudson] would probably be more involved if we weren't a public school.\"\nBy the spring, Hudson's involvement became routine public fodder. At UNC's final spring practice, Hudson roiled the school's old guard not only for being on the field, but for the way she was dressed. More attention followed, from a controversial appearance on \"CBS Sunday Morning\" to reportsthat Hudson had been banned from UNC's football facility to suggestions in a New York Times story that a planned season of HBO's \"Hard Knocks\" featuring North Carolina was scuttled due to her involvement.\nSources familiar with the negotiations told ESPN that the decision to nix the project was ultimately Belichick's, saying he felt the timing of the HBO show, which would film only during fall camp, wouldn't showcase the team's strengths. The school instead pivoted to another project that will air on Hulu and cover North Carolina's entire season.\nAmid the spring's media frenzy, the school was flooded with complaints from fans, donors and even professors, calling Belichick's relationship \"shameless,\" \"a disgrace\" and \"a laughing stock,\" with one alum writing, \"We've always prided ourselves on being a class act, but this is the kind of unnecessary distraction that does more harm than good. If Bill walks, he walks.\"\nUNC brass, including chancellor Lee Roberts and athletic director Bubba Cunningham, declined to comment on \"the private lives of any of our employees,\" as Roberts explained, and inside the locker room, few players seemed bothered.\nNumerous sources who spoke to ESPN suggested much of the Hudson drama was overblown. One UNC administrator said that Hudson's initial involvement was simply to \"fill a void\" until new PR staff could be hired and said Hudson hasn't been a part of football-related correspondence since early in the spring.\nA \"talking points\" email distributed to PR personnel and Belichick ahead of the ACC's spring meetings in May detailed Hudson's role, noting \"once staff was in place, after about a month, she was no longer copied on emails. She is not involved in the hiring of staff, recruiting of players, communications related to the program or the building of the program\" but \"continues to be involved from a scheduling perspective.\" The memo also noted that \"Jordon is playing an active role in the filming and production of a documentary about Coach Belichick's first season of college football, so in that capacity, she may be seen on the sidelines of Carolina Football practices or games.\"\nMultiple sources who spoke to ESPN doubted Belichick had been aware of the outsized attention she generated online -- \"He's always watching film, not scrolling through her Instagram\" -- and believed that after the CBS interview, he took steps to limit her exposure in relation to the football program.\n\"It's almost like you're shielded from it,\" one source with knowledge of the program said. \"You're finding all this stuff on TMZ and different sites, but nobody really talked about it around the building. It was more of a big deal nationally than it was here.\"\nA SMALL ARMY of reporters shuffled aimlessly outside a padlocked gate that, in a few moments, would provide a brief glimpse of North Carolina's fall camp on a weekday in mid-August. Access to outsiders has been severely restricted, and a pair of onlookers standing at a fourth-floor window in a nearby building had likely already gleaned more information about this Tar Heels team than the local media had all summer.\nIn the Belichick era, there are insiders and there are outsiders.\nNorth Carolina has beefed up security. When one local reporter used binoculars to glimpse Hudson and other visitors at a UNC practice through a narrow window of the indoor practice facility, a guard immediately interrupted. The football building inside Kenan Stadium has been off limits to all nonessential football personnel, and the school installed facial recognition sensors to enter the facility. No UNC player was permitted to speak to the media for the first six months of Belichick's tenure, and Belichick is also skipping a weekly radio show, typically a staple for college coaches, ceding the stage to Lombardi.\nBelichick's staff is filled with trusted confidants. Lombardi had been an advisor with the New England Patriots and even co-hosted Belichick's podcast. Lombardi's son, Matt, is UNC's quarterbacks coach. Two of Belichick's sons -- Steve and Brian -- coach on defense. One of his former players, Jamie Collins, is the inside linebackers coach. Several sources suggest senior staff members monitor outgoing communications from other staffers to curtail leaks about the inner workings of the program.\nOn the inside, however, the view of Belichick has been far different than the public persona he has projected for decades.\n\"They've been really easy and good to work with,\" said Cunningham, who had initially been skeptical of the hire. \"It's a different model. They wanted to bring in their own coaches and personnel and recruiting people, people they've worked with previously. It's a very personable staff.\"\nThis winter, Belichick had pizza delivered to UNC fraternities and sororities ahead of the Heels' men's basketball game againstDuke. He did the same for several of UNC's winter and spring sports teams.\nBelichick is a longtime lacrosse fan, and as he surveyed the football practice field during the spring -- the same field where the lacrosse teams practice -- he posed a question: Where are the lacrosse lines? Belichick was told that, if the football team practices that morning, the lacrosse field wouldn't get painted.\n\"He said, 'Paint the lines,' and we got them,\" UNC's women's lacrosse coach Jenny Levy said. \"I think he's diving into what college athletics is all about.\"\nFormer UNC linebacker Jeff Schoettmer attended the school's \"Practice Like a Pro\" day to conclude spring practice, and he watched Belichick mingle with recruits, transfers and their parents. At a banquet afterward, the coach met with former players and donors.\n\"It's pretty incredible to see how easily he moves among different types of people,\" Schoettmer said. \"Him holding court with former players -- it's just like you see some of these extroverted coaches who'll talk to anybody, but you don't expect Bill to sit there and tell war stories with guys he's never coached. But that's how much love I think he has for North Carolina.\"\nInside the football facility, Belichick thought Brown's former office on the fourth floor of the football building was isolating, so he set up his own office on the second floor to be in the same space occupied by the players.\n\"I can't coach the players if I'm not around them,\" Belichick told ESPN. \"I try to go in and out of meetings and be visible and present.\"\nCunningham said he has been struck by how accessible Belichick is to the team, routinely sitting in film study sessions and breaking down plays.\nIn June, Belichick met with his quarterbacks each day for about an hour, a process that began during his tenure with thePatriotsbecause, he said, \"It's important for the coach and the quarterback to be on the same page.\"\nJohnson, one of the few holdovers from Brown's 2024 team, said the involvement of the coach in the small details of the game is unlike anything he had seen.\n\"We did something different every day,\" Johnson said. \"Everything is really detailed, and that's what I've loved.\"\nIf Belichick's tenure has been marked by a steadfast devotion to those in his orbit at the expense of those on the outside, it has done little to temper enthusiasm around the program.\nDonations are up, season tickets are sold out, and UNC has added new premium-seating options that will further expand its revenue opportunities. Rick Barakat, the athletics department's new chief revenue officer, said UNC will exceed its all-time gross revenue record this year.\n\"The pitch has changed because the excitement's never been higher,\" Barakat said. \"We've had bouts of success historically, but I don't think we've ever seen Carolina football at the level it is right now in the national news cycle, and that trickles down into every conversation.\"\nEven entities in Belichick's orbit seemed to bask in the glow of newfound attention. Phillips raved that Belichick \"is great for the ACC and great for North Carolina.\" One executive for the Charlotte 49ers referred to a sizable uptick in season ticket sales as \"The Belichick Bump,\" and AD Mike Hill was tasked with finding more seating capacity for the Week 2 game by bringing in \"bleachers everywhere.\" Charlotte's initial advertising for the game focused on Belichick, a decision critiqued by the school's chancellor, according to public records obtained by ESPN, for ignoring its own new coach, Tim Albin.\nMany of North Carolina's administrators who spoke to ESPN said the investment would be judged on wins and losses, but it's also possible the spotlight could be a springboard to something else.\n\"You're seeing a lot more people involved as far as helping out the program,\" one of those sources said. \"You can feel that UNC is embracing more on the football end. It's been the talk of the last two years, but the push to get to the SEC, I think, was a major reason for this show of investment in football.\"\nUPON HIS HIRE, Belichick immediately pushed a new tagline for Tar Heels football. They would be \"the 33rd NFL team,\" and those early days included an influx of professional know-how, from Lombardi to former Patriots nutritionist Josh Grimes and Moses Cabrera, Belichick's longtime strength and conditioning guru.\n\"Coach B comes in with a different mindset in terms of everything's going to be at the highest level possible, no matter what he has to do to get there,\" wide receiverJordan Shippsaid.\nBelichick has delivered that message repeatedly, both inside the locker room and to the media, often saying players who \"don't want to work, they don't want to be good. That's OK, but if you're like that, Carolina's a bad place to be. It's too important to the rest of us.\"\nBelichick retained Freddie Kitchens as the lone full-time position coach from the previous staff, in large part because of his NFL background. Kitchens spent 16 years in the NFL before moving on to college, including a stint as theCleveland Brownshead coach. Belichick has said all of the systems they are implementing -- from offense to defense to special teams -- are NFL-based.\n\"Fundamentals and techniques that go with them are based on that too, practice, structure, meeting, installation, teaching. There were some modifications we had to make, but basically it's all the same,\" Belichick said.\nBelichick has gotten more used to recruiting as well. Those who interacted with him on the recruiting trail in January noticed a big difference in their exchanges six months later, describing him as \"more personable.\"\n\"He understands that he had to change his way of doing things, and he's doing that, and he's really adapting to this new culture,\" said Rolesville (N.C.) coach Ranier Rackley, who has three players committed to UNC. \"So that's why he's getting a lot of these guys because of that.\"\nCollins, who played for Belichick for parts of seven seasons during a 10-year NFL career, said he has seen a softening of the coach who, in the pros, was known for his all-business approach to relationships.\n\"The old Bill comes out, but we live in a different world now,\" Collins said. \"I've seen a different side of Bill coaching these guys.\"\nIn June, Rackley brought a group of players to UNC's 7-on-7 camp, and he took note of Belichick moving from one group to the next, watching as many teams and players as possible. There was a different energy to the experience, he said.\nIn all, nearly 4,000 kids showed up during UNC football camps that month. For Belichick, who has often downplayed the leap from the NFL to college, it was an eye-opening moment.\n\"Once you actually see it, it feels like Normandy,\" Belichick told ESPN. \"It's like, 'Here they come.'\"\nNorth Carolina hasn't won an ACC title since 1980, but with Belichick on the sideline, there's no lack of optimism in Chapel Hill.\n\"We're here to win football games,\" Shipp said. \"He let us know that yeah, we're going to have a spotlight. But that's not what we're worried about. We're worried about winning games.\"\nFor UNC, though, there's more to the story. Belichick is a bona fide winner, but he's also a show -- occasionally controversial, often recalcitrant, sometimes funny -- and for a program looking for attention, he has delivered.\n\"We want to be competitive in football,\" Roberts said. \"We want to be part of the national conversation. Carolina stands for excellence across the board, and we want to be excellent in football. I think we're well on our way.\"\nWhat comes after that remains a mystery -- one Belichick has fiercely protected throughout a long offseason. Now, the veil is lifted.\nThe new era of North Carolina football is here.\nMichael Rothstein and Eli Lederman contributed to this story.br/]\nCopyright © 2026 ESPN Internet Ventures. All rights reserved.",
  "word_count": 4643,
  "scraped_at": "2026-02-14T13:22:37.869758"
}