{
  "article_id": "fdf2742e8105",
  "url": "https://www.echo-news.co.uk/news/24324631.arsenal-youngster-southend-sign-professional-contract/",
  "title": "Arsenal striker from Southend on first professional contract",
  "date": "20240517T040000Z",
  "domain": "echo-news.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "A SCHOOLGIRL is setting her sights on a top flight football career after signing her first professional contract with Arsenal.\nMichelle Agyemang, 18, joined the club aged six and has remained part of the academy ever since.\nNow, the Southend High School for Girls pupil has put pen to paper on her first professional contract with the club, which plays in the top tier of English women’s football.\nMichelle made her senior Arsenal debut at the age of 16 during a Women’s Super League victory over Leicester City in November 2022. Her first senior Arsenal goal followed in a Women’s FA Cup clash with Leeds United on January 29, 2023.\nThe teen striker has made five appearances for the first team and said the contract means “everything” to her.\nSpeaking to Arsenal Football Club, she said: “Arsenal is like family to me, so signing a professional contract here is just incredible, it really is what dreams are made of.\n“I am really grateful for the opportunity, and I can’t wait to continue playing for the Arsenal.”\nMichelle spent a stint at Watford FC last year where she scored six goals and gained valuable first team experience.\nJames Honeyman, academy manager, said: “We are delighted with how Michelle has progressed and are so proud of her journey to get to this moment.\n“Michelle has been a key part of our academy set-up over several years and we’re all looking forward to seeing what she achieves in the professional game.”\nMichelle has also represented England at youth level, appearing for the under 16, under 17 and under 19 sides so far during her international career.\nClare Wheatley, director of women’s football, added: “We are thrilled that Michelle has put pen to paper on professional terms with us.\n“Michelle has shown great goalscoring and playmaking ability at academy level and with hard work and dedication, we believe she has all the potential to apply this in the professional game.”",
  "word_count": 326,
  "scraped_at": "2026-02-14T12:41:49.633529"
}