{
  "article_id": "fdf45255f376",
  "url": "https://www.dailymail.co.uk/news/article-13286121/Bangladeshi-murder-suspect-Habibur-Masum-hunted-police-mother-stabbed-death-baby-son-believed-father-child-ex-lover-victim.html",
  "title": "Bangladeshi murder suspect Habibur Masum who is being hunted by police after mother was stabbed to death in front of her baby son is  believed to be father of the child and ex - lover of his victim",
  "date": "20240409T004500Z",
  "domain": "dailymail.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Fugitive Bradford murder suspect Habibur Masum - wanted over fatal stabbing of mother pushing a pram - 'is the father of the baby and ex-lover of the victim', locals say\n- Habibur Masum is wanted after Kulsuma Akter was stabbed to death on Saturday\nA Bangladeshi man wanted on suspicion of stabbing a mother to death while she was pushing her baby through Bradford in a pram is believed to be the father of the child.\nSuspect Habibur Masum is still at large after 27-year-old Kulsuma Akter was ambushed in a shocking daylight attack while pushing her five-month-old son in a buggy during a shopping trip on Saturday.\nPolice have warned members of the public 'not to approach' the 25-year-old, who MailOnline revealed on Monday had been on bail after being charged with assaulting and threatening to kill Ms Akter last November, and to 'call 999 immediately' if they see him.\nA worker at a shop whose CCTV captured the attack says they saw Masum talking to Ms Akter outside for a number of minutes before allegedly launching into a violent attack, and that they believed him to be the father of her child.\nPolice have already arrested a 23-year-old man on suspicion of assisting an offender and on Monday released a CCTV image of a grinning Masum boarding a buss from Bradford city centre nine minutes after the attack. He was last sighted getting off the bus in the Bradford Moor Park area, a couple of miles away.\nYesterday, Greater Manchester Police announced it had referred itself to the Independent Officer for Police Conduct due to its previous contact with Masum and Ms Akter.\nMasum, who is from the city of Sylhet in eastern Bangladesh, studied for a masters in digital marketing at the University of Bedfordshire, and shares travel vlogs of his 'adventures' and life in the UK to his 14 YouTube subscribers.\nHabibur Masum seen grinning on CCTV while waiting to catch a bus on Market Street in Bradford at 3.30pm on Saturday - nine minutes after Kulsuma was stabbed by an attacker\nThe suspect is a wannabe blogger who previously posted videos of shopping hauls in Primark\nMasum, who is from the city of Sylhet in eastern Bangladesh, studied for a masters in digital marketing at the University of Bedfordshire, and videos show him celebrating at his graduation\nThe student was filmed dancing at an event in a TikTok video shared last year\nA witness at a nearby fruit and veg shop in Bradford revealed the entire incident was caught on their CCTV, with footage showing a seemingly peaceful conversation being shattered by the horrific attack.\nThe bystander told The Sun: 'He just wanted to see his son. He has got the bus from Oldham to Bradford Interchange, then caught a taxi up here.\n'He has walked up Westgate from town with the mother and baby. They have then been chatting outside the shop for about five minutes, just talking together.\n'He has not tried to grab his son or anything, he just wanted to see him.'\nThey claim he then attacked Ms Aktar, who died at the scene.\nAccording to another eyewitness, Ms Akter was stabbed 'four to five times' in the neck while shopping with a friend. The baby was not harmed.\nGeo Khan, 69, who runs the shop, tried to resuscitate Ms Akter, who was one of his customers.\nMr Khan said he was sitting in his store on Saturday afternoon when he was alerted by screams on the other side of Westgate, in central Bradford.\nHe said he rushed over to Ms Akter, who was with a friend outside a convenience store on Wigan Street, and was joined by a doctor as others called the ambulance.\n'I was sitting in my shop and heard screaming,' Mr Khan said on Monday. I came out and I tried to check the pulse. There was no pulse.'\nHe said: 'Blood was all over on the floor and there were stab wounds in her neck.'\nMr Khan said he was joined by the passing doctor who took over trying to help Ms Akter, but agreed there was no pulse.\n'Him and me and another guy tried to rescue her, but she was already gone,' Mr Khan said. 'I don't think she was there any more.'\nHe said: 'Whatever happened, it's a very sad thing.'\nMr Khan said Ms Akter came into his shop the day before the incident, and he believes she only came to the area a few weeks ago.\nOfficers were seen storming a housing association property in Burnley on Sunday and were seen on Monday carrying out a thorough search of the garden\nThis second house was raided at the same time as the previous home\nOnline, Masum presents an image of himself as an enthusiastic traveller who enjoys discovering new cultures\nDays before the woman was murdered, Masum shared a clip in which two characters described how a man had 'lost' his bride during a walk\nOne video shows him admiring the wide range of of Bangladeshi made clothes in Primark before filming a children's offer and leaving with two full bags\nHe said the baby is about four or five months old. Mr Khan said he believes she is from Bangladesh.\nHe said: 'She was a very, very innocent person - the smile on her face.'\nAt a press conference on Monday, Assistant Chief Constable Damien Miller of West Yorkshire Police said the victim, Ms Akter, was from Oldham, Greater Manchester, where she had been in contact with police prior to moving to Bradford.\nHe added that Masum was also known to police in Greater Manchester.\n'On Saturday April 6, shortly before 3.20pm Kulsuma Akter was walking in Bradford city centre,' he said.\n'Kulsuma was with her young baby at this time, and was walking along Westgate when she was attacked and stabbed multiple times.\n'The emergency services were called at 3.21pm. However, despite the best efforts of members of the public, ambulance crews, and hospital staff, Kulsuma sadly lost her life due to the injuries. Her baby is safe and well and was not harmed in this incident.'\nPolice believe that Masum is still in the country and have been carrying out house to house enquiries in the Moore Park area of the city.\nMr Miller said: 'I would encourage Masum to contact us and hand himself in immediately.\n'At this stage, we have done an all ports warning, and I believe he is still in the country.\n'Masum is a suspect, we have a victim who died and I would encourage everyone to contact us if they see him and do not approach him.'\nWest Yorkshire Police is leading the hunt for Masum, but Greater Manchester Police is also heavily involved due to Masum's links with the area.\nDetective Superintendent Jude Holmes, from GMP, said: 'We share the shock and concern that our communities feel in the wake of this tragic incident, and our thoughts are with Kulsuma Akter's family at this truly distressing time.\n'Habibur Masum is wanted by West Yorkshire Police on suspicion of murder. Due to his links to Greater Manchester, we have our specialist officers following several lines of enquiry to locate him.\n'Due to previous police contact with Habibur Masum and Kulsuma Akter, Greater Manchester Police has made a referral to the Independent Office for Police Conduct.'\nConcerns have been raised in the past over the deaths of women who have accused male partners of violent behaviour before going on to be murdered by them.\nIn 2017, the IOPC's predecessor body, the Independent Police Complaints Commission (IPCC), said GMP's handling of three women who were murdered by their partners was 'unsatisfactory' but not misconduct.\nA source, who described himself as a friend of Masum's, told MailOnline that he had come to the UK from Bangladesh two years ago to study\nOne video shared to his 14 subscribers on YouTube showed him trying on different jumpers in Primark\nMasum giving a peace sign as he celebrates his graduation from the University of Bedfordshire\nMasum, 25, is being hunted by police who are appealing for members of the public to report any sightings of him\nMasum is pictured on CCTV wearing a duffle coat with three large horizontal lines of grey, white and black, as well as light grey tracksuit bottoms and maroon trainers\nAnother video on Masum's YouTube channel showed snow falling in the UK as he warned people to not stay out in the cold for long\nHorrific CCTV from a nearby food store shows the knifeman plunging his weapon into Ms Akter's neck. In mid-March, Masum had shared a clip in which two characters described how a man had 'lost' his bride during a walk.\nOfficers were seen storming a housing association property an hour's drive away in Burnley as part of their hunt for Masum at around noon on Sunday, with officers seen leading away a man and a woman.\nOne neighbour said: 'The riot vans pulled up and armed police jumped out. They were everywhere. A little while afterwards, a lady and an elderly gentleman were taken out of the house by police.'\nForensic officers arrived at the property in the early hours of this morning and have been seen searching the house and garden before taking away evidence in plastic bags. They also used cameras to look inside the gutters.\nAt the same time as the first raid, police then entered a semi-detached home in Burley after discovering Masum had links to the family living there. A witness said: 'Armed police went in first. There were a lot of police here. 'I don't think they found anything or anyone.'\nMasum appears to have been trying to carve out a career as an influencer, sharing travel vlogs of his 'adventures' and life in the UK to his 14 YouTube subscribers.\nOne post shows him admiring the wide range of Bangladeshi made clothes in Primark before trying on a range of winter jumpers. He then films a display showing children's clothes on offer and leaves with two full bags.\nIn another video from January, Masum is seen filming himself walking through a housing estate as snow falls down. He warns his followers who are new to the UK not too 'stay out in the cold too long' as they could get chest problems.\nHe has also shared clips to his 4,300 followers on Facebook telling them how to prepare a hospital bag for 'your newborn baby'. Another showed him setting up a child's cot.\nIt is understood Masum is a master's student at the University of Bedfordshire studying Digital Marketing\nIn January, Samin's UK Visas Support Centre shared a photo of Masum's Schengen visa as a success story\nOnline, Masum presents an image of himself as an enthusiastic traveller who enjoys discovering new cultures.\nOn his LinkedIn he describes himself as an 'adventure lover' and warns 'toxic people to stay away' from him.\nA source, who described himself as a friend of Masum's, told MailOnline that he had come to the UK from Bangladesh two years ago to study.\nHe said the suspect was married, had been living in Oldham and had wanted to go travelling across Europe.\nJust days ago the suspected attacker had shared a video on his YouTube channel, vlogging his trip from Manchester to Barcelona.\nThe wannabe influencer captured his trip from the moment he boarded the Ryanair flight to landing in the Spanish city, before encouraging his 14 subscribers to continue following for more upcoming videos.\nMasum's friend, who works at the visa company that helped him get a Schengen visa to travel countries in Europe, said last night that he was 'completely shocked' by the news.\nHe told MailOnline: 'I know him as a friend. I am shocked, really shocked about it. I am surprised, he's a nice and good person. I can't believe the situation. He had been in the UK for nearly two years, he is studying.\n'I know he's married. Two months ago he was living in Oldham, Manchester, but which area I do not know. He's a student so he wanted to go travelling and I helped him get a visa as he wanted to visit Europe.\n'I know him from seeing him in local places, playing football and cricket, so I know him from that. Then he told me he wanted to go visit Europe and said he wanted to apply for a visa.\n'He is a nice person from my knowledge but I have not heard from him since about two months ago. I am really shocked about this.'\nA murder investigation has been launched after Ms Akter was stabbed to death in Bradford on Saturday\nA police cordon put in place around the scene in Westgate, Bradford\nIn January, Samin's UK Visas Support Centre shared a photo of Masum's Schengen visa as a success story.\nA photo of the suspect's visa to Portugal read: 'Happy to help you. Schengen Visa from UK. Good idea, better application visa.'\nPolice named Masum on Sunday and urged the public to contact them with any sightings of him.\nOfficers were called to the Westgate area of Bradford at 3.21pm on Saturday after reports of a woman being stabbed by a man who then fled, and she later died in hospital.\nA knife was recovered from the scene of the incident.\nPolice described Masum as an Asian man, of slim build.\nHe was pictured on CCTV wearing a duffle coat with three large horizontal lines of grey, white and black, light blue or grey tracksuit bottoms with a small black emblem on the left pocket and maroon trainers.\nThere was no sign of any police activity in the area this morning but one bunch of flowers had been laid close to where the attack happened.\nA witness also reported seeing him wearing a grey hoodie with the hood up. He is believed to have links to the Burnley and Chester areas.\nDetective chief inspector Stacey Atkinson, of West Yorkshire Police's Homicide and Enquiry Team, said: 'We have had significant resources following up a number of lines of enquiry to locate Habibur Masum but at this time his whereabouts are unknown.\n'A knife was recovered from the scene of the murder, but we cannot say if Habibur Masum is armed, and I would urge anyone who does see him not to approach him but to call 999 immediately.\n'If anyone has any information about his movements or whereabouts since 3.20pm on Saturday please contact police as a matter of urgency.\n'We understand that the murder of a young woman in such shocking circumstances has caused considerable concern in the local community. Residents can expect to continue to see a significant police presence in Bradford as we make further enquiries and conduct reassurance patrols in the area.'\nIn a joint statement on Sunday, Bradford City ward councillors, Aneela Ahmed, Nazam Azam and Shakeela Lal, said: 'We are deeply shocked and saddened by yesterday's incident. Our thoughts and prayers are with the family and friends of the deceased.\n'We would urge anyone who has any information relating to the incident, to contact the police.'\nBradford West MP Naz Shah, whose constituency covers the city centre, described the incident as 'really shocking'.\nShe sent her condolences to the woman's loved ones and also urged anyone with any information to get in touch with officers.\n- Any current sightings of Masum should be reported to West Yorkshire Police via 999. Any other information that could assist the investigation should be reported via Live Chat online or by calling 101, quoting log 1071 of April 6.\nMost watched News videos\n- Extraordinary moment mass brawl breaks out between Brits on flight\n- Finance expert's TV interview interrupted by adorable granddaughter\n- Moment driver veers to target e-bike riders before killing teen\n- Moment Swiss bar fire owners collapse after being confronted\n- Astonishing moment a street is swallowed by a sinkhole\n- Chilling police interview of ISIS fanatic plotting UK attack\n- Food vlogger dies after 'eating toxic devil crab'\n- Spy cam shows woman on her knees next to Jeffrey Epstein\n- Deepak Chopra confronted over his relationship to Epstein\n- Toddler opens car door in traffic and sends biker flying\n- New video shows man with backpack similar to Guthrie kidnapper\n- Israeli hostage reveals how she survived being tortured",
  "word_count": 2742,
  "scraped_at": "2026-02-14T12:52:38.352585"
}