{
  "article_id": "fe14fdf0f619",
  "url": "https://www.90min.com/barcelona-sign-polish-international-striker-vfl-wolfsburg",
  "title": "Barcelona sign Polish international striker from VfL Wolfsburg",
  "date": "20240618T111500Z",
  "domain": "90min.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Barcelona sign Polish international striker from VfL Wolfsburg\n- The 27-year-old will join the Catalan side on a three-year deal\n- Pajor was crowned top goalscorer of the Bundesliga last season\n- She reportedly rejected two offers from interested clubs last year\nBarcelona have completed the signing of Polish striker Ewa Pajor on a three-year deal from VfL Wolfsburg.\nThe move will see the 27-year-old join the Catalan side until at least 30 June 2027. The Polish international captain has been instrumental in Wolfsburg’s success across the nine seasons she’s spent at the club.\nPajor has scored a total 138 goals in her 196 appearances, including 18 in the Champions League. Her ability to hit the back of the net saw her crowned top goalscorer in the Frauen Bundesliga for the second time at the end of last season, after bagging 18 goals in 19 games.\nDespite not winning the Champions League after reaching four finals, Pajor has collected five Bundesliga's titles and nine German cups.\nBarcelona will be relieved to have secured the star, after it was revealed last year that Pajor had rejected offers from Paris Saint-Germain and Manchester United. The two clubs were reportedly ready to pay between €600,000-750,000 (£514k-634k) in an effort to get the striker to put pen to paper.\nThe news will represent more than just a career move for Pajor, who’s spent the majority of her career playing football in Germany for Wolfsburg, and therefore will likely be an emotional farewell.\nShe initially signed a two-year deal with the club in June 2015, and then went on to sign two extensions bringing her to this year.\nDespite joining a group of talented strikers at Barcelona, including the likes of Pina, Mariona and Paralluelo, it’s likely Pajor’s goal scoring experience will earn her a place in the squad early on.\nHowever, it’s important to note that it’s still unclear who will be leading the Catalan side next season after Jonatan Giraldez announced he would not be renewing his three-year contract with the club.\nAfter being named head coach in 2021, Giraldez has won the Liga F title twice, as well as helped steer the team to Champions League victory in 2023.",
  "word_count": 367,
  "scraped_at": "2026-02-14T12:47:41.262171"
}