{
  "article_id": "fe17fb03fd02",
  "url": "https://www.afl.com.au/aflw/featured/1066736/north-stars-the-quiet-achievers-behind-the-roos-resurgence",
  "title": "North stars : The quiet achievers behind the Roo resurgence",
  "date": "20231124T081500Z",
  "domain": "afl.com.au",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "WHILE the legend of Emma Kearney grows with each All-Australian team she makes, the North Melbourne captain is just one part of a list that runs deceptively deep.\nFar from the club that burst onto the scene in 2019 with an aggressive list build, the North of 2023 is full of unassuming players who are not household names but play important roles.\nEven Jas Garner, arguably the best player in the competition flies somewhat under the radar.\nBut a new generation of quiet achievers has helped the Roos mature from the talented but inconsistent side of yesteryear to the well-organised and mentally tough side we see today.\nSpending a day at Arden Street, AFL.com.au spoke to a few of the key cogs - as well as coach Darren Crocker - in the North Melbourne machine.\nThe spark who's changed it all\nThroughout the day, when asking players, coaches and staff about the changing energy around the place, one name comes up over and over again – Lulu Pullar.\nThe 25-year-old doctor moved from Brisbane down to Melbourne for work opportunities this year, changing teams from the Lions to Roos in the process.\nPullar has brought some of the Lions’ trademark intensity and vibrance with her down from the Sunshine State.\n\"Someone like Brisbane, you can see how hyped up they are all the time, and we're trying to take a little bit of that, because I think we need a bit more of that – we're quite a reserved team, and we need a bit more heat and pressure, which we showed [against Melbourne],\" fellow defender Jaz Ferguson said.\n\"She's always positive and trying to get the best out of everyone. She just loves it. Loves learning, loves getting better – she said once, 'in a drill, if you get to put a bib on, you're trying to f*** up the drill, you're not there to just put a bit of pressure on. I want to f*** this up for everyone else.'\n\"She just brings a lot of energy and a never-lose attitude.\"\nThe loudest voice on the bench aside from Hrovat, Pullar's energy is vital. Missing the Roos’ round 10 clash against the Western Bulldogs with a cut head, she spent the game standing on the spectator side of the boundary next to the interchange bench to ensure her voice could still be heard.\nPlaying with intent\nUp until this week’s AFL men’s draft, winger Taylah Gatt was the youngest player at the club, turning 19 on November 1.\nAfter copping a hard hit during a game in season seven, the 169cm Gatt made a concerted effort to play with intensity in her second season, matching with opponents both taller and stronger.\n\"There was a specific instance last year (against Port Adelaide) where I copped a hit. In terms of resilience, I didn't really bounce back, and I really dwelled on it,\" Gatt said.\n\"From then on, I just kind of flipped and wanted to be a bit more physical. I'm pretty small in frame, so I learnt from that and grew from it a lot.\n\"I had just felt really young and a bit overwhelmed. [Midfield coach Brad Murphy] was so good to me, he called me the next day. He's quite a tough, blunt kind of guy, but he was so nice to me, it was unreal.\n\"I've tried to be more physical and a bit more combative. It's hard when I'm not too big myself. I think the mindset stuff is huge, tackling and stuff, if you've got the mindset and the intent behind it, it all comes together.\"\nAfter juggling year 12 with football last season, Gatt has moved up to inner-city Hawthorn from her family home in Mornington, living with Richmond's Charley Ryan, the pair having played all their junior footy together on the peninsula.\n\"Moving up to the city, being a bit older and having my licence has really helped this year,\" she said.\n\"We've got a team trademark we pride ourselves on, and that's a lot to do with relentlessness and being really hard to play against. Personally, that plays into my trademark too, which I try and bring my work rate and be so hard to play against. The pressure, intent and mindset is just huge, especially in finals footy.\"\nFrom rising star to established powerhouse\nMia King knows exactly what Gatt is working through as a young player.\nShe used to be the highly rated junior making the step up to AFLW, and finding her way against the bigger bodies.\nNow at 22, she's blossomed into arguably the most physical of North Melbourne's midfield.\n\"I've always had that see ball-get ball mentality even in juniors, I've always loved hunting and trying to get it out,” King said.\n\"I've had a few seasons now to continue working on my strength and fitness. The strength and conditioning coaches are awesome here, and I'm really pumped for finals. It's going to be so contested whoever it's against, it's never pretty, so having that strength is really important.\nThe Tasmanian now lives near-permanently in Melbourne, returning home to Launceston for December and January.\nShe is studying a physiotherapy degree part-time, and had an anatomy exam two days after this interview, and even squeezed in a bit of time to practice her flashcards with the club physios.\nHaving had a front row seat to North’s inability to break through its mental barriers, King reflected on the changes at the club that have finally seen the tide turn.\n\"We've been building the last few seasons, and I think we've had the setbacks now. We've made it to the finals, and we never quite get there,\" she said.\n\"Internally, I think we've always known we've got such a good system, but I think system doesn't mean anything unless you have intensity, effort and pressure.\n\"I think it started when we played against Adelaide. That was when we really lifted. I know we didn’t get the result we wanted, but just the energy we had in the rooms – it just creates this atmosphere that's contagious.\n\"I think all week we were just prepared, we brought the energy and effort. [The result came] with the system and all the underlying framework, combined with this new kind of approach and the drive to go all the way that has been building all season.\n\"The addition of talent we've had has just solidified the team. The defenders work so cohesively together, they know where they're going to be, midfielders again, small forwards, the young ones being able to bring it to ground, and the likes of Kate Shierlaw adding another tall target – we're a really strong team, but all those things together are driving it.\"\nThe defensive duo\nWhile the Roos’ midfield gets plenty of plaudits, two of North Melbourne's most important players go largely unnoticed by the punters.\nSarah Wright and Jaz Ferguson, the two blonde heads patrolling the last lines of defence.\nOften mistaken for each other from a distance, the two have quietly observed how the team has evolved in the last month, let alone the last few years.\n\"I've been part of the program for a long time, and in terms of the culture, it's been the best,\" Wright said.\n\"You could say it's new players, or a bit of an older group. We've still got those young ones, but they're mature heads now, they've been in the program for a bit. We've got Ruby Tripodi who's come in, but who's an older player anyway, the way she goes about it.\"\nThe pair bounce off each other with ease, Wright leaning back in her chair, opposite Ferguson, who sits forward, leaning on her elbows with hands clasped.\n\"It's the buy-in as well. Every single player this year, from the non-selected to the selected, whatever it is, everyone here is here to get the best out of it,\" Ferguson said.\nThe backline system itself hasn't changed much over the past few years, but the approach has, moving from a heavy opposition focus to reinforcement of their own structures.\n\"I know I've been here for a while (debuting in 2020), but I feel like I'm finally actually settling into my position and getting some confidence,\" Wright said.\n\"I used to worry about who I was playing against and really focus on that, watching highlights, but I've stopped doing that this year. I've become confident in what I'm doing and backing myself. Having 'Ferg' behind me, that gives me a lot of confidence to do what I can do.”\nThe pair were both drafted out of the VFLW – Wright from Carlton, and Ferguson from Collingwood two years later – and have formed a tight partnership.\n\"My first season, I was just enjoying being drafted, that season went flying past, I can barely remember it. My second season, I was just trying to hold my spot, and didn't have full confidence in myself of yet, whereas this year, I have solidified my position in the team and I know my role and I just love helping everyone and setting them up,\" Ferguson said.\n\"I love it when the ball doesn't come to me – as much as I'm sad when I have no disposals at the end of a game, but it is a good thing because it means all my other backline, Wrighty and Lize (Shannon), they're stopping it before it gets to me.\n\"I try not to think about being on the last line of defence, because I have nightmares if I do.\n\"No, it depends who it is – if it's Alyssa Bannan running on the wing and I'm on the last line, I get a bit nervous, but I don't actually mind it there, because I trust my teammates that if I do need to move forward or go one-on-one, they're going to come and support me, and they always do.\"\nThe coach\nUpon walking into North Melbourne's headquarters on Arden Street, the first thing that catches the eye is the trophy cabinet on the right-hand wall.\nFour cups, all with different logos – two different VFL emblems, the AFL Centenary edition, and an old-school AFL badge – while the wall behind lists each team and their coach.\nTwo from Ron Barassi, two from Denis Pagan.\nAnd listed in the forward pocket in the 1996 premiership team, is D. Crocker.\nThe North Melbourne coach spent 13 years on the AFL list, between 1985-1998, and after coaching stints at Port Melbourne and Richmond, returned to Arden Street as an assistant coach in 2004.\nHe's never left.\nCrocker has coached 15 AFL men's games in his own right over the years, acting as caretaker after the departure of Dani Laidley in 2009, and filling in at other points when required due to senior coach illness.\nThe AFLW program has challenged the father-of-four in a different way, overlaying a high-performance environment on a part-time program.\nThe weekly day in at the club has changed things, and quickly.\nCrocker himself takes some one-on-one player feedback meetings, trying to gradually get across the entire playing group.\n\"Prior to that, we really had to prioritise what was important. Personally, I've got a strong philosophy around developing – each day isn't a day to get older, it's a day to get better,\" Crocker said.\n\"I used to encourage the coaches not to spend too much time in offices, to get out onto the park. But now where it's evolved is that we can actually do a little bit of both, we can go through vision and get the players to try and translate it out at training, areas that are their weapons – never forget those – but also areas for growth they can actually work on to get better.\n\"I think if you look at the improvement in our younger players, and how quickly they've improved – Taylah Gatt in her second season, last year she was trying to combine year 12 and trying to have an impact on AFLW.\n\"Now, without year 12, she's at uni, but her growth, Bella Eddey, Alice O'Loughlin, Tess Craven. I look at Jaz 'Ferg' coming from VFLW and how much she's improved. It's player-driven, absolutely, but from a program perspective, holding up our end of the bargain and providing resources for them to actually improve.\"\nHe agrees that the Adelaide game was evident of a turning point within the group, reached the week prior in the loss to Melbourne.\n\"I saw a game that was closer to what we talk about being a North game, closer to our identity, in that game. We did so much right in order to win that game, and then we didn't come away with that result,\" Crocker said.\n\"After that game, I just felt they were so disappointed in losing that game, which was right within our grasp, that I was hoping there would be a strong steely resolve that came out of it.\n\"I think there has been. Whether you call it belief or a resolve, I think they really got the belief that if we do play to our identity, to our team image, then we can match it with the best. They were devastated after that game.\"\nWill Crocker – the player turned men's coach turned women's coach – be just the third man to lead a North Melbourne senior side to a flag?\n\"I just feel like our program is such a good program, has such good people – high performance, coaching, medical, operational, then to the playing group. I was really fortunate to have played in a flag myself, in '96, and I know how wonderful it is for people to get that reward for effort,\" he said.\n\"I know the work people put in, it's a part-time program for a lot who come. I would just love for them to experience what I've experienced as a player.\n\"Little bit selfishly, I'd love to experience it as a coach, I've never experienced winning a premiership as a coach in the elite level, I have at junior level. I think it would just be wonderful.\n\"For this current group, it would be an unbelievable legacy to leave. There's a huge photo of the AFL men's premiership team of '75 downstairs.\n\"Geez, how good would it be if this group could emulate that?\"",
  "word_count": 2399,
  "scraped_at": "2026-02-14T12:56:53.915703"
}