{
  "article_id": "fe3d222322f5",
  "url": "https://www.mirror.co.uk/news/politics/schools-told-must-offer-girls-29397804",
  "title": "Schools told they must offer girls the chance to play football in victory for Lionesses",
  "date": "20230308T010000Z",
  "domain": "mirror.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Schools told they must offer girls the chance to play football in victory for Lionesses\nEngland women’s captain Leah Williamson welcomed new rules ensuring boys and girls get chance to play same sports as 'the legacy that we want to live much longer than us as a team'\nSchools must offer the same sports for girls as they do for boys, under rules to be announced today.\nIt is a victory for the #LetGirlsPlay campaign which has been demanding girls get the chance to play football .\nThe campaign was launched by the Lionesses squad and the Football Association’s (FA) after the England Women’s team’s victory at the Euro 22 tournament last year.\nThe Government's new standards aim to ensure equal access to sports, making it clear that girls and boys should be offered the same sports during PE and after-school clubs.\nSchools are being asked to offer a minimum of two hours of quality Physical Education (PE) per week through a refreshed School Sport Action Plan.\nREAD MORE: Lionesses send letter to Rishi Sunak and Liz Truss urging more girls football in schoolsThe package, announced today on International Women’s Day, is backed by over £600million in funding over the next two academic years for the PE and Sport Premium and £22million for the School Games Organisers (SGO) network.\nAlongside this work, Ofsted will be publishing a report into PE in the coming months, which will inform future inspections and set out what they believe is possible in terms of offering high quality PE and equal access to sports.\nEngland women’s captain Leah Williamson said: “The success of the summer has inspired so many young girls to pursue their passion for football.\n“We see it as our responsibility to open the doors for them to do so and this announcement makes that possible.\n“This is the legacy that we want to live much longer than us as a team. On behalf of all the Lionesses players, we'd like to thank our teammate Lotte Wubben-Moy as a driving force behind this transformational change.\n“We couldn’t be prouder to stand alongside her and we all look forward to seeing the impact this legacy creates.”\nPrime Minister Rishi Sunak said: “Last year the Lionesses’ victory changed the game. Young girls know when they take to the pitch that football is for them and, thanks to the Lionesses, they too could be a part of the next generation to bring it home for their country.\n“We want schools to build on this legacy and give every girl the opportunity to do the same sports as boys, as well as provide a minimum of two hours of PE. This means every child can benefit from regular exercise and we are proud to provide them with the support needed to do so.”\nThe FA’s Chief Executive, Mark Bullingham, said: “The magic of last summer’s Euros victory can now live on with a legacy that has the ability to change the future of women’s football and positively impact society.\n“Equal access for girls is one of The FA’s strategic ambitions and for such progress to be made is a very proud day. We’re all extremely grateful to the players for using their voice to deliver change and would like to place on record our thanks to Government for the positive measures announced today.”\nEducation Secretary Gillian Keegan said: “As someone who grew up in Liverpool, a city dominated by its love for football, I know first-hand the power of sport in bringing people together – whether on or off the pitch.\n“Every child – girl or boy - should have access to high quality sport and activities. Not only are these opportunities great for both physical and mental health - but also for all those other skills young people will need throughout their life like teamwork and communication.\n“Today, on International Women's Day, we are breaking down the barriers some children face to access sport and building on the Lionesses' legacy to ensure girls have the same access to all their favourite sports as boys.\"\nHealth and Social Care Secretary Steve Barclay said: “Funding PE in schools can help inspire the next generation to build on the international sporting successes of the Lionesses at the Euros, the Red Roses and the England Women’s Cricket Team.\n“This International Women’s Day, we’re supporting schools to improve the quality of their PE provision including equal access to sports. This will help to level up opportunities for girls across the country so they can play sports such as football and cricket, alongside after school activities targeted at girls and other disadvantaged children.\n“We want young people to develop healthy habits whilst having fun at the same time, regardless of gender or background.”\nFollow Mirror Politics on Snapchat , Tiktok , Twitter and Facebook .",
  "word_count": 803,
  "scraped_at": "2026-02-14T13:03:14.536380"
}