{
  "article_id": "fe6ba24b1861",
  "url": "https://www.si.com/college/missouri/all-things-mizzou/mizzou-gymnastics-adds-transfer-from-illinois-buzz-monday-may-5-2025",
  "title": "Mizzou Gymnastics Adds Transfer from Illinois ; The Buzz , Monday , May 5 , 2025",
  "date": "20250505T070000Z",
  "domain": "si.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Mizzou Gymnastics Adds Transfer from Illinois; The Buzz, Monday, May 5, 2025\nMissouri Tigers gymnastics made their first addition of the offseason Sunday afternoon, with former Illinois gymnast Makayla Green announcing her decision to transfer to Missouri.\nGreen is coming off a standout season with Illinois after missing the 2024 season with injury.\nEntering the fifth year of her career, Green rounded out her 2025 campaign by finishing No. 6 overall on the uneven bars in the Big Ten Championships, matching her career-high score of 9.925. She replicated this score to win the event at the NCAA Regionals.\nGreen also has set impressive career highs on both the vault and balance beam, scoring a 9.775 on the vault twice in her career, and a 9.7000 on the balance beam once.\nMissouri is looking to build off its best season in program history, finishing third in the NCAA Championships. The Tigers are set to lose multiple contributors on the bars rotation, so Green fills a top need.\nMonday's Mizzou Schedule\n- Women's golf in the NCAA Championships in Norman, Oklahoma at 9 a.m. - Live Stats\nSunday's Mizzou Results\n- Baseball lost 2-4 to Georgia - RECAP\nCountdown to Mizzou Football's 2025 Football Season Opener:\n115 days.\nDid you notice?\n• Missouri women's basketball legend Sophie Cunningham made her second preseason apperence with the WNBA's Indiana Fever, this time playing against the Brazilian national team at Iowa, the alma matter of Fever star Caitlin Clark. Cunningham scored six points and grabbed three rebounds in a 108-44 win.\n• Missouri offensive lineman Cayden Green was rated as the 28th best prospect in the 2026 NFL draft by Joseph Acosta of SBNation. He's the fourth-highest rated offensive lineman on the board.\nCheck out our social media:\n- BlueSky: @mizzouonsi.bsky.social\n- X (formerly known as Twitter): @MizzouSI\n- Instagram: MizzouOnSI\n- Facebook: Missouri Tigers On SI\n- YouTube\nRead more Missouri Tigers news:\nJoey Van Zummeren is the lead writer for Missouri Tigers on SI, covering the Tigers since 2023. He also has experience reporting on the Green Bay Packers and high school sports. A Belleville, Ill., native, he joined Missouri Tigers On SI as an intern in 2023.\nFollow JoeyVZ_",
  "word_count": 367,
  "scraped_at": "2026-02-14T13:21:00.700911"
}