{
  "article_id": "fe73ac57e562",
  "url": "https://www.standard.co.uk/culture/theatre/dear-england-national-theatre-gareth-southgate-james-graham-joseph-fiennes-b1087271.html",
  "title": "Dear England :  Football is like gladiator ; stadiums are Colosseums  ",
  "date": "20230614T083000Z",
  "domain": "standard.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Let’s be honest, Gareth Southgate is far from your average theatrical protagonist. Worlds away from a booming Shakespearean king with a thirst for revenge and a serious case of hamartia (I can think of several football managers who more readily slot into that role), England’s quietly-spoken manager’s origin story isn’t exactly the ego-inflating rise to triumph you’d expect from the central figure in a National Theatre play.\nThough admittedly there is a hint of tragedy, since the former pro-footballer is heavily associated with devastating loss, at one time most famous for missing a crucial penalty in 1996 as England faced Germany in the Euro semi-finals. The image of Southgate looking completely crushed, moments after smashing the ball straight into Andreas Köpke’s waiting gloves, is embroidered into his backstory, along with his more recent penchant for M&S waistcoats.\nAnd yet here he is, the calm centre of a new play, Dear England, by the Nottingham-born playwright James Graham, which opens at the National Theatre next week. Known for grappling with weighty institutions and political hot topics, usually from an unexpected angle – one of his breakthrough plays, 2012’s This House, explored the business of government from the vantage point of the whip’s office – Graham has his own sharply witty take on the journey of the England men’s team, and their ongoing quest to bring home a trophy. Southgate is played by theatre veteran (so much so that he’s played the Bard himself in Shakespeare in Love) Joseph Fiennes, alongside Gunnar Cauthery as Gary Lineker, and Gina McKee as team psychologist Pippa Grange.\nInitially brought in as England’s interim manager in 2016 (replacing Sam Allardyce after just one match, following his sudden resignation amid a corruption scandal) the plan was never for Southgate to stick around, and yet something about his unusual approach to leadership seemed to revitalise a team weighed down by 57 years of hurt and counting.\nHe hired Grange to help the team navigate the immense pressure and psychodrama of the England shirt and carry its vastly symbolic weight, and traded changing room slanging-matches for swimming pool bonding sessions atop inflatable unicorns. His squad were encouraged to share their greatest fears and most formative moments with each another in intimate chats; above the fear of failure, they were taught instead to treasure the pride of representing their country in the first place.\n“Only around 1,200 players have represented England at senior men’s level. Ever,” Southgate wrote in 2021 in an open letter entitled Dear England, from which the play takes its name. “It’s a profound privilege.” That letter was written in response to booing of his players taking the knee before Euro 2020 matches, and the play also focuses strongly on the hopeful young squad, which included Marcus Rashford (played here by Darragh Hand, recently acclaimed in For Black Boys Who Have Considered Suicide When the Hue Gets Too Heavy in the West End), captain Harry Kane and midfielder Dele Alli, played by relative newcomers Will Close and Lewis Shepherd respectively.\nWhen I meet the trio at the National Theatre ahead of rehearsals, they joke that they’ve undergone a similar transformation to their onstage counterparts under their unofficial manager Fiennes; a “generous and easygoing” ringleader.\n“We’ve become a team,” says Shepherd. “We’ve got a lot of love for each other. I haven’t had a bad day, this whole two months.” The biggest challenge the Manchester United fan has faced so far is having to briefly wear a Tottenham shirt (Alli played for the Premier League side between 2015 and 2022). “It was burning into my chest. You don’t even understand,” he groans. “My girlfriend’s an Arsenal fan, so you can imagine her distress.”\nIn the early days of rehearsals, with the final stages of the Premier League hotting up, quite a few Liverpool-supporting teammates were hopeful that Close’s side Everton would get relegated. “There’s been a bit of tit for tat in the rehearsal room,” Hand laughs.\nThough football might initially seem like a slightly odd subject to explore in a stage play, the storytelling and mythology that is woven into the sport lends it a certain classical quality, says Shepherd: “Football is like the modern gladiator; stadiums are our Colosseums.”\nRead More\nGraham and the cast were also keen that Dear England should be accessible to all audiences; not just those with a forensic knowledge of the great game. The cast has taken to using a tiered ranking system to represent their footie IQs. Like Fiennes, Shepherd, Hand and Close all count themselves as proud members of the B-team.\nWhat sets the As apart? It’s about how deep you want to go with football,” Close says. “If you know who was in goal for Nottingham Forest in 1974, then... well. It’s a useful shorthand in rehearsals. Is this inclusive enough? Are you still getting a good story? If you’re still able to read into those characters without all of that prior knowledge, that’s the most important acid test of the piece.”\nAs Shepherd sees it, “it’s about football, and it’s not about football at the same time.” Beyond simply telling the story of England’s quest to bring home some silverware at long last, Dear England is equally fascinated by the vast changes that Southgate made to help shift the mentality of his heavily-burdened team, and how his approach has parallels with tackling toxic masculinity and discrimination wider society.\nA notoriously tough field to break into, professional football places immense pressure on young players as they move far from home to enter development academys and vie with their friends and peers for a hyper-competitive signing. Even when players break through to the highest levels of the sport, the price of slipping up is enormous.\nBoth on and off the pitch, discrimination is rife; in a 2022 YouGov poll, 60 per cent of respondents said they believed racism is a serious problem in professional football, while half viewed homophobia as a serious issue. According to a harrowing study by Warwick Business School, domestic abuse and violence increases by 50 per cent following an England men’s match victory at the world cup.\nIt’s something that Southgate directly singled out in his Dear England letter. “Unfortunately for those people that engage in that kind of behaviour, I have some bad news,” he wrote. “You’re on the losing side. It’s clear to me that we are heading for a much more tolerant and understanding society, and I know our lads will be a big part of that.”\n“Fan violence, both in 1996 [when Southgate missed a vital penalty] and when we hosted the [2020 Euro] final at Wembley,” is explored in the play, says Close. “It's quite far-reaching. It touches on men’s mental health and masculinity; that is a language that everyone knows”.\nGraham and the cast were also interested in the way that Southgate encouraged fans to have more compassion for the national team, and as Hand puts it, the idea of viewing “players as like commodities, as opposed to human beings.”\n“How can you put a price on a human life?” asks Shepherd. “But football players actually do have a price, and a value. It dehumanises them, in a way. They’re like: my life is football, I train six times a week, I play three times a week. It’s one of many things that makes viewers and fans lose touch with them as people.”\n“From the audience’s perspective, there’s this kind of recurring trait of hating on England,” says Close. “Where does that come from? Why are our expectations always so high? And why do we tend to anger so quickly? Violence, racism… why is that happening and how can you unlock some of that?”\nAs well as documenting the squad’s proudest moments – from reaching the Euro 2020 finals, to overcoming a national spot-kick curse to beat Colombia on penalties – the play also visits the various scandals and setbacks that occurred during this tumultuous time. As well as wider shifts in the national consciousness such as Brexit, last year’s controversy around the team abandoning plans to wear LGBTQ+ Pride armbands in Qatar gets a look in, along with the racist abuse directed towards Saka, Rashford and Sancho after they each missed crucial penalties against Italy in 2021.\nMostly focused on the trajectory of the England squad, the play does not delve into Alli’s suspension from a match against Manchester United in 2020 after the FA found him guilty of perpetuating racist, anti-Asian stereotypes on social media.\nThe cast collaborated heavily with Graham on the script throughout rehearsals (the playwright tends to work on his scripts throughout previews, and as a result it remains under wraps), and real-life Southgate also met with Graham to inform the story. Though there aren’t any on-stage kickabouts – “these boys are pretty good, but elite Premier League footballers?” Close laughs, “We’d show ourselves up” – it’s a highly physical play with a great deal of movement and choreography to master. Though the cast are coy about those infamous unicorn pool toys, they’ll be making an appearance too. “Keep your eyes peeled,” Close says.\nAs any long-suffering England fan will know all too well, there is no fairytale ending to this story; though the Lionesses stormed to victory in last year’s women’s Euros, the men’s squad are yet to convert years of growth into a glimmering trophy.\n“Finishing at Qatar feels like a bit of an ellipsis,” says Close, “and the play embraces that. For Gareth, in the world of our play… an understanding of his role, and what he’s able to offer that nobody else could based on his own experiences, comes to pass.”\nFor Hand, the beauty of Dear England is that football is just the kicking-off point (sorry), and a lack of neatly tied-up ending is perhaps the entire crux of a story about learning to lose with grace above winning at whatever cost.\n“It does this beautiful thing, the play. There’s beats of tragedy, joy, and laughter; it all undercuts so beautifully. It’s a real journey,” he says. “I feel happy, honored and privileged to be able to tell that sort of story.”\nDear England is at the National Theatre until August 11; nationaltheatre.org.uk",
  "word_count": 1704,
  "scraped_at": "2026-02-14T12:59:59.893076"
}