{
  "article_id": "fea140c537f0",
  "url": "https://www.the42.ie/chelsea-womens-champions-league-results-round-up-6339300-Mar2024/",
  "title": "Chelsea reach Champions League semi - finals as draw with Ajax secures progress",
  "date": "20240328T020000Z",
  "domain": "the42.ie",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Chelsea 1-1 Ajax\n(Chelsea win 4-1 on aggregate)\nCHELSEA REACHED THE Champions League semi-finals for the fifth time in their history after a 1-1 draw with Ajax at Stamford Bridge secured a comfortable 4-1 aggregate victory.\nThe Blues entered the evening already 3-0 ahead from their first-leg victory in Amsterdam and further eased any tension when Mayra Ramirez netted her first Champions League goal to open the scoring after 33 minutes in west London.\nIt came after a nervy start for the hosts, who narrowly avoided conceding from a first-half mishap before Chasity Grant drew Ajax level with one of few chances after the break.\nChelsea will face the winners of the last-eight clash between holders Barcelona and Norwegian side Brann, who play their quarter-final second leg tomorrow night.\nEmma Hayes’ side had multiple chances to do open the scoring but finally found their breakthroughin the 33rd minute when Guro Reiten slipped Ramirez through and the Colombian obliged with a low finish through the legs of crouching Ajax keeper Regina van Eijk.\nJonna van de Velde looked to level, firing just over, and while Chelsea enjoyed a surge of chances before the break it was Ajax who looked most likely to score when Romee Leuchter sent an effort across the face of goal on the stroke of half-time.\nLeuchter threatened again, forcing Zecira Musovic into a low save after the restart, one of the only chances for either side until Tiny Hoekstra played through Grant, who drew the sides level when she fooled Musovic with a low finish in the 65th minute.\nIt took a brilliant block from Musovic to claw away another Leuchter effort and Ajax kept the Chelsea keeper busy to the end.\nMusovic denied substitute Danique Tolhoek’s attempt as the Blues – who had their own late chances – secured safe passage to the final four.\nLyon 4-1 Benfica\n(Lyon win 6-2 on aggregate)\nBRACES FROM DELPHINE Cascarino and Kadidiatou Diani gave eight-times titleholders Lyon a 4-1 victory at the Groupama Stadium to claim the tie 6-2 on aggregate.\nMarie-Yasmine Alidou equalised minutes after Cascarino’s opener at the end of the first half, but the 27-year-old hit a second shortly after half-time before two injury-time Diani goals gave Lyon a comfortable victory.\nLyon created several good early chances but failed to find a way past Lena Pauels in the Benfica goal until the 43rd minute.\nCascarino gave Lyon a two-goal buffer on aggregate when Eugenie Le Sommer chased down an underhit backpass, won her challenge with Pauels and then had the presence of mind to lay the ball back to the French international, who duly finished with a delightful chip over the stranded ‘keeper and two retreating defenders.\nBut Benfica struck back instantly to reduce the deficit to one goal when Alidou bundled home Lucia Alves’ cross, following a sublime defence-splitting pass from deep by Kika Nazareth.\nLyon made two changes at half-time, and the move soon paid off when Cascarino doubled up with a fine individual effort six minutes into the second half.\nPicking the ball up in midfield, she drove forward before unleashing a powerful shot from outside the area.\nOne minute into added-time, Diani tucked away Lindsey Horan’s knockdown in the box to cement Lyon’s spot in the semi-finals.\nThe margin of victory then became even greater five minutes later when Diani miscontrolled the ball and Catarina Amado’s clearance actually glanced off the French forward and into the net.\n– Press Association & © AFP 2024",
  "word_count": 582,
  "scraped_at": "2026-02-14T12:47:00.539978"
}