{
  "article_id": "feb42785042d",
  "url": "https://www.editorandpublisher.com/stories/eps-2024-class-of-news-medias-10-to-watch,249033",
  "title": "E & P 2024 class of News Media 10 to Watch | Editor and Publisher",
  "date": "20240411T051500Z",
  "domain": "editorandpublisher.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Posted\nThe 2024 class of 10 News Publishers That Do It Right is now E&P’s News Media’s 10 to Watch. They represent our industry with small-town publishers to large properties; monthly, weekly and daily publications; legacy print and digital publications; business, university and alternative publications — representing the breadth and depth of our industry. Each faced challenges and innovated to overcome them, and each has a story to tell — revenue, content, community service, engagement, business model or platform. We’re excited to highlight these 10 to Watch to give you energy and ideas. At E&P, we are inspired by their efforts to keep news vibrant in their local communities.\n(Alphabetical, by publication name)\nACAMS Today\nMiami\nIn the aftermath of 9/11, there was an increased need for anti-money laundering experts and counter-terrorism financing professionals. ACAMS was launched in 2001 to address that need. Starting as a small four-page newsletter, ACAMS Today has become the leading magazine on all global anti-financial crime-related topics. The publication is “dedicated to bringing insightful and high-quality content to empower anti-financial crime professionals with the knowledge and skills they need.”\nA readership of over 100,000 worldwide and more than 250 awards to date prove its success. Published in six languages (English, Spanish, French, German and Chinese, both simplified and traditional), ACAMS Today is “dedicated to ending financial crime through thought leadership, continuing professional education and a best-in-class peer network.”\nEditor-in-Chief Karla Monterrosa-Yancey has led the organization since 2006 and provides leadership, continuity and innovation. Beginning with one employee and one designer, ACAM has grown to seven employees, a design team and freelancers. Monterrosa-Yancey shared, “(Since) the magazine is written by members for members … we have hundreds of freelancers who share their knowledge freely for the betterment of the industry.”\nAlong with the ACAMS Today magazine, ACAMS also provides certifications for anti-financial crime (AFC) professionals, beginning with their Certified Anti-Money Laundering Specialist (CAMS) designation. To further serve their membership, ACAMS holds an annual flagship assembly, webinars and networking platforms, in addition to the magazine and MoneyLaundering.com website.\nAlong with all financial crime topics, they also work to inform their members about elder abuse, human trafficking, fraud scams and other financial crimes that affect our communities. According to Monterrosa-Yancey, ACAMS is “committed to the fight against human trafficking. We have highlighted numerous survivors who have shared their stories of overcoming darkness and ending on the side of thriving and those who are lending a hand through their work against financial crime to stop this heinous crime.”\nTheir work has been recognized by the Vatican, the World Bank, the United Nations, the Financial Action Task Force, the Financial Crimes Enforcement Network, and the Antiquities Coalition, among others.\nACAMS plans to continue growing and innovating. Soon, they will launch an Artificial Intelligence (AI) column aimed at their AFC readership. Their popular Partnership edition will return this summer, highlighting partnerships, law enforcement and government agencies that fight financial crime.\n“When I joined ACAMS, I was tasked with converting the existing newsletter into a world-class global magazine geared toward career-minded AFC professionals. This is how the ACAMS Today magazine came to be. Through carefully cultivating a strong contributor base of subject-matter experts in the industry and surrounding myself with a high-caliber team of designers, writers, editors and content producers, we have achieved the goal of being not only the premier magazine in the AFC industry but the go-to magazine for professionals seeking to enhance their AFC skills,” said Monterrosa-Yancey. We think this niche business publication is one to watch.\nAlabama Media Group\nAlabama\n2023 was a pivotal year for Alabama Media Group, as in February, they transitioned to an all-digital news operation led by their AL.com brand. Since then, they have continued their growth, averaging 10 million monthly readers to their flagship site and distributing content across social media platforms to garner over 9 million followers. And, bucking a national trend, AL.com’s newsroom has 25% more journalists than five years ago, becoming one of the Southeast’s largest investigative teams. AL.com was highlighted in Northwestern University’s 2023 “State of the Local News Report” as one of the bright spots — “outlets that provide their communities with excellent reporting essential to democracy while progressing in the quest for stable, sustainable business models.” AL.com is part of the Advance chain, and the network evolved from three daily Alabama papers — The Birmingham News, the Huntsville Times and the Press-Register of Mobile.\nOne of AL.com’s bright spots is the Alabama Education Lab, which delivers solutions-based journalism and communication with educators, parents, students, advocates and business leaders statewide about efforts to improve schools and increase learning. It’s staffed by a team of journalists dedicated to covering K-12 education “through the lens of what they can do to help Alabama kids achieve their potential.”\nCoverage like the kind that has come from the Education Lab and an expanded newsroom has led to multiple awards. In just 2023 alone, AL.com won two Pulitzer Prizes and the top prize in the National Headliner Awards, was nominated for five Emmy awards and was named finalist for two top national education awards. In addition, AL.com Columnist Roy Johnson was inducted into the National Association of Black Journalists Hall of Fame.\nA shift from a legacy transactional business to a vertical sales strategy has delivered a 77% increase in local digital ad revenue. Vertical-focus teams are staffed with marketing strategists who are specialists in their industry, bringing critical expertise to local advertisers and revenue to AL.com.\nAnd there is plenty to sell — from the thriving AL.com to a solid group of brands to round out their offerings: “This is Alabama includes stories, videos, photos and merchandise that “celebrates the great state of Alabama and uncovers the amazing people, places and experiences she has to offer.” The “Reckon” brand covers issues that matter to younger Alabama readers — diversity, women’s rights, reproductive rights, climate change, gender equality, student loans and more. “It’s a Southern Thing” originally began with comedic videos about life as a Southerner and has grown to be a social media hit, including videos and branded merchandise.\n2024 appears to be a continuation of AL.com’s success, as they focus on Alabama’s dangerously understaffed and overcrowded (168% capacity) prison system — zeroing in on the state parole board’s denial to release inmates eligible for parole by the state’s own standards. Their reporting has already shown some changes and movement on reform bills. In addition, the Ed Lab will produce a “College Survival Guide” to help Alabama high school students make decisions while navigating the complex path of post-secondary education.\nNatalie Pruitt, president of Alabama Media Group, said, “We’re proud to lead the way into an all-digital future growing revenue, audience and award-winning journalism. Keeping AL.com free to our communities is important to our mission.” Pruitt continued, “For those readers who want a curated experience similar to their newspaper, our flagship brands are still available in a daily digital edition for $10 per month.” With so much going on, Alabama Media Group is one to watch.\nAmsterdam News\nNew York City\nThe New York Amsterdam News is touted as “America’s most influential oldest continuously published Black newspaper serving the nation’s largest Black and Brown community.” The award-winning publication has 114 years of Black aspirational and racial justice journalism.\nIn her nomination of Amsterdam News, Apryl Pilolli, director of technology and innovation for the Knight x Local Media Association Bloomlab (Black Locally-Owned and Operated Media), said, “The Amsterdam News serves as a powerful example of resilience and innovation in the face of industry challenges. Their commitment to impactful journalism, community engagement and financial sustainability makes them a deserving candidate (for E&P’s 10 to Watch).”\nAccording to Pilolli, Amsterdam News successfully transitioned from a traditional legacy print publication to a diversified revenue model, encompassing new digital products, a user-friendly website, strategic partnerships leading to multi-month high-figure advertising, investments in grant-writing and securing $600,000 in journalism philanthropy from prominent organizations.\nThe numbers tell the story. AmsterdamNews.com now has 250,000 average unique monthly visitors. Editorially Black has increased audience to 20,000 weekday readers. Amsterdam News has over one million average monthly social media engagements and 10,000 legacy print and single-copy subscribers.\nRevenue has followed the same growth. Last year, Amsterdam News achieved a 40% increase through innovative strategies, including developing new digital products that generated $389,000 in new revenue.\nTechnology featured prominently in the Amsterdam News transformation. Their adoption of NewspaperManager.com fueled a 100% increase in major advertising campaigns over $50,000. And the Column.org implementation generated a $200,000 increase in collections from legal LLCs. In addition, the error rate was reduced across production, finance and advertising from 30% to nearly 0%. BlueLena.com and ActiveCampaign.com adoptions brought exponential increases in digital subscriptions from zero to 3,000 (one of the highest Black readerships among all legacy Black newspapers nationwide) and increases in newsletter readership from 900 to 18,000.\nIn recent years, Amsterdam News has also grown 25% in staffing — to 18 full-time staff and 60 freelancers. They are proud to have been unionized since 1936. They were the first business where Black workers unionized against Black management — and across all departments.\nEditorial has driven much of their success with award-winning content that addresses their community’s concerns. BlackLight, the first investigative unit in a legacy Black newspaper, has garnered recognition, awards and audience since its launch in 2022. “Beyond the Barrel of the Gun,” a BlackLight investigation addresses gun violence in Black and brown communities through solutions journalism. Another BlackLight investigation, Black to Nature, confronts the lack of access to building opportunities for engagement with the natural world to improve Black health and quality of life while exposing the impact of climate change on NYC’s communities of color. The solutions journalism approach has fostered deeper audience engagement and attracted sponsorships.\nAmsterdam News is all about listening to its community. In 2023, Amsterdam News hosted community events and collaborations, resulting in a 30% increase in print circulation from one partnership alone. To better communicate, the publication reconceived the 114-year-old legacy print newspaper with gorgeous internally designed front covers and long-form investigative journalism from its BlackLight investigative unit.\nThe awards have followed this transformation. In one year alone, Amsterdam News received nearly 20 industry recognitions and journalism awards from a variety of organizations like the New York Association of Black Journalists, National Newspaper Publisher’s Association, Local Media Association and E&P. Their Publisher and Editor-in-Chief Elinor Tatum has also been recognized by New York City and the state as one of the Top 100 Power Brokers. All of this tells us that Amsterdam News is definitely an organization to watch.\nBusiness Publications Corporation\nDes Moines, Iowa\nReturning for a second year in a row, this niche publishing company serving the business, cultural and philanthropic communities in Iowa’s capital city is growing, thriving and staying nimble in a changing media landscape, laser-focused on meeting the evolving needs of its readers. Business Publication Corporation (BPC) was founded as a business publishing company in 1983 by visionary entrepreneur Connie Winer. Their flagship weekly publication, the Business Record, and Des Moines' cultural publication, dsm magazine, published six times a year, continue to lead the product line. However, across its three divisions, BPC produces over 50 print and digital products and hosts more than 40 events each year.\n2023 was a banner year of progress and advancement. BPC successfully expanded its audience, grew reader revenue and improved its bottom line while moving from the historic building that housed its offices for 40 years to a new, bright, open-plan location. In addition, BPC celebrated two major milestones — the 40th anniversary of their flagship brand, the Des Moines Business Record, and the 20th anniversary of dsm magazine, their award-winning city publication. They celebrated the 20/40 anniversary with an epic anniversary party that sold out to over 600 individuals in three weeks, generating more revenue than any other event in BPC’s history.\nThey used the 20/40 anniversary party to celebrate the milestones, strengthen their current brands and introduce new products. BPC’s “News Changemaker Awards” recognized individuals who made positive contributions to Des Moines. The Changemaker finalists and winners were featured in the magazine and digital publications, and organizations could place congratulatory ads, generating more revenue.\nA big push in 2023 was BPC’s digital transformation. Over the year, they redesigned and relaunched a website for the Business Record, enhanced and promoted their digital newsletters and increased their social media presence. A new Customer Relationship Management (CRM) system was an investment that has paid dividends already. And BPC added new team members with digital expertise and experience to lead them through the transformation and beyond. All of this is helping them elevate their digital presence, reach new audiences and increase engagement.\nMost of all, BPC’s continued focus on its mission “to inform, inspire, elevate and celebrate the community through communication, connections and recognition” drives its success. As Founder Connie Wimer said at the 20/40 anniversary event, “BPC has been here for 40 years … and we’re just getting started.” For a second year, Business Publications Corporation is still one to watch.\nCommunity Impact\nPflugerville, Texas\nFrom its beginnings in 2005, Community Impact (CI) has been leading the innovation charge in the news industry, and 2023 continued that charge. CEO John Garrett calls CI’s strategy “phygital” because they believe in and utilize the power of both printed newspapers and digital newsletters to inform their communities.\nWith 160 “impacters” across all departments, CI covers 39 markets across Texas in the Austin, Houston, Dallas-Fort Worth and San Antonio regions. Their hyper-local focus means that they may have several editions within one city/region. And, they have unique print newspapers, email newsletters and website homepages for each market.\n2023 brought several innovative projects across CI. First, Project 05 focused on a revamped digital team and a new multi-platform journalist position, who serves as a bridge between editorial, product and sales. Along with curating the content for the daily newsletter, each multi-platform journalist also writes sponsored content and stays abreast of each product’s monthly revenue goals. This focus has increased the monthly digital revenue by 65% and the number of newsletter subscribers by 150%.\nAlso, in 2023, the editorial and design teams launched CI Simple, an overhaul of CI's newspaper product. The redesign addressed the needs of modern readers with direct, concise articles, more subheads and bullet points, larger visuals, and more photography.\nThe CI Light project introduced a new market launch strategy in which a new community subscriber list is built through in-person networking and creative marketing. The list was then used to launch digital products and advertise in the new market. This built momentum and brand recognition for staff recruiting and customer print advertising to follow. CI’s first trial has been successful, with a 35% open rate for the newsletter and the newspaper launch above revenue goals.\nCI 360 is a project focused on new and innovative revenue generation opportunities by packaging CI’s best print and digital products and adding new digital offerings like sponsored content and programmatic. After a brief test, the roll-out to the entire sales force generated $4 million in revenue booked for 2024.\nThe Community Impact Information Management System (CIIMS) supports and integrates all aspects of CI’s business, including CRM, order entry, billing, pagination, ad creation, story creation, circulation management and more. An in-house development team supports the system and future development.\nThe projects and innovation will continue in 2024 and beyond. First-party data projects, more digital projects, new investments in Community Impact Printing and the roll-out of additional Texas markets will keep the CI team busy. This group is definitely one to watch.\nGeorges Media Group\nBaton Rouge, Louisiana\nAppearing for the second year in a row on the “News Media’s 10 to Watch” list, Georges Media Group is proving that its growth mindset in the face of industry headwinds has been nothing short of revolutionary in the Louisiana market it serves.\nProbably the most revolutionary for one of their markets — Shreveport-Bossier City — was the launch of a 10-person newsroom in July 2023. An area with nearly one million individuals in Northwest Louisiana and the state’s fourth largest metro area, Shreveport-Bossier City had virtually become a news desert as other news outlets pulled out of their market. The Shreveport-Bossier City Advocate (SBCA) launched with much fanfare and a full suite of digital products, including a robust news website, newsletters, social media presence and more.\nSBCA's numbers exceeded their expectations as the audience enthusiastically welcomed the quality journalism. This resulted in 27,000 weekly page views with 17,000 unique visitors, 16,000 sign-ups for their morning headlines and sports newsletters, and a digital subscription base that quickly went from zero to 1,400.\nAs third-party vendors continue to decrease their emphasis on local news, Georges Media Group has doubled its efforts to grow its “owned and operated” audience. Looking to a first-party future, they have shifted from a social and search strategy to a direct one through their URLs, email newsletters or push alerts. And it is working.\nTheir coverage of the New Orleans Saints grew their owned and operated audience by more than 10% — more than 900,000 page views. The LSU Sports coverage grew over 48% from all sources — 2.3 million page views. And their Mardi Gras coverage grew page views by 110%.\nAnother owned and operated strategy, streaming video shows with their award-winning sports reports for the Saints and LSU Sports, is a hit. The Saints videos, garnering 265,000 views and over 23,000 hours of view time, resulted in 1,100 more subscribers. LSU Sports videos, attracting 127,000 page views and over 9,000 hours of view time, grew subscribers by 16%. The full-service video division also produces Sports Betting shows, Town Halls and “Where NOLA Eats” content, along with documentaries, training videos and commercials for local customers.\nSince 2021, Georges Media Group has grown its news team by 15% — up to more than 170 across four markets. The total company has grown to 407 employees. Local ownership that invests in protecting journalism, aggressively strategic executive leadership and a team that is all-in on expanding journalism across Louisiana innovatively and sustainably all come together to make this revolutionary media company one to watch — for another year.\nMorganton Media Group (dba The Paper)\nMorganton, North Carolina\nIf we were giving an award for the number and breadth of nominations, Morganton Media Group (The Paper) would take the prize — with several nominations mainly from local residents/subscribers. First published on Feb. 4, 2023, The Paper is a local news start-up in Burke County, North Carolina, which includes Morgantown, Valdese, Rutherford College, Drexel and Lake James, located in western North Carolina.\nThe Paper was launched to fill a local news void left when the 130-year-old daily newspaper, now headquartered in Iowa, began running mainly national and regional content. After less than a year, The Paper has overtaken the other paper (now printing three times a week) in all benchmarks (subscriptions, advertising, staff size, awards and paper of record) and has become the county’s largest locally-owned, all-local newspaper.\nThe Paper operates under a hybrid for-profit and nonprofit model and is funded by paid print and digital subscriptions, print and digital advertising, single copy retail sales and purpose-specific funding from two affiliated IRS-approved 501(c)(3) entities — the Western North Carolina Journalism Foundation and the Nelle & H. Allen Smith Limited Endowment. It generates one-third of its revenue from the sale of subscriptions, one-third from advertising and the final third from philanthropic contributions.\nThe Paper publishes 32 pages of 100% local content, including local news, opinion, arts and entertainment and sports, in four sections every Saturday morning. The newspaper is home-delivered in the local area, and there are also digital subscriptions. With a small area population of 17,000, the circulation of The Paper has grown to 2,000, and residents are thrilled to have a local newspaper covering community issues. The publication is community-owned in that subscribers have a voice in the operation of The Paper through positions on a local editorial board. The doors are open at The Paper’s downtown office, and readers are invited to come in to talk to the publisher, editors and reporters — even a half day on Saturdays.\nPublisher Allen VanNoppen and Editor Bill Poteat are newspaper veterans who returned from non-newspaper jobs to their hometown in their 60s to launch The Paper. They head up a full-time staff (a total of 31 with freelancers and home delivery personnel) that covers local sports, businesses, healthcare, individual accomplishments, governments, churches, recreation, entertainment, community leadership, courts and education — all 100% local. They have deeply reported on serious local issues like homelessness and the opioid crisis.\nThe quality local journalism at The Paper has not only attracted readers, but it has also garnered awards for the start-up. The Paper won eight awards at the North Carolina Press Association’s 2023 competition after only publishing five issues. With this auspicious beginning, The Paper is most definitely one to watch.\nRaw Story\nWashington, D.C.\nA small, independent, national digital-only news organization headquartered in Washington, D.C., Raw Story spent 2023 investing heavily in investigative and enterprise journalism, and it isn’t stopping. These investments aim to dramatically expand its original journalism, increase its subscriber base and enhance its overall leadership in national media.\nThe first investments were in people. CEO John Byrne and Publisher Roxanne Cooper hired a new editor-in-chief, Dave Levinthal, and an executive editor, Adam Nichols, to lead Raw Story to new heights. Levinthal and Nichols, in turn, have made several hires, including an assistant managing editor, senior night editor, and two more investigative reporters. At this writing, a second assistant managing editor position was posted. The operation currently has 23 employees, along with a contract congressional correspondent and other freelancers and columnists.\nRaw Story reporting focuses on three main areas — political malfeasance, government corruption and the intersection of politics and extremism, with the latter being where they place most of their time and resources. They have recently brought in contributors with professional expertise and insight into subjects like constitutional law, criminology, neuroscience and race — “subjects we consider essential to understanding politics and governance in a present context,” Dave Levinthal told E&P.\nThe Raw Story staff usually publishes 40-60 staff-bylined stories each weekday and 15-30 on weekend days. Their investigative reporting has led to Raw Story news breaks involving national security breakdowns, violent extremism, political malfeasance, government corruption and media industry ethics. One of the most significant investigative stories to date, published in early 2024 by investigative Reporter Jordan Green. Green did a three-part exposé about a neo-Nazi gang behind a series of racist and anti-Semitic attacks from Florida to New Hampshire — in preparation for a race war. Raw Story has also prioritized stories about using the Freedom of Information Act and the state open records laws. In fact, Raw Story sued the Department of Defence in August 2023 over withholding public records, which they believed the public had the right to see.\nThis deep reporting has been fruitful, with over 100 million page views a month across various platforms — RawStory.com, the Raw Story app, and several news platforms like Smart News and MSN.com, where their news appears. It has also helped them expand their subscriber base to over 16,500 — a year-over-year increase of 38%, up from 12,000 only a year ago.\nA remote newsroom, Raw Story has reporters and editors working throughout the country, both inside and outside of Washington, D.C. Their focus will still be on extremism in politics. Some recent examples include:\n- A deep dive into the words and actions of Iowa-based religious extremists that have cultivated close ties to Donald Trump\n- An exclusive interview with an “honorary” KKK member who’s running as a Republican for governor of Missouri\n- Revelations that the federal government mistakenly gave classified information to a former Marine who’s currently in jail awaiting trial on charges related to him allegedly plotting an attack on the U.S. power grid.\n- An explanatory piece about unresolved questions related to the January 6 attacks.\nWith investigations like these, Raw Story will continue to be one to watch.\nStar Tribune\nMinneapolis\nThe Midwest’s largest news and media organization is undergoing one of the biggest transformations in its history. Star Tribune Media Group, also spotlighted in a company profile in this issue, is making significant investments to ensure the long-term viability of Minnesota’s most credible and trustworthy news source.\nStar Tribune Media Group is rethinking news to be relevant to younger, more diverse audiences while still providing top-quality coverage for their loyal subscriber base. They are also expanding into Greater Minnesota and investing in breaking news resources. In an email to E&P, Chris Iles, vice president of communication and brand marketing, said: “We’ve shifted our mindset to operate with the hearts of journalists but with the heads of technologists …. Moving from a paper of record to a modern media outlet of relevance.”\nThey are operating more like a product company, leveraging data and technology to meet their audience where they are. They are incorporating more formats like social media, vertical video and podcasts and evaluating partnerships with universities, influencers and content creators.\nWith an organization of 700 employees, Star Tribune’s new CEO and publisher, Steve Grove, recently announced a reorganization aimed at a digital future. They are organizing around five content verticals — news and politics, business, sports, food and culture and outdoors. Star Tribune also added new strategic leadership roles, including a chief product officer, a chief financial officer, a senior vice president of consumer growth and a vice president of communications and brand marketing.\nThe transformation continues beyond the organization. Star Tribune has also dramatically enhanced its digital presence and products, including its website and mobile app, in partnership with tech powerhouse Code and Theory. They have also announced a commercial content partnership with XLMedia to provide sports betting content on startribune.com. And, they are diversifying their revenue streams through sports betting content and other news initiatives, including sponsored content, affiliate marketing and philanthropy.\nNo transformation would be complete without a new brand. Star Tribune recently announced its rebranding efforts by hiring AdWeek’s 2023 Midsized Agency of the Year, Colle McVoy. They expect to complete a brand relaunch later in 2024.\nWith all these changes, Star Tribune Media Group is still keeping its eye on creating the leading model for local news in America and driving innovation in media to improve every Minnesotan’s life. We can’t wait to see the transformation, which gives us a big reason to name Star Tribune Media Group one to watch.\nWord in Black\nAfter the murder of George Floyd, Elinor Tatum, publisher and editor-in-chief of New York’s Amsterdam News, had an inspiration and made a phone call that led to Word In Black’s creation in late 2022. Word In Black (WIB) is now the only digital news start-up backed by legacy publishers, and in its short time, WIB has made huge strides.\nThe Word In Black 2023 Impact Report said, “Word In Black is focused on solutions to racial inequalities in America.” The hybrid publication includes 10 of the leading Black publishers in the U.S.:\n- Amsterdam News\n- The Dallas Weekly\n- The Atlanta Voice\n- Houston Defender Network\n- The Washington Informer\n- Michigan Chronicle\n- The Seattle Medium\n- The AFRO-American\n- The Observer\n- Louis American\nDr. Toni Draper, CEO and publisher of The AFRO American Newspaper, is the board chair, and Elinor Tatum is the first vice chair. WIB started with less than $500,000 in seed money and was incubated inside the Local Media Foundation.\nWord In Black has grown to a newsroom of 10, and its content is focused on education, health, climate justice and more. To date, WIB staff have published over 3,000 stories on wordinblack.com and the 10 publishers’ sites — for a reach of over 1 million. In 2023, WIB reached 1.5 million monthly social media visits. The six weekly newsletters have a subscriber base of 50,000, and it’s growing. Partnerships and collaborations have increased the available content.\n- 55 articles on financial health were published in partnership with Wells Fargo.\n- Two series of articles focused on happy aging and caregivers were published in conjunction with AARP.\n- A series of 15 reports on the racial wealth gap were produced via The Exchange in partnership with Deloitte.\nJanuary 1, 2024 brought the spin-off of Word In Black to a public benefit corporation, which had always been the plan. The Word In Black Racial Equity Fund, managed by the Local Media Foundation, will continue to fund Word In Black. With this innovative approach and rapid success, we at E&P think Word In Black is one to watch.\nE&P thanks everyone who submitted for this year’s News Media’s 10 to Watch. Although the following news organizations didn't make the final cut, we wanted to recognize and applaud their accomplishments. Congratulations to all of the well-deserving honorees.\nIn alphabetical order, by company name:\n6 AM City\nGreenville, South Carolina\n“6 AM City will be the most relevant local media brand in the cities it serves” is the mission listed on its website. A hyper-local media company currently serving 27 markets, with three more to come this year, 6 AM City is digital-only, sending out daily email newsletters with local news and events for each market.\nAccording to Ryan Heafy, 6 AM City’s COO and co-founder, the media company is on target to reach 30 markets and 2.5 email subscribers after a significant funding round with their strategic Partner, TEGNA. In addition, they plan to “push forward with innovations in AI video and mapping technology.” Probably the best news of all — they’re on pace to be profitable in Q3 of this year!\nThe Anchor Newspaper\nProvidence, Rhode Island\nThe independent student newspaper of Rhode Island College since 1928, The Anchor Newspaper is an essential news source and calendar of events for the college and the surrounding community. Along with the important local coverage, the publication also serves as an educational experience of newspaper operation. Although primarily a digital news source that publishes news every Monday afternoon, The Anchor also prints a monthly issue of best and favorite stories for rack distribution. In addition, a robust events calendar and a weekly Anchor TV Newscast round out their offerings.\nThe Center Square Newswire\nChicago\nA flagship property of the nonprofit Franklin News Foundation, The Center Square Newswire was launched in May 2019 to provide “original, fair and facts-forward straight-news reporting on local, state and national news for the benefit of news publications and broadcasters nationwide” — at no cost. Their focus is state- and local-level government and economic reporting, including the program cost to citizens in tax dollars. The newswire is one of three distribution channels, which include TheCenterSquare.com and social media.\nDeseret Digital Media,\nSalt Lake City, Utah\nDeseret Digital Media was formed in 2009, launching KSL.com, which has grown to 3.5 million monthly unique visitors with 4.6 page views per visit (totaling 19.93 million monthly page views). Along with KSL.com, which includes Classifieds, Cars, Homes, Jobs and Local, Deseret Digital Media also has Pinpoint (a programmatic buying service), Utah.com (the state’s most popular tourism site) and theMemories (an online obituary site). The all-digital company’s newsroom has regional news partnerships that extend its “local” footprint well beyond its home base in Salt Lake City.\nEl Classificado\nNorwalk, California\nEl Classificado was founded in 1988 and has become the marketplace of choice for Spanish-speaking communities. It started with a free print publication that delivered content, classifieds and lifestyle information exclusively in Spanish and has grown to include a magazine distribution of 265,000 copies, a weekly readership of 900,000, 7.4 million monthly page views to its website and a total of 141 employees.\nIn response to the growing need for accessible legal services within the Spanish-speaking community, El Classificado launched www.abogadomall.com in 2023. It has quickly become an essential centralized hub where individuals who need legal assistance can connect with trusted lawyers who offer free legal services. This solves a vital need in their community, along with providing lawyers a new avenue to market their services and attract new clients.\nGlobal Investigative Journalism Network\nWashington, D.C.\nFounded in 2003, the Global Investigative Journalism Network has grown to include 250 member groups in 91 countries. This small nonprofit, with a staff of less than 40, hosted the largest-ever global gathering of investigative journalists (GIJC23) last year in Sweden, with over 2,100 attendees from more than 130 countries, 200+ panels, workshops and networking sessions.\nThis prolific group has also published over 200 articles about investigative journalism, with 2.2 million page views. Its Resource Center, a free online source used by journalists in 100 countries every day (in 14 languages), includes reporting guidelines on disabilities, digital threats and online search techniques, along with a 16-chapter e-book on war crimes investigations.\nThe Greater Olney News\nOlney, Maryland\nIn the shadow of the nation’s capital, The Greater Olney News delivers local news to the citizens of Montgomery County, Maryland. In their 10th year, they are doing the local news with only two paid employees, along with volunteers who want to keep local news alive. The Greater Olney News is a free weekly printed newspaper, mailed to 20,000 homes and businesses and delivered to libraries and businesses by request. If you live outside Montgomery County, you can purchase a subscription to receive The Greater Olney News.\nThey have a website and digital presence, but they focus on the printed paper. Judy Hruz, the co-founder and executive editor, said, “We are print first, and our community loves it that way. Again, we are bucking all trends!\nLINK nyk\nCovington, Kentucky\nFor the citizens of Covington, Kentucky, local news wasn’t local because the four TV stations and one daily newspaper serving Northern Kentucky were all across the river in Cincinnati. So, LINK nky launched in 2021 with a $450,000 investment, six employees and a handful of contributors. They started with a daily newsletter. Since then, the news media company, which serves Boone, Kenton and Campbell counties in Northern Kentucky, has grown to also include a weekly mailed printed paper and a website staffed by 12 full-time employees and 25 contributors who cover the 36 cities and municipalities in Northern Kentucky. Along with the weekly paper, LINK nky mails a quarterly “super edition” of the paper to all 170,000 households in their service area. This has helped them grow subscriptions and website monthly page views to 450,000.\nMaine Trust for Local News\nMaine\nThe largest network of independent news and media outlets in the state of Maine was unveiled on August 1, 2023, as the Maine Trust for Local News. A subsidiary of the National Trust for Local News, a nonprofit committed to “conserving and operating vibrant, sustainable local news enterprises” across the country, Maine Trust for Local News has continued to thrive. The network includes 158 journalists, five daily newspapers and 17 hyper-local weekly newspapers both in print and online across the state.\nThe Mountain Echo\nYellville, Arkansas\nWhen the current owner of The Mountain Echo took over on April 1, 2023, the publication, which includes print, digital, and mobile products, had very few subscribers and advertisers. The response to their focus on local news, veterans, children and schools has been positive for the company, which operates with two full-time employees and two stringers.\nProbably the most exciting product that has resulted in increased visibility and revenue for The Mountain Echo is their livestreaming of the football, volleyball, basketball, baseball and softball games for seven area high schools. They concentrate on away games, which are more difficult for families to travel to, including varsity, junior varsity, and juniors. They will add pee-wee league games soon. The livestreams, which started with four ads per game, have increased to 15 ads per game. The Mountain Echo is also in the process of livestreaming government meetings.\nPacific Coast Business Times\nSanta Barbara, California\nPacific Coast Business Times, a weekly business journal serving Santa Barbara, Ventura and San Luis Obispo counties in California, has survived and thrived for 25 years as the region’s leading business publication. Several innovations have spurred the success — the region’s only State of Black Leadership publication, the first Emergency Preparedness Guide for small businesses and nonprofits and a Legacy Publication division that produces custom special reports for area businesses.\nAlong with their special publications, their weekly business journal also promotes their many events. There are too many to list, but their award events include the “Spirit of Small Business” award, the “Top 50 Women in Business” award, the “Central Coast Innovation Awards,” and the “Latino Business Awards.”\nThe Philadelphia Citizen\nPhiladelphia\nThe Philadelphia Citizen is a member-supported, nonprofit, non-partisan media organization serving Greater Philadelphia. Their website says, “What happened, what it means, and what you can do about it.” Everything in their news, events, guides and podcasts feature information for Philadelphians and ways to become involved.\nTheir events range from the “Ideas We Should Steal Festival” to the “Integrity Icon Awards” to conversations with newsmakers and policy experts. They educate further with their “Do Something Guides” about Voting and Strengthening Democracy, Standing Up for Marginalized Communities, Making a Cleaner, Greener Philadelphia, Helping Our Local Youth Succeed and Supporting Local Arts, Businesses and more. Finally, their Citizen Cast is a podcast that “dives deep into the political, social and cultural working of Philadelphia” with daily episodes, including “Reinventing Philly arts and culture” and “A wake-up call on illegal gun possession.”\nSouthern Jewelry News and Mid-America Jewelry News\nGreensboro, North Carolina\n“The Longest Running Monthly News Publication in the Jewelry Business” is displayed loudly and proudly across Southern Jewelry News and Mid-America Jewelry News website. The monthly print publication has been serving independent jewelers since 1988. The current owners, Chris Smith and Bill Newman, were employees and co-workers who purchased The Southern Jewelry News in 2001 and launched the Mid-America Jewelry News in 2002. With a combined readership of over 20,000, this monthly printed publication also has a robust website and e-newsletters. Knowing their target helps them reach their goal “to inform, educate and entertain with information to assist in the success of the independent jeweler” and continue to grow.\nTracy Area Headlight Herald\nTracy, Minnesota\nThe 145-year-old Tracy Area Headlight Herald is still going strong, even after a change in ownership in 2019 took the newsroom from seven to two-and-a-half. Along the way, they’ve continued serving three counties and seven area towns and garnering multiple state awards. They’ve even picked up the slack when a neighboring paper closed in 2022. Their subscriptions have increased, and they serve their community with a solid commercial print business. Keeping “local” in local news, their small but mighty team is visible in their community. So much so that the Chamber of Commerce chose Editor Per Peterson as Tracy’s 2023 Citizen of the Year.\nRobin Blinder is E&P's editor-in-chief. She has been with E&P for four years. She can be reached at robin@editorandpublisher.com.\nNo comments on this item Please log in to comment by clicking here",
  "word_count": 6524,
  "scraped_at": "2026-02-14T12:42:02.113788"
}