{
  "article_id": "fec14e171d50",
  "url": "https://www.irishtimes.com/life-style/people/2023/05/06/coronation-nation-royal-mood-in-britain-is-as-diverse-as-its-people/",
  "title": "Coronation nation : Royal mood in Britain is as diverse as its people",
  "date": "20230506T050000Z",
  "domain": "irishtimes.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "On Tuesday, four days before his big day, King Charles with Queen Camilla swept into the Palace of Westminster for a pre-coronation reception with politicians. As they left afterwards at 2pm, edgy officials almost had them shepherded safely into the back of their mauve Bentley. Then Charles spotted a few builders in hoodies trying to catch a glimpse of him. He couldn’t help himself. Off he marched to talk to them.\n“You didn’t miss your lunch break, I hope? Are you keeping the whole show on the road? Which bits are you looking after?” he asked the workers, who wore Crown Workspace lanyards. Meanwhile, the man who wears the actual crown was reaching out to shake their hands.\n“We’re doing the set-up, all the de-rigging,” said one man, part of the army of workers crawling all over Westminster Palace, Westminster Abbey and Parliament Square, building platforms for the weekend’s ceremonies. Inside the Abbey, Handel’s Zadok the Priest, familiar to many as the air of the anthem for football’s Champions League, was due to ring out during the king’s ‘holy anointing’ on Saturday.\n“It’s all my fault, I’m sorry,” Charles joked to the workers. Meanwhile, his minders looked close to a breakdown at this bit of off-script wandering. He has always liked to do his own thing.\nREAD MORE\n[ Don’t dismiss Charles III’s coronation as a trivial spectacleOpens in new window ]\n“You’ll get me in trouble, your majesty,” mock-pleaded Sir Lindsay Hoyle, speaker of the House of Commons and his host. “He’ll get us all in trouble,” muttered another official nearby. Other engagements were waiting, such as a meeting the Australian prime minister, Tony Albanese, early among the influx of world leaders in town for the coronation.\nThe royal entourage guided the king back to his state Bentley while tourists peered through the gates into Palace Yard, unaware that the man of the moment was right there in front of them.\nIn the background, the din of a striking teachers’ rally carried down from Whitehall. Upstairs in the press gallery, most Westminster reporters had ignored the King’s arrival to await the release of a report on the controversial hiring by Labour of a former senior official, Sue Gray. Britain’s myriad social and political problems haven’t evaporated with the coronation.\nStill, anyone in this divided and fitful nation who wants one now have an excuse for a national party, a post-Brexit and post-Covid great gathering to celebrate unabashed the idea of Britishness. It’s not often that happens these days.\nMost big media outlets, and especially British newspapers, have switched into flag-waving mode and present polls as positively as possible\nHoyle had one more message for the king and queen before he saw them off. “I’ve got the bed made up if you need it, your majesties” he said. The sovereign has an ancient right to sleep in the State Bed in the speaker’s house in Westminster on the eve of a coronation. The right, although rarely exercised, has existed since the time of William the Conqueror.\nCharles thanked Hoyle for the offer, but would be all right for a place to lay his head. He was due to stay the night before the coronation at Buckingham Palace, from there he would begin the King’s Procession in the morning to Westminster Abbey. He wouldn’t be the only one sleeping nearby.\nShortly after the king’s Tuesday sojourn to Westminster, committed royal watchers were preparing their tents on the Mall in front of Buckingham Palace. Mary-Jane Willows, from Cornwall, and Donna Werner, from Connecticut in the US, were due to spend the next four nights camped out to get the best spots from which to view the procession.\nThey were agog at the smartphone video close-up of Charles’s encounter with the Westminster builders filmed barely an hour beforehand. “Oh my God, look how close you got!” said Willows, who camps on the Mall for all big royal events. She met Werner at the wedding in 2011 of Prince William and Catherine Middleton, now the Prince and Princess of Wales.\nNow they attend every big royal event together. Willows and Werner were staying on the Mall alongside their other friend, Julie, who had flown in for the event from Canada. “This is usually our patch,” said Willows, highlighting their prime position with a view unobscured by lamp-posts or trees. But don’t these women feel insecure camping at night here? “All the police and the army are around and they look out for us. This is probably the safest place in the world.”\nIf proof were once again needed that a coronation doesn’t make all ills disappear, hours later a man suspected of being in the midst of a mental health crisis lobbed shotgun cartridges over the gates of the Palace. Police destroyed them in a controlled explosion inside the grounds.\nBut it would take more strife than that to deter the most committed royal watchers. Just don’t refer to them as “fans”.\n“Please don’t call me that,” said Willows kindly but firmly. “Fans follow celebrity. I’m a monarchist. I truly believe in it as a British citizen. Charles is Defender of the Faith, a Christian and an environmentalist. All of the things that he believes in are things I believe in too.”\nMeanwhile, Werner is a citizen of one of the world’s greatest republics, 4,500 miles to the west. Her interest in Britain’s monarchy stems from its history. “There is nothing like it in the States,” she said.\nAssessing the popularity of the monarchy following the death of Queen Elizabeth has turned into a national sport in Britain in recent weeks. Most big media outlets, and especially British newspapers, have switched into flag-waving mode and present polls as positively as possible. But many surveys still appear to show a majority in support of keeping the monarchy against viable alternatives, such as an elected head of state or president.\nBritain’s new sovereign is not a mystery to most British people.\nThe BBC’s Panorama programme recently commissioned a YouGov poll that showed backing for the monarchy at 58 per cent, although it slipped to below one-third with younger people. Overall, the BBC poll suggested that barely one quarter of people in Britain want an elected head of state. Apathy, however, might be a bigger issue for the monarchy in future under Charles. About 78 per cent of the youngest age group surveyed said they are “not interested in the royal family”.\nCamilla Tominey, associate editor of the Daily Telegraph and an experienced royal reporter, believes the notion that people will be unmoved by the coronation is overblown. “This sort of talk happens at every big royal event. They say ‘nobody is interested’,” she said, with a wave of her hand. “Then lo and behold, the streets are full and people are hanging bunting.”\nLocal councils in England have approved almost 3,100 road closures this weekend to facilitate coronation street parties. Meanwhile, scores of quirky events are planned such as a procession on Saturday of hundreds of King Charles spaniels down the King’s Road in Chelsea, west London. Some Britons simply want to join in the fun.\nTominey says that no matter which opinion poll is considered, there remains a wide gap in all of them between those who want to change the monarchy and those who would keep the existing system.\n“It’s usually 65 per cent to 35 per cent. The gap isn’t marginal, is it? I also don’t think Charles takes anything for granted in terms of support. I know he was humbled when, straight after his mother’s death, people were shouting at him ‘God save the king’. He wasn’t expecting that,” she said.\n“The transition to his reign has been smoother than anticipated. This is not like being a politician. Being a royal is a marathon, not a sprint. We’re only on mile one for Charles. The crown endures.”\nThe king’s mother, the late Queen Elizabeth, famously never gave interviews and was inscrutable in her views. Charles, however, has waited 74 years for his big day. In that time he has revealed his opinions countless times. Britain’s new sovereign is not a mystery to most British people.\n“You can’t put that genie back in the bottle regarding the opinions of the longest-serving heir in history,” said Tominey. She sees the king as “thoughtful, introspective and much more emotional” than his parents.\n“It might just be that he is an example of the fact that people are not perfect. He’s a worrier, a bit Eeyorish,” she said, referring to the gloomy donkey in the Winne the Pooh books.\n“I once heard him joke years ago, when he was asked about the role of being a royal, that he made it up as he goes along”\n— Mary-Jane Willows, from Cornwall\nPerhaps worried about appearing lavish in the midst of a cost-of-living crisis, Charles has slimmed down his big parade. The procession was due to leave Buckingham Palace on a traditional route in the morning to travel 1.3 miles up the Mall, through Admiralty Arch and along Trafalgar Square, down Whitehall and around the square to the doors of the Abbey.\nWhen his mother was crowned in 1953, her return procession after the ceremony took a five-mile circuitous route back to Buckingham Palace through London’s West End. Charles, however, has decided simply to retrace his steps on the earlier, shorter route.\nTominey says she and other royal reporters were guided by palace sources that this was to reduce economic disruption for West End traders and also to ease the strain on the police and security forces – other big events were still due to take place in London, such as a 3pm kickoff in the football match between Tottenham Hotspur and Crystal Palace.\nIt would also condense the people watching into a smaller area of the city instead of stringing them out through the West End. This could have the effect of making the crowd appear thicker as people jostled for vantage points on a shorter route.\nThe Gold State Coach in which the newly anointed King Charles and Queen Camilla will return from the Abbey, is also a bit of a “bone rattler”, said Tominey. Elizabeth complained about how uncomfortable the ride was for her procession, and she was aged just 25. Charles and Camilla are 74 and 75.\n“It’s a balance. They also don’t want this to look like a coronation on a shoestring. It still has to have a celebratory feel. People don’t get to see the Gold State Coach except on this sort of occasion.”\nNot everyone waiting along the route was planning to hail the king. Graham Smith, chief executive of political campaign group, Republic, promised it would have “up to 1,000″ protesters lining the roads after the ceremony. They had little more than “booing” planned, he says, and would not seek to disrupt the procession beyond that.\n“The size of the crowd [cheering for Charles] won’t prove anything. The monarchy is in trouble. They have lost their star player, Queen Elizabeth,” said Smith.\n“The queen was the monarchy. Charles inherited the crown but he didn’t inherit the deference to her and the sycophancy. We are not a country of loyalists. We are a country that is largely indifferent.”\nHe argues that the monarchy is simply a “puppet of the government” and a misuse of public money. “Charles just looks like a bloke in a suit chancing his arm. We should just elect a head of state. If Ireland, with a population of five million, can find brilliant heads of state, as it has done for years, then we should be spoiled for choice in a country of 67 million.”\nBack on the Mall, the mood among the royal watchers and monarchists wasn’t for turning. Willows, the Cornwall woman camping on the roadside, said she admired the fact that Charles was “brought up to just get on with it”.\n“I once heard him joke years ago, when he was asked about the role of being a royal, that he made it up as he goes along. Well, he made it up very well as far as I can see. I admire him for his opinions. I think he cares about the problems of this country. He cares about the youth,” she said.\nHer friend, Anita Atkinson from Durham in northern England, arrived on the scene on the Mall. Atkinson, Willow whispered, has the largest collection in the world of British royal memorabilia.\n“It’s much larger than mine. But I’ve actually just changed my will to leave all of my royal collection to her anyway.”\nMinutes after we chatted, further up the Mall a mauve Bentley zoomed towards the Palace, accompanied by two black Range Rovers. After it passed, a young girl was talking excitedly to someone on a mobile phone: “I’ve just seen the king! I saw his face! I think Mum might be crying.” ‘Mum’ didn’t appear to be in tears, but her face was definitely flushed.\nI returned to Willows and Werner to check if they had caught a glimpse. The Englishwoman looked disappointed, and gestured to a third woman who was standing in front of her with a microphone in her hands.\n“I missed him. I was too busy talking to journalists.”",
  "word_count": 2214,
  "scraped_at": "2026-02-14T12:02:27.766180"
}