{
  "article_id": "fec145a56d07",
  "url": "https://www.burntorangenation.com/2024/3/14/24101276/longhorns-daily-news-cfp-14-teams-2026-cfp-sec-big-ten-steve-sarkisian-ncaa-tournament-big-12",
  "title": "Longhorns Daily News : CFP looks likely to increase to 14 teams beginning in 2026",
  "date": "20240315T021500Z",
  "domain": "burntorangenation.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "ESPN reported earlier today that all FBS conference managers are likely to approve a 14-team College Football Playoff beginning in 2026. The CFP will move from an expanded 12-team model that kicks off in 2024 and will run through the subsequent NCAA season.\nLonghorns Daily News: CFP looks likely to increase to 14 teams beginning in 2026\nPlus: Texas softball takes on BYU\nWHAT THEY’RE SAYING ABOUT THE LONGHORNS\nAustin American-Statesman: ESPN’s Kris Budden on Texas basketball’s NCAA hopes, spring football\nAustin American-Statesman: Golden: Jonathon Brooks could be a Cowboy (if Jerry wakes up)\nAustin American-Statesman: Where does Texas basketball’s Rodney Terry rank in coaches’ salaries?\nAustin American-Statesman: Texas standout Madison Booker has a fan in ex-Longhorn Kevin Durant\n247Sports: Texas’ pattern of defensive lapses have cost the Longhorns wins throughout the season\n247Sports: Five Days to Spring Football: Texas Position Inventory: Safeties\n247Sports: The Insider: Replacing key leadership, intriguing position battles and more\nInside Texas: What the structure of development-heavy practices look like during spring football\nInside Texas: Spring Storyline: Importance of culture in light of coaching, player departures\nICYMI IN BURNT ORANGE NATION\nRECRUITING ROUNDUP\n247Sports: Elite OT Lamont Rogers set to visit Texas later this month, likes UT culture\n247Sports: The five most intriguing recruitments in 2025\n247Sports: With Texas OV set, Top100 WR Daylan McCutcheon explains why Longhorns are in mix\nInside Texas: Texas keeping close tabs on rising 2026 EDGE Jesse Ford\nInside Texas: 2026 Texas DB taraget Isaiah Williams recaps his recruitment, potential visits\nInside Texas: Recruiting Notebook: Detailed evaluation for 2025 safety target Kade Phillips\nInside Texas: Soon to be a leading SEC program, Steve Sarkisian has different recruiting challenges\nBIG 12 BREAKDOWN\nAustin American-Statesman: The best cure for Aaliyah Moore’s illness? A Big 12 women’s title\nAustin American-Statesman: OK, Texas lost to Kansas State in the Big 12 tourney. Now what?\nDallas Morning News: Grant McCasland’s reinvention of Texas Tech is paying off. A dominant win vs. BYU is proof\nFrogs O’ War: Men’s Basketball: TCU tips off Big 12 Tournament with win over Oklahoma\nThe Smoking Musket: Wren Baker lays out his vision, another Mountaineer signs a pro contract, and the SEC and Big 10 get richer\nWide Right & Natty Lite: Men’s Basketball Preview: We’re talkin’ Kansas State: Part III\nBring On The Cats: Huge second half propels K-State past Texas 78-74 at Big 12 Tournament\nBlack & Gold Banneret: BYU’s three-point barrage ends UCF’s Big 12 run, 87-73\nBlack & Gold Banneret: Baseball bounces back with a win over Stetson\nVanquish The Foe: BYU beats UCF, advances to play Texas Tech in Big 12 quarterfinals\nWHAT WE’RE READING\nSB Nation: Inside Coby White’s grueling summer to become NBA’s most improved player for Bulls\nSB Nation: NFL free agency’s 9 best remaining players still on the market, ranked\nSB Nation: 5 NFL teams who improved in free agency the most, and 2 teams who did not\nNEWS ACROSS LONGHORN NATION AND BEYOND\n- Texas softball gets its Big 12 series versus BYU underway tonight at 6pm Central.",
  "word_count": 507,
  "scraped_at": "2026-02-14T13:39:01.286644"
}