{
  "article_id": "fee6be62aa65",
  "url": "https://www.asiasentinel.com/p/indonesia-listyo-sigit-prabowo-gargantuan-job",
  "title": "Indonesian Top Cop Gargantuan Job - by Our Correspondent",
  "date": "20230222T063000Z",
  "domain": "asiasentinel.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Indonesian Top Cop’s Gargantuan Job\nNational Police force may be too corrupt to clean up\nDriven by one of the most spectacular scandals in Indonesian National Police history, Police Chief Gen. Listyo Sigit Prabowo, an ally of President Joko Widodo, has used the affair to attempt to clean up one of Asia’s most corrupt law enforcement agencies, transferring hundreds of officials to new jobs and making other reforms as an entry point for significant change.\nThe question is whether corruption is so endemic that it can’t be stopped without wiping out the entire force, although the business community, both domestic and international, say that police corruption is a hindrance to doing business. It remains to be seen if Listyo’s efforts will have an impact on a force that has been characterized by Risk & Compliance Portal, a production of GAN Integrity, as “plagued by corruption, widespread bribery, presenting companies with high risks. Police officers solicit bribes on every level, ranging from traffic violations to criminal investigations. Two out of five people perceive most or all of the police to be corrupt and one in four Indonesians report having paid a bribe to the police services in the past 12 months.”\nEstablished on July 1, 1946, the institution is one of the country's oldest. Despite its undeniable although brutal success in fighting terrorism, it is regarded universally as corrupt, incompetent and often using violence against its citizens. The National Human Rights Commission recorded that of 2,841 public complaints related to the performance of government agencies during 2020, 758 were against the police, the most of any government institutions and probably a fraction of the real number, given police intimidation.\nThe mess within the force came to the surface last July with the revenge murder of a junior officer, Brigadier Yosua Hutabarat, which was masterminded by his powerful superior, former head of the internal police division, Ferdy Sambo, for having an affair with Sambo’s wife. Sambo tried to avoid punishment by manipulating cases and destroying evidence, aided by many of his police colleagues. After the affair was no longer containable within the force and leaked into public view, many officials were investigated for allegations of various violations including obstruction of justice, links with the online gambling mafia, drug trafficking, and most recently aiding in illegal mining. According to the results of a survey by the Indonesian Survey Circle (LSI), the level of public trust in Indonesian Police fell from 70 percent in August to 53 percent in October 2022.\nAmid public pressure, the agency named Sambo as a suspect in premeditated murder and fired several members who had conspired with him. A panel of judges recently sentenced Sambo to death. Some of the people who helped him, including his wife, Putri Candrawathi, were sentenced to 20 years in prison, his driver Kuat Ma'ruf 15 years, and bodyguard Ricky Rizal 13 years. A low-ranking police officer who was ordered by Sambo to execute Yosua, Richard Eliezer, was only sentenced to a year and a half, a light sentence for his role as justice collaborator.\nAmong Listyo’s steps to improve the image of the institution, the police removed manual ticket enforcement for traffic violators, and only implemented electronic ticketing to reduce extortion practices in the field. Listyo also issued regulations for officers to live simply and avoid showing off their wealth in public. This was in response to much public criticism, especially on social media, about the luxurious lifestyle of some officials, which provoked suspicion that they had accepted bribes and were involved in illicit business. Although the regulations are criticized for not touching on the substance of the problem, the National Police said they would impose sanctions on those who break the rules.\nThe institution has implemented \"Hoegeng Awards,\" a contest suggested by the community looking for exemplary police figures. Proposals are open until July 2023 to look for police figures who are innovative, dedicated, with integrity, protectors of women and children, as well as police who serve borders and interior areas.\nListyo has also dramatically shuffled the force, both in relation to the Sambo case and as an effort to improve institutional performance. At least 704 high and mid-level officers were transferred as of December 2022, a major restructuring that has rarely happened before and was carried out in a short time. In his previous position as Head of the National Police's Criminal Investigation Agency, Listyo was considered successful in making the agency to become more professional.\nA significant improvement in police services is showing in their quick response to citizen reports on cases that have gone viral on social media, such as cases of rape, assault and abuse of police officers' authority. It is also reported that the National Police are currently drafting regulations related to securing football matches, which will later be used as a basis for them in their duties. This step was taken after the tragic death of hundreds of football fans in Kanjuruhan, East Java, which was allegedly caused by the excessive action of the police in securing the match.\nThe Commission for Missing Persons and Victims of Violence (KontraS) is skeptical, criticizing the police for being busy polishing their image by handling cases that go viral on social media. This, they said, would only be a \"false fix\" for people to be more likely to report their cases to social media than to the police. Indeed, criminal case reports are uploaded almost every day via social media, especially Twitter, increasing public distrust. Hashtags that corner the police, such as #PercumaLaporPolisi (it's useless to report to the police) and #NoViralNoJustice have been used since last year.\nRay Rangkuti, an activist with the reform NGO The Indonesian Civil Society Circle, however, argues that Listyo has actually made improvements, including making the police more transparent and firmly taking action against members who commit violations. However, these improvements must be carried out systematically and not case by case, including through the revision of the Police Law. \"In general, we have never made laws related to police institutions that are adapted to the times,” Rangkuti said. “The biggest revision to the Police Law has only changed from military to civilian institutions, there is no question of how to design police institutions.\"\nAnother Big Challenge\nEven though police are more responsive to public reports, especially in the digital realm, many hope that the chief will pay great attention to many testimonies and reports that police are involved in providing security services for illegal businesses. A recent viral video shows a cannabis courier in Tana Toraja who, on the sidelines of a press conference, claims to have protection from the local police station to run his business. Previous confessions came from former police officer Ismail Bodong who said the police were protecting his illegal business in the field of coal mining in East Kalimantan.\nThese are just a few of the many reports that have come to light in the media regarding involvement in illegal business. Along with skyrocketing prices of ores such as nickel and bauxite, police are reportedly backing businessmen and companies who want to exploit these resources. Tempo Magazine in its, January 23-29 edition, stated that the police protected the operation of an illegal nickel mine in North Konawe with a \"coordination fee\" of US$16 per metric ton.\nIn a meeting before army and police leaders in early February, President Jokowi reminded them that many companies operate illegally to extract mining products including tin, bauxite, and coal. \"This has resulted in greatly reduced state revenues,\" Jokowi said. If illegal exports and illegal mining continue, said Jokowi, the downstream and industrialization processes that are being intensified by the government will be disrupted. He ordered law enforcement to take action against the violators. \"I think you already understand what (you) have to do, so I don't need to explain,\" Jokowi said.",
  "word_count": 1309,
  "scraped_at": "2026-02-14T11:59:59.098467"
}