{
  "article_id": "fef5ed01d0d3",
  "url": "http://www.laosnews.net/news/278864148/india-drawn-with-japan-australia-and-lebanon-in-afc-u17-women-asian-cup-china-2026",
  "title": "India drawn with Japan , Australia and Lebanon in AFC U17 Women Asian Cup China 2026",
  "date": "20260212T143000Z",
  "domain": "laosnews.net",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "New Delhi [India], February 12 (ANI): India were drawn alongside Japan, Australia, and Lebanon in Group B of the AFC U17 Women's Asian Cup China 2026 during the Final Draw held at the AFC House in Kuala Lumpur, Malaysia, on Thursday, according to the All India Football Federation (AIFF).\nHaving qualified for the AFC U17 Women's Asian Cup for the first time in 21 years after defeating Kyrgyz Republic and Uzbekistan, the Young Tigresses will open their campaign against Australia, followed by matches against Japan and Lebanon. The tournament will take place from May 1 to 17.\nJapan were runners-up in 2024 and thus qualified automatically for the tournament. They are four-time champions of the AFC U17 Women's Asian Cup and also FIFA U17 Women's World Cup champions in 2014 and runners-up in 2010 and 2016.\nAustralia were eliminated in the group stage of the 2024 edition and qualified for the 2026 tournament after victories over Singapore and the Northern Mariana Islands. On the other hand, Lebanon will make its debut, having qualified for its first tournament with wins over Kuwait and Iran.\nIn Group A, hosts China were drawn alongside Thailand, Vietnam and Myanmar. Group C contains DPR Korea, the Republic of Korea, the Philippines and Chinese Taipei.\nThe AFC U17 Women's Asian Cup China 2026 will be held in Suzhou, at the Suzhou Sports Centre Stadium and the Suzhou Taihu Football Sports Centre.\nThe top two sides from each group, along with the two best third-placed teams, will progress to the quarter-finals. The four semi-finalists will qualify for the FIFA U17 Women's World Cup Morocco 2026, where DPR Korea are the current holder.\nAFC U17 Women's Asian Cup China 2026 Draw Lists:\nGroup A: China, Thailand, Vietnam, and MyanmarGroup B: Japan, Australia, India, and LebanonGroup C: DPR Korea, the Republic of Korea, the Philippines, and Chinese Taipei. (ANI)",
  "word_count": 310,
  "scraped_at": "2026-02-14T12:37:57.738502"
}