{
  "article_id": "ff038f7052f9",
  "url": "https://www.irishcentral.com/culture/ireland-world-cup-sydney",
  "title": "Ireland World Cup team gets céad míle fáilte in Sydney",
  "date": "20230719T164500Z",
  "domain": "irishcentral.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Ireland Women’s National Team felt the love as they arrived in Sydney, Australia on Wednesday, July 19, the day before their historic FIFA Women's World Cup debut.\nIreland fans brought the craic at Sydney Airport on Wednesday while welcoming the Girls in Green as they arrived from Brisbane where they've been based since July 8.\nThat Irish love ?\nWe feel it, Sydney ?#COYGIG | #OUTBELIEVE pic.twitter.com/Ov4o5xLrfC\n— Ireland Football ⚽️?? (@IrelandFootball) July 19, 2023\nThe Consulate General of Ireland in Sydney was on hand for the big welcome on Wednesday that featured fans donning lots of green while waving posters and Irish flags:\n— Consulate General of Ireland, Sydney (@IrelandSydney) July 19, 2023\nWelcome to Sydney @FAIWomen!!! #COYGIG #fifa #fifawwc ☘️⚽️ pic.twitter.com/19Wc3I0cG0\n— Consulate General of Ireland, Sydney (@IrelandSydney) July 19, 2023\nBack home in Ireland, President Michael D. Higgins is among the scores of fans cheering on the squad - he penned a heartfelt letter on Wednesday wishing the team good luck.\nPresident Michael D. Higgins has written to the @IrelandFootball Republic of Ireland women's national team to wish them the very best of luck at @FIFAWWC #COYGIG pic.twitter.com/w1Gua95jWv\n— President of Ireland (@PresidentIRL) July 19, 2023\nRingsend in Dublin is also in high spirits, cheering on local player Abbie Larkin ahead of the kick-off:\n? Ringsend, Dublin\nIncredible support for their own Abbie Larkin and the WNT in Dublin ?\nPost your photos from across the country showing your support for the girls in green ?? pic.twitter.com/xglXwM0BMf\n— Ireland Football ⚽️?? (@IrelandFootball) July 18, 2023\nIreland will take on Australia at Stadium Australia in Sydney on Thursday, July 20 in the co-opener for the 2023 FIFA Women’s World Cup. Kick-off is at 8 pm local time. The match will be shown live on RTÉ2 in Ireland and on Telemundo, Fox Sports, and Peacock in the US.\nWhile it's Australia's eighth time appearing in a FIFA Women's World Cup, it will be Ireland Women’s National Team's major tournament debut. The Irish team earned their place in the tournament after beating Scotland 1-0 in a UEFA qualification play-off.\nIreland, who is in Group B along with Australia, Canada, and Nigeria, joins Haiti, Morocco, Panama, the Philippines, Portugal, Vietnam, and Zambia in making their FIFA Women's World Cup debut this year.\nHeading into their debut, Ireland has a fully fit squad to select from, with midfielder Denise O’Sullivan having come through training sessions in recent days following an injury scare.\nAhead of Thursday's match, manager Vera Pauw said: “As a team, we have always held the belief that something only appears to be impossible the moment it proves to be impossible.\n\"What that means is that you must believe in yourself, embrace tougher challenges and step forward to trust that you are ready to fulfil your dreams.\n\"We did just that to qualify for FIFA Women’s World Cup 2023; now we must be brave once again to make the most of this fantastic opportunity of competing in the world’s best competition.\n“We might be on the other side of the world, but we feel the support of everyone in Ireland. We stand on the shoulders of the players, coaches, staff members, and officials who drove women and girls’ football forward over the last 50 years. We carry the hopes of girls and boys wanting their heroes to perform well.\n\"We get to show that the endless hours of coaching and encouragement from Grassroots volunteers that helped to shape our players was worth it. And we are able to give back to those in Irish football who have helped shape this incredible journey.\n“Our preparation is complete. Our motivation is intact. And our game plan is set. We are ready. We just hope that we can do the people of Ireland proud. This is our time.”",
  "word_count": 635,
  "scraped_at": "2026-02-14T13:27:05.004331"
}