{
  "article_id": "ff08361b81bd",
  "url": "https://www.newcastleherald.com.au/story/8563188/matildas-face-tough-olympic-challenge-against-us-and-germany/?cs=305",
  "title": "Matildas face tough Olympic challenge against US and Germany | Newcastle Herald",
  "date": "20240321T020000Z",
  "domain": "newcastleherald.com.au",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Emily van Egmond expects the Paris Olympics to prove \"a great challenge\" after the Matildas learned their group included world No.4 United States and world No.5 Germany.\nSubscribe now for unlimited access.\nor signup to continue reading\nAustralia, who are targeting their first Olympic medal, were drawn on Thursday into group B with Germany, US and the winner of the Confederation of African Football play-off between Zambia and Morocco.\nThe Matildas, who finished fourth at the Toyko Olympics and fourth at last year's World Cup in their best efforts at both tournaments, open their Paris campaign against Germany on July 25.\n\"They're familiar opponents, the US in particular,\" van Egmond said.\n\"They're obviously coming into a new phase now with a new head coach as well, so it'll be a new challenge for us but one that we'll look to just focus on ourselves first and foremost.\n\"Germany, for them, not being in Tokyo meant they had a real point to prove, and given how hard it was for people to qualify within Europe just shows where women's football is going and I'm expecting a pretty tough opponent in Germany.\n\"They obviously had to qualify through Europe and you look at the likes of Sweden and England, who missed out. That right there tells you it's becoming increasingly more difficult and that's exciting to see everyone invested in the women's game and how fast it's growing.\"\nThe 30-year-old San Diego midfielder and Dudley Redhead United Football Club junior is one of two Newcastle players in the Matildas 23-player squad named on Wednesday to play an international against Mexico in San Antonio on April 9.\nAdamstown Rosebud junior Clare Wheeler, who plays for Everton in Women's Super League, is also part of the squad, which will be cut to 18 for the Olympics.\n\"It's just utilising all of the time we have left,\" van Egmond said.\n\"We only get 10 to 12 days a month to prepare and get together as a team and build towards the Olympics.\n\"So, for us to play against Mexico is going to be a great challenge and a game that we'll look to capitalise on, and just making the most of the small amount of time that we have left before we head to Paris.\"\nThe Matildas play either Zambia or Morocco on July 28 then the US, who will be coached by Chelsea women's manager Emma Hayes, on July 31.\nAustralia has met the United States on 33 occasions for just one win. They drew five times and their last fixture ended in a 4-3 loss in the Tokyo Olympics bronze medal match.\nThe Matildas have also only ever beaten Germany once in five previous fixtures while July's tournament would mark the first meeting between Australia and the world No.65 Zambia or world No.68 Morocco.\nTwelve teams across three groups have qualified for the Paris Olympics. The top two in each group will advance to the quarter-finals and will be joined by the two best third-placed teams.",
  "word_count": 503,
  "scraped_at": "2026-02-14T12:57:10.662678"
}