{
  "article_id": "ff22ea989d4f",
  "url": "https://sfist.com/2023/09/01/cal-and-stanford-officially-switch-conferences-to-the-acc-and-the-pac-12-is-probably-dead/",
  "title": "Cal and Stanford Officially Switch Conferences to the ACC ; PAC - 12 Is Probably Dead",
  "date": "20230901T220000Z",
  "domain": "sfist.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "The Cal Bears and Stanford Cardinal just Transfer Portaled themselves to the Atlantic Coast Conference, effective in 2024, which was the best outcome possible for the two schools as the PAC-12 has turned into a dying husk over the last month.\nGet ready for the geographic whuuuut? of prestigious Bay Area colleges UC Berkeley and Stanford playing their athletic program games in the Atlantic Coast Conference (ACC). But as weird as that seems, it’s frankly a huge victory that Cal and Stanford have officially been added to the ACC, in an early Friday morning vote by the schools in that conference, according to the Chronicle.\nThis is an excellent soft landing for the two Bay Area college programs, after a tumultuous, existential-crisis month when Arizona, Arizona State, Oregon, Utah, and Washington all bolted from the PAC-12 on the same day. That left the PAC-12 a complete non-entity, with only four schools remaining. And with this announcement, the two Bay Area schools are leaving for another conference, too.\nIn the same Friday morning vote, the ACC also added Southern Methodist University (SMU). The ACC will become a mega-conference consisting of 18 teams, though just 17 in football, beginning with next year’s 2024-25 athletic seasons.\nThis almost feels like a billion-dollar bailout for Stanford and Cal, as their only other options were about as appealing as a styrofoam cup of someone else’s tobacco spit. They could have joined the far lesser conferences Mountain West or American Athletic Conference (AAC), they could have tried to rebuild a new PAC-12 stocked with much lower-profile teams, or they could have gone independent, which only works for a massive powerhouse program like Notre Dame.\nStanford and Cal now thankfully remain in a Power 5 conference, the elite set of top-earning, most watched conferences that includes the Big Ten, Big 12, and Southeastern Conference (SEC). Of course, the Power 5 is now a “Power 4” with the imminent vaporizing of the PAC-12, but these numbers don’t even mean anything anymore. The Big Ten now has 14 teams, the Big 12 also has 14.\nThe move is a gigantic financial lifeline for UC Berkeley and Stanford, both of whose athletic programs were experiencing massive financial difficulties. And as ESPN’s sources report from behind the scenes, the two schools reportedly had to surrender significant percentages of TV money revenue sharing to get the deal done.\n“Cal and Stanford will each start out receiving just a 30% share of ACC payouts,” according to ESPN. “For Stanford and Cal, it will be 30% of a whole ACC share for the next seven years. That number will jump to 70% in Year 8, 75% in Year 9 and then full financial shares in the 10th year, per sources.”\nYou think that sounds like a bad deal? SMU, a small program that was desperate to get into the big leagues, will get 0% of the TV revenue for the first nine years of this deal, per ESPN.\nThis head-spinning realignment all started with USC and UCLA leaving the PAC-12 for the Big Ten (which will become 16 teams when they join next season). Welcome to a new, huge-money, legal gambling era when geography, and the numbers in the conference name, are completely meaningless.\nBoy would I love to explain how this new ACC is going to work, but I cannot, because they don’t even know yet. (At the end of this post, I will at least bullet-point all of the teams in Stanford and Cal’s new ACC conference, and it's a good bet some of those teams will also switch conferences for \"greener\" pastures.)\nIn all likelihood, the new ACC will probably be split into two sub-conferences, something along the lines of “ACC East” and “ACC West.” The ACC will become an 18-school conference, but only 17 in football, as member school Notre Dame plays independently in football. Cal and Stanford will now have the utterly despicable Duke program in their conference, so that sure becomes relevant when we get to basketball season.\nThis underlies the crucial problems here. While all the discussion of this matter is about men’s college football, no one’s talking about the implications for, say, the mighty Stanford women’s basketball and volleyball teams. You can laugh that off as a minor concern if you want, but those two women’s sports are quietly enjoying massive popular growth. Plus there are wrestlers, lacrosse players, tennis players, et cetera unwillingly being thrown into corporate America's pursuit of cash.\nThere are mind-boggling travel logistics with teams in the same conference playing regular season games at schools as much as 3,000 miles away, multiple times per season. That’s certainly going to affect performance. And it sure feels like students are getting the shit end of the stick here, because what kind of college kid is going to buy cross-country airline tickets to watch a crucial road game.\nOh, and as a complete afterthought, the college football season starts tomorrow! Stanford and Cal will still be in the traditional PAC-12 this season. But after this season, everything blows up, in an explosion of money, gambling, perhaps lawsuits, and probably some scandals that make it clear this is no longer just a game.\nThe New York Times details the college sports insanity on the horizon starting next season. First, the College Football Playoffs will expand from four teams to twelve. (That’s a great move, many of us have been clamoring for this for years.) But as the billion-dollar TV deals get more staggering, and these athletes are not paid a penny, the National Labor Relations Board is considering classifying the students as employees who deserve benefits. Add to this mix the role of the explosive growth of legal gambling, and golly, you think there are going to be any game-fixing or point-shaving scandals?\nBut at least for Stanford and Cal, the move to the ACC puts them in a far better position to prosper in this lucrative and arguably more corrupt new landscape. The new ACC they will join next season will consist of the following teams:\n- Cal (UC Berkeley)\n- Stanford\n- Boston College\n- Clemson\n- Duke\n- Florida State\n- Georgia Tech\n- Louisville\n- Miami\n- North Carolina State\n- Notre Dame (But not in football)\n- Pittsburgh\n- Syracuse\n- University of North Carolina\n- Virginia\n- Virginia Tech\n- Wake Forest\nRelated: End of an Era? Pac-12 Faces An Unprecedented Exodus As 5 Schools Leave in One Day [SFist]\nImage: PALO ALTO, CA - NOVEMBER 23: Members of the University of California Rally Committee carry the Stanford Axe at the end of the 122nd Big Game between the Stanford Cardinal and the California Golden Bears played on November 23, 2019 at Stanford Stadium in Palo Alto, California. The Stanford Axe is awarded annually to the winning school. (Photo by David Madison/Getty Images)",
  "word_count": 1143,
  "scraped_at": "2026-02-14T13:09:56.706523"
}