{
  "article_id": "ff3903f9543d",
  "url": "https://www.fourfourtwo.com/features/adidas-newcastle-united-2024-25-home-kit",
  "title": "Take our money ! The Newcastle United 2024 / 25 home kit has dropped",
  "date": "20240607T161500Z",
  "domain": "fourfourtwo.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Take our money! The Adidas Newcastle United 2024/25 home kit has dropped - and it's the shirt of the summer\nThe Adidas Newcastle United 2024/25 home kit is out - and the whole collection is absolutely stunning\nThe best features, fun and footballing quizzes, straight to your inbox every week.\nYou are now subscribed\nYour newsletter sign-up was successful\nWant to add more newsletters?\nFive times a week\nFourFourTwo Daily\nFantastic football content straight to your inbox! From the latest transfer news, quizzes, videos, features and interviews with the biggest names in the game, plus lots more.\nOnce a week\n...And it’s LIVE!\nSign up to our FREE live football newsletter, tracking all of the biggest games available to watch on the device of your choice. Never miss a kick-off!\nJoin the club\nGet full access to premium articles, exclusive features and a growing list of member rewards.\nThe Adidas Newcastle United 2024/25 home kit is out – and this one is a shirt for the ages.\nWe first heard of the Three Stripes getting back with the Magpies last summer, and ever since, the Toon have been on tenterhooks. Newcastle's relationship with Adidas goes way back, with the German manufacturer producing some of the best football kits of all time during their partnership in the 90s and creating football fashion that's lasted through the ages.\nWell, as next season's Premier League kits begin to drop, this was one that we always had an eye on – and it might well be the shirt of the summer…\nThe Adidas Newcastle United 2024/25 home kit is long-awaited – and does not disappoint\nAdidas have released an incredible video to celebrate the return of their partnership with Newcastle United. The short film is shot at various locations across North Tyneside, and loaded with Easter eggs that have wowed Toon fans.\nShola Ameobi eating an apple while riding a bike, a homage to a famous pre-season image of him from his playing days. Alexander Isak walking his dog in the street.\nJoelinton and Bruno Guimaraes watching old highlights of famous Newcastle United moments during their last Adidas era in the 90s and 2000s. With members of the current mens' and womens' squad filmed playing pool at King Street Social club in North Shields, while wearing an Adidas Originals range that FourFourTwo understand will become available in September.\nA post shared by FourFourTwo (@fourfourtwouk)\nA photo posted by on\nSHOP ADIDAS KITS Buy this shirt from Adidas.co.uk\nThe new home kit draws inspiration from Newcastle's classic 2002/03 home kit, worn during the Magpies’ last appearance in the Champions League until their return in 2023.\nThe home jersey honours this iconic era with three bold black stripes and a full-colour crest, offering a modern twist on a timeless classic, complemented by the Adidas three-stripes detailing on the shoulders up to the collar. In further celebration of the club's 130-history, a classic club crest from the 1970s reappears as a backneck sign-off, reaffirming the city's enduring unity.\nThe iconic black and white hues, synonymous with Newcastle United, have been preserved and crafted to evoke both memories of the past, and excitement for its future. Binding the kit together are solid black shorts and socks with the white NUFC sign off, creating a traditional aesthetic staying anchored in the club's roots.\nThe best features, fun and footballing quizzes, straight to your inbox every week.\nAdidas are expected to release the 2nd and 3rd kits later in the summer, each with significant nods to Newcastle's Adidas kits of the past. But along with the new home kit an exclusive 'coaches range' and 'players range' of leisurewear has gone on sale.\nThe coaches' range is in white and features a 1/4 zip technical long-sleeve training top, short-sleeve shirt, all-weather jacket, polo and coaches hoodie. Available in adult and kids sizes.\nThe players' range is in the iconic maroon used for the club's training kit during the 1995/96 season. It features the same products as the coaches' range, but with a 'stadium parka'. Prices range from £40 to £170.\nWhere to buy\nAdidas Newcastle United 2024/25 home kit\nOur expert review:\nSpecifications\nReasons to buy\nReasons to avoid\nMore Premier League kit drops\nLiverpool have released their new home shirt, which takes inspiration from 1984.\nPlenty of the Euro 2024 shirts, meanwhile, have been released ahead of the tournament this summer.\nMark White is the Digital Content Editor at FourFourTwo. During his time on the brand, Mark has written three cover features on Mikel Arteta, Martin Odegaard and the Invincibles, and has written pieces on subjects ranging from Sir Bobby Robson’s time at Barcelona to the career of Robinho. An encyclopedia of football trivia and collector of shirts, he first joined the team back in 2020 as a staff writer.\n- Matthew KetchellDeputy Editor",
  "word_count": 804,
  "scraped_at": "2026-02-14T12:47:52.512543"
}