{
  "article_id": "ff777910d984",
  "url": "https://www.yahoo.com/news/liberty-university-fined-14m-over-215330589.html",
  "title": "Liberty University fined $14m over  culture of silence  around sexual assault",
  "date": "20240306T223000Z",
  "domain": "yahoo.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Liberty University fined $14m over ‘culture of silence’ around sexual assault\nLiberty University has been hit with a $14m Department of Education federal fine for creating “a culture of silence” around sexual assault, failing to support victims of violence and then failing to properly report them correctly under the law.\nAnnouncing the fine on Tuesday, the department said in a statement that the Christian evangelical institution had punished sexual assault victims “for violating the student code of conduct”, while “their assailants were left unpunished” – a violation of federal law.\nLiberty was founded in 1971 by the television preacher Jerry Falwell Sr, the Baptist minister who, eight years later, created the Moral Majority movement that mobilized the Christian right to the cause of the Republican party. The university was notified two years ago by the department that it would be conducting a review of the institution under the Clery Act, which requires the disclosure of campus security information.\nStudents of the university, which is located near Lynchburg, Virginia, are required to follow The Liberty Way, a student honor code that prohibits sexual relations outside of “a biblically-ordained marriage between a natural-born man and a natural-born woman”.\nBut signs that aspects of the code – and law – were failing came in 2021 when Liberty spokesperson Scott Lamb was fired for standing up for 22 female students represented in a lawsuit that claimed the university “enabled on-campus rapes” and suppressed complaints of sexual assault and rape, a violation of federal Title IX statutes, in what it said was “the weaponization of the ‘Liberty Way’”.\nA 20-year-old student, identified as “Jane 16” in court papers, told the Guardian at that time that she was raped by a member of the college football team. The woman, who later left the university as a result of her experience, said her assailant had remained on the team.\nRelated: Liberty University faces new scrutiny over handling of sexual assault claims\nAfter the alleged assault, Jane 16 said she went for an anonymous forensic examination at a Lynchburg-area hospital and then went to the university’s Title IX office to report the incident.\nBut the university’s response to Jane 16’s claim was to find her alleged assailant not responsible. “That was just totally biased,” she says. “Because he’s on the football team, he walked away with zero punishment. The most shocking part is that I’m not the only woman who has come forward against him specifically.”\nThe victim also said she had felt the university official she reported the incident to had tried to transfer responsibility for her assault onto her with the implication of a supposed purity culture that women are responsible for, while mitigating the desires of men.\n“When they asked me if I was in a room alone with him, they asked if I knew that’s against the Liberty Way? During my hearing they asked him what I was wearing that night,” she said.\nThe Department of Education report and fine follows a ProPublica investigation in 2021 that detailed how officials had discouraged and dismissed women who tried to come forward with accounts of sexual assault.\nMore in U.S.\nThe claims of sexual assault by nearly two dozen women came a year after Jerry Falwell Jr, son of the founder, was forced to step down as president of the university after he posted an Instagram photo of himself standing with his trousers unzipped and an arm around a young woman.\nThat came after Giancarlo Granda, a Florida pool attendant, claimed that he had a six-year relationship with Falwell’s wife, Becki, that involved having sex while Falwell watched. Liberty will also be required to face two years of federal oversight.\nElizabeth Axley, a former Liberty student who had been assaulted on campus and then, she said, was advised to pray instead of reporting the incident, told ProPublica that the report was “validating and sort of surreal”.\nLiberty University said in a statement that it had made mistakes and committed $2m to improve campus security, but had faced “unfair treatment”.",
  "word_count": 673,
  "scraped_at": "2026-02-14T13:11:08.895561"
}