{
  "article_id": "ff9860212ca0",
  "url": "https://www.hogshaven.com/2024/5/28/24162321/daily-slop-28-may-24-chris-cooley-calls-commanders-3rd-round-pick-brandon-coleman-a-project",
  "title": "WFT News : Washington Commanders News Links",
  "date": "20240528T123000Z",
  "domain": "hogshaven.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Daily Slop - 28 May 24 - Chris Cooley calls Commanders’ 3rd round pick, Brandon Coleman, “a project”\nA collection of articles, podcasts & tweets from around the web to keep you in touch with the Commanders, the NFC East and the NFL in general\nArticles\nWashington WireChris Cooley’s film review of Commanders’ DT Johnny Newton\n“He will come off the ball, quick twitch, and he can transition from speed to power. He can play inside; he can play nose. Quick hands, quick feet. When you are playing against Johnny Newton on the other side of the ball, you are worried he is going to beat you right now.”\n“I think the number one negative I see is he picks and chooses. There are times you can write L-A-Z-Y…It’s not that he can’t run down the line of scrimmage. It’s not that he can’t chase the ball carrier. It’s not that he doesn’t do that. He just picks and chooses.”\n“Honestly, I think he is a great pick. He is going to be around a couple of defensive tackles (Jonathan Allen, Daron Payne) who will not accept anything but “go” all the time. I think it will be a really good fit for him.”\n“I think he plays high, really upright, tall. He has a tendency to bend at the waist. I think this is where he gets in the most trouble. It hurts him with his change of direction.”\n“He is a position blocker in the run game. He is not a physical run-game blocker. He is not Trent Williams. He is going to try to get in, get his hands on you, and get his ___ where he doesn’t want the defender to go. He is going to try to quick and turn. I hate that.”\n“He stops his feet on contact; he is not a physical power-driving guy…and he gets beat a lot in the run game.”\n“I’d like to see him do a better job of finishing blocks…I’m concerned about his ability to sustain blocks, especially in space.”\n“So, Coleman is a project.”\nRiggo’s Rag\n4 risky experiments the Commanders could cut short in 2024\nThe Commanders have taken some risks heading into the 2024 season.\nJahan Dotson’s targets\nJahan Dotson remains a potential breakout candidate for the Washington Commanders in 2024. Many analysts thought this would come to fruition during the previous campaign after Eric Bieniemy opted to leave the Kansas City Chiefs and become the team’s new offensive coordinator. Despite being targeted heavily within a pass-happy system, it never materialized.\nThe former first-round selection has 1,041 receiving yards and 11 touchdowns in two seasons. Dotson boasts the athletic intangibles needed to be more effective, but creating separation effectively and limiting concentration errors is the next big challenge for the wideout entering Year 3 of his professional career.\nDotson looks like the No. 2 option behind Terry McLaurin unless Luke McCaffrey surges forward sooner than anticipated. This should guarantee targets are plentiful once again within Kliff Kingsbury’s offensive scheme. The wideout also has Jayden Daniels under center, so developing sufficient chemistry with the rookie quarterback throughout the summer is paramount.\nIf Kingsbury can find ways to scheme Dotson open frequently and the player demonstrates growth in areas that have been problematic up to now, it’s hard to envisage a scenario where he doesn’t make strides. Something that could leave the Commanders with no option other than to trigger his fifth-year option along the way.\nThere is a flip side to this coin. One that might have grave implications for Dotson’s influence and future.\nIf Dotson struggles to maximize targets when they arrive, suffers more problems with drops, and lacks the elusiveness needed to become an offensive focal point, the Commanders have a problem. This could lead the offensive staff to allocate distribution away from the pass-catcher, although depth at the receiver spot suggests the Penn State product will still be involved in some capacity.\nIt’s a hugely important season upcoming for Dotson. He’s got the talent, but putting it all together in pursuit of becoming a breakout star and potential cornerstone piece moving forward is critical. Especially considering Adam Peters is harboring no sentiment toward his roster-building ethos.\nSports Illustrated\nWashington Commanders RB Austin Ekeler Ranked, Brian Robinson Snubbed in PFF Rankings\nIn PFF’s running back rankings Austin Ekeler of the Washington Commanders makes the list, but Brian Robinson Jr. does not.\nAccording to Pro Football Focus’ list of the top 32 running backs in the NFL today, Ekeler is clearly the best back in the room.\n“Ekeler has been a curious case at running back. He has yet to surpass 1,000 rushing yards in his career, but his proficiency as a touchdown scorer is undeniable,” Thomas Valentine wrote while ranking the veteran 29th in the league and leaving Robinson off the list altogether. “Ekeler led the NFL in total touchdowns in the 2021 and 2022 seasons, scoring 38 total touchdowns in that time — more than any other skill player.”\nIt’s important to note that the ranking only stacks the projected starters, but therein lies the flaw in Valentine’s rankings from the beginning.\nOther backs like Chuba Hubbard (Carolina Panthers) and Joe Mixon (Houston Texans) could certainly be discussed as being lesser-caliber starting backs in the league than Robinson, if only PFF had the right ball-carrier in the No. 1 spot in Washington.\nThe Athletic (paywall)Kicker Brandon McManus accused of sexual assault during Jaguars flight: Report\nJacksonville played back-to-back London games in the 2023 season. The team hosted the Atlanta Falcons at Wembley Stadium on Oct. 1 before facing the Buffalo Bills at Tottenham Hotspur Stadium on Oct. 8.\nThe two women worked as flight attendants on the Jaguars’ Sept. 28, 2023, charter flight and alleged that McManus passed out $100 bills to encourage flight attendants to drink and dance for him, per the report from ESPN.\nPodcasts & videos\nLocked on Commanders: Washington Commanders Jayden Daniels and 7 Offensive Players w/ Something to Prove | Brandon McManus\nNFC East links\nBig Blue View\nSummer Scouting: Offensive tackles to watch during 2024 college football season\nAll eyes on the SEC\n[L]et’s take a look at some players who could be the top offensive tackles in the upcoming draft class.\nThis isn’t in any kind of order, but I’ll start with a trio of Tigers — two from LSU, and one from Clemson.\nWill Campbell, LSU\nCampbell is generally considered to be the top tackle in the upcoming draft class, and for good reason.\nHe has a compact, stocky build and his 6-foot-5, 320-pound (listed) frame seems to straddle the line between “guard” and “tackle”. However, Campbell certainly moves like an offensive tackle. He has quick feet with very efficient footwork that allows him to cover a significant amount of ground with little wasted movement. He has the agility and quickness to match up against speed and is surprisingly nimble for his size. Campbell has enough strength to play downhill in power run schemes, as well as laterally in outside zone schemes. Likewise, he’s a good blocker in space and a very reliable pass protector.\nThere might be teams that consider Campbell as a potential guard due to some length considerations. He doesn’t appear to have particularly long arms and can struggle a bit to win inside leverage — though he has fantastic grip strength when he does. Campbell also didn’t often appear to be overwhelmingly powerful as a blocker, and often relied on his feet, grip strength, and competitive toughness to lose slowly.",
  "word_count": 1259,
  "scraped_at": "2026-02-14T12:08:41.822647"
}