{
  "article_id": "ffb0ffeaec0a",
  "url": "https://kcrr.com/ixp/675/p/iowas-contestant-on-the-bachelor-was-almost-sent-home/",
  "title": "Iowa Contestant on  The Bachelor  Was Almost Sent Home",
  "date": "20230207T161500Z",
  "domain": "kcrr.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Iowa’s Contestant on ‘The Bachelor’ Was Almost Sent Home\nLast night was episode three of the latest season of 'The Bachelor,' and there was plenty of drama to keep viewers entertained. So far, Iowa-native Mercedes Northup has managed to stay in the game, but last night she almost ended up going home!\nAt the start of the episode, it was announced that there would be three dates: two one-on-one dates and one \"very large group date.\" Kaity was announced as Zach's pick for the first one-on-one date, which ended up being a nighttime date at the Natural History Museum. Kaity didn't return until 7 a.m. the next morning and then told the ladies that she didn't get any sleep. That seemed to shock everyone, Mercedes included.\nIn the meantime, Aly is selected for second the one-on-one date, which means that the rest of the ladies will be headed out on a group date. That date ended up being a full game of tackle football! The ladies were separated into two teams: the Shall-Crushers (yellow) and the Ball-Zachs (blue). Mercedes ends up on the yellow team, but unfortunately, that team ends up losing. That means Mercedes and her teammates had to go back to the house while the blue team got to spend a little more time with Zach. That includes Christina, who appeared to be driving all the other contestants nuts. Before the blue team's time is up, Zach ends up sending Bailey home and awarding Charity with a rose.\nBack at the house, the women are surprised again by a delivery for Aly. Ahead of her on-on-one date with Zach, she's gifted a wedding dress. For their date, the two of them jump out of a plane in their wedding attire. They end up in a hot tub before getting dressed up again, and that's when Aly gets her rose.\nTowards the end of the episode, it's revealed that Zach doesn't want to have a cocktail party that evening before the rose ceremony. Instead, he opts for a pool party where a bunch of girls try to \"steal\" him away for some one-on-one time. Mercedes does some chicken fighting, but that's all we really see of her at the party. Before the afternoon is over, Brianna tells Zach that she's decided to leave, but tips him off about Christina's attitude ahead of her exit. Zach then addresses Christina privately, and she has meltdown that ends up with her laying on the stairs.\nIn the end, it comes down to Mercedes vs Christina, with Mercedes nabbing the final rose. I'm sure a lot of people were surprised to see Christina get sent home, since the show typically thrives on drama, but I guess it was just too much for Zach.\nPersonally, I think the only reason Mercedes was in the bottom two is because she hasn't really had any one-on-one time with Zach. I'm hoping that will change over the coming weeks. Speaking of the coming weeks, Zach and the ladies are headed to the Bahamas, and the preview shows Zach making out with a lot of the contestants. I guess we'll have to wait and see what happens!\nIowans Share Their Random Celebrity Encounters\nThe ABCs of Iowa\nGallery Credit: Courtlin",
  "word_count": 542,
  "scraped_at": "2026-02-14T13:34:17.250620"
}