{
  "article_id": "ffcea5709b80",
  "url": "https://www.nytimes.com/athletic/6570846/2025/08/28/arsenal-cooney-cross-lewis-skelly/",
  "title": "Kyra Cooney - Cross : How training with Myles Lewis - Skelly prepared her for new Arsenal season",
  "date": "20250828T163000Z",
  "domain": "nytimes.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "It has been quite the summer for Kyra Cooney-Cross.\nThree months have passed since she was dancing on the pitch with her team-mates, celebrating Arsenal’s surprise victory over Barcelona in the Women’s Champions League final. There has been a valuable off-season trip home to Australia, a first full pre-season with Arsenal since signing two years ago, important meetings with managers for club and country — and the blossoming of a friendship with Myles Lewis-Skelly.\nAdvertisement\n“Myles had planned to do an off-season camp in Portugal, so he invited myself and Josh (Nichols),” Cooney-Cross tells The Athletic of her week-long training trip to the Algarve alongside two of the Arsenal men’s squad’s teenage stars.\n“We would eat together, do strength work together, train together. We each had little cabins to sleep in, so it was like a little family camp.”\nCooney-Cross describes Lewis-Skelly, the 18-year-old who had a stunning first-team breakthrough last season, as her “best mate”, the pair having developed a bond towards the end of last season.\n“Myles is like a brother,” she says of the England international.\n“It was an amazing experience, and something I would love to do every single year. I had so much fun, and learned so much.”\nWhile she is four years his senior, Cooney-Cross took an interest in Lewis-Skelly’s mindset. The versatile teenager is known to journal and, while Cooney-Cross does so too at times, she is more of a reader. She’s currently making her way through Thomas Erikson’s Surrounded by Idiots, a book about how and why people communicate the way they do.\nAs for 19-year-old full-back Nichols, she describes him as “one of the best one-v-one defenders I’ve ever seen,” though what Cooney-Cross doesn’t say is that she managed to beat the defender during one of their one-v-one duels in Portugal.\n“She killed me,” Nichols tells The Athletic, adding that the Australian midfielder just “stopped for a second and just went. She completely left me.”\n“I hadn’t seen Kyra play before, but had seen her around the training ground. As soon as we saw her play, everyone was like ‘wow, she’s amazing’. I definitely learned stuff from her as well … I play right-back, so moving into midfield, I was looking at her body position on the pitch and tried to mirror it.”\nAdvertisement\nAs for those pointers, what were they? “I just said I anticipate when the player is going to move,” he says. “I don’t look at the ball, I look at their feet and wait until they move because their feet will move before the ball does.”\nHer close control and passing abilities make Cooney-Cross a joy to watch. Former Arsenal Women head coach Jonas Eidevall once compared the 23-year-old, who started her playing career as a winger/No 10, to a running quarterback in American football. “She was very composed,” says Nichols.\nSigned from Swedish club Hammarby before the 2023-24 season, the 23-year-old made 10 starts in last season’s Women’s Super League (WSL) and six during that triumphant Champions League campaign. That was an increase from five WSL starts in her debut campaign.\nMost of last season’s starts came, however, before Ballon d’Or nominee Mariona Caldentey moved into a deeper midfield role to drive Arsenal towards European glory.\nCooney-Cross was an unused substitute in that final in Lisbon, with head coach Renee Slegers preferring the midfield triumvirate of Kim Little, Frida Maanum and Caldentey. But a new season presents new opportunities.\nCooney-Cross has started and played 90 minutes in Arsenal’s last two friendly matches ahead of the new season, against Tottenham Hotspur and West Ham, and has been encouraged to make the position her own.\n“Renee said it’s my shirt to take if I want it, so I guess it’s on me now. I need to make the most of the opportunity if I get it,” she says. “It’s exciting, because you want to be a starting player at Arsenal. I’ve been here for three seasons now, and I want to start playing and being an important player in that starting line-up and impact games.”\nThe Australia international started alongside Caldentey in Saturday’s pre-season friendly against Tottenham Hotspur, a 4-3 defeat at Meadow Park, and Slegers has been impressed with her work during the summer, which involved more strength training and extra focus on nutrition.\nAdvertisement\nEven when she went home to visit family near Melbourne, there were trips to the nearby Geelong Athlete Centre. “I’d train early in the morning, do my strength work, do some running, and then I’d be home by early lunchtime and I’d have the whole afternoon free with my family and my extended family as well,” she says.\nThough her father played the game just below professional level in Australia, football wasn’t a sport she grew up watching. As a result, she’s still finding new players to watch and learn from. There’s Crystal Palace’s Adam Wharton, “I would say I’m quite similar to him,” and her team-mates, the “consistent” Little and the “calm and composed” Lia Walti.\nRecognition of the defensive side of her role has been an area of focus long before Nichols gave her those tips. In her meetings with Slegers when the Dutchwoman was Arsenal’s individual-development coach, there was a focus on off-the-ball work when playing that deep midfield role.\n“The No 6 role is so important and I need to be mature on the pitch playing that role and very experienced,” Cooney-Cross says. “I feel like it (changing positions) was probably more of a compliment and a privilege because, like I said, that six role is so important and so demanding, on the ball and off the ball. It’s the spine of the midfield and your team.”\nThe responsibility that comes with playing that position is something Cooney-Cross is hoping to embrace for her country as well.\nA senior international since she was 19 years old, the midfielder was one of her country’s leading lights as it co-hosted the 2023 Women’s World Cup with New Zealand. The appointment of former Arsenal manager Joe Montemurro, known for his attacking style of football, has made her even more optimistic about Australia’s future, especially given what’s at stake during an important three years with the Asian Cup regional championship next March, the World Cup in Brazil in 2027 and the Los Angeles-hosted Olympics 12 months later.\nThe pair briefly worked together at Melbourne Victory when Cooney-Cross was a teenager and reunited at a national team camp in Perth last month.\nAdvertisement\n“When I saw him, I just had the biggest smile on my face. He’s such a nice guy and such a good coach,” she says. “We had a meeting, and he said he loves the way I play and wants to make me one of the best players in the world. Hearing that from a coach, you just feel excited.”\nVotes of confidence from Slegers and Montemurro will be invaluable heading into the new WSL season, which kicks off on the first weekend in September, where Arsenal will be aiming to stop Chelsea winning a seventh successive title.\n“It’s nice to know that I have coaches, and team-mates, that want me to play and want the best for me,” Cooney-Cross says. “They believe in me, trust me and want to help, so I am feeling very excited.”",
  "word_count": 1217,
  "scraped_at": "2026-02-14T12:23:28.985535"
}