{
  "article_id": "ffd71cc18c2f",
  "url": "https://www.rri.ro/en_gb/the_week_in_review-2680568",
  "title": "Radio Romania International",
  "date": "20230401T120000Z",
  "domain": "rri.ro",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "LISTEN HERE\n13.02.2026\nEverything you need to know about Romania in less than 60 minutes\nToday in the News\n13.02.2026\nThe European Union is committed to boosting its economic competitiveness\nToday in the News\n13.02.2026\nThe rule of law in Romania is again under the European Commission’s scrutiny\nToday in the News\n12.02.2026\nThe Constitutional Court of Romania again postponed a ruling with respect to magistrates’ special pensions, with a new date set for 18th February.\nToday in the News\n12.02.2026\nEuropean defense ministers have approved Romania's plan to attract 16.7 billion euros under the SAFE military program.\nToday in the News\n11.02.2026\nThe planned reform of public administration puts local mayors at odds with the political leaders in Bucharest.\nToday in the News\n11.02.2026\nThe European Union has launched a new action plan against cyber harassment in order to protect children in the online environment\nSport\n11.02.2026\nWomen’s handball teams from Romania are among top European sides\nRadio Feedback\nWeather\nBucharest, RO\n6:35 am,\nFeb 14, 2026\n3°C\nfog\n97 %\n1000 mb\n8 mph\nWind Gust:\n0 mph\nClouds:\n100%\nVisibility:\n0.3 km\nSunrise:\n7:17 am\nSunset:\n5:42 pm\nWeather from OpenWeatherMap\nSoundCloud Playlist\nCurrency Converter\nCurrency Converter RON/EUR: Sat, 14 Feb.\nFind us on Facebook!\nWorking in Romania\nThursday, 12 February 2026, 13:54\nThe latest from the Romanian labour market\nRomania. The Eastern Flank\nWednesday, 11 February 2026, 14:00\nPiatra Neamț, in north-eastern Romania, hosts training exercise bringing together Romanian and Belgian military.\nWorking in Romania\nThursday, 5 February 2026, 13:40\nThe unemployment rate in Romania was 6% in December 2025\nRomania. The Eastern Flank\nWednesday, 4 February 2026, 14:00\nPortuguese Army Contingent within the Multinational Brigade South-East in Romania\nRomania. The Eastern Flank\nWednesday, 28 January 2026, 13:38\nThe Supreme Allied Commander Europe, General Alexus Grynkewich, made an official visit to Romania last week\nMusic Time\n08.02.2026\nA fusion group based in Bucharest, whose music blends Afro, Latin, Balkan and funk influences\nHappening in Romania\n04.02.2026\nFor Romanian felinology, the year 2026 begins with a new confirmation of its value on the world podiums.\nChange Makers\n27.01.2026\nThe story of a Romanian-born Holocaust survivor who dedicated her life to education, advocating for remembrance and teaching about the horrors of the Nazi regime.\nMusic Time\n25.01.2026\nA chat with Alex and Claudiu, of the modern metalcore band \"Taking Back August,\" set up in Bucharest in 2020\nLISTEN HERE\nThursday, 12 February 2026, 20:10\nEverything you need to know about Romania in less than 60 minutes\nLISTEN HERE\nWednesday, 11 February 2026, 17:22\nEverything you need to know about Romania in less than 60 minutes\nLISTEN HERE\nMonday, 9 February 2026, 18:55\nEverything you need to know about Romania in less than 60 minutes.\nThe Future Starts Today\n13.02.2026\nThe concept of a two-speed Europe is not new, being one of the controversial ideas related to the future of the European Union.\nTraveller’s Guide\n12.02.2026\nPădurea Craiului area is increasingly emerging as a top destination for ecotourism in Romania\nSociety Today\n11.02.2026\nMeet Alina Dumitriu, activist, social workers, influencer\nInside Romania\n10.02.2026\nThe European Organization for Nuclear Research in Switzerland, CERN, as it is known, benefits from the presence of a community of over 100 Romanians working in research.\nThings to know\nFriday, 16 January 2026, 18:05\nRadio Romania International continues to expand its own podcast platform.\nThings to know\nFriday, 16 January 2026, 11:53\nRadio Romania International has continued to develop its own native podcast platform.\nThings to know\nThursday, 1 January 2026, 14:00\nUS president Donald Trump is chosen Personality of the Year in 2025 by RRI's listeners and Internet and social media users.\nThings to know\nThursday, 11 December 2025, 14:00\nLike every year, Radio Romania International is again inviting listeners to choose their favourite person in 2025.\nRRI Special\nSunday, 2 November 2025, 14:00\nA special broadcast marking Radio Day\nThings to know\nSaturday, 1 November 2025, 20:50\nRadio Romania International celebrates Radio Day in Romania, on November 1, with a new podcast platform.",
  "word_count": 670,
  "scraped_at": "2026-02-14T12:24:08.894248"
}