{
  "article_id": "fff41ebb31b9",
  "url": "https://www.gaeliclife.com/news/the-gender-gap/",
  "title": "The gender gap - Gaelic Life",
  "date": "20250504T224500Z",
  "domain": "gaeliclife.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Four out of five coaches across the grades and codes are male. We find out more about the paucity of female coaches.\nBy Niall Gartland\nWHEN former Antrim ladies boss Emma Kelly took our call last Friday afternoon, she was en route to taking a one-off training session at her native Desertmartin.\nKelly is very much accustomed to working at what many would deem unsociable hours. Now based in Belfast, the St Paul’s clubwoman has been coaching since she was 16 years old and is full-time employed as Sport4Development facilitator with Community Sports Network.\nLast August she signalled her resignation as manager of the Antrim senior footballers after four successful years in charge: she guided the Saffrons to back-to-back All-Ireland Junior finals, winning in 2022 after a replay against Fermanagh.\nIn 2023, Antrim won the Division Four league title before claiming Ulster Intermediate honours and reaching the semi-finals of the All-Ireland Intermediate Championship.\nShe isn’t quite the exception to the rule, but there aren’t too many like her. In January 2022, a survey dubbed “the largest ever coach development survey undertaken in Irish sport” found that there is a considerable underrepresentation of females involved in coaching Gaelic games.\nA collaboration by the GAA, the LGFA and the Camogie Association, the findings of the report found that 80 per cent of those who coach teams across all grades, codes and genders are male.\nAsked for her take on the disparity, Kelly didn’t reach for the feminist handbook (not that there’d be anything wrong with that!). She’s not surprised that there’s a gender gap in the coaching world, but thinks it doesn’t always have to be that way.\n“It seems to be easier to keep boys playing football. If you don’t get that buy-in from an early age, you’re not going to get it later on.\n“You need to have that love for coaching from early on, it’s what I’ve wanted to do since I was 12 or 13 years old, and I’ve been doing it since I was 16, so it’s nothing new to me.\n“If I’m asked to coach or manage, it doesn’t phase me as I’ve played at so many different levels and I’m used to being busy in the evenings.\n“Once girls start families or get full-time jobs, it can be difficult. Once they stop playing they stop altogether, the reason being that they’ve got their life back!\n“Once you get out of a routine of being out of the house two or three times a week, you’re not going to jump into it again.\n“It is hard and it is a big commitment, but there’s also a lot of girls out there who could be brilliant coaches, but they’ve probably never been asked and have been overlooked. There’s male managers who perhaps make assumptions that females won’t want to be involved when they see they have a young family at home etc.”\nThe lack of female managers is particularly glaring and obvious in Ladies Football and Camogie, at least at intercounty level. The players on the pitch are female but all-male management teams patrol the sidelines in the vast majority of instances. Asked if young girls find it easier to bond with a female manager, Kelly says it really depends.\n“There’s two ways of looking at it. Sometimes girls can actually find men a bit of a soft touch given they mightn’t be comfortable talking about female issues.\n“If someone says ‘I’m having stomach cramps’ or whatever, the manager might just automatically say ‘right okay’ whereas I might be more inclined to say ‘we all get them and you just have to manage it!’ We wouldn’t be on eggshells in that respect.\n“Maybe there’s more of an emotional attachment where you can be a bit more honest with them, but the reality is that the player has to be in the mood to listen, and they might take things the wrong way no matter who is speaking to them.\n“It just depends on the player and personality of the coach. It can take time to strike up a relationship whether you’re a man or a woman. In Antrim I was lucky as I already knew a lot of the players, so I already knew there were some girls you couldn’t say boo to, depending on their mood.\n“We’re all individuals and we’re all brought up in different ways, but I still think it’s good to have a female about the place, especially someone who’s been there and done that.\n“Everything’s getting more and more professional, the time demands are considerable and it’s good to have someone they can relate to on the management team, who can say “I trained all those times so why can’t you, it’s about time management.’”\nWhile female managers and coaches on the intercounty circuit are a rare commodity, Kelly says they’re more prevalent at club level. And there are notable examples at intercounty level as well – Caoibhe Sloan joint-managed the Down ladies for a number of years, Caroline Currid has forged a reputation as a leading Sports Psychologist who ha been involved in the backroom teams of four All-Ireland winners – Tyrone (2008), Tipperary hurlers (2010), Dublin footballers (2011) and more recently the four-in-a-row All-Ireland winning Limerick hurlers. Julie Davis, who competed for Team GB on 400m hurdles before injury ended her athletic career, is high performance manager for the Armagh senior footballers, while Maura O’Rahilly, wife of Kieran McGeeney, is their team physio. There’s other examples here and there – Portaferry native Niamh Mallon is a nutritionist for the Galway senior footballers for instance.\nKelly said: “I’m starting to see a lot more girls getting involved at club level. I refereed an U-14 girls game the other night, and one of the clubs had two or three mammies there helping out, and the other had a couple of young girls taking the team.\n“At county level, you do see females involved but usually they’re alongside a male, doing things like liaison work or in some instances coaching.\n“Sometimes you find that managers are bringing the same people with them, for example Mickey Harte and Gavin Devlin worked together for a long time and that’s understandable as they built up that relationship and trust over many years.\n“At the same time, sometimes a different approach can work as well, and it’s just about tapping into it and being aware of who’s out there. I think it’s an issue that isn’t really on a lot of people’s radars and that’s part of the problem as well – people aren’t really adopting the attitude that there’s women out there who would be good at this or good at that.”\n“The GAA has recognised that there’s a gap and have set up coaching courses for women but sometimes I wonder whether there’s an element of box-ticking to be honest.\n“I see it even at schools – where you have males taking the gaelic teams and the women, who generally are’t PE teachers, aren’t being considered usually.\n“Then on top of that, you do have to recognise that coaching is a massive time commitment, even at club level.\n“I’ve stepped away from Antrim and I’ve had a few teams come to me this year asking me to take a club team, and I said at the moment I’m out a lot and I can’t really spare an hour to drive to a club, to set-up and organise and plan, and then spend another hour driving home. It’s a big commitment and with domestic responsibilities, there’ll probably always be a bit of a gender gap, but I know quite a lot of girls who are involved at some level so maybe things are changing underneath the surface.”\nPull quote\n“If you don’t get that buy-in from an early age, you’re not going to get it later on.”\nPull quote\n“It is hard and it is a big commitment, but there’s also a lot of girls out there who could be brilliant coaches.”\nPhoto caption\nSAFFRONS SIDELINE…Emma Kelly had four memorable years in charge of Antrim ladies\nReceive quality journalism wherever you are, on any device. Keep up to date from the comfort of your own home with a digital subscription.\nAny time | Any place | Anywhere",
  "word_count": 1381,
  "scraped_at": "2026-02-14T13:32:37.191961"
}