{
  "article_id": "09075e903660",
  "url": "https://www.bbc.com/sport/football/articles/cqj9ry8r4p1o?at_medium=RSS&at_campaign=rss",
  "title": "Real Madrid's Weir made Scotland captain full-time",
  "date": "2026-02-10T11:22:21",
  "domain": "bbc.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "bbc_rss",
  "body_text": "Real Madrid's Weir made Scotland captain full-time\n- Published\nCaroline Weir has been named Scotland captain on an official basis ahead of the upcoming World Cup qualifiers against Luxembourg.\nThe Real Madrid midfielder missed Scotland's 3-2 friendly win against China in December, but led out her country in the six matches that preceded it and now takes on the role full-time alongside vice-captain Erin Cuthbert.\nPrevious skipper Rachel Corsie retired in June after living with \"chronic knee pain\".\nScotland play away in Luxembourg on 3 March before the return fixture four days later.\n\"I'm honoured and delighted to be named captain of the Scotland Women's National Team,\" Weir said. \"It's such a proud moment for me and my family.\n\"Every opportunity to represent Scotland is a privilege and to do so as captain is even more special and a responsibility that I'm excited to embrace.\n\"I'm fortunate to be surrounded by so many natural leaders within this squad and to have learned from those who have gone before me.\n\"It's an exciting time for us as we start the qualification journey to Brazil 2027, with a passionate, hard-working and talented group of players.\"\nHead coach Melissa Andreatta added: \"It's almost a year since I've been in the job and we're getting to know each other - this team and who they want to be.\n\"So I wanted to take that time about who best represents all those things about this team and through all those moments together, camps together, time together, the decision was made that Caz would best represent the team as captain and be more than ably supported by Erin as vice-captain.\"\nLiverpool's Martha Thomas - on loan from Tottenham - misses out on Andreatta's squad for March's double-header despite scoring in Sunday's 4-1 Women's Super League win over Aston Villa, while there is also no spot for Rangers Leah Eddie, who recently returned from injury.\nHibernian forward Kathleen McGovern is selected after making her first start since November on Sunday, getting on the scoresheet in a 2-0 SWPL victory over Motherwell.\nCharlton defender Charlotte Newsham, whose previous call-up came as an injury replacement, is also in the squad and could win her first cap.\n\"What I know about Luxembourg is, even though we haven't faced them before, they're a very technical side and they're a team really hungry to prove themselves on the world stage,\" head coach Andreatta said.\n\"We cannot underestimate anyone and we need to treat every game like a play-off.\n\"We have 10 play-offs this year and then we give ourselves the opportunity to be in Brazil.\"\nWhat did we learn from Scotland in 2025?\n- Published3 December 2025\nScotland squad\nGoalkeepers: Eartha Cumings (Manchester City), Lee Gibson (Glasgow City), Sandy MacIver (Washington Spirit).\nDefenders: Georgia Brown (SC Jacksonville), Jenna Clark (Liverpool), Nicola Docherty (Rangers), Sophie Howard (FC Como), Emma Lawton (Celtic), Rachel McLauchlan (Brighton and Hove Albion), Amy Muir (Glasgow City), Charlotte Newsham (Charlton).\nMidfielders: Chelsea Cornet (Birmingham City), Erin Cuthbert (Chelsea), Kirsty Maclean (Liverpool), Maria McAneny (Celtic), Miri Taylor (Aston Villa), Caroline Weir (Real Madrid).\nForwards: Lauren Davidson (SK Brann), Freya Gregory (Newcastle United), Kirsty Hanson (Aston Villa), Kirsty Howat (Crystal Palace), Mia McAulay (Rangers), Kathleen McGovern (Hibernian).",
  "word_count": 536,
  "scraped_at": "2026-02-14T01:50:56.576771"
}