{
  "article_id": "f4504245ef90",
  "url": "https://www.bbc.com/sport/football/articles/cn82w5v529po?at_medium=RSS&at_campaign=rss",
  "title": "'Women's FA Cup revamp would ruin the magic'",
  "date": "2026-02-03T14:25:57",
  "domain": "bbc.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "bbc_rss",
  "body_text": "'Women's FA Cup revamp would ruin the magic'\n- Published\nSeveral official supporters' clubs have hit out at a proposed new format for the Women's FA Cup, stating the changes will ruin the \"magic\" of the competition and mean the \"rich will only get richer\".\nThe Football Association has suggested a 'road-to-Wembley bracket', which would map out a team's route from the last 32 onwards.\nThere would also be an introduction of seeds in the draw, with four spots awarded to the top four teams from the previous Women's Super League season.\nThe proposal comes less than a fortnight after a major revamp of the Women's League Cup was announced, with the competition set to get a new name and follow a Swiss-style format for the group stage from next season.\nIt was confirmed in November that teams who qualify for the league phase of the Women's Champions League will no longer participate in the League Cup.\nA summary document seen by The Guardian, external claims the changes to the FA Cup will create \"high chances of consistent high-quality matches throughout the later rounds\".\nAn FA spokesperson told The Guardian \"no decisions have been made\" around the competition's future, but said it \"needs to evolve\".\n\"We committed in our women's and girls' game strategy, Reaching Higher, to review the Adobe Women's FA Cup, recognising the need to evolve the competition and strengthen its commercial potential,\" said the spokesperson.\n\"This would enable us to reinvest more funding into both the competition itself and the wider women's football ecosystem, which is vital for long-term, sustainable growth.\"\nWomen's League Cup to undergo name and format changes\n- Published22 January\nChampions League teams set to miss Women's League Cup\n- Published26 November 2025\nHowever, the proposal has been met with opposition on social media, with SheGulls, representing fans of Brighton & Hove Albion, suggesting the preferential treatment afforded to 'elite level teams' will only widen the gulf in quality across the pyramid.\n\"The sporting merit in our game is slowly being eroded in favour of 'super matches' between elite level teams,\" SheGulls wrote on X.\n\"The rich will only get richer and teams up and down the pyramid will fade into obscurity with the knowledge that without tens of millions of pounds, they won't even sniff the big time.\"\nFulham Women Supporters Club, whose side play in the fourth tier, labelled it a \"ridiculous idea\" and added: \"[It] goes against all the principles of the FA Cup. I'd like to see WSL teams actually come in a round early.\"\n\"And there goes the magic of the FA Cup! Subway Cup [League Cup] is a farce, now this?\" added Everton Women's Official Supporters Club.\n\"All about the money. Didn't take long to ruin the women's game too did it…\"\nIn its current guise, the Women's FA Cup follows the same format as the men's competition, with a draw following each round.\nThere is a preliminary round and three qualifying rounds featuring teams from tiers four to seven of the pyramid, with Women's National League teams entering in the first-round proper, and WSL2 teams in the third round.\nThe 12 WSL sides - which will increase to 14 from next season - enter the draw in the fourth round, which is the last 32.\nChelsea, Arsenal, Manchester United and Manchester City - who finished in the WSL top four last season - have won the past 13 Women's FA Cup titles between them.\nSporting integrity under question - analysis\nThe FA and WSL Football - the company overseeing England's top two teams - have made proposals in the past that have not come to fruition.\nThey are keen to remain inventive and look at all options to grow the game on the pitch, as well as commercially.\nAccording to BBC Sport sources, the Women's FA Cup proposals were brought to the attention of clubs after the FA claimed it had gathered data from fan surveys which had called for change.\nIt was presented for feedback and consultation and it is unclear if it will go any further, but there has already been a widespread backlash.\nSources at several WSL clubs have told BBC Sport they are worried about what these proposed changes could do to the \"sporting integrity\" of the competition.\nThey feel it gives elite clubs more advantage despite their stranglehold on the competition, with the last 13 winners being one of the existing top-four sides.\nOthers feel change is unnecessary, having just made adaptations to the Women's League Cup format in order to make it more competitive.\nWhile many feel it will not progress beyond initial consultation, there remains concern among WSL clubs.\nBen Haines, Ellen White and Jen Beattie are back for another season of the Women's Football Weekly podcast. New episodes drop every Tuesday on BBC Sounds, plus find interviews and extra content from the Women's Super League and beyond on the Women's Football Weekly feed",
  "word_count": 824,
  "scraped_at": "2026-02-14T01:51:16.363897"
}