{
  "article_id": "3cb7f4429c64",
  "url": "https://www.skysports.com/football/news/11095/13502101/man-city-thrash-chelsea-to-prove-they-are-the-womens-super-leagues-new-dominant-force",
  "title": "Man City thrash Chelsea to prove they are the Women's Super League's new dominant force",
  "date": "",
  "domain": "skysports.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "web_scraped",
  "body_text": "Man City thrash Chelsea to prove they are the Women's Super League's new dominant force\nAfter a 2-0 defeat to Arsenal last weekend, Chelsea have lost back-to-back league games for the first time since July 2015; it's also the first time Sonia Bompastor has suffered successive defeats in her managerial career; Man City are now champions elect\nMonday 2 February 2026 09:24, UK\nThis season has witnessed a changing of the guard in the Women's Super League. A symbolic baton pass happened on Sunday. Chelsea, the six-time defending champions, handed over their title to Manchester City, the champions in wait.\nBut this was not a happy handover. It was a siege. Man City are stampeding their way to the 2025/26 title and seem prepared to dismantle anyone in their way. It's a ruthlessness we used to associate with Chelsea themselves.\nCity's latest takedown, a 5-1 thrashing at the Etihad, proved in no uncertain terms that this is a team on the way to the very top. Sonia Bompastor's Chelsea meanwhile, look like a side on the decline, low on confidence and \"not in a good dynamic\", as the Frenchwoman put it afterwards.\nBompastor has lost consecutive games for the first time in her managerial career and this was by far Chelsea's worst performance under her. It is as if Man City have become everything Chelsea used to be.\n- Man City 5-1 Chelsea - Match report and highlights\n- As it happened | Teams | Stats | Table\n- Watch FREE Women's Super League highlights\nThe completion of Kerolin's hat-trick in the second half was met with chants of \"easy, easy, easy\". After Vivianne Miedema headed a fifth from a corner the home fans crowed for six, not out of irony, but because it was absolutely possible. City landed a total of 11 shots on target and generated eight big chances. If anything the scoreline was generous.\nCity end the weekend 12 points ahead of Chelsea, which is the furthest from the top the Blues have been since the final day of the 2018-19 season - when Arsenal were crowned champions. A spectacular fall from grace given their incredible 34-match unbeaten run was only halted by Everton eight weeks ago.\nIndeed Sunday marked the culmination of Bompastor's most difficult spell since taking charge 18 months ago - or ever. She admitted \"nothing went right\". But a result like this had been coming.\nPerformances across the season have dropped in almost all metrics, underperforming against their xG tally by more than any other team and leaking goals at a greater rate too. Bottom club Liverpool have conceded fewer shots inside their own box than Chelsea have this season.\nThe drop-off can be seen by the eye just as clearly as it's illustrated by the underlying numbers. \"I'm not worried,\" insisted Bompastor at the Etihad. \"You need to understand when the team is not in a good place in terms of dynamics, I think it reflects on the body shape. Right now we are not at our best in terms of confidence, that's normal, we are losing games. It's not where we want to be. Sometimes it reflects on our body language.\"\nPlenty of players, including captain Millie Bright and centre-back partner Naomi Girma, were visibly deflated on the pitch. Chelsea are not used to losing games, much less in this manner, and it's wearing heavy on a side also hit with injuries.\nUnfortunately for Bompastor, the dip is happening at a time where one of their closest rivals are hitting their best rhythm for a decade. The gulf in class was as apparent on the day as it is in the table. Few predicted City would be the dislodgers in Andree Jeglertz' first season.\nUltimately, Man City are a more complete side, with better depth of quality and far more variation to their game - a formidable combination. They have used recent transfer windows better than most.\nAnd yet Chelsea's incredible squad strength has always been their best asset, aided by the largest financial outlay of any WSL club in terms of transfer fees paid. Chelsea were always the envy of the league in that regard. What's changed?\n\"Without making too many comments I would have liked to be in a better place in terms of the last transfer windows, yeah,\" Bompastor said, suggesting the club have either missed out on targets or been unwilling to pursue them. Either way, Chelsea's squad is short of the talent needed to retain their title for a seventh year. City cannot possibly blow it from here.\nThe Blues must now put all their eggs in the Champions League basket; arguably the competition they have wanted to win with greater hunger anyway. Having qualified automatically for the quarter-finals after finishing third in the league phase, their European campaign does not resume until March - plenty of time to break this damaging cycle.\nCity, meanwhile, have their own quest. They have morphed into a title force quicker than even Jeglertz could surely have hoped for. This is the WSL's new normal. Now it's on everyone else, including Chelsea, to make up the deficit.",
  "word_count": 857,
  "scraped_at": "2026-02-14T01:53:09.063882"
}