{
  "article_id": "4fa62e006c8b",
  "url": "https://www.skysports.com/football/news/11095/13078979/now-sports-membership-q-a-how-do-i-stream-sky-sports-is-it-instant-is-there-a-contract",
  "title": "NOW Sports Membership Q&A: How do I stream Sky Sports? Is it instant? Is there a contract?",
  "date": "",
  "domain": "skysports.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "web_scraped",
  "body_text": "NOW Sports Membership Q&A: How do I stream Sky Sports? Is it instant? Is there a contract?\nThe below content is an advert\nMonday 15 December 2025 17:07, UK\nWant to stream Sky Sports with NOW? Great, go HERE!\nWhat is NOW?\nNOW is an instant streaming service offering access to all 12 Sky Sports channels, every Sky Sports+ stream, and much more.\nIt's an app, so customers can sign up and stream instantly across over 60 devices. It offers contract-free memberships options, so customers can cancel anytime!\nYou can choose between a Month or Day Memberships. The latest prices for each Membership option can be found here.\nSounds great! What channels do I get?\nMemberships gives you access to:\n- Sky Sports Main Event\n- Sky Sports Premier League\n- Sky Sports Football\n- Sky Sports F1\n- Sky Sports Tennis\n- Sky Sports Cricket\n- Sky Sports Golf\n- Sky Sports+\n- Sky Sports Action\n- Sky Sports Racing\n- Sky Sports News\n- Sky Sports Mix\nNOW Sports Memberships also give customers access to all live Sky Sports+ streams as well as Sky Sports documentaries and selected replays and highlights on demand within your Membership period.\nN.B. Customers cannot access Sky Sports Box Office events via NOW.\nSo, I don't need a smart TV, stick or set-top box to get NOW?\nNo - you don't need one. You can watch NOW on over 60 different devices, including selected smart TVs and sticks, but also on smartphones, PC or Mac, plus PS4/PS5™, Xbox One & Xbox Series X/S consoles.\nWatch online at NOWTV.com or download the app to watch on your smartphone, smart TV or games console.\nSee our full list of compatible devices.\nIf I sign up to NOW on one device, can I watch it on another?\nYes - you can sign up on one device and watch on another device of your choice. This sign-in journey varies by platform, but on Smart TVs for instance, you will be given a QR code function to sign in quickly.\nHowever, customers without Boost cannot watch NOW on two devices at the same time.\nThe match I want to watch starts in 10 minutes, is the Membership instant?\nYes!\nCan I watch without a contract?\nYes, NOW offers contract-free Sports Month & Day Memberships options, so customers can sign up and cancel anytime.\nFor your fully flexible Sports Month Membership, you'll still be able to stream until the end of that 30-day viewing period. If you don't cancel, it renews automatically at the end of the 30-day period.\nWhat sports can I watch?\n- Premier League.\n- Carabao Cup.\n- EFL.\n- WSL.\n- Formula 1.\n- England Cricket home matches.\n- ICC Cricket Tournaments (e.g., Cricket World Cup)\n- All Golf Majors & Ryder Cup.\n- US Open, ATP & WTA Tour Tennis.\n- Premier League Darts.\n- Betfred Super League.\n- NFL.\nHow many devices can I watch on at the same time?\nYou can watch on one device as standard, up to two devices at the same time with NOW Boost, or up to three devices at the same time with NOW Ultra Boost.\nWhat are NOW Boost and NOW Ultra Boost?\nUpgrading to Boost means you can watch in Full HD, enjoy Dolby Digital 5.1 with your sound system or soundbar, get an extra device to stream on, and watch on-demand content ad-free.\nUpgrading to Ultra Boost means you can watch in up to 4k UHD HDR, enjoy Dolby Atmos with your sound system or soundbar, get two extra devices to stream on, and watch on-demand content ad-free. Check device compatibility here.\nTo add Boost or Ultra Boost to your Sports Membership, head over to My Account section of the NOW website.",
  "word_count": 628,
  "scraped_at": "2026-02-14T01:53:18.927526"
}