{
  "article_id": "5188618d42aa",
  "url": "https://www.skysports.com/football/news/36996/13503293/wsl-round-up-xxxx",
  "title": "WSL round-up: Chelsea beat Tottenham after two straight defeats as Arsenal end Man City's 13-game winning streak",
  "date": "",
  "domain": "skysports.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "web_scraped",
  "body_text": "WSL round-up: Chelsea beat Tottenham after two straight defeats as Arsenal end Man City's 13-game winning streak\nChelsea put two straight losses behind them to beat Tottenham 2-0; Arsenal end WSL leaders Man City's 13-game winning streak with 1-0 victory at the Emirates; Liverpool thump Aston Villa 4-1; remarkable turnaround sees West Ham beat Brighton 3-2; Everton win 1-0 at London City Lionesses\nSunday 8 February 2026 18:54, UK\nTottenham 0-2 Chelsea\nChelsea returned to winning ways in the Women's Super League with a 2-0 victory over Tottenham.\nIn their last two outings, the Blues had been thumped by Manchester City along with a defeat to Arsenal, but they went ahead at the Tottenham Hotspur Stadium through Keira Walsh.\nAlyssa Thompson doubled their advantage early in the second half as Chelsea stayed third in the standings and went four points clear of Spurs, who remain fifth.\n- Live Women's Super League table\n- Not got Sky? Get Sky Sports or stream with no contract on NOW📺\n- Download the Sky Sports app | Get Sky Sports on WhatsApp\nArsenal 1-0 Man City\nA wonderful 17th-minute goal by Olivia Smith helped Arsenal consign Women's Super League leaders Manchester City to a first defeat since September.\nCity had not lost since the opening day of the season but Andree Jeglertz watched the 17-match unbeaten run of his pace-setters end at Emirates Stadium.\nSmith raced onto a wonderful Mariona Caldentey pass and rounded Ayaka Yamashita to score her seventh goal for Arsenal.\nEven though WSL leading scorer Khadija Shaw threatened before and after half-time, Renee Slegers' side held on for a vital three points.\nLiverpool 4-1 Aston Villa\nLiverpool moved off the bottom for the first time since November with a fine 4-1 win over Aston Villa.\nIt took the Reds 12 matches to get off the mark in the WSL this season, but they made it two wins in three after goals by Mia Enderby, Martha Thomas, Grace Fisk and Aurelie Csillag in St Helens.\nEnderby and Thomas scored within 14 minutes and while Miri Taylor reduced the deficit before the break, Fisk and Csillag struck late on to help Liverpool leapfrog relegation rivals Leicester.\nWest Ham 3-2 Brighton\nWest Ham were set to go bottom after they went two goals down at home to Brighton before they produced a remarkable turnaround to win 3-2.\nManuela Vanegas put Brighton 2-0 up after 63 minutes following Kiko Seike's 40th-minute opener, but Ffion Morgan gave the hosts a lifeline with eight minutes left when her cross caught out goalkeeper Chiamaka Nnadozie.\nShekiera Martinez levelled in the 86th minute before Viviane Asseyi completed the comeback after a goalmouth scramble in the first minute of stoppage time to spark wild celebrations.\nLondon City Lionesses 0-1 Everton\nEverton responded to the midweek dismissal of Brian Sorensen with a 1-0 triumph at London City Lionesses.\nAfter a goalless first 45, Inma Gabarro broke the deadlock in the 62nd minute.\nIt proved enough to help Everton register back-to-back WSL wins for the first time this season after a string of saves by goalkeeper Courtney Brosnan.",
  "word_count": 516,
  "scraped_at": "2026-02-14T01:53:23.161379"
}