{
  "article_id": "becc67b6d16a",
  "url": "https://www.skysports.com/football/news/11095/13497982/womens-champions-cup-2026-dates-teams-qualified-venues-draw-format-and-schedule",
  "title": "Women's Champions Cup 2026: Dates, teams qualified, venues, draw, format and schedule",
  "date": "",
  "domain": "skysports.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "web_scraped",
  "body_text": "Women's Champions Cup 2026: Dates, teams qualified, venues, draw, format and schedule\nThe inaugural FIFA Women’s Champions Cup is in London, with the the final on February 1; Sky Sports will exclusively broadcast all matches; Arsenal are into the final of the tournament and will face Corinthians for the trophy\nThursday 29 January 2026 08:54, UK\nArsenal remain on course to make history as the first-ever winners of the FIFA Women’s Champions Cup.\nThe reigning European champions have made the final of the London-based competition which pits continental title winners against each other.\nThis is everything you need to know about the tournament\n- Women's Champions Cup fixtures & results\n- Got Sky? Watch now on the Sky Sports app📱\n- Not got Sky? Get instant access with no contract📺\n- Download the Sky Sports app | Get Sky Sports on WhatsApp\nWhat has happened in the 2026 Women's Champions Cup?\nArsenal booked their place in the Women's Champions Cup final with a 6-0 thrashing of African champions FAR Rabat at the Brentford Community Stadium on Wednesday.\nEarlier in the day at the same venue, CONCACAF champions Gotham FC were stunned by Copa Libertadores Corinthians 1-0.\nThe competition actually began before Christmas, with two first round matches taking place in October and December seeing CAF Women's Champions League winners FAR Rabat qualify for the semi-finals.\nThe third-place play-off and final will now take place on Sunday February 1 at the Emirates Stadium.\nWho qualified for the Women's Champions Cup?\nThe continental club champions from the preceding season qualified for the tournament.\nAFC Women's Champions League holders Wuhan Chegu Jiangda and OFC Women's Champions League winners Auckland City failed to make it out of the first round to earn a place in the semi-final.\nThat spot went to CAF Women's Champions League winners ASFAR, who join Arsenal, Gotham FC and Corinthians in the final four.\nThe Gunners qualified by beating Barcelona in last season's Champions League final. New York based Gotham FC claimed the CONCACAF equivalent by beating Mexican side Tigres to earn their spot. Corinthians beat Deportivo Cali to qualify via the CONMEBOL Libertadores Femenina.\nWhere can you watch the Women's Champions Cup?\nSky and FIFA have agreed an exclusive new partnership which will see the Final Stage of the FIFA Women's Champions Cup broadcast live on Sky Sports in the UK and Ireland on January 28 and February 1\nSky Sports will exclusively broadcast all matches, with the third-place play-off at 2.45pm on Sunday and the final at 6pm.\nSky's coverage of the FIFA Women's Champions Cup will feature Izzy Christiansen, Caroline Barker, Natalie Gedra, Ellen Ellard and Courtney Sweetman-Kirk.\nHow does the Women's Champions Cup impact the WSL?\nArsenal were due to face Leicester City in the WSL on Saturday January 31, but the game has been postponed due to the Gunners' involvement in the Women's Champions Cup. A rescheduled date is yet to be confirmed.\nThe remaining five games that weekend will take place as planned on Sunday February 1, with four being shown live on Sky Sports.\nRecord-breaking prize money on offer\nThe winners of the Champions Cup Trophy in 2026 will receive $2.3m (£1.7m), while the runners-up will earn $1m (£750,000) setting a new benchmark for the sport.\n\"A total payout of close to $4m distributed among the six participants based on their performance is a clear statement of the belief in women's club football and the players, teams and competitions driving its continued rise,\" said FIFA Secretary General Mattias Grafström.\n\"It reflects the global growth of the women's game and FIFA's commitment to making targeted, meaningful investments that strengthen women's club football for the long term. Our focus is clear: to continue investing in, growing and elevating women's club football at every level - ensuring that opportunity, visibility and value keep pace with the exceptional performances seen on the pitch.\"",
  "word_count": 646,
  "scraped_at": "2026-02-14T01:53:15.422347"
}