{
  "article_id": "6863f44122e3",
  "url": "https://www.bbc.com/sport/football/articles/cp82r3qmz65o?at_medium=RSS&at_campaign=rss",
  "title": "Newcastle prove they can mix it with European champions",
  "date": "2026-01-29T00:40:10",
  "domain": "bbc.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "bbc_rss",
  "body_text": "Newcastle prove they can mix it with European champions\n- Published\nNewcastle United have experienced all manner of emotions at the Parc des Princes.\nIt was here, just a couple of years ago, that Eddie Howe's side were denied a famous win against Paris St-Germain after the hosts were awarded a controversial penalty in stoppage time.\nThat 1-1 draw left a bitter taste, as a result, but there was a very different feeling in the away dressing room on Wednesday night following the same result.\nThis was a night when Newcastle - not PSG - came from behind after putting in a gutsy showing against the Champions League holders.\nThere have been a number of occasions where these players and staff have approached the away end sheepishly this season following a poor display on the road.\nThis was not one of them.\n\"We love Newcastle, we do,\" the travelling support sang at full-time.\nThe point was not enough to secure automatic qualification for the last 16, but Eddie Howe's side look well placed to progress past Monaco or Qarabag if they build on this.\n\"We wanted to win tonight,\" the Newcastle head coach said. \"We didn't want the extra games, but we will take it.\n\"We will go down that route and we are going down that route in the best possible way with a strong performance against the holders of the competition.\n\"If there's ever a game we need to look to give us confidence, it's this one.\"\nChanges pay off after bold selection\nYet it looked like history was about to repeat itself at one point.\nThe game had not long kicked off when PSG were awarded a controversial penalty following a video assistant referee (VAR) review after the ball bounced off the arm of Bradley Barcola and then struck Lewis Miley's hand inside the box.\nIt brought back memories of when Newcastle defender Tino Livramento was penalised for an unintentional handball at the same stadium in 2023.\nKylian Mbappe took full advantage that night but, this time, Pope got a strong hand to Ousmane Dembele's spot-kick to briefly quieten the Parc des Princes.\nAlthough Vitinha did put the hosts in front, just a few minutes later, Newcastle did not crumble, even after such a shaky start.\nThey did not let their frustrations get the better of them, either, when they were not awarded a penalty of their own after the ball struck Marquinhos' hand inside the box a few minutes before Joe Willock equalised.\nWillock was one of five players recalled by Howe and this was a night when the Newcastle head coach's faith in his squad eventually paid off.\nWith an eye on Saturday's trip to Anfield, Howe made five changes as Dan Burn, Anthony Elanga, Jacob Ramsey, Willock and Nick Woltemade came into the team, knowing he needed fresh legs.\nThey certainly stepped up - not least Burn, who wore the captain's armband.\nBurn, making his first appearance since breaking a rib and puncturing a lung, was even named man of the match after a colossal performance.\nTo think the 33-year-old had been \"anxious\" before the game.\n\"That injury did shake me up a little bit,\" he said. \"It was something I had never had before.\n\"I was really happy when the first whistle went because I just settled back into my routine and didn't think about it.\n\"I don't remember taking any knocks so I was happy. It was strange. It was probably the first time I went into a game slightly worried about the bloke I was going to get hurt against.\"\nEngland on course for fifth Champions League spot\n- Published30 January\n'That was the Joe Willock of old'\nThen there was Willock.\nThe midfielder was subject to abhorrent racial abuse from an anonymous Instagram account earlier this month, but he embodied his side's resilience.\nIndeed, after heading his side level, in first-half stoppage time, Willock defiantly put his finger to his lips as the home support whistled loudly.\n\"That was the Joe Willock of old,\" Howe said. \"Always a scorer of big goals. His goalscoring record when he first joined the club was really strong and he scored goals in my first year in particular so really pleased for him.\n\"He's had a tough time with injuries. He's trained really well for us behind the scenes. He's been waiting for opportunities and today was the right time.\"\nIt was Willock's maiden goal in the Champions League.\nBut this is a competition these players now feel they belong in after so many of the squad only sampled life at Europe's top table for the first time back in 2023.\nNewcastle exited the group stage that year, but they have certainly relished the new format, finishing level on points with PSG in the standings.\nHowe's men have only lost two Champions League games - against Barcelona and Marseille - and swatted aside PSV Eindhoven, Benfica, Athletic Club and Union Saint-Gilloise.\nTheir European adventure continues.\n\"This is a really good step in the right direction,\" Pope told TNT Sports. \"I'm really pleased with that.\n\"There are things to work on. We came to this competition two years ago and didn't get to this stage so this is really exciting for us.\n\"We have got lessons to learn and we will really take it on and see how far we can go.\"",
  "word_count": 897,
  "scraped_at": "2026-02-14T01:48:08.026754"
}