{
  "article_id": "a8ba90c4e02a",
  "url": "https://www.bbc.com/sport/football/articles/cgk86k8rllmo?at_medium=RSS&at_campaign=rss",
  "title": "Benfica meet Real in play-offs after dramatic league phase encounter",
  "date": "2026-01-30T11:35:00",
  "domain": "bbc.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "bbc_rss",
  "body_text": "Benfica meet Real in play-offs after dramatic league phase encounter\n- Published\nBenfica will face Real Madrid in the Champions League play-offs just three weeks after their dramatic league phase encounter.\nOn Wednesday, goalkeeper Anatoliy Trubin's 98th-minute goal earned Jose Mourinho's side a 4-2 win against the Spanish giants.\nNewcastle will play Qarabag after finishing the league phase in 12th place, while defending champions Paris St-Germain, who finished 11th, will face Ligue 1 rivals Monaco.\nThe two-legged play-offs are for teams who finished between 9th and 24th in the league phase and the first games will take place on 17-18 February, with the second round one week later.\nThe Puskas Arena in Budapest, Hungary will host the 2025-26 final on 30 May.\nQarabag finished 22nd in the league phase after winning three, drawing one and losing four of their matches.\nThey were defeated 6-0 against Liverpool at Anfield in their final outing and have not beaten a Premier League team in nine previous attempts.\nThe Azerbaijan champions avoided defeat for the first time against an English club when drawing 2-2 with Chelsea in November.\nThe winner of the tie between Newcastle and Qarabag will face either Chelsea or Barcelona in the last 16.\nArsenal, Chelsea, Liverpool, Manchester City and Tottenham all finished in the top eight of the league phase and have qualified automatically for the last 16.\nThe draw for the last 16, quarter-finals, semi-finals and final all take place on 27 February.\nWhy have English teams dominated as Real & PSG face play-offs?\n- Published29 January\nHow much do teams earn for reaching Champions League knockouts?\n- Published30 January\nChampions League play-offs draw in full\nBodo/Glimt v Inter Milan\nBenfica v Real Madrid\nMonaco v Paris St-Germain\nQarabag v Newcastle\nGalatasaray v Juventus\nClub Brugge v Atletico Madrid\nBorussia Dortmund v Atalanta\nOlympiacos v Bayer Leverkusen\nWhat comes after the play-offs?\nOnce the eight winners of the play-offs have been determined they progress to the last 16, where they will meet the top eight finishers from the league phase.\nFrom this point onward the competition adopts a knockout format, with each fixture other than the final contested over two legs.\nAs with the play-offs, teams' final ranking in the league phase will influence seeding in the last 16, with seeded sides - those that finished in the top eight of the league - given the advantage of playing their second fixture at home.\nThis is the first season that the position in which teams have placed in the league phase will also influence seeding for the quarter-final and semi-finals.\nTeams finishing first to fourth at the end of the league phase will be seeded for the quarter-finals, and therefore given the second leg home advantage for their potential quarter-final tie.\nThe two sides who finish top and runner-up in the league will also be seeded for the semi-finals, earning them the benefit of playing the second leg of their semi-final tie at home should they reach that stage.\nIf a seeded team does not progress to the quarter or semi-finals, the team that knocked them out inherits their seeding position.\nKnockout phase fixture dates\nThe dates for the knockout phase are as follows:\nLast 16: 10-11 and 17-18 March\nQuarter-finals: 7-8 and 14-15 April\nSemi-finals: 28-29 April and 5-6 May\nFinal: 30 May\nGet football news sent straight to your phone\n- Published16 August 2025\nWatch highlights of every Champions League game from 22:00 on Wednesday on BBC iPlayer and the BBC Sport website and app.\nThere will also be a Champions League Match of the Day on BBC One on Wednesday, from 22:40 to 00:00.",
  "word_count": 608,
  "scraped_at": "2026-02-14T01:47:57.657660"
}