{
  "article_id": "f3fbb76ef810",
  "url": "https://www.bbc.com/sport/football/articles/czrjpvk3yzgo?at_medium=RSS&at_campaign=rss",
  "title": "'Thank you Gareth - you gave a nation new memories'",
  "date": "2024-07-16T14:48:19",
  "domain": "bbc.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "bbc_rss",
  "body_text": "'Thank you Gareth - you gave a nation new memories'\n- Published\nBBC Sport's Kelly Somers has written an open letter to departing England manager Gareth Southgate, having reported on the national team since 2021.\nDear Gareth,\nI’m writing this as someone who’s had the privilege of being in your company quite a lot for the past three years, so shall we start with an apology? I’m sorry that winning and progressing in tournaments came with the caveat that meant you had to speak to me so much. But for what it’s worth, over the past three years they have given me some of my career highlights.\nFrom the moment I took over as BBC Sport’s England reporter in 2021, I knew it was an exciting time for football in the country - as another more experienced reporter told me, it hadn’t always been like this, and somehow you’d taken what you started in Russia and bottled it up and kept it for that Euros. And what a time we - the media, the players, the fans - had. I’ll never forget after the Germany knockout win, as I asked you how it felt for you to beat them after what happened in 1996, and you looked at the big screen and said you’d seen an image of your former team-mate David Seaman during the game and knew you could never repay him and your team-mates for your missed penalty, but you wanted to give people new memories. And that you did.\nBut this isn’t just the moments on the pitch or on camera - for which there were many - it was the moments off it too that will stay with me. Every interview we did, without fail, you walked in, said hello and shook every crew member’s hand. You asked how we were - and it didn’t feel just routine. It felt real. I can imagine at times that the job of England manager doesn’t make you feel very human, but you always did.\nWhen I returned to St George’s Park last September for the first time since I’d announced my pregnancy, you arrived with a gift for my baby. But you didn’t really want to take the credit, ensuring your colleagues in the media team who had organised it did. I’ll almost remember that more than the gesture - and you asking after my family when I saw you after. Because football mattered, but you knew that people, and family, matter more.\nSouthgate resigns after England's Euro 2024 loss\n- Published16 July 2024\n'Southgate deserves respect but was not the winner England wanted'\n- Published16 July 2024\nWho will be next England manager?\n- Published16 July 2024\nBut reporter and manager relationships can’t always be pleasantries and presents. At times I have to ask the difficult questions, and you always respected that. After the game against Denmark in the group stage, I asked you if the team dropping off after scoring was an instruction from you, if Trent Alexander-Arnold in midfield was working and if England were playing well enough overall. You answered them all with the same level of detail as you always did - and still walked in with the same smile and handshake before our next interview just two days later. We both had a job to do, and you knew that.\nThat said, this tournament did feel like it had taken its toll. While the smiles and handshakes never stopped, there were times when you walked in I felt the weight of expectation on your shoulders, as well as the desperation to succeed. The mood did lift after Switzerland - the post-match celebrations with the fans perhaps went some way in reassuring you there was still belief in you and your plan, but it was clearly too little, too late.\n“What happens on Sunday will define me to others but not to myself,” was your message in our final sit-down interview - and it was clear now, you already knew that you’d gone as far as you could as England manager. I don’t believe there is anyone that would have wanted to lift that trophy more on Sunday, or in 2018, 2021 or 2022. And I don’t believe there is anyone who dealt with you regularly, as we did, that didn’t want you to end with that either.\nSo thank you Gareth, for giving this reporter, who grew up watching England teams rarely go deep into tournaments, the opportunity to have a front-row seat when they did. And when they do eventually lift that trophy, I hope you still get satisfaction in knowing that you have laid the foundations for that success.\nBut for now, as you also said to me in an interview in Germany - whatever happened out there, your dog will still greet you the same way regardless when you walk back through the door. So enjoy those dog walks Gareth, you’ve earned them.\nKelly.",
  "word_count": 825,
  "scraped_at": "2026-02-14T01:49:20.116525"
}