{
  "article_id": "00186aa17a17",
  "url": "https://metro.co.uk/2024/10/01/luis-enrique-decision-arsenal-vs-psg-branded-a-situation-failure-21712031/",
  "title": "Luis Enrique decision for Arsenal vs PSG branded a  situation of failure  ",
  "date": "20241001T150000Z",
  "domain": "metro.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Luis Enrique’s decision to drop Ousmane Dembele for Paris Saint-Germain’s Champions League clash with Arsenal has been described as a ‘situation of failure’ in France.\nArsenal host PSG at the Emirates Stadium in the second game of their Champions League campaign on Tuesday evening but the French club will be without Dembele, who was involved in a bust-up with Luis Enrique after the 3-1 win over Rennes last Friday.\nDembele, who was substituted with eight minutes remaining in the victory against Rennes, has not travelled with his PSG teammates to London.\nRMC Sport pundit, Daniel Riolo, has slammed Luis Enrique’s decision to leave Dembele out of the squad and feels PSG are now missing their most dangerous attacking player against Arsenal.\n‘At the moment when you are about to play the most important match of the start of the season for PSG, the one that will give an indicator, that will be the first solid reference, you find yourself with a case where the coach falls out with a player, no matter how bad the fall out is. And we end up leaving a player out when it comes to playing this match, it is an admission of failure,’ Riolo said.\n‘With all the reservations that I, the first, have about Ousmane Dembele, I’m not a big fan of this player, he’s in your squad. He’s there. And when he’s there, whether you like it or not, good, bad, clumsy, left foot, right foot, whatever you want, he’s the man who creates the most danger in your team.\nGet your football fix\nDon't want to miss the week's biggest football stories? Metro's exclusive football newsletter, In The Mixer, is your essential guide.\nFrom the latest transfer rumours and managerial moves to analysis of the biggest games and a lot more, our experts have you covered.\nSign up here, it's an open goal.\n‘Barcola puts the moves into practice but the one who creates the most danger and who, what’s more, has even been a bit effective this year, is Dembele.\n‘How can you put yourself in a situation like that, on the eve of the most important match, to fall out with a key player in your squad? How are you going to make that decision by throwing him in everyone’s face? You’re going to justify yourself by wasting a quarter of an hour in a press conference for a very important Champions League match. It’s a situation of failure.’\nRiolo also believes that Dembele was never the right fit for the type of attacking player Luis Enrique wants at PSG.\n‘Last year, I said that Luis Enrique was not a fan of Dembele and that if there had been a way to get him to leave… he is not a typical Luis Enrique player and he never will be,’ Riolo said.\nMore Trending\nWhen Dembele misses something, look at Luis Enrique’s face. It is not the face of a coach who applauds, who encourages, it is the face of a coach who is sorry, heartbroken, fed up with this kind of failure.\n‘It does not correspond to his football. Luis Enrique is a dictator. He likes things to be square in a certain way. He has a vision, he is dogmatic. Dembele does not fit into the box of players he likes.\n‘Luis Enrique wants a squad with his pawns with him. For him, the players are pawns. There are no humans in front of him, they are pawns. So he will get into trouble with Dembele.\n‘It will last, because it will leave its mark. It is further proof of his communist vision of football. There is not a single head that should stick out. It is the collective. The individual must never go out of the frame.’\nFor more stories like this, check our sport page.\nFollow Metro Sport for the latest news on Facebook, Twitter and Instagram.\nMORE: Harry Kane’s Bayern Munich will be too strong for Aston Villa in Champions League clash\nMORE: Even ‘the worst manager in Premier League history’ is destroying Erik ten Hag and Man Utd\nMORE: Jamie Carragher names the Arsenal star Man City would ideally take out the team",
  "word_count": 699,
  "scraped_at": "2026-02-14T02:25:58.974365",
  "_text_extracted": true
}